{
    "main_text": "Moral Philosophy || The Natural State\n3.3 The Natural State\n\nThe concept of a natural state is so important to Pufendorf’s\ntheory that he considered political tracts which ignore it\n“gravely defective” (Statu #1, 1990, p. 110). The idea is\ndiscussed in no less than five of his works (EJU, DJN, DO, DAS, and\nES), which basically agree on its characterization and distinctions\n(Seidler 1990, Fetscher 1960). DJN alone contains two versions: one\n(II.2) to establish the general need for law and moral authority, and\nthe other (VII.1) to justify civil power or political sovereignty\n(imperium). These two treatments share a common conception of\nlegal obligation as justified imposition by a beneficent superior with\naccess to sanctions. This does not make them redundant, however, even\nif the political institutions created to eliminate the second,\npre-civil state of nature are enjoined by same natural law that also\ncommands (or induces) humans to leave their prior, pre-cultural (and\nbestial) states. Civil sovereignty and its mechanisms are needed\nprecisely because the cooperative institutions (e.g., language,\ncontract, property, marriage, family, household) that lift humans out\nof their previous, natural condition eventually create analogous\ncoordination problems on another level. Indeed, since similar\ndifficulties arise among civil states themselves, in an international\nstate of nature, there is need for yet another solution at that level.\nIn sum, Pufendorf’s conceptions of morality, politics, and\ninternational law are set against analogous natural states at each\nlevel; this facilitates the respective analyses, though the remaining\ndifferences also prevent their standardization.\n\nThe first DJN treatment of the natural state is preceded by a chapter\n(II.1) on the concrete importance of law. This discussion provides a\nbridge between the conceptual analysis of law and obligation, in Book\nI, and the following chapter (II.2) on the natural state, which leads\nin turn to the derivation of the natural law in DJN II.3. In it,\nPufendorf presents a moral anthropology suggesting what kinds of moral\nentities, or what obligations and laws, should be imposed in view of\n“the natural inclinations and pursuits of us mortals” (DJN\nII.1.6; Pufendorf 1994a, p. 138). These reveal – especially in\ncomparison to beasts – that humans’ greater freedom would\nactually be disadvantageous to them without further regulation; that\nis, randomized freedom, or license, is self-defeating. The argument is\nexpectably framed by Pufendorf’s general assumption that such\ncounterproductivity would violate the divine intention of having human\nactions display a certain “order, decorum, or beauty” (DJN\nII.1.5; Pufendorf 1994a, p. 138); however, it is solidly based as well\non a description of observable human tendencies and behaviors. The\nlatter show humans to be weak, diverse, and sometimes perverse: not\nonly are they anxious, ambitious, envious, superstitious, resentful,\nvain, vindictive, and the like; but they often disagree with one\nanother as well, even themselves; and yet (unlike other living things)\nthey are incapable of securing their basic needs without the aid of\ncreatures like themselves. For mutual assistance to be possible,\nhowever, and to avoid the difficulties continually generated by the\ntraits above, human action must be constrained by laws of freedom, as\nit were. Without these, humans would sink below the level of brutes,\nwhose welfare is non-voluntarily secured by physical laws, and they\nwould remain at liberty only to disrupt and destroy one another. This\nsort of inconsistency in human nature was – on religious,\nrational, prudential, and it seems aesthetic grounds –\nunacceptable to Pufendorf.\n\nThe natural state is a theoretical mechanism for further articulating\nthese considerations. A relative notion, it appears in three distinct\nbut overlapping versions, the third of which is specially elaborated\nby the DJN VII.1 account mentioned above. Each version involves a\npolarity or implied contrast: the natural state toward God (ad\nDeum), that in regard to oneself (in se), and that\ntoward other human beings (ad alios homines). The first of\nthese designates the human condition as such, conceived negatively as\na “state of humanity” in contrast to both the amoral state\nof beasts but also “toward [or against] God.” Humans\nemerge from it – using their de facto traits and\ncapacities (which Pufendorf associates with “soul”)\n– by moralizing themselves through social interaction, gradually\narticulating a normative sphere of rights and duties only formally\nimposed by their creator. The second natural state, with respect to\noneself (in se), designates the basic helplessness of\nsolitary humans and their almost inevitable lapse into an\nuncultivated, bestial life without mutual assistance. Classical\naccounts of this state depict individual humans as frustrated in their\nmost basic needs and desires, and as incapable of the refinement\nneeded to develop their distinctive faculties and exercise their\nfreedom. Human interaction can sometimes and to some extent eliminate\nthe natural state in this sense – a process facilitated by their\nprior, and concurrent, emergence from the mere state of humanity. As\nthe third natural state shows, however, humans may also threaten,\nendanger, or interfere with one another unless their freedom is\neffectively restrained by law. Here law means more than the\nself-interpreted moral law already operative in the first two states\nof nature (which, pace Hobbes, are not entirely lawless or amoral);\nrather it refers to civil law which must be imposed by a political\nsuperior with both the authority and the effective power to command.\nHence this natural state is best described as a pre-civil state, in\ncontrast to the pre-cultural and merely human states. Note: in none of\nthe three states does ‘natural’ function normatively in\nthe sense of a model or ideal to be realized, as in some other forms\nof natural law theory. Instead, norms emerge as one leaves such\nnatural conditions.\n\nAs already suggested, the three conditions overlap. Thus, imperfect\nhumans always remain (albeit tenuously) in the initial state of (mere)\nhumanity (DJN II.2.9–10), even when the other two natural states\nhave been partially sublated by culture and politics; for they are\nalways subject to, and somehow responsible for, the norms deriving\nfrom divine imposition or, alternatively, required by and for human\nbeings as such. That is, as neither beasts nor gods, they lack the\nautomatism of the former and the spontaneous goodness of the latter,\nand always carry a fallible burden of judgment, as it were. The latter\ntwo states may coincide as well, though usually incompletely, in that\nhumans may exit a pre-cultural state of need while still in a\npre-civil state of insecurity, or they may enjoy the security of a\ncivil state while relatively deprived of cultural goods. As well, even\nthough need satisfaction and cultural development typically occur\nbefore and apart from political order, in cities as opposed to states,\nthe latter sometimes seem a precondition of the former processes\n– as Pufendorf knew well from the circumstances of the Thirty\nYears War. \n\nThe pre-cultural and pre-civil states of nature especially (i.e.,\nthose conditions respectively lacking in these respects) are further\ndistinguished into full or perfect, and partial or limited versions.\nThe former is purely mythical or hypothetical in that no humans can\nexist without their fellows. Complete non-cooperation or complete\nhostility are simply impossible, since no one would survive, and the\nonly reason to consider such scenarios is as heuristic devices\nhighlighting the conditions that humans actually inhabit (Behme\n2009a). Indeed, as Rousseau would iterate in his own way, extreme\nversions of the natural state are mere extrapolations from the more\nlimited, or mixed, conditions found in actual human history and\nexperience – as when rival families, clans, states, or\n(occasionally) formerly cultivated and civil-ized individuals (e.g.,\nCrusoe), are temporarily left to their own devices. Much of\nPufendorf’s discussion on the topic takes place through critical\ninteraction with Grotius, Hobbes, and Spinoza, whose comments on the\nnatural state he appropriates, alters, or rejects. The paradoxical\nupshot of his examination is that humans as such never were, are, or\nwill be in a pure, full, or perfect natural state, since it would be a\ncompletely barbarous, bellicose, and thus deadly condition. Thus far,\nHobbes was correct. However, as Pufendorf says in rhetorical\nopposition to him, Hobbes rather overstated the case; for the natural\nstate is actually a state of ‘peace’ (DJN II.2.7) –\nalbeit an imperfect, unstable, and insecure peace (DJN II.2.12).\nAccordingly, humans cannot ever – at least in this life –\nentirely leave the natural state (in all three senses) behind, as they\nare always imperfectly socialized, (only) partially cultivated, and\nincompletely or inadequately civil-ized (politic-ized). This explains\ntheir lifelong subjection to moral law and obligation (however\nunderstood), and their need – Pufendorf thought – for some\nsort of civil subjugation. That is, insofar as they manage to survive\nand thrive at all, they do so through incompletely realized forms of\nsocial cooperation that must (in a variety of ways) be constantly\nmaintained and improved.\n",
    "section_title": "3.3 The Natural State",
    "entry_title": "Pufendorf’s Moral and Political Philosophy",
    "hierarchy_title": "Pufendorf’s Moral and Political Philosophy || Moral Philosophy || The Natural State",
    "tokenized_text": [
        "moral",
        "philosophy",
        "natural",
        "state",
        "natural",
        "state",
        "concept",
        "natural",
        "state",
        "important",
        "pufendorf",
        "theory",
        "considered",
        "political",
        "tract",
        "ignore",
        "gravely",
        "defective",
        "statu",
        "p",
        "idea",
        "discussed",
        "le",
        "five",
        "work",
        "eju",
        "djn",
        "da",
        "e",
        "basically",
        "agree",
        "characterization",
        "distinction",
        "seidler",
        "fetscher",
        "djn",
        "alone",
        "contains",
        "two",
        "version",
        "one",
        "ii",
        "establish",
        "general",
        "need",
        "law",
        "moral",
        "authority",
        "vii",
        "justify",
        "civil",
        "power",
        "political",
        "sovereignty",
        "imperium",
        "two",
        "treatment",
        "share",
        "common",
        "conception",
        "legal",
        "obligation",
        "justified",
        "imposition",
        "beneficent",
        "superior",
        "access",
        "sanction",
        "make",
        "redundant",
        "however",
        "even",
        "political",
        "institution",
        "created",
        "eliminate",
        "second",
        "precivil",
        "state",
        "nature",
        "enjoined",
        "natural",
        "law",
        "also",
        "command",
        "induces",
        "human",
        "leave",
        "prior",
        "precultural",
        "bestial",
        "state",
        "civil",
        "sovereignty",
        "mechanism",
        "needed",
        "precisely",
        "cooperative",
        "institution",
        "eg",
        "language",
        "contract",
        "property",
        "marriage",
        "family",
        "household",
        "lift",
        "human",
        "previous",
        "natural",
        "condition",
        "eventually",
        "create",
        "analogous",
        "coordination",
        "problem",
        "another",
        "level",
        "indeed",
        "since",
        "similar",
        "difficulty",
        "arise",
        "among",
        "civil",
        "state",
        "international",
        "state",
        "nature",
        "need",
        "yet",
        "another",
        "solution",
        "level",
        "sum",
        "pufendorf",
        "conception",
        "morality",
        "politics",
        "international",
        "law",
        "set",
        "analogous",
        "natural",
        "state",
        "level",
        "facilitates",
        "respective",
        "analysis",
        "though",
        "remaining",
        "difference",
        "also",
        "prevent",
        "standardization",
        "first",
        "djn",
        "treatment",
        "natural",
        "state",
        "preceded",
        "chapter",
        "ii",
        "concrete",
        "importance",
        "law",
        "discussion",
        "provides",
        "bridge",
        "conceptual",
        "analysis",
        "law",
        "obligation",
        "book",
        "following",
        "chapter",
        "ii",
        "natural",
        "state",
        "lead",
        "turn",
        "derivation",
        "natural",
        "law",
        "djn",
        "ii",
        "pufendorf",
        "present",
        "moral",
        "anthropology",
        "suggesting",
        "kind",
        "moral",
        "entity",
        "obligation",
        "law",
        "imposed",
        "view",
        "natural",
        "inclination",
        "pursuit",
        "u",
        "mortal",
        "djn",
        "ii",
        "pufendorf",
        "a",
        "p",
        "reveal",
        "especially",
        "comparison",
        "beast",
        "human",
        "greater",
        "freedom",
        "would",
        "actually",
        "disadvantageous",
        "without",
        "regulation",
        "randomized",
        "freedom",
        "license",
        "selfdefeating",
        "argument",
        "expectably",
        "framed",
        "pufendorf",
        "general",
        "assumption",
        "counterproductivity",
        "would",
        "violate",
        "divine",
        "intention",
        "human",
        "action",
        "display",
        "certain",
        "order",
        "decorum",
        "beauty",
        "djn",
        "ii",
        "pufendorf",
        "a",
        "p",
        "however",
        "solidly",
        "based",
        "well",
        "description",
        "observable",
        "human",
        "tendency",
        "behavior",
        "latter",
        "show",
        "human",
        "weak",
        "diverse",
        "sometimes",
        "perverse",
        "anxious",
        "ambitious",
        "envious",
        "superstitious",
        "resentful",
        "vain",
        "vindictive",
        "like",
        "often",
        "disagree",
        "one",
        "another",
        "well",
        "even",
        "yet",
        "unlike",
        "living",
        "thing",
        "incapable",
        "securing",
        "basic",
        "need",
        "without",
        "aid",
        "creature",
        "like",
        "mutual",
        "assistance",
        "possible",
        "however",
        "avoid",
        "difficulty",
        "continually",
        "generated",
        "trait",
        "human",
        "action",
        "must",
        "constrained",
        "law",
        "freedom",
        "without",
        "human",
        "would",
        "sink",
        "level",
        "brute",
        "whose",
        "welfare",
        "nonvoluntarily",
        "secured",
        "physical",
        "law",
        "would",
        "remain",
        "liberty",
        "disrupt",
        "destroy",
        "one",
        "another",
        "sort",
        "inconsistency",
        "human",
        "nature",
        "religious",
        "rational",
        "prudential",
        "seems",
        "aesthetic",
        "ground",
        "unacceptable",
        "pufendorf",
        "natural",
        "state",
        "theoretical",
        "mechanism",
        "articulating",
        "consideration",
        "relative",
        "notion",
        "appears",
        "three",
        "distinct",
        "overlapping",
        "version",
        "third",
        "specially",
        "elaborated",
        "djn",
        "vii",
        "account",
        "mentioned",
        "version",
        "involves",
        "polarity",
        "implied",
        "contrast",
        "natural",
        "state",
        "toward",
        "god",
        "ad",
        "deum",
        "regard",
        "oneself",
        "se",
        "toward",
        "human",
        "being",
        "ad",
        "alios",
        "homines",
        "first",
        "designates",
        "human",
        "condition",
        "conceived",
        "negatively",
        "state",
        "humanity",
        "contrast",
        "amoral",
        "state",
        "beast",
        "also",
        "toward",
        "god",
        "human",
        "emerge",
        "using",
        "de",
        "facto",
        "trait",
        "capacity",
        "pufendorf",
        "associate",
        "soul",
        "moralizing",
        "social",
        "interaction",
        "gradually",
        "articulating",
        "normative",
        "sphere",
        "right",
        "duty",
        "formally",
        "imposed",
        "creator",
        "second",
        "natural",
        "state",
        "respect",
        "oneself",
        "se",
        "designates",
        "basic",
        "helplessness",
        "solitary",
        "human",
        "almost",
        "inevitable",
        "lapse",
        "uncultivated",
        "bestial",
        "life",
        "without",
        "mutual",
        "assistance",
        "classical",
        "account",
        "state",
        "depict",
        "individual",
        "human",
        "frustrated",
        "basic",
        "need",
        "desire",
        "incapable",
        "refinement",
        "needed",
        "develop",
        "distinctive",
        "faculty",
        "exercise",
        "freedom",
        "human",
        "interaction",
        "sometimes",
        "extent",
        "eliminate",
        "natural",
        "state",
        "sense",
        "process",
        "facilitated",
        "prior",
        "concurrent",
        "emergence",
        "mere",
        "state",
        "humanity",
        "third",
        "natural",
        "state",
        "show",
        "however",
        "human",
        "may",
        "also",
        "threaten",
        "endanger",
        "interfere",
        "one",
        "another",
        "unless",
        "freedom",
        "effectively",
        "restrained",
        "law",
        "law",
        "mean",
        "selfinterpreted",
        "moral",
        "law",
        "already",
        "operative",
        "first",
        "two",
        "state",
        "nature",
        "pace",
        "hobbes",
        "entirely",
        "lawless",
        "amoral",
        "rather",
        "refers",
        "civil",
        "law",
        "must",
        "imposed",
        "political",
        "superior",
        "authority",
        "effective",
        "power",
        "command",
        "hence",
        "natural",
        "state",
        "best",
        "described",
        "precivil",
        "state",
        "contrast",
        "precultural",
        "merely",
        "human",
        "state",
        "note",
        "none",
        "three",
        "state",
        "natural",
        "function",
        "normatively",
        "sense",
        "model",
        "ideal",
        "realized",
        "form",
        "natural",
        "law",
        "theory",
        "instead",
        "norm",
        "emerge",
        "one",
        "leaf",
        "natural",
        "condition",
        "already",
        "suggested",
        "three",
        "condition",
        "overlap",
        "thus",
        "imperfect",
        "human",
        "always",
        "remain",
        "albeit",
        "tenuously",
        "initial",
        "state",
        "mere",
        "humanity",
        "djn",
        "ii",
        "even",
        "two",
        "natural",
        "state",
        "partially",
        "sublated",
        "culture",
        "politics",
        "always",
        "subject",
        "somehow",
        "responsible",
        "norm",
        "deriving",
        "divine",
        "imposition",
        "alternatively",
        "required",
        "human",
        "being",
        "neither",
        "beast",
        "god",
        "lack",
        "automatism",
        "former",
        "spontaneous",
        "goodness",
        "latter",
        "always",
        "carry",
        "fallible",
        "burden",
        "judgment",
        "latter",
        "two",
        "state",
        "may",
        "coincide",
        "well",
        "though",
        "usually",
        "incompletely",
        "human",
        "may",
        "exit",
        "precultural",
        "state",
        "need",
        "still",
        "precivil",
        "state",
        "insecurity",
        "may",
        "enjoy",
        "security",
        "civil",
        "state",
        "relatively",
        "deprived",
        "cultural",
        "good",
        "well",
        "even",
        "though",
        "need",
        "satisfaction",
        "cultural",
        "development",
        "typically",
        "occur",
        "apart",
        "political",
        "order",
        "city",
        "opposed",
        "state",
        "latter",
        "sometimes",
        "seem",
        "precondition",
        "former",
        "process",
        "pufendorf",
        "knew",
        "well",
        "circumstance",
        "thirty",
        "year",
        "war",
        "precultural",
        "precivil",
        "state",
        "nature",
        "especially",
        "ie",
        "condition",
        "respectively",
        "lacking",
        "respect",
        "distinguished",
        "full",
        "perfect",
        "partial",
        "limited",
        "version",
        "former",
        "purely",
        "mythical",
        "hypothetical",
        "human",
        "exist",
        "without",
        "fellow",
        "complete",
        "noncooperation",
        "complete",
        "hostility",
        "simply",
        "impossible",
        "since",
        "one",
        "would",
        "survive",
        "reason",
        "consider",
        "scenario",
        "heuristic",
        "device",
        "highlighting",
        "condition",
        "human",
        "actually",
        "inhabit",
        "behme",
        "a",
        "indeed",
        "rousseau",
        "would",
        "iterate",
        "way",
        "extreme",
        "version",
        "natural",
        "state",
        "mere",
        "extrapolation",
        "limited",
        "mixed",
        "condition",
        "found",
        "actual",
        "human",
        "history",
        "experience",
        "rival",
        "family",
        "clan",
        "state",
        "occasionally",
        "formerly",
        "cultivated",
        "civilized",
        "individual",
        "eg",
        "crusoe",
        "temporarily",
        "left",
        "device",
        "much",
        "pufendorf",
        "discussion",
        "topic",
        "take",
        "place",
        "critical",
        "interaction",
        "grotius",
        "hobbes",
        "spinoza",
        "whose",
        "comment",
        "natural",
        "state",
        "appropriates",
        "alters",
        "reject",
        "paradoxical",
        "upshot",
        "examination",
        "human",
        "never",
        "pure",
        "full",
        "perfect",
        "natural",
        "state",
        "since",
        "would",
        "completely",
        "barbarous",
        "bellicose",
        "thus",
        "deadly",
        "condition",
        "thus",
        "far",
        "hobbes",
        "correct",
        "however",
        "pufendorf",
        "say",
        "rhetorical",
        "opposition",
        "hobbes",
        "rather",
        "overstated",
        "case",
        "natural",
        "state",
        "actually",
        "state",
        "peace",
        "djn",
        "ii",
        "albeit",
        "imperfect",
        "unstable",
        "insecure",
        "peace",
        "djn",
        "ii",
        "accordingly",
        "human",
        "ever",
        "least",
        "life",
        "entirely",
        "leave",
        "natural",
        "state",
        "three",
        "sens",
        "behind",
        "always",
        "imperfectly",
        "socialized",
        "partially",
        "cultivated",
        "incompletely",
        "inadequately",
        "civilized",
        "politicized",
        "explains",
        "lifelong",
        "subjection",
        "moral",
        "law",
        "obligation",
        "however",
        "understood",
        "need",
        "pufendorf",
        "thought",
        "sort",
        "civil",
        "subjugation",
        "insofar",
        "manage",
        "survive",
        "thrive",
        "incompletely",
        "realized",
        "form",
        "social",
        "cooperation",
        "must",
        "variety",
        "way",
        "constantly",
        "maintained",
        "improved"
    ]
}