{
    "main_text": "Other Pythagoreans of the Sixth, Fifth and Fourth Centuries || The Catalogue of Pythagoreans in Iamblichus’ On the Pythagorean Life: Who Counts as a Pythagorean?\n3.1 The Catalogue of Pythagoreans in Iamblichus’ On the Pythagorean Life: Who Counts as a Pythagorean?\n\nIamblichus’ On the Pythagorean Life (4th c. CE) ends\nwith a catalogue of 218 Pythagorean men organized by city followed by\na list of 17 of the most famous Pythagorean women. Of these 235\nPythagoreans, 145 appear nowhere else in the ancient tradition. This\nimpressive list of names shows the wide impact of Pythagoreanism in\nthe fifth and fourth centuries BCE. To what extent is it reliable? A\nlong line of scholars has argued that the catalogue has close\nconnections to and is likely to be based on Aristoxenus in the fourth\ncentury BCE and is thus a reasonably accurate reflection of early\nPythagoreanism rather than a creation of the later Neopythagorean\ntradition (Rohde 1871–1872, 171; Diels 1965, 23;\nTimpanaro-Cardini 1958-1964, III 38 ff.; Burkert 1972a, 105, n. 40;\nZhmud 2012b, 235–244). This is up to a point a reasonable\nconclusion, since it is hard to see who would have been better placed\nthan Aristoxenus to have such detailed information.\n\nThe arguments connecting Aristoxenus to the catalogue are not\nunassailable, however, and it is likely that the list has been altered\nin transmission, so that it cannot simply be accepted as the testimony\nof Aristoxenus (Huffman 2008a). No names on the list can be positively\nassigned to a date later than Aristoxenus, but this would be likely to\nbe true, even if the list were compiled at a later date, since\nPythagoreanism appears to have largely died out for the two centuries\nimmediately following Aristoxenus’ death. Thus, Iamblichus does\nnot mention any Pythagorean who can be positively dated after the time\nof Aristoxenus anywhere else in On the Pythagorean Life\neither. Scholars have also argued that Iamblichus cannot have composed\nthe catalogue, since he mentions some 18 names that do not appear in\nthe catalogue. This argument would only work, if Iamblichus were a\ncareful and systematic author, which the repetitions and\ninconsistencies in On the Pythagorean Life show that he was\nnot. While it is unlikely that Iamblichus composed the catalogue from\nscratch, it is perfectly possible that he edited it in a number of\nways, while not feeling compelled to make it consistent with\neverything he says elsewhere in the text. There are some peculiarities\nof the catalogue that suggest a connection to Aristoxenus. Philolaus\nand Eurytus are listed not under Croton but under Tarentum, just as\nthey are in one of the Fragments of Aristoxenus (Fr. 19 Wehrli =\nDiogenes Laertius VIII 46). On the other hand, some features of the\ncatalogue are inconsistent with what we know of Aristoxenus.\nAristoxenus’ teacher, Xenophilus, who is identified as from the\nThracian Chalcidice in the Fragments of Aristoxenus (Frs. 18 and 19\nWehrli), is identified as from Cyzicus in the catalogue. Moreover, the\nlegendary figure, Abaris, is included in the catalogue and even said\nto be from the mythical Hyperborea, whereas Aristoxenus is usually\nseen as resolutely trying to rationalize the Pythagorean tradition.\nThus, while Aristoxenus is quite plausibly taken to be the author of\nthe core of the catalogue, it is likely that additions, omissions, and\nvarious changes have been made to the original document and hence it\nis impossible to be sure, in most cases, whether a given name has the\nauthority of Aristoxenus behind it or not.\n\nThe catalogue includes several problematic names, such as Alcmaeon,\nEmpedocles, Parmenides and Melissus. Alcmaeon was active in Croton\nwhen the Pythagoreans flourished there, but Aristotle explicitly\ndistinguishes Alcmaeon from the Pythagoreans and scholarly consensus\nis that he is not a Pythagorean (see the entry on\n Alcmaeon).\n Most scholars would agree that Empedocles was heavily influenced by\nPythagoreanism; in the later tradition fragments of Empedocles are\nroutinely cited to support the Pythagorean doctrines of metempsychosis\nand vegetarianism (e.g., Sextus Empiricus, Adversus\nMathematicos IX 126–30). On the other hand, both in the\nancient and in the modern world, Empedocles is not usually labeled a\nPythagorean, because, whatever the initial Pythagorean influences, he\ndeveloped a philosophical system that was his own original\ncontribution. Parmenides is again not usually identified as a\nPythagorean in either the ancient or modern tradition and, although\nscholars have speculated on Pythagorean influences on Parmenides,\nthere is little that can be identified as overtly Pythagorean in his\nphilosophy. The reason for Parmenides’ inclusion in the\ncatalogue is pretty clearly the tradition that his alleged teacher\nAmeinias was a Pythagorean (Diogenes Laertius IX 21). There is no\nreason to doubt this story, but it gives us no more reason to call\nParmenides a Pythagorean than to call Plato a Socratic or Aristotle a\nPlatonist. It would appear that Melissus was included on the list\nbecause he was regarded in turn as the pupil of Parmenides. Inclusion\nin the catalogue thus need not indicate that a figure lived a\nPythagorean way of life or that he adopted metaphysical principles\nthat were distinctively Pythagorean; he need only have had contact\nwith a Pythagorean teacher. It is possible that Aristoxenus included\nParmenides and Melissus on the list for these reasons or that he had\nbetter reasons for including them (e.g., evidence that they lived a\nPythagorean life), but it is precisely famous names such as these that\nwould be likely to have been added to the list in later times, and\nthey may well not have appeared in Aristoxenus’ catalogue at\nall.\n\nZhmud (2012a, 109–134) has argued that it begs the question to\nuse a doctrinal criterion to identify Pythagoreans. We need to first\nidentify Pythagoreans and then see what their doctrines are.\nAristoxenus’ catalogue of Pythagoreans as preserved in\nIamblichus is the crucial source. Zhmud takes the Pythagoreans on this\nlist whom we can identify (the overwhelming majority are just names\nfor us) and studies their interests and activities in order to arrive\nat a picture of early Pythagoreanism. Of the 235 names Zhmud finds\nonly 15 about whom we know anything significant. Some of these are\nnon-controversial (Hippasus, Philolaus, Eurytus and Archytas).\nHowever, Zhmud puts particular emphasis on a series of figures not\ntypically regarded as Pythagoreans, e.g., Democedes, Alcmaeon, Iccus,\nMenestor,and Hippon. The range of interests of these figures leads him\nto conclude that there is no one characteristic that is shared by all\nPythagoreans and that Wittgestein’s concept of a family\nresemblance should be employed to describe Pythagoreanism. Moreover,\nhis reliance on figures like Alcmaeon and Menestor leads him to the\nsurprising conclusion that natural science and medicine were more\nimportant than mathematics for the philosophical views of early\nPythagoreans (2012a, 23). The foundation for this view of early\nPythagoreanism is problematic since the scholarly consensus is that\nAlcmaeon was not a Pythagorean and it is also far from certain that\nMenestor was a Pythagorean (see below). As argued above,\nIamblichus’ catalogue cannot be used mechanically as a guarantee\nthat a given figure was a Pythagorean, because we cannot be sure that\nit always reflects Aristoxenus. What criteria should then be used?\n\nFirst, anyone identified as a Pythagorean by an early source\nuncontaminated by the Neopythagorean glorification of Pythagoras (see\nbelow) can be regarded as a Pythagorean. This would include sources\ndating before the early Academy (ca. 350 BCE), where Neopythagoreanism\nhas its origin, and Peripatetic sources contemporary with the early\nAcademy (ca. 350–300 BCE, e.g., Aristotle, Aristoxenus and\nEudemus), who, under the influence of Aristotle, defined themselves in\nopposition to the Academic view of Pythagoras.\n\nSecond, a doctrinal criterion is applicable. Anyone who espouses the\nphilosophy assigned to the Pythagoreans by Aristotle can be regarded\nas a Pythagorean, although Aristotle presents that philosophy under an\ninterpretation that must be taken into account. It is important that\nthe use of such a doctrinal criterion be limited to quite specific\ndoctrines such as limiters and unlimiteds as first principles and the\ncosmology that includes the counter-earth and central fire.\nParticularly to be avoided is the assumption that any early\nmathematician or any early figure who assigns mathematical ideas a\nrole in the cosmos is a Pythagorean. Mathematicians such as Theodorus\nof Cyrene (who is included in Iamblichus’ catalogue) and\nHippocrates of Chios (who is not) are not treated as Pythagoreans in\nthe early sources such as Plato, Aristotle and Eudemus, and there is\naccordingly no good reason to call them Pythagoreans. Similarly, the\nsculptor, Polyclitus of Argos, stated that “the good comes to be\n… through many numbers,” (Fr. 2 DK), but no ancient\nsource calls him a Pythagorean (Huffman 2002). As Burkert has\nemphasized, mathematics is a Greek and not just a specifically\nPythagorean passion (1972a, 427).\n\nThird, anyone universally (or almost universally) called a Pythagorean\nby later sources, and whom early sources do not treat as independent\nof Pythagoreanism, explicitly or implicitly, can be regarded as a\nPythagorean. This would include figures embedded in the biographical\ntradition about Pythagoras and the early Pythagoreans, such as the\nhusband and wife, Myllias and Timycha.\n\nThis last criterion is more subjective than the first two and\ndifficult cases arise. The fifth-century botanist Menestor (DK I 375)\nis discussed by Theophrastus and called one of “the old natural\nphilosophers” (CP VI 3.5) with no mention of any\nPythagoreanism. In this case, the inclusion of a Menestor in\nIamblichus’ catalogue is not enough reason to regard\nTheophrastus’ Menestor as a Pythagorean. On the other hand,\nalthough Aristotle treats Hippasus separately from the Pythagoreans,\nas he does Archytas, the almost universal identification of Hippasus\nas a Pythagorean in the later tradition and his deep involvement in\nthe biography of early Pythagoreanism, show that he should be regarded\nas a Pythagorean (on Hippasus, see section 3.4 below). The\nfifth-century figure Hippo (DK I 385), who is derided by Aristotle and\npaired with Thales as positing water as the first principle\n(Metaph. 984a3), is a particularly difficult case. An Hippo\nis listed in Iamblichus’ catalogue under Samos and Censorinus\ntells us that Aristoxenus assigned Hippo to Samos rather than\nMetapontum (DK I 385.4–5). This makes it look as if Aristoxenus\nmay be responsible for including Hippo in the catalogue. Burkert has\nalso tried to demonstrate connections between Hippo’s philosophy\nand that of the Pythagoreans (1972a, 290, n. 62). On the other hand,\nneither Aristotle nor Theophrastus nor any of the Aristotelian\ncommentators call him a Pythagorean and the doxographers describe this\nHippo as from Rhegium (e.g., Hippolytus in DK I 385.17). It is thus\nnot clear whether we are dealing with one person or two people named\nHippo and it is doubtful that the Hippo discussed by the Peripatetics\nwas a Pythagorean (Zhmud regards Hippo as well as Menestor and\nTheodorus as Pythagoreans — 2012a, 126–128). Those figures\nof the sixth, fifth and fourth century who have the best claim to be\nconsidered Pythagoreans will be discussed in the following\nsections.\n",
    "section_title": "3.1 The Catalogue of Pythagoreans in Iamblichus’ On the Pythagorean Life: Who Counts as a Pythagorean?",
    "entry_title": "Pythagoreanism",
    "hierarchy_title": "Pythagoreanism || Other Pythagoreans of the Sixth, Fifth and Fourth Centuries || The Catalogue of Pythagoreans in Iamblichus’ On the Pythagorean Life: Who Counts as a Pythagorean?",
    "tokenized_text": [
        "pythagoreans",
        "sixth",
        "fifth",
        "fourth",
        "century",
        "catalogue",
        "pythagoreans",
        "iamblichus",
        "pythagorean",
        "life",
        "count",
        "pythagorean",
        "catalogue",
        "pythagoreans",
        "iamblichus",
        "pythagorean",
        "life",
        "count",
        "pythagorean",
        "iamblichus",
        "pythagorean",
        "life",
        "th",
        "c",
        "ce",
        "end",
        "catalogue",
        "pythagorean",
        "men",
        "organized",
        "city",
        "followed",
        "list",
        "famous",
        "pythagorean",
        "woman",
        "pythagoreans",
        "appear",
        "nowhere",
        "else",
        "ancient",
        "tradition",
        "impressive",
        "list",
        "name",
        "show",
        "wide",
        "impact",
        "pythagoreanism",
        "fifth",
        "fourth",
        "century",
        "bce",
        "extent",
        "reliable",
        "long",
        "line",
        "scholar",
        "argued",
        "catalogue",
        "close",
        "connection",
        "likely",
        "based",
        "aristoxenus",
        "fourth",
        "century",
        "bce",
        "thus",
        "reasonably",
        "accurate",
        "reflection",
        "early",
        "pythagoreanism",
        "rather",
        "creation",
        "later",
        "neopythagorean",
        "tradition",
        "rohde",
        "diels",
        "timpanarocardini",
        "iii",
        "ff",
        "burkert",
        "a",
        "n",
        "zhmud",
        "b",
        "point",
        "reasonable",
        "conclusion",
        "since",
        "hard",
        "see",
        "would",
        "better",
        "placed",
        "aristoxenus",
        "detailed",
        "information",
        "argument",
        "connecting",
        "aristoxenus",
        "catalogue",
        "unassailable",
        "however",
        "likely",
        "list",
        "altered",
        "transmission",
        "simply",
        "accepted",
        "testimony",
        "aristoxenus",
        "huffman",
        "a",
        "name",
        "list",
        "positively",
        "assigned",
        "date",
        "later",
        "aristoxenus",
        "would",
        "likely",
        "true",
        "even",
        "list",
        "compiled",
        "later",
        "date",
        "since",
        "pythagoreanism",
        "appears",
        "largely",
        "died",
        "two",
        "century",
        "immediately",
        "following",
        "aristoxenus",
        "death",
        "thus",
        "iamblichus",
        "mention",
        "pythagorean",
        "positively",
        "dated",
        "time",
        "aristoxenus",
        "anywhere",
        "else",
        "pythagorean",
        "life",
        "either",
        "scholar",
        "also",
        "argued",
        "iamblichus",
        "composed",
        "catalogue",
        "since",
        "mention",
        "name",
        "appear",
        "catalogue",
        "argument",
        "would",
        "work",
        "iamblichus",
        "careful",
        "systematic",
        "author",
        "repetition",
        "inconsistency",
        "pythagorean",
        "life",
        "show",
        "unlikely",
        "iamblichus",
        "composed",
        "catalogue",
        "scratch",
        "perfectly",
        "possible",
        "edited",
        "number",
        "way",
        "feeling",
        "compelled",
        "make",
        "consistent",
        "everything",
        "say",
        "elsewhere",
        "text",
        "peculiarity",
        "catalogue",
        "suggest",
        "connection",
        "aristoxenus",
        "philolaus",
        "eurytus",
        "listed",
        "croton",
        "tarentum",
        "one",
        "fragment",
        "aristoxenus",
        "fr",
        "wehrli",
        "diogenes",
        "laertius",
        "viii",
        "hand",
        "feature",
        "catalogue",
        "inconsistent",
        "know",
        "aristoxenus",
        "aristoxenus",
        "teacher",
        "xenophilus",
        "identified",
        "thracian",
        "chalcidice",
        "fragment",
        "aristoxenus",
        "fr",
        "wehrli",
        "identified",
        "cyzicus",
        "catalogue",
        "moreover",
        "legendary",
        "figure",
        "abaris",
        "included",
        "catalogue",
        "even",
        "said",
        "mythical",
        "hyperborea",
        "whereas",
        "aristoxenus",
        "usually",
        "seen",
        "resolutely",
        "trying",
        "rationalize",
        "pythagorean",
        "tradition",
        "thus",
        "aristoxenus",
        "quite",
        "plausibly",
        "taken",
        "author",
        "core",
        "catalogue",
        "likely",
        "addition",
        "omission",
        "various",
        "change",
        "made",
        "original",
        "document",
        "hence",
        "impossible",
        "sure",
        "case",
        "whether",
        "given",
        "name",
        "authority",
        "aristoxenus",
        "behind",
        "catalogue",
        "includes",
        "several",
        "problematic",
        "name",
        "alcmaeon",
        "empedocles",
        "parmenides",
        "melissus",
        "alcmaeon",
        "active",
        "croton",
        "pythagoreans",
        "flourished",
        "aristotle",
        "explicitly",
        "distinguishes",
        "alcmaeon",
        "pythagoreans",
        "scholarly",
        "consensus",
        "pythagorean",
        "see",
        "entry",
        "alcmaeon",
        "scholar",
        "would",
        "agree",
        "empedocles",
        "heavily",
        "influenced",
        "pythagoreanism",
        "later",
        "tradition",
        "fragment",
        "empedocles",
        "routinely",
        "cited",
        "support",
        "pythagorean",
        "doctrine",
        "metempsychosis",
        "vegetarianism",
        "eg",
        "sextus",
        "empiricus",
        "adversus",
        "mathematicos",
        "ix",
        "hand",
        "ancient",
        "modern",
        "world",
        "empedocles",
        "usually",
        "labeled",
        "pythagorean",
        "whatever",
        "initial",
        "pythagorean",
        "influence",
        "developed",
        "philosophical",
        "system",
        "original",
        "contribution",
        "parmenides",
        "usually",
        "identified",
        "pythagorean",
        "either",
        "ancient",
        "modern",
        "tradition",
        "although",
        "scholar",
        "speculated",
        "pythagorean",
        "influence",
        "parmenides",
        "little",
        "identified",
        "overtly",
        "pythagorean",
        "philosophy",
        "reason",
        "parmenides",
        "inclusion",
        "catalogue",
        "pretty",
        "clearly",
        "tradition",
        "alleged",
        "teacher",
        "ameinias",
        "pythagorean",
        "diogenes",
        "laertius",
        "ix",
        "reason",
        "doubt",
        "story",
        "give",
        "u",
        "reason",
        "call",
        "parmenides",
        "pythagorean",
        "call",
        "plato",
        "socratic",
        "aristotle",
        "platonist",
        "would",
        "appear",
        "melissus",
        "included",
        "list",
        "regarded",
        "turn",
        "pupil",
        "parmenides",
        "inclusion",
        "catalogue",
        "thus",
        "need",
        "indicate",
        "figure",
        "lived",
        "pythagorean",
        "way",
        "life",
        "adopted",
        "metaphysical",
        "principle",
        "distinctively",
        "pythagorean",
        "need",
        "contact",
        "pythagorean",
        "teacher",
        "possible",
        "aristoxenus",
        "included",
        "parmenides",
        "melissus",
        "list",
        "reason",
        "better",
        "reason",
        "including",
        "eg",
        "evidence",
        "lived",
        "pythagorean",
        "life",
        "precisely",
        "famous",
        "name",
        "would",
        "likely",
        "added",
        "list",
        "later",
        "time",
        "may",
        "well",
        "appeared",
        "aristoxenus",
        "catalogue",
        "zhmud",
        "a",
        "argued",
        "begs",
        "question",
        "use",
        "doctrinal",
        "criterion",
        "identify",
        "pythagoreans",
        "need",
        "first",
        "identify",
        "pythagoreans",
        "see",
        "doctrine",
        "aristoxenus",
        "catalogue",
        "pythagoreans",
        "preserved",
        "iamblichus",
        "crucial",
        "source",
        "zhmud",
        "take",
        "pythagoreans",
        "list",
        "identify",
        "overwhelming",
        "majority",
        "name",
        "u",
        "study",
        "interest",
        "activity",
        "order",
        "arrive",
        "picture",
        "early",
        "pythagoreanism",
        "name",
        "zhmud",
        "find",
        "know",
        "anything",
        "significant",
        "noncontroversial",
        "hippasus",
        "philolaus",
        "eurytus",
        "archytas",
        "however",
        "zhmud",
        "put",
        "particular",
        "emphasis",
        "series",
        "figure",
        "typically",
        "regarded",
        "pythagoreans",
        "eg",
        "democedes",
        "alcmaeon",
        "iccus",
        "menestor",
        "hippon",
        "range",
        "interest",
        "figure",
        "lead",
        "conclude",
        "one",
        "characteristic",
        "shared",
        "pythagoreans",
        "wittgestein",
        "concept",
        "family",
        "resemblance",
        "employed",
        "describe",
        "pythagoreanism",
        "moreover",
        "reliance",
        "figure",
        "like",
        "alcmaeon",
        "menestor",
        "lead",
        "surprising",
        "conclusion",
        "natural",
        "science",
        "medicine",
        "important",
        "mathematics",
        "philosophical",
        "view",
        "early",
        "pythagoreans",
        "a",
        "foundation",
        "view",
        "early",
        "pythagoreanism",
        "problematic",
        "since",
        "scholarly",
        "consensus",
        "alcmaeon",
        "pythagorean",
        "also",
        "far",
        "certain",
        "menestor",
        "pythagorean",
        "see",
        "argued",
        "iamblichus",
        "catalogue",
        "used",
        "mechanically",
        "guarantee",
        "given",
        "figure",
        "pythagorean",
        "sure",
        "always",
        "reflects",
        "aristoxenus",
        "criterion",
        "used",
        "first",
        "anyone",
        "identified",
        "pythagorean",
        "early",
        "source",
        "uncontaminated",
        "neopythagorean",
        "glorification",
        "pythagoras",
        "see",
        "regarded",
        "pythagorean",
        "would",
        "include",
        "source",
        "dating",
        "early",
        "academy",
        "ca",
        "bce",
        "neopythagoreanism",
        "origin",
        "peripatetic",
        "source",
        "contemporary",
        "early",
        "academy",
        "ca",
        "bce",
        "eg",
        "aristotle",
        "aristoxenus",
        "eudemus",
        "influence",
        "aristotle",
        "defined",
        "opposition",
        "academic",
        "view",
        "pythagoras",
        "second",
        "doctrinal",
        "criterion",
        "applicable",
        "anyone",
        "espouses",
        "philosophy",
        "assigned",
        "pythagoreans",
        "aristotle",
        "regarded",
        "pythagorean",
        "although",
        "aristotle",
        "present",
        "philosophy",
        "interpretation",
        "must",
        "taken",
        "account",
        "important",
        "use",
        "doctrinal",
        "criterion",
        "limited",
        "quite",
        "specific",
        "doctrine",
        "limiter",
        "unlimiteds",
        "first",
        "principle",
        "cosmology",
        "includes",
        "counterearth",
        "central",
        "fire",
        "particularly",
        "avoided",
        "assumption",
        "early",
        "mathematician",
        "early",
        "figure",
        "assigns",
        "mathematical",
        "idea",
        "role",
        "cosmos",
        "pythagorean",
        "mathematician",
        "theodorus",
        "cyrene",
        "included",
        "iamblichus",
        "catalogue",
        "hippocrates",
        "chios",
        "treated",
        "pythagoreans",
        "early",
        "source",
        "plato",
        "aristotle",
        "eudemus",
        "accordingly",
        "good",
        "reason",
        "call",
        "pythagoreans",
        "similarly",
        "sculptor",
        "polyclitus",
        "argo",
        "stated",
        "good",
        "come",
        "many",
        "number",
        "fr",
        "dk",
        "ancient",
        "source",
        "call",
        "pythagorean",
        "huffman",
        "burkert",
        "emphasized",
        "mathematics",
        "greek",
        "specifically",
        "pythagorean",
        "passion",
        "a",
        "third",
        "anyone",
        "universally",
        "almost",
        "universally",
        "called",
        "pythagorean",
        "later",
        "source",
        "early",
        "source",
        "treat",
        "independent",
        "pythagoreanism",
        "explicitly",
        "implicitly",
        "regarded",
        "pythagorean",
        "would",
        "include",
        "figure",
        "embedded",
        "biographical",
        "tradition",
        "pythagoras",
        "early",
        "pythagoreans",
        "husband",
        "wife",
        "myllias",
        "timycha",
        "last",
        "criterion",
        "subjective",
        "first",
        "two",
        "difficult",
        "case",
        "arise",
        "fifthcentury",
        "botanist",
        "menestor",
        "dk",
        "discussed",
        "theophrastus",
        "called",
        "one",
        "old",
        "natural",
        "philosopher",
        "cp",
        "vi",
        "mention",
        "pythagoreanism",
        "case",
        "inclusion",
        "menestor",
        "iamblichus",
        "catalogue",
        "enough",
        "reason",
        "regard",
        "theophrastus",
        "menestor",
        "pythagorean",
        "hand",
        "although",
        "aristotle",
        "treat",
        "hippasus",
        "separately",
        "pythagoreans",
        "archytas",
        "almost",
        "universal",
        "identification",
        "hippasus",
        "pythagorean",
        "later",
        "tradition",
        "deep",
        "involvement",
        "biography",
        "early",
        "pythagoreanism",
        "show",
        "regarded",
        "pythagorean",
        "hippasus",
        "see",
        "section",
        "fifthcentury",
        "figure",
        "hippo",
        "dk",
        "derided",
        "aristotle",
        "paired",
        "thales",
        "positing",
        "water",
        "first",
        "principle",
        "metaph",
        "a",
        "particularly",
        "difficult",
        "case",
        "hippo",
        "listed",
        "iamblichus",
        "catalogue",
        "samos",
        "censorinus",
        "tell",
        "u",
        "aristoxenus",
        "assigned",
        "hippo",
        "samos",
        "rather",
        "metapontum",
        "dk",
        "make",
        "look",
        "aristoxenus",
        "may",
        "responsible",
        "including",
        "hippo",
        "catalogue",
        "burkert",
        "also",
        "tried",
        "demonstrate",
        "connection",
        "hippo",
        "philosophy",
        "pythagoreans",
        "a",
        "n",
        "hand",
        "neither",
        "aristotle",
        "theophrastus",
        "aristotelian",
        "commentator",
        "call",
        "pythagorean",
        "doxographers",
        "describe",
        "hippo",
        "rhegium",
        "eg",
        "hippolytus",
        "dk",
        "thus",
        "clear",
        "whether",
        "dealing",
        "one",
        "person",
        "two",
        "people",
        "named",
        "hippo",
        "doubtful",
        "hippo",
        "discussed",
        "peripatetic",
        "pythagorean",
        "zhmud",
        "regard",
        "hippo",
        "well",
        "menestor",
        "theodorus",
        "pythagoreans",
        "a",
        "figure",
        "sixth",
        "fifth",
        "fourth",
        "century",
        "best",
        "claim",
        "considered",
        "pythagoreans",
        "discussed",
        "following",
        "section"
    ]
}