{
    "main_text": "Utilitarianism: Thought and Action\n5. Intellectualism: External Knowledge and Inquiry\n\nA protuberant ideational strand that made up the Qing philosophical\nuniverse was the affirmative outlook regarding discursive knowledge\nand intellectual pursuit of the dao as the Way of the\nexterior world, supplanting the introspective endeavor and spiritual\ncontemplation aimed at internal enlightenment and realization. A word\nhere about the socio-political context of this shift is necessary. The\nintellectualist reorientation that characterized the Ming-Qing\ntransition owed much to the literati’s conception of the\npalpable political, social, and economic problems of dynastic decline,\nwhich eventuated in the fall of the Ming and the establishment of a\nconquest dynasty. As they saw it, the root cause of dynastic\ndeclension and demise was the pervasive moral and spiritual\ndegeneration brought on by the intellectual bankruptcy of the late\nMing, as learning and thinking fell under the pernicious sway of empty\nintuitionism and internal introspection. A moribund culture and a weak\nstate could only be reinvigorated with the right kind of learning that\nwas concrete, practical, and substantive. This culture of criticism as\na result placed a premium on the classics, the actual words of the\nancient sages as the substantive source of authority. Antiquity\nitself, personified by the efficacious virtuous deeds of the sages,\nserved as the exemplar of order and amelioration. As particular\nattention was lavished on the thorough, literal understanding of these\ntexts and words, an intellectualist philosophical outlook emerged in\nthe world of thought and learning. Yü Ying-shih has famously\nlabeled this outlook “intellectualism”, which is an\nideal-type thinking abstracted from the Confucian quest for “the\nway of inquiry and learning” (dao wenxue), in\ncontradistinction to the anti-intellectualist enterprise of\n“honoring the heaven-endowed moral virtuous nature”\n(zun dexing). The former sought data and corroborations of\nrealities in the external realm of myriad phenomena and things,\nwhereas the latter appealed intuitively to the internal realm of\none’s very nature, whose quiddity was morally good, insofar as\nit was endowed by heaven. If Song-Ming philosophical thought was\ncharacterized by its identification with inner moral reckoning and\nawakening, then the Qing counterpart was marked by its special\nfocusing on external, objective knowledge, whose basis and point of\ndeparture were the classical texts as objects of cognitive\ninquiries.\n\nYet, the point must be made that embedded in this rupture was\ncontinuity in some important ways. The entire Song-Ming tradition of\nthought was no doubt subjected to wholesale reexamination, but to\nbegin with, the basis of their criticism and construction stemmed from\na well-established preexisting strand of learning. One famous Song\ndefinition of the quintessence of the Confucian tradition by Liu Yi\n(1017–1086) identified the three principal components of\nti (substance, essence, spirit, principle, core, and soul),\nyong (function, utility, practicality, application, action,\nand effort) and wen (literature, writings, philology,\nbelles-lettres, textual learning, classical studies). Together, they\nconstituted the goals and contents of Confucian learning. Qing\nintellectualism focused on the primacy of wen as a central\nmanifestation of yong. Moreover, the scholars, despite their\ngeneral discontent with what they perceived to be empty and recondite\nSong-Ming learning and their desire to reform it, continued to\ndelineate their scholarly and philosophical allegiance in terms of\nassociation with the two schools of Neo-Confucianism: the so-called\nCheng-Zhu school and Lu-Wang school. In fact, many of them engaged in\nintellectualist enterprises precisely for the purpose of wielding\nphilology as a weapon to defend their philosophical views while at the\nsame time seeking to weaken and demolish those of their opponents.\n\n\nNevertheless, even though Qing intellectualism was an outgrowth of the\nConfucian tradition with a time-worn pedigree, it was also new in the\nsense that the kaozheng (evidential research) movement and\nmethodology, the utmost expression of the intellectualist spirit, by\nvirtue of its intellectual scale and density, wrought an epochal\nbreakthrough. It came to be inescapably and unmistakably identified\nwith the special Qing way of construing reality and the world.\nKaozheng scholarship opened up hermeneutic issues of\ninterpretation. As Benjamin Elman has pointed out, the classics as a\nwhole were unproblematically recognized as assent-eliciting cultural\nand textual capital, but once they were subjected to interrogation as\nindividual separate texts, dissent and disquiet arose. The\nauthenticity of some texts came to be questioned; their places in the\nheterogeneous commentarial came to be debated; their authority came to\nbe reassessed; and the manner of retrieving the antique messages came\nto be argued. In short, the classics were historicized. Moreover, what\nbegan as studies of the classics spilled over into other areas of\ninquiry—bronze artifacts, pre-Qin thinkers and texts, history,\ngeography, cosmology, science, and so on.\n\nGu Yanwu, in the early Qing, asserted that the study of principle\n\n(lixue) was irredeemably contracted to the study of the\nclassics (jingxue). According to him, in ancient times, any\nstudy of principle was perforce an investigation of the classics, in\nwhich the basis and operation of principle could be discerned and\nunderstood. Hence his research of ancient phonology: \n\n\nI think that the study of the Nine Classics should begin with textual\nanalysis, and the study of textual analysis should begin with a\nknowledge of phonology. It is the same with the study of all the\nvarious philosophers and the hundred schools. (Gu GTLSWJ: 76) \n\n\nGu criticized his contemporaries for pursuing what was to him empty\nand abstract “Chan Buddhist learning” (Chanxue),\nsince they relied on the “records of dialogues”\n(yulu) of the Song-Ming scholars and ignored the classics,\nwhich were the ben of learning, that is, the root, substance,\nand basis. He rejected the totalizing methodology of yiguan zhi\nfa (the way of connecting everything), which was the\nepistemological orientation of Song-Ming learning that eschewed and\nswamped concrete particulars. Instead, Gu called for “duoxue\ner shi (to get to know through multifarious learning)” and\n“duojian er shi (to get to know through multifarious\nobservation)”, such that one achieved “boxue yu\nwen (erudition in all writings)” (Gu GTLSWJ: 43–44).\nTo him, the classics recorded and consisted of nothing but “what\nthe sages had heard and seen (shengren suowen suojian)”\n(Gu RZL: 37–38). His intellectualist stance was a classic\nexpression of “following the way of learning and inquiry”\n(dao wenxue), involving empirical observations and\npainstaking accumulation of broad knowledge.\n\nHuang Zongxi, as a self-touted follower of the Lu-Wang tradition, made\na point to reinterpret Wang Yangming’s central idea of\n“zhi liangzhi” (extending spontaneous moral\nknowing to the utmost) in intellectualist terms. While Wang tended to\nthink that knowledge must be grasped in terms of the ultimate\nsubstance of one’s own mind-heart and could not be made clear in\nwords, thereby casting doubt on the efficacy of words and discursive\npractices, Huang spoke on behalf of the Ming master by claiming that\nthe act of “extending” (zhi) innate moral knowing\nwas practice, that is, the very act of “broad learning,\nexamining and inquiring, deliberation with utmost care, and\nidentifying differences clearly are all practices” (Huang MRXA:\nv.2, p. 53). Later, Quan Zuwang (1705–1755), an admirer of\nHuang’s scholarship, would offer this encomium by citing\nHuang’s words: \n\n\n[Huang] once said, “The profession of [studying] the classics is\nfor the ordering of the world (ordering the world).” Therefore,\nhe did not pursue the learning of the petty Confucians but commanded\n[himself] to study the classics and history. He also said,\n“Without [such] study, the changes and transformations of\nprinciple (i) cannot be verified”. (quoted in Gu\nQingmei 1978: 118)\n\n\nWang Fuzhi also repudiated the Neo-Confucian epistemological\nassertions of the possibility of mingjie (esoteric\nunderstanding) and miaowu (mysterious enlightenment), both\nwhich were anti-intellectualist in conception, in that they referred\nto direct intuitive apprehension of the truth without the intervention\nof actual study. He insisted that “the principles of the\nmultitudinous things cannot be known without learning and cannot be\ndistinguished without erudition”. Knowledge, for Wang, came from\nour direct engagement with and experience of the “changing\nexternal forms” (kexing) in the universe, such as \n\n\nthe rising, setting, waning, and waxing of the sun and moon, and the\nsuccession of the seasons, the birth and death of the myriad things,\nand wind, rain, dew, and thunder. (quoted in Hou Wailu 1958, 108) \n\n\nHe claimed that \n\n\nwhen a thing is known, then its name is known. When its name is known,\nthen its significance is known. Without contact with things, even if\nthe mind-heart is imbued with its innate ability, [it] cannot name the\nnames, and things cannot be accomplished. (ibid., 108***see\nprevious*) \n\n\nWang thus argued strongly in favor of “investigation of\nthings” (gewu), which employed both the mind-heart, and\nour senses of hearing and seeing, that is, empirical observation. He\ndefined their inexorable interrelation and interaction in the quest\nfor knowledge: \n\n\nThe effort of the investigation of things employs both the faculty of\nthe mind-heart, and hearing and seeing. Study and inquiry are the\nmainstay, aided by thinking and distinguishing between\ndifferences…. Hearing and seeing are the resources for the\nfunctioning of the mind-heart, setting the direction for it to follow.\n(quoted in Ji Wenfu 1978: 45) \n\n\nWang’s theory of knowledge affirmed the irreducibility of\ndiscursive knowledge gained thorough investigating things—study\nand inquiry—to morality spontaneously apprehended by the\nmind-heart.\n\nIn the eighteenth century, when the kaozheng (evidential\nresearch) movement held sway, the common consensus was that learning\nmust be concrete and empirical. The ultimate goal was to retrieve and\nrestore, via philological explications (xungu), the pristine\nand unadulterated meanings of the sages’ words, so that their\nmoral meanings (yili) could come to the fore, crystal clear.\nQian Daxin said it well: \n\n\nThere are first writings and words (wenzi) and then there are\nphilological explications of the classics. There are first\nphilological explications and then there are moral principles.\nPhilological explications of the classics are the sources from which\nmoral meanings are derived. (Qian QYTWJ: 349) \n\n\nHe asked, \n\n\nUnder heaven, is there any endeavor that abandons study and inquiry\nand specifically pursues the reverent realization of one’s moral\nnature? (QYTWJ: 245) \n\n\nHere, he explicitly affirmed the importance of following the way of\ninquiry and learning, warning against exclusive focus on the\nrealization of our putatively moral nature. This intellectualist\nstance was shared by Dai Zhen, who also waxed rhetorical: \n\n\nBut if the pursuit of study and inquiry was abandoned, would it then\nbe possible to lead a life for the reverent realization of one’s\nmoral nature? (Dai DZWJ: 140) \n\n\nFor Dai, to study and inquire was to “hear the dao\n(wendao)” (DZWJ: 145). Thus, the intellectualist quest\nwas antecedent to any attempt to apprehend principle and the nature:\n\n\n\nTo seek the most appropriate [principles] means that knowledge comes\nfirst. In no way does sagely learning ever call for eliminating\nselfishness without also seeking to remove befuddlement, or\nemphasizing action without first emphasizing knowledge. (quoted in\nYü Ying-shih 1982: 389) \n\n\nTo put it plainly, “moral nature… feeds on learning and\ninquiry in order to develop sagely intelligence” (quoted in\n1982: 390).\n\nZhang Xuecheng shared the kaozheng scholars’ enthusiasm\nfor concrete and critical study of the classics (which he regarded as\nhistories) and their aversion toward esoteric moral speculation. He\nstated, “The ancients never did talk about principle removed\nfrom things and affairs”, and “those who talk about nature\nand heaven’s mandate must study history” (quoted in\nYü Ying-shih 1976: 46). Like Huang Zongxi, he redefined, in\nintellectualist terms, what Wang Yangming’s notion of zhi\nliangzhi (extending spontaneous moral knowing to the utmost)\nmeant. Wang’s liangzhi was innate, spontaneous,\nineffable, and intuitive, realizable through internal introspection.\nBy contrast, Zhang’s version referred to “what a learner\nconsidered to be closest to his talents (cai) [and]…\naffective and emotive predispositions (xingqing)”, both\nof which were natural predispositions “to learn”\n(xue). On the other hand, Zhang explained the notion of\n“extending” zhi as “the learner’s\neffort to search for knowledge” (xuezhe qiuzhi zhi\ngong) (quoted in Yü Ying-shih 1976: 79–80).\n\nIn sum, intellectualism, as a leitmotif in the constellation of Qing\nphilosophy, expresses itself in two ways. As a methodology, it\nreferred to the pursuit of inferential and empirical knowledge, most\nprominently manifested in textual philological research. As a\nphilosophical outlook, it reevaluated and revised the central\nNeo-Confucian notion of internal self-cultivation aimed at spontaneous\nrealization of the heaven-endowed moral nature, arguing instead in\nfavor of the quest for external knowledge mediated by the noetic\nsenses. Intellectual cognitive faculties would take precedence over\nthe intuitive power of the mind-heart.\n",
    "section_title": "5. Intellectualism: External Knowledge and Inquiry",
    "entry_title": "Qing Philosophy",
    "hierarchy_title": "Qing Philosophy || Utilitarianism: Thought and Action",
    "tokenized_text": [
        "utilitarianism",
        "thought",
        "action",
        "intellectualism",
        "external",
        "knowledge",
        "inquiry",
        "protuberant",
        "ideational",
        "strand",
        "made",
        "qing",
        "philosophical",
        "universe",
        "affirmative",
        "outlook",
        "regarding",
        "discursive",
        "knowledge",
        "intellectual",
        "pursuit",
        "dao",
        "way",
        "exterior",
        "world",
        "supplanting",
        "introspective",
        "endeavor",
        "spiritual",
        "contemplation",
        "aimed",
        "internal",
        "enlightenment",
        "realization",
        "word",
        "sociopolitical",
        "context",
        "shift",
        "necessary",
        "intellectualist",
        "reorientation",
        "characterized",
        "mingqing",
        "transition",
        "owed",
        "much",
        "literati",
        "conception",
        "palpable",
        "political",
        "social",
        "economic",
        "problem",
        "dynastic",
        "decline",
        "eventuated",
        "fall",
        "ming",
        "establishment",
        "conquest",
        "dynasty",
        "saw",
        "root",
        "cause",
        "dynastic",
        "declension",
        "demise",
        "pervasive",
        "moral",
        "spiritual",
        "degeneration",
        "brought",
        "intellectual",
        "bankruptcy",
        "late",
        "ming",
        "learning",
        "thinking",
        "fell",
        "pernicious",
        "sway",
        "empty",
        "intuitionism",
        "internal",
        "introspection",
        "moribund",
        "culture",
        "weak",
        "state",
        "could",
        "reinvigorated",
        "right",
        "kind",
        "learning",
        "concrete",
        "practical",
        "substantive",
        "culture",
        "criticism",
        "result",
        "placed",
        "premium",
        "classic",
        "actual",
        "word",
        "ancient",
        "sage",
        "substantive",
        "source",
        "authority",
        "antiquity",
        "personified",
        "efficacious",
        "virtuous",
        "deed",
        "sage",
        "served",
        "exemplar",
        "order",
        "amelioration",
        "particular",
        "attention",
        "lavished",
        "thorough",
        "literal",
        "understanding",
        "text",
        "word",
        "intellectualist",
        "philosophical",
        "outlook",
        "emerged",
        "world",
        "thought",
        "learning",
        "yü",
        "yingshih",
        "famously",
        "labeled",
        "outlook",
        "intellectualism",
        "idealtype",
        "thinking",
        "abstracted",
        "confucian",
        "quest",
        "way",
        "inquiry",
        "learning",
        "dao",
        "wenxue",
        "contradistinction",
        "antiintellectualist",
        "enterprise",
        "honoring",
        "heavenendowed",
        "moral",
        "virtuous",
        "nature",
        "zun",
        "dexing",
        "former",
        "sought",
        "data",
        "corroboration",
        "reality",
        "external",
        "realm",
        "myriad",
        "phenomenon",
        "thing",
        "whereas",
        "latter",
        "appealed",
        "intuitively",
        "internal",
        "realm",
        "one",
        "nature",
        "whose",
        "quiddity",
        "morally",
        "good",
        "insofar",
        "endowed",
        "heaven",
        "songming",
        "philosophical",
        "thought",
        "characterized",
        "identification",
        "inner",
        "moral",
        "reckoning",
        "awakening",
        "qing",
        "counterpart",
        "marked",
        "special",
        "focusing",
        "external",
        "objective",
        "knowledge",
        "whose",
        "basis",
        "point",
        "departure",
        "classical",
        "text",
        "object",
        "cognitive",
        "inquiry",
        "yet",
        "point",
        "must",
        "made",
        "embedded",
        "rupture",
        "continuity",
        "important",
        "way",
        "entire",
        "songming",
        "tradition",
        "thought",
        "doubt",
        "subjected",
        "wholesale",
        "reexamination",
        "begin",
        "basis",
        "criticism",
        "construction",
        "stemmed",
        "wellestablished",
        "preexisting",
        "strand",
        "learning",
        "one",
        "famous",
        "song",
        "definition",
        "quintessence",
        "confucian",
        "tradition",
        "liu",
        "yi",
        "identified",
        "three",
        "principal",
        "component",
        "ti",
        "substance",
        "essence",
        "spirit",
        "principle",
        "core",
        "soul",
        "yong",
        "function",
        "utility",
        "practicality",
        "application",
        "action",
        "effort",
        "wen",
        "literature",
        "writing",
        "philology",
        "belleslettres",
        "textual",
        "learning",
        "classical",
        "study",
        "together",
        "constituted",
        "goal",
        "content",
        "confucian",
        "learning",
        "qing",
        "intellectualism",
        "focused",
        "primacy",
        "wen",
        "central",
        "manifestation",
        "yong",
        "moreover",
        "scholar",
        "despite",
        "general",
        "discontent",
        "perceived",
        "empty",
        "recondite",
        "songming",
        "learning",
        "desire",
        "reform",
        "continued",
        "delineate",
        "scholarly",
        "philosophical",
        "allegiance",
        "term",
        "association",
        "two",
        "school",
        "neoconfucianism",
        "socalled",
        "chengzhu",
        "school",
        "luwang",
        "school",
        "fact",
        "many",
        "engaged",
        "intellectualist",
        "enterprise",
        "precisely",
        "purpose",
        "wielding",
        "philology",
        "weapon",
        "defend",
        "philosophical",
        "view",
        "time",
        "seeking",
        "weaken",
        "demolish",
        "opponent",
        "nevertheless",
        "even",
        "though",
        "qing",
        "intellectualism",
        "outgrowth",
        "confucian",
        "tradition",
        "timeworn",
        "pedigree",
        "also",
        "new",
        "sense",
        "kaozheng",
        "evidential",
        "research",
        "movement",
        "methodology",
        "utmost",
        "expression",
        "intellectualist",
        "spirit",
        "virtue",
        "intellectual",
        "scale",
        "density",
        "wrought",
        "epochal",
        "breakthrough",
        "came",
        "inescapably",
        "unmistakably",
        "identified",
        "special",
        "qing",
        "way",
        "construing",
        "reality",
        "world",
        "kaozheng",
        "scholarship",
        "opened",
        "hermeneutic",
        "issue",
        "interpretation",
        "benjamin",
        "elman",
        "pointed",
        "classic",
        "whole",
        "unproblematically",
        "recognized",
        "assenteliciting",
        "cultural",
        "textual",
        "capital",
        "subjected",
        "interrogation",
        "individual",
        "separate",
        "text",
        "dissent",
        "disquiet",
        "arose",
        "authenticity",
        "text",
        "came",
        "questioned",
        "place",
        "heterogeneous",
        "commentarial",
        "came",
        "debated",
        "authority",
        "came",
        "reassessed",
        "manner",
        "retrieving",
        "antique",
        "message",
        "came",
        "argued",
        "short",
        "classic",
        "historicized",
        "moreover",
        "began",
        "study",
        "classic",
        "spilled",
        "area",
        "inquirybronze",
        "artifact",
        "preqin",
        "thinker",
        "text",
        "history",
        "geography",
        "cosmology",
        "science",
        "gu",
        "yanwu",
        "early",
        "qing",
        "asserted",
        "study",
        "principle",
        "lixue",
        "irredeemably",
        "contracted",
        "study",
        "classic",
        "jingxue",
        "according",
        "ancient",
        "time",
        "study",
        "principle",
        "perforce",
        "investigation",
        "classic",
        "basis",
        "operation",
        "principle",
        "could",
        "discerned",
        "understood",
        "hence",
        "research",
        "ancient",
        "phonology",
        "think",
        "study",
        "nine",
        "classic",
        "begin",
        "textual",
        "analysis",
        "study",
        "textual",
        "analysis",
        "begin",
        "knowledge",
        "phonology",
        "study",
        "various",
        "philosopher",
        "hundred",
        "school",
        "gu",
        "gtlswj",
        "gu",
        "criticized",
        "contemporary",
        "pursuing",
        "empty",
        "abstract",
        "chan",
        "buddhist",
        "learning",
        "chanxue",
        "since",
        "relied",
        "record",
        "dialogue",
        "yulu",
        "songming",
        "scholar",
        "ignored",
        "classic",
        "ben",
        "learning",
        "root",
        "substance",
        "basis",
        "rejected",
        "totalizing",
        "methodology",
        "yiguan",
        "zhi",
        "fa",
        "way",
        "connecting",
        "everything",
        "epistemological",
        "orientation",
        "songming",
        "learning",
        "eschewed",
        "swamped",
        "concrete",
        "particular",
        "instead",
        "gu",
        "called",
        "duoxue",
        "er",
        "shi",
        "get",
        "know",
        "multifarious",
        "learning",
        "duojian",
        "er",
        "shi",
        "get",
        "know",
        "multifarious",
        "observation",
        "one",
        "achieved",
        "boxue",
        "yu",
        "wen",
        "erudition",
        "writing",
        "gu",
        "gtlswj",
        "classic",
        "recorded",
        "consisted",
        "nothing",
        "sage",
        "heard",
        "seen",
        "shengren",
        "suowen",
        "suojian",
        "gu",
        "rzl",
        "intellectualist",
        "stance",
        "classic",
        "expression",
        "following",
        "way",
        "learning",
        "inquiry",
        "dao",
        "wenxue",
        "involving",
        "empirical",
        "observation",
        "painstaking",
        "accumulation",
        "broad",
        "knowledge",
        "huang",
        "zongxi",
        "selftouted",
        "follower",
        "luwang",
        "tradition",
        "made",
        "point",
        "reinterpret",
        "wang",
        "yangming",
        "central",
        "idea",
        "zhi",
        "liangzhi",
        "extending",
        "spontaneous",
        "moral",
        "knowing",
        "utmost",
        "intellectualist",
        "term",
        "wang",
        "tended",
        "think",
        "knowledge",
        "must",
        "grasped",
        "term",
        "ultimate",
        "substance",
        "one",
        "mindheart",
        "could",
        "made",
        "clear",
        "word",
        "thereby",
        "casting",
        "doubt",
        "efficacy",
        "word",
        "discursive",
        "practice",
        "huang",
        "spoke",
        "behalf",
        "ming",
        "master",
        "claiming",
        "act",
        "extending",
        "zhi",
        "innate",
        "moral",
        "knowing",
        "practice",
        "act",
        "broad",
        "learning",
        "examining",
        "inquiring",
        "deliberation",
        "utmost",
        "care",
        "identifying",
        "difference",
        "clearly",
        "practice",
        "huang",
        "mrxa",
        "v",
        "p",
        "later",
        "quan",
        "zuwang",
        "admirer",
        "huang",
        "scholarship",
        "would",
        "offer",
        "encomium",
        "citing",
        "huang",
        "word",
        "huang",
        "said",
        "profession",
        "studying",
        "classic",
        "ordering",
        "world",
        "ordering",
        "world",
        "therefore",
        "pursue",
        "learning",
        "petty",
        "confucian",
        "commanded",
        "study",
        "classic",
        "history",
        "also",
        "said",
        "without",
        "study",
        "change",
        "transformation",
        "principle",
        "verified",
        "quoted",
        "gu",
        "qingmei",
        "wang",
        "fuzhi",
        "also",
        "repudiated",
        "neoconfucian",
        "epistemological",
        "assertion",
        "possibility",
        "mingjie",
        "esoteric",
        "understanding",
        "miaowu",
        "mysterious",
        "enlightenment",
        "antiintellectualist",
        "conception",
        "referred",
        "direct",
        "intuitive",
        "apprehension",
        "truth",
        "without",
        "intervention",
        "actual",
        "study",
        "insisted",
        "principle",
        "multitudinous",
        "thing",
        "known",
        "without",
        "learning",
        "distinguished",
        "without",
        "erudition",
        "knowledge",
        "wang",
        "came",
        "direct",
        "engagement",
        "experience",
        "changing",
        "external",
        "form",
        "kexing",
        "universe",
        "rising",
        "setting",
        "waning",
        "waxing",
        "sun",
        "moon",
        "succession",
        "season",
        "birth",
        "death",
        "myriad",
        "thing",
        "wind",
        "rain",
        "dew",
        "thunder",
        "quoted",
        "hou",
        "wailu",
        "claimed",
        "thing",
        "known",
        "name",
        "known",
        "name",
        "known",
        "significance",
        "known",
        "without",
        "contact",
        "thing",
        "even",
        "mindheart",
        "imbued",
        "innate",
        "ability",
        "name",
        "name",
        "thing",
        "accomplished",
        "ibid",
        "see",
        "previous",
        "wang",
        "thus",
        "argued",
        "strongly",
        "favor",
        "investigation",
        "thing",
        "gewu",
        "employed",
        "mindheart",
        "sens",
        "hearing",
        "seeing",
        "empirical",
        "observation",
        "defined",
        "inexorable",
        "interrelation",
        "interaction",
        "quest",
        "knowledge",
        "effort",
        "investigation",
        "thing",
        "employ",
        "faculty",
        "mindheart",
        "hearing",
        "seeing",
        "study",
        "inquiry",
        "mainstay",
        "aided",
        "thinking",
        "distinguishing",
        "differences",
        "hearing",
        "seeing",
        "resource",
        "functioning",
        "mindheart",
        "setting",
        "direction",
        "follow",
        "quoted",
        "ji",
        "wenfu",
        "wang",
        "theory",
        "knowledge",
        "affirmed",
        "irreducibility",
        "discursive",
        "knowledge",
        "gained",
        "thorough",
        "investigating",
        "thingsstudy",
        "inquiryto",
        "morality",
        "spontaneously",
        "apprehended",
        "mindheart",
        "eighteenth",
        "century",
        "kaozheng",
        "evidential",
        "research",
        "movement",
        "held",
        "sway",
        "common",
        "consensus",
        "learning",
        "must",
        "concrete",
        "empirical",
        "ultimate",
        "goal",
        "retrieve",
        "restore",
        "via",
        "philological",
        "explication",
        "xungu",
        "pristine",
        "unadulterated",
        "meaning",
        "sage",
        "word",
        "moral",
        "meaning",
        "yili",
        "could",
        "come",
        "fore",
        "crystal",
        "clear",
        "qian",
        "daxin",
        "said",
        "well",
        "first",
        "writing",
        "word",
        "wenzi",
        "philological",
        "explication",
        "classic",
        "first",
        "philological",
        "explication",
        "moral",
        "principle",
        "philological",
        "explication",
        "classic",
        "source",
        "moral",
        "meaning",
        "derived",
        "qian",
        "qytwj",
        "asked",
        "heaven",
        "endeavor",
        "abandon",
        "study",
        "inquiry",
        "specifically",
        "pursues",
        "reverent",
        "realization",
        "one",
        "moral",
        "nature",
        "qytwj",
        "explicitly",
        "affirmed",
        "importance",
        "following",
        "way",
        "inquiry",
        "learning",
        "warning",
        "exclusive",
        "focus",
        "realization",
        "putatively",
        "moral",
        "nature",
        "intellectualist",
        "stance",
        "shared",
        "dai",
        "zhen",
        "also",
        "waxed",
        "rhetorical",
        "pursuit",
        "study",
        "inquiry",
        "abandoned",
        "would",
        "possible",
        "lead",
        "life",
        "reverent",
        "realization",
        "one",
        "moral",
        "nature",
        "dai",
        "dzwj",
        "dai",
        "study",
        "inquire",
        "hear",
        "dao",
        "wendao",
        "dzwj",
        "thus",
        "intellectualist",
        "quest",
        "antecedent",
        "attempt",
        "apprehend",
        "principle",
        "nature",
        "seek",
        "appropriate",
        "principle",
        "mean",
        "knowledge",
        "come",
        "first",
        "way",
        "sagely",
        "learning",
        "ever",
        "call",
        "eliminating",
        "selfishness",
        "without",
        "also",
        "seeking",
        "remove",
        "befuddlement",
        "emphasizing",
        "action",
        "without",
        "first",
        "emphasizing",
        "knowledge",
        "quoted",
        "yü",
        "yingshih",
        "put",
        "plainly",
        "moral",
        "nature",
        "feed",
        "learning",
        "inquiry",
        "order",
        "develop",
        "sagely",
        "intelligence",
        "quoted",
        "zhang",
        "xuecheng",
        "shared",
        "kaozheng",
        "scholar",
        "enthusiasm",
        "concrete",
        "critical",
        "study",
        "classic",
        "regarded",
        "history",
        "aversion",
        "toward",
        "esoteric",
        "moral",
        "speculation",
        "stated",
        "ancient",
        "never",
        "talk",
        "principle",
        "removed",
        "thing",
        "affair",
        "talk",
        "nature",
        "heaven",
        "mandate",
        "must",
        "study",
        "history",
        "quoted",
        "yü",
        "yingshih",
        "like",
        "huang",
        "zongxi",
        "redefined",
        "intellectualist",
        "term",
        "wang",
        "yangming",
        "notion",
        "zhi",
        "liangzhi",
        "extending",
        "spontaneous",
        "moral",
        "knowing",
        "utmost",
        "meant",
        "wang",
        "liangzhi",
        "innate",
        "spontaneous",
        "ineffable",
        "intuitive",
        "realizable",
        "internal",
        "introspection",
        "contrast",
        "zhang",
        "version",
        "referred",
        "learner",
        "considered",
        "closest",
        "talent",
        "cai",
        "affective",
        "emotive",
        "predisposition",
        "xingqing",
        "natural",
        "predisposition",
        "learn",
        "xue",
        "hand",
        "zhang",
        "explained",
        "notion",
        "extending",
        "zhi",
        "learner",
        "effort",
        "search",
        "knowledge",
        "xuezhe",
        "qiuzhi",
        "zhi",
        "gong",
        "quoted",
        "yü",
        "yingshih",
        "sum",
        "intellectualism",
        "leitmotif",
        "constellation",
        "qing",
        "philosophy",
        "express",
        "two",
        "way",
        "methodology",
        "referred",
        "pursuit",
        "inferential",
        "empirical",
        "knowledge",
        "prominently",
        "manifested",
        "textual",
        "philological",
        "research",
        "philosophical",
        "outlook",
        "reevaluated",
        "revised",
        "central",
        "neoconfucian",
        "notion",
        "internal",
        "selfcultivation",
        "aimed",
        "spontaneous",
        "realization",
        "heavenendowed",
        "moral",
        "nature",
        "arguing",
        "instead",
        "favor",
        "quest",
        "external",
        "knowledge",
        "mediated",
        "noetic",
        "sens",
        "intellectual",
        "cognitive",
        "faculty",
        "would",
        "take",
        "precedence",
        "intuitive",
        "power",
        "mindheart"
    ]
}