{
    "main_text": "Qing Philosophy: a Period Concept\n1. Qing Philosophy: a Period Concept\n\nTo assert and describe the newness of Qing philosophical thinking\nabout the manifold dimensions of reality in late imperial China is to\nhighlight a sense of departure from the immediate past, that is, to\ntrace the transition from the Song-Ming mode of thinking to the Qing\none by pinpointing the disjunction and continuity. In other\nwords, it begs the question of the relationship between late imperial\nthought and the preceding intellectual traditions. Inquiries into the\nMing-Qing intellectual transition have tended to adopt two narrative\nand analytical strategies: first, the comparative approach that\ncreates paradigms of adjoining intellectual movements and then points\nout their stark contrasts and vast differences; second, the\ndevelopmental approach based on the assumption of continuity, governed\nby notions of tradition, influence, and evolution. The comparative\napproach that stresses rupture was in fact adopted by the some of the\ntowering late Ming-early Qing intellectual figures, such as Gu Yanwu\n(1613–82) and Wang Fuzhi (1619–92), who created an\narchetype of Ming thought and Song-Ming Confucianism as abstract,\nabstruse, feckless, and feeble, such that they became a monolithic\ntype of thinking represented by finicky metaphysical\nspeculation and passive moral introspection. By Qing times, such a\nmode of intellection became collectively known as “Song\nlearning” (Songxue), with its overt focus on moral\nprinciples (yili zhi xue), as opposed to “Han\nlearning” (Hanxue), scholarship anchored on the deep\nphilological probing of texts and words, and their literal meanings\n(wenzi xungu). The modern restatement of this position was\nmade by Liang Qichao (1873–1929), a most influential late Qing\nand Republican intellectual figure, who criticized the futility of\nSong-Ming thought as “vague”, “intangible”,\nand “abstract”. Because of the wide circulation and common\nusage of the English translation by Immanuel Hsu of one of\nLiang’s book on Qing intellectual history (Liang 1921 [1959]),\nLiang’s view became for a long time the basic interpretive\nreference point for the study of late imperial intellectual trends,\ncreating a dominant historiography that interprets the Ming-Qing\nintellectual transition as a cataclysmic event that ushered in a new\nspirit of thought. Another giant intellectual figure, a stalwart of\nthe New Culture (or May-Fourth) movement, Hu Shi (1891–1962),\nheld similar views, going so far as to advance the influential thesis\nof Qing philosophy as scientific and progressive (Hu 1967:\n104–131).\n\nChinese Marxist scholarship in general likewise endorses this\ncataclysmic interpretation of the emergence of\n“progressive” thought in the late imperial period. Such\nthesis of discontinuity also found echoes in older western\nscholarship, such as that of the late Joseph Levenson, which contends\nthat it was only in the seventeenth century that voices began to be\nraised against Song-Ming idealism and subjective idealism (1964). In\nsum, according to the thesis of rupture between Song-Ming learning and\nlate imperial thought, seventeenth-century scholars begrudged the\ncorruption of learning by indulgent moral introspection and arcane\nmetaphysical speculation. As a result, there emerged the study of\npractical statecraft for the ordering of the workaday world of\ninstitutions and administrations, which realized the time-honored\nideal of jingshi zhiyong (ordering the world and extending\nutility). Moreover, in order to rectify the abuses of the Song-Ming\nempty talk (kongtan), evidential research (kaozheng\nor kaoju) arose, especially in the area of philology,\notherwise known as Han learning, in contradistinction to Song learning\nthat pursued speculative introspection.\n\nThe developmental approach to the question of the Ming-Qing\nintellectual transition based on the notion of continuity appears in\nFeng Youlan’s (1895–1990) classic survey of Chinese\nphilosophy (1934 [1952–1953]), ably translated into English by\nthe late Derk Bodde (1909–2003). Feng regarded Han learning in\nthe Qing as innovative and creative thinking, but he also insisted\nthat it was a continuation of Song-Ming Neo-Confucianism because it\nproduced no new metaphysical categories. More thoroughgoing in arguing\non behalf of the linkage between Qing learning and Song learning was\nthe eminent Qian Mu (1895–1990). To Qian (1937), the early Qing\nsavants did actually uphold the Song cultural ideals, but he pointed\nout that the dominant scholastic Han learning and evidential\nscholarship of the later Qianjia period (the period of the reigns of\nthe Qianlong and Jiaqing emperors, 1736–1820) strayed from the\ntrue moral way and political commitments of the late Ming and early\nQing. The most sustained effort to interpret the intimate nexus\nbetween Song-Ming Confucianism and Qing thought is found in the\nseminal trilogy of volumes (Bary 1970, 1975; Bary & Bloom 1979) on\nMing and Qing thought, edited by the late dean of Neo-Confucian\nStudies, Wm. Theodore de Bary (1919–2017), which examine the\nroots and nature of the intellectual transformation in the sixteenth\nand seventeenth centuries in terms of its intimate ties with Song-Ming\nantecedents. This thesis of continuity is eloquently restated by Qian\nMu’s eminent student Yü Ying-shih, who interprets the\nnovelty of late imperial Chinese learning with reference to its\norganic relation with Song-Ming Confucianism by delineating the inner\nlogic of Confucian thinking. As Yü claims,\n“Intellectualism”, or the ideal of “following the\nway of inquiry and learning” (dao wenxue), took center\nstage in late imperial thought, whereas in Song-Ming times,\n“anti-intellectualism”, or the ideal of “honoring\none’s heaven-endowed moral nature” (zun dexing)\npredominated (Yü 1975: 105–136).\n\nThe theme of intellectual continuity was also evident in much of\nJapanese scholarship which generally regards Wang Yangming’s\nidea of liangzhi (innately spontaneous moral knowing) as a\nmajor spiritual resource for fundamental change. It credits the left\nwing of the Wang Yangming school for further unleashing the potentials\nof this liberating precept by espousing individualism and voluntarism\nthat signified moral autonomy. Furthermore, it argues that the Qing\nbelief in the possibility of “objective” investigations of\nthe classics should be examined in the context of the\n“subjectivism” that unified the Song, Yuan, and Ming\nphilosophical views. This scholarship also explores the import of late\nimperial Chinese thought in terms of the idea of multiple early\nmodernities in world history, to the extent that the late Ming and\nQing witnessed the workings of the particular historical dynamics of\n“early modern” (sen kindai) China, manifested in\nthe new conceptions of self and society that were reformulations of\nsome central leitmotifs and polarities in traditional Confucian\nthinking (Shimada 1970; Mizoguchi 1980).\n\nBe it the comparative or developmental approach, the contention is\nthat Chinese thought experienced notable changes in the late imperial\nperiod, roughly from the late Ming through the mid Qing. While\nscholars argue over the genesis, content, nature, and significance of\nthe new developments, most acknowledge and recognize the patterned\nfundamental shifts in intellectual trends and directions. Some of the\ninterrelated traits of the intellectual redirection included the\nfollowing: fungibility and syncretism in thinking that tended to\nmitigate the authority of received opinions; palpable impulse to\nreorder and manage the world, invoking the ideal of ordering the world\nthrough practical statecraft and statesmanship (jingshi);\ngeneral aversion toward metaphysical speculation and moral\nintrospection, and the corresponding interest in the pursuit of solid\nand practical learning (puxue and shixue), giving\nrise to utilitarian and instrumental notions of scholarship; valuing\npersonal practical experience, academic, political, social and\notherwise, such that one’s actions in the phenomenal and\nexternal worlds loomed large; historicization of the classics\n(jing) that had hitherto been revered as sources of timeless\nauthority, rendering them into objects of scholarly scrutiny, thereby\nbreeding in time the meticulous scholarship of evidential research and\nlearning, which came to dominate the intellectual world in the\nso-called Qianjia period; preference for limpidity, clarity, and\nsimplicity in writing style and language; and finally, new and\nbroadening horizons of the meaning of community, as the\nliterati’s place in state and society was redefined and\nreconceptualized. To be sure, these interlarded strains of thoughts\nwere by no means new in the Chinese intellectual universe. Yet, from\nthe late Ming on, there seemed to be an unmistakable convergence of\nthe various traits that fostered conceptual commonalities and\nintellectual confluences out of a socio-intellectual environ that was\nnevertheless characterized by manifold sectarian affiliations and\npolemics. Various modes of learning and thinking cohered to forge a\nnew orientation that seemed to give conscious life in the late\nimperial period an identifiable stamp and identity.\n\nThus, late imperial Chinese philosophy, or Qing philosophy, is a\nperiod concept, that is, a substantive designation of an independent\nhistorico-intellectual epoch with a distinct physiognomy, an internal\ncoherence, identifiable mental habit, and autonomous scholarly style,\ndistinguished from the preceding Song-Ming philosophical style and\ncontent, as represented by Neo-Confucianism. The construction of this\nperiod concept is an exercise in intellectual cartography by selecting\nand representing the significant ideational landmarks of an\nintellectual landscape, thereby providing a perspective and knowledge\nof the terrain. The major landmarks are the dominant modes, or\nideal-types, of intellectual articulation, and Qing philosophy sported\nfour—vitalism, historicism, utilitarianism, and intellectualism.\nThey functioned as the basic criteria of intelligibility and\nimportance, offering the fundamental points of view according to which\nlearning was described, measured, valuated, and adjudicated. In the\nprocess, they dislodged and supplanted the moral metaphysics and\ninward ethical introspection of Song-Ming thought, which was premised\non the idea of realizing the totalizing dao (the Way),\nli (principle), and tian (heaven) through\nself-cultivation of the mind-heart (xin). To the extent that\nhumanity’s moral nature (dexing) was endowed by heaven,\nmoral-ethico perfection was the realization of the mandate of heaven\n(tianming), manifested as the ritual order established by the\nancient sages. In Song-Ming thought, apprehending dao/li/tian\nwas not merely an epistemological process, in that knowledge of\ndao/tian/ti was a metapraxis in which virtue, reason,\nknowing, and action converged.\n\nQing philosophy, with vitalism, historicism, utilitarianism and\nintellectualism as its contextual and thematic patterns of thinking\nand articulation, heralded a new phase in Chinese intellectual\nhistory, interrogating antecedent concepts and ushering in new\napproaches. I use these “isms” advisedly as terms of art,\nnot technical ones. Vitalism in this context smacks not of the\nBergsonian metaphysical postulation of an élan vital,\nand historicism does not appeal to the ancestral nomenclature of\nHegelian dialectics. Utilitarianism appeals not to Bentham’s\nconsequentialist philosophy, and intellectualism elides the Socratic\nor Thomistic reference to rationality and ratiocination. Vitalism, in\nthe context of Qing thought, is a reference to the Neo-Confucian\nphilosophy of qi, commonly rendered into English as material\nforce or psycho-physical force. It denotes a view of reality that\nfocuses attention in large part to the evidence provided by life\ngrasped from within a body, the self, or external thing. This evidence\nrevealed embodied experience to be composed of concrete tendencies and\noccurrences not readily reduced to or dissolved in metaphysical\nspeculation or conception, such as the ontological notion of principle\n(li) or heaven (tian). Historicism describes the\nmental habit and endeavor to find and establish meaning in history as\nit was made by human agents, shunning supra-temporal principles and\ntranscendent norms of universal validity, such as the idea of the\nconstant Way (dao), and savoring instead the contingent and\nparticular in varying and changing contexts. Utilitarianism takes its\ncue from the Confucian activist ideal of “ordering the world by\nextending utility and function to the fullest” (jingshi\nzhiyong), privileging the functional component of yong (utility)\nover ti (the essential substance of things) in the\nti-yong polarity that represented the interacting inner and\nouter realms of reality. Just as it gave priority to outer efforts of\nacting as opposed to the inner quiddity of being, so it presumed an\nintimate relation between knowledge and action in the experiential\nworld. Intellectualism is an abstraction from the Confucian external\ncultivational goal of “following the way of inquiry and\nlearning” (dao wenxue), which placed a premium on\ndiscursive knowledge and scholarly pursuit as the means to comprehend\nthe classics, understood as the textual encasement and manifestations\nof the profound principles of the ancient sages. In time, it bred the\ncritical evidentiary research (kaozheng) that sought to\nthoroughly reveal the sages’ teachings and messages via\nphilology.\n\nTo be sure, these modes of intellectual articulation were not entirely\nnew, but it was in the Qing that they coalesced, and they were\nemphasized and valued at the expense of other approaches. Hence the\nemergence of Qing philosophy as a coherent and integrated system of\nideas in terms of which reality and the world were understood.\n",
    "section_title": "1. Qing Philosophy: a Period Concept",
    "entry_title": "Qing Philosophy",
    "hierarchy_title": "Qing Philosophy || Qing Philosophy: a Period Concept",
    "tokenized_text": [
        "qing",
        "philosophy",
        "period",
        "concept",
        "qing",
        "philosophy",
        "period",
        "concept",
        "assert",
        "describe",
        "newness",
        "qing",
        "philosophical",
        "thinking",
        "manifold",
        "dimension",
        "reality",
        "late",
        "imperial",
        "china",
        "highlight",
        "sense",
        "departure",
        "immediate",
        "past",
        "trace",
        "transition",
        "songming",
        "mode",
        "thinking",
        "qing",
        "one",
        "pinpointing",
        "disjunction",
        "continuity",
        "word",
        "begs",
        "question",
        "relationship",
        "late",
        "imperial",
        "thought",
        "preceding",
        "intellectual",
        "tradition",
        "inquiry",
        "mingqing",
        "intellectual",
        "transition",
        "tended",
        "adopt",
        "two",
        "narrative",
        "analytical",
        "strategy",
        "first",
        "comparative",
        "approach",
        "creates",
        "paradigm",
        "adjoining",
        "intellectual",
        "movement",
        "point",
        "stark",
        "contrast",
        "vast",
        "difference",
        "second",
        "developmental",
        "approach",
        "based",
        "assumption",
        "continuity",
        "governed",
        "notion",
        "tradition",
        "influence",
        "evolution",
        "comparative",
        "approach",
        "stress",
        "rupture",
        "fact",
        "adopted",
        "towering",
        "late",
        "mingearly",
        "qing",
        "intellectual",
        "figure",
        "gu",
        "yanwu",
        "wang",
        "fuzhi",
        "created",
        "archetype",
        "ming",
        "thought",
        "songming",
        "confucianism",
        "abstract",
        "abstruse",
        "feckless",
        "feeble",
        "became",
        "monolithic",
        "type",
        "thinking",
        "represented",
        "finicky",
        "metaphysical",
        "speculation",
        "passive",
        "moral",
        "introspection",
        "qing",
        "time",
        "mode",
        "intellection",
        "became",
        "collectively",
        "known",
        "song",
        "learning",
        "songxue",
        "overt",
        "focus",
        "moral",
        "principle",
        "yili",
        "zhi",
        "xue",
        "opposed",
        "han",
        "learning",
        "hanxue",
        "scholarship",
        "anchored",
        "deep",
        "philological",
        "probing",
        "text",
        "word",
        "literal",
        "meaning",
        "wenzi",
        "xungu",
        "modern",
        "restatement",
        "position",
        "made",
        "liang",
        "qichao",
        "influential",
        "late",
        "qing",
        "republican",
        "intellectual",
        "figure",
        "criticized",
        "futility",
        "songming",
        "thought",
        "vague",
        "intangible",
        "abstract",
        "wide",
        "circulation",
        "common",
        "usage",
        "english",
        "translation",
        "immanuel",
        "hsu",
        "one",
        "liang",
        "book",
        "qing",
        "intellectual",
        "history",
        "liang",
        "liang",
        "view",
        "became",
        "long",
        "time",
        "basic",
        "interpretive",
        "reference",
        "point",
        "study",
        "late",
        "imperial",
        "intellectual",
        "trend",
        "creating",
        "dominant",
        "historiography",
        "interprets",
        "mingqing",
        "intellectual",
        "transition",
        "cataclysmic",
        "event",
        "ushered",
        "new",
        "spirit",
        "thought",
        "another",
        "giant",
        "intellectual",
        "figure",
        "stalwart",
        "new",
        "culture",
        "mayfourth",
        "movement",
        "hu",
        "shi",
        "held",
        "similar",
        "view",
        "going",
        "far",
        "advance",
        "influential",
        "thesis",
        "qing",
        "philosophy",
        "scientific",
        "progressive",
        "hu",
        "chinese",
        "marxist",
        "scholarship",
        "general",
        "likewise",
        "endorses",
        "cataclysmic",
        "interpretation",
        "emergence",
        "progressive",
        "thought",
        "late",
        "imperial",
        "period",
        "thesis",
        "discontinuity",
        "also",
        "found",
        "echo",
        "older",
        "western",
        "scholarship",
        "late",
        "joseph",
        "levenson",
        "contends",
        "seventeenth",
        "century",
        "voice",
        "began",
        "raised",
        "songming",
        "idealism",
        "subjective",
        "idealism",
        "sum",
        "according",
        "thesis",
        "rupture",
        "songming",
        "learning",
        "late",
        "imperial",
        "thought",
        "seventeenthcentury",
        "scholar",
        "begrudged",
        "corruption",
        "learning",
        "indulgent",
        "moral",
        "introspection",
        "arcane",
        "metaphysical",
        "speculation",
        "result",
        "emerged",
        "study",
        "practical",
        "statecraft",
        "ordering",
        "workaday",
        "world",
        "institution",
        "administration",
        "realized",
        "timehonored",
        "ideal",
        "jingshi",
        "zhiyong",
        "ordering",
        "world",
        "extending",
        "utility",
        "moreover",
        "order",
        "rectify",
        "abuse",
        "songming",
        "empty",
        "talk",
        "kongtan",
        "evidential",
        "research",
        "kaozheng",
        "kaoju",
        "arose",
        "especially",
        "area",
        "philology",
        "otherwise",
        "known",
        "han",
        "learning",
        "contradistinction",
        "song",
        "learning",
        "pursued",
        "speculative",
        "introspection",
        "developmental",
        "approach",
        "question",
        "mingqing",
        "intellectual",
        "transition",
        "based",
        "notion",
        "continuity",
        "appears",
        "feng",
        "youlan",
        "classic",
        "survey",
        "chinese",
        "philosophy",
        "ably",
        "translated",
        "english",
        "late",
        "derk",
        "bodde",
        "feng",
        "regarded",
        "han",
        "learning",
        "qing",
        "innovative",
        "creative",
        "thinking",
        "also",
        "insisted",
        "continuation",
        "songming",
        "neoconfucianism",
        "produced",
        "new",
        "metaphysical",
        "category",
        "thoroughgoing",
        "arguing",
        "behalf",
        "linkage",
        "qing",
        "learning",
        "song",
        "learning",
        "eminent",
        "qian",
        "mu",
        "qian",
        "early",
        "qing",
        "savant",
        "actually",
        "uphold",
        "song",
        "cultural",
        "ideal",
        "pointed",
        "dominant",
        "scholastic",
        "han",
        "learning",
        "evidential",
        "scholarship",
        "later",
        "qianjia",
        "period",
        "period",
        "reign",
        "qianlong",
        "jiaqing",
        "emperor",
        "strayed",
        "true",
        "moral",
        "way",
        "political",
        "commitment",
        "late",
        "ming",
        "early",
        "qing",
        "sustained",
        "effort",
        "interpret",
        "intimate",
        "nexus",
        "songming",
        "confucianism",
        "qing",
        "thought",
        "found",
        "seminal",
        "trilogy",
        "volume",
        "bary",
        "bary",
        "bloom",
        "ming",
        "qing",
        "thought",
        "edited",
        "late",
        "dean",
        "neoconfucian",
        "study",
        "wm",
        "theodore",
        "de",
        "bary",
        "examine",
        "root",
        "nature",
        "intellectual",
        "transformation",
        "sixteenth",
        "seventeenth",
        "century",
        "term",
        "intimate",
        "tie",
        "songming",
        "antecedent",
        "thesis",
        "continuity",
        "eloquently",
        "restated",
        "qian",
        "mu",
        "eminent",
        "student",
        "yü",
        "yingshih",
        "interprets",
        "novelty",
        "late",
        "imperial",
        "chinese",
        "learning",
        "reference",
        "organic",
        "relation",
        "songming",
        "confucianism",
        "delineating",
        "inner",
        "logic",
        "confucian",
        "thinking",
        "yü",
        "claim",
        "intellectualism",
        "ideal",
        "following",
        "way",
        "inquiry",
        "learning",
        "dao",
        "wenxue",
        "took",
        "center",
        "stage",
        "late",
        "imperial",
        "thought",
        "whereas",
        "songming",
        "time",
        "antiintellectualism",
        "ideal",
        "honoring",
        "one",
        "heavenendowed",
        "moral",
        "nature",
        "zun",
        "dexing",
        "predominated",
        "yü",
        "theme",
        "intellectual",
        "continuity",
        "also",
        "evident",
        "much",
        "japanese",
        "scholarship",
        "generally",
        "regard",
        "wang",
        "yangming",
        "idea",
        "liangzhi",
        "innately",
        "spontaneous",
        "moral",
        "knowing",
        "major",
        "spiritual",
        "resource",
        "fundamental",
        "change",
        "credit",
        "left",
        "wing",
        "wang",
        "yangming",
        "school",
        "unleashing",
        "potential",
        "liberating",
        "precept",
        "espousing",
        "individualism",
        "voluntarism",
        "signified",
        "moral",
        "autonomy",
        "furthermore",
        "argues",
        "qing",
        "belief",
        "possibility",
        "objective",
        "investigation",
        "classic",
        "examined",
        "context",
        "subjectivism",
        "unified",
        "song",
        "yuan",
        "ming",
        "philosophical",
        "view",
        "scholarship",
        "also",
        "explores",
        "import",
        "late",
        "imperial",
        "chinese",
        "thought",
        "term",
        "idea",
        "multiple",
        "early",
        "modernity",
        "world",
        "history",
        "extent",
        "late",
        "ming",
        "qing",
        "witnessed",
        "working",
        "particular",
        "historical",
        "dynamic",
        "early",
        "modern",
        "sen",
        "kindai",
        "china",
        "manifested",
        "new",
        "conception",
        "self",
        "society",
        "reformulations",
        "central",
        "leitmotif",
        "polarity",
        "traditional",
        "confucian",
        "thinking",
        "shimada",
        "mizoguchi",
        "comparative",
        "developmental",
        "approach",
        "contention",
        "chinese",
        "thought",
        "experienced",
        "notable",
        "change",
        "late",
        "imperial",
        "period",
        "roughly",
        "late",
        "ming",
        "mid",
        "qing",
        "scholar",
        "argue",
        "genesis",
        "content",
        "nature",
        "significance",
        "new",
        "development",
        "acknowledge",
        "recognize",
        "patterned",
        "fundamental",
        "shift",
        "intellectual",
        "trend",
        "direction",
        "interrelated",
        "trait",
        "intellectual",
        "redirection",
        "included",
        "following",
        "fungibility",
        "syncretism",
        "thinking",
        "tended",
        "mitigate",
        "authority",
        "received",
        "opinion",
        "palpable",
        "impulse",
        "reorder",
        "manage",
        "world",
        "invoking",
        "ideal",
        "ordering",
        "world",
        "practical",
        "statecraft",
        "statesmanship",
        "jingshi",
        "general",
        "aversion",
        "toward",
        "metaphysical",
        "speculation",
        "moral",
        "introspection",
        "corresponding",
        "interest",
        "pursuit",
        "solid",
        "practical",
        "learning",
        "puxue",
        "shixue",
        "giving",
        "rise",
        "utilitarian",
        "instrumental",
        "notion",
        "scholarship",
        "valuing",
        "personal",
        "practical",
        "experience",
        "academic",
        "political",
        "social",
        "otherwise",
        "one",
        "action",
        "phenomenal",
        "external",
        "world",
        "loomed",
        "large",
        "historicization",
        "classic",
        "jing",
        "hitherto",
        "revered",
        "source",
        "timeless",
        "authority",
        "rendering",
        "object",
        "scholarly",
        "scrutiny",
        "thereby",
        "breeding",
        "time",
        "meticulous",
        "scholarship",
        "evidential",
        "research",
        "learning",
        "came",
        "dominate",
        "intellectual",
        "world",
        "socalled",
        "qianjia",
        "period",
        "preference",
        "limpidity",
        "clarity",
        "simplicity",
        "writing",
        "style",
        "language",
        "finally",
        "new",
        "broadening",
        "horizon",
        "meaning",
        "community",
        "literati",
        "place",
        "state",
        "society",
        "redefined",
        "reconceptualized",
        "sure",
        "interlarded",
        "strain",
        "thought",
        "mean",
        "new",
        "chinese",
        "intellectual",
        "universe",
        "yet",
        "late",
        "ming",
        "seemed",
        "unmistakable",
        "convergence",
        "various",
        "trait",
        "fostered",
        "conceptual",
        "commonality",
        "intellectual",
        "confluence",
        "sociointellectual",
        "environ",
        "nevertheless",
        "characterized",
        "manifold",
        "sectarian",
        "affiliation",
        "polemic",
        "various",
        "mode",
        "learning",
        "thinking",
        "cohered",
        "forge",
        "new",
        "orientation",
        "seemed",
        "give",
        "conscious",
        "life",
        "late",
        "imperial",
        "period",
        "identifiable",
        "stamp",
        "identity",
        "thus",
        "late",
        "imperial",
        "chinese",
        "philosophy",
        "qing",
        "philosophy",
        "period",
        "concept",
        "substantive",
        "designation",
        "independent",
        "historicointellectual",
        "epoch",
        "distinct",
        "physiognomy",
        "internal",
        "coherence",
        "identifiable",
        "mental",
        "habit",
        "autonomous",
        "scholarly",
        "style",
        "distinguished",
        "preceding",
        "songming",
        "philosophical",
        "style",
        "content",
        "represented",
        "neoconfucianism",
        "construction",
        "period",
        "concept",
        "exercise",
        "intellectual",
        "cartography",
        "selecting",
        "representing",
        "significant",
        "ideational",
        "landmark",
        "intellectual",
        "landscape",
        "thereby",
        "providing",
        "perspective",
        "knowledge",
        "terrain",
        "major",
        "landmark",
        "dominant",
        "mode",
        "idealtypes",
        "intellectual",
        "articulation",
        "qing",
        "philosophy",
        "sported",
        "fourvitalism",
        "historicism",
        "utilitarianism",
        "intellectualism",
        "functioned",
        "basic",
        "criterion",
        "intelligibility",
        "importance",
        "offering",
        "fundamental",
        "point",
        "view",
        "according",
        "learning",
        "described",
        "measured",
        "valuated",
        "adjudicated",
        "process",
        "dislodged",
        "supplanted",
        "moral",
        "metaphysics",
        "inward",
        "ethical",
        "introspection",
        "songming",
        "thought",
        "premised",
        "idea",
        "realizing",
        "totalizing",
        "dao",
        "way",
        "li",
        "principle",
        "tian",
        "heaven",
        "selfcultivation",
        "mindheart",
        "xin",
        "extent",
        "humanity",
        "moral",
        "nature",
        "dexing",
        "endowed",
        "heaven",
        "moralethico",
        "perfection",
        "realization",
        "mandate",
        "heaven",
        "tianming",
        "manifested",
        "ritual",
        "order",
        "established",
        "ancient",
        "sage",
        "songming",
        "thought",
        "apprehending",
        "daolitian",
        "merely",
        "epistemological",
        "process",
        "knowledge",
        "daotianti",
        "metapraxis",
        "virtue",
        "reason",
        "knowing",
        "action",
        "converged",
        "qing",
        "philosophy",
        "vitalism",
        "historicism",
        "utilitarianism",
        "intellectualism",
        "contextual",
        "thematic",
        "pattern",
        "thinking",
        "articulation",
        "heralded",
        "new",
        "phase",
        "chinese",
        "intellectual",
        "history",
        "interrogating",
        "antecedent",
        "concept",
        "ushering",
        "new",
        "approach",
        "use",
        "ism",
        "advisedly",
        "term",
        "art",
        "technical",
        "one",
        "vitalism",
        "context",
        "smack",
        "bergsonian",
        "metaphysical",
        "postulation",
        "élan",
        "vital",
        "historicism",
        "appeal",
        "ancestral",
        "nomenclature",
        "hegelian",
        "dialectic",
        "utilitarianism",
        "appeal",
        "bentham",
        "consequentialist",
        "philosophy",
        "intellectualism",
        "elides",
        "socratic",
        "thomistic",
        "reference",
        "rationality",
        "ratiocination",
        "vitalism",
        "context",
        "qing",
        "thought",
        "reference",
        "neoconfucian",
        "philosophy",
        "qi",
        "commonly",
        "rendered",
        "english",
        "material",
        "force",
        "psychophysical",
        "force",
        "denotes",
        "view",
        "reality",
        "focus",
        "attention",
        "large",
        "part",
        "evidence",
        "provided",
        "life",
        "grasped",
        "within",
        "body",
        "self",
        "external",
        "thing",
        "evidence",
        "revealed",
        "embodied",
        "experience",
        "composed",
        "concrete",
        "tendency",
        "occurrence",
        "readily",
        "reduced",
        "dissolved",
        "metaphysical",
        "speculation",
        "conception",
        "ontological",
        "notion",
        "principle",
        "li",
        "heaven",
        "tian",
        "historicism",
        "describes",
        "mental",
        "habit",
        "endeavor",
        "find",
        "establish",
        "meaning",
        "history",
        "made",
        "human",
        "agent",
        "shunning",
        "supratemporal",
        "principle",
        "transcendent",
        "norm",
        "universal",
        "validity",
        "idea",
        "constant",
        "way",
        "dao",
        "savoring",
        "instead",
        "contingent",
        "particular",
        "varying",
        "changing",
        "context",
        "utilitarianism",
        "take",
        "cue",
        "confucian",
        "activist",
        "ideal",
        "ordering",
        "world",
        "extending",
        "utility",
        "function",
        "fullest",
        "jingshi",
        "zhiyong",
        "privileging",
        "functional",
        "component",
        "yong",
        "utility",
        "ti",
        "essential",
        "substance",
        "thing",
        "tiyong",
        "polarity",
        "represented",
        "interacting",
        "inner",
        "outer",
        "realm",
        "reality",
        "gave",
        "priority",
        "outer",
        "effort",
        "acting",
        "opposed",
        "inner",
        "quiddity",
        "presumed",
        "intimate",
        "relation",
        "knowledge",
        "action",
        "experiential",
        "world",
        "intellectualism",
        "abstraction",
        "confucian",
        "external",
        "cultivational",
        "goal",
        "following",
        "way",
        "inquiry",
        "learning",
        "dao",
        "wenxue",
        "placed",
        "premium",
        "discursive",
        "knowledge",
        "scholarly",
        "pursuit",
        "mean",
        "comprehend",
        "classic",
        "understood",
        "textual",
        "encasement",
        "manifestation",
        "profound",
        "principle",
        "ancient",
        "sage",
        "time",
        "bred",
        "critical",
        "evidentiary",
        "research",
        "kaozheng",
        "sought",
        "thoroughly",
        "reveal",
        "sage",
        "teaching",
        "message",
        "via",
        "philology",
        "sure",
        "mode",
        "intellectual",
        "articulation",
        "entirely",
        "new",
        "qing",
        "coalesced",
        "emphasized",
        "valued",
        "expense",
        "approach",
        "hence",
        "emergence",
        "qing",
        "philosophy",
        "coherent",
        "integrated",
        "system",
        "idea",
        "term",
        "reality",
        "world",
        "understood"
    ]
}