{
    "main_text": "Quantum Motion on Shape Space\n17. Objections and Responses \n\nBohmian mechanics has never been widely accepted in the mainstream of\nthe physics community. Since it is not part of the standard physics\ncurriculum, many physicists—probably the majority—are\nsimply unfamiliar with the theory and how it works. Sometimes the\ntheory is rejected without explicit discussion of reasons for\nrejection. One also finds objections that are based on simple\nmisunderstandings; among these are claims that some no-go theorem,\nsuch as von Neumann’s theorem, the Kochen-Specker theorem, or\nBell’s theorem, shows that the theory cannot work. Such\nobjections will not be dealt with here, as the reply to them will be\nobvious to those who understand the theory. In what follows only\nobjections that are not based on elementary misunderstandings will be\ndiscussed.\n\nA common objection is that Bohmian mechanics is too complicated or\ninelegant. To evaluate this objection one must compare the axioms of\nBohmian mechanics with those of standard quantum mechanics. To\nSchrödinger’s equation, Bohmian mechanics adds the\n guiding equation;\n standard quantum mechanics instead requires postulates about\nexperimental outcomes that can only be formulated in terms of a\ndistinction between a quantum system and the experimental apparatus.\nAnd, as noted by Hilary Putnam,\n\n\nIn Putnam ([1965]), I rejected Bohm’s interpretation for several\nreasons which no longer seem good to me. Even today, if you look at\nthe Wikipedia encyclopedia on the Web, you will find it said that\nBohm’s theory is mathematically inelegant. Happily, I did not\ngive that reason in Putnam ([1965]), but in any case it is\nnot true. The formula for the velocity field is extremely simple: you\nhave the probability current in the theory anyway, and you take the\nvelocity vector to be proportional to the current. There is nothing\nparticularly inelegant about that; if anything, it is remarkably\nelegant! (2005: 262) \n\n\nOne frequent objection is that Bohmian mechanics, since it makes\nprecisely the same predictions as standard quantum mechanics (insofar\nas the predictions of standard quantum mechanics are unambiguous), is\nnot a distinct theory but merely a reformulation of standard quantum\ntheory. In this vein, Heisenberg wrote,\n\n\nBohm’s interpretation cannot be refuted by experiment, and this\nis true of all the counter-proposals in the first group. From the\nfundamentally “positivistic” (it would perhaps be better\nto say “purely physical”) standpoint, we are thus\nconcerned not with counter-proposals to the Copenhagen interpretation,\nbut with its exact repetition in a different language. (Heisenberg\n1955: 18) \n\n\nMore recently, Sir Anthony Leggett has echoed this charge. Referring\nto the measurement problem, he says that Bohmian mechanics provides\n“little more than verbal window dressing of the basic\nparadox” (Leggett 2005: 871). And in connection with the\ndouble-slit experiment, he writes,\n\n\nNo experimental consequences are drawn from [the assumption of\ndefinite particle trajectories] other than the standard predictions of\nthe QM formalism, so whether one regards it as a substantive\nresolution of the apparent paradox or as little more than a\nreformulation of it is no doubt a matter of personal taste (the\npresent author inclines towards the latter point of view). (Leggett\n2002: R419) \n\n\nNow Bohmian mechanics and standard quantum mechanics provide clearly\ndifferent descriptions of what is happening on the microscopic quantum\nlevel. So it is only with a purely instrumental attitude towards\nscientific theories that Bohmian mechanics and standard quantum\nmechanics can possibly be regarded as different formulations of\nexactly the same theory. But even if they were, why would this be an\nobjection to Bohmian mechanics? Even if they were, we should still ask\nwhich of the two formulations is superior. Those impressed by the\n“not-a-distinct-theory” objection presumably give\nconsiderable weight to the fact that standard quantum mechanics came\nfirst. Supporters of Bohmian mechanics give more weight to its greater\nsimplicity and clarity.\n\nThe position of Leggett, however, is very difficult to understand.\nThere should be no measurement problem for a physicist with a purely\ninstrumentalist understanding of quantum mechanics. But for more than\nthirty years Leggett has forcefully argued that quantum mechanics\nindeed suffers from the measurement problem. For Leggett the problem\nis so serious that it has led him to suggest that quantum mechanics\nmight fail on the macroscopic level. Thus Leggett is no\ninstrumentalist, and it is hard to understand why he so cavalierly\ndismisses a theory like Bohmian mechanics that obviously doesn’t\nsuffer from the measurement problem, with which he has been so long\nconcerned. \n\nSir Roger Penrose also seems to have doubts as to whether Bohmian\nmechanics indeed resolves the measurement problem. He writes that\n\n\nit seems to me that some measure of scale is indeed needed, for\ndefining when classical-like behaviour begins to take over from\nsmall-scale quantum activity. In common with the other quantum\nontologies in which no measurable deviations from standard quantum\nmechanics is expected, the point of view (e) [Bohmian mechanics] does\nnot possess such a scale measure, so I do not see that it can\nadequately address the paradox of Schrödinger’s cat. (2005:\n811) \n\n\nBut contrary to what he writes, his real concern seems to be with the\nemergence of classical behavior, and not with the measurement problem\nper se. With regard to this, we note that the Bohmian\nevolution of particles, which is always governed by the wave function\nand is always fundamentally quantum, turns out to be approximately\nclassical when the relevant de Broglie wave length, determined in part\nby the wave function, is much smaller than the scale on which the\npotential energy term in Schrödinger’s equation varies (see\nAllori et al., 2002). Under normal circumstances this condition will\nbe satisfied for the center of mass motion of a macroscopic\nobject.\n\nIt is perhaps worth mentioning that despite the empirical equivalence\nbetween Bohmian mechanics and orthodox quantum theory, there are a\nvariety of experiments and experimental issues that don’t fit\ncomfortably within the standard quantum formalism but are easily\nhandled by Bohmian mechanics. Among these are dwell and tunneling\ntimes (Leavens 1996), escape times and escape positions (Daumer et al.\n1997b), scattering theory (Dürr et al., 2000), and quantum chaos\n(Cushing 1994; Dürr, Goldstein, & Zanghì\n1992b). Moreover, the additional resources present in Bohmian\nmechanics, in particular the notion of the conditional wave function\ndefined in Section 8, have been useful for the development of\napproximation schemes for dealing with practical quantum applications\n(Oriols & Mompart 2012, Struyve 2020).\n\nEspecially problematical from an orthodox perspective is quantum\ncosmology, for which the relevant quantum system is the entire\nuniverse, and hence there is no observer outside the system to cause\ncollapse of the wave function upon measurement. In this setting\nBohmian models have clarified the issue of the inevitability of the\npresence of singularities in theories of quantum gravity (Falciano,\nPinto-Neto, & Struyve 2015). For a discussion of how a Bohmian\nperspective can eliminate some conceptual difficulties arising in\nquantum gravity, such as the problem of time and the problem of the\nabsence of sufficiently many diffeomorphism-invariant observables, see\nGoldstein & Teufel 2001. \n\nAnother claim that has become popular in recent years is that Bohmian\nmechanics is an Everettian, or “many worlds”,\ninterpretation in disguise (see entry on\n the many worlds interpretation of quantum mechanics\n for an overview of such interpretations). The idea is that Bohmians,\nlike Everettians, must take the wave-function as physically real.\nMoreover, since Bohmian mechanics involves no wave-function collapse\n(for the wave function of the universe), all of the branches of the\nwave function, and not just the one that happens to be occupied by the\nactual particle configuration, persist. These branches are those that\nEverettians regard as representing parallel worlds. As David Deutsch\nexpresses the charge,\n\n\nthe “unoccupied grooves” must be physically real. Moreover\nthey obey the same laws of physics as the “occupied\ngroove” that is supposed to be “the” universe. But\nthat is just another way of saying that they are universes too.\n… In short, pilot-wave theories are parallel-universes theories\nin a state of chronic denial. (Deutsch 1996: 225) \n\n\nSee Brown and Wallace (2005) for an extended version of this argument.\nNot surprisingly, Bohmians do not agree that the branches of the wave\nfunction should be construed as representing worlds. For one Bohmian\nresponse, see Maudlin (2010). Other Bohmian responses have been given\nby Lewis (2007) and Valentini (2010b). \n\nThe claim of Deutsch, Brown, and Wallace is of a novel character that\nwe should perhaps pause to examine. On the one hand, for anyone who,\nlike Wallace, accepts the viability of a functionalist many-worlds\nunderstanding of quantum mechanics—and in particular accepts\nthat it follows as a matter of functional and structural analysis that\nwhen the wave function develops suitable complex patterns these ipso\nfacto describe what we should regard as worlds—the claim should\nbe compelling. On the other hand, for those who reject the functional\nanalysis and regard many worlds as ontologically inadequate (see\nMaudlin 2010), or who, like Vaidman (see the SEP entry on the\n many-worlds interpretation of quantum mechanics),\n accepts many worlds on non-functionalist grounds, the claim should\nseem empty. In other words, one has basically to have already accepted\na strong version of many worlds and already rejected Bohm in order to\nfeel the force of the claim. \n\nAnother interesting aspect of the claim is this: It seems that one\ncould consider, at least as a logical possibility, a world consisting\nof particles moving according to some well-defined equations of\nmotion, and in particular according to the equations of Bohmian\nmechanics. It seems entirely implausible that there should be a\nlogical problem with doing so. We should be extremely sceptical of any\nargument, like the claim of Deutsch, Brown, and Wallace, that suggests\nthat there is. Thus what, in defense of many worlds, Deutsch, Brown,\nand Wallace present as an objection to Bohmian mechanics should\nperhaps be regarded instead as an objection to many worlds itself.\n\nThere is one striking feature of Bohmian mechanics that is often\npresented as an objection: in Bohmian mechanics the wave function acts\nupon the positions of the particles but, evolving as it does\nautonomously via Schrödinger’s equation, it is not acted\nupon by the particles. This is regarded by some Bohmians, not as an\nobjectionable feature of the theory, but as an important clue about\nthe meaning of the quantum-mechanical wave function. Dürr,\nGoldstein, & Zanghì (1997) and Goldstein & Teufel\n(2001) discuss this point and suggest that from a deeper perspective\nthan afforded by standard Bohmian mechanics or quantum theory, the\nwave function should be regarded as nomological, as an object for\nconveniently expressing the law of motion somewhat analogous to the\nHamiltonian in classical mechanics, and that a time-dependent\nSchrödinger-type equation, from this deeper (cosmological)\nperspective, is merely phenomenological.\n\nBohmian mechanics does not account for phenomena such as particle\ncreation and annihilation characteristic of quantum field theory. This\nis not an objection to Bohmian mechanics but merely a recognition that\nquantum field theory explains a great deal more than does\nnonrelativistic quantum mechanics, whether in orthodox or Bohmian\nform. It does, however, underline the need to find an adequate, if not\ncompelling, Bohmian version of quantum field theory, and of gauge\ntheories in particular. Some rather tentative steps in this direction\ncan be found in Bohm & Hiley 1993, Holland 1993, Bell 1987b), and\nin some of the articles in Cushing, Fine, & Goldstein 1996. \n\nA crucial issue is whether a quantum field theory is fundamentally about\nfields or particles—or something else entirely. While the most\ncommon choice is fields (see Struyve 2010 for an assessment of a\nvariety of possibilities), Bell’s is particles. His proposal is\nin fact the basis of a canonical extension of Bohmian mechanics to\ngeneral quantum field theories, and these “Bell-type quantum\nfield theories” (Dürr et al. 2004 and 2005) describe a\nstochastic evolution of particles that involves particle creation and\nannihilation. (For a general discussion of this issue, and of the\npoint and value of Bohmian mechanics, see the exchange of letters\nbetween Goldstein and Weinberg by following the link provided in the\n Other Internet Resources\n section below.)\n\nInspired by the structure of Bell-type quantum field theories, Tumulka\nhas developed a novel approach to the problem of the ultraviolet\ndivergences of quantum field theory based on what he\ncalls interior boundary conditions. (See D. Dürr et\nal. 2020b and the references therein.) \n\nFor a brief introduction to Bohmian mechanics see Tumulka 2021. For\nlonger accessible presentations see Bricmont 2016, Norsen 2017,\nBricmont 2018, and Maudlin 2019.\n",
    "section_title": "17. Objections and Responses ",
    "entry_title": "Bohmian Mechanics",
    "hierarchy_title": "Bohmian Mechanics || Quantum Motion on Shape Space",
    "tokenized_text": [
        "quantum",
        "motion",
        "shape",
        "space",
        "objection",
        "response",
        "bohmian",
        "mechanic",
        "never",
        "widely",
        "accepted",
        "mainstream",
        "physic",
        "community",
        "since",
        "part",
        "standard",
        "physic",
        "curriculum",
        "many",
        "physicistsprobably",
        "majorityare",
        "simply",
        "unfamiliar",
        "theory",
        "work",
        "sometimes",
        "theory",
        "rejected",
        "without",
        "explicit",
        "discussion",
        "reason",
        "rejection",
        "one",
        "also",
        "find",
        "objection",
        "based",
        "simple",
        "misunderstanding",
        "among",
        "claim",
        "nogo",
        "theorem",
        "von",
        "neumann",
        "theorem",
        "kochenspecker",
        "theorem",
        "bell",
        "theorem",
        "show",
        "theory",
        "work",
        "objection",
        "dealt",
        "reply",
        "obvious",
        "understand",
        "theory",
        "follows",
        "objection",
        "based",
        "elementary",
        "misunderstanding",
        "discussed",
        "common",
        "objection",
        "bohmian",
        "mechanic",
        "complicated",
        "inelegant",
        "evaluate",
        "objection",
        "one",
        "must",
        "compare",
        "axiom",
        "bohmian",
        "mechanic",
        "standard",
        "quantum",
        "mechanic",
        "schrödinger",
        "equation",
        "bohmian",
        "mechanic",
        "add",
        "guiding",
        "equation",
        "standard",
        "quantum",
        "mechanic",
        "instead",
        "requires",
        "postulate",
        "experimental",
        "outcome",
        "formulated",
        "term",
        "distinction",
        "quantum",
        "system",
        "experimental",
        "apparatus",
        "noted",
        "hilary",
        "putnam",
        "putnam",
        "rejected",
        "bohm",
        "interpretation",
        "several",
        "reason",
        "longer",
        "seem",
        "good",
        "even",
        "today",
        "look",
        "wikipedia",
        "encyclopedia",
        "web",
        "find",
        "said",
        "bohm",
        "theory",
        "mathematically",
        "inelegant",
        "happily",
        "give",
        "reason",
        "putnam",
        "case",
        "true",
        "formula",
        "velocity",
        "field",
        "extremely",
        "simple",
        "probability",
        "current",
        "theory",
        "anyway",
        "take",
        "velocity",
        "vector",
        "proportional",
        "current",
        "nothing",
        "particularly",
        "inelegant",
        "anything",
        "remarkably",
        "elegant",
        "one",
        "frequent",
        "objection",
        "bohmian",
        "mechanic",
        "since",
        "make",
        "precisely",
        "prediction",
        "standard",
        "quantum",
        "mechanic",
        "insofar",
        "prediction",
        "standard",
        "quantum",
        "mechanic",
        "unambiguous",
        "distinct",
        "theory",
        "merely",
        "reformulation",
        "standard",
        "quantum",
        "theory",
        "vein",
        "heisenberg",
        "wrote",
        "bohm",
        "interpretation",
        "refuted",
        "experiment",
        "true",
        "counterproposals",
        "first",
        "group",
        "fundamentally",
        "positivistic",
        "would",
        "perhaps",
        "better",
        "say",
        "purely",
        "physical",
        "standpoint",
        "thus",
        "concerned",
        "counterproposals",
        "copenhagen",
        "interpretation",
        "exact",
        "repetition",
        "different",
        "language",
        "heisenberg",
        "recently",
        "sir",
        "anthony",
        "leggett",
        "echoed",
        "charge",
        "referring",
        "measurement",
        "problem",
        "say",
        "bohmian",
        "mechanic",
        "provides",
        "little",
        "verbal",
        "window",
        "dressing",
        "basic",
        "paradox",
        "leggett",
        "connection",
        "doubleslit",
        "experiment",
        "writes",
        "experimental",
        "consequence",
        "drawn",
        "assumption",
        "definite",
        "particle",
        "trajectory",
        "standard",
        "prediction",
        "qm",
        "formalism",
        "whether",
        "one",
        "regard",
        "substantive",
        "resolution",
        "apparent",
        "paradox",
        "little",
        "reformulation",
        "doubt",
        "matter",
        "personal",
        "taste",
        "present",
        "author",
        "incline",
        "towards",
        "latter",
        "point",
        "view",
        "leggett",
        "r",
        "bohmian",
        "mechanic",
        "standard",
        "quantum",
        "mechanic",
        "provide",
        "clearly",
        "different",
        "description",
        "happening",
        "microscopic",
        "quantum",
        "level",
        "purely",
        "instrumental",
        "attitude",
        "towards",
        "scientific",
        "theory",
        "bohmian",
        "mechanic",
        "standard",
        "quantum",
        "mechanic",
        "possibly",
        "regarded",
        "different",
        "formulation",
        "exactly",
        "theory",
        "even",
        "would",
        "objection",
        "bohmian",
        "mechanic",
        "even",
        "still",
        "ask",
        "two",
        "formulation",
        "superior",
        "impressed",
        "notadistincttheory",
        "objection",
        "presumably",
        "give",
        "considerable",
        "weight",
        "fact",
        "standard",
        "quantum",
        "mechanic",
        "came",
        "first",
        "supporter",
        "bohmian",
        "mechanic",
        "give",
        "weight",
        "greater",
        "simplicity",
        "clarity",
        "position",
        "leggett",
        "however",
        "difficult",
        "understand",
        "measurement",
        "problem",
        "physicist",
        "purely",
        "instrumentalist",
        "understanding",
        "quantum",
        "mechanic",
        "thirty",
        "year",
        "leggett",
        "forcefully",
        "argued",
        "quantum",
        "mechanic",
        "indeed",
        "suffers",
        "measurement",
        "problem",
        "leggett",
        "problem",
        "serious",
        "led",
        "suggest",
        "quantum",
        "mechanic",
        "might",
        "fail",
        "macroscopic",
        "level",
        "thus",
        "leggett",
        "instrumentalist",
        "hard",
        "understand",
        "cavalierly",
        "dismisses",
        "theory",
        "like",
        "bohmian",
        "mechanic",
        "obviously",
        "suffer",
        "measurement",
        "problem",
        "long",
        "concerned",
        "sir",
        "roger",
        "penrose",
        "also",
        "seems",
        "doubt",
        "whether",
        "bohmian",
        "mechanic",
        "indeed",
        "resolve",
        "measurement",
        "problem",
        "writes",
        "seems",
        "measure",
        "scale",
        "indeed",
        "needed",
        "defining",
        "classicallike",
        "behaviour",
        "begin",
        "take",
        "smallscale",
        "quantum",
        "activity",
        "common",
        "quantum",
        "ontology",
        "measurable",
        "deviation",
        "standard",
        "quantum",
        "mechanic",
        "expected",
        "point",
        "view",
        "e",
        "bohmian",
        "mechanic",
        "posse",
        "scale",
        "measure",
        "see",
        "adequately",
        "address",
        "paradox",
        "schrödinger",
        "cat",
        "contrary",
        "writes",
        "real",
        "concern",
        "seems",
        "emergence",
        "classical",
        "behavior",
        "measurement",
        "problem",
        "per",
        "se",
        "regard",
        "note",
        "bohmian",
        "evolution",
        "particle",
        "always",
        "governed",
        "wave",
        "function",
        "always",
        "fundamentally",
        "quantum",
        "turn",
        "approximately",
        "classical",
        "relevant",
        "de",
        "broglie",
        "wave",
        "length",
        "determined",
        "part",
        "wave",
        "function",
        "much",
        "smaller",
        "scale",
        "potential",
        "energy",
        "term",
        "schrödinger",
        "equation",
        "varies",
        "see",
        "allori",
        "et",
        "al",
        "normal",
        "circumstance",
        "condition",
        "satisfied",
        "center",
        "mass",
        "motion",
        "macroscopic",
        "object",
        "perhaps",
        "worth",
        "mentioning",
        "despite",
        "empirical",
        "equivalence",
        "bohmian",
        "mechanic",
        "orthodox",
        "quantum",
        "theory",
        "variety",
        "experiment",
        "experimental",
        "issue",
        "fit",
        "comfortably",
        "within",
        "standard",
        "quantum",
        "formalism",
        "easily",
        "handled",
        "bohmian",
        "mechanic",
        "among",
        "dwell",
        "tunneling",
        "time",
        "leaven",
        "escape",
        "time",
        "escape",
        "position",
        "daumer",
        "et",
        "al",
        "b",
        "scattering",
        "theory",
        "dürr",
        "et",
        "al",
        "quantum",
        "chaos",
        "cushing",
        "dürr",
        "goldstein",
        "zanghì",
        "b",
        "moreover",
        "additional",
        "resource",
        "present",
        "bohmian",
        "mechanic",
        "particular",
        "notion",
        "conditional",
        "wave",
        "function",
        "defined",
        "section",
        "useful",
        "development",
        "approximation",
        "scheme",
        "dealing",
        "practical",
        "quantum",
        "application",
        "oriols",
        "mompart",
        "struyve",
        "especially",
        "problematical",
        "orthodox",
        "perspective",
        "quantum",
        "cosmology",
        "relevant",
        "quantum",
        "system",
        "entire",
        "universe",
        "hence",
        "observer",
        "outside",
        "system",
        "cause",
        "collapse",
        "wave",
        "function",
        "upon",
        "measurement",
        "setting",
        "bohmian",
        "model",
        "clarified",
        "issue",
        "inevitability",
        "presence",
        "singularity",
        "theory",
        "quantum",
        "gravity",
        "falciano",
        "pintoneto",
        "struyve",
        "discussion",
        "bohmian",
        "perspective",
        "eliminate",
        "conceptual",
        "difficulty",
        "arising",
        "quantum",
        "gravity",
        "problem",
        "time",
        "problem",
        "absence",
        "sufficiently",
        "many",
        "diffeomorphisminvariant",
        "observables",
        "see",
        "goldstein",
        "teufel",
        "another",
        "claim",
        "become",
        "popular",
        "recent",
        "year",
        "bohmian",
        "mechanic",
        "everettian",
        "many",
        "world",
        "interpretation",
        "disguise",
        "see",
        "entry",
        "many",
        "world",
        "interpretation",
        "quantum",
        "mechanic",
        "overview",
        "interpretation",
        "idea",
        "bohmians",
        "like",
        "everettians",
        "must",
        "take",
        "wavefunction",
        "physically",
        "real",
        "moreover",
        "since",
        "bohmian",
        "mechanic",
        "involves",
        "wavefunction",
        "collapse",
        "wave",
        "function",
        "universe",
        "branch",
        "wave",
        "function",
        "one",
        "happens",
        "occupied",
        "actual",
        "particle",
        "configuration",
        "persist",
        "branch",
        "everettians",
        "regard",
        "representing",
        "parallel",
        "world",
        "david",
        "deutsch",
        "express",
        "charge",
        "unoccupied",
        "groove",
        "must",
        "physically",
        "real",
        "moreover",
        "obey",
        "law",
        "physic",
        "occupied",
        "groove",
        "supposed",
        "universe",
        "another",
        "way",
        "saying",
        "universe",
        "short",
        "pilotwave",
        "theory",
        "paralleluniverses",
        "theory",
        "state",
        "chronic",
        "denial",
        "deutsch",
        "see",
        "brown",
        "wallace",
        "extended",
        "version",
        "argument",
        "surprisingly",
        "bohmians",
        "agree",
        "branch",
        "wave",
        "function",
        "construed",
        "representing",
        "world",
        "one",
        "bohmian",
        "response",
        "see",
        "maudlin",
        "bohmian",
        "response",
        "given",
        "lewis",
        "valentini",
        "b",
        "claim",
        "deutsch",
        "brown",
        "wallace",
        "novel",
        "character",
        "perhaps",
        "pause",
        "examine",
        "one",
        "hand",
        "anyone",
        "like",
        "wallace",
        "accepts",
        "viability",
        "functionalist",
        "manyworlds",
        "understanding",
        "quantum",
        "mechanicsand",
        "particular",
        "accepts",
        "follows",
        "matter",
        "functional",
        "structural",
        "analysis",
        "wave",
        "function",
        "develops",
        "suitable",
        "complex",
        "pattern",
        "ipso",
        "facto",
        "describe",
        "regard",
        "worldsthe",
        "claim",
        "compelling",
        "hand",
        "reject",
        "functional",
        "analysis",
        "regard",
        "many",
        "world",
        "ontologically",
        "inadequate",
        "see",
        "maudlin",
        "like",
        "vaidman",
        "see",
        "sep",
        "entry",
        "manyworlds",
        "interpretation",
        "quantum",
        "mechanic",
        "accepts",
        "many",
        "world",
        "nonfunctionalist",
        "ground",
        "claim",
        "seem",
        "empty",
        "word",
        "one",
        "basically",
        "already",
        "accepted",
        "strong",
        "version",
        "many",
        "world",
        "already",
        "rejected",
        "bohm",
        "order",
        "feel",
        "force",
        "claim",
        "another",
        "interesting",
        "aspect",
        "claim",
        "seems",
        "one",
        "could",
        "consider",
        "least",
        "logical",
        "possibility",
        "world",
        "consisting",
        "particle",
        "moving",
        "according",
        "welldefined",
        "equation",
        "motion",
        "particular",
        "according",
        "equation",
        "bohmian",
        "mechanic",
        "seems",
        "entirely",
        "implausible",
        "logical",
        "problem",
        "extremely",
        "sceptical",
        "argument",
        "like",
        "claim",
        "deutsch",
        "brown",
        "wallace",
        "suggests",
        "thus",
        "defense",
        "many",
        "world",
        "deutsch",
        "brown",
        "wallace",
        "present",
        "objection",
        "bohmian",
        "mechanic",
        "perhaps",
        "regarded",
        "instead",
        "objection",
        "many",
        "world",
        "one",
        "striking",
        "feature",
        "bohmian",
        "mechanic",
        "often",
        "presented",
        "objection",
        "bohmian",
        "mechanic",
        "wave",
        "function",
        "act",
        "upon",
        "position",
        "particle",
        "evolving",
        "autonomously",
        "via",
        "schrödinger",
        "equation",
        "acted",
        "upon",
        "particle",
        "regarded",
        "bohmians",
        "objectionable",
        "feature",
        "theory",
        "important",
        "clue",
        "meaning",
        "quantummechanical",
        "wave",
        "function",
        "dürr",
        "goldstein",
        "zanghì",
        "goldstein",
        "teufel",
        "discus",
        "point",
        "suggest",
        "deeper",
        "perspective",
        "afforded",
        "standard",
        "bohmian",
        "mechanic",
        "quantum",
        "theory",
        "wave",
        "function",
        "regarded",
        "nomological",
        "object",
        "conveniently",
        "expressing",
        "law",
        "motion",
        "somewhat",
        "analogous",
        "hamiltonian",
        "classical",
        "mechanic",
        "timedependent",
        "schrödingertype",
        "equation",
        "deeper",
        "cosmological",
        "perspective",
        "merely",
        "phenomenological",
        "bohmian",
        "mechanic",
        "account",
        "phenomenon",
        "particle",
        "creation",
        "annihilation",
        "characteristic",
        "quantum",
        "field",
        "theory",
        "objection",
        "bohmian",
        "mechanic",
        "merely",
        "recognition",
        "quantum",
        "field",
        "theory",
        "explains",
        "great",
        "deal",
        "nonrelativistic",
        "quantum",
        "mechanic",
        "whether",
        "orthodox",
        "bohmian",
        "form",
        "however",
        "underline",
        "need",
        "find",
        "adequate",
        "compelling",
        "bohmian",
        "version",
        "quantum",
        "field",
        "theory",
        "gauge",
        "theory",
        "particular",
        "rather",
        "tentative",
        "step",
        "direction",
        "found",
        "bohm",
        "hiley",
        "holland",
        "bell",
        "b",
        "article",
        "cushing",
        "fine",
        "goldstein",
        "crucial",
        "issue",
        "whether",
        "quantum",
        "field",
        "theory",
        "fundamentally",
        "field",
        "particlesor",
        "something",
        "else",
        "entirely",
        "common",
        "choice",
        "field",
        "see",
        "struyve",
        "assessment",
        "variety",
        "possibility",
        "bell",
        "particle",
        "proposal",
        "fact",
        "basis",
        "canonical",
        "extension",
        "bohmian",
        "mechanic",
        "general",
        "quantum",
        "field",
        "theory",
        "belltype",
        "quantum",
        "field",
        "theory",
        "dürr",
        "et",
        "al",
        "describe",
        "stochastic",
        "evolution",
        "particle",
        "involves",
        "particle",
        "creation",
        "annihilation",
        "general",
        "discussion",
        "issue",
        "point",
        "value",
        "bohmian",
        "mechanic",
        "see",
        "exchange",
        "letter",
        "goldstein",
        "weinberg",
        "following",
        "link",
        "provided",
        "internet",
        "resource",
        "section",
        "inspired",
        "structure",
        "belltype",
        "quantum",
        "field",
        "theory",
        "tumulka",
        "developed",
        "novel",
        "approach",
        "problem",
        "ultraviolet",
        "divergence",
        "quantum",
        "field",
        "theory",
        "based",
        "call",
        "interior",
        "boundary",
        "condition",
        "see",
        "d",
        "dürr",
        "et",
        "al",
        "b",
        "reference",
        "therein",
        "brief",
        "introduction",
        "bohmian",
        "mechanic",
        "see",
        "tumulka",
        "longer",
        "accessible",
        "presentation",
        "see",
        "bricmont",
        "norsen",
        "bricmont",
        "maudlin"
    ]
}