{
    "main_text": "The Original Collapse Model\n5. The Original Collapse Model\n\nAs already mentioned, the Collapse Theory we are going to describe\namounts to accepting a modification of the standard evolution law of\nquantum theory such that microprocesses and macroprocesses are\ngoverned by a single dynamics. Such a dynamics must imply that the\nmicro-macro interaction in a measurement process leads to WPR. Bearing\nthis in mind, recall that the characteristic feature distinguishing\nthe quantum evolution from WPR is that, while Schrödinger’s\nequation is linear and deterministic (at the wave function level), WPR\nis nonlinear and stochastic. It is then natural to consider, as was\nsuggested for the first time in the above quoted papers by P. Pearle,\nthe possibility of nonlinear and stochastic modifications of the\nstandard Schrödinger dynamics. Such modifications, to be\nuniversal, must satisfy one important requirement, called the trigger\nproblem by Pearle (1989): the reduction mechanism must become more and\nmore effective in going from the micro to the macro domain. The\nsolution to this problem constitutes the central feature of Collapse\nTheories of the GRW type. To discuss these points, let us briefly\nreview the GRW model, first consistent model to appear in the\nliterature.\n\nWithin such a model, initially referred to as QMSL (Quantum Mechanics\nwith Spontaneous Localizations), the problem of the choice of the\npreferred basis is solved by noting that the most embarrassing\nsuperpositions, at the macroscopic level, are those involving\ndifferent spatial locations of macroscopic objects. Actually, as\nEinstein has stressed, this is a crucial point which has to be faced\nby anybody aiming at taking a macro-objective position about natural\nphenomena: ‘A macro-body must always have a quasi-sharply\ndefined position in the objective description of reality’ (Born\n1971: 223). Accordingly, QMSL considers the possibility of spontaneous\nprocesses, which are assumed to occur instantaneously and at the\nmicroscopic level, which tend to suppress the linear superpositions of\ndifferently localized states. The required trigger mechanism must then\nfollow consistently.\n\nThe key assumption of QMSL is the following: each elementary\nconstituent of any physical system is subjected, at random times, to\nrandom and spontaneous localization processes (which we will call\nhittings) around appropriate positions. To have a precise mathematical\nmodel one has to be very specific about the above assumptions, making\nexplicit HOW the process works (which modifications of the wave\nfunction are induced by the localizations), WHERE it occurs (what\ndetermines the occurrence of a localization at a certain position\nrather than at another one), and finally WHEN (at what times), it\noccurs. The answers to these questions are now presented.\n\nLet us consider a system of \\(N\\) distinguishable particles and let us\ndenote by \\(F(\\boldsymbol{q}_1, \\boldsymbol{q}_2 , \\ldots\n,\\boldsymbol{q}_N )\\) the coordinate representation (wave function) of\nthe state vector (we disregard spin variables since hittings are\nassumed not to act on them).\n\nThe answer to the question HOW is: if a hitting occurs for the\n\\(i\\)-th particle at point \\(\\boldsymbol{x}\\), the wave function is\ninstantaneously multiplied by a Gaussian function (appropriately\nnormalized) \n\n\\[ G(\\boldsymbol{q}_i, \\boldsymbol{x}) = K\n\\exp[-\\{1/(2d^2)\\}(\\boldsymbol{q}_i -\\boldsymbol{x})^2], \\]\n\n\nwhere \\(d\\) represents the localization accuracy. Let us denote as\n\n\\[ L_i (\\boldsymbol{q}_1, \\boldsymbol{q}_2, \\ldots, \\boldsymbol{q}_N ;\n\\boldsymbol{x}) = F(\\boldsymbol{q}_1, \\boldsymbol{q}_2, \\ldots,\n\\boldsymbol{q}_N) G(\\boldsymbol{q}_i, \\boldsymbol{x}) \\]\n\n\nthe wave function immediately after the localization, as yet\nunnormalized. \nAs for WHERE the localization occurs, it is assumed that the\nprobability density \\(P(\\boldsymbol{x})\\) of its taking place at the\npoint \\(\\boldsymbol{x}\\) is given by the square of the norm of the\nstate \\(L_i\\) (the length, or to be more precise, the integral of the\nmodulus squared of the function \\(L_i\\) over the \\(3N\\)-dimensional\nspace). This implies that hittings occur with higher probability at\nthose places where, in the standard quantum description, there is a\nhigher probability of finding the particle if a measurement were\nperformed (but remember that in our case there is no measurement being\nperformed; hittings are spontaneous processes). Note that the above\nprescription introduces nonlinear and stochastic elements in the\ndynamics. The constant \\(K\\) appearing in the expression of\n\\(G(\\boldsymbol{q}_i, \\boldsymbol{x})\\) is chosen in such a way that\nthe integral of \\(P(\\boldsymbol{x})\\) over the whole space equals\n1.\nFinally, the question WHEN is answered by assuming that the\nhittings occur at randomly distributed times, according to a Poisson\ndistribution, with mean frequency \\(f\\).\n\n\nIt is straightforward to see that the hitting process leads, when it\noccurs, to the localization of states of the particle, which are\ninitially delocalized over distances greater than \\(d\\). As a simple\nexample we can consider a single particle whose wavefunction is\ndifferent from zero only in two small and far apart regions \\(h\\) and\n\\(t\\). Suppose that a localization occurs around \\(h\\); the state\nafter the hitting is then appreciably different from zero only in a\nregion around \\(h\\) itself. A completely analogous argument holds if\nthe hitting takes place around \\(t\\). Regarding the possibility for\nthe state to collapse around points, which are far from both \\(h\\) and\n\\(t\\), one easily sees that the probability density for such hittings\n, according to the multiplication rule determining \\(L_i\\), is\npractically zero; moreover, that if such a hitting were to occur,\nafter it is normalized, the wave function of the system would remain\nalmost unchanged.\n\nWe can now discuss the most important feature of the theory: the\nTrigger Mechanism. To understand the way in which the spontaneous\nlocalization mechanism is enhanced by increasing the number of\nparticles which are in far apart spatial regions (as compared to\n\\(d)\\), one can consider, for simplicity, the superposition\n\\(\\ket{S}\\), with equal weights, of two macroscopic pointer states\n\\(\\ket{H}\\) and \\(\\ket{T}\\), corresponding to two different pointer\npositions \\(H\\) and \\(T\\), respectively. Taking into account that the\npointer is ‘almost rigid’ and contains a macroscopic\nnumber \\(N\\) of microscopic constituents, the state can be written, in\nobvious notation, as: \n\n\\[\\tag{4} \\ket{S} = [\\ket{1 \\near h_1} \\ldots \\ket{N \\near h_N} +\n\\ket{1 \\near t_1} \\ldots \\ket{N \\near t_N}], \\]\n\n\nwhere \\(h_i\\) is near \\(H\\), and \\(t_i\\) is near \\(T\\). The states\nappearing in first term on the right-hand side of equation (4) are\ndifferent from zero only when their arguments \\((1,\\ldots ,N)\\) are\nall near \\(H\\), while those of the second term are different from zero\nonly when they are all near \\(T\\). It is now evident that if any of\nthe particles (say, the \\(i\\)-th particle) undergoes a hitting\nprocess, for example around \\(h_i\\), the multiplication prescription\nleads practically to the suppression of the second term in (4). Thus,\nany spontaneous localization of any of the constituents amounts to a\nlocalization of the pointer. The hitting frequency is therefore\neffectively amplified proportionally to the number of constituents.\nNotice that, for simplicity, the argument refers to an almost rigid\nbody, one for which all particles are around \\(H\\) in one of the\nstates of the superposition and around \\(T\\) in the other state. It\nshould however be obvious that what really matters in amplifying the\nreductions is the number of particles which are in different positions\nin the two states appearing in the superposition itself.\n\nUnder these premises we can now proceed to choose the parameters \\(d\\)\nand \\(f\\) of the theory, i.e., the localization accuracy and the mean\nlocalization frequency. The argument given above suggests how one can\nchoose the parameters in such a way that the quantum predictions for\nmicroscopic systems remain fully valid while the embarrassing\nmacroscopic superpositions in measurement-like situations are\nsuppressed in very short times. Accordingly, as a consequence of the\nunified dynamics governing all physical processes, individual\nmacroscopic objects acquire definite macroscopic properties. The\nchoice suggested in the GRW-model is: \n\n\\[\\begin{align}\n\\tag{5}\nf &= 10^{-16} \\text{ s}^{-1} \\\\\nd &= 10^{-5} \\text{ cm} \n\\end{align}\\]\n\n\nIt follows that a microscopic system undergoes a localization, on\naverage, every hundred million years, while a macroscopic one\nundergoes a localization every \\(10^{-7}\\) seconds. With reference to\nthe challenging version of the macro-objectification problem presented\nby Schrödinger with the famous example of his cat, J.S. Bell\ncomments (1987: 44): [within QMSL] the cat is not both dead and\nalive for more than a split second. Besides the extremely low\nfrequency of the hittings for microscopic systems, also the fact that\nthe localization width is large compared to the dimensions of atoms\n(so that even when a localization occurs it does very little violence\nto the internal economy of an atom) plays an important role in\nguaranteeing that no violation of well-tested quantum mechanical\npredictions is implied by the modified dynamics.\n\nContrary to standard quantum mechanics, the GRW theory allows to\nlocate precisely the ‘split’ between micro and macro,\nreversible and irreversible, quantum and classical. This is another\nway of saying that GRW solved the measurement problem. The transition\nbetween the two types of ‘regimes’ is governed by the\nnumber of particles, which are localized by the collapse process. A\nconsequence of this is that GRW makes predictions, which are different\nfrom standard quantum mechanical predictions. We will come back on\nthis important issue.\n\nConcerning the choice of the parameters of the model, it has to be\nstressed that, as it is obvious, the just mentioned transition region\nfrom micro to macro depends crucially on their values. departing from\nthe original choice of GRW, Adler (2003) has suggested to increase the\nvalue of \\(f\\) by a factor of the order of \\(10^9\\). The reasons for\nthis derive from requiring that during latent image formation in\nphotography, the collapse becomes effective right after a grain of the\nemulsion has been excited; this is equivalent to requiring that when a\nhuman eye is hit by few photons (the perceptual threshold being very\nlow) reduction takes place in the rods of the eye (Bassi, Deckert and\nFerialdi 2010). As we will discuss in what follows, if one takes the\noriginal GRW value for \\(f\\), reduction cannot occur in the rods\n(because a relatively small number of molecules—less than\n\\(10^5\\)—are affected), but only during the transmission along\nthe nervous signal within the brain, a process which involves the\ndisplacement of a number of ions of the order of \\(10^{12}\\).\n\nIt is interesting to remark that the drastic change suggested by Adler\n(2003) has physical implications which have already been\nexperimentally falsified, see Curceanu, Hiesmayr, and Piscicchia 2015;\nBassi, Deckert, and Ferialdi 2010; Vinante et al. 2016; and\nToroš and Bassi 2018. \n",
    "section_title": "5. The Original Collapse Model",
    "entry_title": "Collapse Theories",
    "hierarchy_title": "Collapse Theories || The Original Collapse Model",
    "tokenized_text": [
        "original",
        "collapse",
        "model",
        "original",
        "collapse",
        "model",
        "already",
        "mentioned",
        "collapse",
        "theory",
        "going",
        "describe",
        "amount",
        "accepting",
        "modification",
        "standard",
        "evolution",
        "law",
        "quantum",
        "theory",
        "microprocesses",
        "macroprocesses",
        "governed",
        "single",
        "dynamic",
        "dynamic",
        "must",
        "imply",
        "micromacro",
        "interaction",
        "measurement",
        "process",
        "lead",
        "wpr",
        "bearing",
        "mind",
        "recall",
        "characteristic",
        "feature",
        "distinguishing",
        "quantum",
        "evolution",
        "wpr",
        "schrödinger",
        "equation",
        "linear",
        "deterministic",
        "wave",
        "function",
        "level",
        "wpr",
        "nonlinear",
        "stochastic",
        "natural",
        "consider",
        "suggested",
        "first",
        "time",
        "quoted",
        "paper",
        "p",
        "pearle",
        "possibility",
        "nonlinear",
        "stochastic",
        "modification",
        "standard",
        "schrödinger",
        "dynamic",
        "modification",
        "universal",
        "must",
        "satisfy",
        "one",
        "important",
        "requirement",
        "called",
        "trigger",
        "problem",
        "pearle",
        "reduction",
        "mechanism",
        "must",
        "become",
        "effective",
        "going",
        "micro",
        "macro",
        "domain",
        "solution",
        "problem",
        "constitutes",
        "central",
        "feature",
        "collapse",
        "theory",
        "grw",
        "type",
        "discus",
        "point",
        "let",
        "u",
        "briefly",
        "review",
        "grw",
        "model",
        "first",
        "consistent",
        "model",
        "appear",
        "literature",
        "within",
        "model",
        "initially",
        "referred",
        "qmsl",
        "quantum",
        "mechanic",
        "spontaneous",
        "localization",
        "problem",
        "choice",
        "preferred",
        "basis",
        "solved",
        "noting",
        "embarrassing",
        "superposition",
        "macroscopic",
        "level",
        "involving",
        "different",
        "spatial",
        "location",
        "macroscopic",
        "object",
        "actually",
        "einstein",
        "stressed",
        "crucial",
        "point",
        "faced",
        "anybody",
        "aiming",
        "taking",
        "macroobjective",
        "position",
        "natural",
        "phenomenon",
        "macrobody",
        "must",
        "always",
        "quasisharply",
        "defined",
        "position",
        "objective",
        "description",
        "reality",
        "born",
        "accordingly",
        "qmsl",
        "considers",
        "possibility",
        "spontaneous",
        "process",
        "assumed",
        "occur",
        "instantaneously",
        "microscopic",
        "level",
        "tend",
        "suppress",
        "linear",
        "superposition",
        "differently",
        "localized",
        "state",
        "required",
        "trigger",
        "mechanism",
        "must",
        "follow",
        "consistently",
        "key",
        "assumption",
        "qmsl",
        "following",
        "elementary",
        "constituent",
        "physical",
        "system",
        "subjected",
        "random",
        "time",
        "random",
        "spontaneous",
        "localization",
        "process",
        "call",
        "hitting",
        "around",
        "appropriate",
        "position",
        "precise",
        "mathematical",
        "model",
        "one",
        "specific",
        "assumption",
        "making",
        "explicit",
        "process",
        "work",
        "modification",
        "wave",
        "function",
        "induced",
        "localization",
        "occurs",
        "determines",
        "occurrence",
        "localization",
        "certain",
        "position",
        "rather",
        "another",
        "one",
        "finally",
        "time",
        "occurs",
        "answer",
        "question",
        "presented",
        "let",
        "u",
        "consider",
        "system",
        "n",
        "distinguishable",
        "particle",
        "let",
        "u",
        "denote",
        "f",
        "boldsymbol",
        "q",
        "_",
        "boldsymbol",
        "q",
        "_",
        "ldots",
        "boldsymbol",
        "q",
        "_n",
        "coordinate",
        "representation",
        "wave",
        "function",
        "state",
        "vector",
        "disregard",
        "spin",
        "variable",
        "since",
        "hitting",
        "assumed",
        "act",
        "answer",
        "question",
        "hitting",
        "occurs",
        "i",
        "th",
        "particle",
        "point",
        "boldsymbol",
        "x",
        "wave",
        "function",
        "instantaneously",
        "multiplied",
        "gaussian",
        "function",
        "appropriately",
        "normalized",
        "g",
        "boldsymbol",
        "q",
        "_i",
        "boldsymbol",
        "x",
        "k",
        "exp",
        "d",
        "boldsymbol",
        "q",
        "_i",
        "boldsymbol",
        "x",
        "d",
        "represents",
        "localization",
        "accuracy",
        "let",
        "u",
        "denote",
        "l_i",
        "boldsymbol",
        "q",
        "_",
        "boldsymbol",
        "q",
        "_",
        "ldots",
        "boldsymbol",
        "q",
        "_n",
        "boldsymbol",
        "x",
        "f",
        "boldsymbol",
        "q",
        "_",
        "boldsymbol",
        "q",
        "_",
        "ldots",
        "boldsymbol",
        "q",
        "_n",
        "g",
        "boldsymbol",
        "q",
        "_i",
        "boldsymbol",
        "x",
        "wave",
        "function",
        "immediately",
        "localization",
        "yet",
        "unnormalized",
        "localization",
        "occurs",
        "assumed",
        "probability",
        "density",
        "p",
        "boldsymbol",
        "x",
        "taking",
        "place",
        "point",
        "boldsymbol",
        "x",
        "given",
        "square",
        "norm",
        "state",
        "l_i",
        "length",
        "precise",
        "integral",
        "modulus",
        "squared",
        "function",
        "l_i",
        "n",
        "dimensional",
        "space",
        "implies",
        "hitting",
        "occur",
        "higher",
        "probability",
        "place",
        "standard",
        "quantum",
        "description",
        "higher",
        "probability",
        "finding",
        "particle",
        "measurement",
        "performed",
        "remember",
        "case",
        "measurement",
        "performed",
        "hitting",
        "spontaneous",
        "process",
        "note",
        "prescription",
        "introduces",
        "nonlinear",
        "stochastic",
        "element",
        "dynamic",
        "constant",
        "k",
        "appearing",
        "expression",
        "g",
        "boldsymbol",
        "q",
        "_i",
        "boldsymbol",
        "x",
        "chosen",
        "way",
        "integral",
        "p",
        "boldsymbol",
        "x",
        "whole",
        "space",
        "equal",
        "finally",
        "question",
        "answered",
        "assuming",
        "hitting",
        "occur",
        "randomly",
        "distributed",
        "time",
        "according",
        "poisson",
        "distribution",
        "mean",
        "frequency",
        "f",
        "straightforward",
        "see",
        "hitting",
        "process",
        "lead",
        "occurs",
        "localization",
        "state",
        "particle",
        "initially",
        "delocalized",
        "distance",
        "greater",
        "d",
        "simple",
        "example",
        "consider",
        "single",
        "particle",
        "whose",
        "wavefunction",
        "different",
        "zero",
        "two",
        "small",
        "far",
        "apart",
        "region",
        "h",
        "t",
        "suppose",
        "localization",
        "occurs",
        "around",
        "h",
        "state",
        "hitting",
        "appreciably",
        "different",
        "zero",
        "region",
        "around",
        "h",
        "completely",
        "analogous",
        "argument",
        "hold",
        "hitting",
        "take",
        "place",
        "around",
        "t",
        "regarding",
        "possibility",
        "state",
        "collapse",
        "around",
        "point",
        "far",
        "h",
        "t",
        "one",
        "easily",
        "see",
        "probability",
        "density",
        "hitting",
        "according",
        "multiplication",
        "rule",
        "determining",
        "l_i",
        "practically",
        "zero",
        "moreover",
        "hitting",
        "occur",
        "normalized",
        "wave",
        "function",
        "system",
        "would",
        "remain",
        "almost",
        "unchanged",
        "discus",
        "important",
        "feature",
        "theory",
        "trigger",
        "mechanism",
        "understand",
        "way",
        "spontaneous",
        "localization",
        "mechanism",
        "enhanced",
        "increasing",
        "number",
        "particle",
        "far",
        "apart",
        "spatial",
        "region",
        "compared",
        "one",
        "consider",
        "simplicity",
        "superposition",
        "ket",
        "equal",
        "weight",
        "two",
        "macroscopic",
        "pointer",
        "state",
        "ket",
        "h",
        "ket",
        "corresponding",
        "two",
        "different",
        "pointer",
        "position",
        "h",
        "t",
        "respectively",
        "taking",
        "account",
        "pointer",
        "almost",
        "rigid",
        "contains",
        "macroscopic",
        "number",
        "n",
        "microscopic",
        "constituent",
        "state",
        "written",
        "obvious",
        "notation",
        "tag",
        "ket",
        "ket",
        "near",
        "h_",
        "ldots",
        "ket",
        "n",
        "near",
        "h_n",
        "ket",
        "near",
        "t_",
        "ldots",
        "ket",
        "n",
        "near",
        "t_n",
        "h_i",
        "near",
        "h",
        "t_i",
        "near",
        "t",
        "state",
        "appearing",
        "first",
        "term",
        "righthand",
        "side",
        "equation",
        "different",
        "zero",
        "argument",
        "ldots",
        "n",
        "near",
        "h",
        "second",
        "term",
        "different",
        "zero",
        "near",
        "t",
        "evident",
        "particle",
        "say",
        "i",
        "th",
        "particle",
        "undergoes",
        "hitting",
        "process",
        "example",
        "around",
        "h_i",
        "multiplication",
        "prescription",
        "lead",
        "practically",
        "suppression",
        "second",
        "term",
        "thus",
        "spontaneous",
        "localization",
        "constituent",
        "amount",
        "localization",
        "pointer",
        "hitting",
        "frequency",
        "therefore",
        "effectively",
        "amplified",
        "proportionally",
        "number",
        "constituent",
        "notice",
        "simplicity",
        "argument",
        "refers",
        "almost",
        "rigid",
        "body",
        "one",
        "particle",
        "around",
        "h",
        "one",
        "state",
        "superposition",
        "around",
        "t",
        "state",
        "however",
        "obvious",
        "really",
        "matter",
        "amplifying",
        "reduction",
        "number",
        "particle",
        "different",
        "position",
        "two",
        "state",
        "appearing",
        "superposition",
        "premise",
        "proceed",
        "choose",
        "parameter",
        "d",
        "f",
        "theory",
        "ie",
        "localization",
        "accuracy",
        "mean",
        "localization",
        "frequency",
        "argument",
        "given",
        "suggests",
        "one",
        "choose",
        "parameter",
        "way",
        "quantum",
        "prediction",
        "microscopic",
        "system",
        "remain",
        "fully",
        "valid",
        "embarrassing",
        "macroscopic",
        "superposition",
        "measurementlike",
        "situation",
        "suppressed",
        "short",
        "time",
        "accordingly",
        "consequence",
        "unified",
        "dynamic",
        "governing",
        "physical",
        "process",
        "individual",
        "macroscopic",
        "object",
        "acquire",
        "definite",
        "macroscopic",
        "property",
        "choice",
        "suggested",
        "grwmodel",
        "begin",
        "align",
        "tag",
        "f",
        "text",
        "text",
        "cm",
        "end",
        "align",
        "follows",
        "microscopic",
        "system",
        "undergoes",
        "localization",
        "average",
        "every",
        "hundred",
        "million",
        "year",
        "macroscopic",
        "one",
        "undergoes",
        "localization",
        "every",
        "second",
        "reference",
        "challenging",
        "version",
        "macroobjectification",
        "problem",
        "presented",
        "schrödinger",
        "famous",
        "example",
        "cat",
        "js",
        "bell",
        "comment",
        "within",
        "qmsl",
        "cat",
        "dead",
        "alive",
        "split",
        "second",
        "besides",
        "extremely",
        "low",
        "frequency",
        "hitting",
        "microscopic",
        "system",
        "also",
        "fact",
        "localization",
        "width",
        "large",
        "compared",
        "dimension",
        "atom",
        "even",
        "localization",
        "occurs",
        "little",
        "violence",
        "internal",
        "economy",
        "atom",
        "play",
        "important",
        "role",
        "guaranteeing",
        "violation",
        "welltested",
        "quantum",
        "mechanical",
        "prediction",
        "implied",
        "modified",
        "dynamic",
        "contrary",
        "standard",
        "quantum",
        "mechanic",
        "grw",
        "theory",
        "allows",
        "locate",
        "precisely",
        "split",
        "micro",
        "macro",
        "reversible",
        "irreversible",
        "quantum",
        "classical",
        "another",
        "way",
        "saying",
        "grw",
        "solved",
        "measurement",
        "problem",
        "transition",
        "two",
        "type",
        "regime",
        "governed",
        "number",
        "particle",
        "localized",
        "collapse",
        "process",
        "consequence",
        "grw",
        "make",
        "prediction",
        "different",
        "standard",
        "quantum",
        "mechanical",
        "prediction",
        "come",
        "back",
        "important",
        "issue",
        "concerning",
        "choice",
        "parameter",
        "model",
        "stressed",
        "obvious",
        "mentioned",
        "transition",
        "region",
        "micro",
        "macro",
        "depends",
        "crucially",
        "value",
        "departing",
        "original",
        "choice",
        "grw",
        "adler",
        "suggested",
        "increase",
        "value",
        "f",
        "factor",
        "order",
        "reason",
        "derive",
        "requiring",
        "latent",
        "image",
        "formation",
        "photography",
        "collapse",
        "becomes",
        "effective",
        "right",
        "grain",
        "emulsion",
        "excited",
        "equivalent",
        "requiring",
        "human",
        "eye",
        "hit",
        "photon",
        "perceptual",
        "threshold",
        "low",
        "reduction",
        "take",
        "place",
        "rod",
        "eye",
        "basso",
        "deckert",
        "ferialdi",
        "discus",
        "follows",
        "one",
        "take",
        "original",
        "grw",
        "value",
        "f",
        "reduction",
        "occur",
        "rod",
        "relatively",
        "small",
        "number",
        "moleculesless",
        "are",
        "affected",
        "transmission",
        "along",
        "nervous",
        "signal",
        "within",
        "brain",
        "process",
        "involves",
        "displacement",
        "number",
        "ion",
        "order",
        "interesting",
        "remark",
        "drastic",
        "change",
        "suggested",
        "adler",
        "physical",
        "implication",
        "already",
        "experimentally",
        "falsified",
        "see",
        "curceanu",
        "hiesmayr",
        "piscicchia",
        "basso",
        "deckert",
        "ferialdi",
        "vinante",
        "et",
        "al",
        "toroš",
        "basso"
    ]
}