{
    "main_text": "Many Worlds\n7. Many Worlds\n\nWhile he was initially skeptical of Everett’s project, DeWitt\nbecame an ardent proponent of the many-worlds interpretation, a theory\nthat DeWitt presented as the EWG interpretation of quantum mechanics\n(named after Everett, Wheeler, and DeWitt’s graduate student R.\nNeill Graham). In his description of the many-worlds interpretation,\nDeWitt (1970) emphasized that its central feature was the metaphysical\ncommitment to physically splitting worlds. DeWitt’s description\nsubsequently became the most popular understanding of Everett’s\ntheory. See Barrett (2011b) for a discussion of Everett’s\nhistorical attitude toward DeWitt and the many-worlds interpretation.\nSee Lewis (2016), Saunders, Barrett, Kent, and Wallace (eds) (2010),\nVaidman (2012), Wallace (2010a) (2010b) (2012), Sebens (2015), Sebens\nand Carroll (2018), and the entry\n many-worlds interpretation of quantum mechanics\n for discussions of a number of quite different many-worlds\ninterpretations.\n\nDeWitt described his theory in the context of the\nSchrödinger’s cat thought experiment.\n\nThe animal [is] trapped in a room together with a Geiger counter and a\nhammer, which, upon discharge of the counter, smashes a flask of\nprussic acid. The counter contains a trace of radioactive\nmaterial—just enough that in one hour there is a 50% chance one\nof the nuclei will decay and therefore an equal chance the cat will be\npoisoned. At the end of the hour the total wave function for the\nsystem will have a form in which the living cat and the dead cat are\nmixed in equal portions. Schrödinger felt that the wave mechanics\nthat led to this paradox presented an unacceptable description of\nreality. However, Everett, Wheeler and Graham’s interpretation\nof quantum mechanics pictures the cats as inhabiting two simultaneous,\nnoninteracting, but equally real worlds. (1970, 31)\n\n\nDeWitt took this view to follow from “the mathematical formalism\nof quantum mechanics as it stands without adding anything to\nit.” More specifically, he claimed that EWG had proven a\nmetatheorem that the mathematical formalism of pure wave mechanics\ninterprets itself:\n\nWithout drawing on any external metaphysics or mathematics other than\nthe standard rules of logic, EWG are able, from these postulates, to\nprove the following metatheorem: The mathematical formalism of the\nquantum theory is capable of yielding its own interpretation. (1970,\n33)\n\n\nHe gave Everett credit for the metatheorem, Wheeler credit for\nencouraging Everett, and Graham credit for clarifying the metatheorem.\nDeWitt and Graham later described Everett’s formulation of\nquantum mechanics as follows:\n\n[It] denies the existence of a separate classical realm and asserts\nthat it makes sense to talk about a state vector for the whole\nuniverse. This state vector never collapses and hence reality as a\nwhole is rigorously deterministic. This reality, which is described\njointly by the dynamical variables and the state vector, is\nnot the reality we customarily think of, but is a reality composed of\nmany worlds. By virtue of the temporal development of the dynamical\nvariables the state vector decomposes naturally into orthogonal\nvectors, reflecting a continual splitting of the universe into a\nmultitude of mutually unobservable but equally real worlds, in each of\nwhich every good measurement has yielded a definite result and in most\nof which the familiar statistical quantum laws hold (1973, v).\n\n\nThe metaphysics of splitting worlds immediately addresses the\ndeterminate result problem. As DeWitt notes, after an observer makes a\nmeasurement, each resultant copy of the observer will inhabit a\nphysical world described by a branch of the global state and endowed\nwith with a fully determinate physical record. But inasmuch as the\npre-measurement observer can expect to find herself in each\npost-measurement world, there remains a problem accounting for the\nstandard quantum probabilities. It appears that the forward-looking\nprobability of each possible measurement result is precisely one. We\nwill return to this issue in a moment.\n\nThere is a conceptual cost in getting determinate measurement records\nby stipulating splitting worlds. DeWitt conceded that he had found the\nconstant splitting of worlds whenever the states of systems become\ncorrelated to be strongly counterintuitive:\n\nI still recall vividly the shock I experienced on first encountering\nthis multiworld concept. The idea of \\(10^{100}\\) slightly imperfect\ncopies of oneself all constantly splitting into further copies, which\nultimately become unrecognizable, is not easy to reconcile with common\nsense. Here is schizophrenia with a vengeance (1973, 161).\n\n\nThat said, DeWitt promoted the theory at every turn, and\nEverett’s views quickly came to be identified with DeWitt and\nGraham’s many-worlds interpretation. It is instructive to\nconsider how DeWitt’s views differ from Everett’s.\n\nTo begin, since purely mathematical postulates entail only purely\nmathematical theorems, one cannot deduce any metaphysical commitments\nwhatsoever regarding the physical world from the mathematical\nformalism of pure wave mechanics alone. The formalism of pure wave\nmechanics might entail the sort of commitments that DeWitt envisioned\nbut only if supplemented with sufficiently strong auxiliary\nassumptions. For his part, Everett seems to have clearly understood\nthis this point. Concerning DeWitt’s claim that pure wave\nmechanics somehow interprets itself by way of a metatheorem that\nEverett proved, there is nothing answering to DeWitt’s\ndescription of this metatheorem in either Everett’s long or\nshort thesis.\n\nFurther, contrary to what DeWitt, Graham, and others have supposed,\nEverett was never committed to “mutually unobservable\nworlds.” In contrast, as we have seen, Everett held that it is\nalways in principle possible for branches to interact. In this regard,\nhe argued that “no matter what the state of [the observer in\nEverett’s version of the Wigner’s Friend story] is, there\nis in principle a complete set of commuting operators for which it is\nan eigenstate, so that, at least, the determination of these\nquantities will not affect the state nor in any way.” He also\ndenied that there are fundamental restrictions about the\n“knowability of any state functions.” And he\nbelieved that the sense in which all branches of the global state are\nequally actual is given by the ever present possibility of interaction\nbetween branches.\n\nIn identifying Everett’s theory with Graham’s many-world\nreconstruction there is good reason to believe that DeWitt simply\nfailed to understand Everett. We know what Everett thought of DeWitt\nand Graham’s formulation of the theory. In his personal copy of\nDeWitt’s description of the many-worlds interpretation, Everett\nwrote the word “bullshit” next to the passage where DeWitt\npresented Graham’s discussion of the branching process and\nEverett’s typicality measure. See Barrett and Byrne 2012,\n364–6 for scans of Everett’s handwritten marginal\nnotes.\n\nFinally, Everett carefully avoided the metaphysical talk of worlds.\nRather, his understanding of the reality of branches was operational.\nFor Everett there was no canonical basis. Given how he understood\nbranches and their role in determining the empirical faithfulness of\nthe theory, he had no need of a physically preferred basis. He\nbelieved that it was sufficient if one could find our experience in a\nmodeled observer’s typical relative records. In contrast, DeWitt\nseems to have had in mind a canonically preferred basis that would\ndetermine what worlds there are and their state.\n\nWhile Everett himself did not do so, one might designate a special set\nof branches of the global absolute state to represent worlds, or\nemergent worlds, or approximate emergent worlds. But there are many\nways one might do this, and how one understands such worlds cannot be\ndetermined solely by the mathematical formalism of pure wave mechanics\nalone. Easily the most popular sort of many-worlds theory at present\ncharacterizes approximate emergent worlds in terms of decoherence\nconditions.\n\nIn contrast with DeWitt, who appears to have taken worlds to be basic\nentities described by the global absolute state, David Wallace (2002,\n2010a, 2010b, and 2012) takes the global quantum state as basic, then\nseeks to characterize worlds as emergent entities represented in its\nstructure. The analogy he gives is that pure wave mechanics describes\nthe quantum state just as classical field theory describes physical\nfields (2010a, 69). Worlds are understood as physically real but\ncontingently emergent entities that are identified with approximate\nsubstructures of the quantum state, or as Wallace puts it,\n“mutually dynamically isolated structures instantiated within\nthe quantum state, which are structurally and dynamically\n‘quasiclassical’” (2010a, 70). Since the fundamental\ntheory is supposed to be pure wave mechanics, such emergent worlds\nwill be more or less well-defined and more and less well-isolated on\nthe linear dynamics depending on details of the physical situation and\nthe level of description one considers.\n\nOn Wallace’s account, there is no simple matter of fact\nconcerning what, or even how many, emergent worlds there are. Such\nquestions depend on one’s level of description and on how\nwell-isolated one requires worlds to be for the explanatory\nconsiderations at hand. That said, the decohering worlds approach\nprovides something that is characterized by the evolution of\nthe global state on which alternative measurement records might\nsupervene. In this case, one need not stipulate a physically preferred\nbasis as it is decoherence conditions that individuate alternative\nquasi-determinate worlds at a given level of description. One gets a\ndeterminate measurement result because, at a level of description\nappropriate for characterizing the properties of macroscopic systems,\none in fact inhabits an emergent world containing a determinate\nrecord.\n\nThere remains, however, the problem of accounting for standard quantum\nprobabilities. Taking the decision-theoretic approach of David Deutsch\n(1997, 1999) as a starting point, Wallace (2010b) proves a\nrepresentation theorem from ten constraints on the preferences of a\nrational agent in the context of a world described by pure wave\nmechanics. If an agent acts as required by these constraints, she will\nact as if she expects future events with the standard quantum\nprobabilities. Wallace understands these constraints as basic\nprinciples of reason, but inasmuch as they only make sense in the\ncontext of pure wave mechanics, they are perhaps best understood as\nauxiliary assumptions that, in conjunction with pure wave mechanics,\nexplain why an agent might act as if the standard quantum\nprobabilities held when in fact every physically possible outcome of\nher actions is fully realized. There is, of course, nothing wrong with\nsupplementing pure wave mechanics with whatever auxiliary assumptions\none needs to derive a suitable version of the standard quantum\nprobabilities. See Wallace (2003, 2006, 2007, 2010b, and 2012) and\nGreaves (2006) for further discussions of quantum probabilities and\nepistemology on a decision-theoretic approach to pure wave\nmechanics.\n\nGranting such auxiliary assumptions, making sense of standard forward\nlooking quantum probabilities requires further care. Before making an\nobservation, an observer knows that every physically possible\nmeasurement result will certainly occur. One wants to say that she\nwill expect to find herself in each resulting world with the standard\nquantum probabilities after the measurement interaction, but if there\nis just one pre-measurement observer, then inasmuch as she gets any\nresult at all, she will get every possible result. One way around this\nis to suppose that for every post-measurement observer there is\nalready a corresponding pre-measurement observer. Each of these\npre-measurement observers is unsure which post-measurement observer is\nher future self. Forward looking quantum probabilities represent this\nepistemic uncertainty. On this strategy, then, one seeks to add\nauxiliary assumptions to pure wave mechanics sufficient to provide\nstandard forward-looking quantum probabilities as epistemic\nself-location probabilities concerning which full history\ncharacterizes one’s experience. If one is successful, the\nresultant theory might be taken to be empirically adequate in a\nperfectly ordinary sense. Saunders and Wallace’s (2008a, 2008b)\ndivergent worlds account and Barrett’s (1999) many-threads\ntheory seek to exploit this strategy. See Lewis (2016) for a critical\nexamination of the divergent worlds approach to forward looking\nprobabilities. See Saunders, Barrett, Kent, and Wallace (2010) and the\nentry on the\n many-worlds interpretation of quantum mechanics\n for other approaches to getting synchronic and, in some cases,\nforward-looking self-location probabilities.\n",
    "section_title": "7. Many Worlds",
    "entry_title": "Everettian Quantum Mechanics",
    "hierarchy_title": "Everettian Quantum Mechanics || Many Worlds",
    "tokenized_text": [
        "many",
        "world",
        "many",
        "world",
        "initially",
        "skeptical",
        "everett",
        "project",
        "dewitt",
        "became",
        "ardent",
        "proponent",
        "manyworlds",
        "interpretation",
        "theory",
        "dewitt",
        "presented",
        "ewg",
        "interpretation",
        "quantum",
        "mechanic",
        "named",
        "everett",
        "wheeler",
        "dewitt",
        "graduate",
        "student",
        "r",
        "neill",
        "graham",
        "description",
        "manyworlds",
        "interpretation",
        "dewitt",
        "emphasized",
        "central",
        "feature",
        "metaphysical",
        "commitment",
        "physically",
        "splitting",
        "world",
        "dewitt",
        "description",
        "subsequently",
        "became",
        "popular",
        "understanding",
        "everett",
        "theory",
        "see",
        "barrett",
        "b",
        "discussion",
        "everett",
        "historical",
        "attitude",
        "toward",
        "dewitt",
        "manyworlds",
        "interpretation",
        "see",
        "lewis",
        "saunders",
        "barrett",
        "kent",
        "wallace",
        "ed",
        "vaidman",
        "wallace",
        "a",
        "b",
        "sebens",
        "sebens",
        "carroll",
        "entry",
        "manyworlds",
        "interpretation",
        "quantum",
        "mechanic",
        "discussion",
        "number",
        "quite",
        "different",
        "manyworlds",
        "interpretation",
        "dewitt",
        "described",
        "theory",
        "context",
        "schrödinger",
        "cat",
        "thought",
        "experiment",
        "animal",
        "trapped",
        "room",
        "together",
        "geiger",
        "counter",
        "hammer",
        "upon",
        "discharge",
        "counter",
        "smash",
        "flask",
        "prussic",
        "acid",
        "counter",
        "contains",
        "trace",
        "radioactive",
        "materialjust",
        "enough",
        "one",
        "hour",
        "chance",
        "one",
        "nucleus",
        "decay",
        "therefore",
        "equal",
        "chance",
        "cat",
        "poisoned",
        "end",
        "hour",
        "total",
        "wave",
        "function",
        "system",
        "form",
        "living",
        "cat",
        "dead",
        "cat",
        "mixed",
        "equal",
        "portion",
        "schrödinger",
        "felt",
        "wave",
        "mechanic",
        "led",
        "paradox",
        "presented",
        "unacceptable",
        "description",
        "reality",
        "however",
        "everett",
        "wheeler",
        "graham",
        "interpretation",
        "quantum",
        "mechanic",
        "picture",
        "cat",
        "inhabiting",
        "two",
        "simultaneous",
        "noninteracting",
        "equally",
        "real",
        "world",
        "dewitt",
        "took",
        "view",
        "follow",
        "mathematical",
        "formalism",
        "quantum",
        "mechanic",
        "stand",
        "without",
        "adding",
        "anything",
        "it",
        "specifically",
        "claimed",
        "ewg",
        "proven",
        "metatheorem",
        "mathematical",
        "formalism",
        "pure",
        "wave",
        "mechanic",
        "interprets",
        "without",
        "drawing",
        "external",
        "metaphysics",
        "mathematics",
        "standard",
        "rule",
        "logic",
        "ewg",
        "able",
        "postulate",
        "prove",
        "following",
        "metatheorem",
        "mathematical",
        "formalism",
        "quantum",
        "theory",
        "capable",
        "yielding",
        "interpretation",
        "gave",
        "everett",
        "credit",
        "metatheorem",
        "wheeler",
        "credit",
        "encouraging",
        "everett",
        "graham",
        "credit",
        "clarifying",
        "metatheorem",
        "dewitt",
        "graham",
        "later",
        "described",
        "everett",
        "formulation",
        "quantum",
        "mechanic",
        "follows",
        "denies",
        "existence",
        "separate",
        "classical",
        "realm",
        "asserts",
        "make",
        "sense",
        "talk",
        "state",
        "vector",
        "whole",
        "universe",
        "state",
        "vector",
        "never",
        "collapse",
        "hence",
        "reality",
        "whole",
        "rigorously",
        "deterministic",
        "reality",
        "described",
        "jointly",
        "dynamical",
        "variable",
        "state",
        "vector",
        "reality",
        "customarily",
        "think",
        "reality",
        "composed",
        "many",
        "world",
        "virtue",
        "temporal",
        "development",
        "dynamical",
        "variable",
        "state",
        "vector",
        "decomposes",
        "naturally",
        "orthogonal",
        "vector",
        "reflecting",
        "continual",
        "splitting",
        "universe",
        "multitude",
        "mutually",
        "unobservable",
        "equally",
        "real",
        "world",
        "every",
        "good",
        "measurement",
        "yielded",
        "definite",
        "result",
        "familiar",
        "statistical",
        "quantum",
        "law",
        "hold",
        "v",
        "metaphysics",
        "splitting",
        "world",
        "immediately",
        "address",
        "determinate",
        "result",
        "problem",
        "dewitt",
        "note",
        "observer",
        "make",
        "measurement",
        "resultant",
        "copy",
        "observer",
        "inhabit",
        "physical",
        "world",
        "described",
        "branch",
        "global",
        "state",
        "endowed",
        "fully",
        "determinate",
        "physical",
        "record",
        "inasmuch",
        "premeasurement",
        "observer",
        "expect",
        "find",
        "postmeasurement",
        "world",
        "remains",
        "problem",
        "accounting",
        "standard",
        "quantum",
        "probability",
        "appears",
        "forwardlooking",
        "probability",
        "possible",
        "measurement",
        "result",
        "precisely",
        "one",
        "return",
        "issue",
        "moment",
        "conceptual",
        "cost",
        "getting",
        "determinate",
        "measurement",
        "record",
        "stipulating",
        "splitting",
        "world",
        "dewitt",
        "conceded",
        "found",
        "constant",
        "splitting",
        "world",
        "whenever",
        "state",
        "system",
        "become",
        "correlated",
        "strongly",
        "counterintuitive",
        "still",
        "recall",
        "vividly",
        "shock",
        "experienced",
        "first",
        "encountering",
        "multiworld",
        "concept",
        "idea",
        "slightly",
        "imperfect",
        "copy",
        "oneself",
        "constantly",
        "splitting",
        "copy",
        "ultimately",
        "become",
        "unrecognizable",
        "easy",
        "reconcile",
        "common",
        "sense",
        "schizophrenia",
        "vengeance",
        "said",
        "dewitt",
        "promoted",
        "theory",
        "every",
        "turn",
        "everett",
        "view",
        "quickly",
        "came",
        "identified",
        "dewitt",
        "graham",
        "manyworlds",
        "interpretation",
        "instructive",
        "consider",
        "dewitt",
        "view",
        "differ",
        "everett",
        "begin",
        "since",
        "purely",
        "mathematical",
        "postulate",
        "entail",
        "purely",
        "mathematical",
        "theorem",
        "one",
        "deduce",
        "metaphysical",
        "commitment",
        "whatsoever",
        "regarding",
        "physical",
        "world",
        "mathematical",
        "formalism",
        "pure",
        "wave",
        "mechanic",
        "alone",
        "formalism",
        "pure",
        "wave",
        "mechanic",
        "might",
        "entail",
        "sort",
        "commitment",
        "dewitt",
        "envisioned",
        "supplemented",
        "sufficiently",
        "strong",
        "auxiliary",
        "assumption",
        "part",
        "everett",
        "seems",
        "clearly",
        "understood",
        "point",
        "concerning",
        "dewitt",
        "claim",
        "pure",
        "wave",
        "mechanic",
        "somehow",
        "interprets",
        "way",
        "metatheorem",
        "everett",
        "proved",
        "nothing",
        "answering",
        "dewitt",
        "description",
        "metatheorem",
        "either",
        "everett",
        "long",
        "short",
        "thesis",
        "contrary",
        "dewitt",
        "graham",
        "others",
        "supposed",
        "everett",
        "never",
        "committed",
        "mutually",
        "unobservable",
        "worlds",
        "contrast",
        "seen",
        "everett",
        "held",
        "always",
        "principle",
        "possible",
        "branch",
        "interact",
        "regard",
        "argued",
        "matter",
        "state",
        "observer",
        "everett",
        "version",
        "wigner",
        "friend",
        "story",
        "principle",
        "complete",
        "set",
        "commuting",
        "operator",
        "eigenstate",
        "least",
        "determination",
        "quantity",
        "affect",
        "state",
        "way",
        "also",
        "denied",
        "fundamental",
        "restriction",
        "knowability",
        "state",
        "functions",
        "believed",
        "sense",
        "branch",
        "global",
        "state",
        "equally",
        "actual",
        "given",
        "ever",
        "present",
        "possibility",
        "interaction",
        "branch",
        "identifying",
        "everett",
        "theory",
        "graham",
        "manyworld",
        "reconstruction",
        "good",
        "reason",
        "believe",
        "dewitt",
        "simply",
        "failed",
        "understand",
        "everett",
        "know",
        "everett",
        "thought",
        "dewitt",
        "graham",
        "formulation",
        "theory",
        "personal",
        "copy",
        "dewitt",
        "description",
        "manyworlds",
        "interpretation",
        "everett",
        "wrote",
        "word",
        "bullshit",
        "next",
        "passage",
        "dewitt",
        "presented",
        "graham",
        "discussion",
        "branching",
        "process",
        "everett",
        "typicality",
        "measure",
        "see",
        "barrett",
        "byrne",
        "scan",
        "everett",
        "handwritten",
        "marginal",
        "note",
        "finally",
        "everett",
        "carefully",
        "avoided",
        "metaphysical",
        "talk",
        "world",
        "rather",
        "understanding",
        "reality",
        "branch",
        "operational",
        "everett",
        "canonical",
        "basis",
        "given",
        "understood",
        "branch",
        "role",
        "determining",
        "empirical",
        "faithfulness",
        "theory",
        "need",
        "physically",
        "preferred",
        "basis",
        "believed",
        "sufficient",
        "one",
        "could",
        "find",
        "experience",
        "modeled",
        "observer",
        "typical",
        "relative",
        "record",
        "contrast",
        "dewitt",
        "seems",
        "mind",
        "canonically",
        "preferred",
        "basis",
        "would",
        "determine",
        "world",
        "state",
        "everett",
        "one",
        "might",
        "designate",
        "special",
        "set",
        "branch",
        "global",
        "absolute",
        "state",
        "represent",
        "world",
        "emergent",
        "world",
        "approximate",
        "emergent",
        "world",
        "many",
        "way",
        "one",
        "might",
        "one",
        "understands",
        "world",
        "determined",
        "solely",
        "mathematical",
        "formalism",
        "pure",
        "wave",
        "mechanic",
        "alone",
        "easily",
        "popular",
        "sort",
        "manyworlds",
        "theory",
        "present",
        "characterizes",
        "approximate",
        "emergent",
        "world",
        "term",
        "decoherence",
        "condition",
        "contrast",
        "dewitt",
        "appears",
        "taken",
        "world",
        "basic",
        "entity",
        "described",
        "global",
        "absolute",
        "state",
        "david",
        "wallace",
        "a",
        "b",
        "take",
        "global",
        "quantum",
        "state",
        "basic",
        "seek",
        "characterize",
        "world",
        "emergent",
        "entity",
        "represented",
        "structure",
        "analogy",
        "give",
        "pure",
        "wave",
        "mechanic",
        "describes",
        "quantum",
        "state",
        "classical",
        "field",
        "theory",
        "describes",
        "physical",
        "field",
        "a",
        "world",
        "understood",
        "physically",
        "real",
        "contingently",
        "emergent",
        "entity",
        "identified",
        "approximate",
        "substructure",
        "quantum",
        "state",
        "wallace",
        "put",
        "mutually",
        "dynamically",
        "isolated",
        "structure",
        "instantiated",
        "within",
        "quantum",
        "state",
        "structurally",
        "dynamically",
        "quasiclassical",
        "a",
        "since",
        "fundamental",
        "theory",
        "supposed",
        "pure",
        "wave",
        "mechanic",
        "emergent",
        "world",
        "le",
        "welldefined",
        "le",
        "wellisolated",
        "linear",
        "dynamic",
        "depending",
        "detail",
        "physical",
        "situation",
        "level",
        "description",
        "one",
        "considers",
        "wallace",
        "account",
        "simple",
        "matter",
        "fact",
        "concerning",
        "even",
        "many",
        "emergent",
        "world",
        "question",
        "depend",
        "one",
        "level",
        "description",
        "wellisolated",
        "one",
        "requires",
        "world",
        "explanatory",
        "consideration",
        "hand",
        "said",
        "decohering",
        "world",
        "approach",
        "provides",
        "something",
        "characterized",
        "evolution",
        "global",
        "state",
        "alternative",
        "measurement",
        "record",
        "might",
        "supervene",
        "case",
        "one",
        "need",
        "stipulate",
        "physically",
        "preferred",
        "basis",
        "decoherence",
        "condition",
        "individuate",
        "alternative",
        "quasideterminate",
        "world",
        "given",
        "level",
        "description",
        "one",
        "get",
        "determinate",
        "measurement",
        "result",
        "level",
        "description",
        "appropriate",
        "characterizing",
        "property",
        "macroscopic",
        "system",
        "one",
        "fact",
        "inhabits",
        "emergent",
        "world",
        "containing",
        "determinate",
        "record",
        "remains",
        "however",
        "problem",
        "accounting",
        "standard",
        "quantum",
        "probability",
        "taking",
        "decisiontheoretic",
        "approach",
        "david",
        "deutsch",
        "starting",
        "point",
        "wallace",
        "b",
        "prof",
        "representation",
        "theorem",
        "ten",
        "constraint",
        "preference",
        "rational",
        "agent",
        "context",
        "world",
        "described",
        "pure",
        "wave",
        "mechanic",
        "agent",
        "act",
        "required",
        "constraint",
        "act",
        "expects",
        "future",
        "event",
        "standard",
        "quantum",
        "probability",
        "wallace",
        "understands",
        "constraint",
        "basic",
        "principle",
        "reason",
        "inasmuch",
        "make",
        "sense",
        "context",
        "pure",
        "wave",
        "mechanic",
        "perhaps",
        "best",
        "understood",
        "auxiliary",
        "assumption",
        "conjunction",
        "pure",
        "wave",
        "mechanic",
        "explain",
        "agent",
        "might",
        "act",
        "standard",
        "quantum",
        "probability",
        "held",
        "fact",
        "every",
        "physically",
        "possible",
        "outcome",
        "action",
        "fully",
        "realized",
        "course",
        "nothing",
        "wrong",
        "supplementing",
        "pure",
        "wave",
        "mechanic",
        "whatever",
        "auxiliary",
        "assumption",
        "one",
        "need",
        "derive",
        "suitable",
        "version",
        "standard",
        "quantum",
        "probability",
        "see",
        "wallace",
        "b",
        "greave",
        "discussion",
        "quantum",
        "probability",
        "epistemology",
        "decisiontheoretic",
        "approach",
        "pure",
        "wave",
        "mechanic",
        "granting",
        "auxiliary",
        "assumption",
        "making",
        "sense",
        "standard",
        "forward",
        "looking",
        "quantum",
        "probability",
        "requires",
        "care",
        "making",
        "observation",
        "observer",
        "know",
        "every",
        "physically",
        "possible",
        "measurement",
        "result",
        "certainly",
        "occur",
        "one",
        "want",
        "say",
        "expect",
        "find",
        "resulting",
        "world",
        "standard",
        "quantum",
        "probability",
        "measurement",
        "interaction",
        "one",
        "premeasurement",
        "observer",
        "inasmuch",
        "get",
        "result",
        "get",
        "every",
        "possible",
        "result",
        "one",
        "way",
        "around",
        "suppose",
        "every",
        "postmeasurement",
        "observer",
        "already",
        "corresponding",
        "premeasurement",
        "observer",
        "premeasurement",
        "observer",
        "unsure",
        "postmeasurement",
        "observer",
        "future",
        "self",
        "forward",
        "looking",
        "quantum",
        "probability",
        "represent",
        "epistemic",
        "uncertainty",
        "strategy",
        "one",
        "seek",
        "add",
        "auxiliary",
        "assumption",
        "pure",
        "wave",
        "mechanic",
        "sufficient",
        "provide",
        "standard",
        "forwardlooking",
        "quantum",
        "probability",
        "epistemic",
        "selflocation",
        "probability",
        "concerning",
        "full",
        "history",
        "characterizes",
        "one",
        "experience",
        "one",
        "successful",
        "resultant",
        "theory",
        "might",
        "taken",
        "empirically",
        "adequate",
        "perfectly",
        "ordinary",
        "sense",
        "saunders",
        "wallace",
        "a",
        "b",
        "divergent",
        "world",
        "account",
        "barrett",
        "manythreads",
        "theory",
        "seek",
        "exploit",
        "strategy",
        "see",
        "lewis",
        "critical",
        "examination",
        "divergent",
        "world",
        "approach",
        "forward",
        "looking",
        "probability",
        "see",
        "saunders",
        "barrett",
        "kent",
        "wallace",
        "entry",
        "manyworlds",
        "interpretation",
        "quantum",
        "mechanic",
        "approach",
        "getting",
        "synchronic",
        "case",
        "forwardlooking",
        "selflocation",
        "probability"
    ]
}