{
    "main_text": "The Transactional Interpretation\n5. The Transactional Interpretation\n\nThis entry so far has considered the two most significant motivating\narguments in favor of adopting retrocausality as a hypothesis for\ndealing with the interpretational challenges of quantum theory. But\nthese motivations do not by themselves amount to an interpretation or\nmodel of quantum theory.\n §6\n consists of a survey of a range of retrocausal models, but this\nsection first considers perhaps the most prominent retrocausal model,\nthe transactional interpretation. Developed by Cramer in the 1980s\n(Cramer 1980, 1986, 1988), the transactional interpretation is heavily\ninfluenced by the framework of the Wheeler-Feynman absorber approach\nto electrodynamics (see\n §1);\n the Wheeler-Feynman schema can be adopted to describe the microscopic\nexchange of a single quantum of energy, momentum, etc.,\nbetween and within quantum systems.\n\nAt the heart of the transactional interpretation is the\n“transaction”: real physical events are identified with\nso-called “handshakes” between forward-evolving quantum\nstates \\(\\psi\\) and backward-evolving complex-conjugates \\(\\psi^*\\).\nWhen a quantum emitter (such as a vibrating electron or atom in an\nexcited state) is to emit a single quantum (a photon, in these cases),\nthe source produces a radiative field—the “offer”\nwave. Analogously to the Wheeler-Feynman description, this field\npropagates outwards both forward and backward in time (as well as\nacross space). When this field encounters an absorber, a new field is\ngenerated—the “confirmation” wave—that\nlikewise propagates both forward and backward in time, and so is\npresent as an advanced incident wave at the emitter at the instant of\nemission. Both the retarded field produced by the absorber and the\nadvanced field produced by the emitter exactly cancel with the\nretarded field produced by the emitter and advanced field produced by\nthe absorber for all times before the emission and after the\nabsorption of the photon; only between the emitter and the absorber is\nthere a radiative field. Thus the transaction is completed with this\n“handshake”: a cycle of offer and confirmation waves \n\n\nrepeats until the response of the emitter and absorber is sufficient\nto satisfy all of the quantum boundary conditions…at which\npoint the transaction is completed. (Cramer 1986: 662) \n\n\nMany confirmation waves from potential absorbers may converge on the\nemitter at the time of emission but the quantum boundary conditions\ncan usually only permit a single transaction to form. Any observer who\nwitnesses this process would perceive only the completed transaction,\nwhich would be interpreted as the passage of a particle (e.g., a\nphoton) between emitter and absorber.\n\nThe transactional interpretation takes the wave function to be a real\nphysical wave with spatial extent. The wave function of the quantum\nmechanical formalism is identical with the initial offer wave of the\ntransaction mechanism and the collapsed wave function is identical\nwith the completed transaction. Quantum particles are thus not to be\nthought of as represented by the wave function but rather by the\ncompleted transaction, of which the wave function is only the initial\nphase. As Cramer explains:\n\n\nThe transaction may involve a single emitter and absorber or multiple\nemitters and absorbers, but it is only complete when appropriate\nboundary conditions are satisfied at all loci of emission and\nabsorption. Particles transferred have no separate identity\nindependent from the satisfaction of these boundary conditions. (1986:\n666)\n\n\nThe amplitude of the confirmation wave which is produced by the\nabsorber is proportional to the local amplitude of the incident wave\nthat stimulated it and this, in turn, is dependent on the attenuation\nit received as it propagated from the source. Thus, the total\namplitude of the confirmation wave is just the absolute square of the\ninitial offer wave (evaluated at the absorber), which yields the Born\nrule. Since the Born rule arises as a product of the transaction\nmechanism, there is no special significance attached to the role of\nthe observer in the act of measurement. The “collapse of the\nwave function” is interpreted as the completion of the\ntransaction.\n\nThe transactional interpretation explicitly interprets the quantum\nstate \\(\\psi\\) as real, and so does not constitute an attempt to\nexploit the retrocausality loopholes to the theorems that rule out\n\\(\\psi\\)-epistemic accounts. Additionally, the transactional\ninterpretation subverts the dilemma at the core of the EPR argument\n(Einstein, et al. 1935) by permitting incompatible observables to take\non definite values simultaneously: the wavefunction, according to the\ntransactional interpretation,\n\n\nbrings to each potential absorber the full range of possible outcomes,\nand all have “simultaneous reality” in the EPR sense. The\nabsorber interacts so as to cause one of these outcomes to emerge in\nthe transaction, so that the collapsed [wavefunction] manifests only\none of these outcomes. (Cramer 1986: 668).\n\n\nMost importantly, however, the transactional interpretation employs\nboth retarded and advanced waves, and in doing so admits the\npossibility of providing a “zigzag” explanation of the\nnonlocality associated with entangled quantum systems.\n\nBefore turning to one of the more significant objections to the\ntransactional interpretation, and to retrocausality in general, it is\ninstructive to tease apart here two complementary descriptions of this\ntransaction process. On the one hand there is a description of the\nreal physical process, consisting of the passage of a particle between\nemitter and absorber, that a temporally bound experimenter would\nobserve; and on the other hand there is a description of a dynamical\nprocess of offer and confirmation waves that is instrumental in\nestablishing the transaction. This latter process simply cannot occur\nin an ordinary time sequence, not least because any temporally bound\nobserver by construction cannot detect any offer or confirmation\nwaves. Cramer suggests that the “dynamical process” be\nunderstood as occurring in a “pseudotime” sequence:\n\n\nThe account of an emitter-absorber transaction presented here employs\nthe semantic device of describing a process extending across a\nlightlike or a timelike interval of space-time as if it occurred in a\ntime sequence external to the process. The reader is reminded that\nthis is only a pedagogical convention for the purposes of description.\nThe process is atemporal and the only observables come from the\nsuperposition of all “steps” to form the final\ntransaction. (Cramer 1986: 661, fn.14)\n\n\nThese steps are of course the cyclically repeated exchange of offer\nand confirmation waves which continue “until the net exchange of\nenergy and other conserved quantities satisfies the quantum boundary\nconditions of the system” (1986: 662). There is a strong sense\nhere that any process described as occurring in pseudotime is not\na process at all but, as Cramer reminds, merely a\n“pedagogical convention for the purposes of description”.\nWhether it is best to understand causality according to the\ntransactional interpretation in terms of processes underscored by\nconserved quantities is closely tied to how one should best understand\nthis pseudotemporal process.\n\nMaudlin (2011) outlines a selection of problems that arise in\nCramer’s theory as a result of the pseudotemporal account of the\ntransaction mechanism: processes important to the completion of a\ntransaction take place in pseudotime only (rather than in real time)\nand thus cannot be said to have taken place at all. Since a temporally\nbound observer can only ever perceive a completed transaction, i.e., a\ncollapsed wavefunction, the uncollapsed wavefunction never actually\nexists. Since the initial offer wave is identical to the wavefunction\nof the quantum formalism, any ensuing exchange of advanced and\nretarded waves required to provide the quantum mechanical\nprobabilities, according to Maudlin, also do not exist. Moreover,\nCramer’s exposition of the transaction mechanism seems to\nsuggest that the stimulation of sequential offer and confirmation\nwaves occurs deterministically, leaving a gaping hole in any\nexplanation the transactional interpretation might provide of the\nstochastic nature of quantum mechanics. Although these problems are\nsignificant, Maudlin admits that they may indeed be peculiar to\nCramer’s theory. Maudlin also sets out a more general objection\nto retrocausal models of quantum mechanics which he claims to pose a\nproblem for “any theory in which both backwards and forwards\ninfluences conspire to shape events” (2011: 184).\n\nMaudlin’s main objection to the transactional interpretation\nhinges upon the fact that the transaction process depends crucially on\nthe fixity of the absorbers “just sitting out there in the\nfuture, waiting to absorb” (2011: 182); one cannot presume that\npresent events are unable to influence the future disposition of the\nabsorbers. Maudlin offers a thought experiment to illustrate this\nobjection. A radioactive source is constrained to emit a\n\\(\\beta\\)-particle either to the left or to the right. To the right\nsits absorber A at a distance of 1 unit. Absorber B is\nalso located to the right but at a distance of 2 units and is built on\npivots so that it can be swung around to the left on command. A\n\\(\\beta\\)-particle emitted at time \\(t_{0}\\) to the right will be\nabsorbed by absorber A at time \\(t_{1}\\). If after time\n\\(t_{1}\\) the \\(\\beta\\)-particle is not detected at absorber A,\nabsorber B is quickly swung around to the left to detect the\n\\(\\beta\\)-particle after time \\(2t_{1}\\).\n\nAccording to the transactional interpretation, since there are two\npossible outcomes (detection at absorber A or detection at\nabsorber B), there will be two confirmation waves sent back\nfrom the future, one for each absorber. Furthermore, since it is\nequally probable that the \\(\\beta\\)-particle be detected at either\nabsorber, the amplitudes of these confirmation waves should be equal.\nHowever, a confirmation wave from absorber B can only be sent\nback to the emitter if absorber B is located on the left. For\nthis to be the case, absorber A must not have detected the\n\\(\\beta\\)-particle and thus the outcome of the experiment must already\nhave been decided. The incidence of a confirmation wave from absorber\nB at the emitter ensures that the \\(\\beta\\)-particle\nis to be sent to the left, even though the amplitude of this wave\nimplies a probability of a half of this being the case. As Maudlin\n(2011: 184) states so succinctly, “Cramer’s theory\ncollapses”.\n\nThe key challenge from Maudlin is that any retrocausal mechanism must\nensure that the future behavior of the system transpires consistently\nwith the spatiotemporal structure dictated by any potential future\ncauses: “stochastic outcomes at a particular point in time may\ninfluence the future, but that future itself is supposed to play a\nrole in producing the outcomes” (2011: 181). In the\ntransactional interpretation the existence of the confirmation wave\nitself presupposes some determined future state of the system with\nretrocausal influence. However, with standard (i.e., forward-in-time)\nstochastic causal influences affecting the future from the present, a\ndetermined future may not necessarily be guaranteed in every\nsuch case, as shown by Maudlin’s experiment.\n\nMaudlin’s challenge to the transactional interpretation has been\nmet with a range of responses (see P. Lewis 2013 and the entry on\n action at a distance in quantum mechanics\n for more discussion of possible responses). The responses generally\nfall into two types (P. Lewis 2013). The first type of response\nattempts to accommodate Maudlin’s example within the\ntransactional interpretation. Berkovitz (2002) defends the\ntransactional interpretation by showing that causal loops of the type\nfound in Maudlin’s experiment need not obey the assumptions\nabout probabilities that are common in linear causal situations.\nMarchildon (2006) proposes considering the absorption properties of\nthe long distance boundary conditions: if the universe is a perfect\nabsorber of all radiation then a confirmation wave from the left will\nalways be received by the radioactive source at the time of emission\nand it will encode the correct probabilistic information. Kastner\n(2006) proposes differentiating between competing initial states of\nthe radioactive source, corresponding to the two emission\npossibilities, that together characterize an unstable bifurcation\npoint between distinct worlds, where the seemingly problematic\nprobabilities reflect a probabilistic structure across both possible\nworlds.\n\nThe second type of response is to modify the transactional\ninterpretation. For instance, Cramer (2016) introduces the idea of a\nhierarchy of advanced-wave echoes dependent upon the magnitude of the\nspatiotemporal interval from which they originate. Kastner (2013)\nsurmises that the source of the problem that Maudlin has exposed,\nhowever, is the idea that quantum processes take place in the\n“block world”, and rejects this conception of processes in\nher own development of the transactional interpretation. According to\nher “possibilist” transactional interpretation, all the\npotential transactions exist in a real space of possibilities, which\namounts at once to a kind of modal realism and an indeterminacy\nregarding future states of the system (hence Kastner’s rejection\nof the block universe view). The possibilist transactional\ninterpretation arguably handles multi-particle scenarios more\nnaturally, and presents the most modern sustained development of the\ntransactional interpretation (although see P. Lewis 2013 for\ncriticisms of the possibilist transactional interpretation specific to\nMaudlin’s challenge).\n",
    "section_title": "5. The Transactional Interpretation",
    "entry_title": "Retrocausality in Quantum Mechanics",
    "hierarchy_title": "Retrocausality in Quantum Mechanics || The Transactional Interpretation",
    "tokenized_text": [
        "transactional",
        "interpretation",
        "transactional",
        "interpretation",
        "entry",
        "far",
        "considered",
        "two",
        "significant",
        "motivating",
        "argument",
        "favor",
        "adopting",
        "retrocausality",
        "hypothesis",
        "dealing",
        "interpretational",
        "challenge",
        "quantum",
        "theory",
        "motivation",
        "amount",
        "interpretation",
        "model",
        "quantum",
        "theory",
        "consists",
        "survey",
        "range",
        "retrocausal",
        "model",
        "section",
        "first",
        "considers",
        "perhaps",
        "prominent",
        "retrocausal",
        "model",
        "transactional",
        "interpretation",
        "developed",
        "cramer",
        "s",
        "cramer",
        "transactional",
        "interpretation",
        "heavily",
        "influenced",
        "framework",
        "wheelerfeynman",
        "absorber",
        "approach",
        "electrodynamics",
        "see",
        "wheelerfeynman",
        "schema",
        "adopted",
        "describe",
        "microscopic",
        "exchange",
        "single",
        "quantum",
        "energy",
        "momentum",
        "etc",
        "within",
        "quantum",
        "system",
        "heart",
        "transactional",
        "interpretation",
        "transaction",
        "real",
        "physical",
        "event",
        "identified",
        "socalled",
        "handshake",
        "forwardevolving",
        "quantum",
        "state",
        "psi",
        "backwardevolving",
        "complexconjugates",
        "psi",
        "quantum",
        "emitter",
        "vibrating",
        "electron",
        "atom",
        "excited",
        "state",
        "emit",
        "single",
        "quantum",
        "photon",
        "case",
        "source",
        "produce",
        "radiative",
        "fieldthe",
        "offer",
        "wave",
        "analogously",
        "wheelerfeynman",
        "description",
        "field",
        "propagates",
        "outwards",
        "forward",
        "backward",
        "time",
        "well",
        "across",
        "space",
        "field",
        "encounter",
        "absorber",
        "new",
        "field",
        "generatedthe",
        "confirmation",
        "wavethat",
        "likewise",
        "propagates",
        "forward",
        "backward",
        "time",
        "present",
        "advanced",
        "incident",
        "wave",
        "emitter",
        "instant",
        "emission",
        "retarded",
        "field",
        "produced",
        "absorber",
        "advanced",
        "field",
        "produced",
        "emitter",
        "exactly",
        "cancel",
        "retarded",
        "field",
        "produced",
        "emitter",
        "advanced",
        "field",
        "produced",
        "absorber",
        "time",
        "emission",
        "absorption",
        "photon",
        "emitter",
        "absorber",
        "radiative",
        "field",
        "thus",
        "transaction",
        "completed",
        "handshake",
        "cycle",
        "offer",
        "confirmation",
        "wave",
        "repeat",
        "response",
        "emitter",
        "absorber",
        "sufficient",
        "satisfy",
        "quantum",
        "boundary",
        "conditionsat",
        "point",
        "transaction",
        "completed",
        "cramer",
        "many",
        "confirmation",
        "wave",
        "potential",
        "absorber",
        "may",
        "converge",
        "emitter",
        "time",
        "emission",
        "quantum",
        "boundary",
        "condition",
        "usually",
        "permit",
        "single",
        "transaction",
        "form",
        "observer",
        "witness",
        "process",
        "would",
        "perceive",
        "completed",
        "transaction",
        "would",
        "interpreted",
        "passage",
        "particle",
        "eg",
        "photon",
        "emitter",
        "absorber",
        "transactional",
        "interpretation",
        "take",
        "wave",
        "function",
        "real",
        "physical",
        "wave",
        "spatial",
        "extent",
        "wave",
        "function",
        "quantum",
        "mechanical",
        "formalism",
        "identical",
        "initial",
        "offer",
        "wave",
        "transaction",
        "mechanism",
        "collapsed",
        "wave",
        "function",
        "identical",
        "completed",
        "transaction",
        "quantum",
        "particle",
        "thus",
        "thought",
        "represented",
        "wave",
        "function",
        "rather",
        "completed",
        "transaction",
        "wave",
        "function",
        "initial",
        "phase",
        "cramer",
        "explains",
        "transaction",
        "may",
        "involve",
        "single",
        "emitter",
        "absorber",
        "multiple",
        "emitter",
        "absorber",
        "complete",
        "appropriate",
        "boundary",
        "condition",
        "satisfied",
        "locus",
        "emission",
        "absorption",
        "particle",
        "transferred",
        "separate",
        "identity",
        "independent",
        "satisfaction",
        "boundary",
        "condition",
        "amplitude",
        "confirmation",
        "wave",
        "produced",
        "absorber",
        "proportional",
        "local",
        "amplitude",
        "incident",
        "wave",
        "stimulated",
        "turn",
        "dependent",
        "attenuation",
        "received",
        "propagated",
        "source",
        "thus",
        "total",
        "amplitude",
        "confirmation",
        "wave",
        "absolute",
        "square",
        "initial",
        "offer",
        "wave",
        "evaluated",
        "absorber",
        "yield",
        "born",
        "rule",
        "since",
        "born",
        "rule",
        "arises",
        "product",
        "transaction",
        "mechanism",
        "special",
        "significance",
        "attached",
        "role",
        "observer",
        "act",
        "measurement",
        "collapse",
        "wave",
        "function",
        "interpreted",
        "completion",
        "transaction",
        "transactional",
        "interpretation",
        "explicitly",
        "interprets",
        "quantum",
        "state",
        "psi",
        "real",
        "constitute",
        "attempt",
        "exploit",
        "retrocausality",
        "loophole",
        "theorem",
        "rule",
        "psi",
        "epistemic",
        "account",
        "additionally",
        "transactional",
        "interpretation",
        "subverts",
        "dilemma",
        "core",
        "epr",
        "argument",
        "einstein",
        "et",
        "al",
        "permitting",
        "incompatible",
        "observables",
        "take",
        "definite",
        "value",
        "simultaneously",
        "wavefunction",
        "according",
        "transactional",
        "interpretation",
        "brings",
        "potential",
        "absorber",
        "full",
        "range",
        "possible",
        "outcome",
        "simultaneous",
        "reality",
        "epr",
        "sense",
        "absorber",
        "interacts",
        "cause",
        "one",
        "outcome",
        "emerge",
        "transaction",
        "collapsed",
        "wavefunction",
        "manifest",
        "one",
        "outcome",
        "cramer",
        "importantly",
        "however",
        "transactional",
        "interpretation",
        "employ",
        "retarded",
        "advanced",
        "wave",
        "admits",
        "possibility",
        "providing",
        "zigzag",
        "explanation",
        "nonlocality",
        "associated",
        "entangled",
        "quantum",
        "system",
        "turning",
        "one",
        "significant",
        "objection",
        "transactional",
        "interpretation",
        "retrocausality",
        "general",
        "instructive",
        "tease",
        "apart",
        "two",
        "complementary",
        "description",
        "transaction",
        "process",
        "one",
        "hand",
        "description",
        "real",
        "physical",
        "process",
        "consisting",
        "passage",
        "particle",
        "emitter",
        "absorber",
        "temporally",
        "bound",
        "experimenter",
        "would",
        "observe",
        "hand",
        "description",
        "dynamical",
        "process",
        "offer",
        "confirmation",
        "wave",
        "instrumental",
        "establishing",
        "transaction",
        "latter",
        "process",
        "simply",
        "occur",
        "ordinary",
        "time",
        "sequence",
        "least",
        "temporally",
        "bound",
        "observer",
        "construction",
        "detect",
        "offer",
        "confirmation",
        "wave",
        "cramer",
        "suggests",
        "dynamical",
        "process",
        "understood",
        "occurring",
        "pseudotime",
        "sequence",
        "account",
        "emitterabsorber",
        "transaction",
        "presented",
        "employ",
        "semantic",
        "device",
        "describing",
        "process",
        "extending",
        "across",
        "lightlike",
        "timelike",
        "interval",
        "spacetime",
        "occurred",
        "time",
        "sequence",
        "external",
        "process",
        "reader",
        "reminded",
        "pedagogical",
        "convention",
        "purpose",
        "description",
        "process",
        "atemporal",
        "observables",
        "come",
        "superposition",
        "step",
        "form",
        "final",
        "transaction",
        "cramer",
        "fn",
        "step",
        "course",
        "cyclically",
        "repeated",
        "exchange",
        "offer",
        "confirmation",
        "wave",
        "continue",
        "net",
        "exchange",
        "energy",
        "conserved",
        "quantity",
        "satisfies",
        "quantum",
        "boundary",
        "condition",
        "system",
        "strong",
        "sense",
        "process",
        "described",
        "occurring",
        "pseudotime",
        "process",
        "cramer",
        "reminds",
        "merely",
        "pedagogical",
        "convention",
        "purpose",
        "description",
        "whether",
        "best",
        "understand",
        "causality",
        "according",
        "transactional",
        "interpretation",
        "term",
        "process",
        "underscored",
        "conserved",
        "quantity",
        "closely",
        "tied",
        "one",
        "best",
        "understand",
        "pseudotemporal",
        "process",
        "maudlin",
        "outline",
        "selection",
        "problem",
        "arise",
        "cramer",
        "theory",
        "result",
        "pseudotemporal",
        "account",
        "transaction",
        "mechanism",
        "process",
        "important",
        "completion",
        "transaction",
        "take",
        "place",
        "pseudotime",
        "rather",
        "real",
        "time",
        "thus",
        "said",
        "taken",
        "place",
        "since",
        "temporally",
        "bound",
        "observer",
        "ever",
        "perceive",
        "completed",
        "transaction",
        "ie",
        "collapsed",
        "wavefunction",
        "uncollapsed",
        "wavefunction",
        "never",
        "actually",
        "exists",
        "since",
        "initial",
        "offer",
        "wave",
        "identical",
        "wavefunction",
        "quantum",
        "formalism",
        "ensuing",
        "exchange",
        "advanced",
        "retarded",
        "wave",
        "required",
        "provide",
        "quantum",
        "mechanical",
        "probability",
        "according",
        "maudlin",
        "also",
        "exist",
        "moreover",
        "cramer",
        "exposition",
        "transaction",
        "mechanism",
        "seems",
        "suggest",
        "stimulation",
        "sequential",
        "offer",
        "confirmation",
        "wave",
        "occurs",
        "deterministically",
        "leaving",
        "gaping",
        "hole",
        "explanation",
        "transactional",
        "interpretation",
        "might",
        "provide",
        "stochastic",
        "nature",
        "quantum",
        "mechanic",
        "although",
        "problem",
        "significant",
        "maudlin",
        "admits",
        "may",
        "indeed",
        "peculiar",
        "cramer",
        "theory",
        "maudlin",
        "also",
        "set",
        "general",
        "objection",
        "retrocausal",
        "model",
        "quantum",
        "mechanic",
        "claim",
        "pose",
        "problem",
        "theory",
        "backwards",
        "forward",
        "influence",
        "conspire",
        "shape",
        "event",
        "maudlin",
        "main",
        "objection",
        "transactional",
        "interpretation",
        "hinge",
        "upon",
        "fact",
        "transaction",
        "process",
        "depends",
        "crucially",
        "fixity",
        "absorber",
        "sitting",
        "future",
        "waiting",
        "absorb",
        "one",
        "presume",
        "present",
        "event",
        "unable",
        "influence",
        "future",
        "disposition",
        "absorber",
        "maudlin",
        "offer",
        "thought",
        "experiment",
        "illustrate",
        "objection",
        "radioactive",
        "source",
        "constrained",
        "emit",
        "beta",
        "particle",
        "either",
        "left",
        "right",
        "right",
        "sits",
        "absorber",
        "distance",
        "unit",
        "absorber",
        "b",
        "also",
        "located",
        "right",
        "distance",
        "unit",
        "built",
        "pivot",
        "swung",
        "around",
        "left",
        "command",
        "beta",
        "particle",
        "emitted",
        "time",
        "t_",
        "right",
        "absorbed",
        "absorber",
        "time",
        "t_",
        "time",
        "t_",
        "beta",
        "particle",
        "detected",
        "absorber",
        "absorber",
        "b",
        "quickly",
        "swung",
        "around",
        "left",
        "detect",
        "beta",
        "particle",
        "time",
        "t_",
        "according",
        "transactional",
        "interpretation",
        "since",
        "two",
        "possible",
        "outcome",
        "detection",
        "absorber",
        "detection",
        "absorber",
        "b",
        "two",
        "confirmation",
        "wave",
        "sent",
        "back",
        "future",
        "one",
        "absorber",
        "furthermore",
        "since",
        "equally",
        "probable",
        "beta",
        "particle",
        "detected",
        "either",
        "absorber",
        "amplitude",
        "confirmation",
        "wave",
        "equal",
        "however",
        "confirmation",
        "wave",
        "absorber",
        "b",
        "sent",
        "back",
        "emitter",
        "absorber",
        "b",
        "located",
        "left",
        "case",
        "absorber",
        "must",
        "detected",
        "beta",
        "particle",
        "thus",
        "outcome",
        "experiment",
        "must",
        "already",
        "decided",
        "incidence",
        "confirmation",
        "wave",
        "absorber",
        "b",
        "emitter",
        "ensures",
        "beta",
        "particle",
        "sent",
        "left",
        "even",
        "though",
        "amplitude",
        "wave",
        "implies",
        "probability",
        "half",
        "case",
        "maudlin",
        "state",
        "succinctly",
        "cramer",
        "theory",
        "collapse",
        "key",
        "challenge",
        "maudlin",
        "retrocausal",
        "mechanism",
        "must",
        "ensure",
        "future",
        "behavior",
        "system",
        "transpires",
        "consistently",
        "spatiotemporal",
        "structure",
        "dictated",
        "potential",
        "future",
        "cause",
        "stochastic",
        "outcome",
        "particular",
        "point",
        "time",
        "may",
        "influence",
        "future",
        "future",
        "supposed",
        "play",
        "role",
        "producing",
        "outcome",
        "transactional",
        "interpretation",
        "existence",
        "confirmation",
        "wave",
        "presupposes",
        "determined",
        "future",
        "state",
        "system",
        "retrocausal",
        "influence",
        "however",
        "standard",
        "ie",
        "forwardintime",
        "stochastic",
        "causal",
        "influence",
        "affecting",
        "future",
        "present",
        "determined",
        "future",
        "may",
        "necessarily",
        "guaranteed",
        "every",
        "case",
        "shown",
        "maudlin",
        "experiment",
        "maudlin",
        "challenge",
        "transactional",
        "interpretation",
        "met",
        "range",
        "response",
        "see",
        "p",
        "lewis",
        "entry",
        "action",
        "distance",
        "quantum",
        "mechanic",
        "discussion",
        "possible",
        "response",
        "response",
        "generally",
        "fall",
        "two",
        "type",
        "p",
        "lewis",
        "first",
        "type",
        "response",
        "attempt",
        "accommodate",
        "maudlin",
        "example",
        "within",
        "transactional",
        "interpretation",
        "berkovitz",
        "defends",
        "transactional",
        "interpretation",
        "showing",
        "causal",
        "loop",
        "type",
        "found",
        "maudlin",
        "experiment",
        "need",
        "obey",
        "assumption",
        "probability",
        "common",
        "linear",
        "causal",
        "situation",
        "marchildon",
        "proposes",
        "considering",
        "absorption",
        "property",
        "long",
        "distance",
        "boundary",
        "condition",
        "universe",
        "perfect",
        "absorber",
        "radiation",
        "confirmation",
        "wave",
        "left",
        "always",
        "received",
        "radioactive",
        "source",
        "time",
        "emission",
        "encode",
        "correct",
        "probabilistic",
        "information",
        "kastner",
        "proposes",
        "differentiating",
        "competing",
        "initial",
        "state",
        "radioactive",
        "source",
        "corresponding",
        "two",
        "emission",
        "possibility",
        "together",
        "characterize",
        "unstable",
        "bifurcation",
        "point",
        "distinct",
        "world",
        "seemingly",
        "problematic",
        "probability",
        "reflect",
        "probabilistic",
        "structure",
        "across",
        "possible",
        "world",
        "second",
        "type",
        "response",
        "modify",
        "transactional",
        "interpretation",
        "instance",
        "cramer",
        "introduces",
        "idea",
        "hierarchy",
        "advancedwave",
        "echo",
        "dependent",
        "upon",
        "magnitude",
        "spatiotemporal",
        "interval",
        "originate",
        "kastner",
        "surmise",
        "source",
        "problem",
        "maudlin",
        "exposed",
        "however",
        "idea",
        "quantum",
        "process",
        "take",
        "place",
        "block",
        "world",
        "reject",
        "conception",
        "process",
        "development",
        "transactional",
        "interpretation",
        "according",
        "possibilist",
        "transactional",
        "interpretation",
        "potential",
        "transaction",
        "exist",
        "real",
        "space",
        "possibility",
        "amount",
        "kind",
        "modal",
        "realism",
        "indeterminacy",
        "regarding",
        "future",
        "state",
        "system",
        "hence",
        "kastner",
        "rejection",
        "block",
        "universe",
        "view",
        "possibilist",
        "transactional",
        "interpretation",
        "arguably",
        "handle",
        "multiparticle",
        "scenario",
        "naturally",
        "present",
        "modern",
        "sustained",
        "development",
        "transactional",
        "interpretation",
        "although",
        "see",
        "p",
        "lewis",
        "criticism",
        "possibilist",
        "transactional",
        "interpretation",
        "specific",
        "maudlin",
        "challenge"
    ]
}