{
    "main_text": "Quantum Entanglement\n1. Quantum Entanglement\n\nIn 1935 and 1936, Schrödinger published a two-part article in the\nProceedings of the Cambridge Philosophical Society in which\nhe discussed and extended an argument by Einstein, Podolsky, and\nRosen. The Einstein-Podolsky-Rosen (EPR) argument was, in many ways,\nthe culmination of Einstein’s critique of the orthodox\nCopenhagen interpretation of quantum mechanics and was designed to\nshow that the theory is incomplete. (See the entries on the\n Einstein-Podolsky-Rosen argument in quantum theory\n and the\n Copenhagen interpretation of quantum mechanics.)\n In classical mechanics the state of a system is essentially a list of\nthe system’s properties — more precisely, it is the\nspecification of a set of parameters from which the list of properties\ncan be reconstructed: the positions and momenta of all the particles\ncomprising the system (or similar parameters in the case of fields).\nThe dynamics of the theory specifies how properties change in terms of\na law of evolution for the state. In a letter to Max Born, Wolfgang\nPauli characterized this mode of description of physical systems as a\n‘detached observer’ idealization (see The\nBorn-Einstein Letters, Born, 1992; p. 218). On the Copenhagen\ninterpretation, such a description is not possible for quantum\nsystems. Instead, the quantum state of a system should be understood\nas a catalogue of what an observer has done to the system and what has\nbeen observed, and the import of the state then lies in the\nprobabilities that can be inferred (in terms of the theory) for the\noutcomes of possible future observations on the system. Einstein\nrejected this view and proposed a series of arguments to show that the\nquantum state is simply an incomplete characterization of a quantum\nsystem. The missing parameters are sometimes referred to as\n‘hidden parameters’ or ‘hidden variables.’\n\nIt should not be supposed that Einstein’s notion of a complete\ntheory included the requirement that the theory should be\ndeterministic. Rather, he required certain conditions of separability\nand locality for composite systems consisting of separated component\nsystems: each component system separately should be characterized by\nits own properties (its own ‘being-thus,’ as Einstein put\nit — ‘So-sein’ in German), and it should be\nimpossible to alter the properties of a distant system instantaneously\n(or the probabilities of these properties) by acting on a local\nsystem. In later analyses, notably in Bell’s argument for the\nnonlocality of quantum correlations, it became apparent that these\nconditions, suitably formulated as probability constraints, are\nequivalent to the requirement that statistical correlations between\nseparated systems should be reducible to probability distributions\nover common causes (deterministic or stochastic) in the sense of\nReichenbach. (See the entries on\n Bell’s theorem\n and\n Reichenbach’s common cause principle.)\n\nIn the original EPR article, two particles are prepared from a source\nin a certain ‘pure’ quantum state of the composite system\n(a state that cannot be expressed as a mixture or probability\ndistribution of other pure quantum states, and cannot be reduced to a\npure quantum state of each particle separately). After the particles\nmove apart, there are ‘matching’ correlations between both\nthe positions of the two particles and their momenta: a measurement of\neither position or momentum on a particular particle will allow the\nprediction, with certainty, of the outcome of a position measurement\nor momentum measurement, respectively, on the other particle. These\nmeasurements are mutually exclusive: either a position measurement can\nbe performed, or a momentum measurement, but not both simultaneously.\nThe subsequent measurement of momentum, say, after establishing a\nposition correlation, will no longer yield any correlation in the\nmomenta of the two particles. It is as if the position measurement\ndisturbs the correlation between the momentum values, and conversely.\nApart from this peculiarity that either correlation can be observed,\nbut not both for the same pair of quantum particles, the position and\nmomentum correlations for the quantum particles are exactly like the\nclassical correlations between two billiard balls after a collision.\nClassical correlations can be explained by a common cause, or\ncorrelated ‘elements of reality.’ The EPR argument is that\nquantum mechanics is incomplete because these common causes or\nelements of reality are not included in the quantum state\ndescription.\n\nHere is how Schrödinger put the puzzle in the first part of his\ntwo-part article (Schrödinger, 1935; p. 559):\n\nYet since I can predict either \\(x_1\\) or \\(p_1\\) without\ninterfering with the system No. 1 and since system No. 1, like a\nscholar in an examination, cannot possibly know which of the two\nquestions I am going to ask first: it so seems that our scholar is\nprepared to give the right answer to the first question he is\nasked, anyhow. Therefore he must know both answers; which is\nan amazing knowledge; quite irrespective of the fact that after having\ngiven his first answer our scholar is invariably so disconcerted or\ntired out, that all the following answers are ‘wrong.’\n\n\nWhat Schrödinger showed was that if two particles are prepared in\nan EPR quantum state, where there are matching correlations for\ntwo ‘canonically conjugate’ dynamical quantities\n(quantities like position and momentum whose values suffice to specify\nall the properties of a classical system), then there are infinitely\nmany dynamical quantities of the two particles for which there exist\nsimilar matching correlations: every function of the canonically\nconjugate pair of the first particle matches with the same function of\nthe canonically conjugate pair of the second particle. So\n(Schrödinger, p. 559) system No. 1 ‘does not only know\nthese two answers but a vast number of others, and that with no\nmnemotechnical help whatsoever, at least with none that we know\nof.’\n\nSchrödinger coined the term ‘entanglement’ to\ndescribe this peculiar connection between quantum systems\n(Schrödinger, 1935; p. 555):\n\nWhen two systems, of which we know the states by their respective\nrepresentatives, enter into temporary physical interaction due to\nknown forces between them, and when after a time of mutual influence\nthe systems separate again, then they can no longer be described in\nthe same way as before, viz. by endowing each of them with a\nrepresentative of its own. I would not call that one but\nrather the characteristic trait of quantum mechanics, the one\nthat enforces its entire departure from classical lines of thought. By\nthe interaction the two representatives [the quantum states] have\nbecome entangled.\n\n\nHe added (Schrödinger, 1935; p. 555):\n\nAnother way of expressing the peculiar situation is: the best possible\nknowledge of a whole does not necessarily include the best\npossible knowledge of all its parts, even though they may be\nentirely separate and therefore virtually capable of being ‘best\npossibly known,’ i.e., of possessing, each of them, a\nrepresentative of its own. The lack of knowledge is by no means due to\nthe interaction being insufficiently known — at least not in the\nway that it could possibly be known more completely — it is due\nto the interaction itself.\n\n\nAttention has recently been called to the obvious but very\ndisconcerting fact that even though we restrict the disentangling\nmeasurements to one system, the representative obtained for\nthe other system is by no means independent of the particular\nchoice of observations which we select for that purpose and which by\nthe way are entirely arbitrary. It is rather discomforting\nthat the theory should allow a system to be steered or piloted into\none or the other type of state at the experimenter’s mercy in\nspite of his having no access to it.\n\n\nIn the second part of the paper, Schrödinger showed that an\nexperimenter, by a suitable choice of operations carried out on one\nmember of an entangled pair, possibly using additional\n‘ancilla’ or helper particles, can ‘steer’ the\nsecond system into a chosen mixture of quantum states, with a\nprobability distribution that depends on the entangled state. The\nsecond system cannot be steered into a particular quantum\nstate at the whim of the experimenter, but for many copies of the\nentangled pair, the experimenter can constrain the quantum state of\nthe second system to lie in a chosen set of quantum states, where\nthese states are correlated with the possible outcomes of measurements\ncarried out on the entangled paired systems, or the paired systems\nplus ancillas. He found this conclusion sufficiently unsettling to\nsuggest that the entanglement between two separating systems would\npersist only for distances small enough that the time taken by light\nto travel from one system to the other could be neglected, compared\nwith the characteristic time periods associated with other changes in\nthe composite system. He speculated that for longer distances the two\nsystems might in fact be in a correlated mixture of quantum states\ndetermined by the entangled state.\n\nMost physicists attributed the puzzling features of entangled quantum\nstates to Einstein’s inappropriate ‘detached\nobserver’ view of physical theory and regarded Bohr’s\nreply to the EPR argument (Bohr, 1935) as vindicating the Copenhagen\ninterpretation. This was unfortunate, because the study of\nentanglement was ignored for thirty years until John Bell’s\nreconsideration of the EPR argument (Bell, 1964). Bell looked at\nentanglement in simpler systems than the EPR example: matching\ncorrelations between two-valued dynamical quantities, such as\npolarization in a particular direction or spin in a particular\ndirection, of two separated systems in an entangled state. What Bell\nshowed was that the statistical correlations between the measurement\noutcomes of suitably chosen different quantities on the two\nsystems are inconsistent with an inequality derivable from\nEinstein’s separability and locality assumptions — in\neffect from the assumption that the correlations have a common cause.\nThis inequality is now known as Bell’s inequality, and various\nrelated inequalities can be derived as a necessary condition for\nclassical or common cause correlations.\n\nBell’s investigation generated an ongoing debate on the\nfoundations of quantum mechanics. One important feature of this debate\nwas confirmation that entanglement can persist over long distances,\nthus falsifying Schrödinger’s supposition of the\nspontaneous decay of entanglement as two entangled particles separate.\n(Free space entanglement of photons has been demonstrated over a\ndistance of 143 km and, using satellites to distribute\nentanglement, between locations more than 1200 km apart on earth. See\nHerbst et al 2014 and Yin et al 2017.) But it\nwas not until the 1980s that physicists, computer scientists, and\ncryptologists began to regard the non-local correlations of entangled\nquantum states as a new kind of non-classical physical resource that\ncould be exploited, rather than an embarrassment for quantum mechanics\nto be explained away. For a discussion of entanglement — what it\nis, why it is conceptually puzzling, and what you can do with it,\nincluding a simple proof of Bell’s theorem — see the\ngraphic novel Totally Random: Why Nobody Understands Quantum\nMechanics (A Serious Comic on Entanglement), Bub and Bub 2018.\nFor further discussion of entanglement as a physical resource,\nincluding measuring entanglement, and the manipulation and\npurification of entanglement by local operations, see “The Joy\nof Entanglement” by Popescu and Rohrlich in Lo, Popescu, and\nSpiller 1998, Bub 2016, and the classic Nielsen and Chuang 2011.\nAlain Aspect, John F. Clauser, and Anton Zeilinger were awared the\n2022 Nobel Prize in physics for their pioneering experiments on\nentangled photons, validating Bell’s insight and initiating the field\nof quantum information.\n",
    "section_title": "1. Quantum Entanglement",
    "entry_title": "Quantum Entanglement and Information",
    "hierarchy_title": "Quantum Entanglement and Information || Quantum Entanglement",
    "tokenized_text": [
        "quantum",
        "entanglement",
        "quantum",
        "entanglement",
        "schrödinger",
        "published",
        "twopart",
        "article",
        "proceeding",
        "cambridge",
        "philosophical",
        "society",
        "discussed",
        "extended",
        "argument",
        "einstein",
        "podolsky",
        "rosen",
        "einsteinpodolskyrosen",
        "epr",
        "argument",
        "many",
        "way",
        "culmination",
        "einstein",
        "critique",
        "orthodox",
        "copenhagen",
        "interpretation",
        "quantum",
        "mechanic",
        "designed",
        "show",
        "theory",
        "incomplete",
        "see",
        "entry",
        "einsteinpodolskyrosen",
        "argument",
        "quantum",
        "theory",
        "copenhagen",
        "interpretation",
        "quantum",
        "mechanic",
        "classical",
        "mechanic",
        "state",
        "system",
        "essentially",
        "list",
        "system",
        "property",
        "precisely",
        "specification",
        "set",
        "parameter",
        "list",
        "property",
        "reconstructed",
        "position",
        "momentum",
        "particle",
        "comprising",
        "system",
        "similar",
        "parameter",
        "case",
        "field",
        "dynamic",
        "theory",
        "specifies",
        "property",
        "change",
        "term",
        "law",
        "evolution",
        "state",
        "letter",
        "max",
        "born",
        "wolfgang",
        "pauli",
        "characterized",
        "mode",
        "description",
        "physical",
        "system",
        "detached",
        "observer",
        "idealization",
        "see",
        "borneinstein",
        "letter",
        "born",
        "p",
        "copenhagen",
        "interpretation",
        "description",
        "possible",
        "quantum",
        "system",
        "instead",
        "quantum",
        "state",
        "system",
        "understood",
        "catalogue",
        "observer",
        "done",
        "system",
        "observed",
        "import",
        "state",
        "lie",
        "probability",
        "inferred",
        "term",
        "theory",
        "outcome",
        "possible",
        "future",
        "observation",
        "system",
        "einstein",
        "rejected",
        "view",
        "proposed",
        "series",
        "argument",
        "show",
        "quantum",
        "state",
        "simply",
        "incomplete",
        "characterization",
        "quantum",
        "system",
        "missing",
        "parameter",
        "sometimes",
        "referred",
        "hidden",
        "parameter",
        "hidden",
        "variables",
        "supposed",
        "einstein",
        "notion",
        "complete",
        "theory",
        "included",
        "requirement",
        "theory",
        "deterministic",
        "rather",
        "required",
        "certain",
        "condition",
        "separability",
        "locality",
        "composite",
        "system",
        "consisting",
        "separated",
        "component",
        "system",
        "component",
        "system",
        "separately",
        "characterized",
        "property",
        "beingthus",
        "einstein",
        "put",
        "sosein",
        "german",
        "impossible",
        "alter",
        "property",
        "distant",
        "system",
        "instantaneously",
        "probability",
        "property",
        "acting",
        "local",
        "system",
        "later",
        "analysis",
        "notably",
        "bell",
        "argument",
        "nonlocality",
        "quantum",
        "correlation",
        "became",
        "apparent",
        "condition",
        "suitably",
        "formulated",
        "probability",
        "constraint",
        "equivalent",
        "requirement",
        "statistical",
        "correlation",
        "separated",
        "system",
        "reducible",
        "probability",
        "distribution",
        "common",
        "cause",
        "deterministic",
        "stochastic",
        "sense",
        "reichenbach",
        "see",
        "entry",
        "bell",
        "theorem",
        "reichenbach",
        "common",
        "cause",
        "principle",
        "original",
        "epr",
        "article",
        "two",
        "particle",
        "prepared",
        "source",
        "certain",
        "pure",
        "quantum",
        "state",
        "composite",
        "system",
        "state",
        "expressed",
        "mixture",
        "probability",
        "distribution",
        "pure",
        "quantum",
        "state",
        "reduced",
        "pure",
        "quantum",
        "state",
        "particle",
        "separately",
        "particle",
        "move",
        "apart",
        "matching",
        "correlation",
        "position",
        "two",
        "particle",
        "momentum",
        "measurement",
        "either",
        "position",
        "momentum",
        "particular",
        "particle",
        "allow",
        "prediction",
        "certainty",
        "outcome",
        "position",
        "measurement",
        "momentum",
        "measurement",
        "respectively",
        "particle",
        "measurement",
        "mutually",
        "exclusive",
        "either",
        "position",
        "measurement",
        "performed",
        "momentum",
        "measurement",
        "simultaneously",
        "subsequent",
        "measurement",
        "momentum",
        "say",
        "establishing",
        "position",
        "correlation",
        "longer",
        "yield",
        "correlation",
        "momentum",
        "two",
        "particle",
        "position",
        "measurement",
        "disturbs",
        "correlation",
        "momentum",
        "value",
        "conversely",
        "apart",
        "peculiarity",
        "either",
        "correlation",
        "observed",
        "pair",
        "quantum",
        "particle",
        "position",
        "momentum",
        "correlation",
        "quantum",
        "particle",
        "exactly",
        "like",
        "classical",
        "correlation",
        "two",
        "billiard",
        "ball",
        "collision",
        "classical",
        "correlation",
        "explained",
        "common",
        "cause",
        "correlated",
        "element",
        "reality",
        "epr",
        "argument",
        "quantum",
        "mechanic",
        "incomplete",
        "common",
        "cause",
        "element",
        "reality",
        "included",
        "quantum",
        "state",
        "description",
        "schrödinger",
        "put",
        "puzzle",
        "first",
        "part",
        "twopart",
        "article",
        "schrödinger",
        "p",
        "yet",
        "since",
        "predict",
        "either",
        "x_",
        "p_",
        "without",
        "interfering",
        "system",
        "since",
        "system",
        "like",
        "scholar",
        "examination",
        "possibly",
        "know",
        "two",
        "question",
        "going",
        "ask",
        "first",
        "seems",
        "scholar",
        "prepared",
        "give",
        "right",
        "answer",
        "first",
        "question",
        "asked",
        "anyhow",
        "therefore",
        "must",
        "know",
        "answer",
        "amazing",
        "knowledge",
        "quite",
        "irrespective",
        "fact",
        "given",
        "first",
        "answer",
        "scholar",
        "invariably",
        "disconcerted",
        "tired",
        "following",
        "answer",
        "wrong",
        "schrödinger",
        "showed",
        "two",
        "particle",
        "prepared",
        "epr",
        "quantum",
        "state",
        "matching",
        "correlation",
        "two",
        "canonically",
        "conjugate",
        "dynamical",
        "quantity",
        "quantity",
        "like",
        "position",
        "momentum",
        "whose",
        "value",
        "suffice",
        "specify",
        "property",
        "classical",
        "system",
        "infinitely",
        "many",
        "dynamical",
        "quantity",
        "two",
        "particle",
        "exist",
        "similar",
        "matching",
        "correlation",
        "every",
        "function",
        "canonically",
        "conjugate",
        "pair",
        "first",
        "particle",
        "match",
        "function",
        "canonically",
        "conjugate",
        "pair",
        "second",
        "particle",
        "schrödinger",
        "p",
        "system",
        "know",
        "two",
        "answer",
        "vast",
        "number",
        "others",
        "mnemotechnical",
        "help",
        "whatsoever",
        "least",
        "none",
        "know",
        "of",
        "schrödinger",
        "coined",
        "term",
        "entanglement",
        "describe",
        "peculiar",
        "connection",
        "quantum",
        "system",
        "schrödinger",
        "p",
        "two",
        "system",
        "know",
        "state",
        "respective",
        "representative",
        "enter",
        "temporary",
        "physical",
        "interaction",
        "due",
        "known",
        "force",
        "time",
        "mutual",
        "influence",
        "system",
        "separate",
        "longer",
        "described",
        "way",
        "viz",
        "endowing",
        "representative",
        "would",
        "call",
        "one",
        "rather",
        "characteristic",
        "trait",
        "quantum",
        "mechanic",
        "one",
        "enforces",
        "entire",
        "departure",
        "classical",
        "line",
        "thought",
        "interaction",
        "two",
        "representative",
        "quantum",
        "state",
        "become",
        "entangled",
        "added",
        "schrödinger",
        "p",
        "another",
        "way",
        "expressing",
        "peculiar",
        "situation",
        "best",
        "possible",
        "knowledge",
        "whole",
        "necessarily",
        "include",
        "best",
        "possible",
        "knowledge",
        "part",
        "even",
        "though",
        "may",
        "entirely",
        "separate",
        "therefore",
        "virtually",
        "capable",
        "best",
        "possibly",
        "known",
        "ie",
        "possessing",
        "representative",
        "lack",
        "knowledge",
        "mean",
        "due",
        "interaction",
        "insufficiently",
        "known",
        "least",
        "way",
        "could",
        "possibly",
        "known",
        "completely",
        "due",
        "interaction",
        "attention",
        "recently",
        "called",
        "obvious",
        "disconcerting",
        "fact",
        "even",
        "though",
        "restrict",
        "disentangling",
        "measurement",
        "one",
        "system",
        "representative",
        "obtained",
        "system",
        "mean",
        "independent",
        "particular",
        "choice",
        "observation",
        "select",
        "purpose",
        "way",
        "entirely",
        "arbitrary",
        "rather",
        "discomforting",
        "theory",
        "allow",
        "system",
        "steered",
        "piloted",
        "one",
        "type",
        "state",
        "experimenter",
        "mercy",
        "spite",
        "access",
        "second",
        "part",
        "paper",
        "schrödinger",
        "showed",
        "experimenter",
        "suitable",
        "choice",
        "operation",
        "carried",
        "one",
        "member",
        "entangled",
        "pair",
        "possibly",
        "using",
        "additional",
        "ancilla",
        "helper",
        "particle",
        "steer",
        "second",
        "system",
        "chosen",
        "mixture",
        "quantum",
        "state",
        "probability",
        "distribution",
        "depends",
        "entangled",
        "state",
        "second",
        "system",
        "steered",
        "particular",
        "quantum",
        "state",
        "whim",
        "experimenter",
        "many",
        "copy",
        "entangled",
        "pair",
        "experimenter",
        "constrain",
        "quantum",
        "state",
        "second",
        "system",
        "lie",
        "chosen",
        "set",
        "quantum",
        "state",
        "state",
        "correlated",
        "possible",
        "outcome",
        "measurement",
        "carried",
        "entangled",
        "paired",
        "system",
        "paired",
        "system",
        "plus",
        "ancillas",
        "found",
        "conclusion",
        "sufficiently",
        "unsettling",
        "suggest",
        "entanglement",
        "two",
        "separating",
        "system",
        "would",
        "persist",
        "distance",
        "small",
        "enough",
        "time",
        "taken",
        "light",
        "travel",
        "one",
        "system",
        "could",
        "neglected",
        "compared",
        "characteristic",
        "time",
        "period",
        "associated",
        "change",
        "composite",
        "system",
        "speculated",
        "longer",
        "distance",
        "two",
        "system",
        "might",
        "fact",
        "correlated",
        "mixture",
        "quantum",
        "state",
        "determined",
        "entangled",
        "state",
        "physicist",
        "attributed",
        "puzzling",
        "feature",
        "entangled",
        "quantum",
        "state",
        "einstein",
        "inappropriate",
        "detached",
        "observer",
        "view",
        "physical",
        "theory",
        "regarded",
        "bohr",
        "reply",
        "epr",
        "argument",
        "bohr",
        "vindicating",
        "copenhagen",
        "interpretation",
        "unfortunate",
        "study",
        "entanglement",
        "ignored",
        "thirty",
        "year",
        "john",
        "bell",
        "reconsideration",
        "epr",
        "argument",
        "bell",
        "bell",
        "looked",
        "entanglement",
        "simpler",
        "system",
        "epr",
        "example",
        "matching",
        "correlation",
        "twovalued",
        "dynamical",
        "quantity",
        "polarization",
        "particular",
        "direction",
        "spin",
        "particular",
        "direction",
        "two",
        "separated",
        "system",
        "entangled",
        "state",
        "bell",
        "showed",
        "statistical",
        "correlation",
        "measurement",
        "outcome",
        "suitably",
        "chosen",
        "different",
        "quantity",
        "two",
        "system",
        "inconsistent",
        "inequality",
        "derivable",
        "einstein",
        "separability",
        "locality",
        "assumption",
        "effect",
        "assumption",
        "correlation",
        "common",
        "cause",
        "inequality",
        "known",
        "bell",
        "inequality",
        "various",
        "related",
        "inequality",
        "derived",
        "necessary",
        "condition",
        "classical",
        "common",
        "cause",
        "correlation",
        "bell",
        "investigation",
        "generated",
        "ongoing",
        "debate",
        "foundation",
        "quantum",
        "mechanic",
        "one",
        "important",
        "feature",
        "debate",
        "confirmation",
        "entanglement",
        "persist",
        "long",
        "distance",
        "thus",
        "falsifying",
        "schrödinger",
        "supposition",
        "spontaneous",
        "decay",
        "entanglement",
        "two",
        "entangled",
        "particle",
        "separate",
        "free",
        "space",
        "entanglement",
        "photon",
        "demonstrated",
        "distance",
        "km",
        "using",
        "satellite",
        "distribute",
        "entanglement",
        "location",
        "km",
        "apart",
        "earth",
        "see",
        "herbst",
        "et",
        "al",
        "yin",
        "et",
        "al",
        "s",
        "physicist",
        "computer",
        "scientist",
        "cryptologist",
        "began",
        "regard",
        "nonlocal",
        "correlation",
        "entangled",
        "quantum",
        "state",
        "new",
        "kind",
        "nonclassical",
        "physical",
        "resource",
        "could",
        "exploited",
        "rather",
        "embarrassment",
        "quantum",
        "mechanic",
        "explained",
        "away",
        "discussion",
        "entanglement",
        "conceptually",
        "puzzling",
        "including",
        "simple",
        "proof",
        "bell",
        "theorem",
        "see",
        "graphic",
        "novel",
        "totally",
        "random",
        "nobody",
        "understands",
        "quantum",
        "mechanic",
        "serious",
        "comic",
        "entanglement",
        "bub",
        "bub",
        "discussion",
        "entanglement",
        "physical",
        "resource",
        "including",
        "measuring",
        "entanglement",
        "manipulation",
        "purification",
        "entanglement",
        "local",
        "operation",
        "see",
        "joy",
        "entanglement",
        "popescu",
        "rohrlich",
        "lo",
        "popescu",
        "spiller",
        "bub",
        "classic",
        "nielsen",
        "chuang",
        "alain",
        "aspect",
        "john",
        "f",
        "clauser",
        "anton",
        "zeilinger",
        "awared",
        "nobel",
        "prize",
        "physic",
        "pioneering",
        "experiment",
        "entangled",
        "photon",
        "validating",
        "bell",
        "insight",
        "initiating",
        "field",
        "quantum",
        "information"
    ]
}