{
    "main_text": "The measurement problem || Approaches to the measurement problem\n4.2 Approaches to the measurement problem\n\nIf quantum state evolution proceeds via the Schrödinger equation\nor some other linear equation, then, as we have seen in the previous\nsection, typical experiments will lead to quantum states that are\nsuperpositions of terms corresponding to distinct experimental\noutcomes. It is sometimes said that this conflicts with our\nexperience, according to which experimental outcome variables, such as\npointer readings, always have definite values. This is a misleading\nway of putting the issue, as it is not immediately clear how to\ninterpret states of this sort as physical states of a system that\nincludes experimental apparatus, and, if we can’t say what it\nwould be like to observe the apparatus to be in such a state, it makes\nno sense to say that we never observe it to be in a state like\nthat.\n\nNonetheless, we are faced with an interpretational problem. If we take\nthe quantum state to be a complete description of the system, then the\nstate is, contrary to what would antecedently expect, not a state\ncorresponding to a unique, definite outcome. This is what led J.S.\nBell to remark, “Either the wavefunction, as given by the\nSchrödinger equation, is not everything, or it is not\nright” (Bell 1987: 41, 2004: 201). This gives us a (prima\nfacie) tidy way of classifying approaches to the measurement\nproblem:\n\nThere are approaches that involve a denial that a quantum wave\nfunction (or any other way of representing a quantum state) yields a\ncomplete description of a physical system.\nThere are approaches that involve modification of the dynamics to\nproduce a collapse of the quantum state in appropriate\ncircumstances.\nThere are approaches that reject both horns of Bell’s\ndilemma, and hold that quantum states undergo unitary evolution at all\ntimes and that a quantum state-description is, in principle,\ncomplete.\n\n\nWe include in the first category approaches that deny that a quantum\nstate should be thought of as representing anything in reality at all.\nThese include variants of the Copenhagen interpretation, as well as\npragmatic and other anti-realist approaches. Also in the first\ncategory are approaches that seek a completion of the quantum state\ndescription. These include hidden-variables approaches and modal\ninterpretations. The second category of interpretation motivates a\nresearch programme of finding suitable indeterministic modifications\nof the quantum dynamics. Approaches that reject both horns of\nBell’s dilemma are typified by Everettian, or\n“many-worlds” interpretations.\n4.2.1 The “Copenhagen interpretation”\n\nSince the mid-1950’s, the term “Copenhagen\ninterpretation” has been commonly used for whatever it is that\nthe person employing the term takes to be the ‘orthodox’\nviewpoint regarding the philosophical issues raised by quantum\nmechanics. According to Howard (2004), the phrase was first used by\nHeisenberg (1955, 1958), and is intended to suggest a commonality of\nviews among Bohr and his associates, included Born and Heisenberg\nhimself. Recent historiography has emphasized diversity of viewpoints\namong the figures associated with the Copenhagen interpretation; see\nthe entry on\n Copenhagen interpretation of quantum mechanics,\n and references therein. Readers should be aware that the term is not\nunivocal, and that different authors might mean different things when\nspeaking of the“Copenhagen interpretation.”\n4.2.2 Non-realist and pragmatist approaches to quantum mechanics\n\nFrom the early days of quantum mechanics, there has been a strain of\nthought that holds that the proper attitude to take towards quantum\nmechanics is an instrumentalist or pragmatic one. On such a view,\nquantum mechanics is a tool for coordinating our experience and for\nforming expectations about the outcomes of experiments. Variants of\nthis view include some versions of the Copenhagen interpretation. More\nrecently, views of this sort have been advocated by physicists,\nincluding QBists, who hold that quantum states represent subjective or\nepistemic probabilities (see Fuchs et al., 2014). The\nphilosopher Richard Healey defends a related view on which quantum\nstates, though objective, are not to be taken as\nrepresentational  (see Healey 2012, 2017a, 2020). For more on\nthese approaches, see entry on\n Quantum-Bayesian and pragmatist views of quantum theory.\n4.2.2 Hidden-variables and modal interpretations\n\nTheories whose structure include the quantum state but include\nadditional structure, with an aim of circumventing the measurement\nproblem, have traditionally been called “hidden-variables\ntheories”. That a quantum state description cannot be regarded\nas a complete description of physical reality was argued for in a\nfamous paper by Einstein, Podolsky and Rosen (EPR) and by Einstein in\nsubsequent publications (Einstein 1936, 1948, 1949). See the entry on\nthe\n Einstein-Podolsky-Rosen argument in quantum theory.\n\nThere are a number of theorems that circumscribe the scope of possible\nhidden-variables theories. The most natural thought would be to seek a\ntheory that assigns to all quantum observables definite values that\nare merely revealed upon measurement, in such a way that any\nexperimental procedure that, in conventional quantum mechanics, would\ncount as a “measurement” of an observable yields the\ndefinite value assigned to the observable. Theories of this sort are\ncalled noncontextual hidden-variables theory. It was shown by\nBell (1966) and Kochen and Specker (1967) that there are no such\ntheories for any system whose Hilbert space dimension is greater than\nthree (see the entry on\n the Kochen-Specker theorem).\n\nThe Bell-Kochen-Specker Theorem does not rule out hidden-variables\ntheories tout court. The simplest way to circumvent it is to\npick as always-definite some observable or compatible set of\nobservables that suffices to guarantee determinate outcomes of\nexperiments; other observables are not assigned definite values and\nexperiments thought of as “measurements” of these\nobservables do not reveal pre-existing values.\n\nThe most thoroughly worked-out theory of this type is the pilot wave\ntheory developed by de Broglie and presented by him at the Fifth\nSolvay Conference held in Brussels in 1927, revived by David Bohm in\n1952, and currently an active area of research by a small group of\nphysicists and philosophers. According to this theory, there are\nparticles with definite trajectories, that are guided by the quantum\nwave function. For the history of the de Broglie theory, see the\nintroductory chapters of Bacciagaluppi and Valentini (2009). For an\noverview of the de Broglie-Bohm theory and philosophical issues\nassociated with it see the entry on\n Bohmian mechanics.\n\nThere have been other proposals for supplementing the quantum state\nwith additional structure; these have come to be called modal\ninterpretations; see the entry on\n modal interpretations of quantum mechanics.\n4.2.3 Dynamical Collapse Theories\n\nAs already mentioned,  Dirac wrote as if the collapse of the\nquantum state vector precipitated by an experimental intervention on\nthe system is a genuine physical change, distinct from the usual\nunitary evolution. If collapse is to be taken as a genuine physical\nprocess, then something more needs to be said about the circumstances\nunder which it occurs than merely that it happens when an experiment\nis performed. This gives rise to a research programme of formulating a\nprecisely defined dynamics for the quantum state that approximates the\nlinear, unitary Schrödinger evolution in situations for which\nthis is well-confirmed, and produces collapse to an eigenstate of the\noutcome variable in typical experimental set-ups, or, failing that, a\nclose approximation to an eigenstate. The only promising collapse\ntheories are stochastic in nature; indeed, it can be shown that a\ndeterministic collapse theory would permit superluminal signalling.\nSee the entry on\n collapse theories\n for an overview, and Gao, ed. (2018) for a snapshot of contemporary\ndiscussions.\n\nPrima facie, a dynamical collapse theory of this type can be\na quantum state monist theory, one on which, in Bell’s words,\n“the wave function is everything”. In recent years, this\nhas been disputed; it has been argued that collapse theories require\n“primitive ontology” in addition to the quantum state. See\nAllori et al. (2008), Allori (2013), and also the entry on\n collapse theories,\n and references therein. Reservations about this approach have been\nexpressed by Egg (2017, 2021), Myrvold (2018), and Wallace \n(2020).\n4.2.4 Everettian, or “many worlds” theories\n\nIn his doctoral dissertation of 1957 (reprinted in Everett 2012), Hugh\nEverett III proposed that quantum mechanics be taken as it is, without\na collapse postulate and without any “hidden variables”.\nThe resulting interpretation he called the relative state\ninterpretation.\n\nThe basic idea is this. After an experiment, the quantum state of the\nsystem plus apparatus is typically a superposition of terms\ncorresponding to distinct outcomes. As the apparatus interacts with\nits environment, which may include observers, these systems become\nentangled with the apparatus and quantum system, the net result of\nwhich is a quantum state involving, for each of the possible\nexperimental outcomes, a term in which the apparatus reading\ncorresponds to that outcome, there are records of that outcome in the\nenvironment, observers observe that outcome, etc.. Everett\nproposed that each of these terms be taken to be equally real. From a\nGod’s-eye-view, there is no unique experimental outcome, but one\ncan also focus on a particular determinate state of one subsystem,\nsay, the experimental apparatus, and attribute to the other systems\nparticipating in the entangled state a relative state,\nrelative to that state of the apparatus. That is, relative to the\napparatus reading ‘+’ is a state of the environment\nrecording that result and states of observers observing that result\n(see the entry on\n Everett’s relative-state formulation of quantum mechanics,\n for more detail on Everett’s views).\n\nEverett’s work has inspired a family of views that go by the\nname of “Many Worlds” interpretations; the idea is that\neach of the terms of the superposition corresponds to a coherent\nworld, and all of these worlds are equally real. As time goes on,\nthere is a proliferation of these worlds, as situations arise that\ngive rise to a further multiplicity of outcomes (see the entry\n many-worlds interpretation of quantum mechanics,\n and Saunders 2007, for overviews of recent discussions; Wallace 2012\nis an extended defense of an Everettian interpretation of quantum\nmechanics).\n\nThere is a family of distinct, but related views, that go by the name\nof “Relational Quantum Mechanics”. These views agree with\nEverett in attributing to a system definite values of dynamical\nvariables only relative to the states of other systems; they differ in\nthat, unlike Everett, they do not take the quantum state as their\nbasic ontology (see the entry on\n relational quantum mechanics\n for more detail).\n",
    "section_title": "4.2 Approaches to the measurement problem",
    "entry_title": "Philosophical Issues in Quantum Theory",
    "hierarchy_title": "Philosophical Issues in Quantum Theory || The measurement problem || Approaches to the measurement problem",
    "tokenized_text": [
        "measurement",
        "problem",
        "approach",
        "measurement",
        "problem",
        "approach",
        "measurement",
        "problem",
        "quantum",
        "state",
        "evolution",
        "proceeds",
        "via",
        "schrödinger",
        "equation",
        "linear",
        "equation",
        "seen",
        "previous",
        "section",
        "typical",
        "experiment",
        "lead",
        "quantum",
        "state",
        "superposition",
        "term",
        "corresponding",
        "distinct",
        "experimental",
        "outcome",
        "sometimes",
        "said",
        "conflict",
        "experience",
        "according",
        "experimental",
        "outcome",
        "variable",
        "pointer",
        "reading",
        "always",
        "definite",
        "value",
        "misleading",
        "way",
        "putting",
        "issue",
        "immediately",
        "clear",
        "interpret",
        "state",
        "sort",
        "physical",
        "state",
        "system",
        "includes",
        "experimental",
        "apparatus",
        "say",
        "would",
        "like",
        "observe",
        "apparatus",
        "state",
        "make",
        "sense",
        "say",
        "never",
        "observe",
        "state",
        "like",
        "nonetheless",
        "faced",
        "interpretational",
        "problem",
        "take",
        "quantum",
        "state",
        "complete",
        "description",
        "system",
        "state",
        "contrary",
        "would",
        "antecedently",
        "expect",
        "state",
        "corresponding",
        "unique",
        "definite",
        "outcome",
        "led",
        "js",
        "bell",
        "remark",
        "either",
        "wavefunction",
        "given",
        "schrödinger",
        "equation",
        "everything",
        "right",
        "bell",
        "give",
        "u",
        "prima",
        "facie",
        "tidy",
        "way",
        "classifying",
        "approach",
        "measurement",
        "problem",
        "approach",
        "involve",
        "denial",
        "quantum",
        "wave",
        "function",
        "way",
        "representing",
        "quantum",
        "state",
        "yield",
        "complete",
        "description",
        "physical",
        "system",
        "approach",
        "involve",
        "modification",
        "dynamic",
        "produce",
        "collapse",
        "quantum",
        "state",
        "appropriate",
        "circumstance",
        "approach",
        "reject",
        "horn",
        "bell",
        "dilemma",
        "hold",
        "quantum",
        "state",
        "undergo",
        "unitary",
        "evolution",
        "time",
        "quantum",
        "statedescription",
        "principle",
        "complete",
        "include",
        "first",
        "category",
        "approach",
        "deny",
        "quantum",
        "state",
        "thought",
        "representing",
        "anything",
        "reality",
        "include",
        "variant",
        "copenhagen",
        "interpretation",
        "well",
        "pragmatic",
        "antirealist",
        "approach",
        "also",
        "first",
        "category",
        "approach",
        "seek",
        "completion",
        "quantum",
        "state",
        "description",
        "include",
        "hiddenvariables",
        "approach",
        "modal",
        "interpretation",
        "second",
        "category",
        "interpretation",
        "motivates",
        "research",
        "programme",
        "finding",
        "suitable",
        "indeterministic",
        "modification",
        "quantum",
        "dynamic",
        "approach",
        "reject",
        "horn",
        "bell",
        "dilemma",
        "typified",
        "everettian",
        "manyworlds",
        "interpretation",
        "copenhagen",
        "interpretation",
        "since",
        "mid",
        "term",
        "copenhagen",
        "interpretation",
        "commonly",
        "used",
        "whatever",
        "person",
        "employing",
        "term",
        "take",
        "orthodox",
        "viewpoint",
        "regarding",
        "philosophical",
        "issue",
        "raised",
        "quantum",
        "mechanic",
        "according",
        "howard",
        "phrase",
        "first",
        "used",
        "heisenberg",
        "intended",
        "suggest",
        "commonality",
        "view",
        "among",
        "bohr",
        "associate",
        "included",
        "born",
        "heisenberg",
        "recent",
        "historiography",
        "emphasized",
        "diversity",
        "viewpoint",
        "among",
        "figure",
        "associated",
        "copenhagen",
        "interpretation",
        "see",
        "entry",
        "copenhagen",
        "interpretation",
        "quantum",
        "mechanic",
        "reference",
        "therein",
        "reader",
        "aware",
        "term",
        "univocal",
        "different",
        "author",
        "might",
        "mean",
        "different",
        "thing",
        "speaking",
        "copenhagen",
        "interpretation",
        "nonrealist",
        "pragmatist",
        "approach",
        "quantum",
        "mechanic",
        "early",
        "day",
        "quantum",
        "mechanic",
        "strain",
        "thought",
        "hold",
        "proper",
        "attitude",
        "take",
        "towards",
        "quantum",
        "mechanic",
        "instrumentalist",
        "pragmatic",
        "one",
        "view",
        "quantum",
        "mechanic",
        "tool",
        "coordinating",
        "experience",
        "forming",
        "expectation",
        "outcome",
        "experiment",
        "variant",
        "view",
        "include",
        "version",
        "copenhagen",
        "interpretation",
        "recently",
        "view",
        "sort",
        "advocated",
        "physicist",
        "including",
        "qbists",
        "hold",
        "quantum",
        "state",
        "represent",
        "subjective",
        "epistemic",
        "probability",
        "see",
        "fuchs",
        "et",
        "al",
        "philosopher",
        "richard",
        "healey",
        "defends",
        "related",
        "view",
        "quantum",
        "state",
        "though",
        "objective",
        "taken",
        "representational",
        "see",
        "healey",
        "a",
        "approach",
        "see",
        "entry",
        "quantumbayesian",
        "pragmatist",
        "view",
        "quantum",
        "theory",
        "hiddenvariables",
        "modal",
        "interpretation",
        "theory",
        "whose",
        "structure",
        "include",
        "quantum",
        "state",
        "include",
        "additional",
        "structure",
        "aim",
        "circumventing",
        "measurement",
        "problem",
        "traditionally",
        "called",
        "hiddenvariables",
        "theory",
        "quantum",
        "state",
        "description",
        "regarded",
        "complete",
        "description",
        "physical",
        "reality",
        "argued",
        "famous",
        "paper",
        "einstein",
        "podolsky",
        "rosen",
        "epr",
        "einstein",
        "subsequent",
        "publication",
        "einstein",
        "see",
        "entry",
        "einsteinpodolskyrosen",
        "argument",
        "quantum",
        "theory",
        "number",
        "theorem",
        "circumscribe",
        "scope",
        "possible",
        "hiddenvariables",
        "theory",
        "natural",
        "thought",
        "would",
        "seek",
        "theory",
        "assigns",
        "quantum",
        "observables",
        "definite",
        "value",
        "merely",
        "revealed",
        "upon",
        "measurement",
        "way",
        "experimental",
        "procedure",
        "conventional",
        "quantum",
        "mechanic",
        "would",
        "count",
        "measurement",
        "observable",
        "yield",
        "definite",
        "value",
        "assigned",
        "observable",
        "theory",
        "sort",
        "called",
        "noncontextual",
        "hiddenvariables",
        "theory",
        "shown",
        "bell",
        "kochen",
        "specker",
        "theory",
        "system",
        "whose",
        "hilbert",
        "space",
        "dimension",
        "greater",
        "three",
        "see",
        "entry",
        "kochenspecker",
        "theorem",
        "bellkochenspecker",
        "theorem",
        "rule",
        "hiddenvariables",
        "theory",
        "tout",
        "court",
        "simplest",
        "way",
        "circumvent",
        "pick",
        "alwaysdefinite",
        "observable",
        "compatible",
        "set",
        "observables",
        "suffices",
        "guarantee",
        "determinate",
        "outcome",
        "experiment",
        "observables",
        "assigned",
        "definite",
        "value",
        "experiment",
        "thought",
        "measurement",
        "observables",
        "reveal",
        "preexisting",
        "value",
        "thoroughly",
        "workedout",
        "theory",
        "type",
        "pilot",
        "wave",
        "theory",
        "developed",
        "de",
        "broglie",
        "presented",
        "fifth",
        "solvay",
        "conference",
        "held",
        "brussels",
        "revived",
        "david",
        "bohm",
        "currently",
        "active",
        "area",
        "research",
        "small",
        "group",
        "physicist",
        "philosopher",
        "according",
        "theory",
        "particle",
        "definite",
        "trajectory",
        "guided",
        "quantum",
        "wave",
        "function",
        "history",
        "de",
        "broglie",
        "theory",
        "see",
        "introductory",
        "chapter",
        "bacciagaluppi",
        "valentini",
        "overview",
        "de",
        "brogliebohm",
        "theory",
        "philosophical",
        "issue",
        "associated",
        "see",
        "entry",
        "bohmian",
        "mechanic",
        "proposal",
        "supplementing",
        "quantum",
        "state",
        "additional",
        "structure",
        "come",
        "called",
        "modal",
        "interpretation",
        "see",
        "entry",
        "modal",
        "interpretation",
        "quantum",
        "mechanic",
        "dynamical",
        "collapse",
        "theory",
        "already",
        "mentioned",
        "dirac",
        "wrote",
        "collapse",
        "quantum",
        "state",
        "vector",
        "precipitated",
        "experimental",
        "intervention",
        "system",
        "genuine",
        "physical",
        "change",
        "distinct",
        "usual",
        "unitary",
        "evolution",
        "collapse",
        "taken",
        "genuine",
        "physical",
        "process",
        "something",
        "need",
        "said",
        "circumstance",
        "occurs",
        "merely",
        "happens",
        "experiment",
        "performed",
        "give",
        "rise",
        "research",
        "programme",
        "formulating",
        "precisely",
        "defined",
        "dynamic",
        "quantum",
        "state",
        "approximates",
        "linear",
        "unitary",
        "schrödinger",
        "evolution",
        "situation",
        "wellconfirmed",
        "produce",
        "collapse",
        "eigenstate",
        "outcome",
        "variable",
        "typical",
        "experimental",
        "setups",
        "failing",
        "close",
        "approximation",
        "eigenstate",
        "promising",
        "collapse",
        "theory",
        "stochastic",
        "nature",
        "indeed",
        "shown",
        "deterministic",
        "collapse",
        "theory",
        "would",
        "permit",
        "superluminal",
        "signalling",
        "see",
        "entry",
        "collapse",
        "theory",
        "overview",
        "gao",
        "ed",
        "snapshot",
        "contemporary",
        "discussion",
        "prima",
        "facie",
        "dynamical",
        "collapse",
        "theory",
        "type",
        "quantum",
        "state",
        "monist",
        "theory",
        "one",
        "bell",
        "word",
        "wave",
        "function",
        "everything",
        "recent",
        "year",
        "disputed",
        "argued",
        "collapse",
        "theory",
        "require",
        "primitive",
        "ontology",
        "addition",
        "quantum",
        "state",
        "see",
        "allori",
        "et",
        "al",
        "allori",
        "also",
        "entry",
        "collapse",
        "theory",
        "reference",
        "therein",
        "reservation",
        "approach",
        "expressed",
        "egg",
        "myrvold",
        "wallace",
        "everettian",
        "many",
        "world",
        "theory",
        "doctoral",
        "dissertation",
        "reprinted",
        "everett",
        "hugh",
        "everett",
        "iii",
        "proposed",
        "quantum",
        "mechanic",
        "taken",
        "without",
        "collapse",
        "postulate",
        "without",
        "hidden",
        "variable",
        "resulting",
        "interpretation",
        "called",
        "relative",
        "state",
        "interpretation",
        "basic",
        "idea",
        "experiment",
        "quantum",
        "state",
        "system",
        "plus",
        "apparatus",
        "typically",
        "superposition",
        "term",
        "corresponding",
        "distinct",
        "outcome",
        "apparatus",
        "interacts",
        "environment",
        "may",
        "include",
        "observer",
        "system",
        "become",
        "entangled",
        "apparatus",
        "quantum",
        "system",
        "net",
        "result",
        "quantum",
        "state",
        "involving",
        "possible",
        "experimental",
        "outcome",
        "term",
        "apparatus",
        "reading",
        "corresponds",
        "outcome",
        "record",
        "outcome",
        "environment",
        "observer",
        "observe",
        "outcome",
        "etc",
        "everett",
        "proposed",
        "term",
        "taken",
        "equally",
        "real",
        "god",
        "seyeview",
        "unique",
        "experimental",
        "outcome",
        "one",
        "also",
        "focus",
        "particular",
        "determinate",
        "state",
        "one",
        "subsystem",
        "say",
        "experimental",
        "apparatus",
        "attribute",
        "system",
        "participating",
        "entangled",
        "state",
        "relative",
        "state",
        "relative",
        "state",
        "apparatus",
        "relative",
        "apparatus",
        "reading",
        "state",
        "environment",
        "recording",
        "result",
        "state",
        "observer",
        "observing",
        "result",
        "see",
        "entry",
        "everett",
        "relativestate",
        "formulation",
        "quantum",
        "mechanic",
        "detail",
        "everett",
        "view",
        "everett",
        "work",
        "inspired",
        "family",
        "view",
        "go",
        "name",
        "many",
        "world",
        "interpretation",
        "idea",
        "term",
        "superposition",
        "corresponds",
        "coherent",
        "world",
        "world",
        "equally",
        "real",
        "time",
        "go",
        "proliferation",
        "world",
        "situation",
        "arise",
        "give",
        "rise",
        "multiplicity",
        "outcome",
        "see",
        "entry",
        "manyworlds",
        "interpretation",
        "quantum",
        "mechanic",
        "saunders",
        "overview",
        "recent",
        "discussion",
        "wallace",
        "extended",
        "defense",
        "everettian",
        "interpretation",
        "quantum",
        "mechanic",
        "family",
        "distinct",
        "related",
        "view",
        "go",
        "name",
        "relational",
        "quantum",
        "mechanic",
        "view",
        "agree",
        "everett",
        "attributing",
        "system",
        "definite",
        "value",
        "dynamical",
        "variable",
        "relative",
        "state",
        "system",
        "differ",
        "unlike",
        "everett",
        "take",
        "quantum",
        "state",
        "basic",
        "ontology",
        "see",
        "entry",
        "relational",
        "quantum",
        "mechanic",
        "detail"
    ]
}