{
    "main_text": "Quantum Physics and the Identity of Indiscernibles\n4. Quantum Physics and the Identity of Indiscernibles\n\n\nNow, of course, both quantum and classical objects of the same kind\n– such as electrons, say – are indistinguishable in the\nsense that they possess all intrinsic properties – charge, spin,\nrest mass etc. – in common. However, quantum objects are\nindistinguishable in a much stronger sense in that it is not just that\ntwo or more electrons possess the same intrinsic properties but that\n– on the standard understanding – no measurement\nwhatsoever could in principle determine which one is which. If the\nnon-intrinsic, state-dependent properties are identified with all the\nmonadic or relational properties which can be expressed in terms of\nphysical magnitudes standardly associated with self-adjoint operators\nthat can be defined for the objects, then it can be shown that two\nbosons or two fermions in a joint symmetric or anti-symmetric state\nrespectively have the same monadic properties and the same relational\nproperties one to another (French and Redhead 1988; see also\nButterfield 1993). This has immediate implications for the Principle\nof the Identity of Indiscernibles which, expressed crudely, insists\nthat two things which are indiscernible, must be, in fact,\nidentical. \n\n\nSetting aside the historical issue of Leibniz’s own attitude towards\nhis Principle (see, for example, Rodriguez-Pereyra 2014),\nsupporters of it have tended to retreat from the claim that it is\nnecessary and have adopted the alternative view that it is at least contingently true (in the\nface of apparent counter-examples such as possible worlds containing\njust two indistinguishable spheres).  There is the further issue as to\nhow the Principle should be characterised and, in particular, there is\nthe question of what properties are to be included within the scope of\nthose relevant to judgments of indiscernibility. Excluding the\nproperty of self-identity (which, again, we’ll come back to below),\nthree forms of the Principle can be broadly distinguished according to\nthe properties involved: the weakest form, PII(1), states that it is\nnot possible for two individuals to possess all properties and\nrelations in common; the next strongest, PII(2), excludes\nspatio-temporal properties from this description; and the strongest\nform, PII(3), includes only monadic, non-relational properties. Thus,\nfor example, PII(3) is the claim that no two individuals can possess\nall the same monadic properties (a strong claim indeed, although it is\none way of understanding Leibniz’s own view).\n\n\nIn fact, PII(2) and PII(3) are clearly violated in classical\nphysics, where distinct particles of the same kind are typically\nregarded as indistinguishable in the sense of possessing all intrinsic\nproperties in common and such properties are regarded as non-relational\nin general and non-spatio-temporal in particular. (Of course, Leibniz\nhimself would not have been perturbed by this result, since he took the\nPrinciple of Identity of Indiscernibles to ultimately apply only to\n‘monads’, which were the fundamental entities of his\nontology. Physical objects such as particles were regarded by him as\nmerely ‘well founded phenomena’.) However, PII(1) is not\nviolated classically, since classical statistical mechanics typically\nassumes that such particles are impenetrable, in precisely the sense\nthat their spatio-temporal trajectories cannot overlap. Hence they can\nbe individuated via their spatio-temporal properties, as indicated\nabove.\n\n\nThe situation appears to be very different in quantum mechanics,\nhowever. If the particles are taken to possess both their intrinsic\nand state-dependent properties in common, as suggested above, then\nthere is a sense in which even the weakest form of the Principle,\nPII(1), fails (Cortes 1976; Teller 1983; French and Redhead 1988; for\nan alternative view, see van Fraassen 1985 and 1991). On this\nunderstanding, the Principle of Identity of Indiscernibles is actually\nfalse. Hence it cannot be used to effectively guarantee individuation\nvia the state-dependent properties by analogy with the classical\ncase. If one wishes to maintain that quantum particles are\nindividuals, then their individuality will have to be taken as\nconferred by Lockean substance, primitive thisness or, in general,\nsome form of non-qualitative haecceistic difference.\n\n\nHowever, this conclusion has been challenged. First of all, it has been\nquestioned whether quantum particles can be said to possess the\nrelevant state-dependent properties in the sense that would be\ndamaging to PII (Massimi 2001; see also Mittelstaedt and Castellani 2000). However, this argument only applies to monadic,\nstate-dependent properties and so the above conclusion still holds for\nPII(2) and PII(3). In effect, what has been shown is that those\nversions of PII which allow relations to individuate are not the\nweakest forms of the Principle, but the only forms which are\napplicable.\n\n\nThis shift to relations as individuating elements has led to the development of a form\nof PII, based on Quine’s suggestions about discernibility, which\nallows objects to be ‘weakly’ discernible in relational\nterms (Saunders 2003a and 2006; for a useful overview see Bigaj\n2015a). Consider for example, two fermions in a spherically-symmetric\nsinglet state. The fermions are not only indistinguishable in the\nabove sense but also possess exactly the same set of spatio-temporal\nproperties and relations. However, each enters into the symmetric but\nirreflexive relation of ‘having opposite direction of each\ncomponent of spin to …’ on the basis of which they can be\nsaid to be ‘weakly discernible’ (for general discussions of different\nkinds of discernibility see Caulton and Butterfield 2012a; Bigaj 2014;\nKetland 2011; Ladyman, Linnebo and Pettigrew 2012). If we extend PII\nto incorporate such relations, the Principle can, it seems, be made\ncompatible with quantum physics and the individuality of the fermions\ncan be grounded in these irreflexive relations, without having to\nappeal to anything like primitive thisness. This result has also been\nextended to bosons (Muller and Saunders 2008; Muller and Seevinck\n2009), although some of the details are contentious, in particular\nwith regard to the interpretation of some of the mathematical features\nthat are appealed to in this account (see Bigaj 2015a and 2015b; Caulton 2013; Huggett and Norton 2014; Norton 2015). In addition to such technical issues, there is the\nfurther philosophical concern that the appeal to irreflexive relations\nin order to ground the individuality of the objects which bear such\nrelations involves a circularity: in order to appeal to such\nrelations, one has had to already individuate the particles which are\nso related and the numerical diversity of the particles has been\npresupposed by the relation which hence cannot account for it (see\nFrench and Krause 2006; Hawley 2006 and 2009). One response to this\nworry would be to question the underlying assumption that relata must\nhave the relevant ontological priority over relations and adopt some\nform of structuralist view of objects according to which the relata\nare eliminable in terms of relations (perhaps ‘emerging’, in some\nsense as ‘intersections’ of them) or, more mildly perhaps,\nargue that neither are accorded priority but come as a\n‘package’ as it were (for further discussion see French\n2014). It has been suggested, for example, that this whole discussion\nof weak discernibility reveals a category of entity that has received\nlittle attention so far, namely that of ‘relationals’: objects that\ncan be discerned by means of relations only (Muller 2011, 2015). I\nshall return to the structuralist perspective below (but for an alternative, ‘coherentist’ account, see Calosi and Morganti 2018). More generally,\nhowever, it has been argued that this whole debate is orthogonal to\nthat over the status of PII since what weak discernibility grounds is\nmerely numerical distinctness, rather than the robust sense of\ndiscernibility that PII was originally concerned with (Ladyman and\nBigaj 2010). The latter involves some sense of difference over and\nabove numerical distinctness but weakly discernible relations such as\n‘having opposite direction of each component of spin to\n…’ do not provide this. Hence, it is claimed, PII remains\nviolated by quantum mechanics (although see Friebe 2014 where the principle is defended in the context of a specific understanding of quantum entanglement). \n\n\nThe above considerations are typically presented within the\n‘orthodox’ interpretation of quantum mechanics but there\nare a further set of responses which step outside of this. Thus van\nFraassen, for example (van Fraassen 1985 and 1991) has advocated a\nform of ‘modal’ interpretation, in the context of which\n(standard) PII can be retained. At the core of this approach lies a\ndistinction between two kinds of state: the ‘value’ state,\nwhich is specified by stating which observables have values and what\nthey are; and the ‘dynamic’ state, which is specified by\nstating how the system will develop both if isolated and if acted upon\nin some definite fashion. The evolution of the latter is\ndeterministic, in accordance with Schroedinger’s equation, but\nthe value state changes unpredictably, within the limits set by the\ndynamic state (for criticism see some of the papers in Dieks and\nVermaas 1998). Because the actual values of observables do not\nincrease predictive power if added to the relevant dynamic state\ndescription, they are deemed to be ‘empirically\nsuperfluous’. In the case of fermions, at least, distinct value\nstates can be assigned to each particle and PII saved.\n \n\nHowever concerns have been raised over the objectivity of such value\nstate attributions (Massimi op. cit., p. 318, fn. 11) and one might\nregard the associated ‘empirically superfluous’ properties\nas merely conceptual. This bears again on the important issue of what kinds\nof properties may be admitted to lie within the scope of the\nPrinciple. Clearly some would appear to be beyond the pale: saving PII\nby regarding the particle labels themselves as intrinsic properties is\nsurely unacceptable. Furthermore, bosons must be treated differently,\nsince they can have the same dynamic and value states. In this case,\nvan Fraassen suggests that each boson is individuated by its history,\nwhere this is again to be understood as ‘empirically\nsuperfluous’. Of course, it might seem odd that an approach\nwhich originally sought to avoid the grounding of the individuality of\nobjects in something like Lockean substance should find itself having\nto include empirically superfluous factors within the scope of\nPII.\n\n\nAnother ‘unorthodox’ approach incorporates the Bohmian\ninterpretation of quantum mechanics and in particular it has been\nsuggested that it might form the basis of an alternative conception of\nparticle individuality in terms of their spatio-temporal\ntrajectories. As is well known, attributing distinguishing\nspatio-temporal trajectories to quantum objects faces acute\ndifficulties under the orthodox interpretation of quantum\nmechanics. On the Bohm interpretation, however, they are allowed;\nindeed, the only observable admitted is that of position. What this\ninterpretation gives us is a dual ontology of point particles plus\n`pilot’ wave, where the role of the latter is to determine the\ninstantaneous velocities of the former through the so-called\n‘guidance equations’. These ‘complete’ the standard\nformulation of quantum mechanics so that, in addition to the quantum\nstate, whose development is determined by the Schrödinger equation,\nthere is also a set of single-particle trajectories, each of which is\ndetermined by the guidance equation, plus the initial positions of the\nparticles (for a review see Cushing et al. 1996). Such an\ninterpretation appears to provide a natural home for the metaphysical\npackage which takes quantum objects to be individuals (see, for\nexample, Brown et al. 1999) and, indeed, a form of PII(1) can\nnow be defended against the above conclusion.\n\n\nNevertheless, things are not quite as straightforward as they might\nseem: it has been argued that intrinsic properties cannot be\nconsidered as possessed solely by the objects but in some sense must\nbe assigned to the pilot wave as well (Brown et al.1994). Thus, again, there is an\nontological cost involved in retaining this view of objects as\nindividuals.\n\n\nWhat if one were to consider the evolution of the system concerned in\nthe multi-dimensional ‘configuration space’ in terms of which\nthe wave function must be described? Here the implications of\nconsidering particle permutations are encoded in the topology of such\na space by identifying points corresponding to such a permutation and\nthereby constructing what is known as the ‘reduced configuration\nspace’ formed by the action of the permutation group on the full\nconfiguration space. As in the case of ‘ordinary’ space-time,\nsome form of ‘impenetrability assumption’ must be adopted to\nensure that – in the case of those particles that are not bosons at\nleast – no two particles occupy the same point of this reduced\nspace.Here Bohmian\nmechanics offers some advantage: it turns out that the guidance equations\nensure the non-coincidence of the relevant particle trajectories\n(Brown et al. 1999). In effect ‘impenetrability’\nis built into the dynamics and thus the configuration space approach\nand de Broglie-Bohm interpretation fit nicely together.\n\n\nReturning to the core point, one can maintain that quantum objects are\nindividuals, even granted the implications of quantum statistics. And\none can either take that individuality to be ungrounded and\n‘primitive’ or ground it in some form of primitive thisness or, more\nplausibly for many, in the associated properties via an updated and\nextended form of PII (criticisms and concerns\nnotwithstanding). However, there is also the alternative, articulated\nduring the throes of the quantum revolution itself, as noted above,\nwhich is to take quantum objects to be non-individuals in some\nsense. Of course, if this alternative metaphysical ‘package’ is\nadopted then Leibniz’s Principle simply does not apply. But now the\nobvious question arises: what sense can we make of this notion of\n‘non-individuality’?\n",
    "section_title": "4. Quantum Physics and the Identity of Indiscernibles",
    "entry_title": "Identity and Individuality in Quantum Theory",
    "hierarchy_title": "Identity and Individuality in Quantum Theory || Quantum Physics and the Identity of Indiscernibles",
    "tokenized_text": [
        "quantum",
        "physic",
        "identity",
        "indiscernibles",
        "quantum",
        "physic",
        "identity",
        "indiscernibles",
        "course",
        "quantum",
        "classical",
        "object",
        "kind",
        "electron",
        "say",
        "indistinguishable",
        "sense",
        "posse",
        "intrinsic",
        "property",
        "charge",
        "spin",
        "rest",
        "mass",
        "etc",
        "common",
        "however",
        "quantum",
        "object",
        "indistinguishable",
        "much",
        "stronger",
        "sense",
        "two",
        "electron",
        "posse",
        "intrinsic",
        "property",
        "standard",
        "understanding",
        "measurement",
        "whatsoever",
        "could",
        "principle",
        "determine",
        "one",
        "nonintrinsic",
        "statedependent",
        "property",
        "identified",
        "monadic",
        "relational",
        "property",
        "expressed",
        "term",
        "physical",
        "magnitude",
        "standardly",
        "associated",
        "selfadjoint",
        "operator",
        "defined",
        "object",
        "shown",
        "two",
        "boson",
        "two",
        "fermion",
        "joint",
        "symmetric",
        "antisymmetric",
        "state",
        "respectively",
        "monadic",
        "property",
        "relational",
        "property",
        "one",
        "another",
        "french",
        "redhead",
        "see",
        "also",
        "butterfield",
        "immediate",
        "implication",
        "principle",
        "identity",
        "indiscernibles",
        "expressed",
        "crudely",
        "insists",
        "two",
        "thing",
        "indiscernible",
        "must",
        "fact",
        "identical",
        "setting",
        "aside",
        "historical",
        "issue",
        "leibniz",
        "attitude",
        "towards",
        "principle",
        "see",
        "example",
        "rodriguezpereyra",
        "supporter",
        "tended",
        "retreat",
        "claim",
        "necessary",
        "adopted",
        "alternative",
        "view",
        "least",
        "contingently",
        "true",
        "face",
        "apparent",
        "counterexamples",
        "possible",
        "world",
        "containing",
        "two",
        "indistinguishable",
        "sphere",
        "issue",
        "principle",
        "characterised",
        "particular",
        "question",
        "property",
        "included",
        "within",
        "scope",
        "relevant",
        "judgment",
        "indiscernibility",
        "excluding",
        "property",
        "selfidentity",
        "come",
        "back",
        "three",
        "form",
        "principle",
        "broadly",
        "distinguished",
        "according",
        "property",
        "involved",
        "weakest",
        "form",
        "pii",
        "state",
        "possible",
        "two",
        "individual",
        "posse",
        "property",
        "relation",
        "common",
        "next",
        "strongest",
        "pii",
        "excludes",
        "spatiotemporal",
        "property",
        "description",
        "strongest",
        "form",
        "pii",
        "includes",
        "monadic",
        "nonrelational",
        "property",
        "thus",
        "example",
        "pii",
        "claim",
        "two",
        "individual",
        "posse",
        "monadic",
        "property",
        "strong",
        "claim",
        "indeed",
        "although",
        "one",
        "way",
        "understanding",
        "leibniz",
        "view",
        "fact",
        "pii",
        "pii",
        "clearly",
        "violated",
        "classical",
        "physic",
        "distinct",
        "particle",
        "kind",
        "typically",
        "regarded",
        "indistinguishable",
        "sense",
        "possessing",
        "intrinsic",
        "property",
        "common",
        "property",
        "regarded",
        "nonrelational",
        "general",
        "nonspatiotemporal",
        "particular",
        "course",
        "leibniz",
        "would",
        "perturbed",
        "result",
        "since",
        "took",
        "principle",
        "identity",
        "indiscernibles",
        "ultimately",
        "apply",
        "monad",
        "fundamental",
        "entity",
        "ontology",
        "physical",
        "object",
        "particle",
        "regarded",
        "merely",
        "well",
        "founded",
        "phenomenon",
        "however",
        "pii",
        "violated",
        "classically",
        "since",
        "classical",
        "statistical",
        "mechanic",
        "typically",
        "assumes",
        "particle",
        "impenetrable",
        "precisely",
        "sense",
        "spatiotemporal",
        "trajectory",
        "overlap",
        "hence",
        "individuated",
        "via",
        "spatiotemporal",
        "property",
        "indicated",
        "situation",
        "appears",
        "different",
        "quantum",
        "mechanic",
        "however",
        "particle",
        "taken",
        "posse",
        "intrinsic",
        "statedependent",
        "property",
        "common",
        "suggested",
        "sense",
        "even",
        "weakest",
        "form",
        "principle",
        "pii",
        "fails",
        "cortes",
        "teller",
        "french",
        "redhead",
        "alternative",
        "view",
        "see",
        "van",
        "fraassen",
        "understanding",
        "principle",
        "identity",
        "indiscernibles",
        "actually",
        "false",
        "hence",
        "used",
        "effectively",
        "guarantee",
        "individuation",
        "via",
        "statedependent",
        "property",
        "analogy",
        "classical",
        "case",
        "one",
        "wish",
        "maintain",
        "quantum",
        "particle",
        "individual",
        "individuality",
        "taken",
        "conferred",
        "lockean",
        "substance",
        "primitive",
        "thisness",
        "general",
        "form",
        "nonqualitative",
        "haecceistic",
        "difference",
        "however",
        "conclusion",
        "challenged",
        "first",
        "questioned",
        "whether",
        "quantum",
        "particle",
        "said",
        "posse",
        "relevant",
        "statedependent",
        "property",
        "sense",
        "would",
        "damaging",
        "pii",
        "massimi",
        "see",
        "also",
        "mittelstaedt",
        "castellani",
        "however",
        "argument",
        "applies",
        "monadic",
        "statedependent",
        "property",
        "conclusion",
        "still",
        "hold",
        "pii",
        "pii",
        "effect",
        "shown",
        "version",
        "pii",
        "allow",
        "relation",
        "individuate",
        "weakest",
        "form",
        "principle",
        "form",
        "applicable",
        "shift",
        "relation",
        "individuating",
        "element",
        "led",
        "development",
        "form",
        "pii",
        "based",
        "quine",
        "suggestion",
        "discernibility",
        "allows",
        "object",
        "weakly",
        "discernible",
        "relational",
        "term",
        "saunders",
        "a",
        "useful",
        "overview",
        "see",
        "bigaj",
        "a",
        "consider",
        "example",
        "two",
        "fermion",
        "sphericallysymmetric",
        "singlet",
        "state",
        "fermion",
        "indistinguishable",
        "sense",
        "also",
        "posse",
        "exactly",
        "set",
        "spatiotemporal",
        "property",
        "relation",
        "however",
        "enters",
        "symmetric",
        "irreflexive",
        "relation",
        "opposite",
        "direction",
        "component",
        "spin",
        "basis",
        "said",
        "weakly",
        "discernible",
        "general",
        "discussion",
        "different",
        "kind",
        "discernibility",
        "see",
        "caulton",
        "butterfield",
        "a",
        "bigaj",
        "ketland",
        "ladyman",
        "linnebo",
        "pettigrew",
        "extend",
        "pii",
        "incorporate",
        "relation",
        "principle",
        "seems",
        "made",
        "compatible",
        "quantum",
        "physic",
        "individuality",
        "fermion",
        "grounded",
        "irreflexive",
        "relation",
        "without",
        "appeal",
        "anything",
        "like",
        "primitive",
        "thisness",
        "result",
        "also",
        "extended",
        "boson",
        "muller",
        "saunders",
        "muller",
        "seevinck",
        "although",
        "detail",
        "contentious",
        "particular",
        "regard",
        "interpretation",
        "mathematical",
        "feature",
        "appealed",
        "account",
        "see",
        "bigaj",
        "a",
        "b",
        "caulton",
        "huggett",
        "norton",
        "norton",
        "addition",
        "technical",
        "issue",
        "philosophical",
        "concern",
        "appeal",
        "irreflexive",
        "relation",
        "order",
        "ground",
        "individuality",
        "object",
        "bear",
        "relation",
        "involves",
        "circularity",
        "order",
        "appeal",
        "relation",
        "one",
        "already",
        "individuate",
        "particle",
        "related",
        "numerical",
        "diversity",
        "particle",
        "presupposed",
        "relation",
        "hence",
        "account",
        "see",
        "french",
        "krause",
        "hawley",
        "one",
        "response",
        "worry",
        "would",
        "question",
        "underlying",
        "assumption",
        "relatum",
        "must",
        "relevant",
        "ontological",
        "priority",
        "relation",
        "adopt",
        "form",
        "structuralist",
        "view",
        "object",
        "according",
        "relatum",
        "eliminable",
        "term",
        "relation",
        "perhaps",
        "emerging",
        "sense",
        "intersection",
        "mildly",
        "perhaps",
        "argue",
        "neither",
        "accorded",
        "priority",
        "come",
        "package",
        "discussion",
        "see",
        "french",
        "suggested",
        "example",
        "whole",
        "discussion",
        "weak",
        "discernibility",
        "reveals",
        "category",
        "entity",
        "received",
        "little",
        "attention",
        "far",
        "namely",
        "relationals",
        "object",
        "discerned",
        "mean",
        "relation",
        "muller",
        "shall",
        "return",
        "structuralist",
        "perspective",
        "alternative",
        "coherentist",
        "account",
        "see",
        "calosi",
        "morganti",
        "generally",
        "however",
        "argued",
        "whole",
        "debate",
        "orthogonal",
        "status",
        "pii",
        "since",
        "weak",
        "discernibility",
        "ground",
        "merely",
        "numerical",
        "distinctness",
        "rather",
        "robust",
        "sense",
        "discernibility",
        "pii",
        "originally",
        "concerned",
        "ladyman",
        "bigaj",
        "latter",
        "involves",
        "sense",
        "difference",
        "numerical",
        "distinctness",
        "weakly",
        "discernible",
        "relation",
        "opposite",
        "direction",
        "component",
        "spin",
        "provide",
        "hence",
        "claimed",
        "pii",
        "remains",
        "violated",
        "quantum",
        "mechanic",
        "although",
        "see",
        "friebe",
        "principle",
        "defended",
        "context",
        "specific",
        "understanding",
        "quantum",
        "entanglement",
        "consideration",
        "typically",
        "presented",
        "within",
        "orthodox",
        "interpretation",
        "quantum",
        "mechanic",
        "set",
        "response",
        "step",
        "outside",
        "thus",
        "van",
        "fraassen",
        "example",
        "van",
        "fraassen",
        "advocated",
        "form",
        "modal",
        "interpretation",
        "context",
        "standard",
        "pii",
        "retained",
        "core",
        "approach",
        "lie",
        "distinction",
        "two",
        "kind",
        "state",
        "value",
        "state",
        "specified",
        "stating",
        "observables",
        "value",
        "dynamic",
        "state",
        "specified",
        "stating",
        "system",
        "develop",
        "isolated",
        "acted",
        "upon",
        "definite",
        "fashion",
        "evolution",
        "latter",
        "deterministic",
        "accordance",
        "schroedinger",
        "equation",
        "value",
        "state",
        "change",
        "unpredictably",
        "within",
        "limit",
        "set",
        "dynamic",
        "state",
        "criticism",
        "see",
        "paper",
        "dieks",
        "vermaas",
        "actual",
        "value",
        "observables",
        "increase",
        "predictive",
        "power",
        "added",
        "relevant",
        "dynamic",
        "state",
        "description",
        "deemed",
        "empirically",
        "superfluous",
        "case",
        "fermion",
        "least",
        "distinct",
        "value",
        "state",
        "assigned",
        "particle",
        "pii",
        "saved",
        "however",
        "concern",
        "raised",
        "objectivity",
        "value",
        "state",
        "attribution",
        "massimi",
        "op",
        "cit",
        "p",
        "fn",
        "one",
        "might",
        "regard",
        "associated",
        "empirically",
        "superfluous",
        "property",
        "merely",
        "conceptual",
        "bear",
        "important",
        "issue",
        "kind",
        "property",
        "may",
        "admitted",
        "lie",
        "within",
        "scope",
        "principle",
        "clearly",
        "would",
        "appear",
        "beyond",
        "pale",
        "saving",
        "pii",
        "regarding",
        "particle",
        "label",
        "intrinsic",
        "property",
        "surely",
        "unacceptable",
        "furthermore",
        "boson",
        "must",
        "treated",
        "differently",
        "since",
        "dynamic",
        "value",
        "state",
        "case",
        "van",
        "fraassen",
        "suggests",
        "boson",
        "individuated",
        "history",
        "understood",
        "empirically",
        "superfluous",
        "course",
        "might",
        "seem",
        "odd",
        "approach",
        "originally",
        "sought",
        "avoid",
        "grounding",
        "individuality",
        "object",
        "something",
        "like",
        "lockean",
        "substance",
        "find",
        "include",
        "empirically",
        "superfluous",
        "factor",
        "within",
        "scope",
        "pii",
        "another",
        "unorthodox",
        "approach",
        "incorporates",
        "bohmian",
        "interpretation",
        "quantum",
        "mechanic",
        "particular",
        "suggested",
        "might",
        "form",
        "basis",
        "alternative",
        "conception",
        "particle",
        "individuality",
        "term",
        "spatiotemporal",
        "trajectory",
        "well",
        "known",
        "attributing",
        "distinguishing",
        "spatiotemporal",
        "trajectory",
        "quantum",
        "object",
        "face",
        "acute",
        "difficulty",
        "orthodox",
        "interpretation",
        "quantum",
        "mechanic",
        "bohm",
        "interpretation",
        "however",
        "allowed",
        "indeed",
        "observable",
        "admitted",
        "position",
        "interpretation",
        "give",
        "u",
        "dual",
        "ontology",
        "point",
        "particle",
        "plus",
        "pilot",
        "wave",
        "role",
        "latter",
        "determine",
        "instantaneous",
        "velocity",
        "former",
        "socalled",
        "guidance",
        "equation",
        "complete",
        "standard",
        "formulation",
        "quantum",
        "mechanic",
        "addition",
        "quantum",
        "state",
        "whose",
        "development",
        "determined",
        "schrödinger",
        "equation",
        "also",
        "set",
        "singleparticle",
        "trajectory",
        "determined",
        "guidance",
        "equation",
        "plus",
        "initial",
        "position",
        "particle",
        "review",
        "see",
        "cushing",
        "et",
        "al",
        "interpretation",
        "appears",
        "provide",
        "natural",
        "home",
        "metaphysical",
        "package",
        "take",
        "quantum",
        "object",
        "individual",
        "see",
        "example",
        "brown",
        "et",
        "al",
        "indeed",
        "form",
        "pii",
        "defended",
        "conclusion",
        "nevertheless",
        "thing",
        "quite",
        "straightforward",
        "might",
        "seem",
        "argued",
        "intrinsic",
        "property",
        "considered",
        "possessed",
        "solely",
        "object",
        "sense",
        "must",
        "assigned",
        "pilot",
        "wave",
        "well",
        "brown",
        "et",
        "al",
        "thus",
        "ontological",
        "cost",
        "involved",
        "retaining",
        "view",
        "object",
        "individual",
        "one",
        "consider",
        "evolution",
        "system",
        "concerned",
        "multidimensional",
        "configuration",
        "space",
        "term",
        "wave",
        "function",
        "must",
        "described",
        "implication",
        "considering",
        "particle",
        "permutation",
        "encoded",
        "topology",
        "space",
        "identifying",
        "point",
        "corresponding",
        "permutation",
        "thereby",
        "constructing",
        "known",
        "reduced",
        "configuration",
        "space",
        "formed",
        "action",
        "permutation",
        "group",
        "full",
        "configuration",
        "space",
        "case",
        "ordinary",
        "spacetime",
        "form",
        "impenetrability",
        "assumption",
        "must",
        "adopted",
        "ensure",
        "case",
        "particle",
        "boson",
        "least",
        "two",
        "particle",
        "occupy",
        "point",
        "reduced",
        "spacehere",
        "bohmian",
        "mechanic",
        "offer",
        "advantage",
        "turn",
        "guidance",
        "equation",
        "ensure",
        "noncoincidence",
        "relevant",
        "particle",
        "trajectory",
        "brown",
        "et",
        "al",
        "effect",
        "impenetrability",
        "built",
        "dynamic",
        "thus",
        "configuration",
        "space",
        "approach",
        "de",
        "brogliebohm",
        "interpretation",
        "fit",
        "nicely",
        "together",
        "returning",
        "core",
        "point",
        "one",
        "maintain",
        "quantum",
        "object",
        "individual",
        "even",
        "granted",
        "implication",
        "quantum",
        "statistic",
        "one",
        "either",
        "take",
        "individuality",
        "ungrounded",
        "primitive",
        "ground",
        "form",
        "primitive",
        "thisness",
        "plausibly",
        "many",
        "associated",
        "property",
        "via",
        "updated",
        "extended",
        "form",
        "pii",
        "criticism",
        "concern",
        "notwithstanding",
        "however",
        "also",
        "alternative",
        "articulated",
        "throe",
        "quantum",
        "revolution",
        "noted",
        "take",
        "quantum",
        "object",
        "nonindividuals",
        "sense",
        "course",
        "alternative",
        "metaphysical",
        "package",
        "adopted",
        "leibniz",
        "principle",
        "simply",
        "apply",
        "obvious",
        "question",
        "arises",
        "sense",
        "make",
        "notion",
        "nonindividuality"
    ]
}