{
    "main_text": "Dirac and the Foundations of Quantum Theory || Pragmatics versus Axiomatics\n5.1 Pragmatics versus Axiomatics \n\nMost physicists use Lagrangian QFT (LQFT) to make predictions that\nhave been experimentally verified with extraordinary precision in some\ncases. However, LQFT has been described as a “grab bag of\nconflicting mathematical ideas” that has not provided a sharp\nmathematical description of what counts as a QFT model (Swanson 2017,\npp. 1–2). Those criticisms motivated mathematically inclined\nphysicists to search for a mathematically rigorous formulation of QFT.\nAxiomatic versions of QFT have been favored by mathematical physicists\nand most philosophers. With greater mathematical rigor it is possible\nto prove results about the theoretical structure of QFT independent of\nany particular Lagrangian. Axiomatic QFT provides clear conceptual\nframeworks within which precise questions and answers to\ninterpretational issues can be formulated. There are three main\naxiomatic frameworks for QFT: Wightman QFT, Osterwalder-Schrader QFT,\nand algebraic QFT. In Wightman QFT, the axioms use functional analysis\nand operator algebras and is closer to LQFT since its axioms describe\ncovariant field operators acting on a fixed Hilbert space. The\nOsterwalder-Schrader axioms use a functional integration approach to\nQFT. The algebraic QFT axioms use \\(C^*\\)-algebras to model local\nobservables. However, axiomatic QFT approaches are sorely lacking with\nregards to building empirically adequate models. Unlike quantum\nmechanics which has a canonical mathematical framework in terms of von\nNeumann’s Hilbert space formulation, QFT has no canonical\nmathematical framework. Even though there is a canonical mathematical\nframework for quantum mechanics, there are many interpretations of\nthat framework, e.g., many-worlds, GRW, Copenhagen, Bohmian, etc...\nQFT has two levels that require interpretation: (1) which QFT\nframework should be the focus of these foundational efforts, if any,\nand (2) how that preferred framework should be interpreted. Since (1)\ninvolves issues about mathematical rigor and pragmatic virtues, it\ndirectly bears on the focus of this article. The lack of a canonical\nformulation of QFT threatens to impede any metaphysical or\nepistemological lessons that might be learned from QFT.\n\nOne view is that these two approaches to QFT, the mathematically\nrigorous axiomatic approach and the pragmatic / empirically adequate\nLQFT approach, are rival research programs (see David Wallace (2006,\n2011) and Doreen Fraser (2009, 2011)), though Swanson (2017) argues\nthat they are not rival programs. Fraser (2009, 2011) argues that the\ninterpretation of QFT should be based on the mathematically rigorous\napproach of axiomatic formulations of QFT. By contrast, Wallace (2006,\n2011) argues that an interpretation of QFT should be based on LQFT.\n(Wallace, in 2006, calls his preferred QFT framework conventional QFT\n(CQFT), but changes his terminology to LQFT in Wallace 2011). Swanson\n(2017) and Egg, Lam, and Oldofedi (2017) are good overviews of the\ndebate between Fraser and Wallace (for an extended analysis see James\nFraser 2016). The debate covers many different philosophical topics in\nQFT, which makes it more challenging to pin down exactly what is\nessential to the arguments for both sides (for one view of what is\nessential for the debate, see Egg, Lam, and Oldofedi 2017). One issue\nis the role of internal consistency established by mathematical rigor\nversus empirical adequacy. Wallace argues that LQFT is empirically\nadequate since it can describe the forces of the Standard Model. LQFT\nhas a collection of calculational techniques including perturbation\ntheory, path integrals, and renormalization group methods. One\ncriticism of LQFT is that the calculational techniques it uses are not\nmathematically rigorous. Wallace argues that renormalization group\nmethods puts perturbative QFT, an approach within LQFT, on\nmathematically rigorous ground and removes the main motivation for\naxiomatic QFT.\n5.1.1 Perturbative Quantum Field Theory \n\nWhat follows is a rough overview of perturbative QFT (see James Fraser\n2016 for more details). Since exactly solvable free QFT models are\nmore mathematically tractable than interacting QFT models,\nperturbative QFT treats interactions as perturbations to the free\nLagrangian assuming weak coupling. For strongly coupled theories like\nquantum chromodynamics that idealization fails. Using perturbation\ntheory, approximate solutions for interacting QFT models can be\ncalculated by expanding S-matrix elements in a power series in terms\nof a coupling parameter. However, the higher order terms will often\ncontain divergent integrals. Typically, renormalization of the higher\norder terms is required to get finite predictions. Two sources of\ndivergent integrals are infrared (long distance, low energy) and\nultraviolet (short distance, high energy) divergences. Infrared\ndivergences are often handled by imposing a long distance cutoff or\nputting a small non-zero lower limit for the integral over momentum. A\nsharp cutoff at low momentum is equivalent to putting the theory in a\nfinite volume box. Imposing asymptotic boundary conditions and\nrestricting the observables to long distance “friendly”\nobservables also help with infrared divergences. Ultraviolet\ndivergences are often handled by imposing a momentum cutoff to remove\nhigh momentum modes of a theory. That is equivalent to freezing out\nvariations in the fields at arbitrarily short length scales. Putting\nthe system on a lattice with some finite spacing can also help deal\nwith the high momentum. Dimensional regularization, where the integral\nmeasure is redefined to range over a fractional number of dimensions,\ncan help with both infrared and ultraviolet divergences. The last step\nin renormalization is to remove the cutoffs by taking the continuum\nlimit (i.e., removing the high momentum cutoff) and the infinite\nvolume limit (i.e., removing the low momentum cutoff). The hope is\nthat the limit is well-defined and there are finite expressions of the\nseries at each order.\n\nJames Fraser (2016) identifies three problems for perturbative QFT.\n(1) The rigor problem: perturbative QFT is not mathematically\nrigorous which makes it difficult to analyze and interpret. (2)\nThe consistency problem: perturbative calculations rest on\nthe interaction picture existing, but Haag’s theorem seems to\nshow that the interaction picture does not exist. (3) The\njustification problem: renormalization lacks physical motivation\nand appears ad hoc. James Fraser argues that (1) and (2) do not pose\nsevere problems for perturbative QFT because it is not attempting to\nbuild continuum QFT models. It is building approximate physical\nquantities – not mathematical structures that are to be\ninterpreted as physical systems.\n\nBaker (2016) and Swanson (2017) note that LQFT makes false or unproven\nassumptions such as the convergence of certain infinite sums in\nperturbation theory. Dyson (1952) gives a heuristic argument that\nquantum electrodynamic perturbation series do not converge. Baker and\nSwanson also argue that the use of long distance cutoffs is at odds\nwith cosmological theory and astronomical observations which suggest\nthat the universe is spatially infinite. Even in the weak coupling\nlimit where perturbation theory can be formally applied, it is not\nclear when the perturbative QFT gives an accurate approximation of the\nunderlying physics. In the interacting \\(\\phi^4\\) theory, when the\ndimension is less than 4 for Minkowski spacetime, the theory is\nnontrivial, but when the dimension is greater than 4, the renormalized\nperturbation series is asymptotic to a free field theory even though\nit appears to describe nontrivial interactions. When there are 4\ndimensions, the theory is also trivial if additional technical\nassumptions hold (see Swanson 2017 (p. 3) for more details).\n5.1.2 Path Integrals in Quantum Field Theory\n\nAnother area where questions of mathematical rigor arise within\nperturbative QFT is the use of path integrals. The S-matrix power\nseries expansion contains integrals over momentum space and this is\nwhere path integrals / Feynman diagrams have been helpful for making\ncalculations. The key concept is the partition function \\(Z\\),\nwhich is defined as a functional integral involving\nthe action, which is itself an integral of the Lagrangian. The\nfollowing details come mainly from Hancox-Li (2017). More\nspecifically, the action is a functional of quantum fields. The\nfunctional integral over the action ranges over all possible\ncombinations of the quantum fields values over spacetime. Informally,\nthe sum is being taken over all possible field configurations. As\nSwanson (2017) notes, the path integral requires choosing a measure\nover an infinite dimensional path space, which is only mathematically\nwell-defined in special cases. For example, if the system is\nformulated on a hypercubic lattice, then the measure can be defined\n(see section 1.2 of James Fraser 2016). Another way of having a\nwell-defined measure is to restrict attention to a finite dimensional\nsubspace. But if functions are allowed to vary arbitrarily on short\nlength scales, then the integral ceases to be well-defined (Wallace\n2006, p. 42). All of the correlation functions (i.e., vacuum state\nexpectation values of the fields at different spacetime points), can\nbe derived from the partition function \\(Z\\). So, given\n\\(Z\\), all empirical quantities associated with the\nLagrangian can be calculated, e.g., scattering cross-sections. Finding\n\\(Z\\) amounts to a solution of LQFT. \\(Z\\)\ncan be expanded in a Taylor series in the coupling\nconstant. When this is done, two types of divergences can occur: (1)\nindividual terms of the perturbation series can diverge and/or (2) the\nperturbation series itself is divergent, though the series may be an\nasymptotic series. To deal with (1), physicists do the following\nprocedures (Hancox-Li 2017, pp. 344–345): (i) regularization, which\ninvolves reducing the number of degrees of freedom via dimensional\nregularization, momentum cutoffs, or using a lattice formulation and\n(ii) add counterterms to compensate for the regularization in (i). But\nthis construction is purely formal and not mathematically defined. The\nrules used to manipulate the Lagrangian, and hence the partition\nfunction, are not well-defined.\n5.1.3 Renormalization Group Techniques \n\nWallace (2011) argues that renormalization group techniques have\novercome the mathematical deficiencies of older renormalization\ncalculational techniques (for more details on the renormalization\ngroup see Butterfield and Bouatta 2015, Fraser 2016, Hancox-Li (2015a,\n2015b, 2017)). According to Wallace, the renormalization group methods\nput LQFT on the same level of mathematical rigor as other areas of\ntheoretical physics. It provides a solid theoretical framework that is\nexplanatorily rich in particle physics and condensed matter physics,\nso the impetus for axiomatic QFT has been resolved. Renormalization\ngroup techniques presuppose that QFT will fail at some short length\nscale, but the empirical content of LQFT is largely insensitive to the\ndetails at such short length scales. Doreen Fraser (2011) argues that\nrenormalization group methods help articulate the empirical content of\nQFT, but the renormalization group has no significance for the\ntheoretical content of QFT insofar as it does not tell us whether we\nshould focus on LQFT or AQFT. James Fraser (2016) and Hancox-Li\n(2015b) argue that the renormalization group does more than provide\nempirical predictions in QFT. The renormalization group gives us\nmethods for studying the behavior of physical systems at different\nenergy scales, namely how properties of QFT models depend or do not\ndepend on small scale structure. The renormalization group provides a\nnon-perturbative explanation of the success of perturbative QFT.\nHancox-Li (2015b) discusses how mathematicians working in constructive\nQFT use non-perturbative approximations with well controlled error\nbounds to prove the existence or non-existence of ultraviolet fixed\npoints. Hancox-Li argues that the renormalization group explains\nperturbative renormalization non-perturbatively. The renormalization\ngroup can tell us whether certain Lagrangians have an ultraviolet\nlimit that satisfies the axioms a QFT should satisfy. Thus, the use of\nthe renormalization group in constructive QFT can provide additional\ndynamical information (e.g., whether a certain dynamics can occur in\ncontinuous spacetime) that a pure axiomatic approach does not.\n",
    "section_title": "5.1 Pragmatics versus Axiomatics ",
    "entry_title": "Quantum Theory and Mathematical Rigor",
    "hierarchy_title": "Quantum Theory and Mathematical Rigor || Dirac and the Foundations of Quantum Theory || Pragmatics versus Axiomatics",
    "tokenized_text": [
        "dirac",
        "foundation",
        "quantum",
        "theory",
        "pragmatic",
        "versus",
        "axiomatics",
        "pragmatic",
        "versus",
        "axiomatics",
        "physicist",
        "use",
        "lagrangian",
        "qft",
        "lqft",
        "make",
        "prediction",
        "experimentally",
        "verified",
        "extraordinary",
        "precision",
        "case",
        "however",
        "lqft",
        "described",
        "grab",
        "bag",
        "conflicting",
        "mathematical",
        "idea",
        "provided",
        "sharp",
        "mathematical",
        "description",
        "count",
        "qft",
        "model",
        "swanson",
        "pp",
        "criticism",
        "motivated",
        "mathematically",
        "inclined",
        "physicist",
        "search",
        "mathematically",
        "rigorous",
        "formulation",
        "qft",
        "axiomatic",
        "version",
        "qft",
        "favored",
        "mathematical",
        "physicist",
        "philosopher",
        "greater",
        "mathematical",
        "rigor",
        "possible",
        "prove",
        "result",
        "theoretical",
        "structure",
        "qft",
        "independent",
        "particular",
        "lagrangian",
        "axiomatic",
        "qft",
        "provides",
        "clear",
        "conceptual",
        "framework",
        "within",
        "precise",
        "question",
        "answer",
        "interpretational",
        "issue",
        "formulated",
        "three",
        "main",
        "axiomatic",
        "framework",
        "qft",
        "wightman",
        "qft",
        "osterwalderschrader",
        "qft",
        "algebraic",
        "qft",
        "wightman",
        "qft",
        "axiom",
        "use",
        "functional",
        "analysis",
        "operator",
        "algebra",
        "closer",
        "lqft",
        "since",
        "axiom",
        "describe",
        "covariant",
        "field",
        "operator",
        "acting",
        "fixed",
        "hilbert",
        "space",
        "osterwalderschrader",
        "axiom",
        "use",
        "functional",
        "integration",
        "approach",
        "qft",
        "algebraic",
        "qft",
        "axiom",
        "use",
        "c",
        "algebras",
        "model",
        "local",
        "observables",
        "however",
        "axiomatic",
        "qft",
        "approach",
        "sorely",
        "lacking",
        "regard",
        "building",
        "empirically",
        "adequate",
        "model",
        "unlike",
        "quantum",
        "mechanic",
        "canonical",
        "mathematical",
        "framework",
        "term",
        "von",
        "neumann",
        "hilbert",
        "space",
        "formulation",
        "qft",
        "canonical",
        "mathematical",
        "framework",
        "even",
        "though",
        "canonical",
        "mathematical",
        "framework",
        "quantum",
        "mechanic",
        "many",
        "interpretation",
        "framework",
        "eg",
        "manyworlds",
        "grw",
        "copenhagen",
        "bohmian",
        "etc",
        "qft",
        "two",
        "level",
        "require",
        "interpretation",
        "qft",
        "framework",
        "focus",
        "foundational",
        "effort",
        "preferred",
        "framework",
        "interpreted",
        "since",
        "involves",
        "issue",
        "mathematical",
        "rigor",
        "pragmatic",
        "virtue",
        "directly",
        "bear",
        "focus",
        "article",
        "lack",
        "canonical",
        "formulation",
        "qft",
        "threatens",
        "impede",
        "metaphysical",
        "epistemological",
        "lesson",
        "might",
        "learned",
        "qft",
        "one",
        "view",
        "two",
        "approach",
        "qft",
        "mathematically",
        "rigorous",
        "axiomatic",
        "approach",
        "pragmatic",
        "empirically",
        "adequate",
        "lqft",
        "approach",
        "rival",
        "research",
        "program",
        "see",
        "david",
        "wallace",
        "doreen",
        "fraser",
        "though",
        "swanson",
        "argues",
        "rival",
        "program",
        "fraser",
        "argues",
        "interpretation",
        "qft",
        "based",
        "mathematically",
        "rigorous",
        "approach",
        "axiomatic",
        "formulation",
        "qft",
        "contrast",
        "wallace",
        "argues",
        "interpretation",
        "qft",
        "based",
        "lqft",
        "wallace",
        "call",
        "preferred",
        "qft",
        "framework",
        "conventional",
        "qft",
        "cqft",
        "change",
        "terminology",
        "lqft",
        "wallace",
        "swanson",
        "egg",
        "lam",
        "oldofedi",
        "good",
        "overview",
        "debate",
        "fraser",
        "wallace",
        "extended",
        "analysis",
        "see",
        "james",
        "fraser",
        "debate",
        "cover",
        "many",
        "different",
        "philosophical",
        "topic",
        "qft",
        "make",
        "challenging",
        "pin",
        "exactly",
        "essential",
        "argument",
        "side",
        "one",
        "view",
        "essential",
        "debate",
        "see",
        "egg",
        "lam",
        "oldofedi",
        "one",
        "issue",
        "role",
        "internal",
        "consistency",
        "established",
        "mathematical",
        "rigor",
        "versus",
        "empirical",
        "adequacy",
        "wallace",
        "argues",
        "lqft",
        "empirically",
        "adequate",
        "since",
        "describe",
        "force",
        "standard",
        "model",
        "lqft",
        "collection",
        "calculational",
        "technique",
        "including",
        "perturbation",
        "theory",
        "path",
        "integral",
        "renormalization",
        "group",
        "method",
        "one",
        "criticism",
        "lqft",
        "calculational",
        "technique",
        "us",
        "mathematically",
        "rigorous",
        "wallace",
        "argues",
        "renormalization",
        "group",
        "method",
        "put",
        "perturbative",
        "qft",
        "approach",
        "within",
        "lqft",
        "mathematically",
        "rigorous",
        "ground",
        "remove",
        "main",
        "motivation",
        "axiomatic",
        "qft",
        "perturbative",
        "quantum",
        "field",
        "theory",
        "follows",
        "rough",
        "overview",
        "perturbative",
        "qft",
        "see",
        "james",
        "fraser",
        "detail",
        "since",
        "exactly",
        "solvable",
        "free",
        "qft",
        "model",
        "mathematically",
        "tractable",
        "interacting",
        "qft",
        "model",
        "perturbative",
        "qft",
        "treat",
        "interaction",
        "perturbation",
        "free",
        "lagrangian",
        "assuming",
        "weak",
        "coupling",
        "strongly",
        "coupled",
        "theory",
        "like",
        "quantum",
        "chromodynamics",
        "idealization",
        "fails",
        "using",
        "perturbation",
        "theory",
        "approximate",
        "solution",
        "interacting",
        "qft",
        "model",
        "calculated",
        "expanding",
        "smatrix",
        "element",
        "power",
        "series",
        "term",
        "coupling",
        "parameter",
        "however",
        "higher",
        "order",
        "term",
        "often",
        "contain",
        "divergent",
        "integral",
        "typically",
        "renormalization",
        "higher",
        "order",
        "term",
        "required",
        "get",
        "finite",
        "prediction",
        "two",
        "source",
        "divergent",
        "integral",
        "infrared",
        "long",
        "distance",
        "low",
        "energy",
        "ultraviolet",
        "short",
        "distance",
        "high",
        "energy",
        "divergence",
        "infrared",
        "divergence",
        "often",
        "handled",
        "imposing",
        "long",
        "distance",
        "cutoff",
        "putting",
        "small",
        "nonzero",
        "lower",
        "limit",
        "integral",
        "momentum",
        "sharp",
        "cutoff",
        "low",
        "momentum",
        "equivalent",
        "putting",
        "theory",
        "finite",
        "volume",
        "box",
        "imposing",
        "asymptotic",
        "boundary",
        "condition",
        "restricting",
        "observables",
        "long",
        "distance",
        "friendly",
        "observables",
        "also",
        "help",
        "infrared",
        "divergence",
        "ultraviolet",
        "divergence",
        "often",
        "handled",
        "imposing",
        "momentum",
        "cutoff",
        "remove",
        "high",
        "momentum",
        "mode",
        "theory",
        "equivalent",
        "freezing",
        "variation",
        "field",
        "arbitrarily",
        "short",
        "length",
        "scale",
        "putting",
        "system",
        "lattice",
        "finite",
        "spacing",
        "also",
        "help",
        "deal",
        "high",
        "momentum",
        "dimensional",
        "regularization",
        "integral",
        "measure",
        "redefined",
        "range",
        "fractional",
        "number",
        "dimension",
        "help",
        "infrared",
        "ultraviolet",
        "divergence",
        "last",
        "step",
        "renormalization",
        "remove",
        "cutoff",
        "taking",
        "continuum",
        "limit",
        "ie",
        "removing",
        "high",
        "momentum",
        "cutoff",
        "infinite",
        "volume",
        "limit",
        "ie",
        "removing",
        "low",
        "momentum",
        "cutoff",
        "hope",
        "limit",
        "welldefined",
        "finite",
        "expression",
        "series",
        "order",
        "james",
        "fraser",
        "identifies",
        "three",
        "problem",
        "perturbative",
        "qft",
        "rigor",
        "problem",
        "perturbative",
        "qft",
        "mathematically",
        "rigorous",
        "make",
        "difficult",
        "analyze",
        "interpret",
        "consistency",
        "problem",
        "perturbative",
        "calculation",
        "rest",
        "interaction",
        "picture",
        "existing",
        "haag",
        "theorem",
        "seems",
        "show",
        "interaction",
        "picture",
        "exist",
        "justification",
        "problem",
        "renormalization",
        "lack",
        "physical",
        "motivation",
        "appears",
        "ad",
        "hoc",
        "james",
        "fraser",
        "argues",
        "pose",
        "severe",
        "problem",
        "perturbative",
        "qft",
        "attempting",
        "build",
        "continuum",
        "qft",
        "model",
        "building",
        "approximate",
        "physical",
        "quantity",
        "mathematical",
        "structure",
        "interpreted",
        "physical",
        "system",
        "baker",
        "swanson",
        "note",
        "lqft",
        "make",
        "false",
        "unproven",
        "assumption",
        "convergence",
        "certain",
        "infinite",
        "sum",
        "perturbation",
        "theory",
        "dyson",
        "give",
        "heuristic",
        "argument",
        "quantum",
        "electrodynamic",
        "perturbation",
        "series",
        "converge",
        "baker",
        "swanson",
        "also",
        "argue",
        "use",
        "long",
        "distance",
        "cutoff",
        "odds",
        "cosmological",
        "theory",
        "astronomical",
        "observation",
        "suggest",
        "universe",
        "spatially",
        "infinite",
        "even",
        "weak",
        "coupling",
        "limit",
        "perturbation",
        "theory",
        "formally",
        "applied",
        "clear",
        "perturbative",
        "qft",
        "give",
        "accurate",
        "approximation",
        "underlying",
        "physic",
        "interacting",
        "phi",
        "theory",
        "dimension",
        "le",
        "minkowski",
        "spacetime",
        "theory",
        "nontrivial",
        "dimension",
        "greater",
        "renormalized",
        "perturbation",
        "series",
        "asymptotic",
        "free",
        "field",
        "theory",
        "even",
        "though",
        "appears",
        "describe",
        "nontrivial",
        "interaction",
        "dimension",
        "theory",
        "also",
        "trivial",
        "additional",
        "technical",
        "assumption",
        "hold",
        "see",
        "swanson",
        "p",
        "detail",
        "path",
        "integral",
        "quantum",
        "field",
        "theory",
        "another",
        "area",
        "question",
        "mathematical",
        "rigor",
        "arise",
        "within",
        "perturbative",
        "qft",
        "use",
        "path",
        "integral",
        "smatrix",
        "power",
        "series",
        "expansion",
        "contains",
        "integral",
        "momentum",
        "space",
        "path",
        "integral",
        "feynman",
        "diagram",
        "helpful",
        "making",
        "calculation",
        "key",
        "concept",
        "partition",
        "function",
        "z",
        "defined",
        "functional",
        "integral",
        "involving",
        "action",
        "integral",
        "lagrangian",
        "following",
        "detail",
        "come",
        "mainly",
        "hancoxli",
        "specifically",
        "action",
        "functional",
        "quantum",
        "field",
        "functional",
        "integral",
        "action",
        "range",
        "possible",
        "combination",
        "quantum",
        "field",
        "value",
        "spacetime",
        "informally",
        "sum",
        "taken",
        "possible",
        "field",
        "configuration",
        "swanson",
        "note",
        "path",
        "integral",
        "requires",
        "choosing",
        "measure",
        "infinite",
        "dimensional",
        "path",
        "space",
        "mathematically",
        "welldefined",
        "special",
        "case",
        "example",
        "system",
        "formulated",
        "hypercubic",
        "lattice",
        "measure",
        "defined",
        "see",
        "section",
        "james",
        "fraser",
        "another",
        "way",
        "welldefined",
        "measure",
        "restrict",
        "attention",
        "finite",
        "dimensional",
        "subspace",
        "function",
        "allowed",
        "vary",
        "arbitrarily",
        "short",
        "length",
        "scale",
        "integral",
        "cease",
        "welldefined",
        "wallace",
        "p",
        "correlation",
        "function",
        "ie",
        "vacuum",
        "state",
        "expectation",
        "value",
        "field",
        "different",
        "spacetime",
        "point",
        "derived",
        "partition",
        "function",
        "z",
        "given",
        "z",
        "empirical",
        "quantity",
        "associated",
        "lagrangian",
        "calculated",
        "eg",
        "scattering",
        "crosssections",
        "finding",
        "z",
        "amount",
        "solution",
        "lqft",
        "z",
        "expanded",
        "taylor",
        "series",
        "coupling",
        "constant",
        "done",
        "two",
        "type",
        "divergence",
        "occur",
        "individual",
        "term",
        "perturbation",
        "series",
        "diverge",
        "andor",
        "perturbation",
        "series",
        "divergent",
        "though",
        "series",
        "may",
        "asymptotic",
        "series",
        "deal",
        "physicist",
        "following",
        "procedure",
        "hancoxli",
        "pp",
        "regularization",
        "involves",
        "reducing",
        "number",
        "degree",
        "freedom",
        "via",
        "dimensional",
        "regularization",
        "momentum",
        "cutoff",
        "using",
        "lattice",
        "formulation",
        "ii",
        "add",
        "counterterms",
        "compensate",
        "regularization",
        "construction",
        "purely",
        "formal",
        "mathematically",
        "defined",
        "rule",
        "used",
        "manipulate",
        "lagrangian",
        "hence",
        "partition",
        "function",
        "welldefined",
        "renormalization",
        "group",
        "technique",
        "wallace",
        "argues",
        "renormalization",
        "group",
        "technique",
        "overcome",
        "mathematical",
        "deficiency",
        "older",
        "renormalization",
        "calculational",
        "technique",
        "detail",
        "renormalization",
        "group",
        "see",
        "butterfield",
        "bouatta",
        "fraser",
        "hancoxli",
        "a",
        "b",
        "according",
        "wallace",
        "renormalization",
        "group",
        "method",
        "put",
        "lqft",
        "level",
        "mathematical",
        "rigor",
        "area",
        "theoretical",
        "physic",
        "provides",
        "solid",
        "theoretical",
        "framework",
        "explanatorily",
        "rich",
        "particle",
        "physic",
        "condensed",
        "matter",
        "physic",
        "impetus",
        "axiomatic",
        "qft",
        "resolved",
        "renormalization",
        "group",
        "technique",
        "presuppose",
        "qft",
        "fail",
        "short",
        "length",
        "scale",
        "empirical",
        "content",
        "lqft",
        "largely",
        "insensitive",
        "detail",
        "short",
        "length",
        "scale",
        "doreen",
        "fraser",
        "argues",
        "renormalization",
        "group",
        "method",
        "help",
        "articulate",
        "empirical",
        "content",
        "qft",
        "renormalization",
        "group",
        "significance",
        "theoretical",
        "content",
        "qft",
        "insofar",
        "tell",
        "u",
        "whether",
        "focus",
        "lqft",
        "aqft",
        "james",
        "fraser",
        "hancoxli",
        "b",
        "argue",
        "renormalization",
        "group",
        "provide",
        "empirical",
        "prediction",
        "qft",
        "renormalization",
        "group",
        "give",
        "u",
        "method",
        "studying",
        "behavior",
        "physical",
        "system",
        "different",
        "energy",
        "scale",
        "namely",
        "property",
        "qft",
        "model",
        "depend",
        "depend",
        "small",
        "scale",
        "structure",
        "renormalization",
        "group",
        "provides",
        "nonperturbative",
        "explanation",
        "success",
        "perturbative",
        "qft",
        "hancoxli",
        "b",
        "discus",
        "mathematician",
        "working",
        "constructive",
        "qft",
        "use",
        "nonperturbative",
        "approximation",
        "well",
        "controlled",
        "error",
        "bound",
        "prove",
        "existence",
        "nonexistence",
        "ultraviolet",
        "fixed",
        "point",
        "hancoxli",
        "argues",
        "renormalization",
        "group",
        "explains",
        "perturbative",
        "renormalization",
        "nonperturbatively",
        "renormalization",
        "group",
        "tell",
        "u",
        "whether",
        "certain",
        "lagrangians",
        "ultraviolet",
        "limit",
        "satisfies",
        "axiom",
        "qft",
        "satisfy",
        "thus",
        "use",
        "renormalization",
        "group",
        "constructive",
        "qft",
        "provide",
        "additional",
        "dynamical",
        "information",
        "eg",
        "whether",
        "certain",
        "dynamic",
        "occur",
        "continuous",
        "spacetime",
        "pure",
        "axiomatic",
        "approach"
    ]
}