{
    "main_text": "Von Neumann and the Foundations of Quantum Theory || Rings of Operators, Quantum Logics, and Continuous Geometries\n2.2 Rings of Operators, Quantum Logics, and Continuous Geometries\n\nIn a letter to Birkhoff from 1935, von Neumann says: “I would\nlike to make a confession which may seem immoral: I do not believe in\nHilbert space anymore”; the letter is published in von Neumann\n(2005). The confession is indeed startling since it comes from the\nchampion of the separable Hilbert space formulation of quantum\nmechanics and it is issued just three years after the publication of\nhis famous treatise, the definitive work on the subject. The irony is\ncompounded by the fact that less than two years after his confession\nto Birkhoff, his mathematical theorizing about the abstract\nmathematical structure that was to supersede the separable Hilbert\nspace, continuous geometries with a transition probability, turned out\nnot to provide a generalization of the separable Hilbert space\nframework. It is compounded again with interest in that subsequent\ndevelopments in mathematical physics initiated and developed by von\nNeumann ultimately served to strengthen the entrenchment of the\nseparable Hilbert space framework in mathematical physics (especially\nwith regards to quantum theory). These matters are explained in more\ndetail in Section 4.1.\n\nThree theoretical developments come together for von Neumann in his\ntheory of continuous geometries during the seven years following 1932:\nthe algebraic approach to quantum mechanics, quantum logics, and rings\nof operators. By 1934, von Neumann had already made substantial moves\ntowards an algebraic approach to quantum mechanics with the help of\nJordan and Wigner – their article, “On an Algebraic\nGeneralization of the Quantum Mechanical Formalism”,  is\nreprinted in von Neumann (1961–1963, Vol. II, No. 21). In 1936,\nhe published a second paper on this topic, “On an Algebraic\nGeneralization of the  Quantum Mechanical Formalism (Part\nI)”, which is reprinted in von Neumann (1961–1963, Vol.\nIII, No. 9). Neither work was particularly influential, as it turns\nout. A related paper by von Neumann and Birkhoff, “The Logic of\nQuantum Mechanics”, was also published in 1936, and it is\nreprinted in von Neumann (1961–1963, Vol. IV, No. 7). It was\nseminal to the development of a sizeable body of literature on\n quantum logics.\n It should be noted, however, that this happens only after modularity,\na key postulate for von Neumann, is replaced with orthomodularity (a\nweaker condition). The nature of the shift is clearly explained in\nHolland (1970): modularity is in effect a weakening of the\ndistributive laws (limiting their validity to certain selected triples\nof lattice elements), and orthomodularity is a weakening of modularity\n(limiting the validity of the distributive laws to an even smaller set\nof triples of lattice elements). The shift from modularity to\northomodularity was first made in (Loomis 1955). Rapid growth of\nliterature on orthomodular lattices and the foundations of quantum\nmechanics soon followed. For example, see Pavičić (1992) for\na fairly exhaustive bibliography of quantum logic up to 1990, which\nhas over 1800 entries.\n\nOf substantially greater note for the foundations of quantum theory\nare six papers by von Neumann (three jointly published with Murray) on\nrings of operators, which are reprinted in von Neumann\n(1961–1963, Vol. III, Nos 2–7). The first two, “On\nRings of Operators” and a sequel “On Rings of Operators\nII”, were published in 1936 and 1937, and they were seminal to\nthe development of the other four. The third, “On Rings of\nOperators: Reduction Theory”, was written during 1937–1938\nbut not published until 1949. The fourth, “On Infinite Direct\nProducts”, was published in 1938. The remaining two, “On\nRings of Operators III” and “On Rings of Operators\nIV” were published in 1941 and 1943, respectively. This massive\nwork on rings of operators was very influential and continues to have\nan impact in pure mathematics, mathematical physics, and the\nfoundations of physics. Rings of operators are now referred to as\n“von Neumann algebras” following Dixmier (1981), who first\nreferred to them by this name (stating that he did so following a\nsuggestion made to him by Dieudonné) in the introduction to his\n1957 treatise on operator algebras (Dixmier 1981).\n\nA von Neumann algebra is a \\(*\\)-subalgebra of the set\nof bounded operators B(H) on a Hilbert space H that is closed in the\nweak operator topology. It is usually assumed that the von Neumann\nalgebra contains the identity operator. A \\(*\\)-subalgebra\ncontains the adjoint of every operator in\nthe algebra, where the “\\(*\\)” denotes the\nadjoint. There are special types of von Neumann algebras that are\ncalled “factors”. A von Neumann algebra is a factor, if\nits center (which is the set of elements that commute with all\nelements of the algebra) is trivial, meaning that it only contains\nscalar multiples of the identity element. Moreover, von Neumann showed\nin his reduction-theory paper that all von Neumann algebras that are\nnot factors can be decomposed as a direct sum (or integral) of\nfactors. There are three mutually exclusive and exhaustive factor\ntypes: type-I, type-II, and type-III. Each type has been classified\ninto (mutually exclusive and exhaustive) sub-types: types I\\(_n\\) \\((n\n= 1,2,\\ldots ,\\infty),\\) II\\(_n\\) \\((n = 1,\\infty),\\) III\\(_z\\)\n\\((0\\le z\\le 1).\\) As mentioned above, type-I\\(_n\\) correspond to\nfinite dimensional Hilbert spaces, while type-I\\(_{\\infty}\\)\ncorresponds to the infinite dimensional separable Hilbert space that\nprovides the rigorous framework for wave and matrix mechanics. Von\nNeumann and Murray distinguished the subtypes for type-I and type-II,\nbut were not able to do so for the type-III factors. Subtypes were not\ndistinguished for these factors until the 1960s and 1970s – see\nChapter 3 of Sunder (1987) or Chapter 5 of Connes (1994) for\ndetails.\n\nAs a result of his earlier work on the foundations of quantum\nmechanics and his work on quantum logic with Birkhoff, von Neumann\ncame to regard the type-II\\(_1\\) factors as likely to be the most\nrelevant for physics. This is a substantial shift since the most\nimportant class of algebra of observables for quantum mechanics was\nthought at the time to be the set of bounded operators on an\ninfinite-dimensional separable Hilbert space, which is a\ntype-I\\(_{\\infty}\\) factor. A brief explanation for this shift is\nprovided below. See the well-informed and lucid account presented in\n(Rédei 1998) for a much fuller discussion of von\nNeumann’s views on fundamental connections between quantum\nlogic, rings of operators (particularly type-II\\(_1\\) factors),\nfoundations of probability theory, and quantum physics. It is worth\nnoting that von Neumann regarded the type-III factors as a catch-all\nclass for the “pathological” operator algebras; indeed, it\ntook several years after the classificatory scheme was introduced to\ndemonstrate the existence of such factors. It is ironic that the\npredominant view now seems to be that the type-III factors are the\nmost relevant class for physics (particularly for QFT and quantum\nstatistical mechanics). This point is elaborated further in Section\n4.1 after explaining below why von Neumann’s program never came\nto fruition.\n\nIn the introduction to the first paper in the series of four entitled\n“On Rings of Operators”, Murray and von Neumann list two\nreasons why they are dissatisfied with the separable Hilbert space\nformulation of quantum mechanics. One has to do with a property of the\ntrace operation, which is the operation appearing in the definition of\nthe probabilities for measurement results (the Born rule), and the\nother with domain problems that arise for unbounded observable\noperators. The trace of the identity is infinite when the separable\nHilbert space is infinite-dimensional, which means that it is not\npossible to define a correctly normalized a priori\nprobability for the outcome of an experiment (i.e., a measurement of\nan observable). By definition, the a priori probability for\nan experiment is that in which any two distinct outcomes are equally\nlikely. Thus, the probability must be zero for each distinct outcome\nwhen there is an infinite number of such outcomes, which can occur if\nand only if the space is infinite dimensional. It is not clear why von\nNeumann believed that it is necessary to have an a priori\nprobability for every experiment, especially since von Mises clearly\nbelieved that a priori probabilities (“uniform\ndistributions” in his terminology) do not always exist (von\nMises 1981, pp. 68 ff.) and von Neumann was influenced substantially\nby von Mises on the foundations of probability (von Neumann 1955, p.\n198 fn.). Later, von Neumann changed the basis for his expressed\nreason for dissatisfaction with infinite dimensional Hilbert spaces\nfrom probabilistic to algebraic considerations (Birkhoff and von\nNeumann 1936, p. 118); namely, that it violates Hankel’s\nprinciple of the preservation of formal law, which leads one to try to\npreserve modularity – a condition that holds in\nfinite-dimensional Hilbert spaces but not in infinite-dimensional\nHilbert spaces. The problem with unbounded operators arises from their\nonly being defined on a merely dense subset of the set elements of the\nspace. This means that algebraic operations of unbounded operators\n(sums and products) cannot be generally defined; for example, it is\npossible that two unbounded operators \\(A\\), \\(B\\)\nare such that the range of \\(B\\) and\nthe domain of \\(A\\) are disjoint, in which case the\nproduct \\(AB\\) is meaningless.\n\nThe problems mentioned above do not arise for type-I\\(_n\\) factors, if\n\\(n\\lt \\infty\\), nor do they arise for type-II\\(_1\\). That is to say,\nthese factor types have a finite trace operation and are not plagued\nwith the domain problems of unbounded operators. Particularly\nnoteworthy is that the lattice of projections of each of these factor\ntypes (type-I\\(_n\\) for \\(n\\lt \\infty\\) and type-II\\(_1)\\) is modular.\nBy contrast, the set of bounded operators on an infinite-dimensional\nseparable Hilbert space, a type-I\\(_{\\infty}\\) factor, is not modular;\nrather, it is only orthomodular. These considerations serve to explain\nwhy von Neumann regarded the type-II\\(_1\\) factor as the proper\ngeneralization of the type-I\\(_n\\) \\((n\\lt \\infty)\\) for quantum\nphysics rather than the type-I\\(_{\\infty}\\) factors. The shift in the\nliterature from modular to orthomodular lattices that was\ncharacterized above is in effect a shift back to von Neumann’s\nearlier position (prior to his confession). But, as was already\nmentioned, it now seems that this was not the best move either.\n\nIt was von Neumann’s hope that his program for generalizing\nquantum theory would emerge from a new mathematical structure known as\n“continuous geometry”. He wanted to use this structure to\nbring together the three key elements that were mentioned above: the\nalgebraic approach to quantum mechanics, quantum logics, and rings of\noperators. He sought to forge a strong conceptual link between these\nelements and thereby provide a proper foundation for generalizing\nquantum mechanics that does not make essential use of Hilbert space\n(unlike rings of operators). Unfortunately, it turns out that the\nclass of continuous geometries is too broad for the purposes of\naxiomatizing quantum mechanics. The class must be suitably restricted\nto those having a transition probability. It turns out that there is\nthen no substantial generalization beyond the separable Hilbert space\nframework. An unpublished manuscript that was finished by von Neumann\nin 1937 was prepared and edited by Israel Halperin, and then published\nas von Neumann (1981). A review of the manuscript by Halperin was\npublished in von Neumann (1961–1963, Vol. IV, No. 16) years\nbefore the manuscript itself was published. In that review, Halperin\nnotes the following:\n\nThe final result, after 200 pages of deep reasoning is (essentially):\nevery such geometry with transition probability can be identified with\nthe projection geometry of a finite factor in some finite or infinite\ndimensional Hilbert space (I\\(_m\\) or II\\(_1)\\). This result indicates\nthat continuous geometries do not provide new useful mathematical\ndescriptions of quantum mechanical phenomena beyond that already\navailable from rings of operators.\n\n\nThis unfortunate development does not, however, completely undermine\nvon Neumann’s efforts to generalize quantum mechanics. On the\ncontrary, his work on rings of operators does provide significant\nlight to the way forward. The upshot of subsequent developments is\nthat von Neumann settled on the wrong factor type for the foundations\nof physics.\n",
    "section_title": "2.2 Rings of Operators, Quantum Logics, and Continuous Geometries",
    "entry_title": "Quantum Theory and Mathematical Rigor",
    "hierarchy_title": "Quantum Theory and Mathematical Rigor || Von Neumann and the Foundations of Quantum Theory || Rings of Operators, Quantum Logics, and Continuous Geometries",
    "tokenized_text": [
        "von",
        "neumann",
        "foundation",
        "quantum",
        "theory",
        "ring",
        "operator",
        "quantum",
        "logic",
        "continuous",
        "geometry",
        "ring",
        "operator",
        "quantum",
        "logic",
        "continuous",
        "geometry",
        "letter",
        "birkhoff",
        "von",
        "neumann",
        "say",
        "would",
        "like",
        "make",
        "confession",
        "may",
        "seem",
        "immoral",
        "believe",
        "hilbert",
        "space",
        "anymore",
        "letter",
        "published",
        "von",
        "neumann",
        "confession",
        "indeed",
        "startling",
        "since",
        "come",
        "champion",
        "separable",
        "hilbert",
        "space",
        "formulation",
        "quantum",
        "mechanic",
        "issued",
        "three",
        "year",
        "publication",
        "famous",
        "treatise",
        "definitive",
        "work",
        "subject",
        "irony",
        "compounded",
        "fact",
        "le",
        "two",
        "year",
        "confession",
        "birkhoff",
        "mathematical",
        "theorizing",
        "abstract",
        "mathematical",
        "structure",
        "supersede",
        "separable",
        "hilbert",
        "space",
        "continuous",
        "geometry",
        "transition",
        "probability",
        "turned",
        "provide",
        "generalization",
        "separable",
        "hilbert",
        "space",
        "framework",
        "compounded",
        "interest",
        "subsequent",
        "development",
        "mathematical",
        "physic",
        "initiated",
        "developed",
        "von",
        "neumann",
        "ultimately",
        "served",
        "strengthen",
        "entrenchment",
        "separable",
        "hilbert",
        "space",
        "framework",
        "mathematical",
        "physic",
        "especially",
        "regard",
        "quantum",
        "theory",
        "matter",
        "explained",
        "detail",
        "section",
        "three",
        "theoretical",
        "development",
        "come",
        "together",
        "von",
        "neumann",
        "theory",
        "continuous",
        "geometry",
        "seven",
        "year",
        "following",
        "algebraic",
        "approach",
        "quantum",
        "mechanic",
        "quantum",
        "logic",
        "ring",
        "operator",
        "von",
        "neumann",
        "already",
        "made",
        "substantial",
        "move",
        "towards",
        "algebraic",
        "approach",
        "quantum",
        "mechanic",
        "help",
        "jordan",
        "wigner",
        "article",
        "algebraic",
        "generalization",
        "quantum",
        "mechanical",
        "formalism",
        "reprinted",
        "von",
        "neumann",
        "vol",
        "ii",
        "published",
        "second",
        "paper",
        "topic",
        "algebraic",
        "generalization",
        "quantum",
        "mechanical",
        "formalism",
        "part",
        "reprinted",
        "von",
        "neumann",
        "vol",
        "iii",
        "neither",
        "work",
        "particularly",
        "influential",
        "turn",
        "related",
        "paper",
        "von",
        "neumann",
        "birkhoff",
        "logic",
        "quantum",
        "mechanic",
        "also",
        "published",
        "reprinted",
        "von",
        "neumann",
        "vol",
        "iv",
        "seminal",
        "development",
        "sizeable",
        "body",
        "literature",
        "quantum",
        "logic",
        "noted",
        "however",
        "happens",
        "modularity",
        "key",
        "postulate",
        "von",
        "neumann",
        "replaced",
        "orthomodularity",
        "weaker",
        "condition",
        "nature",
        "shift",
        "clearly",
        "explained",
        "holland",
        "modularity",
        "effect",
        "weakening",
        "distributive",
        "law",
        "limiting",
        "validity",
        "certain",
        "selected",
        "triple",
        "lattice",
        "element",
        "orthomodularity",
        "weakening",
        "modularity",
        "limiting",
        "validity",
        "distributive",
        "law",
        "even",
        "smaller",
        "set",
        "triple",
        "lattice",
        "element",
        "shift",
        "modularity",
        "orthomodularity",
        "first",
        "made",
        "loomis",
        "rapid",
        "growth",
        "literature",
        "orthomodular",
        "lattice",
        "foundation",
        "quantum",
        "mechanic",
        "soon",
        "followed",
        "example",
        "see",
        "pavičić",
        "fairly",
        "exhaustive",
        "bibliography",
        "quantum",
        "logic",
        "entry",
        "substantially",
        "greater",
        "note",
        "foundation",
        "quantum",
        "theory",
        "six",
        "paper",
        "von",
        "neumann",
        "three",
        "jointly",
        "published",
        "murray",
        "ring",
        "operator",
        "reprinted",
        "von",
        "neumann",
        "vol",
        "iii",
        "no",
        "first",
        "two",
        "ring",
        "operator",
        "sequel",
        "ring",
        "operator",
        "ii",
        "published",
        "seminal",
        "development",
        "four",
        "third",
        "ring",
        "operator",
        "reduction",
        "theory",
        "written",
        "published",
        "fourth",
        "infinite",
        "direct",
        "product",
        "published",
        "remaining",
        "two",
        "ring",
        "operator",
        "iii",
        "ring",
        "operator",
        "iv",
        "published",
        "respectively",
        "massive",
        "work",
        "ring",
        "operator",
        "influential",
        "continues",
        "impact",
        "pure",
        "mathematics",
        "mathematical",
        "physic",
        "foundation",
        "physic",
        "ring",
        "operator",
        "referred",
        "von",
        "neumann",
        "algebra",
        "following",
        "dixmier",
        "first",
        "referred",
        "name",
        "stating",
        "following",
        "suggestion",
        "made",
        "dieudonné",
        "introduction",
        "treatise",
        "operator",
        "algebra",
        "dixmier",
        "von",
        "neumann",
        "algebra",
        "subalgebra",
        "set",
        "bounded",
        "operator",
        "b",
        "h",
        "hilbert",
        "space",
        "h",
        "closed",
        "weak",
        "operator",
        "topology",
        "usually",
        "assumed",
        "von",
        "neumann",
        "algebra",
        "contains",
        "identity",
        "operator",
        "subalgebra",
        "contains",
        "adjoint",
        "every",
        "operator",
        "algebra",
        "denotes",
        "adjoint",
        "special",
        "type",
        "von",
        "neumann",
        "algebra",
        "called",
        "factor",
        "von",
        "neumann",
        "algebra",
        "factor",
        "center",
        "set",
        "element",
        "commute",
        "element",
        "algebra",
        "trivial",
        "meaning",
        "contains",
        "scalar",
        "multiple",
        "identity",
        "element",
        "moreover",
        "von",
        "neumann",
        "showed",
        "reductiontheory",
        "paper",
        "von",
        "neumann",
        "algebra",
        "factor",
        "decomposed",
        "direct",
        "sum",
        "integral",
        "factor",
        "three",
        "mutually",
        "exclusive",
        "exhaustive",
        "factor",
        "type",
        "typei",
        "typeii",
        "typeiii",
        "type",
        "classified",
        "mutually",
        "exclusive",
        "exhaustive",
        "subtypes",
        "type",
        "i",
        "_n",
        "n",
        "ldots",
        "infty",
        "ii",
        "_n",
        "n",
        "infty",
        "iii",
        "_z",
        "le",
        "zle",
        "mentioned",
        "typei",
        "_n",
        "correspond",
        "finite",
        "dimensional",
        "hilbert",
        "space",
        "typei",
        "_",
        "infty",
        "corresponds",
        "infinite",
        "dimensional",
        "separable",
        "hilbert",
        "space",
        "provides",
        "rigorous",
        "framework",
        "wave",
        "matrix",
        "mechanic",
        "von",
        "neumann",
        "murray",
        "distinguished",
        "subtypes",
        "typei",
        "typeii",
        "able",
        "typeiii",
        "factor",
        "subtypes",
        "distinguished",
        "factor",
        "s",
        "s",
        "see",
        "chapter",
        "sunder",
        "chapter",
        "connes",
        "detail",
        "result",
        "earlier",
        "work",
        "foundation",
        "quantum",
        "mechanic",
        "work",
        "quantum",
        "logic",
        "birkhoff",
        "von",
        "neumann",
        "came",
        "regard",
        "typeii",
        "_",
        "factor",
        "likely",
        "relevant",
        "physic",
        "substantial",
        "shift",
        "since",
        "important",
        "class",
        "algebra",
        "observables",
        "quantum",
        "mechanic",
        "thought",
        "time",
        "set",
        "bounded",
        "operator",
        "infinitedimensional",
        "separable",
        "hilbert",
        "space",
        "typei",
        "_",
        "infty",
        "factor",
        "brief",
        "explanation",
        "shift",
        "provided",
        "see",
        "wellinformed",
        "lucid",
        "account",
        "presented",
        "rédei",
        "much",
        "fuller",
        "discussion",
        "von",
        "neumann",
        "view",
        "fundamental",
        "connection",
        "quantum",
        "logic",
        "ring",
        "operator",
        "particularly",
        "typeii",
        "_",
        "factor",
        "foundation",
        "probability",
        "theory",
        "quantum",
        "physic",
        "worth",
        "noting",
        "von",
        "neumann",
        "regarded",
        "typeiii",
        "factor",
        "catchall",
        "class",
        "pathological",
        "operator",
        "algebra",
        "indeed",
        "took",
        "several",
        "year",
        "classificatory",
        "scheme",
        "introduced",
        "demonstrate",
        "existence",
        "factor",
        "ironic",
        "predominant",
        "view",
        "seems",
        "typeiii",
        "factor",
        "relevant",
        "class",
        "physic",
        "particularly",
        "qft",
        "quantum",
        "statistical",
        "mechanic",
        "point",
        "elaborated",
        "section",
        "explaining",
        "von",
        "neumann",
        "program",
        "never",
        "came",
        "fruition",
        "introduction",
        "first",
        "paper",
        "series",
        "four",
        "entitled",
        "ring",
        "operator",
        "murray",
        "von",
        "neumann",
        "list",
        "two",
        "reason",
        "dissatisfied",
        "separable",
        "hilbert",
        "space",
        "formulation",
        "quantum",
        "mechanic",
        "one",
        "property",
        "trace",
        "operation",
        "operation",
        "appearing",
        "definition",
        "probability",
        "measurement",
        "result",
        "born",
        "rule",
        "domain",
        "problem",
        "arise",
        "unbounded",
        "observable",
        "operator",
        "trace",
        "identity",
        "infinite",
        "separable",
        "hilbert",
        "space",
        "infinitedimensional",
        "mean",
        "possible",
        "define",
        "correctly",
        "normalized",
        "priori",
        "probability",
        "outcome",
        "experiment",
        "ie",
        "measurement",
        "observable",
        "definition",
        "priori",
        "probability",
        "experiment",
        "two",
        "distinct",
        "outcome",
        "equally",
        "likely",
        "thus",
        "probability",
        "must",
        "zero",
        "distinct",
        "outcome",
        "infinite",
        "number",
        "outcome",
        "occur",
        "space",
        "infinite",
        "dimensional",
        "clear",
        "von",
        "neumann",
        "believed",
        "necessary",
        "priori",
        "probability",
        "every",
        "experiment",
        "especially",
        "since",
        "von",
        "mi",
        "clearly",
        "believed",
        "priori",
        "probability",
        "uniform",
        "distribution",
        "terminology",
        "always",
        "exist",
        "von",
        "mi",
        "pp",
        "ff",
        "von",
        "neumann",
        "influenced",
        "substantially",
        "von",
        "mi",
        "foundation",
        "probability",
        "von",
        "neumann",
        "p",
        "fn",
        "later",
        "von",
        "neumann",
        "changed",
        "basis",
        "expressed",
        "reason",
        "dissatisfaction",
        "infinite",
        "dimensional",
        "hilbert",
        "space",
        "probabilistic",
        "algebraic",
        "consideration",
        "birkhoff",
        "von",
        "neumann",
        "p",
        "namely",
        "violates",
        "hankel",
        "principle",
        "preservation",
        "formal",
        "law",
        "lead",
        "one",
        "try",
        "preserve",
        "modularity",
        "condition",
        "hold",
        "finitedimensional",
        "hilbert",
        "space",
        "infinitedimensional",
        "hilbert",
        "space",
        "problem",
        "unbounded",
        "operator",
        "arises",
        "defined",
        "merely",
        "dense",
        "subset",
        "set",
        "element",
        "space",
        "mean",
        "algebraic",
        "operation",
        "unbounded",
        "operator",
        "sum",
        "product",
        "generally",
        "defined",
        "example",
        "possible",
        "two",
        "unbounded",
        "operator",
        "a",
        "b",
        "range",
        "b",
        "domain",
        "a",
        "disjoint",
        "case",
        "product",
        "ab",
        "meaningless",
        "problem",
        "mentioned",
        "arise",
        "typei",
        "_n",
        "factor",
        "nlt",
        "infty",
        "arise",
        "typeii",
        "_",
        "say",
        "factor",
        "type",
        "finite",
        "trace",
        "operation",
        "plagued",
        "domain",
        "problem",
        "unbounded",
        "operator",
        "particularly",
        "noteworthy",
        "lattice",
        "projection",
        "factor",
        "type",
        "typei",
        "_n",
        "nlt",
        "infty",
        "typeii",
        "_",
        "modular",
        "contrast",
        "set",
        "bounded",
        "operator",
        "infinitedimensional",
        "separable",
        "hilbert",
        "space",
        "typei",
        "_",
        "infty",
        "factor",
        "modular",
        "rather",
        "orthomodular",
        "consideration",
        "serve",
        "explain",
        "von",
        "neumann",
        "regarded",
        "typeii",
        "_",
        "factor",
        "proper",
        "generalization",
        "typei",
        "_n",
        "nlt",
        "infty",
        "quantum",
        "physic",
        "rather",
        "typei",
        "_",
        "infty",
        "factor",
        "shift",
        "literature",
        "modular",
        "orthomodular",
        "lattice",
        "characterized",
        "effect",
        "shift",
        "back",
        "von",
        "neumann",
        "earlier",
        "position",
        "prior",
        "confession",
        "already",
        "mentioned",
        "seems",
        "best",
        "move",
        "either",
        "von",
        "neumann",
        "hope",
        "program",
        "generalizing",
        "quantum",
        "theory",
        "would",
        "emerge",
        "new",
        "mathematical",
        "structure",
        "known",
        "continuous",
        "geometry",
        "wanted",
        "use",
        "structure",
        "bring",
        "together",
        "three",
        "key",
        "element",
        "mentioned",
        "algebraic",
        "approach",
        "quantum",
        "mechanic",
        "quantum",
        "logic",
        "ring",
        "operator",
        "sought",
        "forge",
        "strong",
        "conceptual",
        "link",
        "element",
        "thereby",
        "provide",
        "proper",
        "foundation",
        "generalizing",
        "quantum",
        "mechanic",
        "make",
        "essential",
        "use",
        "hilbert",
        "space",
        "unlike",
        "ring",
        "operator",
        "unfortunately",
        "turn",
        "class",
        "continuous",
        "geometry",
        "broad",
        "purpose",
        "axiomatizing",
        "quantum",
        "mechanic",
        "class",
        "must",
        "suitably",
        "restricted",
        "transition",
        "probability",
        "turn",
        "substantial",
        "generalization",
        "beyond",
        "separable",
        "hilbert",
        "space",
        "framework",
        "unpublished",
        "manuscript",
        "finished",
        "von",
        "neumann",
        "prepared",
        "edited",
        "israel",
        "halperin",
        "published",
        "von",
        "neumann",
        "review",
        "manuscript",
        "halperin",
        "published",
        "von",
        "neumann",
        "vol",
        "iv",
        "year",
        "manuscript",
        "published",
        "review",
        "halperin",
        "note",
        "following",
        "final",
        "result",
        "page",
        "deep",
        "reasoning",
        "essentially",
        "every",
        "geometry",
        "transition",
        "probability",
        "identified",
        "projection",
        "geometry",
        "finite",
        "factor",
        "finite",
        "infinite",
        "dimensional",
        "hilbert",
        "space",
        "i",
        "_m",
        "ii",
        "_",
        "result",
        "indicates",
        "continuous",
        "geometry",
        "provide",
        "new",
        "useful",
        "mathematical",
        "description",
        "quantum",
        "mechanical",
        "phenomenon",
        "beyond",
        "already",
        "available",
        "ring",
        "operator",
        "unfortunate",
        "development",
        "however",
        "completely",
        "undermine",
        "von",
        "neumann",
        "effort",
        "generalize",
        "quantum",
        "mechanic",
        "contrary",
        "work",
        "ring",
        "operator",
        "provide",
        "significant",
        "light",
        "way",
        "forward",
        "upshot",
        "subsequent",
        "development",
        "von",
        "neumann",
        "settled",
        "wrong",
        "factor",
        "type",
        "foundation",
        "physic"
    ]
}