{
    "main_text": "Are Qualia Irreducible, Non-Physical Entities?\n3. Are Qualia Irreducible, Non-Physical Entities?\n\nThe literature on qualia is filled with thought-experiments of one\nsort or another. Perhaps the most famous of these is the case of Mary,\nthe brilliant color scientist. Mary, so the story goes (Jackson 1982),\nis imprisoned in a black and white room. Never having been permitted\nto leave it, she acquires information about the world outside from the\nblack and white books her captors have made available to her, from the\nblack and white television sets attached to external cameras, and from\nthe black and white monitor screens hooked up to banks of computers.\nAs time passes, Mary acquires more and more information about the\nphysical aspects of color and color vision. (For a real life case of a\nvisual scientist (Knut Nordby) who is an achromotope, see Sacks 1996,\nChapter 1.) Eventually, Mary becomes the world’s leading\nauthority on these matters. Indeed she comes to know all the\nphysical facts pertinent to everyday colors and color vision. \n\nStill, she wonders to herself: What do people in the outside world\nexperience when they see the various colors? What is it\nlike for them to see red or green? One day her captors\nrelease her. She is free at last to see things with their real colors\n(and free too to scrub off the awful black and white paint that covers\nher body). She steps outside her room into a garden full of flowers.\n“So, that is what it is like to experience red,” she\nexclaims, as she sees a red rose. “And that,” she adds,\nlooking down at the grass, “is what it is like to experience\ngreen.”\n\nMary here seems to make some important discoveries. She seems to find\nout things she did not know before. How can that be, if, as seems\npossible, at least in principle, she has all the physical information\nthere is to have about color and color vision — if she knows all\nthe pertinent physical facts?\n\nOne possible explanation is that that there is a realm of subjective,\nphenomenal qualities associated with color, qualities the intrinsic\nnature of which Mary comes to discover upon her release, as she\nherself undergoes the various new color experiences. Before she left\nher room, she only knew the objective, physical basis of those\nsubjective qualities, their causes and effects, and various relations\nof similarity and difference. She had no knowledge of the subjective\nqualities in themselves.\n\nThis explanation is not available to the physicalist. If what it is\nlike for someone to experience red is one and the same as some\nphysical quality, then Mary already knows that while in her\nroom. Likewise, for experiences of the other colors. For Mary knows\nall the pertinent physical facts. What, then, can the physicalist\nsay?\n\nSome physicalists respond that knowing what it is like is know-how and\nnothing more. Mary acquires certain abilities, specifically in the\ncase of red, the ability to recognize red things by sight alone, the\nability to imagine a red expanse, the ability to remember the\nexperience of red. She does not come to know any new\ninformation, any new facts about color, any new qualities. This is the\nview of David Lewis (1990) and Lawrence Nemirow (1990).\n\nThe Ability Hypothesis, as it is often called, is more resilient than\nmany philosophers suppose (see Tye 2000, Chapter One). But it has\ndifficulty in properly accounting for our knowledge of what it is like\nto undergo experiences of determinate hues while we are undergoing\nthem. For example, I can know what it is like to experience red-17, as\nI stare at a rose of that color. Of course, I don’t know the hue\nas red-17. My conception of it is likely just that shade of\nred. But I certainly know what it is like to experience the hue\nwhile it is present. Unfortunately, I lack the abilities Lewis cites\nand so does Mary even after she leaves her cell. She is not able to\nrecognize things that are red-17 as red-17 by sight. Given the way\nhuman memory works and the limitations on it, she lacks the concept\nred-17. She has no mental template that is sufficiently fine-grained\nto permit her to identify the experience of red-17 when it comes\nagain. Presented with two items, one red-17 and the other red-18, in a\nseries of tests, she cannot say with any accuracy which experience her\nearlier experience of the rose matches. Sometimes she picks one; at\nother times she picks the other. Nor is she able afterwards to imagine\nthings as having hue, red-17, or as having that very shade of red the\nrose had; and for precisely the same reason.\n\nThe Ability Hypothesis appears to be in trouble. An alternative\nphysicalist proposal is that Mary in her room lacks certain\nphenomenal concepts, certain ways of thinking about or\nmentally representing color experiences and colors. Once she leaves\nthe room, she acquires these new modes of thought as she experiences\nthe various colors. Even so, the qualities the new concepts pick out\nare ones she knew in a different way in her room, for they are\nphysical or functional qualities like all others.\n\nOne problem this approach faces is that it seems to imply that Mary\ndoes not really make a new discovery when she says, “So, that is\nwhat it is like to experience red.” Upon reflection, however, it\nis far from obvious that this is really a consequence. For it is\nwidely accepted that concepts or modes of presentation are involved in\nthe individuation of thought-contents, given one sense of the term\n‘content’ — the sense in which thought-content is\nwhatever information that-clauses provide that suffices for the\npurposes of even the most demanding rationalizing explanation. In this\nsense, what I think, when I think that Cicero was an orator, is not\nwhat I think when I think that Tully was an orator. This is precisely\nwhy it is possible to discover that Cicero is Tully. The thought that\nCicero was an orator differs from the thought that Tully was an orator\nnot at the level of truth-conditions — the same singular\nproposition is partly constitutive of the content of both — but\nat the level of concepts or mode of presentation. The one thought\nexercises the concept Cicero; the other the concept\nTully. The concepts have the same reference, but they present\nthe referent in different ways and thus the two thoughts can play\ndifferent roles in rationalizing explanation.\n\nIt appears then that there is no difficulty in holding both that Mary\ncomes to know some new things upon her release, while already knowing\nall the pertinent real-world physical facts, even though the new\nexperiences she undergoes and their introspectible qualities are\nwholly physical. In an ordinary, everyday sense, Mary’s\nknowledge increases. And that, it may be contended, is all the\nphysicalist needs to answer the Knowledge Argument. (The term\n‘fact’, it should be mentioned, is itself ambiguous.\nSometimes it is used to pick out real-world states of affairs alone;\nsometimes it is used for such states of affairs under certain\nconceptualizations. When we speak of the physical facts above, we\nshould be taken to refer either to physical states of affairs alone or\nto those states of affairs under purely physical conceptualizations.\nFor more on ‘fact’, see Tye 1995.)\n\nSome philosophers insist that the difference between the old and the\nnew concepts in this case is such that there must be a difference in\nthe world between the properties these concepts stand for or denote\n(Jackson 1993, Chalmers 1996). Some of these properties Mary knew in\nher cell; others she becomes cognizant of only upon her release. This\nis necessary for Mary to make a real discovery: she must come to\nassociate with the experience of red new qualities she did not\nassociate with it in her room. The physicalist is committed to denying\nthis claim; for the new qualities would have to be non-physical.\n\nThe issues here are complex. What the physicalist really needs to\nsettle the issue is a theory of phenomenal concepts (a theory, that\nis, of the allegedly special concepts that are deployed from the first\nperson point of view when we recognize our experiences as being of\nsuch-and-such subjective types) which is itself compatible with\nphysicalism. There are proposals on offer (see, for example, Hill\n1991, Loar 1990, Levine 2000, Sturgeon 2000, Perry 2001, Papineau\n2002, Tye, 2003), but there is as yet no agreement as to the form such\na theory should take, and some philosophers contend that a proper\ntheory of phenomenal concepts shows that no satisfactory answer can be\ngiven by the physicalist to the example of Mary’s Room (Chalmers\n1999). Another possibility is that the very idea of a phenomenal\nconcept, conceived of as a concept very different in how it functions\nfrom concepts applied elsewhere, is itself confused. On this view,\nphysicalists who have appealed to phenomenal concepts to handle the\nexample of Mary’s Room have been barking up the wrong tree (Tye\n2009). \n\nAnother famous anti-reductionist thought-experiment concerning qualia\nappeals to the possibility of zombies. A philosophical zombie is a\nmolecule by molecule duplicate of a sentient creature, a normal\nhuman-being, for example, but who differs from that creature in\nlacking any phenomenal consciousness. For me, as I lie on the\nbeach, happily drinking some wine and watching the waves, I undergo a\nvariety of visual, olfactory, and gustatory experiences. But my zombie\ntwin experiences nothing at all. He has no phenomenal consciousness.\nSince my twin is an exact physical duplicate of me, his inner\npsychological states will be functionally isomorphic with my\nown (assuming he is located in an identical environment). Whatever\nphysical stimulus is applied, he will process the stimulus in the same\nway as I do, and produce exactly the same behavioral responses.\nIndeed, on the assumption that non-phenomenal psychological states are\nfunctional states (that is, states definable in terms of their role or\nfunction in mediating between stimuli and behavior), my zombie twin\nhas just the same beliefs, thoughts, and desires as I do. He differs\nfrom me only with respect to experience. For him, there is nothing it\nis like to stare at the waves or to sip wine.\n\nThe hypothesis that there can be philosophical zombies is not normally\nthe hypothesis that such zombies are nomically possible, that\ntheir existence is consistent with the actual laws of nature. Rather\nthe suggestion is that zombie replicas of this sort are at least\nimaginable and hence metaphysically possible.\n\nPhilosophical zombies pose a serious threat to physicalist views of\nqualia. To begin with, if zombie replicas are metaphysically possible,\nthen there is a simple argument that seems to show that phenomenal\nstates are not identical with internal, objective, physical states.\nSuppose objective, physical state P can occur without\nphenomenal state S in some appropriate zombie replica (in the\nmetaphysical sense of ‘can’ noted above). Intuitively\nS cannot occur without S. Pain, for example, cannot\nbe felt without pain. So, P has a modal property S\nlacks, namely the property of possibly occurring without\nS. So, by Leibniz’ Law (the law that for anything\nx and for anything y, if x is identical\nwith y then x and y share all the\nsame properties), S is not identical with P.\n\nSecondly, if a person microphysically identical with me, located in an\nidentical environment (both present and past), can lack any\nphenomenal experiences, then facts pertaining to experience and\nfeeling, facts about qualia, are not necessarily fixed or determined\nby the objective microphysical facts. And this the physicalist cannot\nallow, even if she concedes that phenomenally conscious states are not\nstrictly identical with internal, objective, physical states. For the\nphysicalist, whatever her stripe, must at least believe that the\nmicrophysical facts determine all the facts, that any world that was\nexactly like ours in all microphysical respects (down to the\nsmallest detail, to the position of every single boson, for example)\nwould have to be like our world in all respects (having identical\nmountains, lakes, glaciers, trees, rocks, sentient creatures, cities,\nand so on).\n\nOne well-known physicalist reply to the case of zombies (Loar 1990) is\nto grant that they are conceptually possible, or at least that there\nis no obvious contradiction in the idea of a zombie, while\ndenying that zombies are metaphysically possible. Since the\nanti-physicalist argument requires metaphysical possibility —\nmere conceptual possibility will not suffice — it now collapses.\nThat conceptual possibility is too weak for the\nanti-physicalist’s purposes (at least without further\nqualification and argument) is shown by the fact that it is\nconceptually possible that I am not Michael Tye (that I am an impostor\nor someone misinformed about his past) even though, given the actual\nfacts, it is metaphysically impossible.\n",
    "section_title": "3. Are Qualia Irreducible, Non-Physical Entities?",
    "entry_title": "Qualia",
    "hierarchy_title": "Qualia || Are Qualia Irreducible, Non-Physical Entities?",
    "tokenized_text": [
        "qualia",
        "irreducible",
        "nonphysical",
        "entity",
        "qualia",
        "irreducible",
        "nonphysical",
        "entity",
        "literature",
        "qualia",
        "filled",
        "thoughtexperiments",
        "one",
        "sort",
        "another",
        "perhaps",
        "famous",
        "case",
        "mary",
        "brilliant",
        "color",
        "scientist",
        "mary",
        "story",
        "go",
        "jackson",
        "imprisoned",
        "black",
        "white",
        "room",
        "never",
        "permitted",
        "leave",
        "acquires",
        "information",
        "world",
        "outside",
        "black",
        "white",
        "book",
        "captor",
        "made",
        "available",
        "black",
        "white",
        "television",
        "set",
        "attached",
        "external",
        "camera",
        "black",
        "white",
        "monitor",
        "screen",
        "hooked",
        "bank",
        "computer",
        "time",
        "pass",
        "mary",
        "acquires",
        "information",
        "physical",
        "aspect",
        "color",
        "color",
        "vision",
        "real",
        "life",
        "case",
        "visual",
        "scientist",
        "knut",
        "nordby",
        "achromotope",
        "see",
        "sack",
        "chapter",
        "eventually",
        "mary",
        "becomes",
        "world",
        "leading",
        "authority",
        "matter",
        "indeed",
        "come",
        "know",
        "physical",
        "fact",
        "pertinent",
        "everyday",
        "color",
        "color",
        "vision",
        "still",
        "wonder",
        "people",
        "outside",
        "world",
        "experience",
        "see",
        "various",
        "color",
        "like",
        "see",
        "red",
        "green",
        "one",
        "day",
        "captor",
        "release",
        "free",
        "last",
        "see",
        "thing",
        "real",
        "color",
        "free",
        "scrub",
        "awful",
        "black",
        "white",
        "paint",
        "cover",
        "body",
        "step",
        "outside",
        "room",
        "garden",
        "full",
        "flower",
        "like",
        "experience",
        "red",
        "exclaims",
        "see",
        "red",
        "rose",
        "add",
        "looking",
        "grass",
        "like",
        "experience",
        "green",
        "mary",
        "seems",
        "make",
        "important",
        "discovery",
        "seems",
        "find",
        "thing",
        "know",
        "seems",
        "possible",
        "least",
        "principle",
        "physical",
        "information",
        "color",
        "color",
        "vision",
        "know",
        "pertinent",
        "physical",
        "fact",
        "one",
        "possible",
        "explanation",
        "realm",
        "subjective",
        "phenomenal",
        "quality",
        "associated",
        "color",
        "quality",
        "intrinsic",
        "nature",
        "mary",
        "come",
        "discover",
        "upon",
        "release",
        "undergoes",
        "various",
        "new",
        "color",
        "experience",
        "left",
        "room",
        "knew",
        "objective",
        "physical",
        "basis",
        "subjective",
        "quality",
        "cause",
        "effect",
        "various",
        "relation",
        "similarity",
        "difference",
        "knowledge",
        "subjective",
        "quality",
        "explanation",
        "available",
        "physicalist",
        "like",
        "someone",
        "experience",
        "red",
        "one",
        "physical",
        "quality",
        "mary",
        "already",
        "know",
        "room",
        "likewise",
        "experience",
        "color",
        "mary",
        "know",
        "pertinent",
        "physical",
        "fact",
        "physicalist",
        "say",
        "physicalists",
        "respond",
        "knowing",
        "like",
        "knowhow",
        "nothing",
        "mary",
        "acquires",
        "certain",
        "ability",
        "specifically",
        "case",
        "red",
        "ability",
        "recognize",
        "red",
        "thing",
        "sight",
        "alone",
        "ability",
        "imagine",
        "red",
        "expanse",
        "ability",
        "remember",
        "experience",
        "red",
        "come",
        "know",
        "new",
        "information",
        "new",
        "fact",
        "color",
        "new",
        "quality",
        "view",
        "david",
        "lewis",
        "lawrence",
        "nemirow",
        "ability",
        "hypothesis",
        "often",
        "called",
        "resilient",
        "many",
        "philosopher",
        "suppose",
        "see",
        "tye",
        "chapter",
        "one",
        "difficulty",
        "properly",
        "accounting",
        "knowledge",
        "like",
        "undergo",
        "experience",
        "determinate",
        "hue",
        "undergoing",
        "example",
        "know",
        "like",
        "experience",
        "red",
        "stare",
        "rose",
        "color",
        "course",
        "know",
        "hue",
        "red",
        "conception",
        "likely",
        "shade",
        "red",
        "certainly",
        "know",
        "like",
        "experience",
        "hue",
        "present",
        "unfortunately",
        "lack",
        "ability",
        "lewis",
        "cite",
        "mary",
        "even",
        "leaf",
        "cell",
        "able",
        "recognize",
        "thing",
        "red",
        "red",
        "sight",
        "given",
        "way",
        "human",
        "memory",
        "work",
        "limitation",
        "lack",
        "concept",
        "red",
        "mental",
        "template",
        "sufficiently",
        "finegrained",
        "permit",
        "identify",
        "experience",
        "red",
        "come",
        "presented",
        "two",
        "item",
        "one",
        "red",
        "red",
        "series",
        "test",
        "say",
        "accuracy",
        "experience",
        "earlier",
        "experience",
        "rose",
        "match",
        "sometimes",
        "pick",
        "one",
        "time",
        "pick",
        "able",
        "afterwards",
        "imagine",
        "thing",
        "hue",
        "red",
        "shade",
        "red",
        "rose",
        "precisely",
        "reason",
        "ability",
        "hypothesis",
        "appears",
        "trouble",
        "alternative",
        "physicalist",
        "proposal",
        "mary",
        "room",
        "lack",
        "certain",
        "phenomenal",
        "concept",
        "certain",
        "way",
        "thinking",
        "mentally",
        "representing",
        "color",
        "experience",
        "color",
        "leaf",
        "room",
        "acquires",
        "new",
        "mode",
        "thought",
        "experience",
        "various",
        "color",
        "even",
        "quality",
        "new",
        "concept",
        "pick",
        "one",
        "knew",
        "different",
        "way",
        "room",
        "physical",
        "functional",
        "quality",
        "like",
        "others",
        "one",
        "problem",
        "approach",
        "face",
        "seems",
        "imply",
        "mary",
        "really",
        "make",
        "new",
        "discovery",
        "say",
        "like",
        "experience",
        "red",
        "upon",
        "reflection",
        "however",
        "far",
        "obvious",
        "really",
        "consequence",
        "widely",
        "accepted",
        "concept",
        "mode",
        "presentation",
        "involved",
        "individuation",
        "thoughtcontents",
        "given",
        "one",
        "sense",
        "term",
        "content",
        "sense",
        "thoughtcontent",
        "whatever",
        "information",
        "thatclauses",
        "provide",
        "suffices",
        "purpose",
        "even",
        "demanding",
        "rationalizing",
        "explanation",
        "sense",
        "think",
        "think",
        "cicero",
        "orator",
        "think",
        "think",
        "tully",
        "orator",
        "precisely",
        "possible",
        "discover",
        "cicero",
        "tully",
        "thought",
        "cicero",
        "orator",
        "differs",
        "thought",
        "tully",
        "orator",
        "level",
        "truthconditions",
        "singular",
        "proposition",
        "partly",
        "constitutive",
        "content",
        "level",
        "concept",
        "mode",
        "presentation",
        "one",
        "thought",
        "exercise",
        "concept",
        "cicero",
        "concept",
        "tully",
        "concept",
        "reference",
        "present",
        "referent",
        "different",
        "way",
        "thus",
        "two",
        "thought",
        "play",
        "different",
        "role",
        "rationalizing",
        "explanation",
        "appears",
        "difficulty",
        "holding",
        "mary",
        "come",
        "know",
        "new",
        "thing",
        "upon",
        "release",
        "already",
        "knowing",
        "pertinent",
        "realworld",
        "physical",
        "fact",
        "even",
        "though",
        "new",
        "experience",
        "undergoes",
        "introspectible",
        "quality",
        "wholly",
        "physical",
        "ordinary",
        "everyday",
        "sense",
        "mary",
        "knowledge",
        "increase",
        "may",
        "contended",
        "physicalist",
        "need",
        "answer",
        "knowledge",
        "argument",
        "term",
        "fact",
        "mentioned",
        "ambiguous",
        "sometimes",
        "used",
        "pick",
        "realworld",
        "state",
        "affair",
        "alone",
        "sometimes",
        "used",
        "state",
        "affair",
        "certain",
        "conceptualization",
        "speak",
        "physical",
        "fact",
        "taken",
        "refer",
        "either",
        "physical",
        "state",
        "affair",
        "alone",
        "state",
        "affair",
        "purely",
        "physical",
        "conceptualization",
        "fact",
        "see",
        "tye",
        "philosopher",
        "insist",
        "difference",
        "old",
        "new",
        "concept",
        "case",
        "must",
        "difference",
        "world",
        "property",
        "concept",
        "stand",
        "denote",
        "jackson",
        "chalmers",
        "property",
        "mary",
        "knew",
        "cell",
        "others",
        "becomes",
        "cognizant",
        "upon",
        "release",
        "necessary",
        "mary",
        "make",
        "real",
        "discovery",
        "must",
        "come",
        "associate",
        "experience",
        "red",
        "new",
        "quality",
        "associate",
        "room",
        "physicalist",
        "committed",
        "denying",
        "claim",
        "new",
        "quality",
        "would",
        "nonphysical",
        "issue",
        "complex",
        "physicalist",
        "really",
        "need",
        "settle",
        "issue",
        "theory",
        "phenomenal",
        "concept",
        "theory",
        "allegedly",
        "special",
        "concept",
        "deployed",
        "first",
        "person",
        "point",
        "view",
        "recognize",
        "experience",
        "suchandsuch",
        "subjective",
        "type",
        "compatible",
        "physicalism",
        "proposal",
        "offer",
        "see",
        "example",
        "hill",
        "loar",
        "levine",
        "sturgeon",
        "perry",
        "papineau",
        "tye",
        "yet",
        "agreement",
        "form",
        "theory",
        "take",
        "philosopher",
        "contend",
        "proper",
        "theory",
        "phenomenal",
        "concept",
        "show",
        "satisfactory",
        "answer",
        "given",
        "physicalist",
        "example",
        "mary",
        "room",
        "chalmers",
        "another",
        "possibility",
        "idea",
        "phenomenal",
        "concept",
        "conceived",
        "concept",
        "different",
        "function",
        "concept",
        "applied",
        "elsewhere",
        "confused",
        "view",
        "physicalists",
        "appealed",
        "phenomenal",
        "concept",
        "handle",
        "example",
        "mary",
        "room",
        "barking",
        "wrong",
        "tree",
        "tye",
        "another",
        "famous",
        "antireductionist",
        "thoughtexperiment",
        "concerning",
        "qualia",
        "appeal",
        "possibility",
        "zombie",
        "philosophical",
        "zombie",
        "molecule",
        "molecule",
        "duplicate",
        "sentient",
        "creature",
        "normal",
        "humanbeing",
        "example",
        "differs",
        "creature",
        "lacking",
        "phenomenal",
        "consciousness",
        "lie",
        "beach",
        "happily",
        "drinking",
        "wine",
        "watching",
        "wave",
        "undergo",
        "variety",
        "visual",
        "olfactory",
        "gustatory",
        "experience",
        "zombie",
        "twin",
        "experience",
        "nothing",
        "phenomenal",
        "consciousness",
        "since",
        "twin",
        "exact",
        "physical",
        "duplicate",
        "inner",
        "psychological",
        "state",
        "functionally",
        "isomorphic",
        "assuming",
        "located",
        "identical",
        "environment",
        "whatever",
        "physical",
        "stimulus",
        "applied",
        "process",
        "stimulus",
        "way",
        "produce",
        "exactly",
        "behavioral",
        "response",
        "indeed",
        "assumption",
        "nonphenomenal",
        "psychological",
        "state",
        "functional",
        "state",
        "state",
        "definable",
        "term",
        "role",
        "function",
        "mediating",
        "stimulus",
        "behavior",
        "zombie",
        "twin",
        "belief",
        "thought",
        "desire",
        "differs",
        "respect",
        "experience",
        "nothing",
        "like",
        "stare",
        "wave",
        "sip",
        "wine",
        "hypothesis",
        "philosophical",
        "zombie",
        "normally",
        "hypothesis",
        "zombie",
        "nomically",
        "possible",
        "existence",
        "consistent",
        "actual",
        "law",
        "nature",
        "rather",
        "suggestion",
        "zombie",
        "replica",
        "sort",
        "least",
        "imaginable",
        "hence",
        "metaphysically",
        "possible",
        "philosophical",
        "zombie",
        "pose",
        "serious",
        "threat",
        "physicalist",
        "view",
        "qualia",
        "begin",
        "zombie",
        "replica",
        "metaphysically",
        "possible",
        "simple",
        "argument",
        "seems",
        "show",
        "phenomenal",
        "state",
        "identical",
        "internal",
        "objective",
        "physical",
        "state",
        "suppose",
        "objective",
        "physical",
        "state",
        "p",
        "occur",
        "without",
        "phenomenal",
        "state",
        "appropriate",
        "zombie",
        "replica",
        "metaphysical",
        "sense",
        "noted",
        "intuitively",
        "occur",
        "without",
        "s",
        "pain",
        "example",
        "felt",
        "without",
        "pain",
        "p",
        "modal",
        "property",
        "lack",
        "namely",
        "property",
        "possibly",
        "occurring",
        "without",
        "s",
        "leibniz",
        "law",
        "law",
        "anything",
        "x",
        "anything",
        "x",
        "identical",
        "x",
        "share",
        "property",
        "identical",
        "p",
        "secondly",
        "person",
        "microphysically",
        "identical",
        "located",
        "identical",
        "environment",
        "present",
        "past",
        "lack",
        "phenomenal",
        "experience",
        "fact",
        "pertaining",
        "experience",
        "feeling",
        "fact",
        "qualia",
        "necessarily",
        "fixed",
        "determined",
        "objective",
        "microphysical",
        "fact",
        "physicalist",
        "allow",
        "even",
        "concedes",
        "phenomenally",
        "conscious",
        "state",
        "strictly",
        "identical",
        "internal",
        "objective",
        "physical",
        "state",
        "physicalist",
        "whatever",
        "stripe",
        "must",
        "least",
        "believe",
        "microphysical",
        "fact",
        "determine",
        "fact",
        "world",
        "exactly",
        "like",
        "microphysical",
        "respect",
        "smallest",
        "detail",
        "position",
        "every",
        "single",
        "boson",
        "example",
        "would",
        "like",
        "world",
        "respect",
        "identical",
        "mountain",
        "lake",
        "glacier",
        "tree",
        "rock",
        "sentient",
        "creature",
        "city",
        "one",
        "wellknown",
        "physicalist",
        "reply",
        "case",
        "zombie",
        "loar",
        "grant",
        "conceptually",
        "possible",
        "least",
        "obvious",
        "contradiction",
        "idea",
        "zombie",
        "denying",
        "zombie",
        "metaphysically",
        "possible",
        "since",
        "antiphysicalist",
        "argument",
        "requires",
        "metaphysical",
        "possibility",
        "mere",
        "conceptual",
        "possibility",
        "suffice",
        "collapse",
        "conceptual",
        "possibility",
        "weak",
        "antiphysicalist",
        "purpose",
        "least",
        "without",
        "qualification",
        "argument",
        "shown",
        "fact",
        "conceptually",
        "possible",
        "michael",
        "tye",
        "impostor",
        "someone",
        "misinformed",
        "past",
        "even",
        "though",
        "given",
        "actual",
        "fact",
        "metaphysically",
        "impossible"
    ]
}