{
    "main_text": "Gravity Meets Quantum Theory\n2. Gravity Meets Quantum Theory\n\nThe difficulties in reconciling quantum theory and gravity into some\nform of quantum gravity come from the prima facie\nincompatibility of general relativity, Einstein’s relativistic\ntheory of gravitation, and quantum field theory, the framework for the\ndescription of the other three forces (electromagnetism and the strong\nand weak nuclear interactions). Whence the incompatibility? General\nrelativity is described by Einstein’s equations, which amount to\nconstraints on the curvature of spacetime (the Einstein tensor on the\nleft-hand side) due to the presence of mass and other forms of energy,\nsuch as electromagnetic radiation (the stress-energy-momentum tensor\non the right-hand side). (See John Baez’s webpages in\n Other Internet Resources\n for an excellent introduction.) In doing so, they manage to encompass\ntraditional, Newtonian gravitational phenomena such as the mutual\nattraction of two or more massive objects, while also predicting new\nphenomena such as the bending and red-shifting of light by these\nobjects (which have been observed) and the existence of gravitational\nradiation (until very recently, with the direct detection of\ngravitational waves by LIGO, this was, of course, only indirectly\nobserved via the decrease in the period of binary pulsars-see the\n 1993 Physics Nobel Prize presentation speech by Carl Nordling.)\n\nIn general relativity, mass and energy are treated in a purely\nclassical manner, where ‘classical’ means that physical\nquantities such as the strengths and directions of various fields and\nthe positions and velocities of particles have definite values. These\nquantities are represented by tensor fields, sets of (real) numbers\nassociated with each spacetime point. For example, the stress, energy,\nand momentum\nTab(x,t) of the\nelectromagnetic field at some point\n(x,t), are functions of the three\ncomponents Ei, Ej,\nEk, Bi,\nBj, Bk of the electric and\nmagnetic fields E and\nB at that point. These quantities in turn\ndetermine, via Einstein’s equations, an aspect of the\n‘curvature’ of spacetime, a set of numbers\nGab(x,t) which\nis in turn a function of the spacetime metric. The metric\ngab(x,t) is a\nset of numbers associated with each point which gives the distance to\nneighboring points. A model of the world according to general\nrelativity consists of a spacetime manifold with a metric, the\ncurvature of which is constrained by the stress-energy-momentum of the\nmatter distribution. All physical quantities — the value of the\nx-component of the electric field at some point, the scalar\ncurvature of spacetime at some point, and so on — have definite\nvalues, given by real (as opposed to complex or imaginary) numbers.\nThus general relativity is a classical theory in the sense given\nabove.\n\nThe problem is that our fundamental theories of matter and energy, the\ntheories describing the interactions of various particles via the\nelectromagnetic force and the strong and weak nuclear forces, are all\nquantum theories. In\n quantum theories,\n these physical quantities do not in general have definite\nvalues. For example, in quantum mechanics, the position of an electron\nmay be specified with arbitrarily high accuracy only at the cost of a\nloss of specificity in the description of its momentum, hence its\nvelocity. At the same time, in the quantum theory of the\nelectromagnetic field known as quantum electrodynamics (QED), the\nelectric and magnetic fields associated with the electron suffer an\nassociated uncertainty. In general, physical quantities are described\nby a quantum state which gives a probability distribution over many\ndifferent values, and increased specificity (narrowing of the\ndistribution) of one property (e.g., position, electric field) gives\nrise to decreased specificity of its canonically conjugate property\n(e.g., momentum, magnetic field). This is an expression of\nHeisenberg’s\n Uncertainty Principle.\n In the context of quantum gravity the fluctuating geometry is known\nas “spacetime foam”. Likewise, if one focusses in on the\nspatial geometry, it will not have a definite trajectory.\n\nOn the surface, the incompatibility between general relativity and\nquantum theory might seem rather trivial. Why not just follow the\nmodel of QED and quantize the gravitational field, similar to the way\nin which the electromagnetic field was quantized? This is more or less\nthe path that was taken, but it encounters extraordinary difficulties.\nSome physicists consider these to be ‘merely’ technical\ndifficulties, having to do with the non-renormalizability of the\ngravitational interaction and the consequent failure of the\nperturbative methods which have proven effective in ordinary quantum\nfield theories. However, these technical problems are closely related\nto a set of daunting conceptual difficulties, of interest to\nboth physicists and philosophers.\n\nThe conceptual difficulties basically follow from the nature of the\ngravitational interaction, in particular the equivalence of\ngravitational and inertial mass, which allows one to represent gravity\nas a property of spacetime itself, rather than as a field propagating\nin a (passive) spacetime background. When one attempts to\nquantize gravity, one is subjecting some of the properties of\nspacetime to quantum fluctuations. For example, in canonical\nquantizations of gravity one isolates and then quantizes geometrical\nquantities (roughly the intrinsic and extrinsic curvature of three\ndimensional space) functioning as the position and momentum variables.\nGiven the uncertainty principle and the probabilistic nature of\nquantum theory, one has a picture involving fluctuations of the\ngeometry of space, much as the electric and magnetic fields fluctuate\nin QED. But ordinary quantum theory presupposes a well-defined\nclassical background against which to define these\nfluctuations (Weinstein, 2001a, b), and so one runs into trouble not\nonly in giving a mathematical characterization of the quantization\nprocedure (how to take into account these fluctuations in the\neffective spacetime structure?) but also in giving a conceptual and\nphysical account of the theory that results, should one succeed. For\nexample, a fluctuating metric would seem to imply a fluctuating causal\nstructure and spatiotemporal ordering of events, in which case, how is\none to define equal-time commutation relations in the quantum theory?\n(See the section on the Lagrangian formulation in the entry on\n quantum field theory.)\n \n\nCao (2001) believes that the conceptual nature of the problem demands\na conceptual resolution. He advocates what he calls ‘ontological\nsynthesis’. This approach asks for an analysis of the\nontological pictures of the two ingredient theories of quantum\ngravity, so that their consistency (the consistency of the resulting\nsynthesis) can be properly assessed. Ontology for Cao refers to the\nprimary, autonomous structures from which all other properties and\nrelations in a theory are constructed. A fairly simple inspection of\nthe respective ontological constraints imposed by general relativity\nand quantum field theory reveals serious tension: general relativity\ndiscards the fixed kinematical structure of spacetime, so that\nlocalization is rendered relational, but in quantum field theory a\nfixed flat background is part of its ontological basis, from which the\nstandard features of the theory are derived. On the other hand, as we\nhave seen, quantum field theory involves quantum fluctuations in the\nvicinity of a point, while general relativity involves the use of a\nsmooth point neighbourhood. Either way, in order to bring the two\nontological bases together, some piece of either edifice must be\ndemolished. Cao proposes that the tension can best be resolved by\nfocussing firmly on those sine qua non principles of the\nrespective theories. Cao views the gravitational property of universal\ncoupling as essential, but notes that this does not require\ncontinuity, so that the former could be retained while discarding the\nlatter, without rendering the framework inconsistent, thus allowing\nfor quantum theory’s violent fluctuations (Cao’s prime\ncandidate for an essential quantum field theoretic concept). Likewise,\nhe argues that quantum field theory requires a fixed background in\norder to localize quantum fields and set up causal structure. But he\nnotes that a relational account of localization could perform such a\nfunction, with fields localized relative to each other. In so doing,\none could envisage a diffeomorphism covariant quantum field theory\n(i.e. one that does not involve reference to fields localized at\npoints of the spacetime manifold). The resulting synthesized entity (a\nviolently fluctuating, universally coupled quantum gravitational\nfield) would then be what a quantum theory of gravity ought to\ndescribe.\n\nWhile such an approach sounds sensible enough on the surface, to\nactually put it into practice in the constructive stages of\ntheory-building (rather than a retrospective analysis of a completed\ntheory) is not going to be easy—though it has to be said, the\nmethod Cao describes bears close resemblance to the way loop quantum\ngravity has developed. Lucien Hardy (2007) has developed a novel\napproach to quantum gravity that shares features of Cao’s\nsuggestion, though the principles isolated are different from\nCao’s. The causaloid approach is intended to provide a\nframework for quantum gravity theories, where idea is to\ndevelop a general formalism that respects the key features of both\ngeneral relativity, which he takes to be the dynamical\n(non-probabilistic) causal structure, and quantum theory, which he\ntakes to be the probabilistic (nondynamical) dynamics. The causaloid\n(of some theory) is an entity that encodes all that can be calculated\nin the theory. Part of the problem here is that Cao’s (and\nHardy’s) approach assumes that the ontological principles hold\nat the Planck scale. However, it is perfectly possible that both of\nthe input theories break down at higher energies. Not only that, the\ntechnical difficulties of setting up the kind of (physically\nrealistic) diffeomorphism-invariant quantum field theory he suggests\nhave so far proven to be an insurmountable challenge. One crucial\naspect that is missing from Cao’s framework is a notion of what\nthe observables might be. Of course, they must be relational,\nbut this still leaves the problem very much open. (The idea of making\nprogress by isolating appropriate principles of quantum gravity\nforms the basis of a special issue: Crowther and Rickles, eds,\n2014.)\n\nWe will look in more detail at how various conceptual and\nmethodological problems arise in two different research programs\nbelow. But first, we introduce some key features of the leading\nresearch programs.\n",
    "section_title": "2. Gravity Meets Quantum Theory",
    "entry_title": "Quantum Gravity",
    "hierarchy_title": "Quantum Gravity || Gravity Meets Quantum Theory",
    "tokenized_text": [
        "gravity",
        "meet",
        "quantum",
        "theory",
        "gravity",
        "meet",
        "quantum",
        "theory",
        "difficulty",
        "reconciling",
        "quantum",
        "theory",
        "gravity",
        "form",
        "quantum",
        "gravity",
        "come",
        "prima",
        "facie",
        "incompatibility",
        "general",
        "relativity",
        "einstein",
        "relativistic",
        "theory",
        "gravitation",
        "quantum",
        "field",
        "theory",
        "framework",
        "description",
        "three",
        "force",
        "electromagnetism",
        "strong",
        "weak",
        "nuclear",
        "interaction",
        "whence",
        "incompatibility",
        "general",
        "relativity",
        "described",
        "einstein",
        "equation",
        "amount",
        "constraint",
        "curvature",
        "spacetime",
        "einstein",
        "tensor",
        "lefthand",
        "side",
        "due",
        "presence",
        "mass",
        "form",
        "energy",
        "electromagnetic",
        "radiation",
        "stressenergymomentum",
        "tensor",
        "righthand",
        "side",
        "see",
        "john",
        "baez",
        "webpage",
        "internet",
        "resource",
        "excellent",
        "introduction",
        "manage",
        "encompass",
        "traditional",
        "newtonian",
        "gravitational",
        "phenomenon",
        "mutual",
        "attraction",
        "two",
        "massive",
        "object",
        "also",
        "predicting",
        "new",
        "phenomenon",
        "bending",
        "redshifting",
        "light",
        "object",
        "observed",
        "existence",
        "gravitational",
        "radiation",
        "recently",
        "direct",
        "detection",
        "gravitational",
        "wave",
        "ligo",
        "course",
        "indirectly",
        "observed",
        "via",
        "decrease",
        "period",
        "binary",
        "pulsarssee",
        "physic",
        "nobel",
        "prize",
        "presentation",
        "speech",
        "carl",
        "nordling",
        "general",
        "relativity",
        "mass",
        "energy",
        "treated",
        "purely",
        "classical",
        "manner",
        "classical",
        "mean",
        "physical",
        "quantity",
        "strength",
        "direction",
        "various",
        "field",
        "position",
        "velocity",
        "particle",
        "definite",
        "value",
        "quantity",
        "represented",
        "tensor",
        "field",
        "set",
        "real",
        "number",
        "associated",
        "spacetime",
        "point",
        "example",
        "stress",
        "energy",
        "momentum",
        "tab",
        "x",
        "electromagnetic",
        "field",
        "point",
        "x",
        "function",
        "three",
        "component",
        "ei",
        "ej",
        "ek",
        "bi",
        "bj",
        "bk",
        "electric",
        "magnetic",
        "field",
        "e",
        "b",
        "point",
        "quantity",
        "turn",
        "determine",
        "via",
        "einstein",
        "equation",
        "aspect",
        "curvature",
        "spacetime",
        "set",
        "number",
        "gab",
        "x",
        "turn",
        "function",
        "spacetime",
        "metric",
        "metric",
        "gab",
        "x",
        "set",
        "number",
        "associated",
        "point",
        "give",
        "distance",
        "neighboring",
        "point",
        "model",
        "world",
        "according",
        "general",
        "relativity",
        "consists",
        "spacetime",
        "manifold",
        "metric",
        "curvature",
        "constrained",
        "stressenergymomentum",
        "matter",
        "distribution",
        "physical",
        "quantity",
        "value",
        "xcomponent",
        "electric",
        "field",
        "point",
        "scalar",
        "curvature",
        "spacetime",
        "point",
        "definite",
        "value",
        "given",
        "real",
        "opposed",
        "complex",
        "imaginary",
        "number",
        "thus",
        "general",
        "relativity",
        "classical",
        "theory",
        "sense",
        "given",
        "problem",
        "fundamental",
        "theory",
        "matter",
        "energy",
        "theory",
        "describing",
        "interaction",
        "various",
        "particle",
        "via",
        "electromagnetic",
        "force",
        "strong",
        "weak",
        "nuclear",
        "force",
        "quantum",
        "theory",
        "quantum",
        "theory",
        "physical",
        "quantity",
        "general",
        "definite",
        "value",
        "example",
        "quantum",
        "mechanic",
        "position",
        "electron",
        "may",
        "specified",
        "arbitrarily",
        "high",
        "accuracy",
        "cost",
        "loss",
        "specificity",
        "description",
        "momentum",
        "hence",
        "velocity",
        "time",
        "quantum",
        "theory",
        "electromagnetic",
        "field",
        "known",
        "quantum",
        "electrodynamics",
        "qed",
        "electric",
        "magnetic",
        "field",
        "associated",
        "electron",
        "suffer",
        "associated",
        "uncertainty",
        "general",
        "physical",
        "quantity",
        "described",
        "quantum",
        "state",
        "give",
        "probability",
        "distribution",
        "many",
        "different",
        "value",
        "increased",
        "specificity",
        "narrowing",
        "distribution",
        "one",
        "property",
        "eg",
        "position",
        "electric",
        "field",
        "give",
        "rise",
        "decreased",
        "specificity",
        "canonically",
        "conjugate",
        "property",
        "eg",
        "momentum",
        "magnetic",
        "field",
        "expression",
        "heisenberg",
        "uncertainty",
        "principle",
        "context",
        "quantum",
        "gravity",
        "fluctuating",
        "geometry",
        "known",
        "spacetime",
        "foam",
        "likewise",
        "one",
        "focus",
        "spatial",
        "geometry",
        "definite",
        "trajectory",
        "surface",
        "incompatibility",
        "general",
        "relativity",
        "quantum",
        "theory",
        "might",
        "seem",
        "rather",
        "trivial",
        "follow",
        "model",
        "qed",
        "quantize",
        "gravitational",
        "field",
        "similar",
        "way",
        "electromagnetic",
        "field",
        "quantized",
        "le",
        "path",
        "taken",
        "encounter",
        "extraordinary",
        "difficulty",
        "physicist",
        "consider",
        "merely",
        "technical",
        "difficulty",
        "nonrenormalizability",
        "gravitational",
        "interaction",
        "consequent",
        "failure",
        "perturbative",
        "method",
        "proven",
        "effective",
        "ordinary",
        "quantum",
        "field",
        "theory",
        "however",
        "technical",
        "problem",
        "closely",
        "related",
        "set",
        "daunting",
        "conceptual",
        "difficulty",
        "interest",
        "physicist",
        "philosopher",
        "conceptual",
        "difficulty",
        "basically",
        "follow",
        "nature",
        "gravitational",
        "interaction",
        "particular",
        "equivalence",
        "gravitational",
        "inertial",
        "mass",
        "allows",
        "one",
        "represent",
        "gravity",
        "property",
        "spacetime",
        "rather",
        "field",
        "propagating",
        "passive",
        "spacetime",
        "background",
        "one",
        "attempt",
        "quantize",
        "gravity",
        "one",
        "subjecting",
        "property",
        "spacetime",
        "quantum",
        "fluctuation",
        "example",
        "canonical",
        "quantization",
        "gravity",
        "one",
        "isolates",
        "quantizes",
        "geometrical",
        "quantity",
        "roughly",
        "intrinsic",
        "extrinsic",
        "curvature",
        "three",
        "dimensional",
        "space",
        "functioning",
        "position",
        "momentum",
        "variable",
        "given",
        "uncertainty",
        "principle",
        "probabilistic",
        "nature",
        "quantum",
        "theory",
        "one",
        "picture",
        "involving",
        "fluctuation",
        "geometry",
        "space",
        "much",
        "electric",
        "magnetic",
        "field",
        "fluctuate",
        "qed",
        "ordinary",
        "quantum",
        "theory",
        "presupposes",
        "welldefined",
        "classical",
        "background",
        "define",
        "fluctuation",
        "weinstein",
        "a",
        "b",
        "one",
        "run",
        "trouble",
        "giving",
        "mathematical",
        "characterization",
        "quantization",
        "procedure",
        "take",
        "account",
        "fluctuation",
        "effective",
        "spacetime",
        "structure",
        "also",
        "giving",
        "conceptual",
        "physical",
        "account",
        "theory",
        "result",
        "one",
        "succeed",
        "example",
        "fluctuating",
        "metric",
        "would",
        "seem",
        "imply",
        "fluctuating",
        "causal",
        "structure",
        "spatiotemporal",
        "ordering",
        "event",
        "case",
        "one",
        "define",
        "equaltime",
        "commutation",
        "relation",
        "quantum",
        "theory",
        "see",
        "section",
        "lagrangian",
        "formulation",
        "entry",
        "quantum",
        "field",
        "theory",
        "cao",
        "belief",
        "conceptual",
        "nature",
        "problem",
        "demand",
        "conceptual",
        "resolution",
        "advocate",
        "call",
        "ontological",
        "synthesis",
        "approach",
        "asks",
        "analysis",
        "ontological",
        "picture",
        "two",
        "ingredient",
        "theory",
        "quantum",
        "gravity",
        "consistency",
        "consistency",
        "resulting",
        "synthesis",
        "properly",
        "assessed",
        "ontology",
        "cao",
        "refers",
        "primary",
        "autonomous",
        "structure",
        "property",
        "relation",
        "theory",
        "constructed",
        "fairly",
        "simple",
        "inspection",
        "respective",
        "ontological",
        "constraint",
        "imposed",
        "general",
        "relativity",
        "quantum",
        "field",
        "theory",
        "reveals",
        "serious",
        "tension",
        "general",
        "relativity",
        "discard",
        "fixed",
        "kinematical",
        "structure",
        "spacetime",
        "localization",
        "rendered",
        "relational",
        "quantum",
        "field",
        "theory",
        "fixed",
        "flat",
        "background",
        "part",
        "ontological",
        "basis",
        "standard",
        "feature",
        "theory",
        "derived",
        "hand",
        "seen",
        "quantum",
        "field",
        "theory",
        "involves",
        "quantum",
        "fluctuation",
        "vicinity",
        "point",
        "general",
        "relativity",
        "involves",
        "use",
        "smooth",
        "point",
        "neighbourhood",
        "either",
        "way",
        "order",
        "bring",
        "two",
        "ontological",
        "base",
        "together",
        "piece",
        "either",
        "edifice",
        "must",
        "demolished",
        "cao",
        "proposes",
        "tension",
        "best",
        "resolved",
        "focussing",
        "firmly",
        "sine",
        "qua",
        "non",
        "principle",
        "respective",
        "theory",
        "cao",
        "view",
        "gravitational",
        "property",
        "universal",
        "coupling",
        "essential",
        "note",
        "require",
        "continuity",
        "former",
        "could",
        "retained",
        "discarding",
        "latter",
        "without",
        "rendering",
        "framework",
        "inconsistent",
        "thus",
        "allowing",
        "quantum",
        "theory",
        "violent",
        "fluctuation",
        "cao",
        "prime",
        "candidate",
        "essential",
        "quantum",
        "field",
        "theoretic",
        "concept",
        "likewise",
        "argues",
        "quantum",
        "field",
        "theory",
        "requires",
        "fixed",
        "background",
        "order",
        "localize",
        "quantum",
        "field",
        "set",
        "causal",
        "structure",
        "note",
        "relational",
        "account",
        "localization",
        "could",
        "perform",
        "function",
        "field",
        "localized",
        "relative",
        "one",
        "could",
        "envisage",
        "diffeomorphism",
        "covariant",
        "quantum",
        "field",
        "theory",
        "ie",
        "one",
        "involve",
        "reference",
        "field",
        "localized",
        "point",
        "spacetime",
        "manifold",
        "resulting",
        "synthesized",
        "entity",
        "violently",
        "fluctuating",
        "universally",
        "coupled",
        "quantum",
        "gravitational",
        "field",
        "would",
        "quantum",
        "theory",
        "gravity",
        "ought",
        "describe",
        "approach",
        "sound",
        "sensible",
        "enough",
        "surface",
        "actually",
        "put",
        "practice",
        "constructive",
        "stage",
        "theorybuilding",
        "rather",
        "retrospective",
        "analysis",
        "completed",
        "theory",
        "going",
        "easythough",
        "said",
        "method",
        "cao",
        "describes",
        "bear",
        "close",
        "resemblance",
        "way",
        "loop",
        "quantum",
        "gravity",
        "developed",
        "lucien",
        "hardy",
        "developed",
        "novel",
        "approach",
        "quantum",
        "gravity",
        "share",
        "feature",
        "cao",
        "suggestion",
        "though",
        "principle",
        "isolated",
        "different",
        "cao",
        "causaloid",
        "approach",
        "intended",
        "provide",
        "framework",
        "quantum",
        "gravity",
        "theory",
        "idea",
        "develop",
        "general",
        "formalism",
        "respect",
        "key",
        "feature",
        "general",
        "relativity",
        "take",
        "dynamical",
        "nonprobabilistic",
        "causal",
        "structure",
        "quantum",
        "theory",
        "take",
        "probabilistic",
        "nondynamical",
        "dynamic",
        "causaloid",
        "theory",
        "entity",
        "encodes",
        "calculated",
        "theory",
        "part",
        "problem",
        "cao",
        "hardy",
        "approach",
        "assumes",
        "ontological",
        "principle",
        "hold",
        "planck",
        "scale",
        "however",
        "perfectly",
        "possible",
        "input",
        "theory",
        "break",
        "higher",
        "energy",
        "technical",
        "difficulty",
        "setting",
        "kind",
        "physically",
        "realistic",
        "diffeomorphisminvariant",
        "quantum",
        "field",
        "theory",
        "suggests",
        "far",
        "proven",
        "insurmountable",
        "challenge",
        "one",
        "crucial",
        "aspect",
        "missing",
        "cao",
        "framework",
        "notion",
        "observables",
        "might",
        "course",
        "must",
        "relational",
        "still",
        "leaf",
        "problem",
        "much",
        "open",
        "idea",
        "making",
        "progress",
        "isolating",
        "appropriate",
        "principle",
        "quantum",
        "gravity",
        "form",
        "basis",
        "special",
        "issue",
        "crowther",
        "rickles",
        "ed",
        "look",
        "detail",
        "various",
        "conceptual",
        "methodological",
        "problem",
        "arise",
        "two",
        "different",
        "research",
        "program",
        "first",
        "introduce",
        "key",
        "feature",
        "leading",
        "research",
        "program"
    ]
}