{
    "main_text": "Type Theory and the Axiomatisation of NF\n3. Type Theory and the Axiomatisation of NF\n\n\nThe conception of set underlying NF arises from a related – indeed\ncomplementary – oversimplification. ZF arises from the belief that\nif we enforce a kind of wellfoundedness in the constitution of set\nthen all will be well. NF arises ultimately from the idea that all\nwill be well if we enforce a kind of wellfoundedness (or at least\nnoncircularity) in the description of sets. This concern can\ntake two forms: One might feel uneasy about conjuring up a set by\nmeans of a spell that invokes other sets that are in some sense\n“not yet” available (sets of which the candidate will turn\nout to be a member, for example). This is a mathematically fruitful\nconcern (keyword “predicativity”) and it will reappear\nlater in the study of NF (and in ZF too, of course) but it is not this\nfirst form that gives rise to the axiomatisation of NF. In the second\nview, the key to neutralising the dangers of self-reference lies in\nsegregating sets into pairwise disjoint levels called\ntypes. (That this concern is orthogonal to the first kind of\nconcern can be shown by consideration of the axiom of sumset. This is\na legitimate axiom from the second point of view, even though the\nspell that conjures \\(\\bigcup X\\) does it by invoking the set \\(X\\),\nwhich is of higher type.)\n\n\nThis view of set theory gave rise to the Theory of Types. In the\nTheory of Types (as simplified successively by Ramsey, Carnap,\nGödel and Quine) the bottom type is a collection of atoms. Atoms\nare non-sets (dormice, teapots, anything you please) with no internal\nstructure visible to the set theory. Thereafter type \\(n + 1\\) is\nsimply the power set of type \\(n\\), and there is a type for each\nnatural number. The process cannot be extended to give transfinite\ntypes, since the types (being formally disjoint) are not cumulative so\nthere is no sensible way to define a \\(\\omega\\)th type. NF arises from\na consideration of the syntax used to describe structures of this\nkind, and the syntax requires more careful handling. A first-order\nlanguage for describing structures of this sort has infinitely many\nsuites of variables, one suite for each type, and a membership symbol\n(‘\\(\\in\\)’ as usual) which can be placed only between\nvariables of consecutive types: ‘\\(x_n \\in y_{n+1}\\)’ is\nwellformed but ‘\\(x_n \\in y_n\\)’ is not. The equality sign\ncan be placed only between variables of the same type.\n\n\nThis type theory has the following axioms. Extensionality at each\ntype:\n\n\\[\n\\forall x_n \\forall y_n [x_n =y_n \\leftrightarrow \\forall z_{n+1}(x_n \\in z_{n+1} \\leftrightarrow y_n \\in z_{n+1})]\n\\]\n\n\n and an axiom scheme of comprehension at each type. Notice that the\nformula displayed above is not, strictly speaking, an axiom of\nextensionality, since the variables do not have concrete type\nsubscripts, so it is not officially a formula at all. It’s a kind of\naxiom scheme. Annoyingly, this subtlety matters. The fact that\nvariables have type subscripts precludes the more usual exploitations\nof subscripting for purposes such as indicating position in a\nsequence. This makes the language of type theory infeasible for most\nmathematical purposes, so one looks for excuses to omit the type\nsubscripts. Why might this be a safe manœuvre? Let us define\n\\(\\Phi^+\\) to be the result of raising all the type subscripts\non all variables in \\(\\Phi\\). It’s safe because the theory has the same\naxioms at each type, so it has the same theorems at each type, so\nwhenever one has a proof of a formula \\(\\Phi\\) one also has a proof of\n\\(\\Phi^+\\). One omits the type subscripts because even though,\nonce has omitted them, there are infinitely many ways of restoring\nthem, these infinitely many differently restored versions do not\nappear to differ significantly. We shall take up later the theme of\nthe significance of this difference, but for the moment we note only\nthat it appears – as it appeared to Russell and his successors up\nto and including Quine – that the differences could be safely\noverlooked. This strategy of overlooking is called typical\nambiguity.\n\n\nThis version of Type theory, as simplified by Ramsey, Gödel,\nCarnap and Quine. is the point of departure for Quine [1937a] (which\nis still a good place to read the background). NF is obtained from\nthis type theory by taking its axioms and stripping the type\nsubscripts off all the variables. This is subtly different from Type\nTheory used with a policy of typical ambiguity. Under that scheme a\nformula like \n\n\\[\\tag{A}\n\\exists x\\forall y(y \\in x)\n\\]\n\n\n isn’t really a formula at all, but a formula scheme, or shorthand for\nany of the genuine formulæ to be obtained from it by adding\nsubscripts to ‘\\(x\\)’ and\n‘\\(y\\)’. Which subscript? In every setting it will\neither (i) become clear which subscript, or (ii) become clear that it\ndoesn’t matter. At all events, (A) is not an axiom of Type theory: the\ntheory does not have a universal set, what it has is a universal set\nat each type.\n\n\nHowever it is not just the universal set that appears at each type.\nWe also get the naturals, the reals and the rationals etc. etc. at\neach type, and this is clearly not what we want. (Holmes refers to\nthis as the Hall of Mirrors effect.) Quine’s move in\n[1937a] is the natural one of taking the pseudoformulæ like (A)\nand thinking of them as genuine formulæ in a new, one-sorted,\nlanguage. The new theory does not have a universal set at each type,\nfor it has no types: it has a single universal set. And a single\nimplementation of the reals, and so on. Formulæ of the\none-sorted language obtained in this way from formulæ of type\ntheory are said to be stratified. The axioms of NF are now\nextensionality plus those instances of naïve comprehension that\nhappen to be stratified.\n\n\nInterestingly, natural and well-motivated though this progression\nsounds, it does not provide a consistency proof for the system it ends\nwith. We will discuss this later.\n\n\nThe hard part is to fully understand stratification. There is an easy\nrule of thumb with formulæ that are in primitive notation, for\none can just ask oneself whether the formula could become a wff of\ntype theory by adding type indices. It’s harder when one has\nformulæ no longer in primitive notation, and the reader\nencounters these difficulties very early on, since the ordered pair is\nnot a set-theoretic notion. How does one determine whether or not a\nformula is stratified when it contains subformulæ like \\(f(x) =\ny\\)? The technical/notational difficulty here lands on top of – as\nso often – a conceptual difficulty. The answer is that of course\none has to fix an implementation of ordered pair and stick to it. Does\nthat mean that – for formulæ involving ordered\npairs – whether or not the given formula is stratified depends on\nhow one implements ordered pairs? The answer is ‘yes’ but\nthe situation is not as grave as this suggests. There are various\nstandard definitions of ordered pair, and they are all legitimate in\nNF, and all satisfactory in the sense that they are\n“level” or homogeneous. All of them make the\nformula “\\(\\langle x, y\\rangle = z\\)” stratified and give\nthe variables \\(x\\) and \\(y\\) the same type; \\(z\\) takes a higher type\nin most cases (never lower). How much higher depends on the\nversion of ordered pair being used, but there are very few\nformulæ that come out stratified on one version of ordered pair\nbut unstratified on another, and they are all pathological in ways\nreminiscent of the paradoxes.\n\n The best way to illustrate this is by considering ordinals \\((=\\)\nisomorphism classes of wellorderings) in NF. For any ordinal \\(\\alpha\\)\nthe order type of the set (and it is a set) of the ordinals below\n\\(\\alpha\\) is wellordered. In ZF one can prove that the wellordering of\nthe ordinals below \\(\\alpha\\) is of length \\(\\alpha\\). In NF one cannot\nprove this equation for arbitrary \\(\\alpha\\) since the formula in the set\nabstract whose extension is the graph of the isomorphism is not\nstratified for any implementation of ordered pair. Now any\nwellordering \\(R\\) of a set \\(A\\) to length \\(\\alpha\\) gives\nrise to a wellordering of \\(\\{\\{\\{a\\}\\} : a \\in A\\}\\), and if instead one tries to prove (in NF) that the\nordinals below \\(\\alpha\\) are isomorphic to the wellordering of length\n\\(\\alpha\\) decorated with curly brackets, one finds that the very\nassertion that there is an isomorphism between these two wellorderings\ncomes out stratified or unstratified depending on one’s choice of\nimplementation of ordered pair! This is because, in some sense, the\napplications of the pairing function are two deep in\nwellordering of the ordinals below \\(\\alpha\\), but only one deep\nin the wellordering of the set of double singletons. If we use Quine\nordered pairs, the assertion is stratified – and provable. If one\nuses Wiener-Kuratowski ordered pairs then the assertion is\nunstratified and refutable. However if one uses Wiener-Kuratowki\nordered pairs there is instead the assertion that the ordinals below\n\\(\\alpha\\) are isomorphic to the obvious wellordering of\n\\(\\{\\{\\{\\{\\{a\\}\\}\\}\\} : a \\in A\\}\\), which comes out\nstratified (and provable). In general for each implementation of\nordered pair there is a depth of nesting of curly brackets which will\nmake a version of this equality come out stratified and true. This\ndoes not work with deviant implementations of ordered pair under\nwhich “\\(\\langle x, y\\rangle = z\\)” is\nunstratified or even with those which are stratified but give the\nvariables \\(x\\) and \\(y\\) different types. Use of such\nimplementations of ordered pairs results in certain sets not being the\nsame size as themselves!\n\n\nPerhaps a concrete example would help. Let us try to prove\nCantor’s theorem. The key step in showing there is no surjection\n\\(f : X \\to \\wp(X)\\) by reductio ad absurdum is the\nconstruction of the diagonal set \\(\\{x \\in X : x \\not\\in f(x)\\}\\). \nThe proof relies on this object being a set, which it will be\na set if “\\(x \\in X \\amp x \\not\\in f(x) \\amp f : X \\rightarrow\n\\wp(X)\\)” is stratified. This in turn depends on\n“\\(\\exists y[y \\in \\wp(X) \\amp \\langle y, x\\rangle \\in f \\amp f : X\n\\rightarrow \\wp(X)]\\)” being stratified. And\nit isn’t stratified, because “\\(\\langle y, x\\rangle \\in\nf\\)” compels ‘\\(x\\)’ and ‘\\(y\\)’ to be\ngiven the same type, while “\\(f : X \\rightarrow \\wp(X)\\)”\nwill compel ‘\\(y\\)’ to be given a type one higher than\n‘\\(x\\)’. This is because we have subformulæ\n‘\\(x \\in X\\)’ and ‘\\(y \\subseteq X\\)’. Notice\nthat we can draw this melancholy conclusion without knowing whether\nthe type of ‘\\(f\\)’ is one higher than that type of its\nargument, or two, or three …. We cannot prove Cantor’s\ntheorem.\n \n\nHowever if we try instead to prove that \\(\\{\\{x\\} : x \\in X\\}\\) is not\nthe same size as \\(\\wp(X)\\) we find that the diagonal set is defined\nby a stratified condition and exists, so the proof succeeds. This\ntells us that we cannot prove that \\(\\lvert X\\rvert = \\lvert \\{\\{x\\} :\nx \\in X\\}\\rvert\\) for arbitrary \\(X\\): graphs of restrictions of the\nsingleton function tend not to exist. If they did, we would be able to\nprove Cantor’s theorem in full generality. This gives rise to an\nendomorphism \\(T\\) on cardinals, where \\(T\\lvert X\\rvert =_{df} \\lvert\n\\{\\{x\\} : x \\in X\\}\\rvert\\). \\(T\\) misbehaves in connection with the\nsets that in NF studies we call big (as opposed\nto large, as in large cardinals (in ZF)). These are\nthe collections like the universal set, and the set of all cardinals\nand the set of all ordinals: collections denoted by expressions which\nin ZF-like theories will pick out proper classes. If \\(\\lvert X\\rvert\n= \\lvert \\{\\{x\\} : x \\in X\\}\\rvert\\) we say that \\(X\\)\nis cantorian. If the singleton function restricted to \\(X\\)\nexists, we say that \\(X\\) is strongly cantorian. Sets whose\nsizes are concrete natural numbers are strongly cantorian. IN (the set\nof Frege natural numbers) is cantorian, but the assertion that it is\nstrongly cantorian implies the consistency of NF.\n\n\nIt can be plausibly argued that the bizarre behaviour of the\n\\(T\\) function (and it is at its most bizarre in connection with\nthe big sets) is just the paradoxes bubbling up again. Assertions to\nthe effect that \\(T\\) is well-behaved have strong consistency\nstrength (Orey [1955], [1956]) and play in NF studies the kind of\nrôle that large cardinal axioms play in ZF-like systems. Indeed\nthere are some exact equivalents. The \\(T\\)-assertions may look\nodd, but their oddness is only skin-deep. They are actually expressing\nthe same mathematics that happens in ZF, but through an unfamiliar\nformalisation.\n",
    "section_title": "3. Type Theory and the Axiomatisation of NF",
    "entry_title": "Quine’s New Foundations",
    "hierarchy_title": "Quine’s New Foundations || Type Theory and the Axiomatisation of NF",
    "tokenized_text": [
        "type",
        "theory",
        "axiomatisation",
        "nf",
        "type",
        "theory",
        "axiomatisation",
        "nf",
        "conception",
        "set",
        "underlying",
        "nf",
        "arises",
        "related",
        "indeed",
        "complementary",
        "oversimplification",
        "zf",
        "arises",
        "belief",
        "enforce",
        "kind",
        "wellfoundedness",
        "constitution",
        "set",
        "well",
        "nf",
        "arises",
        "ultimately",
        "idea",
        "well",
        "enforce",
        "kind",
        "wellfoundedness",
        "least",
        "noncircularity",
        "description",
        "set",
        "concern",
        "take",
        "two",
        "form",
        "one",
        "might",
        "feel",
        "uneasy",
        "conjuring",
        "set",
        "mean",
        "spell",
        "invokes",
        "set",
        "sense",
        "yet",
        "available",
        "set",
        "candidate",
        "turn",
        "member",
        "example",
        "mathematically",
        "fruitful",
        "concern",
        "keyword",
        "predicativity",
        "reappear",
        "later",
        "study",
        "nf",
        "zf",
        "course",
        "first",
        "form",
        "give",
        "rise",
        "axiomatisation",
        "nf",
        "second",
        "view",
        "key",
        "neutralising",
        "danger",
        "selfreference",
        "lie",
        "segregating",
        "set",
        "pairwise",
        "disjoint",
        "level",
        "called",
        "type",
        "concern",
        "orthogonal",
        "first",
        "kind",
        "concern",
        "shown",
        "consideration",
        "axiom",
        "sumset",
        "legitimate",
        "axiom",
        "second",
        "point",
        "view",
        "even",
        "though",
        "spell",
        "conjures",
        "bigcup",
        "x",
        "invoking",
        "set",
        "x",
        "higher",
        "type",
        "view",
        "set",
        "theory",
        "gave",
        "rise",
        "theory",
        "type",
        "theory",
        "type",
        "simplified",
        "successively",
        "ramsey",
        "carnap",
        "gödel",
        "quine",
        "bottom",
        "type",
        "collection",
        "atom",
        "atom",
        "nonsets",
        "dormouse",
        "teapot",
        "anything",
        "please",
        "internal",
        "structure",
        "visible",
        "set",
        "theory",
        "thereafter",
        "type",
        "n",
        "simply",
        "power",
        "set",
        "type",
        "n",
        "type",
        "natural",
        "number",
        "process",
        "extended",
        "give",
        "transfinite",
        "type",
        "since",
        "type",
        "formally",
        "disjoint",
        "cumulative",
        "sensible",
        "way",
        "define",
        "omega",
        "th",
        "type",
        "nf",
        "arises",
        "consideration",
        "syntax",
        "used",
        "describe",
        "structure",
        "kind",
        "syntax",
        "requires",
        "careful",
        "handling",
        "firstorder",
        "language",
        "describing",
        "structure",
        "sort",
        "infinitely",
        "many",
        "suite",
        "variable",
        "one",
        "suite",
        "type",
        "membership",
        "symbol",
        "in",
        "usual",
        "placed",
        "variable",
        "consecutive",
        "type",
        "x_n",
        "in",
        "y_",
        "n",
        "wellformed",
        "x_n",
        "in",
        "y_n",
        "equality",
        "sign",
        "placed",
        "variable",
        "type",
        "type",
        "theory",
        "following",
        "axiom",
        "extensionality",
        "type",
        "forall",
        "x_n",
        "forall",
        "y_n",
        "x_n",
        "y_n",
        "leftrightarrow",
        "forall",
        "z_",
        "n",
        "x_n",
        "in",
        "z_",
        "n",
        "leftrightarrow",
        "y_n",
        "in",
        "z_",
        "n",
        "axiom",
        "scheme",
        "comprehension",
        "type",
        "notice",
        "formula",
        "displayed",
        "strictly",
        "speaking",
        "axiom",
        "extensionality",
        "since",
        "variable",
        "concrete",
        "type",
        "subscript",
        "officially",
        "formula",
        "kind",
        "axiom",
        "scheme",
        "annoyingly",
        "subtlety",
        "matter",
        "fact",
        "variable",
        "type",
        "subscript",
        "precludes",
        "usual",
        "exploitation",
        "subscripting",
        "purpose",
        "indicating",
        "position",
        "sequence",
        "make",
        "language",
        "type",
        "theory",
        "infeasible",
        "mathematical",
        "purpose",
        "one",
        "look",
        "excuse",
        "omit",
        "type",
        "subscript",
        "might",
        "safe",
        "manœuvre",
        "let",
        "u",
        "define",
        "phi",
        "result",
        "raising",
        "type",
        "subscript",
        "variable",
        "phi",
        "safe",
        "theory",
        "axiom",
        "type",
        "theorem",
        "type",
        "whenever",
        "one",
        "proof",
        "formula",
        "phi",
        "one",
        "also",
        "proof",
        "phi",
        "one",
        "omits",
        "type",
        "subscript",
        "even",
        "though",
        "omitted",
        "infinitely",
        "many",
        "way",
        "restoring",
        "infinitely",
        "many",
        "differently",
        "restored",
        "version",
        "appear",
        "differ",
        "significantly",
        "shall",
        "take",
        "later",
        "theme",
        "significance",
        "difference",
        "moment",
        "note",
        "appears",
        "appeared",
        "russell",
        "successor",
        "including",
        "quine",
        "difference",
        "could",
        "safely",
        "overlooked",
        "strategy",
        "overlooking",
        "called",
        "typical",
        "ambiguity",
        "version",
        "type",
        "theory",
        "simplified",
        "ramsey",
        "gödel",
        "carnap",
        "quine",
        "point",
        "departure",
        "quine",
        "a",
        "still",
        "good",
        "place",
        "read",
        "background",
        "nf",
        "obtained",
        "type",
        "theory",
        "taking",
        "axiom",
        "stripping",
        "type",
        "subscript",
        "variable",
        "subtly",
        "different",
        "type",
        "theory",
        "used",
        "policy",
        "typical",
        "ambiguity",
        "scheme",
        "formula",
        "like",
        "tag",
        "exists",
        "xforall",
        "in",
        "x",
        "really",
        "formula",
        "formula",
        "scheme",
        "shorthand",
        "genuine",
        "formulæ",
        "obtained",
        "adding",
        "subscript",
        "x",
        "y",
        "subscript",
        "every",
        "setting",
        "either",
        "become",
        "clear",
        "subscript",
        "ii",
        "become",
        "clear",
        "matter",
        "event",
        "axiom",
        "type",
        "theory",
        "theory",
        "universal",
        "set",
        "universal",
        "set",
        "type",
        "however",
        "universal",
        "set",
        "appears",
        "type",
        "also",
        "get",
        "natural",
        "real",
        "rational",
        "etc",
        "etc",
        "type",
        "clearly",
        "want",
        "holmes",
        "refers",
        "hall",
        "mirror",
        "effect",
        "quine",
        "move",
        "a",
        "natural",
        "one",
        "taking",
        "pseudoformulæ",
        "like",
        "thinking",
        "genuine",
        "formulæ",
        "new",
        "onesorted",
        "language",
        "new",
        "theory",
        "universal",
        "set",
        "type",
        "type",
        "single",
        "universal",
        "set",
        "single",
        "implementation",
        "real",
        "formulæ",
        "onesorted",
        "language",
        "obtained",
        "way",
        "formulæ",
        "type",
        "theory",
        "said",
        "stratified",
        "axiom",
        "nf",
        "extensionality",
        "plus",
        "instance",
        "naïve",
        "comprehension",
        "happen",
        "stratified",
        "interestingly",
        "natural",
        "wellmotivated",
        "though",
        "progression",
        "sound",
        "provide",
        "consistency",
        "proof",
        "system",
        "end",
        "discus",
        "later",
        "hard",
        "part",
        "fully",
        "understand",
        "stratification",
        "easy",
        "rule",
        "thumb",
        "formulæ",
        "primitive",
        "notation",
        "one",
        "ask",
        "oneself",
        "whether",
        "formula",
        "could",
        "become",
        "wff",
        "type",
        "theory",
        "adding",
        "type",
        "index",
        "harder",
        "one",
        "formulæ",
        "longer",
        "primitive",
        "notation",
        "reader",
        "encounter",
        "difficulty",
        "early",
        "since",
        "ordered",
        "pair",
        "settheoretic",
        "notion",
        "one",
        "determine",
        "whether",
        "formula",
        "stratified",
        "contains",
        "subformulæ",
        "like",
        "f",
        "x",
        "y",
        "technicalnotational",
        "difficulty",
        "land",
        "top",
        "often",
        "conceptual",
        "difficulty",
        "answer",
        "course",
        "one",
        "fix",
        "implementation",
        "ordered",
        "pair",
        "stick",
        "mean",
        "formulæ",
        "involving",
        "ordered",
        "pair",
        "whether",
        "given",
        "formula",
        "stratified",
        "depends",
        "one",
        "implement",
        "ordered",
        "pair",
        "answer",
        "yes",
        "situation",
        "grave",
        "suggests",
        "various",
        "standard",
        "definition",
        "ordered",
        "pair",
        "legitimate",
        "nf",
        "satisfactory",
        "sense",
        "level",
        "homogeneous",
        "make",
        "formula",
        "langle",
        "x",
        "yrangle",
        "z",
        "stratified",
        "give",
        "variable",
        "x",
        "y",
        "type",
        "z",
        "take",
        "higher",
        "type",
        "case",
        "never",
        "lower",
        "much",
        "higher",
        "depends",
        "version",
        "ordered",
        "pair",
        "used",
        "formulæ",
        "come",
        "stratified",
        "one",
        "version",
        "ordered",
        "pair",
        "unstratified",
        "another",
        "pathological",
        "way",
        "reminiscent",
        "paradox",
        "best",
        "way",
        "illustrate",
        "considering",
        "ordinal",
        "isomorphism",
        "class",
        "wellorderings",
        "nf",
        "ordinal",
        "alpha",
        "order",
        "type",
        "set",
        "set",
        "ordinal",
        "alpha",
        "wellordered",
        "zf",
        "one",
        "prove",
        "wellordering",
        "ordinal",
        "alpha",
        "length",
        "alpha",
        "nf",
        "one",
        "prove",
        "equation",
        "arbitrary",
        "alpha",
        "since",
        "formula",
        "set",
        "abstract",
        "whose",
        "extension",
        "graph",
        "isomorphism",
        "stratified",
        "implementation",
        "ordered",
        "pair",
        "wellordering",
        "r",
        "set",
        "a",
        "length",
        "alpha",
        "give",
        "rise",
        "wellordering",
        "a",
        "in",
        "a",
        "instead",
        "one",
        "try",
        "prove",
        "nf",
        "ordinal",
        "alpha",
        "isomorphic",
        "wellordering",
        "length",
        "alpha",
        "decorated",
        "curly",
        "bracket",
        "one",
        "find",
        "assertion",
        "isomorphism",
        "two",
        "wellorderings",
        "come",
        "stratified",
        "unstratified",
        "depending",
        "one",
        "choice",
        "implementation",
        "ordered",
        "pair",
        "sense",
        "application",
        "pairing",
        "function",
        "two",
        "deep",
        "wellordering",
        "ordinal",
        "alpha",
        "one",
        "deep",
        "wellordering",
        "set",
        "double",
        "singleton",
        "use",
        "quine",
        "ordered",
        "pair",
        "assertion",
        "stratified",
        "provable",
        "one",
        "us",
        "wienerkuratowski",
        "ordered",
        "pair",
        "assertion",
        "unstratified",
        "refutable",
        "however",
        "one",
        "us",
        "wienerkuratowki",
        "ordered",
        "pair",
        "instead",
        "assertion",
        "ordinal",
        "alpha",
        "isomorphic",
        "obvious",
        "wellordering",
        "a",
        "in",
        "a",
        "come",
        "stratified",
        "provable",
        "general",
        "implementation",
        "ordered",
        "pair",
        "depth",
        "nesting",
        "curly",
        "bracket",
        "make",
        "version",
        "equality",
        "come",
        "stratified",
        "true",
        "work",
        "deviant",
        "implementation",
        "ordered",
        "pair",
        "langle",
        "x",
        "yrangle",
        "z",
        "unstratified",
        "even",
        "stratified",
        "give",
        "variable",
        "x",
        "y",
        "different",
        "type",
        "use",
        "implementation",
        "ordered",
        "pair",
        "result",
        "certain",
        "set",
        "size",
        "perhaps",
        "concrete",
        "example",
        "would",
        "help",
        "let",
        "u",
        "try",
        "prove",
        "cantor",
        "theorem",
        "key",
        "step",
        "showing",
        "surjection",
        "f",
        "x",
        "to",
        "wp",
        "x",
        "reductio",
        "ad",
        "absurdum",
        "construction",
        "diagonal",
        "set",
        "x",
        "in",
        "x",
        "x",
        "notin",
        "f",
        "x",
        "proof",
        "relies",
        "object",
        "set",
        "set",
        "x",
        "in",
        "x",
        "amp",
        "x",
        "notin",
        "f",
        "x",
        "amp",
        "f",
        "x",
        "rightarrow",
        "wp",
        "x",
        "stratified",
        "turn",
        "depends",
        "exists",
        "in",
        "wp",
        "x",
        "amp",
        "langle",
        "xrangle",
        "in",
        "f",
        "amp",
        "f",
        "x",
        "rightarrow",
        "wp",
        "x",
        "stratified",
        "stratified",
        "langle",
        "xrangle",
        "in",
        "f",
        "compels",
        "x",
        "y",
        "given",
        "type",
        "f",
        "x",
        "rightarrow",
        "wp",
        "x",
        "compel",
        "y",
        "given",
        "type",
        "one",
        "higher",
        "x",
        "subformulæ",
        "x",
        "in",
        "x",
        "subseteq",
        "x",
        "notice",
        "draw",
        "melancholy",
        "conclusion",
        "without",
        "knowing",
        "whether",
        "type",
        "f",
        "one",
        "higher",
        "type",
        "argument",
        "two",
        "three",
        "prove",
        "cantor",
        "theorem",
        "however",
        "try",
        "instead",
        "prove",
        "x",
        "x",
        "in",
        "x",
        "size",
        "wp",
        "x",
        "find",
        "diagonal",
        "set",
        "defined",
        "stratified",
        "condition",
        "exists",
        "proof",
        "succeeds",
        "tell",
        "u",
        "prove",
        "lvert",
        "xrvert",
        "lvert",
        "x",
        "x",
        "in",
        "x",
        "rvert",
        "arbitrary",
        "x",
        "graph",
        "restriction",
        "singleton",
        "function",
        "tend",
        "exist",
        "would",
        "able",
        "prove",
        "cantor",
        "theorem",
        "full",
        "generality",
        "give",
        "rise",
        "endomorphism",
        "t",
        "cardinal",
        "tlvert",
        "xrvert",
        "_",
        "df",
        "lvert",
        "x",
        "x",
        "in",
        "x",
        "rvert",
        "t",
        "misbehaves",
        "connection",
        "set",
        "nf",
        "study",
        "call",
        "big",
        "opposed",
        "large",
        "large",
        "cardinal",
        "zf",
        "collection",
        "like",
        "universal",
        "set",
        "set",
        "cardinal",
        "set",
        "ordinal",
        "collection",
        "denoted",
        "expression",
        "zflike",
        "theory",
        "pick",
        "proper",
        "class",
        "lvert",
        "xrvert",
        "lvert",
        "x",
        "x",
        "in",
        "x",
        "rvert",
        "say",
        "x",
        "cantorian",
        "singleton",
        "function",
        "restricted",
        "x",
        "exists",
        "say",
        "x",
        "strongly",
        "cantorian",
        "set",
        "whose",
        "size",
        "concrete",
        "natural",
        "number",
        "strongly",
        "cantorian",
        "set",
        "frege",
        "natural",
        "number",
        "cantorian",
        "assertion",
        "strongly",
        "cantorian",
        "implies",
        "consistency",
        "nf",
        "plausibly",
        "argued",
        "bizarre",
        "behaviour",
        "t",
        "function",
        "bizarre",
        "connection",
        "big",
        "set",
        "paradox",
        "bubbling",
        "assertion",
        "effect",
        "t",
        "wellbehaved",
        "strong",
        "consistency",
        "strength",
        "orey",
        "play",
        "nf",
        "study",
        "kind",
        "rôle",
        "large",
        "cardinal",
        "axiom",
        "play",
        "zflike",
        "system",
        "indeed",
        "exact",
        "equivalent",
        "t",
        "assertions",
        "may",
        "look",
        "odd",
        "oddness",
        "skindeep",
        "actually",
        "expressing",
        "mathematics",
        "happens",
        "zf",
        "unfamiliar",
        "formalisation"
    ]
}