{
    "main_text": "Five Theories of Quotation || The Demonstrative Theory of Quotation\n3.3 The Demonstrative Theory of Quotation\n\nThe seminal paper on quotation in the twentieth century is, by almost\nuniversal consensus, Davidson’s ‘Quotation’ (1979).\nIt is without comparison the most discussed and influential paper on\nthe subject. The view Davidson defends is called the Demonstrative\nTheory. (It is also called the Paratactic Theory, though we shall use\nthe former label in our discussion.) The Demonstrative Theory is\npresented in the final pages of ‘Quotation’ and the key\npassages are\n these:[7]\n\n\n…quotation marks…help refer to a shape by pointing out\nsomething that has it…The singular term is the quotation marks,\nwhich may be read ‘the expression a token of which is\nhere’. (Davidson 1979, p. 90)\n\nOn my theory which we may call the demonstrative theory of quotation,\nthe inscription inside does not refer to anything at all, nor is it\npart of any expression that does. Rather it is the quotation marks\nthat do all the referring, and they help to refer to a shape by\npointing out something that has it. (Davidson 1979, p. 90)\n\nQuotation marks could be warped so as to remove the quoted material\nfrom a sentence in which they play no semantic role. Thus instead\nof:\n\n‘Alice swooned’ is a sentence.\n\n\nwe could write:\n\nAlice swooned. The expression of which this is a token is a sentence.\n (Davidson 1979, p. 90)\n\n\nThe Demonstrative Theory has three central components. First, the\nquotation marks are treated as contributing a definite description\ncontaining a demonstrative to sentences in which they occur, i.e., the\nquotation marks in (4) become ‘The expression of which this is a\ntoken’, as in (19):\n\n(4)\n‘Bachelor’ has eight letters.\n(19)\nBachelor. The expression of which that is a token has eight\nletters.\n\n\nSecond, in the logical form of a sentence containing a quotation, the\ntoken that occurs between the two quotation marks in the surface\nsyntax is displaced, so to speak, from the sentence containing the\nquotation. What occurs between the quotation marks in the surface\nsyntax is not part of the sentence in which those quotation marks\noccur. Having been displaced from its surface syntactic position, it\nserves as an object apt for demonstrative reference (An analogy: if I\nutter ‘consider the word ‘apples’.’,\n‘apples’ becomes available for demonstrative reference, as\nwhen I continue ‘It is an English word.’)\n\nThird, utterances of quotation marks, by virtue of having a\ndemonstrative/indexical ingredient, refer to the expression\ninstantiated by the demonstrated token, i.e., the expression\ninstantiated by the token that in surface syntax sits between the\nquotation marks.\n3.3.1 Strengths of the Demonstrative Theory\n\nThe Demonstrative Theory is attractive for at least five reasons.\nFirst, to grasp the function of quotation marks is to acquire a\ncapacity with infinite applications (BQ5). The Demonstrative Theory\nexplains why: there’s no limit to the kinds of entities we can\ndemonstrate. Hence, (BQ5) is explained without making quotation a\nproductive device (for elaboration see Cappelen and Lepore 1997b).\n\nSecond, opacity is explained (BQ1): There’s no reason to think\nthat two sentences demonstrating different objects will have the same\ntruth-value. (4) and (8) demonstrate different objects, so\nthere’s no more reason to think the move from (4) to (8) is\ntruth preserving than there is to think that the move from (20) to\n(21) is:\n\n(20)\nThat’s nice.\n(21)\nThat’s nice.\n\n\nThird, we have an elegant explanation of mixed quotation, i.e., we can\nexplain (BQ6). Davidson says:\n\nI said that for the demonstrative theory the quoted material was no\npart, semantically, of the quoting sentence. But this was stronger\nthan necessary or desirable. The device of pointing can be used on\nwhatever is in range of the pointer, and there is no reason why an\ninscription in active use can’t be ostended in the process of\nmentioning an expression. (Davidson 1979, p. 91)\n\n\nThis, according to Davidson, is what goes on in (12). A token that is\nbeing used for one purpose is at the same time demonstrated for\nanother: ‘Any token may serve as target for the arrows of\nquotation, so in particular a quoting sentence may after all by chance\ncontain a token with the shape needed for the purposes of\nquotation’ (Davidson 1979, pp. 90–91; cf., also, Cappelen\nand Lepore 1997b). On this view, (12) is understood as (22). (Note:\nthe ‘these’ in (22) is accompanied by a pointing or\nindexing to the token of Quine’s words.)\n\n(12)\nQuine said that quotation ‘has a certain anomalous\nfeature’\n(22)\nQuine said, using words of which these are a token, that quotation\nhas a certain anomalous\n feature.[8]\n\n\n\nFourth, there is no mystery about how to introduce new vocabulary;\nsince there’s no limit to what can be demonstrated,\nthere’s no limit to what can be quoted. (BQ3) is explained.\n\nFinally, quantifying-in is obviously ruled out, since the quoted token\nis placed outside the quoting sentence, i.e., the Demonstrative Theory\ncan explain (BQ2).\n\nThe Demonstrative Theory is both bold and radical. It triggered an\nentire cottage industry devoted to criticizing and defending it. For\nproponents, see, for example, Partee 1973; Garcia-Carpintero 1994,\n2017, 2018; Cappelen and Lepore 1997b; McCullagh 2007; and Predelli\n2008; for critics, see just about anyone else writing on quotation\nafter 1979.\n3.3.2 Weaknesses of the Demonstrative Theory\n\nIn what follows we present five criticisms of the Demonstrative\nTheory. Needless to say, the list is not exhaustive (e.g., see\nSorensen 2008 and Saka 2011b on the problem of empty quotation), and\nindeed, each objection has triggered lively discussion which space\nlimitations prohibit our taking up here.\n\nObjection 1. If the Demonstrative Theory were\ncorrect, it should be possible for (4) to demonstrate, e.g., a\npenguin.\n\nHere is an argument that mimics a range of objections raised against\nDavidson’s account of the semantics for indirect reports (Burge\n1986, Stainton\n 1999).[9]\n\nRecall that according to Davidson the logical form of (4) is (19).\n\n(4)\n‘Bachelor’ has eight letters.\n(19)\nBachelor. The expression of which that is a token has eight\nletters.\n\n\n(19) contains a demonstrative and demonstratives refer to whatever is\ndemonstrated with their use. What is demonstrated on a given occasion\ndepends on the speaker (either the demonstration or the intention or\nsome combination of the two). It should be possible, then, for a\nspeaker to utter (4) and not demonstrate the exhibited token\nof ‘bachelor’. That is to say, if there really is a\ndemonstrative in (19), that demonstrative should have the same kind of\nfreedom that other demonstratives have: it should be able to refer to,\nfor example, a nearby penguin. Of course, no utterance of (4) makes\nreference to a penguin. So the Demonstrative Theory is\n wrong.[10]\n (For replies to this objection see Cappelen and Lepore 1999b.)\n\nObjection 2. The Problem of Relevant\nFeatures\n\nAccording to Davidson, a quotation refers to an expression indirectly,\nby referring to a token that instantiates that expression. Davidson\nthinks expressions are shapes or patterns (see\nDavidson 1979, p. 90). A problem for this view is that any one token\ninstantiates indefinitely many distinct shapes or patterns, i.e. many\ndifferent expressions. So how, on Davidson’s view, do we get\nfrom a particular token to a unique type, i.e., from a token to an\nexpression?\n\nJonathan Bennett formulates the problem as follows:\n\nAny displayed token has countless features, and so it is of countless\ndifferent kinds. Therefore, to say the inscription-types instantiated\nhere: Sheep or what amounts to the same thing, the inscription-type\neach token of which is like this: Sheep is to leave things open to an\nintolerable degree. How do we narrow it down? That is what I call the\nproblem of relevant features. It urgently confronts the demonstrative\ntheory which must be amplified so as to meet it. (Bennett 1988, p.\n403, see also Washington 1992, pp. 595–7.)\n\n\nA related worry is this: Read (4) out loud. It seems obvious that a\nspoken utterance says (makes) the same claim as a written utterance of\n(4). On the Demonstrative Theory it is unclear why this should be so:\nthe spoken utterance demonstrates a vocal pattern, and the written\nutterance a graphemic pattern. They seem to be attributing properties\nto different objects. (Several suggestions are on offer for how to\namend the Demonstrative Theory in this respect: cf., Garcia-Carpintero\n1994, Cappelen and Lepore 1997b, 1999c, and Davidson 1999.)\n\nObjection 3. The Problem of Missing Quotation\nMarks\n\nAccording to Davidson, quotation marks are what are used to do the\nreferring. They are descriptions containing demonstratives whose uses\nrefer to whatever pattern is instantiated by the demonstrated token.\nThis makes the presence of quotation marks essential. Much recent work\non quotation argues that we can quote (or do something quote-like)\nwithout quotation marks and that a theory of quotation should\nbe capable of explaining how quotation can take place in the absence\nof quotation marks. Here is Reimer’s version of this\nobjection:\n\nConsider the following sentence:\n\n(7)\nBachelor has eight letters.\n\n\nHere, we have a case in which an expression is quoted—not by\nmeans of quotation marks—but by means of italicization. But\nsurely it would be absurd to suppose (consistently with\nDavidson’s view) that the italicization of (7)’s subject\nterm is itself a demonstrative expression! (Reimer 1996, p. 135)\n\nThe same idea is expressed by Washington (1992):\n\nIn conversation, oral promptings (‘Quote-unquote’) or\nfinger-dance quotes can often be omitted without impairing the\nintelligibility or well-formedness of the utterance. When I introduce\nmyself, I do not say ‘My name is quote-unquote Corey,’ nor\ndo I make little finger gestures or even use different intonation in\norder to show that it is my name and not myself that is being talked\nabout. (Washington 1992, p. 588; Saka 1998, pp. 118–19; Recanati\n2001; and Benbaji 2004a, 2004b.)\n\n\nThe Demonstrative Theory depends on the presence of quotation marks\n(inasmuch as they are what get used to do the referring), so if\nquotation can occur without quotation marks (as in the Reimer and\nWashington cases), it’s hard to see how the Demonstrative Theory\nis adequate.\n\nProponents have been unimpressed. Consider an utterance of (6):\n\n(6)\nMy name is Donald.\n\n\nSeveral possible replies can be made by proponents of the\nDemonstrative Theory. One thing a Demonstrative Theorist might say is\nthat there are no missing quotation marks in (6): they are in the\nlogical form of the sentence, not in its surface syntax.\n\nAlternatively, quotation marks for an utterance of (6) could be\ngenerated as conversational or conventional implicatures. (He\ncan’t be saying that Donald, the person, is his name as he knows\nthat that is false, so he must be conversationally implicating that\nthe expression of which he used a token is a name (cf.\nGarcia-Carpintero 1994, pp. 262–63)). Or perhaps we could appeal\nto the distinction between semantic reference and speaker reference.\n(6) is grammatically correct but false; nonetheless, someone can\nsucceed in communicating something true about Donald’s name if\nhe succeeds in conveying to his audience his intention to refer to it\n(cf., Gomez-Torrente 2001).\n\nFinally, a Demonstrative Theorist can argue that these other\nquotation-like phenomena are just that—quotation-like. They\nrequire a separate treatment. There’s no need for a unified\ntheory (cf., Cappelen and Lepore 2003).\n\nObjection 4. The Problem of Iteration\n\nThe Demonstrative Theory seems to have difficulty dealing with\niterated quotation. (24) refers to the quotation in (23):\n\n(23)\n‘Smooth’ is an English expression.\n(24)\n“Smooth” is an English expression.\n\n\nThe Demonstrative Theory’s account for (23) is (25).\n\n(25)\nSmooth. The expression of which that is a token is an English\nexpression\n\n\nHow, then, can the account accommodate (24)? (24), after all, includes\ntwo sets of quotation marks. It might seem like the\nDemonstrative Theory would have to treat it as the ungrammatical (26)\nor the unintelligible (27).\n\n(26)\nSmooth. That that is an English expression.\n(27)\nSmooth. That. That is an English expression.\n\n\nThis objection has been raised by Saka (1998, pp. 119–20),\nReimer (1996), and Washington (1992).\n\nIn response, Demonstrative Theorists insist that quotations are not\niterative. On this topic, Cappelen and Lepore write:\n\nQuoted expressions are exhibited so that speakers can talk about the\npatterns (according to Davidson) they instantiate. The semantic\nproperties of the tokens are not in active use; they are semantically\ninert…So, quotation marks within quotation marks are\nsemantically inert. (Cappelen and Lepore 1997b, pp. 439–40)\n\n\nFor further discussion of whether quotation is a genuinely iterative\ndevice, see Cappelen and Lepore (1999a) and Saka (2013).\n\nObjection 5. The Problem of Open Quotation:\nDangling Singular Terms\n\nRecanati (2001) focuses on cases where quoted expressions do not serve\nas noun phrases in sentences. He has in mind cases like (29) and\n(30):\n\n(29)\nStop that John! ‘Nobody likes me’, ‘I am\nmiserable’…\n\nDon’t you think you exaggerate a bit?\n(30)\nThe story-teller cleared his throat and started talking.\n‘Once upon a time, there was a beautiful princess named\nArabella. She loved snakes and always had a couple of pythons around\nher…’\n\n\nIn these cases it looks like the Demonstrative Theory would have to\npostulate a dangling singular term, something like (31) or (32):\n\n(31)\nStop that John. That. Nobody likes me. That. I am miserable.\n… Don’t you think you exaggerate a bit?\n(32)\nThe story-teller cleared his throat and started talking. That.\nOnce upon a time, there was a beautiful princess named Arabella. She\nloved snakes and always had a couple of pythons around her…\n\n\n\nIn response to the idea that (29) is elliptical for (33),\n\n(33)\nStop that John! You say ‘Nobody likes me’,\n‘I am miserable’ … Don’t you think you\nexaggerate a bit?\n\n\nRecanati says:\n\nI deny that [29] and [33] are synonymous. Nor are there any grounds\nfor postulating ellipsis here except the desire to save the theory in\nthe face of obvious counterexamples (Recanati 2001, p. 654).\n\n",
    "section_title": "3.3 The Demonstrative Theory of Quotation",
    "entry_title": "Quotation",
    "hierarchy_title": "Quotation || Five Theories of Quotation || The Demonstrative Theory of Quotation",
    "tokenized_text": [
        "five",
        "theory",
        "quotation",
        "demonstrative",
        "theory",
        "quotation",
        "demonstrative",
        "theory",
        "quotation",
        "seminal",
        "paper",
        "quotation",
        "twentieth",
        "century",
        "almost",
        "universal",
        "consensus",
        "davidson",
        "quotation",
        "without",
        "comparison",
        "discussed",
        "influential",
        "paper",
        "subject",
        "view",
        "davidson",
        "defends",
        "called",
        "demonstrative",
        "theory",
        "also",
        "called",
        "paratactic",
        "theory",
        "though",
        "shall",
        "use",
        "former",
        "label",
        "discussion",
        "demonstrative",
        "theory",
        "presented",
        "final",
        "page",
        "quotation",
        "key",
        "passage",
        "quotation",
        "markshelp",
        "refer",
        "shape",
        "pointing",
        "something",
        "itthe",
        "singular",
        "term",
        "quotation",
        "mark",
        "may",
        "read",
        "expression",
        "token",
        "davidson",
        "p",
        "theory",
        "may",
        "call",
        "demonstrative",
        "theory",
        "quotation",
        "inscription",
        "inside",
        "refer",
        "anything",
        "part",
        "expression",
        "rather",
        "quotation",
        "mark",
        "referring",
        "help",
        "refer",
        "shape",
        "pointing",
        "something",
        "davidson",
        "p",
        "quotation",
        "mark",
        "could",
        "warped",
        "remove",
        "quoted",
        "material",
        "sentence",
        "play",
        "semantic",
        "role",
        "thus",
        "instead",
        "alice",
        "swooned",
        "sentence",
        "could",
        "write",
        "alice",
        "swooned",
        "expression",
        "token",
        "sentence",
        "davidson",
        "p",
        "demonstrative",
        "theory",
        "three",
        "central",
        "component",
        "first",
        "quotation",
        "mark",
        "treated",
        "contributing",
        "definite",
        "description",
        "containing",
        "demonstrative",
        "sentence",
        "occur",
        "ie",
        "quotation",
        "mark",
        "become",
        "expression",
        "token",
        "bachelor",
        "eight",
        "letter",
        "bachelor",
        "expression",
        "token",
        "eight",
        "letter",
        "second",
        "logical",
        "form",
        "sentence",
        "containing",
        "quotation",
        "token",
        "occurs",
        "two",
        "quotation",
        "mark",
        "surface",
        "syntax",
        "displaced",
        "speak",
        "sentence",
        "containing",
        "quotation",
        "occurs",
        "quotation",
        "mark",
        "surface",
        "syntax",
        "part",
        "sentence",
        "quotation",
        "mark",
        "occur",
        "displaced",
        "surface",
        "syntactic",
        "position",
        "serf",
        "object",
        "apt",
        "demonstrative",
        "reference",
        "analogy",
        "utter",
        "consider",
        "word",
        "apple",
        "apple",
        "becomes",
        "available",
        "demonstrative",
        "reference",
        "continue",
        "english",
        "word",
        "third",
        "utterance",
        "quotation",
        "mark",
        "virtue",
        "demonstrativeindexical",
        "ingredient",
        "refer",
        "expression",
        "instantiated",
        "demonstrated",
        "token",
        "ie",
        "expression",
        "instantiated",
        "token",
        "surface",
        "syntax",
        "sits",
        "quotation",
        "mark",
        "strength",
        "demonstrative",
        "theory",
        "demonstrative",
        "theory",
        "attractive",
        "least",
        "five",
        "reason",
        "first",
        "grasp",
        "function",
        "quotation",
        "mark",
        "acquire",
        "capacity",
        "infinite",
        "application",
        "bq",
        "demonstrative",
        "theory",
        "explains",
        "limit",
        "kind",
        "entity",
        "demonstrate",
        "hence",
        "bq",
        "explained",
        "without",
        "making",
        "quotation",
        "productive",
        "device",
        "elaboration",
        "see",
        "cappelen",
        "lepore",
        "b",
        "second",
        "opacity",
        "explained",
        "bq",
        "reason",
        "think",
        "two",
        "sentence",
        "demonstrating",
        "different",
        "object",
        "truthvalue",
        "demonstrate",
        "different",
        "object",
        "reason",
        "think",
        "move",
        "truth",
        "preserving",
        "think",
        "move",
        "nice",
        "nice",
        "third",
        "elegant",
        "explanation",
        "mixed",
        "quotation",
        "ie",
        "explain",
        "bq",
        "davidson",
        "say",
        "said",
        "demonstrative",
        "theory",
        "quoted",
        "material",
        "part",
        "semantically",
        "quoting",
        "sentence",
        "stronger",
        "necessary",
        "desirable",
        "device",
        "pointing",
        "used",
        "whatever",
        "range",
        "pointer",
        "reason",
        "inscription",
        "active",
        "use",
        "ostended",
        "process",
        "mentioning",
        "expression",
        "davidson",
        "p",
        "according",
        "davidson",
        "go",
        "token",
        "used",
        "one",
        "purpose",
        "time",
        "demonstrated",
        "another",
        "token",
        "may",
        "serve",
        "target",
        "arrow",
        "quotation",
        "particular",
        "quoting",
        "sentence",
        "may",
        "chance",
        "contain",
        "token",
        "shape",
        "needed",
        "purpose",
        "quotation",
        "davidson",
        "pp",
        "cf",
        "also",
        "cappelen",
        "lepore",
        "b",
        "view",
        "understood",
        "note",
        "accompanied",
        "pointing",
        "indexing",
        "token",
        "quine",
        "word",
        "quine",
        "said",
        "quotation",
        "certain",
        "anomalous",
        "feature",
        "quine",
        "said",
        "using",
        "word",
        "token",
        "quotation",
        "certain",
        "anomalous",
        "feature",
        "fourth",
        "mystery",
        "introduce",
        "new",
        "vocabulary",
        "since",
        "limit",
        "demonstrated",
        "limit",
        "quoted",
        "bq",
        "explained",
        "finally",
        "quantifyingin",
        "obviously",
        "ruled",
        "since",
        "quoted",
        "token",
        "placed",
        "outside",
        "quoting",
        "sentence",
        "ie",
        "demonstrative",
        "theory",
        "explain",
        "bq",
        "demonstrative",
        "theory",
        "bold",
        "radical",
        "triggered",
        "entire",
        "cottage",
        "industry",
        "devoted",
        "criticizing",
        "defending",
        "proponent",
        "see",
        "example",
        "partee",
        "garciacarpintero",
        "cappelen",
        "lepore",
        "b",
        "mccullagh",
        "predelli",
        "critic",
        "see",
        "anyone",
        "else",
        "writing",
        "quotation",
        "weakness",
        "demonstrative",
        "theory",
        "follows",
        "present",
        "five",
        "criticism",
        "demonstrative",
        "theory",
        "needle",
        "say",
        "list",
        "exhaustive",
        "eg",
        "see",
        "sorensen",
        "saka",
        "b",
        "problem",
        "empty",
        "quotation",
        "indeed",
        "objection",
        "triggered",
        "lively",
        "discussion",
        "space",
        "limitation",
        "prohibit",
        "taking",
        "objection",
        "demonstrative",
        "theory",
        "correct",
        "possible",
        "demonstrate",
        "eg",
        "penguin",
        "argument",
        "mimic",
        "range",
        "objection",
        "raised",
        "davidson",
        "account",
        "semantics",
        "indirect",
        "report",
        "burge",
        "stainton",
        "recall",
        "according",
        "davidson",
        "logical",
        "form",
        "bachelor",
        "eight",
        "letter",
        "bachelor",
        "expression",
        "token",
        "eight",
        "letter",
        "contains",
        "demonstrative",
        "demonstrative",
        "refer",
        "whatever",
        "demonstrated",
        "use",
        "demonstrated",
        "given",
        "occasion",
        "depends",
        "speaker",
        "either",
        "demonstration",
        "intention",
        "combination",
        "two",
        "possible",
        "speaker",
        "utter",
        "demonstrate",
        "exhibited",
        "token",
        "bachelor",
        "say",
        "really",
        "demonstrative",
        "demonstrative",
        "kind",
        "freedom",
        "demonstrative",
        "able",
        "refer",
        "example",
        "nearby",
        "penguin",
        "course",
        "utterance",
        "make",
        "reference",
        "penguin",
        "demonstrative",
        "theory",
        "wrong",
        "reply",
        "objection",
        "see",
        "cappelen",
        "lepore",
        "b",
        "objection",
        "problem",
        "relevant",
        "feature",
        "according",
        "davidson",
        "quotation",
        "refers",
        "expression",
        "indirectly",
        "referring",
        "token",
        "instantiates",
        "expression",
        "davidson",
        "think",
        "expression",
        "shape",
        "pattern",
        "see",
        "davidson",
        "p",
        "problem",
        "view",
        "one",
        "token",
        "instantiates",
        "indefinitely",
        "many",
        "distinct",
        "shape",
        "pattern",
        "ie",
        "many",
        "different",
        "expression",
        "davidson",
        "view",
        "get",
        "particular",
        "token",
        "unique",
        "type",
        "ie",
        "token",
        "expression",
        "jonathan",
        "bennett",
        "formulates",
        "problem",
        "follows",
        "displayed",
        "token",
        "countless",
        "feature",
        "countless",
        "different",
        "kind",
        "therefore",
        "say",
        "inscriptiontypes",
        "instantiated",
        "sheep",
        "amount",
        "thing",
        "inscriptiontype",
        "token",
        "like",
        "sheep",
        "leave",
        "thing",
        "open",
        "intolerable",
        "degree",
        "narrow",
        "call",
        "problem",
        "relevant",
        "feature",
        "urgently",
        "confronts",
        "demonstrative",
        "theory",
        "must",
        "amplified",
        "meet",
        "bennett",
        "p",
        "see",
        "also",
        "washington",
        "pp",
        "related",
        "worry",
        "read",
        "loud",
        "seems",
        "obvious",
        "spoken",
        "utterance",
        "say",
        "make",
        "claim",
        "written",
        "utterance",
        "demonstrative",
        "theory",
        "unclear",
        "spoken",
        "utterance",
        "demonstrates",
        "vocal",
        "pattern",
        "written",
        "utterance",
        "graphemic",
        "pattern",
        "seem",
        "attributing",
        "property",
        "different",
        "object",
        "several",
        "suggestion",
        "offer",
        "amend",
        "demonstrative",
        "theory",
        "respect",
        "cf",
        "garciacarpintero",
        "cappelen",
        "lepore",
        "b",
        "c",
        "davidson",
        "objection",
        "problem",
        "missing",
        "quotation",
        "mark",
        "according",
        "davidson",
        "quotation",
        "mark",
        "used",
        "referring",
        "description",
        "containing",
        "demonstrative",
        "whose",
        "us",
        "refer",
        "whatever",
        "pattern",
        "instantiated",
        "demonstrated",
        "token",
        "make",
        "presence",
        "quotation",
        "mark",
        "essential",
        "much",
        "recent",
        "work",
        "quotation",
        "argues",
        "quote",
        "something",
        "quotelike",
        "without",
        "quotation",
        "mark",
        "theory",
        "quotation",
        "capable",
        "explaining",
        "quotation",
        "take",
        "place",
        "absence",
        "quotation",
        "mark",
        "reimer",
        "version",
        "objection",
        "consider",
        "following",
        "sentence",
        "bachelor",
        "eight",
        "letter",
        "case",
        "expression",
        "quotednot",
        "mean",
        "quotation",
        "marksbut",
        "mean",
        "italicization",
        "surely",
        "would",
        "absurd",
        "suppose",
        "consistently",
        "davidson",
        "view",
        "italicization",
        "subject",
        "term",
        "demonstrative",
        "expression",
        "reimer",
        "p",
        "idea",
        "expressed",
        "washington",
        "conversation",
        "oral",
        "prompting",
        "quoteunquote",
        "fingerdance",
        "quote",
        "often",
        "omitted",
        "without",
        "impairing",
        "intelligibility",
        "wellformedness",
        "utterance",
        "introduce",
        "say",
        "name",
        "quoteunquote",
        "corey",
        "make",
        "little",
        "finger",
        "gesture",
        "even",
        "use",
        "different",
        "intonation",
        "order",
        "show",
        "name",
        "talked",
        "washington",
        "p",
        "saka",
        "pp",
        "recanati",
        "benbaji",
        "a",
        "b",
        "demonstrative",
        "theory",
        "depends",
        "presence",
        "quotation",
        "mark",
        "inasmuch",
        "get",
        "used",
        "referring",
        "quotation",
        "occur",
        "without",
        "quotation",
        "mark",
        "reimer",
        "washington",
        "case",
        "hard",
        "see",
        "demonstrative",
        "theory",
        "adequate",
        "proponent",
        "unimpressed",
        "consider",
        "utterance",
        "name",
        "donald",
        "several",
        "possible",
        "reply",
        "made",
        "proponent",
        "demonstrative",
        "theory",
        "one",
        "thing",
        "demonstrative",
        "theorist",
        "might",
        "say",
        "missing",
        "quotation",
        "mark",
        "logical",
        "form",
        "sentence",
        "surface",
        "syntax",
        "alternatively",
        "quotation",
        "mark",
        "utterance",
        "could",
        "generated",
        "conversational",
        "conventional",
        "implicatures",
        "saying",
        "donald",
        "person",
        "name",
        "know",
        "false",
        "must",
        "conversationally",
        "implicating",
        "expression",
        "used",
        "token",
        "name",
        "cf",
        "garciacarpintero",
        "pp",
        "perhaps",
        "could",
        "appeal",
        "distinction",
        "semantic",
        "reference",
        "speaker",
        "reference",
        "grammatically",
        "correct",
        "false",
        "nonetheless",
        "someone",
        "succeed",
        "communicating",
        "something",
        "true",
        "donald",
        "name",
        "succeeds",
        "conveying",
        "audience",
        "intention",
        "refer",
        "cf",
        "gomeztorrente",
        "finally",
        "demonstrative",
        "theorist",
        "argue",
        "quotationlike",
        "phenomenon",
        "thatquotationlike",
        "require",
        "separate",
        "treatment",
        "need",
        "unified",
        "theory",
        "cf",
        "cappelen",
        "lepore",
        "objection",
        "problem",
        "iteration",
        "demonstrative",
        "theory",
        "seems",
        "difficulty",
        "dealing",
        "iterated",
        "quotation",
        "refers",
        "quotation",
        "smooth",
        "english",
        "expression",
        "smooth",
        "english",
        "expression",
        "demonstrative",
        "theory",
        "account",
        "smooth",
        "expression",
        "token",
        "english",
        "expression",
        "account",
        "accommodate",
        "includes",
        "two",
        "set",
        "quotation",
        "mark",
        "might",
        "seem",
        "like",
        "demonstrative",
        "theory",
        "would",
        "treat",
        "ungrammatical",
        "unintelligible",
        "smooth",
        "english",
        "expression",
        "smooth",
        "english",
        "expression",
        "objection",
        "raised",
        "saka",
        "pp",
        "reimer",
        "washington",
        "response",
        "demonstrative",
        "theorist",
        "insist",
        "quotation",
        "iterative",
        "topic",
        "cappelen",
        "lepore",
        "write",
        "quoted",
        "expression",
        "exhibited",
        "speaker",
        "talk",
        "pattern",
        "according",
        "davidson",
        "instantiate",
        "semantic",
        "property",
        "token",
        "active",
        "use",
        "semantically",
        "inertso",
        "quotation",
        "mark",
        "within",
        "quotation",
        "mark",
        "semantically",
        "inert",
        "cappelen",
        "lepore",
        "b",
        "pp",
        "discussion",
        "whether",
        "quotation",
        "genuinely",
        "iterative",
        "device",
        "see",
        "cappelen",
        "lepore",
        "a",
        "saka",
        "objection",
        "problem",
        "open",
        "quotation",
        "dangling",
        "singular",
        "term",
        "recanati",
        "focus",
        "case",
        "quoted",
        "expression",
        "serve",
        "noun",
        "phrase",
        "sentence",
        "mind",
        "case",
        "like",
        "stop",
        "john",
        "nobody",
        "like",
        "miserable",
        "think",
        "exaggerate",
        "bit",
        "storyteller",
        "cleared",
        "throat",
        "started",
        "talking",
        "upon",
        "time",
        "beautiful",
        "princess",
        "named",
        "arabella",
        "loved",
        "snake",
        "always",
        "couple",
        "python",
        "around",
        "her",
        "case",
        "look",
        "like",
        "demonstrative",
        "theory",
        "would",
        "postulate",
        "dangling",
        "singular",
        "term",
        "something",
        "like",
        "stop",
        "john",
        "nobody",
        "like",
        "miserable",
        "think",
        "exaggerate",
        "bit",
        "storyteller",
        "cleared",
        "throat",
        "started",
        "talking",
        "upon",
        "time",
        "beautiful",
        "princess",
        "named",
        "arabella",
        "loved",
        "snake",
        "always",
        "couple",
        "python",
        "around",
        "her",
        "response",
        "idea",
        "elliptical",
        "stop",
        "john",
        "say",
        "nobody",
        "like",
        "miserable",
        "think",
        "exaggerate",
        "bit",
        "recanati",
        "say",
        "deny",
        "synonymous",
        "ground",
        "postulating",
        "ellipsis",
        "except",
        "desire",
        "save",
        "theory",
        "face",
        "obvious",
        "counterexample",
        "recanati",
        "p"
    ]
}