{
    "main_text": "The Intuition/Deduction Thesis\n2. The Intuition/Deduction Thesis\n\nThe Intuition/Deduction thesis claims that we can know some\npropositions by intuition and still more by deduction. Since\ntraditionally this thesis was thought to be rejected by empiricists\nand adopted only by rationalists, it is useful to become more familiar\nwith it. In a very narrow sense, only rationalists seem to adopt it.\nHowever, the current consensus is that most empiricists (e.g., Locke,\nHume, Reid) have been willing to accept a version of the thesis,\nnamely inasmuch as it is restricted to propositions solely about the\nrelations among our own concepts. We can, they agree, know by\nintuition that our concept of God includes our concept of omniscience.\nJust by examining the concepts, we can intellectually grasp that the\none includes the other. The debate between rationalists and\nempiricists is joined when the former assert, and the latter deny, the\nIntuition/Deduction thesis with regard to propositions that contain\nsubstantive information about the external world. Rationalists, such\nas Descartes, have claimed that we can know by intuition and deduction\nthat God exists and created the world, that our mind and body are\ndistinct substances, and that the angles of a triangle equal two right\nangles, where all of these claims are truths about an external reality\nindependent of our thought. Such substantive versions of the\nIntuition/Deduction thesis are our concern in this section.\n\nOne defense of the Intuition/Deduction thesis assumes that we know\nsome substantive external world truths, adds an analysis of what\nknowledge requires, and concludes that our knowledge must result from\nintuition and deduction. Rationalists and empiricists alike claim that\ncertainty is required for scientia (which is a type of\nabsolute knowledge of the necessary connections that would explain why\ncertain things are a certain way) and that certainty about the\nexternal world is beyond what empirical evidence can provide.\nEmpiricists seem happy to then conclude that the type of knowledge of\nthe external world that we can acquire does not have this high degree\nof certainty and is, thus, not scientia. This is because we\ncan never be sure our sensory impressions are not part of a dream or a\nmassive, demon orchestrated, deception. A rationalist like Descartes\nof the Meditations, claims that only intuition can provide\nthe certainty needed for such knowledge. This, after his arguing in\nthe Rules that, when we “review all the actions of the\nintellect by means of which we are able to arrive at a knowledge of\nthings with no fear of being mistaken,” we “recognize only\ntwo: intuition and deduction” (Rules, Rule III,\np. 3).\n\nThis line of argument is one of the least compelling in the\nrationalist arsenal. First, the assumption that knowledge requires\ncertainty comes at a heavy cost, as it rules out so much of what we\ncommonly take ourselves to know. Second, as many contemporary\nrationalists accept, intuition is not always a source of certain\nknowledge. The possibility of a deceiver gives us a reason to doubt\nour intuitions as well as our empirical beliefs. For all we know, a\ndeceiver might cause us to intuit false propositions, just as one\nmight cause us to have perceptions of nonexistent objects.\nDescartes’s classic way of meeting this challenge in the\nMeditations is to argue that we can know with certainty that\nno such deceiver interferes with our intuitions and deductions. They\nare infallible, as God guarantees their truth. The problem, known as\nthe Cartesian Circle, is that Descartes’s account of how we gain\nthis knowledge begs the question, by attempting to deduce the\nconclusion that all our intuitions are true from intuited premises.\nMoreover, his account does not touch a remaining problem that he\nhimself notes (Rules, Rule VII, p. 7): Deductions of any\nappreciable length rely on our fallible memory.\n\nA more plausible argument for the Intuition/Deduction thesis again\nassumes that we know some particular, external world truths, and then\nappeals to the nature of what we know, rather than to the nature of\nknowledge itself, to argue that our knowledge must result from\nintuition and deduction. Leibniz, in New Essays, tells us the\nfollowing:\n\nThe senses, although they are necessary for all our actual knowledge,\nare not sufficient to give us the whole of it, since the senses never\ngive anything but instances, that is to say particular or individual\ntruths. Now all the instances which confirm a general truth, however\nnumerous they may be, are not sufficient to establish the universal\nnecessity of this same truth, for it does not follow that what\nhappened before will happen in the same way again. … From which\nit appears that necessary truths, such as we find in pure mathematics,\nand particularly in arithmetic and geometry, must have principles\nwhose proof does not depend on instances, nor consequently on the\ntestimony of the senses, although without the senses it would never\nhave occurred to us to think of them… (New Essays,\nPreface, pp. 150–151)\n\n\nLeibniz goes on to describe our mathematical knowledge as\n“innate,” and his argument is more commonly directed to\nsupport the Innate Knowledge thesis rather than the\nIntuition/Deduction thesis. For our purposes here, we can relate it to\nthe latter, however: We have substantive knowledge about the external\nworld in mathematics, and what we know in that area, we know to be\nnecessarily true. Experience cannot warrant beliefs about what is\nnecessarily the case. Hence, experience cannot be the source of our\nknowledge. The best explanation of our knowledge is that we gain it by\nintuition and deduction. Leibniz mentions logic, metaphysics, and\nmorals as other areas in which our knowledge similarly outstrips what\nexperience can provide. Judgments in logic and metaphysics involve\nforms of necessity beyond what experience can support. Judgments in\nmorals involve a form of obligation or value that lies beyond\nexperience, which only informs us about what is the case rather than\nabout what ought to be.\n\nThe strength of this argument varies with its examples of purported\nknowledge. Insofar as we focus on controversial claims in metaphysics,\ne.g., that God exists, that our mind is a distinct substance from our\nbody, the initial premise that we know the claims is less than\ncompelling. Taken with regard to other areas, however, the argument\nclearly has legs. We know a great deal of mathematics, and what we\nknow, we know to be necessarily true. None of our experiences warrants\na belief in such necessity, and we do not seem to base our knowledge\non any experiences. The warrant that provides us with knowledge arises\nfrom an intellectual grasp of the propositions which is clearly part\nof our learning. Similarly, we seem to have such moral knowledge as\nthat, all other things being equal, it is wrong to break a promise and\nthat pleasure is intrinsically good. No empirical lesson about how\nthings are can warrant such knowledge of how they ought to be.\n\nThis argument for the Intuition/Deduction thesis raises additional\nquestions which rationalists must answer. Insofar as they maintain\nthat our knowledge of necessary truths in mathematics or elsewhere by\nintuition and deduction is substantive knowledge of the external\nworld, they owe us an account of this form of necessity. Many\nempiricists stand ready to argue that “necessity resides in the\nway we talk about things, not in the things we talk about”\n(Quine 1966, p. 174). Similarly, if rationalists claim that our\nknowledge in morals is knowledge of an objective form of obligation,\nthey owe us an account of how objective values are part of a world of\napparently valueless facts.\n\nPerhaps most of all, any defenders of the Intuition/Deduction thesis\nowe us an account of what intuition is and how it provides warranted\ntrue beliefs about the external world. What is it to intuit a\nproposition and how does that act of intuition support a warranted\nbelief? Their argument presents intuition and deduction as an\nexplanation of assumed knowledge that can’t—they\nsay—be explained by experience, but such an explanation by\nintuition and deduction requires that we have a clear understanding of\nintuition and how it supports warranted beliefs. Metaphorical\ncharacterizations of intuition as intellectual “grasping”\nor “seeing” are not enough, and if intuition is some form\nof intellectual “grasping,” it appears that all that is\ngrasped is relations among our concepts, rather than facts about the\nexternal world, as the empiricists defenders of intuition and\ndeduction argue. One current approach to the issue involves an appeal\nto Phenomenal Conservatism (Huemer 2001), the principle that if it\nseems to one as if something is the case, then one is prima facie\njustified in believing that it is so. Intuitions are then taken to be\na particular sort of seeming or appearance: “[A]n intuition that\np is a state of its seeming to one that p that is not dependent on\ninference from other beliefs and that results from thinking about p,\nas opposed to perceiving, remembering, or introspecting” (Huemer\n2005, p. 102). Just as it can visually seem or appear to one as if\nthere’s a tree outside the window, it can intellectually seem or\nappear to one as if nothing can be both entirely red and entirely\ngreen. This approach aims to demystify intuitions; they are but one\nmore form of seeming-state along with ones we gain from sense\nperception, memory, and introspection. It does not, however, tell us\nall we need to know. Any intellectual faculty, whether it be sense\nperception, memory, introspection or intuition, provides us with\nwarranted beliefs only if it is generally reliable. The reliability of\nsense perception stems from the causal connection between how external\nobjects are and how we experience them. What accounts for the\nreliability of our intuitions regarding the external world? Is our\nintuition of a particular true proposition the outcome of some causal\ninteraction between ourselves and some aspect of the world? What\naspect? What is the nature of this causal interaction? That the number\nthree is prime does not appear to cause anything, let alone our\nintuition that it is prime. As Michael Huemer (2005, p. 123) points\nout in mounting his own defense of moral intuitionism, “The\nchallenge for the moral realist, then, is to explain how it would be\nanything more than chance if my moral beliefs were true, given that I\ndo not interact with moral properties.”\n\nThese issues are made all the more pressing by the classic empiricist\nresponse to the argument. The reply is generally credited to Hume and\nbegins with a division of all true propositions into two\ncategories.\n\nAll the objects of human reason or inquiry may naturally be divided\ninto two kinds, to wit, “Relations of Ideas,” and\n“Matters of Fact.” Of the first are the sciences of\nGeometry, Algebra, and Arithmetic, and, in short, every affirmation\nwhich is either intuitively or demonstratively certain. That the\nsquare of the hypotenuse is equal to the square of the two sides is a\nproposition which expresses a relation between these figures. That\nthree times five is equal to half of thirty expresses a relation\nbetween these numbers. Propositions of this kind are discoverable by\nthe mere operation of thought, without dependence on what is anywhere\nexistent in the universe. Though there never were a circle or triangle\nin nature, the truths demonstrated by Euclid would forever retain\ntheir certainty and evidence. Matters of fact, which are the second\nobjects of human reason, are not ascertained in the same manner, nor\nis our evidence of their truth, however great, of a like nature with\nthe foregoing. The contrary of every matter of fact is still possible,\nbecause it can never imply a contradiction and is conceived by the\nmind with the same facility and distinctness as if ever so conformable\nto reality. (Enquiry, 4.1, p. 24)\n\n\nIntuition and deduction can provide us with knowledge of necessary\ntruths such as those found in mathematics and logic, but such\nknowledge is not substantive knowledge of the external world. It is\nonly knowledge of the relations of our own ideas. If the rationalist\nshifts the argument so it appeals to knowledge in morals, Hume’s\nreply is to offer an analysis of our moral concepts by which such\nknowledge is empirically gained knowledge of matters of fact.\n\nMorals and criticism are not so properly objects of the understanding\nas of taste and sentiment. Beauty, whether moral or natural, is felt\nmore properly than perceived. Or if we reason concerning it and\nendeavor to fix the standard, we regard a new fact, to wit, the\ngeneral taste of mankind, or some other fact which may be the object\nof reasoning and inquiry. (Enquiry, 12.3, p. 122)\n\n\nIf the rationalist appeals to our knowledge in metaphysics to support\nthe argument, Hume denies that we have such knowledge.\n\nIf we take in our hand any volume--of divinity or school metaphysics,\nfor instance--let us ask, Does it contain any abstract reasoning\nconcerning quantity or number? No. Does it contain any experimental\nreasoning concerning matter of fact and existence? No. Commit it then\nto the flames, for it can contain nothing but sophistry and illusion.\n(Enquiry, 12.3, p. 123)\n\n\nAn updated version of this general empiricist reply, with an increased\nemphasis on language and the nature of meaning, is given in the\ntwentieth-century by A. J. Ayer’s version of logical positivism.\nAdopting positivism’s verification theory of meaning, Ayer\nassigns every cognitively meaningful sentence to one of two\ncategories: either it is a tautology, and so true solely by virtue of\nthe meaning of its terms and provides no substantive information about\nthe world, or it is open to empirical verification. There is, then, no\nroom for knowledge about the external world by intuition or\ndeduction.\n\nThere can be no a priori knowledge of reality. For …\nthe truths of pure reason, the propositions which we know to be valid\nindependently of all experience, are so only in virtue of their lack\nof factual content … [By contrast] empirical propositions are\none and all hypotheses which may be confirmed or discredited in actual\nsense experience. (Ayer 1952, pp. 86; 93–94)\n\n\nThe rationalists’ argument for the Intuition/Deduction thesis\ngoes wrong at the start, according to empiricists, by assuming that we\ncan have substantive knowledge of the external world that outstrips\nwhat experience can warrant. We cannot.\n\nThis empiricist reply faces challenges of its own. Our knowledge of\nmathematics seems to be about something more than our own concepts.\nOur knowledge of moral judgments seems to concern not just how we feel\nor act but how we ought to behave. The general principles that provide\na basis for the empiricist view, e.g. Hume’s overall account of\nour ideas, the Verification Principle of Meaning, are problematic in\ntheir own right.\n\nIn all, rationalists have an argument for the Intuition/Deduction\nthesis relative to our substantive knowledge of the external world,\nbut its success rests on how well they can answer questions about the\nnature and epistemic force of intuition made all the more pressing by\nthe classic empiricist reply.\n",
    "section_title": "2. The Intuition/Deduction Thesis",
    "entry_title": "Rationalism vs. Empiricism",
    "hierarchy_title": "Rationalism vs. Empiricism || The Intuition/Deduction Thesis",
    "tokenized_text": [
        "intuitiondeduction",
        "thesis",
        "intuitiondeduction",
        "thesis",
        "intuitiondeduction",
        "thesis",
        "claim",
        "know",
        "proposition",
        "intuition",
        "still",
        "deduction",
        "since",
        "traditionally",
        "thesis",
        "thought",
        "rejected",
        "empiricist",
        "adopted",
        "rationalist",
        "useful",
        "become",
        "familiar",
        "narrow",
        "sense",
        "rationalist",
        "seem",
        "adopt",
        "however",
        "current",
        "consensus",
        "empiricist",
        "eg",
        "locke",
        "hume",
        "reid",
        "willing",
        "accept",
        "version",
        "thesis",
        "namely",
        "inasmuch",
        "restricted",
        "proposition",
        "solely",
        "relation",
        "among",
        "concept",
        "agree",
        "know",
        "intuition",
        "concept",
        "god",
        "includes",
        "concept",
        "omniscience",
        "examining",
        "concept",
        "intellectually",
        "grasp",
        "one",
        "includes",
        "debate",
        "rationalist",
        "empiricist",
        "joined",
        "former",
        "assert",
        "latter",
        "deny",
        "intuitiondeduction",
        "thesis",
        "regard",
        "proposition",
        "contain",
        "substantive",
        "information",
        "external",
        "world",
        "rationalist",
        "descartes",
        "claimed",
        "know",
        "intuition",
        "deduction",
        "god",
        "exists",
        "created",
        "world",
        "mind",
        "body",
        "distinct",
        "substance",
        "angle",
        "triangle",
        "equal",
        "two",
        "right",
        "angle",
        "claim",
        "truth",
        "external",
        "reality",
        "independent",
        "thought",
        "substantive",
        "version",
        "intuitiondeduction",
        "thesis",
        "concern",
        "section",
        "one",
        "defense",
        "intuitiondeduction",
        "thesis",
        "assumes",
        "know",
        "substantive",
        "external",
        "world",
        "truth",
        "add",
        "analysis",
        "knowledge",
        "requires",
        "concludes",
        "knowledge",
        "must",
        "result",
        "intuition",
        "deduction",
        "rationalist",
        "empiricist",
        "alike",
        "claim",
        "certainty",
        "required",
        "scientia",
        "type",
        "absolute",
        "knowledge",
        "necessary",
        "connection",
        "would",
        "explain",
        "certain",
        "thing",
        "certain",
        "way",
        "certainty",
        "external",
        "world",
        "beyond",
        "empirical",
        "evidence",
        "provide",
        "empiricist",
        "seem",
        "happy",
        "conclude",
        "type",
        "knowledge",
        "external",
        "world",
        "acquire",
        "high",
        "degree",
        "certainty",
        "thus",
        "scientia",
        "never",
        "sure",
        "sensory",
        "impression",
        "part",
        "dream",
        "massive",
        "demon",
        "orchestrated",
        "deception",
        "rationalist",
        "like",
        "descartes",
        "meditation",
        "claim",
        "intuition",
        "provide",
        "certainty",
        "needed",
        "knowledge",
        "arguing",
        "rule",
        "review",
        "action",
        "intellect",
        "mean",
        "able",
        "arrive",
        "knowledge",
        "thing",
        "fear",
        "mistaken",
        "recognize",
        "two",
        "intuition",
        "deduction",
        "rule",
        "rule",
        "iii",
        "p",
        "line",
        "argument",
        "one",
        "least",
        "compelling",
        "rationalist",
        "arsenal",
        "first",
        "assumption",
        "knowledge",
        "requires",
        "certainty",
        "come",
        "heavy",
        "cost",
        "rule",
        "much",
        "commonly",
        "take",
        "know",
        "second",
        "many",
        "contemporary",
        "rationalist",
        "accept",
        "intuition",
        "always",
        "source",
        "certain",
        "knowledge",
        "possibility",
        "deceiver",
        "give",
        "u",
        "reason",
        "doubt",
        "intuition",
        "well",
        "empirical",
        "belief",
        "know",
        "deceiver",
        "might",
        "cause",
        "u",
        "intuit",
        "false",
        "proposition",
        "one",
        "might",
        "cause",
        "u",
        "perception",
        "nonexistent",
        "object",
        "descartes",
        "classic",
        "way",
        "meeting",
        "challenge",
        "meditation",
        "argue",
        "know",
        "certainty",
        "deceiver",
        "interferes",
        "intuition",
        "deduction",
        "infallible",
        "god",
        "guarantee",
        "truth",
        "problem",
        "known",
        "cartesian",
        "circle",
        "descartes",
        "account",
        "gain",
        "knowledge",
        "begs",
        "question",
        "attempting",
        "deduce",
        "conclusion",
        "intuition",
        "true",
        "intuited",
        "premise",
        "moreover",
        "account",
        "touch",
        "remaining",
        "problem",
        "note",
        "rule",
        "rule",
        "vii",
        "p",
        "deduction",
        "appreciable",
        "length",
        "rely",
        "fallible",
        "memory",
        "plausible",
        "argument",
        "intuitiondeduction",
        "thesis",
        "assumes",
        "know",
        "particular",
        "external",
        "world",
        "truth",
        "appeal",
        "nature",
        "know",
        "rather",
        "nature",
        "knowledge",
        "argue",
        "knowledge",
        "must",
        "result",
        "intuition",
        "deduction",
        "leibniz",
        "new",
        "essay",
        "tell",
        "u",
        "following",
        "sens",
        "although",
        "necessary",
        "actual",
        "knowledge",
        "sufficient",
        "give",
        "u",
        "whole",
        "since",
        "sens",
        "never",
        "give",
        "anything",
        "instance",
        "say",
        "particular",
        "individual",
        "truth",
        "instance",
        "confirm",
        "general",
        "truth",
        "however",
        "numerous",
        "may",
        "sufficient",
        "establish",
        "universal",
        "necessity",
        "truth",
        "follow",
        "happened",
        "happen",
        "way",
        "appears",
        "necessary",
        "truth",
        "find",
        "pure",
        "mathematics",
        "particularly",
        "arithmetic",
        "geometry",
        "must",
        "principle",
        "whose",
        "proof",
        "depend",
        "instance",
        "consequently",
        "testimony",
        "sens",
        "although",
        "without",
        "sens",
        "would",
        "never",
        "occurred",
        "u",
        "think",
        "them",
        "new",
        "essay",
        "preface",
        "pp",
        "leibniz",
        "go",
        "describe",
        "mathematical",
        "knowledge",
        "innate",
        "argument",
        "commonly",
        "directed",
        "support",
        "innate",
        "knowledge",
        "thesis",
        "rather",
        "intuitiondeduction",
        "thesis",
        "purpose",
        "relate",
        "latter",
        "however",
        "substantive",
        "knowledge",
        "external",
        "world",
        "mathematics",
        "know",
        "area",
        "know",
        "necessarily",
        "true",
        "experience",
        "warrant",
        "belief",
        "necessarily",
        "case",
        "hence",
        "experience",
        "source",
        "knowledge",
        "best",
        "explanation",
        "knowledge",
        "gain",
        "intuition",
        "deduction",
        "leibniz",
        "mention",
        "logic",
        "metaphysics",
        "moral",
        "area",
        "knowledge",
        "similarly",
        "outstrips",
        "experience",
        "provide",
        "judgment",
        "logic",
        "metaphysics",
        "involve",
        "form",
        "necessity",
        "beyond",
        "experience",
        "support",
        "judgment",
        "moral",
        "involve",
        "form",
        "obligation",
        "value",
        "lie",
        "beyond",
        "experience",
        "informs",
        "u",
        "case",
        "rather",
        "ought",
        "strength",
        "argument",
        "varies",
        "example",
        "purported",
        "knowledge",
        "insofar",
        "focus",
        "controversial",
        "claim",
        "metaphysics",
        "eg",
        "god",
        "exists",
        "mind",
        "distinct",
        "substance",
        "body",
        "initial",
        "premise",
        "know",
        "claim",
        "le",
        "compelling",
        "taken",
        "regard",
        "area",
        "however",
        "argument",
        "clearly",
        "leg",
        "know",
        "great",
        "deal",
        "mathematics",
        "know",
        "know",
        "necessarily",
        "true",
        "none",
        "experience",
        "warrant",
        "belief",
        "necessity",
        "seem",
        "base",
        "knowledge",
        "experience",
        "warrant",
        "provides",
        "u",
        "knowledge",
        "arises",
        "intellectual",
        "grasp",
        "proposition",
        "clearly",
        "part",
        "learning",
        "similarly",
        "seem",
        "moral",
        "knowledge",
        "thing",
        "equal",
        "wrong",
        "break",
        "promise",
        "pleasure",
        "intrinsically",
        "good",
        "empirical",
        "lesson",
        "thing",
        "warrant",
        "knowledge",
        "ought",
        "argument",
        "intuitiondeduction",
        "thesis",
        "raise",
        "additional",
        "question",
        "rationalist",
        "must",
        "answer",
        "insofar",
        "maintain",
        "knowledge",
        "necessary",
        "truth",
        "mathematics",
        "elsewhere",
        "intuition",
        "deduction",
        "substantive",
        "knowledge",
        "external",
        "world",
        "owe",
        "u",
        "account",
        "form",
        "necessity",
        "many",
        "empiricist",
        "stand",
        "ready",
        "argue",
        "necessity",
        "resides",
        "way",
        "talk",
        "thing",
        "thing",
        "talk",
        "quine",
        "p",
        "similarly",
        "rationalist",
        "claim",
        "knowledge",
        "moral",
        "knowledge",
        "objective",
        "form",
        "obligation",
        "owe",
        "u",
        "account",
        "objective",
        "value",
        "part",
        "world",
        "apparently",
        "valueless",
        "fact",
        "perhaps",
        "defender",
        "intuitiondeduction",
        "thesis",
        "owe",
        "u",
        "account",
        "intuition",
        "provides",
        "warranted",
        "true",
        "belief",
        "external",
        "world",
        "intuit",
        "proposition",
        "act",
        "intuition",
        "support",
        "warranted",
        "belief",
        "argument",
        "present",
        "intuition",
        "deduction",
        "explanation",
        "assumed",
        "knowledge",
        "tthey",
        "saybe",
        "explained",
        "experience",
        "explanation",
        "intuition",
        "deduction",
        "requires",
        "clear",
        "understanding",
        "intuition",
        "support",
        "warranted",
        "belief",
        "metaphorical",
        "characterization",
        "intuition",
        "intellectual",
        "grasping",
        "seeing",
        "enough",
        "intuition",
        "form",
        "intellectual",
        "grasping",
        "appears",
        "grasped",
        "relation",
        "among",
        "concept",
        "rather",
        "fact",
        "external",
        "world",
        "empiricist",
        "defender",
        "intuition",
        "deduction",
        "argue",
        "one",
        "current",
        "approach",
        "issue",
        "involves",
        "appeal",
        "phenomenal",
        "conservatism",
        "huemer",
        "principle",
        "seems",
        "one",
        "something",
        "case",
        "one",
        "prima",
        "facie",
        "justified",
        "believing",
        "intuition",
        "taken",
        "particular",
        "sort",
        "seeming",
        "appearance",
        "n",
        "intuition",
        "p",
        "state",
        "seeming",
        "one",
        "p",
        "dependent",
        "inference",
        "belief",
        "result",
        "thinking",
        "p",
        "opposed",
        "perceiving",
        "remembering",
        "introspecting",
        "huemer",
        "p",
        "visually",
        "seem",
        "appear",
        "one",
        "tree",
        "outside",
        "window",
        "intellectually",
        "seem",
        "appear",
        "one",
        "nothing",
        "entirely",
        "red",
        "entirely",
        "green",
        "approach",
        "aim",
        "demystify",
        "intuition",
        "one",
        "form",
        "seemingstate",
        "along",
        "one",
        "gain",
        "sense",
        "perception",
        "memory",
        "introspection",
        "however",
        "tell",
        "u",
        "need",
        "know",
        "intellectual",
        "faculty",
        "whether",
        "sense",
        "perception",
        "memory",
        "introspection",
        "intuition",
        "provides",
        "u",
        "warranted",
        "belief",
        "generally",
        "reliable",
        "reliability",
        "sense",
        "perception",
        "stem",
        "causal",
        "connection",
        "external",
        "object",
        "experience",
        "account",
        "reliability",
        "intuition",
        "regarding",
        "external",
        "world",
        "intuition",
        "particular",
        "true",
        "proposition",
        "outcome",
        "causal",
        "interaction",
        "aspect",
        "world",
        "aspect",
        "nature",
        "causal",
        "interaction",
        "number",
        "three",
        "prime",
        "appear",
        "cause",
        "anything",
        "let",
        "alone",
        "intuition",
        "prime",
        "michael",
        "huemer",
        "p",
        "point",
        "mounting",
        "defense",
        "moral",
        "intuitionism",
        "challenge",
        "moral",
        "realist",
        "explain",
        "would",
        "anything",
        "chance",
        "moral",
        "belief",
        "true",
        "given",
        "interact",
        "moral",
        "properties",
        "issue",
        "made",
        "pressing",
        "classic",
        "empiricist",
        "response",
        "argument",
        "reply",
        "generally",
        "credited",
        "hume",
        "begin",
        "division",
        "true",
        "proposition",
        "two",
        "category",
        "object",
        "human",
        "reason",
        "inquiry",
        "may",
        "naturally",
        "divided",
        "two",
        "kind",
        "wit",
        "relation",
        "idea",
        "matter",
        "fact",
        "first",
        "science",
        "geometry",
        "algebra",
        "arithmetic",
        "short",
        "every",
        "affirmation",
        "either",
        "intuitively",
        "demonstratively",
        "certain",
        "square",
        "hypotenuse",
        "equal",
        "square",
        "two",
        "side",
        "proposition",
        "express",
        "relation",
        "figure",
        "three",
        "time",
        "five",
        "equal",
        "half",
        "thirty",
        "express",
        "relation",
        "number",
        "proposition",
        "kind",
        "discoverable",
        "mere",
        "operation",
        "thought",
        "without",
        "dependence",
        "anywhere",
        "existent",
        "universe",
        "though",
        "never",
        "circle",
        "triangle",
        "nature",
        "truth",
        "demonstrated",
        "euclid",
        "would",
        "forever",
        "retain",
        "certainty",
        "evidence",
        "matter",
        "fact",
        "second",
        "object",
        "human",
        "reason",
        "ascertained",
        "manner",
        "evidence",
        "truth",
        "however",
        "great",
        "like",
        "nature",
        "foregoing",
        "contrary",
        "every",
        "matter",
        "fact",
        "still",
        "possible",
        "never",
        "imply",
        "contradiction",
        "conceived",
        "mind",
        "facility",
        "distinctness",
        "ever",
        "conformable",
        "reality",
        "enquiry",
        "p",
        "intuition",
        "deduction",
        "provide",
        "u",
        "knowledge",
        "necessary",
        "truth",
        "found",
        "mathematics",
        "logic",
        "knowledge",
        "substantive",
        "knowledge",
        "external",
        "world",
        "knowledge",
        "relation",
        "idea",
        "rationalist",
        "shift",
        "argument",
        "appeal",
        "knowledge",
        "moral",
        "hume",
        "reply",
        "offer",
        "analysis",
        "moral",
        "concept",
        "knowledge",
        "empirically",
        "gained",
        "knowledge",
        "matter",
        "fact",
        "moral",
        "criticism",
        "properly",
        "object",
        "understanding",
        "taste",
        "sentiment",
        "beauty",
        "whether",
        "moral",
        "natural",
        "felt",
        "properly",
        "perceived",
        "reason",
        "concerning",
        "endeavor",
        "fix",
        "standard",
        "regard",
        "new",
        "fact",
        "wit",
        "general",
        "taste",
        "mankind",
        "fact",
        "may",
        "object",
        "reasoning",
        "inquiry",
        "enquiry",
        "p",
        "rationalist",
        "appeal",
        "knowledge",
        "metaphysics",
        "support",
        "argument",
        "hume",
        "denies",
        "knowledge",
        "take",
        "hand",
        "volume",
        "divinity",
        "school",
        "metaphysics",
        "instance",
        "let",
        "u",
        "ask",
        "contain",
        "abstract",
        "reasoning",
        "concerning",
        "quantity",
        "number",
        "contain",
        "experimental",
        "reasoning",
        "concerning",
        "matter",
        "fact",
        "existence",
        "commit",
        "flame",
        "contain",
        "nothing",
        "sophistry",
        "illusion",
        "enquiry",
        "p",
        "updated",
        "version",
        "general",
        "empiricist",
        "reply",
        "increased",
        "emphasis",
        "language",
        "nature",
        "meaning",
        "given",
        "twentiethcentury",
        "a",
        "j",
        "ayer",
        "version",
        "logical",
        "positivism",
        "adopting",
        "positivism",
        "verification",
        "theory",
        "meaning",
        "ayer",
        "assigns",
        "every",
        "cognitively",
        "meaningful",
        "sentence",
        "one",
        "two",
        "category",
        "either",
        "tautology",
        "true",
        "solely",
        "virtue",
        "meaning",
        "term",
        "provides",
        "substantive",
        "information",
        "world",
        "open",
        "empirical",
        "verification",
        "room",
        "knowledge",
        "external",
        "world",
        "intuition",
        "deduction",
        "priori",
        "knowledge",
        "reality",
        "truth",
        "pure",
        "reason",
        "proposition",
        "know",
        "valid",
        "independently",
        "experience",
        "virtue",
        "lack",
        "factual",
        "content",
        "contrast",
        "empirical",
        "proposition",
        "one",
        "hypothesis",
        "may",
        "confirmed",
        "discredited",
        "actual",
        "sense",
        "experience",
        "ayer",
        "pp",
        "rationalist",
        "argument",
        "intuitiondeduction",
        "thesis",
        "go",
        "wrong",
        "start",
        "according",
        "empiricist",
        "assuming",
        "substantive",
        "knowledge",
        "external",
        "world",
        "outstrips",
        "experience",
        "warrant",
        "empiricist",
        "reply",
        "face",
        "challenge",
        "knowledge",
        "mathematics",
        "seems",
        "something",
        "concept",
        "knowledge",
        "moral",
        "judgment",
        "seems",
        "concern",
        "feel",
        "act",
        "ought",
        "behave",
        "general",
        "principle",
        "provide",
        "basis",
        "empiricist",
        "view",
        "eg",
        "hume",
        "overall",
        "account",
        "idea",
        "verification",
        "principle",
        "meaning",
        "problematic",
        "right",
        "rationalist",
        "argument",
        "intuitiondeduction",
        "thesis",
        "relative",
        "substantive",
        "knowledge",
        "external",
        "world",
        "success",
        "rest",
        "well",
        "answer",
        "question",
        "nature",
        "epistemic",
        "force",
        "intuition",
        "made",
        "pressing",
        "classic",
        "empiricist",
        "reply"
    ]
}