{
    "main_text": "Interpretive Issues || Real Essences, Internal Constitutions and Substance\n5. Real Essences of Simple Ideas and Modes\n\nOne of Locke’s epistemological projects is to distinguish\nmetaphysics and natural philosophy from ethics and mathematics, and\none way he does that is to distinguish their subject matters.\nMetaphysics and natural philosophy are concerned with substances,\nwhereas mathematics and ethics are concerned with modes. For Locke,\nsince an essence accounts for the existence and nature of any being,\ni.e., “Essence may be taken for the very being of anything,\nwhereby it is what it is”, it follows that the concepts of real\nand nominal essences apply outside the realm of metaphysics and\nnatural philosophy as well. By his lights, both simple ideas and modes\nhave real and nominal essences. To see this, some definitions are in\norder.\n\nBy ‘simple idea’, Locke means a single, uniform concept or\nappearance that cannot be analyzed into more basic parts:\n\n\nThe coldness and hardness, which a Man feels in a piece of\nIce, being as distinct Ideas in the Mind, as the\nSmell and Whiteness of a Lily; or as the taste of Sugar, and smell of\na Rose: And there is nothing can be plainer to a Man, than the clear\nand distinct Perception he has of those simple Ideas; which\nbeing each in it self uncompounded, contains in it nothing but one\nuniform Appearance, or Conception in the mind, and is not\ndistinguishable into different Ideas. (II.ii.1)\n\n\nOur complex idea of gold might include its color, heaviness, solidity,\netc., but each of these ideas can be set aside and considered all on\nits own as a simple idea. One simple idea, e.g., that of the\nyellowness of the lump of gold, is simple because it is a single,\nuniform appearance of that particular shade and not a collection of\nmore basic appearances. The same goes for our idea of its hardness and\nheaviness. We can mentally separate the color from the hardness or\nheaviness and think of it all on its own.\n\nBy ‘mode’, Locke means complex ideas of qualities that\ndepend upon substances for their existence:\n\n\nFirst, Modes I call such complex Ideas, which\nhowever compounded, contain not in them the supposition of subsisting\nby themselves, but are considered as Dependences on, or Affections of\nSubstances; such are the Ideas signified by the Words\nTriangle, Gratitude, Murther, etc. (II.xii.4)\n\n\nSo, for example, gratitude does not exist on its own, rather it\nrequires a thing that is grateful in order to exist. Mixed\nmodes are,\n\n\nthe Complex Ideas, we mark by the names Obligation,\nDrunkenness, a Lye, etc. which consisting of several\nCombinations of simple Ideas of different kinds, I have\ncalled Mixed Modes, to distinguish them from the more simple\nModes, which consist only of simple Ideas of the same kind.\nThese mixed Modes being also such Combinations of simple\nIdeas, as are not looked upon to be the characteristical\nMarks of any real Beings that have a steady existence, but scattered\nand independent Ideas, put together by the Mind, are thereby\ndistinguished from the complex Ideas of Substances.\n(II.xxii.1)\n\n\nGiven that there are real and nominal essences for modes and that a\ngeneral knowledge consists in knowledge of essences, then Locke needs\nsome way to distinguish the essences of modes from those of\nsubstances.\n\nAccording to Locke, one of the main differences between substances on\nthe one hand and simple ideas and modes on the other is that the real\nessences of substances are distinct from their nominal essences,\nwhereas for simple ideas and modes, they are the same.\n\n\nEssences being thus distinguished into Nominal and\nReal, we may farther observe, that in the Species of\nsimple Ideas and Modes, they are always the\nsame: But in Substances, always quite different. Thus a\nFigure including a Space between three Lines, is the real, as well as\nnominal Essence of a Triangle; it being not only the abstract\nIdea to which the general Name is annexed, but the very\nEssentia, or Being, of the thing it self, that Foundation\nfrom which all its Properties flow, and to which they are all\ninseparably annexed. But it is far otherwise concerning that parcel of\nMatter, which makes the Ring on my Finger, wherein these two\nEssences are apparently different. For it is the real\nConstitution of its insensible Parts, on which depend all those\nproperties of Colour, Weight, Fusibility, Fixedness, etc.\nwhich are to be found in it. Which Constitution we know not; and so\nhaving no particular Idea of, have no Name that is the Sign\nof it. But yet it is its Colour, Weight, Fusibility, and Fixedness,\netc. which makes it to be Gold, or gives it a right\nto that Name, which is therefore its nominal Essence.\n(III.iii.18)\n\n\nSo the real essences of a triangle, or gratitude, or murder, or\nyellow, or sweet, etc., are exactly the same as their nominal\nessences. There is nothing more to being a triangle than being a\nplane, closed three-sided figure. Similarly, there is nothing more to\nbeing a particular ‘species’ or shade of yellow than the\nnominal\n definition.[7]\n\nWhile it is clear that Locke envisioned some analogy between the real\nand nominal essences of substances with those of modes, it is unclear,\nhowever, just how that analogy should be cashed out. For example,\nRoger Woolhouse argues that it is a mistake for Locke to say that mode\nideas have a real essence at all because there is nothing like a\ncorpuscular structure that is analogous to the definition of a concept\nlike triangle or lying. Moreover, there is, according to Woolhouse,\nnothing that binds the nominally essential qualities of modes\ntogether, whereas, for substances there is an underlying physical\nstructure (see Woolhouse 1971, pp. 125–128). Indeed it is quite\ndifficult to see how a mode could have a real essence if the model for\nwhat a real essence is comes from corpuscular structures. If Woolhouse\nis right, then Locke has no way to make good on his intended analogy\nand he is unable to adequately differentiate modes from\nsubstances.\n\nP. Kyle Stanford (1998), on the other hand, suggests that the analogy\nbetween real and nominal essences was intended to be based in their\nentailment relations. Stanford argues that, just as every property of\na substance flows from the real essence with geometrical necessity\n(IV.vi.11), so too does every property of a triangle follow from its\ndefinition with geometrical necessity. And this fact is what all real\nand nominal essences have in common for Locke. By his way of thinking,\neven though the connection between the real essence of a piece of gold\nis the causal ground of the nominally essential properties of\ngold, and the real essence of a triangle is the logical\nground for the nominally essential properties of a triangle, they are\nalike in that all nominally essential properties can be deduced from\nthe idea of the real essence; if we knew the real essence of a\ntriangle, then we could deduce from it any of the properties of a\ntriangle. To make this analogy work, Stanford argues that the real\nessence of a substance is more than a corpuscular structure, it must\nalso include the causal powers that produce the observable qualities\nof the substance; in like fashion, the real essence of modes includes\nthe logical ground from which the nominally essential properties of\nthe term flow. If Stanford is correct, then there is a possible\nanalogy between the real and nominal essences of modes and substances\nthat yields an interesting interpretation of the real essences of both\nmodes and substances.\n\nOn either reading, however, it appears that Locke is saddled with the\nview that in cases of simple ideas, ideas of modes and mixed modes, if\nwe understand the meanings of the words, we know all that there is to\nknow regarding those concepts. Moral and mathematical concepts and\nideas are mere trifling propositions, analytic truths and\nuninformative. However, it will be difficult for many moral\nphilosophers to accept that all they are doing is cashing out the\ndefinitions of terms and dealing with uninformative analytic truths;\nasserting that lying is wrong seems to be more than a trifling\nopinion. Moreover, it is unclear how Locke thinks moral terms can be\nnormative, i.e., how they can constitute commands we ought to\nobey—if his position is correct.\n\nIn a similar vein, since many mixed modes, which include all moral\nconcepts, are arbitrary mental constructs, it follows that we create\nmoral concepts by producing their definitions. Since the real and\nnominal essences of mixed modes are the same, it follows that if we\nknow the real essence of lying (knowingly and falsely asserting that\n‘p’ with the intention to mislead someone whom we\nought not to mislead, etc.), we can deduce from that idea all the\ncomponents of lying, and so there is nothing more to know about lying\nthan the ideas contained within its definition. A problem with\nLocke’s account here is that, as John Mackie points out, social\nscientists seek out the real essences of social phenomena such as\nadultery, incest, jealousy, lying and suicide, but understanding these\ncomplex phenomena involves more than simply understanding the meaning\nof the word. If we are to understand why people lie, we must know more\nthan a definition of lying. Of course, it is possible for Locke to\nargue that once we understand all that is included in lying, we have\nuncovered its real essence, why people lie, and the many ways they do\nso, however, are separate questions that we cannot expect to be\ndecided by a semantic theory. It is unclear how he would solve the\nnormative problem (see Mackie 1976, pp. 90–91; see also Jolley\n1999, pp. 155–161).\n",
    "section_title": "5. Real Essences of Simple Ideas and Modes",
    "entry_title": "Locke on Real Essence",
    "hierarchy_title": "Locke on Real Essence || Interpretive Issues || Real Essences, Internal Constitutions and Substance",
    "tokenized_text": [
        "interpretive",
        "issue",
        "real",
        "essence",
        "internal",
        "constitution",
        "substance",
        "real",
        "essence",
        "simple",
        "idea",
        "mode",
        "one",
        "locke",
        "epistemological",
        "project",
        "distinguish",
        "metaphysics",
        "natural",
        "philosophy",
        "ethic",
        "mathematics",
        "one",
        "way",
        "distinguish",
        "subject",
        "matter",
        "metaphysics",
        "natural",
        "philosophy",
        "concerned",
        "substance",
        "whereas",
        "mathematics",
        "ethic",
        "concerned",
        "mode",
        "locke",
        "since",
        "essence",
        "account",
        "existence",
        "nature",
        "ie",
        "essence",
        "may",
        "taken",
        "anything",
        "whereby",
        "follows",
        "concept",
        "real",
        "nominal",
        "essence",
        "apply",
        "outside",
        "realm",
        "metaphysics",
        "natural",
        "philosophy",
        "well",
        "light",
        "simple",
        "idea",
        "mode",
        "real",
        "nominal",
        "essence",
        "see",
        "definition",
        "order",
        "simple",
        "idea",
        "locke",
        "mean",
        "single",
        "uniform",
        "concept",
        "appearance",
        "analyzed",
        "basic",
        "part",
        "coldness",
        "hardness",
        "man",
        "feel",
        "piece",
        "ice",
        "distinct",
        "idea",
        "mind",
        "smell",
        "whiteness",
        "lily",
        "taste",
        "sugar",
        "smell",
        "rose",
        "nothing",
        "plainer",
        "man",
        "clear",
        "distinct",
        "perception",
        "simple",
        "idea",
        "self",
        "uncompounded",
        "contains",
        "nothing",
        "one",
        "uniform",
        "appearance",
        "conception",
        "mind",
        "distinguishable",
        "different",
        "idea",
        "iiii",
        "complex",
        "idea",
        "gold",
        "might",
        "include",
        "color",
        "heaviness",
        "solidity",
        "etc",
        "idea",
        "set",
        "aside",
        "considered",
        "simple",
        "idea",
        "one",
        "simple",
        "idea",
        "eg",
        "yellowness",
        "lump",
        "gold",
        "simple",
        "single",
        "uniform",
        "appearance",
        "particular",
        "shade",
        "collection",
        "basic",
        "appearance",
        "go",
        "idea",
        "hardness",
        "heaviness",
        "mentally",
        "separate",
        "color",
        "hardness",
        "heaviness",
        "think",
        "mode",
        "locke",
        "mean",
        "complex",
        "idea",
        "quality",
        "depend",
        "upon",
        "substance",
        "existence",
        "first",
        "mode",
        "call",
        "complex",
        "idea",
        "however",
        "compounded",
        "contain",
        "supposition",
        "subsisting",
        "considered",
        "dependence",
        "affection",
        "substance",
        "idea",
        "signified",
        "word",
        "triangle",
        "gratitude",
        "murther",
        "etc",
        "iixii",
        "example",
        "gratitude",
        "exist",
        "rather",
        "requires",
        "thing",
        "grateful",
        "order",
        "exist",
        "mixed",
        "mode",
        "complex",
        "idea",
        "mark",
        "name",
        "obligation",
        "drunkenness",
        "lye",
        "etc",
        "consisting",
        "several",
        "combination",
        "simple",
        "idea",
        "different",
        "kind",
        "called",
        "mixed",
        "mode",
        "distinguish",
        "simple",
        "mode",
        "consist",
        "simple",
        "idea",
        "kind",
        "mixed",
        "mode",
        "also",
        "combination",
        "simple",
        "idea",
        "looked",
        "upon",
        "characteristical",
        "mark",
        "real",
        "being",
        "steady",
        "existence",
        "scattered",
        "independent",
        "idea",
        "put",
        "together",
        "mind",
        "thereby",
        "distinguished",
        "complex",
        "idea",
        "substance",
        "iixxii",
        "given",
        "real",
        "nominal",
        "essence",
        "mode",
        "general",
        "knowledge",
        "consists",
        "knowledge",
        "essence",
        "locke",
        "need",
        "way",
        "distinguish",
        "essence",
        "mode",
        "substance",
        "according",
        "locke",
        "one",
        "main",
        "difference",
        "substance",
        "one",
        "hand",
        "simple",
        "idea",
        "mode",
        "real",
        "essence",
        "substance",
        "distinct",
        "nominal",
        "essence",
        "whereas",
        "simple",
        "idea",
        "mode",
        "essence",
        "thus",
        "distinguished",
        "nominal",
        "real",
        "may",
        "farther",
        "observe",
        "specie",
        "simple",
        "idea",
        "mode",
        "always",
        "substance",
        "always",
        "quite",
        "different",
        "thus",
        "figure",
        "including",
        "space",
        "three",
        "line",
        "real",
        "well",
        "nominal",
        "essence",
        "triangle",
        "abstract",
        "idea",
        "general",
        "name",
        "annexed",
        "essentia",
        "thing",
        "self",
        "foundation",
        "property",
        "flow",
        "inseparably",
        "annexed",
        "far",
        "otherwise",
        "concerning",
        "parcel",
        "matter",
        "make",
        "ring",
        "finger",
        "wherein",
        "two",
        "essence",
        "apparently",
        "different",
        "real",
        "constitution",
        "insensible",
        "part",
        "depend",
        "property",
        "colour",
        "weight",
        "fusibility",
        "fixedness",
        "etc",
        "found",
        "constitution",
        "know",
        "particular",
        "idea",
        "name",
        "sign",
        "yet",
        "colour",
        "weight",
        "fusibility",
        "fixedness",
        "etc",
        "make",
        "gold",
        "give",
        "right",
        "name",
        "therefore",
        "nominal",
        "essence",
        "iiiiii",
        "real",
        "essence",
        "triangle",
        "gratitude",
        "murder",
        "yellow",
        "sweet",
        "etc",
        "exactly",
        "nominal",
        "essence",
        "nothing",
        "triangle",
        "plane",
        "closed",
        "threesided",
        "figure",
        "similarly",
        "nothing",
        "particular",
        "specie",
        "shade",
        "yellow",
        "nominal",
        "definition",
        "clear",
        "locke",
        "envisioned",
        "analogy",
        "real",
        "nominal",
        "essence",
        "substance",
        "mode",
        "unclear",
        "however",
        "analogy",
        "cashed",
        "example",
        "roger",
        "woolhouse",
        "argues",
        "mistake",
        "locke",
        "say",
        "mode",
        "idea",
        "real",
        "essence",
        "nothing",
        "like",
        "corpuscular",
        "structure",
        "analogous",
        "definition",
        "concept",
        "like",
        "triangle",
        "lying",
        "moreover",
        "according",
        "woolhouse",
        "nothing",
        "bind",
        "nominally",
        "essential",
        "quality",
        "mode",
        "together",
        "whereas",
        "substance",
        "underlying",
        "physical",
        "structure",
        "see",
        "woolhouse",
        "pp",
        "indeed",
        "quite",
        "difficult",
        "see",
        "mode",
        "could",
        "real",
        "essence",
        "model",
        "real",
        "essence",
        "come",
        "corpuscular",
        "structure",
        "woolhouse",
        "right",
        "locke",
        "way",
        "make",
        "good",
        "intended",
        "analogy",
        "unable",
        "adequately",
        "differentiate",
        "mode",
        "substance",
        "p",
        "kyle",
        "stanford",
        "hand",
        "suggests",
        "analogy",
        "real",
        "nominal",
        "essence",
        "intended",
        "based",
        "entailment",
        "relation",
        "stanford",
        "argues",
        "every",
        "property",
        "substance",
        "flow",
        "real",
        "essence",
        "geometrical",
        "necessity",
        "ivvi",
        "every",
        "property",
        "triangle",
        "follow",
        "definition",
        "geometrical",
        "necessity",
        "fact",
        "real",
        "nominal",
        "essence",
        "common",
        "locke",
        "way",
        "thinking",
        "even",
        "though",
        "connection",
        "real",
        "essence",
        "piece",
        "gold",
        "causal",
        "ground",
        "nominally",
        "essential",
        "property",
        "gold",
        "real",
        "essence",
        "triangle",
        "logical",
        "ground",
        "nominally",
        "essential",
        "property",
        "triangle",
        "alike",
        "nominally",
        "essential",
        "property",
        "deduced",
        "idea",
        "real",
        "essence",
        "knew",
        "real",
        "essence",
        "triangle",
        "could",
        "deduce",
        "property",
        "triangle",
        "make",
        "analogy",
        "work",
        "stanford",
        "argues",
        "real",
        "essence",
        "substance",
        "corpuscular",
        "structure",
        "must",
        "also",
        "include",
        "causal",
        "power",
        "produce",
        "observable",
        "quality",
        "substance",
        "like",
        "fashion",
        "real",
        "essence",
        "mode",
        "includes",
        "logical",
        "ground",
        "nominally",
        "essential",
        "property",
        "term",
        "flow",
        "stanford",
        "correct",
        "possible",
        "analogy",
        "real",
        "nominal",
        "essence",
        "mode",
        "substance",
        "yield",
        "interesting",
        "interpretation",
        "real",
        "essence",
        "mode",
        "substance",
        "either",
        "reading",
        "however",
        "appears",
        "locke",
        "saddled",
        "view",
        "case",
        "simple",
        "idea",
        "idea",
        "mode",
        "mixed",
        "mode",
        "understand",
        "meaning",
        "word",
        "know",
        "know",
        "regarding",
        "concept",
        "moral",
        "mathematical",
        "concept",
        "idea",
        "mere",
        "trifling",
        "proposition",
        "analytic",
        "truth",
        "uninformative",
        "however",
        "difficult",
        "many",
        "moral",
        "philosopher",
        "accept",
        "cashing",
        "definition",
        "term",
        "dealing",
        "uninformative",
        "analytic",
        "truth",
        "asserting",
        "lying",
        "wrong",
        "seems",
        "trifling",
        "opinion",
        "moreover",
        "unclear",
        "locke",
        "think",
        "moral",
        "term",
        "normative",
        "ie",
        "constitute",
        "command",
        "ought",
        "obeyif",
        "position",
        "correct",
        "similar",
        "vein",
        "since",
        "many",
        "mixed",
        "mode",
        "include",
        "moral",
        "concept",
        "arbitrary",
        "mental",
        "construct",
        "follows",
        "create",
        "moral",
        "concept",
        "producing",
        "definition",
        "since",
        "real",
        "nominal",
        "essence",
        "mixed",
        "mode",
        "follows",
        "know",
        "real",
        "essence",
        "lying",
        "knowingly",
        "falsely",
        "asserting",
        "p",
        "intention",
        "mislead",
        "someone",
        "ought",
        "mislead",
        "etc",
        "deduce",
        "idea",
        "component",
        "lying",
        "nothing",
        "know",
        "lying",
        "idea",
        "contained",
        "within",
        "definition",
        "problem",
        "locke",
        "account",
        "john",
        "mackie",
        "point",
        "social",
        "scientist",
        "seek",
        "real",
        "essence",
        "social",
        "phenomenon",
        "adultery",
        "incest",
        "jealousy",
        "lying",
        "suicide",
        "understanding",
        "complex",
        "phenomenon",
        "involves",
        "simply",
        "understanding",
        "meaning",
        "word",
        "understand",
        "people",
        "lie",
        "must",
        "know",
        "definition",
        "lying",
        "course",
        "possible",
        "locke",
        "argue",
        "understand",
        "included",
        "lying",
        "uncovered",
        "real",
        "essence",
        "people",
        "lie",
        "many",
        "way",
        "however",
        "separate",
        "question",
        "expect",
        "decided",
        "semantic",
        "theory",
        "unclear",
        "would",
        "solve",
        "normative",
        "problem",
        "see",
        "mackie",
        "pp",
        "see",
        "also",
        "jolley",
        "pp"
    ]
}