{
    "main_text": "Twentieth Century Classical Realism || Hans Morgenthau’s Realist Principles\n2.2 Hans Morgenthau’s Realist Principles\n\nHans J. Morgenthau (1904–1980) developed realism into a\ncomprehensive international relations theory. Influenced by the\nProtestant theologian and political writer Reinhold Niebuhr, as well\nas by Hobbes, he places selfishness and power-lust at the center of\nhis picture of human existence. The insatiable human lust for power,\ntimeless and universal, which he identifies with animus\ndominandi, the desire to dominate, is for him the main cause of\nconflict. As he asserts in his main work, Politics among Nations:\nThe Struggle for Power and Peace, first published in 1948,\n“international politics, like all politics, is a struggle for\npower” (25).\n\nMorgenthau systematizes realism in international relations on the\nbasis of six principles that he includes in the second edition of\nPolitics among Nations. As a traditionalist, he opposes the\nso-called scientists (the scholars who, especially in the 1950s, tried\nto reduce the discipline of international relations to a branch of\nbehavioral science). Nevertheless, in the first principle he states\nthat realism is based on objective laws that have their roots in\nunchanging human nature (4). He wants to develop realism into both a\ntheory of international politics and a political art, a useful tool of\nforeign policy.\n\nThe keystone of Morgenthau’s realist theory is the concept\nof power or “of interest defined in terms of power,”\nwhich informs his second principle: the assumption that political\nleaders “think and act in terms of interest defined as\npower” (5). This concept defines the autonomy of politics, and\nallows for the analysis of foreign policy regardless of the different\nmotives, preferences, and intellectual and moral qualities of\nindividual politicians. Furthermore, it is the foundation of a\nrational picture of politics.\n\nAlthough, as Morgenthau explains in the third principle, interest\ndefined as power is a universally valid category, and indeed an\nessential element of politics, various things can be associated with\ninterest or power at different times and in different circumstances.\nIts content and the manner of its use are determined by the political\nand cultural environment.\n\nIn the fourth principle, Morgenthau considers the relationship between\nrealism and ethics. He says that while realists are aware of the moral\nsignificance of political action, they are also aware of the tension\nbetween morality and the requirements of successful political action.\n“Universal moral principles,” he asserts, “cannot be\napplied to the actions of states in their abstract universal\nformulation, but …they must be filtered through the concrete\ncircumstances of time and place” (9). These principles must be\naccompanied by prudence for as he cautions “there can be no\npolitical morality without prudence; that is, without consideration of\nthe political consequences of seemingly moral action”\n(ibid.).\n\nPrudence, the ability to judge the rightness of a given action from\namong possible alternatives on the basis of its likely political\nconsequences, and not conviction of one’s own moral or\nideological superiority, should guide political decisions. This is\nstressed in the fifth principle, where Morgenthau again emphasizes the\nidea that all state actors, including our own, must be looked at\nsolely as political entities pursuing their respective interests\ndefined in terms of power. By taking this point of view\nvis-à-vis its counterparts and thus avoiding ideological\nconfrontation, a state would then be able to pursue policies that\nrespected the interests of other states, while protecting and\npromoting its own.\n\nInsofar as power, or interest defined as power, is the concept that\ndefines politics, politics is an autonomous sphere, as Morgenthau says\nin his sixth principle of realism. It cannot be subordinated to\nethics. However, ethics does still play a role in politics. “A\nman who was nothing but ‘political man’ would be a beast,\nfor he would be completely lacking in moral restraints. A man who was\nnothing but ‘moral man’ would be a fool, for he would be\ncompletely lacking in prudence” (12). Political art requires\nthat these two dimensions of human life, power and morality, be taken\ninto consideration.\n\nWhile Morgenthau’s six principles of realism contain repetitions\nand inconsistencies, we can nonetheless obtain from them the following\npicture: Power or interest is the central concept that makes politics\ninto an autonomous discipline. Rational state actors pursue their\nnational interests. Therefore, a rational theory of international\npolitics can be constructed. Such a theory is not concerned with the\nmorality, religious beliefs, motives or ideological preferences of\nindividual political leaders. It also indicates that in order to avoid\nconflicts, states should avoid moral crusades or ideological\nconfrontations, and look for compromise based solely on satisfaction\nof their mutual interests.\n\nAlthough he defines politics as an autonomous sphere, Morgenthau does\nnot separate ethics from politics. The act of protecting one’s\ncountry has for him a deep moral significance. Ultimately directed\ntoward the objective of national survival, it involves prudence that\nis related to choosing the best course of action. The effective\nprotection of citizens’ lives from harm in case of an\ninternational armed conflict is not merely a forceful physical action;\nit also has prudential and moral dimensions.\n\nMorgenthau regards realism as a way of thinking about international\nrelations and a useful tool for devising policies. However, some of\nthe basic conceptions of his theory, and especially the idea of\nconflict as stemming from human nature, as well as the concept of\npower itself, have provoked criticism.\n\nInternational politics, like all politics, is for Morgenthau a\nstruggle for power because of the basic human lust for power. But\nregarding every individual as being engaged in a perpetual quest for\npower—the view that he shares with Hobbes—is a\nquestionable premise. Human nature cannot be revealed by observation\nand experiment. It cannot be proved by any empirical research, but\nonly disclosed by philosophy, imposed on us as a matter of belief, and\ninculcated by education.\n\nMorgenthau himself reinforces the belief in the human drive for power\nby introducing a normative aspect of his theory, which is rationality.\nA rational foreign policy is considered “to be a good foreign\npolicy” (7). But he defines rationality as a process of\ncalculating the costs and benefits of all alternative policies in\norder to determine their relative utility, i.e. their ability to\nmaximize power. Statesmen “think and act in terms of interest\ndefined as power” (5). Only intellectual weakness of policy\nmakers can result in foreign policies that deviate from a rational\ncourse aimed at minimizing risks and maximizing benefits. Hence,\nrather than presenting an actual portrait of human affairs, Morgenthau\nemphasizes the pursuit of power and the rationality of this pursuit,\nand sets it up as a norm.\n\nAs Raymond Aron and other scholars have noticed, power, the\nfundamental concept of Morgenthau’s realism, is ambiguous. It\ncan be either a means or an end in politics. But if power is only a\nmeans for gaining something else, it does not define the nature of\ninternational politics in the way Morgenthau claims. It does not allow\nus to understand the actions of states independently from the motives\nand ideological preferences of their political leaders. It cannot\nserve as the basis for defining politics as an autonomous sphere.\nMorgenthau’s principles of realism are thus open to doubt.\n“Is this true,” Aron asks, “that states, whatever\ntheir regime, pursue the same kind of foreign policy” (597) and\nthat the foreign policies of Napoleon or Stalin are essentially\nidentical to those of Hitler, Louis XVI or Nicholas II, amounting to\nno more than the struggle for power? “If one answers yes, then\nthe proposition is incontestable, but not very instructive”\n(598). Accordingly, it is useless to define actions of states by\nexclusive reference to power, security or national interest.\nInternational politics cannot be studied independently of the wider\nhistorical and cultural context.\n\nCarr and Morgenthau concentrate primarily on international relations.\nHowever, their political realism can also be applied to domestic\npolitics. To be a classical realist is in general to perceive politics\nas a conflict of interests and a struggle for power, and to seek peace\nby recognizing common interests and trying to satisfy them, rather\nthan by moralizing. Bernard Williams and Raymond Geuss, influential\nrepresentatives of the new political realism, a movement in\ncontemporary political theory, criticize what they describe as\n“political moralism” and stress the autonomy of politics\nagainst ethics. However, political theory realism and international\nrelations realism seem like two separate research programs. As noted\nby several scholars (William Scheuerman, Alison McQueen, Terry Nardin.\nDuncan Bell), those who contribute to realism in political theory give\nlittle attention to those who work on realism in international\npolitics.\n",
    "section_title": "2.2 Hans Morgenthau’s Realist Principles",
    "entry_title": "Political Realism in International Relations",
    "hierarchy_title": "Political Realism in International Relations || Twentieth Century Classical Realism || Hans Morgenthau’s Realist Principles",
    "tokenized_text": [
        "twentieth",
        "century",
        "classical",
        "realism",
        "han",
        "morgenthau",
        "realist",
        "principle",
        "han",
        "morgenthau",
        "realist",
        "principle",
        "han",
        "j",
        "morgenthau",
        "developed",
        "realism",
        "comprehensive",
        "international",
        "relation",
        "theory",
        "influenced",
        "protestant",
        "theologian",
        "political",
        "writer",
        "reinhold",
        "niebuhr",
        "well",
        "hobbes",
        "place",
        "selfishness",
        "powerlust",
        "center",
        "picture",
        "human",
        "existence",
        "insatiable",
        "human",
        "lust",
        "power",
        "timeless",
        "universal",
        "identifies",
        "animus",
        "dominandi",
        "desire",
        "dominate",
        "main",
        "cause",
        "conflict",
        "asserts",
        "main",
        "work",
        "politics",
        "among",
        "nation",
        "struggle",
        "power",
        "peace",
        "first",
        "published",
        "international",
        "politics",
        "like",
        "politics",
        "struggle",
        "power",
        "morgenthau",
        "systematizes",
        "realism",
        "international",
        "relation",
        "basis",
        "six",
        "principle",
        "includes",
        "second",
        "edition",
        "politics",
        "among",
        "nation",
        "traditionalist",
        "opposes",
        "socalled",
        "scientist",
        "scholar",
        "especially",
        "s",
        "tried",
        "reduce",
        "discipline",
        "international",
        "relation",
        "branch",
        "behavioral",
        "science",
        "nevertheless",
        "first",
        "principle",
        "state",
        "realism",
        "based",
        "objective",
        "law",
        "root",
        "unchanging",
        "human",
        "nature",
        "want",
        "develop",
        "realism",
        "theory",
        "international",
        "politics",
        "political",
        "art",
        "useful",
        "tool",
        "foreign",
        "policy",
        "keystone",
        "morgenthau",
        "realist",
        "theory",
        "concept",
        "power",
        "interest",
        "defined",
        "term",
        "power",
        "informs",
        "second",
        "principle",
        "assumption",
        "political",
        "leader",
        "think",
        "act",
        "term",
        "interest",
        "defined",
        "power",
        "concept",
        "defines",
        "autonomy",
        "politics",
        "allows",
        "analysis",
        "foreign",
        "policy",
        "regardless",
        "different",
        "motif",
        "preference",
        "intellectual",
        "moral",
        "quality",
        "individual",
        "politician",
        "furthermore",
        "foundation",
        "rational",
        "picture",
        "politics",
        "although",
        "morgenthau",
        "explains",
        "third",
        "principle",
        "interest",
        "defined",
        "power",
        "universally",
        "valid",
        "category",
        "indeed",
        "essential",
        "element",
        "politics",
        "various",
        "thing",
        "associated",
        "interest",
        "power",
        "different",
        "time",
        "different",
        "circumstance",
        "content",
        "manner",
        "use",
        "determined",
        "political",
        "cultural",
        "environment",
        "fourth",
        "principle",
        "morgenthau",
        "considers",
        "relationship",
        "realism",
        "ethic",
        "say",
        "realist",
        "aware",
        "moral",
        "significance",
        "political",
        "action",
        "also",
        "aware",
        "tension",
        "morality",
        "requirement",
        "successful",
        "political",
        "action",
        "universal",
        "moral",
        "principle",
        "asserts",
        "applied",
        "action",
        "state",
        "abstract",
        "universal",
        "formulation",
        "they",
        "must",
        "filtered",
        "concrete",
        "circumstance",
        "time",
        "place",
        "principle",
        "must",
        "accompanied",
        "prudence",
        "caution",
        "political",
        "morality",
        "without",
        "prudence",
        "without",
        "consideration",
        "political",
        "consequence",
        "seemingly",
        "moral",
        "action",
        "ibid",
        "prudence",
        "ability",
        "judge",
        "rightness",
        "given",
        "action",
        "among",
        "possible",
        "alternative",
        "basis",
        "likely",
        "political",
        "consequence",
        "conviction",
        "one",
        "moral",
        "ideological",
        "superiority",
        "guide",
        "political",
        "decision",
        "stressed",
        "fifth",
        "principle",
        "morgenthau",
        "emphasizes",
        "idea",
        "state",
        "actor",
        "including",
        "must",
        "looked",
        "solely",
        "political",
        "entity",
        "pursuing",
        "respective",
        "interest",
        "defined",
        "term",
        "power",
        "taking",
        "point",
        "view",
        "visàvis",
        "counterpart",
        "thus",
        "avoiding",
        "ideological",
        "confrontation",
        "state",
        "would",
        "able",
        "pursue",
        "policy",
        "respected",
        "interest",
        "state",
        "protecting",
        "promoting",
        "insofar",
        "power",
        "interest",
        "defined",
        "power",
        "concept",
        "defines",
        "politics",
        "politics",
        "autonomous",
        "sphere",
        "morgenthau",
        "say",
        "sixth",
        "principle",
        "realism",
        "subordinated",
        "ethic",
        "however",
        "ethic",
        "still",
        "play",
        "role",
        "politics",
        "man",
        "nothing",
        "political",
        "man",
        "would",
        "beast",
        "would",
        "completely",
        "lacking",
        "moral",
        "restraint",
        "man",
        "nothing",
        "moral",
        "man",
        "would",
        "fool",
        "would",
        "completely",
        "lacking",
        "prudence",
        "political",
        "art",
        "requires",
        "two",
        "dimension",
        "human",
        "life",
        "power",
        "morality",
        "taken",
        "consideration",
        "morgenthau",
        "six",
        "principle",
        "realism",
        "contain",
        "repetition",
        "inconsistency",
        "nonetheless",
        "obtain",
        "following",
        "picture",
        "power",
        "interest",
        "central",
        "concept",
        "make",
        "politics",
        "autonomous",
        "discipline",
        "rational",
        "state",
        "actor",
        "pursue",
        "national",
        "interest",
        "therefore",
        "rational",
        "theory",
        "international",
        "politics",
        "constructed",
        "theory",
        "concerned",
        "morality",
        "religious",
        "belief",
        "motif",
        "ideological",
        "preference",
        "individual",
        "political",
        "leader",
        "also",
        "indicates",
        "order",
        "avoid",
        "conflict",
        "state",
        "avoid",
        "moral",
        "crusade",
        "ideological",
        "confrontation",
        "look",
        "compromise",
        "based",
        "solely",
        "satisfaction",
        "mutual",
        "interest",
        "although",
        "defines",
        "politics",
        "autonomous",
        "sphere",
        "morgenthau",
        "separate",
        "ethic",
        "politics",
        "act",
        "protecting",
        "one",
        "country",
        "deep",
        "moral",
        "significance",
        "ultimately",
        "directed",
        "toward",
        "objective",
        "national",
        "survival",
        "involves",
        "prudence",
        "related",
        "choosing",
        "best",
        "course",
        "action",
        "effective",
        "protection",
        "citizen",
        "life",
        "harm",
        "case",
        "international",
        "armed",
        "conflict",
        "merely",
        "forceful",
        "physical",
        "action",
        "also",
        "prudential",
        "moral",
        "dimension",
        "morgenthau",
        "regard",
        "realism",
        "way",
        "thinking",
        "international",
        "relation",
        "useful",
        "tool",
        "devising",
        "policy",
        "however",
        "basic",
        "conception",
        "theory",
        "especially",
        "idea",
        "conflict",
        "stemming",
        "human",
        "nature",
        "well",
        "concept",
        "power",
        "provoked",
        "criticism",
        "international",
        "politics",
        "like",
        "politics",
        "morgenthau",
        "struggle",
        "power",
        "basic",
        "human",
        "lust",
        "power",
        "regarding",
        "every",
        "individual",
        "engaged",
        "perpetual",
        "quest",
        "powerthe",
        "view",
        "share",
        "hobbesis",
        "questionable",
        "premise",
        "human",
        "nature",
        "revealed",
        "observation",
        "experiment",
        "proved",
        "empirical",
        "research",
        "disclosed",
        "philosophy",
        "imposed",
        "u",
        "matter",
        "belief",
        "inculcated",
        "education",
        "morgenthau",
        "reinforces",
        "belief",
        "human",
        "drive",
        "power",
        "introducing",
        "normative",
        "aspect",
        "theory",
        "rationality",
        "rational",
        "foreign",
        "policy",
        "considered",
        "good",
        "foreign",
        "policy",
        "defines",
        "rationality",
        "process",
        "calculating",
        "cost",
        "benefit",
        "alternative",
        "policy",
        "order",
        "determine",
        "relative",
        "utility",
        "ie",
        "ability",
        "maximize",
        "power",
        "statesman",
        "think",
        "act",
        "term",
        "interest",
        "defined",
        "power",
        "intellectual",
        "weakness",
        "policy",
        "maker",
        "result",
        "foreign",
        "policy",
        "deviate",
        "rational",
        "course",
        "aimed",
        "minimizing",
        "risk",
        "maximizing",
        "benefit",
        "hence",
        "rather",
        "presenting",
        "actual",
        "portrait",
        "human",
        "affair",
        "morgenthau",
        "emphasizes",
        "pursuit",
        "power",
        "rationality",
        "pursuit",
        "set",
        "norm",
        "raymond",
        "aron",
        "scholar",
        "noticed",
        "power",
        "fundamental",
        "concept",
        "morgenthau",
        "realism",
        "ambiguous",
        "either",
        "mean",
        "end",
        "politics",
        "power",
        "mean",
        "gaining",
        "something",
        "else",
        "define",
        "nature",
        "international",
        "politics",
        "way",
        "morgenthau",
        "claim",
        "allow",
        "u",
        "understand",
        "action",
        "state",
        "independently",
        "motif",
        "ideological",
        "preference",
        "political",
        "leader",
        "serve",
        "basis",
        "defining",
        "politics",
        "autonomous",
        "sphere",
        "morgenthau",
        "principle",
        "realism",
        "thus",
        "open",
        "doubt",
        "true",
        "aron",
        "asks",
        "state",
        "whatever",
        "regime",
        "pursue",
        "kind",
        "foreign",
        "policy",
        "foreign",
        "policy",
        "napoleon",
        "stalin",
        "essentially",
        "identical",
        "hitler",
        "louis",
        "xvi",
        "nicholas",
        "ii",
        "amounting",
        "struggle",
        "power",
        "one",
        "answer",
        "yes",
        "proposition",
        "incontestable",
        "instructive",
        "accordingly",
        "useless",
        "define",
        "action",
        "state",
        "exclusive",
        "reference",
        "power",
        "security",
        "national",
        "interest",
        "international",
        "politics",
        "studied",
        "independently",
        "wider",
        "historical",
        "cultural",
        "context",
        "carr",
        "morgenthau",
        "concentrate",
        "primarily",
        "international",
        "relation",
        "however",
        "political",
        "realism",
        "also",
        "applied",
        "domestic",
        "politics",
        "classical",
        "realist",
        "general",
        "perceive",
        "politics",
        "conflict",
        "interest",
        "struggle",
        "power",
        "seek",
        "peace",
        "recognizing",
        "common",
        "interest",
        "trying",
        "satisfy",
        "rather",
        "moralizing",
        "bernard",
        "williams",
        "raymond",
        "geuss",
        "influential",
        "representative",
        "new",
        "political",
        "realism",
        "movement",
        "contemporary",
        "political",
        "theory",
        "criticize",
        "describe",
        "political",
        "moralism",
        "stress",
        "autonomy",
        "politics",
        "ethic",
        "however",
        "political",
        "theory",
        "realism",
        "international",
        "relation",
        "realism",
        "seem",
        "like",
        "two",
        "separate",
        "research",
        "program",
        "noted",
        "several",
        "scholar",
        "william",
        "scheuerman",
        "alison",
        "mcqueen",
        "terry",
        "nardin",
        "duncan",
        "bell",
        "contribute",
        "realism",
        "political",
        "theory",
        "give",
        "little",
        "attention",
        "work",
        "realism",
        "international",
        "politics"
    ]
}