{
    "main_text": "The Roots of the Realist Tradition || Thucydides and the Importance of Power\n1.1 Thucydides and the Importance of Power\n\nLike other classical political theorists, Thucydides (c. 460–c.\n400 B.C.E.) saw politics as involving moral questions. Most\nimportantly, he asks whether relations among states to which power is\ncrucial can also be guided by the norms of justice. His History of\nthe Peloponnesian War is in fact neither a work of political\nphilosophy nor a sustained theory of international relations. Much of\nthis work, which presents a partial account of the armed conflict\nbetween Athens and Sparta that took place from 431 to 404 B.C.E.,\nconsists of paired speeches by personages who argue opposing sides of\nan issue. Nevertheless, if the History is described as the\nonly acknowledged classical text in international relations, and if it\ninspires theorists from Hobbes to contemporary international relations\nscholars, this is because it is more than a chronicle of events, and a\ntheoretical position can be extrapolated from it. Realism is expressed\nin the very first speech of the Athenians recorded in the\nHistory—a speech given at the debate that took place in\nSparta just before the war. Moreover, a realist perspective is implied\nin the way Thucydides explains the cause of the Peloponnesian War, and\nalso in the famous “Melian Dialogue,” in the statements\nmade by the Athenian envoys.\n1.1.1 General Features of Realism in International Relations\n\nInternational relations realists emphasize the constraints imposed on\npolitics by the nature of human beings, whom they consider egoistic,\nand by the absence of international government. Together these factors\ncontribute to a conflict-based paradigm of international relations, in\nwhich the key actors are states, in which power and security become\nthe main issues, and in which there is little place for ethical norms.\nThe set of premises concerning state actors, egoism, anarchy, power,\nsecurity, and ethics that define the realist tradition are all present\nin Thucydides.\n\n(1) Human nature is a starting point for classical political realism.\nRealists view human beings as inherently egoistic and self-interested\nto the extent that self-interest overcomes moral principles. At the\ndebate in Sparta, described in Book I of Thucydides’\nHistory, the Athenians affirm the priority of self-interest\nover morality. They say that considerations of right and wrong have\n“never turned people aside from the opportunities of\naggrandizement offered by superior strength” (chap. 1 par.\n76).\n\n(2) Realists, and especially today’s neorealists, consider the\nabsence of government, literally anarchy, to be the primary\ndeterminant of international political outcomes. The lack of a common\nrule-making and enforcing authority means, they argue, that the\ninternational arena is essentially a self-help system. Each state is\nresponsible for its own survival and is free to define its own\ninterests and to pursue power. Anarchy thus leads to a situation in\nwhich power has the overriding role in shaping interstate relations.\nIn the words of the Athenian envoys at Melos, without any common\nauthority that can enforce order, “the independent states\nsurvive [only] when they are powerful” (5.97).\n\n(3) Insofar as realists envision the world of states as anarchic, they\nlikewise view security as a central issue. To attain security, states\ntry to increase their power and engage in power-balancing for the\npurpose of deterring potential aggressors. Wars are fought to prevent\ncompeting nations from becoming militarily stronger. Thucydides, while\ndistinguishing between the immediate and underlying causes of the\nPeloponnesian War, does not see its real cause in any of the\nparticular events that immediately preceded its outbreak. He instead\nlocates the cause of the war in the changing distribution of power\nbetween the two blocs of Greek city-states: the Delian League, under\nthe leadership of Athens, and the Peloponnesian League, under the\nleadership of Sparta. According to him, the growth of Athenian power\nmade the Spartans afraid for their security, and thus propelled them\ninto war (1.23). Referring to this situation, Graham Allison has\npopularized the expression “Thucydides trap” to describe\nthe danger which occurs when a rising power rivals an established one\n(2017). \n\n(4) Realists are generally skeptical about the relevance of ethics to\ninternational politics. This can lead them to claim that there is no\nplace for morality in the prescriptive sense in international\nrelations, or that there is a tension between demands of morality and\nrequirements of successful political action, or that states have their\nown morality that is different from customary morality, or that\nmorality, if employed at all, is merely used instrumentally to justify\nstates’ conduct. A clear case of the rejection of ethical norms\nin relations among states can be found in the “Melian\nDialogue” (5.85–113). This dialogue relates to the events\nof 416 B.C.E., when Athens invaded the island of Melos. The Athenian\nenvoys presented the Melians with a choice, destruction or surrender,\nand from the outset asked them not to appeal to justice, but to think\nonly about their survival. In the envoys’ words, “We both\nknow that the decisions about justice are made in human discussions\nonly when both sides are under equal compulsion, but when one side is\nstronger, it gets as much as it can, and the weak must accept\nthat” (5.89). To be “under equal compulsion” means\nto be under the force of law, and thus to be subjected to a common\nlawgiving authority (Korab-Karpowicz 2006, 234). Since such an\nauthority above states does not exist, the Athenians argue that in\nthis lawless condition of international anarchy, the only right is the\nright of the stronger to dominate the weaker. They explicitly equate\nright with might, and exclude considerations of justice from foreign\naffairs.\n1.1.2 The “Melian Dialogue”—The First Realist-Idealist Debate\n\nWe can thus find strong support for a realist perspective in the\nstatements of the Athenians. The question remains, however, to what\nextent their realism coincides with Thucydides’ own viewpoint.\nAlthough substantial passages of the “Melian Dialogue,” as\nwell as other parts of the History support a realistic\nreading, Thucydides’ position cannot be deduced from such\nselected fragments, but rather must be assessed on the basis of the\nwider context of his book. In fact, even the “Melian\nDialogue” itself provides us with a number of contending\nviews.\n\nPolitical realism is usually contrasted by IR scholars with idealism\nor liberalism, a theoretical perspective that emphasizes international\nnorms, interdependence among states, and international cooperation.\nThe “Melian Dialogue,” which is one of the most frequently\ncommented-upon parts of Thucydides’ History, presents\nthe classic debate between the idealist and realist views: Can\ninternational politics be based on a moral order derived from the\nprinciples of justice, or will it forever remain the arena of\nconflicting national interests and power?\n\nFor the Melians, who employ idealistic arguments, the choice is\nbetween war and subjection (5.86). They are courageous and love their\ncountry. They do not wish to lose their freedom, and in spite of the\nfact that they are militarily weaker than the Athenians, they are\nprepared to defend themselves (5.100; 5.112). They base their\narguments on an appeal to justice, which they associate with fairness,\nand regard the Athenians as unjust (5.90; 5.104). They are pious,\nbelieving that gods will support their just cause and compensate for\ntheir weakness, and trust in alliances, thinking that their allies,\nthe Spartans, who are also related to them, will help them (5.104;\n5.112). Hence, one can identify in the speech of the Melians elements\nof the idealistic or liberal world view: the belief that nations have\nthe right to exercise political independence, that they have mutual\nobligations to one another and will carry out such obligations, and\nthat a war of aggression is unjust. What the Melians nevertheless lack\nare resources and foresight. In their decision to defend themselves,\nthey are guided more by their hopes than by the evidence at hand or by\nprudent calculations.\n\nThe Athenian argument is based on key realist concepts such as\nsecurity and power, and is informed not by what the world should be,\nbut by what it is. The Athenians disregard any moral talk and urge the\nMelians to look at the facts—that is, to recognize their\nmilitary inferiority, to consider the potential consequences of their\ndecision, and to think about their own survival (5.87; 5.101). There\nappears to be a powerful realist logic behind the Athenian arguments.\nTheir position, based on security concerns and self-interest,\nseemingly involves reliance on rationality, intelligence, and\nforesight. However, upon close examination, their logic proves to be\nseriously flawed. Melos, a relatively weak state, does not pose any\nreal security threat to them. The eventual destruction of Melos does\nnot change the course of the Peloponnesian War, which Athens will lose\na few years later.\n\nIn the History, Thucydides shows that power, if it is\nunrestrained by moderation and a sense of justice, brings about the\nuncontrolled desire for more power. There are no logical limits to the\nsize of an empire. Drunk with the prospect of glory and gain, after\nconquering Melos, the Athenians engage in a war against Sicily. They\npay no attention to the Melian argument that considerations of justice\nare useful to all in the longer run (5.90). And, as the Athenians\noverestimate their strength and in the end lose the war, their\nself-interested logic proves to be very shortsighted indeed.\n\nIt is utopian to ignore the reality of power in international\nrelations, but it is equally blind to rely on power alone. Thucydides\nappears to support neither the naive idealism of the Melians nor the\ncynicism of their Athenian opponents. He teaches us to be on guard\n“against naïve-dreaming on international politics,”\non the one hand, and “against the other pernicious extreme:\nunrestrained cynicism,” on the other (Donnelly 2000, 193). If he\ncan be regarded as a political realist, his realism nonetheless\nprefigures neither realpolitik, in which prescriptive ethics\nis rejected, nor today’s scientific neorealism, in which moral\nquestions are largely ignored. Thucydides’ realism, neither\nimmoral nor amoral, can rather be compared to that of Hans Morgenthau,\nRaymond Aron, and other twentieth-century classical realists, who,\nalthough sensible to the demands of national interest, would not deny\nthat political actors on the international scene are subject to moral\njudgment. \n",
    "section_title": "1.1 Thucydides and the Importance of Power",
    "entry_title": "Political Realism in International Relations",
    "hierarchy_title": "Political Realism in International Relations || The Roots of the Realist Tradition || Thucydides and the Importance of Power",
    "tokenized_text": [
        "root",
        "realist",
        "tradition",
        "thucydides",
        "importance",
        "power",
        "thucydides",
        "importance",
        "power",
        "like",
        "classical",
        "political",
        "theorist",
        "thucydides",
        "c",
        "c",
        "bce",
        "saw",
        "politics",
        "involving",
        "moral",
        "question",
        "importantly",
        "asks",
        "whether",
        "relation",
        "among",
        "state",
        "power",
        "crucial",
        "also",
        "guided",
        "norm",
        "justice",
        "history",
        "peloponnesian",
        "war",
        "fact",
        "neither",
        "work",
        "political",
        "philosophy",
        "sustained",
        "theory",
        "international",
        "relation",
        "much",
        "work",
        "present",
        "partial",
        "account",
        "armed",
        "conflict",
        "athens",
        "sparta",
        "took",
        "place",
        "bce",
        "consists",
        "paired",
        "speech",
        "personage",
        "argue",
        "opposing",
        "side",
        "issue",
        "nevertheless",
        "history",
        "described",
        "acknowledged",
        "classical",
        "text",
        "international",
        "relation",
        "inspires",
        "theorist",
        "hobbes",
        "contemporary",
        "international",
        "relation",
        "scholar",
        "chronicle",
        "event",
        "theoretical",
        "position",
        "extrapolated",
        "realism",
        "expressed",
        "first",
        "speech",
        "athenian",
        "recorded",
        "historya",
        "speech",
        "given",
        "debate",
        "took",
        "place",
        "sparta",
        "war",
        "moreover",
        "realist",
        "perspective",
        "implied",
        "way",
        "thucydides",
        "explains",
        "cause",
        "peloponnesian",
        "war",
        "also",
        "famous",
        "melian",
        "dialogue",
        "statement",
        "made",
        "athenian",
        "envoy",
        "general",
        "feature",
        "realism",
        "international",
        "relation",
        "international",
        "relation",
        "realist",
        "emphasize",
        "constraint",
        "imposed",
        "politics",
        "nature",
        "human",
        "being",
        "consider",
        "egoistic",
        "absence",
        "international",
        "government",
        "together",
        "factor",
        "contribute",
        "conflictbased",
        "paradigm",
        "international",
        "relation",
        "key",
        "actor",
        "state",
        "power",
        "security",
        "become",
        "main",
        "issue",
        "little",
        "place",
        "ethical",
        "norm",
        "set",
        "premise",
        "concerning",
        "state",
        "actor",
        "egoism",
        "anarchy",
        "power",
        "security",
        "ethic",
        "define",
        "realist",
        "tradition",
        "present",
        "thucydides",
        "human",
        "nature",
        "starting",
        "point",
        "classical",
        "political",
        "realism",
        "realist",
        "view",
        "human",
        "being",
        "inherently",
        "egoistic",
        "selfinterested",
        "extent",
        "selfinterest",
        "overcomes",
        "moral",
        "principle",
        "debate",
        "sparta",
        "described",
        "book",
        "thucydides",
        "history",
        "athenian",
        "affirm",
        "priority",
        "selfinterest",
        "morality",
        "say",
        "consideration",
        "right",
        "wrong",
        "never",
        "turned",
        "people",
        "aside",
        "opportunity",
        "aggrandizement",
        "offered",
        "superior",
        "strength",
        "chap",
        "par",
        "realist",
        "especially",
        "today",
        "neorealists",
        "consider",
        "absence",
        "government",
        "literally",
        "anarchy",
        "primary",
        "determinant",
        "international",
        "political",
        "outcome",
        "lack",
        "common",
        "rulemaking",
        "enforcing",
        "authority",
        "mean",
        "argue",
        "international",
        "arena",
        "essentially",
        "selfhelp",
        "system",
        "state",
        "responsible",
        "survival",
        "free",
        "define",
        "interest",
        "pursue",
        "power",
        "anarchy",
        "thus",
        "lead",
        "situation",
        "power",
        "overriding",
        "role",
        "shaping",
        "interstate",
        "relation",
        "word",
        "athenian",
        "envoy",
        "melos",
        "without",
        "common",
        "authority",
        "enforce",
        "order",
        "independent",
        "state",
        "survive",
        "powerful",
        "insofar",
        "realist",
        "envision",
        "world",
        "state",
        "anarchic",
        "likewise",
        "view",
        "security",
        "central",
        "issue",
        "attain",
        "security",
        "state",
        "try",
        "increase",
        "power",
        "engage",
        "powerbalancing",
        "purpose",
        "deterring",
        "potential",
        "aggressor",
        "war",
        "fought",
        "prevent",
        "competing",
        "nation",
        "becoming",
        "militarily",
        "stronger",
        "thucydides",
        "distinguishing",
        "immediate",
        "underlying",
        "cause",
        "peloponnesian",
        "war",
        "see",
        "real",
        "cause",
        "particular",
        "event",
        "immediately",
        "preceded",
        "outbreak",
        "instead",
        "locates",
        "cause",
        "war",
        "changing",
        "distribution",
        "power",
        "two",
        "bloc",
        "greek",
        "citystate",
        "delian",
        "league",
        "leadership",
        "athens",
        "peloponnesian",
        "league",
        "leadership",
        "sparta",
        "according",
        "growth",
        "athenian",
        "power",
        "made",
        "spartan",
        "afraid",
        "security",
        "thus",
        "propelled",
        "war",
        "referring",
        "situation",
        "graham",
        "allison",
        "popularized",
        "expression",
        "thucydides",
        "trap",
        "describe",
        "danger",
        "occurs",
        "rising",
        "power",
        "rival",
        "established",
        "one",
        "realist",
        "generally",
        "skeptical",
        "relevance",
        "ethic",
        "international",
        "politics",
        "lead",
        "claim",
        "place",
        "morality",
        "prescriptive",
        "sense",
        "international",
        "relation",
        "tension",
        "demand",
        "morality",
        "requirement",
        "successful",
        "political",
        "action",
        "state",
        "morality",
        "different",
        "customary",
        "morality",
        "morality",
        "employed",
        "merely",
        "used",
        "instrumentally",
        "justify",
        "state",
        "conduct",
        "clear",
        "case",
        "rejection",
        "ethical",
        "norm",
        "relation",
        "among",
        "state",
        "found",
        "melian",
        "dialogue",
        "dialogue",
        "relates",
        "event",
        "bce",
        "athens",
        "invaded",
        "island",
        "melos",
        "athenian",
        "envoy",
        "presented",
        "melians",
        "choice",
        "destruction",
        "surrender",
        "outset",
        "asked",
        "appeal",
        "justice",
        "think",
        "survival",
        "envoy",
        "word",
        "know",
        "decision",
        "justice",
        "made",
        "human",
        "discussion",
        "side",
        "equal",
        "compulsion",
        "one",
        "side",
        "stronger",
        "get",
        "much",
        "weak",
        "must",
        "accept",
        "equal",
        "compulsion",
        "mean",
        "force",
        "law",
        "thus",
        "subjected",
        "common",
        "lawgiving",
        "authority",
        "korabkarpowicz",
        "since",
        "authority",
        "state",
        "exist",
        "athenian",
        "argue",
        "lawless",
        "condition",
        "international",
        "anarchy",
        "right",
        "right",
        "stronger",
        "dominate",
        "weaker",
        "explicitly",
        "equate",
        "right",
        "might",
        "exclude",
        "consideration",
        "justice",
        "foreign",
        "affair",
        "melian",
        "dialogue",
        "the",
        "first",
        "realistidealist",
        "debate",
        "thus",
        "find",
        "strong",
        "support",
        "realist",
        "perspective",
        "statement",
        "athenian",
        "question",
        "remains",
        "however",
        "extent",
        "realism",
        "coincides",
        "thucydides",
        "viewpoint",
        "although",
        "substantial",
        "passage",
        "melian",
        "dialogue",
        "well",
        "part",
        "history",
        "support",
        "realistic",
        "reading",
        "thucydides",
        "position",
        "deduced",
        "selected",
        "fragment",
        "rather",
        "must",
        "assessed",
        "basis",
        "wider",
        "context",
        "book",
        "fact",
        "even",
        "melian",
        "dialogue",
        "provides",
        "u",
        "number",
        "contending",
        "view",
        "political",
        "realism",
        "usually",
        "contrasted",
        "ir",
        "scholar",
        "idealism",
        "liberalism",
        "theoretical",
        "perspective",
        "emphasizes",
        "international",
        "norm",
        "interdependence",
        "among",
        "state",
        "international",
        "cooperation",
        "melian",
        "dialogue",
        "one",
        "frequently",
        "commentedupon",
        "part",
        "thucydides",
        "history",
        "present",
        "classic",
        "debate",
        "idealist",
        "realist",
        "view",
        "international",
        "politics",
        "based",
        "moral",
        "order",
        "derived",
        "principle",
        "justice",
        "forever",
        "remain",
        "arena",
        "conflicting",
        "national",
        "interest",
        "power",
        "melians",
        "employ",
        "idealistic",
        "argument",
        "choice",
        "war",
        "subjection",
        "courageous",
        "love",
        "country",
        "wish",
        "lose",
        "freedom",
        "spite",
        "fact",
        "militarily",
        "weaker",
        "athenian",
        "prepared",
        "defend",
        "base",
        "argument",
        "appeal",
        "justice",
        "associate",
        "fairness",
        "regard",
        "athenian",
        "unjust",
        "pious",
        "believing",
        "god",
        "support",
        "cause",
        "compensate",
        "weakness",
        "trust",
        "alliance",
        "thinking",
        "ally",
        "spartan",
        "also",
        "related",
        "help",
        "hence",
        "one",
        "identify",
        "speech",
        "melians",
        "element",
        "idealistic",
        "liberal",
        "world",
        "view",
        "belief",
        "nation",
        "right",
        "exercise",
        "political",
        "independence",
        "mutual",
        "obligation",
        "one",
        "another",
        "carry",
        "obligation",
        "war",
        "aggression",
        "unjust",
        "melians",
        "nevertheless",
        "lack",
        "resource",
        "foresight",
        "decision",
        "defend",
        "guided",
        "hope",
        "evidence",
        "hand",
        "prudent",
        "calculation",
        "athenian",
        "argument",
        "based",
        "key",
        "realist",
        "concept",
        "security",
        "power",
        "informed",
        "world",
        "athenian",
        "disregard",
        "moral",
        "talk",
        "urge",
        "melians",
        "look",
        "factsthat",
        "recognize",
        "military",
        "inferiority",
        "consider",
        "potential",
        "consequence",
        "decision",
        "think",
        "survival",
        "appears",
        "powerful",
        "realist",
        "logic",
        "behind",
        "athenian",
        "argument",
        "position",
        "based",
        "security",
        "concern",
        "selfinterest",
        "seemingly",
        "involves",
        "reliance",
        "rationality",
        "intelligence",
        "foresight",
        "however",
        "upon",
        "close",
        "examination",
        "logic",
        "prof",
        "seriously",
        "flawed",
        "melos",
        "relatively",
        "weak",
        "state",
        "pose",
        "real",
        "security",
        "threat",
        "eventual",
        "destruction",
        "melos",
        "change",
        "course",
        "peloponnesian",
        "war",
        "athens",
        "lose",
        "year",
        "later",
        "history",
        "thucydides",
        "show",
        "power",
        "unrestrained",
        "moderation",
        "sense",
        "justice",
        "brings",
        "uncontrolled",
        "desire",
        "power",
        "logical",
        "limit",
        "size",
        "empire",
        "drunk",
        "prospect",
        "glory",
        "gain",
        "conquering",
        "melos",
        "athenian",
        "engage",
        "war",
        "sicily",
        "pay",
        "attention",
        "melian",
        "argument",
        "consideration",
        "justice",
        "useful",
        "longer",
        "run",
        "athenian",
        "overestimate",
        "strength",
        "end",
        "lose",
        "war",
        "selfinterested",
        "logic",
        "prof",
        "shortsighted",
        "indeed",
        "utopian",
        "ignore",
        "reality",
        "power",
        "international",
        "relation",
        "equally",
        "blind",
        "rely",
        "power",
        "alone",
        "thucydides",
        "appears",
        "support",
        "neither",
        "naive",
        "idealism",
        "melians",
        "cynicism",
        "athenian",
        "opponent",
        "teach",
        "u",
        "guard",
        "naïvedreaming",
        "international",
        "politics",
        "one",
        "hand",
        "pernicious",
        "extreme",
        "unrestrained",
        "cynicism",
        "donnelly",
        "regarded",
        "political",
        "realist",
        "realism",
        "nonetheless",
        "prefigures",
        "neither",
        "realpolitik",
        "prescriptive",
        "ethic",
        "rejected",
        "today",
        "scientific",
        "neorealism",
        "moral",
        "question",
        "largely",
        "ignored",
        "thucydides",
        "realism",
        "neither",
        "immoral",
        "amoral",
        "rather",
        "compared",
        "han",
        "morgenthau",
        "raymond",
        "aron",
        "twentiethcentury",
        "classical",
        "realist",
        "although",
        "sensible",
        "demand",
        "national",
        "interest",
        "would",
        "deny",
        "political",
        "actor",
        "international",
        "scene",
        "subject",
        "moral",
        "judgment"
    ]
}