{
    "main_text": "Motivating and Explanatory Reasons\n3. Motivating and Explanatory Reasons\n\nIt was suggested above that although reasons are traditionally divided\ninto two kinds: normative and motivating/explanatory, there may be a\ncase for distinguishing between motivating reasons and explanatory\nreasons. The basis for doing so was said to be the existence of three\ndistinct questions about reasons: whether a reason favours an\naction; whether a reason motivates an agent; and whether a\nreason explains an agent’s action. Accordingly, the\nthought goes, we should recognise three kinds of reasons: normative,\nmotivating and explanatory. This way of classifying reasons is\nexplicitly accepted and/or defended by various authors (Baier 1958;\nAlvarez 2007, 2009a, 2010; Hieronymi 2011); and it is hinted at, using\ndifferent terminology, by others (Smith 1994; Darwall 2003; Mantel\n2014).\n\nThis three-part classification may seem excessively refined: is it\nreally necessary or advantageous to distinguish motivating and\nexplanatory reasons? After all, a motivating reason can always explain\nthe action that it motivates, so the question of what reason motivates\nan agent and what reason explains her action are, one might think,\nfundamentally the same. If so, “motivating” and\n“explanatory” are surely just different labels for the\nsame kind of reason, at least in contexts of intentional actions. And\nthere appears to be no obvious advantage in regarding motivating and\nexplanatory reasons as distinct kinds.\n\nThese considerations against a three-part classification of reasons,\nthough plausible, are not decisive. First, the fact that the same\nreason can answer different questions does not show that the questions\nare not importantly different and, consequently that the reasons that\nanswer those questions are not of different kinds. We saw that to be\nso for normative and motivating reasons: the same reason can answer a\nquestion about motivation and one about justification. And yet, that\ndoes not blur the difference between those questions, nor does it\nundermine the importance of recognising the corresponding two kinds of\nreasons. So the same may be true for motivating and explanatory\nreasons.\n\nSecond, even if the same reason sometimes answers the two questions\nabout motivation and explanation, this is not always so. Although a\nreason that motivates an action can always explain it, a reason that\ncan explain the action is not always the reason that motivates it. For\nexample, that he is jealous is a reason that explains why Othello\nkills Desdemona. But that is not the reason that motivates him to kill\nher. This example may appear not to be to the point because an\nexplanation that refers to his jealousy is not a\nrationalisation of Othello’s action: it doesn’t\nexplain his action by citing his reason. That is right and\nyet the example still shows that not all reasons that explain by\nciting psychological factors, e.g., jealousy, are reasons that\nmotivate. Moreover, knowing that Othello acted out of jealousy gives\nan indication of Othello’s reason (Desdemona’s suspected\nunfaithfulness) and yet the reason of jealousy is not Othello’s\nmotivating reason. Besides, the explaining and motivating reasons may\ndiffer even in cases where the reason that explains makes reference to\nthe reason that motivates. For suppose that John punches Peter because\nhe finds out that Peter has betrayed him. The fact that John knows\nthat Peter has betrayed him is a reason that explains John’s\naction. This is an explanatory reason. But that fact about\nJohn’s mental state of knowledge is not the reason for which\nJohn punches Peter. That reason is a fact about Peter, namely that he\nhas betrayed John. That is the reason that motivates John to punch\nPeter—his motivating reason. So in this case we have two\ndifferent (though related) reasons: that Peter has betrayed John and\nthat John knows that Peter has betrayed him, which play different\nroles. One reason motivates John to punch Peter (the betrayal); and\nthe other explains why he does it (the knowledge of the betrayal). To\nbe sure, the latter reason explains by reference to the former.\nNonetheless, these are different reasons that answer different questions about\nmotivation and explanation, respectively.\n\nBut isn’t this distinction superficial? After all, the fact that\nmotivates John, i.e., that Peter has betrayed him, can also explain\nJohn’s action—we need not cite John’s knowledge of\nthis fact. As we shall see below\n (3.2),\n this is controversial: some philosophers think that all reason\nexplanations require reference to psychological states of the agent.\nBe that as it may, consider a different example. The fact that Othello\nbelieves that Desdemona is unfaithful explains why he kills her. But\nthe fact that he believes in her infidelity is not the reason in light\nof which he kills her, the reason that, in his eyes, favours killing\nher. What he takes to favour killing her is the (putative) fact that\nshe is unfaithful. Again, these are importantly different reasons: for\nit can be the case that Othello believes that Desdemona is unfaithful\nwithout it being the case that she is, and vice versa.\nMoreover, since Desdemona is not unfaithful, that putative fact cannot\nbe what explains Othello’s action because something that is not\nthe case cannot explain anything—though, as we shall see below\n(also\n 3.2),\n this view of explanation has proved controversial too.\n\nThe intricacies of these controversies suggest that it may indeed be\nhelpful to keep apart questions of motivation and questions of\nexplanation even when we are dealing with reason explanations of\naction. The advantages of drawing this distinction will be spelled out\nin examining debates concerning motivating reasons and the explanation\nof action. We shall see there that apparently competing claims about\nmotivating reasons and the explanation of action are often best\nunderstood and resolved as claims about motivating or explanatory\nreasons, respectively. The following passage, in which Stephen Darwall\ncomments on a putative disagreement between Dancy and Michael Smith,\nhelps to illustrate the point of the distinction:\n\n\n“Motivating reason” in Dancy’s pen means the\nagent’s reason, the (believed, putative) fact in light of which\nthe agent acted. Smith, however, uses “the agent’s\nnormative reason” to refer to this and “motivating\nreason” to refer to the desire/belief combination necessary to\nexplain behavior teleologically. (Darwall 2003: 442–3)\n\n\nUsing the terminology introduced above, we can reframe Darwall’s\npoint as follows. When Dancy says that reasons are (putative) facts\nthat agents take to favour their actions, he is talking about\nmotivating reasons. By contrast, when Smith says that reasons are\ncombinations of mental states of believing and desiring, he is talking\nabout explanatory reasons. So Dancy and Smith may not be disagreeing\nbut, rather, using the same term, “motivating reason” for\ntwo different concepts: Dancy is using it to refer to the reasons in\nlight of which an agent acts, while Smith is using it to refer to the\nreasons that explain an agent’s act.\n\nOne of the most intensely debated issues concerning both motivating\nand explanatory reasons is their ontology: what kind of thing are\nthese reasons? The philosophical literature of the last half of the\n20th century was premised on the more or less explicit\nassumption that motivating and explanatory reasons, which at the time\nwere not normally explicitly distinguished, were psychological\nentities, in particular, mental states of agents, such as\nOthello’s believing that Desdemona is unfaithful to him. This\nview of the ontology of reasons is often called “Psychologism”.\nThat consensus began to dissolve at the turn of the century and\npsychologism came under sustained attack. Opposition to it is\nvariously labelled “non-psychologism”,\n“externalism” and “objectivism”. The last two\nlabels are also used for a variety of other philosophical views so, to\navoid confusion, I will stick with the term\n“Non-psychologism”.\n\nDonald Davidson’s 1963 paper, “Actions, Reasons, and\nCauses” is often cited as the locus classicus of\npsychologism. In that paper he characterises a reason as follows:\n\n\nC1. R is a primary reason why an agent performed the action\nA under the description d only if R consists of a\npro attitude of the agent toward actions with a certain property, and\na belief of the agent that A, under the description d,\nhas that property. (1963: 687)\n\n\nA primary reason is a combination of two mental states: a pro-attitude\nand a belief. These “primary reasons” are, in effect,\nexplanatory reasons: reasons that explain actions. Davidson defended\nthe “desire-belief” model of action explanation, according\nto which reasons are states of believing and desiring that explain\nactions because they cause them. This model is at the centre of\nDavidson’s account of intentional action, which he characterises\nas an event caused “in the right way” by a primary reason.\nDavidson’s paper was highly influential; as a result,\npsychologism became the dominant view for both motivating and\nexplanatory reasons, which, as noted above, were then not explicitly\ndistinguished.\n\nPsychologism is very appealing. For it seems right that when an agent\nacts for a reason, he acts motivated by an end that he desires (an end\ntowards which he has a “pro-attitude”) and guided by a\nbelief about how to achieve that end. Because of this, it is possible\nto explain his action by citing his desiring and his believing the\nrelevant things. To return to our example, we can explain why Othello\nkills Desdemona by citing his wanting to defend his honour and his\nbelieving that, given that Desdemona has been unfaithful, killing her\nis the only way to do so. And this sort of explanation in terms of\nstates of belief and desire supports the relevant counterfactuals: had\nOthello not believed that she had been unfaithful or had he not\nbelieved that killing her was the only way to defend his honour, he\nwouldn’t have killed her, even if he had still wanted to restore\nhis reputation; and had he not cared about his reputation, he\nwouldn’t have killed her, despite his beliefs about her betrayal\nand what was necessary to defend his honour. This sort of\nconsideration led to widespread acceptance of the view that\nexplanatory reasons are mental states and, since the latter were not\ndistinguished from motivating reasons, it also led to the view that\nmotivating reasons are mental states.\n\nAmong psychologists, some say that motivating and explanatory reasons\nare mental or psychological facts, rather than mental states.\nThis is because psychologism holds that reasons are mental states such\nas “an agent’s believing (or wanting, or knowing)\nsomething”, and it is easy to move from the claim that\nsomeone’s reason is his believing something (a mental\nstate) to the claim that his reason is that he believes\nsomething (a psychological fact). For instance, it is easy to move\nfrom saying that Joe’s reason for running is his believing that\nhe’s late (a mental state) to saying that Joe’s reason is\n(the fact) that he believes that he’s late.\n\nThese defenders of psychologism do not on the face of it disagree with\nchampions of non-psychologism about the ontology of these reasons. For\npsychological facts are not themselves mental states, though they are\nfacts about mental states. But they still disagree with non-psychologists about\nwhat these reasons are. Because of this, we need a way to\ndistinguish between psychologism and non-psychologism other than in terms of\nontology—the kind of thing that each camp says reasons\nare—in order to capture the deeper disagreement between them.\nPerhaps a better way to do so is to say that psychologism holds that\nmotivating and explanatory reasons are mental states or facts about\nmental states of agents, whereas non-psychologism says that\nmotivating and explanatory reasons, like normative reasons, are facts\nabout all sorts of things, including mental states of agents.\n\nThe following sections examine current debates about psychologism, and\nother issues, concerning motivating and explanatory reasons. It\ndoes so separately for reasons of each kind, as that will facilitate\nclarity in the various debates. We start with motivating reasons.\n",
    "section_title": "3. Motivating and Explanatory Reasons",
    "entry_title": "Reasons for Action: Justification, Motivation, Explanation",
    "hierarchy_title": "Reasons for Action: Justification, Motivation, Explanation || Motivating and Explanatory Reasons",
    "tokenized_text": [
        "motivating",
        "explanatory",
        "reason",
        "motivating",
        "explanatory",
        "reason",
        "suggested",
        "although",
        "reason",
        "traditionally",
        "divided",
        "two",
        "kind",
        "normative",
        "motivatingexplanatory",
        "may",
        "case",
        "distinguishing",
        "motivating",
        "reason",
        "explanatory",
        "reason",
        "basis",
        "said",
        "existence",
        "three",
        "distinct",
        "question",
        "reason",
        "whether",
        "reason",
        "favour",
        "action",
        "whether",
        "reason",
        "motivates",
        "agent",
        "whether",
        "reason",
        "explains",
        "agent",
        "action",
        "accordingly",
        "thought",
        "go",
        "recognise",
        "three",
        "kind",
        "reason",
        "normative",
        "motivating",
        "explanatory",
        "way",
        "classifying",
        "reason",
        "explicitly",
        "accepted",
        "andor",
        "defended",
        "various",
        "author",
        "baier",
        "alvarez",
        "a",
        "hieronymi",
        "hinted",
        "using",
        "different",
        "terminology",
        "others",
        "smith",
        "darwall",
        "mantel",
        "threepart",
        "classification",
        "may",
        "seem",
        "excessively",
        "refined",
        "really",
        "necessary",
        "advantageous",
        "distinguish",
        "motivating",
        "explanatory",
        "reason",
        "motivating",
        "reason",
        "always",
        "explain",
        "action",
        "motivates",
        "question",
        "reason",
        "motivates",
        "agent",
        "reason",
        "explains",
        "action",
        "one",
        "might",
        "think",
        "fundamentally",
        "motivating",
        "explanatory",
        "surely",
        "different",
        "label",
        "kind",
        "reason",
        "least",
        "context",
        "intentional",
        "action",
        "appears",
        "obvious",
        "advantage",
        "regarding",
        "motivating",
        "explanatory",
        "reason",
        "distinct",
        "kind",
        "consideration",
        "threepart",
        "classification",
        "reason",
        "though",
        "plausible",
        "decisive",
        "first",
        "fact",
        "reason",
        "answer",
        "different",
        "question",
        "show",
        "question",
        "importantly",
        "different",
        "consequently",
        "reason",
        "answer",
        "question",
        "different",
        "kind",
        "saw",
        "normative",
        "motivating",
        "reason",
        "reason",
        "answer",
        "question",
        "motivation",
        "one",
        "justification",
        "yet",
        "blur",
        "difference",
        "question",
        "undermine",
        "importance",
        "recognising",
        "corresponding",
        "two",
        "kind",
        "reason",
        "may",
        "true",
        "motivating",
        "explanatory",
        "reason",
        "second",
        "even",
        "reason",
        "sometimes",
        "answer",
        "two",
        "question",
        "motivation",
        "explanation",
        "always",
        "although",
        "reason",
        "motivates",
        "action",
        "always",
        "explain",
        "reason",
        "explain",
        "action",
        "always",
        "reason",
        "motivates",
        "example",
        "jealous",
        "reason",
        "explains",
        "othello",
        "kill",
        "desdemona",
        "reason",
        "motivates",
        "kill",
        "example",
        "may",
        "appear",
        "point",
        "explanation",
        "refers",
        "jealousy",
        "rationalisation",
        "othello",
        "action",
        "explain",
        "action",
        "citing",
        "reason",
        "right",
        "yet",
        "example",
        "still",
        "show",
        "reason",
        "explain",
        "citing",
        "psychological",
        "factor",
        "eg",
        "jealousy",
        "reason",
        "motivate",
        "moreover",
        "knowing",
        "othello",
        "acted",
        "jealousy",
        "give",
        "indication",
        "othello",
        "reason",
        "desdemona",
        "suspected",
        "unfaithfulness",
        "yet",
        "reason",
        "jealousy",
        "othello",
        "motivating",
        "reason",
        "besides",
        "explaining",
        "motivating",
        "reason",
        "may",
        "differ",
        "even",
        "case",
        "reason",
        "explains",
        "make",
        "reference",
        "reason",
        "motivates",
        "suppose",
        "john",
        "punch",
        "peter",
        "find",
        "peter",
        "betrayed",
        "fact",
        "john",
        "know",
        "peter",
        "betrayed",
        "reason",
        "explains",
        "john",
        "action",
        "explanatory",
        "reason",
        "fact",
        "john",
        "mental",
        "state",
        "knowledge",
        "reason",
        "john",
        "punch",
        "peter",
        "reason",
        "fact",
        "peter",
        "namely",
        "betrayed",
        "john",
        "reason",
        "motivates",
        "john",
        "punch",
        "peterhis",
        "motivating",
        "reason",
        "case",
        "two",
        "different",
        "though",
        "related",
        "reason",
        "peter",
        "betrayed",
        "john",
        "john",
        "know",
        "peter",
        "betrayed",
        "play",
        "different",
        "role",
        "one",
        "reason",
        "motivates",
        "john",
        "punch",
        "peter",
        "betrayal",
        "explains",
        "knowledge",
        "betrayal",
        "sure",
        "latter",
        "reason",
        "explains",
        "reference",
        "former",
        "nonetheless",
        "different",
        "reason",
        "answer",
        "different",
        "question",
        "motivation",
        "explanation",
        "respectively",
        "distinction",
        "superficial",
        "fact",
        "motivates",
        "john",
        "ie",
        "peter",
        "betrayed",
        "also",
        "explain",
        "john",
        "actionwe",
        "need",
        "cite",
        "john",
        "knowledge",
        "fact",
        "shall",
        "see",
        "controversial",
        "philosopher",
        "think",
        "reason",
        "explanation",
        "require",
        "reference",
        "psychological",
        "state",
        "agent",
        "may",
        "consider",
        "different",
        "example",
        "fact",
        "othello",
        "belief",
        "desdemona",
        "unfaithful",
        "explains",
        "kill",
        "fact",
        "belief",
        "infidelity",
        "reason",
        "light",
        "kill",
        "reason",
        "eye",
        "favour",
        "killing",
        "take",
        "favour",
        "killing",
        "putative",
        "fact",
        "unfaithful",
        "importantly",
        "different",
        "reason",
        "case",
        "othello",
        "belief",
        "desdemona",
        "unfaithful",
        "without",
        "case",
        "vice",
        "versa",
        "moreover",
        "since",
        "desdemona",
        "unfaithful",
        "putative",
        "fact",
        "explains",
        "othello",
        "action",
        "something",
        "case",
        "explain",
        "anythingthough",
        "shall",
        "see",
        "also",
        "view",
        "explanation",
        "proved",
        "controversial",
        "intricacy",
        "controversy",
        "suggest",
        "may",
        "indeed",
        "helpful",
        "keep",
        "apart",
        "question",
        "motivation",
        "question",
        "explanation",
        "even",
        "dealing",
        "reason",
        "explanation",
        "action",
        "advantage",
        "drawing",
        "distinction",
        "spelled",
        "examining",
        "debate",
        "concerning",
        "motivating",
        "reason",
        "explanation",
        "action",
        "shall",
        "see",
        "apparently",
        "competing",
        "claim",
        "motivating",
        "reason",
        "explanation",
        "action",
        "often",
        "best",
        "understood",
        "resolved",
        "claim",
        "motivating",
        "explanatory",
        "reason",
        "respectively",
        "following",
        "passage",
        "stephen",
        "darwall",
        "comment",
        "putative",
        "disagreement",
        "dancy",
        "michael",
        "smith",
        "help",
        "illustrate",
        "point",
        "distinction",
        "motivating",
        "reason",
        "dancy",
        "pen",
        "mean",
        "agent",
        "reason",
        "believed",
        "putative",
        "fact",
        "light",
        "agent",
        "acted",
        "smith",
        "however",
        "us",
        "agent",
        "normative",
        "reason",
        "refer",
        "motivating",
        "reason",
        "refer",
        "desirebelief",
        "combination",
        "necessary",
        "explain",
        "behavior",
        "teleologically",
        "darwall",
        "using",
        "terminology",
        "introduced",
        "reframe",
        "darwall",
        "point",
        "follows",
        "dancy",
        "say",
        "reason",
        "putative",
        "fact",
        "agent",
        "take",
        "favour",
        "action",
        "talking",
        "motivating",
        "reason",
        "contrast",
        "smith",
        "say",
        "reason",
        "combination",
        "mental",
        "state",
        "believing",
        "desiring",
        "talking",
        "explanatory",
        "reason",
        "dancy",
        "smith",
        "may",
        "disagreeing",
        "rather",
        "using",
        "term",
        "motivating",
        "reason",
        "two",
        "different",
        "concept",
        "dancy",
        "using",
        "refer",
        "reason",
        "light",
        "agent",
        "act",
        "smith",
        "using",
        "refer",
        "reason",
        "explain",
        "agent",
        "act",
        "one",
        "intensely",
        "debated",
        "issue",
        "concerning",
        "motivating",
        "explanatory",
        "reason",
        "ontology",
        "kind",
        "thing",
        "reason",
        "philosophical",
        "literature",
        "last",
        "half",
        "th",
        "century",
        "premised",
        "le",
        "explicit",
        "assumption",
        "motivating",
        "explanatory",
        "reason",
        "time",
        "normally",
        "explicitly",
        "distinguished",
        "psychological",
        "entity",
        "particular",
        "mental",
        "state",
        "agent",
        "othello",
        "believing",
        "desdemona",
        "unfaithful",
        "view",
        "ontology",
        "reason",
        "often",
        "called",
        "psychologism",
        "consensus",
        "began",
        "dissolve",
        "turn",
        "century",
        "psychologism",
        "came",
        "sustained",
        "attack",
        "opposition",
        "variously",
        "labelled",
        "nonpsychologism",
        "externalism",
        "objectivism",
        "last",
        "two",
        "label",
        "also",
        "used",
        "variety",
        "philosophical",
        "view",
        "avoid",
        "confusion",
        "stick",
        "term",
        "nonpsychologism",
        "donald",
        "davidson",
        "paper",
        "action",
        "reason",
        "cause",
        "often",
        "cited",
        "locus",
        "classicus",
        "psychologism",
        "paper",
        "characterises",
        "reason",
        "follows",
        "c",
        "r",
        "primary",
        "reason",
        "agent",
        "performed",
        "action",
        "description",
        "r",
        "consists",
        "pro",
        "attitude",
        "agent",
        "toward",
        "action",
        "certain",
        "property",
        "belief",
        "agent",
        "description",
        "property",
        "primary",
        "reason",
        "combination",
        "two",
        "mental",
        "state",
        "proattitude",
        "belief",
        "primary",
        "reason",
        "effect",
        "explanatory",
        "reason",
        "reason",
        "explain",
        "action",
        "davidson",
        "defended",
        "desirebelief",
        "model",
        "action",
        "explanation",
        "according",
        "reason",
        "state",
        "believing",
        "desiring",
        "explain",
        "action",
        "cause",
        "model",
        "centre",
        "davidson",
        "account",
        "intentional",
        "action",
        "characterises",
        "event",
        "caused",
        "right",
        "way",
        "primary",
        "reason",
        "davidson",
        "paper",
        "highly",
        "influential",
        "result",
        "psychologism",
        "became",
        "dominant",
        "view",
        "motivating",
        "explanatory",
        "reason",
        "noted",
        "explicitly",
        "distinguished",
        "psychologism",
        "appealing",
        "seems",
        "right",
        "agent",
        "act",
        "reason",
        "act",
        "motivated",
        "end",
        "desire",
        "end",
        "towards",
        "proattitude",
        "guided",
        "belief",
        "achieve",
        "end",
        "possible",
        "explain",
        "action",
        "citing",
        "desiring",
        "believing",
        "relevant",
        "thing",
        "return",
        "example",
        "explain",
        "othello",
        "kill",
        "desdemona",
        "citing",
        "wanting",
        "defend",
        "honour",
        "believing",
        "given",
        "desdemona",
        "unfaithful",
        "killing",
        "way",
        "sort",
        "explanation",
        "term",
        "state",
        "belief",
        "desire",
        "support",
        "relevant",
        "counterfactuals",
        "othello",
        "believed",
        "unfaithful",
        "believed",
        "killing",
        "way",
        "defend",
        "honour",
        "killed",
        "even",
        "still",
        "wanted",
        "restore",
        "reputation",
        "cared",
        "reputation",
        "killed",
        "despite",
        "belief",
        "betrayal",
        "necessary",
        "defend",
        "honour",
        "sort",
        "consideration",
        "led",
        "widespread",
        "acceptance",
        "view",
        "explanatory",
        "reason",
        "mental",
        "state",
        "since",
        "latter",
        "distinguished",
        "motivating",
        "reason",
        "also",
        "led",
        "view",
        "motivating",
        "reason",
        "mental",
        "state",
        "among",
        "psychologist",
        "say",
        "motivating",
        "explanatory",
        "reason",
        "mental",
        "psychological",
        "fact",
        "rather",
        "mental",
        "state",
        "psychologism",
        "hold",
        "reason",
        "mental",
        "state",
        "agent",
        "believing",
        "wanting",
        "knowing",
        "something",
        "easy",
        "move",
        "claim",
        "someone",
        "reason",
        "believing",
        "something",
        "mental",
        "state",
        "claim",
        "reason",
        "belief",
        "something",
        "psychological",
        "fact",
        "instance",
        "easy",
        "move",
        "saying",
        "joe",
        "reason",
        "running",
        "believing",
        "late",
        "mental",
        "state",
        "saying",
        "joe",
        "reason",
        "fact",
        "belief",
        "late",
        "defender",
        "psychologism",
        "face",
        "disagree",
        "champion",
        "nonpsychologism",
        "ontology",
        "reason",
        "psychological",
        "fact",
        "mental",
        "state",
        "though",
        "fact",
        "mental",
        "state",
        "still",
        "disagree",
        "nonpsychologists",
        "reason",
        "need",
        "way",
        "distinguish",
        "psychologism",
        "nonpsychologism",
        "term",
        "ontologythe",
        "kind",
        "thing",
        "camp",
        "say",
        "reason",
        "arein",
        "order",
        "capture",
        "deeper",
        "disagreement",
        "perhaps",
        "better",
        "way",
        "say",
        "psychologism",
        "hold",
        "motivating",
        "explanatory",
        "reason",
        "mental",
        "state",
        "fact",
        "mental",
        "state",
        "agent",
        "whereas",
        "nonpsychologism",
        "say",
        "motivating",
        "explanatory",
        "reason",
        "like",
        "normative",
        "reason",
        "fact",
        "sort",
        "thing",
        "including",
        "mental",
        "state",
        "agent",
        "following",
        "section",
        "examine",
        "current",
        "debate",
        "psychologism",
        "issue",
        "concerning",
        "motivating",
        "explanatory",
        "reason",
        "separately",
        "reason",
        "kind",
        "facilitate",
        "clarity",
        "various",
        "debate",
        "start",
        "motivating",
        "reason"
    ]
}