{
    "main_text": "Motivating and Explanatory Reasons || Explanatory Reasons\n3.2 Explanatory Reasons\n\nA person’s action may be explained in a variety of ways: by\nreference to the agent’s goal, or habits, or character traits,\nor to her reasons for acting. For instance, we may say that Jess went\nto the hospital in order to reassure her father, or that she went\nbecause she always goes on Tuesdays, or because she is a dutiful\ndaughter, or because her father was in intensive care. These\nstatements explain why Jess went to the hospital because, given\ncertain background assumptions, they enable a third person to\nunderstand Jess’s action: they make it intelligible. In the\nexamples just given, the first explanation gives us Jess’s goal\nin going to the hospital (to reassure her father), the second and\nthird place her action in the context of her habits (she does it every\nTuesday) and her character (she’s dutiful), respectively, and\nthe fourth explanation gives a reason why she did it that was\nher reason for doing it: a reason that, from her perspective,\nspoke in favour of going to the hospital (that her father was in\nintensive care). Among this variety of possible explanations (and\nthere are more), the last one is a distinctive type that is of\nparticular interest here because it is an explanation of an\nintentional action that rationalises the action: it explains the\naction by citing the agent’s reason for acting. In\nDavidson’s words:\n\n\nA reason rationalizes an action only if it leads us to see something\nthe agent saw, or thought he saw, in his action—some feature,\nconsequence, or aspect of the action the agent wanted, desired,\nprized, held dear, thought dutiful, beneficial, obligatory, or\nagreeable. (Davidson 1963: 685)\n\n\nOne argument in favour of psychologism for explanatory reasons that\nrationalise actions depends on the following idea. For a reason to be\nable to rationalise your action, that reason must be part of your\npsychology: a fact that is merely “out there” cannot\nexplain why you do anything. Your believing or knowing that fact, by\ncontrast, can explain why you act. So the reasons that explain your\nactions must be mental states (believings, knowings, etc.).\n\nIt might be responded that, although a fact cannot be a reason that\nexplains one’s action unless the person is aware of it, it does\nnot follow that the explanation of the action must mention their\nawareness of the reason. For instance, we can explain why\nJess went to the hospital by citing her reason for going, namely that\nher father had been admitted to the intensive care unit—this\npoints to something she saw in the action that made it desirable:\ne.g., that she could then be with her father in this difficult moment.\nThe explanation does not need to mention any psychological fact, such\nas the fact that she knew that her father had been admitted, even\nthough the explanation presupposes this fact. Against this suggestion,\na defender of psychologism for explanatory reasons might urge that\nthese explanations are elliptical and when fully spelled out their\nexplanans (the part of the explanation that does the explaining)\ncontains facts about what she knew or believed. But are these\nexplanations really elliptical? It seems undeniable that a person\ncannot act for the reason that p, or on the grounds that p, unless she\nstands in some epistemic relation to p: she needs to believe, know,\naccept, etc. that p. However, it does not follow that all full\nrationalisations need mention psychological facts and that, when they\ndon’t, this is because they’ve been given in elliptical\nform. Perhaps the fact that the agent knows the relevant things is\nsimply a necessary condition for her reason to be the explanans in a\nreason explanation. Or as Dancy suggests, her knowing or believing may be an\n“enabling condition” for the explanation (Dancy 2000:\n127).\n\nHowever that issue about rationalisations is decided, two things\nshould be noted. First, in “error cases”—cases when\nan agent acts on the basis of a falsehood that he believes and treats\nas a reason for acting—the explanans of a true explanation must\nbe a psychological fact. For instance, the explanation of why Othello\nkills Desdemona cannot be what he believes, that Desdemona has been\nunfaithful, but rather the fact that he believes it. This is because\nexplanations are, it is generally thought, factive: a true explanation cannot have a falsehood as its explanans: we cannot say that Othello kills Desdemona because\nshe has been unfaithful when she hasn’t. The second thing to\nnote is that, even if psychologism is right for explanatory reasons\n(that is, even if all reason explanations cite psychological facts),\nit does not follow that psychologism is right for motivating reasons\nbecause these reasons need not be the same. In other words, if one\nattends to the distinction between the roles of motivation and\nexplanation that reasons can play, there should be no temptation to\nmove from psychologism concerning explanatory reasons in some or in\nall cases, to psychologism concerning motivating reasons.\n\nNot all opponents of psychologism accept the suggestion that\nexplanatory reasons in rationalisations are mental states, or facts\nabout them, even for error cases. For example, in his 2000 book, Dancy\ndenies this and argues that we can always explain an action by\nspecifying the reason for which it was done, even when an agent acted\non a false consideration. The problem with this view is that it\ncommits Dancy to the conclusion that some reason explanations are\nnon-factive: an explanation may be true even though what does the\nexplaining is not. For instance, it commits him to saying that what\nexplains why I took my umbrella is that it was raining, even though it\nwas not raining. To most philosophers this is an unacceptable\nconclusion: surely true explanations require the truth of both the\nexplanandum (what is explained: that I took my umbrella) and the\nexplanans (that it was raining). In a recent paper (2014), Dancy has\nabandoned his earlier view that reason explanations can be non-factive\nbut he still retains his opposition to psychologism for explanatory\nreasons. So he still maintains that we can always explain an action by\nspecifying the reason for which it was done, even when the\n“reason” is some falsehood that the agent believed and in\nlight of which he acted. In those cases, he says,\n\n\nwe can say that what explains the action is that it was done for the\nreason that p, without committing ourselves to saying that\nwhat explains the action is that p. (2014: 90)\n\n\nHe adds that in such cases the reason itself “need not be the\ncase and does not make the sort of distinct contribution to the\nexplanation that would enable us to think of it as the\nexplanans” (2014: 91). Philosophers may disagree about whether\nthis new suggestion is satisfactory. Some may think that\n“Othello killed Desdemona for the reason that Desdemona had been\nunfaithful to him, although she had not been unfaithful to him”\nsounds paradoxical. Moreover, to say that the reason that explains an\naction is (the fact) that it was done for the reason that p\nenables Dancy to accommodate the view that explanations are factive.\nBut it does so at the expense of undermining his claim that the\nreasons that explain are also the reasons that motivate. For Dancy\nsays that the reason that motivates Othello is that Desdemona is\nunfaithful, while, according to this new suggestion, the reason that\nexplains his action (i.e., the explanans) is that it was done for\nthe reason that she is unfaithful.\n\nWhatever one thinks about Dancy’s new proposal it is worth\nemphasizing again that the distinction between explanatory and\nmotivating reasons enables one to bypass these issues. For one can say\nthat the reason that explains why Othello kills Desdemona is the\npsychological fact that he believes that she has been unfaithful\nwithout accepting that that is the reason that motivates him. His\nmotivating reason for killing her is the putative fact that she has\nbeen unfaithful (which, as we saw above, some would describe as merely\nan apparent reason). In short, even if some form of psychologism is\nright for explanatory reasons, it does not follow that it is right for\nmotivating reasons: the two may differ from each other in some\ncases.\n",
    "section_title": "3.2 Explanatory Reasons",
    "entry_title": "Reasons for Action: Justification, Motivation, Explanation",
    "hierarchy_title": "Reasons for Action: Justification, Motivation, Explanation || Motivating and Explanatory Reasons || Explanatory Reasons",
    "tokenized_text": [
        "motivating",
        "explanatory",
        "reason",
        "explanatory",
        "reason",
        "explanatory",
        "reason",
        "person",
        "action",
        "may",
        "explained",
        "variety",
        "way",
        "reference",
        "agent",
        "goal",
        "habit",
        "character",
        "trait",
        "reason",
        "acting",
        "instance",
        "may",
        "say",
        "jess",
        "went",
        "hospital",
        "order",
        "reassure",
        "father",
        "went",
        "always",
        "go",
        "tuesday",
        "dutiful",
        "daughter",
        "father",
        "intensive",
        "care",
        "statement",
        "explain",
        "jess",
        "went",
        "hospital",
        "given",
        "certain",
        "background",
        "assumption",
        "enable",
        "third",
        "person",
        "understand",
        "jess",
        "action",
        "make",
        "intelligible",
        "example",
        "given",
        "first",
        "explanation",
        "give",
        "u",
        "jess",
        "goal",
        "going",
        "hospital",
        "reassure",
        "father",
        "second",
        "third",
        "place",
        "action",
        "context",
        "habit",
        "every",
        "tuesday",
        "character",
        "dutiful",
        "respectively",
        "fourth",
        "explanation",
        "give",
        "reason",
        "reason",
        "reason",
        "perspective",
        "spoke",
        "favour",
        "going",
        "hospital",
        "father",
        "intensive",
        "care",
        "among",
        "variety",
        "possible",
        "explanation",
        "last",
        "one",
        "distinctive",
        "type",
        "particular",
        "interest",
        "explanation",
        "intentional",
        "action",
        "rationalises",
        "action",
        "explains",
        "action",
        "citing",
        "agent",
        "reason",
        "acting",
        "davidson",
        "word",
        "reason",
        "rationalizes",
        "action",
        "lead",
        "u",
        "see",
        "something",
        "agent",
        "saw",
        "thought",
        "saw",
        "actionsome",
        "feature",
        "consequence",
        "aspect",
        "action",
        "agent",
        "wanted",
        "desired",
        "prized",
        "held",
        "dear",
        "thought",
        "dutiful",
        "beneficial",
        "obligatory",
        "agreeable",
        "davidson",
        "one",
        "argument",
        "favour",
        "psychologism",
        "explanatory",
        "reason",
        "rationalise",
        "action",
        "depends",
        "following",
        "idea",
        "reason",
        "able",
        "rationalise",
        "action",
        "reason",
        "must",
        "part",
        "psychology",
        "fact",
        "merely",
        "explain",
        "anything",
        "believing",
        "knowing",
        "fact",
        "contrast",
        "explain",
        "act",
        "reason",
        "explain",
        "action",
        "must",
        "mental",
        "state",
        "believing",
        "knowing",
        "etc",
        "might",
        "responded",
        "although",
        "fact",
        "reason",
        "explains",
        "one",
        "action",
        "unless",
        "person",
        "aware",
        "follow",
        "explanation",
        "action",
        "must",
        "mention",
        "awareness",
        "reason",
        "instance",
        "explain",
        "jess",
        "went",
        "hospital",
        "citing",
        "reason",
        "going",
        "namely",
        "father",
        "admitted",
        "intensive",
        "care",
        "unitthis",
        "point",
        "something",
        "saw",
        "action",
        "made",
        "desirable",
        "eg",
        "could",
        "father",
        "difficult",
        "moment",
        "explanation",
        "need",
        "mention",
        "psychological",
        "fact",
        "fact",
        "knew",
        "father",
        "admitted",
        "even",
        "though",
        "explanation",
        "presupposes",
        "fact",
        "suggestion",
        "defender",
        "psychologism",
        "explanatory",
        "reason",
        "might",
        "urge",
        "explanation",
        "elliptical",
        "fully",
        "spelled",
        "explanans",
        "part",
        "explanation",
        "explaining",
        "contains",
        "fact",
        "knew",
        "believed",
        "explanation",
        "really",
        "elliptical",
        "seems",
        "undeniable",
        "person",
        "act",
        "reason",
        "p",
        "ground",
        "p",
        "unless",
        "stand",
        "epistemic",
        "relation",
        "p",
        "need",
        "believe",
        "know",
        "accept",
        "etc",
        "p",
        "however",
        "follow",
        "full",
        "rationalisation",
        "need",
        "mention",
        "psychological",
        "fact",
        "given",
        "elliptical",
        "form",
        "perhaps",
        "fact",
        "agent",
        "know",
        "relevant",
        "thing",
        "simply",
        "necessary",
        "condition",
        "reason",
        "explanans",
        "reason",
        "explanation",
        "dancy",
        "suggests",
        "knowing",
        "believing",
        "may",
        "enabling",
        "condition",
        "explanation",
        "dancy",
        "however",
        "issue",
        "rationalisation",
        "decided",
        "two",
        "thing",
        "noted",
        "first",
        "error",
        "case",
        "cases",
        "agent",
        "act",
        "basis",
        "falsehood",
        "belief",
        "treat",
        "reason",
        "actingthe",
        "explanans",
        "true",
        "explanation",
        "must",
        "psychological",
        "fact",
        "instance",
        "explanation",
        "othello",
        "kill",
        "desdemona",
        "belief",
        "desdemona",
        "unfaithful",
        "rather",
        "fact",
        "belief",
        "explanation",
        "generally",
        "thought",
        "factive",
        "true",
        "explanation",
        "falsehood",
        "explanans",
        "say",
        "othello",
        "kill",
        "desdemona",
        "unfaithful",
        "second",
        "thing",
        "note",
        "even",
        "psychologism",
        "right",
        "explanatory",
        "reason",
        "even",
        "reason",
        "explanation",
        "cite",
        "psychological",
        "fact",
        "follow",
        "psychologism",
        "right",
        "motivating",
        "reason",
        "reason",
        "need",
        "word",
        "one",
        "attends",
        "distinction",
        "role",
        "motivation",
        "explanation",
        "reason",
        "play",
        "temptation",
        "move",
        "psychologism",
        "concerning",
        "explanatory",
        "reason",
        "case",
        "psychologism",
        "concerning",
        "motivating",
        "reason",
        "opponent",
        "psychologism",
        "accept",
        "suggestion",
        "explanatory",
        "reason",
        "rationalisation",
        "mental",
        "state",
        "fact",
        "even",
        "error",
        "case",
        "example",
        "book",
        "dancy",
        "denies",
        "argues",
        "always",
        "explain",
        "action",
        "specifying",
        "reason",
        "done",
        "even",
        "agent",
        "acted",
        "false",
        "consideration",
        "problem",
        "view",
        "commits",
        "dancy",
        "conclusion",
        "reason",
        "explanation",
        "nonfactive",
        "explanation",
        "may",
        "true",
        "even",
        "though",
        "explaining",
        "instance",
        "commits",
        "saying",
        "explains",
        "took",
        "umbrella",
        "raining",
        "even",
        "though",
        "raining",
        "philosopher",
        "unacceptable",
        "conclusion",
        "surely",
        "true",
        "explanation",
        "require",
        "truth",
        "explanandum",
        "explained",
        "took",
        "umbrella",
        "explanans",
        "raining",
        "recent",
        "paper",
        "dancy",
        "abandoned",
        "earlier",
        "view",
        "reason",
        "explanation",
        "nonfactive",
        "still",
        "retains",
        "opposition",
        "psychologism",
        "explanatory",
        "reason",
        "still",
        "maintains",
        "always",
        "explain",
        "action",
        "specifying",
        "reason",
        "done",
        "even",
        "reason",
        "falsehood",
        "agent",
        "believed",
        "light",
        "acted",
        "case",
        "say",
        "say",
        "explains",
        "action",
        "done",
        "reason",
        "p",
        "without",
        "committing",
        "saying",
        "explains",
        "action",
        "p",
        "add",
        "case",
        "reason",
        "need",
        "case",
        "make",
        "sort",
        "distinct",
        "contribution",
        "explanation",
        "would",
        "enable",
        "u",
        "think",
        "explanans",
        "philosopher",
        "may",
        "disagree",
        "whether",
        "new",
        "suggestion",
        "satisfactory",
        "may",
        "think",
        "othello",
        "killed",
        "desdemona",
        "reason",
        "desdemona",
        "unfaithful",
        "although",
        "unfaithful",
        "sound",
        "paradoxical",
        "moreover",
        "say",
        "reason",
        "explains",
        "action",
        "fact",
        "done",
        "reason",
        "p",
        "enables",
        "dancy",
        "accommodate",
        "view",
        "explanation",
        "factive",
        "expense",
        "undermining",
        "claim",
        "reason",
        "explain",
        "also",
        "reason",
        "motivate",
        "dancy",
        "say",
        "reason",
        "motivates",
        "othello",
        "desdemona",
        "unfaithful",
        "according",
        "new",
        "suggestion",
        "reason",
        "explains",
        "action",
        "ie",
        "explanans",
        "done",
        "reason",
        "unfaithful",
        "whatever",
        "one",
        "think",
        "dancy",
        "new",
        "proposal",
        "worth",
        "emphasizing",
        "distinction",
        "explanatory",
        "motivating",
        "reason",
        "enables",
        "one",
        "bypass",
        "issue",
        "one",
        "say",
        "reason",
        "explains",
        "othello",
        "kill",
        "desdemona",
        "psychological",
        "fact",
        "belief",
        "unfaithful",
        "without",
        "accepting",
        "reason",
        "motivates",
        "motivating",
        "reason",
        "killing",
        "putative",
        "fact",
        "unfaithful",
        "saw",
        "would",
        "describe",
        "merely",
        "apparent",
        "reason",
        "short",
        "even",
        "form",
        "psychologism",
        "right",
        "explanatory",
        "reason",
        "follow",
        "right",
        "motivating",
        "reason",
        "two",
        "may",
        "differ",
        "case"
    ]
}