{
    "main_text": "General Philosophical Questions about Moral Reasoning || Moral Reasoning and Moral Psychology\n2.4 Moral Reasoning and Moral Psychology\n\nWe are concerned here with moral reasoning as a species of practical\nreasoning – reasoning directed to deciding what to do and, if\nsuccessful, issuing in an intention. But how can such practical\nreasoning succeed? How can moral reasoning hook up with motivationally\neffective psychological states so as to have this kind of causal\neffect? “Moral psychology” – the traditional name\nfor the philosophical study of intention and action – has a lot\nto say to such questions, both in its traditional, a priori\nform and its newly popular empirical form. In addition, the\nconclusions of moral psychology can have substantive moral\nimplications, for it may be reasonable to assume that if there are\ndeep reasons that a given type of moral reasoning cannot be\npractical, then any principles that demand such reasoning are unsound.\nIn this spirit, Samuel Scheffler has explored “the importance\nfor moral philosophy of some tolerably realistic understanding of\nhuman motivational psychology” (Scheffler 1992, 8) and Peter\nRailton has developed the idea that certain moral principles might\ngenerate a kind of “alienation” (Railton 1984). In short,\nwe may be interested in what makes practical reasoning of a certain\nsort psychologically possible both for its own sake and as a way of\nworking out some of the content of moral theory. \n\nThe issue of psychological possibility is an important one for all\nkinds of practical reasoning (cf. Audi 1989). In morality, it is\nespecially pressing, as morality often asks individuals to depart from\nsatisfying their own interests. As a result, it may appear that moral\nreasoning’s practical effect could not be explained by a simple\nappeal to the initial motivations that shape or constitute\nsomeone’s interests, in combination with a requirement, like\nthat mentioned above, to will the necessary means to one’s ends.\nMorality, it may seem, instead requires individuals to act on ends\nthat may not be part of their “motivational set,” in the\nterminology of Williams 1981. How can moral reasoning lead people to\ndo that? The question is a traditional one. Plato’s\nRepublic answered that the appearances are deceiving, and\nthat acting morally is, in fact, in the enlightened self-interest of\nthe agent. Kant, in stark contrast, held that our transcendent\ncapacity to act on our conception of a practical law enables us to set\nends and to follow morality even when doing so sharply conflicts with\nour interests. Many other answers have been given. In recent times,\nphilosophers have defended what has been called\n“internalism” about morality, which claims that there is a\nnecessary conceptual link between agents’ moral judgment and\ntheir motivation. Michael Smith, for instance, puts the claim as\nfollows (Smith 1994, 61):\n\nIf an agent judges that it is right for her to Φ in circumstances\nC, then either she is motivated to Φ in C or she\nis practically irrational.\n\n\nEven this defeasible version of moral judgment internalism may be too\nstrong; but instead of pursuing this issue further, let us turn to a\nquestion more internal to moral reasoning. (For more on the issue of\nmoral judgment internalism, see\n moral motivation.)\n \n\nThe traditional question we were just glancing at picks up when moral\nreasoning is done. Supposing that we have some moral conclusion, it\nasks how agents can be motivated to go along with it. A different\nquestion about the intersection of moral reasoning and moral\npsychology, one more immanent to the former, concerns how motivational\nelements shape the reasoning process itself. \n\nA powerful philosophical picture of human psychology, stemming from\nHume, insists that beliefs and desires are distinct existences (Hume\n2000, Book II, part iii, sect. iii; cf. Smith 1994, 7). This means\nthat there is always a potential problem about how reasoning, which\nseems to work by concatenating beliefs, links up to the motivations\nthat desire provides. The paradigmatic link is that of instrumental\naction: the desire to Ψ links with the belief that by Φing in\ncircumstances C one will Ψ. Accordingly, philosophers who\nhave examined moral reasoning within an essentially Humean,\nbelief-desire psychology have sometimes accepted a constrained account\nof moral reasoning. Hume’s own account exemplifies the sort of\nconstraint that is involved. As Hume has it, the calm passions support\nthe dual correction of perspective constitutive of morality, alluded\nto above. Since these calm passions are seen as competing with our\nother passions in essentially the same motivational coinage, as it\nwere, our passions limit the reach of moral reasoning. \n\nAn important step away from a narrow understanding of Humean moral\npsychology is taken if one recognizes the existence of what Rawls has\ncalled “principle-dependent desires” (Rawls 1996, 82–83;\nRawls 2000, 46–47). These are desires whose objects cannot be\ncharacterized without reference to some rational or moral principle.\nAn important special case of these is that of\n“conception-dependent desires,” in which the\nprinciple-dependent desire in question is seen by the agent as\nbelonging to a broader conception, and as important on that account\n(Rawls 1996, 83–84; Rawls 2000, 148–152). For instance,\nconceiving of oneself as a citizen, one may desire to bear one’s\nfair share of society’s burdens. Although it may look like any\ncontent, including this, may substitute for Ψ in the Humean\nconception of desire, and although Hume set out to show how moral\nsentiments such as pride could be explained in terms of simple\npsychological mechanisms, his influential empiricism actually tends to\nrestrict the possible content of desires. Introducing\nprinciple-dependent desires thus seems to mark a departure from a\nHumean psychology. As Rawls remarks, if “we may find ourselves\ndrawn to the conceptions and ideals that both the right and the good\nexpress … , [h]ow is one to fix limits on what people might be\nmoved by in thought and deliberation and hence may act from?”\n(1996, 85). While Rawls developed this point by contrasting\nHume’s moral psychology with Kant’s, the same basic point\nis also made by neo-Aristotelians (e.g., McDowell 1998). \n\nThe introduction of principle-dependent desires bursts any would-be\nnaturalist limit on their content; nonetheless, some philosophers hold\nthat this notion remains too beholden to an essentially Humean picture\nto be able to capture the idea of a moral commitment. Desires, it may\nseem, remain motivational items that compete on the basis of strength.\nSaying that one’s desire to be just may be outweighed by\none’s desire for advancement may seem to fail to capture the\nthought that one has a commitment – even a non-absolute one\n– to justice. Sartre designed his example of the student torn\nbetween staying with his mother and going to fight with the Free\nFrench so as to make it seem implausible that he ought to decide\nsimply by determining which he more strongly wanted to do. \n\nOne way to get at the idea of commitment is to emphasize our capacity\nto reflect about what we want. By this route, one might distinguish,\nin the fashion of Harry Frankfurt, between the strength of our desires\nand “the importance of what we care about” (Frankfurt\n1988). Although this idea is evocative, it provides relatively little\ninsight into how it is that we thus reflect. Another way to\nmodel commitment is to take it that our intentions operate at a level\ndistinct from our desires, structuring what we are willing to\nreconsider at any point in our deliberations (e.g. Bratman 1999).\nWhile this two-level approach offers some advantages, it is limited by\nits concession of a kind of normative primacy to the unreconstructed\ndesires at the unreflective level. A more integrated approach might\nmodel the psychology of commitment in a way that reconceives the\nnature of desire from the ground up. One attractive possibility is to\nreturn to the Aristotelian conception of desire as being for the sake\nof some good or apparent good (cf. Richardson 2004). On this\nconception, the end for the sake of which an action is done plays an\nimportant regulating role, indicating, in part, what one will\nnot do (Richardson 2018, §§8.3–8.4). Reasoning about final\nends accordingly has a distinctive character (see Richardson 1994,\nSchmidtz 1995). Whatever the best philosophical account of the notion\nof a commitment – for another alternative, see (Tiberius\n2000) – much of our moral reasoning does seem to involve\nexpressions of and challenges to our commitments (Anderson and Pildes\n2000). \n\nRecent experimental work, employing both survey instruments and brain\nimaging technologies, has allowed philosophers to approach questions\nabout the psychological basis of moral reasoning from novel angles.\nThe initial brain data seems to show that individuals with damage to\nthe pre-frontal lobes tend to reason in more straightforwardly\nconsequentialist fashion than those without such damage (Koenigs et\nal. 2007). Some theorists take this finding as tending to confirm that\nfully competent human moral reasoning goes beyond a simple weighing of\npros and cons to include assessment of moral constraints (e.g.,\nWellman & Miller 2008, Young & Saxe 2008). Others, however,\nhave argued that the emotional responses of the prefrontal lobes\ninterfere with the more sober and sound, consequentialist-style\nreasoning of the other parts of the brain (e.g. Greene 2014). The\nsurvey data reveals or confirms, among other things, interesting,\nnormatively loaded asymmetries in our attribution of such concepts as\nresponsibility and causality (Knobe 2006). It also reveals that many\nof moral theory’s most subtle distinctions, such as the\ndistinction between an intended means and a foreseen side-effect, are\ndeeply built into our psychologies, being present cross-culturally and\nin young children, in a way that suggests to some the possibility of\nan innate “moral grammar” (Mikhail 2011). \n\nA final question about the connection between moral motivation and\nmoral reasoning is whether someone without the right motivational\ncommitments can reason well, morally. On Hume’s official, narrow\nconception of reasoning, which essentially limits it to tracing\nempirical and logical connections, the answer would be yes. The\nvicious person could trace the causal and logical implications of\nacting in a certain way just as a virtuous person could. The only\ndifference would be practical, not rational: the two would not act in\nthe same way. Note, however, that the Humean’s affirmative\nanswer depends on departing from the working definition of\n“moral reasoning” used in this article, which casts it as\na species of practical reasoning. Interestingly, Kant can answer\n“yes” while still casting moral reasoning as practical. On\nhis view in the Groundwork and the Critique of Practical\nReason, reasoning well, morally, does not depend on any prior\nmotivational commitment, yet remains practical reasoning. That is\nbecause he thinks the moral law can itself generate motivation.\n(Kant’s Metaphysics of Morals and Religion\noffer a more complex psychology.) For Aristotle, by contrast, an agent\nwhose motivations are not virtuously constituted will systematically\nmisperceive what is good and what is bad, and hence will be unable to\nreason excellently. The best reasoning that a vicious person is\ncapable of, according to Aristotle, is a defective simulacrum of\npractical wisdom that he calls “cleverness”\n(Nicomachean Ethics 1144a25). \n",
    "section_title": "2.4 Moral Reasoning and Moral Psychology",
    "entry_title": "Moral Reasoning",
    "hierarchy_title": "Moral Reasoning || General Philosophical Questions about Moral Reasoning || Moral Reasoning and Moral Psychology",
    "tokenized_text": [
        "general",
        "philosophical",
        "question",
        "moral",
        "reasoning",
        "moral",
        "reasoning",
        "moral",
        "psychology",
        "moral",
        "reasoning",
        "moral",
        "psychology",
        "concerned",
        "moral",
        "reasoning",
        "specie",
        "practical",
        "reasoning",
        "reasoning",
        "directed",
        "deciding",
        "successful",
        "issuing",
        "intention",
        "practical",
        "reasoning",
        "succeed",
        "moral",
        "reasoning",
        "hook",
        "motivationally",
        "effective",
        "psychological",
        "state",
        "kind",
        "causal",
        "effect",
        "moral",
        "psychology",
        "traditional",
        "name",
        "philosophical",
        "study",
        "intention",
        "action",
        "lot",
        "say",
        "question",
        "traditional",
        "priori",
        "form",
        "newly",
        "popular",
        "empirical",
        "form",
        "addition",
        "conclusion",
        "moral",
        "psychology",
        "substantive",
        "moral",
        "implication",
        "may",
        "reasonable",
        "assume",
        "deep",
        "reason",
        "given",
        "type",
        "moral",
        "reasoning",
        "practical",
        "principle",
        "demand",
        "reasoning",
        "unsound",
        "spirit",
        "samuel",
        "scheffler",
        "explored",
        "importance",
        "moral",
        "philosophy",
        "tolerably",
        "realistic",
        "understanding",
        "human",
        "motivational",
        "psychology",
        "scheffler",
        "peter",
        "railton",
        "developed",
        "idea",
        "certain",
        "moral",
        "principle",
        "might",
        "generate",
        "kind",
        "alienation",
        "railton",
        "short",
        "may",
        "interested",
        "make",
        "practical",
        "reasoning",
        "certain",
        "sort",
        "psychologically",
        "possible",
        "sake",
        "way",
        "working",
        "content",
        "moral",
        "theory",
        "issue",
        "psychological",
        "possibility",
        "important",
        "one",
        "kind",
        "practical",
        "reasoning",
        "cf",
        "audi",
        "morality",
        "especially",
        "pressing",
        "morality",
        "often",
        "asks",
        "individual",
        "depart",
        "satisfying",
        "interest",
        "result",
        "may",
        "appear",
        "moral",
        "reasoning",
        "practical",
        "effect",
        "could",
        "explained",
        "simple",
        "appeal",
        "initial",
        "motivation",
        "shape",
        "constitute",
        "someone",
        "interest",
        "combination",
        "requirement",
        "like",
        "mentioned",
        "necessary",
        "mean",
        "one",
        "end",
        "morality",
        "may",
        "seem",
        "instead",
        "requires",
        "individual",
        "act",
        "end",
        "may",
        "part",
        "motivational",
        "set",
        "terminology",
        "williams",
        "moral",
        "reasoning",
        "lead",
        "people",
        "question",
        "traditional",
        "one",
        "plato",
        "republic",
        "answered",
        "appearance",
        "deceiving",
        "acting",
        "morally",
        "fact",
        "enlightened",
        "selfinterest",
        "agent",
        "kant",
        "stark",
        "contrast",
        "held",
        "transcendent",
        "capacity",
        "act",
        "conception",
        "practical",
        "law",
        "enables",
        "u",
        "set",
        "end",
        "follow",
        "morality",
        "even",
        "sharply",
        "conflict",
        "interest",
        "many",
        "answer",
        "given",
        "recent",
        "time",
        "philosopher",
        "defended",
        "called",
        "internalism",
        "morality",
        "claim",
        "necessary",
        "conceptual",
        "link",
        "agent",
        "moral",
        "judgment",
        "motivation",
        "michael",
        "smith",
        "instance",
        "put",
        "claim",
        "follows",
        "smith",
        "agent",
        "judge",
        "right",
        "φ",
        "circumstance",
        "c",
        "either",
        "motivated",
        "φ",
        "c",
        "practically",
        "irrational",
        "even",
        "defeasible",
        "version",
        "moral",
        "judgment",
        "internalism",
        "may",
        "strong",
        "instead",
        "pursuing",
        "issue",
        "let",
        "u",
        "turn",
        "question",
        "internal",
        "moral",
        "reasoning",
        "issue",
        "moral",
        "judgment",
        "internalism",
        "see",
        "moral",
        "motivation",
        "traditional",
        "question",
        "glancing",
        "pick",
        "moral",
        "reasoning",
        "done",
        "supposing",
        "moral",
        "conclusion",
        "asks",
        "agent",
        "motivated",
        "go",
        "along",
        "different",
        "question",
        "intersection",
        "moral",
        "reasoning",
        "moral",
        "psychology",
        "one",
        "immanent",
        "former",
        "concern",
        "motivational",
        "element",
        "shape",
        "reasoning",
        "process",
        "powerful",
        "philosophical",
        "picture",
        "human",
        "psychology",
        "stemming",
        "hume",
        "insists",
        "belief",
        "desire",
        "distinct",
        "existence",
        "hume",
        "book",
        "ii",
        "part",
        "iii",
        "sect",
        "iii",
        "cf",
        "smith",
        "mean",
        "always",
        "potential",
        "problem",
        "reasoning",
        "seems",
        "work",
        "concatenating",
        "belief",
        "link",
        "motivation",
        "desire",
        "provides",
        "paradigmatic",
        "link",
        "instrumental",
        "action",
        "desire",
        "ψ",
        "link",
        "belief",
        "φing",
        "circumstance",
        "c",
        "one",
        "ψ",
        "accordingly",
        "philosopher",
        "examined",
        "moral",
        "reasoning",
        "within",
        "essentially",
        "humean",
        "beliefdesire",
        "psychology",
        "sometimes",
        "accepted",
        "constrained",
        "account",
        "moral",
        "reasoning",
        "hume",
        "account",
        "exemplifies",
        "sort",
        "constraint",
        "involved",
        "hume",
        "calm",
        "passion",
        "support",
        "dual",
        "correction",
        "perspective",
        "constitutive",
        "morality",
        "alluded",
        "since",
        "calm",
        "passion",
        "seen",
        "competing",
        "passion",
        "essentially",
        "motivational",
        "coinage",
        "passion",
        "limit",
        "reach",
        "moral",
        "reasoning",
        "important",
        "step",
        "away",
        "narrow",
        "understanding",
        "humean",
        "moral",
        "psychology",
        "taken",
        "one",
        "recognizes",
        "existence",
        "rawls",
        "called",
        "principledependent",
        "desire",
        "rawls",
        "rawls",
        "desire",
        "whose",
        "object",
        "characterized",
        "without",
        "reference",
        "rational",
        "moral",
        "principle",
        "important",
        "special",
        "case",
        "conceptiondependent",
        "desire",
        "principledependent",
        "desire",
        "question",
        "seen",
        "agent",
        "belonging",
        "broader",
        "conception",
        "important",
        "account",
        "rawls",
        "rawls",
        "instance",
        "conceiving",
        "oneself",
        "citizen",
        "one",
        "may",
        "desire",
        "bear",
        "one",
        "fair",
        "share",
        "society",
        "burden",
        "although",
        "may",
        "look",
        "like",
        "content",
        "including",
        "may",
        "substitute",
        "ψ",
        "humean",
        "conception",
        "desire",
        "although",
        "hume",
        "set",
        "show",
        "moral",
        "sentiment",
        "pride",
        "could",
        "explained",
        "term",
        "simple",
        "psychological",
        "mechanism",
        "influential",
        "empiricism",
        "actually",
        "tends",
        "restrict",
        "possible",
        "content",
        "desire",
        "introducing",
        "principledependent",
        "desire",
        "thus",
        "seems",
        "mark",
        "departure",
        "humean",
        "psychology",
        "rawls",
        "remark",
        "may",
        "find",
        "drawn",
        "conception",
        "ideal",
        "right",
        "good",
        "express",
        "h",
        "ow",
        "one",
        "fix",
        "limit",
        "people",
        "might",
        "moved",
        "thought",
        "deliberation",
        "hence",
        "may",
        "act",
        "rawls",
        "developed",
        "point",
        "contrasting",
        "hume",
        "moral",
        "psychology",
        "kant",
        "basic",
        "point",
        "also",
        "made",
        "neoaristotelians",
        "eg",
        "mcdowell",
        "introduction",
        "principledependent",
        "desire",
        "burst",
        "wouldbe",
        "naturalist",
        "limit",
        "content",
        "nonetheless",
        "philosopher",
        "hold",
        "notion",
        "remains",
        "beholden",
        "essentially",
        "humean",
        "picture",
        "able",
        "capture",
        "idea",
        "moral",
        "commitment",
        "desire",
        "may",
        "seem",
        "remain",
        "motivational",
        "item",
        "compete",
        "basis",
        "strength",
        "saying",
        "one",
        "desire",
        "may",
        "outweighed",
        "one",
        "desire",
        "advancement",
        "may",
        "seem",
        "fail",
        "capture",
        "thought",
        "one",
        "commitment",
        "even",
        "nonabsolute",
        "one",
        "justice",
        "sartre",
        "designed",
        "example",
        "student",
        "torn",
        "staying",
        "mother",
        "going",
        "fight",
        "free",
        "french",
        "make",
        "seem",
        "implausible",
        "ought",
        "decide",
        "simply",
        "determining",
        "strongly",
        "wanted",
        "one",
        "way",
        "get",
        "idea",
        "commitment",
        "emphasize",
        "capacity",
        "reflect",
        "want",
        "route",
        "one",
        "might",
        "distinguish",
        "fashion",
        "harry",
        "frankfurt",
        "strength",
        "desire",
        "importance",
        "care",
        "frankfurt",
        "although",
        "idea",
        "evocative",
        "provides",
        "relatively",
        "little",
        "insight",
        "thus",
        "reflect",
        "another",
        "way",
        "model",
        "commitment",
        "take",
        "intention",
        "operate",
        "level",
        "distinct",
        "desire",
        "structuring",
        "willing",
        "reconsider",
        "point",
        "deliberation",
        "eg",
        "bratman",
        "twolevel",
        "approach",
        "offer",
        "advantage",
        "limited",
        "concession",
        "kind",
        "normative",
        "primacy",
        "unreconstructed",
        "desire",
        "unreflective",
        "level",
        "integrated",
        "approach",
        "might",
        "model",
        "psychology",
        "commitment",
        "way",
        "reconceives",
        "nature",
        "desire",
        "ground",
        "one",
        "attractive",
        "possibility",
        "return",
        "aristotelian",
        "conception",
        "desire",
        "sake",
        "good",
        "apparent",
        "good",
        "cf",
        "richardson",
        "conception",
        "end",
        "sake",
        "action",
        "done",
        "play",
        "important",
        "regulating",
        "role",
        "indicating",
        "part",
        "one",
        "richardson",
        "reasoning",
        "final",
        "end",
        "accordingly",
        "distinctive",
        "character",
        "see",
        "richardson",
        "schmidtz",
        "whatever",
        "best",
        "philosophical",
        "account",
        "notion",
        "commitment",
        "another",
        "alternative",
        "see",
        "tiberius",
        "much",
        "moral",
        "reasoning",
        "seem",
        "involve",
        "expression",
        "challenge",
        "commitment",
        "anderson",
        "pildes",
        "recent",
        "experimental",
        "work",
        "employing",
        "survey",
        "instrument",
        "brain",
        "imaging",
        "technology",
        "allowed",
        "philosopher",
        "approach",
        "question",
        "psychological",
        "basis",
        "moral",
        "reasoning",
        "novel",
        "angle",
        "initial",
        "brain",
        "data",
        "seems",
        "show",
        "individual",
        "damage",
        "prefrontal",
        "lobe",
        "tend",
        "reason",
        "straightforwardly",
        "consequentialist",
        "fashion",
        "without",
        "damage",
        "koenigs",
        "et",
        "al",
        "theorist",
        "take",
        "finding",
        "tending",
        "confirm",
        "fully",
        "competent",
        "human",
        "moral",
        "reasoning",
        "go",
        "beyond",
        "simple",
        "weighing",
        "pro",
        "con",
        "include",
        "assessment",
        "moral",
        "constraint",
        "eg",
        "wellman",
        "miller",
        "young",
        "saxe",
        "others",
        "however",
        "argued",
        "emotional",
        "response",
        "prefrontal",
        "lobe",
        "interfere",
        "sober",
        "sound",
        "consequentialiststyle",
        "reasoning",
        "part",
        "brain",
        "eg",
        "greene",
        "survey",
        "data",
        "reveals",
        "confirms",
        "among",
        "thing",
        "interesting",
        "normatively",
        "loaded",
        "asymmetry",
        "attribution",
        "concept",
        "responsibility",
        "causality",
        "knobe",
        "also",
        "reveals",
        "many",
        "moral",
        "theory",
        "subtle",
        "distinction",
        "distinction",
        "intended",
        "mean",
        "foreseen",
        "sideeffect",
        "deeply",
        "built",
        "psychology",
        "present",
        "crossculturally",
        "young",
        "child",
        "way",
        "suggests",
        "possibility",
        "innate",
        "moral",
        "grammar",
        "mikhail",
        "final",
        "question",
        "connection",
        "moral",
        "motivation",
        "moral",
        "reasoning",
        "whether",
        "someone",
        "without",
        "right",
        "motivational",
        "commitment",
        "reason",
        "well",
        "morally",
        "hume",
        "official",
        "narrow",
        "conception",
        "reasoning",
        "essentially",
        "limit",
        "tracing",
        "empirical",
        "logical",
        "connection",
        "answer",
        "would",
        "yes",
        "vicious",
        "person",
        "could",
        "trace",
        "causal",
        "logical",
        "implication",
        "acting",
        "certain",
        "way",
        "virtuous",
        "person",
        "could",
        "difference",
        "would",
        "practical",
        "rational",
        "two",
        "would",
        "act",
        "way",
        "note",
        "however",
        "humean",
        "affirmative",
        "answer",
        "depends",
        "departing",
        "working",
        "definition",
        "moral",
        "reasoning",
        "used",
        "article",
        "cast",
        "specie",
        "practical",
        "reasoning",
        "interestingly",
        "kant",
        "answer",
        "yes",
        "still",
        "casting",
        "moral",
        "reasoning",
        "practical",
        "view",
        "groundwork",
        "critique",
        "practical",
        "reason",
        "reasoning",
        "well",
        "morally",
        "depend",
        "prior",
        "motivational",
        "commitment",
        "yet",
        "remains",
        "practical",
        "reasoning",
        "think",
        "moral",
        "law",
        "generate",
        "motivation",
        "kant",
        "metaphysics",
        "moral",
        "religion",
        "offer",
        "complex",
        "psychology",
        "aristotle",
        "contrast",
        "agent",
        "whose",
        "motivation",
        "virtuously",
        "constituted",
        "systematically",
        "misperceive",
        "good",
        "bad",
        "hence",
        "unable",
        "reason",
        "excellently",
        "best",
        "reasoning",
        "vicious",
        "person",
        "capable",
        "according",
        "aristotle",
        "defective",
        "simulacrum",
        "practical",
        "wisdom",
        "call",
        "cleverness",
        "nicomachean",
        "ethic",
        "a"
    ]
}