{
    "main_text": "Four Forms of Recognition || Esteem\n2.3 Esteem\n\n\nThe major emancipatory movements of the last two centuries—for instance the women’s or the civil rights movements in the US—fought for equal respect and rights. In contrast, in many of\nthe contemporary social struggles persons or groups demand recognition\nof specific (e.g., cultural or religious) aspects of their identities\nwhich are neglected or demeaned by the dominant value and norm system\nof their society. It is these phenomena which have helped popularize\nthe notions of a “politics of recognition” or\n“identity politics.” However, it is contested why these\ndifferences should matter normatively: Do we owe such recognition to\nthe affected as subjects with equal moral status (a) or\nbecause we should esteem their specific properties as valuable\n(b)?\n\n\n(a) The first reading, which claims that we owe this kind of\nrecognition to all subjects as equally entitled, allows only for a\ncontext-sensitive form of respect. By pointing to differences\ndisregarded so far one hopes to show that the allegedly\n“neutral” state (or society) is by no means neutral, but\nrather based on a partial (for example, male-dominated, white,\nheterosexual) interpretation of citizenship or just on an arbitrary\nprivileging of specific groups. Hereby all members are discriminated\nwho do not fit the hegemonic understanding (already Taylor 1992, 42).\nIf one tries to cancel out these disadvantages by taking into account\nthe differences, e.g., by means of affirmative action intended to\nremove injustices, this serves the higher-ranking goal of treating\npersons in all their particularity as of equal status (Benhabib 1992).\nIn order to arrive at such context-sensitive laws and regulations one\nhas to more fully include the affected groups into the process of\ndemocratic decision-making, for example, through a vitalized public\nsphere and formal hearings (Habermas 1994). Additionally, it has been\nproposed that (formerly) oppressed groups should have a veto right with\nregard to all those questions that particularly affect them (Young\n1990, 183–191).\n\n\n(b) In contrast, the second reading claims that we should value\nparticularity in itself. Such a politics of difference is not\nconcerned with (context-sensitive) respect, but with the esteem for\nspecific characteristics or entire identities of individuals and—often enough—groups.\n\n\nHowever, the idea of group identities has been hotly contested:\nWhereas some groups indeed want to (re)affirm their particular\nidentity, the criticism has been voiced that such a homogenous reading\nof identity fails to take proper account of intersecting axes of\nidentification (being a black, lesbian woman, for instance). The\nfailure to admit of such heterogeneity has been suspected of\nlegitimizing internal oppression within minority groups. According to some\nscholars, all identities have to be deconstructed. Again others have\nheld onto the idea of group identities for political reasons (demanding\nsecure exit-options for individual members) or have favored rainbow\ncoalitions. In this context, it is also controversial whether cultures\nshould be valued in themselves or only in their value for individuals\nand whether such cultural protection necessitates group rights (Kymlicka 1989, Taylor\n1992, Habermas 1994, Laden/Owen 2007, Patten 2014). Finally, there\nseems to be an aporia as the alleged solution to equally value and\npromote all cultures may be no solution at all: Arguably, to esteem\nsomething without accurate knowledge or against one’s own\nconvictions is no real esteem but rather manifests an additional\ninsult. Therefore, Taylor urges us to be “merely” maximally\nopen towards the alien culture and to be led by the principle that\ntraditions with a long history most certainly contain something\nvaluable (Taylor 1992, 68–71).\n\n\nThere is another group of scholars which has argued that esteem\nshould not be awarded to groups but to individuals—and not for\nthe latter’s wholesale identities but only for specific features.\nYet, in light of the value pluralism so characteristic of modern\nsocieties, it remains unclear who could function as an impartial judge\nwhen it comes to determining what is (more) valuable and what is not.\nEvery decision seems to run the danger of merely expressing a\nrepressive majority opinion. Therefore, according to some accounts,\nesteem should play no role in public politics whatsoever: it is\nsufficient for individuals to be respected by all and to be esteemed by\nonly some significant others, for example, by their family, friends or\nfellow members of voluntary associations (Rawls 1971, § 67;\nHabermas 1994, 129).\n\n\nYet, an opposing camp claims that simply neglecting the\ndimension of esteem does not do justice to our everyday experiences: We\nare not only injured by humiliating behavior, but also if strangers\ninsult us (either in the sense of not recognizing specific\nfeatures of ourselves or actively devaluing them). After all, we have a\nneed to be esteemed by society “as such” in order to be\nable to appear in public without shame. Bourdieu’s social theory,\nfor example, points to the pervasiveness of evaluative patterns and\ndistinctions even in modern society, determining social status and\nclass (Bourdieu 1984). In order to solve the dilemma of having to\ncreate an impartial value horizon for modern societies, in recent years\nsome authors have proposed to focus on the notion of\n“achievement.” The latter is supposed to be a sufficiently\nformal reference point for esteeming persons. “Achievement”\nis not only of great significance within capitalistic societies but\nremains open for historically and interculturally different ideas of\nwhat kind of achievement should count as relevant (Honneth 1992, 126;\n2003a, 140–142; Margalit 1996, 46–47). It is supposed to allow for\nindividual particularity (one’s own achievement) but still to retain\na common reference point (the contribution to the common good, however\nthat may be defined). From this perspective, mass unemployment, for\ninstance, is a social pathology because it denies this form of esteem\nto large parts of the population. This could only be counteracted by\nacknowledging activities outside of the labor market as achievements so\nthat every citizen has the chance to see herself as a person who\ncontributes to the flourishing of her society. Additionally, it\nconstitutes an injustice if activities are devalued for arbitrary\nreasons (e.g., if specific jobs lose their status just because the\nratio of women holding them increases, see Honneth 2003a, 153, or if\nwomen earn less than men for doing the same job).\n\n\nTwo sorts of arguments have been leveled against this idea of\nfocusing on achievement. First, some have argued that it is impossible\nto find culturally neutral criteria of merit (Young 1990, 200–206). For instance, the market is not interested so much in capacities or skills, but merely in outputs demanded by others regardless of the skills involved (see Schmidt am Busch 2011, 46–47). But some will argue that the market is thus not tracking the relevant feature. If it is true that the very definition of achievement or merit will remain essentially contested, the problem that was supposed to be solved only\nreappears again: we can only expect such recognition from those who\nshare with us the same standards of achievement. \nSecond, even if the citizenry could come up with a convincing standard,\nthere remains a “recognition gap”: not all, perhaps not\neven the central features that render us valuable in our own eyes can\nbe understood as “achievements” in the sense of\ncontributing to the common good (Iser 2008, 193).\n\n\nNonetheless, by highlighting the human dependency on evaluative\nhorizons of esteem, many theories of recognition share important\ncharacteristics with communitarian approaches. The idea of a common,\nmore substantial “ethical life” is especially important for\nthose who think that we can only flourish if we live in\nmeaning-bestowing relationships of mutual recognition. In such\nrelationships people are supposed to experience the needs, desires and\ngoals of their alter ego not so much as limitations but rather as\nfurtherances of their own “social” freedom (in this vein\nTaylor 1992, 33–34; Neuhouser 2000, esp. ch. 1; Pippin 2008, ch. 7;\nHonneth 2014, chs. 3 and 6, Honneth 2015, esp. ch. I). The individual can only experience her deeds\nas really hers in living and acting in concert with others and feeling\nat home in the society’s institutions. Here recognition is not\nonly a precondition for valuing one’s own (perhaps still\nindividual) projects but is itself an integral part of (essentially\nsocial) endeavors. According to this picture, we face a lack of freedom\nwhere such relationships of mutual recognition are not fully realized.\nThus, these accounts follow Hegel in generalizing experiences drawn\nfrom the intimate sphere of loving relationships.\n",
    "section_title": "2.3 Esteem",
    "entry_title": "Recognition",
    "hierarchy_title": "Recognition || Four Forms of Recognition || Esteem",
    "tokenized_text": [
        "four",
        "form",
        "recognition",
        "esteem",
        "esteem",
        "major",
        "emancipatory",
        "movement",
        "last",
        "two",
        "centuriesfor",
        "instance",
        "woman",
        "civil",
        "right",
        "movement",
        "usfought",
        "equal",
        "respect",
        "right",
        "contrast",
        "many",
        "contemporary",
        "social",
        "struggle",
        "person",
        "group",
        "demand",
        "recognition",
        "specific",
        "eg",
        "cultural",
        "religious",
        "aspect",
        "identity",
        "neglected",
        "demeaned",
        "dominant",
        "value",
        "norm",
        "system",
        "society",
        "phenomenon",
        "helped",
        "popularize",
        "notion",
        "politics",
        "recognition",
        "identity",
        "politics",
        "however",
        "contested",
        "difference",
        "matter",
        "normatively",
        "owe",
        "recognition",
        "affected",
        "subject",
        "equal",
        "moral",
        "status",
        "esteem",
        "specific",
        "property",
        "valuable",
        "b",
        "first",
        "reading",
        "claim",
        "owe",
        "kind",
        "recognition",
        "subject",
        "equally",
        "entitled",
        "allows",
        "contextsensitive",
        "form",
        "respect",
        "pointing",
        "difference",
        "disregarded",
        "far",
        "one",
        "hope",
        "show",
        "allegedly",
        "neutral",
        "state",
        "society",
        "mean",
        "neutral",
        "rather",
        "based",
        "partial",
        "example",
        "maledominated",
        "white",
        "heterosexual",
        "interpretation",
        "citizenship",
        "arbitrary",
        "privileging",
        "specific",
        "group",
        "hereby",
        "member",
        "discriminated",
        "fit",
        "hegemonic",
        "understanding",
        "already",
        "taylor",
        "one",
        "try",
        "cancel",
        "disadvantage",
        "taking",
        "account",
        "difference",
        "eg",
        "mean",
        "affirmative",
        "action",
        "intended",
        "remove",
        "injustice",
        "serf",
        "higherranking",
        "goal",
        "treating",
        "person",
        "particularity",
        "equal",
        "status",
        "benhabib",
        "order",
        "arrive",
        "contextsensitive",
        "law",
        "regulation",
        "one",
        "fully",
        "include",
        "affected",
        "group",
        "process",
        "democratic",
        "decisionmaking",
        "example",
        "vitalized",
        "public",
        "sphere",
        "formal",
        "hearing",
        "habermas",
        "additionally",
        "proposed",
        "formerly",
        "oppressed",
        "group",
        "veto",
        "right",
        "regard",
        "question",
        "particularly",
        "affect",
        "young",
        "b",
        "contrast",
        "second",
        "reading",
        "claim",
        "value",
        "particularity",
        "politics",
        "difference",
        "concerned",
        "contextsensitive",
        "respect",
        "esteem",
        "specific",
        "characteristic",
        "entire",
        "identity",
        "individual",
        "andoften",
        "enoughgroups",
        "however",
        "idea",
        "group",
        "identity",
        "hotly",
        "contested",
        "whereas",
        "group",
        "indeed",
        "want",
        "affirm",
        "particular",
        "identity",
        "criticism",
        "voiced",
        "homogenous",
        "reading",
        "identity",
        "fails",
        "take",
        "proper",
        "account",
        "intersecting",
        "ax",
        "identification",
        "black",
        "lesbian",
        "woman",
        "instance",
        "failure",
        "admit",
        "heterogeneity",
        "suspected",
        "legitimizing",
        "internal",
        "oppression",
        "within",
        "minority",
        "group",
        "according",
        "scholar",
        "identity",
        "deconstructed",
        "others",
        "held",
        "onto",
        "idea",
        "group",
        "identity",
        "political",
        "reason",
        "demanding",
        "secure",
        "exitoptions",
        "individual",
        "member",
        "favored",
        "rainbow",
        "coalition",
        "context",
        "also",
        "controversial",
        "whether",
        "culture",
        "valued",
        "value",
        "individual",
        "whether",
        "cultural",
        "protection",
        "necessitates",
        "group",
        "right",
        "kymlicka",
        "taylor",
        "habermas",
        "ladenowen",
        "patten",
        "finally",
        "seems",
        "aporia",
        "alleged",
        "solution",
        "equally",
        "value",
        "promote",
        "culture",
        "may",
        "solution",
        "arguably",
        "esteem",
        "something",
        "without",
        "accurate",
        "knowledge",
        "one",
        "conviction",
        "real",
        "esteem",
        "rather",
        "manifest",
        "additional",
        "insult",
        "therefore",
        "taylor",
        "urge",
        "u",
        "merely",
        "maximally",
        "open",
        "towards",
        "alien",
        "culture",
        "led",
        "principle",
        "tradition",
        "long",
        "history",
        "certainly",
        "contain",
        "something",
        "valuable",
        "taylor",
        "another",
        "group",
        "scholar",
        "argued",
        "esteem",
        "awarded",
        "group",
        "individualsand",
        "latter",
        "wholesale",
        "identity",
        "specific",
        "feature",
        "yet",
        "light",
        "value",
        "pluralism",
        "characteristic",
        "modern",
        "society",
        "remains",
        "unclear",
        "could",
        "function",
        "impartial",
        "judge",
        "come",
        "determining",
        "valuable",
        "every",
        "decision",
        "seems",
        "run",
        "danger",
        "merely",
        "expressing",
        "repressive",
        "majority",
        "opinion",
        "therefore",
        "according",
        "account",
        "esteem",
        "play",
        "role",
        "public",
        "politics",
        "whatsoever",
        "sufficient",
        "individual",
        "respected",
        "esteemed",
        "significant",
        "others",
        "example",
        "family",
        "friend",
        "fellow",
        "member",
        "voluntary",
        "association",
        "rawls",
        "habermas",
        "yet",
        "opposing",
        "camp",
        "claim",
        "simply",
        "neglecting",
        "dimension",
        "esteem",
        "justice",
        "everyday",
        "experience",
        "injured",
        "humiliating",
        "behavior",
        "also",
        "stranger",
        "insult",
        "u",
        "either",
        "sense",
        "recognizing",
        "specific",
        "feature",
        "actively",
        "devaluing",
        "need",
        "esteemed",
        "society",
        "order",
        "able",
        "appear",
        "public",
        "without",
        "shame",
        "bourdieu",
        "social",
        "theory",
        "example",
        "point",
        "pervasiveness",
        "evaluative",
        "pattern",
        "distinction",
        "even",
        "modern",
        "society",
        "determining",
        "social",
        "status",
        "class",
        "bourdieu",
        "order",
        "solve",
        "dilemma",
        "create",
        "impartial",
        "value",
        "horizon",
        "modern",
        "society",
        "recent",
        "year",
        "author",
        "proposed",
        "focus",
        "notion",
        "achievement",
        "latter",
        "supposed",
        "sufficiently",
        "formal",
        "reference",
        "point",
        "esteeming",
        "person",
        "achievement",
        "great",
        "significance",
        "within",
        "capitalistic",
        "society",
        "remains",
        "open",
        "historically",
        "interculturally",
        "different",
        "idea",
        "kind",
        "achievement",
        "count",
        "relevant",
        "honneth",
        "a",
        "margalit",
        "supposed",
        "allow",
        "individual",
        "particularity",
        "one",
        "achievement",
        "still",
        "retain",
        "common",
        "reference",
        "point",
        "contribution",
        "common",
        "good",
        "however",
        "may",
        "defined",
        "perspective",
        "mass",
        "unemployment",
        "instance",
        "social",
        "pathology",
        "denies",
        "form",
        "esteem",
        "large",
        "part",
        "population",
        "could",
        "counteracted",
        "acknowledging",
        "activity",
        "outside",
        "labor",
        "market",
        "achievement",
        "every",
        "citizen",
        "chance",
        "see",
        "person",
        "contributes",
        "flourishing",
        "society",
        "additionally",
        "constitutes",
        "injustice",
        "activity",
        "devalued",
        "arbitrary",
        "reason",
        "eg",
        "specific",
        "job",
        "lose",
        "status",
        "ratio",
        "woman",
        "holding",
        "increase",
        "see",
        "honneth",
        "a",
        "woman",
        "earn",
        "le",
        "men",
        "job",
        "two",
        "sort",
        "argument",
        "leveled",
        "idea",
        "focusing",
        "achievement",
        "first",
        "argued",
        "impossible",
        "find",
        "culturally",
        "neutral",
        "criterion",
        "merit",
        "young",
        "instance",
        "market",
        "interested",
        "much",
        "capacity",
        "skill",
        "merely",
        "output",
        "demanded",
        "others",
        "regardless",
        "skill",
        "involved",
        "see",
        "schmidt",
        "busch",
        "argue",
        "market",
        "thus",
        "tracking",
        "relevant",
        "feature",
        "true",
        "definition",
        "achievement",
        "merit",
        "remain",
        "essentially",
        "contested",
        "problem",
        "supposed",
        "solved",
        "reappears",
        "expect",
        "recognition",
        "share",
        "u",
        "standard",
        "achievement",
        "second",
        "even",
        "citizenry",
        "could",
        "come",
        "convincing",
        "standard",
        "remains",
        "recognition",
        "gap",
        "perhaps",
        "even",
        "central",
        "feature",
        "render",
        "u",
        "valuable",
        "eye",
        "understood",
        "achievement",
        "sense",
        "contributing",
        "common",
        "good",
        "iser",
        "nonetheless",
        "highlighting",
        "human",
        "dependency",
        "evaluative",
        "horizon",
        "esteem",
        "many",
        "theory",
        "recognition",
        "share",
        "important",
        "characteristic",
        "communitarian",
        "approach",
        "idea",
        "common",
        "substantial",
        "ethical",
        "life",
        "especially",
        "important",
        "think",
        "flourish",
        "live",
        "meaningbestowing",
        "relationship",
        "mutual",
        "recognition",
        "relationship",
        "people",
        "supposed",
        "experience",
        "need",
        "desire",
        "goal",
        "alter",
        "ego",
        "much",
        "limitation",
        "rather",
        "furtherance",
        "social",
        "freedom",
        "vein",
        "taylor",
        "neuhouser",
        "esp",
        "ch",
        "pippin",
        "ch",
        "honneth",
        "chs",
        "honneth",
        "esp",
        "ch",
        "individual",
        "experience",
        "deed",
        "really",
        "living",
        "acting",
        "concert",
        "others",
        "feeling",
        "home",
        "society",
        "institution",
        "recognition",
        "precondition",
        "valuing",
        "one",
        "perhaps",
        "still",
        "individual",
        "project",
        "integral",
        "part",
        "essentially",
        "social",
        "endeavor",
        "according",
        "picture",
        "face",
        "lack",
        "freedom",
        "relationship",
        "mutual",
        "recognition",
        "fully",
        "realized",
        "thus",
        "account",
        "follow",
        "hegel",
        "generalizing",
        "experience",
        "drawn",
        "intimate",
        "sphere",
        "loving",
        "relationship"
    ]
}