{
    "main_text": "Logic and Modality\n5. Logic and Modality\n\nReichenbach entertained non-standard logics as early as 1925 in the\nform of “probability logic.” In the Theory of\nProbability, probability logic amounts to no more than the\nassignment of probability values to formulas in the propositional\ncalculus. Later, a three-valued logic was introduced for quantum\ntheory, as discussed above. Reichenbach’s major effort in logic,\nhowever, is in Elements of Symbolic Logic, published in 1947,\nbut begun as lecture notes for courses during Reichenbach’s\nTurkish years. The book is notable chiefly for the extended and\ndetailed effort to formalize universal logical structures of\nconversational languages within the limits of first order logic and\ntype theory. Reichenbach’s knowledge of German, English, French,\nand especially, Turkish, helped to make his proposals linguistically\nserious, and the result, a detailed, and in some respects quite\noriginal, logical grammar, including accounts of adverbial\nmodification, tense and modality, is substantially richer than related\nlogical efforts of his contemporaries. Other topics of interest, such\nas vagueness, are not discussed—Reichenbach perhaps considered\nvagueness a mistake rather than a topic for logical analysis. \n\nIn 1948 Reichenbach circulated an unpublished manuscript (1948e, 1978,\nvol. 1, p. 409–428), touching on Hilbert’s program and\nGödel’s theorems. Reichenbach was not persuaded that\nGödel’s proof of the impossibility of proving consistency\nwithin a sufficiently strong formalized language was of any\nphilosophical significance.\n\n\n…a more profound analysis shows Hilbert’s program to be\nunshaken, and independent of Gödel’s results.\n\nTo prove the latter statement first, let us inquire into the\nsignificance of the theorem stating that the proof of consistency is\nonly to be given in the metalanguage. What then would happen, if the\nmetalanguage should turn out to be inconsistent? This would lead to\nthe consequence, not that our deduction of the statement of\nconsistency is incorrect, but that the contrary of this statement\ncould also be deduced; and this indeed would make our statement\nvalueless. Now let us assume for a moment that Gödel’s\nsecond theorem did not hold, or with other words, that Gödel had\nproved the contrary of his theorem.\n\nThis would mean that the proof of consistency of the language\nL could be given within L. A simple analysis shows\nthat this would not improve the situation, since in this case our\nproof of consistency of L would be of value only if we were\nsure that L is consistent. In case L were not\nconsistent, we could also deduce the statement of the consistency of\nL, with the qualification that then the negation of the\nstatement were deducible too. Thus if the consistency of L\nwere deduced within L, this fact would not prove the\nconsistency of L. (p. 409–410)\n\n\nHilbert’s meta-proof of consistency, by contrast, Reichenbach\nthinks is genuinely important. The consistency of any\n“interpreted” formalism can be judged empirically if there\nis empirical evidence for the claims made within the formalism, and\nReichenbach argues that the proposition within the formalism that\nasserts that the interpreted formal system is consistent has an\nempirical probability (the only kind Reichenbach allows, of course) at\nleast as high as that of any other claim in the language. But for\nmathematics, the language must be separated into the part concerned\nwith rational numbers, which can be interpreted so that measurements\ngive rational numbers as values, and the part concerned with real or\ncomplex numbers, which correspond to no empirical measurement.\n“Since all theorems of applied mathematics are deducible from\nthe subsystem [of physical interpretation of the field of rational\nnumbers]…it is only this subsystem which is verified by the\ninterpretations.” (1978, vol. I, p. 423) So we cannot\nempirically confirm any claims that are properly about real or complex\nnumbers, so we cannot empirically confirm their consistency. Hence we\nneed Hilbert’s program of metamathematics, which, by\narithmetizing the claims of mathematical languages, reduces claims of\ntheir consistency to claims in finite mathematics about the\nmanipulations of symbols—a claim that can be confirmed\nempirically (see the entry on\n Hilbert’s program).\n We leave to the reader to diagnose how this separatist account fits\nwith Reichenbach’s insistence that Bayes theorem suffices to\nestimate an empirical probability for theoretical claims that are not\n“directly” empirically confirmable. \n\nIn The Theory of Probability, modal necessity is identified\nwith universal quantification and possibility is identified with joint\nexistential quantification of a propositional matrix and existential\nquantification of its denial. At least the spirit of this account is\nretained in Reichenbach’s later discussions of modality. His\naccount of modality in Elements of Symbolic Logic (1947c) was\ndeveloped as a separate work in Nomological Statements and\nAdmissible Operations (1954e), and is the basis for his\ndiscussion of possibility and necessity in his essay on freedom of the\nwill. Completed before his death and published soon after,\nNomological Statements and Admissible Operations was reissued\nin 1976 under the title, Laws, Modalities and\nCounterfactuals, with an invaluable expository foreword by Wesley\nSalmon. Reichenbach’s own presentation is a nearly impenetrable\nmix of conditions on truth, entailment, logical form, and\nverifiability, which surely contributed to its lack of influence.\nLittle if any discussion of it is to be found in the decades of\nliterature on conditionals and counterfactuals since its\npublication.\n\nIn contrast to Carnap, who was at work on modality at about the same\ntime, Reichenbach understands the task of his theory to be to explain\nthe logical form and content of subjunctives, especially of\ncontrary-to-fact conditionals, and, at the same time, to explain how\nempirical evidence can warrant some counterfactuals, warrant the\ndenial of others, and leave still others undecided. He therefore\nregards the ability of the theory to account for our common sense\njudgments of the truth or falsity of sentences involving subjunctives,\ncounterfactuals, laws and modals as critical to its evaluation. \n\nReichenbach’s theory is founded on an account of natural laws.\nHe views the logical form of all declarative sentences—modal,\ncounterfactual or otherwise—as specifiable in an extensional\nfirst order or typed language. Modality is a property of sentences,\nnot part of their content, and modal sentences therefore involve both\na declarative sentence and a meta-language claim about that sentence.\nAs in Carnap’s account, all modality is de dicto.\nReichenbach is initially concerned with distinguishing conditionals\nthat, as indicative sentences, are true because of the falsity of\ntheir antecedents, from true (or at least assertable) subjunctive\nconditionals that have false antecedents, or antecedents not known to\nbe true. The former contain uses of propositional connectives (or\n“operations” in Reichenbach’s terminology) that are\ninadmissible. Reichenbach’s strategy is to characterize\n“admissible operations,” that is assertable, subjunctive\nconditionals, and their truth values, by their deductive relations\nwith indicative “nomological statements.” \n\nFundamental or “original” nomological statements are those\nlogically equivalent to a true sentence (with no terms that\n“essentially refer” to particulars) in prenex form with at\nleast one universal quantifier and such that no logically stronger\nsentence in the same vocabulary is true. Derivative nomological\nstatements are logical consequences of original nomological\nstatements, but not all derivative nomological statements are\n“admissible.” To avoid conditionals true because of false\nantecedents (or sentences true because of irrelevant disjuncts),\nReichenbach essentially requires that derivative nomological\nstatements be the logically strongest sentences in their vocabulary\nthat are consequences of original nomological statements. Statements\nare graded: Original nomological statements have grade 3, derivative\nnomological statements grade 2, and other statements grade 1. A\ncounterfactual conditional can only be true—or\nassertible—if its antecedent has a grade at least as high as its\nconsequent. Rather elaborate further conditions on logical form are\nimposed to avoid counterexamples. Counterfactuals about particulars\nare understood to be true if the corresponding indicative conditionals\nare instances of true nomological generalizations. \n\nModal claims of necessity are construed as indicatives combined with a\nmeta-claim that the indicative is nomological. Possibility claims have\ncorresponding meta-claims asserting that the denial of the indicative\nis not nomological. Almost as an afterthought, Reichenbach notes that\nquantification must be over possible as well as actual objects, but he\nprovides no logical mechanism for specifying such de re\nmodalities. \n",
    "section_title": "5. Logic and Modality",
    "entry_title": "Hans Reichenbach",
    "hierarchy_title": "Hans Reichenbach || Logic and Modality",
    "tokenized_text": [
        "logic",
        "modality",
        "logic",
        "modality",
        "reichenbach",
        "entertained",
        "nonstandard",
        "logic",
        "early",
        "form",
        "probability",
        "logic",
        "theory",
        "probability",
        "probability",
        "logic",
        "amount",
        "assignment",
        "probability",
        "value",
        "formula",
        "propositional",
        "calculus",
        "later",
        "threevalued",
        "logic",
        "introduced",
        "quantum",
        "theory",
        "discussed",
        "reichenbach",
        "major",
        "effort",
        "logic",
        "however",
        "element",
        "symbolic",
        "logic",
        "published",
        "begun",
        "lecture",
        "note",
        "course",
        "reichenbach",
        "turkish",
        "year",
        "book",
        "notable",
        "chiefly",
        "extended",
        "detailed",
        "effort",
        "formalize",
        "universal",
        "logical",
        "structure",
        "conversational",
        "language",
        "within",
        "limit",
        "first",
        "order",
        "logic",
        "type",
        "theory",
        "reichenbach",
        "knowledge",
        "german",
        "english",
        "french",
        "especially",
        "turkish",
        "helped",
        "make",
        "proposal",
        "linguistically",
        "serious",
        "result",
        "detailed",
        "respect",
        "quite",
        "original",
        "logical",
        "grammar",
        "including",
        "account",
        "adverbial",
        "modification",
        "tense",
        "modality",
        "substantially",
        "richer",
        "related",
        "logical",
        "effort",
        "contemporary",
        "topic",
        "interest",
        "vagueness",
        "discussedreichenbach",
        "perhaps",
        "considered",
        "vagueness",
        "mistake",
        "rather",
        "topic",
        "logical",
        "analysis",
        "reichenbach",
        "circulated",
        "unpublished",
        "manuscript",
        "e",
        "vol",
        "p",
        "touching",
        "hilbert",
        "program",
        "gödel",
        "theorem",
        "reichenbach",
        "persuaded",
        "gödel",
        "proof",
        "impossibility",
        "proving",
        "consistency",
        "within",
        "sufficiently",
        "strong",
        "formalized",
        "language",
        "philosophical",
        "significance",
        "a",
        "profound",
        "analysis",
        "show",
        "hilbert",
        "program",
        "unshaken",
        "independent",
        "gödel",
        "result",
        "prove",
        "latter",
        "statement",
        "first",
        "let",
        "u",
        "inquire",
        "significance",
        "theorem",
        "stating",
        "proof",
        "consistency",
        "given",
        "metalanguage",
        "would",
        "happen",
        "metalanguage",
        "turn",
        "inconsistent",
        "would",
        "lead",
        "consequence",
        "deduction",
        "statement",
        "consistency",
        "incorrect",
        "contrary",
        "statement",
        "could",
        "also",
        "deduced",
        "indeed",
        "would",
        "make",
        "statement",
        "valueless",
        "let",
        "u",
        "assume",
        "moment",
        "gödel",
        "second",
        "theorem",
        "hold",
        "word",
        "gödel",
        "proved",
        "contrary",
        "theorem",
        "would",
        "mean",
        "proof",
        "consistency",
        "language",
        "l",
        "could",
        "given",
        "within",
        "l",
        "simple",
        "analysis",
        "show",
        "would",
        "improve",
        "situation",
        "since",
        "case",
        "proof",
        "consistency",
        "l",
        "would",
        "value",
        "sure",
        "l",
        "consistent",
        "case",
        "l",
        "consistent",
        "could",
        "also",
        "deduce",
        "statement",
        "consistency",
        "l",
        "qualification",
        "negation",
        "statement",
        "deducible",
        "thus",
        "consistency",
        "l",
        "deduced",
        "within",
        "l",
        "fact",
        "would",
        "prove",
        "consistency",
        "l",
        "p",
        "hilbert",
        "metaproof",
        "consistency",
        "contrast",
        "reichenbach",
        "think",
        "genuinely",
        "important",
        "consistency",
        "interpreted",
        "formalism",
        "judged",
        "empirically",
        "empirical",
        "evidence",
        "claim",
        "made",
        "within",
        "formalism",
        "reichenbach",
        "argues",
        "proposition",
        "within",
        "formalism",
        "asserts",
        "interpreted",
        "formal",
        "system",
        "consistent",
        "empirical",
        "probability",
        "kind",
        "reichenbach",
        "allows",
        "course",
        "least",
        "high",
        "claim",
        "language",
        "mathematics",
        "language",
        "must",
        "separated",
        "part",
        "concerned",
        "rational",
        "number",
        "interpreted",
        "measurement",
        "give",
        "rational",
        "number",
        "value",
        "part",
        "concerned",
        "real",
        "complex",
        "number",
        "correspond",
        "empirical",
        "measurement",
        "since",
        "theorem",
        "applied",
        "mathematics",
        "deducible",
        "subsystem",
        "physical",
        "interpretation",
        "field",
        "rational",
        "number",
        "it",
        "subsystem",
        "verified",
        "interpretations",
        "vol",
        "p",
        "empirically",
        "confirm",
        "claim",
        "properly",
        "real",
        "complex",
        "number",
        "empirically",
        "confirm",
        "consistency",
        "hence",
        "need",
        "hilbert",
        "program",
        "metamathematics",
        "arithmetizing",
        "claim",
        "mathematical",
        "language",
        "reduces",
        "claim",
        "consistency",
        "claim",
        "finite",
        "mathematics",
        "manipulation",
        "symbolsa",
        "claim",
        "confirmed",
        "empirically",
        "see",
        "entry",
        "hilbert",
        "program",
        "leave",
        "reader",
        "diagnose",
        "separatist",
        "account",
        "fit",
        "reichenbach",
        "insistence",
        "bayes",
        "theorem",
        "suffices",
        "estimate",
        "empirical",
        "probability",
        "theoretical",
        "claim",
        "directly",
        "empirically",
        "confirmable",
        "theory",
        "probability",
        "modal",
        "necessity",
        "identified",
        "universal",
        "quantification",
        "possibility",
        "identified",
        "joint",
        "existential",
        "quantification",
        "propositional",
        "matrix",
        "existential",
        "quantification",
        "denial",
        "least",
        "spirit",
        "account",
        "retained",
        "reichenbach",
        "later",
        "discussion",
        "modality",
        "account",
        "modality",
        "element",
        "symbolic",
        "logic",
        "c",
        "developed",
        "separate",
        "work",
        "nomological",
        "statement",
        "admissible",
        "operation",
        "e",
        "basis",
        "discussion",
        "possibility",
        "necessity",
        "essay",
        "freedom",
        "completed",
        "death",
        "published",
        "soon",
        "nomological",
        "statement",
        "admissible",
        "operation",
        "reissued",
        "title",
        "law",
        "modality",
        "counterfactuals",
        "invaluable",
        "expository",
        "foreword",
        "wesley",
        "salmon",
        "reichenbach",
        "presentation",
        "nearly",
        "impenetrable",
        "mix",
        "condition",
        "truth",
        "entailment",
        "logical",
        "form",
        "verifiability",
        "surely",
        "contributed",
        "lack",
        "influence",
        "little",
        "discussion",
        "found",
        "decade",
        "literature",
        "conditionals",
        "counterfactuals",
        "since",
        "publication",
        "contrast",
        "carnap",
        "work",
        "modality",
        "time",
        "reichenbach",
        "understands",
        "task",
        "theory",
        "explain",
        "logical",
        "form",
        "content",
        "subjunctive",
        "especially",
        "contrarytofact",
        "conditionals",
        "time",
        "explain",
        "empirical",
        "evidence",
        "warrant",
        "counterfactuals",
        "warrant",
        "denial",
        "others",
        "leave",
        "still",
        "others",
        "undecided",
        "therefore",
        "regard",
        "ability",
        "theory",
        "account",
        "common",
        "sense",
        "judgment",
        "truth",
        "falsity",
        "sentence",
        "involving",
        "subjunctive",
        "counterfactuals",
        "law",
        "modal",
        "critical",
        "evaluation",
        "reichenbach",
        "theory",
        "founded",
        "account",
        "natural",
        "law",
        "view",
        "logical",
        "form",
        "declarative",
        "sentencesmodal",
        "counterfactual",
        "otherwiseas",
        "specifiable",
        "extensional",
        "first",
        "order",
        "typed",
        "language",
        "modality",
        "property",
        "sentence",
        "part",
        "content",
        "modal",
        "sentence",
        "therefore",
        "involve",
        "declarative",
        "sentence",
        "metalanguage",
        "claim",
        "sentence",
        "carnap",
        "account",
        "modality",
        "de",
        "dicto",
        "reichenbach",
        "initially",
        "concerned",
        "distinguishing",
        "conditionals",
        "indicative",
        "sentence",
        "true",
        "falsity",
        "antecedent",
        "true",
        "least",
        "assertable",
        "subjunctive",
        "conditionals",
        "false",
        "antecedent",
        "antecedent",
        "known",
        "true",
        "former",
        "contain",
        "us",
        "propositional",
        "connective",
        "operation",
        "reichenbach",
        "terminology",
        "inadmissible",
        "reichenbach",
        "strategy",
        "characterize",
        "admissible",
        "operation",
        "assertable",
        "subjunctive",
        "conditionals",
        "truth",
        "value",
        "deductive",
        "relation",
        "indicative",
        "nomological",
        "statements",
        "fundamental",
        "original",
        "nomological",
        "statement",
        "logically",
        "equivalent",
        "true",
        "sentence",
        "term",
        "essentially",
        "refer",
        "particular",
        "prenex",
        "form",
        "least",
        "one",
        "universal",
        "quantifier",
        "logically",
        "stronger",
        "sentence",
        "vocabulary",
        "true",
        "derivative",
        "nomological",
        "statement",
        "logical",
        "consequence",
        "original",
        "nomological",
        "statement",
        "derivative",
        "nomological",
        "statement",
        "admissible",
        "avoid",
        "conditionals",
        "true",
        "false",
        "antecedent",
        "sentence",
        "true",
        "irrelevant",
        "disjuncts",
        "reichenbach",
        "essentially",
        "requires",
        "derivative",
        "nomological",
        "statement",
        "logically",
        "strongest",
        "sentence",
        "vocabulary",
        "consequence",
        "original",
        "nomological",
        "statement",
        "statement",
        "graded",
        "original",
        "nomological",
        "statement",
        "grade",
        "derivative",
        "nomological",
        "statement",
        "grade",
        "statement",
        "grade",
        "counterfactual",
        "conditional",
        "trueor",
        "assertibleif",
        "antecedent",
        "grade",
        "least",
        "high",
        "consequent",
        "rather",
        "elaborate",
        "condition",
        "logical",
        "form",
        "imposed",
        "avoid",
        "counterexample",
        "counterfactuals",
        "particular",
        "understood",
        "true",
        "corresponding",
        "indicative",
        "conditionals",
        "instance",
        "true",
        "nomological",
        "generalization",
        "modal",
        "claim",
        "necessity",
        "construed",
        "indicative",
        "combined",
        "metaclaim",
        "indicative",
        "nomological",
        "possibility",
        "claim",
        "corresponding",
        "metaclaims",
        "asserting",
        "denial",
        "indicative",
        "nomological",
        "almost",
        "afterthought",
        "reichenbach",
        "note",
        "quantification",
        "must",
        "possible",
        "well",
        "actual",
        "object",
        "provides",
        "logical",
        "mechanism",
        "specifying",
        "de",
        "modality"
    ]
}