{
    "main_text": "Perception and Knowledge of the World || Sensations as Natural Signs of Qualities\n3.3 Sensations as Natural Signs of Qualities\n\n\nIn addition to being a Newtonian empiricist, Reid is an expert\nphenomenologist, acutely aware to finely grained features of our\nexperience, especially our sensory experience. When we touch a table,\nwhile we conceive of it and often form beliefs about it, we also sense\nit. (See 2.1 Conceiving) The immediate\neffect that objects have on us is to\ncause sensations. Sensations are always associated with a\nparticular organ of sense; they are always distinctly of, for\ninstance, touch or vision. Sensations are the feelings that are the\nimmediate mental causal consequences of the influence of objects on\nus. We become aware of the qualities of objects following the\nsensations that those objects cause. However, for Reid, the\nconceptions of objects that follow from our sensations are\nnot derived from our sensations since they do not\nbear any kind of resemblance to the qualities which cause\nthem. Awareness of sensations are not, for Reid, essential\nintermediaries for formation of perceptual beliefs. So what is the\nprecise relationship between sensory experiences and conceptual\ncontent? This is a delicate question for Reid since the directness of\nhis theory of perception depends upon advocacy of a physiologically\nand phenomenally real theory that accounts for our experience while\navoiding theoretical pitfalls that risk dragging his theory much\ncloser to a representational theory than Reid would like.\n\n\nAs we have often in this entry, we begin with historical context since\nReid's theory of the relation between sensations and qualities will\nappear stranger than it is without background. According to the Way of\nIdeas, ideas and images are mental representations in an individual's\nmind, and my perceptual awareness of a table depends upon my prior\nawareness of these ideas of sensation. This veil of perception is why\nadvocates of the Way of Ideas struggled to provide epistemic\njustification for beliefs about external, mind-independent, qualities\nof physical objects, and avoid skepticism. But besides the epistemic\nproblem, advocates of ideas faced a difficulty accounting for the\norigins of the contents of our very ideas of external\nobjects. Though not easy to appreciate, this problem it is quite\nimportant.\n\n\nReid argues that advocates of the Way of Ideas do not have a plausible\nsolution to this problem. Hume says bluntly that “[E]very simple\nidea has a simple impression, which resembles it”\n(Treatise 1.1.1.5, 3), which is a statement of what is known\nas the Copy Principle: ideas have the content that they do because\nthey are copies, and resemblances, of impressions. Think of a\ntable. For Hume, your thought of a table is derivative and copied from\na sensory impression that you have had of that very table. The\nexplanation of the content of the idea of that table thus concerns the\ncontents of your simple impression of the corresponding physical\ntable. The Copy Principle is an exceedingly powerful tool on behalf of\nthe Way of Ideas for a variety of reasons, but Reid is unimpressed\nwith the evidence on its behalf, especially as presented by Hume\nin Treatise. Reid's response to Hume leads to an argument,\nwhich we can call his ‘Sensory Deprivation Argument’.\n\n\nReid's Sensory Deprivation Argument proceeds as follows. First, Hume's\nstated justification for the Copy Principle is inductive: he\nchallenges people to find an idea that is not derived from a sensory\nimpression, after he says that it appears all his ideas are copied\nfrom sensory impressions. But that, says Reid, is an exceedingly weak\njustification (EAP 1.4, 23). Besides, Hume's claim that the principle\nis “certain” is mistaken because the argument he sets out\nfor the principle is inductive (IHM 5.7, 69–70, 75–6). After those\nground clearing moves, Reid begins the argument proper with a thought\nexperiment. Exhibiting affinities with Condillac's\nremarkable Treatise on Sensations (1754), Reid asks his\nreaders to imagine a blind adult subject. Not only has he lost his\nsight, but he has “lost all the experience, and habits, and\nnotions he had got by touch; [he lacks] the least conception of the\nexistence, figure, dimensions, or extension, either of his own body,\nor of any other; but to have all his knowledge of external things to\nacquire anew, by means of sensation, and the power of reason, which we\nsuppose to remain entire” (IHM 5.6, 65). Reid imagines\nintroducing this blind experimental subject to a number of tactile\nsensations, one by one, from the most simple to the most involved: a\nsingle pin prick in a split second of time; a blunt object pushed\nagainst a small surface area of skin; the same object pushed against\nskin over a period of time “with a force gradually increased\ntill it bruises him”; an object covering a large surface area of\nskin, applied over a period of time, and so on. Reid's emphasis on\ntactile sensations is important to understand: he uses this running\nexample because ideas of primary qualities are the most important for\ngaining knowledge of the world and are the ideas essential for any\nscience.\n\n \nOnce a handful of skin cells are stimulated for the briefest of\nmoments by a pin, the subject has received a sensory\nimpression—or in Reid's language, he has had a\nsensation—but, Reid argues, this does not equip the individual\nto formulate an idea of extension or figure, space or motion, all\nprimary qualities of the pin. He writes, “[The primary\nqualities] have no resemblance to any sensation, or to any operation\nof our minds; and, therefore, they cannot be ideas either of sensation\nor of reflection” (IHM 5.6, 67). For each subsequent iteration\nof tactile sensations, Reid argues that those sensations too are\nincapable of delivering to the subject ideas of extension, figure,\nspace or motion. His conclusion has two parts. First, the Way of\nIdeas's story about the relation between sensations and the\nintentional contents of conceptions is mistaken. Second, with an eye\ntoward developing his own theory of sensations, he writes,\n[T]his connection between our sensations and the\nconception and belief of external existences cannot be produced by\nhabit, experience, education, or any principle of human nature that\nhath been admitted by philosophers. At the same time, it is a fact\nthat such sensations are invariably connected with the conception and\nbelief of external existences. Hence, by all rules of just reasoning,\nwe must conclude, that this connection is the effect of our\nconstitution, and ought to be considered as an original principle of\nhuman nature, till we find some more general principle into which it\nmay be resolved. (IHM 5.3, 61/122b)\n\n\nThe process by which sensations give rise to our conceptions of\nobjects is something Reid calls ‘suggestion’. Sensations in this\nprocess he calls ‘signs’. The qualities of objects are ‘suggested’ by\nour sensations when they function as signs, so when we have sensations\nwe come to be aware of those objects as possessing those qualities.\nBut what is suggestion supposed to be? The first thing to notice is\nthat the suggestion relation or the ‘sign-signified’ relation is\ncontingent. Whereas philosophers prefer necessities, Reid does not\nbelieve the messiness of the actual perceptual process contains any\nnecessity at this juncture. Second, suggestion is a pseudo-linguistic\nnotion for Reid. Signs suggest conceptions of that which they\nsignify. The word “dogs”, for instance, leads those who\nare familiar with the word to think of certain domesticated animals\nwho are also man's best friends.\n\n\nBut for those who already know the term, this does not happen by\nhearing the word “dogs” then deriving or inferring some\nobject that has some peculiar fitness to the word. The relation of\nsigns to things they signify in spoken and written language is almost\nalways arbitrary in the sense that there is no similarity between dogs\nand the word “dogs”. In this sense, “dogs” is\nan artificial or artifactual sign, for Reid, in\ncontrast to natural signs. Blushing signifies one of\na small number of mental states because blushing is caused by events\nof embarrassment, anger, or romantic stimulation. Blood rushing\nthrough the subcutaneous circulatory system in the face reliably\noccurs, across members of our species, in response to a small set of\nstimuli with apparent universality, making blushing a natural sign. We\ndiscover this relationship by observation and experience.\n\n \nHowever, according to Reid, a subset of natural signs lead us to think\nof what they signify without any prior experience. Members of\nthis category “which, though we never before had any notion or\nconception of the things signified, do suggest it, or conjure it up,\nas it were, by a natural kind of magic, and at once give us a\nconception, and create a belief of it” (IHM 5.3, 60). Put your\nhand on a table, pause and experience the sensation of hardness. This\ntactile sensation leads us immediately to conceive of that which\ncaused it as being hard, as having a certain resistive\nconstruction. But we are aware of the table's hardness, which caused\nthe sensation, automatically. We do not understand why it is that we\nthink of this special kind of physical constitution after having this\nkind of tactile sensation. Nonetheless, we must “conclude, that\nthis connection is the effect of our constitution, and ought to be\nconsidered as an original principle of human nature” (IHM 5.3,\n61). This is the defining feature of the kind of natural signs of\nwhich the tactile sensation of hardness is an instance: these signs\nlead us to conceive of what they signify simply because we are built\nin such a way as to have such conceptions on encountering such\nsigns. Reid's approach to this relationship contrasts sharply with\nthat taken by most advocates of the Way of Ideas, who attempted to\nposit a strong relationship between ideas of sensation and qualities\nof physical objects.\n\n\nPlacing my hand on a table, my tactile sensation immediately leads my\nmind to a conception or apprehension that I am touching a hard\nobject. When does one's conception of an object as having a particular\nquality amount to a perception, a conception accompanied by a\nconviction of its accuracy? The answer is: when one comes to have that\nconception because one has encountered a natural sign which leads one\nto the conception, and that natural sign leads one to the conception\nmerely because of one's constitution. Conviction in the accuracy of a\nconception is bestowed on the conception, Reid thinks, just when the\nrelevant conception comes about because of our nature or\nconstitution. When we conceive of an object in a particular way merely\nbecause it is in our nature to conceive of the object that way, then\nthe conception is non-optional, unavoidable, and is thus one that we\ncannot help but trust. Perceptions, then, are dictates of common\nsense: to be aware of an object in perception is to have a belief\nwhich you cannot give up given your constitution.\n\n\nReid believes that our minds come to be connected to the\nmind-independent world in something like the way that we come to grasp\nobjects through a language designed for the purpose. However, when we\ncome to be aware of objects through our senses, we do so by utilizing\nsomething like a language embedded in our constitutions: our\nsensations function like a language that nature has constructed. While\nit is in a sense only a metaphor to say that we know about the world\nbecause the world speaks to us, it is a metaphor that illuminates the\nfacts as Reid sees them.\n",
    "section_title": "3.3 Sensations as Natural Signs of Qualities",
    "entry_title": "Thomas Reid",
    "hierarchy_title": "Thomas Reid || Perception and Knowledge of the World || Sensations as Natural Signs of Qualities",
    "tokenized_text": [
        "perception",
        "knowledge",
        "world",
        "sensation",
        "natural",
        "sign",
        "quality",
        "sensation",
        "natural",
        "sign",
        "quality",
        "addition",
        "newtonian",
        "empiricist",
        "reid",
        "expert",
        "phenomenologist",
        "acutely",
        "aware",
        "finely",
        "grained",
        "feature",
        "experience",
        "especially",
        "sensory",
        "experience",
        "touch",
        "table",
        "conceive",
        "often",
        "form",
        "belief",
        "also",
        "sense",
        "see",
        "conceiving",
        "immediate",
        "effect",
        "object",
        "u",
        "cause",
        "sensation",
        "sensation",
        "always",
        "associated",
        "particular",
        "organ",
        "sense",
        "always",
        "distinctly",
        "instance",
        "touch",
        "vision",
        "sensation",
        "feeling",
        "immediate",
        "mental",
        "causal",
        "consequence",
        "influence",
        "object",
        "u",
        "become",
        "aware",
        "quality",
        "object",
        "following",
        "sensation",
        "object",
        "cause",
        "however",
        "reid",
        "conception",
        "object",
        "follow",
        "sensation",
        "derived",
        "sensation",
        "since",
        "bear",
        "kind",
        "resemblance",
        "quality",
        "cause",
        "awareness",
        "sensation",
        "reid",
        "essential",
        "intermediary",
        "formation",
        "perceptual",
        "belief",
        "precise",
        "relationship",
        "sensory",
        "experience",
        "conceptual",
        "content",
        "delicate",
        "question",
        "reid",
        "since",
        "directness",
        "theory",
        "perception",
        "depends",
        "upon",
        "advocacy",
        "physiologically",
        "phenomenally",
        "real",
        "theory",
        "account",
        "experience",
        "avoiding",
        "theoretical",
        "pitfall",
        "risk",
        "dragging",
        "theory",
        "much",
        "closer",
        "representational",
        "theory",
        "reid",
        "would",
        "like",
        "often",
        "entry",
        "begin",
        "historical",
        "context",
        "since",
        "reid",
        "s",
        "theory",
        "relation",
        "sensation",
        "quality",
        "appear",
        "stranger",
        "without",
        "background",
        "according",
        "way",
        "idea",
        "idea",
        "image",
        "mental",
        "representation",
        "individual",
        "s",
        "mind",
        "perceptual",
        "awareness",
        "table",
        "depends",
        "upon",
        "prior",
        "awareness",
        "idea",
        "sensation",
        "veil",
        "perception",
        "advocate",
        "way",
        "idea",
        "struggled",
        "provide",
        "epistemic",
        "justification",
        "belief",
        "external",
        "mindindependent",
        "quality",
        "physical",
        "object",
        "avoid",
        "skepticism",
        "besides",
        "epistemic",
        "problem",
        "advocate",
        "idea",
        "faced",
        "difficulty",
        "accounting",
        "origin",
        "content",
        "idea",
        "external",
        "object",
        "though",
        "easy",
        "appreciate",
        "problem",
        "quite",
        "important",
        "reid",
        "argues",
        "advocate",
        "way",
        "idea",
        "plausible",
        "solution",
        "problem",
        "hume",
        "say",
        "bluntly",
        "e",
        "simple",
        "idea",
        "simple",
        "impression",
        "resembles",
        "treatise",
        "statement",
        "known",
        "copy",
        "principle",
        "idea",
        "content",
        "copy",
        "resemblance",
        "impression",
        "think",
        "table",
        "hume",
        "thought",
        "table",
        "derivative",
        "copied",
        "sensory",
        "impression",
        "table",
        "explanation",
        "content",
        "idea",
        "table",
        "thus",
        "concern",
        "content",
        "simple",
        "impression",
        "corresponding",
        "physical",
        "table",
        "copy",
        "principle",
        "exceedingly",
        "powerful",
        "tool",
        "behalf",
        "way",
        "idea",
        "variety",
        "reason",
        "reid",
        "unimpressed",
        "evidence",
        "behalf",
        "especially",
        "presented",
        "hume",
        "treatise",
        "reid",
        "s",
        "response",
        "hume",
        "lead",
        "argument",
        "call",
        "sensory",
        "deprivation",
        "argument",
        "reid",
        "s",
        "sensory",
        "deprivation",
        "argument",
        "proceeds",
        "follows",
        "first",
        "hume",
        "s",
        "stated",
        "justification",
        "copy",
        "principle",
        "inductive",
        "challenge",
        "people",
        "find",
        "idea",
        "derived",
        "sensory",
        "impression",
        "say",
        "appears",
        "idea",
        "copied",
        "sensory",
        "impression",
        "say",
        "reid",
        "exceedingly",
        "weak",
        "justification",
        "eap",
        "besides",
        "hume",
        "s",
        "claim",
        "principle",
        "certain",
        "mistaken",
        "argument",
        "set",
        "principle",
        "inductive",
        "ihm",
        "ground",
        "clearing",
        "move",
        "reid",
        "begin",
        "argument",
        "proper",
        "thought",
        "experiment",
        "exhibiting",
        "affinity",
        "condillac",
        "s",
        "remarkable",
        "treatise",
        "sensation",
        "reid",
        "asks",
        "reader",
        "imagine",
        "blind",
        "adult",
        "subject",
        "lost",
        "sight",
        "lost",
        "experience",
        "habit",
        "notion",
        "got",
        "touch",
        "lack",
        "least",
        "conception",
        "existence",
        "figure",
        "dimension",
        "extension",
        "either",
        "body",
        "knowledge",
        "external",
        "thing",
        "acquire",
        "anew",
        "mean",
        "sensation",
        "power",
        "reason",
        "suppose",
        "remain",
        "entire",
        "ihm",
        "reid",
        "imago",
        "introducing",
        "blind",
        "experimental",
        "subject",
        "number",
        "tactile",
        "sensation",
        "one",
        "one",
        "simple",
        "involved",
        "single",
        "pin",
        "prick",
        "split",
        "second",
        "time",
        "blunt",
        "object",
        "pushed",
        "small",
        "surface",
        "area",
        "skin",
        "object",
        "pushed",
        "skin",
        "period",
        "time",
        "force",
        "gradually",
        "increased",
        "till",
        "bruise",
        "object",
        "covering",
        "large",
        "surface",
        "area",
        "skin",
        "applied",
        "period",
        "time",
        "reid",
        "s",
        "emphasis",
        "tactile",
        "sensation",
        "important",
        "understand",
        "us",
        "running",
        "example",
        "idea",
        "primary",
        "quality",
        "important",
        "gaining",
        "knowledge",
        "world",
        "idea",
        "essential",
        "science",
        "handful",
        "skin",
        "cell",
        "stimulated",
        "briefest",
        "moment",
        "pin",
        "subject",
        "received",
        "sensory",
        "impressionor",
        "reid",
        "s",
        "language",
        "sensationbut",
        "reid",
        "argues",
        "equip",
        "individual",
        "formulate",
        "idea",
        "extension",
        "figure",
        "space",
        "motion",
        "primary",
        "quality",
        "pin",
        "writes",
        "primary",
        "quality",
        "resemblance",
        "sensation",
        "operation",
        "mind",
        "therefore",
        "idea",
        "either",
        "sensation",
        "reflection",
        "ihm",
        "subsequent",
        "iteration",
        "tactile",
        "sensation",
        "reid",
        "argues",
        "sensation",
        "incapable",
        "delivering",
        "subject",
        "idea",
        "extension",
        "figure",
        "space",
        "motion",
        "conclusion",
        "two",
        "part",
        "first",
        "way",
        "idea",
        "s",
        "story",
        "relation",
        "sensation",
        "intentional",
        "content",
        "conception",
        "mistaken",
        "second",
        "eye",
        "toward",
        "developing",
        "theory",
        "sensation",
        "writes",
        "connection",
        "sensation",
        "conception",
        "belief",
        "external",
        "existence",
        "produced",
        "habit",
        "experience",
        "education",
        "principle",
        "human",
        "nature",
        "hath",
        "admitted",
        "philosopher",
        "time",
        "fact",
        "sensation",
        "invariably",
        "connected",
        "conception",
        "belief",
        "external",
        "existence",
        "hence",
        "rule",
        "reasoning",
        "must",
        "conclude",
        "connection",
        "effect",
        "constitution",
        "ought",
        "considered",
        "original",
        "principle",
        "human",
        "nature",
        "till",
        "find",
        "general",
        "principle",
        "may",
        "resolved",
        "ihm",
        "b",
        "process",
        "sensation",
        "give",
        "rise",
        "conception",
        "object",
        "something",
        "reid",
        "call",
        "suggestion",
        "sensation",
        "process",
        "call",
        "sign",
        "quality",
        "object",
        "suggested",
        "sensation",
        "function",
        "sign",
        "sensation",
        "come",
        "aware",
        "object",
        "possessing",
        "quality",
        "suggestion",
        "supposed",
        "first",
        "thing",
        "notice",
        "suggestion",
        "relation",
        "signsignified",
        "relation",
        "contingent",
        "whereas",
        "philosopher",
        "prefer",
        "necessity",
        "reid",
        "believe",
        "messiness",
        "actual",
        "perceptual",
        "process",
        "contains",
        "necessity",
        "juncture",
        "second",
        "suggestion",
        "pseudolinguistic",
        "notion",
        "reid",
        "sign",
        "suggest",
        "conception",
        "signify",
        "word",
        "dog",
        "instance",
        "lead",
        "familiar",
        "word",
        "think",
        "certain",
        "domesticated",
        "animal",
        "also",
        "man",
        "s",
        "best",
        "friend",
        "already",
        "know",
        "term",
        "happen",
        "hearing",
        "word",
        "dog",
        "deriving",
        "inferring",
        "object",
        "peculiar",
        "fitness",
        "word",
        "relation",
        "sign",
        "thing",
        "signify",
        "spoken",
        "written",
        "language",
        "almost",
        "always",
        "arbitrary",
        "sense",
        "similarity",
        "dog",
        "word",
        "dog",
        "sense",
        "dog",
        "artificial",
        "artifactual",
        "sign",
        "reid",
        "contrast",
        "natural",
        "sign",
        "blushing",
        "signifies",
        "one",
        "small",
        "number",
        "mental",
        "state",
        "blushing",
        "caused",
        "event",
        "embarrassment",
        "anger",
        "romantic",
        "stimulation",
        "blood",
        "rushing",
        "subcutaneous",
        "circulatory",
        "system",
        "face",
        "reliably",
        "occurs",
        "across",
        "member",
        "specie",
        "response",
        "small",
        "set",
        "stimulus",
        "apparent",
        "universality",
        "making",
        "blushing",
        "natural",
        "sign",
        "discover",
        "relationship",
        "observation",
        "experience",
        "however",
        "according",
        "reid",
        "subset",
        "natural",
        "sign",
        "lead",
        "u",
        "think",
        "signify",
        "without",
        "prior",
        "experience",
        "member",
        "category",
        "though",
        "never",
        "notion",
        "conception",
        "thing",
        "signified",
        "suggest",
        "conjure",
        "natural",
        "kind",
        "magic",
        "give",
        "u",
        "conception",
        "create",
        "belief",
        "ihm",
        "put",
        "hand",
        "table",
        "pause",
        "experience",
        "sensation",
        "hardness",
        "tactile",
        "sensation",
        "lead",
        "u",
        "immediately",
        "conceive",
        "caused",
        "hard",
        "certain",
        "resistive",
        "construction",
        "aware",
        "table",
        "s",
        "hardness",
        "caused",
        "sensation",
        "automatically",
        "understand",
        "think",
        "special",
        "kind",
        "physical",
        "constitution",
        "kind",
        "tactile",
        "sensation",
        "nonetheless",
        "must",
        "conclude",
        "connection",
        "effect",
        "constitution",
        "ought",
        "considered",
        "original",
        "principle",
        "human",
        "nature",
        "ihm",
        "defining",
        "feature",
        "kind",
        "natural",
        "sign",
        "tactile",
        "sensation",
        "hardness",
        "instance",
        "sign",
        "lead",
        "u",
        "conceive",
        "signify",
        "simply",
        "built",
        "way",
        "conception",
        "encountering",
        "sign",
        "reid",
        "s",
        "approach",
        "relationship",
        "contrast",
        "sharply",
        "taken",
        "advocate",
        "way",
        "idea",
        "attempted",
        "posit",
        "strong",
        "relationship",
        "idea",
        "sensation",
        "quality",
        "physical",
        "object",
        "placing",
        "hand",
        "table",
        "tactile",
        "sensation",
        "immediately",
        "lead",
        "mind",
        "conception",
        "apprehension",
        "touching",
        "hard",
        "object",
        "one",
        "s",
        "conception",
        "object",
        "particular",
        "quality",
        "amount",
        "perception",
        "conception",
        "accompanied",
        "conviction",
        "accuracy",
        "answer",
        "one",
        "come",
        "conception",
        "one",
        "encountered",
        "natural",
        "sign",
        "lead",
        "one",
        "conception",
        "natural",
        "sign",
        "lead",
        "one",
        "conception",
        "merely",
        "one",
        "s",
        "constitution",
        "conviction",
        "accuracy",
        "conception",
        "bestowed",
        "conception",
        "reid",
        "think",
        "relevant",
        "conception",
        "come",
        "nature",
        "constitution",
        "conceive",
        "object",
        "particular",
        "way",
        "merely",
        "nature",
        "conceive",
        "object",
        "way",
        "conception",
        "nonoptional",
        "unavoidable",
        "thus",
        "one",
        "help",
        "trust",
        "perception",
        "dictate",
        "common",
        "sense",
        "aware",
        "object",
        "perception",
        "belief",
        "give",
        "given",
        "constitution",
        "reid",
        "belief",
        "mind",
        "come",
        "connected",
        "mindindependent",
        "world",
        "something",
        "like",
        "way",
        "come",
        "grasp",
        "object",
        "language",
        "designed",
        "purpose",
        "however",
        "come",
        "aware",
        "object",
        "sens",
        "utilizing",
        "something",
        "like",
        "language",
        "embedded",
        "constitution",
        "sensation",
        "function",
        "like",
        "language",
        "nature",
        "constructed",
        "sense",
        "metaphor",
        "say",
        "know",
        "world",
        "world",
        "speaks",
        "u",
        "metaphor",
        "illuminates",
        "fact",
        "reid",
        "see"
    ]
}