{
    "main_text": "Moral Principles\n3. Moral Principles\n\nAccording to the picture sketched thus far, Reid’s account of\nautonomous action is as follows: We human beings can act from a great\nvariety of principles, including the so-called mechanical and animal\nprinciples. What renders us rational agents distinct from the rest of\nthe animals is our ability to gain critical distance from these\nincentives and regulate our conduct by appeal to the two rational\nprinciples of action, asking whether a given course of action truly\ncontributes to our good on the whole and is consonant with moral duty.\nFinally, the principle of duty enjoys motivational primacy. Although I\nhave not yet emphasized the point, the similarities between\nReid’s and Kant’s thought in these respects are\nunmistakable. (We have, however, no evidence that Reid was aware of\nKant’s work.) According to both Reid and Kant, we are rational\nbeings not primarily because we can engage in means-end practical\nreasoning. Rather, we are practically rational agents primarily\nbecause we can assess the various impulses to act by appeal to a\n“certain general principle” or law – this law\nconsisting, in Reid’s view, in the rational principles of\naction. Indeed, if J. B. Schneewind is correct, Reid and Kant were\nunique among the moderns inasmuch as that they conceived of morality\nprimarily in terms of rational self-governance (see Schneewind\n1998).\n\nStill, we saw earlier that there is an important difference between\nReid and Kant. Kant is an ethical monist, holding that there is one\nmaster principle of morality—the categorical\nimperative—which is fundamental and from which all our\nparticular duties can be derived. Reid, by contrast, rejects ethical\nmonism, maintaining that there is no such master principle, but only a\nvariety of moral principles that are self-evident and irreducible to\none another. The locution “the principle of duty,” in\nReid’s mouth, is probably best understood to be a shorthand way\nof referring to one or another of these principles which can govern\npractical deliberation.\n\nIn his chapter “Of the first principles of morals,” Reid\npresents the first principles of morality “without pretending to\na complete enumeration” (EAP V.i: 270). The constellation of\nprinciples that Reid presents is a hodgepodge. Some are metaethical\nprinciples that specify certain properties of moral principles, such\nas that they apply only to free actions, while others are normative\nprinciples that one might consult when deliberating. Among the\nnormative principles that Reid presents are these:\n\n\nWe ought to prefer a greater good, though more distant, to a less; and\na less evil to the greater.\n\nEvery man ought to consider himself as member of the common society of\nmankind, and of the subordinate societies to which he belongs, such as\nfamily, friends, neighborhood, and country, and do as much good as he\ncan, and as little hurt to the societies of which he is a part.\n\nIn every case, we ought to act that part toward another, which we\nwould judge to be right in him to act toward us, if we were in his\ncircumstance and he in ours. (EAP V.i)\n\n\nPrinciples such as these, Reid says, form a system of morality, but\nonly in a weak sense. They form a system only in the sense that we can\norganize them in such a way that facilitates “apprehension and\nmemory.” In this respect, a system of morals, according to Reid,\nis not like a system of geometry “where the subsequent parts\nderive their evidence from the preceding” but “resembles\nmore a system of botany … where the subsequent parts depend not\nfor their evidence upon the preceding” (EAP V.ii: 281). So,\nwhile Reid admits that the last principle stated above is the\n“most comprehensive,” he does not claim that it is\nfundamental in the sense that it grounds the other moral principles.\nRather, he holds that each of the principles of morality is\nself-evident, at least to those who have a sound understanding, a\nsatisfactory moral education, and are not in the grip of self-interest\nor passion. These principles are self-evident, in part, because they\nare not amenable to direct argument or proof, for any such argument\n“will either take for granted the thing to be proved” or\nbe “something not more evident” (EAP V.i: 361; for more\ndiscussion, see Cuneo 2004, 259 and Davis 2006, Ch. 6).\n\nThose familiar with the history of ethical intuitionism know that its\ncritics have found the view unsatisfactory because the intuitionists\nhad almost nothing informative to say about why, in a given situation,\na particular moral principle takes precedence, and how we could know\nthat it did (see McNaughton 1996). In hindsight, it is remarkable that\nReid shows little interest in this problem, stating that it is usually\nclear to a candid mind which moral principles take precedence and what\none should do (see EAP V.i; although see Roeser 2010a, 15–16).\nInstead, Reid is more concerned to argue that there must be\nfirst-principles of morality. In his argument for this claim, Reid\nappeals to a traditional regress-style argument according to which\nthere must be some fundamental moral principles which both ground and\njustify our moral deliberation on pain of our being unable to engage\nin such deliberation, which we clearly can (see EAP V.i).\n\nAt first glance, this can give the impression that moral judgments\nmust, in Reid’s view, derive their warrant from moral first\nprinciples, presumably by being inferred from them. Although Reid\nmight encourage this impression in places, in other places he clearly\nindicates that this is not how he views things. In his account of\nparticular moral judgments, for example, Reid insists that we\nordinarily form them immediately or non-inferentially. A moderately\nvirtuous agent “will rarely be at a loss to distinguish good\nfrom ill in his own conduct, without the labour of reasoning”\n(EAP V.ii: 280). If the first principles of morality were\nwarrant-conferring axioms, however, this presumably would not be the\ncase (see Cuneo 2014).\n\nSuppose, then, that in Reid’s view appeal to moral first\nprinciples rarely plays a role in the formation of particular moral\njudgments. It is natural to wonder about the role Reid envisions moral\nfirst principles to play in ordinary moral thought. On this matter,\nReid says less than one might like. A promising strategy of\ninterpretation, however, is to draw a parallel between the first\nprinciples of morality, on the one hand, and what Reid says about the\nfirst principles of common sense in the Inquiry and\nEssays on the Intellectual Powers, on the other.\n\nIn his discussion of the principles of common sense, Reid presents\nvarious first principles, including the claims that memory is reliable\nand that those things exist that we distinctly perceive. Although\nsometimes he seems to claim that our particular perceptual judgments\nare derived from them, a closer look at what Reid says makes it clear\nthat this is not his considered view. For, in Reid’s view,\nordinary perceptual judgments are formed non-inferentially and are not\nself-evident. What role, then, do these principles of common sense\nplay? Nicholas Wolterstorff (2001, Ch. IX and 2004) argues that Reid\nthinks of such principles as being similar to what Wittgenstein, in\nOn Certainty, called “framework propositions.”\nThey are propositions that ordinary people do not typically explicitly\nbelieve but rather take for granted in their everyday comings and\ngoings. Similarly, one might hold that, properly understood,\nReid’s view is that the moral first-principles are not\npropositions that ordinary agents who have received a decent moral\neducation ordinarily consciously believe at some time or other.\nRather, they are what these agents take for granted in their moral\ndeliberations; they form the horizon or background against which they\ndeliberate—although these agents would, presumably, assent to\nthem if they were explicitly presented (for an alternative but, in\nprinciple, complimentary account, see Davis 2006, Ch. 6).\n\nBe that as it may, Reid’s deep impulse for affirming the\nexistence of these principles is not so much to reply to traditional\nworries about stopping a regress of reasons as to make an anti-Humean\npoint. (Hume, after all, also accepts the regress argument; see EAP\nV.vii.) According to Reid’s construal of it, the aim of Humean\npractical reason is not to determine the ends that we should have, but\nmerely to ascertain how most effectively to satisfy our passions (EAP\nIII.iii.i: 153; cf. also EAP II.ii: 54). Reid, by contrast, takes it\nto be evident that we can form a conception of our good on the whole\nand regulate our actions in accordance with it. But if we can do this,\nReid contends, then Hume’s account of practical reason cannot be\ncorrect. We can reason not just about means but also ends. Moreover,\nif Reid is correct and it is the province of reason to form a\nconception of one’s good on the whole, then Hume’s more\nextravagant claims about reason also cannot be correct. For, if Reid\nis right, not only is it reason’s province to form a notion of\none’s good upon the whole, it is also its role to guide action\nin such a way that it is conducive to one’s own good. It cannot\nbe true, then, that it is not contrary to reason for an agent to\nprefer his lesser good to his greater, as Hume claimed.\n",
    "section_title": "3. Moral Principles",
    "entry_title": "Reid’s Ethics",
    "hierarchy_title": "Reid’s Ethics || Moral Principles",
    "tokenized_text": [
        "moral",
        "principle",
        "moral",
        "principle",
        "according",
        "picture",
        "sketched",
        "thus",
        "far",
        "reid",
        "account",
        "autonomous",
        "action",
        "follows",
        "human",
        "being",
        "act",
        "great",
        "variety",
        "principle",
        "including",
        "socalled",
        "mechanical",
        "animal",
        "principle",
        "render",
        "u",
        "rational",
        "agent",
        "distinct",
        "rest",
        "animal",
        "ability",
        "gain",
        "critical",
        "distance",
        "incentive",
        "regulate",
        "conduct",
        "appeal",
        "two",
        "rational",
        "principle",
        "action",
        "asking",
        "whether",
        "given",
        "course",
        "action",
        "truly",
        "contributes",
        "good",
        "whole",
        "consonant",
        "moral",
        "duty",
        "finally",
        "principle",
        "duty",
        "enjoys",
        "motivational",
        "primacy",
        "although",
        "yet",
        "emphasized",
        "point",
        "similarity",
        "reid",
        "kant",
        "thought",
        "respect",
        "unmistakable",
        "however",
        "evidence",
        "reid",
        "aware",
        "kant",
        "work",
        "according",
        "reid",
        "kant",
        "rational",
        "being",
        "primarily",
        "engage",
        "meansend",
        "practical",
        "reasoning",
        "rather",
        "practically",
        "rational",
        "agent",
        "primarily",
        "ass",
        "various",
        "impulse",
        "act",
        "appeal",
        "certain",
        "general",
        "principle",
        "law",
        "law",
        "consisting",
        "reid",
        "view",
        "rational",
        "principle",
        "action",
        "indeed",
        "j",
        "b",
        "schneewind",
        "correct",
        "reid",
        "kant",
        "unique",
        "among",
        "modern",
        "inasmuch",
        "conceived",
        "morality",
        "primarily",
        "term",
        "rational",
        "selfgovernance",
        "see",
        "schneewind",
        "still",
        "saw",
        "earlier",
        "important",
        "difference",
        "reid",
        "kant",
        "kant",
        "ethical",
        "monist",
        "holding",
        "one",
        "master",
        "principle",
        "moralitythe",
        "categorical",
        "imperativewhich",
        "fundamental",
        "particular",
        "duty",
        "derived",
        "reid",
        "contrast",
        "reject",
        "ethical",
        "monism",
        "maintaining",
        "master",
        "principle",
        "variety",
        "moral",
        "principle",
        "selfevident",
        "irreducible",
        "one",
        "another",
        "locution",
        "principle",
        "duty",
        "reid",
        "mouth",
        "probably",
        "best",
        "understood",
        "shorthand",
        "way",
        "referring",
        "one",
        "another",
        "principle",
        "govern",
        "practical",
        "deliberation",
        "chapter",
        "first",
        "principle",
        "moral",
        "reid",
        "present",
        "first",
        "principle",
        "morality",
        "without",
        "pretending",
        "complete",
        "enumeration",
        "eap",
        "vi",
        "constellation",
        "principle",
        "reid",
        "present",
        "hodgepodge",
        "metaethical",
        "principle",
        "specify",
        "certain",
        "property",
        "moral",
        "principle",
        "apply",
        "free",
        "action",
        "others",
        "normative",
        "principle",
        "one",
        "might",
        "consult",
        "deliberating",
        "among",
        "normative",
        "principle",
        "reid",
        "present",
        "ought",
        "prefer",
        "greater",
        "good",
        "though",
        "distant",
        "le",
        "le",
        "evil",
        "greater",
        "every",
        "man",
        "ought",
        "consider",
        "member",
        "common",
        "society",
        "mankind",
        "subordinate",
        "society",
        "belongs",
        "family",
        "friend",
        "neighborhood",
        "country",
        "much",
        "good",
        "little",
        "hurt",
        "society",
        "part",
        "every",
        "case",
        "ought",
        "act",
        "part",
        "toward",
        "another",
        "would",
        "judge",
        "right",
        "act",
        "toward",
        "u",
        "circumstance",
        "eap",
        "vi",
        "principle",
        "reid",
        "say",
        "form",
        "system",
        "morality",
        "weak",
        "sense",
        "form",
        "system",
        "sense",
        "organize",
        "way",
        "facilitates",
        "apprehension",
        "memory",
        "respect",
        "system",
        "moral",
        "according",
        "reid",
        "like",
        "system",
        "geometry",
        "subsequent",
        "part",
        "derive",
        "evidence",
        "preceding",
        "resembles",
        "system",
        "botany",
        "subsequent",
        "part",
        "depend",
        "evidence",
        "upon",
        "preceding",
        "eap",
        "vii",
        "reid",
        "admits",
        "last",
        "principle",
        "stated",
        "comprehensive",
        "claim",
        "fundamental",
        "sense",
        "ground",
        "moral",
        "principle",
        "rather",
        "hold",
        "principle",
        "morality",
        "selfevident",
        "least",
        "sound",
        "understanding",
        "satisfactory",
        "moral",
        "education",
        "grip",
        "selfinterest",
        "passion",
        "principle",
        "selfevident",
        "part",
        "amenable",
        "direct",
        "argument",
        "proof",
        "argument",
        "either",
        "take",
        "granted",
        "thing",
        "proved",
        "something",
        "evident",
        "eap",
        "vi",
        "discussion",
        "see",
        "cuneo",
        "davis",
        "ch",
        "familiar",
        "history",
        "ethical",
        "intuitionism",
        "know",
        "critic",
        "found",
        "view",
        "unsatisfactory",
        "intuitionists",
        "almost",
        "nothing",
        "informative",
        "say",
        "given",
        "situation",
        "particular",
        "moral",
        "principle",
        "take",
        "precedence",
        "could",
        "know",
        "see",
        "mcnaughton",
        "hindsight",
        "remarkable",
        "reid",
        "show",
        "little",
        "interest",
        "problem",
        "stating",
        "usually",
        "clear",
        "candid",
        "mind",
        "moral",
        "principle",
        "take",
        "precedence",
        "one",
        "see",
        "eap",
        "vi",
        "although",
        "see",
        "roeser",
        "a",
        "instead",
        "reid",
        "concerned",
        "argue",
        "must",
        "firstprinciples",
        "morality",
        "argument",
        "claim",
        "reid",
        "appeal",
        "traditional",
        "regressstyle",
        "argument",
        "according",
        "must",
        "fundamental",
        "moral",
        "principle",
        "ground",
        "justify",
        "moral",
        "deliberation",
        "pain",
        "unable",
        "engage",
        "deliberation",
        "clearly",
        "see",
        "eap",
        "vi",
        "first",
        "glance",
        "give",
        "impression",
        "moral",
        "judgment",
        "must",
        "reid",
        "view",
        "derive",
        "warrant",
        "moral",
        "first",
        "principle",
        "presumably",
        "inferred",
        "although",
        "reid",
        "might",
        "encourage",
        "impression",
        "place",
        "place",
        "clearly",
        "indicates",
        "view",
        "thing",
        "account",
        "particular",
        "moral",
        "judgment",
        "example",
        "reid",
        "insists",
        "ordinarily",
        "form",
        "immediately",
        "noninferentially",
        "moderately",
        "virtuous",
        "agent",
        "rarely",
        "loss",
        "distinguish",
        "good",
        "ill",
        "conduct",
        "without",
        "labour",
        "reasoning",
        "eap",
        "vii",
        "first",
        "principle",
        "morality",
        "warrantconferring",
        "axiom",
        "however",
        "presumably",
        "would",
        "case",
        "see",
        "cuneo",
        "suppose",
        "reid",
        "view",
        "appeal",
        "moral",
        "first",
        "principle",
        "rarely",
        "play",
        "role",
        "formation",
        "particular",
        "moral",
        "judgment",
        "natural",
        "wonder",
        "role",
        "reid",
        "envisions",
        "moral",
        "first",
        "principle",
        "play",
        "ordinary",
        "moral",
        "thought",
        "matter",
        "reid",
        "say",
        "le",
        "one",
        "might",
        "like",
        "promising",
        "strategy",
        "interpretation",
        "however",
        "draw",
        "parallel",
        "first",
        "principle",
        "morality",
        "one",
        "hand",
        "reid",
        "say",
        "first",
        "principle",
        "common",
        "sense",
        "inquiry",
        "essay",
        "intellectual",
        "power",
        "discussion",
        "principle",
        "common",
        "sense",
        "reid",
        "present",
        "various",
        "first",
        "principle",
        "including",
        "claim",
        "memory",
        "reliable",
        "thing",
        "exist",
        "distinctly",
        "perceive",
        "although",
        "sometimes",
        "seems",
        "claim",
        "particular",
        "perceptual",
        "judgment",
        "derived",
        "closer",
        "look",
        "reid",
        "say",
        "make",
        "clear",
        "considered",
        "view",
        "reid",
        "view",
        "ordinary",
        "perceptual",
        "judgment",
        "formed",
        "noninferentially",
        "selfevident",
        "role",
        "principle",
        "common",
        "sense",
        "play",
        "nicholas",
        "wolterstorff",
        "ch",
        "ix",
        "argues",
        "reid",
        "think",
        "principle",
        "similar",
        "wittgenstein",
        "certainty",
        "called",
        "framework",
        "propositions",
        "proposition",
        "ordinary",
        "people",
        "typically",
        "explicitly",
        "believe",
        "rather",
        "take",
        "granted",
        "everyday",
        "coming",
        "going",
        "similarly",
        "one",
        "might",
        "hold",
        "properly",
        "understood",
        "reid",
        "view",
        "moral",
        "firstprinciples",
        "proposition",
        "ordinary",
        "agent",
        "received",
        "decent",
        "moral",
        "education",
        "ordinarily",
        "consciously",
        "believe",
        "time",
        "rather",
        "agent",
        "take",
        "granted",
        "moral",
        "deliberation",
        "form",
        "horizon",
        "background",
        "deliberatealthough",
        "agent",
        "would",
        "presumably",
        "assent",
        "explicitly",
        "presented",
        "alternative",
        "principle",
        "complimentary",
        "account",
        "see",
        "davis",
        "ch",
        "may",
        "reid",
        "deep",
        "impulse",
        "affirming",
        "existence",
        "principle",
        "much",
        "reply",
        "traditional",
        "worry",
        "stopping",
        "regress",
        "reason",
        "make",
        "antihumean",
        "point",
        "hume",
        "also",
        "accepts",
        "regress",
        "argument",
        "see",
        "eap",
        "vvii",
        "according",
        "reid",
        "construal",
        "aim",
        "humean",
        "practical",
        "reason",
        "determine",
        "end",
        "merely",
        "ascertain",
        "effectively",
        "satisfy",
        "passion",
        "eap",
        "iiiiiii",
        "cf",
        "also",
        "eap",
        "iiii",
        "reid",
        "contrast",
        "take",
        "evident",
        "form",
        "conception",
        "good",
        "whole",
        "regulate",
        "action",
        "accordance",
        "reid",
        "contends",
        "hume",
        "account",
        "practical",
        "reason",
        "correct",
        "reason",
        "mean",
        "also",
        "end",
        "moreover",
        "reid",
        "correct",
        "province",
        "reason",
        "form",
        "conception",
        "one",
        "good",
        "whole",
        "hume",
        "extravagant",
        "claim",
        "reason",
        "also",
        "correct",
        "reid",
        "right",
        "reason",
        "province",
        "form",
        "notion",
        "one",
        "good",
        "upon",
        "whole",
        "also",
        "role",
        "guide",
        "action",
        "way",
        "conducive",
        "one",
        "good",
        "true",
        "contrary",
        "reason",
        "agent",
        "prefer",
        "lesser",
        "good",
        "greater",
        "hume",
        "claimed"
    ]
}