{
    "main_text": "A Direct Realist Theory of Memory\n2. A Direct Realist Theory of Memory\n\n\nContemporary philosophers and cognitive scientists recognize that\nmemory is a diverse phenomenon and they draw some useful distinctions\namong varieties of\n memory.[2]\nFor example, Endel Tulving distinguishes\nbetween episodic memory, semantic memory and procedural memory.\nRemembering how to ride a bike is an example of procedural\nmemory. Remembering that Napoleon was defeated at Waterloo is an\nexample of a semantic memory. Remembering one’s tenth\nbirthday party is an example of an episodic memory.\n\n\nThe distinction most relevant to the issues Reid, Locke and Hume raise\nfor memory and personal identity is between semantic and episodic\nmemory. Henri Bergson and Bertrand Russell developed a similar\ndistinction, and Russell’s distinction between factual and personal\nmemory accords with that between semantic and episodic memory.\nSemantic memories are properly reported using a factive\ncomplement—a that-clause—after the verbs\n‘remember’ or ‘recall’, as in ‘Jane\nremembers that Napoleon was defeated at Waterloo’. In\nparticular, a semantic memory\ncannot be reported using the form ‘S\nremembers/recalls [x] f-ing’, as in ‘Jane\nrecalls her tenth birthday party,’ or ‘John remembers\nfalling off his bike.’ Only episodic memories may be\nproperly reported using this form. No one today can properly\nreport ‘I remember Napoleon being defeated at Waterloo,’\nthough many may properly report ‘I remember that\nNapoleon was defeated at Waterloo.’ On the other hand, an\nepisodic memory can be reported using the same form by which\nsemantic memories are reported because episodic memories may ground\nsemantic memories under certain circumstances. It is legitimate\nto state both ‘I recall my tenth birthday party,’ in\nreporting an episodic memory of that event and to state ‘I\nremember that I had a tenth birthday party’, in reporting a\nsemantic memory, whose justification would appeal to the previous\nepisodic memory.\n\n\nEpisodic memories are further distinguished from semantic memories\nby the Previous Awareness Condition on episodic memory. The\nPrevious Awareness Condition has been developed and examined by Sydney\nShoemaker (1970), among\n others.\nPut simply, one has an episodic memory of\nan event only if one was agent or witness to the event\nremembered. The Previous Awareness Condition is a necessary but\ninsufficient condition on episodic memory. If one has an\nexperience as of being lost in a store as a child, but one was not in\nfact lost in a store as a child, such an experience is not an episodic\nmemory. On the other hand, each of us has been agent or witness\nto many events of which we have no episodic memory. For example,\none may not remember one’s third birthday party and so lack an\nepisodic memory of an event to which one was surely witness.\n\n\nReid is most interested in episodic memory. Though Reid does\nnot use the contemporary terminology, his theory draws upon both the\ndistinction between episodic and semantic memory and the Previous\nAwareness Condition on episodic memory. As he puts the matter:\n\n\nThings remembered must be things formerly perceived or known.\nI remember the transit of Venus over the sun in the year 1769. I\nmust therefore have perceived it at the time it happened, otherwise I\ncould not now remember it. Our first acquaintance with any object\nof thought cannot be by remembrance. Memory can only produce a\ncontinuance or renewal of a former acquaintance with the things\nremembered (Essays, 255).\n\n\nThough Reid uses the term ‘acquaintance,’ the things\nretained through memory are things previously perceived or\nexperienced. The term ‘acquaintance’ has acquired a\ntechnical sense that it did not have in Reid’s day, so it is\nbetter to see Reid as holding that memory preserves contact with events\npreviously apprehended through perception and thereby known by\nacquaintance. Acquaintance presupposes apprehension, and prior\nepisodes of apprehension are necessary for retained acquaintance.\n\n\nAccording to Reid, episodic memory is not a current apprehension of a\npast event, nor is it a current apprehension of a past\nexperience. These theoretical options were ruled out by\nReid’s criticism of Locke and Hume. Rather, according to\nReid, memory is an act that preserves a past apprehension. Reid\ncharacterizes memory as exhibiting what we now call the Previous\nAwareness Condition. He holds that reports of episodic memory are\ntrue only if the person reporting satisfies the condition, and that\nexperiences that otherwise appear to be episodic memories, but\nwhich fail the condition, are not episodic memories (Essays,\n264).\n\n\nReid does not count what we term ‘semantic memories’ as\nmemories in the proper sense. He discounts them not because they fail to\nmeet the Previous Awareness Condition, but because he holds that\nsemantic memories are better classified as beliefs or knowledge rather\nthan memories. For example, he would hold that a person today who\nreports remembering that Napoleon was defeated at Waterloo\nexpresses a belief or knowledge rather than a memory. He holds\nthis because he requires a distinction between two sorts of beliefs\nthat would otherwise be obscured by the fact that each sort can be\nexpressed in the form of a semantic memory report. The distinction is\nbetween beliefs that play a role in preserving past apprehension\n(and which are constituents of episodic memory), and those\nthat do not play a role in preserving past apprehension (and which are\nnot, strictly speaking, memories). For example, Jane believes\nthat she dined with a friend last night. Jane has an episodic\nmemory of this event, and according to Reid, her belief ‘that I\ndined with a friend last night,’ plays a role in preserving\nJane’s past apprehension of dining with her friend. On the\nother hand, Jane’s belief that she had a third birthday party\ndoes not play a role in preserving her past apprehension of her third\nbirthday party; she has no episodic memory of her third birthday\nparty. The difference between these two sorts of belief is\nobscured by the fact that each may be expressed by using the factive\ncompliment: ‘Jane remembers that she dined with a friend\nlast night,’ and ‘Jane remembers that she had a\nthird birthday party.’\n\n\nAccording to Reid, a memory consists in a conception of a past event\nand a belief about that past event, that it happened to the person who\nis represented in that memory as agent or witness (Essays,\n228, 232, 254, 257). This conception-belief structure mirrors Reid’s\naccounts of perception and consciousness, each of which also consist\nin a conception and belief. Folescu (2018a) examines whether memorial\nconception differs from or is the same as the kind of conception\ningredient in perception, consciousness, and other intentional mental\nstates. The belief that is a constituent of memory, on Reid’s view, is\na belief of some past event, that it happened. In particular, it is a\nbelief that it happened to me, where the pronoun is indexed to the\nperson who is represented in the memory as agent or witness to the\nevent (Essays, 255, 262). The belief is about\nor of the event because the other constituent of\nmemory—the conception—supplies the event, which is the\nobject of the belief. On Reid’s view, the objects of memory are the\nevents presented in past apprehensions. Memory preserves past\napprehensions by relating us to the events originally presented in\nperception—memory preserves past apprehension through conception\nand belief. In particular, the objects of memory are not the past\napprehensions themselves but that which is presented in the past\napprehensions, namely, the original event (Inquiry,\n28). Folescu (2018b) examines a tension in Reid’s accounts of memory\nand perception. According to Reid, we remember events that were\napprehended in the past by perception. But Reid insists that\nperception is confined to the present. Because perception is confined\nto the present, we cannot perceive events, which have a duration. How,\nthen, can we remember what we cannot have perceived? \n\n\nReid holds that memory is not a current apprehension of an event\nalready presented in a past apprehension. In other words, we do\nnot remember events by re-apprehending them. Rather, the\npast apprehension is itself preserved by the act of remembering the\nevent apprehended. Memory is an act of preservation through\nconception and belief. Such preservation does not itself\nconstitute an additional apprehension over and above the\napprehension preserved. Indeed, according to Reid, it is\nimpossible to currently apprehend any events in the past; apprehension\nis confined to perceiving present objects or being conscious of present\nmental operations (Essays, 23, 253). Reid does not deny\nthat memory is itself a current mental state, nor does he deny that\nmemory presupposes a past apprehension. He denies only that\nmemory is a current apprehension, and that the object of a memory is a\npast apprehension (Essays, 253). Memory preserves past\napprehension by conceiving of an event previously apprehended and\nbelieving, of this event, that it happened to me.\n\n\nReid holds that memory, like perception, is immediate. Neither\nthe conception nor the belief that are the ingredients of memory are\nformed on the basis of reasoning or testimony. Memory is an\noriginal faculty of our constitution governed by what Reid calls\n“the first principles of contingent truths.” In the\ncase of memory, the governing principle is that “those things did\nreally happen which I distinctly remember” (Essays,\n474). On Reid’s view, a normally functioning human does not\nand need not infer to a past event in episodic memory. In order\nto infer to a past event, one must have some prior, non-inferential\nrelation to the event if it is to be a memory rather than a belief or\nknowledge. But then this prior, non-inferential relation would be\nan episodic memory. In addition, if episodic memory involved an\ninference to the effect that the event happened to me, the inference\nwould be otiose because, as Reid claims, such a belief is already an\nimmediate, non-inferential component of episodic memory. In\nprinciple, one could infer from the conception and belief that are\ningredients in memory to a further belief that the event\nhappened. But if such a belief plays a role in preserving past\napprehension then it is superfluous—such a belief, subject to\nthe Previous Awareness Condition, is already embedded in episodic\nmemory. If the belief does not play a role in preserving past\napprehension then it is a semantic memory, which, according to Reid, is\namong the species of belief or knowledge rather memory.\n\n\nThe distinction between beliefs that are ingredients in episodic\nmemories and beliefs that are based on, but not ingredients in,\nepisodic memories allows Reid to account for cases in which a memorial\nexperience continues to represent an event as having happened, even\nwhen the person who seems to remember the event has what she regards as\nan overriding reason to believe that the event did not occur. The\nbelief that is an ingredient in the experience represents the event as\nhaving happened to the person who seems to remember it. Further, the\nbelief will continue to represent the event as having happened to the\nperson, even under conditions in which she forms a separate belief, not\nembedded in the memorial experience, to the effect that it did not\nhappen to her.\n\n\nThe distinction also allows Reid to satisfy a constraint on any\nadequate theory of memory; namely, that it explain why memory\nrepresents events as having the special quality of being in the\npast. If belief were not an ingredient in episodic memory, then\nthough we might believe that the events we remember are in the\npast, memory could not represent events as past. If\nbelief were not an ingredient in memory, then memory alone would relate\nus to an event previously apprehended. But the apprehension\npreserved is an apprehension of an event that was, at that time,\nrepresented in that apprehension as present. The pastness of the\nevent apprehended is not part of the content of the past\napprehension. But because a belief that the event happened to me\nis embedded in the memory itself, memory represents not merely past\nevents, but past events as having occurred. In other words, the\nbelief that is partly constitutive of episodic memory is tensed.\n\n\nOne might wonder whether Reid’s account of memory is subject to the\nsame criticisms he levels against Locke and Hume. Does Reid appeal to\nthe storehouse metaphor when he claims that memory is preserved past\napprehension? Reid criticizes Locke and Hume for begging the\nquestion. Yet by holding that memory is in part constituted by a\nbelief, does Reid not also assume the very phenomenon to be explained?\nReid can avoid the criticisms to which the theory of ideas is\nvulnerable by insisting that memory is not a current apprehension, but\nrather a preserved past apprehension. His theory of memory is a direct\nrealist theory because, according to Reid, memory is not directed\ntowards any present perceptions, ideas, or impressions—stored or\notherwise. Neither is memory directed towards any past perceptions,\nideas, or impressions—stored or otherwise. Memory is directed\ntowards the events presented in past apprehensions. Because\napprehensions, perceptions, ideas, and impressions are never the\nobjects of memory, they do not need to be stored for use by\nmemory. Likewise, the belief that is an ingredient in memory is not\nabout any present or past apprehensions. If it were, Reid’s theory\nwould be subject to the same circularity objection he presses against\nLocke and Hume.\n\n\nOn Reid’s theory of memory, an apprehension establishes a\ndirect relation to an event, which relation is preserved in memory by\nthe acts of conceiving the event and believing of the event conceived\nthat it happened to the person who remembers. It is a direct\nrealist theory of memory because it departs from the model on which\nmemory is a current apprehension of a past event or a current\napprehension of a past apprehension. On the direct realist view,\nmemory preserves past apprehension of an event through conception and\nbelief. Reid’s theory captures how memory, like perception,\nrepresents the world, rather than our experiences of the world.\n",
    "section_title": "2. A Direct Realist Theory of Memory",
    "entry_title": "Reid on Memory and Personal Identity",
    "hierarchy_title": "Reid on Memory and Personal Identity || A Direct Realist Theory of Memory",
    "tokenized_text": [
        "direct",
        "realist",
        "theory",
        "memory",
        "direct",
        "realist",
        "theory",
        "memory",
        "contemporary",
        "philosopher",
        "cognitive",
        "scientist",
        "recognize",
        "memory",
        "diverse",
        "phenomenon",
        "draw",
        "useful",
        "distinction",
        "among",
        "variety",
        "memory",
        "example",
        "endel",
        "tulving",
        "distinguishes",
        "episodic",
        "memory",
        "semantic",
        "memory",
        "procedural",
        "memory",
        "remembering",
        "ride",
        "bike",
        "example",
        "procedural",
        "memory",
        "remembering",
        "napoleon",
        "defeated",
        "waterloo",
        "example",
        "semantic",
        "memory",
        "remembering",
        "one",
        "tenth",
        "birthday",
        "party",
        "example",
        "episodic",
        "memory",
        "distinction",
        "relevant",
        "issue",
        "reid",
        "locke",
        "hume",
        "raise",
        "memory",
        "personal",
        "identity",
        "semantic",
        "episodic",
        "memory",
        "henri",
        "bergson",
        "bertrand",
        "russell",
        "developed",
        "similar",
        "distinction",
        "russell",
        "distinction",
        "factual",
        "personal",
        "memory",
        "accord",
        "semantic",
        "episodic",
        "memory",
        "semantic",
        "memory",
        "properly",
        "reported",
        "using",
        "factive",
        "complementa",
        "thatclauseafter",
        "verb",
        "remember",
        "recall",
        "jane",
        "remembers",
        "napoleon",
        "defeated",
        "waterloo",
        "particular",
        "semantic",
        "memory",
        "reported",
        "using",
        "form",
        "remembersrecalls",
        "x",
        "fing",
        "jane",
        "recall",
        "tenth",
        "birthday",
        "party",
        "john",
        "remembers",
        "falling",
        "bike",
        "episodic",
        "memory",
        "may",
        "properly",
        "reported",
        "using",
        "form",
        "one",
        "today",
        "properly",
        "report",
        "remember",
        "napoleon",
        "defeated",
        "waterloo",
        "though",
        "many",
        "may",
        "properly",
        "report",
        "remember",
        "napoleon",
        "defeated",
        "waterloo",
        "hand",
        "episodic",
        "memory",
        "reported",
        "using",
        "form",
        "semantic",
        "memory",
        "reported",
        "episodic",
        "memory",
        "may",
        "ground",
        "semantic",
        "memory",
        "certain",
        "circumstance",
        "legitimate",
        "state",
        "recall",
        "tenth",
        "birthday",
        "party",
        "reporting",
        "episodic",
        "memory",
        "event",
        "state",
        "remember",
        "tenth",
        "birthday",
        "party",
        "reporting",
        "semantic",
        "memory",
        "whose",
        "justification",
        "would",
        "appeal",
        "previous",
        "episodic",
        "memory",
        "episodic",
        "memory",
        "distinguished",
        "semantic",
        "memory",
        "previous",
        "awareness",
        "condition",
        "episodic",
        "memory",
        "previous",
        "awareness",
        "condition",
        "developed",
        "examined",
        "sydney",
        "shoemaker",
        "among",
        "others",
        "put",
        "simply",
        "one",
        "episodic",
        "memory",
        "event",
        "one",
        "agent",
        "witness",
        "event",
        "remembered",
        "previous",
        "awareness",
        "condition",
        "necessary",
        "insufficient",
        "condition",
        "episodic",
        "memory",
        "one",
        "experience",
        "lost",
        "store",
        "child",
        "one",
        "fact",
        "lost",
        "store",
        "child",
        "experience",
        "episodic",
        "memory",
        "hand",
        "u",
        "agent",
        "witness",
        "many",
        "event",
        "episodic",
        "memory",
        "example",
        "one",
        "may",
        "remember",
        "one",
        "third",
        "birthday",
        "party",
        "lack",
        "episodic",
        "memory",
        "event",
        "one",
        "surely",
        "witness",
        "reid",
        "interested",
        "episodic",
        "memory",
        "though",
        "reid",
        "use",
        "contemporary",
        "terminology",
        "theory",
        "draw",
        "upon",
        "distinction",
        "episodic",
        "semantic",
        "memory",
        "previous",
        "awareness",
        "condition",
        "episodic",
        "memory",
        "put",
        "matter",
        "thing",
        "remembered",
        "must",
        "thing",
        "formerly",
        "perceived",
        "known",
        "remember",
        "transit",
        "venus",
        "sun",
        "year",
        "must",
        "therefore",
        "perceived",
        "time",
        "happened",
        "otherwise",
        "could",
        "remember",
        "first",
        "acquaintance",
        "object",
        "thought",
        "remembrance",
        "memory",
        "produce",
        "continuance",
        "renewal",
        "former",
        "acquaintance",
        "thing",
        "remembered",
        "essay",
        "though",
        "reid",
        "us",
        "term",
        "acquaintance",
        "thing",
        "retained",
        "memory",
        "thing",
        "previously",
        "perceived",
        "experienced",
        "term",
        "acquaintance",
        "acquired",
        "technical",
        "sense",
        "reid",
        "day",
        "better",
        "see",
        "reid",
        "holding",
        "memory",
        "preserve",
        "contact",
        "event",
        "previously",
        "apprehended",
        "perception",
        "thereby",
        "known",
        "acquaintance",
        "acquaintance",
        "presupposes",
        "apprehension",
        "prior",
        "episode",
        "apprehension",
        "necessary",
        "retained",
        "acquaintance",
        "according",
        "reid",
        "episodic",
        "memory",
        "current",
        "apprehension",
        "past",
        "event",
        "current",
        "apprehension",
        "past",
        "experience",
        "theoretical",
        "option",
        "ruled",
        "reid",
        "criticism",
        "locke",
        "hume",
        "rather",
        "according",
        "reid",
        "memory",
        "act",
        "preserve",
        "past",
        "apprehension",
        "reid",
        "characterizes",
        "memory",
        "exhibiting",
        "call",
        "previous",
        "awareness",
        "condition",
        "hold",
        "report",
        "episodic",
        "memory",
        "true",
        "person",
        "reporting",
        "satisfies",
        "condition",
        "experience",
        "otherwise",
        "appear",
        "episodic",
        "memory",
        "fail",
        "condition",
        "episodic",
        "memory",
        "essay",
        "reid",
        "count",
        "term",
        "semantic",
        "memory",
        "memory",
        "proper",
        "sense",
        "discount",
        "fail",
        "meet",
        "previous",
        "awareness",
        "condition",
        "hold",
        "semantic",
        "memory",
        "better",
        "classified",
        "belief",
        "knowledge",
        "rather",
        "memory",
        "example",
        "would",
        "hold",
        "person",
        "today",
        "report",
        "remembering",
        "napoleon",
        "defeated",
        "waterloo",
        "express",
        "belief",
        "knowledge",
        "rather",
        "memory",
        "hold",
        "requires",
        "distinction",
        "two",
        "sort",
        "belief",
        "would",
        "otherwise",
        "obscured",
        "fact",
        "sort",
        "expressed",
        "form",
        "semantic",
        "memory",
        "report",
        "distinction",
        "belief",
        "play",
        "role",
        "preserving",
        "past",
        "apprehension",
        "constituent",
        "episodic",
        "memory",
        "play",
        "role",
        "preserving",
        "past",
        "apprehension",
        "strictly",
        "speaking",
        "memory",
        "example",
        "jane",
        "belief",
        "dined",
        "friend",
        "last",
        "night",
        "jane",
        "episodic",
        "memory",
        "event",
        "according",
        "reid",
        "belief",
        "dined",
        "friend",
        "last",
        "night",
        "play",
        "role",
        "preserving",
        "jane",
        "past",
        "apprehension",
        "dining",
        "friend",
        "hand",
        "jane",
        "belief",
        "third",
        "birthday",
        "party",
        "play",
        "role",
        "preserving",
        "past",
        "apprehension",
        "third",
        "birthday",
        "party",
        "episodic",
        "memory",
        "third",
        "birthday",
        "party",
        "difference",
        "two",
        "sort",
        "belief",
        "obscured",
        "fact",
        "may",
        "expressed",
        "using",
        "factive",
        "compliment",
        "jane",
        "remembers",
        "dined",
        "friend",
        "last",
        "night",
        "jane",
        "remembers",
        "third",
        "birthday",
        "party",
        "according",
        "reid",
        "memory",
        "consists",
        "conception",
        "past",
        "event",
        "belief",
        "past",
        "event",
        "happened",
        "person",
        "represented",
        "memory",
        "agent",
        "witness",
        "essay",
        "conceptionbelief",
        "structure",
        "mirror",
        "reid",
        "account",
        "perception",
        "consciousness",
        "also",
        "consist",
        "conception",
        "belief",
        "folescu",
        "a",
        "examines",
        "whether",
        "memorial",
        "conception",
        "differs",
        "kind",
        "conception",
        "ingredient",
        "perception",
        "consciousness",
        "intentional",
        "mental",
        "state",
        "belief",
        "constituent",
        "memory",
        "reid",
        "view",
        "belief",
        "past",
        "event",
        "happened",
        "particular",
        "belief",
        "happened",
        "pronoun",
        "indexed",
        "person",
        "represented",
        "memory",
        "agent",
        "witness",
        "event",
        "essay",
        "belief",
        "event",
        "constituent",
        "memorythe",
        "conceptionsupplies",
        "event",
        "object",
        "belief",
        "reid",
        "view",
        "object",
        "memory",
        "event",
        "presented",
        "past",
        "apprehension",
        "memory",
        "preserve",
        "past",
        "apprehension",
        "relating",
        "u",
        "event",
        "originally",
        "presented",
        "perceptionmemory",
        "preserve",
        "past",
        "apprehension",
        "conception",
        "belief",
        "particular",
        "object",
        "memory",
        "past",
        "apprehension",
        "presented",
        "past",
        "apprehension",
        "namely",
        "original",
        "event",
        "inquiry",
        "folescu",
        "b",
        "examines",
        "tension",
        "reid",
        "account",
        "memory",
        "perception",
        "according",
        "reid",
        "remember",
        "event",
        "apprehended",
        "past",
        "perception",
        "reid",
        "insists",
        "perception",
        "confined",
        "present",
        "perception",
        "confined",
        "present",
        "perceive",
        "event",
        "duration",
        "remember",
        "perceived",
        "reid",
        "hold",
        "memory",
        "current",
        "apprehension",
        "event",
        "already",
        "presented",
        "past",
        "apprehension",
        "word",
        "remember",
        "event",
        "reapprehending",
        "rather",
        "past",
        "apprehension",
        "preserved",
        "act",
        "remembering",
        "event",
        "apprehended",
        "memory",
        "act",
        "preservation",
        "conception",
        "belief",
        "preservation",
        "constitute",
        "additional",
        "apprehension",
        "apprehension",
        "preserved",
        "indeed",
        "according",
        "reid",
        "impossible",
        "currently",
        "apprehend",
        "event",
        "past",
        "apprehension",
        "confined",
        "perceiving",
        "present",
        "object",
        "conscious",
        "present",
        "mental",
        "operation",
        "essay",
        "reid",
        "deny",
        "memory",
        "current",
        "mental",
        "state",
        "deny",
        "memory",
        "presupposes",
        "past",
        "apprehension",
        "denies",
        "memory",
        "current",
        "apprehension",
        "object",
        "memory",
        "past",
        "apprehension",
        "essay",
        "memory",
        "preserve",
        "past",
        "apprehension",
        "conceiving",
        "event",
        "previously",
        "apprehended",
        "believing",
        "event",
        "happened",
        "reid",
        "hold",
        "memory",
        "like",
        "perception",
        "immediate",
        "neither",
        "conception",
        "belief",
        "ingredient",
        "memory",
        "formed",
        "basis",
        "reasoning",
        "testimony",
        "memory",
        "original",
        "faculty",
        "constitution",
        "governed",
        "reid",
        "call",
        "first",
        "principle",
        "contingent",
        "truths",
        "case",
        "memory",
        "governing",
        "principle",
        "thing",
        "really",
        "happen",
        "distinctly",
        "remember",
        "essay",
        "reid",
        "view",
        "normally",
        "functioning",
        "human",
        "need",
        "infer",
        "past",
        "event",
        "episodic",
        "memory",
        "order",
        "infer",
        "past",
        "event",
        "one",
        "must",
        "prior",
        "noninferential",
        "relation",
        "event",
        "memory",
        "rather",
        "belief",
        "knowledge",
        "prior",
        "noninferential",
        "relation",
        "would",
        "episodic",
        "memory",
        "addition",
        "episodic",
        "memory",
        "involved",
        "inference",
        "effect",
        "event",
        "happened",
        "inference",
        "would",
        "otiose",
        "reid",
        "claim",
        "belief",
        "already",
        "immediate",
        "noninferential",
        "component",
        "episodic",
        "memory",
        "principle",
        "one",
        "could",
        "infer",
        "conception",
        "belief",
        "ingredient",
        "memory",
        "belief",
        "event",
        "happened",
        "belief",
        "play",
        "role",
        "preserving",
        "past",
        "apprehension",
        "superfluoussuch",
        "belief",
        "subject",
        "previous",
        "awareness",
        "condition",
        "already",
        "embedded",
        "episodic",
        "memory",
        "belief",
        "play",
        "role",
        "preserving",
        "past",
        "apprehension",
        "semantic",
        "memory",
        "according",
        "reid",
        "among",
        "specie",
        "belief",
        "knowledge",
        "rather",
        "memory",
        "distinction",
        "belief",
        "ingredient",
        "episodic",
        "memory",
        "belief",
        "based",
        "ingredient",
        "episodic",
        "memory",
        "allows",
        "reid",
        "account",
        "case",
        "memorial",
        "experience",
        "continues",
        "represent",
        "event",
        "happened",
        "even",
        "person",
        "seems",
        "remember",
        "event",
        "regard",
        "overriding",
        "reason",
        "believe",
        "event",
        "occur",
        "belief",
        "ingredient",
        "experience",
        "represents",
        "event",
        "happened",
        "person",
        "seems",
        "remember",
        "belief",
        "continue",
        "represent",
        "event",
        "happened",
        "person",
        "even",
        "condition",
        "form",
        "separate",
        "belief",
        "embedded",
        "memorial",
        "experience",
        "effect",
        "happen",
        "distinction",
        "also",
        "allows",
        "reid",
        "satisfy",
        "constraint",
        "adequate",
        "theory",
        "memory",
        "namely",
        "explain",
        "memory",
        "represents",
        "event",
        "special",
        "quality",
        "past",
        "belief",
        "ingredient",
        "episodic",
        "memory",
        "though",
        "might",
        "believe",
        "event",
        "remember",
        "past",
        "memory",
        "could",
        "represent",
        "event",
        "past",
        "belief",
        "ingredient",
        "memory",
        "memory",
        "alone",
        "would",
        "relate",
        "u",
        "event",
        "previously",
        "apprehended",
        "apprehension",
        "preserved",
        "apprehension",
        "event",
        "time",
        "represented",
        "apprehension",
        "present",
        "pastness",
        "event",
        "apprehended",
        "part",
        "content",
        "past",
        "apprehension",
        "belief",
        "event",
        "happened",
        "embedded",
        "memory",
        "memory",
        "represents",
        "merely",
        "past",
        "event",
        "past",
        "event",
        "occurred",
        "word",
        "belief",
        "partly",
        "constitutive",
        "episodic",
        "memory",
        "tensed",
        "one",
        "might",
        "wonder",
        "whether",
        "reid",
        "account",
        "memory",
        "subject",
        "criticism",
        "level",
        "locke",
        "hume",
        "reid",
        "appeal",
        "storehouse",
        "metaphor",
        "claim",
        "memory",
        "preserved",
        "past",
        "apprehension",
        "reid",
        "criticizes",
        "locke",
        "hume",
        "begging",
        "question",
        "yet",
        "holding",
        "memory",
        "part",
        "constituted",
        "belief",
        "reid",
        "also",
        "assume",
        "phenomenon",
        "explained",
        "reid",
        "avoid",
        "criticism",
        "theory",
        "idea",
        "vulnerable",
        "insisting",
        "memory",
        "current",
        "apprehension",
        "rather",
        "preserved",
        "past",
        "apprehension",
        "theory",
        "memory",
        "direct",
        "realist",
        "theory",
        "according",
        "reid",
        "memory",
        "directed",
        "towards",
        "present",
        "perception",
        "idea",
        "impressionsstored",
        "otherwise",
        "neither",
        "memory",
        "directed",
        "towards",
        "past",
        "perception",
        "idea",
        "impressionsstored",
        "otherwise",
        "memory",
        "directed",
        "towards",
        "event",
        "presented",
        "past",
        "apprehension",
        "apprehension",
        "perception",
        "idea",
        "impression",
        "never",
        "object",
        "memory",
        "need",
        "stored",
        "use",
        "memory",
        "likewise",
        "belief",
        "ingredient",
        "memory",
        "present",
        "past",
        "apprehension",
        "reid",
        "theory",
        "would",
        "subject",
        "circularity",
        "objection",
        "press",
        "locke",
        "hume",
        "reid",
        "theory",
        "memory",
        "apprehension",
        "establishes",
        "direct",
        "relation",
        "event",
        "relation",
        "preserved",
        "memory",
        "act",
        "conceiving",
        "event",
        "believing",
        "event",
        "conceived",
        "happened",
        "person",
        "remembers",
        "direct",
        "realist",
        "theory",
        "memory",
        "departs",
        "model",
        "memory",
        "current",
        "apprehension",
        "past",
        "event",
        "current",
        "apprehension",
        "past",
        "apprehension",
        "direct",
        "realist",
        "view",
        "memory",
        "preserve",
        "past",
        "apprehension",
        "event",
        "conception",
        "belief",
        "reid",
        "theory",
        "capture",
        "memory",
        "like",
        "perception",
        "represents",
        "world",
        "rather",
        "experience",
        "world"
    ]
}