{
    "main_text": "Criticizing the Storehouse Model of Memory\n1. Criticizing the Storehouse Model of Memory\n\n\nReid traces the target of his criticisms back to the Ancients, whom he\ndepicts as holding that the mind is a sensorium—a repository of\npast ideas and impressions (Essays,\n 280).[1] \n On this\ntheory, perception, memory and imagination are causal processes\nbeginning with purely physiological events: impressions on the\nbrain. These physiological states are taken to have mental\ncorrelates—sensations or ideas of sense or sense\nimpressions—which are the objects of perception, memory and\nimagination. These ideas or impressions are representations in the\nsense that they preserve, or re-present information from their\nphysiological correlates.  According to Reid, this view recognizes no\ndistinction between imagination and memory. Each consists in having a\npicture-like impression that remains after the object that\nimpressed upon the senses is gone. The only difference between the two\nis in the fidelity of the imagistic impression to its cause. Memory\nconsists in the preservation of images imprinted in the mind from\nprevious experiences, while imagination consists in constructing\nimages that lack a duplicate in experience.\n\n\nReid offers two criticisms of the ancient theory, as he understands\nit. First, the theory falls afoul of one of Reid’s own\nmethodological strictures, namely, that a theory must adhere to\nNewton’s regulae philosophandi, or rules of\nphilosophizing (Inquiry, 12). The first rule is to posit\nno merely theoretical causes and in Reid’s view the second rule\nforbids positing causes insufficient to explain the phenomenon in\nquestion. According to Reid, there is no observational evidence\nof the existence of impressions on the brain—they are merely\ntheoretical entities (Essays, 281). Furthermore, even if\nwe granted the otherwise theoretical existence of impressions, such\nentities would not be sufficient to explain memory. We might\nestablish a correlation between impressions and memories, but it would\nremain at best just that: a correlation, not a causal\nexplanation. Having learned Hume’s lessons about causation,\nReid denies any necessary connections between impressions and memories\nsufficient to regard the former as a cause of the latter. Reid\nalso considers whether resemblance could ground such a causal\nexplanation, but, having learned Berkeley’s lessons about\nresemblance, he denies that any mental states can resemble material\nstates such as impressions on the brain. Reid’s second\ncriticism is that even if we were to grant that impressions remain\nafter the objects that impressed upon the senses are gone, this would\nentail that we should continue to perceive objects rather than remember\nthem, since on the ancient theory, impressions are the immediate causes\nand objects of perception (Essays, 282).\n\n\nThough Reid identifies his target as having ancient origins, his\nprimary concern is with what he regards as its modern equivalent.\nThis modern theory was introduced by Locke and, according to Reid,\nextended to its inevitable idealist and skeptical conclusions by\nBerkeley and Hume. Reid excerpts passages from Locke’s\nEssay Concerning Human Understanding to illustrate the\nmisleading metaphors Locke inherits from the ancient\ntheory—metaphors of the mind as a storehouse and of ideas and\nimpressions as pictures.\n\n\nThe other way of Retention is the Power to revive again in our Minds\nthose Ideas, which after imprinting have disappeared, or have\nbeen as it were laid aside out of sight…This is Memory,\nwhich is as it were the Store-house of our Ideas…But\nour Ideas being nothing but actual Perceptions in the Mind,\nwhich cease to be any thing, when there is no perception of them, this\nlaying up of our Ideas in the Repository of the\nMemory, signifies no more but this, that the Mind has a Power, in many\ncases, to revive Perceptions, which it once had, with this additional\nPerception annexed to them, that it has had them before. And in\nthis Sense it is, that our Ideas are said to be in our\nMemories, when indeed, they are actually no where, but only there is an\nability in the Mind, when it will, to revive them again; and as it were\npaint them anew on it self, though some with more, some with less\ndifficulty; some more lively, and others more obscurely (Locke,\nEssay, Book II.x.1–2).\n\n\nAs this passage illustrates, Locke himself acknowledges that the\nnotion that the mind is a kind of repository or storehouse is\nmetaphorical. According to Locke’s own theory, ideas and\nimpressions cannot be stored. Locke is committed to the thesis\nthat ideas are momentary and non-continuous and to the thesis that\nidentity over time requires continuous existence. These two\ntheses jointly entail that numerically identical ideas cannot be stored\nover time. Nevertheless, Reid criticizes Locke for being unable\nto extricate himself from metaphor when Locke claims that in memory,\n“the mind, as it were, paints ideas anew on it self.”\nOn what model does the mind paint the idea anew? In order to use\na previous idea as its model, the mind must remember it. But then\nthe ability to paint ideas anew upon itself presupposes rather than\nexplains memory.\n\n\nLocke offers a non-metaphorical account of memory when he claims\nthat memory consists of two perceptions: a present perception and a\nbelief about that present perception, namely that one has enjoyed the\nperception before. Because Locke is committed to the thesis that\nnumerically identical ideas cannot be stored over time, the belief must\nbe the belief that one has previously enjoyed a perception\nqualitatively similar to the present perception, rather than\nnumerically identical with it. Reid criticizes this account as\ncircular, once more. A first-personal belief that one’s\npresent perception is qualitatively similar to a perception one had in\nthe past requires remembering having had that previous perception and\nrecalling its quality and character. As before, Locke’s\naccount presupposes rather than explains the phenomenon of memory\n(Essays, 285).\n\n\nReid criticizes Hume’s account of memory for duplicating\nLocke’s mistakes. He quotes from Hume’s Treatise\nof Human Nature:\n\n\nWe find by experience, that when any impression has been present\nwith the mind, it again makes its appearance there as an idea; and this\nit may do after two different ways: Either when in its new appearance\nit retains a considerable degree of its first vivacity, and is somewhat\nintermediate betwixt an impression and an idea; or when it entirely\nloses that vivacity, and is a perfect idea. The faculty by which\nwe repeat our impressions in the first manner, is call’d the\nMEMORY, and the other the IMAGINATION (Hume, Treatise,\n1.1.3.1).\n\n\nLike Locke, Hume holds that ideas have no continued existence.\nAnd so, Reid argues, Hume cannot claim that a numerically identical\nidea can reappear. In addition, Hume’s account faces the\nsame circularity objection as Locke’s. Hume accounts for\nmemory by appealing to an idea that is qualitatively similar to, but\nless forceful and vivacious than a previous idea. But the ability\nto judge qualitative similarity and degrees of force and vivacity\nbetween present ideas and past impressions presupposes memory.\n\n\nReid provides additional criticisms of Hume’s account of\nmemory. First, Reid interprets Hume’s account of memory as\ncommitting him to the position that we have the power to repeat ideas\n(though notice that Hume does not commit to this in the quoted\npassage). Reid argues that this position is inconsistent with\nHume’s claim that impressions are the efficient causes of\nideas. Reid’s second criticism is more insightful; he\nargues that differences in degrees of force and vivacity are\ninsufficient to sustain the distinctions between perception, memory and\nimagination. Reid interprets Hume as holding that these three\nfaculties do not differ in kind, but rather in the degree of force and\nvivacity of the ideas that are their objects. Ideas with the\ngreatest degree of force and vivacity are perceptions, those with a\nlesser degree are memories, and those with the least degree of force\nand vivacity are imaginings. Reid criticizes this taxonomy on\nphenomenological grounds. Some perceptions are less forceful and\nlively than some memories, as when lost in reminiscence, and some\nmemories are less forceful and lively than imaginings, as when lost in\nreverie. Furthermore, increasing the degree of force and vivacity\ndoes not transform a memory or an imagining into a perception.\nReid compares striking one’s head against the wall to lightly\ntouching it to the wall. The latter has much less force and\nvivacity than the former, yet lightly touching one’s head to the\nwall is neither a memory nor an imagining (Essays, 289).\n\n\nReid grants that perceptions, memories and imaginings often differ in\ndegree of force and vivacity, but, he argues, this difference is\ninsufficient to account for the special quality of presentness\nrepresented in perceptions, the special quality of pastness\nrepresented in memories, and the special quality of atemporality\nrepresented in imaginings (Inquiry, 197). While memories may\nbe faint, or weak, these features are not necessary to these states\nbeing memories, and so cannot be used to individuate them. In\naddition, a present idea—whatever its degree of force and\nvivacity—cannot ground judgments about events in the past\nbecause present ideas represent events as present.\n\n\nFor according to that theory, the immediate object of memory, as\nwell as every other operation of the understanding, is an idea present\nto the mind. And, from the present existence of this idea of\nmemory I am led to infer, by reasoning, that six months ago or six\nyears ago, there did exist an object similar to this one…But\nwhat is there in the idea that can lead me to this conclusion?\nWhat mark does it bear of the date of its archetype?\n(Essays, 476)\n\n\nPresent ideas contain no information, qualitatively or\nrepresentationally, that could serve as the basis of judgments about\npast events. As a result, no reflection on present ideas and\ntheir quality or character is sufficient for a representation of events\nin the past, as past.\n",
    "section_title": "1. Criticizing the Storehouse Model of Memory",
    "entry_title": "Reid on Memory and Personal Identity",
    "hierarchy_title": "Reid on Memory and Personal Identity || Criticizing the Storehouse Model of Memory",
    "tokenized_text": [
        "criticizing",
        "storehouse",
        "model",
        "memory",
        "criticizing",
        "storehouse",
        "model",
        "memory",
        "reid",
        "trace",
        "target",
        "criticism",
        "back",
        "ancient",
        "depicts",
        "holding",
        "mind",
        "sensoriuma",
        "repository",
        "past",
        "idea",
        "impression",
        "essay",
        "theory",
        "perception",
        "memory",
        "imagination",
        "causal",
        "process",
        "beginning",
        "purely",
        "physiological",
        "event",
        "impression",
        "brain",
        "physiological",
        "state",
        "taken",
        "mental",
        "correlatessensations",
        "idea",
        "sense",
        "sense",
        "impressionswhich",
        "object",
        "perception",
        "memory",
        "imagination",
        "idea",
        "impression",
        "representation",
        "sense",
        "preserve",
        "represent",
        "information",
        "physiological",
        "correlate",
        "according",
        "reid",
        "view",
        "recognizes",
        "distinction",
        "imagination",
        "memory",
        "consists",
        "picturelike",
        "impression",
        "remains",
        "object",
        "impressed",
        "upon",
        "sens",
        "gone",
        "difference",
        "two",
        "fidelity",
        "imagistic",
        "impression",
        "cause",
        "memory",
        "consists",
        "preservation",
        "image",
        "imprinted",
        "mind",
        "previous",
        "experience",
        "imagination",
        "consists",
        "constructing",
        "image",
        "lack",
        "duplicate",
        "experience",
        "reid",
        "offer",
        "two",
        "criticism",
        "ancient",
        "theory",
        "understands",
        "first",
        "theory",
        "fall",
        "afoul",
        "one",
        "reid",
        "methodological",
        "stricture",
        "namely",
        "theory",
        "must",
        "adhere",
        "newton",
        "regulae",
        "philosophandi",
        "rule",
        "philosophizing",
        "inquiry",
        "first",
        "rule",
        "posit",
        "merely",
        "theoretical",
        "cause",
        "reid",
        "view",
        "second",
        "rule",
        "forbids",
        "positing",
        "cause",
        "insufficient",
        "explain",
        "phenomenon",
        "question",
        "according",
        "reid",
        "observational",
        "evidence",
        "existence",
        "impression",
        "brainthey",
        "merely",
        "theoretical",
        "entity",
        "essay",
        "furthermore",
        "even",
        "granted",
        "otherwise",
        "theoretical",
        "existence",
        "impression",
        "entity",
        "would",
        "sufficient",
        "explain",
        "memory",
        "might",
        "establish",
        "correlation",
        "impression",
        "memory",
        "would",
        "remain",
        "best",
        "correlation",
        "causal",
        "explanation",
        "learned",
        "hume",
        "lesson",
        "causation",
        "reid",
        "denies",
        "necessary",
        "connection",
        "impression",
        "memory",
        "sufficient",
        "regard",
        "former",
        "cause",
        "latter",
        "reid",
        "also",
        "considers",
        "whether",
        "resemblance",
        "could",
        "ground",
        "causal",
        "explanation",
        "learned",
        "berkeley",
        "lesson",
        "resemblance",
        "denies",
        "mental",
        "state",
        "resemble",
        "material",
        "state",
        "impression",
        "brain",
        "reid",
        "second",
        "criticism",
        "even",
        "grant",
        "impression",
        "remain",
        "object",
        "impressed",
        "upon",
        "sens",
        "gone",
        "would",
        "entail",
        "continue",
        "perceive",
        "object",
        "rather",
        "remember",
        "since",
        "ancient",
        "theory",
        "impression",
        "immediate",
        "cause",
        "object",
        "perception",
        "essay",
        "though",
        "reid",
        "identifies",
        "target",
        "ancient",
        "origin",
        "primary",
        "concern",
        "regard",
        "modern",
        "equivalent",
        "modern",
        "theory",
        "introduced",
        "locke",
        "according",
        "reid",
        "extended",
        "inevitable",
        "idealist",
        "skeptical",
        "conclusion",
        "berkeley",
        "hume",
        "reid",
        "excerpt",
        "passage",
        "locke",
        "essay",
        "concerning",
        "human",
        "understanding",
        "illustrate",
        "misleading",
        "metaphor",
        "locke",
        "inherits",
        "ancient",
        "theorymetaphors",
        "mind",
        "storehouse",
        "idea",
        "impression",
        "picture",
        "way",
        "retention",
        "power",
        "revive",
        "mind",
        "idea",
        "imprinting",
        "disappeared",
        "laid",
        "aside",
        "sightthis",
        "memory",
        "storehouse",
        "ideasbut",
        "idea",
        "nothing",
        "actual",
        "perception",
        "mind",
        "cease",
        "thing",
        "perception",
        "laying",
        "idea",
        "repository",
        "memory",
        "signifies",
        "mind",
        "power",
        "many",
        "case",
        "revive",
        "perception",
        "additional",
        "perception",
        "annexed",
        "sense",
        "idea",
        "said",
        "memory",
        "indeed",
        "actually",
        "ability",
        "mind",
        "revive",
        "paint",
        "anew",
        "self",
        "though",
        "le",
        "difficulty",
        "lively",
        "others",
        "obscurely",
        "locke",
        "essay",
        "book",
        "iix",
        "passage",
        "illustrates",
        "locke",
        "acknowledges",
        "notion",
        "mind",
        "kind",
        "repository",
        "storehouse",
        "metaphorical",
        "according",
        "locke",
        "theory",
        "idea",
        "impression",
        "stored",
        "locke",
        "committed",
        "thesis",
        "idea",
        "momentary",
        "noncontinuous",
        "thesis",
        "identity",
        "time",
        "requires",
        "continuous",
        "existence",
        "two",
        "thesis",
        "jointly",
        "entail",
        "numerically",
        "identical",
        "idea",
        "stored",
        "time",
        "nevertheless",
        "reid",
        "criticizes",
        "locke",
        "unable",
        "extricate",
        "metaphor",
        "locke",
        "claim",
        "memory",
        "mind",
        "paint",
        "idea",
        "anew",
        "self",
        "model",
        "mind",
        "paint",
        "idea",
        "anew",
        "order",
        "use",
        "previous",
        "idea",
        "model",
        "mind",
        "must",
        "remember",
        "ability",
        "paint",
        "idea",
        "anew",
        "upon",
        "presupposes",
        "rather",
        "explains",
        "memory",
        "locke",
        "offer",
        "nonmetaphorical",
        "account",
        "memory",
        "claim",
        "memory",
        "consists",
        "two",
        "perception",
        "present",
        "perception",
        "belief",
        "present",
        "perception",
        "namely",
        "one",
        "enjoyed",
        "perception",
        "locke",
        "committed",
        "thesis",
        "numerically",
        "identical",
        "idea",
        "stored",
        "time",
        "belief",
        "must",
        "belief",
        "one",
        "previously",
        "enjoyed",
        "perception",
        "qualitatively",
        "similar",
        "present",
        "perception",
        "rather",
        "numerically",
        "identical",
        "reid",
        "criticizes",
        "account",
        "circular",
        "firstpersonal",
        "belief",
        "one",
        "present",
        "perception",
        "qualitatively",
        "similar",
        "perception",
        "one",
        "past",
        "requires",
        "remembering",
        "previous",
        "perception",
        "recalling",
        "quality",
        "character",
        "locke",
        "account",
        "presupposes",
        "rather",
        "explains",
        "phenomenon",
        "memory",
        "essay",
        "reid",
        "criticizes",
        "hume",
        "account",
        "memory",
        "duplicating",
        "locke",
        "mistake",
        "quote",
        "hume",
        "treatise",
        "human",
        "nature",
        "find",
        "experience",
        "impression",
        "present",
        "mind",
        "make",
        "appearance",
        "idea",
        "may",
        "two",
        "different",
        "way",
        "either",
        "new",
        "appearance",
        "retains",
        "considerable",
        "degree",
        "first",
        "vivacity",
        "somewhat",
        "intermediate",
        "betwixt",
        "impression",
        "idea",
        "entirely",
        "loses",
        "vivacity",
        "perfect",
        "idea",
        "faculty",
        "repeat",
        "impression",
        "first",
        "manner",
        "call",
        "memory",
        "imagination",
        "hume",
        "treatise",
        "like",
        "locke",
        "hume",
        "hold",
        "idea",
        "continued",
        "existence",
        "reid",
        "argues",
        "hume",
        "claim",
        "numerically",
        "identical",
        "idea",
        "reappear",
        "addition",
        "hume",
        "account",
        "face",
        "circularity",
        "objection",
        "locke",
        "hume",
        "account",
        "memory",
        "appealing",
        "idea",
        "qualitatively",
        "similar",
        "le",
        "forceful",
        "vivacious",
        "previous",
        "idea",
        "ability",
        "judge",
        "qualitative",
        "similarity",
        "degree",
        "force",
        "vivacity",
        "present",
        "idea",
        "past",
        "impression",
        "presupposes",
        "memory",
        "reid",
        "provides",
        "additional",
        "criticism",
        "hume",
        "account",
        "memory",
        "first",
        "reid",
        "interprets",
        "hume",
        "account",
        "memory",
        "committing",
        "position",
        "power",
        "repeat",
        "idea",
        "though",
        "notice",
        "hume",
        "commit",
        "quoted",
        "passage",
        "reid",
        "argues",
        "position",
        "inconsistent",
        "hume",
        "claim",
        "impression",
        "efficient",
        "cause",
        "idea",
        "reid",
        "second",
        "criticism",
        "insightful",
        "argues",
        "difference",
        "degree",
        "force",
        "vivacity",
        "insufficient",
        "sustain",
        "distinction",
        "perception",
        "memory",
        "imagination",
        "reid",
        "interprets",
        "hume",
        "holding",
        "three",
        "faculty",
        "differ",
        "kind",
        "rather",
        "degree",
        "force",
        "vivacity",
        "idea",
        "object",
        "idea",
        "greatest",
        "degree",
        "force",
        "vivacity",
        "perception",
        "lesser",
        "degree",
        "memory",
        "least",
        "degree",
        "force",
        "vivacity",
        "imaginings",
        "reid",
        "criticizes",
        "taxonomy",
        "phenomenological",
        "ground",
        "perception",
        "le",
        "forceful",
        "lively",
        "memory",
        "lost",
        "reminiscence",
        "memory",
        "le",
        "forceful",
        "lively",
        "imaginings",
        "lost",
        "reverie",
        "furthermore",
        "increasing",
        "degree",
        "force",
        "vivacity",
        "transform",
        "memory",
        "imagining",
        "perception",
        "reid",
        "compare",
        "striking",
        "one",
        "head",
        "wall",
        "lightly",
        "touching",
        "wall",
        "latter",
        "much",
        "le",
        "force",
        "vivacity",
        "former",
        "yet",
        "lightly",
        "touching",
        "one",
        "head",
        "wall",
        "neither",
        "memory",
        "imagining",
        "essay",
        "reid",
        "grant",
        "perception",
        "memory",
        "imaginings",
        "often",
        "differ",
        "degree",
        "force",
        "vivacity",
        "argues",
        "difference",
        "insufficient",
        "account",
        "special",
        "quality",
        "presentness",
        "represented",
        "perception",
        "special",
        "quality",
        "pastness",
        "represented",
        "memory",
        "special",
        "quality",
        "atemporality",
        "represented",
        "imaginings",
        "inquiry",
        "memory",
        "may",
        "faint",
        "weak",
        "feature",
        "necessary",
        "state",
        "memory",
        "used",
        "individuate",
        "addition",
        "present",
        "ideawhatever",
        "degree",
        "force",
        "vivacity",
        "ground",
        "judgment",
        "event",
        "past",
        "present",
        "idea",
        "represent",
        "event",
        "present",
        "according",
        "theory",
        "immediate",
        "object",
        "memory",
        "well",
        "every",
        "operation",
        "understanding",
        "idea",
        "present",
        "mind",
        "present",
        "existence",
        "idea",
        "memory",
        "led",
        "infer",
        "reasoning",
        "six",
        "month",
        "ago",
        "six",
        "year",
        "ago",
        "exist",
        "object",
        "similar",
        "onebut",
        "idea",
        "lead",
        "conclusion",
        "mark",
        "bear",
        "date",
        "archetype",
        "essay",
        "present",
        "idea",
        "contain",
        "information",
        "qualitatively",
        "representationally",
        "could",
        "serve",
        "basis",
        "judgment",
        "past",
        "event",
        "result",
        "reflection",
        "present",
        "idea",
        "quality",
        "character",
        "sufficient",
        "representation",
        "event",
        "past",
        "past"
    ]
}