{
    "main_text": "Causation and Free Will || Power, Exertion and Moral Liberty\n4.2 Power, Exertion and Moral Liberty\n\n\nReid is clear that power is not the sort of thing that admits\nof a logical definition. We cannot reduce it to some set of simpler\nqualities. However, this doesn't mean that we can't say anything about\nwhat power is. On the contrary, Reid makes a variety of claims about\npower. Importantly, he claims that power is the quality that, when\ncoupled with exertion, necessitates a particular effect. Taking a cue\nfrom ordinary language, he holds that it is a contradiction to say\nthat an entity has the power to do something, and exerts that power,\nand yet the effect fails to come about. If the effect fails to come\nabout when the entity exerts itself, we might say, what that shows is\nthat the entity only seemed, but didn't actually, have the power to\nbring about the effect. Reid also claims that any agent who has the\npower to do something also has three other inter-related powers: the\npower not to do the thing, the power to try to do that thing\n(that is, the power to exert his power to do the thing), and the\npower not to try to do that thing. He claims further that any\nagent who has the power to do something must believe himself to have\nthat power.\n\n \nAny one of these claims can be questioned, even if Reid is right that\nthey are embedded in our ordinary concept of power. Take, for\ninstance, the claim that an agent who has the power to do something\nalso has the power not to do it. Locke offers the following example,\nwhich seems to be a counterexample to this claim:\n[S]uppose a Man be carried, whilst fast asleep, into a\nRoom, where is a Person he longs to see and speak with; and be there\nlocked fast in, beyond his Power to get out: he awakes, and is glad to\nfind himself in so desirable Company, which he stays willingly\nin, i.e. prefers his stay to going away. I ask, Is not this\nstay voluntary? I think, no Body will doubt it: and yet being locked\nfast in, 'tis evident he is not at liberty not to stay, he has not\nfreedom to be gone. (John Locke, Essay Concerning Human\nUnderstanding, 2.21.10)\n\n\nThe man in Locke's example seems to have the power to stay in the\nroom, while lacking the power not to stay. Reid would probably deny\nthat Locke's prisoner actually has the power to stay in the room, and\nthere is some intuitive force to this view. The man, it seems, is in\nthe hands of forces outside of his control. For Reid, what is in a\nperson's power and what is ‘up to’ him or her are the same. Since it\nis not up to the man whether he stays (even if he thinks it is), it is\nnot in his power to stay.\n\n\nReid endorses the idea that what is in our power is just what is up to\nus. He claims that the only entities that can have power are entities\nwith minds. That is, sticks and stones are never invested with power,\nand are not, therefore, ever the efficient causes of any events. The\nearthquake might be the physical cause of the fall of the city, but it\nis not the efficient cause, Reid thinks, because it does not have a\nmind. Since it is not up to the earthquake whether or not the city\nfalls, the earthquake lacks the power to raze the city. Reid offers\nvarious reasons for thinking that wherever there is power there is a\nmind. One of the most compelling is expressed in the following\npassage:\n[I]f we had not will, and that degree of understanding\nwhich will necessarily implies, we could exert no active power, and\nconsequently could have none: for power that cannot be exerted is no\npower. It follows also, that the active power, of which only we can\nhave any distinct conception, can be only in beings that have\nunderstanding and will. (EAP 1.5, 29)\n\n\nReid's idea is that the only conception we can have of the exertion of\npower is of that distinctive sort of mental effort in which we engage\nwhen we will to do something. Since he holds that the power to act is\nalways accompanied with the power to exert that power, it follows that\nthe only entities that can have power are those who are capable of\nengaging in the peculiar sort of mental effort with which we are all\nfamiliar from our own case. But then it follows that the only entities\nthat can have power are those with minds. When coupled with the claim,\nthat Reid also makes, that every event is efficiently caused, it\nfollows that every event in nature is directed towards an end;\neverything that happens is chosen to occur. In fact, Reid holds that\nall and only our free actions are those events of which we are the\nefficient causes. An agent who has the power to bring about a\nparticular action is said, by Reid, to have ‘moral liberty’.\n\n\nThere is a puzzle that one encounters when trying to make sense of\nReid's notion of power and which sheds some light on Reid's concept of\nmoral liberty. The puzzle is this: Say that I have the power to do a\ncartwheel. According to Reid it follows that if I exert my power and\nthereby do a cartwheel, then I will be the efficient cause of my\ncartwheel. Imagine that I do this and imagine that every event is\nefficiently caused. Is my exertion of my power to do the cartwheel an\nevent? If so, then it must have an efficient cause. Am I the efficient\ncause of the exertion? If not, then it doesn't seem that my cartwheel\nis a free action. After all, if I'm not the efficient cause of the\nexertion, then it wasn't up to me whether or not I tried to do the\ncartwheel, and it seems to follow that it wasn't up to me whether or\nnot I did it. So, Reid seems forced to say that I am the efficient\ncause of the exertion to do the cartwheel. But then it follows from\nthe definition of efficient causation that I exerted my power to exert\nmyself to do the cartwheel. And, therefore, we can ask if I am the\nefficient cause of my exertion to exert myself to do the cartwheel. If\nnot, then I didn't do the cartwheel freely; if so, then we will find\nourselves having to ask about the efficient cause of the exertion to\nexert my power to exert. In short, Reid's views of power, efficient\ncausation and moral liberty appear to be inconsistent with one\nanother.\n\n\nThe way out of the puzzle is to see that the relation between an agent\nand the event he or she efficiently causes is not the same as the\nrelation between the agent and her exertion of power. Trying, on this\nview, is not something that an agent does in order to do something\nelse; it is not a separate action on the way to performing another\nact. If I am going to build a birdhouse, I first have to buy\nnails. Buying nails is a distinct act from building the birdhouse that\nmust be done on the way to building the birdhouse. But trying\nto buy the nails is not distinct from buying them in the way that\nbuying them is distinct from building the birdhouse. If I manage to\nbuy the nails, I haven't done two things, buy them and try to, but\nonly one. But if I manage to build the birdhouse, then I did do two\nthings: buy the nails, and build the birdhouse. So, there is something\nwrongheaded about even asking whether the agent is the efficient cause\nof the exertion of power. The agent is the efficient cause of the act,\nand there is no separate act, the exertion, of which he or she needs\nto be the efficient cause in order to have acted freely.\n\n\nIt is on the basis of this, or some other closely related line of\nthought, that Reid is often described as having an ‘agent causal’\ntheory of freedom. Agent-causation is the kind of causation that\noccurs when an object or agent, rather than an event, causes a\nchange. Many people believe that there is no agent-causation. They\nhold that there are only causal relations between events, and every\ncase of apparent agent-causation is merely apparent; every such case\nis actually a veiled case of event-causation. Philosophers who hold\nthat free human actions require that certain events be agent-caused,\nand also believe that some human actions are free, hold that there are\nsome events that are caused by agents but not by any events; they hold\nthat there is a basic causal relation between agents and events that\nis instantiated every time a person acts freely. Given that, for Reid,\nthe relation between an agent and the action of which the agent is the\nefficient cause must be a basic causal relation—it does not\nconsist, not even in part, in some further distinct relation between\nthe agent and the exertion of power—it follows that Reid holds\nan agent-causal view of free action.\n",
    "section_title": "4.2 Power, Exertion and Moral Liberty",
    "entry_title": "Thomas Reid",
    "hierarchy_title": "Thomas Reid || Causation and Free Will || Power, Exertion and Moral Liberty",
    "tokenized_text": [
        "causation",
        "free",
        "power",
        "exertion",
        "moral",
        "liberty",
        "power",
        "exertion",
        "moral",
        "liberty",
        "reid",
        "clear",
        "power",
        "sort",
        "thing",
        "admits",
        "logical",
        "definition",
        "reduce",
        "set",
        "simpler",
        "quality",
        "however",
        "nt",
        "mean",
        "ca",
        "nt",
        "say",
        "anything",
        "power",
        "contrary",
        "reid",
        "make",
        "variety",
        "claim",
        "power",
        "importantly",
        "claim",
        "power",
        "quality",
        "coupled",
        "exertion",
        "necessitates",
        "particular",
        "effect",
        "taking",
        "cue",
        "ordinary",
        "language",
        "hold",
        "contradiction",
        "say",
        "entity",
        "power",
        "something",
        "exerts",
        "power",
        "yet",
        "effect",
        "fails",
        "come",
        "effect",
        "fails",
        "come",
        "entity",
        "exerts",
        "might",
        "say",
        "show",
        "entity",
        "seemed",
        "nt",
        "actually",
        "power",
        "bring",
        "effect",
        "reid",
        "also",
        "claim",
        "agent",
        "power",
        "something",
        "also",
        "three",
        "interrelated",
        "power",
        "power",
        "thing",
        "power",
        "try",
        "thing",
        "power",
        "exert",
        "power",
        "thing",
        "power",
        "try",
        "thing",
        "claim",
        "agent",
        "power",
        "something",
        "must",
        "believe",
        "power",
        "one",
        "claim",
        "questioned",
        "even",
        "reid",
        "right",
        "embedded",
        "ordinary",
        "concept",
        "power",
        "take",
        "instance",
        "claim",
        "agent",
        "power",
        "something",
        "also",
        "power",
        "locke",
        "offer",
        "following",
        "example",
        "seems",
        "counterexample",
        "claim",
        "uppose",
        "man",
        "carried",
        "whilst",
        "fast",
        "asleep",
        "room",
        "person",
        "longs",
        "see",
        "speak",
        "locked",
        "fast",
        "beyond",
        "power",
        "get",
        "awakes",
        "glad",
        "find",
        "desirable",
        "company",
        "stay",
        "willingly",
        "ie",
        "prefers",
        "stay",
        "going",
        "away",
        "ask",
        "stay",
        "voluntary",
        "think",
        "body",
        "doubt",
        "yet",
        "locked",
        "fast",
        "t",
        "evident",
        "liberty",
        "stay",
        "freedom",
        "gone",
        "john",
        "locke",
        "essay",
        "concerning",
        "human",
        "understanding",
        "man",
        "locke",
        "s",
        "example",
        "seems",
        "power",
        "stay",
        "room",
        "lacking",
        "power",
        "stay",
        "reid",
        "would",
        "probably",
        "deny",
        "locke",
        "s",
        "prisoner",
        "actually",
        "power",
        "stay",
        "room",
        "intuitive",
        "force",
        "view",
        "man",
        "seems",
        "hand",
        "force",
        "outside",
        "control",
        "reid",
        "person",
        "s",
        "power",
        "since",
        "man",
        "whether",
        "stay",
        "even",
        "think",
        "power",
        "stay",
        "reid",
        "endorses",
        "idea",
        "power",
        "u",
        "claim",
        "entity",
        "power",
        "entity",
        "mind",
        "stick",
        "stone",
        "never",
        "invested",
        "power",
        "therefore",
        "ever",
        "efficient",
        "cause",
        "event",
        "earthquake",
        "might",
        "physical",
        "cause",
        "fall",
        "city",
        "efficient",
        "cause",
        "reid",
        "think",
        "mind",
        "since",
        "earthquake",
        "whether",
        "city",
        "fall",
        "earthquake",
        "lack",
        "power",
        "raze",
        "city",
        "reid",
        "offer",
        "various",
        "reason",
        "thinking",
        "wherever",
        "power",
        "mind",
        "one",
        "compelling",
        "expressed",
        "following",
        "passage",
        "f",
        "degree",
        "understanding",
        "necessarily",
        "implies",
        "could",
        "exert",
        "active",
        "power",
        "consequently",
        "could",
        "none",
        "power",
        "exerted",
        "power",
        "follows",
        "also",
        "active",
        "power",
        "distinct",
        "conception",
        "being",
        "understanding",
        "eap",
        "reid",
        "s",
        "idea",
        "conception",
        "exertion",
        "power",
        "distinctive",
        "sort",
        "mental",
        "effort",
        "engage",
        "something",
        "since",
        "hold",
        "power",
        "act",
        "always",
        "accompanied",
        "power",
        "exert",
        "power",
        "follows",
        "entity",
        "power",
        "capable",
        "engaging",
        "peculiar",
        "sort",
        "mental",
        "effort",
        "familiar",
        "case",
        "follows",
        "entity",
        "power",
        "mind",
        "coupled",
        "claim",
        "reid",
        "also",
        "make",
        "every",
        "event",
        "efficiently",
        "caused",
        "follows",
        "every",
        "event",
        "nature",
        "directed",
        "towards",
        "end",
        "everything",
        "happens",
        "chosen",
        "occur",
        "fact",
        "reid",
        "hold",
        "free",
        "action",
        "event",
        "efficient",
        "cause",
        "agent",
        "power",
        "bring",
        "particular",
        "action",
        "said",
        "reid",
        "moral",
        "liberty",
        "puzzle",
        "one",
        "encounter",
        "trying",
        "make",
        "sense",
        "reid",
        "s",
        "notion",
        "power",
        "shed",
        "light",
        "reid",
        "s",
        "concept",
        "moral",
        "liberty",
        "puzzle",
        "say",
        "power",
        "cartwheel",
        "according",
        "reid",
        "follows",
        "exert",
        "power",
        "thereby",
        "cartwheel",
        "efficient",
        "cause",
        "cartwheel",
        "imagine",
        "imagine",
        "every",
        "event",
        "efficiently",
        "caused",
        "exertion",
        "power",
        "cartwheel",
        "event",
        "must",
        "efficient",
        "cause",
        "efficient",
        "cause",
        "exertion",
        "nt",
        "seem",
        "cartwheel",
        "free",
        "action",
        "m",
        "efficient",
        "cause",
        "exertion",
        "nt",
        "whether",
        "tried",
        "cartwheel",
        "seems",
        "follow",
        "nt",
        "whether",
        "reid",
        "seems",
        "forced",
        "say",
        "efficient",
        "cause",
        "exertion",
        "cartwheel",
        "follows",
        "definition",
        "efficient",
        "causation",
        "exerted",
        "power",
        "exert",
        "cartwheel",
        "therefore",
        "ask",
        "efficient",
        "cause",
        "exertion",
        "exert",
        "cartwheel",
        "nt",
        "cartwheel",
        "freely",
        "find",
        "ask",
        "efficient",
        "cause",
        "exertion",
        "exert",
        "power",
        "exert",
        "short",
        "reid",
        "s",
        "view",
        "power",
        "efficient",
        "causation",
        "moral",
        "liberty",
        "appear",
        "inconsistent",
        "one",
        "another",
        "way",
        "puzzle",
        "see",
        "relation",
        "agent",
        "event",
        "efficiently",
        "cause",
        "relation",
        "agent",
        "exertion",
        "power",
        "trying",
        "view",
        "something",
        "agent",
        "order",
        "something",
        "else",
        "separate",
        "action",
        "way",
        "performing",
        "another",
        "act",
        "going",
        "build",
        "birdhouse",
        "first",
        "buy",
        "nail",
        "buying",
        "nail",
        "distinct",
        "act",
        "building",
        "birdhouse",
        "must",
        "done",
        "way",
        "building",
        "birdhouse",
        "trying",
        "buy",
        "nail",
        "distinct",
        "buying",
        "way",
        "buying",
        "distinct",
        "building",
        "birdhouse",
        "manage",
        "buy",
        "nail",
        "nt",
        "done",
        "two",
        "thing",
        "buy",
        "try",
        "one",
        "manage",
        "build",
        "birdhouse",
        "two",
        "thing",
        "buy",
        "nail",
        "build",
        "birdhouse",
        "something",
        "wrongheaded",
        "even",
        "asking",
        "whether",
        "agent",
        "efficient",
        "cause",
        "exertion",
        "power",
        "agent",
        "efficient",
        "cause",
        "act",
        "separate",
        "act",
        "exertion",
        "need",
        "efficient",
        "cause",
        "order",
        "acted",
        "freely",
        "basis",
        "closely",
        "related",
        "line",
        "thought",
        "reid",
        "often",
        "described",
        "agent",
        "causal",
        "theory",
        "freedom",
        "agentcausation",
        "kind",
        "causation",
        "occurs",
        "object",
        "agent",
        "rather",
        "event",
        "cause",
        "change",
        "many",
        "people",
        "believe",
        "agentcausation",
        "hold",
        "causal",
        "relation",
        "event",
        "every",
        "case",
        "apparent",
        "agentcausation",
        "merely",
        "apparent",
        "every",
        "case",
        "actually",
        "veiled",
        "case",
        "eventcausation",
        "philosopher",
        "hold",
        "free",
        "human",
        "action",
        "require",
        "certain",
        "event",
        "agentcaused",
        "also",
        "believe",
        "human",
        "action",
        "free",
        "hold",
        "event",
        "caused",
        "agent",
        "event",
        "hold",
        "basic",
        "causal",
        "relation",
        "agent",
        "event",
        "instantiated",
        "every",
        "time",
        "person",
        "act",
        "freely",
        "given",
        "reid",
        "relation",
        "agent",
        "action",
        "agent",
        "efficient",
        "cause",
        "must",
        "basic",
        "causal",
        "relationit",
        "consist",
        "even",
        "part",
        "distinct",
        "relation",
        "agent",
        "exertion",
        "powerit",
        "follows",
        "reid",
        "hold",
        "agentcausal",
        "view",
        "free",
        "action"
    ]
}