{
    "main_text": "Objecting to Locke on Personal Identity\n3. Objecting to Locke on Personal Identity\n\n\nReid, Locke and others are interested in the notion of episodic memory\nnot only for its own sake, but also because of its conceptual\nconnection to the notion of personal identity. If Joe remembers,\nepisodically, winning the World Series, then Joe must have existed at\nthe time of his winning the World Series. This is why the Previous\nAwareness Condition characterizes episodic but not semantic\nmemory. Unlike Joe’s memory that Napoleon was defeated at Waterloo,\nhis memory of winning the World Series logically entails Joe’s\nexistence at the time of the event remembered. In other words,\nepisodic memory is logically sufficient for personal identity: if\nS remembers at time tn\n(episodically) an event at time t1, then\nS existed at time t1. In addition, memory\nreports are often taken to be prima facie evidence for\nstatements about the past history of the person reporting.\n\n\nReid’s main criticism of Locke’s theory of personal identity is that\nLocke moves from these truisms concerning the conceptual and\nevidential relations among the notions of memory and personal identity\nto a hypothesis concerning the metaphysical relations among them\n(Essays, 277). In this, Reid follows Butler’s influential\ndissertation “Of Personal Identity,” appended to The\nAnalogy of Religion in 1736.\n\n\nReid interprets\nLocke as holding what is now called the Memory Theory of personal\nidentity (Essays, 277). On this theory, personal\nidentity consists in memory; sameness of episodic memory is\nmetaphysically necessary and sufficient for sameness of persons.\nIn other words, on the Memory Theory, what makes a person\nidentical with herself over time is her remembering or being able to\nremember the events to which she was witness or agent. If she\ncannot episodically remember an event, then she is not identical with\nany of the persons who was witness or agent to the event. In such\na case, she would bear the same relation to that event as any other\nperson for whom a memory of the event could rise at best to the level\nof a semantic memory. If she can episodically remember an event,\nthen her recollection or ability to recall that event makes her\nidentical with the person represented in that memory as agent or\nwitness to the event.\n\n\nBut there is a secondary, more subtle line of disagreement between\nReid and Locke. Much of Locke’s chapter Identity and\nDiversity is dedicated to establishing that the self is not a\nsubstance, material or immaterial. By contrast, Reid holds that\nthe self is a simple, unanalyzable immaterial substance with active\npowers. Reid argues that Locke cannot sustain both the thesis\nthat the self is not a substance and the thesis that self remains\nidentical over time. While Reid’s criticisms of the Memory\nTheory are more well known, his criticism of Locke’s insistence\nthat the self is not a substance reveals two very different accounts of\nthe metaphysics of identity. While Locke argues that the identity\nconditions for different kinds of things differ, so that the conditions\nunder which a mass of matter, and an animal, and a person are not the\nsame, Reid holds that identity is confined solely to substances that\nhave a continued, uninterrupted existence and which do not have\nparts. In other words, according to Reid, strictly speaking the\nonly real identity is personal identity (Essays,\n266–267). “The identity…we ascribe to bodies,\nwhether natural or artificial, is not perfect identity; it is rather\nsomething which, for the conveniency of speech, we call identity”\n(Essays, 266).\n\n\nReid begins his interpretation and criticism of Locke’s theory\nby noting that Locke defines the term ‘person’ as meaning\n“a thinking intelligent Being, that has reason and\nreflection…” (Locke Essay, Book\nII.xxvii.9). Reid is friendly to this characterization of the\nself. But, Reid notes, Locke appears to equivocate between the\nnotion of a person as a ‘thinking Being,’ and the notion of\na person as that which is preserved through consciousness and\nmemory. Reid paraphrases a passage from Locke’s Essay\nConcerning Human Understanding:\n\n\nMr LOCKE tells us however, “that personal identity, that is, the\nsameness of a rational being, consists in consciousness alone, as, as\nfar as this consciousness can be extended backwards to any past action\nor thought, so far reaches the identity of that person. So that\nwhatever hath the consciousness of present and past actions, is the\nsame person to whom they belong” (Essays\n275–276).\n\n\nThe passage in Locke differs from Reid’s paraphrase:\n\n\n…personal Identity, i.e. the sameness of a\nrational Being: And as far as this consciousness can be extended\nbackwards to any past Action or Thought, so far reaches the Identity of\nthat Person; it is the same self now it was then; and\n‘tis by the same self with this present one that now\nreflects on it, that that Action was done (Locke, Essay, Book\nII.xxvii.9).\n\n\nReid’s first criticism rests on his interpreting Locke’s\ndefinition as committing him to the position that a person is a subject\nof thought, which Reid regards as implying that a person is a thinking\nsubstance. At the same time, Locke appears to be committed to an\nanalysis of personal identity in terms of memory, or, as Locke would\nput it, consciousness of the past. Reid notes that Locke is aware\nof some of the consequences of the Memory Theory: if sameness of\nconsciousness or memory is necessary and sufficient for sameness of\nperson, then it is possible for there to be sameness of person without\nsameness of thinking Being. In other words, it is logically and\nmetaphysically possible for a person to be “transferred from one\nintelligent being to another,” or for “two or twenty\nintelligent beings to be the same person” (Essays,\n276). Locke’s response to these worries, as well as worries\nabout periods of interrupted consciousness, as in sleep, highlights\nReid’s criticism: “…[I]n all these\ncases…doubts are raised whether we are the same thinking thing;\ni.e. the same substance or no. Which however reasonable,\nor unreasonable, concerns not personal Identity at all.\nThe Question being what makes the same Person, and not whether\nit be the same Identical Substance…” (Locke,\nEssay, Book II.xxvii.10). Reid’s criticism is not\nthat cases of transfer or fission are incoherent, though he thinks they\nare. Rather, his criticism is that the possibility of sameness of\nperson without sameness of thinking Being that the Memory Theory allows is\ninconsistent with Locke’s characterization of a person as a\n‘thinking Being’. Given that Reid thinks that this\ninitial characterization is correct, he regards this as a\nreductio of the Memory Theory.\n\n\nReid’s second criticism is his most famous and is often\nreferred to as the case of the Brave Officer:\n\n\nSuppose a brave officer to have been flogged when a boy at school,\nfor robbing an orchard, to have taken a standard from the enemy in his\nfirst campaign, and to have been made a general in advanced life:\nSuppose also, which must be admitted to be possible, that when he took\nthe standard, he was conscious of his having been flogged at school,\nand that when made a general he was conscious of his taking the\nstandard, but had absolutely lost the consciousness of his\nflogging.\n\n\nThese things being supposed, it follows, from Mr LOCKE’s\ndoctrine, that he who was flogged at school is the same person who took\nthe standard, and that he who took the standard is the same person who\nwas made a general. When it follows, if there be any truth in\nlogic, that the general is the same person with him who was flogged at\nschool. But the general’s consciousness does not reach so\nfar back as his flogging, therefore, according to Mr LOCKE’s\ndoctrine, he is not the person who was flogged. Therefore the\ngeneral is, and at the same time is not the same person as him who was\nflogged at school (Essays, 276).\n\n\nAccording to the Memory Theory, personal identity consists in\nmemory; that is, sameness of memory is metaphysically necessary and\nsufficient for sameness of person. On this account, given that\nsameness of memory is sufficient for sameness of person, if a person\nat time tn remembers (episodically) an\nevent that occurred at time t1 then the person at\ntime tn is identical with the person who\nwas witness or agent to the event at time t1. If\nthe brave officer who has just taken the flag of the enemy remembers\nbeing beaten at school, then the brave officer is identical with the\nboy who was beaten. So too, if the general remembers taking the\nenemy’s flag, then the general is identical with the brave officer. If\nthe general is identical with the brave officer, and the brave officer\nis identical with the boy, then by the transitivity of identity, the\ngeneral is identical with the boy.\n\n\nHowever, on this account, given that sameness of memory is a necessary\ncondition for sameness of person, if a person at time\ntn does not remember (episodically) an\nevent that occurred at time t1, then the person at\ntime tn cannot be identical with any\nperson who was witness or agent to the event at time\nt1. If the general cannot remember being beaten at\nschool, he cannot be identical with the boy who was beaten. Thus, the\nMemory Theory is committed to mutually incompatible theses: that the\nGeneral is identical with the boy and that he is not.\n\n\nReid’s third criticism is terminological: he argues that Locke\nconfounds consciousness with memory—elsewhere Reid also argues\nthat Locke confounds consciousness with reflection (Essays,\n58). Consciousness and memory are distinct phenomena, according\nto Reid. The former is directed towards present mental acts and\noperations, while the latter is directed towards past events to which\none was agent or witness. If consciousness could extend to past\nevents, then memory would be redundant (Essays, 277).\n\n\nAccording to Reid, memory is neither necessary nor sufficient for\npersonal identity, metaphysically speaking, despite the conceptual and\nevidential relations memory bears to personal identity. It is not a\nnecessary condition because each us has been agent or witness to many\nevents that we do not now remember. “I may have other good\nevidence of things which befell me, and which I do not remember: I\nknow who bare me, and suckled me, but I do not remember these\nevents” (Essays, 264). It is not a sufficient\ncondition, for, as Butler showed, while having an episodic memory of\nan event entails that one existed at the time of the event remembered,\nit is not the recollection or the ability to recall that\nmakes one identical with the person who was witness or agent\nto the event.  “It may here be observed…that it is not my\nremembering any action of mine that makes be to be the person who did\nit. This remembrance makes me know assuredly that I did it; but I\nmight have done it, though I did not remember it”\n(Essays, 265). Reid’s fourth criticism is that while memory\nis tied to personal identity conceptually and evidentially, such ties\ndo not entail a metaphysical connection that would license analyzing\nthe latter in terms of the former (Essays, 277).\n\n\nReid’s final criticism is that the Memory Theory is committed to the\nabsurdity that identity consists in something that has no continued\nexistence (Essays, 278). Reid and Locke agree that memory,\nconsciousness, thought, and other mental operations have no continued\nexistence. They are fleeting and non-continuous. But they also agree\nthat identity, and in particular personal identity, requires a\ncontinued existence over time. As Locke puts it, “one thing\ncannot have two beginnings of Existence, nor two things one\nbeginning” (Locke, Essay, Book II.xxvii.1). But these\ncommitments are jointly inconsistent with the thesis that personal\nidentity consists in memory.\n\n\nA theory of personal identity is intended to account for how a\nperson remains identical over time. When analyzed in terms of\nitems that are fleeting and non-continuous—ideas, memories,\nthoughts—identity is reduced to diversity; that is, it is\neliminated. By contrast, if one locates personal identity in that\nwhich thinks and remembers, and which has a continued, uninterrupted\nexistence, one purchases personal identity at the cost of admitting\nthat the self is a substance. Reid captures Locke on the horns of\na dilemma: either the self is a substance, in which case it remains\nidentical over time, or the self is not a substance, in which case\nthere is no personal identity. Reid holds that this dilemma\napplies with equal force against any reductionist account of personal\nidentity that employs the theory of ideas, for example Hume’s\nbundle theory of the self (Essays, 473–474).\n",
    "section_title": "3. Objecting to Locke on Personal Identity",
    "entry_title": "Reid on Memory and Personal Identity",
    "hierarchy_title": "Reid on Memory and Personal Identity || Objecting to Locke on Personal Identity",
    "tokenized_text": [
        "objecting",
        "locke",
        "personal",
        "identity",
        "objecting",
        "locke",
        "personal",
        "identity",
        "reid",
        "locke",
        "others",
        "interested",
        "notion",
        "episodic",
        "memory",
        "sake",
        "also",
        "conceptual",
        "connection",
        "notion",
        "personal",
        "identity",
        "joe",
        "remembers",
        "episodically",
        "winning",
        "world",
        "series",
        "joe",
        "must",
        "existed",
        "time",
        "winning",
        "world",
        "series",
        "previous",
        "awareness",
        "condition",
        "characterizes",
        "episodic",
        "semantic",
        "memory",
        "unlike",
        "joe",
        "memory",
        "napoleon",
        "defeated",
        "waterloo",
        "memory",
        "winning",
        "world",
        "series",
        "logically",
        "entail",
        "joe",
        "existence",
        "time",
        "event",
        "remembered",
        "word",
        "episodic",
        "memory",
        "logically",
        "sufficient",
        "personal",
        "identity",
        "remembers",
        "time",
        "tn",
        "episodically",
        "event",
        "time",
        "t",
        "existed",
        "time",
        "t",
        "addition",
        "memory",
        "report",
        "often",
        "taken",
        "prima",
        "facie",
        "evidence",
        "statement",
        "past",
        "history",
        "person",
        "reporting",
        "reid",
        "main",
        "criticism",
        "locke",
        "theory",
        "personal",
        "identity",
        "locke",
        "move",
        "truism",
        "concerning",
        "conceptual",
        "evidential",
        "relation",
        "among",
        "notion",
        "memory",
        "personal",
        "identity",
        "hypothesis",
        "concerning",
        "metaphysical",
        "relation",
        "among",
        "essay",
        "reid",
        "follows",
        "butler",
        "influential",
        "dissertation",
        "personal",
        "identity",
        "appended",
        "analogy",
        "religion",
        "reid",
        "interprets",
        "locke",
        "holding",
        "called",
        "memory",
        "theory",
        "personal",
        "identity",
        "essay",
        "theory",
        "personal",
        "identity",
        "consists",
        "memory",
        "sameness",
        "episodic",
        "memory",
        "metaphysically",
        "necessary",
        "sufficient",
        "sameness",
        "person",
        "word",
        "memory",
        "theory",
        "make",
        "person",
        "identical",
        "time",
        "remembering",
        "able",
        "remember",
        "event",
        "witness",
        "agent",
        "episodically",
        "remember",
        "event",
        "identical",
        "person",
        "witness",
        "agent",
        "event",
        "case",
        "would",
        "bear",
        "relation",
        "event",
        "person",
        "memory",
        "event",
        "could",
        "rise",
        "best",
        "level",
        "semantic",
        "memory",
        "episodically",
        "remember",
        "event",
        "recollection",
        "ability",
        "recall",
        "event",
        "make",
        "identical",
        "person",
        "represented",
        "memory",
        "agent",
        "witness",
        "event",
        "secondary",
        "subtle",
        "line",
        "disagreement",
        "reid",
        "locke",
        "much",
        "locke",
        "chapter",
        "identity",
        "diversity",
        "dedicated",
        "establishing",
        "self",
        "substance",
        "material",
        "immaterial",
        "contrast",
        "reid",
        "hold",
        "self",
        "simple",
        "unanalyzable",
        "immaterial",
        "substance",
        "active",
        "power",
        "reid",
        "argues",
        "locke",
        "sustain",
        "thesis",
        "self",
        "substance",
        "thesis",
        "self",
        "remains",
        "identical",
        "time",
        "reid",
        "criticism",
        "memory",
        "theory",
        "well",
        "known",
        "criticism",
        "locke",
        "insistence",
        "self",
        "substance",
        "reveals",
        "two",
        "different",
        "account",
        "metaphysics",
        "identity",
        "locke",
        "argues",
        "identity",
        "condition",
        "different",
        "kind",
        "thing",
        "differ",
        "condition",
        "mass",
        "matter",
        "animal",
        "person",
        "reid",
        "hold",
        "identity",
        "confined",
        "solely",
        "substance",
        "continued",
        "uninterrupted",
        "existence",
        "part",
        "word",
        "according",
        "reid",
        "strictly",
        "speaking",
        "real",
        "identity",
        "personal",
        "identity",
        "essay",
        "identitywe",
        "ascribe",
        "body",
        "whether",
        "natural",
        "artificial",
        "perfect",
        "identity",
        "rather",
        "something",
        "conveniency",
        "speech",
        "call",
        "identity",
        "essay",
        "reid",
        "begin",
        "interpretation",
        "criticism",
        "locke",
        "theory",
        "noting",
        "locke",
        "defines",
        "term",
        "person",
        "meaning",
        "thinking",
        "intelligent",
        "reason",
        "reflection",
        "locke",
        "essay",
        "book",
        "iixxvii",
        "reid",
        "friendly",
        "characterization",
        "self",
        "reid",
        "note",
        "locke",
        "appears",
        "equivocate",
        "notion",
        "person",
        "thinking",
        "notion",
        "person",
        "preserved",
        "consciousness",
        "memory",
        "reid",
        "paraphrase",
        "passage",
        "locke",
        "essay",
        "concerning",
        "human",
        "understanding",
        "mr",
        "locke",
        "tell",
        "u",
        "however",
        "personal",
        "identity",
        "sameness",
        "rational",
        "consists",
        "consciousness",
        "alone",
        "far",
        "consciousness",
        "extended",
        "backwards",
        "past",
        "action",
        "thought",
        "far",
        "reach",
        "identity",
        "person",
        "whatever",
        "hath",
        "consciousness",
        "present",
        "past",
        "action",
        "person",
        "belong",
        "essay",
        "passage",
        "locke",
        "differs",
        "reid",
        "paraphrase",
        "personal",
        "identity",
        "ie",
        "sameness",
        "rational",
        "far",
        "consciousness",
        "extended",
        "backwards",
        "past",
        "action",
        "thought",
        "far",
        "reach",
        "identity",
        "person",
        "self",
        "ti",
        "self",
        "present",
        "one",
        "reflects",
        "action",
        "done",
        "locke",
        "essay",
        "book",
        "iixxvii",
        "reid",
        "first",
        "criticism",
        "rest",
        "interpreting",
        "locke",
        "definition",
        "committing",
        "position",
        "person",
        "subject",
        "thought",
        "reid",
        "regard",
        "implying",
        "person",
        "thinking",
        "substance",
        "time",
        "locke",
        "appears",
        "committed",
        "analysis",
        "personal",
        "identity",
        "term",
        "memory",
        "locke",
        "would",
        "put",
        "consciousness",
        "past",
        "reid",
        "note",
        "locke",
        "aware",
        "consequence",
        "memory",
        "theory",
        "sameness",
        "consciousness",
        "memory",
        "necessary",
        "sufficient",
        "sameness",
        "person",
        "possible",
        "sameness",
        "person",
        "without",
        "sameness",
        "thinking",
        "word",
        "logically",
        "metaphysically",
        "possible",
        "person",
        "transferred",
        "one",
        "intelligent",
        "another",
        "two",
        "twenty",
        "intelligent",
        "being",
        "person",
        "essay",
        "locke",
        "response",
        "worry",
        "well",
        "worry",
        "period",
        "interrupted",
        "consciousness",
        "sleep",
        "highlight",
        "reid",
        "criticism",
        "n",
        "casesdoubts",
        "raised",
        "whether",
        "thinking",
        "thing",
        "ie",
        "substance",
        "however",
        "reasonable",
        "unreasonable",
        "concern",
        "personal",
        "identity",
        "question",
        "make",
        "person",
        "whether",
        "identical",
        "substance",
        "locke",
        "essay",
        "book",
        "iixxvii",
        "reid",
        "criticism",
        "case",
        "transfer",
        "fission",
        "incoherent",
        "though",
        "think",
        "rather",
        "criticism",
        "possibility",
        "sameness",
        "person",
        "without",
        "sameness",
        "thinking",
        "memory",
        "theory",
        "allows",
        "inconsistent",
        "locke",
        "characterization",
        "person",
        "thinking",
        "given",
        "reid",
        "think",
        "initial",
        "characterization",
        "correct",
        "regard",
        "reductio",
        "memory",
        "theory",
        "reid",
        "second",
        "criticism",
        "famous",
        "often",
        "referred",
        "case",
        "brave",
        "officer",
        "suppose",
        "brave",
        "officer",
        "flogged",
        "boy",
        "school",
        "robbing",
        "orchard",
        "taken",
        "standard",
        "enemy",
        "first",
        "campaign",
        "made",
        "general",
        "advanced",
        "life",
        "suppose",
        "also",
        "must",
        "admitted",
        "possible",
        "took",
        "standard",
        "conscious",
        "flogged",
        "school",
        "made",
        "general",
        "conscious",
        "taking",
        "standard",
        "absolutely",
        "lost",
        "consciousness",
        "flogging",
        "thing",
        "supposed",
        "follows",
        "mr",
        "locke",
        "doctrine",
        "flogged",
        "school",
        "person",
        "took",
        "standard",
        "took",
        "standard",
        "person",
        "made",
        "general",
        "follows",
        "truth",
        "logic",
        "general",
        "person",
        "flogged",
        "school",
        "general",
        "consciousness",
        "reach",
        "far",
        "back",
        "flogging",
        "therefore",
        "according",
        "mr",
        "locke",
        "doctrine",
        "person",
        "flogged",
        "therefore",
        "general",
        "time",
        "person",
        "flogged",
        "school",
        "essay",
        "according",
        "memory",
        "theory",
        "personal",
        "identity",
        "consists",
        "memory",
        "sameness",
        "memory",
        "metaphysically",
        "necessary",
        "sufficient",
        "sameness",
        "person",
        "account",
        "given",
        "sameness",
        "memory",
        "sufficient",
        "sameness",
        "person",
        "person",
        "time",
        "tn",
        "remembers",
        "episodically",
        "event",
        "occurred",
        "time",
        "t",
        "person",
        "time",
        "tn",
        "identical",
        "person",
        "witness",
        "agent",
        "event",
        "time",
        "t",
        "brave",
        "officer",
        "taken",
        "flag",
        "enemy",
        "remembers",
        "beaten",
        "school",
        "brave",
        "officer",
        "identical",
        "boy",
        "beaten",
        "general",
        "remembers",
        "taking",
        "enemy",
        "flag",
        "general",
        "identical",
        "brave",
        "officer",
        "general",
        "identical",
        "brave",
        "officer",
        "brave",
        "officer",
        "identical",
        "boy",
        "transitivity",
        "identity",
        "general",
        "identical",
        "boy",
        "however",
        "account",
        "given",
        "sameness",
        "memory",
        "necessary",
        "condition",
        "sameness",
        "person",
        "person",
        "time",
        "tn",
        "remember",
        "episodically",
        "event",
        "occurred",
        "time",
        "t",
        "person",
        "time",
        "tn",
        "identical",
        "person",
        "witness",
        "agent",
        "event",
        "time",
        "t",
        "general",
        "remember",
        "beaten",
        "school",
        "identical",
        "boy",
        "beaten",
        "thus",
        "memory",
        "theory",
        "committed",
        "mutually",
        "incompatible",
        "thesis",
        "general",
        "identical",
        "boy",
        "reid",
        "third",
        "criticism",
        "terminological",
        "argues",
        "locke",
        "confounds",
        "consciousness",
        "memoryelsewhere",
        "reid",
        "also",
        "argues",
        "locke",
        "confounds",
        "consciousness",
        "reflection",
        "essay",
        "consciousness",
        "memory",
        "distinct",
        "phenomenon",
        "according",
        "reid",
        "former",
        "directed",
        "towards",
        "present",
        "mental",
        "act",
        "operation",
        "latter",
        "directed",
        "towards",
        "past",
        "event",
        "one",
        "agent",
        "witness",
        "consciousness",
        "could",
        "extend",
        "past",
        "event",
        "memory",
        "would",
        "redundant",
        "essay",
        "according",
        "reid",
        "memory",
        "neither",
        "necessary",
        "sufficient",
        "personal",
        "identity",
        "metaphysically",
        "speaking",
        "despite",
        "conceptual",
        "evidential",
        "relation",
        "memory",
        "bear",
        "personal",
        "identity",
        "necessary",
        "condition",
        "u",
        "agent",
        "witness",
        "many",
        "event",
        "remember",
        "may",
        "good",
        "evidence",
        "thing",
        "befell",
        "remember",
        "know",
        "bare",
        "suckled",
        "remember",
        "event",
        "essay",
        "sufficient",
        "condition",
        "butler",
        "showed",
        "episodic",
        "memory",
        "event",
        "entail",
        "one",
        "existed",
        "time",
        "event",
        "remembered",
        "recollection",
        "ability",
        "recall",
        "make",
        "one",
        "identical",
        "person",
        "witness",
        "agent",
        "event",
        "may",
        "observedthat",
        "remembering",
        "action",
        "mine",
        "make",
        "person",
        "remembrance",
        "make",
        "know",
        "assuredly",
        "might",
        "done",
        "though",
        "remember",
        "essay",
        "reid",
        "fourth",
        "criticism",
        "memory",
        "tied",
        "personal",
        "identity",
        "conceptually",
        "evidentially",
        "tie",
        "entail",
        "metaphysical",
        "connection",
        "would",
        "license",
        "analyzing",
        "latter",
        "term",
        "former",
        "essay",
        "reid",
        "final",
        "criticism",
        "memory",
        "theory",
        "committed",
        "absurdity",
        "identity",
        "consists",
        "something",
        "continued",
        "existence",
        "essay",
        "reid",
        "locke",
        "agree",
        "memory",
        "consciousness",
        "thought",
        "mental",
        "operation",
        "continued",
        "existence",
        "fleeting",
        "noncontinuous",
        "also",
        "agree",
        "identity",
        "particular",
        "personal",
        "identity",
        "requires",
        "continued",
        "existence",
        "time",
        "locke",
        "put",
        "one",
        "thing",
        "two",
        "beginning",
        "existence",
        "two",
        "thing",
        "one",
        "beginning",
        "locke",
        "essay",
        "book",
        "iixxvii",
        "commitment",
        "jointly",
        "inconsistent",
        "thesis",
        "personal",
        "identity",
        "consists",
        "memory",
        "theory",
        "personal",
        "identity",
        "intended",
        "account",
        "person",
        "remains",
        "identical",
        "time",
        "analyzed",
        "term",
        "item",
        "fleeting",
        "noncontinuousideas",
        "memory",
        "thoughtsidentity",
        "reduced",
        "diversity",
        "eliminated",
        "contrast",
        "one",
        "locates",
        "personal",
        "identity",
        "think",
        "remembers",
        "continued",
        "uninterrupted",
        "existence",
        "one",
        "purchase",
        "personal",
        "identity",
        "cost",
        "admitting",
        "self",
        "substance",
        "reid",
        "capture",
        "locke",
        "horn",
        "dilemma",
        "either",
        "self",
        "substance",
        "case",
        "remains",
        "identical",
        "time",
        "self",
        "substance",
        "case",
        "personal",
        "identity",
        "reid",
        "hold",
        "dilemma",
        "applies",
        "equal",
        "force",
        "reductionist",
        "account",
        "personal",
        "identity",
        "employ",
        "theory",
        "idea",
        "example",
        "hume",
        "bundle",
        "theory",
        "self",
        "essay"
    ]
}