{
    "main_text": "Eliminativism, External Relations and Bradley’s Regress\n2. Eliminativism, External Relations and Bradley’s Regress\n\nSome philosophers are wary of admitting relations because they are\ndifficult to locate. Glasgow is west of Edinburgh. This tells us\nsomething about the locations of these two cities. But where is the\nrelation that holds between them in virtue of which Glasgow is west of\nEdinburgh? The relation can’t be in one city at the expense of\nthe other, nor in each of them taken separately, since then we lose\nsight of the fact that the relation holds between them\n(McTaggart 1920: §80). Rather the relation must somehow share the\ndivided locations of Glasgow and Edinburgh without itself being\ndivided. This may sound peculiar if we assume that middle-sized things\nlike cities, which have locations in a relatively straightforward\nsense, set a standard for how entities in general ought to behave. But\nwhy shouldn’t we admit other kinds of entity that have a\ndifferent kind of relationship to space and time from such readily\nlocated things. Or even go down the route of conceiving relations as\nabstract, i.e., as “Nowhere and nowhen” (Russell 1912:\n55–6). As Lewis reflected, “if the price is right, we\ncould learn to tolerate it” (Lewis 1986: 68). But is the price\nright? Do the theoretical benefits of admitting relations outweigh the\ncost of offending pre-theoretic intuition?\n\nOther philosophers have been wary of admitting relations because, they\ncomplain, relations are unsatisfactorily characterised, “neither\nfish nor fowl”, i.e., neither substances nor attributes (Heil\n2012: 141, 2016: 130) or \"ontologically weird\" (Lowe 2016:\n111). Now it’s certainly true that \\(n\\)-adic relations, where\n\\(n\\gt 1\\), cannot be characterised as either substances or (monadic)\nattributes. But it only follows that relations are unsatisfactorily\ncharacterised if we assume that substances and attributes provide the\nbenchmark for satisfactory characterisation. But we shouldn’t\nassume this ahead of investigating whether the theoretical benefits of\nadmitting relations outweigh the costs. It’s also been\ncomplained that relations are suspect because they depend\nupon the existence of substances that bear them (Campbell 1990:\n108–9) or, as Lowe makes the point, “A ‘relational\naccident’, if there could be such a thing would not be\n‘in’, to at least not be wholly ‘in’, any of\nits two or more ‘subjects’, nor even wholly\n‘in’ the totality of them. I consequently find it hard to\nconceive what such an entity could really be” (Lowe 2016:\n111–2). Of course it’s true that in order for a relation\nto be borne by one thing to another thing, then those things must\nexist. But it doesn’t follow that relations don’t exist if\nnothing bears them. Moreover, it doesn’t follow straightaway\nfrom the reflection that to be borne by something a relation needs\nthings to bear it, that relations are suspect. It doesn’t follow\nany more than it follows from the reflection that to be had by\nsomething an attribute needs things to have it, that attributes are\nsuspect. If the price is right we should open our minds to the\npossibility of things which are neither fish nor fowl but vegetables,\ni.e., neither substances nor attributes but relations.\n\nIn light of the internal/external distinction introduced above, we can\ndistinguish two distinct questions here: (a) should we acknowledge\nexternal relations? (b) should we acknowledge internal relations? In\nthe present section our focus will be upon whether to accept or reject\nexternal relations, before turning to internal relations in the\nnext.\n\nF.H. Bradley regarded himself the nemesis of external relations, but\nnot only them. Famously, Bradley brought a vicious regress argument\nagainst external relations. In his original version (1893:\n32–3), Bradley presented a dilemma to show that external\nrelations are unintelligible. Here’s the dilemma. Either a\nrelation \\(R\\) is nothing to the things \\(a\\) and \\(b\\) it\nrelates, in which case it cannot relate them. Or, it is\nsomething to them, in which case \\(R\\) must be related to\nthem. But for \\(R\\) to be related to \\(a\\) and \\(b\\) there must be not\nonly \\(R\\) and the things it relates, but also a subsidiary relation\n\\(R'\\) to relate \\(R\\) to them. But now the same problem arises with\nregard to \\(R'\\). It must be something to \\(R\\) and the things it\nrelated in order for \\(R'\\) to relate \\(R\\) to them and this requires\na further subsidiary relation \\(R''\\) between \\(R'\\), \\(R\\), \\(a\\) and\n\\(b\\). But positing more relations to fix up the problem is only\nthrowing good money after bad. We fall into an infinite regress\nbecause the same reasoning applies equally to \\(R'\\) and however many\nother subsidiary relations we subsequently introduce—this is\ncommonly called “Bradley”s Regress’. As Bradley\nlater summed up,\n\n\n“while we keep to our terms and relation as external, no\nintroduction of a third factor could help us to anything better than\nan endless renewal of our failure” (Bradley 1935: 643; van\nInwagen 1993: 35–6).\n\n\nSo whichever horn of Bradley’s dilemma we choose, whether a\nrelation \\(R\\) is nothing or something to the things it relates, we\ncannot make sense of \\(R\\) relating them. Bradley concluded that we\nshould eliminate external relations from our ontology.\n\nIt is often claimed that Bradley’s eliminativism may be\naddressed by positing a special category of entities, either (1) facts\n(Hochberg 1978: 338–40; Armstrong 1989: 109–110, 1997:\n118–9; Hossack 2007: 41–5) or (2) tropes (Maurin 2010:\n321–3; Simons 2010: 201–3). The strategic idea they share\nis that we can embrace the second horn of Bradley’s dilemma\nwithout being stymied by his regress argument. Bradley assumed\nexternal relations to be general entities, i.e., universals,\ncapable of relating different things from whatever things they happen\nto actually relate. It follows from this assumption that the mere\nexistence of \\(R\\) and the things it relates cannot suffice for \\(R\\)\nto relate them, because \\(R\\) might have been engaged elsewhere\nrelating other things, and this problem will persist however many\nsubsidiary (universal) \\(R\\)s we introduce. But, it is argued, this\nproblem can be avoided by either positing facts or tropes, which are\nparticular rather than general entities. Both of these purported\nsolutions are open to question. It seems that they presuppose what\nthey set out to show: the capacity of relations to relate (MacBride\n2011: 168–72). Why is this?\n\nFirst, take (1): Hochberg, Armstrong and Hossack argue that the fact\nthat \\(a\\Rel b\\) does indeed suffice for \\(R\\) to hold between \\(a\\)\nand \\(b\\), because the fact that \\(a\\Rel b\\) cannot exist unless \\(R\\)\ndoes hold between \\(a\\) and \\(b\\). So once the fact that \\(a\\Rel b\\)\nhas been admitted into our ontology, the later stages of\nBradley’s regress either don’t arise or they harmlessly\nsupervene upon the admission of this fact. But, MacBride counters,\nthis presupposes that Bradley’s argument has already been\ndisarmed. Ask yourself: what is a fact? What distinguishes the fact\nthat \\(a\\Rel b\\) from the mere plurality of its constituents: \\(R\\),\n\\(a\\), \\(b\\)? Just this: that the constituents of the fact are\nrelated. But Bradley’s argument is intended to\nestablish that we cannot understand how it is possible for things to\nbe related. So unless we have already established where\nBradley’s argument goes wrong, we cannot appeal to the existence\nof facts because facts are cast into doubt by his argument too.\n\nNext, take (2). Maurin and Simons argue that if we reject\nBradley’s assumption that relations are general entities, i.e.\nuniversals, and hold instead that relations are a special class of\nparticular entities, i.e., non-transferable tropes, then we can avoid\nBradley’s Regress. What is a relation conceived as a\n“non-transferable trope”? It’s a relation \\(r_1\\)\nthat’s borne essentially by the things it relates and which\ncould not have been borne by anything else (Simons 2002/3: 6). Suppose\n\\(r_1\\) is borne by \\(a\\) to \\(b\\). Then \\(r_1\\) is a trope in the\nsense that it is non-repeatable and so is not a “one-over\nmany”, not a universal. And \\(r_1\\) is non-transferable in the\nsense that it could not be transferred from one pair of particulars to\nanother, i.e., \\(r_1\\) could not be borne by \\(c\\) to \\(d\\) where \\(c\n\\ne a\\) and \\(d \\ne b\\). So, necessarily, if \\(r_1\\) exists then (i)\n\\(a\\) and \\(b\\) exist and (ii) \\(a\\mathbin{r_1} b\\). So in virtue of\nthe manner in which \\(r_1\\) depends upon the things it relates it\nfollows that the mere existence of \\(r_1\\) accounts for \\(a\\) and\n\\(b\\)’s being related without having to go down the route of\nappealing to subsidiary relations to glue them together. But again,\nthis proposal assumes that relations really do relate, and therefore\nthat Bradley’s regress has already been disarmed. By way of\nanalogy, consider the Problem of Evil: the difficulty of theoretically\nsquaring God’s omnipotence, omniscience, omnibenevolence, etc.,\nwith the (apparent) fact of unnecessary evil in the world. Of course\nif God exists then there cannot be any unnecessary evil, i.e., there\nmust be a solution to the Problem of Evil. But we don’t provide\na theoretical solution to the Problem by simply positing God. That\ndoesn’t make any easier the theoretical task of squaring what\nappears to be unnecessary evil with the nature of an omnipotent,\nomniscient, omnibenevolent deity. Similarly we don’t provide an\neffective theoretical response to Bradley’s argument by simply\npositing relational tropes. Positing them doesn’t provide an\nexplanation of how a relation can succeed in relating some things\nwithout requiring to be related by a further relation to them.\n\nBradley’s problem with relations would be resolved if we could\nachieve a perspective whereby we appreciated that the bearing of a\nrelation isn’t itself a relation or require a further relation,\nwhatever grammar may suggest (Armstrong 1978a: 106–111; Grossman\n1983: 167–8; Lewis 2002: 6–7). But we won’t achieve\nthat perspective until we can provide a diagnosis of Bradley’s\nreasoning that relieves us of the temptation to think that the bearing\nof a relation is itself a relation.\n\nBertrand Russell dismissed Bradley’s argument on the grounds\nthat philosophers who disbelieve in the reality of external relations\ncannot possibly interpret those numerous parts of sciences which\nappear to be committed to external relations (Russell 1924: 339).\nRussell’s argument bears comparison to Quine’s famous\nindispensability argument for mathematics: just as we cannot make\nsense of scientific discourse without taking seriously those portions\nirredeemably committed to, e.g., numbers, we cannot make sense of\nscientific discourse without taking seriously those portions committed\nto, e.g., spatio-temporal relations (Quine 1981: 149–50). From a\nmethodological point of view, Russell deemed it more likely that an\nerror is concealed somewhere in Bradley’s argument than that\nmodern science should have incorporated so fundamental a falsehood,\ni.e., portrayed a world of spatio-temporal relations when really there\nare none. Of course even if we have good or even overwhelming reason\nto think that Bradley’s argument must be wrong, this\ndoesn’t relieve us of the philosophical responsibility of\ndetermining where exactly Bradley slipped up.\n",
    "section_title": "2. Eliminativism, External Relations and Bradley’s Regress",
    "entry_title": "Relations",
    "hierarchy_title": "Relations || Eliminativism, External Relations and Bradley’s Regress",
    "tokenized_text": [
        "eliminativism",
        "external",
        "relation",
        "bradley",
        "regress",
        "eliminativism",
        "external",
        "relation",
        "bradley",
        "regress",
        "philosopher",
        "wary",
        "admitting",
        "relation",
        "difficult",
        "locate",
        "glasgow",
        "west",
        "edinburgh",
        "tell",
        "u",
        "something",
        "location",
        "two",
        "city",
        "relation",
        "hold",
        "virtue",
        "glasgow",
        "west",
        "edinburgh",
        "relation",
        "one",
        "city",
        "expense",
        "taken",
        "separately",
        "since",
        "lose",
        "sight",
        "fact",
        "relation",
        "hold",
        "mctaggart",
        "rather",
        "relation",
        "must",
        "somehow",
        "share",
        "divided",
        "location",
        "glasgow",
        "edinburgh",
        "without",
        "divided",
        "may",
        "sound",
        "peculiar",
        "assume",
        "middlesized",
        "thing",
        "like",
        "city",
        "location",
        "relatively",
        "straightforward",
        "sense",
        "set",
        "standard",
        "entity",
        "general",
        "ought",
        "behave",
        "admit",
        "kind",
        "entity",
        "different",
        "kind",
        "relationship",
        "space",
        "time",
        "readily",
        "located",
        "thing",
        "even",
        "go",
        "route",
        "conceiving",
        "relation",
        "abstract",
        "ie",
        "nowhere",
        "nowhen",
        "russell",
        "lewis",
        "reflected",
        "price",
        "right",
        "could",
        "learn",
        "tolerate",
        "lewis",
        "price",
        "right",
        "theoretical",
        "benefit",
        "admitting",
        "relation",
        "outweigh",
        "cost",
        "offending",
        "pretheoretic",
        "intuition",
        "philosopher",
        "wary",
        "admitting",
        "relation",
        "complain",
        "relation",
        "unsatisfactorily",
        "characterised",
        "neither",
        "fish",
        "fowl",
        "ie",
        "neither",
        "substance",
        "attribute",
        "heil",
        "ontologically",
        "weird",
        "lowe",
        "certainly",
        "true",
        "n",
        "adic",
        "relation",
        "ngt",
        "characterised",
        "either",
        "substance",
        "monadic",
        "attribute",
        "follows",
        "relation",
        "unsatisfactorily",
        "characterised",
        "assume",
        "substance",
        "attribute",
        "provide",
        "benchmark",
        "satisfactory",
        "characterisation",
        "assume",
        "ahead",
        "investigating",
        "whether",
        "theoretical",
        "benefit",
        "admitting",
        "relation",
        "outweigh",
        "cost",
        "also",
        "complained",
        "relation",
        "suspect",
        "depend",
        "upon",
        "existence",
        "substance",
        "bear",
        "campbell",
        "lowe",
        "make",
        "point",
        "relational",
        "accident",
        "could",
        "thing",
        "would",
        "least",
        "wholly",
        "two",
        "subject",
        "even",
        "wholly",
        "totality",
        "consequently",
        "find",
        "hard",
        "conceive",
        "entity",
        "could",
        "really",
        "lowe",
        "course",
        "true",
        "order",
        "relation",
        "borne",
        "one",
        "thing",
        "another",
        "thing",
        "thing",
        "must",
        "exist",
        "follow",
        "relation",
        "exist",
        "nothing",
        "bear",
        "moreover",
        "follow",
        "straightaway",
        "reflection",
        "borne",
        "something",
        "relation",
        "need",
        "thing",
        "bear",
        "relation",
        "suspect",
        "follow",
        "follows",
        "reflection",
        "something",
        "attribute",
        "need",
        "thing",
        "attribute",
        "suspect",
        "price",
        "right",
        "open",
        "mind",
        "possibility",
        "thing",
        "neither",
        "fish",
        "fowl",
        "vegetable",
        "ie",
        "neither",
        "substance",
        "attribute",
        "relation",
        "light",
        "internalexternal",
        "distinction",
        "introduced",
        "distinguish",
        "two",
        "distinct",
        "question",
        "acknowledge",
        "external",
        "relation",
        "b",
        "acknowledge",
        "internal",
        "relation",
        "present",
        "section",
        "focus",
        "upon",
        "whether",
        "accept",
        "reject",
        "external",
        "relation",
        "turning",
        "internal",
        "relation",
        "next",
        "fh",
        "bradley",
        "regarded",
        "nemesis",
        "external",
        "relation",
        "famously",
        "bradley",
        "brought",
        "vicious",
        "regress",
        "argument",
        "external",
        "relation",
        "original",
        "version",
        "bradley",
        "presented",
        "dilemma",
        "show",
        "external",
        "relation",
        "unintelligible",
        "dilemma",
        "either",
        "relation",
        "r",
        "nothing",
        "thing",
        "a",
        "b",
        "relates",
        "case",
        "relate",
        "something",
        "case",
        "r",
        "must",
        "related",
        "r",
        "related",
        "a",
        "b",
        "must",
        "r",
        "thing",
        "relates",
        "also",
        "subsidiary",
        "relation",
        "r",
        "relate",
        "r",
        "problem",
        "arises",
        "regard",
        "r",
        "must",
        "something",
        "r",
        "thing",
        "related",
        "order",
        "r",
        "relate",
        "r",
        "requires",
        "subsidiary",
        "relation",
        "r",
        "r",
        "r",
        "a",
        "b",
        "positing",
        "relation",
        "fix",
        "problem",
        "throwing",
        "good",
        "money",
        "bad",
        "fall",
        "infinite",
        "regress",
        "reasoning",
        "applies",
        "equally",
        "r",
        "however",
        "many",
        "subsidiary",
        "relation",
        "subsequently",
        "introducethis",
        "commonly",
        "called",
        "bradley",
        "regress",
        "bradley",
        "later",
        "summed",
        "keep",
        "term",
        "relation",
        "external",
        "introduction",
        "third",
        "factor",
        "could",
        "help",
        "u",
        "anything",
        "better",
        "endless",
        "renewal",
        "failure",
        "bradley",
        "van",
        "inwagen",
        "whichever",
        "horn",
        "bradley",
        "dilemma",
        "choose",
        "whether",
        "relation",
        "r",
        "nothing",
        "something",
        "thing",
        "relates",
        "make",
        "sense",
        "r",
        "relating",
        "bradley",
        "concluded",
        "eliminate",
        "external",
        "relation",
        "ontology",
        "often",
        "claimed",
        "bradley",
        "eliminativism",
        "may",
        "addressed",
        "positing",
        "special",
        "category",
        "entity",
        "either",
        "fact",
        "hochberg",
        "armstrong",
        "hossack",
        "trope",
        "maurin",
        "simon",
        "strategic",
        "idea",
        "share",
        "embrace",
        "second",
        "horn",
        "bradley",
        "dilemma",
        "without",
        "stymied",
        "regress",
        "argument",
        "bradley",
        "assumed",
        "external",
        "relation",
        "general",
        "entity",
        "ie",
        "universal",
        "capable",
        "relating",
        "different",
        "thing",
        "whatever",
        "thing",
        "happen",
        "actually",
        "relate",
        "follows",
        "assumption",
        "mere",
        "existence",
        "r",
        "thing",
        "relates",
        "suffice",
        "r",
        "relate",
        "r",
        "might",
        "engaged",
        "elsewhere",
        "relating",
        "thing",
        "problem",
        "persist",
        "however",
        "many",
        "subsidiary",
        "universal",
        "r",
        "introduce",
        "argued",
        "problem",
        "avoided",
        "either",
        "positing",
        "fact",
        "trope",
        "particular",
        "rather",
        "general",
        "entity",
        "purported",
        "solution",
        "open",
        "question",
        "seems",
        "presuppose",
        "set",
        "show",
        "capacity",
        "relation",
        "relate",
        "macbride",
        "first",
        "take",
        "hochberg",
        "armstrong",
        "hossack",
        "argue",
        "fact",
        "arel",
        "b",
        "indeed",
        "suffice",
        "r",
        "hold",
        "a",
        "b",
        "fact",
        "arel",
        "b",
        "exist",
        "unless",
        "r",
        "hold",
        "a",
        "b",
        "fact",
        "arel",
        "b",
        "admitted",
        "ontology",
        "later",
        "stage",
        "bradley",
        "regress",
        "either",
        "arise",
        "harmlessly",
        "supervene",
        "upon",
        "admission",
        "fact",
        "macbride",
        "counter",
        "presupposes",
        "bradley",
        "argument",
        "already",
        "disarmed",
        "ask",
        "fact",
        "distinguishes",
        "fact",
        "arel",
        "b",
        "mere",
        "plurality",
        "constituent",
        "r",
        "a",
        "b",
        "constituent",
        "fact",
        "related",
        "bradley",
        "argument",
        "intended",
        "establish",
        "understand",
        "possible",
        "thing",
        "related",
        "unless",
        "already",
        "established",
        "bradley",
        "argument",
        "go",
        "wrong",
        "appeal",
        "existence",
        "fact",
        "fact",
        "cast",
        "doubt",
        "argument",
        "next",
        "take",
        "maurin",
        "simon",
        "argue",
        "reject",
        "bradley",
        "assumption",
        "relation",
        "general",
        "entity",
        "ie",
        "universal",
        "hold",
        "instead",
        "relation",
        "special",
        "class",
        "particular",
        "entity",
        "ie",
        "nontransferable",
        "trope",
        "avoid",
        "bradley",
        "regress",
        "relation",
        "conceived",
        "nontransferable",
        "trope",
        "relation",
        "r_",
        "borne",
        "essentially",
        "thing",
        "relates",
        "could",
        "borne",
        "anything",
        "else",
        "simon",
        "suppose",
        "r_",
        "borne",
        "a",
        "b",
        "r_",
        "trope",
        "sense",
        "nonrepeatable",
        "oneover",
        "many",
        "universal",
        "r_",
        "nontransferable",
        "sense",
        "could",
        "transferred",
        "one",
        "pair",
        "particular",
        "another",
        "ie",
        "r_",
        "could",
        "borne",
        "c",
        "d",
        "c",
        "ne",
        "a",
        "ne",
        "b",
        "necessarily",
        "r_",
        "exists",
        "a",
        "b",
        "exist",
        "ii",
        "amathbin",
        "r_",
        "b",
        "virtue",
        "manner",
        "r_",
        "depends",
        "upon",
        "thing",
        "relates",
        "follows",
        "mere",
        "existence",
        "r_",
        "account",
        "a",
        "b",
        "related",
        "without",
        "go",
        "route",
        "appealing",
        "subsidiary",
        "relation",
        "glue",
        "together",
        "proposal",
        "assumes",
        "relation",
        "really",
        "relate",
        "therefore",
        "bradley",
        "regress",
        "already",
        "disarmed",
        "way",
        "analogy",
        "consider",
        "problem",
        "evil",
        "difficulty",
        "theoretically",
        "squaring",
        "god",
        "omnipotence",
        "omniscience",
        "omnibenevolence",
        "etc",
        "apparent",
        "fact",
        "unnecessary",
        "evil",
        "world",
        "course",
        "god",
        "exists",
        "unnecessary",
        "evil",
        "ie",
        "must",
        "solution",
        "problem",
        "evil",
        "provide",
        "theoretical",
        "solution",
        "problem",
        "simply",
        "positing",
        "god",
        "make",
        "easier",
        "theoretical",
        "task",
        "squaring",
        "appears",
        "unnecessary",
        "evil",
        "nature",
        "omnipotent",
        "omniscient",
        "omnibenevolent",
        "deity",
        "similarly",
        "provide",
        "effective",
        "theoretical",
        "response",
        "bradley",
        "argument",
        "simply",
        "positing",
        "relational",
        "trope",
        "positing",
        "provide",
        "explanation",
        "relation",
        "succeed",
        "relating",
        "thing",
        "without",
        "requiring",
        "related",
        "relation",
        "bradley",
        "problem",
        "relation",
        "would",
        "resolved",
        "could",
        "achieve",
        "perspective",
        "whereby",
        "appreciated",
        "bearing",
        "relation",
        "relation",
        "require",
        "relation",
        "whatever",
        "grammar",
        "may",
        "suggest",
        "armstrong",
        "a",
        "grossman",
        "lewis",
        "achieve",
        "perspective",
        "provide",
        "diagnosis",
        "bradley",
        "reasoning",
        "relief",
        "u",
        "temptation",
        "think",
        "bearing",
        "relation",
        "relation",
        "bertrand",
        "russell",
        "dismissed",
        "bradley",
        "argument",
        "ground",
        "philosopher",
        "disbelieve",
        "reality",
        "external",
        "relation",
        "possibly",
        "interpret",
        "numerous",
        "part",
        "science",
        "appear",
        "committed",
        "external",
        "relation",
        "russell",
        "russell",
        "argument",
        "bear",
        "comparison",
        "quine",
        "famous",
        "indispensability",
        "argument",
        "mathematics",
        "make",
        "sense",
        "scientific",
        "discourse",
        "without",
        "taking",
        "seriously",
        "portion",
        "irredeemably",
        "committed",
        "eg",
        "number",
        "make",
        "sense",
        "scientific",
        "discourse",
        "without",
        "taking",
        "seriously",
        "portion",
        "committed",
        "eg",
        "spatiotemporal",
        "relation",
        "quine",
        "methodological",
        "point",
        "view",
        "russell",
        "deemed",
        "likely",
        "error",
        "concealed",
        "somewhere",
        "bradley",
        "argument",
        "modern",
        "science",
        "incorporated",
        "fundamental",
        "falsehood",
        "ie",
        "portrayed",
        "world",
        "spatiotemporal",
        "relation",
        "really",
        "none",
        "course",
        "even",
        "good",
        "even",
        "overwhelming",
        "reason",
        "think",
        "bradley",
        "argument",
        "must",
        "wrong",
        "relieve",
        "u",
        "philosophical",
        "responsibility",
        "determining",
        "exactly",
        "bradley",
        "slipped"
    ]
}