{
    "main_text": "Non-Paradigmatic Relational Situations || Relations as Substances\n5.3 Relations as Substances\n\n\nAlthough relations of reason force a shift away from the Aristotelian\ncharacterization of relations, it is important to recall that they\nwere originally invoked to preserve the deep-seated Aristotelian\nconviction that no substance is a relation. As we have seen, it was to\navoid saying that Socrates is signified by the concept ‘thought\nabout’, when he is being thought about by Simmias, that medieval\nphilosophers invoked the notion of a relation of reason: it is not\nSocrates, but a relation of reason, they say, that corresponds to the\nconcept in question, and in this way avoid the consequence that a\nsubstance such as Socrates is a relation. And of course it was the\nsame sort of invocation that enabled them to avoid saying that\nSocrates corresponds to the concept of ‘self-identical’ or\nthat God corresponds to the concepts ‘Lord’ or\n‘Creator’. Given the lengths to which medieval\nphilosophers are willing to go, in situations such as these, to\npreserve the Aristotelian thesis that no substance is a relation, it\nis all the more surprising that there is at least one\ncase—namely, the Christian doctrine of the Trinity—in\nwhich they are forced to admit that even it cannot be upheld.\n\n\nAccording to Christian doctrine of the Trinity, God exists in three\npersons: Father, Son, and Holy Spirit. As this doctrine was typically\nunderstood during the Middle Ages, it implies not only that God\npossesses certain relations—such as fatherhood and\nsonship—but also that he possess them independently of the\nactivity of any mind. As Aquinas says in his Summa\nTheologiae:\n\n\nSomeone is said to be a father only by virtue of his fatherhood, and\nsomeone is said to be a son only by virtue of his sonship. Therefore,\nif [the relations of] fatherhood and sonship are not really in God, it\nfollows that God is not a Father or Son really, but merely according to\na concept of the mind—which is the Sabellian\n heresy.[43]\n\n\n\nNow when the claim that there are real relations in God is combined\nwith another doctrine that was ubiquitous in the Middle Ages, namely\nthe doctrine of divine simplicity, the conclusion that God (and hence\nat least one substance) is a relation seems to follow necessarily. For\nas the doctrine of divine simplicity is typically understood, there is\nno real distinction to be drawn between God and any of his intrinsic\nor essential attributes. Thus, if God is good, he is identical to his\ngoodness; if he is wise, he is identical to his wisdom. By parity of\nreasoning, therefore, if God is a father or son, he must be identical\nto his fatherhood and sonship. Again, Aquinas is perfectly\nrepresentative in this regard:\n\n\nWhatever is in God is his nature … It is thus clear\nthat a relation really existing in God is identical to his nature\naccording to reality, and does not differ from it except according to\na concept of the mind. (Summa Theologiae I, q. 28, a. 2,\ncorpus.)\n\n\n\n\nWith the doctrine of the Trinity, therefore, we arrive at what is perhaps\nthe medievals’ greatest departure from Aristotle.\n\n\nSome medievals, however, see the Trinity not as providing a\ncounterexample to Aristotle’s thesis that no substance is a relation,\nbut rather as calling our attention to a restriction on its range of\napplicability.  Aquinas, for example, appears to think that the thesis\nwas specifically formulated to apply only to the case of creatures\n(cf.  Summa Theologiae I, q. 28, a. 2, corpus), and to some\nextent this is plausible, since obviously Aristotle was not thinking\nabout theological examples such as the Trinity when he formulated\nit. Interestingly, however, other philosophers think that the thesis\ndoes not hold even in the case of all creatures. Thus, Gilbert of\nPoitiers (d. 1154), in a discussion of Boethius’s De\nhebdomadibus, suggests that creaturely goodness is a relation,\nindeed, just the relation of being created by God. On this\ninterpretation, moreover, Gilbert takes this relation to be nothing\nover and above creatures themselves, so that in their case it is\nindividual substances that correspond to the concept ‘created\nby’ and hence qualify as relations. Like Aquinas, however,\nGilbert appears to think of these sorts of cases, not as providing\ncounterexamples to Aristotle’s thesis, but rather as telling us\nsomething about the scope of its applicability. According to Gilbert,\nthere is a distinction to be drawn between natural\nphilosophy, which deals with natural things, and other areas of\nintellectual inquiry, including theology and ethics,\nwhich deal with a broader scope of\n things.[44]\n And Gilbert’s suggestion is that if we restrict our attention\nto natural philosophy, as no doubt Aristotle did, then like him we\nwill be led to the conclusion that no substance is a\n relation.[45]\n\n\nAlthough Gilbert and Aquinas work hard to preserve something like the\nAristotelian thesis that no substance is a relation, at least in\nnon-theological contexts, not all medieval philosophers feel the need\nto do so. In fact, as Middle Ages progress, there appears to be a\ngradual shift, even in non-theological contexts, towards allowing\nsubstances to be relations, or at least towards allowing them to be\nthe primary significata of our relational concepts. Here\nagain Ockham appears to be an important transitional figure. Thus, he\nbreaks with tradition in allowing that even self-identity is a real\nrelation, or at least “real … in the same way that\nsimilarity and equality are” (Quodl. V, q. 27 in\nOpera Theologica ix, 685). Indeed, on Ockham’s view, which\nbecomes influential in the generations following him, it turns out\nthat substances are signified by most of our relational\nconcepts. Apart from some species of quality, Ockham thinks there is\nno real distinction to be drawn between substances and any of there\naccidents. According to him, therefore, relational situations do not\ntypically involve anything more than individual\n substances.[46]\n6. A Shifting of Paradigms\n\n\nWe are now in a position to appreciate the main types of views that\nmedievals developed concerning the nature and ontological status of\nrelations, as well as the main historical and dialectical\nconsiderations that helped to shape them. As we have seen, with the\nexception of thinkers such as Peter Auriol, medievals appear to have\nbeen drawn (almost to a person) to a form of realism about relations,\none according to which at least some predications of the form\n‘aRb’ are true independently of the mind. There\nis some disagreement as to the precise analysis of the situations that\nmakes these sorts of predications true, but even here the medievals typically \ndevelop their views from within a common framework provided by\nAristotle’s Categories: relational situations do not include\nanything corresponding to the notion of a polyadic property, but\ninstead include only substances and their monadic properties or\naccidents. The main medieval disagreements, therefore, are best\ncharacterized as disagreements about the extent to which the proper\nanalysis ought to conform to the paradigm suggested by the\nCategories. Prior to the fourteenth century, as we have seen,\nmedievals tended to follow Aristotle in claiming that things are\nrelated by their accidents, and hence that relational situations\ntypically involve not only pairs of substances, but pairs of monadic\nproperties or accidents as well. As a result, one of the most pressing\nquestions during this period concerns the precise nature of the\naccidents involved in relational situations. Reductive realists, as we\nhave seen, identify them with ordinary, non-relational accidents such\nas quantities or qualities, whereas non-reductive realists identify\nthem with monadic properties of a sui generis type.\n\n\nWith the advent of the fourteenth century, however, important changes\nbegin to take place in the medieval discussion of relations.\nPhilosophers and theologians continue, of course, to allow for\nsituations in which substances are related by their accidents, and\nhence to worry about the precise nature of the accidents involved in\nthese situations. But at this point there is a decided shift toward\nregarding such situations as exceptional. As we have seen, there was\nalways strong theological pressure to allow for at least some\ndepartures from the Aristotelian paradigm. But what appears to have\nhappened over time is that these departures come to seem less and less\npeculiar, and eventually to provide the basis for a new analysis of\nrelational situations—one according to which substances\nthemselves are the items responsible for relating. Around this same\ntime, moreover, Ockham and his followers, most notably John Buridan,\ninstitute another sort of change, namely, a shift away from the traditional\nAristotelian characterization of relations. Prior to the\nfourteenth century, philosophers and theologians typically assume that\nthe term ‘relation’ signifies whatever it is in a\nrelational situation that does the relating—though here again\ntheological considerations force them to allow for certain exceptions.\nBy the time of Ockham, however, we get a complete break with this\nstandard characterization. Thus, whereas earlier philosophers and\ntheologians would allow the term ‘relation’ to signify a\nbeing of reason only in certain cases, such as creation, Ockham and\nhis followers maintain that ‘relation’ is a term of second\nintention, and so strictly speaking always signifies beings of reason.\nWith Ockham, therefore, we have not only a complete severing of the\nconnection between relations and those items in relational situations\nthat actually do the relating, but also the advent of a new—and,\nwe might add, fairly harmless—form of\n anti-realism.[47]\n\n\nIn the end, therefore, it is fair to say that the fourteenth\ncentury marks a shifting of medieval paradigms both with respect to\nthe proper analysis of relational situations and with respect to the\nproper characterization of relations. It is important to add, however, that\nthese shifts cannot be fully explained in terms of developments within\nthe medieval discussion of relations, but are instead part-and-parcel\nof broader theoretical shifts in medieval accounts of the relationship\nbetween mind, language, and reality—shifts which are closely\nassociated with the rise of late-medieval nominalism\n generally.[48]",
    "section_title": "5.3 Relations as Substances",
    "entry_title": "Medieval Theories of Relations",
    "hierarchy_title": "Medieval Theories of Relations || Non-Paradigmatic Relational Situations || Relations as Substances",
    "tokenized_text": [
        "nonparadigmatic",
        "relational",
        "situation",
        "relation",
        "substance",
        "relation",
        "substance",
        "although",
        "relation",
        "reason",
        "force",
        "shift",
        "away",
        "aristotelian",
        "characterization",
        "relation",
        "important",
        "recall",
        "originally",
        "invoked",
        "preserve",
        "deepseated",
        "aristotelian",
        "conviction",
        "substance",
        "relation",
        "seen",
        "avoid",
        "saying",
        "socrates",
        "signified",
        "concept",
        "thought",
        "thought",
        "simmias",
        "medieval",
        "philosopher",
        "invoked",
        "notion",
        "relation",
        "reason",
        "socrates",
        "relation",
        "reason",
        "say",
        "corresponds",
        "concept",
        "question",
        "way",
        "avoid",
        "consequence",
        "substance",
        "socrates",
        "relation",
        "course",
        "sort",
        "invocation",
        "enabled",
        "avoid",
        "saying",
        "socrates",
        "corresponds",
        "concept",
        "selfidentical",
        "god",
        "corresponds",
        "concept",
        "lord",
        "creator",
        "given",
        "length",
        "medieval",
        "philosopher",
        "willing",
        "go",
        "situation",
        "preserve",
        "aristotelian",
        "thesis",
        "substance",
        "relation",
        "surprising",
        "least",
        "one",
        "casenamely",
        "christian",
        "doctrine",
        "trinityin",
        "forced",
        "admit",
        "even",
        "upheld",
        "according",
        "christian",
        "doctrine",
        "trinity",
        "god",
        "exists",
        "three",
        "person",
        "father",
        "son",
        "holy",
        "spirit",
        "doctrine",
        "typically",
        "understood",
        "middle",
        "age",
        "implies",
        "god",
        "posse",
        "certain",
        "relationssuch",
        "fatherhood",
        "sonshipbut",
        "also",
        "posse",
        "independently",
        "activity",
        "mind",
        "aquinas",
        "say",
        "summa",
        "theologiae",
        "someone",
        "said",
        "father",
        "virtue",
        "fatherhood",
        "someone",
        "said",
        "son",
        "virtue",
        "sonship",
        "therefore",
        "relation",
        "fatherhood",
        "sonship",
        "really",
        "god",
        "follows",
        "god",
        "father",
        "son",
        "really",
        "merely",
        "according",
        "concept",
        "mindwhich",
        "sabellian",
        "heresy",
        "claim",
        "real",
        "relation",
        "god",
        "combined",
        "another",
        "doctrine",
        "ubiquitous",
        "middle",
        "age",
        "namely",
        "doctrine",
        "divine",
        "simplicity",
        "conclusion",
        "god",
        "hence",
        "least",
        "one",
        "substance",
        "relation",
        "seems",
        "follow",
        "necessarily",
        "doctrine",
        "divine",
        "simplicity",
        "typically",
        "understood",
        "real",
        "distinction",
        "drawn",
        "god",
        "intrinsic",
        "essential",
        "attribute",
        "thus",
        "god",
        "good",
        "identical",
        "goodness",
        "wise",
        "identical",
        "wisdom",
        "parity",
        "reasoning",
        "therefore",
        "god",
        "father",
        "son",
        "must",
        "identical",
        "fatherhood",
        "sonship",
        "aquinas",
        "perfectly",
        "representative",
        "regard",
        "whatever",
        "god",
        "nature",
        "thus",
        "clear",
        "relation",
        "really",
        "existing",
        "god",
        "identical",
        "nature",
        "according",
        "reality",
        "differ",
        "except",
        "according",
        "concept",
        "mind",
        "summa",
        "theologiae",
        "q",
        "corpus",
        "doctrine",
        "trinity",
        "therefore",
        "arrive",
        "perhaps",
        "medievals",
        "greatest",
        "departure",
        "aristotle",
        "medievals",
        "however",
        "see",
        "trinity",
        "providing",
        "counterexample",
        "aristotle",
        "thesis",
        "substance",
        "relation",
        "rather",
        "calling",
        "attention",
        "restriction",
        "range",
        "applicability",
        "aquinas",
        "example",
        "appears",
        "think",
        "thesis",
        "specifically",
        "formulated",
        "apply",
        "case",
        "creature",
        "cf",
        "summa",
        "theologiae",
        "q",
        "corpus",
        "extent",
        "plausible",
        "since",
        "obviously",
        "aristotle",
        "thinking",
        "theological",
        "example",
        "trinity",
        "formulated",
        "interestingly",
        "however",
        "philosopher",
        "think",
        "thesis",
        "hold",
        "even",
        "case",
        "creature",
        "thus",
        "gilbert",
        "poitier",
        "d",
        "discussion",
        "boethius",
        "de",
        "hebdomadibus",
        "suggests",
        "creaturely",
        "goodness",
        "relation",
        "indeed",
        "relation",
        "created",
        "god",
        "interpretation",
        "moreover",
        "gilbert",
        "take",
        "relation",
        "nothing",
        "creature",
        "case",
        "individual",
        "substance",
        "correspond",
        "concept",
        "created",
        "hence",
        "qualify",
        "relation",
        "like",
        "aquinas",
        "however",
        "gilbert",
        "appears",
        "think",
        "sort",
        "case",
        "providing",
        "counterexample",
        "aristotle",
        "thesis",
        "rather",
        "telling",
        "u",
        "something",
        "scope",
        "applicability",
        "according",
        "gilbert",
        "distinction",
        "drawn",
        "natural",
        "philosophy",
        "deal",
        "natural",
        "thing",
        "area",
        "intellectual",
        "inquiry",
        "including",
        "theology",
        "ethic",
        "deal",
        "broader",
        "scope",
        "thing",
        "gilbert",
        "suggestion",
        "restrict",
        "attention",
        "natural",
        "philosophy",
        "doubt",
        "aristotle",
        "like",
        "led",
        "conclusion",
        "substance",
        "relation",
        "although",
        "gilbert",
        "aquinas",
        "work",
        "hard",
        "preserve",
        "something",
        "like",
        "aristotelian",
        "thesis",
        "substance",
        "relation",
        "least",
        "nontheological",
        "context",
        "medieval",
        "philosopher",
        "feel",
        "need",
        "fact",
        "middle",
        "age",
        "progress",
        "appears",
        "gradual",
        "shift",
        "even",
        "nontheological",
        "context",
        "towards",
        "allowing",
        "substance",
        "relation",
        "least",
        "towards",
        "allowing",
        "primary",
        "significata",
        "relational",
        "concept",
        "ockham",
        "appears",
        "important",
        "transitional",
        "figure",
        "thus",
        "break",
        "tradition",
        "allowing",
        "even",
        "selfidentity",
        "real",
        "relation",
        "least",
        "real",
        "way",
        "similarity",
        "equality",
        "quodl",
        "v",
        "q",
        "opera",
        "theologica",
        "ix",
        "indeed",
        "ockham",
        "view",
        "becomes",
        "influential",
        "generation",
        "following",
        "turn",
        "substance",
        "signified",
        "relational",
        "concept",
        "apart",
        "specie",
        "quality",
        "ockham",
        "think",
        "real",
        "distinction",
        "drawn",
        "substance",
        "accident",
        "according",
        "therefore",
        "relational",
        "situation",
        "typically",
        "involve",
        "anything",
        "individual",
        "substance",
        "shifting",
        "paradigm",
        "position",
        "appreciate",
        "main",
        "type",
        "view",
        "medievals",
        "developed",
        "concerning",
        "nature",
        "ontological",
        "status",
        "relation",
        "well",
        "main",
        "historical",
        "dialectical",
        "consideration",
        "helped",
        "shape",
        "seen",
        "exception",
        "thinker",
        "peter",
        "auriol",
        "medievals",
        "appear",
        "drawn",
        "almost",
        "person",
        "form",
        "realism",
        "relation",
        "one",
        "according",
        "least",
        "predication",
        "form",
        "arb",
        "true",
        "independently",
        "mind",
        "disagreement",
        "precise",
        "analysis",
        "situation",
        "make",
        "sort",
        "predication",
        "true",
        "even",
        "medievals",
        "typically",
        "develop",
        "view",
        "within",
        "common",
        "framework",
        "provided",
        "aristotle",
        "category",
        "relational",
        "situation",
        "include",
        "anything",
        "corresponding",
        "notion",
        "polyadic",
        "property",
        "instead",
        "include",
        "substance",
        "monadic",
        "property",
        "accident",
        "main",
        "medieval",
        "disagreement",
        "therefore",
        "best",
        "characterized",
        "disagreement",
        "extent",
        "proper",
        "analysis",
        "ought",
        "conform",
        "paradigm",
        "suggested",
        "category",
        "prior",
        "fourteenth",
        "century",
        "seen",
        "medievals",
        "tended",
        "follow",
        "aristotle",
        "claiming",
        "thing",
        "related",
        "accident",
        "hence",
        "relational",
        "situation",
        "typically",
        "involve",
        "pair",
        "substance",
        "pair",
        "monadic",
        "property",
        "accident",
        "well",
        "result",
        "one",
        "pressing",
        "question",
        "period",
        "concern",
        "precise",
        "nature",
        "accident",
        "involved",
        "relational",
        "situation",
        "reductive",
        "realist",
        "seen",
        "identify",
        "ordinary",
        "nonrelational",
        "accident",
        "quantity",
        "quality",
        "whereas",
        "nonreductive",
        "realist",
        "identify",
        "monadic",
        "property",
        "sui",
        "generis",
        "type",
        "advent",
        "fourteenth",
        "century",
        "however",
        "important",
        "change",
        "begin",
        "take",
        "place",
        "medieval",
        "discussion",
        "relation",
        "philosopher",
        "theologian",
        "continue",
        "course",
        "allow",
        "situation",
        "substance",
        "related",
        "accident",
        "hence",
        "worry",
        "precise",
        "nature",
        "accident",
        "involved",
        "situation",
        "point",
        "decided",
        "shift",
        "toward",
        "regarding",
        "situation",
        "exceptional",
        "seen",
        "always",
        "strong",
        "theological",
        "pressure",
        "allow",
        "least",
        "departure",
        "aristotelian",
        "paradigm",
        "appears",
        "happened",
        "time",
        "departure",
        "come",
        "seem",
        "le",
        "le",
        "peculiar",
        "eventually",
        "provide",
        "basis",
        "new",
        "analysis",
        "relational",
        "situationsone",
        "according",
        "substance",
        "item",
        "responsible",
        "relating",
        "around",
        "time",
        "moreover",
        "ockham",
        "follower",
        "notably",
        "john",
        "buridan",
        "institute",
        "another",
        "sort",
        "change",
        "namely",
        "shift",
        "away",
        "traditional",
        "aristotelian",
        "characterization",
        "relation",
        "prior",
        "fourteenth",
        "century",
        "philosopher",
        "theologian",
        "typically",
        "assume",
        "term",
        "relation",
        "signifies",
        "whatever",
        "relational",
        "situation",
        "relatingthough",
        "theological",
        "consideration",
        "force",
        "allow",
        "certain",
        "exception",
        "time",
        "ockham",
        "however",
        "get",
        "complete",
        "break",
        "standard",
        "characterization",
        "thus",
        "whereas",
        "earlier",
        "philosopher",
        "theologian",
        "would",
        "allow",
        "term",
        "relation",
        "signify",
        "reason",
        "certain",
        "case",
        "creation",
        "ockham",
        "follower",
        "maintain",
        "relation",
        "term",
        "second",
        "intention",
        "strictly",
        "speaking",
        "always",
        "signifies",
        "being",
        "reason",
        "ockham",
        "therefore",
        "complete",
        "severing",
        "connection",
        "relation",
        "item",
        "relational",
        "situation",
        "actually",
        "relating",
        "also",
        "advent",
        "newand",
        "might",
        "add",
        "fairly",
        "harmlessform",
        "antirealism",
        "end",
        "therefore",
        "fair",
        "say",
        "fourteenth",
        "century",
        "mark",
        "shifting",
        "medieval",
        "paradigm",
        "respect",
        "proper",
        "analysis",
        "relational",
        "situation",
        "respect",
        "proper",
        "characterization",
        "relation",
        "important",
        "add",
        "however",
        "shift",
        "fully",
        "explained",
        "term",
        "development",
        "within",
        "medieval",
        "discussion",
        "relation",
        "instead",
        "partandparcel",
        "broader",
        "theoretical",
        "shift",
        "medieval",
        "account",
        "relationship",
        "mind",
        "language",
        "realityshifts",
        "closely",
        "associated",
        "rise",
        "latemedieval",
        "nominalism",
        "generally"
    ]
}