{
    "main_text": "New Relativism || The individuating features of New Relativism\n5.1 The individuating features of New Relativism\nIt is a commonplace that the truth-value of an utterance can depend on the context in which it is uttered. If you say “I’m happy” and I say the same sentence, your utterance may be true and mine false. In such cases, the context of utterance plays a role in determining which proposition the sentence expresses. This can happen even when the sentence does not contain an overtly indexical expression. Thus Harman and Dreier hold that a statement of the form “A is wrong” is roughly equivalent to “A is wrong according to the moral system I accept”. So two utterances of (say) “Torture is wrong” can differ in truth-value if they are uttered by speakers who accept very different moral systems. Contextualists about (for instance) moral, aesthetic and epistemic discourse will view moral, aesthetic and epistemic expressions likewise as indexical expressions but (as we’ll see) with some difficulty explaining apparent genuine disagreement in these areas of discourse. On this point, New Relativists claim an important advantage over contextualists. New relativism, by contrast with contextualism, aims to achieve this advantage via a much less familiar form of context dependence.\nTruth-relativism with respect to utterances in area of discourse D is the claim that, following MacFarlane’s notable version of the view: the truth of S’s D-utterance u depends (in part) on a context of assessment; that is (and in short) what S asserts, u, gets a truth value—according to the truth-relativist’s D-semantics—only once the D-standard of the assessor is specified. Independent of the specification of such a standard, S’s u assertion lacks a truth-value much as, by comparison, indexical expressions such as “The barn is nearby” do not get a truth-value independent of contextual facts about the context of use (i.e. the context in which the utterance is made). And, as a further point of clarification here: while the contextualist can, no less than the relativist, recognize a “standards” or “judge” parameter, for the contextualist, its value will be supplied by the context of use, whereas the relativist takes it to be supplied completely independently of the context of use, by the context of evaluation (or, as MacFarlane calls it, the context of assessment).\nTo see how this view is claimed to offer a satisfying take on disagreement in types of discourse (see Beddor 2019), consider a simple example, concerning predicates of personal taste. A utters, “Pretzels are tasty”, and B utters, “Pretzels are not tasty”. While the semantic invariantist (for whom the truth-value of taste predications is in no way context sensitive) will insist that the above exchange constitutes a genuine disagreement about whether pretzels are tasty and that at least one party is wrong, contextualists and truth-relativists have the prima facie advantageous resources to avoid the result that at least one party to the apparent disagreement has made a mistake.\nThe contextualist claims that the truth-evaluable content expressed by A’s utterance encodes A’s standards (cf. non-indexical contextualism). Thus, in this apparent disagreement, the proposition expressed by A is “Pretzels are tasty relative to my [A’s] standards” while B expresses the proposition “Pretzels are not tasty relative to my [B’s] standards”. This maneuver avoids the result that at least one of the two parties has uttered something false, but (as the new relativist points out) this result comes at the price of being unable to offer a clear explanation of our intuition that there is some uniform content about which A and B disagree.\nThe new relativist, on the other hand, claims to be able to preserve both the apparent subjectivity of taste discourse and (and, unlike the contextualist) our intuition that exchanges of the form mentioned constitute genuine disagreements. They do this by first insisting (unlike the contextualist—though see Suikkanen 2019) that there is a single truth-evaluable proposition which A affirms and B denies. In the case where A says “Pretzels are tasty”, and B denies this, there is a uniform content that is affirmed by A’s utterance and denied by B’s, namely the proposition that pretzels are tasty, period. So we have a genuine disagreement. Unlike the truth-absolutist, however, the new relativist will add that the disagreement is faultless because the proposition affirmed in A’s utterance has a truth value only relative to a judge or standards parameter, and in this case: A’s standards, when A is the assessor, B’s standards, when B is the assessor. Hence, the truth-relativist about predicates of personal taste will, by insisting that the truth of Pretzels are tasty depends on the context of assessment, allow a single proposition to be (at the same time):\n\n(i)\ntrue relative to the context of assessment where A’s standards of taste are operative and\n(ii)\nfalse relative to the context of assessment where  B’s standards of taste are operative.\n\nNew Relativist views, which endorse truth-relativism locally for some domain of discourse, stand in opposition to the more traditional view of propositional content (what Cappelen & Hawthorne call “The Simple View”) according to which propositions bear truth and falsity as monadic properties (cf. however, MacFarlane 2011a for some resistance to Cappelen & Hawthorne’s claim that this simple characterization should be regarded as the “received” view.)\nA key source of philosophical motivation for relativizing truth in the fashion of New Relativism traces to Lewis’s (1980) and Kaplan’s (1989) foundational work in semantics, according to which sentence truth is to be understood as relative to a circumstance of evaluation that includes world, time and location. New Relativists inherit the formal apparatus of Lewis and Kaplan and add another parameter, but their reasons for doing so are quite different from the reasons that motivated the framework in the first place. While Lewis’s and Kaplan’s reasons for “proliferating” parameters were primarily based on considerations to do with intensional operators (though see Yli-Vakkuri et al. 2019), the more contemporary reasons for adding a judge or standard parameter are often to do with respecting (for instance) disagreement data. (For further discussion here, see Kölbel (2015)). (Note that “old-style contextualism” can also be stated in Kaplan’s framework; it involves variation in content with respect to the context of utterance rather than in truth value with respect to the circumstance of evaluation).\nKaplan’s view specifically was that the need for particular parameters in the circumstance of evaluation was a function of the non-specificity of certain propositional contents with respect to world, time and location (see Kaplan’s (1989) analysis of indexicals). On Kaplan’s view:\n\nA circumstance will usually include a possible state or history of the world, a time, and perhaps other features as well. The amount of information we require from a circumstance is linked to the degree of specificity of contents and thus to the kinds of operators in the language…. (1989: 502)\n\nJohn MacFarlane, a leading contemporary relativist, writes:\n\nTaking this line of thought a little farther, the relativist might envision contents that are “sense-of-humor neutral” or “standard-of-taste neutral” or “epistemic-state neutral”, and circumstances of evaluation that include parameters for a sense of humor, a standard of taste or an epistemic state. This move would open up room for the truth value of a proposition to vary with these “subjective” factors in much the same way that it varies with the world of evaluation. (MacFarlane 2007: 6–7)\n\nSimilarly, Cappelen and Hawthorne write:\n\nContemporary analytic relativists reason as follows: ‘Lewis and Kaplan have shown that we need to relativize truth to triples of <world, time, location>[’]. … But, having already started down this road, why not exploit these strategies further? In particular, by adding new and exotic parameters into the circumstances of evaluation, we can allow the contents of thought and talk to be non-specific (in Kaplan’s sense) along dimensions other than world, time and location. (2009: 10; edited)\n\nA question on which New Relativists are divided, however, is: what contents are non-specific along dimensions other than world, time and location? It is with respect to this general question that different families of New Relativism are generated.\nThe taxonomy we offer is that a view falls within the category of New Relativism if, and only if, the view endorses a truth-relativist semantics (as previously outlined) for utterance tokens in some domain of discourse, such as: discourse about predicates of personal taste (Lasersohn 2005; Kölbel 2003), epistemic modals (Egan 2007; Egan, Hawthorne & Weatherson 2005; MacFarlane 2011b; Stephenson 2007), future contingents (MacFarlane 2003), indicative conditionals (Weatherson 2009; Kolodny & MacFarlane 2010) gradable adjectives (Richard 2004), deontic modals (Kolodny & MacFarlane 2010 and MacFarlane 2014: ch. 11) and knowledge attributions (Richard 2004); MacFarlane 2005b, 2011c, 2014). The motivations for truth-relativism in each of these domains include various considerations unique to those domains. We consider some of the arguments for New Relativism in four of these domains in the following sections.\n",
    "section_title": "5.1 The individuating features of New Relativism",
    "entry_title": "Relativism",
    "hierarchy_title": "Relativism || New Relativism || The individuating features of New Relativism",
    "tokenized_text": [
        "new",
        "relativism",
        "individuating",
        "feature",
        "new",
        "relativism",
        "individuating",
        "feature",
        "new",
        "relativism",
        "commonplace",
        "truthvalue",
        "utterance",
        "depend",
        "context",
        "uttered",
        "say",
        "happy",
        "say",
        "sentence",
        "utterance",
        "may",
        "true",
        "mine",
        "false",
        "case",
        "context",
        "utterance",
        "play",
        "role",
        "determining",
        "proposition",
        "sentence",
        "express",
        "happen",
        "even",
        "sentence",
        "contain",
        "overtly",
        "indexical",
        "expression",
        "thus",
        "harman",
        "dreier",
        "hold",
        "statement",
        "form",
        "wrong",
        "roughly",
        "equivalent",
        "wrong",
        "according",
        "moral",
        "system",
        "accept",
        "two",
        "utterance",
        "say",
        "torture",
        "wrong",
        "differ",
        "truthvalue",
        "uttered",
        "speaker",
        "accept",
        "different",
        "moral",
        "system",
        "contextualists",
        "instance",
        "moral",
        "aesthetic",
        "epistemic",
        "discourse",
        "view",
        "moral",
        "aesthetic",
        "epistemic",
        "expression",
        "likewise",
        "indexical",
        "expression",
        "see",
        "difficulty",
        "explaining",
        "apparent",
        "genuine",
        "disagreement",
        "area",
        "discourse",
        "point",
        "new",
        "relativists",
        "claim",
        "important",
        "advantage",
        "contextualists",
        "new",
        "relativism",
        "contrast",
        "contextualism",
        "aim",
        "achieve",
        "advantage",
        "via",
        "much",
        "le",
        "familiar",
        "form",
        "context",
        "dependence",
        "truthrelativism",
        "respect",
        "utterance",
        "area",
        "discourse",
        "claim",
        "following",
        "macfarlane",
        "notable",
        "version",
        "view",
        "truth",
        "dutterance",
        "u",
        "depends",
        "part",
        "context",
        "assessment",
        "short",
        "asserts",
        "u",
        "get",
        "truth",
        "valueaccording",
        "truthrelativist",
        "dsemanticsonly",
        "dstandard",
        "assessor",
        "specified",
        "independent",
        "specification",
        "standard",
        "u",
        "assertion",
        "lack",
        "truthvalue",
        "much",
        "comparison",
        "indexical",
        "expression",
        "barn",
        "nearby",
        "get",
        "truthvalue",
        "independent",
        "contextual",
        "fact",
        "context",
        "use",
        "ie",
        "context",
        "utterance",
        "made",
        "point",
        "clarification",
        "contextualist",
        "le",
        "relativist",
        "recognize",
        "standard",
        "judge",
        "parameter",
        "contextualist",
        "value",
        "supplied",
        "context",
        "use",
        "whereas",
        "relativist",
        "take",
        "supplied",
        "completely",
        "independently",
        "context",
        "use",
        "context",
        "evaluation",
        "macfarlane",
        "call",
        "context",
        "assessment",
        "see",
        "view",
        "claimed",
        "offer",
        "satisfying",
        "take",
        "disagreement",
        "type",
        "discourse",
        "see",
        "beddor",
        "consider",
        "simple",
        "example",
        "concerning",
        "predicate",
        "personal",
        "taste",
        "utters",
        "pretzel",
        "tasty",
        "b",
        "utters",
        "pretzel",
        "tasty",
        "semantic",
        "invariantist",
        "truthvalue",
        "taste",
        "predication",
        "way",
        "context",
        "sensitive",
        "insist",
        "exchange",
        "constitutes",
        "genuine",
        "disagreement",
        "whether",
        "pretzel",
        "tasty",
        "least",
        "one",
        "party",
        "wrong",
        "contextualists",
        "truthrelativists",
        "prima",
        "facie",
        "advantageous",
        "resource",
        "avoid",
        "result",
        "least",
        "one",
        "party",
        "apparent",
        "disagreement",
        "made",
        "mistake",
        "contextualist",
        "claim",
        "truthevaluable",
        "content",
        "expressed",
        "utterance",
        "encodes",
        "standard",
        "cf",
        "nonindexical",
        "contextualism",
        "thus",
        "apparent",
        "disagreement",
        "proposition",
        "expressed",
        "pretzel",
        "tasty",
        "relative",
        "standard",
        "b",
        "express",
        "proposition",
        "pretzel",
        "tasty",
        "relative",
        "b",
        "standard",
        "maneuver",
        "avoids",
        "result",
        "least",
        "one",
        "two",
        "party",
        "uttered",
        "something",
        "false",
        "new",
        "relativist",
        "point",
        "result",
        "come",
        "price",
        "unable",
        "offer",
        "clear",
        "explanation",
        "intuition",
        "uniform",
        "content",
        "b",
        "disagree",
        "new",
        "relativist",
        "hand",
        "claim",
        "able",
        "preserve",
        "apparent",
        "subjectivity",
        "taste",
        "discourse",
        "unlike",
        "contextualist",
        "intuition",
        "exchange",
        "form",
        "mentioned",
        "constitute",
        "genuine",
        "disagreement",
        "first",
        "insisting",
        "unlike",
        "contextualistthough",
        "see",
        "suikkanen",
        "single",
        "truthevaluable",
        "proposition",
        "affirms",
        "b",
        "denies",
        "case",
        "say",
        "pretzel",
        "tasty",
        "b",
        "denies",
        "uniform",
        "content",
        "affirmed",
        "utterance",
        "denied",
        "b",
        "namely",
        "proposition",
        "pretzel",
        "tasty",
        "period",
        "genuine",
        "disagreement",
        "unlike",
        "truthabsolutist",
        "however",
        "new",
        "relativist",
        "add",
        "disagreement",
        "faultless",
        "proposition",
        "affirmed",
        "utterance",
        "truth",
        "value",
        "relative",
        "judge",
        "standard",
        "parameter",
        "case",
        "standard",
        "assessor",
        "b",
        "standard",
        "b",
        "assessor",
        "hence",
        "truthrelativist",
        "predicate",
        "personal",
        "taste",
        "insisting",
        "truth",
        "pretzel",
        "tasty",
        "depends",
        "context",
        "assessment",
        "allow",
        "single",
        "proposition",
        "time",
        "true",
        "relative",
        "context",
        "assessment",
        "standard",
        "taste",
        "operative",
        "ii",
        "false",
        "relative",
        "context",
        "assessment",
        "b",
        "standard",
        "taste",
        "operative",
        "new",
        "relativist",
        "view",
        "endorse",
        "truthrelativism",
        "locally",
        "domain",
        "discourse",
        "stand",
        "opposition",
        "traditional",
        "view",
        "propositional",
        "content",
        "cappelen",
        "hawthorne",
        "call",
        "simple",
        "view",
        "according",
        "proposition",
        "bear",
        "truth",
        "falsity",
        "monadic",
        "property",
        "cf",
        "however",
        "macfarlane",
        "a",
        "resistance",
        "cappelen",
        "hawthorne",
        "claim",
        "simple",
        "characterization",
        "regarded",
        "received",
        "view",
        "key",
        "source",
        "philosophical",
        "motivation",
        "relativizing",
        "truth",
        "fashion",
        "new",
        "relativism",
        "trace",
        "lewis",
        "kaplan",
        "foundational",
        "work",
        "semantics",
        "according",
        "sentence",
        "truth",
        "understood",
        "relative",
        "circumstance",
        "evaluation",
        "includes",
        "world",
        "time",
        "location",
        "new",
        "relativists",
        "inherit",
        "formal",
        "apparatus",
        "lewis",
        "kaplan",
        "add",
        "another",
        "parameter",
        "reason",
        "quite",
        "different",
        "reason",
        "motivated",
        "framework",
        "first",
        "place",
        "lewis",
        "kaplan",
        "reason",
        "proliferating",
        "parameter",
        "primarily",
        "based",
        "consideration",
        "intensional",
        "operator",
        "though",
        "see",
        "ylivakkuri",
        "et",
        "al",
        "contemporary",
        "reason",
        "adding",
        "judge",
        "standard",
        "parameter",
        "often",
        "respecting",
        "instance",
        "disagreement",
        "data",
        "discussion",
        "see",
        "kölbel",
        "note",
        "oldstyle",
        "contextualism",
        "also",
        "stated",
        "kaplan",
        "framework",
        "involves",
        "variation",
        "content",
        "respect",
        "context",
        "utterance",
        "rather",
        "truth",
        "value",
        "respect",
        "circumstance",
        "evaluation",
        "kaplan",
        "view",
        "specifically",
        "need",
        "particular",
        "parameter",
        "circumstance",
        "evaluation",
        "function",
        "nonspecificity",
        "certain",
        "propositional",
        "content",
        "respect",
        "world",
        "time",
        "location",
        "see",
        "kaplan",
        "analysis",
        "indexicals",
        "kaplan",
        "view",
        "circumstance",
        "usually",
        "include",
        "possible",
        "state",
        "history",
        "world",
        "time",
        "perhaps",
        "feature",
        "well",
        "amount",
        "information",
        "require",
        "circumstance",
        "linked",
        "degree",
        "specificity",
        "content",
        "thus",
        "kind",
        "operator",
        "language",
        "john",
        "macfarlane",
        "leading",
        "contemporary",
        "relativist",
        "writes",
        "taking",
        "line",
        "thought",
        "little",
        "farther",
        "relativist",
        "might",
        "envision",
        "content",
        "senseofhumor",
        "neutral",
        "standardoftaste",
        "neutral",
        "epistemicstate",
        "neutral",
        "circumstance",
        "evaluation",
        "include",
        "parameter",
        "sense",
        "humor",
        "standard",
        "taste",
        "epistemic",
        "state",
        "move",
        "would",
        "open",
        "room",
        "truth",
        "value",
        "proposition",
        "vary",
        "subjective",
        "factor",
        "much",
        "way",
        "varies",
        "world",
        "evaluation",
        "macfarlane",
        "similarly",
        "cappelen",
        "hawthorne",
        "write",
        "contemporary",
        "analytic",
        "relativists",
        "reason",
        "follows",
        "lewis",
        "kaplan",
        "shown",
        "need",
        "relativize",
        "truth",
        "triple",
        "world",
        "time",
        "location",
        "already",
        "started",
        "road",
        "exploit",
        "strategy",
        "particular",
        "adding",
        "new",
        "exotic",
        "parameter",
        "circumstance",
        "evaluation",
        "allow",
        "content",
        "thought",
        "talk",
        "nonspecific",
        "kaplan",
        "sense",
        "along",
        "dimension",
        "world",
        "time",
        "location",
        "edited",
        "question",
        "new",
        "relativists",
        "divided",
        "however",
        "content",
        "nonspecific",
        "along",
        "dimension",
        "world",
        "time",
        "location",
        "respect",
        "general",
        "question",
        "different",
        "family",
        "new",
        "relativism",
        "generated",
        "taxonomy",
        "offer",
        "view",
        "fall",
        "within",
        "category",
        "new",
        "relativism",
        "view",
        "endorses",
        "truthrelativist",
        "semantics",
        "previously",
        "outlined",
        "utterance",
        "token",
        "domain",
        "discourse",
        "discourse",
        "predicate",
        "personal",
        "taste",
        "lasersohn",
        "kölbel",
        "epistemic",
        "modal",
        "egan",
        "egan",
        "hawthorne",
        "weatherson",
        "macfarlane",
        "b",
        "stephenson",
        "future",
        "contingent",
        "macfarlane",
        "indicative",
        "conditionals",
        "weatherson",
        "kolodny",
        "macfarlane",
        "gradable",
        "adjective",
        "richard",
        "deontic",
        "modal",
        "kolodny",
        "macfarlane",
        "macfarlane",
        "ch",
        "knowledge",
        "attribution",
        "richard",
        "macfarlane",
        "b",
        "c",
        "motivation",
        "truthrelativism",
        "domain",
        "include",
        "various",
        "consideration",
        "unique",
        "domain",
        "consider",
        "argument",
        "new",
        "relativism",
        "four",
        "domain",
        "following",
        "section"
    ]
}