{
    "main_text": "The Middle Ages\n3. The Middle Ages\n\n\nThe rest of the history to be described in this entry is a\ncross-fertilization of these two traditions or lines of thought. In\nthe patristic period, or the period of the early Fathers, it was\npredominantly Plato and the Stoics amongst the Greek philosophers\nwhose influence was felt. The Eastern and Western parts of the\nChristian church split during the period, and the Eastern church\nremained more comfortable than the Western with language about humans\nbeing deified (in Greek theosis). In the Western church,\nAugustine (354–430) emphasized the gap between the world we are\nin as resident aliens and our citizenship in the heavenly Jerusalem,\nand even in our next life the distance between ourselves and God. He\ndescribes in the\nConfessions the route by which his heart or will, together\nwith his understanding, moved from paganism through Neo-Platonism to\nChristianity. The Neo-Platonists (such as Plotinus, 205-270) taught a\nworld-system of emanation, whereby the One (like Plato's Form of the\nGood) flowed into Intellect (the realm of the Forms) and from there\ninto the World-Soul and individual souls, where it encountered the\nrealm of bodies, from where it returned to itself (‘the flight of the\nalone to the alone’). Augustine accepted that the Platonists taught,\nlike the beginning of the prologue of John, that the Word (in\nGreek, logos) is with God and is God, since the Intellect is\nthe mediating principle between the One and the Many (John\n1:1–5). Augustine held that Plato had asserted that the supreme good,\npossession of which alone gives us blessedness, is God, ‘and therefore\n(Plato) thought that to be a philosopher is to be a lover of God.’\n(De Civ. Dei VIII.8). But the Platonists did not teach, like\nthe end of John's prologue, that the Word is made flesh in\nJesus Christ, and so they did not have access to the way to salvation\nrevealed in Christ or God's grace to us through Christ's\ndeath. Nonetheless, it is surprising how far Augustine can go in\nrapprochement. The Forms, he says, are in the mind of God and God uses\nthem in the creation of the world. Human beings were created for union\nwith God, but they have the freedom to turn towards themselves instead\nof God. If they turn to God, they can receive divine illumination\nthrough a personal intuition of the eternal standards (the Forms). If\nthey turn towards themselves, they will lose the sense of the order of\ncreation, which the order of their own loves should reflect. Augustine\ngives primacy to the virtue of loving what ought to be loved,\nespecially God. In his homily on I John 4:8, he says, ‘Love\nand do what you will.’ But this is not a denial of the moral law. He\nheld that humans who truly love God will also act in accord with the\nother precepts of divine and moral law; though love not merely\nfulfills the cardinal virtues (wisdom, justice, courage and\ntemperance) but transforms them by supernatural grace.\n\n\nThe influence of Augustine in the subsequent history of ethics\nresulted from the fact that it was his synthesis of Christianity (the\nofficial religion of the Roman Empire after 325) and Greek philosophy\nthat survived the destruction of the Western Roman Empire, especially\nin the monasteries where the texts were still read. Boethius\n(c. 480–524) gave us the definition of the concept of\n‘person’ that has been fundamental to ethical theory. To\nunderstand this, we need to go back into the history of the\ndevelopment of the doctrine of the Trinity. The church had to explain\nhow the Father, the Son and the Holy Spirit could be distinct and yet\nnot three different gods. They used, in Latin, the\nterm persona, which means ‘role’ but which was\nalso used by the grammarians to distinguish what we call ‘first\nperson, second person and third person’ pronouns and\nverb-forms. The same human being can be first person ‘I’,\nsecond person ‘you’, and third person ‘he’ or\n‘she’, depending on the relations in which he or she\nstands. The doctrine of the Trinity comes to be understood in terms of\nthree persons, one God, with the persons standing in different\nrelations to each other. But then this term ‘person’ is\nalso used to understand the relation of the second person's divinity\nto his humanity. The church came to talk about one person with two\nnatures, the person standing under the natures. This had the merit of\nnot making either the humanity or the divinity less essential to who\nJesus was. Plato and Aristotle did not have any term that we can\ntranslate ‘person’ in the modern sense, as\nsomeone (as opposed to something) that stands under\nall his or her attributes. Boethius, however, defines\n‘person’ as ‘individual substance of rational\nnature,’ a key step in the introduction of our present\nconcept.\n\n\nIn the West knowledge of most of Aristotle's texts was lost, but not\nin the East. They were translated into Syriac, and Arabic, and\neventually (in Muslim Spain) into Latin, and re-entered Christian\nEurope in the twelfth century accompanied by translations of the great\nArabic commentaries. In the initial prophetic period of Islam (CE\n610–32) the Qur'an was given to Mohammad, who explained it and\nreinforced it through his own teachings and practices. The notion of\nGod's (Allah's) commands is again central, and our obedience to these\ncommands is the basis of our eventual resurrection. Disputes about\npolitical authority in the period after Mohammad's death led to the\nsplit between Sunnis and Shiites. Within Sunni Muslim ethical theory\nin the Middle Ages two major alternative ways developed of thinking\nabout the relation between morality and religion. The first, the\nMu'tazilite, was given its most developed statement by ‘Abd\nal-Jabbar from Basra (d. 1025). ‘Abd al-Jabbar defines a\nwrongful act as one that deserves blame, and holds that the right and\nwrong character of acts is known immediately to human reason,\nindependently of revelation. These standards that we learn from reason\napply also to God, so that we can use them to judge what God is and is\nnot commanding us to do. He also teaches that humans have freedom, in\nthe sense of a power to perform both an act and its opposite, though\nnot at the same time. (For Mu'tazilite ethical theory, see Sophia\nVasalou,\nMoral Agents and Their Deserts: The Character of Mu'tazilite\nEthics and George Hourani, Islamic Rationalism: The Ethics of\n‘Abd al-Jabbar.) The second alternative was taught by al-Ashari\n(d. 935), who started off as a Mu'tazilite, but came to reject their\nview. He insists that God is subject to none and to no standard that\ncan fix bounds for Him. Nothing can be wrong for God, who sets the\nstandard of right and wrong. This means that ‘if God declared lying to\nbe right, it would be right, and if He commanded it, none could\ngainsay Him’ (The Theology of al-Ash'ari, 169-70). With\nrespect to our freedom, he holds that God gives us only the power to\ndo the act (not its opposite) and this power is simultaneous to the\nact and does not precede it. A figure contemporary with al-Ashari, but\nin some ways intermediate between Mu'tazilites and Asharites, is\nal-Maturidi of Samarqand (d. 944). He holds that because humans have\nthe tendency in their nature towards ugly or harmful actions as well\nas beautiful or beneficial ones, God has to reveal to us by command\nwhat to pursue and what to avoid. He also teaches that God gives us\ntwo different kinds of power, both the power simultaneous with the act\n(which is simply to do the act) and the power preceding the act (to\nchoose either the act or its opposite). (For the work of al-Maturidi,\nsee Ulrich Rudolph, Al-Maturidi and Sunni Theology in\nSamarkand.)\n\n\nMedieval reflection within Judaism about morality and religion has, as\nits most significant figure, Maimonides (d. 1204) who was born in\nMuslim Spain, and was familiar with much of the Muslim discussion of\nthese questions. The Guide of the Perplexed was written for\nyoung men who had read Aristotle and were worried about the tension\nbetween the views of the philosopher and their faith. Maimonides\nteaches that we do indeed have some access just as human beings to the\nrightness and wrongness of acts; but what renders conforming to these\nstandards obligatory is that God reveals them in special\nrevelation. The laws are obligatory whether we understand the reasons\nfor them or not, but sometimes we do see how it is beneficial to obey,\nand Maimonides is remarkably fertile in providing such reasons.\n\n\nThe reentry of Aristotle into Europe caused a rebirth (a\n‘renaissance’), but it also gave rise to a crisis, because\nit threatened to undermine the harmony established from the time of\nAugustine between the authority of reason, as represented by Greek\nphilosophy, and the authority of faith, as represented by the\ndoctrines of the Christian church. There were especially three\n‘errors of Aristotle’ that seemed threatening: his\nteaching that the world was eternal, his apparent denial of personal\nimmortality, and his denial of God's active agency in the world. (See,\nfor example, Bonaventure,\nIn Hexaemeron, VI.5 and In II Sent., lib. II, d.1,\npars 1, a.1, q.2.) These three issues (‘the world, the soul, and God’)\nbecome in one form or another the focus of philosophical thought for\nthe next six centuries.\n\n\nThomas Aquinas (c. 1224–74) undertook the project of synthesis\nbetween Aristotle and Christianity, though his version of Christianity\nwas already deeply influenced by Augustine, and so by\nNeo-Platonism. Aquinas, like Aristotle, emphasized the ends\n(vegetative, animal and typically human) given to humans in the\nnatural order. He described both the cardinal virtues and the\ntheological virtues of faith, hope and love, but he did not feel the\ntension that current virtue ethicists sometimes feel between virtue\nand the following of rules or principles. The rules governing how we\nought to live are known, some of them by revelation, some of them by\nordinary natural experience and rational reflection. But Aquinas\nthought these rules consistent in the determination of our good, since\nGod only requires us to do what is consistent with our own\ngood. Aquinas's theory is eudaimonist; ‘And so the will\nnaturally tends towards its own last end, for every man naturally\nwills beatitude. And from this natural willing are caused all other\nwillings, since whatever a man wills, he wills on account of the\nend.’ (Summa Theologiae I, q.60. a.2) God's will is not\nexercised by arbitrary fiat; but what is good for some human being can\nbe understood as fitting for this kind of agent, in relation to the\npurpose this agent intends to accomplish, in the real environment of\nthe action, including other persons individually and collectively. The\nprinciples of natural moral law are the universal judgments made by\nright reasoning about the kinds of actions that are morally\nappropriate and inappropriate for human agents. They are thus, at\nleast in principle and at a highly general level, deducible from human\nnature. Aquinas held that reason, in knowing these principles, is\nparticipating in the eternal law, which is in the mind of God\n(Summa Theologiae I, q.91. a.2). Aquinas was not initially\nsuccessful in persuading the church to embrace Aristotle. In 1277 the\nBishop of Paris condemned 219 propositions (not all Thomist),\nincluding the thesis that a person virtuous in Aristotle's terms\n‘is sufficiently disposed for eternal happiness.’ But in\nthe Counter-Reformation, the synthesis which Aquinas achieved became\nauthoritative in Roman Catholic education.\n\n\nAquinas was a Dominican friar. The other major order of friars, the\nFranciscan, had its own school of philosophy, starting with\nBonaventure (c. 1217–74), who held that while we can learn from\nboth Plato and Aristotle, and both are also in error, the greater\nerror is Aristotle's. One other major figure from this tradition is\nJohn Duns Scotus (literally John from Duns, the Scot,\nc. 1266–1308), and there are three significant differences\nbetween him and Aquinas on the relation between morality and\nreligion. First, Scotus is not a eudaimonist. He takes a double\naccount of motivation from Anselm (1033–1109), who made the\ndistinction between two affections of the will, the affection for\nadvantage (an inclination towards one's own happiness and perfection)\nand the affection for justice (an inclination towards what is good in\nitself independent of advantage) (Anselm, De Concordia 3.11,\n281:7–10; De Casu Diaboli 12, 255:8–11). Original\nsin is a ranking of advantage over justice, which needs to be reversed\nby God's assistance before we can be pleasing to God. Scotus says that\nwe should be willing to sacrifice our own happiness for God if God\nwere to require this. Second, he does not think that the moral law is\nself-evident or necessary. He takes the first table to be necessary,\nsince it derives (except for the ‘every seventh day’\nprovision of the command about the Sabbath) from the necessary\nprinciple that God is to be loved. But the second table is contingent,\nthough fitting our nature, and God could prescribe different commands\neven for human beings (Ord. I, dist. 44). One of his examples\nis the proscription on theft, which applies only to beings with\nproperty, and so not necessarily to human beings (since they are not\nnecessarily propertied). God also gives dispensation from the\ncommands, according to Scotus, for example the command to Abraham to\nkill Isaac (Ord III, suppl. Dist. 37). Third, Scotus denied\nthe application of teleology to non-intentional nature, and thus\ndeparted from the Aristotelian and Thomist view. This does not mean\nthat we have no natural end or\ntelos, but that this end is related to the intention of God\nin the same way a human artisan intends his or her products to have a\ncertain purpose (see Hare 2006, chapter 2).\n",
    "section_title": "3. The Middle Ages",
    "entry_title": "Religion and Morality",
    "hierarchy_title": "Religion and Morality || The Middle Ages",
    "tokenized_text": [
        "middle",
        "age",
        "middle",
        "age",
        "rest",
        "history",
        "described",
        "entry",
        "crossfertilization",
        "two",
        "tradition",
        "line",
        "thought",
        "patristic",
        "period",
        "period",
        "early",
        "father",
        "predominantly",
        "plato",
        "stoic",
        "amongst",
        "greek",
        "philosopher",
        "whose",
        "influence",
        "felt",
        "eastern",
        "western",
        "part",
        "christian",
        "church",
        "split",
        "period",
        "eastern",
        "church",
        "remained",
        "comfortable",
        "western",
        "language",
        "human",
        "deified",
        "greek",
        "theosis",
        "western",
        "church",
        "augustine",
        "emphasized",
        "gap",
        "world",
        "resident",
        "alien",
        "citizenship",
        "heavenly",
        "jerusalem",
        "even",
        "next",
        "life",
        "distance",
        "god",
        "describes",
        "confession",
        "route",
        "heart",
        "together",
        "understanding",
        "moved",
        "paganism",
        "neoplatonism",
        "christianity",
        "neoplatonists",
        "plotinus",
        "taught",
        "worldsystem",
        "emanation",
        "whereby",
        "one",
        "like",
        "plato",
        "s",
        "form",
        "good",
        "flowed",
        "intellect",
        "realm",
        "form",
        "worldsoul",
        "individual",
        "soul",
        "encountered",
        "realm",
        "body",
        "returned",
        "flight",
        "alone",
        "alone",
        "augustine",
        "accepted",
        "platonist",
        "taught",
        "like",
        "beginning",
        "prologue",
        "john",
        "word",
        "greek",
        "logo",
        "god",
        "god",
        "since",
        "intellect",
        "mediating",
        "principle",
        "one",
        "many",
        "john",
        "augustine",
        "held",
        "plato",
        "asserted",
        "supreme",
        "good",
        "possession",
        "alone",
        "give",
        "u",
        "blessedness",
        "god",
        "therefore",
        "plato",
        "thought",
        "philosopher",
        "lover",
        "god",
        "de",
        "civ",
        "dei",
        "viii",
        "platonist",
        "teach",
        "like",
        "end",
        "john",
        "s",
        "prologue",
        "word",
        "made",
        "flesh",
        "jesus",
        "christ",
        "access",
        "way",
        "salvation",
        "revealed",
        "christ",
        "god",
        "s",
        "grace",
        "u",
        "christ",
        "s",
        "death",
        "nonetheless",
        "surprising",
        "far",
        "augustine",
        "go",
        "rapprochement",
        "form",
        "say",
        "mind",
        "god",
        "god",
        "us",
        "creation",
        "world",
        "human",
        "being",
        "created",
        "union",
        "god",
        "freedom",
        "turn",
        "towards",
        "instead",
        "god",
        "turn",
        "god",
        "receive",
        "divine",
        "illumination",
        "personal",
        "intuition",
        "eternal",
        "standard",
        "form",
        "turn",
        "towards",
        "lose",
        "sense",
        "order",
        "creation",
        "order",
        "love",
        "reflect",
        "augustine",
        "give",
        "primacy",
        "virtue",
        "loving",
        "ought",
        "loved",
        "especially",
        "god",
        "homily",
        "john",
        "say",
        "love",
        "will",
        "denial",
        "moral",
        "law",
        "held",
        "human",
        "truly",
        "love",
        "god",
        "also",
        "act",
        "accord",
        "precept",
        "divine",
        "moral",
        "law",
        "though",
        "love",
        "merely",
        "fulfills",
        "cardinal",
        "virtue",
        "wisdom",
        "justice",
        "courage",
        "temperance",
        "transforms",
        "supernatural",
        "grace",
        "influence",
        "augustine",
        "subsequent",
        "history",
        "ethic",
        "resulted",
        "fact",
        "synthesis",
        "christianity",
        "official",
        "religion",
        "roman",
        "empire",
        "greek",
        "philosophy",
        "survived",
        "destruction",
        "western",
        "roman",
        "empire",
        "especially",
        "monastery",
        "text",
        "still",
        "read",
        "boethius",
        "c",
        "gave",
        "u",
        "definition",
        "concept",
        "person",
        "fundamental",
        "ethical",
        "theory",
        "understand",
        "need",
        "go",
        "back",
        "history",
        "development",
        "doctrine",
        "trinity",
        "church",
        "explain",
        "father",
        "son",
        "holy",
        "spirit",
        "could",
        "distinct",
        "yet",
        "three",
        "different",
        "god",
        "used",
        "latin",
        "term",
        "persona",
        "mean",
        "role",
        "also",
        "used",
        "grammarian",
        "distinguish",
        "call",
        "first",
        "person",
        "second",
        "person",
        "third",
        "person",
        "pronoun",
        "verbforms",
        "human",
        "first",
        "person",
        "second",
        "person",
        "third",
        "person",
        "depending",
        "relation",
        "stand",
        "doctrine",
        "trinity",
        "come",
        "understood",
        "term",
        "three",
        "person",
        "one",
        "god",
        "person",
        "standing",
        "different",
        "relation",
        "term",
        "person",
        "also",
        "used",
        "understand",
        "relation",
        "second",
        "person",
        "s",
        "divinity",
        "humanity",
        "church",
        "came",
        "talk",
        "one",
        "person",
        "two",
        "nature",
        "person",
        "standing",
        "nature",
        "merit",
        "making",
        "either",
        "humanity",
        "divinity",
        "le",
        "essential",
        "jesus",
        "plato",
        "aristotle",
        "term",
        "translate",
        "person",
        "modern",
        "sense",
        "someone",
        "opposed",
        "something",
        "stand",
        "attribute",
        "boethius",
        "however",
        "defines",
        "person",
        "individual",
        "substance",
        "rational",
        "nature",
        "key",
        "step",
        "introduction",
        "present",
        "concept",
        "west",
        "knowledge",
        "aristotle",
        "s",
        "text",
        "lost",
        "east",
        "translated",
        "syriac",
        "arabic",
        "eventually",
        "muslim",
        "spain",
        "latin",
        "reentered",
        "christian",
        "europe",
        "twelfth",
        "century",
        "accompanied",
        "translation",
        "great",
        "arabic",
        "commentary",
        "initial",
        "prophetic",
        "period",
        "islam",
        "ce",
        "quran",
        "given",
        "mohammad",
        "explained",
        "reinforced",
        "teaching",
        "practice",
        "notion",
        "god",
        "s",
        "allah",
        "s",
        "command",
        "central",
        "obedience",
        "command",
        "basis",
        "eventual",
        "resurrection",
        "dispute",
        "political",
        "authority",
        "period",
        "mohammad",
        "s",
        "death",
        "led",
        "split",
        "sunni",
        "shiite",
        "within",
        "sunni",
        "muslim",
        "ethical",
        "theory",
        "middle",
        "age",
        "two",
        "major",
        "alternative",
        "way",
        "developed",
        "thinking",
        "relation",
        "morality",
        "religion",
        "first",
        "mutazilite",
        "given",
        "developed",
        "statement",
        "abd",
        "aljabbar",
        "basra",
        "d",
        "abd",
        "aljabbar",
        "defines",
        "wrongful",
        "act",
        "one",
        "deserves",
        "blame",
        "hold",
        "right",
        "wrong",
        "character",
        "act",
        "known",
        "immediately",
        "human",
        "reason",
        "independently",
        "revelation",
        "standard",
        "learn",
        "reason",
        "apply",
        "also",
        "god",
        "use",
        "judge",
        "god",
        "commanding",
        "u",
        "also",
        "teach",
        "human",
        "freedom",
        "sense",
        "power",
        "perform",
        "act",
        "opposite",
        "though",
        "time",
        "mutazilite",
        "ethical",
        "theory",
        "see",
        "sophia",
        "vasalou",
        "moral",
        "agent",
        "desert",
        "character",
        "mutazilite",
        "ethic",
        "george",
        "hourani",
        "islamic",
        "rationalism",
        "ethic",
        "abd",
        "aljabbar",
        "second",
        "alternative",
        "taught",
        "alashari",
        "d",
        "started",
        "mutazilite",
        "came",
        "reject",
        "view",
        "insists",
        "god",
        "subject",
        "none",
        "standard",
        "fix",
        "bound",
        "nothing",
        "wrong",
        "god",
        "set",
        "standard",
        "right",
        "wrong",
        "mean",
        "god",
        "declared",
        "lying",
        "right",
        "would",
        "right",
        "commanded",
        "none",
        "could",
        "gainsay",
        "theology",
        "alashari",
        "respect",
        "freedom",
        "hold",
        "god",
        "give",
        "u",
        "power",
        "act",
        "opposite",
        "power",
        "simultaneous",
        "act",
        "precede",
        "figure",
        "contemporary",
        "alashari",
        "way",
        "intermediate",
        "mutazilites",
        "asharites",
        "almaturidi",
        "samarqand",
        "d",
        "hold",
        "human",
        "tendency",
        "nature",
        "towards",
        "ugly",
        "harmful",
        "action",
        "well",
        "beautiful",
        "beneficial",
        "one",
        "god",
        "reveal",
        "u",
        "command",
        "pursue",
        "avoid",
        "also",
        "teach",
        "god",
        "give",
        "u",
        "two",
        "different",
        "kind",
        "power",
        "power",
        "simultaneous",
        "act",
        "simply",
        "act",
        "power",
        "preceding",
        "act",
        "choose",
        "either",
        "act",
        "opposite",
        "work",
        "almaturidi",
        "see",
        "ulrich",
        "rudolph",
        "almaturidi",
        "sunni",
        "theology",
        "samarkand",
        "medieval",
        "reflection",
        "within",
        "judaism",
        "morality",
        "religion",
        "significant",
        "figure",
        "maimonides",
        "d",
        "born",
        "muslim",
        "spain",
        "familiar",
        "much",
        "muslim",
        "discussion",
        "question",
        "guide",
        "perplexed",
        "written",
        "young",
        "men",
        "read",
        "aristotle",
        "worried",
        "tension",
        "view",
        "philosopher",
        "faith",
        "maimonides",
        "teach",
        "indeed",
        "access",
        "human",
        "being",
        "rightness",
        "wrongness",
        "act",
        "render",
        "conforming",
        "standard",
        "obligatory",
        "god",
        "reveals",
        "special",
        "revelation",
        "law",
        "obligatory",
        "whether",
        "understand",
        "reason",
        "sometimes",
        "see",
        "beneficial",
        "obey",
        "maimonides",
        "remarkably",
        "fertile",
        "providing",
        "reason",
        "reentry",
        "aristotle",
        "europe",
        "caused",
        "rebirth",
        "renaissance",
        "also",
        "gave",
        "rise",
        "crisis",
        "threatened",
        "undermine",
        "harmony",
        "established",
        "time",
        "augustine",
        "authority",
        "reason",
        "represented",
        "greek",
        "philosophy",
        "authority",
        "faith",
        "represented",
        "doctrine",
        "christian",
        "church",
        "especially",
        "three",
        "error",
        "aristotle",
        "seemed",
        "threatening",
        "teaching",
        "world",
        "eternal",
        "apparent",
        "denial",
        "personal",
        "immortality",
        "denial",
        "god",
        "s",
        "active",
        "agency",
        "world",
        "see",
        "example",
        "bonaventure",
        "hexaemeron",
        "vi",
        "ii",
        "sent",
        "lib",
        "ii",
        "d",
        "par",
        "a",
        "q",
        "three",
        "issue",
        "world",
        "soul",
        "god",
        "become",
        "one",
        "form",
        "another",
        "focus",
        "philosophical",
        "thought",
        "next",
        "six",
        "century",
        "thomas",
        "aquinas",
        "c",
        "undertook",
        "project",
        "synthesis",
        "aristotle",
        "christianity",
        "though",
        "version",
        "christianity",
        "already",
        "deeply",
        "influenced",
        "augustine",
        "neoplatonism",
        "aquinas",
        "like",
        "aristotle",
        "emphasized",
        "end",
        "vegetative",
        "animal",
        "typically",
        "human",
        "given",
        "human",
        "natural",
        "order",
        "described",
        "cardinal",
        "virtue",
        "theological",
        "virtue",
        "faith",
        "hope",
        "love",
        "feel",
        "tension",
        "current",
        "virtue",
        "ethicist",
        "sometimes",
        "feel",
        "virtue",
        "following",
        "rule",
        "principle",
        "rule",
        "governing",
        "ought",
        "live",
        "known",
        "revelation",
        "ordinary",
        "natural",
        "experience",
        "rational",
        "reflection",
        "aquinas",
        "thought",
        "rule",
        "consistent",
        "determination",
        "good",
        "since",
        "god",
        "requires",
        "u",
        "consistent",
        "good",
        "aquinas",
        "s",
        "theory",
        "eudaimonist",
        "naturally",
        "tends",
        "towards",
        "last",
        "end",
        "every",
        "man",
        "naturally",
        "will",
        "beatitude",
        "natural",
        "willing",
        "caused",
        "willing",
        "since",
        "whatever",
        "man",
        "will",
        "will",
        "account",
        "end",
        "summa",
        "theologiae",
        "q",
        "a",
        "god",
        "s",
        "exercised",
        "arbitrary",
        "fiat",
        "good",
        "human",
        "understood",
        "fitting",
        "kind",
        "agent",
        "relation",
        "purpose",
        "agent",
        "intends",
        "accomplish",
        "real",
        "environment",
        "action",
        "including",
        "person",
        "individually",
        "collectively",
        "principle",
        "natural",
        "moral",
        "law",
        "universal",
        "judgment",
        "made",
        "right",
        "reasoning",
        "kind",
        "action",
        "morally",
        "appropriate",
        "inappropriate",
        "human",
        "agent",
        "thus",
        "least",
        "principle",
        "highly",
        "general",
        "level",
        "deducible",
        "human",
        "nature",
        "aquinas",
        "held",
        "reason",
        "knowing",
        "principle",
        "participating",
        "eternal",
        "law",
        "mind",
        "god",
        "summa",
        "theologiae",
        "q",
        "a",
        "aquinas",
        "initially",
        "successful",
        "persuading",
        "church",
        "embrace",
        "aristotle",
        "bishop",
        "paris",
        "condemned",
        "proposition",
        "thomist",
        "including",
        "thesis",
        "person",
        "virtuous",
        "aristotle",
        "s",
        "term",
        "sufficiently",
        "disposed",
        "eternal",
        "happiness",
        "counterreformation",
        "synthesis",
        "aquinas",
        "achieved",
        "became",
        "authoritative",
        "roman",
        "catholic",
        "education",
        "aquinas",
        "dominican",
        "friar",
        "major",
        "order",
        "friar",
        "franciscan",
        "school",
        "philosophy",
        "starting",
        "bonaventure",
        "c",
        "held",
        "learn",
        "plato",
        "aristotle",
        "also",
        "error",
        "greater",
        "error",
        "aristotle",
        "s",
        "one",
        "major",
        "figure",
        "tradition",
        "john",
        "dun",
        "scotus",
        "literally",
        "john",
        "dun",
        "scot",
        "c",
        "three",
        "significant",
        "difference",
        "aquinas",
        "relation",
        "morality",
        "religion",
        "first",
        "scotus",
        "eudaimonist",
        "take",
        "double",
        "account",
        "motivation",
        "anselm",
        "made",
        "distinction",
        "two",
        "affection",
        "affection",
        "advantage",
        "inclination",
        "towards",
        "one",
        "s",
        "happiness",
        "perfection",
        "affection",
        "justice",
        "inclination",
        "towards",
        "good",
        "independent",
        "advantage",
        "anselm",
        "de",
        "concordia",
        "de",
        "casu",
        "diaboli",
        "original",
        "sin",
        "ranking",
        "advantage",
        "justice",
        "need",
        "reversed",
        "god",
        "s",
        "assistance",
        "pleasing",
        "god",
        "scotus",
        "say",
        "willing",
        "sacrifice",
        "happiness",
        "god",
        "god",
        "require",
        "second",
        "think",
        "moral",
        "law",
        "selfevident",
        "necessary",
        "take",
        "first",
        "table",
        "necessary",
        "since",
        "derives",
        "except",
        "every",
        "seventh",
        "day",
        "provision",
        "command",
        "sabbath",
        "necessary",
        "principle",
        "god",
        "loved",
        "second",
        "table",
        "contingent",
        "though",
        "fitting",
        "nature",
        "god",
        "could",
        "prescribe",
        "different",
        "command",
        "even",
        "human",
        "being",
        "ord",
        "dist",
        "one",
        "example",
        "proscription",
        "theft",
        "applies",
        "being",
        "property",
        "necessarily",
        "human",
        "being",
        "since",
        "necessarily",
        "propertied",
        "god",
        "also",
        "give",
        "dispensation",
        "command",
        "according",
        "scotus",
        "example",
        "command",
        "abraham",
        "kill",
        "isaac",
        "ord",
        "iii",
        "suppl",
        "dist",
        "third",
        "scotus",
        "denied",
        "application",
        "teleology",
        "nonintentional",
        "nature",
        "thus",
        "departed",
        "aristotelian",
        "thomist",
        "view",
        "mean",
        "natural",
        "end",
        "telos",
        "end",
        "related",
        "intention",
        "god",
        "way",
        "human",
        "artisan",
        "intends",
        "product",
        "certain",
        "purpose",
        "see",
        "hare",
        "chapter"
    ]
}