{
    "main_text": "\n\n\nContemporary epistemology of religion may conveniently be treated as a\ndebate over whether evidentialism applies to religious\nbeliefs, or whether we should instead adopt a more permissive\nepistemology. Here evidentialism is the initially plausible position\nthat a belief is justified only if “it is proportioned to the\nevidence”. For example, suppose a local weather forecaster has\nnoticed that over the two hundred years since records began a wetter\nthan average Winter is followed in 85% of cases by a hotter than\naverage Summer. Then, assuming for simplicity that the records are\nreliable, the forecaster is justified in believing with less than full\nconfidence that this Winter, which is wetter than average, will be\nfollowed by a hotter than average Summer. But evidentialism implies\nthat it would not be justified to have full belief, that is belief\nwith 100% confidence. Again, consider someone who has a hunch\nthat this Summer will be hotter than average but cannot justify that\nhunch further. Hunches are not considered evidence, so the belief is\nnot considered justified. If, however, the huncher can cite a good\ntrack record of hunches about the weather that have turned out correct\nthen the belief would be considered justified. For although hunches\nare not considered evidence, memories about past hunches are, as are\nthe observations that corroborated the past hunches.\n Evidentialism implies that full religious belief is justified only\nif there is conclusive evidence for it. It follows that if the\narguments for there being a God, including any arguments from\nreligious experience, are at best probable ones, no one would be\njustified in having a full belief that there is a God. And the same\nholds for other religious beliefs, such as the belief that God is not\njust good in a utilitarian fashion but loving, or the belief that\nthere is an afterlife.  Likewise it would be unjustified to believe\neven with less than full confidence that, say, Krishna is divine or\nthat Mohammed is the last and most authoritative of the prophets,\nunless a good case can be made for these claims from the evidence.\n Evidentialism, then, sets rather high standards for justification,\nstandards that the majority do not, it would seem, meet when it comes\nto religious beliefs, where many rely on “faith”, which is\nmore like the forecaster’s hunch about the weather than the argument\nfrom past climate records. Many others take some body of scripture,\nsuch as the Bible or the Koran as of special authority, contrary to\nthe evidentialist treatment of these as just like any other\nbooks making various claims.  Are these standards too high?\n This century has seen a turn in the debate, with emphasis on the\nimplications of disagreement, “How can sincere intelligent\npeople disagree? Should not we all suspend judgement?”\n",
    "section_title": "Preamble",
    "entry_title": "The Epistemology of Religion",
    "hierarchy_title": "The Epistemology of Religion || Preamble",
    "tokenized_text": [
        "contemporary",
        "epistemology",
        "religion",
        "may",
        "conveniently",
        "treated",
        "debate",
        "whether",
        "evidentialism",
        "applies",
        "religious",
        "belief",
        "whether",
        "instead",
        "adopt",
        "permissive",
        "epistemology",
        "evidentialism",
        "initially",
        "plausible",
        "position",
        "belief",
        "justified",
        "proportioned",
        "evidence",
        "example",
        "suppose",
        "local",
        "weather",
        "forecaster",
        "noticed",
        "two",
        "hundred",
        "year",
        "since",
        "record",
        "began",
        "wetter",
        "average",
        "winter",
        "followed",
        "case",
        "hotter",
        "average",
        "summer",
        "assuming",
        "simplicity",
        "record",
        "reliable",
        "forecaster",
        "justified",
        "believing",
        "le",
        "full",
        "confidence",
        "winter",
        "wetter",
        "average",
        "followed",
        "hotter",
        "average",
        "summer",
        "evidentialism",
        "implies",
        "would",
        "justified",
        "full",
        "belief",
        "belief",
        "confidence",
        "consider",
        "someone",
        "hunch",
        "summer",
        "hotter",
        "average",
        "justify",
        "hunch",
        "hunch",
        "considered",
        "evidence",
        "belief",
        "considered",
        "justified",
        "however",
        "huncher",
        "cite",
        "good",
        "track",
        "record",
        "hunch",
        "weather",
        "turned",
        "correct",
        "belief",
        "would",
        "considered",
        "justified",
        "although",
        "hunch",
        "considered",
        "evidence",
        "memory",
        "past",
        "hunch",
        "observation",
        "corroborated",
        "past",
        "hunch",
        "evidentialism",
        "implies",
        "full",
        "religious",
        "belief",
        "justified",
        "conclusive",
        "evidence",
        "follows",
        "argument",
        "god",
        "including",
        "argument",
        "religious",
        "experience",
        "best",
        "probable",
        "one",
        "one",
        "would",
        "justified",
        "full",
        "belief",
        "god",
        "hold",
        "religious",
        "belief",
        "belief",
        "god",
        "good",
        "utilitarian",
        "fashion",
        "loving",
        "belief",
        "afterlife",
        "likewise",
        "would",
        "unjustified",
        "believe",
        "even",
        "le",
        "full",
        "confidence",
        "say",
        "krishna",
        "divine",
        "mohammed",
        "last",
        "authoritative",
        "prophet",
        "unless",
        "good",
        "case",
        "made",
        "claim",
        "evidence",
        "evidentialism",
        "set",
        "rather",
        "high",
        "standard",
        "justification",
        "standard",
        "majority",
        "would",
        "seem",
        "meet",
        "come",
        "religious",
        "belief",
        "many",
        "rely",
        "faith",
        "like",
        "forecaster",
        "hunch",
        "weather",
        "argument",
        "past",
        "climate",
        "record",
        "many",
        "others",
        "take",
        "body",
        "scripture",
        "bible",
        "koran",
        "special",
        "authority",
        "contrary",
        "evidentialist",
        "treatment",
        "like",
        "book",
        "making",
        "various",
        "claim",
        "standard",
        "high",
        "century",
        "seen",
        "turn",
        "debate",
        "emphasis",
        "implication",
        "disagreement",
        "sincere",
        "intelligent",
        "people",
        "disagree",
        "suspend",
        "judgement"
    ]
}