{
    "main_text": "Three Arguments for the Doctrine of Religious Restraint || The Argument from Respect\n3.3 The Argument from Respect\n\n\nThe third and most prominent argument for the DRR is the argument\nfrom respect. Here we focus on only one formulation of the\nargument, which has affinities with a version of the argument offered by\nCharles Larmore (see Larmore 1987).[10]\n\n\n The argument from respect runs as such:\n\nEach citizen deserves to be respected as a person.\nIf each citizen deserves to be respected as a person, then there\nis a powerful prima facie presumption against the permissibility of\nstate coercion.  (On this basic claim, See Gaus, 2010, Gaus and Vallier, 2009.) \nSo, there is a powerful prima facie presumption against the\npermissibility of state coercion.\nIf the presumption against state coercion is to be overcome (as\nit sometimes must be), then state coercion must be justified to those\nwho are coerced.\nIf state coercion must be justified to those who are coerced,\nthen any coercive law that lacks a plausible secular rationale is\nmorally illegitimate (as there will be many to whom such coercion\ncannot be justified).\nIf any coercive law that lacks a plausible secular rationale is\nmorally illegitimate, then a citizen ought not to support any law that\nhe believes to have only a religious rationale.\n\n\n\nHowever, on the assumption that the antecedent to premise (4) is\ntrue—that there are cases in which the state must\ncoerce—it follows (given a few other assumptions) that:\n\nThe DRR is true.\n\n\n\nThat is, the DRR follows from a constraint on what makes for the moral\nlegitimacy of state coercion—viz., that a morally legitimate law\ncannot be such that there are those to whom it cannot be\njustified—and from the claim that citizens should not support\nany law that they realize lacks moral legitimacy.\n\n\n The argument from respect has received its\nfair share of criticism from liberal critics. Perhaps the most\ntroubling of these criticisms is that the argument undermines the\nlegitimacy of basic liberal commitments. To appreciate the thrust\nof this objection, focus for a moment on the notion being a\ncoercive law that is justified to an agent, to which the argument\nappeals. How should we understand this concept?\nOne natural suggestion is this:\n\n\nA coercive law is justified to an agent only if he is reasonable and\nhas sufficient reasons from his own perspective to support\nit.\n\n\nNow consider a coercive law that protects fundamental liberal\ncommitments, such as the right to exercise religious freedom. Is\nthis law justified to each citizen of a liberal democracy?\nLiberal critics answer: no. For there appear to be reasonable\ncitizens who have no good reason from their own perspective to affirm\nit. Consider, for example, a figure such as the Islamic\nintellectual Sayyid Qutb. While in prison, Qutb wrote an\nintelligent, informed, and morally serious commentary on the Koran in\nwhich he laid the ills of modern society at the feet of Christianity\nand liberal\n democracy.[11]\nThe only way to extricate ourselves\nfrom the problems spawned by liberal democracy, Qutb argued, is to\nimplement shariah or Islamic legal code, which implies that the state\nshould not protect a robust right to religious freedom. In short, Qutb \narticulates what is, from his point of view, a\ncompelling theological rationale against any law that authorizes the\nstate to protect a robust right to religious freedom. If respect\nfor persons requires that each coercive law be justified to those\nreasonable persons subject to that law, and if a person such as Qutb\nwere a citizen of a liberal democracy, then the argument from respect\nimplies that laws that protect the right to religious freedom are\nmorally illegitimate, as they lack moral justification—at least\nfor agents such as\n Qutb.[12]\nAnd for a defender of the standard\nview, this is certainly an unwelcome result.\n\n\n This kind of case leads liberal critics of\nthe standard view to deny the fourth premise of the argument from\nrespect. If they are correct, it is not the case that coercive\nlaws must be justified to those who must obey them (in the sense of\njustified to introduced earlier). Although having a\npersuasive justification would certainly be desirable and a significant\nmoral achievement, the liberal critics maintain that the moral\nlegitimacy of a law is not a function of whether it can be justified to\nall citizens—not even to all reasonable citizens. Some\ncitizens are simply not in a strong epistemic position to recognize\nthat certain coercive laws are morally legitimate. In such cases,\nliberal critics claim that we should do what we can to try to convince\nthese citizens that they have been misled. And we should\ncertainly do what we can to accommodate their concerns in ways that are\nconsistent with basic liberal commitments (see Swaine 2006). At\nthe end of the day, though, we may have no moral option but to coerce\nreasonable and epistemically competent peers whom we recognize have no\nreason from their perspective to recognize the legitimacy of the laws\nto which they are subject. However, if a coercive law can be\nmorally legitimate even though some citizens are not in a strong\nposition to recognize that it is, then (in principle) a coercive law\ncan be justified even if it requires a religious rationale. After\nall, if religious reasons can be adequate (a possibility that advocates\nof the standard view do not typically deny), then they are just the\nsort of reason that can be adequate without being recognized as such\neven by our morally serious and epistemically competent\npeers.\n\n\nIt should be conceded, however, that this objection to the argument\nfrom respect relies on a particular understanding of what it is for a\ncoercive law to be justified to an agent. Is there another account of\nthis concept that would aid the advocates of the standard view?\nPerhaps. Nearly all theorists have argued that a coercive law's being\njustified to an agent does not require that that agent actually have\nwhat he regards as an adequate reason to support it (see Gaus 1996,\nAudi 1997, and Vallier 2014).  “The question is not what people\ndo endorse but what people have reason to endorse” (Gaus 2010,\n23).  Better to understand the concept being a coercive law that\nis justified to an agent along the following lines:\n\n\nA coercive law is justified to an agent only if, were he reasonable\nand adequately informed, then he would have a sufficient reason from\nhis own perspective to support it.\n\n\nGiven this weaker, counterfactual construal of what makes for\nmorally permissible coercion, the argument from respect needn't\nundermine the legitimacy of the state's using coercion to protect basic\nliberal commitments. For we can always construe those\ncounterfactual conditions in such a way that those who in fact reject\nbasic liberal commitments would affirm them if they were more\nreasonable and better informed. In that case, using coercion to\nensure that they comply with basic liberal commitments would not be to\ndisrespect them. If this is correct, the prospect of there being\nfigures such as Qutb, who reject the right to religious freedom, need\nnot undermine the legitimacy of the state's coercive enforcement of\nthat basic liberal commitment.\n\n\n Liberal critics find this response\nunsatisfactory. After all, if this alternative construal of the\nargument is to succeed, it must be the case not only that:\n\n\nWere an agent such as Qutb reasonable and adequately informed, he\nwould have sufficient reason from his own perspective to support\ncoercive laws that protect the right to religious liberty;\n\n\nbut also:\n\n\nEvery coercive law that protects basic liberal commitments is such\nthat adequately informed and reasonable secular citizens would have a\nsufficient secular reason to support it.\n\n\nThese two claims, however, are highly controversial. Let us\nconsider the first. Were we to ask Qutb whether he would have\nreasons to support laws that protect a robust right to religious\nfreedom if he were adequately informed and reasonable, surely he would\nsay: no. Moreover, he would claim that his compatriots would\nreject the liberal protection of such a right if they were\nadequately informed about the divine authorship of the Quran and the\nproper rules of its interpretation. While Qutb's say-so doesn't\nsettle the issue of who would believe what in improved conditions,\nliberal critics maintain that his response indicates just how\ncomplicated the issue under consideration is. Among other things,\nto establish that Qutb is wrong it seems that one would have to deny\nthe truth of various theological claims on which Qutb relies when he\ndetermines that he would reject the right to religious freedom were he\nadequately informed and reasonable. That would require advocates\nof the standard view to take a stand on contested religious\nissues. However, liberal critics point out that defenders of the\nstandard view have been wary of explicitly denying the truth of\nreligious claims, especially those found within the major theistic\nreligions.\n\n\n Turn now to the second claim.\nSome liberal critics of the standard view, such as Nicholas\nWolterstorff, maintain that at the heart of liberal democracy is the\nclaim that some coercive laws function to protect inherent human\nrights. Wolterstorff further argues that attempts to ground these\nrights in merely secular considerations fail. Only by appeal to\nexplicitly theistic assumptions, Wolterstorff argues, can we locate an\nadequate justification for the ascription of these rights (see\nWolterstorff 2008, Pt. III as well as Perry 2003). What would\na reasonable and adequately informed secular citizen make of\nWolterstorff's arguments? Would he endorse them?\n\n\n It's difficult to say. Liberal\ncritics maintain that we are simply not in good epistemic position to\njudge the reasons an agent would have to support laws that protect\nbasic liberal commitments were he better informed and more\nreasonable. More exactly, liberal critics maintain that we are\nnot in a good epistemic position to determine whether a secular agent\nwho is reasonable and better informed would endorse or reject the type\nof theistic commitments that philosophers such as Wolterstorff claim\njustify the ascription of natural human rights. The problem is\nthat we don't really have any idea how radically a person would change\nhis views were he to occupy these conditions. The main, and still\nunresolved, question for this version of the standard view, then, is\nwhether there is some coherent and non-arbitrary construal of the\nrelevant counterfactual conditions that is strong enough to prohibit\nexclusive reliance on religious reasons but weak enough to allow for\nthe justification of basic liberal\ncommitments.  (See Vallier 2014 for the most recent and sophisticated\n attempt to specify those counterfactual conditions.)\n",
    "section_title": "3.3 The Argument from Respect",
    "entry_title": "Religion and Political Theory",
    "hierarchy_title": "Religion and Political Theory || Three Arguments for the Doctrine of Religious Restraint || The Argument from Respect",
    "tokenized_text": [
        "three",
        "argument",
        "doctrine",
        "religious",
        "restraint",
        "argument",
        "respect",
        "argument",
        "respect",
        "third",
        "prominent",
        "argument",
        "drr",
        "argument",
        "respect",
        "focus",
        "one",
        "formulation",
        "argument",
        "affinity",
        "version",
        "argument",
        "offered",
        "charles",
        "larmore",
        "see",
        "larmore",
        "argument",
        "respect",
        "run",
        "citizen",
        "deserves",
        "respected",
        "person",
        "citizen",
        "deserves",
        "respected",
        "person",
        "powerful",
        "prima",
        "facie",
        "presumption",
        "permissibility",
        "state",
        "coercion",
        "basic",
        "claim",
        "see",
        "gaus",
        "gaus",
        "vallier",
        "powerful",
        "prima",
        "facie",
        "presumption",
        "permissibility",
        "state",
        "coercion",
        "presumption",
        "state",
        "coercion",
        "overcome",
        "sometimes",
        "must",
        "state",
        "coercion",
        "must",
        "justified",
        "coerced",
        "state",
        "coercion",
        "must",
        "justified",
        "coerced",
        "coercive",
        "law",
        "lack",
        "plausible",
        "secular",
        "rationale",
        "morally",
        "illegitimate",
        "many",
        "coercion",
        "justified",
        "coercive",
        "law",
        "lack",
        "plausible",
        "secular",
        "rationale",
        "morally",
        "illegitimate",
        "citizen",
        "ought",
        "support",
        "law",
        "belief",
        "religious",
        "rationale",
        "however",
        "assumption",
        "antecedent",
        "premise",
        "truethat",
        "case",
        "state",
        "must",
        "coerceit",
        "follows",
        "given",
        "assumption",
        "drr",
        "true",
        "drr",
        "follows",
        "constraint",
        "make",
        "moral",
        "legitimacy",
        "state",
        "coercionviz",
        "morally",
        "legitimate",
        "law",
        "justifiedand",
        "claim",
        "citizen",
        "support",
        "law",
        "realize",
        "lack",
        "moral",
        "legitimacy",
        "argument",
        "respect",
        "received",
        "fair",
        "share",
        "criticism",
        "liberal",
        "critic",
        "perhaps",
        "troubling",
        "criticism",
        "argument",
        "undermines",
        "legitimacy",
        "basic",
        "liberal",
        "commitment",
        "appreciate",
        "thrust",
        "objection",
        "focus",
        "moment",
        "notion",
        "coercive",
        "law",
        "justified",
        "agent",
        "argument",
        "appeal",
        "understand",
        "concept",
        "one",
        "natural",
        "suggestion",
        "coercive",
        "law",
        "justified",
        "agent",
        "reasonable",
        "sufficient",
        "reason",
        "perspective",
        "support",
        "consider",
        "coercive",
        "law",
        "protects",
        "fundamental",
        "liberal",
        "commitment",
        "right",
        "exercise",
        "religious",
        "freedom",
        "law",
        "justified",
        "citizen",
        "liberal",
        "democracy",
        "liberal",
        "critic",
        "answer",
        "appear",
        "reasonable",
        "citizen",
        "good",
        "reason",
        "perspective",
        "affirm",
        "consider",
        "example",
        "figure",
        "islamic",
        "intellectual",
        "sayyid",
        "qutb",
        "prison",
        "qutb",
        "wrote",
        "intelligent",
        "informed",
        "morally",
        "serious",
        "commentary",
        "koran",
        "laid",
        "ill",
        "modern",
        "society",
        "foot",
        "christianity",
        "liberal",
        "democracy",
        "way",
        "extricate",
        "problem",
        "spawned",
        "liberal",
        "democracy",
        "qutb",
        "argued",
        "implement",
        "shariah",
        "islamic",
        "legal",
        "code",
        "implies",
        "state",
        "protect",
        "robust",
        "right",
        "religious",
        "freedom",
        "short",
        "qutb",
        "articulates",
        "point",
        "view",
        "compelling",
        "theological",
        "rationale",
        "law",
        "authorizes",
        "state",
        "protect",
        "robust",
        "right",
        "religious",
        "freedom",
        "respect",
        "person",
        "requires",
        "coercive",
        "law",
        "justified",
        "reasonable",
        "person",
        "subject",
        "law",
        "person",
        "qutb",
        "citizen",
        "liberal",
        "democracy",
        "argument",
        "respect",
        "implies",
        "law",
        "protect",
        "right",
        "religious",
        "freedom",
        "morally",
        "illegitimate",
        "lack",
        "moral",
        "justificationat",
        "least",
        "agent",
        "qutb",
        "defender",
        "standard",
        "view",
        "certainly",
        "unwelcome",
        "result",
        "kind",
        "case",
        "lead",
        "liberal",
        "critic",
        "standard",
        "view",
        "deny",
        "fourth",
        "premise",
        "argument",
        "respect",
        "correct",
        "case",
        "coercive",
        "law",
        "must",
        "justified",
        "must",
        "obey",
        "sense",
        "justified",
        "introduced",
        "earlier",
        "although",
        "persuasive",
        "justification",
        "would",
        "certainly",
        "desirable",
        "significant",
        "moral",
        "achievement",
        "liberal",
        "critic",
        "maintain",
        "moral",
        "legitimacy",
        "law",
        "function",
        "whether",
        "justified",
        "citizensnot",
        "even",
        "reasonable",
        "citizen",
        "citizen",
        "simply",
        "strong",
        "epistemic",
        "position",
        "recognize",
        "certain",
        "coercive",
        "law",
        "morally",
        "legitimate",
        "case",
        "liberal",
        "critic",
        "claim",
        "try",
        "convince",
        "citizen",
        "misled",
        "certainly",
        "accommodate",
        "concern",
        "way",
        "consistent",
        "basic",
        "liberal",
        "commitment",
        "see",
        "swaine",
        "end",
        "day",
        "though",
        "may",
        "moral",
        "option",
        "coerce",
        "reasonable",
        "epistemically",
        "competent",
        "peer",
        "recognize",
        "reason",
        "perspective",
        "recognize",
        "legitimacy",
        "law",
        "subject",
        "however",
        "coercive",
        "law",
        "morally",
        "legitimate",
        "even",
        "though",
        "citizen",
        "strong",
        "position",
        "recognize",
        "principle",
        "coercive",
        "law",
        "justified",
        "even",
        "requires",
        "religious",
        "rationale",
        "religious",
        "reason",
        "adequate",
        "possibility",
        "advocate",
        "standard",
        "view",
        "typically",
        "deny",
        "sort",
        "reason",
        "adequate",
        "without",
        "recognized",
        "even",
        "morally",
        "serious",
        "epistemically",
        "competent",
        "peer",
        "conceded",
        "however",
        "objection",
        "argument",
        "respect",
        "relies",
        "particular",
        "understanding",
        "coercive",
        "law",
        "justified",
        "agent",
        "another",
        "account",
        "concept",
        "would",
        "aid",
        "advocate",
        "standard",
        "view",
        "perhaps",
        "nearly",
        "theorist",
        "argued",
        "coercive",
        "law",
        "s",
        "justified",
        "agent",
        "require",
        "agent",
        "actually",
        "regard",
        "adequate",
        "reason",
        "support",
        "see",
        "gaus",
        "audi",
        "vallier",
        "question",
        "people",
        "endorse",
        "people",
        "reason",
        "endorse",
        "gaus",
        "better",
        "understand",
        "concept",
        "coercive",
        "law",
        "justified",
        "agent",
        "along",
        "following",
        "line",
        "coercive",
        "law",
        "justified",
        "agent",
        "reasonable",
        "adequately",
        "informed",
        "would",
        "sufficient",
        "reason",
        "perspective",
        "support",
        "given",
        "weaker",
        "counterfactual",
        "construal",
        "make",
        "morally",
        "permissible",
        "coercion",
        "argument",
        "respect",
        "need",
        "nt",
        "undermine",
        "legitimacy",
        "state",
        "s",
        "using",
        "coercion",
        "protect",
        "basic",
        "liberal",
        "commitment",
        "always",
        "construe",
        "counterfactual",
        "condition",
        "way",
        "fact",
        "reject",
        "basic",
        "liberal",
        "commitment",
        "would",
        "affirm",
        "reasonable",
        "better",
        "informed",
        "case",
        "using",
        "coercion",
        "ensure",
        "comply",
        "basic",
        "liberal",
        "commitment",
        "would",
        "disrespect",
        "correct",
        "prospect",
        "figure",
        "qutb",
        "reject",
        "right",
        "religious",
        "freedom",
        "need",
        "undermine",
        "legitimacy",
        "state",
        "s",
        "coercive",
        "enforcement",
        "basic",
        "liberal",
        "commitment",
        "liberal",
        "critic",
        "find",
        "response",
        "unsatisfactory",
        "alternative",
        "construal",
        "argument",
        "succeed",
        "must",
        "case",
        "agent",
        "qutb",
        "reasonable",
        "adequately",
        "informed",
        "would",
        "sufficient",
        "reason",
        "perspective",
        "support",
        "coercive",
        "law",
        "protect",
        "right",
        "religious",
        "liberty",
        "also",
        "every",
        "coercive",
        "law",
        "protects",
        "basic",
        "liberal",
        "commitment",
        "adequately",
        "informed",
        "reasonable",
        "secular",
        "citizen",
        "would",
        "sufficient",
        "secular",
        "reason",
        "support",
        "two",
        "claim",
        "however",
        "highly",
        "controversial",
        "let",
        "u",
        "consider",
        "first",
        "ask",
        "qutb",
        "whether",
        "would",
        "reason",
        "support",
        "law",
        "protect",
        "robust",
        "right",
        "religious",
        "freedom",
        "adequately",
        "informed",
        "reasonable",
        "surely",
        "would",
        "say",
        "moreover",
        "would",
        "claim",
        "compatriot",
        "would",
        "reject",
        "liberal",
        "protection",
        "right",
        "adequately",
        "informed",
        "divine",
        "authorship",
        "quran",
        "proper",
        "rule",
        "interpretation",
        "qutb",
        "s",
        "sayso",
        "nt",
        "settle",
        "issue",
        "would",
        "believe",
        "improved",
        "condition",
        "liberal",
        "critic",
        "maintain",
        "response",
        "indicates",
        "complicated",
        "issue",
        "consideration",
        "among",
        "thing",
        "establish",
        "qutb",
        "wrong",
        "seems",
        "one",
        "would",
        "deny",
        "truth",
        "various",
        "theological",
        "claim",
        "qutb",
        "relies",
        "determines",
        "would",
        "reject",
        "right",
        "religious",
        "freedom",
        "adequately",
        "informed",
        "reasonable",
        "would",
        "require",
        "advocate",
        "standard",
        "view",
        "take",
        "stand",
        "contested",
        "religious",
        "issue",
        "however",
        "liberal",
        "critic",
        "point",
        "defender",
        "standard",
        "view",
        "wary",
        "explicitly",
        "denying",
        "truth",
        "religious",
        "claim",
        "especially",
        "found",
        "within",
        "major",
        "theistic",
        "religion",
        "turn",
        "second",
        "claim",
        "liberal",
        "critic",
        "standard",
        "view",
        "nicholas",
        "wolterstorff",
        "maintain",
        "heart",
        "liberal",
        "democracy",
        "claim",
        "coercive",
        "law",
        "function",
        "protect",
        "inherent",
        "human",
        "right",
        "wolterstorff",
        "argues",
        "attempt",
        "ground",
        "right",
        "merely",
        "secular",
        "consideration",
        "fail",
        "appeal",
        "explicitly",
        "theistic",
        "assumption",
        "wolterstorff",
        "argues",
        "locate",
        "adequate",
        "justification",
        "ascription",
        "right",
        "see",
        "wolterstorff",
        "pt",
        "iii",
        "well",
        "perry",
        "would",
        "reasonable",
        "adequately",
        "informed",
        "secular",
        "citizen",
        "make",
        "wolterstorff",
        "s",
        "argument",
        "would",
        "endorse",
        "s",
        "difficult",
        "say",
        "liberal",
        "critic",
        "maintain",
        "simply",
        "good",
        "epistemic",
        "position",
        "judge",
        "reason",
        "agent",
        "would",
        "support",
        "law",
        "protect",
        "basic",
        "liberal",
        "commitment",
        "better",
        "informed",
        "reasonable",
        "exactly",
        "liberal",
        "critic",
        "maintain",
        "good",
        "epistemic",
        "position",
        "determine",
        "whether",
        "secular",
        "agent",
        "reasonable",
        "better",
        "informed",
        "would",
        "endorse",
        "reject",
        "type",
        "theistic",
        "commitment",
        "philosopher",
        "wolterstorff",
        "claim",
        "justify",
        "ascription",
        "natural",
        "human",
        "right",
        "problem",
        "nt",
        "really",
        "idea",
        "radically",
        "person",
        "would",
        "change",
        "view",
        "occupy",
        "condition",
        "main",
        "still",
        "unresolved",
        "question",
        "version",
        "standard",
        "view",
        "whether",
        "coherent",
        "nonarbitrary",
        "construal",
        "relevant",
        "counterfactual",
        "condition",
        "strong",
        "enough",
        "prohibit",
        "exclusive",
        "reliance",
        "religious",
        "reason",
        "weak",
        "enough",
        "allow",
        "justification",
        "basic",
        "liberal",
        "commitment",
        "see",
        "vallier",
        "recent",
        "sophisticated",
        "attempt",
        "specify",
        "counterfactual",
        "condition"
    ]
}