{
    "main_text": "Epistemological Issues\n4. The Diverse Objects of Religious Experience\n\nJust as there are a variety of religions, each with its own claims\nabout the nature of reality, there are a variety of objects and states\nof affairs that the subjects of these experiences claim to be aware\nof. Much analytic philosophy of religion has been done in Europe and\nthe nations descended from Europe, so much of the discussion has been\nin terms of God as conceived of in the Jewish, Christian, and Islamic\ntraditions. In those traditions, the object of religious experiences\nis typically God himself, understood as an eternal, omniscient,\nomnipotent, free, and perfectly good spirit. God, for reasons of his\nown, reveals himself to people, some of them unbidden (like Moses,\nMuhammad, and Saint Paul), and some because they have undertaken a\nrigorous practice to draw closer to him (like the mystics). To say\nthat an experience comes unbidden is not to say that nothing the\nsubject has done has prepared her, or primed her, for the experience\n(see Luhrmann 2012); it is only to claim that the subject has not\nundertaken any practice aimed at producing a religious experience. In\nsuch experiences, God frequently delivers a message at the same time,\nbut he need not. He is always identifiable as the same being who\nrevealed himself to others in the same tradition. Other experiences\ncan be of angels, demons, saints, heaven, hell, or other religiously\nsignificant objects.\n\nIn other traditions, it is not necessarily a personal being who is the\nobject of the experience, or even a positive being at all. In the\ntraditions that find their origin in the Indian\nsubcontinent—chiefly Hinduism, Buddhism, and Jainism—the\nobject of religious experiences is some basic fact or feature of\nreality, rather than some entity separate from the universe. In the\northodox Hindu traditions, one may certainly have an experience of a\ngod or some other supernatural entity (like Arjuna’s encounter\nwith Krishna in the Bhagavad Gita), but a great many important kinds\nof experiences are of Brahman, and its identity with the self. In\nYoga, which is based in the Samkhya understanding of the nature of\nthings, the mystical practice of yoga leads to a calming and stilling\nof the mind, which allows the yogi to apprehend directly that he or\nshe is not identical to, or even causally connected with, the physical\nbody, and this realization is what liberates him or her from\nsuffering.\n\nIn Theravada Buddhism, the goal of meditation is to “see things\nas they are,” which is to see them as unsatisfactory,\nimpermanent, and not-self (Gowans 2003, 191). The meditator, as he or\nshe makes progress along the way, sheds various delusions and\nattachments. The last one to go is the delusion that he or she is a\nself. To see this is to see all of reality as made up of sequences of\nmomentary events, each causally dependent on the ones that went\nbefore. There are no abiding substances, and no eternal souls. Seeing\nreality that way extinguishes the fires of craving, and liberates the\nmeditator from the necessity of rebirth (Laumakis 2008,\n158–161). Seeing things as they are involves removing from the\nmind all the delusions that stand in the way of such seeing, which is\ndone by meditation practices that develop the meditator’s\nmastery of his or her own mind. The type of meditation that brings\nthis mastery and allows the meditator to see the true nature of things\nis called Vipassana (insight) meditation. It typically\ninvolves some object of meditation, which can be some feature of the\nmeditator him- or herself, some feature of the physical or mental\nworld, or some abstraction, which then becomes the focus of the\nmeditator’s concentration and examination. In the end, it is\nhoped, the meditator will see in the object the unsatisfactory and\nimpermanent nature of things and that there is no self to be found in\nthem. At the moment of that insight, nirvana is achieved.\nWhile the experience of nirvana is essentially the realization of a\nkind of insight, it is also accompanied by other experiential\nelements, especially of the cessation of negative mental states.\nNirvana is described in the Buddhist canon as the extinction of the\nfires of desire. The Theravada tradition teaches other kinds of\nmeditation that can help the meditator make progress, but the final\ngoal can’t be achieved without vipassana\nmeditation.\n\nIn the Mahayana Buddhist traditions, this idea of the constantly\nfluctuating nature of the universe is extended in various ways. For\nsome, even those momentary events that make up the flow of the world\nare understood to be empty of inherent existence (the idea of inherent\nexistence is understood differently in different traditions) to the\npoint that what one sees in the enlightenment experience is the\nultimate emptiness (sunyata) of all things. In the Yogacara\nschool of Mahayana Buddhism, this is understood as emptiness of\nexternal existence; that is, to see things as they are is to see them\nas all mind-dependent. In the Zen school of Mahayana Buddhism, the\nenlightenment experience (kensho) reveals that reality\ncontains no distinctions or dualities. Since concepts and language\nalways involve distinctions, which always involve duality, the insight\nso gained cannot be achieved conceptually or expressed linguistically.\nIn all Mahayana schools, what brings enlightenment is direct\nrealization of sunyata as a basic fact about reality.\n\nThe situation is somewhat more complicated in the Chinese traditions.\nThe idea of religious experience seems to be almost completely absent\nin the Confucian tradition; the social world looms large, and the idea\nof an ultimate reality that needs to be experienced becomes much less\nprominent. Before the arrival of Buddhism in China, Confucianism was\nprimarily a political and ethical system, with no particular concern\nwith the transcendent (though people who identified themselves as\nConfucians frequently engaged in Chinese folk religious practices).\nNevertheless, meditation (and therefore something that could be called\n“religious experience”) did come to play a role in\nConfucian practice in the tenth century, as Confucian thought began to\nbe influenced by Buddhist and Daoist thought. The resulting view is\nknown as Neo-Confucianism. Neo-Confucianism retains the Mencian\ndoctrine that human beings are by nature good, but in need of\npurification. Since goodness resides in every person, then examination\nof oneself should reveal the nature of goodness, through the\nexperience of the vital force within (qi). The form of\nmeditation that arises from this line of thought (“quiet\nsitting” or “sitting and forgetting”) are very like\nBuddhist vipassana meditation, but there is no value placed on any\nparticular insight gained, though one can experience the principle of\nunity (li) behind the world. Success is measured in gradual\nmoral improvement.\n\nThe Daoist ideal is to come to an understanding of the Dao, the\nfundamental nature of reality that explains all things in the world,\nand live according to it. Knowledge of the Dao is essential to the\ngood life, but this knowledge cannot be learned from discourses, or\ntransmitted by teaching. It is only known by experiential\nacquaintance. The Dao gives the universe a kind of grain, or flow,\ngoing against which causes human difficulty. The good human life is\nthen one that respects the flow of Dao, and goes along with it. This\nis what is meant by “life in accordance with nature,” and\nis the insight behind the Daoist admonition of wu wei,\nsometimes glossed as “actionless action.” By paying attention to\nreality as it presents itself, a person can learn what the Dao is,\nand can experience unity with it. This picture of reality, along with\nthe picture of how one can come to know it, heavily influenced the\ndevelopment of Ch’an Buddhism, which became Zen.\n\nAll of the same epistemological problems that arise for theism will\nalso arise for these other traditions, though in different forms.\nThat is, one can ask of experiences of Brahman, Sunyata, the Dao, and\nanything else that is the object of religious experience whether there\nis any reason to think the experience is veridical. One can also ask\nwhether testimony about those experiences carries the same weight as\nordinary experience. Naturalistic explanations can also be offered to\nthese experiences. It is equally true that the responses that have\nbeen offered to these objections in a theistic context are also\navailable to defenders of non-theistic religious experience.\n",
    "section_title": "4. The Diverse Objects of Religious Experience",
    "entry_title": "Religious Experience",
    "hierarchy_title": "Religious Experience || Epistemological Issues",
    "tokenized_text": [
        "epistemological",
        "issue",
        "diverse",
        "object",
        "religious",
        "experience",
        "variety",
        "religion",
        "claim",
        "nature",
        "reality",
        "variety",
        "object",
        "state",
        "affair",
        "subject",
        "experience",
        "claim",
        "aware",
        "much",
        "analytic",
        "philosophy",
        "religion",
        "done",
        "europe",
        "nation",
        "descended",
        "europe",
        "much",
        "discussion",
        "term",
        "god",
        "conceived",
        "jewish",
        "christian",
        "islamic",
        "tradition",
        "tradition",
        "object",
        "religious",
        "experience",
        "typically",
        "god",
        "understood",
        "eternal",
        "omniscient",
        "omnipotent",
        "free",
        "perfectly",
        "good",
        "spirit",
        "god",
        "reason",
        "reveals",
        "people",
        "unbidden",
        "like",
        "moses",
        "muhammad",
        "saint",
        "paul",
        "undertaken",
        "rigorous",
        "practice",
        "draw",
        "closer",
        "like",
        "mystic",
        "say",
        "experience",
        "come",
        "unbidden",
        "say",
        "nothing",
        "subject",
        "done",
        "prepared",
        "primed",
        "experience",
        "see",
        "luhrmann",
        "claim",
        "subject",
        "undertaken",
        "practice",
        "aimed",
        "producing",
        "religious",
        "experience",
        "experience",
        "god",
        "frequently",
        "delivers",
        "message",
        "time",
        "need",
        "always",
        "identifiable",
        "revealed",
        "others",
        "tradition",
        "experience",
        "angel",
        "demon",
        "saint",
        "heaven",
        "hell",
        "religiously",
        "significant",
        "object",
        "tradition",
        "necessarily",
        "personal",
        "object",
        "experience",
        "even",
        "positive",
        "tradition",
        "find",
        "origin",
        "indian",
        "subcontinentchiefly",
        "hinduism",
        "buddhism",
        "jainismthe",
        "object",
        "religious",
        "experience",
        "basic",
        "fact",
        "feature",
        "reality",
        "rather",
        "entity",
        "separate",
        "universe",
        "orthodox",
        "hindu",
        "tradition",
        "one",
        "may",
        "certainly",
        "experience",
        "god",
        "supernatural",
        "entity",
        "like",
        "arjuna",
        "encounter",
        "krishna",
        "bhagavad",
        "gita",
        "great",
        "many",
        "important",
        "kind",
        "experience",
        "brahman",
        "identity",
        "self",
        "yoga",
        "based",
        "samkhya",
        "understanding",
        "nature",
        "thing",
        "mystical",
        "practice",
        "yoga",
        "lead",
        "calming",
        "stilling",
        "mind",
        "allows",
        "yogi",
        "apprehend",
        "directly",
        "identical",
        "even",
        "causally",
        "connected",
        "physical",
        "body",
        "realization",
        "liberates",
        "suffering",
        "theravada",
        "buddhism",
        "goal",
        "meditation",
        "see",
        "thing",
        "see",
        "unsatisfactory",
        "impermanent",
        "notself",
        "gowans",
        "meditator",
        "make",
        "progress",
        "along",
        "way",
        "shed",
        "various",
        "delusion",
        "attachment",
        "last",
        "one",
        "go",
        "delusion",
        "self",
        "see",
        "see",
        "reality",
        "made",
        "sequence",
        "momentary",
        "event",
        "causally",
        "dependent",
        "one",
        "went",
        "abiding",
        "substance",
        "eternal",
        "soul",
        "seeing",
        "reality",
        "way",
        "extinguishes",
        "fire",
        "craving",
        "liberates",
        "meditator",
        "necessity",
        "rebirth",
        "laumakis",
        "seeing",
        "thing",
        "involves",
        "removing",
        "mind",
        "delusion",
        "stand",
        "way",
        "seeing",
        "done",
        "meditation",
        "practice",
        "develop",
        "meditator",
        "mastery",
        "mind",
        "type",
        "meditation",
        "brings",
        "mastery",
        "allows",
        "meditator",
        "see",
        "true",
        "nature",
        "thing",
        "called",
        "vipassana",
        "insight",
        "meditation",
        "typically",
        "involves",
        "object",
        "meditation",
        "feature",
        "meditator",
        "him",
        "feature",
        "physical",
        "mental",
        "world",
        "abstraction",
        "becomes",
        "focus",
        "meditator",
        "concentration",
        "examination",
        "end",
        "hoped",
        "meditator",
        "see",
        "object",
        "unsatisfactory",
        "impermanent",
        "nature",
        "thing",
        "self",
        "found",
        "moment",
        "insight",
        "nirvana",
        "achieved",
        "experience",
        "nirvana",
        "essentially",
        "realization",
        "kind",
        "insight",
        "also",
        "accompanied",
        "experiential",
        "element",
        "especially",
        "cessation",
        "negative",
        "mental",
        "state",
        "nirvana",
        "described",
        "buddhist",
        "canon",
        "extinction",
        "fire",
        "desire",
        "theravada",
        "tradition",
        "teach",
        "kind",
        "meditation",
        "help",
        "meditator",
        "make",
        "progress",
        "final",
        "goal",
        "achieved",
        "without",
        "vipassana",
        "meditation",
        "mahayana",
        "buddhist",
        "tradition",
        "idea",
        "constantly",
        "fluctuating",
        "nature",
        "universe",
        "extended",
        "various",
        "way",
        "even",
        "momentary",
        "event",
        "make",
        "flow",
        "world",
        "understood",
        "empty",
        "inherent",
        "existence",
        "idea",
        "inherent",
        "existence",
        "understood",
        "differently",
        "different",
        "tradition",
        "point",
        "one",
        "see",
        "enlightenment",
        "experience",
        "ultimate",
        "emptiness",
        "sunyata",
        "thing",
        "yogacara",
        "school",
        "mahayana",
        "buddhism",
        "understood",
        "emptiness",
        "external",
        "existence",
        "see",
        "thing",
        "see",
        "minddependent",
        "zen",
        "school",
        "mahayana",
        "buddhism",
        "enlightenment",
        "experience",
        "kensho",
        "reveals",
        "reality",
        "contains",
        "distinction",
        "duality",
        "since",
        "concept",
        "language",
        "always",
        "involve",
        "distinction",
        "always",
        "involve",
        "duality",
        "insight",
        "gained",
        "achieved",
        "conceptually",
        "expressed",
        "linguistically",
        "mahayana",
        "school",
        "brings",
        "enlightenment",
        "direct",
        "realization",
        "sunyata",
        "basic",
        "fact",
        "reality",
        "situation",
        "somewhat",
        "complicated",
        "chinese",
        "tradition",
        "idea",
        "religious",
        "experience",
        "seems",
        "almost",
        "completely",
        "absent",
        "confucian",
        "tradition",
        "social",
        "world",
        "loom",
        "large",
        "idea",
        "ultimate",
        "reality",
        "need",
        "experienced",
        "becomes",
        "much",
        "le",
        "prominent",
        "arrival",
        "buddhism",
        "china",
        "confucianism",
        "primarily",
        "political",
        "ethical",
        "system",
        "particular",
        "concern",
        "transcendent",
        "though",
        "people",
        "identified",
        "confucian",
        "frequently",
        "engaged",
        "chinese",
        "folk",
        "religious",
        "practice",
        "nevertheless",
        "meditation",
        "therefore",
        "something",
        "could",
        "called",
        "religious",
        "experience",
        "come",
        "play",
        "role",
        "confucian",
        "practice",
        "tenth",
        "century",
        "confucian",
        "thought",
        "began",
        "influenced",
        "buddhist",
        "daoist",
        "thought",
        "resulting",
        "view",
        "known",
        "neoconfucianism",
        "neoconfucianism",
        "retains",
        "mencian",
        "doctrine",
        "human",
        "being",
        "nature",
        "good",
        "need",
        "purification",
        "since",
        "goodness",
        "resides",
        "every",
        "person",
        "examination",
        "oneself",
        "reveal",
        "nature",
        "goodness",
        "experience",
        "vital",
        "force",
        "within",
        "qi",
        "form",
        "meditation",
        "arises",
        "line",
        "thought",
        "quiet",
        "sitting",
        "sitting",
        "forgetting",
        "like",
        "buddhist",
        "vipassana",
        "meditation",
        "value",
        "placed",
        "particular",
        "insight",
        "gained",
        "though",
        "one",
        "experience",
        "principle",
        "unity",
        "li",
        "behind",
        "world",
        "success",
        "measured",
        "gradual",
        "moral",
        "improvement",
        "daoist",
        "ideal",
        "come",
        "understanding",
        "dao",
        "fundamental",
        "nature",
        "reality",
        "explains",
        "thing",
        "world",
        "live",
        "according",
        "knowledge",
        "dao",
        "essential",
        "good",
        "life",
        "knowledge",
        "learned",
        "discourse",
        "transmitted",
        "teaching",
        "known",
        "experiential",
        "acquaintance",
        "dao",
        "give",
        "universe",
        "kind",
        "grain",
        "flow",
        "going",
        "cause",
        "human",
        "difficulty",
        "good",
        "human",
        "life",
        "one",
        "respect",
        "flow",
        "dao",
        "go",
        "along",
        "meant",
        "life",
        "accordance",
        "nature",
        "insight",
        "behind",
        "daoist",
        "admonition",
        "wu",
        "wei",
        "sometimes",
        "glossed",
        "actionless",
        "action",
        "paying",
        "attention",
        "reality",
        "present",
        "person",
        "learn",
        "dao",
        "experience",
        "unity",
        "picture",
        "reality",
        "along",
        "picture",
        "one",
        "come",
        "know",
        "heavily",
        "influenced",
        "development",
        "ch",
        "buddhism",
        "became",
        "zen",
        "epistemological",
        "problem",
        "arise",
        "theism",
        "also",
        "arise",
        "tradition",
        "though",
        "different",
        "form",
        "one",
        "ask",
        "experience",
        "brahman",
        "sunyata",
        "dao",
        "anything",
        "else",
        "object",
        "religious",
        "experience",
        "whether",
        "reason",
        "think",
        "experience",
        "veridical",
        "one",
        "also",
        "ask",
        "whether",
        "testimony",
        "experience",
        "carry",
        "weight",
        "ordinary",
        "experience",
        "naturalistic",
        "explanation",
        "also",
        "offered",
        "experience",
        "equally",
        "true",
        "response",
        "offered",
        "objection",
        "theistic",
        "context",
        "also",
        "available",
        "defender",
        "nontheistic",
        "religious",
        "experience"
    ]
}