{
    "main_text": "Religious Diversity and Epistemic Obligation\n3. Religious Diversity and Epistemic Obligation\n\nNo philosopher denies that the awareness (realization) of seeming\nreligious diversity sometimes does in fact have an impact on\nexclusivists—from causing minor uneasiness to significantly\nreducing their level of confidence in the truth of certain beliefs to\nprecipitating belief abandonment. This is simply an empirical claim\nabout psychological states and behaviors (Alston 1988, 442–446;\nPlantinga 2000, 189).\n\nHow should, though, exclusivists coming to an awareness of religious\ndiversity—the awareness that seemingly sincere, knowledgeable\nindividuals differ with them on an issue of religious\nsignificance—respond to the reality of such diversity? How\nshould, for instance, the devout Hindu or Christian who comes to\nrealize that others who seem as knowledgeable and devout hold\nincompatible religious perspectives respond? Or how should Christians\nwho believe the Bible clearly portrays a God with total control over\nall aspects of reality respond to the realization that other seemingly\nsincere, devout, “Bible-believing” Christians see the Bible as\nclearly portraying a God who has chosen not to control what occurs in\nthose contexts in which humans have been granted meaningful moral\nfreedom? Can exclusivists justifiably disregard such diversity? If\nnot, are exclusivists under some obligation to attempt to resolve such\nepistemic conflicts—engage in belief assessment (or\nreassessment) with openness to possible revision? Or would it at least\nbe a good idea to do so?\n\nWithin the relevant “epistemology of disagreement\nliterature,” we find significantly different responses. There\nare, of course, religious individuals (and groups) who believe it is\ninappropriate to subject religious beliefs to assessment of any sort.\nCertain individuals (sometimes called fideists) have argued, for\ninstance, that religious beliefs are not of a type properly subjected\nto rational assessment and/or that assessing such beliefs demonstrates\na lack of faith (Peterson et al. 2013, 65–69). But few\nphilosophers currently hold this position. Most maintain that\nexclusivists have at least the right to assess their beliefs in the\nface of religious diversity.\n\nThere continues, however, to be significant debate on whether\nexclusivists are under an obligation to engage in such belief\nassessment. Some philosophers agree with Robert McKim that\n“disagreement about an issue or area of inquiry provides reason to\nthink that each side has an obligation to examine beliefs about the\nissue” (McKim 2001, 140). The underlying assumption here is that\nwhen perspectives on any issue, be they personal, social, economic,\npolitical, or religious, have important consequences for that person\nor others, then individuals are under an obligation to find the truth\nof the matter—to maximize truth. Individuals, in this case\nreligious exclusivists, can only attempt to maximize truth or avoid\nerror in the face of diverse claims, it is argued, if they attempt to\nresolve the conflict.\n\nThe contention here, it must be emphasized, is not that such\nresolution is always possible or that exclusivists must necessarily\ngive up their belief if no resolution is forthcoming. Discussion\nconcerning those issues is yet to come. The claim, rather, is only\nthat the exclusivist is obligated at the very least to assess the\nevidence for and against the beliefs in question and to try to\n“get a sense of the appeal and of the concern of those who\nadvocate them” (McKim 2001, 146).\n\nOthers philosophers disagree. For example, Alvin Plantinga\nacknowledges that if proponents of a specific religious perspective\nhave no reason to doubt that those with whom they disagree really are\non equal epistemic footing, then they are under a prima facie\nobligation to attempt to resolve the conflict. However, Plantinga\ndenies that Christian exclusivists need ever acknowledge that they are\nfacing true epistemic parity—need ever admit that they actually\nare differing with true epistemic peers. Although Christian\nexclusivists, we are told, may grant that those with whom they are in\ndisagreement have not violated any epistemic duty and may know of no\narguments that would convince others of their wrongness while\nmaintaining their rightness, exclusivists are likely to believe that\nthey “have been epistemically favored in some way.” They might\nbelieve, for instance, that they have been graced by ‘the Internal\nWitness of the Holy Spirit’; or\n… perhaps he [they] think the Holy Spirit preserves\nthe Christian church from serious error, at least with respect to the\nfundamentals of Christian belief; or perhaps [they think] that [they\nhave] been converted by divine grace, so that [they] now see what was\nonce obscure to [them]—a blessing not so far bestowed upon the\ndissenters (Plantinga 1997, 296).\n\nMoreover, if any beliefs of this type are true, Plantinga contends,\nthen Christian exclusivists are quite probably “in a better\nposition, epistemically speaking,” than those who reject the\nexclusivistic belief in question. Therefore, since it cannot be\ndemonstrated that Christian belief of this sort is very likely false,\nChristian believers remain justified in maintaining that the\nproponents of other religious perspectives are not actually on an\nequal epistemic footing. The same, Plantinga acknowledges, might well\nbe true for exclusivists in other religious belief systems (Plantinga\n1997, 296).\n [3]\n\nThe strength of this line of reasoning depends in part on the\ndebatable issue of who shoulders the burden of proof on the question\nof equal epistemic footing. Those siding with Plantinga argue in\nessence that unless exclusivists must acknowledge on epistemic grounds\nthat are (or should be) accepted by all rational people that those\nholding incompatible beliefs are actually on equal footing,\nexclusivists can justifiably deny that this is so and thus need not\nengage in belief assessment (Kim 2011). Those supporting obligatory\nbelief assessment argue that exclusivists are the ones who shoulder\nthe burden of proof. Unless it can be demonstrated on epistemic\ngrounds that are (or should be) accepted by all rational people that\nproponents of the competing perspectives are not actually on equal\nepistemic footing, exclusivists must consider their challengers on\nequal epistemic footing and are thus obligated to engage in belief\nassessment (Basinger 2002, 26–27). Or, to state this important\ndistinction another way, it is Plantinga’s contention that we need\nnot acknowledge that those with whom we disagree are actually on equal\nepistemic footing unless it can be demonstrated objectively that they\nare equally knowledgeable and sincere, while his critics maintain that\nwe must acknowledge that those with whom we disagree are on equal\nepistemic footing unless we have an objective means of demonstrating\nthat we are in fact more knowledgeable and/or sincere than they. Most\nphilosophers of religion side with the critics in this case and thus\nassume that actual peer conflict cannot be denied (Byrne 2011,\n30).\n\nAnother influential type of challenge to obligatory belief assessment\nin the face of religious diversity has been raised by Jerome Gellman.\nThe focus of his challenge centers on what he identifies as rock\nbottom beliefs. Such beliefs, as Gellman defines them, are the\nepistemic givens in a religious belief system—the assumed,\nfoundational truths upon which all else is built. Gellman grants that\nif a religious belief affirmed by an exclusivist is not rock bottom\n(is not a foundational assumption), then it may well be subject to\nobligatory belief assessment in the face of religious diversity.\nHowever, he argues, since belief assessment only makes sense when one\nisn’t certain that the belief in question is true, and since rock\nbottom religious beliefs are among the foundational truths—the\nbasic, assumed truths—in an exclusivist’s epistemic system, no\nassessment is necessary. Rather, when exclusivists encounter a\nchallenge to such a belief—for example, a challenge to their\nrock bottom belief in God’s ultimate control over all earthly\naffairs—they can, utilizing the G. E. Moore switch, justifiably\nmaintain that because their rock bottom belief is true, the competing\nbelief can justifiably be rejected (Gellman 1993, 345–364;\nGellman 1998, 229–235).\n\nFurthermore, Gellman has added, even if we grant that rock bottom\nbeliefs are at times open to belief assessment, exclusivists need not\nengage in such assessment in the face of religious diversity unless\nthey find that the awareness of such diversity is causing them to lose\nsignificant confidence in their own perspective. In the absence of\nthis type of internal conflict, they “may rationally invoke [their]\nunreflective religious belief to defeat opposing religious claims,\nwithout having to consider the question any further” (Gellman 2000,\n403).\n\nIt would seem, though, that even those who are sympathetic to\nGellman’s general line of reasoning would want to limit its scope.\nMany religious beliefs held by exclusivists have practical\nconsequences. That is, exclusivist beliefs are not isolated cognitive\nassumptions; they motivate behavior. For instance, there are many\ntheists worldwide who not only still believe that men have some sort\nof God-given, inherent authority over women, or that certain ethnic\ngroups have God-given superiority, or that certain sexual orientations\nare perversions of God’s ideal, or that humans have God-given\nauthority over the rest of nature, or that God desires heretics to be\nsilenced, they also act on these beliefs. However, it seems safe to\nassume that most exclusivists, including Gellman, believe that some of\nthese actions are morally wrong and ought to be stopped to the extent\npossible. In such cases, it is difficult to imagine many exclusivists\nmaintaining that those who hold the beliefs on which these acts are\nbased have no need to reassess these beliefs unless they personally\nfeel a need to do so. It seems, rather, that most exclusivists would\nwant those holding such beliefs to at the very least engage in\nsignificant belief reassessment, even if they don’t at present\npersonally feel a need to do so.\n",
    "section_title": "3. Religious Diversity and Epistemic Obligation",
    "entry_title": "Religious Diversity (Pluralism)",
    "hierarchy_title": "Religious Diversity (Pluralism) || Religious Diversity and Epistemic Obligation",
    "tokenized_text": [
        "religious",
        "diversity",
        "epistemic",
        "obligation",
        "religious",
        "diversity",
        "epistemic",
        "obligation",
        "philosopher",
        "denies",
        "awareness",
        "realization",
        "seeming",
        "religious",
        "diversity",
        "sometimes",
        "fact",
        "impact",
        "exclusivistsfrom",
        "causing",
        "minor",
        "uneasiness",
        "significantly",
        "reducing",
        "level",
        "confidence",
        "truth",
        "certain",
        "belief",
        "precipitating",
        "belief",
        "abandonment",
        "simply",
        "empirical",
        "claim",
        "psychological",
        "state",
        "behavior",
        "alston",
        "plantinga",
        "though",
        "exclusivists",
        "coming",
        "awareness",
        "religious",
        "diversitythe",
        "awareness",
        "seemingly",
        "sincere",
        "knowledgeable",
        "individual",
        "differ",
        "issue",
        "religious",
        "significancerespond",
        "reality",
        "diversity",
        "instance",
        "devout",
        "hindu",
        "christian",
        "come",
        "realize",
        "others",
        "seem",
        "knowledgeable",
        "devout",
        "hold",
        "incompatible",
        "religious",
        "perspective",
        "respond",
        "christian",
        "believe",
        "bible",
        "clearly",
        "portrays",
        "god",
        "total",
        "control",
        "aspect",
        "reality",
        "respond",
        "realization",
        "seemingly",
        "sincere",
        "devout",
        "biblebelieving",
        "christian",
        "see",
        "bible",
        "clearly",
        "portraying",
        "god",
        "chosen",
        "control",
        "occurs",
        "context",
        "human",
        "granted",
        "meaningful",
        "moral",
        "freedom",
        "exclusivists",
        "justifiably",
        "disregard",
        "diversity",
        "exclusivists",
        "obligation",
        "attempt",
        "resolve",
        "epistemic",
        "conflictsengage",
        "belief",
        "assessment",
        "reassessment",
        "openness",
        "possible",
        "revision",
        "would",
        "least",
        "good",
        "idea",
        "within",
        "relevant",
        "epistemology",
        "disagreement",
        "literature",
        "find",
        "significantly",
        "different",
        "response",
        "course",
        "religious",
        "individual",
        "group",
        "believe",
        "inappropriate",
        "subject",
        "religious",
        "belief",
        "assessment",
        "sort",
        "certain",
        "individual",
        "sometimes",
        "called",
        "fideists",
        "argued",
        "instance",
        "religious",
        "belief",
        "type",
        "properly",
        "subjected",
        "rational",
        "assessment",
        "andor",
        "assessing",
        "belief",
        "demonstrates",
        "lack",
        "faith",
        "peterson",
        "et",
        "al",
        "philosopher",
        "currently",
        "hold",
        "position",
        "maintain",
        "exclusivists",
        "least",
        "right",
        "ass",
        "belief",
        "face",
        "religious",
        "diversity",
        "continues",
        "however",
        "significant",
        "debate",
        "whether",
        "exclusivists",
        "obligation",
        "engage",
        "belief",
        "assessment",
        "philosopher",
        "agree",
        "robert",
        "mckim",
        "disagreement",
        "issue",
        "area",
        "inquiry",
        "provides",
        "reason",
        "think",
        "side",
        "obligation",
        "examine",
        "belief",
        "issue",
        "mckim",
        "underlying",
        "assumption",
        "perspective",
        "issue",
        "personal",
        "social",
        "economic",
        "political",
        "religious",
        "important",
        "consequence",
        "person",
        "others",
        "individual",
        "obligation",
        "find",
        "truth",
        "matterto",
        "maximize",
        "truth",
        "individual",
        "case",
        "religious",
        "exclusivists",
        "attempt",
        "maximize",
        "truth",
        "avoid",
        "error",
        "face",
        "diverse",
        "claim",
        "argued",
        "attempt",
        "resolve",
        "conflict",
        "contention",
        "must",
        "emphasized",
        "resolution",
        "always",
        "possible",
        "exclusivists",
        "must",
        "necessarily",
        "give",
        "belief",
        "resolution",
        "forthcoming",
        "discussion",
        "concerning",
        "issue",
        "yet",
        "come",
        "claim",
        "rather",
        "exclusivist",
        "obligated",
        "least",
        "ass",
        "evidence",
        "belief",
        "question",
        "try",
        "get",
        "sense",
        "appeal",
        "concern",
        "advocate",
        "mckim",
        "others",
        "philosopher",
        "disagree",
        "example",
        "alvin",
        "plantinga",
        "acknowledges",
        "proponent",
        "specific",
        "religious",
        "perspective",
        "reason",
        "doubt",
        "disagree",
        "really",
        "equal",
        "epistemic",
        "footing",
        "prima",
        "facie",
        "obligation",
        "attempt",
        "resolve",
        "conflict",
        "however",
        "plantinga",
        "denies",
        "christian",
        "exclusivists",
        "need",
        "ever",
        "acknowledge",
        "facing",
        "true",
        "epistemic",
        "parityneed",
        "ever",
        "admit",
        "actually",
        "differing",
        "true",
        "epistemic",
        "peer",
        "although",
        "christian",
        "exclusivists",
        "told",
        "may",
        "grant",
        "disagreement",
        "violated",
        "epistemic",
        "duty",
        "may",
        "know",
        "argument",
        "would",
        "convince",
        "others",
        "wrongness",
        "maintaining",
        "rightness",
        "exclusivists",
        "likely",
        "believe",
        "epistemically",
        "favored",
        "way",
        "might",
        "believe",
        "instance",
        "graced",
        "internal",
        "witness",
        "holy",
        "spirit",
        "perhaps",
        "think",
        "holy",
        "spirit",
        "preserve",
        "christian",
        "church",
        "serious",
        "error",
        "least",
        "respect",
        "fundamental",
        "christian",
        "belief",
        "perhaps",
        "think",
        "converted",
        "divine",
        "grace",
        "see",
        "obscure",
        "a",
        "blessing",
        "far",
        "bestowed",
        "upon",
        "dissenter",
        "plantinga",
        "moreover",
        "belief",
        "type",
        "true",
        "plantinga",
        "contends",
        "christian",
        "exclusivists",
        "quite",
        "probably",
        "better",
        "position",
        "epistemically",
        "speaking",
        "reject",
        "exclusivistic",
        "belief",
        "question",
        "therefore",
        "since",
        "demonstrated",
        "christian",
        "belief",
        "sort",
        "likely",
        "false",
        "christian",
        "believer",
        "remain",
        "justified",
        "maintaining",
        "proponent",
        "religious",
        "perspective",
        "actually",
        "equal",
        "epistemic",
        "footing",
        "plantinga",
        "acknowledges",
        "might",
        "well",
        "true",
        "exclusivists",
        "religious",
        "belief",
        "system",
        "plantinga",
        "strength",
        "line",
        "reasoning",
        "depends",
        "part",
        "debatable",
        "issue",
        "shoulder",
        "burden",
        "proof",
        "question",
        "equal",
        "epistemic",
        "footing",
        "siding",
        "plantinga",
        "argue",
        "essence",
        "unless",
        "exclusivists",
        "must",
        "acknowledge",
        "epistemic",
        "ground",
        "accepted",
        "rational",
        "people",
        "holding",
        "incompatible",
        "belief",
        "actually",
        "equal",
        "footing",
        "exclusivists",
        "justifiably",
        "deny",
        "thus",
        "need",
        "engage",
        "belief",
        "assessment",
        "kim",
        "supporting",
        "obligatory",
        "belief",
        "assessment",
        "argue",
        "exclusivists",
        "one",
        "shoulder",
        "burden",
        "proof",
        "unless",
        "demonstrated",
        "epistemic",
        "ground",
        "accepted",
        "rational",
        "people",
        "proponent",
        "competing",
        "perspective",
        "actually",
        "equal",
        "epistemic",
        "footing",
        "exclusivists",
        "must",
        "consider",
        "challenger",
        "equal",
        "epistemic",
        "footing",
        "thus",
        "obligated",
        "engage",
        "belief",
        "assessment",
        "basinger",
        "state",
        "important",
        "distinction",
        "another",
        "way",
        "plantinga",
        "contention",
        "need",
        "acknowledge",
        "disagree",
        "actually",
        "equal",
        "epistemic",
        "footing",
        "unless",
        "demonstrated",
        "objectively",
        "equally",
        "knowledgeable",
        "sincere",
        "critic",
        "maintain",
        "must",
        "acknowledge",
        "disagree",
        "equal",
        "epistemic",
        "footing",
        "unless",
        "objective",
        "mean",
        "demonstrating",
        "fact",
        "knowledgeable",
        "andor",
        "sincere",
        "philosopher",
        "religion",
        "side",
        "critic",
        "case",
        "thus",
        "assume",
        "actual",
        "peer",
        "conflict",
        "denied",
        "byrne",
        "another",
        "influential",
        "type",
        "challenge",
        "obligatory",
        "belief",
        "assessment",
        "face",
        "religious",
        "diversity",
        "raised",
        "jerome",
        "gellman",
        "focus",
        "challenge",
        "center",
        "identifies",
        "rock",
        "bottom",
        "belief",
        "belief",
        "gellman",
        "defines",
        "epistemic",
        "given",
        "religious",
        "belief",
        "systemthe",
        "assumed",
        "foundational",
        "truth",
        "upon",
        "else",
        "built",
        "gellman",
        "grant",
        "religious",
        "belief",
        "affirmed",
        "exclusivist",
        "rock",
        "bottom",
        "foundational",
        "assumption",
        "may",
        "well",
        "subject",
        "obligatory",
        "belief",
        "assessment",
        "face",
        "religious",
        "diversity",
        "however",
        "argues",
        "since",
        "belief",
        "assessment",
        "make",
        "sense",
        "one",
        "certain",
        "belief",
        "question",
        "true",
        "since",
        "rock",
        "bottom",
        "religious",
        "belief",
        "among",
        "foundational",
        "truthsthe",
        "basic",
        "assumed",
        "truthsin",
        "exclusivist",
        "epistemic",
        "system",
        "assessment",
        "necessary",
        "rather",
        "exclusivists",
        "encounter",
        "challenge",
        "belieffor",
        "example",
        "challenge",
        "rock",
        "bottom",
        "belief",
        "god",
        "ultimate",
        "control",
        "earthly",
        "affairsthey",
        "utilizing",
        "g",
        "e",
        "moore",
        "switch",
        "justifiably",
        "maintain",
        "rock",
        "bottom",
        "belief",
        "true",
        "competing",
        "belief",
        "justifiably",
        "rejected",
        "gellman",
        "gellman",
        "furthermore",
        "gellman",
        "added",
        "even",
        "grant",
        "rock",
        "bottom",
        "belief",
        "time",
        "open",
        "belief",
        "assessment",
        "exclusivists",
        "need",
        "engage",
        "assessment",
        "face",
        "religious",
        "diversity",
        "unless",
        "find",
        "awareness",
        "diversity",
        "causing",
        "lose",
        "significant",
        "confidence",
        "perspective",
        "absence",
        "type",
        "internal",
        "conflict",
        "may",
        "rationally",
        "invoke",
        "unreflective",
        "religious",
        "belief",
        "defeat",
        "opposing",
        "religious",
        "claim",
        "without",
        "consider",
        "question",
        "gellman",
        "would",
        "seem",
        "though",
        "even",
        "sympathetic",
        "gellman",
        "general",
        "line",
        "reasoning",
        "would",
        "want",
        "limit",
        "scope",
        "many",
        "religious",
        "belief",
        "held",
        "exclusivists",
        "practical",
        "consequence",
        "exclusivist",
        "belief",
        "isolated",
        "cognitive",
        "assumption",
        "motivate",
        "behavior",
        "instance",
        "many",
        "theist",
        "worldwide",
        "still",
        "believe",
        "men",
        "sort",
        "godgiven",
        "inherent",
        "authority",
        "woman",
        "certain",
        "ethnic",
        "group",
        "godgiven",
        "superiority",
        "certain",
        "sexual",
        "orientation",
        "perversion",
        "god",
        "ideal",
        "human",
        "godgiven",
        "authority",
        "rest",
        "nature",
        "god",
        "desire",
        "heretic",
        "silenced",
        "also",
        "act",
        "belief",
        "however",
        "seems",
        "safe",
        "assume",
        "exclusivists",
        "including",
        "gellman",
        "believe",
        "action",
        "morally",
        "wrong",
        "ought",
        "stopped",
        "extent",
        "possible",
        "case",
        "difficult",
        "imagine",
        "many",
        "exclusivists",
        "maintaining",
        "hold",
        "belief",
        "act",
        "based",
        "need",
        "reassess",
        "belief",
        "unless",
        "personally",
        "feel",
        "need",
        "seems",
        "rather",
        "exclusivists",
        "would",
        "want",
        "holding",
        "belief",
        "least",
        "engage",
        "significant",
        "belief",
        "reassessment",
        "even",
        "present",
        "personally",
        "feel",
        "need"
    ]
}