{
    "main_text": "Science and religion in various religions || Islam\n2.2 Islam\n\nIslam is a monotheistic religion that emerged in the seventh century,\nfollowing a series of purported revelations to the prophet\nMuḥammad. The term “Islam” also denotes\ngeo-political structures, such as caliphates and empires, which were\nfounded by Muslim rulers from the seventh century onward, including\nthe Umayyad, Abbasid, and Ottoman caliphates. Additionally, it refers\nto a culture which flourished within this political and religious\ncontext, with its own philosophical and scientific traditions (Dhanani\n2002). The defining characteristic of Islam is belief in one God\n(Allāh), who communicates through prophets, including Adam,\nAbraham, and Muḥammad. Allāh‎’s revelations to\nMuḥammad are recorded in the Qurʾān, the central\nreligious text for Islam. Next to the Qurʾān, an important\nsource of jurisprudence and theology is the ḥadīth, an oral\ncorpus of attested sayings, actions, and tacit approvals of the\nprophet Muḥammad. The two major branches of Islam, Sunni and\nShia, are based on a dispute over the succession of Muḥammad. As\nthe second largest religion in the world, Islam shows a wide variety\nof beliefs. Core creedal views include the oneness of God\n(tawḥīd), the view that there is only one\nundivided God who created and sustains the universe, prophetic\nrevelation (in particular to Muḥammad), and an afterlife. Beyond\nthis, Muslims disagree on a number of doctrinal issues.\n\nThe relationship between Islam and science is complex. Today,\npredominantly Muslim countries, such as the United Arabic Emirates,\nenjoy high urbanization and technological development, but they still\nunderperform in common metrics of scientific research, such as\npublications in leading journals and number of citations per\nscientist, compared to other regions outside of the west such as India\nand China (see Edis 2007). Some Muslims hold a number of\npseudoscientific ideas, some of which it shares with Christianity such\nas Old Earth creationism, whereas others are specific to Islam such as\nthe recreation of human bodies from the tailbone on the day of\nresurrection, and the superiority of prayer in treating lower-back\npain instead of conventional methods (Guessoum 2011: 4–5).\n\nThis contemporary lack of scientific prominence is remarkable given\nthat the Islamic world far exceeded European cultures in the range and\nquality of its scientific knowledge between approximately the ninth\nand the fifteenth century, excelling in domains such as mathematics\n(algebra and geometry, trigonometry in particular), astronomy\n(seriously considering, but not adopting, heliocentrism), optics, and\nmedicine. These domains of knowledge are commonly referred to as\n“Arabic science”, to distinguish them from the pursuits of\nscience that arose in the west (Huff 2003). “Arabic\nscience” is an imperfect term, as many of the practitioners were\nnot speakers of Arabic, hence the term “science in the Islamic\nworld” is more accurate. Many scientists in the Islamic world\nwere polymaths, for example, Ibn Sīnā (Avicenna,\n980–1037) is commonly regarded as one of the most significant\ninnovators, not only in philosophy, but also in medicine and\nastronomy. His Canon of Medicine, a medical encyclopedia, was\na standard textbook in universities across Europe for many centuries\nafter his death. Al-Fārābī (ca. 872–ca. 950), a\npolitical philosopher from Damascus, also investigated music theory,\nscience, and mathematics. Omar Khayyám (1048–1131)\nachieved lasting fame in disparate domains such as poetry, astronomy,\ngeography, and mineralogy. The Andalusian Ibn Rušd (Averroes,\n1126–1198) wrote on medicine, physics, astronomy, psychology,\njurisprudence, music, and geography, next to developing a Greek-inspired\nphilosophical theology.\n\nA major impetus for science in the Islamic world was the patronage of\nthe Abbasid caliphate (758–1258), centered in Baghdad. Early\nAbbasid rulers, such as Harun al-Rashid (ruled 786–809) and his\nsuccessor Abū Jaʿfar Abdullāh al-Ma’mūn\n(ruled 813–833), were significant patrons of science. The former\nfounded the Bayt al-Hikma (House of Wisdom), which\ncommissioned translations of major works by Aristotle, Galen, and many\nPersian and Indian scholars into Arabic. It was cosmopolitan in its\noutlook, employing astronomers, mathematicians, and physicians from\nabroad, including Indian mathematicians and Nestorian (Christian)\nastronomers. Throughout the Islamic world, public libraries attached\nto mosques provided access to a vast compendium of knowledge, which\nspread Islam, Greek philosophy, and science. The use of a common\nlanguage (Arabic), as well as common religious and political\ninstitutions and flourishing trade relations encouraged the spread of\nscientific ideas throughout the Islamic world. Some of this\ntransmission was informal, e.g., correspondence between like-minded\npeople (see Dhanani 2002), some formal, e.g., in hospitals where\nstudents learned about medicine in a practical, master-apprentice\nsetting, and in astronomical observatories and academies. The decline\nand fall of the Abbasid caliphate dealt a blow to science in the Islamic world, but it\nremains unclear why it ultimately stagnated, and why it did not\nexperience something analogous to the scientific revolution in Western\nEurope. Note, the decline of science in the Islamic world should not\nbe generalized to other fields, such as philosophy and philosophical\ntheology, which continued to flourish after the Abbasid caliphate\nfell.\n\nSome liberal Muslim authors, such as Fatima Mernissi (1992), argue\nthat the rise of conservative forms of Islamic philosophical theology\nstifled more scientifically-minded natural philosophy. In the ninth to\nthe twelfth century, the Mu’tazila (a philosophical theological\nschool) helped the growth of science in the Islamic world thanks to\ntheir embrace of Greek natural philosophy. But eventually, the\nMu’tazila and their intellectual descendants lost their\ninfluence to more conservative brands of theology.\nAl-Ghazālī’s influential eleventh-century work,\nThe Incoherence of the Philosophers (Tahāfut\nal-falāsifa), was a scathing and sophisticated critique of\nGreek-inspired Muslim philosophy, arguing that their metaphysical assumptions\ncould not be demonstrated. This book vindicated more orthodox Muslim\nreligious views. As Muslim intellectual life became more orthodox, it\nbecame less open to non-Muslim philosophical ideas, which led to the\ndecline of science in the Islamic world, according to this view.\n\nThe problem with this narrative is that orthodox worries about\nnon-Islamic knowledge were already present before Al-Ghazālī\nand continued long after his death (Edis 2007: chapter 2). The study\nof law (fiqh) was more stifling for science in the Islamic\nworld than developments in theology. The eleventh century saw changes\nin Islamic law that discouraged heterodox thought: lack of orthodoxy\ncould now be regarded as apostasy from Islam (zandaqa) which\nis punishable by death, whereas before, a Muslim could only apostatize\nby an explicit declaration (Griffel 2009: 105). (Al-Ghazālī\nhimself only regarded the violation of three core doctrines as\nzandaqa, namely statements that challenged monotheism, the\nprophecy of Muḥammad, and resurrection after death.) Given that\nheterodox thoughts could be interpreted as apostasy, this created a\nstifling climate for science. In the second half of the nineteenth\ncentury, as science and technology became firmly entrenched in Western\nsociety, Muslim empires were languishing or colonized. Scientific\nideas, such as evolutionary theory, became equated with European\ncolonialism, and thus met with distrust. The enduring association\nbetween western culture, colonialism, and science led to a more\nprominent conflict view of the relationship between science and\nreligion in Muslim countries.\n\nIn spite of this negative association between science and Western\nmodernity, there is an emerging literature on science and religion by\nMuslim scholars (mostly scientists). The physicist Nidhal Guessoum\n(2011) holds that science and religion are not only compatible, but in\nharmony. He rejects the idea of treating the Qurʾān as a\nscientific encyclopedia, something other Muslim authors in the debate\non science and religion tend to do. Moreover, he adheres to the\nno-possible-conflict principle, outlined by Ibn Rušd: there\ncan be no conflict between God’s word (properly understood) and\nGod’s work (properly understood). If an apparent conflict\narises, the Qurʾān may not have been interpreted\ncorrectly.\n\nWhile the Qurʾān asserts a creation in six days (like the\nHebrew Bible), “day” is often interpreted as a very long\nspan of time, rather than a 24-hour period. As a result, Old Earth\ncreationism is more influential in Islam than Young Earth creationism.\nAdnan Oktar’s Atlas of Creation (published in 2007\nunder the pseudonym Harun Yahya), a glossy coffee table book that\ndraws heavily on Christian Old Earth creationism, has been distributed\nworldwide (Hameed 2008). Since the Qurʾān explicitly\nmentions the special creation of Adam out of clay, most Muslims refuse\nto accept that humans evolved from hominin ancestors. Nevertheless,\nMuslim scientists such as Guessoum (2011) and Rana Dajani (2015) have\nadvocated acceptance of evolution.\n",
    "section_title": "2.2 Islam",
    "entry_title": "Religion and Science",
    "hierarchy_title": "Religion and Science || Science and religion in various religions || Islam",
    "tokenized_text": [
        "science",
        "religion",
        "various",
        "religion",
        "islam",
        "islam",
        "islam",
        "monotheistic",
        "religion",
        "emerged",
        "seventh",
        "century",
        "following",
        "series",
        "purported",
        "revelation",
        "prophet",
        "muḥammad",
        "term",
        "islam",
        "also",
        "denotes",
        "geopolitical",
        "structure",
        "caliphate",
        "empire",
        "founded",
        "muslim",
        "ruler",
        "seventh",
        "century",
        "onward",
        "including",
        "umayyad",
        "abbasid",
        "ottoman",
        "caliphate",
        "additionally",
        "refers",
        "culture",
        "flourished",
        "within",
        "political",
        "religious",
        "context",
        "philosophical",
        "scientific",
        "tradition",
        "dhanani",
        "defining",
        "characteristic",
        "islam",
        "belief",
        "one",
        "god",
        "allāh",
        "communicates",
        "prophet",
        "including",
        "adam",
        "abraham",
        "muḥammad",
        "allāh",
        "revelation",
        "muḥammad",
        "recorded",
        "qurʾān",
        "central",
        "religious",
        "text",
        "islam",
        "next",
        "qurʾān",
        "important",
        "source",
        "jurisprudence",
        "theology",
        "ḥadīth",
        "oral",
        "corpus",
        "attested",
        "saying",
        "action",
        "tacit",
        "approval",
        "prophet",
        "muḥammad",
        "two",
        "major",
        "branch",
        "islam",
        "sunni",
        "shia",
        "based",
        "dispute",
        "succession",
        "muḥammad",
        "second",
        "largest",
        "religion",
        "world",
        "islam",
        "show",
        "wide",
        "variety",
        "belief",
        "core",
        "creedal",
        "view",
        "include",
        "oneness",
        "god",
        "tawḥīd",
        "view",
        "one",
        "undivided",
        "god",
        "created",
        "sustains",
        "universe",
        "prophetic",
        "revelation",
        "particular",
        "muḥammad",
        "afterlife",
        "beyond",
        "muslim",
        "disagree",
        "number",
        "doctrinal",
        "issue",
        "relationship",
        "islam",
        "science",
        "complex",
        "today",
        "predominantly",
        "muslim",
        "country",
        "united",
        "arabic",
        "emirate",
        "enjoy",
        "high",
        "urbanization",
        "technological",
        "development",
        "still",
        "underperform",
        "common",
        "metric",
        "scientific",
        "research",
        "publication",
        "leading",
        "journal",
        "number",
        "citation",
        "per",
        "scientist",
        "compared",
        "region",
        "outside",
        "west",
        "india",
        "china",
        "see",
        "edis",
        "muslim",
        "hold",
        "number",
        "pseudoscientific",
        "idea",
        "share",
        "christianity",
        "old",
        "earth",
        "creationism",
        "whereas",
        "others",
        "specific",
        "islam",
        "recreation",
        "human",
        "body",
        "tailbone",
        "day",
        "resurrection",
        "superiority",
        "prayer",
        "treating",
        "lowerback",
        "pain",
        "instead",
        "conventional",
        "method",
        "guessoum",
        "contemporary",
        "lack",
        "scientific",
        "prominence",
        "remarkable",
        "given",
        "islamic",
        "world",
        "far",
        "exceeded",
        "european",
        "culture",
        "range",
        "quality",
        "scientific",
        "knowledge",
        "approximately",
        "ninth",
        "fifteenth",
        "century",
        "excelling",
        "domain",
        "mathematics",
        "algebra",
        "geometry",
        "trigonometry",
        "particular",
        "astronomy",
        "seriously",
        "considering",
        "adopting",
        "heliocentrism",
        "optic",
        "medicine",
        "domain",
        "knowledge",
        "commonly",
        "referred",
        "arabic",
        "science",
        "distinguish",
        "pursuit",
        "science",
        "arose",
        "west",
        "huff",
        "arabic",
        "science",
        "imperfect",
        "term",
        "many",
        "practitioner",
        "speaker",
        "arabic",
        "hence",
        "term",
        "science",
        "islamic",
        "world",
        "accurate",
        "many",
        "scientist",
        "islamic",
        "world",
        "polymath",
        "example",
        "ibn",
        "sīnā",
        "avicenna",
        "commonly",
        "regarded",
        "one",
        "significant",
        "innovator",
        "philosophy",
        "also",
        "medicine",
        "astronomy",
        "canon",
        "medicine",
        "medical",
        "encyclopedia",
        "standard",
        "textbook",
        "university",
        "across",
        "europe",
        "many",
        "century",
        "death",
        "alfārābī",
        "ca",
        "ca",
        "political",
        "philosopher",
        "damascus",
        "also",
        "investigated",
        "music",
        "theory",
        "science",
        "mathematics",
        "omar",
        "khayyám",
        "achieved",
        "lasting",
        "fame",
        "disparate",
        "domain",
        "poetry",
        "astronomy",
        "geography",
        "mineralogy",
        "andalusian",
        "ibn",
        "rušd",
        "averroes",
        "wrote",
        "medicine",
        "physic",
        "astronomy",
        "psychology",
        "jurisprudence",
        "music",
        "geography",
        "next",
        "developing",
        "greekinspired",
        "philosophical",
        "theology",
        "major",
        "impetus",
        "science",
        "islamic",
        "world",
        "patronage",
        "abbasid",
        "caliphate",
        "centered",
        "baghdad",
        "early",
        "abbasid",
        "ruler",
        "harun",
        "alrashid",
        "ruled",
        "successor",
        "abū",
        "jaʿfar",
        "abdullāh",
        "alma",
        "mūn",
        "ruled",
        "significant",
        "patron",
        "science",
        "former",
        "founded",
        "bayt",
        "alhikma",
        "house",
        "wisdom",
        "commissioned",
        "translation",
        "major",
        "work",
        "aristotle",
        "galen",
        "many",
        "persian",
        "indian",
        "scholar",
        "arabic",
        "cosmopolitan",
        "outlook",
        "employing",
        "astronomer",
        "mathematician",
        "physician",
        "abroad",
        "including",
        "indian",
        "mathematician",
        "nestorian",
        "christian",
        "astronomer",
        "throughout",
        "islamic",
        "world",
        "public",
        "library",
        "attached",
        "mosque",
        "provided",
        "access",
        "vast",
        "compendium",
        "knowledge",
        "spread",
        "islam",
        "greek",
        "philosophy",
        "science",
        "use",
        "common",
        "language",
        "arabic",
        "well",
        "common",
        "religious",
        "political",
        "institution",
        "flourishing",
        "trade",
        "relation",
        "encouraged",
        "spread",
        "scientific",
        "idea",
        "throughout",
        "islamic",
        "world",
        "transmission",
        "informal",
        "eg",
        "correspondence",
        "likeminded",
        "people",
        "see",
        "dhanani",
        "formal",
        "eg",
        "hospital",
        "student",
        "learned",
        "medicine",
        "practical",
        "masterapprentice",
        "setting",
        "astronomical",
        "observatory",
        "academy",
        "decline",
        "fall",
        "abbasid",
        "caliphate",
        "dealt",
        "blow",
        "science",
        "islamic",
        "world",
        "remains",
        "unclear",
        "ultimately",
        "stagnated",
        "experience",
        "something",
        "analogous",
        "scientific",
        "revolution",
        "western",
        "europe",
        "note",
        "decline",
        "science",
        "islamic",
        "world",
        "generalized",
        "field",
        "philosophy",
        "philosophical",
        "theology",
        "continued",
        "flourish",
        "abbasid",
        "caliphate",
        "fell",
        "liberal",
        "muslim",
        "author",
        "fatima",
        "mernissi",
        "argue",
        "rise",
        "conservative",
        "form",
        "islamic",
        "philosophical",
        "theology",
        "stifled",
        "scientificallyminded",
        "natural",
        "philosophy",
        "ninth",
        "twelfth",
        "century",
        "mu",
        "tazila",
        "philosophical",
        "theological",
        "school",
        "helped",
        "growth",
        "science",
        "islamic",
        "world",
        "thanks",
        "embrace",
        "greek",
        "natural",
        "philosophy",
        "eventually",
        "mu",
        "tazila",
        "intellectual",
        "descendant",
        "lost",
        "influence",
        "conservative",
        "brand",
        "theology",
        "alghazālī",
        "influential",
        "eleventhcentury",
        "work",
        "incoherence",
        "philosopher",
        "tahāfut",
        "alfalāsifa",
        "scathing",
        "sophisticated",
        "critique",
        "greekinspired",
        "muslim",
        "philosophy",
        "arguing",
        "metaphysical",
        "assumption",
        "could",
        "demonstrated",
        "book",
        "vindicated",
        "orthodox",
        "muslim",
        "religious",
        "view",
        "muslim",
        "intellectual",
        "life",
        "became",
        "orthodox",
        "became",
        "le",
        "open",
        "nonmuslim",
        "philosophical",
        "idea",
        "led",
        "decline",
        "science",
        "islamic",
        "world",
        "according",
        "view",
        "problem",
        "narrative",
        "orthodox",
        "worry",
        "nonislamic",
        "knowledge",
        "already",
        "present",
        "alghazālī",
        "continued",
        "long",
        "death",
        "edis",
        "chapter",
        "study",
        "law",
        "fiqh",
        "stifling",
        "science",
        "islamic",
        "world",
        "development",
        "theology",
        "eleventh",
        "century",
        "saw",
        "change",
        "islamic",
        "law",
        "discouraged",
        "heterodox",
        "thought",
        "lack",
        "orthodoxy",
        "could",
        "regarded",
        "apostasy",
        "islam",
        "zandaqa",
        "punishable",
        "death",
        "whereas",
        "muslim",
        "could",
        "apostatize",
        "explicit",
        "declaration",
        "griffel",
        "alghazālī",
        "regarded",
        "violation",
        "three",
        "core",
        "doctrine",
        "zandaqa",
        "namely",
        "statement",
        "challenged",
        "monotheism",
        "prophecy",
        "muḥammad",
        "resurrection",
        "death",
        "given",
        "heterodox",
        "thought",
        "could",
        "interpreted",
        "apostasy",
        "created",
        "stifling",
        "climate",
        "science",
        "second",
        "half",
        "nineteenth",
        "century",
        "science",
        "technology",
        "became",
        "firmly",
        "entrenched",
        "western",
        "society",
        "muslim",
        "empire",
        "languishing",
        "colonized",
        "scientific",
        "idea",
        "evolutionary",
        "theory",
        "became",
        "equated",
        "european",
        "colonialism",
        "thus",
        "met",
        "distrust",
        "enduring",
        "association",
        "western",
        "culture",
        "colonialism",
        "science",
        "led",
        "prominent",
        "conflict",
        "view",
        "relationship",
        "science",
        "religion",
        "muslim",
        "country",
        "spite",
        "negative",
        "association",
        "science",
        "western",
        "modernity",
        "emerging",
        "literature",
        "science",
        "religion",
        "muslim",
        "scholar",
        "mostly",
        "scientist",
        "physicist",
        "nidhal",
        "guessoum",
        "hold",
        "science",
        "religion",
        "compatible",
        "harmony",
        "reject",
        "idea",
        "treating",
        "qurʾān",
        "scientific",
        "encyclopedia",
        "something",
        "muslim",
        "author",
        "debate",
        "science",
        "religion",
        "tend",
        "moreover",
        "adheres",
        "nopossibleconflict",
        "principle",
        "outlined",
        "ibn",
        "rušd",
        "conflict",
        "god",
        "word",
        "properly",
        "understood",
        "god",
        "work",
        "properly",
        "understood",
        "apparent",
        "conflict",
        "arises",
        "qurʾān",
        "may",
        "interpreted",
        "correctly",
        "qurʾān",
        "asserts",
        "creation",
        "six",
        "day",
        "like",
        "hebrew",
        "bible",
        "day",
        "often",
        "interpreted",
        "long",
        "span",
        "time",
        "rather",
        "hour",
        "period",
        "result",
        "old",
        "earth",
        "creationism",
        "influential",
        "islam",
        "young",
        "earth",
        "creationism",
        "adnan",
        "oktar",
        "atlas",
        "creation",
        "published",
        "pseudonym",
        "harun",
        "yahya",
        "glossy",
        "coffee",
        "table",
        "book",
        "draw",
        "heavily",
        "christian",
        "old",
        "earth",
        "creationism",
        "distributed",
        "worldwide",
        "hameed",
        "since",
        "qurʾān",
        "explicitly",
        "mention",
        "special",
        "creation",
        "adam",
        "clay",
        "muslim",
        "refuse",
        "accept",
        "human",
        "evolved",
        "hominin",
        "ancestor",
        "nevertheless",
        "muslim",
        "scientist",
        "guessoum",
        "rana",
        "dajani",
        "advocated",
        "acceptance",
        "evolution"
    ]
}