{
    "main_text": "Dawkins’ View || Genes as Replicators\n3.1 Genes as Replicators\n\nA longstanding dispute in evolutionary biology concerns the levels at\nwhich selection can occur (Bourrat 2015b, 2021; Brandon 1996;\nKerr & Godfrey-Smith 2002; Keller 1999; Lloyd 1988; Okasha 2006,\n2016; Sober & Wilson 1998; Williams 1966) [see the entry on\n units and levels of selection].\n Some authors see this dispute as concerning the levels at which\nreplication can take place. Other authors take the levels of selection\ndispute to concern environmental interaction and insist that\nenvironmental interaction can take place at a variety of levels, from\nsingle genes, cells, and organisms to colonies, demes, and possibly\nentire species. Organisms certainly interact with their environments\nin ways that bias the transmission of their genes, but then so do\nentities that are both less inclusive than entire organisms (e.g.,\nsperm cells) and more inclusive (e.g., beehives).\n\nDawkins argued that replication in biological evolution\noccurs exclusively at the level of the genetic material. The term\n“replication” refers first and foremost to copying, and\ngenes are the self-replicating molecules of biology. Some critics\n(e.g., Lewontin 1991: 48) interpreted this to mean that a strand of\nDNA placed on a glass slide might start replicating all on its own. Of\ncourse, no biologist has ever held such a view. Genes do replicate\nthemselves, but only with the aid of highly complicated molecular\nmachinery. Too often, however, the importance of this machinery has\ngone unnoticed. To be sure, when we make copies on a photocopier, we\nare interested in the texts, figures, or just scrawls that appear on\nthese sheets of paper. We are not interested in how the photocopier\nworks, even if it does all the work.\n\nIn Dawkins’ early writings, replicators and vehicles played\ndifferent but complementary and equally important roles in selection;\nhowever, as he honed his view of the evolutionary process, vehicles\nbecame less and less fundamental. Initially, Dawkins was content to\ndethrone the organism from its pride of place in biology. It is an\nimportant focus of environmental interaction, but other entities, both\nbelow and above the organismic level, can also function as vehicles.\nIn later writings, however, Dawkins went even further to argue that\nphenotypic traits are what really matter for evolution by natural\nselection to occur and that they can be treated independently of their\nbeing organized into vehicles. More than that, features such as spider\nwebs should be viewed as part of a spider’s phenotype. Hence,\nDawkins titled his second book The Extended Phenotype\n(Dawkins 1982b).\n\nDawkins never lost his fascination with vehicular adaptations, a\nfascination that his critics denigrate as Panglossian adaptationism.\nHe filled his books with adaptationist scenarios, some more firmly\nsupported by data than others; however, from the perspective of\nthe structure of evolutionary theory, he held that replicators are\nmuch more important than vehicles. For example, Dawkins argued at some\nlength that adaptations are always for the good of replicators, not\nvehicles (Lloyd 1992) [see the entry on\n units and levels of selection].\n Vehicles exhibit these adaptations, but ultimately all\nadaptations must be explicable in terms of changes in gene\nfrequencies. Thus, it comes as no surprise when Dawkins (1994: 617)\nproclaims that he “coined the term ‘vehicle’ not to\npraise it but to bury it”. As prevalent as organisms might be,\nas definite as the causal roles that they play in selection are,\nreference to them can and must be omitted from any perspicuous\ncharacterization of selection in the evolutionary process. Although\nDawkins is far from a genetic determinist, he is certainly a\ngenetic reductionist. Whether reductionism itself is good or\nbad is a moot question (Sarkar 1998).\n\nAccording to Dawkins, replicators have three basic\nproperties—longevity, fecundity and\ncopy-fidelity. Longevity means longevity of the gene\ntype in the form of copies through descent (Dawkins 1982b:\n84; Hull 1980), although the stability of gene tokens is\nincluded in the definition in The Selfish Gene (1976: 18). No\ngene as a physical body lasts all that long. In mitosis, a gene loses\nhalf of its substance at each replication. What endures, he says, is\nnot the entity itself but the information incorporated in its\nstructure. It is this information that is copied with such high\nfidelity. Mutations do occur, but at very low frequencies. Even so, in\nsome organisms, mutation rates must be too high because mechanisms\nhave evolved that search out and repair such errors. Therefore, the\ngenotype is an informational notion; information is equivalent to\nAristotelian form. The type is the form of the tokens, in\nDawkins’ view.\n\nOne source of variation in genes of sexual organisms supplementing\nmutation is crossover. Pairs of homologous chromosomes line up next to\neach other at meiosis, crossover, and recombine. For stretches of DNA\nin which different alleles exist, the result can be a change in\ninformation. Quite obviously, the shorter the stretch of DNA involved,\nthe less likely that crossover will occur and the message change.\nDawkins appeals to such dismantling of entities to argue against\norganisms functioning as replicators. In sexual organisms, organisms\nthemselves are torn apart and repeatedly assembled each generation\n(Caporael 2003). If long stretches of DNA lack the necessary identity\nby descent to function as replicators, then sexual organisms certainly\nlack it. However, some other explanation has to be provided for\nasexual organisms because they pass on their overall structure largely\nunchanged from generation to generation. For example, R. A. Fisher,\nin The Genetical Theory of Natural Selection (Fisher\n1930) considered the entire genetic complement of asexual organisms to\nbe a single gene, and this view has been repeated from time to time\nsince. According to Dawkins, genes, and only genes, can function as\nreplicators in biological evolution. How large these genetic units are\ndepends on such things as the prevalence of sex, the frequency of\ncrossover or lateral gene transfers, and the intensity of\nselection.\n\n\nIf there were sex but no crossing-over, each chromosome would be a\nreplicator, and we should speak of adaptations as being for the good\nof the chromosome. If there is no sex we can, by the same token, treat\nthe entire genome of an asexual organism as a replicator. But the\norganism itself is not a replicator. (Dawkins 1982a: 95)\n\n\nDawkins offered two reasons for organisms not being able to function\nas replicators. The first is the one he uses to delineate evolutionary\ngenes. As is the case for long stretches of DNA, organisms are too\neasily and frequently broken up to be considered units of replication.\nA second reason is that they cannot pass on changes in their\nstructure, although some phenotypic change may result in generational\nchange. In fact, some epigenetic mechanisms have been shown\nto be passed on across generations (Jablonka & Raz 2009; see the\nentry on\n inheritance systems).\n The amount of DNA that counts as a replicator certainly varies; but,\naccording to Dawkins, nothing more inclusive than the genetic material\nfunctions as replicators in biological evolution.\n\nIn The Selfish Gene, although Dawkins wanted his definition\nof gene to be close to that of Williams’ (1966)\n“evolutionary gene”, it is not quite:\n\n\nA gene is defined as any portion of chromosomal material which\npotentially lasts for enough generations to serve as a unit of natural\nselection. (Dawkins 1976: 30)\n\n\nWhere Williams’ definition is substrate neutral, Dawkins’\nis explicitly chromosomal and DNA-based. Where William’s\n“gene” refers to any entity, which is the reason\nwhy it is an informational notion, Dawkins’ gene, by contrast,\nis tied to DNA, a view later heavily criticized by Stent (1977),\nan influential molecular biologist at the time.\n\nOn Dawkins’ account, the limits of genes need not be absolutely\nsharp. Nor must all genes be of the same length. The greater the\nselection pressure, the smaller the gene. At the most fundamental\nlevel, selection takes place between alternative alleles residing at\nthe same locus.\n\n\nAs far as a gene is concerned, its alleles are its deadly rivals, but\nother genes are just a part of its environment, comparable to\ntemperature, food, and predators, or companions. (Dawkins 1976:\n40)\n\n\nAlleles cannot cooperate with each other, only compete. That is\nwhere the “selfish” in “selfish gene” comes\nin. According to Dawkins (1976: 95), the selfish gene is not just one\nphysical bit of DNA. It is “all replicas of a particular bit of\nDNA, distributed throughout the world” (for a recent defense of\na similar approach, see Haig 2012). Hence, genes do not form classes\nof spatiotemporally unrelated individuals but trees. They must be\nreplicas. But, being a replica is not enough. The linear repetition of\nthe “same gene” in the form of several hundred copies is\nquite common. These replicas, however, do not reside at the same\nlocus. Although identical in structure, these genes do not\ncompete with each other in the way that alleles at the same locus can.\nIn the simplest and most basic sense, alleles compete with alternative\nalleles at the same locus. Any other sorts of competition and\ncooperation are merely extrapolations from this fundamental sense of\nallelic competition. Although genes may cooperate with each other in\nvery complicated ways in embryological development, in replication\nthey can be treated as “separate and distinct”. In\ndevelopment, the effects of genes blend. In replication, replicators\ndo not blend.\n",
    "section_title": "3.1 Genes as Replicators",
    "entry_title": "Replication and Reproduction",
    "hierarchy_title": "Replication and Reproduction || Dawkins’ View || Genes as Replicators",
    "tokenized_text": [
        "dawkins",
        "view",
        "gene",
        "replicators",
        "gene",
        "replicators",
        "longstanding",
        "dispute",
        "evolutionary",
        "biology",
        "concern",
        "level",
        "selection",
        "occur",
        "bourrat",
        "b",
        "brandon",
        "kerr",
        "godfreysmith",
        "keller",
        "lloyd",
        "okasha",
        "sober",
        "wilson",
        "williams",
        "see",
        "entry",
        "unit",
        "level",
        "selection",
        "author",
        "see",
        "dispute",
        "concerning",
        "level",
        "replication",
        "take",
        "place",
        "author",
        "take",
        "level",
        "selection",
        "dispute",
        "concern",
        "environmental",
        "interaction",
        "insist",
        "environmental",
        "interaction",
        "take",
        "place",
        "variety",
        "level",
        "single",
        "gene",
        "cell",
        "organism",
        "colony",
        "demes",
        "possibly",
        "entire",
        "specie",
        "organism",
        "certainly",
        "interact",
        "environment",
        "way",
        "bias",
        "transmission",
        "gene",
        "entity",
        "le",
        "inclusive",
        "entire",
        "organism",
        "eg",
        "sperm",
        "cell",
        "inclusive",
        "eg",
        "beehive",
        "dawkins",
        "argued",
        "replication",
        "biological",
        "evolution",
        "occurs",
        "exclusively",
        "level",
        "genetic",
        "material",
        "term",
        "replication",
        "refers",
        "first",
        "foremost",
        "copying",
        "gene",
        "selfreplicating",
        "molecule",
        "biology",
        "critic",
        "eg",
        "lewontin",
        "interpreted",
        "mean",
        "strand",
        "dna",
        "placed",
        "glass",
        "slide",
        "might",
        "start",
        "replicating",
        "course",
        "biologist",
        "ever",
        "held",
        "view",
        "gene",
        "replicate",
        "aid",
        "highly",
        "complicated",
        "molecular",
        "machinery",
        "often",
        "however",
        "importance",
        "machinery",
        "gone",
        "unnoticed",
        "sure",
        "make",
        "copy",
        "photocopier",
        "interested",
        "text",
        "figure",
        "scrawl",
        "appear",
        "sheet",
        "paper",
        "interested",
        "photocopier",
        "work",
        "even",
        "work",
        "dawkins",
        "early",
        "writing",
        "replicators",
        "vehicle",
        "played",
        "different",
        "complementary",
        "equally",
        "important",
        "role",
        "selection",
        "however",
        "honed",
        "view",
        "evolutionary",
        "process",
        "vehicle",
        "became",
        "le",
        "le",
        "fundamental",
        "initially",
        "dawkins",
        "content",
        "dethrone",
        "organism",
        "pride",
        "place",
        "biology",
        "important",
        "focus",
        "environmental",
        "interaction",
        "entity",
        "organismic",
        "level",
        "also",
        "function",
        "vehicle",
        "later",
        "writing",
        "however",
        "dawkins",
        "went",
        "even",
        "argue",
        "phenotypic",
        "trait",
        "really",
        "matter",
        "evolution",
        "natural",
        "selection",
        "occur",
        "treated",
        "independently",
        "organized",
        "vehicle",
        "feature",
        "spider",
        "web",
        "viewed",
        "part",
        "spider",
        "phenotype",
        "hence",
        "dawkins",
        "titled",
        "second",
        "book",
        "extended",
        "phenotype",
        "dawkins",
        "b",
        "dawkins",
        "never",
        "lost",
        "fascination",
        "vehicular",
        "adaptation",
        "fascination",
        "critic",
        "denigrate",
        "panglossian",
        "adaptationism",
        "filled",
        "book",
        "adaptationist",
        "scenario",
        "firmly",
        "supported",
        "data",
        "others",
        "however",
        "perspective",
        "structure",
        "evolutionary",
        "theory",
        "held",
        "replicators",
        "much",
        "important",
        "vehicle",
        "example",
        "dawkins",
        "argued",
        "length",
        "adaptation",
        "always",
        "good",
        "replicators",
        "vehicle",
        "lloyd",
        "see",
        "entry",
        "unit",
        "level",
        "selection",
        "vehicle",
        "exhibit",
        "adaptation",
        "ultimately",
        "adaptation",
        "must",
        "explicable",
        "term",
        "change",
        "gene",
        "frequency",
        "thus",
        "come",
        "surprise",
        "dawkins",
        "proclaims",
        "coined",
        "term",
        "vehicle",
        "praise",
        "bury",
        "prevalent",
        "organism",
        "might",
        "definite",
        "causal",
        "role",
        "play",
        "selection",
        "reference",
        "must",
        "omitted",
        "perspicuous",
        "characterization",
        "selection",
        "evolutionary",
        "process",
        "although",
        "dawkins",
        "far",
        "genetic",
        "determinist",
        "certainly",
        "genetic",
        "reductionist",
        "whether",
        "reductionism",
        "good",
        "bad",
        "moot",
        "question",
        "sarkar",
        "according",
        "dawkins",
        "replicators",
        "three",
        "basic",
        "propertieslongevity",
        "fecundity",
        "copyfidelity",
        "longevity",
        "mean",
        "longevity",
        "gene",
        "type",
        "form",
        "copy",
        "descent",
        "dawkins",
        "b",
        "hull",
        "although",
        "stability",
        "gene",
        "token",
        "included",
        "definition",
        "selfish",
        "gene",
        "gene",
        "physical",
        "body",
        "last",
        "long",
        "mitosis",
        "gene",
        "loses",
        "half",
        "substance",
        "replication",
        "endures",
        "say",
        "entity",
        "information",
        "incorporated",
        "structure",
        "information",
        "copied",
        "high",
        "fidelity",
        "mutation",
        "occur",
        "low",
        "frequency",
        "even",
        "organism",
        "mutation",
        "rate",
        "must",
        "high",
        "mechanism",
        "evolved",
        "search",
        "repair",
        "error",
        "therefore",
        "genotype",
        "informational",
        "notion",
        "information",
        "equivalent",
        "aristotelian",
        "form",
        "type",
        "form",
        "token",
        "dawkins",
        "view",
        "one",
        "source",
        "variation",
        "gene",
        "sexual",
        "organism",
        "supplementing",
        "mutation",
        "crossover",
        "pair",
        "homologous",
        "chromosome",
        "line",
        "next",
        "meiosis",
        "crossover",
        "recombine",
        "stretch",
        "dna",
        "different",
        "allele",
        "exist",
        "result",
        "change",
        "information",
        "quite",
        "obviously",
        "shorter",
        "stretch",
        "dna",
        "involved",
        "le",
        "likely",
        "crossover",
        "occur",
        "message",
        "change",
        "dawkins",
        "appeal",
        "dismantling",
        "entity",
        "argue",
        "organism",
        "functioning",
        "replicators",
        "sexual",
        "organism",
        "organism",
        "torn",
        "apart",
        "repeatedly",
        "assembled",
        "generation",
        "caporael",
        "long",
        "stretch",
        "dna",
        "lack",
        "necessary",
        "identity",
        "descent",
        "function",
        "replicators",
        "sexual",
        "organism",
        "certainly",
        "lack",
        "however",
        "explanation",
        "provided",
        "asexual",
        "organism",
        "pas",
        "overall",
        "structure",
        "largely",
        "unchanged",
        "generation",
        "generation",
        "example",
        "r",
        "a",
        "fisher",
        "genetical",
        "theory",
        "natural",
        "selection",
        "fisher",
        "considered",
        "entire",
        "genetic",
        "complement",
        "asexual",
        "organism",
        "single",
        "gene",
        "view",
        "repeated",
        "time",
        "time",
        "since",
        "according",
        "dawkins",
        "gene",
        "gene",
        "function",
        "replicators",
        "biological",
        "evolution",
        "large",
        "genetic",
        "unit",
        "depends",
        "thing",
        "prevalence",
        "sex",
        "frequency",
        "crossover",
        "lateral",
        "gene",
        "transfer",
        "intensity",
        "selection",
        "sex",
        "crossingover",
        "chromosome",
        "would",
        "replicator",
        "speak",
        "adaptation",
        "good",
        "chromosome",
        "sex",
        "token",
        "treat",
        "entire",
        "genome",
        "asexual",
        "organism",
        "replicator",
        "organism",
        "replicator",
        "dawkins",
        "a",
        "dawkins",
        "offered",
        "two",
        "reason",
        "organism",
        "able",
        "function",
        "replicators",
        "first",
        "one",
        "us",
        "delineate",
        "evolutionary",
        "gene",
        "case",
        "long",
        "stretch",
        "dna",
        "organism",
        "easily",
        "frequently",
        "broken",
        "considered",
        "unit",
        "replication",
        "second",
        "reason",
        "pas",
        "change",
        "structure",
        "although",
        "phenotypic",
        "change",
        "may",
        "result",
        "generational",
        "change",
        "fact",
        "epigenetic",
        "mechanism",
        "shown",
        "passed",
        "across",
        "generation",
        "jablonka",
        "raz",
        "see",
        "entry",
        "inheritance",
        "system",
        "amount",
        "dna",
        "count",
        "replicator",
        "certainly",
        "varies",
        "according",
        "dawkins",
        "nothing",
        "inclusive",
        "genetic",
        "material",
        "function",
        "replicators",
        "biological",
        "evolution",
        "selfish",
        "gene",
        "although",
        "dawkins",
        "wanted",
        "definition",
        "gene",
        "close",
        "williams",
        "evolutionary",
        "gene",
        "quite",
        "gene",
        "defined",
        "portion",
        "chromosomal",
        "material",
        "potentially",
        "last",
        "enough",
        "generation",
        "serve",
        "unit",
        "natural",
        "selection",
        "dawkins",
        "williams",
        "definition",
        "substrate",
        "neutral",
        "dawkins",
        "explicitly",
        "chromosomal",
        "dnabased",
        "william",
        "gene",
        "refers",
        "entity",
        "reason",
        "informational",
        "notion",
        "dawkins",
        "gene",
        "contrast",
        "tied",
        "dna",
        "view",
        "later",
        "heavily",
        "criticized",
        "stent",
        "influential",
        "molecular",
        "biologist",
        "time",
        "dawkins",
        "account",
        "limit",
        "gene",
        "need",
        "absolutely",
        "sharp",
        "must",
        "gene",
        "length",
        "greater",
        "selection",
        "pressure",
        "smaller",
        "gene",
        "fundamental",
        "level",
        "selection",
        "take",
        "place",
        "alternative",
        "allele",
        "residing",
        "locus",
        "far",
        "gene",
        "concerned",
        "allele",
        "deadly",
        "rival",
        "gene",
        "part",
        "environment",
        "comparable",
        "temperature",
        "food",
        "predator",
        "companion",
        "dawkins",
        "allele",
        "cooperate",
        "compete",
        "selfish",
        "selfish",
        "gene",
        "come",
        "according",
        "dawkins",
        "selfish",
        "gene",
        "one",
        "physical",
        "bit",
        "dna",
        "replica",
        "particular",
        "bit",
        "dna",
        "distributed",
        "throughout",
        "world",
        "recent",
        "defense",
        "similar",
        "approach",
        "see",
        "haig",
        "hence",
        "gene",
        "form",
        "class",
        "spatiotemporally",
        "unrelated",
        "individual",
        "tree",
        "must",
        "replica",
        "replica",
        "enough",
        "linear",
        "repetition",
        "gene",
        "form",
        "several",
        "hundred",
        "copy",
        "quite",
        "common",
        "replica",
        "however",
        "reside",
        "locus",
        "although",
        "identical",
        "structure",
        "gene",
        "compete",
        "way",
        "allele",
        "locus",
        "simplest",
        "basic",
        "sense",
        "allele",
        "compete",
        "alternative",
        "allele",
        "locus",
        "sort",
        "competition",
        "cooperation",
        "merely",
        "extrapolation",
        "fundamental",
        "sense",
        "allelic",
        "competition",
        "although",
        "gene",
        "may",
        "cooperate",
        "complicated",
        "way",
        "embryological",
        "development",
        "replication",
        "treated",
        "separate",
        "distinct",
        "development",
        "effect",
        "gene",
        "blend",
        "replication",
        "replicators",
        "blend"
    ]
}