{
    "main_text": "The Concept of Respect || Kinds of Respect\n1.2 Kinds of Respect\n\nThat it is the nature of the object that determines its\nrespect-worthiness, and that there are different kinds of objects\ncalling for correspondingly different responses, have led many\nphilosophers to argue that there are different kinds of respect. In\nwhat follows, three sets of distinctions will be discussed.\n\nSpeculating on the historical development of the idea that all persons\nas such deserve respect, and using terms found in Kant’s\nwritings on Achtung (the German word usually translated as\n“respect”), Feinberg (1975) identifies three concepts for\nwhich “respect” has been the name. (1) Respekt,\nis the “uneasy and watchful attitude that has ‘the element\nof fear’ in it” (1975, 1). Its objects are dangerous or\npowerful things. It is respekt that woodworkers are\nencouraged to have for power tools, a new sailor might be admonished\nto have for the sea, and a child might have for an abusive parent.\nRespekt contrasts with contemptuous disregard; it is shown in\nconduct that is cautious, self-protective, other-placating. (2) The\nsecond concept, observantia, is the moralized analogue of\nrespekt. It involves regarding the object as making a\nrightful claim on our conduct, as deserving moral consideration in its\nown right, independently of considerations of personal well-being. It\nis observantia, Feinberg maintains, that historically was\nextended first to classes of non-dangerous but otherwise worthy people\nand then to all persons as such, regardless of merit or ability.\nObservantia encompasses both the respect said to be owed to\nall humans equally and the forms of polite respect and deference that\nacknowledge different social positions. On Kant’s account,\nobservantia is the kind of respect we have an inviolable\nmoral duty to give every person, both by acknowledging their claim to\nmoral equality with us and by never treating persons as if they have\nlittle or no worth compared with ourselves (Kant 1797, 6:499). (3)\nReverentia, the third concept, is the special feeling of\nprofound awe and respect we involuntarily experience in the presence\nof something extraordinary or sublime, a feeling that both humbles and\nuplifts us. On Kant’s account, the moral law and people who\nexemplify it in morally worthy actions elicit reverentia from\nus, for we experience the law or its exemplification as\n“something that always trumps our inclinations in determining\nour wills” (Feinberg 1975, 2). Feinberg sees different forms of\npower as underlying the three kinds of respect; in each case, respect\nis the acknowledgment of the power of something other than ourselves\nto demand, command, or make claims on our attention, consideration,\nand deference. (See further discussion of Kant’s account in\nsection 2.2.)\n\nHudson (1980) draws a four-fold distinction among kinds of respect,\naccording to the bases in the objects. Consider the following\nexamples: (a) respecting a colleague highly as a scholar and having a\nlot of respect for someone with “guts”; (b) a mountain\nclimber’s respect for the elements and a tennis player’s\nrespect for her opponent’s strong backhand; (c) respecting the\nterms of an agreement and respecting a person’s rights; and (d)\nshowing respect for a judge by rising when she enters the courtroom\nand respecting a worn-out flag by burning it rather than tossing it in\nthe trash. The respect in (a), evaluative respect, is similar\nto other favorable attitudes such as esteem and admiration; it is\nearned or deserved (or not) depending on whether and to the degree\nthat the object is judged to meet certain standards. Obstacle\nrespect, in (b), is a matter of regarding the object as something\nthat, if not taken proper account of in one’s decisions about\nhow to act, could prevent one from achieving one’s ends. The\nobjects of (c) directive respect are directives: things such\nas requests, rules, advice, laws, or rights claims that may be taken\nas guides to action. One respects a directive when one’s actions\nintentionally comply with it. The objects of (d) institutional\nrespect are social institutions or practices, positions or roles\nin an institution or practice, and persons or things that occupy\npositions in or represent the institution. Institutional respect is\nconstituted by behavior that conforms to rules that prescribe certain\nconduct as respectful. These four forms of respect differ in several\nways. Each identifies a quite different kind of feature of objects as\nthe basis of respect. Each is expressed in action in quite different\nways, although evaluative respect need not be expressed at all.\nEvaluative respect centrally involves having a favorable attitude\ntoward the object, while the other forms do not. Directive respect\ndoes not admit of degrees (one either obeys the rule or\ndoesn’t), but the others do (we can have more evaluative respect\nfor one person than another). Hudson uses this distinction to argue\nthat respect for persons is not a unique kind of respect but should be\nconceived rather as involving some combination or other of these\nfour.\n\nTo Hudson’s four-fold classification, Dillon (1992a) adds a\nfifth form, care respect, which draws on feminist ethics of\ncare. Care respect, which is exemplified in an\nenvironmentalist’s deep respect for nature, involves both\nregarding the object as having profound and perhaps unique value and\nso cherishing it, and perceiving it as fragile or calling for special\ncare and so acting or forbearing to act out of felt benevolent concern\nfor it.\n\nDarwall (1977) distinguishes two kinds of respect: recognition\nrespect and appraisal respect. Recognition respect is\nthe disposition to give appropriate weight or consideration in\none’s practical deliberations to some fact about the object and\nto regulate one’s conduct by constraints derived from that fact.\n(Frankena 1986 and Cranor 1982, 1983 refer to this as\n“consideration respect.”) A wide variety of objects can be\nobjects of recognition respect, including laws, dangerous things,\nsomeone’s feelings, social institutions, nature, the selves\nindividuals present in different contexts, people occupying certain\nsocial roles or positions, and persons as such. Appraisal respect, by\ncontrast, is an attitude of positive appraisal, the “thinking highly\nof” kind of respect that we might have a great deal of for some\nindividuals, little of for others, or lose for those whose clay feet\nor dirty laundry becomes apparent. Appraisal respect involves a\ngrading assessment of a person in light of some qualitative standards\nthat they can meet or not to greater and lesser degrees. It differs\nfrom the more widely grounded esteem and admiration in that it is\nconcerned specifically with the moral quality of people’s\ncharacter or conduct, or with other characteristics that are relevant\nto their moral quality as agents. \n\nThe recognition/appraisal distinction has been quite influential and\nis widely regarded as the fundamental distinction. Indeed, evaluative\nrespect is similar to appraisal respect, while respekt,\nobstacle respect, observantia, directive respect,\ninstitutional respect, and care respect could be analyzed as forms of\nrecognition respect. Some philosophers, however, have found the\nrecognition/appraisal distinction to be inadequate, inasmuch as it\nseems to have no room for reverentia, especially in the form\nof the felt experience of the sublimity of the moral law and of\npersons as such (e.g., Buss 1999b), and it seems to obscure the\nvariety of valuings that different modes of respect can involve. Much\nphilosophical work has involved refining the recognition/appraisal\ndistinction.\n\nIn the rest of this article, I will discuss respect and self-respect\nusing Darwall’s term “recognition respect,”\nHudson’s term “evaluative respect,” and\nFeinberg’s “reverential respect” (the last for the\nvaluing feeling that is involuntary motivational without being\ndeliberative), specifying the valuing dimensions as necessary.\n\nIn everyday discourse, respect most commonly refers to one of two\nattitudes or modes of conduct. The first is the kind of respect\nindividuals show (or should show) others because of the latter’s\nsocial role or position. For example, children should respect their\nparents by listening and courtroom spectators should respect the\njudge. by rising upon her entrance. This is a social form of\nrecognition respect that is, typically, structured by social\ninstitutions whose norms are authoritative for participants in the\ninstitutions and that need not involve any positive valuing of the\nobject. “Respect” is also commonly used, second, in a\nvaluing sense, to mean thinking highly of someone: having a lot of\nrespect for someone who has overcome adversity or losing all respect\nfor a betrayer. This is evaluative respect. However, philosophical\nattention to respect has tended to focus on recognition respect that\nacknowledges or values the object from a moral point of view, which we\ncan call “moral recognition respect.” These discussions tend to relate\nsuch respect to the concepts of moral standing or moral worth. Moral\nstanding, or moral considerability, is the idea that certain things\nmatter morally in their own right and so are appropriate objects of\ndirect fundamental moral consideration or concern (Birch 1993; P.\nTaylor 1986). Alternatively, it is argued that certain things\nhave a distinctive kind of intrinsic moral worth, often called\n“dignity,” in virtue of which evoke reverential respect or\nought to be accorded some valuing form of moral recognition respect.\nIn modern philosophical discussions, humans are universally regarded\nas the paradigm objects of moral respect. Although some theorists\nargue that nature (or, all living beings, species, ecosystems) or\nsocieties (or, cultures, traditions) also warrant the moral\nconsideration and valuing of moral recognition respect, most\nphilosophical discussion of respect has focused on moral recognition\nrespect for persons.\n",
    "section_title": "1.2 Kinds of Respect",
    "entry_title": "Respect",
    "hierarchy_title": "Respect || The Concept of Respect || Kinds of Respect",
    "tokenized_text": [
        "concept",
        "respect",
        "kind",
        "respect",
        "kind",
        "respect",
        "nature",
        "object",
        "determines",
        "respectworthiness",
        "different",
        "kind",
        "object",
        "calling",
        "correspondingly",
        "different",
        "response",
        "led",
        "many",
        "philosopher",
        "argue",
        "different",
        "kind",
        "respect",
        "follows",
        "three",
        "set",
        "distinction",
        "discussed",
        "speculating",
        "historical",
        "development",
        "idea",
        "person",
        "deserve",
        "respect",
        "using",
        "term",
        "found",
        "kant",
        "writing",
        "achtung",
        "german",
        "word",
        "usually",
        "translated",
        "respect",
        "feinberg",
        "identifies",
        "three",
        "concept",
        "respect",
        "name",
        "respekt",
        "uneasy",
        "watchful",
        "attitude",
        "element",
        "fear",
        "object",
        "dangerous",
        "powerful",
        "thing",
        "respekt",
        "woodworker",
        "encouraged",
        "power",
        "tool",
        "new",
        "sailor",
        "might",
        "admonished",
        "sea",
        "child",
        "might",
        "abusive",
        "parent",
        "respekt",
        "contrast",
        "contemptuous",
        "disregard",
        "shown",
        "conduct",
        "cautious",
        "selfprotective",
        "otherplacating",
        "second",
        "concept",
        "observantia",
        "moralized",
        "analogue",
        "respekt",
        "involves",
        "regarding",
        "object",
        "making",
        "rightful",
        "claim",
        "conduct",
        "deserving",
        "moral",
        "consideration",
        "right",
        "independently",
        "consideration",
        "personal",
        "wellbeing",
        "observantia",
        "feinberg",
        "maintains",
        "historically",
        "extended",
        "first",
        "class",
        "nondangerous",
        "otherwise",
        "worthy",
        "people",
        "person",
        "regardless",
        "merit",
        "ability",
        "observantia",
        "encompasses",
        "respect",
        "said",
        "owed",
        "human",
        "equally",
        "form",
        "polite",
        "respect",
        "deference",
        "acknowledge",
        "different",
        "social",
        "position",
        "kant",
        "account",
        "observantia",
        "kind",
        "respect",
        "inviolable",
        "moral",
        "duty",
        "give",
        "every",
        "person",
        "acknowledging",
        "claim",
        "moral",
        "equality",
        "u",
        "never",
        "treating",
        "person",
        "little",
        "worth",
        "compared",
        "kant",
        "reverentia",
        "third",
        "concept",
        "special",
        "feeling",
        "profound",
        "awe",
        "respect",
        "involuntarily",
        "experience",
        "presence",
        "something",
        "extraordinary",
        "sublime",
        "feeling",
        "humbles",
        "uplift",
        "u",
        "kant",
        "account",
        "moral",
        "law",
        "people",
        "exemplify",
        "morally",
        "worthy",
        "action",
        "elicit",
        "reverentia",
        "u",
        "experience",
        "law",
        "exemplification",
        "something",
        "always",
        "trump",
        "inclination",
        "determining",
        "will",
        "feinberg",
        "feinberg",
        "see",
        "different",
        "form",
        "power",
        "underlying",
        "three",
        "kind",
        "respect",
        "case",
        "respect",
        "acknowledgment",
        "power",
        "something",
        "demand",
        "command",
        "make",
        "claim",
        "attention",
        "consideration",
        "deference",
        "see",
        "discussion",
        "kant",
        "account",
        "section",
        "hudson",
        "draw",
        "fourfold",
        "distinction",
        "among",
        "kind",
        "respect",
        "according",
        "base",
        "object",
        "consider",
        "following",
        "example",
        "respecting",
        "colleague",
        "highly",
        "scholar",
        "lot",
        "respect",
        "someone",
        "gut",
        "b",
        "mountain",
        "climber",
        "respect",
        "element",
        "tennis",
        "player",
        "respect",
        "opponent",
        "strong",
        "backhand",
        "c",
        "respecting",
        "term",
        "agreement",
        "respecting",
        "person",
        "right",
        "showing",
        "respect",
        "judge",
        "rising",
        "enters",
        "courtroom",
        "respecting",
        "wornout",
        "flag",
        "burning",
        "rather",
        "tossing",
        "trash",
        "respect",
        "evaluative",
        "respect",
        "similar",
        "favorable",
        "attitude",
        "esteem",
        "admiration",
        "earned",
        "deserved",
        "depending",
        "whether",
        "degree",
        "object",
        "judged",
        "meet",
        "certain",
        "standard",
        "obstacle",
        "respect",
        "b",
        "matter",
        "regarding",
        "object",
        "something",
        "taken",
        "proper",
        "account",
        "one",
        "decision",
        "act",
        "could",
        "prevent",
        "one",
        "achieving",
        "one",
        "end",
        "object",
        "c",
        "directive",
        "respect",
        "directive",
        "thing",
        "request",
        "rule",
        "advice",
        "law",
        "right",
        "claim",
        "may",
        "taken",
        "guide",
        "action",
        "one",
        "respect",
        "directive",
        "one",
        "action",
        "intentionally",
        "comply",
        "object",
        "institutional",
        "respect",
        "social",
        "institution",
        "practice",
        "position",
        "role",
        "institution",
        "practice",
        "person",
        "thing",
        "occupy",
        "position",
        "represent",
        "institution",
        "institutional",
        "respect",
        "constituted",
        "behavior",
        "conforms",
        "rule",
        "prescribe",
        "certain",
        "conduct",
        "respectful",
        "four",
        "form",
        "respect",
        "differ",
        "several",
        "way",
        "identifies",
        "quite",
        "different",
        "kind",
        "feature",
        "object",
        "basis",
        "respect",
        "expressed",
        "action",
        "quite",
        "different",
        "way",
        "although",
        "evaluative",
        "respect",
        "need",
        "expressed",
        "evaluative",
        "respect",
        "centrally",
        "involves",
        "favorable",
        "attitude",
        "toward",
        "object",
        "form",
        "directive",
        "respect",
        "admit",
        "degree",
        "one",
        "either",
        "obeys",
        "rule",
        "others",
        "evaluative",
        "respect",
        "one",
        "person",
        "another",
        "hudson",
        "us",
        "distinction",
        "argue",
        "respect",
        "person",
        "unique",
        "kind",
        "respect",
        "conceived",
        "rather",
        "involving",
        "combination",
        "four",
        "hudson",
        "fourfold",
        "classification",
        "dillon",
        "a",
        "add",
        "fifth",
        "form",
        "care",
        "respect",
        "draw",
        "feminist",
        "ethic",
        "care",
        "care",
        "respect",
        "exemplified",
        "environmentalist",
        "deep",
        "respect",
        "nature",
        "involves",
        "regarding",
        "object",
        "profound",
        "perhaps",
        "unique",
        "value",
        "cherishing",
        "perceiving",
        "fragile",
        "calling",
        "special",
        "care",
        "acting",
        "forbearing",
        "act",
        "felt",
        "benevolent",
        "concern",
        "darwall",
        "distinguishes",
        "two",
        "kind",
        "respect",
        "recognition",
        "respect",
        "appraisal",
        "respect",
        "recognition",
        "respect",
        "disposition",
        "give",
        "appropriate",
        "weight",
        "consideration",
        "one",
        "practical",
        "deliberation",
        "fact",
        "object",
        "regulate",
        "one",
        "conduct",
        "constraint",
        "derived",
        "fact",
        "frankena",
        "cranor",
        "refer",
        "consideration",
        "respect",
        "wide",
        "variety",
        "object",
        "object",
        "recognition",
        "respect",
        "including",
        "law",
        "dangerous",
        "thing",
        "someone",
        "feeling",
        "social",
        "institution",
        "nature",
        "self",
        "individual",
        "present",
        "different",
        "context",
        "people",
        "occupying",
        "certain",
        "social",
        "role",
        "position",
        "person",
        "appraisal",
        "respect",
        "contrast",
        "attitude",
        "positive",
        "appraisal",
        "thinking",
        "highly",
        "kind",
        "respect",
        "might",
        "great",
        "deal",
        "individual",
        "little",
        "others",
        "lose",
        "whose",
        "clay",
        "foot",
        "dirty",
        "laundry",
        "becomes",
        "apparent",
        "appraisal",
        "respect",
        "involves",
        "grading",
        "assessment",
        "person",
        "light",
        "qualitative",
        "standard",
        "meet",
        "greater",
        "lesser",
        "degree",
        "differs",
        "widely",
        "grounded",
        "esteem",
        "admiration",
        "concerned",
        "specifically",
        "moral",
        "quality",
        "people",
        "character",
        "conduct",
        "characteristic",
        "relevant",
        "moral",
        "quality",
        "agent",
        "recognitionappraisal",
        "distinction",
        "quite",
        "influential",
        "widely",
        "regarded",
        "fundamental",
        "distinction",
        "indeed",
        "evaluative",
        "respect",
        "similar",
        "appraisal",
        "respect",
        "respekt",
        "obstacle",
        "respect",
        "observantia",
        "directive",
        "respect",
        "institutional",
        "respect",
        "care",
        "respect",
        "could",
        "analyzed",
        "form",
        "recognition",
        "respect",
        "philosopher",
        "however",
        "found",
        "recognitionappraisal",
        "distinction",
        "inadequate",
        "inasmuch",
        "seems",
        "room",
        "reverentia",
        "especially",
        "form",
        "felt",
        "experience",
        "sublimity",
        "moral",
        "law",
        "person",
        "eg",
        "bus",
        "b",
        "seems",
        "obscure",
        "variety",
        "valuings",
        "different",
        "mode",
        "respect",
        "involve",
        "much",
        "philosophical",
        "work",
        "involved",
        "refining",
        "recognitionappraisal",
        "distinction",
        "rest",
        "article",
        "discus",
        "respect",
        "selfrespect",
        "using",
        "darwall",
        "term",
        "recognition",
        "respect",
        "hudson",
        "term",
        "evaluative",
        "respect",
        "feinberg",
        "reverential",
        "respect",
        "last",
        "valuing",
        "feeling",
        "involuntary",
        "motivational",
        "without",
        "deliberative",
        "specifying",
        "valuing",
        "dimension",
        "necessary",
        "everyday",
        "discourse",
        "respect",
        "commonly",
        "refers",
        "one",
        "two",
        "attitude",
        "mode",
        "conduct",
        "first",
        "kind",
        "respect",
        "individual",
        "show",
        "show",
        "others",
        "latter",
        "social",
        "role",
        "position",
        "example",
        "child",
        "respect",
        "parent",
        "listening",
        "courtroom",
        "spectator",
        "respect",
        "judge",
        "rising",
        "upon",
        "entrance",
        "social",
        "form",
        "recognition",
        "respect",
        "typically",
        "structured",
        "social",
        "institution",
        "whose",
        "norm",
        "authoritative",
        "participant",
        "institution",
        "need",
        "involve",
        "positive",
        "valuing",
        "object",
        "respect",
        "also",
        "commonly",
        "used",
        "second",
        "valuing",
        "sense",
        "mean",
        "thinking",
        "highly",
        "someone",
        "lot",
        "respect",
        "someone",
        "overcome",
        "adversity",
        "losing",
        "respect",
        "betrayer",
        "evaluative",
        "respect",
        "however",
        "philosophical",
        "attention",
        "respect",
        "tended",
        "focus",
        "recognition",
        "respect",
        "acknowledges",
        "value",
        "object",
        "moral",
        "point",
        "view",
        "call",
        "moral",
        "recognition",
        "respect",
        "discussion",
        "tend",
        "relate",
        "respect",
        "concept",
        "moral",
        "standing",
        "moral",
        "worth",
        "moral",
        "standing",
        "moral",
        "considerability",
        "idea",
        "certain",
        "thing",
        "matter",
        "morally",
        "right",
        "appropriate",
        "object",
        "direct",
        "fundamental",
        "moral",
        "consideration",
        "concern",
        "birch",
        "p",
        "taylor",
        "alternatively",
        "argued",
        "certain",
        "thing",
        "distinctive",
        "kind",
        "intrinsic",
        "moral",
        "worth",
        "often",
        "called",
        "dignity",
        "virtue",
        "evoke",
        "reverential",
        "respect",
        "ought",
        "accorded",
        "valuing",
        "form",
        "moral",
        "recognition",
        "respect",
        "modern",
        "philosophical",
        "discussion",
        "human",
        "universally",
        "regarded",
        "paradigm",
        "object",
        "moral",
        "respect",
        "although",
        "theorist",
        "argue",
        "nature",
        "living",
        "being",
        "specie",
        "ecosystem",
        "society",
        "culture",
        "tradition",
        "also",
        "warrant",
        "moral",
        "consideration",
        "valuing",
        "moral",
        "recognition",
        "respect",
        "philosophical",
        "discussion",
        "respect",
        "focused",
        "moral",
        "recognition",
        "respect",
        "person"
    ]
}