{
    "main_text": "The Concept of Respect || Elements of respect\n1.1 Elements of respect\n\nIt is widely acknowledged that there are different forms or kinds of\nrespect. This complicates the answering of these questions, since\nanswers concerning one form or kind of respect can diverge\nsignificantly from those about another. Much philosophical work has\ngone into explicating differences and links among the various\nkinds.\n\nOne general distinction concerns respect simply as behavior and\nrespect as an attitude or feeling that may or may not be expressed in\nor signified by behavior. When we speak of drivers respecting the\nspeed limit, hostile forces respecting a cease fire agreement, or the\nCovid-19 virus not respecting national borders, we can be referring\nsimply to behavior which avoids violation of or interference with some\nboundary, limit, or rule, without any reference to attitudes,\nfeelings, intentions, or dispositions, and even, as in the case of\nviruses, without imputing agency (Bird 2004). In such cases the\nbehavior is regarded as constitutive of respecting. Where respect is\nconceived of as a duty or an entitlement, a certain kind of behavior\nor treatment may be all that is owed. Similarly, respect as a tribute\ncould be just a certain mode of behavior, such as bowing or standing\nin silence. In other cases, however, we take respect to be or to\nexpress or signify an attitude or feeling, as when we speak of having\nrespect for someone or of certain behaviors as showing respect or\ndisrespect. Here, actions and modes of treatment count as respect\ninsofar as they either manifest an attitude of respect or are of the\nsort through which the attitude is characteristically expressed; a\nprinciple of respect is one that necessarily must be adopted by\nsomeone with the attitude of respect or that prescribes the attitude\nor actions that express it (Frankena 1986; Downie and Telfer 1969); a\nmoral virtue of respect involves having the attitude as a settled\naspect of one’s way of being toward appropriate objects. Most\ndiscussions of respect for persons take attitude to be central. In\nwhat follows, I will focus chiefly on respect as attitude. There are,\nagain, several different attitudes to which the term\n“respect” refers. Before looking at differences, however,\nit is useful first to note some elements common among varieties.\n\nAn attitude of respect is, most generally, a relation between a\nsubject and an object in which the subject responds to the object from\na certain perspective in some appropriate way. Respect necessarily has\nan object: respect is always directed toward, paid to, felt about,\nshown for some object. While a very wide variety of things can be\nappropriate objects of one kind of respect or another, the subject of\nrespect (the respecter) is typically a person, that is, a conscious\nrational being capable of recognizing objects, intentionally\nresponding to them, having and expressing values with regard to them,\nand being accountable for disrespecting or failing to respect them.\nRespect and disrespect can also be expressed or instantiated by or\nthrough things that are not persons, such as guidelines, rules, laws,\nand principles, systems, and institutional organizations and\noperations. So, we can say that laws that prohibit torture express\nrespect for persons while the institution of slavery is profoundly\ndisrespectful of human beings.\n\nOrdinary discourse about respect as a responsive relation identifies\nseveral key elements, including attention, deference, judgment,\nvaluing, and behavior. First, as its derivation from the Latin\nrespicere, (to look back at, look again) suggests, respect is\na form of regard: a mode of attention to and acknowledgment of an\nobject as something to be taken seriously. Respecting something\ncontrasts with being oblivious or indifferent to it, ignoring or\nquickly dismissing it, neglecting or disregarding it, or carelessly or\nintentionally misidentifying it. Respect is also perspectival: we can\nrespect something from a moral perspective, or from prudential,\nevaluative, social, or institutional perspectives. From different\nperspectives, we might attend to different aspects of the object in\nrespecting it or respect it in different ways. For example, one might\nregard another human individual as a rights-bearer, a judge, a\nsuperlative singer, a trustworthy person, or a threat to one’s\nsecurity, and the respect one accords her in each case will be\ndifferent. It is in virtue of this aspect of careful attention that\nrespect is sometimes thought of as an epistemic virtue.\n\nAs responsive, respect is as much object-based as subject-generated;\ncertain objects call for, claim, elicit, deserve, are owed respect. We\nrespect something not because we want to but because we recognize that\nwe have to respect it (Wood 1999); respect involves “a deontic\nexperience”—the experience that one must pay\nattention and respond appropriately (Birch 1993). It thus is\nmotivational: it is the recognition of something “as directly\ndetermining our will without reference to what is wanted by our\ninclinations” (Rawls 2000, 153). In this way respect differs\nfrom, for example, liking and fearing, which have their sources in the\nsubject’s interests or desires. When we respect something, we\nheed its call, accord it its due, acknowledge its claim. Thus, respect\ninvolves deference, in the most basic sense of yielding to the\nobject’s demands.\n\nThe idea that the object “drives” respect, as it were, is\ninvolved in the view that respect is an unmediated emotional response\n(Buss 1999b). But respect is typically treated as also an expression\nof the agency of the respecter: respect is deliberate, a matter of\ndirected rather than grabbed attention, of reflective consideration\nand judgment. On this view, respect is reason-governed: we cannot\nrespect a particular object for just any old reason or no reason at\nall. Rather, we respect something for the reason that it has, in our\njudgment, some respect-warranting characteristic, that makes it the\nkind of object that calls for that kind of response (Cranor 1975;\nPettit 2021). And these reasons are both objective, in the sense that\ntheir weight or stringency does not depend on the respecter’s\ninterests, goals, or desires, and categorical, in the sense that\nacting against these reasons, other things equal, is wrong (Raz 2001).\nRespect is thus both subjective and objective. It is subjective in\nthat the subject’s response is constructed from her\nunderstanding of the object and its characteristics and her judgments\nabout the legitimacy of its call and how fittingly to address the\ncall. The objectivity of respect means that an individual’s\nrespect for an object can be inappropriate or unwarranted, for the\nobject may not have the features she takes it to have, or the features\nshe takes to be respect-warranting might not be, or her idea of how\nproperly to treat the object might be mistaken. Moreover, the logic of\nrespect is the logic of objectivity and universality, in several ways.\nIn respecting an object, we respond to it as something whose\nsignificance is independent of us, not determined by our feelings or\ninterests. Our reasons for respecting something are, logically,\nreasons for other people to respect it (or at least to endorse our\nrespect for it from a common point of view). Respect is thus, unlike\nerotic or filial love, an impersonal response to the object. And if F\nis a respect-warranting feature of object O, then respecting O on\naccount of F commits us, other things equal, to respecting other\nthings with feature F.\n\nThere are many different kinds of objects that can reasonably be\nrespected and many different reasons why they warrant respect. Thus,\nwarranted responses can take different forms. Some things are\ndangerous or powerful; respecting them can involve fear, awe,\nself-protection, or submission. Other things have authority over us\nand the respect they are due includes acknowledgment of their\nauthority and perhaps obedience to their authoritative commands. Other\nforms of respect are modes of valuing, appreciating the object as\nhaving worth or importance that is independent of, perhaps even at\nvariance with, our desires or commitments. Thus, we can respect things\nwe don’t like or agree with, such as our enemies or someone\nelse’s opinion. Valuing respect is kin to esteem, admiration,\nveneration, reverence, and honor, while regarding something as utterly\nworthless or insignificant or disdaining or having contempt for it is\nincompatible with respecting it. Respect also aims to value its object\nappropriately, so it contrasts with degradation and discounting. The\nkinds of valuing that respect involves also contrast with other forms\nof valuing such as promoting or using (Anderson 1993, Pettit 1989).\nIndeed, regarding a person merely as useful (treating her as just a\nsexual object, an ATM machine, a research subject) is commonly\nidentified as a central form of disrespect for persons, and many\npeople decry the killing of endangered wild animals for their tusks or\nhides as disrespectful of nature.\n\nFinally, attitudes of respect typically have a behavioral component.\nIn respecting an object, we often consider it to be making legitimate\nclaims on our conduct as well as our thoughts and feelings and so we\nare disposed to behave appropriately. Appropriate behavior includes\nrefraining from certain treatment of the object or acting only in\nparticular ways in connection with it, ways that are regarded as\nfitting, deserved by, or owed to the object. And there are very many\nways to respect things: keeping our distance from them, helping them,\npraising or emulating them, obeying or abiding by them, not violating\nor interfering with them, destroying them only in some ways,\nprotecting or being careful with them, talking about them in ways that\nreflect their worth or status, mourning them, nurturing them. One can\nbehave in respectful ways, however, without having respect for the\nobject, as when a teen who disdains adults behaves respectfully toward\nher friend’s parents in a scheme to get the car, manipulating\nrather than respecting them. To be a form or expression of respect,\nbehavior has to be motivated by one’s acknowledgment of the\nobject as rightly calling for that behavior. On the other hand,\ncertain kinds of feelings would not count as respect if they did not\nfind expression in behavior or involved no dispositions to behave in\nappropriate ways, and if they did not spring from perceptions or\njudgments that the object is worthy of or calls for such behavior.\n\nThe attitudes of respect, then, have cognitive dimensions (beliefs,\nacknowledgments, judgments, commitments), affective dimensions\n(emotions, feelings, ways of experiencing things), and conative\ndimensions (motivations, dispositions to act and forbear from acting);\nsome forms also have valuational dimensions. One last dimension is\nnormative: the attitudes and actions of respect are governed by norms\nthat set standards of success or failure in responding to\nrespect-worthy-objects. Some norms are moral, grounded in moral\nprinciples or morally important characteristics of respect-worthy\nobjects and both endorsable by and authoritative for all moral agents.\nOther norms are social, arising from dimensions of social life,\ngrounded in socially significant characteristics of objectives, and\nauthoritative or applicable (only) for participants in that form of\nsociality.\n",
    "section_title": "1.1 Elements of respect",
    "entry_title": "Respect",
    "hierarchy_title": "Respect || The Concept of Respect || Elements of respect",
    "tokenized_text": [
        "concept",
        "respect",
        "element",
        "respect",
        "element",
        "respect",
        "widely",
        "acknowledged",
        "different",
        "form",
        "kind",
        "respect",
        "complicates",
        "answering",
        "question",
        "since",
        "answer",
        "concerning",
        "one",
        "form",
        "kind",
        "respect",
        "diverge",
        "significantly",
        "another",
        "much",
        "philosophical",
        "work",
        "gone",
        "explicating",
        "difference",
        "link",
        "among",
        "various",
        "kind",
        "one",
        "general",
        "distinction",
        "concern",
        "respect",
        "simply",
        "behavior",
        "respect",
        "attitude",
        "feeling",
        "may",
        "may",
        "expressed",
        "signified",
        "behavior",
        "speak",
        "driver",
        "respecting",
        "speed",
        "limit",
        "hostile",
        "force",
        "respecting",
        "cease",
        "fire",
        "agreement",
        "covid",
        "virus",
        "respecting",
        "national",
        "border",
        "referring",
        "simply",
        "behavior",
        "avoids",
        "violation",
        "interference",
        "boundary",
        "limit",
        "rule",
        "without",
        "reference",
        "attitude",
        "feeling",
        "intention",
        "disposition",
        "even",
        "case",
        "virus",
        "without",
        "imputing",
        "agency",
        "bird",
        "case",
        "behavior",
        "regarded",
        "constitutive",
        "respecting",
        "respect",
        "conceived",
        "duty",
        "entitlement",
        "certain",
        "kind",
        "behavior",
        "treatment",
        "may",
        "owed",
        "similarly",
        "respect",
        "tribute",
        "could",
        "certain",
        "mode",
        "behavior",
        "bowing",
        "standing",
        "silence",
        "case",
        "however",
        "take",
        "respect",
        "express",
        "signify",
        "attitude",
        "feeling",
        "speak",
        "respect",
        "someone",
        "certain",
        "behavior",
        "showing",
        "respect",
        "disrespect",
        "action",
        "mode",
        "treatment",
        "count",
        "respect",
        "insofar",
        "either",
        "manifest",
        "attitude",
        "respect",
        "sort",
        "attitude",
        "characteristically",
        "expressed",
        "principle",
        "respect",
        "one",
        "necessarily",
        "must",
        "adopted",
        "someone",
        "attitude",
        "respect",
        "prescribes",
        "attitude",
        "action",
        "express",
        "frankena",
        "downie",
        "telfer",
        "moral",
        "virtue",
        "respect",
        "involves",
        "attitude",
        "settled",
        "aspect",
        "one",
        "way",
        "toward",
        "appropriate",
        "object",
        "discussion",
        "respect",
        "person",
        "take",
        "attitude",
        "central",
        "follows",
        "focus",
        "chiefly",
        "respect",
        "attitude",
        "several",
        "different",
        "attitude",
        "term",
        "respect",
        "refers",
        "looking",
        "difference",
        "however",
        "useful",
        "first",
        "note",
        "element",
        "common",
        "among",
        "variety",
        "attitude",
        "respect",
        "generally",
        "relation",
        "subject",
        "object",
        "subject",
        "responds",
        "object",
        "certain",
        "perspective",
        "appropriate",
        "way",
        "respect",
        "necessarily",
        "object",
        "respect",
        "always",
        "directed",
        "toward",
        "paid",
        "felt",
        "shown",
        "object",
        "wide",
        "variety",
        "thing",
        "appropriate",
        "object",
        "one",
        "kind",
        "respect",
        "another",
        "subject",
        "respect",
        "respecter",
        "typically",
        "person",
        "conscious",
        "rational",
        "capable",
        "recognizing",
        "object",
        "intentionally",
        "responding",
        "expressing",
        "value",
        "regard",
        "accountable",
        "disrespecting",
        "failing",
        "respect",
        "respect",
        "disrespect",
        "also",
        "expressed",
        "instantiated",
        "thing",
        "person",
        "guideline",
        "rule",
        "law",
        "principle",
        "system",
        "institutional",
        "organization",
        "operation",
        "say",
        "law",
        "prohibit",
        "torture",
        "express",
        "respect",
        "person",
        "institution",
        "slavery",
        "profoundly",
        "disrespectful",
        "human",
        "being",
        "ordinary",
        "discourse",
        "respect",
        "responsive",
        "relation",
        "identifies",
        "several",
        "key",
        "element",
        "including",
        "attention",
        "deference",
        "judgment",
        "valuing",
        "behavior",
        "first",
        "derivation",
        "latin",
        "respicere",
        "look",
        "back",
        "look",
        "suggests",
        "respect",
        "form",
        "regard",
        "mode",
        "attention",
        "acknowledgment",
        "object",
        "something",
        "taken",
        "seriously",
        "respecting",
        "something",
        "contrast",
        "oblivious",
        "indifferent",
        "ignoring",
        "quickly",
        "dismissing",
        "neglecting",
        "disregarding",
        "carelessly",
        "intentionally",
        "misidentifying",
        "respect",
        "also",
        "perspectival",
        "respect",
        "something",
        "moral",
        "perspective",
        "prudential",
        "evaluative",
        "social",
        "institutional",
        "perspective",
        "different",
        "perspective",
        "might",
        "attend",
        "different",
        "aspect",
        "object",
        "respecting",
        "respect",
        "different",
        "way",
        "example",
        "one",
        "might",
        "regard",
        "another",
        "human",
        "individual",
        "rightsbearer",
        "judge",
        "superlative",
        "singer",
        "trustworthy",
        "person",
        "threat",
        "one",
        "security",
        "respect",
        "one",
        "accord",
        "case",
        "different",
        "virtue",
        "aspect",
        "careful",
        "attention",
        "respect",
        "sometimes",
        "thought",
        "epistemic",
        "virtue",
        "responsive",
        "respect",
        "much",
        "objectbased",
        "subjectgenerated",
        "certain",
        "object",
        "call",
        "claim",
        "elicit",
        "deserve",
        "owed",
        "respect",
        "respect",
        "something",
        "want",
        "recognize",
        "respect",
        "wood",
        "respect",
        "involves",
        "deontic",
        "experience",
        "the",
        "experience",
        "one",
        "must",
        "pay",
        "attention",
        "respond",
        "appropriately",
        "birch",
        "thus",
        "motivational",
        "recognition",
        "something",
        "directly",
        "determining",
        "without",
        "reference",
        "wanted",
        "inclination",
        "rawls",
        "way",
        "respect",
        "differs",
        "example",
        "liking",
        "fearing",
        "source",
        "subject",
        "interest",
        "desire",
        "respect",
        "something",
        "heed",
        "call",
        "accord",
        "due",
        "acknowledge",
        "claim",
        "thus",
        "respect",
        "involves",
        "deference",
        "basic",
        "sense",
        "yielding",
        "object",
        "demand",
        "idea",
        "object",
        "drive",
        "respect",
        "involved",
        "view",
        "respect",
        "unmediated",
        "emotional",
        "response",
        "bus",
        "b",
        "respect",
        "typically",
        "treated",
        "also",
        "expression",
        "agency",
        "respecter",
        "respect",
        "deliberate",
        "matter",
        "directed",
        "rather",
        "grabbed",
        "attention",
        "reflective",
        "consideration",
        "judgment",
        "view",
        "respect",
        "reasongoverned",
        "respect",
        "particular",
        "object",
        "old",
        "reason",
        "reason",
        "rather",
        "respect",
        "something",
        "reason",
        "judgment",
        "respectwarranting",
        "characteristic",
        "make",
        "kind",
        "object",
        "call",
        "kind",
        "response",
        "cranor",
        "pettit",
        "reason",
        "objective",
        "sense",
        "weight",
        "stringency",
        "depend",
        "respecter",
        "interest",
        "goal",
        "desire",
        "categorical",
        "sense",
        "acting",
        "reason",
        "thing",
        "equal",
        "wrong",
        "raz",
        "respect",
        "thus",
        "subjective",
        "objective",
        "subjective",
        "subject",
        "response",
        "constructed",
        "understanding",
        "object",
        "characteristic",
        "judgment",
        "legitimacy",
        "call",
        "fittingly",
        "address",
        "call",
        "objectivity",
        "respect",
        "mean",
        "individual",
        "respect",
        "object",
        "inappropriate",
        "unwarranted",
        "object",
        "may",
        "feature",
        "take",
        "feature",
        "take",
        "respectwarranting",
        "might",
        "idea",
        "properly",
        "treat",
        "object",
        "might",
        "mistaken",
        "moreover",
        "logic",
        "respect",
        "logic",
        "objectivity",
        "universality",
        "several",
        "way",
        "respecting",
        "object",
        "respond",
        "something",
        "whose",
        "significance",
        "independent",
        "u",
        "determined",
        "feeling",
        "interest",
        "reason",
        "respecting",
        "something",
        "logically",
        "reason",
        "people",
        "respect",
        "least",
        "endorse",
        "respect",
        "common",
        "point",
        "view",
        "respect",
        "thus",
        "unlike",
        "erotic",
        "filial",
        "love",
        "impersonal",
        "response",
        "object",
        "f",
        "respectwarranting",
        "feature",
        "object",
        "respecting",
        "account",
        "f",
        "commits",
        "u",
        "thing",
        "equal",
        "respecting",
        "thing",
        "feature",
        "f",
        "many",
        "different",
        "kind",
        "object",
        "reasonably",
        "respected",
        "many",
        "different",
        "reason",
        "warrant",
        "respect",
        "thus",
        "warranted",
        "response",
        "take",
        "different",
        "form",
        "thing",
        "dangerous",
        "powerful",
        "respecting",
        "involve",
        "fear",
        "awe",
        "selfprotection",
        "submission",
        "thing",
        "authority",
        "u",
        "respect",
        "due",
        "includes",
        "acknowledgment",
        "authority",
        "perhaps",
        "obedience",
        "authoritative",
        "command",
        "form",
        "respect",
        "mode",
        "valuing",
        "appreciating",
        "object",
        "worth",
        "importance",
        "independent",
        "perhaps",
        "even",
        "variance",
        "desire",
        "commitment",
        "thus",
        "respect",
        "thing",
        "like",
        "agree",
        "enemy",
        "someone",
        "else",
        "opinion",
        "valuing",
        "respect",
        "kin",
        "esteem",
        "admiration",
        "veneration",
        "reverence",
        "honor",
        "regarding",
        "something",
        "utterly",
        "worthless",
        "insignificant",
        "disdaining",
        "contempt",
        "incompatible",
        "respecting",
        "respect",
        "also",
        "aim",
        "value",
        "object",
        "appropriately",
        "contrast",
        "degradation",
        "discounting",
        "kind",
        "valuing",
        "respect",
        "involves",
        "also",
        "contrast",
        "form",
        "valuing",
        "promoting",
        "using",
        "anderson",
        "pettit",
        "indeed",
        "regarding",
        "person",
        "merely",
        "useful",
        "treating",
        "sexual",
        "object",
        "atm",
        "machine",
        "research",
        "subject",
        "commonly",
        "identified",
        "central",
        "form",
        "disrespect",
        "person",
        "many",
        "people",
        "decry",
        "killing",
        "endangered",
        "wild",
        "animal",
        "tusk",
        "hide",
        "disrespectful",
        "nature",
        "finally",
        "attitude",
        "respect",
        "typically",
        "behavioral",
        "component",
        "respecting",
        "object",
        "often",
        "consider",
        "making",
        "legitimate",
        "claim",
        "conduct",
        "well",
        "thought",
        "feeling",
        "disposed",
        "behave",
        "appropriately",
        "appropriate",
        "behavior",
        "includes",
        "refraining",
        "certain",
        "treatment",
        "object",
        "acting",
        "particular",
        "way",
        "connection",
        "way",
        "regarded",
        "fitting",
        "deserved",
        "owed",
        "object",
        "many",
        "way",
        "respect",
        "thing",
        "keeping",
        "distance",
        "helping",
        "praising",
        "emulating",
        "obeying",
        "abiding",
        "violating",
        "interfering",
        "destroying",
        "way",
        "protecting",
        "careful",
        "talking",
        "way",
        "reflect",
        "worth",
        "status",
        "mourning",
        "nurturing",
        "one",
        "behave",
        "respectful",
        "way",
        "however",
        "without",
        "respect",
        "object",
        "teen",
        "disdain",
        "adult",
        "behaves",
        "respectfully",
        "toward",
        "friend",
        "parent",
        "scheme",
        "get",
        "car",
        "manipulating",
        "rather",
        "respecting",
        "form",
        "expression",
        "respect",
        "behavior",
        "motivated",
        "one",
        "acknowledgment",
        "object",
        "rightly",
        "calling",
        "behavior",
        "hand",
        "certain",
        "kind",
        "feeling",
        "would",
        "count",
        "respect",
        "find",
        "expression",
        "behavior",
        "involved",
        "disposition",
        "behave",
        "appropriate",
        "way",
        "spring",
        "perception",
        "judgment",
        "object",
        "worthy",
        "call",
        "behavior",
        "attitude",
        "respect",
        "cognitive",
        "dimension",
        "belief",
        "acknowledgment",
        "judgment",
        "commitment",
        "affective",
        "dimension",
        "emotion",
        "feeling",
        "way",
        "experiencing",
        "thing",
        "conative",
        "dimension",
        "motivation",
        "disposition",
        "act",
        "forbear",
        "acting",
        "form",
        "also",
        "valuational",
        "dimension",
        "one",
        "last",
        "dimension",
        "normative",
        "attitude",
        "action",
        "respect",
        "governed",
        "norm",
        "set",
        "standard",
        "success",
        "failure",
        "responding",
        "respectworthyobjects",
        "norm",
        "moral",
        "grounded",
        "moral",
        "principle",
        "morally",
        "important",
        "characteristic",
        "respectworthy",
        "object",
        "endorsable",
        "authoritative",
        "moral",
        "agent",
        "norm",
        "social",
        "arising",
        "dimension",
        "social",
        "life",
        "grounded",
        "socially",
        "significant",
        "characteristic",
        "objective",
        "authoritative",
        "applicable",
        "participant",
        "form",
        "sociality"
    ]
}