{
    "main_text": "Pre-hermeneutic Anthropology\n2. Pre-hermeneutic Anthropology\n\nRicoeur’s first major work was meant to appear in three volumes\nthat would lay out a philosophy of the will starting from an eidetic\nphenomenology of the voluntary and the involuntary. The second volume\nwould then turn to questions dealing with the empirical reality of the\nwill. The third volume would address the misuse of the will and the\nexistence of evil which cannot be explained through either a pure\nphenomenology of the will or its empirical existence. The projected\nthird volume was announced as intending to present what Ricoeur called\na poetics of the will and a vision of innocence in light of what\nRicoeur, following Karl Jaspers, called Transcendence. This latter\nvolume never appeared. It was delayed, then set aside when Ricoeur\ndiscovered new problems he had not foreseen and when he sought to\nrespond to new challenges to philosophy coming especially from\nstructuralism.\n\nThe first volume of this projected trilogy, Freedom and Nature:\nThe Voluntary and the Involuntary (1950), proposes a\nphenomenology of the will, while bracketing the reality of evil. It\ndraws on the method of phenomenology developed by Edmund Husserl. In\nit one finds an expression of a theme central to Ricoeur’s\nanthropology, namely, the polar subjective/objective character of the\nconstituent features of lived human existence. Contrary to\nSartre’s claim that there is radical difference between\nconsciousness (or the for-itself) and materiality (or the in-itself),\na difference that pits the freedom of the for-itself against the sheer\nfacticity of the in-itself, Ricoeur argues that the voluntary and\ninvoluntary dimensions of human existence are complementary. This can\nbe seen through a phenomenological description of the three structures\nthat constitute the voluntary pole of human existence: deciding,\nchoosing and moving to action, and our necessary consent to the\ninvoluntary as that which is acted upon through our will, whose organ\nis our body. There is no seamless harmony between these dimensions of\nwhat is finally a finite freedom. Human beings have to struggle with\nthe tension between them and ultimately to consent to their embodied\nlives and the world as something they do not fully create. It is the\nalways fragile resolution of this conflict that ultimately makes human\nfreedom genuinely human, and that gives us our distinctive identities\nboth as individuals and as members of larger historical communities\nand ultimately of humanity.\n\nRicoeur extends his account of freedom to take up the topic of evil in\nFallible Man and The Symbolism of Evil, both\npublished in 1960. In these works he addresses the question of how to\naccount for the fact that it is possible for us to misuse our freedom,\na question that had been bracketed in the initial phenomenological\nvolume. In Fallible Man he argues through a transcendental\nanalysis that this possibility is grounded in the basic disproportion\nthat characterizes human existence as located between the finite,\nperspectival nature of experience and the infinite, rational\ndimensions of taking up that experience in perception, practice, and\nfeeling, leading to the concept of fallibility. This disproportion\nshows up in every aspect of human existence, from perceiving to\nfeeling to thinking. It is evident in the human desire for\npossessions, power, and prestige. By reason of this disproportion, we\nare never wholly at one with ourselves and hence we can go wrong. We\nare fallible, yet evil, the misuse of our freedom, is neither original\nnor necessary, only always possible.\n\nNor does this disproportion render our existence meaningless. Rather,\nthe very disproportion that makes us fallible and makes human evil\ndoing possible is also what makes goodness, knowledge, and achievement\npossible. It is what distinguishes us from one another—each one\nof us has his or her unique spatiotemporal location and perspective\nbut we can know ourselves as one human among many and we can seek to\nknow the world beyond our individual perspective on it. Our\nfallibility also makes it necessary and possible for us to communicate\nwith each other through our use of the logos which seeks to\ntranscend our localized points of view.\n\nThough the unity of humanity is never more than a unity founded on\ncommunication, precisely because we can communicate, the differences\namong us are never absolute. Furthermore, no one of us alone could be\na person. Though each of us has an individual identity, our identities\nshow that we are bound up with others: “Man is this plural and\ncollective unity in which the unity of destination and the differences\nof destinies are to be understood through each other”\n(Fallible Man, 138).\n\nThe kind of unity that binds people to one another even though they\ndiffer is found in their desire for esteem and recognition. This\ndesire seeks genuine mutuality that expresses esteem for the worth\nthat each of us has by reason of both our common humanity and our\nindividual uniqueness. This esteem positively values the disproportion\nconstitutive of every person. This theme of mutual recognition is\ndeveloped more fully in Ricoeur’s final book The Course of\nRecognition, where he argues that it goes beyond mere reciprocal\nrecognition, like that found in commercial or other transactions\nreducible to an exchange of goods with no regard for who the other\nparty involved might be.\n\nThe study of history which acknowledges the temporality of our\nexistence confirms our desire for such mutual esteem. Such attention\nto history, in turn, further clarifies the finite nature of human\nfreedom. For Ricoeur, there is an order and structure to history\nconveyed through the narrating of history. Otherwise history would be\nunintelligible. But this narrated history also recounts events and\ndeeds that disrupt the prevailing order and reorder it, leading to the\nquestion whether forgiveness for the wrongs that have occurred and\ndebts that have been incurred might be possible, however difficult to\nachieve.\n\nThese reflections reinforced Ricoeur’s conviction that what\nhumans say and do presupposes both a finite freedom that allows us to\nintervene in natural processes and a dependence on these same\nprocesses for the efficacy of such actions. What we say and do would\nbe meaningless if it did not fit into some antecedent structure or\npattern established by natural processes, on the one hand, and into\nwhat we say about such doings which intervene in those processes, on\nthe other. Our words and deeds are intended to express the meaning of\nwhat exists, if only because they give meaning to things as they now\nstand. In this sense, our words and deeds get their significance from\nbeing responses to contexts not wholly of our own making. What we say\nand do in such contexts can also aim beyond things as they now stand\nand sometimes does give expression to new meanings and values, as well\nas to unintended and as yet unrealized possibilities. In a word, our\nexercising of our finite freedom has worth and efficacy only by reason\nof our embodiment in a natural and cultural setting that is largely\nnot of our own making, but this is a world that we seek to appropriate\nthrough our words and deeds—and our use of a productive\nimagination.\n\nRicoeur saw that this conception of the disproportion that\ncharacterizes human beings was insufficient to account for actual\noccurrence of a bad will and evil deeds. No direct, unmediated\ninspection of the cogito, like that he saw in Descartes and Husserl,\ncan show why these evils, contingent as each of them is, in fact came\nto be. Recognizing the opacity of the cogito in this respect confirmed\nhis belief that all self-understanding comes about only through\n“signs deposited in memory and imagination by the great literary\ntraditions” (Ricoeur, “Intellectual Autobiography”,\nin Hahn 1995: 16). This conclusion was a major motivator for his\nhermeneutic and, at the same time, “linguistic turn”.\n\nRicoeur next explored the problem of how then to account for the\nexistence of evil and its possible solution in The Symbolism of\nEvil. There, he argued that we should consider how people have\nsought to come to terms with their inability to make sense of the\nexistence of evil by using language that draws on the great symbols\nand myths that speak of its origin and end. This is language that\nconveys more than a single meaning, language that can always be\nunderstood in more than one way; hence it needs always to be\ninterpreted. This study concluded by saying that philosophy must learn\nto make sense of such language and learn to think starting from it,\nsomething Ricoeur summed up in a famous phrase: “the symbol\ngives rise to thought” (The Symbolism of Evil, 1967:\n247–57). If philosophy is to take seriously this lesson taught\nby reflection on the symbolism of evil, it has to take up the problem\nof the “fullness of language”. This means considering\nthose uses of language that extend beyond a single word or sentence,\nas well as those which cannot be interpreted as simple logical\npropositions that say S is P. Like the primary symbols of\nevil‐stain, sin, and guilt—these are forms of discourse\nthat can have more than one meaning. To make sense of the fullness of\nlanguage, therefore, philosophy has to develop a theory of\ninterpretation since actual discourse is not always, if ever univocal\nand its meanings do change over time when acts of discourse outlive\nthe speakers and situations in which they were originally\nproduced.\n\nIn working out this theory of interpretation in terms of a theory of\nlanguage as discourse, Ricoeur saw that what he now called the\nhermeneutic field to which interpretations applied was itself divided\ninternally between an approach such as that used in The Symbolism\nof Evil which sought to recover meaning that was assumed to be\nalready there and what he now called a hermeneutics of suspicion, like\nthat found in Marx, Nietzsche and Freud, which held that nothing\nultimately means what it first seems to say. The rise of structuralism\nin the 1960s and 70s, drawing on developments in linguistics,\ncontributed to this emphasis on suspicion by holding that it was an\nunderlying impersonal structure or structures that gave rise to the\napparent surface meaning. Structuralism also introduced the idea that\nthe identifying of such underlying structures could count as a\nreductive explanation of any surface-level meaning. Ricoeur’s\nphilosophical project therefore turned to showing that while\nstructuralism could be incorporated as a method of inquiry—look\nfor and learn from the proposed generative structures—it went\nastray when it proposed itself as a theory of objectivity without\nsubjectivity, what Ricoeur called a transcendental philosophy without\na transcendental subject. Over time, he came to see that this limiting\nof structural analysis to a method of interpretation can be shown to\nfollow from the fact that structuralists always presupposed the\nsurface meaning they were trying to explain away. Moreover, because\nthey ignored time and discarded any notion of change, because the deep\nstructures they discovered were understood to be static and atemporal,\nthey could not really account for how structures generated surface\nmeanings, that is, how one structure could change into a different\nstructure.\n\nThis critique is found in the essays collected in The Conflict of\nInterpretations (1969) and in Ricoeur’s detailed\nphilosophical reading of Freud, Freud and Philosophy (1970).\nFreud’s own philosophy, according to Ricoeur, turns out to be an\narchaeology of the subject meant to provide at a theory of culture\n(civilization and its discontents), but it lacks the required\ncorresponding teleology of the subject that would allow for human\ncreativity and a capable human being. These investigations reinforced\nRicoeur’s view that there is no unmediated self-understanding,\nleading to a turn to a more dialectical method in his work. This is an\napproach through which he seeks to find the middle term that can\nmediate between two polar terms and allow us to move back and forth\nbetween them. Locating such a mediating term leads to enhanced\nunderstanding. This understanding always comes about through\ninterpretation but is also itself open to critique. In other words,\nfor Ricoeur hermeneutics works with a method that mediates and\nnegotiates rather than removes the conflict of interpretations.\n\nBesides recognizing the fruitfulness of structural analyses of\nparticular well-defined fields of experience, Ricoeur resisted those\nstructuralists and post-structuralists who sought to reduce language\nitself to a closed system of signs having no reference to anything\noutside itself. Following clues found in the works of Emile Benveniste\nand Roman Jakobson, he defined discourse as the use of such sign\nsystems by someone to say something about something to someone, using\nexisting but malleable phonetic, lexical, syntactic, and stylistic\nrules. That is, discourse always involves a speaker or writer and a\nhearer or reader as well as something said in some situation about\nsome reality, ultimately a world that we might inhabit. It follows\nthat any interpretation of a form of discourse requires both the\nobjective sort of analysis for which structuralism provides a tool and\nan acknowledgment that there is always a surplus of meaning that goes\nbeyond what such objective techniques seek to explain. There is a\nsurplus of meaning because we apply objective techniques to things we\nalready understand as having a possible meaning without fully\nexhausting that meaning. The meaning of acts of discourse is moreover\nalways open to new interpretations, particularly as time passes and\nthe very context in which interpretation occurs itself changes.\n",
    "section_title": "2. Pre-hermeneutic Anthropology",
    "entry_title": "Paul Ricoeur",
    "hierarchy_title": "Paul Ricoeur || Pre-hermeneutic Anthropology",
    "tokenized_text": [
        "prehermeneutic",
        "anthropology",
        "prehermeneutic",
        "anthropology",
        "ricoeur",
        "first",
        "major",
        "work",
        "meant",
        "appear",
        "three",
        "volume",
        "would",
        "lay",
        "philosophy",
        "starting",
        "eidetic",
        "phenomenology",
        "voluntary",
        "involuntary",
        "second",
        "volume",
        "would",
        "turn",
        "question",
        "dealing",
        "empirical",
        "reality",
        "third",
        "volume",
        "would",
        "address",
        "misuse",
        "existence",
        "evil",
        "explained",
        "either",
        "pure",
        "phenomenology",
        "empirical",
        "existence",
        "projected",
        "third",
        "volume",
        "announced",
        "intending",
        "present",
        "ricoeur",
        "called",
        "poetics",
        "vision",
        "innocence",
        "light",
        "ricoeur",
        "following",
        "karl",
        "jasper",
        "called",
        "transcendence",
        "latter",
        "volume",
        "never",
        "appeared",
        "delayed",
        "set",
        "aside",
        "ricoeur",
        "discovered",
        "new",
        "problem",
        "foreseen",
        "sought",
        "respond",
        "new",
        "challenge",
        "philosophy",
        "coming",
        "especially",
        "structuralism",
        "first",
        "volume",
        "projected",
        "trilogy",
        "freedom",
        "nature",
        "voluntary",
        "involuntary",
        "proposes",
        "phenomenology",
        "bracketing",
        "reality",
        "evil",
        "draw",
        "method",
        "phenomenology",
        "developed",
        "edmund",
        "husserl",
        "one",
        "find",
        "expression",
        "theme",
        "central",
        "ricoeur",
        "anthropology",
        "namely",
        "polar",
        "subjectiveobjective",
        "character",
        "constituent",
        "feature",
        "lived",
        "human",
        "existence",
        "contrary",
        "sartre",
        "claim",
        "radical",
        "difference",
        "consciousness",
        "foritself",
        "materiality",
        "initself",
        "difference",
        "pit",
        "freedom",
        "foritself",
        "sheer",
        "facticity",
        "initself",
        "ricoeur",
        "argues",
        "voluntary",
        "involuntary",
        "dimension",
        "human",
        "existence",
        "complementary",
        "seen",
        "phenomenological",
        "description",
        "three",
        "structure",
        "constitute",
        "voluntary",
        "pole",
        "human",
        "existence",
        "deciding",
        "choosing",
        "moving",
        "action",
        "necessary",
        "consent",
        "involuntary",
        "acted",
        "upon",
        "whose",
        "organ",
        "body",
        "seamless",
        "harmony",
        "dimension",
        "finally",
        "finite",
        "freedom",
        "human",
        "being",
        "struggle",
        "tension",
        "ultimately",
        "consent",
        "embodied",
        "life",
        "world",
        "something",
        "fully",
        "create",
        "always",
        "fragile",
        "resolution",
        "conflict",
        "ultimately",
        "make",
        "human",
        "freedom",
        "genuinely",
        "human",
        "give",
        "u",
        "distinctive",
        "identity",
        "individual",
        "member",
        "larger",
        "historical",
        "community",
        "ultimately",
        "humanity",
        "ricoeur",
        "extends",
        "account",
        "freedom",
        "take",
        "topic",
        "evil",
        "fallible",
        "man",
        "symbolism",
        "evil",
        "published",
        "work",
        "address",
        "question",
        "account",
        "fact",
        "possible",
        "u",
        "misuse",
        "freedom",
        "question",
        "bracketed",
        "initial",
        "phenomenological",
        "volume",
        "fallible",
        "man",
        "argues",
        "transcendental",
        "analysis",
        "possibility",
        "grounded",
        "basic",
        "disproportion",
        "characterizes",
        "human",
        "existence",
        "located",
        "finite",
        "perspectival",
        "nature",
        "experience",
        "infinite",
        "rational",
        "dimension",
        "taking",
        "experience",
        "perception",
        "practice",
        "feeling",
        "leading",
        "concept",
        "fallibility",
        "disproportion",
        "show",
        "every",
        "aspect",
        "human",
        "existence",
        "perceiving",
        "feeling",
        "thinking",
        "evident",
        "human",
        "desire",
        "possession",
        "power",
        "prestige",
        "reason",
        "disproportion",
        "never",
        "wholly",
        "one",
        "hence",
        "go",
        "wrong",
        "fallible",
        "yet",
        "evil",
        "misuse",
        "freedom",
        "neither",
        "original",
        "necessary",
        "always",
        "possible",
        "disproportion",
        "render",
        "existence",
        "meaningless",
        "rather",
        "disproportion",
        "make",
        "u",
        "fallible",
        "make",
        "human",
        "evil",
        "possible",
        "also",
        "make",
        "goodness",
        "knowledge",
        "achievement",
        "possible",
        "distinguishes",
        "u",
        "one",
        "anothereach",
        "one",
        "u",
        "unique",
        "spatiotemporal",
        "location",
        "perspective",
        "know",
        "one",
        "human",
        "among",
        "many",
        "seek",
        "know",
        "world",
        "beyond",
        "individual",
        "perspective",
        "fallibility",
        "also",
        "make",
        "necessary",
        "possible",
        "u",
        "communicate",
        "use",
        "logo",
        "seek",
        "transcend",
        "localized",
        "point",
        "view",
        "though",
        "unity",
        "humanity",
        "never",
        "unity",
        "founded",
        "communication",
        "precisely",
        "communicate",
        "difference",
        "among",
        "u",
        "never",
        "absolute",
        "furthermore",
        "one",
        "u",
        "alone",
        "could",
        "person",
        "though",
        "u",
        "individual",
        "identity",
        "identity",
        "show",
        "bound",
        "others",
        "man",
        "plural",
        "collective",
        "unity",
        "unity",
        "destination",
        "difference",
        "destiny",
        "understood",
        "fallible",
        "man",
        "kind",
        "unity",
        "bind",
        "people",
        "one",
        "another",
        "even",
        "though",
        "differ",
        "found",
        "desire",
        "esteem",
        "recognition",
        "desire",
        "seek",
        "genuine",
        "mutuality",
        "express",
        "esteem",
        "worth",
        "u",
        "reason",
        "common",
        "humanity",
        "individual",
        "uniqueness",
        "esteem",
        "positively",
        "value",
        "disproportion",
        "constitutive",
        "every",
        "person",
        "theme",
        "mutual",
        "recognition",
        "developed",
        "fully",
        "ricoeur",
        "final",
        "book",
        "course",
        "recognition",
        "argues",
        "go",
        "beyond",
        "mere",
        "reciprocal",
        "recognition",
        "like",
        "found",
        "commercial",
        "transaction",
        "reducible",
        "exchange",
        "good",
        "regard",
        "party",
        "involved",
        "might",
        "study",
        "history",
        "acknowledges",
        "temporality",
        "existence",
        "confirms",
        "desire",
        "mutual",
        "esteem",
        "attention",
        "history",
        "turn",
        "clarifies",
        "finite",
        "nature",
        "human",
        "freedom",
        "ricoeur",
        "order",
        "structure",
        "history",
        "conveyed",
        "narrating",
        "history",
        "otherwise",
        "history",
        "would",
        "unintelligible",
        "narrated",
        "history",
        "also",
        "recount",
        "event",
        "deed",
        "disrupt",
        "prevailing",
        "order",
        "reorder",
        "leading",
        "question",
        "whether",
        "forgiveness",
        "wrong",
        "occurred",
        "debt",
        "incurred",
        "might",
        "possible",
        "however",
        "difficult",
        "achieve",
        "reflection",
        "reinforced",
        "ricoeur",
        "conviction",
        "human",
        "say",
        "presupposes",
        "finite",
        "freedom",
        "allows",
        "u",
        "intervene",
        "natural",
        "process",
        "dependence",
        "process",
        "efficacy",
        "action",
        "say",
        "would",
        "meaningless",
        "fit",
        "antecedent",
        "structure",
        "pattern",
        "established",
        "natural",
        "process",
        "one",
        "hand",
        "say",
        "doings",
        "intervene",
        "process",
        "word",
        "deed",
        "intended",
        "express",
        "meaning",
        "exists",
        "give",
        "meaning",
        "thing",
        "stand",
        "sense",
        "word",
        "deed",
        "get",
        "significance",
        "response",
        "context",
        "wholly",
        "making",
        "say",
        "context",
        "also",
        "aim",
        "beyond",
        "thing",
        "stand",
        "sometimes",
        "give",
        "expression",
        "new",
        "meaning",
        "value",
        "well",
        "unintended",
        "yet",
        "unrealized",
        "possibility",
        "word",
        "exercising",
        "finite",
        "freedom",
        "worth",
        "efficacy",
        "reason",
        "embodiment",
        "natural",
        "cultural",
        "setting",
        "largely",
        "making",
        "world",
        "seek",
        "appropriate",
        "word",
        "deedsand",
        "use",
        "productive",
        "imagination",
        "ricoeur",
        "saw",
        "conception",
        "disproportion",
        "characterizes",
        "human",
        "being",
        "insufficient",
        "account",
        "actual",
        "occurrence",
        "bad",
        "evil",
        "deed",
        "direct",
        "unmediated",
        "inspection",
        "cogito",
        "like",
        "saw",
        "descartes",
        "husserl",
        "show",
        "evil",
        "contingent",
        "fact",
        "came",
        "recognizing",
        "opacity",
        "cogito",
        "respect",
        "confirmed",
        "belief",
        "selfunderstanding",
        "come",
        "sign",
        "deposited",
        "memory",
        "imagination",
        "great",
        "literary",
        "tradition",
        "ricoeur",
        "intellectual",
        "autobiography",
        "hahn",
        "conclusion",
        "major",
        "motivator",
        "hermeneutic",
        "time",
        "linguistic",
        "turn",
        "ricoeur",
        "next",
        "explored",
        "problem",
        "account",
        "existence",
        "evil",
        "possible",
        "solution",
        "symbolism",
        "evil",
        "argued",
        "consider",
        "people",
        "sought",
        "come",
        "term",
        "inability",
        "make",
        "sense",
        "existence",
        "evil",
        "using",
        "language",
        "draw",
        "great",
        "symbol",
        "myth",
        "speak",
        "origin",
        "end",
        "language",
        "conveys",
        "single",
        "meaning",
        "language",
        "always",
        "understood",
        "one",
        "way",
        "hence",
        "need",
        "always",
        "interpreted",
        "study",
        "concluded",
        "saying",
        "philosophy",
        "must",
        "learn",
        "make",
        "sense",
        "language",
        "learn",
        "think",
        "starting",
        "something",
        "ricoeur",
        "summed",
        "famous",
        "phrase",
        "symbol",
        "give",
        "rise",
        "thought",
        "symbolism",
        "evil",
        "philosophy",
        "take",
        "seriously",
        "lesson",
        "taught",
        "reflection",
        "symbolism",
        "evil",
        "take",
        "problem",
        "fullness",
        "language",
        "mean",
        "considering",
        "us",
        "language",
        "extend",
        "beyond",
        "single",
        "word",
        "sentence",
        "well",
        "interpreted",
        "simple",
        "logical",
        "proposition",
        "say",
        "p",
        "like",
        "primary",
        "symbol",
        "evilstain",
        "sin",
        "guiltthese",
        "form",
        "discourse",
        "one",
        "meaning",
        "make",
        "sense",
        "fullness",
        "language",
        "therefore",
        "philosophy",
        "develop",
        "theory",
        "interpretation",
        "since",
        "actual",
        "discourse",
        "always",
        "ever",
        "univocal",
        "meaning",
        "change",
        "time",
        "act",
        "discourse",
        "outlive",
        "speaker",
        "situation",
        "originally",
        "produced",
        "working",
        "theory",
        "interpretation",
        "term",
        "theory",
        "language",
        "discourse",
        "ricoeur",
        "saw",
        "called",
        "hermeneutic",
        "field",
        "interpretation",
        "applied",
        "divided",
        "internally",
        "approach",
        "used",
        "symbolism",
        "evil",
        "sought",
        "recover",
        "meaning",
        "assumed",
        "already",
        "called",
        "hermeneutics",
        "suspicion",
        "like",
        "found",
        "marx",
        "nietzsche",
        "freud",
        "held",
        "nothing",
        "ultimately",
        "mean",
        "first",
        "seems",
        "say",
        "rise",
        "structuralism",
        "s",
        "drawing",
        "development",
        "linguistics",
        "contributed",
        "emphasis",
        "suspicion",
        "holding",
        "underlying",
        "impersonal",
        "structure",
        "structure",
        "gave",
        "rise",
        "apparent",
        "surface",
        "meaning",
        "structuralism",
        "also",
        "introduced",
        "idea",
        "identifying",
        "underlying",
        "structure",
        "could",
        "count",
        "reductive",
        "explanation",
        "surfacelevel",
        "meaning",
        "ricoeur",
        "philosophical",
        "project",
        "therefore",
        "turned",
        "showing",
        "structuralism",
        "could",
        "incorporated",
        "method",
        "inquirylook",
        "learn",
        "proposed",
        "generative",
        "structuresit",
        "went",
        "astray",
        "proposed",
        "theory",
        "objectivity",
        "without",
        "subjectivity",
        "ricoeur",
        "called",
        "transcendental",
        "philosophy",
        "without",
        "transcendental",
        "subject",
        "time",
        "came",
        "see",
        "limiting",
        "structural",
        "analysis",
        "method",
        "interpretation",
        "shown",
        "follow",
        "fact",
        "structuralists",
        "always",
        "presupposed",
        "surface",
        "meaning",
        "trying",
        "explain",
        "away",
        "moreover",
        "ignored",
        "time",
        "discarded",
        "notion",
        "change",
        "deep",
        "structure",
        "discovered",
        "understood",
        "static",
        "atemporal",
        "could",
        "really",
        "account",
        "structure",
        "generated",
        "surface",
        "meaning",
        "one",
        "structure",
        "could",
        "change",
        "different",
        "structure",
        "critique",
        "found",
        "essay",
        "collected",
        "conflict",
        "interpretation",
        "ricoeur",
        "detailed",
        "philosophical",
        "reading",
        "freud",
        "freud",
        "philosophy",
        "freud",
        "philosophy",
        "according",
        "ricoeur",
        "turn",
        "archaeology",
        "subject",
        "meant",
        "provide",
        "theory",
        "culture",
        "civilization",
        "discontent",
        "lack",
        "required",
        "corresponding",
        "teleology",
        "subject",
        "would",
        "allow",
        "human",
        "creativity",
        "capable",
        "human",
        "investigation",
        "reinforced",
        "ricoeur",
        "view",
        "unmediated",
        "selfunderstanding",
        "leading",
        "turn",
        "dialectical",
        "method",
        "work",
        "approach",
        "seek",
        "find",
        "middle",
        "term",
        "mediate",
        "two",
        "polar",
        "term",
        "allow",
        "u",
        "move",
        "back",
        "forth",
        "locating",
        "mediating",
        "term",
        "lead",
        "enhanced",
        "understanding",
        "understanding",
        "always",
        "come",
        "interpretation",
        "also",
        "open",
        "critique",
        "word",
        "ricoeur",
        "hermeneutics",
        "work",
        "method",
        "mediates",
        "negotiates",
        "rather",
        "remove",
        "conflict",
        "interpretation",
        "besides",
        "recognizing",
        "fruitfulness",
        "structural",
        "analysis",
        "particular",
        "welldefined",
        "field",
        "experience",
        "ricoeur",
        "resisted",
        "structuralists",
        "poststructuralists",
        "sought",
        "reduce",
        "language",
        "closed",
        "system",
        "sign",
        "reference",
        "anything",
        "outside",
        "following",
        "clue",
        "found",
        "work",
        "emile",
        "benveniste",
        "roman",
        "jakobson",
        "defined",
        "discourse",
        "use",
        "sign",
        "system",
        "someone",
        "say",
        "something",
        "something",
        "someone",
        "using",
        "existing",
        "malleable",
        "phonetic",
        "lexical",
        "syntactic",
        "stylistic",
        "rule",
        "discourse",
        "always",
        "involves",
        "speaker",
        "writer",
        "hearer",
        "reader",
        "well",
        "something",
        "said",
        "situation",
        "reality",
        "ultimately",
        "world",
        "might",
        "inhabit",
        "follows",
        "interpretation",
        "form",
        "discourse",
        "requires",
        "objective",
        "sort",
        "analysis",
        "structuralism",
        "provides",
        "tool",
        "acknowledgment",
        "always",
        "surplus",
        "meaning",
        "go",
        "beyond",
        "objective",
        "technique",
        "seek",
        "explain",
        "surplus",
        "meaning",
        "apply",
        "objective",
        "technique",
        "thing",
        "already",
        "understand",
        "possible",
        "meaning",
        "without",
        "fully",
        "exhausting",
        "meaning",
        "meaning",
        "act",
        "discourse",
        "moreover",
        "always",
        "open",
        "new",
        "interpretation",
        "particularly",
        "time",
        "pass",
        "context",
        "interpretation",
        "occurs",
        "change"
    ]
}