{
    "main_text": "The Right to be Heard\n9. The Right to be Heard\n\nThe right to be heard is a valuable right. What makes it valuable is\nboth that there is a point to making one’s views known and,\nfurther, that making one’s views known makes a difference. It\nmatters to me that I can speak out on political questions. It matters\nalso, and probably more, if what I say leads to the changes I favour.\nCorrelatively, it is true both that I do not want to be silenced and\nthat I do not want the statement of my views to be ineffectual. As a\nfurther general point there will always be some issues on which it is\nmore important that I be allowed to speak and that what I say about\nthese issues carries weight in determining outcomes. Those are the\nissues that matter to me, and the more they matter the more important\nit is that I have the freedom to speak about them and be heard. On one\naccount, since children’s views should not be\n‘authoritative’, that is, determinative of what is done,\nthey have only a ‘consultative’ role (Brighouse 2003).\nThey may influence an outcome by, most obviously, providing those who\ndo make the decisions affecting a child’s interests with a\nclearer picture of what in fact is in those interests. On another\naccount, encouraging and according a weight to the expression of\nchildren’s views—even where this is unlikely to affect\noutcomes in line with the views’ content—is valuable just\nbecause the child is capable of expressing a view and deserves to be\nlistened to (Archard and Skivenes 2009).\n\nHow is it with the child’s right to be heard? It will be\nimportant for the child to be listened to. But it is also important\nthat the child is heard in the sense that her views are given due\nconsideration and may influence what is done. Note that the\nchild’s right to be heard on matters affecting its own interests\nis a substitute for the liberty right to make one’s own choices.\nThe right to be heard is only a right to have the opportunity to\ninfluence the person who will otherwise choose for the child. The\npower to make those choices resides with the adult guardian or\nrepresentative of the child. All the child retains is the right to try\nto motivate that adult to choose as the child herself would choose if\nshe was allowed to.\n\nArticle 12.1 of the United Nations Convention on the Rights of the\nChild not only accords the child the right freely to express its views\non matters affecting the child. It also, and crucially, gives the\nchild an assurance that these views will be given ‘due weight in\naccordance with the age and maturity of the child’. Great\nemphasis is now placed on what are termed a child’s\n‘participation rights’ as opposed to his or her\n‘protection rights’. The latter, as the name suggests,\nprotect the child from violent, abusive, cruel or exploitative\ntreatment. ‘Participation rights by contrast, give children\nsome entitlement to be the agents of their own lives. Article 12.1\nprovides a crucial underpinning justification for such rights. There\nare problems in understanding how practically to implement such rights\n(Ang, et al. 2006). There are also theoretical issues in making precise\nsense of what a right such as that enshrined in Article 12.1 might\nmean. Its complexities lie in understanding the difference between an\nadult’s power of choice and a child’s views on critical\npersonal matters, in the different ways we might consider a\nchild’s views, in how to weight those views and how their\nweighting makes a practical difference in coming to a decision\n(Archard and Uniacke 2020).\n\nThe celebrated British legal judgement in the Gillick case (Gillick\n[1986]) provides a useful contrast to Article 12. This judgement has\nbeen extensively discussed, and it has also been highly influential in\nmatters relating to the consent of children to medical treatment.\n\nThe Gillick judgement arose from the dissatisfaction of a mother with\nthe failure of her local health authority to withdraw an advisory\ncircular to the area’s doctors. This advised doctors that they\ncould counsel and inform young girls under the age of 16 about sexual\nmatters as well as provide them with contraception, and that they\ncould do this without the consent of the child’s parents. The\nmother, Victoria Gillick, went to court to have the circular declared\nunlawful. The final judgement by the British House of Lords was that\nthe circular was not unlawful. A key issue, relevant to the present\ndiscussion, concerned the proper relationship between the\nchild’s right to decide for itself and the parent’s right\nto decide for the child.\n\nIn deciding in favour of the health authority one of the Law Lords,\nLord Scarman, made a statement crucial to his finding and one that has\nsubsequently been much cited. It is worth reproducing:\n\n\nThe underlying principle of the law … is that\nparental right yields to the child’s right to make his own\ndecisions when he reaches a sufficient understanding and intelligence\nto be capable of making up his own mind on the matter requiring\ndecision. (Gilick [1986], 186)\n\nI would hold that as a matter of law the parental right to determine\nwhether or not their minor child below the age of 16 will have medical\ntreatment terminates if and when the child achieves a sufficient\nunderstanding and intelligence to enable him to understand fully what\nis proposed. (Gillick [1986], 188–9)\n\n\nVarious questions arise. First, what does it mean for a child to get\nto a particular point in their development? On what could be called\nthe threshold interpretation, once a child has achieved a certain\nlevel of competence, her views as to what shall happen to her have a\ndeterminate weight, either amounting to a liberty right of choice (on\na strong version) or (on a weak version) being counted in the balance\nagainst her parents’ views and the state’s judgement of\nher best interests. On what could be called the proportionality\ninterpretation, the child’s views progressively increase in\nweight as she gains a greater competence to choose for herself. They\nincrease up to the acquisition of a full liberty right of choice.\n\nSecond, on either the threshold or the proportionality account we need\na measure of that ability that marks the threshold or is simply\nprogressively acquired. How much intelligence and understanding, for\ninstance, is sufficient? In the first place, this measure must be\ntaken independently of any judgement of what is in the child’s\nbest interest. That a child would choose what is taken to be in her\nbest interests is at most evidence that she does have sufficient\nintelligence and understanding of the relevant issue. Her making such\na choice is not a necessary condition of her having the requisite\nability. Similarly, the making by a child of a poor choice is not\nconclusive evidence of her general incapacity to choose for herself.\nWise adults can occasionally make stupid decisions just as fools\nsometimes get it right.\n\nIn the Gillick judgement, Scarman required of the child that she\nmanifest an understanding of the ‘nature’ of the\ncontraceptive advice offered and ‘also have a sufficient\nmaturity to understand what is involved’ (Gillick [1986], 189).\nWe can distinguish here a number of possible elements. There is,\nfirst, knowledge of certain facts. One child, for instance, knows that\na contraceptive acts to prevent conception that might otherwise result\nfrom sexual intercourse. Another child, by contrast, could simply be\nignorant of or unable to comprehend the facts of reproduction. There\nis, second, an understanding of what follows for the child from an act\nor its omission. Thus, failure to use a contraceptive could lead a\nyoung person who had sexual intercourse to become pregnant. These two\nunderstandings together constitute knowledge of the\n‘nature’ of the act. Finally, there is what arguably comes\nwith ‘maturity’ which is the ability to appreciate the\nsignificance both of an act or its omission and of the relevant\nconsequences. It is one thing to know what it is to become pregnant,\nand another to understand what that means. This latter understanding\ninvolves realising that pregnancy brings in its wake physical changes,\nthat any resultant birth leaves a young person with a child to care\nfor, and so on. Scarman even insisted that the child would need to\nhave an appreciation of the ‘moral and family’ questions\ninvolved.\n\nThird, it is important in measuring a child’s competence against\nthat in respect of which he or she is expressing a view to distinguish\nbetween the complexity and the seriousness of the matter. A simple\nchoice—for instance that between only two options such as\nwhether to have a life-saving operation—may nevertheless be\nportentous, having enormous and far-reaching consequences. It may thus\nrequire much greater appreciation of what is involved than a more\ncomplex decision, one that ranges over many possibilities. Yet the\nlatter kind of choice—consider choosing a five-course meal from\na very large menu—is far less serious in its consequences. In\nshort, the difficulty or complexity of a choice should not be confused\nwith its importance or significance for the child.\n\nFourth, the English courts at least have detected a fundamental\nasymmetry between refusing and choosing to have treatment. A competent\nadult has a right both to choose to have treatment and to refuse it.\nShould this not also be the case with a competent child? A 15-year-old\nwho wants to have a particular operation against her parents’\nwishes and even contrary to the best judgement of her doctors may be\njudged competent and thus have her wishes respected. However, the\nEnglish courts in a series of judgements after Gillick have argued\nthat matters are somehow different when it is a case of a child\nrefusing an operation.\n\nOf course, there is no inconsistency if a refusal requires a greater\ndegree of understanding and appreciation of the issues than a positive\nacceptance. But where the choice is a simple disjunction, it is hard\nto see how this can be the case. Are not the issues at stake the same\nfor both disjuncts? If the courts believe that an obligation to act in\nthe best interests of the child trumps one to respect the wishes of a\ncompetent child, it needs to be shown why this obligation does not\nhave force in all circumstances. Why would a court not deny treatment\nto a child it does not believe in her best interests when it judges\nher competent to choose? If a child is competent then she is in all\nsignificant and relevant respects the equal of an adult and should be\nable both to choose and to refuse treatment.\n\nThree final comments on the child’s right to choose are in\norder. First, what is deemed to be in the child’s best interests\nis evidence for, but not finally determinative of, a judgement as to\nthe competence of the child. Nevertheless, balancing a child’s\nright to be heard against a child’s right to have its best\ninterests promoted is difficult. Second, it is arguably enough to show\na child’s competence that a child understands the nature of the\nact. After all, no more is needed for an adult’s consent to be\ninformed. In the law of contract adults need only to know what they\nare signing up to. They do not need a full appreciation of the\ncontract’s significance and of its import for their future\nlives. Third, Gillick competence as specified is very demanding.\nIndeed, there are many adults who, in making their choices, fail to\ndisplay the maturity and ‘understanding of what is\ninvolved’ that is dictated as necessary for the child. Why then\nshould a child have to display a competence that many adults lack both\nin general and in particular cases?\n",
    "section_title": "9. The Right to be Heard",
    "entry_title": "Children’s Rights",
    "hierarchy_title": "Children’s Rights || The Right to be Heard",
    "tokenized_text": [
        "right",
        "heard",
        "right",
        "heard",
        "right",
        "heard",
        "valuable",
        "right",
        "make",
        "valuable",
        "point",
        "making",
        "one",
        "view",
        "known",
        "making",
        "one",
        "view",
        "known",
        "make",
        "difference",
        "matter",
        "speak",
        "political",
        "question",
        "matter",
        "also",
        "probably",
        "say",
        "lead",
        "change",
        "favour",
        "correlatively",
        "true",
        "want",
        "silenced",
        "want",
        "statement",
        "view",
        "ineffectual",
        "general",
        "point",
        "always",
        "issue",
        "important",
        "allowed",
        "speak",
        "say",
        "issue",
        "carry",
        "weight",
        "determining",
        "outcome",
        "issue",
        "matter",
        "matter",
        "important",
        "freedom",
        "speak",
        "heard",
        "one",
        "account",
        "since",
        "child",
        "view",
        "authoritative",
        "determinative",
        "done",
        "consultative",
        "role",
        "brighouse",
        "may",
        "influence",
        "outcome",
        "obviously",
        "providing",
        "make",
        "decision",
        "affecting",
        "child",
        "interest",
        "clearer",
        "picture",
        "fact",
        "interest",
        "another",
        "account",
        "encouraging",
        "according",
        "weight",
        "expression",
        "child",
        "viewseven",
        "unlikely",
        "affect",
        "outcome",
        "line",
        "view",
        "contentis",
        "valuable",
        "child",
        "capable",
        "expressing",
        "view",
        "deserves",
        "listened",
        "archard",
        "skivenes",
        "child",
        "right",
        "heard",
        "important",
        "child",
        "listened",
        "also",
        "important",
        "child",
        "heard",
        "sense",
        "view",
        "given",
        "due",
        "consideration",
        "may",
        "influence",
        "done",
        "note",
        "child",
        "right",
        "heard",
        "matter",
        "affecting",
        "interest",
        "substitute",
        "liberty",
        "right",
        "make",
        "one",
        "choice",
        "right",
        "heard",
        "right",
        "opportunity",
        "influence",
        "person",
        "otherwise",
        "choose",
        "child",
        "power",
        "make",
        "choice",
        "resides",
        "adult",
        "guardian",
        "representative",
        "child",
        "child",
        "retains",
        "right",
        "try",
        "motivate",
        "adult",
        "choose",
        "child",
        "would",
        "choose",
        "allowed",
        "article",
        "united",
        "nation",
        "convention",
        "right",
        "child",
        "accord",
        "child",
        "right",
        "freely",
        "express",
        "view",
        "matter",
        "affecting",
        "child",
        "also",
        "crucially",
        "give",
        "child",
        "assurance",
        "view",
        "given",
        "due",
        "weight",
        "accordance",
        "age",
        "maturity",
        "child",
        "great",
        "emphasis",
        "placed",
        "termed",
        "child",
        "participation",
        "right",
        "opposed",
        "protection",
        "right",
        "latter",
        "name",
        "suggests",
        "protect",
        "child",
        "violent",
        "abusive",
        "cruel",
        "exploitative",
        "treatment",
        "participation",
        "right",
        "contrast",
        "give",
        "child",
        "entitlement",
        "agent",
        "life",
        "article",
        "provides",
        "crucial",
        "underpinning",
        "justification",
        "right",
        "problem",
        "understanding",
        "practically",
        "implement",
        "right",
        "ang",
        "et",
        "al",
        "also",
        "theoretical",
        "issue",
        "making",
        "precise",
        "sense",
        "right",
        "enshrined",
        "article",
        "might",
        "mean",
        "complexity",
        "lie",
        "understanding",
        "difference",
        "adult",
        "power",
        "choice",
        "child",
        "view",
        "critical",
        "personal",
        "matter",
        "different",
        "way",
        "might",
        "consider",
        "child",
        "view",
        "weight",
        "view",
        "weighting",
        "make",
        "practical",
        "difference",
        "coming",
        "decision",
        "archard",
        "uniacke",
        "celebrated",
        "british",
        "legal",
        "judgement",
        "gillick",
        "case",
        "gillick",
        "provides",
        "useful",
        "contrast",
        "article",
        "judgement",
        "extensively",
        "discussed",
        "also",
        "highly",
        "influential",
        "matter",
        "relating",
        "consent",
        "child",
        "medical",
        "treatment",
        "gillick",
        "judgement",
        "arose",
        "dissatisfaction",
        "mother",
        "failure",
        "local",
        "health",
        "authority",
        "withdraw",
        "advisory",
        "circular",
        "area",
        "doctor",
        "advised",
        "doctor",
        "could",
        "counsel",
        "inform",
        "young",
        "girl",
        "age",
        "sexual",
        "matter",
        "well",
        "provide",
        "contraception",
        "could",
        "without",
        "consent",
        "child",
        "parent",
        "mother",
        "victoria",
        "gillick",
        "went",
        "court",
        "circular",
        "declared",
        "unlawful",
        "final",
        "judgement",
        "british",
        "house",
        "lord",
        "circular",
        "unlawful",
        "key",
        "issue",
        "relevant",
        "present",
        "discussion",
        "concerned",
        "proper",
        "relationship",
        "child",
        "right",
        "decide",
        "parent",
        "right",
        "decide",
        "child",
        "deciding",
        "favour",
        "health",
        "authority",
        "one",
        "law",
        "lord",
        "lord",
        "scarman",
        "made",
        "statement",
        "crucial",
        "finding",
        "one",
        "subsequently",
        "much",
        "cited",
        "worth",
        "reproducing",
        "underlying",
        "principle",
        "law",
        "parental",
        "right",
        "yield",
        "child",
        "right",
        "make",
        "decision",
        "reach",
        "sufficient",
        "understanding",
        "intelligence",
        "capable",
        "making",
        "mind",
        "matter",
        "requiring",
        "decision",
        "gilick",
        "would",
        "hold",
        "matter",
        "law",
        "parental",
        "right",
        "determine",
        "whether",
        "minor",
        "child",
        "age",
        "medical",
        "treatment",
        "terminates",
        "child",
        "achieves",
        "sufficient",
        "understanding",
        "intelligence",
        "enable",
        "understand",
        "fully",
        "proposed",
        "gillick",
        "various",
        "question",
        "arise",
        "first",
        "mean",
        "child",
        "get",
        "particular",
        "point",
        "development",
        "could",
        "called",
        "threshold",
        "interpretation",
        "child",
        "achieved",
        "certain",
        "level",
        "competence",
        "view",
        "shall",
        "happen",
        "determinate",
        "weight",
        "either",
        "amounting",
        "liberty",
        "right",
        "choice",
        "strong",
        "version",
        "weak",
        "version",
        "counted",
        "balance",
        "parent",
        "view",
        "state",
        "judgement",
        "best",
        "interest",
        "could",
        "called",
        "proportionality",
        "interpretation",
        "child",
        "view",
        "progressively",
        "increase",
        "weight",
        "gain",
        "greater",
        "competence",
        "choose",
        "increase",
        "acquisition",
        "full",
        "liberty",
        "right",
        "choice",
        "second",
        "either",
        "threshold",
        "proportionality",
        "account",
        "need",
        "measure",
        "ability",
        "mark",
        "threshold",
        "simply",
        "progressively",
        "acquired",
        "much",
        "intelligence",
        "understanding",
        "instance",
        "sufficient",
        "first",
        "place",
        "measure",
        "must",
        "taken",
        "independently",
        "judgement",
        "child",
        "best",
        "interest",
        "child",
        "would",
        "choose",
        "taken",
        "best",
        "interest",
        "evidence",
        "sufficient",
        "intelligence",
        "understanding",
        "relevant",
        "issue",
        "making",
        "choice",
        "necessary",
        "condition",
        "requisite",
        "ability",
        "similarly",
        "making",
        "child",
        "poor",
        "choice",
        "conclusive",
        "evidence",
        "general",
        "incapacity",
        "choose",
        "wise",
        "adult",
        "occasionally",
        "make",
        "stupid",
        "decision",
        "fool",
        "sometimes",
        "get",
        "right",
        "gillick",
        "judgement",
        "scarman",
        "required",
        "child",
        "manifest",
        "understanding",
        "nature",
        "contraceptive",
        "advice",
        "offered",
        "also",
        "sufficient",
        "maturity",
        "understand",
        "involved",
        "gillick",
        "distinguish",
        "number",
        "possible",
        "element",
        "first",
        "knowledge",
        "certain",
        "fact",
        "one",
        "child",
        "instance",
        "know",
        "contraceptive",
        "act",
        "prevent",
        "conception",
        "might",
        "otherwise",
        "result",
        "sexual",
        "intercourse",
        "another",
        "child",
        "contrast",
        "could",
        "simply",
        "ignorant",
        "unable",
        "comprehend",
        "fact",
        "reproduction",
        "second",
        "understanding",
        "follows",
        "child",
        "act",
        "omission",
        "thus",
        "failure",
        "use",
        "contraceptive",
        "could",
        "lead",
        "young",
        "person",
        "sexual",
        "intercourse",
        "become",
        "pregnant",
        "two",
        "understanding",
        "together",
        "constitute",
        "knowledge",
        "nature",
        "act",
        "finally",
        "arguably",
        "come",
        "maturity",
        "ability",
        "appreciate",
        "significance",
        "act",
        "omission",
        "relevant",
        "consequence",
        "one",
        "thing",
        "know",
        "become",
        "pregnant",
        "another",
        "understand",
        "mean",
        "latter",
        "understanding",
        "involves",
        "realising",
        "pregnancy",
        "brings",
        "wake",
        "physical",
        "change",
        "resultant",
        "birth",
        "leaf",
        "young",
        "person",
        "child",
        "care",
        "scarman",
        "even",
        "insisted",
        "child",
        "would",
        "need",
        "appreciation",
        "moral",
        "family",
        "question",
        "involved",
        "third",
        "important",
        "measuring",
        "child",
        "competence",
        "respect",
        "expressing",
        "view",
        "distinguish",
        "complexity",
        "seriousness",
        "matter",
        "simple",
        "choicefor",
        "instance",
        "two",
        "option",
        "whether",
        "lifesaving",
        "operationmay",
        "nevertheless",
        "portentous",
        "enormous",
        "farreaching",
        "consequence",
        "may",
        "thus",
        "require",
        "much",
        "greater",
        "appreciation",
        "involved",
        "complex",
        "decision",
        "one",
        "range",
        "many",
        "possibility",
        "yet",
        "latter",
        "kind",
        "choiceconsider",
        "choosing",
        "fivecourse",
        "meal",
        "large",
        "menuis",
        "far",
        "le",
        "serious",
        "consequence",
        "short",
        "difficulty",
        "complexity",
        "choice",
        "confused",
        "importance",
        "significance",
        "child",
        "fourth",
        "english",
        "court",
        "least",
        "detected",
        "fundamental",
        "asymmetry",
        "refusing",
        "choosing",
        "treatment",
        "competent",
        "adult",
        "right",
        "choose",
        "treatment",
        "refuse",
        "also",
        "case",
        "competent",
        "child",
        "yearold",
        "want",
        "particular",
        "operation",
        "parent",
        "wish",
        "even",
        "contrary",
        "best",
        "judgement",
        "doctor",
        "may",
        "judged",
        "competent",
        "thus",
        "wish",
        "respected",
        "however",
        "english",
        "court",
        "series",
        "judgement",
        "gillick",
        "argued",
        "matter",
        "somehow",
        "different",
        "case",
        "child",
        "refusing",
        "operation",
        "course",
        "inconsistency",
        "refusal",
        "requires",
        "greater",
        "degree",
        "understanding",
        "appreciation",
        "issue",
        "positive",
        "acceptance",
        "choice",
        "simple",
        "disjunction",
        "hard",
        "see",
        "case",
        "issue",
        "stake",
        "disjuncts",
        "court",
        "believe",
        "obligation",
        "act",
        "best",
        "interest",
        "child",
        "trump",
        "one",
        "respect",
        "wish",
        "competent",
        "child",
        "need",
        "shown",
        "obligation",
        "force",
        "circumstance",
        "would",
        "court",
        "deny",
        "treatment",
        "child",
        "believe",
        "best",
        "interest",
        "judge",
        "competent",
        "choose",
        "child",
        "competent",
        "significant",
        "relevant",
        "respect",
        "equal",
        "adult",
        "able",
        "choose",
        "refuse",
        "treatment",
        "three",
        "final",
        "comment",
        "child",
        "right",
        "choose",
        "order",
        "first",
        "deemed",
        "child",
        "best",
        "interest",
        "evidence",
        "finally",
        "determinative",
        "judgement",
        "competence",
        "child",
        "nevertheless",
        "balancing",
        "child",
        "right",
        "heard",
        "child",
        "right",
        "best",
        "interest",
        "promoted",
        "difficult",
        "second",
        "arguably",
        "enough",
        "show",
        "child",
        "competence",
        "child",
        "understands",
        "nature",
        "act",
        "needed",
        "adult",
        "consent",
        "informed",
        "law",
        "contract",
        "adult",
        "need",
        "know",
        "signing",
        "need",
        "full",
        "appreciation",
        "contract",
        "significance",
        "import",
        "future",
        "life",
        "third",
        "gillick",
        "competence",
        "specified",
        "demanding",
        "indeed",
        "many",
        "adult",
        "making",
        "choice",
        "fail",
        "display",
        "maturity",
        "understanding",
        "involved",
        "dictated",
        "necessary",
        "child",
        "child",
        "display",
        "competence",
        "many",
        "adult",
        "lack",
        "general",
        "particular",
        "case"
    ]
}