{
    "main_text": "The Analysis of Rights || The Form of Rights: The Hohfeldian Analytical System\n2.1 The Form of Rights: The Hohfeldian Analytical System\n\nAnalysis reveals that most familiar rights, such as the right to free\nexpression or the right of private property, have a complex internal\nstructure. Such rights are ordered arrangements of basic components,\nmuch in the same way that most molecules are ordered arrangements of\nchemical elements. The four basic components of rights are known as\n“the Hohfeldian incidents” after Wesley Hohfeld\n(1879–1918), the American legal theorist who discovered them.\nThese four basic “elements” are the privilege, the claim,\nthe power, and the immunity. Each of these Hohfeldian incidents has a\ndistinctive logical form, and the incidents fit together in\ncharacteristic ways to create complex “molecular” rights.\nOnce one knows the Hohfeldian system, one can analyze precisely what\nany assertion of a right might mean.\n2.1.1 Privileges (or Liberties)\n\nYou have a right to pick up a shell that you find on the beach. This\nright is a privilege:\n\n\nA has a privilege to φ if and only if A\nhas no duty not to φ.\n\n\nTo say that you have a right to pick up the shell is to say that you\nhave no duty not to pick it up. You will not be violating any\nduty not to pick up the shell should you decide to do so. Similarly\nyour right to sit in an empty seat in the cinema, and your right to\npaint your bedroom red, are also privileges. Privilege-rights mark out\nwhat their bearer has no duty not to do. When US Presidents invoke\n“executive privilege,” they deny an assertion that they\nhave a duty not to withhold evidence: they assert a Hohfeldian\nprivilege. Similarly, a license (to drive, to perform surgery, to\nkill) endows its holder with a privilege to engage in the licensed\nactivity. Someone with a license to drive has no duty not to operate\n(specified kinds of) motor vehicles (in particular ways).\n\n(Some writers on rights have preferred to speak of\n“liberties” instead of “privileges” (e.g.,\nSteiner 1994, 59–60). Others have given these two terms\ndifferent definitions (e.g., Thomson 1990, 53–55). To avoid\nconfusion, this entry will always use “privilege” and\nnever “liberty” to refer to the incident defined\nabove.)\n2.1.2 Claims\n\nA contract between employer and employee confers on the employee a\nright to be paid her wages. This right is a claim:\n\n\nA has a claim that B φ if and only if\nB has a duty to A to φ.\n\n\nThe employee has a claim that the employer pays her her wages, which\nmeans that the employer has a duty to the employee to pay those wages.\nAs seen in the definition and the example, every claim-right\ncorrelates to a duty in (at least) one duty-bearer. What is\ndistinctive about the claim-right is that a duty-bearer’s duty\nis “directed at” or “owed to” the\nright-holder. What explains the “direction” of directed\nduties has been the subject of controversy, discussed in section\n2.2.3.\n\nSome claim-rights exist independently of voluntary actions like\nsigning a contract; and some claim-rights correspond to duties in more\nthan one agent. For example, a child’s claim-right against abuse\nexists independently of anyone’s actions, and the child’s\nclaim-right correlates to a duty in every other person not to abuse\nhim (in legal terms, the claim right is in rem). This example\nof the child’s right also illustrates how some claim-rights can\nrequire duty-bearers to refrain from performing some action\n(i.e., that “phi” can be a negative verb such as\n“not abuse him”). Bodily rights and property rights are\nparadigmatic rights with claim-rights at their core.\n2.1.3 Powers\n\nPrivileges and claims define what Hart called “primary\nrules”: rules requiring that people perform or refrain from\nperforming particular actions (Hart 1961). Indeed the primary rules\nfor all physical actions are properly analyzed as privileges and\nclaims. Were we to know all privileges and claims concerning physical\nactions, we would know for every possible physical action whether that\naction was permitted, required, or forbidden.\n\nTwo further Hohfeldian incidents define what Hart called\n“secondary rules”: rules that specify how agents can\nintroduce and change primary rules.\n\nThe Hohfeldian power is the incident that enables agents to alter\nprimary rules:\n\n\nA has a power if and only if A has the\nability to alter her own or another’s Hohfeldian incidents.\n\n\nA ship’s captain has the power-right to order a midshipman to\nscrub the deck. The captain’s exercise of this power changes the\nsailor’s normative situation: it imposes a new duty upon the\nsailor and so annuls one of the sailor’s Hohfeldian privileges\n(not to scrub the deck). Similarly, a promisor exercises a power-right\nto create in the promisee a claim that the promisor will perform a\ncertain action. The promisor’s exercise of her power-right to\npromise creates in the promisee a claim that the promisor do what she\npromised to do. Or again, a neighbor waives his claim that you not\nenter his property by inviting you into his home, thus endowing you\nwith a corresponding privilege. Ordering, promising, waiving,\nabandoning, consenting, selling, and sentencing are all examples of\nacts by which a rightholder exercises a power to change his own\nHohfeldian incidents or those of another.\n\nPowers can alter not only “first-order” privileges and\nclaims, but “higher-order” incidents as well (Sumner 1987,\n31). An admiral, for example, has the power-right to relieve a captain\nof her power-right to command a ship. Power-rights to alter the\nauthority of others are, as we will see, definitive of all developed\nlegal and political systems.\n2.1.4 Immunities\n\nThe fourth and final Hohfeldian incident is the immunity. When\nA has the ability to alter B’s Hohfeldian\nincidents, then A has a power. When A lacks\nthe ability to alter B’s Hohfeldian incidents, then B\nhas an immunity:\n\n\nB has an immunity if and only if A lacks\nthe ability to alter B’s Hohfeldian incidents.\n\n\nThe United States Congress lacks the ability within the Constitution\nto impose upon American citizens a duty to kneel daily before a cross.\nSince the Congress lacks a power, the citizens have an immunity. This\nimmunity is a core element of an American citizen’s right to\nreligious freedom. Similarly, witnesses in court have a right not to\nbe ordered to incriminate themselves, and civil servants have a right\nnot to be dismissed when a new government comes to power. All of these\nrights are immunities, corresponding to an absence of a power in some\nother party to alter the rightholder’s normative situation in\nsome way.\n2.1.5 Opposites and Correlatives\n\nHohfeld arranged the four incidents in tables of\n“opposites” and “correlatives” so as to\ndisplay the logical structure of his system. In order to fill out the\ntables he added some further terminology. For instance, if a person\nA has a claim, then A lacks a “no-claim”\n(a no-claim is the opposite of a claim). And if a person A\nhas a power, then some person B has a “liability”\n(a liability is the correlative of a power).\n\n\nOpposites \n\nIf A has \na Claim,\nthen A lacks \na No-claim. \n\n…\na Privilege,\n…\na Duty. \n\n…\na Power,\n…\na Disability. \n\n…\nan Immunity,\n…\na Liability. \n\n\n\nCorrelatives \n\nIf A has \na Claim,\nthen some person B has \na Duty. \n\n…\na Privilege,\n…\na No-claim. \n\n…\na Power,\n…\na Liability. \n\n…\nan Immunity,\n…\na Disability. \n\n2.1.6 Molecular Rights\n\nEach of the “atomic” incidents—the privilege, claim,\npower, and immunity—can be a right when it occurs in isolation.\nAnd as mentioned above these atomic incidents also bond together in\ncharacteristic ways to form complex rights. Following, for example, is\npart of the “molecular” structure of the property right\nthat you have over your computer:\n\n\nPart of the “Molecular” Structure of a Property Right\n\n\nIn the figure, the “first-order” rights are your legal\nrights directly over your property—in this case, your computer.\nThe privilege on this first level entitles you to use your computer.\nThe claim correlates to a duty in every other person not to use your\ncomputer.\n\nThe “second-order” rights are your legal rights concerning\nthe alteration of these first-order rights. You have several powers\nwith respect to your claim—you may waive the claim (granting\nothers permission to touch the computer), annul the claim (abandoning\nthe computer as your property), or transfer the claim (making the\ncomputer into someone else’s property). Also on the second\norder, your immunity prevents others from altering your first-order\nclaim over your computer. Your immunity, that is, prevents others from\nwaiving, annulling, or transferring your claim over your computer. The\nfour incidents together constitute a significant portion of your\nproperty right.\n\nOf course all of these incidents are qualified: you have no privilege\nto use your computer as a weapon, or to use your computer to hack into\nsomeone else’s machine; and your immunity may not entirely block\nout the state’s power of expropriation (if for example the\ncomputer becomes evidence in a criminal case). These qualifications to\nthe incidents carve the contours of your property right, but they do\nnot affect its basic shape.\n\nThere may also be more incidents associated with ownership than shown\nin the figure above. Wellman (1985, 1995) describes each right as\nhaving a “defining core” surrounded by “associated\nelements” which may be present or absent in a particular case.\nYour property right, for instance, may also be protected by a\nqualified third-order immunity against the government altering your\nsecond-order rights over your property (for example, under the\n“Takings Clause” of the Fifth Amendment to the US\nConstitution the government cannot simply annul your right to sell a\nparcel of your land).\n2.1.7 Active and Passive Rights\n\nThe distinction between active and passive rights (Lyons 1970) maps\nneatly onto the Hohfeldian incidents. The privilege and the power are\n“active” rights that concern their holders’ own\nactions. The claim and the immunity are “passive” rights\nthat regulate the actions of others. Active rights are signaled by\nstatements of the form “A has a right to φ”;\nwhile passive rights are signaled by statements of the form\n“A has a right that B φ” (in both of\nthese formulas, “φ” is an active verb).\n\nA naval captain has an (active) privilege-right to walk the decks and\nan (active) power-right to order that the ship set sail. A player in a\nchess tournament has a (passive) claim-right that his opponent not\ndistract him, and a professor has a (passive) immunity-right that her\nuniversity not fire her for publishing unpopular views.\n2.1.8 Negative and Positive Rights\n\nA distinction between negative and positive rights is popular among\nsome normative theorists, especially those with a bent toward\nlibertarianism. The holder of a negative right is entitled to\nnon-interference, while the holder of a positive right is entitled to\nprovision of some good or service. A right against assault is a\nclassic example of a negative right, while a right to welfare\nassistance is a prototypical positive right (Narveson 2001).\n\nSince both negative and positive rights are passive rights, some\nrights are neither negative nor positive. Privileges and powers cannot\nbe negative rights; and privileges, powers, and immunities cannot be\npositive rights. The (privilege-) right to enter a building, and the\n(power-) right to enter into a binding agreement, are neither negative\nnor positive.\n\nIt is sometimes said that negative rights are easier to satisfy than\npositive rights. Negative rights can be respected simply by each\nperson refraining from interfering with each other, while it may be\ndifficult or even impossible to fulfill everyone’s positive\nrights if the sum of people’s claims outstrips the resources\navailable.\n\nHowever, when it comes to the enforcement of rights, this difference\ndisappears. Funding a legal system that enforces citizens’\nnegative rights against assault may require more resources than\nfunding a welfare system that realizes citizens’ positive rights\nto assistance. As Holmes and Sunstein (1999, 43) put it, in the\ncontext of citizens’ rights to state enforcement, all rights are\npositive. Moreover, the point is often made that the moral urgency of\nsecuring positive rights may be just as great as the moral urgency of\nsecuring negative rights (Shue 1996). Whatever is the justificatory\nbasis for ascribing rights—autonomy, need, or something\nelse—there might be just as strong a moral case for fulfilling a\nperson’s right to adequate nutrition as there is for protecting\nthat person’s right not to be assaulted.\n",
    "section_title": "2.1 The Form of Rights: The Hohfeldian Analytical System",
    "entry_title": "Rights",
    "hierarchy_title": "Rights || The Analysis of Rights || The Form of Rights: The Hohfeldian Analytical System",
    "tokenized_text": [
        "analysis",
        "right",
        "form",
        "right",
        "hohfeldian",
        "analytical",
        "system",
        "form",
        "right",
        "hohfeldian",
        "analytical",
        "system",
        "analysis",
        "reveals",
        "familiar",
        "right",
        "right",
        "free",
        "expression",
        "right",
        "private",
        "property",
        "complex",
        "internal",
        "structure",
        "right",
        "ordered",
        "arrangement",
        "basic",
        "component",
        "much",
        "way",
        "molecule",
        "ordered",
        "arrangement",
        "chemical",
        "element",
        "four",
        "basic",
        "component",
        "right",
        "known",
        "hohfeldian",
        "incident",
        "wesley",
        "hohfeld",
        "american",
        "legal",
        "theorist",
        "discovered",
        "four",
        "basic",
        "element",
        "privilege",
        "claim",
        "power",
        "immunity",
        "hohfeldian",
        "incident",
        "distinctive",
        "logical",
        "form",
        "incident",
        "fit",
        "together",
        "characteristic",
        "way",
        "create",
        "complex",
        "molecular",
        "right",
        "one",
        "know",
        "hohfeldian",
        "system",
        "one",
        "analyze",
        "precisely",
        "assertion",
        "right",
        "might",
        "mean",
        "privilege",
        "liberty",
        "right",
        "pick",
        "shell",
        "find",
        "beach",
        "right",
        "privilege",
        "privilege",
        "φ",
        "duty",
        "φ",
        "say",
        "right",
        "pick",
        "shell",
        "say",
        "duty",
        "pick",
        "violating",
        "duty",
        "pick",
        "shell",
        "decide",
        "similarly",
        "right",
        "sit",
        "empty",
        "seat",
        "cinema",
        "right",
        "paint",
        "bedroom",
        "red",
        "also",
        "privilege",
        "privilegerights",
        "mark",
        "bearer",
        "duty",
        "u",
        "president",
        "invoke",
        "executive",
        "privilege",
        "deny",
        "assertion",
        "duty",
        "withhold",
        "evidence",
        "assert",
        "hohfeldian",
        "privilege",
        "similarly",
        "license",
        "drive",
        "perform",
        "surgery",
        "kill",
        "endows",
        "holder",
        "privilege",
        "engage",
        "licensed",
        "activity",
        "someone",
        "license",
        "drive",
        "duty",
        "operate",
        "specified",
        "kind",
        "motor",
        "vehicle",
        "particular",
        "way",
        "writer",
        "right",
        "preferred",
        "speak",
        "liberty",
        "instead",
        "privilege",
        "eg",
        "steiner",
        "others",
        "given",
        "two",
        "term",
        "different",
        "definition",
        "eg",
        "thomson",
        "avoid",
        "confusion",
        "entry",
        "always",
        "use",
        "privilege",
        "never",
        "liberty",
        "refer",
        "incident",
        "defined",
        "claim",
        "contract",
        "employer",
        "employee",
        "confers",
        "employee",
        "right",
        "paid",
        "wage",
        "right",
        "claim",
        "claim",
        "b",
        "φ",
        "b",
        "duty",
        "φ",
        "employee",
        "claim",
        "employer",
        "pay",
        "wage",
        "mean",
        "employer",
        "duty",
        "employee",
        "pay",
        "wage",
        "seen",
        "definition",
        "example",
        "every",
        "claimright",
        "correlate",
        "duty",
        "least",
        "one",
        "dutybearer",
        "distinctive",
        "claimright",
        "dutybearer",
        "duty",
        "directed",
        "owed",
        "rightholder",
        "explains",
        "direction",
        "directed",
        "duty",
        "subject",
        "controversy",
        "discussed",
        "section",
        "claimrights",
        "exist",
        "independently",
        "voluntary",
        "action",
        "like",
        "signing",
        "contract",
        "claimrights",
        "correspond",
        "duty",
        "one",
        "agent",
        "example",
        "child",
        "claimright",
        "abuse",
        "exists",
        "independently",
        "anyone",
        "action",
        "child",
        "claimright",
        "correlate",
        "duty",
        "every",
        "person",
        "abuse",
        "legal",
        "term",
        "claim",
        "right",
        "rem",
        "example",
        "child",
        "right",
        "also",
        "illustrates",
        "claimrights",
        "require",
        "dutybearers",
        "refrain",
        "performing",
        "action",
        "ie",
        "phi",
        "negative",
        "verb",
        "abuse",
        "bodily",
        "right",
        "property",
        "right",
        "paradigmatic",
        "right",
        "claimrights",
        "core",
        "power",
        "privilege",
        "claim",
        "define",
        "hart",
        "called",
        "primary",
        "rule",
        "rule",
        "requiring",
        "people",
        "perform",
        "refrain",
        "performing",
        "particular",
        "action",
        "hart",
        "indeed",
        "primary",
        "rule",
        "physical",
        "action",
        "properly",
        "analyzed",
        "privilege",
        "claim",
        "know",
        "privilege",
        "claim",
        "concerning",
        "physical",
        "action",
        "would",
        "know",
        "every",
        "possible",
        "physical",
        "action",
        "whether",
        "action",
        "permitted",
        "required",
        "forbidden",
        "two",
        "hohfeldian",
        "incident",
        "define",
        "hart",
        "called",
        "secondary",
        "rule",
        "rule",
        "specify",
        "agent",
        "introduce",
        "change",
        "primary",
        "rule",
        "hohfeldian",
        "power",
        "incident",
        "enables",
        "agent",
        "alter",
        "primary",
        "rule",
        "power",
        "ability",
        "alter",
        "another",
        "hohfeldian",
        "incident",
        "ship",
        "captain",
        "powerright",
        "order",
        "midshipman",
        "scrub",
        "deck",
        "captain",
        "exercise",
        "power",
        "change",
        "sailor",
        "normative",
        "situation",
        "imposes",
        "new",
        "duty",
        "upon",
        "sailor",
        "annuls",
        "one",
        "sailor",
        "hohfeldian",
        "privilege",
        "scrub",
        "deck",
        "similarly",
        "promisor",
        "exercise",
        "powerright",
        "create",
        "promisee",
        "claim",
        "promisor",
        "perform",
        "certain",
        "action",
        "promisor",
        "exercise",
        "powerright",
        "promise",
        "creates",
        "promisee",
        "claim",
        "promisor",
        "promised",
        "neighbor",
        "waif",
        "claim",
        "enter",
        "property",
        "inviting",
        "home",
        "thus",
        "endowing",
        "corresponding",
        "privilege",
        "ordering",
        "promising",
        "waiving",
        "abandoning",
        "consenting",
        "selling",
        "sentencing",
        "example",
        "act",
        "rightholder",
        "exercise",
        "power",
        "change",
        "hohfeldian",
        "incident",
        "another",
        "power",
        "alter",
        "firstorder",
        "privilege",
        "claim",
        "higherorder",
        "incident",
        "well",
        "sumner",
        "admiral",
        "example",
        "powerright",
        "relieve",
        "captain",
        "powerright",
        "command",
        "ship",
        "powerrights",
        "alter",
        "authority",
        "others",
        "see",
        "definitive",
        "developed",
        "legal",
        "political",
        "system",
        "immunity",
        "fourth",
        "final",
        "hohfeldian",
        "incident",
        "immunity",
        "ability",
        "alter",
        "b",
        "hohfeldian",
        "incident",
        "power",
        "lack",
        "ability",
        "alter",
        "b",
        "hohfeldian",
        "incident",
        "b",
        "immunity",
        "b",
        "immunity",
        "lack",
        "ability",
        "alter",
        "b",
        "hohfeldian",
        "incident",
        "united",
        "state",
        "congress",
        "lack",
        "ability",
        "within",
        "constitution",
        "impose",
        "upon",
        "american",
        "citizen",
        "duty",
        "kneel",
        "daily",
        "cross",
        "since",
        "congress",
        "lack",
        "power",
        "citizen",
        "immunity",
        "immunity",
        "core",
        "element",
        "american",
        "citizen",
        "right",
        "religious",
        "freedom",
        "similarly",
        "witness",
        "court",
        "right",
        "ordered",
        "incriminate",
        "civil",
        "servant",
        "right",
        "dismissed",
        "new",
        "government",
        "come",
        "power",
        "right",
        "immunity",
        "corresponding",
        "absence",
        "power",
        "party",
        "alter",
        "rightholder",
        "normative",
        "situation",
        "way",
        "opposite",
        "correlative",
        "hohfeld",
        "arranged",
        "four",
        "incident",
        "table",
        "opposite",
        "correlative",
        "display",
        "logical",
        "structure",
        "system",
        "order",
        "fill",
        "table",
        "added",
        "terminology",
        "instance",
        "person",
        "claim",
        "lack",
        "noclaim",
        "noclaim",
        "opposite",
        "claim",
        "person",
        "power",
        "person",
        "b",
        "liability",
        "liability",
        "correlative",
        "power",
        "opposite",
        "claim",
        "lack",
        "noclaim",
        "privilege",
        "duty",
        "power",
        "disability",
        "immunity",
        "liability",
        "correlative",
        "claim",
        "person",
        "b",
        "duty",
        "privilege",
        "noclaim",
        "power",
        "liability",
        "immunity",
        "disability",
        "molecular",
        "right",
        "atomic",
        "incidentsthe",
        "privilege",
        "claim",
        "power",
        "immunitycan",
        "right",
        "occurs",
        "isolation",
        "mentioned",
        "atomic",
        "incident",
        "also",
        "bond",
        "together",
        "characteristic",
        "way",
        "form",
        "complex",
        "right",
        "following",
        "example",
        "part",
        "molecular",
        "structure",
        "property",
        "right",
        "computer",
        "part",
        "molecular",
        "structure",
        "property",
        "right",
        "figure",
        "firstorder",
        "right",
        "legal",
        "right",
        "directly",
        "propertyin",
        "case",
        "computer",
        "privilege",
        "first",
        "level",
        "entitles",
        "use",
        "computer",
        "claim",
        "correlate",
        "duty",
        "every",
        "person",
        "use",
        "computer",
        "secondorder",
        "right",
        "legal",
        "right",
        "concerning",
        "alteration",
        "firstorder",
        "right",
        "several",
        "power",
        "respect",
        "claimyou",
        "may",
        "waive",
        "claim",
        "granting",
        "others",
        "permission",
        "touch",
        "computer",
        "annul",
        "claim",
        "abandoning",
        "computer",
        "property",
        "transfer",
        "claim",
        "making",
        "computer",
        "someone",
        "else",
        "property",
        "also",
        "second",
        "order",
        "immunity",
        "prevents",
        "others",
        "altering",
        "firstorder",
        "claim",
        "computer",
        "immunity",
        "prevents",
        "others",
        "waiving",
        "annulling",
        "transferring",
        "claim",
        "computer",
        "four",
        "incident",
        "together",
        "constitute",
        "significant",
        "portion",
        "property",
        "right",
        "course",
        "incident",
        "qualified",
        "privilege",
        "use",
        "computer",
        "weapon",
        "use",
        "computer",
        "hack",
        "someone",
        "else",
        "machine",
        "immunity",
        "may",
        "entirely",
        "block",
        "state",
        "power",
        "expropriation",
        "example",
        "computer",
        "becomes",
        "evidence",
        "criminal",
        "case",
        "qualification",
        "incident",
        "carve",
        "contour",
        "property",
        "right",
        "affect",
        "basic",
        "shape",
        "may",
        "also",
        "incident",
        "associated",
        "ownership",
        "shown",
        "figure",
        "wellman",
        "describes",
        "right",
        "defining",
        "core",
        "surrounded",
        "associated",
        "element",
        "may",
        "present",
        "absent",
        "particular",
        "case",
        "property",
        "right",
        "instance",
        "may",
        "also",
        "protected",
        "qualified",
        "thirdorder",
        "immunity",
        "government",
        "altering",
        "secondorder",
        "right",
        "property",
        "example",
        "taking",
        "clause",
        "fifth",
        "amendment",
        "u",
        "constitution",
        "government",
        "simply",
        "annul",
        "right",
        "sell",
        "parcel",
        "land",
        "active",
        "passive",
        "right",
        "distinction",
        "active",
        "passive",
        "right",
        "lyon",
        "map",
        "neatly",
        "onto",
        "hohfeldian",
        "incident",
        "privilege",
        "power",
        "active",
        "right",
        "concern",
        "holder",
        "action",
        "claim",
        "immunity",
        "passive",
        "right",
        "regulate",
        "action",
        "others",
        "active",
        "right",
        "signaled",
        "statement",
        "form",
        "right",
        "φ",
        "passive",
        "right",
        "signaled",
        "statement",
        "form",
        "right",
        "b",
        "φ",
        "formula",
        "φ",
        "active",
        "verb",
        "naval",
        "captain",
        "active",
        "privilegeright",
        "walk",
        "deck",
        "active",
        "powerright",
        "order",
        "ship",
        "set",
        "sail",
        "player",
        "chess",
        "tournament",
        "passive",
        "claimright",
        "opponent",
        "distract",
        "professor",
        "passive",
        "immunityright",
        "university",
        "fire",
        "publishing",
        "unpopular",
        "view",
        "negative",
        "positive",
        "right",
        "distinction",
        "negative",
        "positive",
        "right",
        "popular",
        "among",
        "normative",
        "theorist",
        "especially",
        "bent",
        "toward",
        "libertarianism",
        "holder",
        "negative",
        "right",
        "entitled",
        "noninterference",
        "holder",
        "positive",
        "right",
        "entitled",
        "provision",
        "good",
        "service",
        "right",
        "assault",
        "classic",
        "example",
        "negative",
        "right",
        "right",
        "welfare",
        "assistance",
        "prototypical",
        "positive",
        "right",
        "narveson",
        "since",
        "negative",
        "positive",
        "right",
        "passive",
        "right",
        "right",
        "neither",
        "negative",
        "positive",
        "privilege",
        "power",
        "negative",
        "right",
        "privilege",
        "power",
        "immunity",
        "positive",
        "right",
        "privilege",
        "right",
        "enter",
        "building",
        "power",
        "right",
        "enter",
        "binding",
        "agreement",
        "neither",
        "negative",
        "positive",
        "sometimes",
        "said",
        "negative",
        "right",
        "easier",
        "satisfy",
        "positive",
        "right",
        "negative",
        "right",
        "respected",
        "simply",
        "person",
        "refraining",
        "interfering",
        "may",
        "difficult",
        "even",
        "impossible",
        "fulfill",
        "everyone",
        "positive",
        "right",
        "sum",
        "people",
        "claim",
        "outstrips",
        "resource",
        "available",
        "however",
        "come",
        "enforcement",
        "right",
        "difference",
        "disappears",
        "funding",
        "legal",
        "system",
        "enforces",
        "citizen",
        "negative",
        "right",
        "assault",
        "may",
        "require",
        "resource",
        "funding",
        "welfare",
        "system",
        "realizes",
        "citizen",
        "positive",
        "right",
        "assistance",
        "holmes",
        "sunstein",
        "put",
        "context",
        "citizen",
        "right",
        "state",
        "enforcement",
        "right",
        "positive",
        "moreover",
        "point",
        "often",
        "made",
        "moral",
        "urgency",
        "securing",
        "positive",
        "right",
        "may",
        "great",
        "moral",
        "urgency",
        "securing",
        "negative",
        "right",
        "shue",
        "whatever",
        "justificatory",
        "basis",
        "ascribing",
        "rightsautonomy",
        "need",
        "something",
        "elsethere",
        "might",
        "strong",
        "moral",
        "case",
        "fulfilling",
        "person",
        "right",
        "adequate",
        "nutrition",
        "protecting",
        "person",
        "right",
        "assaulted"
    ]
}