{
    "main_text": "The General Idea of Human Rights\n1. The General Idea of Human Rights\n\nThis section attempts to explain the general idea of human rights by\nidentifying four defining features. The goal is to answer the question\nof what human rights are with a description of the core concept rather\nthan a list of specific rights. Two people can have the same general\nidea of human rights even though they disagree about which rights\nbelong on a list of such rights and even about whether universal moral\nrights exist. The four-part explanation below attempts to cover all\nkinds of human rights including both moral and legal human rights and\nboth old and new human rights (e.g., both Lockean natural rights and\ncontemporary human rights). The explanation anticipates, however, that\nparticular kinds of human rights will have additional features.\nStarting with this general concept does not commit us to treating all\nkinds of human rights in a single unified theory (see Buchanan 2013\nfor an argument that we should not attempt to theorize together\nuniversal moral rights and international legal human rights).\n\n(1) Human rights are rights. Lest we miss the obvious, human\nrights are rights (see Cruft 2012 and the entry on\n rights\n ). Most if not all human rights are claim rights that impose duties\nor responsibilities on their addressees or dutybearers. Rights focus\non a freedom, protection, status, or benefit for the rightholders\n(Beitz 2009). The duties associated with human rights often require\nactions involving respect, protection, facilitation, and provision.\nRights are usually mandatory in the sense of imposing duties on their\naddressees, but some legal human rights seem to do little more than\ndeclare high-priority goals and assign responsibility for their\nprogressive realization. One can argue, of course, that goal-like\nrights are not real rights, but it may be better to recognize that\nthey comprise a weak but useful notion of a right (See Beitz 2009 for\na defense of the view that not all human rights are rights in a strong\nsense. And see Feinberg 1973 for the idea of “manifesto\nrights”). A human rights norm might exist as (a) a shared norm\nof actual human moralities, (b) a justified moral norm supported by\nstrong reasons, (c) a legal right at the national level (where it\nmight be referred to as a “civil” or\n“constitutional” right), or (d) a legal right within\ninternational law. A human rights advocate might wish to see human\nrights exist in all four ways (See Section 2.1 How Can Human Rights\nExist?). \n\n(2) Human rights are plural. If someone accepted that there\nare human rights but held that there is only one of them, this might\nmake sense if she meant that there is one abstract underlying right\nthat generates a list of specific rights (See Dworkin 2011 for a view\nof this sort). But if this person meant that there is just one\nspecific right such as the right to peaceful assembly this would be a\nhighly revisionary view. Human rights address a variety of specific\nproblems such as guaranteeing fair trials, ending slavery, ensuring\nthe availability of education, and preventing genocide. Some\nphilosophers advocate very short lists of human rights but\nnevertheless accept plurality (see Cohen 2004, Ignatieff 2004).\n\n(3) Human rights are universal. All living humans—or\nperhaps all living persons—have human rights. One does\nnot have to be a particular kind of person or a member of some\nspecific nation or religion to have human rights. Included in the idea\nof universality is some conception of independent existence.\nPeople have human rights independently of whether they are found in\nthe practices, morality, or law of their country or culture. This idea\nof universality needs several qualifications, however. First, some\nrights, such as the right to vote, are held only by adult citizens or\nresidents and apply only to voting in one’s own country. Second,\nthe human right to freedom of movement may be taken away temporarily\nfrom a person who is convicted of committing a serious crime. And\nthird, some human rights treaties focus on the rights of vulnerable\ngroups such as minorities, women, indigenous peoples, and\nchildren.\n\n(4) Human rights have high-priority. Maurice Cranston held\nthat human rights are matters of “paramount importance”\nand their violation “a grave affront to justice” (Cranston\n1967). If human rights did not have high priority they would not have\nthe ability to compete with other powerful considerations such as\nnational stability and security, individual and national\nself-determination, and national and global prosperity. High priority\ndoes not mean, however, that human rights are absolute. As James\nGriffin says, human rights should be understood as “resistant to\ntrade-offs, but not too resistant” (Griffin 2008). Further,\nthere seems to be priority variation within human rights. For example,\nwhen the right to life conflicts with the right to privacy, the latter\nwill generally be outweighed. \n\nLet’s now consider five other features or functions that might\nbe added. \n\nShould human rights be defined as inalienable? Inalienability\ndoes not mean that rights are absolute or can never be overridden by\nother considerations. Rather it means that its holder cannot lose it\ntemporarily or permanently by bad conduct or by voluntarily giving it\nup. It is doubtful that all human rights are inalienable in this\nsense. One who endorses both human rights and imprisonment as\npunishment for serious crimes must hold that people’s rights to\nfreedom of movement can be forfeited temporarily or permanently by\njust convictions of serious crimes. Perhaps it is sufficient to say\nthat human rights are very hard to lose. (For a stronger view of\ninalienability, see Donnelly 2003, Meyers 1985).\n\nShould human rights be defined as minimal rights? A number of\nphilosophers have proposed the view that human rights are minimal in\nthe sense of not being too numerous (a few dozen rights rather than\nhundreds or thousands), and not being too demanding (See Joshua Cohen\n2004, Ignatieff 2005, and Rawls 1999). Their views suggest that human\nrights are—or should be—more concerned with avoiding the\nworst than with achieving the best. Henry Shue suggests that human\nrights concern the “lower limits on tolerable human\nconduct” rather than “great aspirations and exalted\nideals” (Shue 1996). When human rights are modest standards they\nleave most legal and policy matters open to democratic decision-making\nat the national and local levels. This allows human rights to have\nhigh priority, to accommodate a great deal of cultural and\ninstitutional variation among countries, and to leave open a large\nspace for democratic decision-making at the national level. Still,\nthere is no contradiction in the idea of an extremely expansive list\nof human rights and hence minimalism is not a defining feature of\nhuman rights (for criticism of the view that human rights are minimal\nstandards see Brems 2009 and Raz 2010). Minimalism is best seen as a\nnormative prescription for what international human rights\nshould be. Moderate forms of minimalism have considerable appeal, but\nnot as part of the definition of human rights. \n\nShould human rights be defined as always being or\n“mirroring” moral rights? Philosophers coming to\nhuman rights theory from moral philosophy sometimes assume that human\nrights must be, at bottom, moral rather than legal rights. There is no\ncontradiction, however, in people saying that they believe in human\nrights, but only when they are legal rights at the national or\ninternational levels. As Louis Henkin observed, “Political\nforces have mooted the principal philosophical objections, bridging\nthe chasm between natural and positive law by converting natural human\nrights into positive legal rights” (Henkin 1978). Theorists who\ninsist that the only human rights are legal rights may find, however,\nthat the interpretations they can give of universality, independent\nexistence, and high priority are weak.\n\nShould human rights be defined in terms of serving some sort of\npolitical function? Instead of seeing human rights as grounded in\nsome sort of independently existing moral reality, a theorist might\nsee them as the norms of a highly useful political practice that\nhumans have constructed or evolved. Such a view would see the idea of\nhuman rights as playing various political roles at the national and\ninternational levels and as serving thereby to protect urgent human\nand national interests. These political roles might include providing\nstandards for international evaluations of how governments treat their\npeople and specifying when use of economic sanctions or military\nintervention is permissible (see\n Section 2.3 Political Conceptions of Human Rights\n below). \n\nPolitical theorists would add to the four defining elements suggested\nabove some set of political roles or functions. This kind of view may\nbe plausible for the very salient international human rights\nthat have emerged in international law and politics in the last fifty\nyears. But human rights can exist and function in contexts not\ninvolving international scrutiny and intervention such as a world with\nonly one state. Imagine, for example, that an asteroid strike had\nkilled everyone in all countries except New Zealand, leaving it the\nonly state in existence. Surely the idea of human rights as well as\nmany dimensions of human rights practice could continue in New\nZealand, even though there would be no international relations, law,\nor politics (for an argument of this sort see Tasioulas 2012). And if\nin the same scenario a few people were discovered to have survived in\nIceland and were living without a government or state, New Zealanders\nwould know that human rights governed how these people should be\ntreated even though they were stateless. How deeply the idea of human\nrights must be rooted in international law and practice should not be\nsettled by definitional fiat. We can allow, however, that the sorts of\npolitical functions that Rawls and Beitz describe are\ntypically served by international human rights today. \n",
    "section_title": "1. The General Idea of Human Rights",
    "entry_title": "Human Rights",
    "hierarchy_title": "Human Rights || The General Idea of Human Rights",
    "tokenized_text": [
        "general",
        "idea",
        "human",
        "right",
        "general",
        "idea",
        "human",
        "right",
        "section",
        "attempt",
        "explain",
        "general",
        "idea",
        "human",
        "right",
        "identifying",
        "four",
        "defining",
        "feature",
        "goal",
        "answer",
        "question",
        "human",
        "right",
        "description",
        "core",
        "concept",
        "rather",
        "list",
        "specific",
        "right",
        "two",
        "people",
        "general",
        "idea",
        "human",
        "right",
        "even",
        "though",
        "disagree",
        "right",
        "belong",
        "list",
        "right",
        "even",
        "whether",
        "universal",
        "moral",
        "right",
        "exist",
        "fourpart",
        "explanation",
        "attempt",
        "cover",
        "kind",
        "human",
        "right",
        "including",
        "moral",
        "legal",
        "human",
        "right",
        "old",
        "new",
        "human",
        "right",
        "eg",
        "lockean",
        "natural",
        "right",
        "contemporary",
        "human",
        "right",
        "explanation",
        "anticipates",
        "however",
        "particular",
        "kind",
        "human",
        "right",
        "additional",
        "feature",
        "starting",
        "general",
        "concept",
        "commit",
        "u",
        "treating",
        "kind",
        "human",
        "right",
        "single",
        "unified",
        "theory",
        "see",
        "buchanan",
        "argument",
        "attempt",
        "theorize",
        "together",
        "universal",
        "moral",
        "right",
        "international",
        "legal",
        "human",
        "right",
        "human",
        "right",
        "right",
        "lest",
        "miss",
        "obvious",
        "human",
        "right",
        "right",
        "see",
        "cruft",
        "entry",
        "right",
        "human",
        "right",
        "claim",
        "right",
        "impose",
        "duty",
        "responsibility",
        "addressee",
        "dutybearers",
        "right",
        "focus",
        "freedom",
        "protection",
        "status",
        "benefit",
        "rightholders",
        "beitz",
        "duty",
        "associated",
        "human",
        "right",
        "often",
        "require",
        "action",
        "involving",
        "respect",
        "protection",
        "facilitation",
        "provision",
        "right",
        "usually",
        "mandatory",
        "sense",
        "imposing",
        "duty",
        "addressee",
        "legal",
        "human",
        "right",
        "seem",
        "little",
        "declare",
        "highpriority",
        "goal",
        "assign",
        "responsibility",
        "progressive",
        "realization",
        "one",
        "argue",
        "course",
        "goallike",
        "right",
        "real",
        "right",
        "may",
        "better",
        "recognize",
        "comprise",
        "weak",
        "useful",
        "notion",
        "right",
        "see",
        "beitz",
        "defense",
        "view",
        "human",
        "right",
        "right",
        "strong",
        "sense",
        "see",
        "feinberg",
        "idea",
        "manifesto",
        "right",
        "human",
        "right",
        "norm",
        "might",
        "exist",
        "shared",
        "norm",
        "actual",
        "human",
        "morality",
        "b",
        "justified",
        "moral",
        "norm",
        "supported",
        "strong",
        "reason",
        "c",
        "legal",
        "right",
        "national",
        "level",
        "might",
        "referred",
        "civil",
        "constitutional",
        "right",
        "legal",
        "right",
        "within",
        "international",
        "law",
        "human",
        "right",
        "advocate",
        "might",
        "wish",
        "see",
        "human",
        "right",
        "exist",
        "four",
        "way",
        "see",
        "section",
        "human",
        "right",
        "exist",
        "human",
        "right",
        "plural",
        "someone",
        "accepted",
        "human",
        "right",
        "held",
        "one",
        "might",
        "make",
        "sense",
        "meant",
        "one",
        "abstract",
        "underlying",
        "right",
        "generates",
        "list",
        "specific",
        "right",
        "see",
        "dworkin",
        "view",
        "sort",
        "person",
        "meant",
        "one",
        "specific",
        "right",
        "right",
        "peaceful",
        "assembly",
        "would",
        "highly",
        "revisionary",
        "view",
        "human",
        "right",
        "address",
        "variety",
        "specific",
        "problem",
        "guaranteeing",
        "fair",
        "trial",
        "ending",
        "slavery",
        "ensuring",
        "availability",
        "education",
        "preventing",
        "genocide",
        "philosopher",
        "advocate",
        "short",
        "list",
        "human",
        "right",
        "nevertheless",
        "accept",
        "plurality",
        "see",
        "cohen",
        "ignatieff",
        "human",
        "right",
        "universal",
        "living",
        "humansor",
        "perhaps",
        "living",
        "personshave",
        "human",
        "right",
        "one",
        "particular",
        "kind",
        "person",
        "member",
        "specific",
        "nation",
        "religion",
        "human",
        "right",
        "included",
        "idea",
        "universality",
        "conception",
        "independent",
        "existence",
        "people",
        "human",
        "right",
        "independently",
        "whether",
        "found",
        "practice",
        "morality",
        "law",
        "country",
        "culture",
        "idea",
        "universality",
        "need",
        "several",
        "qualification",
        "however",
        "first",
        "right",
        "right",
        "vote",
        "held",
        "adult",
        "citizen",
        "resident",
        "apply",
        "voting",
        "one",
        "country",
        "second",
        "human",
        "right",
        "freedom",
        "movement",
        "may",
        "taken",
        "away",
        "temporarily",
        "person",
        "convicted",
        "committing",
        "serious",
        "crime",
        "third",
        "human",
        "right",
        "treaty",
        "focus",
        "right",
        "vulnerable",
        "group",
        "minority",
        "woman",
        "indigenous",
        "people",
        "child",
        "human",
        "right",
        "highpriority",
        "maurice",
        "cranston",
        "held",
        "human",
        "right",
        "matter",
        "paramount",
        "importance",
        "violation",
        "grave",
        "affront",
        "justice",
        "cranston",
        "human",
        "right",
        "high",
        "priority",
        "would",
        "ability",
        "compete",
        "powerful",
        "consideration",
        "national",
        "stability",
        "security",
        "individual",
        "national",
        "selfdetermination",
        "national",
        "global",
        "prosperity",
        "high",
        "priority",
        "mean",
        "however",
        "human",
        "right",
        "absolute",
        "james",
        "griffin",
        "say",
        "human",
        "right",
        "understood",
        "resistant",
        "tradeoff",
        "resistant",
        "griffin",
        "seems",
        "priority",
        "variation",
        "within",
        "human",
        "right",
        "example",
        "right",
        "life",
        "conflict",
        "right",
        "privacy",
        "latter",
        "generally",
        "outweighed",
        "let",
        "consider",
        "five",
        "feature",
        "function",
        "might",
        "added",
        "human",
        "right",
        "defined",
        "inalienable",
        "inalienability",
        "mean",
        "right",
        "absolute",
        "never",
        "overridden",
        "consideration",
        "rather",
        "mean",
        "holder",
        "lose",
        "temporarily",
        "permanently",
        "bad",
        "conduct",
        "voluntarily",
        "giving",
        "doubtful",
        "human",
        "right",
        "inalienable",
        "sense",
        "one",
        "endorses",
        "human",
        "right",
        "imprisonment",
        "punishment",
        "serious",
        "crime",
        "must",
        "hold",
        "people",
        "right",
        "freedom",
        "movement",
        "forfeited",
        "temporarily",
        "permanently",
        "conviction",
        "serious",
        "crime",
        "perhaps",
        "sufficient",
        "say",
        "human",
        "right",
        "hard",
        "lose",
        "stronger",
        "view",
        "inalienability",
        "see",
        "donnelly",
        "meyers",
        "human",
        "right",
        "defined",
        "minimal",
        "right",
        "number",
        "philosopher",
        "proposed",
        "view",
        "human",
        "right",
        "minimal",
        "sense",
        "numerous",
        "dozen",
        "right",
        "rather",
        "hundred",
        "thousand",
        "demanding",
        "see",
        "joshua",
        "cohen",
        "ignatieff",
        "rawls",
        "view",
        "suggest",
        "human",
        "right",
        "areor",
        "bemore",
        "concerned",
        "avoiding",
        "worst",
        "achieving",
        "best",
        "henry",
        "shue",
        "suggests",
        "human",
        "right",
        "concern",
        "lower",
        "limit",
        "tolerable",
        "human",
        "conduct",
        "rather",
        "great",
        "aspiration",
        "exalted",
        "ideal",
        "shue",
        "human",
        "right",
        "modest",
        "standard",
        "leave",
        "legal",
        "policy",
        "matter",
        "open",
        "democratic",
        "decisionmaking",
        "national",
        "local",
        "level",
        "allows",
        "human",
        "right",
        "high",
        "priority",
        "accommodate",
        "great",
        "deal",
        "cultural",
        "institutional",
        "variation",
        "among",
        "country",
        "leave",
        "open",
        "large",
        "space",
        "democratic",
        "decisionmaking",
        "national",
        "level",
        "still",
        "contradiction",
        "idea",
        "extremely",
        "expansive",
        "list",
        "human",
        "right",
        "hence",
        "minimalism",
        "defining",
        "feature",
        "human",
        "right",
        "criticism",
        "view",
        "human",
        "right",
        "minimal",
        "standard",
        "see",
        "brems",
        "raz",
        "minimalism",
        "best",
        "seen",
        "normative",
        "prescription",
        "international",
        "human",
        "right",
        "moderate",
        "form",
        "minimalism",
        "considerable",
        "appeal",
        "part",
        "definition",
        "human",
        "right",
        "human",
        "right",
        "defined",
        "always",
        "mirroring",
        "moral",
        "right",
        "philosopher",
        "coming",
        "human",
        "right",
        "theory",
        "moral",
        "philosophy",
        "sometimes",
        "assume",
        "human",
        "right",
        "must",
        "bottom",
        "moral",
        "rather",
        "legal",
        "right",
        "contradiction",
        "however",
        "people",
        "saying",
        "believe",
        "human",
        "right",
        "legal",
        "right",
        "national",
        "international",
        "level",
        "louis",
        "henkin",
        "observed",
        "political",
        "force",
        "mooted",
        "principal",
        "philosophical",
        "objection",
        "bridging",
        "chasm",
        "natural",
        "positive",
        "law",
        "converting",
        "natural",
        "human",
        "right",
        "positive",
        "legal",
        "right",
        "henkin",
        "theorist",
        "insist",
        "human",
        "right",
        "legal",
        "right",
        "may",
        "find",
        "however",
        "interpretation",
        "give",
        "universality",
        "independent",
        "existence",
        "high",
        "priority",
        "weak",
        "human",
        "right",
        "defined",
        "term",
        "serving",
        "sort",
        "political",
        "function",
        "instead",
        "seeing",
        "human",
        "right",
        "grounded",
        "sort",
        "independently",
        "existing",
        "moral",
        "reality",
        "theorist",
        "might",
        "see",
        "norm",
        "highly",
        "useful",
        "political",
        "practice",
        "human",
        "constructed",
        "evolved",
        "view",
        "would",
        "see",
        "idea",
        "human",
        "right",
        "playing",
        "various",
        "political",
        "role",
        "national",
        "international",
        "level",
        "serving",
        "thereby",
        "protect",
        "urgent",
        "human",
        "national",
        "interest",
        "political",
        "role",
        "might",
        "include",
        "providing",
        "standard",
        "international",
        "evaluation",
        "government",
        "treat",
        "people",
        "specifying",
        "use",
        "economic",
        "sanction",
        "military",
        "intervention",
        "permissible",
        "see",
        "section",
        "political",
        "conception",
        "human",
        "right",
        "political",
        "theorist",
        "would",
        "add",
        "four",
        "defining",
        "element",
        "suggested",
        "set",
        "political",
        "role",
        "function",
        "kind",
        "view",
        "may",
        "plausible",
        "salient",
        "international",
        "human",
        "right",
        "emerged",
        "international",
        "law",
        "politics",
        "last",
        "fifty",
        "year",
        "human",
        "right",
        "exist",
        "function",
        "context",
        "involving",
        "international",
        "scrutiny",
        "intervention",
        "world",
        "one",
        "state",
        "imagine",
        "example",
        "asteroid",
        "strike",
        "killed",
        "everyone",
        "country",
        "except",
        "new",
        "zealand",
        "leaving",
        "state",
        "existence",
        "surely",
        "idea",
        "human",
        "right",
        "well",
        "many",
        "dimension",
        "human",
        "right",
        "practice",
        "could",
        "continue",
        "new",
        "zealand",
        "even",
        "though",
        "would",
        "international",
        "relation",
        "law",
        "politics",
        "argument",
        "sort",
        "see",
        "tasioulas",
        "scenario",
        "people",
        "discovered",
        "survived",
        "iceland",
        "living",
        "without",
        "government",
        "state",
        "new",
        "zealander",
        "would",
        "know",
        "human",
        "right",
        "governed",
        "people",
        "treated",
        "even",
        "though",
        "stateless",
        "deeply",
        "idea",
        "human",
        "right",
        "must",
        "rooted",
        "international",
        "law",
        "practice",
        "settled",
        "definitional",
        "fiat",
        "allow",
        "however",
        "sort",
        "political",
        "function",
        "rawls",
        "beitz",
        "describe",
        "typically",
        "served",
        "international",
        "human",
        "right",
        "today"
    ]
}