{
    "main_text": "Arbitrariness\n4. Arbitrariness\n\nLiberationists might move in the other direction and argue that the\ncapacity which purportedly qualifies adults to have rights is in fact\nnot a capacity that most, or perhaps any, adults possess. Thus, it\nwill be said that no adult fully understands the nature of the choices\nshe faces, nor is she consistent in her beliefs and desires, nor is\nshe really independent of the influences of her environment and peers.\nWhether the liberationist urges a ‘thin’ definition of\ncapacity—which the child satisfies as much as the adult—or\nargues that on a ‘thick’ definition of capacity neither\nadult nor child qualifies as capable, the point is the same. This is\nthat the alleged differences between children and adults in respect of\na qualifying capacity are not sufficient to warrant the ascription of\nrights to the latter and their denial to the former.\n\nOne way, then, to charge that age is an arbitrary means of\ndistinguishing those qualified and those not qualified to have rights\nis that there is, in fact, no real division of capacities (Cohen 1980,\n48). We should note that this claim can be supported by an\n‘argument from marginal cases’, one that has been most\ninfluentially used in the case of animal rights. The argument in that\ncontext is that for whatever capacity is argued to distinguish the\nmoral status of humans from animals there will be marginal cases\n– some humans will fail to possess it (Singer 1975, 265). In the\npresent context, the argument would be that some older children\ndisplay those abilities that supposedly distinguish children in\ngeneral from adults (and some adults do not display those abilities\nthat older children have). Whatever the merits of an argument from\nmarginal cases the importance of being able to show that some children\nclose to but below the age threshold (such as adolescents) do or do\nnot merit the same treatment as other children is clear.\n\nAnother way to make the charge of arbitrariness turns on the idea that\ndividing lines as such—‘any’ lines—are\narbitrary. Thus, either it will be said that this age is the wrong\ndividing point or that using any age is wrong. The first objection\n– ‘wrong age’- may concede that there is a better\nage to be used, just as the second objection – ‘age is\nwrong’ – may concede that there is a way, better than using age,\nto mark the division. The initial and obvious reply to the second\nobjection is that age as such is not the issue but rather the reliable\ncorrelation of age with the acquisition of those capacities that\nqualify a person for the attribution of rights. Some liberationists\nmay thus not dispute that there should be a threshold age—one\nbeyond which adult rights are acquired—but think that the\nconventional or orthodox threshold is fixed too late. Liberationists\nmay also simply deny that there should be any threshold on the grounds\nthat there just is no difference between children and adults in\nrespect of their respective capacities for any threshold age to mark.\nThis version of the arbitrariness claim concedes that if age functions\nas a threshold it does so only inasmuch as it reliably correlates with\nthe acquisition of capacities which are necessary qualifications for\nthe possession of rights. In sum, the arbitrariness claim amounts\neither to the denial that the acquisition of the specified capacities\ndoes correlate with the threshold in question or to the denial that\nthere is any age at which the capacities are acquired.\n\nSetting aside this version of the arbitrariness claim, what remains of\nthe charge that ‘[a]ny line which uses age to distinguish people\nwith rights from people without can be shown to be arbitrary’?\nThere are two ideas. The first is that although the threshold of age\ndoes serve to mark a difference within the class of human beings it is\nbeing human which is important. Or, relatedly, what is being\ndistributed, namely rights, is so important that all humans should\nhave them. It is being human which should make the difference not\nbeing of a certain age. Rights are too important to be denied to some\nhumans on account of their (lesser) age and given to others on account\nof their (greater) age.\n\nThe reply is simple. Being human does matter and it is precisely\nbecause they are human beings, albeit young ones, that children are\nentitled to be treated in ways that non-humans may not. However, it is\nrights that are being distributed and to that end a threshold age does\nmark a significant point. Although having rights is better than not\nhaving them, those who lack rights do not lack any moral status\nwhatever. Children are acknowledged to be humans meriting moral regard\nand yet to be young humans meriting a certain and age specific\nregard.\n\nSome will still insist that a threshold age does not mark a\nsignificant enough difference. A 40-year-old differs greatly from a\n4-year-old. Someone who is 18 years and 1 month does not differ\ngreatly from someone who is 17 years and 11 months. It is\nunderstandable that the 40-year-old should have rights whereas the\n4-year-old should not. But this is not the case for the latter\npairing. This is a version of the marginal cases argument about the\nextent to which real differences between classes are displayed by the\nmembers of each class at the edge of these classes. The reply will be\nthat the criticism concedes a difference between being too young to\nhave rights and being old enough to have them. These differences are\nnot arbitrary. Moreover, a threshold has to be fixed. The fact that\nthere may not be significant—or significant\nenough—differences between the members of the two classes being\ndistinguished at the edges of each class is the price one pays for\nhaving to operate with a threshold.\n\nBut is this price one that must be paid? The complaint is that age\ndoes not always reliably correlate with competence. Thus, using age\nmay risk unfairly penalising some who are in fact competent just as it\nmay risk unfairly rewarding some who are in fact incompetent.\nMoreover, the penalties and rewards in question—lacking or\npossessing rights—are far too important to run such risks. Why\nthen should one not take each individual on her own and determine\nwhether or not she is qualified to have rights?\n\nThe problems with the suggested use of a test are various. First,\nthere is the sheer administrative scale of its employment in such a\ncase as human rights. Second, there is the problem of agreeing on a\ndeterminate procedure for testing. How exactly are we to examine\nsomeone in respect of their competence to possess rights? Third, there\nis the problem of fairness. Any test must not unfairly disqualify some\ngroup of putative rights-holders by, for instance, having a bias in\nthe testing procedure which, in effect, discriminates against that\ngroup. Fourth, the administration of any official test—and\nespecially one whose passing yields such important goods—is\nsubject to the risks of corruption or of misuse for the\nself-interested ends of those administering it. Again, this cannot be\ntrue of the use of age as a threshold. To summarise, these problems\nattaching to the use of a test are large and insuperable.\n\nThe counter-response to consider is that the burdens of any such test\nshould be borne by the state inasmuch as there is a considerable risk\nof egregious wrong – the denial of rights – that is run by\ncontinuing only to use an age-based proxy for the existence of the\nrelevant capacity (Godwin 2011, 286).\n\nThe charges of arbitrariness can be argued to be false or overstated.\nChildren do differ from adults in respect of their competence to\npossess rights. A threshold of age may be the appropriate way to\nregister that difference. One should, thus, acquire rights only on\nreaching a certain age. However, two riders to this summary are\nappropriate.\n\nFirst, different rights may be acquired at different ages. After all,\nit is plausible to think that the capacities needed for, and\nqualifying a person to possess, different rights are themselves\ndifferent. More particularly, different rights would seem to require\ndifferent degrees of competence. Liberty rights entitle their\npossessors to make choices, and the matters in respect of which\nchoices are made differ in their complexity, importance, and\nconsequential impact. Those who are allowed to choose require greater\nor lesser amounts of maturity, independence, and deliberative\nproficiency in order to be able to make these different kinds of\nchoice. The decisions to marry, consume alcohol, serve in the armed\nforces, undertake paid labour, vote, buy goods in a shop, travel\nunaccompanied, and open a bank account seem to presuppose different\nlevels of understanding and autonomy. Assuming that these levels are\nprogressively acquired at different ages, it makes sense to accord the\ncorresponding rights not all at once but in stages.\n\nSecond, there should be an ordered but consistent acquisition of\nrights. If children are assumed to display the competence required for\none kind of right, they should not be refused another kind of right\nwhich presupposes the same or even a lesser degree of ability. It\nwould not make sense, for instance, to deny a young person the right\nto refuse medical treatment but allow them to choose to die in the\narmed services of their state.\n\nThe liberationist may make one last move. They may concede that\nchildren do lack the capacities that are a prerequisite for the\npossession of rights. However, they can suggest that children should\nbe permitted ‘to borrow the capacities of others to secure\nwhatever it is we are entitled to’ (Cohen 1980, 56). Child\nagents would advise their clients with a view to ensuring that the\nchild’s right is properly exercised. However, to the various\nproblems with the use of proxies or representatives, which have\nalready been rehearsed in Section 1, we may add this question, Is the\nchild still free to act or not on the advice given? If the child is\nnot so free, then the role of the adviser is a strictly paternalist\none, supplanting the child’s choice as to what is best for\nherself with her own choice. If on the other hand the child is free to\nreject the adviser’s advice, then the child is free to do what\nshe wants anyway and the role of adviser is otiose and beside the\npoint. One only needs to ‘borrow’ what one does not have.\nNot using what could be borrowed leaves one with the lack—and\nits consequences—that made the borrowing necessary. On the other\nhand, if a child can distinguish good from bad advice, then the\nborrowing is unnecessary. The child can give as good advice to herself\nas would be given to her by an adviser. But then no adviser is needed\nand this is precisely what Cohen denies.\n",
    "section_title": "4. Arbitrariness",
    "entry_title": "Children’s Rights",
    "hierarchy_title": "Children’s Rights || Arbitrariness",
    "tokenized_text": [
        "arbitrariness",
        "arbitrariness",
        "liberationists",
        "might",
        "move",
        "direction",
        "argue",
        "capacity",
        "purportedly",
        "qualifies",
        "adult",
        "right",
        "fact",
        "capacity",
        "perhaps",
        "adult",
        "posse",
        "thus",
        "said",
        "adult",
        "fully",
        "understands",
        "nature",
        "choice",
        "face",
        "consistent",
        "belief",
        "desire",
        "really",
        "independent",
        "influence",
        "environment",
        "peer",
        "whether",
        "liberationist",
        "urge",
        "thin",
        "definition",
        "capacitywhich",
        "child",
        "satisfies",
        "much",
        "adultor",
        "argues",
        "thick",
        "definition",
        "capacity",
        "neither",
        "adult",
        "child",
        "qualifies",
        "capable",
        "point",
        "alleged",
        "difference",
        "child",
        "adult",
        "respect",
        "qualifying",
        "capacity",
        "sufficient",
        "warrant",
        "ascription",
        "right",
        "latter",
        "denial",
        "former",
        "one",
        "way",
        "charge",
        "age",
        "arbitrary",
        "mean",
        "distinguishing",
        "qualified",
        "qualified",
        "right",
        "fact",
        "real",
        "division",
        "capacity",
        "cohen",
        "note",
        "claim",
        "supported",
        "argument",
        "marginal",
        "case",
        "one",
        "influentially",
        "used",
        "case",
        "animal",
        "right",
        "argument",
        "context",
        "whatever",
        "capacity",
        "argued",
        "distinguish",
        "moral",
        "status",
        "human",
        "animal",
        "marginal",
        "case",
        "human",
        "fail",
        "posse",
        "singer",
        "present",
        "context",
        "argument",
        "would",
        "older",
        "child",
        "display",
        "ability",
        "supposedly",
        "distinguish",
        "child",
        "general",
        "adult",
        "adult",
        "display",
        "ability",
        "older",
        "child",
        "whatever",
        "merit",
        "argument",
        "marginal",
        "case",
        "importance",
        "able",
        "show",
        "child",
        "close",
        "age",
        "threshold",
        "adolescent",
        "merit",
        "treatment",
        "child",
        "clear",
        "another",
        "way",
        "make",
        "charge",
        "arbitrariness",
        "turn",
        "idea",
        "dividing",
        "line",
        "such",
        "linesare",
        "arbitrary",
        "thus",
        "either",
        "said",
        "age",
        "wrong",
        "dividing",
        "point",
        "using",
        "age",
        "wrong",
        "first",
        "objection",
        "wrong",
        "age",
        "may",
        "concede",
        "better",
        "age",
        "used",
        "second",
        "objection",
        "age",
        "wrong",
        "may",
        "concede",
        "way",
        "better",
        "using",
        "age",
        "mark",
        "division",
        "initial",
        "obvious",
        "reply",
        "second",
        "objection",
        "age",
        "issue",
        "rather",
        "reliable",
        "correlation",
        "age",
        "acquisition",
        "capacity",
        "qualify",
        "person",
        "attribution",
        "right",
        "liberationists",
        "may",
        "thus",
        "dispute",
        "threshold",
        "ageone",
        "beyond",
        "adult",
        "right",
        "acquiredbut",
        "think",
        "conventional",
        "orthodox",
        "threshold",
        "fixed",
        "late",
        "liberationists",
        "may",
        "also",
        "simply",
        "deny",
        "threshold",
        "ground",
        "difference",
        "child",
        "adult",
        "respect",
        "respective",
        "capacity",
        "threshold",
        "age",
        "mark",
        "version",
        "arbitrariness",
        "claim",
        "concedes",
        "age",
        "function",
        "threshold",
        "inasmuch",
        "reliably",
        "correlate",
        "acquisition",
        "capacity",
        "necessary",
        "qualification",
        "possession",
        "right",
        "sum",
        "arbitrariness",
        "claim",
        "amount",
        "either",
        "denial",
        "acquisition",
        "specified",
        "capacity",
        "correlate",
        "threshold",
        "question",
        "denial",
        "age",
        "capacity",
        "acquired",
        "setting",
        "aside",
        "version",
        "arbitrariness",
        "claim",
        "remains",
        "charge",
        "ny",
        "line",
        "us",
        "age",
        "distinguish",
        "people",
        "right",
        "people",
        "without",
        "shown",
        "arbitrary",
        "two",
        "idea",
        "first",
        "although",
        "threshold",
        "age",
        "serve",
        "mark",
        "difference",
        "within",
        "class",
        "human",
        "being",
        "human",
        "important",
        "relatedly",
        "distributed",
        "namely",
        "right",
        "important",
        "human",
        "human",
        "make",
        "difference",
        "certain",
        "age",
        "right",
        "important",
        "denied",
        "human",
        "account",
        "lesser",
        "age",
        "given",
        "others",
        "account",
        "greater",
        "age",
        "reply",
        "simple",
        "human",
        "matter",
        "precisely",
        "human",
        "being",
        "albeit",
        "young",
        "one",
        "child",
        "entitled",
        "treated",
        "way",
        "nonhumans",
        "may",
        "however",
        "right",
        "distributed",
        "end",
        "threshold",
        "age",
        "mark",
        "significant",
        "point",
        "although",
        "right",
        "better",
        "lack",
        "right",
        "lack",
        "moral",
        "status",
        "whatever",
        "child",
        "acknowledged",
        "human",
        "meriting",
        "moral",
        "regard",
        "yet",
        "young",
        "human",
        "meriting",
        "certain",
        "age",
        "specific",
        "regard",
        "still",
        "insist",
        "threshold",
        "age",
        "mark",
        "significant",
        "enough",
        "difference",
        "yearold",
        "differs",
        "greatly",
        "yearold",
        "someone",
        "year",
        "month",
        "differ",
        "greatly",
        "someone",
        "year",
        "month",
        "understandable",
        "yearold",
        "right",
        "whereas",
        "yearold",
        "case",
        "latter",
        "pairing",
        "version",
        "marginal",
        "case",
        "argument",
        "extent",
        "real",
        "difference",
        "class",
        "displayed",
        "member",
        "class",
        "edge",
        "class",
        "reply",
        "criticism",
        "concedes",
        "difference",
        "young",
        "right",
        "old",
        "enough",
        "difference",
        "arbitrary",
        "moreover",
        "threshold",
        "fixed",
        "fact",
        "may",
        "significantor",
        "significant",
        "enoughdifferences",
        "member",
        "two",
        "class",
        "distinguished",
        "edge",
        "class",
        "price",
        "one",
        "pay",
        "operate",
        "threshold",
        "price",
        "one",
        "must",
        "paid",
        "complaint",
        "age",
        "always",
        "reliably",
        "correlate",
        "competence",
        "thus",
        "using",
        "age",
        "may",
        "risk",
        "unfairly",
        "penalising",
        "fact",
        "competent",
        "may",
        "risk",
        "unfairly",
        "rewarding",
        "fact",
        "incompetent",
        "moreover",
        "penalty",
        "reward",
        "questionlacking",
        "possessing",
        "rightsare",
        "far",
        "important",
        "run",
        "risk",
        "one",
        "take",
        "individual",
        "determine",
        "whether",
        "qualified",
        "right",
        "problem",
        "suggested",
        "use",
        "test",
        "various",
        "first",
        "sheer",
        "administrative",
        "scale",
        "employment",
        "case",
        "human",
        "right",
        "second",
        "problem",
        "agreeing",
        "determinate",
        "procedure",
        "testing",
        "exactly",
        "examine",
        "someone",
        "respect",
        "competence",
        "posse",
        "right",
        "third",
        "problem",
        "fairness",
        "test",
        "must",
        "unfairly",
        "disqualify",
        "group",
        "putative",
        "rightsholders",
        "instance",
        "bias",
        "testing",
        "procedure",
        "effect",
        "discriminates",
        "group",
        "fourth",
        "administration",
        "official",
        "testand",
        "especially",
        "one",
        "whose",
        "passing",
        "yield",
        "important",
        "goodsis",
        "subject",
        "risk",
        "corruption",
        "misuse",
        "selfinterested",
        "end",
        "administering",
        "true",
        "use",
        "age",
        "threshold",
        "summarise",
        "problem",
        "attaching",
        "use",
        "test",
        "large",
        "insuperable",
        "counterresponse",
        "consider",
        "burden",
        "test",
        "borne",
        "state",
        "inasmuch",
        "considerable",
        "risk",
        "egregious",
        "wrong",
        "denial",
        "right",
        "run",
        "continuing",
        "use",
        "agebased",
        "proxy",
        "existence",
        "relevant",
        "capacity",
        "godwin",
        "charge",
        "arbitrariness",
        "argued",
        "false",
        "overstated",
        "child",
        "differ",
        "adult",
        "respect",
        "competence",
        "posse",
        "right",
        "threshold",
        "age",
        "may",
        "appropriate",
        "way",
        "register",
        "difference",
        "one",
        "thus",
        "acquire",
        "right",
        "reaching",
        "certain",
        "age",
        "however",
        "two",
        "rider",
        "summary",
        "appropriate",
        "first",
        "different",
        "right",
        "may",
        "acquired",
        "different",
        "age",
        "plausible",
        "think",
        "capacity",
        "needed",
        "qualifying",
        "person",
        "posse",
        "different",
        "right",
        "different",
        "particularly",
        "different",
        "right",
        "would",
        "seem",
        "require",
        "different",
        "degree",
        "competence",
        "liberty",
        "right",
        "entitle",
        "possessor",
        "make",
        "choice",
        "matter",
        "respect",
        "choice",
        "made",
        "differ",
        "complexity",
        "importance",
        "consequential",
        "impact",
        "allowed",
        "choose",
        "require",
        "greater",
        "lesser",
        "amount",
        "maturity",
        "independence",
        "deliberative",
        "proficiency",
        "order",
        "able",
        "make",
        "different",
        "kind",
        "choice",
        "decision",
        "marry",
        "consume",
        "alcohol",
        "serve",
        "armed",
        "force",
        "undertake",
        "paid",
        "labour",
        "vote",
        "buy",
        "good",
        "shop",
        "travel",
        "unaccompanied",
        "open",
        "bank",
        "account",
        "seem",
        "presuppose",
        "different",
        "level",
        "understanding",
        "autonomy",
        "assuming",
        "level",
        "progressively",
        "acquired",
        "different",
        "age",
        "make",
        "sense",
        "accord",
        "corresponding",
        "right",
        "stage",
        "second",
        "ordered",
        "consistent",
        "acquisition",
        "right",
        "child",
        "assumed",
        "display",
        "competence",
        "required",
        "one",
        "kind",
        "right",
        "refused",
        "another",
        "kind",
        "right",
        "presupposes",
        "even",
        "lesser",
        "degree",
        "ability",
        "would",
        "make",
        "sense",
        "instance",
        "deny",
        "young",
        "person",
        "right",
        "refuse",
        "medical",
        "treatment",
        "allow",
        "choose",
        "die",
        "armed",
        "service",
        "state",
        "liberationist",
        "may",
        "make",
        "one",
        "last",
        "move",
        "may",
        "concede",
        "child",
        "lack",
        "capacity",
        "prerequisite",
        "possession",
        "right",
        "however",
        "suggest",
        "child",
        "permitted",
        "borrow",
        "capacity",
        "others",
        "secure",
        "whatever",
        "entitled",
        "cohen",
        "child",
        "agent",
        "would",
        "advise",
        "client",
        "view",
        "ensuring",
        "child",
        "right",
        "properly",
        "exercised",
        "however",
        "various",
        "problem",
        "use",
        "proxy",
        "representative",
        "already",
        "rehearsed",
        "section",
        "may",
        "add",
        "question",
        "child",
        "still",
        "free",
        "act",
        "advice",
        "given",
        "child",
        "free",
        "role",
        "adviser",
        "strictly",
        "paternalist",
        "one",
        "supplanting",
        "child",
        "choice",
        "best",
        "choice",
        "hand",
        "child",
        "free",
        "reject",
        "adviser",
        "advice",
        "child",
        "free",
        "want",
        "anyway",
        "role",
        "adviser",
        "otiose",
        "beside",
        "point",
        "one",
        "need",
        "borrow",
        "one",
        "using",
        "could",
        "borrowed",
        "leaf",
        "one",
        "lackand",
        "consequencesthat",
        "made",
        "borrowing",
        "necessary",
        "hand",
        "child",
        "distinguish",
        "good",
        "bad",
        "advice",
        "borrowing",
        "unnecessary",
        "child",
        "give",
        "good",
        "advice",
        "would",
        "given",
        "adviser",
        "adviser",
        "needed",
        "precisely",
        "cohen",
        "denies"
    ]
}