{
    "main_text": "Matter and seminal reasons\n3. Matter and seminal reasons\n\nIn a clear adoption of what is called universal hylemorphism,\nKilwardby claims that everything that subsists on its own, apart from\nGod, has two compositing principles, a quod est (matter) and\na quo est (form) (DOS 256; 265; 268; QLIS 35, 90; QLIS 60,\n171; QLIIS 14, 51–2).\n\nThree main issues arise from Kilwardby’s treatment of matter:\n\n\n(i)\nthe unity of matter,\n(ii)\nthe three kinds of matter, and\n(iii)\nmatter in spiritual substances.\n\n\n\nIn (i) the discussion about the unity of matter arises from the\nquestions of whether spiritual beings have matter and whether this\nmatter is in some way common to the matter of corporeal beings\n(univocally, i.e., whether it is matter in the same sense) (QLIIS\n14–16; DOS, chapters 29–31). According to its editor,\nAlbert Judy, DOS 31 is probably the result of a public disputation on\nthe topic by Kilwardby or one that he attended and is here reporting.\nWhat is clear in any case is the relation between the views presented\nin this chapter and those of some of Kilwardby’s contemporaries, such\nas Roger Bacon, Albert the Great, and Bonaventure (see also Donati\n2013). The nature of matter is of particular significance due to the\nrole it played in the Prohibitions, with a number of articles being\nabout the nature of privation, prime matter, body, and active\npotencies in matter (Silva 2020, chapter 2).\n\nKilwardby starts by distinguishing two ways of considering prime\nmatter (materia omnino prima):\n\n\n(#)\nAccording to its being (secundum esse), that is,\nconsidered in its existence together (concreta) with form,\nmatter is considered with respect to actual existing beings\n(actualiter exsistentibus). In this case matter is one or\nmany according to the form(s) it receives: a plurality of individuals\nis the result of a plurality of forms informing matter (because form\nis the form of a concrete individual thing). As such there is not one\nmatter in all things, but one or many according to the number of\nindividuals. In the same way as there are no two individuals that are\none and the same, matter cannot be one in all things. It can, however,\nbe one within all (in omnibus) the individuals and species as\none genus, that is, insofar as it is conjoined (concreta)\nwith the most general form (forma generalissima), in the\ncategory of substance (DOS 277). In this sense, matter is one and the\nsame in all things, corporeal and spiritual alike. Kilwardby\nexplicitly identifies this view as being that of Averroes.\n(##)\nAccording to its essence (secundum essentiam), that is,\nconsidered in se and per se, abstracted from any\nform (DOS 272), there are two possible views:\naccording to the first, matter has an essential unity (unitas\nessentiae), being potential with respect to any form whatsoever.\nForm is the principle of distinction and diversity; thus, prime matter\nconsidered on its own, prior to the reception of any form, is simple\nand one because it lacks the distinction that arises from being united\nwith form. The problem with this view, for Kilwardby, is that the\nreception of the specific forms requires the existence in matter of a\ncertain formal disposition (which begs the question). One and the same\nmatter cannot be indifferently receptive of both corporeal and\nspiritual forms.\nAccording to the second view, there is a diversity of essence:\nmatter is not one and the same in all things but diverse in different\nthings. This diversity of essence remains even when all the forms that\nconstitute any individual of one the kinds of being—spiritual,\ncorporeal, and natural—are (in thought) removed. According to\nthis theory, the essence of the prime matter, which constitutes any\nindividual, has different grades of purity. Prime matter has\nsubstantially different parts, sharing an essence that is one by\nanalogy.\n\n\n\nWhereas in DOS Kilwardby remains neutral to any of these views, in\nQLIIS 15 he seems to align himself with the view that the essential\nunity of matter is analogical, not numerically one. In E 2, however,\nKilwardby approaches the question in slightly different terms, which\ncan be explained by the fact that his motivation is different: whereas\nin DOS and QLIIS he intends to justify the distinction between\ncorporeal and spiritual things, in E he wants to understand matter as\nthat which underlies change. From that point of view, there are three\nkinds of prime matter:\n\n\n(APM)\nabsolute, pure, or naked prime matter (see also DNR 23,\n51–52),\n(BPM)\nbodily prime matter, and\n(PPM)\nnatural or physical prime matter.\n\n\n\nAPM has no form whatsoever and underlies (substat) all forms\nit receives: first the general forms, then the special forms. Even\nthen, Kilwardby claims, matter is not nothing simpliciter,\nthat is, lacking being but rather nothing actual (sed non ideo\ndicitur simpliciter nihil, sed nihil actuale: QLIS 79, 254).\nNaked prime matter receives first the form of the most general genus,\nsubstance, and through this form prime matter is divided into\nnumerically distinct things (only form distinguishes; QLIIS 16, 60;\nDOS 208; 406). This is the matter common to spiritual and corporeal\nthings.\n\nThen, substance receives the form of corporeity, by means of which it\nbecomes a body with dimensions and magnitude (DOS 246)—that is,\nmatter gets extended and occupies space (DOS 340; NSLP 8, 55). This\nmatter is BPM and is common to both celestial and terrestrial bodies.\nRegarding BPM, it is necessary that there be one matter that is the\nsubstrate of substantial change in the case of terrestrial bodies; or\ncircular motion in the case of celestial bodies. This matter is the\ncorporeal substance, that is, substance plus the form of corporeity\n(DOS 244–245). When something looses a substantial form, it is\nnot annihilated but remains at least with dimensions and the form of\ncorporeity (E 1, 21), as when a dead body is reduced to its state of\nbeing a mere aggregate of its components indicating its composition\n(cimbolum sue mixcionis) (E 5, 40; DOS 244). Finally, matter\nreceives the specific differences of bodies and the passive and active\nqualities (DOS 248). This is PPM, the matter common to all simple and\nmixed bodies in the sublunary sphere, that is, those that are\ngenerable and corruptible.\n\nMatter and form are the constitutive principles of a thing, but there\nare three principles of change: matter, form, and privation. According\nto Kilwardby, privation ‘is not pure nothing’ or even pure\nabsence of form but the state of ‘actively’ lacking that\nsomething imperfect has with respect to fulfillment (E 3,\n31)—and only in this way can privation be understood as a\nprinciple of change. Privation is the state of a potentiality that\ndoes not have the perfection that is owed to it (E 3, 30). In that\nsense, privation is associated with active\n potency.[7]\n\nKilwardby argues that PPM is naturally endowed/pregnant\n(gravida) with active potencies that, once set in motion by\nthe action of an external agent, co-operate in change and become fully\n actual.[8]\n An active potency “is called potency because it is ordained to\nactuality and active because it is something of a form” (E 3,\n30). Matter strives for form and the action of striving entails the\nexistence already of something of form, which is the active potency.\nPotentiality is therefore taken not as mere receptivity of form but as\nan active appetite for (full) actuality. An active potency is a form\nin an incomplete state because it was born to make itself actual\n(nata est facere se in\n actu).[9]\n\nThe existence of matter endowed with forms in an inchoate state is\nnecessary, according to Kilwardby, in order to distinguish generation\nfrom creation as well as to assure that generation is a natural (and\nnot violent) change—since an active potency is an internal\nprinciple of motion. Another of the applications of the notion of\nactive potency is to explain elemental change. Every part of PPM that\nis informed by the form of a body has the forms of all four elements\nin potency. At any given time, only one of these forms can be actual.\nThe elements transmute into one another in virtue of their active and\npassive qualities (DOS 249). With this account, Kilwardby addresses\nthe question of the presence of the four elements’ forms existing\nwithin mixed bodies differently from other authors of his time. He\ntakes his notion of potency, being a form in an inchoate state of\nactuality, as sufficient to avoid the problem of the simultaneous,\nfully actual presence of contraries in one and the same subject.\n\nThe third application of the notion of active potency is to explain\nhuman generation. Kilwardby appeals to a (then) well-known concept,\nespecially in the Augustinian milieu, of seminal reasons (see Karger\n2002; Donati 2002). Seminal reasons are a philosophical concept used\nby Augustine in order to explain the theological problem of two\napparently incompatible accounts of creation: one according to which\neverything was created in an instant, the other that there were\nsuccessive moments of creation (described in the six days narrative of\nthe Genesis). Kilwardby interprets this concept as meaning\nthat everything was created immediately but not everything\nwas made immediately (QLIIS 61, 174): in Creation, God\ncreated corporeal matter out of which He produced the first light as\nwell as the first individuals of the different species (D43Q 1, 11;\nQLIIS 85, 240). When He created the first individuals, He inserted in\nthem these seminal reasons (QLIIS 63, 179; D43Q 15, 21; 26, 29; QLIIS\n61, 176), which are the cause, through the generative power, of the\ncontinuous generation of individuals, therefore explaining the\npropagation of species throughout time without the need of divine\nintervention (E 4, 32; E 1, 22; 5, 39–40; D43Q 26, 31).\n\nIn the process of the generation of a human being, the father\ntransmits to the descendent matter—endowed with seminal reasons,\nwhich contribute to the preservation and continuity of the\nspecies—and the corporeal spirit. These are present in the\nsemen, as the first principle of life and the power of the principle\nof life. The principle of life is that which first receives the action\nof the soul, the one in which the soul is realized; the power of the\nprinciple of life is that which acting as an efficient cause brings\nthe active potency in matter to actuality. In the same way as a plant\ngerminates from a seed, the vegetative and sensitive souls (the\nprinciple of life) exist in an inchoate state in the semen separated\nfrom the father, and they are educed from this matter by the action of\nthe corporeal spirit (the power of the principle of life—D43Q\n34, 37; QLIIS 85, 239).\n\nMaking use of the medical and philosophical knowledge available to\nhim, Kilwardby argues that the semen cannot be just a superfluity of\ndigested food because in that case the offspring would resemble the\nfather’s aliment and not the father (E 4, 30). In addition to the role\nplayed by the father in the generation of the new being, the mother\ncontributes to the offspring with matter that is used to protect and\nfeed the embryo (some matter of the semen has the same purpose) and\nthe local warmth that constitutes the proper environment to the\ndevelopment of the new life.\n\nBefore concluding this section on matter, it is worth returning to\npoint (iii) above, where it was clained that matter is a metaphysical\nconstituent of things and is necessary for explaining change,\nreceptivity of accidents, and individuation. Therefore, all created\nthings must have matter and form in their constitution, as befits the\nposition of universal hylemorphism. But, whereas things that are\nsubjected to generation and corruption are made out of natural or\nphysical matter (materia physica)—matter in the proper\nsense (proprie)—spiritual things also have matter, but\nin the common sense (communiter) of metaphysical matter\n(materia metaphysica). This matter is the subject of the\nspiritual form (DOS 265; QLIIS 82) and is defined as potential being\n(QLIIS 14). Matter in this sense explains individuation (DOS\n266–269) as well as change (other than substantial change) that\ntakes place in spiritual substances (DOS 320). (For Kilwardby’s view\nin the context of Thirteenth Century debates on matter, see Donati\n2013)\n",
    "section_title": "3. Matter and seminal reasons",
    "entry_title": "Robert Kilwardby",
    "hierarchy_title": "Robert Kilwardby || Matter and seminal reasons",
    "tokenized_text": [
        "matter",
        "seminal",
        "reason",
        "matter",
        "seminal",
        "reason",
        "clear",
        "adoption",
        "called",
        "universal",
        "hylemorphism",
        "kilwardby",
        "claim",
        "everything",
        "subsists",
        "apart",
        "god",
        "two",
        "compositing",
        "principle",
        "quod",
        "est",
        "matter",
        "quo",
        "est",
        "form",
        "do",
        "qlis",
        "qlis",
        "qliis",
        "three",
        "main",
        "issue",
        "arise",
        "kilwardby",
        "treatment",
        "matter",
        "unity",
        "matter",
        "ii",
        "three",
        "kind",
        "matter",
        "iii",
        "matter",
        "spiritual",
        "substance",
        "discussion",
        "unity",
        "matter",
        "arises",
        "question",
        "whether",
        "spiritual",
        "being",
        "matter",
        "whether",
        "matter",
        "way",
        "common",
        "matter",
        "corporeal",
        "being",
        "univocally",
        "ie",
        "whether",
        "matter",
        "sense",
        "qliis",
        "do",
        "chapter",
        "according",
        "editor",
        "albert",
        "judy",
        "do",
        "probably",
        "result",
        "public",
        "disputation",
        "topic",
        "kilwardby",
        "one",
        "attended",
        "reporting",
        "clear",
        "case",
        "relation",
        "view",
        "presented",
        "chapter",
        "kilwardby",
        "contemporary",
        "roger",
        "bacon",
        "albert",
        "great",
        "bonaventure",
        "see",
        "also",
        "donati",
        "nature",
        "matter",
        "particular",
        "significance",
        "due",
        "role",
        "played",
        "prohibition",
        "number",
        "article",
        "nature",
        "privation",
        "prime",
        "matter",
        "body",
        "active",
        "potency",
        "matter",
        "silva",
        "chapter",
        "kilwardby",
        "start",
        "distinguishing",
        "two",
        "way",
        "considering",
        "prime",
        "matter",
        "materia",
        "omnino",
        "prima",
        "according",
        "secundum",
        "esse",
        "considered",
        "existence",
        "together",
        "concreta",
        "form",
        "matter",
        "considered",
        "respect",
        "actual",
        "existing",
        "being",
        "actualiter",
        "exsistentibus",
        "case",
        "matter",
        "one",
        "many",
        "according",
        "form",
        "receives",
        "plurality",
        "individual",
        "result",
        "plurality",
        "form",
        "informing",
        "matter",
        "form",
        "form",
        "concrete",
        "individual",
        "thing",
        "one",
        "matter",
        "thing",
        "one",
        "many",
        "according",
        "number",
        "individual",
        "way",
        "two",
        "individual",
        "one",
        "matter",
        "one",
        "thing",
        "however",
        "one",
        "within",
        "omnibus",
        "individual",
        "specie",
        "one",
        "genus",
        "insofar",
        "conjoined",
        "concreta",
        "general",
        "form",
        "forma",
        "generalissima",
        "category",
        "substance",
        "do",
        "sense",
        "matter",
        "one",
        "thing",
        "corporeal",
        "spiritual",
        "alike",
        "kilwardby",
        "explicitly",
        "identifies",
        "view",
        "averroes",
        "according",
        "essence",
        "secundum",
        "essentiam",
        "considered",
        "se",
        "per",
        "se",
        "abstracted",
        "form",
        "do",
        "two",
        "possible",
        "view",
        "according",
        "first",
        "matter",
        "essential",
        "unity",
        "unitas",
        "essentiae",
        "potential",
        "respect",
        "form",
        "whatsoever",
        "form",
        "principle",
        "distinction",
        "diversity",
        "thus",
        "prime",
        "matter",
        "considered",
        "prior",
        "reception",
        "form",
        "simple",
        "one",
        "lack",
        "distinction",
        "arises",
        "united",
        "form",
        "problem",
        "view",
        "kilwardby",
        "reception",
        "specific",
        "form",
        "requires",
        "existence",
        "matter",
        "certain",
        "formal",
        "disposition",
        "begs",
        "question",
        "one",
        "matter",
        "indifferently",
        "receptive",
        "corporeal",
        "spiritual",
        "form",
        "according",
        "second",
        "view",
        "diversity",
        "essence",
        "matter",
        "one",
        "thing",
        "diverse",
        "different",
        "thing",
        "diversity",
        "essence",
        "remains",
        "even",
        "form",
        "constitute",
        "individual",
        "one",
        "kind",
        "beingspiritual",
        "corporeal",
        "naturalare",
        "thought",
        "removed",
        "according",
        "theory",
        "essence",
        "prime",
        "matter",
        "constitutes",
        "individual",
        "different",
        "grade",
        "purity",
        "prime",
        "matter",
        "substantially",
        "different",
        "part",
        "sharing",
        "essence",
        "one",
        "analogy",
        "whereas",
        "do",
        "kilwardby",
        "remains",
        "neutral",
        "view",
        "qliis",
        "seems",
        "align",
        "view",
        "essential",
        "unity",
        "matter",
        "analogical",
        "numerically",
        "one",
        "e",
        "however",
        "kilwardby",
        "approach",
        "question",
        "slightly",
        "different",
        "term",
        "explained",
        "fact",
        "motivation",
        "different",
        "whereas",
        "do",
        "qliis",
        "intends",
        "justify",
        "distinction",
        "corporeal",
        "spiritual",
        "thing",
        "e",
        "want",
        "understand",
        "matter",
        "underlies",
        "change",
        "point",
        "view",
        "three",
        "kind",
        "prime",
        "matter",
        "apm",
        "absolute",
        "pure",
        "naked",
        "prime",
        "matter",
        "see",
        "also",
        "dnr",
        "bpm",
        "bodily",
        "prime",
        "matter",
        "ppm",
        "natural",
        "physical",
        "prime",
        "matter",
        "apm",
        "form",
        "whatsoever",
        "underlies",
        "substat",
        "form",
        "receives",
        "first",
        "general",
        "form",
        "special",
        "form",
        "even",
        "kilwardby",
        "claim",
        "matter",
        "nothing",
        "simpliciter",
        "lacking",
        "rather",
        "nothing",
        "actual",
        "sed",
        "non",
        "ideo",
        "dicitur",
        "simpliciter",
        "nihil",
        "sed",
        "nihil",
        "actuale",
        "qlis",
        "naked",
        "prime",
        "matter",
        "receives",
        "first",
        "form",
        "general",
        "genus",
        "substance",
        "form",
        "prime",
        "matter",
        "divided",
        "numerically",
        "distinct",
        "thing",
        "form",
        "distinguishes",
        "qliis",
        "do",
        "matter",
        "common",
        "spiritual",
        "corporeal",
        "thing",
        "substance",
        "receives",
        "form",
        "corporeity",
        "mean",
        "becomes",
        "body",
        "dimension",
        "magnitude",
        "do",
        "that",
        "matter",
        "get",
        "extended",
        "occupies",
        "space",
        "do",
        "nslp",
        "matter",
        "bpm",
        "common",
        "celestial",
        "terrestrial",
        "body",
        "regarding",
        "bpm",
        "necessary",
        "one",
        "matter",
        "substrate",
        "substantial",
        "change",
        "case",
        "terrestrial",
        "body",
        "circular",
        "motion",
        "case",
        "celestial",
        "body",
        "matter",
        "corporeal",
        "substance",
        "substance",
        "plus",
        "form",
        "corporeity",
        "do",
        "something",
        "loos",
        "substantial",
        "form",
        "annihilated",
        "remains",
        "least",
        "dimension",
        "form",
        "corporeity",
        "e",
        "dead",
        "body",
        "reduced",
        "state",
        "mere",
        "aggregate",
        "component",
        "indicating",
        "composition",
        "cimbolum",
        "sue",
        "mixcionis",
        "e",
        "do",
        "finally",
        "matter",
        "receives",
        "specific",
        "difference",
        "body",
        "passive",
        "active",
        "quality",
        "do",
        "ppm",
        "matter",
        "common",
        "simple",
        "mixed",
        "body",
        "sublunary",
        "sphere",
        "generable",
        "corruptible",
        "matter",
        "form",
        "constitutive",
        "principle",
        "thing",
        "three",
        "principle",
        "change",
        "matter",
        "form",
        "privation",
        "according",
        "kilwardby",
        "privation",
        "pure",
        "nothing",
        "even",
        "pure",
        "absence",
        "form",
        "state",
        "actively",
        "lacking",
        "something",
        "imperfect",
        "respect",
        "fulfillment",
        "e",
        "and",
        "way",
        "privation",
        "understood",
        "principle",
        "change",
        "privation",
        "state",
        "potentiality",
        "perfection",
        "owed",
        "e",
        "sense",
        "privation",
        "associated",
        "active",
        "potency",
        "kilwardby",
        "argues",
        "ppm",
        "naturally",
        "endowedpregnant",
        "gravida",
        "active",
        "potency",
        "set",
        "motion",
        "action",
        "external",
        "agent",
        "cooperate",
        "change",
        "become",
        "fully",
        "actual",
        "active",
        "potency",
        "called",
        "potency",
        "ordained",
        "actuality",
        "active",
        "something",
        "form",
        "e",
        "matter",
        "strives",
        "form",
        "action",
        "striving",
        "entail",
        "existence",
        "already",
        "something",
        "form",
        "active",
        "potency",
        "potentiality",
        "therefore",
        "taken",
        "mere",
        "receptivity",
        "form",
        "active",
        "appetite",
        "full",
        "actuality",
        "active",
        "potency",
        "form",
        "incomplete",
        "state",
        "born",
        "make",
        "actual",
        "nata",
        "est",
        "facere",
        "se",
        "actu",
        "existence",
        "matter",
        "endowed",
        "form",
        "inchoate",
        "state",
        "necessary",
        "according",
        "kilwardby",
        "order",
        "distinguish",
        "generation",
        "creation",
        "well",
        "assure",
        "generation",
        "natural",
        "violent",
        "changesince",
        "active",
        "potency",
        "internal",
        "principle",
        "motion",
        "another",
        "application",
        "notion",
        "active",
        "potency",
        "explain",
        "elemental",
        "change",
        "every",
        "part",
        "ppm",
        "informed",
        "form",
        "body",
        "form",
        "four",
        "element",
        "potency",
        "given",
        "time",
        "one",
        "form",
        "actual",
        "element",
        "transmute",
        "one",
        "another",
        "virtue",
        "active",
        "passive",
        "quality",
        "do",
        "account",
        "kilwardby",
        "address",
        "question",
        "presence",
        "four",
        "element",
        "form",
        "existing",
        "within",
        "mixed",
        "body",
        "differently",
        "author",
        "time",
        "take",
        "notion",
        "potency",
        "form",
        "inchoate",
        "state",
        "actuality",
        "sufficient",
        "avoid",
        "problem",
        "simultaneous",
        "fully",
        "actual",
        "presence",
        "contrary",
        "one",
        "subject",
        "third",
        "application",
        "notion",
        "active",
        "potency",
        "explain",
        "human",
        "generation",
        "kilwardby",
        "appeal",
        "wellknown",
        "concept",
        "especially",
        "augustinian",
        "milieu",
        "seminal",
        "reason",
        "see",
        "karger",
        "donati",
        "seminal",
        "reason",
        "philosophical",
        "concept",
        "used",
        "augustine",
        "order",
        "explain",
        "theological",
        "problem",
        "two",
        "apparently",
        "incompatible",
        "account",
        "creation",
        "one",
        "according",
        "everything",
        "created",
        "instant",
        "successive",
        "moment",
        "creation",
        "described",
        "six",
        "day",
        "narrative",
        "genesis",
        "kilwardby",
        "interprets",
        "concept",
        "meaning",
        "everything",
        "created",
        "immediately",
        "everything",
        "made",
        "immediately",
        "qliis",
        "creation",
        "god",
        "created",
        "corporeal",
        "matter",
        "produced",
        "first",
        "light",
        "well",
        "first",
        "individual",
        "different",
        "specie",
        "dq",
        "qliis",
        "created",
        "first",
        "individual",
        "inserted",
        "seminal",
        "reason",
        "qliis",
        "dq",
        "qliis",
        "cause",
        "generative",
        "power",
        "continuous",
        "generation",
        "individual",
        "therefore",
        "explaining",
        "propagation",
        "specie",
        "throughout",
        "time",
        "without",
        "need",
        "divine",
        "intervention",
        "e",
        "e",
        "dq",
        "process",
        "generation",
        "human",
        "father",
        "transmits",
        "descendent",
        "matterendowed",
        "seminal",
        "reason",
        "contribute",
        "preservation",
        "continuity",
        "speciesand",
        "corporeal",
        "spirit",
        "present",
        "semen",
        "first",
        "principle",
        "life",
        "power",
        "principle",
        "life",
        "principle",
        "life",
        "first",
        "receives",
        "action",
        "soul",
        "one",
        "soul",
        "realized",
        "power",
        "principle",
        "life",
        "acting",
        "efficient",
        "cause",
        "brings",
        "active",
        "potency",
        "matter",
        "actuality",
        "way",
        "plant",
        "germinates",
        "seed",
        "vegetative",
        "sensitive",
        "soul",
        "principle",
        "life",
        "exist",
        "inchoate",
        "state",
        "semen",
        "separated",
        "father",
        "educed",
        "matter",
        "action",
        "corporeal",
        "spirit",
        "power",
        "principle",
        "lifedq",
        "qliis",
        "making",
        "use",
        "medical",
        "philosophical",
        "knowledge",
        "available",
        "kilwardby",
        "argues",
        "semen",
        "superfluity",
        "digested",
        "food",
        "case",
        "offspring",
        "would",
        "resemble",
        "father",
        "aliment",
        "father",
        "e",
        "addition",
        "role",
        "played",
        "father",
        "generation",
        "new",
        "mother",
        "contributes",
        "offspring",
        "matter",
        "used",
        "protect",
        "feed",
        "embryo",
        "matter",
        "semen",
        "purpose",
        "local",
        "warmth",
        "constitutes",
        "proper",
        "environment",
        "development",
        "new",
        "life",
        "concluding",
        "section",
        "matter",
        "worth",
        "returning",
        "point",
        "iii",
        "clained",
        "matter",
        "metaphysical",
        "constituent",
        "thing",
        "necessary",
        "explaining",
        "change",
        "receptivity",
        "accident",
        "individuation",
        "therefore",
        "created",
        "thing",
        "must",
        "matter",
        "form",
        "constitution",
        "befits",
        "position",
        "universal",
        "hylemorphism",
        "whereas",
        "thing",
        "subjected",
        "generation",
        "corruption",
        "made",
        "natural",
        "physical",
        "matter",
        "materia",
        "physica",
        "matter",
        "proper",
        "sense",
        "proprie",
        "spiritual",
        "thing",
        "also",
        "matter",
        "common",
        "sense",
        "communiter",
        "metaphysical",
        "matter",
        "materia",
        "metaphysica",
        "matter",
        "subject",
        "spiritual",
        "form",
        "do",
        "qliis",
        "defined",
        "potential",
        "qliis",
        "matter",
        "sense",
        "explains",
        "individuation",
        "do",
        "well",
        "change",
        "substantial",
        "change",
        "take",
        "place",
        "spiritual",
        "substance",
        "do",
        "kilwardby",
        "view",
        "context",
        "thirteenth",
        "century",
        "debate",
        "matter",
        "see",
        "donati"
    ]
}