{
    "main_text": "The Classification of sciences in the De ortu Scientiarum\n6. The Classification of sciences in the De ortu Scientiarum\n\nKilwardby adopts a scheme of ordination for the different sciences or\ndisciplines, and it is largely based on the model of Hugh of St.\nVictor’s Didascalicon: De studii legendi, a widely circulated\nand immensely influential work from the twelfth century on the\nclassification of sciences (see Silva 2013). As with the work of his\n(Augustinian) predecessor and notable influence, the DOS had a fame of\nits own and remains one of the most relevant medieval works of its\nkind.\n\nHugh’s Didascalicon (itself inspired by previous\nclassifications—see Weisheipl 1965) however only allows for\nKilwardby to include the sciences in what is called knowledge—to\nthis he must (and does) add the principles of the division of the\ndifferent sciences into various fields of inquiry and then the\nclassification of the different sciences within a certain field of\ninquiry. Kilwardby goes beyond Hugh and previous classifications not\nso much with regard to the principles of division and classification,\nbut rather with regard to what is implied in science—that is to\nsay, with regard to the necessary requirements for something to be\nconsidered scientific in a certain field of inquiry and process of\ndiscovery according to the Aristotelian deductive model of science.\nAny science (not\n art)[30]\n needs to fulfill three main requirements: first, it should have a\nsubject matter (DOS 167; 221); second, it should present the parts and\nspecies of a science’s subject matter and their properties (DOS\n650–652); third, it should take into account the first common\nprinciples of demonstration and have a set principles appropriated to\nits genus (NLP I.23).\n\nThe modus sciencie, according to the prologue of his NLPery,\n“consists of the speculation about the proven properties of the\nparts and species of the subject matter” (Lewry Pery, 382; see\nalso NLP prologue; LT 50, 125), which is done by means of definition,\ndivision, and collection. By means of division one comes to know the\nsubject of a science; through collection or reasoning one comes to\nknow the properties of the parts and species of the subject; from\ndefinition, one comes to know the parts and species of the subject\n(DOS 524–525; QLIS 7, 18–19).\n\nA major difficulty is whether one and the same\nscience—metaphysics—can have such two distinct objects as\nGod and creatures, still respecting the principle of the unity of\nscience (DOS 221; see also QLIS 4). In DOS 226 Kilwardby claims that\nunity by analogy is sufficient for the science of being qua being\n(scientia de ente), metaphysics, to be the field of inquiry\nthat has God and the creatures as objects of inquiry. Being and\nsubstance can be predicated by analogy of God and creatures: of God\nprimarily and properly, of creatures in a participative and less\nproper way. God cannot be known directly, but He can be known by means\nof His effects and by negation, in the same way our bodily eyes do not\nsee themselves except through a mirror (DOS 225).\n\nA major issue in the division and classification of disciplinary\nfields is the relation between subaltern sciences. In DOS 324\nKilwardby advocates three criteria for subalternation:\n\n\n(i)\nThe subject matter of the subaltern science falls under the\nsubject genus of the subject matter of the subalterning science.\n(ii)\nThe properties of the subject of a subaltern science can only be\nproven by means of the properties of the subject genus of the\nsubalterning science (DOS 330), by adding something of another genus\nin nature that is, however, somehow essential to the subalternate\nscience. For instance, the knowledge of ‘triangle’ and\n‘isosceles’ belongs to one and the same science even\nthough ‘isosceles’ is something in addition to the\ngeometrical demonstrations of the properties of ‘triangle’\n(DOS 329).\n(iii)\nDemonstrations of subaltern sciences must be made within the same\nsubject genus of the subalterning science, that is, a property of\nsomething belonging to one genus cannot be demonstrated from a thing\nbelonging to another genus—for example, a geometrical\nproposition demonstrated by means of arithmetic (NLP I.21, 120).\nMoreover, each subalterning science has a set of first principles that\nare used as starting points for all the subaltern sciences. For\nexample, the properties of numbers of harmony can only be known\nthrough the knowledge of the properties of number simpliciter\n(DOS 330).\n\n\n\nOne example of this subordination is found in the relation between the\nscience of geometry and its subordinate sciences. Geometry is the part\nof speculative philosophy dedicated to the study of limited magnitude\n(finite limited quantity abstracted from natural matter), its parts,\nand their properties (DOS 64–65). Astronomy and optics are two\nsuch subordinated sciences. Astronomy is a speculative science that\nhas as its object the magnitude of celestial bodies and the distance\nbetween them (DOS 72), whereas optics is defined as the speculative\nscience that has as its object the diverse modes of vision, focusing\non the nature of visual rays. It belongs to the genus that is the\nsubject matter of geometry because the visual rays propagate\nrectilinearly (DOS 77).\n\nKilwardby begins his text in a clarifying manner of distinguishing\nbetween those sciences that are about human words and actions and\nthose that are about what is divine (DOS 1; 654). The science of the\ndivine is theology, focused on the study of the Sacred Scripture. Of\nthe human sciences, some are commendable (philosophy), others vicious\nor illicit (magic). In DOS, Kilwardby is mostly concerned with the\nsciences of human invention. He further divides philosophy into\nspeculative—the name that designates a group of sciences\nconstituted by physics, mathematics, and metaphysics—and another\ngroup classified under the heading ‘about human things’,\nthat is, the results of human intentionality (QLIS 90, 286); it\nincludes the active sciences and the sciences of language. The former\ndivides into mechanics and ethics, the latter into grammar, logic, and\nrhetoric. Mathematics includes the sciences of the\nquadrivium, that is, the four sciences of things as they were\nknown in the Middle Ages (geometry, astronomy, music, and\narithmetic).\n\nScience, in the sense of knowledge, falls into one of three kinds: (i)\nthat which is primarily oriented to and necessary for salvation; (ii)\nthat which is useful in the search for truth and righteous\nliving—for living an honest life—but not sufficient for\nsalvation; (iii) that which is useless in both respects and is\nconnected with vanity (DOS 1–2). This grouping obeys a general\nprinciple, originated from Augustine, which sets up the direction for\nmedieval learning: knowledge must be directed towards virtue (DOS\n639). This same aspect is also present in the consideration of the\norder of the sciences, in which all sciences are preparatory to the\nscience of the higher end: all sciences are subordinated to, or at the\nservice of (famulantur), theology.\n\nKilwardby’s criterion for classification is the object of the sciences\n(Alessio 2001, 108–9): “science must be divided according\nto the division of things about which it is” (DOS 5). “The\ndiversity of sciences”, he says, “results from the\ndiversity of their subject matters” (DOS 108). Sciences are\norganized, as in the Boethian scheme, according to the level of\nabstraction of their objects of study from matter. Speculative\nsciences rank highest (DOS 203) and among them metaphysics.\nMetaphysics deals with being without qualification\n(simpliciter), whereas mathematics and physics deal with\nparticular kinds of being (DOS 323; NLP II.11, 417). Metaphysics\nconsiders substance and its principles – matter and form –\nper se, that is, apart from change and privation, whereas physics\n(natural philosophy) considers substance as mutable and therefore\nmatter and form (and privation) as principles of change (DOS 232);\nmathematics deals with changeable material things but not insofar as\nthey are material, rather, insofar as they are abstracted from motion\n(within the sciences of the quadrivium, where the order is\nastronomy, geometry, harmony, and arithmetic).\n\nIn chapters 63 and 64, Kilwardby discusses different ways to consider\nthe order of the sciences: (i) the order of discovery, (ii) the\nnatural order, (iii) the ordering according to ends, (iv) the order of\nthe degree of certainty, and (v) the order of teachability.\n\nAccording to (i), the first among the (arts and) sciences are the\nmechanical arts because they result from the necessity to assist human\nbeings in surpassing their natural physical constraints (DOS 358).\nHuman beings are, in comparison with other animals, weaker in body,\nand therefore tend to devise forms to surpass this deficiency (DOS\n626); but they are gifted (by God) with reason to discover ways to\nsurpass their physical limitations (DOS 360–61). The\nsub-divisions of the mechanical arts obey the principles laid out in\nHugh of St. Victor’s Didascalicon—as Kilwardby himself\nmakes explicit (see DOS, chapters 37–39). Special attention must\nbe paid to the similarity between the scheme of the seven liberal arts\nand the seven mechanical arts that Hugh defends and Robert follows\n(DOS 363): as the liberal arts divide into trivium (sciences\nof language) and quadrivium (sciences of things) the\nmechanical arts also divide into a group of three arts concerning\nthose things related to what is external to the body (extrinsecus\ncorporis)—clothing, weaponry (further divided into\narchitecture and industry), and navigation—and a group of four\narts focusing on what is internal to the body (intrinsecus\ncorporis)—agriculture, hunting, medicine, and theatre.\n\nNext comes speculative philosophy, and here the order is physics,\nmathematics, and metaphysics. This order is established on the basis\nof the proximity of each to the senses, from closest to most distant\n(DOS 627). The end of the speculative sciences is truth (DOS 394),\nthat is, to know the way of natural things according to their natures\n(DOS 405). Then comes ethics (DOS 628), the science that considers the\nhuman operations in connection with the mortal human body (DOS 404),\nfollowed by the sciences of speech/language, which have an order\nthemselves: grammar, rhetoric, and logic.\n\nKilwardby offers a two-fold consideration of logic, in a stricter and\nin a broader sense. In the broader sense, logic is a science of speech\n(scientia sermocinalis), dealing with correct expression,\nincluding grammar, rhetoric, and dialectic (logic in the strict\nsense). In the stricter sense, logic is the science of reasoning\n(scientia rationalis) (DOS 492). Logic is the science of\nreasoning because it considers and teaches the discovery of terms,\ntheir organization into complex expressions, and the combination of\ncomplex expressions into syllogistic demonstrations; but it is also\nthe science of speech because it deals with the linguistic expression\nof reasoning—which does not remain, as Kilwardby says, hidden\n(inchoate) in the mind (DOS 578): mental words are about things,\nspoken words are about mental words, and written words are about\nspoken words (DOS 593).\n\nThe sciences of speech divide into those that are significative of\nwhat is known (grammar) and those that are inquisitive about what is\nnot known (logic and rhetoric) (DOS 468). Rhetoric differs from logic\nin that the former is about hypotheses and what is particular, whereas\nthe latter is about theses and what is universal—its subject\nmatter is the syllogism and its species (DOS 468; 471; 474). By\ncontrast, rhetoric, as the science of speaking well, presupposes\ngrammar—the science of signifying correctly (DOS 629). The\nsubject matter of grammar is significative speech qua significative\n(DOS 474), that is, the oratio and its parts insofar as they\nsignify or co-signify (DOS 489). Speech (sermo) here means\nthe human vox as it signifies by convention (ad\nplacitum) (DOS 488). Grammar considers the sentence from the\npoint of view of how well it is formed or its congruity\n(congruitas), which is the result of how its elements are\ncorrectly ordered to one another, rather than of the correspondence of\nthose words with the things they signify (NSLPery I.5). The end\n(finis) is to teach how to correctly express the conceptions\nof the mind (DOS 483–84; 490). Kilwardby’s willingness to grant\na scientific role to grammar is notorious (Rosier 1994; Sirridge\n1988).\n\nNatural order (ii) is the order of the subject matter, that is, the\ndegree of abstraction: first the speculative sciences, then active\nsciences, and finally the sciences of language (DOS 630–635).\n(According to this criterion, the order among the sciences of language\nis: grammar, logic, and rhetoric; this order is found already in the\nprologue of the NSLP).\n\nThe third type of order (iii) is the order of the end (finis)\nor the ends of the different sciences. Among the sciences, ethics is\nthe first from this point of view, followed by the speculative\nsciences, and then the sciences of language. (According to this\ncriterion, the order among the sciences of language is: logic,\nrhetoric, and grammar.) Speculative knowledge is ordered to ethics in\nthe same way as truth is ordered to the supreme good (DOS 405; see\nCelano 2013, 340).\n\nThe next criterion (iv) is according to the form or the degree of\ncertainty achieved. According to this, the first among the sciences\nare the speculative – and among them the highest\n(certior) is mathematics (NLP II.34, 512) – followed by\nthe active sciences – and here ethics is prior to mechanics.\n\nThe final criterion (v) is the order of teachability. According to\nthis ordering, the sciences of language come first—and grammar\nfirst among them—followed by the speculative and active\nsciences—ethics first, then mechanics.\n\nTo conclude, Kilwardby’s classification includes elements from\nprevious classifications, but the overall result is quite original:\n(i) the inclusion of logic, as a branch of science about human beings,\nwithin the active sciences; (ii) the Aristotelian inspired division\nbetween theoretical or speculative philosophy—which encompasses\nphysics, mathematics, and metaphysics—and practical\nphilosophy—which comprises ethics and divides further into\nmonastic, economic, and political; (iii) the inclusion of the\nmechanical arts (from Hugh of St. Victor) within active or practical\nphilosophy.\n",
    "section_title": "6. The Classification of sciences in the De ortu Scientiarum",
    "entry_title": "Robert Kilwardby",
    "hierarchy_title": "Robert Kilwardby || The Classification of sciences in the De ortu Scientiarum",
    "tokenized_text": [
        "classification",
        "science",
        "de",
        "ortu",
        "scientiarum",
        "classification",
        "science",
        "de",
        "ortu",
        "scientiarum",
        "kilwardby",
        "adopts",
        "scheme",
        "ordination",
        "different",
        "science",
        "discipline",
        "largely",
        "based",
        "model",
        "hugh",
        "st",
        "victor",
        "didascalicon",
        "de",
        "studii",
        "legendi",
        "widely",
        "circulated",
        "immensely",
        "influential",
        "work",
        "twelfth",
        "century",
        "classification",
        "science",
        "see",
        "silva",
        "work",
        "augustinian",
        "predecessor",
        "notable",
        "influence",
        "do",
        "fame",
        "remains",
        "one",
        "relevant",
        "medieval",
        "work",
        "kind",
        "hugh",
        "didascalicon",
        "inspired",
        "previous",
        "classificationssee",
        "weisheipl",
        "however",
        "allows",
        "kilwardby",
        "include",
        "science",
        "called",
        "knowledgeto",
        "must",
        "add",
        "principle",
        "division",
        "different",
        "science",
        "various",
        "field",
        "inquiry",
        "classification",
        "different",
        "science",
        "within",
        "certain",
        "field",
        "inquiry",
        "kilwardby",
        "go",
        "beyond",
        "hugh",
        "previous",
        "classification",
        "much",
        "regard",
        "principle",
        "division",
        "classification",
        "rather",
        "regard",
        "implied",
        "sciencethat",
        "say",
        "regard",
        "necessary",
        "requirement",
        "something",
        "considered",
        "scientific",
        "certain",
        "field",
        "inquiry",
        "process",
        "discovery",
        "according",
        "aristotelian",
        "deductive",
        "model",
        "science",
        "science",
        "art",
        "need",
        "fulfill",
        "three",
        "main",
        "requirement",
        "first",
        "subject",
        "matter",
        "do",
        "second",
        "present",
        "part",
        "specie",
        "science",
        "subject",
        "matter",
        "property",
        "do",
        "third",
        "take",
        "account",
        "first",
        "common",
        "principle",
        "demonstration",
        "set",
        "principle",
        "appropriated",
        "genus",
        "nlp",
        "i",
        "modus",
        "sciencie",
        "according",
        "prologue",
        "nlpery",
        "consists",
        "speculation",
        "proven",
        "property",
        "part",
        "specie",
        "subject",
        "matter",
        "lewry",
        "pery",
        "see",
        "also",
        "nlp",
        "prologue",
        "lt",
        "done",
        "mean",
        "definition",
        "division",
        "collection",
        "mean",
        "division",
        "one",
        "come",
        "know",
        "subject",
        "science",
        "collection",
        "reasoning",
        "one",
        "come",
        "know",
        "property",
        "part",
        "specie",
        "subject",
        "definition",
        "one",
        "come",
        "know",
        "part",
        "specie",
        "subject",
        "do",
        "qlis",
        "major",
        "difficulty",
        "whether",
        "one",
        "sciencemetaphysicscan",
        "two",
        "distinct",
        "object",
        "god",
        "creature",
        "still",
        "respecting",
        "principle",
        "unity",
        "science",
        "do",
        "see",
        "also",
        "qlis",
        "do",
        "kilwardby",
        "claim",
        "unity",
        "analogy",
        "sufficient",
        "science",
        "qua",
        "scientia",
        "de",
        "ente",
        "metaphysics",
        "field",
        "inquiry",
        "god",
        "creature",
        "object",
        "inquiry",
        "substance",
        "predicated",
        "analogy",
        "god",
        "creature",
        "god",
        "primarily",
        "properly",
        "creature",
        "participative",
        "le",
        "proper",
        "way",
        "god",
        "known",
        "directly",
        "known",
        "mean",
        "effect",
        "negation",
        "way",
        "bodily",
        "eye",
        "see",
        "except",
        "mirror",
        "do",
        "major",
        "issue",
        "division",
        "classification",
        "disciplinary",
        "field",
        "relation",
        "subaltern",
        "science",
        "do",
        "kilwardby",
        "advocate",
        "three",
        "criterion",
        "subalternation",
        "subject",
        "matter",
        "subaltern",
        "science",
        "fall",
        "subject",
        "genus",
        "subject",
        "matter",
        "subalterning",
        "science",
        "ii",
        "property",
        "subject",
        "subaltern",
        "science",
        "proven",
        "mean",
        "property",
        "subject",
        "genus",
        "subalterning",
        "science",
        "do",
        "adding",
        "something",
        "another",
        "genus",
        "nature",
        "however",
        "somehow",
        "essential",
        "subalternate",
        "science",
        "instance",
        "knowledge",
        "triangle",
        "isosceles",
        "belongs",
        "one",
        "science",
        "even",
        "though",
        "isosceles",
        "something",
        "addition",
        "geometrical",
        "demonstration",
        "property",
        "triangle",
        "do",
        "iii",
        "demonstration",
        "subaltern",
        "science",
        "must",
        "made",
        "within",
        "subject",
        "genus",
        "subalterning",
        "science",
        "property",
        "something",
        "belonging",
        "one",
        "genus",
        "demonstrated",
        "thing",
        "belonging",
        "another",
        "genusfor",
        "example",
        "geometrical",
        "proposition",
        "demonstrated",
        "mean",
        "arithmetic",
        "nlp",
        "i",
        "moreover",
        "subalterning",
        "science",
        "set",
        "first",
        "principle",
        "used",
        "starting",
        "point",
        "subaltern",
        "science",
        "example",
        "property",
        "number",
        "harmony",
        "known",
        "knowledge",
        "property",
        "number",
        "simpliciter",
        "do",
        "one",
        "example",
        "subordination",
        "found",
        "relation",
        "science",
        "geometry",
        "subordinate",
        "science",
        "geometry",
        "part",
        "speculative",
        "philosophy",
        "dedicated",
        "study",
        "limited",
        "magnitude",
        "finite",
        "limited",
        "quantity",
        "abstracted",
        "natural",
        "matter",
        "part",
        "property",
        "do",
        "astronomy",
        "optic",
        "two",
        "subordinated",
        "science",
        "astronomy",
        "speculative",
        "science",
        "object",
        "magnitude",
        "celestial",
        "body",
        "distance",
        "do",
        "whereas",
        "optic",
        "defined",
        "speculative",
        "science",
        "object",
        "diverse",
        "mode",
        "vision",
        "focusing",
        "nature",
        "visual",
        "ray",
        "belongs",
        "genus",
        "subject",
        "matter",
        "geometry",
        "visual",
        "ray",
        "propagate",
        "rectilinearly",
        "do",
        "kilwardby",
        "begin",
        "text",
        "clarifying",
        "manner",
        "distinguishing",
        "science",
        "human",
        "word",
        "action",
        "divine",
        "do",
        "science",
        "divine",
        "theology",
        "focused",
        "study",
        "sacred",
        "scripture",
        "human",
        "science",
        "commendable",
        "philosophy",
        "others",
        "vicious",
        "illicit",
        "magic",
        "do",
        "kilwardby",
        "mostly",
        "concerned",
        "science",
        "human",
        "invention",
        "divide",
        "philosophy",
        "speculativethe",
        "name",
        "designates",
        "group",
        "science",
        "constituted",
        "physic",
        "mathematics",
        "metaphysicsand",
        "another",
        "group",
        "classified",
        "heading",
        "human",
        "thing",
        "result",
        "human",
        "intentionality",
        "qlis",
        "includes",
        "active",
        "science",
        "science",
        "language",
        "former",
        "divide",
        "mechanic",
        "ethic",
        "latter",
        "grammar",
        "logic",
        "rhetoric",
        "mathematics",
        "includes",
        "science",
        "quadrivium",
        "four",
        "science",
        "thing",
        "known",
        "middle",
        "age",
        "geometry",
        "astronomy",
        "music",
        "arithmetic",
        "science",
        "sense",
        "knowledge",
        "fall",
        "one",
        "three",
        "kind",
        "primarily",
        "oriented",
        "necessary",
        "salvation",
        "ii",
        "useful",
        "search",
        "truth",
        "righteous",
        "livingfor",
        "living",
        "honest",
        "lifebut",
        "sufficient",
        "salvation",
        "iii",
        "useless",
        "respect",
        "connected",
        "vanity",
        "do",
        "grouping",
        "obeys",
        "general",
        "principle",
        "originated",
        "augustine",
        "set",
        "direction",
        "medieval",
        "learning",
        "knowledge",
        "must",
        "directed",
        "towards",
        "virtue",
        "do",
        "aspect",
        "also",
        "present",
        "consideration",
        "order",
        "science",
        "science",
        "preparatory",
        "science",
        "higher",
        "end",
        "science",
        "subordinated",
        "service",
        "famulantur",
        "theology",
        "kilwardby",
        "criterion",
        "classification",
        "object",
        "science",
        "alessio",
        "science",
        "must",
        "divided",
        "according",
        "division",
        "thing",
        "do",
        "diversity",
        "science",
        "say",
        "result",
        "diversity",
        "subject",
        "matter",
        "do",
        "science",
        "organized",
        "boethian",
        "scheme",
        "according",
        "level",
        "abstraction",
        "object",
        "study",
        "matter",
        "speculative",
        "science",
        "rank",
        "highest",
        "do",
        "among",
        "metaphysics",
        "metaphysics",
        "deal",
        "without",
        "qualification",
        "simpliciter",
        "whereas",
        "mathematics",
        "physic",
        "deal",
        "particular",
        "kind",
        "do",
        "nlp",
        "ii",
        "metaphysics",
        "considers",
        "substance",
        "principle",
        "matter",
        "form",
        "per",
        "se",
        "apart",
        "change",
        "privation",
        "whereas",
        "physic",
        "natural",
        "philosophy",
        "considers",
        "substance",
        "mutable",
        "therefore",
        "matter",
        "form",
        "privation",
        "principle",
        "change",
        "do",
        "mathematics",
        "deal",
        "changeable",
        "material",
        "thing",
        "insofar",
        "material",
        "rather",
        "insofar",
        "abstracted",
        "motion",
        "within",
        "science",
        "quadrivium",
        "order",
        "astronomy",
        "geometry",
        "harmony",
        "arithmetic",
        "chapter",
        "kilwardby",
        "discus",
        "different",
        "way",
        "consider",
        "order",
        "science",
        "order",
        "discovery",
        "ii",
        "natural",
        "order",
        "iii",
        "ordering",
        "according",
        "end",
        "iv",
        "order",
        "degree",
        "certainty",
        "v",
        "order",
        "teachability",
        "according",
        "first",
        "among",
        "art",
        "science",
        "mechanical",
        "art",
        "result",
        "necessity",
        "assist",
        "human",
        "being",
        "surpassing",
        "natural",
        "physical",
        "constraint",
        "do",
        "human",
        "being",
        "comparison",
        "animal",
        "weaker",
        "body",
        "therefore",
        "tend",
        "devise",
        "form",
        "surpass",
        "deficiency",
        "do",
        "gifted",
        "god",
        "reason",
        "discover",
        "way",
        "surpass",
        "physical",
        "limitation",
        "do",
        "subdivisions",
        "mechanical",
        "art",
        "obey",
        "principle",
        "laid",
        "hugh",
        "st",
        "victor",
        "didascaliconas",
        "kilwardby",
        "make",
        "explicit",
        "see",
        "do",
        "chapter",
        "special",
        "attention",
        "must",
        "paid",
        "similarity",
        "scheme",
        "seven",
        "liberal",
        "art",
        "seven",
        "mechanical",
        "art",
        "hugh",
        "defends",
        "robert",
        "follows",
        "do",
        "liberal",
        "art",
        "divide",
        "trivium",
        "science",
        "language",
        "quadrivium",
        "science",
        "thing",
        "mechanical",
        "art",
        "also",
        "divide",
        "group",
        "three",
        "art",
        "concerning",
        "thing",
        "related",
        "external",
        "body",
        "extrinsecus",
        "corporis",
        "clothing",
        "weaponry",
        "divided",
        "architecture",
        "industry",
        "navigationand",
        "group",
        "four",
        "art",
        "focusing",
        "internal",
        "body",
        "intrinsecus",
        "corporis",
        "agriculture",
        "hunting",
        "medicine",
        "theatre",
        "next",
        "come",
        "speculative",
        "philosophy",
        "order",
        "physic",
        "mathematics",
        "metaphysics",
        "order",
        "established",
        "basis",
        "proximity",
        "sens",
        "closest",
        "distant",
        "do",
        "end",
        "speculative",
        "science",
        "truth",
        "do",
        "know",
        "way",
        "natural",
        "thing",
        "according",
        "nature",
        "do",
        "come",
        "ethic",
        "do",
        "science",
        "considers",
        "human",
        "operation",
        "connection",
        "mortal",
        "human",
        "body",
        "do",
        "followed",
        "science",
        "speechlanguage",
        "order",
        "grammar",
        "rhetoric",
        "logic",
        "kilwardby",
        "offer",
        "twofold",
        "consideration",
        "logic",
        "stricter",
        "broader",
        "sense",
        "broader",
        "sense",
        "logic",
        "science",
        "speech",
        "scientia",
        "sermocinalis",
        "dealing",
        "correct",
        "expression",
        "including",
        "grammar",
        "rhetoric",
        "dialectic",
        "logic",
        "strict",
        "sense",
        "stricter",
        "sense",
        "logic",
        "science",
        "reasoning",
        "scientia",
        "rationalis",
        "do",
        "logic",
        "science",
        "reasoning",
        "considers",
        "teach",
        "discovery",
        "term",
        "organization",
        "complex",
        "expression",
        "combination",
        "complex",
        "expression",
        "syllogistic",
        "demonstration",
        "also",
        "science",
        "speech",
        "deal",
        "linguistic",
        "expression",
        "reasoningwhich",
        "remain",
        "kilwardby",
        "say",
        "hidden",
        "inchoate",
        "mind",
        "do",
        "mental",
        "word",
        "thing",
        "spoken",
        "word",
        "mental",
        "word",
        "written",
        "word",
        "spoken",
        "word",
        "do",
        "science",
        "speech",
        "divide",
        "significative",
        "known",
        "grammar",
        "inquisitive",
        "known",
        "logic",
        "rhetoric",
        "do",
        "rhetoric",
        "differs",
        "logic",
        "former",
        "hypothesis",
        "particular",
        "whereas",
        "latter",
        "thesis",
        "universalits",
        "subject",
        "matter",
        "syllogism",
        "specie",
        "do",
        "contrast",
        "rhetoric",
        "science",
        "speaking",
        "well",
        "presupposes",
        "grammarthe",
        "science",
        "signifying",
        "correctly",
        "do",
        "subject",
        "matter",
        "grammar",
        "significative",
        "speech",
        "qua",
        "significative",
        "do",
        "oratio",
        "part",
        "insofar",
        "signify",
        "cosignify",
        "do",
        "speech",
        "sermo",
        "mean",
        "human",
        "vox",
        "signifies",
        "convention",
        "ad",
        "placitum",
        "do",
        "grammar",
        "considers",
        "sentence",
        "point",
        "view",
        "well",
        "formed",
        "congruity",
        "congruitas",
        "result",
        "element",
        "correctly",
        "ordered",
        "one",
        "another",
        "rather",
        "correspondence",
        "word",
        "thing",
        "signify",
        "nslpery",
        "i",
        "end",
        "finis",
        "teach",
        "correctly",
        "express",
        "conception",
        "mind",
        "do",
        "kilwardby",
        "willingness",
        "grant",
        "scientific",
        "role",
        "grammar",
        "notorious",
        "rosier",
        "sirridge",
        "natural",
        "order",
        "ii",
        "order",
        "subject",
        "matter",
        "degree",
        "abstraction",
        "first",
        "speculative",
        "science",
        "active",
        "science",
        "finally",
        "science",
        "language",
        "do",
        "according",
        "criterion",
        "order",
        "among",
        "science",
        "language",
        "grammar",
        "logic",
        "rhetoric",
        "order",
        "found",
        "already",
        "prologue",
        "nslp",
        "third",
        "type",
        "order",
        "iii",
        "order",
        "end",
        "finis",
        "end",
        "different",
        "science",
        "among",
        "science",
        "ethic",
        "first",
        "point",
        "view",
        "followed",
        "speculative",
        "science",
        "science",
        "language",
        "according",
        "criterion",
        "order",
        "among",
        "science",
        "language",
        "logic",
        "rhetoric",
        "grammar",
        "speculative",
        "knowledge",
        "ordered",
        "ethic",
        "way",
        "truth",
        "ordered",
        "supreme",
        "good",
        "do",
        "see",
        "celano",
        "next",
        "criterion",
        "iv",
        "according",
        "form",
        "degree",
        "certainty",
        "achieved",
        "according",
        "first",
        "among",
        "science",
        "speculative",
        "among",
        "highest",
        "certior",
        "mathematics",
        "nlp",
        "ii",
        "followed",
        "active",
        "science",
        "ethic",
        "prior",
        "mechanic",
        "final",
        "criterion",
        "v",
        "order",
        "teachability",
        "according",
        "ordering",
        "science",
        "language",
        "come",
        "firstand",
        "grammar",
        "first",
        "among",
        "themfollowed",
        "speculative",
        "active",
        "sciencesethics",
        "first",
        "mechanic",
        "conclude",
        "kilwardby",
        "classification",
        "includes",
        "element",
        "previous",
        "classification",
        "overall",
        "result",
        "quite",
        "original",
        "inclusion",
        "logic",
        "branch",
        "science",
        "human",
        "being",
        "within",
        "active",
        "science",
        "ii",
        "aristotelian",
        "inspired",
        "division",
        "theoretical",
        "speculative",
        "philosophywhich",
        "encompasses",
        "physic",
        "mathematics",
        "metaphysicsand",
        "practical",
        "philosophywhich",
        "comprises",
        "ethic",
        "divide",
        "monastic",
        "economic",
        "political",
        "iii",
        "inclusion",
        "mechanical",
        "art",
        "hugh",
        "st",
        "victor",
        "within",
        "active",
        "practical",
        "philosophy"
    ]
}