{
    "main_text": "Rorty in the Conversations of Philosophy || Claim to Pragmatism\n4.3 Analytic Philosophy\n\nRorty is sometimes portrayed as a renegade, as someone who went\nthrough a transformation from bona fide analytical philosopher to\nsomething else, and then lived to tell a tale of liberation from\nyouthful enchantment. This portrayal, however, distorts both\nRorty’s view of analytical philosophy and the trajectory of his\nthinking. Indeed, Rorty’s relationship to the traditions of\nWestern philosophy is more nuanced than his reputation might suggest.\nSo, too, is his relation to analytical philosophy in particular.\n\nThough the introduction to the 1967 volume on the linguistic turn\n(Rorty, 1992) and the early papers in philosophy of mind from the\n1960s do show Rorty adopting frameworks for philosophical problems\nthat he later dispenses with, these writings at the same time very\nclearly bear the mark of the fundamental metaphilosophical attitude\nwhich becomes increasingly explicit in the next decade (see Stephen\nLeach and James Tartaglia, “Introduction,” MLM\n1–15). In the Preface to PMN, referring to Hartshorne, McKeon,\nCarnap, Robert Brumbaugh, Carl Hempel, and Paul Weiss, Rorty says,\n\n\nI was very fortunate in having these men as my teachers, but, for\nbetter or worse, I treated them all as saying the same thing: that a\n“philosophical problem” was a product of the unconscious\nadoption of a set of assumptions built into the vocabulary in which\nthe problem was stated – assumptions which were to be questioned\nbefore the problem itself was taken seriously. (PMN, xiii)\n\n\nThis way of stating the lesson, however, appears to leave open the\npossibility that certain philosophical problems eventually may\nlegitimately be taken seriously – that is, at face value in the\nsense that they require constructive solutions – provided the\nassumptions which sustain their formulation stand up to proper\ncritical scrutiny. Taken this way, the attitude Rorty here expresses\nwould be more or less the same as that of all those philosophers who\nhave diagnosed their predecessors’ work as mixtures of\npseudo-questions and genuine problems dimly glimpsed, problems which\nnow, with the proper frame of questioning fully clarified, may be\nproductively addressed. But the full force of the lesson Rorty learned\nemerges only with the view that this notion of proper critical\nscrutiny is questionable. For Rorty, to legitimate the assumptions on\nwhich a philosophical problem is based would be to establish that the\nterms we require to pose that problem are really mandatory, that the\nvocabulary in which we encounter the problem is in principle\ninescapable. But Rorty’s construal of the linguistic turn, as\nwell as his proposals for eliminating the vocabulary of the mental,\nare really at odds with the idea that we might hope to construct a\ndefinitive vocabulary for philosophy. Even in his early days,\nRorty’s approach to philosophy is shaped by the historicist\nconviction that no vocabulary is inescapable in principle. This means\nthat progress in philosophy is gained less from constructive solutions\nto problems than through therapeutic dissolution of their causes, that\nis, through the invention of new vocabularies achieved by the launch\nof new and fruitful metaphors (“Introduction” in PMN;\n“Unfamiliar Noises: Hesse and Davidson on Metaphor” in\nORT).\n\nTo hold that no vocabulary is final is also to hold that no vocabulary\ncan be free of unthematized yet optional assumptions. Hence any effort\nto circumvent a philosophical problem by making such assumptions\nvisible is subject to its own circumvention. Accordingly, the fact\nthat Rorty often distances himself from the terms in which he earlier\nframed arguments and made diagnoses is in itself no reason to impose\non him, as some have done, a temporal dichotomy. It may be that\nRorty’s early work, inspired by a less critical, less\ndialectical reading of Quine and Sellars than that offered in PMN, is\nmore constructive than therapeutic in tone and jargon, and therefore\nfrom Rorty’s later perspective in an important sense misguided.\nHowever, what ties together all Rorty’s work, over time and\nacross themes, is his complete lack of faith in the idea that there is\nan ideal vocabulary, one which contains all genuine discursive\noptions. Rorty designates this faith Platonism (an important theme in\nCIS). That there are no inescapable forms of description is a thought\nwhich permeates Rorty’s work from the 1960s through his later\ntherapeutic articulations of pragmatism right up until his\ncharacterization of philosophy as cultural politics (PCP).\nCharacterizations of pragmatism in terms of anti-foundationalism\n(PMN), of anti-representationalism (ORT), and of anti-essentialism\n(TP) are all explicitly parasitic on constructive efforts in\nepistemology and metaphysics, and are intended to highlight the\nvarious ways these efforts remain under the spell of a Platonic faith\nin ideal concepts and mandatory forms of descriptions.\n\nRorty’s use of Quine and Sellars to make his fundamental points\nagainst the idea of philosophy as a knowledge legitimation project, as\nwell as his articulation of his critique in terms of typically\n“analytical” philosophical problems, has contributed to an\nimpression of PMN as an internal indictment of analytic philosophy as\nsuch. Many – some gleeful, some chagrined – have read PMN\nas a purported demonstration of the bankruptcy of one of the two\ncontemporary main streams of Western philosophy. Such readers draw\nsupport for this view also from the fact that much of Rorty’s\nwritings since PMN have been concerned to show the virtues in thinkers\nlike Heidegger and Derrida (EHO). Forty years later, however, it seems\nunwise to superimpose the analytic-continental divide onto the message\nof PMN, or onto Rorty. In PMN, his central point is that philosophy\nneeds to break free from the metaphor of mind as a medium of\nappearances, appearances that philosophy must help us sort into the\nmere and the reality-corresponding ones. Rorty made this point in a\nvocabulary that was developed by Anglo-American (whether by birth,\nnaturalization, or late adoption) philosophers in the course of the\npreceding half-century. It is not necessary, and probably misleading,\nto see Rorty’s criticism of epistemology and the assumptions\nthat make it appear worthwhile as a criticism of a particular\nphilosophical style of philosophy or set of methodological habits.\nReading PMN in conjunction with the essays in CP (see particularly\nessay 4, “Professionalized Philosophy and Transcendentalist\nCulture”, essay 12, “Philosophy in America Today”,\nand also “Introduction”), one quickly sees that the target\nof PMN cannot be a putative school or branch of the subject called\n“Analytic Philosophy.” Because Rorty thinks philosophy has\nno essence, has no defining historical task, fails to mark out a\nspecial domain of knowledge, and is not, in short, a natural kind (CP,\n226), he leaves no ground from which to level that sort of critique.\nNor is it his intention to do so. Around the time of the publication\nof PMN, Rorty’s view of the matter was “that\n‘analytic philosophy’ now has only a stylistic and\nsociological unity” (CP, 217). He then qualifies this point as\nfollows: “In saying [this], I am not suggesting that analytic\nphilosophy is a bad thing, or is in bad shape. The analytic style is,\nI think, a good style. The esprit de corps among\nanalytic philosophers is healthy and useful” (CP, 217). However,\nwhile Rorty apparently bears no prejudice against analytic philosophy\nin particular, the very reason for his tolerance – his\nantiessentialist, historicist view of philosophy and its problems\n– has for many critics been a point of objection. After his\nfaint praise, Rorty goes on:\n\n\nAll I am saying is that analytic philosophy has become, whether it\nlikes it or not, the same sort of discipline as we find in the other\n“humanities” departments – departments where\npretensions to “rigor” and to “scientific”\nstatus are less evident. The normal form of life in the humanities is\nthe same as that in the arts and in belles-lettres; a genius does\nsomething new and interesting and persuasive, and his or her admirers\nbegin to form a school or movement. (CP, 217–218)\n\n\nThis is perfectly consonant with the attitude to the notion of\nphilosophical method Rorty expresses 20 years later: “So-called\nmethods are simply descriptions of the activities engaged in by the\nenthusiastic imitators of one or another original mind – what\nKuhn would call the ”research programs“ to which their\nworks gave rise” (TP, 10). Rorty’s metaphilosophical\ncritique, then, is directed not at particular techniques or styles or\nvocabularies, but toward the idea that philosophical problems are\nanything other than transient tensions in the dynamics of evolving,\ncontingent vocabularies. If his critique has bite specifically against\nanalytic philosophy, this may be because of a lingering faith in\nphilosophical problems as lasting intellectual challenges that any\nhonest thinker has to acknowledge, and which may be met by making\nprogress in methodology. Rorty himself, however, nowhere says that\nthis faith is part of the essence of analytical philosophy. On the\ncontrary, it is clear that pioneering analytical philosophers, people\nlike Sellars, Quine, and Davidson, provided Rorty with indispensable\ncritical tools in his attack on the epistemological\nlegitimation-project that has been a central concern in philosophy\nsince Descartes.\n\nShorn of the ambition to make progress on perpetual problems,\nphilosophy in the analytic tradition remains a dynamic enterprise, as\nRorty’s own work demonstrates. It is true that Rorty, as a\nprofessor of the humanities at the University of Virginia, found a\nlarger intellectual audience outside philosophy departments, as he\nincreasingly turned to literary theory and to political thought.\nHowever, while drawing on sources outside the analytic tradition and\nalso outside the field of philosophy, Rorty never ceased to engage\nwith analytic philosophy, and he retained a significant audience among\nAnglophone philosophers critical of the resurgence of metaphysics\nbrought on by the seminal work of Saul Kripke. A slow but persistent\nresurgence and rearticulation of pragmatic naturalism beginning in the\n1990s, gaining force after the turn of the millennium, provided new\nperspectives on Rorty and on the dialectical role of his\nmetaphilosophical critique.\n\nIn the years since Rorty’s death, the publication of monographs\nand anthologies dedicated to his thought suggests that interest in\nRorty’s contributions is on the rise in the world of Anglophone\nphilosophy. The tone of these critical appraisals is generally\ndifferent from the frequently harsh responses to the slayer of\nrepresentationalist epistemology that appeared during the 1980s.\nPerceptions of Rorty’s critique have clearly softened; recent\ncommentators appear less concerned to defend the epistemological\nenterprise, and more interested in coming to terms with Rorty’s\ncritique and to understand it in historical perspective. Moreover,\nRorty’s work is increasingly being addressed as a contribution\nto political thought, with attention shifting away from\nmeta-epistemology and on to Rorty’s vision and defense of\nliberalism, his distinctive conception of social progress, and his\nassessments of the prospects of reform toward greater social justice.\nWhile his attack on representationalism gained Rorty notoriety as a\nmetaphilosophical nihilist, the legacy that is now taking shape tends\nrather to highlight Rorty’s fundamental and enduring concern\nwith the connection between philosophical thinking and the pursuit of\nhuman happiness, thus making a place for Rorty’s voice in a\nconversation that springs from the founding impulses of Western\nphilosophy.\n",
    "section_title": "4.3 Analytic Philosophy",
    "entry_title": "Richard Rorty",
    "hierarchy_title": "Richard Rorty || Rorty in the Conversations of Philosophy || Claim to Pragmatism",
    "tokenized_text": [
        "rorty",
        "conversation",
        "philosophy",
        "claim",
        "pragmatism",
        "analytic",
        "philosophy",
        "rorty",
        "sometimes",
        "portrayed",
        "renegade",
        "someone",
        "went",
        "transformation",
        "bona",
        "fide",
        "analytical",
        "philosopher",
        "something",
        "else",
        "lived",
        "tell",
        "tale",
        "liberation",
        "youthful",
        "enchantment",
        "portrayal",
        "however",
        "distorts",
        "rorty",
        "view",
        "analytical",
        "philosophy",
        "trajectory",
        "thinking",
        "indeed",
        "rorty",
        "relationship",
        "tradition",
        "western",
        "philosophy",
        "nuanced",
        "reputation",
        "might",
        "suggest",
        "relation",
        "analytical",
        "philosophy",
        "particular",
        "though",
        "introduction",
        "volume",
        "linguistic",
        "turn",
        "rorty",
        "early",
        "paper",
        "philosophy",
        "mind",
        "s",
        "show",
        "rorty",
        "adopting",
        "framework",
        "philosophical",
        "problem",
        "later",
        "dispenses",
        "writing",
        "time",
        "clearly",
        "bear",
        "mark",
        "fundamental",
        "metaphilosophical",
        "attitude",
        "becomes",
        "increasingly",
        "explicit",
        "next",
        "decade",
        "see",
        "stephen",
        "leach",
        "james",
        "tartaglia",
        "introduction",
        "mlm",
        "preface",
        "pmn",
        "referring",
        "hartshorne",
        "mckeon",
        "carnap",
        "robert",
        "brumbaugh",
        "carl",
        "hempel",
        "paul",
        "wei",
        "rorty",
        "say",
        "fortunate",
        "men",
        "teacher",
        "better",
        "worse",
        "treated",
        "saying",
        "thing",
        "philosophical",
        "problem",
        "product",
        "unconscious",
        "adoption",
        "set",
        "assumption",
        "built",
        "vocabulary",
        "problem",
        "stated",
        "assumption",
        "questioned",
        "problem",
        "taken",
        "seriously",
        "pmn",
        "xiii",
        "way",
        "stating",
        "lesson",
        "however",
        "appears",
        "leave",
        "open",
        "possibility",
        "certain",
        "philosophical",
        "problem",
        "eventually",
        "may",
        "legitimately",
        "taken",
        "seriously",
        "face",
        "value",
        "sense",
        "require",
        "constructive",
        "solution",
        "provided",
        "assumption",
        "sustain",
        "formulation",
        "stand",
        "proper",
        "critical",
        "scrutiny",
        "taken",
        "way",
        "attitude",
        "rorty",
        "express",
        "would",
        "le",
        "philosopher",
        "diagnosed",
        "predecessor",
        "work",
        "mixture",
        "pseudoquestions",
        "genuine",
        "problem",
        "dimly",
        "glimpsed",
        "problem",
        "proper",
        "frame",
        "questioning",
        "fully",
        "clarified",
        "may",
        "productively",
        "addressed",
        "full",
        "force",
        "lesson",
        "rorty",
        "learned",
        "emerges",
        "view",
        "notion",
        "proper",
        "critical",
        "scrutiny",
        "questionable",
        "rorty",
        "legitimate",
        "assumption",
        "philosophical",
        "problem",
        "based",
        "would",
        "establish",
        "term",
        "require",
        "pose",
        "problem",
        "really",
        "mandatory",
        "vocabulary",
        "encounter",
        "problem",
        "principle",
        "inescapable",
        "rorty",
        "construal",
        "linguistic",
        "turn",
        "well",
        "proposal",
        "eliminating",
        "vocabulary",
        "mental",
        "really",
        "odds",
        "idea",
        "might",
        "hope",
        "construct",
        "definitive",
        "vocabulary",
        "philosophy",
        "even",
        "early",
        "day",
        "rorty",
        "approach",
        "philosophy",
        "shaped",
        "historicist",
        "conviction",
        "vocabulary",
        "inescapable",
        "principle",
        "mean",
        "progress",
        "philosophy",
        "gained",
        "le",
        "constructive",
        "solution",
        "problem",
        "therapeutic",
        "dissolution",
        "cause",
        "invention",
        "new",
        "vocabulary",
        "achieved",
        "launch",
        "new",
        "fruitful",
        "metaphor",
        "introduction",
        "pmn",
        "unfamiliar",
        "noise",
        "hesse",
        "davidson",
        "metaphor",
        "ort",
        "hold",
        "vocabulary",
        "final",
        "also",
        "hold",
        "vocabulary",
        "free",
        "unthematized",
        "yet",
        "optional",
        "assumption",
        "hence",
        "effort",
        "circumvent",
        "philosophical",
        "problem",
        "making",
        "assumption",
        "visible",
        "subject",
        "circumvention",
        "accordingly",
        "fact",
        "rorty",
        "often",
        "distance",
        "term",
        "earlier",
        "framed",
        "argument",
        "made",
        "diagnosis",
        "reason",
        "impose",
        "done",
        "temporal",
        "dichotomy",
        "may",
        "rorty",
        "early",
        "work",
        "inspired",
        "le",
        "critical",
        "le",
        "dialectical",
        "reading",
        "quine",
        "sellars",
        "offered",
        "pmn",
        "constructive",
        "therapeutic",
        "tone",
        "jargon",
        "therefore",
        "rorty",
        "later",
        "perspective",
        "important",
        "sense",
        "misguided",
        "however",
        "tie",
        "together",
        "rorty",
        "work",
        "time",
        "across",
        "theme",
        "complete",
        "lack",
        "faith",
        "idea",
        "ideal",
        "vocabulary",
        "one",
        "contains",
        "genuine",
        "discursive",
        "option",
        "rorty",
        "designates",
        "faith",
        "platonism",
        "important",
        "theme",
        "ci",
        "inescapable",
        "form",
        "description",
        "thought",
        "permeates",
        "rorty",
        "work",
        "s",
        "later",
        "therapeutic",
        "articulation",
        "pragmatism",
        "right",
        "characterization",
        "philosophy",
        "cultural",
        "politics",
        "pcp",
        "characterization",
        "pragmatism",
        "term",
        "antifoundationalism",
        "pmn",
        "antirepresentationalism",
        "ort",
        "antiessentialism",
        "tp",
        "explicitly",
        "parasitic",
        "constructive",
        "effort",
        "epistemology",
        "metaphysics",
        "intended",
        "highlight",
        "various",
        "way",
        "effort",
        "remain",
        "spell",
        "platonic",
        "faith",
        "ideal",
        "concept",
        "mandatory",
        "form",
        "description",
        "rorty",
        "use",
        "quine",
        "sellars",
        "make",
        "fundamental",
        "point",
        "idea",
        "philosophy",
        "knowledge",
        "legitimation",
        "project",
        "well",
        "articulation",
        "critique",
        "term",
        "typically",
        "analytical",
        "philosophical",
        "problem",
        "contributed",
        "impression",
        "pmn",
        "internal",
        "indictment",
        "analytic",
        "philosophy",
        "many",
        "gleeful",
        "chagrined",
        "read",
        "pmn",
        "purported",
        "demonstration",
        "bankruptcy",
        "one",
        "two",
        "contemporary",
        "main",
        "stream",
        "western",
        "philosophy",
        "reader",
        "draw",
        "support",
        "view",
        "also",
        "fact",
        "much",
        "rorty",
        "writing",
        "since",
        "pmn",
        "concerned",
        "show",
        "virtue",
        "thinker",
        "like",
        "heidegger",
        "derrida",
        "eho",
        "forty",
        "year",
        "later",
        "however",
        "seems",
        "unwise",
        "superimpose",
        "analyticcontinental",
        "divide",
        "onto",
        "message",
        "pmn",
        "onto",
        "rorty",
        "pmn",
        "central",
        "point",
        "philosophy",
        "need",
        "break",
        "free",
        "metaphor",
        "mind",
        "medium",
        "appearance",
        "appearance",
        "philosophy",
        "must",
        "help",
        "u",
        "sort",
        "mere",
        "realitycorresponding",
        "one",
        "rorty",
        "made",
        "point",
        "vocabulary",
        "developed",
        "angloamerican",
        "whether",
        "birth",
        "naturalization",
        "late",
        "adoption",
        "philosopher",
        "course",
        "preceding",
        "halfcentury",
        "necessary",
        "probably",
        "misleading",
        "see",
        "rorty",
        "criticism",
        "epistemology",
        "assumption",
        "make",
        "appear",
        "worthwhile",
        "criticism",
        "particular",
        "philosophical",
        "style",
        "philosophy",
        "set",
        "methodological",
        "habit",
        "reading",
        "pmn",
        "conjunction",
        "essay",
        "cp",
        "see",
        "particularly",
        "essay",
        "professionalized",
        "philosophy",
        "transcendentalist",
        "culture",
        "essay",
        "philosophy",
        "america",
        "today",
        "also",
        "introduction",
        "one",
        "quickly",
        "see",
        "target",
        "pmn",
        "putative",
        "school",
        "branch",
        "subject",
        "called",
        "analytic",
        "philosophy",
        "rorty",
        "think",
        "philosophy",
        "essence",
        "defining",
        "historical",
        "task",
        "fails",
        "mark",
        "special",
        "domain",
        "knowledge",
        "short",
        "natural",
        "kind",
        "cp",
        "leaf",
        "ground",
        "level",
        "sort",
        "critique",
        "intention",
        "around",
        "time",
        "publication",
        "pmn",
        "rorty",
        "view",
        "matter",
        "analytic",
        "philosophy",
        "stylistic",
        "sociological",
        "unity",
        "cp",
        "qualifies",
        "point",
        "follows",
        "saying",
        "suggesting",
        "analytic",
        "philosophy",
        "bad",
        "thing",
        "bad",
        "shape",
        "analytic",
        "style",
        "think",
        "good",
        "style",
        "esprit",
        "de",
        "corp",
        "among",
        "analytic",
        "philosopher",
        "healthy",
        "useful",
        "cp",
        "however",
        "rorty",
        "apparently",
        "bear",
        "prejudice",
        "analytic",
        "philosophy",
        "particular",
        "reason",
        "tolerance",
        "antiessentialist",
        "historicist",
        "view",
        "philosophy",
        "problem",
        "many",
        "critic",
        "point",
        "objection",
        "faint",
        "praise",
        "rorty",
        "go",
        "saying",
        "analytic",
        "philosophy",
        "become",
        "whether",
        "like",
        "sort",
        "discipline",
        "find",
        "humanity",
        "department",
        "department",
        "pretension",
        "rigor",
        "scientific",
        "status",
        "le",
        "evident",
        "normal",
        "form",
        "life",
        "humanity",
        "art",
        "belleslettres",
        "genius",
        "something",
        "new",
        "interesting",
        "persuasive",
        "admirer",
        "begin",
        "form",
        "school",
        "movement",
        "cp",
        "perfectly",
        "consonant",
        "attitude",
        "notion",
        "philosophical",
        "method",
        "rorty",
        "express",
        "year",
        "later",
        "socalled",
        "method",
        "simply",
        "description",
        "activity",
        "engaged",
        "enthusiastic",
        "imitator",
        "one",
        "another",
        "original",
        "mind",
        "kuhn",
        "would",
        "call",
        "research",
        "program",
        "work",
        "gave",
        "rise",
        "tp",
        "rorty",
        "metaphilosophical",
        "critique",
        "directed",
        "particular",
        "technique",
        "style",
        "vocabulary",
        "toward",
        "idea",
        "philosophical",
        "problem",
        "anything",
        "transient",
        "tension",
        "dynamic",
        "evolving",
        "contingent",
        "vocabulary",
        "critique",
        "bite",
        "specifically",
        "analytic",
        "philosophy",
        "may",
        "lingering",
        "faith",
        "philosophical",
        "problem",
        "lasting",
        "intellectual",
        "challenge",
        "honest",
        "thinker",
        "acknowledge",
        "may",
        "met",
        "making",
        "progress",
        "methodology",
        "rorty",
        "however",
        "nowhere",
        "say",
        "faith",
        "part",
        "essence",
        "analytical",
        "philosophy",
        "contrary",
        "clear",
        "pioneering",
        "analytical",
        "philosopher",
        "people",
        "like",
        "sellars",
        "quine",
        "davidson",
        "provided",
        "rorty",
        "indispensable",
        "critical",
        "tool",
        "attack",
        "epistemological",
        "legitimationproject",
        "central",
        "concern",
        "philosophy",
        "since",
        "descartes",
        "shorn",
        "ambition",
        "make",
        "progress",
        "perpetual",
        "problem",
        "philosophy",
        "analytic",
        "tradition",
        "remains",
        "dynamic",
        "enterprise",
        "rorty",
        "work",
        "demonstrates",
        "true",
        "rorty",
        "professor",
        "humanity",
        "university",
        "virginia",
        "found",
        "larger",
        "intellectual",
        "audience",
        "outside",
        "philosophy",
        "department",
        "increasingly",
        "turned",
        "literary",
        "theory",
        "political",
        "thought",
        "however",
        "drawing",
        "source",
        "outside",
        "analytic",
        "tradition",
        "also",
        "outside",
        "field",
        "philosophy",
        "rorty",
        "never",
        "ceased",
        "engage",
        "analytic",
        "philosophy",
        "retained",
        "significant",
        "audience",
        "among",
        "anglophone",
        "philosopher",
        "critical",
        "resurgence",
        "metaphysics",
        "brought",
        "seminal",
        "work",
        "saul",
        "kripke",
        "slow",
        "persistent",
        "resurgence",
        "rearticulation",
        "pragmatic",
        "naturalism",
        "beginning",
        "s",
        "gaining",
        "force",
        "turn",
        "millennium",
        "provided",
        "new",
        "perspective",
        "rorty",
        "dialectical",
        "role",
        "metaphilosophical",
        "critique",
        "year",
        "since",
        "rorty",
        "death",
        "publication",
        "monograph",
        "anthology",
        "dedicated",
        "thought",
        "suggests",
        "interest",
        "rorty",
        "contribution",
        "rise",
        "world",
        "anglophone",
        "philosophy",
        "tone",
        "critical",
        "appraisal",
        "generally",
        "different",
        "frequently",
        "harsh",
        "response",
        "slayer",
        "representationalist",
        "epistemology",
        "appeared",
        "s",
        "perception",
        "rorty",
        "critique",
        "clearly",
        "softened",
        "recent",
        "commentator",
        "appear",
        "le",
        "concerned",
        "defend",
        "epistemological",
        "enterprise",
        "interested",
        "coming",
        "term",
        "rorty",
        "critique",
        "understand",
        "historical",
        "perspective",
        "moreover",
        "rorty",
        "work",
        "increasingly",
        "addressed",
        "contribution",
        "political",
        "thought",
        "attention",
        "shifting",
        "away",
        "metaepistemology",
        "rorty",
        "vision",
        "defense",
        "liberalism",
        "distinctive",
        "conception",
        "social",
        "progress",
        "assessment",
        "prospect",
        "reform",
        "toward",
        "greater",
        "social",
        "justice",
        "attack",
        "representationalism",
        "gained",
        "rorty",
        "notoriety",
        "metaphilosophical",
        "nihilist",
        "legacy",
        "taking",
        "shape",
        "tends",
        "rather",
        "highlight",
        "rorty",
        "fundamental",
        "enduring",
        "concern",
        "connection",
        "philosophical",
        "thinking",
        "pursuit",
        "human",
        "happiness",
        "thus",
        "making",
        "place",
        "rorty",
        "voice",
        "conversation",
        "spring",
        "founding",
        "impulse",
        "western",
        "philosophy"
    ]
}