{
    "main_text": "Life\n1. Life\n\nJean-Jacques Rousseau was born in the independent Calvinist city-state\nof Geneva in 1712, the son of Isaac Rousseau, a watchmaker, and\nSuzanne Bernard. Rousseau’s mother died nine days after his\nbirth, so Rousseau was raised and educated by his father until the age\nof ten. Isaac Rousseau was one of the small minority of Geneva’s\nresidents who enjoyed the rank of citizen of Geneva, and was therefore\na member of the city’s nominally sovereign assembly.\nJean-Jacques was to inherit this status. According to his own\nsubsequent accounts, the haphazard education that he received from his\nfather included both the inculcation of republican patriotism and the\nreading of historians of ancient republicanism, such as Plutarch.\nAfter his father fled this city to avoid arrest, Jean-Jacques was put\nin the care of a pastor at nearby Bossey and subsequently apprenticed\nto an engraver. Rousseau left Geneva at the age of sixteen and came\nunder the influence of a Roman Catholic convert noblewoman,\nFrançoise-Louise de la Tour, Baronne de Warens. Mme de Warens\narranged for Rousseau to travel to Turin, where he converted to Roman\nCatholicism in April 1728. He spent some time working as a domestic\nservant in a noble household in Turin, and during this time a shameful\nepisode occurred in which he falsely accused a fellow servant of the\ntheft of a ribbon. This act marked him deeply and he returns to it in\nhis autobiographical works.\n\nRousseau then spent a brief period training to become a Catholic\npriest before embarking on another brief career as an itinerant\nmusician, music copyist and teacher. In 1731 he returned to Mme de\nWarens at Chambéry and later briefly became her lover and then\nher household manager. He remained with Mme de Warens through the rest\nof the 1730s, moving to Lyon in 1740 to take up a position as a tutor.\nThis appointment brought him within the orbit of both Condillac and\nd’Alembert and was his first contact with major figures of the\nFrench Enlightenment. In 1742 he travelled to Paris, having devised a\nplan for a new numerically-based system of musical notation which he\npresented to the Academy of Sciences. The system was rejected by the\nAcademy, but in this period Rousseau met Denis Diderot. A brief spell\nas secretary to the French Ambassador in Venice followed before\nRousseau moved to Paris on a more permanent basis from 1744, where he\ncontinued to work mainly on music and began to write contributions to\nthe Encyclopédie of Diderot and d’Alembert.\n\nIn 1745 Rousseau met Thérèse Levasseur, a barely\nliterate laundry-maid who became his lover and, later, his wife.\nAccording to Rousseau’s own account, Thérèse bore\nhim five children, all of whom were deposited at the foundling\nhospital shortly after birth, an almost certain sentence of death in\neighteenth-century France. Rousseau’s abandonment of his\nchildren was later to be used against him by Voltaire.\n\nIn 1749, while walking to Vincennes to visit the briefly-imprisoned\nDiderot and idly reading a newspaper, Rousseau came across the\nannouncement of an essay competition organized by the Academy of\nDijon. The Academy sought submissions on the theme of whether the\ndevelopment of the arts and sciences had improved or corrupted public\nmorals. Rousseau later claimed that he then and there experienced an\nepiphany which included the thought, central to his world view, that\nhumankind is good by nature but is corrupted by society. He entered\nhis Discourse on the Sciences and Arts (conventionally known\nas the First Discourse) for the competition and won first\nprize with his contrarian thesis that social development, including of\nthe arts and sciences, is corrosive of both civic virtue and\nindividual moral character. The Discourse was published in\n1751 and is mainly important because Rousseau used it to introduce\nthemes that he developed further in later work, especially the natural\nvirtue of the ordinary person and the moral corruption fostered by the\nurge to distinction and excellence. The First Discourse made\nRousseau famous and provoked a series of responses to which he in turn\nreplied.\n\nMusic remained Rousseau’s primary interest in this period, and\nthe years 1752 and 1753 saw his most important contributions to the\nfield. The first of these was his opera Le Devin du Village\n(The Village Soothsayer), which was an immediate success (and\nstayed in the repertoire for a century). The second was his\nparticipation in a controversy known as the “querelle des\nbouffons”, that followed the performance in Paris of\nPergolesi’s La Serva Padrona by a visiting Italian\ncompany and which pitted the partisans of Italian music against those\nof the French style. Rousseau, who had already developed a taste for\nItalian music during his stay in Venice, joined the dispute through\nhis Letter on French Music and the controversy also informed\nhis (unpublished) Essay on the Origin of Languages.\nRousseau’s emphasis on the importance of melody and the\ncommunication of emotion as central to the function of music was in\nopposition to the views of Rameau, who stressed harmony and the\nrelationships between music, mathematics, and physics. Rousseau went\nso far as to declare the French language inherently unmusical, a view\napparently contradicted by his own practice in Le Devin.\n\nRousseau’s conversion to Catholicism had rendered him ineligible\nfor his hereditary status as a citizen of Geneva. In 1754 he regained\nthis citizenship by reconverting to Calvinism. In the following year\nhe published his Discourse on the Origin and Foundations of\nInequality among Men (often referred to simply as the\nDiscourse on Inequality or as the Second Discourse).\nOnce again this was in response to an essay competition from the\nAcademy of Dijon. Though he did not win the Academy’s prize a\nsecond time, the Discourse on Inequality is a far more\naccomplished work, and in it Rousseau begins to develop his theories\nof human social development and moral psychology. With the\nDiscourse on Inequality, the distance between Rousseau and\nthe Encyclopédiste mainstream of the French\nEnlightenment thought became clear. This rift was cemented with his\n1758 publication of the Letter to d’Alembert on the\nTheater, in which he denounced the idea that his native city\nwould benefit from the construction of a theater. In Rousseau’s\nview theater, far from improving the population, tends to weaken their\nattachment to the life of the political community.\n\nThe years following the publication of the Discourse on\nInequality were the most productive and important of\nRousseau’s career. He withdrew from Paris and, under the\npatronage of, first Mme d’Epinay and then the Duke and Duchess\nof Luxembourg, worked on a novel, Julie, ou La Nouvelle\nHéloïse, and then on Emile and The\nSocial Contract. Julie appeared in 1761 and was an\nimmediate success. The novel is centred on a love triangle between\nJulie, her tutor Saint Preux and her husband Wolmar. The work is cast\nin epistolary form, and is an important supplementary source for the\ninterpretation of Rousseau’s social philosophy, containing, as\nit does, such elements as a vision of rural community and the presence\nof a manipulative genius who achieves the appearance of natural\nharmony through cunning artifice, and who thus anticipates both the\ntutor in Emile and the legislator of The Social\nContract. Both works appeared in 1762, marking the high point of\nRousseau’s intellectual achievement.\n\nUnfortunately for Rousseau, the publication of these works also led to\npersonal catastrophe. Emile was condemned in Paris and both\nEmile and The Social Contract were condemned in\nGeneva on grounds of their religious heterodoxy, a condemnation that\nRousseau responded to in his Letters from the Mountains\nPartly in response to the hostile attitude of the Genevan authorities,\nRousseau renounced his citizenship in May 1763. He was forced to flee\nto escape arrest, seeking refuge first in Switzerland and then\ntravelling to England at the invitation of David Hume in January\n1766.\n\nRousseau’s stay in England was marked by his increasing mental\ninstability and he became wrongly convinced that Hume was at the\ncenter of a plot against him. He spent fourteen months in\nStaffordshire where he worked on his autobiographical\nConfessions, which also contain evidence of his paranoia in\nits treatment of figures like Diderot and the German author Friedrich\nMelchior, Baron von Grimm. He returned to France in 1767 and then\nspent much of the rest of his life working on autobiographical texts,\ncompleting the Confessions but also composing the\nDialogues: Rousseau Judge of Jean-Jacques and The\nReveries of the Solitary Walker. He also completed his\nConsiderations on the Government of Poland in this period. In\nlater life he further developed his interest in botany (where his work\nproved influential in England via his letters on the subject to the\nDuchess of Portland) and in music, as he met and corresponded with the\noperatic composer Christoph Gluck. Rousseau died in 1778. In 1794 the\nFrench revolutionaries transferred his remains to the Panthéon\nin Paris.\n",
    "section_title": "1. Life",
    "entry_title": "Jean Jacques Rousseau",
    "hierarchy_title": "Jean Jacques Rousseau || Life",
    "tokenized_text": [
        "life",
        "life",
        "jeanjacques",
        "rousseau",
        "born",
        "independent",
        "calvinist",
        "citystate",
        "geneva",
        "son",
        "isaac",
        "rousseau",
        "watchmaker",
        "suzanne",
        "bernard",
        "rousseau",
        "mother",
        "died",
        "nine",
        "day",
        "birth",
        "rousseau",
        "raised",
        "educated",
        "father",
        "age",
        "ten",
        "isaac",
        "rousseau",
        "one",
        "small",
        "minority",
        "geneva",
        "resident",
        "enjoyed",
        "rank",
        "citizen",
        "geneva",
        "therefore",
        "member",
        "city",
        "nominally",
        "sovereign",
        "assembly",
        "jeanjacques",
        "inherit",
        "status",
        "according",
        "subsequent",
        "account",
        "haphazard",
        "education",
        "received",
        "father",
        "included",
        "inculcation",
        "republican",
        "patriotism",
        "reading",
        "historian",
        "ancient",
        "republicanism",
        "plutarch",
        "father",
        "fled",
        "city",
        "avoid",
        "arrest",
        "jeanjacques",
        "put",
        "care",
        "pastor",
        "nearby",
        "bossey",
        "subsequently",
        "apprenticed",
        "engraver",
        "rousseau",
        "left",
        "geneva",
        "age",
        "sixteen",
        "came",
        "influence",
        "roman",
        "catholic",
        "convert",
        "noblewoman",
        "françoiselouise",
        "de",
        "la",
        "tour",
        "baronne",
        "de",
        "warens",
        "mme",
        "de",
        "warens",
        "arranged",
        "rousseau",
        "travel",
        "turin",
        "converted",
        "roman",
        "catholicism",
        "april",
        "spent",
        "time",
        "working",
        "domestic",
        "servant",
        "noble",
        "household",
        "turin",
        "time",
        "shameful",
        "episode",
        "occurred",
        "falsely",
        "accused",
        "fellow",
        "servant",
        "theft",
        "ribbon",
        "act",
        "marked",
        "deeply",
        "return",
        "autobiographical",
        "work",
        "rousseau",
        "spent",
        "brief",
        "period",
        "training",
        "become",
        "catholic",
        "priest",
        "embarking",
        "another",
        "brief",
        "career",
        "itinerant",
        "musician",
        "music",
        "copyist",
        "teacher",
        "returned",
        "mme",
        "de",
        "warens",
        "chambéry",
        "later",
        "briefly",
        "became",
        "lover",
        "household",
        "manager",
        "remained",
        "mme",
        "de",
        "warens",
        "rest",
        "s",
        "moving",
        "lyon",
        "take",
        "position",
        "tutor",
        "appointment",
        "brought",
        "within",
        "orbit",
        "condillac",
        "alembert",
        "first",
        "contact",
        "major",
        "figure",
        "french",
        "enlightenment",
        "travelled",
        "paris",
        "devised",
        "plan",
        "new",
        "numericallybased",
        "system",
        "musical",
        "notation",
        "presented",
        "academy",
        "science",
        "system",
        "rejected",
        "academy",
        "period",
        "rousseau",
        "met",
        "denis",
        "diderot",
        "brief",
        "spell",
        "secretary",
        "french",
        "ambassador",
        "venice",
        "followed",
        "rousseau",
        "moved",
        "paris",
        "permanent",
        "basis",
        "continued",
        "work",
        "mainly",
        "music",
        "began",
        "write",
        "contribution",
        "encyclopédie",
        "diderot",
        "alembert",
        "rousseau",
        "met",
        "thérèse",
        "levasseur",
        "barely",
        "literate",
        "laundrymaid",
        "became",
        "lover",
        "later",
        "wife",
        "according",
        "rousseau",
        "account",
        "thérèse",
        "bore",
        "five",
        "child",
        "deposited",
        "foundling",
        "hospital",
        "shortly",
        "birth",
        "almost",
        "certain",
        "sentence",
        "death",
        "eighteenthcentury",
        "france",
        "rousseau",
        "abandonment",
        "child",
        "later",
        "used",
        "voltaire",
        "walking",
        "vincennes",
        "visit",
        "brieflyimprisoned",
        "diderot",
        "idly",
        "reading",
        "newspaper",
        "rousseau",
        "came",
        "across",
        "announcement",
        "essay",
        "competition",
        "organized",
        "academy",
        "dijon",
        "academy",
        "sought",
        "submission",
        "theme",
        "whether",
        "development",
        "art",
        "science",
        "improved",
        "corrupted",
        "public",
        "moral",
        "rousseau",
        "later",
        "claimed",
        "experienced",
        "epiphany",
        "included",
        "thought",
        "central",
        "world",
        "view",
        "humankind",
        "good",
        "nature",
        "corrupted",
        "society",
        "entered",
        "discourse",
        "science",
        "art",
        "conventionally",
        "known",
        "first",
        "discourse",
        "competition",
        "first",
        "prize",
        "contrarian",
        "thesis",
        "social",
        "development",
        "including",
        "art",
        "science",
        "corrosive",
        "civic",
        "virtue",
        "individual",
        "moral",
        "character",
        "discourse",
        "published",
        "mainly",
        "important",
        "rousseau",
        "used",
        "introduce",
        "theme",
        "developed",
        "later",
        "work",
        "especially",
        "natural",
        "virtue",
        "ordinary",
        "person",
        "moral",
        "corruption",
        "fostered",
        "urge",
        "distinction",
        "excellence",
        "first",
        "discourse",
        "made",
        "rousseau",
        "famous",
        "provoked",
        "series",
        "response",
        "turn",
        "replied",
        "music",
        "remained",
        "rousseau",
        "primary",
        "interest",
        "period",
        "year",
        "saw",
        "important",
        "contribution",
        "field",
        "first",
        "opera",
        "le",
        "devin",
        "du",
        "village",
        "village",
        "soothsayer",
        "immediate",
        "success",
        "stayed",
        "repertoire",
        "century",
        "second",
        "participation",
        "controversy",
        "known",
        "querelle",
        "de",
        "bouffons",
        "followed",
        "performance",
        "paris",
        "pergolesi",
        "la",
        "serva",
        "padrona",
        "visiting",
        "italian",
        "company",
        "pitted",
        "partisan",
        "italian",
        "music",
        "french",
        "style",
        "rousseau",
        "already",
        "developed",
        "taste",
        "italian",
        "music",
        "stay",
        "venice",
        "joined",
        "dispute",
        "letter",
        "french",
        "music",
        "controversy",
        "also",
        "informed",
        "unpublished",
        "essay",
        "origin",
        "language",
        "rousseau",
        "emphasis",
        "importance",
        "melody",
        "communication",
        "emotion",
        "central",
        "function",
        "music",
        "opposition",
        "view",
        "rameau",
        "stressed",
        "harmony",
        "relationship",
        "music",
        "mathematics",
        "physic",
        "rousseau",
        "went",
        "far",
        "declare",
        "french",
        "language",
        "inherently",
        "unmusical",
        "view",
        "apparently",
        "contradicted",
        "practice",
        "le",
        "devin",
        "rousseau",
        "conversion",
        "catholicism",
        "rendered",
        "ineligible",
        "hereditary",
        "status",
        "citizen",
        "geneva",
        "regained",
        "citizenship",
        "reconverting",
        "calvinism",
        "following",
        "year",
        "published",
        "discourse",
        "origin",
        "foundation",
        "inequality",
        "among",
        "men",
        "often",
        "referred",
        "simply",
        "discourse",
        "inequality",
        "second",
        "discourse",
        "response",
        "essay",
        "competition",
        "academy",
        "dijon",
        "though",
        "win",
        "academy",
        "prize",
        "second",
        "time",
        "discourse",
        "inequality",
        "far",
        "accomplished",
        "work",
        "rousseau",
        "begin",
        "develop",
        "theory",
        "human",
        "social",
        "development",
        "moral",
        "psychology",
        "discourse",
        "inequality",
        "distance",
        "rousseau",
        "encyclopédiste",
        "mainstream",
        "french",
        "enlightenment",
        "thought",
        "became",
        "clear",
        "rift",
        "cemented",
        "publication",
        "letter",
        "alembert",
        "theater",
        "denounced",
        "idea",
        "native",
        "city",
        "would",
        "benefit",
        "construction",
        "theater",
        "rousseau",
        "view",
        "theater",
        "far",
        "improving",
        "population",
        "tends",
        "weaken",
        "attachment",
        "life",
        "political",
        "community",
        "year",
        "following",
        "publication",
        "discourse",
        "inequality",
        "productive",
        "important",
        "rousseau",
        "career",
        "withdrew",
        "paris",
        "patronage",
        "first",
        "mme",
        "epinay",
        "duke",
        "duchess",
        "luxembourg",
        "worked",
        "novel",
        "julie",
        "ou",
        "la",
        "nouvelle",
        "héloïse",
        "emile",
        "social",
        "contract",
        "julie",
        "appeared",
        "immediate",
        "success",
        "novel",
        "centred",
        "love",
        "triangle",
        "julie",
        "tutor",
        "saint",
        "preux",
        "husband",
        "wolmar",
        "work",
        "cast",
        "epistolary",
        "form",
        "important",
        "supplementary",
        "source",
        "interpretation",
        "rousseau",
        "social",
        "philosophy",
        "containing",
        "element",
        "vision",
        "rural",
        "community",
        "presence",
        "manipulative",
        "genius",
        "achieves",
        "appearance",
        "natural",
        "harmony",
        "cunning",
        "artifice",
        "thus",
        "anticipates",
        "tutor",
        "emile",
        "legislator",
        "social",
        "contract",
        "work",
        "appeared",
        "marking",
        "high",
        "point",
        "rousseau",
        "intellectual",
        "achievement",
        "unfortunately",
        "rousseau",
        "publication",
        "work",
        "also",
        "led",
        "personal",
        "catastrophe",
        "emile",
        "condemned",
        "paris",
        "emile",
        "social",
        "contract",
        "condemned",
        "geneva",
        "ground",
        "religious",
        "heterodoxy",
        "condemnation",
        "rousseau",
        "responded",
        "letter",
        "mountain",
        "partly",
        "response",
        "hostile",
        "attitude",
        "genevan",
        "authority",
        "rousseau",
        "renounced",
        "citizenship",
        "may",
        "forced",
        "flee",
        "escape",
        "arrest",
        "seeking",
        "refuge",
        "first",
        "switzerland",
        "travelling",
        "england",
        "invitation",
        "david",
        "hume",
        "january",
        "rousseau",
        "stay",
        "england",
        "marked",
        "increasing",
        "mental",
        "instability",
        "became",
        "wrongly",
        "convinced",
        "hume",
        "center",
        "plot",
        "spent",
        "fourteen",
        "month",
        "staffordshire",
        "worked",
        "autobiographical",
        "confession",
        "also",
        "contain",
        "evidence",
        "paranoia",
        "treatment",
        "figure",
        "like",
        "diderot",
        "german",
        "author",
        "friedrich",
        "melchior",
        "baron",
        "von",
        "grimm",
        "returned",
        "france",
        "spent",
        "much",
        "rest",
        "life",
        "working",
        "autobiographical",
        "text",
        "completing",
        "confession",
        "also",
        "composing",
        "dialogue",
        "rousseau",
        "judge",
        "jeanjacques",
        "revery",
        "solitary",
        "walker",
        "also",
        "completed",
        "consideration",
        "government",
        "poland",
        "period",
        "later",
        "life",
        "developed",
        "interest",
        "botany",
        "work",
        "proved",
        "influential",
        "england",
        "via",
        "letter",
        "subject",
        "duchess",
        "portland",
        "music",
        "met",
        "corresponded",
        "operatic",
        "composer",
        "christoph",
        "gluck",
        "rousseau",
        "died",
        "french",
        "revolutionary",
        "transferred",
        "remains",
        "panthéon",
        "paris"
    ]
}