{
    "main_text": "Philosophy || Metaphysics and Epistemology: Idealism and Interpretation\n2.1 Metaphysics and Epistemology: Idealism and Interpretation\n\nRoyce announced the beginning of his professional career with a novel\ndefense of absolute idealism, “the argument from error.”\nKant had introduced the notion of a “transcendental\nargument” by asking what the world must be like in order for\nknowledge of the world to be possible. In The Religious Aspect of\nPhilosophy Royce took the experience of error — a\nparticularly compelling aspect of the phenomenon of knowing — as\nthe starting point for his own transcendental argument. According to\nthe correspondence theory of knowledge an idea (or judgment) is true\nif it correctly represents its object; error obtains when an idea does\nnot correctly represent its object. It is indisputable that finite\nminds do sometimes entertain erroneous ideas. Royce pointed out that\nin such a case the mind must contain an (erroneous) idea and its\n(false) object, while simultaneously intending, or “pointing\ntoward,” the idea’s true object. If the mind is able to\nintend the true object then that object is somehow available to the\nmind. How can it be that the true object is in this way available to\nthe mind, but not known? Consider what happens in an ordinary example\nof error: if I think that my keys are on the table, but later discover\nthat they are in my pocket, I do not conclude that my keys never\nexisted as the object of my thought. Rather, I focus on an idea that I\nhad all along — that my keys do definitely exist somewhere. The\nkeys, their location, and all other facts about them are the true\nobject of an idea. At the moment when I discover that my keys are not\non the table, it becomes apparent that this true object was only\nimperfectly available to me. The fact that such error does occur\nindicated to Royce that the true object of any idea must exist, in a\nfully determinate or absolute state, in some actual mind, or mind-like\nentity, with which my own mind is or may be connected. From the\npossibility of error, Royce concluded that there is an Absolute\nKnower, a mind for which all thoughts do correspond correctly and\nadequately to their true objects.\n\nOne objection to the argument from error is that another type of\nobjective reality, some other sort of being external to one’s\nfinite mind, might explain the possibility of error just as well.\nRoyce took up this objection in the first volume of The World and\nthe Individual, which was subtitled “The Four Historical\nConceptions of Being.” In this extended argument Royce critiqued\nwhat he regarded as the main competing conceptions of objective\nreality so as to strengthen his case for idealism. The first\nconception of being Royce considered was realism, the view\nthat the world exists entirely independently of our thoughts or ideas\nabout it. The world is what it is, in short, without any reference to\nour thoughts. While this view has great common-sense appeal and does\nprovide for an objectively existing sphere of being against which our\nideas can apparently be measured, Royce pointed out a fundamental\nproblem. Realism, so defined, introduces a radical metaphysical\ndualism. Between my ideas, and a sphere of being that by definition\nexists completely independent of those ideas, there is a gap that\ncannot be bridged. Realism posits an objective realm that is utterly\nindependent and hence, strictly speaking, is utterly meaningless to\nthought. The theory of mysticism, the second conception of\nbeing Royce considered, likewise meets with problems. This view\nmaintains that the real is the ineffable immediate fact that is\npresent to the mind. Mysticism avoids the problem of an unbridgeable\ngap between idea and reality by completely denying any such gap. The\ndifficulty here is that one cannot then distinguish between idea and\nreality. If reality is in the end the immediate content of my idea,\nthen error in my idea of reality would simply appear to be impossible.\nThe third conception of being, which Royce identified with Kantian\ncritical rationalism, is presented as a correct but\nincomplete view. Royce characterized critical rationalism as the view\nthat “What is, gives warrant to ideas, makes them true, and\nenables us to define determinate, or valid, possible\nexperiences” (Royce 1899–1901 [1976, 266]). The real is\nthat which, in conforming to given universal structures or categories\nof experience, is capable of validating certain ideas. The connection\nbetween my ideas and an objectively existing sphere of being is\nclearly established: my ideas and that sphere both conform to the same\ncategories of experience. The independence of objective reality, and\nhence the possibility of error, is likewise preserved: I may form an\nidea of a definite possible experience (e.g., that my keys are on the\ntable) but then discover that reality does not validate my idea (I can\nin fact check the table surface and discover that my keys are not\nthere). The critical rationalist conception is inadequate, in\nRoyce’s view, because it is restricted to describing the\nuniversal forms and possibilities of experienced reality. It cannot in\nRoyce’s view account for the concrete, actual individual facts\nthat impose themselves in experience. These are simply and\nmysteriously “given” in the critical rationalist\ntheory.\n\nRoyce endeavored to extend and complete critical rationalism in his\nexplanation of the “fourth conception of being.”\nTo say that an idea intends its object means more than that the idea\nmay be validated by a “possible experience.” An idea in\nthis respect embodies a purpose: that its meaning shall be fulfilled\nin experience. In Royce’s view this requires a world that is\nmore than the abstract or merely hypothetical content posited by the\ndescription of a possible experience. What is needed is a definite,\nactual individual being that exists “in an absolutely final\nform.” Royce thus agreed with critical rationalism in saying\nthat a true idea is one that may be fulfilled or validated by a\npossible experience. He argues further, though, that such a possible\nexperience requires the existence of an actual being (e.g., the\nparticular set of keys in my pocket) that is in principle capable of\nbeing experienced. It is this being, the actual individual, and not\nthe mere possible experience of it, that is the object of knowledge\nand “the essential nature of Being” (Royce\n1899–1901, [1976, 348]). The “fourth conception of\nbeing” detailed in The World and the Individual\nprovides the metaphysical background for the remainder of\nRoyce’s thought. It presents a view of the totality of Being as\nan actual Infinite Individual that is itself timeless, encompassing as\nit does all valid past, present, and future possible experience of\nfact. All finite beings, such as ourselves, are but fragments of this\nAbsolute Mind or eternal truth.\n\nIn his last period Royce embraced what may be called a hermeneutic\nepistemology. While he still maintained the central notion that a true\nidea correctly represents its object, he arrived at a new\nunderstanding of the nature of representation. Earlier, he had rather\nuncritically taken “representation” to be a\nstraightforward correspondence relation in which the idea merely\ncopied its object. Under the influence of Peirce’s theory of\nsigns, however, Royce came to appreciate the creative, synthetic, and\nselective aspects of representation. The new semiotic conception is\ndetailed in the chapter of The Problem of Christianity\nentitled “Perception, Conception and Interpretation.”\nKnowledge is not at bottom merely the accurate and complete perception\nof an object, as empiricism would have it. Nor is it the accurate and\ncomplete conception of an idea, as rationalism maintains. Knowledge is\ninstead a process of interpretation: the true idea selects,\nemphasizes, and re-presents those aspects of the object that will be\nmeaningfully fulfilled in subsequent experience. Royce’s\n“absolute pragmatism,” like other versions of pragmatism,\nthus offers an alternative to rationalism and empiricism.\n\nThis revised understanding of knowledge as interpretation prompted, if\nit did not exactly require, a corresponding change in Royce’s\nnotion of the Infinite Mind whose reality was established in the\nargument from error. As long as knowledge is regarded as possessing\nperceptions or conceptions that correspond to objects, the Infinite\nMind is naturally envisioned as something that “contains”\nthe totality of all perceptions or conceptions. If knowledge is\ninstead regarded as a process of interpretation, though, the Infinite\nMind may be regarded as the mind that carries this process forward.\nRoyce had long sought an explicitly non-Hegelian account of Absolute\nMind. In The Problem of Christianity he was finally able to\nreplace the old terminology of the Absolute with a description of an\ninfinite Community of Interpretation. This community is the totality\nof all those minds capable of representing aspects of Being to one\nanother or to their future selves. Royce summarized the metaphysical\nimplications of this new view by saying “the real world is the\nCommunity of Interpretation… If the interpretation is a\nreality, and if it truly interprets the whole of reality, then the\ncommunity reaches its goal [i.e., a complete representation of Being],\nand the real world includes its own interpreter” (Royce 1913\n[2001, 339]). In this late period Royce remained firmly committed to\nidealism. He renounced the notion that the Absolute is complete at any\nactual time, though, and instead preferred to think of the possible\ntotality of all truth simply as the eternal.\n",
    "section_title": "2.1 Metaphysics and Epistemology: Idealism and Interpretation",
    "entry_title": "Josiah Royce",
    "hierarchy_title": "Josiah Royce || Philosophy || Metaphysics and Epistemology: Idealism and Interpretation",
    "tokenized_text": [
        "philosophy",
        "metaphysics",
        "epistemology",
        "idealism",
        "interpretation",
        "metaphysics",
        "epistemology",
        "idealism",
        "interpretation",
        "royce",
        "announced",
        "beginning",
        "professional",
        "career",
        "novel",
        "defense",
        "absolute",
        "idealism",
        "argument",
        "error",
        "kant",
        "introduced",
        "notion",
        "transcendental",
        "argument",
        "asking",
        "world",
        "must",
        "like",
        "order",
        "knowledge",
        "world",
        "possible",
        "religious",
        "aspect",
        "philosophy",
        "royce",
        "took",
        "experience",
        "error",
        "particularly",
        "compelling",
        "aspect",
        "phenomenon",
        "knowing",
        "starting",
        "point",
        "transcendental",
        "argument",
        "according",
        "correspondence",
        "theory",
        "knowledge",
        "idea",
        "judgment",
        "true",
        "correctly",
        "represents",
        "object",
        "error",
        "obtains",
        "idea",
        "correctly",
        "represent",
        "object",
        "indisputable",
        "finite",
        "mind",
        "sometimes",
        "entertain",
        "erroneous",
        "idea",
        "royce",
        "pointed",
        "case",
        "mind",
        "must",
        "contain",
        "erroneous",
        "idea",
        "false",
        "object",
        "simultaneously",
        "intending",
        "pointing",
        "toward",
        "idea",
        "true",
        "object",
        "mind",
        "able",
        "intend",
        "true",
        "object",
        "object",
        "somehow",
        "available",
        "mind",
        "true",
        "object",
        "way",
        "available",
        "mind",
        "known",
        "consider",
        "happens",
        "ordinary",
        "example",
        "error",
        "think",
        "key",
        "table",
        "later",
        "discover",
        "pocket",
        "conclude",
        "key",
        "never",
        "existed",
        "object",
        "thought",
        "rather",
        "focus",
        "idea",
        "along",
        "key",
        "definitely",
        "exist",
        "somewhere",
        "key",
        "location",
        "fact",
        "true",
        "object",
        "idea",
        "moment",
        "discover",
        "key",
        "table",
        "becomes",
        "apparent",
        "true",
        "object",
        "imperfectly",
        "available",
        "fact",
        "error",
        "occur",
        "indicated",
        "royce",
        "true",
        "object",
        "idea",
        "must",
        "exist",
        "fully",
        "determinate",
        "absolute",
        "state",
        "actual",
        "mind",
        "mindlike",
        "entity",
        "mind",
        "may",
        "connected",
        "possibility",
        "error",
        "royce",
        "concluded",
        "absolute",
        "knower",
        "mind",
        "thought",
        "correspond",
        "correctly",
        "adequately",
        "true",
        "object",
        "one",
        "objection",
        "argument",
        "error",
        "another",
        "type",
        "objective",
        "reality",
        "sort",
        "external",
        "one",
        "finite",
        "mind",
        "might",
        "explain",
        "possibility",
        "error",
        "well",
        "royce",
        "took",
        "objection",
        "first",
        "volume",
        "world",
        "individual",
        "subtitled",
        "four",
        "historical",
        "conception",
        "being",
        "extended",
        "argument",
        "royce",
        "critiqued",
        "regarded",
        "main",
        "competing",
        "conception",
        "objective",
        "reality",
        "strengthen",
        "case",
        "idealism",
        "first",
        "conception",
        "royce",
        "considered",
        "realism",
        "view",
        "world",
        "exists",
        "entirely",
        "independently",
        "thought",
        "idea",
        "world",
        "short",
        "without",
        "reference",
        "thought",
        "view",
        "great",
        "commonsense",
        "appeal",
        "provide",
        "objectively",
        "existing",
        "sphere",
        "idea",
        "apparently",
        "measured",
        "royce",
        "pointed",
        "fundamental",
        "problem",
        "realism",
        "defined",
        "introduces",
        "radical",
        "metaphysical",
        "dualism",
        "idea",
        "sphere",
        "definition",
        "exists",
        "completely",
        "independent",
        "idea",
        "gap",
        "bridged",
        "realism",
        "posit",
        "objective",
        "realm",
        "utterly",
        "independent",
        "hence",
        "strictly",
        "speaking",
        "utterly",
        "meaningless",
        "thought",
        "theory",
        "mysticism",
        "second",
        "conception",
        "royce",
        "considered",
        "likewise",
        "meet",
        "problem",
        "view",
        "maintains",
        "real",
        "ineffable",
        "immediate",
        "fact",
        "present",
        "mind",
        "mysticism",
        "avoids",
        "problem",
        "unbridgeable",
        "gap",
        "idea",
        "reality",
        "completely",
        "denying",
        "gap",
        "difficulty",
        "one",
        "distinguish",
        "idea",
        "reality",
        "reality",
        "end",
        "immediate",
        "content",
        "idea",
        "error",
        "idea",
        "reality",
        "would",
        "simply",
        "appear",
        "impossible",
        "third",
        "conception",
        "royce",
        "identified",
        "kantian",
        "critical",
        "rationalism",
        "presented",
        "correct",
        "incomplete",
        "view",
        "royce",
        "characterized",
        "critical",
        "rationalism",
        "view",
        "give",
        "warrant",
        "idea",
        "make",
        "true",
        "enables",
        "u",
        "define",
        "determinate",
        "valid",
        "possible",
        "experience",
        "royce",
        "real",
        "conforming",
        "given",
        "universal",
        "structure",
        "category",
        "experience",
        "capable",
        "validating",
        "certain",
        "idea",
        "connection",
        "idea",
        "objectively",
        "existing",
        "sphere",
        "clearly",
        "established",
        "idea",
        "sphere",
        "conform",
        "category",
        "experience",
        "independence",
        "objective",
        "reality",
        "hence",
        "possibility",
        "error",
        "likewise",
        "preserved",
        "may",
        "form",
        "idea",
        "definite",
        "possible",
        "experience",
        "eg",
        "key",
        "table",
        "discover",
        "reality",
        "validate",
        "idea",
        "fact",
        "check",
        "table",
        "surface",
        "discover",
        "key",
        "critical",
        "rationalist",
        "conception",
        "inadequate",
        "royce",
        "view",
        "restricted",
        "describing",
        "universal",
        "form",
        "possibility",
        "experienced",
        "reality",
        "royce",
        "view",
        "account",
        "concrete",
        "actual",
        "individual",
        "fact",
        "impose",
        "experience",
        "simply",
        "mysteriously",
        "given",
        "critical",
        "rationalist",
        "theory",
        "royce",
        "endeavored",
        "extend",
        "complete",
        "critical",
        "rationalism",
        "explanation",
        "fourth",
        "conception",
        "being",
        "say",
        "idea",
        "intends",
        "object",
        "mean",
        "idea",
        "may",
        "validated",
        "possible",
        "experience",
        "idea",
        "respect",
        "embodies",
        "purpose",
        "meaning",
        "shall",
        "fulfilled",
        "experience",
        "royce",
        "view",
        "requires",
        "world",
        "abstract",
        "merely",
        "hypothetical",
        "content",
        "posited",
        "description",
        "possible",
        "experience",
        "needed",
        "definite",
        "actual",
        "individual",
        "exists",
        "absolutely",
        "final",
        "form",
        "royce",
        "thus",
        "agreed",
        "critical",
        "rationalism",
        "saying",
        "true",
        "idea",
        "one",
        "may",
        "fulfilled",
        "validated",
        "possible",
        "experience",
        "argues",
        "though",
        "possible",
        "experience",
        "requires",
        "existence",
        "actual",
        "eg",
        "particular",
        "set",
        "key",
        "pocket",
        "principle",
        "capable",
        "experienced",
        "actual",
        "individual",
        "mere",
        "possible",
        "experience",
        "object",
        "knowledge",
        "essential",
        "nature",
        "royce",
        "fourth",
        "conception",
        "detailed",
        "world",
        "individual",
        "provides",
        "metaphysical",
        "background",
        "remainder",
        "royce",
        "thought",
        "present",
        "view",
        "totality",
        "actual",
        "infinite",
        "individual",
        "timeless",
        "encompassing",
        "valid",
        "past",
        "present",
        "future",
        "possible",
        "experience",
        "fact",
        "finite",
        "being",
        "fragment",
        "absolute",
        "mind",
        "eternal",
        "truth",
        "last",
        "period",
        "royce",
        "embraced",
        "may",
        "called",
        "hermeneutic",
        "epistemology",
        "still",
        "maintained",
        "central",
        "notion",
        "true",
        "idea",
        "correctly",
        "represents",
        "object",
        "arrived",
        "new",
        "understanding",
        "nature",
        "representation",
        "earlier",
        "rather",
        "uncritically",
        "taken",
        "representation",
        "straightforward",
        "correspondence",
        "relation",
        "idea",
        "merely",
        "copied",
        "object",
        "influence",
        "peirce",
        "theory",
        "sign",
        "however",
        "royce",
        "came",
        "appreciate",
        "creative",
        "synthetic",
        "selective",
        "aspect",
        "representation",
        "new",
        "semiotic",
        "conception",
        "detailed",
        "chapter",
        "problem",
        "christianity",
        "entitled",
        "perception",
        "conception",
        "interpretation",
        "knowledge",
        "bottom",
        "merely",
        "accurate",
        "complete",
        "perception",
        "object",
        "empiricism",
        "would",
        "accurate",
        "complete",
        "conception",
        "idea",
        "rationalism",
        "maintains",
        "knowledge",
        "instead",
        "process",
        "interpretation",
        "true",
        "idea",
        "selects",
        "emphasizes",
        "represents",
        "aspect",
        "object",
        "meaningfully",
        "fulfilled",
        "subsequent",
        "experience",
        "royce",
        "absolute",
        "pragmatism",
        "like",
        "version",
        "pragmatism",
        "thus",
        "offer",
        "alternative",
        "rationalism",
        "empiricism",
        "revised",
        "understanding",
        "knowledge",
        "interpretation",
        "prompted",
        "exactly",
        "require",
        "corresponding",
        "change",
        "royce",
        "notion",
        "infinite",
        "mind",
        "whose",
        "reality",
        "established",
        "argument",
        "error",
        "long",
        "knowledge",
        "regarded",
        "possessing",
        "perception",
        "conception",
        "correspond",
        "object",
        "infinite",
        "mind",
        "naturally",
        "envisioned",
        "something",
        "contains",
        "totality",
        "perception",
        "conception",
        "knowledge",
        "instead",
        "regarded",
        "process",
        "interpretation",
        "though",
        "infinite",
        "mind",
        "may",
        "regarded",
        "mind",
        "carry",
        "process",
        "forward",
        "royce",
        "long",
        "sought",
        "explicitly",
        "nonhegelian",
        "account",
        "absolute",
        "mind",
        "problem",
        "christianity",
        "finally",
        "able",
        "replace",
        "old",
        "terminology",
        "absolute",
        "description",
        "infinite",
        "community",
        "interpretation",
        "community",
        "totality",
        "mind",
        "capable",
        "representing",
        "aspect",
        "one",
        "another",
        "future",
        "self",
        "royce",
        "summarized",
        "metaphysical",
        "implication",
        "new",
        "view",
        "saying",
        "real",
        "world",
        "community",
        "interpretation",
        "interpretation",
        "reality",
        "truly",
        "interprets",
        "whole",
        "reality",
        "community",
        "reach",
        "goal",
        "ie",
        "complete",
        "representation",
        "real",
        "world",
        "includes",
        "interpreter",
        "royce",
        "late",
        "period",
        "royce",
        "remained",
        "firmly",
        "committed",
        "idealism",
        "renounced",
        "notion",
        "absolute",
        "complete",
        "actual",
        "time",
        "though",
        "instead",
        "preferred",
        "think",
        "possible",
        "totality",
        "truth",
        "simply",
        "eternal"
    ]
}