{
    "main_text": "Russell’s Chronology\n1. Russell’s Chronology\n\nA short chronology of the major events in Russell’s life is as\nfollows: \n\n(1872) Born May 18 at Ravenscroft in Trelleck, Monmouthshire,\nUK.\n(1874) Death of mother and sister.\n(1876) Death of father; Russell’s grandfather, Lord John\nRussell (the former Prime Minister), and grandmother succeed in\noverturning Russell’s father’s will to win custody of\nRussell and his brother, rather than have them raised as\nfree-thinkers.\n(1878) Death of grandfather; Russell’s grandmother, Lady\nRussell, supervises Russell’s upbringing at Pembroke Lodge,\nLondon.\n(1883) Receives his first lessons in geometry from his brother\nFrank.\n(1890) Enters Trinity College, Cambridge; meets\n Whitehead.\n(1893) Awarded first-class BA in Mathematics.\n(1894) Completes the Moral Sciences Tripos (Part II); appointed\nHonorary British Attaché in Paris; marries Alys Pearsall\nSmith.\n(1895) Studies at the University of Berlin.\n(1896) Appointed lecturer at the London School of Economics;\nlectures in the US at Johns Hopkins and Bryn Mawr.\n(1899) Appointed lecturer at Trinity College, Cambridge.\n(1900) Meets Peano at the First International Congress of\nPhilosophy in Paris.\n(1901) Reappointed lecturer at Cambridge; discovers\n Russell’s paradox.\n(1902) Corresponds with\n Frege.\n(1905) Develops his theory of\n descriptions.\n(1907) Runs for parliament and is defeated.\n(1908) Elected Fellow of the Royal Society.\n(1910) Fails to receive Liberal Party nomination for parliament\nbecause of his atheism; reappointed lecturer at Trinity College,\nCambridge.\n(1911) Meets\n Wittgenstein;\n elected President of the Aristotelian Society; separates from\nAlys.\n(1913) Lectures at the École des Hautes Sociales in\nParis.\n(1914) Visits Harvard and teaches courses in logic and the theory\nof knowledge; meets T.S. Eliot.\n(1915) Reappointed lecturer at Trinity College, Cambridge.\n(1916) Fined 100 pounds and dismissed from Trinity College as a\nresult of anti-war writings; denied a passport and so unable to\nlecture at Harvard.\n(1918) Imprisoned for five months as a result of anti-war\nwritings.\n(1920) Visits Russia.\n(1921) Divorce from Alys and marriage to Dora Black; visits China\nand Japan.\n(1922) Runs for parliament and is defeated.\n(1923) Runs for parliament and is defeated.\n(1924) Lectures in the US.\n(1927) Lectures in the US; opens experimental school in the UK\nwith Dora.\n(1929) Lectures in the US.\n(1931) Lectures in the US; becomes the third Earl Russell upon the\ndeath of his brother.\n(1935) Divorce from Dora.\n(1936) Marriage to Patricia (Peter) Helen Spence.\n(1938) Appointed visiting professor of philosophy at Chicago.\n(1939) Appointed professor of philosophy at the University of\nCalifornia at Los Angeles.\n(1940) Appointment at City College New York revoked prior to\nRussell’s arrival as the result of public protests and a legal\njudgment in which Russell was found to be “morally unfit”\nto teach at the college; delivers the William James Lectures at\nHarvard.\n(1941) Appointed lecturer at the Barnes Foundation in\nPennsylvania.\n(1942) Dismissed from Barnes Foundation, but wins a lawsuit\nagainst the Foundation for wrongful dismissal.\n(1944) Reappointed a Fellow of Trinity College.\n(1948) Involved in a plane crash en route to Norway, he and other\npassengers save themselves by swimming in the ocean until help\narrives.\n(1949) Awarded the Order of Merit; elected a Lifetime Fellow at\nTrinity College.\n(1950) Awarded Nobel Prize for Literature; visits Australia.\n(1951) Lectures in the US.\n(1952) Divorce from Patricia (Peter) and marriage to Edith\nFinch.\n(1955) Releases Russell-Einstein Manifesto.\n(1957) Elected President of the first Pugwash Conference.\n(1958) Becomes founding President of the Campaign for Nuclear\nDisarmament.\n(1961) Imprisoned for one week in connection with anti-nuclear\nprotests.\n(1963) Establishes the Bertrand Russell Peace Foundation.\n(1967) Launches the International War Crimes Tribunal.\n(1970) Dies February 02 at Penrhyndeudraeth, Wales.\n\n\nAttempts to sum up Russell’s life have been numerous. One of the\nmore famous comes from the Oxford philosopher\n A.J. Ayer.\n As Ayer writes, “The popular conception of a philosopher as one\nwho combines universal learning with the direction of human conduct\nwas more nearly satisfied by Bertrand Russell than by any other\nphilosopher of our time” (1972a, 127). Another telling comment\ncomes from the Harvard philosopher\n W.V. Quine:\n “I think many of us were drawn to our profession by\nRussell’s books. He wrote a spectrum of books for a graduated\npublic, layman to specialist. We were beguiled by the wit and a sense\nof new-found clarity with respect to central traits of reality”\n(1966c, 657). \n\nDespite such comments, perhaps the most memorable encapsulation of\nRussell’s life and work comes from Russell himself. As Russell\ntells us, \n\n\nThree passions, simple but overwhelmingly strong, have governed my\nlife: the longing for love, the search for knowledge, and unbearable\npity for the suffering of mankind. These passions, like great winds,\nhave blown me hither and thither, in a wayward course, over a great\nocean of anguish, reaching to the very verge of despair.\n\nI have sought love, first, because it brings ecstasy – ecstasy\nso great that I would often have sacrificed all the rest of life for a\nfew hours of this joy. I have sought it, next, because it relieves\nloneliness – that terrible loneliness in which one shivering\nconsciousness looks over the rim of the world into the cold\nunfathomable lifeless abyss. I have sought it finally, because in the\nunion of love I have seen, in a mystic miniature, the prefiguring\nvision of the heaven that saints and poets have imagined. This is what\nI sought, and though it might seem too good for human life, this is\nwhat – at last – I have found.\n\nWith equal passion I have sought knowledge. I have wished to\nunderstand the hearts of men. I have wished to know why the stars\nshine. And I have tried to apprehend the Pythagorean power by which\nnumber holds sway above the flux. A little of this, but not much, I\nhave achieved. \n\nLove and knowledge, so far as they were possible, led upward toward\nthe heavens. But always pity brought me back to earth. Echoes of cries\nof pain reverberate in my heart. Children in famine, victims tortured\nby oppressors, helpless old people a hated burden to their sons, and\nthe whole world of loneliness, poverty, and pain make a mockery of\nwhat human life should be. I long to alleviate this evil, but I\ncannot, and I too suffer.\n\nThis has been my life. I have found it worth living, and would gladly\nlive it again if the chance were offered me. (1967, 3–4)\n\n\nBy any standard, Russell led an enormously full life. In addition to\nhis ground-breaking intellectual work in logic and analytic\nphilosophy, he involved himself for much of his life in politics. As\nearly as 1904 he spoke out frequently in favour of internationalism\nand in 1907 he ran unsuccessfully for Parliament. Although he stood as\nan independent, he endorsed the full 1907 Liberal platform. He also\nadvocated extending the franchise to women, provided that such a\nradical political change could be introduced through constitutionally\nrecognized means (Wood 1957, 71). Three years later he published his\nAnti-Suffragist Anxieties (1910).\n\nWith the outbreak of World War I, Russell became involved in anti-war\nactivities and in 1916 he was fined 100 pounds for authoring an\nanti-war pamphlet. Because of his conviction, he was dismissed from\nhis post at Trinity College, Cambridge (Hardy 1942). Two years later,\nhe was convicted a second time, this time for suggesting that American\ntroops might be used to intimidate strikers in Britain (Clark 1975,\n337–339). The result was five months in Brixton Prison as\nprisoner No. 2917. In 1922 and 1923 Russell ran twice more for\nParliament, again unsuccessfully, and together with his second wife,\nDora, he founded an experimental school that they operated during the\nlate 1920s and early 1930s (Russell 1926 and Park 1963). Perhaps not\nsurprisingly, some of Russell’s more radical activities –\nincluding his advocacy of post-Victorian sexual practices – were\nlinked in many people’s minds to his atheism, made famous in\npart by his 1948 BBC debate with the Jesuit philosopher Frederick\nCopleston over the existence of God. \n\nAlthough Russell became the third Earl Russell upon the death of his\nbrother in 1931, Russell’s radicalism continued to make him a\ncontroversial figure well through middle-age. While teaching at UCLA\nin the United States in the late 1930s, he was offered a teaching\nappointment at City College, New York. The appointment was revoked\nfollowing a series of protests and a 1940 judicial decision which\nfound him morally unfit to teach at the College (Dewey and Kallen\n1941, Irvine 1996, Weidlich 2000). The legal decision had been based\npartly on Russell’s atheism and partly on his fame as an\nadvocate of free love and open marriages.\n\nIn 1954, Russell delivered his famous “Man’s Peril”\nbroadcast on the BBC, condemning the Bikini H-bomb tests. A year\nlater, together with Albert Einstein, he released the Russell-Einstein\nManifesto calling for the curtailment of nuclear weapons. In 1957, he\nbecame a prime organizer of the first Pugwash Conference, which\nbrought together a large number of scientists concerned about the\nnuclear issue. He became founding president of the Campaign for\nNuclear Disarmament in 1958 and Honorary President of the Committee of\n100 in 1960. \n\nIn 1961, Russell was once again imprisoned, this time for a week in\nconnection with anti-nuclear protests. The media coverage surrounding\nhis conviction only served to enhance Russell’s reputation and\nto further inspire the many idealistic youth who were sympathetic to\nhis anti-war and anti-nuclear message. Beginning in 1963, he began\nwork on a variety of additional issues, including lobbying on behalf\nof political prisoners under the auspices of the Bertrand Russell\nPeace Foundation.\n\nThroughout much of his life, Russell saw himself primarily as a writer\nrather than as a philosopher, listing “Author” as his\nprofession on his passport. As he says in his Autobiography,\n“I resolved not to adopt a profession, but to devote myself to\nwriting” (1967, 125). Upon being awarded the Nobel Prize for\nLiterature in 1950, Russell used his acceptance speech once again to emphasize \nthemes relating to his social activism. \n\nOver the years, Russell has served as the subject of numerous creative\nworks, including T.S. Eliot’s “Mr Apollinax” (1917),\nD.H. Lawrence’s “The Blind Man” (1920), Aldous\nHuxley’s Chrome Yellow (1921), Bruce Duffy’s\nThe World as I Found It (1987) and the graphic novel by\nApostolos Doxiadis and Christos Papadimitriou, Logicomix: An Epic\nSearch for Truth (2009).\n\nReaders wanting additional information about Russell’s life are\nencouraged to consult Russell’s five autobiographical volumes:\nPortraits from Memory and other Essays (A1956b), My\nPhilosophical Development (1959) and The Autobiography of\nBertrand Russell (3 volumes, 1967, 1968, 1969). In addition, John\nSlater’s accessible Bertrand Russell (1994) gives a\nshort but informative introduction to Russell’s life, work and\ninfluence. Other sources of biographical information include Ronald\nClark’s authoritative The Life of Bertrand Russell\n(1975), Ray Monk’s two volumes, Bertrand Russell: The Spirit\nof Solitude (1996) and Bertrand Russell: The Ghost of\nMadness (2000), and the first volume of Andrew Irvine’s\nBertrand Russell: Critical Assessments (1999).\n\nFor a chronology of Russell’s major publications, readers are\nencouraged to consult the\n Primary Literature\n section of the Bibliography below. For a complete, descriptive\nbibliography, see A Bibliography of Bertrand Russell (3\nvolumes, 1994), by Kenneth Blackwell and Harry Ruja. A less detailed\nlist appears in Paul Arthur Schilpp, The Philosophy of Bertrand\nRussell (1944). \n\nFor a detailed bibliography of the secondary literature surrounding\nRussell up to the close of the twentieth century, see Andrew Irvine,\nBertrand Russell: Critical Assessments, Volume 1 (1999). For\na list of new and forthcoming books relating to Russell, see the\n Forthcoming Books\n page at the Bertrand Russell Archives. \n",
    "section_title": "1. Russell’s Chronology",
    "entry_title": "Bertrand Russell",
    "hierarchy_title": "Bertrand Russell || Russell’s Chronology",
    "tokenized_text": [
        "russell",
        "chronology",
        "russell",
        "chronology",
        "short",
        "chronology",
        "major",
        "event",
        "russell",
        "life",
        "follows",
        "born",
        "may",
        "ravenscroft",
        "trelleck",
        "monmouthshire",
        "uk",
        "death",
        "mother",
        "sister",
        "death",
        "father",
        "russell",
        "grandfather",
        "lord",
        "john",
        "russell",
        "former",
        "prime",
        "minister",
        "grandmother",
        "succeed",
        "overturning",
        "russell",
        "father",
        "win",
        "custody",
        "russell",
        "brother",
        "rather",
        "raised",
        "freethinkers",
        "death",
        "grandfather",
        "russell",
        "grandmother",
        "lady",
        "russell",
        "supervises",
        "russell",
        "upbringing",
        "pembroke",
        "lodge",
        "london",
        "receives",
        "first",
        "lesson",
        "geometry",
        "brother",
        "frank",
        "enters",
        "trinity",
        "college",
        "cambridge",
        "meet",
        "whitehead",
        "awarded",
        "firstclass",
        "ba",
        "mathematics",
        "completes",
        "moral",
        "science",
        "tripos",
        "part",
        "ii",
        "appointed",
        "honorary",
        "british",
        "attaché",
        "paris",
        "marries",
        "alys",
        "pearsall",
        "smith",
        "study",
        "university",
        "berlin",
        "appointed",
        "lecturer",
        "london",
        "school",
        "economics",
        "lecture",
        "u",
        "john",
        "hopkins",
        "bryn",
        "mawr",
        "appointed",
        "lecturer",
        "trinity",
        "college",
        "cambridge",
        "meet",
        "peano",
        "first",
        "international",
        "congress",
        "philosophy",
        "paris",
        "reappointed",
        "lecturer",
        "cambridge",
        "discovers",
        "russell",
        "paradox",
        "corresponds",
        "frege",
        "develops",
        "theory",
        "description",
        "run",
        "parliament",
        "defeated",
        "elected",
        "fellow",
        "royal",
        "society",
        "fails",
        "receive",
        "liberal",
        "party",
        "nomination",
        "parliament",
        "atheism",
        "reappointed",
        "lecturer",
        "trinity",
        "college",
        "cambridge",
        "meet",
        "wittgenstein",
        "elected",
        "president",
        "aristotelian",
        "society",
        "separate",
        "alys",
        "lecture",
        "école",
        "de",
        "hautes",
        "sociales",
        "paris",
        "visit",
        "harvard",
        "teach",
        "course",
        "logic",
        "theory",
        "knowledge",
        "meet",
        "ts",
        "eliot",
        "reappointed",
        "lecturer",
        "trinity",
        "college",
        "cambridge",
        "fined",
        "pound",
        "dismissed",
        "trinity",
        "college",
        "result",
        "antiwar",
        "writing",
        "denied",
        "passport",
        "unable",
        "lecture",
        "harvard",
        "imprisoned",
        "five",
        "month",
        "result",
        "antiwar",
        "writing",
        "visit",
        "russia",
        "divorce",
        "alys",
        "marriage",
        "dora",
        "black",
        "visit",
        "china",
        "japan",
        "run",
        "parliament",
        "defeated",
        "run",
        "parliament",
        "defeated",
        "lecture",
        "u",
        "lecture",
        "u",
        "open",
        "experimental",
        "school",
        "uk",
        "dora",
        "lecture",
        "u",
        "lecture",
        "u",
        "becomes",
        "third",
        "earl",
        "russell",
        "upon",
        "death",
        "brother",
        "divorce",
        "dora",
        "marriage",
        "patricia",
        "peter",
        "helen",
        "spence",
        "appointed",
        "visiting",
        "professor",
        "philosophy",
        "chicago",
        "appointed",
        "professor",
        "philosophy",
        "university",
        "california",
        "los",
        "angeles",
        "appointment",
        "city",
        "college",
        "new",
        "york",
        "revoked",
        "prior",
        "russell",
        "arrival",
        "result",
        "public",
        "protest",
        "legal",
        "judgment",
        "russell",
        "found",
        "morally",
        "unfit",
        "teach",
        "college",
        "delivers",
        "william",
        "james",
        "lecture",
        "harvard",
        "appointed",
        "lecturer",
        "barnes",
        "foundation",
        "pennsylvania",
        "dismissed",
        "barnes",
        "foundation",
        "win",
        "lawsuit",
        "foundation",
        "wrongful",
        "dismissal",
        "reappointed",
        "fellow",
        "trinity",
        "college",
        "involved",
        "plane",
        "crash",
        "en",
        "route",
        "norway",
        "passenger",
        "save",
        "swimming",
        "ocean",
        "help",
        "arrives",
        "awarded",
        "order",
        "merit",
        "elected",
        "lifetime",
        "fellow",
        "trinity",
        "college",
        "awarded",
        "nobel",
        "prize",
        "literature",
        "visit",
        "australia",
        "lecture",
        "u",
        "divorce",
        "patricia",
        "peter",
        "marriage",
        "edith",
        "finch",
        "release",
        "russelleinstein",
        "manifesto",
        "elected",
        "president",
        "first",
        "pugwash",
        "conference",
        "becomes",
        "founding",
        "president",
        "campaign",
        "nuclear",
        "disarmament",
        "imprisoned",
        "one",
        "week",
        "connection",
        "antinuclear",
        "protest",
        "establishes",
        "bertrand",
        "russell",
        "peace",
        "foundation",
        "launch",
        "international",
        "war",
        "crime",
        "tribunal",
        "dy",
        "february",
        "penrhyndeudraeth",
        "wale",
        "attempt",
        "sum",
        "russell",
        "life",
        "numerous",
        "one",
        "famous",
        "come",
        "oxford",
        "philosopher",
        "aj",
        "ayer",
        "ayer",
        "writes",
        "popular",
        "conception",
        "philosopher",
        "one",
        "combine",
        "universal",
        "learning",
        "direction",
        "human",
        "conduct",
        "nearly",
        "satisfied",
        "bertrand",
        "russell",
        "philosopher",
        "time",
        "a",
        "another",
        "telling",
        "comment",
        "come",
        "harvard",
        "philosopher",
        "wv",
        "quine",
        "think",
        "many",
        "u",
        "drawn",
        "profession",
        "russell",
        "book",
        "wrote",
        "spectrum",
        "book",
        "graduated",
        "public",
        "layman",
        "specialist",
        "beguiled",
        "wit",
        "sense",
        "newfound",
        "clarity",
        "respect",
        "central",
        "trait",
        "reality",
        "c",
        "despite",
        "comment",
        "perhaps",
        "memorable",
        "encapsulation",
        "russell",
        "life",
        "work",
        "come",
        "russell",
        "russell",
        "tell",
        "u",
        "three",
        "passion",
        "simple",
        "overwhelmingly",
        "strong",
        "governed",
        "life",
        "longing",
        "love",
        "search",
        "knowledge",
        "unbearable",
        "pity",
        "suffering",
        "mankind",
        "passion",
        "like",
        "great",
        "wind",
        "blown",
        "hither",
        "thither",
        "wayward",
        "course",
        "great",
        "ocean",
        "anguish",
        "reaching",
        "verge",
        "despair",
        "sought",
        "love",
        "first",
        "brings",
        "ecstasy",
        "ecstasy",
        "great",
        "would",
        "often",
        "sacrificed",
        "rest",
        "life",
        "hour",
        "joy",
        "sought",
        "next",
        "relief",
        "loneliness",
        "terrible",
        "loneliness",
        "one",
        "shivering",
        "consciousness",
        "look",
        "rim",
        "world",
        "cold",
        "unfathomable",
        "lifeless",
        "abyss",
        "sought",
        "finally",
        "union",
        "love",
        "seen",
        "mystic",
        "miniature",
        "prefiguring",
        "vision",
        "heaven",
        "saint",
        "poet",
        "imagined",
        "sought",
        "though",
        "might",
        "seem",
        "good",
        "human",
        "life",
        "last",
        "found",
        "equal",
        "passion",
        "sought",
        "knowledge",
        "wished",
        "understand",
        "heart",
        "men",
        "wished",
        "know",
        "star",
        "shine",
        "tried",
        "apprehend",
        "pythagorean",
        "power",
        "number",
        "hold",
        "sway",
        "flux",
        "little",
        "much",
        "achieved",
        "love",
        "knowledge",
        "far",
        "possible",
        "led",
        "upward",
        "toward",
        "heaven",
        "always",
        "pity",
        "brought",
        "back",
        "earth",
        "echo",
        "cry",
        "pain",
        "reverberate",
        "heart",
        "child",
        "famine",
        "victim",
        "tortured",
        "oppressor",
        "helpless",
        "old",
        "people",
        "hated",
        "burden",
        "son",
        "whole",
        "world",
        "loneliness",
        "poverty",
        "pain",
        "make",
        "mockery",
        "human",
        "life",
        "long",
        "alleviate",
        "evil",
        "suffer",
        "life",
        "found",
        "worth",
        "living",
        "would",
        "gladly",
        "live",
        "chance",
        "offered",
        "standard",
        "russell",
        "led",
        "enormously",
        "full",
        "life",
        "addition",
        "groundbreaking",
        "intellectual",
        "work",
        "logic",
        "analytic",
        "philosophy",
        "involved",
        "much",
        "life",
        "politics",
        "early",
        "spoke",
        "frequently",
        "favour",
        "internationalism",
        "ran",
        "unsuccessfully",
        "parliament",
        "although",
        "stood",
        "independent",
        "endorsed",
        "full",
        "liberal",
        "platform",
        "also",
        "advocated",
        "extending",
        "franchise",
        "woman",
        "provided",
        "radical",
        "political",
        "change",
        "could",
        "introduced",
        "constitutionally",
        "recognized",
        "mean",
        "wood",
        "three",
        "year",
        "later",
        "published",
        "antisuffragist",
        "anxiety",
        "outbreak",
        "world",
        "war",
        "russell",
        "became",
        "involved",
        "antiwar",
        "activity",
        "fined",
        "pound",
        "authoring",
        "antiwar",
        "pamphlet",
        "conviction",
        "dismissed",
        "post",
        "trinity",
        "college",
        "cambridge",
        "hardy",
        "two",
        "year",
        "later",
        "convicted",
        "second",
        "time",
        "time",
        "suggesting",
        "american",
        "troop",
        "might",
        "used",
        "intimidate",
        "striker",
        "britain",
        "clark",
        "result",
        "five",
        "month",
        "brixton",
        "prison",
        "prisoner",
        "russell",
        "ran",
        "twice",
        "parliament",
        "unsuccessfully",
        "together",
        "second",
        "wife",
        "dora",
        "founded",
        "experimental",
        "school",
        "operated",
        "late",
        "s",
        "early",
        "s",
        "russell",
        "park",
        "perhaps",
        "surprisingly",
        "russell",
        "radical",
        "activity",
        "including",
        "advocacy",
        "postvictorian",
        "sexual",
        "practice",
        "linked",
        "many",
        "people",
        "mind",
        "atheism",
        "made",
        "famous",
        "part",
        "bbc",
        "debate",
        "jesuit",
        "philosopher",
        "frederick",
        "copleston",
        "existence",
        "god",
        "although",
        "russell",
        "became",
        "third",
        "earl",
        "russell",
        "upon",
        "death",
        "brother",
        "russell",
        "radicalism",
        "continued",
        "make",
        "controversial",
        "figure",
        "well",
        "middleage",
        "teaching",
        "ucla",
        "united",
        "state",
        "late",
        "s",
        "offered",
        "teaching",
        "appointment",
        "city",
        "college",
        "new",
        "york",
        "appointment",
        "revoked",
        "following",
        "series",
        "protest",
        "judicial",
        "decision",
        "found",
        "morally",
        "unfit",
        "teach",
        "college",
        "dewey",
        "kallen",
        "irvine",
        "weidlich",
        "legal",
        "decision",
        "based",
        "partly",
        "russell",
        "atheism",
        "partly",
        "fame",
        "advocate",
        "free",
        "love",
        "open",
        "marriage",
        "russell",
        "delivered",
        "famous",
        "man",
        "peril",
        "broadcast",
        "bbc",
        "condemning",
        "bikini",
        "hbomb",
        "test",
        "year",
        "later",
        "together",
        "albert",
        "einstein",
        "released",
        "russelleinstein",
        "manifesto",
        "calling",
        "curtailment",
        "nuclear",
        "weapon",
        "became",
        "prime",
        "organizer",
        "first",
        "pugwash",
        "conference",
        "brought",
        "together",
        "large",
        "number",
        "scientist",
        "concerned",
        "nuclear",
        "issue",
        "became",
        "founding",
        "president",
        "campaign",
        "nuclear",
        "disarmament",
        "honorary",
        "president",
        "committee",
        "russell",
        "imprisoned",
        "time",
        "week",
        "connection",
        "antinuclear",
        "protest",
        "medium",
        "coverage",
        "surrounding",
        "conviction",
        "served",
        "enhance",
        "russell",
        "reputation",
        "inspire",
        "many",
        "idealistic",
        "youth",
        "sympathetic",
        "antiwar",
        "antinuclear",
        "message",
        "beginning",
        "began",
        "work",
        "variety",
        "additional",
        "issue",
        "including",
        "lobbying",
        "behalf",
        "political",
        "prisoner",
        "auspex",
        "bertrand",
        "russell",
        "peace",
        "foundation",
        "throughout",
        "much",
        "life",
        "russell",
        "saw",
        "primarily",
        "writer",
        "rather",
        "philosopher",
        "listing",
        "author",
        "profession",
        "passport",
        "say",
        "autobiography",
        "resolved",
        "adopt",
        "profession",
        "devote",
        "writing",
        "upon",
        "awarded",
        "nobel",
        "prize",
        "literature",
        "russell",
        "used",
        "acceptance",
        "speech",
        "emphasize",
        "theme",
        "relating",
        "social",
        "activism",
        "year",
        "russell",
        "served",
        "subject",
        "numerous",
        "creative",
        "work",
        "including",
        "ts",
        "eliot",
        "mr",
        "apollinax",
        "dh",
        "lawrence",
        "blind",
        "man",
        "aldous",
        "huxley",
        "chrome",
        "yellow",
        "bruce",
        "duffy",
        "world",
        "found",
        "graphic",
        "novel",
        "apostolos",
        "doxiadis",
        "christos",
        "papadimitriou",
        "logicomix",
        "epic",
        "search",
        "truth",
        "reader",
        "wanting",
        "additional",
        "information",
        "russell",
        "life",
        "encouraged",
        "consult",
        "russell",
        "five",
        "autobiographical",
        "volume",
        "portrait",
        "memory",
        "essay",
        "ab",
        "philosophical",
        "development",
        "autobiography",
        "bertrand",
        "russell",
        "volume",
        "addition",
        "john",
        "slater",
        "accessible",
        "bertrand",
        "russell",
        "give",
        "short",
        "informative",
        "introduction",
        "russell",
        "life",
        "work",
        "influence",
        "source",
        "biographical",
        "information",
        "include",
        "ronald",
        "clark",
        "authoritative",
        "life",
        "bertrand",
        "russell",
        "ray",
        "monk",
        "two",
        "volume",
        "bertrand",
        "russell",
        "spirit",
        "solitude",
        "bertrand",
        "russell",
        "ghost",
        "madness",
        "first",
        "volume",
        "andrew",
        "irvine",
        "bertrand",
        "russell",
        "critical",
        "assessment",
        "chronology",
        "russell",
        "major",
        "publication",
        "reader",
        "encouraged",
        "consult",
        "primary",
        "literature",
        "section",
        "bibliography",
        "complete",
        "descriptive",
        "bibliography",
        "see",
        "bibliography",
        "bertrand",
        "russell",
        "volume",
        "kenneth",
        "blackwell",
        "harry",
        "ruja",
        "le",
        "detailed",
        "list",
        "appears",
        "paul",
        "arthur",
        "schilpp",
        "philosophy",
        "bertrand",
        "russell",
        "detailed",
        "bibliography",
        "secondary",
        "literature",
        "surrounding",
        "russell",
        "close",
        "twentieth",
        "century",
        "see",
        "andrew",
        "irvine",
        "bertrand",
        "russell",
        "critical",
        "assessment",
        "volume",
        "list",
        "new",
        "forthcoming",
        "book",
        "relating",
        "russell",
        "see",
        "forthcoming",
        "book",
        "page",
        "bertrand",
        "russell",
        "archive"
    ]
}