{
    "main_text": "Preserving the True Path: Clarifying the Sage’s Intent\n4. Preserving the True Path: Clarifying the Sage’s Intent\n\nClarifying the Sage’s Intent (D. Jackson 2015) is a path text, of the\ngenre called Tenrim (bstan rim), “stages of the\ndoctrine”, which lays out in detail the practices and\naccomplishments for beings on the way from ordinary person to\nliberated Buddha. It is an elegant and comprehensive approach to the\npath of the bodhisattva, drawing from Indian sources—especially\nthe Mahāyānasūtrālaṃkāra and\nthe Abhidharmasamuccaya of Asaṅga. Sapaṇ makes\ncreative use of these sources in a variety of ways, and the work is a\ncomplex interplay of tradition and innovation. Yet for our purposes,\nthe most significant aspects of the work are not in his construction\nof the path or his characterizations of bodhisattva practice, but in a\nnumber of philosophical excurses. Unlike the Three Vows, the\nSage’s Intent is not primarily intended as a polemic\ntext; yet occasionally Sapaṇ feels it necessary to address\ncontroversial issues relevant to topics that arise in the course of\nhis descriptions of the bodhisattva path.\n\nAs before, it is not possible to work through all of\nSapaṇ’s significant arguments, so I will limit myself to a\ntopic that was among his most extensively debated positions, and which\nis an important theme in this work. The issue is the supposed\n“White Self-sufficient Remedy”, often translated\n“White Panacea”—a term used to describe the\nmeditation practice called “Great Seal” or\nMahāmudrā. Sapaṇ believes that this term for\nMahāmudrā represents a mistaken understanding of the\npractice, which transmutes a legitimate tantric practice into a\nmisleading and pernicious, fallacious\n doctrine.[19]\n\n\nIn order to understand why Sapaṇ finds the Self-sufficient\nRemedy doctrine particularly troubling, it will be useful to notice\nhow quintessentially it brings together so much that Sapaṇ\nconsiders wrong with Tibetan Buddhism of his day. Recall that\nSapaṇ’s distinctive philosophical view rests upon an\nunstinting categorical distinction between the conventional and\nultimate realities, and we have seen that this has important\nconsequences in his epistemology and his approach to the\ninterpretation of Buddhist ethics and the operation of karma. He often\ncriticizes an apparent knee-jerk decontextualization that others read\nout of the doctrine of emptiness. Sapaṇ reminds us, again and\nagain, that emptiness does not mean that nothing really\nmatters, or that everything goes. The view of emptiness does not wipe\naway the conventional. Ultimate reality not relativize all things\nto it. On the contrary, it requires that actions be deemed\nmeaningful or not, real or not, by virtue of their effectiveness and\nrelevance within specifiable contexts. This is Buddhist\ncontextualism.\n\nThe target of Sapaṇ’s attack, then, is the notion that,\nsimply by means of the direct apprehension of the nature of the mind\ncalled Mahāmudrā, one attains all of the accomplishments of\nthe path. This one attainment alone is a cure-all, a\n“self-sufficient remedy”. We can see immediately that this\nclaim for this practice challenges and undermines the importance of\nthe many doctrinal details, practices and contexts of the Buddhist\ntradition, paring it down to a single visionary experience. In\naddition, Sapaṇ considers this view a Tibetan invention, not\nattested in India, that resembles a famously rejected Chinese doctrine\nassociated with the monk Hvashang Mohoyen. The “White\nSelf-sufficient Remedy” is, he believes, an ignorant distortion\nof the dharma that leads to a nihilistic decline of the teachings.\nFurthermore, Sapaṇ considers the practice of Mahāmudrā\na tantric, not a general Mahāyāna practice, so he rejects\nthe non-tantric form of the teaching circulating in his day. There is\nreason to believe that this particular “mixing” of general\nGreat Vehicle and specific tantric practices in fact had an Indian\nprecedent, but Sapaṇ seems to have assumed that Indian adepts\nwould have prevented this as a mistake (see Mathes 2008).\n\nFrom a historical perspective, it is important to distinguish the\nconceptual implications of the Self-sufficient Remedy claim from its\nactual use. Not all adherents of the Self-sufficient Remedy view, most\nlikely followers of Gampopa, the founder of the Kagyu school of\nTibetan Buddhism, would have taught a practice that actually\ndispensed with all other rituals and meditations in favor of bare\nMahāmudrā practice. On the contrary, Gampopa’s famous\nfive-stage practice includes the cultivation of Mahāmudrā as\nthe fourth stage in a practice that also included: the generation of\nbodhicitta; deity visualization; guru devotion; and\ndedication of merit. Gampopa’s is not an instruction on\nabandoning all other aspects of the path. There were, apparently,\ndifferences of opinion even among the adherents of the Self-sufficient\nRemedy doctrine about whether this meant that Mahāmudrā on\nits own substituted for all other practices, or Mahāmudrā\nwas in some way ultimately, essentially, equivalent to all other\nattainments, as their culmination or their peak. If the latter were\nthe case, one might engage in many practices but from the ultimate\nperspective only reach attainment through Mahāmudrā. In the\nformer case—the proper target of Sapaṇ’s\ncritique—one should only even try to attain\nMahāmudrā. Some of Sapaṇ’s contemporaries\nunderstood the Remedy as Self-sufficient even to the point of saying\nthat the practitioner did not need to generate\nbodhicitta or dedicate the merit (D. Jackson 1990: 28).\n\nIn the Three Vows Sapaṇ provides a kind of abstract\ncriticism of the logic of calling a practice\n“self-sufficient” when it is part of a list of five. It is\nperhaps in response to this point that Padma Karpo, a defender of the\nKagyu, called Sapaṇ’s argument a “childish\ncriticism”, depicting it as merely a worry about the meanings of\nwords (D. Jackson 1990: 37). He says that if this is why it is faulty\nto say that Mahāmudrā is “singularly\nsufficient”, then it is also faulty to speak of the standard\ntantric practice as having the “two stages” of creation\nand completion—presumably, because those two stages also require\npreparatory bodhicitta generation and subsequent dedication.\nThis does seem to take down at least one, abstract and logical,\nreading of Sapaṇ’s argument. It portends to give credence\nto the (rather overblown) claim among Sapaṇ’s later\ncritics that he has read the Self-sufficient Remedy doctrine in bad\nfaith.\n\nBut Sapaṇ’s critique is not merely a matter of overly\nliteral numeric quibbles in the application of metaphors. In the\nThree Vows it is primarily a critique of the claim that a\nsingle practice can be causally effective, when in fact all\nattainments depend upon multiple causes. In the Sage’s\nIntent Sapaṇ is expansive and detailed in his rejection of\nmany, specific errors. He criticizes the practice’s\nadherents’ notion of resting in the mind as “original,\nunaltered and relaxed” (D. Jackson 2015: 492ff). If the mind\nwere simply enlightened in its “unaltered” state, he\nwrites, then the Buddha would never have needed to teach the dharma.\nSuch an ideal, he says, is similar to the non-Mahāyāna\ntraditions of Disciples and Solitary Buddhas, or even simple\nignorance. It cannot be a Mahāyāna path, he writes, if it\nfails to generate compassion and wisdom. He points out that study is\nnecessary to understand the proper target of a meditation on\nemptiness. If the Mahāmudrā is attempted without prior\ncultivation of merit and wisdom, he says, there is no way that simply\nsaying “I will meditatively cultivate\nnon-conceptualization” could be effective.\n\nThe point that links these various concerns is the overarching worry\nabout moral nihilism, which arises from the claim that all practices\ncan be reduced to one, combined with the unbridled confidence in\ncreative, doctrinal innovation. This allows the practitioner to forego\nthe long and difficult moral training of the bodhisattva in favor of\nan easy, but delusory, instantaneous quasi-attainment. For fear of\nprolixity, I will leave off from Sapaṇ’s argument, in\nwhich he employs his distinctive approach to the doctrine of emptiness\nand the two truths. Indeed, although Sapaṇ did not write any\nworks dedicated to the doctrine of emptiness, his view—that, in\nbrief, ultimate truth is beyond all conceptual elaboration—is an\nimportant contribution that deserves further study. Suffice it to say\nthat his view is tailor made to prevent both the conceptual\nreification of emptiness that he criticizes in the Treasury\nand the nihilism that he criticizes in the Sage’s\nIntent.\n\nPerhaps the most controversial aspect of Sapaṇ’s critique\nin the Sage’s Intent was his assimilation of the\nnon-tantric Mahāmudrā view to the doctrine of the famous\nChinese monk called Hvashang Mohoyen. Sapaṇ reiterates the story\ntold in the Testament of Ba (discovered among the textual\ntreasures at Dunhuang) that tells of how, during the imperial period,\nthe Chinese monk debated with, and was bested by, the Indian monk\nKamalaśīla. Mohoyen did not claim his view to be a\n“Self-sufficient Remedy”, but he did believe in an easy\npractice free of cognition that could, on its own, instantaneously\nproduce attainments. Sapaṇ has been criticized for being biased\nand historically uninformed, but modern scholarship has uncovered\nevidence of Chinese “Zen” sources for Tibetan views like\nthose he critiqued (D. Jackson 1990, D. Jackson 1994, Kapstein 2000:\n75–78 and van Schaik 2015: 175–182).\n",
    "section_title": "4. Preserving the True Path: Clarifying the Sage’s Intent",
    "entry_title": "Sakya Paṇḍita [sa skya paṇ ḍi ta]",
    "hierarchy_title": "Sakya Paṇḍita [sa skya paṇ ḍi ta] || Preserving the True Path: Clarifying the Sage’s Intent",
    "tokenized_text": [
        "preserving",
        "true",
        "path",
        "clarifying",
        "sage",
        "intent",
        "preserving",
        "true",
        "path",
        "clarifying",
        "sage",
        "intent",
        "clarifying",
        "sage",
        "intent",
        "d",
        "jackson",
        "path",
        "text",
        "genre",
        "called",
        "tenrim",
        "bstan",
        "rim",
        "stage",
        "doctrine",
        "lay",
        "detail",
        "practice",
        "accomplishment",
        "being",
        "way",
        "ordinary",
        "person",
        "liberated",
        "buddha",
        "elegant",
        "comprehensive",
        "approach",
        "path",
        "bodhisattva",
        "drawing",
        "indian",
        "sourcesespecially",
        "mahāyānasūtrālaṃkāra",
        "abhidharmasamuccaya",
        "asaṅga",
        "sapaṇ",
        "make",
        "creative",
        "use",
        "source",
        "variety",
        "way",
        "work",
        "complex",
        "interplay",
        "tradition",
        "innovation",
        "yet",
        "purpose",
        "significant",
        "aspect",
        "work",
        "construction",
        "path",
        "characterization",
        "bodhisattva",
        "practice",
        "number",
        "philosophical",
        "excurses",
        "unlike",
        "three",
        "vow",
        "sage",
        "intent",
        "primarily",
        "intended",
        "polemic",
        "text",
        "yet",
        "occasionally",
        "sapaṇ",
        "feel",
        "necessary",
        "address",
        "controversial",
        "issue",
        "relevant",
        "topic",
        "arise",
        "course",
        "description",
        "bodhisattva",
        "path",
        "possible",
        "work",
        "sapaṇ",
        "significant",
        "argument",
        "limit",
        "topic",
        "among",
        "extensively",
        "debated",
        "position",
        "important",
        "theme",
        "work",
        "issue",
        "supposed",
        "white",
        "selfsufficient",
        "remedy",
        "often",
        "translated",
        "white",
        "panacea",
        "a",
        "term",
        "used",
        "describe",
        "meditation",
        "practice",
        "called",
        "great",
        "seal",
        "mahāmudrā",
        "sapaṇ",
        "belief",
        "term",
        "mahāmudrā",
        "represents",
        "mistaken",
        "understanding",
        "practice",
        "transmutes",
        "legitimate",
        "tantric",
        "practice",
        "misleading",
        "pernicious",
        "fallacious",
        "doctrine",
        "order",
        "understand",
        "sapaṇ",
        "find",
        "selfsufficient",
        "remedy",
        "doctrine",
        "particularly",
        "troubling",
        "useful",
        "notice",
        "quintessentially",
        "brings",
        "together",
        "much",
        "sapaṇ",
        "considers",
        "wrong",
        "tibetan",
        "buddhism",
        "day",
        "recall",
        "sapaṇ",
        "distinctive",
        "philosophical",
        "view",
        "rest",
        "upon",
        "unstinting",
        "categorical",
        "distinction",
        "conventional",
        "ultimate",
        "reality",
        "seen",
        "important",
        "consequence",
        "epistemology",
        "approach",
        "interpretation",
        "buddhist",
        "ethic",
        "operation",
        "karma",
        "often",
        "criticizes",
        "apparent",
        "kneejerk",
        "decontextualization",
        "others",
        "read",
        "doctrine",
        "emptiness",
        "sapaṇ",
        "reminds",
        "u",
        "emptiness",
        "mean",
        "nothing",
        "really",
        "matter",
        "everything",
        "go",
        "view",
        "emptiness",
        "wipe",
        "away",
        "conventional",
        "ultimate",
        "reality",
        "relativize",
        "thing",
        "contrary",
        "requires",
        "action",
        "deemed",
        "meaningful",
        "real",
        "virtue",
        "effectiveness",
        "relevance",
        "within",
        "specifiable",
        "context",
        "buddhist",
        "contextualism",
        "target",
        "sapaṇ",
        "attack",
        "notion",
        "simply",
        "mean",
        "direct",
        "apprehension",
        "nature",
        "mind",
        "called",
        "mahāmudrā",
        "one",
        "attains",
        "accomplishment",
        "path",
        "one",
        "attainment",
        "alone",
        "cureall",
        "selfsufficient",
        "remedy",
        "see",
        "immediately",
        "claim",
        "practice",
        "challenge",
        "undermines",
        "importance",
        "many",
        "doctrinal",
        "detail",
        "practice",
        "context",
        "buddhist",
        "tradition",
        "paring",
        "single",
        "visionary",
        "experience",
        "addition",
        "sapaṇ",
        "considers",
        "view",
        "tibetan",
        "invention",
        "attested",
        "india",
        "resembles",
        "famously",
        "rejected",
        "chinese",
        "doctrine",
        "associated",
        "monk",
        "hvashang",
        "mohoyen",
        "white",
        "selfsufficient",
        "remedy",
        "belief",
        "ignorant",
        "distortion",
        "dharma",
        "lead",
        "nihilistic",
        "decline",
        "teaching",
        "furthermore",
        "sapaṇ",
        "considers",
        "practice",
        "mahāmudrā",
        "tantric",
        "general",
        "mahāyāna",
        "practice",
        "reject",
        "nontantric",
        "form",
        "teaching",
        "circulating",
        "day",
        "reason",
        "believe",
        "particular",
        "mixing",
        "general",
        "great",
        "vehicle",
        "specific",
        "tantric",
        "practice",
        "fact",
        "indian",
        "precedent",
        "sapaṇ",
        "seems",
        "assumed",
        "indian",
        "adept",
        "would",
        "prevented",
        "mistake",
        "see",
        "mathes",
        "historical",
        "perspective",
        "important",
        "distinguish",
        "conceptual",
        "implication",
        "selfsufficient",
        "remedy",
        "claim",
        "actual",
        "use",
        "adherent",
        "selfsufficient",
        "remedy",
        "view",
        "likely",
        "follower",
        "gampopa",
        "founder",
        "kagyu",
        "school",
        "tibetan",
        "buddhism",
        "would",
        "taught",
        "practice",
        "actually",
        "dispensed",
        "ritual",
        "meditation",
        "favor",
        "bare",
        "mahāmudrā",
        "practice",
        "contrary",
        "gampopa",
        "famous",
        "fivestage",
        "practice",
        "includes",
        "cultivation",
        "mahāmudrā",
        "fourth",
        "stage",
        "practice",
        "also",
        "included",
        "generation",
        "bodhicitta",
        "deity",
        "visualization",
        "guru",
        "devotion",
        "dedication",
        "merit",
        "gampopa",
        "instruction",
        "abandoning",
        "aspect",
        "path",
        "apparently",
        "difference",
        "opinion",
        "even",
        "among",
        "adherent",
        "selfsufficient",
        "remedy",
        "doctrine",
        "whether",
        "meant",
        "mahāmudrā",
        "substituted",
        "practice",
        "mahāmudrā",
        "way",
        "ultimately",
        "essentially",
        "equivalent",
        "attainment",
        "culmination",
        "peak",
        "latter",
        "case",
        "one",
        "might",
        "engage",
        "many",
        "practice",
        "ultimate",
        "perspective",
        "reach",
        "attainment",
        "mahāmudrā",
        "former",
        "casethe",
        "proper",
        "target",
        "sapaṇ",
        "critiqueone",
        "even",
        "try",
        "attain",
        "mahāmudrā",
        "sapaṇ",
        "contemporary",
        "understood",
        "remedy",
        "selfsufficient",
        "even",
        "point",
        "saying",
        "practitioner",
        "need",
        "generate",
        "bodhicitta",
        "dedicate",
        "merit",
        "d",
        "jackson",
        "three",
        "vow",
        "sapaṇ",
        "provides",
        "kind",
        "abstract",
        "criticism",
        "logic",
        "calling",
        "practice",
        "selfsufficient",
        "part",
        "list",
        "five",
        "perhaps",
        "response",
        "point",
        "padma",
        "karpo",
        "defender",
        "kagyu",
        "called",
        "sapaṇ",
        "argument",
        "childish",
        "criticism",
        "depicting",
        "merely",
        "worry",
        "meaning",
        "word",
        "d",
        "jackson",
        "say",
        "faulty",
        "say",
        "mahāmudrā",
        "singularly",
        "sufficient",
        "also",
        "faulty",
        "speak",
        "standard",
        "tantric",
        "practice",
        "two",
        "stage",
        "creation",
        "completionpresumably",
        "two",
        "stage",
        "also",
        "require",
        "preparatory",
        "bodhicitta",
        "generation",
        "subsequent",
        "dedication",
        "seem",
        "take",
        "least",
        "one",
        "abstract",
        "logical",
        "reading",
        "sapaṇ",
        "argument",
        "portends",
        "give",
        "credence",
        "rather",
        "overblown",
        "claim",
        "among",
        "sapaṇ",
        "later",
        "critic",
        "read",
        "selfsufficient",
        "remedy",
        "doctrine",
        "bad",
        "faith",
        "sapaṇ",
        "critique",
        "merely",
        "matter",
        "overly",
        "literal",
        "numeric",
        "quibble",
        "application",
        "metaphor",
        "three",
        "vow",
        "primarily",
        "critique",
        "claim",
        "single",
        "practice",
        "causally",
        "effective",
        "fact",
        "attainment",
        "depend",
        "upon",
        "multiple",
        "cause",
        "sage",
        "intent",
        "sapaṇ",
        "expansive",
        "detailed",
        "rejection",
        "many",
        "specific",
        "error",
        "criticizes",
        "practice",
        "adherent",
        "notion",
        "resting",
        "mind",
        "original",
        "unaltered",
        "relaxed",
        "d",
        "jackson",
        "ff",
        "mind",
        "simply",
        "enlightened",
        "unaltered",
        "state",
        "writes",
        "buddha",
        "would",
        "never",
        "needed",
        "teach",
        "dharma",
        "ideal",
        "say",
        "similar",
        "nonmahāyāna",
        "tradition",
        "disciple",
        "solitary",
        "buddha",
        "even",
        "simple",
        "ignorance",
        "mahāyāna",
        "path",
        "writes",
        "fails",
        "generate",
        "compassion",
        "wisdom",
        "point",
        "study",
        "necessary",
        "understand",
        "proper",
        "target",
        "meditation",
        "emptiness",
        "mahāmudrā",
        "attempted",
        "without",
        "prior",
        "cultivation",
        "merit",
        "wisdom",
        "say",
        "way",
        "simply",
        "saying",
        "meditatively",
        "cultivate",
        "nonconceptualization",
        "could",
        "effective",
        "point",
        "link",
        "various",
        "concern",
        "overarching",
        "worry",
        "moral",
        "nihilism",
        "arises",
        "claim",
        "practice",
        "reduced",
        "one",
        "combined",
        "unbridled",
        "confidence",
        "creative",
        "doctrinal",
        "innovation",
        "allows",
        "practitioner",
        "forego",
        "long",
        "difficult",
        "moral",
        "training",
        "bodhisattva",
        "favor",
        "easy",
        "delusory",
        "instantaneous",
        "quasiattainment",
        "fear",
        "prolixity",
        "leave",
        "sapaṇ",
        "argument",
        "employ",
        "distinctive",
        "approach",
        "doctrine",
        "emptiness",
        "two",
        "truth",
        "indeed",
        "although",
        "sapaṇ",
        "write",
        "work",
        "dedicated",
        "doctrine",
        "emptiness",
        "viewthat",
        "brief",
        "ultimate",
        "truth",
        "beyond",
        "conceptual",
        "elaborationis",
        "important",
        "contribution",
        "deserves",
        "study",
        "suffice",
        "say",
        "view",
        "tailor",
        "made",
        "prevent",
        "conceptual",
        "reification",
        "emptiness",
        "criticizes",
        "treasury",
        "nihilism",
        "criticizes",
        "sage",
        "intent",
        "perhaps",
        "controversial",
        "aspect",
        "sapaṇ",
        "critique",
        "sage",
        "intent",
        "assimilation",
        "nontantric",
        "mahāmudrā",
        "view",
        "doctrine",
        "famous",
        "chinese",
        "monk",
        "called",
        "hvashang",
        "mohoyen",
        "sapaṇ",
        "reiterates",
        "story",
        "told",
        "testament",
        "ba",
        "discovered",
        "among",
        "textual",
        "treasure",
        "dunhuang",
        "tell",
        "imperial",
        "period",
        "chinese",
        "monk",
        "debated",
        "bested",
        "indian",
        "monk",
        "kamalaśīla",
        "mohoyen",
        "claim",
        "view",
        "selfsufficient",
        "remedy",
        "believe",
        "easy",
        "practice",
        "free",
        "cognition",
        "could",
        "instantaneously",
        "produce",
        "attainment",
        "sapaṇ",
        "criticized",
        "biased",
        "historically",
        "uninformed",
        "modern",
        "scholarship",
        "uncovered",
        "evidence",
        "chinese",
        "zen",
        "source",
        "tibetan",
        "view",
        "like",
        "critiqued",
        "d",
        "jackson",
        "d",
        "jackson",
        "kapstein",
        "van",
        "schaik"
    ]
}