{
    "main_text": "Naturalism\n4. Naturalism\n\nScepticism and Animal Faith (1923) introduces Santayana’s\nmature naturalism. In summary, he maintains that knowledge and belief\nare not the result of reasoning. They are inescapable beliefs essential\nfor action. Epistemological foundationalism is a futile approach to\nknowledge. A more promising approach is to discern the underlying\nbelief structures assumed in animal action and imposed by natural\ncircumstances. The foundations for this approach are rooted in\nAristotle’s concept of activity and the pragmatic approach to action\nand knowledge. Explanations of natural events are the proper purview of\nscientists, while explications of the meaning and value of action may\nbe the proper sphere of historians and philosophers. Even so, both\nscientific explanations and philosophical explications are based in the\nnatural world. Meaning and value are generated by the interaction of\nour physical makeup, which Santayana calls “psyche,” and\nour material environment.\n\n\nSantayana’s critique of epistemological foundationalism is as unique\nas his heritage. With Spanish irony, he structures his argument after\nDescartes’ Meditations but arrives at an anti-foundationalist\nconclusion. Drawing attention to what is given in an instant of\nawareness (the smallest conceivable moment of consciousness), he\nmaintains that any knowledge or recognition found in such an instant\nwould have to be characterized by a concept (or “essence”\nto use Santayana’s term). Concepts cannot be limited to particular\ninstances; rather the particular object is seen as an instance of the\nconcept (essence). Thus, pursuing doubt to its ultimate end, one is\nconfined by the “solipsism of the present moment.” That is,\nin a single instant of awareness there can be no knowledge or belief,\nsince both require concepts not bounded by a moment of awareness.\nHence, the ultimate end of doubt, an instance of awareness, is empty.\nIt is the vacant awareness of a given without a basis for belief,\nknowledge or action. Santayana concludes that if one attempts to find\nthe bedrock of certainty, one may rest his claim only after he has, at\nleast theoretically, recognized that knowledge is composed of instances\nof awareness that in themselves do not contain the prerequisites for\nknowledge, e.g., concepts, universals, or essences. That both\nskepticism and proofs against skepticism lead nowhere is precisely\nSantayana’s point.\n\n\nPhilosophy must begin in medias res (in the middle of\nthings), in action itself, where there is an instinctive and arational\nbelief in the natural world: “animal faith.” For Santayana,\nanimal faith is the arational basis for any knowledge claims. It is the\nnether world of biological order operating through our physical,\nnon-conscious being generating beliefs that are “radically incapable of\nproof” (Scepticism, 35).\n\n\nIn rising out of passive intuition, I pass, by a vital constitutional\nnecessity, to belief in discourse, in experience, in substance, in\ntruth and in spirit. All these objects may conceivably be illusory.\nBelief in them however, is not grounded on a prior probability, but\nall judgements of probability are grounded on them. They express a\nrational instinct or instinctive reason, the waxing faith of an animal\nliving in a world which he can observe and sometimes remodel.\n(Scepticism, 308–309)\n\n\nHe describes these prejudices as “animal” in an effort to emphasize\nour biological base and community. This emphasis is similar to\nWittgenstein’s reference to convictions that are beyond being justified\nor unjustified as “something animal” (On Certainty 359). Ours\nis a long-standing primitive credulity, and our most basic beliefs are\nthose of an animal creed: “that there is a world, that there is a\nfuture, that things sought can be found, and things seen can be eaten”\n(Scepticism 180).\n\n\nSantayana (like Hume, Wittgenstein, and Strawson) holds there are\ncertain inevitable beliefs; they are inescapable given nature and our\nindividual physical history. And like Wittgenstein, he maintains that\nthese beliefs are various and variable. They are determined by the\ninterplay between environment and psyche, i.e., between our natural\nconditions and the inherited, physical “organisation of the animal”\n(the psyche). That we now inescapably believe in external objects and\nthe general reliability of inductive reasoning, for example, is a\nresult of physical history and the natural conditions of our world and\nourselves. Since these beliefs are relative to our physical histories,\nif our history and biological order had been different, our natural\nbeliefs would also be different.\n\n\nThe environment determines the occasions on which intuitions arise,\nthe psyche — the inherited organisation of the animal — determines\ntheir form, and ancient conditions of life on Earth no doubt determined\nwhich psyches should arise and prosper; and probably many forms of\nintuition, unthinkable to man, express the facts and the rhythms of\nnature to other animal minds (Scepticism, 88).\n\n\nBy displacing privileged mentalistic accounts with his pragmatic\nnaturalism, Santayana challenges then prevailing structures in both\nAmerican and English philosophies.\n\n\nSantayana explicates the primary distinguishable characteristics of\nour knowledge in his four-book Realms of Being. Believing that\nphilosophical terminology should have historical roots, Santayana\nemployed classical terminology for these characteristics: matter,\nessence, spirit, and truth. And although these terms are central to\nmany philosophical traditions, he views his work as “a revision of the\ncategories of common sense, faithful in spirit to orthodox human\ntradition, and endeavouring only to clarify those categories and\ndisentangle the confusions that inevitably arise …”\n(Realms 826).\n\n\nWithin Santayana’s naturalism, the origins of all events in the\nworld are arbitrary, temporal, and contingent. Matter (by whatever name\nit is called) is the principle of existence. It is “often untoward, and\nan occasion of imperfection or conflict in things.” (Realm of\nMatter, v) Hence, a “sour moralist” may consider it evil, but,\naccording to Santayana, if one takes a wider view “matter would seem a\ngood … because it is the principle of existence: it is all\nthings in their potentiality and therefore the condition of all their\nexcellence or possible perfection.” (Realm of Matter, v)\nMatter is the non-discursive, natural foundation for all that is. In\nitself, it is neither good nor evil but may be perceived as such when\nviewed from the vested interest of animal life. Latent animal interests\nconvert matter’s non-discernible, neutral face to a smile or frown. But\n“moral values cannot preside over nature.” (Realm of Matter,\n134) Principled values are the products of natural forces: “The\ngermination, definition, and prevalence of any good must be grounded in\nnature herself, not in human eloquence.” (Realm of Matter,\n131) From the point of view of origins, therefore, the realm of matter\nis the matrix and the source of everything: it is nature, the sphere of\ngenesis, the universal mother.\n\n\n“Essence” is Santayana’s term for concepts and meanings.\nHe draws on Aristotle’s notion of essence but removes all capacities\nfor producing effects. An essence is a universal, an object of thought,\nnot a material force. However, consciousness of an essence is generated\nby the interaction of a psyche and the material environment. Hence,\nmatter remains as the origin of existence and the arena of action, and\nthe realm of essence encompasses all possible thought.\n\n\n“Truth,” if some disinterested observer could ascertain\nit, would constitute all the essences that genuinely characterize the\nnatural world and all activities within it. Since all living beings\nhave natural interests and preferences, no such knowledge of truth can\nexist. All conscious beings must ascertain belief about truth based on\nthe success of actions that sustain life and permit periods of delight\nand joy.\n\n\nSantayana uses the term “spirit” to mean consciousness or\nawareness. As early as 19 April 1909, Santayana wrote to his sister\nthat he was writing a brand new system of philosophy to be called\n“The realms of Being” — “not the mineral\nvegetable and animal, but something far more metaphysical, namely\nEssence, Matter, and Consciousness. It will not be a long book, but\nvery technical.” When the book was published in the 1930s, he\nhad added his notion of truth and substituted “spirit” for\n“consciousness.” From his perspective, the substitution\ndid not alter the meaning of consciousness but rather captured an\nentire tradition of philosophical and religious inquiry as well as\nborrowed associated ideas from eastern religions. But to the\nconsternation of traditional views, many found the identity of spirit\nwith consciousness a troublesome idea. And so they should, for with\nthis identity Santayana removes the spiritual from the field of agency\nas well as from being an alternative way of living.  Santayana’s\napproach is therefore in direct contrast with those who think of\nspirit as causing action or as fostering a particular lifestyle.\nFollowing the tracks of Aristotle, he makes the spiritual life one\nform of culminating experiences arising from fulfilling activity.\n\n\nAwareness evolved through the natural development of the physical\nworld, and he demurs to scientific accounts for explanations of that\ndevelopment. Almost poetically, he sees spirit as emerging in moments\nof harmony between the psyche and the environment. Such harmony is\ntemporary, and the disorganized natural forces permit spirit to arise\n“only spasmodically, to suffer and to fail. For just as the\nbirth of spirit is joyous, because some nascent harmony evokes it, so\nthe rending or smothering of that harmony, if not sudden, imposes\nuseless struggles and suffering” (Birth of Reason,\n53). Accepting the world’s insecure equilibrium enables one to\ncelebrate the birth of spirit. Reasoning, particularly reasoning\nassociated with action, is a signal of the nascent activities of the\npsyche working to harmonize its actions with the environment, and if\nsuccessful, reason permits individual and social organization to\nprosper while spirit leads to the delight of imagination and\nartistry.\n\n\nSome commentators characterize Santayana as an epiphenomenalist, and\nthere are some commonalities, specifically the view that spirit is not\nefficacious. But there also are considerable differences. Santayana\ndoes not characterize his view as one-way interactionism, primarily\nbecause he does not think of spirit as an object to be acted upon.\nSpirit is rather a distinguishable aspect of thought, generated in\nactivity, and may be viewed more as a relational property. Santayana\nsometimes speaks of spirit and essence as supervening on material\nevents. But lacking the distinctions of contemporary philosophy, it is\ndifficult to characterize Santayana’s philosophy of mind accurately.\nHis view of consciousness is more celebrational, as opposed to being a\nburden or eliciting action. Spirit is “precisely the voice of order in\nnature, the music, as full of light as of motion, of joy as of peace,\nthat comes with an even partial and momentary perfection in some vital\nrhythm” (Birth of Reason, 53).\n\n\nSantayana’s account of spirit and essence may lead one to wonder\nhow Santayana can be included as a pragmatist, and this classification\nis accurate only if one includes an extended notion of pragmatic\nnaturalism. For Santayana, explanations of human life, including reason\nand spirit, lie within the sciences. The nature of truth simply is\ncorrespondence with what is, but since humans, nor any other conscious\nbeing, are able to see beyond the determinant limits of their nature\nand environment, pragmatism becomes the test of truth rather than\ncorrespondence. In short, the nature of truth is correspondence while\nthe test of truth is pragmatic. If an explanation continues to bear\nfruit over the long run, then it is accepted as truth until it is\nreplaced by a better explanation. In this, Santayana’s account of\npragmatic truth is more closely aligned with Peirce’s conception than\nthat of James or Dewey, including a tripartite account of knowledge\nconsisting of the subject, symbol, and object. Pragmatism is properly\nfocused on scientific inquiry and explanations, and it is severely\nlimited, even useless, in spiritual and aesthetic matters. Pragmatism\nis rooted in animal life, the need to know the world in a way that\nfosters successful action. If all life were constituted only by\nsuccessful or unsuccessful activities, one’s fated circumstances would\ngovern. But consciousness makes liberation possible and brings delight\nand festivity in material circumstances.\n\n\nSantayana’s anti-foundationalism, non-reductive materialism, and\npragmatic naturalism coupled with his emphasis on the spiritual life\nand his view of philosophy as literature anticipated many developments\nin philosophy and literary criticism that occurred in the latter half\nof the twentieth century, and these served as a challenge to the more\nhumanistic naturalisms of John Dewey and other American naturalists.\nThese views also provide the foundation for his view of ethics,\npolitical philosophy, and the spiritual life.\n",
    "section_title": "4. Naturalism",
    "entry_title": "George Santayana",
    "hierarchy_title": "George Santayana || Naturalism",
    "tokenized_text": [
        "naturalism",
        "naturalism",
        "scepticism",
        "animal",
        "faith",
        "introduces",
        "santayana",
        "mature",
        "naturalism",
        "summary",
        "maintains",
        "knowledge",
        "belief",
        "result",
        "reasoning",
        "inescapable",
        "belief",
        "essential",
        "action",
        "epistemological",
        "foundationalism",
        "futile",
        "approach",
        "knowledge",
        "promising",
        "approach",
        "discern",
        "underlying",
        "belief",
        "structure",
        "assumed",
        "animal",
        "action",
        "imposed",
        "natural",
        "circumstance",
        "foundation",
        "approach",
        "rooted",
        "aristotle",
        "concept",
        "activity",
        "pragmatic",
        "approach",
        "action",
        "knowledge",
        "explanation",
        "natural",
        "event",
        "proper",
        "purview",
        "scientist",
        "explication",
        "meaning",
        "value",
        "action",
        "may",
        "proper",
        "sphere",
        "historian",
        "philosopher",
        "even",
        "scientific",
        "explanation",
        "philosophical",
        "explication",
        "based",
        "natural",
        "world",
        "meaning",
        "value",
        "generated",
        "interaction",
        "physical",
        "makeup",
        "santayana",
        "call",
        "psyche",
        "material",
        "environment",
        "santayana",
        "critique",
        "epistemological",
        "foundationalism",
        "unique",
        "heritage",
        "spanish",
        "irony",
        "structure",
        "argument",
        "descartes",
        "meditation",
        "arrives",
        "antifoundationalist",
        "conclusion",
        "drawing",
        "attention",
        "given",
        "instant",
        "awareness",
        "smallest",
        "conceivable",
        "moment",
        "consciousness",
        "maintains",
        "knowledge",
        "recognition",
        "found",
        "instant",
        "would",
        "characterized",
        "concept",
        "essence",
        "use",
        "santayana",
        "term",
        "concept",
        "limited",
        "particular",
        "instance",
        "rather",
        "particular",
        "object",
        "seen",
        "instance",
        "concept",
        "essence",
        "thus",
        "pursuing",
        "doubt",
        "ultimate",
        "end",
        "one",
        "confined",
        "solipsism",
        "present",
        "moment",
        "single",
        "instant",
        "awareness",
        "knowledge",
        "belief",
        "since",
        "require",
        "concept",
        "bounded",
        "moment",
        "awareness",
        "hence",
        "ultimate",
        "end",
        "doubt",
        "instance",
        "awareness",
        "empty",
        "vacant",
        "awareness",
        "given",
        "without",
        "basis",
        "belief",
        "knowledge",
        "action",
        "santayana",
        "concludes",
        "one",
        "attempt",
        "find",
        "bedrock",
        "certainty",
        "one",
        "may",
        "rest",
        "claim",
        "least",
        "theoretically",
        "recognized",
        "knowledge",
        "composed",
        "instance",
        "awareness",
        "contain",
        "prerequisite",
        "knowledge",
        "eg",
        "concept",
        "universal",
        "essence",
        "skepticism",
        "proof",
        "skepticism",
        "lead",
        "nowhere",
        "precisely",
        "santayana",
        "point",
        "philosophy",
        "must",
        "begin",
        "medias",
        "re",
        "middle",
        "thing",
        "action",
        "instinctive",
        "arational",
        "belief",
        "natural",
        "world",
        "animal",
        "faith",
        "santayana",
        "animal",
        "faith",
        "arational",
        "basis",
        "knowledge",
        "claim",
        "nether",
        "world",
        "biological",
        "order",
        "operating",
        "physical",
        "nonconscious",
        "generating",
        "belief",
        "radically",
        "incapable",
        "proof",
        "scepticism",
        "rising",
        "passive",
        "intuition",
        "pas",
        "vital",
        "constitutional",
        "necessity",
        "belief",
        "discourse",
        "experience",
        "substance",
        "truth",
        "spirit",
        "object",
        "may",
        "conceivably",
        "illusory",
        "belief",
        "however",
        "grounded",
        "prior",
        "probability",
        "judgement",
        "probability",
        "grounded",
        "express",
        "rational",
        "instinct",
        "instinctive",
        "reason",
        "waxing",
        "faith",
        "animal",
        "living",
        "world",
        "observe",
        "sometimes",
        "remodel",
        "scepticism",
        "describes",
        "prejudice",
        "animal",
        "effort",
        "emphasize",
        "biological",
        "base",
        "community",
        "emphasis",
        "similar",
        "wittgenstein",
        "reference",
        "conviction",
        "beyond",
        "justified",
        "unjustified",
        "something",
        "animal",
        "certainty",
        "longstanding",
        "primitive",
        "credulity",
        "basic",
        "belief",
        "animal",
        "creed",
        "world",
        "future",
        "thing",
        "sought",
        "found",
        "thing",
        "seen",
        "eaten",
        "scepticism",
        "santayana",
        "like",
        "hume",
        "wittgenstein",
        "strawson",
        "hold",
        "certain",
        "inevitable",
        "belief",
        "inescapable",
        "given",
        "nature",
        "individual",
        "physical",
        "history",
        "like",
        "wittgenstein",
        "maintains",
        "belief",
        "various",
        "variable",
        "determined",
        "interplay",
        "environment",
        "psyche",
        "ie",
        "natural",
        "condition",
        "inherited",
        "physical",
        "organisation",
        "animal",
        "psyche",
        "inescapably",
        "believe",
        "external",
        "object",
        "general",
        "reliability",
        "inductive",
        "reasoning",
        "example",
        "result",
        "physical",
        "history",
        "natural",
        "condition",
        "world",
        "since",
        "belief",
        "relative",
        "physical",
        "history",
        "history",
        "biological",
        "order",
        "different",
        "natural",
        "belief",
        "would",
        "also",
        "different",
        "environment",
        "determines",
        "occasion",
        "intuition",
        "arise",
        "psyche",
        "inherited",
        "organisation",
        "animal",
        "determines",
        "form",
        "ancient",
        "condition",
        "life",
        "earth",
        "doubt",
        "determined",
        "psyche",
        "arise",
        "prosper",
        "probably",
        "many",
        "form",
        "intuition",
        "unthinkable",
        "man",
        "express",
        "fact",
        "rhythm",
        "nature",
        "animal",
        "mind",
        "scepticism",
        "displacing",
        "privileged",
        "mentalistic",
        "account",
        "pragmatic",
        "naturalism",
        "santayana",
        "challenge",
        "prevailing",
        "structure",
        "american",
        "english",
        "philosophy",
        "santayana",
        "explicates",
        "primary",
        "distinguishable",
        "characteristic",
        "knowledge",
        "fourbook",
        "realm",
        "believing",
        "philosophical",
        "terminology",
        "historical",
        "root",
        "santayana",
        "employed",
        "classical",
        "terminology",
        "characteristic",
        "matter",
        "essence",
        "spirit",
        "truth",
        "although",
        "term",
        "central",
        "many",
        "philosophical",
        "tradition",
        "view",
        "work",
        "revision",
        "category",
        "common",
        "sense",
        "faithful",
        "spirit",
        "orthodox",
        "human",
        "tradition",
        "endeavouring",
        "clarify",
        "category",
        "disentangle",
        "confusion",
        "inevitably",
        "arise",
        "realm",
        "within",
        "santayana",
        "naturalism",
        "origin",
        "event",
        "world",
        "arbitrary",
        "temporal",
        "contingent",
        "matter",
        "whatever",
        "name",
        "called",
        "principle",
        "existence",
        "often",
        "untoward",
        "occasion",
        "imperfection",
        "conflict",
        "things",
        "realm",
        "matter",
        "v",
        "hence",
        "sour",
        "moralist",
        "may",
        "consider",
        "evil",
        "according",
        "santayana",
        "one",
        "take",
        "wider",
        "view",
        "matter",
        "would",
        "seem",
        "good",
        "principle",
        "existence",
        "thing",
        "potentiality",
        "therefore",
        "condition",
        "excellence",
        "possible",
        "perfection",
        "realm",
        "matter",
        "v",
        "matter",
        "nondiscursive",
        "natural",
        "foundation",
        "neither",
        "good",
        "evil",
        "may",
        "perceived",
        "viewed",
        "vested",
        "interest",
        "animal",
        "life",
        "latent",
        "animal",
        "interest",
        "convert",
        "matter",
        "nondiscernible",
        "neutral",
        "face",
        "smile",
        "frown",
        "moral",
        "value",
        "preside",
        "nature",
        "realm",
        "matter",
        "principled",
        "value",
        "product",
        "natural",
        "force",
        "germination",
        "definition",
        "prevalence",
        "good",
        "must",
        "grounded",
        "nature",
        "human",
        "eloquence",
        "realm",
        "matter",
        "point",
        "view",
        "origin",
        "therefore",
        "realm",
        "matter",
        "matrix",
        "source",
        "everything",
        "nature",
        "sphere",
        "genesis",
        "universal",
        "mother",
        "essence",
        "santayana",
        "term",
        "concept",
        "meaning",
        "draw",
        "aristotle",
        "notion",
        "essence",
        "remove",
        "capacity",
        "producing",
        "effect",
        "essence",
        "universal",
        "object",
        "thought",
        "material",
        "force",
        "however",
        "consciousness",
        "essence",
        "generated",
        "interaction",
        "psyche",
        "material",
        "environment",
        "hence",
        "matter",
        "remains",
        "origin",
        "existence",
        "arena",
        "action",
        "realm",
        "essence",
        "encompasses",
        "possible",
        "thought",
        "truth",
        "disinterested",
        "observer",
        "could",
        "ascertain",
        "would",
        "constitute",
        "essence",
        "genuinely",
        "characterize",
        "natural",
        "world",
        "activity",
        "within",
        "since",
        "living",
        "being",
        "natural",
        "interest",
        "preference",
        "knowledge",
        "truth",
        "exist",
        "conscious",
        "being",
        "must",
        "ascertain",
        "belief",
        "truth",
        "based",
        "success",
        "action",
        "sustain",
        "life",
        "permit",
        "period",
        "delight",
        "joy",
        "santayana",
        "us",
        "term",
        "spirit",
        "mean",
        "consciousness",
        "awareness",
        "early",
        "april",
        "santayana",
        "wrote",
        "sister",
        "writing",
        "brand",
        "new",
        "system",
        "philosophy",
        "called",
        "realm",
        "mineral",
        "vegetable",
        "animal",
        "something",
        "far",
        "metaphysical",
        "namely",
        "essence",
        "matter",
        "consciousness",
        "long",
        "book",
        "technical",
        "book",
        "published",
        "s",
        "added",
        "notion",
        "truth",
        "substituted",
        "spirit",
        "consciousness",
        "perspective",
        "substitution",
        "alter",
        "meaning",
        "consciousness",
        "rather",
        "captured",
        "entire",
        "tradition",
        "philosophical",
        "religious",
        "inquiry",
        "well",
        "borrowed",
        "associated",
        "idea",
        "eastern",
        "religion",
        "consternation",
        "traditional",
        "view",
        "many",
        "found",
        "identity",
        "spirit",
        "consciousness",
        "troublesome",
        "idea",
        "identity",
        "santayana",
        "remove",
        "spiritual",
        "field",
        "agency",
        "well",
        "alternative",
        "way",
        "living",
        "santayana",
        "approach",
        "therefore",
        "direct",
        "contrast",
        "think",
        "spirit",
        "causing",
        "action",
        "fostering",
        "particular",
        "lifestyle",
        "following",
        "track",
        "aristotle",
        "make",
        "spiritual",
        "life",
        "one",
        "form",
        "culminating",
        "experience",
        "arising",
        "fulfilling",
        "activity",
        "awareness",
        "evolved",
        "natural",
        "development",
        "physical",
        "world",
        "demur",
        "scientific",
        "account",
        "explanation",
        "development",
        "almost",
        "poetically",
        "see",
        "spirit",
        "emerging",
        "moment",
        "harmony",
        "psyche",
        "environment",
        "harmony",
        "temporary",
        "disorganized",
        "natural",
        "force",
        "permit",
        "spirit",
        "arise",
        "spasmodically",
        "suffer",
        "fail",
        "birth",
        "spirit",
        "joyous",
        "nascent",
        "harmony",
        "evokes",
        "rending",
        "smothering",
        "harmony",
        "sudden",
        "imposes",
        "useless",
        "struggle",
        "suffering",
        "birth",
        "reason",
        "accepting",
        "world",
        "insecure",
        "equilibrium",
        "enables",
        "one",
        "celebrate",
        "birth",
        "spirit",
        "reasoning",
        "particularly",
        "reasoning",
        "associated",
        "action",
        "signal",
        "nascent",
        "activity",
        "psyche",
        "working",
        "harmonize",
        "action",
        "environment",
        "successful",
        "reason",
        "permit",
        "individual",
        "social",
        "organization",
        "prosper",
        "spirit",
        "lead",
        "delight",
        "imagination",
        "artistry",
        "commentator",
        "characterize",
        "santayana",
        "epiphenomenalist",
        "commonality",
        "specifically",
        "view",
        "spirit",
        "efficacious",
        "also",
        "considerable",
        "difference",
        "santayana",
        "characterize",
        "view",
        "oneway",
        "interactionism",
        "primarily",
        "think",
        "spirit",
        "object",
        "acted",
        "upon",
        "spirit",
        "rather",
        "distinguishable",
        "aspect",
        "thought",
        "generated",
        "activity",
        "may",
        "viewed",
        "relational",
        "property",
        "santayana",
        "sometimes",
        "speaks",
        "spirit",
        "essence",
        "supervening",
        "material",
        "event",
        "lacking",
        "distinction",
        "contemporary",
        "philosophy",
        "difficult",
        "characterize",
        "santayana",
        "philosophy",
        "mind",
        "accurately",
        "view",
        "consciousness",
        "celebrational",
        "opposed",
        "burden",
        "eliciting",
        "action",
        "spirit",
        "precisely",
        "voice",
        "order",
        "nature",
        "music",
        "full",
        "light",
        "motion",
        "joy",
        "peace",
        "come",
        "even",
        "partial",
        "momentary",
        "perfection",
        "vital",
        "rhythm",
        "birth",
        "reason",
        "santayana",
        "account",
        "spirit",
        "essence",
        "may",
        "lead",
        "one",
        "wonder",
        "santayana",
        "included",
        "pragmatist",
        "classification",
        "accurate",
        "one",
        "includes",
        "extended",
        "notion",
        "pragmatic",
        "naturalism",
        "santayana",
        "explanation",
        "human",
        "life",
        "including",
        "reason",
        "spirit",
        "lie",
        "within",
        "science",
        "nature",
        "truth",
        "simply",
        "correspondence",
        "since",
        "human",
        "conscious",
        "able",
        "see",
        "beyond",
        "determinant",
        "limit",
        "nature",
        "environment",
        "pragmatism",
        "becomes",
        "test",
        "truth",
        "rather",
        "correspondence",
        "short",
        "nature",
        "truth",
        "correspondence",
        "test",
        "truth",
        "pragmatic",
        "explanation",
        "continues",
        "bear",
        "fruit",
        "long",
        "run",
        "accepted",
        "truth",
        "replaced",
        "better",
        "explanation",
        "santayana",
        "account",
        "pragmatic",
        "truth",
        "closely",
        "aligned",
        "peirce",
        "conception",
        "james",
        "dewey",
        "including",
        "tripartite",
        "account",
        "knowledge",
        "consisting",
        "subject",
        "symbol",
        "object",
        "pragmatism",
        "properly",
        "focused",
        "scientific",
        "inquiry",
        "explanation",
        "severely",
        "limited",
        "even",
        "useless",
        "spiritual",
        "aesthetic",
        "matter",
        "pragmatism",
        "rooted",
        "animal",
        "life",
        "need",
        "know",
        "world",
        "way",
        "foster",
        "successful",
        "action",
        "life",
        "constituted",
        "successful",
        "unsuccessful",
        "activity",
        "one",
        "fated",
        "circumstance",
        "would",
        "govern",
        "consciousness",
        "make",
        "liberation",
        "possible",
        "brings",
        "delight",
        "festivity",
        "material",
        "circumstance",
        "santayana",
        "antifoundationalism",
        "nonreductive",
        "materialism",
        "pragmatic",
        "naturalism",
        "coupled",
        "emphasis",
        "spiritual",
        "life",
        "view",
        "philosophy",
        "literature",
        "anticipated",
        "many",
        "development",
        "philosophy",
        "literary",
        "criticism",
        "occurred",
        "latter",
        "half",
        "twentieth",
        "century",
        "served",
        "challenge",
        "humanistic",
        "naturalism",
        "john",
        "dewey",
        "american",
        "naturalist",
        "view",
        "also",
        "provide",
        "foundation",
        "view",
        "ethic",
        "political",
        "philosophy",
        "spiritual",
        "life"
    ]
}