{
    "main_text": "Value Personalism\n3. Value Personalism\n\nScheler’s first and most influential work in phenomenology was\nhis study of ethics, Formalism in Ethics and a Non-Formal (or\nMaterial) Ethics of Value. This work was motivated in part by a\ncritique of the highly scientific or formalistic approaches to ethics\nintroduced by Immanuel Kant and then later developed by the\nNeo-Kantians during the late nineteenth and early twentieth century.\nKant’s influence on Scheler’s thought cannot be\nunderestimated. With Kant, Scheler rejects both utilitarianism and\neudaimonism, and holds that ethics rests upon an a priori, an\nobligation non-relative to future consequences or happiness. For Kant,\nthe a priori is expressed in the form of a categorical imperative, an\nimperative that is universalizable. For Scheler, such a formulation of\nthe a priori is abstract and as a consequence, fails to account for\nboth the unique obligation one has to another person and the unique\ncall to responsibility given in the ethical imperative (GW II, 34).\nThe ethical imperative, Scheler insists, is given as what one ought to\nnecessarily do, but it is also experienced as what ‘I,’\nand not merely anyone, ought to do (GW II, 94).\n\nScheler argues that a material or a non-formal a priori arises in\nexperience, specifically in the experience of value. All experience is\nalready value latent (GW II, 35). An object of perception such as an\noak tree is not only green or large, but also pleasurable, beautiful\nand magnificent. Objects of experience are bearers of values.\nHistorical artifacts bear cultural values, religious icons bear the\nvalue of the “holy.” To suggest that an object bears a\nvalue is not to imply that a value inheres in an object. Just as the\ncolor red does not inhere in the tricycle, but is only given in the\nact of perception, the beauty of the painting is only given in the act\nof valuing. The value an object bears is given intuitively through a\ntype of value-ception. We “see” the beauty of a painting\njust as we “see” its colors. The grasping of value is our\nmost original and primordial relation to the world. An object has\nvalue for us before it is perceived or known (GW II, 40).\n\nFollowing Franz Brentano, Scheler conceived of positive and negative\nvalues as given in a relation to being. Positive values are not only\ngiven as that which entices us, but also as that which ought to be.\nSimilarly, negative values are given as that which ought not to be (GW\nII, 100). In the relation values bear to existence, an ideal ought is\ngiven. What ought to be is not logically derived or categorical, but\nis felt, i.e., experienced. Values not only draw our attention to the\nworld and others, but they also bear an ideal “ought.”\n\nValuing is an act of meaning giving or creation and is therefore an\nintentional act. The act of valuing is not an intellectual act, but an\nact of the “heart,” i.e., an emotional act. For Scheler,\nthere are two basic emotional acts, the act of love and the act of\nhate. These two acts found all value-ception and consciousness (GW\nVII, 185). Love and hate are further characterized by Scheler as\nmovements (GW VII, 191). In the act of love, the value of an object or\na person is deepened, revealing its highest or most profound\nsignificance. Hate, by contrast, is a movement of destruction, a\nmovement wherein the value of an object or a person is demeaned or\ndegraded.\n\nThe feelings of love and hate are the acts in which the world first\ncomes to have meaning for us and a preferencing is inherent in this\nprocess. We tend toward or are attracted to that which is of greater\nor positive value, and tend to move away from or are repelled by that\nwhich is of lesser or negative value. Present in every experience is a\nranking of values, a preference of certain values to others (GW II,\n104). That there is an order of preferencing in experience is perhaps\nbest demonstrated by the act of sacrifice. For the sake of a\nparticular life value such as health, we may sacrifice pleasurable\nexperiences such as an overindulgence of ice-cream. An order of value\npreferencing is present in every experience and every individual\npossesses such an ordering, what Scheler calls “an\nethos.”\n\nIt is in the experience of value preferencing that Scheler further\nclarifies the ethical a priori. There is, according to Scheler, an\nobjective ranking of values, a ranking of the “lower” to\nthe “higher,” or better expressed, a ranking of the more\nsuperficial to the deeper. The ranking of value types from lowest to\nhighest is as follows: pleasure, utility, vitality, culture, and\nholiness. How the different types of value stand in relation to one\nanother is grasped intuitively in the experience of value. Evidence of\nthis ranking is felt through experiences like duration (GW II, 108) or\ndepth of fulfillment (GW II, 113). Claiming that there is an objective\norder of values, or in Pascal’s terminology, an “ordre du\ncoeur” (order of the heart), necessarily entails that the higher\nvalues “ought” to be preferred to the lower. We ought to\nact in such a manner that promotes the higher or positive values. This\nnon-formal or material a priori of value is not given prior to\nexperience, but it is present in the experience of the particular\nvalue modalities. A religious icon is given not only as holy, but also\nas that which is to be preferred to the merely useful or vital. What\ntypes of value an object has is relative to the individual or culture.\nA cow certainly has a different value for the Hindu than for the\nrancher. Nonetheless, that the holy is to be preferred to the vital is\nnot historically or culturally relative.\n\nBoth the experience of value and the objective rank ordering of values\nare felt by a distinctive type of being, what Scheler calls\n“persons.” “Person” is a notion that Kant also\nuses and this is one of the reasons why Scheler uses the term. In a\nmanner quite similar to the problem of the a priori, Scheler wants to\nretain Kant’s understanding of “person” as absolute\nvalue, an end in itself Scheler is critical of Kant in so far as Kant\ngrounds the absolute value of the person in the universal category of\nreason.\n\nScheler describes the person as the concrete unity of acts of\ndifferent types and nature (GW II, 382). The person is present in each\nand every act, but the person is not reducible to any one act.\n“Unity” here is meant as a particular style, a style of\nact execution and being. Every individual has his or her unique style\nof loving, of assigning meaning, and necessarily has his or her own\naccess to the world. When a person dies, not only is that unique style\nof loving and assigning meaning lost, but so is that world.\n\nUnderstood as the unity of acts or an act center, the person is\nnecessarily non-objectifiable (GW II, 386). Objects only take on the\nmeaning as objects through intentional acts. Persons execute\nintentional acts. The meaning of a person is determined by the way in\nwhich a particular person brings meaning to the world. It is never a\nquestion of what a person is, but who a person is. Scheler takes great\npains to distinguish his notion of person from the traditional notions\nof subject, ego, mind or psyche. All of these traditional,\nphilosophical notions are objectifications, i.e. names given to\nparticular states, functions or capacities. Who a person is cannot be\ncaptured by a definition and can only be grasped through value\ninsight, an immediate and direct grasping of the other as a person in\nand through the act of love (GW II,\n 483)[1].\n The human being is constituted as person most profoundly through\nloving. \n\nThe imperative that is given in the value a priori, the objective rank\norder of values, is only felt by persons and, consequently, persons\nare the only beings who are ethically responsible. Because every\nexperience is value latent, a person is responsible to love the object\nor a being of that experience most fully, realizing the highest or\ndeepest value of that being. In relation with other persons, this\nresponsibility is ethical. In loving another person, one is called\nethically to love ever more fully and deeply. Failing to do so and\nresponding to this calling through acts of hate is not only ethically\nirresponsible but it is also morally evil. Any act that compromises or\nreduces the person to a lower value such as mere pleasure or utility\nis pernicious and evil.\n\nThe good in itself is thus a movement and openness to the higher or\ndeeper values. In the experience of positive values, we, as persons,\nare called to love others ever more profoundly. In the experience of\nnegative values, we are called to act in such a manner that ends the\ndestructive acts of hate and consequently brings an end to negative\nvalues. The call to act for the sake of the good itself is, for\nScheler, not general or universal, but radically individual or rather,\nunique. There is no experience of the good in itself in general, but\nonly the good in itself for me, and this constitutes in part the\nexperience of vocation peculiar to each unique person as creatively\nbecoming (GW II, 482). The deeper the value, the more individual, the\nmore personal, the call to act for the sake of the good becomes.\nEthical experience, the experience of being called to act for the\ngood, is a process of individuation (GW II, 501). The call becomes\never more personal as the value deepens. In acting ethically, I come\nto realize my unique place and contribution, and as a result, I become\nmore conscious of my obligation and duties to the world and to others.\nA material value ethic, in contrast to a formal ethic, reveals both\nthe radically unique manner by which each person is called to act and\nthe radically unique value of each and every person.\n",
    "section_title": "3. Value Personalism",
    "entry_title": "Max Scheler",
    "hierarchy_title": "Max Scheler || Value Personalism",
    "tokenized_text": [
        "value",
        "personalism",
        "value",
        "personalism",
        "scheler",
        "first",
        "influential",
        "work",
        "phenomenology",
        "study",
        "ethic",
        "formalism",
        "ethic",
        "nonformal",
        "material",
        "ethic",
        "value",
        "work",
        "motivated",
        "part",
        "critique",
        "highly",
        "scientific",
        "formalistic",
        "approach",
        "ethic",
        "introduced",
        "immanuel",
        "kant",
        "later",
        "developed",
        "neokantians",
        "late",
        "nineteenth",
        "early",
        "twentieth",
        "century",
        "kant",
        "influence",
        "scheler",
        "thought",
        "underestimated",
        "kant",
        "scheler",
        "reject",
        "utilitarianism",
        "eudaimonism",
        "hold",
        "ethic",
        "rest",
        "upon",
        "priori",
        "obligation",
        "nonrelative",
        "future",
        "consequence",
        "happiness",
        "kant",
        "priori",
        "expressed",
        "form",
        "categorical",
        "imperative",
        "imperative",
        "universalizable",
        "scheler",
        "formulation",
        "priori",
        "abstract",
        "consequence",
        "fails",
        "account",
        "unique",
        "obligation",
        "one",
        "another",
        "person",
        "unique",
        "call",
        "responsibility",
        "given",
        "ethical",
        "imperative",
        "gw",
        "ii",
        "ethical",
        "imperative",
        "scheler",
        "insists",
        "given",
        "one",
        "ought",
        "necessarily",
        "also",
        "experienced",
        "merely",
        "anyone",
        "ought",
        "gw",
        "ii",
        "scheler",
        "argues",
        "material",
        "nonformal",
        "priori",
        "arises",
        "experience",
        "specifically",
        "experience",
        "value",
        "experience",
        "already",
        "value",
        "latent",
        "gw",
        "ii",
        "object",
        "perception",
        "oak",
        "tree",
        "green",
        "large",
        "also",
        "pleasurable",
        "beautiful",
        "magnificent",
        "object",
        "experience",
        "bearer",
        "value",
        "historical",
        "artifact",
        "bear",
        "cultural",
        "value",
        "religious",
        "icon",
        "bear",
        "value",
        "holy",
        "suggest",
        "object",
        "bear",
        "value",
        "imply",
        "value",
        "inheres",
        "object",
        "color",
        "red",
        "inhere",
        "tricycle",
        "given",
        "act",
        "perception",
        "beauty",
        "painting",
        "given",
        "act",
        "valuing",
        "value",
        "object",
        "bear",
        "given",
        "intuitively",
        "type",
        "valueception",
        "see",
        "beauty",
        "painting",
        "see",
        "color",
        "grasping",
        "value",
        "original",
        "primordial",
        "relation",
        "world",
        "object",
        "value",
        "u",
        "perceived",
        "known",
        "gw",
        "ii",
        "following",
        "franz",
        "brentano",
        "scheler",
        "conceived",
        "positive",
        "negative",
        "value",
        "given",
        "relation",
        "positive",
        "value",
        "given",
        "entices",
        "u",
        "also",
        "ought",
        "similarly",
        "negative",
        "value",
        "given",
        "ought",
        "gw",
        "ii",
        "relation",
        "value",
        "bear",
        "existence",
        "ideal",
        "ought",
        "given",
        "ought",
        "logically",
        "derived",
        "categorical",
        "felt",
        "ie",
        "experienced",
        "value",
        "draw",
        "attention",
        "world",
        "others",
        "also",
        "bear",
        "ideal",
        "ought",
        "valuing",
        "act",
        "meaning",
        "giving",
        "creation",
        "therefore",
        "intentional",
        "act",
        "act",
        "valuing",
        "intellectual",
        "act",
        "act",
        "heart",
        "ie",
        "emotional",
        "act",
        "scheler",
        "two",
        "basic",
        "emotional",
        "act",
        "act",
        "love",
        "act",
        "hate",
        "two",
        "act",
        "found",
        "valueception",
        "consciousness",
        "gw",
        "vii",
        "love",
        "hate",
        "characterized",
        "scheler",
        "movement",
        "gw",
        "vii",
        "act",
        "love",
        "value",
        "object",
        "person",
        "deepened",
        "revealing",
        "highest",
        "profound",
        "significance",
        "hate",
        "contrast",
        "movement",
        "destruction",
        "movement",
        "wherein",
        "value",
        "object",
        "person",
        "demeaned",
        "degraded",
        "feeling",
        "love",
        "hate",
        "act",
        "world",
        "first",
        "come",
        "meaning",
        "u",
        "preferencing",
        "inherent",
        "process",
        "tend",
        "toward",
        "attracted",
        "greater",
        "positive",
        "value",
        "tend",
        "move",
        "away",
        "repelled",
        "lesser",
        "negative",
        "value",
        "present",
        "every",
        "experience",
        "ranking",
        "value",
        "preference",
        "certain",
        "value",
        "others",
        "gw",
        "ii",
        "order",
        "preferencing",
        "experience",
        "perhaps",
        "best",
        "demonstrated",
        "act",
        "sacrifice",
        "sake",
        "particular",
        "life",
        "value",
        "health",
        "may",
        "sacrifice",
        "pleasurable",
        "experience",
        "overindulgence",
        "icecream",
        "order",
        "value",
        "preferencing",
        "present",
        "every",
        "experience",
        "every",
        "individual",
        "posse",
        "ordering",
        "scheler",
        "call",
        "ethos",
        "experience",
        "value",
        "preferencing",
        "scheler",
        "clarifies",
        "ethical",
        "priori",
        "according",
        "scheler",
        "objective",
        "ranking",
        "value",
        "ranking",
        "lower",
        "higher",
        "better",
        "expressed",
        "ranking",
        "superficial",
        "deeper",
        "ranking",
        "value",
        "type",
        "lowest",
        "highest",
        "follows",
        "pleasure",
        "utility",
        "vitality",
        "culture",
        "holiness",
        "different",
        "type",
        "value",
        "stand",
        "relation",
        "one",
        "another",
        "grasped",
        "intuitively",
        "experience",
        "value",
        "evidence",
        "ranking",
        "felt",
        "experience",
        "like",
        "duration",
        "gw",
        "ii",
        "depth",
        "fulfillment",
        "gw",
        "ii",
        "claiming",
        "objective",
        "order",
        "value",
        "pascal",
        "terminology",
        "ordre",
        "du",
        "coeur",
        "order",
        "heart",
        "necessarily",
        "entail",
        "higher",
        "value",
        "ought",
        "preferred",
        "lower",
        "ought",
        "act",
        "manner",
        "promotes",
        "higher",
        "positive",
        "value",
        "nonformal",
        "material",
        "priori",
        "value",
        "given",
        "prior",
        "experience",
        "present",
        "experience",
        "particular",
        "value",
        "modality",
        "religious",
        "icon",
        "given",
        "holy",
        "also",
        "preferred",
        "merely",
        "useful",
        "vital",
        "type",
        "value",
        "object",
        "relative",
        "individual",
        "culture",
        "cow",
        "certainly",
        "different",
        "value",
        "hindu",
        "rancher",
        "nonetheless",
        "holy",
        "preferred",
        "vital",
        "historically",
        "culturally",
        "relative",
        "experience",
        "value",
        "objective",
        "rank",
        "ordering",
        "value",
        "felt",
        "distinctive",
        "type",
        "scheler",
        "call",
        "persons",
        "person",
        "notion",
        "kant",
        "also",
        "us",
        "one",
        "reason",
        "scheler",
        "us",
        "term",
        "manner",
        "quite",
        "similar",
        "problem",
        "priori",
        "scheler",
        "want",
        "retain",
        "kant",
        "understanding",
        "person",
        "absolute",
        "value",
        "end",
        "scheler",
        "critical",
        "kant",
        "far",
        "kant",
        "ground",
        "absolute",
        "value",
        "person",
        "universal",
        "category",
        "reason",
        "scheler",
        "describes",
        "person",
        "concrete",
        "unity",
        "act",
        "different",
        "type",
        "nature",
        "gw",
        "ii",
        "person",
        "present",
        "every",
        "act",
        "person",
        "reducible",
        "one",
        "act",
        "unity",
        "meant",
        "particular",
        "style",
        "style",
        "act",
        "execution",
        "every",
        "individual",
        "unique",
        "style",
        "loving",
        "assigning",
        "meaning",
        "necessarily",
        "access",
        "world",
        "person",
        "dy",
        "unique",
        "style",
        "loving",
        "assigning",
        "meaning",
        "lost",
        "world",
        "understood",
        "unity",
        "act",
        "act",
        "center",
        "person",
        "necessarily",
        "nonobjectifiable",
        "gw",
        "ii",
        "object",
        "take",
        "meaning",
        "object",
        "intentional",
        "act",
        "person",
        "execute",
        "intentional",
        "act",
        "meaning",
        "person",
        "determined",
        "way",
        "particular",
        "person",
        "brings",
        "meaning",
        "world",
        "never",
        "question",
        "person",
        "person",
        "scheler",
        "take",
        "great",
        "pain",
        "distinguish",
        "notion",
        "person",
        "traditional",
        "notion",
        "subject",
        "ego",
        "mind",
        "psyche",
        "traditional",
        "philosophical",
        "notion",
        "objectification",
        "ie",
        "name",
        "given",
        "particular",
        "state",
        "function",
        "capacity",
        "person",
        "captured",
        "definition",
        "grasped",
        "value",
        "insight",
        "immediate",
        "direct",
        "grasping",
        "person",
        "act",
        "love",
        "gw",
        "ii",
        "human",
        "constituted",
        "person",
        "profoundly",
        "loving",
        "imperative",
        "given",
        "value",
        "priori",
        "objective",
        "rank",
        "order",
        "value",
        "felt",
        "person",
        "consequently",
        "person",
        "being",
        "ethically",
        "responsible",
        "every",
        "experience",
        "value",
        "latent",
        "person",
        "responsible",
        "love",
        "object",
        "experience",
        "fully",
        "realizing",
        "highest",
        "deepest",
        "value",
        "relation",
        "person",
        "responsibility",
        "ethical",
        "loving",
        "another",
        "person",
        "one",
        "called",
        "ethically",
        "love",
        "ever",
        "fully",
        "deeply",
        "failing",
        "responding",
        "calling",
        "act",
        "hate",
        "ethically",
        "irresponsible",
        "also",
        "morally",
        "evil",
        "act",
        "compromise",
        "reduces",
        "person",
        "lower",
        "value",
        "mere",
        "pleasure",
        "utility",
        "pernicious",
        "evil",
        "good",
        "thus",
        "movement",
        "openness",
        "higher",
        "deeper",
        "value",
        "experience",
        "positive",
        "value",
        "person",
        "called",
        "love",
        "others",
        "ever",
        "profoundly",
        "experience",
        "negative",
        "value",
        "called",
        "act",
        "manner",
        "end",
        "destructive",
        "act",
        "hate",
        "consequently",
        "brings",
        "end",
        "negative",
        "value",
        "call",
        "act",
        "sake",
        "good",
        "scheler",
        "general",
        "universal",
        "radically",
        "individual",
        "rather",
        "unique",
        "experience",
        "good",
        "general",
        "good",
        "constitutes",
        "part",
        "experience",
        "vocation",
        "peculiar",
        "unique",
        "person",
        "creatively",
        "becoming",
        "gw",
        "ii",
        "deeper",
        "value",
        "individual",
        "personal",
        "call",
        "act",
        "sake",
        "good",
        "becomes",
        "ethical",
        "experience",
        "experience",
        "called",
        "act",
        "good",
        "process",
        "individuation",
        "gw",
        "ii",
        "call",
        "becomes",
        "ever",
        "personal",
        "value",
        "deepens",
        "acting",
        "ethically",
        "come",
        "realize",
        "unique",
        "place",
        "contribution",
        "result",
        "become",
        "conscious",
        "obligation",
        "duty",
        "world",
        "others",
        "material",
        "value",
        "ethic",
        "contrast",
        "formal",
        "ethic",
        "reveals",
        "radically",
        "unique",
        "manner",
        "person",
        "called",
        "act",
        "radically",
        "unique",
        "value",
        "every",
        "person"
    ]
}