{
    "main_text": "Philosophical Anthropology and Metaphysics\n7. Philosophical Anthropology and Metaphysics\n\nIn the Preface to the volume, The Forms of Knowledge and\nSociety, Scheler remarks that the works contained in the volume,\nThe Sociology of Knowledge and Cognition and Work,\nare a means to understand both his philosophical anthropology and\nmetaphysics (GW VIII, 11). Many of the themes present in this volume\nare developed in a more speculative manner. Scheler has been often\ncriticized for taking this metaphysical turn, a turn apparently\ndefying his earlier phenomenological investigations and a turn taken\nat a time that many were declaring to be the end of the metaphysics\nand metaphysical systems. For Scheler, the move was necessary to\ncounteract the forces found in the mindsets that underpin those\npositive sciences that render metaphysical and philosophical\ninvestigations meaningless. More importantly, this metaphysical turn\nwas also necessary to grasp more profoundly the crisis haunting\nmodernity.\n\nThe social and political tensions erupting in Germany and Europe,\ntensions Scheler feared would lead to a second and even bloodier World\nWar, had their roots in a much deeper crisis, an ontological crisis, a\ncrisis of the human being. This crisis is perhaps best captured by\nScheler in his essay, The Human Being and History. Scheler\nwrites, “In our ten-thousand year history, we are the first time\nperiod in which the human being has become fully and totally\n‘problematic’; the first time period in which the human\nbeing no longer knows who he or she is, but also knows that\nhe or she does not know” (GW IX, 120). The purpose of the later\nspeculative work was not merely to clarify the nature of the crisis,\nbut also to problematize what had become unproblematic, to show that\nthe human being is a question that ought to be considered.\n\nPhilosophical anthropology is an attempt to provide a unified account\nof the meaning of the human being. In a much earlier work, The\nIdea of the Human Being, Scheler writes that the human being is\nundefinable (GW III, 186). The human being is no thing, but rather a\n“becoming,” a “between,” a\n“self-transcending being.” An attempt at a unified account\nis thus not a search for a definition, but rather an attempt to\nclarify exactly that which makes the human being undefinable, that\nwhich reveals human being as a human becoming. A philosophical\nanthropology is historical in as much as it investigates the dominant\nworldviews that harbor a basic insight into the meaning of being\nhuman. The three dominant insights that Scheler wishes to unify are\n(1) the human being as “tool maker” (homo faber), the\ninsight of Darwinian evolution and science, (2) the human being as\nrational animal, the insight directing the ancient Greek worldview,\nand (3) the human being as child of God, the insight of the\nJudeo-Christian worldview. Each insight, for Scheler, reveals a\npeculiar aspect of the human being. The problem is that no one has yet\nshown how these insights are united to form a singular whole, the\nunity that is the human being.\n\nA rejection of any attempt to define the human being is a rejection of\nthe traditional attempt in philosophy to think of the human being as a\nsubstance. Scheler describes the human being not as a substance, but\nas the meeting point of two distinct movements (GW IX, 70). These\nmovements are life-urge (Lebensdrang) and spirit\n(Geist). The distinction between these two movements follows\nthe distinction between the real and the ideal factors introduced in\nthe sociology of knowledge. It is only in the human being that life\nand spirit find themselves in a process of becoming unified. In the\nhuman being, life becomes spiritualized and spirit becomes vitalized\nand embodied. Every act of the human being participates in this dual\nprocess, a process that is never completed, but is recreated in every\nnew act. Either this process participates in the realization of the\ndeeper, spiritual values, or it is a movement toward bestialization, a\nrealization of the more shallow and superficial values.\n\nLife-urge is the movement found in every living being, the movement or\ndrive to seek the greatest amount of fulfillment and vivacity with the\nleast amount of resistance. This urge can be found in the distinct\nstages of evolution, whether in the most basic living organism or in\nthe higher primates and human beings. It expresses itself in the\ninstinctual drives as well as in the highly sophisticated intelligence\nneeded to solve problems related to survival in an environment.\nScheler argues in Cognition and Work that pragmatism has\noffered to date the best and the most robust account of the human\nbeing as a living being who interacts with and learns from his or her\nenvironment.\n\nLiving beings relate to their environment and to other living beings\nerotically, through a type of cosmic love disclosed most emphatically\nin the person of Saint Francis of Assisi (GW VIII, 274). As\nerotic-vital beings, humans seek the most vivacious and beautiful of\nlives. A living being desires not merely to live, but to live most\nfully. As living beings, we bear an erotic relation to the natural\nworld. This loving relation to other living beings affords us a\nconnection to others as fellow living beings, an understanding of the\nother as living, as sharing in an environment. Having a body affords\nthe human being a privileged access to the living world and the\nenvironment, an access threatened by the mechanization of nature and\nthe modern drive to dominate it.\n\nWhat it means to be a living being takes on a much more complex and\nelevated significance in Scheler’s later work and marks a\ngenuinely new avenue of investigation for him. Yet, the questions\nconcerning the meaning of being human remain very much the same. Are\nhuman beings merely intelligent living beings? Is the difference\nbetween the being human and being some other animal one of degree or\nis it a difference of kind? Is there anything “special” or\nunique about being human? The answer to these questions is decisive\nfor Scheler. At stake is the meaning of the human being as person, as\nabsolute value. In his philosophical anthropology, Scheler attempts to\ndemonstrate that the human being also participates in the movement of\nspirit and that spirit is essentially different from the movement of\nlife. The human being has a “special” place in the cosmos\nbecause the human being participates in both the movement of life and\nspirit, because each human being is an embodied spirit, i.e., a finite\nperson.\n\nThere are at least four ways in which Scheler distinguishes spirit\nfrom life.\n\n\n\nSpirit is the activity of objectivizing, a rendering of the world and\nof beings in terms of what they mean. Mere living beings, by contrast,\nrelate to objects in their environment not as objects, but as that\nwhich satisfies the drives. For example, for the living being, the\napple is experienced as merely something to fulfill one’s\ndesire, whereas for the spiritual being, the apple is given as apple,\nas a kind of food.\n\n\nRelated to this first characteristic, is the value latent quality of\nspirit. The movement of spirit is the disclosure of value. According\nto Scheler, life-urge is value blind and is motivated solely by\ngreater fulfillment. Spirit is motivated by the good and is structured\naccording to agape, a charitable and self-sacrificing\nlove.\n\n\nSpirit is self-consciousness. Each living being, by virtue of having a\nbody, exhibits a type of body-consciousness, a relating of oneself to\nothers in a given environment. Spiritual beings not only can take\nthemselves to be objects of reflection, and thus can be critical of\nwho or what they have become, but are also aware of themselves as\nbeing seen by others, as having a different world of experience than\nothers.\n\n\nThe final distinguishing characteristic is spirit’s quality of\nworld-openness. Spiritual beings are not restricted in their\nreflections to the here and now, or even to the specific context of\ntheir immediate life concerns. This type of world-openness is what is\ncaptured by the Greek sense of wonder, a metaphysical wonder and\nastonishment that there is something rather than nothing. Spiritual\nbeings are able to contemplate the meaning of being, time, death as\nwell as the purpose of existence itself. These are not merely\ntheoretical concerns, but that which transcends, or is beyond,\nlife.\n\n\nIt is the sense of spirit as world-open that leads Scheler to\nundertake his final reflections regarding the ground of all being or\nWeltgrund. These final reflections are taken not from a\nreligious perspective, but from a metaphysical one. In this final\nstage of his thought, Scheler becomes increasingly critical of\nreligion and finds that philosophy remains more true to the\nsignificance of the human being as world-open. Religion, writes\nScheler, tends to conceal this openness by positing some fixed or\nsecure notion of God (GW IX, 69). The radical openness that is spirit\nreveals, to the contrary, that the ground of all being is itself\ncaught up in a process of becoming. Scheler’s understanding of\nGod also changes. In his later thought, God is a becoming that takes\nplace in and through the acts of all spiritual beings. It requires\ngreat courage to face a world that has no fixed meaning, a world whose\nmeaning hangs upon the actions of each and every human being.\n\nOutright rejected by Scheler is the creator God of the Judeo-Christian\ntradition. Spirit wholly lacks the power to create ex nihilo,\nand God as pure spirit is utterly powerless in this sense. The power\nof spirit lies in its ability to guide and direct the becoming of the\nworld. God did not create the world, but allowed it to become (GW XI,\n203). The world, i.e., life-urge, is the realizing factor of spirit\nand, in allowing the world to become, God makes it possible for\ngoodness to be realized. Hence, the becoming of the world is, by\nvirtue of God’s love, agape. As the meeting place of\nspirit and life, the human being is responsible for the becoming of\nGod, and consequently for the realization of goodness. This task of\nthe realization of God is one and same as the task of the realization\nof the deeper spiritual values. As the deeper spiritual values are\nrealized, existence takes on a more meaningful form and ultimately\npoints to the deepest value, the divine. Scheler’s metaphysics\nis the revelation of human responsibility in its most profound\ndesignation. Whether human existence is the expression of the divine\nor is merely relative to the basest of values depends solely on the\nmanner in which human beings take responsibility for a future that is\nopen. Rather than shift responsibility for the uncertain future to a\nparticular religious practice or dogma, each person must live out the\nwholly indeterminate becoming of the world, the human being and\nGod.\n\nScheler’s commitment to the distinctive nature of the human\nbeing and to the two irreducible movements of the Weltgrund, spirit\nand life-urge, leaves his final thought in a kind of dualism. He is\nreadily aware of this and argues that his is a new type of dualism. It\ndoes not suffer from the problems introduced by the Cartesian dualism\nof mind and body. Yet, due in part to the unfinished nature of both\nhis philosophical anthropology and metaphysics, we are left with more\nquestions than answers about the relation between life and spirit. For\ninstance, how do spirit and life interact when life is value blind and\nspirit is powerless? How is the human being a unity when it\nparticipates in two essentially different movements? What is clear is\nthat these two movements constituting the unique place of the human\nbeing interpenetrate one another through a discourse of loving, the\neros of life and the agape of spirit. Through his or her\nexistence, the human beings is the unification of both forms of loving\nand is afforded the unique insights that arise through eros and\nagape. Scheler’s attempt at a metaphysics is a more\nspeculative approach to an examination of human existence, but this\nspeculative move is motivated by a fuller understanding of the\noriginal and loving openness the human being bears to the world.\n",
    "section_title": "7. Philosophical Anthropology and Metaphysics",
    "entry_title": "Max Scheler",
    "hierarchy_title": "Max Scheler || Philosophical Anthropology and Metaphysics",
    "tokenized_text": [
        "philosophical",
        "anthropology",
        "metaphysics",
        "philosophical",
        "anthropology",
        "metaphysics",
        "preface",
        "volume",
        "form",
        "knowledge",
        "society",
        "scheler",
        "remark",
        "work",
        "contained",
        "volume",
        "sociology",
        "knowledge",
        "cognition",
        "work",
        "mean",
        "understand",
        "philosophical",
        "anthropology",
        "metaphysics",
        "gw",
        "viii",
        "many",
        "theme",
        "present",
        "volume",
        "developed",
        "speculative",
        "manner",
        "scheler",
        "often",
        "criticized",
        "taking",
        "metaphysical",
        "turn",
        "turn",
        "apparently",
        "defying",
        "earlier",
        "phenomenological",
        "investigation",
        "turn",
        "taken",
        "time",
        "many",
        "declaring",
        "end",
        "metaphysics",
        "metaphysical",
        "system",
        "scheler",
        "move",
        "necessary",
        "counteract",
        "force",
        "found",
        "mindset",
        "underpin",
        "positive",
        "science",
        "render",
        "metaphysical",
        "philosophical",
        "investigation",
        "meaningless",
        "importantly",
        "metaphysical",
        "turn",
        "also",
        "necessary",
        "grasp",
        "profoundly",
        "crisis",
        "haunting",
        "modernity",
        "social",
        "political",
        "tension",
        "erupting",
        "germany",
        "europe",
        "tension",
        "scheler",
        "feared",
        "would",
        "lead",
        "second",
        "even",
        "bloodier",
        "world",
        "war",
        "root",
        "much",
        "deeper",
        "crisis",
        "ontological",
        "crisis",
        "crisis",
        "human",
        "crisis",
        "perhaps",
        "best",
        "captured",
        "scheler",
        "essay",
        "human",
        "history",
        "scheler",
        "writes",
        "tenthousand",
        "year",
        "history",
        "first",
        "time",
        "period",
        "human",
        "become",
        "fully",
        "totally",
        "problematic",
        "first",
        "time",
        "period",
        "human",
        "longer",
        "know",
        "also",
        "know",
        "know",
        "gw",
        "ix",
        "purpose",
        "later",
        "speculative",
        "work",
        "merely",
        "clarify",
        "nature",
        "crisis",
        "also",
        "problematize",
        "become",
        "unproblematic",
        "show",
        "human",
        "question",
        "ought",
        "considered",
        "philosophical",
        "anthropology",
        "attempt",
        "provide",
        "unified",
        "account",
        "meaning",
        "human",
        "much",
        "earlier",
        "work",
        "idea",
        "human",
        "scheler",
        "writes",
        "human",
        "undefinable",
        "gw",
        "iii",
        "human",
        "thing",
        "rather",
        "becoming",
        "selftranscending",
        "being",
        "attempt",
        "unified",
        "account",
        "thus",
        "search",
        "definition",
        "rather",
        "attempt",
        "clarify",
        "exactly",
        "make",
        "human",
        "undefinable",
        "reveals",
        "human",
        "human",
        "becoming",
        "philosophical",
        "anthropology",
        "historical",
        "much",
        "investigates",
        "dominant",
        "worldviews",
        "harbor",
        "basic",
        "insight",
        "meaning",
        "human",
        "three",
        "dominant",
        "insight",
        "scheler",
        "wish",
        "unify",
        "human",
        "tool",
        "maker",
        "homo",
        "faber",
        "insight",
        "darwinian",
        "evolution",
        "science",
        "human",
        "rational",
        "animal",
        "insight",
        "directing",
        "ancient",
        "greek",
        "worldview",
        "human",
        "child",
        "god",
        "insight",
        "judeochristian",
        "worldview",
        "insight",
        "scheler",
        "reveals",
        "peculiar",
        "aspect",
        "human",
        "problem",
        "one",
        "yet",
        "shown",
        "insight",
        "united",
        "form",
        "singular",
        "whole",
        "unity",
        "human",
        "rejection",
        "attempt",
        "define",
        "human",
        "rejection",
        "traditional",
        "attempt",
        "philosophy",
        "think",
        "human",
        "substance",
        "scheler",
        "describes",
        "human",
        "substance",
        "meeting",
        "point",
        "two",
        "distinct",
        "movement",
        "gw",
        "ix",
        "movement",
        "lifeurge",
        "lebensdrang",
        "spirit",
        "geist",
        "distinction",
        "two",
        "movement",
        "follows",
        "distinction",
        "real",
        "ideal",
        "factor",
        "introduced",
        "sociology",
        "knowledge",
        "human",
        "life",
        "spirit",
        "find",
        "process",
        "becoming",
        "unified",
        "human",
        "life",
        "becomes",
        "spiritualized",
        "spirit",
        "becomes",
        "vitalized",
        "embodied",
        "every",
        "act",
        "human",
        "participates",
        "dual",
        "process",
        "process",
        "never",
        "completed",
        "recreated",
        "every",
        "new",
        "act",
        "either",
        "process",
        "participates",
        "realization",
        "deeper",
        "spiritual",
        "value",
        "movement",
        "toward",
        "bestialization",
        "realization",
        "shallow",
        "superficial",
        "value",
        "lifeurge",
        "movement",
        "found",
        "every",
        "living",
        "movement",
        "drive",
        "seek",
        "greatest",
        "amount",
        "fulfillment",
        "vivacity",
        "least",
        "amount",
        "resistance",
        "urge",
        "found",
        "distinct",
        "stage",
        "evolution",
        "whether",
        "basic",
        "living",
        "organism",
        "higher",
        "primate",
        "human",
        "being",
        "express",
        "instinctual",
        "drive",
        "well",
        "highly",
        "sophisticated",
        "intelligence",
        "needed",
        "solve",
        "problem",
        "related",
        "survival",
        "environment",
        "scheler",
        "argues",
        "cognition",
        "work",
        "pragmatism",
        "offered",
        "date",
        "best",
        "robust",
        "account",
        "human",
        "living",
        "interacts",
        "learns",
        "environment",
        "living",
        "being",
        "relate",
        "environment",
        "living",
        "being",
        "erotically",
        "type",
        "cosmic",
        "love",
        "disclosed",
        "emphatically",
        "person",
        "saint",
        "francis",
        "assisi",
        "gw",
        "viii",
        "eroticvital",
        "being",
        "human",
        "seek",
        "vivacious",
        "beautiful",
        "life",
        "living",
        "desire",
        "merely",
        "live",
        "live",
        "fully",
        "living",
        "being",
        "bear",
        "erotic",
        "relation",
        "natural",
        "world",
        "loving",
        "relation",
        "living",
        "being",
        "affords",
        "u",
        "connection",
        "others",
        "fellow",
        "living",
        "being",
        "understanding",
        "living",
        "sharing",
        "environment",
        "body",
        "affords",
        "human",
        "privileged",
        "access",
        "living",
        "world",
        "environment",
        "access",
        "threatened",
        "mechanization",
        "nature",
        "modern",
        "drive",
        "dominate",
        "mean",
        "living",
        "take",
        "much",
        "complex",
        "elevated",
        "significance",
        "scheler",
        "later",
        "work",
        "mark",
        "genuinely",
        "new",
        "avenue",
        "investigation",
        "yet",
        "question",
        "concerning",
        "meaning",
        "human",
        "remain",
        "much",
        "human",
        "being",
        "merely",
        "intelligent",
        "living",
        "being",
        "difference",
        "human",
        "animal",
        "one",
        "degree",
        "difference",
        "kind",
        "anything",
        "special",
        "unique",
        "human",
        "answer",
        "question",
        "decisive",
        "scheler",
        "stake",
        "meaning",
        "human",
        "person",
        "absolute",
        "value",
        "philosophical",
        "anthropology",
        "scheler",
        "attempt",
        "demonstrate",
        "human",
        "also",
        "participates",
        "movement",
        "spirit",
        "spirit",
        "essentially",
        "different",
        "movement",
        "life",
        "human",
        "special",
        "place",
        "cosmos",
        "human",
        "participates",
        "movement",
        "life",
        "spirit",
        "human",
        "embodied",
        "spirit",
        "ie",
        "finite",
        "person",
        "least",
        "four",
        "way",
        "scheler",
        "distinguishes",
        "spirit",
        "life",
        "spirit",
        "activity",
        "objectivizing",
        "rendering",
        "world",
        "being",
        "term",
        "mean",
        "mere",
        "living",
        "being",
        "contrast",
        "relate",
        "object",
        "environment",
        "object",
        "satisfies",
        "drive",
        "example",
        "living",
        "apple",
        "experienced",
        "merely",
        "something",
        "fulfill",
        "one",
        "desire",
        "whereas",
        "spiritual",
        "apple",
        "given",
        "apple",
        "kind",
        "food",
        "related",
        "first",
        "characteristic",
        "value",
        "latent",
        "quality",
        "spirit",
        "movement",
        "spirit",
        "disclosure",
        "value",
        "according",
        "scheler",
        "lifeurge",
        "value",
        "blind",
        "motivated",
        "solely",
        "greater",
        "fulfillment",
        "spirit",
        "motivated",
        "good",
        "structured",
        "according",
        "agape",
        "charitable",
        "selfsacrificing",
        "love",
        "spirit",
        "selfconsciousness",
        "living",
        "virtue",
        "body",
        "exhibit",
        "type",
        "bodyconsciousness",
        "relating",
        "oneself",
        "others",
        "given",
        "environment",
        "spiritual",
        "being",
        "take",
        "object",
        "reflection",
        "thus",
        "critical",
        "become",
        "also",
        "aware",
        "seen",
        "others",
        "different",
        "world",
        "experience",
        "others",
        "final",
        "distinguishing",
        "characteristic",
        "spirit",
        "quality",
        "worldopenness",
        "spiritual",
        "being",
        "restricted",
        "reflection",
        "even",
        "specific",
        "context",
        "immediate",
        "life",
        "concern",
        "type",
        "worldopenness",
        "captured",
        "greek",
        "sense",
        "wonder",
        "metaphysical",
        "wonder",
        "astonishment",
        "something",
        "rather",
        "nothing",
        "spiritual",
        "being",
        "able",
        "contemplate",
        "meaning",
        "time",
        "death",
        "well",
        "purpose",
        "existence",
        "merely",
        "theoretical",
        "concern",
        "transcends",
        "beyond",
        "life",
        "sense",
        "spirit",
        "worldopen",
        "lead",
        "scheler",
        "undertake",
        "final",
        "reflection",
        "regarding",
        "ground",
        "weltgrund",
        "final",
        "reflection",
        "taken",
        "religious",
        "perspective",
        "metaphysical",
        "one",
        "final",
        "stage",
        "thought",
        "scheler",
        "becomes",
        "increasingly",
        "critical",
        "religion",
        "find",
        "philosophy",
        "remains",
        "true",
        "significance",
        "human",
        "worldopen",
        "religion",
        "writes",
        "scheler",
        "tends",
        "conceal",
        "openness",
        "positing",
        "fixed",
        "secure",
        "notion",
        "god",
        "gw",
        "ix",
        "radical",
        "openness",
        "spirit",
        "reveals",
        "contrary",
        "ground",
        "caught",
        "process",
        "becoming",
        "scheler",
        "understanding",
        "god",
        "also",
        "change",
        "later",
        "thought",
        "god",
        "becoming",
        "take",
        "place",
        "act",
        "spiritual",
        "being",
        "requires",
        "great",
        "courage",
        "face",
        "world",
        "fixed",
        "meaning",
        "world",
        "whose",
        "meaning",
        "hang",
        "upon",
        "action",
        "every",
        "human",
        "outright",
        "rejected",
        "scheler",
        "creator",
        "god",
        "judeochristian",
        "tradition",
        "spirit",
        "wholly",
        "lack",
        "power",
        "create",
        "ex",
        "nihilo",
        "god",
        "pure",
        "spirit",
        "utterly",
        "powerless",
        "sense",
        "power",
        "spirit",
        "lie",
        "ability",
        "guide",
        "direct",
        "becoming",
        "world",
        "god",
        "create",
        "world",
        "allowed",
        "become",
        "gw",
        "xi",
        "world",
        "ie",
        "lifeurge",
        "realizing",
        "factor",
        "spirit",
        "allowing",
        "world",
        "become",
        "god",
        "make",
        "possible",
        "goodness",
        "realized",
        "hence",
        "becoming",
        "world",
        "virtue",
        "god",
        "love",
        "agape",
        "meeting",
        "place",
        "spirit",
        "life",
        "human",
        "responsible",
        "becoming",
        "god",
        "consequently",
        "realization",
        "goodness",
        "task",
        "realization",
        "god",
        "one",
        "task",
        "realization",
        "deeper",
        "spiritual",
        "value",
        "deeper",
        "spiritual",
        "value",
        "realized",
        "existence",
        "take",
        "meaningful",
        "form",
        "ultimately",
        "point",
        "deepest",
        "value",
        "divine",
        "scheler",
        "metaphysics",
        "revelation",
        "human",
        "responsibility",
        "profound",
        "designation",
        "whether",
        "human",
        "existence",
        "expression",
        "divine",
        "merely",
        "relative",
        "basest",
        "value",
        "depends",
        "solely",
        "manner",
        "human",
        "being",
        "take",
        "responsibility",
        "future",
        "open",
        "rather",
        "shift",
        "responsibility",
        "uncertain",
        "future",
        "particular",
        "religious",
        "practice",
        "dogma",
        "person",
        "must",
        "live",
        "wholly",
        "indeterminate",
        "becoming",
        "world",
        "human",
        "god",
        "scheler",
        "commitment",
        "distinctive",
        "nature",
        "human",
        "two",
        "irreducible",
        "movement",
        "weltgrund",
        "spirit",
        "lifeurge",
        "leaf",
        "final",
        "thought",
        "kind",
        "dualism",
        "readily",
        "aware",
        "argues",
        "new",
        "type",
        "dualism",
        "suffer",
        "problem",
        "introduced",
        "cartesian",
        "dualism",
        "mind",
        "body",
        "yet",
        "due",
        "part",
        "unfinished",
        "nature",
        "philosophical",
        "anthropology",
        "metaphysics",
        "left",
        "question",
        "answer",
        "relation",
        "life",
        "spirit",
        "instance",
        "spirit",
        "life",
        "interact",
        "life",
        "value",
        "blind",
        "spirit",
        "powerless",
        "human",
        "unity",
        "participates",
        "two",
        "essentially",
        "different",
        "movement",
        "clear",
        "two",
        "movement",
        "constituting",
        "unique",
        "place",
        "human",
        "interpenetrate",
        "one",
        "another",
        "discourse",
        "loving",
        "eros",
        "life",
        "agape",
        "spirit",
        "existence",
        "human",
        "being",
        "unification",
        "form",
        "loving",
        "afforded",
        "unique",
        "insight",
        "arise",
        "eros",
        "agape",
        "scheler",
        "attempt",
        "metaphysics",
        "speculative",
        "approach",
        "examination",
        "human",
        "existence",
        "speculative",
        "move",
        "motivated",
        "fuller",
        "understanding",
        "original",
        "loving",
        "openness",
        "human",
        "bear",
        "world"
    ]
}