{
    "main_text": "Philosophy of Art || The Poetical and the Critique of Art\n3.3 The Poetical and the Critique of Art\n\nFor Schlegel, in the same way as nature—the true\nexperience of nature— cannot be reduced to its mere\nphysical or external manifestations, both the work of art and the\nexperience it evokes are more than just the simple perception or the\nanalysis of its forms. Thus, he argues, the true work of art, in order\nto endure the shifting modes and fashions of time, must have something\nmore profound than just a beautiful form, in the same way a flower\nneeds its roots and cannot survive long without them. For Schlegel, as\nfor Schelling or Novalis, the attempt to understand the work of art as\nthe result of the conscious decisions of the artist alone would be\nmisleading, because there is always an unconscious element in every\nartistic creation. The work of art is a result of both conscious and\nunconscious forces. In other words, the artist’s\nintention is, to a great extent, irrelevant for the\nartistic product, and hence, cannot play a major role in the\nevaluation of the work itself. In his Lectures on Dramatic\nArt, Schlegel defines genius as someone being capable of the\n“almost unconscious choice of the highest degree of\nexcellence” (LDA: 5), and in an Athenaeum fragment he\nclaimed that “it is a distinguishable mark of poetical genius to\nknow a great deal more than he knows he knows” (SW: VIII, 15).\nThis does not mean that any sign of an ‘unconscious’\nchoice in the production of art is a sign of genius; what is\ncharacteristic about the great artist is that his/her\n‘unconscious’ choices seem attributable to a higher,\ndivine and conscious force. The extent to which the artist is\ncapable of transcending his/her more or less involuntary\nparticularities, i.e., the extent to which his/her choices seem to\nderive from an unconscious ability to select always the highest degree\nof excellence, determines the difference between style and\nmannerism. When the work of art appears as if all\nits elements had been consciously chosen by a power above and beyond\nthe artist, it has style; when the artist has not transcended\nhis/her individuality, then s/he is categorized as mannerist\n(SW: III, 309–312).\n\nThe essence of a work of art, the principle that all real\nworks of art have in common and what makes them more than a mere\naccumulation of particular elements, is what Schlegel called the\n‘poetical’. Consequently, the ability to grasp whatever\nis truly poetical in a specific work of art set the basis for\nhis methodological procedure in his art criticism. For Schlegel, a\ncriterion for evaluating a work of art is its capacity to extend\nitself “beyond the limits of reality into the region of a\ncreative fancy” (LDA: 107–108). On the other hand, the\npoetical aspect of a work of art depends on its capacity to mirror and\nto present (darstellen) eternally true ideas (LDA:\n18). But, as in many aesthetic texts from this period, it is not\nalways obvious which ‘ideas’ the work of art must seek to\nmirror. It seems these ‘ideas’ should be understood in a\nPlatonic sense, as they generally refer to great values or great\nideals such as beauty, greatness, and goodness.\n\nHowever, and partly due to his reluctance to consider the\nartist’s intentionality as being decisive in the comprehension\nof the work of art (which in some way prefigures the late Romantic\nideal of l’art pour l’art), Schlegel did not\nunderline a necessary moral purpose in aesthetic objects. And yet, for\nSchlegel, this did not imply that the contemplation and understanding\nof art should lose its moral aura. Quite to the contrary, for\nSchlegel, art has the power to elevate us above our ordinary\nencounters with the world, above the sorrows and daily troubles of\nlife. This is why he argued that the purpose of art could not be a\nmere imitation or reduplication of the world as it is,\nbecause in this case, apart from the fact that music, dance,\narchitecture, and so many other art forms become totally inexplicable,\nthe best works of art would be the ones that deceive the most, in the\nsense that the viewer would find himself prevented from contemplating\nthe work of art as a work of art. Clearly, if the purpose of\nart were to replicate nature (understood as an object rather than a\nsubject) the aesthetic objects would evoke no particular interest\nbeyond mere ornamentation. But, for Schlegel, both the\ncontemplation/critique and the production of art should be seen as the\nresult of creative activity. \n\nIn accordance with these theoretical assumptions, Schlegel was very\nnegative about naturalistic neo-classicist tendencies in art. He\npraised wholeness and poetical unity as well as originality in a work\nof art. For Schlegel, similarly as for Baumgarten, the magic of a work\nof art is that it creates and hence brings us into a different world,\nwith all its own internal coherence. It is in this sense that a work\nof art is organic and complete. The purpose of a work of art should\ntherefore not be to reflect the real world with naturalism, but rather\nto create its own world, which could never be a question of applying a\nset of rules and principles to a particular matter (paintings, words,\nmarble), such as classicist aesthetics seemed to suggest. The search\nfor naturalism and plausibility, in an attempt at producing the most\ntrue and real representation of reality, makes art lose its greatness,\nbeauty, and wonder.\n\nIn his Lectures on Dramatic Art, Schlegel praised the use of\nmasks in theatrical representations as well as those performers who\nmanaged to create an emotional distance between themselves, the\naudience and the role they were playing. Once more, art is not about\ndeceiving or hiding, but about the production or the creation of a\nworld within a world. This also explains Schlegel’s admiration\nof Old Comedy, because in this case the spectator is constantly forced\nto remain aware of the experience in which s/he is partaking, namely\nthe experience of the difference between reality and illusion. A\nsimilar reconsideration of comedy was also the basis for other\ncontemporary authors in Schlegel’s circle, such as Ludwig Tieck\nwith his version of the 17th century fairy tale Der\ngestiefelte Kater (Puss in Boots). Schlegel stresses\nthat, in contrast to tragedy (where the author needs to remain\ninvisible to guarantee the integrity of his/her fictional world); in\ncomedy, the gap between the different levels of reality and illusion,\nor rather, the very disintegration of the unity of the story becomes\nthe center of the play. As Schlegel puts it, in Old Comedy: “the\nwhole production was one entire jest within itself” (LDA: 108).\nIn Aristophanes’ plays, the chorus, which regularly interrupts\nthe course of the play to address the audience with reference to the\nstory (parabisis), the author and the people from the\naudience alike, virtually destroys all the elements and\ncharacteristics of tragedy: its seriousness as well as its harmonious\nunity is systematically parodied. Not only the scenes, not only the\npoetry, but also the tragic composition, the music, acting, and\ndancing, were object of a hilarious distortion. For Schlegel, this did\nnot mean that comedy should be understood as a derivative of tragedy;\non the contrary, he affirms it to be “a species of poetry as\nindependent and original as tragedy itself” (LDA: 108). In fact,\nA.W. Schlegel’s characterization of the distinction between the\ncharacter of Old Comedy and Greek tragedy would become a central\nreference in literary criticism.\n\nAmong all the different artistic manifestations, Schlegel considered\ndramatic poetry to be “the most entertaining of all\ndiversions” (LDA: 12). The fundamental reason for dramatic\npoetry’s being so engaging, as Schlegel points out, lies in the\nmimicry that is always involved in theatrical representations.\nSchlegel maintained that all works of art, and in particular, all\ntheatrical representations, are expression of the idiosyncrasies of\nthe country where they are produced. And although he succinctly\nsuggested that the existence of a theatrical tradition may be seen as\na symbol of a special intellectual and political environment, he also\nindicated that the enjoyment of mimicry per se is somehow constitutive\nof human beings (Flaherty 1994: 195). For Schlegel, children’s\ndelight in imitating their relatives is also expressive of man’s\nbasic psychological predisposition to mimicry (LDA: 18); a disposition\nwithout which man would not be able to enter the linguistic, let alone\nthe poetical and creative phases of his development (SW: VII, 117).\nDramatic poetry, he argued, is the representation of an\n“important” action, namely an action that has been purged\nof the petty and unnecessary details of real life; it is the\nperformance of a morally and intellectually exemplary action through\ndialogue. Schlegel’s placing of dramatic poetry in the highest\nrank amongst the arts hardly makes his position unique. What does\nrender him quite distinctive, rather, is the argument he gives, namely\nthat it produces the maximum enjoyment. This certainly contrasts with\nSchiller’s moralizing views. Schlegel was very aware of the\nnecessity for a play to be interesting and exciting for the audience:\nthe greatness of a play has to do with the way in which it creates a\ncertain tension or conflict that involves the audience. But, what\nmakes dramatic poetry different from a mere pantomime, what really\nelevates it above other human activities is, once again, its poetical\nelement, i.e., its capacity to mirror an idea or eternal truth.\nUltimately, this is also what determines the difference between\ntragedy and comedy. The tragic tone is given through a sincere\nmelancholy, a longing for and accepting of a “destiny soaring\nabove this earthly life”, whereas the main characteristic of\ncomedy is its “forgetfulness of all discouraging\nconsiderations” (LDA: 24). For Schlegel, the aim of tragedy is\nnot “to purify the passions by pity and terror” (LDA: 43),\nas Aristotle had said, but to elevate us “to the most dignified\nview of humanity” (LDA: 112). In fact, Schlegel’s analysis\nof Greek tragedy and his sharp rejection of Aristotle’s theory\nof tragedy were extremely influential. \n\nIn his Lectures on Dramatic Art Schlegel was very critical\ntowards the present state of German theatre (LDA: 438). However, apart\nfrom Shakespeare, Calderón with their ironic way of mixing the\ntragic with the comic (LDA: 175), and the ancient Greek, Schlegel also\npraised Lessing, Schiller, and Goethe for having “redeemed the\nGerman theatre from its long continued mediocrity” (LDA:\n424).\n",
    "section_title": "3.3 The Poetical and the Critique of Art",
    "entry_title": "August Wilhelm von Schlegel",
    "hierarchy_title": "August Wilhelm von Schlegel || Philosophy of Art || The Poetical and the Critique of Art",
    "tokenized_text": [
        "philosophy",
        "art",
        "poetical",
        "critique",
        "art",
        "poetical",
        "critique",
        "art",
        "schlegel",
        "way",
        "naturethe",
        "true",
        "experience",
        "nature",
        "reduced",
        "mere",
        "physical",
        "external",
        "manifestation",
        "work",
        "art",
        "experience",
        "evokes",
        "simple",
        "perception",
        "analysis",
        "form",
        "thus",
        "argues",
        "true",
        "work",
        "art",
        "order",
        "endure",
        "shifting",
        "mode",
        "fashion",
        "time",
        "must",
        "something",
        "profound",
        "beautiful",
        "form",
        "way",
        "flower",
        "need",
        "root",
        "survive",
        "long",
        "without",
        "schlegel",
        "schelling",
        "novalis",
        "attempt",
        "understand",
        "work",
        "art",
        "result",
        "conscious",
        "decision",
        "artist",
        "alone",
        "would",
        "misleading",
        "always",
        "unconscious",
        "element",
        "every",
        "artistic",
        "creation",
        "work",
        "art",
        "result",
        "conscious",
        "unconscious",
        "force",
        "word",
        "artist",
        "intention",
        "great",
        "extent",
        "irrelevant",
        "artistic",
        "product",
        "hence",
        "play",
        "major",
        "role",
        "evaluation",
        "work",
        "lecture",
        "dramatic",
        "art",
        "schlegel",
        "defines",
        "genius",
        "someone",
        "capable",
        "almost",
        "unconscious",
        "choice",
        "highest",
        "degree",
        "excellence",
        "lda",
        "athenaeum",
        "fragment",
        "claimed",
        "distinguishable",
        "mark",
        "poetical",
        "genius",
        "know",
        "great",
        "deal",
        "know",
        "know",
        "sw",
        "viii",
        "mean",
        "sign",
        "unconscious",
        "choice",
        "production",
        "art",
        "sign",
        "genius",
        "characteristic",
        "great",
        "artist",
        "hisher",
        "unconscious",
        "choice",
        "seem",
        "attributable",
        "higher",
        "divine",
        "conscious",
        "force",
        "extent",
        "artist",
        "capable",
        "transcending",
        "hisher",
        "le",
        "involuntary",
        "particularity",
        "ie",
        "extent",
        "hisher",
        "choice",
        "seem",
        "derive",
        "unconscious",
        "ability",
        "select",
        "always",
        "highest",
        "degree",
        "excellence",
        "determines",
        "difference",
        "style",
        "mannerism",
        "work",
        "art",
        "appears",
        "element",
        "consciously",
        "chosen",
        "power",
        "beyond",
        "artist",
        "style",
        "artist",
        "transcended",
        "hisher",
        "individuality",
        "she",
        "categorized",
        "mannerist",
        "sw",
        "iii",
        "essence",
        "work",
        "art",
        "principle",
        "real",
        "work",
        "art",
        "common",
        "make",
        "mere",
        "accumulation",
        "particular",
        "element",
        "schlegel",
        "called",
        "poetical",
        "consequently",
        "ability",
        "grasp",
        "whatever",
        "truly",
        "poetical",
        "specific",
        "work",
        "art",
        "set",
        "basis",
        "methodological",
        "procedure",
        "art",
        "criticism",
        "schlegel",
        "criterion",
        "evaluating",
        "work",
        "art",
        "capacity",
        "extend",
        "beyond",
        "limit",
        "reality",
        "region",
        "creative",
        "fancy",
        "lda",
        "hand",
        "poetical",
        "aspect",
        "work",
        "art",
        "depends",
        "capacity",
        "mirror",
        "present",
        "darstellen",
        "eternally",
        "true",
        "idea",
        "lda",
        "many",
        "aesthetic",
        "text",
        "period",
        "always",
        "obvious",
        "idea",
        "work",
        "art",
        "must",
        "seek",
        "mirror",
        "seems",
        "idea",
        "understood",
        "platonic",
        "sense",
        "generally",
        "refer",
        "great",
        "value",
        "great",
        "ideal",
        "beauty",
        "greatness",
        "goodness",
        "however",
        "partly",
        "due",
        "reluctance",
        "consider",
        "artist",
        "intentionality",
        "decisive",
        "comprehension",
        "work",
        "art",
        "way",
        "prefigures",
        "late",
        "romantic",
        "ideal",
        "l",
        "art",
        "pour",
        "l",
        "art",
        "schlegel",
        "underline",
        "necessary",
        "moral",
        "purpose",
        "aesthetic",
        "object",
        "yet",
        "schlegel",
        "imply",
        "contemplation",
        "understanding",
        "art",
        "lose",
        "moral",
        "aura",
        "quite",
        "contrary",
        "schlegel",
        "art",
        "power",
        "elevate",
        "u",
        "ordinary",
        "encounter",
        "world",
        "sorrow",
        "daily",
        "trouble",
        "life",
        "argued",
        "purpose",
        "art",
        "could",
        "mere",
        "imitation",
        "reduplication",
        "world",
        "case",
        "apart",
        "fact",
        "music",
        "dance",
        "architecture",
        "many",
        "art",
        "form",
        "become",
        "totally",
        "inexplicable",
        "best",
        "work",
        "art",
        "would",
        "one",
        "deceive",
        "sense",
        "viewer",
        "would",
        "find",
        "prevented",
        "contemplating",
        "work",
        "art",
        "work",
        "art",
        "clearly",
        "purpose",
        "art",
        "replicate",
        "nature",
        "understood",
        "object",
        "rather",
        "subject",
        "aesthetic",
        "object",
        "would",
        "evoke",
        "particular",
        "interest",
        "beyond",
        "mere",
        "ornamentation",
        "schlegel",
        "contemplationcritique",
        "production",
        "art",
        "seen",
        "result",
        "creative",
        "activity",
        "accordance",
        "theoretical",
        "assumption",
        "schlegel",
        "negative",
        "naturalistic",
        "neoclassicist",
        "tendency",
        "art",
        "praised",
        "wholeness",
        "poetical",
        "unity",
        "well",
        "originality",
        "work",
        "art",
        "schlegel",
        "similarly",
        "baumgarten",
        "magic",
        "work",
        "art",
        "creates",
        "hence",
        "brings",
        "u",
        "different",
        "world",
        "internal",
        "coherence",
        "sense",
        "work",
        "art",
        "organic",
        "complete",
        "purpose",
        "work",
        "art",
        "therefore",
        "reflect",
        "real",
        "world",
        "naturalism",
        "rather",
        "create",
        "world",
        "could",
        "never",
        "question",
        "applying",
        "set",
        "rule",
        "principle",
        "particular",
        "matter",
        "painting",
        "word",
        "marble",
        "classicist",
        "aesthetic",
        "seemed",
        "suggest",
        "search",
        "naturalism",
        "plausibility",
        "attempt",
        "producing",
        "true",
        "real",
        "representation",
        "reality",
        "make",
        "art",
        "lose",
        "greatness",
        "beauty",
        "wonder",
        "lecture",
        "dramatic",
        "art",
        "schlegel",
        "praised",
        "use",
        "mask",
        "theatrical",
        "representation",
        "well",
        "performer",
        "managed",
        "create",
        "emotional",
        "distance",
        "audience",
        "role",
        "playing",
        "art",
        "deceiving",
        "hiding",
        "production",
        "creation",
        "world",
        "within",
        "world",
        "also",
        "explains",
        "schlegel",
        "admiration",
        "old",
        "comedy",
        "case",
        "spectator",
        "constantly",
        "forced",
        "remain",
        "aware",
        "experience",
        "she",
        "partaking",
        "namely",
        "experience",
        "difference",
        "reality",
        "illusion",
        "similar",
        "reconsideration",
        "comedy",
        "also",
        "basis",
        "contemporary",
        "author",
        "schlegel",
        "circle",
        "ludwig",
        "tieck",
        "version",
        "th",
        "century",
        "fairy",
        "tale",
        "der",
        "gestiefelte",
        "kater",
        "pus",
        "boot",
        "schlegel",
        "stress",
        "contrast",
        "tragedy",
        "author",
        "need",
        "remain",
        "invisible",
        "guarantee",
        "integrity",
        "hisher",
        "fictional",
        "world",
        "comedy",
        "gap",
        "different",
        "level",
        "reality",
        "illusion",
        "rather",
        "disintegration",
        "unity",
        "story",
        "becomes",
        "center",
        "play",
        "schlegel",
        "put",
        "old",
        "comedy",
        "whole",
        "production",
        "one",
        "entire",
        "jest",
        "within",
        "lda",
        "aristophanes",
        "play",
        "chorus",
        "regularly",
        "interrupt",
        "course",
        "play",
        "address",
        "audience",
        "reference",
        "story",
        "parabisis",
        "author",
        "people",
        "audience",
        "alike",
        "virtually",
        "destroys",
        "element",
        "characteristic",
        "tragedy",
        "seriousness",
        "well",
        "harmonious",
        "unity",
        "systematically",
        "parodied",
        "scene",
        "poetry",
        "also",
        "tragic",
        "composition",
        "music",
        "acting",
        "dancing",
        "object",
        "hilarious",
        "distortion",
        "schlegel",
        "mean",
        "comedy",
        "understood",
        "derivative",
        "tragedy",
        "contrary",
        "affirms",
        "specie",
        "poetry",
        "independent",
        "original",
        "tragedy",
        "lda",
        "fact",
        "aw",
        "schlegel",
        "characterization",
        "distinction",
        "character",
        "old",
        "comedy",
        "greek",
        "tragedy",
        "would",
        "become",
        "central",
        "reference",
        "literary",
        "criticism",
        "among",
        "different",
        "artistic",
        "manifestation",
        "schlegel",
        "considered",
        "dramatic",
        "poetry",
        "entertaining",
        "diversion",
        "lda",
        "fundamental",
        "reason",
        "dramatic",
        "poetry",
        "engaging",
        "schlegel",
        "point",
        "lie",
        "mimicry",
        "always",
        "involved",
        "theatrical",
        "representation",
        "schlegel",
        "maintained",
        "work",
        "art",
        "particular",
        "theatrical",
        "representation",
        "expression",
        "idiosyncrasy",
        "country",
        "produced",
        "although",
        "succinctly",
        "suggested",
        "existence",
        "theatrical",
        "tradition",
        "may",
        "seen",
        "symbol",
        "special",
        "intellectual",
        "political",
        "environment",
        "also",
        "indicated",
        "enjoyment",
        "mimicry",
        "per",
        "se",
        "somehow",
        "constitutive",
        "human",
        "being",
        "flaherty",
        "schlegel",
        "child",
        "delight",
        "imitating",
        "relative",
        "also",
        "expressive",
        "man",
        "basic",
        "psychological",
        "predisposition",
        "mimicry",
        "lda",
        "disposition",
        "without",
        "man",
        "would",
        "able",
        "enter",
        "linguistic",
        "let",
        "alone",
        "poetical",
        "creative",
        "phase",
        "development",
        "sw",
        "vii",
        "dramatic",
        "poetry",
        "argued",
        "representation",
        "important",
        "action",
        "namely",
        "action",
        "purged",
        "petty",
        "unnecessary",
        "detail",
        "real",
        "life",
        "performance",
        "morally",
        "intellectually",
        "exemplary",
        "action",
        "dialogue",
        "schlegel",
        "placing",
        "dramatic",
        "poetry",
        "highest",
        "rank",
        "amongst",
        "art",
        "hardly",
        "make",
        "position",
        "unique",
        "render",
        "quite",
        "distinctive",
        "rather",
        "argument",
        "give",
        "namely",
        "produce",
        "maximum",
        "enjoyment",
        "certainly",
        "contrast",
        "schiller",
        "moralizing",
        "view",
        "schlegel",
        "aware",
        "necessity",
        "play",
        "interesting",
        "exciting",
        "audience",
        "greatness",
        "play",
        "way",
        "creates",
        "certain",
        "tension",
        "conflict",
        "involves",
        "audience",
        "make",
        "dramatic",
        "poetry",
        "different",
        "mere",
        "pantomime",
        "really",
        "elevates",
        "human",
        "activity",
        "poetical",
        "element",
        "ie",
        "capacity",
        "mirror",
        "idea",
        "eternal",
        "truth",
        "ultimately",
        "also",
        "determines",
        "difference",
        "tragedy",
        "comedy",
        "tragic",
        "tone",
        "given",
        "sincere",
        "melancholy",
        "longing",
        "accepting",
        "destiny",
        "soaring",
        "earthly",
        "life",
        "whereas",
        "main",
        "characteristic",
        "comedy",
        "forgetfulness",
        "discouraging",
        "consideration",
        "lda",
        "schlegel",
        "aim",
        "tragedy",
        "purify",
        "passion",
        "pity",
        "terror",
        "lda",
        "aristotle",
        "said",
        "elevate",
        "u",
        "dignified",
        "view",
        "humanity",
        "lda",
        "fact",
        "schlegel",
        "analysis",
        "greek",
        "tragedy",
        "sharp",
        "rejection",
        "aristotle",
        "theory",
        "tragedy",
        "extremely",
        "influential",
        "lecture",
        "dramatic",
        "art",
        "schlegel",
        "critical",
        "towards",
        "present",
        "state",
        "german",
        "theatre",
        "lda",
        "however",
        "apart",
        "shakespeare",
        "calderón",
        "ironic",
        "way",
        "mixing",
        "tragic",
        "comic",
        "lda",
        "ancient",
        "greek",
        "schlegel",
        "also",
        "praised",
        "lessing",
        "schiller",
        "goethe",
        "redeemed",
        "german",
        "theatre",
        "long",
        "continued",
        "mediocrity",
        "lda"
    ]
}