{
    "main_text": "Life and Works\n1. Life and Works\n\nFriedrich Daniel Ernst Schleiermacher (1768–1834) was born in\nBreslau as the son of a clergyman of the reformed church. His earlier\neducation took place in institutions of the Moravian Brethren\n(Herrnhuter), a strict pietist sect. However, while there he also\npursued broader humanistic interests. Largely as a result of\nskepticism about certain Christian doctrines taught there, he moved to\nthe more liberal University of Halle in 1787. However, he continued in\ntheology (with philosophy and classical philology as minor fields). He\npassed his theological examinations in Berlin in 1790. This was\nfollowed by a period as a private tutor, which ended in 1793, partly,\nit seems, due to friction caused by his sympathy with the French\nRevolution, to which his employer was opposed.\n\nDuring the periods just mentioned he was heavily occupied with the\nstudy and criticism of Kant’s philosophy. This work culminated\nin several unpublished essays—On the Highest Good\n(1789), On What Gives Value to Life (1792–3), and\nOn Freedom (1790–3)—which rejected Kant’s\nconception that the “highest good [summum bonum]”\nrequires an apportioning of happiness to moral desert, and\nKant’s connected doctrine of the “postulates” of an\nafterlife of the soul and God, while also developing an anti-Kantian\ntheory of the thoroughgoing causal determination of human action and\nof the compatibility of this with moral responsibility. In\n1793–4 he wrote two essays about Spinoza: Spinozism and\nBrief Presentation of the Spinozistic System. A major\ncatalyst for these essays was Jacobi’s work On the Doctrine\nof Spinoza, in Letters to Mr. Moses Mendelssohn (1785), which had\nbeen highly critical of Spinozism. But they also show the influence of\nHerder’s work God: Some Conversations (1787), which\nchampioned a modified form of Spinozism. In his two essays\nSchleiermacher himself embraces a modified form of Spinoza’s\nmonism similar in character to Herder’s (in particular, like\nHerder, he is inclined to substitute for Spinoza’s single\nsubstance the more active principle of a single fundamental\nforce). He also attempts to defend this position by showing\nit to be reconcilable with central features of Kant’s\ntheoretical philosophy (notably, Kant’s doctrine of things in\nthemselves). This neo-Spinozistic position (developed before\nHölderlin’s in Judgment and Being or\nNovalis’ in Fichte-Studies, it should be noted) would\nsubsequently be fundamental to Schleiermacher’s most important\nwork in the philosophy of religion, On Religion: Speeches to Its\nCultured Despisers (1799). However, in thus rejecting\nJacobi’s anti-Spinozism, Schleiermacher seems also to have\nabsorbed something from Jacobi that would be equally important for his\nfuture philosophy of religion: the idea (for which his pietist\nbackground no doubt made him receptive) that we enjoy a sort of\nimmediate intuition or feeling of God.\n\nDuring the period 1794–6 Schleiermacher served as a pastor in\nLandsberg. In 1796 he moved to Berlin, where he became chaplain to a\nhospital. In Berlin he met Friedrich and August Wilhelm Schlegel, as\nwell as other romantics, became deeply engaged in the formation of the\nromantic movement, and collaborated with the Schlegel brothers on the\nshort-lived but important literary journal Athenaeum\n(1798–1800). Among Schleiermacher’s contributions to this\njournal was the short feminist piece Idea for a Catechism of\nReason for Noble Ladies (1798). During the period 1797–9,\nhe shared a house with Friedrich Schlegel. Encouraged by the romantic\ncircle to write a statement of his religious views, in 1799 he\npublished his most important and radical work in the philosophy of\nreligion, On Religion: Speeches to Its Cultured Despisers\n(revised editions followed in 1806, 1821, the latter including\nsignificant “explanations”, and 1831). This work sought to\nsave religion in the eyes of its cultured despisers (prominent among\nthem some of the romantics, including Friedrich Schlegel) by,\ninter alia, arguing that human immortality and even God are\ninessential to religion; diagnosing and excusing current\nreligion’s more off-putting features in terms of its corruption\nby worldly bourgeois culture and state-interference; and arguing that\nthere are an endless multiplicity of valid forms of religion. The book\nwon Schleiermacher a national reputation. In the same year (1799) he\nalso published an essay on the situation of the Jews in Prussia,\nLetters on the Occasion of the Political-Theological Task and the\nOpen Letter of Jewish Householders. In this work he rejected an\nexpedient that had been proposed for ameliorating the condition of the\nJews in Prussia of effecting their civil assimilation through baptism\n(which would, he argues, harm both Judaism and Christianity) and\ninstead advocated full civil rights for Jews (on certain reasonable\nconditions). The same year also saw Schleiermacher’s composition\nof the interesting short essay Toward a Theory of Sociable\nConduct, which is important as his first significant discussion\nof the art of conversation (an art that would later be central to his\ndiscipline of dialectics). Finally, 1799 also saw his publication of a\nvery critical review of Kant’s Anthropology. The review\nin particular implies criticism of Kant for his dualistic philosophy\nof mind and his superficial, disparaging attitude toward women and\nother peoples.\n\nDuring the following several years Schleiermacher complemented On\nReligion with two substantial publications that were more ethical\nin orientation: the especially important Soliloquies (1800;\nsecond edition 1810) and the Outlines of a Critique of Previous\nEthical Theory (1803). In 1800 he also defended his friend\nFriedrich Schlegel’s controversial and arguably pornographic\nnovel Lucinde from the same year in his Confidential\nLetters Concerning Friedrich Schlegel’s Lucinde—a\nshared feminism constituting a large part of his reason for\nsympathizing with Schlegel’s book. During the period\n1799–1804 Schleiermacher developed with Schlegel the project of\ntranslating Plato’s dialogues. As time went on, however,\nSchlegel left this work to Schleiermacher, which contributed to\nincreasingly difficult relations between the two men after 1800.\nSchleiermacher’s translations appeared during the period\n1804–28 (though not quite all of the dialogues were translated\nin the end), and are still widely used and admired today.\n\nWhile in Berlin Schleiermacher developed romantic attachments to two\nmarried women, Henriette Herz and Eleonore Grunow—the latter of\nwhich attachments led to scandal and unhappiness, eventually causing\nSchleiermacher to leave the city. He spent the years 1802–4 in\nStolpe. By 1804 he was teaching at Halle University. During the period\n1804–5 he began lecturing on ethics (as he would do again\nrepeatedly until 1832). In 1805 he also began delivering his famous\nand important lectures on hermeneutics (which he repeated regularly\nuntil 1833). In 1806 he began lecturing on the history of philosophy,\nin particular, ancient philosophy (adding lectures on modern\nphilosophy in 1810, and then continuing to lecture on the history of\nphilosophy repeatedly in subsequent years). In 1806 he also published\nthe short book Christmas Eve, a literary work that explores\nthe meaning of Christian love by depicting a German family’s\ncelebration of Christmas Eve. This is in keeping with On\nReligion’s ideal that (Christian) religion should be\nfamily- rather than state-centered. In 1806–7 he left Halle as a\nresult of the French occupation, and moved back to Berlin. From this\ntime on he began actively promoting German resistance to the French\noccupation and the cause of German unity. In 1808 he published\nOccasional Thoughts on Universities in a German Spirit, together\nwith an Appendix on One about to be Founded, a work written in\nconnection with plans for founding a new university in Berlin (now\nknown as the Humboldt University), a project to which Wilhelm von\nHumboldt likewise contributed theoretically soon afterwards as well as\nplaying the leading role in its practical implementation. In 1808\nSchleiermacher married a young widow, Henriette von Willich, with whom\nhe had several children. In 1808–9 he became preacher at the\nDreifaltigkeitskirche, in 1810 professor of theology at the University\nof Berlin, and by 1811 also a member of the Berlin Academy of\nSciences.\n\nAfter becoming a member of the Academy he often delivered addresses\nbefore it. Among these several on ethics, one on translation from\n1813, one on the philosophy of Socrates from 1815, and one on\nLeibniz’s idea of a universal language from 1831 are especially\nsignificant.\n\nIn 1811 he lectured on dialectics for the first time (as he would do\nagain regularly until his death, at which time he was in the early\nstages of preparing a version for publication). In 1813 he delivered\nas an address, and then published as an essay, On the Different\nMethods of Translation—an extremely important work in\ntranslation theory deeply informed by his own experience as a\ntranslator. In 1813–14 he lectured on pedagogy, or the\nphilosophy of education, for the first time (as he would do on two\nsubsequent occasions: 1820–1 and 1826). In 1818 he lectured on\npsychology for the first time (as he would again repeatedly until\n1833–4). In 1819 he lectured on aesthetics for the first time\n(as he subsequently did on two further occasions, the last of them in\n1832–3). In the same year he also began lecturing on the life of\nJesus (as he did again on four further occasions over the following\ntwelve years)—thereby inaugurating an important genre of\nliterature on this subject in the nineteenth century.\n\nIn 1821–2 he published his major work of systematic theology,\nThe Christian Faith (revised edition 1830–1). In 1829\nhe published two open letters on this work (nominally addressed to his\nfriend Lücke), in which he discusses it and central issues in the\nphilosophy of religion and theology relating to it in a concise and\nlucid way.\n\nSchleiermacher died in 1834. As can be seen even from this brief\nsketch of his life and works, a large proportion of his career was\ntaken up with the philosophy of religion and theology. However, from\nthe secular standpoint of modern philosophy it is probably his work in\nsuch areas as hermeneutics (i.e., the theory of interpretation) and\nthe theory of translation that is most important. Accordingly, this\narticle will begin with these more interesting areas of his thought,\nonly turning to his philosophy of religion briefly at the end.\n",
    "section_title": "1. Life and Works",
    "entry_title": "Friedrich Daniel Ernst Schleiermacher",
    "hierarchy_title": "Friedrich Daniel Ernst Schleiermacher || Life and Works",
    "tokenized_text": [
        "life",
        "work",
        "life",
        "work",
        "friedrich",
        "daniel",
        "ernst",
        "schleiermacher",
        "born",
        "breslau",
        "son",
        "clergyman",
        "reformed",
        "church",
        "earlier",
        "education",
        "took",
        "place",
        "institution",
        "moravian",
        "brother",
        "herrnhuter",
        "strict",
        "pietist",
        "sect",
        "however",
        "also",
        "pursued",
        "broader",
        "humanistic",
        "interest",
        "largely",
        "result",
        "skepticism",
        "certain",
        "christian",
        "doctrine",
        "taught",
        "moved",
        "liberal",
        "university",
        "halle",
        "however",
        "continued",
        "theology",
        "philosophy",
        "classical",
        "philology",
        "minor",
        "field",
        "passed",
        "theological",
        "examination",
        "berlin",
        "followed",
        "period",
        "private",
        "tutor",
        "ended",
        "partly",
        "seems",
        "due",
        "friction",
        "caused",
        "sympathy",
        "french",
        "revolution",
        "employer",
        "opposed",
        "period",
        "mentioned",
        "heavily",
        "occupied",
        "study",
        "criticism",
        "kant",
        "philosophy",
        "work",
        "culminated",
        "several",
        "unpublished",
        "essayson",
        "highest",
        "good",
        "give",
        "value",
        "life",
        "freedom",
        "which",
        "rejected",
        "kant",
        "conception",
        "highest",
        "good",
        "summum",
        "bonum",
        "requires",
        "apportioning",
        "happiness",
        "moral",
        "desert",
        "kant",
        "connected",
        "doctrine",
        "postulate",
        "afterlife",
        "soul",
        "god",
        "also",
        "developing",
        "antikantian",
        "theory",
        "thoroughgoing",
        "causal",
        "determination",
        "human",
        "action",
        "compatibility",
        "moral",
        "responsibility",
        "wrote",
        "two",
        "essay",
        "spinoza",
        "spinozism",
        "brief",
        "presentation",
        "spinozistic",
        "system",
        "major",
        "catalyst",
        "essay",
        "jacobi",
        "work",
        "doctrine",
        "spinoza",
        "letter",
        "mr",
        "moses",
        "mendelssohn",
        "highly",
        "critical",
        "spinozism",
        "also",
        "show",
        "influence",
        "herder",
        "work",
        "god",
        "conversation",
        "championed",
        "modified",
        "form",
        "spinozism",
        "two",
        "essay",
        "schleiermacher",
        "embrace",
        "modified",
        "form",
        "spinoza",
        "monism",
        "similar",
        "character",
        "herder",
        "particular",
        "like",
        "herder",
        "inclined",
        "substitute",
        "spinoza",
        "single",
        "substance",
        "active",
        "principle",
        "single",
        "fundamental",
        "force",
        "also",
        "attempt",
        "defend",
        "position",
        "showing",
        "reconcilable",
        "central",
        "feature",
        "kant",
        "theoretical",
        "philosophy",
        "notably",
        "kant",
        "doctrine",
        "thing",
        "neospinozistic",
        "position",
        "developed",
        "hölderlin",
        "judgment",
        "novalis",
        "fichtestudies",
        "noted",
        "would",
        "subsequently",
        "fundamental",
        "schleiermacher",
        "important",
        "work",
        "philosophy",
        "religion",
        "religion",
        "speech",
        "cultured",
        "despisers",
        "however",
        "thus",
        "rejecting",
        "jacobi",
        "antispinozism",
        "schleiermacher",
        "seems",
        "also",
        "absorbed",
        "something",
        "jacobi",
        "would",
        "equally",
        "important",
        "future",
        "philosophy",
        "religion",
        "idea",
        "pietist",
        "background",
        "doubt",
        "made",
        "receptive",
        "enjoy",
        "sort",
        "immediate",
        "intuition",
        "feeling",
        "god",
        "period",
        "schleiermacher",
        "served",
        "pastor",
        "landsberg",
        "moved",
        "berlin",
        "became",
        "chaplain",
        "hospital",
        "berlin",
        "met",
        "friedrich",
        "august",
        "wilhelm",
        "schlegel",
        "well",
        "romantic",
        "became",
        "deeply",
        "engaged",
        "formation",
        "romantic",
        "movement",
        "collaborated",
        "schlegel",
        "brother",
        "shortlived",
        "important",
        "literary",
        "journal",
        "athenaeum",
        "among",
        "schleiermacher",
        "contribution",
        "journal",
        "short",
        "feminist",
        "piece",
        "idea",
        "catechism",
        "reason",
        "noble",
        "lady",
        "period",
        "shared",
        "house",
        "friedrich",
        "schlegel",
        "encouraged",
        "romantic",
        "circle",
        "write",
        "statement",
        "religious",
        "view",
        "published",
        "important",
        "radical",
        "work",
        "philosophy",
        "religion",
        "religion",
        "speech",
        "cultured",
        "despisers",
        "revised",
        "edition",
        "followed",
        "latter",
        "including",
        "significant",
        "explanation",
        "work",
        "sought",
        "save",
        "religion",
        "eye",
        "cultured",
        "despisers",
        "prominent",
        "among",
        "romantic",
        "including",
        "friedrich",
        "schlegel",
        "inter",
        "alia",
        "arguing",
        "human",
        "immortality",
        "even",
        "god",
        "inessential",
        "religion",
        "diagnosing",
        "excusing",
        "current",
        "religion",
        "offputting",
        "feature",
        "term",
        "corruption",
        "worldly",
        "bourgeois",
        "culture",
        "stateinterference",
        "arguing",
        "endless",
        "multiplicity",
        "valid",
        "form",
        "religion",
        "book",
        "schleiermacher",
        "national",
        "reputation",
        "year",
        "also",
        "published",
        "essay",
        "situation",
        "jew",
        "prussia",
        "letter",
        "occasion",
        "politicaltheological",
        "task",
        "open",
        "letter",
        "jewish",
        "householder",
        "work",
        "rejected",
        "expedient",
        "proposed",
        "ameliorating",
        "condition",
        "jew",
        "prussia",
        "effecting",
        "civil",
        "assimilation",
        "baptism",
        "would",
        "argues",
        "harm",
        "judaism",
        "christianity",
        "instead",
        "advocated",
        "full",
        "civil",
        "right",
        "jew",
        "certain",
        "reasonable",
        "condition",
        "year",
        "also",
        "saw",
        "schleiermacher",
        "composition",
        "interesting",
        "short",
        "essay",
        "toward",
        "theory",
        "sociable",
        "conduct",
        "important",
        "first",
        "significant",
        "discussion",
        "art",
        "conversation",
        "art",
        "would",
        "later",
        "central",
        "discipline",
        "dialectic",
        "finally",
        "also",
        "saw",
        "publication",
        "critical",
        "review",
        "kant",
        "anthropology",
        "review",
        "particular",
        "implies",
        "criticism",
        "kant",
        "dualistic",
        "philosophy",
        "mind",
        "superficial",
        "disparaging",
        "attitude",
        "toward",
        "woman",
        "people",
        "following",
        "several",
        "year",
        "schleiermacher",
        "complemented",
        "religion",
        "two",
        "substantial",
        "publication",
        "ethical",
        "orientation",
        "especially",
        "important",
        "soliloquy",
        "second",
        "edition",
        "outline",
        "critique",
        "previous",
        "ethical",
        "theory",
        "also",
        "defended",
        "friend",
        "friedrich",
        "schlegel",
        "controversial",
        "arguably",
        "pornographic",
        "novel",
        "lucinde",
        "year",
        "confidential",
        "letter",
        "concerning",
        "friedrich",
        "schlegel",
        "lucindea",
        "shared",
        "feminism",
        "constituting",
        "large",
        "part",
        "reason",
        "sympathizing",
        "schlegel",
        "book",
        "period",
        "schleiermacher",
        "developed",
        "schlegel",
        "project",
        "translating",
        "plato",
        "dialogue",
        "time",
        "went",
        "however",
        "schlegel",
        "left",
        "work",
        "schleiermacher",
        "contributed",
        "increasingly",
        "difficult",
        "relation",
        "two",
        "men",
        "schleiermacher",
        "translation",
        "appeared",
        "period",
        "though",
        "quite",
        "dialogue",
        "translated",
        "end",
        "still",
        "widely",
        "used",
        "admired",
        "today",
        "berlin",
        "schleiermacher",
        "developed",
        "romantic",
        "attachment",
        "two",
        "married",
        "woman",
        "henriette",
        "herz",
        "eleonore",
        "grunowthe",
        "latter",
        "attachment",
        "led",
        "scandal",
        "unhappiness",
        "eventually",
        "causing",
        "schleiermacher",
        "leave",
        "city",
        "spent",
        "year",
        "stolpe",
        "teaching",
        "halle",
        "university",
        "period",
        "began",
        "lecturing",
        "ethic",
        "would",
        "repeatedly",
        "also",
        "began",
        "delivering",
        "famous",
        "important",
        "lecture",
        "hermeneutics",
        "repeated",
        "regularly",
        "began",
        "lecturing",
        "history",
        "philosophy",
        "particular",
        "ancient",
        "philosophy",
        "adding",
        "lecture",
        "modern",
        "philosophy",
        "continuing",
        "lecture",
        "history",
        "philosophy",
        "repeatedly",
        "subsequent",
        "year",
        "also",
        "published",
        "short",
        "book",
        "christmas",
        "eve",
        "literary",
        "work",
        "explores",
        "meaning",
        "christian",
        "love",
        "depicting",
        "german",
        "family",
        "celebration",
        "christmas",
        "eve",
        "keeping",
        "religion",
        "ideal",
        "christian",
        "religion",
        "family",
        "rather",
        "statecentered",
        "left",
        "halle",
        "result",
        "french",
        "occupation",
        "moved",
        "back",
        "berlin",
        "time",
        "began",
        "actively",
        "promoting",
        "german",
        "resistance",
        "french",
        "occupation",
        "cause",
        "german",
        "unity",
        "published",
        "occasional",
        "thought",
        "university",
        "german",
        "spirit",
        "together",
        "appendix",
        "one",
        "founded",
        "work",
        "written",
        "connection",
        "plan",
        "founding",
        "new",
        "university",
        "berlin",
        "known",
        "humboldt",
        "university",
        "project",
        "wilhelm",
        "von",
        "humboldt",
        "likewise",
        "contributed",
        "theoretically",
        "soon",
        "afterwards",
        "well",
        "playing",
        "leading",
        "role",
        "practical",
        "implementation",
        "schleiermacher",
        "married",
        "young",
        "widow",
        "henriette",
        "von",
        "willich",
        "several",
        "child",
        "became",
        "preacher",
        "dreifaltigkeitskirche",
        "professor",
        "theology",
        "university",
        "berlin",
        "also",
        "member",
        "berlin",
        "academy",
        "science",
        "becoming",
        "member",
        "academy",
        "often",
        "delivered",
        "address",
        "among",
        "several",
        "ethic",
        "one",
        "translation",
        "one",
        "philosophy",
        "socrates",
        "one",
        "leibniz",
        "idea",
        "universal",
        "language",
        "especially",
        "significant",
        "lectured",
        "dialectic",
        "first",
        "time",
        "would",
        "regularly",
        "death",
        "time",
        "early",
        "stage",
        "preparing",
        "version",
        "publication",
        "delivered",
        "address",
        "published",
        "essay",
        "different",
        "method",
        "translationan",
        "extremely",
        "important",
        "work",
        "translation",
        "theory",
        "deeply",
        "informed",
        "experience",
        "translator",
        "lectured",
        "pedagogy",
        "philosophy",
        "education",
        "first",
        "time",
        "would",
        "two",
        "subsequent",
        "occasion",
        "lectured",
        "psychology",
        "first",
        "time",
        "would",
        "repeatedly",
        "lectured",
        "aesthetic",
        "first",
        "time",
        "subsequently",
        "two",
        "occasion",
        "last",
        "year",
        "also",
        "began",
        "lecturing",
        "life",
        "jesus",
        "four",
        "occasion",
        "following",
        "twelve",
        "year",
        "thereby",
        "inaugurating",
        "important",
        "genre",
        "literature",
        "subject",
        "nineteenth",
        "century",
        "published",
        "major",
        "work",
        "systematic",
        "theology",
        "christian",
        "faith",
        "revised",
        "edition",
        "published",
        "two",
        "open",
        "letter",
        "work",
        "nominally",
        "addressed",
        "friend",
        "lücke",
        "discus",
        "central",
        "issue",
        "philosophy",
        "religion",
        "theology",
        "relating",
        "concise",
        "lucid",
        "way",
        "schleiermacher",
        "died",
        "seen",
        "even",
        "brief",
        "sketch",
        "life",
        "work",
        "large",
        "proportion",
        "career",
        "taken",
        "philosophy",
        "religion",
        "theology",
        "however",
        "secular",
        "standpoint",
        "modern",
        "philosophy",
        "probably",
        "work",
        "area",
        "hermeneutics",
        "ie",
        "theory",
        "interpretation",
        "theory",
        "translation",
        "important",
        "accordingly",
        "article",
        "begin",
        "interesting",
        "area",
        "thought",
        "turning",
        "philosophy",
        "religion",
        "briefly",
        "end"
    ]
}