{
    "main_text": "Relativity\n6. Relativity\n\n\nIn correspondence with Einstein, Schlick explained that his\nmonograph on Space and Time in Contemporary Physics was\n“less a representation of the general theory itself than a\nthorough-going elucidation of the thesis that space and time have now\nforfeited all objectivity in physics” (Schlick 1917). Of\ncourse, Schlick is referring to Einstein’s remark in his 1916\npaper on the General Theory, that the admission of arbitrary\ncoordinative transformations “removes the last vestige of\nphysical objectivity from space and time” (Einstein 1916,\n117). In his monograph, Schlick first described the differences\nbetween the space of the older physics and the space postulated by\nEinstein. In Newtonian physics (as well as the physics of the\nSpecial Theory), all measurement was founded on the notion of a rigid\nrod and space was still regarded as Euclidean so long as measurements\nwere made within the same coordinate system. Thus, in the older\nphysics, space was conceived as complete with metrical properties,\ndefined by rigid rods which possess the same length in any place at any\ntime. It is particularly to be noted that the metrical properties\nof space were regarded as independent of the distribution of bodies in\nspace and their gravitational fields. It is precisely these\nconditions that are changed in General Relativity. Rather, in the\nGeneral Theory, the principle of general covariance implies that\nproperties cannot be ascribed to space independently of any\nconsideration of the things in it. Einstein showed that\nnon-Euclidean methods of determining measurements must be used in the\npresence of a gravitational field and this follows from the insight\nthat it is the things in space which give it a particular structure.\nThe result is a complete relativization of space (Schlick 2006a, Sec.\nVII). \n\n\nIn classical mechanics, it was decided by convention (see above)\nthat a rigid rod was the same length throughout space and this\nconvention was modified in Special Relativity. But in General\nRelativity, the length of a rigid rod may also depend on its place and\nposition in such a way that consistency with Special Relativity is\nmaintained. Thus, to maintain the general postulate of\nrelativity, it is necessary to reduce the objective spatial structure\nof the earlier physics to a non-intuitive topology. This is a\nradical departure from the objectivity of the spatial structure of\nthese earlier systems, which was entirely an artifact of their fixed\nmetrical structure. But in Relativity Theory, the resulting\nconceptual construction admits of distinct metrical structures in\ndifferent regions depending on the gravitational field in that region.\nAs Schlick reflects in the closing pages of Space and Time\n…, the very possibility of the objectivity of this\nconceptual construction depends entirely on the method of\npoint-coincidences. Any features of the world-picture which do not\ncontribute to the systematization of point-coincidences are not\nphysically objective. And all world-pictures which contain laws\ngoverning point-coincidences are thoroughly equivalent. \nFurthermore, since any functional, single-valued deformation of the\nworld-picture leaves all point-coincidences undisturbed, the equations\nof physics retain their form under such transformations, implying that\nthey are covariant under all substitutions. These substitutions\nalso leave the form of physical equations unchanged for\ncoordinate-systems in motion, allowing for the relativity of space\nwithin such coordinate-systems, thus depriving space and time of the\n“last vestige of physical objectivity” (Schlick\n2006a, Sec. VII). \n\n\nEinstein was so impressed with Schlick’s presentation that, in\na letter to Arnold Sommerfeld, Einstein described it as\n“masterly”, perhaps because Schlick was one of the first\ncommentators to see that space and time have no existence or reality\nprior to the metric field. \n\n\nNor was it long before Space and Time … was succeeded\nby the first edition of Schlick’s General Theory of\nKnowledge. During the same period, Schlick spent a year\nengaged in war work at Aldershof airport outside Berlin followed, in\n1921, by an appointment at Kiel. Since rumors were already\nspreading about a possible appointment at Vienna, Schlick’s\nfamily stayed in Rostock until 1922, when they moved to Vienna where he\nassumed the Chair of Naturphilosophie which had previously\nbeen occupied by Ernst Mach and Ludwig Boltzmann (v. d.\nVelde-Schlick 2008; Ferrari 2009). Schlick’s selection for\nthe post was probably initiated by the mathematician Hans Hahn and the\nphysicist Phillip Frank, with a strong recommendation from\nEinstein. When Schlick arrived in Vienna, he immediately became\ninvolved with Hahn and Frank, as well as the economist Otto Neurath, in\ntheir Thursday night discussion meetings in the Chemistry Building of\nthe University of Vienna. Schlick was a welcome addition to the\ngroup, and together they formed the core of what would later become\nknown as ‘the Vienna Circle’ (Uebel 2003). Philosophy\nwould never be the same.\n\n\nHowever, before arriving in Vienna, Schlick engaged the\nneo-Kantians,\n Hans Reichenbach\nand\n Ernst Cassirer,\nwho had published their own philosophical understandings\nof the new physics of Relativity. In his Relativity Theory\nand Apriori Knowledge of 1920, Reichenbach had argued for a\nmodified conception of Kant’s synthetic apriori, which\nchallenged Schlick’s thought in a decisive way\n(Reichenbach 1920). At Einstein’s request, Schlick wrote to\nReichenbach in the Fall of 1920, hoping to air the differences between\nthem (Schlick 1920; Einstein 1920). In his own essays, Schlick had\nchallenged Kantian apriorism principally by identifying the\npresuppositions of the new physics as conventions, in\nPoincaré’s sense. Since the presuppositions of\nRelativity were alien to classical physics, they were nothing like the\nself-evident, eternal verities that comprised the Kantian\napriori. But while Schlick rejected Kant’s treatment of\nthe apriori altogether, Reichenbach claimed to have preserved\nits most important element, its constitutive function (Reichenbach\n1920, Ch. V; Friedman 1999, 59–70; Oberdan 2009). For Kant had\nattributed the apriori the far more philosophically\nsignificant function of constituting the object of experience or\nknowledge. Indeed, such principles are the general laws for ordering\nexperience to produce knowledge. Since all empirical knowledge\npresupposes these ordering principles, they can never conflict with\nexperience and are, in this sense, necessarily true.  (Reichenbach\n1920, pp. 55–56) Schlick first wrote Reichenbach in the Fall of\n1920, acknowledging that he regarded the assumption of constitutive\nprinciples as self-evident; indeed, he feared that the matter was so\nobvious that he might not have discussed it sufficiently in\nhis General Theory of Knowledge (Schlick 1920a, p. 1; Oberdan\n1994, pp. 109–110). Nonetheless, it is precisely the principles\nwhich Reichenbach himself had identified as synthetic\napriori that constitute an observation or measurement of an\nexperience. Yet, Schlick confessed, he was unable to discover\nany characteristics of these alleged synthetic apriori\nprinciples that genuinely distinguish them from conventions. Of\ncourse, it then follows that the precepts Reichenbach called\n“synthetic apriori” were just what Schlick had\nidentified as “conventions” and the differences between\nthem were, at most, terminological (Schlick 1920b, 2). But this\napparently terminological difference, Schlick thought, masked a far\ndeeper difference separating them since, on Reichenbach’s\nunderstanding, the apriori constitutes the objects of\nexperience and knowledge whereas, on Schlick’s, conventions only\nconstitute concepts, which may be applied to experiences and objects,\nbut do not constitute them. Thus Schlick insisted on\ndistinguishing his own realist epistemology from Reichenbach’s\nmodified Kantianism, because of the latter’s implicit\nanti-realism.\n\n\nSchlick also contributed a critical essay on Ernst Cassirer’s\n1921 work on Einstein’s Theory of Relativity to the\nprestigious journal Kant-Studien (Cassirer 1921; Schlick\n1979a, 322–334). In “Critical or Empiricist Interpretation\nof Modern Physics?” of 1921, Schlick explained that\nCassirer’s argument rested on a false dichotomy. On the one\nhand, Cassirer’s own Logical Idealism incorporates principles for\nthe ordering and measuring of sensations to constitute physical\nobjects. On the other hand, the only alternative Cassirer\nconsidered is a variety of phenomenalistic empiricism founded on\n“the sensualistic concept of experience”. In\nother words, Cassirer’s operative assumption is simply that the\nonly possible philosophical frameworks for understanding contemporary\nscience are a strict empiricism or one incorporating constitutive\nprinciples. Of course, Schlick regarded his own philosophical\nframework as a clear counterexample, since it is an empiricist\nepistemology distinguished by its inclusion of constitutive\nprinciples. Thus, Cassirer committed the same error as\nReichenbach by blithely ignoring the possibility of constitutive\nprinciples which are not synthetic apriori judgments.\n Naturally, a combination of empiricism with constitutive\nprinciples would fall somewhere between the strict empiricism Cassirer\nrefutes and the Logical Idealism Cassirer defends. At this point,\nSchlick first used what would eventually become a familiar complaint\nagainst Kant and the neo-Kantians among Logical Positivists, especially\ntheir characterization of the constitutive principles as synthetic\njudgments apriori. As Schlick understood constitutive\nprinciples, they are certainly not synthetic apriori\nprinciples, for they are conventions, which are neither\napriori nor synthetic (Schlick 1979a, 322–334). The\nresult of Schlick’s critique was, in Einstein’s words,\n“truly inspirational” (Einstein 1921).\n",
    "section_title": "6. Relativity",
    "entry_title": "Moritz Schlick",
    "hierarchy_title": "Moritz Schlick || Relativity",
    "tokenized_text": [
        "relativity",
        "relativity",
        "correspondence",
        "einstein",
        "schlick",
        "explained",
        "monograph",
        "space",
        "time",
        "contemporary",
        "physic",
        "le",
        "representation",
        "general",
        "theory",
        "thoroughgoing",
        "elucidation",
        "thesis",
        "space",
        "time",
        "forfeited",
        "objectivity",
        "physic",
        "schlick",
        "course",
        "schlick",
        "referring",
        "einstein",
        "remark",
        "paper",
        "general",
        "theory",
        "admission",
        "arbitrary",
        "coordinative",
        "transformation",
        "remove",
        "last",
        "vestige",
        "physical",
        "objectivity",
        "space",
        "time",
        "einstein",
        "monograph",
        "schlick",
        "first",
        "described",
        "difference",
        "space",
        "older",
        "physic",
        "space",
        "postulated",
        "einstein",
        "newtonian",
        "physic",
        "well",
        "physic",
        "special",
        "theory",
        "measurement",
        "founded",
        "notion",
        "rigid",
        "rod",
        "space",
        "still",
        "regarded",
        "euclidean",
        "long",
        "measurement",
        "made",
        "within",
        "coordinate",
        "system",
        "thus",
        "older",
        "physic",
        "space",
        "conceived",
        "complete",
        "metrical",
        "property",
        "defined",
        "rigid",
        "rod",
        "posse",
        "length",
        "place",
        "time",
        "particularly",
        "noted",
        "metrical",
        "property",
        "space",
        "regarded",
        "independent",
        "distribution",
        "body",
        "space",
        "gravitational",
        "field",
        "precisely",
        "condition",
        "changed",
        "general",
        "relativity",
        "rather",
        "general",
        "theory",
        "principle",
        "general",
        "covariance",
        "implies",
        "property",
        "ascribed",
        "space",
        "independently",
        "consideration",
        "thing",
        "einstein",
        "showed",
        "noneuclidean",
        "method",
        "determining",
        "measurement",
        "must",
        "used",
        "presence",
        "gravitational",
        "field",
        "follows",
        "insight",
        "thing",
        "space",
        "give",
        "particular",
        "structure",
        "result",
        "complete",
        "relativization",
        "space",
        "schlick",
        "a",
        "sec",
        "vii",
        "classical",
        "mechanic",
        "decided",
        "convention",
        "see",
        "rigid",
        "rod",
        "length",
        "throughout",
        "space",
        "convention",
        "modified",
        "special",
        "relativity",
        "general",
        "relativity",
        "length",
        "rigid",
        "rod",
        "may",
        "also",
        "depend",
        "place",
        "position",
        "way",
        "consistency",
        "special",
        "relativity",
        "maintained",
        "thus",
        "maintain",
        "general",
        "postulate",
        "relativity",
        "necessary",
        "reduce",
        "objective",
        "spatial",
        "structure",
        "earlier",
        "physic",
        "nonintuitive",
        "topology",
        "radical",
        "departure",
        "objectivity",
        "spatial",
        "structure",
        "earlier",
        "system",
        "entirely",
        "artifact",
        "fixed",
        "metrical",
        "structure",
        "relativity",
        "theory",
        "resulting",
        "conceptual",
        "construction",
        "admits",
        "distinct",
        "metrical",
        "structure",
        "different",
        "region",
        "depending",
        "gravitational",
        "field",
        "region",
        "schlick",
        "reflects",
        "closing",
        "page",
        "space",
        "time",
        "possibility",
        "objectivity",
        "conceptual",
        "construction",
        "depends",
        "entirely",
        "method",
        "pointcoincidences",
        "feature",
        "worldpicture",
        "contribute",
        "systematization",
        "pointcoincidences",
        "physically",
        "objective",
        "worldpictures",
        "contain",
        "law",
        "governing",
        "pointcoincidences",
        "thoroughly",
        "equivalent",
        "furthermore",
        "since",
        "functional",
        "singlevalued",
        "deformation",
        "worldpicture",
        "leaf",
        "pointcoincidences",
        "undisturbed",
        "equation",
        "physic",
        "retain",
        "form",
        "transformation",
        "implying",
        "covariant",
        "substitution",
        "substitution",
        "also",
        "leave",
        "form",
        "physical",
        "equation",
        "unchanged",
        "coordinatesystems",
        "motion",
        "allowing",
        "relativity",
        "space",
        "within",
        "coordinatesystems",
        "thus",
        "depriving",
        "space",
        "time",
        "last",
        "vestige",
        "physical",
        "objectivity",
        "schlick",
        "a",
        "sec",
        "vii",
        "einstein",
        "impressed",
        "schlick",
        "presentation",
        "letter",
        "arnold",
        "sommerfeld",
        "einstein",
        "described",
        "masterly",
        "perhaps",
        "schlick",
        "one",
        "first",
        "commentator",
        "see",
        "space",
        "time",
        "existence",
        "reality",
        "prior",
        "metric",
        "field",
        "long",
        "space",
        "time",
        "succeeded",
        "first",
        "edition",
        "schlick",
        "general",
        "theory",
        "knowledge",
        "period",
        "schlick",
        "spent",
        "year",
        "engaged",
        "war",
        "work",
        "aldershof",
        "airport",
        "outside",
        "berlin",
        "followed",
        "appointment",
        "kiel",
        "since",
        "rumor",
        "already",
        "spreading",
        "possible",
        "appointment",
        "vienna",
        "schlick",
        "family",
        "stayed",
        "rostock",
        "moved",
        "vienna",
        "assumed",
        "chair",
        "naturphilosophie",
        "previously",
        "occupied",
        "ernst",
        "mach",
        "ludwig",
        "boltzmann",
        "v",
        "d",
        "veldeschlick",
        "ferrari",
        "schlick",
        "selection",
        "post",
        "probably",
        "initiated",
        "mathematician",
        "han",
        "hahn",
        "physicist",
        "phillip",
        "frank",
        "strong",
        "recommendation",
        "einstein",
        "schlick",
        "arrived",
        "vienna",
        "immediately",
        "became",
        "involved",
        "hahn",
        "frank",
        "well",
        "economist",
        "otto",
        "neurath",
        "thursday",
        "night",
        "discussion",
        "meeting",
        "chemistry",
        "building",
        "university",
        "vienna",
        "schlick",
        "welcome",
        "addition",
        "group",
        "together",
        "formed",
        "core",
        "would",
        "later",
        "become",
        "known",
        "vienna",
        "circle",
        "uebel",
        "philosophy",
        "would",
        "never",
        "however",
        "arriving",
        "vienna",
        "schlick",
        "engaged",
        "neokantians",
        "han",
        "reichenbach",
        "ernst",
        "cassirer",
        "published",
        "philosophical",
        "understanding",
        "new",
        "physic",
        "relativity",
        "relativity",
        "theory",
        "apriori",
        "knowledge",
        "reichenbach",
        "argued",
        "modified",
        "conception",
        "kant",
        "synthetic",
        "apriori",
        "challenged",
        "schlick",
        "thought",
        "decisive",
        "way",
        "reichenbach",
        "einstein",
        "request",
        "schlick",
        "wrote",
        "reichenbach",
        "fall",
        "hoping",
        "air",
        "difference",
        "schlick",
        "einstein",
        "essay",
        "schlick",
        "challenged",
        "kantian",
        "apriorism",
        "principally",
        "identifying",
        "presupposition",
        "new",
        "physic",
        "convention",
        "poincaré",
        "sense",
        "since",
        "presupposition",
        "relativity",
        "alien",
        "classical",
        "physic",
        "nothing",
        "like",
        "selfevident",
        "eternal",
        "verity",
        "comprised",
        "kantian",
        "apriori",
        "schlick",
        "rejected",
        "kant",
        "treatment",
        "apriori",
        "altogether",
        "reichenbach",
        "claimed",
        "preserved",
        "important",
        "element",
        "constitutive",
        "function",
        "reichenbach",
        "ch",
        "v",
        "friedman",
        "oberdan",
        "kant",
        "attributed",
        "apriori",
        "far",
        "philosophically",
        "significant",
        "function",
        "constituting",
        "object",
        "experience",
        "knowledge",
        "indeed",
        "principle",
        "general",
        "law",
        "ordering",
        "experience",
        "produce",
        "knowledge",
        "since",
        "empirical",
        "knowledge",
        "presupposes",
        "ordering",
        "principle",
        "never",
        "conflict",
        "experience",
        "sense",
        "necessarily",
        "true",
        "reichenbach",
        "pp",
        "schlick",
        "first",
        "wrote",
        "reichenbach",
        "fall",
        "acknowledging",
        "regarded",
        "assumption",
        "constitutive",
        "principle",
        "selfevident",
        "indeed",
        "feared",
        "matter",
        "obvious",
        "might",
        "discussed",
        "sufficiently",
        "general",
        "theory",
        "knowledge",
        "schlick",
        "a",
        "p",
        "oberdan",
        "pp",
        "nonetheless",
        "precisely",
        "principle",
        "reichenbach",
        "identified",
        "synthetic",
        "apriori",
        "constitute",
        "observation",
        "measurement",
        "experience",
        "yet",
        "schlick",
        "confessed",
        "unable",
        "discover",
        "characteristic",
        "alleged",
        "synthetic",
        "apriori",
        "principle",
        "genuinely",
        "distinguish",
        "convention",
        "course",
        "follows",
        "precept",
        "reichenbach",
        "called",
        "synthetic",
        "apriori",
        "schlick",
        "identified",
        "convention",
        "difference",
        "terminological",
        "schlick",
        "b",
        "apparently",
        "terminological",
        "difference",
        "schlick",
        "thought",
        "masked",
        "far",
        "deeper",
        "difference",
        "separating",
        "since",
        "reichenbach",
        "understanding",
        "apriori",
        "constitutes",
        "object",
        "experience",
        "knowledge",
        "whereas",
        "schlick",
        "convention",
        "constitute",
        "concept",
        "may",
        "applied",
        "experience",
        "object",
        "constitute",
        "thus",
        "schlick",
        "insisted",
        "distinguishing",
        "realist",
        "epistemology",
        "reichenbach",
        "modified",
        "kantianism",
        "latter",
        "implicit",
        "antirealism",
        "schlick",
        "also",
        "contributed",
        "critical",
        "essay",
        "ernst",
        "cassirer",
        "work",
        "einstein",
        "theory",
        "relativity",
        "prestigious",
        "journal",
        "kantstudien",
        "cassirer",
        "schlick",
        "a",
        "critical",
        "empiricist",
        "interpretation",
        "modern",
        "physic",
        "schlick",
        "explained",
        "cassirer",
        "argument",
        "rested",
        "false",
        "dichotomy",
        "one",
        "hand",
        "cassirer",
        "logical",
        "idealism",
        "incorporates",
        "principle",
        "ordering",
        "measuring",
        "sensation",
        "constitute",
        "physical",
        "object",
        "hand",
        "alternative",
        "cassirer",
        "considered",
        "variety",
        "phenomenalistic",
        "empiricism",
        "founded",
        "sensualistic",
        "concept",
        "experience",
        "word",
        "cassirer",
        "operative",
        "assumption",
        "simply",
        "possible",
        "philosophical",
        "framework",
        "understanding",
        "contemporary",
        "science",
        "strict",
        "empiricism",
        "one",
        "incorporating",
        "constitutive",
        "principle",
        "course",
        "schlick",
        "regarded",
        "philosophical",
        "framework",
        "clear",
        "counterexample",
        "since",
        "empiricist",
        "epistemology",
        "distinguished",
        "inclusion",
        "constitutive",
        "principle",
        "thus",
        "cassirer",
        "committed",
        "error",
        "reichenbach",
        "blithely",
        "ignoring",
        "possibility",
        "constitutive",
        "principle",
        "synthetic",
        "apriori",
        "judgment",
        "naturally",
        "combination",
        "empiricism",
        "constitutive",
        "principle",
        "would",
        "fall",
        "somewhere",
        "strict",
        "empiricism",
        "cassirer",
        "refutes",
        "logical",
        "idealism",
        "cassirer",
        "defends",
        "point",
        "schlick",
        "first",
        "used",
        "would",
        "eventually",
        "become",
        "familiar",
        "complaint",
        "kant",
        "neokantians",
        "among",
        "logical",
        "positivist",
        "especially",
        "characterization",
        "constitutive",
        "principle",
        "synthetic",
        "judgment",
        "apriori",
        "schlick",
        "understood",
        "constitutive",
        "principle",
        "certainly",
        "synthetic",
        "apriori",
        "principle",
        "convention",
        "neither",
        "apriori",
        "synthetic",
        "schlick",
        "a",
        "result",
        "schlick",
        "critique",
        "einstein",
        "word",
        "truly",
        "inspirational",
        "einstein"
    ]
}