{
    "main_text": "Philosophy of Language\n4. Philosophy of Language\n\nIn his Letters on Poetry… from 1795, addressed to a\nfictional Amalie, Schlegel discusses the origins of language;\na theme, to which he would later return in his Jena and Berlin\nlectures. Schlegel was thus resuming an old philosophical debate which\nhad formed two opposite hypotheses (Behler 2002: 124–128). The\ntwo basic and mutually exclusive positions maintained, on the one\nhand, as Schlegel portrays them, that human language must have\noriginated as a transcription, representation, or imitation of\nexternal objects; and, on the other, that in its origin\nlanguage must have been purely sensual, i.e., a mere form of\nexpression of emotions through sounds. Thus, either directly or\nindirectly, Schlegel was referring to authors such as Condillac,\nHemsterhuys, Karl Phillip Moritz, August Ferdinand Bernhardi, Fichte,\nHerder, and Rousseau. However, in contrast to Herder (and even his own\nbrother Friedrich) for whom the debate about the origin of language\nwas primarily a debate about whether its origin was natural or divine,\nfor Schlegel, the real question at stake was the extent to which the\nnature of language could be reduced to and explained in pure\nrationalistic terms. Furthermore, in these letters Schlegel implicitly\nquestions the possibility of attaining absolute knowledge solely\nthrough theory, i.e., attending only to a scientific rationale that\nnecessarily excludes more metaphorical and intuitive approaches, which\nattempt to understand and grasp things “under the mysterious\nlight of twilight” (SW: VII, 110). For Schlegel, in any case,\nthe real problem lay in the assumed exclusivity of both alternatives\n(cf. Behler 2000: 126). \n\nSchlegel’s decision to present his position in an epistolary\nform, mixing different styles of argumentation, is an almost necessary\nconsequence of his approach to the debate: a lively debate, which he\naimed to dissolve by reconciling both perspectives but without\nnegating any of them. In a way, these letters are a clear example of\nthe fusion between content and form. In fact, Schlegel actually\nmodified his last Letter after having received a commentary,\nthrough a missive, from Friedrich Schiller (Behler 2002: 126). For\nSchlegel, the only plausible theory on the origin of language had to\ntake into account both its irrational elements (i.e., the purely\nemotional, imaginative, sensual, and most radically communicative\naspects of language) and its rational characteristic (i.e., a system\nof signs based on convention), while admitting that on the whole, the\norigin of language remains as secret and inexplicable as the origin of\nhumanity itself (SW: VII, 111). In brief: for Schlegel, as for Novalis\nor Schleiermacher, language could not be reduced to a mere system of\nsigns and any account of the origin of language had to be able to\nintegrate the two apparently opposite aspects of it.\n\nFor Schlegel, language, in its most elementary conception, constitutes\nthe basic means of communication of immediate feelings, and therefore\nrepresents a dimension that is also present in other animals. Children\nlearn to move their tongues, Schlegel notes, even before they learn to\nuse their feet (SW: VII, 117). But in human language, this\ncommunicative capability is also the tool that enables man to surpass\na pure naturalistic or animalistic sphere. Indeed, for Schlegel, as\nfor Herder, language is the quintessence of human beings. Language, on\nthe one hand, represents our rupture with nature, but, on the other,\nit constitutes our first and most fundamental contact with the world:\n(1) it is the true condition of possibility of our orientation in the\nworld; and (2) it provides us with the unique opportunity of\ncommunicating with other people and of developing subjectivity.\nMoreover, for Schlegel, the world as such only makes sense through or\nwithin language. It is through language that we tear ourselves away\nfrom nature and constitute ourselves as a subject. Language is what\ntakes us beyond ourselves; it is the “magical power” that\nleaves room for the incorporeal, unphysical in us (SW: VII, 139).\n\nSchlegel accepts the idea that, in its beginning, language was\nprobably a direct expression of feelings and emotions through sounds.\nThe origin of language, he argues, must have been very close to the\ncry of animals and the singing of birds, an idea that he reinforces\nthrough the fact that we all began to use our voices by screaming (SW:\nVII, 115). But to this basic point, Schlegel also adds the idea of\nrhythm. In his letters, he suggests that the rhythmic character of\nlanguage is as old as poetry, and moreover, as old as human life. The\noldest or the first language, he argues, must have been\nindivisible from tones, rhythms, music, and dance. Poetry, or rather\nrhythm, he affirms, is thus essential to language itself. Indeed, it\nwould be impossible to eliminate rhythm from language (SW: VII, 108).\nIn other words, Schlegel claims that, in its origin, language was\npoetry (SW: VII, 104). Most important, though, is that Schlegel\n“does not limit the realm of sensuality and feeling to an early\nstage in the formation of language” (Behler 2000: 81). For\nSchlegel, this more sensual aspect of language is always present:\nhowever civilized a people may be, they cannot avoid using\ndifferent tones and rhythms to express themselves (SW: VII, 115). Each\nutterance, each sentence is spoken with a certain rhythm, each word\nalso carries the way in which it is said, the way in which it\nrefers to the world, and all these elements constitute an aspect of\nlanguage, for they help to establish the ultimate meaning of the\nwords. This, as Schlegel points out, becomes most obvious once we\nrealize that, in order to comprehend the emotions that are being\ntransmitted through a particular speech, one does not need to\nunderstand the words literally (SW: VII, 114).\n\nThus, for Schlegel, language not only was poetry in its origin:\nlanguage is essentially poetry. Or as he would later claim in\nhis Berlin lectures: “language is an ongoing becoming and\ncontinually changing, never ending poem of human kind” (VLK: I,\n388). Thus, the nature of language should be understood, not as a more\nor less automatic response to the necessities the world imposes upon\nus, but as a creative, poetical ability. For Schlegel, the\ncharacterization of language as poetry is the only way a theory of\nlanguage could give account of language’s inherent spontaneity\nand creativity. In a certain way, Schlegel was reinterpreting Herder\nthrough Fichte, emphasizing Fichte’s idea of man’s\nself-possession and his relation to the world as an active and not a\npassive one. This also explains the importance Schlegel gave to the\nrole of the poet (and to the literature translator) in the development\nof the language of a nation. For Schlegel, as for Wilhelm von\nHumboldt, the task of the poet and also that of the translator is to\nbroaden the signifying and expressive capacity of a language. The\npoet, Schlegel says in his 1796 text The Works of Homer by\nVoss, is the force that renders language alive, which\nnevertheless does not mean that s/he may introduce any kind of\nchanges: language’s malleability also has its grammatical and\nphilological limits (KS: I, 75–76 and 116–117).\n\nIn his philosophical account of the fact that language is constantly\nchanging and moving from lower to higher stages, Schlegel operates\nwith two very different ways of approaching language, which, at the\nsame time, reveal the co-existence of two opposite but equally\nconstitutive forces in the development of a language: the\nartist’s language-shaping efforts and the grammarian’s\njudicial function (SW: VII, 117). In this way, Schlegel is somehow\nanticipating Saussure’s extremely influential distinction\nbetween langue and parole. For Schlegel, as for\nSaussure or Deleuze, the tension between language as an ordered and\nstable whole, and language as the subject of a more or less arbitrary,\nfree and creative development, is what makes language something\nalive.\n\nIn a similar way, Schlegel affirms that our encounters with the world\nare always poetical, in the sense that they are not be merely\nreceptive, but also creative. Reality exists through language, or, in\nother words, we always relate to the world metaphorically. This also\nmeans that there cannot be an ‘absolute’ (i.e., an\nabsolutely true) way of referring to the external world, for we do not\nsee the world as it is, but always in relation to ourselves.\nSchlegel’s theory of language is thus intrinsically connected to\nhis theory of mythology. Both in his Jena and in his Berlin lectures,\nSchlegel stressed the fact the experience of an existing totality has\na mythological basis without which the experience itself would be\nimpossible (Behler 1992: 77–78). Once again, Schlegel stressed\nthe idea that mythology is not merely a phase of human rationality,\nbut is part of our being in the world. It is a structural principle of\nhuman intellectual activity, the purest rational activity being a\nmythological one: be it in art, sciences, or in our daily activities,\nwe always relate to the world metaphorically.\n\nIn his letters, Schlegel claims that language is the “most\nwonderful creation of human being’s poetical talent”,\nbecause it is through language that human nature is able to reflect\nupon itself (SW: VII, 104). Thus, Schlegel’s theory of language\nis at the same time a theory of the origin of poetry, which also\nexplains his predilection for poetry among all the different artistic\nmanifestations. Thanks to this comprehension of the poetical nature of\nlanguage, Schlegel can explain poetry as the highest and freest of all\narts, because it creates its own objects. Indeed, if language is\ndefined as poetry, then poetry itself becomes “poetry in\npoetry” (Behler 1992: 125). The only difference between language\nand poetry, he argued, is that the poet is aware of his/her poetical\ncreativity: s/he consciously decides to create a dream; whereas in\nordinary speech, the subject is unaware of his/her poetical and\nimaginative activity (VLK: I, 275). In this way, Schlegel was\nanticipating some of Nietzsche’s most interesting theses in\nOn Truth and Lie in an Extra-Moral Sense and The Birth of\nTragedy\n",
    "section_title": "4. Philosophy of Language",
    "entry_title": "August Wilhelm von Schlegel",
    "hierarchy_title": "August Wilhelm von Schlegel || Philosophy of Language",
    "tokenized_text": [
        "philosophy",
        "language",
        "philosophy",
        "language",
        "letter",
        "poetry",
        "addressed",
        "fictional",
        "amalie",
        "schlegel",
        "discus",
        "origin",
        "language",
        "theme",
        "would",
        "later",
        "return",
        "jena",
        "berlin",
        "lecture",
        "schlegel",
        "thus",
        "resuming",
        "old",
        "philosophical",
        "debate",
        "formed",
        "two",
        "opposite",
        "hypothesis",
        "behler",
        "two",
        "basic",
        "mutually",
        "exclusive",
        "position",
        "maintained",
        "one",
        "hand",
        "schlegel",
        "portrays",
        "human",
        "language",
        "must",
        "originated",
        "transcription",
        "representation",
        "imitation",
        "external",
        "object",
        "origin",
        "language",
        "must",
        "purely",
        "sensual",
        "ie",
        "mere",
        "form",
        "expression",
        "emotion",
        "sound",
        "thus",
        "either",
        "directly",
        "indirectly",
        "schlegel",
        "referring",
        "author",
        "condillac",
        "hemsterhuys",
        "karl",
        "phillip",
        "moritz",
        "august",
        "ferdinand",
        "bernhardi",
        "fichte",
        "herder",
        "rousseau",
        "however",
        "contrast",
        "herder",
        "even",
        "brother",
        "friedrich",
        "debate",
        "origin",
        "language",
        "primarily",
        "debate",
        "whether",
        "origin",
        "natural",
        "divine",
        "schlegel",
        "real",
        "question",
        "stake",
        "extent",
        "nature",
        "language",
        "could",
        "reduced",
        "explained",
        "pure",
        "rationalistic",
        "term",
        "furthermore",
        "letter",
        "schlegel",
        "implicitly",
        "question",
        "possibility",
        "attaining",
        "absolute",
        "knowledge",
        "solely",
        "theory",
        "ie",
        "attending",
        "scientific",
        "rationale",
        "necessarily",
        "excludes",
        "metaphorical",
        "intuitive",
        "approach",
        "attempt",
        "understand",
        "grasp",
        "thing",
        "mysterious",
        "light",
        "twilight",
        "sw",
        "vii",
        "schlegel",
        "case",
        "real",
        "problem",
        "lay",
        "assumed",
        "exclusivity",
        "alternative",
        "cf",
        "behler",
        "schlegel",
        "decision",
        "present",
        "position",
        "epistolary",
        "form",
        "mixing",
        "different",
        "style",
        "argumentation",
        "almost",
        "necessary",
        "consequence",
        "approach",
        "debate",
        "lively",
        "debate",
        "aimed",
        "dissolve",
        "reconciling",
        "perspective",
        "without",
        "negating",
        "way",
        "letter",
        "clear",
        "example",
        "fusion",
        "content",
        "form",
        "fact",
        "schlegel",
        "actually",
        "modified",
        "last",
        "letter",
        "received",
        "commentary",
        "missive",
        "friedrich",
        "schiller",
        "behler",
        "schlegel",
        "plausible",
        "theory",
        "origin",
        "language",
        "take",
        "account",
        "irrational",
        "element",
        "ie",
        "purely",
        "emotional",
        "imaginative",
        "sensual",
        "radically",
        "communicative",
        "aspect",
        "language",
        "rational",
        "characteristic",
        "ie",
        "system",
        "sign",
        "based",
        "convention",
        "admitting",
        "whole",
        "origin",
        "language",
        "remains",
        "secret",
        "inexplicable",
        "origin",
        "humanity",
        "sw",
        "vii",
        "brief",
        "schlegel",
        "novalis",
        "schleiermacher",
        "language",
        "could",
        "reduced",
        "mere",
        "system",
        "sign",
        "account",
        "origin",
        "language",
        "able",
        "integrate",
        "two",
        "apparently",
        "opposite",
        "aspect",
        "schlegel",
        "language",
        "elementary",
        "conception",
        "constitutes",
        "basic",
        "mean",
        "communication",
        "immediate",
        "feeling",
        "therefore",
        "represents",
        "dimension",
        "also",
        "present",
        "animal",
        "child",
        "learn",
        "move",
        "tongue",
        "schlegel",
        "note",
        "even",
        "learn",
        "use",
        "foot",
        "sw",
        "vii",
        "human",
        "language",
        "communicative",
        "capability",
        "also",
        "tool",
        "enables",
        "man",
        "surpass",
        "pure",
        "naturalistic",
        "animalistic",
        "sphere",
        "indeed",
        "schlegel",
        "herder",
        "language",
        "quintessence",
        "human",
        "being",
        "language",
        "one",
        "hand",
        "represents",
        "rupture",
        "nature",
        "constitutes",
        "first",
        "fundamental",
        "contact",
        "world",
        "true",
        "condition",
        "possibility",
        "orientation",
        "world",
        "provides",
        "u",
        "unique",
        "opportunity",
        "communicating",
        "people",
        "developing",
        "subjectivity",
        "moreover",
        "schlegel",
        "world",
        "make",
        "sense",
        "within",
        "language",
        "language",
        "tear",
        "away",
        "nature",
        "constitute",
        "subject",
        "language",
        "take",
        "u",
        "beyond",
        "magical",
        "power",
        "leaf",
        "room",
        "incorporeal",
        "unphysical",
        "u",
        "sw",
        "vii",
        "schlegel",
        "accepts",
        "idea",
        "beginning",
        "language",
        "probably",
        "direct",
        "expression",
        "feeling",
        "emotion",
        "sound",
        "origin",
        "language",
        "argues",
        "must",
        "close",
        "cry",
        "animal",
        "singing",
        "bird",
        "idea",
        "reinforces",
        "fact",
        "began",
        "use",
        "voice",
        "screaming",
        "sw",
        "vii",
        "basic",
        "point",
        "schlegel",
        "also",
        "add",
        "idea",
        "rhythm",
        "letter",
        "suggests",
        "rhythmic",
        "character",
        "language",
        "old",
        "poetry",
        "moreover",
        "old",
        "human",
        "life",
        "oldest",
        "first",
        "language",
        "argues",
        "must",
        "indivisible",
        "tone",
        "rhythm",
        "music",
        "dance",
        "poetry",
        "rather",
        "rhythm",
        "affirms",
        "thus",
        "essential",
        "language",
        "indeed",
        "would",
        "impossible",
        "eliminate",
        "rhythm",
        "language",
        "sw",
        "vii",
        "word",
        "schlegel",
        "claim",
        "origin",
        "language",
        "poetry",
        "sw",
        "vii",
        "important",
        "though",
        "schlegel",
        "limit",
        "realm",
        "sensuality",
        "feeling",
        "early",
        "stage",
        "formation",
        "language",
        "behler",
        "schlegel",
        "sensual",
        "aspect",
        "language",
        "always",
        "present",
        "however",
        "civilized",
        "people",
        "may",
        "avoid",
        "using",
        "different",
        "tone",
        "rhythm",
        "express",
        "sw",
        "vii",
        "utterance",
        "sentence",
        "spoken",
        "certain",
        "rhythm",
        "word",
        "also",
        "carry",
        "way",
        "said",
        "way",
        "refers",
        "world",
        "element",
        "constitute",
        "aspect",
        "language",
        "help",
        "establish",
        "ultimate",
        "meaning",
        "word",
        "schlegel",
        "point",
        "becomes",
        "obvious",
        "realize",
        "order",
        "comprehend",
        "emotion",
        "transmitted",
        "particular",
        "speech",
        "one",
        "need",
        "understand",
        "word",
        "literally",
        "sw",
        "vii",
        "thus",
        "schlegel",
        "language",
        "poetry",
        "origin",
        "language",
        "essentially",
        "poetry",
        "would",
        "later",
        "claim",
        "berlin",
        "lecture",
        "language",
        "ongoing",
        "becoming",
        "continually",
        "changing",
        "never",
        "ending",
        "poem",
        "human",
        "kind",
        "vlk",
        "thus",
        "nature",
        "language",
        "understood",
        "le",
        "automatic",
        "response",
        "necessity",
        "world",
        "imposes",
        "upon",
        "u",
        "creative",
        "poetical",
        "ability",
        "schlegel",
        "characterization",
        "language",
        "poetry",
        "way",
        "theory",
        "language",
        "could",
        "give",
        "account",
        "language",
        "inherent",
        "spontaneity",
        "creativity",
        "certain",
        "way",
        "schlegel",
        "reinterpreting",
        "herder",
        "fichte",
        "emphasizing",
        "fichte",
        "idea",
        "man",
        "selfpossession",
        "relation",
        "world",
        "active",
        "passive",
        "one",
        "also",
        "explains",
        "importance",
        "schlegel",
        "gave",
        "role",
        "poet",
        "literature",
        "translator",
        "development",
        "language",
        "nation",
        "schlegel",
        "wilhelm",
        "von",
        "humboldt",
        "task",
        "poet",
        "also",
        "translator",
        "broaden",
        "signifying",
        "expressive",
        "capacity",
        "language",
        "poet",
        "schlegel",
        "say",
        "text",
        "work",
        "homer",
        "voss",
        "force",
        "render",
        "language",
        "alive",
        "nevertheless",
        "mean",
        "she",
        "may",
        "introduce",
        "kind",
        "change",
        "language",
        "malleability",
        "also",
        "grammatical",
        "philological",
        "limit",
        "k",
        "philosophical",
        "account",
        "fact",
        "language",
        "constantly",
        "changing",
        "moving",
        "lower",
        "higher",
        "stage",
        "schlegel",
        "operates",
        "two",
        "different",
        "way",
        "approaching",
        "language",
        "time",
        "reveal",
        "coexistence",
        "two",
        "opposite",
        "equally",
        "constitutive",
        "force",
        "development",
        "language",
        "artist",
        "languageshaping",
        "effort",
        "grammarian",
        "judicial",
        "function",
        "sw",
        "vii",
        "way",
        "schlegel",
        "somehow",
        "anticipating",
        "saussure",
        "extremely",
        "influential",
        "distinction",
        "langue",
        "parole",
        "schlegel",
        "saussure",
        "deleuze",
        "tension",
        "language",
        "ordered",
        "stable",
        "whole",
        "language",
        "subject",
        "le",
        "arbitrary",
        "free",
        "creative",
        "development",
        "make",
        "language",
        "something",
        "alive",
        "similar",
        "way",
        "schlegel",
        "affirms",
        "encounter",
        "world",
        "always",
        "poetical",
        "sense",
        "merely",
        "receptive",
        "also",
        "creative",
        "reality",
        "exists",
        "language",
        "word",
        "always",
        "relate",
        "world",
        "metaphorically",
        "also",
        "mean",
        "absolute",
        "ie",
        "absolutely",
        "true",
        "way",
        "referring",
        "external",
        "world",
        "see",
        "world",
        "always",
        "relation",
        "schlegel",
        "theory",
        "language",
        "thus",
        "intrinsically",
        "connected",
        "theory",
        "mythology",
        "jena",
        "berlin",
        "lecture",
        "schlegel",
        "stressed",
        "fact",
        "experience",
        "existing",
        "totality",
        "mythological",
        "basis",
        "without",
        "experience",
        "would",
        "impossible",
        "behler",
        "schlegel",
        "stressed",
        "idea",
        "mythology",
        "merely",
        "phase",
        "human",
        "rationality",
        "part",
        "world",
        "structural",
        "principle",
        "human",
        "intellectual",
        "activity",
        "purest",
        "rational",
        "activity",
        "mythological",
        "one",
        "art",
        "science",
        "daily",
        "activity",
        "always",
        "relate",
        "world",
        "metaphorically",
        "letter",
        "schlegel",
        "claim",
        "language",
        "wonderful",
        "creation",
        "human",
        "poetical",
        "talent",
        "language",
        "human",
        "nature",
        "able",
        "reflect",
        "upon",
        "sw",
        "vii",
        "thus",
        "schlegel",
        "theory",
        "language",
        "time",
        "theory",
        "origin",
        "poetry",
        "also",
        "explains",
        "predilection",
        "poetry",
        "among",
        "different",
        "artistic",
        "manifestation",
        "thanks",
        "comprehension",
        "poetical",
        "nature",
        "language",
        "schlegel",
        "explain",
        "poetry",
        "highest",
        "freest",
        "art",
        "creates",
        "object",
        "indeed",
        "language",
        "defined",
        "poetry",
        "poetry",
        "becomes",
        "poetry",
        "poetry",
        "behler",
        "difference",
        "language",
        "poetry",
        "argued",
        "poet",
        "aware",
        "hisher",
        "poetical",
        "creativity",
        "she",
        "consciously",
        "decides",
        "create",
        "dream",
        "whereas",
        "ordinary",
        "speech",
        "subject",
        "unaware",
        "hisher",
        "poetical",
        "imaginative",
        "activity",
        "vlk",
        "way",
        "schlegel",
        "anticipating",
        "nietzsche",
        "interesting",
        "thesis",
        "truth",
        "lie",
        "extramoral",
        "sense",
        "birth",
        "tragedy"
    ]
}