{
    "main_text": "Ethics\n9. Ethics\n\nSchleiermacher’s ethical thought divides into two overlapping\nchronological phases. The first phase—which stretched from the\nlate 1780s until about 1803—was mainly critical in character.\nEarly in this phase, the three unpublished essays On the Highest\nGood (1789), On What Gives Value to Life (1792–3),\nand On Freedom (1790–3) mounted a sustained attack on\nKant’s ethical theory, and at the end of this phase the longer\npublished work Outlines of a Critique of Previous Ethical\nTheory (1803) developed that attack into a more comprehensive and\nsystematic critique of previous ethical theories. The second\nphase—which began around 1800—was by contrast mainly\nconstructive in character. To this phase belong the\nSoliloquies (1800), the Draft of an Ethics\n(1805–6), and Schleiermacher’s mature ethics lectures\n(including the complete draft from 1812–13, as well as a number\nof later partial drafts).\n\nThe three early essays On the Highest Good, On What Gives\nValue to Life, and On Freedom criticize and reject\ncentral tenets of Kant’s moral philosophy: in particular,\nKant’s inclusion of an apportioning of happiness to moral desert\nin the “highest good [summum bonum]”;\nKant’s position that this must be believed in as a\npresupposition of morality, so that its own implicit presuppositions,\nan afterlife of the soul and a God, must be so as well (the doctrine\nof the “postulates”); and Kant’s incompatibilism\nconcerning causal determinism and the freedom that is required for\nmoral responsibility, and consequent recourse to the causally\nindeterministic noumenal realm as the locus for freedom (On\nFreedom argues to the contrary that all human actions are\ncausally determined, but that this is compatible with the freedom that\nis required for moral responsibility).\n\nA further area of disagreement with Kant forms the hinge on which\nSchleiermacher’s development of his own constructive ethical\ntheory turns. Kant’s fundamental moral principle, the\n“categorical imperative”, consisted, according to its\ncentral formulation, in a requirement that an agent’s moral\nmaxim (or intention) be consistent when universalized, and was\nconceived by Kant to be shared by all human beings.\nSchleiermacher rejects this position in two ways. First, already in\nOn What Gives Value to Life, and then especially in the\nSoliloquies, he argues against the latter idea of uniformity\nin ethics—instead asserting, in the spirit of Herder (and others\ninfluenced by Herder, such as Goethe, Schiller, and fellow romantics),\nthe fact and value of diversity or individuality\neven in the moral sphere. In this connection, Schleiermacher champions\nnot only a (moral) distinctiveness of different human societies\nvis-à-vis the human species as a whole (this had been\nHerder’s main cause), but also a (moral) distinctiveness of the\nindividual vis-à-vis his society (this had also been a cause of\nHerder’s). (In On Religion Schleiermacher makes an\nanalogous case for both societal and individual diversity in religion.\nHis positive evaluation of societal and individual diversity naturally\nalso extends beyond morals and religion to other domains.)\n\nSecond, Schleiermacher also rejects the content of Kant’s\n“categorical imperative” as specified by its central\nformulation: the requirement of consistency of a maxim under\nuniversalization. In On Religion and the Soliloquies\nSchleiermacher is rather inclined to champion Kant’s subordinate\nformula of a commitment to the welfare of humanity, though\nnot in Kant’s sense of a common rational nature, but instead in\nHerder’s sense of all human beings in their diversities as well\nas their commonalities. (In On Religion he also discusses the\nhistorical dimension of this principle of humanity in a Herderian\nspirit, like Herder in Ideas for the Philosophy of History of\nHumanity [1784–91] emphasizing the important role that has\nbeen played by (Christian) religion in advancing it, and interpreting\nhistory as its progressive realization.)\n\nSchleiermacher’s commitment to humanity implies a commitment to\nmoral cosmopolitanism, or moral respect for all human beings. But, as\nwe have just seen, he espouses this commitment despite, or even in\npart because of, a recognition of their moral diversity. This\nconstitutes a novel form of moral cosmopolitanism: a\npluralist cosmopolitanism that sharply contrasts with the\nhomogenizing cosmopolitanism of the philosophical tradition\n(e.g., the Stoics and Kant), which had instead been predicated on an\nassumption of moral uniformity. This innovation had already been\nanticipated by Herder, but Schleiermacher embraces it even more\nclearly. It is arguably the single most important contribution to\nphilosophical reflection on cosmopolitanism of the eighteenth and\nnineteenth centuries. \n\nThis position of Schleiermacher’s might seem to court the\nfollowing sort of problem, though: What if the moral values of a\nsociety or an individual conflict with the ideal of humanity? What if,\nfor example, the society is Nazi Germany or the individual Hitler? In\nthe Soliloquies Schleiermacher tries to forestall this sort\nof problem by limiting the forms of moral distinctiveness and\nindividuality that he supports to those that are compatible with, or\neven conducive to, the ideal of humanity. Thus he expresses his\ncommitment to moral distinctiveness or individuality in such formulas\nas that a person should be an individual “without violating the\nlaws of humanity”, that “each human being should represent\nhumanity in his own way”, and that what is valuable is a\nperson’s “distinctive being and its relation to\nhumanity”. Similarly, his championing of (moral) diversity or\nindividuality is always combined with requirements of a measure of\nconformity with a broader species-wide or societal whole.\n\nThis constructive tension between “distinctive\n[eigentümlich]” and “universal” sides\nof morality survives to constitute the central principle of\nSchleiermacher’s mature ethics lectures. There he begins by\narguing that very general versions or analogues of such a constructive\ntension exist as universal facts of nature—that all finite\nbeings exhibit such a tension; more specifically, that all life does\nso in the form of a tension between autonomy and social commonality;\nand more specifically still, that all human mental life does so in\nthat same form. He then goes on to derive from this a moral duty to\nrealize such a tension in one’s own person.\n\nThis position prompts further questions, to which the answers are not\nentirely clear. First, is Schleiermacher not here guilty of the\nso-called “naturalistic fallacy”, i.e., the fallacy of\nundertaking to deduce an “ought” from an “is”?\nThe answer would depend on the exact nature of his derivation of the\nmoral duty involved from the universal facts of nature, which is\nobscure. Second, how can a synthesis of commonality with individuality\nbe both an unavoidable fact about human nature (e.g., since we can\nnever quite share any concepts, we also can never quite share\nany moral concepts in particular) and a moral duty? There are two\npossible answers to this puzzle. One would appeal to\nSchleiermacher’s determinism and compatibilism: that a mode of\nexistence or behavior is inevitable does not for him preclude its\nmoral obligatoriness. The other would instead appeal to the fact that\nthe sort of synthesis in question can come in varying degrees: it\nmight be that some degree of moral individuality is indeed\ninevitable for the reason mentioned but that the degree that is\nmorally required is greater.\n\nIn addition to the central principle just discussed, three further\naspects of the mature ethics lectures are worth mentioning briefly:\n(a) As was reflected in the argument just sketched,\nSchleiermacher’s mature conception of ethics is that it is\nfundamentally ontological rather than merely prescriptive in\ncharacter: it is based on the immanence of “reason” in\n“nature”, and is hence more fundamentally a matter of an\n“is” than of an “ought”. (b) Accordingly (with\nan eye to the role of “reason” just mentioned), for\nSchleiermacher ethics is not fundamentally a matter of\nsentiments—which, he says, simply vary—but instead of\ncognitions, or more exactly, of something that grounds both ethical\nsentiments and ethical cognitions. (Here Schleiermacher is close to\nagreement with Kant.) (c) Accordingly again (but this time with an eye\nto the predominance of ontology over prescription just mentioned),\nSchleiermacher divides his ethics into a Doctrine of Goods, a Doctrine\nof Virtue, and a Doctrine of Duties, treating them in this sequence in\norder to reflect what he takes to be the priority, or greater\nfundamentalness, of goods over virtues and of virtues over duties.\n\nDespite all of these intriguing lines of thought,\nSchleiermacher’s mature ethics lectures are not one of his\ngreatest successes. They contain a rather unholy mixture of, not only\nethics in the usual sense, but also political philosophy, metaphysics,\nepistemology, and philosophy of mind; lurch back and forth between\nclaims of startling dubiousness and claims of startling banality (with\ntoo little in between); and hold all of this together with a thick\nstain of obscurantism and a thin varnish of systematicity. One is\noften left with the impression that, having put the more critical\nphase of his work in ethics behind him, Schleiermacher found that he\ndid not really have enough constructive to say about the subject to\nfill up the hours in the lecture hall.\n",
    "section_title": "9. Ethics",
    "entry_title": "Friedrich Daniel Ernst Schleiermacher",
    "hierarchy_title": "Friedrich Daniel Ernst Schleiermacher || Ethics",
    "tokenized_text": [
        "ethic",
        "ethic",
        "schleiermacher",
        "ethical",
        "thought",
        "divide",
        "two",
        "overlapping",
        "chronological",
        "phase",
        "first",
        "phasewhich",
        "stretched",
        "late",
        "s",
        "was",
        "mainly",
        "critical",
        "character",
        "early",
        "phase",
        "three",
        "unpublished",
        "essay",
        "highest",
        "good",
        "give",
        "value",
        "life",
        "freedom",
        "mounted",
        "sustained",
        "attack",
        "kant",
        "ethical",
        "theory",
        "end",
        "phase",
        "longer",
        "published",
        "work",
        "outline",
        "critique",
        "previous",
        "ethical",
        "theory",
        "developed",
        "attack",
        "comprehensive",
        "systematic",
        "critique",
        "previous",
        "ethical",
        "theory",
        "second",
        "phasewhich",
        "began",
        "around",
        "was",
        "contrast",
        "mainly",
        "constructive",
        "character",
        "phase",
        "belong",
        "soliloquy",
        "draft",
        "ethic",
        "schleiermacher",
        "mature",
        "ethic",
        "lecture",
        "including",
        "complete",
        "draft",
        "well",
        "number",
        "later",
        "partial",
        "draft",
        "three",
        "early",
        "essay",
        "highest",
        "good",
        "give",
        "value",
        "life",
        "freedom",
        "criticize",
        "reject",
        "central",
        "tenet",
        "kant",
        "moral",
        "philosophy",
        "particular",
        "kant",
        "inclusion",
        "apportioning",
        "happiness",
        "moral",
        "desert",
        "highest",
        "good",
        "summum",
        "bonum",
        "kant",
        "position",
        "must",
        "believed",
        "presupposition",
        "morality",
        "implicit",
        "presupposition",
        "afterlife",
        "soul",
        "god",
        "must",
        "well",
        "doctrine",
        "postulate",
        "kant",
        "incompatibilism",
        "concerning",
        "causal",
        "determinism",
        "freedom",
        "required",
        "moral",
        "responsibility",
        "consequent",
        "recourse",
        "causally",
        "indeterministic",
        "noumenal",
        "realm",
        "locus",
        "freedom",
        "freedom",
        "argues",
        "contrary",
        "human",
        "action",
        "causally",
        "determined",
        "compatible",
        "freedom",
        "required",
        "moral",
        "responsibility",
        "area",
        "disagreement",
        "kant",
        "form",
        "hinge",
        "schleiermacher",
        "development",
        "constructive",
        "ethical",
        "theory",
        "turn",
        "kant",
        "fundamental",
        "moral",
        "principle",
        "categorical",
        "imperative",
        "consisted",
        "according",
        "central",
        "formulation",
        "requirement",
        "agent",
        "moral",
        "maxim",
        "intention",
        "consistent",
        "universalized",
        "conceived",
        "kant",
        "shared",
        "human",
        "being",
        "schleiermacher",
        "reject",
        "position",
        "two",
        "way",
        "first",
        "already",
        "give",
        "value",
        "life",
        "especially",
        "soliloquy",
        "argues",
        "latter",
        "idea",
        "uniformity",
        "ethicsinstead",
        "asserting",
        "spirit",
        "herder",
        "others",
        "influenced",
        "herder",
        "goethe",
        "schiller",
        "fellow",
        "romantic",
        "fact",
        "value",
        "diversity",
        "individuality",
        "even",
        "moral",
        "sphere",
        "connection",
        "schleiermacher",
        "champion",
        "moral",
        "distinctiveness",
        "different",
        "human",
        "society",
        "visàvis",
        "human",
        "specie",
        "whole",
        "herder",
        "main",
        "cause",
        "also",
        "moral",
        "distinctiveness",
        "individual",
        "visàvis",
        "society",
        "also",
        "cause",
        "herder",
        "religion",
        "schleiermacher",
        "make",
        "analogous",
        "case",
        "societal",
        "individual",
        "diversity",
        "religion",
        "positive",
        "evaluation",
        "societal",
        "individual",
        "diversity",
        "naturally",
        "also",
        "extends",
        "beyond",
        "moral",
        "religion",
        "domain",
        "second",
        "schleiermacher",
        "also",
        "reject",
        "content",
        "kant",
        "categorical",
        "imperative",
        "specified",
        "central",
        "formulation",
        "requirement",
        "consistency",
        "maxim",
        "universalization",
        "religion",
        "soliloquy",
        "schleiermacher",
        "rather",
        "inclined",
        "champion",
        "kant",
        "subordinate",
        "formula",
        "commitment",
        "welfare",
        "humanity",
        "though",
        "kant",
        "sense",
        "common",
        "rational",
        "nature",
        "instead",
        "herder",
        "sense",
        "human",
        "being",
        "diversity",
        "well",
        "commonality",
        "religion",
        "also",
        "discus",
        "historical",
        "dimension",
        "principle",
        "humanity",
        "herderian",
        "spirit",
        "like",
        "herder",
        "idea",
        "philosophy",
        "history",
        "humanity",
        "emphasizing",
        "important",
        "role",
        "played",
        "christian",
        "religion",
        "advancing",
        "interpreting",
        "history",
        "progressive",
        "realization",
        "schleiermacher",
        "commitment",
        "humanity",
        "implies",
        "commitment",
        "moral",
        "cosmopolitanism",
        "moral",
        "respect",
        "human",
        "being",
        "seen",
        "espouses",
        "commitment",
        "despite",
        "even",
        "part",
        "recognition",
        "moral",
        "diversity",
        "constitutes",
        "novel",
        "form",
        "moral",
        "cosmopolitanism",
        "pluralist",
        "cosmopolitanism",
        "sharply",
        "contrast",
        "homogenizing",
        "cosmopolitanism",
        "philosophical",
        "tradition",
        "eg",
        "stoic",
        "kant",
        "instead",
        "predicated",
        "assumption",
        "moral",
        "uniformity",
        "innovation",
        "already",
        "anticipated",
        "herder",
        "schleiermacher",
        "embrace",
        "even",
        "clearly",
        "arguably",
        "single",
        "important",
        "contribution",
        "philosophical",
        "reflection",
        "cosmopolitanism",
        "eighteenth",
        "nineteenth",
        "century",
        "position",
        "schleiermacher",
        "might",
        "seem",
        "court",
        "following",
        "sort",
        "problem",
        "though",
        "moral",
        "value",
        "society",
        "individual",
        "conflict",
        "ideal",
        "humanity",
        "example",
        "society",
        "nazi",
        "germany",
        "individual",
        "hitler",
        "soliloquy",
        "schleiermacher",
        "try",
        "forestall",
        "sort",
        "problem",
        "limiting",
        "form",
        "moral",
        "distinctiveness",
        "individuality",
        "support",
        "compatible",
        "even",
        "conducive",
        "ideal",
        "humanity",
        "thus",
        "express",
        "commitment",
        "moral",
        "distinctiveness",
        "individuality",
        "formula",
        "person",
        "individual",
        "without",
        "violating",
        "law",
        "humanity",
        "human",
        "represent",
        "humanity",
        "way",
        "valuable",
        "person",
        "distinctive",
        "relation",
        "humanity",
        "similarly",
        "championing",
        "moral",
        "diversity",
        "individuality",
        "always",
        "combined",
        "requirement",
        "measure",
        "conformity",
        "broader",
        "specieswide",
        "societal",
        "whole",
        "constructive",
        "tension",
        "distinctive",
        "eigentümlich",
        "universal",
        "side",
        "morality",
        "survives",
        "constitute",
        "central",
        "principle",
        "schleiermacher",
        "mature",
        "ethic",
        "lecture",
        "begin",
        "arguing",
        "general",
        "version",
        "analogue",
        "constructive",
        "tension",
        "exist",
        "universal",
        "fact",
        "naturethat",
        "finite",
        "being",
        "exhibit",
        "tension",
        "specifically",
        "life",
        "form",
        "tension",
        "autonomy",
        "social",
        "commonality",
        "specifically",
        "still",
        "human",
        "mental",
        "life",
        "form",
        "go",
        "derive",
        "moral",
        "duty",
        "realize",
        "tension",
        "one",
        "person",
        "position",
        "prompt",
        "question",
        "answer",
        "entirely",
        "clear",
        "first",
        "schleiermacher",
        "guilty",
        "socalled",
        "naturalistic",
        "fallacy",
        "ie",
        "fallacy",
        "undertaking",
        "deduce",
        "ought",
        "answer",
        "would",
        "depend",
        "exact",
        "nature",
        "derivation",
        "moral",
        "duty",
        "involved",
        "universal",
        "fact",
        "nature",
        "obscure",
        "second",
        "synthesis",
        "commonality",
        "individuality",
        "unavoidable",
        "fact",
        "human",
        "nature",
        "eg",
        "since",
        "never",
        "quite",
        "share",
        "concept",
        "also",
        "never",
        "quite",
        "share",
        "moral",
        "concept",
        "particular",
        "moral",
        "duty",
        "two",
        "possible",
        "answer",
        "puzzle",
        "one",
        "would",
        "appeal",
        "schleiermacher",
        "determinism",
        "compatibilism",
        "mode",
        "existence",
        "behavior",
        "inevitable",
        "preclude",
        "moral",
        "obligatoriness",
        "would",
        "instead",
        "appeal",
        "fact",
        "sort",
        "synthesis",
        "question",
        "come",
        "varying",
        "degree",
        "might",
        "degree",
        "moral",
        "individuality",
        "indeed",
        "inevitable",
        "reason",
        "mentioned",
        "degree",
        "morally",
        "required",
        "greater",
        "addition",
        "central",
        "principle",
        "discussed",
        "three",
        "aspect",
        "mature",
        "ethic",
        "lecture",
        "worth",
        "mentioning",
        "briefly",
        "reflected",
        "argument",
        "sketched",
        "schleiermacher",
        "mature",
        "conception",
        "ethic",
        "fundamentally",
        "ontological",
        "rather",
        "merely",
        "prescriptive",
        "character",
        "based",
        "immanence",
        "reason",
        "nature",
        "hence",
        "fundamentally",
        "matter",
        "ought",
        "b",
        "accordingly",
        "eye",
        "role",
        "reason",
        "mentioned",
        "schleiermacher",
        "ethic",
        "fundamentally",
        "matter",
        "sentimentswhich",
        "say",
        "simply",
        "varybut",
        "instead",
        "cognition",
        "exactly",
        "something",
        "ground",
        "ethical",
        "sentiment",
        "ethical",
        "cognition",
        "schleiermacher",
        "close",
        "agreement",
        "kant",
        "c",
        "accordingly",
        "time",
        "eye",
        "predominance",
        "ontology",
        "prescription",
        "mentioned",
        "schleiermacher",
        "divide",
        "ethic",
        "doctrine",
        "good",
        "doctrine",
        "virtue",
        "doctrine",
        "duty",
        "treating",
        "sequence",
        "order",
        "reflect",
        "take",
        "priority",
        "greater",
        "fundamentalness",
        "good",
        "virtue",
        "virtue",
        "duty",
        "despite",
        "intriguing",
        "line",
        "thought",
        "schleiermacher",
        "mature",
        "ethic",
        "lecture",
        "one",
        "greatest",
        "success",
        "contain",
        "rather",
        "unholy",
        "mixture",
        "ethic",
        "usual",
        "sense",
        "also",
        "political",
        "philosophy",
        "metaphysics",
        "epistemology",
        "philosophy",
        "mind",
        "lurch",
        "back",
        "forth",
        "claim",
        "startling",
        "dubiousness",
        "claim",
        "startling",
        "banality",
        "little",
        "hold",
        "together",
        "thick",
        "stain",
        "obscurantism",
        "thin",
        "varnish",
        "systematicity",
        "one",
        "often",
        "left",
        "impression",
        "put",
        "critical",
        "phase",
        "work",
        "ethic",
        "behind",
        "schleiermacher",
        "found",
        "really",
        "enough",
        "constructive",
        "say",
        "subject",
        "fill",
        "hour",
        "lecture",
        "hall"
    ]
}