{
    "main_text": "Life: 1788–1860\n1. Life: 1788–1860\n\nExactly a month younger than the English Romantic poet, Lord Byron\n(1788–1824), who was born on January 22, 1788, Arthur\nSchopenhauer came into the world on February 22, 1788 in Danzig\n[Gdansk, Poland] – a city that had a long history in\ninternational trade as a member of the Hanseatic League. The\nSchopenhauer family was of Dutch heritage, and the philosopher’s\nfather, Heinrich Floris Schopenhauer (1747–1805), was a\nsuccessful merchant and shipowner who groomed his son to assume\ncontrol of the family’s business. A future in the international\nbusiness trade was envisioned from the day Arthur was born, as\nreflected in how Schopenhauer’s father carefully chose his\nson’s first name on account of its identical spelling in German,\nFrench and English. In March 1793, when Schopenhauer was five years\nold, his family moved to the Free and Hanseatic City of Hamburg after\nthe formerly free city of Danzig was annexed by Prussia.\n\nSchopenhauer toured through Europe several times with his family as a\nyoungster and young teenager, and lived in France (1797–99)\n[ages 9–11] and England (1803) [age 15], where he learned the\nlanguages of those countries. As he later reported, his experiences in\nFrance were among the happiest of his life. The memories of his stay\nat a strict, Anglican-managed boarding school in Wimbledon were rather\nagonized in contrast, and this set him against the English style of\nChristianity for the rest of his life.\n\nThe professional occupations of a merchant or banker were not\nsufficiently consistent with Schopenhauer’s scholarly\ndisposition, and although for two years after his father’s death\n(in Hamburg, April 20, 1805; possibly by suicide, when Schopenhauer\nwas seventeen) he continued to respect the commercial aspirations his\nfather had had for him, he finally left his Hamburg business\napprenticeship at age 19 to prepare for university studies. In the\nmeantime, his mother, Johanna Henriette Troisiener Schopenhauer\n(1766–1838), who was the daughter of a city senator, along with\nSchopenhauer’s sister, Luise Adelaide [Adele] Lavinia\nSchopenhauer (1797–1849), left their Hamburg home at Neuer\nWandrahm 92 and moved to Weimar after Heinrich Floris’s death,\nwhere Johanna established a friendship with Johann Wolfgang von Goethe\n(1749–1832). In Weimar, Goethe frequently visited\nJohanna’s intellectual salon, and Johanna Schopenhauer became a\nwell-known writer of the period, producing a voluminous assortment of\nessays, travelogues, novels (e.g., Gabriele [1819], Die\nTante [1823], Sidonia [1827], Richard Wood\n[1837]), and biographies, such as her accounts of the German art\ncritic, archaeologist, and close friend, Carl Ludwig Fernow\n(1763–1808), and of the Flemish painter, Jan van Eyck\n(c.1390–1441), published in 1810 and 1822 respectively. Her\ncomplete works total twenty-four volumes.\n\nIn 1809, Schopenhauer began studies at the University of\nGöttingen, where he remained for two years, first majoring in\nmedicine, and then, philosophy. In Göttingen, he absorbed the\nviews of the skeptical philosopher, Gottlob Ernst Schulze\n(1761–1833), who introduced him to Plato and Kant. Schopenhauer\nnext enrolled at the University of Berlin (1811–13), where his\nlecturers included Johann Gottlieb Fichte (1762–1814) and\nFriedrich Schleiermacher (1768–1834). His university studies in\nGöttingen and Berlin included courses in physics, psychology,\nastronomy, zoology, archaeology, physiology, history, literature, and\npoetry. At age 25, and ready to write his doctoral dissertation,\nSchopenhauer moved in 1813 to Rudolstadt, a small town located a short\ndistance southwest of Jena, where he lodged for the duration in an inn\nnamed Zum Ritter. Entitling his work The Fourfold Root of\nthe Principle of Sufficient Reason (Über die vierfache\nWurzel des Satzes vom zureichenden Grunde), it formed the\ncenterpiece of his later philosophy, articulating arguments he would\nlater use to criticize as charlatans, the prevailing German Idealistic\nphilosophers of the time, namely, his former lecturer, J. G. Fichte,\nalong with F. W. J. Schelling (1775–1854) and G. W. F. Hegel\n(1770–1831). In that same year, Schopenhauer submitted his\ndissertation to the nearby University of Jena and was awarded a\ndoctorate in philosophy in absentia. \n\nLeaving his mother’s apartment in 1814 where he had been\nresiding briefly, Schopenhauer moved to Dresden, where he lived until\n1818. There he developed ideas from The Fourfold Root into\nhis most famous book, The World as Will and Representation,\nthat was completed in March of 1818 and published in December of that\nsame year (with the date, 1819). In sympathy with Goethe’s\ntheory of color, he also wrote On Vision and Colors (1816)\nduring this time. In Dresden, Schopenhauer developed an acquaintance\nwith the philosopher and freemason, Karl Christian Friedrich Krause\n(1781–1832), who had also been one of Fichte’s students in\nBerlin, whose own panentheistic views appear to have been influential.\nPanentheism (i.e., all-in-God), as opposed to pantheism (i.e.,\nall-is-God), is the view that what we can comprehend and imagine to be\nthe universe is an aspect of God, but that the being of God is in\nexcess of this, and is neither identical with, nor exhausted by, the\nuniverse we can imagine and comprehend. As we will see below,\nSchopenhauer sometimes characterized the thing-in-itself in a way\nreminiscent of panentheism.\n\nAfter a year’s vacation in Italy and with The World as Will\nand Representation in hand, Schopenhauer applied for the\nopportunity to lecture at the University of Berlin, the institution at\nwhich he had formerly studied, and where two years earlier (1818),\nHegel had arrived to assume Fichte’s prestigious philosophical\nchair. His experiences in Berlin were less than professionally\nfruitful, however, for in March of 1820, Schopenhauer self-assuredly\nscheduled his class at a time that was simultaneous with Hegel’s\npopular lectures, and few students chose to hear Schopenhauer. Two\nyears later, in 1822, he left his apartment near the University and\ntravelled to Italy for a second time, returning to Munich a year\nlater. He then lived in Mannheim and Dresden in 1824 before tracing\nhis way back to Berlin in 1825. A second attempt to lecture at the\nUniversity of Berlin was unsuccessful, and this disappointment was\ncomplicated by the loss of a lawsuit that had begun several years\nearlier in August, 1821. The dispute issued from an angry\nshoving-match between Schopenhauer and Caroline Luise Marguet (d.\n1852), a 47-year-old seamstress, that occurred in the rooming house\nwhere they were both living. The issue concerned Ms. Marguet’s\nconversing loudly with her associates in the anteroom of\nSchopenhauer’s apartment, making it difficult for him to\nconcentrate on his work. The conversations were apparently a matter of\nroutine that built up Schopenhauer’s animosity, leading to the\nexplosive confrontation.\n\nLeaving Berlin in 1831 in view of a cholera epidemic that was entering\nGermany from Russia, Schopenhauer moved south, first briefly to\nFrankfurt-am-Main, and then to Mannheim. Shortly thereafter, in June\nof 1833, he settled permanently in Frankfurt, where he remained for\nthe next twenty-seven years, residing in an apartment along the river\nMain’s waterfront from 1843 to 1859 at Schöne Aussicht 17,\na few minutes walking distance from Frankfurt’s Judengasse. His\ndaily life, living alone with a succession of pet French poodles, was defined by a deliberate routine:\nSchopenhauer would awake, wash, read and study during the morning\nhours, play his flute, lunch at the Englisher Hof – a\nfashionable inn at the city center near the Hauptwache\n– rest afterwards, read, take an afternoon walk, check the world\nevents as reported in The London Times, sometimes attend\nconcerts in the evenings, and frequently read inspirational texts such\nas the Upanishads before going to sleep. \n\nDuring this later phase of his life, Schopenhauer wrote a short work\nin 1836, Über den Willen in der Natur (On the Will\nin Nature), that aimed to confirm and reiterate his metaphysical\nviews in light of scientific evidence. Featured in this work are\nchapters on animal magnetism and magic, along with Sinology (Chinese\nstudies). The former reveals Schopenhauer’s interest in\nparapsychology; the latter is valuable for its references to the\npreeminent Neo-Confucian scholar, Zhu Xi (1130-1200), as well as to\ninfluential writers on Asian thought from the period such as Robert\nSpence Hardy (1803–1868) and Isaac Jacob Schmidt\n(1779–1847).\n\nShortly thereafter in 1839, Schopenhauer completed an essay of which\nhe was immensely proud, “On the Freedom of Human Will”\n(Über die Freiheit des menschlichen Willens), that was\nawarded first prize in a competition sponsored by the Royal Norwegian\nSociety of Sciences and Letters in Trondheim. A year later, he\ncomplemented this with a second essay, “On the Basis of\nMorality” (Über die Grundlage der Moral) that was\nnot honored with an award by The Royal Danish Society of the Sciences\nin Copenhagen, even though it was the sole submission in their essay\ncompetition. The Society claimed that Schopenhauer did not answer the\nassigned question and that he gravely disrespected philosophers with\noutstanding reputations (viz., Fichte and Hegel). In 1841,\nSchopenhauer defiantly published both essays together as Two\nFundamental Problems of Ethics (Die Beiden Grundprobleme der\nEthik). There soon followed an accompanying volume to The\nWorld as Will and Representation, that was published in 1844\nalong with the first volume in a combined second edition. \n\nIn 1851, Schopenhauer published a lengthy and lively set of\nphilosophical reflections entitled Parerga and Paralipomena\n(appendices and omissions, from the Greek), and within a couple of\nyears, he began to receive the philosophical recognition for which he\nhad long hoped. The recognition was stimulated by a favorable review\nof his philosophy (“Iconoclasm in German Philosophy,” by John Oxenford) published in 1853 without signature in the influential Westminster Review, which at the time was under the editorial guidance of George Eliot (Mary Ann Evans).  The review acknowledged the centrality of “Will” within Schopenhauer’s outlook and drew insightful parallels between Schopenhauer’s and\nFichte’s more well-known thought. A year after the third edition\nof The World as Will and Representation appeared with further revisions in 1859,\nSchopenhauer died peacefully on September 21, 1860, in his apartment\nin Frankfurt at Schöne Aussicht 16. He was 72. After his death,\nJulius Frauenstädt (1813–1879) published new editions of\nmost of Schopenhauer’s works, with the first complete edition\n(six volumes) appearing in 1873. In the 20th century, the editorial\nwork on Schopenhauer’s manuscripts was carried forth in\nauthoritative depth by Arthur Hübscher (1897–1985).\n\nSchopenhauer donated his estate to help disabled Prussian soldiers and\nthe families of those soldiers killed, who had participated in the\nsuppression of the 1848 revolution. An assortment of photographs of\nSchopenhauer was taken during his final years, and although they\nreveal to us an old man, we should appreciate that Schopenhauer\ncompleted his main work, The World as Will and\nRepresentation, by the time he had reached the age of thirty.\n",
    "section_title": "1. Life: 1788–1860",
    "entry_title": "Arthur Schopenhauer",
    "hierarchy_title": "Arthur Schopenhauer || Life: 1788–1860",
    "tokenized_text": [
        "life",
        "life",
        "exactly",
        "month",
        "younger",
        "english",
        "romantic",
        "poet",
        "lord",
        "byron",
        "born",
        "january",
        "arthur",
        "schopenhauer",
        "came",
        "world",
        "february",
        "danzig",
        "gdansk",
        "poland",
        "city",
        "long",
        "history",
        "international",
        "trade",
        "member",
        "hanseatic",
        "league",
        "schopenhauer",
        "family",
        "dutch",
        "heritage",
        "philosopher",
        "father",
        "heinrich",
        "floris",
        "schopenhauer",
        "successful",
        "merchant",
        "shipowner",
        "groomed",
        "son",
        "assume",
        "control",
        "family",
        "business",
        "future",
        "international",
        "business",
        "trade",
        "envisioned",
        "day",
        "arthur",
        "born",
        "reflected",
        "schopenhauer",
        "father",
        "carefully",
        "chose",
        "son",
        "first",
        "name",
        "account",
        "identical",
        "spelling",
        "german",
        "french",
        "english",
        "march",
        "schopenhauer",
        "five",
        "year",
        "old",
        "family",
        "moved",
        "free",
        "hanseatic",
        "city",
        "hamburg",
        "formerly",
        "free",
        "city",
        "danzig",
        "annexed",
        "prussia",
        "schopenhauer",
        "toured",
        "europe",
        "several",
        "time",
        "family",
        "youngster",
        "young",
        "teenager",
        "lived",
        "france",
        "age",
        "england",
        "age",
        "learned",
        "language",
        "country",
        "later",
        "reported",
        "experience",
        "france",
        "among",
        "happiest",
        "life",
        "memory",
        "stay",
        "strict",
        "anglicanmanaged",
        "boarding",
        "school",
        "wimbledon",
        "rather",
        "agonized",
        "contrast",
        "set",
        "english",
        "style",
        "christianity",
        "rest",
        "life",
        "professional",
        "occupation",
        "merchant",
        "banker",
        "sufficiently",
        "consistent",
        "schopenhauer",
        "scholarly",
        "disposition",
        "although",
        "two",
        "year",
        "father",
        "death",
        "hamburg",
        "april",
        "possibly",
        "suicide",
        "schopenhauer",
        "seventeen",
        "continued",
        "respect",
        "commercial",
        "aspiration",
        "father",
        "finally",
        "left",
        "hamburg",
        "business",
        "apprenticeship",
        "age",
        "prepare",
        "university",
        "study",
        "meantime",
        "mother",
        "johanna",
        "henriette",
        "troisiener",
        "schopenhauer",
        "daughter",
        "city",
        "senator",
        "along",
        "schopenhauer",
        "sister",
        "luise",
        "adelaide",
        "adele",
        "lavinia",
        "schopenhauer",
        "left",
        "hamburg",
        "home",
        "neuer",
        "wandrahm",
        "moved",
        "weimar",
        "heinrich",
        "floris",
        "death",
        "johanna",
        "established",
        "friendship",
        "johann",
        "wolfgang",
        "von",
        "goethe",
        "weimar",
        "goethe",
        "frequently",
        "visited",
        "johanna",
        "intellectual",
        "salon",
        "johanna",
        "schopenhauer",
        "became",
        "wellknown",
        "writer",
        "period",
        "producing",
        "voluminous",
        "assortment",
        "essay",
        "travelogue",
        "novel",
        "eg",
        "gabriele",
        "die",
        "tante",
        "sidonia",
        "richard",
        "wood",
        "biography",
        "account",
        "german",
        "art",
        "critic",
        "archaeologist",
        "close",
        "friend",
        "carl",
        "ludwig",
        "fernow",
        "flemish",
        "painter",
        "jan",
        "van",
        "eyck",
        "c",
        "published",
        "respectively",
        "complete",
        "work",
        "total",
        "twentyfour",
        "volume",
        "schopenhauer",
        "began",
        "study",
        "university",
        "göttingen",
        "remained",
        "two",
        "year",
        "first",
        "majoring",
        "medicine",
        "philosophy",
        "göttingen",
        "absorbed",
        "view",
        "skeptical",
        "philosopher",
        "gottlob",
        "ernst",
        "schulze",
        "introduced",
        "plato",
        "kant",
        "schopenhauer",
        "next",
        "enrolled",
        "university",
        "berlin",
        "lecturer",
        "included",
        "johann",
        "gottlieb",
        "fichte",
        "friedrich",
        "schleiermacher",
        "university",
        "study",
        "göttingen",
        "berlin",
        "included",
        "course",
        "physic",
        "psychology",
        "astronomy",
        "zoology",
        "archaeology",
        "physiology",
        "history",
        "literature",
        "poetry",
        "age",
        "ready",
        "write",
        "doctoral",
        "dissertation",
        "schopenhauer",
        "moved",
        "rudolstadt",
        "small",
        "town",
        "located",
        "short",
        "distance",
        "southwest",
        "jena",
        "lodged",
        "duration",
        "inn",
        "named",
        "zum",
        "ritter",
        "entitling",
        "work",
        "fourfold",
        "root",
        "principle",
        "sufficient",
        "reason",
        "über",
        "die",
        "vierfache",
        "wurzel",
        "de",
        "satzes",
        "vom",
        "zureichenden",
        "grunde",
        "formed",
        "centerpiece",
        "later",
        "philosophy",
        "articulating",
        "argument",
        "would",
        "later",
        "use",
        "criticize",
        "charlatan",
        "prevailing",
        "german",
        "idealistic",
        "philosopher",
        "time",
        "namely",
        "former",
        "lecturer",
        "j",
        "g",
        "fichte",
        "along",
        "f",
        "w",
        "j",
        "schelling",
        "g",
        "w",
        "f",
        "hegel",
        "year",
        "schopenhauer",
        "submitted",
        "dissertation",
        "nearby",
        "university",
        "jena",
        "awarded",
        "doctorate",
        "philosophy",
        "absentia",
        "leaving",
        "mother",
        "apartment",
        "residing",
        "briefly",
        "schopenhauer",
        "moved",
        "dresden",
        "lived",
        "developed",
        "idea",
        "fourfold",
        "root",
        "famous",
        "book",
        "world",
        "representation",
        "completed",
        "march",
        "published",
        "december",
        "year",
        "date",
        "sympathy",
        "goethe",
        "theory",
        "color",
        "also",
        "wrote",
        "vision",
        "color",
        "time",
        "dresden",
        "schopenhauer",
        "developed",
        "acquaintance",
        "philosopher",
        "freemason",
        "karl",
        "christian",
        "friedrich",
        "krause",
        "also",
        "one",
        "fichte",
        "student",
        "berlin",
        "whose",
        "panentheistic",
        "view",
        "appear",
        "influential",
        "panentheism",
        "ie",
        "allingod",
        "opposed",
        "pantheism",
        "ie",
        "allisgod",
        "view",
        "comprehend",
        "imagine",
        "universe",
        "aspect",
        "god",
        "god",
        "excess",
        "neither",
        "identical",
        "exhausted",
        "universe",
        "imagine",
        "comprehend",
        "see",
        "schopenhauer",
        "sometimes",
        "characterized",
        "thinginitself",
        "way",
        "reminiscent",
        "panentheism",
        "year",
        "vacation",
        "italy",
        "world",
        "representation",
        "hand",
        "schopenhauer",
        "applied",
        "opportunity",
        "lecture",
        "university",
        "berlin",
        "institution",
        "formerly",
        "studied",
        "two",
        "year",
        "earlier",
        "hegel",
        "arrived",
        "assume",
        "fichte",
        "prestigious",
        "philosophical",
        "chair",
        "experience",
        "berlin",
        "le",
        "professionally",
        "fruitful",
        "however",
        "march",
        "schopenhauer",
        "selfassuredly",
        "scheduled",
        "class",
        "time",
        "simultaneous",
        "hegel",
        "popular",
        "lecture",
        "student",
        "chose",
        "hear",
        "schopenhauer",
        "two",
        "year",
        "later",
        "left",
        "apartment",
        "near",
        "university",
        "travelled",
        "italy",
        "second",
        "time",
        "returning",
        "munich",
        "year",
        "later",
        "lived",
        "mannheim",
        "dresden",
        "tracing",
        "way",
        "back",
        "berlin",
        "second",
        "attempt",
        "lecture",
        "university",
        "berlin",
        "unsuccessful",
        "disappointment",
        "complicated",
        "loss",
        "lawsuit",
        "begun",
        "several",
        "year",
        "earlier",
        "august",
        "dispute",
        "issued",
        "angry",
        "shovingmatch",
        "schopenhauer",
        "caroline",
        "luise",
        "marguet",
        "d",
        "yearold",
        "seamstress",
        "occurred",
        "rooming",
        "house",
        "living",
        "issue",
        "concerned",
        "ms",
        "marguet",
        "conversing",
        "loudly",
        "associate",
        "anteroom",
        "schopenhauer",
        "apartment",
        "making",
        "difficult",
        "concentrate",
        "work",
        "conversation",
        "apparently",
        "matter",
        "routine",
        "built",
        "schopenhauer",
        "animosity",
        "leading",
        "explosive",
        "confrontation",
        "leaving",
        "berlin",
        "view",
        "cholera",
        "epidemic",
        "entering",
        "germany",
        "russia",
        "schopenhauer",
        "moved",
        "south",
        "first",
        "briefly",
        "frankfurtammain",
        "mannheim",
        "shortly",
        "thereafter",
        "june",
        "settled",
        "permanently",
        "frankfurt",
        "remained",
        "next",
        "twentyseven",
        "year",
        "residing",
        "apartment",
        "along",
        "river",
        "main",
        "waterfront",
        "schöne",
        "aussicht",
        "minute",
        "walking",
        "distance",
        "frankfurt",
        "judengasse",
        "daily",
        "life",
        "living",
        "alone",
        "succession",
        "pet",
        "french",
        "poodle",
        "defined",
        "deliberate",
        "routine",
        "schopenhauer",
        "would",
        "awake",
        "wash",
        "read",
        "study",
        "morning",
        "hour",
        "play",
        "flute",
        "lunch",
        "englisher",
        "hof",
        "fashionable",
        "inn",
        "city",
        "center",
        "near",
        "hauptwache",
        "rest",
        "afterwards",
        "read",
        "take",
        "afternoon",
        "walk",
        "check",
        "world",
        "event",
        "reported",
        "london",
        "time",
        "sometimes",
        "attend",
        "concert",
        "evening",
        "frequently",
        "read",
        "inspirational",
        "text",
        "upanishad",
        "going",
        "sleep",
        "later",
        "phase",
        "life",
        "schopenhauer",
        "wrote",
        "short",
        "work",
        "über",
        "den",
        "willen",
        "der",
        "natur",
        "nature",
        "aimed",
        "confirm",
        "reiterate",
        "metaphysical",
        "view",
        "light",
        "scientific",
        "evidence",
        "featured",
        "work",
        "chapter",
        "animal",
        "magnetism",
        "magic",
        "along",
        "sinology",
        "chinese",
        "study",
        "former",
        "reveals",
        "schopenhauer",
        "interest",
        "parapsychology",
        "latter",
        "valuable",
        "reference",
        "preeminent",
        "neoconfucian",
        "scholar",
        "zhu",
        "xi",
        "well",
        "influential",
        "writer",
        "asian",
        "thought",
        "period",
        "robert",
        "spence",
        "hardy",
        "isaac",
        "jacob",
        "schmidt",
        "shortly",
        "thereafter",
        "schopenhauer",
        "completed",
        "essay",
        "immensely",
        "proud",
        "freedom",
        "human",
        "über",
        "die",
        "freiheit",
        "de",
        "menschlichen",
        "willens",
        "awarded",
        "first",
        "prize",
        "competition",
        "sponsored",
        "royal",
        "norwegian",
        "society",
        "science",
        "letter",
        "trondheim",
        "year",
        "later",
        "complemented",
        "second",
        "essay",
        "basis",
        "morality",
        "über",
        "die",
        "grundlage",
        "der",
        "moral",
        "honored",
        "award",
        "royal",
        "danish",
        "society",
        "science",
        "copenhagen",
        "even",
        "though",
        "sole",
        "submission",
        "essay",
        "competition",
        "society",
        "claimed",
        "schopenhauer",
        "answer",
        "assigned",
        "question",
        "gravely",
        "disrespected",
        "philosopher",
        "outstanding",
        "reputation",
        "viz",
        "fichte",
        "hegel",
        "schopenhauer",
        "defiantly",
        "published",
        "essay",
        "together",
        "two",
        "fundamental",
        "problem",
        "ethic",
        "die",
        "beiden",
        "grundprobleme",
        "der",
        "ethik",
        "soon",
        "followed",
        "accompanying",
        "volume",
        "world",
        "representation",
        "published",
        "along",
        "first",
        "volume",
        "combined",
        "second",
        "edition",
        "schopenhauer",
        "published",
        "lengthy",
        "lively",
        "set",
        "philosophical",
        "reflection",
        "entitled",
        "parerga",
        "paralipomena",
        "appendix",
        "omission",
        "greek",
        "within",
        "couple",
        "year",
        "began",
        "receive",
        "philosophical",
        "recognition",
        "long",
        "hoped",
        "recognition",
        "stimulated",
        "favorable",
        "review",
        "philosophy",
        "iconoclasm",
        "german",
        "philosophy",
        "john",
        "oxenford",
        "published",
        "without",
        "signature",
        "influential",
        "westminster",
        "review",
        "time",
        "editorial",
        "guidance",
        "george",
        "eliot",
        "mary",
        "ann",
        "evans",
        "review",
        "acknowledged",
        "centrality",
        "within",
        "schopenhauer",
        "outlook",
        "drew",
        "insightful",
        "parallel",
        "schopenhauer",
        "fichte",
        "wellknown",
        "thought",
        "year",
        "third",
        "edition",
        "world",
        "representation",
        "appeared",
        "revision",
        "schopenhauer",
        "died",
        "peacefully",
        "september",
        "apartment",
        "frankfurt",
        "schöne",
        "aussicht",
        "death",
        "julius",
        "frauenstädt",
        "published",
        "new",
        "edition",
        "schopenhauer",
        "work",
        "first",
        "complete",
        "edition",
        "six",
        "volume",
        "appearing",
        "th",
        "century",
        "editorial",
        "work",
        "schopenhauer",
        "manuscript",
        "carried",
        "forth",
        "authoritative",
        "depth",
        "arthur",
        "hübscher",
        "schopenhauer",
        "donated",
        "estate",
        "help",
        "disabled",
        "prussian",
        "soldier",
        "family",
        "soldier",
        "killed",
        "participated",
        "suppression",
        "revolution",
        "assortment",
        "photograph",
        "schopenhauer",
        "taken",
        "final",
        "year",
        "although",
        "reveal",
        "u",
        "old",
        "man",
        "appreciate",
        "schopenhauer",
        "completed",
        "main",
        "work",
        "world",
        "representation",
        "time",
        "reached",
        "age",
        "thirty"
    ]
}