{
    "main_text": "Historiography and Theology\n6. Historiography and Theology\n\n\nEarly on Scholem became committed to critical historical scholarship\nas a mode of not only understanding the past but reconstructing the\npresent. That is, history and philology were, for him, the only basis\nfor any legitimate Jewish theology in a world that could no longer\nsupport authentic mysticism. While he did write theological essays, one\ncould argue that his historical/philological essays also had a\ntheological foundation. Scholem grew up in a world (Weimar Germany and\nthen Mandate Palestine) that was rife with intellectual activity all\nfocused on the reconstruction of Jewish life and culture around\nZionism. The Hebrew University (which began as an “Institute for\nJewish Studies” in 1924) where he taught, was expressly created\nfor that purpose. Scholem's historical work emerged as a critique\nof two distinct movements.\n\n\nThe first was the Wissenschaft des Judentums (the Science\nof Judaism), led by the 19th century Jewish historians\nLeopold Zunz, Moritz Steinschneider, and Henrich Graetz.\nThese historians reconstructed Jewish history for a newly\nemancipated western European Jewish community placing special emphasis\non normative rabbinic literature and culture (Talmud and Midrash) and\nthe medieval rationalist tradition as the backbone of Judaism. They\nignored or disparaged all forms of mysticism and Kabbala, claiming it\nto be an outdated and dark part of the Jewish past. Scholem's\nentire re-construction of Kabbala (and by extension of Judaism) would\nbe an unrelenting battle against them. As he wrote in a 1944 essay\n“Modern Jewish Studies” “In brief: the stones that\nwere rejected by the builders [the Science of Judaism] will become the\ncornerstone.” Scholem referred to their rejection of\nKabbala as the “origin sin” of the Science of Judaism from\nwhich everything else was merely an extension. This sentiment was\nreiterated in a 1962 essay “What Others Rejected: Kabbala and\nHistorical Criticism” delivered upon receiving one of the\nRothschild Prizes. While Scholem claimed laconically that the exilic\nand thus apologetic mentality that tainted the Science of\nJudaism's historical project was not, in fact, rectified with the\nnew national and sovereign consciousness he also acknowledged that\nnationalism (one form of Zionism) presented its own distorting lenses\neven as it corrected some mistakes of the past.\n\n\nSecond, in the early decades of the 20th century the philosophies of\nHermann Cohen and Martin Buber — the former a neo-Kantian\nrationalist, the latter a romantic existentialist—were immensely\npopular. Scholem rejected both grand schemes in favor of careful\nhistorical analysis of the regnant literary sources of Judaism. In\naddition, in response to Adolph von Harnack's influential The\nEssence of Christianity (Harnack argued, among other things, that\nChristianity was rooted in Gnosticism and thus needn't be\ndependent on any Jewish sources damaging the very idea of a German\nJewish culture) theologians such as Leo Baeck argued for an\n‘essence’ of Judaism to counter Harnack's position\nthat Judaism was irrelevant and illegitimate for Christianity.\nBuber and Scholem both rejected the notion of an essence of Judaism yet\nboth differed on the alternative. Buber focused on the notion of\nErlebnis, or intuitive experience, as the anchor of a\nhuman's relationship to God via revelation (or relation). That\nis, for Buber, experience was a meta-lingual phenomenon and thus\nlanguage was inferior to pure experience. For Buber, then, there is no\nessence of Judaism but there may be an essence of religious experience\nthat transcends language and thus particularity. Scholem rejected this\nand argued that Judaism can only be renewed through the historical\nconsciousness of Erfahrung or concrete historical experience.\nThis kind of experience is mediated through language, specifically, the\nlanguage of the textual tradition. Influenced by Walter\nBenjamin's early theory of language, Scholem argued that language\nwas of “divine origin” (however this is understood) and\nthus the experience of revelation was itself linguistic. For Scholem,\ntherefore, there is no essential religious experience as all\nhuman experience is mediated through language and thus particular to a\ncultural and linguistic context. He also held there was no essence of\nJudaism if by that we mean some core sets of values that can be\nexhibited in all forms of Jewish literature. \n\n\nFor him Judaism is, according to one close reader of Scholem\n“an anarchistic plurality of sources.” Thus the best way to\nunderstand Judaism is through the philological and historical analysis\nof those sources without any pre-conceived vision of a grand narrative\nthat unites them. Scholem's position against the Essentialist\nschool surfaces in the first chapter of Major Trends where he\nstruggles to define the mystical experience. It surfaces again in the\n1960's and 1970's in light of the nature of language in\n“On the Name of God and Linguistic Theory in Kabbala.” The\n“Name of God” essay was a topic Scholem first expressed\ninterest in writing in the early 1920's until he realized he did\nnot have sufficient knowledge of Kabbala to do so. The essay was\npublished in two parts in 1972. In Major Trends he navigates a\nposition between the essentialists and the pure constructivist\nposition. It should be noted that even given Scholem's dependence\non language, he does not advocate a pure constructivist position on the\nnature of experience. That is, he does not argue there is\nsimply no meaning whatsoever to experience outside of language or that\nthere is no experience outside of language. Language for Scholem is a\nvehicle for understanding experience but whether it is, in fact, the\nvery origin of experience is something Scholem never definitively\nargues and remains a issue of debate among Scholem's\ninterpreters.\n\n\nThe historiographical dimension of Scholem's reconstruction of\nJudaism is perhaps his most contested thesis. He offers a kind of\nHegelian position. In brief it unfolds as follows: The biblical period\nis where Judaism struggles to free itself of pure myth and, while\npartially successful, never quite severs itself from the mythic world\nof its surroundings. This period is followed by the rabbinic period of\nlate antiquity introducing the institutional period of the Jewish\nreligion. The rabbis suppressed myth, magic, and cult in favor of a\nnormalized legal system that rationalized biblical mythic motifs and\npresented a God who, while not impersonal, was more distant from human\nexperience than in the biblical period which was centered on prophecy.\nThe Jewish Middle Ages began with Judaism's absorption of\nHellenistic/rational culture and produced a God even more distant than\nthe rabbinic God. Moreover, in this period while law remained\nobligatory it was challenged by reason as the sine qua non of the\nreligious life. Myth moves from a sate of suppression to being outright\nrejected. It is here, Scholem posits, that Kabbala enters. In part a\nreaction against medieval rationalism (curiously not unlike\nScholem's rejection of the Enlightenment rationalism of the\nScience of Judaism) Kabbala emerges in part to revive the biblical myth\nand also offer myths of its own born from a reification of rabbinic\nMidrash into a mystical cosmology. In Hegelian fashion, this mystical\nperiod then results in a renewal of rationalism in the Enlightenment\nwhere mysticism moves underground again (it is rejected by the\nproponents of the Science of Judaism) to be followed by its resurgence\nin yet another period of Jewish self-assertion and its re-connection to\nland and power in Zionism. This dialectical approach has been duly\ncriticized as “too neat” ignoring the messy edges of any\nhistorical epoch. For example, some have argued that Scholem\nintentionally downplays the mythic components in rabbinic Judaism and\nthe ways in which early kabbalists also fashioned themselves as\nphilosophers. For example, the ecstatic mystic Abraham Abulafia wrote\ncommentaries to Maimonides' rational work and did not consider\nhis own project as contradictory to Maimonides. The critique continues\nthat Scholem favored the more “mythic” kabbalistic schools\nsuch as the Rhineland pietists, the Zohar, Luria, Sabbatai Zevi, and\nHasidism because they serve his purpose and viewed those who do not as\nnot central to the historical trajectory of Kabbala.\n\n\nOne of the vexing questions in Scholem's historiographical\nrendering of Kabbala is the place of myth in medieval kabbalistic\nliterature. On the one hand, Scholem seems to prefer symbol over myth\nwhen discussing Kabbala, suggesting that Kabbala's reification of\nthe biblical narrative does not yield a mythic drama, including a cadre\nof mythic figures, but rather a series of symbolic clusters or\nhypostatic forms that are identified through the prism of the\npersonalities in the Hebrew Bible. On the other hand, in numerous\nplaces Scholem suggests Kabbala re-introduces myth into the Jewish\ndiscourse as a critique of Judaism's rational expositors. Critics\nhave suggested Scholem underestimated the mythic nature of theosophic\nKabbala (the Zohar and its interpreters) and was too invested in\nnotions of symbolism that were common in his time (e.g. Jung, Ricoeur,\nEliade). In any event, the question of myth versus symbol in Kabbala\nremains an important issue to be examined by Scholem's readers\nand future scholars. One important consequence of this question is\nwhether one defines Scholem's dialectical historiography as\nHegelian or psychoanalytic. If we say myth yields to symbolism in\nKabbala, Kabbala's new Jewish theology would better fit into the\nHegelian mode as an antithesis to medieval rationalism. If we say myth\ndominates symbol in Kabbala, we could argue for a case of the Freudian\n“return of the repressed” where the ancient Israelite myth\nrepressed by rabbinic institutionalization and medieval rationalism\nreturns to undermine both, even as it ostensibly remains wedded to the\northodoxy rabbinic Judaism provides.\n\n\nIn any case, it is hard to know exactly how seriously Scholem intended\nus to take his dialectical historiography or whether, in fact, it\nserved more as a heuristic tool to enable us to see a sweeping picture\nthat subsequent generations could revise. It is also worth considering\nhow much the warp and woof of the messianic and antinomian that\nunderlies much of Scholem's historiography of Kabbala is born\nfrom, and serves, his Zionism, In an interview a short time before his\ndeath he admitted that he believed his work was already\n“dated” and thus, I assume, in need of revision and\nrevaluation. Given the waning belief in grand narratives,\nScholem's historiography has met sharp criticism yet there is\nlittle doubt its main features have thus far stood the test of\ntime.\n\n\nA second component that accompanies Scholem's dialectic of myth,\nrationalism, and mysticism is his theory of esotericism. Committed to\nthe notion that social and cultural change are driven by ideas more\nthan events, Scholem adds that the ideas that often have the most\nprofound impact are esoteric ones that are suppressed yet surface when\ncertain historical conditions arise. This serves as one of his main\ncriticisms of Wissenschaft des Judentums, that is, that the\npresentation of Judaism without its esoteric components is not only\nbad history but misunderstands the main forces that drive change in\nJewish life and ideas. One scholar termed this Scholem's\n“counter-history.” For Scholem Judaism's ostensible\nanchor, tradition, is always in danger of undermining itself because\nit contains the seeds of its own demise in the form of esotericism,\nmysticism, and myth. As history unfolds, it often adjusts and survives\nits own inner challenge but other times, as in Sabbateanism, it does\nso only by a combination of draconian means (this often backfires) or\nby exercising its own elasticity to absorb the heretical and thereby\nmake it normative.\n\n\nFor Scholem, the one case where tradition may not have been able to\nrecover is modernity. For him modernity, and the secular, undermines\nthe central pillar of tradition, its belief in the divine nature of\nScripture. Once this goes, he posits, in some way the dialectic is\nbroken in that mysticism needs tradition as its foil in order to\nsurvive. The shattered ideational foundation of Jewish identity in\nmodernity can only be replaced with something that is heretical,\nmessianic, and secular: that is, Zionism. One scholar refers to this as\nScholem's “creative anarchy.” In his famous last\ncomments on the last page of Major Trends Scholem acknowledges\nthat modernity destroyed the conditions for mysticism as we knew it\nhistorically but he acknowledges it could indeed rise in a different\nguise in the future. This all seems to embody Scholem's own\nidentification as a “religious anarchist.” He may mean\nnumerous things by this enigmatic assertion. He may mean that he\nbelieves, as mentioned above, that Judaism has no essence but is only a\nseries of connected yet not always coherent textual traditions and sets\nof ideas. He may also mean that he believes controlled anarchy as the\ndemise of any heteronomous authority sets the proper conditions for the\ndiscovery of suppressed esoteric trends in a society. As he believes\nthese trends are crucial to understanding any culture, he supports\nreligious anarchy to the extent that it enables “the\nprofessor” of Jewish mysticism to do his (or her) work. In this\nsecond case, anarchy appears synonymous with secularity.\n",
    "section_title": "6. Historiography and Theology",
    "entry_title": "Gershom Scholem",
    "hierarchy_title": "Gershom Scholem || Historiography and Theology",
    "tokenized_text": [
        "historiography",
        "theology",
        "historiography",
        "theology",
        "early",
        "scholem",
        "became",
        "committed",
        "critical",
        "historical",
        "scholarship",
        "mode",
        "understanding",
        "past",
        "reconstructing",
        "present",
        "history",
        "philology",
        "basis",
        "legitimate",
        "jewish",
        "theology",
        "world",
        "could",
        "longer",
        "support",
        "authentic",
        "mysticism",
        "write",
        "theological",
        "essay",
        "one",
        "could",
        "argue",
        "historicalphilological",
        "essay",
        "also",
        "theological",
        "foundation",
        "scholem",
        "grew",
        "world",
        "weimar",
        "germany",
        "mandate",
        "palestine",
        "rife",
        "intellectual",
        "activity",
        "focused",
        "reconstruction",
        "jewish",
        "life",
        "culture",
        "around",
        "zionism",
        "hebrew",
        "university",
        "began",
        "institute",
        "jewish",
        "study",
        "taught",
        "expressly",
        "created",
        "purpose",
        "scholem",
        "s",
        "historical",
        "work",
        "emerged",
        "critique",
        "two",
        "distinct",
        "movement",
        "first",
        "wissenschaft",
        "de",
        "judentums",
        "science",
        "judaism",
        "led",
        "th",
        "century",
        "jewish",
        "historian",
        "leopold",
        "zunz",
        "moritz",
        "steinschneider",
        "henrich",
        "graetz",
        "historian",
        "reconstructed",
        "jewish",
        "history",
        "newly",
        "emancipated",
        "western",
        "european",
        "jewish",
        "community",
        "placing",
        "special",
        "emphasis",
        "normative",
        "rabbinic",
        "literature",
        "culture",
        "talmud",
        "midrash",
        "medieval",
        "rationalist",
        "tradition",
        "backbone",
        "judaism",
        "ignored",
        "disparaged",
        "form",
        "mysticism",
        "kabbala",
        "claiming",
        "outdated",
        "dark",
        "part",
        "jewish",
        "past",
        "scholem",
        "s",
        "entire",
        "reconstruction",
        "kabbala",
        "extension",
        "judaism",
        "would",
        "unrelenting",
        "battle",
        "wrote",
        "essay",
        "modern",
        "jewish",
        "study",
        "brief",
        "stone",
        "rejected",
        "builder",
        "science",
        "judaism",
        "become",
        "cornerstone",
        "scholem",
        "referred",
        "rejection",
        "kabbala",
        "origin",
        "sin",
        "science",
        "judaism",
        "everything",
        "else",
        "merely",
        "extension",
        "sentiment",
        "reiterated",
        "essay",
        "others",
        "rejected",
        "kabbala",
        "historical",
        "criticism",
        "delivered",
        "upon",
        "receiving",
        "one",
        "rothschild",
        "prize",
        "scholem",
        "claimed",
        "laconically",
        "exilic",
        "thus",
        "apologetic",
        "mentality",
        "tainted",
        "science",
        "judaism",
        "s",
        "historical",
        "project",
        "fact",
        "rectified",
        "new",
        "national",
        "sovereign",
        "consciousness",
        "also",
        "acknowledged",
        "nationalism",
        "one",
        "form",
        "zionism",
        "presented",
        "distorting",
        "lens",
        "even",
        "corrected",
        "mistake",
        "past",
        "second",
        "early",
        "decade",
        "th",
        "century",
        "philosophy",
        "hermann",
        "cohen",
        "martin",
        "buber",
        "former",
        "neokantian",
        "rationalist",
        "latter",
        "romantic",
        "existentialistwere",
        "immensely",
        "popular",
        "scholem",
        "rejected",
        "grand",
        "scheme",
        "favor",
        "careful",
        "historical",
        "analysis",
        "regnant",
        "literary",
        "source",
        "judaism",
        "addition",
        "response",
        "adolph",
        "von",
        "harnack",
        "s",
        "influential",
        "essence",
        "christianity",
        "harnack",
        "argued",
        "among",
        "thing",
        "christianity",
        "rooted",
        "gnosticism",
        "thus",
        "need",
        "nt",
        "dependent",
        "jewish",
        "source",
        "damaging",
        "idea",
        "german",
        "jewish",
        "culture",
        "theologian",
        "leo",
        "baeck",
        "argued",
        "essence",
        "judaism",
        "counter",
        "harnack",
        "s",
        "position",
        "judaism",
        "irrelevant",
        "illegitimate",
        "christianity",
        "buber",
        "scholem",
        "rejected",
        "notion",
        "essence",
        "judaism",
        "yet",
        "differed",
        "alternative",
        "buber",
        "focused",
        "notion",
        "erlebnis",
        "intuitive",
        "experience",
        "anchor",
        "human",
        "s",
        "relationship",
        "god",
        "via",
        "revelation",
        "relation",
        "buber",
        "experience",
        "metalingual",
        "phenomenon",
        "thus",
        "language",
        "inferior",
        "pure",
        "experience",
        "buber",
        "essence",
        "judaism",
        "may",
        "essence",
        "religious",
        "experience",
        "transcends",
        "language",
        "thus",
        "particularity",
        "scholem",
        "rejected",
        "argued",
        "judaism",
        "renewed",
        "historical",
        "consciousness",
        "erfahrung",
        "concrete",
        "historical",
        "experience",
        "kind",
        "experience",
        "mediated",
        "language",
        "specifically",
        "language",
        "textual",
        "tradition",
        "influenced",
        "walter",
        "benjamin",
        "s",
        "early",
        "theory",
        "language",
        "scholem",
        "argued",
        "language",
        "divine",
        "origin",
        "however",
        "understood",
        "thus",
        "experience",
        "revelation",
        "linguistic",
        "scholem",
        "therefore",
        "essential",
        "religious",
        "experience",
        "human",
        "experience",
        "mediated",
        "language",
        "thus",
        "particular",
        "cultural",
        "linguistic",
        "context",
        "also",
        "held",
        "essence",
        "judaism",
        "mean",
        "core",
        "set",
        "value",
        "exhibited",
        "form",
        "jewish",
        "literature",
        "judaism",
        "according",
        "one",
        "close",
        "reader",
        "scholem",
        "anarchistic",
        "plurality",
        "sources",
        "thus",
        "best",
        "way",
        "understand",
        "judaism",
        "philological",
        "historical",
        "analysis",
        "source",
        "without",
        "preconceived",
        "vision",
        "grand",
        "narrative",
        "unites",
        "scholem",
        "s",
        "position",
        "essentialist",
        "school",
        "surface",
        "first",
        "chapter",
        "major",
        "trend",
        "struggle",
        "define",
        "mystical",
        "experience",
        "surface",
        "s",
        "s",
        "light",
        "nature",
        "language",
        "name",
        "god",
        "linguistic",
        "theory",
        "kabbala",
        "name",
        "god",
        "essay",
        "topic",
        "scholem",
        "first",
        "expressed",
        "interest",
        "writing",
        "early",
        "s",
        "realized",
        "sufficient",
        "knowledge",
        "kabbala",
        "essay",
        "published",
        "two",
        "part",
        "major",
        "trend",
        "navigates",
        "position",
        "essentialists",
        "pure",
        "constructivist",
        "position",
        "noted",
        "even",
        "given",
        "scholem",
        "s",
        "dependence",
        "language",
        "advocate",
        "pure",
        "constructivist",
        "position",
        "nature",
        "experience",
        "argue",
        "simply",
        "meaning",
        "whatsoever",
        "experience",
        "outside",
        "language",
        "experience",
        "outside",
        "language",
        "language",
        "scholem",
        "vehicle",
        "understanding",
        "experience",
        "whether",
        "fact",
        "origin",
        "experience",
        "something",
        "scholem",
        "never",
        "definitively",
        "argues",
        "remains",
        "issue",
        "debate",
        "among",
        "scholem",
        "s",
        "interpreter",
        "historiographical",
        "dimension",
        "scholem",
        "s",
        "reconstruction",
        "judaism",
        "perhaps",
        "contested",
        "thesis",
        "offer",
        "kind",
        "hegelian",
        "position",
        "brief",
        "unfolds",
        "follows",
        "biblical",
        "period",
        "judaism",
        "struggle",
        "free",
        "pure",
        "myth",
        "partially",
        "successful",
        "never",
        "quite",
        "severs",
        "mythic",
        "world",
        "surroundings",
        "period",
        "followed",
        "rabbinic",
        "period",
        "late",
        "antiquity",
        "introducing",
        "institutional",
        "period",
        "jewish",
        "religion",
        "rabbi",
        "suppressed",
        "myth",
        "magic",
        "cult",
        "favor",
        "normalized",
        "legal",
        "system",
        "rationalized",
        "biblical",
        "mythic",
        "motif",
        "presented",
        "god",
        "impersonal",
        "distant",
        "human",
        "experience",
        "biblical",
        "period",
        "centered",
        "prophecy",
        "jewish",
        "middle",
        "age",
        "began",
        "judaism",
        "s",
        "absorption",
        "hellenisticrational",
        "culture",
        "produced",
        "god",
        "even",
        "distant",
        "rabbinic",
        "god",
        "moreover",
        "period",
        "law",
        "remained",
        "obligatory",
        "challenged",
        "reason",
        "sine",
        "qua",
        "non",
        "religious",
        "life",
        "myth",
        "move",
        "sate",
        "suppression",
        "outright",
        "rejected",
        "scholem",
        "posit",
        "kabbala",
        "enters",
        "part",
        "reaction",
        "medieval",
        "rationalism",
        "curiously",
        "unlike",
        "scholem",
        "s",
        "rejection",
        "enlightenment",
        "rationalism",
        "science",
        "judaism",
        "kabbala",
        "emerges",
        "part",
        "revive",
        "biblical",
        "myth",
        "also",
        "offer",
        "myth",
        "born",
        "reification",
        "rabbinic",
        "midrash",
        "mystical",
        "cosmology",
        "hegelian",
        "fashion",
        "mystical",
        "period",
        "result",
        "renewal",
        "rationalism",
        "enlightenment",
        "mysticism",
        "move",
        "underground",
        "rejected",
        "proponent",
        "science",
        "judaism",
        "followed",
        "resurgence",
        "yet",
        "another",
        "period",
        "jewish",
        "selfassertion",
        "reconnection",
        "land",
        "power",
        "zionism",
        "dialectical",
        "approach",
        "duly",
        "criticized",
        "neat",
        "ignoring",
        "messy",
        "edge",
        "historical",
        "epoch",
        "example",
        "argued",
        "scholem",
        "intentionally",
        "downplays",
        "mythic",
        "component",
        "rabbinic",
        "judaism",
        "way",
        "early",
        "kabbalist",
        "also",
        "fashioned",
        "philosopher",
        "example",
        "ecstatic",
        "mystic",
        "abraham",
        "abulafia",
        "wrote",
        "commentary",
        "maimonides",
        "rational",
        "work",
        "consider",
        "project",
        "contradictory",
        "maimonides",
        "critique",
        "continues",
        "scholem",
        "favored",
        "mythic",
        "kabbalistic",
        "school",
        "rhineland",
        "pietists",
        "zohar",
        "luria",
        "sabbatai",
        "zevi",
        "hasidism",
        "serve",
        "purpose",
        "viewed",
        "central",
        "historical",
        "trajectory",
        "kabbala",
        "one",
        "vexing",
        "question",
        "scholem",
        "s",
        "historiographical",
        "rendering",
        "kabbala",
        "place",
        "myth",
        "medieval",
        "kabbalistic",
        "literature",
        "one",
        "hand",
        "scholem",
        "seems",
        "prefer",
        "symbol",
        "myth",
        "discussing",
        "kabbala",
        "suggesting",
        "kabbala",
        "s",
        "reification",
        "biblical",
        "narrative",
        "yield",
        "mythic",
        "drama",
        "including",
        "cadre",
        "mythic",
        "figure",
        "rather",
        "series",
        "symbolic",
        "cluster",
        "hypostatic",
        "form",
        "identified",
        "prism",
        "personality",
        "hebrew",
        "bible",
        "hand",
        "numerous",
        "place",
        "scholem",
        "suggests",
        "kabbala",
        "reintroduces",
        "myth",
        "jewish",
        "discourse",
        "critique",
        "judaism",
        "s",
        "rational",
        "expositor",
        "critic",
        "suggested",
        "scholem",
        "underestimated",
        "mythic",
        "nature",
        "theosophic",
        "kabbala",
        "zohar",
        "interpreter",
        "invested",
        "notion",
        "symbolism",
        "common",
        "time",
        "eg",
        "jung",
        "ricoeur",
        "eliade",
        "event",
        "question",
        "myth",
        "versus",
        "symbol",
        "kabbala",
        "remains",
        "important",
        "issue",
        "examined",
        "scholem",
        "s",
        "reader",
        "future",
        "scholar",
        "one",
        "important",
        "consequence",
        "question",
        "whether",
        "one",
        "defines",
        "scholem",
        "s",
        "dialectical",
        "historiography",
        "hegelian",
        "psychoanalytic",
        "say",
        "myth",
        "yield",
        "symbolism",
        "kabbala",
        "kabbala",
        "s",
        "new",
        "jewish",
        "theology",
        "would",
        "better",
        "fit",
        "hegelian",
        "mode",
        "antithesis",
        "medieval",
        "rationalism",
        "say",
        "myth",
        "dominates",
        "symbol",
        "kabbala",
        "could",
        "argue",
        "case",
        "freudian",
        "return",
        "repressed",
        "ancient",
        "israelite",
        "myth",
        "repressed",
        "rabbinic",
        "institutionalization",
        "medieval",
        "rationalism",
        "return",
        "undermine",
        "even",
        "ostensibly",
        "remains",
        "wedded",
        "orthodoxy",
        "rabbinic",
        "judaism",
        "provides",
        "case",
        "hard",
        "know",
        "exactly",
        "seriously",
        "scholem",
        "intended",
        "u",
        "take",
        "dialectical",
        "historiography",
        "whether",
        "fact",
        "served",
        "heuristic",
        "tool",
        "enable",
        "u",
        "see",
        "sweeping",
        "picture",
        "subsequent",
        "generation",
        "could",
        "revise",
        "also",
        "worth",
        "considering",
        "much",
        "warp",
        "woof",
        "messianic",
        "antinomian",
        "underlies",
        "much",
        "scholem",
        "s",
        "historiography",
        "kabbala",
        "born",
        "serf",
        "zionism",
        "interview",
        "short",
        "time",
        "death",
        "admitted",
        "believed",
        "work",
        "already",
        "dated",
        "thus",
        "assume",
        "need",
        "revision",
        "revaluation",
        "given",
        "waning",
        "belief",
        "grand",
        "narrative",
        "scholem",
        "s",
        "historiography",
        "met",
        "sharp",
        "criticism",
        "yet",
        "little",
        "doubt",
        "main",
        "feature",
        "thus",
        "far",
        "stood",
        "test",
        "time",
        "second",
        "component",
        "accompanies",
        "scholem",
        "s",
        "dialectic",
        "myth",
        "rationalism",
        "mysticism",
        "theory",
        "esotericism",
        "committed",
        "notion",
        "social",
        "cultural",
        "change",
        "driven",
        "idea",
        "event",
        "scholem",
        "add",
        "idea",
        "often",
        "profound",
        "impact",
        "esoteric",
        "one",
        "suppressed",
        "yet",
        "surface",
        "certain",
        "historical",
        "condition",
        "arise",
        "serf",
        "one",
        "main",
        "criticism",
        "wissenschaft",
        "de",
        "judentums",
        "presentation",
        "judaism",
        "without",
        "esoteric",
        "component",
        "bad",
        "history",
        "misunderstands",
        "main",
        "force",
        "drive",
        "change",
        "jewish",
        "life",
        "idea",
        "one",
        "scholar",
        "termed",
        "scholem",
        "s",
        "counterhistory",
        "scholem",
        "judaism",
        "s",
        "ostensible",
        "anchor",
        "tradition",
        "always",
        "danger",
        "undermining",
        "contains",
        "seed",
        "demise",
        "form",
        "esotericism",
        "mysticism",
        "myth",
        "history",
        "unfolds",
        "often",
        "adjusts",
        "survives",
        "inner",
        "challenge",
        "time",
        "sabbateanism",
        "combination",
        "draconian",
        "mean",
        "often",
        "backfire",
        "exercising",
        "elasticity",
        "absorb",
        "heretical",
        "thereby",
        "make",
        "normative",
        "scholem",
        "one",
        "case",
        "tradition",
        "may",
        "able",
        "recover",
        "modernity",
        "modernity",
        "secular",
        "undermines",
        "central",
        "pillar",
        "tradition",
        "belief",
        "divine",
        "nature",
        "scripture",
        "go",
        "posit",
        "way",
        "dialectic",
        "broken",
        "mysticism",
        "need",
        "tradition",
        "foil",
        "order",
        "survive",
        "shattered",
        "ideational",
        "foundation",
        "jewish",
        "identity",
        "modernity",
        "replaced",
        "something",
        "heretical",
        "messianic",
        "secular",
        "zionism",
        "one",
        "scholar",
        "refers",
        "scholem",
        "s",
        "creative",
        "anarchy",
        "famous",
        "last",
        "comment",
        "last",
        "page",
        "major",
        "trend",
        "scholem",
        "acknowledges",
        "modernity",
        "destroyed",
        "condition",
        "mysticism",
        "knew",
        "historically",
        "acknowledges",
        "could",
        "indeed",
        "rise",
        "different",
        "guise",
        "future",
        "seems",
        "embody",
        "scholem",
        "s",
        "identification",
        "religious",
        "anarchist",
        "may",
        "mean",
        "numerous",
        "thing",
        "enigmatic",
        "assertion",
        "may",
        "mean",
        "belief",
        "mentioned",
        "judaism",
        "essence",
        "series",
        "connected",
        "yet",
        "always",
        "coherent",
        "textual",
        "tradition",
        "set",
        "idea",
        "may",
        "also",
        "mean",
        "belief",
        "controlled",
        "anarchy",
        "demise",
        "heteronomous",
        "authority",
        "set",
        "proper",
        "condition",
        "discovery",
        "suppressed",
        "esoteric",
        "trend",
        "society",
        "belief",
        "trend",
        "crucial",
        "understanding",
        "culture",
        "support",
        "religious",
        "anarchy",
        "extent",
        "enables",
        "professor",
        "jewish",
        "mysticism",
        "work",
        "second",
        "case",
        "anarchy",
        "appears",
        "synonymous",
        "secularity"
    ]
}