{
    "main_text": "The Phenomenology of the Social World\n2. The Phenomenology of the Social World\n\nIn his principal work, Schutz placed three chapters of philosophical\ndiscussion between introductory and concluding chapters that discussed\nthe social scientific positions his philosophy attempted to engage. In\nthe initial chapter Schutz praised Max Weber’s views on\nvalue-freedom in social science and the autonomy of science\nvis-à-vis other activities (e.g. politics), and he commended\nWeber’s methodological individualism and ideal-type methodology.\nIn addition, he applauded Weber’s refusal to reduce the social\nsciences to the natural sciences, while allowing their ideal-typical\nresults to be testable for adequacy. However, Schutz also supplemented\nWeber, pointing out how interpretation was involved even in selecting\nan experience out of one’s stream of experience and highlighting\nhow the meaning of an action to an actor depended upon the project\nguiding the extended temporal process of the sub-acts leading to its\nrealization.\n\nThese initial criticisms of Weber required Schutz to develop his\nown theory of meaning and action, beginning with\nHusserl’s study of the consciousness of internal time, in\nparticular consciousness’s capacity to capture reflectively and\ndistinguish lived experiences, which at first appear as undefined\nphases melting into each other. Schutz had appropriated this notion of\nflowing consciousness, or duration, from Bergson, on whom he\nhad relied in the manuscripts later published as Life Forms and\nMeaning Structure. Those manuscripts, for analytic purposes,\nsplit the ego, indivisible in its lived experience, into ideal-typical\nconstructs of various life forms, that included the “I”\nliving in duration, remembering, acting, thinking, and relating to a\n“Thou.” Though Schutz never made explicit his reasons for\nnot publishing those earlier manuscripts, Helmut Wagner rightly\nspeculated that he was ill at ease since one could only have access to\nduration through acts of memory, which, of course, constituted a\nlife-form entirely separate from duration itself. As a result of this\nmethodology relying on distinct ideal-types, duration began to appear\nas an inaccessible Ding-an-sich. Husserl’s account of\nthe consciousness of inner time remedied just this problem by\ncarefully describing how the stream of duration was changed at every\nmoment into a remembered having-just-been-thus, as the primal\nimpression passed into into primary remembrance, or retention. The\ncontinuum extending backward from the now of the primal\nimpression through its retentions formed a “specious”\npresent, to which the reflective acts of secondary remembrance, that\nis, recollection or reproduction, turned, differentiating one\nexperience from another. In sum, Husserl’s phenomenological\ndescription of experience uncovered the process of retention that\nbridged the duration/(reflective) memory gap that had bedeviled\nSchutz’s earlier efforts insofar as he had relied on an\nideal-typical methodology, which prevented insight into what goes on\nwithin conscious processes themselves.\n\nSchutz, though, turned the Husserlian account of temporality in the\ndirection of an action theory, demarcating levels of passive\nexperience (e.g. bodily reflexes), spontaneous activity without a\nguiding project (e.g., acts of noticing environmental stimuli), and\ndeliberately planned and projected activity, known technically as\n“action” (e.g., writing a book). In planning an action to\nbe realized in the future, one relies on reflective acts of\n“projection,” like those found in reflective memory, only\nnow oriented in a future as opposed to past direction. Through such\nreflectivity, one imagines a project as completed in future perfect\ntense, that is, what will have been realized after one’s acting,\nand this project, also of central importance for Martin Heidegger and\nthe pragmatist tradition, establishes the “in-order-to\nmotive” of one’s action. By contrast, one’s\n“because motives” consist in the environmental, historical\nfactors that influenced the (now past) decision to embark upon the\nproject and that can only be discovered by investigating in the\n“pluperfect tense,” that is, exploring those past factors\nthat preceded that past decision.\n\nSchutz’s distinctions here are relevant to contemporary debates\nabout whether freedom is compatible with determinism since from the\nperspective of the lived in-order-to motive, one experiences oneself\nas free and morally responsible, but from the perspective of examining\none’s because motives after completing one’s action, one\ncorrelates, as an observer of oneself, the choice of the project with\nits historical determinants. Of course, Schutz, working within the\nparameters of Husserl’s non-naturalistic account of\nconsciousness, would have conceived such determinants not so much as\nempirico-mechanical causes but rather as influences discoverable\nthrough an interpretive process, associating earlier events with the\nlater ones they seem to have influenced. Schutz’s position comes\nclosest to the roughly compatibilist outlooks of P.F. Strawson and\nThomas Nagel, who distinguish between the participant and observer\nattitudes prior to theoretical discussions and who align the\nparticipant attitude with freedom and the observer attitude with\ndeterminism. Schutz, however, contributes the unique insight that\nthese attitudes take place within distinctive temporal frameworks,\noriented toward the future or the past.\n\nSchutz’s account of the temporal framework of motivation\npermitted criticism of Weber’s view that one could orient\none’s action to the past behavior of others, since, while such\nbehavior might have served as the because motive of an action, one\ncould not aim at affecting another’s already completed action.\nSimilarly, failure to appreciate temporality often leads to\nmisinterpretations of action, as when one assumes that the\noutcome of an act may have been its motive without considering the\nactor’s in-order-to motive, which due to unforeseen events may\nhave been adjusted or may have led to results contrary to those\nintended. Likewise, one can interpret an economic action after the\nfact as less than rational without taking sufficient account of the\nlimited information that was available to the actor at the time of\ndeciding to act and that might make her action seem perfectly\nrational. Moreover, the fact that one’s own temporal stream of\nconsciousness never completely coincides with that of another, whose\nsequence of events and intensity of experience inevitably differs from\none’s own, places limits on one’s understanding of\nanother. As a consequence, the objective meanings of language, defined\nin dictionaries as invariant regardless of users, also bear subjective\nconnotations for language users due to their unique histories of\nlinguistic experience, even though for practical purposes of\ncommunication they are able to set aside such differences. For\ninstance, one would have to consider in depth Goethe’s works as\na whole to understand what he meant by “demonic.”\nSchutz’s basic point in all these examples involves getting\nbehind constituted meanings to the temporal processes by which actors\nbuild up the meaning of their own actions—a meaningful build-up\naccentuated by the German title of his Phenomenology of the Social\nWorld (Der sinnhafte Aufbau der sozialen Welt).\n\nIn addition to this account of consciousness, motivation, and action,\nhe examined the structure of the social world, including Consociates\nwho share the same time and spatial access to each other’s\nbodies, Contemporaries with whom one shares only the same time, and\nPredecessors and Successors with whom one does not share the same time\nand to whose lived bodies one lacks access. Consociates, present to\neach other physically, partake of each other’s inner time, that\nis, the on-rolling life of the other, grasp the building up of the\nother’s experience, and live in a We-relationship that entails\n“growing older together.” While Consociates revise their\ntypes of each other immediately, one must proceed more inferentially\nwith Contemporaries, Predecessors, and Successors, constructing ideal\ntypes based on letters or reports and running greater risks of\nmisunderstanding, depending on the degree of anonymity of the person\nto be understood. One could say, then, that Weber’s method of\nideal type construction, illustrated in his sociological account of\nthe Protestant at the origins of capitalism, is not really that\nforeign to the everyday life-world in which actors beyond the\nConsociate level continually relate to each other via such type\nconstruction. Human actors in everyday life already adopt toward each\nother the attitudes of social scientists.\n\nSchutz conceived his work as developing a “phenomenological\npsychology” of “inner experience” and focusing on\nthe invariant features of the life-world toward which theoreticians,\nincluding social scientists, turn reflectively. Although Jürgen\nHabermas criticizes Schutz’s account of the life-world for being\n“abridged in a culturalistic fashion” and not addressing\ninstitutional orders and personality structures (Habermas 1987,\n2:126–132), it would seem that Schutz himself delimits his own\nwork in just this fashion. According to him, social scientists develop\nconstructs, ideal types, of the meaning-contexts of life-world actors,\nand they test these types to determine if they are causally adequate,\nthat is conforming to past experience, and meaning adequate, that is,\nconsistent with whatever else is known about the actor. Responding to\nMises’s critique that Weber’s ideal-types are too\nhistorically specific, Schutz suggested that the later Weber’s\nideal types in Economy and Society attain a generality\ncomparable to that of Mises’ own economic theory, which itself\ncould be interpreted as presenting ideal-typical descriptions of the\nbehavior of economic agents. The later Weber’s types depict the\ninvariant subjective experiences of anyone who acts within the\neconomic framework as defined by the principle of marginal utility,\nthat is, choosing to maximize satisfaction.\n",
    "section_title": "2. The Phenomenology of the Social World",
    "entry_title": "Alfred Schutz",
    "hierarchy_title": "Alfred Schutz || The Phenomenology of the Social World",
    "tokenized_text": [
        "phenomenology",
        "social",
        "world",
        "phenomenology",
        "social",
        "world",
        "principal",
        "work",
        "schutz",
        "placed",
        "three",
        "chapter",
        "philosophical",
        "discussion",
        "introductory",
        "concluding",
        "chapter",
        "discussed",
        "social",
        "scientific",
        "position",
        "philosophy",
        "attempted",
        "engage",
        "initial",
        "chapter",
        "schutz",
        "praised",
        "max",
        "weber",
        "view",
        "valuefreedom",
        "social",
        "science",
        "autonomy",
        "science",
        "visàvis",
        "activity",
        "eg",
        "politics",
        "commended",
        "weber",
        "methodological",
        "individualism",
        "idealtype",
        "methodology",
        "addition",
        "applauded",
        "weber",
        "refusal",
        "reduce",
        "social",
        "science",
        "natural",
        "science",
        "allowing",
        "idealtypical",
        "result",
        "testable",
        "adequacy",
        "however",
        "schutz",
        "also",
        "supplemented",
        "weber",
        "pointing",
        "interpretation",
        "involved",
        "even",
        "selecting",
        "experience",
        "one",
        "stream",
        "experience",
        "highlighting",
        "meaning",
        "action",
        "actor",
        "depended",
        "upon",
        "project",
        "guiding",
        "extended",
        "temporal",
        "process",
        "subacts",
        "leading",
        "realization",
        "initial",
        "criticism",
        "weber",
        "required",
        "schutz",
        "develop",
        "theory",
        "meaning",
        "action",
        "beginning",
        "husserl",
        "study",
        "consciousness",
        "internal",
        "time",
        "particular",
        "consciousness",
        "capacity",
        "capture",
        "reflectively",
        "distinguish",
        "lived",
        "experience",
        "first",
        "appear",
        "undefined",
        "phase",
        "melting",
        "schutz",
        "appropriated",
        "notion",
        "flowing",
        "consciousness",
        "duration",
        "bergson",
        "relied",
        "manuscript",
        "later",
        "published",
        "life",
        "form",
        "meaning",
        "structure",
        "manuscript",
        "analytic",
        "purpose",
        "split",
        "ego",
        "indivisible",
        "lived",
        "experience",
        "idealtypical",
        "construct",
        "various",
        "life",
        "form",
        "included",
        "living",
        "duration",
        "remembering",
        "acting",
        "thinking",
        "relating",
        "thou",
        "though",
        "schutz",
        "never",
        "made",
        "explicit",
        "reason",
        "publishing",
        "earlier",
        "manuscript",
        "helmut",
        "wagner",
        "rightly",
        "speculated",
        "ill",
        "ease",
        "since",
        "one",
        "could",
        "access",
        "duration",
        "act",
        "memory",
        "course",
        "constituted",
        "lifeform",
        "entirely",
        "separate",
        "duration",
        "result",
        "methodology",
        "relying",
        "distinct",
        "idealtypes",
        "duration",
        "began",
        "appear",
        "inaccessible",
        "dingansich",
        "husserl",
        "account",
        "consciousness",
        "inner",
        "time",
        "remedied",
        "problem",
        "carefully",
        "describing",
        "stream",
        "duration",
        "changed",
        "every",
        "moment",
        "remembered",
        "havingjustbeenthus",
        "primal",
        "impression",
        "passed",
        "primary",
        "remembrance",
        "retention",
        "continuum",
        "extending",
        "backward",
        "primal",
        "impression",
        "retention",
        "formed",
        "specious",
        "present",
        "reflective",
        "act",
        "secondary",
        "remembrance",
        "recollection",
        "reproduction",
        "turned",
        "differentiating",
        "one",
        "experience",
        "another",
        "sum",
        "husserl",
        "phenomenological",
        "description",
        "experience",
        "uncovered",
        "process",
        "retention",
        "bridged",
        "duration",
        "reflective",
        "memory",
        "gap",
        "bedeviled",
        "schutz",
        "earlier",
        "effort",
        "insofar",
        "relied",
        "idealtypical",
        "methodology",
        "prevented",
        "insight",
        "go",
        "within",
        "conscious",
        "process",
        "schutz",
        "though",
        "turned",
        "husserlian",
        "account",
        "temporality",
        "direction",
        "action",
        "theory",
        "demarcating",
        "level",
        "passive",
        "experience",
        "eg",
        "bodily",
        "reflex",
        "spontaneous",
        "activity",
        "without",
        "guiding",
        "project",
        "eg",
        "act",
        "noticing",
        "environmental",
        "stimulus",
        "deliberately",
        "planned",
        "projected",
        "activity",
        "known",
        "technically",
        "action",
        "eg",
        "writing",
        "book",
        "planning",
        "action",
        "realized",
        "future",
        "one",
        "relies",
        "reflective",
        "act",
        "projection",
        "like",
        "found",
        "reflective",
        "memory",
        "oriented",
        "future",
        "opposed",
        "past",
        "direction",
        "reflectivity",
        "one",
        "imago",
        "project",
        "completed",
        "future",
        "perfect",
        "tense",
        "realized",
        "one",
        "acting",
        "project",
        "also",
        "central",
        "importance",
        "martin",
        "heidegger",
        "pragmatist",
        "tradition",
        "establishes",
        "inorderto",
        "motive",
        "one",
        "action",
        "contrast",
        "one",
        "motif",
        "consist",
        "environmental",
        "historical",
        "factor",
        "influenced",
        "past",
        "decision",
        "embark",
        "upon",
        "project",
        "discovered",
        "investigating",
        "pluperfect",
        "tense",
        "exploring",
        "past",
        "factor",
        "preceded",
        "past",
        "decision",
        "schutz",
        "distinction",
        "relevant",
        "contemporary",
        "debate",
        "whether",
        "freedom",
        "compatible",
        "determinism",
        "since",
        "perspective",
        "lived",
        "inorderto",
        "motive",
        "one",
        "experience",
        "oneself",
        "free",
        "morally",
        "responsible",
        "perspective",
        "examining",
        "one",
        "motif",
        "completing",
        "one",
        "action",
        "one",
        "correlate",
        "observer",
        "oneself",
        "choice",
        "project",
        "historical",
        "determinant",
        "course",
        "schutz",
        "working",
        "within",
        "parameter",
        "husserl",
        "nonnaturalistic",
        "account",
        "consciousness",
        "would",
        "conceived",
        "determinant",
        "much",
        "empiricomechanical",
        "cause",
        "rather",
        "influence",
        "discoverable",
        "interpretive",
        "process",
        "associating",
        "earlier",
        "event",
        "later",
        "one",
        "seem",
        "influenced",
        "schutz",
        "position",
        "come",
        "closest",
        "roughly",
        "compatibilist",
        "outlook",
        "pf",
        "strawson",
        "thomas",
        "nagel",
        "distinguish",
        "participant",
        "observer",
        "attitude",
        "prior",
        "theoretical",
        "discussion",
        "align",
        "participant",
        "attitude",
        "freedom",
        "observer",
        "attitude",
        "determinism",
        "schutz",
        "however",
        "contributes",
        "unique",
        "insight",
        "attitude",
        "take",
        "place",
        "within",
        "distinctive",
        "temporal",
        "framework",
        "oriented",
        "toward",
        "future",
        "past",
        "schutz",
        "account",
        "temporal",
        "framework",
        "motivation",
        "permitted",
        "criticism",
        "weber",
        "view",
        "one",
        "could",
        "orient",
        "one",
        "action",
        "past",
        "behavior",
        "others",
        "since",
        "behavior",
        "might",
        "served",
        "motive",
        "action",
        "one",
        "could",
        "aim",
        "affecting",
        "another",
        "already",
        "completed",
        "action",
        "similarly",
        "failure",
        "appreciate",
        "temporality",
        "often",
        "lead",
        "misinterpretation",
        "action",
        "one",
        "assumes",
        "outcome",
        "act",
        "may",
        "motive",
        "without",
        "considering",
        "actor",
        "inorderto",
        "motive",
        "due",
        "unforeseen",
        "event",
        "may",
        "adjusted",
        "may",
        "led",
        "result",
        "contrary",
        "intended",
        "likewise",
        "one",
        "interpret",
        "economic",
        "action",
        "fact",
        "le",
        "rational",
        "without",
        "taking",
        "sufficient",
        "account",
        "limited",
        "information",
        "available",
        "actor",
        "time",
        "deciding",
        "act",
        "might",
        "make",
        "action",
        "seem",
        "perfectly",
        "rational",
        "moreover",
        "fact",
        "one",
        "temporal",
        "stream",
        "consciousness",
        "never",
        "completely",
        "coincides",
        "another",
        "whose",
        "sequence",
        "event",
        "intensity",
        "experience",
        "inevitably",
        "differs",
        "one",
        "place",
        "limit",
        "one",
        "understanding",
        "another",
        "consequence",
        "objective",
        "meaning",
        "language",
        "defined",
        "dictionary",
        "invariant",
        "regardless",
        "user",
        "also",
        "bear",
        "subjective",
        "connotation",
        "language",
        "user",
        "due",
        "unique",
        "history",
        "linguistic",
        "experience",
        "even",
        "though",
        "practical",
        "purpose",
        "communication",
        "able",
        "set",
        "aside",
        "difference",
        "instance",
        "one",
        "would",
        "consider",
        "depth",
        "goethe",
        "work",
        "whole",
        "understand",
        "meant",
        "demonic",
        "schutz",
        "basic",
        "point",
        "example",
        "involves",
        "getting",
        "behind",
        "constituted",
        "meaning",
        "temporal",
        "process",
        "actor",
        "build",
        "meaning",
        "actionsa",
        "meaningful",
        "buildup",
        "accentuated",
        "german",
        "title",
        "phenomenology",
        "social",
        "world",
        "der",
        "sinnhafte",
        "aufbau",
        "der",
        "sozialen",
        "welt",
        "addition",
        "account",
        "consciousness",
        "motivation",
        "action",
        "examined",
        "structure",
        "social",
        "world",
        "including",
        "consociates",
        "share",
        "time",
        "spatial",
        "access",
        "body",
        "contemporary",
        "one",
        "share",
        "time",
        "predecessor",
        "successor",
        "one",
        "share",
        "time",
        "whose",
        "lived",
        "body",
        "one",
        "lack",
        "access",
        "consociates",
        "present",
        "physically",
        "partake",
        "inner",
        "time",
        "onrolling",
        "life",
        "grasp",
        "building",
        "experience",
        "live",
        "werelationship",
        "entail",
        "growing",
        "older",
        "together",
        "consociates",
        "revise",
        "type",
        "immediately",
        "one",
        "must",
        "proceed",
        "inferentially",
        "contemporary",
        "predecessor",
        "successor",
        "constructing",
        "ideal",
        "type",
        "based",
        "letter",
        "report",
        "running",
        "greater",
        "risk",
        "misunderstanding",
        "depending",
        "degree",
        "anonymity",
        "person",
        "understood",
        "one",
        "could",
        "say",
        "weber",
        "method",
        "ideal",
        "type",
        "construction",
        "illustrated",
        "sociological",
        "account",
        "protestant",
        "origin",
        "capitalism",
        "really",
        "foreign",
        "everyday",
        "lifeworld",
        "actor",
        "beyond",
        "consociate",
        "level",
        "continually",
        "relate",
        "via",
        "type",
        "construction",
        "human",
        "actor",
        "everyday",
        "life",
        "already",
        "adopt",
        "toward",
        "attitude",
        "social",
        "scientist",
        "schutz",
        "conceived",
        "work",
        "developing",
        "phenomenological",
        "psychology",
        "inner",
        "experience",
        "focusing",
        "invariant",
        "feature",
        "lifeworld",
        "toward",
        "theoretician",
        "including",
        "social",
        "scientist",
        "turn",
        "reflectively",
        "although",
        "jürgen",
        "habermas",
        "criticizes",
        "schutz",
        "account",
        "lifeworld",
        "abridged",
        "culturalistic",
        "fashion",
        "addressing",
        "institutional",
        "order",
        "personality",
        "structure",
        "habermas",
        "would",
        "seem",
        "schutz",
        "delimits",
        "work",
        "fashion",
        "according",
        "social",
        "scientist",
        "develop",
        "construct",
        "ideal",
        "type",
        "meaningcontexts",
        "lifeworld",
        "actor",
        "test",
        "type",
        "determine",
        "causally",
        "adequate",
        "conforming",
        "past",
        "experience",
        "meaning",
        "adequate",
        "consistent",
        "whatever",
        "else",
        "known",
        "actor",
        "responding",
        "mi",
        "critique",
        "weber",
        "idealtypes",
        "historically",
        "specific",
        "schutz",
        "suggested",
        "later",
        "weber",
        "ideal",
        "type",
        "economy",
        "society",
        "attain",
        "generality",
        "comparable",
        "mi",
        "economic",
        "theory",
        "could",
        "interpreted",
        "presenting",
        "idealtypical",
        "description",
        "behavior",
        "economic",
        "agent",
        "later",
        "weber",
        "type",
        "depict",
        "invariant",
        "subjective",
        "experience",
        "anyone",
        "act",
        "within",
        "economic",
        "framework",
        "defined",
        "principle",
        "marginal",
        "utility",
        "choosing",
        "maximize",
        "satisfaction"
    ]
}