{
    "main_text": "Other Revolution Claims and Examples || Nonlinear Dynamics\n6.3 Nonlinear Dynamics\n\nKuhn treated a scientific field (and perhaps science as a whole) as a\nsystem with a far more interesting internal dynamics than either\nPopper or the logical empiricists had proposed. The famous opening\nparagraphs of Structure read as though Kuhn had analyzed a\nhistorical time series and extracted a pattern from it inductively as\nthe basis for his model of scientific development. The broadly cyclic\nnature of this pattern immediately jumps out at dynamical systems\ntheorists. Yet despite this perhaps promising start as an early\ndynamical modeler of science, Kuhn apparently paid little attention to\nthe explosion of work in nonlinear dynamics that began with\n“chaos” theory and widened into such areas as complex\nadaptive systems and network theory. This is unfortunate, since the\nnew developments might have provided valuable tools for articulating\nhis own ideas.\n\nFor example, it would appear that, as Kuhnian normal science becomes\nmore robust in the sense of closing gaps, tightening connections, and\nthereby achieving multiple lines of derivation and hence mutual\nreinforcement of many results. However, that very fact makes normal\nscience increasingly fragile, less resilient to shocks, and more\nvulnerable to cascading failure (Nickles 2008). Kuhn claimed, contrary\nto the expectations of scientific realists, that there would be no end\nto scientific revolutions in ongoing, mature sciences, with no reason\nto believe that such revolutions would gradually diminish in size as\nthese sciences continued to mature. But it would seem to follow from\nhis model that he could have made a still stronger point. For\nKuhn’s position in Structure arguably implies that,\nwhen considering a single field over time, future revolutions can\noccasionally be even larger than before. The reason is that just\nmentioned: as research continues filling gaps and further articulating\nthe paradigm, normal science becomes more tightly integrated but also\nforges tighter links to relevant neighboring fields. Taking these\ndevelopments into account predicts that Kuhnian normal science should\nevolve toward an ever more critical state in which something that was\nonce an innocuous anomaly can now trigger a cascade of failures\n(Nickles 2012a and b), sometimes rather quickly. For there will be\nlittle slack left to absorb such discrepancies. If so, then we have an\nimportant sort of dynamical nonlinearity even in normal science, which\nmeans that Kuhnian normal science itself is more dynamic, less static,\nthan he made it out to be.\n\nIt seems clear that Kuhnian revolutions are bifurcations in the\nnonlinear dynamical sense, and it seems plausible to think that\nKuhnian revolutions may have a fat-tailed or power-law distribution\n(or worse) when their size is plotted over time on an appropriate\nscale. Each of these features is a “hallmark of nonlinear\ndynamics” (Hooker 2011A, 5; 2011B, 850, 858). To elaborate a\nbit: one intriguing suggestion coming from work in nonlinear dynamics\nis that scientific changes may be like earthquakes and many other\nphenomena (perhaps including punctuated equilibrium events of the\nGould-Eldredge sort as well as mass extinction events in biology) in\nfollowing a power-law distribution in which there are exponentially\nfewer changes of a given magnitude than the number of changes in the\nnext lower category. For example, there might be only one magnitude 5\nchange (or above) for every ten magnitude 4 changes (on average over\ntime), as in the Gutenberg-Richter scale for earthquakes. If so, then\nscientific revolutions would be scale free, meaning that large\nrevolutions in the future are more probable than a Gaussian normal\ndistribution would predict. Such a conclusion would have important\nimplications for the issue of scientific realism.\n\nTo be sure, working out such a timescale of revolutions and their\nsizes in the history of science would be difficult and controversial,\nbut Nicholas Rescher (1978, 2006) has begun the task in terms of\nranking scientific discoveries and studying their distribution over\ntime. Derek Price (1963) had previously introduced quantitative\nhistorical considerations into history of science, pointing out, among\nmany other things, the exponential increase in the number of\nscientists and quantity of their publications since the Scientific\nRevolution. Such an exponential increase, faster than world population\nincrease, obviously cannot continue forever and, in fact, was already\nbeginning to plateau in industrialized nations in the 1960s. Among\nphilosophers, Rescher was probably the first to analyze aggregate data\nconcerning scientific innovation, arguing that, as research\nprogresses, discoveries of a given magnitude become more difficult.\nRescher concludes that we must eventually expect a decrease in the\nrate of discovery of a given magnitude and hence, presumably, a\nsimilar decrease in the rate of scientific revolutions. Although he\ndoes not mention Schumpeter in this work, he expresses a similar\nview:\n\nScientific progress in large measure annihilates rather than enlarges\nwhat has gone before—it builds the new on the foundations of the\nruins of the old. Scientific theorizing generally moves ahead not by\naddition and enlargement but by demolition and\nreplacement. [1978, p. 82, Rescher’s emphasis]\n\n\nThis broadly Kuhnian position position on the number and magnitude of\nrevolutions contrasts sharply with Butterfield’s, who saw\nrevolutions only as founding revolutions, and also with that of those\nepistemological realists who grant that revolutionary conceptual and\npractical changes have occurred but who believe that they will become\nsuccessively smaller in the future as science approaches the true\ntheory. Kuhn’s own later position, in which specialties are\ninsulated from one another by taxonomic incommensurability, presents\nus with a somewhat less integrated conception of science and thus one\nless subject to large-scale revolutionary disruption. Since we can\nregard scientific practices and organization as highly designed\ntechnological systems, the work of Charles Perrow and others on\ntechnological risk is relevant here. (See Perrow 1984 for entry into\nthis approach.)\n\nMargolis (1993) notes the importance of the phenomenon of\n“contagion,” in which new ideas or practices suddenly\nreach a kind of social tipping point and spread rapidly. Contagion is,\nof course, necessary for a revolt to succeed as a revolution. Today,\ncontagion is a topic being studied carefully by network theorists and\npopularized by Malcolm Gladwell’s The Tipping Point\n(2000). Steven Strogatz, Duncan Watts, and Albert-László\nBarabási are among the new breed of network theorists who are\ndeveloping technical accounts of “phase changes” resulting\nfrom the growth and reorganization of networks, including social\nnetworks of science—a topic dear to the early Kuhn’s heart\nas he struggled with the themes of Structure (see Strogatz,\n2003, chap. 10; Watts 1999; Newman 2001; Barabási 2002;\nBuchanan 2002).\n\nDoes the emergence to prominence of “chaos theory”\n(nonlinear dynamics) itself constitute a scientific revolution and, if\nso, is it a distinctly Kuhnian revolution? In recent years several\nwriters, including both scientists and science writers, have attempted\nto link Kuhn’s idea of revolutionary paradigm shifts to the\nemergence of chaos theory, complexity theory, and network theory\n(e.g., Gleick 1987, chap. 2, on the chaos theory revolution; Ruelle\n1991, chap. 11; Jen in Cowan et al. 1999, 622f, on complexity theory;\nand Buchanan 2002, 47, on network theory). Interestingly, some authors\nreapply these ideas to Kuhn’s account itself, theoretically\nconstruing revolutionary paradigm shifts as phase changes or as\nnonlinear jumps from one strange attractor or one sort of network\nstructure to another.\n\nSteven Kellert (1993) considers and rejects the claim that chaos\ntheory represents a Kuhnian revolution. Although it does provide a new\nset of research problems and standards and, to some degree, transforms\nour worldview, it does not overturn and replace an entrenched theory.\nKellert argues that chaos theory does not even constitute the\nemergence of a new, mature science rather than an extension of\nstandard mechanics, although it may constitute a new style of\nreasoning.\n\nKellert’s position hangs partly on how we construe theories. If\na theory is just a toolbox of models, something like an integrated\ncollection of Kuhnian exemplars (Giere 1988, Teller 2008), then the\nclaim for a revolutionary theory development of some kind becomes more\nplausible. For nonlinear dynamics highlights a new set of models and\nthe strange attractors that characterize their behaviors. In addition,\ncomplex systems theorists often stress the holistic, anti-reductive,\nemergent nature of the systems they study, by contrast with the\nlinear, Newtonian paradigm. Kuhn wrote that one way in which normal\nscience articulates its paradigm is by “permitting the solution\nof problems to which it had previously only drawn attention.”\nBut had not classical dynamics suppressed rather than drawn attention\nto the problems of chaos theory and the various sorts of complexity\ntheory and network theory that are much studied today? Still, it is\neasy to agree with Kellert that this case does not fit Kuhn’s\naccount neatly. To some readers it suggests that a more pluralistic\nconception of scientific revolutions than Kuhn’s is needed.\n\nKellert also questions whether traditional dynamics was really in a\nspecial state of crisis prior to the recent emphasis on nonlinear\ndynamics, for difficulties in dealing with nonlinear phenomena have\nbeen apparent almost from the beginning. Since Kuhn himself\nemphasized, against Popper, that all theories face anomalies at all\ntimes, it is unfortunately all too easy, after an apparently\nrevolutionary development, to point back and claim crisis.\n",
    "section_title": "6.3 Nonlinear Dynamics",
    "entry_title": "Scientific Revolutions",
    "hierarchy_title": "Scientific Revolutions || Other Revolution Claims and Examples || Nonlinear Dynamics",
    "tokenized_text": [
        "revolution",
        "claim",
        "example",
        "nonlinear",
        "dynamic",
        "nonlinear",
        "dynamic",
        "kuhn",
        "treated",
        "scientific",
        "field",
        "perhaps",
        "science",
        "whole",
        "system",
        "far",
        "interesting",
        "internal",
        "dynamic",
        "either",
        "popper",
        "logical",
        "empiricist",
        "proposed",
        "famous",
        "opening",
        "paragraph",
        "structure",
        "read",
        "though",
        "kuhn",
        "analyzed",
        "historical",
        "time",
        "series",
        "extracted",
        "pattern",
        "inductively",
        "basis",
        "model",
        "scientific",
        "development",
        "broadly",
        "cyclic",
        "nature",
        "pattern",
        "immediately",
        "jump",
        "dynamical",
        "system",
        "theorist",
        "yet",
        "despite",
        "perhaps",
        "promising",
        "start",
        "early",
        "dynamical",
        "modeler",
        "science",
        "kuhn",
        "apparently",
        "paid",
        "little",
        "attention",
        "explosion",
        "work",
        "nonlinear",
        "dynamic",
        "began",
        "chaos",
        "theory",
        "widened",
        "area",
        "complex",
        "adaptive",
        "system",
        "network",
        "theory",
        "unfortunate",
        "since",
        "new",
        "development",
        "might",
        "provided",
        "valuable",
        "tool",
        "articulating",
        "idea",
        "example",
        "would",
        "appear",
        "kuhnian",
        "normal",
        "science",
        "becomes",
        "robust",
        "sense",
        "closing",
        "gap",
        "tightening",
        "connection",
        "thereby",
        "achieving",
        "multiple",
        "line",
        "derivation",
        "hence",
        "mutual",
        "reinforcement",
        "many",
        "result",
        "however",
        "fact",
        "make",
        "normal",
        "science",
        "increasingly",
        "fragile",
        "le",
        "resilient",
        "shock",
        "vulnerable",
        "cascading",
        "failure",
        "nickles",
        "kuhn",
        "claimed",
        "contrary",
        "expectation",
        "scientific",
        "realist",
        "would",
        "end",
        "scientific",
        "revolution",
        "ongoing",
        "mature",
        "science",
        "reason",
        "believe",
        "revolution",
        "would",
        "gradually",
        "diminish",
        "size",
        "science",
        "continued",
        "mature",
        "would",
        "seem",
        "follow",
        "model",
        "could",
        "made",
        "still",
        "stronger",
        "point",
        "kuhn",
        "position",
        "structure",
        "arguably",
        "implies",
        "considering",
        "single",
        "field",
        "time",
        "future",
        "revolution",
        "occasionally",
        "even",
        "larger",
        "reason",
        "mentioned",
        "research",
        "continues",
        "filling",
        "gap",
        "articulating",
        "paradigm",
        "normal",
        "science",
        "becomes",
        "tightly",
        "integrated",
        "also",
        "forge",
        "tighter",
        "link",
        "relevant",
        "neighboring",
        "field",
        "taking",
        "development",
        "account",
        "predicts",
        "kuhnian",
        "normal",
        "science",
        "evolve",
        "toward",
        "ever",
        "critical",
        "state",
        "something",
        "innocuous",
        "anomaly",
        "trigger",
        "cascade",
        "failure",
        "nickles",
        "a",
        "b",
        "sometimes",
        "rather",
        "quickly",
        "little",
        "slack",
        "left",
        "absorb",
        "discrepancy",
        "important",
        "sort",
        "dynamical",
        "nonlinearity",
        "even",
        "normal",
        "science",
        "mean",
        "kuhnian",
        "normal",
        "science",
        "dynamic",
        "le",
        "static",
        "made",
        "seems",
        "clear",
        "kuhnian",
        "revolution",
        "bifurcation",
        "nonlinear",
        "dynamical",
        "sense",
        "seems",
        "plausible",
        "think",
        "kuhnian",
        "revolution",
        "may",
        "fattailed",
        "powerlaw",
        "distribution",
        "worse",
        "size",
        "plotted",
        "time",
        "appropriate",
        "scale",
        "feature",
        "hallmark",
        "nonlinear",
        "dynamic",
        "hooker",
        "a",
        "b",
        "elaborate",
        "bit",
        "one",
        "intriguing",
        "suggestion",
        "coming",
        "work",
        "nonlinear",
        "dynamic",
        "scientific",
        "change",
        "may",
        "like",
        "earthquake",
        "many",
        "phenomenon",
        "perhaps",
        "including",
        "punctuated",
        "equilibrium",
        "event",
        "gouldeldredge",
        "sort",
        "well",
        "mass",
        "extinction",
        "event",
        "biology",
        "following",
        "powerlaw",
        "distribution",
        "exponentially",
        "fewer",
        "change",
        "given",
        "magnitude",
        "number",
        "change",
        "next",
        "lower",
        "category",
        "example",
        "might",
        "one",
        "magnitude",
        "change",
        "every",
        "ten",
        "magnitude",
        "change",
        "average",
        "time",
        "gutenbergrichter",
        "scale",
        "earthquake",
        "scientific",
        "revolution",
        "would",
        "scale",
        "free",
        "meaning",
        "large",
        "revolution",
        "future",
        "probable",
        "gaussian",
        "normal",
        "distribution",
        "would",
        "predict",
        "conclusion",
        "would",
        "important",
        "implication",
        "issue",
        "scientific",
        "realism",
        "sure",
        "working",
        "timescale",
        "revolution",
        "size",
        "history",
        "science",
        "would",
        "difficult",
        "controversial",
        "nicholas",
        "rescher",
        "begun",
        "task",
        "term",
        "ranking",
        "scientific",
        "discovery",
        "studying",
        "distribution",
        "time",
        "derek",
        "price",
        "previously",
        "introduced",
        "quantitative",
        "historical",
        "consideration",
        "history",
        "science",
        "pointing",
        "among",
        "many",
        "thing",
        "exponential",
        "increase",
        "number",
        "scientist",
        "quantity",
        "publication",
        "since",
        "scientific",
        "revolution",
        "exponential",
        "increase",
        "faster",
        "world",
        "population",
        "increase",
        "obviously",
        "continue",
        "forever",
        "fact",
        "already",
        "beginning",
        "plateau",
        "industrialized",
        "nation",
        "s",
        "among",
        "philosopher",
        "rescher",
        "probably",
        "first",
        "analyze",
        "aggregate",
        "data",
        "concerning",
        "scientific",
        "innovation",
        "arguing",
        "research",
        "progress",
        "discovery",
        "given",
        "magnitude",
        "become",
        "difficult",
        "rescher",
        "concludes",
        "must",
        "eventually",
        "expect",
        "decrease",
        "rate",
        "discovery",
        "given",
        "magnitude",
        "hence",
        "presumably",
        "similar",
        "decrease",
        "rate",
        "scientific",
        "revolution",
        "although",
        "mention",
        "schumpeter",
        "work",
        "express",
        "similar",
        "view",
        "scientific",
        "progress",
        "large",
        "measure",
        "annihilates",
        "rather",
        "enlarges",
        "gone",
        "beforeit",
        "build",
        "new",
        "foundation",
        "ruin",
        "old",
        "scientific",
        "theorizing",
        "generally",
        "move",
        "ahead",
        "addition",
        "enlargement",
        "demolition",
        "replacement",
        "p",
        "rescher",
        "emphasis",
        "broadly",
        "kuhnian",
        "position",
        "position",
        "number",
        "magnitude",
        "revolution",
        "contrast",
        "sharply",
        "butterfield",
        "saw",
        "revolution",
        "founding",
        "revolution",
        "also",
        "epistemological",
        "realist",
        "grant",
        "revolutionary",
        "conceptual",
        "practical",
        "change",
        "occurred",
        "believe",
        "become",
        "successively",
        "smaller",
        "future",
        "science",
        "approach",
        "true",
        "theory",
        "kuhn",
        "later",
        "position",
        "specialty",
        "insulated",
        "one",
        "another",
        "taxonomic",
        "incommensurability",
        "present",
        "u",
        "somewhat",
        "le",
        "integrated",
        "conception",
        "science",
        "thus",
        "one",
        "le",
        "subject",
        "largescale",
        "revolutionary",
        "disruption",
        "since",
        "regard",
        "scientific",
        "practice",
        "organization",
        "highly",
        "designed",
        "technological",
        "system",
        "work",
        "charles",
        "perrow",
        "others",
        "technological",
        "risk",
        "relevant",
        "see",
        "perrow",
        "entry",
        "approach",
        "margolis",
        "note",
        "importance",
        "phenomenon",
        "contagion",
        "new",
        "idea",
        "practice",
        "suddenly",
        "reach",
        "kind",
        "social",
        "tipping",
        "point",
        "spread",
        "rapidly",
        "contagion",
        "course",
        "necessary",
        "revolt",
        "succeed",
        "revolution",
        "today",
        "contagion",
        "topic",
        "studied",
        "carefully",
        "network",
        "theorist",
        "popularized",
        "malcolm",
        "gladwell",
        "tipping",
        "point",
        "steven",
        "strogatz",
        "duncan",
        "watt",
        "albertlászló",
        "barabási",
        "among",
        "new",
        "breed",
        "network",
        "theorist",
        "developing",
        "technical",
        "account",
        "phase",
        "change",
        "resulting",
        "growth",
        "reorganization",
        "network",
        "including",
        "social",
        "network",
        "sciencea",
        "topic",
        "dear",
        "early",
        "kuhn",
        "heart",
        "struggled",
        "theme",
        "structure",
        "see",
        "strogatz",
        "chap",
        "watt",
        "newman",
        "barabási",
        "buchanan",
        "emergence",
        "prominence",
        "chaos",
        "theory",
        "nonlinear",
        "dynamic",
        "constitute",
        "scientific",
        "revolution",
        "distinctly",
        "kuhnian",
        "revolution",
        "recent",
        "year",
        "several",
        "writer",
        "including",
        "scientist",
        "science",
        "writer",
        "attempted",
        "link",
        "kuhn",
        "idea",
        "revolutionary",
        "paradigm",
        "shift",
        "emergence",
        "chaos",
        "theory",
        "complexity",
        "theory",
        "network",
        "theory",
        "eg",
        "gleick",
        "chap",
        "chaos",
        "theory",
        "revolution",
        "ruelle",
        "chap",
        "jen",
        "cowan",
        "et",
        "al",
        "f",
        "complexity",
        "theory",
        "buchanan",
        "network",
        "theory",
        "interestingly",
        "author",
        "reapply",
        "idea",
        "kuhn",
        "account",
        "theoretically",
        "construing",
        "revolutionary",
        "paradigm",
        "shift",
        "phase",
        "change",
        "nonlinear",
        "jump",
        "one",
        "strange",
        "attractor",
        "one",
        "sort",
        "network",
        "structure",
        "another",
        "steven",
        "kellert",
        "considers",
        "reject",
        "claim",
        "chaos",
        "theory",
        "represents",
        "kuhnian",
        "revolution",
        "although",
        "provide",
        "new",
        "set",
        "research",
        "problem",
        "standard",
        "degree",
        "transforms",
        "worldview",
        "overturn",
        "replace",
        "entrenched",
        "theory",
        "kellert",
        "argues",
        "chaos",
        "theory",
        "even",
        "constitute",
        "emergence",
        "new",
        "mature",
        "science",
        "rather",
        "extension",
        "standard",
        "mechanic",
        "although",
        "may",
        "constitute",
        "new",
        "style",
        "reasoning",
        "kellert",
        "position",
        "hang",
        "partly",
        "construe",
        "theory",
        "theory",
        "toolbox",
        "model",
        "something",
        "like",
        "integrated",
        "collection",
        "kuhnian",
        "exemplar",
        "giere",
        "teller",
        "claim",
        "revolutionary",
        "theory",
        "development",
        "kind",
        "becomes",
        "plausible",
        "nonlinear",
        "dynamic",
        "highlight",
        "new",
        "set",
        "model",
        "strange",
        "attractor",
        "characterize",
        "behavior",
        "addition",
        "complex",
        "system",
        "theorist",
        "often",
        "stress",
        "holistic",
        "antireductive",
        "emergent",
        "nature",
        "system",
        "study",
        "contrast",
        "linear",
        "newtonian",
        "paradigm",
        "kuhn",
        "wrote",
        "one",
        "way",
        "normal",
        "science",
        "articulates",
        "paradigm",
        "permitting",
        "solution",
        "problem",
        "previously",
        "drawn",
        "attention",
        "classical",
        "dynamic",
        "suppressed",
        "rather",
        "drawn",
        "attention",
        "problem",
        "chaos",
        "theory",
        "various",
        "sort",
        "complexity",
        "theory",
        "network",
        "theory",
        "much",
        "studied",
        "today",
        "still",
        "easy",
        "agree",
        "kellert",
        "case",
        "fit",
        "kuhn",
        "account",
        "neatly",
        "reader",
        "suggests",
        "pluralistic",
        "conception",
        "scientific",
        "revolution",
        "kuhn",
        "needed",
        "kellert",
        "also",
        "question",
        "whether",
        "traditional",
        "dynamic",
        "really",
        "special",
        "state",
        "crisis",
        "prior",
        "recent",
        "emphasis",
        "nonlinear",
        "dynamic",
        "difficulty",
        "dealing",
        "nonlinear",
        "phenomenon",
        "apparent",
        "almost",
        "beginning",
        "since",
        "kuhn",
        "emphasized",
        "popper",
        "theory",
        "face",
        "anomaly",
        "time",
        "unfortunately",
        "easy",
        "apparently",
        "revolutionary",
        "development",
        "point",
        "back",
        "claim",
        "crisis"
    ]
}