{
    "main_text": "What Are Big Data?\n1. What Are Big Data?\n\nWe are witnessing a progressive “datafication” of social\nlife. Human activities and interactions with the environment are being\nmonitored and recorded with increasing effectiveness, generating an\nenormous digital footprint. The resulting “big data” are a\ntreasure trove for research, with ever more sophisticated\ncomputational tools being developed to extract knowledge from such\ndata. One example is the use of various different types of data\nacquired from cancer patients, including genomic sequences,\nphysiological measurements and individual responses to treatment, to\nimprove diagnosis and treatment. Another example is the integration of\ndata on traffic flow, environmental and geographical conditions, and\nhuman behaviour to produce safety measures for driverless vehicles, so\nthat when confronted with unforeseen events (such as a child suddenly\ndarting into the street on a very cold day), the data can be promptly\nanalysed to identify and generate an appropriate response (the car\nswerving enough to avoid the child while also minimising the risk of\nskidding on ice and damaging to other vehicles). Yet another instance\nis the understanding of the nutritional status and needs of a\nparticular population that can be extracted from combining data on\nfood consumption generated by commercial services (e.g., supermarkets,\nsocial media and restaurants) with data coming from public health and\nsocial services, such as blood test results and hospital intakes\nlinked to malnutrition. In each of these cases, the availability of\ndata and related analytic tools is creating novel opportunities for\nresearch and for the development of new forms of inquiry, which are\nwidely perceived as having a transformative effect on science as a\nwhole.\n\nA useful starting point in reflecting on the significance of such\ncases for a philosophical understanding of research is to consider\nwhat the term “big data” actually refers to within\ncontemporary scientific discourse. There are multiple ways to define\nbig data (Kitchin 2014, Kitchin & McArdle 2016). Perhaps the most\nstraightforward characterisation is as large datasets that\nare produced in a digital form and can be analysed through\ncomputational tools. Hence the two features most commonly\nassociated with Big Data are volume and velocity. Volume\nrefers to the size of the files used to archive and spread data.\nVelocity refers to the pressing speed with which data is\ngenerated and processed. The body of digital data created by research\nis growing at breakneck pace and in ways that are arguably impossible\nfor the human cognitive system to grasp and thus require some form of\nautomated analysis.\n\nVolume and velocity are also, however, the most disputed features of\nbig data. What may be perceived as “large volume” or\n“high velocity” depends on rapidly evolving technologies\nto generate, store, disseminate and visualise the data. This is\nexemplified by the high-throughput production, storage and\ndissemination of genomic sequencing and gene expression data, where\nboth data volume and velocity have dramatically increased within the\nlast two decades. Similarly, current understandings of big data as\n“anything that cannot be easily captured in an Excel\nspreadsheet” are bound to shift rapidly as new analytic software\nbecomes established, and the very idea of using spreadsheets to\ncapture data becomes a thing of the past. Moreover, data size and\nspeed do not take account of the diversity of data types used by\nresearchers, which may include data that are not generated in digital\nformats or whose format is not computationally tractable, and which\nunderscores the importance of data provenance (that is, the conditions\nunder which data were generated and disseminated) to processes of\ninference and interpretation. And as discussed below, the emphasis on\nphysical features of data obscures the continuing dependence of data\ninterpretation on circumstances of data use, including specific\nqueries, values, skills and research situations.\n\nAn alternative is to define big data not by reference to their\nphysical attributes, but rather by virtue of what can and cannot be\ndone with them. In this view, big data is a heterogeneous ensemble of\ndata collected from a variety of different sources, typically (but not\nalways) in digital formats suitable for algorithmic processing, in\norder to generate new knowledge. For example boyd and Crawford (2012:\n663) identify big data with “the capacity to search, aggregate\nand cross-reference large datasets”, while O’Malley and\nSoyer (2012) focus on the ability to interrogate and interrelate\ndiverse types of data, with the aim to be able to consult them as a\nsingle body of evidence. The examples of transformative “big\ndata research” given above are all easily fitted into this view:\nit is not the mere fact that lots of data are available that makes a\ndifferent in those cases, but rather the fact that lots of data can be\nmobilised from a wide variety of sources (medical records,\nenvironmental surveys, weather measurements, consumer behaviour). This\naccount makes sense of other characteristic “v-words” that\nhave been associated with big data, including:\n\n Variety in the formats and purposes of data, which may\ninclude objects as different as samples of animal tissue, free-text\nobservations, humidity measurements, GPS coordinates, and the results\nof blood tests;\n Veracity, understood as the extent to which the quality\nand reliability of big data can be guaranteed. Data with high volume,\nvelocity and variety are at significant risk of containing\ninaccuracies, errors and unaccounted-for bias. In the absence of\nappropriate validation and quality checks, this could result in a\nmisleading or outright incorrect evidence base for knowledge claims\n(Floridi & Illari 2014; Cai & Zhu 2015; Leonelli 2017);\n Validity, which indicates the selection of appropriate\ndata with respect to the intended use. The choice of a specific\ndataset as evidence base requires adequate and explicit justification,\nincluding recourse to relevant background knowledge to ground the\nidentification of what counts as data in that context (e.g., Loettgers\n2009, Bogen 2010); \n Volatility, i.e., the extent to which data can be relied\nupon to remain available, accessible and re-interpretable despite\nchanges in archival technologies. This is significant given the\ntendency of formats and tools used to generate and analyse data to\nbecome obsolete, and the efforts required to update data\ninfrastructures so as to guarantee data access in the long term\n(Bowker 2006; Edwards 2010; Lagoze 2014; Borgman 2015);\n Value, i.e., the multifaceted forms of significance\nattributed to big data by different sections of society, which depend\nas much on the intended use of the data as on historical, social and\ngeographical circumstances (Leonelli 2016, D’Ignazio and Klein\n2020). Alongside scientific value, researchers may impute financial,\nethical, reputational and even affective value to data, depending on\ntheir intended use as well as the historical, social and geographical\ncircumstances of their use.  The institutions involved in governing\nand funding research also have ways of valuing data, which may not\nalways overlap with the priorities of researchers (Tempini 2017).\n\n\nThis list of features, though not exhaustive, highlights how big data\nis not simply “a lot of data”. The epistemic power of big\ndata lies in their capacity to bridge between different research\ncommunities, methodological approaches and theoretical frameworks that\nare difficult to link due to conceptual fragmentation, social barriers\nand technical difficulties (Leonelli 2019a). And indeed, appeals to\nbig data often emerge from situations of inquiry that are at once\ntechnically, conceptually and socially challenging, and where existing\nmethods and resources have proved insufficient or inadequate (Sterner\n& Franz 2017; Sterner, Franz, & Witteveen 2020).\n\nThis understanding of big data is rooted in a long history of\nresearchers grappling with large and complex datasets, as exemplified\nby fields like astronomy, meteorology, taxonomy and demography (see\nthe collections assembled by Daston 2017; Anorova et al. 2017; Porter\n& Chaderavian 2018; as well as Anorova et al. 2010, Sepkoski 2013,\nStevens 2016, Strasser 2019 among others). Similarly, biomedical\nresearch—and particularly subfields such as epidemiology,\npharmacology and public health—has an extensive tradition of\ntackling data of high volume, velocity, variety and volatility, and\nwhose validity, veracity and value are regularly negotiated and\ncontested by patients, governments, funders, pharmaceutical companies,\ninsurances and public institutions (Bauer 2008). Throughout the\ntwentieth century, these efforts spurred the development of\ntechniques, institutions and instruments to collect, order, visualise\nand analyse data, such as: standard classification systems and\nformats; guidelines, tools and legislation for the management and\nsecurity of sensitive data; and infrastructures to integrate and\nsustain data collections over long periods of time (Daston 2017).\n\nThis work culminated in the application of computational technologies,\nmodelling tools and statistical methods to big data (Porter 1995;\nHumphreys 2004; Edwards 2010), increasingly pushing the boundaries of\ndata analytics thanks to supervised learning, model fitting, deep\nneural networks, search and optimisation methods, complex data\nvisualisations and various other tools now associated with artificial\nintelligence. Many of these tools are based on algorithms whose\nfunctioning and results are tested against specific data samples (a\nprocess called “training”). These algorithms are\nprogrammed to “learn” from each interaction with novel\ndata: in other words, they have the capacity to change themselves in\nresponse to new information being inputted into the system, thus\nbecoming more attuned to the phenomena they are analysing and\nimproving their ability to predict future behaviour. The scope and\nextent of such changes is shaped by the assumptions used to build the\nalgorithms and the capability of related software and hardware to\nidentify, access and process information of relevance to the learning\nin question. There is however a degree of unpredictability and opacity\nto these systems, which can evolve to the point of defying human\nunderstanding (more on this below).\n\nNew institutions, communication platforms and regulatory frameworks\nalso emerged to assemble, prepare and maintain data for such uses\n(Kitchin 2014), such as various forms of digital data infrastructures,\norganisations aiming to coordinate and improve the global data\nlandscape (e.g., the Research Data Alliance), and novel measures for\ndata protection, like the General Data Protection Regulation launched\nin 2017 by the European Union. Together, these techniques and\ninstitutions afford the opportunity to assemble and interpret data at\na much broader scale, while also promising to deliver finer levels of\ngranularity in data\n analysis.[1]\n They increase the scope of any investigation by making it possible\nfor researchers to link their own findings to those of countless\nothers across the world, both within and beyond the academic sphere.\nBy enhancing the mobility of data, they facilitate their repurposing\nfor a variety of goals that may have been unforeseeable when the data\nwere originally generated. And by transforming the role of data within\nresearch, they heighten their status as valuable research outputs in\nand of themselves. These technological and methodological developments\nhave significant implications for philosophical conceptualisations of\ndata, inferential processes and scientific knowledge, as well as for\nhow research is conducted, organised, governed and assessed. It is to\nthese philosophical concerns that I now turn.\n",
    "section_title": "1. What Are Big Data?",
    "entry_title": "Scientific Research and Big Data",
    "hierarchy_title": "Scientific Research and Big Data || What Are Big Data?",
    "tokenized_text": [
        "big",
        "data",
        "big",
        "data",
        "witnessing",
        "progressive",
        "datafication",
        "social",
        "life",
        "human",
        "activity",
        "interaction",
        "environment",
        "monitored",
        "recorded",
        "increasing",
        "effectiveness",
        "generating",
        "enormous",
        "digital",
        "footprint",
        "resulting",
        "big",
        "data",
        "treasure",
        "trove",
        "research",
        "ever",
        "sophisticated",
        "computational",
        "tool",
        "developed",
        "extract",
        "knowledge",
        "data",
        "one",
        "example",
        "use",
        "various",
        "different",
        "type",
        "data",
        "acquired",
        "cancer",
        "patient",
        "including",
        "genomic",
        "sequence",
        "physiological",
        "measurement",
        "individual",
        "response",
        "treatment",
        "improve",
        "diagnosis",
        "treatment",
        "another",
        "example",
        "integration",
        "data",
        "traffic",
        "flow",
        "environmental",
        "geographical",
        "condition",
        "human",
        "behaviour",
        "produce",
        "safety",
        "measure",
        "driverless",
        "vehicle",
        "confronted",
        "unforeseen",
        "event",
        "child",
        "suddenly",
        "darting",
        "street",
        "cold",
        "day",
        "data",
        "promptly",
        "analysed",
        "identify",
        "generate",
        "appropriate",
        "response",
        "car",
        "swerving",
        "enough",
        "avoid",
        "child",
        "also",
        "minimising",
        "risk",
        "skidding",
        "ice",
        "damaging",
        "vehicle",
        "yet",
        "another",
        "instance",
        "understanding",
        "nutritional",
        "status",
        "need",
        "particular",
        "population",
        "extracted",
        "combining",
        "data",
        "food",
        "consumption",
        "generated",
        "commercial",
        "service",
        "eg",
        "supermarket",
        "social",
        "medium",
        "restaurant",
        "data",
        "coming",
        "public",
        "health",
        "social",
        "service",
        "blood",
        "test",
        "result",
        "hospital",
        "intake",
        "linked",
        "malnutrition",
        "case",
        "availability",
        "data",
        "related",
        "analytic",
        "tool",
        "creating",
        "novel",
        "opportunity",
        "research",
        "development",
        "new",
        "form",
        "inquiry",
        "widely",
        "perceived",
        "transformative",
        "effect",
        "science",
        "whole",
        "useful",
        "starting",
        "point",
        "reflecting",
        "significance",
        "case",
        "philosophical",
        "understanding",
        "research",
        "consider",
        "term",
        "big",
        "data",
        "actually",
        "refers",
        "within",
        "contemporary",
        "scientific",
        "discourse",
        "multiple",
        "way",
        "define",
        "big",
        "data",
        "kitchin",
        "kitchin",
        "mcardle",
        "perhaps",
        "straightforward",
        "characterisation",
        "large",
        "datasets",
        "produced",
        "digital",
        "form",
        "analysed",
        "computational",
        "tool",
        "hence",
        "two",
        "feature",
        "commonly",
        "associated",
        "big",
        "data",
        "volume",
        "velocity",
        "volume",
        "refers",
        "size",
        "file",
        "used",
        "archive",
        "spread",
        "data",
        "velocity",
        "refers",
        "pressing",
        "speed",
        "data",
        "generated",
        "processed",
        "body",
        "digital",
        "data",
        "created",
        "research",
        "growing",
        "breakneck",
        "pace",
        "way",
        "arguably",
        "impossible",
        "human",
        "cognitive",
        "system",
        "grasp",
        "thus",
        "require",
        "form",
        "automated",
        "analysis",
        "volume",
        "velocity",
        "also",
        "however",
        "disputed",
        "feature",
        "big",
        "data",
        "may",
        "perceived",
        "large",
        "volume",
        "high",
        "velocity",
        "depends",
        "rapidly",
        "evolving",
        "technology",
        "generate",
        "store",
        "disseminate",
        "visualise",
        "data",
        "exemplified",
        "highthroughput",
        "production",
        "storage",
        "dissemination",
        "genomic",
        "sequencing",
        "gene",
        "expression",
        "data",
        "data",
        "volume",
        "velocity",
        "dramatically",
        "increased",
        "within",
        "last",
        "two",
        "decade",
        "similarly",
        "current",
        "understanding",
        "big",
        "data",
        "anything",
        "easily",
        "captured",
        "excel",
        "spreadsheet",
        "bound",
        "shift",
        "rapidly",
        "new",
        "analytic",
        "software",
        "becomes",
        "established",
        "idea",
        "using",
        "spreadsheet",
        "capture",
        "data",
        "becomes",
        "thing",
        "past",
        "moreover",
        "data",
        "size",
        "speed",
        "take",
        "account",
        "diversity",
        "data",
        "type",
        "used",
        "researcher",
        "may",
        "include",
        "data",
        "generated",
        "digital",
        "format",
        "whose",
        "format",
        "computationally",
        "tractable",
        "underscore",
        "importance",
        "data",
        "provenance",
        "condition",
        "data",
        "generated",
        "disseminated",
        "process",
        "inference",
        "interpretation",
        "discussed",
        "emphasis",
        "physical",
        "feature",
        "data",
        "obscures",
        "continuing",
        "dependence",
        "data",
        "interpretation",
        "circumstance",
        "data",
        "use",
        "including",
        "specific",
        "query",
        "value",
        "skill",
        "research",
        "situation",
        "alternative",
        "define",
        "big",
        "data",
        "reference",
        "physical",
        "attribute",
        "rather",
        "virtue",
        "done",
        "view",
        "big",
        "data",
        "heterogeneous",
        "ensemble",
        "data",
        "collected",
        "variety",
        "different",
        "source",
        "typically",
        "always",
        "digital",
        "format",
        "suitable",
        "algorithmic",
        "processing",
        "order",
        "generate",
        "new",
        "knowledge",
        "example",
        "boyd",
        "crawford",
        "identify",
        "big",
        "data",
        "capacity",
        "search",
        "aggregate",
        "crossreference",
        "large",
        "datasets",
        "malley",
        "soyer",
        "focus",
        "ability",
        "interrogate",
        "interrelate",
        "diverse",
        "type",
        "data",
        "aim",
        "able",
        "consult",
        "single",
        "body",
        "evidence",
        "example",
        "transformative",
        "big",
        "data",
        "research",
        "given",
        "easily",
        "fitted",
        "view",
        "mere",
        "fact",
        "lot",
        "data",
        "available",
        "make",
        "different",
        "case",
        "rather",
        "fact",
        "lot",
        "data",
        "mobilised",
        "wide",
        "variety",
        "source",
        "medical",
        "record",
        "environmental",
        "survey",
        "weather",
        "measurement",
        "consumer",
        "behaviour",
        "account",
        "make",
        "sense",
        "characteristic",
        "vwords",
        "associated",
        "big",
        "data",
        "including",
        "variety",
        "format",
        "purpose",
        "data",
        "may",
        "include",
        "object",
        "different",
        "sample",
        "animal",
        "tissue",
        "freetext",
        "observation",
        "humidity",
        "measurement",
        "gps",
        "coordinate",
        "result",
        "blood",
        "test",
        "veracity",
        "understood",
        "extent",
        "quality",
        "reliability",
        "big",
        "data",
        "guaranteed",
        "data",
        "high",
        "volume",
        "velocity",
        "variety",
        "significant",
        "risk",
        "containing",
        "inaccuracy",
        "error",
        "unaccountedfor",
        "bias",
        "absence",
        "appropriate",
        "validation",
        "quality",
        "check",
        "could",
        "result",
        "misleading",
        "outright",
        "incorrect",
        "evidence",
        "base",
        "knowledge",
        "claim",
        "floridi",
        "illari",
        "cai",
        "zhu",
        "leonelli",
        "validity",
        "indicates",
        "selection",
        "appropriate",
        "data",
        "respect",
        "intended",
        "use",
        "choice",
        "specific",
        "dataset",
        "evidence",
        "base",
        "requires",
        "adequate",
        "explicit",
        "justification",
        "including",
        "recourse",
        "relevant",
        "background",
        "knowledge",
        "ground",
        "identification",
        "count",
        "data",
        "context",
        "eg",
        "loettgers",
        "bogen",
        "volatility",
        "ie",
        "extent",
        "data",
        "relied",
        "upon",
        "remain",
        "available",
        "accessible",
        "reinterpretable",
        "despite",
        "change",
        "archival",
        "technology",
        "significant",
        "given",
        "tendency",
        "format",
        "tool",
        "used",
        "generate",
        "analyse",
        "data",
        "become",
        "obsolete",
        "effort",
        "required",
        "update",
        "data",
        "infrastructure",
        "guarantee",
        "data",
        "access",
        "long",
        "term",
        "bowker",
        "edward",
        "lagoze",
        "borgman",
        "value",
        "ie",
        "multifaceted",
        "form",
        "significance",
        "attributed",
        "big",
        "data",
        "different",
        "section",
        "society",
        "depend",
        "much",
        "intended",
        "use",
        "data",
        "historical",
        "social",
        "geographical",
        "circumstance",
        "leonelli",
        "ignazio",
        "klein",
        "alongside",
        "scientific",
        "value",
        "researcher",
        "may",
        "impute",
        "financial",
        "ethical",
        "reputational",
        "even",
        "affective",
        "value",
        "data",
        "depending",
        "intended",
        "use",
        "well",
        "historical",
        "social",
        "geographical",
        "circumstance",
        "use",
        "institution",
        "involved",
        "governing",
        "funding",
        "research",
        "also",
        "way",
        "valuing",
        "data",
        "may",
        "always",
        "overlap",
        "priority",
        "researcher",
        "tempini",
        "list",
        "feature",
        "though",
        "exhaustive",
        "highlight",
        "big",
        "data",
        "simply",
        "lot",
        "data",
        "epistemic",
        "power",
        "big",
        "data",
        "lie",
        "capacity",
        "bridge",
        "different",
        "research",
        "community",
        "methodological",
        "approach",
        "theoretical",
        "framework",
        "difficult",
        "link",
        "due",
        "conceptual",
        "fragmentation",
        "social",
        "barrier",
        "technical",
        "difficulty",
        "leonelli",
        "a",
        "indeed",
        "appeal",
        "big",
        "data",
        "often",
        "emerge",
        "situation",
        "inquiry",
        "technically",
        "conceptually",
        "socially",
        "challenging",
        "existing",
        "method",
        "resource",
        "proved",
        "insufficient",
        "inadequate",
        "sterner",
        "franz",
        "sterner",
        "franz",
        "witteveen",
        "understanding",
        "big",
        "data",
        "rooted",
        "long",
        "history",
        "researcher",
        "grappling",
        "large",
        "complex",
        "datasets",
        "exemplified",
        "field",
        "like",
        "astronomy",
        "meteorology",
        "taxonomy",
        "demography",
        "see",
        "collection",
        "assembled",
        "daston",
        "anorova",
        "et",
        "al",
        "porter",
        "chaderavian",
        "well",
        "anorova",
        "et",
        "al",
        "sepkoski",
        "stevens",
        "strasser",
        "among",
        "others",
        "similarly",
        "biomedical",
        "researchand",
        "particularly",
        "subfields",
        "epidemiology",
        "pharmacology",
        "public",
        "healthhas",
        "extensive",
        "tradition",
        "tackling",
        "data",
        "high",
        "volume",
        "velocity",
        "variety",
        "volatility",
        "whose",
        "validity",
        "veracity",
        "value",
        "regularly",
        "negotiated",
        "contested",
        "patient",
        "government",
        "funders",
        "pharmaceutical",
        "company",
        "insurance",
        "public",
        "institution",
        "bauer",
        "throughout",
        "twentieth",
        "century",
        "effort",
        "spurred",
        "development",
        "technique",
        "institution",
        "instrument",
        "collect",
        "order",
        "visualise",
        "analyse",
        "data",
        "standard",
        "classification",
        "system",
        "format",
        "guideline",
        "tool",
        "legislation",
        "management",
        "security",
        "sensitive",
        "data",
        "infrastructure",
        "integrate",
        "sustain",
        "data",
        "collection",
        "long",
        "period",
        "time",
        "daston",
        "work",
        "culminated",
        "application",
        "computational",
        "technology",
        "modelling",
        "tool",
        "statistical",
        "method",
        "big",
        "data",
        "porter",
        "humphreys",
        "edward",
        "increasingly",
        "pushing",
        "boundary",
        "data",
        "analytics",
        "thanks",
        "supervised",
        "learning",
        "model",
        "fitting",
        "deep",
        "neural",
        "network",
        "search",
        "optimisation",
        "method",
        "complex",
        "data",
        "visualisation",
        "various",
        "tool",
        "associated",
        "artificial",
        "intelligence",
        "many",
        "tool",
        "based",
        "algorithm",
        "whose",
        "functioning",
        "result",
        "tested",
        "specific",
        "data",
        "sample",
        "process",
        "called",
        "training",
        "algorithm",
        "programmed",
        "learn",
        "interaction",
        "novel",
        "data",
        "word",
        "capacity",
        "change",
        "response",
        "new",
        "information",
        "inputted",
        "system",
        "thus",
        "becoming",
        "attuned",
        "phenomenon",
        "analysing",
        "improving",
        "ability",
        "predict",
        "future",
        "behaviour",
        "scope",
        "extent",
        "change",
        "shaped",
        "assumption",
        "used",
        "build",
        "algorithm",
        "capability",
        "related",
        "software",
        "hardware",
        "identify",
        "access",
        "process",
        "information",
        "relevance",
        "learning",
        "question",
        "however",
        "degree",
        "unpredictability",
        "opacity",
        "system",
        "evolve",
        "point",
        "defying",
        "human",
        "understanding",
        "new",
        "institution",
        "communication",
        "platform",
        "regulatory",
        "framework",
        "also",
        "emerged",
        "assemble",
        "prepare",
        "maintain",
        "data",
        "us",
        "kitchin",
        "various",
        "form",
        "digital",
        "data",
        "infrastructure",
        "organisation",
        "aiming",
        "coordinate",
        "improve",
        "global",
        "data",
        "landscape",
        "eg",
        "research",
        "data",
        "alliance",
        "novel",
        "measure",
        "data",
        "protection",
        "like",
        "general",
        "data",
        "protection",
        "regulation",
        "launched",
        "european",
        "union",
        "together",
        "technique",
        "institution",
        "afford",
        "opportunity",
        "assemble",
        "interpret",
        "data",
        "much",
        "broader",
        "scale",
        "also",
        "promising",
        "deliver",
        "finer",
        "level",
        "granularity",
        "data",
        "analysis",
        "increase",
        "scope",
        "investigation",
        "making",
        "possible",
        "researcher",
        "link",
        "finding",
        "countless",
        "others",
        "across",
        "world",
        "within",
        "beyond",
        "academic",
        "sphere",
        "enhancing",
        "mobility",
        "data",
        "facilitate",
        "repurposing",
        "variety",
        "goal",
        "may",
        "unforeseeable",
        "data",
        "originally",
        "generated",
        "transforming",
        "role",
        "data",
        "within",
        "research",
        "heighten",
        "status",
        "valuable",
        "research",
        "output",
        "technological",
        "methodological",
        "development",
        "significant",
        "implication",
        "philosophical",
        "conceptualisation",
        "data",
        "inferential",
        "process",
        "scientific",
        "knowledge",
        "well",
        "research",
        "conducted",
        "organised",
        "governed",
        "assessed",
        "philosophical",
        "concern",
        "turn"
    ]
}