{
    "main_text": "Larger Formations and Historical A Prioris: The Germanic and French Traditions || The French Discontinuity Theorists\n5.3 The French Discontinuity Theorists\n\nMeanwhile, important French thinkers had already taken a historical\napproach, one that explicitly characterizes science as a series of\nbreaks or coupures. The principal genealogy includes\nLéon Brunschvicg, Gaston Bachelard and his student, Georges\nCanguilhem, and the latter’s student, Michel Foucault. Neither\nKuhn’s historicism nor his talk of revolutionary breaks was news\nto the French (Gutting, 2001, 2003). The French tradition of science\nstudies, going back to Auguste Comte and including later figures such\nas Pierre Duhem and Henri Poincaré, possessed a historical\ndimension that positivism lost after Ernst Mach, as it became logical\npositivism. However, the French and Germanic traditions have some\nroots in common. As Gutting points out, Brunschvicg, like Émile\nMeyerson, was a science-oriented idealist. For him the mind is not a\npassive wax tablet; rather, it actively forges internal links among\nideas, yet it is also often surprised by the resistant exteriority of\nthe natural world. Against traditional metaphysics, philosophy of\nscience should limit itself to what the science of the time\nallows—but not dogmatically so. For dogmatic attempts to extract\ntimeless principles and limitations (such as Kant’s denial of\nthe possibility of non-Euclidean geometry) may soon be embarrassed by\nfurther scientific advances. Einstein’s general theory of\nrelativity exemplifies the revolutionary nature of the most impressive\ndevelopments.\n\nBachelard, French physicist and philosopher-historian of science, also\nbelieved that only by studying history of science can we gain an\nadequate understanding of human reason. He stressed the importance of\nepistemological breaks or discontinuities (coupures\népistémologiques). In Le Nouvel Esprit\nScientifique (1934), Bachelard argued that the worldview of\nclassical physics, valuable in its own time, eventually became an\nobstacle to future progress in physics. Hence a break was needed.\nHere, then, we already find the idea that a successful theory can lose\nits luster by being considered exhausted of its resources and thus\nlacking in fertility. Like Brunschvicg, Bachelard held that a\ndefensible, realist philosophy had to be based on the science of its\nday. Hence, scientific revolutions have (and ought to have) brought\nabout epistemological revolutions. The reality we posit, he said,\nought to be that of the best science but with the realization that our\nconcepts are active constructs of our own minds, not imported from\nnature’s own language, as it were. Future mental activity as\nwell as future empirical findings are likely to require another\nrupture. As Gutting points out, Bachelard’s account of\ndiscontinuity was not as radical as Kuhn’s. Bachelard was\nwilling to speak of progress toward the truth. He made much of the\nfact that successor frameworks, such as non-Euclidean geometry or\nquantum physics, retain key predecessor results as special cases and,\nin effect, contextualize them.\n\nCanguilhem was more interested in the biological and health sciences\nthan Bachelard and gave great attention to the distinction between the\nnormal and the pathological, a distinction that does not arise in\nphysical science. For this and other reasons, in his view, we can\nexpect no reduction of biology to physics. Canguilhem provided a more\nnuanced conception of obstacles and ruptures, noting, for example,\nthat an approach such as vitalism that constitutes an obstacle in one\ndomain of research can simultaneously play a positive role elsewhere,\nas in helping biological scientists to resist reductive thinking. Here\nwe find context sensitivities and heuristic resources difficult to\ncapture in terms of a context- and content-neutral logic of science\nsuch as the logical empiricists espoused.\n\nBachelard and Canguilhem also had less disruptive conceptions of\nscientific objectivity and scientific closure than Kuhn. Canguilhem\ncriticized Kuhn’s (alleged) view that rational closure could not\namount to more than group consensus. Both Frenchmen emphasized the\nimportance of norms and denied that disciplinary agreement was as weak\nas Kuhnian consensus. Kuhn replied to this sort of objection (in\n“Postscript” and elsewhere) that his scientific\ncommunities do possess shared values, that their agreement is not\nsomething arbitrary, say, as whipped up by political ideologues.\n\nFoucault’s archaeology of knowledge (Foucault 1966, 1969) posits\na distinction between a superstructure of deliberately made\nobservations, claims, and arguments and a deep structure, most\nelements of which we are probably unconscious. Once again we meet a\ntwo-level account. Writes Hacking:\n\nFoucault used the French world connaissance to stand for such\nitems of surface knowledge while savoir meant more than\nscience; it was a frame, postulated by Foucault, within which surface\nhypotheses got their sense. Savoir is not knowledge in the\nsense of a bunch of solid propositions. This “depth”\nknowledge is more like a postulated set of rules that determine what\nkinds of sentences are going to count as true or false in some domain.\nThe kinds of things to be said about the brain in 1780 are not the\nkinds of things to be said a quarter-century later. That is not\nbecause we have different beliefs about brains, but because\n“brain” denotes a new kind of object in the later\ndiscourse, and occurs in different sorts of sentences. [2002, 77]\n\n\nGiven the influence of Foucault, we may also locate our discussion of\nHacking’s own work on historical ontology here (Hacking 2002).\nHacking (1975, 1990, 1995, 2012) has studied in depth the emergence of\nprobability theory and (later) of statistical thinking and the\nconstruction of the modern self as key examples of what he terms\n“historical ontology.” He acknowledges inspiration from\nboth Foucault’s discursive formations and Crombie’s styles\nof thinking (Crombie 1994), with a dose of Feyerabend thrown into the\nmix. Like Kuhn (and Friedman), Hacking returns to Kant’s\n“how possible?” question, the answer to which sets out the\nnecessary conditions for a logical space of reasons in which\npractitioners can make true or false claims about objects and pose\nresearch questions about them. Hacking, too, historicizes the Kantian\nconception. He likes the term ‘historical a priori’, which\nCanguilhem once applied to the work of his erstwhile student,\nFoucault.\n\n\nThe historical a priori points at conditions whose dominion\nis as inexorable, there and then, as Kant’s synthetic a\npriori. Yet they are at the same time conditioned and formed in\nhistory, and can be uprooted by later, radical, historical\ntransformations. T. S. Kuhn’s paradigms have some of the\ncharacter of a historical a priori. [Hacking 2002, 5]\n\n…\n\n[S]cientific styles of thinking & doing are not good\nbecause they find out the truth. They have become part of our\nstandards for what it is, to find out the truth. They establish\ncriteria of truthfulness. … Scientific reason, as manifested in\nCrombie’s six genres of inquiry, has no foundation. The styles\nare how we reason in the sciences. To say that these styles\nof thinking & doing are self-authenticating is to say that they\nare autonomous: they do not answer to some other, higher, or deeper,\nstandard of truth and reason than their own. To repeat: No foundation.\nThe style does not answer to some external canon of truth independent\nof itself. [2012, 605; Hacking’s emphasis]\n\n\nHacking describes changes in historical a prioris as\n“significant singularities during which the coordinates of\n‘scientific objectivity’ are rearranged” (2002,\n6).\n\nAlthough reminiscent of Kuhn’s positions in some ways, there are\nstriking differences. As noted above, Hacking’s constructed\nformations are much broader than Kuhn’s. Thus he feels free to\nemploy telling bits of popular culture in laying out his claims, and\nhe admits to being whiggish in starting from the present and working\nbackward to find out how we got here. Moreover, in mature, modern\nscience, unlike Kuhnian paradigms, several of Hacking’s styles\nof thinking and doing can exist side by side, e.g., the laboratory and\nhypothetical modeling traditions. Yet people living before and after\nthe historical crystallization of a style would find each other\nmutually unintelligible. Hacking recognizes that Kuhnian problems of\nrelativism (rather than subjectivism) lurk in such positions.\n“Just as statistical reasons had no force for the Greeks, so one\nimagines a people for whom none of our reasons for belief have\nforce” (2002, 163). This sort of incommensurability is closer to\nFeyerabend’s extreme cases (as in the ancient Greek astronomers\nversus their Homeric predecessors) than to Kuhn’s “no\ncommon measure” (2002, chap. 11). This sort of unintelligibility\nruns deeper than a Kuhnian translation failure. It is not a question\nof determining which old style statements match presumed new style\ntruths; rather, it is a question of the conditions for an utterance to\nmake a claim that is either true or false at all. Writes\nHacking,\n\nMany of the recent but already classical philosophical discussions of\nsuch topics as incommensurability, indeterminacy of translation, and\nconceptual schemes seem to discuss truth where they ought to be\nconsidering truth-or-falsehood. [2002, 160]\n\n\nBy contrast, Kuhnian paradigms include a set of positive assertions\nabout the world. Yet Kuhn himself was attracted by Hacking’s way\nof putting the point about truth-and-falsity (Kuhn 2000, p. 99).\n",
    "section_title": "5.3 The French Discontinuity Theorists",
    "entry_title": "Scientific Revolutions",
    "hierarchy_title": "Scientific Revolutions || Larger Formations and Historical A Prioris: The Germanic and French Traditions || The French Discontinuity Theorists",
    "tokenized_text": [
        "larger",
        "formation",
        "historical",
        "prioris",
        "germanic",
        "french",
        "tradition",
        "french",
        "discontinuity",
        "theorist",
        "french",
        "discontinuity",
        "theorist",
        "meanwhile",
        "important",
        "french",
        "thinker",
        "already",
        "taken",
        "historical",
        "approach",
        "one",
        "explicitly",
        "characterizes",
        "science",
        "series",
        "break",
        "coupures",
        "principal",
        "genealogy",
        "includes",
        "léon",
        "brunschvicg",
        "gaston",
        "bachelard",
        "student",
        "george",
        "canguilhem",
        "latter",
        "student",
        "michel",
        "foucault",
        "neither",
        "kuhn",
        "historicism",
        "talk",
        "revolutionary",
        "break",
        "news",
        "french",
        "gutting",
        "french",
        "tradition",
        "science",
        "study",
        "going",
        "back",
        "auguste",
        "comte",
        "including",
        "later",
        "figure",
        "pierre",
        "duhem",
        "henri",
        "poincaré",
        "possessed",
        "historical",
        "dimension",
        "positivism",
        "lost",
        "ernst",
        "mach",
        "became",
        "logical",
        "positivism",
        "however",
        "french",
        "germanic",
        "tradition",
        "root",
        "common",
        "gutting",
        "point",
        "brunschvicg",
        "like",
        "émile",
        "meyerson",
        "scienceoriented",
        "idealist",
        "mind",
        "passive",
        "wax",
        "tablet",
        "rather",
        "actively",
        "forge",
        "internal",
        "link",
        "among",
        "idea",
        "yet",
        "also",
        "often",
        "surprised",
        "resistant",
        "exteriority",
        "natural",
        "world",
        "traditional",
        "metaphysics",
        "philosophy",
        "science",
        "limit",
        "science",
        "time",
        "allowsbut",
        "dogmatically",
        "dogmatic",
        "attempt",
        "extract",
        "timeless",
        "principle",
        "limitation",
        "kant",
        "denial",
        "possibility",
        "noneuclidean",
        "geometry",
        "may",
        "soon",
        "embarrassed",
        "scientific",
        "advance",
        "einstein",
        "general",
        "theory",
        "relativity",
        "exemplifies",
        "revolutionary",
        "nature",
        "impressive",
        "development",
        "bachelard",
        "french",
        "physicist",
        "philosopherhistorian",
        "science",
        "also",
        "believed",
        "studying",
        "history",
        "science",
        "gain",
        "adequate",
        "understanding",
        "human",
        "reason",
        "stressed",
        "importance",
        "epistemological",
        "break",
        "discontinuity",
        "coupures",
        "épistémologiques",
        "le",
        "nouvel",
        "esprit",
        "scientifique",
        "bachelard",
        "argued",
        "worldview",
        "classical",
        "physic",
        "valuable",
        "time",
        "eventually",
        "became",
        "obstacle",
        "future",
        "progress",
        "physic",
        "hence",
        "break",
        "needed",
        "already",
        "find",
        "idea",
        "successful",
        "theory",
        "lose",
        "luster",
        "considered",
        "exhausted",
        "resource",
        "thus",
        "lacking",
        "fertility",
        "like",
        "brunschvicg",
        "bachelard",
        "held",
        "defensible",
        "realist",
        "philosophy",
        "based",
        "science",
        "day",
        "hence",
        "scientific",
        "revolution",
        "ought",
        "brought",
        "epistemological",
        "revolution",
        "reality",
        "posit",
        "said",
        "ought",
        "best",
        "science",
        "realization",
        "concept",
        "active",
        "construct",
        "mind",
        "imported",
        "nature",
        "language",
        "future",
        "mental",
        "activity",
        "well",
        "future",
        "empirical",
        "finding",
        "likely",
        "require",
        "another",
        "rupture",
        "gutting",
        "point",
        "bachelard",
        "account",
        "discontinuity",
        "radical",
        "kuhn",
        "bachelard",
        "willing",
        "speak",
        "progress",
        "toward",
        "truth",
        "made",
        "much",
        "fact",
        "successor",
        "framework",
        "noneuclidean",
        "geometry",
        "quantum",
        "physic",
        "retain",
        "key",
        "predecessor",
        "result",
        "special",
        "case",
        "effect",
        "contextualize",
        "canguilhem",
        "interested",
        "biological",
        "health",
        "science",
        "bachelard",
        "gave",
        "great",
        "attention",
        "distinction",
        "normal",
        "pathological",
        "distinction",
        "arise",
        "physical",
        "science",
        "reason",
        "view",
        "expect",
        "reduction",
        "biology",
        "physic",
        "canguilhem",
        "provided",
        "nuanced",
        "conception",
        "obstacle",
        "rupture",
        "noting",
        "example",
        "approach",
        "vitalism",
        "constitutes",
        "obstacle",
        "one",
        "domain",
        "research",
        "simultaneously",
        "play",
        "positive",
        "role",
        "elsewhere",
        "helping",
        "biological",
        "scientist",
        "resist",
        "reductive",
        "thinking",
        "find",
        "context",
        "sensitivity",
        "heuristic",
        "resource",
        "difficult",
        "capture",
        "term",
        "context",
        "contentneutral",
        "logic",
        "science",
        "logical",
        "empiricist",
        "espoused",
        "bachelard",
        "canguilhem",
        "also",
        "le",
        "disruptive",
        "conception",
        "scientific",
        "objectivity",
        "scientific",
        "closure",
        "kuhn",
        "canguilhem",
        "criticized",
        "kuhn",
        "alleged",
        "view",
        "rational",
        "closure",
        "could",
        "amount",
        "group",
        "consensus",
        "frenchman",
        "emphasized",
        "importance",
        "norm",
        "denied",
        "disciplinary",
        "agreement",
        "weak",
        "kuhnian",
        "consensus",
        "kuhn",
        "replied",
        "sort",
        "objection",
        "postscript",
        "elsewhere",
        "scientific",
        "community",
        "posse",
        "shared",
        "value",
        "agreement",
        "something",
        "arbitrary",
        "say",
        "whipped",
        "political",
        "ideologue",
        "foucault",
        "archaeology",
        "knowledge",
        "foucault",
        "posit",
        "distinction",
        "superstructure",
        "deliberately",
        "made",
        "observation",
        "claim",
        "argument",
        "deep",
        "structure",
        "element",
        "probably",
        "unconscious",
        "meet",
        "twolevel",
        "account",
        "writes",
        "hacking",
        "foucault",
        "used",
        "french",
        "world",
        "connaissance",
        "stand",
        "item",
        "surface",
        "knowledge",
        "savoir",
        "meant",
        "science",
        "frame",
        "postulated",
        "foucault",
        "within",
        "surface",
        "hypothesis",
        "got",
        "sense",
        "savoir",
        "knowledge",
        "sense",
        "bunch",
        "solid",
        "proposition",
        "depth",
        "knowledge",
        "like",
        "postulated",
        "set",
        "rule",
        "determine",
        "kind",
        "sentence",
        "going",
        "count",
        "true",
        "false",
        "domain",
        "kind",
        "thing",
        "said",
        "brain",
        "kind",
        "thing",
        "said",
        "quartercentury",
        "later",
        "different",
        "belief",
        "brain",
        "brain",
        "denotes",
        "new",
        "kind",
        "object",
        "later",
        "discourse",
        "occurs",
        "different",
        "sort",
        "sentence",
        "given",
        "influence",
        "foucault",
        "may",
        "also",
        "locate",
        "discussion",
        "hacking",
        "work",
        "historical",
        "ontology",
        "hacking",
        "hacking",
        "studied",
        "depth",
        "emergence",
        "probability",
        "theory",
        "later",
        "statistical",
        "thinking",
        "construction",
        "modern",
        "self",
        "key",
        "example",
        "term",
        "historical",
        "ontology",
        "acknowledges",
        "inspiration",
        "foucault",
        "discursive",
        "formation",
        "crombie",
        "style",
        "thinking",
        "crombie",
        "dose",
        "feyerabend",
        "thrown",
        "mix",
        "like",
        "kuhn",
        "friedman",
        "hacking",
        "return",
        "kant",
        "possible",
        "question",
        "answer",
        "set",
        "necessary",
        "condition",
        "logical",
        "space",
        "reason",
        "practitioner",
        "make",
        "true",
        "false",
        "claim",
        "object",
        "pose",
        "research",
        "question",
        "hacking",
        "historicizes",
        "kantian",
        "conception",
        "like",
        "term",
        "historical",
        "priori",
        "canguilhem",
        "applied",
        "work",
        "erstwhile",
        "student",
        "foucault",
        "historical",
        "priori",
        "point",
        "condition",
        "whose",
        "dominion",
        "inexorable",
        "kant",
        "synthetic",
        "priori",
        "yet",
        "time",
        "conditioned",
        "formed",
        "history",
        "uprooted",
        "later",
        "radical",
        "historical",
        "transformation",
        "t",
        "s",
        "kuhn",
        "paradigm",
        "character",
        "historical",
        "priori",
        "hacking",
        "cientific",
        "style",
        "thinking",
        "good",
        "find",
        "truth",
        "become",
        "part",
        "standard",
        "find",
        "truth",
        "establish",
        "criterion",
        "truthfulness",
        "scientific",
        "reason",
        "manifested",
        "crombie",
        "six",
        "genre",
        "inquiry",
        "foundation",
        "style",
        "reason",
        "science",
        "say",
        "style",
        "thinking",
        "selfauthenticating",
        "say",
        "autonomous",
        "answer",
        "higher",
        "deeper",
        "standard",
        "truth",
        "reason",
        "repeat",
        "foundation",
        "style",
        "answer",
        "external",
        "canon",
        "truth",
        "independent",
        "hacking",
        "emphasis",
        "hacking",
        "describes",
        "change",
        "historical",
        "prioris",
        "significant",
        "singularity",
        "coordinate",
        "scientific",
        "objectivity",
        "rearranged",
        "although",
        "reminiscent",
        "kuhn",
        "position",
        "way",
        "striking",
        "difference",
        "noted",
        "hacking",
        "constructed",
        "formation",
        "much",
        "broader",
        "kuhn",
        "thus",
        "feel",
        "free",
        "employ",
        "telling",
        "bit",
        "popular",
        "culture",
        "laying",
        "claim",
        "admits",
        "whiggish",
        "starting",
        "present",
        "working",
        "backward",
        "find",
        "got",
        "moreover",
        "mature",
        "modern",
        "science",
        "unlike",
        "kuhnian",
        "paradigm",
        "several",
        "hacking",
        "style",
        "thinking",
        "exist",
        "side",
        "side",
        "eg",
        "laboratory",
        "hypothetical",
        "modeling",
        "tradition",
        "yet",
        "people",
        "living",
        "historical",
        "crystallization",
        "style",
        "would",
        "find",
        "mutually",
        "unintelligible",
        "hacking",
        "recognizes",
        "kuhnian",
        "problem",
        "relativism",
        "rather",
        "subjectivism",
        "lurk",
        "position",
        "statistical",
        "reason",
        "force",
        "greek",
        "one",
        "imago",
        "people",
        "none",
        "reason",
        "belief",
        "force",
        "sort",
        "incommensurability",
        "closer",
        "feyerabend",
        "extreme",
        "case",
        "ancient",
        "greek",
        "astronomer",
        "versus",
        "homeric",
        "predecessor",
        "kuhn",
        "common",
        "measure",
        "chap",
        "sort",
        "unintelligibility",
        "run",
        "deeper",
        "kuhnian",
        "translation",
        "failure",
        "question",
        "determining",
        "old",
        "style",
        "statement",
        "match",
        "presumed",
        "new",
        "style",
        "truth",
        "rather",
        "question",
        "condition",
        "utterance",
        "make",
        "claim",
        "either",
        "true",
        "false",
        "writes",
        "hacking",
        "many",
        "recent",
        "already",
        "classical",
        "philosophical",
        "discussion",
        "topic",
        "incommensurability",
        "indeterminacy",
        "translation",
        "conceptual",
        "scheme",
        "seem",
        "discus",
        "truth",
        "ought",
        "considering",
        "truthorfalsehood",
        "contrast",
        "kuhnian",
        "paradigm",
        "include",
        "set",
        "positive",
        "assertion",
        "world",
        "yet",
        "kuhn",
        "attracted",
        "hacking",
        "way",
        "putting",
        "point",
        "truthandfalsity",
        "kuhn",
        "p"
    ]
}