{
    "main_text": "Larger Formations and Historical A Prioris: The Germanic and French Traditions || The German Neo-Kantian Tradition\n5.2 The German Neo-Kantian Tradition\n\nThere is a long historical gap between Kant/Hegel and Kuhn, and this\nspace is not empty. Many other thinkers, especially those in the\nvarious nineteenth-century idealist traditions, were Kantian or\nHegelian or neo-Hegelian or neo-Kantian opponents of empiricist\npositions that they considered naïve, such as that of John Stuart\nMill. The neo-Kantian label applies even to prominent logical\npositivists of the Vienna Circle and logical empiricists of the Berlin\nCircle, who have too often been caricatured as simple, cumulative\nempiricists. As Friedman (2001) and others have shown, several\nfounders of twentieth-century academic philosophy of science extended\nthe neo-Kantian attack on simple empiricism. The basic idea here is\nthat, just as Kant regarded any account of perception and knowledge as\nnaïvely empiricist insofar as it left no room for underlying\ncognitive organizing principles, so any account of the sciences that\nprovided no analogous underlying social-cognitive framework was a\ncontinuation of simple empiricism, i.e., a version of\n“positivism.” In this particular respect, W. V.\nQuine’s “Two Dogmas of Empiricism” and Word and\nObject (Quine 1951, 1960) were throwbacks to simple empiricism in\ntheir attempt to eliminate the Kantian formal component.\n\nThe German Marburg School of Hermann Cohen, Paul Natorp, and Ernst\nCassirer was especially important in the emergence of modern\nphilosophy of science in the form of the logical positivism and\nlogical empiricism. Friedman (2001 and elsewhere) has explored its\ninfluence on young Reichenbach’s attempt to interpret the\nsignificance of the new relativity theory. Rudolf Carnap had been\ninfluenced by Ernst Cassirer, among others. (See the entries on\nlogical empiricism, Reichenbach, Carnap, Cohen, Natorp, and Cassirer.)\nCassirer’s central theme was the fundamental epistemological\nimplications of the replacement of Aristotle’s subject-predicate\nlogic and substance ontology by the new relational logic of the\nmodern, mathematical-functional approach to nature. This could not be\na priori in Kant’s original sense, since the emergence of\nnon-Euclidean geometry had shown that there are alternative organizing\nprinciples. But the very fact that we still needed organizing\nstructures that are constitutive or definitive of the cognitive\nenterprise in question meant that Kant was still basically correct.\nLike Moritz Schlick, the first leader of the Vienna Circle,\nReichenbach of the Berlin school parlayed his engagement with\nrelativity theory and non-Euclidean geometries into a conception of\nthe “relativized a priori.” All of this by around 1920,\nwith the younger Carnap’s views developing during the 1920s and\n‘30s. In the USA, meanwhile, C. I. Lewis (1929) was defending\nhis “pragmatic a priori.”\n\nIn his famous paper of 1950, “Empiricism, Semantics, and\nOntology,” Carnap made his two-tiered view of inquiry quite\nexplicit. Starting from the problem of the existence of abstract\nentities, Carnap distinguished internal questions, that is, questions\nthat can arise and be answered within a particular logico-linguistic\nframework, from external questions, that is, meta-level questions\nabout which framework to prefer. External questions cannot be answered\nin the same, disciplined manner as internal, for choice of framework\nis ultimately a pragmatic decision based on the expected fertility of\nusing one framework rather than another. Although it is difficult to\nequate Carnap’s fruitfulness decisions with Kuhn’s\nrevolutionary breaks (Kuhn 1993, 313f), Carnap regarded his vision of\nscience as similar to Kuhn’s, and he liked the manuscript of\nStructure that Kuhn submitted to the International\nEncyclopedia of Unified Science, as George Reisch (1991) has\nshown. Thus the clash of Kuhn’s work with that of Carnap and the\npositivist movement has been exaggerated.\n\nAlthough both defended two-tiered conceptions of inquiry, there are\nimportant differences between Kuhn and Carnap (as Friedman, 2001,\n2003, 2010, among others, observes). For Carnap, as for Reichenbach,\nthe choice of framework or coordinating definitions was conventional,\na matter of convenience or heuristic fertility, whereas for committed\nKuhnian normal scientists the foundational tenets of their paradigm\nare deep truths about the world, principles not subject to empirical\ntest. (However, in a crisis situation, fertility becomes a key element\nin theory and paradigm choice.) In Carnap’s frameworks these\nwere explicit systems of logical rules, whereas Kuhn’s account\nof normal science largely jettisoned rule-based knowledge in favor of\na kind of case-based tacit knowledge, the cases being the concrete\nexemplars. Third, Kuhn himself emphasized that his approach was\nhistorical, whereas Carnap’s was not. Although a Carnapian\nchange from one logical framework to another could, in principle, be\nquite revolutionary, Carnap himself never emphasized this point,\nsuggested nothing of Kuhn’s radical discontinuity, and was\nsimply not interested in the history of science.\n\nMeanwhile, Friedman himself has extensively developed the idea of\nhistorically contingent but constitutive a prioris (e.g., 2001, 2003,\n2008). He is sympathetic to Kuhn’s view that revolutions occur\nwhen the constitutive principles change. From the old point of view,\nthere is disruptive and incommensurability, but defenders of the new\nviewpoint manages to establish a kind of continuity. Friedman goes\nwell beyond Kuhn in stressing the role of philosophical ideas in\nestablishing this continuity.\n\nSince deep conceptual revolutions or paradigm-shifts are a fact of\nscientific life (and, I would argue, a necessity), we are never in a\nposition to make our present constitutive principles as truly\nuniversal principles of human reason–as fixed once and for all\nthroughout the evolution of science.\n In recent work, Friedman devotes more attention to the\nsocial dimension, and he notes that even the standards of rationality\nmay continue to change historically. (See the entry “Historical\nTheories of Rationality”. See also DiSalle 2002.)\n\n\nAnother development that appeals to Germanic themes in its criticism\nof naive empiricism is the idealization movement of the Poznań\nSchool in Poland, associated especially with Leszek Nowak. This group\nregards science as developing in an idealizational and dialectical\nmanner, ideas that they trace back to Karl Marx’s analysis of\neconomics, inspired by his own study of Galileo’s fruitful use\nof abstract, idealized models against the Aristotelians. The\nPoznań group regards idealization as the secret to modern science\nand finds it remarkable that virtually all previous analytic\nphilosophy of science remains Aristotelian in treating proposed laws\nand theories not as ideal models but as true or false statements\ndirectly about the real world (Nowak 1980 and later writings; see also\nKrajewsky 1977). As models, these constructions must be concretized to\nsome degree before they can be applied to the real world. While the\nidealizationists tend to reject Kuhnian revolutions as too\ndiscontinuous and irrational, they do see a resemblance to their\ninternalistic, dialectical conception of scientific development. For\nthem a revolution consists in a new theory or model that reveals a\npreviously unnoticed idealizing assumption built into its predecessor,\na change that alters scientists’ conception of what is essential\nversus peripheral to the domain of phenomena in question. Hence there\ncan be a significant change of world-conception.\n\nThere is some affiliation of Poznań with the European\nstructuralist account of theories, based on a set-theoretical analysis\nof theory structure and theory relations. Kuhn himself was much\nattracted to Joseph Sneed’s approach (Sneed 1971), soon extended\nby Wolfgang Stegmüller (1974/1976) and others. Given the\ninformality of Kuhn’s own approach and his explicit shunning of\nrules and rational reconstructions, his attraction to the\nstructuralist line was initially puzzling. However, the structuralists\nwere and are interested in intertheory relations, and models are\ncentral to their non-sentential conception of theories. These are\nmodels in the formal sense, but Kuhn found insightful connections to\nhis own use of models in the form of exemplars. For both Kuhn and the\nstructuralists it is the collection of exemplars or models, not an\nabstract statement of a theory, that carries the weight in scientific\ninquiry.\n\nAlready the early Kuhn, especially in the postscript to the second\nedition of Structure, largely abandoned the traditional\nconception of theories as deductive systems, even in physics, and\nsubstituted informal collections of models of various, exemplary\nkinds, along with a toolbox of expert practices for constructing and\napplying them (Cartwright 1983, Giere 1988, Teller 2008). He always\nliked Margaret Masterson’s remark that “a paradigm [in the\nsense of preferred models or exemplars] is what you use when the\ntheory is not there” (Baltas et al. 2000, 300). Such a view,\nlike Nowak’s, anticipates the move from theory-centered to\nmodel-centered accounts of scientific work. However, Kuhn’s\nnormal scientific practitioners presumably hold the models to be true\nin their original application, as is the grand theory incorporated in\nthe paradigm, whereas today the emphasis is on modeling practices\nacross the sciences, in which the models are almost always known in\nadvance to be false because of their employment of idealizations,\napproximations, abstractions, etc.\n",
    "section_title": "5.2 The German Neo-Kantian Tradition",
    "entry_title": "Scientific Revolutions",
    "hierarchy_title": "Scientific Revolutions || Larger Formations and Historical A Prioris: The Germanic and French Traditions || The German Neo-Kantian Tradition",
    "tokenized_text": [
        "larger",
        "formation",
        "historical",
        "prioris",
        "germanic",
        "french",
        "tradition",
        "german",
        "neokantian",
        "tradition",
        "german",
        "neokantian",
        "tradition",
        "long",
        "historical",
        "gap",
        "kanthegel",
        "kuhn",
        "space",
        "empty",
        "many",
        "thinker",
        "especially",
        "various",
        "nineteenthcentury",
        "idealist",
        "tradition",
        "kantian",
        "hegelian",
        "neohegelian",
        "neokantian",
        "opponent",
        "empiricist",
        "position",
        "considered",
        "naïve",
        "john",
        "stuart",
        "mill",
        "neokantian",
        "label",
        "applies",
        "even",
        "prominent",
        "logical",
        "positivist",
        "vienna",
        "circle",
        "logical",
        "empiricist",
        "berlin",
        "circle",
        "often",
        "caricatured",
        "simple",
        "cumulative",
        "empiricist",
        "friedman",
        "others",
        "shown",
        "several",
        "founder",
        "twentiethcentury",
        "academic",
        "philosophy",
        "science",
        "extended",
        "neokantian",
        "attack",
        "simple",
        "empiricism",
        "basic",
        "idea",
        "kant",
        "regarded",
        "account",
        "perception",
        "knowledge",
        "naïvely",
        "empiricist",
        "insofar",
        "left",
        "room",
        "underlying",
        "cognitive",
        "organizing",
        "principle",
        "account",
        "science",
        "provided",
        "analogous",
        "underlying",
        "socialcognitive",
        "framework",
        "continuation",
        "simple",
        "empiricism",
        "ie",
        "version",
        "positivism",
        "particular",
        "respect",
        "w",
        "v",
        "quine",
        "two",
        "dogma",
        "empiricism",
        "word",
        "object",
        "quine",
        "throwback",
        "simple",
        "empiricism",
        "attempt",
        "eliminate",
        "kantian",
        "formal",
        "component",
        "german",
        "marburg",
        "school",
        "hermann",
        "cohen",
        "paul",
        "natorp",
        "ernst",
        "cassirer",
        "especially",
        "important",
        "emergence",
        "modern",
        "philosophy",
        "science",
        "form",
        "logical",
        "positivism",
        "logical",
        "empiricism",
        "friedman",
        "elsewhere",
        "explored",
        "influence",
        "young",
        "reichenbach",
        "attempt",
        "interpret",
        "significance",
        "new",
        "relativity",
        "theory",
        "rudolf",
        "carnap",
        "influenced",
        "ernst",
        "cassirer",
        "among",
        "others",
        "see",
        "entry",
        "logical",
        "empiricism",
        "reichenbach",
        "carnap",
        "cohen",
        "natorp",
        "cassirer",
        "cassirer",
        "central",
        "theme",
        "fundamental",
        "epistemological",
        "implication",
        "replacement",
        "aristotle",
        "subjectpredicate",
        "logic",
        "substance",
        "ontology",
        "new",
        "relational",
        "logic",
        "modern",
        "mathematicalfunctional",
        "approach",
        "nature",
        "could",
        "priori",
        "kant",
        "original",
        "sense",
        "since",
        "emergence",
        "noneuclidean",
        "geometry",
        "shown",
        "alternative",
        "organizing",
        "principle",
        "fact",
        "still",
        "needed",
        "organizing",
        "structure",
        "constitutive",
        "definitive",
        "cognitive",
        "enterprise",
        "question",
        "meant",
        "kant",
        "still",
        "basically",
        "correct",
        "like",
        "moritz",
        "schlick",
        "first",
        "leader",
        "vienna",
        "circle",
        "reichenbach",
        "berlin",
        "school",
        "parlayed",
        "engagement",
        "relativity",
        "theory",
        "noneuclidean",
        "geometry",
        "conception",
        "relativized",
        "priori",
        "around",
        "younger",
        "carnap",
        "view",
        "developing",
        "s",
        "usa",
        "meanwhile",
        "c",
        "i",
        "lewis",
        "defending",
        "pragmatic",
        "priori",
        "famous",
        "paper",
        "empiricism",
        "semantics",
        "ontology",
        "carnap",
        "made",
        "twotiered",
        "view",
        "inquiry",
        "quite",
        "explicit",
        "starting",
        "problem",
        "existence",
        "abstract",
        "entity",
        "carnap",
        "distinguished",
        "internal",
        "question",
        "question",
        "arise",
        "answered",
        "within",
        "particular",
        "logicolinguistic",
        "framework",
        "external",
        "question",
        "metalevel",
        "question",
        "framework",
        "prefer",
        "external",
        "question",
        "answered",
        "disciplined",
        "manner",
        "internal",
        "choice",
        "framework",
        "ultimately",
        "pragmatic",
        "decision",
        "based",
        "expected",
        "fertility",
        "using",
        "one",
        "framework",
        "rather",
        "another",
        "although",
        "difficult",
        "equate",
        "carnap",
        "fruitfulness",
        "decision",
        "kuhn",
        "revolutionary",
        "break",
        "kuhn",
        "f",
        "carnap",
        "regarded",
        "vision",
        "science",
        "similar",
        "kuhn",
        "liked",
        "manuscript",
        "structure",
        "kuhn",
        "submitted",
        "international",
        "encyclopedia",
        "unified",
        "science",
        "george",
        "reisch",
        "shown",
        "thus",
        "clash",
        "kuhn",
        "work",
        "carnap",
        "positivist",
        "movement",
        "exaggerated",
        "although",
        "defended",
        "twotiered",
        "conception",
        "inquiry",
        "important",
        "difference",
        "kuhn",
        "carnap",
        "friedman",
        "among",
        "others",
        "observes",
        "carnap",
        "reichenbach",
        "choice",
        "framework",
        "coordinating",
        "definition",
        "conventional",
        "matter",
        "convenience",
        "heuristic",
        "fertility",
        "whereas",
        "committed",
        "kuhnian",
        "normal",
        "scientist",
        "foundational",
        "tenet",
        "paradigm",
        "deep",
        "truth",
        "world",
        "principle",
        "subject",
        "empirical",
        "test",
        "however",
        "crisis",
        "situation",
        "fertility",
        "becomes",
        "key",
        "element",
        "theory",
        "paradigm",
        "choice",
        "carnap",
        "framework",
        "explicit",
        "system",
        "logical",
        "rule",
        "whereas",
        "kuhn",
        "account",
        "normal",
        "science",
        "largely",
        "jettisoned",
        "rulebased",
        "knowledge",
        "favor",
        "kind",
        "casebased",
        "tacit",
        "knowledge",
        "case",
        "concrete",
        "exemplar",
        "third",
        "kuhn",
        "emphasized",
        "approach",
        "historical",
        "whereas",
        "carnap",
        "although",
        "carnapian",
        "change",
        "one",
        "logical",
        "framework",
        "another",
        "could",
        "principle",
        "quite",
        "revolutionary",
        "carnap",
        "never",
        "emphasized",
        "point",
        "suggested",
        "nothing",
        "kuhn",
        "radical",
        "discontinuity",
        "simply",
        "interested",
        "history",
        "science",
        "meanwhile",
        "friedman",
        "extensively",
        "developed",
        "idea",
        "historically",
        "contingent",
        "constitutive",
        "prioris",
        "eg",
        "sympathetic",
        "kuhn",
        "view",
        "revolution",
        "occur",
        "constitutive",
        "principle",
        "change",
        "old",
        "point",
        "view",
        "disruptive",
        "incommensurability",
        "defender",
        "new",
        "viewpoint",
        "manages",
        "establish",
        "kind",
        "continuity",
        "friedman",
        "go",
        "well",
        "beyond",
        "kuhn",
        "stressing",
        "role",
        "philosophical",
        "idea",
        "establishing",
        "continuity",
        "since",
        "deep",
        "conceptual",
        "revolution",
        "paradigmshifts",
        "fact",
        "scientific",
        "life",
        "would",
        "argue",
        "necessity",
        "never",
        "position",
        "make",
        "present",
        "constitutive",
        "principle",
        "truly",
        "universal",
        "principle",
        "human",
        "reasonas",
        "fixed",
        "throughout",
        "evolution",
        "science",
        "recent",
        "work",
        "friedman",
        "devotes",
        "attention",
        "social",
        "dimension",
        "note",
        "even",
        "standard",
        "rationality",
        "may",
        "continue",
        "change",
        "historically",
        "see",
        "entry",
        "historical",
        "theory",
        "rationality",
        "see",
        "also",
        "disalle",
        "another",
        "development",
        "appeal",
        "germanic",
        "theme",
        "criticism",
        "naive",
        "empiricism",
        "idealization",
        "movement",
        "poznań",
        "school",
        "poland",
        "associated",
        "especially",
        "leszek",
        "nowak",
        "group",
        "regard",
        "science",
        "developing",
        "idealizational",
        "dialectical",
        "manner",
        "idea",
        "trace",
        "back",
        "karl",
        "marx",
        "analysis",
        "economics",
        "inspired",
        "study",
        "galileo",
        "fruitful",
        "use",
        "abstract",
        "idealized",
        "model",
        "aristotelian",
        "poznań",
        "group",
        "regard",
        "idealization",
        "secret",
        "modern",
        "science",
        "find",
        "remarkable",
        "virtually",
        "previous",
        "analytic",
        "philosophy",
        "science",
        "remains",
        "aristotelian",
        "treating",
        "proposed",
        "law",
        "theory",
        "ideal",
        "model",
        "true",
        "false",
        "statement",
        "directly",
        "real",
        "world",
        "nowak",
        "later",
        "writing",
        "see",
        "also",
        "krajewsky",
        "model",
        "construction",
        "must",
        "concretized",
        "degree",
        "applied",
        "real",
        "world",
        "idealizationists",
        "tend",
        "reject",
        "kuhnian",
        "revolution",
        "discontinuous",
        "irrational",
        "see",
        "resemblance",
        "internalistic",
        "dialectical",
        "conception",
        "scientific",
        "development",
        "revolution",
        "consists",
        "new",
        "theory",
        "model",
        "reveals",
        "previously",
        "unnoticed",
        "idealizing",
        "assumption",
        "built",
        "predecessor",
        "change",
        "alters",
        "scientist",
        "conception",
        "essential",
        "versus",
        "peripheral",
        "domain",
        "phenomenon",
        "question",
        "hence",
        "significant",
        "change",
        "worldconception",
        "affiliation",
        "poznań",
        "european",
        "structuralist",
        "account",
        "theory",
        "based",
        "settheoretical",
        "analysis",
        "theory",
        "structure",
        "theory",
        "relation",
        "kuhn",
        "much",
        "attracted",
        "joseph",
        "sneed",
        "approach",
        "sneed",
        "soon",
        "extended",
        "wolfgang",
        "stegmüller",
        "others",
        "given",
        "informality",
        "kuhn",
        "approach",
        "explicit",
        "shunning",
        "rule",
        "rational",
        "reconstruction",
        "attraction",
        "structuralist",
        "line",
        "initially",
        "puzzling",
        "however",
        "structuralists",
        "interested",
        "intertheory",
        "relation",
        "model",
        "central",
        "nonsentential",
        "conception",
        "theory",
        "model",
        "formal",
        "sense",
        "kuhn",
        "found",
        "insightful",
        "connection",
        "use",
        "model",
        "form",
        "exemplar",
        "kuhn",
        "structuralists",
        "collection",
        "exemplar",
        "model",
        "abstract",
        "statement",
        "theory",
        "carry",
        "weight",
        "scientific",
        "inquiry",
        "already",
        "early",
        "kuhn",
        "especially",
        "postscript",
        "second",
        "edition",
        "structure",
        "largely",
        "abandoned",
        "traditional",
        "conception",
        "theory",
        "deductive",
        "system",
        "even",
        "physic",
        "substituted",
        "informal",
        "collection",
        "model",
        "various",
        "exemplary",
        "kind",
        "along",
        "toolbox",
        "expert",
        "practice",
        "constructing",
        "applying",
        "cartwright",
        "giere",
        "teller",
        "always",
        "liked",
        "margaret",
        "masterson",
        "remark",
        "paradigm",
        "sense",
        "preferred",
        "model",
        "exemplar",
        "use",
        "theory",
        "baltas",
        "et",
        "al",
        "view",
        "like",
        "nowak",
        "anticipates",
        "move",
        "theorycentered",
        "modelcentered",
        "account",
        "scientific",
        "work",
        "however",
        "kuhn",
        "normal",
        "scientific",
        "practitioner",
        "presumably",
        "hold",
        "model",
        "true",
        "original",
        "application",
        "grand",
        "theory",
        "incorporated",
        "paradigm",
        "whereas",
        "today",
        "emphasis",
        "modeling",
        "practice",
        "across",
        "science",
        "model",
        "almost",
        "always",
        "known",
        "advance",
        "false",
        "employment",
        "idealization",
        "approximation",
        "abstraction",
        "etc"
    ]
}