{
    "main_text": "Theory and value ladenness || Values\n3.4 Values\n\nOne could worry that the intertwining of the theoretical and empirical\nwould open the floodgates to bias in science. Human cognizing, both\nhistorical and present day, is replete with disturbing commitments\nincluding intolerance and narrow mindedness of many sorts. If such\ncommitments are integral to a theoretical framework, or endemic to the\nreasoning of a scientist or scientific community, then they threaten\nto corrupt the epistemic utility of empirical results generated using\ntheir resources. The core impetus of the ‘value-free\nideal’ is to maintain a safe distance between the appraisal of\nscientific theories according to the evidence on one hand, and the\nswarm of moral, political, social, and economic values on the other.\nWhile proponents of the value-free ideal might admit that the\nmotivation to pursue a theory or the legal protection of human\nsubjects in permissible experimental methods involve non-epistemic\nvalues, they would contend that such values ought not ought not enter\ninto the constitution of empirical results themselves, nor the\nadjudication or justification of scientific theorizing in light of the\nevidence (see Intemann 2021, 202).\n\nAs a matter of fact, values do enter into science at a variety of\nstages. Above we saw that ‘theory-ladenness’ could refer\nto the involvement of theory in perception, in semantics, and in a\nkind of circularity that some have worried begets unfalsifiability and\nthereby dogmatism. Like theory-ladenness, values can and sometimes do\naffect judgments about the salience of certain evidence and the\nconceptual framing of data. Indeed, on a permissive construal of the\nnature of theories, values can simply be understood as part of a\ntheoretical framework. Intemann (2021) highlights a striking example\nfrom medical research where key conceptual resources include notions\nlike ‘harm,’ ‘risk,’ ‘health\nbenefit,’ and ‘safety.’ She refers to research on\nthe comparative safety of giving birth at home and giving birth at a\nhospital for low-risk parents in the United States. Studies reporting\nthat home births are less safe typically attend to infant and birthing\nparent mortality rates—which are low for these\nsubjects whether at home or in hospital—but leave\nout of consideration rates of c-section and episiotomy, which are both\nrelatively high in hospital settings. Thus, a value-laden decision\nabout whether a possible outcome counts as a harm worth considering\ncan influence the outcome of the study—in this case\ntipping the balance towards the conclusion that hospital births are\nmore safe (ibid., 206).\n\nNote that the birth safety case differs from the sort of cases at\nissue in the philosophical debate about risk and thresholds for\nacceptance and rejection of hypotheses. In accepting an hypothesis, a\nperson makes a judgement that the risk of being mistaken is\nsufficiently low (Rudner 1953). When the consequences of being wrong\nare deemed grave, the threshold for acceptance may be correspondingly\nhigh. Thus, in evaluating the epistemic status of an hypothesis in\nlight of the evidence, a person may have to make a value-based\njudgement. However, in the birth safety case, the judgement comes into\nplay at an earlier stage, well before the decision to accept or reject\nthe hypothesis is to be made. The judgement occurs already in deciding\nwhat is to count as a ‘harm’ worth considering for the\npurposes of this research.\n\nThe fact that values do sometimes enter into scientific reasoning does\nnot by itself settle the question of whether it would be better if\nthey did not. In order to assess the normative proposal, philosophers\nof science have attempted to disambiguate the various ways in which\nvalues might be thought to enter into science, and the various\nreferents that get crammed under the single heading of\n‘values.’ Anderson (2004) articulates eight stages of\nscientific research where values (‘evaluative\npresuppositions’) might be employed in epistemically fruitful\nways. In paraphrase: 1) orientation in a field, 2) framing a research\nquestion, 3) conceptualizing the target, 4) identifying relevant data,\n5) data generation, 6) data analysis, 7) deciding when to cease data\nanalysis, and 8) drawing conclusions (Anderson 2004, 11). Similarly,\nIntemann (2021) lays out five ways “that values play a role in\nscientific reasoning” with which feminist philosophers of\nscience have engaged in particular:\n\n(1) the framing [of] research problems, (2) observing phenomena and\ndescribing data, (3) reasoning about value-laden concepts and\nassessing risks, (4) adopting particular models, and (5) collecting\nand interpreting evidence. (208)\n\n\nWard (2021) presents a streamlined and general taxonomy of four\nways in which values relate to choices: as reasons motivating or\njustifying choices, as causal effectors of choices, or as goods\naffected by choices. By investigating the role of values in these\nparticular stages or aspects of research, philosophers of science can\noffer higher resolution insights than just the observation that values\nare involved in science at all and untangle crosstalk.\n\nSimilarly, fine points can be made about the nature of values involved\nin these various contexts. Such clarification is likely important for\ndetermining whether the contribution of certain values in a given\ncontext is deleterious or salutary, and in what sense. Douglas (2013)\nargues that the ‘value’ of internal consistency of a\ntheory and of the empirical adequacy of a theory with respect to the\navailable evidence are minimal criteria for any viable scientific\ntheory (799–800). She contrasts these with the sort of values that\nKuhn called ‘virtues,’ i.e. scope, simplicity, and\nexplanatory power that are properties of theories themselves, and\nunification, novel prediction and precision, which are properties a\ntheory has in relation to a body of evidence (800–801). These are the\nsort of values that may be relevant to explaining and justifying\nchoices that scientists make to pursue/abandon or accept/reject\nparticular theories. Moreover, Douglas (2000) argues that what she\ncalls “non-epistemic values” (in particular, ethical value\njudgements) also enter into decisions at various stages\n“internal” to scientific reasoning, such as data\ncollection and interpretation (565). Consider a laboratory toxicology\nstudy in which animals exposed to dioxins are compared to unexposed\ncontrols. Douglas discusses researchers who want to determine the\nthreshold for safe exposure. Admitting false positives can be expected\nto lead to overregulation of the chemical industry, while false\nnegatives yield underregulation and thus pose greater risk to public\nhealth. The decision about where to set the unsafe exposure threshold,\nthat is, set the threshold for a statistically significant difference\nbetween experimental and control animal populations, involves\nbalancing the acceptability of these two types of errors. According to\nDouglas, this balancing act will depend on “whether we are more\nconcerned about protecting public health from dioxin pollution or\nwhether we are more concerned about protecting industries that produce\ndioxins from increased regulation” (ibid., 568). That scientists\ndo as a matter of fact sometimes make such decisions is clear. They\njudge, for instance, a specimen slide of a rat liver to be tumorous or\nnot, and whether borderline cases should count as benign or malignant\n(ibid., 569–572). Moreover, in such cases, it is not clear that the\nresponsibility of making such decisions could be offloaded to\nnon-scientists.\n\nMany philosophers accept that values can contribute to the generation\nof empirical results without spoiling their epistemic utility.\nAnderson’s (2004) diagnosis is as follows:\n\nDeep down, what the objectors find worrisome about allowing value\njudgments to guide scientific inquiry is not that they have evaluative\ncontent, but that these judgments might be held dogmatically, so as to\npreclude the recognition of evidence that might undermine them. We\nneed to ensure that value judgements do not operate to drive inquiry\nto a predetermined conclusion. This is our fundamental criterion for\ndistinguishing legitimate from illegitimate uses of values in science.\n(11)\n\n\nData production (including experimental design and execution) is\nheavily influenced by investigators’ background assumptions.\nSometimes these include theoretical commitments that lead\nexperimentalists to produce non-illuminating or misleading evidence.\nIn other cases they may lead experimentalists to ignore, or even fail\nto produce useful evidence. For example, in order to obtain data on\norgasms in female stumptail macaques, one researcher wired up females\nto produce radio records of orgasmic muscle contractions, heart rate\nincreases, etc. But as Elisabeth Lloyd reports, “… the\nresearcher … wired up the heart rate of the male macaques as\nthe signal to start recording the female orgasms. When I pointed out\nthat the vast majority of female stumptail orgasms occurred during sex\namong the females alone, he replied that yes he knew that, but he was\nonly interested in important orgasms” (Lloyd 1993, 142).\nAlthough female stumptail orgasms occurring during sex with males are\natypical, the experimental design was driven by the assumption that\nwhat makes features of female sexuality worth studying is their\ncontribution to reproduction (ibid., 139). This assumption influenced\nexperimental design in such a way as to preclude learning about the\nfull range of female stumptail orgasms.\n\nAnderson (2004) presents an influential analysis of the role of values\nin research on divorce. Researchers committed to an interpretive\nframework rooted in ‘traditional family values’ could\nconduct research on the assumption that divorce is mostly bad for\nspouses and any children that they have (ibid., 12). This background\nassumption, which is rooted in a normative appraisal of a certain\nmodel of good family life, could lead social science researchers to\nrestrict the questions with which they survey their research subjects\nto ones about the negative impacts of divorce on their lives, thereby\ncurtailing the possibility of discovering ways that divorce may have\nactually made the ex-spouses lives better (ibid., 13). This is an\nexample of the influence that values can have on the nature of the\nresults that research ultimately yields, which is epistemically\ndetrimental. In this case, the values in play biased the research\noutcomes to preclude recognition of countervailing evidence. Anderson\nargues that the problematic influence of values comes when research\n“is rigged in advance” to confirm certain\nhypotheses—when the influence of values amounts to incorrigible\ndogmatism (ibid., 19). “Dogmatism” in her sense is\nunfalsifiability in practice, “their stubbornness in the face of\nany conceivable evidence”(ibid., 22).\n\nFortunately, such dogmatism is not ubiquitous and when it occurs it\ncan often be corrected eventually. Above we noted that the mere\ninvolvement of the theory to be tested in the generation of an\nempirical result does not automatically yield vicious\ncircularity—it depends on how the theory is\ninvolved. Furthermore, even if the assumptions initially made in the\ngeneration of empirical results are incorrect, future scientists will\nhave opportunities to reassess those assumptions in light of new\ninformation and techniques. Thus, as long as scientists continue their\nwork there need be no time at which the epistemic value of an\nempirical result can be established once and for all. This should come\nas no surprise to anyone who is aware that science is fallible, but it\nis no grounds for skepticism. It can be perfectly reasonable to trust\nthe evidence available at present even though it is logically possible\nfor epistemic troubles to arise in the future. A similar point can be\nmade regarding values (although cf. Yap 2016).\n\nMoreover, while the inclusion of values in the generation of an\nempirical result can sometimes be epistemically bad, values properly\ndeployed can also be harmless, or even epistemically helpful. As in\nthe cases of research on female stumptail macaque orgasms and the\neffects of divorce, certain values can sometimes serve to illuminate\nthe way in which other epistemically problematic assumptions have\nhindered potential scientific insight. By valuing knowledge about\nfemale sexuality beyond its role in reproduction, scientists can\nrecognize the narrowness of an approach that only conceives of female\nsexuality insofar as it relates to reproduction. By questioning the\nabsolute value of one traditional ideal for flourishing families,\nresearchers can garner evidence that might end up destabilizing the\nempirical foundation supporting that ideal.\n",
    "section_title": "3.4 Values",
    "entry_title": "Theory and Observation in Science",
    "hierarchy_title": "Theory and Observation in Science || Theory and value ladenness || Values",
    "tokenized_text": [
        "theory",
        "value",
        "ladenness",
        "value",
        "value",
        "one",
        "could",
        "worry",
        "intertwining",
        "theoretical",
        "empirical",
        "would",
        "open",
        "floodgate",
        "bias",
        "science",
        "human",
        "cognizing",
        "historical",
        "present",
        "day",
        "replete",
        "disturbing",
        "commitment",
        "including",
        "intolerance",
        "narrow",
        "mindedness",
        "many",
        "sort",
        "commitment",
        "integral",
        "theoretical",
        "framework",
        "endemic",
        "reasoning",
        "scientist",
        "scientific",
        "community",
        "threaten",
        "corrupt",
        "epistemic",
        "utility",
        "empirical",
        "result",
        "generated",
        "using",
        "resource",
        "core",
        "impetus",
        "valuefree",
        "ideal",
        "maintain",
        "safe",
        "distance",
        "appraisal",
        "scientific",
        "theory",
        "according",
        "evidence",
        "one",
        "hand",
        "swarm",
        "moral",
        "political",
        "social",
        "economic",
        "value",
        "proponent",
        "valuefree",
        "ideal",
        "might",
        "admit",
        "motivation",
        "pursue",
        "theory",
        "legal",
        "protection",
        "human",
        "subject",
        "permissible",
        "experimental",
        "method",
        "involve",
        "nonepistemic",
        "value",
        "would",
        "contend",
        "value",
        "ought",
        "ought",
        "enter",
        "constitution",
        "empirical",
        "result",
        "adjudication",
        "justification",
        "scientific",
        "theorizing",
        "light",
        "evidence",
        "see",
        "intemann",
        "matter",
        "fact",
        "value",
        "enter",
        "science",
        "variety",
        "stage",
        "saw",
        "theoryladenness",
        "could",
        "refer",
        "involvement",
        "theory",
        "perception",
        "semantics",
        "kind",
        "circularity",
        "worried",
        "begets",
        "unfalsifiability",
        "thereby",
        "dogmatism",
        "like",
        "theoryladenness",
        "value",
        "sometimes",
        "affect",
        "judgment",
        "salience",
        "certain",
        "evidence",
        "conceptual",
        "framing",
        "data",
        "indeed",
        "permissive",
        "construal",
        "nature",
        "theory",
        "value",
        "simply",
        "understood",
        "part",
        "theoretical",
        "framework",
        "intemann",
        "highlight",
        "striking",
        "example",
        "medical",
        "research",
        "key",
        "conceptual",
        "resource",
        "include",
        "notion",
        "like",
        "harm",
        "risk",
        "health",
        "benefit",
        "safety",
        "refers",
        "research",
        "comparative",
        "safety",
        "giving",
        "birth",
        "home",
        "giving",
        "birth",
        "hospital",
        "lowrisk",
        "parent",
        "united",
        "state",
        "study",
        "reporting",
        "home",
        "birth",
        "le",
        "safe",
        "typically",
        "attend",
        "infant",
        "birthing",
        "parent",
        "mortality",
        "rateswhich",
        "low",
        "subject",
        "whether",
        "home",
        "hospitalbut",
        "leave",
        "consideration",
        "rate",
        "csection",
        "episiotomy",
        "relatively",
        "high",
        "hospital",
        "setting",
        "thus",
        "valueladen",
        "decision",
        "whether",
        "possible",
        "outcome",
        "count",
        "harm",
        "worth",
        "considering",
        "influence",
        "outcome",
        "studyin",
        "case",
        "tipping",
        "balance",
        "towards",
        "conclusion",
        "hospital",
        "birth",
        "safe",
        "ibid",
        "note",
        "birth",
        "safety",
        "case",
        "differs",
        "sort",
        "case",
        "issue",
        "philosophical",
        "debate",
        "risk",
        "threshold",
        "acceptance",
        "rejection",
        "hypothesis",
        "accepting",
        "hypothesis",
        "person",
        "make",
        "judgement",
        "risk",
        "mistaken",
        "sufficiently",
        "low",
        "rudner",
        "consequence",
        "wrong",
        "deemed",
        "grave",
        "threshold",
        "acceptance",
        "may",
        "correspondingly",
        "high",
        "thus",
        "evaluating",
        "epistemic",
        "status",
        "hypothesis",
        "light",
        "evidence",
        "person",
        "may",
        "make",
        "valuebased",
        "judgement",
        "however",
        "birth",
        "safety",
        "case",
        "judgement",
        "come",
        "play",
        "earlier",
        "stage",
        "well",
        "decision",
        "accept",
        "reject",
        "hypothesis",
        "made",
        "judgement",
        "occurs",
        "already",
        "deciding",
        "count",
        "harm",
        "worth",
        "considering",
        "purpose",
        "research",
        "fact",
        "value",
        "sometimes",
        "enter",
        "scientific",
        "reasoning",
        "settle",
        "question",
        "whether",
        "would",
        "better",
        "order",
        "ass",
        "normative",
        "proposal",
        "philosopher",
        "science",
        "attempted",
        "disambiguate",
        "various",
        "way",
        "value",
        "might",
        "thought",
        "enter",
        "science",
        "various",
        "referent",
        "get",
        "crammed",
        "single",
        "heading",
        "values",
        "anderson",
        "articulates",
        "eight",
        "stage",
        "scientific",
        "research",
        "value",
        "evaluative",
        "presupposition",
        "might",
        "employed",
        "epistemically",
        "fruitful",
        "way",
        "paraphrase",
        "orientation",
        "field",
        "framing",
        "research",
        "question",
        "conceptualizing",
        "target",
        "identifying",
        "relevant",
        "data",
        "data",
        "generation",
        "data",
        "analysis",
        "deciding",
        "cease",
        "data",
        "analysis",
        "drawing",
        "conclusion",
        "anderson",
        "similarly",
        "intemann",
        "lay",
        "five",
        "way",
        "value",
        "play",
        "role",
        "scientific",
        "reasoning",
        "feminist",
        "philosopher",
        "science",
        "engaged",
        "particular",
        "framing",
        "research",
        "problem",
        "observing",
        "phenomenon",
        "describing",
        "data",
        "reasoning",
        "valueladen",
        "concept",
        "assessing",
        "risk",
        "adopting",
        "particular",
        "model",
        "collecting",
        "interpreting",
        "evidence",
        "ward",
        "present",
        "streamlined",
        "general",
        "taxonomy",
        "four",
        "way",
        "value",
        "relate",
        "choice",
        "reason",
        "motivating",
        "justifying",
        "choice",
        "causal",
        "effector",
        "choice",
        "good",
        "affected",
        "choice",
        "investigating",
        "role",
        "value",
        "particular",
        "stage",
        "aspect",
        "research",
        "philosopher",
        "science",
        "offer",
        "higher",
        "resolution",
        "insight",
        "observation",
        "value",
        "involved",
        "science",
        "untangle",
        "crosstalk",
        "similarly",
        "fine",
        "point",
        "made",
        "nature",
        "value",
        "involved",
        "various",
        "context",
        "clarification",
        "likely",
        "important",
        "determining",
        "whether",
        "contribution",
        "certain",
        "value",
        "given",
        "context",
        "deleterious",
        "salutary",
        "sense",
        "douglas",
        "argues",
        "value",
        "internal",
        "consistency",
        "theory",
        "empirical",
        "adequacy",
        "theory",
        "respect",
        "available",
        "evidence",
        "minimal",
        "criterion",
        "viable",
        "scientific",
        "theory",
        "contrast",
        "sort",
        "value",
        "kuhn",
        "called",
        "virtue",
        "ie",
        "scope",
        "simplicity",
        "explanatory",
        "power",
        "property",
        "theory",
        "unification",
        "novel",
        "prediction",
        "precision",
        "property",
        "theory",
        "relation",
        "body",
        "evidence",
        "sort",
        "value",
        "may",
        "relevant",
        "explaining",
        "justifying",
        "choice",
        "scientist",
        "make",
        "pursueabandon",
        "acceptreject",
        "particular",
        "theory",
        "moreover",
        "douglas",
        "argues",
        "call",
        "nonepistemic",
        "value",
        "particular",
        "ethical",
        "value",
        "judgement",
        "also",
        "enter",
        "decision",
        "various",
        "stage",
        "internal",
        "scientific",
        "reasoning",
        "data",
        "collection",
        "interpretation",
        "consider",
        "laboratory",
        "toxicology",
        "study",
        "animal",
        "exposed",
        "dioxin",
        "compared",
        "unexposed",
        "control",
        "douglas",
        "discus",
        "researcher",
        "want",
        "determine",
        "threshold",
        "safe",
        "exposure",
        "admitting",
        "false",
        "positive",
        "expected",
        "lead",
        "overregulation",
        "chemical",
        "industry",
        "false",
        "negative",
        "yield",
        "underregulation",
        "thus",
        "pose",
        "greater",
        "risk",
        "public",
        "health",
        "decision",
        "set",
        "unsafe",
        "exposure",
        "threshold",
        "set",
        "threshold",
        "statistically",
        "significant",
        "difference",
        "experimental",
        "control",
        "animal",
        "population",
        "involves",
        "balancing",
        "acceptability",
        "two",
        "type",
        "error",
        "according",
        "douglas",
        "balancing",
        "act",
        "depend",
        "whether",
        "concerned",
        "protecting",
        "public",
        "health",
        "dioxin",
        "pollution",
        "whether",
        "concerned",
        "protecting",
        "industry",
        "produce",
        "dioxin",
        "increased",
        "regulation",
        "ibid",
        "scientist",
        "matter",
        "fact",
        "sometimes",
        "make",
        "decision",
        "clear",
        "judge",
        "instance",
        "specimen",
        "slide",
        "rat",
        "liver",
        "tumorous",
        "whether",
        "borderline",
        "case",
        "count",
        "benign",
        "malignant",
        "ibid",
        "moreover",
        "case",
        "clear",
        "responsibility",
        "making",
        "decision",
        "could",
        "offloaded",
        "nonscientists",
        "many",
        "philosopher",
        "accept",
        "value",
        "contribute",
        "generation",
        "empirical",
        "result",
        "without",
        "spoiling",
        "epistemic",
        "utility",
        "anderson",
        "diagnosis",
        "follows",
        "deep",
        "objector",
        "find",
        "worrisome",
        "allowing",
        "value",
        "judgment",
        "guide",
        "scientific",
        "inquiry",
        "evaluative",
        "content",
        "judgment",
        "might",
        "held",
        "dogmatically",
        "preclude",
        "recognition",
        "evidence",
        "might",
        "undermine",
        "need",
        "ensure",
        "value",
        "judgement",
        "operate",
        "drive",
        "inquiry",
        "predetermined",
        "conclusion",
        "fundamental",
        "criterion",
        "distinguishing",
        "legitimate",
        "illegitimate",
        "us",
        "value",
        "science",
        "data",
        "production",
        "including",
        "experimental",
        "design",
        "execution",
        "heavily",
        "influenced",
        "investigator",
        "background",
        "assumption",
        "sometimes",
        "include",
        "theoretical",
        "commitment",
        "lead",
        "experimentalists",
        "produce",
        "nonilluminating",
        "misleading",
        "evidence",
        "case",
        "may",
        "lead",
        "experimentalists",
        "ignore",
        "even",
        "fail",
        "produce",
        "useful",
        "evidence",
        "example",
        "order",
        "obtain",
        "data",
        "orgasm",
        "female",
        "stumptail",
        "macaque",
        "one",
        "researcher",
        "wired",
        "female",
        "produce",
        "radio",
        "record",
        "orgasmic",
        "muscle",
        "contraction",
        "heart",
        "rate",
        "increase",
        "etc",
        "elisabeth",
        "lloyd",
        "report",
        "researcher",
        "wired",
        "heart",
        "rate",
        "male",
        "macaque",
        "signal",
        "start",
        "recording",
        "female",
        "orgasm",
        "pointed",
        "vast",
        "majority",
        "female",
        "stumptail",
        "orgasm",
        "occurred",
        "sex",
        "among",
        "female",
        "alone",
        "replied",
        "yes",
        "knew",
        "interested",
        "important",
        "orgasm",
        "lloyd",
        "although",
        "female",
        "stumptail",
        "orgasm",
        "occurring",
        "sex",
        "male",
        "atypical",
        "experimental",
        "design",
        "driven",
        "assumption",
        "make",
        "feature",
        "female",
        "sexuality",
        "worth",
        "studying",
        "contribution",
        "reproduction",
        "ibid",
        "assumption",
        "influenced",
        "experimental",
        "design",
        "way",
        "preclude",
        "learning",
        "full",
        "range",
        "female",
        "stumptail",
        "orgasm",
        "anderson",
        "present",
        "influential",
        "analysis",
        "role",
        "value",
        "research",
        "divorce",
        "researcher",
        "committed",
        "interpretive",
        "framework",
        "rooted",
        "traditional",
        "family",
        "value",
        "could",
        "conduct",
        "research",
        "assumption",
        "divorce",
        "mostly",
        "bad",
        "spouse",
        "child",
        "ibid",
        "background",
        "assumption",
        "rooted",
        "normative",
        "appraisal",
        "certain",
        "model",
        "good",
        "family",
        "life",
        "could",
        "lead",
        "social",
        "science",
        "researcher",
        "restrict",
        "question",
        "survey",
        "research",
        "subject",
        "one",
        "negative",
        "impact",
        "divorce",
        "life",
        "thereby",
        "curtailing",
        "possibility",
        "discovering",
        "way",
        "divorce",
        "may",
        "actually",
        "made",
        "exspouse",
        "life",
        "better",
        "ibid",
        "example",
        "influence",
        "value",
        "nature",
        "result",
        "research",
        "ultimately",
        "yield",
        "epistemically",
        "detrimental",
        "case",
        "value",
        "play",
        "biased",
        "research",
        "outcome",
        "preclude",
        "recognition",
        "countervailing",
        "evidence",
        "anderson",
        "argues",
        "problematic",
        "influence",
        "value",
        "come",
        "research",
        "rigged",
        "advance",
        "confirm",
        "certain",
        "hypotheseswhen",
        "influence",
        "value",
        "amount",
        "incorrigible",
        "dogmatism",
        "ibid",
        "dogmatism",
        "sense",
        "unfalsifiability",
        "practice",
        "stubbornness",
        "face",
        "conceivable",
        "evidence",
        "ibid",
        "fortunately",
        "dogmatism",
        "ubiquitous",
        "occurs",
        "often",
        "corrected",
        "eventually",
        "noted",
        "mere",
        "involvement",
        "theory",
        "tested",
        "generation",
        "empirical",
        "result",
        "automatically",
        "yield",
        "vicious",
        "circularityit",
        "depends",
        "theory",
        "involved",
        "furthermore",
        "even",
        "assumption",
        "initially",
        "made",
        "generation",
        "empirical",
        "result",
        "incorrect",
        "future",
        "scientist",
        "opportunity",
        "reassess",
        "assumption",
        "light",
        "new",
        "information",
        "technique",
        "thus",
        "long",
        "scientist",
        "continue",
        "work",
        "need",
        "time",
        "epistemic",
        "value",
        "empirical",
        "result",
        "established",
        "come",
        "surprise",
        "anyone",
        "aware",
        "science",
        "fallible",
        "ground",
        "skepticism",
        "perfectly",
        "reasonable",
        "trust",
        "evidence",
        "available",
        "present",
        "even",
        "though",
        "logically",
        "possible",
        "epistemic",
        "trouble",
        "arise",
        "future",
        "similar",
        "point",
        "made",
        "regarding",
        "value",
        "although",
        "cf",
        "yap",
        "moreover",
        "inclusion",
        "value",
        "generation",
        "empirical",
        "result",
        "sometimes",
        "epistemically",
        "bad",
        "value",
        "properly",
        "deployed",
        "also",
        "harmless",
        "even",
        "epistemically",
        "helpful",
        "case",
        "research",
        "female",
        "stumptail",
        "macaque",
        "orgasm",
        "effect",
        "divorce",
        "certain",
        "value",
        "sometimes",
        "serve",
        "illuminate",
        "way",
        "epistemically",
        "problematic",
        "assumption",
        "hindered",
        "potential",
        "scientific",
        "insight",
        "valuing",
        "knowledge",
        "female",
        "sexuality",
        "beyond",
        "role",
        "reproduction",
        "scientist",
        "recognize",
        "narrowness",
        "approach",
        "conceives",
        "female",
        "sexuality",
        "insofar",
        "relates",
        "reproduction",
        "questioning",
        "absolute",
        "value",
        "one",
        "traditional",
        "ideal",
        "flourishing",
        "family",
        "researcher",
        "garner",
        "evidence",
        "might",
        "end",
        "destabilizing",
        "empirical",
        "foundation",
        "supporting",
        "ideal"
    ]
}