{
    "main_text": "James Frederick Ferrier (1808–1864)\n4. James Frederick Ferrier (1808–1864)\n\nThough the expression “Scottish philosophy” came to be\never more widely used in the second half of the 19th century, its\nfirst appearance was in the title of a privately printed pamphlet by\nJ.F. Ferrier—Scottish Philosophy, the Old and the New\n(1854). Ferrier chose this title because his pamphlet was expressly\nwritten in defence of the contention that it is possible to engage in\nsomething called “Scottish philosophy” while departing\nradically from the tenets of Reid, Stewart and so on. Ferrier writes\nwith great force and feeling.\n\nIt has been asserted, that my philosophy is of Germanic origin and\ncomplexion. A broader fabrication than that never dropped from human\nlips or dribbled from the point of a pen. My philosophy is Scottish to\nthe very core; it is national in every fibre and articulation of its\nframe. It is a natural growth of old Scotland's soil and has drunk in\nno nourishment from any other land. Are we to judge the productions of\nScotland by merely looking to what Scotland has hitherto produced? May\na philosopher not be, heart and soul, a Scotsman—may he not be a\nScotsman in all his intellectual movements, even though he should have\nthe misfortune to differ in certain respects, from Dr Reid and Sir\nWilliam Hamilton (Ferrier 1854, 12)\n\n\nThe explanation of the feeling with which Ferrier writes lies in the\nfact his little book is a response to the charge levelled against him\nin the contest for Hamilton's Chair of Logic and Metaphysics at\nEdinburgh (then still in the gift of the Town Council), when he was\naccused by the Free Church party of departing from “the Scottish\nphilosophy” in favour of some sort of Hegelianism. This charge\nwas almost certainly motivated by the ecclesiastical rivalries\ngenerated by the Disruption in the Church of Scotland that took place\nin 1843, but it is nonetheless true that Ferrier expressly denounces a\ncertain conception of “Common Sense” philosophy, and one\nwhich he identifies closely with Reid. Indeed he is not afraid to\nrepeat his objections in his defence of himself.\n\nSuppose we are discussing the subject of salt, and that we say\n“salt is white and gritty, it is in some degree moist, it is\nsometimes put into a salt cellar and placed on the dinner\ntable…”…No man would be considered much of a\nchemist, who was merely acquainted with these and other such\ncircumstances, concerning salt.…So, in philosophy, no man can\nbe called a philosopher who merely knows and says, that he and other\npeople exist, that there is an external world, that a man is the same\nto day as he was yesterday, and so forth. These are undoubtedly\ntruths, but I maintain that they are not truths in philosophy, any\nmore than those just mentioned are truths in chemistry. Our old\nScottish school, however, is of a different way of thinking. It\nrepresents these and similar facts as the first truths of philosophy,\nand to these it has recourse in handling the deeper questions of\nmetaphysics. I have no objections to this, for those who like\nit—only my system deals with first truths of a very different\norder; and it denies that the first truths of the old Scottish school\nare truths in philosophy at all. This is one very fundamental point of\ndifference between the old and the new Scottish system of metaphysics\n(ibid., 7)\n\n\nIt is important to note that Ferrier thinks this castigation of one\nversion of “Common Sense” philosophy is quite compatible\nwith claiming the right to be the inheritor of, though not restricted\nby, the programme of Reid and Hamilton. And there are indeed several\npoints of contact to be observed. The first is this. Ferrier shares\nwith Hamilton a largely unspoken assumption that the question of mind\nand world lies at the heart of philosophy. This assumption signalled a\nmove away from the much broader conception of moral philosophy as both\npsychological and social inquiry, which as we have already\nnoted, is characteristic of Ferguson, Hume, Adam Smith, and even Reid\nin part. Second, and more importantly perhaps, Ferrier's own\nphilosophical reflections continue to fit Davie's description of\nScottish philosophy as a “dialogue between the vulgar and the\nlearned”.\n\nFerrier's reputation rested upon an earlier series of essays on\nThe Philosophy of Consciousness which appeared in Blackwood's\nMagazine between 1838 and 1843. In these essays he took his stand on\nthe contention that consciousness implies the impossibility of a\nnaturalistic science of mind, and in a later essay robustly defends a\nversion of Berkeleyan idealism. While Reid thought that Berkeley's\nphilosophical position was one that “no man in his senses could\nbelieve”, somewhat surprisingly perhaps, Ferrier describes\nBerkeley as “the champion of common sense…who could have\nfoiled the prince of skeptics at his own weapons” (Ferrier 1865,\n301). “Among all philosophers ancient or modern, we are\nacquainted with none who presents fewer vulnerable points that Bishop\nBerkeley. His language it is true, has sometimes the appearance of\nparadox; but there is nothing paradoxical in his thoughts, and time\nhas proved the adamantine solidity of his principles.”\n(ibid. p. 291) By Ferrier's account, Berkeley settles the\nissue of sensation and perception with which Hamilton struggled, by\nseeing that there is a false abstraction here.\n\nThe external world in itself, and the external world in\nrelation to us, was a philosophic distinction which he\n[Berkeley] refused to recognize. In his creed, the substantive and\nphenomenal were one. And though he has been accused of sacrificing the\nsubstance to the shadow, and though he still continues to be charged,\nby every philosophical writer, with reducing all things to ideas in\nthe mind, he was guilty of no such absurdity…There does not\nappear to be much justice in the ordinary allegation, that Berkeley\ndiscredited the testimony of the senses, and denied the existence of\nthe material universe. He merely denied the distinction between things\nand their appearances, and maintained that the thing was the\nappearance and the appearance was the thing. (ibid.,\n302–3 emphasis original)\n\n\nOn this interpretation Berkeley espouses a sort of idealism but\n\ngenuine idealism, looking only to the fact, and instructed by the\nunadulterated dictates of common sense, denies…that we can\nseparate in thought objects and perceptions at all; hence\nthis system has nothing whatever to do either with the preservation or\nthe destruction of the material universe; and hence, too, it is\nidentical…with genuine unperverted realism. (ibid., 309\nemphasis original)\n\n\nIn this way Ferrier, despite his disagreements, actually concurs with\nReid's strictures on the kind of philosophical theorizing that tries\nto deploy Newtonian methods in the way that Hume does. Indeed, Ferrier\nthinks that “the inert and lifeless character of modern\nphilosophy is ultimately attributable to her having degenerated into a\nphysical science” (ibid., 191), and he condemns the resulting\n“picture of man” as “a wretched association machine,\nthrough which ideas pass linked only by laws over which the machine\nhas no control” (ibid., 196). His alternative to this\nexternalist conception of “the science of mind” is a\nreturn to the introspective examination of human consciousness.\n“Consciousness is philosophy nascent; philosophy is\nconsciousness in full bloom and blow. The difference between them is\nonly one of degree, and not one of kind; and thus all conscious men\nare to a certain extent philosophers, although they may not know\nit” (ibid., 197) In short, the proper engagement of philosophy\nis a matter of bringing consciousness to a better understanding of\nitself, which is at least one interpretation of the ambition of Reid's\nInquiry.\n\nFerrier's philosophy, then, can be construed as both importantly\ndifferent to Reid's, and at the same time another exploration in the\ncommon sense tradition. For Reid, Berkeley is the principal architect\nof “the way of ideas”, and hence though not himself a\nskeptic, the purveyor of a philosophy that makes radical skepticism\ninevitable. In sharp contrast, for Ferrier, Berkeley's philosophy\n(with some additions of Ferrier's own) is the answer to\nskepticism. By rejecting the philosophers' invention of 'matter',\nBerkely means to affirm common sense. It hardly needs to be said that\nthis construction of Berkeley was a highly controversial position.\nMoreover, it throws the whole subject of mind and consciousness back\ninto the realms of metaphysical philosophy and hence seems to abandon\nthe shared methodological assumption that, to quote Reid again,\n“there is but one way to the knowledge of nature's works; the\nway of observation and experiment” a supposition he\nwholeheartedly shared with Hume. This implication—that the\nmethods of the sciences are inapplicable to philosophy—somewhat\nisolated Ferrier within Scottish philosophy. Though he was regarded\nwith great acclaim in continental Europe, Scottish philosophers moved\nin different directions, some to an intensification of the\nexperimental method, and some to Absolute Idealism. Of the first\ngroup, the most prominent and influential was Alexander Bain.\n",
    "section_title": "4. James Frederick Ferrier (1808–1864)",
    "entry_title": "Scottish Philosophy in the 19th Century",
    "hierarchy_title": "Scottish Philosophy in the 19th Century || James Frederick Ferrier (1808–1864)",
    "tokenized_text": [
        "james",
        "frederick",
        "ferrier",
        "james",
        "frederick",
        "ferrier",
        "though",
        "expression",
        "scottish",
        "philosophy",
        "came",
        "ever",
        "widely",
        "used",
        "second",
        "half",
        "th",
        "century",
        "first",
        "appearance",
        "title",
        "privately",
        "printed",
        "pamphlet",
        "jf",
        "ferrierscottish",
        "philosophy",
        "old",
        "new",
        "ferrier",
        "chose",
        "title",
        "pamphlet",
        "expressly",
        "written",
        "defence",
        "contention",
        "possible",
        "engage",
        "something",
        "called",
        "scottish",
        "philosophy",
        "departing",
        "radically",
        "tenet",
        "reid",
        "stewart",
        "ferrier",
        "writes",
        "great",
        "force",
        "feeling",
        "asserted",
        "philosophy",
        "germanic",
        "origin",
        "complexion",
        "broader",
        "fabrication",
        "never",
        "dropped",
        "human",
        "lip",
        "dribbled",
        "point",
        "pen",
        "philosophy",
        "scottish",
        "core",
        "national",
        "every",
        "fibre",
        "articulation",
        "frame",
        "natural",
        "growth",
        "old",
        "scotland",
        "s",
        "soil",
        "drunk",
        "nourishment",
        "land",
        "judge",
        "production",
        "scotland",
        "merely",
        "looking",
        "scotland",
        "hitherto",
        "produced",
        "may",
        "philosopher",
        "heart",
        "soul",
        "scotsmanmay",
        "scotsman",
        "intellectual",
        "movement",
        "even",
        "though",
        "misfortune",
        "differ",
        "certain",
        "respect",
        "dr",
        "reid",
        "sir",
        "william",
        "hamilton",
        "ferrier",
        "explanation",
        "feeling",
        "ferrier",
        "writes",
        "lie",
        "fact",
        "little",
        "book",
        "response",
        "charge",
        "levelled",
        "contest",
        "hamilton",
        "s",
        "chair",
        "logic",
        "metaphysics",
        "edinburgh",
        "still",
        "gift",
        "town",
        "council",
        "accused",
        "free",
        "church",
        "party",
        "departing",
        "scottish",
        "philosophy",
        "favour",
        "sort",
        "hegelianism",
        "charge",
        "almost",
        "certainly",
        "motivated",
        "ecclesiastical",
        "rivalry",
        "generated",
        "disruption",
        "church",
        "scotland",
        "took",
        "place",
        "nonetheless",
        "true",
        "ferrier",
        "expressly",
        "denounces",
        "certain",
        "conception",
        "common",
        "sense",
        "philosophy",
        "one",
        "identifies",
        "closely",
        "reid",
        "indeed",
        "afraid",
        "repeat",
        "objection",
        "defence",
        "suppose",
        "discussing",
        "subject",
        "salt",
        "say",
        "salt",
        "white",
        "gritty",
        "degree",
        "moist",
        "sometimes",
        "put",
        "salt",
        "cellar",
        "placed",
        "dinner",
        "table",
        "no",
        "man",
        "would",
        "considered",
        "much",
        "chemist",
        "merely",
        "acquainted",
        "circumstance",
        "concerning",
        "saltso",
        "philosophy",
        "man",
        "called",
        "philosopher",
        "merely",
        "know",
        "say",
        "people",
        "exist",
        "external",
        "world",
        "man",
        "day",
        "yesterday",
        "forth",
        "undoubtedly",
        "truth",
        "maintain",
        "truth",
        "philosophy",
        "mentioned",
        "truth",
        "chemistry",
        "old",
        "scottish",
        "school",
        "however",
        "different",
        "way",
        "thinking",
        "represents",
        "similar",
        "fact",
        "first",
        "truth",
        "philosophy",
        "recourse",
        "handling",
        "deeper",
        "question",
        "metaphysics",
        "objection",
        "like",
        "itonly",
        "system",
        "deal",
        "first",
        "truth",
        "different",
        "order",
        "denies",
        "first",
        "truth",
        "old",
        "scottish",
        "school",
        "truth",
        "philosophy",
        "one",
        "fundamental",
        "point",
        "difference",
        "old",
        "new",
        "scottish",
        "system",
        "metaphysics",
        "ibid",
        "important",
        "note",
        "ferrier",
        "think",
        "castigation",
        "one",
        "version",
        "common",
        "sense",
        "philosophy",
        "quite",
        "compatible",
        "claiming",
        "right",
        "inheritor",
        "though",
        "restricted",
        "programme",
        "reid",
        "hamilton",
        "indeed",
        "several",
        "point",
        "contact",
        "observed",
        "first",
        "ferrier",
        "share",
        "hamilton",
        "largely",
        "unspoken",
        "assumption",
        "question",
        "mind",
        "world",
        "lie",
        "heart",
        "philosophy",
        "assumption",
        "signalled",
        "move",
        "away",
        "much",
        "broader",
        "conception",
        "moral",
        "philosophy",
        "psychological",
        "social",
        "inquiry",
        "already",
        "noted",
        "characteristic",
        "ferguson",
        "hume",
        "adam",
        "smith",
        "even",
        "reid",
        "part",
        "second",
        "importantly",
        "perhaps",
        "ferrier",
        "s",
        "philosophical",
        "reflection",
        "continue",
        "fit",
        "davie",
        "s",
        "description",
        "scottish",
        "philosophy",
        "dialogue",
        "vulgar",
        "learned",
        "ferrier",
        "s",
        "reputation",
        "rested",
        "upon",
        "earlier",
        "series",
        "essay",
        "philosophy",
        "consciousness",
        "appeared",
        "blackwood",
        "s",
        "magazine",
        "essay",
        "took",
        "stand",
        "contention",
        "consciousness",
        "implies",
        "impossibility",
        "naturalistic",
        "science",
        "mind",
        "later",
        "essay",
        "robustly",
        "defends",
        "version",
        "berkeleyan",
        "idealism",
        "reid",
        "thought",
        "berkeley",
        "s",
        "philosophical",
        "position",
        "one",
        "man",
        "sens",
        "could",
        "believe",
        "somewhat",
        "surprisingly",
        "perhaps",
        "ferrier",
        "describes",
        "berkeley",
        "champion",
        "common",
        "sensewho",
        "could",
        "foiled",
        "prince",
        "skeptic",
        "weapon",
        "ferrier",
        "among",
        "philosopher",
        "ancient",
        "modern",
        "acquainted",
        "none",
        "present",
        "fewer",
        "vulnerable",
        "point",
        "bishop",
        "berkeley",
        "language",
        "true",
        "sometimes",
        "appearance",
        "paradox",
        "nothing",
        "paradoxical",
        "thought",
        "time",
        "proved",
        "adamantine",
        "solidity",
        "principles",
        "ibid",
        "p",
        "ferrier",
        "s",
        "account",
        "berkeley",
        "settle",
        "issue",
        "sensation",
        "perception",
        "hamilton",
        "struggled",
        "seeing",
        "false",
        "abstraction",
        "external",
        "world",
        "external",
        "world",
        "relation",
        "u",
        "philosophic",
        "distinction",
        "berkeley",
        "refused",
        "recognize",
        "creed",
        "substantive",
        "phenomenal",
        "one",
        "though",
        "accused",
        "sacrificing",
        "substance",
        "shadow",
        "though",
        "still",
        "continues",
        "charged",
        "every",
        "philosophical",
        "writer",
        "reducing",
        "thing",
        "idea",
        "mind",
        "guilty",
        "absurditythere",
        "appear",
        "much",
        "justice",
        "ordinary",
        "allegation",
        "berkeley",
        "discredited",
        "testimony",
        "sens",
        "denied",
        "existence",
        "material",
        "universe",
        "merely",
        "denied",
        "distinction",
        "thing",
        "appearance",
        "maintained",
        "thing",
        "appearance",
        "appearance",
        "thing",
        "ibid",
        "emphasis",
        "original",
        "interpretation",
        "berkeley",
        "espouses",
        "sort",
        "idealism",
        "genuine",
        "idealism",
        "looking",
        "fact",
        "instructed",
        "unadulterated",
        "dictate",
        "common",
        "sense",
        "deniesthat",
        "separate",
        "thought",
        "object",
        "perception",
        "hence",
        "system",
        "nothing",
        "whatever",
        "either",
        "preservation",
        "destruction",
        "material",
        "universe",
        "hence",
        "identicalwith",
        "genuine",
        "unperverted",
        "realism",
        "ibid",
        "emphasis",
        "original",
        "way",
        "ferrier",
        "despite",
        "disagreement",
        "actually",
        "concurs",
        "reid",
        "s",
        "stricture",
        "kind",
        "philosophical",
        "theorizing",
        "try",
        "deploy",
        "newtonian",
        "method",
        "way",
        "hume",
        "indeed",
        "ferrier",
        "think",
        "inert",
        "lifeless",
        "character",
        "modern",
        "philosophy",
        "ultimately",
        "attributable",
        "degenerated",
        "physical",
        "science",
        "ibid",
        "condemns",
        "resulting",
        "picture",
        "man",
        "wretched",
        "association",
        "machine",
        "idea",
        "pas",
        "linked",
        "law",
        "machine",
        "control",
        "ibid",
        "alternative",
        "externalist",
        "conception",
        "science",
        "mind",
        "return",
        "introspective",
        "examination",
        "human",
        "consciousness",
        "consciousness",
        "philosophy",
        "nascent",
        "philosophy",
        "consciousness",
        "full",
        "bloom",
        "blow",
        "difference",
        "one",
        "degree",
        "one",
        "kind",
        "thus",
        "conscious",
        "men",
        "certain",
        "extent",
        "philosopher",
        "although",
        "may",
        "know",
        "ibid",
        "short",
        "proper",
        "engagement",
        "philosophy",
        "matter",
        "bringing",
        "consciousness",
        "better",
        "understanding",
        "least",
        "one",
        "interpretation",
        "ambition",
        "reid",
        "s",
        "inquiry",
        "ferrier",
        "s",
        "philosophy",
        "construed",
        "importantly",
        "different",
        "reid",
        "s",
        "time",
        "another",
        "exploration",
        "common",
        "sense",
        "tradition",
        "reid",
        "berkeley",
        "principal",
        "architect",
        "way",
        "idea",
        "hence",
        "though",
        "skeptic",
        "purveyor",
        "philosophy",
        "make",
        "radical",
        "skepticism",
        "inevitable",
        "sharp",
        "contrast",
        "ferrier",
        "berkeley",
        "s",
        "philosophy",
        "addition",
        "ferrier",
        "s",
        "answer",
        "skepticism",
        "rejecting",
        "philosopher",
        "invention",
        "matter",
        "berkely",
        "mean",
        "affirm",
        "common",
        "sense",
        "hardly",
        "need",
        "said",
        "construction",
        "berkeley",
        "highly",
        "controversial",
        "position",
        "moreover",
        "throw",
        "whole",
        "subject",
        "mind",
        "consciousness",
        "back",
        "realm",
        "metaphysical",
        "philosophy",
        "hence",
        "seems",
        "abandon",
        "shared",
        "methodological",
        "assumption",
        "quote",
        "reid",
        "one",
        "way",
        "knowledge",
        "nature",
        "s",
        "work",
        "way",
        "observation",
        "experiment",
        "supposition",
        "wholeheartedly",
        "shared",
        "hume",
        "implicationthat",
        "method",
        "science",
        "inapplicable",
        "philosophysomewhat",
        "isolated",
        "ferrier",
        "within",
        "scottish",
        "philosophy",
        "though",
        "regarded",
        "great",
        "acclaim",
        "continental",
        "europe",
        "scottish",
        "philosopher",
        "moved",
        "different",
        "direction",
        "intensification",
        "experimental",
        "method",
        "absolute",
        "idealism",
        "first",
        "group",
        "prominent",
        "influential",
        "alexander",
        "bain"
    ]
}