{
    "main_text": "Hutcheson and Archibald Campbell\n3. Hutcheson and Archibald Campbell\n\nThe first of the major philosophers was Francis Hutcheson\n(1694–1746). His reputation rests chiefly on his earlier\nwritings, especially An Inquiry into the Original of our Ideas of\nBeauty and Virtue (London 1725), Reflections upon Laughter\nand Remarks on the Fable of the Bees (both in the Dublin Journal\n1725–1726), and Essay on the Nature and Conduct of the\nPassions with Illustrations on the Moral Sense (London 1728). His\nmagnum opus, A System of Moral Philosophy, was published\nposthumously in Glasgow in 1755. During his period as a student at\nGlasgow University (c. 1711–1717) Gershom Carmichael taught\nmoral philosophy and jurisprudence there and there are clear signs in\nHutcheson’s writings of Carmichael’s influence though it\nis not known whether he studied under Carmichael during his student\ndays. In 1730 he took up the moral philosophy chair left vacant on\nCarmichael’s death. Hutcheson is known principally for his ideas\non moral philosophy and aesthetics. First moral philosophy.\n\nHutcheson reacted against both the psychological egoism of Thomas\nHobbes and the rationalism of Samuel Clarke and William Wollaston. As\nregards Hobbes, Hutcheson thought his doctrine was both wrong and\ndangerous; wrong because by the frame of our nature we have\ncompassionate, generous and benevolent affections which owe nothing at\nall to calculations of self-interest, and dangerous because people may\nbe discouraged from the morally worthy exercise of cultivating\ngenerous affections in themselves on the grounds that the exercise of\nsuch affections is really an exercise in dissimulation or pretence. As\nagainst Hobbes Hutcheson held that a morally good act is one motivated\nby benevolence, a desire for the happiness of others. Indeed the wider\nthe scope of the act the better, morally speaking, the act is;\nHutcheson was the first to speak of “the greatest happiness for\nthe greatest numbers”.\n\nHe believed that moral knowledge is gained via our moral sense. A\nsense, as the term is deployed by Hutcheson, is every determination of\nour minds to receive ideas independently of our will, and to have\nperceptions of pleasure and pain. In accordance with this definition,\nthe five external senses determine us to receive ideas which please or\npain us, and the will does not intervene — we open our eyes and\nby natural necessity see whatever it is that we see. But Hutcheson\nthought that there were far more senses than the five external ones.\nThree in particular play a role in our moral life. The public sense is\nthat by which we are pleased with the happiness of others, and are\nuneasy at their misery. The moral sense is that by which we perceive\nvirtue or vice in ourselves or others, and derive pleasure, or pain,\nfrom the perception. And the sense of honour is that which makes the\napprobation, or gratitude of others, for any good actions we have\ndone, the necessary occasion of pleasure. In each of these cases the\nwill is not involved. We see a person acting with the intention of\nbringing happiness to someone else, and by the frame of our nature\npleasure wells up in us.\n\nHutcheson emphasises both the complexity of the relations between our\nnatural affections and also the need, in the name of morality, to\nexercise careful management of the relations between the affections.\nWe must especially be careful not to let any of our affections get too\n‘passionate’, for a passionate affection might become an\neffective obstacle to other affections that should be given priority.\nAbove all the selfish affections must not be allowed to over-rule\n‘calm universal benevolence’.\n\nHutcheson’s opposition to Hobbesian egoism is matched by his\nopposition to ethical rationalism, an opposition which emerges in the\nIllustrations upon the Moral Sense, where he demonstrates\nthat his account of the affections and the moral sense makes sense of\nthe moral facts whereas the doctrines of Clarke and Wollaston totally\nfail to do so. Hutcheson’s main thesis against ethical\nrationalism is that all exciting reasons presuppose instincts and\naffections, while justifying reasons presuppose a moral sense. An\nexciting reason is a motive which actually prompts a person to act; a\njustifying reason is one which grounds moral approval of the act.\nHutcheson demonstrates that reason, unlike affection, cannot furnish\nan exciting motive, and that there can be no exciting reason previous\nto affection. Reason does of course play a role in our moral life, but\nonly as helping to guide us to an end antecedently determined by\naffection, in particular the affection of universal benevolence. On\nthis basis, an act can be called ‘reasonable’, but this is\nnot a point on the side of the rationalists, since they hold that\nreason by itself can motivate, and in this case it is affection, not\nreason that motivates, that is, that gets us doing something rather\nthan nothing.\n\nIf we add to this the fact, as Hutcheson sees it, that it has never\nbeen demonstrated that reason is a fit faculty to determine what the\nends are that we are obliged to seek, we shall see that\nHutcheson’s criticism of rationalism is that it can account for\nneither moral motivation nor moral judgment. On the other hand our\nnatural affections, in particular benevolence, account fully for our\nmoral motivation and our faculty of moral sense accounts fully for our\nability to make an assessment of actions whether our own or\nothers’.\n\nCertain features of Hutcheson’s moral philosophy appear in his\naesthetic theory also. Indeed the two fields are inextricably related,\nas witness Hutcheson’s reference to the ‘moral sense of\nbeauty’. Two features especially work hard. He contends that we\nsense the beauty, sublimity or grandeur of a sight or of a sound. The\nsense of the thing’s beauty, so to say, wells up unbidden. And\nassociated with that sense, and perhaps even part of it —\nHutcheson does not give us a clear account of the matter — is a\npleasure that we take in the thing. We enjoy beautiful things\nand that enjoyment is not merely incidental to our sensing their\nbeauty.\n\nA question arises here regarding the features of a thing that cause us\nto see it as beautiful and to take pleasure in it. Hutcheson suggests\nthat a beautiful thing displays unity (or uniformity) amidst variety.\nIf a work has too much uniformity it is simply boring. If it has too\nmuch variety it is a jumble. An object, whether visual or audible,\nrequires therefore to occupy the intermediate position if it is to\ngive rise to a sense of beauty in the object. But if Hutcheson is\nright about the basis of aesthetic judgment how does disagreement\narise? Hutcheson’s reply is that our aesthetic response is\naffected in part by the associations that the thing arouses in our\nmind. If an object that we had found beautiful comes to be associated\nin our mind with something disagreeable this will affect our aesthetic\nresponse; we might even find the thing ugly. Hutcheson gives an\nexample of wines to which men acquire an aversion after they have\ntaken them in an emetic preparation. On this matter his position may\nseem extreme, for he holds that if two people have the same experience\nand if the thing experienced carries the same identical associations\nfor the two people, then they will have the same aesthetic response to\nthe object. The position is however difficult to disprove, since if\ntwo people do in fact disagree about the aesthetic merit of an object,\nHutcheson can say that the object produces different associations in\nthe two spectators.\n\nNevertheless, Hutcheson does believe aesthetic misjudgments are\npossible, and in the course of explaining their occurrence he deploys\nLocke’s doctrine of association of ideas, a doctrine according\nto which ideas linked solely by chance or custom come to be associated\nin our minds and become almost inseparable from each other though they\nare ‘not at all of kin’. Hutcheson holds that an art\nconnoisseur’s judgment can be distorted through his tendency to\nassociate ideas, and notes in particular that a connoisseur’s\naesthetic response to a work of art is likely to be affected by the\nfact that he owns it, for the pleasure of ownership will tend to\nintermix with and distort the affective response he would otherwise\nhave to the object. Hutcheson, it should be added, is equally\nsensitive to the danger to our moral judgments that is posed by our\nassociative tendency. And in both types of case the best defence\nagainst the threat is reflection, understood as a mental probing, an\nexamination and then cross-examination, whether of a work of art or of\nan action, and of the elements in and aspects of our situation that\nmotivate our judgments, all this with a view to factoring out\nirrelevant considerations. Without such mental exercises we cannot, in\nhis view, obtain what he terms ‘true liberty and\nself-command’. This position, which he presents several times,\npoints to a doctrine of free will not otherwise readily discernible in\nhis writings. Our free will, on this account, is a habit of reflection\nthrough which we form a judgment which we are in a position to defend.\nWe stand back from the object of reflection, do not allow ourselves to\nbe overwhelmed by it, but instead adjudicate it in the light of\nwhatever considerations we judge it appropriate to bring to bear\n(Broadie 2016).\n\nA philosopher of the early period of the Scottish Enlightenment with\nwhom Hutcheson may helpfully be compared and contrasted is his close\ncontemporary Archibald Campbell (1691–1756), professor of\ndivinity and church history at St Andrews University. Both men studied\nat Glasgow University under John Simson, a professorial divine much\nharassed by conservative Reformists in the Kirk on account of his\nrejection of the Kirk’s doctrine that, since the Fall, human\nnature through the generations has suffered from total depravity. In\ndue course Hutcheson and Campbell were both harassed by the Kirk on\naccount of their claim that human beings are by nature inclined to\nvirtue, for the Kirk took that claim to imply that the two men did not\nfully embrace the doctrine of total depravity. However, beyond this\nagreement Campbell opposes Hutcheson on certain essential points. Most\nespecially, in his Enquiry into the Original of Moral Virtue\n(1733) Campbell rejects Hutcheson’s claim that for an action to\nbe virtuous it must be motivated by a disinterested benevolence, and\nargues to the contrary that all human acts are and can only be\nmotivated by self-love. From which Campbell concludes that all\nvirtuous human acts also are motivated by self-love. This claim,\nthough at first sight Hobbesian, is however not at all of a Hobbesian\nstripe, for Campbell holds that the self-love that motivates us to\nperform a virtuous act takes the form of a desire for esteem, where\nthe desired esteem derives from our gratification of another\nperson’s self-love. As well as writing against Hobbes and\nHutcheson, Campbell also directs his fire at Bernard Mandeville, who\nheld that a virtuous act must involve an exercise of self-denial, in\nthe sense that to act virtuously we have to cut across, or frustrate\nour natural principles, whereas for Campbell, as also for Hutcheson,\nvirtuous acts are performed in realisation of, and not at all in\nconflict with, our nature. The Kirk set up a committee of purity of\ndoctrine to investigate the teachings of Campbell, a Kirk minister who\npainted such a distressingly agreeable picture of human nature. The\nconservatively orthodox Reformists on the Committee wished to move\nagainst him, but the Kirk’s General Assembly, which was already\nbeginning to display an Enlightenment spirit, prevented such a move,\nand Campbell retained his professorship of divinity and his position\nas minister of the Kirk. Campbell’s ideas, till now neglected,\nare at last beginning to receive serious consideration (Maurer 2012,\n2016).\n",
    "section_title": "3. Hutcheson and Archibald Campbell",
    "entry_title": "Scottish Philosophy in the 18th Century",
    "hierarchy_title": "Scottish Philosophy in the 18th Century || Hutcheson and Archibald Campbell",
    "tokenized_text": [
        "hutcheson",
        "archibald",
        "campbell",
        "hutcheson",
        "archibald",
        "campbell",
        "first",
        "major",
        "philosopher",
        "francis",
        "hutcheson",
        "reputation",
        "rest",
        "chiefly",
        "earlier",
        "writing",
        "especially",
        "inquiry",
        "original",
        "idea",
        "beauty",
        "virtue",
        "london",
        "reflection",
        "upon",
        "laughter",
        "remark",
        "fable",
        "bee",
        "dublin",
        "journal",
        "essay",
        "nature",
        "conduct",
        "passion",
        "illustration",
        "moral",
        "sense",
        "london",
        "magnum",
        "opus",
        "system",
        "moral",
        "philosophy",
        "published",
        "posthumously",
        "glasgow",
        "period",
        "student",
        "glasgow",
        "university",
        "c",
        "gershom",
        "carmichael",
        "taught",
        "moral",
        "philosophy",
        "jurisprudence",
        "clear",
        "sign",
        "hutcheson",
        "writing",
        "carmichael",
        "influence",
        "though",
        "known",
        "whether",
        "studied",
        "carmichael",
        "student",
        "day",
        "took",
        "moral",
        "philosophy",
        "chair",
        "left",
        "vacant",
        "carmichael",
        "death",
        "hutcheson",
        "known",
        "principally",
        "idea",
        "moral",
        "philosophy",
        "aesthetic",
        "first",
        "moral",
        "philosophy",
        "hutcheson",
        "reacted",
        "psychological",
        "egoism",
        "thomas",
        "hobbes",
        "rationalism",
        "samuel",
        "clarke",
        "william",
        "wollaston",
        "regard",
        "hobbes",
        "hutcheson",
        "thought",
        "doctrine",
        "wrong",
        "dangerous",
        "wrong",
        "frame",
        "nature",
        "compassionate",
        "generous",
        "benevolent",
        "affection",
        "owe",
        "nothing",
        "calculation",
        "selfinterest",
        "dangerous",
        "people",
        "may",
        "discouraged",
        "morally",
        "worthy",
        "exercise",
        "cultivating",
        "generous",
        "affection",
        "ground",
        "exercise",
        "affection",
        "really",
        "exercise",
        "dissimulation",
        "pretence",
        "hobbes",
        "hutcheson",
        "held",
        "morally",
        "good",
        "act",
        "one",
        "motivated",
        "benevolence",
        "desire",
        "happiness",
        "others",
        "indeed",
        "wider",
        "scope",
        "act",
        "better",
        "morally",
        "speaking",
        "act",
        "hutcheson",
        "first",
        "speak",
        "greatest",
        "happiness",
        "greatest",
        "number",
        "believed",
        "moral",
        "knowledge",
        "gained",
        "via",
        "moral",
        "sense",
        "sense",
        "term",
        "deployed",
        "hutcheson",
        "every",
        "determination",
        "mind",
        "receive",
        "idea",
        "independently",
        "perception",
        "pleasure",
        "pain",
        "accordance",
        "definition",
        "five",
        "external",
        "sens",
        "determine",
        "u",
        "receive",
        "idea",
        "please",
        "pain",
        "u",
        "intervene",
        "open",
        "eye",
        "natural",
        "necessity",
        "see",
        "whatever",
        "see",
        "hutcheson",
        "thought",
        "far",
        "sens",
        "five",
        "external",
        "one",
        "three",
        "particular",
        "play",
        "role",
        "moral",
        "life",
        "public",
        "sense",
        "pleased",
        "happiness",
        "others",
        "uneasy",
        "misery",
        "moral",
        "sense",
        "perceive",
        "virtue",
        "vice",
        "others",
        "derive",
        "pleasure",
        "pain",
        "perception",
        "sense",
        "honour",
        "make",
        "approbation",
        "gratitude",
        "others",
        "good",
        "action",
        "done",
        "necessary",
        "occasion",
        "pleasure",
        "case",
        "involved",
        "see",
        "person",
        "acting",
        "intention",
        "bringing",
        "happiness",
        "someone",
        "else",
        "frame",
        "nature",
        "pleasure",
        "well",
        "u",
        "hutcheson",
        "emphasis",
        "complexity",
        "relation",
        "natural",
        "affection",
        "also",
        "need",
        "name",
        "morality",
        "exercise",
        "careful",
        "management",
        "relation",
        "affection",
        "must",
        "especially",
        "careful",
        "let",
        "affection",
        "get",
        "passionate",
        "passionate",
        "affection",
        "might",
        "become",
        "effective",
        "obstacle",
        "affection",
        "given",
        "priority",
        "selfish",
        "affection",
        "must",
        "allowed",
        "overrule",
        "calm",
        "universal",
        "benevolence",
        "hutcheson",
        "opposition",
        "hobbesian",
        "egoism",
        "matched",
        "opposition",
        "ethical",
        "rationalism",
        "opposition",
        "emerges",
        "illustration",
        "upon",
        "moral",
        "sense",
        "demonstrates",
        "account",
        "affection",
        "moral",
        "sense",
        "make",
        "sense",
        "moral",
        "fact",
        "whereas",
        "doctrine",
        "clarke",
        "wollaston",
        "totally",
        "fail",
        "hutcheson",
        "main",
        "thesis",
        "ethical",
        "rationalism",
        "exciting",
        "reason",
        "presuppose",
        "instinct",
        "affection",
        "justifying",
        "reason",
        "presuppose",
        "moral",
        "sense",
        "exciting",
        "reason",
        "motive",
        "actually",
        "prompt",
        "person",
        "act",
        "justifying",
        "reason",
        "one",
        "ground",
        "moral",
        "approval",
        "act",
        "hutcheson",
        "demonstrates",
        "reason",
        "unlike",
        "affection",
        "furnish",
        "exciting",
        "motive",
        "exciting",
        "reason",
        "previous",
        "affection",
        "reason",
        "course",
        "play",
        "role",
        "moral",
        "life",
        "helping",
        "guide",
        "u",
        "end",
        "antecedently",
        "determined",
        "affection",
        "particular",
        "affection",
        "universal",
        "benevolence",
        "basis",
        "act",
        "called",
        "reasonable",
        "point",
        "side",
        "rationalist",
        "since",
        "hold",
        "reason",
        "motivate",
        "case",
        "affection",
        "reason",
        "motivates",
        "get",
        "u",
        "something",
        "rather",
        "nothing",
        "add",
        "fact",
        "hutcheson",
        "see",
        "never",
        "demonstrated",
        "reason",
        "fit",
        "faculty",
        "determine",
        "end",
        "obliged",
        "seek",
        "shall",
        "see",
        "hutcheson",
        "criticism",
        "rationalism",
        "account",
        "neither",
        "moral",
        "motivation",
        "moral",
        "judgment",
        "hand",
        "natural",
        "affection",
        "particular",
        "benevolence",
        "account",
        "fully",
        "moral",
        "motivation",
        "faculty",
        "moral",
        "sense",
        "account",
        "fully",
        "ability",
        "make",
        "assessment",
        "action",
        "whether",
        "others",
        "certain",
        "feature",
        "hutcheson",
        "moral",
        "philosophy",
        "appear",
        "aesthetic",
        "theory",
        "also",
        "indeed",
        "two",
        "field",
        "inextricably",
        "related",
        "witness",
        "hutcheson",
        "reference",
        "moral",
        "sense",
        "beauty",
        "two",
        "feature",
        "especially",
        "work",
        "hard",
        "contends",
        "sense",
        "beauty",
        "sublimity",
        "grandeur",
        "sight",
        "sound",
        "sense",
        "thing",
        "beauty",
        "say",
        "well",
        "unbidden",
        "associated",
        "sense",
        "perhaps",
        "even",
        "part",
        "hutcheson",
        "give",
        "u",
        "clear",
        "account",
        "matter",
        "pleasure",
        "take",
        "thing",
        "enjoy",
        "beautiful",
        "thing",
        "enjoyment",
        "merely",
        "incidental",
        "sensing",
        "beauty",
        "question",
        "arises",
        "regarding",
        "feature",
        "thing",
        "cause",
        "u",
        "see",
        "beautiful",
        "take",
        "pleasure",
        "hutcheson",
        "suggests",
        "beautiful",
        "thing",
        "display",
        "unity",
        "uniformity",
        "amidst",
        "variety",
        "work",
        "much",
        "uniformity",
        "simply",
        "boring",
        "much",
        "variety",
        "jumble",
        "object",
        "whether",
        "visual",
        "audible",
        "requires",
        "therefore",
        "occupy",
        "intermediate",
        "position",
        "give",
        "rise",
        "sense",
        "beauty",
        "object",
        "hutcheson",
        "right",
        "basis",
        "aesthetic",
        "judgment",
        "disagreement",
        "arise",
        "hutcheson",
        "reply",
        "aesthetic",
        "response",
        "affected",
        "part",
        "association",
        "thing",
        "arouses",
        "mind",
        "object",
        "found",
        "beautiful",
        "come",
        "associated",
        "mind",
        "something",
        "disagreeable",
        "affect",
        "aesthetic",
        "response",
        "might",
        "even",
        "find",
        "thing",
        "ugly",
        "hutcheson",
        "give",
        "example",
        "wine",
        "men",
        "acquire",
        "aversion",
        "taken",
        "emetic",
        "preparation",
        "matter",
        "position",
        "may",
        "seem",
        "extreme",
        "hold",
        "two",
        "people",
        "experience",
        "thing",
        "experienced",
        "carry",
        "identical",
        "association",
        "two",
        "people",
        "aesthetic",
        "response",
        "object",
        "position",
        "however",
        "difficult",
        "disprove",
        "since",
        "two",
        "people",
        "fact",
        "disagree",
        "aesthetic",
        "merit",
        "object",
        "hutcheson",
        "say",
        "object",
        "produce",
        "different",
        "association",
        "two",
        "spectator",
        "nevertheless",
        "hutcheson",
        "believe",
        "aesthetic",
        "misjudgments",
        "possible",
        "course",
        "explaining",
        "occurrence",
        "deploys",
        "locke",
        "doctrine",
        "association",
        "idea",
        "doctrine",
        "according",
        "idea",
        "linked",
        "solely",
        "chance",
        "custom",
        "come",
        "associated",
        "mind",
        "become",
        "almost",
        "inseparable",
        "though",
        "kin",
        "hutcheson",
        "hold",
        "art",
        "connoisseur",
        "judgment",
        "distorted",
        "tendency",
        "associate",
        "idea",
        "note",
        "particular",
        "connoisseur",
        "aesthetic",
        "response",
        "work",
        "art",
        "likely",
        "affected",
        "fact",
        "owns",
        "pleasure",
        "ownership",
        "tend",
        "intermix",
        "distort",
        "affective",
        "response",
        "would",
        "otherwise",
        "object",
        "hutcheson",
        "added",
        "equally",
        "sensitive",
        "danger",
        "moral",
        "judgment",
        "posed",
        "associative",
        "tendency",
        "type",
        "case",
        "best",
        "defence",
        "threat",
        "reflection",
        "understood",
        "mental",
        "probing",
        "examination",
        "crossexamination",
        "whether",
        "work",
        "art",
        "action",
        "element",
        "aspect",
        "situation",
        "motivate",
        "judgment",
        "view",
        "factoring",
        "irrelevant",
        "consideration",
        "without",
        "mental",
        "exercise",
        "view",
        "obtain",
        "term",
        "true",
        "liberty",
        "selfcommand",
        "position",
        "present",
        "several",
        "time",
        "point",
        "doctrine",
        "free",
        "otherwise",
        "readily",
        "discernible",
        "writing",
        "free",
        "account",
        "habit",
        "reflection",
        "form",
        "judgment",
        "position",
        "defend",
        "stand",
        "back",
        "object",
        "reflection",
        "allow",
        "overwhelmed",
        "instead",
        "adjudicate",
        "light",
        "whatever",
        "consideration",
        "judge",
        "appropriate",
        "bring",
        "bear",
        "broadie",
        "philosopher",
        "early",
        "period",
        "scottish",
        "enlightenment",
        "hutcheson",
        "may",
        "helpfully",
        "compared",
        "contrasted",
        "close",
        "contemporary",
        "archibald",
        "campbell",
        "professor",
        "divinity",
        "church",
        "history",
        "st",
        "andrew",
        "university",
        "men",
        "studied",
        "glasgow",
        "university",
        "john",
        "simson",
        "professorial",
        "divine",
        "much",
        "harassed",
        "conservative",
        "reformist",
        "kirk",
        "account",
        "rejection",
        "kirk",
        "doctrine",
        "since",
        "fall",
        "human",
        "nature",
        "generation",
        "suffered",
        "total",
        "depravity",
        "due",
        "course",
        "hutcheson",
        "campbell",
        "harassed",
        "kirk",
        "account",
        "claim",
        "human",
        "being",
        "nature",
        "inclined",
        "virtue",
        "kirk",
        "took",
        "claim",
        "imply",
        "two",
        "men",
        "fully",
        "embrace",
        "doctrine",
        "total",
        "depravity",
        "however",
        "beyond",
        "agreement",
        "campbell",
        "opposes",
        "hutcheson",
        "certain",
        "essential",
        "point",
        "especially",
        "enquiry",
        "original",
        "moral",
        "virtue",
        "campbell",
        "reject",
        "hutcheson",
        "claim",
        "action",
        "virtuous",
        "must",
        "motivated",
        "disinterested",
        "benevolence",
        "argues",
        "contrary",
        "human",
        "act",
        "motivated",
        "selflove",
        "campbell",
        "concludes",
        "virtuous",
        "human",
        "act",
        "also",
        "motivated",
        "selflove",
        "claim",
        "though",
        "first",
        "sight",
        "hobbesian",
        "however",
        "hobbesian",
        "stripe",
        "campbell",
        "hold",
        "selflove",
        "motivates",
        "u",
        "perform",
        "virtuous",
        "act",
        "take",
        "form",
        "desire",
        "esteem",
        "desired",
        "esteem",
        "derives",
        "gratification",
        "another",
        "person",
        "selflove",
        "well",
        "writing",
        "hobbes",
        "hutcheson",
        "campbell",
        "also",
        "directs",
        "fire",
        "bernard",
        "mandeville",
        "held",
        "virtuous",
        "act",
        "must",
        "involve",
        "exercise",
        "selfdenial",
        "sense",
        "act",
        "virtuously",
        "cut",
        "across",
        "frustrate",
        "natural",
        "principle",
        "whereas",
        "campbell",
        "also",
        "hutcheson",
        "virtuous",
        "act",
        "performed",
        "realisation",
        "conflict",
        "nature",
        "kirk",
        "set",
        "committee",
        "purity",
        "doctrine",
        "investigate",
        "teaching",
        "campbell",
        "kirk",
        "minister",
        "painted",
        "distressingly",
        "agreeable",
        "picture",
        "human",
        "nature",
        "conservatively",
        "orthodox",
        "reformist",
        "committee",
        "wished",
        "move",
        "kirk",
        "general",
        "assembly",
        "already",
        "beginning",
        "display",
        "enlightenment",
        "spirit",
        "prevented",
        "move",
        "campbell",
        "retained",
        "professorship",
        "divinity",
        "position",
        "minister",
        "kirk",
        "campbell",
        "idea",
        "till",
        "neglected",
        "last",
        "beginning",
        "receive",
        "serious",
        "consideration",
        "maurer"
    ]
}