{
    "main_text": "Self-Consciousness in Thought || First-Person Reference\n2.2 First-Person Reference\n\nBecause of its connection with the first-person pronoun, it is often\ntaken as platitudinous to say that self-conscious thought is closely\nassociated with the capacity to refer to oneself as oneself.\nWhen I think self-consciously, I cannot fail to refer to myself. More\nthan this, it has often been claimed that for a central class of\nfirst-person thoughts, there is no possibility of misidentifying\nmyself: not only can I not fail to pick myself out, I cannot take\nanother person to be me. But first-person reference, and indexicality\nmore generally, has sometimes been thought to pose a challenge to\ntheories of reference, requiring special treatment. Indeed, some have\nargued that the platitude itself should be rejected.\n\nTerms whose function it is to refer can, on occasion, fail in that\nfunction. A use of the term “Vulcan” to refer to the\nplanet orbiting between Mercury and the sun, fails to refer to\nanything for the reason that there is nothing for it to refer to. If I\nsee the head of one dachshund protruding from behind a tree and the\nrear end of another protruding from the other side of the tree, and\nutter “that dog is huge”, my use of “that dog”\nhas arguably failed to refer due to there being too many objects. It\nwould seem that, by contrast, the term “I” cannot fail to\nrefer either by there being too few or too many objects.\n“I” is guaranteed to refer.\n\nAs an indexical, the referent of “I” varies with the\ncontext of utterance (see the entry on\n indexicals).\n That is, “I” refers to different people depending on who\nutters it. Following Kaplan (1977), it is common to think of the\nmeaning of such terms as determining a function from context to\nreferent. In the case of “I”, a natural proposal is the\n“Self-Reference Rule” (SRR), that the referent of a token\nof “I” is the person that produces it (Kaplan 1977: 491;\nCampbell 1994: ch. 3). “I” is thus, unlike\n“this” or “that”, a pure indexical, seemingly\nrequiring no overt demonstration or manifestation of intention (Kaplan\n1977: 489–91). SRR captures the plausible thought that\n“I” is guaranteed against reference failure. Since every\ntoken of “I” has been produced, the fact that\n“I” refers to its producer means that there is no chance\nof its failing to pick out some entity. This account of\n“I”, then, treats it as not only expressive of\nself-consciousness, but also guaranteed to refer to the utterer.\n\nSRR is Kaplan’s specification of the character of\n“I”, which is fixed independently of the context of any\nparticular utterance. This character is to be distinguished from the\ncontent of a tokening of “I”, which it has only\nin a context. On Kaplan’s account, the content of an utterance\nof “I am F” will be a singular proposition composed\nof the person that produced it and Fness (Recanati 1993; for an\naccount that attributes to the utterance both singular content, and\nthe “reflexive content” the speaker of this token is\nF, see Perry 2001; for an alternative “Neo-Fregean”\naccount in terms of object-dependent de re senses, see Evans\n1981; cf. McDowell 1977; and Evans 1982: ch. 1).\n\nIntuitively plausible as it is, SRR is open to a number of potential\ncounterexamples. Suppose, for example, that you are away from work due\nto illness and I leave a note on your door reading “I am not\nhere now”. Plausibly, whilst it was me that produced this token\nof “I”, it nevertheless refers to you. Or\nconsider a situation in which I walk into a petrol station, point to\nmy car, and say “I’m empty”. In this case, it might\nbe suggested, my use of “I” refers to my car rather than\nmyself (for these and related cases, see Vision 1985; Q. Smith 1989;\nSidelle 1991; Nunberg 1993, 1995). If so, SRR cannot specify the\ncharacter of “I” and so, arguably, some tokens of\n“I” fail to express the self-conscious thoughts of those\nthat produce them. In light of such cases, a variety of alternatives\nto SRR have been proposed. Q. Smith (1989) suggests that\n“I” is lexically ambiguous; Predelli (1998a,b, 2002)\noffers an intention-based reference rule for “I”; Corazza,\nFish, and Gorvett (2002) offer a convention-based account; and Cohen\n(2013) argues that the cases can be handled by a conservative\nmodification of Kaplan’s original proposal (also see,\nRomdenh-Romluc 2002, 2008; Corazza 2004: ch. 5; Dodd & Sweeney\n2010; Michaelson 2014).\n\nAlthough she didn’t have Kaplan’s formulation of SRR in\nmind, an earlier criticism of such a rule can be found in the work of\nAnscombe (1975) who argues that the rule cannot be complete as an\naccount of the meaning of “I” (for discussion see\nO’Brien 1994). Anscombe considers a world in which each person\nhas two names, one of which (ranging from “B” to\n“Z”) is printed on their chest, the other (in every case\n“A”) is printed on the inside of their wrist. Each person\nuses “B” to “Z” when attributing actions to\nothers, but “A” when describing their own actions\n(Anscombe 1975: 49). Anscombe argues that such a situation is\ncompatible with the possibility that the people in question lack\nself-consciousness. Whilst B uses “A” to refer to B, C\nuses “A” to refer to C, and so on, there is no guarantee\nthat they are thinking of themselves as themselves, for they\nmay be reporting what are in fact their own actions without thinking\nof those actions as things that they themselves are\nperforming. They may treat themselves, that is, just as the treat any\nother. This is despite the fact that, in this scenario,\n“A” complies with SRR.\n\nCan the Self-Reference Rule be reformulated in such a way as to entail\nself-consciousness on the part of those who use terms that comply with\nit? According to Anscombe it can, but any such reformulation will\npresuppose a prior grasp of self-conscious reference to oneself. For\nexample, if we say, employing the indirect reflexive, that\n“I” is a term that a person uses to refer to she\nherself, we have travelled in a tight circle since “she\nherself” can be understood only in terms of “I”\n(Anscombe 1975; Castañeda 1966; for discussion, see\nBermúdez 1998: ch. 1). This can be seen clearly in the\nfirst-person formulation of such a rule: “I” is a term\nthat I use to refer to myself. For here the\n“myself” must itself be understood as an expression of\nself-consciousness, i.e., we should really say that “I” is\na term that I use to refer to myself as myself.\n\nIn response to Anscombe’s argument, it has been argued that SRR\nis not intended to explain the connection between self-consciousness\nand the first-person (O’Brien 1994, 1995a; Garrett 1998: ch. 7;\ncf. Campbell 1994: §4.2; Peacocke 2008: §3.1). On this view,\nall that the example of “A” users shows is that\nself-consciousness has not been fully accounted for by SRR, not that\nSRR fails as an account of the character of “I”. Kaplan\nhimself, however, does appear to be more ambitious than this, claiming\nthat the “particular and primitive way” in which each of\nus is presented to ourselves is simply that each “is presented\nto himself under the character of \"I\"” (Kaplan 1977: 533). This\nclaim, it would seem, is indeed open to Anscombe’s\nchallenge.\n\nAnscombe’s (1975) paper is perhaps most notable for her claim\nthat “I” is not a referring expression at all. Assuming\nthat if “I” refers it must be understood on the model of\neither a proper name, a demonstrative, or an abbreviation of a\ndefinite description, Anscombe argues that each of these kinds of\nreferring expression requires what she calls a\n“conception” by means of which it reaches its referent.\nThis conception must explain the seemingly guaranteed reference of\n“I”: the apparent fact that no token of “I”\ncan fail to pick out an object. However, she argues, no satisfactory\nconception can be specified for “I” since either it fails\nto deliver up guaranteed reference, or it succeeds but only by\ndelivering an immaterial soul. Since we have independent reason to\nbelieve that there are no immaterial souls, it follows that\n“I” cannot be understood on the model of a proper name,\ndemonstrative or definite description, so is not a referring\nexpression (see Kenny 1979 and Malcolm 1979 for positive appraisals of\nAnscombe’s position. Criticisms can be found in White 1979;\nHamilton 1991; Brandom 1994: 552–561; Glock & Hacker 1996;\nMcDowell 1998; Harcourt 2000).\n\nThat “I” does not function as either a name or an\nabbreviated definite description is widely accepted. The more\ncontentious aspect of Anscombe’s case for the view that there is\nno appropriate conception for “I” is her claim that\n“I” does not function like a demonstrative. Her argument\nfor this claim is highly reminiscent of Avicenna’s Flying Man\nargument (see\n §1.1),\n with which she was surely familiar. We can, she tells us, imagine a\nsubject in a sensory deprivation tank who has been anaesthetised and\nis suffering from amnesia. Such a subject would, claims Anscombe, be\nable to think I-thoughts, perhaps wondering, “How did I get into\nthis mess?”. Since such a subject can think self-consciously in\nthe absence of any presented referent, it follows that “I”\ncannot mean something like “this person”, since\ndemonstratives require the demonstrated object to be presented to\nconscious awareness. Treating “I” on a demonstrative\nmodel, then, fails (cf. Campbell 1994: §4.2; O’Brien 1995b;\nsee Morgan 2015 for a defence of a demonstrative account).\n\nAccording to Evans (1982: ch. 7), the problem with Anscombe’s\nargument is that it fails to appreciate that “I” can be\nmodelled on “here” rather than “this”.\nAccording to Evans’ account, the similarity between what he\ncalls “I”-Ideas and “here”-Ideas shows up in\ntheir functional role (for an alternative broadly functional account,\nsee Mellor 1989; for an argument that, far from being amenable to a\nfunctional analysis, self-consciousness poses a threat to the\ncoherence of functionalism, see Bealer 1997). Once we see how both\n“I”-Ideas and “here”-Ideas stand at the centre\nof distinctive networks of inputs (ways of gaining information about\nourselves and our locations respectively) and outputs (including the\nexplanation of action), we can see how to model “I” on\n“here”, thus escaping Anscombe’s argument. For\nfurther discussion, see the supplement:\n Evans on First Person Thought.\n",
    "section_title": "2.2 First-Person Reference",
    "entry_title": "Self-Consciousness",
    "hierarchy_title": "Self-Consciousness || Self-Consciousness in Thought || First-Person Reference",
    "tokenized_text": [
        "selfconsciousness",
        "thought",
        "firstperson",
        "reference",
        "firstperson",
        "reference",
        "connection",
        "firstperson",
        "pronoun",
        "often",
        "taken",
        "platitudinous",
        "say",
        "selfconscious",
        "thought",
        "closely",
        "associated",
        "capacity",
        "refer",
        "oneself",
        "oneself",
        "think",
        "selfconsciously",
        "fail",
        "refer",
        "often",
        "claimed",
        "central",
        "class",
        "firstperson",
        "thought",
        "possibility",
        "misidentifying",
        "fail",
        "pick",
        "take",
        "another",
        "person",
        "firstperson",
        "reference",
        "indexicality",
        "generally",
        "sometimes",
        "thought",
        "pose",
        "challenge",
        "theory",
        "reference",
        "requiring",
        "special",
        "treatment",
        "indeed",
        "argued",
        "platitude",
        "rejected",
        "term",
        "whose",
        "function",
        "refer",
        "occasion",
        "fail",
        "function",
        "use",
        "term",
        "vulcan",
        "refer",
        "planet",
        "orbiting",
        "mercury",
        "sun",
        "fails",
        "refer",
        "anything",
        "reason",
        "nothing",
        "refer",
        "see",
        "head",
        "one",
        "dachshund",
        "protruding",
        "behind",
        "tree",
        "rear",
        "end",
        "another",
        "protruding",
        "side",
        "tree",
        "utter",
        "dog",
        "huge",
        "use",
        "dog",
        "arguably",
        "failed",
        "refer",
        "due",
        "many",
        "object",
        "would",
        "seem",
        "contrast",
        "term",
        "fail",
        "refer",
        "either",
        "many",
        "object",
        "guaranteed",
        "refer",
        "indexical",
        "referent",
        "varies",
        "context",
        "utterance",
        "see",
        "entry",
        "indexicals",
        "refers",
        "different",
        "people",
        "depending",
        "utters",
        "following",
        "kaplan",
        "common",
        "think",
        "meaning",
        "term",
        "determining",
        "function",
        "context",
        "referent",
        "case",
        "natural",
        "proposal",
        "selfreference",
        "rule",
        "srr",
        "referent",
        "token",
        "person",
        "produce",
        "kaplan",
        "campbell",
        "ch",
        "thus",
        "unlike",
        "pure",
        "indexical",
        "seemingly",
        "requiring",
        "overt",
        "demonstration",
        "manifestation",
        "intention",
        "kaplan",
        "srr",
        "capture",
        "plausible",
        "thought",
        "guaranteed",
        "reference",
        "failure",
        "since",
        "every",
        "token",
        "produced",
        "fact",
        "refers",
        "producer",
        "mean",
        "chance",
        "failing",
        "pick",
        "entity",
        "account",
        "treat",
        "expressive",
        "selfconsciousness",
        "also",
        "guaranteed",
        "refer",
        "utterer",
        "srr",
        "kaplan",
        "specification",
        "character",
        "fixed",
        "independently",
        "context",
        "particular",
        "utterance",
        "character",
        "distinguished",
        "content",
        "tokening",
        "context",
        "kaplan",
        "account",
        "content",
        "utterance",
        "f",
        "singular",
        "proposition",
        "composed",
        "person",
        "produced",
        "fness",
        "recanati",
        "account",
        "attribute",
        "utterance",
        "singular",
        "content",
        "reflexive",
        "content",
        "speaker",
        "token",
        "f",
        "see",
        "perry",
        "alternative",
        "neofregean",
        "account",
        "term",
        "objectdependent",
        "de",
        "sens",
        "see",
        "evans",
        "cf",
        "mcdowell",
        "evans",
        "ch",
        "intuitively",
        "plausible",
        "srr",
        "open",
        "number",
        "potential",
        "counterexample",
        "suppose",
        "example",
        "away",
        "work",
        "due",
        "illness",
        "leave",
        "note",
        "door",
        "reading",
        "plausibly",
        "whilst",
        "produced",
        "token",
        "nevertheless",
        "refers",
        "consider",
        "situation",
        "walk",
        "petrol",
        "station",
        "point",
        "car",
        "say",
        "empty",
        "case",
        "might",
        "suggested",
        "use",
        "refers",
        "car",
        "rather",
        "related",
        "case",
        "see",
        "vision",
        "q",
        "smith",
        "sidelle",
        "nunberg",
        "srr",
        "specify",
        "character",
        "arguably",
        "token",
        "fail",
        "express",
        "selfconscious",
        "thought",
        "produce",
        "light",
        "case",
        "variety",
        "alternative",
        "srr",
        "proposed",
        "q",
        "smith",
        "suggests",
        "lexically",
        "ambiguous",
        "predelli",
        "a",
        "b",
        "offer",
        "intentionbased",
        "reference",
        "rule",
        "corazza",
        "fish",
        "gorvett",
        "offer",
        "conventionbased",
        "account",
        "cohen",
        "argues",
        "case",
        "handled",
        "conservative",
        "modification",
        "kaplan",
        "original",
        "proposal",
        "also",
        "see",
        "romdenhromluc",
        "corazza",
        "ch",
        "dodd",
        "sweeney",
        "michaelson",
        "although",
        "kaplan",
        "formulation",
        "srr",
        "mind",
        "earlier",
        "criticism",
        "rule",
        "found",
        "work",
        "anscombe",
        "argues",
        "rule",
        "complete",
        "account",
        "meaning",
        "discussion",
        "see",
        "brien",
        "anscombe",
        "considers",
        "world",
        "person",
        "two",
        "name",
        "one",
        "ranging",
        "b",
        "z",
        "printed",
        "chest",
        "every",
        "case",
        "printed",
        "inside",
        "wrist",
        "person",
        "us",
        "b",
        "z",
        "attributing",
        "action",
        "others",
        "describing",
        "action",
        "anscombe",
        "anscombe",
        "argues",
        "situation",
        "compatible",
        "possibility",
        "people",
        "question",
        "lack",
        "selfconsciousness",
        "whilst",
        "b",
        "us",
        "refer",
        "b",
        "c",
        "us",
        "refer",
        "c",
        "guarantee",
        "thinking",
        "may",
        "reporting",
        "fact",
        "action",
        "without",
        "thinking",
        "action",
        "thing",
        "performing",
        "may",
        "treat",
        "treat",
        "despite",
        "fact",
        "scenario",
        "complies",
        "srr",
        "selfreference",
        "rule",
        "reformulated",
        "way",
        "entail",
        "selfconsciousness",
        "part",
        "use",
        "term",
        "comply",
        "according",
        "anscombe",
        "reformulation",
        "presuppose",
        "prior",
        "grasp",
        "selfconscious",
        "reference",
        "oneself",
        "example",
        "say",
        "employing",
        "indirect",
        "reflexive",
        "term",
        "person",
        "us",
        "refer",
        "travelled",
        "tight",
        "circle",
        "since",
        "understood",
        "term",
        "anscombe",
        "castañeda",
        "discussion",
        "see",
        "bermúdez",
        "ch",
        "seen",
        "clearly",
        "firstperson",
        "formulation",
        "rule",
        "term",
        "use",
        "refer",
        "must",
        "understood",
        "expression",
        "selfconsciousness",
        "ie",
        "really",
        "say",
        "term",
        "use",
        "refer",
        "response",
        "anscombe",
        "argument",
        "argued",
        "srr",
        "intended",
        "explain",
        "connection",
        "selfconsciousness",
        "firstperson",
        "brien",
        "a",
        "garrett",
        "ch",
        "cf",
        "campbell",
        "peacocke",
        "view",
        "example",
        "user",
        "show",
        "selfconsciousness",
        "fully",
        "accounted",
        "srr",
        "srr",
        "fails",
        "account",
        "character",
        "kaplan",
        "however",
        "appear",
        "ambitious",
        "claiming",
        "particular",
        "primitive",
        "way",
        "u",
        "presented",
        "simply",
        "presented",
        "character",
        "kaplan",
        "claim",
        "would",
        "seem",
        "indeed",
        "open",
        "anscombe",
        "challenge",
        "anscombe",
        "paper",
        "perhaps",
        "notable",
        "claim",
        "referring",
        "expression",
        "assuming",
        "refers",
        "must",
        "understood",
        "model",
        "either",
        "proper",
        "name",
        "demonstrative",
        "abbreviation",
        "definite",
        "description",
        "anscombe",
        "argues",
        "kind",
        "referring",
        "expression",
        "requires",
        "call",
        "conception",
        "mean",
        "reach",
        "referent",
        "conception",
        "must",
        "explain",
        "seemingly",
        "guaranteed",
        "reference",
        "apparent",
        "fact",
        "token",
        "fail",
        "pick",
        "object",
        "however",
        "argues",
        "satisfactory",
        "conception",
        "specified",
        "since",
        "either",
        "fails",
        "deliver",
        "guaranteed",
        "reference",
        "succeeds",
        "delivering",
        "immaterial",
        "soul",
        "since",
        "independent",
        "reason",
        "believe",
        "immaterial",
        "soul",
        "follows",
        "understood",
        "model",
        "proper",
        "name",
        "demonstrative",
        "definite",
        "description",
        "referring",
        "expression",
        "see",
        "kenny",
        "malcolm",
        "positive",
        "appraisal",
        "anscombe",
        "position",
        "criticism",
        "found",
        "white",
        "hamilton",
        "brandom",
        "glock",
        "hacker",
        "mcdowell",
        "harcourt",
        "function",
        "either",
        "name",
        "abbreviated",
        "definite",
        "description",
        "widely",
        "accepted",
        "contentious",
        "aspect",
        "anscombe",
        "case",
        "view",
        "appropriate",
        "conception",
        "claim",
        "function",
        "like",
        "demonstrative",
        "argument",
        "claim",
        "highly",
        "reminiscent",
        "avicenna",
        "flying",
        "man",
        "argument",
        "see",
        "surely",
        "familiar",
        "tell",
        "u",
        "imagine",
        "subject",
        "sensory",
        "deprivation",
        "tank",
        "anaesthetised",
        "suffering",
        "amnesia",
        "subject",
        "would",
        "claim",
        "anscombe",
        "able",
        "think",
        "ithoughts",
        "perhaps",
        "wondering",
        "get",
        "mess",
        "since",
        "subject",
        "think",
        "selfconsciously",
        "absence",
        "presented",
        "referent",
        "follows",
        "mean",
        "something",
        "like",
        "person",
        "since",
        "demonstrative",
        "require",
        "demonstrated",
        "object",
        "presented",
        "conscious",
        "awareness",
        "treating",
        "demonstrative",
        "model",
        "fails",
        "cf",
        "campbell",
        "brien",
        "b",
        "see",
        "morgan",
        "defence",
        "demonstrative",
        "account",
        "according",
        "evans",
        "ch",
        "problem",
        "anscombe",
        "argument",
        "fails",
        "appreciate",
        "modelled",
        "rather",
        "according",
        "evans",
        "account",
        "similarity",
        "call",
        "ideas",
        "ideas",
        "show",
        "functional",
        "role",
        "alternative",
        "broadly",
        "functional",
        "account",
        "see",
        "mellor",
        "argument",
        "far",
        "amenable",
        "functional",
        "analysis",
        "selfconsciousness",
        "pose",
        "threat",
        "coherence",
        "functionalism",
        "see",
        "bealer",
        "see",
        "ideas",
        "ideas",
        "stand",
        "centre",
        "distinctive",
        "network",
        "input",
        "way",
        "gaining",
        "information",
        "location",
        "respectively",
        "output",
        "including",
        "explanation",
        "action",
        "see",
        "model",
        "thus",
        "escaping",
        "anscombe",
        "argument",
        "discussion",
        "see",
        "supplement",
        "evans",
        "first",
        "person",
        "thought"
    ]
}