{
    "main_text": "Philosophical issues and objections\n2. Philosophical issues and objections\n\nThe concept of prereflective self-consciousness is related to a\nvariety of philosophical issues, including epistemic asymmetry,\nimmunity to error through misidentification and the possibility of\nself-reference. Let us examine these issues in turn and also consider\nsome recent objections.\n\nIt seems clear that the objects of my visual perception are\nintersubjectively accessible in the sense that they can in principle\nbe the objects of another’s perception. A subject’s\nperceptual experience itself, however, is given in a unique way to the\nsubject herself. Although two people, A and B, can\nperceive a numerically identical object, they each have their own\ndistinct perceptual experience of it; just as they cannot share each\nother’s pain, they cannot literally share these perceptual\nexperiences. Their experiences are epistemically asymmetrical in this\nregard. B might realize that A is in pain; he might\nsympathize with A, he might even have the same kind of pain\n(same qualitative aspects, same intensity, same proprioceptive\nlocation), but he cannot literally feel A’s pain the\nsame way A does. The subject’s epistemic access to her\nown experience, whether it is a pain or a perceptual experience, is\nprimarily a matter of prereflective self-consciousness. If\nsecondarily, in an act of introspective reflection I begin to examine\nmy perceptual experience, I will recognize it as my perceptual\nexperience only because I have been prereflectively aware of it, as I\nhave been living through it. Thus, phenomenology maintains, the access\nthat reflective self-consciousness has to first-order phenomenal\nexperience is routed through prereflective consciousness, for if we\nwere not prereflectively aware of our experience, our reflection on it\nwould never be motivated. When I do reflect, I reflect on something\nwith which I am already experientially familiar.\n\nThe ease with which we self-ascribe experiences is partially to be\nexplained by appeal to prereflective self-consciousness. It is\nimportant to emphasize, however, that prereflective self-consciousness\nis only a necessary and not a sufficient condition for reflective\nself-ascription and first-person knowledge. Many animals who possess\nprereflective self-consciousness obviously lack the cognitive\nresources needed for reflective self-ascriptions (see, e.g., Bekoff\n2003).\n\nWhen I experience an occurrent pain, perception, or thought, the\nexperience in question is given immediately and noninferentially. I do\nnot have to judge or appeal to some criterion in order to identify it\nas my experience. There are no free-floating experiences;\neven the experience of freely-floating belongs to someone. As William\nJames (1890) put it, all experience is “personal.” Even in\npathological cases, as in depersonalization or schizophrenic symptoms\nof delusions of control or thought insertion, a feeling or experience\nthat the subject claims not to be his is nonetheless experienced by\nhim as being part of his stream of consciousness. The complaint of\nthought insertion, for example, necessarily acknowledges that the\ninserted thoughts are thoughts that belong to the subject’s\nexperience, even as the agency for such thoughts are attributed to\nothers. This first-person character entails an implicit experiential\nself-reference. If I feel hungry or see my friend, I cannot be\nmistaken about who the subject of that experience is, even if I can be\nmistaken about it being hunger (perhaps it’s really thirst), or\nabout it being my friend (perhaps it’s his twin), or even about\nwhether I am actually seeing him (I may be hallucinating). As\nWittgenstein (1958), Shoemaker (1968), and others have pointed out, it\nis nonsensical to ask whether I am sure that I am the one who\nfeels hungry. This is the phenomenon known as “immunity to error\nthrough misidentification relative to the first-person pronoun.”\nTo this idea of immunity to error through misidentification, the\nphenomenologist adds that whether a certain experience is experienced\nas mine, or not, does not depend upon something apart from the\nexperience, but depends precisely upon the prereflective givenness\nthat belongs to the structure of the experience (Husserl 1959, 175;\nHusserl 1973a, 28, 56, 307, 443; see Zahavi 1999, 6ff.).\n\nSome philosophers who are inclined to take self-consciousness to be\nintrinsically linked to the issue of self-reference would argue that\nthe latter depends on a first-person concept. One attains\nself-consciousness only when one can conceive of oneself\nas oneself, and has the linguistic ability to use the\nfirst-person pronoun to refer to oneself (Baker 2000, 68; cf. Lowe\n2000, 264). On this view, self-consciousness is something that emerges\nin the course of a developmental process, and depends on the\nacquisition of concepts and language. Accordingly, some philosophers\ndeny that young children are capable of self-consciousness (Carruthers\n1996; Dennett 1976; Wilkes 1988; also see Flavell 1993). Evidence from\ndevelopmental psychology and ecological psychology, however, suggests\nthat there is a primitive, proprioceptive form of self-consciousness\nalready in place from\n birth.[1]\n This primitive self-awareness precedes the mastery of language and\nthe ability to form conceptually informed judgments, and it may serve\nas a basis for more advanced types of self-consciousness (see, e.g.,\nButterworth 1995, 1999; Gibson 1986; Meltzoff 1990a, 1990b; Neisser\n1988; and Stern 1985). The phenomenological view is consistent with\nsuch findings.\n\nDoes prereflective self-consciousness contain a reference to self? As\nalready mentioned, our experiential life isn’t distinguished\nmerely by its qualitative features but also by its\nsubjective character. Intentional experiences are\nJanus-faced. They are of something other than the subject and\nthey are like something for the subject. When feeling a\nstomach-ache, I am not faced with a two-step process in which the\npresence of an unpleasant experience is first detected, and I then\nwonder whose experience it might be. To put it differently, in virtue\nof their self-presentational character experiences are neither\nanonymous nor impersonal, they are precisely\nfirst-personal.\n\nOn a standard metaphysical conception of the self, the self is viewed\nas an enduring substance (say a physical brain or an immaterial soul)\ndistinct from its changing experiences but capable of retaining its\nidentity across those experiences. In contrast, some phenomenologists\nhave argued that one can define a (minimal) form of selfhood in\nprocessual and experiential terms as the very first-personal mode of\nexperiencing (Zahavi 2005, 2014). The French phenomenologist Michel\nHenry argued that the most basic form of selfhood is the one\nconstituted by the very self-manifestation of experience (Henry 1963:\n581; 1965: 53), i.e., self-consciousness is not something that the\nself has, but what the self is. It is not a thing that has experiences\nbut is the very subject(ivity) of experience, which is something no\nexperience can lack, neither metaphysically nor\nphenomenologically.\n\nOn this construal, the self is something that is necessarily present\nin each experience. It is present, not as a separately existing\nentity, i.e., as something that exists independently of, in separation\nfrom or in opposition to the stream of consciousness. Nor is it given\nas an additional experiential object or as an extra experiential\ningredient, as if there were a distinct self-quale, next to and in\naddition to the quale of the smell of burnt hay or roasted almonds.\nNo, the claim is that all experiences regardless of their object and\nregardless of their attitudinal character are necessarily subjective\nor self-involving in the sense that they feel like something for\nsomeone, they necessarily involve a point of view.\n\nTo be self-aware, on this account, is not to capture a pure self or\nself-object that exists separately from the stream of experience,\nrather it is to be conscious of one’s experience in its\nintrinsic first-person mode of givenness. Accordingly, we should not\nthink of the self, in this most basic sense, as a substance, or as\nsome kind of ineffable transcendental precondition, or as a social\nconstruct that gets generated through time; rather it is an integral\naspect of conscious life and involves this immediate experiential\ncharacter.\n\nAt this point it will be clarifying to compare the phenomenological\nnotion of prereflective self-consciousness with the one defended by\nBrentano. According to Brentano as I listen to a melody I am aware\nthat I am listening to it. He acknowledges that I do not have two\ndifferent mental states: my consciousness of the melody is one and the\nsame as my awareness of perceiving it; they constitute one single\npsychical phenomenon. On this point, and in opposition to higher-order\nrepresentation theories, Brentano and the phenomenologists are in\ngeneral agreement. But for Brentano, by means of this unified mental\nstate, I have an awareness of two objects: the melody and my\nperceptual experience.\n\nIn the same mental phenomenon in which the sound is present to our\nminds we simultaneously apprehend the mental phenomenon itself. What\nis more, we apprehend it in accordance with its dual nature insofar as\nit has the sound as content within it, and insofar as it has itself as\ncontent at the same time. We can say that the sound is the primary\nobject of the act of hearing, and that the act of\nhearing itself is the secondary object (Brentano 1874,\n179–180 [1973, 127–128]).\n\nHusserl disagrees on just this point, as do Sartre and Heidegger: my\nawareness of my experience is not an awareness of it as an\n object.[2]\n My awareness is non-objectifying in the sense that I do not occupy\nthe position or perspective of a spectator or in(tro)spector who\nattends to this experience in a thematic way. That a psychological\nstate is experienced, “and is in this sense conscious, does not\nand cannot mean that this is the object of an act of consciousness, in\nthe sense that a perception, a presentation or a judgment is directed\nupon it” (Husserl 1984a, 165 [2001, I, 273]). In prereflective\nself-awareness, experience is given, not as an object, but precisely\nas subjective experience. For phenomenologists, intentional experience\nis lived through (erlebt), but does not appear in an\nobjectified manner. Experience is conscious of itself without being\nthe intentional object of consciousness (Husserl 1984b, 399; Sartre\n1936, 28–29). The more general claim that has been made is that\nobject-consciousness necessarily entails an epistemic divide between\nthat which appears and that to whom it appears, between the object and\nthe subject of experience, and that this is why object-consciousness\nmight be singularly unsuited as a model for basic self-consciousness\n(Zahavi 1999; Legrand 2011, 207). Again, this is not meant to suggest\nthat we cannot direct our attention towards our experiences, and\nthereby take them as objects of reflection (Husserl 1984b, 424), but\nthis mode of objectifying self-consciousness has a non-objectifying\nprereflective self-consciousness as its condition of possibility.\n\nThe notion of prereflective self-consciousness is much more accepted\ntoday than it was 20 years ago and has become part of the standard\nrepertoire in philosophy of mind. The notion’s increasing\npopularity not surprisingly has also led to an increasing amount of\ncriticism. One criticism that has been directed against the\nphenomenological proposal precisely turns on the alleged\nnon-objectifying character of the awareness. Uriah Kriegel has for the\npast twenty years done much to revitalize Brentano’s account and\nhas defended a form of self-representationalism that can be described\nas neo-Brentanian. For Kriegel, a conscious perception of a tone is a\nmental state with a twofold representational content, it has an\noutward-directed content (the tone) and an inward-directed content\n(the perception). For that reason, prereflective self-consciousness\nmust be viewed as a species of object-consciousness, and Kriegel\nexplicitly argues that the non-objectifying alternative, or as he\nlabels it, the reference to a sui generis intrinsic glow\n(Kriegel 2009: 102), should only be considered as a last resort, since\nit remains too mysterious. It is noticeable, however, that Kriegel\nhimself eventually admits that the relationship between the inner\nawareness and what it is aware of is far more intimate that the\nstandard relationship between a representation and what it represents\n(Kriegel 2009: 107–8), and that self-representation consequently\nconstitutes a very unusual form of object-awareness. At that point,\none might wonder whether the difference between a highly unusual form\nof object-awareness and a non-objectifying form of awareness is all\nthat\n substantial.[3]\n\nAnother line of attack has focused on what might be called the\nuniversality question. Is it truly the case that all conscious mental\nstates involve prereflective self-consciousness, for-me-ness, or what\nis sometimes referred to as a sense of mineness or sense of ownership?\nDoes the link hold by necessity such that it characterizes all\nexperiences, however primitive or disordered they might be, or might\nit, for instance, be something that only holds true for a more limited\ngroup of experiences, say, normal, adult, experiences (Lane 2012;\nDainton 2016; Guillot 2017; Howell & Thompson 2017). Whether\ninfantile or pathological or meditative or hallucinogenic experiences\nconstitute relevant exceptions, i.e., experiences that lack\nprereflective self-consciousness, for-me-ness and sense of ownership,\nis to a large extent dependent upon how robustly one interprets these\nnotions. If prereflective self-consciousness is interpreted simply as\na non-inferential awareness of the experience one is having rather\nthan as an awareness of some self-object, and if for-me-ness and sense\nof ownership are interpreted not as involving an awareness of the\npossessive relation between oneself and the experience, but rather as\nthe distinct perspectival givenness or first-personal presence of\nexperience, it is far from obvious that there really are exceptions to\nbe\n found.[4]\n\nFinally, some critics have also claimed that the sense of ownership is\nan inflationary by-product of reflective or introspective processes\n(e.g., Bermúdez 2011; 2018; Dainton 2007). They insist that\nthere is nothing like a prereflective sense of ownership that is\n“something over and above the changing stream of thought,\nperception, volition, emotion, memory, bodily sensation, and so\non” (Dainton 2007, 240; emphasis added). But as should already\nbe clear, phenomenologists do not claim that prereflective\nself-consciousness or the sense of ownership is something “over\nand above” experience, something extra that is added as a second\nexperience. Rather, the claim is that it is an intrinsic feature of\nexperience itself. In this respect, the phenomenological claim is as\ndeflationary as the critics would want (Gallagher 2017a).\n",
    "section_title": "2. Philosophical issues and objections",
    "entry_title": "Phenomenological Approaches to Self-Consciousness",
    "hierarchy_title": "Phenomenological Approaches to Self-Consciousness || Philosophical issues and objections",
    "tokenized_text": [
        "philosophical",
        "issue",
        "objection",
        "philosophical",
        "issue",
        "objection",
        "concept",
        "prereflective",
        "selfconsciousness",
        "related",
        "variety",
        "philosophical",
        "issue",
        "including",
        "epistemic",
        "asymmetry",
        "immunity",
        "error",
        "misidentification",
        "possibility",
        "selfreference",
        "let",
        "u",
        "examine",
        "issue",
        "turn",
        "also",
        "consider",
        "recent",
        "objection",
        "seems",
        "clear",
        "object",
        "visual",
        "perception",
        "intersubjectively",
        "accessible",
        "sense",
        "principle",
        "object",
        "another",
        "perception",
        "subject",
        "perceptual",
        "experience",
        "however",
        "given",
        "unique",
        "way",
        "subject",
        "although",
        "two",
        "people",
        "b",
        "perceive",
        "numerically",
        "identical",
        "object",
        "distinct",
        "perceptual",
        "experience",
        "share",
        "pain",
        "literally",
        "share",
        "perceptual",
        "experience",
        "experience",
        "epistemically",
        "asymmetrical",
        "regard",
        "b",
        "might",
        "realize",
        "pain",
        "might",
        "sympathize",
        "might",
        "even",
        "kind",
        "pain",
        "qualitative",
        "aspect",
        "intensity",
        "proprioceptive",
        "location",
        "literally",
        "feel",
        "pain",
        "way",
        "subject",
        "epistemic",
        "access",
        "experience",
        "whether",
        "pain",
        "perceptual",
        "experience",
        "primarily",
        "matter",
        "prereflective",
        "selfconsciousness",
        "secondarily",
        "act",
        "introspective",
        "reflection",
        "begin",
        "examine",
        "perceptual",
        "experience",
        "recognize",
        "perceptual",
        "experience",
        "prereflectively",
        "aware",
        "living",
        "thus",
        "phenomenology",
        "maintains",
        "access",
        "reflective",
        "selfconsciousness",
        "firstorder",
        "phenomenal",
        "experience",
        "routed",
        "prereflective",
        "consciousness",
        "prereflectively",
        "aware",
        "experience",
        "reflection",
        "would",
        "never",
        "motivated",
        "reflect",
        "reflect",
        "something",
        "already",
        "experientially",
        "familiar",
        "ease",
        "selfascribe",
        "experience",
        "partially",
        "explained",
        "appeal",
        "prereflective",
        "selfconsciousness",
        "important",
        "emphasize",
        "however",
        "prereflective",
        "selfconsciousness",
        "necessary",
        "sufficient",
        "condition",
        "reflective",
        "selfascription",
        "firstperson",
        "knowledge",
        "many",
        "animal",
        "posse",
        "prereflective",
        "selfconsciousness",
        "obviously",
        "lack",
        "cognitive",
        "resource",
        "needed",
        "reflective",
        "selfascriptions",
        "see",
        "eg",
        "bekoff",
        "experience",
        "occurrent",
        "pain",
        "perception",
        "thought",
        "experience",
        "question",
        "given",
        "immediately",
        "noninferentially",
        "judge",
        "appeal",
        "criterion",
        "order",
        "identify",
        "experience",
        "freefloating",
        "experience",
        "even",
        "experience",
        "freelyfloating",
        "belongs",
        "someone",
        "william",
        "james",
        "put",
        "experience",
        "personal",
        "even",
        "pathological",
        "case",
        "depersonalization",
        "schizophrenic",
        "symptom",
        "delusion",
        "control",
        "thought",
        "insertion",
        "feeling",
        "experience",
        "subject",
        "claim",
        "nonetheless",
        "experienced",
        "part",
        "stream",
        "consciousness",
        "complaint",
        "thought",
        "insertion",
        "example",
        "necessarily",
        "acknowledges",
        "inserted",
        "thought",
        "thought",
        "belong",
        "subject",
        "experience",
        "even",
        "agency",
        "thought",
        "attributed",
        "others",
        "firstperson",
        "character",
        "entail",
        "implicit",
        "experiential",
        "selfreference",
        "feel",
        "hungry",
        "see",
        "friend",
        "mistaken",
        "subject",
        "experience",
        "even",
        "mistaken",
        "hunger",
        "perhaps",
        "really",
        "thirst",
        "friend",
        "perhaps",
        "twin",
        "even",
        "whether",
        "actually",
        "seeing",
        "may",
        "hallucinating",
        "wittgenstein",
        "shoemaker",
        "others",
        "pointed",
        "nonsensical",
        "ask",
        "whether",
        "sure",
        "one",
        "feel",
        "hungry",
        "phenomenon",
        "known",
        "immunity",
        "error",
        "misidentification",
        "relative",
        "firstperson",
        "pronoun",
        "idea",
        "immunity",
        "error",
        "misidentification",
        "phenomenologist",
        "add",
        "whether",
        "certain",
        "experience",
        "experienced",
        "mine",
        "depend",
        "upon",
        "something",
        "apart",
        "experience",
        "depends",
        "precisely",
        "upon",
        "prereflective",
        "givenness",
        "belongs",
        "structure",
        "experience",
        "husserl",
        "husserl",
        "a",
        "see",
        "zahavi",
        "ff",
        "philosopher",
        "inclined",
        "take",
        "selfconsciousness",
        "intrinsically",
        "linked",
        "issue",
        "selfreference",
        "would",
        "argue",
        "latter",
        "depends",
        "firstperson",
        "concept",
        "one",
        "attains",
        "selfconsciousness",
        "one",
        "conceive",
        "oneself",
        "oneself",
        "linguistic",
        "ability",
        "use",
        "firstperson",
        "pronoun",
        "refer",
        "oneself",
        "baker",
        "cf",
        "lowe",
        "view",
        "selfconsciousness",
        "something",
        "emerges",
        "course",
        "developmental",
        "process",
        "depends",
        "acquisition",
        "concept",
        "language",
        "accordingly",
        "philosopher",
        "deny",
        "young",
        "child",
        "capable",
        "selfconsciousness",
        "carruthers",
        "dennett",
        "wilkes",
        "also",
        "see",
        "flavell",
        "evidence",
        "developmental",
        "psychology",
        "ecological",
        "psychology",
        "however",
        "suggests",
        "primitive",
        "proprioceptive",
        "form",
        "selfconsciousness",
        "already",
        "place",
        "birth",
        "primitive",
        "selfawareness",
        "precedes",
        "mastery",
        "language",
        "ability",
        "form",
        "conceptually",
        "informed",
        "judgment",
        "may",
        "serve",
        "basis",
        "advanced",
        "type",
        "selfconsciousness",
        "see",
        "eg",
        "butterworth",
        "gibson",
        "meltzoff",
        "a",
        "b",
        "neisser",
        "stern",
        "phenomenological",
        "view",
        "consistent",
        "finding",
        "prereflective",
        "selfconsciousness",
        "contain",
        "reference",
        "self",
        "already",
        "mentioned",
        "experiential",
        "life",
        "distinguished",
        "merely",
        "qualitative",
        "feature",
        "also",
        "subjective",
        "character",
        "intentional",
        "experience",
        "janusfaced",
        "something",
        "subject",
        "like",
        "something",
        "subject",
        "feeling",
        "stomachache",
        "faced",
        "twostep",
        "process",
        "presence",
        "unpleasant",
        "experience",
        "first",
        "detected",
        "wonder",
        "whose",
        "experience",
        "might",
        "put",
        "differently",
        "virtue",
        "selfpresentational",
        "character",
        "experience",
        "neither",
        "anonymous",
        "impersonal",
        "precisely",
        "firstpersonal",
        "standard",
        "metaphysical",
        "conception",
        "self",
        "self",
        "viewed",
        "enduring",
        "substance",
        "say",
        "physical",
        "brain",
        "immaterial",
        "soul",
        "distinct",
        "changing",
        "experience",
        "capable",
        "retaining",
        "identity",
        "across",
        "experience",
        "contrast",
        "phenomenologists",
        "argued",
        "one",
        "define",
        "minimal",
        "form",
        "selfhood",
        "processual",
        "experiential",
        "term",
        "firstpersonal",
        "mode",
        "experiencing",
        "zahavi",
        "french",
        "phenomenologist",
        "michel",
        "henry",
        "argued",
        "basic",
        "form",
        "selfhood",
        "one",
        "constituted",
        "selfmanifestation",
        "experience",
        "henry",
        "ie",
        "selfconsciousness",
        "something",
        "self",
        "self",
        "thing",
        "experience",
        "subject",
        "ivity",
        "experience",
        "something",
        "experience",
        "lack",
        "neither",
        "metaphysically",
        "phenomenologically",
        "construal",
        "self",
        "something",
        "necessarily",
        "present",
        "experience",
        "present",
        "separately",
        "existing",
        "entity",
        "ie",
        "something",
        "exists",
        "independently",
        "separation",
        "opposition",
        "stream",
        "consciousness",
        "given",
        "additional",
        "experiential",
        "object",
        "extra",
        "experiential",
        "ingredient",
        "distinct",
        "selfquale",
        "next",
        "addition",
        "quale",
        "smell",
        "burnt",
        "hay",
        "roasted",
        "almond",
        "claim",
        "experience",
        "regardless",
        "object",
        "regardless",
        "attitudinal",
        "character",
        "necessarily",
        "subjective",
        "selfinvolving",
        "sense",
        "feel",
        "like",
        "something",
        "someone",
        "necessarily",
        "involve",
        "point",
        "view",
        "selfaware",
        "account",
        "capture",
        "pure",
        "self",
        "selfobject",
        "exists",
        "separately",
        "stream",
        "experience",
        "rather",
        "conscious",
        "one",
        "experience",
        "intrinsic",
        "firstperson",
        "mode",
        "givenness",
        "accordingly",
        "think",
        "self",
        "basic",
        "sense",
        "substance",
        "kind",
        "ineffable",
        "transcendental",
        "precondition",
        "social",
        "construct",
        "get",
        "generated",
        "time",
        "rather",
        "integral",
        "aspect",
        "conscious",
        "life",
        "involves",
        "immediate",
        "experiential",
        "character",
        "point",
        "clarifying",
        "compare",
        "phenomenological",
        "notion",
        "prereflective",
        "selfconsciousness",
        "one",
        "defended",
        "brentano",
        "according",
        "brentano",
        "listen",
        "melody",
        "aware",
        "listening",
        "acknowledges",
        "two",
        "different",
        "mental",
        "state",
        "consciousness",
        "melody",
        "one",
        "awareness",
        "perceiving",
        "constitute",
        "one",
        "single",
        "psychical",
        "phenomenon",
        "point",
        "opposition",
        "higherorder",
        "representation",
        "theory",
        "brentano",
        "phenomenologists",
        "general",
        "agreement",
        "brentano",
        "mean",
        "unified",
        "mental",
        "state",
        "awareness",
        "two",
        "object",
        "melody",
        "perceptual",
        "experience",
        "mental",
        "phenomenon",
        "sound",
        "present",
        "mind",
        "simultaneously",
        "apprehend",
        "mental",
        "phenomenon",
        "apprehend",
        "accordance",
        "dual",
        "nature",
        "insofar",
        "sound",
        "content",
        "within",
        "insofar",
        "content",
        "time",
        "say",
        "sound",
        "primary",
        "object",
        "act",
        "hearing",
        "act",
        "hearing",
        "secondary",
        "object",
        "brentano",
        "husserl",
        "disagrees",
        "point",
        "sartre",
        "heidegger",
        "awareness",
        "experience",
        "awareness",
        "object",
        "awareness",
        "nonobjectifying",
        "sense",
        "occupy",
        "position",
        "perspective",
        "spectator",
        "tro",
        "spector",
        "attends",
        "experience",
        "thematic",
        "way",
        "psychological",
        "state",
        "experienced",
        "sense",
        "conscious",
        "mean",
        "object",
        "act",
        "consciousness",
        "sense",
        "perception",
        "presentation",
        "judgment",
        "directed",
        "upon",
        "husserl",
        "a",
        "prereflective",
        "selfawareness",
        "experience",
        "given",
        "object",
        "precisely",
        "subjective",
        "experience",
        "phenomenologists",
        "intentional",
        "experience",
        "lived",
        "erlebt",
        "appear",
        "objectified",
        "manner",
        "experience",
        "conscious",
        "without",
        "intentional",
        "object",
        "consciousness",
        "husserl",
        "b",
        "sartre",
        "general",
        "claim",
        "made",
        "objectconsciousness",
        "necessarily",
        "entail",
        "epistemic",
        "divide",
        "appears",
        "appears",
        "object",
        "subject",
        "experience",
        "objectconsciousness",
        "might",
        "singularly",
        "unsuited",
        "model",
        "basic",
        "selfconsciousness",
        "zahavi",
        "legrand",
        "meant",
        "suggest",
        "direct",
        "attention",
        "towards",
        "experience",
        "thereby",
        "take",
        "object",
        "reflection",
        "husserl",
        "b",
        "mode",
        "objectifying",
        "selfconsciousness",
        "nonobjectifying",
        "prereflective",
        "selfconsciousness",
        "condition",
        "possibility",
        "notion",
        "prereflective",
        "selfconsciousness",
        "much",
        "accepted",
        "today",
        "year",
        "ago",
        "become",
        "part",
        "standard",
        "repertoire",
        "philosophy",
        "mind",
        "notion",
        "increasing",
        "popularity",
        "surprisingly",
        "also",
        "led",
        "increasing",
        "amount",
        "criticism",
        "one",
        "criticism",
        "directed",
        "phenomenological",
        "proposal",
        "precisely",
        "turn",
        "alleged",
        "nonobjectifying",
        "character",
        "awareness",
        "uriah",
        "kriegel",
        "past",
        "twenty",
        "year",
        "done",
        "much",
        "revitalize",
        "brentano",
        "account",
        "defended",
        "form",
        "selfrepresentationalism",
        "described",
        "neobrentanian",
        "kriegel",
        "conscious",
        "perception",
        "tone",
        "mental",
        "state",
        "twofold",
        "representational",
        "content",
        "outwarddirected",
        "content",
        "tone",
        "inwarddirected",
        "content",
        "perception",
        "reason",
        "prereflective",
        "selfconsciousness",
        "must",
        "viewed",
        "specie",
        "objectconsciousness",
        "kriegel",
        "explicitly",
        "argues",
        "nonobjectifying",
        "alternative",
        "label",
        "reference",
        "sui",
        "generis",
        "intrinsic",
        "glow",
        "kriegel",
        "considered",
        "last",
        "resort",
        "since",
        "remains",
        "mysterious",
        "noticeable",
        "however",
        "kriegel",
        "eventually",
        "admits",
        "relationship",
        "inner",
        "awareness",
        "aware",
        "far",
        "intimate",
        "standard",
        "relationship",
        "representation",
        "represents",
        "kriegel",
        "selfrepresentation",
        "consequently",
        "constitutes",
        "unusual",
        "form",
        "objectawareness",
        "point",
        "one",
        "might",
        "wonder",
        "whether",
        "difference",
        "highly",
        "unusual",
        "form",
        "objectawareness",
        "nonobjectifying",
        "form",
        "awareness",
        "substantial",
        "another",
        "line",
        "attack",
        "focused",
        "might",
        "called",
        "universality",
        "question",
        "truly",
        "case",
        "conscious",
        "mental",
        "state",
        "involve",
        "prereflective",
        "selfconsciousness",
        "formeness",
        "sometimes",
        "referred",
        "sense",
        "mineness",
        "sense",
        "ownership",
        "link",
        "hold",
        "necessity",
        "characterizes",
        "experience",
        "however",
        "primitive",
        "disordered",
        "might",
        "might",
        "instance",
        "something",
        "hold",
        "true",
        "limited",
        "group",
        "experience",
        "say",
        "normal",
        "adult",
        "experience",
        "lane",
        "dainton",
        "guillot",
        "howell",
        "thompson",
        "whether",
        "infantile",
        "pathological",
        "meditative",
        "hallucinogenic",
        "experience",
        "constitute",
        "relevant",
        "exception",
        "ie",
        "experience",
        "lack",
        "prereflective",
        "selfconsciousness",
        "formeness",
        "sense",
        "ownership",
        "large",
        "extent",
        "dependent",
        "upon",
        "robustly",
        "one",
        "interprets",
        "notion",
        "prereflective",
        "selfconsciousness",
        "interpreted",
        "simply",
        "noninferential",
        "awareness",
        "experience",
        "one",
        "rather",
        "awareness",
        "selfobject",
        "formeness",
        "sense",
        "ownership",
        "interpreted",
        "involving",
        "awareness",
        "possessive",
        "relation",
        "oneself",
        "experience",
        "rather",
        "distinct",
        "perspectival",
        "givenness",
        "firstpersonal",
        "presence",
        "experience",
        "far",
        "obvious",
        "really",
        "exception",
        "found",
        "finally",
        "critic",
        "also",
        "claimed",
        "sense",
        "ownership",
        "inflationary",
        "byproduct",
        "reflective",
        "introspective",
        "process",
        "eg",
        "bermúdez",
        "dainton",
        "insist",
        "nothing",
        "like",
        "prereflective",
        "sense",
        "ownership",
        "something",
        "changing",
        "stream",
        "thought",
        "perception",
        "volition",
        "emotion",
        "memory",
        "bodily",
        "sensation",
        "dainton",
        "emphasis",
        "added",
        "already",
        "clear",
        "phenomenologists",
        "claim",
        "prereflective",
        "selfconsciousness",
        "sense",
        "ownership",
        "something",
        "experience",
        "something",
        "extra",
        "added",
        "second",
        "experience",
        "rather",
        "claim",
        "intrinsic",
        "feature",
        "experience",
        "respect",
        "phenomenological",
        "claim",
        "deflationary",
        "critic",
        "would",
        "want",
        "gallagher",
        "a"
    ]
}