{
    "main_text": "Slow Switching Arguments || Reply 3: Externalism about Memory\n3.3 Reply 3: Externalism about Memory\n\nLet us now focus our attention on the second version of the slow\nswitch argument, a.k.a. the memory argument, which is repeated here\nfor the reader’s convenience. Where t2 is a\ntime after a slow switch, and t1 is a time before,\nthen:\n\nIf Oscar forgets nothing, then what Oscar knows at\nt1, Oscar knows at t2.\nOscar forgot nothing.\nOscar does not know at t2 that he thinks\np. \nSo, Oscar does not know at t1 that he thinks\np. [from (a)-(c)]\n\n\n(Slow-switching is a relevant alternative here, since it is assumed\nthat Oscar actually is slow-switched.) Now as one might expect, each\nof the premises have been challenged by various compatibilists.\nRegarding (a), some reject the suggestion that even if p was\nknown at t1, remembering p does not imply\nknowing it at t2 (Bernecker 2010, ch. 3).\nBut even if remembering implies knowing, there are other ways Oscar\ncan lose knowledge besides forgetting (Brueckner 1997a; Burge 1998, n.\n18). For instance, suppose Oscar knows he is driving through a\ncountryside with at least one barn, but some defeating\ncondition is introduced (e.g., he enters Barn Façade\nCounty). Then, he may no longer know at t2\nthat there is a barn in his environs, even if he truly believes it.\nThat’s because, although nothing has been forgotten, a defeating\ncondition exists at t2 that was absent at\nt1.\n\nAn incompatibilist might try to stipulate that Oscar meets all the\nconditions needed to know p on the basis of memory. However,\nthe compatibilist can reply that this is inconsistent with Oscar being\nslow switched (Brueckner 1997a). For a slow switch is a\ndefeating condition, akin to entering Barn Façade County. In\nthat case, the incompatibilist’s argument does not even get\nstarted.\n\nAlternatively, a compatibilist can attack the portrayal of memory\nsuggested by the argument. Here, one might claim that Oscar’s\nmemory content is partly determined not by the Earthly\nenvironment in which the memory was formed. Rather, memory content is\nconditioned by the environment in which recall occurs (Ludlow\n1995a; 1996; 1999; Gibbons 1996; Tye 1998; Bernecker 1998). This means\nthat, even if knowledge of a water thought was initially stored in\nmemory, what is “recalled” on Twin Earth is a twin water\nthought. If so, then a slow switch causes a kind of memory failure,\nsince the knowledge initially stored in memory is not what is\nrecalled. (N.B., memories of second-order thoughts are the most\ndialectically relevant here, though the literature often uses\nfirst-order memories as examples, cf. Kraay 2002.)\n\nThis view of memory as “shifty” between different\nenvironments may be a consequence of EXT. Apparently, we can just as\neasily construct a Putnam-style thought experiment about Oscar’s\nand Twin Oscar’s memories (Ludlow 1995a; 1996; 1999;). Moreover,\nin the slow switch experiment, the presumption is that Oscar’s\nwater thoughts generally change over to twin water\nthoughts—including whatever (first- or second-order) thoughts\nare stored in memory.\n\nIt may be quite unintuitive to see memory in this way, and we shall\nattend to objections shortly. But it is worth noting that the view\nallows an externalist to resist the memory argument. A compatibilist\nmight first grant that Oscar does not forget strictly\nspeaking—after all, we can assume no neurological impairment has\noccurred in him. Yet she can add that Oscar loses some memory content\nregardless, thanks to the slow switch. Even though Oscar does not\ntruly “forget,” he has still lost knowledge by a different\nroute; premise (a) of the memory argument is thus false. (The\n“shifty” view of memory has waned in recent years;\nBernecker 2004; 2010 relinquishes it in favor of something like\nBurge’s 1998 view, described below. Ludlow 2004 trades it for a\nview where a memory is a temporally extended object, one which has\n“stages” that hosts different contents at different times.\nYet see Burge 1998 n. 2 for remarks against such a view.)\n\nThe externalist view of memory can come as a shock; however, it might\nenjoy some intuitive support (Tye 1998). For instance, suppose after\nthe switch that Oscar judges:\n\n\n\nW(†)\nWater is the only thing I now drink; however, many years ago, I\ndrank water fortified by gin. \n\n\n\nSince (W†) is judged after the slow switch, the initial use of\n‘water’ refers to XYZ. But does the second use of\n‘water’ refer to XYZ? It seems so, since (W†) is\ncomparing his current imbibing habits with the past. Such a\ncomparison, of course, requires the liquid named in (W†) to be\nconstant. And since the initial use of ‘water’ denotes\nXYZ, the second use of ‘water’ must also. The upshot is\nthat after the switch, the second clause in (W†) expresses a\nmemory that has “shifted” from water content to a twin\nwater content, as predicted by the compatibilist.\n\nStill, the “shifty” view of memory remains controversial.\nConsider that if Oscar’s memory content is calibrated to Twin\nEarth, so to speak, then some thoughts stored in memory will shift\nfrom being true to being false (Hofmann 1995 (Other\nInternet Resources), Brueckner 1997a, Nagasawa 2000). Oscar on Earth\nexpresses a veridical memory when he asserts:\n\n\n\n(W‡)\n As a child, I thought that water was positively\nscrumptious. \n\n\n\nHowever, after the slow switch, (W‡) self-attributes a twin\nwater thought—and that thought is false. So what was a genuine\nmemory becomes displaced by a false memory.\n\nYet the objection may beg the question of how memory should function\n(Ludlow 1996). For the issue is precisely whether memory is supposed\nto preserve past contents across different environments. The\ncounter-suggestion is that memory instead offers information about\npast events, in terms pertinent to the present environment (Ludlow\n1996; 1999, Bernecker 1998). Ludlow (1999) provides an illustration:\n“If at t1 I believed it was possible to drown\nin water, memory will deliver a t2 belief that it is\npossible to drown in twater—and good thing, too! Twater is no\nless …dangerous than water” (p. 167).\n\nAs a second worry, if Oscar’s memory contents shift, has he\nreally forgotten nothing? A case can be made that the memory shifts\nindeed constitute forgetting (Brueckner 1997a). For even though memory\noffers up a similar substitute content, it seems clear that Oscar\nfails to recall something about water. Yet a failed attempt\nat recall just means that Oscar “forgot.” If so,\nthen it is premise (b) rather than (a) which is the culprit in the\nmemory argument. (Even so, there may remain a different sense in which\nOscar does not forget; Brueckner 1997a, n. 21; see also Kraay\n2002).\n\nNevertheless, it can be debated whether EXT entails the\n“shifty” theory of memory. When Burge first presented his\nTwin Earth experiment, he conceded that it does not show that\nall mental contents satisfy EXT (though it suggests that that\nis typically so) (1979, p. 92, passim). The contents of memory thus\nmight be an exception. And indeed, Burge (1993; 1998) endorses the\nview that memory should “preserve” past thought contents.\nSo in a slow switch case, Burge holds that Oscar’s properly\nfunctioning memory preserves an Earthian thought content, so that the\nvery same content is available later for recall.\n\nAccordingly, Burge rejects premise (c) of the memory argument: If\nOscar truly forgot nothing, then preservative memory means he knows at\nt2 what he knew at t1. Per Falvey\n& Owens (1994), Oscar’s memory may not provide comparative\nknowledge of content, i.e., knowledge that enables armchair\ndiscriminations between water and twin water contents. But memory\nstill preserves knowledge of his thought at\nt1—meaning that (c) is false. (The\nincompatibilist might rejoin that (c) is stipulative in the thought\nexperiment; but in that case, Burge sides with Brueckner 1997a in\nrejecting (b). Yet see Schroeter 2007 for a different issue in cases\nwhere Burge rejects (c).)\n\nWhether one accepts the “shifty” view of memory or not,\nthe debate is important to opening up different interpretations of the\nslow switch thought experiment. For it complicates what effect the\nslow switch has on Oscar’s conceptual repertoire. The default\nview is that the slow switch causes Oscar’s water concept to be\nwholly replaced by the twin water concept. But it may be\nunclear why a slow switch destroys Oscar’s water\nconcept, even as he becomes acquainted with twin water (Boghossian\n1989; 1992a, Gibbons 1996, Burge 1998). More discussion of the issue\nis found in the supplementary document,\n Variations on Slow-Switching.\n\nAs a final thought, memory may ultimately be a red herring in\ndefending incompatibilism. For suppositions about memory seem\ninessential to the so-called “memory argument” (Goldberg\n1997; 1999a; 2000a). After all, the key idea is that Oscar’s\nself-attributions can be open to more than one interpretation: Suppose\nOscar recognizes slow switches as relevant alternatives, and he\nasserts ‘I am thinking that water is scrumptious’. Then,\nfor all Oscar can tell from the armchair, this might express a water\nthought or a twin water thought. Such “underdetermination”\nin the interpretation is what Oscar cannot resolve without empirical\ninvestigation. So already there is a problem with armchair\nself-knowledge, absent any premises about memory.\n\nWhen spelled out, this “memory free” slow switch argument\nassumes the following “principle of knowing\nidentification:”\n\n\n\n(PKI)\nIf a subject S recognizes that there is more than one\nrelevant interpretation of her assertions/beliefs—and S\nhas nothing to decide between them—then S lacks knowledge\nof the content of her assertion/belief. \n\n\n\nIf Oscar satisfies the antecedent of (PKI), it may seem that he is\nmissing only comparative knowledge of content—i.e.,\nknowledge that allows armchair discrimination between a content and a\ntwin content (Brueckner 1999; cf. Falvey & Owens 1994). And we saw\nthat many compatibilists are already willing to surrender that type of\nknowledge. That’s because Oscar’s assertion “I am\nthinking that water is scrumptious” might still count as one\nkind of armchair self-knowledge (cf. section\n 3.1),\n even if it is not of the comparative type.\n\nHowever, (PKI) is applied to a specific kind of case, namely, where\n(i) there is more than one relevant interpretation, and (ii)\nthe subject recognizes this (Goldberg 1999a). There, even a\nrelevant alternatives epistemology requires Oscar to rule out the Twin\nEarth interpretation. Toward making this clearer, suppose that Oscar\nis informed of the switches at some later time t3.\nIn that sort of case, (i) and (ii) will be satisfied. Thus if he\nasserts “I am thinking water is scrumptious,” he will be\naware of relevant alternative interpretations that he cannot rule out\nfrom the armchair. Accordingly, even if his judgment is\nself-verifying, it is tendentious to say he knows from the\narmchair the content of his thought. (But for a rebuttal, see\nBrueckner 2000.)\n\nNotably, since the “memory free” argument is restricted to\na special sort of case, it does not show that EXT and SK are entirely\nincompatible (Goldberg 1999a, p. 217; Goldberg 2000a). It\nstill suggests, however, that EXT precludes SK when certain skeptical\nhypotheses are entertained—contrary to, e.g., the view in\nMeditation Two. \n",
    "section_title": "3.3 Reply 3: Externalism about Memory",
    "entry_title": "Externalism and Self-Knowledge",
    "hierarchy_title": "Externalism and Self-Knowledge || Slow Switching Arguments || Reply 3: Externalism about Memory",
    "tokenized_text": [
        "slow",
        "switching",
        "argument",
        "reply",
        "externalism",
        "memory",
        "reply",
        "externalism",
        "memory",
        "let",
        "u",
        "focus",
        "attention",
        "second",
        "version",
        "slow",
        "switch",
        "argument",
        "aka",
        "memory",
        "argument",
        "repeated",
        "reader",
        "convenience",
        "t",
        "time",
        "slow",
        "switch",
        "t",
        "time",
        "oscar",
        "forgets",
        "nothing",
        "oscar",
        "know",
        "t",
        "oscar",
        "know",
        "t",
        "oscar",
        "forgot",
        "nothing",
        "oscar",
        "know",
        "t",
        "think",
        "p",
        "oscar",
        "know",
        "t",
        "think",
        "p",
        "c",
        "slowswitching",
        "relevant",
        "alternative",
        "since",
        "assumed",
        "oscar",
        "actually",
        "slowswitched",
        "one",
        "might",
        "expect",
        "premise",
        "challenged",
        "various",
        "compatibilists",
        "regarding",
        "reject",
        "suggestion",
        "even",
        "p",
        "known",
        "t",
        "remembering",
        "p",
        "imply",
        "knowing",
        "t",
        "bernecker",
        "ch",
        "even",
        "remembering",
        "implies",
        "knowing",
        "way",
        "oscar",
        "lose",
        "knowledge",
        "besides",
        "forgetting",
        "brueckner",
        "a",
        "burge",
        "n",
        "instance",
        "suppose",
        "oscar",
        "know",
        "driving",
        "countryside",
        "least",
        "one",
        "barn",
        "defeating",
        "condition",
        "introduced",
        "eg",
        "enters",
        "barn",
        "façade",
        "county",
        "may",
        "longer",
        "know",
        "t",
        "barn",
        "environs",
        "even",
        "truly",
        "belief",
        "although",
        "nothing",
        "forgotten",
        "defeating",
        "condition",
        "exists",
        "t",
        "absent",
        "t",
        "incompatibilist",
        "might",
        "try",
        "stipulate",
        "oscar",
        "meet",
        "condition",
        "needed",
        "know",
        "p",
        "basis",
        "memory",
        "however",
        "compatibilist",
        "reply",
        "inconsistent",
        "oscar",
        "slow",
        "switched",
        "brueckner",
        "a",
        "slow",
        "switch",
        "defeating",
        "condition",
        "akin",
        "entering",
        "barn",
        "façade",
        "county",
        "case",
        "incompatibilist",
        "argument",
        "even",
        "get",
        "started",
        "alternatively",
        "compatibilist",
        "attack",
        "portrayal",
        "memory",
        "suggested",
        "argument",
        "one",
        "might",
        "claim",
        "oscar",
        "memory",
        "content",
        "partly",
        "determined",
        "earthly",
        "environment",
        "memory",
        "formed",
        "rather",
        "memory",
        "content",
        "conditioned",
        "environment",
        "recall",
        "occurs",
        "ludlow",
        "a",
        "gibbon",
        "tye",
        "bernecker",
        "mean",
        "even",
        "knowledge",
        "water",
        "thought",
        "initially",
        "stored",
        "memory",
        "recalled",
        "twin",
        "earth",
        "twin",
        "water",
        "thought",
        "slow",
        "switch",
        "cause",
        "kind",
        "memory",
        "failure",
        "since",
        "knowledge",
        "initially",
        "stored",
        "memory",
        "recalled",
        "nb",
        "memory",
        "secondorder",
        "thought",
        "dialectically",
        "relevant",
        "though",
        "literature",
        "often",
        "us",
        "firstorder",
        "memory",
        "example",
        "cf",
        "kraay",
        "view",
        "memory",
        "shifty",
        "different",
        "environment",
        "may",
        "consequence",
        "ext",
        "apparently",
        "easily",
        "construct",
        "putnamstyle",
        "thought",
        "experiment",
        "oscar",
        "twin",
        "oscar",
        "memory",
        "ludlow",
        "a",
        "moreover",
        "slow",
        "switch",
        "experiment",
        "presumption",
        "oscar",
        "water",
        "thought",
        "generally",
        "change",
        "twin",
        "water",
        "thoughtsincluding",
        "whatever",
        "first",
        "secondorder",
        "thought",
        "stored",
        "memory",
        "may",
        "quite",
        "unintuitive",
        "see",
        "memory",
        "way",
        "shall",
        "attend",
        "objection",
        "shortly",
        "worth",
        "noting",
        "view",
        "allows",
        "externalist",
        "resist",
        "memory",
        "argument",
        "compatibilist",
        "might",
        "first",
        "grant",
        "oscar",
        "forget",
        "strictly",
        "speakingafter",
        "assume",
        "neurological",
        "impairment",
        "occurred",
        "yet",
        "add",
        "oscar",
        "loses",
        "memory",
        "content",
        "regardless",
        "thanks",
        "slow",
        "switch",
        "even",
        "though",
        "oscar",
        "truly",
        "forget",
        "still",
        "lost",
        "knowledge",
        "different",
        "route",
        "premise",
        "memory",
        "argument",
        "thus",
        "false",
        "shifty",
        "view",
        "memory",
        "waned",
        "recent",
        "year",
        "bernecker",
        "relinquishes",
        "favor",
        "something",
        "like",
        "burge",
        "view",
        "described",
        "ludlow",
        "trade",
        "view",
        "memory",
        "temporally",
        "extended",
        "object",
        "one",
        "stage",
        "host",
        "different",
        "content",
        "different",
        "time",
        "yet",
        "see",
        "burge",
        "n",
        "remark",
        "view",
        "externalist",
        "view",
        "memory",
        "come",
        "shock",
        "however",
        "might",
        "enjoy",
        "intuitive",
        "support",
        "tye",
        "instance",
        "suppose",
        "switch",
        "oscar",
        "judge",
        "w",
        "water",
        "thing",
        "drink",
        "however",
        "many",
        "year",
        "ago",
        "drank",
        "water",
        "fortified",
        "gin",
        "since",
        "w",
        "judged",
        "slow",
        "switch",
        "initial",
        "use",
        "water",
        "refers",
        "xyz",
        "second",
        "use",
        "water",
        "refer",
        "xyz",
        "seems",
        "since",
        "w",
        "comparing",
        "current",
        "imbibing",
        "habit",
        "past",
        "comparison",
        "course",
        "requires",
        "liquid",
        "named",
        "w",
        "constant",
        "since",
        "initial",
        "use",
        "water",
        "denotes",
        "xyz",
        "second",
        "use",
        "water",
        "must",
        "also",
        "upshot",
        "switch",
        "second",
        "clause",
        "w",
        "express",
        "memory",
        "shifted",
        "water",
        "content",
        "twin",
        "water",
        "content",
        "predicted",
        "compatibilist",
        "still",
        "shifty",
        "view",
        "memory",
        "remains",
        "controversial",
        "consider",
        "oscar",
        "memory",
        "content",
        "calibrated",
        "twin",
        "earth",
        "speak",
        "thought",
        "stored",
        "memory",
        "shift",
        "true",
        "false",
        "hofmann",
        "internet",
        "resource",
        "brueckner",
        "a",
        "nagasawa",
        "oscar",
        "earth",
        "express",
        "veridical",
        "memory",
        "asserts",
        "w",
        "child",
        "thought",
        "water",
        "positively",
        "scrumptious",
        "however",
        "slow",
        "switch",
        "w",
        "selfattributes",
        "twin",
        "water",
        "thoughtand",
        "thought",
        "false",
        "genuine",
        "memory",
        "becomes",
        "displaced",
        "false",
        "memory",
        "yet",
        "objection",
        "may",
        "beg",
        "question",
        "memory",
        "function",
        "ludlow",
        "issue",
        "precisely",
        "whether",
        "memory",
        "supposed",
        "preserve",
        "past",
        "content",
        "across",
        "different",
        "environment",
        "countersuggestion",
        "memory",
        "instead",
        "offer",
        "information",
        "past",
        "event",
        "term",
        "pertinent",
        "present",
        "environment",
        "ludlow",
        "bernecker",
        "ludlow",
        "provides",
        "illustration",
        "t",
        "believed",
        "possible",
        "drown",
        "water",
        "memory",
        "deliver",
        "t",
        "belief",
        "possible",
        "drown",
        "twaterand",
        "good",
        "thing",
        "twater",
        "le",
        "dangerous",
        "water",
        "p",
        "second",
        "worry",
        "oscar",
        "memory",
        "content",
        "shift",
        "really",
        "forgotten",
        "nothing",
        "case",
        "made",
        "memory",
        "shift",
        "indeed",
        "constitute",
        "forgetting",
        "brueckner",
        "a",
        "even",
        "though",
        "memory",
        "offer",
        "similar",
        "substitute",
        "content",
        "seems",
        "clear",
        "oscar",
        "fails",
        "recall",
        "something",
        "water",
        "yet",
        "failed",
        "attempt",
        "recall",
        "mean",
        "oscar",
        "forgot",
        "premise",
        "b",
        "rather",
        "culprit",
        "memory",
        "argument",
        "even",
        "may",
        "remain",
        "different",
        "sense",
        "oscar",
        "forget",
        "brueckner",
        "a",
        "n",
        "see",
        "also",
        "kraay",
        "nevertheless",
        "debated",
        "whether",
        "ext",
        "entail",
        "shifty",
        "theory",
        "memory",
        "burge",
        "first",
        "presented",
        "twin",
        "earth",
        "experiment",
        "conceded",
        "show",
        "mental",
        "content",
        "satisfy",
        "ext",
        "though",
        "suggests",
        "typically",
        "p",
        "passim",
        "content",
        "memory",
        "thus",
        "might",
        "exception",
        "indeed",
        "burge",
        "endorses",
        "view",
        "memory",
        "preserve",
        "past",
        "thought",
        "content",
        "slow",
        "switch",
        "case",
        "burge",
        "hold",
        "oscar",
        "properly",
        "functioning",
        "memory",
        "preserve",
        "earthian",
        "thought",
        "content",
        "content",
        "available",
        "later",
        "recall",
        "accordingly",
        "burge",
        "reject",
        "premise",
        "c",
        "memory",
        "argument",
        "oscar",
        "truly",
        "forgot",
        "nothing",
        "preservative",
        "memory",
        "mean",
        "know",
        "t",
        "knew",
        "t",
        "per",
        "falvey",
        "owen",
        "oscar",
        "memory",
        "may",
        "provide",
        "comparative",
        "knowledge",
        "content",
        "ie",
        "knowledge",
        "enables",
        "armchair",
        "discrimination",
        "water",
        "twin",
        "water",
        "content",
        "memory",
        "still",
        "preserve",
        "knowledge",
        "thought",
        "tmeaning",
        "c",
        "false",
        "incompatibilist",
        "might",
        "rejoin",
        "c",
        "stipulative",
        "thought",
        "experiment",
        "case",
        "burge",
        "side",
        "brueckner",
        "a",
        "rejecting",
        "b",
        "yet",
        "see",
        "schroeter",
        "different",
        "issue",
        "case",
        "burge",
        "reject",
        "c",
        "whether",
        "one",
        "accepts",
        "shifty",
        "view",
        "memory",
        "debate",
        "important",
        "opening",
        "different",
        "interpretation",
        "slow",
        "switch",
        "thought",
        "experiment",
        "complicates",
        "effect",
        "slow",
        "switch",
        "oscar",
        "conceptual",
        "repertoire",
        "default",
        "view",
        "slow",
        "switch",
        "cause",
        "oscar",
        "water",
        "concept",
        "wholly",
        "replaced",
        "twin",
        "water",
        "concept",
        "may",
        "unclear",
        "slow",
        "switch",
        "destroys",
        "oscar",
        "water",
        "concept",
        "even",
        "becomes",
        "acquainted",
        "twin",
        "water",
        "boghossian",
        "a",
        "gibbon",
        "burge",
        "discussion",
        "issue",
        "found",
        "supplementary",
        "document",
        "variation",
        "slowswitching",
        "final",
        "thought",
        "memory",
        "may",
        "ultimately",
        "red",
        "herring",
        "defending",
        "incompatibilism",
        "supposition",
        "memory",
        "seem",
        "inessential",
        "socalled",
        "memory",
        "argument",
        "goldberg",
        "a",
        "a",
        "key",
        "idea",
        "oscar",
        "selfattributions",
        "open",
        "one",
        "interpretation",
        "suppose",
        "oscar",
        "recognizes",
        "slow",
        "switch",
        "relevant",
        "alternative",
        "asserts",
        "thinking",
        "water",
        "scrumptious",
        "oscar",
        "tell",
        "armchair",
        "might",
        "express",
        "water",
        "thought",
        "twin",
        "water",
        "thought",
        "underdetermination",
        "interpretation",
        "oscar",
        "resolve",
        "without",
        "empirical",
        "investigation",
        "already",
        "problem",
        "armchair",
        "selfknowledge",
        "absent",
        "premise",
        "memory",
        "spelled",
        "memory",
        "free",
        "slow",
        "switch",
        "argument",
        "assumes",
        "following",
        "principle",
        "knowing",
        "identification",
        "pki",
        "subject",
        "recognizes",
        "one",
        "relevant",
        "interpretation",
        "assertionsbeliefsand",
        "nothing",
        "decide",
        "themthen",
        "lack",
        "knowledge",
        "content",
        "assertionbelief",
        "oscar",
        "satisfies",
        "antecedent",
        "pki",
        "may",
        "seem",
        "missing",
        "comparative",
        "knowledge",
        "contentie",
        "knowledge",
        "allows",
        "armchair",
        "discrimination",
        "content",
        "twin",
        "content",
        "brueckner",
        "cf",
        "falvey",
        "owen",
        "saw",
        "many",
        "compatibilists",
        "already",
        "willing",
        "surrender",
        "type",
        "knowledge",
        "oscar",
        "assertion",
        "thinking",
        "water",
        "scrumptious",
        "might",
        "still",
        "count",
        "one",
        "kind",
        "armchair",
        "selfknowledge",
        "cf",
        "section",
        "even",
        "comparative",
        "type",
        "however",
        "pki",
        "applied",
        "specific",
        "kind",
        "case",
        "namely",
        "one",
        "relevant",
        "interpretation",
        "ii",
        "subject",
        "recognizes",
        "goldberg",
        "a",
        "even",
        "relevant",
        "alternative",
        "epistemology",
        "requires",
        "oscar",
        "rule",
        "twin",
        "earth",
        "interpretation",
        "toward",
        "making",
        "clearer",
        "suppose",
        "oscar",
        "informed",
        "switch",
        "later",
        "time",
        "t",
        "sort",
        "case",
        "ii",
        "satisfied",
        "thus",
        "asserts",
        "thinking",
        "water",
        "scrumptious",
        "aware",
        "relevant",
        "alternative",
        "interpretation",
        "rule",
        "armchair",
        "accordingly",
        "even",
        "judgment",
        "selfverifying",
        "tendentious",
        "say",
        "know",
        "armchair",
        "content",
        "thought",
        "rebuttal",
        "see",
        "brueckner",
        "notably",
        "since",
        "memory",
        "free",
        "argument",
        "restricted",
        "special",
        "sort",
        "case",
        "show",
        "ext",
        "sk",
        "entirely",
        "incompatible",
        "goldberg",
        "a",
        "p",
        "goldberg",
        "a",
        "still",
        "suggests",
        "however",
        "ext",
        "precludes",
        "sk",
        "certain",
        "skeptical",
        "hypothesis",
        "entertainedcontrary",
        "eg",
        "view",
        "meditation",
        "two"
    ]
}