{
    "main_text": "Epistemology\n4. Epistemology\nIn his theory of knowledge Sellars attempts to balance competing\ninsights in several different dimensions —\nempiricist-rationalist, foundationalist-coherentist,\nexternalist-internalist, realist-phenomenalist-idealist — while\nalso keeping an eye on the deep connections between epistemology and\nthe metaphysics of mind.  His attack on the ‘myth of the\ngiven’ is renowned, so we begin there.  \nAntecedent to epistemology, Sellars’s treatment of semantics\nessentially constitutes a denial of what can be called a semantic\ngiven—the idea that some of our terms or concepts,\nindependently of their occurrence in formal and material inferences,\nderive their meaning directly from confrontation with a particular\n(kind of) object or experience.  Sellars is anti-foundationalist in\nhis theories of concepts, knowledge, and truth.\nTraditional epistemology assumed that knowledge is hierarchically\nstructured.  There must, it was believed, be some cognitive states in\ndirect contact with reality that serve as a firm foundation on which\nthe rest of our knowledge is built by various inferential methods.\nThis foundationalist picture of knowledge imposes two\nrequirements on knowledge: (1) There must be cognitive states that\nare basic in the sense that they possess some positive\nepistemic status independently of their epistemic relations to any\nother cognitive states.  I call this the Epistemic Independence\nRequirement [EIR].  Positive epistemic statuses include being\nknowledge, being justified, or just having some presumption in\nits favor.  (It was popular to claim that basic cognitions must\npossess an unassailable epistemic warrant — certainty,\nincorrigibility, or even infallibility — but this is not as\ncommon today.)  Epistemic relations include deductive and inductive\nimplication.  (2) Every nonbasic cognitive state can possess positive\nepistemic status only because of the epistemic relations it bears,\ndirectly or indirectly, to basic cognitive states.  Thus the basic\nstates must provide the ultimate support for the rest of our\nknowledge, which I call the Epistemic Efficacy Requirement [EER].\nSuch basic, independent and efficacious, cognitive states would be\nthe given.  Many philosophers have believed that there has to\nbe such a given, if there is to be any knowledge at all.  \nSome commentators on Sellars take his attack on the given to turn\non rejecting the belief that any cognitive state could\nhave unassailable warrant or certainty.  Although Sellars was a\nfallibilist and believed that any cognitive state could be challenged,\nhis argument against the given does not worry about this issue.  If\nthe foundationalist picture of the structure of knowledge is itself\nwrong, the strength of foundational warrant is irrelevant.\nSellars denies not only that there must be a given, but that\nthere can be a given in the sense defined, for nothing can\nsatisfy both EIR and EER.  To satisfy EER, a basic cognition must be\ncapable of participating in inferential relations with other\ncognitions; it must possess propositional form and be truth-evaluable.\nTo meet EIR, such a propositionally structured cognition must possess\nits epistemic status independently of inferential connections to other\ncognitions.  No cognitive states satisfy both requirements.\nThe standard candidates for basic empirical knowledge either fail\nEER (e.g., knowledge of sense-data), or presuppose other knowledge on\nthe part of the knower, and thus fail EIR (e.g., knowledge of\nappearances).  Such states count as\ncognitive states only because of their epistemic relations\nto other cognitive states.  Because he argues by cases, it is unclear\nwhether some other candidates might satisfy both requirements.  There\nis no exhaustive list of all possible candidates for the given. Thus,\nthe argument is not a conclusive, once-and-for-all refutation of\nfoundationalism, but it is a significant challenge to it, putting the\nburden of proof on the defenders of a given.  If it works, one has to\nabandon any picture of knowledge acquisition as piecemeal and\nincremental.  Sellars’s argument, in combination with arguments\nby Quine and Davidson, among others, has put foundationalism on the\ndefensive since, roughly, the mid-point of the 20th\ncentury.\nA reconstruction of Wilfrid Sellars’s Argument that the given is a myth, from\n“Empiricism and the Philosophy of Mind”.\n\n\n1.\nA cognitive state is epistemically independent if it\npossesses its epistemic status independently of\nits being inferred or inferrable from some other\ncognitive state.\n[Definition of epistemic independence]\n\n2.\nA cognitive state is epistemically efficacious — is capable\nof epistemically supporting other cognitive states — if the\nepistemic status of those other states can be validly inferred\n(formally or materially) from its epistemic status.\n[Definition of epistemic efficacy]\n\n3\nThe doctrine of the given is that any empirical knowledge that\np requires some (or is itself) basic, that is, epistemically\nindependent, knowledge (that g, h, i, …)\nwhich is epistemically efficacious with respect to p.\n[Definition of doctrine of the given]\n\n4.\nInferential relations are always between items with\npropositional form.\n[By the nature of inference]\n\n5.\nTherefore, non-propositional items (such as sense\ndata) are epistemically inefficacious and cannot\nserve as what is given.\n[From 2 and 4]\n\n6.\nNo inferentially acquired, propositionally structured\nmental state is epistemically independent.\n[From 1]\n\n7.\nExamination of multiple candidates for non-inferentially acquired,\npropositionally structured cognitive states indicates that their\nepistemic status presupposes the possession by the knowing subject of\nother empirical knowledge, both of particulars and of general\nempirical truths.\n[From Sellars’s analyses of statements about\nsense-data and appearances in Parts 1–IV of EPM and his analysis of\nepistemic authority in Part VIII]\n\n8.\nPresupposition is an epistemic and therefore an\ninferential relation.\n[Assumed (See PRE)]\n\n9.\nNon-inferentially acquired empirical knowledge that\npresupposes the possession by the knowing\nsubject of other empirical knowledge is not\nepistemically independent.\n[From 1, 7, and 8]\n\n10.\nAny empirical, propositional cognition is acquired\neither inferentially or non-inferentially.\n[Excluded middle]\n\n11.\nTherefore, propositionally structured cognitions,\nwhether inferentially or non-inferentially\nacquired, are never epistemically independent\nand cannot serve as the given. \n[6, 9, 10, constructive dilemma]\n\n12.\nEvery cognition is either propositionally structured\nor not.\n[Excluded middle]\n\n13.\nTherefore, it is reasonable to believe that no item of\nempirical knowledge can serve the function of a\ngiven.\n[5,11, 12, constructive dilemma]\n\nRejecting the myth of the given is not yet a positive epistemology.\nSellars can abandon the myth of the given only if he gives us a\npositive theory of non-inferential knowledge to replace it.  (There\nmust be non-inferential knowledge, that is, knowledge that is\nnot acquired by inference, even if its epistemic status depends\non its inferential connections to other knowledge.)\nThe paradigm cases of non-inferential knowledge are introspection,\nperception, and memory [IPM] beliefs (see MGEC).  According to\nSellars, such beliefs have epistemic status because, given the\nprocesses by which language and beliefs are acquired, they are likely\nto be true. IPM beliefs are reliable indicators, like the temperature\nreadings on a thermometer.  This is a reliablist or externalist\ncondition on such knowledge.  A chain of empirical justification can\nproperly start with IPM beliefs because they are noninferential\nreliable indicators of the truth of their contents.  Thus, their occurrence licenses an\ninference to the likely truth of their contents, and thence to other\nconsequences by formal or material rules of inference.\nBut Sellars is not, in the end, a reliablist.  Thermometers may be\nhighly reliable, but they have no knowledge.  Sellars adds another\ncondition: the subject must know that her IPM belief is\nreliable.  This imposes a reflexivity requirement on knowledge.\n[T]o be fully a master of his language, Jones must know\n[some] facts about what is involved in learning to use perceptual\nsentences in perceptual contexts. Thus, Jones too must know that other\nspecifiable things being equal, the fact that a person says ‘Lo!\nHere is a red apple’ is a good reason to believe that he is\nindeed in the presence of a red apple. Thus, Jones, too, can reason:\n\nI just thought-out-loud ‘Lo! Here is a red\napple’ (no countervailing conditions obtain); So,\nthere is good reason to believe that there is a red apple in front of\nme. (SK II §40: 325)\n\n\nThe point is not simply that knowers are capable of metajudgments.\nSellars has a larger condition in mind: “The essential point is\nthat in characterizing an episode or a state as that\nof knowing, we are not giving an empirical description of that\nepisode or state; we are placing it in the logical space of reasons,\nof justifying and being able to justify what one says” (EPM:\n§36, in SPR: 169; in KMG: 248).  This dictum needs to be combined\nwith another well-known Sellarsian pronouncement: “Now the idea\nthat epistemic facts can be analysed without remainder—even\n‘in principle’—into non-epistemic facts, whether\nphenomenal or behavioural, public or private, with no matter how\nlavish a sprinkling of subjunctives and hypotheticals is, I believe, a\nradical mistake—a mistake of a piece with the so-called\n‘naturalistic fallacy’ in ethics” (EPM: §5, in\nSPR: 131; in KMG: 209). \nIn order to operate within “the logical space of\nreasons,” one must be at home with normative discourse,\nresponsive to reasons as such, sensitive to standards of correctness\nand appropriateness.  This requirement imposes a\ncoherentist/holist condition that precludes the possibility of\natomistically isolable cognitive states: any cognitive state,\nincluding bottom-level, non-inferential IPM beliefs, can be cognitive\nonly as one element in a complex, reflexively structured system of\nsuch states responsive to epistemic norms and goals.\nSuch a holism of cognitive states raises an obvious problem: how\ncould one start acquiring cognitive states without falling into\ncircularity or regress?  The normativity of the cognitive is crucial\nto Sellars’s answer: we can acquire piecemeal by natural, causal\npathways the individual habits and dispositions that, when present in\nsufficient numbers and appropriately interrelated, warrant the\napplication of the normative language of cognition.\nEven so, Sellars rejects the traditional forms of both\nfoundationalism and coherentism.\nOne seems forced to choose between the picture of an\nelephant which rests on a tortoise (What supports the tortoise?) and\nthe picture of a great Hegelian serpent of knowledge with its tail in\nits mouth (Where does it begin?). Neither will do.  For empirical\nknowledge, like its sophisticated extension, science, is rational, not\nbecause it has a foundation but because it is a self-correcting\nenterprise which can put any claim in jeopardy, though not all at once\n(EPM §38, in SPR: 170; in KMG: 250).\n",
    "section_title": "4. Epistemology",
    "entry_title": "Wilfrid Sellars",
    "hierarchy_title": "Wilfrid Sellars || Epistemology",
    "tokenized_text": [
        "epistemology",
        "epistemology",
        "theory",
        "knowledge",
        "sellars",
        "attempt",
        "balance",
        "competing",
        "insight",
        "several",
        "different",
        "dimension",
        "empiricistrationalist",
        "foundationalistcoherentist",
        "externalistinternalist",
        "realistphenomenalistidealist",
        "also",
        "keeping",
        "eye",
        "deep",
        "connection",
        "epistemology",
        "metaphysics",
        "mind",
        "attack",
        "myth",
        "given",
        "renowned",
        "begin",
        "antecedent",
        "epistemology",
        "sellars",
        "treatment",
        "semantics",
        "essentially",
        "constitutes",
        "denial",
        "called",
        "semantic",
        "giventhe",
        "idea",
        "term",
        "concept",
        "independently",
        "occurrence",
        "formal",
        "material",
        "inference",
        "derive",
        "meaning",
        "directly",
        "confrontation",
        "particular",
        "kind",
        "object",
        "experience",
        "sellars",
        "antifoundationalist",
        "theory",
        "concept",
        "knowledge",
        "truth",
        "traditional",
        "epistemology",
        "assumed",
        "knowledge",
        "hierarchically",
        "structured",
        "must",
        "believed",
        "cognitive",
        "state",
        "direct",
        "contact",
        "reality",
        "serve",
        "firm",
        "foundation",
        "rest",
        "knowledge",
        "built",
        "various",
        "inferential",
        "method",
        "foundationalist",
        "picture",
        "knowledge",
        "imposes",
        "two",
        "requirement",
        "knowledge",
        "must",
        "cognitive",
        "state",
        "basic",
        "sense",
        "posse",
        "positive",
        "epistemic",
        "status",
        "independently",
        "epistemic",
        "relation",
        "cognitive",
        "state",
        "call",
        "epistemic",
        "independence",
        "requirement",
        "eir",
        "positive",
        "epistemic",
        "status",
        "include",
        "knowledge",
        "justified",
        "presumption",
        "favor",
        "popular",
        "claim",
        "basic",
        "cognition",
        "must",
        "posse",
        "unassailable",
        "epistemic",
        "warrant",
        "certainty",
        "incorrigibility",
        "even",
        "infallibility",
        "common",
        "today",
        "epistemic",
        "relation",
        "include",
        "deductive",
        "inductive",
        "implication",
        "every",
        "nonbasic",
        "cognitive",
        "state",
        "posse",
        "positive",
        "epistemic",
        "status",
        "epistemic",
        "relation",
        "bear",
        "directly",
        "indirectly",
        "basic",
        "cognitive",
        "state",
        "thus",
        "basic",
        "state",
        "must",
        "provide",
        "ultimate",
        "support",
        "rest",
        "knowledge",
        "call",
        "epistemic",
        "efficacy",
        "requirement",
        "eer",
        "basic",
        "independent",
        "efficacious",
        "cognitive",
        "state",
        "would",
        "given",
        "many",
        "philosopher",
        "believed",
        "given",
        "knowledge",
        "commentator",
        "sellars",
        "take",
        "attack",
        "given",
        "turn",
        "rejecting",
        "belief",
        "cognitive",
        "state",
        "could",
        "unassailable",
        "warrant",
        "certainty",
        "although",
        "sellars",
        "fallibilist",
        "believed",
        "cognitive",
        "state",
        "could",
        "challenged",
        "argument",
        "given",
        "worry",
        "issue",
        "foundationalist",
        "picture",
        "structure",
        "knowledge",
        "wrong",
        "strength",
        "foundational",
        "warrant",
        "irrelevant",
        "sellars",
        "denies",
        "must",
        "given",
        "given",
        "sense",
        "defined",
        "nothing",
        "satisfy",
        "eir",
        "eer",
        "satisfy",
        "eer",
        "basic",
        "cognition",
        "must",
        "capable",
        "participating",
        "inferential",
        "relation",
        "cognition",
        "must",
        "posse",
        "propositional",
        "form",
        "truthevaluable",
        "meet",
        "eir",
        "propositionally",
        "structured",
        "cognition",
        "must",
        "posse",
        "epistemic",
        "status",
        "independently",
        "inferential",
        "connection",
        "cognition",
        "cognitive",
        "state",
        "satisfy",
        "requirement",
        "standard",
        "candidate",
        "basic",
        "empirical",
        "knowledge",
        "either",
        "fail",
        "eer",
        "eg",
        "knowledge",
        "sensedata",
        "presuppose",
        "knowledge",
        "part",
        "knower",
        "thus",
        "fail",
        "eir",
        "eg",
        "knowledge",
        "appearance",
        "state",
        "count",
        "cognitive",
        "state",
        "epistemic",
        "relation",
        "cognitive",
        "state",
        "argues",
        "case",
        "unclear",
        "whether",
        "candidate",
        "might",
        "satisfy",
        "requirement",
        "exhaustive",
        "list",
        "possible",
        "candidate",
        "given",
        "thus",
        "argument",
        "conclusive",
        "onceandforall",
        "refutation",
        "foundationalism",
        "significant",
        "challenge",
        "putting",
        "burden",
        "proof",
        "defender",
        "given",
        "work",
        "one",
        "abandon",
        "picture",
        "knowledge",
        "acquisition",
        "piecemeal",
        "incremental",
        "sellars",
        "argument",
        "combination",
        "argument",
        "quine",
        "davidson",
        "among",
        "others",
        "put",
        "foundationalism",
        "defensive",
        "since",
        "roughly",
        "midpoint",
        "th",
        "century",
        "reconstruction",
        "wilfrid",
        "sellars",
        "argument",
        "given",
        "myth",
        "empiricism",
        "philosophy",
        "mind",
        "cognitive",
        "state",
        "epistemically",
        "independent",
        "posse",
        "epistemic",
        "status",
        "independently",
        "inferred",
        "inferrable",
        "cognitive",
        "state",
        "definition",
        "epistemic",
        "independence",
        "cognitive",
        "state",
        "epistemically",
        "efficacious",
        "capable",
        "epistemically",
        "supporting",
        "cognitive",
        "state",
        "epistemic",
        "status",
        "state",
        "validly",
        "inferred",
        "formally",
        "materially",
        "epistemic",
        "status",
        "definition",
        "epistemic",
        "efficacy",
        "doctrine",
        "given",
        "empirical",
        "knowledge",
        "p",
        "requires",
        "basic",
        "epistemically",
        "independent",
        "knowledge",
        "g",
        "h",
        "epistemically",
        "efficacious",
        "respect",
        "p",
        "definition",
        "doctrine",
        "given",
        "inferential",
        "relation",
        "always",
        "item",
        "propositional",
        "form",
        "nature",
        "inference",
        "therefore",
        "nonpropositional",
        "item",
        "sense",
        "data",
        "epistemically",
        "inefficacious",
        "serve",
        "given",
        "inferentially",
        "acquired",
        "propositionally",
        "structured",
        "mental",
        "state",
        "epistemically",
        "independent",
        "examination",
        "multiple",
        "candidate",
        "noninferentially",
        "acquired",
        "propositionally",
        "structured",
        "cognitive",
        "state",
        "indicates",
        "epistemic",
        "status",
        "presupposes",
        "possession",
        "knowing",
        "subject",
        "empirical",
        "knowledge",
        "particular",
        "general",
        "empirical",
        "truth",
        "sellars",
        "analysis",
        "statement",
        "sensedata",
        "appearance",
        "part",
        "iv",
        "epm",
        "analysis",
        "epistemic",
        "authority",
        "part",
        "viii",
        "presupposition",
        "epistemic",
        "therefore",
        "inferential",
        "relation",
        "assumed",
        "see",
        "pre",
        "noninferentially",
        "acquired",
        "empirical",
        "knowledge",
        "presupposes",
        "possession",
        "knowing",
        "subject",
        "empirical",
        "knowledge",
        "epistemically",
        "independent",
        "empirical",
        "propositional",
        "cognition",
        "acquired",
        "either",
        "inferentially",
        "noninferentially",
        "excluded",
        "middle",
        "therefore",
        "propositionally",
        "structured",
        "cognition",
        "whether",
        "inferentially",
        "noninferentially",
        "acquired",
        "never",
        "epistemically",
        "independent",
        "serve",
        "given",
        "constructive",
        "dilemma",
        "every",
        "cognition",
        "either",
        "propositionally",
        "structured",
        "excluded",
        "middle",
        "therefore",
        "reasonable",
        "believe",
        "item",
        "empirical",
        "knowledge",
        "serve",
        "function",
        "given",
        "constructive",
        "dilemma",
        "rejecting",
        "myth",
        "given",
        "yet",
        "positive",
        "epistemology",
        "sellars",
        "abandon",
        "myth",
        "given",
        "give",
        "u",
        "positive",
        "theory",
        "noninferential",
        "knowledge",
        "replace",
        "must",
        "noninferential",
        "knowledge",
        "knowledge",
        "acquired",
        "inference",
        "even",
        "epistemic",
        "status",
        "depends",
        "inferential",
        "connection",
        "knowledge",
        "paradigm",
        "case",
        "noninferential",
        "knowledge",
        "introspection",
        "perception",
        "memory",
        "ipm",
        "belief",
        "see",
        "mgec",
        "according",
        "sellars",
        "belief",
        "epistemic",
        "status",
        "given",
        "process",
        "language",
        "belief",
        "acquired",
        "likely",
        "true",
        "ipm",
        "belief",
        "reliable",
        "indicator",
        "like",
        "temperature",
        "reading",
        "thermometer",
        "reliablist",
        "externalist",
        "condition",
        "knowledge",
        "chain",
        "empirical",
        "justification",
        "properly",
        "start",
        "ipm",
        "belief",
        "noninferential",
        "reliable",
        "indicator",
        "truth",
        "content",
        "thus",
        "occurrence",
        "license",
        "inference",
        "likely",
        "truth",
        "content",
        "thence",
        "consequence",
        "formal",
        "material",
        "rule",
        "inference",
        "sellars",
        "end",
        "reliablist",
        "thermometer",
        "may",
        "highly",
        "reliable",
        "knowledge",
        "sellars",
        "add",
        "another",
        "condition",
        "subject",
        "must",
        "know",
        "ipm",
        "belief",
        "reliable",
        "imposes",
        "reflexivity",
        "requirement",
        "knowledge",
        "fully",
        "master",
        "language",
        "jones",
        "must",
        "know",
        "fact",
        "involved",
        "learning",
        "use",
        "perceptual",
        "sentence",
        "perceptual",
        "context",
        "thus",
        "jones",
        "must",
        "know",
        "specifiable",
        "thing",
        "equal",
        "fact",
        "person",
        "say",
        "lo",
        "red",
        "apple",
        "good",
        "reason",
        "believe",
        "indeed",
        "presence",
        "red",
        "apple",
        "thus",
        "jones",
        "reason",
        "thoughtoutloud",
        "lo",
        "red",
        "apple",
        "countervailing",
        "condition",
        "obtain",
        "good",
        "reason",
        "believe",
        "red",
        "apple",
        "front",
        "sk",
        "ii",
        "point",
        "simply",
        "knower",
        "capable",
        "metajudgments",
        "sellars",
        "larger",
        "condition",
        "mind",
        "essential",
        "point",
        "characterizing",
        "episode",
        "state",
        "knowing",
        "giving",
        "empirical",
        "description",
        "episode",
        "state",
        "placing",
        "logical",
        "space",
        "reason",
        "justifying",
        "able",
        "justify",
        "one",
        "say",
        "epm",
        "spr",
        "kmg",
        "dictum",
        "need",
        "combined",
        "another",
        "wellknown",
        "sellarsian",
        "pronouncement",
        "idea",
        "epistemic",
        "fact",
        "analysed",
        "without",
        "remaindereven",
        "principle",
        "into",
        "nonepistemic",
        "fact",
        "whether",
        "phenomenal",
        "behavioural",
        "public",
        "private",
        "matter",
        "lavish",
        "sprinkling",
        "subjunctive",
        "hypothetical",
        "believe",
        "radical",
        "mistakea",
        "mistake",
        "piece",
        "socalled",
        "naturalistic",
        "fallacy",
        "ethic",
        "epm",
        "spr",
        "kmg",
        "order",
        "operate",
        "within",
        "logical",
        "space",
        "reason",
        "one",
        "must",
        "home",
        "normative",
        "discourse",
        "responsive",
        "reason",
        "sensitive",
        "standard",
        "correctness",
        "appropriateness",
        "requirement",
        "imposes",
        "coherentistholist",
        "condition",
        "precludes",
        "possibility",
        "atomistically",
        "isolable",
        "cognitive",
        "state",
        "cognitive",
        "state",
        "including",
        "bottomlevel",
        "noninferential",
        "ipm",
        "belief",
        "cognitive",
        "one",
        "element",
        "complex",
        "reflexively",
        "structured",
        "system",
        "state",
        "responsive",
        "epistemic",
        "norm",
        "goal",
        "holism",
        "cognitive",
        "state",
        "raise",
        "obvious",
        "problem",
        "could",
        "one",
        "start",
        "acquiring",
        "cognitive",
        "state",
        "without",
        "falling",
        "circularity",
        "regress",
        "normativity",
        "cognitive",
        "crucial",
        "sellars",
        "answer",
        "acquire",
        "piecemeal",
        "natural",
        "causal",
        "pathway",
        "individual",
        "habit",
        "disposition",
        "present",
        "sufficient",
        "number",
        "appropriately",
        "interrelated",
        "warrant",
        "application",
        "normative",
        "language",
        "cognition",
        "even",
        "sellars",
        "reject",
        "traditional",
        "form",
        "foundationalism",
        "coherentism",
        "one",
        "seems",
        "forced",
        "choose",
        "picture",
        "elephant",
        "rest",
        "tortoise",
        "support",
        "tortoise",
        "picture",
        "great",
        "hegelian",
        "serpent",
        "knowledge",
        "tail",
        "mouth",
        "begin",
        "neither",
        "empirical",
        "knowledge",
        "like",
        "sophisticated",
        "extension",
        "science",
        "rational",
        "foundation",
        "selfcorrecting",
        "enterprise",
        "put",
        "claim",
        "jeopardy",
        "though",
        "epm",
        "spr",
        "kmg"
    ]
}