{
    "main_text": "Seneca’s Stoicism || Philosophy as a Practice\n2.1 Philosophy as a Practice\n\nReaders who approach Seneca as students of ancient\nphilosophy—having acquired a certain idea of what philosophy\nis by studying Plato, Aristotle, or Chrysippus—often\nfeel at a loss. To them, Seneca’s writings can appear lengthy\nand merely admonitory. Partly, this reaction may reflect prejudices of\nour training. The remnants of a Hegelian (and Nietzschean, and\nHeideggerean) narrative for philosophy are deeply ingrained in\ninfluential works of scholarship. On this account, the history of\nancient philosophy is a history of decline, the Roman thinkers are\nmediocre imitators of their Greek predecessors, and so on (Long 2006;\nsee Griffin 2018 for a collection of Griffin’s work on politics and\nphilosophy in Rome). Such prejudices are hard to shake off; for many\ncenturies watered-down versions of them have shaped the way students\nlearnt Latin and Greek. In recent years, however, many scholars have\ncome to adopt a different view. They find in Seneca a subtle author\nwho speaks very directly to modern concerns of shaping ourselves and\nour lives.\n\nSeneca does not write as a philosopher who creates or expounds a\nphilosophical theory from the ground up. Rather, he writes within the\ntrack of an existing system that he is largely in agreement with. A\nreconstruction of Seneca’s philosophy, if it aimed at some kind\nof completeness, would have to be many-layered. At several points, it\nwould have to include accounts of earlier Stoic philosophy, and\ndiscuss which aspects of these earlier theories become more or less\nprominent in Seneca’s thought. At times Seneca’s own\ncontribution consists in developing further a Stoic theory and adding\ndetail to it. At other times, Seneca dismisses certain technicalities\nand emphasizes the therapeutic, practical side of philosophy.\n\nSeneca thinks of himself as the adherent of a philosophical\nsystem—Stoicism—and speaks in the first person plural\n(‘we’) in order to refer to the Stoics. Rather than call\nSeneca an orthodox Stoic, however, we might want to say that he writes\nwithin the Stoic system. Seneca emphasizes his independence\nas a thinker. He holds Stoic views, but he does not see himself as\nanyone’s disciple or chronicler. In On the Private\nLife, he says: “Surely you can only want me to be like my\nleaders? Well then, I shall not go where they send me but where they\nlead” (1.5, tr. Cooper and Procopé). Seneca sees himself\nas a philosopher like the older Stoics. He feels free, however, to\ndisagree with earlier Stoics, and is not concerned with keeping\nStoicism ‘pure’ from non-Stoic ideas. Seneca integrates\nideas from other philosophies if these seem helpful to him. As he\nexplains, he likes to think of philosophical views as if they were\nmotions made in a meeting. One often asks the proponent of the motion\nto split it up in two motions, so that one can agree with one half,\nand vote against the other (Letter 21.9). For example, Seneca\nthinks that there is something salutary in Platonic metaphysics\n(Boys-Stones 2013; Donini 1979, 179–199; Reydams-Schils 2010;\nSedley 2005; Setaioli 1988). While he dismisses the theory of Forms,\nhe still holds that studying it can make us better. It\nacquaints us with the thought that the things which stimulate and\nenflame the senses are not among the things that really are\n(Letter 58.18 and 26). Seneca also adopts metaphors or images\nthat are associated with other philosophical schools, such as\nPlatonically inspired images of the body as prison of the soul (e.g.,\nNQ I.4 and 11). But invoking such images need not commit\nSeneca to holding the theories in which they originate.\n\nAnother side of Seneca’s independence has been emphasized by\nInwood (2005 [1], 18–22): Seneca, educated by Roman\nphilosophers, is genuinely thinking in Latin. In order to see\nthe force of this point, let us compare Seneca to Cicero. Cicero\nconscientiously tells his readers which Greek term he translates by\nwhich Latin term. It is thus possible to read Cicero’s Latin\nphilosophy with the Greek terminology in mind; at least for the most\npart, we can think about his arguments in the terms of the Greek\ndebates. Seneca is, at many points, not interested in mapping his\nterminology directly onto the Greek philosophical vocabulary. Rather,\nhe thinks in his own language (see Long 2003, who situates Seneca\nvis-à-vis other Roman philosophers), and he expects to be read\nby people who do their philosophizing in Latin, as well.\n\nLike other late Stoics, Seneca is first and foremost interested in\nethics. Although he is well versed in the technical details of Stoic\nlogic, philosophy of language, epistemology, and ontology, he does not\ndevote any significant time to these fields (Barnes 1997, 12–23;\nCooper 2004). However, we should not let the old prejudices about\nRoman versus Greek thought influence our interpretation of\nSeneca’s interest in practical questions. As Veyne puts it,\n“Seneca practiced neither a debased nor a vulgarized philosophy\naimed at the supposed ‘practical spirit’ of the\nRomans” (2003, ix). Rather, it is Seneca’s very conception\nof philosophy as a salutary practice that makes the ethical dimension\nof his thought so prominent (on philosophy as therapy, see Nussbaum\n1994; Setaioli 2014).\n\nSeneca’s writings usually have an addressee—someone who is\nplagued by a ‘sickness of the soul’ (On Peace of\nMind begins with a full diagnosis of the addressee’s state\nof mind—first by the patient, and then by the insightful\ntherapist Seneca). Seneca steps back from a format in which a\nphilosopher justifies a theory in a step-by-step argument (Long 2003,\n204; on the question of why Seneca chooses to write letters, see\nInwood 2007, xiv-xv). Discussion proceeds from a (perhaps merely\npresumed) situation in the addressee’s life, meandering back and\nforth between more general and more specific considerations,\narguments, side-issues, and sometimes consolation (see Wildberger 2020\nfor the view that Seneca’s Letters involve the creation of\na persona who, over the course of the Letters, gains\nincreasing interest in technical questions in philosophy). This\nengaging style views the reader as a participant in philosophical\nthought (Roller 2015; Schafer 2011). Seneca thinks that in order to\nbenefit from philosophy, one cannot passively adopt insights. One must\nappropriate them as an active reader, thinking through the issues for\noneself, so as then to genuinely assent to them (Letter\n84.5–10; Wildberger 2006).\n\nIt has often been noted that later Stoics, including Seneca, seem to\nlose interest in the ideal agent—the sage or wise\nperson—who figures so prominently in early Stoic ethics. Rather\nthan assume that the later Stoics are disillusioned or more realistic,\nwe should note that Seneca’s focus on the progressor\n(proficiens)—the person who is seriously trying their\nbest to move forward in their way of life toward that ideal—is\npart and parcel of his own, specific way of doing philosophy. The\nearly Stoics’ sage may, first and foremost, be a tool for\ndeveloping theories. The early Stoics spell out what knowledge or\nwisdom is by explaining what a knowledgeable or wise person would do\n(how she assents, how she acts, etc.). But Seneca’s philosophy\nis a practice of training ourselves to appreciate to the fullest the\ntruths of Stoicism. In this practice, accounts of, for example, the\nwise person’s assent, can only play a limited role. We need\nprecisely what Seneca offers: someone who takes us through\nthe various situations in life in which we tend to lose sight of our\nown insights, and fall victim to the allurements of money and fame, or\nto the violence of emotions evoked by the adversities of life. We need\nto learn how to overcome our own residual tendencies, despite our\nbetter intentions, to suffer such failures.\n\nThree of Seneca’s writings bear the title\n‘consolatio’—consolation. They, too, are\nletters, and, as Williams argues, Seneca in them transforms the genre\nof philosophical consolation into his own mode of therapy (2006). In\nthe ad Heluiam (To His Mother Helvia), Seneca\nconsoles his mother for his absence and exile. Seneca uses his exile\nas a metaphor, and ultimately addresses what he takes to be a\nmany-faceted condition in human life: any kind of alienation from\none’s immediate community, any enforced detachment from it,\nraises the issues that political exile raises. As this example shows,\nhis consolations are thus rather independent of his particular\nsituation, and of the particular addressee. Still, we might want to\nnote that at times, in consoling his mother for his exile, or, in\nad Marciam (To Marcia), a woman for the loss of her\nchild, Seneca discusses virtue with a view to gender. In her life up\nto now, he tells his mother, she has moved beyond the ordinary faults\nof women; her virtue was her only ornament. In accordance with this,\nshe should now try not to fall into grief in the way women tend\nto—excessively. By holding on to virtue, it seems, his mother\ncan transcend what Seneca considers typical, yet merely contingent\nfeatures of female life. (On Seneca’s depiction of female\nvirtue, cf. ad Heluiam 14–18 and ad Marciam 1\nand 16; Harich 1993; Wilcox 2006).\n",
    "section_title": "2.1 Philosophy as a Practice",
    "entry_title": "Seneca",
    "hierarchy_title": "Seneca || Seneca’s Stoicism || Philosophy as a Practice",
    "tokenized_text": [
        "seneca",
        "stoicism",
        "philosophy",
        "practice",
        "philosophy",
        "practice",
        "reader",
        "approach",
        "seneca",
        "student",
        "ancient",
        "philosophyhaving",
        "acquired",
        "certain",
        "idea",
        "philosophy",
        "studying",
        "plato",
        "aristotle",
        "chrysippusoften",
        "feel",
        "loss",
        "seneca",
        "writing",
        "appear",
        "lengthy",
        "merely",
        "admonitory",
        "partly",
        "reaction",
        "may",
        "reflect",
        "prejudice",
        "training",
        "remnant",
        "hegelian",
        "nietzschean",
        "heideggerean",
        "narrative",
        "philosophy",
        "deeply",
        "ingrained",
        "influential",
        "work",
        "scholarship",
        "account",
        "history",
        "ancient",
        "philosophy",
        "history",
        "decline",
        "roman",
        "thinker",
        "mediocre",
        "imitator",
        "greek",
        "predecessor",
        "long",
        "see",
        "griffin",
        "collection",
        "griffin",
        "work",
        "politics",
        "philosophy",
        "rome",
        "prejudice",
        "hard",
        "shake",
        "many",
        "century",
        "watereddown",
        "version",
        "shaped",
        "way",
        "student",
        "learnt",
        "latin",
        "greek",
        "recent",
        "year",
        "however",
        "many",
        "scholar",
        "come",
        "adopt",
        "different",
        "view",
        "find",
        "seneca",
        "subtle",
        "author",
        "speaks",
        "directly",
        "modern",
        "concern",
        "shaping",
        "life",
        "seneca",
        "write",
        "philosopher",
        "creates",
        "expounds",
        "philosophical",
        "theory",
        "ground",
        "rather",
        "writes",
        "within",
        "track",
        "existing",
        "system",
        "largely",
        "agreement",
        "reconstruction",
        "seneca",
        "philosophy",
        "aimed",
        "kind",
        "completeness",
        "would",
        "manylayered",
        "several",
        "point",
        "would",
        "include",
        "account",
        "earlier",
        "stoic",
        "philosophy",
        "discus",
        "aspect",
        "earlier",
        "theory",
        "become",
        "le",
        "prominent",
        "seneca",
        "thought",
        "time",
        "seneca",
        "contribution",
        "consists",
        "developing",
        "stoic",
        "theory",
        "adding",
        "detail",
        "time",
        "seneca",
        "dismisses",
        "certain",
        "technicality",
        "emphasizes",
        "therapeutic",
        "practical",
        "side",
        "philosophy",
        "seneca",
        "think",
        "adherent",
        "philosophical",
        "systemstoicismand",
        "speaks",
        "first",
        "person",
        "plural",
        "order",
        "refer",
        "stoic",
        "rather",
        "call",
        "seneca",
        "orthodox",
        "stoic",
        "however",
        "might",
        "want",
        "say",
        "writes",
        "within",
        "stoic",
        "system",
        "seneca",
        "emphasizes",
        "independence",
        "thinker",
        "hold",
        "stoic",
        "view",
        "see",
        "anyone",
        "disciple",
        "chronicler",
        "private",
        "life",
        "say",
        "surely",
        "want",
        "like",
        "leader",
        "well",
        "shall",
        "go",
        "send",
        "lead",
        "tr",
        "cooper",
        "procopé",
        "seneca",
        "see",
        "philosopher",
        "like",
        "older",
        "stoic",
        "feel",
        "free",
        "however",
        "disagree",
        "earlier",
        "stoic",
        "concerned",
        "keeping",
        "stoicism",
        "pure",
        "nonstoic",
        "idea",
        "seneca",
        "integrates",
        "idea",
        "philosophy",
        "seem",
        "helpful",
        "explains",
        "like",
        "think",
        "philosophical",
        "view",
        "motion",
        "made",
        "meeting",
        "one",
        "often",
        "asks",
        "proponent",
        "motion",
        "split",
        "two",
        "motion",
        "one",
        "agree",
        "one",
        "half",
        "vote",
        "letter",
        "example",
        "seneca",
        "think",
        "something",
        "salutary",
        "platonic",
        "metaphysics",
        "boysstones",
        "donini",
        "reydamsschils",
        "sedley",
        "setaioli",
        "dismisses",
        "theory",
        "form",
        "still",
        "hold",
        "studying",
        "make",
        "u",
        "better",
        "acquaints",
        "u",
        "thought",
        "thing",
        "stimulate",
        "enflame",
        "sens",
        "among",
        "thing",
        "really",
        "letter",
        "seneca",
        "also",
        "adopts",
        "metaphor",
        "image",
        "associated",
        "philosophical",
        "school",
        "platonically",
        "inspired",
        "image",
        "body",
        "prison",
        "soul",
        "eg",
        "nq",
        "i",
        "invoking",
        "image",
        "need",
        "commit",
        "seneca",
        "holding",
        "theory",
        "originate",
        "another",
        "side",
        "seneca",
        "independence",
        "emphasized",
        "inwood",
        "seneca",
        "educated",
        "roman",
        "philosopher",
        "genuinely",
        "thinking",
        "latin",
        "order",
        "see",
        "force",
        "point",
        "let",
        "u",
        "compare",
        "seneca",
        "cicero",
        "cicero",
        "conscientiously",
        "tell",
        "reader",
        "greek",
        "term",
        "translates",
        "latin",
        "term",
        "thus",
        "possible",
        "read",
        "cicero",
        "latin",
        "philosophy",
        "greek",
        "terminology",
        "mind",
        "least",
        "part",
        "think",
        "argument",
        "term",
        "greek",
        "debate",
        "seneca",
        "many",
        "point",
        "interested",
        "mapping",
        "terminology",
        "directly",
        "onto",
        "greek",
        "philosophical",
        "vocabulary",
        "rather",
        "think",
        "language",
        "see",
        "long",
        "situates",
        "seneca",
        "visàvis",
        "roman",
        "philosopher",
        "expects",
        "read",
        "people",
        "philosophizing",
        "latin",
        "well",
        "like",
        "late",
        "stoic",
        "seneca",
        "first",
        "foremost",
        "interested",
        "ethic",
        "although",
        "well",
        "versed",
        "technical",
        "detail",
        "stoic",
        "logic",
        "philosophy",
        "language",
        "epistemology",
        "ontology",
        "devote",
        "significant",
        "time",
        "field",
        "barnes",
        "cooper",
        "however",
        "let",
        "old",
        "prejudice",
        "roman",
        "versus",
        "greek",
        "thought",
        "influence",
        "interpretation",
        "seneca",
        "interest",
        "practical",
        "question",
        "veyne",
        "put",
        "seneca",
        "practiced",
        "neither",
        "debased",
        "vulgarized",
        "philosophy",
        "aimed",
        "supposed",
        "practical",
        "spirit",
        "roman",
        "ix",
        "rather",
        "seneca",
        "conception",
        "philosophy",
        "salutary",
        "practice",
        "make",
        "ethical",
        "dimension",
        "thought",
        "prominent",
        "philosophy",
        "therapy",
        "see",
        "nussbaum",
        "setaioli",
        "seneca",
        "writing",
        "usually",
        "addresseesomeone",
        "plagued",
        "sickness",
        "soul",
        "peace",
        "mind",
        "begin",
        "full",
        "diagnosis",
        "addressee",
        "state",
        "mindfirst",
        "patient",
        "insightful",
        "therapist",
        "seneca",
        "seneca",
        "step",
        "back",
        "format",
        "philosopher",
        "justifies",
        "theory",
        "stepbystep",
        "argument",
        "long",
        "question",
        "seneca",
        "chooses",
        "write",
        "letter",
        "see",
        "inwood",
        "xivxv",
        "discussion",
        "proceeds",
        "perhaps",
        "merely",
        "presumed",
        "situation",
        "addressee",
        "life",
        "meandering",
        "back",
        "forth",
        "general",
        "specific",
        "consideration",
        "argument",
        "sideissues",
        "sometimes",
        "consolation",
        "see",
        "wildberger",
        "view",
        "seneca",
        "letter",
        "involve",
        "creation",
        "persona",
        "course",
        "letter",
        "gain",
        "increasing",
        "interest",
        "technical",
        "question",
        "philosophy",
        "engaging",
        "style",
        "view",
        "reader",
        "participant",
        "philosophical",
        "thought",
        "roller",
        "schafer",
        "seneca",
        "think",
        "order",
        "benefit",
        "philosophy",
        "one",
        "passively",
        "adopt",
        "insight",
        "one",
        "must",
        "appropriate",
        "active",
        "reader",
        "thinking",
        "issue",
        "oneself",
        "genuinely",
        "assent",
        "letter",
        "wildberger",
        "often",
        "noted",
        "later",
        "stoic",
        "including",
        "seneca",
        "seem",
        "lose",
        "interest",
        "ideal",
        "agentthe",
        "sage",
        "wise",
        "personwho",
        "figure",
        "prominently",
        "early",
        "stoic",
        "ethic",
        "rather",
        "assume",
        "later",
        "stoic",
        "disillusioned",
        "realistic",
        "note",
        "seneca",
        "focus",
        "progressor",
        "proficiens",
        "the",
        "person",
        "seriously",
        "trying",
        "best",
        "move",
        "forward",
        "way",
        "life",
        "toward",
        "idealis",
        "part",
        "parcel",
        "specific",
        "way",
        "philosophy",
        "early",
        "stoic",
        "sage",
        "may",
        "first",
        "foremost",
        "tool",
        "developing",
        "theory",
        "early",
        "stoic",
        "spell",
        "knowledge",
        "wisdom",
        "explaining",
        "knowledgeable",
        "wise",
        "person",
        "would",
        "assent",
        "act",
        "etc",
        "seneca",
        "philosophy",
        "practice",
        "training",
        "appreciate",
        "fullest",
        "truth",
        "stoicism",
        "practice",
        "account",
        "example",
        "wise",
        "person",
        "assent",
        "play",
        "limited",
        "role",
        "need",
        "precisely",
        "seneca",
        "offer",
        "someone",
        "take",
        "u",
        "various",
        "situation",
        "life",
        "tend",
        "lose",
        "sight",
        "insight",
        "fall",
        "victim",
        "allurement",
        "money",
        "fame",
        "violence",
        "emotion",
        "evoked",
        "adversity",
        "life",
        "need",
        "learn",
        "overcome",
        "residual",
        "tendency",
        "despite",
        "better",
        "intention",
        "suffer",
        "failure",
        "three",
        "seneca",
        "writing",
        "bear",
        "title",
        "consolatio",
        "consolation",
        "letter",
        "williams",
        "argues",
        "seneca",
        "transforms",
        "genre",
        "philosophical",
        "consolation",
        "mode",
        "therapy",
        "ad",
        "heluiam",
        "mother",
        "helvia",
        "seneca",
        "console",
        "mother",
        "absence",
        "exile",
        "seneca",
        "us",
        "exile",
        "metaphor",
        "ultimately",
        "address",
        "take",
        "manyfaceted",
        "condition",
        "human",
        "life",
        "kind",
        "alienation",
        "one",
        "immediate",
        "community",
        "enforced",
        "detachment",
        "raise",
        "issue",
        "political",
        "exile",
        "raise",
        "example",
        "show",
        "consolation",
        "thus",
        "rather",
        "independent",
        "particular",
        "situation",
        "particular",
        "addressee",
        "still",
        "might",
        "want",
        "note",
        "time",
        "consoling",
        "mother",
        "exile",
        "ad",
        "marciam",
        "marcia",
        "woman",
        "loss",
        "child",
        "seneca",
        "discus",
        "virtue",
        "view",
        "gender",
        "life",
        "tell",
        "mother",
        "moved",
        "beyond",
        "ordinary",
        "fault",
        "woman",
        "virtue",
        "ornament",
        "accordance",
        "try",
        "fall",
        "grief",
        "way",
        "woman",
        "tend",
        "toexcessively",
        "holding",
        "virtue",
        "seems",
        "mother",
        "transcend",
        "seneca",
        "considers",
        "typical",
        "yet",
        "merely",
        "contingent",
        "feature",
        "female",
        "life",
        "seneca",
        "depiction",
        "female",
        "virtue",
        "cf",
        "ad",
        "heluiam",
        "ad",
        "marciam",
        "harich",
        "wilcox"
    ]
}