{
    "main_text": "Proof Theory and Semantics of Constructive and Intuitionistic ZF || Metamathematical properties of constructive and intuitionistic ZF and semantic techniques\n5.3 Metamathematical properties of constructive and intuitionistic ZF and semantic techniques\n\n\nA variety of interpretations for\nintuitionistic logic have been\nextended to intuitionistic and constructive set theories, such as\nrealisability, Kripke models and Heyting-valued semantics. All these\ntechniques have been applied to obtain metamathematical results about\nthe set theories.\n5.3.1 Disjunction and existence properties of constructive and intuitionistic ZF\n\n\nSome intuitionistic set theories satisfy certain\n“hallmark” metamathematical properties, such as\nthe disjunction and the existence properties. They\ncan also be shown to be consistent with the addition of principles\nwhich go beyond what we most typically consider constructive. Among\nthese are, for example, Church Thesis and Markov’s\nprinciple. For a description of these principles in the context\nof intuitionistic logic, the reader may wish to consult sections 4.2\nand 5.2 of the entry on\nintuitionistic logic or\nTroelstra and van Dalen’s book Constructivism in Mathematics\n(Troelstra and van Dalen 1988).\n\n\nHere we recall the disjunction and existence properties, formulated for\na set theory \\(T\\). The informal motivation for the disjunction and \nthe existence properties is based on our understanding of\nthe constructive proofs of disjunctive and existential statements (respectively). \nIn fact, it seems reasonable to expect that if we constructively prove \na disjunction \\(\\phi \\vee \\psi\\), \nthen we should also be able to prove \\(\\phi\\) or prove \\(\\psi\\). \nSimilarly, if we prove an existential statement, then we should be \nable to prove that a witness to that statement is definable within our theory.\nAlthough such properties seem quite natural and are fairly\neasy to establish for arithmetical theories, they turn out to pose\nconsiderable technical challenges in the case of set theories, due to\ntheir transfinite hierarchies of sets and the extensionality axiom. In\nfact, prominent constructive and intuitionistic set theories turn out \nnot to possess the existence property, as discussed in the next section. \n\n\nLet \\(T\\) be a theory whose language, \\(L(T)\\), encompasses the\nlanguage of set theory. Moreover, for simplicity, we shall assume that\n\\(L(T)\\) has a constant \\(\\omega\\) denoting the set of von Neumann\nnatural numbers and for each \\(n\\) a constant \\(c_n\\) denoting the\n\\(n\\)-th element of \\(\\omega\\).\n\n\nA theory \\(T\\) has the disjunction property\n(DP) if whenever \\(T\\) proves \\((\\phi \\vee \\psi)\\) for sentences\n\\(\\phi\\) and \\(\\psi\\) of \\(L(T)\\), then \\(T\\) proves \\(\\phi\\) or\n\\(T\\) proves \\(\\psi\\).\n\n\nThe existence property has two distinct\nversions in the context of set theory: the numerical\nexistence property (NEP) and the existence\nproperty (EP). Let \\(\\theta(x)\\) be a formula with\nat most \\(x\\) free. We say that:\n(1) \\(T\\) has the NEP if whenever \\(T\\) proves\n\\(\\exists x \\in \\omega \\theta(x)\\), then, for some natural\nnumber \\(n, T\\) proves \\(\\theta(c_n)\\).\n\n\n\n(2) \\(T\\) has the EP if whenever \\(T\\) proves\n\\(\\exists x\\theta\\)(x), then there is a formula \\(\\phi(x)\\)\nwith exactly \\(x\\) free, so that \\(T\\) proves\n\\(\\exists !x(\\phi(x) \\wedge \\theta(x))\\).\n\n\n\nAs realisability techniques have proved crucial in investigations on\nthe existence and disjunction properties for constructive and\nintuitionistic set theories, we discuss the outcomes of these studies\nin the next section.\n5.3.2 Realisability\n\n\nRealisability has been one of the first and principal tools in the\nresearch surrounding set theories based on intuitionistic logic,\nstarting from the early contributions by Friedman and Myhill (Friedman\n1973, Myhill 1973). Realisability semantics for intuitionistic\narithmetic were first proposed by Kleene (Kleene 1945) and extended to\nhigher order Heyting arithmetic by Kreisel and Troelstra (Kreisel and\nTroelstra 1970). For the definition of realisability for arithmetic\nsee section 5.2 of the entry\non intuitionistic logic. A\nrealisability similar to Kreisel and Troelstra was applied to systems\nof higher order arithmetic by Friedman (Friedman 1973). Myhill\nintroduced a variant of this realisability which resembles Kleene’s\nslash (Myhill 1973; Kleene 1962, 1963). He thus proved that a version\nof IZF with replacement in place of collection (called\nIZF\\(_{Rep})\\) has the DP, the NEP and the EP. These results were\nfurther extended in (Myhill 1975; Friedman and Scedrov 1983). While\nFriedman and Myhill gave realisability models for extensional set\ntheories, Beeson developed a notion of realisability for\nnon-extensional set theories. He then studied metatheoretical\nproperties of the extensional set theories via an interpretation in\ntheir non-extensional counterparts. He thus proved that IZF (with\ncollection) has the DP and NEP (Beeson 1985). Subsequently McCarty\nintroduced realisability for IZF directly for extensional set theory\n(McCarty 1984; 1986). Realisability semantics for variants of CZF have\nbeen considered, for example, in (Crosilla and Rathjen 2001; Rathjen\n2006a). The realisability in the latter article is inspired by\nMcCarty’s and has the important feature that, as McCarty’s for IZF, it\nis a self-validating semantics for CZF (that is, this notion of\nrealisability can be formalised in CZF and each theorem of CZF is\nrealised provably in CZF). Rathjen has made use of this notion of\nrealisability to show that CZF (and a number of extensions of it) have\nthe DP and the NEP (Rathjen 2005b).\n\nAnother kind of realisability that has proved very useful is Lifschitz\nrealisability. Lifschitz (1979) introduced a modification of Kleene’s\nrealizability for Heyting arithmetic which has the peculiarity of\nvalidating a weak form of Church’s Thesis (CT) with a uniqueness\ncondition, but not CT itself. Lifschitz realisability was extended to\nsecond order arithmetic by van Oosten (1990). It was subsequently\nextended to full IZF by Cheng and Rathjen, who employed it to obtain a\nnumber of independence results, as well as validating the so called\nLesser Limited Principle of Omniscience (LLPO) (for LLPO see the entry\non \n constructive mathematics).\nThe question of which set theories satisfy the existence property turned out to be particularly difficult to solve. (Friedman and\nScedrov 1985) used Kripke models to show that IZF (that is, the system\nwith collection) does not have the EP, while as mentioned above, the\nsystem IZF\\(_{Rep}\\) (which has replacement in place of\ncollection) does have the EP. This prompted Beeson to pose the\nquestion [Beeson 1985, IX]:\nDoes any reasonable set theory with collection have the existence property?\nA first answer to Beeson’s question came with (Rathjen 2012), where\nthe author introduced the notion of weak existence property:\nthe focus here is finding a provably definable\nset of witnesses for every existential theorem. He then\nintroduced a form of realizability based on general set recursive\nfunctions, where a realizer for an existential statement provides a\nset of witnesses for the existential quantifier, rather than\na single witness. Rathjen combined this notion of realizability with\ntruth to yield that a number of theories with collection do enjoy the\nweak existence property (while IZF does not). Among them, in\nparticular, the theory CZF without subset collection plus Myhill’s\nexponentiation axiom, CZF\\(_{Exp}\\). In fact, Rathjen claimed that\nby combining these results with further work he had carried out, he\ncould show that CZF\\(_{Exp}\\) (and a number of other theories) do\nhave the existence property. A striking observation is that these theories are formulated with collection; consequently the failure\nof the existence property in the case of IZF can not be attributed\nonly to collection, but to the interplay between this scheme and\nunrestricted separation.\nAs to the prominent question of whether\nCZF itself has the existence property, this has been solved in the\nnegative by Swan (2014). There the author made use of three well\ndevised realisability models and embeddings between them, to show that\neven the weak existence property fails for CZF. In so doing he also\nshowed that CZF’s subset collection schema is the culprit. As clearly\nhighlighted in (Swan 2014) the fact that CZF does not have EP does not\nindicate some weakness in CZF as a constructive theory. Even if Swan\nproved essentially that CZF asserts the existence of mathematical\nobjects that it does not know how to construct, still CZF does have\nnatural interpretations in which these objects can be constructed,\nlike, for example, Aczel’s interpretation into type theory (Aczel\n1978).\n\nFor a survey of results in intuitionistic set theory see (Beeson 1985,\nChapter IX). For the corresponding developments in CZF, see (Rathjen\n2005b, 2006, 2012) and (Swan 2014).\n5.3.3 Kripke models and Heyting-valued semantics\n\n\nKripke models for intuitionistic set theories have been used \nin (Friedman and Scedrov 1985) to show that IZF does not have the EP (and\ncombining this with the results in (Myhill 1973) we have that\nIZF\\(_{Rep}\\) does not prove IZF). Kripke models have more\nrecently been applied to clarify the relation between the constructive\nsubstitutes of the power set axiom: Myhill’s exponentiation axiom and\nAczel’s subset collection schema. It is clear that the power set axiom\nimplies both of these principles, and that subset collection implies\nexponentiation. On the other hand, each of the latter two principles \ndoes not imply power set, as the theory CZF with power set in place of subset \ncollection is much stronger \nthan CZF and CZF\\(_{Exp}\\) (Rathjen 2012b). In fact, CZF and\nCZF\\(_{Exp}\\) have the same proof theoretic strength (Griffor and\nRathjen 1994); therefore to investigate the relation between \nsubset collection and exponentiation in constructive set theory \none needed to develop tools other then proof theoretic methods. \nLubarsky (2005) used Kripke models to\nshow that Myhill’s exponentiation axiom does not imply Aczel’s\nsubset collection (on the basis of CZF minus subset collection plus\nfull separtion). In (Lubarsky and Rathjen 2007) the authors applied the\ntechnique of Kripke models to show that also the consequences of the\ntheories CZF and CZF\\(_{Exp}\\) are different. Aczel and Rathjen\n(2001) had shown that the class of Dedekind real numbers forms a set in CZF, \nby using subset collection. Lubarsky and Rathjen (2007) showed that\nCZF\\(_{Exp}\\) does not suffice to prove the same statement. For\nfurther applications of Kripke models to separating crucial constructive \nnotions, see e.g. (Diener and Lubarsky 2013).\n \n\nHeyting-valued semantics for intuitionistic set theories were obtained\nby Grayson (Grayson 1979) as a counterpart for Boolean models for\nclassical set theory. They have been generalized especially via\ncategorical semantics (for an introduction see MacLane and Moerdijk 1992). \nHeyting-valued semantics \nhave found application to independence\nresults in (Scedrov 1981; 1982). A constructive treatment has been\ngiven in (Gambino 2006). See also (Lubarsky 2009). \nSee also Ziegler (2012) for a generalization of realisability and Heyting models for constructive set theory. \n5.3.4 Categorical models of constructive and intuitionistic set theory\n\n\nCategorical models of constructive and intuitionistic set theories\nhave flourished over the years. \nThe notions of topos and sheaf play an \nessential role here (see e.g. Fourman 1980 and Fourman and\nScott 1980). For an overview of the main concepts, see the entry on\n category theory and the references\nprovided there (see in particular the supplement\n Programmatic Reading Guide). \nFor recent developments that relate more\nspecifically to constructive set theories, see e.g. (Simpson\n2005) and (Awodey 2008), as well as the web page:\n algebraic set theory.\n5.4 Variants of Constructive and Intuitionistic Set Theories: Set Theories with Urelements and Non-extensional Set Theories\n\n\nSometimes systems of intuitionistic and constructive set theory have\nbeen presented with the natural numbers as a separate sort of\nurelements, that is, primitive objects with no elements (Friedman 1977; \nMyhill 1975; Beeson 1985). Constructively, this is a\nnatural choice which is in agreement with ideas expressed, for example, by\nBishop (1967) (among others). In Bishop’s monograph the natural\nnumbers are taken as a fundamental concept on which all the\nother mathematical concepts are based. From a technical\npoint of view, if the natural numbers are taken as primitive and\ndistinct from their set-theoretic representations, the axiom of\ninfinity then takes the form: “there is a set of natural numbers\n(as urelements)”. A more general form of urelements in\nconstructive set theories have been considered in (Cantini and Crosilla\n2008). Here a variant of constructive set theory is proposed which combines \nan intensional and partial notion of operation with CZF’s extensional notion of set \n(see also Cantini and Crosilla 2010).\n\n\nThe axiom of extensionality is a common feature of all the systems\ndiscussed so far. However, in a context in which the computational\ncontent of a statement is considered to be crucial, an intensional\ntheory might be more appropriate. For example, constructive type theory and\nexplicit mathematics both encapsulate some form of\nintensionality. Intuitionistic set theories without extensionality\nhave been considered in the literature (Friedman 1973a, Beeson 1985). \nTheir motivation, however, has been not computational\nbut technical in nature, due to the difficulties that extensionality \nbrings about when studying metamathematical properties of intuitionistic set \ntheories. ",
    "section_title": "5.3 Metamathematical properties of constructive and intuitionistic ZF and semantic techniques",
    "entry_title": "Set Theory: Constructive and Intuitionistic ZF",
    "hierarchy_title": "Set Theory: Constructive and Intuitionistic ZF || Proof Theory and Semantics of Constructive and Intuitionistic ZF || Metamathematical properties of constructive and intuitionistic ZF and semantic techniques",
    "tokenized_text": [
        "proof",
        "theory",
        "semantics",
        "constructive",
        "intuitionistic",
        "zf",
        "metamathematical",
        "property",
        "constructive",
        "intuitionistic",
        "zf",
        "semantic",
        "technique",
        "metamathematical",
        "property",
        "constructive",
        "intuitionistic",
        "zf",
        "semantic",
        "technique",
        "variety",
        "interpretation",
        "intuitionistic",
        "logic",
        "extended",
        "intuitionistic",
        "constructive",
        "set",
        "theory",
        "realisability",
        "kripke",
        "model",
        "heytingvalued",
        "semantics",
        "technique",
        "applied",
        "obtain",
        "metamathematical",
        "result",
        "set",
        "theory",
        "disjunction",
        "existence",
        "property",
        "constructive",
        "intuitionistic",
        "zf",
        "intuitionistic",
        "set",
        "theory",
        "satisfy",
        "certain",
        "hallmark",
        "metamathematical",
        "property",
        "disjunction",
        "existence",
        "property",
        "also",
        "shown",
        "consistent",
        "addition",
        "principle",
        "go",
        "beyond",
        "typically",
        "consider",
        "constructive",
        "among",
        "example",
        "church",
        "thesis",
        "markov",
        "principle",
        "description",
        "principle",
        "context",
        "intuitionistic",
        "logic",
        "reader",
        "may",
        "wish",
        "consult",
        "section",
        "entry",
        "intuitionistic",
        "logic",
        "troelstra",
        "van",
        "dalen",
        "book",
        "constructivism",
        "mathematics",
        "troelstra",
        "van",
        "dalen",
        "recall",
        "disjunction",
        "existence",
        "property",
        "formulated",
        "set",
        "theory",
        "t",
        "informal",
        "motivation",
        "disjunction",
        "existence",
        "property",
        "based",
        "understanding",
        "constructive",
        "proof",
        "disjunctive",
        "existential",
        "statement",
        "respectively",
        "fact",
        "seems",
        "reasonable",
        "expect",
        "constructively",
        "prove",
        "disjunction",
        "phi",
        "vee",
        "psi",
        "also",
        "able",
        "prove",
        "phi",
        "prove",
        "psi",
        "similarly",
        "prove",
        "existential",
        "statement",
        "able",
        "prove",
        "witness",
        "statement",
        "definable",
        "within",
        "theory",
        "although",
        "property",
        "seem",
        "quite",
        "natural",
        "fairly",
        "easy",
        "establish",
        "arithmetical",
        "theory",
        "turn",
        "pose",
        "considerable",
        "technical",
        "challenge",
        "case",
        "set",
        "theory",
        "due",
        "transfinite",
        "hierarchy",
        "set",
        "extensionality",
        "axiom",
        "fact",
        "prominent",
        "constructive",
        "intuitionistic",
        "set",
        "theory",
        "turn",
        "posse",
        "existence",
        "property",
        "discussed",
        "next",
        "section",
        "let",
        "t",
        "theory",
        "whose",
        "language",
        "l",
        "encompasses",
        "language",
        "set",
        "theory",
        "moreover",
        "simplicity",
        "shall",
        "assume",
        "l",
        "constant",
        "omega",
        "denoting",
        "set",
        "von",
        "neumann",
        "natural",
        "number",
        "n",
        "constant",
        "c_n",
        "denoting",
        "n",
        "th",
        "element",
        "omega",
        "theory",
        "t",
        "disjunction",
        "property",
        "dp",
        "whenever",
        "t",
        "prof",
        "phi",
        "vee",
        "psi",
        "sentence",
        "phi",
        "psi",
        "l",
        "t",
        "prof",
        "phi",
        "t",
        "prof",
        "psi",
        "existence",
        "property",
        "two",
        "distinct",
        "version",
        "context",
        "set",
        "theory",
        "numerical",
        "existence",
        "property",
        "nep",
        "existence",
        "property",
        "ep",
        "let",
        "theta",
        "x",
        "formula",
        "x",
        "free",
        "say",
        "t",
        "nep",
        "whenever",
        "t",
        "prof",
        "exists",
        "x",
        "in",
        "omega",
        "theta",
        "x",
        "natural",
        "number",
        "n",
        "t",
        "prof",
        "theta",
        "c_n",
        "t",
        "ep",
        "whenever",
        "t",
        "prof",
        "exists",
        "xtheta",
        "x",
        "formula",
        "phi",
        "x",
        "exactly",
        "x",
        "free",
        "t",
        "prof",
        "exists",
        "x",
        "phi",
        "x",
        "wedge",
        "theta",
        "x",
        "realisability",
        "technique",
        "proved",
        "crucial",
        "investigation",
        "existence",
        "disjunction",
        "property",
        "constructive",
        "intuitionistic",
        "set",
        "theory",
        "discus",
        "outcome",
        "study",
        "next",
        "section",
        "realisability",
        "realisability",
        "one",
        "first",
        "principal",
        "tool",
        "research",
        "surrounding",
        "set",
        "theory",
        "based",
        "intuitionistic",
        "logic",
        "starting",
        "early",
        "contribution",
        "friedman",
        "myhill",
        "friedman",
        "myhill",
        "realisability",
        "semantics",
        "intuitionistic",
        "arithmetic",
        "first",
        "proposed",
        "kleene",
        "kleene",
        "extended",
        "higher",
        "order",
        "heyting",
        "arithmetic",
        "kreisel",
        "troelstra",
        "kreisel",
        "troelstra",
        "definition",
        "realisability",
        "arithmetic",
        "see",
        "section",
        "entry",
        "intuitionistic",
        "logic",
        "realisability",
        "similar",
        "kreisel",
        "troelstra",
        "applied",
        "system",
        "higher",
        "order",
        "arithmetic",
        "friedman",
        "friedman",
        "myhill",
        "introduced",
        "variant",
        "realisability",
        "resembles",
        "kleene",
        "slash",
        "myhill",
        "kleene",
        "thus",
        "proved",
        "version",
        "izf",
        "replacement",
        "place",
        "collection",
        "called",
        "izf",
        "_",
        "rep",
        "dp",
        "nep",
        "ep",
        "result",
        "extended",
        "myhill",
        "friedman",
        "scedrov",
        "friedman",
        "myhill",
        "gave",
        "realisability",
        "model",
        "extensional",
        "set",
        "theory",
        "beeson",
        "developed",
        "notion",
        "realisability",
        "nonextensional",
        "set",
        "theory",
        "studied",
        "metatheoretical",
        "property",
        "extensional",
        "set",
        "theory",
        "via",
        "interpretation",
        "nonextensional",
        "counterpart",
        "thus",
        "proved",
        "izf",
        "collection",
        "dp",
        "nep",
        "beeson",
        "subsequently",
        "mccarty",
        "introduced",
        "realisability",
        "izf",
        "directly",
        "extensional",
        "set",
        "theory",
        "mccarty",
        "realisability",
        "semantics",
        "variant",
        "czf",
        "considered",
        "example",
        "crosilla",
        "rathjen",
        "rathjen",
        "a",
        "realisability",
        "latter",
        "article",
        "inspired",
        "mccarty",
        "important",
        "feature",
        "mccarty",
        "izf",
        "selfvalidating",
        "semantics",
        "czf",
        "notion",
        "realisability",
        "formalised",
        "czf",
        "theorem",
        "czf",
        "realised",
        "provably",
        "czf",
        "rathjen",
        "made",
        "use",
        "notion",
        "realisability",
        "show",
        "czf",
        "number",
        "extension",
        "dp",
        "nep",
        "rathjen",
        "b",
        "another",
        "kind",
        "realisability",
        "proved",
        "useful",
        "lifschitz",
        "realisability",
        "lifschitz",
        "introduced",
        "modification",
        "kleene",
        "realizability",
        "heyting",
        "arithmetic",
        "peculiarity",
        "validating",
        "weak",
        "form",
        "church",
        "thesis",
        "ct",
        "uniqueness",
        "condition",
        "ct",
        "lifschitz",
        "realisability",
        "extended",
        "second",
        "order",
        "arithmetic",
        "van",
        "oosten",
        "subsequently",
        "extended",
        "full",
        "izf",
        "cheng",
        "rathjen",
        "employed",
        "obtain",
        "number",
        "independence",
        "result",
        "well",
        "validating",
        "called",
        "lesser",
        "limited",
        "principle",
        "omniscience",
        "llpo",
        "llpo",
        "see",
        "entry",
        "constructive",
        "mathematics",
        "question",
        "set",
        "theory",
        "satisfy",
        "existence",
        "property",
        "turned",
        "particularly",
        "difficult",
        "solve",
        "friedman",
        "scedrov",
        "used",
        "kripke",
        "model",
        "show",
        "izf",
        "system",
        "collection",
        "ep",
        "mentioned",
        "system",
        "izf",
        "_",
        "rep",
        "replacement",
        "place",
        "collection",
        "ep",
        "prompted",
        "beeson",
        "pose",
        "question",
        "beeson",
        "ix",
        "reasonable",
        "set",
        "theory",
        "collection",
        "existence",
        "property",
        "first",
        "answer",
        "beeson",
        "question",
        "came",
        "rathjen",
        "author",
        "introduced",
        "notion",
        "weak",
        "existence",
        "property",
        "focus",
        "finding",
        "provably",
        "definable",
        "set",
        "witness",
        "every",
        "existential",
        "theorem",
        "introduced",
        "form",
        "realizability",
        "based",
        "general",
        "set",
        "recursive",
        "function",
        "realizer",
        "existential",
        "statement",
        "provides",
        "set",
        "witness",
        "existential",
        "quantifier",
        "rather",
        "single",
        "witness",
        "rathjen",
        "combined",
        "notion",
        "realizability",
        "truth",
        "yield",
        "number",
        "theory",
        "collection",
        "enjoy",
        "weak",
        "existence",
        "property",
        "izf",
        "among",
        "particular",
        "theory",
        "czf",
        "without",
        "subset",
        "collection",
        "plus",
        "myhill",
        "exponentiation",
        "axiom",
        "czf",
        "_",
        "exp",
        "fact",
        "rathjen",
        "claimed",
        "combining",
        "result",
        "work",
        "carried",
        "could",
        "show",
        "czf",
        "_",
        "exp",
        "number",
        "theory",
        "existence",
        "property",
        "striking",
        "observation",
        "theory",
        "formulated",
        "collection",
        "consequently",
        "failure",
        "existence",
        "property",
        "case",
        "izf",
        "attributed",
        "collection",
        "interplay",
        "scheme",
        "unrestricted",
        "separation",
        "prominent",
        "question",
        "whether",
        "czf",
        "existence",
        "property",
        "solved",
        "negative",
        "swan",
        "author",
        "made",
        "use",
        "three",
        "well",
        "devised",
        "realisability",
        "model",
        "embeddings",
        "show",
        "even",
        "weak",
        "existence",
        "property",
        "fails",
        "czf",
        "also",
        "showed",
        "czf",
        "subset",
        "collection",
        "schema",
        "culprit",
        "clearly",
        "highlighted",
        "swan",
        "fact",
        "czf",
        "ep",
        "indicate",
        "weakness",
        "czf",
        "constructive",
        "theory",
        "even",
        "swan",
        "proved",
        "essentially",
        "czf",
        "asserts",
        "existence",
        "mathematical",
        "object",
        "know",
        "construct",
        "still",
        "czf",
        "natural",
        "interpretation",
        "object",
        "constructed",
        "like",
        "example",
        "aczel",
        "interpretation",
        "type",
        "theory",
        "aczel",
        "survey",
        "result",
        "intuitionistic",
        "set",
        "theory",
        "see",
        "beeson",
        "chapter",
        "ix",
        "corresponding",
        "development",
        "czf",
        "see",
        "rathjen",
        "b",
        "swan",
        "kripke",
        "model",
        "heytingvalued",
        "semantics",
        "kripke",
        "model",
        "intuitionistic",
        "set",
        "theory",
        "used",
        "friedman",
        "scedrov",
        "show",
        "izf",
        "ep",
        "combining",
        "result",
        "myhill",
        "izf",
        "_",
        "rep",
        "prove",
        "izf",
        "kripke",
        "model",
        "recently",
        "applied",
        "clarify",
        "relation",
        "constructive",
        "substitute",
        "power",
        "set",
        "axiom",
        "myhill",
        "exponentiation",
        "axiom",
        "aczel",
        "subset",
        "collection",
        "schema",
        "clear",
        "power",
        "set",
        "axiom",
        "implies",
        "principle",
        "subset",
        "collection",
        "implies",
        "exponentiation",
        "hand",
        "latter",
        "two",
        "principle",
        "imply",
        "power",
        "set",
        "theory",
        "czf",
        "power",
        "set",
        "place",
        "subset",
        "collection",
        "much",
        "stronger",
        "czf",
        "czf",
        "_",
        "exp",
        "rathjen",
        "b",
        "fact",
        "czf",
        "czf",
        "_",
        "exp",
        "proof",
        "theoretic",
        "strength",
        "griffor",
        "rathjen",
        "therefore",
        "investigate",
        "relation",
        "subset",
        "collection",
        "exponentiation",
        "constructive",
        "set",
        "theory",
        "one",
        "needed",
        "develop",
        "tool",
        "proof",
        "theoretic",
        "method",
        "lubarsky",
        "used",
        "kripke",
        "model",
        "show",
        "myhill",
        "exponentiation",
        "axiom",
        "imply",
        "aczel",
        "subset",
        "collection",
        "basis",
        "czf",
        "minus",
        "subset",
        "collection",
        "plus",
        "full",
        "separtion",
        "lubarsky",
        "rathjen",
        "author",
        "applied",
        "technique",
        "kripke",
        "model",
        "show",
        "also",
        "consequence",
        "theory",
        "czf",
        "czf",
        "_",
        "exp",
        "different",
        "aczel",
        "rathjen",
        "shown",
        "class",
        "dedekind",
        "real",
        "number",
        "form",
        "set",
        "czf",
        "using",
        "subset",
        "collection",
        "lubarsky",
        "rathjen",
        "showed",
        "czf",
        "_",
        "exp",
        "suffice",
        "prove",
        "statement",
        "application",
        "kripke",
        "model",
        "separating",
        "crucial",
        "constructive",
        "notion",
        "see",
        "eg",
        "diener",
        "lubarsky",
        "heytingvalued",
        "semantics",
        "intuitionistic",
        "set",
        "theory",
        "obtained",
        "grayson",
        "grayson",
        "counterpart",
        "boolean",
        "model",
        "classical",
        "set",
        "theory",
        "generalized",
        "especially",
        "via",
        "categorical",
        "semantics",
        "introduction",
        "see",
        "maclane",
        "moerdijk",
        "heytingvalued",
        "semantics",
        "found",
        "application",
        "independence",
        "result",
        "scedrov",
        "constructive",
        "treatment",
        "given",
        "gambino",
        "see",
        "also",
        "lubarsky",
        "see",
        "also",
        "ziegler",
        "generalization",
        "realisability",
        "heyting",
        "model",
        "constructive",
        "set",
        "theory",
        "categorical",
        "model",
        "constructive",
        "intuitionistic",
        "set",
        "theory",
        "categorical",
        "model",
        "constructive",
        "intuitionistic",
        "set",
        "theory",
        "flourished",
        "year",
        "notion",
        "topos",
        "sheaf",
        "play",
        "essential",
        "role",
        "see",
        "eg",
        "fourman",
        "fourman",
        "scott",
        "overview",
        "main",
        "concept",
        "see",
        "entry",
        "category",
        "theory",
        "reference",
        "provided",
        "see",
        "particular",
        "supplement",
        "programmatic",
        "reading",
        "guide",
        "recent",
        "development",
        "relate",
        "specifically",
        "constructive",
        "set",
        "theory",
        "see",
        "eg",
        "simpson",
        "awodey",
        "well",
        "web",
        "page",
        "algebraic",
        "set",
        "theory",
        "variant",
        "constructive",
        "intuitionistic",
        "set",
        "theory",
        "set",
        "theory",
        "urelements",
        "nonextensional",
        "set",
        "theory",
        "sometimes",
        "system",
        "intuitionistic",
        "constructive",
        "set",
        "theory",
        "presented",
        "natural",
        "number",
        "separate",
        "sort",
        "urelements",
        "primitive",
        "object",
        "element",
        "friedman",
        "myhill",
        "beeson",
        "constructively",
        "natural",
        "choice",
        "agreement",
        "idea",
        "expressed",
        "example",
        "bishop",
        "among",
        "others",
        "bishop",
        "monograph",
        "natural",
        "number",
        "taken",
        "fundamental",
        "concept",
        "mathematical",
        "concept",
        "based",
        "technical",
        "point",
        "view",
        "natural",
        "number",
        "taken",
        "primitive",
        "distinct",
        "settheoretic",
        "representation",
        "axiom",
        "infinity",
        "take",
        "form",
        "set",
        "natural",
        "number",
        "urelements",
        "general",
        "form",
        "urelements",
        "constructive",
        "set",
        "theory",
        "considered",
        "cantini",
        "crosilla",
        "variant",
        "constructive",
        "set",
        "theory",
        "proposed",
        "combine",
        "intensional",
        "partial",
        "notion",
        "operation",
        "czf",
        "extensional",
        "notion",
        "set",
        "see",
        "also",
        "cantini",
        "crosilla",
        "axiom",
        "extensionality",
        "common",
        "feature",
        "system",
        "discussed",
        "far",
        "however",
        "context",
        "computational",
        "content",
        "statement",
        "considered",
        "crucial",
        "intensional",
        "theory",
        "might",
        "appropriate",
        "example",
        "constructive",
        "type",
        "theory",
        "explicit",
        "mathematics",
        "encapsulate",
        "form",
        "intensionality",
        "intuitionistic",
        "set",
        "theory",
        "without",
        "extensionality",
        "considered",
        "literature",
        "friedman",
        "a",
        "beeson",
        "motivation",
        "however",
        "computational",
        "technical",
        "nature",
        "due",
        "difficulty",
        "extensionality",
        "brings",
        "studying",
        "metamathematical",
        "property",
        "intuitionistic",
        "set",
        "theory"
    ]
}