{
    "main_text": "Critical Period\n4. From Zermelo to Gödel\n\nIn the period 1900–1930, the rubric “set theory” was\nstill understood to include topics in topology and the theory of\nfunctions. Although Cantor, Dedekind, and Zermelo had left that stage\nbehind to concentrate on pure set theory, for mathematicians at large\nthis would still take a long time. Thus, at the first International\nCongress of Mathematicians, 1897, keynote speeches given by Hadamard\nand Hurwitz defended set theory on the basis of its importance for\nanalysis. Around 1900, motivated by topics in analysis, important work\nwas done by three French experts: Borel [1898], Baire [1899] and\nLebesgue [1902] [1905]. Their work inaugurated the development of\ndescriptive set theory by extending Cantor’s studies on\ndefinable sets of real numbers (in which he had established that the\nContinuum Hypothesis is valid for closed sets). They introduced the\nhierarchy of Borel sets, the Baire hierarchy of functions, and the\nconcept of Lebesgue measure—a crucial concept of modern\nanalysis.\n\nDescriptive set theory (DST) is the study of certain kinds of\ndefinable sets of real numbers, which are obtained from simple kinds\n(like the open sets and the closed sets) by well-understood operations\nlike complementation or projection. The Borel sets were the\nfirst hierarchy of definable sets, introduced in the 1898 book of\nÉmile Borel; they are obtained from the open sets by iterated\napplication of the operations of countable union and complementation.\nIn 1905 Lebesgue studied the Borel sets in an epochal memoir, showing\nthat their hierarchy has levels for all countable ordinals, and\nanalyzing the Baire functions as counterparts of the Borel sets. The\nmain aim of descriptive set theory is to find structural properties\ncommon to all such definable sets: for instance, the Borel sets were\nshown to have the perfect set property (if uncountable, they have a\nperfect subset) and thus to comply with the continuum hypothesis (CH).\nThis result was established in 1916 by Hausdorff and by Alexandroff,\nworking independently. Other important “regularity\nproperties” studied in DST are the property of being Lebesgue\nmeasurable, and the so-called property of Baire (to differ from an\nopen set by a so-called meager set, or set of first category).\n\nAlso crucial at the time was the study of the analytic sets,\nnamely the continuous images of Borel sets, or equivalently, the\nprojections of Borel sets. The young Russian mathematician Mikhail\nSuslin found a mistake in Lebesgue’s 1905 memoir when he\nrealized that the projection of a Borel set is not Borel in general\n[Suslin 1917]. However, he was able to establish that the analytic\nsets, too, possess the perfect set property and thus verify CH. By\n1923 Nikolai Lusin and Wacław Sierpiński were studying the\nco-analytic sets, and this was to lead them to a new\nhierarchy of projective sets, which starts with the analytic\nsets \\((\\Sigma^{1}_{1})\\), their complements (co-analytic,\n\\(\\Pi^{1}_{1}\\) sets), the projections of these last\n(\\(\\Sigma^{1}_{2}\\) sets), their complements (\\(\\Pi^{1}_{2}\\) sets),\nand so on. During the 1920s much work was done on these new types of\nsets, mainly by Polish mathematicians around Sierpiński and by\nthe Russian school of Lusin and his students. A crucial result\nobtained by Sierpiński was that every \\(\\Sigma^{1}_{2}\\) set is the\nunion of \\(\\aleph_{1}\\) Borel sets (the same holds for\n\\(\\Sigma^{1}_{1}\\) sets), but this kind of traditional research on the\ntopic would stagnate after around 1940 (see Kanamori [1995]).\n\nSoon Lusin, Sierpiński and their colleagues were finding extreme\ndifficulties in their work. Lusin was so much in despair that, in a\npaper of 1925, he came to\nthe “totally unexpected” conclusion that “one does\nnot know and one will never know” whether the projective sets\nhave the desired regularity properties (quoted in Kanamori 1995: 250).\nSuch comments are highly interesting in the light of later\ndevelopments, which have led to hypotheses that solve all the relevant\nquestions (Projective Determinacy, in particular). They underscore the difficult\nmethodological and philosophical issues raised by these more recent\nhypotheses, namely the problem concerning the kind of evidence that\nbacks them.\n\nLusin summarized the state of the art in his 1930 book\nLeçons sur les ensembles analytiques (Paris,\nGauthier-Villars), which was to be a key reference for years to come.\nSince this work, it has become customary to present results in DST for\nthe Baire space \\( ^{\\omega}\\)\\(\\omega\\) of infinite sequences of natural\nnumbers, which in effect had been introduced by René Baire in a\npaper published in 1909. Baire space is endowed with a certain\ntopology that makes it homeomorphic to the set of the irrational\nnumbers, and it is regarded by experts to be “perhaps the most\nfundamental object of study of set theory” next to the set of\nnatural numbers [Moschovakis 1994, 135].\n\nThis stream of work on DST must be counted among the most important\ncontributions made by set theory to analysis and topology. But what\nhad begun as an attempt to prove the Continuum Hypothesis could not\nreach this goal. Soon it was shown using the Axiom of Choice that\nthere are non-Lebesgue measurable sets of reals (Vitali 1905), and\nalso uncountable sets of reals with no perfect subset (Bernstein\n1908). Such results made clear the impossibility of reaching the goal\nof CH by concentrating on definable and “well-behaved”\nsets of reals.\n\nAlso, with Gödel’s work around 1940 (and also with forcing\nin the 1960s) it became clear why the research of the 1920s and 30s\nhad stagnated: the fundamental new independence results showed that\nthe theorems established by Suslin (perfect set property for analytic\nsets), Sierpinski (\\(\\Sigma^{1}_{2}\\) sets as unions of \\(\\aleph_{1}\\)\nBorel sets) and a few others were the best possible results on the\nbasis of axiom system ZFC. This is important philosophically: already\nan exploration of the world of sets definable from the open (or\nclosed) sets by complement, countable union, and projection had\nsufficed to reach the limits of the ZFC system. Hence the need for new\naxioms, that Gödel emphasized after World War II [Gödel\n1947].\n\nLet us now turn to Cantor’s other main legacy, the study of\ntransfinite numbers. By 1908 Hausdorff was working on uncountable\norder types and introduced the Generalized Continuum Hypothesis\n\\((2^{\\aleph_{a}} = \\aleph_{a+1})\\). He was also the first to consider\nthe possibility of an “exorbitant” cardinal, namely a\nweakly inaccessible, i.e., a regular cardinal that is not a successor\n(a cardinal \\(\\alpha\\) is called regular if decomposing \\(\\alpha\\)\ninto a sum of smaller cardinals requires \\(\\alpha\\)-many such\nnumbers). Few years later, in the early 1910s, Paul Mahlo was studying\nhierarchies of such large cardinals in work that pioneered what was to\nbecome a central area of set theory; he obtained a succession of\ninaccessible cardinals by employing a certain operation that involves\nthe notion of a stationary subset; they are called Mahlo cardinals.\nBut the study of large cardinals developed slowly. Meanwhile,\nHausdorff’s textbook Grundzüge der Mengenlehre\n(1914) introduced two generations of mathematicians into set theory\nand general topology.\n\nThe next crucial steps into the “very high” infinite were\ndone in 1930. The notion of strongly inaccessible cardinals was then\nisolated by Sierpiński & Tarski, and by Zermelo [1930]. A\nstrong inaccessible is a regular cardinal \\(\\alpha\\) such that \\(2^x\\)\nis less than \\(\\alpha\\) whenever \\(x < \\alpha\\). While weak\ninaccessibles merely involve closure under the successor operation,\nstrong inaccessibles involve a much stronger notion of closure under\nthe powerset operation. That same year, in a path-breaking paper on\nmodels of ZFC, Zermelo [1930] established a link between the\nuncountable (strongly) inaccessible cardinals and certain\n“natural” models of ZFC (in which work he assumed that the\npowerset operation is, so to say, fully determinate).\n\nIn that same year, Stanislaw Ulam was led by considerations coming out\nof analysis (measure theory) to a concept that was to become central:\nmeasurable cardinals. It turned out that such cardinals, defined by a\nmeasure-theoretic property, had to be (strongly) inaccessible. Indeed,\nmany years later it would be established (by Hanf, working upon\nTarski’s earlier work) that the first inaccessible cardinal is\nnot measurable, showing that these new cardinals were even more\n“exorbitant”. As one can see, the Polish school led by\nSierpiński had a very central role in the development of set\ntheory between the Wars. Measurable cardinals came to special\nprominence in the late 1960s when it became clear that the existence\nof a measurable cardinal contradicts Gödel’s axiom of\nconstructibility (\\(V = L\\) in the class notation). This again\nvindicated Gödel’s convictions, expressed in what is\nsometimes called “Gödel’s program” for new\naxioms.\n\nSet-theoretic mathematics continued its development into the powerful\naxiomatic and structural approach that was to dominate much of the\n20th century. To give just a couple of examples,\nHilbert’s early axiomatic work (e.g., in his arch-famous\nFoundations of Geometry) was deeply set-theoretic; Ernst\nSteinitz published in 1910 his research on abstract field theory,\nmaking essential use of the Axiom of Choice; and around the same time\nthe study of function spaces began with work by Hilbert, Maurice\nFréchet, and others. During the 1920s and 30s, the first\nspecialized mathematics journal, Fundamenta Mathematicae, was\ndevoted to set theory as then understood (centrally including topology\nand function theory). In those decades structural algebra came of age,\nabstract topology was gradually becoming an independent branch of\nstudy, and the study of set theory initiated its metatheoretic turn.\n\nEver since, “set theory” has generally been identified\nwith the branch of mathematical logic that studies transfinite sets,\noriginating in Cantor’s result that \\(\\mathbf{R}\\) has a\ngreater cardinality than \\(\\mathbf{N}\\). But, as the foregoing\ndiscussion shows, set theory was both effect and cause of the rise of\nmodern mathematics: the traces of this origin are indelibly stamped on\nits axiomatic structure.\n",
    "section_title": "4. From Zermelo to Gödel",
    "entry_title": "The Early Development of Set Theory",
    "hierarchy_title": "The Early Development of Set Theory || Critical Period",
    "tokenized_text": [
        "critical",
        "period",
        "zermelo",
        "gödel",
        "period",
        "rubric",
        "set",
        "theory",
        "still",
        "understood",
        "include",
        "topic",
        "topology",
        "theory",
        "function",
        "although",
        "cantor",
        "dedekind",
        "zermelo",
        "left",
        "stage",
        "behind",
        "concentrate",
        "pure",
        "set",
        "theory",
        "mathematician",
        "large",
        "would",
        "still",
        "take",
        "long",
        "time",
        "thus",
        "first",
        "international",
        "congress",
        "mathematician",
        "keynote",
        "speech",
        "given",
        "hadamard",
        "hurwitz",
        "defended",
        "set",
        "theory",
        "basis",
        "importance",
        "analysis",
        "around",
        "motivated",
        "topic",
        "analysis",
        "important",
        "work",
        "done",
        "three",
        "french",
        "expert",
        "borel",
        "baire",
        "lebesgue",
        "work",
        "inaugurated",
        "development",
        "descriptive",
        "set",
        "theory",
        "extending",
        "cantor",
        "study",
        "definable",
        "set",
        "real",
        "number",
        "established",
        "continuum",
        "hypothesis",
        "valid",
        "closed",
        "set",
        "introduced",
        "hierarchy",
        "borel",
        "set",
        "baire",
        "hierarchy",
        "function",
        "concept",
        "lebesgue",
        "measurea",
        "crucial",
        "concept",
        "modern",
        "analysis",
        "descriptive",
        "set",
        "theory",
        "dst",
        "study",
        "certain",
        "kind",
        "definable",
        "set",
        "real",
        "number",
        "obtained",
        "simple",
        "kind",
        "like",
        "open",
        "set",
        "closed",
        "set",
        "wellunderstood",
        "operation",
        "like",
        "complementation",
        "projection",
        "borel",
        "set",
        "first",
        "hierarchy",
        "definable",
        "set",
        "introduced",
        "book",
        "émile",
        "borel",
        "obtained",
        "open",
        "set",
        "iterated",
        "application",
        "operation",
        "countable",
        "union",
        "complementation",
        "lebesgue",
        "studied",
        "borel",
        "set",
        "epochal",
        "memoir",
        "showing",
        "hierarchy",
        "level",
        "countable",
        "ordinal",
        "analyzing",
        "baire",
        "function",
        "counterpart",
        "borel",
        "set",
        "main",
        "aim",
        "descriptive",
        "set",
        "theory",
        "find",
        "structural",
        "property",
        "common",
        "definable",
        "set",
        "instance",
        "borel",
        "set",
        "shown",
        "perfect",
        "set",
        "property",
        "uncountable",
        "perfect",
        "subset",
        "thus",
        "comply",
        "continuum",
        "hypothesis",
        "ch",
        "result",
        "established",
        "hausdorff",
        "alexandroff",
        "working",
        "independently",
        "important",
        "regularity",
        "property",
        "studied",
        "dst",
        "property",
        "lebesgue",
        "measurable",
        "socalled",
        "property",
        "baire",
        "differ",
        "open",
        "set",
        "socalled",
        "meager",
        "set",
        "set",
        "first",
        "category",
        "also",
        "crucial",
        "time",
        "study",
        "analytic",
        "set",
        "namely",
        "continuous",
        "image",
        "borel",
        "set",
        "equivalently",
        "projection",
        "borel",
        "set",
        "young",
        "russian",
        "mathematician",
        "mikhail",
        "suslin",
        "found",
        "mistake",
        "lebesgue",
        "memoir",
        "realized",
        "projection",
        "borel",
        "set",
        "borel",
        "general",
        "suslin",
        "however",
        "able",
        "establish",
        "analytic",
        "set",
        "posse",
        "perfect",
        "set",
        "property",
        "thus",
        "verify",
        "ch",
        "nikolai",
        "lusin",
        "wacław",
        "sierpiński",
        "studying",
        "coanalytic",
        "set",
        "lead",
        "new",
        "hierarchy",
        "projective",
        "set",
        "start",
        "analytic",
        "set",
        "sigma",
        "_",
        "complement",
        "coanalytic",
        "pi",
        "_",
        "set",
        "projection",
        "last",
        "sigma",
        "_",
        "set",
        "complement",
        "pi",
        "_",
        "set",
        "s",
        "much",
        "work",
        "done",
        "new",
        "type",
        "set",
        "mainly",
        "polish",
        "mathematician",
        "around",
        "sierpiński",
        "russian",
        "school",
        "lusin",
        "student",
        "crucial",
        "result",
        "obtained",
        "sierpiński",
        "every",
        "sigma",
        "_",
        "set",
        "union",
        "aleph_",
        "borel",
        "set",
        "hold",
        "sigma",
        "_",
        "set",
        "kind",
        "traditional",
        "research",
        "topic",
        "would",
        "stagnate",
        "around",
        "see",
        "kanamori",
        "soon",
        "lusin",
        "sierpiński",
        "colleague",
        "finding",
        "extreme",
        "difficulty",
        "work",
        "lusin",
        "much",
        "despair",
        "paper",
        "came",
        "totally",
        "unexpected",
        "conclusion",
        "one",
        "know",
        "one",
        "never",
        "know",
        "whether",
        "projective",
        "set",
        "desired",
        "regularity",
        "property",
        "quoted",
        "kanamori",
        "comment",
        "highly",
        "interesting",
        "light",
        "later",
        "development",
        "led",
        "hypothesis",
        "solve",
        "relevant",
        "question",
        "projective",
        "determinacy",
        "particular",
        "underscore",
        "difficult",
        "methodological",
        "philosophical",
        "issue",
        "raised",
        "recent",
        "hypothesis",
        "namely",
        "problem",
        "concerning",
        "kind",
        "evidence",
        "back",
        "lusin",
        "summarized",
        "state",
        "art",
        "book",
        "leçons",
        "sur",
        "le",
        "ensemble",
        "analytiques",
        "paris",
        "gauthiervillars",
        "key",
        "reference",
        "year",
        "come",
        "since",
        "work",
        "become",
        "customary",
        "present",
        "result",
        "dst",
        "baire",
        "space",
        "omega",
        "omega",
        "infinite",
        "sequence",
        "natural",
        "number",
        "effect",
        "introduced",
        "rené",
        "baire",
        "paper",
        "published",
        "baire",
        "space",
        "endowed",
        "certain",
        "topology",
        "make",
        "homeomorphic",
        "set",
        "irrational",
        "number",
        "regarded",
        "expert",
        "perhaps",
        "fundamental",
        "object",
        "study",
        "set",
        "theory",
        "next",
        "set",
        "natural",
        "number",
        "moschovakis",
        "stream",
        "work",
        "dst",
        "must",
        "counted",
        "among",
        "important",
        "contribution",
        "made",
        "set",
        "theory",
        "analysis",
        "topology",
        "begun",
        "attempt",
        "prove",
        "continuum",
        "hypothesis",
        "could",
        "reach",
        "goal",
        "soon",
        "shown",
        "using",
        "axiom",
        "choice",
        "nonlebesgue",
        "measurable",
        "set",
        "real",
        "vitali",
        "also",
        "uncountable",
        "set",
        "real",
        "perfect",
        "subset",
        "bernstein",
        "result",
        "made",
        "clear",
        "impossibility",
        "reaching",
        "goal",
        "ch",
        "concentrating",
        "definable",
        "wellbehaved",
        "set",
        "real",
        "also",
        "gödel",
        "work",
        "around",
        "also",
        "forcing",
        "s",
        "became",
        "clear",
        "research",
        "s",
        "stagnated",
        "fundamental",
        "new",
        "independence",
        "result",
        "showed",
        "theorem",
        "established",
        "suslin",
        "perfect",
        "set",
        "property",
        "analytic",
        "set",
        "sierpinski",
        "sigma",
        "_",
        "set",
        "union",
        "aleph_",
        "borel",
        "set",
        "others",
        "best",
        "possible",
        "result",
        "basis",
        "axiom",
        "system",
        "zfc",
        "important",
        "philosophically",
        "already",
        "exploration",
        "world",
        "set",
        "definable",
        "open",
        "closed",
        "set",
        "complement",
        "countable",
        "union",
        "projection",
        "sufficed",
        "reach",
        "limit",
        "zfc",
        "system",
        "hence",
        "need",
        "new",
        "axiom",
        "gödel",
        "emphasized",
        "world",
        "war",
        "ii",
        "gödel",
        "let",
        "u",
        "turn",
        "cantor",
        "main",
        "legacy",
        "study",
        "transfinite",
        "number",
        "hausdorff",
        "working",
        "uncountable",
        "order",
        "type",
        "introduced",
        "generalized",
        "continuum",
        "hypothesis",
        "aleph_",
        "aleph_",
        "a",
        "also",
        "first",
        "consider",
        "possibility",
        "exorbitant",
        "cardinal",
        "namely",
        "weakly",
        "inaccessible",
        "ie",
        "regular",
        "cardinal",
        "successor",
        "cardinal",
        "alpha",
        "called",
        "regular",
        "decomposing",
        "alpha",
        "sum",
        "smaller",
        "cardinal",
        "requires",
        "alpha",
        "many",
        "number",
        "year",
        "later",
        "early",
        "s",
        "paul",
        "mahlo",
        "studying",
        "hierarchy",
        "large",
        "cardinal",
        "work",
        "pioneered",
        "become",
        "central",
        "area",
        "set",
        "theory",
        "obtained",
        "succession",
        "inaccessible",
        "cardinal",
        "employing",
        "certain",
        "operation",
        "involves",
        "notion",
        "stationary",
        "subset",
        "called",
        "mahlo",
        "cardinal",
        "study",
        "large",
        "cardinal",
        "developed",
        "slowly",
        "meanwhile",
        "hausdorff",
        "textbook",
        "grundzüge",
        "der",
        "mengenlehre",
        "introduced",
        "two",
        "generation",
        "mathematician",
        "set",
        "theory",
        "general",
        "topology",
        "next",
        "crucial",
        "step",
        "high",
        "infinite",
        "done",
        "notion",
        "strongly",
        "inaccessible",
        "cardinal",
        "isolated",
        "sierpiński",
        "tarski",
        "zermelo",
        "strong",
        "inaccessible",
        "regular",
        "cardinal",
        "alpha",
        "x",
        "le",
        "alpha",
        "whenever",
        "x",
        "alpha",
        "weak",
        "inaccessibles",
        "merely",
        "involve",
        "closure",
        "successor",
        "operation",
        "strong",
        "inaccessibles",
        "involve",
        "much",
        "stronger",
        "notion",
        "closure",
        "powerset",
        "operation",
        "year",
        "pathbreaking",
        "paper",
        "model",
        "zfc",
        "zermelo",
        "established",
        "link",
        "uncountable",
        "strongly",
        "inaccessible",
        "cardinal",
        "certain",
        "natural",
        "model",
        "zfc",
        "work",
        "assumed",
        "powerset",
        "operation",
        "say",
        "fully",
        "determinate",
        "year",
        "stanislaw",
        "ulam",
        "led",
        "consideration",
        "coming",
        "analysis",
        "measure",
        "theory",
        "concept",
        "become",
        "central",
        "measurable",
        "cardinal",
        "turned",
        "cardinal",
        "defined",
        "measuretheoretic",
        "property",
        "strongly",
        "inaccessible",
        "indeed",
        "many",
        "year",
        "later",
        "would",
        "established",
        "hanf",
        "working",
        "upon",
        "tarski",
        "earlier",
        "work",
        "first",
        "inaccessible",
        "cardinal",
        "measurable",
        "showing",
        "new",
        "cardinal",
        "even",
        "exorbitant",
        "one",
        "see",
        "polish",
        "school",
        "led",
        "sierpiński",
        "central",
        "role",
        "development",
        "set",
        "theory",
        "war",
        "measurable",
        "cardinal",
        "came",
        "special",
        "prominence",
        "late",
        "s",
        "became",
        "clear",
        "existence",
        "measurable",
        "cardinal",
        "contradicts",
        "gödel",
        "axiom",
        "constructibility",
        "v",
        "l",
        "class",
        "notation",
        "vindicated",
        "gödel",
        "conviction",
        "expressed",
        "sometimes",
        "called",
        "gödel",
        "program",
        "new",
        "axiom",
        "settheoretic",
        "mathematics",
        "continued",
        "development",
        "powerful",
        "axiomatic",
        "structural",
        "approach",
        "dominate",
        "much",
        "th",
        "century",
        "give",
        "couple",
        "example",
        "hilbert",
        "early",
        "axiomatic",
        "work",
        "eg",
        "archfamous",
        "foundation",
        "geometry",
        "deeply",
        "settheoretic",
        "ernst",
        "steinitz",
        "published",
        "research",
        "abstract",
        "field",
        "theory",
        "making",
        "essential",
        "use",
        "axiom",
        "choice",
        "around",
        "time",
        "study",
        "function",
        "space",
        "began",
        "work",
        "hilbert",
        "maurice",
        "fréchet",
        "others",
        "s",
        "first",
        "specialized",
        "mathematics",
        "journal",
        "fundamenta",
        "mathematicae",
        "devoted",
        "set",
        "theory",
        "understood",
        "centrally",
        "including",
        "topology",
        "function",
        "theory",
        "decade",
        "structural",
        "algebra",
        "came",
        "age",
        "abstract",
        "topology",
        "gradually",
        "becoming",
        "independent",
        "branch",
        "study",
        "study",
        "set",
        "theory",
        "initiated",
        "metatheoretic",
        "turn",
        "ever",
        "since",
        "set",
        "theory",
        "generally",
        "identified",
        "branch",
        "mathematical",
        "logic",
        "study",
        "transfinite",
        "set",
        "originating",
        "cantor",
        "result",
        "mathbf",
        "r",
        "greater",
        "cardinality",
        "mathbf",
        "n",
        "foregoing",
        "discussion",
        "show",
        "set",
        "theory",
        "effect",
        "cause",
        "rise",
        "modern",
        "mathematics",
        "trace",
        "origin",
        "indelibly",
        "stamped",
        "axiomatic",
        "structure"
    ]
}