{
    "main_text": "New Foundations and Related Systems || Mathematics in NFU + Infinity + Choice\n6.3 Mathematics in NFU + Infinity + Choice\n\nOf these set theories, only NFU with Infinity, Choice and\npossibly further strong axioms of infinity (of which more anon) is\nreally mathematically serviceable. We examine the construction of\nmodels of this theory and the way mathematics works inside this\ntheory. A source for this development is Holmes 1998. Rosser 1973\ndevelops the foundations of mathematics in NF: it can adapted\nto NFU fairly easily).\n\nA model of NFU can be constructed as follows. Well-known\nresults of model theory allow the construction of a nonstandard model\nof ZFC (actually, a model of Mac Lane set theory suffices)\nwith an external automorphism \\(j\\) which moves a rank \\(V_{\\alpha}\\).\nWe stipulate without loss of generality that \\(j(\\alpha) \\lt \\alpha\\).\nThe universe of our model of NFU will be \\(V_{\\alpha}\\) and\nthe membership relation will be defined as \n\n\\[ x \\in_{NFU} y \\equiv_{def} j(x) \\in y \\amp y \\in V_{j(\\alpha)+1} \\]\n\n\n(where \\(\\in\\) is the membership relation of the nonstandard model).\nThe proof that this is a model of NFU is not long, but it is\ninvolved enough that we refer the reader elsewhere. The basic idea is\nthat the automorphism allows us to code the (apparent) power set\n\\(V_{\\alpha +1}\\) of our universe \\(V_{\\alpha}\\) into the\n“smaller” \\(V_{j(\\alpha)+1}\\) which is included in our\nuniverse; the left over objects in \\(V_{\\alpha} - V_{j(\\alpha)+1}\\)\nbecome urelements. Note that \\(V_{\\alpha} - V_{j(\\alpha)+1}\\) is most\nof the domain of the model of NFU in a quite strong sense:\nalmost all of the universe is made up of urelements (note that each\n\\(V_{\\beta +1}\\) is the power set of \\(V_{\\beta}\\), and so is strictly\nlarger in size, and not one but many stages intervene between\n\\(V_{j(\\alpha)+1}\\) (the collection of “sets”) and\n\\(V_{\\alpha}\\) (the “universe”)). This construction is\nrelated to the construction used by Jensen, but is apparently first\ndescribed explicitly in Boffa 1988.\n\nIn any model of NFU, a structure which looks just like one of\nthese models can be constructed in the isomorphism classes of\nwell-founded extensional relations. The theory of isomorphism classes\nof well-founded extensional relations with a top element looks like\nthe theory of (an initial segment of) the usual cumulative hierarchy,\nbecause every set in Zermelo-style set theory is uniquely determined\nby the isomorphism type of the restriction of the membership relation\nto its transitive closure. The surprise is that we not only see a\nstructure which looks like an initial segment of the cumulative\nhierarchy: we also see an external endomorphism of this structure\nwhich moves a rank (and therefore cannot be a set), in terms of which\nwe can replicate the model construction above and get an\ninterpretation of NFU of this kind inside NFU! The\nendomorphism is induced by the map \\(T\\) which sends the isomorphism\ntype of a relation \\(R\\) to the isomorphism type of \\(R^{\\iota} = \\{\n\\langle \\{x\\}, \\{y\\}\\rangle \\mid xRy\\}\\). There is no reason to\nbelieve that \\(T\\) is a function: it sends any relation \\(R\\) to a\nrelation \\(R^{\\iota}\\) which is one type higher in terms of\nTST. It is demonstrable that \\(T\\) on the isomorphism types\nof well-founded extensional relations is not a set function (we will\nnot show this here, but our discussion of the Burali-Forti paradox\nbelow should give a good idea of the reasons for this). See Holmes\n(1998) for the full discussion.\n\nThis suggests that the underlying world view of NFU, in spite\nof the presence of the universal set, Frege natural numbers, and other\nlarge objects, may not be that different from the world view of\nZermelo-style set theory; we build models of NFU in a certain\nway in Zermelo-style set theory, and NFU itself reflects this\nkind of construction internally. A further, surprising result (Holmes\n2012) is that in models of NFU constructed from a nonstandard\n\\(V_{\\alpha}\\) with automorphism as above, the membership relation on\nthe nonstandard \\(V_{\\alpha}\\) is first-order definable (in a very\nelaborate way) in terms of the relation \\(\\in_{NFU}\\); this is very\nsurprising, since it seems superficially as if all information about\nthe extensions of the urelements has been discarded in this\nconstruction. But this turns out not to be the case (and this means\nthat the urelements, which seem to have no internal information,\nnonetheless have a great deal of structure in these models).\n\nModels of NFU can have a “finite” (but externally\ninfinite) universe if the ordinal \\(\\alpha\\) in the construction is a\nnonstandard natural number. If \\(\\alpha\\) is infinite, the model of\nNFU will satisfy Infinity. If the Axiom of Choice holds in\nthe model of Zermelo-style set theory, it will hold in the model of\nNFU.\n\nNow we look at the mathematical universe according to NFU,\nrather than looking at models of NFU from the outside.\n\nThe Frege construction of the natural numbers works perfectly in\nNFU. If Infinity holds, there will be no last natural number\nand we can define the usual set \\(\\mathbf{N}\\) of natural numbers just\nas we did above.\n\nAny of the usual ordered pair constructions works in NFU. The\nusual Kuratowski pair is inconvenient in NF or in\nNFU, because the pair is two types higher than its\nprojections in terms of TST. This means that functions and\nrelations are three types higher than the elements of their domains\nand ranges. There is a type-level pair defined by Quine (1945;\ntype-level because it is the same type as its projections) which is\ndefinable in NF and also on \\(V_{\\alpha}\\) for any infinite\nordinal \\(\\alpha\\); this pair can be defined and used in NF\nand the fact that it is definable on infinite \\(V_{\\alpha}\\) means\nthat it can be assumed in NFU+Infinity that there is a\ntype-level ordered pair (the existence of such a pair also follows\nfrom Infinity and Choice together). This would make the type\ndisplacement between functions and relations and elements of their\ndomains and ranges just one, the same as the displacement between the\ntypes of sets and their elements. We will assume that ordered pairs\nare of the same type as their projections in the sequel, but we will\nnot present the rather complicated definition of the Quine pair.\n\nOnce pairs are defined, the definition of relations and functions\nproceeds exactly as in the usual set theory. The definitions of\nintegers and rational numbers present no problem, and the Dedekind\nconstruction of the reals can be carried out as usual. We will focus\nhere on developing the solutions to the paradoxes of Cantor and\nBurali-Forti in NFU, which give a good picture of the odd\ncharacter of this set theory, and also set things up nicely for a\nbrief discussion of natural strong axioms of infinity for\nNFU. It is important to realize as we read the ways in which\nNFU evades the paradoxes that this evasion is successful:\nNFU is known to be consistent if the usual set theory is\nconsistent, and close examination of the models of NFU shows\nexactly why these apparent dodges work.\n\nTwo sets are said to be of the same cardinality just in case there is\na bijection between them. This is standard. But we then proceed to\ndefine \\(|A|\\) (the cardinality of a set \\(A)\\) as the set of all sets\nwhich are the same size as \\(A\\), realizing the definition intended by\nFrege and Russell, and apparently intended by Cantor as well. Notice\nthat \\(|A|\\) is one type higher than \\(A\\). The Frege natural numbers\nare the same objects as the finite cardinal numbers.\n\nThe Cantor theorem of the usual set theory asserts that \\(|A| \\lt\n|\\wp(A)|\\). This is clearly not true in NFU, since | \\(V|\\)\nis the cardinality of the universe and \\(|\\wp(V)|\\) is the cardinality\nof the set of sets, and in fact \\(|V| \\gt \\gt |\\wp(V)|\\) in all known\nmodels of NFU (there are many intervening cardinals in all\nsuch models). But \\(|A| \\lt |\\wp(A)|\\) does not make sense in\nTST: it is ill-typed. The correct theorem in TST,\nwhich is inherited by NFU, is \\(|\\wp_1 (A)| \\lt |\\wp(A)|\\),\nwhere \\(\\wp_1 (A)\\) is the set of one-element subsets of \\(A\\), which\nis at the same type as the power set of \\(A\\). So we have \\(|\\wp_1\n(V)| \\lt |\\wp(V)|\\): there are more sets than there are singleton\nsets. The apparent bijection \\(x \\mapsto \\{x\\}\\) between \\(\\wp_1 (V)\\)\nand \\(V\\) cannot be a set (and there is no reason to expect it to be a\nset, since it has an unstratified definition).\n\nA set which satisfies \\(|A| = |\\wp_1 (A)|\\) is called a\ncantorian set, since it satisfies the usual form of\nCantor’s theorem. A set \\(A\\) which satisfies the stronger\ncondition that the restriction of the singleton map to \\(A\\) is a set\nis said to be strongly cantorian (s.c.). Strongly cantorian\nsets are important because it is not necessary to assign a relative\ntype to a variable known to be restricted to a strongly cantorian set,\nas it is possible to use the restriction of the singleton map and its\ninverse to freely adjust the type of any such variable for purposes of\nstratification. The strongly cantorian sets are can be thought of as\nanalogues of the small sets of the usual set theory.\n\nOrdinal numbers are defined as equivalence classes of well-orderings\nunder similarity. There is a natural order on ordinal numbers, and in\nNFU as in the usual set theory it turns out to be a\nwell-ordering—and, as in naive set theory, a set! Since the\nnatural order on the ordinal numbers is a set, it has an order type\n\\(\\Omega\\) which is itself one of the ordinal numbers. Now in the\nusual set theory we prove that the order type of the restriction of\nthe natural order on the ordinals to the ordinals less than \\(\\alpha\\)\nis the ordinal \\(\\alpha\\) itself; however, this is an ill-typed\nstatement in TST, where, assuming a type level ordered pair,\nthe second occurrence of \\(\\alpha\\) is two types higher than the first\n(it would be four types higher if the Kuratowski ordered pair were\nused). Since the ordinals are isomorphism types of relations, we can\ndefine the operation \\(T\\) on them as above.\n\n\nThe order type of the restriction of the natural order on the ordinals\nto the ordinals less than \\(\\alpha\\) is the ordinal \\(T^2\n(\\alpha)\\)\n\n\nis an assertion which makes sense in TST and is in fact true\nin TST and so in NFU. We thus find that the order\ntype of the restriction of the natural order on the ordinals to the\nordinals less than \\(\\Omega\\) is \\(T^2 (\\Omega)\\), whence we find that\n\\(T^2 (\\Omega)\\) (as the order type of a proper initial segment of the\nordinals) is strictly less than \\(\\Omega\\) (which is the order type of\nall the ordinals). Once again, the fact that the singleton\nmap is not a function eliminates the “intuitively obvious”\nsimilarity between these orders. This also shows that \\(T\\) is not a\nfunction. \\(T\\) is an order endomorphism of the ordinals, though,\nwhence we have \\(\\Omega \\gt T^2 (\\Omega) \\gt T^4 (\\Omega)\\ldots\\),\nwhich may be vaguely disturbing, though this “sequence” is\nnot a set. A perhaps useful comment is that in the models of\nNFU described above, the action of \\(T\\) on ordinals exactly\nparallels the action of \\(j\\) on order types of well-orderings \\((j\\)\ndoes not send NFU ordinals to ordinals, exactly, so this\nneeds to be phrased carefully): the “descending sequence”\nalready has an analogue in the sequence \\(\\alpha \\gt j(\\alpha) \\gt j^2\n(\\alpha)\\ldots\\) in the original nonstandard model. Some have asserted\nthat this phenomenon (that the ordinals in any model of NFU\nare not externally well-ordered) can be phrased as “NFU\nhas no standard model”. We reserve judgement on this—we do\nnote that the theorem “the ordinals in any (set!) model of\nNFU are not well-ordered” is a theorem of NFU\nitself; note that NFU does not see the universe as a model of\nNFU (even though it is a set) because the membership relation\nis not a set relation (if it were, the singleton map certainly would\nbe).\n\nNFU + Infinity + Choice is a relatively weak theory: like\nZermelo set theory it does not prove even that \\(\\aleph_{\\omega}\\)\nexists. As is the case with Zermelo set theory, natural extensions of\nthis theory make it much stronger. We give just one example. The Axiom\nof Cantorian Sets is the deceptively simple statement (to which there\nare no evident counterexamples) that “every cantorian set is\nstrongly cantorian”. NFU + Infinity + Choice +\nCantorian Sets is a considerably stronger theory than NFU +\nInfinity + Choice: in its theory of isomorphism types of well-founded\nextensional relations with top element, the cantorian types with the\nobvious “membership” relation satisfy the axioms of\nZFC + “there is an \\(n\\)-Mahlo cardinal” for each\nconcrete \\(n\\). There is no mathematical need for the devious\ninterpretation: this theory proves the existence of \\(n\\)-Mahlo\ncardinals and supports all mathematical constructions at that level of\nconsistency strength in its own terms without any need to refer to the\ntheory of well-founded extensional relations. More elaborate\nstatements about such properties as “cantorian” and\n“strongly cantorian” (applied to order types as well as\ncardinality) yield even stronger axioms of infinity.\n\nOur basic claim about NFU + Infinity + Choice (and its\nextensions) is that it is a mathematically serviceable alternative set\ntheory with its own intrinsic motivation (although we have used\nZermelo style set theory to prove its consistency here, the entire\ndevelopment can be carried out in terms of TST alone: one can\nuse TST as meta-theory, show in TST that consistency\nof TST implies consistency of NFU, and use this\nresult to amend one’s meta-theory to NFU, thus\nabandoning the distinctions between types). We do not claim that it is\nbetter than ZFC, but we do claim that it is adequate, and\nthat it is important to know that adequate alternatives exist; we do\nclaim that it is useful to know that there are different ways to found\nmathematics, as we have encountered the absurd assertion that\n“mathematics is whatever is formalized in\nZFC”.\n",
    "section_title": "6.3 Mathematics in NFU + Infinity + Choice",
    "entry_title": "Alternative Axiomatic Set Theories",
    "hierarchy_title": "Alternative Axiomatic Set Theories || New Foundations and Related Systems || Mathematics in NFU + Infinity + Choice",
    "tokenized_text": [
        "new",
        "foundation",
        "related",
        "system",
        "mathematics",
        "nfu",
        "infinity",
        "choice",
        "mathematics",
        "nfu",
        "infinity",
        "choice",
        "set",
        "theory",
        "nfu",
        "infinity",
        "choice",
        "possibly",
        "strong",
        "axiom",
        "infinity",
        "anon",
        "really",
        "mathematically",
        "serviceable",
        "examine",
        "construction",
        "model",
        "theory",
        "way",
        "mathematics",
        "work",
        "inside",
        "theory",
        "source",
        "development",
        "holmes",
        "rosser",
        "develops",
        "foundation",
        "mathematics",
        "nf",
        "adapted",
        "nfu",
        "fairly",
        "easily",
        "model",
        "nfu",
        "constructed",
        "follows",
        "wellknown",
        "result",
        "model",
        "theory",
        "allow",
        "construction",
        "nonstandard",
        "model",
        "zfc",
        "actually",
        "model",
        "mac",
        "lane",
        "set",
        "theory",
        "suffices",
        "external",
        "automorphism",
        "j",
        "move",
        "rank",
        "v_",
        "alpha",
        "stipulate",
        "without",
        "loss",
        "generality",
        "j",
        "alpha",
        "lt",
        "alpha",
        "universe",
        "model",
        "nfu",
        "v_",
        "alpha",
        "membership",
        "relation",
        "defined",
        "x",
        "in_",
        "nfu",
        "equiv_",
        "def",
        "j",
        "x",
        "in",
        "amp",
        "in",
        "v_",
        "j",
        "alpha",
        "in",
        "membership",
        "relation",
        "nonstandard",
        "model",
        "proof",
        "model",
        "nfu",
        "long",
        "involved",
        "enough",
        "refer",
        "reader",
        "elsewhere",
        "basic",
        "idea",
        "automorphism",
        "allows",
        "u",
        "code",
        "apparent",
        "power",
        "set",
        "v_",
        "alpha",
        "universe",
        "v_",
        "alpha",
        "smaller",
        "v_",
        "j",
        "alpha",
        "included",
        "universe",
        "left",
        "object",
        "v_",
        "alpha",
        "v_",
        "j",
        "alpha",
        "become",
        "urelements",
        "note",
        "v_",
        "alpha",
        "v_",
        "j",
        "alpha",
        "domain",
        "model",
        "nfu",
        "quite",
        "strong",
        "sense",
        "almost",
        "universe",
        "made",
        "urelements",
        "note",
        "v_",
        "beta",
        "power",
        "set",
        "v_",
        "beta",
        "strictly",
        "larger",
        "size",
        "one",
        "many",
        "stage",
        "intervene",
        "v_",
        "j",
        "alpha",
        "collection",
        "set",
        "v_",
        "alpha",
        "universe",
        "construction",
        "related",
        "construction",
        "used",
        "jensen",
        "apparently",
        "first",
        "described",
        "explicitly",
        "boffa",
        "model",
        "nfu",
        "structure",
        "look",
        "like",
        "one",
        "model",
        "constructed",
        "isomorphism",
        "class",
        "wellfounded",
        "extensional",
        "relation",
        "theory",
        "isomorphism",
        "class",
        "wellfounded",
        "extensional",
        "relation",
        "top",
        "element",
        "look",
        "like",
        "theory",
        "initial",
        "segment",
        "usual",
        "cumulative",
        "hierarchy",
        "every",
        "set",
        "zermelostyle",
        "set",
        "theory",
        "uniquely",
        "determined",
        "isomorphism",
        "type",
        "restriction",
        "membership",
        "relation",
        "transitive",
        "closure",
        "surprise",
        "see",
        "structure",
        "look",
        "like",
        "initial",
        "segment",
        "cumulative",
        "hierarchy",
        "also",
        "see",
        "external",
        "endomorphism",
        "structure",
        "move",
        "rank",
        "therefore",
        "set",
        "term",
        "replicate",
        "model",
        "construction",
        "get",
        "interpretation",
        "nfu",
        "kind",
        "inside",
        "nfu",
        "endomorphism",
        "induced",
        "map",
        "t",
        "sends",
        "isomorphism",
        "type",
        "relation",
        "r",
        "isomorphism",
        "type",
        "r",
        "iota",
        "langle",
        "x",
        "y",
        "rangle",
        "mid",
        "xry",
        "reason",
        "believe",
        "t",
        "function",
        "sends",
        "relation",
        "r",
        "relation",
        "r",
        "iota",
        "one",
        "type",
        "higher",
        "term",
        "tst",
        "demonstrable",
        "t",
        "isomorphism",
        "type",
        "wellfounded",
        "extensional",
        "relation",
        "set",
        "function",
        "show",
        "discussion",
        "buraliforti",
        "paradox",
        "give",
        "good",
        "idea",
        "reason",
        "see",
        "holmes",
        "full",
        "discussion",
        "suggests",
        "underlying",
        "world",
        "view",
        "nfu",
        "spite",
        "presence",
        "universal",
        "set",
        "frege",
        "natural",
        "number",
        "large",
        "object",
        "may",
        "different",
        "world",
        "view",
        "zermelostyle",
        "set",
        "theory",
        "build",
        "model",
        "nfu",
        "certain",
        "way",
        "zermelostyle",
        "set",
        "theory",
        "nfu",
        "reflects",
        "kind",
        "construction",
        "internally",
        "surprising",
        "result",
        "holmes",
        "model",
        "nfu",
        "constructed",
        "nonstandard",
        "v_",
        "alpha",
        "automorphism",
        "membership",
        "relation",
        "nonstandard",
        "v_",
        "alpha",
        "firstorder",
        "definable",
        "elaborate",
        "way",
        "term",
        "relation",
        "in_",
        "nfu",
        "surprising",
        "since",
        "seems",
        "superficially",
        "information",
        "extension",
        "urelements",
        "discarded",
        "construction",
        "turn",
        "case",
        "mean",
        "urelements",
        "seem",
        "internal",
        "information",
        "nonetheless",
        "great",
        "deal",
        "structure",
        "model",
        "model",
        "nfu",
        "finite",
        "externally",
        "infinite",
        "universe",
        "ordinal",
        "alpha",
        "construction",
        "nonstandard",
        "natural",
        "number",
        "alpha",
        "infinite",
        "model",
        "nfu",
        "satisfy",
        "infinity",
        "axiom",
        "choice",
        "hold",
        "model",
        "zermelostyle",
        "set",
        "theory",
        "hold",
        "model",
        "nfu",
        "look",
        "mathematical",
        "universe",
        "according",
        "nfu",
        "rather",
        "looking",
        "model",
        "nfu",
        "outside",
        "frege",
        "construction",
        "natural",
        "number",
        "work",
        "perfectly",
        "nfu",
        "infinity",
        "hold",
        "last",
        "natural",
        "number",
        "define",
        "usual",
        "set",
        "mathbf",
        "n",
        "natural",
        "number",
        "usual",
        "ordered",
        "pair",
        "construction",
        "work",
        "nfu",
        "usual",
        "kuratowski",
        "pair",
        "inconvenient",
        "nf",
        "nfu",
        "pair",
        "two",
        "type",
        "higher",
        "projection",
        "term",
        "tst",
        "mean",
        "function",
        "relation",
        "three",
        "type",
        "higher",
        "element",
        "domain",
        "range",
        "typelevel",
        "pair",
        "defined",
        "quine",
        "typelevel",
        "type",
        "projection",
        "definable",
        "nf",
        "also",
        "v_",
        "alpha",
        "infinite",
        "ordinal",
        "alpha",
        "pair",
        "defined",
        "used",
        "nf",
        "fact",
        "definable",
        "infinite",
        "v_",
        "alpha",
        "mean",
        "assumed",
        "nfuinfinity",
        "typelevel",
        "ordered",
        "pair",
        "existence",
        "pair",
        "also",
        "follows",
        "infinity",
        "choice",
        "together",
        "would",
        "make",
        "type",
        "displacement",
        "function",
        "relation",
        "element",
        "domain",
        "range",
        "one",
        "displacement",
        "type",
        "set",
        "element",
        "assume",
        "ordered",
        "pair",
        "type",
        "projection",
        "sequel",
        "present",
        "rather",
        "complicated",
        "definition",
        "quine",
        "pair",
        "pair",
        "defined",
        "definition",
        "relation",
        "function",
        "proceeds",
        "exactly",
        "usual",
        "set",
        "theory",
        "definition",
        "integer",
        "rational",
        "number",
        "present",
        "problem",
        "dedekind",
        "construction",
        "real",
        "carried",
        "usual",
        "focus",
        "developing",
        "solution",
        "paradox",
        "cantor",
        "buraliforti",
        "nfu",
        "give",
        "good",
        "picture",
        "odd",
        "character",
        "set",
        "theory",
        "also",
        "set",
        "thing",
        "nicely",
        "brief",
        "discussion",
        "natural",
        "strong",
        "axiom",
        "infinity",
        "nfu",
        "important",
        "realize",
        "read",
        "way",
        "nfu",
        "evades",
        "paradox",
        "evasion",
        "successful",
        "nfu",
        "known",
        "consistent",
        "usual",
        "set",
        "theory",
        "consistent",
        "close",
        "examination",
        "model",
        "nfu",
        "show",
        "exactly",
        "apparent",
        "dodge",
        "work",
        "two",
        "set",
        "said",
        "cardinality",
        "case",
        "bijection",
        "standard",
        "proceed",
        "define",
        "a",
        "cardinality",
        "set",
        "set",
        "set",
        "size",
        "a",
        "realizing",
        "definition",
        "intended",
        "frege",
        "russell",
        "apparently",
        "intended",
        "cantor",
        "well",
        "notice",
        "a",
        "one",
        "type",
        "higher",
        "a",
        "frege",
        "natural",
        "number",
        "object",
        "finite",
        "cardinal",
        "number",
        "cantor",
        "theorem",
        "usual",
        "set",
        "theory",
        "asserts",
        "a",
        "lt",
        "wp",
        "clearly",
        "true",
        "nfu",
        "since",
        "v",
        "cardinality",
        "universe",
        "wp",
        "v",
        "cardinality",
        "set",
        "set",
        "fact",
        "v",
        "gt",
        "gt",
        "wp",
        "v",
        "known",
        "model",
        "nfu",
        "many",
        "intervening",
        "cardinal",
        "model",
        "a",
        "lt",
        "wp",
        "make",
        "sense",
        "tst",
        "illtyped",
        "correct",
        "theorem",
        "tst",
        "inherited",
        "nfu",
        "wp_",
        "lt",
        "wp",
        "wp_",
        "set",
        "oneelement",
        "subset",
        "a",
        "type",
        "power",
        "set",
        "a",
        "wp_",
        "v",
        "lt",
        "wp",
        "v",
        "set",
        "singleton",
        "set",
        "apparent",
        "bijection",
        "x",
        "mapsto",
        "x",
        "wp_",
        "v",
        "v",
        "set",
        "reason",
        "expect",
        "set",
        "since",
        "unstratified",
        "definition",
        "set",
        "satisfies",
        "a",
        "wp_",
        "called",
        "cantorian",
        "set",
        "since",
        "satisfies",
        "usual",
        "form",
        "cantor",
        "theorem",
        "set",
        "a",
        "satisfies",
        "stronger",
        "condition",
        "restriction",
        "singleton",
        "map",
        "a",
        "set",
        "said",
        "strongly",
        "cantorian",
        "sc",
        "strongly",
        "cantorian",
        "set",
        "important",
        "necessary",
        "assign",
        "relative",
        "type",
        "variable",
        "known",
        "restricted",
        "strongly",
        "cantorian",
        "set",
        "possible",
        "use",
        "restriction",
        "singleton",
        "map",
        "inverse",
        "freely",
        "adjust",
        "type",
        "variable",
        "purpose",
        "stratification",
        "strongly",
        "cantorian",
        "set",
        "thought",
        "analogue",
        "small",
        "set",
        "usual",
        "set",
        "theory",
        "ordinal",
        "number",
        "defined",
        "equivalence",
        "class",
        "wellorderings",
        "similarity",
        "natural",
        "order",
        "ordinal",
        "number",
        "nfu",
        "usual",
        "set",
        "theory",
        "turn",
        "wellorderingand",
        "naive",
        "set",
        "theory",
        "set",
        "since",
        "natural",
        "order",
        "ordinal",
        "number",
        "set",
        "order",
        "type",
        "omega",
        "one",
        "ordinal",
        "number",
        "usual",
        "set",
        "theory",
        "prove",
        "order",
        "type",
        "restriction",
        "natural",
        "order",
        "ordinal",
        "ordinal",
        "le",
        "alpha",
        "ordinal",
        "alpha",
        "however",
        "illtyped",
        "statement",
        "tst",
        "assuming",
        "type",
        "level",
        "ordered",
        "pair",
        "second",
        "occurrence",
        "alpha",
        "two",
        "type",
        "higher",
        "first",
        "would",
        "four",
        "type",
        "higher",
        "kuratowski",
        "ordered",
        "pair",
        "used",
        "since",
        "ordinal",
        "isomorphism",
        "type",
        "relation",
        "define",
        "operation",
        "t",
        "order",
        "type",
        "restriction",
        "natural",
        "order",
        "ordinal",
        "ordinal",
        "le",
        "alpha",
        "ordinal",
        "t",
        "alpha",
        "assertion",
        "make",
        "sense",
        "tst",
        "fact",
        "true",
        "tst",
        "nfu",
        "thus",
        "find",
        "order",
        "type",
        "restriction",
        "natural",
        "order",
        "ordinal",
        "ordinal",
        "le",
        "omega",
        "t",
        "omega",
        "whence",
        "find",
        "t",
        "omega",
        "order",
        "type",
        "proper",
        "initial",
        "segment",
        "ordinal",
        "strictly",
        "le",
        "omega",
        "order",
        "type",
        "ordinal",
        "fact",
        "singleton",
        "map",
        "function",
        "eliminates",
        "intuitively",
        "obvious",
        "similarity",
        "order",
        "also",
        "show",
        "t",
        "function",
        "t",
        "order",
        "endomorphism",
        "ordinal",
        "though",
        "whence",
        "omega",
        "gt",
        "t",
        "omega",
        "gt",
        "t",
        "omega",
        "ldots",
        "may",
        "vaguely",
        "disturbing",
        "though",
        "sequence",
        "set",
        "perhaps",
        "useful",
        "comment",
        "model",
        "nfu",
        "described",
        "action",
        "t",
        "ordinal",
        "exactly",
        "parallel",
        "action",
        "j",
        "order",
        "type",
        "wellorderings",
        "j",
        "send",
        "nfu",
        "ordinal",
        "ordinal",
        "exactly",
        "need",
        "phrased",
        "carefully",
        "descending",
        "sequence",
        "already",
        "analogue",
        "sequence",
        "alpha",
        "gt",
        "j",
        "alpha",
        "gt",
        "j",
        "alpha",
        "ldots",
        "original",
        "nonstandard",
        "model",
        "asserted",
        "phenomenon",
        "ordinal",
        "model",
        "nfu",
        "externally",
        "wellordered",
        "phrased",
        "nfu",
        "standard",
        "model",
        "reserve",
        "judgement",
        "thiswe",
        "note",
        "theorem",
        "ordinal",
        "set",
        "model",
        "nfu",
        "wellordered",
        "theorem",
        "nfu",
        "note",
        "nfu",
        "see",
        "universe",
        "model",
        "nfu",
        "even",
        "though",
        "set",
        "membership",
        "relation",
        "set",
        "relation",
        "singleton",
        "map",
        "certainly",
        "would",
        "nfu",
        "infinity",
        "choice",
        "relatively",
        "weak",
        "theory",
        "like",
        "zermelo",
        "set",
        "theory",
        "prove",
        "even",
        "aleph_",
        "omega",
        "exists",
        "case",
        "zermelo",
        "set",
        "theory",
        "natural",
        "extension",
        "theory",
        "make",
        "much",
        "stronger",
        "give",
        "one",
        "example",
        "axiom",
        "cantorian",
        "set",
        "deceptively",
        "simple",
        "statement",
        "evident",
        "counterexample",
        "every",
        "cantorian",
        "set",
        "strongly",
        "cantorian",
        "nfu",
        "infinity",
        "choice",
        "cantorian",
        "set",
        "considerably",
        "stronger",
        "theory",
        "nfu",
        "infinity",
        "choice",
        "theory",
        "isomorphism",
        "type",
        "wellfounded",
        "extensional",
        "relation",
        "top",
        "element",
        "cantorian",
        "type",
        "obvious",
        "membership",
        "relation",
        "satisfy",
        "axiom",
        "zfc",
        "n",
        "mahlo",
        "cardinal",
        "concrete",
        "n",
        "mathematical",
        "need",
        "devious",
        "interpretation",
        "theory",
        "prof",
        "existence",
        "n",
        "mahlo",
        "cardinal",
        "support",
        "mathematical",
        "construction",
        "level",
        "consistency",
        "strength",
        "term",
        "without",
        "need",
        "refer",
        "theory",
        "wellfounded",
        "extensional",
        "relation",
        "elaborate",
        "statement",
        "property",
        "cantorian",
        "strongly",
        "cantorian",
        "applied",
        "order",
        "type",
        "well",
        "cardinality",
        "yield",
        "even",
        "stronger",
        "axiom",
        "infinity",
        "basic",
        "claim",
        "nfu",
        "infinity",
        "choice",
        "extension",
        "mathematically",
        "serviceable",
        "alternative",
        "set",
        "theory",
        "intrinsic",
        "motivation",
        "although",
        "used",
        "zermelo",
        "style",
        "set",
        "theory",
        "prove",
        "consistency",
        "entire",
        "development",
        "carried",
        "term",
        "tst",
        "alone",
        "one",
        "use",
        "tst",
        "metatheory",
        "show",
        "tst",
        "consistency",
        "tst",
        "implies",
        "consistency",
        "nfu",
        "use",
        "result",
        "amend",
        "one",
        "metatheory",
        "nfu",
        "thus",
        "abandoning",
        "distinction",
        "type",
        "claim",
        "better",
        "zfc",
        "claim",
        "adequate",
        "important",
        "know",
        "adequate",
        "alternative",
        "exist",
        "claim",
        "useful",
        "know",
        "different",
        "way",
        "found",
        "mathematics",
        "encountered",
        "absurd",
        "assertion",
        "mathematics",
        "whatever",
        "formalized",
        "zfc"
    ]
}