{
    "main_text": "Critical Period\n3. Critical Period\n\nIn the late nineteenth century, it was a widespread idea that pure\nmathematics is nothing but an elaborate form of arithmetic. Thus it\nwas usual to talk about the “arithmetisation” of\nmathematics, and how it had brought about the highest standards of\nrigor. With Dedekind and Hilbert, this viewpoint led to the idea of\ngrounding all of pure mathematics in set theory. The most\ndifficult steps in bringing forth this viewpoint had been the\nestablishment of a theory of the real numbers, and a set-theoretic\nreduction of the natural numbers. Both problems had been solved by the\nwork of Cantor and Dedekind. But precisely when mathematicians were\ncelebrating that “full rigor” had been finally attained,\nserious problems emerged for the foundations of set theory. First\nCantor, and then Russell, discovered the paradoxes in set theory.\n\nCantor was led to the paradoxes by having introduced the\n“conceptual sphere” of the transfinite numbers. Each\ntransfinite ordinal is the order type of the set of its predecessors;\ne.g., ω is the order type of \\(\\{0, 1, 2, 3, \\ldots\\}\\), and\n\\(\\omega+2\\) is the order type of \\(\\{0, 1, 2, 3, \\ldots, \\omega,\n\\omega +1\\}\\). Thus, to each initial segment of the series of\nordinals, there corresponds an immediately greater ordinal. Now, the\n“whole series” of all transfinite ordinals would form a\nwell-ordered set, and to it there would correspond a new ordinal\nnumber. This is unacceptable, for this ordinal \\(o\\) would have\nto be greater than all members of the “whole series”, and\nin particular \\(o < o\\). This is usually called the\nBurali-Forti paradox, or paradox of the ordinals (although\nBurali-Forti himself failed to formulate it clearly, see Moore &\nGarciadiego 1981).\n\nAlthough it is conceivable that Cantor might have found that paradox\nas early as 1883, immediately after introducing the transfinite\nordinals (for arguments in favour of this idea see Purkert &\nIlgauds 1987 and Tait 2000), the evidence indicates clearly that it\nwas not until 1896/97 that he found this paradoxical argument and\nrealized its implications. By this time, he was also able to employ\nCantor’s Theorem to yield the\nCantor paradox, or paradox of the alephs: if there existed a\n“set of all” cardinal numbers (alephs), Cantor’s\nTheorem applied to it would give a new aleph \\(\\aleph\\), such that\n\\(\\aleph < \\aleph\\). The great set theorist realized perfectly well\nthat these paradoxes were a fatal blow to the “logical”\napproaches to sets favoured by Frege and Dedekind. Cantor emphasized\nthat his views were “in diametrical opposition”\nto Dedekind’s, and in particular to his “naïve\nassumption that all well-defined collections, or systems, are\nalso ‘consistent systems’ ” (see the letter\nto Hilbert, Nov. 15, 1899, in Purkert & Ilgauds 1987: 154).\n(Contrary to what has often been claimed, Cantor’s ambiguous\ndefinition of set in his paper of 1895 was intended to be\n“diametrically opposite” to the logicists’\nunderstanding of sets—often called “naïve” set\ntheory, which could more properly be called the dichotomy conception of\nsets, following a suggestion of Gödel.)\n\nCantor thought he could solve the problem of the paradoxes by\ndistinguishing between “consistent multiplicities” or\nsets, and “inconsistent multiplicities”. But, in the\nabsence of explicit criteria for the distinction, this was simply a\nverbal answer to the problem. Being aware of deficiencies in his new\nideas, Cantor never published a last paper he had been preparing, in\nwhich he planned to discuss the paradoxes and the problem of\nwell-ordering (we know quite well the contents of this unpublished\npaper, as Cantor discussed it in correspondence with Dedekind and\nHilbert; see the 1899 letters to Dedekind in Cantor 1932, or Ewald\n1996: vol. 2). Cantor presented an argument that relied on the\n“Burali-Forti” paradox of the ordinals, and aimed to prove\nthat every set can be well-ordered. This argument was later\nrediscovered by the British mathematician P.E.B. Jourdain, but it is\nopen to criticism because it works with “inconsistent\nmultiplicities” (Cantor’s term in the above-mentioned\nletters).\n\nCantor’s paradoxes convinced Hilbert and Dedekind that there\nwere important doubts concerning the foundations of set theory.\nHilbert formulated a paradox of his own (Peckhaus & Kahle 2002),\nand discussed the problem with mathematicians in his Göttingen\ncircle. Ernst Zermelo was thus led to discover the paradox of the\n“set” of all sets that are not members of themselves (Rang\n& Thomas 1981). This was independently discovered by Bertrand\nRussell, who was led to it by a careful study of Cantor’s\nTheorem, which conflicted deeply with Russell’s belief in a\nuniversal set. Some time later, in June 1902, he communicated the\n“contradiction” to Gottlob Frege, who was completing his\nown logical foundation of arithmetic, in a well-known letter [van\nHeijenoort 1967, 124]. Frege’s reaction made very clear the\nprofound impact of this contradiction upon the logicist program.\n“Can I always speak of a class, of the extension of a concept?\nAnd if not, how can I know the exceptions?” Faced with this,\n“I cannot see how arithmetic could be given a scientific\nfoundation, how numbers could be conceived as logical objects”\n(Frege 1903: 253).\n\nThe publication of Volume II of Frege’s Grundgesetze\n(1903), and above all Russell’s work The Principles of\nMathematics (1903), made the mathematical community fully aware\nof the existence of the set-theoretic paradoxes, of their impact and\nimportance. There is evidence that, up to then, even Hilbert and\nZermelo had not fully appreciated the damage. Notice that the\nRussell-Zermelo paradox operates with very basic\nnotions—negation and set membership—concepts that had\nwidely been regarded as purely logical. The “set” \\(R =\n\\{x: x \\not\\in x\\}\\) exists according to the principle of\ncomprehension (which allows any open sentence to determine a class),\nbut if so, \\(R \\in R \\textit{ iff } R \\not\\in R\\). It is a direct\ncontradiction to the principle favoured by Frege and Russell.\n\nIt was obviously necessary to clarify the foundations of set theory,\nbut the overall situation did not make this an easy task. The\ndifferent competing viewpoints were widely divergent. Cantor had a\nmetaphysical understanding of set theory and, although he had one of\nthe sharpest views of the field, he could not offer a precise\nfoundation. It was clear to him (as it had been, somewhat\nmysteriously, to Ernst Schröder in his Vorlesungen über\ndie Algebra der Logik, 1891) that one has to reject the idea of a\nUniversal Set, favoured by Frege and Dedekind. Frege and Russell based\ntheir approach on the principle of comprehension, which was shown\ncontradictory. Dedekind avoided that principle, but he postulated that\nthe Absolute Universe was a set, a “thing” in his\ntechnical sense of Gedankending; and he coupled that\nassumption with full acceptance of arbitrary subsets.\n\nThis idea of admitting arbitrary subsets had been one of the deep\ninspirations of both Cantor and Dedekind, but none of them had\nthematized it. (Here, their modern understanding of analysis played a\ncrucial but implicit background role, since they worked within the\nDirichlet-Riemann tradition of “arbitrary” functions.) As\nfor the now famous iterative conception there were some elements of it\n(particularly in Dedekind’s work, with his iterative development\nof the number system, and his views on “systems” and\n“things”), but it was conspicuously absent from many of\nthe relevant authors. Typically, e. g., Cantor did not iterate the\nprocess of set formation: he tended to consider sets of\nhomogeneous elements, elements which were taken to belong\n“in some conceptual sphere” (either numbers, or points, or\nfunctions, or even physical particles—but not intermingled). The\niterative conception was first suggested by Kurt Gödel in [1933],\nin connection with technical work by von Neumann and Zermelo a few\nyears earlier; Gödel would insist on the idea in his well-known\npaper on Cantor’s continuum problem. It came only post\nfacto, after very substantial amounts of set theory had been\ndeveloped and fully systematized.\n\nThis variety of conflicting viewpoints contributed much to the overall\nconfusion, but there was more. In addition to the paradoxes discussed\nabove (set-theoretic paradoxes, as we say), the list of\n“logical” paradoxes included a whole array of further ones\n(later called “semantic”). Among these are paradoxes due\nto Russell, Richard, König, Berry, Grelling, etc., as well as the\nancient liar paradox due to Epimenides. And the diagnoses and proposed\ncures for the damage were tremendously varied. Some authors, like\nRussell, thought it was essential to find a new logical system that\ncould solve all the paradoxes at once. This led him into the ramified\ntype theory that formed the basis of Principia Mathematica (3\nvolumes, Whitehead and Russell 1910–1913), his joint work with Alfred\nWhitehead. Other authors, like Zermelo, believed that most of those\nparadoxes dissolved as soon as one worked within a restricted\naxiomatic system. They concentrated on the “set-theoretic”\nparadoxes (as we have done above), and were led to search for\naxiomatic systems of set theory.\n\nEven more importantly, the questions left open by Cantor and\nemphasized by Hilbert in his first problem of 1900 caused heated\ndebate. At the International Congress of Mathematicians at Heidelberg,\n1904, Gyula (Julius) König proposed a very detailed proof that\nthe cardinality of the continuum cannot be any of\nCantor’s alephs. His proof was only flawed because he had relied\non a result previously “proven” by Felix Bernstein, a\nstudent of Cantor and Hilbert. It took some months for Felix Hausdorff\nto identify the flaw and correct it by properly stating the special\nconditions under which Bernstein’s result was valid (see\nHausdorff 2001, vol. 1). Once thus corrected, König’s\ntheorem became one of the very few results restricting the possible\nsolutions of the continuum problem, implying, e.g., that\n\\(\\textit{card}(\\mathbf{R})\\) is not equal to \\(\\aleph_{\\omega}\\).\nMeanwhile, Zermelo was able to present a proof that every set can be\nwell-ordered, using the Axiom of Choice [1904]. During the following\nyear, prominent mathematicians in Germany, France, Italy and England\ndiscussed the Axiom of Choice and its acceptability.\n\nThe Axiom of Choice states: For every set \\(A\\) of non-empty sets, there exists a set that has exactly one element in common with each set in \\(A\\).\nThis started a whole era during which the Axiom of Choice was treated\nmost carefully as a dubious hypothesis (see the monumental study by\nMoore 1982). And that is ironic, for, among all of the usual\nprinciples of set theory, the Axiom of Choice is the only one that\nexplicitly enforces the existence of some arbitrary subsets. But,\nimportant as this idea had been in motivating Cantor and Dedekind, and\nhowever entangled it is with classical analysis, infinite arbitrary\nsubsets were rejected by many other authors. Among the most\ninfluential ones in the following period, one ought to emphasize the\nnames of Russell, Hermann Weyl, and of course Brouwer.\n Choice was, for a long time, a controversial axiom. On the one\nhand, it is of wide use in mathematics and, indeed, it’s key to\nmany important theorems of analysis (this became gradually clear with\nworks such as Sierpiński [1918]). On the other hand, it has\nrather unintuitive consequences, such as the Banach-Tarski Paradox,\nwhich says that the unit ball can be partitioned into finitely-many\n‘pieces’ (subsets), which can then be rearranged to form\ntwo unit balls (see Tomkowicz & Wagon [2019]). The objections to\nthe axiom arise from the fact that it asserts the existence of sets\nthat cannot be explicitly defined. During the 1920s and 1930s, there\nexisted the ritual practice of mentioning it explicitly, whenever a\ntheorem would depend on the axiom. This stopped only after\nGödel’s proof of relative consistency, discussed\nbelow. \n\nThe impressive polemics which surrounded his Well-Ordering Theorem,\nand the most interesting and difficult problem posed by the\nfoundations of mathematics, led Zermelo to concentrate on axiomatic\nset theory. As a result of his incisive analysis, in 1908 he published\nhis axiom system, showing how it blocked the known paradoxes and yet\nallowed for a masterful development of the theory of cardinals and\nordinals. This, however, is the topic of the entry\n Zermelo’s axiomatization of set theory; \nalso, on the life and work of Zermelo, see Ebbinghaus 2015.\n",
    "section_title": "3. Critical Period",
    "entry_title": "The Early Development of Set Theory",
    "hierarchy_title": "The Early Development of Set Theory || Critical Period",
    "tokenized_text": [
        "critical",
        "period",
        "critical",
        "period",
        "late",
        "nineteenth",
        "century",
        "widespread",
        "idea",
        "pure",
        "mathematics",
        "nothing",
        "elaborate",
        "form",
        "arithmetic",
        "thus",
        "usual",
        "talk",
        "arithmetisation",
        "mathematics",
        "brought",
        "highest",
        "standard",
        "rigor",
        "dedekind",
        "hilbert",
        "viewpoint",
        "led",
        "idea",
        "grounding",
        "pure",
        "mathematics",
        "set",
        "theory",
        "difficult",
        "step",
        "bringing",
        "forth",
        "viewpoint",
        "establishment",
        "theory",
        "real",
        "number",
        "settheoretic",
        "reduction",
        "natural",
        "number",
        "problem",
        "solved",
        "work",
        "cantor",
        "dedekind",
        "precisely",
        "mathematician",
        "celebrating",
        "full",
        "rigor",
        "finally",
        "attained",
        "serious",
        "problem",
        "emerged",
        "foundation",
        "set",
        "theory",
        "first",
        "cantor",
        "russell",
        "discovered",
        "paradox",
        "set",
        "theory",
        "cantor",
        "led",
        "paradox",
        "introduced",
        "conceptual",
        "sphere",
        "transfinite",
        "number",
        "transfinite",
        "ordinal",
        "order",
        "type",
        "set",
        "predecessor",
        "eg",
        "ω",
        "order",
        "type",
        "ldots",
        "omega",
        "order",
        "type",
        "ldots",
        "omega",
        "omega",
        "thus",
        "initial",
        "segment",
        "series",
        "ordinal",
        "corresponds",
        "immediately",
        "greater",
        "ordinal",
        "whole",
        "series",
        "transfinite",
        "ordinal",
        "would",
        "form",
        "wellordered",
        "set",
        "would",
        "correspond",
        "new",
        "ordinal",
        "number",
        "unacceptable",
        "ordinal",
        "o",
        "would",
        "greater",
        "member",
        "whole",
        "series",
        "particular",
        "o",
        "usually",
        "called",
        "buraliforti",
        "paradox",
        "paradox",
        "ordinal",
        "although",
        "buraliforti",
        "failed",
        "formulate",
        "clearly",
        "see",
        "moore",
        "garciadiego",
        "although",
        "conceivable",
        "cantor",
        "might",
        "found",
        "paradox",
        "early",
        "immediately",
        "introducing",
        "transfinite",
        "ordinal",
        "argument",
        "favour",
        "idea",
        "see",
        "purkert",
        "ilgauds",
        "tait",
        "evidence",
        "indicates",
        "clearly",
        "found",
        "paradoxical",
        "argument",
        "realized",
        "implication",
        "time",
        "also",
        "able",
        "employ",
        "cantor",
        "theorem",
        "yield",
        "cantor",
        "paradox",
        "paradox",
        "aleph",
        "existed",
        "set",
        "cardinal",
        "number",
        "aleph",
        "cantor",
        "theorem",
        "applied",
        "would",
        "give",
        "new",
        "aleph",
        "aleph",
        "aleph",
        "aleph",
        "great",
        "set",
        "theorist",
        "realized",
        "perfectly",
        "well",
        "paradox",
        "fatal",
        "blow",
        "logical",
        "approach",
        "set",
        "favoured",
        "frege",
        "dedekind",
        "cantor",
        "emphasized",
        "view",
        "diametrical",
        "opposition",
        "dedekind",
        "particular",
        "naïve",
        "assumption",
        "welldefined",
        "collection",
        "system",
        "also",
        "consistent",
        "system",
        "see",
        "letter",
        "hilbert",
        "nov",
        "purkert",
        "ilgauds",
        "contrary",
        "often",
        "claimed",
        "cantor",
        "ambiguous",
        "definition",
        "set",
        "paper",
        "intended",
        "diametrically",
        "opposite",
        "logicists",
        "understanding",
        "setsoften",
        "called",
        "naïve",
        "set",
        "theory",
        "could",
        "properly",
        "called",
        "dichotomy",
        "conception",
        "set",
        "following",
        "suggestion",
        "gödel",
        "cantor",
        "thought",
        "could",
        "solve",
        "problem",
        "paradox",
        "distinguishing",
        "consistent",
        "multiplicity",
        "set",
        "inconsistent",
        "multiplicity",
        "absence",
        "explicit",
        "criterion",
        "distinction",
        "simply",
        "verbal",
        "answer",
        "problem",
        "aware",
        "deficiency",
        "new",
        "idea",
        "cantor",
        "never",
        "published",
        "last",
        "paper",
        "preparing",
        "planned",
        "discus",
        "paradox",
        "problem",
        "wellordering",
        "know",
        "quite",
        "well",
        "content",
        "unpublished",
        "paper",
        "cantor",
        "discussed",
        "correspondence",
        "dedekind",
        "hilbert",
        "see",
        "letter",
        "dedekind",
        "cantor",
        "ewald",
        "vol",
        "cantor",
        "presented",
        "argument",
        "relied",
        "buraliforti",
        "paradox",
        "ordinal",
        "aimed",
        "prove",
        "every",
        "set",
        "wellordered",
        "argument",
        "later",
        "rediscovered",
        "british",
        "mathematician",
        "peb",
        "jourdain",
        "open",
        "criticism",
        "work",
        "inconsistent",
        "multiplicity",
        "cantor",
        "term",
        "abovementioned",
        "letter",
        "cantor",
        "paradox",
        "convinced",
        "hilbert",
        "dedekind",
        "important",
        "doubt",
        "concerning",
        "foundation",
        "set",
        "theory",
        "hilbert",
        "formulated",
        "paradox",
        "peckhaus",
        "kahle",
        "discussed",
        "problem",
        "mathematician",
        "göttingen",
        "circle",
        "ernst",
        "zermelo",
        "thus",
        "led",
        "discover",
        "paradox",
        "set",
        "set",
        "member",
        "rang",
        "thomas",
        "independently",
        "discovered",
        "bertrand",
        "russell",
        "led",
        "careful",
        "study",
        "cantor",
        "theorem",
        "conflicted",
        "deeply",
        "russell",
        "belief",
        "universal",
        "set",
        "time",
        "later",
        "june",
        "communicated",
        "contradiction",
        "gottlob",
        "frege",
        "completing",
        "logical",
        "foundation",
        "arithmetic",
        "wellknown",
        "letter",
        "van",
        "heijenoort",
        "frege",
        "reaction",
        "made",
        "clear",
        "profound",
        "impact",
        "contradiction",
        "upon",
        "logicist",
        "program",
        "always",
        "speak",
        "class",
        "extension",
        "concept",
        "know",
        "exception",
        "faced",
        "see",
        "arithmetic",
        "could",
        "given",
        "scientific",
        "foundation",
        "number",
        "could",
        "conceived",
        "logical",
        "object",
        "frege",
        "publication",
        "volume",
        "ii",
        "frege",
        "grundgesetze",
        "russell",
        "work",
        "principle",
        "mathematics",
        "made",
        "mathematical",
        "community",
        "fully",
        "aware",
        "existence",
        "settheoretic",
        "paradox",
        "impact",
        "importance",
        "evidence",
        "even",
        "hilbert",
        "zermelo",
        "fully",
        "appreciated",
        "damage",
        "notice",
        "russellzermelo",
        "paradox",
        "operates",
        "basic",
        "notionsnegation",
        "set",
        "membershipconcepts",
        "widely",
        "regarded",
        "purely",
        "logical",
        "set",
        "r",
        "x",
        "x",
        "notin",
        "x",
        "exists",
        "according",
        "principle",
        "comprehension",
        "allows",
        "open",
        "sentence",
        "determine",
        "class",
        "r",
        "in",
        "r",
        "textit",
        "iff",
        "r",
        "notin",
        "r",
        "direct",
        "contradiction",
        "principle",
        "favoured",
        "frege",
        "russell",
        "obviously",
        "necessary",
        "clarify",
        "foundation",
        "set",
        "theory",
        "overall",
        "situation",
        "make",
        "easy",
        "task",
        "different",
        "competing",
        "viewpoint",
        "widely",
        "divergent",
        "cantor",
        "metaphysical",
        "understanding",
        "set",
        "theory",
        "although",
        "one",
        "sharpest",
        "view",
        "field",
        "could",
        "offer",
        "precise",
        "foundation",
        "clear",
        "somewhat",
        "mysteriously",
        "ernst",
        "schröder",
        "vorlesungen",
        "über",
        "die",
        "algebra",
        "der",
        "logik",
        "one",
        "reject",
        "idea",
        "universal",
        "set",
        "favoured",
        "frege",
        "dedekind",
        "frege",
        "russell",
        "based",
        "approach",
        "principle",
        "comprehension",
        "shown",
        "contradictory",
        "dedekind",
        "avoided",
        "principle",
        "postulated",
        "absolute",
        "universe",
        "set",
        "thing",
        "technical",
        "sense",
        "gedankending",
        "coupled",
        "assumption",
        "full",
        "acceptance",
        "arbitrary",
        "subset",
        "idea",
        "admitting",
        "arbitrary",
        "subset",
        "one",
        "deep",
        "inspiration",
        "cantor",
        "dedekind",
        "none",
        "thematized",
        "modern",
        "understanding",
        "analysis",
        "played",
        "crucial",
        "implicit",
        "background",
        "role",
        "since",
        "worked",
        "within",
        "dirichletriemann",
        "tradition",
        "arbitrary",
        "function",
        "famous",
        "iterative",
        "conception",
        "element",
        "particularly",
        "dedekind",
        "work",
        "iterative",
        "development",
        "number",
        "system",
        "view",
        "system",
        "thing",
        "conspicuously",
        "absent",
        "many",
        "relevant",
        "author",
        "typically",
        "e",
        "g",
        "cantor",
        "iterate",
        "process",
        "set",
        "formation",
        "tended",
        "consider",
        "set",
        "homogeneous",
        "element",
        "element",
        "taken",
        "belong",
        "conceptual",
        "sphere",
        "either",
        "number",
        "point",
        "function",
        "even",
        "physical",
        "particlesbut",
        "intermingled",
        "iterative",
        "conception",
        "first",
        "suggested",
        "kurt",
        "gödel",
        "connection",
        "technical",
        "work",
        "von",
        "neumann",
        "zermelo",
        "year",
        "earlier",
        "gödel",
        "would",
        "insist",
        "idea",
        "wellknown",
        "paper",
        "cantor",
        "continuum",
        "problem",
        "came",
        "post",
        "facto",
        "substantial",
        "amount",
        "set",
        "theory",
        "developed",
        "fully",
        "systematized",
        "variety",
        "conflicting",
        "viewpoint",
        "contributed",
        "much",
        "overall",
        "confusion",
        "addition",
        "paradox",
        "discussed",
        "settheoretic",
        "paradox",
        "say",
        "list",
        "logical",
        "paradox",
        "included",
        "whole",
        "array",
        "one",
        "later",
        "called",
        "semantic",
        "among",
        "paradox",
        "due",
        "russell",
        "richard",
        "könig",
        "berry",
        "grelling",
        "etc",
        "well",
        "ancient",
        "liar",
        "paradox",
        "due",
        "epimenides",
        "diagnosis",
        "proposed",
        "cure",
        "damage",
        "tremendously",
        "varied",
        "author",
        "like",
        "russell",
        "thought",
        "essential",
        "find",
        "new",
        "logical",
        "system",
        "could",
        "solve",
        "paradox",
        "led",
        "ramified",
        "type",
        "theory",
        "formed",
        "basis",
        "principia",
        "mathematica",
        "volume",
        "whitehead",
        "russell",
        "joint",
        "work",
        "alfred",
        "whitehead",
        "author",
        "like",
        "zermelo",
        "believed",
        "paradox",
        "dissolved",
        "soon",
        "one",
        "worked",
        "within",
        "restricted",
        "axiomatic",
        "system",
        "concentrated",
        "settheoretic",
        "paradox",
        "done",
        "led",
        "search",
        "axiomatic",
        "system",
        "set",
        "theory",
        "even",
        "importantly",
        "question",
        "left",
        "open",
        "cantor",
        "emphasized",
        "hilbert",
        "first",
        "problem",
        "caused",
        "heated",
        "debate",
        "international",
        "congress",
        "mathematician",
        "heidelberg",
        "gyula",
        "julius",
        "könig",
        "proposed",
        "detailed",
        "proof",
        "cardinality",
        "continuum",
        "cantor",
        "aleph",
        "proof",
        "flawed",
        "relied",
        "result",
        "previously",
        "proven",
        "felix",
        "bernstein",
        "student",
        "cantor",
        "hilbert",
        "took",
        "month",
        "felix",
        "hausdorff",
        "identify",
        "flaw",
        "correct",
        "properly",
        "stating",
        "special",
        "condition",
        "bernstein",
        "result",
        "valid",
        "see",
        "hausdorff",
        "vol",
        "thus",
        "corrected",
        "könig",
        "theorem",
        "became",
        "one",
        "result",
        "restricting",
        "possible",
        "solution",
        "continuum",
        "problem",
        "implying",
        "eg",
        "textit",
        "card",
        "mathbf",
        "r",
        "equal",
        "aleph_",
        "omega",
        "meanwhile",
        "zermelo",
        "able",
        "present",
        "proof",
        "every",
        "set",
        "wellordered",
        "using",
        "axiom",
        "choice",
        "following",
        "year",
        "prominent",
        "mathematician",
        "germany",
        "france",
        "italy",
        "england",
        "discussed",
        "axiom",
        "choice",
        "acceptability",
        "axiom",
        "choice",
        "state",
        "every",
        "set",
        "a",
        "nonempty",
        "set",
        "exists",
        "set",
        "exactly",
        "one",
        "element",
        "common",
        "set",
        "a",
        "started",
        "whole",
        "era",
        "axiom",
        "choice",
        "treated",
        "carefully",
        "dubious",
        "hypothesis",
        "see",
        "monumental",
        "study",
        "moore",
        "ironic",
        "among",
        "usual",
        "principle",
        "set",
        "theory",
        "axiom",
        "choice",
        "one",
        "explicitly",
        "enforces",
        "existence",
        "arbitrary",
        "subset",
        "important",
        "idea",
        "motivating",
        "cantor",
        "dedekind",
        "however",
        "entangled",
        "classical",
        "analysis",
        "infinite",
        "arbitrary",
        "subset",
        "rejected",
        "many",
        "author",
        "among",
        "influential",
        "one",
        "following",
        "period",
        "one",
        "ought",
        "emphasize",
        "name",
        "russell",
        "hermann",
        "weyl",
        "course",
        "brouwer",
        "choice",
        "long",
        "time",
        "controversial",
        "axiom",
        "one",
        "hand",
        "wide",
        "use",
        "mathematics",
        "indeed",
        "key",
        "many",
        "important",
        "theorem",
        "analysis",
        "became",
        "gradually",
        "clear",
        "work",
        "sierpiński",
        "hand",
        "rather",
        "unintuitive",
        "consequence",
        "banachtarski",
        "paradox",
        "say",
        "unit",
        "ball",
        "partitioned",
        "finitelymany",
        "piece",
        "subset",
        "rearranged",
        "form",
        "two",
        "unit",
        "ball",
        "see",
        "tomkowicz",
        "wagon",
        "objection",
        "axiom",
        "arise",
        "fact",
        "asserts",
        "existence",
        "set",
        "explicitly",
        "defined",
        "s",
        "s",
        "existed",
        "ritual",
        "practice",
        "mentioning",
        "explicitly",
        "whenever",
        "theorem",
        "would",
        "depend",
        "axiom",
        "stopped",
        "gödel",
        "proof",
        "relative",
        "consistency",
        "discussed",
        "impressive",
        "polemic",
        "surrounded",
        "wellordering",
        "theorem",
        "interesting",
        "difficult",
        "problem",
        "posed",
        "foundation",
        "mathematics",
        "led",
        "zermelo",
        "concentrate",
        "axiomatic",
        "set",
        "theory",
        "result",
        "incisive",
        "analysis",
        "published",
        "axiom",
        "system",
        "showing",
        "blocked",
        "known",
        "paradox",
        "yet",
        "allowed",
        "masterful",
        "development",
        "theory",
        "cardinal",
        "ordinal",
        "however",
        "topic",
        "entry",
        "zermelo",
        "axiomatization",
        "set",
        "theory",
        "also",
        "life",
        "work",
        "zermelo",
        "see",
        "ebbinghaus"
    ]
}