{
    "main_text": "Conceptual Issues || Sexual Desire\n1.1 Sexual Desire\n\nThe concept of sexual desire is a central concept in the philosophy of\nsex, one connected to other central concepts, especially sexual\nattraction, sexual pleasure, sexual motives, arousal, and sexual\nactivity (all of which make an appearance in the discussion below). It\nrefers to a biological capacity that human beings have to be attracted\nto others and to seek sexual pleasure and activity, and it refers to\nspecific instances of desiring specific people or activities (when,\ne.g., X experiences sexual desire for Y).\n\nFive broad issues are prominent regarding sexual desire: (1) whether\nit is merely a biological drive, an intentional mental state, or both;\n(2) how it should be defined; (3) whether it is benign or malignant;\n(4) whether acting on it should be morally restricted to particular\ncontexts; and (5) whether it admits of perverted forms. (Section 2\ndiscusses (4) and (5).)\n\nDefinitions of sexual desire in terms of sexual pleasure seem to\nunderstand sexual desire as basically an appetite. On one such\ndefinition, “sexual desire” is “desire for contact\nwith another person’s body and for the pleasure which such\ncontact produces” (Goldman 1977, 268) or “sexual\ndesire” is “the desire for certain bodily pleasures”\n(Primoratz 1999, 46; see also Halwani 2020; Soble 1991, 139–151\nand 1996, 83). Thus, if X feels sexual desire, then\nX desires the touch of another person’s\n(Y’s) body and the sexual pleasure derived through that\ntouch. An alternative definition avoids the conceptual involvement of\nanother person, understanding sexual desire instead as desire for\nsexual pleasures, period. This accommodates cases in which the desire\nis not for the touch of another’s body: some cases of\nmasturbation, voyeurism, and exhibitionism, for example.\n\nThese views have in common the idea that sexual desire is desire for\nbrute bodily pleasures, possibly implying that sexual desire is merely\na biological appetite. If so, they face the objection that they\nmischaracterize the nature of sexual desire, which should instead be\nunderstood as intentional through and through (Morgan 2003b). That is,\nwhenever X sexually desires someone or something, X\ndoes so under a description: X desires Y because\nsomething about Y appeals to X. Even when X\ndesires anonymous sex, X desires “the pleasure of\nanonymous sex” (Morgan 2003b). On the intentional view, sexual\ndesire is no mere appetite but thoroughly infused with meaning.\n\nAlthough the intentional view need not insist on the conceptual\nrequirement of another person, its most common instantiation is the\nidea that sexual desire is interpersonal—that the agent’s\nsexual desire always seeks fulfillment with another person, or at\nleast always ought to seek fulfillment with another person.\nInterpersonal sexual desire involves the “marshalling and\ndirecting of animal urges toward an interpersonal aim, and an\ninterpersonal fulfillment” (Scruton 1986, 289) and might be\nthought to involve multiple levels of awareness: X desires\nY, desires that Y desire X, desires to be\naroused by Y’s desire of X, and so on (Nagel\n1969). Some have thought it should, additionally, be directed to love\n(Scruton 1986: 339; cf. Giles 2008, ch. 3). A normative view that\nsexual desire ought to be interpersonal or interpersonal in a\nspecific way might be rejected as an account of what sexual desire\nis. To be an account of what sexual desire is, an\ninterpersonal account would need to articulate a normatively neutral\ninterpersonal view.\n\nThe pleasure view of sexual desire, however, is not committed to\nunderstanding sexual desire as mere appetite. For example, if\nX wants to masturbate, X is not being led by blind\ninstinct; X can be thinking, “I look forward to\nenjoying the sensations of rubbing my clitoris with my favorite\nvibrator as I fantasize about having sex with my neighbor.” In\nother words, “sexual desire can be focused or selective at the\nsame time as being physical” (Goldman 1977, 279; Halwani 2020,\n124–127).\n\nThe intentional view is plausible in that sexual desire can be quite\ncomplex and that its complexity is not captured well (or at all) by\nthe pleasure view, given that human mentality infuses our most basic\nurges and appetites. But it depends on what we want the pleasure view\nto accomplish. If it is meant to capture the “essence” of\nsexual desire, the two are compatible with each other; if it is meant\nas a detailed description of the depth, complexity, and variety of the\nphenomenon, the pleasure view falls short. Given that definitions are\nnot usually meant to convey the complexity of what they define, we\nshould not expect a definition of sexual desire to be a full-blown\ntheory of it, and we can agree that sexual desire is a complex\nphenomenon.\n\nThis does not mean that the pleasure view of sexual desire is correct,\nonly that its aim or strategy need not be misguided. Indeed, depending\non how it is stated, the pleasure view might be wrong. For example, if\nit conceptually ties sexual desire to sexual pleasure obtained through\nthe touch of another person, sexual desire would then be\nnecessarily interpersonal and might implausibly render many sexual\ndesires as nonsexual, such as some masturbatory desires, voyeurism,\nand exhibitionism. Furthermore, the touch of another\nperson’s body implies that zoophiliac desires are\nnonsexual. Necrophiliac desires would also be nonsexual if\n“person” refers to a living person. A non-interpersonal\ndefinition—for sexual pleasures, period—avoids such\nimplications (Soble 1991 and later editions of the essay, the last\nbeing 2013a; Halwani 2018b, ch. 5).\n\nEven a non-interpersonal pleasure view might face difficulties\nstemming from understanding desire in terms of what it seeks\n(sexual pleasure). Calling the approach that defines sexual desire in\nterms of what it seeks the “object-based strategy,”\nRockney Jacobsen raises difficulties with it (2017, 30). One is\ndefining “sexual pleasure” (see below), which the\nobject-based strategy needs to do to be complete (2017, 33). Second,\nJacobsen rejects the idea that all sexual desires are for sexual\npleasure, giving the example of a couple who has sex to have a baby,\nnot for pleasure (2017, 33; see also 1993). Third, our sexual partners\nwould in principle be dispensable if there are other ways to attain\nthe pleasure. This third objection is not moral—that we use our\nsexual partners as mere instruments—but ontological: sexual\npleasure cannot be the only or common goal to all sexual desires\notherwise the agent would be indifferent between the available ways of\nattaining sexual pleasure. Since this is not true, Jacobsen concludes\nthat sexual desire is not solely for sexual pleasure (2017, 33).\n\nJacobsen prefers the “feature-based” approach, which\ndefines “sexual desire” in terms of “sexual\narousal,” which is the state of being turned on (and that we\noften find ourselves in), manifested in erections, lubricated vaginas,\nflushed faces, and “tingling earlobes” (Jacobsen 2017, 35;\ncf. Shaffer 1978; see also Jacobsen 2006, 226–227). So when\nX sexually desires something (another person, an object, or\nan activity), X desires it because it has a feature that\nX expects to affect X’s sexual arousal\n(Jacobsen 2017, 36). The feature-based strategy is supposed to be\nsuperior to the object-based one because it does not face the\nabove-mentioned three difficulties.\n\nThe feature-based view, however, might pass the buck: either\n“sexual arousal” means what we usually mean by\n“sexual desire” (the examples of sexual\narousal—erections, lubricated vaginas—might serve equally\nwell as examples of sexual desire), or it does not. If the former, we\nwould still need a definition of “sexual arousal,” much\nlike we needed a definition of “sexual desire.” If the\nlatter, we would need an account of what “sexual arousal”\nis, because if it is not the same as sexual desire, what exactly is\nit? Referring back to erections and lubricated vaginas will not do,\nbecause we may ask, “Why aren’t they states of sexual\ndesire?” So defining “sexual desire” in\nterms of sexual arousal might be convincing only if we can understand\n“sexual arousal” independently of “sexual\ndesire” (Halwani 2018b, 170–171).\n\nJacobsen’s example of the couple having sex to procreate merits\ndiscussion. Jacobsen intends it to be a case of sexual desire but not\nfor sexual pleasure. However, the example is under-described because\nthe desire can be understood as the nonsexual desire for procreation.\nTo better address such cases, it is useful to distinguish sexual\nmotives—motives to engage in an activity to experience sexual\npleasure—from nonsexual motives, such as to conceive a child, to\nmake someone jealous, to exact revenge, and to pass the time. One can\nargue that if the couple in question indeed experience sexual desire\nfor the act or each other, their nonsexual motive for procreation does\nnot replace their sexual motive and can be added to it. Although\npeople can have sex from purely nonsexual motives (e.g., many cases of\nsex work), once we postulate the presence of sexual desire, the motive\nof seeking sexual pleasure is present. Motives for having sex, like\nmotives for nonsexual activities, can be mixed, involving sexual and\nnonsexual ones.\n\nOne reason for the insistence on the sexual motive in understanding\nsexual desire is that if sexual desire is partly a biological or\nphysiological state (even if in human beings it is also a mental,\nintentional state), it exerts its pull even with the presence of\nnonsexual motives (see Dent 1984, ch. 2; see also Hamilton 2001, ch.\n9; Webber 2009). Another reason is that without the motive for sexual\npleasure, the idea of sexual desire becomes so broad as to refer to\nany desire for sexual activity, with the danger of obfuscation: we\nwould have to understand a sex worker’s desire for sex with a\nclient as sexual, whereas in fact it is solely financial.\n\nSexual desire’s pull supports pessimist views of sexual desire.\nAlthough pessimism and optimism have moral implications – some\nof which are addressed below – they are based in how pessimism\nand optimism perceive the nature of sexual desire. Pessimists consider\nsexual desire morally dangerous and threatening to our rationality\n(including Christian philosophers such as Augustine and Thomas\nAquinas, Plato, Kant, and Schopenhauer [1859, ch. 44], and, among\ncontemporary philosophers of sex Alan Soble, whose views in\n“Sexual Use” [2013b; 2017b; 2022c] imply with some\ncertainty that he is also a pessimist). Optimism considers sexual\ndesire as generally benign and as bringing people together (it\ncommands a large majority of the philosophers of sex, including\nBertrand Russell 1929, passim; Irving Singer 2001,\npassim; and Martha Nussbaum 1995, 1998), though it recognizes\nthat it can be morally problematic (Morgan 2003a). The issue, then,\nbetween pessimism and optimism concerns not whether sexual desire\ncan be morally problematic, but whether it is so by its\nnature (Soble, with Halwani 2017, 5–8).\n\nSexual pessimism can be deep. Jean-Paul Sartre’s version is that\nsexual desire aims to capture a person in their entirety through their\nbody. To do so, the agent must also make him or herself pure flesh by\nallowing sexual desire to “clog” their consciousness\n(Sartre 1943 [1956, 504]). Thus, “I make myself flesh in the\npresence of the Other in order to appropriate the Other’s\nflesh” (Sartre 1943 [1956, 506]). Another version of deep\npessimism is Kant’s, which considers sexual desire to be for the\nsexual parts or body of another person, not the person’s\n“work and services” (Kant 1930 [1963, 163]; see also 1797,\n6:424–6:427; see below the moral implications of this view).\nSexual desire sets aside another’s humanity and targets their\nflesh. This does not mean that in desiring Y, X\nwould be as happy with Y’s corpse or with Y\nunconscious as with Y alive (as Shrage and Stewart [2015, 6]\nclaim); for X, Y-dead is not at all equally\npreferable to Y-alive. It also does not mean that during sex\nX treats Y as an object with no desires or interests\nof Y’s own. Instead, X treats those interests\nas merely instrumental to the satisfaction of X’s\nsexual desires (Halwani 2018b, ch. 8; Soble 2013b, 2017b; 2022c; see\nalso Herman 1993; O’Neill 1985; Papadaki 2007). A phenomenology\nof sexual desire seems to support the above views, according to which\nin sexually desiring Y, X is attracted to the\nbodily, physical attributes of Y.\n\nSexual optimists claim that although sexual desire can be morally\ndangerous, it need not be and is usually not. They agree that it\nfocuses on the body but do not see this as a problem. Sex intimately\nand pleasurably brings two (or more) people together. It is a force\nfor good, establishing trust and strengthening human bonds. Unlike\nappetites,\n\n\nsexual interest … [is] … an interpersonal\nsensitivity, one that enables us to delight in the mind and character\nof other persons as well as in their flesh… [S]ex may be seen\nas an instinctual agency by which persons respond to one another\nthrough their bodies. (Singer 1984, 382; see also Goldman\n1977, 282–283; Russell 1929 [1970, passim])\n\n\nFor the optimist, Soble notes, “Sexual pleasure is … a\nvaluable thing in its own right, something to be cherished and\npromoted because it has intrinsic and not merely instrumental\nvalue” (Soble, with Halwani 2017, 8).\n",
    "section_title": "1.1 Sexual Desire",
    "entry_title": "Sex and Sexuality",
    "hierarchy_title": "Sex and Sexuality || Conceptual Issues || Sexual Desire",
    "tokenized_text": [
        "conceptual",
        "issue",
        "sexual",
        "desire",
        "sexual",
        "desire",
        "concept",
        "sexual",
        "desire",
        "central",
        "concept",
        "philosophy",
        "sex",
        "one",
        "connected",
        "central",
        "concept",
        "especially",
        "sexual",
        "attraction",
        "sexual",
        "pleasure",
        "sexual",
        "motif",
        "arousal",
        "sexual",
        "activity",
        "make",
        "appearance",
        "discussion",
        "refers",
        "biological",
        "capacity",
        "human",
        "being",
        "attracted",
        "others",
        "seek",
        "sexual",
        "pleasure",
        "activity",
        "refers",
        "specific",
        "instance",
        "desiring",
        "specific",
        "people",
        "activity",
        "eg",
        "x",
        "experience",
        "sexual",
        "desire",
        "five",
        "broad",
        "issue",
        "prominent",
        "regarding",
        "sexual",
        "desire",
        "whether",
        "merely",
        "biological",
        "drive",
        "intentional",
        "mental",
        "state",
        "defined",
        "whether",
        "benign",
        "malignant",
        "whether",
        "acting",
        "morally",
        "restricted",
        "particular",
        "context",
        "whether",
        "admits",
        "perverted",
        "form",
        "section",
        "discus",
        "definition",
        "sexual",
        "desire",
        "term",
        "sexual",
        "pleasure",
        "seem",
        "understand",
        "sexual",
        "desire",
        "basically",
        "appetite",
        "one",
        "definition",
        "sexual",
        "desire",
        "desire",
        "contact",
        "another",
        "person",
        "body",
        "pleasure",
        "contact",
        "produce",
        "goldman",
        "sexual",
        "desire",
        "desire",
        "certain",
        "bodily",
        "pleasure",
        "primoratz",
        "see",
        "also",
        "halwani",
        "soble",
        "thus",
        "x",
        "feel",
        "sexual",
        "desire",
        "x",
        "desire",
        "touch",
        "another",
        "person",
        "body",
        "sexual",
        "pleasure",
        "derived",
        "touch",
        "alternative",
        "definition",
        "avoids",
        "conceptual",
        "involvement",
        "another",
        "person",
        "understanding",
        "sexual",
        "desire",
        "instead",
        "desire",
        "sexual",
        "pleasure",
        "period",
        "accommodates",
        "case",
        "desire",
        "touch",
        "another",
        "body",
        "case",
        "masturbation",
        "voyeurism",
        "exhibitionism",
        "example",
        "view",
        "common",
        "idea",
        "sexual",
        "desire",
        "desire",
        "brute",
        "bodily",
        "pleasure",
        "possibly",
        "implying",
        "sexual",
        "desire",
        "merely",
        "biological",
        "appetite",
        "face",
        "objection",
        "mischaracterize",
        "nature",
        "sexual",
        "desire",
        "instead",
        "understood",
        "intentional",
        "morgan",
        "b",
        "whenever",
        "x",
        "sexually",
        "desire",
        "someone",
        "something",
        "x",
        "description",
        "x",
        "desire",
        "something",
        "appeal",
        "x",
        "even",
        "x",
        "desire",
        "anonymous",
        "sex",
        "x",
        "desire",
        "pleasure",
        "anonymous",
        "sex",
        "morgan",
        "b",
        "intentional",
        "view",
        "sexual",
        "desire",
        "mere",
        "appetite",
        "thoroughly",
        "infused",
        "meaning",
        "although",
        "intentional",
        "view",
        "need",
        "insist",
        "conceptual",
        "requirement",
        "another",
        "person",
        "common",
        "instantiation",
        "idea",
        "sexual",
        "desire",
        "interpersonalthat",
        "agent",
        "sexual",
        "desire",
        "always",
        "seek",
        "fulfillment",
        "another",
        "person",
        "least",
        "always",
        "ought",
        "seek",
        "fulfillment",
        "another",
        "person",
        "interpersonal",
        "sexual",
        "desire",
        "involves",
        "marshalling",
        "directing",
        "animal",
        "urge",
        "toward",
        "interpersonal",
        "aim",
        "interpersonal",
        "fulfillment",
        "scruton",
        "might",
        "thought",
        "involve",
        "multiple",
        "level",
        "awareness",
        "x",
        "desire",
        "desire",
        "desire",
        "x",
        "desire",
        "aroused",
        "desire",
        "x",
        "nagel",
        "thought",
        "additionally",
        "directed",
        "love",
        "scruton",
        "cf",
        "giles",
        "ch",
        "normative",
        "view",
        "sexual",
        "desire",
        "ought",
        "interpersonal",
        "interpersonal",
        "specific",
        "way",
        "might",
        "rejected",
        "account",
        "sexual",
        "desire",
        "account",
        "sexual",
        "desire",
        "interpersonal",
        "account",
        "would",
        "need",
        "articulate",
        "normatively",
        "neutral",
        "interpersonal",
        "view",
        "pleasure",
        "view",
        "sexual",
        "desire",
        "however",
        "committed",
        "understanding",
        "sexual",
        "desire",
        "mere",
        "appetite",
        "example",
        "x",
        "want",
        "masturbate",
        "x",
        "led",
        "blind",
        "instinct",
        "x",
        "thinking",
        "look",
        "forward",
        "enjoying",
        "sensation",
        "rubbing",
        "clitoris",
        "favorite",
        "vibrator",
        "fantasize",
        "sex",
        "neighbor",
        "word",
        "sexual",
        "desire",
        "focused",
        "selective",
        "time",
        "physical",
        "goldman",
        "halwani",
        "intentional",
        "view",
        "plausible",
        "sexual",
        "desire",
        "quite",
        "complex",
        "complexity",
        "captured",
        "well",
        "pleasure",
        "view",
        "given",
        "human",
        "mentality",
        "infuses",
        "basic",
        "urge",
        "appetite",
        "depends",
        "want",
        "pleasure",
        "view",
        "accomplish",
        "meant",
        "capture",
        "essence",
        "sexual",
        "desire",
        "two",
        "compatible",
        "meant",
        "detailed",
        "description",
        "depth",
        "complexity",
        "variety",
        "phenomenon",
        "pleasure",
        "view",
        "fall",
        "short",
        "given",
        "definition",
        "usually",
        "meant",
        "convey",
        "complexity",
        "define",
        "expect",
        "definition",
        "sexual",
        "desire",
        "fullblown",
        "theory",
        "agree",
        "sexual",
        "desire",
        "complex",
        "phenomenon",
        "mean",
        "pleasure",
        "view",
        "sexual",
        "desire",
        "correct",
        "aim",
        "strategy",
        "need",
        "misguided",
        "indeed",
        "depending",
        "stated",
        "pleasure",
        "view",
        "might",
        "wrong",
        "example",
        "conceptually",
        "tie",
        "sexual",
        "desire",
        "sexual",
        "pleasure",
        "obtained",
        "touch",
        "another",
        "person",
        "sexual",
        "desire",
        "would",
        "necessarily",
        "interpersonal",
        "might",
        "implausibly",
        "render",
        "many",
        "sexual",
        "desire",
        "nonsexual",
        "masturbatory",
        "desire",
        "voyeurism",
        "exhibitionism",
        "furthermore",
        "touch",
        "another",
        "person",
        "body",
        "implies",
        "zoophiliac",
        "desire",
        "nonsexual",
        "necrophiliac",
        "desire",
        "would",
        "also",
        "nonsexual",
        "person",
        "refers",
        "living",
        "person",
        "noninterpersonal",
        "definitionfor",
        "sexual",
        "pleasure",
        "periodavoids",
        "implication",
        "soble",
        "later",
        "edition",
        "essay",
        "last",
        "a",
        "halwani",
        "b",
        "ch",
        "even",
        "noninterpersonal",
        "pleasure",
        "view",
        "might",
        "face",
        "difficulty",
        "stemming",
        "understanding",
        "desire",
        "term",
        "seek",
        "sexual",
        "pleasure",
        "calling",
        "approach",
        "defines",
        "sexual",
        "desire",
        "term",
        "seek",
        "objectbased",
        "strategy",
        "rockney",
        "jacobsen",
        "raise",
        "difficulty",
        "one",
        "defining",
        "sexual",
        "pleasure",
        "see",
        "objectbased",
        "strategy",
        "need",
        "complete",
        "second",
        "jacobsen",
        "reject",
        "idea",
        "sexual",
        "desire",
        "sexual",
        "pleasure",
        "giving",
        "example",
        "couple",
        "sex",
        "baby",
        "pleasure",
        "see",
        "also",
        "third",
        "sexual",
        "partner",
        "would",
        "principle",
        "dispensable",
        "way",
        "attain",
        "pleasure",
        "third",
        "objection",
        "moralthat",
        "use",
        "sexual",
        "partner",
        "mere",
        "instrumentsbut",
        "ontological",
        "sexual",
        "pleasure",
        "common",
        "goal",
        "sexual",
        "desire",
        "otherwise",
        "agent",
        "would",
        "indifferent",
        "available",
        "way",
        "attaining",
        "sexual",
        "pleasure",
        "since",
        "true",
        "jacobsen",
        "concludes",
        "sexual",
        "desire",
        "solely",
        "sexual",
        "pleasure",
        "jacobsen",
        "prefers",
        "featurebased",
        "approach",
        "defines",
        "sexual",
        "desire",
        "term",
        "sexual",
        "arousal",
        "state",
        "turned",
        "often",
        "find",
        "manifested",
        "erection",
        "lubricated",
        "vagina",
        "flushed",
        "face",
        "tingling",
        "earlobe",
        "jacobsen",
        "cf",
        "shaffer",
        "see",
        "also",
        "jacobsen",
        "x",
        "sexually",
        "desire",
        "something",
        "another",
        "person",
        "object",
        "activity",
        "x",
        "desire",
        "feature",
        "x",
        "expects",
        "affect",
        "x",
        "sexual",
        "arousal",
        "jacobsen",
        "featurebased",
        "strategy",
        "supposed",
        "superior",
        "objectbased",
        "one",
        "face",
        "abovementioned",
        "three",
        "difficulty",
        "featurebased",
        "view",
        "however",
        "might",
        "pas",
        "buck",
        "either",
        "sexual",
        "arousal",
        "mean",
        "usually",
        "mean",
        "sexual",
        "desire",
        "example",
        "sexual",
        "arousalerections",
        "lubricated",
        "vaginasmight",
        "serve",
        "equally",
        "well",
        "example",
        "sexual",
        "desire",
        "former",
        "would",
        "still",
        "need",
        "definition",
        "sexual",
        "arousal",
        "much",
        "like",
        "needed",
        "definition",
        "sexual",
        "desire",
        "latter",
        "would",
        "need",
        "account",
        "sexual",
        "arousal",
        "sexual",
        "desire",
        "exactly",
        "referring",
        "back",
        "erection",
        "lubricated",
        "vagina",
        "may",
        "ask",
        "state",
        "sexual",
        "desire",
        "defining",
        "sexual",
        "desire",
        "term",
        "sexual",
        "arousal",
        "might",
        "convincing",
        "understand",
        "sexual",
        "arousal",
        "independently",
        "sexual",
        "desire",
        "halwani",
        "b",
        "jacobsen",
        "example",
        "couple",
        "sex",
        "procreate",
        "merit",
        "discussion",
        "jacobsen",
        "intends",
        "case",
        "sexual",
        "desire",
        "sexual",
        "pleasure",
        "however",
        "example",
        "underdescribed",
        "desire",
        "understood",
        "nonsexual",
        "desire",
        "procreation",
        "better",
        "address",
        "case",
        "useful",
        "distinguish",
        "sexual",
        "motivesmotives",
        "engage",
        "activity",
        "experience",
        "sexual",
        "pleasurefrom",
        "nonsexual",
        "motif",
        "conceive",
        "child",
        "make",
        "someone",
        "jealous",
        "exact",
        "revenge",
        "pas",
        "time",
        "one",
        "argue",
        "couple",
        "question",
        "indeed",
        "experience",
        "sexual",
        "desire",
        "act",
        "nonsexual",
        "motive",
        "procreation",
        "replace",
        "sexual",
        "motive",
        "added",
        "although",
        "people",
        "sex",
        "purely",
        "nonsexual",
        "motif",
        "eg",
        "many",
        "case",
        "sex",
        "work",
        "postulate",
        "presence",
        "sexual",
        "desire",
        "motive",
        "seeking",
        "sexual",
        "pleasure",
        "present",
        "motif",
        "sex",
        "like",
        "motif",
        "nonsexual",
        "activity",
        "mixed",
        "involving",
        "sexual",
        "nonsexual",
        "one",
        "one",
        "reason",
        "insistence",
        "sexual",
        "motive",
        "understanding",
        "sexual",
        "desire",
        "sexual",
        "desire",
        "partly",
        "biological",
        "physiological",
        "state",
        "even",
        "human",
        "being",
        "also",
        "mental",
        "intentional",
        "state",
        "exerts",
        "pull",
        "even",
        "presence",
        "nonsexual",
        "motif",
        "see",
        "dent",
        "ch",
        "see",
        "also",
        "hamilton",
        "ch",
        "webber",
        "another",
        "reason",
        "without",
        "motive",
        "sexual",
        "pleasure",
        "idea",
        "sexual",
        "desire",
        "becomes",
        "broad",
        "refer",
        "desire",
        "sexual",
        "activity",
        "danger",
        "obfuscation",
        "would",
        "understand",
        "sex",
        "worker",
        "desire",
        "sex",
        "client",
        "sexual",
        "whereas",
        "fact",
        "solely",
        "financial",
        "sexual",
        "desire",
        "pull",
        "support",
        "pessimist",
        "view",
        "sexual",
        "desire",
        "although",
        "pessimism",
        "optimism",
        "moral",
        "implication",
        "addressed",
        "based",
        "pessimism",
        "optimism",
        "perceive",
        "nature",
        "sexual",
        "desire",
        "pessimist",
        "consider",
        "sexual",
        "desire",
        "morally",
        "dangerous",
        "threatening",
        "rationality",
        "including",
        "christian",
        "philosopher",
        "augustine",
        "thomas",
        "aquinas",
        "plato",
        "kant",
        "schopenhauer",
        "ch",
        "among",
        "contemporary",
        "philosopher",
        "sex",
        "alan",
        "soble",
        "whose",
        "view",
        "sexual",
        "use",
        "b",
        "b",
        "c",
        "imply",
        "certainty",
        "also",
        "pessimist",
        "optimism",
        "considers",
        "sexual",
        "desire",
        "generally",
        "benign",
        "bringing",
        "people",
        "together",
        "command",
        "large",
        "majority",
        "philosopher",
        "sex",
        "including",
        "bertrand",
        "russell",
        "passim",
        "irving",
        "singer",
        "passim",
        "martha",
        "nussbaum",
        "though",
        "recognizes",
        "morally",
        "problematic",
        "morgan",
        "a",
        "issue",
        "pessimism",
        "optimism",
        "concern",
        "whether",
        "sexual",
        "desire",
        "morally",
        "problematic",
        "whether",
        "nature",
        "soble",
        "halwani",
        "sexual",
        "pessimism",
        "deep",
        "jeanpaul",
        "sartre",
        "version",
        "sexual",
        "desire",
        "aim",
        "capture",
        "person",
        "entirety",
        "body",
        "agent",
        "must",
        "also",
        "make",
        "pure",
        "flesh",
        "allowing",
        "sexual",
        "desire",
        "clog",
        "consciousness",
        "sartre",
        "thus",
        "make",
        "flesh",
        "presence",
        "order",
        "appropriate",
        "flesh",
        "sartre",
        "another",
        "version",
        "deep",
        "pessimism",
        "kant",
        "considers",
        "sexual",
        "desire",
        "sexual",
        "part",
        "body",
        "another",
        "person",
        "person",
        "work",
        "service",
        "kant",
        "see",
        "also",
        "see",
        "moral",
        "implication",
        "view",
        "sexual",
        "desire",
        "set",
        "aside",
        "another",
        "humanity",
        "target",
        "flesh",
        "mean",
        "desiring",
        "x",
        "would",
        "happy",
        "corpse",
        "unconscious",
        "alive",
        "shrage",
        "stewart",
        "claim",
        "x",
        "ydead",
        "equally",
        "preferable",
        "yalive",
        "also",
        "mean",
        "sex",
        "x",
        "treat",
        "object",
        "desire",
        "interest",
        "instead",
        "x",
        "treat",
        "interest",
        "merely",
        "instrumental",
        "satisfaction",
        "x",
        "sexual",
        "desire",
        "halwani",
        "b",
        "ch",
        "soble",
        "b",
        "b",
        "c",
        "see",
        "also",
        "herman",
        "neill",
        "papadaki",
        "phenomenology",
        "sexual",
        "desire",
        "seems",
        "support",
        "view",
        "according",
        "sexually",
        "desiring",
        "x",
        "attracted",
        "bodily",
        "physical",
        "attribute",
        "y",
        "sexual",
        "optimist",
        "claim",
        "although",
        "sexual",
        "desire",
        "morally",
        "dangerous",
        "need",
        "usually",
        "agree",
        "focus",
        "body",
        "see",
        "problem",
        "sex",
        "intimately",
        "pleasurably",
        "brings",
        "two",
        "people",
        "together",
        "force",
        "good",
        "establishing",
        "trust",
        "strengthening",
        "human",
        "bond",
        "unlike",
        "appetite",
        "sexual",
        "interest",
        "interpersonal",
        "sensitivity",
        "one",
        "enables",
        "u",
        "delight",
        "mind",
        "character",
        "person",
        "well",
        "flesh",
        "ex",
        "may",
        "seen",
        "instinctual",
        "agency",
        "person",
        "respond",
        "one",
        "another",
        "body",
        "singer",
        "see",
        "also",
        "goldman",
        "russell",
        "passim",
        "optimist",
        "soble",
        "note",
        "sexual",
        "pleasure",
        "valuable",
        "thing",
        "right",
        "something",
        "cherished",
        "promoted",
        "intrinsic",
        "merely",
        "instrumental",
        "value",
        "soble",
        "halwani"
    ]
}