{
    "main_text": "Morality || The moral sense\n2.2 The moral sense\n\nShaftesbury calls this capacity to feel second-order affections the\n“Sense of Right and Wrong” or the “Moral\nSense” (C 2.28–36, 2.40–46, 2.51, 2.53, 2.60),\nalthough the term is not one he emphasizes or explains in detail (see\nRivers 2000a: 124). There is little evidence that he thinks the moral\nsense is a distinct psychological faculty in the way that Hutcheson\ndid. Nevertheless, Shaftesbury does think that the moral sense\n(whether one faculty or a less bounded disposition) is that which\nproduces in us feelings of “like” or “dislike”\nfor our own (first-order) affections. When the moral sense is\noperating properly (when it’s fulfilling its teleological\npurpose), it produces positive feelings towards affections that\npromote the well-being of humanity and negative feelings towards\naffections that detract from the well-being of humanity. The\nsecond-order feelings that the moral sense produces can themselves\nmotivate to action, and people are virtuous if they act from those\nsecond-order feelings. In contrast, non-human animals, because they\nlack the powers of reflection necessary for consciousness of their own\naffections, do not possess a moral sense. So non-human animals are\nincapable of achieving virtue (C 2.28–31).\n\nShaftesbury argues that because our sense of morality is a sentiment,\nit can be opposed only by another sentiment, and not by reason or\nbelief.\n\n\nSense of Right and Wrong therefore being as natural to us as\nnatural Affection itself, and being a first Principle in our\nConstitution and Make; there is no speculative Opinion, Persuasion or\nBelief, which is capable immediately or directly to\nexclude or destroy it… And this Affection being an original\none of earliest rise in the Soul or affectionate Part; nothing\nbeside contrary Affection, by frequent check and controul, can operate\nupon it, so as either to diminish it in part, or destroy it in the\nwhole. (C 2.44).\n\n\nShaftesbury does acknowledge that the sense of right and wrong\nrequires the reflective capacity to conceptualize motives. A creature\nwho “cannot reflect on what he himself does” cannot have a\nsense of right and wrong. For this reason, Shaftesbury says that human\nmorality is based on “rational Affections” (C\n2.36). But it is still affections that morality is based on.\nShaftesbury writes, “So that, by means of this reflected Sense,\nthere arises another kind of Affection towards those very Affections\nthemselves, which have been already felt, and are not become the\nSubject of a new Liking or Dislike” (C 2.28). Reflection paves\nthe way for the feeling of moral sentiment. But the\nsentiment—the “Liking or Dislike,” the\n“Exercise of the Heart” (C 2.30)—is still\nessential.\n\nShaftesbury puts affection in the driver’s seat because he\nbelieves affection alone can motivate. He never states outright what\nHume would explicitly argue for: that reason on its own is\nmotivationally inert. But the Humean claim is implied by what\nShaftesbury does say. Throughout the first version of the\nInquiry, he attributes every instance of motivation to\naffection. He says that reason is necessary “to secure a right\napplication of the Affections,” but there he is granting to\nreason merely the instrumental role of discovering what will best\nbenefit the species (C 2.35). Affection remains that which motivates\nus to pursue that benefit. Shaftesbury says as well that the\nmotivational force of an affection can be directly opposed only by the\nmotivational force of “contrary Affections” (C\n2.44). If a person has a motivating affection, she will\n“necessarily act according to it” unless it is opposed by\nsome other affection (C 2.52). “[T]here is no speculative\nOpinion, Persuasion or Belief, which is capable immediately or\ndirectly to exclude or destroy” a natural affection (C\n2.44). “[N]othing beside contrary Affection, by frequent check\nand control, can operate upon it, so as either to diminish it in part,\nor destroy it in the whole” (C 2.44) Shaftesbury acknowledges\nthat beliefs can cause alterations in the affections, and that the\naltered affections can lead us in directions opposite to those\nwe’d been motivated to follow before. If I come to believe a\nparticularly charismatic person is a great benefactor to humanity, I\nmay then become motivated to emulate behavior of hers to which I would\notherwise have been opposed. If I come to believe that a particular\ngroup of people is trying to destroy humanity, I may become motivated\nto attack them in ways that would previously have offended my sense of\nright and wrong. But belief’s role in motivation is once again\ninstrumental. It operates on my motivation only “indirectly, by\nthe intervention of opposite or of favourable Affections causally\nexcited by any such Belief” (C 2.45). Affection is the source of\nall motivational force. Belief on its own mounts no motivational\npush-back. These ideas are a clear influence on Hutcheson and Hume,\nwho also hold that all motivation is sentimental and that therefore\nmorality is based on sentiment.\n\nOne of the most intensely debated issues in Shaftesbury scholarship\nconcerns the moral sense. The two main views can be called the\nconstitutive interpretation and the representative interpretation.\n\nThe constitutive interpretation holds that morality is constituted by\nthe subjective affective responses of each human. Sidgwick is often\ncited as a proponent of this interpretation. Sidgwick claims that\n“Shaftesbury is the first moralist who distinctly takes\npsychological experience as the basis of ethics” (Sidgwick 1902:\n187) and that Shaftesbury thinks morality is based on a “sense\n[that] may naturally vary from man to man as the palate does”\n(Sidgwick 1902: 212–13). Sidgwick thought that this subjectivist\naspect of Shaftesbury’s view did damage to morality because it\nundermined the reasons that might be given for being moral. Price\nthought something similar, contending that Shaftesbury’s focus\non “affection” led to his “overlooking entirely\n… the authority belonging to virtue” (Price\n1769: 317). Tuveson is in the same camp, contending that\nShaftesbury’s view differed from prior versions of a moral sense\n(such as Henry More’s) by eliminating the role of reason\naltogether.\n\n\nIt is the feeling, not reason, which is the right moral judge; it is\nthe emotions, according to the Inquiry, which are the right\nmoral guide. (Tuveson 1948: 258)\n\n\nIn saying this, Tuveson claims that Shaftesburean moral judgments are\nbased on an immediate reaction—an inclining to or recoiling\nfrom—and not on a discursively-arrived upon “opinion or\nformal judgment” (Tuveson 1960: 53; see Filonowiz 1989: 192).\nTuveson also claims that Shaftesburean moral judgments do not\nrepresent anything in mind-independent reality. According to Tuveson,\nShaftesbury thought that “that the value area of the mind must\nconstitute a world to itself, outside the process of cognition”\n(Tuveson 1960: 54). Those in the constitutive camp may emphasize\nShaftesbury’s influence on Hutcheson and Hume, whose\nsentimentalism is sometimes taken to eschew commitment to\nmind-independent moral properties.\n\nThe representative interpretation holds, in contrast, that the\naffective responses of Shaftesbury’s moral sense represent moral\nfacts or properties that exist independently of our reactions to them.\nIrwin advances this view when he claims that Shaftesbury “treats\nthe moral sense as a sign of objective moral properties, not as their\nmetaphysical basis” (Irwin 2008: 369), and that the moral sense\nhas “an indicative (or detective) role.”; According to\nIrwin, Shaftesbury believes that moral properties have a\n“logical independence from” our beliefs and judgments\nabout them (Irwin 2015: 866–7). Schneewind also believes that\nShaftesbury’s moral sense detects objective moral properties,\ncontending that the moral faculty\n\n\nis special because through it we become aware of an objective\norder… The approval and disapproval themselves are feelings,\nbut they reveal that the set of passions being considered either is or\nis not harmonious. (Schneewind 1998: 302)\n\n\nRivers develops a similar view, arguing that our moral faculty enables\nus to “recognize and respond” to the objective property of\nharmony (Rivers 2000a: 143; see also 126). Those in the representative\ncamp may emphasize the influence on Shaftesbury of the Cambridge\nPlatonists, whose rationalist moral theories included a clear\ncommitment to the existence of moral properties independent of our\nreactions (Cassirer 1953: 159–202; Gill 2006: 77–82).\n\nThe representative and constitutive camps can both cite passages that\npose interpretative challenges to the other side.\n\nIn favor of the representative interpretation and challenging for the\nconstitutive are claims Shaftesbury makes that seem to imply that\nmoral properties are independent of human reactions. He maintains, for\ninstance, that what is destructive of the human species can never\nbe\n\n\nVirtue of any kind, or in any sense; but must remain still\nhorrid Depravity, notwithstanding any Fashion, Law, Custom, or\nReligion; which may be ill and vitious it-self, but can never\nalter the eternal Measures, and immutable independent Nature\nof Worth and Virtue. (C\n2.35–36)\n\n\nHe also calls himself a “realist,” and seems to do so in a\nway that precludes a constitutive reading (see Irwin 2015 and Carey\n2006: 98–99 and 130–4). As one of his characters puts it\nwhen speaking of the author of the Inquiry:\n\n\nFor being, in respect of Virtue, what you\nlately call’d a Realist; he endeavours to shew,\n“That it is really something in it-self, and in the\nnature of Things: not arbitrary or factitious, (if I may so\nspeak) not constituted from without, or dependent on Custom,\nFancy, or Will; not even on the Supreme\nWill it-self, which can no-way govern it: but being necessarily\ngood, is govern’d by it, and ever uniform with it.” (C\n2.267)\n\n\nShaftesbury says as well that “the principal End” of\nCharacteristicks is\n\n\n“To assert the Reality of a Beauty and\nCharm in moral as well as\nnatural Subjects; and to demonstrate the Reasonableness of a\nproportionate Taste, and\ndeterminate Choice, in Life\nand Manners.” The Standard of\nthis kind, and the noted Character of Moral Truth\n[are] firmly establish’d in Nature\nit-self. (C 3.303; see 1.336)\n\n\nThose in the representative camp can also claim support from\nShaftesbury’s comparison of virtue to beauty. Shaftesbury\ncontends that beauty is a mind-independent, objective property (more\non this below). But since aesthetic responses are representative of\nmind-independent reality, and our moral responses are similar or\nperhaps identical to our aesthetic responses, it follows that our\nmoral responses are representative as well (Schneewind 1998:\n303–4; Carey 2006: 107, 125, and 132–4).\n\nIn favor of the constitutive interpretation and challenging for the\nrepresentative are statements Shaftesbury makes that seem to imply\nthat the basis for virtue is dependent only on human reactions and\nthus insensitive to any mind-independent fact (Taylor 1989:\n256–7; Den Uyl 1998: 90; Gill 2000: 538–47). He says, for\ninstance, that our reason to be virtuous is impervious even to the\nsupposition that we know nothing of the external world.\n\n\nFor let us carry Scepticism ever so far, let us doubt, if we\ncan, of every thing about us; we cannot doubt of what passes\nwithin our-selves. Our Passions and Affections are known to\nus. They are certain, whatever the Objects may be,\non which they are employ’d. Nor is it of any concern to our\nArgument, how these exterior Objects stand; whether they are Realitys,\nor mere Illusions; whether we wake or dream. For ill Dreams\nwill be equally disturbing. And a good Dream, if Life be\nnothing else, will be easily and happily pass’d. In this Dream\nof Life, therefore, our Demonstrations have the same force; our\nBalance and Economy hold good, and our Obligation to\nVirtue is in every respect the same. (C\n2.173)\n\n\nIn a similar vein he writes,\n\n\nIf there be no real Amiableness or Deformity in moral Acts,\nthere is at least an imaginary one of full force. (C\n2.43)\n\n\nCommentators on either side of the representative-constitutive divide\nmay try to show that passages that seem troublesome for their\ninterpretation do not mean what the other side claims. Towards that\nend, commentators may try to soft-pedal one set of Shaftesbury’s\nstatements, perhaps emphasizing the different purposes and different\npersonae in Shaftesbury’s writings, or explicating the fuller\ncontext of various quotations in a way that reveals that Shaftesbury\nis not himself endorsing certain claims but rather arguing that even\non assumptions he does not accept his main points about virtue will\nstill stand. Jaffro has argued that Shaftesbury consciously changed\nhis mind, or at least decided that he should change how to express his\nviews, moving from an early account that had subjectivist implications\nto a later account that was more objectivist (Jaffro 2007). Another\npossible response to this interpretative issue is to hold that\nShaftesbury is simply inconsistent, or that he is unaware of the\nimplications of some of his own claims. As Raphael puts it, “The\nfact is that no coherent view can be extracted from Shaftesbury about\nthe moral faculty or about moral theory in general” (Raphael\n1947: 17). Kivy writes,\n\n\nIt has been the opinion of many, from Shaftesbury’s time to our\nown, that no coherent view emerges; and I am inclined, in the last\nanalysis, to agree. (Kivy 2003: 16)\n\n\nDarwall (1995) has developed an interpretation of Shaftesbury’s\nmoral sense that does not fit in either the constitutive or the\nrepresentative camp. According to Darwall, Shaftesbury believes that\nthe normative authority of morality leads to the view that the basis\nof morality is within each agent, which conflicts with interpretations\nthat hold that the moral sense represents something external. But\nDarwall also holds that Shaftesbury believes that there is a\nrationally necessary view of morality that each agent should come to,\nwhich conflicts with interpretations that hold that the moral sense\nproduces subjective and contingent emotional experiences. On\nDarwall’s interpretation, Shaftesbury is concerned with autonomy\nand rationality in a way that warrants classifying him as a clear\nprecursor to Kant. Den Uyl has raised concerns about Darwall’s\ninterpretation by contending that the moral sense is the source of\nfavorable attitudes rather than the law-like rules of a proto-Kantian\nrationalist (Den Uyl 1998: 304). Another objection to Darwall’s\ninterpretation can be found in Irwin, who claims that\nShaftesbury’s moral sense view is externalist—i.e., that\none’s moral sense produces responses that have no necessary\nconnection to one’s motivation or reason to act morally (Irwin\n2015: 877 and 880). Darwall’s interpretation, in contrast,\nrequires a strongly internalist reading of Shaftesbury.\n",
    "section_title": "2.2 The moral sense",
    "entry_title": "Lord Shaftesbury [Anthony Ashley Cooper, 3rd Earl of Shaftesbury]",
    "hierarchy_title": "Lord Shaftesbury [Anthony Ashley Cooper, 3rd Earl of Shaftesbury] || Morality || The moral sense",
    "tokenized_text": [
        "morality",
        "moral",
        "sense",
        "moral",
        "sense",
        "shaftesbury",
        "call",
        "capacity",
        "feel",
        "secondorder",
        "affection",
        "sense",
        "right",
        "wrong",
        "moral",
        "sense",
        "c",
        "although",
        "term",
        "one",
        "emphasizes",
        "explains",
        "detail",
        "see",
        "river",
        "a",
        "little",
        "evidence",
        "think",
        "moral",
        "sense",
        "distinct",
        "psychological",
        "faculty",
        "way",
        "hutcheson",
        "nevertheless",
        "shaftesbury",
        "think",
        "moral",
        "sense",
        "whether",
        "one",
        "faculty",
        "le",
        "bounded",
        "disposition",
        "produce",
        "u",
        "feeling",
        "like",
        "dislike",
        "firstorder",
        "affection",
        "moral",
        "sense",
        "operating",
        "properly",
        "fulfilling",
        "teleological",
        "purpose",
        "produce",
        "positive",
        "feeling",
        "towards",
        "affection",
        "promote",
        "wellbeing",
        "humanity",
        "negative",
        "feeling",
        "towards",
        "affection",
        "detract",
        "wellbeing",
        "humanity",
        "secondorder",
        "feeling",
        "moral",
        "sense",
        "produce",
        "motivate",
        "action",
        "people",
        "virtuous",
        "act",
        "secondorder",
        "feeling",
        "contrast",
        "nonhuman",
        "animal",
        "lack",
        "power",
        "reflection",
        "necessary",
        "consciousness",
        "affection",
        "posse",
        "moral",
        "sense",
        "nonhuman",
        "animal",
        "incapable",
        "achieving",
        "virtue",
        "c",
        "shaftesbury",
        "argues",
        "sense",
        "morality",
        "sentiment",
        "opposed",
        "another",
        "sentiment",
        "reason",
        "belief",
        "sense",
        "right",
        "wrong",
        "therefore",
        "natural",
        "u",
        "natural",
        "affection",
        "first",
        "principle",
        "constitution",
        "make",
        "speculative",
        "opinion",
        "persuasion",
        "belief",
        "capable",
        "immediately",
        "directly",
        "exclude",
        "destroy",
        "it",
        "affection",
        "original",
        "one",
        "earliest",
        "rise",
        "soul",
        "affectionate",
        "part",
        "nothing",
        "beside",
        "contrary",
        "affection",
        "frequent",
        "check",
        "controul",
        "operate",
        "upon",
        "either",
        "diminish",
        "part",
        "destroy",
        "whole",
        "c",
        "shaftesbury",
        "acknowledge",
        "sense",
        "right",
        "wrong",
        "requires",
        "reflective",
        "capacity",
        "conceptualize",
        "motif",
        "creature",
        "reflect",
        "sense",
        "right",
        "wrong",
        "reason",
        "shaftesbury",
        "say",
        "human",
        "morality",
        "based",
        "rational",
        "affection",
        "c",
        "still",
        "affection",
        "morality",
        "based",
        "shaftesbury",
        "writes",
        "mean",
        "reflected",
        "sense",
        "arises",
        "another",
        "kind",
        "affection",
        "towards",
        "affection",
        "already",
        "felt",
        "become",
        "subject",
        "new",
        "liking",
        "dislike",
        "c",
        "reflection",
        "pave",
        "way",
        "feeling",
        "moral",
        "sentiment",
        "sentimentthe",
        "liking",
        "dislike",
        "exercise",
        "heart",
        "c",
        "is",
        "still",
        "essential",
        "shaftesbury",
        "put",
        "affection",
        "driver",
        "seat",
        "belief",
        "affection",
        "alone",
        "motivate",
        "never",
        "state",
        "outright",
        "hume",
        "would",
        "explicitly",
        "argue",
        "reason",
        "motivationally",
        "inert",
        "humean",
        "claim",
        "implied",
        "shaftesbury",
        "say",
        "throughout",
        "first",
        "version",
        "inquiry",
        "attribute",
        "every",
        "instance",
        "motivation",
        "affection",
        "say",
        "reason",
        "necessary",
        "secure",
        "right",
        "application",
        "affection",
        "granting",
        "reason",
        "merely",
        "instrumental",
        "role",
        "discovering",
        "best",
        "benefit",
        "specie",
        "c",
        "affection",
        "remains",
        "motivates",
        "u",
        "pursue",
        "benefit",
        "shaftesbury",
        "say",
        "well",
        "motivational",
        "force",
        "affection",
        "directly",
        "opposed",
        "motivational",
        "force",
        "contrary",
        "affection",
        "c",
        "person",
        "motivating",
        "affection",
        "necessarily",
        "act",
        "according",
        "unless",
        "opposed",
        "affection",
        "c",
        "speculative",
        "opinion",
        "persuasion",
        "belief",
        "capable",
        "immediately",
        "directly",
        "exclude",
        "destroy",
        "natural",
        "affection",
        "c",
        "n",
        "othing",
        "beside",
        "contrary",
        "affection",
        "frequent",
        "check",
        "control",
        "operate",
        "upon",
        "either",
        "diminish",
        "part",
        "destroy",
        "whole",
        "c",
        "shaftesbury",
        "acknowledges",
        "belief",
        "cause",
        "alteration",
        "affection",
        "altered",
        "affection",
        "lead",
        "u",
        "direction",
        "opposite",
        "motivated",
        "follow",
        "come",
        "believe",
        "particularly",
        "charismatic",
        "person",
        "great",
        "benefactor",
        "humanity",
        "may",
        "become",
        "motivated",
        "emulate",
        "behavior",
        "would",
        "otherwise",
        "opposed",
        "come",
        "believe",
        "particular",
        "group",
        "people",
        "trying",
        "destroy",
        "humanity",
        "may",
        "become",
        "motivated",
        "attack",
        "way",
        "would",
        "previously",
        "offended",
        "sense",
        "right",
        "wrong",
        "belief",
        "role",
        "motivation",
        "instrumental",
        "operates",
        "motivation",
        "indirectly",
        "intervention",
        "opposite",
        "favourable",
        "affection",
        "causally",
        "excited",
        "belief",
        "c",
        "affection",
        "source",
        "motivational",
        "force",
        "belief",
        "mount",
        "motivational",
        "pushback",
        "idea",
        "clear",
        "influence",
        "hutcheson",
        "hume",
        "also",
        "hold",
        "motivation",
        "sentimental",
        "therefore",
        "morality",
        "based",
        "sentiment",
        "one",
        "intensely",
        "debated",
        "issue",
        "shaftesbury",
        "scholarship",
        "concern",
        "moral",
        "sense",
        "two",
        "main",
        "view",
        "called",
        "constitutive",
        "interpretation",
        "representative",
        "interpretation",
        "constitutive",
        "interpretation",
        "hold",
        "morality",
        "constituted",
        "subjective",
        "affective",
        "response",
        "human",
        "sidgwick",
        "often",
        "cited",
        "proponent",
        "interpretation",
        "sidgwick",
        "claim",
        "shaftesbury",
        "first",
        "moralist",
        "distinctly",
        "take",
        "psychological",
        "experience",
        "basis",
        "ethic",
        "sidgwick",
        "shaftesbury",
        "think",
        "morality",
        "based",
        "sense",
        "may",
        "naturally",
        "vary",
        "man",
        "man",
        "palate",
        "sidgwick",
        "sidgwick",
        "thought",
        "subjectivist",
        "aspect",
        "shaftesbury",
        "view",
        "damage",
        "morality",
        "undermined",
        "reason",
        "might",
        "given",
        "moral",
        "price",
        "thought",
        "something",
        "similar",
        "contending",
        "shaftesbury",
        "focus",
        "affection",
        "led",
        "overlooking",
        "entirely",
        "authority",
        "belonging",
        "virtue",
        "price",
        "tuveson",
        "camp",
        "contending",
        "shaftesbury",
        "view",
        "differed",
        "prior",
        "version",
        "moral",
        "sense",
        "henry",
        "eliminating",
        "role",
        "reason",
        "altogether",
        "feeling",
        "reason",
        "right",
        "moral",
        "judge",
        "emotion",
        "according",
        "inquiry",
        "right",
        "moral",
        "guide",
        "tuveson",
        "saying",
        "tuveson",
        "claim",
        "shaftesburean",
        "moral",
        "judgment",
        "based",
        "immediate",
        "reactionan",
        "inclining",
        "recoiling",
        "fromand",
        "discursivelyarrived",
        "upon",
        "opinion",
        "formal",
        "judgment",
        "tuveson",
        "see",
        "filonowiz",
        "tuveson",
        "also",
        "claim",
        "shaftesburean",
        "moral",
        "judgment",
        "represent",
        "anything",
        "mindindependent",
        "reality",
        "according",
        "tuveson",
        "shaftesbury",
        "thought",
        "value",
        "area",
        "mind",
        "must",
        "constitute",
        "world",
        "outside",
        "process",
        "cognition",
        "tuveson",
        "constitutive",
        "camp",
        "may",
        "emphasize",
        "shaftesbury",
        "influence",
        "hutcheson",
        "hume",
        "whose",
        "sentimentalism",
        "sometimes",
        "taken",
        "eschew",
        "commitment",
        "mindindependent",
        "moral",
        "property",
        "representative",
        "interpretation",
        "hold",
        "contrast",
        "affective",
        "response",
        "shaftesbury",
        "moral",
        "sense",
        "represent",
        "moral",
        "fact",
        "property",
        "exist",
        "independently",
        "reaction",
        "irwin",
        "advance",
        "view",
        "claim",
        "shaftesbury",
        "treat",
        "moral",
        "sense",
        "sign",
        "objective",
        "moral",
        "property",
        "metaphysical",
        "basis",
        "irwin",
        "moral",
        "sense",
        "indicative",
        "detective",
        "role",
        "according",
        "irwin",
        "shaftesbury",
        "belief",
        "moral",
        "property",
        "logical",
        "independence",
        "belief",
        "judgment",
        "irwin",
        "schneewind",
        "also",
        "belief",
        "shaftesbury",
        "moral",
        "sense",
        "detects",
        "objective",
        "moral",
        "property",
        "contending",
        "moral",
        "faculty",
        "special",
        "become",
        "aware",
        "objective",
        "order",
        "approval",
        "disapproval",
        "feeling",
        "reveal",
        "set",
        "passion",
        "considered",
        "either",
        "harmonious",
        "schneewind",
        "river",
        "develops",
        "similar",
        "view",
        "arguing",
        "moral",
        "faculty",
        "enables",
        "u",
        "recognize",
        "respond",
        "objective",
        "property",
        "harmony",
        "river",
        "a",
        "see",
        "also",
        "representative",
        "camp",
        "may",
        "emphasize",
        "influence",
        "shaftesbury",
        "cambridge",
        "platonist",
        "whose",
        "rationalist",
        "moral",
        "theory",
        "included",
        "clear",
        "commitment",
        "existence",
        "moral",
        "property",
        "independent",
        "reaction",
        "cassirer",
        "gill",
        "representative",
        "constitutive",
        "camp",
        "cite",
        "passage",
        "pose",
        "interpretative",
        "challenge",
        "side",
        "favor",
        "representative",
        "interpretation",
        "challenging",
        "constitutive",
        "claim",
        "shaftesbury",
        "make",
        "seem",
        "imply",
        "moral",
        "property",
        "independent",
        "human",
        "reaction",
        "maintains",
        "instance",
        "destructive",
        "human",
        "specie",
        "never",
        "virtue",
        "kind",
        "sense",
        "must",
        "remain",
        "still",
        "horrid",
        "depravity",
        "notwithstanding",
        "fashion",
        "law",
        "custom",
        "religion",
        "may",
        "ill",
        "vitious",
        "itself",
        "never",
        "alter",
        "eternal",
        "measure",
        "immutable",
        "independent",
        "nature",
        "worth",
        "virtue",
        "c",
        "also",
        "call",
        "realist",
        "seems",
        "way",
        "precludes",
        "constitutive",
        "reading",
        "see",
        "irwin",
        "carey",
        "one",
        "character",
        "put",
        "speaking",
        "author",
        "inquiry",
        "respect",
        "virtue",
        "lately",
        "call",
        "realist",
        "endeavour",
        "shew",
        "really",
        "something",
        "itself",
        "nature",
        "thing",
        "arbitrary",
        "factitious",
        "may",
        "speak",
        "constituted",
        "without",
        "dependent",
        "custom",
        "fancy",
        "even",
        "supreme",
        "itself",
        "noway",
        "govern",
        "necessarily",
        "good",
        "govern",
        "ever",
        "uniform",
        "it",
        "c",
        "shaftesbury",
        "say",
        "well",
        "principal",
        "end",
        "characteristicks",
        "assert",
        "reality",
        "beauty",
        "charm",
        "moral",
        "well",
        "natural",
        "subject",
        "demonstrate",
        "reasonableness",
        "proportionate",
        "taste",
        "determinate",
        "choice",
        "life",
        "manners",
        "standard",
        "kind",
        "noted",
        "character",
        "moral",
        "truth",
        "firmly",
        "establish",
        "nature",
        "itself",
        "c",
        "see",
        "representative",
        "camp",
        "also",
        "claim",
        "support",
        "shaftesbury",
        "comparison",
        "virtue",
        "beauty",
        "shaftesbury",
        "contends",
        "beauty",
        "mindindependent",
        "objective",
        "property",
        "since",
        "aesthetic",
        "response",
        "representative",
        "mindindependent",
        "reality",
        "moral",
        "response",
        "similar",
        "perhaps",
        "identical",
        "aesthetic",
        "response",
        "follows",
        "moral",
        "response",
        "representative",
        "well",
        "schneewind",
        "carey",
        "favor",
        "constitutive",
        "interpretation",
        "challenging",
        "representative",
        "statement",
        "shaftesbury",
        "make",
        "seem",
        "imply",
        "basis",
        "virtue",
        "dependent",
        "human",
        "reaction",
        "thus",
        "insensitive",
        "mindindependent",
        "fact",
        "taylor",
        "den",
        "uyl",
        "gill",
        "say",
        "instance",
        "reason",
        "virtuous",
        "impervious",
        "even",
        "supposition",
        "know",
        "nothing",
        "external",
        "world",
        "let",
        "u",
        "carry",
        "scepticism",
        "ever",
        "far",
        "let",
        "u",
        "doubt",
        "every",
        "thing",
        "u",
        "doubt",
        "pass",
        "within",
        "ourselves",
        "passion",
        "affection",
        "known",
        "u",
        "certain",
        "whatever",
        "object",
        "may",
        "employ",
        "concern",
        "argument",
        "exterior",
        "object",
        "stand",
        "whether",
        "reality",
        "mere",
        "illusion",
        "whether",
        "wake",
        "dream",
        "ill",
        "dream",
        "equally",
        "disturbing",
        "good",
        "dream",
        "life",
        "nothing",
        "else",
        "easily",
        "happily",
        "pas",
        "dream",
        "life",
        "therefore",
        "demonstration",
        "force",
        "balance",
        "economy",
        "hold",
        "good",
        "obligation",
        "virtue",
        "every",
        "respect",
        "c",
        "similar",
        "vein",
        "writes",
        "real",
        "amiableness",
        "deformity",
        "moral",
        "act",
        "least",
        "imaginary",
        "one",
        "full",
        "force",
        "c",
        "commentator",
        "either",
        "side",
        "representativeconstitutive",
        "divide",
        "may",
        "try",
        "show",
        "passage",
        "seem",
        "troublesome",
        "interpretation",
        "mean",
        "side",
        "claim",
        "towards",
        "end",
        "commentator",
        "may",
        "try",
        "softpedal",
        "one",
        "set",
        "shaftesbury",
        "statement",
        "perhaps",
        "emphasizing",
        "different",
        "purpose",
        "different",
        "persona",
        "shaftesbury",
        "writing",
        "explicating",
        "fuller",
        "context",
        "various",
        "quotation",
        "way",
        "reveals",
        "shaftesbury",
        "endorsing",
        "certain",
        "claim",
        "rather",
        "arguing",
        "even",
        "assumption",
        "accept",
        "main",
        "point",
        "virtue",
        "still",
        "stand",
        "jaffro",
        "argued",
        "shaftesbury",
        "consciously",
        "changed",
        "mind",
        "least",
        "decided",
        "change",
        "express",
        "view",
        "moving",
        "early",
        "account",
        "subjectivist",
        "implication",
        "later",
        "account",
        "objectivist",
        "jaffro",
        "another",
        "possible",
        "response",
        "interpretative",
        "issue",
        "hold",
        "shaftesbury",
        "simply",
        "inconsistent",
        "unaware",
        "implication",
        "claim",
        "raphael",
        "put",
        "fact",
        "coherent",
        "view",
        "extracted",
        "shaftesbury",
        "moral",
        "faculty",
        "moral",
        "theory",
        "general",
        "raphael",
        "kivy",
        "writes",
        "opinion",
        "many",
        "shaftesbury",
        "time",
        "coherent",
        "view",
        "emerges",
        "inclined",
        "last",
        "analysis",
        "agree",
        "kivy",
        "darwall",
        "developed",
        "interpretation",
        "shaftesbury",
        "moral",
        "sense",
        "fit",
        "either",
        "constitutive",
        "representative",
        "camp",
        "according",
        "darwall",
        "shaftesbury",
        "belief",
        "normative",
        "authority",
        "morality",
        "lead",
        "view",
        "basis",
        "morality",
        "within",
        "agent",
        "conflict",
        "interpretation",
        "hold",
        "moral",
        "sense",
        "represents",
        "something",
        "external",
        "darwall",
        "also",
        "hold",
        "shaftesbury",
        "belief",
        "rationally",
        "necessary",
        "view",
        "morality",
        "agent",
        "come",
        "conflict",
        "interpretation",
        "hold",
        "moral",
        "sense",
        "produce",
        "subjective",
        "contingent",
        "emotional",
        "experience",
        "darwall",
        "interpretation",
        "shaftesbury",
        "concerned",
        "autonomy",
        "rationality",
        "way",
        "warrant",
        "classifying",
        "clear",
        "precursor",
        "kant",
        "den",
        "uyl",
        "raised",
        "concern",
        "darwall",
        "interpretation",
        "contending",
        "moral",
        "sense",
        "source",
        "favorable",
        "attitude",
        "rather",
        "lawlike",
        "rule",
        "protokantian",
        "rationalist",
        "den",
        "uyl",
        "another",
        "objection",
        "darwall",
        "interpretation",
        "found",
        "irwin",
        "claim",
        "shaftesbury",
        "moral",
        "sense",
        "view",
        "externalistie",
        "one",
        "moral",
        "sense",
        "produce",
        "response",
        "necessary",
        "connection",
        "one",
        "motivation",
        "reason",
        "act",
        "morally",
        "irwin",
        "darwall",
        "interpretation",
        "contrast",
        "requires",
        "strongly",
        "internalist",
        "reading",
        "shaftesbury"
    ]
}