{
    "main_text": "Consciousness, Mind, and Personal Identity || Reflection: Consciousness, Mind, and Personal Identity\n3.3 Reflection: Consciousness, Mind, and Personal Identity\n\nAs the foundation of experience and presupposition of knowledge,\nŚaṅkara’s witnessing consciousness precedes his\nepistemology. The difficulty he faces, however, is how to bridge\nself-illuminating consciousness, which is unchanging and\nnon-relational, to cognition and intentional experience within the\nindividual knower. He develops a reflection or semblance\n(pratibimba or ābhāsa) theory of\nconsciousness to address such issues. The deeper purpose of this\ntheory however is to develop an account for individuals superimposing\nfalse identities on consciousness (see US ch.18 for\nŚaṅkara’s most detailed discussion of reflection, as\nwell as BṛUBh 4.3.7 and ChUBh 6.3.2).\n\nFor Śaṅkara, īśvara’s emanation\ninto the universe not only indicates that the universe is sentient,\nbut also how living beings come to possess phenomenal consciousness\nand identify themselves as individuals. Even though the entire\nuniverse is sentient, individual sentiency is only expressed under the\ncondition of having a mind. He employs the analogy of reflection to\nexplain the relationship of mind and consciousness, and to\nprovisionally wed intrinsic reflexivity with cognitive intentionality.\nHis theory of reflection is also a novel way of addressing the\ndecombination problem in cosmopsychism—the explanatory gap\nbetween universal and individual organism consciousness. (See Albahari\n2019 on the decombination problem).\n\nŚaṅkara’s common term for the mind is the\n“inner instrument” (antaḥkaraṇa). He\ncategorizes the mind in different ways in accordance with his source\ntexts (see BrSūBh 2.3.32 for example), yet consistently\ndistinguishes between two functions:\n\nthe intellect (buddhi) which is the mental function of\ndetermination and definitive knowing; and\nthe manas, which includes sensory, affective, and\nconative functions as well as indecision.\n\n\nHe also includes two additional functions:\n\nthe I-notion (ahaṃkāra–literally the\n“I-maker”,) which is one’s sense of self; and\nthe power of recollection (citta)\n\n\n(see, e.g., his commentary on Māṇḍūkya\n2. The later Advaita tradition standardized the mind as having this\nfour-fold function). Śaṅkara maintains an Upaniṣadic\nview that minds are materially constituted by sattva, the\nsubtlest aspect of each primary element. Sattva has a\nqualitative predominance of lucidity and transparency. It makes the\nmind akin to the reflective surface of a mirror capable of reflecting\nlight, or like a transparent glass that allows light to pass through\nwhile illuminating variations on its surface. Unlike minds, mediums\nlike rocks are inert because of their opacity. They lack enough\nsattva constitution to be reflective even though they are\nalso fundamentally grounded in consciousness.\n\nŚaṅkara identifies the reflective medium specifically as\nthe buddhi (BṛUBh 4.3.7). Just as light is pervasive\nbut only becomes visible through a reflective medium (because space\ndoes not reveal light), so too is consciousness expressed\nexperientially only in the reflective medium of the intellect. The\nintellect takes on the semblance of consciousness. Consciousness thus\nappears to be located in one’s mind even though all-pervasive.\nThe mind depends on reflected consciousness for its experience of\nitself, like we use a mirror reflection to see ourselves. The mind\nalso depends on consciousness to cognize objects, like using the\nmirror reflection of light to illumine things in darkness. The\nreflection enables intentionality even though the prototype witnessing\nconsciousness is non-intentional and remains untouched in the\nappearance of causation.\n\nReflection is the seed of individuation and the I-notion because mind\nappears to be the locus of consciousness. Mind becomes the reflexive\ncenter of self-identification, manifesting as knower-ship, doer-ship,\nand enjoyer-ship. The reflection further extends through the sense\norgans, which are also predominantly sattva, to encompasses\nthe body’s periphery through the sense of touch. This extension\nforms a constellation of experiential points of reference that\ncircumscribes self-identity as the complex of mind, body, and sense\norgans (see BṛUBh 4.3.7; ChUBh 8.8.1–2; BrSūBh\n2.3.28–30).\n\nŚaṅkara employs another theory, the limitation theory\n(avaccheda), to help explain the individuation of\nconsciousness. This theory counters potential problems arising from\nthe reflection theory, such as assuming a genuine duality of mind and\nconsciousness, or that consciousness undergoes causation and entry, or\nthat it actually resides locatively in the mind. The limitation theory\nexplains that just as we mistakenly perceive nondual space as\ndelimited by an object—for example, a pot delimiting a pot\nspace—so too do we misunderstand non-dual consciousness as\ndelimited by the mind (see GKBh 3.3–9). The pot space is not a\ngenuine limiting property of space because space is not divisible by\nthe pot form. The pot space is an appearance. It is merely an as\nthough limiting property, a conditioning adjunct\n(upādhi) that we superimpose on to space to account for\nparticular functions (e.g., containing a liquid). So too, do people\nmistakenly assume the mind-body-sense complex possesses consciousness\nand that consciousness is intrinsically intentional. In reality, the\nmind-body-sense complex is merely an upādhi that does\nnot possess or limit nondual consciousness.\n\nFor Śaṅkara, the reflection of consciousness is an as\nthough appearance because all-pervasive consciousness is not subject\nto movement or change. Consciousness is not like a substance that\nundergoes modification or entry within time and space. It remains\nuntouched and unaffected, like the prototype image is untouched by its\nreflection or universal space is unaffected by the pot (BrSūBh\n2.3.46). Furthermore, literal entry is also not possible because the\nreflection is less real than its prototype. Śaṅkara argues\nthat a real thing (consciousness) cannot enter into a less real one\n(mind) because they are of two different orders of reality. My limited\nsense of self-identity, what I take to be me, is merely a reflection.\nIt only appears to be my self like a reflected facial image appears to\nbe my face. My actual face, the prototype, is more real than the\nreflection and does not literally enter the mirror (US 18.85–6).\nFurthermore, my facial reflection possesses no existence apart from my\nface. Self-identity with the mind-body-sense organs is similarly\nvirtual, not fully real; yet people remain unaware of this fact\nbecause they are mired in self-ignorance and enamored with their\nreflections.\n\nThe intention of the reflection analogy is not to establish a\ndefinitive metaphysical process of how one becomes conscious; but\nrather to reveal consciousness as untouched, and to point out the\nfundamental epistemological problem of falsely buying into constructed\nself-identities as if they are fundamental features of reality. This\nintention parallels his use of cosmogonies to undermine our assumed\nreality of the world and point back towards the metaphysical ground of\nexistence (see\n §2.2\n above). Similarly, the reflection theory obliquely points back\ntowards the prototype, the witness, which is the ground of pure\nconsciousness underlying the reflection. Recognizing that ground cuts\nthrough mistaken self-identities. The reflection analogy thus provides\na conceptual framework to discriminate consciousness from all points\nof reflected identity from within the starting point of our\nphenomenology. This project is difficult however because consciousness\nis unobjectifiable, situated elusively behind cognition so to speak,\nand is transparent to cognition. Consciousness and intellect cannot be\nseparated like a blade of grass from its sheath (BṛUBh 4.3.7).\nCognition is also subtly embedded in bodily identity and invariably\naccompanied by a sense of knower-ship/I-ness and\nownership/for-me-ness; however, Śaṅkara claims that\nembodiment, knower-ship and ownership are all objectifiable\ncognitions. They are known and therefore not intrinsic to witnessing\nconsciousness.\n\nThe distinction of witnessing consciousness from mind and objects\nappears dualistic from the empirical order perspective but transitions\nto nonduality from the absolute perspective. Witnessing consciousness\nis the bridge between the two orders, an ontological primitive that is\nfundamental to one’s self as well as all reality. Pure\nconsciousness matches the nature of nondual existence as free of name\nand form. Consciousness is “pure”, in that it is free from\nany relation, predication, or intentionality. Consciousness is unlike\nany object because it is unobjectifiable. It is ultimately not even\nsubject to time or space, which are themselves objects of the witness.\nLike pure existence, consciousness is self-established. It has no\nparts, is irreducible, and stands outside of causation and dependence\nrelations. Consciousness is a constant unchanging presence, the only\ncontinuity of existence persisting through the process of infinite\nobject reductions in searching for an object’s metaphysical\nground. It resists qualification, eliminative reduction, or dependence\non a second thing.\n\nŚaṅkara’s philosophical conclusion is that\nnon-reducible existence is numerically identical to pure\nnon-intentional consciousness. Consciousness is nondual. It is the\nintrinsic nature of brahman itself. Consciousness is not\nsimply the witness of one’s experience. It is the ultimate\nground comprising an individual’s self-existence, the single\nself (ātman) of all sentient beings from a blade of\ngrass to īśvara, and the metaphysical foundation of\nthe entire universe.\n",
    "section_title": "3.3 Reflection: Consciousness, Mind, and Personal Identity",
    "entry_title": "Śaṅkara",
    "hierarchy_title": "Śaṅkara || Consciousness, Mind, and Personal Identity || Reflection: Consciousness, Mind, and Personal Identity",
    "tokenized_text": [
        "consciousness",
        "mind",
        "personal",
        "identity",
        "reflection",
        "consciousness",
        "mind",
        "personal",
        "identity",
        "reflection",
        "consciousness",
        "mind",
        "personal",
        "identity",
        "foundation",
        "experience",
        "presupposition",
        "knowledge",
        "śaṅkara",
        "witnessing",
        "consciousness",
        "precedes",
        "epistemology",
        "difficulty",
        "face",
        "however",
        "bridge",
        "selfilluminating",
        "consciousness",
        "unchanging",
        "nonrelational",
        "cognition",
        "intentional",
        "experience",
        "within",
        "individual",
        "knower",
        "develops",
        "reflection",
        "semblance",
        "pratibimba",
        "ābhāsa",
        "theory",
        "consciousness",
        "address",
        "issue",
        "deeper",
        "purpose",
        "theory",
        "however",
        "develop",
        "account",
        "individual",
        "superimposing",
        "false",
        "identity",
        "consciousness",
        "see",
        "u",
        "ch",
        "śaṅkara",
        "detailed",
        "discussion",
        "reflection",
        "well",
        "bṛubh",
        "chubh",
        "śaṅkara",
        "īśvara",
        "emanation",
        "universe",
        "indicates",
        "universe",
        "sentient",
        "also",
        "living",
        "being",
        "come",
        "posse",
        "phenomenal",
        "consciousness",
        "identify",
        "individual",
        "even",
        "though",
        "entire",
        "universe",
        "sentient",
        "individual",
        "sentiency",
        "expressed",
        "condition",
        "mind",
        "employ",
        "analogy",
        "reflection",
        "explain",
        "relationship",
        "mind",
        "consciousness",
        "provisionally",
        "wed",
        "intrinsic",
        "reflexivity",
        "cognitive",
        "intentionality",
        "theory",
        "reflection",
        "also",
        "novel",
        "way",
        "addressing",
        "decombination",
        "problem",
        "cosmopsychismthe",
        "explanatory",
        "gap",
        "universal",
        "individual",
        "organism",
        "consciousness",
        "see",
        "albahari",
        "decombination",
        "problem",
        "śaṅkara",
        "common",
        "term",
        "mind",
        "inner",
        "instrument",
        "antaḥkaraṇa",
        "categorizes",
        "mind",
        "different",
        "way",
        "accordance",
        "source",
        "text",
        "see",
        "brsūbh",
        "example",
        "yet",
        "consistently",
        "distinguishes",
        "two",
        "function",
        "intellect",
        "buddhi",
        "mental",
        "function",
        "determination",
        "definitive",
        "knowing",
        "manas",
        "includes",
        "sensory",
        "affective",
        "conative",
        "function",
        "well",
        "indecision",
        "also",
        "includes",
        "two",
        "additional",
        "function",
        "inotion",
        "ahaṃkāraliterally",
        "imaker",
        "one",
        "sense",
        "self",
        "power",
        "recollection",
        "citta",
        "see",
        "eg",
        "commentary",
        "māṇḍūkya",
        "later",
        "advaita",
        "tradition",
        "standardized",
        "mind",
        "fourfold",
        "function",
        "śaṅkara",
        "maintains",
        "upaniṣadic",
        "view",
        "mind",
        "materially",
        "constituted",
        "sattva",
        "subtlest",
        "aspect",
        "primary",
        "element",
        "sattva",
        "qualitative",
        "predominance",
        "lucidity",
        "transparency",
        "make",
        "mind",
        "akin",
        "reflective",
        "surface",
        "mirror",
        "capable",
        "reflecting",
        "light",
        "like",
        "transparent",
        "glass",
        "allows",
        "light",
        "pas",
        "illuminating",
        "variation",
        "surface",
        "unlike",
        "mind",
        "medium",
        "like",
        "rock",
        "inert",
        "opacity",
        "lack",
        "enough",
        "sattva",
        "constitution",
        "reflective",
        "even",
        "though",
        "also",
        "fundamentally",
        "grounded",
        "consciousness",
        "śaṅkara",
        "identifies",
        "reflective",
        "medium",
        "specifically",
        "buddhi",
        "bṛubh",
        "light",
        "pervasive",
        "becomes",
        "visible",
        "reflective",
        "medium",
        "space",
        "reveal",
        "light",
        "consciousness",
        "expressed",
        "experientially",
        "reflective",
        "medium",
        "intellect",
        "intellect",
        "take",
        "semblance",
        "consciousness",
        "consciousness",
        "thus",
        "appears",
        "located",
        "one",
        "mind",
        "even",
        "though",
        "allpervasive",
        "mind",
        "depends",
        "reflected",
        "consciousness",
        "experience",
        "like",
        "use",
        "mirror",
        "reflection",
        "see",
        "mind",
        "also",
        "depends",
        "consciousness",
        "cognize",
        "object",
        "like",
        "using",
        "mirror",
        "reflection",
        "light",
        "illumine",
        "thing",
        "darkness",
        "reflection",
        "enables",
        "intentionality",
        "even",
        "though",
        "prototype",
        "witnessing",
        "consciousness",
        "nonintentional",
        "remains",
        "untouched",
        "appearance",
        "causation",
        "reflection",
        "seed",
        "individuation",
        "inotion",
        "mind",
        "appears",
        "locus",
        "consciousness",
        "mind",
        "becomes",
        "reflexive",
        "center",
        "selfidentification",
        "manifesting",
        "knowership",
        "doership",
        "enjoyership",
        "reflection",
        "extends",
        "sense",
        "organ",
        "also",
        "predominantly",
        "sattva",
        "encompasses",
        "body",
        "periphery",
        "sense",
        "touch",
        "extension",
        "form",
        "constellation",
        "experiential",
        "point",
        "reference",
        "circumscribes",
        "selfidentity",
        "complex",
        "mind",
        "body",
        "sense",
        "organ",
        "see",
        "bṛubh",
        "chubh",
        "brsūbh",
        "śaṅkara",
        "employ",
        "another",
        "theory",
        "limitation",
        "theory",
        "avaccheda",
        "help",
        "explain",
        "individuation",
        "consciousness",
        "theory",
        "counter",
        "potential",
        "problem",
        "arising",
        "reflection",
        "theory",
        "assuming",
        "genuine",
        "duality",
        "mind",
        "consciousness",
        "consciousness",
        "undergoes",
        "causation",
        "entry",
        "actually",
        "resides",
        "locatively",
        "mind",
        "limitation",
        "theory",
        "explains",
        "mistakenly",
        "perceive",
        "nondual",
        "space",
        "delimited",
        "objectfor",
        "example",
        "pot",
        "delimiting",
        "pot",
        "spaceso",
        "misunderstand",
        "nondual",
        "consciousness",
        "delimited",
        "mind",
        "see",
        "gkbh",
        "pot",
        "space",
        "genuine",
        "limiting",
        "property",
        "space",
        "space",
        "divisible",
        "pot",
        "form",
        "pot",
        "space",
        "appearance",
        "merely",
        "though",
        "limiting",
        "property",
        "conditioning",
        "adjunct",
        "upādhi",
        "superimpose",
        "space",
        "account",
        "particular",
        "function",
        "eg",
        "containing",
        "liquid",
        "people",
        "mistakenly",
        "assume",
        "mindbodysense",
        "complex",
        "posse",
        "consciousness",
        "consciousness",
        "intrinsically",
        "intentional",
        "reality",
        "mindbodysense",
        "complex",
        "merely",
        "upādhi",
        "posse",
        "limit",
        "nondual",
        "consciousness",
        "śaṅkara",
        "reflection",
        "consciousness",
        "though",
        "appearance",
        "allpervasive",
        "consciousness",
        "subject",
        "movement",
        "change",
        "consciousness",
        "like",
        "substance",
        "undergoes",
        "modification",
        "entry",
        "within",
        "time",
        "space",
        "remains",
        "untouched",
        "unaffected",
        "like",
        "prototype",
        "image",
        "untouched",
        "reflection",
        "universal",
        "space",
        "unaffected",
        "pot",
        "brsūbh",
        "furthermore",
        "literal",
        "entry",
        "also",
        "possible",
        "reflection",
        "le",
        "real",
        "prototype",
        "śaṅkara",
        "argues",
        "real",
        "thing",
        "consciousness",
        "enter",
        "le",
        "real",
        "one",
        "mind",
        "two",
        "different",
        "order",
        "reality",
        "limited",
        "sense",
        "selfidentity",
        "take",
        "merely",
        "reflection",
        "appears",
        "self",
        "like",
        "reflected",
        "facial",
        "image",
        "appears",
        "face",
        "actual",
        "face",
        "prototype",
        "real",
        "reflection",
        "literally",
        "enter",
        "mirror",
        "u",
        "furthermore",
        "facial",
        "reflection",
        "posse",
        "existence",
        "apart",
        "face",
        "selfidentity",
        "mindbodysense",
        "organ",
        "similarly",
        "virtual",
        "fully",
        "real",
        "yet",
        "people",
        "remain",
        "unaware",
        "fact",
        "mired",
        "selfignorance",
        "enamored",
        "reflection",
        "intention",
        "reflection",
        "analogy",
        "establish",
        "definitive",
        "metaphysical",
        "process",
        "one",
        "becomes",
        "conscious",
        "rather",
        "reveal",
        "consciousness",
        "untouched",
        "point",
        "fundamental",
        "epistemological",
        "problem",
        "falsely",
        "buying",
        "constructed",
        "selfidentities",
        "fundamental",
        "feature",
        "reality",
        "intention",
        "parallel",
        "use",
        "cosmogony",
        "undermine",
        "assumed",
        "reality",
        "world",
        "point",
        "back",
        "towards",
        "metaphysical",
        "ground",
        "existence",
        "see",
        "similarly",
        "reflection",
        "theory",
        "obliquely",
        "point",
        "back",
        "towards",
        "prototype",
        "witness",
        "ground",
        "pure",
        "consciousness",
        "underlying",
        "reflection",
        "recognizing",
        "ground",
        "cut",
        "mistaken",
        "selfidentities",
        "reflection",
        "analogy",
        "thus",
        "provides",
        "conceptual",
        "framework",
        "discriminate",
        "consciousness",
        "point",
        "reflected",
        "identity",
        "within",
        "starting",
        "point",
        "phenomenology",
        "project",
        "difficult",
        "however",
        "consciousness",
        "unobjectifiable",
        "situated",
        "elusively",
        "behind",
        "cognition",
        "speak",
        "transparent",
        "cognition",
        "consciousness",
        "intellect",
        "separated",
        "like",
        "blade",
        "grass",
        "sheath",
        "bṛubh",
        "cognition",
        "also",
        "subtly",
        "embedded",
        "bodily",
        "identity",
        "invariably",
        "accompanied",
        "sense",
        "knowershipiness",
        "ownershipformeness",
        "however",
        "śaṅkara",
        "claim",
        "embodiment",
        "knowership",
        "ownership",
        "objectifiable",
        "cognition",
        "known",
        "therefore",
        "intrinsic",
        "witnessing",
        "consciousness",
        "distinction",
        "witnessing",
        "consciousness",
        "mind",
        "object",
        "appears",
        "dualistic",
        "empirical",
        "order",
        "perspective",
        "transition",
        "nonduality",
        "absolute",
        "perspective",
        "witnessing",
        "consciousness",
        "bridge",
        "two",
        "order",
        "ontological",
        "primitive",
        "fundamental",
        "one",
        "self",
        "well",
        "reality",
        "pure",
        "consciousness",
        "match",
        "nature",
        "nondual",
        "existence",
        "free",
        "name",
        "form",
        "consciousness",
        "pure",
        "free",
        "relation",
        "predication",
        "intentionality",
        "consciousness",
        "unlike",
        "object",
        "unobjectifiable",
        "ultimately",
        "even",
        "subject",
        "time",
        "space",
        "object",
        "witness",
        "like",
        "pure",
        "existence",
        "consciousness",
        "selfestablished",
        "part",
        "irreducible",
        "stand",
        "outside",
        "causation",
        "dependence",
        "relation",
        "consciousness",
        "constant",
        "unchanging",
        "presence",
        "continuity",
        "existence",
        "persisting",
        "process",
        "infinite",
        "object",
        "reduction",
        "searching",
        "object",
        "metaphysical",
        "ground",
        "resists",
        "qualification",
        "eliminative",
        "reduction",
        "dependence",
        "second",
        "thing",
        "śaṅkara",
        "philosophical",
        "conclusion",
        "nonreducible",
        "existence",
        "numerically",
        "identical",
        "pure",
        "nonintentional",
        "consciousness",
        "consciousness",
        "nondual",
        "intrinsic",
        "nature",
        "brahman",
        "consciousness",
        "simply",
        "witness",
        "one",
        "experience",
        "ultimate",
        "ground",
        "comprising",
        "individual",
        "selfexistence",
        "single",
        "self",
        "ātman",
        "sentient",
        "being",
        "blade",
        "grass",
        "īśvara",
        "metaphysical",
        "foundation",
        "entire",
        "universe"
    ]
}