{
    "main_text": "Metaphysics: No Self and Emptiness\n2. Metaphysics: No Self and Emptiness\n\nThe most central and most original intellectual discovery of the early\nBuddhist tradition was that we do not need to posit a substantial self\nin order to explain the world of our ordinary experience. Instead,\nBuddhist philosophers hold that we can arrive at much more defensible\nand much more fruitful accounts by exploring ways to understand the\nworld of our experience as a product of impersonal and subpersonal\ncausal processes. Śāntideva’s writings are full of\npassages, including many quotations from earlier sources, that shed\nlight on the nature and implications of this insight, as well as the\nstill more profound teaching of emptiness. Indeed, according to\nŚāntideva and his sources, a direct, intuitive understanding\nof the absence of any self has the power to set us free from cyclic\nexistence. At ŚS 242, he offers this quotation from the\nMysteries of the Tathāgata Sūtra:\n\n\nFor example, Śāntamati, if the root of a tree is cut, all\nthe branches, leaves, and flowers dry up. In just the same way,\nŚāntamati, if you pacify the false view of a real self, all\nreactive emotions are pacified.\n\n\nAs articulated in early Buddhist texts and in the philosophical works\nbelonging to the Abhidharma traditions of the Way of the Disciples\n(Sanskrit Śrāvaka-yāna), the teaching of no\nself depends on a crucial distinction between conventional truth and\nultimate truth. Those entities that exist ultimately have an existence\nthat is robustly metaphysically objective, whereas things at the\nconventional level are said to exist as a result of a process of\nconceptual construction. On some interpretations of this distinction\nin the Abhidharma context, conventional things do not exist at all;\ninstead, it is merely convenient in practice to pretend that they do\n(see Goodman 2005). According to the Buddhist tradition, in order for\nsomething to exist at the ultimate level, it would have to be findable\nunder analysis: that is, careful philosophical examination would have\nto be able to find a clear and defensible explanation of how it\nexists. If conceived of as existing over and above their parts,\ncomposite entities fail this test; when analyzed, they disappear, as\nwe can give no satisfactory account of how they relate to their parts.\nSo according to the Abhidharma, the only entities that could exist\nultimately would have to be utterly simple, having no spatial parts\nand existing for only one single instant of time. The world that we\nexperience is the product of the collective causal activity of immense\nnumbers of these tiny, simple entities. These claims apply even to\nwhat we regard as our own actions, choices and decisions (for further\nexplanation, see Siderits 2007: ch. 3 and ch. 6).\n\nThis picture is quite different from how we ordinarily understand\nhuman life and agency; the ŚS contains several passages\nintended to help us come to grips with what a world of impersonal\ncausation would be like. An especially illuminating analogy can be\nfound at ŚS 262:\n\n\nI have taught the aspects of action,\n\nBut no agent exists in the ten directions.\n\nIt’s just like when trees, agitated by the wind,\n\nProduce fire:\n\nThe wind and the trees do not think,\n\n“We should generate this fire.”\n\nHowever, fire arises.\n\nThe performance of action is similar.\n\n\nA helpful sketch of the overall picture at work in these texts can be\nfound at ŚS 238:\n\n\nCompounded things proceed by means\n\nOf causes and conditions,\n\nMutual causality and dependent arising;\n\nFoolish people don’t realize this.\n\nFor example, by the power of effort,\n\nMuñja grass and balbaja grass can be woven\ntogether into a rope;\n\nA water-wheel turns, but\n\nThe individual parts can’t turn by themselves.\n\nIn the same way, all the aspects of being\n\nExist in dependence on the combination of the others;\n\nFrom the most distant past to the farthest future,\n\nOne of these existing by itself is not apprehended. (SS-G: 230)\n\n\nThe Tibetan ŚS quotes at 226 a passage from the Rice\nSheaf Sūtra that offers an interesting analogy that responds\nto the perennial question of how rebirth could be possible when there\nis no self. Many people, when confronted with the teaching of no self,\nask how we could possibly understand the process of rebirth if there\nis nothing that travels from this life to the next. But as the\nsūtra points out, the moon can be reflected in still water, even\nthough the moon does not travel down to the earth. In the same way, a\ncausal process of dependent arising can lead to a kind of continuity\nfrom one life to another, even though there is no real, substantial\nthing that travels from this body into the next. Another analogy\nintended to make a similar point is found at 239: \n\n\nAlthough a seal produces a seal impression,\n\nWe don’t apprehend that the seal transmigrates.\n\nIt isn’t there [in the impression,] but nor are they wholly\ndifferent.\n\nIn the same way, composite things are not annihilated and not\neternal.\n\n\nThough Śāntideva devotes considerable effort to expounding\nthe reductionist views of the Abhidharma tradition, he does not regard\nthem as the final word in Buddhist philosophy. We can see this\nespecially in Chapter IX of the BCA, which engages with\nphilosophical disagreements between Buddhists and non-Buddhists and\nbetween different schools of thought within the Buddhist tradition.\nThis chapter is so formidably technical, and so terse and compressed,\nas to be open to a range of different interpretations; at places it is\nalmost impenetrable. One thing at least is very clear: the views\nexpressed fall within the Madhyamaka or Middle Way School, a\nphilosophical tradition founded by Nāgārjuna that has been\nprestigious and influential in China and utterly dominant in Tibet.\nThe teachings of the Madhyamaka pose notorious and formidable\ndifficulties of interpretation; fortunately, much valuable scholarship\nhas recently become available that is of great help in delineating the\nrange of plausible interpretations and the considerations that can be\nadvanced to support them. (See especially Siderits and Katsura\n(trans.) 2013; Westerhoff 2009; Garfield 2015: ch. 3; Arnold 2012: ch.\n6.)\n\nThe core claim of Madhyamaka is generally acknowledged to be that\nnothing in the universe has any svabhāva. This Sanskrit\nterm has a complex cluster of meanings that make it extraordinarily\ndifficult to translate. Many scholars have now adopted the translation\n“intrinsic nature” for svabhāva, but it has\nalso been rendered at various times as “essence”,\n“substance”, “own-being”, and “intrinsic\nexistence”, among many other attempts. If something had\nsvabhāva, then it would be possible fully to understand\nthat thing’s nature as it is in itself, independently of any\nrelations it might bear to anything else, and independently of the\nconceptual or linguistic activities of sentient beings. Following\nNāgārjuna, though, Mādhyamika teachers argued that nothing\ncould possibly have svabhāva as just described. If\nsomething did have svabhāva, it would be permanent,\nunchanging, and independent; and Buddhists argue that nothing in the\nworld has these qualities. Instead, everything that arises in our\nexperience, or could so arise, is impermanent, constantly changing,\ndependent on causes and conditions, and understood within a conceptual\nframework. We cannot say or think how or what anything is except by\nmaking overt or covert reference to other things; nor can anything be\nhow or what it is except in relation to other things. Thus, everything\nis empty of intrinsic nature. In the Madhyamaka, this claim is taken\nto be equivalent to the statement that nothing can exist at the\nultimate level of truth; instead, everything that exists, arises or\nhappens does so at the conventional level. Conventional existence, on\nthis view, is actually the only kind of existence that anything has,\nand the only kind that anything could have.\n\nDrawing on the Perfection of Wisdom sūtras, Mādhyamika\nauthors offered various analogies to try to illustrate what it is like\nfor things to lack any intrinsic nature. Of these, probably the most\nhelpful and illuminating is the analogy of a mirage, found, for\ninstance, at ŚS 256. In drawing out this analogy, the\nfirst thing to notice is that a mirage is something that exists.\nSomeone who simply denied reports that, on hot days, roads sometimes\nappear to be covered with pools of water, thus entirely rejecting the\nexistence of mirages, would thereby hold a mistaken view. Similarly,\naccording to the Madhyamaka view, ordinary conventional things,\nincluding shoes and ships and sealing-wax, actually do exist. On the\nother hand, a mirage is deceptive: the way in which it exists is not\nthe same as the way in which it appears to exist. Similarly, the\nobjects of our everyday experience appear to us to exist by way of\nintrinsic nature, while in fact they exist conventionally. Moreover, a\nmirage arises from causes and conditions; just so, ordinary\nconventional things arise from causes and conditions. Finally, and\nmore controversially, a mirage is something that exists only from a\ncertain point of view. In the same way—although not all\ninterpreters of Madhyamaka would accept this way of putting\nit—ordinary things exist only from the perspective of particular\nconceptual schemes, and not in a robustly objective way, not\n“from their own side”.\n\nMany arguments were been advanced by Nāgārjuna, as well as\nby later Buddhist writers, for the claim that there is no intrinsic\nnature; many of these arguments, including most of those found in\nŚāntideva’s works, are thoroughly and sympathetically\ndiscussed in modern secondary sources such as Westerhoff 2009. In his\npresentation of emptiness in chapter 14 of the ŚS,\nthough, Śāntideva devotes considerable space to an argument\nthat has been quite prominent in the Tibetan tradition but is not\nusually foregrounded in Western interpretations of Madhyamaka. A\nrepresentative instance of this argument can be found at\nŚS 248:\n\n\nHere, Your Majesty, when the internal fire element arises, it\ndoesn’t come from anywhere. When it ceases, it doesn’t go\nanywhere. It doesn’t exist, then it exists; and having existed,\nit disappears again, because it has no intrinsic nature. (SS-G:\n237–238)\n\n\nThis argument may lose some of its credibility in our eyes due to the\nprescientific forms in which Śāntideva presents it. However,\nsimilar arguments can be constructed entirely in terms of a\ncontemporary scientific worldview. For example, we could argue that,\nwhen gaseous hydrogen and oxygen react to form water, the liquid state\nof the resulting water doesn’t come from anywhere. And when that\nwater freezes and becomes ice, its liquid state doesn’t go\nanywhere. So liquidity has no intrinsic nature.\n\nWhen presented as a meditative exercise to appropriately prepared\nstudents, this reasoning can produce striking results. Whether it is a\ncogent philosophical argument is an other question. The argument\nevidently depends on suppressed premises, but it’s not entirely\nclear what these are supposed to be. More philosophical work on this\nform of Madhyamaka reasoning could be very helpful.\n\nThough they share a common denial that anything has intrinsic nature,\nMadhyamaka philosophers differ in their views about various other\nphilosophical issues; indeed, some within this tradition hold that the\ngoal of practice is to have no views at all. Within the overall\nframework of Madhyamaka, Tibetan scholars generally classify\nŚāntideva as belonging to the Middle Way Reductio School\n(Skt. Prāsaṅgika-madhyamaka, Tib. dbu ma thal\n‘gyur pa) of Buddhapālita and Candrakīrti. This\nform of Madhyamaka is opposed to the Middle Way Autonomous School\n(Skt. Svātantrika-madhyamaka, Tib. dbu ma rang rgyud\npa). Some modern writers have viewed this doxographical\nidentification with skepticism, noting that Śāntideva takes\nno explicit position on the issues of argumentative and logical\nmethodology that, they believe, were the core questions at issue\nbetween Candrakīrti and Bhāvaviveka. Indeed, these Indian\nmasters would not have used the terms Prāsaṅgika\nand Svātantrika to describe themselves, and some\nscholars have questioned the extent to which Tibetan doxographical\ncategories can helpfully illuminate Indian philosophical discussions,\nas opposed to oversimplifying or distorting them.\n\nOne of the most influential, and controversial, passages in the\nBCA is verse IX.139 (Vaidya 1988: 272–73; C&S:\n129). The great Tibetan philosopher Tsong kha pa cited this passage as\na crucial Indic precedent for the doctrine of “identifying the\nobject of negation”, which plays a central role in his reading\nof Madhyamaka (Tsong kha pa, GT: 126). But modern scholars disagree\nabout whether the verse really does express a form of that doctrine,\nor whether the intended meaning was something else entirely.\n\nIn several places, Śāntideva devotes considerable attention\nto arguing, contrary to what would seem to be obvious common sense,\nthat there is no real thing that I can call “my body”.\nArguments to this effect can be found both in BCA IX and in\nthe long series of verses that concludes the ŚS. These\nare the verses that Bendall and Rouse wrongly identified as quotations\nfrom the Mysteries of the Tathāgata Sūtra, and that\nHarrison discovered to have been composed by Śāntideva\nhimself (see Harrison 2007).\n\nŚāntideva poses a dilemma for anyone who claims that the\nbody is a substantially existing entity. If the body is thought of a\nphysical object that has a specific visible form, then such a body\ndoes not last for an entire lifetime, since the shape and appearance\nof the body change dramatically between early childhood and old age.\nOn the other hand, if the body is understood to be something more\nabstract that remains constant through these visible changes, then we\ncan’t point to it, and it is not able to play the role in our\nself-understanding that we normally expect the body to play. Neither\nview can provide us with a real entity that both withstands analysis\nand is suitable to be the object of our ordinary, attached attitude.\nAs we will see, this reasoning plays an important role in\nŚāntideva’s views about how to live; these will be our\nnext topic of discussion.\n",
    "section_title": "2. Metaphysics: No Self and Emptiness",
    "entry_title": "Śāntideva",
    "hierarchy_title": "Śāntideva || Metaphysics: No Self and Emptiness",
    "tokenized_text": [
        "metaphysics",
        "self",
        "emptiness",
        "metaphysics",
        "self",
        "emptiness",
        "central",
        "original",
        "intellectual",
        "discovery",
        "early",
        "buddhist",
        "tradition",
        "need",
        "posit",
        "substantial",
        "self",
        "order",
        "explain",
        "world",
        "ordinary",
        "experience",
        "instead",
        "buddhist",
        "philosopher",
        "hold",
        "arrive",
        "much",
        "defensible",
        "much",
        "fruitful",
        "account",
        "exploring",
        "way",
        "understand",
        "world",
        "experience",
        "product",
        "impersonal",
        "subpersonal",
        "causal",
        "process",
        "śāntideva",
        "writing",
        "full",
        "passage",
        "including",
        "many",
        "quotation",
        "earlier",
        "source",
        "shed",
        "light",
        "nature",
        "implication",
        "insight",
        "well",
        "still",
        "profound",
        "teaching",
        "emptiness",
        "indeed",
        "according",
        "śāntideva",
        "source",
        "direct",
        "intuitive",
        "understanding",
        "absence",
        "self",
        "power",
        "set",
        "u",
        "free",
        "cyclic",
        "existence",
        "śs",
        "offer",
        "quotation",
        "mystery",
        "tathāgata",
        "sūtra",
        "example",
        "śāntamati",
        "root",
        "tree",
        "cut",
        "branch",
        "leaf",
        "flower",
        "dry",
        "way",
        "śāntamati",
        "pacify",
        "false",
        "view",
        "real",
        "self",
        "reactive",
        "emotion",
        "pacified",
        "articulated",
        "early",
        "buddhist",
        "text",
        "philosophical",
        "work",
        "belonging",
        "abhidharma",
        "tradition",
        "way",
        "disciple",
        "sanskrit",
        "śrāvakayāna",
        "teaching",
        "self",
        "depends",
        "crucial",
        "distinction",
        "conventional",
        "truth",
        "ultimate",
        "truth",
        "entity",
        "exist",
        "ultimately",
        "existence",
        "robustly",
        "metaphysically",
        "objective",
        "whereas",
        "thing",
        "conventional",
        "level",
        "said",
        "exist",
        "result",
        "process",
        "conceptual",
        "construction",
        "interpretation",
        "distinction",
        "abhidharma",
        "context",
        "conventional",
        "thing",
        "exist",
        "instead",
        "merely",
        "convenient",
        "practice",
        "pretend",
        "see",
        "goodman",
        "according",
        "buddhist",
        "tradition",
        "order",
        "something",
        "exist",
        "ultimate",
        "level",
        "would",
        "findable",
        "analysis",
        "careful",
        "philosophical",
        "examination",
        "would",
        "able",
        "find",
        "clear",
        "defensible",
        "explanation",
        "exists",
        "conceived",
        "existing",
        "part",
        "composite",
        "entity",
        "fail",
        "test",
        "analyzed",
        "disappear",
        "give",
        "satisfactory",
        "account",
        "relate",
        "part",
        "according",
        "abhidharma",
        "entity",
        "could",
        "exist",
        "ultimately",
        "would",
        "utterly",
        "simple",
        "spatial",
        "part",
        "existing",
        "one",
        "single",
        "instant",
        "time",
        "world",
        "experience",
        "product",
        "collective",
        "causal",
        "activity",
        "immense",
        "number",
        "tiny",
        "simple",
        "entity",
        "claim",
        "apply",
        "even",
        "regard",
        "action",
        "choice",
        "decision",
        "explanation",
        "see",
        "siderits",
        "ch",
        "ch",
        "picture",
        "quite",
        "different",
        "ordinarily",
        "understand",
        "human",
        "life",
        "agency",
        "śs",
        "contains",
        "several",
        "passage",
        "intended",
        "help",
        "u",
        "come",
        "grip",
        "world",
        "impersonal",
        "causation",
        "would",
        "like",
        "especially",
        "illuminating",
        "analogy",
        "found",
        "śs",
        "taught",
        "aspect",
        "action",
        "agent",
        "exists",
        "ten",
        "direction",
        "like",
        "tree",
        "agitated",
        "wind",
        "produce",
        "fire",
        "wind",
        "tree",
        "think",
        "generate",
        "fire",
        "however",
        "fire",
        "arises",
        "performance",
        "action",
        "similar",
        "helpful",
        "sketch",
        "overall",
        "picture",
        "work",
        "text",
        "found",
        "śs",
        "compounded",
        "thing",
        "proceed",
        "mean",
        "cause",
        "condition",
        "mutual",
        "causality",
        "dependent",
        "arising",
        "foolish",
        "people",
        "realize",
        "example",
        "power",
        "effort",
        "muñja",
        "grass",
        "balbaja",
        "grass",
        "woven",
        "together",
        "rope",
        "waterwheel",
        "turn",
        "individual",
        "part",
        "turn",
        "way",
        "aspect",
        "exist",
        "dependence",
        "combination",
        "others",
        "distant",
        "past",
        "farthest",
        "future",
        "one",
        "existing",
        "apprehended",
        "ssg",
        "tibetan",
        "śs",
        "quote",
        "passage",
        "rice",
        "sheaf",
        "sūtra",
        "offer",
        "interesting",
        "analogy",
        "responds",
        "perennial",
        "question",
        "rebirth",
        "could",
        "possible",
        "self",
        "many",
        "people",
        "confronted",
        "teaching",
        "self",
        "ask",
        "could",
        "possibly",
        "understand",
        "process",
        "rebirth",
        "nothing",
        "travel",
        "life",
        "next",
        "sūtra",
        "point",
        "moon",
        "reflected",
        "still",
        "water",
        "even",
        "though",
        "moon",
        "travel",
        "earth",
        "way",
        "causal",
        "process",
        "dependent",
        "arising",
        "lead",
        "kind",
        "continuity",
        "one",
        "life",
        "another",
        "even",
        "though",
        "real",
        "substantial",
        "thing",
        "travel",
        "body",
        "next",
        "another",
        "analogy",
        "intended",
        "make",
        "similar",
        "point",
        "found",
        "although",
        "seal",
        "produce",
        "seal",
        "impression",
        "apprehend",
        "seal",
        "transmigrates",
        "impression",
        "wholly",
        "different",
        "way",
        "composite",
        "thing",
        "annihilated",
        "eternal",
        "though",
        "śāntideva",
        "devotes",
        "considerable",
        "effort",
        "expounding",
        "reductionist",
        "view",
        "abhidharma",
        "tradition",
        "regard",
        "final",
        "word",
        "buddhist",
        "philosophy",
        "see",
        "especially",
        "chapter",
        "ix",
        "bca",
        "engages",
        "philosophical",
        "disagreement",
        "buddhist",
        "nonbuddhists",
        "different",
        "school",
        "thought",
        "within",
        "buddhist",
        "tradition",
        "chapter",
        "formidably",
        "technical",
        "terse",
        "compressed",
        "open",
        "range",
        "different",
        "interpretation",
        "place",
        "almost",
        "impenetrable",
        "one",
        "thing",
        "least",
        "clear",
        "view",
        "expressed",
        "fall",
        "within",
        "madhyamaka",
        "middle",
        "way",
        "school",
        "philosophical",
        "tradition",
        "founded",
        "nāgārjuna",
        "prestigious",
        "influential",
        "china",
        "utterly",
        "dominant",
        "tibet",
        "teaching",
        "madhyamaka",
        "pose",
        "notorious",
        "formidable",
        "difficulty",
        "interpretation",
        "fortunately",
        "much",
        "valuable",
        "scholarship",
        "recently",
        "become",
        "available",
        "great",
        "help",
        "delineating",
        "range",
        "plausible",
        "interpretation",
        "consideration",
        "advanced",
        "support",
        "see",
        "especially",
        "siderits",
        "katsura",
        "trans",
        "westerhoff",
        "garfield",
        "ch",
        "arnold",
        "ch",
        "core",
        "claim",
        "madhyamaka",
        "generally",
        "acknowledged",
        "nothing",
        "universe",
        "svabhāva",
        "sanskrit",
        "term",
        "complex",
        "cluster",
        "meaning",
        "make",
        "extraordinarily",
        "difficult",
        "translate",
        "many",
        "scholar",
        "adopted",
        "translation",
        "intrinsic",
        "nature",
        "svabhāva",
        "also",
        "rendered",
        "various",
        "time",
        "essence",
        "substance",
        "ownbeing",
        "intrinsic",
        "existence",
        "among",
        "many",
        "attempt",
        "something",
        "svabhāva",
        "would",
        "possible",
        "fully",
        "understand",
        "thing",
        "nature",
        "independently",
        "relation",
        "might",
        "bear",
        "anything",
        "else",
        "independently",
        "conceptual",
        "linguistic",
        "activity",
        "sentient",
        "being",
        "following",
        "nāgārjuna",
        "though",
        "mādhyamika",
        "teacher",
        "argued",
        "nothing",
        "could",
        "possibly",
        "svabhāva",
        "described",
        "something",
        "svabhāva",
        "would",
        "permanent",
        "unchanging",
        "independent",
        "buddhist",
        "argue",
        "nothing",
        "world",
        "quality",
        "instead",
        "everything",
        "arises",
        "experience",
        "could",
        "arise",
        "impermanent",
        "constantly",
        "changing",
        "dependent",
        "cause",
        "condition",
        "understood",
        "within",
        "conceptual",
        "framework",
        "say",
        "think",
        "anything",
        "except",
        "making",
        "overt",
        "covert",
        "reference",
        "thing",
        "anything",
        "except",
        "relation",
        "thing",
        "thus",
        "everything",
        "empty",
        "intrinsic",
        "nature",
        "madhyamaka",
        "claim",
        "taken",
        "equivalent",
        "statement",
        "nothing",
        "exist",
        "ultimate",
        "level",
        "truth",
        "instead",
        "everything",
        "exists",
        "arises",
        "happens",
        "conventional",
        "level",
        "conventional",
        "existence",
        "view",
        "actually",
        "kind",
        "existence",
        "anything",
        "kind",
        "anything",
        "could",
        "drawing",
        "perfection",
        "wisdom",
        "sūtras",
        "mādhyamika",
        "author",
        "offered",
        "various",
        "analogy",
        "try",
        "illustrate",
        "like",
        "thing",
        "lack",
        "intrinsic",
        "nature",
        "probably",
        "helpful",
        "illuminating",
        "analogy",
        "mirage",
        "found",
        "instance",
        "śs",
        "drawing",
        "analogy",
        "first",
        "thing",
        "notice",
        "mirage",
        "something",
        "exists",
        "someone",
        "simply",
        "denied",
        "report",
        "hot",
        "day",
        "road",
        "sometimes",
        "appear",
        "covered",
        "pool",
        "water",
        "thus",
        "entirely",
        "rejecting",
        "existence",
        "mirage",
        "would",
        "thereby",
        "hold",
        "mistaken",
        "view",
        "similarly",
        "according",
        "madhyamaka",
        "view",
        "ordinary",
        "conventional",
        "thing",
        "including",
        "shoe",
        "ship",
        "sealingwax",
        "actually",
        "exist",
        "hand",
        "mirage",
        "deceptive",
        "way",
        "exists",
        "way",
        "appears",
        "exist",
        "similarly",
        "object",
        "everyday",
        "experience",
        "appear",
        "u",
        "exist",
        "way",
        "intrinsic",
        "nature",
        "fact",
        "exist",
        "conventionally",
        "moreover",
        "mirage",
        "arises",
        "cause",
        "condition",
        "ordinary",
        "conventional",
        "thing",
        "arise",
        "cause",
        "condition",
        "finally",
        "controversially",
        "mirage",
        "something",
        "exists",
        "certain",
        "point",
        "view",
        "wayalthough",
        "interpreter",
        "madhyamaka",
        "would",
        "accept",
        "way",
        "putting",
        "itordinary",
        "thing",
        "exist",
        "perspective",
        "particular",
        "conceptual",
        "scheme",
        "robustly",
        "objective",
        "way",
        "side",
        "many",
        "argument",
        "advanced",
        "nāgārjuna",
        "well",
        "later",
        "buddhist",
        "writer",
        "claim",
        "intrinsic",
        "nature",
        "many",
        "argument",
        "including",
        "found",
        "śāntideva",
        "work",
        "thoroughly",
        "sympathetically",
        "discussed",
        "modern",
        "secondary",
        "source",
        "westerhoff",
        "presentation",
        "emptiness",
        "chapter",
        "śs",
        "though",
        "śāntideva",
        "devotes",
        "considerable",
        "space",
        "argument",
        "quite",
        "prominent",
        "tibetan",
        "tradition",
        "usually",
        "foregrounded",
        "western",
        "interpretation",
        "madhyamaka",
        "representative",
        "instance",
        "argument",
        "found",
        "śs",
        "majesty",
        "internal",
        "fire",
        "element",
        "arises",
        "come",
        "anywhere",
        "cease",
        "go",
        "anywhere",
        "exist",
        "exists",
        "existed",
        "disappears",
        "intrinsic",
        "nature",
        "ssg",
        "argument",
        "may",
        "lose",
        "credibility",
        "eye",
        "due",
        "prescientific",
        "form",
        "śāntideva",
        "present",
        "however",
        "similar",
        "argument",
        "constructed",
        "entirely",
        "term",
        "contemporary",
        "scientific",
        "worldview",
        "example",
        "could",
        "argue",
        "gaseous",
        "hydrogen",
        "oxygen",
        "react",
        "form",
        "water",
        "liquid",
        "state",
        "resulting",
        "water",
        "come",
        "anywhere",
        "water",
        "freeze",
        "becomes",
        "ice",
        "liquid",
        "state",
        "go",
        "anywhere",
        "liquidity",
        "intrinsic",
        "nature",
        "presented",
        "meditative",
        "exercise",
        "appropriately",
        "prepared",
        "student",
        "reasoning",
        "produce",
        "striking",
        "result",
        "whether",
        "cogent",
        "philosophical",
        "argument",
        "question",
        "argument",
        "evidently",
        "depends",
        "suppressed",
        "premise",
        "entirely",
        "clear",
        "supposed",
        "philosophical",
        "work",
        "form",
        "madhyamaka",
        "reasoning",
        "could",
        "helpful",
        "though",
        "share",
        "common",
        "denial",
        "anything",
        "intrinsic",
        "nature",
        "madhyamaka",
        "philosopher",
        "differ",
        "view",
        "various",
        "philosophical",
        "issue",
        "indeed",
        "within",
        "tradition",
        "hold",
        "goal",
        "practice",
        "view",
        "within",
        "overall",
        "framework",
        "madhyamaka",
        "tibetan",
        "scholar",
        "generally",
        "classify",
        "śāntideva",
        "belonging",
        "middle",
        "way",
        "reductio",
        "school",
        "skt",
        "prāsaṅgikamadhyamaka",
        "tib",
        "dbu",
        "thal",
        "gyur",
        "pa",
        "buddhapālita",
        "candrakīrti",
        "form",
        "madhyamaka",
        "opposed",
        "middle",
        "way",
        "autonomous",
        "school",
        "skt",
        "svātantrikamadhyamaka",
        "tib",
        "dbu",
        "rang",
        "rgyud",
        "pa",
        "modern",
        "writer",
        "viewed",
        "doxographical",
        "identification",
        "skepticism",
        "noting",
        "śāntideva",
        "take",
        "explicit",
        "position",
        "issue",
        "argumentative",
        "logical",
        "methodology",
        "believe",
        "core",
        "question",
        "issue",
        "candrakīrti",
        "bhāvaviveka",
        "indeed",
        "indian",
        "master",
        "would",
        "used",
        "term",
        "prāsaṅgika",
        "svātantrika",
        "describe",
        "scholar",
        "questioned",
        "extent",
        "tibetan",
        "doxographical",
        "category",
        "helpfully",
        "illuminate",
        "indian",
        "philosophical",
        "discussion",
        "opposed",
        "oversimplifying",
        "distorting",
        "one",
        "influential",
        "controversial",
        "passage",
        "bca",
        "verse",
        "ix",
        "vaidya",
        "c",
        "great",
        "tibetan",
        "philosopher",
        "tsong",
        "kha",
        "pa",
        "cited",
        "passage",
        "crucial",
        "indic",
        "precedent",
        "doctrine",
        "identifying",
        "object",
        "negation",
        "play",
        "central",
        "role",
        "reading",
        "madhyamaka",
        "tsong",
        "kha",
        "pa",
        "gt",
        "modern",
        "scholar",
        "disagree",
        "whether",
        "verse",
        "really",
        "express",
        "form",
        "doctrine",
        "whether",
        "intended",
        "meaning",
        "something",
        "else",
        "entirely",
        "several",
        "place",
        "śāntideva",
        "devotes",
        "considerable",
        "attention",
        "arguing",
        "contrary",
        "would",
        "seem",
        "obvious",
        "common",
        "sense",
        "real",
        "thing",
        "call",
        "body",
        "argument",
        "effect",
        "found",
        "bca",
        "ix",
        "long",
        "series",
        "verse",
        "concludes",
        "śs",
        "verse",
        "bendall",
        "rouse",
        "wrongly",
        "identified",
        "quotation",
        "mystery",
        "tathāgata",
        "sūtra",
        "harrison",
        "discovered",
        "composed",
        "śāntideva",
        "see",
        "harrison",
        "śāntideva",
        "pose",
        "dilemma",
        "anyone",
        "claim",
        "body",
        "substantially",
        "existing",
        "entity",
        "body",
        "thought",
        "physical",
        "object",
        "specific",
        "visible",
        "form",
        "body",
        "last",
        "entire",
        "lifetime",
        "since",
        "shape",
        "appearance",
        "body",
        "change",
        "dramatically",
        "early",
        "childhood",
        "old",
        "age",
        "hand",
        "body",
        "understood",
        "something",
        "abstract",
        "remains",
        "constant",
        "visible",
        "change",
        "point",
        "able",
        "play",
        "role",
        "selfunderstanding",
        "normally",
        "expect",
        "body",
        "play",
        "neither",
        "view",
        "provide",
        "u",
        "real",
        "entity",
        "withstands",
        "analysis",
        "suitable",
        "object",
        "ordinary",
        "attached",
        "attitude",
        "see",
        "reasoning",
        "play",
        "important",
        "role",
        "śāntideva",
        "view",
        "live",
        "next",
        "topic",
        "discussion"
    ]
}