{
    "main_text": "The traditional ontological problem and the Intention Thesis\n1. The traditional ontological problem and the Intention Thesis\n\nAgency is sometimes exercised in concert, as when we walk together,\nseveral individuals undertake painting a house, or a football team\nexecutes a pass\n play.[1]\n It is hardly controversial that there really is a phenomenon falling\nunder labels such as shared activity, and joint or\ncollective action. What is disputed is how to understand it.\nOne way to approach the issues here is to ask what distinguishes\nactions of individuals that together constitute shared activity from\nthose that amount to a mere aggregation of individual acts. What is\nleft over when we subtract what each of us did from what we did\n together?[2]\n\nConsider a case discussed by Searle (1990, 402). A number of\nindividuals are scattered about in a park. Suddenly it starts to rain,\nand each runs to a centrally located shelter. Although there may be\nsome coordination (people tend not to collide into one another),\nrunning to the shelter is not, in the relevant sense, something that\nwe do together. Now imagine another scenario with the same individuals\nexecuting the same movements but as members of a dance troop\nperforming a site-specific piece in that park. In both cases, there is\nno difference in the collection or “summation” of\nindividual behavior: A is running to the shelter, and B is running to\nthe shelter, etc. But the dancers are engaged in collective action,\nwhereas the storm panicked picnickers are not.\n\nSearle suggests that what distinguishes the two cases is not the\noutward behavior, but something “internal”. He hints that\nin the collective case, the outward behavior—everyone running to\nand converging on the shelter—is not a matter of\n coincidence.[3]\n It is, rather, explained as something aimed at by the\nparticipants. This suggests that the internal difference is a matter\nof intention. And, indeed, Searle sees it this way. In both\ncases, a participant has an intention expressed by “I am running\nto the shelter”. But in the collective case this intention\nsomehow derives from and is dependent upon an intention that\nnecessarily adverts to the others, one that might be expressed as\n“We are running to the shelter” (or perhaps “We are\nperforming the part of the piece where….”). It is this\n“we-intention” that distinguishes shared or collective\nactivity from a mere summation or heap of individual acts.\n\nPerhaps it’s premature to conclude, as Searle does, that there has\nto be an “internal” difference here. While most theorists treat\nintention as a psychological attitude (e.g. Davidson 1978, Harman\n1976, Bratman 1986), some work on intention influenced by Anscombe and\nWittgenstein (such as Wilson 1989 and Thompson 2008) understands\nintention fundamentally in terms of intentional action (see the entry\non intention for discussion). It remains to be seen how Anscombian\napproaches to shared agency will develop, though some forays into this\nterritory are to be found in Stoutland 1997 and Laurence 2010.\n\nAnother reservation with invoking intention at this point stems from\nconsideration of unintentional collective action. Appealing to\nintention as Searle does would seem to preclude what some see as a\nreal possibility: that there are φ-ings done jointly in some robust\nsense, but which are not intended under any description. One possible\nexample would be our jointly bringing about some severe environmental\ndamage. This might come about as a side effect of each of us pursuing\nour own projects. No subject intends the severe environmental damage,\nunder any description: no single individual has enough of an impact to\nintend anything that would count as severe environmental damage, and\nas a collective the polluters seem not to be sufficiently integrated\nto count as a subject of intention. Whether this really amounts to a\ncounterexample will depend on whether our damaging the environment was\njoint, a genuine exercise of shared agency. For discussion see Ludwig\n2007; 2016, 182, and Chant 2007.\n\nSetting aside these reservations, we can ask how the attitude of\nintention should be understood if it is to serve as a distinctive mark\nof joint action. One approach is to think of it as an attitude of a\npeculiar, supra-individual\n entity.[4]\n The intention whose content is expressed by We are running to the\nshelter is, on this view, an attitude had by whatever entity is\ndenoted by the ‘we’. On this view whenever people\nact together, they constitute a group that, in a non-figurative sense,\nintends. This entails that groups can be genuine agents and\nsubjects of intentional attitudes.\n\nSearle (1990, 406) rules this out of court, understandably and perhaps\ndogmatically reluctant to embrace a view that leads to a profusion of\nsupra-individual intentional subjects, group minds, or corporate\npersons whenever individuals act together. Such ontological profligacy\nis prompted in part by a straightforward interpretation of the\nlanguage we use to describe joint action, with the plural subject term\nunderstood simply as a referring expression. Ludwig 2016 suggests\ninstead that we think of the subject term as involving implicit\nrestricted quantification over members of the group. This proposal,\ncombined with a Davidsonian event analysis of action descriptions,\nprovides resources for an alternative rendering of the underlying\nlogical form of action descriptions, one that does not encourage the\nsupra-individual view. What would be required instead is that there be\nsome one event for which there is more than one\n agent.[5]\n\n\nThere is reason, moreover, to think that a strategy appealing to\nsupra-individual entities as subjects of intentional states is\nmisplaced if the social phenomenon in question is shared activity.\nIt’s not at all obvious that an individual who is a constituent of a\nsupra-individual entity is necessarily committed to what it\nis up to. For example, consider the U.S., which would on such a view\ncount as supra-individual entity. The U.S. increases research funding\nin physics in order to win the space race with the U.S.S.R. I’m a\ngraduate student benefitting from the additional funding, and I do\nresearch in rocket and satellite technology, and teach physics and\nengineering to undergraduates; indeed, I wouldn’t have gone into the\narea had it not been for the funding opportunities. I am in the\nrelevant sense a constituent of the larger entity - in this case the\nU.S. - but I have no concern with the space race. I’m just doing my\njob, advancing my career, hoping to raise a family and be able to pay\nthe mortgage, etc.; I frankly couldn’t care less about larger\ngeopolitical issues, which are presumably the concern of the\nsupra-individual entity that is the U.S. In contrast, a participant in\nshared activity arguably is committed to the collective endeavor and\nits aims - at least in the sense of commitment to an end implicated in\nany instance of intention or intentional action. So, while we\nhaven’t ruled out that there are supra-individual agents (see below\nfor more discussion), it’s not clear that we need to be committed to\nthem in order to understand shared activity. \n\nIf shared activity does indeed involve commitment on the part of the\nindividual participants, then it seems that some intention-like\nelement of each individual’s psychology must realize or reflect the\nwe-intention that is the mark of shared\n activity.[6]\n The Intention Thesis attributes to each individual\nparticipant in shared activity an intention pertaining to that\nactivity. This participatory intention accounts for each\nindividual’s participatory commitment to the activity, and it serves\nto distinguish one’s action when it is done with others from action\ndone on one’s own.\n [7]\n\nSome of the discussion of the current literature on shared activity\ncan be understood as a debate about the nature of this participatory\nintention and how instances of it in different individuals must be\nrelated to one another so that the individuals could be said to act\ntogether, and share an intention (presumably the intention expressed\nwith the aforementioned we-locution).\n\nParticipatory intentions might, for example, be understood as an\ninstance of an ordinary intention, familiar from the study of\nindividual agency; if we-intentions are identified with, or built out\nof these participatory intentions, we would thus be offered the\nprospect of a reductive account of this we-intention in terms of\nordinary individual intentions. Tuomela and Miller 1988 defend such a\nview. Take an individual who is a member of a group. According to\nTuomela and Miller, this individual has a participatory intention with\nrespect to X if she intends to do her part in X, believes conditions\nfor success of X obtain, and believes that there is mutual belief\namongst members of the group that conditions for success\n obtain.[8]\n (Other work in this general vein include Bratman 1992, MacMahon 2001,\n2005, S. Miller 2001. Tuomela’s later work is rather different, as\nwill be noted below.)\n\nAs a counterexample to the reductive account, Searle imagines each\nmember of a business school graduating class, versed in Adam Smith’s\ntheory of the invisible hand, intending to pursue his selfish\ninterests and thereby intending to do his part in helping humanity.\nSuch an intention, even supplemented with the sort of beliefs that\nTuomela and Miller require, intuitively doesn’t count as the sort of\nintention one has when acting with others, and it is implausible to\nthink that these graduates go on to act collectively. And yet it seems\nto satisfy Tuomela and Miller’s\n analysis.[9]\n Searle’s diagnosis of the problem is that reductive approaches\ndon’t guarantee the element of cooperation that is essential to\nshared activity and necessarily reflected in the attitudes of the\nparticipant (1990, 406). And one cannot respond by inserting the\ncooperative element into the content of the intention, so that what\nthe agent intends is to do her part in shared activity. That\nwould in effect presuppose the notion for which we’re seeking an\naccount (1990,\n 405).[10]\n\nSearle, in contrast to Tuomela and Miller, insists that the\nindividual’s participatory intention (what he calls a collective\nintention) is primitive. The aforementioned “we-intention”\nturns out, for Searle, just to be an individual’s participatory\nintention. But though it is an attitude or state of an individual, it\nis a fundamentally different kind of intention, and not the sort of\nintention that figures in individual action. It should be mentioned\nthat this is a view with similarities to those held by Sellars and\nlater\n Tuomela.[11]\n\nSearle’s version of the intention thesis also involves a rejection\nof anti-individualism in the philosophy of mind (see the entry on\nexternalism about mental content). In particular, whether an\nindividual has this primitively collective participatory intention is\nindependent of what may be going on in the minds of others, or whether\nthere even are any others around her. Thinking to help you with your\nstalled car, I might have the collective intention expressed as we\nare pushing the car. And this is so, even if you’re just\nstretching your calves before a run and not trying to move the car,\nand even if I’m just hallucinating and there is no one\n around.[12]\n",
    "section_title": "1. The traditional ontological problem and the Intention Thesis",
    "entry_title": "Shared Agency",
    "hierarchy_title": "Shared Agency || The traditional ontological problem and the Intention Thesis",
    "tokenized_text": [
        "traditional",
        "ontological",
        "problem",
        "intention",
        "thesis",
        "traditional",
        "ontological",
        "problem",
        "intention",
        "thesis",
        "agency",
        "sometimes",
        "exercised",
        "concert",
        "walk",
        "together",
        "several",
        "individual",
        "undertake",
        "painting",
        "house",
        "football",
        "team",
        "executes",
        "pas",
        "play",
        "hardly",
        "controversial",
        "really",
        "phenomenon",
        "falling",
        "label",
        "shared",
        "activity",
        "joint",
        "collective",
        "action",
        "disputed",
        "understand",
        "one",
        "way",
        "approach",
        "issue",
        "ask",
        "distinguishes",
        "action",
        "individual",
        "together",
        "constitute",
        "shared",
        "activity",
        "amount",
        "mere",
        "aggregation",
        "individual",
        "act",
        "left",
        "subtract",
        "u",
        "together",
        "consider",
        "case",
        "discussed",
        "searle",
        "number",
        "individual",
        "scattered",
        "park",
        "suddenly",
        "start",
        "rain",
        "run",
        "centrally",
        "located",
        "shelter",
        "although",
        "may",
        "coordination",
        "people",
        "tend",
        "collide",
        "one",
        "another",
        "running",
        "shelter",
        "relevant",
        "sense",
        "something",
        "together",
        "imagine",
        "another",
        "scenario",
        "individual",
        "executing",
        "movement",
        "member",
        "dance",
        "troop",
        "performing",
        "sitespecific",
        "piece",
        "park",
        "case",
        "difference",
        "collection",
        "summation",
        "individual",
        "behavior",
        "running",
        "shelter",
        "b",
        "running",
        "shelter",
        "etc",
        "dancer",
        "engaged",
        "collective",
        "action",
        "whereas",
        "storm",
        "panicked",
        "picnicker",
        "searle",
        "suggests",
        "distinguishes",
        "two",
        "case",
        "outward",
        "behavior",
        "something",
        "internal",
        "hint",
        "collective",
        "case",
        "outward",
        "behavioreveryone",
        "running",
        "converging",
        "shelteris",
        "matter",
        "coincidence",
        "rather",
        "explained",
        "something",
        "aimed",
        "participant",
        "suggests",
        "internal",
        "difference",
        "matter",
        "intention",
        "indeed",
        "searle",
        "see",
        "way",
        "case",
        "participant",
        "intention",
        "expressed",
        "running",
        "shelter",
        "collective",
        "case",
        "intention",
        "somehow",
        "derives",
        "dependent",
        "upon",
        "intention",
        "necessarily",
        "advert",
        "others",
        "one",
        "might",
        "expressed",
        "running",
        "shelter",
        "perhaps",
        "performing",
        "part",
        "piece",
        "where",
        "weintention",
        "distinguishes",
        "shared",
        "collective",
        "activity",
        "mere",
        "summation",
        "heap",
        "individual",
        "act",
        "perhaps",
        "premature",
        "conclude",
        "searle",
        "internal",
        "difference",
        "theorist",
        "treat",
        "intention",
        "psychological",
        "attitude",
        "eg",
        "davidson",
        "harman",
        "bratman",
        "work",
        "intention",
        "influenced",
        "anscombe",
        "wittgenstein",
        "wilson",
        "thompson",
        "understands",
        "intention",
        "fundamentally",
        "term",
        "intentional",
        "action",
        "see",
        "entry",
        "intention",
        "discussion",
        "remains",
        "seen",
        "anscombian",
        "approach",
        "shared",
        "agency",
        "develop",
        "though",
        "foray",
        "territory",
        "found",
        "stoutland",
        "laurence",
        "another",
        "reservation",
        "invoking",
        "intention",
        "point",
        "stem",
        "consideration",
        "unintentional",
        "collective",
        "action",
        "appealing",
        "intention",
        "searle",
        "would",
        "seem",
        "preclude",
        "see",
        "real",
        "possibility",
        "φings",
        "done",
        "jointly",
        "robust",
        "sense",
        "intended",
        "description",
        "one",
        "possible",
        "example",
        "would",
        "jointly",
        "bringing",
        "severe",
        "environmental",
        "damage",
        "might",
        "come",
        "side",
        "effect",
        "u",
        "pursuing",
        "project",
        "subject",
        "intends",
        "severe",
        "environmental",
        "damage",
        "description",
        "single",
        "individual",
        "enough",
        "impact",
        "intend",
        "anything",
        "would",
        "count",
        "severe",
        "environmental",
        "damage",
        "collective",
        "polluter",
        "seem",
        "sufficiently",
        "integrated",
        "count",
        "subject",
        "intention",
        "whether",
        "really",
        "amount",
        "counterexample",
        "depend",
        "whether",
        "damaging",
        "environment",
        "joint",
        "genuine",
        "exercise",
        "shared",
        "agency",
        "discussion",
        "see",
        "ludwig",
        "chant",
        "setting",
        "aside",
        "reservation",
        "ask",
        "attitude",
        "intention",
        "understood",
        "serve",
        "distinctive",
        "mark",
        "joint",
        "action",
        "one",
        "approach",
        "think",
        "attitude",
        "peculiar",
        "supraindividual",
        "entity",
        "intention",
        "whose",
        "content",
        "expressed",
        "running",
        "shelter",
        "view",
        "attitude",
        "whatever",
        "entity",
        "denoted",
        "view",
        "whenever",
        "people",
        "act",
        "together",
        "constitute",
        "group",
        "nonfigurative",
        "sense",
        "intends",
        "entail",
        "group",
        "genuine",
        "agent",
        "subject",
        "intentional",
        "attitude",
        "searle",
        "rule",
        "court",
        "understandably",
        "perhaps",
        "dogmatically",
        "reluctant",
        "embrace",
        "view",
        "lead",
        "profusion",
        "supraindividual",
        "intentional",
        "subject",
        "group",
        "mind",
        "corporate",
        "person",
        "whenever",
        "individual",
        "act",
        "together",
        "ontological",
        "profligacy",
        "prompted",
        "part",
        "straightforward",
        "interpretation",
        "language",
        "use",
        "describe",
        "joint",
        "action",
        "plural",
        "subject",
        "term",
        "understood",
        "simply",
        "referring",
        "expression",
        "ludwig",
        "suggests",
        "instead",
        "think",
        "subject",
        "term",
        "involving",
        "implicit",
        "restricted",
        "quantification",
        "member",
        "group",
        "proposal",
        "combined",
        "davidsonian",
        "event",
        "analysis",
        "action",
        "description",
        "provides",
        "resource",
        "alternative",
        "rendering",
        "underlying",
        "logical",
        "form",
        "action",
        "description",
        "one",
        "encourage",
        "supraindividual",
        "view",
        "would",
        "required",
        "instead",
        "one",
        "event",
        "one",
        "agent",
        "reason",
        "moreover",
        "think",
        "strategy",
        "appealing",
        "supraindividual",
        "entity",
        "subject",
        "intentional",
        "state",
        "misplaced",
        "social",
        "phenomenon",
        "question",
        "shared",
        "activity",
        "obvious",
        "individual",
        "constituent",
        "supraindividual",
        "entity",
        "necessarily",
        "committed",
        "example",
        "consider",
        "us",
        "would",
        "view",
        "count",
        "supraindividual",
        "entity",
        "us",
        "increase",
        "research",
        "funding",
        "physic",
        "order",
        "win",
        "space",
        "race",
        "ussr",
        "graduate",
        "student",
        "benefitting",
        "additional",
        "funding",
        "research",
        "rocket",
        "satellite",
        "technology",
        "teach",
        "physic",
        "engineering",
        "undergraduate",
        "indeed",
        "gone",
        "area",
        "funding",
        "opportunity",
        "relevant",
        "sense",
        "constituent",
        "larger",
        "entity",
        "case",
        "us",
        "concern",
        "space",
        "race",
        "job",
        "advancing",
        "career",
        "hoping",
        "raise",
        "family",
        "able",
        "pay",
        "mortgage",
        "etc",
        "frankly",
        "care",
        "le",
        "larger",
        "geopolitical",
        "issue",
        "presumably",
        "concern",
        "supraindividual",
        "entity",
        "us",
        "contrast",
        "participant",
        "shared",
        "activity",
        "arguably",
        "committed",
        "collective",
        "endeavor",
        "aim",
        "least",
        "sense",
        "commitment",
        "end",
        "implicated",
        "instance",
        "intention",
        "intentional",
        "action",
        "ruled",
        "supraindividual",
        "agent",
        "see",
        "discussion",
        "clear",
        "need",
        "committed",
        "order",
        "understand",
        "shared",
        "activity",
        "shared",
        "activity",
        "indeed",
        "involve",
        "commitment",
        "part",
        "individual",
        "participant",
        "seems",
        "intentionlike",
        "element",
        "individual",
        "psychology",
        "must",
        "realize",
        "reflect",
        "weintention",
        "mark",
        "shared",
        "activity",
        "intention",
        "thesis",
        "attribute",
        "individual",
        "participant",
        "shared",
        "activity",
        "intention",
        "pertaining",
        "activity",
        "participatory",
        "intention",
        "account",
        "individual",
        "participatory",
        "commitment",
        "activity",
        "serf",
        "distinguish",
        "one",
        "action",
        "done",
        "others",
        "action",
        "done",
        "one",
        "discussion",
        "current",
        "literature",
        "shared",
        "activity",
        "understood",
        "debate",
        "nature",
        "participatory",
        "intention",
        "instance",
        "different",
        "individual",
        "must",
        "related",
        "one",
        "another",
        "individual",
        "could",
        "said",
        "act",
        "together",
        "share",
        "intention",
        "presumably",
        "intention",
        "expressed",
        "aforementioned",
        "welocution",
        "participatory",
        "intention",
        "might",
        "example",
        "understood",
        "instance",
        "ordinary",
        "intention",
        "familiar",
        "study",
        "individual",
        "agency",
        "weintentions",
        "identified",
        "built",
        "participatory",
        "intention",
        "would",
        "thus",
        "offered",
        "prospect",
        "reductive",
        "account",
        "weintention",
        "term",
        "ordinary",
        "individual",
        "intention",
        "tuomela",
        "miller",
        "defend",
        "view",
        "take",
        "individual",
        "member",
        "group",
        "according",
        "tuomela",
        "miller",
        "individual",
        "participatory",
        "intention",
        "respect",
        "x",
        "intends",
        "part",
        "x",
        "belief",
        "condition",
        "success",
        "x",
        "obtain",
        "belief",
        "mutual",
        "belief",
        "amongst",
        "member",
        "group",
        "condition",
        "success",
        "obtain",
        "work",
        "general",
        "vein",
        "include",
        "bratman",
        "macmahon",
        "s",
        "miller",
        "tuomela",
        "later",
        "work",
        "rather",
        "different",
        "noted",
        "counterexample",
        "reductive",
        "account",
        "searle",
        "imago",
        "member",
        "business",
        "school",
        "graduating",
        "class",
        "versed",
        "adam",
        "smith",
        "theory",
        "invisible",
        "hand",
        "intending",
        "pursue",
        "selfish",
        "interest",
        "thereby",
        "intending",
        "part",
        "helping",
        "humanity",
        "intention",
        "even",
        "supplemented",
        "sort",
        "belief",
        "tuomela",
        "miller",
        "require",
        "intuitively",
        "count",
        "sort",
        "intention",
        "one",
        "acting",
        "others",
        "implausible",
        "think",
        "graduate",
        "go",
        "act",
        "collectively",
        "yet",
        "seems",
        "satisfy",
        "tuomela",
        "miller",
        "analysis",
        "searle",
        "diagnosis",
        "problem",
        "reductive",
        "approach",
        "guarantee",
        "element",
        "cooperation",
        "essential",
        "shared",
        "activity",
        "necessarily",
        "reflected",
        "attitude",
        "participant",
        "one",
        "respond",
        "inserting",
        "cooperative",
        "element",
        "content",
        "intention",
        "agent",
        "intends",
        "part",
        "shared",
        "activity",
        "would",
        "effect",
        "presuppose",
        "notion",
        "seeking",
        "account",
        "searle",
        "contrast",
        "tuomela",
        "miller",
        "insists",
        "individual",
        "participatory",
        "intention",
        "call",
        "collective",
        "intention",
        "primitive",
        "aforementioned",
        "weintention",
        "turn",
        "searle",
        "individual",
        "participatory",
        "intention",
        "though",
        "attitude",
        "state",
        "individual",
        "fundamentally",
        "different",
        "kind",
        "intention",
        "sort",
        "intention",
        "figure",
        "individual",
        "action",
        "mentioned",
        "view",
        "similarity",
        "held",
        "sellars",
        "later",
        "tuomela",
        "searle",
        "version",
        "intention",
        "thesis",
        "also",
        "involves",
        "rejection",
        "antiindividualism",
        "philosophy",
        "mind",
        "see",
        "entry",
        "externalism",
        "mental",
        "content",
        "particular",
        "whether",
        "individual",
        "primitively",
        "collective",
        "participatory",
        "intention",
        "independent",
        "may",
        "going",
        "mind",
        "others",
        "whether",
        "even",
        "others",
        "around",
        "thinking",
        "help",
        "stalled",
        "car",
        "might",
        "collective",
        "intention",
        "expressed",
        "pushing",
        "car",
        "even",
        "stretching",
        "calf",
        "run",
        "trying",
        "move",
        "car",
        "even",
        "hallucinating",
        "one",
        "around"
    ]
}