{
    "main_text": "Interrelatedness of participatory intentions\n2. Interrelatedness of participatory intentions\n\nBe that as it may, whether one is sharing an intention and\nacting with others will depend, of course, on there being\nother agents with whom one is appropriately related. Suppose that each\nof several individuals has a participatory intention. How must they be\nrelated in order for those individuals to count as sharing an\nintention? Recall that for Searle, the participatory intention is\nprimitively collective and expressed, for example, as We will do\nA. Given this, one thing Searle presumably would require for the\nsharing of intentions is the co-extensiveness of the\nwe-element instanced in the intentions across the several\nindividuals. But this is not sufficient. No intention is shared if\nyours is for us to go to the beach this afternoon, whereas mine has us\ndoing something incompatible, like working all day in the library.\nEven if our intentions coincide on the action and the plural subject\nin question, if there is no agreement on how to go about it, or if we\neach fail even to accord any significant status to the other’s\nintentions, there would be no intention or action shared in this\ninstance. So, more needs to be said about the interrelations of the\nparticipatory intentions if they are to account for the coordination\nand cooperativeness we find in shared or joint activity. Searle is\nsilent on the matter; for what more to say, we need to turn\n elsewhere.[13]\n\nIn an influential series of papers, Bratman has developed a reductive\naccount of shared activity and shared\n intention.[14]\n He understands a shared intention to be an interpersonal structure of\nrelated intentions that serves to coordinate action and planning, as\nwell as structure bargaining between\n participants.[15]\n The individually held intentions that constitute this\nstructure—what we’ve been calling participatory\nintentions—are instances of a familiar sort of individual\nintention that figures in the planning and the coordination of\none’s activities over time. When these individual intentions\nconcern something that is done by more than one person, taking the\nform I intend that we J, they accord with Bratman’s\nversion of the Intention Thesis, and the core of his proposals about\nshared intention and action. But Bratman imposes further conditions,\nand these serve to relate these participatory intentions in\ndistinctive ways.\n\nOne important condition concerns the meshing of sub-plans (Bratman\n1992, 331ff). On Bratman’s view, an intention is distinctive in\nhow it leads to planning about necessary means and facilitative steps\nthat lead to its satisfaction. Now, suppose each of us has the\nintention to paint the house together (or, as Bratman would have it,\nthe intention that we paint the house), but my plan is to paint it\ngreen all over, whereas yours is to paint it purple all over. It seems\nthat we don’t share the intention to paint the house. So Bratman\nintroduces the condition that each participant intends that the\nsubplans that follow upon the participatory intentions of each\nindividual mesh—that is, are mutually satisfiable and\ncoherent—in order for the individuals to count as sharing an\n intention.[16]\n\nWe wouldn’t exhibit the right sort of cooperative attitude for\nshared activity and intention if the mesh of our sub-plans were\naccidental and we were not at all disposed to make them\nconsistent if they were to become incompatible. That’s why\nBratman requires the intention to mesh\n subplans.[17]\n There is, moreover, a normative element to the meshing, as emphasized\nby Roth 2003. Participants are subject to some sort of rational\n requirement[18]\n such that they in a sense ought to mesh their plans: the\nplans of the other participants serve as a normative constraint on\none’s own plans. And there is no reason to restrict this status\nto the plans, and not extend it to the intentions that generate them.\nThus, shared activity exhibits what Roth calls practical\nintersubjectivity. In effect, each participant treats the\nother’s intentions and plans much in the way that he or she\ntreats her own: as rational constraints on further intention and\nplanning.\n\nBratman (especially in his 2014 book, but see also his 2009c, 2009b,\n1992) defends a reductive account of this normative\nrequirement, explaining this interpersonal normative constraint in\nterms of the norms of commitment governing individual intention, such\nas those of consistency and means-end coherence. Your intentions and\nplans pertaining to our J-ing have an authority for me because of what\nmight be called a bridge intention to mesh my J-related plans and\nintentions with yours. Bratman expresses the bridge intention in terms\nof the condition requiring each participant to have the intention to\nact in accordance with and because of the others’ intentions and\nplans (as well as his or her own). Bratman’s idea is that, given my\nbridge intention, the norms of consistency and coherence governing my\nindividual intentions will be recruited to require that I form my\nplans and intentions with an eye toward consistency and coherence with\nyour plans and intentions. Roth 2003 sympathizes with these\ninterpersonal normative requirements of consistency and coherence as a\ncondition for shared intention and action, but resists the reductive\nbridge intention account of it.\n\nThe demand that subplans must mesh might inspire the view that\nsuper-ordinate intentions, or the reasons each participant in shared\nactivity A has for taking part, might also be subject to a similar\nrequirement. This is suggested, for example, in Korsgaard’s talk\nof the sharing of reasons:\n\n…if personal interaction is to be possible, we must reason\ntogether, and this means that I must treat your reasons…as\nreasons, that is, as considerations that have normative force for\nme as well as you, and therefore as public reasons.\n(Korsgaard 2009, 192)\n\n\nIn a similar vein, Tuomela requires that the “we-mode” intention\nat the core of his more recent theory necessarily involves group\nreasons shared by all participants. See his 2007; 13, 47, 98.\n\nBut it seems possible that individuals might engage in shared activity\n(and have the corresponding intention) even when they have different\nand incompatible reasons for doing so. For example, representatives\nfrom rival parties might engage in the legislative process that leads\nto the passage of laws, even when each is motivated by considerations\nthat the other finds\n unacceptable.[19]\n Still, it is plausible to think that there must be some constraints\non the sort of individual motive or reason a participant has to engage\nin shared activity. If my motive for engaging in shared activity is\noverly manipulative or undermining of fellow participants (e.g. doing\nsomething with A in order better to control him/her), the status of\nthe activity or intention as shared might be\n compromised.[20]\n\nA further way in which participatory intentions of different\nindividuals are related stems from how they might be formed, modified,\nor set aside. For example, Gilbert holds that shared activity gets\nstarted only when each individual openly expresses a readiness to be\njointly committed in a certain way with\n others.[21]\n She adds that rescinding or significantly modifying the resulting\nintention, as well as releasing any individual from participation,\nwould also require concurrence on everyone’s part. It’s\nnot clear that Gilbert herself would want to talk of this\n“concurrence condition” in terms of relating intention or\nintention-like attitudes in different participants. But, given that\nwhether I concur with how you propose to modify your intentions will\ndepend in part on my intentions, it is natural to take Gilbert’s\nconditions as imposing dynamic constraints on how the participatory\nintentions of different individual are related to one another. Of\ncourse, Gilbert’s conditions might be too strong. For example,\nthe concurrence criterion does not permit one to withdraw unilaterally\nfrom shared\n activity.[22]\n Some may find this implausible. But relaxing Gilbert’s\nconditions would naturally result in another perhaps weaker set of\ndynamic constraints, and not in their complete absence. For example,\nrecall that intentions are defeasible: they can be revised or dropped\nif changing circumstances warrant it. Now, we might imagine that each\nparticipant in shared activity might have the authority unilaterally\nto revise or defeat the intention in light of those changing\ncircumstances, whereupon other participants would have to abide by the\nchange unless, of course, they think that some mistake has been made\n(Roth 2004).\n\nMost of the views canvassed here emphasize as a condition for shared\nactivity fairly robust forms of integration between participants.\nBefore continuing in this vein, it bears mention that the focus on the\nparticipants and how they are related might lead us to neglect other\nimportant conditions for shared activity. Epstein 2015 argues that the\nmetaphysical grounds for some forms of shared activity, such as that\ninvolved in some cases of group action, involve a variety of\nconditions that are not themselves relations between members of the\ngroup, but often can determine how those members are related. These\nmight include historical conditions that determine the structure and\nmembership criteria for the group. Or, the grounds might include\nexternal conditions such as the actions of some designated individual\n(such as a sergeant at arms) not a part of the collective body but who\nfor example must convene a meeting in order that the members of the\nbody may collectively take some action. \n",
    "section_title": "2. Interrelatedness of participatory intentions",
    "entry_title": "Shared Agency",
    "hierarchy_title": "Shared Agency || Interrelatedness of participatory intentions",
    "tokenized_text": [
        "interrelatedness",
        "participatory",
        "intention",
        "interrelatedness",
        "participatory",
        "intention",
        "may",
        "whether",
        "one",
        "sharing",
        "intention",
        "acting",
        "others",
        "depend",
        "course",
        "agent",
        "one",
        "appropriately",
        "related",
        "suppose",
        "several",
        "individual",
        "participatory",
        "intention",
        "must",
        "related",
        "order",
        "individual",
        "count",
        "sharing",
        "intention",
        "recall",
        "searle",
        "participatory",
        "intention",
        "primitively",
        "collective",
        "expressed",
        "example",
        "a",
        "given",
        "one",
        "thing",
        "searle",
        "presumably",
        "would",
        "require",
        "sharing",
        "intention",
        "coextensiveness",
        "weelement",
        "instanced",
        "intention",
        "across",
        "several",
        "individual",
        "sufficient",
        "intention",
        "shared",
        "u",
        "go",
        "beach",
        "afternoon",
        "whereas",
        "mine",
        "u",
        "something",
        "incompatible",
        "like",
        "working",
        "day",
        "library",
        "even",
        "intention",
        "coincide",
        "action",
        "plural",
        "subject",
        "question",
        "agreement",
        "go",
        "fail",
        "even",
        "accord",
        "significant",
        "status",
        "intention",
        "would",
        "intention",
        "action",
        "shared",
        "instance",
        "need",
        "said",
        "interrelation",
        "participatory",
        "intention",
        "account",
        "coordination",
        "cooperativeness",
        "find",
        "shared",
        "joint",
        "activity",
        "searle",
        "silent",
        "matter",
        "say",
        "need",
        "turn",
        "elsewhere",
        "influential",
        "series",
        "paper",
        "bratman",
        "developed",
        "reductive",
        "account",
        "shared",
        "activity",
        "shared",
        "intention",
        "understands",
        "shared",
        "intention",
        "interpersonal",
        "structure",
        "related",
        "intention",
        "serf",
        "coordinate",
        "action",
        "planning",
        "well",
        "structure",
        "bargaining",
        "participant",
        "individually",
        "held",
        "intention",
        "constitute",
        "structurewhat",
        "calling",
        "participatory",
        "intentionsare",
        "instance",
        "familiar",
        "sort",
        "individual",
        "intention",
        "figure",
        "planning",
        "coordination",
        "one",
        "activity",
        "time",
        "individual",
        "intention",
        "concern",
        "something",
        "done",
        "one",
        "person",
        "taking",
        "form",
        "intend",
        "j",
        "accord",
        "bratman",
        "version",
        "intention",
        "thesis",
        "core",
        "proposal",
        "shared",
        "intention",
        "action",
        "bratman",
        "imposes",
        "condition",
        "serve",
        "relate",
        "participatory",
        "intention",
        "distinctive",
        "way",
        "one",
        "important",
        "condition",
        "concern",
        "meshing",
        "subplans",
        "bratman",
        "ff",
        "bratman",
        "view",
        "intention",
        "distinctive",
        "lead",
        "planning",
        "necessary",
        "mean",
        "facilitative",
        "step",
        "lead",
        "satisfaction",
        "suppose",
        "u",
        "intention",
        "paint",
        "house",
        "together",
        "bratman",
        "would",
        "intention",
        "paint",
        "house",
        "plan",
        "paint",
        "green",
        "whereas",
        "paint",
        "purple",
        "seems",
        "share",
        "intention",
        "paint",
        "house",
        "bratman",
        "introduces",
        "condition",
        "participant",
        "intends",
        "subplans",
        "follow",
        "upon",
        "participatory",
        "intention",
        "individual",
        "meshthat",
        "mutually",
        "satisfiable",
        "coherentin",
        "order",
        "individual",
        "count",
        "sharing",
        "intention",
        "exhibit",
        "right",
        "sort",
        "cooperative",
        "attitude",
        "shared",
        "activity",
        "intention",
        "mesh",
        "subplans",
        "accidental",
        "disposed",
        "make",
        "consistent",
        "become",
        "incompatible",
        "bratman",
        "requires",
        "intention",
        "mesh",
        "subplans",
        "moreover",
        "normative",
        "element",
        "meshing",
        "emphasized",
        "roth",
        "participant",
        "subject",
        "sort",
        "rational",
        "requirement",
        "sense",
        "ought",
        "mesh",
        "plan",
        "plan",
        "participant",
        "serve",
        "normative",
        "constraint",
        "one",
        "plan",
        "reason",
        "restrict",
        "status",
        "plan",
        "extend",
        "intention",
        "generate",
        "thus",
        "shared",
        "activity",
        "exhibit",
        "roth",
        "call",
        "practical",
        "intersubjectivity",
        "effect",
        "participant",
        "treat",
        "intention",
        "plan",
        "much",
        "way",
        "treat",
        "rational",
        "constraint",
        "intention",
        "planning",
        "bratman",
        "especially",
        "book",
        "see",
        "also",
        "c",
        "b",
        "defends",
        "reductive",
        "account",
        "normative",
        "requirement",
        "explaining",
        "interpersonal",
        "normative",
        "constraint",
        "term",
        "norm",
        "commitment",
        "governing",
        "individual",
        "intention",
        "consistency",
        "meansend",
        "coherence",
        "intention",
        "plan",
        "pertaining",
        "jing",
        "authority",
        "might",
        "called",
        "bridge",
        "intention",
        "mesh",
        "jrelated",
        "plan",
        "intention",
        "bratman",
        "express",
        "bridge",
        "intention",
        "term",
        "condition",
        "requiring",
        "participant",
        "intention",
        "act",
        "accordance",
        "others",
        "intention",
        "plan",
        "well",
        "bratman",
        "idea",
        "given",
        "bridge",
        "intention",
        "norm",
        "consistency",
        "coherence",
        "governing",
        "individual",
        "intention",
        "recruited",
        "require",
        "form",
        "plan",
        "intention",
        "eye",
        "toward",
        "consistency",
        "coherence",
        "plan",
        "intention",
        "roth",
        "sympathizes",
        "interpersonal",
        "normative",
        "requirement",
        "consistency",
        "coherence",
        "condition",
        "shared",
        "intention",
        "action",
        "resists",
        "reductive",
        "bridge",
        "intention",
        "account",
        "demand",
        "subplans",
        "must",
        "mesh",
        "might",
        "inspire",
        "view",
        "superordinate",
        "intention",
        "reason",
        "participant",
        "shared",
        "activity",
        "taking",
        "part",
        "might",
        "also",
        "subject",
        "similar",
        "requirement",
        "suggested",
        "example",
        "korsgaard",
        "talk",
        "sharing",
        "reason",
        "if",
        "personal",
        "interaction",
        "possible",
        "must",
        "reason",
        "together",
        "mean",
        "must",
        "treat",
        "reasonsas",
        "reason",
        "consideration",
        "normative",
        "force",
        "well",
        "therefore",
        "public",
        "reason",
        "korsgaard",
        "similar",
        "vein",
        "tuomela",
        "requires",
        "wemode",
        "intention",
        "core",
        "recent",
        "theory",
        "necessarily",
        "involves",
        "group",
        "reason",
        "shared",
        "participant",
        "see",
        "seems",
        "possible",
        "individual",
        "might",
        "engage",
        "shared",
        "activity",
        "corresponding",
        "intention",
        "even",
        "different",
        "incompatible",
        "reason",
        "example",
        "representative",
        "rival",
        "party",
        "might",
        "engage",
        "legislative",
        "process",
        "lead",
        "passage",
        "law",
        "even",
        "motivated",
        "consideration",
        "find",
        "unacceptable",
        "still",
        "plausible",
        "think",
        "must",
        "constraint",
        "sort",
        "individual",
        "motive",
        "reason",
        "participant",
        "engage",
        "shared",
        "activity",
        "motive",
        "engaging",
        "shared",
        "activity",
        "overly",
        "manipulative",
        "undermining",
        "fellow",
        "participant",
        "eg",
        "something",
        "order",
        "better",
        "control",
        "himher",
        "status",
        "activity",
        "intention",
        "shared",
        "might",
        "compromised",
        "way",
        "participatory",
        "intention",
        "different",
        "individual",
        "related",
        "stem",
        "might",
        "formed",
        "modified",
        "set",
        "aside",
        "example",
        "gilbert",
        "hold",
        "shared",
        "activity",
        "get",
        "started",
        "individual",
        "openly",
        "express",
        "readiness",
        "jointly",
        "committed",
        "certain",
        "way",
        "others",
        "add",
        "rescinding",
        "significantly",
        "modifying",
        "resulting",
        "intention",
        "well",
        "releasing",
        "individual",
        "participation",
        "would",
        "also",
        "require",
        "concurrence",
        "everyone",
        "part",
        "clear",
        "gilbert",
        "would",
        "want",
        "talk",
        "concurrence",
        "condition",
        "term",
        "relating",
        "intention",
        "intentionlike",
        "attitude",
        "different",
        "participant",
        "given",
        "whether",
        "concur",
        "propose",
        "modify",
        "intention",
        "depend",
        "part",
        "intention",
        "natural",
        "take",
        "gilbert",
        "condition",
        "imposing",
        "dynamic",
        "constraint",
        "participatory",
        "intention",
        "different",
        "individual",
        "related",
        "one",
        "another",
        "course",
        "gilbert",
        "condition",
        "might",
        "strong",
        "example",
        "concurrence",
        "criterion",
        "permit",
        "one",
        "withdraw",
        "unilaterally",
        "shared",
        "activity",
        "may",
        "find",
        "implausible",
        "relaxing",
        "gilbert",
        "condition",
        "would",
        "naturally",
        "result",
        "another",
        "perhaps",
        "weaker",
        "set",
        "dynamic",
        "constraint",
        "complete",
        "absence",
        "example",
        "recall",
        "intention",
        "defeasible",
        "revised",
        "dropped",
        "changing",
        "circumstance",
        "warrant",
        "might",
        "imagine",
        "participant",
        "shared",
        "activity",
        "might",
        "authority",
        "unilaterally",
        "revise",
        "defeat",
        "intention",
        "light",
        "changing",
        "circumstance",
        "whereupon",
        "participant",
        "would",
        "abide",
        "change",
        "unless",
        "course",
        "think",
        "mistake",
        "made",
        "roth",
        "view",
        "canvassed",
        "emphasize",
        "condition",
        "shared",
        "activity",
        "fairly",
        "robust",
        "form",
        "integration",
        "participant",
        "continuing",
        "vein",
        "bear",
        "mention",
        "focus",
        "participant",
        "related",
        "might",
        "lead",
        "u",
        "neglect",
        "important",
        "condition",
        "shared",
        "activity",
        "epstein",
        "argues",
        "metaphysical",
        "ground",
        "form",
        "shared",
        "activity",
        "involved",
        "case",
        "group",
        "action",
        "involve",
        "variety",
        "condition",
        "relation",
        "member",
        "group",
        "often",
        "determine",
        "member",
        "related",
        "might",
        "include",
        "historical",
        "condition",
        "determine",
        "structure",
        "membership",
        "criterion",
        "group",
        "ground",
        "might",
        "include",
        "external",
        "condition",
        "action",
        "designated",
        "individual",
        "sergeant",
        "arm",
        "part",
        "collective",
        "body",
        "example",
        "must",
        "convene",
        "meeting",
        "order",
        "member",
        "body",
        "may",
        "collectively",
        "take",
        "action"
    ]
}