{
    "main_text": "Noetic Effects of Sin\n6. Structural Sin\n\nThe discussions of sin in the previous sections all have social\nimplications insofar as sin qua action, disposition, state,\nand epistemic factor can all harm human community. A sinful action can\nnot only harm others but also spark retaliatory sinful actions by the\none originally sinned against. The noetic effects of sin impact social\nlearning and instruction, with those effects being passed from\nindividuals and groups to others. The doctrine of original sin also\nclearly has social implications: if all human beings suffer from\noriginal sin, then their social interactions will be impacted by it.\nEven Swinburne, who rejects that humans suffer from original sin in a\nway that makes sin inevitable to us, holds that we contribute to the\nproneness of our communities to sin such that we are involved in the\nsins of our communities (Swinburne 1989: 145). These forms of sin\naffect our relationships, not just between individuals and other\nindividuals, but between individuals and groups and between groups and\nother groups. In short, sin corrupts the moral imaginations of not\njust individuals, but of entire communities.\n\nWe can also think of sin, however, not just in terms of individual\nacts and attitudes, but in terms of social structures. In this case,\nthere is a further “sociability” of sin that’s not\ncaptured by the previous discussions. The sixth century Byzantine monk\nand theologian Maximus the Confessor, for instance, held that sin\nleads to a breakdown in community, leading to individualism and social\nfragmentation. He went so far as to compare this state to a kind of\nbestiality (Deane-Drummond 2017: 38). Henri de Lubac interprets\nMaximus as understanding\n\n\noriginal sin as a separation, an individualization it might be called\nin the depreciatory sense of the word. (de Lubac 1988: 33)\n\n\nIf this is correct, then thinking of sin solely in individual terms is\nitself a result of sin.\n\nIt has seemed plausible to many others as well that sin can be\nembedded within social structures such that it is committed by groups\nand not just individuals. Writing within the Reformed tradition, Ruth\nGroenhout suggests we can think of “total depravity” as\nthe conviction that\n\n\nthe corruption of sin is not limited to smallish pockets of existence\nbut instead runs through every aspect of creation that we encounter as\na fracture that affects every part of our human reality. (Groenhout\n2006: 134)\n\n\nSin thus impacts not just individuals or groups, but the very nature\nof our social systems themselves:\n\n\nWhen sins such as pride, greed, and covetousness infect those who\nlegislate for society, as they almost always do, the legislation and\nresulting social structures are themselves corrupt, and will produce\noften predictable pathologies in society: poverty, racial segregation,\ndestruction of lives and relationships in the name of profit.\n(Groenhout 2006: 138)\n\n\nOn this view, human structures and systems as well as human nature are\nmarred or distorted by sin. Parallel to structural accounts of\ninjustices, structural approaches to sin hold that it “creates\nand exists within structures that shape the material reality of our\nplanet and all life on it” (Ray 2016: 417). This approach to sin\nis often found in liberation theologies (see McCall 2019: 259ff).\n\nConsider, for instance, racism. McCluskey 2017, chapter 6 contains a\ndiscussion of racism as involving not only bad actions but also bad\nhabits:\n\n\nA common habit among whites is to check that their car doors are\nlocked whenever they see an African-American walking on the street\nwhile they are driving. Seeing a white person walking does not trigger\nthe same response. Underlying this habit is the unacknowledged\njudgement by the privileged (white) group prevalent in a racist\nsociety that blacks, especially young black men, are criminals and\ntherefore to be feared. Racial profiling by the police leads to\nstopping persons of color on a habitual basis simply because of their\nskin color and is also grounded in the explicit or implicit belief\nthat members of these groups are more likely to commit crimes.\n(McCluskey 2017: 176; citations omitted)\n\n\nThose instances of racism that are caused by willful ignorance or\nresistance to self-scrutiny will also reflect the epistemic dimension\nof sin. But beyond this, it may be that racism is an example of an\nirreducibly structural sin, as Stephen Ray argues. Racism, like race\nitself, on his view, is socially constructed. If racism isn’t\njust habits of individuals (made more likely, surely, by the habits\nand actions prevalent in their community or society) but something\nstructural itself, it may also be helpful to think of some sin as\nstructural along similar lines. This holds for two important reasons,\none of which regards the existence of oppressive structures and the\nsecond about how their existence is masked:\n\n\nFirst, … is the realization that sin becomes apparent in\nstructures through the material consequence of their\noperation.… The second reason is that, because the evidence of\nsin’s presence is usually undeniable, it effectively shields\nitself from scrutiny and intervention by constructing ideological\nformations that take the presence of ill-being and death as simply the\nnatural order of things. (Ray 2016: 424)\n\n\nThis latter is what he means by saying that structural sin is\n“mundane”.\n\nKatie Walker Grimes argues that a response to racism framed primarily\nin terms of “white privilege” rather than white supremacy\nor antiblackness is insufficient because such an approach is overly\nindividualistic and doesn’t take the social nature of sin\nsufficiently seriously (see Grimes 2016: xxi). Grimes develops an\naccount of anti-blackness built on “corporate virtue\ntheory”, which focuses on the relationship between habits and\ncharacter of social bodies rather than individuals. The forces that\nresult in antiblackness are inherently social (e.g., economics,\nsegregated space), and so antiblack racism should be seen as\ninherently social as well. A number of theologians also explore\nvictim-oriented soteriologies that focus primarily on the plight of\nindividuals who are victims of institutional oppression and injustice,\ntrying to articulate what reconciliation looks like in those settings\n(see Hunsinger 2016 and Hieb 2013).\n\nA number of feminist scholars have also argued that sexism can be\nunderstood along the lines of structural sin. Elisabeth\nSchüseller Fiorenza, for instance, characterizes sexism as\n\n\nthe dehumanizing trends, injustices, and discrimination of\ninstitutions, the theology and symbol system that legitimate these\ninstitutions, and the collective and personal “false\nconsciousness” created by sexist institutions and ideologies and\ninternalized in socialization and education. This “false\nconsciousness” permits oppressed people and groups to accept\ntheir oppression and to internalize the values of the oppressor. This\nunderstanding of patriarchal sexism as structural sin and evil power\ninstitutionalized in society and ecclesial oppressive structures is\nakin to [Saint] Paul’s understanding of sin as transpersonal,\ndestructive power whose ultimate expression is the life-destroying\npower of death. (Schüseller Fiorenza 1993: 140)\n\n\nMany of these scholars see traditional approaches to sin as\nindividualistic action or disposition to be problematic and harmful to\nwomen (see, for instance, the work of Saiving 1992, Plaskow 1980, and\nDunfee 1982 for historically influential examples). Rachel Sophia\nBaard’s work is one example of this line of criticism. Baard\nargues that sin-talk contributes to communal praxis, shaping where and\nhow our practices reproduce themselves. As she puts it, our language\nand understanding of sin creates a script that people perform; for\ninstance, if sin is simply understood as individual actions, then it\nwould encourage us not to see the social structures involved in\npatriarchy as sinful, thereby making it more likely that those\nstructures continue rather than addressing them as problematic.\nTraditional understandings of sin rooted in pride, she continues,\nwhich lie at the heart of many Christian institutions, and cultural\nbeliefs and practices,\n\n\ncreate a social climate in which gender violence is not only\nimaginable but tolerated or accepted as “normal”, indeed,\nas simply part of the human condition. (Baard 2019: 49; see also Jones\n2000)\n\n\nIf all sin is ultimately rooted in pride and self-exertion, the proper\nresponse to sin is found in humility and self-sacrifice. But in\nsituations of oppression and gender-based violence, such a response\nencourages further harm and a denial of proper agency:\n\n\nby and large, female pathology is typically not rooted in the\nelevation of the self but in the negation of the self—hence,\ncalling for the shattering of the self or the humility that\n“regards others as better than ourselves” will end up\naggravating, rather than addressing, women’s sin. (Baard 2019:\n61)\n\n\nThis can be seen historically in how women have been blamed for sin,\nand that blame then used to deny opportunities for or justify violence\nagainst women. Baard argues that a shift to a rhetoric of the systemic\nnature of oppression rather than pride is often called for, shifting\nfocus away from the purported moral failing of the individual to the\nandrocentric rhetoric and practices that perpetuates structures that\noppress.\n\nIn addition to racism and sexism, other social forms of oppression can\nalso be understood as examples of structural sins. Leigh Vicens\nsuggests that we can understand implicit bias as a kind of socially\nbased structural sin (Vicens 2018; for a recent discussion of the\nstate of research on implicit bias, see Brownstein, Madva, and\nGawronski 2020). Marjorie Suchocki argues that sin is\n\n\nparticipation through intent or action in unnecessary violence that\ncontributes to the ill-being of any aspect of earth or its\ninhabitants. (Suchocki 1994: 12)\n\n\nwhere that participation is part of our inheritance thorough social\nsolidarity with other sinful humans. Sin is “individual only\ninsofar as we participate in the whole society” (Suchocki 1994:\n157). She uses this account to illuminate oppression, economic\nsystems, and homophobia. Patriarchy can perhaps be understood in a\nsimilar way (see Baard 2019 and Ruether 1993). And Ruth Groenhout\nexplores the relationship between systemic sin and contemporary\nhealthcare systems (Grouenhout 2006).\n",
    "section_title": "6. Structural Sin",
    "entry_title": "Sin in Christian Thought",
    "hierarchy_title": "Sin in Christian Thought || Noetic Effects of Sin",
    "tokenized_text": [
        "noetic",
        "effect",
        "sin",
        "structural",
        "sin",
        "discussion",
        "sin",
        "previous",
        "section",
        "social",
        "implication",
        "insofar",
        "sin",
        "qua",
        "action",
        "disposition",
        "state",
        "epistemic",
        "factor",
        "harm",
        "human",
        "community",
        "sinful",
        "action",
        "harm",
        "others",
        "also",
        "spark",
        "retaliatory",
        "sinful",
        "action",
        "one",
        "originally",
        "sinned",
        "noetic",
        "effect",
        "sin",
        "impact",
        "social",
        "learning",
        "instruction",
        "effect",
        "passed",
        "individual",
        "group",
        "others",
        "doctrine",
        "original",
        "sin",
        "also",
        "clearly",
        "social",
        "implication",
        "human",
        "being",
        "suffer",
        "original",
        "sin",
        "social",
        "interaction",
        "impacted",
        "even",
        "swinburne",
        "reject",
        "human",
        "suffer",
        "original",
        "sin",
        "way",
        "make",
        "sin",
        "inevitable",
        "u",
        "hold",
        "contribute",
        "proneness",
        "community",
        "sin",
        "involved",
        "sin",
        "community",
        "swinburne",
        "form",
        "sin",
        "affect",
        "relationship",
        "individual",
        "individual",
        "individual",
        "group",
        "group",
        "group",
        "short",
        "sin",
        "corrupts",
        "moral",
        "imagination",
        "individual",
        "entire",
        "community",
        "also",
        "think",
        "sin",
        "however",
        "term",
        "individual",
        "act",
        "attitude",
        "term",
        "social",
        "structure",
        "case",
        "sociability",
        "sin",
        "captured",
        "previous",
        "discussion",
        "sixth",
        "century",
        "byzantine",
        "monk",
        "theologian",
        "maximus",
        "confessor",
        "instance",
        "held",
        "sin",
        "lead",
        "breakdown",
        "community",
        "leading",
        "individualism",
        "social",
        "fragmentation",
        "went",
        "far",
        "compare",
        "state",
        "kind",
        "bestiality",
        "deanedrummond",
        "henri",
        "de",
        "lubac",
        "interprets",
        "maximus",
        "understanding",
        "original",
        "sin",
        "separation",
        "individualization",
        "might",
        "called",
        "depreciatory",
        "sense",
        "word",
        "de",
        "lubac",
        "correct",
        "thinking",
        "sin",
        "solely",
        "individual",
        "term",
        "result",
        "sin",
        "seemed",
        "plausible",
        "many",
        "others",
        "well",
        "sin",
        "embedded",
        "within",
        "social",
        "structure",
        "committed",
        "group",
        "individual",
        "writing",
        "within",
        "reformed",
        "tradition",
        "ruth",
        "groenhout",
        "suggests",
        "think",
        "total",
        "depravity",
        "conviction",
        "corruption",
        "sin",
        "limited",
        "smallish",
        "pocket",
        "existence",
        "instead",
        "run",
        "every",
        "aspect",
        "creation",
        "encounter",
        "fracture",
        "affect",
        "every",
        "part",
        "human",
        "reality",
        "groenhout",
        "sin",
        "thus",
        "impact",
        "individual",
        "group",
        "nature",
        "social",
        "system",
        "sin",
        "pride",
        "greed",
        "covetousness",
        "infect",
        "legislate",
        "society",
        "almost",
        "always",
        "legislation",
        "resulting",
        "social",
        "structure",
        "corrupt",
        "produce",
        "often",
        "predictable",
        "pathology",
        "society",
        "poverty",
        "racial",
        "segregation",
        "destruction",
        "life",
        "relationship",
        "name",
        "profit",
        "groenhout",
        "view",
        "human",
        "structure",
        "system",
        "well",
        "human",
        "nature",
        "marred",
        "distorted",
        "sin",
        "parallel",
        "structural",
        "account",
        "injustice",
        "structural",
        "approach",
        "sin",
        "hold",
        "creates",
        "exists",
        "within",
        "structure",
        "shape",
        "material",
        "reality",
        "planet",
        "life",
        "ray",
        "approach",
        "sin",
        "often",
        "found",
        "liberation",
        "theology",
        "see",
        "mccall",
        "ff",
        "consider",
        "instance",
        "racism",
        "mccluskey",
        "chapter",
        "contains",
        "discussion",
        "racism",
        "involving",
        "bad",
        "action",
        "also",
        "bad",
        "habit",
        "common",
        "habit",
        "among",
        "white",
        "check",
        "car",
        "door",
        "locked",
        "whenever",
        "see",
        "africanamerican",
        "walking",
        "street",
        "driving",
        "seeing",
        "white",
        "person",
        "walking",
        "trigger",
        "response",
        "underlying",
        "habit",
        "unacknowledged",
        "judgement",
        "privileged",
        "white",
        "group",
        "prevalent",
        "racist",
        "society",
        "black",
        "especially",
        "young",
        "black",
        "men",
        "criminal",
        "therefore",
        "feared",
        "racial",
        "profiling",
        "police",
        "lead",
        "stopping",
        "person",
        "color",
        "habitual",
        "basis",
        "simply",
        "skin",
        "color",
        "also",
        "grounded",
        "explicit",
        "implicit",
        "belief",
        "member",
        "group",
        "likely",
        "commit",
        "crime",
        "mccluskey",
        "citation",
        "omitted",
        "instance",
        "racism",
        "caused",
        "willful",
        "ignorance",
        "resistance",
        "selfscrutiny",
        "also",
        "reflect",
        "epistemic",
        "dimension",
        "sin",
        "beyond",
        "may",
        "racism",
        "example",
        "irreducibly",
        "structural",
        "sin",
        "stephen",
        "ray",
        "argues",
        "racism",
        "like",
        "race",
        "view",
        "socially",
        "constructed",
        "racism",
        "habit",
        "individual",
        "made",
        "likely",
        "surely",
        "habit",
        "action",
        "prevalent",
        "community",
        "society",
        "something",
        "structural",
        "may",
        "also",
        "helpful",
        "think",
        "sin",
        "structural",
        "along",
        "similar",
        "line",
        "hold",
        "two",
        "important",
        "reason",
        "one",
        "regard",
        "existence",
        "oppressive",
        "structure",
        "second",
        "existence",
        "masked",
        "first",
        "realization",
        "sin",
        "becomes",
        "apparent",
        "structure",
        "material",
        "consequence",
        "operation",
        "second",
        "reason",
        "evidence",
        "sin",
        "presence",
        "usually",
        "undeniable",
        "effectively",
        "shield",
        "scrutiny",
        "intervention",
        "constructing",
        "ideological",
        "formation",
        "take",
        "presence",
        "illbeing",
        "death",
        "simply",
        "natural",
        "order",
        "thing",
        "ray",
        "latter",
        "mean",
        "saying",
        "structural",
        "sin",
        "mundane",
        "katie",
        "walker",
        "grime",
        "argues",
        "response",
        "racism",
        "framed",
        "primarily",
        "term",
        "white",
        "privilege",
        "rather",
        "white",
        "supremacy",
        "antiblackness",
        "insufficient",
        "approach",
        "overly",
        "individualistic",
        "take",
        "social",
        "nature",
        "sin",
        "sufficiently",
        "seriously",
        "see",
        "grime",
        "xxi",
        "grime",
        "develops",
        "account",
        "antiblackness",
        "built",
        "corporate",
        "virtue",
        "theory",
        "focus",
        "relationship",
        "habit",
        "character",
        "social",
        "body",
        "rather",
        "individual",
        "force",
        "result",
        "antiblackness",
        "inherently",
        "social",
        "eg",
        "economics",
        "segregated",
        "space",
        "antiblack",
        "racism",
        "seen",
        "inherently",
        "social",
        "well",
        "number",
        "theologian",
        "also",
        "explore",
        "victimoriented",
        "soteriology",
        "focus",
        "primarily",
        "plight",
        "individual",
        "victim",
        "institutional",
        "oppression",
        "injustice",
        "trying",
        "articulate",
        "reconciliation",
        "look",
        "like",
        "setting",
        "see",
        "hunsinger",
        "hieb",
        "number",
        "feminist",
        "scholar",
        "also",
        "argued",
        "sexism",
        "understood",
        "along",
        "line",
        "structural",
        "sin",
        "elisabeth",
        "schüseller",
        "fiorenza",
        "instance",
        "characterizes",
        "sexism",
        "dehumanizing",
        "trend",
        "injustice",
        "discrimination",
        "institution",
        "theology",
        "symbol",
        "system",
        "legitimate",
        "institution",
        "collective",
        "personal",
        "false",
        "consciousness",
        "created",
        "sexist",
        "institution",
        "ideology",
        "internalized",
        "socialization",
        "education",
        "false",
        "consciousness",
        "permit",
        "oppressed",
        "people",
        "group",
        "accept",
        "oppression",
        "internalize",
        "value",
        "oppressor",
        "understanding",
        "patriarchal",
        "sexism",
        "structural",
        "sin",
        "evil",
        "power",
        "institutionalized",
        "society",
        "ecclesial",
        "oppressive",
        "structure",
        "akin",
        "saint",
        "paul",
        "understanding",
        "sin",
        "transpersonal",
        "destructive",
        "power",
        "whose",
        "ultimate",
        "expression",
        "lifedestroying",
        "power",
        "death",
        "schüseller",
        "fiorenza",
        "many",
        "scholar",
        "see",
        "traditional",
        "approach",
        "sin",
        "individualistic",
        "action",
        "disposition",
        "problematic",
        "harmful",
        "woman",
        "see",
        "instance",
        "work",
        "saiving",
        "plaskow",
        "dunfee",
        "historically",
        "influential",
        "example",
        "rachel",
        "sophia",
        "baard",
        "work",
        "one",
        "example",
        "line",
        "criticism",
        "baard",
        "argues",
        "sintalk",
        "contributes",
        "communal",
        "praxis",
        "shaping",
        "practice",
        "reproduce",
        "put",
        "language",
        "understanding",
        "sin",
        "creates",
        "script",
        "people",
        "perform",
        "instance",
        "sin",
        "simply",
        "understood",
        "individual",
        "action",
        "would",
        "encourage",
        "u",
        "see",
        "social",
        "structure",
        "involved",
        "patriarchy",
        "sinful",
        "thereby",
        "making",
        "likely",
        "structure",
        "continue",
        "rather",
        "addressing",
        "problematic",
        "traditional",
        "understanding",
        "sin",
        "rooted",
        "pride",
        "continues",
        "lie",
        "heart",
        "many",
        "christian",
        "institution",
        "cultural",
        "belief",
        "practice",
        "create",
        "social",
        "climate",
        "gender",
        "violence",
        "imaginable",
        "tolerated",
        "accepted",
        "normal",
        "indeed",
        "simply",
        "part",
        "human",
        "condition",
        "baard",
        "see",
        "also",
        "jones",
        "sin",
        "ultimately",
        "rooted",
        "pride",
        "selfexertion",
        "proper",
        "response",
        "sin",
        "found",
        "humility",
        "selfsacrifice",
        "situation",
        "oppression",
        "genderbased",
        "violence",
        "response",
        "encourages",
        "harm",
        "denial",
        "proper",
        "agency",
        "large",
        "female",
        "pathology",
        "typically",
        "rooted",
        "elevation",
        "self",
        "negation",
        "selfhence",
        "calling",
        "shattering",
        "self",
        "humility",
        "regard",
        "others",
        "better",
        "end",
        "aggravating",
        "rather",
        "addressing",
        "woman",
        "sin",
        "baard",
        "seen",
        "historically",
        "woman",
        "blamed",
        "sin",
        "blame",
        "used",
        "deny",
        "opportunity",
        "justify",
        "violence",
        "woman",
        "baard",
        "argues",
        "shift",
        "rhetoric",
        "systemic",
        "nature",
        "oppression",
        "rather",
        "pride",
        "often",
        "called",
        "shifting",
        "focus",
        "away",
        "purported",
        "moral",
        "failing",
        "individual",
        "androcentric",
        "rhetoric",
        "practice",
        "perpetuates",
        "structure",
        "oppress",
        "addition",
        "racism",
        "sexism",
        "social",
        "form",
        "oppression",
        "also",
        "understood",
        "example",
        "structural",
        "sin",
        "leigh",
        "vicens",
        "suggests",
        "understand",
        "implicit",
        "bias",
        "kind",
        "socially",
        "based",
        "structural",
        "sin",
        "vicens",
        "recent",
        "discussion",
        "state",
        "research",
        "implicit",
        "bias",
        "see",
        "brownstein",
        "madva",
        "gawronski",
        "marjorie",
        "suchocki",
        "argues",
        "sin",
        "participation",
        "intent",
        "action",
        "unnecessary",
        "violence",
        "contributes",
        "illbeing",
        "aspect",
        "earth",
        "inhabitant",
        "suchocki",
        "participation",
        "part",
        "inheritance",
        "thorough",
        "social",
        "solidarity",
        "sinful",
        "human",
        "sin",
        "individual",
        "insofar",
        "participate",
        "whole",
        "society",
        "suchocki",
        "us",
        "account",
        "illuminate",
        "oppression",
        "economic",
        "system",
        "homophobia",
        "patriarchy",
        "perhaps",
        "understood",
        "similar",
        "way",
        "see",
        "baard",
        "ruether",
        "ruth",
        "groenhout",
        "explores",
        "relationship",
        "systemic",
        "sin",
        "contemporary",
        "healthcare",
        "system",
        "grouenhout"
    ]
}