{
    "main_text": "Signification and Concepts\n1. Signification and Concepts\n\n\nIn order to understand medieval theories of singular terms, we need to\nconsider medieval semantics, and why the question of singular terms\nwas so closely linked to the issue of singular concepts. \n\n\nThe central semantic notion for medieval authors was that of\nsignification, which must not be identified with the notion of meaning\nfor two reasons. First, the meaning of a term is not an entity to\nwhich the term is related in some way, but one can say that an\nutterance signifies or makes known an entity, whether conceptual or\nreal, universal or particular. Moreover, meaning is not transitive,\nbut signification is. A spoken word was said to be a conventional sign\nof a concept, which in turn, at least for later authors, was a natural\nsign of a thing, and so spoken words were said to be at least indirect\nsigns of things. This is not to deny that medieval thinkers had a\ngeneral notion of meaning. They did talk about sense (sensus),\nabout the thought or content (sententia) of a phrase, and about\nthe force of a word (vis verbi), and they often used the word\n‘significatio’ itself along with its cognates quite\nwidely.  When they were discussing indexicals, especially personal\npronouns and demonstratives, they drew a distinction between a term’s\ngeneral signification or what Kaplan has called\n‘character’ and its particular signification, that is, its\n‘content’ or contribution to what is actually said on a\nparticular occasion of use.\n\n\nIf we take signification in a narrow sense, as a technical notion, we\nfind that there were two not entirely compatible approaches, each\nbased on a sentence from Aristotle, and each emphasizing the role of\nconcepts, whether the hearer’s or the speaker’s. According to the\nfirst approach, based on De interpretatione 16b19–21, to\nsignify is to generate or establish an understanding. This definition\nplaces emphasis not on the speaker, but on the hearer. So long as the\nhearer can acquire some understanding through hearing, the utterance\nis significant even if the speaker is incapable of rational, abstract,\nthought, and even if the speaker has no intention of conveying a\nmessage. The second and most influential approach tied the\nsignificative power of an utterance to its making known a concept. The\ncrucial text here is De interpretatione 16a3–4, read as saying,\n“Spoken words are signs of concepts.” This supports the\nview that it is the speaker’s intellectual capacity and intentions\nthat are crucial to significant utterance.\n\n\nAristotle, as interpreted by medieval commentators, had gone on to say\nthat concepts were similitudes or signs of things, and this raised the\nquestion of what is meant by ‘thing’. In other words, what\nis it that we understand when an utterance such as ‘man’\nor ‘animal’ establishes an understanding? The usual\nassumption from Boethius at least until the end of the thirteenth\ncentury was that the understanding is of some kind of universal, an\nessence or common nature, and when logicians asked whether spoken\nwords primarily signified concepts or things, the issue was whether\nconcepts or common natures should be taken as the primary significates\nof an utterance. If the concept was said to be the primary\nsignificate, then the common nature was the secondary significate. If\nthe common nature was said to be the primary significate, then\nindividuals having that nature were often said to be the secondary\nsignificates.  The issue was complicated by various views about the\nnature of concepts as opposed to intelligible species, and about the\nstatus of common natures, and their precise relation to individuals,\nbut fortunately these details do not concern us here. So long as\ncommon natures in some sense played a role in the signification of\ncommon nouns, there was a strong temptation to speak as if there are\nindividual natures which play a similar role in the signification of\nsingular terms. From Boethius on, there are many references to\nindividual forms, and such terms as Socrateity (Socrateitas)\nand Platonicity (Platonitas) were frequently used, even by\nThomas Aquinas. On the other hand, the Aristotelian insistence, taken\nup by Aquinas in particular, that the intellect cannot grasp\nindividuals as such made the explanation of how we can understand\nSocrates more complicated. There did not seem to be a concept of\nSocrateity that corresponded to the form spoken of. Moreover, the very\nnotion of an individual nature seemed incompatible with\nAristotelianism. As a result, some thinkers in the second half of the\nthirteenth century held that what the grammarian counts as a proper\nname is not properly a name, since it does not signify a common\nnature.\n The issue of individual natures also affected the way in which the\nnewly developed theory of supposition was presented, since it\nemphasised the fact that terms could exhibit a variety of semantic\nfeatures. Thus one and the same term could have material supposition\nwhen it referred to the actual word, as in “‘man’\nhas three letters,” or simple supposition when it referred to\nthe form signified, as in “Man is a species of animal,” or\npersonal supposition when it referred to individuals, as in\n“Some man is running.” Certainly singular terms could have\nmaterial supposition, but, at least for non-nominalists, the\ndistinction between simple or formal supposition and personal\nsupposition was more problematic. Either singular terms lacked a\nsemantic property that common nouns had, or singular terms could stand\nfor an individual nature. William of Sherwood explicitly allowed the\nsingular term ‘Socrates’ to have formal supposition in the\nsentence “Socrates is said of just one individual”, on the\ngrounds that ‘Socrates’ does signify a form, but he went\non to deny that the term had the further property of appellation,\nwhich belonged to predicates, because, unlike common nouns, it could\nnot properly function as a predicate. However, other\nthirteenth-century logicians tended to by-pass the problem of whether\nwhat they took to be fundamental semantic features all applied equally\nto both singular terms and common nouns.\n\n\nThis general problem of semantic variation remains in the background,\nsince many features other than simple supposition were attributed to\nterms, but the nature of the debate about concepts and things was to\nchange completely in the fourteenth century, first with the insistence\nof John Duns Scotus, like others before him, that individuals can be\ngrasped by the intellect, but more especially with the rise of\nnominalism, according to which all that exists are individual things,\nand that only concepts can be common or universal. The question\nwhether words primarily signify concepts or things was now construed\nas the question: does a word signify an individual thing in the world\ndirectly, or does it signify first the concept which is a necessary\ncondition for signification? John Buridan and his near contemporary\nWilliam Ockham differed on this issue. Buridan held that words first\nsignify concepts, because only then can we explain why terms such as\n‘being’ and ‘one’ which have the same\nextension nonetheless differ in signification. Ockham preferred to say\nthat words signify only individual things and are subordinated to\nconcepts without signifying them. Both thinkers are noteworthy for\ntheir insistence that the concept itself was a sign which plays a\ncrucial intermediary role in language production and understanding and\nthat concepts are the terms of a fully-fledged mental language.\nMoreover, the concept as sign was defined as a formal representation\nof its object. However one construes the notion of representation here\n(and any crude pictorial theory can be ruled out), it is clear that\nconceptual representation was taken to involve some level of\ngenerality, and so there is an obvious problem where singular concepts\nare concerned. Yet, given John Buridan’s claim that a spoken term\ncannot be called universal or singular unless it corresponds to a\nuniversal or singular concept, we must have singular concepts if we\nhave any genuine singular terms. As we shall see in §9, Buridan\nintroduces an extra condition for the singular concept, while allowing\nit to have a certain kind of generality.\n\n\nConcepts were said to signify naturally, and to have the same\nsignification for all thinkers, or at least all thinkers with the same\nexperience, but spoken terms, and the written terms which were\nsubordinated to them, were thought to acquire their signification by\nsome original act of imposition. While most authors were careful not\nto commit themselves to any account of how this original imposition\nactually occurs, and while it was recognized that words such as\n‘person’ and ‘spirit’ (both important in\ntheological contexts) do acquire new connotations, it was generally\nsupposed that the signification of common nouns within a given\nconventional language remains stable. Proper names were both easier\nand more difficult to account for. They were\nmore difficult because it is not entirely plausible to account for the\nstability of their signification by appeal to standard\ndefinitions. They were easier because there are\neasily ascertainable instances of original imposition, particularly\nthrough Christian baptism, though Paul of Venice explicitly recognized\nthat non-Christians have equivalent name-giving ceremonies. \n\n\nMedieval logicians insisted that original imposition had to be carried\nout by someone (or some group) with special authority, and this\nproduced some puzzles about our use of proper names. If the word\n‘lion’ signifies a particular species of animal, then we\ncan say that lions are always lions, but is Mary always Mary? Buridan\ndevoted one of the sophisms in his Summulae de Dialectica to\nthe question of whether one can truly say “Ba will be\nbaptized” (where ‘ba’ was deliberately chosen as a\nnonsense syllable), given that ‘ba’ does not signify a boy\nbefore his baptism takes place. He concluded that the sentence in\nquestion had no truth-value, though both “‘This boy is\nba’ will be true tomorrow” and “This boy will be\ncalled ‘ba’” could be true. Paul of Venice asked\nwhat would happen if, after being baptized ‘Socrates’, a\nperson was consistently called ‘Plato’ by a whole\ncommunity, and even forgot his original name. Paul thought that the\nperson would still be Socrates, since only the original baptism\ninvolved the appropriate authority. On the other hand, legitimate\nchanges were possible, as when a newly elected pope takes on a new\nname. As a result of these various remarks, it seems that Mary is not\nMary before she is named, and she can cease to be Mary if she is given\na new name by someone with authority.\n",
    "section_title": "1. Signification and Concepts",
    "entry_title": "Medieval Theories of Singular Terms",
    "hierarchy_title": "Medieval Theories of Singular Terms || Signification and Concepts",
    "tokenized_text": [
        "signification",
        "concept",
        "signification",
        "concept",
        "order",
        "understand",
        "medieval",
        "theory",
        "singular",
        "term",
        "need",
        "consider",
        "medieval",
        "semantics",
        "question",
        "singular",
        "term",
        "closely",
        "linked",
        "issue",
        "singular",
        "concept",
        "central",
        "semantic",
        "notion",
        "medieval",
        "author",
        "signification",
        "must",
        "identified",
        "notion",
        "meaning",
        "two",
        "reason",
        "first",
        "meaning",
        "term",
        "entity",
        "term",
        "related",
        "way",
        "one",
        "say",
        "utterance",
        "signifies",
        "make",
        "known",
        "entity",
        "whether",
        "conceptual",
        "real",
        "universal",
        "particular",
        "moreover",
        "meaning",
        "transitive",
        "signification",
        "spoken",
        "word",
        "said",
        "conventional",
        "sign",
        "concept",
        "turn",
        "least",
        "later",
        "author",
        "natural",
        "sign",
        "thing",
        "spoken",
        "word",
        "said",
        "least",
        "indirect",
        "sign",
        "thing",
        "deny",
        "medieval",
        "thinker",
        "general",
        "notion",
        "meaning",
        "talk",
        "sense",
        "sensus",
        "thought",
        "content",
        "sententia",
        "phrase",
        "force",
        "word",
        "vi",
        "verbi",
        "often",
        "used",
        "word",
        "significatio",
        "along",
        "cognate",
        "quite",
        "widely",
        "discussing",
        "indexicals",
        "especially",
        "personal",
        "pronoun",
        "demonstrative",
        "drew",
        "distinction",
        "term",
        "general",
        "signification",
        "kaplan",
        "called",
        "character",
        "particular",
        "signification",
        "content",
        "contribution",
        "actually",
        "said",
        "particular",
        "occasion",
        "use",
        "take",
        "signification",
        "narrow",
        "sense",
        "technical",
        "notion",
        "find",
        "two",
        "entirely",
        "compatible",
        "approach",
        "based",
        "sentence",
        "aristotle",
        "emphasizing",
        "role",
        "concept",
        "whether",
        "hearer",
        "speaker",
        "according",
        "first",
        "approach",
        "based",
        "de",
        "interpretatione",
        "b",
        "signify",
        "generate",
        "establish",
        "understanding",
        "definition",
        "place",
        "emphasis",
        "speaker",
        "hearer",
        "long",
        "hearer",
        "acquire",
        "understanding",
        "hearing",
        "utterance",
        "significant",
        "even",
        "speaker",
        "incapable",
        "rational",
        "abstract",
        "thought",
        "even",
        "speaker",
        "intention",
        "conveying",
        "message",
        "second",
        "influential",
        "approach",
        "tied",
        "significative",
        "power",
        "utterance",
        "making",
        "known",
        "concept",
        "crucial",
        "text",
        "de",
        "interpretatione",
        "a",
        "read",
        "saying",
        "spoken",
        "word",
        "sign",
        "concepts",
        "support",
        "view",
        "speaker",
        "intellectual",
        "capacity",
        "intention",
        "crucial",
        "significant",
        "utterance",
        "aristotle",
        "interpreted",
        "medieval",
        "commentator",
        "gone",
        "say",
        "concept",
        "similitude",
        "sign",
        "thing",
        "raised",
        "question",
        "meant",
        "thing",
        "word",
        "understand",
        "utterance",
        "man",
        "animal",
        "establishes",
        "understanding",
        "usual",
        "assumption",
        "boethius",
        "least",
        "end",
        "thirteenth",
        "century",
        "understanding",
        "kind",
        "universal",
        "essence",
        "common",
        "nature",
        "logician",
        "asked",
        "whether",
        "spoken",
        "word",
        "primarily",
        "signified",
        "concept",
        "thing",
        "issue",
        "whether",
        "concept",
        "common",
        "nature",
        "taken",
        "primary",
        "significates",
        "utterance",
        "concept",
        "said",
        "primary",
        "significate",
        "common",
        "nature",
        "secondary",
        "significate",
        "common",
        "nature",
        "said",
        "primary",
        "significate",
        "individual",
        "nature",
        "often",
        "said",
        "secondary",
        "significates",
        "issue",
        "complicated",
        "various",
        "view",
        "nature",
        "concept",
        "opposed",
        "intelligible",
        "specie",
        "status",
        "common",
        "nature",
        "precise",
        "relation",
        "individual",
        "fortunately",
        "detail",
        "concern",
        "u",
        "long",
        "common",
        "nature",
        "sense",
        "played",
        "role",
        "signification",
        "common",
        "noun",
        "strong",
        "temptation",
        "speak",
        "individual",
        "nature",
        "play",
        "similar",
        "role",
        "signification",
        "singular",
        "term",
        "boethius",
        "many",
        "reference",
        "individual",
        "form",
        "term",
        "socrateity",
        "socrateitas",
        "platonicity",
        "platonitas",
        "frequently",
        "used",
        "even",
        "thomas",
        "aquinas",
        "hand",
        "aristotelian",
        "insistence",
        "taken",
        "aquinas",
        "particular",
        "intellect",
        "grasp",
        "individual",
        "made",
        "explanation",
        "understand",
        "socrates",
        "complicated",
        "seem",
        "concept",
        "socrateity",
        "corresponded",
        "form",
        "spoken",
        "moreover",
        "notion",
        "individual",
        "nature",
        "seemed",
        "incompatible",
        "aristotelianism",
        "result",
        "thinker",
        "second",
        "half",
        "thirteenth",
        "century",
        "held",
        "grammarian",
        "count",
        "proper",
        "name",
        "properly",
        "name",
        "since",
        "signify",
        "common",
        "nature",
        "issue",
        "individual",
        "nature",
        "also",
        "affected",
        "way",
        "newly",
        "developed",
        "theory",
        "supposition",
        "presented",
        "since",
        "emphasised",
        "fact",
        "term",
        "could",
        "exhibit",
        "variety",
        "semantic",
        "feature",
        "thus",
        "one",
        "term",
        "could",
        "material",
        "supposition",
        "referred",
        "actual",
        "word",
        "man",
        "three",
        "letter",
        "simple",
        "supposition",
        "referred",
        "form",
        "signified",
        "man",
        "specie",
        "animal",
        "personal",
        "supposition",
        "referred",
        "individual",
        "man",
        "running",
        "certainly",
        "singular",
        "term",
        "could",
        "material",
        "supposition",
        "least",
        "nonnominalists",
        "distinction",
        "simple",
        "formal",
        "supposition",
        "personal",
        "supposition",
        "problematic",
        "either",
        "singular",
        "term",
        "lacked",
        "semantic",
        "property",
        "common",
        "noun",
        "singular",
        "term",
        "could",
        "stand",
        "individual",
        "nature",
        "william",
        "sherwood",
        "explicitly",
        "allowed",
        "singular",
        "term",
        "socrates",
        "formal",
        "supposition",
        "sentence",
        "socrates",
        "said",
        "one",
        "individual",
        "ground",
        "socrates",
        "signify",
        "form",
        "went",
        "deny",
        "term",
        "property",
        "appellation",
        "belonged",
        "predicate",
        "unlike",
        "common",
        "noun",
        "could",
        "properly",
        "function",
        "predicate",
        "however",
        "thirteenthcentury",
        "logician",
        "tended",
        "bypass",
        "problem",
        "whether",
        "took",
        "fundamental",
        "semantic",
        "feature",
        "applied",
        "equally",
        "singular",
        "term",
        "common",
        "noun",
        "general",
        "problem",
        "semantic",
        "variation",
        "remains",
        "background",
        "since",
        "many",
        "feature",
        "simple",
        "supposition",
        "attributed",
        "term",
        "nature",
        "debate",
        "concept",
        "thing",
        "change",
        "completely",
        "fourteenth",
        "century",
        "first",
        "insistence",
        "john",
        "dun",
        "scotus",
        "like",
        "others",
        "individual",
        "grasped",
        "intellect",
        "especially",
        "rise",
        "nominalism",
        "according",
        "exists",
        "individual",
        "thing",
        "concept",
        "common",
        "universal",
        "question",
        "whether",
        "word",
        "primarily",
        "signify",
        "concept",
        "thing",
        "construed",
        "question",
        "word",
        "signify",
        "individual",
        "thing",
        "world",
        "directly",
        "signify",
        "first",
        "concept",
        "necessary",
        "condition",
        "signification",
        "john",
        "buridan",
        "near",
        "contemporary",
        "william",
        "ockham",
        "differed",
        "issue",
        "buridan",
        "held",
        "word",
        "first",
        "signify",
        "concept",
        "explain",
        "term",
        "one",
        "extension",
        "nonetheless",
        "differ",
        "signification",
        "ockham",
        "preferred",
        "say",
        "word",
        "signify",
        "individual",
        "thing",
        "subordinated",
        "concept",
        "without",
        "signifying",
        "thinker",
        "noteworthy",
        "insistence",
        "concept",
        "sign",
        "play",
        "crucial",
        "intermediary",
        "role",
        "language",
        "production",
        "understanding",
        "concept",
        "term",
        "fullyfledged",
        "mental",
        "language",
        "moreover",
        "concept",
        "sign",
        "defined",
        "formal",
        "representation",
        "object",
        "however",
        "one",
        "construes",
        "notion",
        "representation",
        "crude",
        "pictorial",
        "theory",
        "ruled",
        "clear",
        "conceptual",
        "representation",
        "taken",
        "involve",
        "level",
        "generality",
        "obvious",
        "problem",
        "singular",
        "concept",
        "concerned",
        "yet",
        "given",
        "john",
        "buridan",
        "claim",
        "spoken",
        "term",
        "called",
        "universal",
        "singular",
        "unless",
        "corresponds",
        "universal",
        "singular",
        "concept",
        "must",
        "singular",
        "concept",
        "genuine",
        "singular",
        "term",
        "shall",
        "see",
        "buridan",
        "introduces",
        "extra",
        "condition",
        "singular",
        "concept",
        "allowing",
        "certain",
        "kind",
        "generality",
        "concept",
        "said",
        "signify",
        "naturally",
        "signification",
        "thinker",
        "least",
        "thinker",
        "experience",
        "spoken",
        "term",
        "written",
        "term",
        "subordinated",
        "thought",
        "acquire",
        "signification",
        "original",
        "act",
        "imposition",
        "author",
        "careful",
        "commit",
        "account",
        "original",
        "imposition",
        "actually",
        "occurs",
        "recognized",
        "word",
        "person",
        "spirit",
        "important",
        "theological",
        "context",
        "acquire",
        "new",
        "connotation",
        "generally",
        "supposed",
        "signification",
        "common",
        "noun",
        "within",
        "given",
        "conventional",
        "language",
        "remains",
        "stable",
        "proper",
        "name",
        "easier",
        "difficult",
        "account",
        "difficult",
        "entirely",
        "plausible",
        "account",
        "stability",
        "signification",
        "appeal",
        "standard",
        "definition",
        "easier",
        "easily",
        "ascertainable",
        "instance",
        "original",
        "imposition",
        "particularly",
        "christian",
        "baptism",
        "though",
        "paul",
        "venice",
        "explicitly",
        "recognized",
        "nonchristians",
        "equivalent",
        "namegiving",
        "ceremony",
        "medieval",
        "logician",
        "insisted",
        "original",
        "imposition",
        "carried",
        "someone",
        "group",
        "special",
        "authority",
        "produced",
        "puzzle",
        "use",
        "proper",
        "name",
        "word",
        "lion",
        "signifies",
        "particular",
        "specie",
        "animal",
        "say",
        "lion",
        "always",
        "lion",
        "mary",
        "always",
        "mary",
        "buridan",
        "devoted",
        "one",
        "sophism",
        "summulae",
        "de",
        "dialectica",
        "question",
        "whether",
        "one",
        "truly",
        "say",
        "ba",
        "baptized",
        "ba",
        "deliberately",
        "chosen",
        "nonsense",
        "syllable",
        "given",
        "ba",
        "signify",
        "boy",
        "baptism",
        "take",
        "place",
        "concluded",
        "sentence",
        "question",
        "truthvalue",
        "though",
        "boy",
        "ba",
        "true",
        "tomorrow",
        "boy",
        "called",
        "ba",
        "could",
        "true",
        "paul",
        "venice",
        "asked",
        "would",
        "happen",
        "baptized",
        "socrates",
        "person",
        "consistently",
        "called",
        "plato",
        "whole",
        "community",
        "even",
        "forgot",
        "original",
        "name",
        "paul",
        "thought",
        "person",
        "would",
        "still",
        "socrates",
        "since",
        "original",
        "baptism",
        "involved",
        "appropriate",
        "authority",
        "hand",
        "legitimate",
        "change",
        "possible",
        "newly",
        "elected",
        "pope",
        "take",
        "new",
        "name",
        "result",
        "various",
        "remark",
        "seems",
        "mary",
        "mary",
        "named",
        "cease",
        "mary",
        "given",
        "new",
        "name",
        "someone",
        "authority"
    ]
}