{
    "main_text": "Contemporary skepticism\n6. Contemporary skepticism\n\nJust as in many other parts of the world, contemporary skepticism in\nLatin America deals with epistemological issues within analytic theory\nof knowledge. Many anti-skeptical strategies, such as contextualism\nand externalism, deserved close scrutiny by Latin American\nphilosophers. Also the transcendental strategy has captured the\nattention of many philosophers interested in skepticism. But\ncontemporary skepticism is not confined to epistemology alone and it\nengages with, more broadly, analytic philosophy as a whole. Analytic\nworries about language and, more specifically, the notion of meaning\nhave led to the development of a new form of skepticism, known as\nmeaning skepticism. We will review some of the discussions on these\ntopics, beginning with the connections between skepticism and analytic\nphilosophy.\n\nDanilo Marcondes de Souza Filho (Brazil) developed some skeptical\nconcepts using Austin’s pragmatist view of language, and he also\nidentified many common ideas between Wittgenstein and Pyrrhonism\n(Marcondes de Souza Filho 1988, 1996a,b). Thus, Marcondes was\narticulating Pyrrhonism further in a similar spirit as Porchat.\nAnother groundbreaking work on skepticism derived from the linguistic\nturn is that of Samuel Cabanchik (Argentina). Cabanchik was interested\nin the possibility of a linguistic form of skepticism or skepticism\nabout meaning not only in Wittgenstein, but also in Aristotle and\nFrancisco Sanchez. His main focus, however, was Wittgenstein, about\nwhom he wrote two books (2003, 2010) and many papers (1990,\n2008a,b).\n\nMarcondes’ and Cabanchik’s concern with analytic\nphilosophy and its relation to skepticism was truly a guide to other\nphilosophers. The connections between skepticism and the philosophy of\nthe later Wittgenstein have been highlighted by many scholars.\nPlínio Junqueira Smith (1994) tried to show the strong\naffinities between Wittgenstein’s later philosophy and ancient\nPyrrhonism, to which Paulo Roberto Margutti (Brazil) (Pinto 1996a)\noffered a criticism. In the same spirit, Guadalupe Reinoso (Argentina)\n(2006, 2008, 2009) calls our attention to the value of skepticism in\nboth Sextus and Wittgenstein as an ars vivendi: their\ncriticism of language’s bewitchment, anti-theoretical\nperspective, and conception of philosophy as a therapy. Magdalena\nHolguín (Colombia) (1997) and R. Meléndez (Colombia)\n(2014) also analyze the relations between skepticism and Wittgenstein.\nPamela Lastres (Peru) (2011) has recently been doing some promising\nwork on Wittgenstein and Moore, but also on Pyrrhonian skepticism. It\nis also worth noting that Oscar Nudler (Argentina) (2010) has\ndeveloped what he calls a “philosophy of the limits”,\ninspired both by Wittgenstein and the Socratic awareness of our\nignorance, which, although not properly skeptic, is a doctrine at\nleast closely associated with skepticism.\n\nMore recently, Glenda Satne (Argentina) (2003, 2005a,b, 2008) also\npursued a line of research based on analytic theories of meaning and,\nmore specifically, on meaning skepticism. She has been busy with\nskeptical arguments derived from contemporary semantics, such as\nQuine’s argument from the indeterminacy of radical translation,\nPutnam’s model-theoretic argument, Dummett’s argument from\nthe manifestation of linguistic knowledge and, above all,\nKripke’s (or Kripkenstein’s) skeptical arguments. Meaning\nskepticism was also the subject of a very well informed book by Silvio\nMota Pinto (Brazil/Mexico) (2009, 2014), and Efraín Lazos\n(Mexico) (2002) published interesting papers on Wittgenstein, Kripke,\nand meaning skepticism as well.\n\nThus, the connection between skepticism and analytic philosophy became\na topic to be further explored by Latin American philosophers. Porchat\nhad argued that contemporary analytic philosophy was to a good extent\nskeptical without knowing it. According to him, many analytic\nphilosophers don’t understand very well what skeptics had said\nand what they call a skeptic does not correspond to skepticism,\nproperly understood. If they had the appropriate knowledge of the\nhistory of skepticism, they would perhaps acknowledge the skeptical\norientation of their doctrines. It is not clear, however, that that is\nthe case in analytic philosophy. One debate that has received some\nattention is how far this or that analytic philosopher is close to\nskepticism. For instance, against Porchat’s opinion about Quine,\nMarcos Nascimento Bulcão (Brazil) wrote a book on Quine’s\nnaturalistic realism, denying that he is a skeptic (Bulcão\n2008). However, the perception of a skeptical Quine still persists in\nsome places.\n\nDavidson is another analytic philosopher whose connections to\nskepticism have been assessed by Latin American philosophers. Eleonora\nOrlando (Argentina) (2000) wrote a paper criticizing Davidson, for his\nconception of language would end up, despite his intentions, into a\nkind of semantic skepticism. Cristian Barturén (Peru), on the\nother hand, is interested on Davidson’s critique of global\nSkepticism. Otávio Bueno (Brazil/USA) criticized the way in\nwhich Davidson tries to respond to skepticism (Bueno 2005).\n\nThe relation between P.F. Strawson and skepticism has also been\nassessed by a number of Latin American scholars on contemporary\nskepticism or on analytic philosophy. Perhaps the most important\ncontribution comes from a Mexican group. We will talk more about them\nbelow, when we discuss transcendental arguments as an anti-skeptical\nstrategy. Sergio Sanchez (Argentina) (2006), Marco Franciotti (2009)\nand Plínio Junqueira Smith (2015) have also done some work in\nthis topic.\n\nOther analytic philosophers engaged with the issue further. To give\nbut one example, Miguel Ángel Fernández (Mexico) (2014)\ncriticized the incoherence of the anti-skeptical epistemology of\nbelief attribution developed by Crispin Wright. According to\nFernández, Wright intends to combine two desiderata in\na single anti-skeptical strategy, to wit, a concessive\nelement to the skeptic, on the one hand, and a rescue\nelement, on the other. However, he argues, that combination is\nimpossible.\n\nPerhaps one should note that contemporary skepticism was also\ndeveloped along other philosophical traditions, not only of an\nanalytic orientation. Under the influence of Wittgenstein, but also of\nStanley Cavell, Mario Gensollem (Mexico) (2006) explored the role of\nskepticism not only in philosophy, but also in common life. He came to\nembrace the Cavellian thesis that philosophical skepticism is the best\nexpression of the intrinsic finitude of human nature. Sergio\nSánchez (Argentina) (2006) called attention not only to\nStrawson’s but also to Heidegger’s assessment of skeptical\narguments. Jônadas Techio (Brazil) (2013) also investigated,\nfrom a Cavellian and Heideggerian points of view, the importance of\nphilosophical skepticism.\n\nSkeptical worries are usually linked to epistemological issues. We\nfind in Mexico a group of philosophers who have a very strong\nconnection to skepticism. They go as far as proposing new forms of\nskepticism. Armando Cíntora (Mexico) (2010), for instance,\nholds a Pyrrhonian position in philosophy of science. According to\nCíntora, a methodological Pyrrhonism would be of great help to\nliberate scientists from the dogmas that keep them captive when they\ntry to develop their scientific research. Just like in Sextus’\ncase, Cíntora argues that this kind of methodological\nPyrrhonism is not an epistemic paralysis: Pyrrhonian scientists can\npractice science, since they are aware of the non-dogmatic (temporal)\ncharacter of their ontological, methodological and semantic\nprinciples. Such acknowledgment will keep them safe from a dogmatic\noutlook.\n\nJorge Ornelas (Mexico) (2012, 2014a; Cíntora and Ornelas\n2013a), a younger member of that group, focused on the main\nanti-skeptical strategies in contemporary philosophy (contextualism,\nbelief-attribution epistemology, dogmatism, transcendental approach,\nexternalism, etc.). Ornelas tried to show that none of these\nstrategies succeed or dislodge the traditional skeptical challenge,\nchiefly because they lack a satisfactory diagnosis of the motivations\nbehind the skeptical problematic. Therefore, they fall prey to a\ndouble error: not only do they fail to eradicate the basic motivations\nbehind skepticism, but also they pay no attention to the fact that the\ntraditional skeptical problematic emerges only for theories and\nconcepts of knowledge that do not threaten ordinary knowledge\nattributions.\n\nFallibilism and skepticism were the topics of some papers written by\nGuillermo Hurtado (Mexico). Hurtado (2002a) holds that, although these\ntwo positions are closely related, one must keep them apart; he\nrejects fallibilism because it is revisionist. Not much later, he\nargues in favor of using more fine-grained epistemic terms. According\nto Hurtado (2005), one should distinguish various senses of\n“doubt”, introduce the notion of “suspicion”,\nand accept various degrees of certainty. His basic idea is to enrich\nthe vocabulary of epistemology, including more sophisticated skeptical\nterms.\n\nMany, of course, reject the skeptical position. Paulo Francisco\nEstrella Faria (Brazil) (2007, 2012), for instance, argued against\nskepticism. In fact, he thinks, skepticism is committed to a kind of\nidealism, even in the case of Porchat and despite his explicit\nrejection of this philosophical view. According to Faria, any\nassertion implies a claim to absolute truth and, if skeptics assert\nanything, as they do in ordinary life, then they are committed to what\nthey would rather avoid. The skeptic view of language is, therefore,\nuntenable, and there is a type of pragmatic contradiction in the\nskeptic’s position. That criticism has been endorsed by Roberto\nHorácio de Sá Pereira (Brazil) (2003, 2015).\n\nThe works of Eleonora Cresto (Argentina) and Alejandro Miroli\n(Argentina) also distance themselves from the skeptical position.\nCresto (1996, 1997) focused on anti-skeptical strategies that arise\nfrom naturalistic positions, whether along Wittgensteinian lines or\nfollowing F. Dretske and other reliabilists. Miroli (2007, 2008,\n2010), in turn, dealt with scientific skepticism, addressing both\ngeneral cases and socially important ones. He also examined\nDretske’s relevant alternatives argument, and tried to determine\nwhich kinds of alternatives one should exclude and which one can\nneglect in knowledge attributions.\n\nSeveral additional epistemological strategies were put under close\nscrutiny by Latin American epistemologists. Here are a few of them.\nDiana Hoyos (Colombia) (2006) works on contemporary theory of\nknowledge, linking the concepts of epistemic responsibility, Gettier\nexamples and skepticism. Jorge Gregorio Posada (Colombia) (2007) has\nresponded to her work. Ignacio Ávila (Colombia) (2003)\nconfronts Davidson’s thesis that most of our beliefs are true\nwith the corresponding skeptical challenge. Another popular\nanti-skeptical strategy is contextualism. Flávio Williges\n(Brazil) devoted his Ph.D. dissertation to that subject, from which\nresulted a paper (Williges 2013), and André Joffily Abath\n(Brazil) (2012) uses contextualism to refute Cartesian skepticism.\n\nAmong the anti-skeptical strategies, the one that invokes\ntranscendental considerations deserves special mention. A group of\nphilosophers in Mexico is the most distinguished one concerning this\nKantian-Strawsonian-inspired answer to skepticism. Pedro Stepanenko\n(Mexico) explored the anti-skeptical potential of the Kantian concept\nof the synthetic unity of apperception in many papers (2001, 2002a,\n2006, 2007, 2008). According to his interpretation, this unity should\nbe considered as the unity of our mental states that is possible only\nthrough the inferential relations to their contents. This unity makes\npossible the self-consciousness that any argumentative practice\nrequires. If we could suspend judgment with respect to any subject, we\nwould renounce to establish inferential relations among the contents\nof our mental states; in that case, there would be no consciousness\nunity, nor knowledge of our mental states.\n\nIn that same Kantian group, the works of Efraín Lazos\n(México) are outstanding. Lazos (2002, 2014) was able to\ncombine Kantian and Wittgensteinian anti-skepticism to produce new\nperspectives on the skeptical challenge. More recently, Lazos appealed\nto a transcendental strategy based on the works of Barry Stroud to\nshow the anti-skeptical force of transcendental arguments. Isabel\nCabrera (Mexico) (1999) edited a book on transcendental arguments, in\nwhich the force and limits of such arguments as tools against\nskepticism are assessed. Cabrera (2002) also worked out the relations\nbetween Buddhism and skepticism. In particular, she showed that both\nin Buddhism and in Humean skepticism there is an attack on the notion\nof substance, and that the lack of commitment to substances in\none’s understanding of the world has a therapeutic function,\nnamely, to avoid suffering.\n\nThe so-called Agrippan trilemma is an important argument for\ncontemporary skepticism. Some Latin American philosophers have tried\nto answer this deep, difficult skeptical challenge. José de\nTeresa (Mexico) (2000, 2013, 2014) developed an anti-skeptical\nstrategy inspired in Plato’s dialectic. According to de Teresa,\nPlato’s strategy is effective against the trilemma presented by\nthe skeptic, because it escapes the three alternatives under\nconsideration.\n\nAmong the Agrippan modes, however, the most important for Latin\nAmerican skepticism seems to be diaphonía or\ndisagreement. We saw how important it is to Porchat’s\nneo-Pyrrhonism (1969, 1991, 1993). Some efforts have recently been\nmade to compare the skeptical, Agrippan mode of\ndiaphonía to contemporary reflections on disagreement.\nOf particular importance is Diego Machuca’s (Argentina) (2013a)\nidea that diaphonía is different from disagreement.\nMachuca accuses contemporary epistemologists who defend that\ndisagreement leads to suspension of judgment of dogmatism. According\nto Machuca, they base their arguments on dogmatist principles to reach\nsuspension of judgment. It also deserves to be noted Otávio\nBueno’s (Brazil) defense of diaphonía from\nrecent attacks, such as Barnes’ criticism (Bueno 2013). Bueno\noffers an interpretation of diaphonía free from the\nproblems that arise from faulty interpretations. Perhaps this is\nanother topic in which one may discover some original contributions\nfrom Latin American skepticism. There has also been some efforts to\nextend the mode of disagreement in contemporary skepticism into\nlogical matters (Barrio 2015), as well as some discussion concerning\nevaluative judgments and the notion of relative truth (Orlando\n2014).\n",
    "section_title": "6. Contemporary skepticism",
    "entry_title": "Skepticism in Latin America",
    "hierarchy_title": "Skepticism in Latin America || Contemporary skepticism",
    "tokenized_text": [
        "contemporary",
        "skepticism",
        "contemporary",
        "skepticism",
        "many",
        "part",
        "world",
        "contemporary",
        "skepticism",
        "latin",
        "america",
        "deal",
        "epistemological",
        "issue",
        "within",
        "analytic",
        "theory",
        "knowledge",
        "many",
        "antiskeptical",
        "strategy",
        "contextualism",
        "externalism",
        "deserved",
        "close",
        "scrutiny",
        "latin",
        "american",
        "philosopher",
        "also",
        "transcendental",
        "strategy",
        "captured",
        "attention",
        "many",
        "philosopher",
        "interested",
        "skepticism",
        "contemporary",
        "skepticism",
        "confined",
        "epistemology",
        "alone",
        "engages",
        "broadly",
        "analytic",
        "philosophy",
        "whole",
        "analytic",
        "worry",
        "language",
        "specifically",
        "notion",
        "meaning",
        "led",
        "development",
        "new",
        "form",
        "skepticism",
        "known",
        "meaning",
        "skepticism",
        "review",
        "discussion",
        "topic",
        "beginning",
        "connection",
        "skepticism",
        "analytic",
        "philosophy",
        "danilo",
        "marcondes",
        "de",
        "souza",
        "filho",
        "brazil",
        "developed",
        "skeptical",
        "concept",
        "using",
        "austin",
        "pragmatist",
        "view",
        "language",
        "also",
        "identified",
        "many",
        "common",
        "idea",
        "wittgenstein",
        "pyrrhonism",
        "marcondes",
        "de",
        "souza",
        "filho",
        "a",
        "b",
        "thus",
        "marcondes",
        "articulating",
        "pyrrhonism",
        "similar",
        "spirit",
        "porchat",
        "another",
        "groundbreaking",
        "work",
        "skepticism",
        "derived",
        "linguistic",
        "turn",
        "samuel",
        "cabanchik",
        "argentina",
        "cabanchik",
        "interested",
        "possibility",
        "linguistic",
        "form",
        "skepticism",
        "skepticism",
        "meaning",
        "wittgenstein",
        "also",
        "aristotle",
        "francisco",
        "sanchez",
        "main",
        "focus",
        "however",
        "wittgenstein",
        "wrote",
        "two",
        "book",
        "many",
        "paper",
        "a",
        "b",
        "marcondes",
        "cabanchik",
        "concern",
        "analytic",
        "philosophy",
        "relation",
        "skepticism",
        "truly",
        "guide",
        "philosopher",
        "connection",
        "skepticism",
        "philosophy",
        "later",
        "wittgenstein",
        "highlighted",
        "many",
        "scholar",
        "plínio",
        "junqueira",
        "smith",
        "tried",
        "show",
        "strong",
        "affinity",
        "wittgenstein",
        "later",
        "philosophy",
        "ancient",
        "pyrrhonism",
        "paulo",
        "roberto",
        "margutti",
        "brazil",
        "pinto",
        "a",
        "offered",
        "criticism",
        "spirit",
        "guadalupe",
        "reinoso",
        "argentina",
        "call",
        "attention",
        "value",
        "skepticism",
        "sextus",
        "wittgenstein",
        "ar",
        "vivendi",
        "criticism",
        "language",
        "bewitchment",
        "antitheoretical",
        "perspective",
        "conception",
        "philosophy",
        "therapy",
        "magdalena",
        "holguín",
        "colombia",
        "r",
        "meléndez",
        "colombia",
        "also",
        "analyze",
        "relation",
        "skepticism",
        "wittgenstein",
        "pamela",
        "lastres",
        "peru",
        "recently",
        "promising",
        "work",
        "wittgenstein",
        "moore",
        "also",
        "pyrrhonian",
        "skepticism",
        "also",
        "worth",
        "noting",
        "oscar",
        "nudler",
        "argentina",
        "developed",
        "call",
        "philosophy",
        "limit",
        "inspired",
        "wittgenstein",
        "socratic",
        "awareness",
        "ignorance",
        "although",
        "properly",
        "skeptic",
        "doctrine",
        "least",
        "closely",
        "associated",
        "skepticism",
        "recently",
        "glenda",
        "satne",
        "argentina",
        "a",
        "b",
        "also",
        "pursued",
        "line",
        "research",
        "based",
        "analytic",
        "theory",
        "meaning",
        "specifically",
        "meaning",
        "skepticism",
        "busy",
        "skeptical",
        "argument",
        "derived",
        "contemporary",
        "semantics",
        "quine",
        "argument",
        "indeterminacy",
        "radical",
        "translation",
        "putnam",
        "modeltheoretic",
        "argument",
        "dummett",
        "argument",
        "manifestation",
        "linguistic",
        "knowledge",
        "kripke",
        "kripkenstein",
        "skeptical",
        "argument",
        "meaning",
        "skepticism",
        "also",
        "subject",
        "well",
        "informed",
        "book",
        "silvio",
        "mota",
        "pinto",
        "brazilmexico",
        "efraín",
        "lazos",
        "mexico",
        "published",
        "interesting",
        "paper",
        "wittgenstein",
        "kripke",
        "meaning",
        "skepticism",
        "well",
        "thus",
        "connection",
        "skepticism",
        "analytic",
        "philosophy",
        "became",
        "topic",
        "explored",
        "latin",
        "american",
        "philosopher",
        "porchat",
        "argued",
        "contemporary",
        "analytic",
        "philosophy",
        "good",
        "extent",
        "skeptical",
        "without",
        "knowing",
        "according",
        "many",
        "analytic",
        "philosopher",
        "understand",
        "well",
        "skeptic",
        "said",
        "call",
        "skeptic",
        "correspond",
        "skepticism",
        "properly",
        "understood",
        "appropriate",
        "knowledge",
        "history",
        "skepticism",
        "would",
        "perhaps",
        "acknowledge",
        "skeptical",
        "orientation",
        "doctrine",
        "clear",
        "however",
        "case",
        "analytic",
        "philosophy",
        "one",
        "debate",
        "received",
        "attention",
        "far",
        "analytic",
        "philosopher",
        "close",
        "skepticism",
        "instance",
        "porchat",
        "opinion",
        "quine",
        "marcos",
        "nascimento",
        "bulcão",
        "brazil",
        "wrote",
        "book",
        "quine",
        "naturalistic",
        "realism",
        "denying",
        "skeptic",
        "bulcão",
        "however",
        "perception",
        "skeptical",
        "quine",
        "still",
        "persists",
        "place",
        "davidson",
        "another",
        "analytic",
        "philosopher",
        "whose",
        "connection",
        "skepticism",
        "assessed",
        "latin",
        "american",
        "philosopher",
        "eleonora",
        "orlando",
        "argentina",
        "wrote",
        "paper",
        "criticizing",
        "davidson",
        "conception",
        "language",
        "would",
        "end",
        "despite",
        "intention",
        "kind",
        "semantic",
        "skepticism",
        "cristian",
        "barturén",
        "peru",
        "hand",
        "interested",
        "davidson",
        "critique",
        "global",
        "skepticism",
        "otávio",
        "bueno",
        "brazilusa",
        "criticized",
        "way",
        "davidson",
        "try",
        "respond",
        "skepticism",
        "bueno",
        "relation",
        "pf",
        "strawson",
        "skepticism",
        "also",
        "assessed",
        "number",
        "latin",
        "american",
        "scholar",
        "contemporary",
        "skepticism",
        "analytic",
        "philosophy",
        "perhaps",
        "important",
        "contribution",
        "come",
        "mexican",
        "group",
        "talk",
        "discus",
        "transcendental",
        "argument",
        "antiskeptical",
        "strategy",
        "sergio",
        "sanchez",
        "argentina",
        "marco",
        "franciotti",
        "plínio",
        "junqueira",
        "smith",
        "also",
        "done",
        "work",
        "topic",
        "analytic",
        "philosopher",
        "engaged",
        "issue",
        "give",
        "one",
        "example",
        "miguel",
        "ángel",
        "fernández",
        "mexico",
        "criticized",
        "incoherence",
        "antiskeptical",
        "epistemology",
        "belief",
        "attribution",
        "developed",
        "crispin",
        "wright",
        "according",
        "fernández",
        "wright",
        "intends",
        "combine",
        "two",
        "desideratum",
        "single",
        "antiskeptical",
        "strategy",
        "wit",
        "concessive",
        "element",
        "skeptic",
        "one",
        "hand",
        "rescue",
        "element",
        "however",
        "argues",
        "combination",
        "impossible",
        "perhaps",
        "one",
        "note",
        "contemporary",
        "skepticism",
        "also",
        "developed",
        "along",
        "philosophical",
        "tradition",
        "analytic",
        "orientation",
        "influence",
        "wittgenstein",
        "also",
        "stanley",
        "cavell",
        "mario",
        "gensollem",
        "mexico",
        "explored",
        "role",
        "skepticism",
        "philosophy",
        "also",
        "common",
        "life",
        "came",
        "embrace",
        "cavellian",
        "thesis",
        "philosophical",
        "skepticism",
        "best",
        "expression",
        "intrinsic",
        "finitude",
        "human",
        "nature",
        "sergio",
        "sánchez",
        "argentina",
        "called",
        "attention",
        "strawson",
        "also",
        "heidegger",
        "assessment",
        "skeptical",
        "argument",
        "jônadas",
        "techio",
        "brazil",
        "also",
        "investigated",
        "cavellian",
        "heideggerian",
        "point",
        "view",
        "importance",
        "philosophical",
        "skepticism",
        "skeptical",
        "worry",
        "usually",
        "linked",
        "epistemological",
        "issue",
        "find",
        "mexico",
        "group",
        "philosopher",
        "strong",
        "connection",
        "skepticism",
        "go",
        "far",
        "proposing",
        "new",
        "form",
        "skepticism",
        "armando",
        "cíntora",
        "mexico",
        "instance",
        "hold",
        "pyrrhonian",
        "position",
        "philosophy",
        "science",
        "according",
        "cíntora",
        "methodological",
        "pyrrhonism",
        "would",
        "great",
        "help",
        "liberate",
        "scientist",
        "dogma",
        "keep",
        "captive",
        "try",
        "develop",
        "scientific",
        "research",
        "like",
        "sextus",
        "case",
        "cíntora",
        "argues",
        "kind",
        "methodological",
        "pyrrhonism",
        "epistemic",
        "paralysis",
        "pyrrhonian",
        "scientist",
        "practice",
        "science",
        "since",
        "aware",
        "nondogmatic",
        "temporal",
        "character",
        "ontological",
        "methodological",
        "semantic",
        "principle",
        "acknowledgment",
        "keep",
        "safe",
        "dogmatic",
        "outlook",
        "jorge",
        "ornelas",
        "mexico",
        "a",
        "cíntora",
        "ornelas",
        "a",
        "younger",
        "member",
        "group",
        "focused",
        "main",
        "antiskeptical",
        "strategy",
        "contemporary",
        "philosophy",
        "contextualism",
        "beliefattribution",
        "epistemology",
        "dogmatism",
        "transcendental",
        "approach",
        "externalism",
        "etc",
        "ornelas",
        "tried",
        "show",
        "none",
        "strategy",
        "succeed",
        "dislodge",
        "traditional",
        "skeptical",
        "challenge",
        "chiefly",
        "lack",
        "satisfactory",
        "diagnosis",
        "motivation",
        "behind",
        "skeptical",
        "problematic",
        "therefore",
        "fall",
        "prey",
        "double",
        "error",
        "fail",
        "eradicate",
        "basic",
        "motivation",
        "behind",
        "skepticism",
        "also",
        "pay",
        "attention",
        "fact",
        "traditional",
        "skeptical",
        "problematic",
        "emerges",
        "theory",
        "concept",
        "knowledge",
        "threaten",
        "ordinary",
        "knowledge",
        "attribution",
        "fallibilism",
        "skepticism",
        "topic",
        "paper",
        "written",
        "guillermo",
        "hurtado",
        "mexico",
        "hurtado",
        "a",
        "hold",
        "although",
        "two",
        "position",
        "closely",
        "related",
        "one",
        "must",
        "keep",
        "apart",
        "reject",
        "fallibilism",
        "revisionist",
        "much",
        "later",
        "argues",
        "favor",
        "using",
        "finegrained",
        "epistemic",
        "term",
        "according",
        "hurtado",
        "one",
        "distinguish",
        "various",
        "sens",
        "doubt",
        "introduce",
        "notion",
        "suspicion",
        "accept",
        "various",
        "degree",
        "certainty",
        "basic",
        "idea",
        "enrich",
        "vocabulary",
        "epistemology",
        "including",
        "sophisticated",
        "skeptical",
        "term",
        "many",
        "course",
        "reject",
        "skeptical",
        "position",
        "paulo",
        "francisco",
        "estrella",
        "faria",
        "brazil",
        "instance",
        "argued",
        "skepticism",
        "fact",
        "think",
        "skepticism",
        "committed",
        "kind",
        "idealism",
        "even",
        "case",
        "porchat",
        "despite",
        "explicit",
        "rejection",
        "philosophical",
        "view",
        "according",
        "faria",
        "assertion",
        "implies",
        "claim",
        "absolute",
        "truth",
        "skeptic",
        "assert",
        "anything",
        "ordinary",
        "life",
        "committed",
        "would",
        "rather",
        "avoid",
        "skeptic",
        "view",
        "language",
        "therefore",
        "untenable",
        "type",
        "pragmatic",
        "contradiction",
        "skeptic",
        "position",
        "criticism",
        "endorsed",
        "roberto",
        "horácio",
        "de",
        "sá",
        "pereira",
        "brazil",
        "work",
        "eleonora",
        "cresto",
        "argentina",
        "alejandro",
        "miroli",
        "argentina",
        "also",
        "distance",
        "skeptical",
        "position",
        "cresto",
        "focused",
        "antiskeptical",
        "strategy",
        "arise",
        "naturalistic",
        "position",
        "whether",
        "along",
        "wittgensteinian",
        "line",
        "following",
        "f",
        "dretske",
        "reliabilists",
        "miroli",
        "turn",
        "dealt",
        "scientific",
        "skepticism",
        "addressing",
        "general",
        "case",
        "socially",
        "important",
        "one",
        "also",
        "examined",
        "dretske",
        "relevant",
        "alternative",
        "argument",
        "tried",
        "determine",
        "kind",
        "alternative",
        "one",
        "exclude",
        "one",
        "neglect",
        "knowledge",
        "attribution",
        "several",
        "additional",
        "epistemological",
        "strategy",
        "put",
        "close",
        "scrutiny",
        "latin",
        "american",
        "epistemologist",
        "diana",
        "hoyos",
        "colombia",
        "work",
        "contemporary",
        "theory",
        "knowledge",
        "linking",
        "concept",
        "epistemic",
        "responsibility",
        "gettier",
        "example",
        "skepticism",
        "jorge",
        "gregorio",
        "posada",
        "colombia",
        "responded",
        "work",
        "ignacio",
        "ávila",
        "colombia",
        "confronts",
        "davidson",
        "thesis",
        "belief",
        "true",
        "corresponding",
        "skeptical",
        "challenge",
        "another",
        "popular",
        "antiskeptical",
        "strategy",
        "contextualism",
        "flávio",
        "williges",
        "brazil",
        "devoted",
        "phd",
        "dissertation",
        "subject",
        "resulted",
        "paper",
        "williges",
        "andré",
        "joffily",
        "abath",
        "brazil",
        "us",
        "contextualism",
        "refute",
        "cartesian",
        "skepticism",
        "among",
        "antiskeptical",
        "strategy",
        "one",
        "invokes",
        "transcendental",
        "consideration",
        "deserves",
        "special",
        "mention",
        "group",
        "philosopher",
        "mexico",
        "distinguished",
        "one",
        "concerning",
        "kantianstrawsonianinspired",
        "answer",
        "skepticism",
        "pedro",
        "stepanenko",
        "mexico",
        "explored",
        "antiskeptical",
        "potential",
        "kantian",
        "concept",
        "synthetic",
        "unity",
        "apperception",
        "many",
        "paper",
        "a",
        "according",
        "interpretation",
        "unity",
        "considered",
        "unity",
        "mental",
        "state",
        "possible",
        "inferential",
        "relation",
        "content",
        "unity",
        "make",
        "possible",
        "selfconsciousness",
        "argumentative",
        "practice",
        "requires",
        "could",
        "suspend",
        "judgment",
        "respect",
        "subject",
        "would",
        "renounce",
        "establish",
        "inferential",
        "relation",
        "among",
        "content",
        "mental",
        "state",
        "case",
        "would",
        "consciousness",
        "unity",
        "knowledge",
        "mental",
        "state",
        "kantian",
        "group",
        "work",
        "efraín",
        "lazos",
        "méxico",
        "outstanding",
        "lazos",
        "able",
        "combine",
        "kantian",
        "wittgensteinian",
        "antiskepticism",
        "produce",
        "new",
        "perspective",
        "skeptical",
        "challenge",
        "recently",
        "lazos",
        "appealed",
        "transcendental",
        "strategy",
        "based",
        "work",
        "barry",
        "stroud",
        "show",
        "antiskeptical",
        "force",
        "transcendental",
        "argument",
        "isabel",
        "cabrera",
        "mexico",
        "edited",
        "book",
        "transcendental",
        "argument",
        "force",
        "limit",
        "argument",
        "tool",
        "skepticism",
        "assessed",
        "cabrera",
        "also",
        "worked",
        "relation",
        "buddhism",
        "skepticism",
        "particular",
        "showed",
        "buddhism",
        "humean",
        "skepticism",
        "attack",
        "notion",
        "substance",
        "lack",
        "commitment",
        "substance",
        "one",
        "understanding",
        "world",
        "therapeutic",
        "function",
        "namely",
        "avoid",
        "suffering",
        "socalled",
        "agrippan",
        "trilemma",
        "important",
        "argument",
        "contemporary",
        "skepticism",
        "latin",
        "american",
        "philosopher",
        "tried",
        "answer",
        "deep",
        "difficult",
        "skeptical",
        "challenge",
        "josé",
        "de",
        "teresa",
        "mexico",
        "developed",
        "antiskeptical",
        "strategy",
        "inspired",
        "plato",
        "dialectic",
        "according",
        "de",
        "teresa",
        "plato",
        "strategy",
        "effective",
        "trilemma",
        "presented",
        "skeptic",
        "escape",
        "three",
        "alternative",
        "consideration",
        "among",
        "agrippan",
        "mode",
        "however",
        "important",
        "latin",
        "american",
        "skepticism",
        "seems",
        "diaphonía",
        "disagreement",
        "saw",
        "important",
        "porchat",
        "neopyrrhonism",
        "effort",
        "recently",
        "made",
        "compare",
        "skeptical",
        "agrippan",
        "mode",
        "diaphonía",
        "contemporary",
        "reflection",
        "disagreement",
        "particular",
        "importance",
        "diego",
        "machuca",
        "argentina",
        "a",
        "idea",
        "diaphonía",
        "different",
        "disagreement",
        "machuca",
        "accuses",
        "contemporary",
        "epistemologist",
        "defend",
        "disagreement",
        "lead",
        "suspension",
        "judgment",
        "dogmatism",
        "according",
        "machuca",
        "base",
        "argument",
        "dogmatist",
        "principle",
        "reach",
        "suspension",
        "judgment",
        "also",
        "deserves",
        "noted",
        "otávio",
        "bueno",
        "brazil",
        "defense",
        "diaphonía",
        "recent",
        "attack",
        "barnes",
        "criticism",
        "bueno",
        "bueno",
        "offer",
        "interpretation",
        "diaphonía",
        "free",
        "problem",
        "arise",
        "faulty",
        "interpretation",
        "perhaps",
        "another",
        "topic",
        "one",
        "may",
        "discover",
        "original",
        "contribution",
        "latin",
        "american",
        "skepticism",
        "also",
        "effort",
        "extend",
        "mode",
        "disagreement",
        "contemporary",
        "skepticism",
        "logical",
        "matter",
        "barrio",
        "well",
        "discussion",
        "concerning",
        "evaluative",
        "judgment",
        "notion",
        "relative",
        "truth",
        "orlando"
    ]
}