{
    "main_text": "Contextualism\n4. Contextualism\n\nSo far, we have looked at reasons for and against the two premises of\nthe CP argument for Cartesian Skepticism. A different kind of approach\nto the argument requires some setup. Philosophers routinely\ndistinguish between sentences and the propositions\nexpressed by some of them. Sentences are language-dependent entities\nwhereas propositions are (something like) the informational content of\nsome of those language-dependent entities (see entry on\n propositions).\n Thus, we distinguish between the proposition that it is raining and\nthe English sentence It is raining. That very same\nproposition can be expressed by other sentences, such as the Spanish\nsentence Está lloviendo. Moreover, which proposition a\ngiven sentence expresses (if any) can depend on contextual\nfactors—that is to say, the same sentence may express one\nproposition when produced in a given a context, and a different one\nwhen produced in a different context. Thus, when Tomás says\nthat it is raining he expresses the proposition that it is raining in\nTucson on May 14, 2019, whereas when Manolo said “Está\nlloviendo” last week, he expressed the proposition that it was\nraining in Mar del Plata on May 10, 2019.\n\nThe contextualist response to the argument for Cartesian Skepticism\nrests on the claim that which propositions the sentences used in that\nargument express is also a context-sensitive matter. Different\ncontextualists would fill in the details in different ways—here\nwe follow most closely the contextualism of Cohen 1987, 1988, 2000,\n2005, 2014a,b, but see also Lewis 1996, DeRose 1992, 1995, 2002, 2004,\n2005 and Stine 1976. Notice, to begin with, that justification comes\nin degrees: one can be more justified in believing one proposition\nthan another. But there is also such a thing as being justified\ntout court. In this respect, it can be argued that\n“justified” is like “tall”, in that we can\nmake sense both of comparative uses, such as when we say that\nTomás is taller than his mother, and of non-comparative ones,\nsuch as when we say that Jordan is tall. Notice also that which\nproposition is expressed by a non-comparative use of\n“tall” does not float free from what would be appropriate\ncomparative uses. Thus, when I say “Jordan is tall”, what\nI say is true provided that Jordan is taller than the average subject\nin the relevant contrast class. Thus, if Jordan is a fifth-grader,\nthen what I said would be true if Jordan is taller than the average\nfifth-grader, whereas if Jordan is an NBA player, then what I said\nwould be true if Jordan is taller than the average NBA player (who\nplays in Jordan’s position, perhaps). Similarly, the\ncontextualist claims that when I say that I am justified in believing\na proposition, what I say is true if and only if my degree of\njustification for believing the proposition is higher than a\ncontextually set threshold. That threshold, moreover, can vary with\nthe conversational context. Thus, if we are doing epistemology and\nthinking about the requirements for justification, the threshold\nrequired for an utterance of “I am justified in believing I have\nhands” goes up to the point where few (if any) of us would count\nas having said something true, whereas in an everyday context the\nthreshold goes down to the point where most of us would count as\nhaving said something true.\n\nAccording to contextualism, then, there is no single proposition\nexpressed by the sentences used in the CP-based argument for Cartesian\nSkepticism. Rather, there are many such propositions. Two interesting\nones are the propositions expressed in everyday contexts, where CP2 as\nwell as the conclusion of the argument express false propositions, and\nthose expressed in heightened-scrutiny contexts, where both CP2 as\nwell as the conclusion of the argument express true propositions. CP1\n(as well as CP itself) always expresses a true proposition, as long as\nwe do not change contexts mid-sentence. Thus, the contextualist\nresponse to the CP-based argument is that it is at least two\narguments: a sound one, when produced in heightened-scrutiny contexts,\nand one with a false premise (and a false conclusion) when produced in\nordinary contexts. Contextualism is thus a more concessive response to\nthe skeptic than the ones we have canvassed so far, for it concedes\nthat the sentences used in the argument for Cartesian Skepticism can\nbe used to express propositions which constitute a sound argument.\n\nBut even though Contextualism represents a concessive answer to\nskepticism, it is certainly not concessive enough in the eyes of the\nskeptic. For the contextualist simply asserts that, in ordinary\ncontexts, we are justified in rejecting skeptical hypotheses. But\nrecall that the skeptic’s idea was that CP2 is true even when we\nhave in mind even minimally demanding standards for justification. In\nother words, the skeptic claims that we are not justified in believing\nthe negation of skeptical hypotheses even a little bit, not just that\nwe do not meet a very stringent standard for justification. Now, the\nskeptic might well be wrong about this, but the contextualist, qua\ncontextualist, does not have any argument for his trademark claim that\nwe do have some justification for believing the negation of skeptical\nhypotheses. In this respect, contextualism as a response to the\nskeptic is parasitic on some independent argument to the effect that\nwe do have that kind of justification.\n\nA related issue regarding Contextualism pertains to its relevance to\nskepticism. Grant, if only for the sake of argument, that\nContextualism regarding knowledge and justification attributions is\ntrue. That is to say, grant that there are multiple properties that,\nsay, “justified” could refer to. Couldn’t skeptics,\nand epistemologists more generally, be interested in a subset (perhaps\njust one) of them? If so, the interesting epistemological arguments\nwould pertain to the conditions under which that property is\ninstantiated, and Contextualism would fall by the wayside. For a\ndebate regarding this and related issues, see Conee 2014a,b and Cohen\n2014a,b.\n\nA view which is related to, but crucially different from,\nContextualism goes under various names in the literature:\n“Subject-Sensitive Invariantism”, “Interest Relative\nInvariantism” or views which admit of “pragmatic\nencroachment” (see Fantl and McGrath 2002, 2007, 2009; Hawthorne\n2003; and Stanley 2005). Whereas the contextualist thinks that the\nsame sentence attributing justification can express different\npropositions depending on the context in which it is produced, the\nsubject-sensitive invariantist thinks that the proposition expressed\nis invariant, but its truth-value depends on features of the subject\nwhich can vary (such as how important it is to the subject that the\nbelief in question be true). Very roughly, a version of\nsubject-sensitive invariantism has it that a sentence of the form\n“S is justified in believing p” invariantly\nexpresses a proposition which entails that S’s\njustification for believing p is at least high enough for\nS to be rational in acting as if p is true. Notice that\nwhether it is rational for S to act as if p is\ntraditionally thought to depend on two things: the degree of\njustification S has for believing that p (or, perhaps\nmore commonly in the context of decision theory, which degree of\nbelief, or credence, S is justified in assigning to p),\nand S’s preferences. Thus, the more sensitive\nS’s preferences are with respect to whether p is\ntrue, the more justified in believing p S must be for the\nproposition that S is justified (tout court) in\nbelieving p to be true. For instance, if nothing much hangs,\nfor S, on whether there is orange juice in the house, a faint\nmemory of having seen some in the fridge might be enough for it to be\ntrue that S is justified in believing that there is orange\njuice in the house. On the other hand, if S is diabetic and\nneeds to ingest some sugar quickly, that same faint memory might not\nbe enough for that same proposition to be true. Notice the difference\nbetween Contextualism and Subject-Sensitive Invariantism: the\ncontextualist might say that the same sentence (that S is\njustified in believing that there is orange juice in the house)\nexpresses two different propositions (one true, the other false)\ndepending on whether the conversational context includes the\ninformation that S is diabetic and needs to ingest sugar; the\nsubject-sensitive invariantist, on the other hand, holds that the\nsentence in question always expresses the same proposition, but that\nvery proposition is true in the first case but false in the\nsecond.\n\nSubject-Sensitive Invariantism has been subject to a number of\ncriticisms (see McGrath 2004; DeRose 2002, 2004, 2005; Cohen 2005;\nComesaña 2013; Anderson and Hawthorne, 2019a,b), but the\ngeneral approach has also been ably defended (see the previously cited\nwork by Fantl and McGrath). Nevertheless, the same issue that arose\nwith respect to Contextualism seems to arise here. The\nSubject-Sensitive Invariantist needs an independent argument to the\neffect that we can be justified at least to a minimal degree in\nbelieving the negations of skeptical hypotheses, for otherwise his\ntrademark claim that propositions attributing us justification for\nbelieving such claims are true is itself unjustified.\n",
    "section_title": "4. Contextualism",
    "entry_title": "Skepticism",
    "hierarchy_title": "Skepticism || Contextualism",
    "tokenized_text": [
        "contextualism",
        "contextualism",
        "far",
        "looked",
        "reason",
        "two",
        "premise",
        "cp",
        "argument",
        "cartesian",
        "skepticism",
        "different",
        "kind",
        "approach",
        "argument",
        "requires",
        "setup",
        "philosopher",
        "routinely",
        "distinguish",
        "sentence",
        "proposition",
        "expressed",
        "sentence",
        "languagedependent",
        "entity",
        "whereas",
        "proposition",
        "something",
        "like",
        "informational",
        "content",
        "languagedependent",
        "entity",
        "see",
        "entry",
        "proposition",
        "thus",
        "distinguish",
        "proposition",
        "raining",
        "english",
        "sentence",
        "raining",
        "proposition",
        "expressed",
        "sentence",
        "spanish",
        "sentence",
        "está",
        "lloviendo",
        "moreover",
        "proposition",
        "given",
        "sentence",
        "express",
        "depend",
        "contextual",
        "factorsthat",
        "say",
        "sentence",
        "may",
        "express",
        "one",
        "proposition",
        "produced",
        "given",
        "context",
        "different",
        "one",
        "produced",
        "different",
        "context",
        "thus",
        "tomás",
        "say",
        "raining",
        "express",
        "proposition",
        "raining",
        "tucson",
        "may",
        "whereas",
        "manolo",
        "said",
        "está",
        "lloviendo",
        "last",
        "week",
        "expressed",
        "proposition",
        "raining",
        "mar",
        "del",
        "plata",
        "may",
        "contextualist",
        "response",
        "argument",
        "cartesian",
        "skepticism",
        "rest",
        "claim",
        "proposition",
        "sentence",
        "used",
        "argument",
        "express",
        "also",
        "contextsensitive",
        "matter",
        "different",
        "contextualists",
        "would",
        "fill",
        "detail",
        "different",
        "wayshere",
        "follow",
        "closely",
        "contextualism",
        "cohen",
        "a",
        "b",
        "see",
        "also",
        "lewis",
        "derose",
        "stine",
        "notice",
        "begin",
        "justification",
        "come",
        "degree",
        "one",
        "justified",
        "believing",
        "one",
        "proposition",
        "another",
        "also",
        "thing",
        "justified",
        "tout",
        "court",
        "respect",
        "argued",
        "justified",
        "like",
        "tall",
        "make",
        "sense",
        "comparative",
        "us",
        "say",
        "tomás",
        "taller",
        "mother",
        "noncomparative",
        "one",
        "say",
        "jordan",
        "tall",
        "notice",
        "also",
        "proposition",
        "expressed",
        "noncomparative",
        "use",
        "tall",
        "float",
        "free",
        "would",
        "appropriate",
        "comparative",
        "us",
        "thus",
        "say",
        "jordan",
        "tall",
        "say",
        "true",
        "provided",
        "jordan",
        "taller",
        "average",
        "subject",
        "relevant",
        "contrast",
        "class",
        "thus",
        "jordan",
        "fifthgrader",
        "said",
        "would",
        "true",
        "jordan",
        "taller",
        "average",
        "fifthgrader",
        "whereas",
        "jordan",
        "nba",
        "player",
        "said",
        "would",
        "true",
        "jordan",
        "taller",
        "average",
        "nba",
        "player",
        "play",
        "jordan",
        "position",
        "perhaps",
        "similarly",
        "contextualist",
        "claim",
        "say",
        "justified",
        "believing",
        "proposition",
        "say",
        "true",
        "degree",
        "justification",
        "believing",
        "proposition",
        "higher",
        "contextually",
        "set",
        "threshold",
        "threshold",
        "moreover",
        "vary",
        "conversational",
        "context",
        "thus",
        "epistemology",
        "thinking",
        "requirement",
        "justification",
        "threshold",
        "required",
        "utterance",
        "justified",
        "believing",
        "hand",
        "go",
        "point",
        "u",
        "would",
        "count",
        "said",
        "something",
        "true",
        "whereas",
        "everyday",
        "context",
        "threshold",
        "go",
        "point",
        "u",
        "would",
        "count",
        "said",
        "something",
        "true",
        "according",
        "contextualism",
        "single",
        "proposition",
        "expressed",
        "sentence",
        "used",
        "cpbased",
        "argument",
        "cartesian",
        "skepticism",
        "rather",
        "many",
        "proposition",
        "two",
        "interesting",
        "one",
        "proposition",
        "expressed",
        "everyday",
        "context",
        "cp",
        "well",
        "conclusion",
        "argument",
        "express",
        "false",
        "proposition",
        "expressed",
        "heightenedscrutiny",
        "context",
        "cp",
        "well",
        "conclusion",
        "argument",
        "express",
        "true",
        "proposition",
        "cp",
        "well",
        "cp",
        "always",
        "express",
        "true",
        "proposition",
        "long",
        "change",
        "context",
        "midsentence",
        "thus",
        "contextualist",
        "response",
        "cpbased",
        "argument",
        "least",
        "two",
        "argument",
        "sound",
        "one",
        "produced",
        "heightenedscrutiny",
        "context",
        "one",
        "false",
        "premise",
        "false",
        "conclusion",
        "produced",
        "ordinary",
        "context",
        "contextualism",
        "thus",
        "concessive",
        "response",
        "skeptic",
        "one",
        "canvassed",
        "far",
        "concedes",
        "sentence",
        "used",
        "argument",
        "cartesian",
        "skepticism",
        "used",
        "express",
        "proposition",
        "constitute",
        "sound",
        "argument",
        "even",
        "though",
        "contextualism",
        "represents",
        "concessive",
        "answer",
        "skepticism",
        "certainly",
        "concessive",
        "enough",
        "eye",
        "skeptic",
        "contextualist",
        "simply",
        "asserts",
        "ordinary",
        "context",
        "justified",
        "rejecting",
        "skeptical",
        "hypothesis",
        "recall",
        "skeptic",
        "idea",
        "cp",
        "true",
        "even",
        "mind",
        "even",
        "minimally",
        "demanding",
        "standard",
        "justification",
        "word",
        "skeptic",
        "claim",
        "justified",
        "believing",
        "negation",
        "skeptical",
        "hypothesis",
        "even",
        "little",
        "bit",
        "meet",
        "stringent",
        "standard",
        "justification",
        "skeptic",
        "might",
        "well",
        "wrong",
        "contextualist",
        "qua",
        "contextualist",
        "argument",
        "trademark",
        "claim",
        "justification",
        "believing",
        "negation",
        "skeptical",
        "hypothesis",
        "respect",
        "contextualism",
        "response",
        "skeptic",
        "parasitic",
        "independent",
        "argument",
        "effect",
        "kind",
        "justification",
        "related",
        "issue",
        "regarding",
        "contextualism",
        "pertains",
        "relevance",
        "skepticism",
        "grant",
        "sake",
        "argument",
        "contextualism",
        "regarding",
        "knowledge",
        "justification",
        "attribution",
        "true",
        "say",
        "grant",
        "multiple",
        "property",
        "say",
        "justified",
        "could",
        "refer",
        "skeptic",
        "epistemologist",
        "generally",
        "interested",
        "subset",
        "perhaps",
        "one",
        "interesting",
        "epistemological",
        "argument",
        "would",
        "pertain",
        "condition",
        "property",
        "instantiated",
        "contextualism",
        "would",
        "fall",
        "wayside",
        "debate",
        "regarding",
        "related",
        "issue",
        "see",
        "conee",
        "a",
        "b",
        "cohen",
        "a",
        "b",
        "view",
        "related",
        "crucially",
        "different",
        "contextualism",
        "go",
        "various",
        "name",
        "literature",
        "subjectsensitive",
        "invariantism",
        "interest",
        "relative",
        "invariantism",
        "view",
        "admit",
        "pragmatic",
        "encroachment",
        "see",
        "fantl",
        "mcgrath",
        "hawthorne",
        "stanley",
        "whereas",
        "contextualist",
        "think",
        "sentence",
        "attributing",
        "justification",
        "express",
        "different",
        "proposition",
        "depending",
        "context",
        "produced",
        "subjectsensitive",
        "invariantist",
        "think",
        "proposition",
        "expressed",
        "invariant",
        "truthvalue",
        "depends",
        "feature",
        "subject",
        "vary",
        "important",
        "subject",
        "belief",
        "question",
        "true",
        "roughly",
        "version",
        "subjectsensitive",
        "invariantism",
        "sentence",
        "form",
        "justified",
        "believing",
        "p",
        "invariantly",
        "express",
        "proposition",
        "entail",
        "justification",
        "believing",
        "p",
        "least",
        "high",
        "enough",
        "rational",
        "acting",
        "p",
        "true",
        "notice",
        "whether",
        "rational",
        "act",
        "p",
        "traditionally",
        "thought",
        "depend",
        "two",
        "thing",
        "degree",
        "justification",
        "believing",
        "p",
        "perhaps",
        "commonly",
        "context",
        "decision",
        "theory",
        "degree",
        "belief",
        "credence",
        "justified",
        "assigning",
        "p",
        "preference",
        "thus",
        "sensitive",
        "preference",
        "respect",
        "whether",
        "p",
        "true",
        "justified",
        "believing",
        "p",
        "must",
        "proposition",
        "justified",
        "tout",
        "court",
        "believing",
        "p",
        "true",
        "instance",
        "nothing",
        "much",
        "hang",
        "whether",
        "orange",
        "juice",
        "house",
        "faint",
        "memory",
        "seen",
        "fridge",
        "might",
        "enough",
        "true",
        "justified",
        "believing",
        "orange",
        "juice",
        "house",
        "hand",
        "diabetic",
        "need",
        "ingest",
        "sugar",
        "quickly",
        "faint",
        "memory",
        "might",
        "enough",
        "proposition",
        "true",
        "notice",
        "difference",
        "contextualism",
        "subjectsensitive",
        "invariantism",
        "contextualist",
        "might",
        "say",
        "sentence",
        "justified",
        "believing",
        "orange",
        "juice",
        "house",
        "express",
        "two",
        "different",
        "proposition",
        "one",
        "true",
        "false",
        "depending",
        "whether",
        "conversational",
        "context",
        "includes",
        "information",
        "diabetic",
        "need",
        "ingest",
        "sugar",
        "subjectsensitive",
        "invariantist",
        "hand",
        "hold",
        "sentence",
        "question",
        "always",
        "express",
        "proposition",
        "proposition",
        "true",
        "first",
        "case",
        "false",
        "second",
        "subjectsensitive",
        "invariantism",
        "subject",
        "number",
        "criticism",
        "see",
        "mcgrath",
        "derose",
        "cohen",
        "comesaña",
        "anderson",
        "hawthorne",
        "a",
        "b",
        "general",
        "approach",
        "also",
        "ably",
        "defended",
        "see",
        "previously",
        "cited",
        "work",
        "fantl",
        "mcgrath",
        "nevertheless",
        "issue",
        "arose",
        "respect",
        "contextualism",
        "seems",
        "arise",
        "subjectsensitive",
        "invariantist",
        "need",
        "independent",
        "argument",
        "effect",
        "justified",
        "least",
        "minimal",
        "degree",
        "believing",
        "negation",
        "skeptical",
        "hypothesis",
        "otherwise",
        "trademark",
        "claim",
        "proposition",
        "attributing",
        "u",
        "justification",
        "believing",
        "claim",
        "true",
        "unjustified"
    ]
}