{
    "main_text": "The Central Questions\n1. The Central Questions\n\nThe core concepts of ancient skepticism are belief, suspension of\njudgment, criterion of truth, appearances, and investigation.\nImportant notions of modern skepticism such as knowledge, certainty,\njustified belief, and doubt play no or almost no role. This is not to\nsay that the ancients would not engage with questions that figure in\ntoday’s philosophical discussions. Ancient debates address\nquestions that today we associate with epistemology and philosophy of\nlanguage, as well as with theory of action, rather than specifically\nwith the contemporary topic of skepticism. They focus on the nature of\nbelief, the relationship of belief to speech and action, and the\nmental states of inquiry (on the role of ancient skepticism throughout\nthe history of Western philosophy up to today, cf. Lagerlund 2020; on\nthe relation between ancient skepticism and philosophical debates\ntoday, cf. Machuca and Reed 2018, Vlasits and Vogt 2020, and Machuca\n2022).\n\nFrom the point of view of the ancient skeptics, assertions are\nexpressions of dogmatism. And yet, the best-known ancient skeptic,\nSextus Empiricus, wrote extensively. Can the skeptics say anything\nmeaningful about their philosophy without asserting anything about how\nthings are (Bett 2013, 2019)? Skeptical writings have a peculiar\nformat, one that comes with its own challenges: the skeptics aim to\ndescribe their philosophy tout court, as they practice it,\nwithout laying out any particular theories or doctrines. Skeptical\nideas have been charged with a family of objections: they might be\nself-refuting, inconsistent, self-contradictory, and so on (Castagnoli\n2010). Another line of objection is associated with Hume, namely that\n“nature is always too strong for principle.” As Hume puts\nit, “a Pyrrhonian cannot expect that his philosophy will have\nany constant influence on the mind” (part 2 of section 12,\n“Of the Academical or Sceptical Philosophy,” An\nEnquiry Concerning Human Understanding, London, 1748). It is one\nthing for skepticism to be coherent. It is another thing for it to be\nlikely that anyone, no matter how much they rehearse skeptical\narguments in their mind, will succeed in adhering to it (Johnson\n2001), as ancient Pyrrhonist philosophers claimed to be able to\ndo.\n\nLike later epistemologists, the ancient skeptics start from questions\nabout knowledge. But discussion quickly turns to beliefs (Fine 2000).\nThe Greek term translated here as belief, doxa, can also be\ntranslated as opinion. The root of doxa is dokein,\nseeming. In a belief, something seems so-and-so to someone. But there\nis also an element of judgment or acceptance. The relevant verb,\ndoxazein, often means ‘to judge that something is\nso-and-so.’ Hellenistic discussions envisage three attitudes\nthat cognizers take to impressions (how things seem to them): assent,\nrejection, and suspension of judgment (epochê).\n\nSuspension is a core element of skepticism: the skeptic suspends\njudgment. However, if this means that the skeptic forms no beliefs\nwhatsoever, then skepticism may be a kind of cognitive suicide.\nArguably, belief-formation is a basic feature of human cognitive\nactivity. It is not clear whether one can lead an ordinary human life\nwithout belief, or indeed, ancient opponents of the skeptics say,\nwhether one can even survive. Perhaps even the simplest actions, such\nas eating or leaving a room without running into a wall, involve\nbeliefs (Annas-Barnes 1985, 7; Burnyeat 1980). It is also hard to say\nwhether someone who succeeded in not forming any beliefs could\ncommunicate with others, whether they could engage in philosophical\ninvestigation, or whether they could even think at all.\n\nThe ancient skeptics are well aware of these objections. The most\nwidely discussed charge is that they cannot act without belief\n(Apraxia Charge). In response, the skeptics describe their actions\nvariously as guided by the plausible, the convincing, or by\nappearances. The notion of appearances gains great importance in\nPyrrhonian skepticism, and poses difficult interpretive questions\n(Barney 1992). When something appears so-and-so to someone, does this\nfor the skeptics involve some kind of judgment on their part? Or do\nthey have in mind a purely phenomenal kind of appearing? The skeptical\nproposals (that the skeptic adheres to the plausible, the convincing,\nor to appearances) have in common their appeal to something less than\nfull-fledged belief about how things are, while allowing something\nsufficient to generate and guide action.\n\nHowever, the claim that ancient skepticism is about belief, while\nmodern skepticism is about knowledge, needs to be qualified. Ancient\nskepticism is not alone in being concerned with belief. Descartes\nspeaks repeatedly of demolishing his opinions (for example,\nMed 2:12, AT 7:18; cf. Broughton, 2002,\n33–61). Contemporary epistemology often pays equal attention to\nthe notions of both belief and knowledge. The distinctive focus\nof ancient skepticism on belief becomes clearer once we consider a\nthird concept that figures centrally in ancient discussions: the criterion\nof truth. The skeptics and their opponents discuss how one\nrecognizes a true impression as true. Are there some evident things\n(some kind of impressions), which can be used as standards or\ncriteria, so that nothing is to be accepted as true if it is not in\nagreement with these evident things? The Stoics and Epicureans\nformulate theories that conceive of such criteria. The skeptics\nrespond critically to their proposals. Accordingly, the conception of\na criterion of truth assumes as central a role in ancient debates as\ndoes the notion of knowledge in modern discussions. This debate\nincludes in-depth analysis of sense perception and its relation to\nbelief. According to Epicurus, all sense perceptions are true, but\njudgments based on these perceptions are true or false (Striker 1977,\nVogt 2017). The Stoics explore differences between sense perception,\nillusion, and hallucination (Vasiliou 2019). Their account of the\ncriterion of truth starts from perceptual impressions that qualify, or\nfail to qualify, as cognitive (Shogry 2018). The Stoics propose that\nwe should accept only cognitive impressions, and accordingly we should\nonly form beliefs based on a subset of true perceptual\nimpressions.\n\nDiscussion of the criterion of truth arguably also covers some of the\nground that is later discussed in terms of certainty. The Stoics say\nthat a particular kind of impression is the criterion of truth: the\ncognitive impression. Cognitive impressions make it clear through\nthemselves that they reveal things precisely as they are. This notion\nis an ancestor to the later conception of clear and distinct\nimpressions, and thus, to discussions of certainty.\n\nConsider next the notion of doubt. Doubt is often considered the\nhallmark of skepticism. So how can it be that ancient skepticism is\nnot about doubt (Corti 2010, Vogt 2014a)? Insofar as ‘to\ndoubt’ means no more than ‘to call into question,’\nthe ancient skeptics might be described as doubting things. However,\nskeptical investigation as Sextus Empiricus describes it does not\ninvolve doubt (I shall focus here on Pyrrhonism; on Cicero’s use\nof dubitari, see Section 3.3). Skeptics find themselves\nstruck by the discrepancies among impressions. This experience is\ndescribed as turmoil (Machuca 2019). They aim to resolve this\ndisturbance by settling what is true and what is false among them. But\ninvestigation leads them to suspension of judgment, which brings its\nown peace of mind (Outlines of Skepticism [= PH]\n1.25–30). Where in this account should we locate doubt? Is the\ninitial turmoil the ancient skeptic experiences a kind of doubt? Are\nthe ancient skeptic’s investigations a kind of doubting? Should\nwe describe suspension of judgment as a kind of doubt? All three\nstages may resemble doubt, at least insofar as the ancient skeptics\nhave not settled on answers to the questions they investigate. But all\nthree stages are also different from doubt as it is conceived in later\nepistemology. The ancient skeptics do not describe themselves as\nmaking an active effort at doubting what ordinarily they would\nbelieve, as some philosophers in the Cartesian tradition have it.\nInstead the ancient skeptics find themselves in turmoil because of\ndiscrepancies in how things strike them. Moreover, the progression\nthat ancient skeptics describe differs from the doubt-belief model\nthat later thinkers tend to employ. The ancient skeptics improve their\npsychological condition by moving from turmoil to suspension of\njudgment, not by removing doubt. It seems best, then, to refrain from\ninvoking the modern conception of doubt as at all fundamental in the\nreconstruction of ancient Greek skepticism.\n\nSome of the distinctness of ancient skepticism lies in the fact that\nit is developed by philosophers who genuinely think of themselves as\nskeptics. In later epistemology, skepticism is largely construed from\nthe outside. In particular, early modern skepticism is, for the most\npart, conceived by philosophers who aim to refute it. But ancient\nskepticism is explored by skeptics, and that is, by philosophers who\nintend their lives to be reflective of their philosophy (Cooper 2012\nch. 5.5–7; Bett 2013b). Socrates raises the challenge that it\nmight be truly bad (for one’s life, for the state of one’s\nsoul, and so on) to base one’s actions on unexamined beliefs.\nFor all one knows, these beliefs could be false, and without\ninvestigation, one does not even aim to rid oneself of false belief,\nwhich is admittedly a bad thing for one’s soul. Only an examined\nlife is worth living (Cooper 2007). Once we take this challenge\nseriously, as the ancient skeptics do, we embark on a kind of\ninvestigation that is seen as directly relevant to our lives. Our\nbeliefs are assumed, at this pre-skeptical phase, to be guiding our\nactions. Confidence in unexamined views seems misplaced. Others\nregularly disagree with us. In favor of each view, some arguments\ncan be adduced, some practices invoked, some experiences cited. These\nconflicting arguments, practices and experiences need to be examined.\nBut that just raises further views that are in conflict. As a\nconsequence, suspension of judgment on every such question looks\nrationally mandatory. But it is also rational to persist in\ninvestigation. The skeptic is committed to a search for the truth, on\nvirtually all questions, even if this search repeatedly and\npredictably leads to suspension of judgment (Cooper 2012).\n",
    "section_title": "1. The Central Questions",
    "entry_title": "Ancient Skepticism",
    "hierarchy_title": "Ancient Skepticism || The Central Questions",
    "tokenized_text": [
        "central",
        "question",
        "central",
        "question",
        "core",
        "concept",
        "ancient",
        "skepticism",
        "belief",
        "suspension",
        "judgment",
        "criterion",
        "truth",
        "appearance",
        "investigation",
        "important",
        "notion",
        "modern",
        "skepticism",
        "knowledge",
        "certainty",
        "justified",
        "belief",
        "doubt",
        "play",
        "almost",
        "role",
        "say",
        "ancient",
        "would",
        "engage",
        "question",
        "figure",
        "today",
        "philosophical",
        "discussion",
        "ancient",
        "debate",
        "address",
        "question",
        "today",
        "associate",
        "epistemology",
        "philosophy",
        "language",
        "well",
        "theory",
        "action",
        "rather",
        "specifically",
        "contemporary",
        "topic",
        "skepticism",
        "focus",
        "nature",
        "belief",
        "relationship",
        "belief",
        "speech",
        "action",
        "mental",
        "state",
        "inquiry",
        "role",
        "ancient",
        "skepticism",
        "throughout",
        "history",
        "western",
        "philosophy",
        "today",
        "cf",
        "lagerlund",
        "relation",
        "ancient",
        "skepticism",
        "philosophical",
        "debate",
        "today",
        "cf",
        "machuca",
        "reed",
        "vlasits",
        "vogt",
        "machuca",
        "point",
        "view",
        "ancient",
        "skeptic",
        "assertion",
        "expression",
        "dogmatism",
        "yet",
        "bestknown",
        "ancient",
        "skeptic",
        "sextus",
        "empiricus",
        "wrote",
        "extensively",
        "skeptic",
        "say",
        "anything",
        "meaningful",
        "philosophy",
        "without",
        "asserting",
        "anything",
        "thing",
        "bett",
        "skeptical",
        "writing",
        "peculiar",
        "format",
        "one",
        "come",
        "challenge",
        "skeptic",
        "aim",
        "describe",
        "philosophy",
        "tout",
        "court",
        "practice",
        "without",
        "laying",
        "particular",
        "theory",
        "doctrine",
        "skeptical",
        "idea",
        "charged",
        "family",
        "objection",
        "might",
        "selfrefuting",
        "inconsistent",
        "selfcontradictory",
        "castagnoli",
        "another",
        "line",
        "objection",
        "associated",
        "hume",
        "namely",
        "nature",
        "always",
        "strong",
        "principle",
        "hume",
        "put",
        "pyrrhonian",
        "expect",
        "philosophy",
        "constant",
        "influence",
        "mind",
        "part",
        "section",
        "academical",
        "sceptical",
        "philosophy",
        "enquiry",
        "concerning",
        "human",
        "understanding",
        "london",
        "one",
        "thing",
        "skepticism",
        "coherent",
        "another",
        "thing",
        "likely",
        "anyone",
        "matter",
        "much",
        "rehearse",
        "skeptical",
        "argument",
        "mind",
        "succeed",
        "adhering",
        "johnson",
        "ancient",
        "pyrrhonist",
        "philosopher",
        "claimed",
        "able",
        "like",
        "later",
        "epistemologist",
        "ancient",
        "skeptic",
        "start",
        "question",
        "knowledge",
        "discussion",
        "quickly",
        "turn",
        "belief",
        "fine",
        "greek",
        "term",
        "translated",
        "belief",
        "doxa",
        "also",
        "translated",
        "opinion",
        "root",
        "doxa",
        "dokein",
        "seeming",
        "belief",
        "something",
        "seems",
        "soandso",
        "someone",
        "also",
        "element",
        "judgment",
        "acceptance",
        "relevant",
        "verb",
        "doxazein",
        "often",
        "mean",
        "judge",
        "something",
        "soandso",
        "hellenistic",
        "discussion",
        "envisage",
        "three",
        "attitude",
        "cognizers",
        "take",
        "impression",
        "thing",
        "seem",
        "assent",
        "rejection",
        "suspension",
        "judgment",
        "epochê",
        "suspension",
        "core",
        "element",
        "skepticism",
        "skeptic",
        "suspends",
        "judgment",
        "however",
        "mean",
        "skeptic",
        "form",
        "belief",
        "whatsoever",
        "skepticism",
        "may",
        "kind",
        "cognitive",
        "suicide",
        "arguably",
        "beliefformation",
        "basic",
        "feature",
        "human",
        "cognitive",
        "activity",
        "clear",
        "whether",
        "one",
        "lead",
        "ordinary",
        "human",
        "life",
        "without",
        "belief",
        "indeed",
        "ancient",
        "opponent",
        "skeptic",
        "say",
        "whether",
        "one",
        "even",
        "survive",
        "perhaps",
        "even",
        "simplest",
        "action",
        "eating",
        "leaving",
        "room",
        "without",
        "running",
        "wall",
        "involve",
        "belief",
        "annasbarnes",
        "burnyeat",
        "also",
        "hard",
        "say",
        "whether",
        "someone",
        "succeeded",
        "forming",
        "belief",
        "could",
        "communicate",
        "others",
        "whether",
        "could",
        "engage",
        "philosophical",
        "investigation",
        "whether",
        "could",
        "even",
        "think",
        "ancient",
        "skeptic",
        "well",
        "aware",
        "objection",
        "widely",
        "discussed",
        "charge",
        "act",
        "without",
        "belief",
        "apraxia",
        "charge",
        "response",
        "skeptic",
        "describe",
        "action",
        "variously",
        "guided",
        "plausible",
        "convincing",
        "appearance",
        "notion",
        "appearance",
        "gain",
        "great",
        "importance",
        "pyrrhonian",
        "skepticism",
        "pose",
        "difficult",
        "interpretive",
        "question",
        "barney",
        "something",
        "appears",
        "soandso",
        "someone",
        "skeptic",
        "involve",
        "kind",
        "judgment",
        "part",
        "mind",
        "purely",
        "phenomenal",
        "kind",
        "appearing",
        "skeptical",
        "proposal",
        "skeptic",
        "adheres",
        "plausible",
        "convincing",
        "appearance",
        "common",
        "appeal",
        "something",
        "le",
        "fullfledged",
        "belief",
        "thing",
        "allowing",
        "something",
        "sufficient",
        "generate",
        "guide",
        "action",
        "however",
        "claim",
        "ancient",
        "skepticism",
        "belief",
        "modern",
        "skepticism",
        "knowledge",
        "need",
        "qualified",
        "ancient",
        "skepticism",
        "alone",
        "concerned",
        "belief",
        "descartes",
        "speaks",
        "repeatedly",
        "demolishing",
        "opinion",
        "example",
        "med",
        "cf",
        "broughton",
        "contemporary",
        "epistemology",
        "often",
        "pay",
        "equal",
        "attention",
        "notion",
        "belief",
        "knowledge",
        "distinctive",
        "focus",
        "ancient",
        "skepticism",
        "belief",
        "becomes",
        "clearer",
        "consider",
        "third",
        "concept",
        "figure",
        "centrally",
        "ancient",
        "discussion",
        "criterion",
        "truth",
        "skeptic",
        "opponent",
        "discus",
        "one",
        "recognizes",
        "true",
        "impression",
        "true",
        "evident",
        "thing",
        "kind",
        "impression",
        "used",
        "standard",
        "criterion",
        "nothing",
        "accepted",
        "true",
        "agreement",
        "evident",
        "thing",
        "stoic",
        "epicurean",
        "formulate",
        "theory",
        "conceive",
        "criterion",
        "skeptic",
        "respond",
        "critically",
        "proposal",
        "accordingly",
        "conception",
        "criterion",
        "truth",
        "assumes",
        "central",
        "role",
        "ancient",
        "debate",
        "notion",
        "knowledge",
        "modern",
        "discussion",
        "debate",
        "includes",
        "indepth",
        "analysis",
        "sense",
        "perception",
        "relation",
        "belief",
        "according",
        "epicurus",
        "sense",
        "perception",
        "true",
        "judgment",
        "based",
        "perception",
        "true",
        "false",
        "striker",
        "vogt",
        "stoic",
        "explore",
        "difference",
        "sense",
        "perception",
        "illusion",
        "hallucination",
        "vasiliou",
        "account",
        "criterion",
        "truth",
        "start",
        "perceptual",
        "impression",
        "qualify",
        "fail",
        "qualify",
        "cognitive",
        "shogry",
        "stoic",
        "propose",
        "accept",
        "cognitive",
        "impression",
        "accordingly",
        "form",
        "belief",
        "based",
        "subset",
        "true",
        "perceptual",
        "impression",
        "discussion",
        "criterion",
        "truth",
        "arguably",
        "also",
        "cover",
        "ground",
        "later",
        "discussed",
        "term",
        "certainty",
        "stoic",
        "say",
        "particular",
        "kind",
        "impression",
        "criterion",
        "truth",
        "cognitive",
        "impression",
        "cognitive",
        "impression",
        "make",
        "clear",
        "reveal",
        "thing",
        "precisely",
        "notion",
        "ancestor",
        "later",
        "conception",
        "clear",
        "distinct",
        "impression",
        "thus",
        "discussion",
        "certainty",
        "consider",
        "next",
        "notion",
        "doubt",
        "doubt",
        "often",
        "considered",
        "hallmark",
        "skepticism",
        "ancient",
        "skepticism",
        "doubt",
        "corti",
        "vogt",
        "a",
        "insofar",
        "doubt",
        "mean",
        "call",
        "question",
        "ancient",
        "skeptic",
        "might",
        "described",
        "doubting",
        "thing",
        "however",
        "skeptical",
        "investigation",
        "sextus",
        "empiricus",
        "describes",
        "involve",
        "doubt",
        "shall",
        "focus",
        "pyrrhonism",
        "cicero",
        "use",
        "dubitari",
        "see",
        "section",
        "skeptic",
        "find",
        "struck",
        "discrepancy",
        "among",
        "impression",
        "experience",
        "described",
        "turmoil",
        "machuca",
        "aim",
        "resolve",
        "disturbance",
        "settling",
        "true",
        "false",
        "among",
        "investigation",
        "lead",
        "suspension",
        "judgment",
        "brings",
        "peace",
        "mind",
        "outline",
        "skepticism",
        "ph",
        "account",
        "locate",
        "doubt",
        "initial",
        "turmoil",
        "ancient",
        "skeptic",
        "experience",
        "kind",
        "doubt",
        "ancient",
        "skeptic",
        "investigation",
        "kind",
        "doubting",
        "describe",
        "suspension",
        "judgment",
        "kind",
        "doubt",
        "three",
        "stage",
        "may",
        "resemble",
        "doubt",
        "least",
        "insofar",
        "ancient",
        "skeptic",
        "settled",
        "answer",
        "question",
        "investigate",
        "three",
        "stage",
        "also",
        "different",
        "doubt",
        "conceived",
        "later",
        "epistemology",
        "ancient",
        "skeptic",
        "describe",
        "making",
        "active",
        "effort",
        "doubting",
        "ordinarily",
        "would",
        "believe",
        "philosopher",
        "cartesian",
        "tradition",
        "instead",
        "ancient",
        "skeptic",
        "find",
        "turmoil",
        "discrepancy",
        "thing",
        "strike",
        "moreover",
        "progression",
        "ancient",
        "skeptic",
        "describe",
        "differs",
        "doubtbelief",
        "model",
        "later",
        "thinker",
        "tend",
        "employ",
        "ancient",
        "skeptic",
        "improve",
        "psychological",
        "condition",
        "moving",
        "turmoil",
        "suspension",
        "judgment",
        "removing",
        "doubt",
        "seems",
        "best",
        "refrain",
        "invoking",
        "modern",
        "conception",
        "doubt",
        "fundamental",
        "reconstruction",
        "ancient",
        "greek",
        "skepticism",
        "distinctness",
        "ancient",
        "skepticism",
        "lie",
        "fact",
        "developed",
        "philosopher",
        "genuinely",
        "think",
        "skeptic",
        "later",
        "epistemology",
        "skepticism",
        "largely",
        "construed",
        "outside",
        "particular",
        "early",
        "modern",
        "skepticism",
        "part",
        "conceived",
        "philosopher",
        "aim",
        "refute",
        "ancient",
        "skepticism",
        "explored",
        "skeptic",
        "philosopher",
        "intend",
        "life",
        "reflective",
        "philosophy",
        "cooper",
        "ch",
        "bett",
        "b",
        "socrates",
        "raise",
        "challenge",
        "might",
        "truly",
        "bad",
        "one",
        "life",
        "state",
        "one",
        "soul",
        "base",
        "one",
        "action",
        "unexamined",
        "belief",
        "one",
        "know",
        "belief",
        "could",
        "false",
        "without",
        "investigation",
        "one",
        "even",
        "aim",
        "rid",
        "oneself",
        "false",
        "belief",
        "admittedly",
        "bad",
        "thing",
        "one",
        "soul",
        "examined",
        "life",
        "worth",
        "living",
        "cooper",
        "take",
        "challenge",
        "seriously",
        "ancient",
        "skeptic",
        "embark",
        "kind",
        "investigation",
        "seen",
        "directly",
        "relevant",
        "life",
        "belief",
        "assumed",
        "preskeptical",
        "phase",
        "guiding",
        "action",
        "confidence",
        "unexamined",
        "view",
        "seems",
        "misplaced",
        "others",
        "regularly",
        "disagree",
        "u",
        "favor",
        "view",
        "argument",
        "adduced",
        "practice",
        "invoked",
        "experience",
        "cited",
        "conflicting",
        "argument",
        "practice",
        "experience",
        "need",
        "examined",
        "raise",
        "view",
        "conflict",
        "consequence",
        "suspension",
        "judgment",
        "every",
        "question",
        "look",
        "rationally",
        "mandatory",
        "also",
        "rational",
        "persist",
        "investigation",
        "skeptic",
        "committed",
        "search",
        "truth",
        "virtually",
        "question",
        "even",
        "search",
        "repeatedly",
        "predictably",
        "lead",
        "suspension",
        "judgment",
        "cooper"
    ]
}