{
    "main_text": "Pyrrhonian Skepticism || Rejecting Premise 2: Foundationalism\n5.1 Rejecting Premise 2: Foundationalism\n\nFoundationalists claim that there are basic justified\nbeliefs—beliefs that are justified but not in virtue of their\nrelations to other beliefs. In fact, according to foundationalism, all\njustified beliefs are either basic beliefs or are justified (at least\nin part) in virtue of being inferentially related to a justified\nbelief (or to some justified beliefs). This is where foundationalism\ngets its name: the edifice of justified beliefs has its foundation in\nbasic beliefs.\n\nBut how do foundationalists respond to the mode of hypothesis? If a\nbelief is not justified by another belief, then isn’t it just a\nblind assertion? If basic beliefs are justified but not by other\nbeliefs, then how are they justified? What else besides\nbeliefs is there that can justify beliefs?\n\nTo this last question, many foundationalists reply: experience (we are\ntalking here about empirical knowledge; a priori knowledge\nraises interesting problems of its own, and it is of course also\nsubject to Agrippa’s trilemma). To a rough first approximation\nthat glosses over many important philosophical issues, experiences are\nmental states that, like beliefs, aim to represent the world as it is,\nand, like beliefs too, can fail in achieving that aim—that is,\nexperiences can misrepresent. Nevertheless, experiences are not to be\nidentified with beliefs, for it is possible to have an experience as\nof, e.g., facing two lines that differ in length without having the\nbelief that one is facing two lines that differ in length—a\ncombination of mental states that anyone familiar with the\nMüller-Lyer illusion will recognize.\n\nThere are three important questions that any foundationalist has to\nanswer. First, what kinds of beliefs do experiences justify? Second,\nhow must inferentially acquired beliefs be related to basic beliefs in\norder for them to be justified? Third, in virtue of what do\nexperiences justify beliefs?\n\nWith respect to the first question, we can distinguish between\ntraditional foundationalism and moderate foundationalism. Traditional\nfoundationalists think that basic beliefs are beliefs about\nexperiences, whereas moderate foundationalists think that experience\ncan justify beliefs about the external world. Take, for example, the\nexperience that you typically have when looking at a tomato under good\nperceptual conditions—an experience that, remember, can be had\neven if no tomato is actually\n there.[18]\n A moderate foundationalist would say that that experience justifies\nyou in believing that there is a tomato in front of you. The\ntraditional foundationalist, on the other hand, would say that the\nexperience justifies you only in believing that you have an experience\nas of a tomato in front of you. You may well be justified in believing\nthat there is a tomato in front of you, but only inferentially.\n\nA traditional argument in favor of traditional foundationalism relies\non the fact that whereas you can be mistaken regarding whether there\nis a tomato in front of you when you have an experience as of facing a\ntomato, you cannot, in the same situation, be mistaken regarding\nwhether you are undergoing such an experience. From the point of view\nof traditional foundationalism, this fact indicates that the moderate\nfoundationalist is taking an unnecessary epistemic risk—the risk\nof having a foundation composed of false beliefs.\n\nThe moderate foundationalist can reply that the traditional\nfoundationalist must undertake a similar risk. For, while it is true\nthat if one is undergoing a certain experience then one cannot be\nmistaken in thinking that one is undergoing that experience, one can\nstill be mistaken about one’s experiences—for instance,\nperhaps one can believe that one is in pain even if the experience\nthat one is undergoing is actually one of feeling acutely\nuncomfortable. And if it were just as difficult to distinguish between\nthe true and the false in the realm of beliefs about our own\nexperiences as it is in the realm of beliefs about the external world,\nthen we could be wrong about which of our own beliefs are basically\njustified and which are not. If this kind of meta-fallibilism is\naccepted, then why not accept the further kind according to which\nbasic justified beliefs can be false? Of course, the resolution of\nthis dispute depends on whether, as the moderate believes, we can be\nmistaken about our own experiences.\n\nWhat about our second question: how must basic beliefs be related to\ninferentially justified beliefs? Here too there are two different\nkinds of foundationalism: deductivism and non-deductivism. According\nto the deductivist, the only way in which a (possibly one-membered)\nset of basic justified beliefs can justify another belief is by\nlogically entailing that other belief. In other words, there\nhas to be a valid argument at least some of whose premises\nare basic justified\n beliefs[19]\n and whose conclusion is the inferentially justified belief in\nquestion. Given that the argument is valid, the truth of the premises\nguarantees the truth of the conclusion—it is impossible for all\nthe premises to be true while the conclusion is false. Non-deductivism\nallows relations other than logical entailment as possible\njustificatory relations. For instance, many foundationalists will\nclaim that good inductive inferences from basic justified\nbeliefs provide their conclusions with justification—even though\ninductive arguments are not valid, that is, even though it is possible\nfor all the premises of a good inductive argument to be true while its\nconclusion is false. Although these are independent distinctions,\ntraditional foundationalists tend to be deductivists, whereas moderate\nfoundationalists tend to be non-deductivists. Notice that for a\ntraditional, deductivist foundationalist, there cannot be false\njustified beliefs. Many contemporary epistemologists would shy away\nfrom this strong form of infallibilism, and take that consequence to\nbe an argument against the conjunction of traditional foundationalism\nand deductivism.\n\nThe question that is most interesting from the point of view of\nPyrrhonian Skepticism is our third one: what is it about the relation\nbetween an experience and a belief that, according to the\nfoundationalist, allows the former to justify the latter? (Analogous\nquestions apply to non-foundationalist positions too, and the\ndiscussion to follow is not restricted to the specific case of\nfoundationalism.) There are three different proposals about how to\nanswer this question that are the most prominent. Let’s call the\nprinciples that assert that a subject is justified in having a certain\nbelief given that she is undergoing a certain experience,\n“epistemic principles”. Our third question can then be\nstated as follows: what makes epistemic principles true?\n\nThe first proposal, which we shall call “primitivism”,\nclaims that the question cannot have an intelligible answer. There is\nno more basic fact in virtue of which epistemic principles obtain.\nThey describe bedrock facts, not to be explained in terms of anything\nelse, but are instead to be used to explain other facts.\nEpistemological theorizing, according to the primitivist, ends with\nthe discovery of the correct epistemic principles (for views along\nthese lines, see Chisholm 1966 [and also the second and third\neditions: 1977, 1989] and Feldman & Conee 1985).\n\nThe other two positions are non-primitivist. Internalist\nnon-primitivism holds that epistemic principles are true in virtue of\nfacts about ourselves—for instance, one prominent internalist\nview is that which epistemic principles are true for a given subject\nis determined by which epistemic principles that subject would accept\nunder deep reflection (see Foley\n 1993).[20]\nExternalist non-primitivism holds that epistemic principles\nare true in virtue of facts that are not about ourselves—for\ninstance, one prominent externalist view is that certain experiences\nprovide justification for certain beliefs because the obtaining of\nthose experiences is reliably connected to the truth of those beliefs\n(that is, it couldn’t easily happen that those experiences\nobtain without those beliefs being true; see Goldman 1979).\n\nBoth externalists and internalists think that primitivists are\noverlooking real facts, whereas primitivists think that there are\nfewer things in heaven and earth than are dreamt of in non-primitivist\nphilosophy. Within the non-primitivist camp, externalists think that\ninternalists have too subjective a conception of epistemology—to\nsome extent, thinking it so, or being disposed to think it so under\nconditions of deep reflection, makes it so for the internalist.\nInternalists, for their part, are likely to think that externalists\nare no longer engaged in the same project that both skeptics and\ninternalist epistemologists are engaged in, the project of determining\n“from the inside” whether one’s beliefs are\njustified or amount to knowledge, because the obtaining of a relation\nbetween a belief of his and the external world is something that the\nsubject is in no position to ascertain “from the\ninside”.\n",
    "section_title": "5.1 Rejecting Premise 2: Foundationalism",
    "entry_title": "Skepticism",
    "hierarchy_title": "Skepticism || Pyrrhonian Skepticism || Rejecting Premise 2: Foundationalism",
    "tokenized_text": [
        "pyrrhonian",
        "skepticism",
        "rejecting",
        "premise",
        "foundationalism",
        "rejecting",
        "premise",
        "foundationalism",
        "foundationalists",
        "claim",
        "basic",
        "justified",
        "beliefsbeliefs",
        "justified",
        "virtue",
        "relation",
        "belief",
        "fact",
        "according",
        "foundationalism",
        "justified",
        "belief",
        "either",
        "basic",
        "belief",
        "justified",
        "least",
        "part",
        "virtue",
        "inferentially",
        "related",
        "justified",
        "belief",
        "justified",
        "belief",
        "foundationalism",
        "get",
        "name",
        "edifice",
        "justified",
        "belief",
        "foundation",
        "basic",
        "belief",
        "foundationalists",
        "respond",
        "mode",
        "hypothesis",
        "belief",
        "justified",
        "another",
        "belief",
        "blind",
        "assertion",
        "basic",
        "belief",
        "justified",
        "belief",
        "justified",
        "else",
        "besides",
        "belief",
        "justify",
        "belief",
        "last",
        "question",
        "many",
        "foundationalists",
        "reply",
        "experience",
        "talking",
        "empirical",
        "knowledge",
        "priori",
        "knowledge",
        "raise",
        "interesting",
        "problem",
        "course",
        "also",
        "subject",
        "agrippa",
        "trilemma",
        "rough",
        "first",
        "approximation",
        "gloss",
        "many",
        "important",
        "philosophical",
        "issue",
        "experience",
        "mental",
        "state",
        "like",
        "belief",
        "aim",
        "represent",
        "world",
        "like",
        "belief",
        "fail",
        "achieving",
        "aimthat",
        "experience",
        "misrepresent",
        "nevertheless",
        "experience",
        "identified",
        "belief",
        "possible",
        "experience",
        "eg",
        "facing",
        "two",
        "line",
        "differ",
        "length",
        "without",
        "belief",
        "one",
        "facing",
        "two",
        "line",
        "differ",
        "lengtha",
        "combination",
        "mental",
        "state",
        "anyone",
        "familiar",
        "müllerlyer",
        "illusion",
        "recognize",
        "three",
        "important",
        "question",
        "foundationalist",
        "answer",
        "first",
        "kind",
        "belief",
        "experience",
        "justify",
        "second",
        "must",
        "inferentially",
        "acquired",
        "belief",
        "related",
        "basic",
        "belief",
        "order",
        "justified",
        "third",
        "virtue",
        "experience",
        "justify",
        "belief",
        "respect",
        "first",
        "question",
        "distinguish",
        "traditional",
        "foundationalism",
        "moderate",
        "foundationalism",
        "traditional",
        "foundationalists",
        "think",
        "basic",
        "belief",
        "belief",
        "experience",
        "whereas",
        "moderate",
        "foundationalists",
        "think",
        "experience",
        "justify",
        "belief",
        "external",
        "world",
        "take",
        "example",
        "experience",
        "typically",
        "looking",
        "tomato",
        "good",
        "perceptual",
        "conditionsan",
        "experience",
        "remember",
        "even",
        "tomato",
        "actually",
        "moderate",
        "foundationalist",
        "would",
        "say",
        "experience",
        "justifies",
        "believing",
        "tomato",
        "front",
        "traditional",
        "foundationalist",
        "hand",
        "would",
        "say",
        "experience",
        "justifies",
        "believing",
        "experience",
        "tomato",
        "front",
        "may",
        "well",
        "justified",
        "believing",
        "tomato",
        "front",
        "inferentially",
        "traditional",
        "argument",
        "favor",
        "traditional",
        "foundationalism",
        "relies",
        "fact",
        "whereas",
        "mistaken",
        "regarding",
        "whether",
        "tomato",
        "front",
        "experience",
        "facing",
        "tomato",
        "situation",
        "mistaken",
        "regarding",
        "whether",
        "undergoing",
        "experience",
        "point",
        "view",
        "traditional",
        "foundationalism",
        "fact",
        "indicates",
        "moderate",
        "foundationalist",
        "taking",
        "unnecessary",
        "epistemic",
        "riskthe",
        "risk",
        "foundation",
        "composed",
        "false",
        "belief",
        "moderate",
        "foundationalist",
        "reply",
        "traditional",
        "foundationalist",
        "must",
        "undertake",
        "similar",
        "risk",
        "true",
        "one",
        "undergoing",
        "certain",
        "experience",
        "one",
        "mistaken",
        "thinking",
        "one",
        "undergoing",
        "experience",
        "one",
        "still",
        "mistaken",
        "one",
        "experiencesfor",
        "instance",
        "perhaps",
        "one",
        "believe",
        "one",
        "pain",
        "even",
        "experience",
        "one",
        "undergoing",
        "actually",
        "one",
        "feeling",
        "acutely",
        "uncomfortable",
        "difficult",
        "distinguish",
        "true",
        "false",
        "realm",
        "belief",
        "experience",
        "realm",
        "belief",
        "external",
        "world",
        "could",
        "wrong",
        "belief",
        "basically",
        "justified",
        "kind",
        "metafallibilism",
        "accepted",
        "accept",
        "kind",
        "according",
        "basic",
        "justified",
        "belief",
        "false",
        "course",
        "resolution",
        "dispute",
        "depends",
        "whether",
        "moderate",
        "belief",
        "mistaken",
        "experience",
        "second",
        "question",
        "must",
        "basic",
        "belief",
        "related",
        "inferentially",
        "justified",
        "belief",
        "two",
        "different",
        "kind",
        "foundationalism",
        "deductivism",
        "nondeductivism",
        "according",
        "deductivist",
        "way",
        "possibly",
        "onemembered",
        "set",
        "basic",
        "justified",
        "belief",
        "justify",
        "another",
        "belief",
        "logically",
        "entailing",
        "belief",
        "word",
        "valid",
        "argument",
        "least",
        "whose",
        "premise",
        "basic",
        "justified",
        "belief",
        "whose",
        "conclusion",
        "inferentially",
        "justified",
        "belief",
        "question",
        "given",
        "argument",
        "valid",
        "truth",
        "premise",
        "guarantee",
        "truth",
        "conclusionit",
        "impossible",
        "premise",
        "true",
        "conclusion",
        "false",
        "nondeductivism",
        "allows",
        "relation",
        "logical",
        "entailment",
        "possible",
        "justificatory",
        "relation",
        "instance",
        "many",
        "foundationalists",
        "claim",
        "good",
        "inductive",
        "inference",
        "basic",
        "justified",
        "belief",
        "provide",
        "conclusion",
        "justificationeven",
        "though",
        "inductive",
        "argument",
        "valid",
        "even",
        "though",
        "possible",
        "premise",
        "good",
        "inductive",
        "argument",
        "true",
        "conclusion",
        "false",
        "although",
        "independent",
        "distinction",
        "traditional",
        "foundationalists",
        "tend",
        "deductivists",
        "whereas",
        "moderate",
        "foundationalists",
        "tend",
        "nondeductivists",
        "notice",
        "traditional",
        "deductivist",
        "foundationalist",
        "false",
        "justified",
        "belief",
        "many",
        "contemporary",
        "epistemologist",
        "would",
        "shy",
        "away",
        "strong",
        "form",
        "infallibilism",
        "take",
        "consequence",
        "argument",
        "conjunction",
        "traditional",
        "foundationalism",
        "deductivism",
        "question",
        "interesting",
        "point",
        "view",
        "pyrrhonian",
        "skepticism",
        "third",
        "one",
        "relation",
        "experience",
        "belief",
        "according",
        "foundationalist",
        "allows",
        "former",
        "justify",
        "latter",
        "analogous",
        "question",
        "apply",
        "nonfoundationalist",
        "position",
        "discussion",
        "follow",
        "restricted",
        "specific",
        "case",
        "foundationalism",
        "three",
        "different",
        "proposal",
        "answer",
        "question",
        "prominent",
        "let",
        "call",
        "principle",
        "assert",
        "subject",
        "justified",
        "certain",
        "belief",
        "given",
        "undergoing",
        "certain",
        "experience",
        "epistemic",
        "principle",
        "third",
        "question",
        "stated",
        "follows",
        "make",
        "epistemic",
        "principle",
        "true",
        "first",
        "proposal",
        "shall",
        "call",
        "primitivism",
        "claim",
        "question",
        "intelligible",
        "answer",
        "basic",
        "fact",
        "virtue",
        "epistemic",
        "principle",
        "obtain",
        "describe",
        "bedrock",
        "fact",
        "explained",
        "term",
        "anything",
        "else",
        "instead",
        "used",
        "explain",
        "fact",
        "epistemological",
        "theorizing",
        "according",
        "primitivist",
        "end",
        "discovery",
        "correct",
        "epistemic",
        "principle",
        "view",
        "along",
        "line",
        "see",
        "chisholm",
        "also",
        "second",
        "third",
        "edition",
        "feldman",
        "conee",
        "two",
        "position",
        "nonprimitivist",
        "internalist",
        "nonprimitivism",
        "hold",
        "epistemic",
        "principle",
        "true",
        "virtue",
        "fact",
        "ourselvesfor",
        "instance",
        "one",
        "prominent",
        "internalist",
        "view",
        "epistemic",
        "principle",
        "true",
        "given",
        "subject",
        "determined",
        "epistemic",
        "principle",
        "subject",
        "would",
        "accept",
        "deep",
        "reflection",
        "see",
        "foley",
        "externalist",
        "nonprimitivism",
        "hold",
        "epistemic",
        "principle",
        "true",
        "virtue",
        "fact",
        "ourselvesfor",
        "instance",
        "one",
        "prominent",
        "externalist",
        "view",
        "certain",
        "experience",
        "provide",
        "justification",
        "certain",
        "belief",
        "obtaining",
        "experience",
        "reliably",
        "connected",
        "truth",
        "belief",
        "easily",
        "happen",
        "experience",
        "obtain",
        "without",
        "belief",
        "true",
        "see",
        "goldman",
        "externalists",
        "internalists",
        "think",
        "primitivists",
        "overlooking",
        "real",
        "fact",
        "whereas",
        "primitivists",
        "think",
        "fewer",
        "thing",
        "heaven",
        "earth",
        "dreamt",
        "nonprimitivist",
        "philosophy",
        "within",
        "nonprimitivist",
        "camp",
        "externalists",
        "think",
        "internalists",
        "subjective",
        "conception",
        "epistemologyto",
        "extent",
        "thinking",
        "disposed",
        "think",
        "condition",
        "deep",
        "reflection",
        "make",
        "internalist",
        "internalists",
        "part",
        "likely",
        "think",
        "externalists",
        "longer",
        "engaged",
        "project",
        "skeptic",
        "internalist",
        "epistemologist",
        "engaged",
        "project",
        "determining",
        "inside",
        "whether",
        "one",
        "belief",
        "justified",
        "amount",
        "knowledge",
        "obtaining",
        "relation",
        "belief",
        "external",
        "world",
        "something",
        "subject",
        "position",
        "ascertain",
        "inside"
    ]
}