{
    "main_text": "Ancient and Modern Skepticism: Transitions || Skepticism About Induction\n5.2 Skepticism About Induction\n\nContemporary discussions inherit long-standing problems from early\nmodern philosophy. Among them, external world skepticism, skepticism\nabout other minds, and skepticism about induction are particularly\nprominent. In assessing ancient skepticism, we might ask whether the\nancients saw these problems.\n\nAmong the skeptical problems of modern philosophy, skepticism about\ninduction stands out. Its early formulation in Hume does not depend on\nthe idea that our faculties are created by God, who also created the\nworld. Hume takes himself to engage with Pyrrhonian skepticism\n(Ainslie 2003). Induction proceeds from particular observations to a\ngeneral conclusion. Skepticism about induction points out that, no\nmatter how many particulars were observed, the general claim\npronounces also on what has not been observed. In this respect, the\ninference seems unwarranted and so we should suspend judgement on its\neffectiveness. Induction can concern the ascription of properties to\nsome kind of entity as well as causal claims. In the latter, the\nskeptic observes that what regularly precedes a type of event may not\nbe its cause. Perhaps we cannot infer anything from the fact that\ncertain properties or events regularly occur together (Vlasits 2020a;\nfor a related argument in Al-Ghazali, cf. Kukkonen 2009).\n\nRelevant ideas can be traced in various aspects of Sextus’\nphilosophy. First, Sextus sides with anti-rationalist tendencies in\nmedicine. According to these schools, a doctor remembers that, in\nearlier cases, symptom A was alleviated by medication\nB. They do not infer that medication B makes symptom\nA disappear, or that the illness C is the cause of\nsymptom A. Second, the Five Modes do not exclusively target\nproof. They address everything that lends credibility to something\nelse. They may thus also call into question signs that are taken as\nindicative of their causes. Sextus’ skeptic does not accept such\nindicative signs. Third, Sextus discusses the role of so-called\ncommemorative signs in the skeptic’s life (PH\n2.100–102; Allen 2001). For example, a scar is a commemorative\nsign of a wound. Both were co-observed in the past. A skeptic will\nthink of a wound when seeing a scar. But they do not commit to causal\nor explanatory claims. Fourth, Sextus records a set of Causal Modes\n(PH 1.180–86), which are specifically targeted toward\ncausal explanations (Corti 2014; on the relation between the Causal\nModes and Hume cf. Garrett 2020). He does not ascribe the kind of\nrelevance to them that the Ten Modes and the Five Modes have. Indeed,\nhe thinks the Five Modes can do the work of Causal Modes (that is,\ncall into question causal and explanatory theses and theories).\nHowever, the Causal Modes go into great detail on how the skeptic\ninvestigates any kind of causal thesis or theory.\n5.3 Subjectivity and Other Minds\n\nThe distinction between subjectivity and objectivity is central to\nmodern discussions of skepticism. It is not envisaged in ancient\nthought. However, this does not mean that ancient philosophers do not\nreflect on questions relevant to this distinction. Arguably,\nPyrrhonism conceives of the affections of the mind in ways that\nanticipate later thought about subjectivity (Fine 2003a and 2003b).\nSextus describes the skeptic’s states of\n‘being-appeared-to’ as affections of the mind. A skeptic\ncan report these states in their utterances. Illustrating this point,\nSextus uses expressions associated with the Cyrenaics, a Socratic\nschool of thought. These expressions literally mean something like\n‘I am being heated’ or ‘I am being whitened.’\nThey aim to record affections without claiming anything about the\nworld. Fine argues that the skeptic’s beliefs are beliefs about\nthese affections (2000). With this proposal, Fine turns against two\nprominent positions in scholarly debate about skeptical belief (see\nsection 4.4), that skeptics have no beliefs whatsoever, and that they\nhave beliefs that fall short of holding true. Fine envisages\nreflective beliefs: beliefs about one’s states of mind (on\nrelated issues in contemporary epistemology, cf. Feeney and\nSchellenberg 2020 and Glüer 2020).\n\nWhether or not Sextus’ account of the skeptic’s mental\nlife includes reflective beliefs about one’s mental states, we\nshould note an important difference to later proposals of that kind.\nLater philosophers focus on the particular kind of certainty attached\nto reflective knowledge. Reflective knowledge is sometimes seen as a\nstepping-stone towards greater confidence in our cognitive powers, and\nour ability to also attain other kinds of knowledge. But it may not be\nobvious that reflective knowledge can take on this important role. In\nthis respect, Augustine is still closer to ancient than to modern\nintuitions. He says that such pieces of knowledge as “I know\nthat I think” are not what we are looking for. Augustine\nenvisages that reflective knowledge-claims can be iterated, so that we\nwould have infinitely many pieces of knowledge (“I know that I\nknow that I think…”). But from his point of view, this\nkind of knowledge leads nowhere. When we ask whether we can have\nknowledge, we are interested in knowledge of the world and of God\n(De Trinitate 15.12).\n\nModern philosophers also pay great attention to the privileged access\ncognizers have to their own cognitive activities. Augustine introduces\na distinction that paves the way for this idea. He argues that the\nmind cannot know what kind of stuff it is (De Trinitate 10.10\nand 15.12). The mind does not know its substance, but it knows its\nactivities. For Augustine, this means that the mind knows itself. The\nmind is precisely what it knows itself to be: in knowing that one\nthinks, judges, lives, and so on, one knows the mind (Vogt 2014a).\nNote that this argument indicates that knowing that one lives and is\nare not pieces of knowledge about one’s bodily existence, but\nabout the activities of the mind.\n\nFinally, modern philosophers conceive of the special kind of access to\none’s own mind not only in contrast with our access to the\nworld. They also compare it to our access to what goes on in other\nminds. One of their core problems is skepticism about other minds. If\nour own minds are accessible to us in the way nothing else is, then we\nmight not be able to ascribe mental states to others. For example, we\nmight not know that someone who looks as if she is in pain really is\nin pain. The ancient skeptics envisage nothing of this kind (Warren\n2011). This suggests that, insofar as they draw a distinction between\naffections of the mind and the world, this distinction is construed\ndifferently than in modern skepticism.\n5.4 External World Skepticism\n\nIn its early modern versions, external world skepticism involves the\nidea that there is a creator—someone who made the world and our\nfaculties, and the fit or misfit between them. If this assumption is\ncrucial to external world skepticism, then the ancients do not\nconceive of this skeptical problem. From the point of view of modern\nphilosophy, ancient skepticism may appear limited by not addressing\nsome of the most radical skeptical scenarios (Burnyeat 1980 [1997] and\n1982; Williams 1988; Fine 2003a and 2003b). From the point of view of\nancient skepticism, early modern skepticism and the long life that its\nproblems enjoy, however, would seem to originate in a flawed\ntheology.\n\nContemporary philosophers sometimes discuss external world skepticism\nin terms of a paradox: one thinker finds herself torn between the\nstrength of skeptical arguments and her ordinary convictions. For\nexample, she thinks that this is her hand. But she concedes\nthat the skeptical hypothesis that a mad scientist might have set\nthings up so that she has such perceptions and thoughts (the so-called\nbrain in a vat scenario) is hard to refute. This way of framing\ndiscussions of skepticism is foreign to antiquity. In antiquity,\nskeptics and their opponents are different thinkers, each of them with\none set of intuitions, arguing against each other. It is also foreign\nto ancient skepticism insofar as it inherits the early modern idea\nthat some greatly powerful agent sets things up, and in a sense\ncreates the thinker’s faculties and the world as it appears to\nthem.\n\nHowever, the ancient skeptics might conceive of their own kind of\nexternal world skepticism. One way to explore this question is to turn\nto the way in which Sextus describes that which is outside of the\nskeptic’s mind (Fine 2003 and 2003(2)). Throughout his work,\nSextus employs the distinction between appearances and what really is\nthe case. Consider some of the detail of how he characterizes the\nlatter. One phrase in the Ten Modes is “ta ektos\nhupokeimena,” the externally underlying things\n(PH 1.61, 127, 128, 134, 144). Other phrases, meant to\ndemarcate roughly the same contrast with appearances, are how things\nare in their nature (phusei) (PH 1.78, 123, 140),\n“the underlying things” (hupokeimena)\n(PH 1.106), as well as a combination: “the nature of\nthe underlying external things” (PH 1.117, 163). The\nexpressions which contain the word “external” might read\nas if Sextus was talking about the external world in a sense familiar\nto us from early modern skepticism.\n\nBut what are the underlying or external objects, as Sextus conceives\nof them? For example, Sextus speaks of the underlying reality of\nwhether honey really is sweet (PH 1.19). In such a case, it\nis assumed that there are ordinary objects. But we do not have access\nto the properties they really have (Fine calls this Property\nSkepticism, 2003b). However, external objects in Sextus’ sense\nalso include objects that later philosophers would not obviously see\nas part of the external word. For example, an answer to the question\nof what kind of life really is good would count as a claim about\nexternal or underlying reality (cf. Pellegrin 2010).\n\nAnother approach to the question of whether Sextus envisages some kind\nof external world skepticism is to turn to his discussions of physics.\nOrdinarily we take ourselves to live in a world in which there are\nbodies, movement, place, time, and so on. But as Sextus argues, we do\nnot have compelling accounts of any of these core conceptions of\nphysics. This leads to suspension of judgment on whether there are\nbodies, movement, place, time, and so on. Sextus’ discussions of\nphysics might add up to a rather far-reaching skepticism about the\nnatural world.",
    "section_title": "5.2 Skepticism About Induction",
    "entry_title": "Ancient Skepticism",
    "hierarchy_title": "Ancient Skepticism || Ancient and Modern Skepticism: Transitions || Skepticism About Induction",
    "tokenized_text": [
        "ancient",
        "modern",
        "skepticism",
        "transition",
        "skepticism",
        "induction",
        "skepticism",
        "induction",
        "contemporary",
        "discussion",
        "inherit",
        "longstanding",
        "problem",
        "early",
        "modern",
        "philosophy",
        "among",
        "external",
        "world",
        "skepticism",
        "skepticism",
        "mind",
        "skepticism",
        "induction",
        "particularly",
        "prominent",
        "assessing",
        "ancient",
        "skepticism",
        "might",
        "ask",
        "whether",
        "ancient",
        "saw",
        "problem",
        "among",
        "skeptical",
        "problem",
        "modern",
        "philosophy",
        "skepticism",
        "induction",
        "stand",
        "early",
        "formulation",
        "hume",
        "depend",
        "idea",
        "faculty",
        "created",
        "god",
        "also",
        "created",
        "world",
        "hume",
        "take",
        "engage",
        "pyrrhonian",
        "skepticism",
        "ainslie",
        "induction",
        "proceeds",
        "particular",
        "observation",
        "general",
        "conclusion",
        "skepticism",
        "induction",
        "point",
        "matter",
        "many",
        "particular",
        "observed",
        "general",
        "claim",
        "pronounces",
        "also",
        "observed",
        "respect",
        "inference",
        "seems",
        "unwarranted",
        "suspend",
        "judgement",
        "effectiveness",
        "induction",
        "concern",
        "ascription",
        "property",
        "kind",
        "entity",
        "well",
        "causal",
        "claim",
        "latter",
        "skeptic",
        "observes",
        "regularly",
        "precedes",
        "type",
        "event",
        "may",
        "cause",
        "perhaps",
        "infer",
        "anything",
        "fact",
        "certain",
        "property",
        "event",
        "regularly",
        "occur",
        "together",
        "vlasits",
        "a",
        "related",
        "argument",
        "alghazali",
        "cf",
        "kukkonen",
        "relevant",
        "idea",
        "traced",
        "various",
        "aspect",
        "sextus",
        "philosophy",
        "first",
        "sextus",
        "side",
        "antirationalist",
        "tendency",
        "medicine",
        "according",
        "school",
        "doctor",
        "remembers",
        "earlier",
        "case",
        "symptom",
        "alleviated",
        "medication",
        "b",
        "infer",
        "medication",
        "b",
        "make",
        "symptom",
        "disappear",
        "illness",
        "c",
        "cause",
        "symptom",
        "a",
        "second",
        "five",
        "mode",
        "exclusively",
        "target",
        "proof",
        "address",
        "everything",
        "lends",
        "credibility",
        "something",
        "else",
        "may",
        "thus",
        "also",
        "call",
        "question",
        "sign",
        "taken",
        "indicative",
        "cause",
        "sextus",
        "skeptic",
        "accept",
        "indicative",
        "sign",
        "third",
        "sextus",
        "discus",
        "role",
        "socalled",
        "commemorative",
        "sign",
        "skeptic",
        "life",
        "ph",
        "allen",
        "example",
        "scar",
        "commemorative",
        "sign",
        "wound",
        "coobserved",
        "past",
        "skeptic",
        "think",
        "wound",
        "seeing",
        "scar",
        "commit",
        "causal",
        "explanatory",
        "claim",
        "fourth",
        "sextus",
        "record",
        "set",
        "causal",
        "mode",
        "ph",
        "specifically",
        "targeted",
        "toward",
        "causal",
        "explanation",
        "corti",
        "relation",
        "causal",
        "mode",
        "hume",
        "cf",
        "garrett",
        "ascribe",
        "kind",
        "relevance",
        "ten",
        "mode",
        "five",
        "mode",
        "indeed",
        "think",
        "five",
        "mode",
        "work",
        "causal",
        "mode",
        "call",
        "question",
        "causal",
        "explanatory",
        "thesis",
        "theory",
        "however",
        "causal",
        "mode",
        "go",
        "great",
        "detail",
        "skeptic",
        "investigates",
        "kind",
        "causal",
        "thesis",
        "theory",
        "subjectivity",
        "mind",
        "distinction",
        "subjectivity",
        "objectivity",
        "central",
        "modern",
        "discussion",
        "skepticism",
        "envisaged",
        "ancient",
        "thought",
        "however",
        "mean",
        "ancient",
        "philosopher",
        "reflect",
        "question",
        "relevant",
        "distinction",
        "arguably",
        "pyrrhonism",
        "conceives",
        "affection",
        "mind",
        "way",
        "anticipate",
        "later",
        "thought",
        "subjectivity",
        "fine",
        "a",
        "b",
        "sextus",
        "describes",
        "skeptic",
        "state",
        "beingappearedto",
        "affection",
        "mind",
        "skeptic",
        "report",
        "state",
        "utterance",
        "illustrating",
        "point",
        "sextus",
        "us",
        "expression",
        "associated",
        "cyrenaics",
        "socratic",
        "school",
        "thought",
        "expression",
        "literally",
        "mean",
        "something",
        "like",
        "heated",
        "whitened",
        "aim",
        "record",
        "affection",
        "without",
        "claiming",
        "anything",
        "world",
        "fine",
        "argues",
        "skeptic",
        "belief",
        "belief",
        "affection",
        "proposal",
        "fine",
        "turn",
        "two",
        "prominent",
        "position",
        "scholarly",
        "debate",
        "skeptical",
        "belief",
        "see",
        "section",
        "skeptic",
        "belief",
        "whatsoever",
        "belief",
        "fall",
        "short",
        "holding",
        "true",
        "fine",
        "envisages",
        "reflective",
        "belief",
        "belief",
        "one",
        "state",
        "mind",
        "related",
        "issue",
        "contemporary",
        "epistemology",
        "cf",
        "feeney",
        "schellenberg",
        "glüer",
        "whether",
        "sextus",
        "account",
        "skeptic",
        "mental",
        "life",
        "includes",
        "reflective",
        "belief",
        "one",
        "mental",
        "state",
        "note",
        "important",
        "difference",
        "later",
        "proposal",
        "kind",
        "later",
        "philosopher",
        "focus",
        "particular",
        "kind",
        "certainty",
        "attached",
        "reflective",
        "knowledge",
        "reflective",
        "knowledge",
        "sometimes",
        "seen",
        "steppingstone",
        "towards",
        "greater",
        "confidence",
        "cognitive",
        "power",
        "ability",
        "also",
        "attain",
        "kind",
        "knowledge",
        "may",
        "obvious",
        "reflective",
        "knowledge",
        "take",
        "important",
        "role",
        "respect",
        "augustine",
        "still",
        "closer",
        "ancient",
        "modern",
        "intuition",
        "say",
        "piece",
        "knowledge",
        "know",
        "think",
        "looking",
        "augustine",
        "envisages",
        "reflective",
        "knowledgeclaims",
        "iterated",
        "would",
        "infinitely",
        "many",
        "piece",
        "knowledge",
        "know",
        "know",
        "think",
        "point",
        "view",
        "kind",
        "knowledge",
        "lead",
        "nowhere",
        "ask",
        "whether",
        "knowledge",
        "interested",
        "knowledge",
        "world",
        "god",
        "de",
        "trinitate",
        "modern",
        "philosopher",
        "also",
        "pay",
        "great",
        "attention",
        "privileged",
        "access",
        "cognizers",
        "cognitive",
        "activity",
        "augustine",
        "introduces",
        "distinction",
        "pave",
        "way",
        "idea",
        "argues",
        "mind",
        "know",
        "kind",
        "stuff",
        "de",
        "trinitate",
        "mind",
        "know",
        "substance",
        "know",
        "activity",
        "augustine",
        "mean",
        "mind",
        "know",
        "mind",
        "precisely",
        "know",
        "knowing",
        "one",
        "think",
        "judge",
        "life",
        "one",
        "know",
        "mind",
        "vogt",
        "a",
        "note",
        "argument",
        "indicates",
        "knowing",
        "one",
        "life",
        "piece",
        "knowledge",
        "one",
        "bodily",
        "existence",
        "activity",
        "mind",
        "finally",
        "modern",
        "philosopher",
        "conceive",
        "special",
        "kind",
        "access",
        "one",
        "mind",
        "contrast",
        "access",
        "world",
        "also",
        "compare",
        "access",
        "go",
        "mind",
        "one",
        "core",
        "problem",
        "skepticism",
        "mind",
        "mind",
        "accessible",
        "u",
        "way",
        "nothing",
        "else",
        "might",
        "able",
        "ascribe",
        "mental",
        "state",
        "others",
        "example",
        "might",
        "know",
        "someone",
        "look",
        "pain",
        "really",
        "pain",
        "ancient",
        "skeptic",
        "envisage",
        "nothing",
        "kind",
        "warren",
        "suggests",
        "insofar",
        "draw",
        "distinction",
        "affection",
        "mind",
        "world",
        "distinction",
        "construed",
        "differently",
        "modern",
        "skepticism",
        "external",
        "world",
        "skepticism",
        "early",
        "modern",
        "version",
        "external",
        "world",
        "skepticism",
        "involves",
        "idea",
        "creatorsomeone",
        "made",
        "world",
        "faculty",
        "fit",
        "misfit",
        "assumption",
        "crucial",
        "external",
        "world",
        "skepticism",
        "ancient",
        "conceive",
        "skeptical",
        "problem",
        "point",
        "view",
        "modern",
        "philosophy",
        "ancient",
        "skepticism",
        "may",
        "appear",
        "limited",
        "addressing",
        "radical",
        "skeptical",
        "scenario",
        "burnyeat",
        "williams",
        "fine",
        "a",
        "b",
        "point",
        "view",
        "ancient",
        "skepticism",
        "early",
        "modern",
        "skepticism",
        "long",
        "life",
        "problem",
        "enjoy",
        "however",
        "would",
        "seem",
        "originate",
        "flawed",
        "theology",
        "contemporary",
        "philosopher",
        "sometimes",
        "discus",
        "external",
        "world",
        "skepticism",
        "term",
        "paradox",
        "one",
        "thinker",
        "find",
        "torn",
        "strength",
        "skeptical",
        "argument",
        "ordinary",
        "conviction",
        "example",
        "think",
        "hand",
        "concedes",
        "skeptical",
        "hypothesis",
        "mad",
        "scientist",
        "might",
        "set",
        "thing",
        "perception",
        "thought",
        "socalled",
        "brain",
        "vat",
        "scenario",
        "hard",
        "refute",
        "way",
        "framing",
        "discussion",
        "skepticism",
        "foreign",
        "antiquity",
        "antiquity",
        "skeptic",
        "opponent",
        "different",
        "thinker",
        "one",
        "set",
        "intuition",
        "arguing",
        "also",
        "foreign",
        "ancient",
        "skepticism",
        "insofar",
        "inherits",
        "early",
        "modern",
        "idea",
        "greatly",
        "powerful",
        "agent",
        "set",
        "thing",
        "sense",
        "creates",
        "thinker",
        "faculty",
        "world",
        "appears",
        "however",
        "ancient",
        "skeptic",
        "might",
        "conceive",
        "kind",
        "external",
        "world",
        "skepticism",
        "one",
        "way",
        "explore",
        "question",
        "turn",
        "way",
        "sextus",
        "describes",
        "outside",
        "skeptic",
        "mind",
        "fine",
        "throughout",
        "work",
        "sextus",
        "employ",
        "distinction",
        "appearance",
        "really",
        "case",
        "consider",
        "detail",
        "characterizes",
        "latter",
        "one",
        "phrase",
        "ten",
        "mode",
        "ta",
        "ektos",
        "hupokeimena",
        "externally",
        "underlying",
        "thing",
        "ph",
        "phrase",
        "meant",
        "demarcate",
        "roughly",
        "contrast",
        "appearance",
        "thing",
        "nature",
        "phusei",
        "ph",
        "underlying",
        "thing",
        "hupokeimena",
        "ph",
        "well",
        "combination",
        "nature",
        "underlying",
        "external",
        "thing",
        "ph",
        "expression",
        "contain",
        "word",
        "external",
        "might",
        "read",
        "sextus",
        "talking",
        "external",
        "world",
        "sense",
        "familiar",
        "u",
        "early",
        "modern",
        "skepticism",
        "underlying",
        "external",
        "object",
        "sextus",
        "conceives",
        "example",
        "sextus",
        "speaks",
        "underlying",
        "reality",
        "whether",
        "honey",
        "really",
        "sweet",
        "ph",
        "case",
        "assumed",
        "ordinary",
        "object",
        "access",
        "property",
        "really",
        "fine",
        "call",
        "property",
        "skepticism",
        "b",
        "however",
        "external",
        "object",
        "sextus",
        "sense",
        "also",
        "include",
        "object",
        "later",
        "philosopher",
        "would",
        "obviously",
        "see",
        "part",
        "external",
        "word",
        "example",
        "answer",
        "question",
        "kind",
        "life",
        "really",
        "good",
        "would",
        "count",
        "claim",
        "external",
        "underlying",
        "reality",
        "cf",
        "pellegrin",
        "another",
        "approach",
        "question",
        "whether",
        "sextus",
        "envisages",
        "kind",
        "external",
        "world",
        "skepticism",
        "turn",
        "discussion",
        "physic",
        "ordinarily",
        "take",
        "live",
        "world",
        "body",
        "movement",
        "place",
        "time",
        "sextus",
        "argues",
        "compelling",
        "account",
        "core",
        "conception",
        "physic",
        "lead",
        "suspension",
        "judgment",
        "whether",
        "body",
        "movement",
        "place",
        "time",
        "sextus",
        "discussion",
        "physic",
        "might",
        "add",
        "rather",
        "farreaching",
        "skepticism",
        "natural",
        "world"
    ]
}