{
    "main_text": "Implications of Moral Responsibility Skepticism || Morality\n3.4 Criminal Punishment\n\nOne last practical concern about moral responsibility skepticism is\nthat it is unable to adequately deal with criminal behavior and that\nthe responses it would permit as justified are insufficient for\nacceptable social policy. This concern is fueled by two factors. The\nfirst is that one of the most prominent justifications for punishing\ncriminals, retributivism, is incompatible with moral\nresponsibility skepticism. The second concern is that alternative\njustifications that are not ruled out by the skeptical view per se\nface independent moral objections. Critics contend that these moral\nobjections are decisive. Skeptics about moral responsibility, on the\nother hand, argue that non-retributive alternatives exist that are\nboth ethically defensible and practically workable (see, e.g.,\nPereboom 2001, 2013b, 2014a; N. Levy 2012, 2015; Caruso 2016; Corrado 2001,\n2013, 2014, 2017,, forthcoming-a,b; Vilhauer 2013a,b; Focquaert,\nGlenn, Raine 2013, forthcoming; Shaw 2011; Murtagh 2013).\n\nWithin the American criminal justice system, the most prominent\njustification for criminal punishment is retributivism. This\nretributivist justification for\n punishment\n maintains that punishment of a wrongdoer is justified for the reason\nthat she deserves something bad to happen to her just because\nshe has knowingly done wrong—this could include pain,\ndeprivation, or death. For the retributivist, it is the basic\ndesert attached to the criminal’s immoral action alone that\nprovides the justification for punishment (see, e.g., Moore 1997;\nBerman 2008, 2013). This means that the retributivist position is not\nreducible to consequentialist considerations nor in justifying\npunishment does it appeal to wider goods such as the safety of society\nor the\n moral\n improvement of those being punished. A number of sentencing\nguidelines in the U.S. have adopted desert as their\ndistributive principle, and it is increasingly given deference in the\n“purposes” section of state criminal codes, where it can\nbe the guiding principle in the interpretation and application of the\ncode’s provisions (see Robinson 2008). Indeed, the American Law\nInstitute recently revised the Model Penal Code so as to set desert as\nthe official dominate principle for sentencing. And\ncourts have identified desert as the guiding principle in a variety of\ncontexts, as with the Supreme Court’s specifying retributivism\nas the “primary justification for the death penalty” (see\nRobinson 2008: 145–146; see also the entries on\n legal punishment and\n retributive justice.)\n\n\nWhile there may be independent reasons for rejecting retributivism,\nreasons that have nothing to do with free will and moral\nresponsibility, it is clear that moral responsibility skepticism is\nincompatible with the retributive justification for punishment since\nit does away with the idea of basic desert. If agents do not\ndeserve blame just because they have knowingly done wrong, neither do\nthey deserve punishment just because they have knowingly done wrong\n(Pereboom 2014a). The challenge facing moral responsibility\nskepticism, then, is to explain how we can adequately deal with\ncriminal behavior without the justification provided by retributivism\nand basic desert moral responsibility. While some critics contend this\ncannot be done, moral responsibility skeptics point out that there are\nseveral alternative ways of justifying criminal punishment (and\ndealing with criminal behavior more generally) that do not appeal to\nthe notion of basic desert and are thus not threatened by the\nskeptical perspective. These include deterrence theories, moral\neducation theories, punishment justified by the right to harm in\nself-defense, and incapacitation theories.\n\nDeterrence theories are typically classified as a subspecies of\nconsequentialist theories of punishment. Consequentialist theories\nattempt to justify punishment as the best means to achieving certain\nindependently identifiable goods (see, e.g., Bentham 1823; J. Wilson\n1983; Walker 1991; see also entry on Legal Punishment). While\ndifferent consequentialist theories explain the final good or goods at\nwhich all our actions aim differently, the most plausible immediate\ngood that a system of punishment can bring about is the reduction of\ncrime. For this reason, consequentialist theories generally suggest\nthat punishment can help to reduce crime by deterring, incapacitating,\nor reforming potential offenders. Deterrence theories, in particular,\nhold that punishment can serve the dual purposes of deterring future\nbad or illegal behavior in the individual (him or herself) who is\npunished, as well as deter others from similar acts (Ellis 2003, 2005;\nHoskins 2011). Such theories are perfectly consistent with moral\nresponsibility skepticism since they are forward-looking and make no\nappeal to notions of just deserts and blameworthiness.\n\nThe most common objection to consequentialist deterrence theories is\nthat they would allow for manifestly unjust punishments. For example,\nexcessively harsh punishment of the guilty or punishment of the\ninnocent could in principle be justified if it were to effectively\nserve the aim of deterrence and crime reduction (see McCloskey 1957;\nHart 1968; Nozick 1974; Ten 1987; Smilansky 1990; Primoratz 1999;\nPereboom 2001, 2014a; Honderich 2006; Boonin 2008; Brooks 2012). This is\nsometimes called the use objection since it holds that\nconsequentialist theories allow, at least in principle, for the\nuse of persons to achieve certain desirable ends, in\nviolation of the Kantian intuition that persons should be treated as\nends-in-themselves. There are, however, a number of common responses\nto this objection. One is to argue that such ‘unjust’\npunishments would be justified if they would really produce\nthe best consequence (e.g., Smart 1973: 69–72; Bagaric &\nAmarasekara 2000; taken from Duff & Hoskins 2017). Another is to\nargue that in the real world it would be extremely unlikely that such\npunishment would ever be for the best, and even less likely that the\nstate could be trusted to reliably pick out those rare cases in which\nthey would be—thus the criminal justice system should adopt the\nview that such punishment is wrong and unjustifiable (see Rawls 1955;\nHare 1981; paraphrased from Duff & Hoskins 2017). Finally, some\nreply that a richer or subtler account of the ends that the criminal\nlaw should serve will generate suitable protections against unjust\npunishments (see Braithwaite & Pettit 1990; Tadros 2011).\n\nAnother approach consistent with skepticism about moral responsibility\nis moral education theories. These theories typically maintain that\npunishment can be justified only if it benefits the person being\npunished. An analogy is sometimes drawn with the justification for\npunishing children—i.e., children are typically not punished to\nexact retribution, but rather to educate them morally. Jean Hampton,\nfor instance, writes, “punishment should not be justified as a\ndeserved evil, but rather as an attempt, by someone who cares, to\nimprove a wayward person” (1984: 237). On Hampton’s moral\neducation account, punishment is justified if and only if it gets the\nwrongdoer \n\n\nto reflect on the moral reasons for [the law’s prohibition] so\nthat he will make the decision to reject the prohibited action for\nmoral reasons, rather than for the self-interested reason of\navoiding pain. (1984: 212) \n\n\nCritics, however, object on number of different grounds. Some point\nout that while moral education may be one plausible aim of\npunishment, it is not the “full and complete\njustification” Hampton (1984: 209) and others claim it to be\n(see Dagger 2011). Others argue that it is far from evident that\npunishing adult criminals is similarly likely to result in moral\nimprovements (Pereboom 2001: 162–3; 2014a: 161). Children and\nadult criminals differ in significant respects—i.e., adult\ncriminals, unlike children, typically understand the moral code\naccepted in their society, and children are generally more\npsychologically malleable than adults criminals are (Pereboom 2014a:\n162; 2001: 163). \n\nWhether or not moral education theories succumb to these objections\n(cf. Drucker 1986; Shook 2004; Shafer-Landau 1991; Dagger 2011), there\nis another non-retributive alternative available to moral\nresponsibility skeptics: an incapacitation account based on the right\nof self-defense analogous to the justification for quarantine. This is\nthe approach favored by Pereboom and Caruso, and it draws on a\ncomparison between treatment of dangerous criminals and treatment of\ncarriers of dangerous diseases (Pereboom 2001, 2013b, 2014a, 2017a;\nCaruso 2016, 2017, forthcoming-a; Pereboom & Caruso\nforthcoming). In its simplest form, it can be summarized as follows:\n(1) Moral responsibility skeptics claims that criminals are not\nmorally responsible for their actions in the basic desert sense; (2)\nplainly, many carriers of dangerous diseases are not responsible in\nthis or in any other sense for having contracted these diseases; (3)\nyet, we generally agree that it is sometimes permissible to quarantine\nthem, and the justification for doing so is the right to\nself-protection and the prevention of harm to others; (4) for similar\nreasons, even if a dangerous criminal is not morally responsible for\nhis crimes in the basic desert sense (perhaps because no one is ever\nin this way morally responsible) it could be as legitimate to\nincapacitate him as to quarantine the non-responsible carrier of a\nserious communicable disease.\n\nThis account differs from the previous ones in two important ways.\nFirst, although one might justify quarantine (in the case of disease)\nand incapacitation (in the case of dangerous criminals) on purely\nutilitarian or consequentialist grounds, Pereboom and Caruso resist\nthis strategy. The incapacitation of dangerous criminals is instead justified on the ground of the right to harm in self defense and defense of others—a right that\narguably has broader appeal than consequentialism. They contend that\nthis justification makes the view more resilient to objections,\nespecially the use-objection mentioned above (Pereboom 2017a). This is because, as it is illegitimate\nto treat carriers of a disease more harmfully than is necessary to\nneutralize the danger they pose, treating those with violent criminal\ntendencies more harshly than is required to protect society will be\nillegitimate as well. Furthermore, innocent people could not be\nincapacitated on this account since they pose no direct threat to\nothers.\n\nSecond, the quarantine model places several constraints on the\ntreatment of criminals (see Pereboom 2001, 2014a). First, as less dangerous diseases justify only\npreventative measures less restrictive than quarantine, so less\ndangerous criminal tendencies justify only more moderate restraints.\nIn fact, for certain minor crimes perhaps only some degree of\nmonitoring could be defended. Secondly, the incapacitation account\nthat results from this analogy demands a degree of concern for the\nrehabilitation and well-being of the criminal that would alter much of\ncurrent practice. Just as fairness recommends that we seek to cure the\ndiseased we quarantine, so fairness would counsel that we attempt to\nrehabilitate the criminals we detain. If a criminal cannot be\nrehabilitated, and our safety requires his indefinite confinement,\nthis account provides no justification for making his life more\nmiserable than would be required to guard against the danger he poses.\nFinally, there are measures for preventing crime more generally, such\nas providing for adequate education and mental health care, which the\nmoral responsibility skeptic can readily endorse. The public\nhealth-quarantine model proposed by Caruso, for instance, extends\nthe quarantine analogy into the arena of public health and attempts to\nprioritize prevention and social justice. It calls for a shift away from\nthe myopic focus on punishment and toward a more holistic approach to\ncriminal behavior aimed at addressing the causal determinants of crime\nand the social injustices that give rise to crime. (For criticisms of\nthe quarantine model, see Corrado 1996; Smilansky 2011, 2017; Lemos\n2016; Tadros 2017).\n\nGiven the various non-retributive options available to moral\nresponsibility skeptics—for additional options see Corrado\n(2001, 2013, 2014, 2017, forthcoming-a,b), Vilhauer (2013a,b), N. Levy\n(2012, 2015)—it would be hasty to conclude that the skeptical\nperspective leaves us unable to adequately deal with criminal\nbehavior. It may even be the case, as many skeptics are apt to\npropose, that rejecting retributivism and basic desert would allow us\nto adopt practices and policies that are more humane and effective.\n\n",
    "section_title": "3.4 Criminal Punishment",
    "entry_title": "Skepticism About Moral Responsibility",
    "hierarchy_title": "Skepticism About Moral Responsibility || Implications of Moral Responsibility Skepticism || Morality",
    "tokenized_text": [
        "implication",
        "moral",
        "responsibility",
        "skepticism",
        "morality",
        "criminal",
        "punishment",
        "one",
        "last",
        "practical",
        "concern",
        "moral",
        "responsibility",
        "skepticism",
        "unable",
        "adequately",
        "deal",
        "criminal",
        "behavior",
        "response",
        "would",
        "permit",
        "justified",
        "insufficient",
        "acceptable",
        "social",
        "policy",
        "concern",
        "fueled",
        "two",
        "factor",
        "first",
        "one",
        "prominent",
        "justification",
        "punishing",
        "criminal",
        "retributivism",
        "incompatible",
        "moral",
        "responsibility",
        "skepticism",
        "second",
        "concern",
        "alternative",
        "justification",
        "ruled",
        "skeptical",
        "view",
        "per",
        "se",
        "face",
        "independent",
        "moral",
        "objection",
        "critic",
        "contend",
        "moral",
        "objection",
        "decisive",
        "skeptic",
        "moral",
        "responsibility",
        "hand",
        "argue",
        "nonretributive",
        "alternative",
        "exist",
        "ethically",
        "defensible",
        "practically",
        "workable",
        "see",
        "eg",
        "pereboom",
        "b",
        "a",
        "n",
        "levy",
        "caruso",
        "corrado",
        "forthcominga",
        "b",
        "vilhauer",
        "a",
        "b",
        "focquaert",
        "glenn",
        "raine",
        "forthcoming",
        "shaw",
        "murtagh",
        "within",
        "american",
        "criminal",
        "justice",
        "system",
        "prominent",
        "justification",
        "criminal",
        "punishment",
        "retributivism",
        "retributivist",
        "justification",
        "punishment",
        "maintains",
        "punishment",
        "wrongdoer",
        "justified",
        "reason",
        "deserves",
        "something",
        "bad",
        "happen",
        "knowingly",
        "done",
        "wrongthis",
        "could",
        "include",
        "pain",
        "deprivation",
        "death",
        "retributivist",
        "basic",
        "desert",
        "attached",
        "criminal",
        "immoral",
        "action",
        "alone",
        "provides",
        "justification",
        "punishment",
        "see",
        "eg",
        "moore",
        "berman",
        "mean",
        "retributivist",
        "position",
        "reducible",
        "consequentialist",
        "consideration",
        "justifying",
        "punishment",
        "appeal",
        "wider",
        "good",
        "safety",
        "society",
        "moral",
        "improvement",
        "punished",
        "number",
        "sentencing",
        "guideline",
        "us",
        "adopted",
        "desert",
        "distributive",
        "principle",
        "increasingly",
        "given",
        "deference",
        "purpose",
        "section",
        "state",
        "criminal",
        "code",
        "guiding",
        "principle",
        "interpretation",
        "application",
        "code",
        "provision",
        "see",
        "robinson",
        "indeed",
        "american",
        "law",
        "institute",
        "recently",
        "revised",
        "model",
        "penal",
        "code",
        "set",
        "desert",
        "official",
        "dominate",
        "principle",
        "sentencing",
        "court",
        "identified",
        "desert",
        "guiding",
        "principle",
        "variety",
        "context",
        "supreme",
        "court",
        "specifying",
        "retributivism",
        "primary",
        "justification",
        "death",
        "penalty",
        "see",
        "robinson",
        "see",
        "also",
        "entry",
        "legal",
        "punishment",
        "retributive",
        "justice",
        "may",
        "independent",
        "reason",
        "rejecting",
        "retributivism",
        "reason",
        "nothing",
        "free",
        "moral",
        "responsibility",
        "clear",
        "moral",
        "responsibility",
        "skepticism",
        "incompatible",
        "retributive",
        "justification",
        "punishment",
        "since",
        "away",
        "idea",
        "basic",
        "desert",
        "agent",
        "deserve",
        "blame",
        "knowingly",
        "done",
        "wrong",
        "neither",
        "deserve",
        "punishment",
        "knowingly",
        "done",
        "wrong",
        "pereboom",
        "a",
        "challenge",
        "facing",
        "moral",
        "responsibility",
        "skepticism",
        "explain",
        "adequately",
        "deal",
        "criminal",
        "behavior",
        "without",
        "justification",
        "provided",
        "retributivism",
        "basic",
        "desert",
        "moral",
        "responsibility",
        "critic",
        "contend",
        "done",
        "moral",
        "responsibility",
        "skeptic",
        "point",
        "several",
        "alternative",
        "way",
        "justifying",
        "criminal",
        "punishment",
        "dealing",
        "criminal",
        "behavior",
        "generally",
        "appeal",
        "notion",
        "basic",
        "desert",
        "thus",
        "threatened",
        "skeptical",
        "perspective",
        "include",
        "deterrence",
        "theory",
        "moral",
        "education",
        "theory",
        "punishment",
        "justified",
        "right",
        "harm",
        "selfdefense",
        "incapacitation",
        "theory",
        "deterrence",
        "theory",
        "typically",
        "classified",
        "subspecies",
        "consequentialist",
        "theory",
        "punishment",
        "consequentialist",
        "theory",
        "attempt",
        "justify",
        "punishment",
        "best",
        "mean",
        "achieving",
        "certain",
        "independently",
        "identifiable",
        "good",
        "see",
        "eg",
        "bentham",
        "j",
        "wilson",
        "walker",
        "see",
        "also",
        "entry",
        "legal",
        "punishment",
        "different",
        "consequentialist",
        "theory",
        "explain",
        "final",
        "good",
        "good",
        "action",
        "aim",
        "differently",
        "plausible",
        "immediate",
        "good",
        "system",
        "punishment",
        "bring",
        "reduction",
        "crime",
        "reason",
        "consequentialist",
        "theory",
        "generally",
        "suggest",
        "punishment",
        "help",
        "reduce",
        "crime",
        "deterring",
        "incapacitating",
        "reforming",
        "potential",
        "offender",
        "deterrence",
        "theory",
        "particular",
        "hold",
        "punishment",
        "serve",
        "dual",
        "purpose",
        "deterring",
        "future",
        "bad",
        "illegal",
        "behavior",
        "individual",
        "punished",
        "well",
        "deter",
        "others",
        "similar",
        "act",
        "elli",
        "hoskins",
        "theory",
        "perfectly",
        "consistent",
        "moral",
        "responsibility",
        "skepticism",
        "since",
        "forwardlooking",
        "make",
        "appeal",
        "notion",
        "desert",
        "blameworthiness",
        "common",
        "objection",
        "consequentialist",
        "deterrence",
        "theory",
        "would",
        "allow",
        "manifestly",
        "unjust",
        "punishment",
        "example",
        "excessively",
        "harsh",
        "punishment",
        "guilty",
        "punishment",
        "innocent",
        "could",
        "principle",
        "justified",
        "effectively",
        "serve",
        "aim",
        "deterrence",
        "crime",
        "reduction",
        "see",
        "mccloskey",
        "hart",
        "nozick",
        "ten",
        "smilansky",
        "primoratz",
        "pereboom",
        "a",
        "honderich",
        "boonin",
        "brook",
        "sometimes",
        "called",
        "use",
        "objection",
        "since",
        "hold",
        "consequentialist",
        "theory",
        "allow",
        "least",
        "principle",
        "use",
        "person",
        "achieve",
        "certain",
        "desirable",
        "end",
        "violation",
        "kantian",
        "intuition",
        "person",
        "treated",
        "endsinthemselves",
        "however",
        "number",
        "common",
        "response",
        "objection",
        "one",
        "argue",
        "unjust",
        "punishment",
        "would",
        "justified",
        "would",
        "really",
        "produce",
        "best",
        "consequence",
        "eg",
        "smart",
        "bagaric",
        "amarasekara",
        "taken",
        "duff",
        "hoskins",
        "another",
        "argue",
        "real",
        "world",
        "would",
        "extremely",
        "unlikely",
        "punishment",
        "would",
        "ever",
        "best",
        "even",
        "le",
        "likely",
        "state",
        "could",
        "trusted",
        "reliably",
        "pick",
        "rare",
        "case",
        "would",
        "bethus",
        "criminal",
        "justice",
        "system",
        "adopt",
        "view",
        "punishment",
        "wrong",
        "unjustifiable",
        "see",
        "rawls",
        "hare",
        "paraphrased",
        "duff",
        "hoskins",
        "finally",
        "reply",
        "richer",
        "subtler",
        "account",
        "end",
        "criminal",
        "law",
        "serve",
        "generate",
        "suitable",
        "protection",
        "unjust",
        "punishment",
        "see",
        "braithwaite",
        "pettit",
        "tadros",
        "another",
        "approach",
        "consistent",
        "skepticism",
        "moral",
        "responsibility",
        "moral",
        "education",
        "theory",
        "theory",
        "typically",
        "maintain",
        "punishment",
        "justified",
        "benefit",
        "person",
        "punished",
        "analogy",
        "sometimes",
        "drawn",
        "justification",
        "punishing",
        "childrenie",
        "child",
        "typically",
        "punished",
        "exact",
        "retribution",
        "rather",
        "educate",
        "morally",
        "jean",
        "hampton",
        "instance",
        "writes",
        "punishment",
        "justified",
        "deserved",
        "evil",
        "rather",
        "attempt",
        "someone",
        "care",
        "improve",
        "wayward",
        "person",
        "hampton",
        "moral",
        "education",
        "account",
        "punishment",
        "justified",
        "get",
        "wrongdoer",
        "reflect",
        "moral",
        "reason",
        "law",
        "prohibition",
        "make",
        "decision",
        "reject",
        "prohibited",
        "action",
        "moral",
        "reason",
        "rather",
        "selfinterested",
        "reason",
        "avoiding",
        "pain",
        "critic",
        "however",
        "object",
        "number",
        "different",
        "ground",
        "point",
        "moral",
        "education",
        "may",
        "one",
        "plausible",
        "aim",
        "punishment",
        "full",
        "complete",
        "justification",
        "hampton",
        "others",
        "claim",
        "see",
        "dagger",
        "others",
        "argue",
        "far",
        "evident",
        "punishing",
        "adult",
        "criminal",
        "similarly",
        "likely",
        "result",
        "moral",
        "improvement",
        "pereboom",
        "a",
        "child",
        "adult",
        "criminal",
        "differ",
        "significant",
        "respectsie",
        "adult",
        "criminal",
        "unlike",
        "child",
        "typically",
        "understand",
        "moral",
        "code",
        "accepted",
        "society",
        "child",
        "generally",
        "psychologically",
        "malleable",
        "adult",
        "criminal",
        "pereboom",
        "a",
        "whether",
        "moral",
        "education",
        "theory",
        "succumb",
        "objection",
        "cf",
        "drucker",
        "shook",
        "shaferlandau",
        "dagger",
        "another",
        "nonretributive",
        "alternative",
        "available",
        "moral",
        "responsibility",
        "skeptic",
        "incapacitation",
        "account",
        "based",
        "right",
        "selfdefense",
        "analogous",
        "justification",
        "quarantine",
        "approach",
        "favored",
        "pereboom",
        "caruso",
        "draw",
        "comparison",
        "treatment",
        "dangerous",
        "criminal",
        "treatment",
        "carrier",
        "dangerous",
        "disease",
        "pereboom",
        "b",
        "a",
        "a",
        "caruso",
        "forthcominga",
        "pereboom",
        "caruso",
        "forthcoming",
        "simplest",
        "form",
        "summarized",
        "follows",
        "moral",
        "responsibility",
        "skeptic",
        "claim",
        "criminal",
        "morally",
        "responsible",
        "action",
        "basic",
        "desert",
        "sense",
        "plainly",
        "many",
        "carrier",
        "dangerous",
        "disease",
        "responsible",
        "sense",
        "contracted",
        "disease",
        "yet",
        "generally",
        "agree",
        "sometimes",
        "permissible",
        "quarantine",
        "justification",
        "right",
        "selfprotection",
        "prevention",
        "harm",
        "others",
        "similar",
        "reason",
        "even",
        "dangerous",
        "criminal",
        "morally",
        "responsible",
        "crime",
        "basic",
        "desert",
        "sense",
        "perhaps",
        "one",
        "ever",
        "way",
        "morally",
        "responsible",
        "could",
        "legitimate",
        "incapacitate",
        "quarantine",
        "nonresponsible",
        "carrier",
        "serious",
        "communicable",
        "disease",
        "account",
        "differs",
        "previous",
        "one",
        "two",
        "important",
        "way",
        "first",
        "although",
        "one",
        "might",
        "justify",
        "quarantine",
        "case",
        "disease",
        "incapacitation",
        "case",
        "dangerous",
        "criminal",
        "purely",
        "utilitarian",
        "consequentialist",
        "ground",
        "pereboom",
        "caruso",
        "resist",
        "strategy",
        "incapacitation",
        "dangerous",
        "criminal",
        "instead",
        "justified",
        "ground",
        "right",
        "harm",
        "self",
        "defense",
        "defense",
        "othersa",
        "right",
        "arguably",
        "broader",
        "appeal",
        "consequentialism",
        "contend",
        "justification",
        "make",
        "view",
        "resilient",
        "objection",
        "especially",
        "useobjection",
        "mentioned",
        "pereboom",
        "a",
        "illegitimate",
        "treat",
        "carrier",
        "disease",
        "harmfully",
        "necessary",
        "neutralize",
        "danger",
        "pose",
        "treating",
        "violent",
        "criminal",
        "tendency",
        "harshly",
        "required",
        "protect",
        "society",
        "illegitimate",
        "well",
        "furthermore",
        "innocent",
        "people",
        "could",
        "incapacitated",
        "account",
        "since",
        "pose",
        "direct",
        "threat",
        "others",
        "second",
        "quarantine",
        "model",
        "place",
        "several",
        "constraint",
        "treatment",
        "criminal",
        "see",
        "pereboom",
        "a",
        "first",
        "le",
        "dangerous",
        "disease",
        "justify",
        "preventative",
        "measure",
        "le",
        "restrictive",
        "quarantine",
        "le",
        "dangerous",
        "criminal",
        "tendency",
        "justify",
        "moderate",
        "restraint",
        "fact",
        "certain",
        "minor",
        "crime",
        "perhaps",
        "degree",
        "monitoring",
        "could",
        "defended",
        "secondly",
        "incapacitation",
        "account",
        "result",
        "analogy",
        "demand",
        "degree",
        "concern",
        "rehabilitation",
        "wellbeing",
        "criminal",
        "would",
        "alter",
        "much",
        "current",
        "practice",
        "fairness",
        "recommends",
        "seek",
        "cure",
        "diseased",
        "quarantine",
        "fairness",
        "would",
        "counsel",
        "attempt",
        "rehabilitate",
        "criminal",
        "detain",
        "criminal",
        "rehabilitated",
        "safety",
        "requires",
        "indefinite",
        "confinement",
        "account",
        "provides",
        "justification",
        "making",
        "life",
        "miserable",
        "would",
        "required",
        "guard",
        "danger",
        "pose",
        "finally",
        "measure",
        "preventing",
        "crime",
        "generally",
        "providing",
        "adequate",
        "education",
        "mental",
        "health",
        "care",
        "moral",
        "responsibility",
        "skeptic",
        "readily",
        "endorse",
        "public",
        "healthquarantine",
        "model",
        "proposed",
        "caruso",
        "instance",
        "extends",
        "quarantine",
        "analogy",
        "arena",
        "public",
        "health",
        "attempt",
        "prioritize",
        "prevention",
        "social",
        "justice",
        "call",
        "shift",
        "away",
        "myopic",
        "focus",
        "punishment",
        "toward",
        "holistic",
        "approach",
        "criminal",
        "behavior",
        "aimed",
        "addressing",
        "causal",
        "determinant",
        "crime",
        "social",
        "injustice",
        "give",
        "rise",
        "crime",
        "criticism",
        "quarantine",
        "model",
        "see",
        "corrado",
        "smilansky",
        "lemos",
        "tadros",
        "given",
        "various",
        "nonretributive",
        "option",
        "available",
        "moral",
        "responsibility",
        "skepticsfor",
        "additional",
        "option",
        "see",
        "corrado",
        "forthcominga",
        "b",
        "vilhauer",
        "a",
        "b",
        "n",
        "levy",
        "it",
        "would",
        "hasty",
        "conclude",
        "skeptical",
        "perspective",
        "leaf",
        "u",
        "unable",
        "adequately",
        "deal",
        "criminal",
        "behavior",
        "may",
        "even",
        "case",
        "many",
        "skeptic",
        "apt",
        "propose",
        "rejecting",
        "retributivism",
        "basic",
        "desert",
        "would",
        "allow",
        "u",
        "adopt",
        "practice",
        "policy",
        "humane",
        "effective"
    ]
}