{
    "main_text": "The aggregation of welfare measures or qualitative ratings || From rankings to ratings\n4.5 From rankings to ratings\n\nA distinct way of amending the informational basis of social choice,\nwhich is also feasible in electoral contexts, is to ask voters to\nexpress qualitative ratings, rather than rankings, of the\nalternatives. Two such proposals have received particular attention:\nfirst, ‘approval voting’, and secondly, more general forms\nof ‘grade aggregation’.\n\nApproval voting only modifies rather than enriches the informational\nbasis of social choice. Here, individuals indicate which alternatives\nthey approve of, where ‘approving’ can mean something like\nsaying ‘yes’ to an alternative, or ‘good’, or\n‘satisfactory’. Each individual can approve of as many or\nas few alternatives as he or she wishes. This partitions the set of\nalternatives into two subsets: the approved and the non-approved ones.\nAlternatives are not fully ranked from top to bottom. Formally, for\neach individual \\(i \\in N\\), let \\(A_i\\) be the subset of \\(X\\)\nconsisting of those alternatives which individual \\(i\\) approves of.\nThen the set \\(X\\setminus A_i\\) contains the non-approved\nalternatives. Call \\(A_i\\) individual \\(i\\)’s approval\nballot. The task is to find a way of aggregating any given\nprofile of approval ballots, \\(\\langle A_1, A_2 , \\ldots\n,A_n\\rangle\\), into a collective outcome, which also takes the form of\na subset of \\(X\\), consisting of the collectively approved or winning\nalternatives. Thus an aggregation rule is a function \\(f\\)\nthat assigns to each profile \\(\\langle A_1, A_2 , \\ldots ,A_n\\rangle\\)\n(typically in the domain of all possible approval ballots) a subset of\n\\(X\\), denoted \\(f(A_1, A_2 , \\ldots ,A_n)\\).\n\nBrams and Fishburn (1978, 1983) proposed the following aggregation\nrule, which they called approval voting: for each profile\n\\(\\langle A_1, A_2 , \\ldots ,A_n\\rangle\\), the set \\(f(A_1, A_2 ,\n\\ldots ,A_n)\\) of winning alternatives consists of all those\nalternatives that receive the largest number of individual approvals,\ni.e., all those alternatives \\(x \\in X\\) such that, for every other\nalternative \\(y \\in X\\), \\(|\\{i \\in N : x \\in A_i\\}| \\ge |\\{i \\in N :\ny\\in A_i\\}|.\\)\n\nWe can think of approval voting as a generalization of plurality rule.\nUnder plurality rule, each voter votes for only one\nalternative—normally his or her most preferred one—and the\nalternative with the largest number of votes wins (or if there are\nseveral alternatives with an equal largest number of votes, they are\ntied for winning). Under approval voting, each voter can instead vote\nfor any number of alternatives; again, the alternative with the most\nvotes wins (or there may be ties). Plurality rule is like approval\nvoting with a domain restriction to approval ballots in which each\nvoter may approve of only one alternative. While it may seem\ncounterintuitive to allow different voters to vote for different\nnumbers of alternatives, note that approving of more alternatives does\nnot necessarily give a voter more influence. In the limit, approving\nof all alternatives is equivalent to abstaining or approving of none\nof them, since such an approval ballot makes no difference to the\nrelative vote tallies. Approval voting can also be interpreted as\nimplementing a form of ‘yes’/‘no’ or\n‘pass’/‘fail’ grading of the alternatives. For\nan alternative to ‘win’ or to be collectively\n‘approved’, it must secure a maximal number of\n‘yes’ or ‘pass’ grades.\n\nThere is some debate on whether approval voting incentivizes voters to\nexpress their evaluations of the alternatives truthfully. If the\nindividuals’ underlying preferences are dichotomous\n(i.e., they each partition the alternatives into only two indifference\nclasses, namely the preferred and the dispreferred alternatives), then\napproval voting is strategy-proof, and each voter has an incentive to\nvote for all and only his or her preferred alternatives (Brams and\nFishburn 1978). However, if preferences aren’t dichotomous, then\napproval voting loses this property (Niemi 1984). The real-world\nstrategic incentives under approval voting thus depend on the\nstructure of the voters’ preferences.\n\nApproval voting can be axiomatically characterized in terms of\nadjusted versions of May’s four condition, extended to the\nsetting of approval balloting. Specifically, approval voting is the\nunique aggregation rule for approval ballots that satisfies universal\ndomain, neutrality, positive responsiveness, and a strengthened\nversion of anonymity called ‘optionwise anonymity’ (Goodin\nand List 2006). The latter condition formalizes a principle that Brams\nand Fishburn informally describe as follows: ‘In effect, the\nprinciple of “one person, one vote” under plurality voting\nbecomes the principle of “one candidate, one vote” under\napproval voting. That is, each voter makes judgments about every\ncandidate under approval voting, so the tie-in of a vote is not to the\nvoter but rather to the candidate’ (Brams and Fishburn 1983:\n12). For other axiomatic characterizations, see Fishburn (1978, 1988)\nand Sertel (1988). For extensions of approval voting to settings in\nwhich voters express not only approvals but also full rankings of the\nalternatives, see Brams and Sanver (2009).\n\nWhile approval voting implements a form of\n‘yes’/‘no’ or\n‘pass’/‘fail’ grading of the alternatives, a\nmore general grading-based approach to social choice has been\nadvocated by Balinski and Laraki (2007, 2011). Under their proposal,\nvoters each assign grades to the alternatives, drawn for instance from\nthe familiar spectrum of school grades A, B, C etc., and these grades\nare then aggregated into collective grades, on the basis of which a\nwinning alternative can be chosen. Their preferred version of this\nproposal—which they call ‘majority\njudgment’—defines each alternative’s collective\ngrade as a median grade relative to the\nindividually assigned grades, i.e., a grade that divides the\nindividuals into an equal number whose grade is no lower and an equal\nnumber whose grade is no higher. For instance, if an alternative\nreceives the grades A, B, B, E, and E from a group of five\nindividuals, then the median grade is B. When the number of\nindividuals is even, there could be an interval of median or\n‘middlemost’ grades. An attractive\nfeature of this way of defining the collective grade is\nthat ‘every grade other than a grade in the middlemost\ninterval is condemned by an absolute majority of the judges as being\neither too high or too low’ (Balinski and Laraki 2007:\n8723). Balinski and Laraki further argue that this proposal would\nlead voters to express considered evaluations of the alternatives in\nan intuitively intelligible format and incentivize truthfulness, as\ndiscussed below.\n\nTo formalize this, let \\(S\\) be the set of all available grades\n(‘\\(S\\)’ for grading scale), where \\(S\\) is non-empty and\nlinearly ordered from highest to lowest. For instance, \\(S\\) could be\n\\(\\{\\)A, B, C, D, E\\(\\}\\) or \\(\\{ \\text{Distinction,}\\)\n\\(\\text{Merit,}\\) \\(\\text{Pass,}\\) \\(\\text{Fail}\\}.\\) \nEach individual \\(i\\)’s assignment of\ngrades to the alternatives in \\(X\\) is a function \\(G_i\\) that\nassigns to each element \\(x \\in X\\) a grade \\(G_i (x)\\) from the set\n\\(S\\). A combination of grade assignments across the individuals in\n\\(N\\), \\(\\langle G_1, G_2 , \\ldots ,G_n\\rangle\\), is called a\nprofile of grade assignments. A grade aggregation\nrule is a function \\(f\\) that assigns to each profile of grade\nassignments \\(\\langle G_1, G_2 , \\ldots ,G_n\\rangle\\) (in some domain\nof admissible ones) a collective grade assignment \\(G = f(G_1, G_2 ,\n\\ldots ,G_n)\\), where, for each \\(x \\in X, G(x)\\) is the collective\ngrade for \\(x\\).\n\nBalinski and Laraki propose several conditions that a satisfactory\ngrade aggregation rule should satisfy. In particular, they suggest\nthat \\(f\\) should be (i) defined for the universal domain of\nall possible profiles of individual grade assignments; (ii)\nneutral in the familiar sense of treating all alternatives\nequally; (iii) anonymous in the equally familiar sense of\ntreating all voters equally; (iv) unanimous in the sense that\nif all individuals assign the same grade to an alternative, this\nbecomes the collective grade; (v) monotonic in the sense\nthat if some individuals raise their grade for an alternative (other\ngrades remaining equal), this doesn’t lower the resulting\ncollective grade, and if all individuals raise the grade, this\ncorrespondingly raises the collective grade; (vi) independent of\nirrelevant alternatives in the sense that the collective grade\nfor any alternative depends only on the individual grades for that\nalternative, not on the individual grades for other alternatives, and\n(vii) continuous (which becomes relevant when \\(S\\) is a\nsubset of the real numbers) in the sense that small changes in the\nindividual grades for an alternative lead only to small changes in the\ncollective grade. A grade aggregation rule that satisfies conditions\n(i) to (vii) is called a social grading function.\n\nBalinski and Laraki show that, among the social grading functions, the\nso-called ‘order methods’ stand out. For any given profile\nof individual grade assignments \\(\\langle G_1, G_2 , \\ldots\n,G_n\\rangle\\), an order method (with parameter \\(k)\\) assigns\nto each alternative \\(x \\in X\\) the \\(k\\)th highest grade\nthe alternative has been individually assigned, i.e., the\n\\(k\\)th highest grade in the list \\(G_1 (x), G_2 (x),\n\\ldots ,G_n (x)\\). The most salient example of an order method is the\nmedian method, already mentioned above, which assigns to each\noption the median grade it has been individually assigned. This is the\norder method with parameter \\(k = (n+1)/2\\), when \\(n\\) is odd. (When\n\\(n\\) is even, the definition requires some adjustment.) The following\nresult holds:\n\n\nTheorem (Balinski and Laraki 2007): A social grading function\nis strategy-proof in grading if and only if it is an order method.\n\n\nHere, a grade aggregation rule is said to be strategy-proof in\ngrading if it satisfies two conditions: first, when an\nindividual’s grade for an alternative \\(x \\in X\\) is higher than\nthe collectively assigned grade, then this individual can at most\nlower (and never raise) the collective grade for \\(x\\) by unilaterally\nchanging his or her individual grade; and second, when an\nindividual’s grade for an alternative \\(x \\in X\\) is lower than\nthe collectively assigned grade, then this individual can at most\nraise (and never lower) the collective grade for \\(x\\) by unilaterally\nchanging his or her individual grade. Strategy-proofness in grading\nmeans that, when the goal is to assign collective grades to the\nalternatives in \\(X\\) and voters each seek to achieve collective\ngrades that are as close as possible to their individual grades,\nthey will not be incentivized to misrepresent their grades. In short,\ntruthful expression of grades will be a (weakly) dominant\nstrategy.\n\nHowever, incentives to vote strategically may reoccur if the\ncollectively assigned grades are used to choose one of the\nalternatives. As Balinski and Laraki point out, ‘[w]hen rank\norderings are the principal goal instead of grades, the strategic\nbehavior of the judges may change’ (2007: 8724), and\nstrategy-proofness in ranking as opposed to\nstrategy-proofness in grading is not achievable in a social\ngrading function (ibid.), a result somewhat analogous to the\nGibbard-Satterthwaite theorem. Note further that the collective grades\nalone are often insufficient to determine a unique winning\nalternative; two or more alternatives might each receive the same top\ngrade. This raises to question of how to break such ties in the\ngrades, and a number of possible criteria have been proposed. For\ndiscussion, see Fabre (2021).\n\nThe key challenge for the grading-based approach to social choice is\nto ensure that the grades have a common meaning for all voters. Unless\nan ‘A’-grade, for instance, has the same meaning for all\nvoters, the entire exercise of aggregating individually assigned\ngrades would not be meaningful. Some voters might be tougher graders\nthan others, and it will then not be possible to infer that an\n‘A’-grade from one voter is a stronger quality signal than\na ‘B’-grade from another. Just as Sen’s SWFL\napproach avoids the impossibility results of social choice only if we\ncan assume interpersonal comparability of welfare, so the\ngrading-based approach allows us to make meaningful social choices\nonly if grades are interpersonally comparable in an appropriate sense.\nFor a technical development of this critique of the grading-based\napproach, see Morreau (2016).\n",
    "section_title": "4.5 From rankings to ratings",
    "entry_title": "Social Choice Theory",
    "hierarchy_title": "Social Choice Theory || The aggregation of welfare measures or qualitative ratings || From rankings to ratings",
    "tokenized_text": [
        "aggregation",
        "welfare",
        "measure",
        "qualitative",
        "rating",
        "ranking",
        "rating",
        "ranking",
        "rating",
        "distinct",
        "way",
        "amending",
        "informational",
        "basis",
        "social",
        "choice",
        "also",
        "feasible",
        "electoral",
        "context",
        "ask",
        "voter",
        "express",
        "qualitative",
        "rating",
        "rather",
        "ranking",
        "alternative",
        "two",
        "proposal",
        "received",
        "particular",
        "attention",
        "first",
        "approval",
        "voting",
        "secondly",
        "general",
        "form",
        "grade",
        "aggregation",
        "approval",
        "voting",
        "modifies",
        "rather",
        "enriches",
        "informational",
        "basis",
        "social",
        "choice",
        "individual",
        "indicate",
        "alternative",
        "approve",
        "approving",
        "mean",
        "something",
        "like",
        "saying",
        "yes",
        "alternative",
        "good",
        "satisfactory",
        "individual",
        "approve",
        "many",
        "alternative",
        "wish",
        "partition",
        "set",
        "alternative",
        "two",
        "subset",
        "approved",
        "nonapproved",
        "one",
        "alternative",
        "fully",
        "ranked",
        "top",
        "bottom",
        "formally",
        "individual",
        "in",
        "n",
        "let",
        "a_i",
        "subset",
        "x",
        "consisting",
        "alternative",
        "individual",
        "i",
        "approves",
        "set",
        "xsetminus",
        "a_i",
        "contains",
        "nonapproved",
        "alternative",
        "call",
        "a_i",
        "individual",
        "i",
        "approval",
        "ballot",
        "task",
        "find",
        "way",
        "aggregating",
        "given",
        "profile",
        "approval",
        "ballot",
        "langle",
        "a_",
        "a_",
        "ldots",
        "a_nrangle",
        "collective",
        "outcome",
        "also",
        "take",
        "form",
        "subset",
        "x",
        "consisting",
        "collectively",
        "approved",
        "winning",
        "alternative",
        "thus",
        "aggregation",
        "rule",
        "function",
        "f",
        "assigns",
        "profile",
        "langle",
        "a_",
        "a_",
        "ldots",
        "a_nrangle",
        "typically",
        "domain",
        "possible",
        "approval",
        "ballot",
        "subset",
        "x",
        "denoted",
        "f",
        "a_",
        "a_",
        "ldots",
        "a_n",
        "brams",
        "fishburn",
        "proposed",
        "following",
        "aggregation",
        "rule",
        "called",
        "approval",
        "voting",
        "profile",
        "langle",
        "a_",
        "a_",
        "ldots",
        "a_nrangle",
        "set",
        "f",
        "a_",
        "a_",
        "ldots",
        "a_n",
        "winning",
        "alternative",
        "consists",
        "alternative",
        "receive",
        "largest",
        "number",
        "individual",
        "approval",
        "ie",
        "alternative",
        "x",
        "in",
        "x",
        "every",
        "alternative",
        "in",
        "x",
        "in",
        "n",
        "x",
        "in",
        "a_i",
        "ge",
        "in",
        "n",
        "yin",
        "a_i",
        "think",
        "approval",
        "voting",
        "generalization",
        "plurality",
        "rule",
        "plurality",
        "rule",
        "voter",
        "vote",
        "one",
        "alternativenormally",
        "preferred",
        "oneand",
        "alternative",
        "largest",
        "number",
        "vote",
        "win",
        "several",
        "alternative",
        "equal",
        "largest",
        "number",
        "vote",
        "tied",
        "winning",
        "approval",
        "voting",
        "voter",
        "instead",
        "vote",
        "number",
        "alternative",
        "alternative",
        "vote",
        "win",
        "may",
        "tie",
        "plurality",
        "rule",
        "like",
        "approval",
        "voting",
        "domain",
        "restriction",
        "approval",
        "ballot",
        "voter",
        "may",
        "approve",
        "one",
        "alternative",
        "may",
        "seem",
        "counterintuitive",
        "allow",
        "different",
        "voter",
        "vote",
        "different",
        "number",
        "alternative",
        "note",
        "approving",
        "alternative",
        "necessarily",
        "give",
        "voter",
        "influence",
        "limit",
        "approving",
        "alternative",
        "equivalent",
        "abstaining",
        "approving",
        "none",
        "since",
        "approval",
        "ballot",
        "make",
        "difference",
        "relative",
        "vote",
        "tally",
        "approval",
        "voting",
        "also",
        "interpreted",
        "implementing",
        "form",
        "yes",
        "pas",
        "fail",
        "grading",
        "alternative",
        "alternative",
        "win",
        "collectively",
        "approved",
        "must",
        "secure",
        "maximal",
        "number",
        "yes",
        "pas",
        "grade",
        "debate",
        "whether",
        "approval",
        "voting",
        "incentivizes",
        "voter",
        "express",
        "evaluation",
        "alternative",
        "truthfully",
        "individual",
        "underlying",
        "preference",
        "dichotomous",
        "ie",
        "partition",
        "alternative",
        "two",
        "indifference",
        "class",
        "namely",
        "preferred",
        "dispreferred",
        "alternative",
        "approval",
        "voting",
        "strategyproof",
        "voter",
        "incentive",
        "vote",
        "preferred",
        "alternative",
        "brams",
        "fishburn",
        "however",
        "preference",
        "dichotomous",
        "approval",
        "voting",
        "loses",
        "property",
        "niemi",
        "realworld",
        "strategic",
        "incentive",
        "approval",
        "voting",
        "thus",
        "depend",
        "structure",
        "voter",
        "preference",
        "approval",
        "voting",
        "axiomatically",
        "characterized",
        "term",
        "adjusted",
        "version",
        "may",
        "four",
        "condition",
        "extended",
        "setting",
        "approval",
        "balloting",
        "specifically",
        "approval",
        "voting",
        "unique",
        "aggregation",
        "rule",
        "approval",
        "ballot",
        "satisfies",
        "universal",
        "domain",
        "neutrality",
        "positive",
        "responsiveness",
        "strengthened",
        "version",
        "anonymity",
        "called",
        "optionwise",
        "anonymity",
        "goodin",
        "list",
        "latter",
        "condition",
        "formalizes",
        "principle",
        "brams",
        "fishburn",
        "informally",
        "describe",
        "follows",
        "effect",
        "principle",
        "one",
        "person",
        "one",
        "vote",
        "plurality",
        "voting",
        "becomes",
        "principle",
        "one",
        "candidate",
        "one",
        "vote",
        "approval",
        "voting",
        "voter",
        "make",
        "judgment",
        "every",
        "candidate",
        "approval",
        "voting",
        "tiein",
        "vote",
        "voter",
        "rather",
        "candidate",
        "brams",
        "fishburn",
        "axiomatic",
        "characterization",
        "see",
        "fishburn",
        "sertel",
        "extension",
        "approval",
        "voting",
        "setting",
        "voter",
        "express",
        "approval",
        "also",
        "full",
        "ranking",
        "alternative",
        "see",
        "brams",
        "sanver",
        "approval",
        "voting",
        "implement",
        "form",
        "yes",
        "pas",
        "fail",
        "grading",
        "alternative",
        "general",
        "gradingbased",
        "approach",
        "social",
        "choice",
        "advocated",
        "balinski",
        "laraki",
        "proposal",
        "voter",
        "assign",
        "grade",
        "alternative",
        "drawn",
        "instance",
        "familiar",
        "spectrum",
        "school",
        "grade",
        "b",
        "c",
        "etc",
        "grade",
        "aggregated",
        "collective",
        "grade",
        "basis",
        "winning",
        "alternative",
        "chosen",
        "preferred",
        "version",
        "proposalwhich",
        "call",
        "majority",
        "judgment",
        "defines",
        "alternative",
        "collective",
        "grade",
        "median",
        "grade",
        "relative",
        "individually",
        "assigned",
        "grade",
        "ie",
        "grade",
        "divide",
        "individual",
        "equal",
        "number",
        "whose",
        "grade",
        "lower",
        "equal",
        "number",
        "whose",
        "grade",
        "higher",
        "instance",
        "alternative",
        "receives",
        "grade",
        "b",
        "b",
        "e",
        "e",
        "group",
        "five",
        "individual",
        "median",
        "grade",
        "b",
        "number",
        "individual",
        "even",
        "could",
        "interval",
        "median",
        "middlemost",
        "grade",
        "attractive",
        "feature",
        "way",
        "defining",
        "collective",
        "grade",
        "every",
        "grade",
        "grade",
        "middlemost",
        "interval",
        "condemned",
        "absolute",
        "majority",
        "judge",
        "either",
        "high",
        "low",
        "balinski",
        "laraki",
        "balinski",
        "laraki",
        "argue",
        "proposal",
        "would",
        "lead",
        "voter",
        "express",
        "considered",
        "evaluation",
        "alternative",
        "intuitively",
        "intelligible",
        "format",
        "incentivize",
        "truthfulness",
        "discussed",
        "formalize",
        "let",
        "s",
        "set",
        "available",
        "grade",
        "s",
        "grading",
        "scale",
        "s",
        "nonempty",
        "linearly",
        "ordered",
        "highest",
        "lowest",
        "instance",
        "s",
        "could",
        "b",
        "c",
        "e",
        "text",
        "distinction",
        "text",
        "merit",
        "text",
        "pas",
        "text",
        "fail",
        "individual",
        "i",
        "assignment",
        "grade",
        "alternative",
        "x",
        "function",
        "g_i",
        "assigns",
        "element",
        "x",
        "in",
        "x",
        "grade",
        "g_i",
        "x",
        "set",
        "s",
        "combination",
        "grade",
        "assignment",
        "across",
        "individual",
        "n",
        "langle",
        "g_",
        "g_",
        "ldots",
        "g_nrangle",
        "called",
        "profile",
        "grade",
        "assignment",
        "grade",
        "aggregation",
        "rule",
        "function",
        "f",
        "assigns",
        "profile",
        "grade",
        "assignment",
        "langle",
        "g_",
        "g_",
        "ldots",
        "g_nrangle",
        "domain",
        "admissible",
        "one",
        "collective",
        "grade",
        "assignment",
        "g",
        "f",
        "g_",
        "g_",
        "ldots",
        "g_n",
        "x",
        "in",
        "x",
        "g",
        "x",
        "collective",
        "grade",
        "x",
        "balinski",
        "laraki",
        "propose",
        "several",
        "condition",
        "satisfactory",
        "grade",
        "aggregation",
        "rule",
        "satisfy",
        "particular",
        "suggest",
        "f",
        "defined",
        "universal",
        "domain",
        "possible",
        "profile",
        "individual",
        "grade",
        "assignment",
        "ii",
        "neutral",
        "familiar",
        "sense",
        "treating",
        "alternative",
        "equally",
        "iii",
        "anonymous",
        "equally",
        "familiar",
        "sense",
        "treating",
        "voter",
        "equally",
        "iv",
        "unanimous",
        "sense",
        "individual",
        "assign",
        "grade",
        "alternative",
        "becomes",
        "collective",
        "grade",
        "v",
        "monotonic",
        "sense",
        "individual",
        "raise",
        "grade",
        "alternative",
        "grade",
        "remaining",
        "equal",
        "lower",
        "resulting",
        "collective",
        "grade",
        "individual",
        "raise",
        "grade",
        "correspondingly",
        "raise",
        "collective",
        "grade",
        "vi",
        "independent",
        "irrelevant",
        "alternative",
        "sense",
        "collective",
        "grade",
        "alternative",
        "depends",
        "individual",
        "grade",
        "alternative",
        "individual",
        "grade",
        "alternative",
        "vii",
        "continuous",
        "becomes",
        "relevant",
        "s",
        "subset",
        "real",
        "number",
        "sense",
        "small",
        "change",
        "individual",
        "grade",
        "alternative",
        "lead",
        "small",
        "change",
        "collective",
        "grade",
        "grade",
        "aggregation",
        "rule",
        "satisfies",
        "condition",
        "vii",
        "called",
        "social",
        "grading",
        "function",
        "balinski",
        "laraki",
        "show",
        "among",
        "social",
        "grading",
        "function",
        "socalled",
        "order",
        "method",
        "stand",
        "given",
        "profile",
        "individual",
        "grade",
        "assignment",
        "langle",
        "g_",
        "g_",
        "ldots",
        "g_nrangle",
        "order",
        "method",
        "parameter",
        "k",
        "assigns",
        "alternative",
        "x",
        "in",
        "x",
        "k",
        "th",
        "highest",
        "grade",
        "alternative",
        "individually",
        "assigned",
        "ie",
        "k",
        "th",
        "highest",
        "grade",
        "list",
        "g_",
        "x",
        "g_",
        "x",
        "ldots",
        "g_n",
        "x",
        "salient",
        "example",
        "order",
        "method",
        "median",
        "method",
        "already",
        "mentioned",
        "assigns",
        "option",
        "median",
        "grade",
        "individually",
        "assigned",
        "order",
        "method",
        "parameter",
        "k",
        "n",
        "n",
        "odd",
        "n",
        "even",
        "definition",
        "requires",
        "adjustment",
        "following",
        "result",
        "hold",
        "theorem",
        "balinski",
        "laraki",
        "social",
        "grading",
        "function",
        "strategyproof",
        "grading",
        "order",
        "method",
        "grade",
        "aggregation",
        "rule",
        "said",
        "strategyproof",
        "grading",
        "satisfies",
        "two",
        "condition",
        "first",
        "individual",
        "grade",
        "alternative",
        "x",
        "in",
        "x",
        "higher",
        "collectively",
        "assigned",
        "grade",
        "individual",
        "lower",
        "never",
        "raise",
        "collective",
        "grade",
        "x",
        "unilaterally",
        "changing",
        "individual",
        "grade",
        "second",
        "individual",
        "grade",
        "alternative",
        "x",
        "in",
        "x",
        "lower",
        "collectively",
        "assigned",
        "grade",
        "individual",
        "raise",
        "never",
        "lower",
        "collective",
        "grade",
        "x",
        "unilaterally",
        "changing",
        "individual",
        "grade",
        "strategyproofness",
        "grading",
        "mean",
        "goal",
        "assign",
        "collective",
        "grade",
        "alternative",
        "x",
        "voter",
        "seek",
        "achieve",
        "collective",
        "grade",
        "close",
        "possible",
        "individual",
        "grade",
        "incentivized",
        "misrepresent",
        "grade",
        "short",
        "truthful",
        "expression",
        "grade",
        "weakly",
        "dominant",
        "strategy",
        "however",
        "incentive",
        "vote",
        "strategically",
        "may",
        "reoccur",
        "collectively",
        "assigned",
        "grade",
        "used",
        "choose",
        "one",
        "alternative",
        "balinski",
        "laraki",
        "point",
        "w",
        "hen",
        "rank",
        "ordering",
        "principal",
        "goal",
        "instead",
        "grade",
        "strategic",
        "behavior",
        "judge",
        "may",
        "change",
        "strategyproofness",
        "ranking",
        "opposed",
        "strategyproofness",
        "grading",
        "achievable",
        "social",
        "grading",
        "function",
        "ibid",
        "result",
        "somewhat",
        "analogous",
        "gibbardsatterthwaite",
        "theorem",
        "note",
        "collective",
        "grade",
        "alone",
        "often",
        "insufficient",
        "determine",
        "unique",
        "winning",
        "alternative",
        "two",
        "alternative",
        "might",
        "receive",
        "top",
        "grade",
        "raise",
        "question",
        "break",
        "tie",
        "grade",
        "number",
        "possible",
        "criterion",
        "proposed",
        "discussion",
        "see",
        "fabre",
        "key",
        "challenge",
        "gradingbased",
        "approach",
        "social",
        "choice",
        "ensure",
        "grade",
        "common",
        "meaning",
        "voter",
        "unless",
        "grade",
        "instance",
        "meaning",
        "voter",
        "entire",
        "exercise",
        "aggregating",
        "individually",
        "assigned",
        "grade",
        "would",
        "meaningful",
        "voter",
        "might",
        "tougher",
        "grader",
        "others",
        "possible",
        "infer",
        "grade",
        "one",
        "voter",
        "stronger",
        "quality",
        "signal",
        "b",
        "grade",
        "another",
        "sen",
        "swfl",
        "approach",
        "avoids",
        "impossibility",
        "result",
        "social",
        "choice",
        "assume",
        "interpersonal",
        "comparability",
        "welfare",
        "gradingbased",
        "approach",
        "allows",
        "u",
        "make",
        "meaningful",
        "social",
        "choice",
        "grade",
        "interpersonally",
        "comparable",
        "appropriate",
        "sense",
        "technical",
        "development",
        "critique",
        "gradingbased",
        "approach",
        "see",
        "morreau"
    ]
}