{
    "main_text": "Why a social minimum? || Libertarianism\n2.2 Libertarianism\n\nIf utilitarianism’s criterion of justice is aggregate welfare,\nlibertarianism’s is individual rights. Individuals are\n“inviolable”: they have rights, and these rights may not\nbe violated even for the sake of increasing aggregate\nwelfare—indeed, even for the sake of preventing the wider\nviolation of rights (Nozick 1974: 28–35).\n\nIf we ask exactly what rights the individual has, on the libertarian\nview, then a large part of the answer is that the individual is\nendowed with the rights of self-ownership. Someone enjoys\nself-ownership, in the relevant sense, when they have full private\nownership of their own body and abilities (Cohen 1995: 68). A\ncorollary of the idea of self-ownership is the idea that individuals\ndo not have any non-contractual obligations to use their labor for the\nbenefit of others. In exercising their rights of self-ownership,\npeople may contract with others to offer them specified services and\nbenefits. But if the state forces people to provide such services and\nbenefits without the consent of the individuals concerned, it violates\ntheir rights of self-ownership. It would, so the argument runs, treat\nthe individuals concerned as if they are state-owned assets,\nto be pressed into service for the good of others at the state’s\ndiscretion. Now, in order to enact a social minimum, it seems likely\nthat the state will have to impose a non-contractual obligation on\nhigh earning citizens to transfer resources to the less fortunate who\nare otherwise at risk of falling below the level of the social\nminimum. But this apparently violates the self-ownership rights of the\nhigh earners (because it apparently forces them to share the ‘fruits\nof their labours’ with others without their consent). For this reason,\nlibertarianism looks like an unpromising basis on which to defend\nenactment of a social minimum.\n\nHowever, things are not quite so clear-cut. Return to the question of\nexactly what rights individuals have on the libertarian view. The\nconcept of self-ownership provides a large part of, but cannot provide\nthe whole, answer to this question. For the world does not only\ncontain people, but a wide variety of external resources, such as\nland. What kind of rights do we have in relation to these other\nresources? If we believe that individuals can come to have private\nproperty rights in these resources, no less inviolable than those they\nhave in relation to their own bodies and abilities, we need to know\nhow the individuals concerned acquire these property rights. Part of\nthe answer the libertarian gives is that if we acquire a resource\nthrough voluntary exchange with someone who already owns it\n(legitimately), then we come to own the resource (an aspect of what\nNozick calls “justice in transfer”; Nozick 1974:\n150–153). But if we trace the history of such trades back there\nwill be a point at which the resource in question did not have an\nowner; someone, somehow, made an unowned resource—a piece of\nland, say—their private property. But how can this happen? In\nRobert Nozick’s terms, the libertarian must given an account of\n“justice in acquisition” (Nozick 1974: 151,\n174–182).\n\nThe nature of justice in acquisition is a source of controversy\namongst libertarians. Assuming that the external resources we have in\nmind are initially unowned, one might argue that specific individuals\ncan appropriate resources as private property by “mixing”\ntheir self-owned powers with the resources concerned. This thought,\nwhich we find in the work of John Locke (Locke 1689: Book 2, chapter\n5), is that individuals integrate something they already own (their\nlabor) with something initially unowned (say, a piece of land), and,\nthereby, come to own what they initially did not own. However, some\nlibertarians, such as Nozick, follow Locke in arguing that\nappropriation through the exercise of self-owned powers is just\nonly if it does not harm those who, following appropriation,\nlose access to the resource. This condition (often referred to as the\nLockean Proviso) can be elaborated in various ways. In\nNozick’s influential statement of the libertarian view, the condition\nis apparently elaborated as follows (see Nozick 1974: 174–182;\nand, for helpful interpretation, Wolff 1991: 107–115): an act of\nappropriation of a previously unowned resource is just only if no\nperson is thereby made worse off than they would be in a world where\nall external resources remain unowned. In a world in which all\nexternal resources remain unowned, each person would be able to reach\na certain level of welfare by using the resources that lie about\nunowned. For any given individual, i, let us denote this\nwelfare level as Wi. A given act of appropriation\nis just, then, provided that, post-appropriation, each individual\nremains able to reach at least Wi. (Note that\nWi may differ between particular individuals\nbecause of their unequal abilities to produce things in the\n“state of nature” in which all external resources remain\nunowned.)\n\nThe implication of this account of justice in acquisition is that any\nregime of private property rights is just only provided that every\nperson living under said regime is able to achieve\nWi—the welfare level that they would have\nbeen able to achieve in a world in which all external resources remain\nunowned. Many libertarians, including Nozick, express optimism that a\nprivate property regime will be able to provide people with the\nopportunity to achieve this welfare level. But it is conceivable that\nin the normal operation of the economy, a private property regime\nmight at some times, for some people, fail to provide access to this\nlevel of welfare. If so, then justice—as the libertarian\nunderstands it—demands that the state act to correct the\ndistribution of welfare generated by the spontaneous play of market\nforces. Specifically, the state must compensate anyone who, due to the\nexisting allocation of private property rights in external resources,\ncannot otherwise achieve Wi. According to at least\none influential libertarian philosopher, Robert Nozick, our basic\nrights thus include not only our rights of self-ownership, but this\nright to welfare as well.\n\nIn order to satisfy this right, a libertarian system might have to run\nsome assistance programs for the very poor. To some extent, then, even\na libertarian state might have some government programs that resemble\nthose we associate with a social minimum policy regime. It is in this\nvery limited sense that even a libertarian theory of justice might\nlend support to the enactment of at least a partial social minimum\n(see also the discussion in Brock 1998a and Sterba\n 1998).[2]\n\nThat said, it is highly unlikely that this argument can be used to\nsupport the enactment of anything like a full social minimum. This is\nso for at least two reasons. Firstly, for most, if not all, people\nWi is likely to be very low, precisely because it\nis the welfare level we could get in a world with no property rights\nregime to stabilize expectations about the use of resources and,\ntherefore, a world without the huge productivity gains that come from\nstabilizing such expectations. Hence, the level of assistance entailed\nby the libertarian right to welfare is likely in general to fall well\nshort of what is needed to ensure people the capabilities for a\n“minimally decent life” in their society. Secondly, it is\nimportant to recall that Wi will almost certainly\nvary across people according to the nature of their personal,\nself-owned capacities. Those who are born with a good endowment of\nproductively applicable talents will obviously fare better in the\nstate of nature, in which all external resources remain unowned, than,\nfor example, those who are born with capacities that make it harder\nfor them to engage in production. In the case of some of the latter,\nWi may be close to zero—zero denoting the\noutcome of starving to death in the state of nature. Thus, if these\npeople happen to be unfortunate enough to be starving to death in a\nreal-world private property rights regime, they may well have no claim\nto assistance under the libertarian right to welfare: this right does\nnot demand that they be prevented from starving if this is what would\nhappen to them in the baseline world in which all external resources\nremain unowned.\n\nWe may conclude that libertarianism gives only contingent and very\nweak support for the enactment of a social minimum. Indeed, except in\nsome very rare instances, libertarianism implies that enactment of a\nfull social minimum is unjust.\n",
    "section_title": "2.2 Libertarianism",
    "entry_title": "Social Minimum",
    "hierarchy_title": "Social Minimum || Why a social minimum? || Libertarianism",
    "tokenized_text": [
        "social",
        "minimum",
        "libertarianism",
        "libertarianism",
        "utilitarianism",
        "criterion",
        "justice",
        "aggregate",
        "welfare",
        "libertarianism",
        "individual",
        "right",
        "individual",
        "inviolable",
        "right",
        "right",
        "may",
        "violated",
        "even",
        "sake",
        "increasing",
        "aggregate",
        "welfareindeed",
        "even",
        "sake",
        "preventing",
        "wider",
        "violation",
        "right",
        "nozick",
        "ask",
        "exactly",
        "right",
        "individual",
        "libertarian",
        "view",
        "large",
        "part",
        "answer",
        "individual",
        "endowed",
        "right",
        "selfownership",
        "someone",
        "enjoys",
        "selfownership",
        "relevant",
        "sense",
        "full",
        "private",
        "ownership",
        "body",
        "ability",
        "cohen",
        "corollary",
        "idea",
        "selfownership",
        "idea",
        "individual",
        "noncontractual",
        "obligation",
        "use",
        "labor",
        "benefit",
        "others",
        "exercising",
        "right",
        "selfownership",
        "people",
        "may",
        "contract",
        "others",
        "offer",
        "specified",
        "service",
        "benefit",
        "state",
        "force",
        "people",
        "provide",
        "service",
        "benefit",
        "without",
        "consent",
        "individual",
        "concerned",
        "violates",
        "right",
        "selfownership",
        "would",
        "argument",
        "run",
        "treat",
        "individual",
        "concerned",
        "stateowned",
        "asset",
        "pressed",
        "service",
        "good",
        "others",
        "state",
        "discretion",
        "order",
        "enact",
        "social",
        "minimum",
        "seems",
        "likely",
        "state",
        "impose",
        "noncontractual",
        "obligation",
        "high",
        "earning",
        "citizen",
        "transfer",
        "resource",
        "le",
        "fortunate",
        "otherwise",
        "risk",
        "falling",
        "level",
        "social",
        "minimum",
        "apparently",
        "violates",
        "selfownership",
        "right",
        "high",
        "earner",
        "apparently",
        "force",
        "share",
        "fruit",
        "labour",
        "others",
        "without",
        "consent",
        "reason",
        "libertarianism",
        "look",
        "like",
        "unpromising",
        "basis",
        "defend",
        "enactment",
        "social",
        "minimum",
        "however",
        "thing",
        "quite",
        "clearcut",
        "return",
        "question",
        "exactly",
        "right",
        "individual",
        "libertarian",
        "view",
        "concept",
        "selfownership",
        "provides",
        "large",
        "part",
        "provide",
        "whole",
        "answer",
        "question",
        "world",
        "contain",
        "people",
        "wide",
        "variety",
        "external",
        "resource",
        "land",
        "kind",
        "right",
        "relation",
        "resource",
        "believe",
        "individual",
        "come",
        "private",
        "property",
        "right",
        "resource",
        "le",
        "inviolable",
        "relation",
        "body",
        "ability",
        "need",
        "know",
        "individual",
        "concerned",
        "acquire",
        "property",
        "right",
        "part",
        "answer",
        "libertarian",
        "give",
        "acquire",
        "resource",
        "voluntary",
        "exchange",
        "someone",
        "already",
        "owns",
        "legitimately",
        "come",
        "resource",
        "aspect",
        "nozick",
        "call",
        "justice",
        "transfer",
        "nozick",
        "trace",
        "history",
        "trade",
        "back",
        "point",
        "resource",
        "question",
        "owner",
        "someone",
        "somehow",
        "made",
        "unowned",
        "resourcea",
        "piece",
        "land",
        "saytheir",
        "private",
        "property",
        "happen",
        "robert",
        "nozick",
        "term",
        "libertarian",
        "must",
        "given",
        "account",
        "justice",
        "acquisition",
        "nozick",
        "nature",
        "justice",
        "acquisition",
        "source",
        "controversy",
        "amongst",
        "libertarian",
        "assuming",
        "external",
        "resource",
        "mind",
        "initially",
        "unowned",
        "one",
        "might",
        "argue",
        "specific",
        "individual",
        "appropriate",
        "resource",
        "private",
        "property",
        "mixing",
        "selfowned",
        "power",
        "resource",
        "concerned",
        "thought",
        "find",
        "work",
        "john",
        "locke",
        "locke",
        "book",
        "chapter",
        "individual",
        "integrate",
        "something",
        "already",
        "labor",
        "something",
        "initially",
        "unowned",
        "say",
        "piece",
        "land",
        "thereby",
        "come",
        "initially",
        "however",
        "libertarian",
        "nozick",
        "follow",
        "locke",
        "arguing",
        "appropriation",
        "exercise",
        "selfowned",
        "power",
        "harm",
        "following",
        "appropriation",
        "lose",
        "access",
        "resource",
        "condition",
        "often",
        "referred",
        "lockean",
        "proviso",
        "elaborated",
        "various",
        "way",
        "nozick",
        "influential",
        "statement",
        "libertarian",
        "view",
        "condition",
        "apparently",
        "elaborated",
        "follows",
        "see",
        "nozick",
        "helpful",
        "interpretation",
        "wolff",
        "act",
        "appropriation",
        "previously",
        "unowned",
        "resource",
        "person",
        "thereby",
        "made",
        "worse",
        "would",
        "world",
        "external",
        "resource",
        "remain",
        "unowned",
        "world",
        "external",
        "resource",
        "remain",
        "unowned",
        "person",
        "would",
        "able",
        "reach",
        "certain",
        "level",
        "welfare",
        "using",
        "resource",
        "lie",
        "unowned",
        "given",
        "individual",
        "let",
        "u",
        "denote",
        "welfare",
        "level",
        "wi",
        "given",
        "act",
        "appropriation",
        "provided",
        "postappropriation",
        "individual",
        "remains",
        "able",
        "reach",
        "least",
        "wi",
        "note",
        "wi",
        "may",
        "differ",
        "particular",
        "individual",
        "unequal",
        "ability",
        "produce",
        "thing",
        "state",
        "nature",
        "external",
        "resource",
        "remain",
        "unowned",
        "implication",
        "account",
        "justice",
        "acquisition",
        "regime",
        "private",
        "property",
        "right",
        "provided",
        "every",
        "person",
        "living",
        "said",
        "regime",
        "able",
        "achieve",
        "withe",
        "welfare",
        "level",
        "would",
        "able",
        "achieve",
        "world",
        "external",
        "resource",
        "remain",
        "unowned",
        "many",
        "libertarian",
        "including",
        "nozick",
        "express",
        "optimism",
        "private",
        "property",
        "regime",
        "able",
        "provide",
        "people",
        "opportunity",
        "achieve",
        "welfare",
        "level",
        "conceivable",
        "normal",
        "operation",
        "economy",
        "private",
        "property",
        "regime",
        "might",
        "time",
        "people",
        "fail",
        "provide",
        "access",
        "level",
        "welfare",
        "justiceas",
        "libertarian",
        "understands",
        "itdemands",
        "state",
        "act",
        "correct",
        "distribution",
        "welfare",
        "generated",
        "spontaneous",
        "play",
        "market",
        "force",
        "specifically",
        "state",
        "must",
        "compensate",
        "anyone",
        "due",
        "existing",
        "allocation",
        "private",
        "property",
        "right",
        "external",
        "resource",
        "otherwise",
        "achieve",
        "wi",
        "according",
        "least",
        "one",
        "influential",
        "libertarian",
        "philosopher",
        "robert",
        "nozick",
        "basic",
        "right",
        "thus",
        "include",
        "right",
        "selfownership",
        "right",
        "welfare",
        "well",
        "order",
        "satisfy",
        "right",
        "libertarian",
        "system",
        "might",
        "run",
        "assistance",
        "program",
        "poor",
        "extent",
        "even",
        "libertarian",
        "state",
        "might",
        "government",
        "program",
        "resemble",
        "associate",
        "social",
        "minimum",
        "policy",
        "regime",
        "limited",
        "sense",
        "even",
        "libertarian",
        "theory",
        "justice",
        "might",
        "lend",
        "support",
        "enactment",
        "least",
        "partial",
        "social",
        "minimum",
        "see",
        "also",
        "discussion",
        "brock",
        "a",
        "sterba",
        "said",
        "highly",
        "unlikely",
        "argument",
        "used",
        "support",
        "enactment",
        "anything",
        "like",
        "full",
        "social",
        "minimum",
        "least",
        "two",
        "reason",
        "firstly",
        "people",
        "wi",
        "likely",
        "low",
        "precisely",
        "welfare",
        "level",
        "could",
        "get",
        "world",
        "property",
        "right",
        "regime",
        "stabilize",
        "expectation",
        "use",
        "resource",
        "therefore",
        "world",
        "without",
        "huge",
        "productivity",
        "gain",
        "come",
        "stabilizing",
        "expectation",
        "hence",
        "level",
        "assistance",
        "entailed",
        "libertarian",
        "right",
        "welfare",
        "likely",
        "general",
        "fall",
        "well",
        "short",
        "needed",
        "ensure",
        "people",
        "capability",
        "minimally",
        "decent",
        "life",
        "society",
        "secondly",
        "important",
        "recall",
        "wi",
        "almost",
        "certainly",
        "vary",
        "across",
        "people",
        "according",
        "nature",
        "personal",
        "selfowned",
        "capacity",
        "born",
        "good",
        "endowment",
        "productively",
        "applicable",
        "talent",
        "obviously",
        "fare",
        "better",
        "state",
        "nature",
        "external",
        "resource",
        "remain",
        "unowned",
        "example",
        "born",
        "capacity",
        "make",
        "harder",
        "engage",
        "production",
        "case",
        "latter",
        "wi",
        "may",
        "close",
        "zerozero",
        "denoting",
        "outcome",
        "starving",
        "death",
        "state",
        "nature",
        "thus",
        "people",
        "happen",
        "unfortunate",
        "enough",
        "starving",
        "death",
        "realworld",
        "private",
        "property",
        "right",
        "regime",
        "may",
        "well",
        "claim",
        "assistance",
        "libertarian",
        "right",
        "welfare",
        "right",
        "demand",
        "prevented",
        "starving",
        "would",
        "happen",
        "baseline",
        "world",
        "external",
        "resource",
        "remain",
        "unowned",
        "may",
        "conclude",
        "libertarianism",
        "give",
        "contingent",
        "weak",
        "support",
        "enactment",
        "social",
        "minimum",
        "indeed",
        "except",
        "rare",
        "instance",
        "libertarianism",
        "implies",
        "enactment",
        "full",
        "social",
        "minimum",
        "unjust"
    ]
}