{
    "main_text": "Naturalizing Social Construction || Construction, Human Kinds and Human Traits\n3.2 Construction, Human Kinds and Human Traits\n\nAny sort of human trait could be an object of social construction, but\nmany of the most interesting and contested cases are ones in which\nclusters of traits—traits that comprise human kinds—are\npurported to co-occur and to correlate with mental states, including\ndispositions to think and behave in particular\n ways.[11]\n\n\nBecause discussion of kinds of persons with dispositions to think and\nbehave quickly gives rise to other questions about freedom of the will\nand social regulation, debates over constructionism about kinds are\ncentral to social and political debates regarding human\ncategorization, including debates over sex and gender, race, emotions,\nhetero- and homo-sexuality, mental illness, and disability. Since the\nconstructionist strategy explains a trait by appeal to highly\ncontingent factors (including culture), partisans of these debates\noften come inquire whether a trait or cluster of traits is culturally\nspecific, or can be found across cultures.\n3.2.1 The Conceptual Project\n\nThese issues can quickly come to generate more heat than light, and so\none role that philosophers in general, and naturalists in particular,\nhave played is to carefully analyze constructionist positions and\ntheir alternatives. For example, in reflecting on debates over\ncultural specificity or universality, a number of commentators have\nnoted that constructionist claims of cultural specificity often hinge\nnot on genuine empirical disagreement about what is or is not found\nthrough history and across cultures, but also on a strategy of\nindividuating the phenomena in question in ways that do or do\nnot involve contextual features that vary across cultures (Mallon and\nStich 2000; Boghossian 2006, 28; Pinker 2003, 38).\n\nPhilosophers have also distinguished claims of social construction\nfrom the possibility of cultural control (Mallon 2007a, Stein 1999),\ndisentangled claims of social construction from claims of\nvoluntariness and nonessentialism (Stein 1999), set out alternate\nforms of constructionism or anti-constructionism (Griffiths 1997,\nMallon 2007c, Andreasen 1998), disentangled questions regarding the\nneural basis of a human kind from the innate/constructed dichotomy\n(Murphy 2006, Ch. 7) and so forth.\n\nThis conceptual project is a philosophical project par\nexcellence, and it has contributed a great deal to clarifying\njust what conceptual and empirical issues are at stake in\nconstructionist work.\n3.2.2 Explaining the Development and Distribution of Human Traits\n\nNaturalist interpretations of constructionism have also taken up the\ndistinct, open-ended, empirical project of defending substantive\nclaims regarding the development and distribution of human traits via\nthe suggestions that human socio-linguistic behaviors shape human\ntraits (including behavior) via different avenues, both developmental\nand situational.\n\nOne “social role” family of theories emphasizes the way\nthat our socio-linguistic practices produce social roles that\nstructure and shape human life and behavior. Perhaps the most\ninfluential philosophical project in this area has been Ian\nHacking’s work on “making up people” (1986, 1992,\n1995a, 1995b, 1998). In a series of papers and books, Hacking argues\nthat the creation and promulgation of bureaucratic, technical, and\nmedical classifications like “child abuse,”\n“multiple personality disorder,” and “fugue”\ncreate “new ways to be a person” (1995b, p. 239). The idea\nis that the conception of a certain kind of person shapes both a\nwidespread social response (e.g. one that exculpates and perhaps\nencourages kind-typical behaviors), while at the same time, the\nconception shapes individual “performances” of the\nbehavior in question (by suggesting highly specific avenues of\nbehavior). On Hacking’s model, one he calls “the looping\neffect of human kinds,” the conception of the behavior may be\npart of an epistemic project of understanding a human kind that in\nturn gives rise to the clusters of traits that the theory represents\n(thereby providing epistemic support for the\n conception).[12]\n Much of Hacking’s own recent work has been aimed at providing\ndetailed historical and cultural evidence that suggests that looping\neffects really are a feature of (at least modern) human social life,\ne.g. for the American epidemic of multiple personality disorder that\nstarted in the 1980s (Hacking 1995) or the European epidemic of fugue\nin the late nineteenth century (Hacking 1998). Hacking makes further\nclaims about the “looping effect,” for example, that\nlooping effects mark “a cardinal difference between the\ntraditional natural and social sciences” because “the\ntargets of the natural sciences are stationary” while “the\ntargets of the social sciences are on the move” (1999, 108)\n),claims that themselves have spurred lively discussions over the\nnature of looping effects (e.g. Cooper 2004, Laimann forthcoming) and of their\nmechanisms in human groups (e.g. Mallon 2016, Kuorikoski and\nPöyhönen 2012).\n\nOthers have drawn on Hacking’s account to offer similar accounts\nof constructed kinds of person, including K. Anthony Appiah (1996) on\nracial identities, and Paul Griffiths (1997) on performed emotional\nsyndromes. Together with Hacking’s work, these accounts provide\npartial, causal interpretation of even quite radical claims about\nkinds of person. For example, Judith Butler has provocatively claimed\nthat the sex-differentiated behavior is a performance, writing,\n“That the gendered body is performative suggests that it has no\nontological status apart from the various acts which constitute its\nreality. … In other words, acts and gestures, articulated and\nenacted desires create the illusion of an interior and organizing\ngender core…” (1990, 136). Following on the work of\nHacking, Appiah, Griffiths, and others, we can naturalistically\n(re)interpret Butler’s claim as one that explains gender\ndifferences in actions, gestures, desires, and so on by reference to\nthe social role that a person occupies. Such a causal model of the way\nin which social roles might shape behavior is at least arguably\nnaturalistic in all of the above senses.\n\nThis “social role project” amounts to only one way of\ndeveloping constructionist ideas in the service of explaining the\ndevelopment of human kinds, traits, or behaviors. For example,\nconstructionist ideas find diverse manifestations in the theory of\nemotions (e.g. Armon-Jones 1986, Barrett 2017, Harré 1986, cf.\nGriffiths 1997 and Prinz 2004 for discussion). Because social\nconstructionism offers a general set of explanatory approaches,\nconstructionist approaches can be expected to reemerge in a variety of\nways in the attempt to explain a wide range of human phenomena. \n3.2.3 Formal Approaches to the Social Construction of Kinds \n\nStill a different way of developing naturalistic constructionist\naccounts of kinds involves using various formal methods to model such\nkinds. Among recent work in social ontology, Francesco Guala has\ndistinguished “rules-based” approaches to social\ninstitutions from “equilibrium-based” approaches (2016,\nxxv). The former attempts to understand social structure as emerging\nfrom the collective adoption of rules, while the latter sees it as\nemerging along with various solutions to coordination and cooperation\nproblems. As an example of the former, Searle (1995) influentially\nargues that we can understand social institutions as brought into\nbeing by collective endorsement of rules of the form:\n\nX counts as Y in C.\n\n\nHere, “X” is a specification of the individual or\ntype to which the status “Y” applies. And\n“C” specifies the context in which this imposition\noccurs. For instance, it might specify that tokens of a certain type\nproduced by the U.S. mint count as money in the United States. Such\nstatuses obtain in virtue of collective acceptance of one or more\nstatus functions. (See the entry on\n social ontology.)\n \n\nIn contrast, the latter family of approaches attempts to understand\nsocial structure by using the tools of economic and evolutionary game\ntheory to understand culture (e.g. Bicchieri 2006, 2016; Guala 2016;\nO’Connor 2017). Here, norms, behaviors, and social regularities\nare seen as produced and stabilized by the preferences of individual\nactors making decisions in a social context of other actors. For\nexample, Richard McElreath, Robert Boyd, and Peter Richerson (2003)\nhave argued that ethnic-group based “markers” (e.g. things\nlike styles of dress or other indicators of membership in an ethnic\ngroup) culturally evolved because they allowed actors to\ndifferentially interact with those who shared common norms, thus\nreaping the benefits of coordination and cooperation with greater\nefficiency.\n\nWhile rules-based approaches have been much discussed across a range\nof philosophical fields (including metaphysics, social philosophy,\nempirically-informed philosophy of mind), equilibrium-based approaches\nhave so far received comparatively little philosophical attention.\n3.2.4 Human Kinds and Normativity\n\nMany constructionist projects concerning human kinds are, or are\npursued as part of, normative projects. Thinkers interested in gender,\nrace, mental illness and disability, are often motivated not only by\nconcern with the metaphysics of these categories, but with questions\nof social morality and justice that connect with them. For instance,\nSally Haslanger’s work on the construction of gender and race\n(Haslanger 2012), or Elizabeth Barnes’s (2016) constructionist\naccount of disability seem to essentially incorporate normative\nconcepts. This connection, in turn, raises a number of further\nquestions about why they are connected, and how we ought to understand\ntheir relationship.\n\nOne answer to these questions is simply that, once we understand the\nconstructed nature of some category or phenomena, different normative\nconclusions will follow. For instance, some have emphasized that\nbecause constructionist explanations highlight the role of agents in\nthe production or the sustenance of phenomena, they make those agents\nsubject to moral evaluation (Kukla 2000; Mallon 2016,\nforthcoming).\n\nA different approach might be that normative considerations ought to\ndrive us towards certain metaphysical explanations. For instance, Esa\nDiaz-Leon (2015) has argued that constitutive constructionist\nexplanations are politically better than causal constructionist ones,\non the grounds that constitutive constructions are more tightly\nconnected to our socio-conceptual practices:\n\nrevealing the constitutive connections between instantiating a certain\ncategory and standing in a certain relation to certain social\npractices, opens a clear path for social change: just change those\nsocial practices, and social change will automatically follow. (2015,\n1145)\n\n\nIn contrast, Theresa Marques (2017) has argued that a focus on causal\nsocial construction is more relevant to projects of social justice.\nBut if we see constructionism as a kind of explanation, then this\ndebate can seem to put the cart before the horse. The correctness of\nan explanation is given by some facts in the world. Deciding what we\nwould like those facts to be, given our aims, seems to fail to\nappreciate the reality of our socio-conceptual practices and their\nconsequences.\n\nMore generally, while normative constructionist projects can be deeply\nengaged with our best scientific understanding, many naturalists will\nbe tempted to attempt to distinguish descriptive and normative\nelements in order to engage them separately.\n\nAt the same time, ongoing naturalist work on human cooperation and\ncoordination suggests the future possibility of more thoroughgoing\nnaturalist approaches to construction that integrate naturalistic\napproaches to norms and normativity (e.g., Bicchieri 2016, Sripada\n2006, and the entry on\n social norms)\n with accounts of the human kinds that our socio-conceptual behaviors\nstructure and shape.\n",
    "section_title": "3.2 Construction, Human Kinds and Human Traits",
    "entry_title": "Naturalistic Approaches to Social Construction",
    "hierarchy_title": "Naturalistic Approaches to Social Construction || Naturalizing Social Construction || Construction, Human Kinds and Human Traits",
    "tokenized_text": [
        "naturalizing",
        "social",
        "construction",
        "construction",
        "human",
        "kind",
        "human",
        "trait",
        "construction",
        "human",
        "kind",
        "human",
        "trait",
        "sort",
        "human",
        "trait",
        "could",
        "object",
        "social",
        "construction",
        "many",
        "interesting",
        "contested",
        "case",
        "one",
        "cluster",
        "traitstraits",
        "comprise",
        "human",
        "kindsare",
        "purported",
        "cooccur",
        "correlate",
        "mental",
        "state",
        "including",
        "disposition",
        "think",
        "behave",
        "particular",
        "way",
        "discussion",
        "kind",
        "person",
        "disposition",
        "think",
        "behave",
        "quickly",
        "give",
        "rise",
        "question",
        "freedom",
        "social",
        "regulation",
        "debate",
        "constructionism",
        "kind",
        "central",
        "social",
        "political",
        "debate",
        "regarding",
        "human",
        "categorization",
        "including",
        "debate",
        "sex",
        "gender",
        "race",
        "emotion",
        "hetero",
        "homosexuality",
        "mental",
        "illness",
        "disability",
        "since",
        "constructionist",
        "strategy",
        "explains",
        "trait",
        "appeal",
        "highly",
        "contingent",
        "factor",
        "including",
        "culture",
        "partisan",
        "debate",
        "often",
        "come",
        "inquire",
        "whether",
        "trait",
        "cluster",
        "trait",
        "culturally",
        "specific",
        "found",
        "across",
        "culture",
        "conceptual",
        "project",
        "issue",
        "quickly",
        "come",
        "generate",
        "heat",
        "light",
        "one",
        "role",
        "philosopher",
        "general",
        "naturalist",
        "particular",
        "played",
        "carefully",
        "analyze",
        "constructionist",
        "position",
        "alternative",
        "example",
        "reflecting",
        "debate",
        "cultural",
        "specificity",
        "universality",
        "number",
        "commentator",
        "noted",
        "constructionist",
        "claim",
        "cultural",
        "specificity",
        "often",
        "hinge",
        "genuine",
        "empirical",
        "disagreement",
        "found",
        "history",
        "across",
        "culture",
        "also",
        "strategy",
        "individuating",
        "phenomenon",
        "question",
        "way",
        "involve",
        "contextual",
        "feature",
        "vary",
        "across",
        "culture",
        "mallon",
        "stich",
        "boghossian",
        "pinker",
        "philosopher",
        "also",
        "distinguished",
        "claim",
        "social",
        "construction",
        "possibility",
        "cultural",
        "control",
        "mallon",
        "a",
        "stein",
        "disentangled",
        "claim",
        "social",
        "construction",
        "claim",
        "voluntariness",
        "nonessentialism",
        "stein",
        "set",
        "alternate",
        "form",
        "constructionism",
        "anticonstructionism",
        "griffith",
        "mallon",
        "c",
        "andreasen",
        "disentangled",
        "question",
        "regarding",
        "neural",
        "basis",
        "human",
        "kind",
        "innateconstructed",
        "dichotomy",
        "murphy",
        "ch",
        "forth",
        "conceptual",
        "project",
        "philosophical",
        "project",
        "par",
        "excellence",
        "contributed",
        "great",
        "deal",
        "clarifying",
        "conceptual",
        "empirical",
        "issue",
        "stake",
        "constructionist",
        "work",
        "explaining",
        "development",
        "distribution",
        "human",
        "trait",
        "naturalist",
        "interpretation",
        "constructionism",
        "also",
        "taken",
        "distinct",
        "openended",
        "empirical",
        "project",
        "defending",
        "substantive",
        "claim",
        "regarding",
        "development",
        "distribution",
        "human",
        "trait",
        "via",
        "suggestion",
        "human",
        "sociolinguistic",
        "behavior",
        "shape",
        "human",
        "trait",
        "including",
        "behavior",
        "via",
        "different",
        "avenue",
        "developmental",
        "situational",
        "one",
        "social",
        "role",
        "family",
        "theory",
        "emphasizes",
        "way",
        "sociolinguistic",
        "practice",
        "produce",
        "social",
        "role",
        "structure",
        "shape",
        "human",
        "life",
        "behavior",
        "perhaps",
        "influential",
        "philosophical",
        "project",
        "area",
        "ian",
        "hacking",
        "work",
        "making",
        "people",
        "a",
        "b",
        "series",
        "paper",
        "book",
        "hacking",
        "argues",
        "creation",
        "promulgation",
        "bureaucratic",
        "technical",
        "medical",
        "classification",
        "like",
        "child",
        "abuse",
        "multiple",
        "personality",
        "disorder",
        "fugue",
        "create",
        "new",
        "way",
        "person",
        "b",
        "p",
        "idea",
        "conception",
        "certain",
        "kind",
        "person",
        "shape",
        "widespread",
        "social",
        "response",
        "eg",
        "one",
        "exculpates",
        "perhaps",
        "encourages",
        "kindtypical",
        "behavior",
        "time",
        "conception",
        "shape",
        "individual",
        "performance",
        "behavior",
        "question",
        "suggesting",
        "highly",
        "specific",
        "avenue",
        "behavior",
        "hacking",
        "model",
        "one",
        "call",
        "looping",
        "effect",
        "human",
        "kind",
        "conception",
        "behavior",
        "may",
        "part",
        "epistemic",
        "project",
        "understanding",
        "human",
        "kind",
        "turn",
        "give",
        "rise",
        "cluster",
        "trait",
        "theory",
        "represents",
        "thereby",
        "providing",
        "epistemic",
        "support",
        "conception",
        "much",
        "hacking",
        "recent",
        "work",
        "aimed",
        "providing",
        "detailed",
        "historical",
        "cultural",
        "evidence",
        "suggests",
        "looping",
        "effect",
        "really",
        "feature",
        "least",
        "modern",
        "human",
        "social",
        "life",
        "eg",
        "american",
        "epidemic",
        "multiple",
        "personality",
        "disorder",
        "started",
        "s",
        "hacking",
        "european",
        "epidemic",
        "fugue",
        "late",
        "nineteenth",
        "century",
        "hacking",
        "hacking",
        "make",
        "claim",
        "looping",
        "effect",
        "example",
        "looping",
        "effect",
        "mark",
        "cardinal",
        "difference",
        "traditional",
        "natural",
        "social",
        "science",
        "target",
        "natural",
        "science",
        "stationary",
        "target",
        "social",
        "science",
        "move",
        "claim",
        "spurred",
        "lively",
        "discussion",
        "nature",
        "looping",
        "effect",
        "eg",
        "cooper",
        "laimann",
        "forthcoming",
        "mechanism",
        "human",
        "group",
        "eg",
        "mallon",
        "kuorikoski",
        "pöyhönen",
        "others",
        "drawn",
        "hacking",
        "account",
        "offer",
        "similar",
        "account",
        "constructed",
        "kind",
        "person",
        "including",
        "k",
        "anthony",
        "appiah",
        "racial",
        "identity",
        "paul",
        "griffith",
        "performed",
        "emotional",
        "syndrome",
        "together",
        "hacking",
        "work",
        "account",
        "provide",
        "partial",
        "causal",
        "interpretation",
        "even",
        "quite",
        "radical",
        "claim",
        "kind",
        "person",
        "example",
        "judith",
        "butler",
        "provocatively",
        "claimed",
        "sexdifferentiated",
        "behavior",
        "performance",
        "writing",
        "gendered",
        "body",
        "performative",
        "suggests",
        "ontological",
        "status",
        "apart",
        "various",
        "act",
        "constitute",
        "reality",
        "word",
        "act",
        "gesture",
        "articulated",
        "enacted",
        "desire",
        "create",
        "illusion",
        "interior",
        "organizing",
        "gender",
        "core",
        "following",
        "work",
        "hacking",
        "appiah",
        "griffith",
        "others",
        "naturalistically",
        "interpret",
        "butler",
        "claim",
        "one",
        "explains",
        "gender",
        "difference",
        "action",
        "gesture",
        "desire",
        "reference",
        "social",
        "role",
        "person",
        "occupies",
        "causal",
        "model",
        "way",
        "social",
        "role",
        "might",
        "shape",
        "behavior",
        "least",
        "arguably",
        "naturalistic",
        "sens",
        "social",
        "role",
        "project",
        "amount",
        "one",
        "way",
        "developing",
        "constructionist",
        "idea",
        "service",
        "explaining",
        "development",
        "human",
        "kind",
        "trait",
        "behavior",
        "example",
        "constructionist",
        "idea",
        "find",
        "diverse",
        "manifestation",
        "theory",
        "emotion",
        "eg",
        "armonjones",
        "barrett",
        "harré",
        "cf",
        "griffith",
        "prinz",
        "discussion",
        "social",
        "constructionism",
        "offer",
        "general",
        "set",
        "explanatory",
        "approach",
        "constructionist",
        "approach",
        "expected",
        "reemerge",
        "variety",
        "way",
        "attempt",
        "explain",
        "wide",
        "range",
        "human",
        "phenomenon",
        "formal",
        "approach",
        "social",
        "construction",
        "kind",
        "still",
        "different",
        "way",
        "developing",
        "naturalistic",
        "constructionist",
        "account",
        "kind",
        "involves",
        "using",
        "various",
        "formal",
        "method",
        "model",
        "kind",
        "among",
        "recent",
        "work",
        "social",
        "ontology",
        "francesco",
        "guala",
        "distinguished",
        "rulesbased",
        "approach",
        "social",
        "institution",
        "equilibriumbased",
        "approach",
        "xxv",
        "former",
        "attempt",
        "understand",
        "social",
        "structure",
        "emerging",
        "collective",
        "adoption",
        "rule",
        "latter",
        "see",
        "emerging",
        "along",
        "various",
        "solution",
        "coordination",
        "cooperation",
        "problem",
        "example",
        "former",
        "searle",
        "influentially",
        "argues",
        "understand",
        "social",
        "institution",
        "brought",
        "collective",
        "endorsement",
        "rule",
        "form",
        "x",
        "count",
        "c",
        "x",
        "specification",
        "individual",
        "type",
        "status",
        "applies",
        "c",
        "specifies",
        "context",
        "imposition",
        "occurs",
        "instance",
        "might",
        "specify",
        "token",
        "certain",
        "type",
        "produced",
        "us",
        "mint",
        "count",
        "money",
        "united",
        "state",
        "status",
        "obtain",
        "virtue",
        "collective",
        "acceptance",
        "one",
        "status",
        "function",
        "see",
        "entry",
        "social",
        "ontology",
        "contrast",
        "latter",
        "family",
        "approach",
        "attempt",
        "understand",
        "social",
        "structure",
        "using",
        "tool",
        "economic",
        "evolutionary",
        "game",
        "theory",
        "understand",
        "culture",
        "eg",
        "bicchieri",
        "guala",
        "connor",
        "norm",
        "behavior",
        "social",
        "regularity",
        "seen",
        "produced",
        "stabilized",
        "preference",
        "individual",
        "actor",
        "making",
        "decision",
        "social",
        "context",
        "actor",
        "example",
        "richard",
        "mcelreath",
        "robert",
        "boyd",
        "peter",
        "richerson",
        "argued",
        "ethnicgroup",
        "based",
        "marker",
        "eg",
        "thing",
        "like",
        "style",
        "dress",
        "indicator",
        "membership",
        "ethnic",
        "group",
        "culturally",
        "evolved",
        "allowed",
        "actor",
        "differentially",
        "interact",
        "shared",
        "common",
        "norm",
        "thus",
        "reaping",
        "benefit",
        "coordination",
        "cooperation",
        "greater",
        "efficiency",
        "rulesbased",
        "approach",
        "much",
        "discussed",
        "across",
        "range",
        "philosophical",
        "field",
        "including",
        "metaphysics",
        "social",
        "philosophy",
        "empiricallyinformed",
        "philosophy",
        "mind",
        "equilibriumbased",
        "approach",
        "far",
        "received",
        "comparatively",
        "little",
        "philosophical",
        "attention",
        "human",
        "kind",
        "normativity",
        "many",
        "constructionist",
        "project",
        "concerning",
        "human",
        "kind",
        "pursued",
        "part",
        "normative",
        "project",
        "thinker",
        "interested",
        "gender",
        "race",
        "mental",
        "illness",
        "disability",
        "often",
        "motivated",
        "concern",
        "metaphysics",
        "category",
        "question",
        "social",
        "morality",
        "justice",
        "connect",
        "instance",
        "sally",
        "haslanger",
        "work",
        "construction",
        "gender",
        "race",
        "haslanger",
        "elizabeth",
        "barnes",
        "constructionist",
        "account",
        "disability",
        "seem",
        "essentially",
        "incorporate",
        "normative",
        "concept",
        "connection",
        "turn",
        "raise",
        "number",
        "question",
        "connected",
        "ought",
        "understand",
        "relationship",
        "one",
        "answer",
        "question",
        "simply",
        "understand",
        "constructed",
        "nature",
        "category",
        "phenomenon",
        "different",
        "normative",
        "conclusion",
        "follow",
        "instance",
        "emphasized",
        "constructionist",
        "explanation",
        "highlight",
        "role",
        "agent",
        "production",
        "sustenance",
        "phenomenon",
        "make",
        "agent",
        "subject",
        "moral",
        "evaluation",
        "kukla",
        "mallon",
        "forthcoming",
        "different",
        "approach",
        "might",
        "normative",
        "consideration",
        "ought",
        "drive",
        "u",
        "towards",
        "certain",
        "metaphysical",
        "explanation",
        "instance",
        "esa",
        "diazleon",
        "argued",
        "constitutive",
        "constructionist",
        "explanation",
        "politically",
        "better",
        "causal",
        "constructionist",
        "one",
        "ground",
        "constitutive",
        "construction",
        "tightly",
        "connected",
        "socioconceptual",
        "practice",
        "revealing",
        "constitutive",
        "connection",
        "instantiating",
        "certain",
        "category",
        "standing",
        "certain",
        "relation",
        "certain",
        "social",
        "practice",
        "open",
        "clear",
        "path",
        "social",
        "change",
        "change",
        "social",
        "practice",
        "social",
        "change",
        "automatically",
        "follow",
        "contrast",
        "theresa",
        "marque",
        "argued",
        "focus",
        "causal",
        "social",
        "construction",
        "relevant",
        "project",
        "social",
        "justice",
        "see",
        "constructionism",
        "kind",
        "explanation",
        "debate",
        "seem",
        "put",
        "cart",
        "horse",
        "correctness",
        "explanation",
        "given",
        "fact",
        "world",
        "deciding",
        "would",
        "like",
        "fact",
        "given",
        "aim",
        "seems",
        "fail",
        "appreciate",
        "reality",
        "socioconceptual",
        "practice",
        "consequence",
        "generally",
        "normative",
        "constructionist",
        "project",
        "deeply",
        "engaged",
        "best",
        "scientific",
        "understanding",
        "many",
        "naturalist",
        "tempted",
        "attempt",
        "distinguish",
        "descriptive",
        "normative",
        "element",
        "order",
        "engage",
        "separately",
        "time",
        "ongoing",
        "naturalist",
        "work",
        "human",
        "cooperation",
        "coordination",
        "suggests",
        "future",
        "possibility",
        "thoroughgoing",
        "naturalist",
        "approach",
        "construction",
        "integrate",
        "naturalistic",
        "approach",
        "norm",
        "normativity",
        "eg",
        "bicchieri",
        "sripada",
        "entry",
        "social",
        "norm",
        "account",
        "human",
        "kind",
        "socioconceptual",
        "behavior",
        "structure",
        "shape"
    ]
}