{
    "main_text": "What can be said against the enactment of a social minimum? || The legitimacy objection\n3.3 The legitimacy objection\n\nA third objection to the enactment of a social minimum appeals to the\nvalue of legitimacy. A law or policy lacks legitimacy when the law or\npolicy is arbitrary in the eyes of those bound by the law or\npolicy—that is, they are not given a sufficiently good and\naccessible reason to justify their subjection to this law or policy.\nThe absence of legitimacy signals a kind of alienation from the law or\npolicy, so that people are unable to identify with it as an expression\nof what they value and believe. Critics might argue that the\nestablishment of a social minimum policy regime creates distinctive\nproblems of legitimacy for a society; and they might further argue\nthat these problems make it undesirable, all things considered, to\nenact a social minimum. How might enactment of a social minimum\ngenerate problems of legitimacy? How can these problems be tackled? Do\nthe problems really discredit the case for enactment?\n\nOne potential legitimacy problem is the capability-list\nproblem that we noted above in section\n 1.2.\n To say what kind and level of resources are necessary for people to\nbe able to lead “a minimally decent life in one’s\nsociety”, we must take a view about the functionings and\ncapabilities that are constitutive of a decent human life, and any\nsuch view is bound to be somewhat controversial, perhaps especially if\nwe are trying to define a social minimum transnationally or globally.\nSome people might not accept the capability-list used to determine the\nsocial minimum as the right list. We shall return briefly to this\nproblem towards the end of this section, but only after first give\nsome consideration to a second potential legitimacy problem which we\nalso briefly noted in section\n 1.1:\n the limit-setting problem. To recall the problem, consider\nonce again item (2) on Nussbaum’s list of “central human\nfunctional capabilities”, as set out in section\n 1.2,\n the capability for bodily health. What kind and level of access to\nhealth-care resources must a society secure for its members for us to\nsay that this capability is satisfied to an extent that allows\neveryone to lead “a minimally decent life”? If we hold\nthat a society must ensure access to whatever health-care resources\nhave, say, a life-sustaining impact, then we may well be committing\nourselves to spending the vast bulk of a society’s resources just on\nhealth-care. At some point limits must be set, or else the health-care\nsector will devour the whole social product (making it impossible, of\ncourse, to provide for other key capabilities). But, on the other\nhand, how can limits be set in a way that is fair and has legitimacy\nin the eyes of the people who will have to live with the consequences\nof these limit-setting decisions? How is it possible for communities\nto decide whether or not a new, expensive health-care treatment is in\nor out of the social minimum, and for this decision to have legitimacy\nin the eyes of the citizens?\n\nThese questions invite us to consider explicitly the political\nprocesses through which limit-setting (and other) decisions are\nmade. It considers what features these processes must have if they are\nto treat all those bound by the decisions fairly, and in a way that\nall those concerned can regard as legitimate.\n\nIn the health-care context, the issue of limit-setting is explored in\nan important paper by Norman Daniels and James Sabin (Daniels and\nSabin 1997). Daniels and Sabin argue that for limit-setting decisions\nin this context to have legitimacy, the decision-making process must\nsatisfy four conditions (see Daniels and Sabin 1997: 322–325;\nalso Ham and Robert 2003: 2):\n\nPublicity. The rationales for limit-setting decisions\nmust be made public.\nReasonableness. The rationales for limit-setting\ndecisions should be reasonable; that is, they should appeal to reasons\nand principles that can be accepted as relevant by people who are\ndisposed to look for reasons and principles agreeable to all.\nContestability. There should be a mechanism through which\ndecisions can be challenged, with adequate opportunity to present new\narguments and evidence.\nEnforcement. There should be a mechanism for forcing the\nlimit-setting body to respect the first three conditions.\n\n\nThe idea is not that the people who are affected by a given\nlimit-setting decision will necessarily agree with this decision if\nthese conditions are met, e.g., agree with a decision to exclude a\nspecific medical treatment from the health-care package provided under\nthe social minimum policy regime. Rather, the idea is that all parties\nwill be able to regard the decision as legitimate, even if they\ndisagree with it and some of them continue to oppose it. The\nconditions of publicity and reasonableness work to ensure that a given\ndecision is grounded in reasons of a kind that affected parties can\nsee at least see as relevant. The contestability condition helps to\nensure that the reasonableness of the decision is robust, that all\nrelevant reasons and evidence have indeed been weighed by the\ndecision-making body in coming to its decision. In these\ncircumstances, even the person who “loses” in such a case\ncan feel assured that their interests and point of view have not been\noverruled arbitrarily. In this sense, they are fairly treated and the\ndecision ought to have, even in their eyes, legitimacy, even if they\ncontinue to think it mistaken and oppose it.\n\nThe implication of the foregoing analysis is that those who wish to\nenact a social minimum need to give serious thought to the\ninstitutional structures through which limit-setting decisions are\nmade, with an eye to seeing that the conditions of publicity,\nreasonableness, contestability, and enforcement are met. This applies\nnot only in relation to health-care, but in relation to all the\nprograms that governments must typically have as part of enacting a\nsocial minimum, such as cash transfer programs, educational services,\nand so on.\n\nMoreover, this concern for appropriate procedure should arguably\ninform not only our response to the limit-setting problem, but to the\ncapability-list problem that we noted above. In a society where there\nis broad, but not perfect, consensus in support of a Nussbaum-style\nlist of “central human functional capabilities”, the\nlegitimacy of the final capability-list used to help specify the\nsocial minimum can be enhanced by subjecting the formulation of the\nlist to a process that has the characteristics of publicity,\nreasonableness, and contestability noted above (see Sen 1999: 110;\nNussbaum 1999: 47–49, for comments along these\n lines).[9]\n A similar focus on the importance of fair procedure in the\nspecification of the social minimum policy package can be found in\nNancy Fraser’s work on the “politics of need\ninterpretation” (Fraser 1989, 1997), and in Amy Gutmann’s and\nDennis Thompson’s account of welfare state policy-making in a\n“deliberative democracy” (Gutmann and Thompson 1996). The\nuse of conditionality, discussed in the previous section, is perhaps a\nparticularly important area in which to make sure that policy-making\nprocedures have these qualities of publicity, reasonableness, and\ncontestability. In societies where there is significant background\ninjustice, it will be very important also to ensure adequate voice in\nthe decision-making process for those who suffer unjust\ndisadvantage.\n\nA further and key question for consideration here is whether the\nstandard processes of representative democracy are adequate to meet\nthe demands of publicity, reasonableness, and contestability, or\nwhether, to achieve decisions that have legitimacy, these processes\nneed to be supplemented by other kinds of institutions that are more\ndeliberative and inclusive of the people who stand to be bound by\nlimit-setting, capability-listing, and conditionality-defining\ndecisions. Interesting developments in this respect include:\n\n(1) use of citizens’ juries, deliberative opinion\npolls and Citizens’ Assemblies to assist with\ndecision-making (on which, see Fishkin 1995, Coote and Lenaghan 1998,\nSmith and Wales 2000, Fung 2003, Smith 2009);\n\n(2) Participatory Budgeting, which originated in Brazil in\nthe 1990s and has since been taken up (in various forms) around the\nworld (de Sousa Santos 2007, Wampler 2007, Baiocchi, Heller and Silva\n2011, Fung 2011); and,\n\n(3) village parliaments (gram sabhas) that are\nconstitutionally mandated in rural areas in India and which have\nhelped to empower poorer citizens to exercise more control over\nprovision of local public goods (Véron 2001, Parthasarathy and\nRao 2018, Parthasarathy, Rao and Palaniswamy 2019).\n\nIn view of the legitimacy problems discussed in this section, those\nwho support enactment of a social minimum should consider the\ncontribution of these and similar institutions in the specification\nand operation of social minimum policy regimes.\n",
    "section_title": "3.3 The legitimacy objection",
    "entry_title": "Social Minimum",
    "hierarchy_title": "Social Minimum || What can be said against the enactment of a social minimum? || The legitimacy objection",
    "tokenized_text": [
        "said",
        "enactment",
        "social",
        "minimum",
        "legitimacy",
        "objection",
        "legitimacy",
        "objection",
        "third",
        "objection",
        "enactment",
        "social",
        "minimum",
        "appeal",
        "value",
        "legitimacy",
        "law",
        "policy",
        "lack",
        "legitimacy",
        "law",
        "policy",
        "arbitrary",
        "eye",
        "bound",
        "law",
        "policythat",
        "given",
        "sufficiently",
        "good",
        "accessible",
        "reason",
        "justify",
        "subjection",
        "law",
        "policy",
        "absence",
        "legitimacy",
        "signal",
        "kind",
        "alienation",
        "law",
        "policy",
        "people",
        "unable",
        "identify",
        "expression",
        "value",
        "believe",
        "critic",
        "might",
        "argue",
        "establishment",
        "social",
        "minimum",
        "policy",
        "regime",
        "creates",
        "distinctive",
        "problem",
        "legitimacy",
        "society",
        "might",
        "argue",
        "problem",
        "make",
        "undesirable",
        "thing",
        "considered",
        "enact",
        "social",
        "minimum",
        "might",
        "enactment",
        "social",
        "minimum",
        "generate",
        "problem",
        "legitimacy",
        "problem",
        "tackled",
        "problem",
        "really",
        "discredit",
        "case",
        "enactment",
        "one",
        "potential",
        "legitimacy",
        "problem",
        "capabilitylist",
        "problem",
        "noted",
        "section",
        "say",
        "kind",
        "level",
        "resource",
        "necessary",
        "people",
        "able",
        "lead",
        "minimally",
        "decent",
        "life",
        "one",
        "society",
        "must",
        "take",
        "view",
        "functioning",
        "capability",
        "constitutive",
        "decent",
        "human",
        "life",
        "view",
        "bound",
        "somewhat",
        "controversial",
        "perhaps",
        "especially",
        "trying",
        "define",
        "social",
        "minimum",
        "transnationally",
        "globally",
        "people",
        "might",
        "accept",
        "capabilitylist",
        "used",
        "determine",
        "social",
        "minimum",
        "right",
        "list",
        "shall",
        "return",
        "briefly",
        "problem",
        "towards",
        "end",
        "section",
        "first",
        "give",
        "consideration",
        "second",
        "potential",
        "legitimacy",
        "problem",
        "also",
        "briefly",
        "noted",
        "section",
        "limitsetting",
        "problem",
        "recall",
        "problem",
        "consider",
        "item",
        "nussbaum",
        "list",
        "central",
        "human",
        "functional",
        "capability",
        "set",
        "section",
        "capability",
        "bodily",
        "health",
        "kind",
        "level",
        "access",
        "healthcare",
        "resource",
        "must",
        "society",
        "secure",
        "member",
        "u",
        "say",
        "capability",
        "satisfied",
        "extent",
        "allows",
        "everyone",
        "lead",
        "minimally",
        "decent",
        "life",
        "hold",
        "society",
        "must",
        "ensure",
        "access",
        "whatever",
        "healthcare",
        "resource",
        "say",
        "lifesustaining",
        "impact",
        "may",
        "well",
        "committing",
        "spending",
        "vast",
        "bulk",
        "society",
        "resource",
        "healthcare",
        "point",
        "limit",
        "must",
        "set",
        "else",
        "healthcare",
        "sector",
        "devour",
        "whole",
        "social",
        "product",
        "making",
        "impossible",
        "course",
        "provide",
        "key",
        "capability",
        "hand",
        "limit",
        "set",
        "way",
        "fair",
        "legitimacy",
        "eye",
        "people",
        "live",
        "consequence",
        "limitsetting",
        "decision",
        "possible",
        "community",
        "decide",
        "whether",
        "new",
        "expensive",
        "healthcare",
        "treatment",
        "social",
        "minimum",
        "decision",
        "legitimacy",
        "eye",
        "citizen",
        "question",
        "invite",
        "u",
        "consider",
        "explicitly",
        "political",
        "process",
        "limitsetting",
        "decision",
        "made",
        "considers",
        "feature",
        "process",
        "must",
        "treat",
        "bound",
        "decision",
        "fairly",
        "way",
        "concerned",
        "regard",
        "legitimate",
        "healthcare",
        "context",
        "issue",
        "limitsetting",
        "explored",
        "important",
        "paper",
        "norman",
        "daniel",
        "james",
        "sabin",
        "daniel",
        "sabin",
        "daniel",
        "sabin",
        "argue",
        "limitsetting",
        "decision",
        "context",
        "legitimacy",
        "decisionmaking",
        "process",
        "must",
        "satisfy",
        "four",
        "condition",
        "see",
        "daniel",
        "sabin",
        "also",
        "ham",
        "robert",
        "publicity",
        "rationale",
        "limitsetting",
        "decision",
        "must",
        "made",
        "public",
        "reasonableness",
        "rationale",
        "limitsetting",
        "decision",
        "reasonable",
        "appeal",
        "reason",
        "principle",
        "accepted",
        "relevant",
        "people",
        "disposed",
        "look",
        "reason",
        "principle",
        "agreeable",
        "contestability",
        "mechanism",
        "decision",
        "challenged",
        "adequate",
        "opportunity",
        "present",
        "new",
        "argument",
        "evidence",
        "enforcement",
        "mechanism",
        "forcing",
        "limitsetting",
        "body",
        "respect",
        "first",
        "three",
        "condition",
        "idea",
        "people",
        "affected",
        "given",
        "limitsetting",
        "decision",
        "necessarily",
        "agree",
        "decision",
        "condition",
        "met",
        "eg",
        "agree",
        "decision",
        "exclude",
        "specific",
        "medical",
        "treatment",
        "healthcare",
        "package",
        "provided",
        "social",
        "minimum",
        "policy",
        "regime",
        "rather",
        "idea",
        "party",
        "able",
        "regard",
        "decision",
        "legitimate",
        "even",
        "disagree",
        "continue",
        "oppose",
        "condition",
        "publicity",
        "reasonableness",
        "work",
        "ensure",
        "given",
        "decision",
        "grounded",
        "reason",
        "kind",
        "affected",
        "party",
        "see",
        "least",
        "see",
        "relevant",
        "contestability",
        "condition",
        "help",
        "ensure",
        "reasonableness",
        "decision",
        "robust",
        "relevant",
        "reason",
        "evidence",
        "indeed",
        "weighed",
        "decisionmaking",
        "body",
        "coming",
        "decision",
        "circumstance",
        "even",
        "person",
        "loses",
        "case",
        "feel",
        "assured",
        "interest",
        "point",
        "view",
        "overruled",
        "arbitrarily",
        "sense",
        "fairly",
        "treated",
        "decision",
        "ought",
        "even",
        "eye",
        "legitimacy",
        "even",
        "continue",
        "think",
        "mistaken",
        "oppose",
        "implication",
        "foregoing",
        "analysis",
        "wish",
        "enact",
        "social",
        "minimum",
        "need",
        "give",
        "serious",
        "thought",
        "institutional",
        "structure",
        "limitsetting",
        "decision",
        "made",
        "eye",
        "seeing",
        "condition",
        "publicity",
        "reasonableness",
        "contestability",
        "enforcement",
        "met",
        "applies",
        "relation",
        "healthcare",
        "relation",
        "program",
        "government",
        "must",
        "typically",
        "part",
        "enacting",
        "social",
        "minimum",
        "cash",
        "transfer",
        "program",
        "educational",
        "service",
        "moreover",
        "concern",
        "appropriate",
        "procedure",
        "arguably",
        "inform",
        "response",
        "limitsetting",
        "problem",
        "capabilitylist",
        "problem",
        "noted",
        "society",
        "broad",
        "perfect",
        "consensus",
        "support",
        "nussbaumstyle",
        "list",
        "central",
        "human",
        "functional",
        "capability",
        "legitimacy",
        "final",
        "capabilitylist",
        "used",
        "help",
        "specify",
        "social",
        "minimum",
        "enhanced",
        "subjecting",
        "formulation",
        "list",
        "process",
        "characteristic",
        "publicity",
        "reasonableness",
        "contestability",
        "noted",
        "see",
        "sen",
        "nussbaum",
        "comment",
        "along",
        "line",
        "similar",
        "focus",
        "importance",
        "fair",
        "procedure",
        "specification",
        "social",
        "minimum",
        "policy",
        "package",
        "found",
        "nancy",
        "fraser",
        "work",
        "politics",
        "need",
        "interpretation",
        "fraser",
        "amy",
        "gutmann",
        "dennis",
        "thompson",
        "account",
        "welfare",
        "state",
        "policymaking",
        "deliberative",
        "democracy",
        "gutmann",
        "thompson",
        "use",
        "conditionality",
        "discussed",
        "previous",
        "section",
        "perhaps",
        "particularly",
        "important",
        "area",
        "make",
        "sure",
        "policymaking",
        "procedure",
        "quality",
        "publicity",
        "reasonableness",
        "contestability",
        "society",
        "significant",
        "background",
        "injustice",
        "important",
        "also",
        "ensure",
        "adequate",
        "voice",
        "decisionmaking",
        "process",
        "suffer",
        "unjust",
        "disadvantage",
        "key",
        "question",
        "consideration",
        "whether",
        "standard",
        "process",
        "representative",
        "democracy",
        "adequate",
        "meet",
        "demand",
        "publicity",
        "reasonableness",
        "contestability",
        "whether",
        "achieve",
        "decision",
        "legitimacy",
        "process",
        "need",
        "supplemented",
        "kind",
        "institution",
        "deliberative",
        "inclusive",
        "people",
        "stand",
        "bound",
        "limitsetting",
        "capabilitylisting",
        "conditionalitydefining",
        "decision",
        "interesting",
        "development",
        "respect",
        "include",
        "use",
        "citizen",
        "jury",
        "deliberative",
        "opinion",
        "poll",
        "citizen",
        "assembly",
        "assist",
        "decisionmaking",
        "see",
        "fishkin",
        "coote",
        "lenaghan",
        "smith",
        "wale",
        "fung",
        "smith",
        "participatory",
        "budgeting",
        "originated",
        "brazil",
        "s",
        "since",
        "taken",
        "various",
        "form",
        "around",
        "world",
        "de",
        "sousa",
        "santos",
        "wampler",
        "baiocchi",
        "heller",
        "silva",
        "fung",
        "village",
        "parliament",
        "gram",
        "sabhas",
        "constitutionally",
        "mandated",
        "rural",
        "area",
        "india",
        "helped",
        "empower",
        "poorer",
        "citizen",
        "exercise",
        "control",
        "provision",
        "local",
        "public",
        "good",
        "véron",
        "parthasarathy",
        "rao",
        "parthasarathy",
        "rao",
        "palaniswamy",
        "view",
        "legitimacy",
        "problem",
        "discussed",
        "section",
        "support",
        "enactment",
        "social",
        "minimum",
        "consider",
        "contribution",
        "similar",
        "institution",
        "specification",
        "operation",
        "social",
        "minimum",
        "policy",
        "regime"
    ]
}