{
    "main_text": "Early Theories: Social Identity\n3. Early Theories: Social Identity\n\nIt has been argued that behavior is often closely embedded in a\nnetwork of personal relations, and that a theory of norms should not\nleave the specific social context out of consideration (Granovetter\n1985). Critics of the socialized actor theory have called for an\nalternative conception of norms that may account for the often weak\nrelation between beliefs and behavior (Deutscher 1973). This\nalternative approach takes social relations to be crucial in\nexplaining social action, and considers social identity as a key\nmotivating factor. (A strong support for this view among\nanthropologists is to be found in the work of Cancian 1975.)\n\nSince the notion of social identity is inextricably linked to that of\ngroup behavior, it is important to clarify the relation between these\nconcepts. By “social identity” we refer, in Tajfel’s\nown words, to\n\n\nthat part of an individual’s self-concept which derives from his\nknowledge of his membership of a social group (or groups) together\nwith the value and emotional significance attached to that membership.\n(Tajfel 1981: 255)\n\n\nNote that a crucial feature of social identity is that one’s\nidentification with the group is in some sense a conscious choice: one\nmay accidentally belong to a group, but we can meaningfully talk of\nsocial identification only when being a group-member becomes (at least\nin part) constitutive of who one is. According to Tajfel’s\ntheory, when we categorize ourselves as belonging to a particular\ngroup, the perception and definition of the self—as well as our\nmotives—change. That is, we start perceiving ourselves and our\nfellow group-members along impersonal, “typical”\ndimensions that characterize the group to which we belong. Such\ndimensions include specific roles and the beliefs (or actions) that\naccompany them.\n\nTurner et al.’s (1987) “self-categorization theory”\nprovides a more specific characterization of self-perception, or\nself-definition, as a system of cognitive self-schemata that filter\nand process information. Such schemata result in a representation of\nthe social situation that guides the choice of appropriate action.\nThis system has at least two major components, i.e., social and\npersonal identity. Social identity refers to self-descriptions related\nto group memberships. Personal identity refers to self-descriptions\nsuch as individual character traits, abilities, and tastes. Although\npersonal and social identities are mutually exclusive levels of\nself-definition, this distinction must be taken as an approximation\n(in that there are many interconnections between social and personal\nidentities). It is, however, important to recognize that we often\nperceive ourselves primarily in terms of our relevant group\nmemberships rather than as differentiated, unique individuals.\nSo—depending on the situation—personal or group identity\nwill become salient (Brewer 1991).\n\nFor example, when one makes interpersonal comparisons between oneself\nand other group-members, personal identity will become salient;\ninstead, group identity will become salient in situations in which\none’s group is compared to another group. Within a group, all\nthose factors that lead members to categorize themselves as different\n(or endowed with special characteristics and traits) will enhance\npersonal identity. If a group has to solve a common task, but each\nmember is to be rewarded according to her contribution, personal\nabilities are highlighted and individuals will perceive themselves as\nunique and different from the rest of the group. Conversely, if all\ngroup-members are to equally share the reward for a jointly performed\ntask, group identification will be enhanced. When the difference\nbetween self and fellow group-members is accentuated, we are likely to\nobserve selfish motives and self-favoritism against other\ngroup-members. When instead group identification is enhanced, in-group\nfavoritism against out-group members will be activated, as well as\nbehavior contrary to self-interest.\n\nAccording to Turner, social identity is basically a cognitive\nmechanism whose adaptive function is to make “group\nbehavior” possible. Whenever social identification becomes\nsalient, a cognitive mechanism of categorization is activated in such\na way to produce perceptual and behavioral changes. Such\ncategorization is called a stereotype, the prototypical description of\nwhat members of a given category are (or are believed to be). It is a\ncluster of physical, mental and psychological characteristics\nattributed to a “typical” member of a given group.\nStereotyping, like any other categorization process, activates scripts\nor schemata, and what we call group behavior is nothing but scripted\nbehavior. For example, the category “Asian student” is\nassociated with a cluster of behaviors, personality traits, and\nvalues: we often think of Asian students as respectful, diligent,\ndisciplined, and especially good with technical subjects. When\nthinking of an Asian student solely in terms of group membership, we\nattribute her the stereotypical characteristics associated with her\ngroup, so she becomes interchangeable with other group-members. When\nwe perceive people in terms of stereotypes, we depersonalize them and\nsee them as “typical” members of their group. The same\nprocess is at work when we perceive ourselves as group-members:\nself-stereotyping is a cognitive shift from “perceiving oneself\nas unique” to “perceiving oneself in terms of the\nattributes that characterize the group”. It is this cognitive\nshift that mediates group behavior.\n\nGroup behavior (as opposed to individual behavior) is characterized by\nfeatures such as a perceived similarity between group-members,\ncohesiveness, a tendency to cooperate to achieve common goals, shared\nattitudes or beliefs, and conformity to group norms. Once an\nindividual self-categorizes as member of a group, she will perceive\nherself as “depersonalized” and similar to other\ngroup-members in the relevant stereotypical dimensions. Insofar as\ngroup-members perceive their interests and goals as\nidentical—because such interests and goals are stereotypical\nattributes of the group—self-stereotyping will induce a\ngroup-member to embrace such interests and goals as her own. It is\nthus predicted that pro-social behavior will be enhanced by group\nmembership, and diluted when people act in an individualistic mode\n(Brewer 1979).\n\nThe groups with which we happen to identify ourselves may be very\nlarge (as in the case in which one self-defines as Muslim or French),\nor as small as a friends’ group. Some general group identities\nmay not involve specific norms, but there are many cases in which\ngroup identification and social norms are inextricably connected. In\nthat case group-members believe that certain patterns of behavior are\nunique to them, and use their distinctive norms to define\ngroup membership. Many close-knit groups (such as the Amish or the\nHasidic Jews) enforce norms of separation proscribing marriage with\noutsiders, as well as specific dress codes and a host of other\nprescriptive and proscriptive norms. There, once an individual\nperceives herself as a group-member, she will adhere to the group\nprototype and behave in accordance with it. Hogg and Turner (1987)\nhave called the process through which individuals come to conform to\ngroup norms “referent informational influence”.\n\nGroup-specific norms have (among other things) the twofold function of\nminimizing perceived differences among group-members and maximizing\ndifferences between the group and outsiders. Once formed, such norms\nbecome stable cognitive representations of appropriate behavior as a\ngroup-member. Social identity is built around group characteristics\nand behavioral standards, and hence any perceived lack of conformity\nto group norms is seen as a threat to the legitimacy of the group.\nSelf-categorization accentuates the similarities between one’s\nbehavior and that prescribed by the group norm, thus causing\nconformity as well as the disposition to control and punish\ntransgressors. In the social identity framework, group norms are\nobeyed because one identifies with the group, and conformity is\nmediated by self-categorization as an in-group member. A telling\nhistorical example of the relationship between norms and group\nmembership was the division of England into the two parties of the\nRoundheads and Cavaliers. Charles Mackay reports that\n\n\nin those days every species of vice and iniquity was thought by the\nPuritans to lurk in the long curly tresses of the monarchists, while\nthe latter imagined that their opponents were as destitute of wit, of\nwisdom, and of virtue, as they were of hair. A man’s locks were\na symbol of his creed, both in politics and religion. The more\nabundant the hair, the more scant the faith; and the balder the head,\nthe more sincere the piety. (Mackay 1841: 351)\n\n\nIt should be noted that in this framework social norms are defined by\ncollective—as opposed to personal—beliefs about\nappropriate behaviors (Homans 1950, 1961). To a certain extent, this\ncharacterization of social norms is closer to recent accounts than it\nis to Parsons’ socialized actor theory. On the other hand, a\ndistinct feature of the social identity framework is that\npeople’s motivation to conform comes from their desire to\nvalidate their identity as group-members. In short, there are several\nempirical predictions one can draw from such a framework. Given the\ntheory’s emphasis on identity as a motivating factor, conformity\nto a norm is not assumed to depend on an individual’s\ninternalization of that norm; in fact, a change in social status or\ngroup membership will bring about a change in the norms relevant to\nthe new status/group. Thus a new norm can be quickly adopted without\nmuch interaction, and beliefs about identity validation may change\nvery rapidly under the pressure of external circumstances. In this\ncase, not just norm compliance, but norms themselves are potentially\nunstable.\n\nThe experimental literature on social dilemmas has utilized the\n“priming of group identity” as a mechanism for promoting\ncooperative behavior (Dawes 1980; Brewer & Schneider 1990). The\ntypical hypothesis is that a pre-play, face-to-face communication\nstage may induce identification with the group, and thus promote\ncooperative behavior among group-members. In effect, rates of\ncooperation have been shown to be generally higher in social dilemma\nexperiments preceded by a pre-play communication stage (Dawes 1991).\nHowever, it has been argued that face-to-face communication may\nactually help group-members gather relevant information about one\nanother: such information may therefore induce subjects to trust each\nother’s promises and act cooperatively, regardless of any group\nidentification. In this respect, it has been shown that communication\nper se does not foster cooperation, unless subjects are allowed to\ntalk about relevant topics (Bicchieri & Lev-On 2007). This\nprovides support for the view that communication does not enhance\ncohesion but rather focuses subjects on relevant rules of behavior,\nwhich do not necessarily depend on group identification.\n\nCooperative outcomes can thus be explained without resorting to the\nconcept of social identity. A social identity explanation appears to\nbe more appropriate in the context of a relatively stable environment,\nwhere individuals have had time to make emotional investments (or at\nleast can expect repeated future interactions within the same group).\nIn artificial lab settings, where there are no expectations of future\ninteractions, the concept of social identity seems less persuasive as\nan explanation of the observed rates of cooperation. On the other\nhand, we note that social identity does appear to play a role in\nexperimental settings in which participants are divided into separate\ngroups. (In that case, it has been shown that participants categorize\nthe situation as “we versus them”, activating in-group\nloyalty and trust, and an equal degree of mistrust toward the\nout-group; Kramer & Brewer 1984; Bornstein & Ben-Yossef\n1994.)\n\nEven with stable environments and repeated interactions, however, a\ntheory of norm compliance in terms of social identity cannot avoid the\ndifficulty of making predictions when one is simultaneously committed\nto different identities. We may concurrently be workers, parents,\nspouses, friends, club members, and party affiliates, to name but a\nfew of the possible identities we embrace. For each of them there are\nrules that define what is appropriate, acceptable, or good behavior.\nIn the social identity framework, however, it is not clear what\nhappens when one is committed to different identities that may involve\nconflicting behaviors.\n\nFinally, there is ample evidence that people’s perceptions may\nchange very rapidly. Since in this framework norms are defined as\nshared perceptions about group beliefs, one would expect\nthat—whenever all members of a group happen to believe that\nothers have changed their beliefs about core membership\nrules—the very norms that define membership will change. The\nstudy of fashion, fads and speculative bubbles clearly shows that\nthere are some domains in which rapid (and possibly disruptive)\nchanges of collective expectations may occur; it is, however, much\nless clear what sort of norms are more likely to be subject to rapid\nchanges (think of dress codes rather than codes of honor). The social\nidentity view does not offer a theoretical framework for\ndifferentiating these cases: although some norms are indeed related to\ngroup membership, and thus compliance may be explained through\nidentity-validation mechanisms, there appear to be limits to the\nsocial identity explanation.\n",
    "section_title": "3. Early Theories: Social Identity",
    "entry_title": "Social Norms",
    "hierarchy_title": "Social Norms || Early Theories: Social Identity",
    "tokenized_text": [
        "early",
        "theory",
        "social",
        "identity",
        "early",
        "theory",
        "social",
        "identity",
        "argued",
        "behavior",
        "often",
        "closely",
        "embedded",
        "network",
        "personal",
        "relation",
        "theory",
        "norm",
        "leave",
        "specific",
        "social",
        "context",
        "consideration",
        "granovetter",
        "critic",
        "socialized",
        "actor",
        "theory",
        "called",
        "alternative",
        "conception",
        "norm",
        "may",
        "account",
        "often",
        "weak",
        "relation",
        "belief",
        "behavior",
        "deutscher",
        "alternative",
        "approach",
        "take",
        "social",
        "relation",
        "crucial",
        "explaining",
        "social",
        "action",
        "considers",
        "social",
        "identity",
        "key",
        "motivating",
        "factor",
        "strong",
        "support",
        "view",
        "among",
        "anthropologist",
        "found",
        "work",
        "cancian",
        "since",
        "notion",
        "social",
        "identity",
        "inextricably",
        "linked",
        "group",
        "behavior",
        "important",
        "clarify",
        "relation",
        "concept",
        "social",
        "identity",
        "refer",
        "tajfel",
        "word",
        "part",
        "individual",
        "selfconcept",
        "derives",
        "knowledge",
        "membership",
        "social",
        "group",
        "group",
        "together",
        "value",
        "emotional",
        "significance",
        "attached",
        "membership",
        "tajfel",
        "note",
        "crucial",
        "feature",
        "social",
        "identity",
        "one",
        "identification",
        "group",
        "sense",
        "conscious",
        "choice",
        "one",
        "may",
        "accidentally",
        "belong",
        "group",
        "meaningfully",
        "talk",
        "social",
        "identification",
        "groupmember",
        "becomes",
        "least",
        "part",
        "constitutive",
        "one",
        "according",
        "tajfel",
        "theory",
        "categorize",
        "belonging",
        "particular",
        "group",
        "perception",
        "definition",
        "selfas",
        "well",
        "motiveschange",
        "start",
        "perceiving",
        "fellow",
        "groupmembers",
        "along",
        "impersonal",
        "typical",
        "dimension",
        "characterize",
        "group",
        "belong",
        "dimension",
        "include",
        "specific",
        "role",
        "belief",
        "action",
        "accompany",
        "turner",
        "et",
        "al",
        "selfcategorization",
        "theory",
        "provides",
        "specific",
        "characterization",
        "selfperception",
        "selfdefinition",
        "system",
        "cognitive",
        "selfschemata",
        "filter",
        "process",
        "information",
        "schema",
        "result",
        "representation",
        "social",
        "situation",
        "guide",
        "choice",
        "appropriate",
        "action",
        "system",
        "least",
        "two",
        "major",
        "component",
        "ie",
        "social",
        "personal",
        "identity",
        "social",
        "identity",
        "refers",
        "selfdescriptions",
        "related",
        "group",
        "membership",
        "personal",
        "identity",
        "refers",
        "selfdescriptions",
        "individual",
        "character",
        "trait",
        "ability",
        "taste",
        "although",
        "personal",
        "social",
        "identity",
        "mutually",
        "exclusive",
        "level",
        "selfdefinition",
        "distinction",
        "must",
        "taken",
        "approximation",
        "many",
        "interconnection",
        "social",
        "personal",
        "identity",
        "however",
        "important",
        "recognize",
        "often",
        "perceive",
        "primarily",
        "term",
        "relevant",
        "group",
        "membership",
        "rather",
        "differentiated",
        "unique",
        "individual",
        "sodepending",
        "situationpersonal",
        "group",
        "identity",
        "become",
        "salient",
        "brewer",
        "example",
        "one",
        "make",
        "interpersonal",
        "comparison",
        "oneself",
        "groupmembers",
        "personal",
        "identity",
        "become",
        "salient",
        "instead",
        "group",
        "identity",
        "become",
        "salient",
        "situation",
        "one",
        "group",
        "compared",
        "another",
        "group",
        "within",
        "group",
        "factor",
        "lead",
        "member",
        "categorize",
        "different",
        "endowed",
        "special",
        "characteristic",
        "trait",
        "enhance",
        "personal",
        "identity",
        "group",
        "solve",
        "common",
        "task",
        "member",
        "rewarded",
        "according",
        "contribution",
        "personal",
        "ability",
        "highlighted",
        "individual",
        "perceive",
        "unique",
        "different",
        "rest",
        "group",
        "conversely",
        "groupmembers",
        "equally",
        "share",
        "reward",
        "jointly",
        "performed",
        "task",
        "group",
        "identification",
        "enhanced",
        "difference",
        "self",
        "fellow",
        "groupmembers",
        "accentuated",
        "likely",
        "observe",
        "selfish",
        "motif",
        "selffavoritism",
        "groupmembers",
        "instead",
        "group",
        "identification",
        "enhanced",
        "ingroup",
        "favoritism",
        "outgroup",
        "member",
        "activated",
        "well",
        "behavior",
        "contrary",
        "selfinterest",
        "according",
        "turner",
        "social",
        "identity",
        "basically",
        "cognitive",
        "mechanism",
        "whose",
        "adaptive",
        "function",
        "make",
        "group",
        "behavior",
        "possible",
        "whenever",
        "social",
        "identification",
        "becomes",
        "salient",
        "cognitive",
        "mechanism",
        "categorization",
        "activated",
        "way",
        "produce",
        "perceptual",
        "behavioral",
        "change",
        "categorization",
        "called",
        "stereotype",
        "prototypical",
        "description",
        "member",
        "given",
        "category",
        "believed",
        "cluster",
        "physical",
        "mental",
        "psychological",
        "characteristic",
        "attributed",
        "typical",
        "member",
        "given",
        "group",
        "stereotyping",
        "like",
        "categorization",
        "process",
        "activates",
        "script",
        "schema",
        "call",
        "group",
        "behavior",
        "nothing",
        "scripted",
        "behavior",
        "example",
        "category",
        "asian",
        "student",
        "associated",
        "cluster",
        "behavior",
        "personality",
        "trait",
        "value",
        "often",
        "think",
        "asian",
        "student",
        "respectful",
        "diligent",
        "disciplined",
        "especially",
        "good",
        "technical",
        "subject",
        "thinking",
        "asian",
        "student",
        "solely",
        "term",
        "group",
        "membership",
        "attribute",
        "stereotypical",
        "characteristic",
        "associated",
        "group",
        "becomes",
        "interchangeable",
        "groupmembers",
        "perceive",
        "people",
        "term",
        "stereotype",
        "depersonalize",
        "see",
        "typical",
        "member",
        "group",
        "process",
        "work",
        "perceive",
        "groupmembers",
        "selfstereotyping",
        "cognitive",
        "shift",
        "perceiving",
        "oneself",
        "unique",
        "perceiving",
        "oneself",
        "term",
        "attribute",
        "characterize",
        "group",
        "cognitive",
        "shift",
        "mediates",
        "group",
        "behavior",
        "group",
        "behavior",
        "opposed",
        "individual",
        "behavior",
        "characterized",
        "feature",
        "perceived",
        "similarity",
        "groupmembers",
        "cohesiveness",
        "tendency",
        "cooperate",
        "achieve",
        "common",
        "goal",
        "shared",
        "attitude",
        "belief",
        "conformity",
        "group",
        "norm",
        "individual",
        "selfcategorizes",
        "member",
        "group",
        "perceive",
        "depersonalized",
        "similar",
        "groupmembers",
        "relevant",
        "stereotypical",
        "dimension",
        "insofar",
        "groupmembers",
        "perceive",
        "interest",
        "goal",
        "identicalbecause",
        "interest",
        "goal",
        "stereotypical",
        "attribute",
        "groupselfstereotyping",
        "induce",
        "groupmember",
        "embrace",
        "interest",
        "goal",
        "thus",
        "predicted",
        "prosocial",
        "behavior",
        "enhanced",
        "group",
        "membership",
        "diluted",
        "people",
        "act",
        "individualistic",
        "mode",
        "brewer",
        "group",
        "happen",
        "identify",
        "may",
        "large",
        "case",
        "one",
        "selfdefines",
        "muslim",
        "french",
        "small",
        "friend",
        "group",
        "general",
        "group",
        "identity",
        "may",
        "involve",
        "specific",
        "norm",
        "many",
        "case",
        "group",
        "identification",
        "social",
        "norm",
        "inextricably",
        "connected",
        "case",
        "groupmembers",
        "believe",
        "certain",
        "pattern",
        "behavior",
        "unique",
        "use",
        "distinctive",
        "norm",
        "define",
        "group",
        "membership",
        "many",
        "closeknit",
        "group",
        "amish",
        "hasidic",
        "jew",
        "enforce",
        "norm",
        "separation",
        "proscribing",
        "marriage",
        "outsider",
        "well",
        "specific",
        "dress",
        "code",
        "host",
        "prescriptive",
        "proscriptive",
        "norm",
        "individual",
        "perceives",
        "groupmember",
        "adhere",
        "group",
        "prototype",
        "behave",
        "accordance",
        "hogg",
        "turner",
        "called",
        "process",
        "individual",
        "come",
        "conform",
        "group",
        "norm",
        "referent",
        "informational",
        "influence",
        "groupspecific",
        "norm",
        "among",
        "thing",
        "twofold",
        "function",
        "minimizing",
        "perceived",
        "difference",
        "among",
        "groupmembers",
        "maximizing",
        "difference",
        "group",
        "outsider",
        "formed",
        "norm",
        "become",
        "stable",
        "cognitive",
        "representation",
        "appropriate",
        "behavior",
        "groupmember",
        "social",
        "identity",
        "built",
        "around",
        "group",
        "characteristic",
        "behavioral",
        "standard",
        "hence",
        "perceived",
        "lack",
        "conformity",
        "group",
        "norm",
        "seen",
        "threat",
        "legitimacy",
        "group",
        "selfcategorization",
        "accentuates",
        "similarity",
        "one",
        "behavior",
        "prescribed",
        "group",
        "norm",
        "thus",
        "causing",
        "conformity",
        "well",
        "disposition",
        "control",
        "punish",
        "transgressor",
        "social",
        "identity",
        "framework",
        "group",
        "norm",
        "obeyed",
        "one",
        "identifies",
        "group",
        "conformity",
        "mediated",
        "selfcategorization",
        "ingroup",
        "member",
        "telling",
        "historical",
        "example",
        "relationship",
        "norm",
        "group",
        "membership",
        "division",
        "england",
        "two",
        "party",
        "roundhead",
        "cavalier",
        "charles",
        "mackay",
        "report",
        "day",
        "every",
        "specie",
        "vice",
        "iniquity",
        "thought",
        "puritan",
        "lurk",
        "long",
        "curly",
        "tress",
        "monarchist",
        "latter",
        "imagined",
        "opponent",
        "destitute",
        "wit",
        "wisdom",
        "virtue",
        "hair",
        "man",
        "lock",
        "symbol",
        "creed",
        "politics",
        "religion",
        "abundant",
        "hair",
        "scant",
        "faith",
        "balder",
        "head",
        "sincere",
        "piety",
        "mackay",
        "noted",
        "framework",
        "social",
        "norm",
        "defined",
        "collectiveas",
        "opposed",
        "personalbeliefs",
        "appropriate",
        "behavior",
        "homans",
        "certain",
        "extent",
        "characterization",
        "social",
        "norm",
        "closer",
        "recent",
        "account",
        "parson",
        "socialized",
        "actor",
        "theory",
        "hand",
        "distinct",
        "feature",
        "social",
        "identity",
        "framework",
        "people",
        "motivation",
        "conform",
        "come",
        "desire",
        "validate",
        "identity",
        "groupmembers",
        "short",
        "several",
        "empirical",
        "prediction",
        "one",
        "draw",
        "framework",
        "given",
        "theory",
        "emphasis",
        "identity",
        "motivating",
        "factor",
        "conformity",
        "norm",
        "assumed",
        "depend",
        "individual",
        "internalization",
        "norm",
        "fact",
        "change",
        "social",
        "status",
        "group",
        "membership",
        "bring",
        "change",
        "norm",
        "relevant",
        "new",
        "statusgroup",
        "thus",
        "new",
        "norm",
        "quickly",
        "adopted",
        "without",
        "much",
        "interaction",
        "belief",
        "identity",
        "validation",
        "may",
        "change",
        "rapidly",
        "pressure",
        "external",
        "circumstance",
        "case",
        "norm",
        "compliance",
        "norm",
        "potentially",
        "unstable",
        "experimental",
        "literature",
        "social",
        "dilemma",
        "utilized",
        "priming",
        "group",
        "identity",
        "mechanism",
        "promoting",
        "cooperative",
        "behavior",
        "dawes",
        "brewer",
        "schneider",
        "typical",
        "hypothesis",
        "preplay",
        "facetoface",
        "communication",
        "stage",
        "may",
        "induce",
        "identification",
        "group",
        "thus",
        "promote",
        "cooperative",
        "behavior",
        "among",
        "groupmembers",
        "effect",
        "rate",
        "cooperation",
        "shown",
        "generally",
        "higher",
        "social",
        "dilemma",
        "experiment",
        "preceded",
        "preplay",
        "communication",
        "stage",
        "dawes",
        "however",
        "argued",
        "facetoface",
        "communication",
        "may",
        "actually",
        "help",
        "groupmembers",
        "gather",
        "relevant",
        "information",
        "one",
        "another",
        "information",
        "may",
        "therefore",
        "induce",
        "subject",
        "trust",
        "promise",
        "act",
        "cooperatively",
        "regardless",
        "group",
        "identification",
        "respect",
        "shown",
        "communication",
        "per",
        "se",
        "foster",
        "cooperation",
        "unless",
        "subject",
        "allowed",
        "talk",
        "relevant",
        "topic",
        "bicchieri",
        "levon",
        "provides",
        "support",
        "view",
        "communication",
        "enhance",
        "cohesion",
        "rather",
        "focus",
        "subject",
        "relevant",
        "rule",
        "behavior",
        "necessarily",
        "depend",
        "group",
        "identification",
        "cooperative",
        "outcome",
        "thus",
        "explained",
        "without",
        "resorting",
        "concept",
        "social",
        "identity",
        "social",
        "identity",
        "explanation",
        "appears",
        "appropriate",
        "context",
        "relatively",
        "stable",
        "environment",
        "individual",
        "time",
        "make",
        "emotional",
        "investment",
        "least",
        "expect",
        "repeated",
        "future",
        "interaction",
        "within",
        "group",
        "artificial",
        "lab",
        "setting",
        "expectation",
        "future",
        "interaction",
        "concept",
        "social",
        "identity",
        "seems",
        "le",
        "persuasive",
        "explanation",
        "observed",
        "rate",
        "cooperation",
        "hand",
        "note",
        "social",
        "identity",
        "appear",
        "play",
        "role",
        "experimental",
        "setting",
        "participant",
        "divided",
        "separate",
        "group",
        "case",
        "shown",
        "participant",
        "categorize",
        "situation",
        "versus",
        "activating",
        "ingroup",
        "loyalty",
        "trust",
        "equal",
        "degree",
        "mistrust",
        "toward",
        "outgroup",
        "kramer",
        "brewer",
        "bornstein",
        "benyossef",
        "even",
        "stable",
        "environment",
        "repeated",
        "interaction",
        "however",
        "theory",
        "norm",
        "compliance",
        "term",
        "social",
        "identity",
        "avoid",
        "difficulty",
        "making",
        "prediction",
        "one",
        "simultaneously",
        "committed",
        "different",
        "identity",
        "may",
        "concurrently",
        "worker",
        "parent",
        "spouse",
        "friend",
        "club",
        "member",
        "party",
        "affiliate",
        "name",
        "possible",
        "identity",
        "embrace",
        "rule",
        "define",
        "appropriate",
        "acceptable",
        "good",
        "behavior",
        "social",
        "identity",
        "framework",
        "however",
        "clear",
        "happens",
        "one",
        "committed",
        "different",
        "identity",
        "may",
        "involve",
        "conflicting",
        "behavior",
        "finally",
        "ample",
        "evidence",
        "people",
        "perception",
        "may",
        "change",
        "rapidly",
        "since",
        "framework",
        "norm",
        "defined",
        "shared",
        "perception",
        "group",
        "belief",
        "one",
        "would",
        "expect",
        "thatwhenever",
        "member",
        "group",
        "happen",
        "believe",
        "others",
        "changed",
        "belief",
        "core",
        "membership",
        "rulesthe",
        "norm",
        "define",
        "membership",
        "change",
        "study",
        "fashion",
        "fad",
        "speculative",
        "bubble",
        "clearly",
        "show",
        "domain",
        "rapid",
        "possibly",
        "disruptive",
        "change",
        "collective",
        "expectation",
        "may",
        "occur",
        "however",
        "much",
        "le",
        "clear",
        "sort",
        "norm",
        "likely",
        "subject",
        "rapid",
        "change",
        "think",
        "dress",
        "code",
        "rather",
        "code",
        "honor",
        "social",
        "identity",
        "view",
        "offer",
        "theoretical",
        "framework",
        "differentiating",
        "case",
        "although",
        "norm",
        "indeed",
        "related",
        "group",
        "membership",
        "thus",
        "compliance",
        "may",
        "explained",
        "identityvalidation",
        "mechanism",
        "appear",
        "limit",
        "social",
        "identity",
        "explanation"
    ]
}