{
    "main_text": "Socialist Institutional Designs (Dimension DII) || Market Socialism\n4.2 Market Socialism\n\nSome of the above-mentioned problems of central planning, regarding\ninefficiency and concentration of power, have motivated some\nsocialists to explore alternative economic systems in which markets\nare given a central role. Markets generate problems of their own\n(especially when they involve monopolies, negative externalities, and\nasymmetric information). But if regulations are introduced to counter\nthese “market failures”, markets can be the best feasible\nmechanism for generating matches between demand and supply in large,\ncomplex societies (as higher prices signal high demand, with supply\nrushing to cover it, while lower prices signal low demand, leading\nsupply to concentrate on other products). Market socialism\naffirms the traditional socialist desideratum of preventing a division\nof society between a class of capitalists who do not need to work to\nmake a living and a class of laborers having to work for them, but it\nretains from capitalism the utilization of markets to guide\nproduction. There has been a lively debate on this approach, with\nseveral specific systems being proposed.\n\nOne version is the economic democracy model (Schweickart 2002\n[2011], 2015\n [OIR]).\n It has three basic features. First, production is undertaken in firms\nmanaged by workers. Worker self-managed enterprises would gain\ntemporary control of some means of production (which would be leased\nout by the state). Workers determine what gets produced and how it is\nproduced, and determine compensation schemes. Second, there is a\nmarket for goods and services. The profit motive persists and some\ninequalities within and between firms are possible, but likely much\nsmaller than in capitalism (as there would be no separate capitalist\nclass, and workers will not democratically select income schemes that\ninvolve significant inequality within their firms). Finally,\ninvestment flows are socially controlled through democratically\naccountable public investment banks, which determine funding for\nenterprises on the basis of socially relevant criteria. The revenues\nfor these banks come from a capital assets tax. This system would\n(through its second feature) mobilize the efficiency of markets while\nalso (through its other features) attending to socialist ideals of\nself-determination, self-realization, and equal opportunity. To\naddress some potential difficulties, the model has been extended to\ninclude further features, such as a commitment of the government as an\nemployer of last resort, the creation of socialist savings and loans\nassociations, the accommodation of an entrepreneurial-capitalist\nsector for particularly innovative small firms, and some forms of\nprotectionism regarding foreign trade.\n\nSelf-management market socialism has been defended as feasible by\npointing at the experience of cooperatives (such as the\nMondragón Corporation in the Basque Country in Spain, which has\n(as of 2015) over 70,000 worker-owners participating in a network of\ncooperative businesses). But it has also been criticized on five\ncounts (Corneo 2017: ch. 6). First, it would generate unfair\ndistributions, as workers doing the same work in different enterprises\nwould end up with unequal income if the enterprises are not equally\nsuccessful in the market. Second, workers would face high levels of\nfinancial risk, as their resources would be concentrated in their firm\nrather than spread more widely. Third, it could generate inefficient\nresponses to market prices, as self-managed enterprises reduce hiring\nif prices for their products are high—so that members keep more\nof the profit—and hire more if the prices are low—to cover\nfor fixed costs of production. Given the previous point, the system\ncould also generate high unemployment. Having the government require\nfirms to hire more would lead to lower productivity. However, the\nfurther features in the model discussed above might address this\nproblem by allowing for small private enterprises to be formed, and by\nhaving in the background the government play a role as an employer of\nlast resort (although this might also limit overall productivity).\nFinally, although some of the problems of efficiency could be handled\nthrough the banks controlling investment, it is not clear that the\nenormous power of such banks could be made sufficiently accountable to\na democratic process so as to avoid the potential problem of\ncooptation by elites. (See, however, Malleson 2014 on democratic\ncontrol of investment.)\n\nAnother market socialist model, proposed by Carens (1981, 2003), does\nnot impose worker self-management. The Carensian model\nmirrors the current capitalist system in most respects while\nintroducing two key innovative features. First, there would be direct\ngovernmental provision regarding certain individually differentiated\nneeds (via a public health care system, for example). Second, to\naccess other consumption goods, everyone working full time would get\nthe same post tax income. Pre-tax salaries would vary, signaling\nlevels of demand in the market. People would choose jobs not only on\nthe basis of their self-regarding preferences, but also out of a sense\nof social duty to use their capacities to support others in society.\nThus, honoring the Abilities / Needs Principle, they would\napply for jobs (within their competencies) in which the pre-tax income\nis relatively high. If it worked, this model would recruit the\nefficiency of markets, but it would not involve the selfish motives\nand inegalitarian outcomes typically linked to them in capitalism.\n\nOne worry about the Carensian model is that it might be unrealistic to\nexpect an economic system to work well when it relies so heavily on a\nsense of duty to motivate people to make cooperative contributions.\nThis worry could be assuaged by presenting this model as the long-term\ntarget of a socialist transformation which would progressively develop\na social ethos supporting it (Gilabert 2011, 2017a), by noting\nempirical findings about the significant traction of non-egoistic\nmotives in economic behavior (Bowles and Gintis 2011) and the\nfeasibility of “moral incentives” (Guevara 1977,\nLizárraga 2011), and by exploring strategies to mobilize\nsimultaneously various motivational mechanisms to sustain the proposed\nscheme. Two other worries are the following (Gilabert 2015). First,\nthe model makes no explicit provision regarding real opportunities for\nwork in self-managed firms. To cater more fully for ideals of\nself-determination and self-realization, a requirement could be added\nthat the government promote such opportunities for those willing to\ntake them. Second, the model is not sufficiently sensitive to\ndifferent individual preferences regarding leisure and consumption\n(requiring simply that everyone work full time and wind up with the\nsame consumption and leisure bundles). More flexible schedules could\nbe introduced so that people who want to consume more could work\nlonger hours and have higher salaries, while people who want to enjoy\nmore free time could work fewer hours and have lower salaries.\nConsiderations of reciprocity and equality could still be honored by\nequalizing the incomes of those working the same number of hours.\n\nMany forms of market socialism allow for some hierarchy at the point\nof production. These managerial forms are usually defended on grounds\nof greater efficiency. But they face the question of how to\nincentivize managers to behave in ways that foster innovation and\nproductivity. One way to do this is to set up a stock market that\nwould help to measure the performance of the firms they manage and to\npush them to make optimal decisions. An example of this approach\n(there are others—Corneo 2017: ch. 8) is coupon market\nsocialism. In Roemer’s (1994a) version, this economic\nsystem operates with two kinds of money: dollars (euros, pesos, etc.)\nand coupons. Dollars are used to purchase commodities for consumption\nand production, and coupons are used in a stock market to purchase\nshares in corporations. The two kinds of money are not convertible\n(with an exception to be outlined below). Each person, when reaching\nadulthood, is provided with an equal set of coupons. They can use them\nin a state-regulated stock market (directly or through mutual\ninvestment funds) to purchase shares in corporations at market price.\nThey receive the dividends from their investments in dollars, but they\ncannot cash the coupons themselves. When they die, people’s\ncoupons and shares go back to the state for distribution to new\ngenerations—no inherited wealth is allowed—and coupons\ncannot be transferred as gifts. Thus, there is no separate class of\ncapital owners in this economy. But there will be income inequality\nresulting from people’s different fortunes with their\ninvestments (dividends) as well as from the income they gain in the\njobs they take through the labor market (in managerial and\nnon-managerial positions). Coupons can however be converted into\ndollars by corporations; they can cash their shares to pay for capital\ninvestments. The exchange is regulated by a public central bank.\nFurther, public banks or public investment funds, operating with\nrelative independence from the government, would steer enterprises\nreceiving coupons so that they maximize profit in the competitive\nmarkets for the goods and services they produce (so that they maximize\nthe returns on the coupons invested). Part of that profit is also\ntaxed for direct welfare provisions by the state.\n\nThis model caters for ideals of equality of opportunity (given equal\ndistribution of coupons) and democracy (given the elimination of\ncapitalist dynasties that have the ability to transform massive\neconomic power into political influence). It also gives people freedom\nto choose how to use their resources and includes solidaristic schemes\nof public provision to meet needs regarding education and health care.\nVia the competitive markets in consumption goods and shares, it also\npromises high levels of innovation and productivity. (In some versions\nof the model this is enhanced by allowing limited forms of private\nownership of firms to facilitate the input of highly innovative\nentrepreneurial individuals—Corneo 2017: 192–7). The model\ndeparts from traditional forms of socialism by not exactly instituting\nsocial property in means of production (but rather the equal\ndispersal of coupons across individuals in each generation). But\ndefenders of this model say that socialists should not fetishize any\nproperty scheme; they should instead see such schemes instrumentally\nin terms of how well they fare in the implementation of core normative\nprinciples (such as equality of opportunity) (Roemer 1994a:\n23–4, 124–5). Critics have worries, however, that the\nmodel does not go far enough in honoring socialist principles. For\nexample, they have argued that a managerial (by contrast to a\nself-management) form of market socialism is deficient in terms of\nself-determination and self-realization at the workplace (Satz 1996),\nand that the levels of inequalities in income, and the competitive\nattitudes in the market that it would generate, violate ideals of\ncommunity (G.A. Cohen 2009). In response, a defender of coupon market\nsocialism can emphasize that the model is meant to be applied in the\nshort-term, and that further institutional and cultural arrangements\nmore fully in line with socialist principles can be introduced later\non, as they become more feasible (Roemer 1994a: 25–7, 118). A\nworry, however, is that the model may entrench institutional and\ncultural configurations which may diminish rather than enhance the\nprospects for deeper changes in the future (Brighouse 1996; Gilabert\n2011).\n",
    "section_title": "4.2 Market Socialism",
    "entry_title": "Socialism",
    "hierarchy_title": "Socialism || Socialist Institutional Designs (Dimension DII) || Market Socialism",
    "tokenized_text": [
        "socialist",
        "institutional",
        "design",
        "dimension",
        "dii",
        "market",
        "socialism",
        "market",
        "socialism",
        "abovementioned",
        "problem",
        "central",
        "planning",
        "regarding",
        "inefficiency",
        "concentration",
        "power",
        "motivated",
        "socialist",
        "explore",
        "alternative",
        "economic",
        "system",
        "market",
        "given",
        "central",
        "role",
        "market",
        "generate",
        "problem",
        "especially",
        "involve",
        "monopoly",
        "negative",
        "externality",
        "asymmetric",
        "information",
        "regulation",
        "introduced",
        "counter",
        "market",
        "failure",
        "market",
        "best",
        "feasible",
        "mechanism",
        "generating",
        "match",
        "demand",
        "supply",
        "large",
        "complex",
        "society",
        "higher",
        "price",
        "signal",
        "high",
        "demand",
        "supply",
        "rushing",
        "cover",
        "lower",
        "price",
        "signal",
        "low",
        "demand",
        "leading",
        "supply",
        "concentrate",
        "product",
        "market",
        "socialism",
        "affirms",
        "traditional",
        "socialist",
        "desideratum",
        "preventing",
        "division",
        "society",
        "class",
        "capitalist",
        "need",
        "work",
        "make",
        "living",
        "class",
        "laborer",
        "work",
        "retains",
        "capitalism",
        "utilization",
        "market",
        "guide",
        "production",
        "lively",
        "debate",
        "approach",
        "several",
        "specific",
        "system",
        "proposed",
        "one",
        "version",
        "economic",
        "democracy",
        "model",
        "schweickart",
        "oir",
        "three",
        "basic",
        "feature",
        "first",
        "production",
        "undertaken",
        "firm",
        "managed",
        "worker",
        "worker",
        "selfmanaged",
        "enterprise",
        "would",
        "gain",
        "temporary",
        "control",
        "mean",
        "production",
        "would",
        "leased",
        "state",
        "worker",
        "determine",
        "get",
        "produced",
        "produced",
        "determine",
        "compensation",
        "scheme",
        "second",
        "market",
        "good",
        "service",
        "profit",
        "motive",
        "persists",
        "inequality",
        "within",
        "firm",
        "possible",
        "likely",
        "much",
        "smaller",
        "capitalism",
        "would",
        "separate",
        "capitalist",
        "class",
        "worker",
        "democratically",
        "select",
        "income",
        "scheme",
        "involve",
        "significant",
        "inequality",
        "within",
        "firm",
        "finally",
        "investment",
        "flow",
        "socially",
        "controlled",
        "democratically",
        "accountable",
        "public",
        "investment",
        "bank",
        "determine",
        "funding",
        "enterprise",
        "basis",
        "socially",
        "relevant",
        "criterion",
        "revenue",
        "bank",
        "come",
        "capital",
        "asset",
        "tax",
        "system",
        "would",
        "second",
        "feature",
        "mobilize",
        "efficiency",
        "market",
        "also",
        "feature",
        "attending",
        "socialist",
        "ideal",
        "selfdetermination",
        "selfrealization",
        "equal",
        "opportunity",
        "address",
        "potential",
        "difficulty",
        "model",
        "extended",
        "include",
        "feature",
        "commitment",
        "government",
        "employer",
        "last",
        "resort",
        "creation",
        "socialist",
        "saving",
        "loan",
        "association",
        "accommodation",
        "entrepreneurialcapitalist",
        "sector",
        "particularly",
        "innovative",
        "small",
        "firm",
        "form",
        "protectionism",
        "regarding",
        "foreign",
        "trade",
        "selfmanagement",
        "market",
        "socialism",
        "defended",
        "feasible",
        "pointing",
        "experience",
        "cooperative",
        "mondragón",
        "corporation",
        "basque",
        "country",
        "spain",
        "workerowners",
        "participating",
        "network",
        "cooperative",
        "business",
        "also",
        "criticized",
        "five",
        "count",
        "corneo",
        "ch",
        "first",
        "would",
        "generate",
        "unfair",
        "distribution",
        "worker",
        "work",
        "different",
        "enterprise",
        "would",
        "end",
        "unequal",
        "income",
        "enterprise",
        "equally",
        "successful",
        "market",
        "second",
        "worker",
        "would",
        "face",
        "high",
        "level",
        "financial",
        "risk",
        "resource",
        "would",
        "concentrated",
        "firm",
        "rather",
        "spread",
        "widely",
        "third",
        "could",
        "generate",
        "inefficient",
        "response",
        "market",
        "price",
        "selfmanaged",
        "enterprise",
        "reduce",
        "hiring",
        "price",
        "product",
        "highso",
        "member",
        "keep",
        "profitand",
        "hire",
        "price",
        "lowto",
        "cover",
        "fixed",
        "cost",
        "production",
        "given",
        "previous",
        "point",
        "system",
        "could",
        "also",
        "generate",
        "high",
        "unemployment",
        "government",
        "require",
        "firm",
        "hire",
        "would",
        "lead",
        "lower",
        "productivity",
        "however",
        "feature",
        "model",
        "discussed",
        "might",
        "address",
        "problem",
        "allowing",
        "small",
        "private",
        "enterprise",
        "formed",
        "background",
        "government",
        "play",
        "role",
        "employer",
        "last",
        "resort",
        "although",
        "might",
        "also",
        "limit",
        "overall",
        "productivity",
        "finally",
        "although",
        "problem",
        "efficiency",
        "could",
        "handled",
        "bank",
        "controlling",
        "investment",
        "clear",
        "enormous",
        "power",
        "bank",
        "could",
        "made",
        "sufficiently",
        "accountable",
        "democratic",
        "process",
        "avoid",
        "potential",
        "problem",
        "cooptation",
        "elite",
        "see",
        "however",
        "malleson",
        "democratic",
        "control",
        "investment",
        "another",
        "market",
        "socialist",
        "model",
        "proposed",
        "carens",
        "impose",
        "worker",
        "selfmanagement",
        "carensian",
        "model",
        "mirror",
        "current",
        "capitalist",
        "system",
        "respect",
        "introducing",
        "two",
        "key",
        "innovative",
        "feature",
        "first",
        "would",
        "direct",
        "governmental",
        "provision",
        "regarding",
        "certain",
        "individually",
        "differentiated",
        "need",
        "via",
        "public",
        "health",
        "care",
        "system",
        "example",
        "second",
        "access",
        "consumption",
        "good",
        "everyone",
        "working",
        "full",
        "time",
        "would",
        "get",
        "post",
        "tax",
        "income",
        "pretax",
        "salary",
        "would",
        "vary",
        "signaling",
        "level",
        "demand",
        "market",
        "people",
        "would",
        "choose",
        "job",
        "basis",
        "selfregarding",
        "preference",
        "also",
        "sense",
        "social",
        "duty",
        "use",
        "capacity",
        "support",
        "others",
        "society",
        "thus",
        "honoring",
        "ability",
        "need",
        "principle",
        "would",
        "apply",
        "job",
        "within",
        "competency",
        "pretax",
        "income",
        "relatively",
        "high",
        "worked",
        "model",
        "would",
        "recruit",
        "efficiency",
        "market",
        "would",
        "involve",
        "selfish",
        "motif",
        "inegalitarian",
        "outcome",
        "typically",
        "linked",
        "capitalism",
        "one",
        "worry",
        "carensian",
        "model",
        "might",
        "unrealistic",
        "expect",
        "economic",
        "system",
        "work",
        "well",
        "relies",
        "heavily",
        "sense",
        "duty",
        "motivate",
        "people",
        "make",
        "cooperative",
        "contribution",
        "worry",
        "could",
        "assuaged",
        "presenting",
        "model",
        "longterm",
        "target",
        "socialist",
        "transformation",
        "would",
        "progressively",
        "develop",
        "social",
        "ethos",
        "supporting",
        "gilabert",
        "a",
        "noting",
        "empirical",
        "finding",
        "significant",
        "traction",
        "nonegoistic",
        "motif",
        "economic",
        "behavior",
        "bowles",
        "gintis",
        "feasibility",
        "moral",
        "incentive",
        "guevara",
        "lizárraga",
        "exploring",
        "strategy",
        "mobilize",
        "simultaneously",
        "various",
        "motivational",
        "mechanism",
        "sustain",
        "proposed",
        "scheme",
        "two",
        "worry",
        "following",
        "gilabert",
        "first",
        "model",
        "make",
        "explicit",
        "provision",
        "regarding",
        "real",
        "opportunity",
        "work",
        "selfmanaged",
        "firm",
        "cater",
        "fully",
        "ideal",
        "selfdetermination",
        "selfrealization",
        "requirement",
        "could",
        "added",
        "government",
        "promote",
        "opportunity",
        "willing",
        "take",
        "second",
        "model",
        "sufficiently",
        "sensitive",
        "different",
        "individual",
        "preference",
        "regarding",
        "leisure",
        "consumption",
        "requiring",
        "simply",
        "everyone",
        "work",
        "full",
        "time",
        "wind",
        "consumption",
        "leisure",
        "bundle",
        "flexible",
        "schedule",
        "could",
        "introduced",
        "people",
        "want",
        "consume",
        "could",
        "work",
        "longer",
        "hour",
        "higher",
        "salary",
        "people",
        "want",
        "enjoy",
        "free",
        "time",
        "could",
        "work",
        "fewer",
        "hour",
        "lower",
        "salary",
        "consideration",
        "reciprocity",
        "equality",
        "could",
        "still",
        "honored",
        "equalizing",
        "income",
        "working",
        "number",
        "hour",
        "many",
        "form",
        "market",
        "socialism",
        "allow",
        "hierarchy",
        "point",
        "production",
        "managerial",
        "form",
        "usually",
        "defended",
        "ground",
        "greater",
        "efficiency",
        "face",
        "question",
        "incentivize",
        "manager",
        "behave",
        "way",
        "foster",
        "innovation",
        "productivity",
        "one",
        "way",
        "set",
        "stock",
        "market",
        "would",
        "help",
        "measure",
        "performance",
        "firm",
        "manage",
        "push",
        "make",
        "optimal",
        "decision",
        "example",
        "approach",
        "otherscorneo",
        "ch",
        "coupon",
        "market",
        "socialism",
        "roemer",
        "a",
        "version",
        "economic",
        "system",
        "operates",
        "two",
        "kind",
        "money",
        "dollar",
        "euro",
        "peso",
        "etc",
        "coupon",
        "dollar",
        "used",
        "purchase",
        "commodity",
        "consumption",
        "production",
        "coupon",
        "used",
        "stock",
        "market",
        "purchase",
        "share",
        "corporation",
        "two",
        "kind",
        "money",
        "convertible",
        "exception",
        "outlined",
        "person",
        "reaching",
        "adulthood",
        "provided",
        "equal",
        "set",
        "coupon",
        "use",
        "stateregulated",
        "stock",
        "market",
        "directly",
        "mutual",
        "investment",
        "fund",
        "purchase",
        "share",
        "corporation",
        "market",
        "price",
        "receive",
        "dividend",
        "investment",
        "dollar",
        "cash",
        "coupon",
        "die",
        "people",
        "coupon",
        "share",
        "go",
        "back",
        "state",
        "distribution",
        "new",
        "generationsno",
        "inherited",
        "wealth",
        "allowedand",
        "coupon",
        "transferred",
        "gift",
        "thus",
        "separate",
        "class",
        "capital",
        "owner",
        "economy",
        "income",
        "inequality",
        "resulting",
        "people",
        "different",
        "fortune",
        "investment",
        "dividend",
        "well",
        "income",
        "gain",
        "job",
        "take",
        "labor",
        "market",
        "managerial",
        "nonmanagerial",
        "position",
        "coupon",
        "however",
        "converted",
        "dollar",
        "corporation",
        "cash",
        "share",
        "pay",
        "capital",
        "investment",
        "exchange",
        "regulated",
        "public",
        "central",
        "bank",
        "public",
        "bank",
        "public",
        "investment",
        "fund",
        "operating",
        "relative",
        "independence",
        "government",
        "would",
        "steer",
        "enterprise",
        "receiving",
        "coupon",
        "maximize",
        "profit",
        "competitive",
        "market",
        "good",
        "service",
        "produce",
        "maximize",
        "return",
        "coupon",
        "invested",
        "part",
        "profit",
        "also",
        "taxed",
        "direct",
        "welfare",
        "provision",
        "state",
        "model",
        "caters",
        "ideal",
        "equality",
        "opportunity",
        "given",
        "equal",
        "distribution",
        "coupon",
        "democracy",
        "given",
        "elimination",
        "capitalist",
        "dynasty",
        "ability",
        "transform",
        "massive",
        "economic",
        "power",
        "political",
        "influence",
        "also",
        "give",
        "people",
        "freedom",
        "choose",
        "use",
        "resource",
        "includes",
        "solidaristic",
        "scheme",
        "public",
        "provision",
        "meet",
        "need",
        "regarding",
        "education",
        "health",
        "care",
        "via",
        "competitive",
        "market",
        "consumption",
        "good",
        "share",
        "also",
        "promise",
        "high",
        "level",
        "innovation",
        "productivity",
        "version",
        "model",
        "enhanced",
        "allowing",
        "limited",
        "form",
        "private",
        "ownership",
        "firm",
        "facilitate",
        "input",
        "highly",
        "innovative",
        "entrepreneurial",
        "individualscorneo",
        "model",
        "departs",
        "traditional",
        "form",
        "socialism",
        "exactly",
        "instituting",
        "social",
        "property",
        "mean",
        "production",
        "rather",
        "equal",
        "dispersal",
        "coupon",
        "across",
        "individual",
        "generation",
        "defender",
        "model",
        "say",
        "socialist",
        "fetishize",
        "property",
        "scheme",
        "instead",
        "see",
        "scheme",
        "instrumentally",
        "term",
        "well",
        "fare",
        "implementation",
        "core",
        "normative",
        "principle",
        "equality",
        "opportunity",
        "roemer",
        "a",
        "critic",
        "worry",
        "however",
        "model",
        "go",
        "far",
        "enough",
        "honoring",
        "socialist",
        "principle",
        "example",
        "argued",
        "managerial",
        "contrast",
        "selfmanagement",
        "form",
        "market",
        "socialism",
        "deficient",
        "term",
        "selfdetermination",
        "selfrealization",
        "workplace",
        "satz",
        "level",
        "inequality",
        "income",
        "competitive",
        "attitude",
        "market",
        "would",
        "generate",
        "violate",
        "ideal",
        "community",
        "ga",
        "cohen",
        "response",
        "defender",
        "coupon",
        "market",
        "socialism",
        "emphasize",
        "model",
        "meant",
        "applied",
        "shortterm",
        "institutional",
        "cultural",
        "arrangement",
        "fully",
        "line",
        "socialist",
        "principle",
        "introduced",
        "later",
        "become",
        "feasible",
        "roemer",
        "a",
        "worry",
        "however",
        "model",
        "may",
        "entrench",
        "institutional",
        "cultural",
        "configuration",
        "may",
        "diminish",
        "rather",
        "enhance",
        "prospect",
        "deeper",
        "change",
        "future",
        "brighouse",
        "gilabert"
    ]
}