{
    "main_text": "The Socratic problem: Who was Socrates really? || Three primary sources: Aristophanes, Xenophon, and Plato\n2.1 Three primary sources: Aristophanes, Xenophon, and Plato\nAristophanes (±450–±386)\n\nOur earliest extant source—and the only one who can claim to\nhave known Socrates in vigorous midlife—is the playwright\nAristophanes. His comedy, Clouds, was produced within a year\nof the battle of Delium (423) at which Socrates fought as a hoplite,\nand when both Xenophon and Plato were infants. In the play, the\ncharacter called Socrates heads a Think-o-Rama in which young men\nstudy the natural world, from insects to stars, and study slick\nargumentative techniques as well, lacking all respect for the Athenian\nsense of propriety. The actor wearing the mask of Socrates makes fun\nof the traditional gods of Athens (lines 247–48, 367,\n423–24), mimicked later by the young protagonist, and gives\nnaturalistic explanations of phenomena Athenians viewed as divinely\ndirected (lines 227–33; cf. Theaetetus 152e,\n153c–d, 173e–174a; Phaedo 96a–100a). Worst\nof all, he teaches dishonest techniques for avoiding repayment of debt\n(lines 1214–1302) and encourages young men to beat their parents\ninto submission (lines 1408–46).\n\nComedy by its very nature is a tricky source for information about\nanyone. Yet, in favor of Aristophanes as a source for Socrates is that\nXenophon and Plato were some forty-five years younger than Socrates,\nso their acquaintance could only have been during Socrates’s\nlater years. Could Socrates really have changed so much? Can the\nlampooning of the younger Socrates found in Clouds and other\ncomic poets be reconciled with Plato’s characterization of a\nphilosopher in his fifties and sixties? Some have said yes, pointing\nout that the years between Clouds and Socrates’s trial\n(399) were years of war and upheaval, changing everyone. The Athenian\nintellectual freedom of which Pericles been so proud at the beginning\nof the war (Thucydides 2.37–39) had been eroded completely by\nthe end (see §3). Thus, what had seemed comical a quarter century\nearlier, Socrates hanging in a basket on-stage, talking nonsense, was\nominous in memory by then. A good reason to believe that\nAristophanes’s representation of Socrates is not merely a comic\nexaggeration but systematically misleading in retrospect is Kenneth\nDover’s view that Clouds amalgamates in one character,\nSocrates, features now well known to be unique to specific other\nfifth-century intellectuals (1968, xxxii-lvii). Perhaps Aristophanes\nchose Socrates to represent garden-variety intellectuals because\nSocrates’s physiognomy was strange enough by itself to get a\nlaugh. Aristophanes sometimes speaks in his own voice in his plays,\ngiving us good reason to believe he genuinely objected to social\ninstability brought on by the freedom Athenian youths enjoyed to study\nwith professional rhetoricians, sophists (see §1), and natural\nphilosophers, e.g., those who, like the presocratics, studied the\ncosmos or nature. Such professions could be lucrative. That Socrates\neschewed any earning potential in philosophy does not seem to have\nbeen significant to the great writer of comedies.\n\nAristophanes’s depiction of Socrates is important because\nPlato’s Socrates says at his trial (Apology\n18a–b, 19c) that most of his jurors have grown up believing the\nfalsehoods attributed to him in the play. Socrates calls Aristophanes\nmore dangerous than the three men who brought charges against him\nbecause Aristophanes had poisoned the jurors’ minds while they\nwere young. Aristophanes did not stop accusing Socrates in 423 when\nClouds placed third behind another play in which Socrates was\nmentioned as barefoot; rather, he soon began writing a revision, which\nhe circulated but never produced. Complicating matters, the revision\nis our only extant version of the play. Aristophanes appears to have\ngiven up on reviving Clouds in about 416, but his comic\nridicule of Socrates continued. Again in 414 with Birds, and\nin 405 with Frogs, Aristophanes complained of\nSocrates’s deleterious effect on the youths of the city,\nincluding Socrates’s neglect of the poets. Aristophanes even\ncoins a verb, to socratize, conveying a range of unsavory\n behaviors.[3]\nXenophon (±425–±386)\n\nAnother source for the historical Socrates is the soldier-historian,\nXenophon. Xenophon says explicitly of Socrates, “I was never\nacquainted with anyone who took greater care to find out what each of\nhis companions knew” (Memorabilia 4.7.1); and Plato\ncorroborates Xenophon’s statement by illustrating throughout his\ndialogues Socrates’s adjustment of the level and type of his\nquestions to the particular individuals with whom he talked. If it is\ntrue that Socrates succeeded in pitching his conversation at the right\nlevel for each of his companions, the striking differences between\nXenophon’s Socrates and Plato’s is largely explained by\nthe differences between their two personalities. Xenophon was a\npractical man whose ability to recognize philosophical issues is\nalmost imperceptible, so it is plausible that his Socrates is a\npractical and helpful advisor. That is the side of Socrates Xenophon\nexperienced. Xenophon’s Socrates differs additionally from\nPlato’s in offering advice about subjects in which Xenophon was\nhimself experienced, but Socrates was not: moneymaking (Xenophon,\nMemorabilia 2.7) and estate management (Xenophon,\nOeconomicus), suggesting that Xenophon may have entered into\nthe writing of Socratic discourses (as Aristotle labeled the genre,\nPoetics 1447b11) making the character Socrates a mouthpiece\nfor his own views. His other works mentioning or featuring Socrates\nare Anabasis, Apology, Hellenica, and\nSymposium.\n\nSomething that has strengthened Xenophon’s prima facie\nclaim as a source for Socrates’s life is his work as a\nhistorian; his Hellenica (History of Greece) is one\nof the chief sources for the period 411–362, after\nThucydides’s history abruptly ends in the midst of the\nPeloponnesian wars. Although Xenophon tends to moralize and does not\nfollow the superior conventions introduced by Thucydides, still it is\nsometimes argued that, having had no philosophical axes to grind,\nXenophon may have presented a more accurate portrait of Socrates than\nPlato does. But two considerations have always weakened that claim:\n(1) The Socrates of Xenophon’s works is so pedestrian that it is\ndifficult to imagine his inspiring fifteen or more people to write\nSocratic discourses in the period following his death. (2) Xenophon\ncould not have chalked up many hours with Socrates or with reliable\ninformants. He lived in Erchia, about 15 kilometers and across the\nHymettus mountains from Socrates’s haunts in the urban area of\nAthens, and his love of horses and horsemanship (on which he wrote a\nstill-valuable treatise) took up considerable time. He left Athens in\n401 on an expedition to Persia and, for a variety of reasons\n(mercenary service for Thracians and Spartans; exile), never resided\nin Athens again. And now a third is in order. (3) It turns out to have\nbeen ill-advised to assume that Xenophon would apply the same criteria\nfor accuracy to his Socratic discourses as to his\n histories.[4]\n The biographical and historical background Xenophon deploys in his\nmemoirs of Socrates fails to correspond to such additional sources as\nwe have from archaeology, history, the courts, and literature. The\nwidespread use of computers in classical studies, enabling the\ncomparison of ancient persons, and the compiling of information about\neach of them from disparate sources, has made incontrovertible this\nobservation about Xenophon’s Socratic works. Xenophon’s\nmemoirs are pastiches, several of which simply could not have occurred\nas presented.\nPlato (424/3–347)\n\nPhilosophers have usually privileged the account of Socrates given by\ntheir fellow philosopher, Plato. Plato was about twenty-five when\nSocrates was tried and executed, and had probably known the old man\nmost of his life. It would have been hard for a boy of Plato’s\nsocial class, registered in the political district (deme) of Collytus\nwithin the city walls, to avoid Socrates. The extant sources agree\nthat Socrates was often to be found where youths of the city spent\ntheir time. Further, Plato’s representation of individual\nAthenians has proved over time to correspond remarkably well to both\narchaeological and literary evidence: in his use of names and places,\nfamilial relations and friendship bonds, and even in his rough dating\nof events in almost all the authentic dialogues where Socrates is the\ndominant figure. The dialogues have dramatic dates that fall into\nplace as one learns more about their characters and, despite\nincidental anachronisms, it turns out that there is more realism in\nthe dialogues than most have\n suspected.[5]\n The Ion, Lysis, Euthydemus, Meno,\nMenexenus, Theaetetus, Euthyphro,\nCratylus, the frame of Symposium, Apology,\nCrito, Phaedo (although Plato says he was not\nhimself present at Socrates’s execution), and the frame of\nParmenides are the dialogues in which Plato had greatest\naccess to Athenians he depicts.\n\nIt does not follow, however, that Plato represented the views and\nmethods of Socrates (or anyone, for that matter) as he recalled them,\nmuch less as they were originally uttered. There are a number of\ncautions and caveats that should be in place from the start. (i) Plato\nmay have shaped the character Socrates (or other characters) to serve\nhis own purposes, whether philosophical or literary or both. (ii) The\ndialogues representing Socrates as a youth and young man took place,\nif they took place at all, before Plato was born and when he was a\nsmall child. (iii) One should be cautious even about the dramatic\ndates of Plato’s dialogues because they are calculated with\nreference to characters whom we know primarily, though not only, from\nthe dialogues. (iv) Exact dates should be treated with a measure of\nskepticism for numerical precision can be misleading. Even when a\nspecific festival or other reference fixes the season or month of a\ndialogue, or birth of a character, one should imagine a margin of\nerror. Although it becomes obnoxious to use circa or\nplus-minus everywhere, the ancients did not require or desire\ncontemporary precision in these matters. All the children born during\na full year, for example, had the same nominal birthday, accounting\nfor the conversation at Lysis 207b, odd by contemporary\nstandards, in which two boys disagree about who is the elder.\nPhilosophers have often decided to bypass the historical problems\naltogether and to assume for the sake of argument that Plato’s\nSocrates is the Socrates who is relevant to potential\nprogress in philosophy. That strategy, as we shall soon see, gives\nrise to a new Socratic problem (§2.2).\n\nWhat, after all, is our motive for reading a dead philosopher’s\nwords about another dead philosopher who never wrote anything himself?\nThis is a way of asking a popular question, Why do history of\nphilosophy? —which has no settled answer. One might reply that\nour study of some of our philosophical predecessors is\nintrinsically valuable, philosophically enlightening and\nsatisfying. When we contemplate the words of a dead philosopher, a\nphilosopher with whom we cannot engage directly—Plato’s\nwords, say—we seek to understand not merely what he said and\nassumed, but what his statements imply, and whether they are true.\nOthers’ words can prompt the exploration of new and rich veins\nof philosophy. Sometimes, making such judgments about the text\nrequires us to learn the language in which the philosopher wrote, more\nabout his predecessors’ ideas and those of his contemporaries.\nThe truly great philosophers, and Plato was one of them, are still\ncapable of becoming our companions in philosophical conversation, our\ndialectical partners. Because he addressed timeless, universal,\nfundamental questions with insight and intelligence, our own\nunderstanding of such questions is heightened whether we agree or\ndisagree. That explains Plato, one might say, but where is Socrates in\nthis picture? Is he interesting merely as a predecessor to Plato? Some\nwould say yes, but others would say it is not Plato’s but\nSocrates’s ideas and methods that mark the real beginning of\nphilosophy in the West, that Socrates is the better dialectical guide,\nand that what is Socratic in the dialogues should be distinguished\nfrom what is Platonic (§2.2). But how? That again is the\nSocratic problem.\n",
    "section_title": "2.1 Three primary sources: Aristophanes, Xenophon, and Plato",
    "entry_title": "Socrates",
    "hierarchy_title": "Socrates || The Socratic problem: Who was Socrates really? || Three primary sources: Aristophanes, Xenophon, and Plato",
    "tokenized_text": [
        "socratic",
        "problem",
        "socrates",
        "really",
        "three",
        "primary",
        "source",
        "aristophanes",
        "xenophon",
        "plato",
        "three",
        "primary",
        "source",
        "aristophanes",
        "xenophon",
        "plato",
        "aristophanes",
        "earliest",
        "extant",
        "sourceand",
        "one",
        "claim",
        "known",
        "socrates",
        "vigorous",
        "midlifeis",
        "playwright",
        "aristophanes",
        "comedy",
        "cloud",
        "produced",
        "within",
        "year",
        "battle",
        "delium",
        "socrates",
        "fought",
        "hoplite",
        "xenophon",
        "plato",
        "infant",
        "play",
        "character",
        "called",
        "socrates",
        "head",
        "thinkorama",
        "young",
        "men",
        "study",
        "natural",
        "world",
        "insect",
        "star",
        "study",
        "slick",
        "argumentative",
        "technique",
        "well",
        "lacking",
        "respect",
        "athenian",
        "sense",
        "propriety",
        "actor",
        "wearing",
        "mask",
        "socrates",
        "make",
        "fun",
        "traditional",
        "god",
        "athens",
        "line",
        "mimicked",
        "later",
        "young",
        "protagonist",
        "give",
        "naturalistic",
        "explanation",
        "phenomenon",
        "athenian",
        "viewed",
        "divinely",
        "directed",
        "line",
        "cf",
        "theaetetus",
        "e",
        "cd",
        "ea",
        "phaedo",
        "aa",
        "worst",
        "teach",
        "dishonest",
        "technique",
        "avoiding",
        "repayment",
        "debt",
        "line",
        "encourages",
        "young",
        "men",
        "beat",
        "parent",
        "submission",
        "line",
        "comedy",
        "nature",
        "tricky",
        "source",
        "information",
        "anyone",
        "yet",
        "favor",
        "aristophanes",
        "source",
        "socrates",
        "xenophon",
        "plato",
        "fortyfive",
        "year",
        "younger",
        "socrates",
        "acquaintance",
        "could",
        "socrates",
        "later",
        "year",
        "could",
        "socrates",
        "really",
        "changed",
        "much",
        "lampooning",
        "younger",
        "socrates",
        "found",
        "cloud",
        "comic",
        "poet",
        "reconciled",
        "plato",
        "characterization",
        "philosopher",
        "fifty",
        "sixty",
        "said",
        "yes",
        "pointing",
        "year",
        "cloud",
        "socrates",
        "trial",
        "year",
        "war",
        "upheaval",
        "changing",
        "everyone",
        "athenian",
        "intellectual",
        "freedom",
        "pericles",
        "proud",
        "beginning",
        "war",
        "thucydides",
        "eroded",
        "completely",
        "end",
        "see",
        "thus",
        "seemed",
        "comical",
        "quarter",
        "century",
        "earlier",
        "socrates",
        "hanging",
        "basket",
        "onstage",
        "talking",
        "nonsense",
        "ominous",
        "memory",
        "good",
        "reason",
        "believe",
        "aristophanes",
        "representation",
        "socrates",
        "merely",
        "comic",
        "exaggeration",
        "systematically",
        "misleading",
        "retrospect",
        "kenneth",
        "dover",
        "view",
        "cloud",
        "amalgamates",
        "one",
        "character",
        "socrates",
        "feature",
        "well",
        "known",
        "unique",
        "specific",
        "fifthcentury",
        "intellectual",
        "xxxiilvii",
        "perhaps",
        "aristophanes",
        "chose",
        "socrates",
        "represent",
        "gardenvariety",
        "intellectual",
        "socrates",
        "physiognomy",
        "strange",
        "enough",
        "get",
        "laugh",
        "aristophanes",
        "sometimes",
        "speaks",
        "voice",
        "play",
        "giving",
        "u",
        "good",
        "reason",
        "believe",
        "genuinely",
        "objected",
        "social",
        "instability",
        "brought",
        "freedom",
        "athenian",
        "youth",
        "enjoyed",
        "study",
        "professional",
        "rhetorician",
        "sophist",
        "see",
        "natural",
        "philosopher",
        "eg",
        "like",
        "presocratics",
        "studied",
        "cosmos",
        "nature",
        "profession",
        "could",
        "lucrative",
        "socrates",
        "eschewed",
        "earning",
        "potential",
        "philosophy",
        "seem",
        "significant",
        "great",
        "writer",
        "comedy",
        "aristophanes",
        "depiction",
        "socrates",
        "important",
        "plato",
        "socrates",
        "say",
        "trial",
        "apology",
        "ab",
        "c",
        "juror",
        "grown",
        "believing",
        "falsehood",
        "attributed",
        "play",
        "socrates",
        "call",
        "aristophanes",
        "dangerous",
        "three",
        "men",
        "brought",
        "charge",
        "aristophanes",
        "poisoned",
        "juror",
        "mind",
        "young",
        "aristophanes",
        "stop",
        "accusing",
        "socrates",
        "cloud",
        "placed",
        "third",
        "behind",
        "another",
        "play",
        "socrates",
        "mentioned",
        "barefoot",
        "rather",
        "soon",
        "began",
        "writing",
        "revision",
        "circulated",
        "never",
        "produced",
        "complicating",
        "matter",
        "revision",
        "extant",
        "version",
        "play",
        "aristophanes",
        "appears",
        "given",
        "reviving",
        "cloud",
        "comic",
        "ridicule",
        "socrates",
        "continued",
        "bird",
        "frog",
        "aristophanes",
        "complained",
        "socrates",
        "deleterious",
        "effect",
        "youth",
        "city",
        "including",
        "socrates",
        "neglect",
        "poet",
        "aristophanes",
        "even",
        "coin",
        "verb",
        "socratize",
        "conveying",
        "range",
        "unsavory",
        "behavior",
        "xenophon",
        "another",
        "source",
        "historical",
        "socrates",
        "soldierhistorian",
        "xenophon",
        "xenophon",
        "say",
        "explicitly",
        "socrates",
        "never",
        "acquainted",
        "anyone",
        "took",
        "greater",
        "care",
        "find",
        "companion",
        "knew",
        "memorabilia",
        "plato",
        "corroborates",
        "xenophon",
        "statement",
        "illustrating",
        "throughout",
        "dialogue",
        "socrates",
        "adjustment",
        "level",
        "type",
        "question",
        "particular",
        "individual",
        "talked",
        "true",
        "socrates",
        "succeeded",
        "pitching",
        "conversation",
        "right",
        "level",
        "companion",
        "striking",
        "difference",
        "xenophon",
        "socrates",
        "plato",
        "largely",
        "explained",
        "difference",
        "two",
        "personality",
        "xenophon",
        "practical",
        "man",
        "whose",
        "ability",
        "recognize",
        "philosophical",
        "issue",
        "almost",
        "imperceptible",
        "plausible",
        "socrates",
        "practical",
        "helpful",
        "advisor",
        "side",
        "socrates",
        "xenophon",
        "experienced",
        "xenophon",
        "socrates",
        "differs",
        "additionally",
        "plato",
        "offering",
        "advice",
        "subject",
        "xenophon",
        "experienced",
        "socrates",
        "moneymaking",
        "xenophon",
        "memorabilia",
        "estate",
        "management",
        "xenophon",
        "oeconomicus",
        "suggesting",
        "xenophon",
        "may",
        "entered",
        "writing",
        "socratic",
        "discourse",
        "aristotle",
        "labeled",
        "genre",
        "poetics",
        "b",
        "making",
        "character",
        "socrates",
        "mouthpiece",
        "view",
        "work",
        "mentioning",
        "featuring",
        "socrates",
        "anabasis",
        "apology",
        "hellenica",
        "symposium",
        "something",
        "strengthened",
        "xenophon",
        "prima",
        "facie",
        "claim",
        "source",
        "socrates",
        "life",
        "work",
        "historian",
        "hellenica",
        "history",
        "greece",
        "one",
        "chief",
        "source",
        "period",
        "thucydides",
        "history",
        "abruptly",
        "end",
        "midst",
        "peloponnesian",
        "war",
        "although",
        "xenophon",
        "tends",
        "moralize",
        "follow",
        "superior",
        "convention",
        "introduced",
        "thucydides",
        "still",
        "sometimes",
        "argued",
        "philosophical",
        "ax",
        "grind",
        "xenophon",
        "may",
        "presented",
        "accurate",
        "portrait",
        "socrates",
        "plato",
        "two",
        "consideration",
        "always",
        "weakened",
        "claim",
        "socrates",
        "xenophon",
        "work",
        "pedestrian",
        "difficult",
        "imagine",
        "inspiring",
        "fifteen",
        "people",
        "write",
        "socratic",
        "discourse",
        "period",
        "following",
        "death",
        "xenophon",
        "could",
        "chalked",
        "many",
        "hour",
        "socrates",
        "reliable",
        "informant",
        "lived",
        "erchia",
        "kilometer",
        "across",
        "hymettus",
        "mountain",
        "socrates",
        "haunt",
        "urban",
        "area",
        "athens",
        "love",
        "horse",
        "horsemanship",
        "wrote",
        "stillvaluable",
        "treatise",
        "took",
        "considerable",
        "time",
        "left",
        "athens",
        "expedition",
        "persia",
        "variety",
        "reason",
        "mercenary",
        "service",
        "thracian",
        "spartan",
        "exile",
        "never",
        "resided",
        "athens",
        "third",
        "order",
        "turn",
        "illadvised",
        "assume",
        "xenophon",
        "would",
        "apply",
        "criterion",
        "accuracy",
        "socratic",
        "discourse",
        "history",
        "biographical",
        "historical",
        "background",
        "xenophon",
        "deploys",
        "memoir",
        "socrates",
        "fails",
        "correspond",
        "additional",
        "source",
        "archaeology",
        "history",
        "court",
        "literature",
        "widespread",
        "use",
        "computer",
        "classical",
        "study",
        "enabling",
        "comparison",
        "ancient",
        "person",
        "compiling",
        "information",
        "disparate",
        "source",
        "made",
        "incontrovertible",
        "observation",
        "xenophon",
        "socratic",
        "work",
        "xenophon",
        "memoir",
        "pastiche",
        "several",
        "simply",
        "could",
        "occurred",
        "presented",
        "plato",
        "philosopher",
        "usually",
        "privileged",
        "account",
        "socrates",
        "given",
        "fellow",
        "philosopher",
        "plato",
        "plato",
        "twentyfive",
        "socrates",
        "tried",
        "executed",
        "probably",
        "known",
        "old",
        "man",
        "life",
        "would",
        "hard",
        "boy",
        "plato",
        "social",
        "class",
        "registered",
        "political",
        "district",
        "deme",
        "collytus",
        "within",
        "city",
        "wall",
        "avoid",
        "socrates",
        "extant",
        "source",
        "agree",
        "socrates",
        "often",
        "found",
        "youth",
        "city",
        "spent",
        "time",
        "plato",
        "representation",
        "individual",
        "athenian",
        "proved",
        "time",
        "correspond",
        "remarkably",
        "well",
        "archaeological",
        "literary",
        "evidence",
        "use",
        "name",
        "place",
        "familial",
        "relation",
        "friendship",
        "bond",
        "even",
        "rough",
        "dating",
        "event",
        "almost",
        "authentic",
        "dialogue",
        "socrates",
        "dominant",
        "figure",
        "dialogue",
        "dramatic",
        "date",
        "fall",
        "place",
        "one",
        "learns",
        "character",
        "despite",
        "incidental",
        "anachronism",
        "turn",
        "realism",
        "dialogue",
        "suspected",
        "ion",
        "lysis",
        "euthydemus",
        "meno",
        "menexenus",
        "theaetetus",
        "euthyphro",
        "cratylus",
        "frame",
        "symposium",
        "apology",
        "crito",
        "phaedo",
        "although",
        "plato",
        "say",
        "present",
        "socrates",
        "execution",
        "frame",
        "parmenides",
        "dialogue",
        "plato",
        "greatest",
        "access",
        "athenian",
        "depicts",
        "follow",
        "however",
        "plato",
        "represented",
        "view",
        "method",
        "socrates",
        "anyone",
        "matter",
        "recalled",
        "much",
        "le",
        "originally",
        "uttered",
        "number",
        "caution",
        "caveat",
        "place",
        "start",
        "plato",
        "may",
        "shaped",
        "character",
        "socrates",
        "character",
        "serve",
        "purpose",
        "whether",
        "philosophical",
        "literary",
        "ii",
        "dialogue",
        "representing",
        "socrates",
        "youth",
        "young",
        "man",
        "took",
        "place",
        "took",
        "place",
        "plato",
        "born",
        "small",
        "child",
        "iii",
        "one",
        "cautious",
        "even",
        "dramatic",
        "date",
        "plato",
        "dialogue",
        "calculated",
        "reference",
        "character",
        "know",
        "primarily",
        "though",
        "dialogue",
        "iv",
        "exact",
        "date",
        "treated",
        "measure",
        "skepticism",
        "numerical",
        "precision",
        "misleading",
        "even",
        "specific",
        "festival",
        "reference",
        "fix",
        "season",
        "month",
        "dialogue",
        "birth",
        "character",
        "one",
        "imagine",
        "margin",
        "error",
        "although",
        "becomes",
        "obnoxious",
        "use",
        "circa",
        "plusminus",
        "everywhere",
        "ancient",
        "require",
        "desire",
        "contemporary",
        "precision",
        "matter",
        "child",
        "born",
        "full",
        "year",
        "example",
        "nominal",
        "birthday",
        "accounting",
        "conversation",
        "lysis",
        "b",
        "odd",
        "contemporary",
        "standard",
        "two",
        "boy",
        "disagree",
        "elder",
        "philosopher",
        "often",
        "decided",
        "bypass",
        "historical",
        "problem",
        "altogether",
        "assume",
        "sake",
        "argument",
        "plato",
        "socrates",
        "socrates",
        "relevant",
        "potential",
        "progress",
        "philosophy",
        "strategy",
        "shall",
        "soon",
        "see",
        "give",
        "rise",
        "new",
        "socratic",
        "problem",
        "motive",
        "reading",
        "dead",
        "philosopher",
        "word",
        "another",
        "dead",
        "philosopher",
        "never",
        "wrote",
        "anything",
        "way",
        "asking",
        "popular",
        "question",
        "history",
        "philosophy",
        "which",
        "settled",
        "answer",
        "one",
        "might",
        "reply",
        "study",
        "philosophical",
        "predecessor",
        "intrinsically",
        "valuable",
        "philosophically",
        "enlightening",
        "satisfying",
        "contemplate",
        "word",
        "dead",
        "philosopher",
        "philosopher",
        "engage",
        "directlyplato",
        "word",
        "saywe",
        "seek",
        "understand",
        "merely",
        "said",
        "assumed",
        "statement",
        "imply",
        "whether",
        "true",
        "others",
        "word",
        "prompt",
        "exploration",
        "new",
        "rich",
        "vein",
        "philosophy",
        "sometimes",
        "making",
        "judgment",
        "text",
        "requires",
        "u",
        "learn",
        "language",
        "philosopher",
        "wrote",
        "predecessor",
        "idea",
        "contemporary",
        "truly",
        "great",
        "philosopher",
        "plato",
        "one",
        "still",
        "capable",
        "becoming",
        "companion",
        "philosophical",
        "conversation",
        "dialectical",
        "partner",
        "addressed",
        "timeless",
        "universal",
        "fundamental",
        "question",
        "insight",
        "intelligence",
        "understanding",
        "question",
        "heightened",
        "whether",
        "agree",
        "disagree",
        "explains",
        "plato",
        "one",
        "might",
        "say",
        "socrates",
        "picture",
        "interesting",
        "merely",
        "predecessor",
        "plato",
        "would",
        "say",
        "yes",
        "others",
        "would",
        "say",
        "plato",
        "socrates",
        "idea",
        "method",
        "mark",
        "real",
        "beginning",
        "philosophy",
        "west",
        "socrates",
        "better",
        "dialectical",
        "guide",
        "socratic",
        "dialogue",
        "distinguished",
        "platonic",
        "socratic",
        "problem"
    ]
}