{
    "main_text": "Solidarity in Practice || Civic Solidarity\n2.2 Civic Solidarity\n\nCivic solidarity refers to solidarity among citizens of modern states,\nand is often associated with the emergence and development of welfare\nstates. The term as used in this way first became popular in the\nlate-nineteenth century in France. The late-nineteenth century usages\nare outgrowths of earlier forms of socialism, but they develop the\nidea in directions that are less oppositional than the socialism that\nemerges as a political force in the wake of 1848. Two figures are\nassociated with its popularization during this period: Léon\nBourgeois and Emile Durkheim. We start with Léon Bourgeois\nsince his account was, at the time, more influential than\nDurkheim’s.\n\nIn 1896, Léon Bourgeois—prime minister of France from\n1895–6—published what would become the programmatic\nmanifesto of the Solidarist movement, namely a pamphlet entitled\nSolidarité (Bourgeois 1902). The pamphlet begins by\nnoting that all complex organisms reproduce themselves through an\ninternal division of labor. Each organ has a different function; their\ninterdependence is organized in such a way as to ensure the\nbeing’s self-preservation. Bourgeois calls this internal unity\nnatural solidarity. He then goes on to note that societies\nare organized in much the same way: the more complex a society is, the\nmore diverse and interdependent its internal division of labor. There\nare two differences. The first difference is that societies are made\nup of individuals possessed of reason and will, and so the laws of\nnature are not sufficient to ensure that the parts will coordinate to\nsustain and reproduce the life of the whole. The second difference\nfollows directly from the first. Because the coordination necessary to\nmaintain and reproduce a society depends on the reason and will of\nindividuals, the laws that govern that reproduction must also work via\nthose very same faculties. The laws governing social\nsolidarity are, therefore, necessarily moral.\n\nWhat mores ought to govern the division of labor and so,\nultimately, the distribution of the benefits and burdens of joint\nproduction (la répartition des profits et des\ncharges)? Bourgeois writes that we must look for an answer at the\nmoral implications of the very reciprocal dependence that constitutes\nsociety in the first place. Once we do so, we will see that every\nindividual within the societal division of labor owes the vast\npreponderance of what they are able to obtain from that\nsociety—for example, through their talents and abilities, or\nthrough the knowledge they acquire from that society—to two\nsources. First, they owe a debt to past generations and, second, to\ncontemporaries who, in the present, reproduce and advance the\ninstitutions, knowledge, resources, and societal conventions from\nwhich they gain (almost) all that is theirs.\n\n\n[Because of man’s dependence on the societal division of labor]\na necessary exchange of services exists between each and all. The free\ndevelopment of his faculties, of his activities, in short, of his very\nbeing, can only be realized, for each individual, as a result\nof the concurrent contributions of other men’s faculties and\nactivities. This free development can, furthermore, only reach its\nfull extent as a result of the accumulated contributions of the\npast.\n\nThere is therefore a debt owed by each to all the rest, in virtue of\nthe contributions and services rendered by all to each. (Bourgeois\n1902: 137, translation by Sangiovanni)\n\n\nMoral solidarity requires, then, citizens to identify with\none another as jointly responsible for the social product, and to be\nprepared to discharge the social debt through common institutions\ndesigned to insure people against unemployment, sickness, and old age,\nto maintain jobs open to talents, and to support a public system of\neducation. Lack of moral solidarity, Bourgeois implies, will lead\ninevitably to lack of coordination among the parts, and so to a\nbreakdown in natural solidarity.\n\nPublished a few years earlier than Bourgeois’ pamphlet,\nDurkheim’s doctoral thesis—The Division of Labor in\nSociety (1893)—distinguished between the\nmechanical solidarity typical of premodern, less complex\nsocieties and the organic solidarity of modern industrialized\nsocieties. Societies whose social cohesion is founded on mechanical\nsolidarity are integrated through a “collective\nconsciousness” that defines a common way of life. Where\nmechanical solidarity is characterized by similarity among\nmembers of a society, organic solidarity is characterized by\ndifference. At the heart of organic solidarity is, as it was\nfor Bourgeois, the division of labor. Modern societies must be\nintegrated via the coordinated interdependence of an extensive\ndivision of labor. But Durkheim is adamant that the coordinated\nfunctioning of the different parts is not self-regulating. He\nemphasizes the need for a diffuse moral solidarity to\nreinforce and stabilize the functioning of the division of labor.\n(Top-down regulation via the state—which is “too\nremote” and “general”—is also not enough\n[Durkheim 1893 [1984: 27]].) This solidarity can no longer come from\nthe “collective consciousness” (as it did in premodern\nsocieties): the differentiation of modern society increases\nindividualism and diversity, undoing the bonds of similarity that tie\ntogether premodern societies. What sources are left to support the\nmutual “attraction”, disposition to come to other’s\naid, and trust required for the cohesion of a society?\n\nHis proposed solution is clearest in the Second Preface to the\nDivision of Labor, added in 1902. He suggests that the state\nalone cannot guarantee the conditions necessary for maintaining\nsolidarity against the three predominant causes of social unrest in\nmodern, differentiated societies. The first cause is anomie,\nthe loss of direction and orientation that can accompany\nspecialization. Anomie is the primary social danger accompanying the\ngrowing depth and extent of the division of labor, and threatens the\nsense in which we each are essential contributors to the success of\nsociety as a whole (Durkheim 1893/1902 [1984: 289–90]). The\nsecond cause is force, the sense of injustice that arises\nfrom a feeling that one’s work is not valued according to its\nworth and one’s own merits—the sense, in short, that one\nis exploited. Such grievances are especially strong when premodern\nelements of caste persist in modern conditions. The third cause is\ndisuse, or the aimlessness, resentment, and lack of focus\nthat comes from not having enough work. In each case, Durkheim argues,\nthe citizen comes to lose a grip on his larger place in reproducing\nthe whole; as he turns inwards, his grievances seem to him larger and\nhis duties to others less pressing; he is less fulfilled by his labor,\nseeing it no longer as a reflection of his nature; mistrust takes\nroot; he no longer sees his potential employers as cooperative\npartners, but begins to see them as enemies.\n\nIn the Preface, he argues that only the “professional grouping\nis a moral force capable of curbing individual egoism” (Durkheim\n1893/1902 [1984: 11]). By “professional grouping”,\nDurkheim meant that the various industrial branches of an economy\nwould be grouped into corporations (modelled on the feudal\ncorporation). Unlike unions, corporations would constituted by both\nemployers and employees, and would have the power to regulate wages,\nconditions of work, appointments and promotions; they would also have\nthe authority to coordinate with other branches and with government.\nThe effect of such groupings would be to recreate solidarity where it\nwas most under pressure:\n\n\nWithin a political society [e.g., a corporation], as soon as a certain\nnumber of individuals find they hold in common ideas, interests,\nsentiments and occupations which the rest of the population does not\nshare in, it is inevitable that, under the influence of these\nsimilarities, they should be attracted to one another. … It is\nimpossible for men to live together and be in regular contact with one\nanother without their acquiring some feeling for the totality which\nthey constitute through having united together, without their becoming\nattached to it, concerning themselves with its interests and taking it\ninto account in their behaviour. (Durkheim 1893/1902 [1984:\n17–8])\n\n\nThe idea was that, in grouping together in smaller, functionally\norganized units individuals would regain their sense of contributing\nto society while, at the same time, giving everyone a felt stake in\nthe justice and fairness required to reproduce it. In sum, organic\nsolidarity refers to the bonds of mutual sacrifice and attraction that\ndevelop when each citizen realizes how the contribution they make to\nthe overall functioning of the society as a whole, via their economic\nand social role, depends on a tightly knit, interdependent web of more\nparticular associations.\n",
    "section_title": "2.2 Civic Solidarity",
    "entry_title": "Solidarity in Social and Political Philosophy",
    "hierarchy_title": "Solidarity in Social and Political Philosophy || Solidarity in Practice || Civic Solidarity",
    "tokenized_text": [
        "solidarity",
        "practice",
        "civic",
        "solidarity",
        "civic",
        "solidarity",
        "civic",
        "solidarity",
        "refers",
        "solidarity",
        "among",
        "citizen",
        "modern",
        "state",
        "often",
        "associated",
        "emergence",
        "development",
        "welfare",
        "state",
        "term",
        "used",
        "way",
        "first",
        "became",
        "popular",
        "latenineteenth",
        "century",
        "france",
        "latenineteenth",
        "century",
        "usage",
        "outgrowth",
        "earlier",
        "form",
        "socialism",
        "develop",
        "idea",
        "direction",
        "le",
        "oppositional",
        "socialism",
        "emerges",
        "political",
        "force",
        "wake",
        "two",
        "figure",
        "associated",
        "popularization",
        "period",
        "léon",
        "bourgeois",
        "emile",
        "durkheim",
        "start",
        "léon",
        "bourgeois",
        "since",
        "account",
        "time",
        "influential",
        "durkheim",
        "léon",
        "bourgeoisprime",
        "minister",
        "france",
        "published",
        "would",
        "become",
        "programmatic",
        "manifesto",
        "solidarist",
        "movement",
        "namely",
        "pamphlet",
        "entitled",
        "solidarité",
        "bourgeois",
        "pamphlet",
        "begin",
        "noting",
        "complex",
        "organism",
        "reproduce",
        "internal",
        "division",
        "labor",
        "organ",
        "different",
        "function",
        "interdependence",
        "organized",
        "way",
        "ensure",
        "selfpreservation",
        "bourgeois",
        "call",
        "internal",
        "unity",
        "natural",
        "solidarity",
        "go",
        "note",
        "society",
        "organized",
        "much",
        "way",
        "complex",
        "society",
        "diverse",
        "interdependent",
        "internal",
        "division",
        "labor",
        "two",
        "difference",
        "first",
        "difference",
        "society",
        "made",
        "individual",
        "possessed",
        "reason",
        "law",
        "nature",
        "sufficient",
        "ensure",
        "part",
        "coordinate",
        "sustain",
        "reproduce",
        "life",
        "whole",
        "second",
        "difference",
        "follows",
        "directly",
        "first",
        "coordination",
        "necessary",
        "maintain",
        "reproduce",
        "society",
        "depends",
        "reason",
        "individual",
        "law",
        "govern",
        "reproduction",
        "must",
        "also",
        "work",
        "via",
        "faculty",
        "law",
        "governing",
        "social",
        "solidarity",
        "therefore",
        "necessarily",
        "moral",
        "more",
        "ought",
        "govern",
        "division",
        "labor",
        "ultimately",
        "distribution",
        "benefit",
        "burden",
        "joint",
        "production",
        "la",
        "répartition",
        "de",
        "profit",
        "et",
        "de",
        "charge",
        "bourgeois",
        "writes",
        "must",
        "look",
        "answer",
        "moral",
        "implication",
        "reciprocal",
        "dependence",
        "constitutes",
        "society",
        "first",
        "place",
        "see",
        "every",
        "individual",
        "within",
        "societal",
        "division",
        "labor",
        "owes",
        "vast",
        "preponderance",
        "able",
        "obtain",
        "societyfor",
        "example",
        "talent",
        "ability",
        "knowledge",
        "acquire",
        "societyto",
        "two",
        "source",
        "first",
        "owe",
        "debt",
        "past",
        "generation",
        "second",
        "contemporary",
        "present",
        "reproduce",
        "advance",
        "institution",
        "knowledge",
        "resource",
        "societal",
        "convention",
        "gain",
        "almost",
        "man",
        "dependence",
        "societal",
        "division",
        "labor",
        "necessary",
        "exchange",
        "service",
        "exists",
        "free",
        "development",
        "faculty",
        "activity",
        "short",
        "realized",
        "individual",
        "result",
        "concurrent",
        "contribution",
        "men",
        "faculty",
        "activity",
        "free",
        "development",
        "furthermore",
        "reach",
        "full",
        "extent",
        "result",
        "accumulated",
        "contribution",
        "past",
        "therefore",
        "debt",
        "owed",
        "rest",
        "virtue",
        "contribution",
        "service",
        "rendered",
        "bourgeois",
        "translation",
        "sangiovanni",
        "moral",
        "solidarity",
        "requires",
        "citizen",
        "identify",
        "one",
        "another",
        "jointly",
        "responsible",
        "social",
        "product",
        "prepared",
        "discharge",
        "social",
        "debt",
        "common",
        "institution",
        "designed",
        "insure",
        "people",
        "unemployment",
        "sickness",
        "old",
        "age",
        "maintain",
        "job",
        "open",
        "talent",
        "support",
        "public",
        "system",
        "education",
        "lack",
        "moral",
        "solidarity",
        "bourgeois",
        "implies",
        "lead",
        "inevitably",
        "lack",
        "coordination",
        "among",
        "part",
        "breakdown",
        "natural",
        "solidarity",
        "published",
        "year",
        "earlier",
        "bourgeois",
        "pamphlet",
        "durkheim",
        "doctoral",
        "thesisthe",
        "division",
        "labor",
        "society",
        "distinguished",
        "mechanical",
        "solidarity",
        "typical",
        "premodern",
        "le",
        "complex",
        "society",
        "organic",
        "solidarity",
        "modern",
        "industrialized",
        "society",
        "society",
        "whose",
        "social",
        "cohesion",
        "founded",
        "mechanical",
        "solidarity",
        "integrated",
        "collective",
        "consciousness",
        "defines",
        "common",
        "way",
        "life",
        "mechanical",
        "solidarity",
        "characterized",
        "similarity",
        "among",
        "member",
        "society",
        "organic",
        "solidarity",
        "characterized",
        "difference",
        "heart",
        "organic",
        "solidarity",
        "bourgeois",
        "division",
        "labor",
        "modern",
        "society",
        "must",
        "integrated",
        "via",
        "coordinated",
        "interdependence",
        "extensive",
        "division",
        "labor",
        "durkheim",
        "adamant",
        "coordinated",
        "functioning",
        "different",
        "part",
        "selfregulating",
        "emphasizes",
        "need",
        "diffuse",
        "moral",
        "solidarity",
        "reinforce",
        "stabilize",
        "functioning",
        "division",
        "labor",
        "topdown",
        "regulation",
        "via",
        "statewhich",
        "remote",
        "general",
        "is",
        "also",
        "enough",
        "durkheim",
        "solidarity",
        "longer",
        "come",
        "collective",
        "consciousness",
        "premodern",
        "society",
        "differentiation",
        "modern",
        "society",
        "increase",
        "individualism",
        "diversity",
        "undoing",
        "bond",
        "similarity",
        "tie",
        "together",
        "premodern",
        "society",
        "source",
        "left",
        "support",
        "mutual",
        "attraction",
        "disposition",
        "come",
        "aid",
        "trust",
        "required",
        "cohesion",
        "society",
        "proposed",
        "solution",
        "clearest",
        "second",
        "preface",
        "division",
        "labor",
        "added",
        "suggests",
        "state",
        "alone",
        "guarantee",
        "condition",
        "necessary",
        "maintaining",
        "solidarity",
        "three",
        "predominant",
        "cause",
        "social",
        "unrest",
        "modern",
        "differentiated",
        "society",
        "first",
        "cause",
        "anomie",
        "loss",
        "direction",
        "orientation",
        "accompany",
        "specialization",
        "anomie",
        "primary",
        "social",
        "danger",
        "accompanying",
        "growing",
        "depth",
        "extent",
        "division",
        "labor",
        "threatens",
        "sense",
        "essential",
        "contributor",
        "success",
        "society",
        "whole",
        "durkheim",
        "second",
        "cause",
        "force",
        "sense",
        "injustice",
        "arises",
        "feeling",
        "one",
        "work",
        "valued",
        "according",
        "worth",
        "one",
        "meritsthe",
        "sense",
        "short",
        "one",
        "exploited",
        "grievance",
        "especially",
        "strong",
        "premodern",
        "element",
        "caste",
        "persist",
        "modern",
        "condition",
        "third",
        "cause",
        "disuse",
        "aimlessness",
        "resentment",
        "lack",
        "focus",
        "come",
        "enough",
        "work",
        "case",
        "durkheim",
        "argues",
        "citizen",
        "come",
        "lose",
        "grip",
        "larger",
        "place",
        "reproducing",
        "whole",
        "turn",
        "inwards",
        "grievance",
        "seem",
        "larger",
        "duty",
        "others",
        "le",
        "pressing",
        "le",
        "fulfilled",
        "labor",
        "seeing",
        "longer",
        "reflection",
        "nature",
        "mistrust",
        "take",
        "root",
        "longer",
        "see",
        "potential",
        "employer",
        "cooperative",
        "partner",
        "begin",
        "see",
        "enemy",
        "preface",
        "argues",
        "professional",
        "grouping",
        "moral",
        "force",
        "capable",
        "curbing",
        "individual",
        "egoism",
        "durkheim",
        "professional",
        "grouping",
        "durkheim",
        "meant",
        "various",
        "industrial",
        "branch",
        "economy",
        "would",
        "grouped",
        "corporation",
        "modelled",
        "feudal",
        "corporation",
        "unlike",
        "union",
        "corporation",
        "would",
        "constituted",
        "employer",
        "employee",
        "would",
        "power",
        "regulate",
        "wage",
        "condition",
        "work",
        "appointment",
        "promotion",
        "would",
        "also",
        "authority",
        "coordinate",
        "branch",
        "government",
        "effect",
        "grouping",
        "would",
        "recreate",
        "solidarity",
        "pressure",
        "within",
        "political",
        "society",
        "eg",
        "corporation",
        "soon",
        "certain",
        "number",
        "individual",
        "find",
        "hold",
        "common",
        "idea",
        "interest",
        "sentiment",
        "occupation",
        "rest",
        "population",
        "share",
        "inevitable",
        "influence",
        "similarity",
        "attracted",
        "one",
        "another",
        "impossible",
        "men",
        "live",
        "together",
        "regular",
        "contact",
        "one",
        "another",
        "without",
        "acquiring",
        "feeling",
        "totality",
        "constitute",
        "united",
        "together",
        "without",
        "becoming",
        "attached",
        "concerning",
        "interest",
        "taking",
        "account",
        "behaviour",
        "durkheim",
        "idea",
        "grouping",
        "together",
        "smaller",
        "functionally",
        "organized",
        "unit",
        "individual",
        "would",
        "regain",
        "sense",
        "contributing",
        "society",
        "time",
        "giving",
        "everyone",
        "felt",
        "stake",
        "justice",
        "fairness",
        "required",
        "reproduce",
        "sum",
        "organic",
        "solidarity",
        "refers",
        "bond",
        "mutual",
        "sacrifice",
        "attraction",
        "develop",
        "citizen",
        "realizes",
        "contribution",
        "make",
        "overall",
        "functioning",
        "society",
        "whole",
        "via",
        "economic",
        "social",
        "role",
        "depends",
        "tightly",
        "knit",
        "interdependent",
        "web",
        "particular",
        "association"
    ]
}