{
    "main_text": "Historical Context: Buddhism, Daoism, and Neo-Confucianism\n1. Historical Context: Buddhism, Daoism, and Neo-Confucianism\n\nMost of the leading Confucian thinkers in the Song, Yuan, and Ming\ndynasties are now described in English as Neo-Confucians, using a term\nof somewhat ambiguous scope and significance. In the broadest sense,\n“Neo-Confucian” refers to a thinker and practitioner of\nthe Tang dynasty (618–907) or later who identified with and\nworked to revive Confucian values, beliefs, and practices after the\nrise of Buddhism in China. Construed more narrowly,\n“Neo-Confucian” refers to a subset of the above thinkers\nthat belonged or traced much of their philosophical origins to an\nimportant group of Confucians in the 11th century. This\ngroup included Zhou Dunyi (1017–1073), Zhang Zai\n(1020–1077), and on some accounts Shao Yong (1011–1077),\nbut the philosophers who loomed largest among them were the brothers\nCheng Hao (1032–1085) and Cheng Yi (1033–1107). The Cheng\nbrothers were most influential of this group, having explicated the\nmetaphysics and techniques of mental discipline that they took to be\nimplicit in Confucian texts and thereby positioning Confucianism as a\ndirect and more formidable rival to Buddhism. Many of the\nNeo-Confucians who saw themselves as building on the tradition of the\nCheng brothers identified with a movement known in Chinese as\nDaoxue 道學, “The Learning of the\nWay”, whose goal at the movement’s inception was to shift\nthe emphasis of formal education away from literary attainments and\nrefocus it on the moral Way (Dao 道) (Bol 2008). With a\nfew notable exceptions in the late Ming dynasty, nearly all of the\nleading Confucian thinkers in the Song-Ming period were Neo-Confucians\nin both the broader and narrower senses: they sought to reestablish\nConfucianism after many generations of neglect; they saw learning the\nmoral Way as the central aim of a proper education; and they were\neither in the 11th century group that included the Cheng\nbrothers or identified with the Chengs’ lineage and\nteachings.\n\nMost (but not all) of these philosophers saw Confucianism as being in\ncompetition with its popular rivals, Buddhism and Daoism. They thought\ncore Confucian doctrines and practices incompatible with Buddhism and\nDaoism and regarded the latter two traditions as having an overall\ndetrimental effect on Chinese society, accounting to a great extent\nfor what they saw as a general decline in moral character and the\ndissolution of family and other social bonds. Even as the prominent\nSong-Ming Confucians sought to distinguish Confucianism from its\nrivals, however, the conceptual schemes and much of the philosophical\nvocabulary that they used were drawn from a broader philosophical and\nreligious discourse in which Buddhist and Daoist ideas and terms were\nubiquitous. Framing Confucian views in such terms helped to give them\nwidespread respectability and currency among learned people.\nFurthermore, many of the influential Song-Ming Confucians dabbled in\nBuddhism before coming to align themselves with Confucianism.\nConsequently, the break from Buddhism and Daoism was not as clean as\nmany believed, and it is useful to look not just at what they rejected\nbut also at what they quietly and (mostly) inadvertently adopted from\ntheir rivals. \n\nAlthough the Neo-Confucians took Buddhism and Daoism to be different\ntraditions calling for different critiques, they nevertheless tended\nto see both as sharing some common defects. Perhaps the most\nfar-reaching defect was that, as most Song-Ming Neo-Confucians saw it,\nBuddhists and Daoists thought personal liberation from suffering\nshould take precedence over other aims and values, and believed they\ncould only achieve this by extricating themselves from worldly\nentanglements, especially from human relationships and attachments to\nothers (JSL 13.3–4, 13.14). They argued that putting\nliberation from one’s own suffering before other values is\nselfish (si 私), motivated by personal gain\n(li 利), and can be construed as endorsing a form of\nnormative egoism (HNCSYS 1:3; JSL 13.1, 13.4, 13.6).\nFurthermore, by insisting on eliminating the desires and attachments\nrequired for human relationships, Buddhists and Daoists sacrificed\nimportant goods for the sake of transcendent ones, giving up their\nmore obvious, this-worldly interests for more speculative ones whose\nattainment often depends on unsubstantiated theories of the afterlife\n(as for Buddhist nirvana or Daoist theories of immortality)\n(JSL 13.8, 13.10; HNCSYS 3:66, 22A:292; Graham 1992:\n90–91).\n\nTo charge Buddhists with selfishness and egoism might appear to\noverlook some well-known features of Buddhist thought. The Buddhist\nEightfold Path includes duties to help others and prohibitions against\nharming others. The path of the bodhisattva in Mahāyāna\nBuddhism includes a long, perhaps indefinite period in which the\nbodhisattva embodies and practices great compassion (daci\n大慈) and commits to ending the suffering of all sentient\nlife before entering nirvana herself or himself. Neo-Confucians were\nwell aware of these aspects of Chinese Buddhism, so a charitable and\nhistorically informed reading of their criticisms should be more\nnuanced. One better way of understanding the charge of selfishness is\nthat it describes what motivates most ordinary Buddhist practitioners\nin fact, not what motivates idealized practitioners in principle\n(HNCSYS 1:3; JSL 13.6). This would be a natural\nconsequence of the fact that the Buddhist route to other-directed\nconcern is considerably more demanding than the Confucian one, as care\nfor others is more easily attained through ordinary interactions with\nfamily and members of one’s community than through radical\nnonattachment (Lu 1980: 16–21; Tiwald & Van Norden 2014:\n257–260). Another variant of the Neo-Confucian criticism is to\nsuggest that subordinating ethics to soteriology has problematic\nimplications. If all norms, including ethical ones, are justified to a\nsignificant degree by their contribution to one’s own quest to\nend personal suffering, this will give a different shape to very\nnotion of goodness. Practices like donating to Buddhist shrines and\nmaintaining a Buddhist diet can potentially be conceived as\n“good” (shan 善) without essential\nreference to improving other people’s lives or participating\nably in human relationships (ZZYL 126:3033, Tiwald 2018a:\n134–37).\n\nSome Song-Ming Neo-Confucians also objected to what they saw as\nnaïve Buddhist and Daoist views about how best to gain control\nover unruly intentions and feelings, leaning too heavily on meditative\npractice to solve problems better addressed through a combination of\nstudy, reflection, and the cultivation of respect or reverence\n(JSL 13.6; ZZYL 126:3019; Tiwald 2018a:\n141–147). Finally, there was relatively widespread agreement\namong Confucians of this era that Buddhist metaphysics had gotten\nsomething fundamentally wrong about the ultimate nature of things.\nBuddhists in China often emphasized what they called the emptiness or\nvoidness (kong 空) of all phenomenal things, which\nNeo-Confucians took to mean that such things are illusory and without\nvalue. This in turn was supposed to explain why Buddhists aimed to\ntranscend the phenomenal world, for nothing of value could be gained\nby rearranging illusions (Fu 1986; JSL 13.12). In point of\nfact, this characterization elides many of the subtleties and variants\nof the Buddhist doctrine of emptiness, which Buddhists saw as\nconsistent with caring about and acting to mitigate the phenomenal\nsuffering of phenomenal entities. The influential Song Neo-Confucian\nZhu Xi acknowledged as much, but seems to have believed that the\ntransparently problematic conception of emptiness was the operative\none in most Buddhist practices (ZZYL 126:3013; Cai 2009:\n204–206; Fu 1986; Tiwald 2018a: 147–154).\n\nNevertheless and without question, there are prominent and fundamental\nviews in Song-Ming Neo-Confucianism that bear the marks of Buddhist\nand Daoist influence. One is the Neo-Confucian account of the goodness\nof human nature. Many of the major Neo-Confucians of this period\nendorsed the view that the ethical predispositions in human nature are\nwell-formed from birth, so that a great deal of the work of\ncultivating virtue was primarily a matter of recovering and\neliminating the obstructions that prevent us from accessing that\nnature, especially selfish or self-centered desires and the various\nbad habits and biases that they present (Ivanhoe 2000). These\nphilosophers took themselves to be expounding a doctrine of human\nnature found in the Mencius, but in fact Mencius seems to\nhave thought that “human nature is good”\n(xingshan 性善) is true by virtue of the fact\nthat human beings have a natural capacity or potential to\nbecome good, not that they are innately good or have\nwell-formed ethical predispositions right from the start\n(Mencius 6A6, 6A8). A more likely source for the idea that we\nhave well-formed predispositions innately is Chinese Buddhism, which\nhad long held that humans (and all sentient beings) have at all times\na kind of buddha-nature (foxing 佛性) or\nbuddha-womb (in Sanskrit, tathāgatagarbha; in Chinese,\nrulai zang 如來藏) with fully-formed\npropensities to respond perfectly to its circumstances. Here too the\nwell-formed nature is to be recovered or discovered by removing\nobstacles, which for Buddhists were seen as false and adventitious\nconceptualizations of things. Neo-Confucians even used or adapted many\nof the metaphors that Buddhists had long used to describe the\ncircumstances in which our perfect nature becomes blocked, likening it\nto a pearl suspended in muddy water or a mirror covered with dust\n(Jorgensen 2018: 73–86; Z. Liu 2003).\n\nDaoxue Confucians also adopted a technical term that had, by\ntheir time, long been used in Buddhist metaphysics to account for the\nultimate nature and unity of things. This term was li\n理 (Pattern, Principle), which the Buddhists sometimes\ncharacterized as emptiness and Neo-Confucians described as (or as a\nsource or ground of) ceaseless life-generativity (sheng sheng bu\nxi 生生不息), understood as a system in\nwhich birth, growth, and procreation work in harmony to maintain the\ncontinuity of living things. Here again the Neo-Confucians took\nthemselves to be elucidating an idea that they found in classical\nConfucian texts, but in fact there was very little mention of\nli in the classical canon, and even less that could plausibly\nbe read as having the same metaphysical sense as the Neo-Confucians\nproposed (Dai 2009: 265–286; Ivanhoe 2002: 46–58; Makeham\n2003b: 193–195). Other notable influences from both Buddhism and\nDaoism were a greater interest in meditation (Chan 1989:\n255–270; Cai 2009: 195–197; Yang 2015) and a tendency to\nsee self-abnegation or the elimination of desires as a major aim of\nself-cultivation. Some Neo-Confucians saw themselves as embracing a\nwider array of desires than their Daoist and Buddhist counterparts,\nbut due in large part to the influence of Zhu Xi, many cut a\nrelatively sharp distinction between what they saw as permissible\ndesires consistent with the Pattern of ceaseless life-generativity and\nthe impermissible desires as selfish ones (Chan 1989: 197–211).\nIn so doing they ruled out a wider swath of desires than the classical\nConfucians probably intended (Tiwald 2012: 30–33). Add to these\ninfluences a wide array of shared conceptual frameworks, technical\nterms, and philosophical problematics and Song-Ming articulations of\nConfucianism become very difficult to disentangle from longstanding\nBuddhist and Daoist ways of thinking (Angle 2018; Araki 2008; Ivanhoe,\n2002; Makeham 2018a; Ziporyn 2018). \n",
    "section_title": "1. Historical Context: Buddhism, Daoism, and Neo-Confucianism",
    "entry_title": "Song-Ming Confucianism",
    "hierarchy_title": "Song-Ming Confucianism || Historical Context: Buddhism, Daoism, and Neo-Confucianism",
    "tokenized_text": [
        "historical",
        "context",
        "buddhism",
        "daoism",
        "neoconfucianism",
        "historical",
        "context",
        "buddhism",
        "daoism",
        "neoconfucianism",
        "leading",
        "confucian",
        "thinker",
        "song",
        "yuan",
        "ming",
        "dynasty",
        "described",
        "english",
        "neoconfucians",
        "using",
        "term",
        "somewhat",
        "ambiguous",
        "scope",
        "significance",
        "broadest",
        "sense",
        "neoconfucian",
        "refers",
        "thinker",
        "practitioner",
        "tang",
        "dynasty",
        "later",
        "identified",
        "worked",
        "revive",
        "confucian",
        "value",
        "belief",
        "practice",
        "rise",
        "buddhism",
        "china",
        "construed",
        "narrowly",
        "neoconfucian",
        "refers",
        "subset",
        "thinker",
        "belonged",
        "traced",
        "much",
        "philosophical",
        "origin",
        "important",
        "group",
        "confucian",
        "th",
        "century",
        "group",
        "included",
        "zhou",
        "dunyi",
        "zhang",
        "zai",
        "account",
        "shao",
        "yong",
        "philosopher",
        "loomed",
        "largest",
        "among",
        "brother",
        "cheng",
        "hao",
        "cheng",
        "yi",
        "cheng",
        "brother",
        "influential",
        "group",
        "explicated",
        "metaphysics",
        "technique",
        "mental",
        "discipline",
        "took",
        "implicit",
        "confucian",
        "text",
        "thereby",
        "positioning",
        "confucianism",
        "direct",
        "formidable",
        "rival",
        "buddhism",
        "many",
        "neoconfucians",
        "saw",
        "building",
        "tradition",
        "cheng",
        "brother",
        "identified",
        "movement",
        "known",
        "chinese",
        "daoxue",
        "道學",
        "learning",
        "way",
        "whose",
        "goal",
        "movement",
        "inception",
        "shift",
        "emphasis",
        "formal",
        "education",
        "away",
        "literary",
        "attainment",
        "refocus",
        "moral",
        "way",
        "dao",
        "道",
        "bol",
        "notable",
        "exception",
        "late",
        "ming",
        "dynasty",
        "nearly",
        "leading",
        "confucian",
        "thinker",
        "songming",
        "period",
        "neoconfucians",
        "broader",
        "narrower",
        "sens",
        "sought",
        "reestablish",
        "confucianism",
        "many",
        "generation",
        "neglect",
        "saw",
        "learning",
        "moral",
        "way",
        "central",
        "aim",
        "proper",
        "education",
        "either",
        "th",
        "century",
        "group",
        "included",
        "cheng",
        "brother",
        "identified",
        "chengs",
        "lineage",
        "teaching",
        "philosopher",
        "saw",
        "confucianism",
        "competition",
        "popular",
        "rival",
        "buddhism",
        "daoism",
        "thought",
        "core",
        "confucian",
        "doctrine",
        "practice",
        "incompatible",
        "buddhism",
        "daoism",
        "regarded",
        "latter",
        "two",
        "tradition",
        "overall",
        "detrimental",
        "effect",
        "chinese",
        "society",
        "accounting",
        "great",
        "extent",
        "saw",
        "general",
        "decline",
        "moral",
        "character",
        "dissolution",
        "family",
        "social",
        "bond",
        "even",
        "prominent",
        "songming",
        "confucian",
        "sought",
        "distinguish",
        "confucianism",
        "rival",
        "however",
        "conceptual",
        "scheme",
        "much",
        "philosophical",
        "vocabulary",
        "used",
        "drawn",
        "broader",
        "philosophical",
        "religious",
        "discourse",
        "buddhist",
        "daoist",
        "idea",
        "term",
        "ubiquitous",
        "framing",
        "confucian",
        "view",
        "term",
        "helped",
        "give",
        "widespread",
        "respectability",
        "currency",
        "among",
        "learned",
        "people",
        "furthermore",
        "many",
        "influential",
        "songming",
        "confucian",
        "dabbled",
        "buddhism",
        "coming",
        "align",
        "confucianism",
        "consequently",
        "break",
        "buddhism",
        "daoism",
        "clean",
        "many",
        "believed",
        "useful",
        "look",
        "rejected",
        "also",
        "quietly",
        "mostly",
        "inadvertently",
        "adopted",
        "rival",
        "although",
        "neoconfucians",
        "took",
        "buddhism",
        "daoism",
        "different",
        "tradition",
        "calling",
        "different",
        "critique",
        "nevertheless",
        "tended",
        "see",
        "sharing",
        "common",
        "defect",
        "perhaps",
        "farreaching",
        "defect",
        "songming",
        "neoconfucians",
        "saw",
        "buddhist",
        "daoists",
        "thought",
        "personal",
        "liberation",
        "suffering",
        "take",
        "precedence",
        "aim",
        "value",
        "believed",
        "could",
        "achieve",
        "extricating",
        "worldly",
        "entanglement",
        "especially",
        "human",
        "relationship",
        "attachment",
        "others",
        "jsl",
        "argued",
        "putting",
        "liberation",
        "one",
        "suffering",
        "value",
        "selfish",
        "si",
        "私",
        "motivated",
        "personal",
        "gain",
        "li",
        "利",
        "construed",
        "endorsing",
        "form",
        "normative",
        "egoism",
        "hncsys",
        "jsl",
        "furthermore",
        "insisting",
        "eliminating",
        "desire",
        "attachment",
        "required",
        "human",
        "relationship",
        "buddhist",
        "daoists",
        "sacrificed",
        "important",
        "good",
        "sake",
        "transcendent",
        "one",
        "giving",
        "obvious",
        "thisworldly",
        "interest",
        "speculative",
        "one",
        "whose",
        "attainment",
        "often",
        "depends",
        "unsubstantiated",
        "theory",
        "afterlife",
        "buddhist",
        "nirvana",
        "daoist",
        "theory",
        "immortality",
        "jsl",
        "hncsys",
        "a",
        "graham",
        "charge",
        "buddhist",
        "selfishness",
        "egoism",
        "might",
        "appear",
        "overlook",
        "wellknown",
        "feature",
        "buddhist",
        "thought",
        "buddhist",
        "eightfold",
        "path",
        "includes",
        "duty",
        "help",
        "others",
        "prohibition",
        "harming",
        "others",
        "path",
        "bodhisattva",
        "mahāyāna",
        "buddhism",
        "includes",
        "long",
        "perhaps",
        "indefinite",
        "period",
        "bodhisattva",
        "embodies",
        "practice",
        "great",
        "compassion",
        "daci",
        "大慈",
        "commits",
        "ending",
        "suffering",
        "sentient",
        "life",
        "entering",
        "nirvana",
        "neoconfucians",
        "well",
        "aware",
        "aspect",
        "chinese",
        "buddhism",
        "charitable",
        "historically",
        "informed",
        "reading",
        "criticism",
        "nuanced",
        "one",
        "better",
        "way",
        "understanding",
        "charge",
        "selfishness",
        "describes",
        "motivates",
        "ordinary",
        "buddhist",
        "practitioner",
        "fact",
        "motivates",
        "idealized",
        "practitioner",
        "principle",
        "hncsys",
        "jsl",
        "would",
        "natural",
        "consequence",
        "fact",
        "buddhist",
        "route",
        "otherdirected",
        "concern",
        "considerably",
        "demanding",
        "confucian",
        "one",
        "care",
        "others",
        "easily",
        "attained",
        "ordinary",
        "interaction",
        "family",
        "member",
        "one",
        "community",
        "radical",
        "nonattachment",
        "lu",
        "tiwald",
        "van",
        "norden",
        "another",
        "variant",
        "neoconfucian",
        "criticism",
        "suggest",
        "subordinating",
        "ethic",
        "soteriology",
        "problematic",
        "implication",
        "norm",
        "including",
        "ethical",
        "one",
        "justified",
        "significant",
        "degree",
        "contribution",
        "one",
        "quest",
        "end",
        "personal",
        "suffering",
        "give",
        "different",
        "shape",
        "notion",
        "goodness",
        "practice",
        "like",
        "donating",
        "buddhist",
        "shrine",
        "maintaining",
        "buddhist",
        "diet",
        "potentially",
        "conceived",
        "good",
        "善",
        "without",
        "essential",
        "reference",
        "improving",
        "people",
        "life",
        "participating",
        "ably",
        "human",
        "relationship",
        "zzyl",
        "tiwald",
        "a",
        "songming",
        "neoconfucians",
        "also",
        "objected",
        "saw",
        "naïve",
        "buddhist",
        "daoist",
        "view",
        "best",
        "gain",
        "control",
        "unruly",
        "intention",
        "feeling",
        "leaning",
        "heavily",
        "meditative",
        "practice",
        "solve",
        "problem",
        "better",
        "addressed",
        "combination",
        "study",
        "reflection",
        "cultivation",
        "respect",
        "reverence",
        "jsl",
        "zzyl",
        "tiwald",
        "a",
        "finally",
        "relatively",
        "widespread",
        "agreement",
        "among",
        "confucian",
        "era",
        "buddhist",
        "metaphysics",
        "gotten",
        "something",
        "fundamentally",
        "wrong",
        "ultimate",
        "nature",
        "thing",
        "buddhist",
        "china",
        "often",
        "emphasized",
        "called",
        "emptiness",
        "voidness",
        "kong",
        "空",
        "phenomenal",
        "thing",
        "neoconfucians",
        "took",
        "mean",
        "thing",
        "illusory",
        "without",
        "value",
        "turn",
        "supposed",
        "explain",
        "buddhist",
        "aimed",
        "transcend",
        "phenomenal",
        "world",
        "nothing",
        "value",
        "could",
        "gained",
        "rearranging",
        "illusion",
        "fu",
        "jsl",
        "point",
        "fact",
        "characterization",
        "elides",
        "many",
        "subtlety",
        "variant",
        "buddhist",
        "doctrine",
        "emptiness",
        "buddhist",
        "saw",
        "consistent",
        "caring",
        "acting",
        "mitigate",
        "phenomenal",
        "suffering",
        "phenomenal",
        "entity",
        "influential",
        "song",
        "neoconfucian",
        "zhu",
        "xi",
        "acknowledged",
        "much",
        "seems",
        "believed",
        "transparently",
        "problematic",
        "conception",
        "emptiness",
        "operative",
        "one",
        "buddhist",
        "practice",
        "zzyl",
        "cai",
        "fu",
        "tiwald",
        "a",
        "nevertheless",
        "without",
        "question",
        "prominent",
        "fundamental",
        "view",
        "songming",
        "neoconfucianism",
        "bear",
        "mark",
        "buddhist",
        "daoist",
        "influence",
        "one",
        "neoconfucian",
        "account",
        "goodness",
        "human",
        "nature",
        "many",
        "major",
        "neoconfucians",
        "period",
        "endorsed",
        "view",
        "ethical",
        "predisposition",
        "human",
        "nature",
        "wellformed",
        "birth",
        "great",
        "deal",
        "work",
        "cultivating",
        "virtue",
        "primarily",
        "matter",
        "recovering",
        "eliminating",
        "obstruction",
        "prevent",
        "u",
        "accessing",
        "nature",
        "especially",
        "selfish",
        "selfcentered",
        "desire",
        "various",
        "bad",
        "habit",
        "bias",
        "present",
        "ivanhoe",
        "philosopher",
        "took",
        "expounding",
        "doctrine",
        "human",
        "nature",
        "found",
        "mencius",
        "fact",
        "mencius",
        "seems",
        "thought",
        "human",
        "nature",
        "good",
        "xingshan",
        "性善",
        "true",
        "virtue",
        "fact",
        "human",
        "being",
        "natural",
        "capacity",
        "potential",
        "become",
        "good",
        "innately",
        "good",
        "wellformed",
        "ethical",
        "predisposition",
        "right",
        "start",
        "mencius",
        "a",
        "a",
        "likely",
        "source",
        "idea",
        "wellformed",
        "predisposition",
        "innately",
        "chinese",
        "buddhism",
        "long",
        "held",
        "human",
        "sentient",
        "being",
        "time",
        "kind",
        "buddhanature",
        "foxing",
        "佛性",
        "buddhawomb",
        "sanskrit",
        "tathāgatagarbha",
        "chinese",
        "rulai",
        "zang",
        "如來藏",
        "fullyformed",
        "propensity",
        "respond",
        "perfectly",
        "circumstance",
        "wellformed",
        "nature",
        "recovered",
        "discovered",
        "removing",
        "obstacle",
        "buddhist",
        "seen",
        "false",
        "adventitious",
        "conceptualization",
        "thing",
        "neoconfucians",
        "even",
        "used",
        "adapted",
        "many",
        "metaphor",
        "buddhist",
        "long",
        "used",
        "describe",
        "circumstance",
        "perfect",
        "nature",
        "becomes",
        "blocked",
        "likening",
        "pearl",
        "suspended",
        "muddy",
        "water",
        "mirror",
        "covered",
        "dust",
        "jorgensen",
        "z",
        "liu",
        "daoxue",
        "confucian",
        "also",
        "adopted",
        "technical",
        "term",
        "time",
        "long",
        "used",
        "buddhist",
        "metaphysics",
        "account",
        "ultimate",
        "nature",
        "unity",
        "thing",
        "term",
        "li",
        "理",
        "pattern",
        "principle",
        "buddhist",
        "sometimes",
        "characterized",
        "emptiness",
        "neoconfucians",
        "described",
        "source",
        "ground",
        "ceaseless",
        "lifegenerativity",
        "sheng",
        "sheng",
        "bu",
        "xi",
        "生生不息",
        "understood",
        "system",
        "birth",
        "growth",
        "procreation",
        "work",
        "harmony",
        "maintain",
        "continuity",
        "living",
        "thing",
        "neoconfucians",
        "took",
        "elucidating",
        "idea",
        "found",
        "classical",
        "confucian",
        "text",
        "fact",
        "little",
        "mention",
        "li",
        "classical",
        "canon",
        "even",
        "le",
        "could",
        "plausibly",
        "read",
        "metaphysical",
        "sense",
        "neoconfucians",
        "proposed",
        "dai",
        "ivanhoe",
        "makeham",
        "b",
        "notable",
        "influence",
        "buddhism",
        "daoism",
        "greater",
        "interest",
        "meditation",
        "chan",
        "cai",
        "yang",
        "tendency",
        "see",
        "selfabnegation",
        "elimination",
        "desire",
        "major",
        "aim",
        "selfcultivation",
        "neoconfucians",
        "saw",
        "embracing",
        "wider",
        "array",
        "desire",
        "daoist",
        "buddhist",
        "counterpart",
        "due",
        "large",
        "part",
        "influence",
        "zhu",
        "xi",
        "many",
        "cut",
        "relatively",
        "sharp",
        "distinction",
        "saw",
        "permissible",
        "desire",
        "consistent",
        "pattern",
        "ceaseless",
        "lifegenerativity",
        "impermissible",
        "desire",
        "selfish",
        "one",
        "chan",
        "ruled",
        "wider",
        "swath",
        "desire",
        "classical",
        "confucian",
        "probably",
        "intended",
        "tiwald",
        "add",
        "influence",
        "wide",
        "array",
        "shared",
        "conceptual",
        "framework",
        "technical",
        "term",
        "philosophical",
        "problematics",
        "songming",
        "articulation",
        "confucianism",
        "become",
        "difficult",
        "disentangle",
        "longstanding",
        "buddhist",
        "daoist",
        "way",
        "thinking",
        "angle",
        "araki",
        "ivanhoe",
        "makeham",
        "a",
        "ziporyn"
    ]
}