{
    "main_text": "The Rise of the Sovereign State: Theory and Practice\n3. The Circumscription of the Sovereign State: Theory and Practice\n\nThe rise and global expansion of sovereignty, described and even\nlauded by political philosophers, amounts to one of the most\nformidable and successful political trends in modern times. But from\nits earliest days, sovereignty has also met with both doubters and\nqualified supporters, many of whom have regarded any body of\nlaw’s claim to sovereign status as a form of idolatry, sometimes\nas a carapace behind which rulers carry out cruelties and injustices\nfree from legitimate outside scrutiny. It was indeed after the\nHolocaust that meaningful legal and institutional circumscriptions of\nsovereignty in fact arose, many of which have come to abridge the\nrights of sovereign states quite significantly. The two most prominent\ncurtailments are conventions on human rights and European\nintegration.\n\nIt was in 1948 that the vast majority of states signed the Universal\nDeclaration of Human Rights, committing themselves to respect over 30\nseparate rights for individuals. As it was not a legally binding\ndeclaration and contained no enforcement provisions, the declaration\nleft states’ sovereignty intact, but it was a first step towards\ntethering them to international, universal obligations regarding their\ninternal affairs. Over decades, these human rights would come to enjoy\never stronger legal status. One of the most robust human rights\nconventions, one that indeed curtails sovereignty, even if mildly,\nthrough its arbitration mechanisms, is the European Convention for the\nProtection of Human Rights and Fundamental Freedoms, formed in 1950.\nRoughly contemporaneous, signed on December 9, 1948, was the Genocide\nConvention, committing signing states to refrain from and punish\ngenocide. Then, in the mid-1960’s, two covenants — the\nCovenant on Civil and Political Rights and the Covenant on Economic,\nSocial and Cultural Rights — legally bound most of the\nworld’s states to respecting the human rights of their people.\nAgain, the signatories’ constitutional authority remained\nlargely intact, since they would not allow any of these commitments to\ninfringe upon their sovereignty. Subsequent human rights covenants,\nalso signed by the vast majority of the world’s states,\ncontained similar reservations.\n\nOnly a practice of human rights backed up by military enforcement or\nrobust judicial procedures would circumscribe sovereignty in a serious\nway. Progress in this direction began to occur after the Cold War\nthrough a historic revision of the Peace of Westphalia, one that\ncurtails a norm strongly advanced by its treaties —\nnon-intervention. In a series of several episodes beginning in 1990,\nthe United Nations or another international organization has endorsed\na political action, usually involving military force, that the broad\nconsensus of states would have previously regarded as illegitimate\ninterference in internal affairs. The episodes have involved the\napproval of military operations to remedy an injustice within the\nboundaries of a state or the outside administration of domestic\nmatters like police operations. Unlike peacekeeping operations during\nthe Cold War, the operations have usually lacked the consent of the\ngovernment of the target state. They have occurred in Iraq, the former\nYugoslavia, Bosnia, Kosovo, Somalia, Rwanda, Haiti, Cambodia, Liberia,\nLibya and elsewhere. Although the legitimacy and wisdom of individual\ninterventions is often contested among states — the U.S. bombing\nof Iraq in December 1999 and NATO’s intervention in Kosovo, for\ninstance, failed to elicit U.N. Security Council endorsement, as did\nthe U.S. invasion of Iraq in 2003 — the broad practice of\nintervention is likely to continue to enjoy broad endorsement within\nthe U.N. Security Council and other international organizations.\n\nAn explicit call to revise the concept of sovereignty so as to allow\nfor internationally sanctioned intervention arose with The\nResponsibility to Protect, a document written and produced in 2001 by\nthe International Commission on Intervention and State Sovereignty, a\ncommission that the Government of Canada convened at the behest of\nU.N. Secretary General Kofi Annan. The document proposes a strong\nrevision of the classical conception by which sovereignty involves a\n“responsibility to protect” on the part of a state towards\nits own citizens, a responsibility that outsiders may assume when a\nstate perpetrates massive injustice or cannot protect its own\ncitizens. Responsibility to Protect has garnered wide international\nattention and serves as a manifesto for a concept of sovereignty that\nis non-absolute and conditional upon outside obligations.\n\nThe other way in which sovereignty is being circumscribed is through\nEuropean integration. This idea also arose in reaction to the\nHolocaust, a calamity that many European leaders attributed at least\nin part to the sovereign state’s lack of accountability.\nHistorically, the most enthusiastic supporters of European integration\nhave indeed come from Catholic Christian Democratic parties, whose\nideals are rooted in medieval Christendom, where at least in theory,\nno leader was sovereign and all leaders were accountable to a\nuniversal set of values. In the modern language of human rights and\ndemocracy, they echo Pope Innocent X’s excoriation of the Peace\nof Westphalia.\n\nEuropean integration began in 1950, when six states formed the\nEuropean Coal and Steel Community in the Treaty of Paris. The\ncommunity established joint international authority over the coal and\nsteel industries of these six countries, entailing executive control\nthrough a permanent bureaucracy and a decision-making Council of\nMinisters composed of foreign ministers of each state. This same model\nwas expanded to a general economic zone in the Treaty of Rome in 1957.\nIt was enhanced by a judicial body, the European Court of Justice, and\na legislature, the European Parliament, a directly elected Europe-wide\nbody. Over time, European integration has widened, as the institution\nnow consists of twenty-seven members, and deepened, as it did in the\n1991 Maastricht Treaty, which expanded the institution’s powers\nand reconfigured it as the European Union. Far from a replacement for\nstates, the European Union rather “pools” important\naspects of their sovereignty into a “supranational”\ninstitution in which their freedom of action is constrained (Keohane\n& Hoffman 1991). They are no longer absolutely sovereign. In\nrecent years, European integration has continued to advance in\nimportant respects. On December 1, 2009, the Treaty of Lisbon came\ninto full force, pooling sovereignty further by strengthening the\nCouncil of Ministers and the European Parliament, creating a High\nRepresentative of the Union for Foreign Affairs and Security Policy to\nrepresent a unified European Union position, and making the European\nUnion’s Charter of Fundamental Human Rights legally binding.\nHowever, strains on European integration have emerged in recent years\nas well. A treaty establishing a Constitution for Europe was signed by\nthe European Union’s member states in 2004, but referendums in\nFrance and the Netherlands in 2005 rejected it and prevented its\nratification. Then, in 2016, a referendum in the United Kingdom\nresulted in a victory for the U.K.’s withdrawal from the\nEuropean Union, popularly known as “Brexit.” \n\nThis circumscription of the sovereign state, through international\nnorms and supranational institutions, finds a parallel in contemporary\nphilosophers who attack the notion of absolute sovereignty. Their\nthought is not entirely new, for even in early modern times,\nphilosophers like Hugo Grotius, Alberico Gentili, and Francisco\nSuarez, though they accepted the state as a legitimate institution,\nthought that its authority ought to be limited, not absolute. The\ncruel prince, for instance, could be subject to a disciplining action\nfrom neighboring princes that is much like contemporary notions of\nhumanitarian intervention.\n\nTwo of the most prominent attacks on sovereignty by political\nphilosophers since World War II came in the 1950s from Bertrand de\nJouvenel and Jacques Maritain. In his prominent work of 1957,\nSovereignty: An Inquiry Into the Political Good, Jouvenel\nacknowledges that sovereignty is an important attribute of modern\npolitical authority, needed to quell disputes within the state and to\nmuster cooperation in defense against outsiders. But he roundly\ndecries the modern concept of sovereignty, which creates a power who\nis above the rules, a power whose decrees are to be considered\nlegitimate simply because they emanate from his will. To Jouvenel,\nsovereignty reached its peak in Hobbes, in whose “horrific\nconception everything comes back to means of constraint, which enable\nthe sovereign to issue rights and dictate laws in any way he pleases.\nBut these means of constraint are themselves but a fraction of the\nsocial forces concentrated in the hand of the sovereign” (197).\nDespite their differences over the locus and form of sovereignty,\nsubsequent thinkers like Locke, Pufendorf, and Rousseau “were to\nfeel the lure of this mechanically perfect construction” (198).\nThis was “the hour of sovereignty in itself,”\nwrites Jouvenel, the existence of which “hardly anyone would\nthenceforward have the hardihood to deny” (198).\n\nAs his description of Hobbes intimates, Jouvenel views early modern\nabsolute sovereignty with great alarm. “[I]t is the idea itself\nwhich is dangerous,” he writes (198). But rather than calling\nfor the concept to be abrogated, he holds that sovereignty must be\nchanneled so that sovereign authority wills nothing but what is\nlegitimate. Far from being defined by the sovereign, morality has an\nindependent validity. Appealing to the perspective of “Christian\nthinkers,” he argues that “there are . . . wills which are\njust and wills which are unjust” (201). “Authority,”\nthen, “carries with it the obligation to command the thing that\nshould be commanded” (201). This was the understanding of\nauthority held by the ancien regime, where effective advisers to the\nmonarch could channel his efforts towards the common good. What can\nchannel the sovereign will today? Jouvenel seems to doubt that\njudicial or constitutional design is alone enough. Rather, he places\nhis hope in the shared moral concepts of the citizenry, which act as a\nconstraint upon the choices of the sovereign.\n\nIn Chapter Two of his enduring work of 1951, Man and the\nState, Jacques Maritain shows little sympathy for sovereignty at\nall, not even the qualified sympathy of Jouvenel:\n\nIt is my contention that political philosophy must get rid of the\nword, as well as the concept, of Sovereignty:-not because it is an\nantiquated concept, or by virtue of a sociological-juridical theory of\n“objective law”; and not only because the concept of\nSovereignty creates insuperable difficulties and theoretical\nentanglements in the field of international law; but because,\nconsidered in its genuine meaning, and in the perspective of the\nproper scientific realm to which it belongs — political\nphilosophy — this concept is intrinsically wrong and bound to\nmislead us if we keep on using it — assuming that it has been\ntoo long and too largely accepted to be permissibly rejected, and\nunaware of the false connotations that are inherent in it\n(29–30).\n\nBodin’s and Hobbes’ mistake was in conceiving of\nsovereignty as authority that the people permanently transferred and\nalienated to an external entity, here the monarch. Rather than\nrepresenting the people and being accountable to it, the sovereign\nbecame a transcendent entity, holding the supreme and inalienable\nright to rule over the people, independently of them, rather than\nrepresenting the people, accountable to them. Like Jouvenel, Maritain\nrues the exaltation of the sovereign’s will such that what is\njust is what serves his interest. This is idolatry. Any transfer of\nthe authority of the body politic either to some part of itself or to\nsome outside entity — the apparatus of the state, a monarch, or\neven the people — is illegitimate, for the validity of a\ngovernment is rooted in its relationship to natural law. Sovereignty\ngives rise to three dysfunctionalities. First, its external dimension\nrenders inconceivable international law and a world state, to both of\nwhich Maritain is highly sympathetic. Second, the internal dimension\nof sovereignty, the absolute power of the state over the body politic,\nresults in centralism, not pluralism. Third, the supreme power of the\nsovereign state is contrary to the democratic notion of\naccountability.\n\nAs a Catholic philosopher, Maritain’s arguments run similar to\nChristian philosophers of early modern Europe who criticized absolute\nsovereignty. Witnessing the rise of the formidable entity of the\nstate, they sought to place limits on its power and authority. They\nare the ancestors of those who now demand limits on the state’s\nauthority in the name of human rights, of the right to quell genocide\nand disaster and deliver relief from the outside, of an international\ncriminal court, and of a supranational entity that assumes power of\ngovernance over economic, and now, maybe, military affairs.\n\nThe case for circumscribing sovereignty remains strong in the Catholic\nand other Christian traditions. Pope Benedict XVI made a case for the\nResponsibility to Protect, for instance, in his 2008 speech to the\nUnited Nations. In recent years, political philosophers in the liberal\ntradition have argued for the circumscription of sovereignty as well.\nTwo examples are Thomas Pogge (1992, and 2008, 174–201) and\nAllen Buchanan (2004). Both accord sovereignty an important but not an\nabsolute moral status, seeking to make room for possibilities such as\nhumanitarian intervention approved by the United Nations and the more\nrobust development of global institutions for fighting poverty.\n",
    "section_title": "3. The Circumscription of the Sovereign State: Theory and Practice",
    "entry_title": "Sovereignty",
    "hierarchy_title": "Sovereignty || The Rise of the Sovereign State: Theory and Practice",
    "tokenized_text": [
        "rise",
        "sovereign",
        "state",
        "theory",
        "practice",
        "circumscription",
        "sovereign",
        "state",
        "theory",
        "practice",
        "rise",
        "global",
        "expansion",
        "sovereignty",
        "described",
        "even",
        "lauded",
        "political",
        "philosopher",
        "amount",
        "one",
        "formidable",
        "successful",
        "political",
        "trend",
        "modern",
        "time",
        "earliest",
        "day",
        "sovereignty",
        "also",
        "met",
        "doubter",
        "qualified",
        "supporter",
        "many",
        "regarded",
        "body",
        "law",
        "claim",
        "sovereign",
        "status",
        "form",
        "idolatry",
        "sometimes",
        "carapace",
        "behind",
        "ruler",
        "carry",
        "cruelty",
        "injustice",
        "free",
        "legitimate",
        "outside",
        "scrutiny",
        "indeed",
        "holocaust",
        "meaningful",
        "legal",
        "institutional",
        "circumscription",
        "sovereignty",
        "fact",
        "arose",
        "many",
        "come",
        "abridge",
        "right",
        "sovereign",
        "state",
        "quite",
        "significantly",
        "two",
        "prominent",
        "curtailment",
        "convention",
        "human",
        "right",
        "european",
        "integration",
        "vast",
        "majority",
        "state",
        "signed",
        "universal",
        "declaration",
        "human",
        "right",
        "committing",
        "respect",
        "separate",
        "right",
        "individual",
        "legally",
        "binding",
        "declaration",
        "contained",
        "enforcement",
        "provision",
        "declaration",
        "left",
        "state",
        "sovereignty",
        "intact",
        "first",
        "step",
        "towards",
        "tethering",
        "international",
        "universal",
        "obligation",
        "regarding",
        "internal",
        "affair",
        "decade",
        "human",
        "right",
        "would",
        "come",
        "enjoy",
        "ever",
        "stronger",
        "legal",
        "status",
        "one",
        "robust",
        "human",
        "right",
        "convention",
        "one",
        "indeed",
        "curtails",
        "sovereignty",
        "even",
        "mildly",
        "arbitration",
        "mechanism",
        "european",
        "convention",
        "protection",
        "human",
        "right",
        "fundamental",
        "freedom",
        "formed",
        "roughly",
        "contemporaneous",
        "signed",
        "december",
        "genocide",
        "convention",
        "committing",
        "signing",
        "state",
        "refrain",
        "punish",
        "genocide",
        "mid",
        "two",
        "covenant",
        "covenant",
        "civil",
        "political",
        "right",
        "covenant",
        "economic",
        "social",
        "cultural",
        "right",
        "legally",
        "bound",
        "world",
        "state",
        "respecting",
        "human",
        "right",
        "people",
        "signatory",
        "constitutional",
        "authority",
        "remained",
        "largely",
        "intact",
        "since",
        "would",
        "allow",
        "commitment",
        "infringe",
        "upon",
        "sovereignty",
        "subsequent",
        "human",
        "right",
        "covenant",
        "also",
        "signed",
        "vast",
        "majority",
        "world",
        "state",
        "contained",
        "similar",
        "reservation",
        "practice",
        "human",
        "right",
        "backed",
        "military",
        "enforcement",
        "robust",
        "judicial",
        "procedure",
        "would",
        "circumscribe",
        "sovereignty",
        "serious",
        "way",
        "progress",
        "direction",
        "began",
        "occur",
        "cold",
        "war",
        "historic",
        "revision",
        "peace",
        "westphalia",
        "one",
        "curtails",
        "norm",
        "strongly",
        "advanced",
        "treaty",
        "nonintervention",
        "series",
        "several",
        "episode",
        "beginning",
        "united",
        "nation",
        "another",
        "international",
        "organization",
        "endorsed",
        "political",
        "action",
        "usually",
        "involving",
        "military",
        "force",
        "broad",
        "consensus",
        "state",
        "would",
        "previously",
        "regarded",
        "illegitimate",
        "interference",
        "internal",
        "affair",
        "episode",
        "involved",
        "approval",
        "military",
        "operation",
        "remedy",
        "injustice",
        "within",
        "boundary",
        "state",
        "outside",
        "administration",
        "domestic",
        "matter",
        "like",
        "police",
        "operation",
        "unlike",
        "peacekeeping",
        "operation",
        "cold",
        "war",
        "operation",
        "usually",
        "lacked",
        "consent",
        "government",
        "target",
        "state",
        "occurred",
        "iraq",
        "former",
        "yugoslavia",
        "bosnia",
        "kosovo",
        "somalia",
        "rwanda",
        "haiti",
        "cambodia",
        "liberia",
        "libya",
        "elsewhere",
        "although",
        "legitimacy",
        "wisdom",
        "individual",
        "intervention",
        "often",
        "contested",
        "among",
        "state",
        "us",
        "bombing",
        "iraq",
        "december",
        "nato",
        "intervention",
        "kosovo",
        "instance",
        "failed",
        "elicit",
        "un",
        "security",
        "council",
        "endorsement",
        "us",
        "invasion",
        "iraq",
        "broad",
        "practice",
        "intervention",
        "likely",
        "continue",
        "enjoy",
        "broad",
        "endorsement",
        "within",
        "un",
        "security",
        "council",
        "international",
        "organization",
        "explicit",
        "call",
        "revise",
        "concept",
        "sovereignty",
        "allow",
        "internationally",
        "sanctioned",
        "intervention",
        "arose",
        "responsibility",
        "protect",
        "document",
        "written",
        "produced",
        "international",
        "commission",
        "intervention",
        "state",
        "sovereignty",
        "commission",
        "government",
        "canada",
        "convened",
        "behest",
        "un",
        "secretary",
        "general",
        "kofi",
        "annan",
        "document",
        "proposes",
        "strong",
        "revision",
        "classical",
        "conception",
        "sovereignty",
        "involves",
        "responsibility",
        "protect",
        "part",
        "state",
        "towards",
        "citizen",
        "responsibility",
        "outsider",
        "may",
        "assume",
        "state",
        "perpetrates",
        "massive",
        "injustice",
        "protect",
        "citizen",
        "responsibility",
        "protect",
        "garnered",
        "wide",
        "international",
        "attention",
        "serf",
        "manifesto",
        "concept",
        "sovereignty",
        "nonabsolute",
        "conditional",
        "upon",
        "outside",
        "obligation",
        "way",
        "sovereignty",
        "circumscribed",
        "european",
        "integration",
        "idea",
        "also",
        "arose",
        "reaction",
        "holocaust",
        "calamity",
        "many",
        "european",
        "leader",
        "attributed",
        "least",
        "part",
        "sovereign",
        "state",
        "lack",
        "accountability",
        "historically",
        "enthusiastic",
        "supporter",
        "european",
        "integration",
        "indeed",
        "come",
        "catholic",
        "christian",
        "democratic",
        "party",
        "whose",
        "ideal",
        "rooted",
        "medieval",
        "christendom",
        "least",
        "theory",
        "leader",
        "sovereign",
        "leader",
        "accountable",
        "universal",
        "set",
        "value",
        "modern",
        "language",
        "human",
        "right",
        "democracy",
        "echo",
        "pope",
        "innocent",
        "x",
        "excoriation",
        "peace",
        "westphalia",
        "european",
        "integration",
        "began",
        "six",
        "state",
        "formed",
        "european",
        "coal",
        "steel",
        "community",
        "treaty",
        "paris",
        "community",
        "established",
        "joint",
        "international",
        "authority",
        "coal",
        "steel",
        "industry",
        "six",
        "country",
        "entailing",
        "executive",
        "control",
        "permanent",
        "bureaucracy",
        "decisionmaking",
        "council",
        "minister",
        "composed",
        "foreign",
        "minister",
        "state",
        "model",
        "expanded",
        "general",
        "economic",
        "zone",
        "treaty",
        "rome",
        "enhanced",
        "judicial",
        "body",
        "european",
        "court",
        "justice",
        "legislature",
        "european",
        "parliament",
        "directly",
        "elected",
        "europewide",
        "body",
        "time",
        "european",
        "integration",
        "widened",
        "institution",
        "consists",
        "twentyseven",
        "member",
        "deepened",
        "maastricht",
        "treaty",
        "expanded",
        "institution",
        "power",
        "reconfigured",
        "european",
        "union",
        "far",
        "replacement",
        "state",
        "european",
        "union",
        "rather",
        "pool",
        "important",
        "aspect",
        "sovereignty",
        "supranational",
        "institution",
        "freedom",
        "action",
        "constrained",
        "keohane",
        "hoffman",
        "longer",
        "absolutely",
        "sovereign",
        "recent",
        "year",
        "european",
        "integration",
        "continued",
        "advance",
        "important",
        "respect",
        "december",
        "treaty",
        "lisbon",
        "came",
        "full",
        "force",
        "pooling",
        "sovereignty",
        "strengthening",
        "council",
        "minister",
        "european",
        "parliament",
        "creating",
        "high",
        "representative",
        "union",
        "foreign",
        "affair",
        "security",
        "policy",
        "represent",
        "unified",
        "european",
        "union",
        "position",
        "making",
        "european",
        "union",
        "charter",
        "fundamental",
        "human",
        "right",
        "legally",
        "binding",
        "however",
        "strain",
        "european",
        "integration",
        "emerged",
        "recent",
        "year",
        "well",
        "treaty",
        "establishing",
        "constitution",
        "europe",
        "signed",
        "european",
        "union",
        "member",
        "state",
        "referendum",
        "france",
        "netherlands",
        "rejected",
        "prevented",
        "ratification",
        "referendum",
        "united",
        "kingdom",
        "resulted",
        "victory",
        "uk",
        "withdrawal",
        "european",
        "union",
        "popularly",
        "known",
        "brexit",
        "circumscription",
        "sovereign",
        "state",
        "international",
        "norm",
        "supranational",
        "institution",
        "find",
        "parallel",
        "contemporary",
        "philosopher",
        "attack",
        "notion",
        "absolute",
        "sovereignty",
        "thought",
        "entirely",
        "new",
        "even",
        "early",
        "modern",
        "time",
        "philosopher",
        "like",
        "hugo",
        "grotius",
        "alberico",
        "gentili",
        "francisco",
        "suarez",
        "though",
        "accepted",
        "state",
        "legitimate",
        "institution",
        "thought",
        "authority",
        "ought",
        "limited",
        "absolute",
        "cruel",
        "prince",
        "instance",
        "could",
        "subject",
        "disciplining",
        "action",
        "neighboring",
        "prince",
        "much",
        "like",
        "contemporary",
        "notion",
        "humanitarian",
        "intervention",
        "two",
        "prominent",
        "attack",
        "sovereignty",
        "political",
        "philosopher",
        "since",
        "world",
        "war",
        "ii",
        "came",
        "s",
        "bertrand",
        "de",
        "jouvenel",
        "jacques",
        "maritain",
        "prominent",
        "work",
        "sovereignty",
        "inquiry",
        "political",
        "good",
        "jouvenel",
        "acknowledges",
        "sovereignty",
        "important",
        "attribute",
        "modern",
        "political",
        "authority",
        "needed",
        "quell",
        "dispute",
        "within",
        "state",
        "muster",
        "cooperation",
        "defense",
        "outsider",
        "roundly",
        "decries",
        "modern",
        "concept",
        "sovereignty",
        "creates",
        "power",
        "rule",
        "power",
        "whose",
        "decree",
        "considered",
        "legitimate",
        "simply",
        "emanate",
        "jouvenel",
        "sovereignty",
        "reached",
        "peak",
        "hobbes",
        "whose",
        "horrific",
        "conception",
        "everything",
        "come",
        "back",
        "mean",
        "constraint",
        "enable",
        "sovereign",
        "issue",
        "right",
        "dictate",
        "law",
        "way",
        "plea",
        "mean",
        "constraint",
        "fraction",
        "social",
        "force",
        "concentrated",
        "hand",
        "sovereign",
        "despite",
        "difference",
        "locus",
        "form",
        "sovereignty",
        "subsequent",
        "thinker",
        "like",
        "locke",
        "pufendorf",
        "rousseau",
        "feel",
        "lure",
        "mechanically",
        "perfect",
        "construction",
        "hour",
        "sovereignty",
        "writes",
        "jouvenel",
        "existence",
        "hardly",
        "anyone",
        "would",
        "thenceforward",
        "hardihood",
        "deny",
        "description",
        "hobbes",
        "intimate",
        "jouvenel",
        "view",
        "early",
        "modern",
        "absolute",
        "sovereignty",
        "great",
        "alarm",
        "idea",
        "dangerous",
        "writes",
        "rather",
        "calling",
        "concept",
        "abrogated",
        "hold",
        "sovereignty",
        "must",
        "channeled",
        "sovereign",
        "authority",
        "will",
        "nothing",
        "legitimate",
        "far",
        "defined",
        "sovereign",
        "morality",
        "independent",
        "validity",
        "appealing",
        "perspective",
        "christian",
        "thinker",
        "argues",
        "will",
        "will",
        "unjust",
        "authority",
        "carry",
        "obligation",
        "command",
        "thing",
        "commanded",
        "understanding",
        "authority",
        "held",
        "ancien",
        "regime",
        "effective",
        "adviser",
        "monarch",
        "could",
        "channel",
        "effort",
        "towards",
        "common",
        "good",
        "channel",
        "sovereign",
        "today",
        "jouvenel",
        "seems",
        "doubt",
        "judicial",
        "constitutional",
        "design",
        "alone",
        "enough",
        "rather",
        "place",
        "hope",
        "shared",
        "moral",
        "concept",
        "citizenry",
        "act",
        "constraint",
        "upon",
        "choice",
        "sovereign",
        "chapter",
        "two",
        "enduring",
        "work",
        "man",
        "state",
        "jacques",
        "maritain",
        "show",
        "little",
        "sympathy",
        "sovereignty",
        "even",
        "qualified",
        "sympathy",
        "jouvenel",
        "contention",
        "political",
        "philosophy",
        "must",
        "get",
        "rid",
        "word",
        "well",
        "concept",
        "sovereignty",
        "not",
        "antiquated",
        "concept",
        "virtue",
        "sociologicaljuridical",
        "theory",
        "objective",
        "law",
        "concept",
        "sovereignty",
        "creates",
        "insuperable",
        "difficulty",
        "theoretical",
        "entanglement",
        "field",
        "international",
        "law",
        "considered",
        "genuine",
        "meaning",
        "perspective",
        "proper",
        "scientific",
        "realm",
        "belongs",
        "political",
        "philosophy",
        "concept",
        "intrinsically",
        "wrong",
        "bound",
        "mislead",
        "u",
        "keep",
        "using",
        "assuming",
        "long",
        "largely",
        "accepted",
        "permissibly",
        "rejected",
        "unaware",
        "false",
        "connotation",
        "inherent",
        "bodin",
        "hobbes",
        "mistake",
        "conceiving",
        "sovereignty",
        "authority",
        "people",
        "permanently",
        "transferred",
        "alienated",
        "external",
        "entity",
        "monarch",
        "rather",
        "representing",
        "people",
        "accountable",
        "sovereign",
        "became",
        "transcendent",
        "entity",
        "holding",
        "supreme",
        "inalienable",
        "right",
        "rule",
        "people",
        "independently",
        "rather",
        "representing",
        "people",
        "accountable",
        "like",
        "jouvenel",
        "maritain",
        "rue",
        "exaltation",
        "sovereign",
        "serf",
        "interest",
        "idolatry",
        "transfer",
        "authority",
        "body",
        "politic",
        "either",
        "part",
        "outside",
        "entity",
        "apparatus",
        "state",
        "monarch",
        "even",
        "people",
        "illegitimate",
        "validity",
        "government",
        "rooted",
        "relationship",
        "natural",
        "law",
        "sovereignty",
        "give",
        "rise",
        "three",
        "dysfunctionalities",
        "first",
        "external",
        "dimension",
        "render",
        "inconceivable",
        "international",
        "law",
        "world",
        "state",
        "maritain",
        "highly",
        "sympathetic",
        "second",
        "internal",
        "dimension",
        "sovereignty",
        "absolute",
        "power",
        "state",
        "body",
        "politic",
        "result",
        "centralism",
        "pluralism",
        "third",
        "supreme",
        "power",
        "sovereign",
        "state",
        "contrary",
        "democratic",
        "notion",
        "accountability",
        "catholic",
        "philosopher",
        "maritain",
        "argument",
        "run",
        "similar",
        "christian",
        "philosopher",
        "early",
        "modern",
        "europe",
        "criticized",
        "absolute",
        "sovereignty",
        "witnessing",
        "rise",
        "formidable",
        "entity",
        "state",
        "sought",
        "place",
        "limit",
        "power",
        "authority",
        "ancestor",
        "demand",
        "limit",
        "state",
        "authority",
        "name",
        "human",
        "right",
        "right",
        "quell",
        "genocide",
        "disaster",
        "deliver",
        "relief",
        "outside",
        "international",
        "criminal",
        "court",
        "supranational",
        "entity",
        "assumes",
        "power",
        "governance",
        "economic",
        "maybe",
        "military",
        "affair",
        "case",
        "circumscribing",
        "sovereignty",
        "remains",
        "strong",
        "catholic",
        "christian",
        "tradition",
        "pope",
        "benedict",
        "xvi",
        "made",
        "case",
        "responsibility",
        "protect",
        "instance",
        "speech",
        "united",
        "nation",
        "recent",
        "year",
        "political",
        "philosopher",
        "liberal",
        "tradition",
        "argued",
        "circumscription",
        "sovereignty",
        "well",
        "two",
        "example",
        "thomas",
        "pogge",
        "allen",
        "buchanan",
        "accord",
        "sovereignty",
        "important",
        "absolute",
        "moral",
        "status",
        "seeking",
        "make",
        "room",
        "possibility",
        "humanitarian",
        "intervention",
        "approved",
        "united",
        "nation",
        "robust",
        "development",
        "global",
        "institution",
        "fighting",
        "poverty"
    ]
}