{
    "main_text": "The Special Theory of Relativity || Relativizing the Present\n3.1 Relativizing the Present\n\nWilfrid Sellars\n believed that the various invariant or observer-independent\nelements of Minkowski spacetime (like the light cone structure to be\ndescribed below) that are typically given primary consideration in\ntreatments of relativity from a spacetime perspective are abstractions\nfrom and secondary to the ‘perspectival’ pictures or\nperspectives, the myriad of inertial systems or reference\nframes. When it comes to time, however, he believed that there is\nsomething even more fundamental than these perspectives:\n\n…we must distinguish between a moment, t, and the event of the\nmoment’s being present with respect to a given perspective and,\nabove all, between the event of the moment’s being present with\nrespect to a given perspective and the event of the moment’s\nbeing present. The latter, of course, is the essential\nfeature of a temporal picture of the world. (577)\n\n\nWhile there is in Sellars’ paper a lengthy and illuminating\nseries of reflections on the relation between events, facts, and\nsubstances, there is no guidance offered on the relation between a\nmoment’s being present with respect to a given perspective and a\nmoment’s simply being present, a concept which is ill-defined\nfrom a relativistic point of view. If this latter is indeed an\nessential feature of a temporal picture of the world, then it would\nseem that special relativity does not provide us with a temporal\npicture of the world. If on the other hand the world is\nfundamentally temporal in the way that Sellars insists it must be,\nthen (at least as far a special relativity as a representation of that\nworld is concerned), Sellars’ famous scientific realism is\ncompromised because what he deems for metaphysical reasons to be an\n‘essential feature’ of a temporal picture of the world\ndoes not appear in a fundamental theory of spacetime.\n\nThere are some useful lessons to learn from the failure of this\nattempt to import pre-relativistic temporal categories (like simply\nbeing present as opposed to present with respect to an inertial frame)\ninto Minkowski spacetime. First, Sellars is careful to distinguish\nbetween events as things that happen or occur or take place and the\n‘events’ (the use of single quotes is Sellars’) that\nare basic in relativity. The latter are just spacetime points. They do\nnot take place or occur, and they are not the relata in causal\nrelations, whereas events are. (But cf. Tooley (1997, Chapter 9))\n\nSellars also presents a distinction between what he calls (p. 586)\ncategorial existence statements and what, for lack of a\nbetter term, I will call non-categorial existence statements.\nThe former invoke frameworks, like the framework of substances or the\nframework of ‘events’, the frameworks that Sellars takes\ngreat pains to compare in his essay. He is inclined towards a view he\nattributes to Carnap (1950) that to say that, for instance,\n‘Things exist’ is to make the categorial, metalinguistic\nclaim that there are thing words in our language L now. This use of\n‘exist,’ claims Sellars, has no (future or past) tensed\ncontrast.\n\nNon-categorial existence statements, on the other hand, assert the\nexistence of individuals or less general kinds in a fully tensed\nfashion. Sellars would construe them in the following way (p.\n592):\n\n\\(a\\) be existent \\(\\{\\) before now,\nnow, after now \\(\\} \\equiv\\)\n\n\\(\\exists x(x\\) be \\(\\{\\) before now, now, after\nnow \\(\\}\\) and \\(x\\) be \\(\\Phi_1\n,\\ldots ,\\Phi_n\\) and\n\n‘\\(\\Phi_1\\)’, …, ‘\\(\\Phi_n\\)’ be our\ncriteria now for [being] ‘\\(a\\)’)\n\n\nLeaving aside Sellars’ idiosyncratic way of construing existence\nstatements, if a distinction between categorial and non-categorial\nexistence claims can be made, then it would be perfectly coherent to\nindicate that one is adopting or working in the framework of\n‘events’ by asserting that ‘events exist’\n(tenselessly, in the categorial sense) without being committed to the\n“tenseless existence” of particular events which may be\npast, present, or future (in the non-categorial sense).\n\nIt has sometimes been thought that commitment to a spacetime\nframework, as is often explicit in treatments of special (and general)\nrelativity, is tantamount to commitment to eternalism or the\n‘block universe’, since to say that spacetime points exist\nseems inconsistent with saying that some spacetime points are future\nand so do not exist yet or are past and so exist no longer.\nIf some distinction of the type just sketched can be made\nbetween categorial and non-categorial existence statements, then\neternalism is not a straightforward consequence of adopting the\nspacetime\n viewpoint.[8]\n One can consistently affirm the category of events without also\naffirming that particular events exist (occur, happen) now or at any\nother specified time. (See §3.4 of Arthur (2019) for more\ndetail.)\n\nGranting Sellars all the distinctions that he wishes, however, does\nnot give him the tools to avoid the central problem sketched above.\nSince the problem is, in one form or another, the problem that any\nview that tries to define a notion of temporal becoming in Minkowski\nspacetime must address, it is worth examining it a bit more closely.\nSellars wrote (p. 591):\n\n… in the case of an ‘event’ framework, a primary\ntemporal picture is a picture with a now. And even if one\nobserver’s now is another observer’s\nthen, or one observer’s simultaneous cross sections of\nthe world are another observer’s sets of differently dated\n‘events’,… each of their now-pictures is a\nprimary picture, and the purely topological picture (which includes\nthe measurements performed by \\(S\\) and \\(S'\\) as\ntopological facts) which is common to them is not the primary\npicture of the world construed as a system of\n‘events,’ but merely a topological abstraction common to\nthe various primary pictures; and the topologically formulated\nlocation of individual events in the topological picture is merely the\ntopologically invariant features of the criteria which identify these\n‘events’ in a primary picture.\n\n\nIn this quote Sellars is using the term ‘topological’\nwhere one would now normally use the term ‘geometric’, and\nhe is forcefully reiterating his view that the spacetime manifold of\n‘events’ is merely an abstraction from the infinity of\ndistinct primary now-pictures of individual observers.\n\nThe first question one will surely want to ask about this view is: how\ncan an infinity of distinct “now-pictures” each\nbe primary? No answer is forthcoming. The second, and more troubling\nquestion, is: how can this infinity of distinct\n“now-pictures” be related to the traditional metaphysical\nviews under discussion? What, in short, is the connection (if any)\nbetween the temporal notions implicit in each of the pictures and\nexistence of the past, present, and future? The striking fact about\nSellars’ schema above for ‘a be existent\nnow’ is that it is not relativized to a\nreference frame, inertial system or “perspective” and so\nis not meaningful relativistically. The definition gives us no\nguidance as to how to parcel out existence to elements in the infinity\nof inertial frames that are admissible at a spacetime point.\n\nIf the definition or schema above were relativized to inertial frames\n\\(F, F'\\), etc., so as to connect existence to relativistically\nacceptable “primary now-pictures”, its interpretation\nwould be either unhelpful or mysterious. Consider the following\nmodification of Sellars’ schema above:\n\n\\(a\\) be existent now in \\(F \\equiv\\)\n\n\\( \\exists x(x\\) be now in \\(F\\) and\n\\(x\\) be \\(\\Phi_1 ,\\ldots \\Phi_n\\) and\n\n‘\\(\\Phi_1\\)’,…,‘\\(\\Phi_n\\)’ be our\ncriteria now for ‘\\(a\\)’)\n\nSuppose it is not the case that \\(a\\) be existent\nnow in some other frame \\(F'\\). It seems as if this\ndifference must result from \\(a\\)’s being\nsimultaneous with some spacetime point \\(\\mathbf{O}\\), say, in \\(F\\)\nwhile not being simultaneous with the same point\n\\(\\mathbf{O}\\) in \\(F'\\). But on this reading Sellars’ schema is\njust a round-about way to indicate that simultaneity is\nrelative—the point of departure for our metaphysical questions\nrather than the answer to any.\n\nThe schema looks as if it is meant to do something more, to connect\ntemporal notions to existence. But if so, how is existence relative to\na frame to be understood? Classical presentism, for instance, wishes\nto identify existence with present existence or existence\nnow. Since the present is relativized to frames in special\nrelativity, may not existence be relativized to frames as well? This\nis a difficult notion to understand or accept. Kurt Gödel (1949,\np. 558) said flatly, “The concept of existence … cannot\nbe relativized without destroying its meaning completely.” Is\nthe concept of existence, then, like the concept of truth, which, when\nrelativized (as true-for-me, true-for-you), comes to something more\nlike belief than truth? Or is it like simultaneity, about which\nthoughtful persons a century or so ago might have made pronouncements\nmuch like Gödel’s? This difficult and fundamental question\nhas by no means been resolved.\n\nWere this question resolved in favor of the relativization of\nexistence, what would be the import of a relativized version of\npresentism? It would have to hold that what existed changed radically\nwith one’s state of motion. Certain events (say on Mars or a\nplanet orbiting a distant star) may be existent for you now, sitting\nat your computer screen or reading a printout, but other events will\nreplace those as existent should you decide to walk one way or\nanother. This seems (once again) less like an interesting metaphysical\ninsight than a restatement of the relativity of simultaneity.\nPossibilism is not better off in this regard, for it relies on a\nmetaphysically distinguished present to separate the real from the\npotential. (See the symposium “The Prospects for the Present in\nSpacetime Theories” in Howard (2000) for further arguments and\nreferences.)\n\nTo sum up, then, Sellars’ attempt to tie existence to temporal\nnotions, when properly relativized, is either a bland re-statement of\nwhat special relativity tells us already about simultaneity or an\nopaque statement about relativized existence. This dilemma confronts\nany attempt to import pre-relativistic temporal notions into Minkowski\nspacetime, such as that in §5.7 of Dolev (2007), though Dolev\nexplicitly eschews ontologizing temporal relations. Let us, then, turn\nto efforts to understand Minkowski spacetime in a different way,\nefforts that will help clarify the puzzling argument about the\nAndromedean invasion presented above.\n",
    "section_title": "3.1 Relativizing the Present",
    "entry_title": "Being and Becoming in Modern Physics",
    "hierarchy_title": "Being and Becoming in Modern Physics || The Special Theory of Relativity || Relativizing the Present",
    "tokenized_text": [
        "special",
        "theory",
        "relativity",
        "relativizing",
        "present",
        "relativizing",
        "present",
        "wilfrid",
        "sellars",
        "believed",
        "various",
        "invariant",
        "observerindependent",
        "element",
        "minkowski",
        "spacetime",
        "like",
        "light",
        "cone",
        "structure",
        "described",
        "typically",
        "given",
        "primary",
        "consideration",
        "treatment",
        "relativity",
        "spacetime",
        "perspective",
        "abstraction",
        "secondary",
        "perspectival",
        "picture",
        "perspective",
        "myriad",
        "inertial",
        "system",
        "reference",
        "frame",
        "come",
        "time",
        "however",
        "believed",
        "something",
        "even",
        "fundamental",
        "perspective",
        "we",
        "must",
        "distinguish",
        "moment",
        "event",
        "moment",
        "present",
        "respect",
        "given",
        "perspective",
        "event",
        "moment",
        "present",
        "respect",
        "given",
        "perspective",
        "event",
        "moment",
        "present",
        "latter",
        "course",
        "essential",
        "feature",
        "temporal",
        "picture",
        "world",
        "sellars",
        "paper",
        "lengthy",
        "illuminating",
        "series",
        "reflection",
        "relation",
        "event",
        "fact",
        "substance",
        "guidance",
        "offered",
        "relation",
        "moment",
        "present",
        "respect",
        "given",
        "perspective",
        "moment",
        "simply",
        "present",
        "concept",
        "illdefined",
        "relativistic",
        "point",
        "view",
        "latter",
        "indeed",
        "essential",
        "feature",
        "temporal",
        "picture",
        "world",
        "would",
        "seem",
        "special",
        "relativity",
        "provide",
        "u",
        "temporal",
        "picture",
        "world",
        "hand",
        "world",
        "fundamentally",
        "temporal",
        "way",
        "sellars",
        "insists",
        "must",
        "least",
        "far",
        "special",
        "relativity",
        "representation",
        "world",
        "concerned",
        "sellars",
        "famous",
        "scientific",
        "realism",
        "compromised",
        "deems",
        "metaphysical",
        "reason",
        "essential",
        "feature",
        "temporal",
        "picture",
        "world",
        "appear",
        "fundamental",
        "theory",
        "spacetime",
        "useful",
        "lesson",
        "learn",
        "failure",
        "attempt",
        "import",
        "prerelativistic",
        "temporal",
        "category",
        "like",
        "simply",
        "present",
        "opposed",
        "present",
        "respect",
        "inertial",
        "frame",
        "minkowski",
        "spacetime",
        "first",
        "sellars",
        "careful",
        "distinguish",
        "event",
        "thing",
        "happen",
        "occur",
        "take",
        "place",
        "event",
        "use",
        "single",
        "quote",
        "sellars",
        "basic",
        "relativity",
        "latter",
        "spacetime",
        "point",
        "take",
        "place",
        "occur",
        "relatum",
        "causal",
        "relation",
        "whereas",
        "event",
        "cf",
        "tooley",
        "chapter",
        "sellars",
        "also",
        "present",
        "distinction",
        "call",
        "p",
        "categorial",
        "existence",
        "statement",
        "lack",
        "better",
        "term",
        "call",
        "noncategorial",
        "existence",
        "statement",
        "former",
        "invoke",
        "framework",
        "like",
        "framework",
        "substance",
        "framework",
        "event",
        "framework",
        "sellars",
        "take",
        "great",
        "pain",
        "compare",
        "essay",
        "inclined",
        "towards",
        "view",
        "attribute",
        "carnap",
        "say",
        "instance",
        "thing",
        "exist",
        "make",
        "categorial",
        "metalinguistic",
        "claim",
        "thing",
        "word",
        "language",
        "l",
        "use",
        "exist",
        "claim",
        "sellars",
        "future",
        "past",
        "tensed",
        "contrast",
        "noncategorial",
        "existence",
        "statement",
        "hand",
        "assert",
        "existence",
        "individual",
        "le",
        "general",
        "kind",
        "fully",
        "tensed",
        "fashion",
        "sellars",
        "would",
        "construe",
        "following",
        "way",
        "p",
        "a",
        "existent",
        "equiv",
        "exists",
        "x",
        "x",
        "x",
        "phi_",
        "ldots",
        "phi_n",
        "phi_",
        "phi_n",
        "criterion",
        "a",
        "leaving",
        "aside",
        "sellars",
        "idiosyncratic",
        "way",
        "construing",
        "existence",
        "statement",
        "distinction",
        "categorial",
        "noncategorial",
        "existence",
        "claim",
        "made",
        "would",
        "perfectly",
        "coherent",
        "indicate",
        "one",
        "adopting",
        "working",
        "framework",
        "event",
        "asserting",
        "event",
        "exist",
        "tenselessly",
        "categorial",
        "sense",
        "without",
        "committed",
        "tenseless",
        "existence",
        "particular",
        "event",
        "may",
        "past",
        "present",
        "future",
        "noncategorial",
        "sense",
        "sometimes",
        "thought",
        "commitment",
        "spacetime",
        "framework",
        "often",
        "explicit",
        "treatment",
        "special",
        "general",
        "relativity",
        "tantamount",
        "commitment",
        "eternalism",
        "block",
        "universe",
        "since",
        "say",
        "spacetime",
        "point",
        "exist",
        "seems",
        "inconsistent",
        "saying",
        "spacetime",
        "point",
        "future",
        "exist",
        "yet",
        "past",
        "exist",
        "longer",
        "distinction",
        "type",
        "sketched",
        "made",
        "categorial",
        "noncategorial",
        "existence",
        "statement",
        "eternalism",
        "straightforward",
        "consequence",
        "adopting",
        "spacetime",
        "viewpoint",
        "one",
        "consistently",
        "affirm",
        "category",
        "event",
        "without",
        "also",
        "affirming",
        "particular",
        "event",
        "exist",
        "occur",
        "happen",
        "specified",
        "time",
        "see",
        "arthur",
        "detail",
        "granting",
        "sellars",
        "distinction",
        "wish",
        "however",
        "give",
        "tool",
        "avoid",
        "central",
        "problem",
        "sketched",
        "since",
        "problem",
        "one",
        "form",
        "another",
        "problem",
        "view",
        "try",
        "define",
        "notion",
        "temporal",
        "becoming",
        "minkowski",
        "spacetime",
        "must",
        "address",
        "worth",
        "examining",
        "bit",
        "closely",
        "sellars",
        "wrote",
        "p",
        "case",
        "event",
        "framework",
        "primary",
        "temporal",
        "picture",
        "picture",
        "even",
        "one",
        "observer",
        "another",
        "observer",
        "one",
        "observer",
        "simultaneous",
        "cross",
        "section",
        "world",
        "another",
        "observer",
        "set",
        "differently",
        "dated",
        "event",
        "nowpictures",
        "primary",
        "picture",
        "purely",
        "topological",
        "picture",
        "includes",
        "measurement",
        "performed",
        "s",
        "s",
        "topological",
        "fact",
        "common",
        "primary",
        "picture",
        "world",
        "construed",
        "system",
        "event",
        "merely",
        "topological",
        "abstraction",
        "common",
        "various",
        "primary",
        "picture",
        "topologically",
        "formulated",
        "location",
        "individual",
        "event",
        "topological",
        "picture",
        "merely",
        "topologically",
        "invariant",
        "feature",
        "criterion",
        "identify",
        "event",
        "primary",
        "picture",
        "quote",
        "sellars",
        "using",
        "term",
        "topological",
        "one",
        "would",
        "normally",
        "use",
        "term",
        "geometric",
        "forcefully",
        "reiterating",
        "view",
        "spacetime",
        "manifold",
        "event",
        "merely",
        "abstraction",
        "infinity",
        "distinct",
        "primary",
        "nowpictures",
        "individual",
        "observer",
        "first",
        "question",
        "one",
        "surely",
        "want",
        "ask",
        "view",
        "infinity",
        "distinct",
        "nowpictures",
        "primary",
        "answer",
        "forthcoming",
        "second",
        "troubling",
        "question",
        "infinity",
        "distinct",
        "nowpictures",
        "related",
        "traditional",
        "metaphysical",
        "view",
        "discussion",
        "short",
        "connection",
        "temporal",
        "notion",
        "implicit",
        "picture",
        "existence",
        "past",
        "present",
        "future",
        "striking",
        "fact",
        "sellars",
        "schema",
        "existent",
        "relativized",
        "reference",
        "frame",
        "inertial",
        "system",
        "perspective",
        "meaningful",
        "relativistically",
        "definition",
        "give",
        "u",
        "guidance",
        "parcel",
        "existence",
        "element",
        "infinity",
        "inertial",
        "frame",
        "admissible",
        "spacetime",
        "point",
        "definition",
        "schema",
        "relativized",
        "inertial",
        "frame",
        "f",
        "f",
        "etc",
        "connect",
        "existence",
        "relativistically",
        "acceptable",
        "primary",
        "nowpictures",
        "interpretation",
        "would",
        "either",
        "unhelpful",
        "mysterious",
        "consider",
        "following",
        "modification",
        "sellars",
        "schema",
        "a",
        "existent",
        "f",
        "equiv",
        "exists",
        "x",
        "x",
        "f",
        "x",
        "phi_",
        "ldots",
        "phi_n",
        "phi_",
        "phi_n",
        "criterion",
        "a",
        "suppose",
        "case",
        "a",
        "existent",
        "frame",
        "f",
        "seems",
        "difference",
        "must",
        "result",
        "a",
        "simultaneous",
        "spacetime",
        "point",
        "mathbf",
        "say",
        "f",
        "simultaneous",
        "point",
        "mathbf",
        "f",
        "reading",
        "sellars",
        "schema",
        "roundabout",
        "way",
        "indicate",
        "simultaneity",
        "relativethe",
        "point",
        "departure",
        "metaphysical",
        "question",
        "rather",
        "answer",
        "schema",
        "look",
        "meant",
        "something",
        "connect",
        "temporal",
        "notion",
        "existence",
        "existence",
        "relative",
        "frame",
        "understood",
        "classical",
        "presentism",
        "instance",
        "wish",
        "identify",
        "existence",
        "present",
        "existence",
        "existence",
        "since",
        "present",
        "relativized",
        "frame",
        "special",
        "relativity",
        "may",
        "existence",
        "relativized",
        "frame",
        "well",
        "difficult",
        "notion",
        "understand",
        "accept",
        "kurt",
        "gödel",
        "p",
        "said",
        "flatly",
        "concept",
        "existence",
        "relativized",
        "without",
        "destroying",
        "meaning",
        "completely",
        "concept",
        "existence",
        "like",
        "concept",
        "truth",
        "relativized",
        "trueforme",
        "trueforyou",
        "come",
        "something",
        "like",
        "belief",
        "truth",
        "like",
        "simultaneity",
        "thoughtful",
        "person",
        "century",
        "ago",
        "might",
        "made",
        "pronouncement",
        "much",
        "like",
        "gödel",
        "difficult",
        "fundamental",
        "question",
        "mean",
        "resolved",
        "question",
        "resolved",
        "favor",
        "relativization",
        "existence",
        "would",
        "import",
        "relativized",
        "version",
        "presentism",
        "would",
        "hold",
        "existed",
        "changed",
        "radically",
        "one",
        "state",
        "motion",
        "certain",
        "event",
        "say",
        "mar",
        "planet",
        "orbiting",
        "distant",
        "star",
        "may",
        "existent",
        "sitting",
        "computer",
        "screen",
        "reading",
        "printout",
        "event",
        "replace",
        "existent",
        "decide",
        "walk",
        "one",
        "way",
        "another",
        "seems",
        "le",
        "like",
        "interesting",
        "metaphysical",
        "insight",
        "restatement",
        "relativity",
        "simultaneity",
        "possibilism",
        "better",
        "regard",
        "relies",
        "metaphysically",
        "distinguished",
        "present",
        "separate",
        "real",
        "potential",
        "see",
        "symposium",
        "prospect",
        "present",
        "spacetime",
        "theory",
        "howard",
        "argument",
        "reference",
        "sum",
        "sellars",
        "attempt",
        "tie",
        "existence",
        "temporal",
        "notion",
        "properly",
        "relativized",
        "either",
        "bland",
        "restatement",
        "special",
        "relativity",
        "tell",
        "u",
        "already",
        "simultaneity",
        "opaque",
        "statement",
        "relativized",
        "existence",
        "dilemma",
        "confronts",
        "attempt",
        "import",
        "prerelativistic",
        "temporal",
        "notion",
        "minkowski",
        "spacetime",
        "dolev",
        "though",
        "dolev",
        "explicitly",
        "eschews",
        "ontologizing",
        "temporal",
        "relation",
        "let",
        "u",
        "turn",
        "effort",
        "understand",
        "minkowski",
        "spacetime",
        "different",
        "way",
        "effort",
        "help",
        "clarify",
        "puzzling",
        "argument",
        "andromedean",
        "invasion",
        "presented"
    ]
}