{
    "main_text": "The Special Theory of Relativity || Chronogeometrical Fatalism Again\n3.3 Localizing Time\n\nKatherine Brading claimed that with proper attention to the history of\nphysics one can find a satisfying version of presentism that does not\nrequire a global present. If one grounds the unity of objects in\ndynamical laws, as she, invoking DiSalle (2006), claims that Newton\ndid, then she says the present can be viewed as “a\nspatiotemporal region of whatever size is necessary to sustain the\ndynamical system in question.” (2013, 1109) Presents construed\nthis way will typically be larger than a single point but will not\nnecessarily exhaust all of Minkowski spacetime or fall afoul of the\nrelativity of simultaneity.\n\nBut this is a characterization of a relativistic present, not\nrelativistic presentism. Presumably every dynamical system that has\nexisted, does exist or will exist had, has or will have a region of\nwhatever size is necessary to sustain it. Furthermore, it is unclear\nunder what conditions two dynamical systems share a present. Even if\nthey are intuitively spatially close, what sustains one may, or may\nnot, sustain the other. While Brading’s suggestion might be\ndeveloped into a way to define a relativistic present, it may not help\nto define presentism in a relativistic context, as she intended.\n\nLet us now turn to two variants of Stein’s approach—two\nclosely related ways to understand the present and temporal becoming\nin terms of structure intrinsic to Minkowski spacetime. One might see\nthese two views as attempts to capture Shimony’s transience\nwithout animating the Minkowski diagram.\n\nTwo sources of the view are Arthur (2006, and, especially, 2019,\nchapter 5) and Dieks (2006). The latter paper begins by presenting a\nseries of arguments that hyperplanes of simultaneity or global\nnows are not the proper relativistic successors to the common\nsense now.\n\nIn §1 Dieks presents the following argument:\n\n(P1)\n The experiences of observers are of such short duration and\noccupy such a small amount of space that they can, without loss, be\nidealized as point-like. \n(P2)\n Amongst these experiences are those that convince observers that\ntime flows or passes. \n(P3)\n Given the upper limit of speed of propagation of causal signals,\nno event that is spacelike separated from a given event can influence\nit causally. Therefore, \n(C)\n The human experiences that suggest at any given event \\(e\\) in\nthe history of an observer that time flows or passes are invariant\nunder different choices of global hypersurface containing \\(e\\).\n\n\n\nEven if it has no relevance to human experience, can we nevertheless\nchoose our hyperplane of simultaneity (the one orthogonal to\nour world line) as the hyperplane of simultaneity that marks\nthe passage of time? No, Dieks argues in §2 of his paper, for two\nreasons.\n\nFirst, there are too many. Were we inertial observers, then there\nwould be a hyperplane of simultaneity orthogonal to our world line\n(and uniquely definable from our world line using the Minkowski\nmetric). But every inertial world line defines such a hyperplane.\nChoosing a particular one, according to Dieks, “is tantamount to\naugmenting the structure of Minkowski spacetime” (Dieks, p.\n5).\n\nBut, second, there really aren’t any. We are not inertial\nobservers. We are (very nearly) rotating observers, and, as Dieks\npoints out, “local Einstein synchrony \\((\\varepsilon =1/2)\\) in\na rotating system does not extend to a consistent global definition of\nsimultaneity” (Dieks, p. 6).\n\nPartisans of a global now in Minkowski spacetime face, according to\nDieks, a dilemma. “If we are not going to refer to the actual\nmaterial worldlines in the universe, but only to the spacetime\nstructure itself, we have insufficient resources to fix a unique set\nof global nows. If we do attempt to rely on the actual material\nworldlines, however, we will not succeed in defining global nows at\nall” (Dieks, p. 7).\n\nAlthough we are jumping ahead of our story, it is worth remarking here\nthat the situation does not improve in the general theory of\nrelativity, as Dieks notes in §3. It has been proposed that the\nmean motion of matter could be used to define a preferred frame that,\nin turn, could be foliated (or sliced) into spacelike hypersurfaces\nthat define a preferred global time. But this procedure would work\nonly at a large scale, wherein there would be an arbitrary element in\nboth determining the scale and the averaging procedure. Should one\nretreat to the use of actual world lines, the rotation problem\nreasserts itself.\n\nTime, in the special theory of relativity, appears in two\nguises—coordinate time, which has held center stage thus far,\nand proper time. The histories of material objects, always moving with\nspeeds less than that of light, are represented in Minkowski spacetime\nby timelike world lines (curves in Minkowski spacetime such that the\ntangent vector at each point is timelike). Timelike world lines can be\nparameterized by a quantity, proper time, which is measured\nby ideal clocks following such world lines.\n\nProper time is path-dependent. If two distinct timelike\nworldlines connect point a to point b, they will in general indicate\ndifferent proper times between these points. On the other hand, proper\ntime is not frame-dependent. It is an invariant quantity (given a\nworldline and the specified points on it). (See pages 73–80 of\nGeroch (1978) for an illuminating discussion of the path-dependence of\nproper time.)\n\nThe potential philosophical importance of proper time was first\npointed out, like so much else, in a footnote by Stein:\n\nProper time is not a quantity attached to space-time points or to\npairs of space-time points; it is in this respect a notion utterly\ndifferent from the quantity “time” or “time\ninterval” of pre-relativistic theory ... The fundamental\nphysical role of proper time comes from the principle (here stated\nroughly) that whenever a process takes place along a well-defined line\nof space-time (“world-line”), the time rates in the\ndynamical principles that govern that process are to be understood in\nterms of the proper time along that line (and not in terms of\na “time coordinate”...) (Stein, 1968, fn 6)\n\nThis idea was adopted by Richard Arthur (1982, 107): “It is …\nproper time which is understood to measure the rate of\nbecoming for the possible process following this timelike line (or\nworldline).” Arthur (2019) is an extended development\nof this view. The idea was also adopted by Dennis Dieks (1988, 456):\n“Only time along worldlines (proper time) has an\nimmediate and absolute significance as an ordering parameter of\nphysical processes.”\n\nIn the absence (or, rather, the superabundance) of global\nhypersurfaces, which are defined in terms of coordinate time, becoming\nin Minkowski spacetime may be thought of locally, as the advance of\nproper time along a timelike worldline or, even more basically, as the\nsuccessive happening of events along such a world line. The passage of\ntime or temporal becoming (along a given timelike world line, of\ncourse) will be directly indicated by a clock, albeit an ideal\nclock.\n\nWhat about the present? Dieks proposes that the present should be\nthought of as corresponding to a point (a now-point) and the present\nfor that point is just that point itself (as did Robb (1914, 1921,\n1936) and Stein (1968)).\n\nOne could also allow a present that corresponds to some small length\nof time that humans typically think of as the present—an\ninterval that may range from about .5 seconds to 3 or perhaps 4\nseconds. This is the time it takes to read a sentence or hear a\nmusical phrase and is sometimes referred to as the specious\npresent. If we let T indicate the length of a specious\npresent and we try to follow Stein’s injunction to define\nnotions in terms of intrinsic structure, then Arthur (2006) and Savitt\n(2009) have suggested that the present for a stretch of worldline or\nprocess of length T would be the region of spacetime\ncomprised of the intersection of the future light cone of the point at\nthe beginning of that process and the past light cone of the point at\nthe end of it (assuming the process is or occupies a closed interval).\nThis region is often called a causal diamond. (See Winnie\n(1977) for more on causal diamonds.)\n\nTaken literally, Robb-Stein-Dieks point presents cannot be shared,\nwhich some find an unattractive feature of that view. Causal diamonds,\non the other hand, are surprisingly large. For a specious present of\nlength three seconds, the corresponding causal diamond includes the\nmoon (that is, a contemporaneous bit of the moon’s history). As\nthe length of a specious present shrinks to zero as a limit, the\ncorresponding causal diamond shrinks to a point, regaining the\nRobb-Stein-Dieks view as a limiting case.\n\nDorato and Wittman (2015) take as their starting point “the\nindisputable fact that we share the ‘now; despite the\nfact we don’t share a ‘here’” (2015, 200), but\nthey propose a different structure as a relativistic present at a\npoint, a sphere around that point of at least 40 ms length. (According\nto them, 40 ms is the temporal order threshhold. That is, one\ncannot reliably determine the temporal order of event occurring less\nthan 40 ms apart in time in one’s immediate vicinity. In their\nview, this sets a minimum bound on the length of the perceived or\npsychological present.) They add that “… passage\nphysically correspond[s] to a succession of spheres…”\n(202)\n\nRovelli (2019, 1330) contrasts “finite bubble presents”\nwith “diamond presents”:\n\nEach one of these definitions matches our common sense use of\n“present” and “simultaneous” in the everyday\ncontexts. They show that the common usage of “present” and\n“simultaneous” is not in contradiction with relativity,\nprovided that it is used within the appropriate approximation and\nwithin the appropriate context. None of them deserves to be charged\nwith ontological weight. (1330–31)\n\nIt is also possible to have less geometrically well-defined shapes as\nrelativistic presents, as with Brading’s presents above and\nCallender’s “now patches.” (2017, 2016)\n\nIn pre-relativistic spacetime (and common sense) it is tempting to\nidentify the passing of time with a succession of presents, as did\nKurt Gödel in the quote from him in § 2.3 above. So, if one\nthinks of presents in Minkowski spacetime as spheres or causal\ndiamonds, one might try to identify passage as a succession of such\ndiamonds or spheres along each timelike path, as in Dorato and Wittman\n(2015) or Savitt (2009, 2020). It is not easy, however, to order a\nsuccession of such regions of spacetime when their size is variable.\nPerhaps, then, one should not succumb to this temptation. The lesson\nto learn is that temporal concepts that coincide in common sense may\nmore clearly be seen to be distinct when re-considered in more\nmathematically sophisticated spacetime settings.\n",
    "section_title": "3.3 Localizing Time",
    "entry_title": "Being and Becoming in Modern Physics",
    "hierarchy_title": "Being and Becoming in Modern Physics || The Special Theory of Relativity || Chronogeometrical Fatalism Again",
    "tokenized_text": [
        "special",
        "theory",
        "relativity",
        "chronogeometrical",
        "fatalism",
        "localizing",
        "time",
        "katherine",
        "brading",
        "claimed",
        "proper",
        "attention",
        "history",
        "physic",
        "one",
        "find",
        "satisfying",
        "version",
        "presentism",
        "require",
        "global",
        "present",
        "one",
        "ground",
        "unity",
        "object",
        "dynamical",
        "law",
        "invoking",
        "disalle",
        "claim",
        "newton",
        "say",
        "present",
        "viewed",
        "spatiotemporal",
        "region",
        "whatever",
        "size",
        "necessary",
        "sustain",
        "dynamical",
        "system",
        "question",
        "present",
        "construed",
        "way",
        "typically",
        "larger",
        "single",
        "point",
        "necessarily",
        "exhaust",
        "minkowski",
        "spacetime",
        "fall",
        "afoul",
        "relativity",
        "simultaneity",
        "characterization",
        "relativistic",
        "present",
        "relativistic",
        "presentism",
        "presumably",
        "every",
        "dynamical",
        "system",
        "existed",
        "exist",
        "exist",
        "region",
        "whatever",
        "size",
        "necessary",
        "sustain",
        "furthermore",
        "unclear",
        "condition",
        "two",
        "dynamical",
        "system",
        "share",
        "present",
        "even",
        "intuitively",
        "spatially",
        "close",
        "sustains",
        "one",
        "may",
        "may",
        "sustain",
        "brading",
        "suggestion",
        "might",
        "developed",
        "way",
        "define",
        "relativistic",
        "present",
        "may",
        "help",
        "define",
        "presentism",
        "relativistic",
        "context",
        "intended",
        "let",
        "u",
        "turn",
        "two",
        "variant",
        "stein",
        "approachtwo",
        "closely",
        "related",
        "way",
        "understand",
        "present",
        "temporal",
        "becoming",
        "term",
        "structure",
        "intrinsic",
        "minkowski",
        "spacetime",
        "one",
        "might",
        "see",
        "two",
        "view",
        "attempt",
        "capture",
        "shimony",
        "transience",
        "without",
        "animating",
        "minkowski",
        "diagram",
        "two",
        "source",
        "view",
        "arthur",
        "especially",
        "chapter",
        "dieks",
        "latter",
        "paper",
        "begin",
        "presenting",
        "series",
        "argument",
        "hyperplanes",
        "simultaneity",
        "global",
        "now",
        "proper",
        "relativistic",
        "successor",
        "common",
        "sense",
        "dieks",
        "present",
        "following",
        "argument",
        "p",
        "experience",
        "observer",
        "short",
        "duration",
        "occupy",
        "small",
        "amount",
        "space",
        "without",
        "loss",
        "idealized",
        "pointlike",
        "p",
        "amongst",
        "experience",
        "convince",
        "observer",
        "time",
        "flow",
        "pass",
        "p",
        "given",
        "upper",
        "limit",
        "speed",
        "propagation",
        "causal",
        "signal",
        "event",
        "spacelike",
        "separated",
        "given",
        "event",
        "influence",
        "causally",
        "therefore",
        "c",
        "human",
        "experience",
        "suggest",
        "given",
        "event",
        "e",
        "history",
        "observer",
        "time",
        "flow",
        "pass",
        "invariant",
        "different",
        "choice",
        "global",
        "hypersurface",
        "containing",
        "e",
        "even",
        "relevance",
        "human",
        "experience",
        "nevertheless",
        "choose",
        "hyperplane",
        "simultaneity",
        "one",
        "orthogonal",
        "world",
        "line",
        "hyperplane",
        "simultaneity",
        "mark",
        "passage",
        "time",
        "dieks",
        "argues",
        "paper",
        "two",
        "reason",
        "first",
        "many",
        "inertial",
        "observer",
        "would",
        "hyperplane",
        "simultaneity",
        "orthogonal",
        "world",
        "line",
        "uniquely",
        "definable",
        "world",
        "line",
        "using",
        "minkowski",
        "metric",
        "every",
        "inertial",
        "world",
        "line",
        "defines",
        "hyperplane",
        "choosing",
        "particular",
        "one",
        "according",
        "dieks",
        "tantamount",
        "augmenting",
        "structure",
        "minkowski",
        "spacetime",
        "dieks",
        "p",
        "second",
        "really",
        "inertial",
        "observer",
        "nearly",
        "rotating",
        "observer",
        "dieks",
        "point",
        "local",
        "einstein",
        "synchrony",
        "varepsilon",
        "rotating",
        "system",
        "extend",
        "consistent",
        "global",
        "definition",
        "simultaneity",
        "dieks",
        "p",
        "partisan",
        "global",
        "minkowski",
        "spacetime",
        "face",
        "according",
        "dieks",
        "dilemma",
        "going",
        "refer",
        "actual",
        "material",
        "worldlines",
        "universe",
        "spacetime",
        "structure",
        "insufficient",
        "resource",
        "fix",
        "unique",
        "set",
        "global",
        "now",
        "attempt",
        "rely",
        "actual",
        "material",
        "worldlines",
        "however",
        "succeed",
        "defining",
        "global",
        "now",
        "dieks",
        "p",
        "although",
        "jumping",
        "ahead",
        "story",
        "worth",
        "remarking",
        "situation",
        "improve",
        "general",
        "theory",
        "relativity",
        "dieks",
        "note",
        "proposed",
        "mean",
        "motion",
        "matter",
        "could",
        "used",
        "define",
        "preferred",
        "frame",
        "turn",
        "could",
        "foliated",
        "sliced",
        "spacelike",
        "hypersurfaces",
        "define",
        "preferred",
        "global",
        "time",
        "procedure",
        "would",
        "work",
        "large",
        "scale",
        "wherein",
        "would",
        "arbitrary",
        "element",
        "determining",
        "scale",
        "averaging",
        "procedure",
        "one",
        "retreat",
        "use",
        "actual",
        "world",
        "line",
        "rotation",
        "problem",
        "reasserts",
        "time",
        "special",
        "theory",
        "relativity",
        "appears",
        "two",
        "guisescoordinate",
        "time",
        "held",
        "center",
        "stage",
        "thus",
        "far",
        "proper",
        "time",
        "history",
        "material",
        "object",
        "always",
        "moving",
        "speed",
        "le",
        "light",
        "represented",
        "minkowski",
        "spacetime",
        "timelike",
        "world",
        "line",
        "curve",
        "minkowski",
        "spacetime",
        "tangent",
        "vector",
        "point",
        "timelike",
        "timelike",
        "world",
        "line",
        "parameterized",
        "quantity",
        "proper",
        "time",
        "measured",
        "ideal",
        "clock",
        "following",
        "world",
        "line",
        "proper",
        "time",
        "pathdependent",
        "two",
        "distinct",
        "timelike",
        "worldlines",
        "connect",
        "point",
        "point",
        "b",
        "general",
        "indicate",
        "different",
        "proper",
        "time",
        "point",
        "hand",
        "proper",
        "time",
        "framedependent",
        "invariant",
        "quantity",
        "given",
        "worldline",
        "specified",
        "point",
        "see",
        "page",
        "geroch",
        "illuminating",
        "discussion",
        "pathdependence",
        "proper",
        "time",
        "potential",
        "philosophical",
        "importance",
        "proper",
        "time",
        "first",
        "pointed",
        "like",
        "much",
        "else",
        "footnote",
        "stein",
        "proper",
        "time",
        "quantity",
        "attached",
        "spacetime",
        "point",
        "pair",
        "spacetime",
        "point",
        "respect",
        "notion",
        "utterly",
        "different",
        "quantity",
        "time",
        "time",
        "interval",
        "prerelativistic",
        "theory",
        "fundamental",
        "physical",
        "role",
        "proper",
        "time",
        "come",
        "principle",
        "stated",
        "roughly",
        "whenever",
        "process",
        "take",
        "place",
        "along",
        "welldefined",
        "line",
        "spacetime",
        "worldline",
        "time",
        "rate",
        "dynamical",
        "principle",
        "govern",
        "process",
        "understood",
        "term",
        "proper",
        "time",
        "along",
        "line",
        "term",
        "time",
        "coordinate",
        "stein",
        "fn",
        "idea",
        "adopted",
        "richard",
        "arthur",
        "proper",
        "time",
        "understood",
        "measure",
        "rate",
        "becoming",
        "possible",
        "process",
        "following",
        "timelike",
        "line",
        "worldline",
        "arthur",
        "extended",
        "development",
        "view",
        "idea",
        "also",
        "adopted",
        "dennis",
        "dieks",
        "time",
        "along",
        "worldlines",
        "proper",
        "time",
        "immediate",
        "absolute",
        "significance",
        "ordering",
        "parameter",
        "physical",
        "processes",
        "absence",
        "rather",
        "superabundance",
        "global",
        "hypersurfaces",
        "defined",
        "term",
        "coordinate",
        "time",
        "becoming",
        "minkowski",
        "spacetime",
        "may",
        "thought",
        "locally",
        "advance",
        "proper",
        "time",
        "along",
        "timelike",
        "worldline",
        "even",
        "basically",
        "successive",
        "happening",
        "event",
        "along",
        "world",
        "line",
        "passage",
        "time",
        "temporal",
        "becoming",
        "along",
        "given",
        "timelike",
        "world",
        "line",
        "course",
        "directly",
        "indicated",
        "clock",
        "albeit",
        "ideal",
        "clock",
        "present",
        "dieks",
        "proposes",
        "present",
        "thought",
        "corresponding",
        "point",
        "nowpoint",
        "present",
        "point",
        "point",
        "robb",
        "stein",
        "one",
        "could",
        "also",
        "allow",
        "present",
        "corresponds",
        "small",
        "length",
        "time",
        "human",
        "typically",
        "think",
        "presentan",
        "interval",
        "may",
        "range",
        "second",
        "perhaps",
        "second",
        "time",
        "take",
        "read",
        "sentence",
        "hear",
        "musical",
        "phrase",
        "sometimes",
        "referred",
        "specious",
        "present",
        "let",
        "indicate",
        "length",
        "specious",
        "present",
        "try",
        "follow",
        "stein",
        "injunction",
        "define",
        "notion",
        "term",
        "intrinsic",
        "structure",
        "arthur",
        "savitt",
        "suggested",
        "present",
        "stretch",
        "worldline",
        "process",
        "length",
        "would",
        "region",
        "spacetime",
        "comprised",
        "intersection",
        "future",
        "light",
        "cone",
        "point",
        "beginning",
        "process",
        "past",
        "light",
        "cone",
        "point",
        "end",
        "assuming",
        "process",
        "occupies",
        "closed",
        "interval",
        "region",
        "often",
        "called",
        "causal",
        "diamond",
        "see",
        "winnie",
        "causal",
        "diamond",
        "taken",
        "literally",
        "robbsteindieks",
        "point",
        "present",
        "shared",
        "find",
        "unattractive",
        "feature",
        "view",
        "causal",
        "diamond",
        "hand",
        "surprisingly",
        "large",
        "specious",
        "present",
        "length",
        "three",
        "second",
        "corresponding",
        "causal",
        "diamond",
        "includes",
        "moon",
        "contemporaneous",
        "bit",
        "moon",
        "history",
        "length",
        "specious",
        "present",
        "shrink",
        "zero",
        "limit",
        "corresponding",
        "causal",
        "diamond",
        "shrink",
        "point",
        "regaining",
        "robbsteindieks",
        "view",
        "limiting",
        "case",
        "dorato",
        "wittman",
        "take",
        "starting",
        "point",
        "indisputable",
        "fact",
        "share",
        "despite",
        "fact",
        "share",
        "propose",
        "different",
        "structure",
        "relativistic",
        "present",
        "point",
        "sphere",
        "around",
        "point",
        "least",
        "m",
        "length",
        "according",
        "m",
        "temporal",
        "order",
        "threshhold",
        "one",
        "reliably",
        "determine",
        "temporal",
        "order",
        "event",
        "occurring",
        "le",
        "m",
        "apart",
        "time",
        "one",
        "immediate",
        "vicinity",
        "view",
        "set",
        "minimum",
        "bound",
        "length",
        "perceived",
        "psychological",
        "present",
        "add",
        "passage",
        "physically",
        "correspond",
        "succession",
        "spheres",
        "rovelli",
        "contrast",
        "finite",
        "bubble",
        "present",
        "diamond",
        "present",
        "one",
        "definition",
        "match",
        "common",
        "sense",
        "use",
        "present",
        "simultaneous",
        "everyday",
        "context",
        "show",
        "common",
        "usage",
        "present",
        "simultaneous",
        "contradiction",
        "relativity",
        "provided",
        "used",
        "within",
        "appropriate",
        "approximation",
        "within",
        "appropriate",
        "context",
        "none",
        "deserves",
        "charged",
        "ontological",
        "weight",
        "also",
        "possible",
        "le",
        "geometrically",
        "welldefined",
        "shape",
        "relativistic",
        "present",
        "brading",
        "present",
        "callender",
        "patches",
        "prerelativistic",
        "spacetime",
        "common",
        "sense",
        "tempting",
        "identify",
        "passing",
        "time",
        "succession",
        "present",
        "kurt",
        "gödel",
        "quote",
        "one",
        "think",
        "present",
        "minkowski",
        "spacetime",
        "sphere",
        "causal",
        "diamond",
        "one",
        "might",
        "try",
        "identify",
        "passage",
        "succession",
        "diamond",
        "sphere",
        "along",
        "timelike",
        "path",
        "dorato",
        "wittman",
        "savitt",
        "easy",
        "however",
        "order",
        "succession",
        "region",
        "spacetime",
        "size",
        "variable",
        "perhaps",
        "one",
        "succumb",
        "temptation",
        "lesson",
        "learn",
        "temporal",
        "concept",
        "coincide",
        "common",
        "sense",
        "may",
        "clearly",
        "seen",
        "distinct",
        "reconsidered",
        "mathematically",
        "sophisticated",
        "spacetime",
        "setting"
    ]
}