{
    "main_text": "The Dynamical Approach || The Dynamical Approach and Regularity Relationism\n4.1 The Dynamical Approach and Regularity Relationism\n\nThere is arguably a tight relationship between the geometrical\nsymmetries of a spacetime and the symmetries of a theory that\ndescribes the physics of matter (in a broad sense, including fields)\nin it. (Theories such as GTR, in which space-time has its own dynamics\nare more complicated, and will be discussed later; for further\ndiscussion of symmetries in physics, see the entry on\n symmetry and symmetry breaking.)\n Each symmetry is a set of transformations, with a rule of\ncomposition: formally a ‘group’. For instance, the group\nof rotations in the plane has a distinct element for every angle in\nthe range 0–360 degrees; the composition of two rotations is the\nsingle rotation through the sum of their angles. Spacetime symmetries\nare those transformations which leave invariant a piece of spacetime\nstructure (e.g., the symmetries of Minkowski spacetime are\ntranslations, spatial rotations and Lorentz boosts: together, the\nso-called Poincaré transformations); dynamical symmetries are\nthose transformations which leave invariant a set of dynamical\nequations (e.g., the symmetries of Maxwell’s equations of\nelectromagnetism are again the Poincaré transformations). There\nare good reasons to hold that the symmetry groups of theory and\nspacetime must agree. First, since the theory describes matter, and\nhence (arguably) what is measurable, any theoretical symmetries not\nreflected in the postulated spacetime structure indicate unmeasurable\ngeometry: for instance, if an absolute present were postulated in\nrelativistic physics. While in the other direction, if there were\nextra spacetime symmetries beyond those found in the dynamics, then\nper impossible one could measure nonexistent geometric\nquantities: for instance, a theory that depends on absolute velocities\ncannot be formulated in Galilean spacetime (see the entry on\n absolute and relational space and motion: classical theories\n for further discussion of these Newtonian spacetime structures).\nFamously, Earman (1989, ch. 3) declares that the matching of\nspace-time and dynamical symmetries is, thus, an ‘adequacy\ncondition’ on a physical theory.\n\nGiven this ‘adequacy condition’, a given geometry for\nspacetime formally constrains the allowable theories to those with the\njust the right symmetries: not too many, and not too few. It was an\nassumption of many substantivalists (the views of whom are discussed\nbelow) that this constraint was not merely formal, but ontological:\nthat the geometry is more fundamental than the laws, or that geometry\noffers a ‘real’ explanation of the form of the laws\n– such authors would, by the above categorization, qualify as\nproponents of a geometrical view. However, that the symmetries should\nagree does not specify any direction of dependence, and it could be\nreversed, so that the geometric symmetries are ontologically\ndetermined by those of the laws of the theory: hence the geometry\nitself is an expression of the (symmetry properties of the) dynamics\nof matter – transparently, this is consistent with the first of\nthe two specific commitments of the dynamical view discussed above. In\nthe words of Brown and Pooley (2006) (making these points about STR):\n“… space-time’s Minkowskian structure cannot be\ntaken to explain the Lorentz covariance of the dynamical laws. From\nour perspective … the direction of explanation goes the other\nway around. It is the Lorentz covariance of the laws that underwrites\nthe fact that the geometry of space-time is Minkowskian.”\n\nOf the opposing geometrical approach to spacetime, Brown and Pooley\n(2006, p. 84) question the mechanism by which autonomous\nspacetime structure is supposed to explain or constrain the behaviour\nof material bodies. Although we will keep our attention focussed on\nthe dynamical view in this subsection, rather than upon its opponents\n(see the following subsection for more on the explanatory capacities\nof spacetime), one might, however, ask at this point: does the\ndynamical view really do better in this regard? How is it that\ndynamical symmetries are supposed to explain, or account for,\nspacetime structure? In the context of theories with fixed spacetime\nstructure, this question is answered by proponents of the dynamical\nview via an ontological reduction of spatiotemporal structure\nto symmetries of dynamical equations governing matter fields, as\nindicated in (1) above. (In fact, this ‘reduction’ is\nbetter described as a form of elimination, as we will see.)\nBut this, in turn, invites yet more questions: how, metaphysically, is\nthis ontological reduction operating? Can one in fact state dynamical\nlaws, or understand them as “holding” or\n“governing”, without presupposing facts about\nspacetime structure?\n\nTake, for example, Newton’s laws of motion. The 1st law asserts\nthat bodies not acted upon by an external force will move with\nconstant velocity; similarly for the 2nd law and acceleration. These\nlaws seem to presuppose that these are meaningful terms, but in\nspacetime terms their meaning is given by geometric structures: for\ninstance, constant velocity in Galilean spacetime means having a\nstraight spacetime trajectory. And the problem is not restricted to\nNewtonian physics; the same point can be made regarding theories that\npresuppose the Minkowski background spacetime structure, e.g., the\nquantum field theories of the Standard Model.\n\nIt is increasingly well-appreciated that one suitable metaphysical\nprogram to which the dynamical approach can appeal here is\nHuggett’s (2006) regularity relationism: see (Huggett 2009;\nPooley 2013; Stevens 2020). The idea is to consider the dynamical laws\nas regularities that systematize and describe the patterns of events\nconcerning an underlying ontology/ideology that involves or\npresupposes only very limited spatiotemporal features. To illustrate\nhow this approach might go, consider Pooley’s (2013, §6.3)\nproposal that the dynamical approach to STR might postulate only\nR4 topological spatiotemporal structure, which could be\n(for example) attributed to a massive scalar field. Suppose we are\ngiven a full 4D field description of such a field, in terms of some\narbitrary coordinate system. This would describe a simple\n‘Humean mosaic’, to use David Lewis’ term for\none’s basic spatiotemporal and material commitments (see article\n David Lewis\n for further discussion). Now, smooth coordinate changes applied to\nsuch a description will generate distinct mathematical representations\nof that Humean mosaic, given using distinct coordinatizations of the\nfield-stuff. It might happen that, among all such representations,\nthere is a subclass of coordinate systems which are such that (i) when\nthe scalar field is described using a member of the class, it turns\nout that its values at spacetime points satisfy some simple/elegant\nmathematical equation; and moreover, (ii) the members of the class are\nrelated by a nicely-specifiable symmetry group. If this is so, then\nthe simple/elegant equation can be taken as expressing a dynamical law\nfor the world of this mosaic (understood as a statement: “There\nare frames in which …”), and the symmetry group of the\nlaw can be seen as capturing the derivative, not intrinsic,\nspacetime structure of the world. If the symmetry group is the\nPoincaré group, for example, then the field behaves ‘as\nif’ it were embedded in a spacetime with Minkowski geometry. But\nall this means is that the dynamics is representationally equivalent\nto a theory with an autonomous Minkowski geometry. From the point of\nview of the dynamical approach, such a theory is merely an\ninteresting, and perhaps useful, representation of the real facts: and\nit’s a mistake to take every feature of a representation to\ncorrespond to something in reality (Brown & Read 2020,\n§5).\n\nEven granting that this regularity relationist understanding of the\ndynamical approach goes through, three outstanding issues for the\ndynamical approach deserve to be mentioned. First: given that the\nproponent of the view seeks to excise metrical (more generally:\ngeometrical) spacetime structure, one might ask: why stop there? Is\nthere not something unnatural about excising fixed metric structure,\nwhile taking topological structure to be primitive? Such a concern was\nraised by Norton (2008), to which two responses have been offered in\nthe literature: (I) In direct response to Norton, Pooley points out\nthat “the project was to reduce chronogeometric facts to\nsymmetries, not to recover the entire spatiotemporal nature of the\nworld from no spatiotemporal assumptions whatsoever” (2013, p.\n57). (II) Menon (2019) has argued that the machinery of\n‘algebraic fields’ can be deployed in order to reduce\ntopological structure to facts about matter, thereby, if successful,\nmeeting Norton’s challenge head-on. Second: how is one to extend\nthe dynamical approach, understood as a form of Huggett’s\nregularity relationism, to theories of dynamical space-time such as\nGTR? Here, the lack of spacetime symmetries in the theory has posed\nproblems for the successful implementation of any such account\n(Stevens 2014), although arguably initial progress in this regard has\nbeen made by Vassallo and Esfeld (2016). Third: to which symmetries of\nthe laws is the dynamical approach supposed to be sensitive? In the\nphilosophy of physics, it is common to draw a distinction between\n‘internal’ and ‘external’ symmetries: examples\nof the former include U(1) gauge transformations in electromagnetism;\nexamples of the latter are coordinate transformations, such as\nGalilean boosts in Newtonian mechanics. But there are many questions\nhere, such as: (i) how, precisely, is the distinction between internal\nand external symmetries to be drawn? (ii) why should the proponent of\nthe dynamical approach stop at external symmetries? For discussion of\nthese questions, see (Dewar 2020).\n",
    "section_title": "4.1 The Dynamical Approach and Regularity Relationism",
    "entry_title": "Absolute and Relational Space and Motion: Post-Newtonian Theories",
    "hierarchy_title": "Absolute and Relational Space and Motion: Post-Newtonian Theories || The Dynamical Approach || The Dynamical Approach and Regularity Relationism",
    "tokenized_text": [
        "dynamical",
        "approach",
        "dynamical",
        "approach",
        "regularity",
        "relationism",
        "dynamical",
        "approach",
        "regularity",
        "relationism",
        "arguably",
        "tight",
        "relationship",
        "geometrical",
        "symmetry",
        "spacetime",
        "symmetry",
        "theory",
        "describes",
        "physic",
        "matter",
        "broad",
        "sense",
        "including",
        "field",
        "theory",
        "gtr",
        "spacetime",
        "dynamic",
        "complicated",
        "discussed",
        "later",
        "discussion",
        "symmetry",
        "physic",
        "see",
        "entry",
        "symmetry",
        "symmetry",
        "breaking",
        "symmetry",
        "set",
        "transformation",
        "rule",
        "composition",
        "formally",
        "group",
        "instance",
        "group",
        "rotation",
        "plane",
        "distinct",
        "element",
        "every",
        "angle",
        "range",
        "degree",
        "composition",
        "two",
        "rotation",
        "single",
        "rotation",
        "sum",
        "angle",
        "spacetime",
        "symmetry",
        "transformation",
        "leave",
        "invariant",
        "piece",
        "spacetime",
        "structure",
        "eg",
        "symmetry",
        "minkowski",
        "spacetime",
        "translation",
        "spatial",
        "rotation",
        "lorentz",
        "boost",
        "together",
        "socalled",
        "poincaré",
        "transformation",
        "dynamical",
        "symmetry",
        "transformation",
        "leave",
        "invariant",
        "set",
        "dynamical",
        "equation",
        "eg",
        "symmetry",
        "maxwell",
        "equation",
        "electromagnetism",
        "poincaré",
        "transformation",
        "good",
        "reason",
        "hold",
        "symmetry",
        "group",
        "theory",
        "spacetime",
        "must",
        "agree",
        "first",
        "since",
        "theory",
        "describes",
        "matter",
        "hence",
        "arguably",
        "measurable",
        "theoretical",
        "symmetry",
        "reflected",
        "postulated",
        "spacetime",
        "structure",
        "indicate",
        "unmeasurable",
        "geometry",
        "instance",
        "absolute",
        "present",
        "postulated",
        "relativistic",
        "physic",
        "direction",
        "extra",
        "spacetime",
        "symmetry",
        "beyond",
        "found",
        "dynamic",
        "per",
        "impossible",
        "one",
        "could",
        "measure",
        "nonexistent",
        "geometric",
        "quantity",
        "instance",
        "theory",
        "depends",
        "absolute",
        "velocity",
        "formulated",
        "galilean",
        "spacetime",
        "see",
        "entry",
        "absolute",
        "relational",
        "space",
        "motion",
        "classical",
        "theory",
        "discussion",
        "newtonian",
        "spacetime",
        "structure",
        "famously",
        "earman",
        "ch",
        "declares",
        "matching",
        "spacetime",
        "dynamical",
        "symmetry",
        "thus",
        "adequacy",
        "condition",
        "physical",
        "theory",
        "given",
        "adequacy",
        "condition",
        "given",
        "geometry",
        "spacetime",
        "formally",
        "constrains",
        "allowable",
        "theory",
        "right",
        "symmetry",
        "many",
        "assumption",
        "many",
        "substantivalists",
        "view",
        "discussed",
        "constraint",
        "merely",
        "formal",
        "ontological",
        "geometry",
        "fundamental",
        "law",
        "geometry",
        "offer",
        "real",
        "explanation",
        "form",
        "law",
        "author",
        "would",
        "categorization",
        "qualify",
        "proponent",
        "geometrical",
        "view",
        "however",
        "symmetry",
        "agree",
        "specify",
        "direction",
        "dependence",
        "could",
        "reversed",
        "geometric",
        "symmetry",
        "ontologically",
        "determined",
        "law",
        "theory",
        "hence",
        "geometry",
        "expression",
        "symmetry",
        "property",
        "dynamic",
        "matter",
        "transparently",
        "consistent",
        "first",
        "two",
        "specific",
        "commitment",
        "dynamical",
        "view",
        "discussed",
        "word",
        "brown",
        "pooley",
        "making",
        "point",
        "str",
        "spacetime",
        "minkowskian",
        "structure",
        "taken",
        "explain",
        "lorentz",
        "covariance",
        "dynamical",
        "law",
        "perspective",
        "direction",
        "explanation",
        "go",
        "way",
        "around",
        "lorentz",
        "covariance",
        "law",
        "underwrites",
        "fact",
        "geometry",
        "spacetime",
        "minkowskian",
        "opposing",
        "geometrical",
        "approach",
        "spacetime",
        "brown",
        "pooley",
        "p",
        "question",
        "mechanism",
        "autonomous",
        "spacetime",
        "structure",
        "supposed",
        "explain",
        "constrain",
        "behaviour",
        "material",
        "body",
        "although",
        "keep",
        "attention",
        "focussed",
        "dynamical",
        "view",
        "subsection",
        "rather",
        "upon",
        "opponent",
        "see",
        "following",
        "subsection",
        "explanatory",
        "capacity",
        "spacetime",
        "one",
        "might",
        "however",
        "ask",
        "point",
        "dynamical",
        "view",
        "really",
        "better",
        "regard",
        "dynamical",
        "symmetry",
        "supposed",
        "explain",
        "account",
        "spacetime",
        "structure",
        "context",
        "theory",
        "fixed",
        "spacetime",
        "structure",
        "question",
        "answered",
        "proponent",
        "dynamical",
        "view",
        "via",
        "ontological",
        "reduction",
        "spatiotemporal",
        "structure",
        "symmetry",
        "dynamical",
        "equation",
        "governing",
        "matter",
        "field",
        "indicated",
        "fact",
        "reduction",
        "better",
        "described",
        "form",
        "elimination",
        "see",
        "turn",
        "invite",
        "yet",
        "question",
        "metaphysically",
        "ontological",
        "reduction",
        "operating",
        "one",
        "fact",
        "state",
        "dynamical",
        "law",
        "understand",
        "holding",
        "governing",
        "without",
        "presupposing",
        "fact",
        "spacetime",
        "structure",
        "take",
        "example",
        "newton",
        "law",
        "motion",
        "st",
        "law",
        "asserts",
        "body",
        "acted",
        "upon",
        "external",
        "force",
        "move",
        "constant",
        "velocity",
        "similarly",
        "nd",
        "law",
        "acceleration",
        "law",
        "seem",
        "presuppose",
        "meaningful",
        "term",
        "spacetime",
        "term",
        "meaning",
        "given",
        "geometric",
        "structure",
        "instance",
        "constant",
        "velocity",
        "galilean",
        "spacetime",
        "mean",
        "straight",
        "spacetime",
        "trajectory",
        "problem",
        "restricted",
        "newtonian",
        "physic",
        "point",
        "made",
        "regarding",
        "theory",
        "presuppose",
        "minkowski",
        "background",
        "spacetime",
        "structure",
        "eg",
        "quantum",
        "field",
        "theory",
        "standard",
        "model",
        "increasingly",
        "wellappreciated",
        "one",
        "suitable",
        "metaphysical",
        "program",
        "dynamical",
        "approach",
        "appeal",
        "huggett",
        "regularity",
        "relationism",
        "see",
        "huggett",
        "pooley",
        "stevens",
        "idea",
        "consider",
        "dynamical",
        "law",
        "regularity",
        "systematize",
        "describe",
        "pattern",
        "event",
        "concerning",
        "underlying",
        "ontologyideology",
        "involves",
        "presupposes",
        "limited",
        "spatiotemporal",
        "feature",
        "illustrate",
        "approach",
        "might",
        "go",
        "consider",
        "pooley",
        "proposal",
        "dynamical",
        "approach",
        "str",
        "might",
        "postulate",
        "r",
        "topological",
        "spatiotemporal",
        "structure",
        "could",
        "example",
        "attributed",
        "massive",
        "scalar",
        "field",
        "suppose",
        "given",
        "full",
        "d",
        "field",
        "description",
        "field",
        "term",
        "arbitrary",
        "coordinate",
        "system",
        "would",
        "describe",
        "simple",
        "humean",
        "mosaic",
        "use",
        "david",
        "lewis",
        "term",
        "one",
        "basic",
        "spatiotemporal",
        "material",
        "commitment",
        "see",
        "article",
        "david",
        "lewis",
        "discussion",
        "smooth",
        "coordinate",
        "change",
        "applied",
        "description",
        "generate",
        "distinct",
        "mathematical",
        "representation",
        "humean",
        "mosaic",
        "given",
        "using",
        "distinct",
        "coordinatizations",
        "fieldstuff",
        "might",
        "happen",
        "among",
        "representation",
        "subclass",
        "coordinate",
        "system",
        "scalar",
        "field",
        "described",
        "using",
        "member",
        "class",
        "turn",
        "value",
        "spacetime",
        "point",
        "satisfy",
        "simpleelegant",
        "mathematical",
        "equation",
        "moreover",
        "ii",
        "member",
        "class",
        "related",
        "nicelyspecifiable",
        "symmetry",
        "group",
        "simpleelegant",
        "equation",
        "taken",
        "expressing",
        "dynamical",
        "law",
        "world",
        "mosaic",
        "understood",
        "statement",
        "frame",
        "symmetry",
        "group",
        "law",
        "seen",
        "capturing",
        "derivative",
        "intrinsic",
        "spacetime",
        "structure",
        "world",
        "symmetry",
        "group",
        "poincaré",
        "group",
        "example",
        "field",
        "behaves",
        "embedded",
        "spacetime",
        "minkowski",
        "geometry",
        "mean",
        "dynamic",
        "representationally",
        "equivalent",
        "theory",
        "autonomous",
        "minkowski",
        "geometry",
        "point",
        "view",
        "dynamical",
        "approach",
        "theory",
        "merely",
        "interesting",
        "perhaps",
        "useful",
        "representation",
        "real",
        "fact",
        "mistake",
        "take",
        "every",
        "feature",
        "representation",
        "correspond",
        "something",
        "reality",
        "brown",
        "read",
        "even",
        "granting",
        "regularity",
        "relationist",
        "understanding",
        "dynamical",
        "approach",
        "go",
        "three",
        "outstanding",
        "issue",
        "dynamical",
        "approach",
        "deserve",
        "mentioned",
        "first",
        "given",
        "proponent",
        "view",
        "seek",
        "excise",
        "metrical",
        "generally",
        "geometrical",
        "spacetime",
        "structure",
        "one",
        "might",
        "ask",
        "stop",
        "something",
        "unnatural",
        "excising",
        "fixed",
        "metric",
        "structure",
        "taking",
        "topological",
        "structure",
        "primitive",
        "concern",
        "raised",
        "norton",
        "two",
        "response",
        "offered",
        "literature",
        "direct",
        "response",
        "norton",
        "pooley",
        "point",
        "project",
        "reduce",
        "chronogeometric",
        "fact",
        "symmetry",
        "recover",
        "entire",
        "spatiotemporal",
        "nature",
        "world",
        "spatiotemporal",
        "assumption",
        "whatsoever",
        "p",
        "ii",
        "menon",
        "argued",
        "machinery",
        "algebraic",
        "field",
        "deployed",
        "order",
        "reduce",
        "topological",
        "structure",
        "fact",
        "matter",
        "thereby",
        "successful",
        "meeting",
        "norton",
        "challenge",
        "headon",
        "second",
        "one",
        "extend",
        "dynamical",
        "approach",
        "understood",
        "form",
        "huggett",
        "regularity",
        "relationism",
        "theory",
        "dynamical",
        "spacetime",
        "gtr",
        "lack",
        "spacetime",
        "symmetry",
        "theory",
        "posed",
        "problem",
        "successful",
        "implementation",
        "account",
        "stevens",
        "although",
        "arguably",
        "initial",
        "progress",
        "regard",
        "made",
        "vassallo",
        "esfeld",
        "third",
        "symmetry",
        "law",
        "dynamical",
        "approach",
        "supposed",
        "sensitive",
        "philosophy",
        "physic",
        "common",
        "draw",
        "distinction",
        "internal",
        "external",
        "symmetry",
        "example",
        "former",
        "include",
        "u",
        "gauge",
        "transformation",
        "electromagnetism",
        "example",
        "latter",
        "coordinate",
        "transformation",
        "galilean",
        "boost",
        "newtonian",
        "mechanic",
        "many",
        "question",
        "precisely",
        "distinction",
        "internal",
        "external",
        "symmetry",
        "drawn",
        "ii",
        "proponent",
        "dynamical",
        "approach",
        "stop",
        "external",
        "symmetry",
        "discussion",
        "question",
        "see",
        "dewar"
    ]
}