{
    "main_text": "Spinoza and the experimental and mathematical sciences || Observation\n6.1 Observation\n\nIt is by now widely accepted that observation is “theory\nladen”, and that therefore the idea that scientific theory\nproceeds through the neutral collection of data is bogus. Studies in\nthe logic of confirmation have likewise put an end to the\nsimple-minded idea that experimental method involves devising crucial\nexperiments whose results can, as a matter of logic, falsify a theory,\nor force a choice among competing theories. Nonetheless, modern\nscience is still thoroughly empirical, relying heavily and essentially\non observation and experimentation in the generation, development, and\ntesting of theories. The truism that one can always save a theory by\nrejecting auxiliary assumptions or discrediting data—reports of\nobservation—does not change the facts that, in practice,\nobservational results are taken to refute theories, and the ability to\npredict and explain a wide range of observable phenomena better than\nrivals remains the gold standard in scientific method.\n\nSpinoza, however, discounted the relevance of observational data to\nthe discovery of truths of nature. His conception of sense experience\nseems, in fact, to disqualify it from being a reliable source of\ninformation about the world altogether. He held that sense experience,\nin which the human body is affected by external bodies, can never\nprovide us with adequate ideas of either external bodies or our own.\nHe seems moreover to have denied that the method by which we discover\nnew truths involves either the collection of new sensory evidence or\nthe construction of crucial experiments. Indeed, much of the early\nTreatise on the Emendation of the Intellect is devoted to\nestablishing that “the fictitious, the false, and the other\n[ideas falling short of truth] have their origin in the imagination,\ni.e., in certain sensations that are fortuitous, and as it were\ndisconnected, since they do not arise from the very power of the mind,\nbut from external causes, as the body (whether awake or dreaming)\nreceives various motions” (EMI, ¶84). The intellect unaided\nby imagination, however construed, is the sole source of knowledge.\nObservation, which involves sensory ideas derived from external\ncauses, has no role in the true method for acquiring adequate\nknowledge.\n\nIn IIp25 Spinoza states “The idea of any affection of the human\nbody does not involve adequate knowledge of an external body”.\nSense perception—the basis of experimental observation—is\na matter of the body's being affected by external bodies. So it would\nseem that, prima facie, Spinoza cannot have held that\nobservation can be a means to an adequate knowledge of things.\nScientific knowledge—scientia—would, for Spinoza,\nhave to be adequate. Hence it seems that experimental observation\nought to be, for Spinoza, irrelevant to science. There is strong\nconfirmation to be found for this conclusion in Spinoza's accounts of\nthe kinds of knowledge.\n\nIn IIp40s2, Spinoza discusses four kinds of knowledge or modes of\ncognition. These are I) knowledge from singular things; II) knowledge\nfrom signs; III) knowledge from common notions; and IV) intuitive\nknowledge. The first two are prone to falsity, as they generate\ninadequate ideas. Cognition of kind (I) arises from objects\nrepresented “through the senses in a way that is mutilated,\nconfused, and without order for the intellect”. This is\nperception from “experientia vaga”, vague or\nrandom experience. Knowledge of kind (II) arises from hearsay, arising\n“from the fact that having heard or read certain words, we\nrecollect things, and form certain ideas of them … through\nwhich we imagine them.” Spinoza groups (I) and (II) together as\nknowledge of the first kind: opinion or imagination. Inadequate and\nconfused ideas pertain to knowledge of the first kind, and so it is\nthe sole cause of falsity. Both of the sorts of knowledge of the first\nkind depend upon what we would ordinarily call sense experience.\nSpinoza does not go so far as to assert explicitly that no true\nknowledge can ever arise from sense experience. It is only when the\nsenses present us with representations in a way that is\n“mutilated, confused and without order for the intellect”\n(IIp40s2), i.e., random, that our resulting conceptions are\ninadequate. But the question is whether there is any other way, on\nSpinoza's views about sense perception, that the senses can represent\nobjects to us. Knowledge of the third kind, intuitive knowledge, does\nnot appear to involve the senses at all. It is knowledge proceeding\n“from an adequate idea of the formal essence of certain\nattributes of God to the adequate knowledge of the essence of\nthings” (IIp40s2). This knowledge, then, arises from the\nintellectual consideration of the essence of an attribute itself,\nrather than from sensuous commerce with modes of that attribute.\nKnowledge of the second kind, reason, seems a more plausible candidate\nfor arising from experience. This is based on the so-called\n“common notions”. Common notions are conceptions of things\n“which are common to all, and which are equally in the part as\nin the whole” IIp38. Such conceptions can only be adequate, and\nthis would guarantee that the knowledge arising from such conceptions\nis true. Spinoza also allows that if there were something common and\npeculiar to the human body and external bodies by which it is\naffected, and equally in the part as in the whole of each, then the\nhuman mind will conceive that thing adequately. The problem, however,\nis that given Spinoza's views about sensation is it hard to see how\nsuch common notions could arise from sensation, and to the extent we\ncan make sense of this, the common notions seem limited to ideas of\nextremely general features of physical objects, far too general to be\na source of any of the kinds of particular observational knowledge\nrequired for experimental practice. The inadequacy of a conception of\na thing results from its not reflecting the entire nature of a thing's\ncauses. Knowledge of effects is by knowledge of causes, and while\nthings can interact causally only insofar as they share something in\ncommon, there can be aspects of the causes of things not reflected in\ntheir effects. However, if a conception is of something common to an\nobject and all other things, then there can be nothing in any of its\ncauses not reflected in the conception of it itself; whatever is\npresent in the cause will be present in it as well, hence reflected in\nthe idea of it. But what, we may ask, is even possibly shared by each\nthing and equally in the part of each as in the whole? The only\nobvious candidates are properties that, as Schliesser (2017, p. 15)\nputs it, “reflect the peculiar modal qualities of … a\nmode”: in the case of extended modes, those sorts of properties\nthat follow from the nature of extension: e.g., motion and rest,\ntaking up space, being subject to motion and to the laws of geometry,\netc.. But the sorts of observational knowledge that are crucial to\nexperimental method in science are hardly exhausted by the knowledge\nthat pertains to bodies as such. Indeed, experimental observation\ndepends precisely on the observational knowledge of differences,\nrather than similarities.\n\nSpinoza characterizes experiential vaga as experience that is\n“without order for the intellect” and as “experience\nthat is not determined by the intellect” (Treatise on the\nEmendation of the Intellect, ¶19). This experience is called\n“random” because “it comes to us by chance, and\nsince ”we have no other experiment to oppose it“;\nperception attained in this mode it ”remains with us\nunshaken“. Perception from random experience can, then, be\nshaken by opposing experiment, but there is nothing here that suggests\nthis is a matter of less random experience overruling more, rather\nthan multiple random experiences conflicting with one another.\nMoreover, Spinoza really never tells us what it would be for\nexperience to be ”ordered for“ or ”determined\nby“ the intellect. It is tempting to suppose that he meant,\nfollowing Bacon, from whom the term ”experientia\nvaga“ is borrowed, that experience is not vague insofar as\nit ”proceeds by fixed law, without interruption and in regular\norder“. (Bacon, Novum Organon, Book I, Aphorism 100).\nBut it is unclear, given Spinoza's general denigration of sense\nexperience as generating only inadequate ideas of things, how the\nintellect could order the collection of sense experience by law, and\nit is equally unclear how the result of doing so would shore up the\ninadequacy of the resulting\n observations.[15]\n Bennett, who resists the standard view that Spinoza thought\nexperience irrelevant to knowledge, and cites the possibility of\nexperientia non-vaga, i.e., experience as directed\nby the intellect, as evidence for this, concedes that Spinoza is\nentirely silent about experientia non-vaga, offering\nno account of what it might be, other than ”the experience of\nsomeone who puts to nature questions dictated to him by Spinoza's\nphilosophy“ (Bennett 1984, p. 24). Bennett's suggestion that a\ncharacterization of this might have to wait until we learn more about\nhow the senses function seems a non-starter, though. For if we\nconceive the senses as objects of empirical, experimental study, then\nwe cannot learn about them until we know how to order our experience,\nso the question is begged; and if we conceive of them as objects for\nnon-experiential, non-experimental philosophical reflection, then what\nmore by way of the Spinozistic carrying out of this sort of work is\nthere to be done than Spinoza does in the\n Ethics?[16]\n",
    "section_title": "6.1 Observation",
    "entry_title": "Spinoza’s Physical Theory",
    "hierarchy_title": "Spinoza’s Physical Theory || Spinoza and the experimental and mathematical sciences || Observation",
    "tokenized_text": [
        "spinoza",
        "experimental",
        "mathematical",
        "science",
        "observation",
        "observation",
        "widely",
        "accepted",
        "observation",
        "theory",
        "laden",
        "therefore",
        "idea",
        "scientific",
        "theory",
        "proceeds",
        "neutral",
        "collection",
        "data",
        "bogus",
        "study",
        "logic",
        "confirmation",
        "likewise",
        "put",
        "end",
        "simpleminded",
        "idea",
        "experimental",
        "method",
        "involves",
        "devising",
        "crucial",
        "experiment",
        "whose",
        "result",
        "matter",
        "logic",
        "falsify",
        "theory",
        "force",
        "choice",
        "among",
        "competing",
        "theory",
        "nonetheless",
        "modern",
        "science",
        "still",
        "thoroughly",
        "empirical",
        "relying",
        "heavily",
        "essentially",
        "observation",
        "experimentation",
        "generation",
        "development",
        "testing",
        "theory",
        "truism",
        "one",
        "always",
        "save",
        "theory",
        "rejecting",
        "auxiliary",
        "assumption",
        "discrediting",
        "datareports",
        "observationdoes",
        "change",
        "fact",
        "practice",
        "observational",
        "result",
        "taken",
        "refute",
        "theory",
        "ability",
        "predict",
        "explain",
        "wide",
        "range",
        "observable",
        "phenomenon",
        "better",
        "rival",
        "remains",
        "gold",
        "standard",
        "scientific",
        "method",
        "spinoza",
        "however",
        "discounted",
        "relevance",
        "observational",
        "data",
        "discovery",
        "truth",
        "nature",
        "conception",
        "sense",
        "experience",
        "seems",
        "fact",
        "disqualify",
        "reliable",
        "source",
        "information",
        "world",
        "altogether",
        "held",
        "sense",
        "experience",
        "human",
        "body",
        "affected",
        "external",
        "body",
        "never",
        "provide",
        "u",
        "adequate",
        "idea",
        "either",
        "external",
        "body",
        "seems",
        "moreover",
        "denied",
        "method",
        "discover",
        "new",
        "truth",
        "involves",
        "either",
        "collection",
        "new",
        "sensory",
        "evidence",
        "construction",
        "crucial",
        "experiment",
        "indeed",
        "much",
        "early",
        "treatise",
        "emendation",
        "intellect",
        "devoted",
        "establishing",
        "fictitious",
        "false",
        "idea",
        "falling",
        "short",
        "truth",
        "origin",
        "imagination",
        "ie",
        "certain",
        "sensation",
        "fortuitous",
        "disconnected",
        "since",
        "arise",
        "power",
        "mind",
        "external",
        "cause",
        "body",
        "whether",
        "awake",
        "dreaming",
        "receives",
        "various",
        "motion",
        "emi",
        "intellect",
        "unaided",
        "imagination",
        "however",
        "construed",
        "sole",
        "source",
        "knowledge",
        "observation",
        "involves",
        "sensory",
        "idea",
        "derived",
        "external",
        "cause",
        "role",
        "true",
        "method",
        "acquiring",
        "adequate",
        "knowledge",
        "iip",
        "spinoza",
        "state",
        "idea",
        "affection",
        "human",
        "body",
        "involve",
        "adequate",
        "knowledge",
        "external",
        "body",
        "sense",
        "perceptionthe",
        "basis",
        "experimental",
        "observationis",
        "matter",
        "body",
        "s",
        "affected",
        "external",
        "body",
        "would",
        "seem",
        "prima",
        "facie",
        "spinoza",
        "held",
        "observation",
        "mean",
        "adequate",
        "knowledge",
        "thing",
        "scientific",
        "knowledgescientiawould",
        "spinoza",
        "adequate",
        "hence",
        "seems",
        "experimental",
        "observation",
        "ought",
        "spinoza",
        "irrelevant",
        "science",
        "strong",
        "confirmation",
        "found",
        "conclusion",
        "spinoza",
        "s",
        "account",
        "kind",
        "knowledge",
        "iips",
        "spinoza",
        "discus",
        "four",
        "kind",
        "knowledge",
        "mode",
        "cognition",
        "knowledge",
        "singular",
        "thing",
        "ii",
        "knowledge",
        "sign",
        "iii",
        "knowledge",
        "common",
        "notion",
        "iv",
        "intuitive",
        "knowledge",
        "first",
        "two",
        "prone",
        "falsity",
        "generate",
        "inadequate",
        "idea",
        "cognition",
        "kind",
        "arises",
        "object",
        "represented",
        "sens",
        "way",
        "mutilated",
        "confused",
        "without",
        "order",
        "intellect",
        "perception",
        "experientia",
        "vaga",
        "vague",
        "random",
        "experience",
        "knowledge",
        "kind",
        "ii",
        "arises",
        "hearsay",
        "arising",
        "fact",
        "heard",
        "read",
        "certain",
        "word",
        "recollect",
        "thing",
        "form",
        "certain",
        "idea",
        "imagine",
        "them",
        "spinoza",
        "group",
        "ii",
        "together",
        "knowledge",
        "first",
        "kind",
        "opinion",
        "imagination",
        "inadequate",
        "confused",
        "idea",
        "pertain",
        "knowledge",
        "first",
        "kind",
        "sole",
        "cause",
        "falsity",
        "sort",
        "knowledge",
        "first",
        "kind",
        "depend",
        "upon",
        "would",
        "ordinarily",
        "call",
        "sense",
        "experience",
        "spinoza",
        "go",
        "far",
        "assert",
        "explicitly",
        "true",
        "knowledge",
        "ever",
        "arise",
        "sense",
        "experience",
        "sens",
        "present",
        "u",
        "representation",
        "way",
        "mutilated",
        "confused",
        "without",
        "order",
        "intellect",
        "iips",
        "ie",
        "random",
        "resulting",
        "conception",
        "inadequate",
        "question",
        "whether",
        "way",
        "spinoza",
        "s",
        "view",
        "sense",
        "perception",
        "sens",
        "represent",
        "object",
        "u",
        "knowledge",
        "third",
        "kind",
        "intuitive",
        "knowledge",
        "appear",
        "involve",
        "sens",
        "knowledge",
        "proceeding",
        "adequate",
        "idea",
        "formal",
        "essence",
        "certain",
        "attribute",
        "god",
        "adequate",
        "knowledge",
        "essence",
        "thing",
        "iips",
        "knowledge",
        "arises",
        "intellectual",
        "consideration",
        "essence",
        "attribute",
        "rather",
        "sensuous",
        "commerce",
        "mode",
        "attribute",
        "knowledge",
        "second",
        "kind",
        "reason",
        "seems",
        "plausible",
        "candidate",
        "arising",
        "experience",
        "based",
        "socalled",
        "common",
        "notion",
        "common",
        "notion",
        "conception",
        "thing",
        "common",
        "equally",
        "part",
        "whole",
        "iip",
        "conception",
        "adequate",
        "would",
        "guarantee",
        "knowledge",
        "arising",
        "conception",
        "true",
        "spinoza",
        "also",
        "allows",
        "something",
        "common",
        "peculiar",
        "human",
        "body",
        "external",
        "body",
        "affected",
        "equally",
        "part",
        "whole",
        "human",
        "mind",
        "conceive",
        "thing",
        "adequately",
        "problem",
        "however",
        "given",
        "spinoza",
        "s",
        "view",
        "sensation",
        "hard",
        "see",
        "common",
        "notion",
        "could",
        "arise",
        "sensation",
        "extent",
        "make",
        "sense",
        "common",
        "notion",
        "seem",
        "limited",
        "idea",
        "extremely",
        "general",
        "feature",
        "physical",
        "object",
        "far",
        "general",
        "source",
        "kind",
        "particular",
        "observational",
        "knowledge",
        "required",
        "experimental",
        "practice",
        "inadequacy",
        "conception",
        "thing",
        "result",
        "reflecting",
        "entire",
        "nature",
        "thing",
        "s",
        "cause",
        "knowledge",
        "effect",
        "knowledge",
        "cause",
        "thing",
        "interact",
        "causally",
        "insofar",
        "share",
        "something",
        "common",
        "aspect",
        "cause",
        "thing",
        "reflected",
        "effect",
        "however",
        "conception",
        "something",
        "common",
        "object",
        "thing",
        "nothing",
        "cause",
        "reflected",
        "conception",
        "whatever",
        "present",
        "cause",
        "present",
        "well",
        "hence",
        "reflected",
        "idea",
        "may",
        "ask",
        "even",
        "possibly",
        "shared",
        "thing",
        "equally",
        "part",
        "whole",
        "obvious",
        "candidate",
        "property",
        "schliesser",
        "p",
        "put",
        "reflect",
        "peculiar",
        "modal",
        "quality",
        "mode",
        "case",
        "extended",
        "mode",
        "sort",
        "property",
        "follow",
        "nature",
        "extension",
        "eg",
        "motion",
        "rest",
        "taking",
        "space",
        "subject",
        "motion",
        "law",
        "geometry",
        "etc",
        "sort",
        "observational",
        "knowledge",
        "crucial",
        "experimental",
        "method",
        "science",
        "hardly",
        "exhausted",
        "knowledge",
        "pertains",
        "body",
        "indeed",
        "experimental",
        "observation",
        "depends",
        "precisely",
        "observational",
        "knowledge",
        "difference",
        "rather",
        "similarity",
        "spinoza",
        "characterizes",
        "experiential",
        "vaga",
        "experience",
        "without",
        "order",
        "intellect",
        "experience",
        "determined",
        "intellect",
        "treatise",
        "emendation",
        "intellect",
        "experience",
        "called",
        "random",
        "come",
        "u",
        "chance",
        "since",
        "experiment",
        "oppose",
        "perception",
        "attained",
        "mode",
        "remains",
        "u",
        "unshaken",
        "perception",
        "random",
        "experience",
        "shaken",
        "opposing",
        "experiment",
        "nothing",
        "suggests",
        "matter",
        "le",
        "random",
        "experience",
        "overruling",
        "rather",
        "multiple",
        "random",
        "experience",
        "conflicting",
        "one",
        "another",
        "moreover",
        "spinoza",
        "really",
        "never",
        "tell",
        "u",
        "would",
        "experience",
        "ordered",
        "determined",
        "intellect",
        "tempting",
        "suppose",
        "meant",
        "following",
        "bacon",
        "term",
        "experientia",
        "vaga",
        "borrowed",
        "experience",
        "vague",
        "insofar",
        "proceeds",
        "fixed",
        "law",
        "without",
        "interruption",
        "regular",
        "order",
        "bacon",
        "novum",
        "organon",
        "book",
        "aphorism",
        "unclear",
        "given",
        "spinoza",
        "s",
        "general",
        "denigration",
        "sense",
        "experience",
        "generating",
        "inadequate",
        "idea",
        "thing",
        "intellect",
        "could",
        "order",
        "collection",
        "sense",
        "experience",
        "law",
        "equally",
        "unclear",
        "result",
        "would",
        "shore",
        "inadequacy",
        "resulting",
        "observation",
        "bennett",
        "resists",
        "standard",
        "view",
        "spinoza",
        "thought",
        "experience",
        "irrelevant",
        "knowledge",
        "cite",
        "possibility",
        "experientia",
        "nonvaga",
        "ie",
        "experience",
        "directed",
        "intellect",
        "evidence",
        "concedes",
        "spinoza",
        "entirely",
        "silent",
        "experientia",
        "nonvaga",
        "offering",
        "account",
        "might",
        "experience",
        "someone",
        "put",
        "nature",
        "question",
        "dictated",
        "spinoza",
        "s",
        "philosophy",
        "bennett",
        "p",
        "bennett",
        "s",
        "suggestion",
        "characterization",
        "might",
        "wait",
        "learn",
        "sens",
        "function",
        "seems",
        "nonstarter",
        "though",
        "conceive",
        "sens",
        "object",
        "empirical",
        "experimental",
        "study",
        "learn",
        "know",
        "order",
        "experience",
        "question",
        "begged",
        "conceive",
        "object",
        "nonexperiential",
        "nonexperimental",
        "philosophical",
        "reflection",
        "way",
        "spinozistic",
        "carrying",
        "sort",
        "work",
        "done",
        "spinoza",
        "ethic"
    ]
}