{
    "main_text": "Ethics || Virtue and Happiness\n2.5 Virtue and Happiness\n\nThe solution to this predicament is an ancient one. Since we cannot\ncontrol the objects that we tend to value and that we allow to\ninfluence our well-being, we ought instead to try to control our\nevaluations themselves and thereby minimize the sway that external\nobjects and the passions have over us. We can never eliminate the\npassive affects entirely. We are essentially a part of nature, and can\nnever fully remove ourselves from the causal series that link us to\nexternal things. But we can, ultimately, counteract the passions,\ncontrol them, and achieve a certain degree of relief from their\nturmoil.\n\nThe path to restraining and moderating the affects is through virtue.\nSpinoza is a psychological and ethical egoist. All beings naturally\nseek their own advantage—to preserve their own being and\nincrease their power—and it is right for them do so. This is\nwhat virtue consists in. Since we are thinking beings, endowed with\nintelligence and reason, what is to our greatest advantage is\nknowledge. Our virtue, therefore, consists in the pursuit of knowledge\nand understanding, of adequate ideas. The best kind of knowledge is a\npurely intellectual intuition of the essences of things. This\n“third kind of knowledge”—beyond both random\nexperience and ratiocination—sees things not in their temporal\ndimension, not in their durational existence and in relation to other\nparticular things, but under the aspect of eternity (sub specie\naeternitatis), that is, abstracted from all considerations of\ntime and place and situated in their relationship to God and its\nattributes. They are apprehended, that is, in their conceptual and\ncausal relationship to the universal essences (thought and extension)\nand the eternal laws of nature.\n\nWe conceive things as actual in two ways: either insofar as we\nconceive them to exist in relation to a certain time and place, or\ninsofar as we conceive them to be contained in God and to follow from\nthe necessity of the divine nature. But the things we conceive in this\nsecond way as true, or real, we conceive under a species of eternity,\nand to that extent they involve the eternal and infinite essence of\nGod. (Vp29s)\n\n\nBut this is just to say that, ultimately, we strive for a knowledge of\nGod. The concept of any body involves the concept of extension; and\nthe concept of any idea or mind involves the concept of thought. But\nthought and extension just are God’s attributes. So the proper\nand adequate conception of any body or mind necessarily involves the\nconcept or knowledge of God. “The third kind of knowledge\nproceeds from an adequate idea of certain attributes of God to an\nadequate knowledge of the essence of things, and the more we\nunderstand things in this way, the more we understand God”\n(Vp25d). Knowledge of God is, thus, the mind’s greatest good and\nits greatest virtue.\n\nWhat we see when we understand things through the third kind of\nknowledge, under the aspect of eternity and in relation to God, is the\ndeterministic necessity of all things. We see that all bodies and\ntheir states follow necessarily from the essence of matter and the\nuniversal laws of physics; and we see that all ideas, including all\nthe properties of minds, follow necessarily from the essence of\nthought and its universal laws. This insight can only weaken the power\nthat the passions have over us. We are no longer hopeful or fearful of\nwhat shall come to pass, and no longer anxious or despondent over our\npossessions. We regard all things with equanimity, and we are not\ninordinately and irrationally affected in different ways by past,\npresent or future events. The result is self-control and a calmness of\nmind.\n\nThe more this knowledge that things are necessary is concerned with\nsingular things, which we imagine more distinctly and vividly, the\ngreater is this power of the Mind over the affects, as experience\nitself also testifies. For we see that Sadness over some good which\nhas perished is lessened as soon as the man who has lost it realizes\nthat this good could not, in any way, have been kept. Similarly, we\nsee that [because we regard infancy as a natural and necessary thing],\nno one pities infants because of their inability to speak, to walk, or\nto reason, or because they live so many years, as it were, unconscious\nof themselves. (Vp6s)\n\n\nOur affects or emotions themselves can be understood in this way,\nwhich further diminishes their power over us.\n\nSpinoza’s ethical theory is, to a certain degree, Stoic, and\nrecalls the doctrines of thinkers such as Cicero and Seneca:\n\nWe do not have an absolute power to adapt things outside us to our\nuse. Nevertheless, we shall bear calmly those things that happen to us\ncontrary to what the principle of our advantage demands, if we are\nconscious that we have done our duty, that the power we have could not\nhave extended itself to the point where we could have avoided those\nthings, and that we are a part of the whole of nature, whose order we\nfollow. If we understand this clearly and distinctly, that part of us\nwhich is defined by understanding, i.e., the better part of us, will\nbe entirely satisfied with this, and will strive to persevere in that\nsatisfaction. For insofar as we understand, we can want nothing except\nwhat is necessary, nor absolutely be satisfied with anything except\nwhat is true. (IV, Appendix)\n\n\nWhat, in the end, replaces the passionate love for ephemeral\n“goods” is an intellectual love for an eternal, immutable\ngood that we can fully and stably possess, God. The third kind of\nknowledge generates a love for its object, and in this love consists\nnot a passionate joy but an active one, even blessedness itself.\nTaking his cue from Maimonides’s view of human\neudaimonia, Spinoza argues that the mind’s intellectual\nlove of God is our understanding of the universe, our virtue,\nour happiness, our well-being and our “salvation”. It is\nalso our freedom and autonomy, as we approach the condition wherein\nwhat happens to us follows from our nature (as a determinate and\ndetermined mode of one of God’s attributes) alone and not as a\nresult of the ways external things affect us. Spinoza’s\n“free person” is one who bears the gifts and losses of\nfortune with equanimity and does only those things that he believes to\nbe “the most important in life”. He also, despite the\nfundamental egoism, engages in behavior toward others that is\ntypically regarded as “ethical”, even altruistic. He takes\ncare for the well-being and virtuous flourishing of other human\nbeings. He does what he can through rational benevolence (as opposed\nto pity or some other passion) to insure that they, too, achieve\nrelief from the disturbances of the passions through understanding,\nand thus that they become more like him (and therefore most useful to\nhim). He does this not from altruistic motives but egoistic ones: he\nsees that it is in his own best interest to be in communion with other\nrationally virtuous individuals. Moreover, the free person is not\nanxious about death. The free person neither hopes for any eternal,\notherworldly rewards nor fears any eternal punishments. He knows that\nthe soul is not immortal in any personal sense, but is endowed only\nwith a certain kind of eternity. The more the mind consists of true\nand adequate ideas (which are eternal), the more of it\nremains—within God’s attribute of thought—after the\ndeath of the body and the disappearance of that part of the mind that\ncorresponds to the body’s duration. This understanding of his\nplace in the natural scheme of things brings to the free individual\ntrue peace of mind, even salvation.\n\nThere are a number of social and political ramifications that follow\nfrom Spinoza’s ethical doctrines of human action and well-being.\nBecause disagreement and discord between human beings is always the\nresult of our different and changeable passions, “free”\nindividuals—who all share the same nature and act on the same\nprinciples—will naturally and effortlessly form a harmonious\nsociety. “Insofar as men are torn by affects that are passions,\nthey can be contrary to one another …[But] insofar as men live\naccording to the guidance of reason, they must do only those things\nthat are good for human nature, and hence, for each man, i.e., those\nthings that agree with the nature of each man. Hence, insofar as men\nlive according to the guidance of reason, they must always agree among\nthemselves” (IVp34–35). Free human beings will be mutually\nbeneficial and useful, and will be tolerant of the opinions and even\nthe errors of others. However, human beings do not generally live\nunder the guidance of reason. The state or sovereign, therefore, is\nrequired in order to insure—not by reason, but by the threat of\nforce—that individuals are protected from the unrestrained\npursuit of self-interest on the part of other individuals. The\ntransition from a state of nature, where each seeks his own advantage\nwithout limitation, to a civil state involves the universal\nrenunciation of certain natural rights—such as “the right\neveryone has of avenging himself, and of judging good and\nevil”—and the investment of those prerogatives in a\ncentral authority. As long as human beings are guided by their\npassions, the state is necessary to bring it about that they\n“live harmoniously and be of assistance to one\nanother”.\n",
    "section_title": "2.5 Virtue and Happiness",
    "entry_title": "Baruch Spinoza",
    "hierarchy_title": "Baruch Spinoza || Ethics || Virtue and Happiness",
    "tokenized_text": [
        "ethic",
        "virtue",
        "happiness",
        "virtue",
        "happiness",
        "solution",
        "predicament",
        "ancient",
        "one",
        "since",
        "control",
        "object",
        "tend",
        "value",
        "allow",
        "influence",
        "wellbeing",
        "ought",
        "instead",
        "try",
        "control",
        "evaluation",
        "thereby",
        "minimize",
        "sway",
        "external",
        "object",
        "passion",
        "u",
        "never",
        "eliminate",
        "passive",
        "affect",
        "entirely",
        "essentially",
        "part",
        "nature",
        "never",
        "fully",
        "remove",
        "causal",
        "series",
        "link",
        "u",
        "external",
        "thing",
        "ultimately",
        "counteract",
        "passion",
        "control",
        "achieve",
        "certain",
        "degree",
        "relief",
        "turmoil",
        "path",
        "restraining",
        "moderating",
        "affect",
        "virtue",
        "spinoza",
        "psychological",
        "ethical",
        "egoist",
        "being",
        "naturally",
        "seek",
        "advantageto",
        "preserve",
        "increase",
        "powerand",
        "right",
        "virtue",
        "consists",
        "since",
        "thinking",
        "being",
        "endowed",
        "intelligence",
        "reason",
        "greatest",
        "advantage",
        "knowledge",
        "virtue",
        "therefore",
        "consists",
        "pursuit",
        "knowledge",
        "understanding",
        "adequate",
        "idea",
        "best",
        "kind",
        "knowledge",
        "purely",
        "intellectual",
        "intuition",
        "essence",
        "thing",
        "third",
        "kind",
        "knowledge",
        "beyond",
        "random",
        "experience",
        "ratiocinationsees",
        "thing",
        "temporal",
        "dimension",
        "durational",
        "existence",
        "relation",
        "particular",
        "thing",
        "aspect",
        "eternity",
        "sub",
        "specie",
        "aeternitatis",
        "abstracted",
        "consideration",
        "time",
        "place",
        "situated",
        "relationship",
        "god",
        "attribute",
        "apprehended",
        "conceptual",
        "causal",
        "relationship",
        "universal",
        "essence",
        "thought",
        "extension",
        "eternal",
        "law",
        "nature",
        "conceive",
        "thing",
        "actual",
        "two",
        "way",
        "either",
        "insofar",
        "conceive",
        "exist",
        "relation",
        "certain",
        "time",
        "place",
        "insofar",
        "conceive",
        "contained",
        "god",
        "follow",
        "necessity",
        "divine",
        "nature",
        "thing",
        "conceive",
        "second",
        "way",
        "true",
        "real",
        "conceive",
        "specie",
        "eternity",
        "extent",
        "involve",
        "eternal",
        "infinite",
        "essence",
        "god",
        "vps",
        "say",
        "ultimately",
        "strive",
        "knowledge",
        "god",
        "concept",
        "body",
        "involves",
        "concept",
        "extension",
        "concept",
        "idea",
        "mind",
        "involves",
        "concept",
        "thought",
        "thought",
        "extension",
        "god",
        "attribute",
        "proper",
        "adequate",
        "conception",
        "body",
        "mind",
        "necessarily",
        "involves",
        "concept",
        "knowledge",
        "god",
        "third",
        "kind",
        "knowledge",
        "proceeds",
        "adequate",
        "idea",
        "certain",
        "attribute",
        "god",
        "adequate",
        "knowledge",
        "essence",
        "thing",
        "understand",
        "thing",
        "way",
        "understand",
        "god",
        "vpd",
        "knowledge",
        "god",
        "thus",
        "mind",
        "greatest",
        "good",
        "greatest",
        "virtue",
        "see",
        "understand",
        "thing",
        "third",
        "kind",
        "knowledge",
        "aspect",
        "eternity",
        "relation",
        "god",
        "deterministic",
        "necessity",
        "thing",
        "see",
        "body",
        "state",
        "follow",
        "necessarily",
        "essence",
        "matter",
        "universal",
        "law",
        "physic",
        "see",
        "idea",
        "including",
        "property",
        "mind",
        "follow",
        "necessarily",
        "essence",
        "thought",
        "universal",
        "law",
        "insight",
        "weaken",
        "power",
        "passion",
        "u",
        "longer",
        "hopeful",
        "fearful",
        "shall",
        "come",
        "pas",
        "longer",
        "anxious",
        "despondent",
        "possession",
        "regard",
        "thing",
        "equanimity",
        "inordinately",
        "irrationally",
        "affected",
        "different",
        "way",
        "past",
        "present",
        "future",
        "event",
        "result",
        "selfcontrol",
        "calmness",
        "mind",
        "knowledge",
        "thing",
        "necessary",
        "concerned",
        "singular",
        "thing",
        "imagine",
        "distinctly",
        "vividly",
        "greater",
        "power",
        "mind",
        "affect",
        "experience",
        "also",
        "testifies",
        "see",
        "sadness",
        "good",
        "perished",
        "lessened",
        "soon",
        "man",
        "lost",
        "realizes",
        "good",
        "could",
        "way",
        "kept",
        "similarly",
        "see",
        "regard",
        "infancy",
        "natural",
        "necessary",
        "thing",
        "one",
        "pity",
        "infant",
        "inability",
        "speak",
        "walk",
        "reason",
        "live",
        "many",
        "year",
        "unconscious",
        "vps",
        "affect",
        "emotion",
        "understood",
        "way",
        "diminishes",
        "power",
        "u",
        "spinoza",
        "ethical",
        "theory",
        "certain",
        "degree",
        "stoic",
        "recall",
        "doctrine",
        "thinker",
        "cicero",
        "seneca",
        "absolute",
        "power",
        "adapt",
        "thing",
        "outside",
        "u",
        "use",
        "nevertheless",
        "shall",
        "bear",
        "calmly",
        "thing",
        "happen",
        "u",
        "contrary",
        "principle",
        "advantage",
        "demand",
        "conscious",
        "done",
        "duty",
        "power",
        "could",
        "extended",
        "point",
        "could",
        "avoided",
        "thing",
        "part",
        "whole",
        "nature",
        "whose",
        "order",
        "follow",
        "understand",
        "clearly",
        "distinctly",
        "part",
        "u",
        "defined",
        "understanding",
        "ie",
        "better",
        "part",
        "u",
        "entirely",
        "satisfied",
        "strive",
        "persevere",
        "satisfaction",
        "insofar",
        "understand",
        "want",
        "nothing",
        "except",
        "necessary",
        "absolutely",
        "satisfied",
        "anything",
        "except",
        "true",
        "iv",
        "appendix",
        "end",
        "replaces",
        "passionate",
        "love",
        "ephemeral",
        "good",
        "intellectual",
        "love",
        "eternal",
        "immutable",
        "good",
        "fully",
        "stably",
        "posse",
        "god",
        "third",
        "kind",
        "knowledge",
        "generates",
        "love",
        "object",
        "love",
        "consists",
        "passionate",
        "joy",
        "active",
        "one",
        "even",
        "blessedness",
        "taking",
        "cue",
        "maimonides",
        "view",
        "human",
        "eudaimonia",
        "spinoza",
        "argues",
        "mind",
        "intellectual",
        "love",
        "god",
        "understanding",
        "universe",
        "virtue",
        "happiness",
        "wellbeing",
        "salvation",
        "also",
        "freedom",
        "autonomy",
        "approach",
        "condition",
        "wherein",
        "happens",
        "u",
        "follows",
        "nature",
        "determinate",
        "determined",
        "mode",
        "one",
        "god",
        "attribute",
        "alone",
        "result",
        "way",
        "external",
        "thing",
        "affect",
        "u",
        "spinoza",
        "free",
        "person",
        "one",
        "bear",
        "gift",
        "loss",
        "fortune",
        "equanimity",
        "thing",
        "belief",
        "important",
        "life",
        "also",
        "despite",
        "fundamental",
        "egoism",
        "engages",
        "behavior",
        "toward",
        "others",
        "typically",
        "regarded",
        "ethical",
        "even",
        "altruistic",
        "take",
        "care",
        "wellbeing",
        "virtuous",
        "flourishing",
        "human",
        "being",
        "rational",
        "benevolence",
        "opposed",
        "pity",
        "passion",
        "insure",
        "achieve",
        "relief",
        "disturbance",
        "passion",
        "understanding",
        "thus",
        "become",
        "like",
        "therefore",
        "useful",
        "altruistic",
        "motif",
        "egoistic",
        "one",
        "see",
        "best",
        "interest",
        "communion",
        "rationally",
        "virtuous",
        "individual",
        "moreover",
        "free",
        "person",
        "anxious",
        "death",
        "free",
        "person",
        "neither",
        "hope",
        "eternal",
        "otherworldly",
        "reward",
        "fear",
        "eternal",
        "punishment",
        "know",
        "soul",
        "immortal",
        "personal",
        "sense",
        "endowed",
        "certain",
        "kind",
        "eternity",
        "mind",
        "consists",
        "true",
        "adequate",
        "idea",
        "eternal",
        "remainswithin",
        "god",
        "attribute",
        "thoughtafter",
        "death",
        "body",
        "disappearance",
        "part",
        "mind",
        "corresponds",
        "body",
        "duration",
        "understanding",
        "place",
        "natural",
        "scheme",
        "thing",
        "brings",
        "free",
        "individual",
        "true",
        "peace",
        "mind",
        "even",
        "salvation",
        "number",
        "social",
        "political",
        "ramification",
        "follow",
        "spinoza",
        "ethical",
        "doctrine",
        "human",
        "action",
        "wellbeing",
        "disagreement",
        "discord",
        "human",
        "being",
        "always",
        "result",
        "different",
        "changeable",
        "passion",
        "free",
        "individualswho",
        "share",
        "nature",
        "act",
        "principleswill",
        "naturally",
        "effortlessly",
        "form",
        "harmonious",
        "society",
        "insofar",
        "men",
        "torn",
        "affect",
        "passion",
        "contrary",
        "one",
        "another",
        "insofar",
        "men",
        "live",
        "according",
        "guidance",
        "reason",
        "must",
        "thing",
        "good",
        "human",
        "nature",
        "hence",
        "man",
        "ie",
        "thing",
        "agree",
        "nature",
        "man",
        "hence",
        "insofar",
        "men",
        "live",
        "according",
        "guidance",
        "reason",
        "must",
        "always",
        "agree",
        "among",
        "ivp",
        "free",
        "human",
        "being",
        "mutually",
        "beneficial",
        "useful",
        "tolerant",
        "opinion",
        "even",
        "error",
        "others",
        "however",
        "human",
        "being",
        "generally",
        "live",
        "guidance",
        "reason",
        "state",
        "sovereign",
        "therefore",
        "required",
        "order",
        "insurenot",
        "reason",
        "threat",
        "forcethat",
        "individual",
        "protected",
        "unrestrained",
        "pursuit",
        "selfinterest",
        "part",
        "individual",
        "transition",
        "state",
        "nature",
        "seek",
        "advantage",
        "without",
        "limitation",
        "civil",
        "state",
        "involves",
        "universal",
        "renunciation",
        "certain",
        "natural",
        "rightssuch",
        "right",
        "everyone",
        "avenging",
        "judging",
        "good",
        "evil",
        "and",
        "investment",
        "prerogative",
        "central",
        "authority",
        "long",
        "human",
        "being",
        "guided",
        "passion",
        "state",
        "necessary",
        "bring",
        "live",
        "harmoniously",
        "assistance",
        "one",
        "another"
    ]
}