{
    "main_text": "The Human Being as Part of Nature || The Striving Doctrine as an Account of Human Nature\n1.3 The Striving Doctrine as an Account of Human Nature\n\n\nSpinoza’s naturalism benefits rhetorically from his use of the term\n‘conatus’ to describe the essences of human\nbeings and other finite modes alike. For the term is not only a\ntechnical term of Cartesian physics. Cicero uses the term in De\nNatura Deorum (and other Roman and Greek Stoics use close\ncognates) in a psychological sense, referring to human desire, and\nHobbes in his physiology uses the term to refer to the physical causes\nof human desire (Leviathan VI). So\n‘conatus’ has both broad, physical and\nspecifically human, psychological connotations which help to make the\ngap between nature and the human mind appear narrow.\n\n\nWhether Spinoza successfully capitalizes on his rhetorical skill,\nhowever, and draws a plausible account of the nature of the human mind\nout of his general account of the essences of finite modes depends upon\nIIIp9:\nIII Proposition 9: Both insofar as the mind has clear and\ndistinct ideas, and insofar as it has confused ideas, it strives, for\nan indefinite duration, to persevere in its being and it is conscious\nof this striving it has.\n\n\nIIIp9 suggests that Spinoza is a psychological egoist of some sort.\nThat is, it suggests that he believes that what human beings desire to\ndo is to secure their own interests (construed here as perseverance in\nbeing). Indeed Spinoza goes on to define desire at IIIp9 as human\nstriving (or appetite) together with the consciousness of striving. So\nclearly human desire for Spinoza is part of the striving for\nperseverance in being and thus shares its character.\n\n\nThere is some question, however, about what variety of psychological\negoism Spinoza holds. Desire might be part of a striving for\nperseverance, after all, without all desires being desires for\nperseverance. One might have a strong instinctual desire for things\nwhich are instrumental to perseverance in being without desiring\nperseverance itself, for example. Or one might desire perseverance in\nbeing but also desire other kinds of things.\n\n\nIIIp9 might be supposed to support a very strong version of\npsychological egoism, orthodox egoism (perhaps Delahunty, 221, holds\nthis view). Orthodox egoism, is the view that human beings are always\nconsciously selfish. Under this view, A consciously desires only those\nobjects which benefit A, B desires only those objects which benefit B,\nand so on for all human beings. At IIIp9, Spinoza writes that the\nhuman mind seeks to persevere in being both insofar as it has clear\nand distinct ideas and insofar as it has confused ideas. It is natural\nto understand this claim to mean something like the following:\nSometimes people do things which conduce to their\nperseverance and other times people do things which fail to so\nconduce.  In both types of case, though, people desire to\npersevere. When I do something that fails to help me to persevere,\nit’s because the ideas on which I based my action were confused; that\nis, I thought I knew what would help me to persevere, but I was\nwrong. When I do something that does help me to persevere, though\n(unless I have simply been lucky in acting from an inadequate idea),\nit is because I acted on clear and distinct ideas or, in other words,\ngenuine knowledge about what would help me to persevere.\n\n\nThe categorical language Spinoza uses in the Appendix to Part I\nprovides explicit support for this interpretation of IIIp9: “men act\nalways on account of an end, viz. on account of their advantage, which\nthey want.” Moreover there are other important passages in Spinoza’s\nworks which are strongly compatible with the interpretation of Spinoza\nas an orthodox egoist. These include Ethics IVp8d, and his\npolitical writings, especially Ethics IVp36s2, and his\nPolitical Treatise, chapter 2)\n\n\nOther evidence suggests that Spinoza is not an orthodox egoist,\nhowever. In particular, there is reason to question whether the\nargument of the Ethics commits Spinoza to the account of\nactions following from confused ideas that the interpretation of IIIp9\nabove attributes to him. Part of IVp44s concerns those agents who are\nthe most confused. That passage is useful because it describes\nexplicitly the conscious thought-processes that precede action:\nThough men are liable to a great many affects, so that one\nrarely finds them to be always agitated by one and the same affect,\nstill there are those in whom one affect is stubbornly fixed. For we\nsometimes see that men are so affected by one object that, although it\nis not present, they still believe they have it with them. When this\nhappens to a man who is not asleep, we say that he is mad or insane.\nNor are they thought to be less mad who burn with Love, and dream, both\nnight and day, only of a lover or a courtesan. For they usually\nprovoke laughter. But when a greedy man thinks of nothing else but\nprofit, or money, and an ambitious man of esteem, they are not thought\nto be mad, because they are usually troublesome and are considered\nworthy of Hate.  But Greed, Ambition, and Lust really are species of\nmadness, even though they are not numbered among the\ndiseases.\n\n\nIn this scholium (and in several other notable passages, including III\nDefinition of the Affects XLVIII and IVp20s) Spinoza describes a\nvariety of possible ends of human action, none of which is\nperseverance in being. Moreover, lest one think that the greedy man\nseeks profit because he mistakenly believes that it leads to\nperseverance, Spinoza emphasizes the point here that it is always one and\nthe same object that obsesses these men.  A man seeking profit because\nhe believes that it leads to perseverance may be obsessed with two\nobjects, profit and perseverance, not one.\n\n\nIVp44s suggests that Spinoza holds a different kind of view,\npredominant egoism, the view that most people, most of the time\nconsciously desire perseverance in their own being. The particular\ntype of predominant egoism that IVp44s suggests introduces important\naspects of Spinoza’s ethical theory: if the most confused\npeople, people addled by greed or lust or ambition, are those who\nalways seek something other than perseverance in being, then perhaps\nSpinoza’s view is that, for any of us who act on some similar\nsentiments occasionally, we do so just to the extent that we also have\nconfused ideas. Thus human beings are predominantly egoistic because,\nby and large, we act rationally. It is rational to seek to persevere\nin being (see also what “reason demands” at IVP18S). So if\nwe were always rational, we would always pursue our own preservation,\nand orthodox egoism would be true, for Spinoza. But we are not\northodox egoists, on this interpretation of Spinoza as a predominant\negoist, just because we are not fully rational. To the extent that we\nhave confused ideas, we may indeed consciously pursue ends other than\nperseverance in being. On this interpretation of Spinoza, there is a\nright (or at least a rational) end to pursue—perseverance in\nbeing—and other ends are wrong (or at least irrational).\n\n\nIVp20 provides support for this interpretation of Spinoza’s\npredominant egoism:\nIV Proposition 20: The more each one strives, and is able,\nto seek his own advantage, i.e., to preserve his being, the more he is\nendowed with virtue; conversely, insofar as each one neglects his own\nadvantage, i.e., neglects to preserve his own being, he lacks\npower.\n\n\nHere Spinoza explicitly admits that a person may “neglect his own\nadvantage.” So IVp20 apparently contradicts the orthodox egoism of I\nAppendix. Moreover, IVp20 states that, to the extent that a person\ndoes seek perseverance in being, that person is virtuous. Virtue has a\nmetaphysical connotation in the Ethics. A thing’s virtue is\njust the same as its power (IVd8). But the term undeniably has moral\nconnotations as well. So IVp20 suggests, as IVp44s does, that\nconsciously trying to preserve oneself is right and neglecting to\npreserve oneself is wrong.\n\n\nIIIp9 admits of various interpretations. However, the weight of the\ntextual evidence supports the view that he is a predominant, not an\northodox, egoist. Any particular human desire, even a desire\nthat is not a desire for perseverance in being or its means, must on\nSpinoza’s view be related to perseverance in being in some way (by\nIIIp6 and IIIp9s). Spinoza’s discussion of desires for things other\nthan perseverance in being in passages such as IVp44s and IVp20\nsuggests moreover that such desires are part or product of confusion.\nSo passionate desires, for Spinoza, are often desires for things other\nthan perseverance in being, although they may be confused desires for\nperseverance as well (see IVp63s2 and other discussions of\nfear). Recent debates about whether the ends of human desire are\nreally important to his psychological theory and about how Spinoza\nunderstands human consciousness are likely to lend further support to\nthis view by showing how these passages and others like them may be\nreconciled with Spinoza’s more basic commitments in metaphysics and\nmind.\n\nFurther reading: For discussion of IIIp4,\nsee Matson 1977 and Garrett 2002. For interpretations of Spinoza’s\nargument from IIIp4–IIIp6, see Curley 1988; Della Rocca 1996;\nGarrett 2002 and Lin 2004. For discussions of historical sources of\nthe striving doctrine, see James 1993, Wolfson 1934, and LeBuffe\n2010a, pp.101–102.  Youpa 2003 offers an account of self-preservation\nin Spinoza.  For Spinoza’s physics and his use of\nDescartes, see Lachterman 1978, Peterman 2015 and 2017, and Schliesser 2017. Most book-length interpretations of the\nEthics include detailed accounts of Spinoza’s view of human\nnature. For discussion of IIIp9, see LeBuffe 2004 and 2010a, Chapters\n5–7. Some of the best general discussions of psychological\negoism come in the context of the interpretation of Hobbes, to whom\nSpinoza is sometimes compared. For these, see Kavka 1986 and Hampton\n1986.\n",
    "section_title": "1.3 The Striving Doctrine as an Account of Human Nature",
    "entry_title": "Spinoza’s Psychological Theory",
    "hierarchy_title": "Spinoza’s Psychological Theory || The Human Being as Part of Nature || The Striving Doctrine as an Account of Human Nature",
    "tokenized_text": [
        "human",
        "part",
        "nature",
        "striving",
        "doctrine",
        "account",
        "human",
        "nature",
        "striving",
        "doctrine",
        "account",
        "human",
        "nature",
        "spinoza",
        "naturalism",
        "benefit",
        "rhetorically",
        "use",
        "term",
        "conatus",
        "describe",
        "essence",
        "human",
        "being",
        "finite",
        "mode",
        "alike",
        "term",
        "technical",
        "term",
        "cartesian",
        "physic",
        "cicero",
        "us",
        "term",
        "de",
        "natura",
        "deorum",
        "roman",
        "greek",
        "stoic",
        "use",
        "close",
        "cognate",
        "psychological",
        "sense",
        "referring",
        "human",
        "desire",
        "hobbes",
        "physiology",
        "us",
        "term",
        "refer",
        "physical",
        "cause",
        "human",
        "desire",
        "leviathan",
        "vi",
        "conatus",
        "broad",
        "physical",
        "specifically",
        "human",
        "psychological",
        "connotation",
        "help",
        "make",
        "gap",
        "nature",
        "human",
        "mind",
        "appear",
        "narrow",
        "whether",
        "spinoza",
        "successfully",
        "capitalizes",
        "rhetorical",
        "skill",
        "however",
        "draw",
        "plausible",
        "account",
        "nature",
        "human",
        "mind",
        "general",
        "account",
        "essence",
        "finite",
        "mode",
        "depends",
        "upon",
        "iiip",
        "iii",
        "proposition",
        "insofar",
        "mind",
        "clear",
        "distinct",
        "idea",
        "insofar",
        "confused",
        "idea",
        "strives",
        "indefinite",
        "duration",
        "persevere",
        "conscious",
        "striving",
        "iiip",
        "suggests",
        "spinoza",
        "psychological",
        "egoist",
        "sort",
        "suggests",
        "belief",
        "human",
        "being",
        "desire",
        "secure",
        "interest",
        "construed",
        "perseverance",
        "indeed",
        "spinoza",
        "go",
        "define",
        "desire",
        "iiip",
        "human",
        "striving",
        "appetite",
        "together",
        "consciousness",
        "striving",
        "clearly",
        "human",
        "desire",
        "spinoza",
        "part",
        "striving",
        "perseverance",
        "thus",
        "share",
        "character",
        "question",
        "however",
        "variety",
        "psychological",
        "egoism",
        "spinoza",
        "hold",
        "desire",
        "might",
        "part",
        "striving",
        "perseverance",
        "without",
        "desire",
        "desire",
        "perseverance",
        "one",
        "might",
        "strong",
        "instinctual",
        "desire",
        "thing",
        "instrumental",
        "perseverance",
        "without",
        "desiring",
        "perseverance",
        "example",
        "one",
        "might",
        "desire",
        "perseverance",
        "also",
        "desire",
        "kind",
        "thing",
        "iiip",
        "might",
        "supposed",
        "support",
        "strong",
        "version",
        "psychological",
        "egoism",
        "orthodox",
        "egoism",
        "perhaps",
        "delahunty",
        "hold",
        "view",
        "orthodox",
        "egoism",
        "view",
        "human",
        "being",
        "always",
        "consciously",
        "selfish",
        "view",
        "consciously",
        "desire",
        "object",
        "benefit",
        "b",
        "desire",
        "object",
        "benefit",
        "b",
        "human",
        "being",
        "iiip",
        "spinoza",
        "writes",
        "human",
        "mind",
        "seek",
        "persevere",
        "insofar",
        "clear",
        "distinct",
        "idea",
        "insofar",
        "confused",
        "idea",
        "natural",
        "understand",
        "claim",
        "mean",
        "something",
        "like",
        "following",
        "sometimes",
        "people",
        "thing",
        "conduce",
        "perseverance",
        "time",
        "people",
        "thing",
        "fail",
        "conduce",
        "type",
        "case",
        "though",
        "people",
        "desire",
        "persevere",
        "something",
        "fails",
        "help",
        "persevere",
        "idea",
        "based",
        "action",
        "confused",
        "thought",
        "knew",
        "would",
        "help",
        "persevere",
        "wrong",
        "something",
        "help",
        "persevere",
        "though",
        "unless",
        "simply",
        "lucky",
        "acting",
        "inadequate",
        "idea",
        "acted",
        "clear",
        "distinct",
        "idea",
        "word",
        "genuine",
        "knowledge",
        "would",
        "help",
        "persevere",
        "categorical",
        "language",
        "spinoza",
        "us",
        "appendix",
        "part",
        "provides",
        "explicit",
        "support",
        "interpretation",
        "iiip",
        "men",
        "act",
        "always",
        "account",
        "end",
        "viz",
        "account",
        "advantage",
        "want",
        "moreover",
        "important",
        "passage",
        "spinoza",
        "work",
        "strongly",
        "compatible",
        "interpretation",
        "spinoza",
        "orthodox",
        "egoist",
        "include",
        "ethic",
        "ivpd",
        "political",
        "writing",
        "especially",
        "ethic",
        "ivps",
        "political",
        "treatise",
        "chapter",
        "evidence",
        "suggests",
        "spinoza",
        "orthodox",
        "egoist",
        "however",
        "particular",
        "reason",
        "question",
        "whether",
        "argument",
        "ethic",
        "commits",
        "spinoza",
        "account",
        "action",
        "following",
        "confused",
        "idea",
        "interpretation",
        "iiip",
        "attribute",
        "part",
        "ivps",
        "concern",
        "agent",
        "confused",
        "passage",
        "useful",
        "describes",
        "explicitly",
        "conscious",
        "thoughtprocesses",
        "precede",
        "action",
        "though",
        "men",
        "liable",
        "great",
        "many",
        "affect",
        "one",
        "rarely",
        "find",
        "always",
        "agitated",
        "one",
        "affect",
        "still",
        "one",
        "affect",
        "stubbornly",
        "fixed",
        "sometimes",
        "see",
        "men",
        "affected",
        "one",
        "object",
        "although",
        "present",
        "still",
        "believe",
        "happens",
        "man",
        "asleep",
        "say",
        "mad",
        "insane",
        "thought",
        "le",
        "mad",
        "burn",
        "love",
        "dream",
        "night",
        "day",
        "lover",
        "courtesan",
        "usually",
        "provoke",
        "laughter",
        "greedy",
        "man",
        "think",
        "nothing",
        "else",
        "profit",
        "money",
        "ambitious",
        "man",
        "esteem",
        "thought",
        "mad",
        "usually",
        "troublesome",
        "considered",
        "worthy",
        "hate",
        "greed",
        "ambition",
        "lust",
        "really",
        "specie",
        "madness",
        "even",
        "though",
        "numbered",
        "among",
        "disease",
        "scholium",
        "several",
        "notable",
        "passage",
        "including",
        "iii",
        "definition",
        "affect",
        "xlviii",
        "ivps",
        "spinoza",
        "describes",
        "variety",
        "possible",
        "end",
        "human",
        "action",
        "none",
        "perseverance",
        "moreover",
        "lest",
        "one",
        "think",
        "greedy",
        "man",
        "seek",
        "profit",
        "mistakenly",
        "belief",
        "lead",
        "perseverance",
        "spinoza",
        "emphasizes",
        "point",
        "always",
        "one",
        "object",
        "ob",
        "men",
        "man",
        "seeking",
        "profit",
        "belief",
        "lead",
        "perseverance",
        "may",
        "obsessed",
        "two",
        "object",
        "profit",
        "perseverance",
        "one",
        "ivps",
        "suggests",
        "spinoza",
        "hold",
        "different",
        "kind",
        "view",
        "predominant",
        "egoism",
        "view",
        "people",
        "time",
        "consciously",
        "desire",
        "perseverance",
        "particular",
        "type",
        "predominant",
        "egoism",
        "ivps",
        "suggests",
        "introduces",
        "important",
        "aspect",
        "spinoza",
        "ethical",
        "theory",
        "confused",
        "people",
        "people",
        "addled",
        "greed",
        "lust",
        "ambition",
        "always",
        "seek",
        "something",
        "perseverance",
        "perhaps",
        "spinoza",
        "view",
        "u",
        "act",
        "similar",
        "sentiment",
        "occasionally",
        "extent",
        "also",
        "confused",
        "idea",
        "thus",
        "human",
        "being",
        "predominantly",
        "egoistic",
        "large",
        "act",
        "rationally",
        "rational",
        "seek",
        "persevere",
        "see",
        "also",
        "reason",
        "demand",
        "ivps",
        "always",
        "rational",
        "would",
        "always",
        "pursue",
        "preservation",
        "orthodox",
        "egoism",
        "would",
        "true",
        "spinoza",
        "orthodox",
        "egoist",
        "interpretation",
        "spinoza",
        "predominant",
        "egoist",
        "fully",
        "rational",
        "extent",
        "confused",
        "idea",
        "may",
        "indeed",
        "consciously",
        "pursue",
        "end",
        "perseverance",
        "interpretation",
        "spinoza",
        "right",
        "least",
        "rational",
        "end",
        "pursueperseverance",
        "beingand",
        "end",
        "wrong",
        "least",
        "irrational",
        "ivp",
        "provides",
        "support",
        "interpretation",
        "spinoza",
        "predominant",
        "egoism",
        "iv",
        "proposition",
        "one",
        "strives",
        "able",
        "seek",
        "advantage",
        "ie",
        "preserve",
        "endowed",
        "virtue",
        "conversely",
        "insofar",
        "one",
        "neglect",
        "advantage",
        "ie",
        "neglect",
        "preserve",
        "lack",
        "power",
        "spinoza",
        "explicitly",
        "admits",
        "person",
        "may",
        "neglect",
        "advantage",
        "ivp",
        "apparently",
        "contradicts",
        "orthodox",
        "egoism",
        "appendix",
        "moreover",
        "ivp",
        "state",
        "extent",
        "person",
        "seek",
        "perseverance",
        "person",
        "virtuous",
        "virtue",
        "metaphysical",
        "connotation",
        "ethic",
        "thing",
        "virtue",
        "power",
        "ivd",
        "term",
        "undeniably",
        "moral",
        "connotation",
        "well",
        "ivp",
        "suggests",
        "ivps",
        "consciously",
        "trying",
        "preserve",
        "oneself",
        "right",
        "neglecting",
        "preserve",
        "oneself",
        "wrong",
        "iiip",
        "admits",
        "various",
        "interpretation",
        "however",
        "weight",
        "textual",
        "evidence",
        "support",
        "view",
        "predominant",
        "orthodox",
        "egoist",
        "particular",
        "human",
        "desire",
        "even",
        "desire",
        "desire",
        "perseverance",
        "mean",
        "must",
        "spinoza",
        "view",
        "related",
        "perseverance",
        "way",
        "iiip",
        "iiips",
        "spinoza",
        "discussion",
        "desire",
        "thing",
        "perseverance",
        "passage",
        "ivps",
        "ivp",
        "suggests",
        "moreover",
        "desire",
        "part",
        "product",
        "confusion",
        "passionate",
        "desire",
        "spinoza",
        "often",
        "desire",
        "thing",
        "perseverance",
        "although",
        "may",
        "confused",
        "desire",
        "perseverance",
        "well",
        "see",
        "ivps",
        "discussion",
        "fear",
        "recent",
        "debate",
        "whether",
        "end",
        "human",
        "desire",
        "really",
        "important",
        "psychological",
        "theory",
        "spinoza",
        "understands",
        "human",
        "consciousness",
        "likely",
        "lend",
        "support",
        "view",
        "showing",
        "passage",
        "others",
        "like",
        "may",
        "reconciled",
        "spinoza",
        "basic",
        "commitment",
        "metaphysics",
        "mind",
        "reading",
        "discussion",
        "iiip",
        "see",
        "matson",
        "garrett",
        "interpretation",
        "spinoza",
        "argument",
        "iiipiiip",
        "see",
        "curley",
        "della",
        "rocca",
        "garrett",
        "lin",
        "discussion",
        "historical",
        "source",
        "striving",
        "doctrine",
        "see",
        "james",
        "wolfson",
        "lebuffe",
        "a",
        "pp",
        "youpa",
        "offer",
        "account",
        "selfpreservation",
        "spinoza",
        "spinoza",
        "physic",
        "use",
        "descartes",
        "see",
        "lachterman",
        "peterman",
        "schliesser",
        "booklength",
        "interpretation",
        "ethic",
        "include",
        "detailed",
        "account",
        "spinoza",
        "view",
        "human",
        "nature",
        "discussion",
        "iiip",
        "see",
        "lebuffe",
        "a",
        "chapter",
        "best",
        "general",
        "discussion",
        "psychological",
        "egoism",
        "come",
        "context",
        "interpretation",
        "hobbes",
        "spinoza",
        "sometimes",
        "compared",
        "see",
        "kavka",
        "hampton"
    ]
}