{
    "main_text": "Spinoza and the experimental and mathematical sciences || Mathematical science\n6.3 Mathematical science\n\nObservation and experimentation are no more central to contemporary\nscientific practice than is quantification. Contemporary physical\ntheory, which Spinoza is said to have anticipated, is thoroughly\nquantitative in character. Theories are expressed in quantitative\nterms; giving an explanation of a phenomenon is typically a matter of\ngenerating a mathematically formulated law that covers it. Unifying\ntheories is a matter of showing how the mathematical formulae that\ncomprise them can be derived from one another, how the phenomena they\nconcern can be commensurated. Indeed, observation itself is irrelevant\nto modern physical theory unless it is expressed in quantitative\nterms, since the prediction yielded by physical theories are\npredictions of what the observed measures of things will be. This, in\nturn, requires that the phenomena observed must be measurable.\n\nSpinoza is, in a fairly obvious way, a champion of a mathematical\napproach to understanding the physical world. But Spinoza's\nmathematical model is Euclidean geometry, and this is not a domain of\nmathematics that deals with quantities as measurable. And indeed,\nthere is strong evidence that Spinoza thought that a proper\nunderstanding of physical nature can never be expressed in terms of\nmeasurable quantities. For measure, both of spatial extent and\ntemporal duration, is a mere aid to the imagination, and not a means\nof intellectually understanding. In Letter 12 to Meyer, Spinoza\ndistinguishes two ways of conceiving quantity. One is abstract and\nsuperficial, as we have it is sensation and imagination; on this\nconception quantities can be finite, divisible, and composed of parts.\nThe other is through the intellect's grasp of substance in which\n“we apprehend the thing as it is in itself”; on this\nconception, quantity is infinite, indivisible, and a unity. Spinoza\ngoes on to elaborate how measure of spatial and temporal quantity\nderives from the abstract, superficial conception of quantity, and\nleads to nothing but confusion in the attempt to understand physical\nnature. His discussion is worth quoting at length.\n\nFrom the fact that we are able to delimit Duration and Quantity as we\nplease, conceiving quantity in abstraction from Substance and\nseparating the efflux of duration from things eternal, there arise\nTime and Measure: Time to delimit Duration and Measure to delimit\nQuantity in such wise as enables us to imagine them easily, as far as\npossible. Again, from the fact we separate the affections of substance\nfrom substance itself, and arrange them in classes so that can easily\nimagine them as far as possible, there arises Number, whereby we\ndelimit them. Hence it can be seen clearly that measure, Time and\nNumber are nothing other than modes of thinking, or rather, modes of\nimagining. It is therefore not surprising that all who have attempted\nto understand the workings of nature by such concepts, and furthermore\nwithout really understanding these concepts, have tied themselves into\nsuch extraordinary knots that in the end they have been unable to\nextricate themselves except by breaking through everything and\nperpetrating the grossest absurdities. (Letter 12).\n\n\nAs if to emphasize that he is speaking not just of the understanding\nof nature as substance (natura naturans), but also of the\npassive nature of the existing finite modes (natura\nnaturata), Spinoza cites the troubles one gets into as soon as\none attempts to conceive duration through the abstraction of time. The\neternity of the attributes and active nature is to be contrasted with\nthe duration of existing modes. Yet to attempt to understand the\nduration of modes through the abstraction Time, and by implication, to\ntry to understand the spatial extension of modes through Measure and\nNumber, is to employ aids to the imagination only, and inevitably\nleads not to understanding, but to\n absurdities.[17]\n We must conclude that Spinoza's views of Measure, Time and Number\nconfound the easy impression that he thought that the variety in\nmatter could be accounted for by motion and rest considered as\nnumerical quantities. Even if we could satisfy Gabbey's demand for a\n“mathematical account of … proportions of motion and rest\nand of the measures of motion and rest from which they are\nformed”, that would not meet Spinoza's own demands for the\nintellectual understanding of the nature and existence of bodies.\n\nRelying largely on Spinoza's denial of the divisibility or\nmeasurability of extension as it is properly conceived (as opposed to\nimagined), Alison Peterman (Peterman 2012, 2015) has advanced the bold\nthesis that Spinoza's extension is not spatial or dimensional at all,\nand that, accordingly, Spinoza's bodies do not occupy space. On this\nview, Spinoza means something quite different by\n“extension” than Descartes or anyone else has meant. For\nPeterman, it is not just the apparent divisibility and measurability\nof extension that is an illusion of the imagination, but its very\nspatiality. Peterman argues that spatial extent would necessarily be,\nat least potentially, divisible, and that since Spinoza denies that\nextension is even potentially divisible, he must not understand\nextension as spatial (Peterman 2012, \np. 50).[18]\nShe further supports this\nview by noting that, while Spinoza explicitly characterizes extension\nin spatial terms in his exposition of Descartes' view in the\nPCP, he does not so define extension in expounding his own\nviews in the Ethics, but rather says that extension is\n“conceived through itself” .\n\nPeterman's view has the benefit of helping Spinoza avoid the\ndifficulties of making clear how something genuinely spatial cannot be\ndivided or measured. But this benefit comes at substantial costs. For\none thing, Spinoza is hardly shy in the Ethics about making\nhis heterodox views explicit. If he thought that the wildly heterodox\nclaims that extension is not dimensional and that bodies do not occupy\nspace followed from the indivisibility of extension, and endorsed\nthose claims, one would expect him to have made the inference\nexplicit, rather than leaving it for the reader to draw. Second, the\nview renders Spinoza's philosophy oddly irrelevant to the physical,\nwhich certainly concerns nature as a spatiotemporal domain, and which\nis a preoccupation of everyone with whom Spinoza is in intellectual\ncommerce. Third, and relatedly, even conceding, as one must, that no\nimaginative grasp of extension or bodies can constitute an adequate\nconception of them, if extension is not dimensional and bodies do not\noccupy space, the question arises why we so much as imagine them that\nway, that is, why the ideas of the affections of our bodies are\nimages at all. Leibniz, in the more idealistic phases in\nwhich he denies the ultimate reality of space and time, feels acutely\nthe obligation to explain why spatiotemporal phenomena are\nwell-grounded in what is ultimately real. And Kant, who denies the\nspatiotemporality of things in themselves, goes to great lengths to\nexplain why the phenomenal appearances of these things must be in\nspace and time, and conform to the categories as well. Even if Kant's\nclaim that space and time are the forms of intuition looks like a\nlabel for the problem rather than a genuine explanation, it least it\nis a recognition of the problem. But Spinoza, on Peterman's view,\nequally rejects the reality of space and its apparent occupants, but\nseems to have nothing at all to say about why the appearances are as\nthey are, i.e., imagined. Finally, it is obvious that, on Peterman's\nview, “motion and rest”, which Spinoza invokes as an\ninfinite mode of extension and in the individuation of bodies, cannot\nhave their ordinary signification of local motion and rest. So she,\nlike others who deny that “motion and rest” have their\nordinary sense for Spinoza (see section 5.2 above) owes an account of\nwhat they are. But the burden seems even greater for her view, since\nit is quite unclear just what extension might properly be conceived to\nbe, if not dimensional. The only characterizations available seem\npurely negative: not finite, not measurably, not spatial. But what,\nthen? Peterman argues that it is not surprising that the attribute of\nextension should be undefined, since it is “conceived through\nitself”. But to say that something is conceived through itself\nis surely not to say that it is conceived only negatively or in no way\nat all.\n\nFor these reasons, it seems preferable to take the interpretive path\nPeterman considers and rejects, of holding that Spinoza's extension is\nindeed dimensional and his bodies occupants of space, but that\nextension is not really, but only imaginatively, divisible and\nmeasurable. To reconcile the indivisibility of extension and the\nimmeasurability of bodies with the extension's spatiality, we can\nsimply say that one way of conceiving substance is as spatially\nexpended, but that so conceived, it is not divisible, in the sense\nthat it cannot be divided into multiple substances; and we can say\nthat bodies take up space, but cannot be measured, because there is no\nsense to be made of the idea that there is some definite portion of\nthe infinite extension any part thereof occupies, as there would be if\nextension were finite. To conceive  extension through itself\nwould just be to conceive spatiality; this secures the relevance of\nSpinoza's extension to the physical, and likewise provides a ground\nfor the spatiality of appearances in imagination. This preferable\npath, however, takes us no closer to a reconciliation of Spinoza's\nthinking about the physical with the observational, experimental, and\nmathematical character of modern and contemporary physical science.\nIndeed, it seems that, as Schiesser (2017, p. 186) remarks, “it\nis … a mistake to understand Spinoza as a fellow traveler of\nthe scientific revolution.”\n\nWe saw earlier that there are grounds, though hardly conclusive, for\nsupposing that Spinoza held a fundamental metaphysical view of\nphysical nature that is akin to the contemporary view of the physical\nworld as composed of fields of force, with bodies in some sense being\nconstituted by relatively stable patterns, relative to our own, of\nforce. However, Spinoza's hostility to observation as a source of\nknowledge, his view that experimentation can at best provide examples\nof what we know through reason, and his rejection of the idea that\nphysical nature is to be known through number and measurable\nquantities, suggest that his convergence with contemporary physical\nscience goes no farther than this possible anticipation of the theory\nof fields as fundamental.\n",
    "section_title": "6.3 Mathematical science",
    "entry_title": "Spinoza’s Physical Theory",
    "hierarchy_title": "Spinoza’s Physical Theory || Spinoza and the experimental and mathematical sciences || Mathematical science",
    "tokenized_text": [
        "spinoza",
        "experimental",
        "mathematical",
        "science",
        "mathematical",
        "science",
        "mathematical",
        "science",
        "observation",
        "experimentation",
        "central",
        "contemporary",
        "scientific",
        "practice",
        "quantification",
        "contemporary",
        "physical",
        "theory",
        "spinoza",
        "said",
        "anticipated",
        "thoroughly",
        "quantitative",
        "character",
        "theory",
        "expressed",
        "quantitative",
        "term",
        "giving",
        "explanation",
        "phenomenon",
        "typically",
        "matter",
        "generating",
        "mathematically",
        "formulated",
        "law",
        "cover",
        "unifying",
        "theory",
        "matter",
        "showing",
        "mathematical",
        "formula",
        "comprise",
        "derived",
        "one",
        "another",
        "phenomenon",
        "concern",
        "commensurated",
        "indeed",
        "observation",
        "irrelevant",
        "modern",
        "physical",
        "theory",
        "unless",
        "expressed",
        "quantitative",
        "term",
        "since",
        "prediction",
        "yielded",
        "physical",
        "theory",
        "prediction",
        "observed",
        "measure",
        "thing",
        "turn",
        "requires",
        "phenomenon",
        "observed",
        "must",
        "measurable",
        "spinoza",
        "fairly",
        "obvious",
        "way",
        "champion",
        "mathematical",
        "approach",
        "understanding",
        "physical",
        "world",
        "spinoza",
        "s",
        "mathematical",
        "model",
        "euclidean",
        "geometry",
        "domain",
        "mathematics",
        "deal",
        "quantity",
        "measurable",
        "indeed",
        "strong",
        "evidence",
        "spinoza",
        "thought",
        "proper",
        "understanding",
        "physical",
        "nature",
        "never",
        "expressed",
        "term",
        "measurable",
        "quantity",
        "measure",
        "spatial",
        "extent",
        "temporal",
        "duration",
        "mere",
        "aid",
        "imagination",
        "mean",
        "intellectually",
        "understanding",
        "letter",
        "meyer",
        "spinoza",
        "distinguishes",
        "two",
        "way",
        "conceiving",
        "quantity",
        "one",
        "abstract",
        "superficial",
        "sensation",
        "imagination",
        "conception",
        "quantity",
        "finite",
        "divisible",
        "composed",
        "part",
        "intellect",
        "s",
        "grasp",
        "substance",
        "apprehend",
        "thing",
        "conception",
        "quantity",
        "infinite",
        "indivisible",
        "unity",
        "spinoza",
        "go",
        "elaborate",
        "measure",
        "spatial",
        "temporal",
        "quantity",
        "derives",
        "abstract",
        "superficial",
        "conception",
        "quantity",
        "lead",
        "nothing",
        "confusion",
        "attempt",
        "understand",
        "physical",
        "nature",
        "discussion",
        "worth",
        "quoting",
        "length",
        "fact",
        "able",
        "delimit",
        "duration",
        "quantity",
        "please",
        "conceiving",
        "quantity",
        "abstraction",
        "substance",
        "separating",
        "efflux",
        "duration",
        "thing",
        "eternal",
        "arise",
        "time",
        "measure",
        "time",
        "delimit",
        "duration",
        "measure",
        "delimit",
        "quantity",
        "wise",
        "enables",
        "u",
        "imagine",
        "easily",
        "far",
        "possible",
        "fact",
        "separate",
        "affection",
        "substance",
        "substance",
        "arrange",
        "class",
        "easily",
        "imagine",
        "far",
        "possible",
        "arises",
        "number",
        "whereby",
        "delimit",
        "hence",
        "seen",
        "clearly",
        "measure",
        "time",
        "number",
        "nothing",
        "mode",
        "thinking",
        "rather",
        "mode",
        "imagining",
        "therefore",
        "surprising",
        "attempted",
        "understand",
        "working",
        "nature",
        "concept",
        "furthermore",
        "without",
        "really",
        "understanding",
        "concept",
        "tied",
        "extraordinary",
        "knot",
        "end",
        "unable",
        "extricate",
        "except",
        "breaking",
        "everything",
        "perpetrating",
        "grossest",
        "absurdity",
        "letter",
        "emphasize",
        "speaking",
        "understanding",
        "nature",
        "substance",
        "natura",
        "naturans",
        "also",
        "passive",
        "nature",
        "existing",
        "finite",
        "mode",
        "natura",
        "naturata",
        "spinoza",
        "cite",
        "trouble",
        "one",
        "get",
        "soon",
        "one",
        "attempt",
        "conceive",
        "duration",
        "abstraction",
        "time",
        "eternity",
        "attribute",
        "active",
        "nature",
        "contrasted",
        "duration",
        "existing",
        "mode",
        "yet",
        "attempt",
        "understand",
        "duration",
        "mode",
        "abstraction",
        "time",
        "implication",
        "try",
        "understand",
        "spatial",
        "extension",
        "mode",
        "measure",
        "number",
        "employ",
        "aid",
        "imagination",
        "inevitably",
        "lead",
        "understanding",
        "absurdity",
        "must",
        "conclude",
        "spinoza",
        "s",
        "view",
        "measure",
        "time",
        "number",
        "confound",
        "easy",
        "impression",
        "thought",
        "variety",
        "matter",
        "could",
        "accounted",
        "motion",
        "rest",
        "considered",
        "numerical",
        "quantity",
        "even",
        "could",
        "satisfy",
        "gabbey",
        "s",
        "demand",
        "mathematical",
        "account",
        "proportion",
        "motion",
        "rest",
        "measure",
        "motion",
        "rest",
        "formed",
        "would",
        "meet",
        "spinoza",
        "s",
        "demand",
        "intellectual",
        "understanding",
        "nature",
        "existence",
        "body",
        "relying",
        "largely",
        "spinoza",
        "s",
        "denial",
        "divisibility",
        "measurability",
        "extension",
        "properly",
        "conceived",
        "opposed",
        "imagined",
        "alison",
        "peterman",
        "peterman",
        "advanced",
        "bold",
        "thesis",
        "spinoza",
        "s",
        "extension",
        "spatial",
        "dimensional",
        "accordingly",
        "spinoza",
        "s",
        "body",
        "occupy",
        "space",
        "view",
        "spinoza",
        "mean",
        "something",
        "quite",
        "different",
        "extension",
        "descartes",
        "anyone",
        "else",
        "meant",
        "peterman",
        "apparent",
        "divisibility",
        "measurability",
        "extension",
        "illusion",
        "imagination",
        "spatiality",
        "peterman",
        "argues",
        "spatial",
        "extent",
        "would",
        "necessarily",
        "least",
        "potentially",
        "divisible",
        "since",
        "spinoza",
        "denies",
        "extension",
        "even",
        "potentially",
        "divisible",
        "must",
        "understand",
        "extension",
        "spatial",
        "peterman",
        "p",
        "support",
        "view",
        "noting",
        "spinoza",
        "explicitly",
        "characterizes",
        "extension",
        "spatial",
        "term",
        "exposition",
        "descartes",
        "view",
        "pcp",
        "define",
        "extension",
        "expounding",
        "view",
        "ethic",
        "rather",
        "say",
        "extension",
        "conceived",
        "peterman",
        "s",
        "view",
        "benefit",
        "helping",
        "spinoza",
        "avoid",
        "difficulty",
        "making",
        "clear",
        "something",
        "genuinely",
        "spatial",
        "divided",
        "measured",
        "benefit",
        "come",
        "substantial",
        "cost",
        "one",
        "thing",
        "spinoza",
        "hardly",
        "shy",
        "ethic",
        "making",
        "heterodox",
        "view",
        "explicit",
        "thought",
        "wildly",
        "heterodox",
        "claim",
        "extension",
        "dimensional",
        "body",
        "occupy",
        "space",
        "followed",
        "indivisibility",
        "extension",
        "endorsed",
        "claim",
        "one",
        "would",
        "expect",
        "made",
        "inference",
        "explicit",
        "rather",
        "leaving",
        "reader",
        "draw",
        "second",
        "view",
        "render",
        "spinoza",
        "s",
        "philosophy",
        "oddly",
        "irrelevant",
        "physical",
        "certainly",
        "concern",
        "nature",
        "spatiotemporal",
        "domain",
        "preoccupation",
        "everyone",
        "spinoza",
        "intellectual",
        "commerce",
        "third",
        "relatedly",
        "even",
        "conceding",
        "one",
        "must",
        "imaginative",
        "grasp",
        "extension",
        "body",
        "constitute",
        "adequate",
        "conception",
        "extension",
        "dimensional",
        "body",
        "occupy",
        "space",
        "question",
        "arises",
        "much",
        "imagine",
        "way",
        "idea",
        "affection",
        "body",
        "image",
        "leibniz",
        "idealistic",
        "phase",
        "denies",
        "ultimate",
        "reality",
        "space",
        "time",
        "feel",
        "acutely",
        "obligation",
        "explain",
        "spatiotemporal",
        "phenomenon",
        "wellgrounded",
        "ultimately",
        "real",
        "kant",
        "denies",
        "spatiotemporality",
        "thing",
        "go",
        "great",
        "length",
        "explain",
        "phenomenal",
        "appearance",
        "thing",
        "must",
        "space",
        "time",
        "conform",
        "category",
        "well",
        "even",
        "kant",
        "s",
        "claim",
        "space",
        "time",
        "form",
        "intuition",
        "look",
        "like",
        "label",
        "problem",
        "rather",
        "genuine",
        "explanation",
        "least",
        "recognition",
        "problem",
        "spinoza",
        "peterman",
        "s",
        "view",
        "equally",
        "reject",
        "reality",
        "space",
        "apparent",
        "occupant",
        "seems",
        "nothing",
        "say",
        "appearance",
        "ie",
        "imagined",
        "finally",
        "obvious",
        "peterman",
        "s",
        "view",
        "motion",
        "rest",
        "spinoza",
        "invokes",
        "infinite",
        "mode",
        "extension",
        "individuation",
        "body",
        "ordinary",
        "signification",
        "local",
        "motion",
        "rest",
        "like",
        "others",
        "deny",
        "motion",
        "rest",
        "ordinary",
        "sense",
        "spinoza",
        "see",
        "section",
        "owes",
        "account",
        "burden",
        "seems",
        "even",
        "greater",
        "view",
        "since",
        "quite",
        "unclear",
        "extension",
        "might",
        "properly",
        "conceived",
        "dimensional",
        "characterization",
        "available",
        "seem",
        "purely",
        "negative",
        "finite",
        "measurably",
        "spatial",
        "peterman",
        "argues",
        "surprising",
        "attribute",
        "extension",
        "undefined",
        "since",
        "conceived",
        "say",
        "something",
        "conceived",
        "surely",
        "say",
        "conceived",
        "negatively",
        "way",
        "reason",
        "seems",
        "preferable",
        "take",
        "interpretive",
        "path",
        "peterman",
        "considers",
        "reject",
        "holding",
        "spinoza",
        "s",
        "extension",
        "indeed",
        "dimensional",
        "body",
        "occupant",
        "space",
        "extension",
        "really",
        "imaginatively",
        "divisible",
        "measurable",
        "reconcile",
        "indivisibility",
        "extension",
        "immeasurability",
        "body",
        "extension",
        "s",
        "spatiality",
        "simply",
        "say",
        "one",
        "way",
        "conceiving",
        "substance",
        "spatially",
        "expended",
        "conceived",
        "divisible",
        "sense",
        "divided",
        "multiple",
        "substance",
        "say",
        "body",
        "take",
        "space",
        "measured",
        "sense",
        "made",
        "idea",
        "definite",
        "portion",
        "infinite",
        "extension",
        "part",
        "thereof",
        "occupies",
        "would",
        "extension",
        "finite",
        "conceive",
        "extension",
        "would",
        "conceive",
        "spatiality",
        "secures",
        "relevance",
        "spinoza",
        "s",
        "extension",
        "physical",
        "likewise",
        "provides",
        "ground",
        "spatiality",
        "appearance",
        "imagination",
        "preferable",
        "path",
        "however",
        "take",
        "u",
        "closer",
        "reconciliation",
        "spinoza",
        "s",
        "thinking",
        "physical",
        "observational",
        "experimental",
        "mathematical",
        "character",
        "modern",
        "contemporary",
        "physical",
        "science",
        "indeed",
        "seems",
        "schiesser",
        "p",
        "remark",
        "mistake",
        "understand",
        "spinoza",
        "fellow",
        "traveler",
        "scientific",
        "revolution",
        "saw",
        "earlier",
        "ground",
        "though",
        "hardly",
        "conclusive",
        "supposing",
        "spinoza",
        "held",
        "fundamental",
        "metaphysical",
        "view",
        "physical",
        "nature",
        "akin",
        "contemporary",
        "view",
        "physical",
        "world",
        "composed",
        "field",
        "force",
        "body",
        "sense",
        "constituted",
        "relatively",
        "stable",
        "pattern",
        "relative",
        "force",
        "however",
        "spinoza",
        "s",
        "hostility",
        "observation",
        "source",
        "knowledge",
        "view",
        "experimentation",
        "best",
        "provide",
        "example",
        "know",
        "reason",
        "rejection",
        "idea",
        "physical",
        "nature",
        "known",
        "number",
        "measurable",
        "quantity",
        "suggest",
        "convergence",
        "contemporary",
        "physical",
        "science",
        "go",
        "farther",
        "possible",
        "anticipation",
        "theory",
        "field",
        "fundamental"
    ]
}