{
    "main_text": "Some later work || Return of the reversibility objection\n5.3 The debate in Nature\n\n\nThe 1890s brought three major events in Boltzmann's work on\nstatistical physics. The foremost of these was his participation in\nthe 1894 meeting of the British Association for the Advancement of\nScience (BAAS) in Oxford, where issues in gas theory were lively\ndebated.  Another was his debate with Zermelo, in 1896–1897. The\nthird was the appearance of his two-volume book Lectures in Gas\nTheory in 1896 and 1898.  for a more extensive discussion of the\nDebate with Zermelo, see Uffink (2007) and (2013).  \n\n\nThe BAAS meeting had a lively aftermath: A discussion between half a\ndozen authors in the columns of Nature in the years\n1894–1895. The central topic of this debate was the paradoxical\nrelation between the H-theorem and the reversibility\nobjection.\n\n\nThe kick-off was an letter by Culverwell (1894) with the\ninnocently-sounding question, “Will anyone say exactly what the\nH-theorem proves?” The question triggered several responses.\nCulverwell noted, with some amusement, in a subsequent letter\n(1895)  that they all seemed to argue quite\ndifferently. Perhaps the most important responses were Burbury (1894a)\nand (1894b) and Bryan (1894). Burbury argued that the\nH-theorem rests on an additional assumption, which was\nindependent of mechanical theory, which he coined “Condition A”. His\nactual phrasing of the condition was somewhat involved. In any case,\nBurbury, argued out that the reversed motion would not satisfy\nCondition A, and that the H-theorem would thus fail to be\napplicable. He thus succeeded in finally illuminating the logical\nsituation between the reversibility objection and the\nH-theorem. The theorem assumed the validity of a condition,\nwhich would be violated in the reversed motion; i.e., Condition A\nitself already contained a time-asymmetrical element. Further, given\nthe time-reversal invariance of the mechanical laws governing the\nsystem, any motivation for the condition would have to come from\nbeyond these laws and must thus be non-mechanical.\n\n\nAlthough Burbury had thus succeeded in clarifying the logic of the\nH-theorem, his actual formulation of Condition A was not\nparticularly transparent. By contrast, Bryan's contribution to the\ndebate may be said to possess the opposite qualities. He was the first\nto clearly point out that the SZA itself is not invariant under\ntime-reversal. Less convincing is his argument that the time-reversed\nassumption would suppose the molecules possessing some kind of\nforesight.\n\n\nFinally Boltzmann himself intervened in the debate (Boltzmann 1895).\nHe recognized, of course, that the same issues that he discussed with\nLoschmidt 20 years earlier were again at stake, and elucidated:\n\n\n  My minimum theorem as well as the so-called Second Law of Thermodynamics\nare only theorems of probability (WA III, 539).\nIt can never be proved from the equations of motion alone, that\nthe minimum function \\(H\\) must always decrease. It can only be\ndeduced from the laws of probability, that if the initial state is not\nspecially arranged for a certain purpose, but haphazard governs\nfreely, the probability that \\(H\\) decreases is always greater than\nthat it increases. (WA III, 540)\n\n\n\nIn more detail, his argument is as follows. Consider a gas in a vessel\nwith perfectly smooth and elastic walls, in an arbitrary initial state\nand let it evolve in the course of time. At each time \\(t\\) we can\ncalculate \\(H(t)\\). Now draw a graph of this function: the\n\\(H\\)-curve. (In a later discussion, Boltzmann 1897, he actually\nproduced a diagram.)\n\n\nBarring all cases in which the motion is ‘regular’, e.g.,\nwhen all the molecules move in one plane, Boltzmann claims the\nfollowing properties of the curve:\n\nFor most of the time, \\(H(t)\\) will be very close to its minimum\nvalue, say \\(H_{\\text{min}}\\).  \nBecause greater values of \\(H\\) are improbable but not\nimpossible, the curve will occasionally, but very rarely, rise to a\npeak or summit, that may be well above \\(H_{\\text{min}}\\). \nHigher summits are extremely less probable then\nlower summits.\n\n\n\nSuppose that, at some time \\(t=0\\), the function attain a certain\nvalue \\(H_0\\), well above the minimum value. Now, Boltzmann says,\ntwo[13] cases\nare possible for the evolution of \\(H\\) in time. (a) \\(H_0\\) lies at\nor near the top of a peak. Then \\(H(t)\\) will decrease, whether we\nmove away in either the positive are negative time direction. (b)\n\\(H_0\\) lies on an ascending or descending part of the curve, so that\n\\(H(t)\\) decreases or increases. But, because of (iii), case (a) is\nmuch more probable than case (b). Hence, Boltzmann says, \n\n … if we choose an ordinate of given magnitude \\(H_0\\) guided\nby haphazard in the curve, it will not be certain but very probable\nthat the ordinate decreases if we go in either direction. (WA III,\n540)\n \n And,\n\n What I have proved in my papers is as follows: It is extremely\nprobable that \\(H\\) is very near to its minimum value; if it is\ngreater, it may increase or decrease, but the probability that it\ndecreases is always greater. (WA III, 541)\n \n Together, the claims (i)–(iii) constitute a statement of\nwhat I called a ‘statistical H-theorem’.\n\n\nAfter having thus elucidated the content of his theorem, Boltzmann\naddressed the reversibility objection. Suppose the gas is initially in\na non-equilibrium state, with a large value of \\(H\\). Then it is\nprobable, but not certain, that it will decrease, and eventually reach\nits minimum\nIf at an intermediate stage we reverse all velocities we\nget an exceptional state where \\(H\\) increases for a certain time and\ndecreases again. But the existence of such cases does not disprove our\ntheorem. On the contrary the theory of probability itself shows that\nthe probability of such cases is not mathematically zero, only\nextremely small. (WA III, 541)\n\n\nIt is not immediately clear how this refutes the reversibility\nobjection. If we focus on the fact that the reversed state is\n“exceptional”, and take it to belong to those cases\n(“regular motions”) that were explicitly barred in the\nstatement of the theorem, then his reply is like that to\nLoschmidt. But perhaps his central idea here is rather that in the\nreversed motion, \\(H\\) increases for a short while, but will\neventually decrease again, and continue to do so. In that case his\ndefence is more like the reply to Tait. In actual fact the two are\nhard to combine. If we admit that the reversed state is exceptional in\nthe sense that the statistical H-theorem does not hold for\nit, we have no grounds for claiming that eventually \\(H\\) will\ndecrease again.\n\n\nThis particular article is often cited as one of the clearest\nexpositions that Boltzmann ever wrote, and one in which “he is right\non the money” (Lebowitz 1999). Still there are a few thing that\ndeserve attention.\n\n\n1. It seems to me that Boltzmann here adopts an (implicit)\nidentification of probability and relative duration, At the very\nleast, he does not indicate any difference in meaning between phrases\nlike “During the greater part of that time, \\(H\\) will be very\nnear to its minimum” and “It is extremely probable that\n\\(H\\) lies near its minimum”. Also, it seems that to me that his\nclaim (ii) that peaks in the curve are “very rare”, and\nhis claim (iii) that they are “very improbable” are\nintended as synonymous. This way of reading Boltzmann would indeed not\nfall out of tune with his previous interpretations of probability.\n\n\n2. But a larger problem looms. Boltzmann says that the statistical\nH-theorem is something he had “proved in his papers”. But\nthat is surely a gross overstatement. No proof of the claims\n(i)–(iii) for a gas system is to be found anywhere in his work.\n\n\nThe most well-known view to the problem of how to explain this lacuna\nis, again, supplied by the Ehrenfests. In essence, they suggest that\nBoltzmann somehow silently relied on the ergodic hypothesis.\n\n\nIt is indeed evident that if the ergodic hypothesis holds, a state\nwill spend time in the various regions of phase space in proportion to\ntheir volume. That is to say, during the evolution of the system along\nits trajectory, regions with a small volume, are visited only\nsporadically, and regions with larger volume more often.\n\n\nThis would make it plausible how Boltzmann could identify\nprobabilities with relative times. But also, it would make it\nplausible that if a system starts out from a very small region (an\nimprobable state) it will display a ‘tendency’ to evolve\ntowards the overwhelmingly larger equilibrium state. Of course, this\n‘tendency’ would have to be interpreted in a qualified\nsense: the same ergodic hypothesis would imply that the system cannot\nstay inside the equilibrium state forever and thus there would indeed\nbe incessant fluctuations in and out of equilibrium. Indeed, one would\nhave to state that the tendency to evolve from improbable to probable\nstates is itself a probabilistic affair: as something that holds true\nfor most of the initial states, or for most of the time, or as some\ntype of expectation value or another. In short, we would then\nhopefully obtain some statistical version of the\nH-theorem. Exactly how this statistical H-theorem\nshould be formulated remains an open problem in the Ehrenfests' point\nof view. Indeed they distinguish between several possible statistical\ninterpretations of the theorem.\n\n\nThe Ehrenfests' reading of Boltzmann's intentions has thus some\nundeniable advantages. However, there is no evidence that Boltzmann\nreally had the ergodic hypothesis in mind. It seems m more likely that\nhe relied on a naive identification of the various meanings of\nprobability. Further, nobody has ever succeeded in proving a\nstatistical H-theorem on the basis of the ergodic hypothesis,\nor on the basis of a modern relative such as the hypothesis of\n‘metrical transitivity’. Much stronger dynamical and\nprobabilistic conditions seem to be needed for such a proof, and even\nthen it remains a difficult problem whether these are satisfied in a\nrealistic gas model.\n",
    "section_title": "5.3 The debate in Nature",
    "entry_title": "Boltzmann’s Work in Statistical Physics",
    "hierarchy_title": "Boltzmann’s Work in Statistical Physics || Some later work || Return of the reversibility objection",
    "tokenized_text": [
        "later",
        "work",
        "return",
        "reversibility",
        "objection",
        "debate",
        "nature",
        "s",
        "brought",
        "three",
        "major",
        "event",
        "boltzmann",
        "s",
        "work",
        "statistical",
        "physic",
        "foremost",
        "participation",
        "meeting",
        "british",
        "association",
        "advancement",
        "science",
        "baa",
        "oxford",
        "issue",
        "gas",
        "theory",
        "lively",
        "debated",
        "another",
        "debate",
        "zermelo",
        "third",
        "appearance",
        "twovolume",
        "book",
        "lecture",
        "gas",
        "theory",
        "extensive",
        "discussion",
        "debate",
        "zermelo",
        "see",
        "uffink",
        "baa",
        "meeting",
        "lively",
        "aftermath",
        "discussion",
        "half",
        "dozen",
        "author",
        "column",
        "nature",
        "year",
        "central",
        "topic",
        "debate",
        "paradoxical",
        "relation",
        "htheorem",
        "reversibility",
        "objection",
        "kickoff",
        "letter",
        "culverwell",
        "innocentlysounding",
        "question",
        "anyone",
        "say",
        "exactly",
        "htheorem",
        "prof",
        "question",
        "triggered",
        "several",
        "response",
        "culverwell",
        "noted",
        "amusement",
        "subsequent",
        "letter",
        "seemed",
        "argue",
        "quite",
        "differently",
        "perhaps",
        "important",
        "response",
        "burbury",
        "a",
        "b",
        "bryan",
        "burbury",
        "argued",
        "htheorem",
        "rest",
        "additional",
        "assumption",
        "independent",
        "mechanical",
        "theory",
        "coined",
        "condition",
        "actual",
        "phrasing",
        "condition",
        "somewhat",
        "involved",
        "case",
        "burbury",
        "argued",
        "reversed",
        "motion",
        "would",
        "satisfy",
        "condition",
        "htheorem",
        "would",
        "thus",
        "fail",
        "applicable",
        "thus",
        "succeeded",
        "finally",
        "illuminating",
        "logical",
        "situation",
        "reversibility",
        "objection",
        "htheorem",
        "theorem",
        "assumed",
        "validity",
        "condition",
        "would",
        "violated",
        "reversed",
        "motion",
        "ie",
        "condition",
        "already",
        "contained",
        "timeasymmetrical",
        "element",
        "given",
        "timereversal",
        "invariance",
        "mechanical",
        "law",
        "governing",
        "system",
        "motivation",
        "condition",
        "would",
        "come",
        "beyond",
        "law",
        "must",
        "thus",
        "nonmechanical",
        "although",
        "burbury",
        "thus",
        "succeeded",
        "clarifying",
        "logic",
        "htheorem",
        "actual",
        "formulation",
        "condition",
        "particularly",
        "transparent",
        "contrast",
        "bryan",
        "s",
        "contribution",
        "debate",
        "may",
        "said",
        "posse",
        "opposite",
        "quality",
        "first",
        "clearly",
        "point",
        "sza",
        "invariant",
        "timereversal",
        "le",
        "convincing",
        "argument",
        "timereversed",
        "assumption",
        "would",
        "suppose",
        "molecule",
        "possessing",
        "kind",
        "foresight",
        "finally",
        "boltzmann",
        "intervened",
        "debate",
        "boltzmann",
        "recognized",
        "course",
        "issue",
        "discussed",
        "loschmidt",
        "year",
        "earlier",
        "stake",
        "elucidated",
        "minimum",
        "theorem",
        "well",
        "socalled",
        "second",
        "law",
        "thermodynamics",
        "theorem",
        "probability",
        "wa",
        "iii",
        "never",
        "proved",
        "equation",
        "motion",
        "alone",
        "minimum",
        "function",
        "h",
        "must",
        "always",
        "decrease",
        "deduced",
        "law",
        "probability",
        "initial",
        "state",
        "specially",
        "arranged",
        "certain",
        "purpose",
        "haphazard",
        "governs",
        "freely",
        "probability",
        "h",
        "decrease",
        "always",
        "greater",
        "increase",
        "wa",
        "iii",
        "detail",
        "argument",
        "follows",
        "consider",
        "gas",
        "vessel",
        "perfectly",
        "smooth",
        "elastic",
        "wall",
        "arbitrary",
        "initial",
        "state",
        "let",
        "evolve",
        "course",
        "time",
        "time",
        "t",
        "calculate",
        "h",
        "draw",
        "graph",
        "function",
        "h",
        "curve",
        "later",
        "discussion",
        "boltzmann",
        "actually",
        "produced",
        "diagram",
        "barring",
        "case",
        "motion",
        "regular",
        "eg",
        "molecule",
        "move",
        "one",
        "plane",
        "boltzmann",
        "claim",
        "following",
        "property",
        "curve",
        "time",
        "h",
        "close",
        "minimum",
        "value",
        "say",
        "h_",
        "text",
        "min",
        "greater",
        "value",
        "h",
        "improbable",
        "impossible",
        "curve",
        "occasionally",
        "rarely",
        "rise",
        "peak",
        "summit",
        "may",
        "well",
        "h_",
        "text",
        "min",
        "higher",
        "summit",
        "extremely",
        "le",
        "probable",
        "lower",
        "summit",
        "suppose",
        "time",
        "t",
        "function",
        "attain",
        "certain",
        "value",
        "h_",
        "well",
        "minimum",
        "value",
        "boltzmann",
        "say",
        "two",
        "case",
        "possible",
        "evolution",
        "h",
        "time",
        "h_",
        "lie",
        "near",
        "top",
        "peak",
        "h",
        "decrease",
        "whether",
        "move",
        "away",
        "either",
        "positive",
        "negative",
        "time",
        "direction",
        "b",
        "h_",
        "lie",
        "ascending",
        "descending",
        "part",
        "curve",
        "h",
        "decrease",
        "increase",
        "iii",
        "case",
        "much",
        "probable",
        "case",
        "b",
        "hence",
        "boltzmann",
        "say",
        "choose",
        "ordinate",
        "given",
        "magnitude",
        "h_",
        "guided",
        "haphazard",
        "curve",
        "certain",
        "probable",
        "ordinate",
        "decrease",
        "go",
        "either",
        "direction",
        "wa",
        "iii",
        "proved",
        "paper",
        "follows",
        "extremely",
        "probable",
        "h",
        "near",
        "minimum",
        "value",
        "greater",
        "may",
        "increase",
        "decrease",
        "probability",
        "decrease",
        "always",
        "greater",
        "wa",
        "iii",
        "together",
        "claim",
        "iii",
        "constitute",
        "statement",
        "called",
        "statistical",
        "htheorem",
        "thus",
        "elucidated",
        "content",
        "theorem",
        "boltzmann",
        "addressed",
        "reversibility",
        "objection",
        "suppose",
        "gas",
        "initially",
        "nonequilibrium",
        "state",
        "large",
        "value",
        "h",
        "probable",
        "certain",
        "decrease",
        "eventually",
        "reach",
        "minimum",
        "intermediate",
        "stage",
        "reverse",
        "velocity",
        "get",
        "exceptional",
        "state",
        "h",
        "increase",
        "certain",
        "time",
        "decrease",
        "existence",
        "case",
        "disprove",
        "theorem",
        "contrary",
        "theory",
        "probability",
        "show",
        "probability",
        "case",
        "mathematically",
        "zero",
        "extremely",
        "small",
        "wa",
        "iii",
        "immediately",
        "clear",
        "refutes",
        "reversibility",
        "objection",
        "focus",
        "fact",
        "reversed",
        "state",
        "exceptional",
        "take",
        "belong",
        "case",
        "regular",
        "motion",
        "explicitly",
        "barred",
        "statement",
        "theorem",
        "reply",
        "like",
        "loschmidt",
        "perhaps",
        "central",
        "idea",
        "rather",
        "reversed",
        "motion",
        "h",
        "increase",
        "short",
        "eventually",
        "decrease",
        "continue",
        "case",
        "defence",
        "like",
        "reply",
        "tait",
        "actual",
        "fact",
        "two",
        "hard",
        "combine",
        "admit",
        "reversed",
        "state",
        "exceptional",
        "sense",
        "statistical",
        "htheorem",
        "hold",
        "ground",
        "claiming",
        "eventually",
        "h",
        "decrease",
        "particular",
        "article",
        "often",
        "cited",
        "one",
        "clearest",
        "exposition",
        "boltzmann",
        "ever",
        "wrote",
        "one",
        "right",
        "money",
        "lebowitz",
        "still",
        "thing",
        "deserve",
        "attention",
        "seems",
        "boltzmann",
        "adopts",
        "implicit",
        "identification",
        "probability",
        "relative",
        "duration",
        "least",
        "indicate",
        "difference",
        "meaning",
        "phrase",
        "like",
        "greater",
        "part",
        "time",
        "h",
        "near",
        "minimum",
        "extremely",
        "probable",
        "h",
        "lie",
        "near",
        "minimum",
        "also",
        "seems",
        "claim",
        "ii",
        "peak",
        "curve",
        "rare",
        "claim",
        "iii",
        "improbable",
        "intended",
        "synonymous",
        "way",
        "reading",
        "boltzmann",
        "would",
        "indeed",
        "fall",
        "tune",
        "previous",
        "interpretation",
        "probability",
        "larger",
        "problem",
        "loom",
        "boltzmann",
        "say",
        "statistical",
        "htheorem",
        "something",
        "proved",
        "paper",
        "surely",
        "gross",
        "overstatement",
        "proof",
        "claim",
        "iii",
        "gas",
        "system",
        "found",
        "anywhere",
        "work",
        "wellknown",
        "view",
        "problem",
        "explain",
        "lacuna",
        "supplied",
        "ehrenfests",
        "essence",
        "suggest",
        "boltzmann",
        "somehow",
        "silently",
        "relied",
        "ergodic",
        "hypothesis",
        "indeed",
        "evident",
        "ergodic",
        "hypothesis",
        "hold",
        "state",
        "spend",
        "time",
        "various",
        "region",
        "phase",
        "space",
        "proportion",
        "volume",
        "say",
        "evolution",
        "system",
        "along",
        "trajectory",
        "region",
        "small",
        "volume",
        "visited",
        "sporadically",
        "region",
        "larger",
        "volume",
        "often",
        "would",
        "make",
        "plausible",
        "boltzmann",
        "could",
        "identify",
        "probability",
        "relative",
        "time",
        "also",
        "would",
        "make",
        "plausible",
        "system",
        "start",
        "small",
        "region",
        "improbable",
        "state",
        "display",
        "tendency",
        "evolve",
        "towards",
        "overwhelmingly",
        "larger",
        "equilibrium",
        "state",
        "course",
        "tendency",
        "would",
        "interpreted",
        "qualified",
        "sense",
        "ergodic",
        "hypothesis",
        "would",
        "imply",
        "system",
        "stay",
        "inside",
        "equilibrium",
        "state",
        "forever",
        "thus",
        "would",
        "indeed",
        "incessant",
        "fluctuation",
        "equilibrium",
        "indeed",
        "one",
        "would",
        "state",
        "tendency",
        "evolve",
        "improbable",
        "probable",
        "state",
        "probabilistic",
        "affair",
        "something",
        "hold",
        "true",
        "initial",
        "state",
        "time",
        "type",
        "expectation",
        "value",
        "another",
        "short",
        "would",
        "hopefully",
        "obtain",
        "statistical",
        "version",
        "htheorem",
        "exactly",
        "statistical",
        "htheorem",
        "formulated",
        "remains",
        "open",
        "problem",
        "ehrenfests",
        "point",
        "view",
        "indeed",
        "distinguish",
        "several",
        "possible",
        "statistical",
        "interpretation",
        "theorem",
        "ehrenfests",
        "reading",
        "boltzmann",
        "s",
        "intention",
        "thus",
        "undeniable",
        "advantage",
        "however",
        "evidence",
        "boltzmann",
        "really",
        "ergodic",
        "hypothesis",
        "mind",
        "seems",
        "likely",
        "relied",
        "naive",
        "identification",
        "various",
        "meaning",
        "probability",
        "nobody",
        "ever",
        "succeeded",
        "proving",
        "statistical",
        "htheorem",
        "basis",
        "ergodic",
        "hypothesis",
        "basis",
        "modern",
        "relative",
        "hypothesis",
        "metrical",
        "transitivity",
        "much",
        "stronger",
        "dynamical",
        "probabilistic",
        "condition",
        "seem",
        "needed",
        "proof",
        "even",
        "remains",
        "difficult",
        "problem",
        "whether",
        "satisfied",
        "realistic",
        "gas",
        "model"
    ]
}