{
    "main_text": "Logic || Epistemology\n3.7 Epistemology\n\nThe Stoics develop their epistemological theory as a sub-branch of\nlogic, but here, as in so many other cases, their conclusions lend\nsupport to, and draw on, doctrines in other parts of their\nphilosophical system. Readers should familiarize themselves with the\n Stoic psychological theory\n presented above.\n\nOne central task of Stoic epistemology is to provide an account of\nknowledge (epistêmê). Like Plato and Aristotle,\nthe Stoics conceive of knowledge as the paramount intellectual\nachievement available to human beings and, accordingly, place\ndemanding conditions on its possession. Knowledge, for the Stoics, is\na maximally stable and modally robust grasp of reality, in the sense\nthat if S knows that p, then not only is p\ntrue, but also S will not revise their commitment to\np in response to any degree of dialectical scrutiny that may\nbe applied to S. This requirement is registered in the Stoic\nclaim that knowledge is “secure and unchangeable by\nreason” (Stobaeus, 41H) and seems originally born out of\nreflection on the action of Plato’s Socratic dialogues: whoever\nasserts p but is led to accept not-p ­as a\nresult of elenctic cross-examination thereby reveals his own lack of\nknowledge of p (even in cases where p happens to be\ntrue) (Frede 1983).\n\nCrucially, for the Stoics, the immutability characterizing\nS’s knowledge that p does not rest on churlish\nstubbornness in S or on their unquestioning faith in\np, but rather on S’s ability to understand\nwhat makes p true and why the arguments against p,\nif ever they are presented to S, are unsound. This thesis has\ntwo significant consequences. First, to know p requires a\nmastery of a comprehensive suite of dialectical skills, including\n“irrefutability”, i.e. “strength in argument, so as\nnot to be carried away into the contradictory” (Diogenes\nLaertius, 31B), and a grasp of the canons of formal logic and Stoic\nsyllogistic, in order to distinguish valid from invalid arguments and\ndetect when the latter are offered in favor of not-p. Second,\nknowledge is essentially systematic (Stobaeus, 41H). In knowing\np, S is in a position to appreciate how p\nfits into a larger body of information, both within p’s\ndomain and in other parts of philosophical inquiry. Thus our Stoic\nsources use “knowledge” to pick out both a stable\npsychological condition and a token activity: the knowledge that\np (token activity) is only possible in a mind in which\np has been integrated and organized into a complex unified\nstructure (stable condition) (Vogt 2012, ch. 7; Brennan 2005, ch. 6).\nFor these reasons, the Stoics restrict knowledge to the Sage (Cicero,\n41A; Sextus, 41C). Only the perfected human agent genuinely knows\nanything, because only she possesses the wide-ranging argumentative\nexpertise necessary to defend what she has affirmed against any\npossible challenge, together with a grasp of the further facts that\nexplain its truth.\n\nLike virtue and happiness (see\n 4.2\n below), knowledge does not come in degrees. One’s endorsement\nof p is either maximally stable and unable to be overturned\nthrough rational means, or it is not, and virtue (as we will see) is\nitself analyzed as knowledge of what is good, bad, and neither (cf.\nStobaeus, 61D, 61H). Since virtue is necessary and sufficient for\nhappiness (Diogenes Laertius, 61A), it follows that those lacking\nknowledge will not be happy.\n\nGiven the fundamental importance of knowledge, how can it be acquired?\nAttaining knowledge is exceedingly difficult, the Stoics concede\n– not even the leaders of the school claimed to have it –\nbut, for all that, still humanly possible.\n\nHere it is useful to consider the Stoics’ three-fold distinction\nbetween knowledge (epistêmê), cognition\n(katalêpsis), and ignorance (agnoia) (on which\nChrysippus wrote four books, now lost; Diogenes Laertius, 7.201).\nWhereas knowledge is found only in the Sage, only the non-Sage is\nafflicted by ignorance (Stobaeus, 41G). Knowledge and ignorance are\nthus mutually exclusive conditions. This result also falls out of the\nStoic definition of ignorance, as “changeable and weak\nassent” (Stobaeus, 41G). The Stoics therefore divide human\nagents into two sharply disjoint categories, the knowledgeable and the\nignorant, with the overwhelming majority of us falling into the latter\ncamp. To account for the move from a condition of ignorance to a\ncondition of knowledge, Zeno introduces a mental state he calls\nkatalêpsis (translated by Long and Sedley as\n“cognition” but elsewhere as “grasp” or\n“apprehension”; in non-technical contexts the Greek word\nconnotes an act of seizing something with the hands).\n\nThe basic idea behind Zeno’s proposal is that, when S\ncognizes (= has katalêpsis of) p, S\nsuccessfully latches on to or grabs hold of a truth, because the\nrelationship between S and p ensures that p\ncannot be false: roughly, the process through which p enters\nS’s mind and the clarity and distinctness with which\np is represented are such as to guarantee p’s\ntruth. Cognition is therefore factive – there is no cognition of\nfalsehoods – but not all true judgments amount to cognition, as\nwhen, for instance, one assents to p in a state of\nhallucination or intoxication but p happens to be true\n(Sextus, 40E). Cognition, then, is a mental state characterized in the\nfirst instance by its representational fidelity to the external world\nand not – as with knowledge and ignorance – by the\ndisposition of the agent to retain or revise it under varying\ndialectical circumstances. In this sense, cognition is “placed\nbetween” knowledge and ignorance (Cicero, 41B): it is an\nintellectual achievement shared by both Sages and non-Sages (Sextus,\n41C). This entails, however, that any token cognition that p\nwill count as either knowledge or ignorance, depending on the\ncharacter of the cognizer. The Sage’s cognition that p\nis a piece of knowledge, since it is immutable and systematically\norganized in the manner described above, while the non-Sage’s is\na piece of ignorance (Cicero, 41B), since it is still insecure and\nprone to be abandoned in the face of contrary argumentative pressure\n(Plutarch, 31P; see Shogry 2022). This led the Academic skeptic\nArcesilaus to object that cognition will be an empty category and have\nno independent existence apart from knowledge and ignorance (cf.\nSextus, 41C). But the Stoics have good reasons for presenting their\ntripartite distinction as they do, because they see cognition as the\n“natural foundation” (or “starting point”:\nprincipium) for knowledge (Cicero, 41B).\n\nBeginning with Zeno, the Stoics characterize cognition\n(katalêpsis) as an assent to a special kind of\nimpression, one that functions as a criterion of truth and thus\nguarantees its own veridicality: such an impression they call\n“cognitive” (lit. “cognition-prompting”,\nkatalêptikos) (Sextus, 41C; see also PH 3.241\nand M 8.397). While some scholars simply transliterate this\nlabel as “kataleptic”, Long and Sedley’s translation\nof “cognitive”, whatever its infelicities, helpfully\nreplicates the connection, visible in the Greek, with the outcome of\nassenting to such an impression: “cognition”. (Similarly,\nwhen katalêpsis is translated as “grasp” or\n“apprehension”, we find “graspable” or\n“apprehensive” for katalêptikos; Cicero\ntranslates the two terms into Latin as comprehensio and\ncomprehendibile, respectively.) So cognition is guaranteed to\nbe true because it is analyzed as an assent to an impression that is\nitself guaranteed to be true: cognitive impressions “have a\npeculiar power of revealing their objects” (Cicero, 40B).\n\nThe existence of cognitive impressions makes cognition possible, and\nknowledge, the Stoics hold, is attained when all of one’s acts\nof assent amount to cognition: the Sage is distinguished from the\nnon-Sage in assenting exclusively to cognitive impressions.\n“Assent iff cognitive” therefore functions as a norm of\nStoic epistemology and sketches a pathway to progress from ignorance\nto knowledge. The Stoics assume that cognition, especially of\nperceptual facts, is commonplace and regularly achieved by the\nnon-Sage, and so that on these occasions there is no great obstacle to\nobeying the norm. For instance, ordinary agents regularly entertain\nand accept the cognitive impression that “it is day” when\nstanding in a sunny field at noon. But other cases present greater\nchallenges, such that the non-Sage will assent to an impression that\nfails to be cognitive and thus infect their mind with\n“opinion” (doxa) (Plutarch, 41E). By contrast,\nthe Sage is entirely free of opinion, since she withholds assent on\nany impression that is non-cognitive (Stobaeus, 41G). (Scholars\ndispute the status of opinion in Stoic epistemology, but on one\nwell-attested usage doxa is the label used specifically for\nthe non-Sage’s acts of assent to non-cognitive impressions; for\nan alternative view, on which opinion is identical to ignorance, see\nMeinwald 2005 and Vogt 2012, ch. 7.)\n\nUnsurprisingly, then, the Stoics expend no small effort explaining\nwhat distinguishes cognitive and non-cognitive impressions. Zeno\neventually settled on the following three-clause definition of the\ncognitive impression, which was retained throughout the history of the\nschool. According to the Stoics, “a cognitive impression is one\nwhich:\n\narises from what is, and\nis stamped and impressed exactly in accordance with what is,\nof such a kind as could not arise from what is not.”\n(Sextus, 40E)\n\n\nThese three clauses are construed by the Stoics as providing\nindividually-necessary and jointly-sufficient conditions for an\nimpression to be cognitive (Nawar 2014). Together, they are supposed\nto capture the feature(s) shared by all and only cognitive\nimpressions, in virtue of which they serve as criteria of truth\n(Diogenes Laertius, 40A). However, their precise interpretation\nremains highly controversial.\n\nOne longstanding dispute concerns the meaning of “what is”\nas it features in clause (1): is it to be understood\nexistentially or veridically? On the existential\ninterpretation, “what is” refers to a being or real\nobject, so that clause (1) requires the cognitive impression to be\ncaused by (“arise from”) an existing object in the\nexternal world. So construed, clause (1) rules out cases where an\nimpression is formed solely through the activity of the mind (e.g. in\na hallucinatory episode). However, this reading has been challenged on\nboth textual and philosophical grounds. Textually, the Greek phrase\ntranslated by Long and Sedley as “what is” does not use a\nform of “to be” (einai) but rather a different,\ntechnical expression: “to obtain” (huparchein).\nAccording to Stoic metaphysics (see above,\n 2.1),\n only bodies “are” or “exist”\n(einai), and so if clause (1) were intended to refer\nspecifically to external objects (bodies), we would expect a form of\neinai, not huparchein. Philosophically, the\nexistential reading implies there are only cognitive impressions of\nbodies. However, the Stoics acknowledge the possibility of cognition\nconcerning incorporeal propositions, for instance, truths about the\nnature of the gods (Diogenes Laertius, 40P), and insofar as cognition\nconsists in an assent to a cognitive impression, there should be\ncognitive impressions of these true incorporeal propositions as well.\n(On this issue, see Schwab forthcoming, and the recent exchange\nbetween Vogt 2022 and Nawar 2022.) The veridical interpretation points\nto a resolution of both these difficulties. On this reading,\n“what is” picks out a true proposition, in line with the\nStoic claim that true propositions “obtain” rather than\n“exist” (cf. Sextus, 34D) and with further evidence in\nCicero (cf. 40I and Acad. 2.112). Thus clause (1) amounts to\na veridicality requirement: all cognitive impressions must be true.\nMoreover, a veridical reading of clause (1) would also seem to allow\nfor the possibility that there are cognitive impressions of true\npropositions, though this point is controversial: see Sedley 2002 and\nNawar 2014. For an effort to rehabilitate a version of the existential\nreading, see Stojanović 2019 and Caston forthcoming.\n\nThe major debate over clause (2) turns on whether it serves to\ncharacterize the cognitive impression’s phenomenological\ncharacter, causal history, or both, and one’s stance on this\nquestion affects one’s interpretation of clause (3) in turn.\nBoth Cicero and Sextus report that clause (3) was added by Zeno to an\nearlier definition consisting just of clauses (1) and (2) (40D, E),\nand the grammar of clause (3) itself suggests it should be read as a\nfurther elucidation of clause (2). According to what has come to be\ncalled the “internalist” interpretation, clause (2)\nrequires that the cognitive impression display a unique level of\nclarity and phenomenological sharpness, which is lacking in any false\nimpression (clause (3)) (Sedley 2002). By contrast, on the\n“externalist” reading, clause (2) stipulates that the\ncognitive impression is appropriately caused, i.e. “exactly in\naccordance with” the fact it represents and not any other,\nwithout speaking to its phenomenological qualities: the causal link\nbetween the cognitive impression and its object is “of such a\nkind as” no false impression will possess (clause (3)) (Frede\n1983; for the viability of this interpretation, see the exchange\nbetween Perin 2005 and Shogry 2018). A “hybrid” view reads\nclauses (2) and (3) as stating that the cognitive impression enjoys\nmaximal phenomenological clarity because it is caused in the\nappropriate way, i.e. by the state-of-affairs it represents and no\nother (Nawar 2014; cf. Frede 1999).\n\nFrom its initial formulation by Zeno, the Stoic account of the\ncognitive impression was fiercely contested by the school’s\nskeptical opponents, provoking a centuries-long debate over its\ntenability (Annas 1990). Academic skeptics, such as Arcesilaus and\nCarneades, argued that no impression could meet all three clauses of\nZeno’s definition (40 H, J), with the result that cognition, as\nthe Stoics conceive of it, is impossible, since cognitive impressions\ndo not exist. For discussion of these Academic arguments, see the\nentries on\n Ancient Skepticism,\n Arcesilaus,\n Carneades,\n and\n Philo of Larissa.\n Sextus Empiricus presents a number of further arguments devised by\nPyrrhonian skeptics to show that cognitive impressions cannot serve as\ncriteria of truth.\n\nFor helpful comments on the relation in Stoicism between reasonable\nimpressions and cognitive impressions, see Brennan 1996 (with Diogenes\nLaertius, 40F). For articles exploring the influence of Plato’s\nTheaetetus on the development of the Stoic account of the\ncognitive impression, see Shogry 2021 and Long 2002.\n",
    "section_title": "3.7 Epistemology",
    "entry_title": "Stoicism",
    "hierarchy_title": "Stoicism || Logic || Epistemology",
    "tokenized_text": [
        "logic",
        "epistemology",
        "epistemology",
        "stoic",
        "develop",
        "epistemological",
        "theory",
        "subbranch",
        "logic",
        "many",
        "case",
        "conclusion",
        "lend",
        "support",
        "draw",
        "doctrine",
        "part",
        "philosophical",
        "system",
        "reader",
        "familiarize",
        "stoic",
        "psychological",
        "theory",
        "presented",
        "one",
        "central",
        "task",
        "stoic",
        "epistemology",
        "provide",
        "account",
        "knowledge",
        "epistêmê",
        "like",
        "plato",
        "aristotle",
        "stoic",
        "conceive",
        "knowledge",
        "paramount",
        "intellectual",
        "achievement",
        "available",
        "human",
        "being",
        "accordingly",
        "place",
        "demanding",
        "condition",
        "possession",
        "knowledge",
        "stoic",
        "maximally",
        "stable",
        "modally",
        "robust",
        "grasp",
        "reality",
        "sense",
        "know",
        "p",
        "p",
        "true",
        "also",
        "revise",
        "commitment",
        "p",
        "response",
        "degree",
        "dialectical",
        "scrutiny",
        "may",
        "applied",
        "s",
        "requirement",
        "registered",
        "stoic",
        "claim",
        "knowledge",
        "secure",
        "unchangeable",
        "reason",
        "stobaeus",
        "h",
        "seems",
        "originally",
        "born",
        "reflection",
        "action",
        "plato",
        "socratic",
        "dialogue",
        "whoever",
        "asserts",
        "p",
        "led",
        "accept",
        "notp",
        "as",
        "result",
        "elenctic",
        "crossexamination",
        "thereby",
        "reveals",
        "lack",
        "knowledge",
        "p",
        "even",
        "case",
        "p",
        "happens",
        "true",
        "frede",
        "crucially",
        "stoic",
        "immutability",
        "characterizing",
        "knowledge",
        "p",
        "rest",
        "churlish",
        "stubbornness",
        "unquestioning",
        "faith",
        "p",
        "rather",
        "ability",
        "understand",
        "make",
        "p",
        "true",
        "argument",
        "p",
        "ever",
        "presented",
        "unsound",
        "thesis",
        "two",
        "significant",
        "consequence",
        "first",
        "know",
        "p",
        "requires",
        "mastery",
        "comprehensive",
        "suite",
        "dialectical",
        "skill",
        "including",
        "irrefutability",
        "ie",
        "strength",
        "argument",
        "carried",
        "away",
        "contradictory",
        "diogenes",
        "laertius",
        "b",
        "grasp",
        "canon",
        "formal",
        "logic",
        "stoic",
        "syllogistic",
        "order",
        "distinguish",
        "valid",
        "invalid",
        "argument",
        "detect",
        "latter",
        "offered",
        "favor",
        "notp",
        "second",
        "knowledge",
        "essentially",
        "systematic",
        "stobaeus",
        "h",
        "knowing",
        "p",
        "position",
        "appreciate",
        "p",
        "fit",
        "larger",
        "body",
        "information",
        "within",
        "p",
        "domain",
        "part",
        "philosophical",
        "inquiry",
        "thus",
        "stoic",
        "source",
        "use",
        "knowledge",
        "pick",
        "stable",
        "psychological",
        "condition",
        "token",
        "activity",
        "knowledge",
        "p",
        "token",
        "activity",
        "possible",
        "mind",
        "p",
        "integrated",
        "organized",
        "complex",
        "unified",
        "structure",
        "stable",
        "condition",
        "vogt",
        "ch",
        "brennan",
        "ch",
        "reason",
        "stoic",
        "restrict",
        "knowledge",
        "sage",
        "cicero",
        "a",
        "sextus",
        "c",
        "perfected",
        "human",
        "agent",
        "genuinely",
        "know",
        "anything",
        "posse",
        "wideranging",
        "argumentative",
        "expertise",
        "necessary",
        "defend",
        "affirmed",
        "possible",
        "challenge",
        "together",
        "grasp",
        "fact",
        "explain",
        "truth",
        "like",
        "virtue",
        "happiness",
        "see",
        "knowledge",
        "come",
        "degree",
        "one",
        "endorsement",
        "p",
        "either",
        "maximally",
        "stable",
        "unable",
        "overturned",
        "rational",
        "mean",
        "virtue",
        "see",
        "analyzed",
        "knowledge",
        "good",
        "bad",
        "neither",
        "cf",
        "stobaeus",
        "d",
        "h",
        "since",
        "virtue",
        "necessary",
        "sufficient",
        "happiness",
        "diogenes",
        "laertius",
        "a",
        "follows",
        "lacking",
        "knowledge",
        "happy",
        "given",
        "fundamental",
        "importance",
        "knowledge",
        "acquired",
        "attaining",
        "knowledge",
        "exceedingly",
        "difficult",
        "stoic",
        "concede",
        "even",
        "leader",
        "school",
        "claimed",
        "still",
        "humanly",
        "possible",
        "useful",
        "consider",
        "stoic",
        "threefold",
        "distinction",
        "knowledge",
        "epistêmê",
        "cognition",
        "katalêpsis",
        "ignorance",
        "agnoia",
        "chrysippus",
        "wrote",
        "four",
        "book",
        "lost",
        "diogenes",
        "laertius",
        "whereas",
        "knowledge",
        "found",
        "sage",
        "nonsage",
        "afflicted",
        "ignorance",
        "stobaeus",
        "g",
        "knowledge",
        "ignorance",
        "thus",
        "mutually",
        "exclusive",
        "condition",
        "result",
        "also",
        "fall",
        "stoic",
        "definition",
        "ignorance",
        "changeable",
        "weak",
        "assent",
        "stobaeus",
        "g",
        "stoic",
        "therefore",
        "divide",
        "human",
        "agent",
        "two",
        "sharply",
        "disjoint",
        "category",
        "knowledgeable",
        "ignorant",
        "overwhelming",
        "majority",
        "u",
        "falling",
        "latter",
        "camp",
        "account",
        "move",
        "condition",
        "ignorance",
        "condition",
        "knowledge",
        "zeno",
        "introduces",
        "mental",
        "state",
        "call",
        "katalêpsis",
        "translated",
        "long",
        "sedley",
        "cognition",
        "elsewhere",
        "grasp",
        "apprehension",
        "nontechnical",
        "context",
        "greek",
        "word",
        "connotes",
        "act",
        "seizing",
        "something",
        "hand",
        "basic",
        "idea",
        "behind",
        "zeno",
        "proposal",
        "cognizes",
        "katalêpsis",
        "p",
        "successfully",
        "latch",
        "grab",
        "hold",
        "truth",
        "relationship",
        "p",
        "ensures",
        "p",
        "false",
        "roughly",
        "process",
        "p",
        "enters",
        "mind",
        "clarity",
        "distinctness",
        "p",
        "represented",
        "guarantee",
        "p",
        "truth",
        "cognition",
        "therefore",
        "factive",
        "cognition",
        "falsehood",
        "true",
        "judgment",
        "amount",
        "cognition",
        "instance",
        "one",
        "assent",
        "p",
        "state",
        "hallucination",
        "intoxication",
        "p",
        "happens",
        "true",
        "sextus",
        "e",
        "cognition",
        "mental",
        "state",
        "characterized",
        "first",
        "instance",
        "representational",
        "fidelity",
        "external",
        "world",
        "knowledge",
        "ignorance",
        "disposition",
        "agent",
        "retain",
        "revise",
        "varying",
        "dialectical",
        "circumstance",
        "sense",
        "cognition",
        "placed",
        "knowledge",
        "ignorance",
        "cicero",
        "b",
        "intellectual",
        "achievement",
        "shared",
        "sage",
        "nonsages",
        "sextus",
        "c",
        "entail",
        "however",
        "token",
        "cognition",
        "p",
        "count",
        "either",
        "knowledge",
        "ignorance",
        "depending",
        "character",
        "cognizer",
        "sage",
        "cognition",
        "p",
        "piece",
        "knowledge",
        "since",
        "immutable",
        "systematically",
        "organized",
        "manner",
        "described",
        "nonsage",
        "piece",
        "ignorance",
        "cicero",
        "b",
        "since",
        "still",
        "insecure",
        "prone",
        "abandoned",
        "face",
        "contrary",
        "argumentative",
        "pressure",
        "plutarch",
        "p",
        "see",
        "shogry",
        "led",
        "academic",
        "skeptic",
        "arcesilaus",
        "object",
        "cognition",
        "empty",
        "category",
        "independent",
        "existence",
        "apart",
        "knowledge",
        "ignorance",
        "cf",
        "sextus",
        "c",
        "stoic",
        "good",
        "reason",
        "presenting",
        "tripartite",
        "distinction",
        "see",
        "cognition",
        "natural",
        "foundation",
        "starting",
        "point",
        "principium",
        "knowledge",
        "cicero",
        "b",
        "beginning",
        "zeno",
        "stoic",
        "characterize",
        "cognition",
        "katalêpsis",
        "assent",
        "special",
        "kind",
        "impression",
        "one",
        "function",
        "criterion",
        "truth",
        "thus",
        "guarantee",
        "veridicality",
        "impression",
        "call",
        "cognitive",
        "lit",
        "cognitionprompting",
        "katalêptikos",
        "sextus",
        "c",
        "see",
        "also",
        "ph",
        "scholar",
        "simply",
        "transliterate",
        "label",
        "kataleptic",
        "long",
        "sedley",
        "translation",
        "cognitive",
        "whatever",
        "infelicity",
        "helpfully",
        "replicates",
        "connection",
        "visible",
        "greek",
        "outcome",
        "assenting",
        "impression",
        "cognition",
        "similarly",
        "katalêpsis",
        "translated",
        "grasp",
        "apprehension",
        "find",
        "graspable",
        "apprehensive",
        "katalêptikos",
        "cicero",
        "translates",
        "two",
        "term",
        "latin",
        "comprehensio",
        "comprehendibile",
        "respectively",
        "cognition",
        "guaranteed",
        "true",
        "analyzed",
        "assent",
        "impression",
        "guaranteed",
        "true",
        "cognitive",
        "impression",
        "peculiar",
        "power",
        "revealing",
        "object",
        "cicero",
        "b",
        "existence",
        "cognitive",
        "impression",
        "make",
        "cognition",
        "possible",
        "knowledge",
        "stoic",
        "hold",
        "attained",
        "one",
        "act",
        "assent",
        "amount",
        "cognition",
        "sage",
        "distinguished",
        "nonsage",
        "assenting",
        "exclusively",
        "cognitive",
        "impression",
        "assent",
        "iff",
        "cognitive",
        "therefore",
        "function",
        "norm",
        "stoic",
        "epistemology",
        "sketch",
        "pathway",
        "progress",
        "ignorance",
        "knowledge",
        "stoic",
        "assume",
        "cognition",
        "especially",
        "perceptual",
        "fact",
        "commonplace",
        "regularly",
        "achieved",
        "nonsage",
        "occasion",
        "great",
        "obstacle",
        "obeying",
        "norm",
        "instance",
        "ordinary",
        "agent",
        "regularly",
        "entertain",
        "accept",
        "cognitive",
        "impression",
        "day",
        "standing",
        "sunny",
        "field",
        "noon",
        "case",
        "present",
        "greater",
        "challenge",
        "nonsage",
        "assent",
        "impression",
        "fails",
        "cognitive",
        "thus",
        "infect",
        "mind",
        "opinion",
        "doxa",
        "plutarch",
        "e",
        "contrast",
        "sage",
        "entirely",
        "free",
        "opinion",
        "since",
        "withholds",
        "assent",
        "impression",
        "noncognitive",
        "stobaeus",
        "g",
        "scholar",
        "dispute",
        "status",
        "opinion",
        "stoic",
        "epistemology",
        "one",
        "wellattested",
        "usage",
        "doxa",
        "label",
        "used",
        "specifically",
        "nonsage",
        "act",
        "assent",
        "noncognitive",
        "impression",
        "alternative",
        "view",
        "opinion",
        "identical",
        "ignorance",
        "see",
        "meinwald",
        "vogt",
        "ch",
        "unsurprisingly",
        "stoic",
        "expend",
        "small",
        "effort",
        "explaining",
        "distinguishes",
        "cognitive",
        "noncognitive",
        "impression",
        "zeno",
        "eventually",
        "settled",
        "following",
        "threeclause",
        "definition",
        "cognitive",
        "impression",
        "retained",
        "throughout",
        "history",
        "school",
        "according",
        "stoic",
        "cognitive",
        "impression",
        "one",
        "arises",
        "stamped",
        "impressed",
        "exactly",
        "accordance",
        "kind",
        "could",
        "arise",
        "not",
        "sextus",
        "e",
        "three",
        "clause",
        "construed",
        "stoic",
        "providing",
        "individuallynecessary",
        "jointlysufficient",
        "condition",
        "impression",
        "cognitive",
        "nawar",
        "together",
        "supposed",
        "capture",
        "feature",
        "shared",
        "cognitive",
        "impression",
        "virtue",
        "serve",
        "criterion",
        "truth",
        "diogenes",
        "laertius",
        "a",
        "however",
        "precise",
        "interpretation",
        "remains",
        "highly",
        "controversial",
        "one",
        "longstanding",
        "dispute",
        "concern",
        "meaning",
        "feature",
        "clause",
        "understood",
        "existentially",
        "veridically",
        "existential",
        "interpretation",
        "refers",
        "real",
        "object",
        "clause",
        "requires",
        "cognitive",
        "impression",
        "caused",
        "arise",
        "existing",
        "object",
        "external",
        "world",
        "construed",
        "clause",
        "rule",
        "case",
        "impression",
        "formed",
        "solely",
        "activity",
        "mind",
        "eg",
        "hallucinatory",
        "episode",
        "however",
        "reading",
        "challenged",
        "textual",
        "philosophical",
        "ground",
        "textually",
        "greek",
        "phrase",
        "translated",
        "long",
        "sedley",
        "use",
        "form",
        "einai",
        "rather",
        "different",
        "technical",
        "expression",
        "obtain",
        "huparchein",
        "according",
        "stoic",
        "metaphysics",
        "see",
        "body",
        "exist",
        "einai",
        "clause",
        "intended",
        "refer",
        "specifically",
        "external",
        "object",
        "body",
        "would",
        "expect",
        "form",
        "einai",
        "huparchein",
        "philosophically",
        "existential",
        "reading",
        "implies",
        "cognitive",
        "impression",
        "body",
        "however",
        "stoic",
        "acknowledge",
        "possibility",
        "cognition",
        "concerning",
        "incorporeal",
        "proposition",
        "instance",
        "truth",
        "nature",
        "god",
        "diogenes",
        "laertius",
        "p",
        "insofar",
        "cognition",
        "consists",
        "assent",
        "cognitive",
        "impression",
        "cognitive",
        "impression",
        "true",
        "incorporeal",
        "proposition",
        "well",
        "issue",
        "see",
        "schwab",
        "forthcoming",
        "recent",
        "exchange",
        "vogt",
        "nawar",
        "veridical",
        "interpretation",
        "point",
        "resolution",
        "difficulty",
        "reading",
        "pick",
        "true",
        "proposition",
        "line",
        "stoic",
        "claim",
        "true",
        "proposition",
        "obtain",
        "rather",
        "exist",
        "cf",
        "sextus",
        "d",
        "evidence",
        "cicero",
        "cf",
        "i",
        "acad",
        "thus",
        "clause",
        "amount",
        "veridicality",
        "requirement",
        "cognitive",
        "impression",
        "must",
        "true",
        "moreover",
        "veridical",
        "reading",
        "clause",
        "would",
        "also",
        "seem",
        "allow",
        "possibility",
        "cognitive",
        "impression",
        "true",
        "proposition",
        "though",
        "point",
        "controversial",
        "see",
        "sedley",
        "nawar",
        "effort",
        "rehabilitate",
        "version",
        "existential",
        "reading",
        "see",
        "stojanović",
        "caston",
        "forthcoming",
        "major",
        "debate",
        "clause",
        "turn",
        "whether",
        "serf",
        "characterize",
        "cognitive",
        "impression",
        "phenomenological",
        "character",
        "causal",
        "history",
        "one",
        "stance",
        "question",
        "affect",
        "one",
        "interpretation",
        "clause",
        "turn",
        "cicero",
        "sextus",
        "report",
        "clause",
        "added",
        "zeno",
        "earlier",
        "definition",
        "consisting",
        "clause",
        "d",
        "e",
        "grammar",
        "clause",
        "suggests",
        "read",
        "elucidation",
        "clause",
        "according",
        "come",
        "called",
        "internalist",
        "interpretation",
        "clause",
        "requires",
        "cognitive",
        "impression",
        "display",
        "unique",
        "level",
        "clarity",
        "phenomenological",
        "sharpness",
        "lacking",
        "false",
        "impression",
        "clause",
        "sedley",
        "contrast",
        "externalist",
        "reading",
        "clause",
        "stipulates",
        "cognitive",
        "impression",
        "appropriately",
        "caused",
        "ie",
        "exactly",
        "accordance",
        "fact",
        "represents",
        "without",
        "speaking",
        "phenomenological",
        "quality",
        "causal",
        "link",
        "cognitive",
        "impression",
        "object",
        "kind",
        "false",
        "impression",
        "posse",
        "clause",
        "frede",
        "viability",
        "interpretation",
        "see",
        "exchange",
        "perin",
        "shogry",
        "hybrid",
        "view",
        "read",
        "clause",
        "stating",
        "cognitive",
        "impression",
        "enjoys",
        "maximal",
        "phenomenological",
        "clarity",
        "caused",
        "appropriate",
        "way",
        "ie",
        "stateofaffairs",
        "represents",
        "nawar",
        "cf",
        "frede",
        "initial",
        "formulation",
        "zeno",
        "stoic",
        "account",
        "cognitive",
        "impression",
        "fiercely",
        "contested",
        "school",
        "skeptical",
        "opponent",
        "provoking",
        "centurieslong",
        "debate",
        "tenability",
        "anna",
        "academic",
        "skeptic",
        "arcesilaus",
        "carneades",
        "argued",
        "impression",
        "could",
        "meet",
        "three",
        "clause",
        "zeno",
        "definition",
        "h",
        "j",
        "result",
        "cognition",
        "stoic",
        "conceive",
        "impossible",
        "since",
        "cognitive",
        "impression",
        "exist",
        "discussion",
        "academic",
        "argument",
        "see",
        "entry",
        "ancient",
        "skepticism",
        "arcesilaus",
        "carneades",
        "philo",
        "larissa",
        "sextus",
        "empiricus",
        "present",
        "number",
        "argument",
        "devised",
        "pyrrhonian",
        "skeptic",
        "show",
        "cognitive",
        "impression",
        "serve",
        "criterion",
        "truth",
        "helpful",
        "comment",
        "relation",
        "stoicism",
        "reasonable",
        "impression",
        "cognitive",
        "impression",
        "see",
        "brennan",
        "diogenes",
        "laertius",
        "f",
        "article",
        "exploring",
        "influence",
        "plato",
        "theaetetus",
        "development",
        "stoic",
        "account",
        "cognitive",
        "impression",
        "see",
        "shogry",
        "long"
    ]
}