{
    "main_text": "Objections to Structural Realism\n5. Objections to Structural Realism\n\nAs explained above, there are many different forms of structural\nrealism and correspondingly, many different objections have been\nlevelled against it. Obviously, ESR and OSR attract very different\nkinds of criticism, and different forms of each also face distinctive\nchallenges. Varieties of structural realism and objections to it are\nalso reviewed in Frigg and Votsis (2011). Worrall (2020) defends his\nform of structural realism against objections. Some common objections\nnot already considered above are as follows:\n\n(1)\nStructural realism collapses into standard realism.\n\n\nPsillos (1995) argues that any form of structural realism must\npresuppose a distinction between the form and content of a theory,\nand/or a distinction between our ability to know the structure and our\nability to know the nature of the world. Both these distinctions are\nillusory according to Psillos because the scientific revolution\nbanished mysterious forms and substances that might not be fully\ndescribable in structural terms. For Psillos, properties in mature\nscience are defined by the laws in which they feature, and “the\nnature and the structure of a physical entity form a continuum”\n(1995: 31). Hence, for Psillos, structural realism is either false or\ncollapses into traditional realism, echoing the response of Richard\nBraithwaite (1953: 463) to Eddington’s structuralism. Similarly,\nDavid Papineau argues that “restriction of belief to structural\nclaims is in fact no restriction at all” (Papineau 1996a: 12),\nhence structural realism gains no advantage over traditional realism\nwith the problem of theory change because it fails to make any\ndistinction between parts of theories that should and should not enjoy\nour ontological commitment. Kyle Stanford (2003b: 570) also argues\nthat we cannot distinguish the structural claims of theories from\ntheir claims about content or natures. As discussed above, the real\npatterns account and the idea of effective ontology can be used to\nreconcile structural realism with entity realism to some extent at\nleast. Clearly, structural realism must be a form of scientific\nrealism, and how distinct the positions are may be a moot point, but\nif scientific realism is not taken to involve a commitment to natural\nnecessity then it is weaker than OSR characterised in terms of\ncommitment to modal structure. Positions such as Chakravartty’s\nsemi-realism (2007) and Massimi’s Perspectival Realism (2022)\nseem to agree with OSR that science describes modal structure.\nHowever, in the former case this is understood in terms of\ndispositions or powers which is too restrictive for most ontic\nstructural realists for whom modal structure must include nomological\nstructure, symmetry, equilibrium explanation and more (see French\n2013). In the case of Perspectival Realism, modal structure is somehow\ntied to epistemic perspectives, and while real patterns are defined in\nterms of perspectives in Ladyman and Ross (2007), their notion of\nperspective is different to that of Massimi.\n\n(2)\nNot all structure is retained on theory change.\n\n\nMany people’s first response to structural realism is to point\nout that mathematical structure is often lost in theory change too\n(see, for example, Chakravartty 2004: 164; Stanford 2003b:\n570–572). If structural realism is understood as a form of\nselective realism seeking to identify what will be retained in advance\nthen this makes it hopeless. However, the structural realist is not\nclaiming that all structure is retained on theory-change, just that\nrepresent the relations among, or structure of, the phenomena in some\ndomain, and in scientific revolutions the empirical content of the old\ntheory is recovered as a limiting case of the new theory (so\nstructural realism is not a form of selective realism, see Ladyman\n2021). Post claimed there are no “Kuhn-losses”, in the\nsense of successor theories losing all or part of the well confirmed\nempirical structures of their predecessors (1971: 229). Well-confirmed\nrelations among phenomena must be retained by future theories. This\ngoes beyond mere belief in the empirical adequacy of our theories if\nwe suppose that the relations in question are genuine modal relations\nrather than extensional generalizations about actual phenomena.\nHowever, Newman (2010) argues that structuralism cannot deal with the\npessimistic meta-induction. McArthur (2011) argues that structural\nrealism eliminates both theory change in science and scientific\ndiscovery.\n\n(3)\nStructural realism is too metaphysically revisionary.\n\n\nConsiderations from physics and the history of science do not\nlogically compel us to abandon the idea of a world of distinct\nontologically subsistent individuals with intrinsic properties. The\nidentity and individuality of quantum particles could be grounded in\neach having a primitive thisness, and the same could be true of\nspacetime points. Physics does seem to tell us that certain aspects of\nsuch a world would be unknowable. The epistemic structural realist\nthinks that all we can know is structure, but it is the structure of\nan unknowable realm of individuals. An epistemic structural realist\nmay insist in a Kantian spirit that there being such objects is a\nnecessary condition for our empirical knowledge of the world. It may\nbe argued that it is impossible to conceive of relational structures\nwithout making models of them in terms of domains of individuals.\nCertainly, the structuralist faces a challenge in articulating her\nviews to contemporary philosophers schooled in modern logic and set\ntheory, which retains the classical framework of individual objects,\nand where a structure is just a particular set, namely a set of\nobjects, and a set of relations, where the latter are thought of\nextensionally as just sets of ordered pairs (or more generally\nn-tuples in the case of n-place relations), hence,\nsome structuralists favouring of category theory as noted above.\n\nPsillos (2001) argues that OSR is not “worked out” as a\nmetaphysics, and that a strong burden of proof is on those who would\nabandon traditional metaphysics (see also Chakravartty 2004 and\nMorganti 2011). McKenzie (2017) also complains in a survey of OSR that\nthe view has not been adequately articulated particularly in respect\nof the notions of individual, object and structure. The wealth of work\nreferred to above makes these charges harder to sustain now, and in\nany case it is not clear that OSR’s rivals are “worked\nout” in any sense that OSR is not. There in no general agreement\namong philosophers that any of the metaphysical theories of, say,\nuniversals is adequate, and arguably metaphysical categories inherited\nfrom the ancient Greeks, the scholastics and the early moderns are not\nappropriate for contemporary science. Naturalists argue that we should\nreject metaphysical doctrines if they are not supported by science.\nMichael Esfeld (2004: 614–616) argues against any gap between\nepistemology and metaphysics. Similarly Ladyman and Ross (2007) argue\nfor a kind of verificationism in metaphysics.\n\nA key motivation for OSR is summed up by Ernan McMullin:\n\n\n[I]maginability must not be made the test for ontology. The realist\nclaim is that the scientist is discovering the structures of the\nworld; it is not required in addition that these structures be\nimaginable in the categories of the macroworld. (1984: 14)\n\n\nHowever, of course many metaphysicians do not accept these claims.\n\n(4)\nStructuralists cannot account for causation.\n\n\nBusch (2003), Psillos (2006a) and Chakravartty (2003) all argue that\nindividual objects are central to productive rather than Humean\nconceptions of causation, and hence to any genuine explanation of\nchange. Objects are supposed to provide the “active\nprinciple” of change and causation. French (2006) replies to\nthis charge invoking the idea of of modal structure discussed above.\nStructural realists think in terms of modal structure rather than\ncausal structure to the extant that physics and other sciences\ndescribe relationships among phenomena of necessity, possibility,\npotentiality, and probability the world in ways that are not readily\nparsed in causal, dispositional or nomological terms. However, Ladyman\nand Ross (2007) argue that causation is very often the pragmatically\nindispensable proxy for modal structure in the sciences. For\ndiscussion of these issues see the “final section” of\narticles on modality and causality in structural realism in Landry and\nRickles (2012).\n\n(5)\nWithout positing knowledge of individual objects we cannot explain\nwhy certain properties and relations tend to cohere.\n\n\nThis objection is due to Chakravartty (2003) who points out that\ncertain properties tend to be found together, for example, negative\ncharge and a certain rest mass, and then asks “coincidence or\nobject?”. French (2006) replies arguing that for a structuralist\nobjects just are literally coincidences and nothing more. Once again\nthe challenge for the critic of structuralism is to show that more\nthan the minimal logical notion of an object is required, but there\nare many contexts in which this seems to be so. In response to this\nproblem, the theory of real patterns could be developed so that so\nthat triangulation among different modes of detection is required for\nontological commitment to objects as opposed to minimal real patterns,\nbut this is a subject for further work. O’Conaill (2014) argues\nthat OSR cannot account for ordinary concrete objects. Saunders (2016)\naccounts for the emergence of macroscopic objects from the quantum in\nterms of decoherence.\n\n(6)\nStructural Realism collapses the distinction between the\nmathematical and the physical.\n\n\nMany structuralists are motivated by the thought that if mathematics\ndescribes its domain only up to isomorphism, if, in other words, it\nonly describes the structure of the domain, once the scientific\ndescription of the world becomes largely mathematical, then scientific\nknowledge too becomes structural knowledge. However, it may then be\nargued that if only the structure of mathematical theories is relevant\nto ontology in mathematics, and only structural aspects of the\nmathematical formalism of physical theories are relevant to ontology\nin physics, then there is nothing to distinguish physical and\nmathematical structure. Van Fraassen argues that the heart of the\nproblem with OSR is this:\n\n\nIt must imply: what has looked like the structure of\nsomething with unknown qualitative features is actually all there\nis to nature. But with this, the contrast between structure and\nwhat is not structure has disappeared. Thus, from the point of view of\none who adopts this position, any difference between it and\n“ordinary” scientific realism also disappears. It seems\nthen that, once adopted, it is not to be called structuralism\nat all! For if there is no non-structure, there is no structure\neither. But for those who do not adopt the view, it remains startling:\nfrom an external or prior point of view, it seems to tell us that\nnature needs to be entirely re-conceived. (2006: 292–293)\n\n\nThe essence of van Fraassen’s objection here is that the\ndifference between mathematical (uninstantiated/abstract) structure,\nand physical (instantiated/concrete) structure cannot itself be\nexplained in purely structural terms. There is an analogy here with\nthe theory of universals and the problem of exemplification. A similar\ncomplaint is made by Cao (2003a,b) and discussed in his debate with\nontic structural realists. Esfeld (2013) uses this objection in the\ncontext of the interpretation of quantum mechanics to pose a dilemma\nfor ontic structural realism. Saunders (2003d) points out that there\nis no reason to think that ontic structural realists are committed to\nthe idea that the structure of the world is mathematical, just that it\nis described by it (see also French 2014). Tegmark (2008) explicitly\nembraces a Pythagorean form of OSR, but Ladyman and Ross (2007) argue\nthat no account can be given of what makes the world-structure\nphysical and not mathematical. If OSR is characterised in terms of\nmodal structure then the mathematical structure of a scientific theory\nis understood as representing the modal structure of its domain, not\nas being identical with it.\n\nThere are two main versions of mathematical structuralism: a realist\nview according to which mathematical structures exist independently of\ntheir concrete instantiations; and an eliminativist position according\nto which statements about mathematical structures are disguised\ngeneralisations about their instantiations that exemplify them (see\nShapiro 1997: 149–150.) For an excellent survey see Reck and\nPrice (2000). The most well known advocates of realist structuralism\nin the philosophy of mathematics are Parsons (1990), Resnik (1997) and\nShapiro (1997). Important critiques include Hellman (2005) and\nMacBride (2005). The relationship between ontic structural realism and\nante rem structuralism has been explored by Psillos (2006a),\nBusch (2003), French (2006), Pooley (2006), and Ladyman (2007) among\nothers. Many questions about objects versus individuals and the\nontological priority of objects, properties and relations arise in\ndiscussions of structural realism and mathematical structuralism. Beni\n(2020) argues that the Benacerraf (1965) problem is a problem for\nOSR.\n\n(7)\nStructural realism lacks a clear notion of structure.\n\n\nArenhart and Bueno (2015) argue that the notion of structure is\nunclear, and that when made precise the position becomes indefensible\nmotivating structural empiricism. Kyle Stanford (2010) argues that the\nconsilience argument of Ladyman and Ross (2007) is based on the\nconflation of different kinds of structure. Lyons (2016) argues that\nthe notion of structure deployed in structural realism becomes\nexplanatorily vacuous when confronted with the history of celestial\nmechanics.\n",
    "section_title": "5. Objections to Structural Realism",
    "entry_title": "Structural Realism",
    "hierarchy_title": "Structural Realism || Objections to Structural Realism",
    "tokenized_text": [
        "objection",
        "structural",
        "realism",
        "objection",
        "structural",
        "realism",
        "explained",
        "many",
        "different",
        "form",
        "structural",
        "realism",
        "correspondingly",
        "many",
        "different",
        "objection",
        "levelled",
        "obviously",
        "esr",
        "osr",
        "attract",
        "different",
        "kind",
        "criticism",
        "different",
        "form",
        "also",
        "face",
        "distinctive",
        "challenge",
        "variety",
        "structural",
        "realism",
        "objection",
        "also",
        "reviewed",
        "frigg",
        "votsis",
        "worrall",
        "defends",
        "form",
        "structural",
        "realism",
        "objection",
        "common",
        "objection",
        "already",
        "considered",
        "follows",
        "structural",
        "realism",
        "collapse",
        "standard",
        "realism",
        "psillos",
        "argues",
        "form",
        "structural",
        "realism",
        "must",
        "presuppose",
        "distinction",
        "form",
        "content",
        "theory",
        "andor",
        "distinction",
        "ability",
        "know",
        "structure",
        "ability",
        "know",
        "nature",
        "world",
        "distinction",
        "illusory",
        "according",
        "psillos",
        "scientific",
        "revolution",
        "banished",
        "mysterious",
        "form",
        "substance",
        "might",
        "fully",
        "describable",
        "structural",
        "term",
        "psillos",
        "property",
        "mature",
        "science",
        "defined",
        "law",
        "feature",
        "nature",
        "structure",
        "physical",
        "entity",
        "form",
        "continuum",
        "hence",
        "psillos",
        "structural",
        "realism",
        "either",
        "false",
        "collapse",
        "traditional",
        "realism",
        "echoing",
        "response",
        "richard",
        "braithwaite",
        "eddington",
        "structuralism",
        "similarly",
        "david",
        "papineau",
        "argues",
        "restriction",
        "belief",
        "structural",
        "claim",
        "fact",
        "restriction",
        "papineau",
        "a",
        "hence",
        "structural",
        "realism",
        "gain",
        "advantage",
        "traditional",
        "realism",
        "problem",
        "theory",
        "change",
        "fails",
        "make",
        "distinction",
        "part",
        "theory",
        "enjoy",
        "ontological",
        "commitment",
        "kyle",
        "stanford",
        "b",
        "also",
        "argues",
        "distinguish",
        "structural",
        "claim",
        "theory",
        "claim",
        "content",
        "nature",
        "discussed",
        "real",
        "pattern",
        "account",
        "idea",
        "effective",
        "ontology",
        "used",
        "reconcile",
        "structural",
        "realism",
        "entity",
        "realism",
        "extent",
        "least",
        "clearly",
        "structural",
        "realism",
        "must",
        "form",
        "scientific",
        "realism",
        "distinct",
        "position",
        "may",
        "moot",
        "point",
        "scientific",
        "realism",
        "taken",
        "involve",
        "commitment",
        "natural",
        "necessity",
        "weaker",
        "osr",
        "characterised",
        "term",
        "commitment",
        "modal",
        "structure",
        "position",
        "chakravartty",
        "semirealism",
        "massimi",
        "perspectival",
        "realism",
        "seem",
        "agree",
        "osr",
        "science",
        "describes",
        "modal",
        "structure",
        "however",
        "former",
        "case",
        "understood",
        "term",
        "disposition",
        "power",
        "restrictive",
        "ontic",
        "structural",
        "realist",
        "modal",
        "structure",
        "must",
        "include",
        "nomological",
        "structure",
        "symmetry",
        "equilibrium",
        "explanation",
        "see",
        "french",
        "case",
        "perspectival",
        "realism",
        "modal",
        "structure",
        "somehow",
        "tied",
        "epistemic",
        "perspective",
        "real",
        "pattern",
        "defined",
        "term",
        "perspective",
        "ladyman",
        "ross",
        "notion",
        "perspective",
        "different",
        "massimi",
        "structure",
        "retained",
        "theory",
        "change",
        "many",
        "people",
        "first",
        "response",
        "structural",
        "realism",
        "point",
        "mathematical",
        "structure",
        "often",
        "lost",
        "theory",
        "change",
        "see",
        "example",
        "chakravartty",
        "stanford",
        "b",
        "structural",
        "realism",
        "understood",
        "form",
        "selective",
        "realism",
        "seeking",
        "identify",
        "retained",
        "advance",
        "make",
        "hopeless",
        "however",
        "structural",
        "realist",
        "claiming",
        "structure",
        "retained",
        "theorychange",
        "represent",
        "relation",
        "among",
        "structure",
        "phenomenon",
        "domain",
        "scientific",
        "revolution",
        "empirical",
        "content",
        "old",
        "theory",
        "recovered",
        "limiting",
        "case",
        "new",
        "theory",
        "structural",
        "realism",
        "form",
        "selective",
        "realism",
        "see",
        "ladyman",
        "post",
        "claimed",
        "kuhnlosses",
        "sense",
        "successor",
        "theory",
        "losing",
        "part",
        "well",
        "confirmed",
        "empirical",
        "structure",
        "predecessor",
        "wellconfirmed",
        "relation",
        "among",
        "phenomenon",
        "must",
        "retained",
        "future",
        "theory",
        "go",
        "beyond",
        "mere",
        "belief",
        "empirical",
        "adequacy",
        "theory",
        "suppose",
        "relation",
        "question",
        "genuine",
        "modal",
        "relation",
        "rather",
        "extensional",
        "generalization",
        "actual",
        "phenomenon",
        "however",
        "newman",
        "argues",
        "structuralism",
        "deal",
        "pessimistic",
        "metainduction",
        "mcarthur",
        "argues",
        "structural",
        "realism",
        "eliminates",
        "theory",
        "change",
        "science",
        "scientific",
        "discovery",
        "structural",
        "realism",
        "metaphysically",
        "revisionary",
        "consideration",
        "physic",
        "history",
        "science",
        "logically",
        "compel",
        "u",
        "abandon",
        "idea",
        "world",
        "distinct",
        "ontologically",
        "subsistent",
        "individual",
        "intrinsic",
        "property",
        "identity",
        "individuality",
        "quantum",
        "particle",
        "could",
        "grounded",
        "primitive",
        "thisness",
        "could",
        "true",
        "spacetime",
        "point",
        "physic",
        "seem",
        "tell",
        "u",
        "certain",
        "aspect",
        "world",
        "would",
        "unknowable",
        "epistemic",
        "structural",
        "realist",
        "think",
        "know",
        "structure",
        "structure",
        "unknowable",
        "realm",
        "individual",
        "epistemic",
        "structural",
        "realist",
        "may",
        "insist",
        "kantian",
        "spirit",
        "object",
        "necessary",
        "condition",
        "empirical",
        "knowledge",
        "world",
        "may",
        "argued",
        "impossible",
        "conceive",
        "relational",
        "structure",
        "without",
        "making",
        "model",
        "term",
        "domain",
        "individual",
        "certainly",
        "structuralist",
        "face",
        "challenge",
        "articulating",
        "view",
        "contemporary",
        "philosopher",
        "schooled",
        "modern",
        "logic",
        "set",
        "theory",
        "retains",
        "classical",
        "framework",
        "individual",
        "object",
        "structure",
        "particular",
        "set",
        "namely",
        "set",
        "object",
        "set",
        "relation",
        "latter",
        "thought",
        "extensionally",
        "set",
        "ordered",
        "pair",
        "generally",
        "ntuples",
        "case",
        "nplace",
        "relation",
        "hence",
        "structuralists",
        "favouring",
        "category",
        "theory",
        "noted",
        "psillos",
        "argues",
        "osr",
        "worked",
        "metaphysics",
        "strong",
        "burden",
        "proof",
        "would",
        "abandon",
        "traditional",
        "metaphysics",
        "see",
        "also",
        "chakravartty",
        "morganti",
        "mckenzie",
        "also",
        "complains",
        "survey",
        "osr",
        "view",
        "adequately",
        "articulated",
        "particularly",
        "respect",
        "notion",
        "individual",
        "object",
        "structure",
        "wealth",
        "work",
        "referred",
        "make",
        "charge",
        "harder",
        "sustain",
        "case",
        "clear",
        "osr",
        "rival",
        "worked",
        "sense",
        "osr",
        "general",
        "agreement",
        "among",
        "philosopher",
        "metaphysical",
        "theory",
        "say",
        "universal",
        "adequate",
        "arguably",
        "metaphysical",
        "category",
        "inherited",
        "ancient",
        "greek",
        "scholastic",
        "early",
        "modern",
        "appropriate",
        "contemporary",
        "science",
        "naturalist",
        "argue",
        "reject",
        "metaphysical",
        "doctrine",
        "supported",
        "science",
        "michael",
        "esfeld",
        "argues",
        "gap",
        "epistemology",
        "metaphysics",
        "similarly",
        "ladyman",
        "ross",
        "argue",
        "kind",
        "verificationism",
        "metaphysics",
        "key",
        "motivation",
        "osr",
        "summed",
        "ernan",
        "mcmullin",
        "maginability",
        "must",
        "made",
        "test",
        "ontology",
        "realist",
        "claim",
        "scientist",
        "discovering",
        "structure",
        "world",
        "required",
        "addition",
        "structure",
        "imaginable",
        "category",
        "macroworld",
        "however",
        "course",
        "many",
        "metaphysicians",
        "accept",
        "claim",
        "structuralists",
        "account",
        "causation",
        "busch",
        "psillos",
        "a",
        "chakravartty",
        "argue",
        "individual",
        "object",
        "central",
        "productive",
        "rather",
        "humean",
        "conception",
        "causation",
        "hence",
        "genuine",
        "explanation",
        "change",
        "object",
        "supposed",
        "provide",
        "active",
        "principle",
        "change",
        "causation",
        "french",
        "reply",
        "charge",
        "invoking",
        "idea",
        "modal",
        "structure",
        "discussed",
        "structural",
        "realist",
        "think",
        "term",
        "modal",
        "structure",
        "rather",
        "causal",
        "structure",
        "extant",
        "physic",
        "science",
        "describe",
        "relationship",
        "among",
        "phenomenon",
        "necessity",
        "possibility",
        "potentiality",
        "probability",
        "world",
        "way",
        "readily",
        "parsed",
        "causal",
        "dispositional",
        "nomological",
        "term",
        "however",
        "ladyman",
        "ross",
        "argue",
        "causation",
        "often",
        "pragmatically",
        "indispensable",
        "proxy",
        "modal",
        "structure",
        "science",
        "discussion",
        "issue",
        "see",
        "final",
        "section",
        "article",
        "modality",
        "causality",
        "structural",
        "realism",
        "landry",
        "rickles",
        "without",
        "positing",
        "knowledge",
        "individual",
        "object",
        "explain",
        "certain",
        "property",
        "relation",
        "tend",
        "cohere",
        "objection",
        "due",
        "chakravartty",
        "point",
        "certain",
        "property",
        "tend",
        "found",
        "together",
        "example",
        "negative",
        "charge",
        "certain",
        "rest",
        "mass",
        "asks",
        "coincidence",
        "object",
        "french",
        "reply",
        "arguing",
        "structuralist",
        "object",
        "literally",
        "coincidence",
        "nothing",
        "challenge",
        "critic",
        "structuralism",
        "show",
        "minimal",
        "logical",
        "notion",
        "object",
        "required",
        "many",
        "context",
        "seems",
        "response",
        "problem",
        "theory",
        "real",
        "pattern",
        "could",
        "developed",
        "triangulation",
        "among",
        "different",
        "mode",
        "detection",
        "required",
        "ontological",
        "commitment",
        "object",
        "opposed",
        "minimal",
        "real",
        "pattern",
        "subject",
        "work",
        "conaill",
        "argues",
        "osr",
        "account",
        "ordinary",
        "concrete",
        "object",
        "saunders",
        "account",
        "emergence",
        "macroscopic",
        "object",
        "quantum",
        "term",
        "decoherence",
        "structural",
        "realism",
        "collapse",
        "distinction",
        "mathematical",
        "physical",
        "many",
        "structuralists",
        "motivated",
        "thought",
        "mathematics",
        "describes",
        "domain",
        "isomorphism",
        "word",
        "describes",
        "structure",
        "domain",
        "scientific",
        "description",
        "world",
        "becomes",
        "largely",
        "mathematical",
        "scientific",
        "knowledge",
        "becomes",
        "structural",
        "knowledge",
        "however",
        "may",
        "argued",
        "structure",
        "mathematical",
        "theory",
        "relevant",
        "ontology",
        "mathematics",
        "structural",
        "aspect",
        "mathematical",
        "formalism",
        "physical",
        "theory",
        "relevant",
        "ontology",
        "physic",
        "nothing",
        "distinguish",
        "physical",
        "mathematical",
        "structure",
        "van",
        "fraassen",
        "argues",
        "heart",
        "problem",
        "osr",
        "must",
        "imply",
        "looked",
        "like",
        "structure",
        "something",
        "unknown",
        "qualitative",
        "feature",
        "actually",
        "nature",
        "contrast",
        "structure",
        "structure",
        "disappeared",
        "thus",
        "point",
        "view",
        "one",
        "adopts",
        "position",
        "difference",
        "ordinary",
        "scientific",
        "realism",
        "also",
        "disappears",
        "seems",
        "adopted",
        "called",
        "structuralism",
        "nonstructure",
        "structure",
        "either",
        "adopt",
        "view",
        "remains",
        "startling",
        "external",
        "prior",
        "point",
        "view",
        "seems",
        "tell",
        "u",
        "nature",
        "need",
        "entirely",
        "reconceived",
        "essence",
        "van",
        "fraassen",
        "objection",
        "difference",
        "mathematical",
        "uninstantiatedabstract",
        "structure",
        "physical",
        "instantiatedconcrete",
        "structure",
        "explained",
        "purely",
        "structural",
        "term",
        "analogy",
        "theory",
        "universal",
        "problem",
        "exemplification",
        "similar",
        "complaint",
        "made",
        "cao",
        "a",
        "b",
        "discussed",
        "debate",
        "ontic",
        "structural",
        "realist",
        "esfeld",
        "us",
        "objection",
        "context",
        "interpretation",
        "quantum",
        "mechanic",
        "pose",
        "dilemma",
        "ontic",
        "structural",
        "realism",
        "saunders",
        "d",
        "point",
        "reason",
        "think",
        "ontic",
        "structural",
        "realist",
        "committed",
        "idea",
        "structure",
        "world",
        "mathematical",
        "described",
        "see",
        "also",
        "french",
        "tegmark",
        "explicitly",
        "embrace",
        "pythagorean",
        "form",
        "osr",
        "ladyman",
        "ross",
        "argue",
        "account",
        "given",
        "make",
        "worldstructure",
        "physical",
        "mathematical",
        "osr",
        "characterised",
        "term",
        "modal",
        "structure",
        "mathematical",
        "structure",
        "scientific",
        "theory",
        "understood",
        "representing",
        "modal",
        "structure",
        "domain",
        "identical",
        "two",
        "main",
        "version",
        "mathematical",
        "structuralism",
        "realist",
        "view",
        "according",
        "mathematical",
        "structure",
        "exist",
        "independently",
        "concrete",
        "instantiation",
        "eliminativist",
        "position",
        "according",
        "statement",
        "mathematical",
        "structure",
        "disguised",
        "generalisation",
        "instantiation",
        "exemplify",
        "see",
        "shapiro",
        "excellent",
        "survey",
        "see",
        "reck",
        "price",
        "well",
        "known",
        "advocate",
        "realist",
        "structuralism",
        "philosophy",
        "mathematics",
        "parson",
        "resnik",
        "shapiro",
        "important",
        "critique",
        "include",
        "hellman",
        "macbride",
        "relationship",
        "ontic",
        "structural",
        "realism",
        "ante",
        "rem",
        "structuralism",
        "explored",
        "psillos",
        "a",
        "busch",
        "french",
        "pooley",
        "ladyman",
        "among",
        "others",
        "many",
        "question",
        "object",
        "versus",
        "individual",
        "ontological",
        "priority",
        "object",
        "property",
        "relation",
        "arise",
        "discussion",
        "structural",
        "realism",
        "mathematical",
        "structuralism",
        "beni",
        "argues",
        "benacerraf",
        "problem",
        "problem",
        "osr",
        "structural",
        "realism",
        "lack",
        "clear",
        "notion",
        "structure",
        "arenhart",
        "bueno",
        "argue",
        "notion",
        "structure",
        "unclear",
        "made",
        "precise",
        "position",
        "becomes",
        "indefensible",
        "motivating",
        "structural",
        "empiricism",
        "kyle",
        "stanford",
        "argues",
        "consilience",
        "argument",
        "ladyman",
        "ross",
        "based",
        "conflation",
        "different",
        "kind",
        "structure",
        "lyon",
        "argues",
        "notion",
        "structure",
        "deployed",
        "structural",
        "realism",
        "becomes",
        "explanatorily",
        "vacuous",
        "confronted",
        "history",
        "celestial",
        "mechanic"
    ]
}