{
    "main_text": "Epistemic Structural Realism (ESR) || ESR and Ramsey Sentences\n3.2 ESR and Ramsey Sentences\n\nA position called structural realism, that amounts to an\nepistemological gloss on traditional scientific realism, was advocated\nby Grover Maxwell (1962, 1968 [1972], 1970a, 1970b). Maxwell wanted to\nmake scientific realism compatible with “concept\nempiricism” about the meaning of theoretical terms, and he also\nwanted to explain how we can have epistemic access to unobservable\nentities. The problem as Maxwell saw it was that theories talk about\nall sorts of entities and processes with which we are not\n“acquainted”. How, he wondered, can we then know about and\nrefer to them and their properties? The answer that he gave, following\nRussell, was that we can know about them by description, that is we\ncan know them via their structural properties. In fact, he argues,\nthis is the limit of our knowledge of them, and the meanings of\ntheoretical terms are to be understood purely structurally. The way\nthat Maxwell explicates the idea that the structure of the theory\nexhausts the cognitive content of its theoretical terms, is to\nconsider the Ramsey sentence of the theory (Ramsey [1929] 1931).\nRamsey’s method allows the elimination of theoretical terms from\na theory by replacing them with existentially quantified predicate\nvariables (or names in the case of the influential D. Lewis 1970). If\none replaces the conjunction of assertions of a first-order theory\nwith its Ramsey sentence, the observational consequences of the theory\nare carried over, but direct reference to unobservables is\neliminated.\n\nIf we formalise a theory in a first-order language: \n\\[\\Pi(O_1,\\ldots,O_n; T_1,\\ldots,T_m),\\]\n\n\nwhere the Os are the observational terms and the Ts\nare the theoretical terms, then the corresponding Ramsey sentence\nis \n\\[\\exists t_1,\\ldots,t_m \\Pi(O_1,\\ldots,O_n;t_1,\\ldots,t_m).\\]\n\n\nThus the Ramsey sentence only asserts that there are some objects,\nproperties and relations that have certain logical features,\nsatisfying certain implicit definitions. It is a higher-order\ndescription, but ultimately connects the theoretical content of the\ntheory with observable behaviour. However, it is a mistake to think\nthat the Ramsey sentence allows us to eliminate theoretical entities,\nfor it still states that these exist. It is just that they are\nreferred to not directly, by means of theoretical terms, but by\ndescription, that is via variables, connectives, quantifiers and\npredicate terms whose direct referents are (allegedly) known by\nacquaintance. Thus Maxwell (and Russell) claimed that knowledge of the\nunobservable realm is limited to knowledge of its structural rather\nthan intrinsic properties, or, as is sometimes said, limited to\nknowledge of its higher-order properties. It is arguable that this is\nthe purest structuralism possible, for the notion of structure\nemployed refers to the higher-order properties of a theory, those that\nare only expressible in purely formal terms.\n\nThis is an epistemological structural realism meant to vindicate and\nnot to revise the ontological commitments of scientific realism. On\nthis view the objective world is composed of unobservable objects\nbetween which certain properties and relations obtain; but we can only\nknow the properties and relations of these properties and relations,\nthat is, the structure of the objective world. However, there are\nserious difficulties with this view which were originally raised by M.\nH. A. Newman in 1928 and which have been recently discussed by\nDemopoulos and Friedman (1985 [1989]). The basic problem is that\nstructure is not sufficient to uniquely pick out any relations in the\nworld. Suppose that the world consists of a set of objects whose\nstructure is W with respect to some relation R,\nabout which nothing else is known. Any collection of things can be\nregarded as having structure W provided there is the right\nnumber of them. This is because according to the extensional\ncharacterisation of relations defined on a domain of individuals,\nevery relation is identified with some set of subsets of the domain.\nThe power set axiom entails the existence of every such subset and\nhence every such relation.\n\nAs Demopoulos and Friedman point out, if ∏ is consistent, and if\nall its purely observational consequences are true, then the truth of\nthe corresponding Ramsey sentence follows as a theorem of second-order\nlogic or set theory (provided the initial domain has the right\ncardinality—and if it does not then consistency implies that\nthere exists one that does). The formal structure of a relation can\neasily be obtained with any collection of objects provided there are\nenough of them, so having the formal structure cannot single out a\nunique referent for this relation; in order to do so we must stipulate\nthat we are talking about the intended relation, which is to go beyond\nthe structural description. “Thus on this view, only cardinality\nquestions are open to discovery!” (1985: 627 [1989: 188]);\neverything else will be known a priori.\n\nThis leads Demopoulos and Friedman to conclude that reducing a theory\nto its Ramsey sentence is equivalent to reducing it to its empirical\nconsequences, and thus that:\n\n\nRussell’s realism collapses into a version of phenomenalism or\nstrict empiricism after all: all theories with the same observational\nconsequences will be equally true. (1985: 635 [1989: 195])\n\n\nSimilarly, Jane English (1973) argued, though on the basis of\ndifferent considerations, that any two Ramsey sentences that are\nincompatible with one another cannot have all their observational\nconsequences in common. Hence it seems that if we treat a theory just\nas its Ramsey sentence then the notion of theoretical equivalence\ncollapses onto that of empirical equivalence. (Demopoulos 2003 argues\nthat similar considerations show that structural empiricism also\ncollapses truth to empirical adequacy; he also discusses the\nrelationship between Newman’s problem and Putnam’s\nParadox. Votsis (2003) argues that the conclusion of the Newman\nargument doesn’t undermine ESR after all. Gordon Solomon (1989)\ndefends Richard Braithwaite’s claim that Eddington’s\nstructuralism (see\n §4.1\n below) is vulnerable to Newman’s argument.)\n\nJeffery Ketland (2004) argues in detail that the Newman objection\ntrivialises the Ramsey sentence formulation of ESR. Worrall and Zahar\n(2001) argue that the cognitive content of a theory is exhausted by\nits Ramsey sentences but that, while the Ramsey sentence only\nexpresses the empirical content of the theory, the notion of empirical\ncontent in play here is sufficient for a form of realism. In his 2007\npaper, Worrall sets out an account and defense of epistemic structural\nrealism and responds to objections that have been raised to it,\nincluding the Newman problem. Cruse (2005) and Melia and Saatsi (2006)\ndefend the Ramsey sentence approach against model-theoretic arguments\nby questioning the assumption that all predicates which apply to\nunobservables must be eliminated in favour of bound variables. Mixed\npredicates such as “extended” are those that apply to both\nobservable and unobservable objects. The Newman objection does not go\nthrough if mixed predicates are not Ramsified, because a model of the\nRamsey sentence will not necessarily be one in which what is claimed\nregarding the mixed properties and relations holds. In response,\nDemopoulos (2011) points out that the Ramsey sentence of a theory with\nmixed predicates where the latter are not Ramsified will be true\nprovided the original theory is satisfied—hence the claim that\nthe content of the Ramsey sentence is merely the observational content\nof the original theory plus a cardinality claim is still true when\nmixed predicates are considered. Melia and Saatsi (2006) also argue\nthat intensional notions, such as naturalness and causal significance,\nmay be applied to properties to save the Ramsey sentence formulation\nof ESR from triviality. (This recalls the defence of Russell’s\nstructuralism against Newman discussed in Hochberg 1994.) Demopoulos\nalso raises two problems with this strategy: firstly, even non-natural\nrelations can have significant claims made about them in a theory, and\nsecondly, the cognitive significance of unramsified theories is\nindependent of a commitment to “real” or\n“natural” relations. Hence, Demopoulos insists that the\nRamsey sentence of a theory and the theory itself are importantly\ndifferent (see also Psillos 2006b). Peter Ainsworth (2009) gives an\naccessible account of the Newman problem and the responses that have\nbeen given to it. Ladyman (1998) and Ladyman and Ross (2007) argue\nthat the Newman problem does not arise for ontic structural realism\nbecause it eschews an extensional understanding of relations.\n\nIn his 2011 paper, Demopoulos argues that there are three very\ndifferent views in the work of Russell, Ramsey, and Carnap\nrespectively, which have in common versions of a core structuralist\nthesis that he identifies. All the accounts he considers make use of\nRamsey sentences; Demopoulos investigates the logical properties of\nthe Ramsey sentence and arrives at an argument against the\nstructuralist thesis. Friedman (2011) argues that Carnap’s\naccount of theoretical terms involving the Ramsey sentence approach is\nnot vulnerable to the Newman problem. The relationship between\nFriedman’s views on the relativized a priori and\nstructural realism is interrogated in Ivanova (2011).\n\nStructural realism is supposed to help with the problem of theory\nchange. As Maxwell himself pointed out, his structural realism is a\npurely semantic and epistemological theory. The Ramsey sentence picks\nout exactly the same entities as the original theory. It does not\ndispense with reference, but it makes that reference a function of the\n(place of the theoretical terms in the) overall structure of the\ntheory, as manifested in the Ramsey sentence. Hence, Ladyman (1998)\nargues that in general epistemological forms of structural realism do\nnot significantly improve the prospects of standard scientific realism\nand that structural realism should be thought of as metaphysically\nrather than merely epistemically revisionary. The problem of\nontological discontinuity is arguably left untouched by simply\nadopting Ramsification. In fact, it seems even worse if contextualism\nabout the meaning of theoretical terms is adopted. Cei and French\n(2006) and Cruse (2005) also argue, on different grounds, that\nRamsification is of no help to the structural realist.\n\nVersions of ESR that employ the Ramsey sentence of a theory and the\ndistinction between observational and theoretical terms are embedded\nin the so-called “syntactic” view of theories that adopts\nfirst-order quantificational logic as the appropriate form for the\nrepresentation of physical theories. According to Zahar (1996: 14) the\ncontinuity in science is in the intension rather than the extension of\nits concepts. He argues that if we believe that the mathematical\nstructure of theories is fundamentally important for ontology, then we\nneed a semantics for theories that addresses the representative role\nof mathematics directly. Such an account of scientific representation\nis allegedly found in the so-called “semantic” or\n“model-theoretic” approach associated primarily with\nPatrick Suppes, Fred Suppe, Ron Giere and Bas van Fraassen, and more\nrecently da Costa and French (2003). The relationship between\nstructuralism and the semantic view is discussed by van Fraassen\n(1997, 2008), and Thomson-Jones (2011). Chris Pincock (2011)\ncriticises structural realism on the basis of an analysis of the role\nof mathematics in scientific representation. See also Beni (2019) for\nthe development of a form of structural realism together with an\naccount of representation in general. Wallace (2022) argues that the\nmathematics-first view of scientific representation of the semantic\nview leads naturally to ontic structural realism.\n",
    "section_title": "3.2 ESR and Ramsey Sentences",
    "entry_title": "Structural Realism",
    "hierarchy_title": "Structural Realism || Epistemic Structural Realism (ESR) || ESR and Ramsey Sentences",
    "tokenized_text": [
        "epistemic",
        "structural",
        "realism",
        "esr",
        "esr",
        "ramsey",
        "sentence",
        "esr",
        "ramsey",
        "sentence",
        "position",
        "called",
        "structural",
        "realism",
        "amount",
        "epistemological",
        "gloss",
        "traditional",
        "scientific",
        "realism",
        "advocated",
        "grover",
        "maxwell",
        "a",
        "b",
        "maxwell",
        "wanted",
        "make",
        "scientific",
        "realism",
        "compatible",
        "concept",
        "empiricism",
        "meaning",
        "theoretical",
        "term",
        "also",
        "wanted",
        "explain",
        "epistemic",
        "access",
        "unobservable",
        "entity",
        "problem",
        "maxwell",
        "saw",
        "theory",
        "talk",
        "sort",
        "entity",
        "process",
        "acquainted",
        "wondered",
        "know",
        "refer",
        "property",
        "answer",
        "gave",
        "following",
        "russell",
        "know",
        "description",
        "know",
        "via",
        "structural",
        "property",
        "fact",
        "argues",
        "limit",
        "knowledge",
        "meaning",
        "theoretical",
        "term",
        "understood",
        "purely",
        "structurally",
        "way",
        "maxwell",
        "explicates",
        "idea",
        "structure",
        "theory",
        "exhaust",
        "cognitive",
        "content",
        "theoretical",
        "term",
        "consider",
        "ramsey",
        "sentence",
        "theory",
        "ramsey",
        "ramsey",
        "method",
        "allows",
        "elimination",
        "theoretical",
        "term",
        "theory",
        "replacing",
        "existentially",
        "quantified",
        "predicate",
        "variable",
        "name",
        "case",
        "influential",
        "d",
        "lewis",
        "one",
        "replaces",
        "conjunction",
        "assertion",
        "firstorder",
        "theory",
        "ramsey",
        "sentence",
        "observational",
        "consequence",
        "theory",
        "carried",
        "direct",
        "reference",
        "unobservables",
        "eliminated",
        "formalise",
        "theory",
        "firstorder",
        "language",
        "pi",
        "o_",
        "ldots",
        "o_n",
        "t_",
        "ldots",
        "t_m",
        "o",
        "observational",
        "term",
        "t",
        "theoretical",
        "term",
        "corresponding",
        "ramsey",
        "sentence",
        "exists",
        "t_",
        "ldots",
        "t_m",
        "pi",
        "o_",
        "ldots",
        "o_n",
        "t_",
        "ldots",
        "t_m",
        "thus",
        "ramsey",
        "sentence",
        "asserts",
        "object",
        "property",
        "relation",
        "certain",
        "logical",
        "feature",
        "satisfying",
        "certain",
        "implicit",
        "definition",
        "higherorder",
        "description",
        "ultimately",
        "connects",
        "theoretical",
        "content",
        "theory",
        "observable",
        "behaviour",
        "however",
        "mistake",
        "think",
        "ramsey",
        "sentence",
        "allows",
        "u",
        "eliminate",
        "theoretical",
        "entity",
        "still",
        "state",
        "exist",
        "referred",
        "directly",
        "mean",
        "theoretical",
        "term",
        "description",
        "via",
        "variable",
        "connective",
        "quantifier",
        "predicate",
        "term",
        "whose",
        "direct",
        "referent",
        "allegedly",
        "known",
        "acquaintance",
        "thus",
        "maxwell",
        "russell",
        "claimed",
        "knowledge",
        "unobservable",
        "realm",
        "limited",
        "knowledge",
        "structural",
        "rather",
        "intrinsic",
        "property",
        "sometimes",
        "said",
        "limited",
        "knowledge",
        "higherorder",
        "property",
        "arguable",
        "purest",
        "structuralism",
        "possible",
        "notion",
        "structure",
        "employed",
        "refers",
        "higherorder",
        "property",
        "theory",
        "expressible",
        "purely",
        "formal",
        "term",
        "epistemological",
        "structural",
        "realism",
        "meant",
        "vindicate",
        "revise",
        "ontological",
        "commitment",
        "scientific",
        "realism",
        "view",
        "objective",
        "world",
        "composed",
        "unobservable",
        "object",
        "certain",
        "property",
        "relation",
        "obtain",
        "know",
        "property",
        "relation",
        "property",
        "relation",
        "structure",
        "objective",
        "world",
        "however",
        "serious",
        "difficulty",
        "view",
        "originally",
        "raised",
        "m",
        "h",
        "a",
        "newman",
        "recently",
        "discussed",
        "demopoulos",
        "friedman",
        "basic",
        "problem",
        "structure",
        "sufficient",
        "uniquely",
        "pick",
        "relation",
        "world",
        "suppose",
        "world",
        "consists",
        "set",
        "object",
        "whose",
        "structure",
        "w",
        "respect",
        "relation",
        "r",
        "nothing",
        "else",
        "known",
        "collection",
        "thing",
        "regarded",
        "structure",
        "w",
        "provided",
        "right",
        "number",
        "according",
        "extensional",
        "characterisation",
        "relation",
        "defined",
        "domain",
        "individual",
        "every",
        "relation",
        "identified",
        "set",
        "subset",
        "domain",
        "power",
        "set",
        "axiom",
        "entail",
        "existence",
        "every",
        "subset",
        "hence",
        "every",
        "relation",
        "demopoulos",
        "friedman",
        "point",
        "consistent",
        "purely",
        "observational",
        "consequence",
        "true",
        "truth",
        "corresponding",
        "ramsey",
        "sentence",
        "follows",
        "theorem",
        "secondorder",
        "logic",
        "set",
        "theory",
        "provided",
        "initial",
        "domain",
        "right",
        "cardinalityand",
        "consistency",
        "implies",
        "exists",
        "one",
        "formal",
        "structure",
        "relation",
        "easily",
        "obtained",
        "collection",
        "object",
        "provided",
        "enough",
        "formal",
        "structure",
        "single",
        "unique",
        "referent",
        "relation",
        "order",
        "must",
        "stipulate",
        "talking",
        "intended",
        "relation",
        "go",
        "beyond",
        "structural",
        "description",
        "thus",
        "view",
        "cardinality",
        "question",
        "open",
        "discovery",
        "everything",
        "else",
        "known",
        "priori",
        "lead",
        "demopoulos",
        "friedman",
        "conclude",
        "reducing",
        "theory",
        "ramsey",
        "sentence",
        "equivalent",
        "reducing",
        "empirical",
        "consequence",
        "thus",
        "russell",
        "realism",
        "collapse",
        "version",
        "phenomenalism",
        "strict",
        "empiricism",
        "theory",
        "observational",
        "consequence",
        "equally",
        "true",
        "similarly",
        "jane",
        "english",
        "argued",
        "though",
        "basis",
        "different",
        "consideration",
        "two",
        "ramsey",
        "sentence",
        "incompatible",
        "one",
        "another",
        "observational",
        "consequence",
        "common",
        "hence",
        "seems",
        "treat",
        "theory",
        "ramsey",
        "sentence",
        "notion",
        "theoretical",
        "equivalence",
        "collapse",
        "onto",
        "empirical",
        "equivalence",
        "demopoulos",
        "argues",
        "similar",
        "consideration",
        "show",
        "structural",
        "empiricism",
        "also",
        "collapse",
        "truth",
        "empirical",
        "adequacy",
        "also",
        "discus",
        "relationship",
        "newman",
        "problem",
        "putnam",
        "paradox",
        "votsis",
        "argues",
        "conclusion",
        "newman",
        "argument",
        "undermine",
        "esr",
        "gordon",
        "solomon",
        "defends",
        "richard",
        "braithwaite",
        "claim",
        "eddington",
        "structuralism",
        "see",
        "vulnerable",
        "newman",
        "argument",
        "jeffery",
        "ketland",
        "argues",
        "detail",
        "newman",
        "objection",
        "trivialises",
        "ramsey",
        "sentence",
        "formulation",
        "esr",
        "worrall",
        "zahar",
        "argue",
        "cognitive",
        "content",
        "theory",
        "exhausted",
        "ramsey",
        "sentence",
        "ramsey",
        "sentence",
        "express",
        "empirical",
        "content",
        "theory",
        "notion",
        "empirical",
        "content",
        "play",
        "sufficient",
        "form",
        "realism",
        "paper",
        "worrall",
        "set",
        "account",
        "defense",
        "epistemic",
        "structural",
        "realism",
        "responds",
        "objection",
        "raised",
        "including",
        "newman",
        "problem",
        "cruse",
        "melia",
        "saatsi",
        "defend",
        "ramsey",
        "sentence",
        "approach",
        "modeltheoretic",
        "argument",
        "questioning",
        "assumption",
        "predicate",
        "apply",
        "unobservables",
        "must",
        "eliminated",
        "favour",
        "bound",
        "variable",
        "mixed",
        "predicate",
        "extended",
        "apply",
        "observable",
        "unobservable",
        "object",
        "newman",
        "objection",
        "go",
        "mixed",
        "predicate",
        "ramsified",
        "model",
        "ramsey",
        "sentence",
        "necessarily",
        "one",
        "claimed",
        "regarding",
        "mixed",
        "property",
        "relation",
        "hold",
        "response",
        "demopoulos",
        "point",
        "ramsey",
        "sentence",
        "theory",
        "mixed",
        "predicate",
        "latter",
        "ramsified",
        "true",
        "provided",
        "original",
        "theory",
        "satisfiedhence",
        "claim",
        "content",
        "ramsey",
        "sentence",
        "merely",
        "observational",
        "content",
        "original",
        "theory",
        "plus",
        "cardinality",
        "claim",
        "still",
        "true",
        "mixed",
        "predicate",
        "considered",
        "melia",
        "saatsi",
        "also",
        "argue",
        "intensional",
        "notion",
        "naturalness",
        "causal",
        "significance",
        "may",
        "applied",
        "property",
        "save",
        "ramsey",
        "sentence",
        "formulation",
        "esr",
        "triviality",
        "recall",
        "defence",
        "russell",
        "structuralism",
        "newman",
        "discussed",
        "hochberg",
        "demopoulos",
        "also",
        "raise",
        "two",
        "problem",
        "strategy",
        "firstly",
        "even",
        "nonnatural",
        "relation",
        "significant",
        "claim",
        "made",
        "theory",
        "secondly",
        "cognitive",
        "significance",
        "unramsified",
        "theory",
        "independent",
        "commitment",
        "real",
        "natural",
        "relation",
        "hence",
        "demopoulos",
        "insists",
        "ramsey",
        "sentence",
        "theory",
        "theory",
        "importantly",
        "different",
        "see",
        "also",
        "psillos",
        "b",
        "peter",
        "ainsworth",
        "give",
        "accessible",
        "account",
        "newman",
        "problem",
        "response",
        "given",
        "ladyman",
        "ladyman",
        "ross",
        "argue",
        "newman",
        "problem",
        "arise",
        "ontic",
        "structural",
        "realism",
        "eschews",
        "extensional",
        "understanding",
        "relation",
        "paper",
        "demopoulos",
        "argues",
        "three",
        "different",
        "view",
        "work",
        "russell",
        "ramsey",
        "carnap",
        "respectively",
        "common",
        "version",
        "core",
        "structuralist",
        "thesis",
        "identifies",
        "account",
        "considers",
        "make",
        "use",
        "ramsey",
        "sentence",
        "demopoulos",
        "investigates",
        "logical",
        "property",
        "ramsey",
        "sentence",
        "arrives",
        "argument",
        "structuralist",
        "thesis",
        "friedman",
        "argues",
        "carnap",
        "account",
        "theoretical",
        "term",
        "involving",
        "ramsey",
        "sentence",
        "approach",
        "vulnerable",
        "newman",
        "problem",
        "relationship",
        "friedman",
        "view",
        "relativized",
        "priori",
        "structural",
        "realism",
        "interrogated",
        "ivanova",
        "structural",
        "realism",
        "supposed",
        "help",
        "problem",
        "theory",
        "change",
        "maxwell",
        "pointed",
        "structural",
        "realism",
        "purely",
        "semantic",
        "epistemological",
        "theory",
        "ramsey",
        "sentence",
        "pick",
        "exactly",
        "entity",
        "original",
        "theory",
        "dispense",
        "reference",
        "make",
        "reference",
        "function",
        "place",
        "theoretical",
        "term",
        "overall",
        "structure",
        "theory",
        "manifested",
        "ramsey",
        "sentence",
        "hence",
        "ladyman",
        "argues",
        "general",
        "epistemological",
        "form",
        "structural",
        "realism",
        "significantly",
        "improve",
        "prospect",
        "standard",
        "scientific",
        "realism",
        "structural",
        "realism",
        "thought",
        "metaphysically",
        "rather",
        "merely",
        "epistemically",
        "revisionary",
        "problem",
        "ontological",
        "discontinuity",
        "arguably",
        "left",
        "untouched",
        "simply",
        "adopting",
        "ramsification",
        "fact",
        "seems",
        "even",
        "worse",
        "contextualism",
        "meaning",
        "theoretical",
        "term",
        "adopted",
        "cei",
        "french",
        "cruse",
        "also",
        "argue",
        "different",
        "ground",
        "ramsification",
        "help",
        "structural",
        "realist",
        "version",
        "esr",
        "employ",
        "ramsey",
        "sentence",
        "theory",
        "distinction",
        "observational",
        "theoretical",
        "term",
        "embedded",
        "socalled",
        "syntactic",
        "view",
        "theory",
        "adopts",
        "firstorder",
        "quantificational",
        "logic",
        "appropriate",
        "form",
        "representation",
        "physical",
        "theory",
        "according",
        "zahar",
        "continuity",
        "science",
        "intension",
        "rather",
        "extension",
        "concept",
        "argues",
        "believe",
        "mathematical",
        "structure",
        "theory",
        "fundamentally",
        "important",
        "ontology",
        "need",
        "semantics",
        "theory",
        "address",
        "representative",
        "role",
        "mathematics",
        "directly",
        "account",
        "scientific",
        "representation",
        "allegedly",
        "found",
        "socalled",
        "semantic",
        "modeltheoretic",
        "approach",
        "associated",
        "primarily",
        "patrick",
        "suppes",
        "fred",
        "suppe",
        "ron",
        "giere",
        "ba",
        "van",
        "fraassen",
        "recently",
        "da",
        "costa",
        "french",
        "relationship",
        "structuralism",
        "semantic",
        "view",
        "discussed",
        "van",
        "fraassen",
        "thomsonjones",
        "chris",
        "pincock",
        "criticises",
        "structural",
        "realism",
        "basis",
        "analysis",
        "role",
        "mathematics",
        "scientific",
        "representation",
        "see",
        "also",
        "beni",
        "development",
        "form",
        "structural",
        "realism",
        "together",
        "account",
        "representation",
        "general",
        "wallace",
        "argues",
        "mathematicsfirst",
        "view",
        "scientific",
        "representation",
        "semantic",
        "view",
        "lead",
        "naturally",
        "ontic",
        "structural",
        "realism"
    ]
}