{
    "main_text": "The Metaphysical Disputations || Formal Causation and the Existence of Substantial Forms\n2.3 Formal Causation and the Existence of Substantial Forms\n\nSuárez's treatment of formal causation provides a good example.\nHe begins his treatment of the formal cause in his typical fashion, by\nshowing it conforms to his overarching causal framework. A standard\ntextbook account of formal causation familiar to Suárez holds\nsimply that “form in an internal cause that gives being to a\nthing” (causa intrinseca quae dat esse rei: DM\nXII 3.3). This approach certainly comports with his basic framework\nfor causation, at least in general terms. Suárez is, however,\nunwilling to adopt this formula unqualifiedly, since he thinks the\nother internal cause, matter, has a causal efficacy of its own, not\nparasitic on the causality of form. Thus, when he comes to give an\naccount of the most significant kind of formal cause, the substantial\nform, he offers the following definition:\n\n\nx is a substantial form =df x is a definite\nsimple and incomplete substance, which, as the actuality of matter,\nconstitutes with it the essence of composite substance (forma est\nsubstantia quaedam simplex et incompleta, quae ut actus materiae cum\nea constituit essentiam substantiae compositae: DM XV\n5.1)\n\n\nSuárez here insists that it is the form together with the\nmatter (cum ea) which constitutes the essence of a\nsubstantial composite. He thinks, then, that matter has, so to speak,\nits own independent causal pathway as an internal cause. Even though\nthe substantial form is the actuality of the matter, this does not\ndeprive matter of its causal efficacy. In this respect, he parts\ncompany from a good many of his contemporaries and predecessors, who\nhad opted for the simpler formulation, often by representing the\ncausal efficacy of matter as somehow parasitic on the causality of the\nform.\n\nIf this shows some development by acknowledging the independent role\nof matter in causation and explanation, it is also likely to appear\nretrograde in its basic appeal to the apparatus of formal causation.\nIndeed, in Metaphysical Disputations XV Suárez takes\nup in detail a question about substantial forms which has a special\nresonance because of the contumely poured on this doctrine by\nphilosophers writing in the centuries after his death, many of whom\nwere self-consciously concerned to distance themselves from the entire\nidea of formal causation—a doctrine they regarded as noxious,\nobscurantist, and explanatorily vacuous. Locke, for instance, in his\nEssay Concerning Human Understanding, derided his\npredecessors for their “fruitless Enquiries after substantial\nForms, wholly unintelligible, and whereof we have scarce so much as\nany obscure, or confused Conception in general.” (Locke 1976\n[1690]:\n 3.6.10)[13]\n\n\nLocke's reaction was in many ways typical of the general tenor of\npost-scholastic rejections of substantial form in that he founded his\ncharges of unintelligibility largely on epistemic considerations: the\nfruitlessness of substantial forms, he thinks, is shown most readily\nby their empirical inadequacy. We have, he complains, no experience of\nthem at all, and therefore, no idea of what we might be taking\nourselves to be positing. This is in part because Locke conflates the\nnotion of substance with that of substratum, which he derides\nas a something “I know not what, [introduced] to support those\nideas we call accidents” (Locke 1976 [1690]: 2.23.15).\n\nIt is striking that Suárez, a staunch defender of substantial\nforms, in a way agrees the Locke's dominant complaint. At any rate, he\nthinks that we might have only two reasons for accepting substantial\nforms:\n\n\nThe first reason for doubting that substantial forms exist is that\nthey cannot be known by any experience (ratio dubitandi est primo\nquia formae substantiales nullo experimento cognosci possunt);\nnor are they necessary [to account for] the actions and differences in\nthings which we do experience. Therefore, lacking any [sufficient]\nreason, they are not to be introduced (DM XV 1.1).\n\n\nThere are two distinct succinctly stated arguments here. First, if we\ncan have no experience of substantial forms, we have reason for\ndoubting their existence. Second, if we have no need to posit them to\nexplain the phenomena we do experience, then, again, we have reason to\ndoubt their existence. These arguments are clearly connected, though\ndiscrete, in that the second becomes dialectically salient precisely\nwhen the first is endorsed. If one grants that we have reason to doubt\nthe existence of substantial forms insofar as we never experience them\ndirectly, the question immediately arises as to whether we have some\nindirect, non-experiential reason for granting them. The proponent of\nthe second argument contends that we do not.\n\nWhat is striking is that Suárez simply grants the first premise\nof the first argument, and so effectively cedes the point on which\nLocke later laid so much emphasis: we have no direct experience of\nsubstantial forms. Hence, he agrees, we have some reason for doubting\ntheir existence. Needless to say, however, Suárez does not join\nLocke or any of the many philosophers who followed him in finally\ncasting substantial forms aside. This is because he roundly rejects\nthe first premise of the second argument, according to which it is not\nnecessary to posit substantial forms to explain other data known to us\nthrough experience. Suárez counters that, on the contrary,\nsubstantial forms have significant explanatory work to do. He\nconcludes, then, that to the extent that this is so, we have reason to\ncountenance their existence after all.\n\nHis argument for the existence of substantial forms is thus\neffectively abductive: for some range of data or phenomena,\nSuárez contends, some explanation is required, and the only,\nor, more weakly, the best, explanation of these phenomena involves a\ncommitment to substantial forms. So, his general argument schema is\nclear: (i) some phenomenon φ requires explanation; (ii) the only\nor best explanation of φ is the existence of substantial forms;\nhence, (iii) there are substantial forms. The argument thus assumes\nthat the phenomena in question both obtain and are not primitive, that\nis, that we are confronted with some data for which some form of\nexplanation is both wanting and available.\n\nWhat are these phenomena? In Metaphysical Disputations XV,\nSuárez appeals most forcefully to the following four: first, we\nfind accidents unified in a single subject (DM XV 1.7);\nsecond, as a related matter, we observe various properties in a single\nsubject, both essential and accidental, standing in superordination\nand subordination relations to one another (DM XV 1.14);\nthird, we experience various entities coming into and going out of\nexistence, suffering, in his preferred idiom, generation and\ncorruption (DM XV 1.7); and finally, we observe various\nphysical systems, including especially (but not only) living beings\nmanifesting equilibrium states which they maintain unless put under\npressure, and to which they return when a pressure applied has been\nrelieved (DM XV 1.8).\n\nThe arguments for these claims are varied, but in each case show great\nsensitivity to matters of systematicity and unity. To explicate the\nfirst, by way of illustration, Suárez appeals to the simple\nthought that there are privileged unities in our world. He thinks it\nplain—and does not dally to offer an argument—that, for\ninstance, Socrates is a unified being, who exists in a specific place\nand time, that he is a human being who eats, sleeps, grows, diminishes\nand dies. By contrast, the mereological sum of Socrates, the\nPinturricchio frescoes in the Bufalini Chapel in Rome, and a volume of\nwater equal to one pint in somewhere in the Indian Ocean is no such\nunity. There is, of course, a mereological sum of these three diverse\nitems; but this sum does not exhibit the form of unity we observe in\nSocrates. By the same token, Socrates is himself a mereological sum of\nvarious atoms. Suárez takes it for granted that he is\nalso a mind- and language-independent privileged unity. If he\nis right, then this further fact is either primitive or explicable.\nSuárez thinks it explicable rather than primitive and tenders\nthe existence of substantial forms—in this case the form of\nbeing a human being—as the appropriate explanatory posit.\n\nNeedless to say, this last step requires further amplification and\ndefence if it is to be at all credible. Again, however, one can see,\nat a bare minimum, that Suárez has fully anticipated objections\nto his views later taken as decisive; yet many of those unreflectively\nsatisfied by those later objections seem to show no awareness of his\nanticipations.\n",
    "section_title": "2.3 Formal Causation and the Existence of Substantial Forms",
    "entry_title": "Francisco Suárez",
    "hierarchy_title": "Francisco Suárez || The Metaphysical Disputations || Formal Causation and the Existence of Substantial Forms",
    "tokenized_text": [
        "metaphysical",
        "disputation",
        "formal",
        "causation",
        "existence",
        "substantial",
        "form",
        "formal",
        "causation",
        "existence",
        "substantial",
        "form",
        "suárez",
        "s",
        "treatment",
        "formal",
        "causation",
        "provides",
        "good",
        "example",
        "begin",
        "treatment",
        "formal",
        "cause",
        "typical",
        "fashion",
        "showing",
        "conforms",
        "overarching",
        "causal",
        "framework",
        "standard",
        "textbook",
        "account",
        "formal",
        "causation",
        "familiar",
        "suárez",
        "hold",
        "simply",
        "form",
        "internal",
        "cause",
        "give",
        "thing",
        "causa",
        "intrinseca",
        "quae",
        "dat",
        "esse",
        "rei",
        "dm",
        "xii",
        "approach",
        "certainly",
        "comports",
        "basic",
        "framework",
        "causation",
        "least",
        "general",
        "term",
        "suárez",
        "however",
        "unwilling",
        "adopt",
        "formula",
        "unqualifiedly",
        "since",
        "think",
        "internal",
        "cause",
        "matter",
        "causal",
        "efficacy",
        "parasitic",
        "causality",
        "form",
        "thus",
        "come",
        "give",
        "account",
        "significant",
        "kind",
        "formal",
        "cause",
        "substantial",
        "form",
        "offer",
        "following",
        "definition",
        "x",
        "substantial",
        "form",
        "df",
        "x",
        "definite",
        "simple",
        "incomplete",
        "substance",
        "actuality",
        "matter",
        "constitutes",
        "essence",
        "composite",
        "substance",
        "forma",
        "est",
        "substantia",
        "quaedam",
        "simplex",
        "et",
        "incompleta",
        "quae",
        "ut",
        "actus",
        "materiae",
        "cum",
        "ea",
        "constituit",
        "essentiam",
        "substantiae",
        "compositae",
        "dm",
        "xv",
        "suárez",
        "insists",
        "form",
        "together",
        "matter",
        "cum",
        "ea",
        "constitutes",
        "essence",
        "substantial",
        "composite",
        "think",
        "matter",
        "speak",
        "independent",
        "causal",
        "pathway",
        "internal",
        "cause",
        "even",
        "though",
        "substantial",
        "form",
        "actuality",
        "matter",
        "deprive",
        "matter",
        "causal",
        "efficacy",
        "respect",
        "part",
        "company",
        "good",
        "many",
        "contemporary",
        "predecessor",
        "opted",
        "simpler",
        "formulation",
        "often",
        "representing",
        "causal",
        "efficacy",
        "matter",
        "somehow",
        "parasitic",
        "causality",
        "form",
        "show",
        "development",
        "acknowledging",
        "independent",
        "role",
        "matter",
        "causation",
        "explanation",
        "also",
        "likely",
        "appear",
        "retrograde",
        "basic",
        "appeal",
        "apparatus",
        "formal",
        "causation",
        "indeed",
        "metaphysical",
        "disputation",
        "xv",
        "suárez",
        "take",
        "detail",
        "question",
        "substantial",
        "form",
        "special",
        "resonance",
        "contumely",
        "poured",
        "doctrine",
        "philosopher",
        "writing",
        "century",
        "death",
        "many",
        "selfconsciously",
        "concerned",
        "distance",
        "entire",
        "idea",
        "formal",
        "causationa",
        "doctrine",
        "regarded",
        "noxious",
        "obscurantist",
        "explanatorily",
        "vacuous",
        "locke",
        "instance",
        "essay",
        "concerning",
        "human",
        "understanding",
        "derided",
        "predecessor",
        "fruitless",
        "enquiry",
        "substantial",
        "form",
        "wholly",
        "unintelligible",
        "whereof",
        "scarce",
        "much",
        "obscure",
        "confused",
        "conception",
        "general",
        "locke",
        "locke",
        "s",
        "reaction",
        "many",
        "way",
        "typical",
        "general",
        "tenor",
        "postscholastic",
        "rejection",
        "substantial",
        "form",
        "founded",
        "charge",
        "unintelligibility",
        "largely",
        "epistemic",
        "consideration",
        "fruitlessness",
        "substantial",
        "form",
        "think",
        "shown",
        "readily",
        "empirical",
        "inadequacy",
        "complains",
        "experience",
        "therefore",
        "idea",
        "might",
        "taking",
        "positing",
        "part",
        "locke",
        "conflates",
        "notion",
        "substance",
        "substratum",
        "derides",
        "something",
        "know",
        "introduced",
        "support",
        "idea",
        "call",
        "accident",
        "locke",
        "striking",
        "suárez",
        "staunch",
        "defender",
        "substantial",
        "form",
        "way",
        "agrees",
        "locke",
        "s",
        "dominant",
        "complaint",
        "rate",
        "think",
        "might",
        "two",
        "reason",
        "accepting",
        "substantial",
        "form",
        "first",
        "reason",
        "doubting",
        "substantial",
        "form",
        "exist",
        "known",
        "experience",
        "ratio",
        "dubitandi",
        "est",
        "primo",
        "quia",
        "formae",
        "substantiales",
        "nullo",
        "experimento",
        "cognosci",
        "possunt",
        "necessary",
        "account",
        "action",
        "difference",
        "thing",
        "experience",
        "therefore",
        "lacking",
        "sufficient",
        "reason",
        "introduced",
        "dm",
        "xv",
        "two",
        "distinct",
        "succinctly",
        "stated",
        "argument",
        "first",
        "experience",
        "substantial",
        "form",
        "reason",
        "doubting",
        "existence",
        "second",
        "need",
        "posit",
        "explain",
        "phenomenon",
        "experience",
        "reason",
        "doubt",
        "existence",
        "argument",
        "clearly",
        "connected",
        "though",
        "discrete",
        "second",
        "becomes",
        "dialectically",
        "salient",
        "precisely",
        "first",
        "endorsed",
        "one",
        "grant",
        "reason",
        "doubt",
        "existence",
        "substantial",
        "form",
        "insofar",
        "never",
        "experience",
        "directly",
        "question",
        "immediately",
        "arises",
        "whether",
        "indirect",
        "nonexperiential",
        "reason",
        "granting",
        "proponent",
        "second",
        "argument",
        "contends",
        "striking",
        "suárez",
        "simply",
        "grant",
        "first",
        "premise",
        "first",
        "argument",
        "effectively",
        "cedes",
        "point",
        "locke",
        "later",
        "laid",
        "much",
        "emphasis",
        "direct",
        "experience",
        "substantial",
        "form",
        "hence",
        "agrees",
        "reason",
        "doubting",
        "existence",
        "needle",
        "say",
        "however",
        "suárez",
        "join",
        "locke",
        "many",
        "philosopher",
        "followed",
        "finally",
        "casting",
        "substantial",
        "form",
        "aside",
        "roundly",
        "reject",
        "first",
        "premise",
        "second",
        "argument",
        "according",
        "necessary",
        "posit",
        "substantial",
        "form",
        "explain",
        "data",
        "known",
        "u",
        "experience",
        "suárez",
        "counter",
        "contrary",
        "substantial",
        "form",
        "significant",
        "explanatory",
        "work",
        "concludes",
        "extent",
        "reason",
        "countenance",
        "existence",
        "argument",
        "existence",
        "substantial",
        "form",
        "thus",
        "effectively",
        "abductive",
        "range",
        "data",
        "phenomenon",
        "suárez",
        "contends",
        "explanation",
        "required",
        "weakly",
        "best",
        "explanation",
        "phenomenon",
        "involves",
        "commitment",
        "substantial",
        "form",
        "general",
        "argument",
        "schema",
        "clear",
        "phenomenon",
        "φ",
        "requires",
        "explanation",
        "ii",
        "best",
        "explanation",
        "φ",
        "existence",
        "substantial",
        "form",
        "hence",
        "iii",
        "substantial",
        "form",
        "argument",
        "thus",
        "assumes",
        "phenomenon",
        "question",
        "obtain",
        "primitive",
        "confronted",
        "data",
        "form",
        "explanation",
        "wanting",
        "available",
        "phenomenon",
        "metaphysical",
        "disputation",
        "xv",
        "suárez",
        "appeal",
        "forcefully",
        "following",
        "four",
        "first",
        "find",
        "accident",
        "unified",
        "single",
        "subject",
        "dm",
        "xv",
        "second",
        "related",
        "matter",
        "observe",
        "various",
        "property",
        "single",
        "subject",
        "essential",
        "accidental",
        "standing",
        "superordination",
        "subordination",
        "relation",
        "one",
        "another",
        "dm",
        "xv",
        "third",
        "experience",
        "various",
        "entity",
        "coming",
        "going",
        "existence",
        "suffering",
        "preferred",
        "idiom",
        "generation",
        "corruption",
        "dm",
        "xv",
        "finally",
        "observe",
        "various",
        "physical",
        "system",
        "including",
        "especially",
        "living",
        "being",
        "manifesting",
        "equilibrium",
        "state",
        "maintain",
        "unless",
        "put",
        "pressure",
        "return",
        "pressure",
        "applied",
        "relieved",
        "dm",
        "xv",
        "argument",
        "claim",
        "varied",
        "case",
        "show",
        "great",
        "sensitivity",
        "matter",
        "systematicity",
        "unity",
        "explicate",
        "first",
        "way",
        "illustration",
        "suárez",
        "appeal",
        "simple",
        "thought",
        "privileged",
        "unity",
        "world",
        "think",
        "plainand",
        "dally",
        "offer",
        "argumentthat",
        "instance",
        "socrates",
        "unified",
        "exists",
        "specific",
        "place",
        "time",
        "human",
        "eats",
        "sleep",
        "grows",
        "diminishes",
        "dy",
        "contrast",
        "mereological",
        "sum",
        "socrates",
        "pinturricchio",
        "fresco",
        "bufalini",
        "chapel",
        "rome",
        "volume",
        "water",
        "equal",
        "one",
        "pint",
        "somewhere",
        "indian",
        "ocean",
        "unity",
        "course",
        "mereological",
        "sum",
        "three",
        "diverse",
        "item",
        "sum",
        "exhibit",
        "form",
        "unity",
        "observe",
        "socrates",
        "token",
        "socrates",
        "mereological",
        "sum",
        "various",
        "atom",
        "suárez",
        "take",
        "granted",
        "also",
        "mind",
        "languageindependent",
        "privileged",
        "unity",
        "right",
        "fact",
        "either",
        "primitive",
        "explicable",
        "suárez",
        "think",
        "explicable",
        "rather",
        "primitive",
        "tender",
        "existence",
        "substantial",
        "formsin",
        "case",
        "form",
        "human",
        "beingas",
        "appropriate",
        "explanatory",
        "posit",
        "needle",
        "say",
        "last",
        "step",
        "requires",
        "amplification",
        "defence",
        "credible",
        "however",
        "one",
        "see",
        "bare",
        "minimum",
        "suárez",
        "fully",
        "anticipated",
        "objection",
        "view",
        "later",
        "taken",
        "decisive",
        "yet",
        "many",
        "unreflectively",
        "satisfied",
        "later",
        "objection",
        "seem",
        "show",
        "awareness",
        "anticipation"
    ]
}