{
    "main_text": "The Metaphysical Disputations || Beings of Reason (entia rationis)\n2.5 Beings of Reason (entia rationis)\n\nSuárez seems to have conceded a great deal to the critics of\nfinal causation in allowing that every final cause remains at root\nimplicated in the realm of the intentional. Still, again, he makes\nthis concession only by way of affirming the existence of final\ncauses. He has thereby also, however, evidently maneuvered himself\ninto an uncomfortable position whereby the Fountain of Youth, for\ninstance, is a final cause, even though it has no real being (esse\nreale). Yet he himself insists that nothing is a cause, or\nprincipium in general, without having real being. He thus\nowes an explanation of how he avoids falling into a direct\ncontradiction on this point. The Fountain of Youth cannot both lack\nreal being and be a cause, of any kind.\n\nHe offers his explanation in last chapter of his Metaphysical\nDisputations, which is dedicated to beings of reason (entia\nrationis). This disputation is independently interesting because\nit engages a question which has continued to fascinate metaphysicians\ndown to the present day, though it has taken various forms in various\nperiods of inquiry. This is the question of how we are to speak (or\nthink) about things that are not. If something is unavailable to be\nspoken or thought about, then, presumably, we do not speak or think\nabout it. After all, as Suárez notes, non-existing\nbeings of reason about which we pretend to think or speak\n\n\nare neither true, real beings, because they are not capable of real\nand true existence, nor indeed do they have any true likeness with\nreal beings. (DM LIV 1.4)\n\n\nStill, according to Suárez, we can and do think and speak about\nbeings of reason. It follows, then, that we do speak and think about\nthings which do not exist. It falls to the metaphysician to offer an\naccount of how this might be so. Indeed, for better or worse, the\nmetaphysician must address the topic of beings of reason, not least\nbecause, invariably and inevitably, such (non-)beings force themselves\ninto view along the periphery of any inquiry into real beings. To take\nbut one example, even if we think that there is no void, indeed even\nif we think that it is impossible that there should be a void, and so\nthink that the void is merely a being of reason, we will find\nourselves discussing “the void” when investigating the\ncharacteristics of space, motion, matter, and quantity. We may ask,\nfor instance, whether the existence of motion requires the existence\nof the void, and, even if we decide that it does not, our inquiry into\nspace and motion—certainly appropriate topics of inquiry for the\nmetaphysician—has led us to consideration of a non-existing\nbeing, the void. So, in Suárez's terms, inquiry into beings\ninevitably propels the metaphysician into consideration of\nnon-existing beings of reason. So, entia rationis—these\nnon-beings—require a treatment by the student of being.\n\nIt is first of all striking in Suárez's treatment that the\nclass of entia rationis includes a seeming motley of cases,\nextending beyond non-existing objects of thought and reference (and so\nbeyond non-existent final causes). In addition to final causes which\nare not, the student of being finds himself confronted with\ntrue-sounding appeals to phantasmagorical and mythical beasts and\ncreatures of fiction of various sorts, even though their subjects have\nvacuous reference (“Pegasus is a winged horse”). More\nimportantly, Suárez countenances a whole range of other\nnon-beings among entia rationis, some of which are more\npedestrian than creatures of fiction: negations, such as being\nnot-human; privations, that is, lacks keyed to positive properties,\nsuch as blindness; and also (what he takes to be mere) logical\nabstractions, such as being a consequent or an antecedent; and\ntaxonomical categories, which, in view of his general nominalism, he\ntakes to be mere metaphysical abstractions, such as species and\ngenus.\n\nThe first thing to notice about this list is its heterogeneity.\nSuárez is interested in a group of entities, broadly conceived,\nthat end up in metaphysical discourse even though they do not exist.\nNote, too, that he does not say that such entities do not exist\n“strictly speaking” or “fully” or\n“really” or that they exist “in the mind or\nimagination only”. Instead he insists: they do not exist. Even\nso, in metaphysics and physics, we speak of genera and species; in\nlogic, of antecedents and consequences; in causation and metaphysics\nmore broadly, of privations; and in many walks of life, of\nnon-existent entities, often enough innocently imputing causal\nprofiles to them.\n\nFocusing on the last case, which is in any case the most colorful and\ncaptivating, Suárez argues that it falls to the metaphysician\nto come to terms with such true sentences such as “The gryphon\nis fierce”, “Gryphons do not exist”, and even\n“The gryphon frightened the children to the point where some of\nthem began to cry uncontrollably”. How can these sentences be\ntrue, when there is nothing here about which one may talk or think?\nWhat must be the case, if these sentences are to be accepted as true?\nPerhaps, one may think, the gryphon must exist in some way, if it is\nto be fierce; that if it can be said not to exist, then it—the\nthing about which the speaker is speaking—must exist in some one\nway but not in some other; and, most of all, that if it is to be\nimplicated in the causal network, it certainly must exist—or\nelse it could not stand in a causal relation to anything at all.\nIndeed, Suárez himself gives voice to just these sorts of\ncontention in other contexts. For example, this last observation is\nperfectly reflected in a claim he makes about the necessary conditions\nof formal causation: “The first requisite [for formal causation]\nis the actual existence of a form itself” (prima est\nactualis existentia ipsius formae: DM XV 6.3). The\nquestion, then, is how beings of reason can enter the causal network\nif they fail this first requirement of any cause: that it exist.\n\nAt first it may seem as if Suárez intends to hold that beings\nof reason do, in fact, have some mode of existence, perhaps some sort\nof subsistence or some mode of being short of the sort manifested by\nwhat he calls “true, real beings”. For instance, he\ncontends that “beings of reason must be granted”\n(DM XLIV 1.4), and then hastens to add that:\n\n\nsuch beings are neither true, real beings, because they are not\ncapable of real and true existence, nor indeed do they have any true\nlikeness with real beings—[any likeness, that is,] in terms of\nwhose account they would have a common concept of being with them.\n(DM XLIV 1.4).\n\n\nHe also insists that: “fictitious things … or beings of\nreason, are not said to endure truly and properly, because they do not\nexist” (DM L 1.1). So, again, it may seem as if he\nmeans to contend that they exist, though not in the manner of true and\nreal beings, or, again, insofar as they may be said to endure at all,\nthey do so not truly or but rather only improperly.\n\nThis is not at all, however, his view of entia rationis. His\napproach to them is in one way disarmingly simple: he insists that\nthey do not exist (Shields 2012b). Even so, he maintains, one may\nfreely speak of them as if they existed. Indeed, just as\n“they are fashioned or apprehended as if they truly existed,\nthey are further conceived as if they endured”. His view, more\nfully:\n\n\nAgain, that objective being, even though the being of reason in itself\nis nothing, still necessarily supposes some real being, on which it is\nfounded, or from whose denomination or relation that objective being\nquasi-results (quasi resultet). Therefore, that cause which\nproduced such a real being is the cause of the being of reason\n(DM LIV 2.3).\n\n\nHis picture is that beings of reason are such that, although they do\nnot exist, one may speak and think as if they existed, where\nthe thinking in question is a real, existing formal structure in the\nmind of an actual thinker. Thinking is in this way contentful, because\nfounded in some real feature of some real thinker, but not therefore\nsuch as to take an object. One may think of Socrates or one may think\nof a gryphon; the gryphon's being thought, however, unlike Socrates's\nbeing thought, is not an extrinsic denomination of the gryphon, as it\nis of Socrates; for Socrates is and the gryphon is not. Were there a\ngryphon, says Suárez, the formal structure of the thinker would\nindeed give rise to an extrinsic denomination of it, no more or less\nthat Socrates's being thought gives rise to such a feature of him.\nStill, he insists, because there is not such a gryphon, there is not\nsuch a feature to be had by him.\n\nIn short, then, the content of the thought derives from the real,\nformal structure in the mind of the thinker and not from the object.\nThat holds fixed across all episodes of thought. It is just that some\nthoughts are about something and others about nothing at all. Their\nbeing about nothing, insists Suárez, hardly robs them of their\ncontentfulness: the motion of a missed punch is a real motion, and not\nthe same as the motion of a missed kick; but neither makes contact,\nand so in neither case is there something contacted, something kicked\nor punched. On the contrary, nothing is kicked in a missed kick, and\nnothing punched in a missed punch. In the same way, then, nothing is\nthought or referred to when there is no object of thought or\nreference. In such cases, all the causation involved eventuates from\nand reaches only the actual formal structures of an actual mind:\n\n\nall that efficient [causation] is terminated—as to a terminus of\nreal production—at the formal concept of the mind itself, and it\nstops there. (tota vero illa efficientia, ut ad terminum realis\nproductionis terminatur ad formalem conceptum ipsius mentis, et ibi\nsistit: DM LIV 2.3)\n\n\nTaking all that together, S can speak of the gryphon, though\nthere is no gryphon there to be spoken of; and the thinking in this\ncase is in all respects like the thinking that goes on in one who is\nthinking of Socrates. The difference is that Socrates comes to have an\nextrinsic denomination—being thought of by\nS—whereas the gryphon, who does not exist, does not acquire\nthis or any other denomination, extrinsic or intrinsic. There is,\nnonetheless, a fact about the world such that were there to be a\ngryphon, it would have acquired such a denomination, precisely because\nsome actual person would have been in the relevant state of thinking\nabout it.\n\nExactly the same holds true, according to Suárez, of the other\nsorts of entia rationis he countenances: negations,\nprivations, and abstractions. They are not, but this does not preclude\nour thinking of them and speaking about them. Our doing so in no way\ninvests them with existence of any kind. This is how Suárez\ninsists that entia rationis “must be granted”\neven though they lack “any true likeness with real beings”\n(DM LIV 1.4).\n",
    "section_title": "2.5 Beings of Reason (entia rationis)",
    "entry_title": "Francisco Suárez",
    "hierarchy_title": "Francisco Suárez || The Metaphysical Disputations || Beings of Reason (entia rationis)",
    "tokenized_text": [
        "metaphysical",
        "disputation",
        "being",
        "reason",
        "entia",
        "rationis",
        "being",
        "reason",
        "entia",
        "rationis",
        "suárez",
        "seems",
        "conceded",
        "great",
        "deal",
        "critic",
        "final",
        "causation",
        "allowing",
        "every",
        "final",
        "cause",
        "remains",
        "root",
        "implicated",
        "realm",
        "intentional",
        "still",
        "make",
        "concession",
        "way",
        "affirming",
        "existence",
        "final",
        "cause",
        "thereby",
        "also",
        "however",
        "evidently",
        "maneuvered",
        "uncomfortable",
        "position",
        "whereby",
        "fountain",
        "youth",
        "instance",
        "final",
        "cause",
        "even",
        "though",
        "real",
        "esse",
        "reale",
        "yet",
        "insists",
        "nothing",
        "cause",
        "principium",
        "general",
        "without",
        "real",
        "thus",
        "owes",
        "explanation",
        "avoids",
        "falling",
        "direct",
        "contradiction",
        "point",
        "fountain",
        "youth",
        "lack",
        "real",
        "cause",
        "kind",
        "offer",
        "explanation",
        "last",
        "chapter",
        "metaphysical",
        "disputation",
        "dedicated",
        "being",
        "reason",
        "entia",
        "rationis",
        "disputation",
        "independently",
        "interesting",
        "engages",
        "question",
        "continued",
        "fascinate",
        "metaphysicians",
        "present",
        "day",
        "though",
        "taken",
        "various",
        "form",
        "various",
        "period",
        "inquiry",
        "question",
        "speak",
        "think",
        "thing",
        "something",
        "unavailable",
        "spoken",
        "thought",
        "presumably",
        "speak",
        "think",
        "suárez",
        "note",
        "nonexisting",
        "being",
        "reason",
        "pretend",
        "think",
        "speak",
        "neither",
        "true",
        "real",
        "being",
        "capable",
        "real",
        "true",
        "existence",
        "indeed",
        "true",
        "likeness",
        "real",
        "being",
        "dm",
        "liv",
        "still",
        "according",
        "suárez",
        "think",
        "speak",
        "being",
        "reason",
        "follows",
        "speak",
        "think",
        "thing",
        "exist",
        "fall",
        "metaphysician",
        "offer",
        "account",
        "might",
        "indeed",
        "better",
        "worse",
        "metaphysician",
        "must",
        "address",
        "topic",
        "being",
        "reason",
        "least",
        "invariably",
        "inevitably",
        "non",
        "being",
        "force",
        "view",
        "along",
        "periphery",
        "inquiry",
        "real",
        "being",
        "take",
        "one",
        "example",
        "even",
        "think",
        "void",
        "indeed",
        "even",
        "think",
        "impossible",
        "void",
        "think",
        "void",
        "merely",
        "reason",
        "find",
        "discussing",
        "void",
        "investigating",
        "characteristic",
        "space",
        "motion",
        "matter",
        "quantity",
        "may",
        "ask",
        "instance",
        "whether",
        "existence",
        "motion",
        "requires",
        "existence",
        "void",
        "even",
        "decide",
        "inquiry",
        "space",
        "motioncertainly",
        "appropriate",
        "topic",
        "inquiry",
        "metaphysicianhas",
        "led",
        "u",
        "consideration",
        "nonexisting",
        "void",
        "suárez",
        "s",
        "term",
        "inquiry",
        "being",
        "inevitably",
        "propels",
        "metaphysician",
        "consideration",
        "nonexisting",
        "being",
        "reason",
        "entia",
        "rationisthese",
        "nonbeingsrequire",
        "treatment",
        "student",
        "first",
        "striking",
        "suárez",
        "s",
        "treatment",
        "class",
        "entia",
        "rationis",
        "includes",
        "seeming",
        "motley",
        "case",
        "extending",
        "beyond",
        "nonexisting",
        "object",
        "thought",
        "reference",
        "beyond",
        "nonexistent",
        "final",
        "cause",
        "addition",
        "final",
        "cause",
        "student",
        "find",
        "confronted",
        "truesounding",
        "appeal",
        "phantasmagorical",
        "mythical",
        "beast",
        "creature",
        "fiction",
        "various",
        "sort",
        "even",
        "though",
        "subject",
        "vacuous",
        "reference",
        "pegasus",
        "winged",
        "horse",
        "importantly",
        "suárez",
        "countenance",
        "whole",
        "range",
        "nonbeings",
        "among",
        "entia",
        "rationis",
        "pedestrian",
        "creature",
        "fiction",
        "negation",
        "nothuman",
        "privation",
        "lack",
        "keyed",
        "positive",
        "property",
        "blindness",
        "also",
        "take",
        "mere",
        "logical",
        "abstraction",
        "consequent",
        "antecedent",
        "taxonomical",
        "category",
        "view",
        "general",
        "nominalism",
        "take",
        "mere",
        "metaphysical",
        "abstraction",
        "specie",
        "genus",
        "first",
        "thing",
        "notice",
        "list",
        "heterogeneity",
        "suárez",
        "interested",
        "group",
        "entity",
        "broadly",
        "conceived",
        "end",
        "metaphysical",
        "discourse",
        "even",
        "though",
        "exist",
        "note",
        "say",
        "entity",
        "exist",
        "strictly",
        "speaking",
        "fully",
        "really",
        "exist",
        "mind",
        "imagination",
        "instead",
        "insists",
        "exist",
        "even",
        "metaphysics",
        "physic",
        "speak",
        "genus",
        "specie",
        "logic",
        "antecedent",
        "consequence",
        "causation",
        "metaphysics",
        "broadly",
        "privation",
        "many",
        "walk",
        "life",
        "nonexistent",
        "entity",
        "often",
        "enough",
        "innocently",
        "imputing",
        "causal",
        "profile",
        "focusing",
        "last",
        "case",
        "case",
        "colorful",
        "captivating",
        "suárez",
        "argues",
        "fall",
        "metaphysician",
        "come",
        "term",
        "true",
        "sentence",
        "gryphon",
        "fierce",
        "gryphon",
        "exist",
        "even",
        "gryphon",
        "frightened",
        "child",
        "point",
        "began",
        "cry",
        "uncontrollably",
        "sentence",
        "true",
        "nothing",
        "one",
        "may",
        "talk",
        "think",
        "must",
        "case",
        "sentence",
        "accepted",
        "true",
        "perhaps",
        "one",
        "may",
        "think",
        "gryphon",
        "must",
        "exist",
        "way",
        "fierce",
        "said",
        "exist",
        "itthe",
        "thing",
        "speaker",
        "speakingmust",
        "exist",
        "one",
        "way",
        "implicated",
        "causal",
        "network",
        "certainly",
        "must",
        "existor",
        "else",
        "could",
        "stand",
        "causal",
        "relation",
        "anything",
        "indeed",
        "suárez",
        "give",
        "voice",
        "sort",
        "contention",
        "context",
        "example",
        "last",
        "observation",
        "perfectly",
        "reflected",
        "claim",
        "make",
        "necessary",
        "condition",
        "formal",
        "causation",
        "first",
        "requisite",
        "formal",
        "causation",
        "actual",
        "existence",
        "form",
        "prima",
        "est",
        "actualis",
        "existentia",
        "ipsius",
        "formae",
        "dm",
        "xv",
        "question",
        "being",
        "reason",
        "enter",
        "causal",
        "network",
        "fail",
        "first",
        "requirement",
        "cause",
        "exist",
        "first",
        "may",
        "seem",
        "suárez",
        "intends",
        "hold",
        "being",
        "reason",
        "fact",
        "mode",
        "existence",
        "perhaps",
        "sort",
        "subsistence",
        "mode",
        "short",
        "sort",
        "manifested",
        "call",
        "true",
        "real",
        "being",
        "instance",
        "contends",
        "being",
        "reason",
        "must",
        "granted",
        "dm",
        "xliv",
        "hastens",
        "add",
        "being",
        "neither",
        "true",
        "real",
        "being",
        "capable",
        "real",
        "true",
        "existence",
        "indeed",
        "true",
        "likeness",
        "real",
        "beings",
        "likeness",
        "term",
        "whose",
        "account",
        "would",
        "common",
        "concept",
        "dm",
        "xliv",
        "also",
        "insists",
        "fictitious",
        "thing",
        "being",
        "reason",
        "said",
        "endure",
        "truly",
        "properly",
        "exist",
        "dm",
        "l",
        "may",
        "seem",
        "mean",
        "contend",
        "exist",
        "though",
        "manner",
        "true",
        "real",
        "being",
        "insofar",
        "may",
        "said",
        "endure",
        "truly",
        "rather",
        "improperly",
        "however",
        "view",
        "entia",
        "rationis",
        "approach",
        "one",
        "way",
        "disarmingly",
        "simple",
        "insists",
        "exist",
        "shield",
        "b",
        "even",
        "maintains",
        "one",
        "may",
        "freely",
        "speak",
        "existed",
        "indeed",
        "fashioned",
        "apprehended",
        "truly",
        "existed",
        "conceived",
        "endured",
        "view",
        "fully",
        "objective",
        "even",
        "though",
        "reason",
        "nothing",
        "still",
        "necessarily",
        "supposes",
        "real",
        "founded",
        "whose",
        "denomination",
        "relation",
        "objective",
        "quasiresults",
        "quasi",
        "resultet",
        "therefore",
        "cause",
        "produced",
        "real",
        "cause",
        "reason",
        "dm",
        "liv",
        "picture",
        "being",
        "reason",
        "although",
        "exist",
        "one",
        "may",
        "speak",
        "think",
        "existed",
        "thinking",
        "question",
        "real",
        "existing",
        "formal",
        "structure",
        "mind",
        "actual",
        "thinker",
        "thinking",
        "way",
        "contentful",
        "founded",
        "real",
        "feature",
        "real",
        "thinker",
        "therefore",
        "take",
        "object",
        "one",
        "may",
        "think",
        "socrates",
        "one",
        "may",
        "think",
        "gryphon",
        "gryphon",
        "s",
        "thought",
        "however",
        "unlike",
        "socrates",
        "s",
        "thought",
        "extrinsic",
        "denomination",
        "gryphon",
        "socrates",
        "socrates",
        "gryphon",
        "gryphon",
        "say",
        "suárez",
        "formal",
        "structure",
        "thinker",
        "would",
        "indeed",
        "give",
        "rise",
        "extrinsic",
        "denomination",
        "le",
        "socrates",
        "s",
        "thought",
        "give",
        "rise",
        "feature",
        "still",
        "insists",
        "gryphon",
        "feature",
        "short",
        "content",
        "thought",
        "derives",
        "real",
        "formal",
        "structure",
        "mind",
        "thinker",
        "object",
        "hold",
        "fixed",
        "across",
        "episode",
        "thought",
        "thought",
        "something",
        "others",
        "nothing",
        "nothing",
        "insists",
        "suárez",
        "hardly",
        "robs",
        "contentfulness",
        "motion",
        "missed",
        "punch",
        "real",
        "motion",
        "motion",
        "missed",
        "kick",
        "neither",
        "make",
        "contact",
        "neither",
        "case",
        "something",
        "contacted",
        "something",
        "kicked",
        "punched",
        "contrary",
        "nothing",
        "kicked",
        "missed",
        "kick",
        "nothing",
        "punched",
        "missed",
        "punch",
        "way",
        "nothing",
        "thought",
        "referred",
        "object",
        "thought",
        "reference",
        "case",
        "causation",
        "involved",
        "eventuates",
        "reach",
        "actual",
        "formal",
        "structure",
        "actual",
        "mind",
        "efficient",
        "causation",
        "terminatedas",
        "terminus",
        "real",
        "productionat",
        "formal",
        "concept",
        "mind",
        "stop",
        "tota",
        "vero",
        "illa",
        "efficientia",
        "ut",
        "ad",
        "terminum",
        "realis",
        "productionis",
        "terminatur",
        "ad",
        "formalem",
        "conceptum",
        "ipsius",
        "mentis",
        "et",
        "ibi",
        "sistit",
        "dm",
        "liv",
        "taking",
        "together",
        "speak",
        "gryphon",
        "though",
        "gryphon",
        "spoken",
        "thinking",
        "case",
        "respect",
        "like",
        "thinking",
        "go",
        "one",
        "thinking",
        "socrates",
        "difference",
        "socrates",
        "come",
        "extrinsic",
        "denominationbeing",
        "thought",
        "swhereas",
        "gryphon",
        "exist",
        "acquire",
        "denomination",
        "extrinsic",
        "intrinsic",
        "nonetheless",
        "fact",
        "world",
        "gryphon",
        "would",
        "acquired",
        "denomination",
        "precisely",
        "actual",
        "person",
        "would",
        "relevant",
        "state",
        "thinking",
        "exactly",
        "hold",
        "true",
        "according",
        "suárez",
        "sort",
        "entia",
        "rationis",
        "countenance",
        "negation",
        "privation",
        "abstraction",
        "preclude",
        "thinking",
        "speaking",
        "way",
        "invests",
        "existence",
        "kind",
        "suárez",
        "insists",
        "entia",
        "rationis",
        "must",
        "granted",
        "even",
        "though",
        "lack",
        "true",
        "likeness",
        "real",
        "being",
        "dm",
        "liv"
    ]
}