{
    "main_text": "Three Views of Supererogation: Problems of Justification || Unqualified Supererogationism\n3.3 Unqualified Supererogationism\n\nImagine a world in which all morally good acts are also obligatory and\nin which individuals are capable of carrying out their duties with\nease (and with no conflict with their personal goals and aims). Is\nsomething of moral value missing in such a world? Both\nanti-supererogationists and qualified supererogationists would answer\nin the negative. Those who believe in the intrinsic value of\nsupererogatory conduct would disagree. What would be missing in such a\nworld is what Tertullian referred to as licentia, that\nspecial field of liberty, which allows human beings to exercise their\npower of moral choice. Even Kant, who suggests the ideal of the\nKingdom of Ends in which members of the moral community exercise their\nfree will (Wille) by the necessity of their nature, believes that\nimperfect moral creatures like us have a free choice (Willkür)\nbetween good and evil. In this discretionary power to adopt the moral\nlaw (or reject it) lies the particular value of morality, at least for\nhuman beings. Going beyond duty might be considered as a display of\nthis power of free choice. The pure or unqualified version of\nsupererogationism highlights the moral potential of good human action\nnot prescribed or commanded, imposed or demanded in any sense. In\nother words, supererogation is good, not only due to the promotion of\noverall value in the world (which would not be denied by the other two\nviews either), but also due to the kind of liberty in which it is\nperformed. If that is the case, then an inherent part of the value of\nsupererogation lies exactly in its lying beyond duty. The\nsupererogatory is something that is not required in any sense and its\nomission does not call for an appeal to a special permission,\nexemption or excuse.\n\nRather than argue that a supererogatory act is that which the agent is\npermitted not to do, the unqualified analysis argues that it\nis an option for the agent. Permissions, at least\n“strong permissions,” are given to people to act in a way\nwhich there is some reason not to, whereas options are the positive\ncounterparts of permissions. Options, as the etymology of the term\nattests, are actions the agent wishes to do, actions that\nseem to him good and worthy of choice. The point of supererogatory\naction lies, accordingly, in the good will of the agent, in his\naltruistic intention, in his choice to exercise generosity or to show\nforgiveness, to sacrifice himself or to do a little uncalled favor,\nrather than strictly adhering to his duty. Supererogatory action is a\nmatter of personal initiative; it is spontaneous (i.e. originating in\npersonal choice rather than in any external or universal demands). It\nallows for the expression of personal care or concern for another\nindividual and thus may either reflect a particular personal\nrelationship to another or create such a relationship. Supererogation\nis valuable because we believe that beyond the impersonal and\negalitarian social web created by the universal morality of duty,\nthere is space left for particular relationships that are not governed\nby the principles of justice and rights. From society’s point of\nview, leaving a separate space for supererogatory action may\nstrengthen mutual trust and communal bonds since it often indicates\nand promotes love and personal concern rather than mere respect for\npersons and a sense of justice. This view of supererogation locates it\nin the open-ended dimension of morality, that of ideals rather than\nprinciples, what Urmson calls “the higher flights of\nmorality” and Bergson “the morality of aspiration.”\nThe Talmud suggests this idea epigrammatically: “Jerusalem was\nonly destroyed because judgments were given strictly upon Biblical Law\nand did not go beyond the requirements of the law”.\n\nFurthermore, supererogation is closely related to the ideal of moral\nperfection. For the anti-supererogationist we are under a duty to do\nthe very best, to be perfect. But this may be a demand with which\npeople would not be always able to comply but a counter-productive\nexpectation which would lead to despair and constant fear of failure\n(Benn 2018a). Allowing space for the supererogatory enables human\nbeings to try to go beyond the required and towards perfection without\na sense of guilt and failure.\n\nThe justification of a principled (rather than pragmatic or\ncircumstantial) demarcation between duty and supererogation is\nreminiscent of the analogous demarcation between the legal and the\nmoral. Beyond the obvious reasons for avoiding the legal enforcement\nof all moral duties, many philosophers believe that part of the value\nof acting on one’s moral duty has to do with the intention to do\nthe right act, with acting for duty’s sake. This serves as a\nprincipled ground for leaving morality free from legal enforcement.\nSimilarly, unqualified supererogationists argue that the value of some\nvirtuous actions like giving and forgiving would be lost if these\nbecome morally obligatory, demands whose omission entails blame and\ncondemnation. The optional nature of supererogatory behavior is one\nstep beyond the Kantian-like freedom of acting from moral duty. The\nmoral non-enforcement of the supererogatory is analogous to the legal\nnon-enforcement of the moral.\n\nAll this leaves the question of the substantive demarcation of duty\nand supererogation unsettled. Those who deny the existence of\nsupererogation are not bothered by the issue. Those who explain it in\nterms of exemptions and excuses can appeal to cost-benefit analyses of\nthe enforcement of high standards of behavior on morally weak human\nbeings. But for those who ground supererogation in the intrinsic value\nof individual autonomy and altruistic intention, personal concern and\nthe expression of virtue, there are no easy criteria for establishing\nthe limits of duty and the space of the supererogatory. One method of\ndrawing this line is phenomenological, that is to say to proceed from\n“the inside of the agent” and her experience which attests\nto the difference between the sense of external requirement and the\nfree choice of the individual (Horgan and Timmons 2010). However\nadvocates of this method are fully aware that it can at most serve as\nan empirical support to the possibility of supererogation, but not as\nits philosophical justification.\n\nThe recent renewal of interest in virtue ethics led philosophers to\nexamine whether there is a place for supererogation in such\nvirtue-based theories. On the face of it, Aristotelian ethics cannot\naccommodate supererogation since it does not share the deontic\nconditions on which the idea of transcending duty is based. However,\nRoger Crisp argues that this view is based on a misreading of\nAristotle, for whom both doing the virtuous act (fitting the\ncircumstances) and being a virtuous person are obligatory. It is the\nduty of a virtuous person to become angry when it is fitting to feel\nso. Thus, Crisp is led to a sharp anti-supererogationist view. Since\nvirtue is itself a kind of excess, one cannot go beyond it (Crisp\n2013). But then, one may wonder, how would Aristotle (according to\nCrisp’s reading) evaluate the act of throwing oneself on a\nhand-grenade in order to save the lives of others? Aristotle should\neither judge it as plainly wrong, wasteful or unfitting (and hence\ncontrary to duty), or as “a noble” deed which is\nultimately self-serving, adding glory to the agent, even if only\nposthumously. This understanding of virtue ethics is extremely\ndemanding in comparison to theories which recognize the separate realm\nof the supererogatory. However, there are proponents of virtue ethics\nwho believe that supererogation is not only possible but can be\nanalyzed in Aristotelian terms (Stangl 2016).\n\nIt should be noted that in virtue-based ethics (for example\nAristotle’s) the demarcation issue becomes moot: supererogatory\ntranscendence of the demands of morality does not play a major role\nsince ethical norms do not consist of well-defined moral duties with\nwhich supererogation is correlated. There are contemporary attempts to\nanalyze supererogation in terms of virtue (Kawall 2009), but they seem\nto fall into circularity: if the supererogatory is defined as what the\n(idealized) perfectly virtuous person would judge to be so, we still\nhave to decide, independently of a theory of supererogation, who this\nideal moral agent is. The ideal of virtue is therefore not very\nhelpful in providing us with criteria for supererogation and for its\ndemarcation from duty.\n\nThirty years after publishing his ground-breaking article\n“Saints and Heroes”, J. O. Urmson (1988) expressed regret\nfor having introduced the theological term\n“supererogation” into moral philosophy since he reached\nthe conclusion that it only replaced “the old over-simple\ntrichotomy” with “a new over-simple tetrachotomy”.\nThis change of heart for the philosopher most associated with the\nmodern revival of the debate on supererogation is striking. His late\nview cannot, however, be categorized as anti-supererogationist since\nhe does not deny the special moral value of saintly and heroic actions\nwhich are by no way obligatory. Yet, he wishes “to\ndissociate” himself from using the concept of supererogation as\na “blanket-term” which covers both saintly and heroic acts\nand acts of considerateness, decency, chivalry and self-denial. Urmson\nbelieves that these kinds of actions are too heterogeneous to be\ntreated under a distinct category in moral theory. The response to\nUrmson’s (self) critique is that the less dramatic cases of\n“non-obligatory well doings” are a significant challenge\nto deontological theory no less than the rare acts of extraordinary\nsacrifice and altruism. At least this seems to be the assumption in\nmost of the literature on the subject following Urmson’s\nretraction.\n\nThere is no knockout argument for any of the three views of\nsupererogation. The relative merits and defects in each have to do\nwith the kind of definition of the supererogatory as well as with some\nfundamental beliefs about the nature of morality and the source of\nmoral value. However, a more “local,” less abstract,\ndiscussion of paradigm examples of supererogatory action may be of\nhelp in the overall assessment of the three views.\n",
    "section_title": "3.3 Unqualified Supererogationism",
    "entry_title": "Supererogation",
    "hierarchy_title": "Supererogation || Three Views of Supererogation: Problems of Justification || Unqualified Supererogationism",
    "tokenized_text": [
        "three",
        "view",
        "supererogation",
        "problem",
        "justification",
        "unqualified",
        "supererogationism",
        "unqualified",
        "supererogationism",
        "imagine",
        "world",
        "morally",
        "good",
        "act",
        "also",
        "obligatory",
        "individual",
        "capable",
        "carrying",
        "duty",
        "ease",
        "conflict",
        "personal",
        "goal",
        "aim",
        "something",
        "moral",
        "value",
        "missing",
        "world",
        "antisupererogationists",
        "qualified",
        "supererogationists",
        "would",
        "answer",
        "negative",
        "believe",
        "intrinsic",
        "value",
        "supererogatory",
        "conduct",
        "would",
        "disagree",
        "would",
        "missing",
        "world",
        "tertullian",
        "referred",
        "licentia",
        "special",
        "field",
        "liberty",
        "allows",
        "human",
        "being",
        "exercise",
        "power",
        "moral",
        "choice",
        "even",
        "kant",
        "suggests",
        "ideal",
        "kingdom",
        "end",
        "member",
        "moral",
        "community",
        "exercise",
        "free",
        "wille",
        "necessity",
        "nature",
        "belief",
        "imperfect",
        "moral",
        "creature",
        "like",
        "u",
        "free",
        "choice",
        "willkür",
        "good",
        "evil",
        "discretionary",
        "power",
        "adopt",
        "moral",
        "law",
        "reject",
        "lie",
        "particular",
        "value",
        "morality",
        "least",
        "human",
        "being",
        "going",
        "beyond",
        "duty",
        "might",
        "considered",
        "display",
        "power",
        "free",
        "choice",
        "pure",
        "unqualified",
        "version",
        "supererogationism",
        "highlight",
        "moral",
        "potential",
        "good",
        "human",
        "action",
        "prescribed",
        "commanded",
        "imposed",
        "demanded",
        "sense",
        "word",
        "supererogation",
        "good",
        "due",
        "promotion",
        "overall",
        "value",
        "world",
        "would",
        "denied",
        "two",
        "view",
        "either",
        "also",
        "due",
        "kind",
        "liberty",
        "performed",
        "case",
        "inherent",
        "part",
        "value",
        "supererogation",
        "lie",
        "exactly",
        "lying",
        "beyond",
        "duty",
        "supererogatory",
        "something",
        "required",
        "sense",
        "omission",
        "call",
        "appeal",
        "special",
        "permission",
        "exemption",
        "excuse",
        "rather",
        "argue",
        "supererogatory",
        "act",
        "agent",
        "permitted",
        "unqualified",
        "analysis",
        "argues",
        "option",
        "agent",
        "permission",
        "least",
        "strong",
        "permission",
        "given",
        "people",
        "act",
        "way",
        "reason",
        "whereas",
        "option",
        "positive",
        "counterpart",
        "permission",
        "option",
        "etymology",
        "term",
        "attests",
        "action",
        "agent",
        "wish",
        "action",
        "seem",
        "good",
        "worthy",
        "choice",
        "point",
        "supererogatory",
        "action",
        "lie",
        "accordingly",
        "good",
        "agent",
        "altruistic",
        "intention",
        "choice",
        "exercise",
        "generosity",
        "show",
        "forgiveness",
        "sacrifice",
        "little",
        "uncalled",
        "favor",
        "rather",
        "strictly",
        "adhering",
        "duty",
        "supererogatory",
        "action",
        "matter",
        "personal",
        "initiative",
        "spontaneous",
        "ie",
        "originating",
        "personal",
        "choice",
        "rather",
        "external",
        "universal",
        "demand",
        "allows",
        "expression",
        "personal",
        "care",
        "concern",
        "another",
        "individual",
        "thus",
        "may",
        "either",
        "reflect",
        "particular",
        "personal",
        "relationship",
        "another",
        "create",
        "relationship",
        "supererogation",
        "valuable",
        "believe",
        "beyond",
        "impersonal",
        "egalitarian",
        "social",
        "web",
        "created",
        "universal",
        "morality",
        "duty",
        "space",
        "left",
        "particular",
        "relationship",
        "governed",
        "principle",
        "justice",
        "right",
        "society",
        "point",
        "view",
        "leaving",
        "separate",
        "space",
        "supererogatory",
        "action",
        "may",
        "strengthen",
        "mutual",
        "trust",
        "communal",
        "bond",
        "since",
        "often",
        "indicates",
        "promotes",
        "love",
        "personal",
        "concern",
        "rather",
        "mere",
        "respect",
        "person",
        "sense",
        "justice",
        "view",
        "supererogation",
        "locates",
        "openended",
        "dimension",
        "morality",
        "ideal",
        "rather",
        "principle",
        "urmson",
        "call",
        "higher",
        "flight",
        "morality",
        "bergson",
        "morality",
        "aspiration",
        "talmud",
        "suggests",
        "idea",
        "epigrammatically",
        "jerusalem",
        "destroyed",
        "judgment",
        "given",
        "strictly",
        "upon",
        "biblical",
        "law",
        "go",
        "beyond",
        "requirement",
        "law",
        "furthermore",
        "supererogation",
        "closely",
        "related",
        "ideal",
        "moral",
        "perfection",
        "antisupererogationist",
        "duty",
        "best",
        "perfect",
        "may",
        "demand",
        "people",
        "would",
        "always",
        "able",
        "comply",
        "counterproductive",
        "expectation",
        "would",
        "lead",
        "despair",
        "constant",
        "fear",
        "failure",
        "benn",
        "a",
        "allowing",
        "space",
        "supererogatory",
        "enables",
        "human",
        "being",
        "try",
        "go",
        "beyond",
        "required",
        "towards",
        "perfection",
        "without",
        "sense",
        "guilt",
        "failure",
        "justification",
        "principled",
        "rather",
        "pragmatic",
        "circumstantial",
        "demarcation",
        "duty",
        "supererogation",
        "reminiscent",
        "analogous",
        "demarcation",
        "legal",
        "moral",
        "beyond",
        "obvious",
        "reason",
        "avoiding",
        "legal",
        "enforcement",
        "moral",
        "duty",
        "many",
        "philosopher",
        "believe",
        "part",
        "value",
        "acting",
        "one",
        "moral",
        "duty",
        "intention",
        "right",
        "act",
        "acting",
        "duty",
        "sake",
        "serf",
        "principled",
        "ground",
        "leaving",
        "morality",
        "free",
        "legal",
        "enforcement",
        "similarly",
        "unqualified",
        "supererogationists",
        "argue",
        "value",
        "virtuous",
        "action",
        "like",
        "giving",
        "forgiving",
        "would",
        "lost",
        "become",
        "morally",
        "obligatory",
        "demand",
        "whose",
        "omission",
        "entail",
        "blame",
        "condemnation",
        "optional",
        "nature",
        "supererogatory",
        "behavior",
        "one",
        "step",
        "beyond",
        "kantianlike",
        "freedom",
        "acting",
        "moral",
        "duty",
        "moral",
        "nonenforcement",
        "supererogatory",
        "analogous",
        "legal",
        "nonenforcement",
        "moral",
        "leaf",
        "question",
        "substantive",
        "demarcation",
        "duty",
        "supererogation",
        "unsettled",
        "deny",
        "existence",
        "supererogation",
        "bothered",
        "issue",
        "explain",
        "term",
        "exemption",
        "excuse",
        "appeal",
        "costbenefit",
        "analysis",
        "enforcement",
        "high",
        "standard",
        "behavior",
        "morally",
        "weak",
        "human",
        "being",
        "ground",
        "supererogation",
        "intrinsic",
        "value",
        "individual",
        "autonomy",
        "altruistic",
        "intention",
        "personal",
        "concern",
        "expression",
        "virtue",
        "easy",
        "criterion",
        "establishing",
        "limit",
        "duty",
        "space",
        "supererogatory",
        "one",
        "method",
        "drawing",
        "line",
        "phenomenological",
        "say",
        "proceed",
        "inside",
        "agent",
        "experience",
        "attests",
        "difference",
        "sense",
        "external",
        "requirement",
        "free",
        "choice",
        "individual",
        "horgan",
        "timmons",
        "however",
        "advocate",
        "method",
        "fully",
        "aware",
        "serve",
        "empirical",
        "support",
        "possibility",
        "supererogation",
        "philosophical",
        "justification",
        "recent",
        "renewal",
        "interest",
        "virtue",
        "ethic",
        "led",
        "philosopher",
        "examine",
        "whether",
        "place",
        "supererogation",
        "virtuebased",
        "theory",
        "face",
        "aristotelian",
        "ethic",
        "accommodate",
        "supererogation",
        "since",
        "share",
        "deontic",
        "condition",
        "idea",
        "transcending",
        "duty",
        "based",
        "however",
        "roger",
        "crisp",
        "argues",
        "view",
        "based",
        "misreading",
        "aristotle",
        "virtuous",
        "act",
        "fitting",
        "circumstance",
        "virtuous",
        "person",
        "obligatory",
        "duty",
        "virtuous",
        "person",
        "become",
        "angry",
        "fitting",
        "feel",
        "thus",
        "crisp",
        "led",
        "sharp",
        "antisupererogationist",
        "view",
        "since",
        "virtue",
        "kind",
        "excess",
        "one",
        "go",
        "beyond",
        "crisp",
        "one",
        "may",
        "wonder",
        "would",
        "aristotle",
        "according",
        "crisp",
        "reading",
        "evaluate",
        "act",
        "throwing",
        "oneself",
        "handgrenade",
        "order",
        "save",
        "life",
        "others",
        "aristotle",
        "either",
        "judge",
        "plainly",
        "wrong",
        "wasteful",
        "unfitting",
        "hence",
        "contrary",
        "duty",
        "noble",
        "deed",
        "ultimately",
        "selfserving",
        "adding",
        "glory",
        "agent",
        "even",
        "posthumously",
        "understanding",
        "virtue",
        "ethic",
        "extremely",
        "demanding",
        "comparison",
        "theory",
        "recognize",
        "separate",
        "realm",
        "supererogatory",
        "however",
        "proponent",
        "virtue",
        "ethic",
        "believe",
        "supererogation",
        "possible",
        "analyzed",
        "aristotelian",
        "term",
        "stangl",
        "noted",
        "virtuebased",
        "ethic",
        "example",
        "aristotle",
        "demarcation",
        "issue",
        "becomes",
        "moot",
        "supererogatory",
        "transcendence",
        "demand",
        "morality",
        "play",
        "major",
        "role",
        "since",
        "ethical",
        "norm",
        "consist",
        "welldefined",
        "moral",
        "duty",
        "supererogation",
        "correlated",
        "contemporary",
        "attempt",
        "analyze",
        "supererogation",
        "term",
        "virtue",
        "kawall",
        "seem",
        "fall",
        "circularity",
        "supererogatory",
        "defined",
        "idealized",
        "perfectly",
        "virtuous",
        "person",
        "would",
        "judge",
        "still",
        "decide",
        "independently",
        "theory",
        "supererogation",
        "ideal",
        "moral",
        "agent",
        "ideal",
        "virtue",
        "therefore",
        "helpful",
        "providing",
        "u",
        "criterion",
        "supererogation",
        "demarcation",
        "duty",
        "thirty",
        "year",
        "publishing",
        "groundbreaking",
        "article",
        "saint",
        "hero",
        "j",
        "o",
        "urmson",
        "expressed",
        "regret",
        "introduced",
        "theological",
        "term",
        "supererogation",
        "moral",
        "philosophy",
        "since",
        "reached",
        "conclusion",
        "replaced",
        "old",
        "oversimple",
        "trichotomy",
        "new",
        "oversimple",
        "tetrachotomy",
        "change",
        "heart",
        "philosopher",
        "associated",
        "modern",
        "revival",
        "debate",
        "supererogation",
        "striking",
        "late",
        "view",
        "however",
        "categorized",
        "antisupererogationist",
        "since",
        "deny",
        "special",
        "moral",
        "value",
        "saintly",
        "heroic",
        "action",
        "way",
        "obligatory",
        "yet",
        "wish",
        "dissociate",
        "using",
        "concept",
        "supererogation",
        "blanketterm",
        "cover",
        "saintly",
        "heroic",
        "act",
        "act",
        "considerateness",
        "decency",
        "chivalry",
        "selfdenial",
        "urmson",
        "belief",
        "kind",
        "action",
        "heterogeneous",
        "treated",
        "distinct",
        "category",
        "moral",
        "theory",
        "response",
        "urmson",
        "self",
        "critique",
        "le",
        "dramatic",
        "case",
        "nonobligatory",
        "well",
        "doings",
        "significant",
        "challenge",
        "deontological",
        "theory",
        "le",
        "rare",
        "act",
        "extraordinary",
        "sacrifice",
        "altruism",
        "least",
        "seems",
        "assumption",
        "literature",
        "subject",
        "following",
        "urmson",
        "retraction",
        "knockout",
        "argument",
        "three",
        "view",
        "supererogation",
        "relative",
        "merit",
        "defect",
        "kind",
        "definition",
        "supererogatory",
        "well",
        "fundamental",
        "belief",
        "nature",
        "morality",
        "source",
        "moral",
        "value",
        "however",
        "local",
        "le",
        "abstract",
        "discussion",
        "paradigm",
        "example",
        "supererogatory",
        "action",
        "may",
        "help",
        "overall",
        "assessment",
        "three",
        "view"
    ]
}