{
    "main_text": "Of the Meaning of Love\n4. Of the Meaning of Love\n\nVom Sinn der Liebe (Of the Meaning of Love, 1912)\nmarks Susman’s debut as a philosopher. With this monograph,\nSusman enters a field of inquiry hitherto exclusively reserved to men;\nshe responds to this challenge by making love the central subject of\nher investigation. Articulating a metaphysical discourse of her own,\nshe highlights lacunae left by a philosophical discourse determined by\nmale sensitivities. In his essay “The Relative and the Absolute\nin the Problem of the Sexes” (1911), Simmel had, just a year\nearlier, analyzed the predicament of the discursive silencing of\nwomen, going so far as to cast the understanding of women’s\nconcerns as a sheer cognitive impossibility for the male world (Simmel\n1911 [2001 and 1984]). A theory and metaphysics of love, he noted two\nyears later, in “The Problem of Fate” (1913), shortly\nafter the publication of Susman’s monograph, was “just as\nimportant as the theory of knowledge and the metaphysics of\nart”. There, Simmel had wondered where except in the one-sided\nattempts by Plato and Schopenhauer philosophy had in earnest discussed\nthe question of what is love (Simmel 1913 [2001: 483 and 2007: 78]).\nThe dedication of Susman’s book to Simmel’s wife Gertrud\nfurther highlights the philosophical affinity with Simmel and his\nwife. By taking a subject traditionally deemed a women’s issue\nseriously and attending to it in a philosophically comprehensive\nmanner, Susman took charge of a subject that since Augustine had been\nrelegated to the domain of theology and since Kant had become a matter\nof moral philosophy. Neither Kierkegaard nor Nietzsche changed much\nwhen they continued to theorize love from a purely male-defined\nperspective.\n\nSusman’s book presents a critical intervention that shows that\nlove is not just a fundamental, formative force in human life but\ndeserves comprehensive theoretical attention. In making love the\nsubject of, and prism for, philosophical exploration, Susman\nreimagines philosophical discourse as a more inclusive practice of\nthinking which opens direct lines of inquiry into the exigencies and\nexistential sensibilities of the time. Inspired by the new forms of\nphilosophical investigations initiated by Simmel and Henri Bergson,\nwhose German translation of Introduction to Metaphysics by\nSusman was published in 1909 by arrangement of Simmel, Susman argues\nthe exploration of the question of the status of women and gender must\nbe metaphysically central to, or constitutive of, a philosophy that\nwishes to live up to the claim of inclusive universalism.\n\nIn Part 1, Susman highlights how love is not only a force that arises\nfrom the individual but the power that produces the individual in the\nfirst place.\n\n\nLove arises from life’s great darkness as the longing for form,\na longing that forces ever higher forms up to the human individual in\nwhich it experiences its victory over death, leading beyond life into\neternity. (1912: 20)\n\n\nEmbedded in the dynamics of the forces of life, love is a primordial\nlife force that precedes but also informs the process of\nindividuation. It defies conceptual grasp as its roots reach deeper\nthan the sphere of the mind. While love eludes the firm grasp of the\nconcept, it opens our eyes to the profound alterity of the other. Love\nand alterity are intimately intertwined and produce aporetic tension:\nHow to reconcile alterity, construed as a condition for love, with the\ndesire for union? Susman describes the paradoxical nature of love this\nway:\n\n\nLove is to suffer being Other [Anderssein] and to more\nprofoundly suffer being One [Einssein]—and its eternal\ndemand is to reconcile the being Other with the being One. (1912:\n33)\n\n\nThe very union of souls would destroy precisely the individuation that\nmakes each the love object of the other (1912: 45). Love\n\n\ncan never grasp the essence of the Other because their essence cannot\nbe experienced under the category of form. Where there is essence\nthere is form no longer. (1912: 44)\n\n\nAs a result, the You emerges as that which remains out of reach (1912:\n51f.). Love can only approximately represent the Other through\nsymbolizations that reflect the Other’s life and actions. The\nincommensurability of the You, moreover, is what facilitates our\nindividuation. All of this implies that love is not in itself an\nultimate answer to anything, but it is the relationship that can\neither confuse or clarify our relationship with everything. Even the\ndeepest kind of love cannot provide us with the ultimate meaning of\nour lives, but love is what makes the meaning of our lives legible\n(1912: 49). Susman’s ideas presciently articulate critical\nconcerns that return in the work of Buber and Levinas. Buber’s\nI and Thou (1923) offers a strikingly similar description of\nthe deep paradoxical structure of the otherness of self and other\nwhile Levinas’s insistence on the unbridgeable difference\nbetween myself and a structure of alterity constitutive for human\nexistence shares its metaphysical and phenomenological concerns with\nSusman.\n\nIn Part 2 of the book, Susman plumbs the tragic dimension of love that\nin modern life assumes a new form. No longer “the pure tragic of\nan incursion of an absolute into life” that it had been taken to\nbe in the past, the tragedy of love in the modern world consists in\nthe fact that the very force of love for the singular drives object\nand desire increasingly further apart (1912: 81):\n\n\nOnly in infinity are the parallel ascending flames permitted to touch\neach other—there where they no longer feel each other. (1912:\n82)\n\n\nWhile Tristan and Isolde, who together constitute the purest prototype\nof the past’s conception of love, are a reminder of love’s\nabsolute and all-consuming power, the individuated, modern soul\nsuffers from the metaphysical loneliness that love so painfully\ninflicts (1912: 83).\n\nBesides this individuating aspect of love, there is love’s\nsexual aspect (geschlechtliche Bestimmtheit, 1912: 84), which\nSusman explores in Part 3. An appreciation of the nexus between love\nand sexuality is fundamental for a deeper understanding of the human\ncondition. The notion of das Geschlechtliche includes,\nbesides sexuality, with its sensual, affective, and animal aspects,\nall that exists and drives us while remaining below the threshold of\nconsciousness: everything which exceeds the life of the conscious mind\nand even that which extends to the depths of the conditions of life\nand its reproductive arrangements:\n\n\nIn the duality of its sexuality (das Geschlecht) the human\nbeing, to whom life serves, had to become subject to life. (1912:\n87)\n\n\nHumanity’s attempts at denial and suppression through askesis\nhave only highlighted the fundamental inseparability of\nGeschlecht and love (1912: 93).\n\nPart 4 examines how the difference of Geschlecht sets the\nsexes apart in more ways than simply with regard to sexuality. As\nSusman argues, this difference is rooted in the depths of the\n“blind life’s” interference with individual life\n(1912: 105). The law of begetting and birthing structures the lives of\nmen and women in profoundly different ways. Man’s relation to\nobjectivity and tendency to posit values above and beyond himself,\nSusman suggests, is oriented to the outside, or what stands apart. Man\nas a creating, constructing being is outside-oriented, while woman\nreturns to herself, taking the world back into herself. Motherhood and\nher maternal dimension structure how woman relates to the world,\ndefining both genders in ways that complement each other. Susman,\nherself a young mother who had given birth to her son Erwin in 1907,\nhighlights the limitations of both genders which set them apart from\none another. The world according to man, she argues, requires a\nradical rethinking from woman’s perspective. Unlike romantic\naccounts of birth-giving and motherhood that celebrate human\nreproduction as a higher transcendental goal while reinforcing\nconventional patterns of gender roles, Susman’s does not suggest\nthat woman has a more direct and immediate link to life and reality.\nShe has neither an ontological advantage over man, nor an ontological\ndisadvantage: the difference between men and women is just that:\nalterity rather than one-sided inadequacy.\n\nWomen, then, have no less access to the metaphysical than men, though\nthe kind of access they have is distinct: it is different from and\ncomplements, rather than falls short of, the access that men have.\nSusman suggests that, for better or for worse, both sexes depend on\neach other in every aspect of their existence. Their relationship is\nthus based on a reciprocally complementary difference whose divisive\nforce makes the experience of love profoundly different for each.\nWhile the act of love might unite them, birth not only forms the new\nunit of a family but causes differences between woman and man to\nproliferate.\n\nAs Susman notes, rather than an unproblematic dyad of mother and\nchild, the woman finds in pregnancy and birth “the Other, the\nAlien, Life” (1912: 109). Rather than pure bliss, motherhood is\na difficult and conflicted experience: the woman finds her life\nentangled with another being’s life, but, once she gives birth,\nthis life is no longer hers but one she has to allow to be its own\n(1912: 110). Susman argues a resolute departure from a\nChristian-inflected discourse on birthing, motherhood, and family. Her\nmove to demythologize motherhood and expose the strange and\nchallenging experiences that come with it discards the theologically\ncommitted register of sacredness and transcendence, replacing it with\na metaphysics of life that is pointedly immanent. Her disenchanted\napproach to motherhood, which operates as a critique of traditional\nnotions of gender roles, resonates with Derrida’s exposure of\nthe assumed wholesomeness and sanctity of the mother-child relation as\nprofoundly problematic (Derrida, Circumfessions).\n\nWhile man’s life, akin to a Promethean seeker and bringer of\nlight, involves creation and a kind of destruction that respects no\nform, woman’s life is, in keeping with her nature, embedded in\nthe world of matter and becoming; her destiny forms her as\nlife’s immediate hold on her asserts its power. Man, on the\nother hand, is, in keeping with his nature, intractable to the\nprocesses of life (1912: 115). Contra the intellectuality of past\nperiods that consistently excluded women from producing culture (1912:\n122), and in spite of seeming to position women beyond the cultural by\naligning them with the world of nature, matter, and becoming, Susman\nreclaims for women a life of the mind of their own, one that does not\nsubmit to and that is not assimilated by the male world. “In a\nculture built by men but realized and maintained by women”\n(1912: 125), the destiny of women cannot be to submit “as slave\nwhere she is supposed to be helping mother” (1912: 124). For, in\na world where women are subject to men, they cannot realize the\nmission of their particular calling (1912: 128).\n\nIt is in art, this part of the book concludes, that love is given the\nclarity of expression to which life can only aspire. It is art’s\npower of symbolization that is able to give form to the reconciliation\nof love and the “dark dynamics of matter to which we are\nbound”, a reconciliation completed through life itself (1912:\n129):\n\n\nWhere religion and philosophy have failed us, where they both have\nlost grasp of this dark, confused matter as something alien art alone\nhas shown us a fluctuating, quivering image of a possible\nreconciliation and exaltation. (1912: 136)\n\n\nIt is this image of love that guides us as we look for a way of\nresolving the profound tension that informs our existence. Through\nart’s mediation, we can achieve what religion and philosophy\ncannot: we can\n\n\nthink that man and woman unite in an enhanced life in order to create\na culture that can only come into being by both grasping themselves\nand each other and what can become of both together. (1912: 137)\n\n\nAchieving this, Susman argues, will involve renegotiating rather than\ndestroying what separates men and women. She articulates this vision\nof humanity as one in which both women and men become more human; the\nculture that emerges from this humanity will be “completely\ndoubly gendered (zwiegeschlechtlich)” (1912: 137).\n\nGenuine love, Susman concludes, is only symbolized in the love of an\nindividual which points to the greater human destiny of love as the\nbond that sustains humanity as a whole; love in this sense of the word\nrequires the full and undiminished participation of women in their\nirreducible individuality. Susman’s book thus argues that\nphilosophy can no longer afford to exclude women as philosophers from\nits discourse because women bring to thought what men are not able to\naddress, demonstrating in the process how such inclusion contributes\nto a genuine advance in philosophy. As feminist discourse becomes\nestablished in the wake of World War I, Susman’s approach to the\nissue of the status of women continues to develop. The issue of the\nrelation between the genders remains one of the two focal points of\nher critical agenda, the other one being the question of the place of\nJewish thought and tradition in modernity.\n",
    "section_title": "4. Of the Meaning of Love",
    "entry_title": "Margarete Susman",
    "hierarchy_title": "Margarete Susman || Of the Meaning of Love",
    "tokenized_text": [
        "meaning",
        "love",
        "meaning",
        "love",
        "vom",
        "sinn",
        "der",
        "liebe",
        "meaning",
        "love",
        "mark",
        "susman",
        "debut",
        "philosopher",
        "monograph",
        "susman",
        "enters",
        "field",
        "inquiry",
        "hitherto",
        "exclusively",
        "reserved",
        "men",
        "responds",
        "challenge",
        "making",
        "love",
        "central",
        "subject",
        "investigation",
        "articulating",
        "metaphysical",
        "discourse",
        "highlight",
        "lacuna",
        "left",
        "philosophical",
        "discourse",
        "determined",
        "male",
        "sensitivity",
        "essay",
        "relative",
        "absolute",
        "problem",
        "sex",
        "simmel",
        "year",
        "earlier",
        "analyzed",
        "predicament",
        "discursive",
        "silencing",
        "woman",
        "going",
        "far",
        "cast",
        "understanding",
        "woman",
        "concern",
        "sheer",
        "cognitive",
        "impossibility",
        "male",
        "world",
        "simmel",
        "theory",
        "metaphysics",
        "love",
        "noted",
        "two",
        "year",
        "later",
        "problem",
        "fate",
        "shortly",
        "publication",
        "susman",
        "monograph",
        "important",
        "theory",
        "knowledge",
        "metaphysics",
        "art",
        "simmel",
        "wondered",
        "except",
        "onesided",
        "attempt",
        "plato",
        "schopenhauer",
        "philosophy",
        "earnest",
        "discussed",
        "question",
        "love",
        "simmel",
        "dedication",
        "susman",
        "book",
        "simmel",
        "wife",
        "gertrud",
        "highlight",
        "philosophical",
        "affinity",
        "simmel",
        "wife",
        "taking",
        "subject",
        "traditionally",
        "deemed",
        "woman",
        "issue",
        "seriously",
        "attending",
        "philosophically",
        "comprehensive",
        "manner",
        "susman",
        "took",
        "charge",
        "subject",
        "since",
        "augustine",
        "relegated",
        "domain",
        "theology",
        "since",
        "kant",
        "become",
        "matter",
        "moral",
        "philosophy",
        "neither",
        "kierkegaard",
        "nietzsche",
        "changed",
        "much",
        "continued",
        "theorize",
        "love",
        "purely",
        "maledefined",
        "perspective",
        "susman",
        "book",
        "present",
        "critical",
        "intervention",
        "show",
        "love",
        "fundamental",
        "formative",
        "force",
        "human",
        "life",
        "deserves",
        "comprehensive",
        "theoretical",
        "attention",
        "making",
        "love",
        "subject",
        "prism",
        "philosophical",
        "exploration",
        "susman",
        "reimagines",
        "philosophical",
        "discourse",
        "inclusive",
        "practice",
        "thinking",
        "open",
        "direct",
        "line",
        "inquiry",
        "exigency",
        "existential",
        "sensibility",
        "time",
        "inspired",
        "new",
        "form",
        "philosophical",
        "investigation",
        "initiated",
        "simmel",
        "henri",
        "bergson",
        "whose",
        "german",
        "translation",
        "introduction",
        "metaphysics",
        "susman",
        "published",
        "arrangement",
        "simmel",
        "susman",
        "argues",
        "exploration",
        "question",
        "status",
        "woman",
        "gender",
        "must",
        "metaphysically",
        "central",
        "constitutive",
        "philosophy",
        "wish",
        "live",
        "claim",
        "inclusive",
        "universalism",
        "part",
        "susman",
        "highlight",
        "love",
        "force",
        "arises",
        "individual",
        "power",
        "produce",
        "individual",
        "first",
        "place",
        "love",
        "arises",
        "life",
        "great",
        "darkness",
        "longing",
        "form",
        "longing",
        "force",
        "ever",
        "higher",
        "form",
        "human",
        "individual",
        "experience",
        "victory",
        "death",
        "leading",
        "beyond",
        "life",
        "eternity",
        "embedded",
        "dynamic",
        "force",
        "life",
        "love",
        "primordial",
        "life",
        "force",
        "precedes",
        "also",
        "informs",
        "process",
        "individuation",
        "defies",
        "conceptual",
        "grasp",
        "root",
        "reach",
        "deeper",
        "sphere",
        "mind",
        "love",
        "eludes",
        "firm",
        "grasp",
        "concept",
        "open",
        "eye",
        "profound",
        "alterity",
        "love",
        "alterity",
        "intimately",
        "intertwined",
        "produce",
        "aporetic",
        "tension",
        "reconcile",
        "alterity",
        "construed",
        "condition",
        "love",
        "desire",
        "union",
        "susman",
        "describes",
        "paradoxical",
        "nature",
        "love",
        "way",
        "love",
        "suffer",
        "anderssein",
        "profoundly",
        "suffer",
        "one",
        "einssein",
        "and",
        "eternal",
        "demand",
        "reconcile",
        "one",
        "union",
        "soul",
        "would",
        "destroy",
        "precisely",
        "individuation",
        "make",
        "love",
        "object",
        "love",
        "never",
        "grasp",
        "essence",
        "essence",
        "experienced",
        "category",
        "form",
        "essence",
        "form",
        "longer",
        "result",
        "emerges",
        "remains",
        "reach",
        "f",
        "love",
        "approximately",
        "represent",
        "symbolization",
        "reflect",
        "life",
        "action",
        "incommensurability",
        "moreover",
        "facilitates",
        "individuation",
        "implies",
        "love",
        "ultimate",
        "answer",
        "anything",
        "relationship",
        "either",
        "confuse",
        "clarify",
        "relationship",
        "everything",
        "even",
        "deepest",
        "kind",
        "love",
        "provide",
        "u",
        "ultimate",
        "meaning",
        "life",
        "love",
        "make",
        "meaning",
        "life",
        "legible",
        "susman",
        "idea",
        "presciently",
        "articulate",
        "critical",
        "concern",
        "return",
        "work",
        "buber",
        "levinas",
        "buber",
        "thou",
        "offer",
        "strikingly",
        "similar",
        "description",
        "deep",
        "paradoxical",
        "structure",
        "otherness",
        "self",
        "levinas",
        "insistence",
        "unbridgeable",
        "difference",
        "structure",
        "alterity",
        "constitutive",
        "human",
        "existence",
        "share",
        "metaphysical",
        "phenomenological",
        "concern",
        "susman",
        "part",
        "book",
        "susman",
        "plumb",
        "tragic",
        "dimension",
        "love",
        "modern",
        "life",
        "assumes",
        "new",
        "form",
        "longer",
        "pure",
        "tragic",
        "incursion",
        "absolute",
        "life",
        "taken",
        "past",
        "tragedy",
        "love",
        "modern",
        "world",
        "consists",
        "fact",
        "force",
        "love",
        "singular",
        "drive",
        "object",
        "desire",
        "increasingly",
        "apart",
        "infinity",
        "parallel",
        "ascending",
        "flame",
        "permitted",
        "touch",
        "otherthere",
        "longer",
        "feel",
        "tristan",
        "isolde",
        "together",
        "constitute",
        "purest",
        "prototype",
        "past",
        "conception",
        "love",
        "reminder",
        "love",
        "absolute",
        "allconsuming",
        "power",
        "individuated",
        "modern",
        "soul",
        "suffers",
        "metaphysical",
        "loneliness",
        "love",
        "painfully",
        "inflicts",
        "besides",
        "individuating",
        "aspect",
        "love",
        "love",
        "sexual",
        "aspect",
        "geschlechtliche",
        "bestimmtheit",
        "susman",
        "explores",
        "part",
        "appreciation",
        "nexus",
        "love",
        "sexuality",
        "fundamental",
        "deeper",
        "understanding",
        "human",
        "condition",
        "notion",
        "da",
        "geschlechtliche",
        "includes",
        "besides",
        "sexuality",
        "sensual",
        "affective",
        "animal",
        "aspect",
        "exists",
        "drive",
        "u",
        "remaining",
        "threshold",
        "consciousness",
        "everything",
        "exceeds",
        "life",
        "conscious",
        "mind",
        "even",
        "extends",
        "depth",
        "condition",
        "life",
        "reproductive",
        "arrangement",
        "duality",
        "sexuality",
        "da",
        "geschlecht",
        "human",
        "life",
        "serf",
        "become",
        "subject",
        "life",
        "humanity",
        "attempt",
        "denial",
        "suppression",
        "askesis",
        "highlighted",
        "fundamental",
        "inseparability",
        "geschlecht",
        "love",
        "part",
        "examines",
        "difference",
        "geschlecht",
        "set",
        "sex",
        "apart",
        "way",
        "simply",
        "regard",
        "sexuality",
        "susman",
        "argues",
        "difference",
        "rooted",
        "depth",
        "blind",
        "life",
        "interference",
        "individual",
        "life",
        "law",
        "begetting",
        "birthing",
        "structure",
        "life",
        "men",
        "woman",
        "profoundly",
        "different",
        "way",
        "man",
        "relation",
        "objectivity",
        "tendency",
        "posit",
        "value",
        "beyond",
        "susman",
        "suggests",
        "oriented",
        "outside",
        "stand",
        "apart",
        "man",
        "creating",
        "constructing",
        "outsideoriented",
        "woman",
        "return",
        "taking",
        "world",
        "back",
        "motherhood",
        "maternal",
        "dimension",
        "structure",
        "woman",
        "relates",
        "world",
        "defining",
        "gender",
        "way",
        "complement",
        "susman",
        "young",
        "mother",
        "given",
        "birth",
        "son",
        "erwin",
        "highlight",
        "limitation",
        "gender",
        "set",
        "apart",
        "one",
        "another",
        "world",
        "according",
        "man",
        "argues",
        "requires",
        "radical",
        "rethinking",
        "woman",
        "perspective",
        "unlike",
        "romantic",
        "account",
        "birthgiving",
        "motherhood",
        "celebrate",
        "human",
        "reproduction",
        "higher",
        "transcendental",
        "goal",
        "reinforcing",
        "conventional",
        "pattern",
        "gender",
        "role",
        "susman",
        "suggest",
        "woman",
        "direct",
        "immediate",
        "link",
        "life",
        "reality",
        "neither",
        "ontological",
        "advantage",
        "man",
        "ontological",
        "disadvantage",
        "difference",
        "men",
        "woman",
        "alterity",
        "rather",
        "onesided",
        "inadequacy",
        "woman",
        "le",
        "access",
        "metaphysical",
        "men",
        "though",
        "kind",
        "access",
        "distinct",
        "different",
        "complement",
        "rather",
        "fall",
        "short",
        "access",
        "men",
        "susman",
        "suggests",
        "better",
        "worse",
        "sex",
        "depend",
        "every",
        "aspect",
        "existence",
        "relationship",
        "thus",
        "based",
        "reciprocally",
        "complementary",
        "difference",
        "whose",
        "divisive",
        "force",
        "make",
        "experience",
        "love",
        "profoundly",
        "different",
        "act",
        "love",
        "might",
        "unite",
        "birth",
        "form",
        "new",
        "unit",
        "family",
        "cause",
        "difference",
        "woman",
        "man",
        "proliferate",
        "susman",
        "note",
        "rather",
        "unproblematic",
        "dyad",
        "mother",
        "child",
        "woman",
        "find",
        "pregnancy",
        "birth",
        "alien",
        "life",
        "rather",
        "pure",
        "bliss",
        "motherhood",
        "difficult",
        "conflicted",
        "experience",
        "woman",
        "find",
        "life",
        "entangled",
        "another",
        "life",
        "give",
        "birth",
        "life",
        "longer",
        "one",
        "allow",
        "susman",
        "argues",
        "resolute",
        "departure",
        "christianinflected",
        "discourse",
        "birthing",
        "motherhood",
        "family",
        "move",
        "demythologize",
        "motherhood",
        "expose",
        "strange",
        "challenging",
        "experience",
        "come",
        "discard",
        "theologically",
        "committed",
        "register",
        "sacredness",
        "transcendence",
        "replacing",
        "metaphysics",
        "life",
        "pointedly",
        "immanent",
        "disenchanted",
        "approach",
        "motherhood",
        "operates",
        "critique",
        "traditional",
        "notion",
        "gender",
        "role",
        "resonates",
        "derrida",
        "exposure",
        "assumed",
        "wholesomeness",
        "sanctity",
        "motherchild",
        "relation",
        "profoundly",
        "problematic",
        "derrida",
        "circumfessions",
        "man",
        "life",
        "akin",
        "promethean",
        "seeker",
        "bringer",
        "light",
        "involves",
        "creation",
        "kind",
        "destruction",
        "respect",
        "form",
        "woman",
        "life",
        "keeping",
        "nature",
        "embedded",
        "world",
        "matter",
        "becoming",
        "destiny",
        "form",
        "life",
        "immediate",
        "hold",
        "asserts",
        "power",
        "man",
        "hand",
        "keeping",
        "nature",
        "intractable",
        "process",
        "life",
        "contra",
        "intellectuality",
        "past",
        "period",
        "consistently",
        "excluded",
        "woman",
        "producing",
        "culture",
        "spite",
        "seeming",
        "position",
        "woman",
        "beyond",
        "cultural",
        "aligning",
        "world",
        "nature",
        "matter",
        "becoming",
        "susman",
        "reclaims",
        "woman",
        "life",
        "mind",
        "one",
        "submit",
        "assimilated",
        "male",
        "world",
        "culture",
        "built",
        "men",
        "realized",
        "maintained",
        "woman",
        "destiny",
        "woman",
        "submit",
        "slave",
        "supposed",
        "helping",
        "mother",
        "world",
        "woman",
        "subject",
        "men",
        "realize",
        "mission",
        "particular",
        "calling",
        "art",
        "part",
        "book",
        "concludes",
        "love",
        "given",
        "clarity",
        "expression",
        "life",
        "aspire",
        "art",
        "power",
        "symbolization",
        "able",
        "give",
        "form",
        "reconciliation",
        "love",
        "dark",
        "dynamic",
        "matter",
        "bound",
        "reconciliation",
        "completed",
        "life",
        "religion",
        "philosophy",
        "failed",
        "u",
        "lost",
        "grasp",
        "dark",
        "confused",
        "matter",
        "something",
        "alien",
        "art",
        "alone",
        "shown",
        "u",
        "fluctuating",
        "quivering",
        "image",
        "possible",
        "reconciliation",
        "exaltation",
        "image",
        "love",
        "guide",
        "u",
        "look",
        "way",
        "resolving",
        "profound",
        "tension",
        "informs",
        "existence",
        "art",
        "mediation",
        "achieve",
        "religion",
        "philosophy",
        "think",
        "man",
        "woman",
        "unite",
        "enhanced",
        "life",
        "order",
        "create",
        "culture",
        "come",
        "grasping",
        "become",
        "together",
        "achieving",
        "susman",
        "argues",
        "involve",
        "renegotiating",
        "rather",
        "destroying",
        "separate",
        "men",
        "woman",
        "articulates",
        "vision",
        "humanity",
        "one",
        "woman",
        "men",
        "become",
        "human",
        "culture",
        "emerges",
        "humanity",
        "completely",
        "doubly",
        "gendered",
        "zwiegeschlechtlich",
        "genuine",
        "love",
        "susman",
        "concludes",
        "symbolized",
        "love",
        "individual",
        "point",
        "greater",
        "human",
        "destiny",
        "love",
        "bond",
        "sustains",
        "humanity",
        "whole",
        "love",
        "sense",
        "word",
        "requires",
        "full",
        "undiminished",
        "participation",
        "woman",
        "irreducible",
        "individuality",
        "susman",
        "book",
        "thus",
        "argues",
        "philosophy",
        "longer",
        "afford",
        "exclude",
        "woman",
        "philosopher",
        "discourse",
        "woman",
        "bring",
        "thought",
        "men",
        "able",
        "address",
        "demonstrating",
        "process",
        "inclusion",
        "contributes",
        "genuine",
        "advance",
        "philosophy",
        "feminist",
        "discourse",
        "becomes",
        "established",
        "wake",
        "world",
        "war",
        "susman",
        "approach",
        "issue",
        "status",
        "woman",
        "continues",
        "develop",
        "issue",
        "relation",
        "gender",
        "remains",
        "one",
        "two",
        "focal",
        "point",
        "critical",
        "agenda",
        "one",
        "question",
        "place",
        "jewish",
        "thought",
        "tradition",
        "modernity"
    ]
}