{
    "main_text": "Moral Philosophy || The Last Man Example\n4.1 The Last Man Example\n\n\nDeveloping out of influential work condemning Australian forestry\npractices in the early 1970s, (cf. Routley and Routley 1973a, Byron\n1999), Routley (1973)—“Is There a Need for a New, an\nEnvironmental, Ethic?”—presents a thought experiment\ndesigned to test what Sylvan took to be a core principle of Western\nethical systems, the Freedom Principle:\n\n\nOne should be able to do what he wishes, providing (1) that he does\nnot harm others and (2) that he is not likely to harm himself\nirreparably (1973, 15)\n\n\nHe calls this principle basic human chauvinism “because\nunder it humans, or people [whether present or future], come first and\neverything else a bad last”—a view later characterized as\n“anthropocentric” in the much expanded discussion of The\nLast Man Example in Routley and Routley (1980a, cf. 96).\n\n\nWe are invited to consider a world in collapse where humanity is\nreduced to a single person who then proceeds to eliminate, to the best\nof their abilities, “every living thing, animal or plant (but\npainlessly if you like, as at the best abattoirs).” (1973, 16)\nWith the demise of the last man (which we may suppose occurs\nimmediately prior to the wholesale destruction unleashed), there are\nno humans—either others or the last man himself—who could\nbe harmed by such an act and so, with clauses (1) and (2) satisfied,\nthe act is permissible according to the “human chauvinist”\nWestern ethical systems. (And even if “others” were\nextended to include non-human sentient creatures, still no harm,\nunderstood as suffering, would accrue given the act is done\n“painlessly”.) Yet, “what he does is wrong”\nand therewith we have a counterexample to such chauvinism and\nassociated Western ethical systems, and a claimed need for a new\nethic, “an environmental ethic”, capable of accounting for\nthe wrongness of the last man’s act. (As in his logical work,\nSylvan’s strategy is to try to isolate what is sufficient (in\nthis case, for wrongness) by considering “distant”\npossible worlds.)\n\n\nGranting the wrongness of the last man’s act, is a “new\nethic” really required? Preference utilitarianism has been\nconsidered as a “traditional” ethic capable of condemning\nthe last man. (Cf. Elliot 1980, 20 and 23; and Carter 2004,\n51–52 for a more limited condemnation along preference\nutilitarian grounds.) Where there is an overwhelming preference for\npreservation of the world beyond the death of the last man, and its\ndestruction would thus harm those having such a preference, the\nFreedom Principle would already appear to prohibit such an act\n(assuming the aggregated harm outweighs any benefit in the\nsatisfaction of contrary preferences). But notice that condemnation,\non this view, is highly contingent, depending on people’s\npreferences (condemnation is justified only if preferences\nconflict with destruction). Since the condemnation is thought to be\nwarranted with “no ifs and buts”, yet this\n“traditional” response offers the correct judgement only\nin special circumstances, for Sylvan, it counts as “too\nparochial” (Routley 1973, 20). (Cf. Lamb 2018, 532–3 for a\nsimilar point.)\n\n\nReacting, in part, to Leopold’s call for a “land\nethic”, Sylvan’s subsequent work in the area (much of the\nearly work with Val Routley, later Val Plumwood) proceeds to describe\nand argue for just such a non-anthropocentric, environmental ethic. A\ndominant aspect of this “new” ethic (indeed, a\ncharacterising feature in Elliot 1980) that was fixed on by\nsubsequent authors was the extension of non-instrumental,\n“intrinsic” or “final” values to the non-human\nworld. First mentioned in 1974 in early drafts of Routley and Routley\n(1980a) and subsequently Val Routley (1975), Rolston (1975), and\nCallicott (1979)—who all employ versions of the Last Man\nExample—the extension is described and defended at length in\nRoutley and Routley (1980a). (Sylvan assumes intrinsic value is, in\ngeneral, already assured on the familiar Aristotelian ground that\ninstrumental value requires intrinsic value, lest vicious regress\nensue—cf. Aristotle Metaphysics, 994b9–15.)\n\n\nSylvan and Plumwood hypothesise that what underpins the deontic\nprohibition of the last man’s act is the truth of the\naxiological claim that entities in non-human nature can possess more\nthan mere instrumental value—non-human nature “can have\nvalue and create obligations not reducible (in any way) to human\ninterests” (1980a, 129). While such items may have instrumental\nvalue, value as a means to human ends, advantaging us in various\nways—e.g., the value of forests in supplying water for human\nconsumption—they might also have “non-instrumental”,\nor what the Routleys called “intrinsic” value (1980a, 126\nand 129). Thus, the rejection of human chauvinism in its deontological\nform (the assertion of and the argument to the falsity of the Freedom\nPrinciple) was accompanied by its rejection in axiological form: not\nonly humans have intrinsic value; non-human nature may also be the\nlocus of intrinsic (non-instrumental) value.\n\n\nWhile accepting that we may have moral obligations with respect to or\nregarding entities in the non-human world, Routley (1973, 19) and\nRoutley and Routley (1980a, 174ff) deny that this entails our having\nobligations to them and deny, too, their having correlative\nrights. Sylvan rejects such an extension of rights to non-human\nentities. For this reason, he takes the “new environmental\nethic” to “differ markedly” from alternatives like\nLeopold’s land ethic. As it developed, it also differed markedly\nfrom most forms of utilitarianism for a broad range of reasons,\narguing instead for a deontologically constrained “optimisation\napproach to value theory”. (See Routley and Routley 1985; Sylvan\n1992.) Variants of Last Man counterexamples to traditional Western\nethics are also taken to show that the distribution of intrinsic value\nextends beyond sentient individuals—contra “animal\nliberationists” (1980a, 125) like Singer—so that\n“candidates for value … include all objects”\n(1980a, 140).\n\n\nResisting Sylvan’s broad push for a non-anthropocentric,\nenvironmental ethic are several arguments suggesting the inevitability\nof human chauvinism. Foremost among them are arguments that, he\nclaims, “parallel” arguments for egoism. Their rejection\nfollows similar grounds for rejection of egoism—cf. Routley and\nRoutley (1979b, esp. 47). This paper also distinguishes strong forms\nof human chauvinism (endorsing what Sylvan later termed the sole value\nassumption: that only members of the human class and some of\ntheir possible states have intrinsic value) from weaker forms that\nmerely endorse, for example, “the Greater Value Thesis: the\ninvariable allocation of greater value or preference … to\nhumans, while not however entirely excluding non-humans from moral\nconsideration” (ibid., 36)—a thesis also rejected\nby Sylvan. Paske (1991) defends a qualified version of the thesis; the\nmoral differentiation in favour of most humans can be\njustified (by appeal to deontologically-constrained hedonic\nconsequentialism). Attfield (1981), considering versions of the Last\nMan Example, also rejects strong human chauvinism while defending the\ngreater value thesis, thus defending a weak chauvinism in\nSylvan’s sense. “The good of trees might outweigh some of\nour whims: but it does not outweigh our interests except where our\ninterests depend on it” (1981, 51).\n\n\nPetersen and Sandin, on the other hand, defend a strong form of human\nchauvinism, arguing that the Last Man Example is subject to varying\nresponses depending on the motives attending the act of\nelimination. They thus reject the hypothesis of intrinsic values in\nnature, arguing instead that any supposed wrongness “can be\nbetter explained by precepts about last man’s character traits\nand motives” (2013, 133). It remains open whether such a\nresponse is adequate for the Last People Example (described by Sylvan\nimmediately following the Last Man Example) who may be said to act\n“for the best of reasons” though they have acted\n“badly” (Routley 1973, 16–17).\n\n\nA number of arguments against Sylvan’s hypothesised intrinsic\nvalue of natural items focus on supposed problems that attend the\napparently “cosmic” account of value that items are said\nto have in the absence of valuers (e.g., after the demise of the last\nman). Some focus on problems traditionally associated with moral\nobjectivism. If value is conceptually independent of valuers then:\nmoral intuitionism is an unacceptable consequence (cf. Mannison 1980,\n57, the charge of “realism”); moral theory is inconsistent\nwith (the preferred theory) moral projectivism (Carter 2004, who\nclaims a projectivist theory can explain our intuitions concerning the\nlast man); or such value is simply beyond epistemic access and\nirrelevant for decision-making (Justus et al. 2009,\n187–8). The latter point echoes earlier claims in Thompson\n(1990), Grey (1993), and Fox (1995) that the hypothesis of intrinsic\nvalue in nature results in values that, being too far removed from\nhuman concerns, are irrelevant as an ethical guide to human action\n(Thompson 1990, 159–60; Grey 1993, 464) and, in any event, are\nunnecessary—an enlightened anthropocentrism is sufficient.\n\n\nSylvan’s position on the ontology of values (discussed at length\nin 1980a, esp. 152ff) draws on the Last Man Example to claim that\nthings can, indeed, be valuable at a time when no valuers exist and\nextended thought experiments of a similar kind he takes to further\nestablish that things can be valuable in a world wherein no valuer\nexists at all, though a valuer must exist in some world (1980a, 156,\nfn 67; cf. also Sylvan and Bennett 1994, 143). Values are, he claims,\nconceptually dependent on valuers—thus the slogan “no\nvalue without valuers” remains true, he contends—and\ntherewith the rock of objectivism is said to be avoided (1980a,\n154). Elliot (1980) also contends that a non-objectivist account is\nsufficient for this kind of value engendered by the last man example,\nthough it is one requiring actual evaluators (“no\nvalues without actual valuers”). He goes on to describe\na subjectivist account that further links values to valuers\nin a manner that “makes the valuer the sole determinant of a\nthing’s value” (1980, 19) with value reduced to valuer\nevaluations.\n\n\nTaking himself to have avoided objectivism, Sylvan nonetheless argues\nagainst subjectivist accounts—intrinsic values are not\nsubjective either (1980a, 154). Intrinsic value in a world,\nwhile depending conceptually on valuers, nonetheless does not reduce\nto valuers in that world in any way. Some have remarked on\nthe apparent similarities between Sylvan’s account of intrinsic\nvalue and secondary qualities, suggesting his account amounted to a\nresponse-dependent account of intrinsic value (cf. Grey 2000). See\nLamb (2018, §IX) for argument to the contrary.\n\n\nIn the further elaboration of the “new ethic”, Routley and\nRoutley (1980a) develops a multiple factor model combining traditional\nvalues, such as the virtues and creature enjoyment, with environmental\nvalue-making factors, for example: diversity of systems and creatures,\nnaturalness, integrity of systems, stability of systems, and harmony\nof systems (170–171). So the shift to an environmental ethic\ndoes not reject ordinarily acknowledged welfare values for persons or\nhumans, but simply recognises a further set of factors contributing to\nintrinsic value in nature (171). Such value-making factors enter into\na mutually constrained optimisation so that the increase of one need\nnot increase the overall intrinsic value of the entity exemplifying\nit; thus, an increase in diversity in a forest may decrease value\ninsofar as it may come at the cost of naturalness (e.g., if the added\ndiversity comes from the anthropogenic addition of feral species not\nnaturally occurring in that forest).\n\n\nThe account of value is non-naturalistic in the sense that value is\nargued to be irreducible to natural features, even though\n“grounded” in them. (1980a, §5; Sylvan later\ncommitted to the supervenience of intrinsic value on naturalistic\nfeatures, Sylvan and Bennett 1994, 143). It is Meinongian in a number\nof respects—most obviously, drawing freely on Routley (1980),\ncf. esp. §8.11, values are features had by items but, like\nproperties, they do not exist (1980a, 153ff). Sylvan’s moral\nepistemology also draws heavily on Meinong’s account of\n“emotional presentation” (see Lamb 2018, §VIII):\n“the valued object may be emotionally presented and its\nvalue thus recognised, without its value simply amounting to\nits emotional presentation” (Routley and Routley 1983, 453). The\naccount is articulated at length in Sylvan (1986). Perhaps\nunsurprisingly, Sylvan’s semantic analysis of value (cf. Routley\nand Routley 1983) makes use of non-classical, relevant logic in its\nformal analysis. (Weber 2017a also draws on Sylvan’s work in\nnon-classical logic to develop a “new version” of the Last\nMan Example—the “Ultramodal Last Man”—with a\nview to avoiding an alleged dilemma besetting the original Last Man\nExample, “renewing a role for non-standard logics in value\ntheory”.)\n",
    "section_title": "4.1 The Last Man Example",
    "entry_title": "Richard Sylvan [Routley]",
    "hierarchy_title": "Richard Sylvan [Routley] || Moral Philosophy || The Last Man Example",
    "tokenized_text": [
        "moral",
        "philosophy",
        "last",
        "man",
        "example",
        "last",
        "man",
        "example",
        "developing",
        "influential",
        "work",
        "condemning",
        "australian",
        "forestry",
        "practice",
        "early",
        "s",
        "cf",
        "routley",
        "routley",
        "a",
        "byron",
        "routley",
        "need",
        "new",
        "environmental",
        "ethic",
        "presents",
        "thought",
        "experiment",
        "designed",
        "test",
        "sylvan",
        "took",
        "core",
        "principle",
        "western",
        "ethical",
        "system",
        "freedom",
        "principle",
        "one",
        "able",
        "wish",
        "providing",
        "harm",
        "others",
        "likely",
        "harm",
        "irreparably",
        "call",
        "principle",
        "basic",
        "human",
        "chauvinism",
        "human",
        "people",
        "whether",
        "present",
        "future",
        "come",
        "first",
        "everything",
        "else",
        "bad",
        "last",
        "a",
        "view",
        "later",
        "characterized",
        "anthropocentric",
        "much",
        "expanded",
        "discussion",
        "last",
        "man",
        "example",
        "routley",
        "routley",
        "a",
        "cf",
        "invited",
        "consider",
        "world",
        "collapse",
        "humanity",
        "reduced",
        "single",
        "person",
        "proceeds",
        "eliminate",
        "best",
        "ability",
        "every",
        "living",
        "thing",
        "animal",
        "plant",
        "painlessly",
        "like",
        "best",
        "abattoir",
        "demise",
        "last",
        "man",
        "may",
        "suppose",
        "occurs",
        "immediately",
        "prior",
        "wholesale",
        "destruction",
        "unleashed",
        "humanseither",
        "others",
        "last",
        "man",
        "himselfwho",
        "could",
        "harmed",
        "act",
        "clause",
        "satisfied",
        "act",
        "permissible",
        "according",
        "human",
        "chauvinist",
        "western",
        "ethical",
        "system",
        "even",
        "others",
        "extended",
        "include",
        "nonhuman",
        "sentient",
        "creature",
        "still",
        "harm",
        "understood",
        "suffering",
        "would",
        "accrue",
        "given",
        "act",
        "done",
        "painlessly",
        "yet",
        "wrong",
        "therewith",
        "counterexample",
        "chauvinism",
        "associated",
        "western",
        "ethical",
        "system",
        "claimed",
        "need",
        "new",
        "ethic",
        "environmental",
        "ethic",
        "capable",
        "accounting",
        "wrongness",
        "last",
        "man",
        "act",
        "logical",
        "work",
        "sylvan",
        "strategy",
        "try",
        "isolate",
        "sufficient",
        "case",
        "wrongness",
        "considering",
        "distant",
        "possible",
        "world",
        "granting",
        "wrongness",
        "last",
        "man",
        "act",
        "new",
        "ethic",
        "really",
        "required",
        "preference",
        "utilitarianism",
        "considered",
        "traditional",
        "ethic",
        "capable",
        "condemning",
        "last",
        "man",
        "cf",
        "elliot",
        "carter",
        "limited",
        "condemnation",
        "along",
        "preference",
        "utilitarian",
        "ground",
        "overwhelming",
        "preference",
        "preservation",
        "world",
        "beyond",
        "death",
        "last",
        "man",
        "destruction",
        "would",
        "thus",
        "harm",
        "preference",
        "freedom",
        "principle",
        "would",
        "already",
        "appear",
        "prohibit",
        "act",
        "assuming",
        "aggregated",
        "harm",
        "outweighs",
        "benefit",
        "satisfaction",
        "contrary",
        "preference",
        "notice",
        "condemnation",
        "view",
        "highly",
        "contingent",
        "depending",
        "people",
        "preference",
        "condemnation",
        "justified",
        "preference",
        "conflict",
        "destruction",
        "since",
        "condemnation",
        "thought",
        "warranted",
        "ifs",
        "buts",
        "yet",
        "traditional",
        "response",
        "offer",
        "correct",
        "judgement",
        "special",
        "circumstance",
        "sylvan",
        "count",
        "parochial",
        "routley",
        "cf",
        "lamb",
        "similar",
        "point",
        "reacting",
        "part",
        "leopold",
        "call",
        "land",
        "ethic",
        "sylvan",
        "subsequent",
        "work",
        "area",
        "much",
        "early",
        "work",
        "val",
        "routley",
        "later",
        "val",
        "plumwood",
        "proceeds",
        "describe",
        "argue",
        "nonanthropocentric",
        "environmental",
        "ethic",
        "dominant",
        "aspect",
        "new",
        "ethic",
        "indeed",
        "characterising",
        "feature",
        "elliot",
        "fixed",
        "subsequent",
        "author",
        "extension",
        "noninstrumental",
        "intrinsic",
        "final",
        "value",
        "nonhuman",
        "world",
        "first",
        "mentioned",
        "early",
        "draft",
        "routley",
        "routley",
        "a",
        "subsequently",
        "val",
        "routley",
        "rolston",
        "callicott",
        "who",
        "employ",
        "version",
        "last",
        "man",
        "examplethe",
        "extension",
        "described",
        "defended",
        "length",
        "routley",
        "routley",
        "a",
        "sylvan",
        "assumes",
        "intrinsic",
        "value",
        "general",
        "already",
        "assured",
        "familiar",
        "aristotelian",
        "ground",
        "instrumental",
        "value",
        "requires",
        "intrinsic",
        "value",
        "lest",
        "vicious",
        "regress",
        "ensuecf",
        "aristotle",
        "metaphysics",
        "b",
        "sylvan",
        "plumwood",
        "hypothesise",
        "underpins",
        "deontic",
        "prohibition",
        "last",
        "man",
        "act",
        "truth",
        "axiological",
        "claim",
        "entity",
        "nonhuman",
        "nature",
        "posse",
        "mere",
        "instrumental",
        "valuenonhuman",
        "nature",
        "value",
        "create",
        "obligation",
        "reducible",
        "way",
        "human",
        "interest",
        "a",
        "item",
        "may",
        "instrumental",
        "value",
        "value",
        "mean",
        "human",
        "end",
        "advantaging",
        "u",
        "various",
        "wayseg",
        "value",
        "forest",
        "supplying",
        "water",
        "human",
        "consumptionthey",
        "might",
        "also",
        "noninstrumental",
        "routleys",
        "called",
        "intrinsic",
        "value",
        "a",
        "thus",
        "rejection",
        "human",
        "chauvinism",
        "deontological",
        "form",
        "assertion",
        "argument",
        "falsity",
        "freedom",
        "principle",
        "accompanied",
        "rejection",
        "axiological",
        "form",
        "human",
        "intrinsic",
        "value",
        "nonhuman",
        "nature",
        "may",
        "also",
        "locus",
        "intrinsic",
        "noninstrumental",
        "value",
        "accepting",
        "may",
        "moral",
        "obligation",
        "respect",
        "regarding",
        "entity",
        "nonhuman",
        "world",
        "routley",
        "routley",
        "routley",
        "a",
        "ff",
        "deny",
        "entail",
        "obligation",
        "deny",
        "correlative",
        "right",
        "sylvan",
        "reject",
        "extension",
        "right",
        "nonhuman",
        "entity",
        "reason",
        "take",
        "new",
        "environmental",
        "ethic",
        "differ",
        "markedly",
        "alternative",
        "like",
        "leopold",
        "land",
        "ethic",
        "developed",
        "also",
        "differed",
        "markedly",
        "form",
        "utilitarianism",
        "broad",
        "range",
        "reason",
        "arguing",
        "instead",
        "deontologically",
        "constrained",
        "optimisation",
        "approach",
        "value",
        "theory",
        "see",
        "routley",
        "routley",
        "sylvan",
        "variant",
        "last",
        "man",
        "counterexample",
        "traditional",
        "western",
        "ethic",
        "also",
        "taken",
        "show",
        "distribution",
        "intrinsic",
        "value",
        "extends",
        "beyond",
        "sentient",
        "individualscontra",
        "animal",
        "liberationists",
        "a",
        "like",
        "singerso",
        "candidate",
        "value",
        "include",
        "object",
        "a",
        "resisting",
        "sylvan",
        "broad",
        "push",
        "nonanthropocentric",
        "environmental",
        "ethic",
        "several",
        "argument",
        "suggesting",
        "inevitability",
        "human",
        "chauvinism",
        "foremost",
        "among",
        "argument",
        "claim",
        "parallel",
        "argument",
        "egoism",
        "rejection",
        "follows",
        "similar",
        "ground",
        "rejection",
        "egoismcf",
        "routley",
        "routley",
        "b",
        "esp",
        "paper",
        "also",
        "distinguishes",
        "strong",
        "form",
        "human",
        "chauvinism",
        "endorsing",
        "sylvan",
        "later",
        "termed",
        "sole",
        "value",
        "assumption",
        "member",
        "human",
        "class",
        "possible",
        "state",
        "intrinsic",
        "value",
        "weaker",
        "form",
        "merely",
        "endorse",
        "example",
        "greater",
        "value",
        "thesis",
        "invariable",
        "allocation",
        "greater",
        "value",
        "preference",
        "human",
        "however",
        "entirely",
        "excluding",
        "nonhumans",
        "moral",
        "consideration",
        "ibid",
        "a",
        "thesis",
        "also",
        "rejected",
        "sylvan",
        "paske",
        "defends",
        "qualified",
        "version",
        "thesis",
        "moral",
        "differentiation",
        "favour",
        "human",
        "justified",
        "appeal",
        "deontologicallyconstrained",
        "hedonic",
        "consequentialism",
        "attfield",
        "considering",
        "version",
        "last",
        "man",
        "example",
        "also",
        "reject",
        "strong",
        "human",
        "chauvinism",
        "defending",
        "greater",
        "value",
        "thesis",
        "thus",
        "defending",
        "weak",
        "chauvinism",
        "sylvan",
        "sense",
        "good",
        "tree",
        "might",
        "outweigh",
        "whim",
        "outweigh",
        "interest",
        "except",
        "interest",
        "depend",
        "petersen",
        "sandin",
        "hand",
        "defend",
        "strong",
        "form",
        "human",
        "chauvinism",
        "arguing",
        "last",
        "man",
        "example",
        "subject",
        "varying",
        "response",
        "depending",
        "motif",
        "attending",
        "act",
        "elimination",
        "thus",
        "reject",
        "hypothesis",
        "intrinsic",
        "value",
        "nature",
        "arguing",
        "instead",
        "supposed",
        "wrongness",
        "better",
        "explained",
        "precept",
        "last",
        "man",
        "character",
        "trait",
        "motif",
        "remains",
        "open",
        "whether",
        "response",
        "adequate",
        "last",
        "people",
        "example",
        "described",
        "sylvan",
        "immediately",
        "following",
        "last",
        "man",
        "example",
        "may",
        "said",
        "act",
        "best",
        "reason",
        "though",
        "acted",
        "badly",
        "routley",
        "number",
        "argument",
        "sylvan",
        "hypothesised",
        "intrinsic",
        "value",
        "natural",
        "item",
        "focus",
        "supposed",
        "problem",
        "attend",
        "apparently",
        "cosmic",
        "account",
        "value",
        "item",
        "said",
        "absence",
        "valuer",
        "eg",
        "demise",
        "last",
        "man",
        "focus",
        "problem",
        "traditionally",
        "associated",
        "moral",
        "objectivism",
        "value",
        "conceptually",
        "independent",
        "valuer",
        "moral",
        "intuitionism",
        "unacceptable",
        "consequence",
        "cf",
        "mannison",
        "charge",
        "realism",
        "moral",
        "theory",
        "inconsistent",
        "preferred",
        "theory",
        "moral",
        "projectivism",
        "carter",
        "claim",
        "projectivist",
        "theory",
        "explain",
        "intuition",
        "concerning",
        "last",
        "man",
        "value",
        "simply",
        "beyond",
        "epistemic",
        "access",
        "irrelevant",
        "decisionmaking",
        "justus",
        "et",
        "al",
        "latter",
        "point",
        "echo",
        "earlier",
        "claim",
        "thompson",
        "grey",
        "fox",
        "hypothesis",
        "intrinsic",
        "value",
        "nature",
        "result",
        "value",
        "far",
        "removed",
        "human",
        "concern",
        "irrelevant",
        "ethical",
        "guide",
        "human",
        "action",
        "thompson",
        "grey",
        "event",
        "unnecessaryan",
        "enlightened",
        "anthropocentrism",
        "sufficient",
        "sylvan",
        "position",
        "ontology",
        "value",
        "discussed",
        "length",
        "a",
        "esp",
        "ff",
        "draw",
        "last",
        "man",
        "example",
        "claim",
        "thing",
        "indeed",
        "valuable",
        "time",
        "valuer",
        "exist",
        "extended",
        "thought",
        "experiment",
        "similar",
        "kind",
        "take",
        "establish",
        "thing",
        "valuable",
        "world",
        "wherein",
        "valuer",
        "exists",
        "though",
        "valuer",
        "must",
        "exist",
        "world",
        "a",
        "fn",
        "cf",
        "also",
        "sylvan",
        "bennett",
        "value",
        "claim",
        "conceptually",
        "dependent",
        "valuersthus",
        "slogan",
        "value",
        "without",
        "valuer",
        "remains",
        "true",
        "contendsand",
        "therewith",
        "rock",
        "objectivism",
        "said",
        "avoided",
        "a",
        "elliot",
        "also",
        "contends",
        "nonobjectivist",
        "account",
        "sufficient",
        "kind",
        "value",
        "engendered",
        "last",
        "man",
        "example",
        "though",
        "one",
        "requiring",
        "actual",
        "evaluator",
        "value",
        "without",
        "actual",
        "valuer",
        "go",
        "describe",
        "subjectivist",
        "account",
        "link",
        "value",
        "valuer",
        "manner",
        "make",
        "valuer",
        "sole",
        "determinant",
        "thing",
        "value",
        "value",
        "reduced",
        "valuer",
        "evaluation",
        "taking",
        "avoided",
        "objectivism",
        "sylvan",
        "nonetheless",
        "argues",
        "subjectivist",
        "accountsintrinsic",
        "value",
        "subjective",
        "either",
        "a",
        "intrinsic",
        "value",
        "world",
        "depending",
        "conceptually",
        "valuer",
        "nonetheless",
        "reduce",
        "valuer",
        "world",
        "way",
        "remarked",
        "apparent",
        "similarity",
        "sylvan",
        "account",
        "intrinsic",
        "value",
        "secondary",
        "quality",
        "suggesting",
        "account",
        "amounted",
        "responsedependent",
        "account",
        "intrinsic",
        "value",
        "cf",
        "grey",
        "see",
        "lamb",
        "ix",
        "argument",
        "contrary",
        "elaboration",
        "new",
        "ethic",
        "routley",
        "routley",
        "a",
        "develops",
        "multiple",
        "factor",
        "model",
        "combining",
        "traditional",
        "value",
        "virtue",
        "creature",
        "enjoyment",
        "environmental",
        "valuemaking",
        "factor",
        "example",
        "diversity",
        "system",
        "creature",
        "naturalness",
        "integrity",
        "system",
        "stability",
        "system",
        "harmony",
        "system",
        "shift",
        "environmental",
        "ethic",
        "reject",
        "ordinarily",
        "acknowledged",
        "welfare",
        "value",
        "person",
        "human",
        "simply",
        "recognises",
        "set",
        "factor",
        "contributing",
        "intrinsic",
        "value",
        "nature",
        "valuemaking",
        "factor",
        "enter",
        "mutually",
        "constrained",
        "optimisation",
        "increase",
        "one",
        "need",
        "increase",
        "overall",
        "intrinsic",
        "value",
        "entity",
        "exemplifying",
        "thus",
        "increase",
        "diversity",
        "forest",
        "may",
        "decrease",
        "value",
        "insofar",
        "may",
        "come",
        "cost",
        "naturalness",
        "eg",
        "added",
        "diversity",
        "come",
        "anthropogenic",
        "addition",
        "feral",
        "specie",
        "naturally",
        "occurring",
        "forest",
        "account",
        "value",
        "nonnaturalistic",
        "sense",
        "value",
        "argued",
        "irreducible",
        "natural",
        "feature",
        "even",
        "though",
        "grounded",
        "a",
        "sylvan",
        "later",
        "committed",
        "supervenience",
        "intrinsic",
        "value",
        "naturalistic",
        "feature",
        "sylvan",
        "bennett",
        "meinongian",
        "number",
        "respectsmost",
        "obviously",
        "drawing",
        "freely",
        "routley",
        "cf",
        "esp",
        "value",
        "feature",
        "item",
        "like",
        "property",
        "exist",
        "a",
        "ff",
        "sylvan",
        "moral",
        "epistemology",
        "also",
        "draw",
        "heavily",
        "meinong",
        "account",
        "emotional",
        "presentation",
        "see",
        "lamb",
        "viii",
        "valued",
        "object",
        "may",
        "emotionally",
        "presented",
        "value",
        "thus",
        "recognised",
        "without",
        "value",
        "simply",
        "amounting",
        "emotional",
        "presentation",
        "routley",
        "routley",
        "account",
        "articulated",
        "length",
        "sylvan",
        "perhaps",
        "unsurprisingly",
        "sylvan",
        "semantic",
        "analysis",
        "value",
        "cf",
        "routley",
        "routley",
        "make",
        "use",
        "nonclassical",
        "relevant",
        "logic",
        "formal",
        "analysis",
        "weber",
        "a",
        "also",
        "draw",
        "sylvan",
        "work",
        "nonclassical",
        "logic",
        "develop",
        "new",
        "version",
        "last",
        "man",
        "examplethe",
        "ultramodal",
        "last",
        "man",
        "with",
        "view",
        "avoiding",
        "alleged",
        "dilemma",
        "besetting",
        "original",
        "last",
        "man",
        "example",
        "renewing",
        "role",
        "nonstandard",
        "logic",
        "value",
        "theory"
    ]
}