{
    "main_text": "Analytic Philosophy of Technology || Methodological Issues: Design as Decision Making\n2.4 Methodological Issues: Design as Decision Making\n\nDesign is an activity that is subject to rational scrutiny but in\nwhich creativity is considered to play an important role as well.\nSince design is a form of action, a structured series of decisions to\nproceed in one way rather than another, the form of rationality that\nis relevant to it is practical rationality, the rationality\nincorporating the criteria on how to act, given particular\ncircumstances. This suggests a clear division of labor between the\npart to be played by rational scrutiny and the part to be played by\ncreativity. Theories of rational action generally conceive their\nproblem situation as one involving a choice among various course of\naction open to the agent. Rationality then concerns the question how\nto decide among given options, whereas creativity concerns the\ngeneration of these options. This distinction is similar to the\ndistinction between the context of justification and the context of\ndiscovery in science. The suggestion that is associated with this\ndistinction, however, that rational scrutiny only applies in the\ncontext of justification, is difficult to uphold for technological\ndesign. If the initial creative phase of option generation is\nconducted sloppily, the result of the design task can hardly be\nsatisfactory. Unlike the case of science, where the practical\nconsequences of entertaining a particular theory are not taken into\nconsideration, the context of discovery in technology is governed by\nsevere constraints of time and money, and an analysis of the problem\nhow best to proceed certainly seems in order. There has been little\nphilosophical work done in this direction; an overview of the issues\nis given in Kroes, Franssen, and Bucciarelli (2009).\n\nThe ideas of Herbert Simon on bounded rationality (see, e.g., Simon\n1982) are relevant here, since decisions on when to stop generating\noptions and when to stop gathering information about these options and\nthe consequences when they are adopted are crucial in decision making\nif informational overload and calculative intractability are to be\navoided. However, it has proved difficult to further develop\nSimon’s ideas on bounded rationality since their conception in\nthe 1950s. Another notion that is relevant here is means-ends\nreasoning. In order to be of any help here, theories of means-ends\nreasoning should then concern not just the evaluation of given means\nwith respect to their ability to achieve given ends, but also the\ngeneration or construction of means for given ends. A comprehensive\ntheory of means-ends reasoning, however, is not yet available; for a\nproposal on how to develop means-ends reasoning in the context of\ntechnical artifacts, see Hughes, Kroes, and Zwart 2007. In the\npractice of engineering, alternative proposals for the realization of\nparticular functions are usually taken from ‘catalogs’ of\nexisting and proven realizations. These catalogs are extended by\nongoing research in technology rather than under the urge of\nparticular design tasks.\n\nWhen engineering design is conceived as a process of decision making,\ngoverned by considerations of practical rationality, the next step is\nto specify these considerations. Almost all theories of practical\nrationality conceive of it as a reasoning process where a match\nbetween beliefs and desires or goals is sought. The desires or goals\nare represented by their value or utility for the decision maker, and\nthe decision maker’s problem is to choose an action that\nrealizes a situation that, ideally, has maximal value or utility among\nall the situations that could be realized. If there is uncertainty\nconcerning the situations that will be realized by a particular\naction, then the problem is conceived as aiming for maximal\nexpected value or utility. Now the instrumental perspective\non technology implies that the value that is at issue in the design\nprocess viewed as a process of rational decision making is not the\nvalue of the artifacts that are created. Those values are the domain\nof the users of the technology so created. They are supposed\nto be represented in the functional requirements defining the design\ntask. Instead the value to be maximized is the extent to which a\nparticular design meets the functional requirements defining the\ndesign task. It is in this sense that engineers share an overall\nperspective on engineering design as an exercise in\noptimization. But although optimization is a value-orientated\nnotion, it is not itself perceived as a value driving engineering\ndesign.\n\nThe functional requirements that define most design problems do not\nprescribe explicitly what should be optimized; usually they set levels\nto be attained minimally. It is then up to the engineer to choose how\nfar to go beyond meeting the requirements in this minimal sense.\nEfficiency, in energy consumption and use of materials first\nof all, is then often a prime value. Under the pressure of society,\nother values have come to be incorporated, in particular\nsafety and, more recently, sustainability. Sometimes\nit is claimed that what engineers aim to maximize is just one factor,\nnamely market success. Market success, however, can only be assessed\nafter the fact. The engineer’s maximization effort will instead\nbe directed at what are considered the predictors of market success.\nMeeting the functional requirements and being relatively efficient and\nsafe are plausible candidates as such predictors, but additional\nmethods, informed by market research, may introduce additional factors\nor may lead to a hierarchy among the factors.\n\nChoosing the design option that maximally meets all the functional\nrequirements (which may but need not originate with the prospective\nuser) and all other considerations and criteria that are taken to be\nrelevant, then becomes the practical decision-making problem to be\nsolved in a particular engineering-design task. This creates several\nmethodological problems. Most important of these is that the engineer\nis facing a multi-criteria decision problem. The various\nrequirements come with their own operationalizations in terms of\ndesign parameters and measurement procedures for assessing their\nperformance. This results in a number of rank orders or quantitative\nscales which represent the various options out of which a choice is to\nbe made. The task is to come up with a final score in which all these\nresults are ‘adequately’ represented, such that the option\nthat scores best can be considered the optimal solution to the design\nproblem. Engineers describe this situation as one where\ntrade-offs have to be made: in judging the merit of one\noption relative to other options, a relative bad performance on one\ncriterion can be balanced by a relatively good performance on another\ncriterion. An important problem is whether a rational method for doing\nthis can be formulated. It has been argued by Franssen (2005) that\nthis problem is structurally similar to the well-known problem of\nsocial choice, for which Kenneth Arrow proved his notorious\nimpossibility theorem in 1950. As a consequence, as long as we require\nfrom a solution method to this problem that it answers to some\nrequirements that spell out its generality and rationality, no such\nsolution method exists. In technical design, the role that individual\nvoters play in situations of social choice is played by the various\ndesign criteria, which each have a say in what the resulting product\ncomes to look like. This poses serious problems for the claims of\nengineers that their designs are optimal solutions in the sense of\nsatisfying the totality of the design criteria best, since\nArrow’s theorem implies that in most multi-criteria problems\nthis notion of ‘optimal’ cannot be rigorously defined,\njust as in most multi-voter situations the notion of a best or even\nadequate representation of what the voters jointly want cannot be\nrigorously defined.\n\nThis result seems to except a crucial aspect of engineering activity\nfrom philosophical scrutiny, and it could be used to defend the\nopinion that engineering is at least partly an art, not a science.\nInstead of surrendering to the result, however, which has a\nsignificance that extends much beyond engineering and even beyond\ndecision making in general, we should perhaps conclude instead that\nthere is still a lot of work to be done on what might be termed,\nprovisionally, ‘approximative’ forms of reasoning. One\nform of reasoning to be included here is Herbert Simon’s bounded\nrationality, plus the related notion of ‘satisficing’.\nSince their introduction in the 1950s (Simon 1957) these two terms\nhave found wide usage, but we are still lacking a general theory of\nbounded rationality. It may be in the nature of forms of approximative\nreasoning such as bounded rationality that a general theory cannot be\nhad, but even a systematic treatment from which such an insight could\nemerge seems to be lacking.\n\nAnother problem for the decision-making view of engineering design is\nthat in modern technology almost all design is done by teams. Such\nteams are composed of experts from many different disciplines. Each\ndiscipline has its own theories, its own models of interdependencies,\nits own assessment criteria, and so forth, and the professionals\nbelonging to these disciplines must be considered as inhabitants of\ndifferent object worlds, as Louis Bucciarelli (1994) phrases\nit. The different team members are, therefore, likely to disagree on\nthe relative rankings and evaluations of the various design options\nunder discussion. Agreement on one option as the overall best one can\nhere be even less arrived at by an algorithmic method exemplifying\nengineering rationality. Instead, models of social interaction, such\nas bargaining and strategic thinking, are relevant here. An example of\nsuch an approach to an (abstract) design problem is presented by\nFranssen and Bucciarelli (2004).\n\nTo look in this way at technological design as a decision-making\nprocess is to view it normatively from the point of view of practical\nor instrumental rationality. At the same time it is descriptive in\nthat it is a description of how engineering methodology generally\npresents the issue how to solve design problems. From that somewhat\nhigher perspective there is room for all kinds of normative questions\nthat are not addressed here, such as whether the functional\nrequirements defining a design problem can be seen as an adequate\nrepresentation of the values of the prospective users of an artifact\nor a technology, or by which methods values such as safety and\nsustainability can best be elicited and represented in the design\nprocess. These issues will be taken up in\n Section 3.\n",
    "section_title": "2.4 Methodological Issues: Design as Decision Making",
    "entry_title": "Philosophy of Technology",
    "hierarchy_title": "Philosophy of Technology || Analytic Philosophy of Technology || Methodological Issues: Design as Decision Making",
    "tokenized_text": [
        "analytic",
        "philosophy",
        "technology",
        "methodological",
        "issue",
        "design",
        "decision",
        "making",
        "methodological",
        "issue",
        "design",
        "decision",
        "making",
        "design",
        "activity",
        "subject",
        "rational",
        "scrutiny",
        "creativity",
        "considered",
        "play",
        "important",
        "role",
        "well",
        "since",
        "design",
        "form",
        "action",
        "structured",
        "series",
        "decision",
        "proceed",
        "one",
        "way",
        "rather",
        "another",
        "form",
        "rationality",
        "relevant",
        "practical",
        "rationality",
        "rationality",
        "incorporating",
        "criterion",
        "act",
        "given",
        "particular",
        "circumstance",
        "suggests",
        "clear",
        "division",
        "labor",
        "part",
        "played",
        "rational",
        "scrutiny",
        "part",
        "played",
        "creativity",
        "theory",
        "rational",
        "action",
        "generally",
        "conceive",
        "problem",
        "situation",
        "one",
        "involving",
        "choice",
        "among",
        "various",
        "course",
        "action",
        "open",
        "agent",
        "rationality",
        "concern",
        "question",
        "decide",
        "among",
        "given",
        "option",
        "whereas",
        "creativity",
        "concern",
        "generation",
        "option",
        "distinction",
        "similar",
        "distinction",
        "context",
        "justification",
        "context",
        "discovery",
        "science",
        "suggestion",
        "associated",
        "distinction",
        "however",
        "rational",
        "scrutiny",
        "applies",
        "context",
        "justification",
        "difficult",
        "uphold",
        "technological",
        "design",
        "initial",
        "creative",
        "phase",
        "option",
        "generation",
        "conducted",
        "sloppily",
        "result",
        "design",
        "task",
        "hardly",
        "satisfactory",
        "unlike",
        "case",
        "science",
        "practical",
        "consequence",
        "entertaining",
        "particular",
        "theory",
        "taken",
        "consideration",
        "context",
        "discovery",
        "technology",
        "governed",
        "severe",
        "constraint",
        "time",
        "money",
        "analysis",
        "problem",
        "best",
        "proceed",
        "certainly",
        "seems",
        "order",
        "little",
        "philosophical",
        "work",
        "done",
        "direction",
        "overview",
        "issue",
        "given",
        "kroes",
        "franssen",
        "bucciarelli",
        "idea",
        "herbert",
        "simon",
        "bounded",
        "rationality",
        "see",
        "eg",
        "simon",
        "relevant",
        "since",
        "decision",
        "stop",
        "generating",
        "option",
        "stop",
        "gathering",
        "information",
        "option",
        "consequence",
        "adopted",
        "crucial",
        "decision",
        "making",
        "informational",
        "overload",
        "calculative",
        "intractability",
        "avoided",
        "however",
        "proved",
        "difficult",
        "develop",
        "simon",
        "idea",
        "bounded",
        "rationality",
        "since",
        "conception",
        "s",
        "another",
        "notion",
        "relevant",
        "meansends",
        "reasoning",
        "order",
        "help",
        "theory",
        "meansends",
        "reasoning",
        "concern",
        "evaluation",
        "given",
        "mean",
        "respect",
        "ability",
        "achieve",
        "given",
        "end",
        "also",
        "generation",
        "construction",
        "mean",
        "given",
        "end",
        "comprehensive",
        "theory",
        "meansends",
        "reasoning",
        "however",
        "yet",
        "available",
        "proposal",
        "develop",
        "meansends",
        "reasoning",
        "context",
        "technical",
        "artifact",
        "see",
        "hughes",
        "kroes",
        "zwart",
        "practice",
        "engineering",
        "alternative",
        "proposal",
        "realization",
        "particular",
        "function",
        "usually",
        "taken",
        "catalog",
        "existing",
        "proven",
        "realization",
        "catalog",
        "extended",
        "ongoing",
        "research",
        "technology",
        "rather",
        "urge",
        "particular",
        "design",
        "task",
        "engineering",
        "design",
        "conceived",
        "process",
        "decision",
        "making",
        "governed",
        "consideration",
        "practical",
        "rationality",
        "next",
        "step",
        "specify",
        "consideration",
        "almost",
        "theory",
        "practical",
        "rationality",
        "conceive",
        "reasoning",
        "process",
        "match",
        "belief",
        "desire",
        "goal",
        "sought",
        "desire",
        "goal",
        "represented",
        "value",
        "utility",
        "decision",
        "maker",
        "decision",
        "maker",
        "problem",
        "choose",
        "action",
        "realizes",
        "situation",
        "ideally",
        "maximal",
        "value",
        "utility",
        "among",
        "situation",
        "could",
        "realized",
        "uncertainty",
        "concerning",
        "situation",
        "realized",
        "particular",
        "action",
        "problem",
        "conceived",
        "aiming",
        "maximal",
        "expected",
        "value",
        "utility",
        "instrumental",
        "perspective",
        "technology",
        "implies",
        "value",
        "issue",
        "design",
        "process",
        "viewed",
        "process",
        "rational",
        "decision",
        "making",
        "value",
        "artifact",
        "created",
        "value",
        "domain",
        "user",
        "technology",
        "created",
        "supposed",
        "represented",
        "functional",
        "requirement",
        "defining",
        "design",
        "task",
        "instead",
        "value",
        "maximized",
        "extent",
        "particular",
        "design",
        "meet",
        "functional",
        "requirement",
        "defining",
        "design",
        "task",
        "sense",
        "engineer",
        "share",
        "overall",
        "perspective",
        "engineering",
        "design",
        "exercise",
        "optimization",
        "although",
        "optimization",
        "valueorientated",
        "notion",
        "perceived",
        "value",
        "driving",
        "engineering",
        "design",
        "functional",
        "requirement",
        "define",
        "design",
        "problem",
        "prescribe",
        "explicitly",
        "optimized",
        "usually",
        "set",
        "level",
        "attained",
        "minimally",
        "engineer",
        "choose",
        "far",
        "go",
        "beyond",
        "meeting",
        "requirement",
        "minimal",
        "sense",
        "efficiency",
        "energy",
        "consumption",
        "use",
        "material",
        "first",
        "often",
        "prime",
        "value",
        "pressure",
        "society",
        "value",
        "come",
        "incorporated",
        "particular",
        "safety",
        "recently",
        "sustainability",
        "sometimes",
        "claimed",
        "engineer",
        "aim",
        "maximize",
        "one",
        "factor",
        "namely",
        "market",
        "success",
        "market",
        "success",
        "however",
        "assessed",
        "fact",
        "engineer",
        "maximization",
        "effort",
        "instead",
        "directed",
        "considered",
        "predictor",
        "market",
        "success",
        "meeting",
        "functional",
        "requirement",
        "relatively",
        "efficient",
        "safe",
        "plausible",
        "candidate",
        "predictor",
        "additional",
        "method",
        "informed",
        "market",
        "research",
        "may",
        "introduce",
        "additional",
        "factor",
        "may",
        "lead",
        "hierarchy",
        "among",
        "factor",
        "choosing",
        "design",
        "option",
        "maximally",
        "meet",
        "functional",
        "requirement",
        "may",
        "need",
        "originate",
        "prospective",
        "user",
        "consideration",
        "criterion",
        "taken",
        "relevant",
        "becomes",
        "practical",
        "decisionmaking",
        "problem",
        "solved",
        "particular",
        "engineeringdesign",
        "task",
        "creates",
        "several",
        "methodological",
        "problem",
        "important",
        "engineer",
        "facing",
        "multicriteria",
        "decision",
        "problem",
        "various",
        "requirement",
        "come",
        "operationalizations",
        "term",
        "design",
        "parameter",
        "measurement",
        "procedure",
        "assessing",
        "performance",
        "result",
        "number",
        "rank",
        "order",
        "quantitative",
        "scale",
        "represent",
        "various",
        "option",
        "choice",
        "made",
        "task",
        "come",
        "final",
        "score",
        "result",
        "adequately",
        "represented",
        "option",
        "score",
        "best",
        "considered",
        "optimal",
        "solution",
        "design",
        "problem",
        "engineer",
        "describe",
        "situation",
        "one",
        "tradeoff",
        "made",
        "judging",
        "merit",
        "one",
        "option",
        "relative",
        "option",
        "relative",
        "bad",
        "performance",
        "one",
        "criterion",
        "balanced",
        "relatively",
        "good",
        "performance",
        "another",
        "criterion",
        "important",
        "problem",
        "whether",
        "rational",
        "method",
        "formulated",
        "argued",
        "franssen",
        "problem",
        "structurally",
        "similar",
        "wellknown",
        "problem",
        "social",
        "choice",
        "kenneth",
        "arrow",
        "proved",
        "notorious",
        "impossibility",
        "theorem",
        "consequence",
        "long",
        "require",
        "solution",
        "method",
        "problem",
        "answer",
        "requirement",
        "spell",
        "generality",
        "rationality",
        "solution",
        "method",
        "exists",
        "technical",
        "design",
        "role",
        "individual",
        "voter",
        "play",
        "situation",
        "social",
        "choice",
        "played",
        "various",
        "design",
        "criterion",
        "say",
        "resulting",
        "product",
        "come",
        "look",
        "like",
        "pose",
        "serious",
        "problem",
        "claim",
        "engineer",
        "design",
        "optimal",
        "solution",
        "sense",
        "satisfying",
        "totality",
        "design",
        "criterion",
        "best",
        "since",
        "arrow",
        "theorem",
        "implies",
        "multicriteria",
        "problem",
        "notion",
        "optimal",
        "rigorously",
        "defined",
        "multivoter",
        "situation",
        "notion",
        "best",
        "even",
        "adequate",
        "representation",
        "voter",
        "jointly",
        "want",
        "rigorously",
        "defined",
        "result",
        "seems",
        "except",
        "crucial",
        "aspect",
        "engineering",
        "activity",
        "philosophical",
        "scrutiny",
        "could",
        "used",
        "defend",
        "opinion",
        "engineering",
        "least",
        "partly",
        "art",
        "science",
        "instead",
        "surrendering",
        "result",
        "however",
        "significance",
        "extends",
        "much",
        "beyond",
        "engineering",
        "even",
        "beyond",
        "decision",
        "making",
        "general",
        "perhaps",
        "conclude",
        "instead",
        "still",
        "lot",
        "work",
        "done",
        "might",
        "termed",
        "provisionally",
        "approximative",
        "form",
        "reasoning",
        "one",
        "form",
        "reasoning",
        "included",
        "herbert",
        "simon",
        "bounded",
        "rationality",
        "plus",
        "related",
        "notion",
        "satisficing",
        "since",
        "introduction",
        "s",
        "simon",
        "two",
        "term",
        "found",
        "wide",
        "usage",
        "still",
        "lacking",
        "general",
        "theory",
        "bounded",
        "rationality",
        "may",
        "nature",
        "form",
        "approximative",
        "reasoning",
        "bounded",
        "rationality",
        "general",
        "theory",
        "even",
        "systematic",
        "treatment",
        "insight",
        "could",
        "emerge",
        "seems",
        "lacking",
        "another",
        "problem",
        "decisionmaking",
        "view",
        "engineering",
        "design",
        "modern",
        "technology",
        "almost",
        "design",
        "done",
        "team",
        "team",
        "composed",
        "expert",
        "many",
        "different",
        "discipline",
        "discipline",
        "theory",
        "model",
        "interdependency",
        "assessment",
        "criterion",
        "forth",
        "professional",
        "belonging",
        "discipline",
        "must",
        "considered",
        "inhabitant",
        "different",
        "object",
        "world",
        "louis",
        "bucciarelli",
        "phrase",
        "different",
        "team",
        "member",
        "therefore",
        "likely",
        "disagree",
        "relative",
        "ranking",
        "evaluation",
        "various",
        "design",
        "option",
        "discussion",
        "agreement",
        "one",
        "option",
        "overall",
        "best",
        "one",
        "even",
        "le",
        "arrived",
        "algorithmic",
        "method",
        "exemplifying",
        "engineering",
        "rationality",
        "instead",
        "model",
        "social",
        "interaction",
        "bargaining",
        "strategic",
        "thinking",
        "relevant",
        "example",
        "approach",
        "abstract",
        "design",
        "problem",
        "presented",
        "franssen",
        "bucciarelli",
        "look",
        "way",
        "technological",
        "design",
        "decisionmaking",
        "process",
        "view",
        "normatively",
        "point",
        "view",
        "practical",
        "instrumental",
        "rationality",
        "time",
        "descriptive",
        "description",
        "engineering",
        "methodology",
        "generally",
        "present",
        "issue",
        "solve",
        "design",
        "problem",
        "somewhat",
        "higher",
        "perspective",
        "room",
        "kind",
        "normative",
        "question",
        "addressed",
        "whether",
        "functional",
        "requirement",
        "defining",
        "design",
        "problem",
        "seen",
        "adequate",
        "representation",
        "value",
        "prospective",
        "user",
        "artifact",
        "technology",
        "method",
        "value",
        "safety",
        "sustainability",
        "best",
        "elicited",
        "represented",
        "design",
        "process",
        "issue",
        "taken",
        "section"
    ]
}