{
    "main_text": "Analytic Philosophy of Technology || The Centrality of Design to Technology\n2.3 The Centrality of Design to Technology\n\nTo claim, with Skolimowski and Simon, that technology is about what is\nto be or what ought to be rather than what is may serve to distinguish\nit from science but will hardly make it understandable why so much\nphilosophical reflection on technology has taken the form of\nsocio-cultural critique. Technology is an ongoing attempt to bring the\nworld closer to the way one wishes it to be. Whereas science aims to\nunderstand the world as it is, technology aims to change the world.\nThese are abstractions, of course. For one, whose wishes concerning\nwhat the world should be like are realized in technology? Unlike\nscientists, who are often personally motivated in their attempts at\ndescribing and understanding the world, engineers are seen, not in the\nleast by engineers themselves, as undertaking their attempts to change\nthe world as a service to the public. The ideas on what is to be or\nwhat ought to be are seen as originating outside of technology itself;\nengineers then take it upon themselves to realize these ideas. This\nview is a major source for the widely spread picture of technology as\nbeing instrumental, as delivering instruments ordered from\n‘elsewhere’, as means to ends specified outside of\nengineering, a picture that has served further to support the claim\nthat technology is neutral with respect to values, discussed\nin\n Section 3.3.1.\n This view involves a considerable distortion of reality, however.\nMany engineers are intrinsically motivated to change the world, in\nparticular the world as shaped by past technologies. As a result, much\ntechnological development is ‘technology-driven’.\n\nTo understand where technology ‘comes from’, what drives\nthe innovation process, is of importance not only to those who are\ncurious to understand the phenomenon of technology itself but also to\nthose who are concerned about its role in society. Technology or\nengineering as a practice is concerned with the creation of artifacts\nand, of increasing importance, artifact-based services. The design\nprocess, the structured process leading toward that goal, forms\nthe core of the practice of engineering. In the engineering\nliterature, the design process is commonly represented as consisting\nof a series of translational steps; see for this, e.g., Suh 2001. At\nthe start are the customer’s needs or wishes. In the first step\nthese are translated into a list of functional requirements,\nwhich then define the design task an engineer, or a team of engineers,\nhas to accomplish. The functional requirements specify as precisely as\npossible what the device to be designed must be able to do. This step\nis required because customers usually focus on just one or two\nfeatures and are unable to articulate the requirements that are\nnecessary to support the functionality they desire. In the second\nstep, the functional requirements are translated into design\nspecifications, which the exact physical parameters of crucial\ncomponents by which the functional requirements are going to be met.\nThe design parameters chosen to satisfy these requirements are\ncombined and made more precise such that a blueprint of the\ndevice results. The blueprint contains all the details that must be\nknown such that the final step to the process of manufacturing the\ndevice can take place. It is tempting to consider the blueprint as the\nend result of a design process, instead of a finished copy being this\nresult. However, actual copies of a device are crucial for the purpose\nof prototyping and testing. Prototyping and testing presuppose that\nthe sequence of steps making up the design process can and will often\ncontain iterations, leading to revisions of the design parameters\nand/or the functional requirements. Even though, certainly for\nmass-produced items, the manufacture of a product for delivery to its\ncustomers or to the market comes after the closure of the design\nphase, the manufacturing process is often reflected in the functional\nrequirements of a device, for example in putting restrictions on the\nnumber of different components of which the device consists. The\ncomplexity of a device will affect how difficult it will be to\nmaintain or repair it, and ease of maintenance or low repair costs are\noften functional requirements. An important modern development is that\nthe complete life cycle of an artifact is now considered to be the\ndesigning engineer’s concern, up till the final stages of the\nrecycling and disposal of its components and materials, and the\nfunctional requirements of any device should reflect this. From this\npoint of view, neither a blueprint nor a prototype can be considered\nthe end product of engineering design.\n\nThe biggest idealization that this scheme of the design process\ncontains is arguably located at the start. Only in a minority of cases\ndoes a design task originate in a customer need or wish for a\nparticular artifact. First of all, as already suggested, many design\ntasks are defined by engineers themselves, for instance, by noticing\nsomething to be improved in existing products. Nevertheless design\noften starts with a problem pointed out by some societal agent, which\nengineers are then invited to solve. Many such problems, however, are\nill-defined or wicked problems, meaning that it is not at all\nclear what the problem is exactly and what a solution to the problem\nwould consist in. The ‘problem’ is a situation that\npeople—not necessarily the people ‘in’ the\nsituation—find unsatisfactory, but typically without being able\nto specify a situation that they find more satisfactory in other terms\nthan as one in which the problem has been solved. In particular it is\nnot obvious that a solution to the problem would consist in some\nartifact, or some artifactual system or process, being made available\nor installed. Engineering departments all over the world advertise\nthat engineering is problem solving, and engineers easily seem\nconfident that they are best qualified to solve a problem when they\nare asked to, whatever the nature of the problem. This has led to the\nphenomenon of a technological fix, the solution of a problem\nby a technical solution, that is, the delivery of an artifact or\nartifactual process, where it is questionable, to say the least,\nwhether this solves the problem or whether it was the best way of\nhandling the problem.\n\nA candidate example of a technological fix for the problem of global\nwarming would be the currently much debated option of injecting\nsulfate aerosols into the stratosphere to offset the warming effect of\ngreenhouse gases such as carbon dioxide and methane. Such schemes of\ngeoengineering would allow us to avoid facing the—in all\nlikelihood painful—choices that will lead to a reduction of the\nemission of greenhouse gases into the atmosphere, but will at the same\ntime allow the depletion of the Earth’s reservoir of fossil\nfuels to continue. See for a discussion of technological fixing, e.g.,\nVolti 2009: 26–32. Given this situation, and its hazards, the\nnotion of a problem and a taxonomy of problems deserve to receive more\nphilosophical attention than they have hitherto received.\n\nThese wicked problems are often broadly social problems, which would\nbest be met by some form of ‘social action’, which would\nresult in people changing their behavior or acting differently in such\na way that the problem would be mitigated or even disappear\ncompletely. In defense of the engineering view, it could perhaps be\nsaid that the repertoire of ‘proven’ forms of social\naction is meager. The temptation of technical fixes could be\novercome—at least that is how an engineer might see it—by\nthe inclusion of the social sciences in the systematic development and\napplication of knowledge to the solution of human problems. This\nhowever, is a controversial view. Social engineering is to\nmany a specter to be kept at as large a distance as possible instead\nof an ideal to be pursued. Karl Popper referred to acceptable forms of\nimplementing social change as ‘piecemeal social\nengineering’ and contrasted it to the revolutionary but\ncompletely unfounded schemes advocated by, e.g., Marxism. In the entry\non\n Karl Popper,\n however, his choice of words is called ‘rather\nunfortunate’. The notion of social engineering, and its cogency,\ndeserves more attention that it is currently receiving.\n\nAn important input for the design process is scientific knowledge:\nknowledge about the behavior of components and the materials they are\ncomposed of in specific circumstances. This is the point where science\nis applied. However, much of this knowledge is not directly available\nfrom the sciences, since it often concerns extremely detailed behavior\nin very specific circumstances. This scientific knowledge is therefore\noften generated within technology, by the engineering sciences. But\napart from this very specific scientific knowledge, engineering design\ninvolves various other sorts of knowledge. In his book What\nEngineers Know and How They Know It (Vincenti 1990), the\naeronautical engineer Walter Vincenti gave a six-fold categorization\nof engineering design knowledge (leaving aside production and\noperation as the other two basic constituents of engineering\npractice). Vincenti distinguishes\n\nFundamental design concepts, including primarily the operational\nprinciple and the normal configuration of a particular device;\nCriteria and specifications;\nTheoretical tools;\nQuantitative data;\nPractical considerations;\nDesign instrumentalities.\n\n\nThe fourth category concerns the quantitative knowledge just referred\nto, and the third the theoretical tools used to acquire it. These two\ncategories can be assumed to match Bunge’s notion of substantive\ntechnological theories. The status of the remaining four categories is\nmuch less clear, however, partly because they are less familiar, or\nnot at all, from the well-explored context of science. Of these\ncategories, Vincenti claims that they represent prescriptive forms of\nknowledge rather than descriptive ones. Here, the activity of design\nintroduces an element of normativity, which is absent from scientific\nknowledge. Take such a basic notion as ‘operational\nprinciple’, which refers to the way in which the function of a\ndevice is realized, or, in short, how it works. This is still a purely\ndescriptive notion. Subsequently, however, it plays a role in\narguments that seek to prescribe a course of action to someone who has\na goal that could be realized by the operation of such a device. At\nthis stage, the issue changes from a descriptive to a prescriptive or\nnormative one. An extensive discussion of the various kinds of\nknowledge relevant to technology is offered by Houkes (2009).\n\nAlthough the notion of an operational principle—a term that\nseems to originate with Polanyi (1958)—is central to engineering\ndesign, no single clear-cut definition of it seems to exist. The issue\nof disentangling descriptive from prescriptive aspects in an analysis\nof technical actions and their constituents is therefore a task that\nhas hardly begun. This task requires a clear view on the extent and\nscope of technology. If one follows Joseph Pitt in his book\nThinking About Technology (1999) and defines technology\nbroadly as ‘humanity at work’, then to distinguish between\ntechnical action and action in general becomes difficult, and the\nstudy of action in technology must absorb all descriptive and\nnormative theories of action, including the theory of practical\nrationality, and much of theoretical economics in its wake. There have\nindeed been attempts at such an encompassing account of human action,\nfor example Tadeusz Kotarbinski’s Praxiology (1965),\nbut a perspective of such generality makes it difficult to arrive at\nresults of sufficient depth. It would be a challenge for philosophy to\nspecify the differences among action forms and the reasoning grounding\nthem in, to single out three prominent fields of study, technology,\norganization and management, and economics.\n\nA more restricted attempt at such an approach is Ilkka\nNiiniluoto’s (1993). According to Niiniluoto, the theoretical\nframework of technology as an activity that is concerned with what the\nworld should be like rather than is, the framework that forms the\ncounterpoint to the descriptive framework of science, is design\nscience. The content of design science, the counterpoint to the\ntheories and explanations that form the content of descriptive\nscience, would then be formed by technical norms, statements\nof the form ‘If one wants to achieve X, one should do\nY’. The notion of a technical norm derives from Georg\nHenrik von Wright’s Norm and Action (1963). Technical\nnorms need to be distinguished from anankastic statements expressing\nnatural necessity, of the form ‘If X is to be achieved,\nY needs to be done’; the latter have a truth value but\nthe former have not. Von Wright himself, however, wrote that he did\nnot understand the mutual relations between these statements. Zwart,\nFranssen and Kroes (2018) present a detailed discussion. Ideas on what\ndesign science is and can and should be are evidently related to the\nbroad problem area of practical rationality—see this\nencyclopedia’s entries on\n practical reason\n and\n instrumental rationality—and\n also to means-ends reasoning, discussed in the next section.\n",
    "section_title": "2.3 The Centrality of Design to Technology",
    "entry_title": "Philosophy of Technology",
    "hierarchy_title": "Philosophy of Technology || Analytic Philosophy of Technology || The Centrality of Design to Technology",
    "tokenized_text": [
        "analytic",
        "philosophy",
        "technology",
        "centrality",
        "design",
        "technology",
        "centrality",
        "design",
        "technology",
        "claim",
        "skolimowski",
        "simon",
        "technology",
        "ought",
        "rather",
        "may",
        "serve",
        "distinguish",
        "science",
        "hardly",
        "make",
        "understandable",
        "much",
        "philosophical",
        "reflection",
        "technology",
        "taken",
        "form",
        "sociocultural",
        "critique",
        "technology",
        "ongoing",
        "attempt",
        "bring",
        "world",
        "closer",
        "way",
        "one",
        "wish",
        "whereas",
        "science",
        "aim",
        "understand",
        "world",
        "technology",
        "aim",
        "change",
        "world",
        "abstraction",
        "course",
        "one",
        "whose",
        "wish",
        "concerning",
        "world",
        "like",
        "realized",
        "technology",
        "unlike",
        "scientist",
        "often",
        "personally",
        "motivated",
        "attempt",
        "describing",
        "understanding",
        "world",
        "engineer",
        "seen",
        "least",
        "engineer",
        "undertaking",
        "attempt",
        "change",
        "world",
        "service",
        "public",
        "idea",
        "ought",
        "seen",
        "originating",
        "outside",
        "technology",
        "engineer",
        "take",
        "upon",
        "realize",
        "idea",
        "view",
        "major",
        "source",
        "widely",
        "spread",
        "picture",
        "technology",
        "instrumental",
        "delivering",
        "instrument",
        "ordered",
        "elsewhere",
        "mean",
        "end",
        "specified",
        "outside",
        "engineering",
        "picture",
        "served",
        "support",
        "claim",
        "technology",
        "neutral",
        "respect",
        "value",
        "discussed",
        "section",
        "view",
        "involves",
        "considerable",
        "distortion",
        "reality",
        "however",
        "many",
        "engineer",
        "intrinsically",
        "motivated",
        "change",
        "world",
        "particular",
        "world",
        "shaped",
        "past",
        "technology",
        "result",
        "much",
        "technological",
        "development",
        "technologydriven",
        "understand",
        "technology",
        "come",
        "drive",
        "innovation",
        "process",
        "importance",
        "curious",
        "understand",
        "phenomenon",
        "technology",
        "also",
        "concerned",
        "role",
        "society",
        "technology",
        "engineering",
        "practice",
        "concerned",
        "creation",
        "artifact",
        "increasing",
        "importance",
        "artifactbased",
        "service",
        "design",
        "process",
        "structured",
        "process",
        "leading",
        "toward",
        "goal",
        "form",
        "core",
        "practice",
        "engineering",
        "engineering",
        "literature",
        "design",
        "process",
        "commonly",
        "represented",
        "consisting",
        "series",
        "translational",
        "step",
        "see",
        "eg",
        "suh",
        "start",
        "customer",
        "need",
        "wish",
        "first",
        "step",
        "translated",
        "list",
        "functional",
        "requirement",
        "define",
        "design",
        "task",
        "engineer",
        "team",
        "engineer",
        "accomplish",
        "functional",
        "requirement",
        "specify",
        "precisely",
        "possible",
        "device",
        "designed",
        "must",
        "able",
        "step",
        "required",
        "customer",
        "usually",
        "focus",
        "one",
        "two",
        "feature",
        "unable",
        "articulate",
        "requirement",
        "necessary",
        "support",
        "functionality",
        "desire",
        "second",
        "step",
        "functional",
        "requirement",
        "translated",
        "design",
        "specification",
        "exact",
        "physical",
        "parameter",
        "crucial",
        "component",
        "functional",
        "requirement",
        "going",
        "met",
        "design",
        "parameter",
        "chosen",
        "satisfy",
        "requirement",
        "combined",
        "made",
        "precise",
        "blueprint",
        "device",
        "result",
        "blueprint",
        "contains",
        "detail",
        "must",
        "known",
        "final",
        "step",
        "process",
        "manufacturing",
        "device",
        "take",
        "place",
        "tempting",
        "consider",
        "blueprint",
        "end",
        "result",
        "design",
        "process",
        "instead",
        "finished",
        "copy",
        "result",
        "however",
        "actual",
        "copy",
        "device",
        "crucial",
        "purpose",
        "prototyping",
        "testing",
        "prototyping",
        "testing",
        "presuppose",
        "sequence",
        "step",
        "making",
        "design",
        "process",
        "often",
        "contain",
        "iteration",
        "leading",
        "revision",
        "design",
        "parameter",
        "andor",
        "functional",
        "requirement",
        "even",
        "though",
        "certainly",
        "massproduced",
        "item",
        "manufacture",
        "product",
        "delivery",
        "customer",
        "market",
        "come",
        "closure",
        "design",
        "phase",
        "manufacturing",
        "process",
        "often",
        "reflected",
        "functional",
        "requirement",
        "device",
        "example",
        "putting",
        "restriction",
        "number",
        "different",
        "component",
        "device",
        "consists",
        "complexity",
        "device",
        "affect",
        "difficult",
        "maintain",
        "repair",
        "ease",
        "maintenance",
        "low",
        "repair",
        "cost",
        "often",
        "functional",
        "requirement",
        "important",
        "modern",
        "development",
        "complete",
        "life",
        "cycle",
        "artifact",
        "considered",
        "designing",
        "engineer",
        "concern",
        "till",
        "final",
        "stage",
        "recycling",
        "disposal",
        "component",
        "material",
        "functional",
        "requirement",
        "device",
        "reflect",
        "point",
        "view",
        "neither",
        "blueprint",
        "prototype",
        "considered",
        "end",
        "product",
        "engineering",
        "design",
        "biggest",
        "idealization",
        "scheme",
        "design",
        "process",
        "contains",
        "arguably",
        "located",
        "start",
        "minority",
        "case",
        "design",
        "task",
        "originate",
        "customer",
        "need",
        "wish",
        "particular",
        "artifact",
        "first",
        "already",
        "suggested",
        "many",
        "design",
        "task",
        "defined",
        "engineer",
        "instance",
        "noticing",
        "something",
        "improved",
        "existing",
        "product",
        "nevertheless",
        "design",
        "often",
        "start",
        "problem",
        "pointed",
        "societal",
        "agent",
        "engineer",
        "invited",
        "solve",
        "many",
        "problem",
        "however",
        "illdefined",
        "wicked",
        "problem",
        "meaning",
        "clear",
        "problem",
        "exactly",
        "solution",
        "problem",
        "would",
        "consist",
        "problem",
        "situation",
        "peoplenot",
        "necessarily",
        "people",
        "situationfind",
        "unsatisfactory",
        "typically",
        "without",
        "able",
        "specify",
        "situation",
        "find",
        "satisfactory",
        "term",
        "one",
        "problem",
        "solved",
        "particular",
        "obvious",
        "solution",
        "problem",
        "would",
        "consist",
        "artifact",
        "artifactual",
        "system",
        "process",
        "made",
        "available",
        "installed",
        "engineering",
        "department",
        "world",
        "advertise",
        "engineering",
        "problem",
        "solving",
        "engineer",
        "easily",
        "seem",
        "confident",
        "best",
        "qualified",
        "solve",
        "problem",
        "asked",
        "whatever",
        "nature",
        "problem",
        "led",
        "phenomenon",
        "technological",
        "fix",
        "solution",
        "problem",
        "technical",
        "solution",
        "delivery",
        "artifact",
        "artifactual",
        "process",
        "questionable",
        "say",
        "least",
        "whether",
        "solves",
        "problem",
        "whether",
        "best",
        "way",
        "handling",
        "problem",
        "candidate",
        "example",
        "technological",
        "fix",
        "problem",
        "global",
        "warming",
        "would",
        "currently",
        "much",
        "debated",
        "option",
        "injecting",
        "sulfate",
        "aerosol",
        "stratosphere",
        "offset",
        "warming",
        "effect",
        "greenhouse",
        "gas",
        "carbon",
        "dioxide",
        "methane",
        "scheme",
        "geoengineering",
        "would",
        "allow",
        "u",
        "avoid",
        "facing",
        "thein",
        "likelihood",
        "painfulchoices",
        "lead",
        "reduction",
        "emission",
        "greenhouse",
        "gas",
        "atmosphere",
        "time",
        "allow",
        "depletion",
        "earth",
        "reservoir",
        "fossil",
        "fuel",
        "continue",
        "see",
        "discussion",
        "technological",
        "fixing",
        "eg",
        "volti",
        "given",
        "situation",
        "hazard",
        "notion",
        "problem",
        "taxonomy",
        "problem",
        "deserve",
        "receive",
        "philosophical",
        "attention",
        "hitherto",
        "received",
        "wicked",
        "problem",
        "often",
        "broadly",
        "social",
        "problem",
        "would",
        "best",
        "met",
        "form",
        "social",
        "action",
        "would",
        "result",
        "people",
        "changing",
        "behavior",
        "acting",
        "differently",
        "way",
        "problem",
        "would",
        "mitigated",
        "even",
        "disappear",
        "completely",
        "defense",
        "engineering",
        "view",
        "could",
        "perhaps",
        "said",
        "repertoire",
        "proven",
        "form",
        "social",
        "action",
        "meager",
        "temptation",
        "technical",
        "fix",
        "could",
        "overcomeat",
        "least",
        "engineer",
        "might",
        "see",
        "itby",
        "inclusion",
        "social",
        "science",
        "systematic",
        "development",
        "application",
        "knowledge",
        "solution",
        "human",
        "problem",
        "however",
        "controversial",
        "view",
        "social",
        "engineering",
        "many",
        "specter",
        "kept",
        "large",
        "distance",
        "possible",
        "instead",
        "ideal",
        "pursued",
        "karl",
        "popper",
        "referred",
        "acceptable",
        "form",
        "implementing",
        "social",
        "change",
        "piecemeal",
        "social",
        "engineering",
        "contrasted",
        "revolutionary",
        "completely",
        "unfounded",
        "scheme",
        "advocated",
        "eg",
        "marxism",
        "entry",
        "karl",
        "popper",
        "however",
        "choice",
        "word",
        "called",
        "rather",
        "unfortunate",
        "notion",
        "social",
        "engineering",
        "cogency",
        "deserves",
        "attention",
        "currently",
        "receiving",
        "important",
        "input",
        "design",
        "process",
        "scientific",
        "knowledge",
        "knowledge",
        "behavior",
        "component",
        "material",
        "composed",
        "specific",
        "circumstance",
        "point",
        "science",
        "applied",
        "however",
        "much",
        "knowledge",
        "directly",
        "available",
        "science",
        "since",
        "often",
        "concern",
        "extremely",
        "detailed",
        "behavior",
        "specific",
        "circumstance",
        "scientific",
        "knowledge",
        "therefore",
        "often",
        "generated",
        "within",
        "technology",
        "engineering",
        "science",
        "apart",
        "specific",
        "scientific",
        "knowledge",
        "engineering",
        "design",
        "involves",
        "various",
        "sort",
        "knowledge",
        "book",
        "engineer",
        "know",
        "know",
        "vincenti",
        "aeronautical",
        "engineer",
        "walter",
        "vincenti",
        "gave",
        "sixfold",
        "categorization",
        "engineering",
        "design",
        "knowledge",
        "leaving",
        "aside",
        "production",
        "operation",
        "two",
        "basic",
        "constituent",
        "engineering",
        "practice",
        "vincenti",
        "distinguishes",
        "fundamental",
        "design",
        "concept",
        "including",
        "primarily",
        "operational",
        "principle",
        "normal",
        "configuration",
        "particular",
        "device",
        "criterion",
        "specification",
        "theoretical",
        "tool",
        "quantitative",
        "data",
        "practical",
        "consideration",
        "design",
        "instrumentality",
        "fourth",
        "category",
        "concern",
        "quantitative",
        "knowledge",
        "referred",
        "third",
        "theoretical",
        "tool",
        "used",
        "acquire",
        "two",
        "category",
        "assumed",
        "match",
        "bunge",
        "notion",
        "substantive",
        "technological",
        "theory",
        "status",
        "remaining",
        "four",
        "category",
        "much",
        "le",
        "clear",
        "however",
        "partly",
        "le",
        "familiar",
        "wellexplored",
        "context",
        "science",
        "category",
        "vincenti",
        "claim",
        "represent",
        "prescriptive",
        "form",
        "knowledge",
        "rather",
        "descriptive",
        "one",
        "activity",
        "design",
        "introduces",
        "element",
        "normativity",
        "absent",
        "scientific",
        "knowledge",
        "take",
        "basic",
        "notion",
        "operational",
        "principle",
        "refers",
        "way",
        "function",
        "device",
        "realized",
        "short",
        "work",
        "still",
        "purely",
        "descriptive",
        "notion",
        "subsequently",
        "however",
        "play",
        "role",
        "argument",
        "seek",
        "prescribe",
        "course",
        "action",
        "someone",
        "goal",
        "could",
        "realized",
        "operation",
        "device",
        "stage",
        "issue",
        "change",
        "descriptive",
        "prescriptive",
        "normative",
        "one",
        "extensive",
        "discussion",
        "various",
        "kind",
        "knowledge",
        "relevant",
        "technology",
        "offered",
        "houkes",
        "although",
        "notion",
        "operational",
        "principlea",
        "term",
        "seems",
        "originate",
        "polanyi",
        "is",
        "central",
        "engineering",
        "design",
        "single",
        "clearcut",
        "definition",
        "seems",
        "exist",
        "issue",
        "disentangling",
        "descriptive",
        "prescriptive",
        "aspect",
        "analysis",
        "technical",
        "action",
        "constituent",
        "therefore",
        "task",
        "hardly",
        "begun",
        "task",
        "requires",
        "clear",
        "view",
        "extent",
        "scope",
        "technology",
        "one",
        "follows",
        "joseph",
        "pitt",
        "book",
        "thinking",
        "technology",
        "defines",
        "technology",
        "broadly",
        "humanity",
        "work",
        "distinguish",
        "technical",
        "action",
        "action",
        "general",
        "becomes",
        "difficult",
        "study",
        "action",
        "technology",
        "must",
        "absorb",
        "descriptive",
        "normative",
        "theory",
        "action",
        "including",
        "theory",
        "practical",
        "rationality",
        "much",
        "theoretical",
        "economics",
        "wake",
        "indeed",
        "attempt",
        "encompassing",
        "account",
        "human",
        "action",
        "example",
        "tadeusz",
        "kotarbinski",
        "praxiology",
        "perspective",
        "generality",
        "make",
        "difficult",
        "arrive",
        "result",
        "sufficient",
        "depth",
        "would",
        "challenge",
        "philosophy",
        "specify",
        "difference",
        "among",
        "action",
        "form",
        "reasoning",
        "grounding",
        "single",
        "three",
        "prominent",
        "field",
        "study",
        "technology",
        "organization",
        "management",
        "economics",
        "restricted",
        "attempt",
        "approach",
        "ilkka",
        "niiniluoto",
        "according",
        "niiniluoto",
        "theoretical",
        "framework",
        "technology",
        "activity",
        "concerned",
        "world",
        "like",
        "rather",
        "framework",
        "form",
        "counterpoint",
        "descriptive",
        "framework",
        "science",
        "design",
        "science",
        "content",
        "design",
        "science",
        "counterpoint",
        "theory",
        "explanation",
        "form",
        "content",
        "descriptive",
        "science",
        "would",
        "formed",
        "technical",
        "norm",
        "statement",
        "form",
        "one",
        "want",
        "achieve",
        "x",
        "one",
        "notion",
        "technical",
        "norm",
        "derives",
        "georg",
        "henrik",
        "von",
        "wright",
        "norm",
        "action",
        "technical",
        "norm",
        "need",
        "distinguished",
        "anankastic",
        "statement",
        "expressing",
        "natural",
        "necessity",
        "form",
        "x",
        "achieved",
        "need",
        "done",
        "latter",
        "truth",
        "value",
        "former",
        "von",
        "wright",
        "however",
        "wrote",
        "understand",
        "mutual",
        "relation",
        "statement",
        "zwart",
        "franssen",
        "kroes",
        "present",
        "detailed",
        "discussion",
        "idea",
        "design",
        "science",
        "evidently",
        "related",
        "broad",
        "problem",
        "area",
        "practical",
        "rationalitysee",
        "encyclopedia",
        "entry",
        "practical",
        "reason",
        "instrumental",
        "rationalityand",
        "also",
        "meansends",
        "reasoning",
        "discussed",
        "next",
        "section"
    ]
}