{
    "main_text": "Philosophy of Theater, Historical Diversity of Theatrical Traditions, and the “Anti-Theatrical Prejudice” || Philosophical Underpinnings in Theater Studies and Performance Theory\n1.2 Philosophical Underpinnings in Theater Studies and Performance Theory\n\nDiversity in the histories and forms of theater has made it difficult\nfor theorists within any theater tradition to arrive at a sound\nanalysis that also has the promise of being extensionally adequate.\nThis situation is exacerbated by the difficulty in drawing a\ndistinction between philosophy of theater on the one hand, and theater\nstudies or performance theory on the other. There are two ways in\nwhich this distinction may been drawn.\n\nFirst, the discussion of theater in so-called “Analytic\nPhilosophy” has rarely focused on the social or moral effects of\ntheater (with Cavell 1987 as one exception). Those discussions have\nbeen mostly in the form of determining the epistemological and\nmetaphysical status of the art form (Beardsley 1958; Danto 1981;\nLevinson 1996; D. Davies 2004; S. Davies 2006). But, in theater\nstudies, performance theory, and so-called “Continental\nPhilosophy” (Bergson 1889 [1910]; Deleuze 1968 [1994]; Heidegger\n1950 [2008]; Badiou 1990 [2013]) theater frequently has been addressed\nin the form of criticisms or defenses of the practices of theater in\nterms of the moral or social effects those practices have had;\nalthough in most of those cases, ethical considerations have rested on\nmetaphysical views.\n\nSecond, philosophy of theater might be distinguished from theater\nstudies or performance theory by the following facts: most\nphilosophical theories have emphasized descriptive issues,\nwhereas most theater studies or performance theories have emphasized\nnormative issues. Discussions of theater concerned with\ndescriptive issues typically ask what acting and spectating\nare, what the relation is between theatrical practices and practices\nin other art forms, what theatrical criticism is, and so on. The\ncontrasting normative theorizing can be illustrated by what\ntheater theorist Philip Zarrilli has called “acting\ntheories”, where we find particular ideologically inflected\ntheories—e.g., by or based on Konstantin Stanislavski, Bertolt\nBrecht, and so on—specifying ways in which to act\nsuccessfully in theater (Zarrilli 2002b: 3; Zarrilli 2007: 636).\n\nOne route to providing a sound analysis that has been taken in theater\nstudies and performance theory, since at least the 1960s, has been to\nappeal to some broader understanding of the human condition found in\nphilosophical reflections. This was possibly the expression of a hope\nthat in philosophy one might find something more universal than\ntheater itself; and if that led to fruitful explorations of theater\npractices, that would be a relevant form of imprimatur.\nHowever, as Marvin Carlson makes clear, theater artists are\nnot different from artists of other kinds in reacting\nprimarily to the thoughts and practices of their immediate\nartistic predecessors. So, although this route was taken by\ntheorists, this is not the route taken in theater or performance\npractice. Moreover, any plausible way of making out what a theater or\nperformance theory is—as for example, taking\n“theory” to refer to “statements of general\nprinciples regarding the methods, aims, functions, and\ncharacteristics” of theater—is unlikely to enable us to\nmaintain a bright line between philosophy of theater and theater\ntheory (Carlson 1984 [1993: 9]). Nevertheless, in an entry on the\nPhilosophy of Theater, it is important to note this prominent\ntheoretical strategy.\n\nThe most influential attempt of this kind rested on a popular set of\ntheories about language owing much of their provenance to the work of\nlinguist Ferdinand de Saussure (1916 [1977]) and to certain literary\ntheories that Saussurean linguistics informed as well. This attempt\nwas made in the form of semiotic theories of theater (Ubersfeld 1976\n[1999]; Eco 1977; Elam 1980; Pavis 1982; Fischer-Lichte 1983 [1992]).\nThese theater or performance theories involved applications from\nlanguage, conceived as a sign-system, to the theatrical event, which\nwas conceived of as either a single complicated sign-system or as a\ncomplicated conjunction of various sign-systems. And these theories\ncontinue to be influential in reflections on theater. But it soon\nbecame evident that the materiality of the actor’s body marked a\nlimit of what can be analyzed in terms of semiotics, in terms of signs\nand meanings. For in some performances bodies seem not to mean\nsomething but to be something, namely, themselves (States\n1985; Sofer 2003). Treating material things, such as props, as\n“signs” not only makes it difficult to say what is and\nwhat is not a material object, it also renders inexplicable the\npleasure that spectators find in props and theater sets qua\nmaterial objects. However, the materiality of the performer’s\nbody and of props, while challenging to semiotic analysis, is not, at\nleast according to some, a fact that presents an insuperable barrier\nto a more sophisticated semiotic theory. A standard (although partial)\nargument here is that, since anything can function as a prop for\nanything else in a theatrical performance, then anything just does act\nas a “sign” when it appears in a performance (Elam\n1980).\n\nIn contrast, phenomenological theories of theater, resting on the\nphilosophical phenomenology of either Edmund Husserl (1913 [1981]),\nMartin Heidegger (1950 [2008]), Maurice Merleau-Ponty (1945 [2012]),\nor Bruce Wilshire (1982), gave rise to phenomenological theories of\ntheater (Carlson 1984 [1993], States 1985, Rayner 1994, Garner 1994).\nThe motive for phenomenological theorizing about theater, in large\npart, had to do with retrieving for theater studies and performance\ntheory the spectator’s appreciation of the materiality of what\nhas been performed. The single most important achievements of this\nmovement were a) putting the spectator’s position foremost and\nb) regarding the spectator as someone who engaged in processes of\nunderstanding on the basis of both cognitive and affective responses.\nMerleau-Ponty, for example, was famous for making the observer’s\nperception of the world paramount. This could have translated\ninto spectator-centered theories of theater and theater cognition.\nUnfortunately, most phenomenological research of theatrical\nproductions focuses on either the plays themselves, as works of\ndramatic literature, or on the techniques of staging, principally the\nactor’s techniques. This orientation towards the means\nof producing performances, rather than the conditions of their\nreception, is fairly common among theater studies and performance\ntheory. As a result, the writings of many phenomenologically oriented\ntheater or performance theorists only begin with descriptions\nof a spectator’s experience and the cognitive challenges\nspectators face. This often has had the effect of estranging their\nviews from attempts to answer the classical questions of aesthetics\nand philosophy of art, which are often drawn from the point of view of\nthe amateur spectator or audience (Kristeller 1951:\n517–521).\n\nMaterial offered by speech act theories in philosophy—by J. L.\nAustin (1962) and John Searle (1969)—have given rise to\n“speech act” theater studies and performance theories.\nThis is perhaps because the idea of thinking of a word “not as\n[an expression of an] idea but as action, as gesture” was\nalready a familiar albeit contested idea among such theorists (Carlson\n1984 [1993: 398]). These philosophical theories about the nature of\nlanguage utterance hold that there are more ways in which to\ncommunicate some attitude about a content than by asserting it first\nand only then expressing an attitude (see §3 of the entry on\n speech acts\n as well as §5.2 and §6.1 of the entry on\n assertion\n in this Encyclopedia). A performative utterance is one that aims at\nachieving some state of affairs in the world rather than reporting\nwhether the state of affairs obtains, and such an utterance could fail\ndue to certain “infelicities” of circumstance of speaker,\nlistener, or environment. Interestingly both Austin and Searle thought\nthat the utterances of actors, because actors were merely pretending\nto do things (see\n §2.2),\n were not genuinely performative utterances. However, these ideas\nabout performative utterances gave rise to views like Judith\nButler’s—who used them in an argument, specifically with\nrespect to gender, that we should “take the social agent as\nan object rather than the subject of [a] constitutive [speech]\nact” and that we should \n\n\nunderstand constituting acts not only as constituting the identity of\nthe actor, but as constituting that identity as a compelling illusion,\nan object of belief. (Butler 1988: 520) \n\n\nMore to the point of this entry, the ideas of Austin and Searle also\ngave rise to the thinking of theorists focused mainly on what\nperformance or theater could be or do (Saltz 1991a; Rozik 1993).\n\nIn contrast to the four fairly separate disciplines that are involved\nhere—philosophy, philosophy of theater, performance theory and\ntheater studies, together with performance and theater\npractices—a recent view suggests there is but one overarching\ndiscipline, namely “performance philosophy”, wherein\nperformance is its own kind of thinking which is, itself, a kind of\nphilosophizing. This recent view is not, at least currently, widely\ncredited either by philosophers of theater or very many theater or\nperformance theorists (Puchner 2013). But it is now the basis of a new\ndiscipline with its own professional association and its own journal.\nLike many theater or performance theories, it takes its inspirations\nfrom philosophers, notably Gilles Deleuze (1968 [1994]) and Francois\nLaruelle (1996 [2013]).\n\nTo see how this goes, first suppose one argues that thinking about\ntheater can be teased apart into three distinct practices: the\nphilosophy of theater which is concerned with \n\n\nclarifying and/or defining the central concepts that organize the\npractices of theater…, scrutinizing what those concepts\nentail…, and identifying and addressing the disjunctions,\nanomalies, contradictions, and paradoxes that combining concepts\nsometimes entails; \n\n\ntheater theory which yields empirical results about the\nactual practices of theater, “isolating the component parts of\ntheatre and explaining how they operate”, whether as a kind of\n“reverse engineering” characteristic of the\n“scholarly theatre theorist” or as a “search for\ngeneral empirical principles or methods that will bring about coveted\nresults” as is characteristic of the “practical theatre\ntheorist;” and criticism which is also empirical but\n“preoccupied with saying what is special about the [particular]\nworks in question” (Carroll and Banes 2001: 158, 159, 160). Then\nsecond, if one thinks this might not be a mistaken view of\nthe nature of philosophical reflection so much as a\n“narrow view” of what philosophical reflection\nmight amount to, one might instead conceive of “performance as a\nsite for immanent thought” and seek to avoid the implication\nthat the only thing theatrical performance can do is illustrate a\ntheory or a bit of philosophical reflection (Cull 2013; Cull Ó\nMaoilearca 2018).\n",
    "section_title": "1.2 Philosophical Underpinnings in Theater Studies and Performance Theory",
    "entry_title": "Philosophy of Theater",
    "hierarchy_title": "Philosophy of Theater || Philosophy of Theater, Historical Diversity of Theatrical Traditions, and the “Anti-Theatrical Prejudice” || Philosophical Underpinnings in Theater Studies and Performance Theory",
    "tokenized_text": [
        "philosophy",
        "theater",
        "historical",
        "diversity",
        "theatrical",
        "tradition",
        "antitheatrical",
        "prejudice",
        "philosophical",
        "underpinnings",
        "theater",
        "study",
        "performance",
        "theory",
        "philosophical",
        "underpinnings",
        "theater",
        "study",
        "performance",
        "theory",
        "diversity",
        "history",
        "form",
        "theater",
        "made",
        "difficult",
        "theorist",
        "within",
        "theater",
        "tradition",
        "arrive",
        "sound",
        "analysis",
        "also",
        "promise",
        "extensionally",
        "adequate",
        "situation",
        "exacerbated",
        "difficulty",
        "drawing",
        "distinction",
        "philosophy",
        "theater",
        "one",
        "hand",
        "theater",
        "study",
        "performance",
        "theory",
        "two",
        "way",
        "distinction",
        "may",
        "drawn",
        "first",
        "discussion",
        "theater",
        "socalled",
        "analytic",
        "philosophy",
        "rarely",
        "focused",
        "social",
        "moral",
        "effect",
        "theater",
        "cavell",
        "one",
        "exception",
        "discussion",
        "mostly",
        "form",
        "determining",
        "epistemological",
        "metaphysical",
        "status",
        "art",
        "form",
        "beardsley",
        "danto",
        "levinson",
        "d",
        "davy",
        "s",
        "davy",
        "theater",
        "study",
        "performance",
        "theory",
        "socalled",
        "continental",
        "philosophy",
        "bergson",
        "deleuze",
        "heidegger",
        "badiou",
        "theater",
        "frequently",
        "addressed",
        "form",
        "criticism",
        "defense",
        "practice",
        "theater",
        "term",
        "moral",
        "social",
        "effect",
        "practice",
        "although",
        "case",
        "ethical",
        "consideration",
        "rested",
        "metaphysical",
        "view",
        "second",
        "philosophy",
        "theater",
        "might",
        "distinguished",
        "theater",
        "study",
        "performance",
        "theory",
        "following",
        "fact",
        "philosophical",
        "theory",
        "emphasized",
        "descriptive",
        "issue",
        "whereas",
        "theater",
        "study",
        "performance",
        "theory",
        "emphasized",
        "normative",
        "issue",
        "discussion",
        "theater",
        "concerned",
        "descriptive",
        "issue",
        "typically",
        "ask",
        "acting",
        "spectating",
        "relation",
        "theatrical",
        "practice",
        "practice",
        "art",
        "form",
        "theatrical",
        "criticism",
        "contrasting",
        "normative",
        "theorizing",
        "illustrated",
        "theater",
        "theorist",
        "philip",
        "zarrilli",
        "called",
        "acting",
        "theory",
        "find",
        "particular",
        "ideologically",
        "inflected",
        "theorieseg",
        "based",
        "konstantin",
        "stanislavski",
        "bertolt",
        "brecht",
        "onspecifying",
        "way",
        "act",
        "successfully",
        "theater",
        "zarrilli",
        "b",
        "zarrilli",
        "one",
        "route",
        "providing",
        "sound",
        "analysis",
        "taken",
        "theater",
        "study",
        "performance",
        "theory",
        "since",
        "least",
        "s",
        "appeal",
        "broader",
        "understanding",
        "human",
        "condition",
        "found",
        "philosophical",
        "reflection",
        "possibly",
        "expression",
        "hope",
        "philosophy",
        "one",
        "might",
        "find",
        "something",
        "universal",
        "theater",
        "led",
        "fruitful",
        "exploration",
        "theater",
        "practice",
        "would",
        "relevant",
        "form",
        "imprimatur",
        "however",
        "marvin",
        "carlson",
        "make",
        "clear",
        "theater",
        "artist",
        "different",
        "artist",
        "kind",
        "reacting",
        "primarily",
        "thought",
        "practice",
        "immediate",
        "artistic",
        "predecessor",
        "although",
        "route",
        "taken",
        "theorist",
        "route",
        "taken",
        "theater",
        "performance",
        "practice",
        "moreover",
        "plausible",
        "way",
        "making",
        "theater",
        "performance",
        "theory",
        "isas",
        "example",
        "taking",
        "theory",
        "refer",
        "statement",
        "general",
        "principle",
        "regarding",
        "method",
        "aim",
        "function",
        "characteristic",
        "theateris",
        "unlikely",
        "enable",
        "u",
        "maintain",
        "bright",
        "line",
        "philosophy",
        "theater",
        "theater",
        "theory",
        "carlson",
        "nevertheless",
        "entry",
        "philosophy",
        "theater",
        "important",
        "note",
        "prominent",
        "theoretical",
        "strategy",
        "influential",
        "attempt",
        "kind",
        "rested",
        "popular",
        "set",
        "theory",
        "language",
        "owing",
        "much",
        "provenance",
        "work",
        "linguist",
        "ferdinand",
        "de",
        "saussure",
        "certain",
        "literary",
        "theory",
        "saussurean",
        "linguistics",
        "informed",
        "well",
        "attempt",
        "made",
        "form",
        "semiotic",
        "theory",
        "theater",
        "ubersfeld",
        "eco",
        "elam",
        "pavis",
        "fischerlichte",
        "theater",
        "performance",
        "theory",
        "involved",
        "application",
        "language",
        "conceived",
        "signsystem",
        "theatrical",
        "event",
        "conceived",
        "either",
        "single",
        "complicated",
        "signsystem",
        "complicated",
        "conjunction",
        "various",
        "signsystems",
        "theory",
        "continue",
        "influential",
        "reflection",
        "theater",
        "soon",
        "became",
        "evident",
        "materiality",
        "actor",
        "body",
        "marked",
        "limit",
        "analyzed",
        "term",
        "semiotics",
        "term",
        "sign",
        "meaning",
        "performance",
        "body",
        "seem",
        "mean",
        "something",
        "something",
        "namely",
        "state",
        "sofer",
        "treating",
        "material",
        "thing",
        "prop",
        "sign",
        "make",
        "difficult",
        "say",
        "material",
        "object",
        "also",
        "render",
        "inexplicable",
        "pleasure",
        "spectator",
        "find",
        "prop",
        "theater",
        "set",
        "qua",
        "material",
        "object",
        "however",
        "materiality",
        "performer",
        "body",
        "prop",
        "challenging",
        "semiotic",
        "analysis",
        "least",
        "according",
        "fact",
        "present",
        "insuperable",
        "barrier",
        "sophisticated",
        "semiotic",
        "theory",
        "standard",
        "although",
        "partial",
        "argument",
        "since",
        "anything",
        "function",
        "prop",
        "anything",
        "else",
        "theatrical",
        "performance",
        "anything",
        "act",
        "sign",
        "appears",
        "performance",
        "elam",
        "contrast",
        "phenomenological",
        "theory",
        "theater",
        "resting",
        "philosophical",
        "phenomenology",
        "either",
        "edmund",
        "husserl",
        "martin",
        "heidegger",
        "maurice",
        "merleauponty",
        "bruce",
        "wilshire",
        "gave",
        "rise",
        "phenomenological",
        "theory",
        "theater",
        "carlson",
        "state",
        "rayner",
        "garner",
        "motive",
        "phenomenological",
        "theorizing",
        "theater",
        "large",
        "part",
        "retrieving",
        "theater",
        "study",
        "performance",
        "theory",
        "spectator",
        "appreciation",
        "materiality",
        "performed",
        "single",
        "important",
        "achievement",
        "movement",
        "putting",
        "spectator",
        "position",
        "foremost",
        "b",
        "regarding",
        "spectator",
        "someone",
        "engaged",
        "process",
        "understanding",
        "basis",
        "cognitive",
        "affective",
        "response",
        "merleauponty",
        "example",
        "famous",
        "making",
        "observer",
        "perception",
        "world",
        "paramount",
        "could",
        "translated",
        "spectatorcentered",
        "theory",
        "theater",
        "theater",
        "cognition",
        "unfortunately",
        "phenomenological",
        "research",
        "theatrical",
        "production",
        "focus",
        "either",
        "play",
        "work",
        "dramatic",
        "literature",
        "technique",
        "staging",
        "principally",
        "actor",
        "technique",
        "orientation",
        "towards",
        "mean",
        "producing",
        "performance",
        "rather",
        "condition",
        "reception",
        "fairly",
        "common",
        "among",
        "theater",
        "study",
        "performance",
        "theory",
        "result",
        "writing",
        "many",
        "phenomenologically",
        "oriented",
        "theater",
        "performance",
        "theorist",
        "begin",
        "description",
        "spectator",
        "experience",
        "cognitive",
        "challenge",
        "spectator",
        "face",
        "often",
        "effect",
        "estranging",
        "view",
        "attempt",
        "answer",
        "classical",
        "question",
        "aesthetic",
        "philosophy",
        "art",
        "often",
        "drawn",
        "point",
        "view",
        "amateur",
        "spectator",
        "audience",
        "kristeller",
        "material",
        "offered",
        "speech",
        "act",
        "theory",
        "philosophyby",
        "j",
        "l",
        "austin",
        "john",
        "searle",
        "have",
        "given",
        "rise",
        "speech",
        "act",
        "theater",
        "study",
        "performance",
        "theory",
        "perhaps",
        "idea",
        "thinking",
        "word",
        "expression",
        "idea",
        "action",
        "gesture",
        "already",
        "familiar",
        "albeit",
        "contested",
        "idea",
        "among",
        "theorist",
        "carlson",
        "philosophical",
        "theory",
        "nature",
        "language",
        "utterance",
        "hold",
        "way",
        "communicate",
        "attitude",
        "content",
        "asserting",
        "first",
        "expressing",
        "attitude",
        "see",
        "entry",
        "speech",
        "act",
        "well",
        "entry",
        "assertion",
        "encyclopedia",
        "performative",
        "utterance",
        "one",
        "aim",
        "achieving",
        "state",
        "affair",
        "world",
        "rather",
        "reporting",
        "whether",
        "state",
        "affair",
        "obtains",
        "utterance",
        "could",
        "fail",
        "due",
        "certain",
        "infelicity",
        "circumstance",
        "speaker",
        "listener",
        "environment",
        "interestingly",
        "austin",
        "searle",
        "thought",
        "utterance",
        "actor",
        "actor",
        "merely",
        "pretending",
        "thing",
        "see",
        "genuinely",
        "performative",
        "utterance",
        "however",
        "idea",
        "performative",
        "utterance",
        "gave",
        "rise",
        "view",
        "like",
        "judith",
        "butler",
        "swho",
        "used",
        "argument",
        "specifically",
        "respect",
        "gender",
        "take",
        "social",
        "agent",
        "object",
        "rather",
        "subject",
        "constitutive",
        "speech",
        "act",
        "understand",
        "constituting",
        "act",
        "constituting",
        "identity",
        "actor",
        "constituting",
        "identity",
        "compelling",
        "illusion",
        "object",
        "belief",
        "butler",
        "point",
        "entry",
        "idea",
        "austin",
        "searle",
        "also",
        "gave",
        "rise",
        "thinking",
        "theorist",
        "focused",
        "mainly",
        "performance",
        "theater",
        "could",
        "saltz",
        "a",
        "rozik",
        "contrast",
        "four",
        "fairly",
        "separate",
        "discipline",
        "involved",
        "herephilosophy",
        "philosophy",
        "theater",
        "performance",
        "theory",
        "theater",
        "study",
        "together",
        "performance",
        "theater",
        "practicesa",
        "recent",
        "view",
        "suggests",
        "one",
        "overarching",
        "discipline",
        "namely",
        "performance",
        "philosophy",
        "wherein",
        "performance",
        "kind",
        "thinking",
        "kind",
        "philosophizing",
        "recent",
        "view",
        "least",
        "currently",
        "widely",
        "credited",
        "either",
        "philosopher",
        "theater",
        "many",
        "theater",
        "performance",
        "theorist",
        "puchner",
        "basis",
        "new",
        "discipline",
        "professional",
        "association",
        "journal",
        "like",
        "many",
        "theater",
        "performance",
        "theory",
        "take",
        "inspiration",
        "philosopher",
        "notably",
        "gilles",
        "deleuze",
        "francois",
        "laruelle",
        "see",
        "go",
        "first",
        "suppose",
        "one",
        "argues",
        "thinking",
        "theater",
        "teased",
        "apart",
        "three",
        "distinct",
        "practice",
        "philosophy",
        "theater",
        "concerned",
        "clarifying",
        "andor",
        "defining",
        "central",
        "concept",
        "organize",
        "practice",
        "theater",
        "scrutinizing",
        "concept",
        "entail",
        "identifying",
        "addressing",
        "disjunction",
        "anomaly",
        "contradiction",
        "paradox",
        "combining",
        "concept",
        "sometimes",
        "entail",
        "theater",
        "theory",
        "yield",
        "empirical",
        "result",
        "actual",
        "practice",
        "theater",
        "isolating",
        "component",
        "part",
        "theatre",
        "explaining",
        "operate",
        "whether",
        "kind",
        "reverse",
        "engineering",
        "characteristic",
        "scholarly",
        "theatre",
        "theorist",
        "search",
        "general",
        "empirical",
        "principle",
        "method",
        "bring",
        "coveted",
        "result",
        "characteristic",
        "practical",
        "theatre",
        "theorist",
        "criticism",
        "also",
        "empirical",
        "preoccupied",
        "saying",
        "special",
        "particular",
        "work",
        "question",
        "carroll",
        "bane",
        "second",
        "one",
        "think",
        "might",
        "mistaken",
        "view",
        "nature",
        "philosophical",
        "reflection",
        "much",
        "narrow",
        "view",
        "philosophical",
        "reflection",
        "might",
        "amount",
        "one",
        "might",
        "instead",
        "conceive",
        "performance",
        "site",
        "immanent",
        "thought",
        "seek",
        "avoid",
        "implication",
        "thing",
        "theatrical",
        "performance",
        "illustrate",
        "theory",
        "bit",
        "philosophical",
        "reflection",
        "cull",
        "cull",
        "ó",
        "maoilearca"
    ]
}