{
    "main_text": "Ethics and Politics\n6. Ethics and Politics\n\nFrom the titles of Theophrastus’ ethical works as well as from\nthe surviving second-hand reports, it becomes clear that his interests\nin ethics covered a wide range of topics, some similar to\nAristotle’s, e.g., virtue, happiness, emotions, pleasure,\nfriendship, but also others of a more particular concern, e.g.,\nmarriage, old age, wealth, retribution (frs. 436–437\nFHS&G).\n\nTheophrastus adopted Aristotle’s analysis of virtue as a mean\ndisposition in regard to emotional response and action; that is, for\neach individual virtue there are two co-ordinate vices, one of excess\nand the other of deficiency (fr. 449A FHS&G). To illustrate virtue\nas the mean disposition relative to us, Theophrastus referred to the\ngarrulous person who says too much, his opposite who says too little,\nand the virtuous person who lays hold upon due measure (see also,\nCharacters 3 and 7). He also gave similar accounts for\ntemperance, courage and the other moral virtues. In the case of\ntemperance, for instance, he claimed that the insensitive person fails\nto desire what is in accordance with nature, the intemperate person is\nmarked by excessive desire, whereas the temperate person enjoys\npleasures to the extent he ought and in accordance with nature. It is\nworth noting that in his account of justice, in particular, he seems\nto have followed more closely Aristotle’s Eudemian\nEthics rather than the better-known Nicomachean Ethics\n(see Fortenbaugh 1983); justice is treated as a standard mean\ndisposition co-ordinate with an excess and a deficiency, since neither\nthe man who distributes the larger quantity to himself nor the man who\ndistributes the lesser is considered as just, but the man who\ndistributes the equal portion. Furthermore, in line with the\nAristotelian conception of virtue as the mean which is determined by\nreason and such as the practically wise man would determine it,\nTheophrastus emphasized that a person must learn to reason correctly\nor, in other words, to acquire practical wisdom which is, in his view,\ninseparable from moral virtue (fr. 460 FHS&G); for instance, those\nwho have been insulted may be quite justified in feeling angry and\nseeking revenge, but without practical wisdom they may choose the\nwrong course of action and fail to achieve their goal (frs. 526,\n527A–B FHS&G).\n\nApart from the fragments of his ethical treatises, in which\nTheophrastus presented with few modifications the Aristotelian account\nof virtue, we also have his extremely influential book\nCharacters, in which he went beyond his Aristotelian\ninheritance and focused on vicious human behaviour. More precisely,\nTheophrastus’ Characters is a collection of thirty\nbrief, often humorous descriptions or sketches, or even caricatures,\nof unattractive moral behaviour; for instance, loquacity,\ninsensitivity, flattery, shamelessness, obnoxiousness, superstition.\nEach sketch is preceded by a definition of the personality type, and\nthe entire collection is preceded by a spurious prologue which\nindicates that the Characters came to be used for moral\ninstruction.\n\nIndeed, many interpretations have been put forward with regard to the\ncomposition and purpose of this book. It has been regarded by some\nscholars as an independent work, while others have argued that it is a\ncollection of extracts from one or more writings of Theophrastus that\nwere brought together and edited after his death; but the coherence\nand stylistic unity of the collection suggest that its parts cannot\nhave been derived from unconnected works (see Diggle 2004:\n4–26). Theophrastus’ main interest, here, seems to have been limited to\nmerely portraying superficial behavioural patterns, without any\nconsideration of the various desires and beliefs that may underlie\nthese character traits; for Theophrastus, in contrast to Aristotle,\nhardly gave any explanation of why people behave in these ways or what\nmotivates them (see Fortenbaugh 2003b). It is not surprising that his\nsketches of immoral and corrupt characters have often been linked with\nthe stage characters of his pupil and comic writer Menander, such as\nSicon, the garrulous cook in the Dyscolus, or Polemon, the\nvehement person in the Perikeiromene (see Fortenbaugh 2003d).\nMoreover, the Characters have also been closely connected to\nrhetorical instruction as well as to actual rhetorical practice, since\nit is plausible to believe that this book would have been of use to\nthe student of rhetoric as well as to the rhetorician who wished to\nstudy and narrate emotional behaviour; it is indicative, after all,\nthat it was preserved in rhetorical manuscripts (see Fortenbaugh\n2003c). But whatever one thinks about the purpose of the\nCharacters, there is no doubt that Theophrastus’ book\nconstitutes a valuable testimony to the culture and society of his\ncontemporary Athens, by vividly depicting the complex etiquette\nconsidered appropriate for Athenian citizens in their homes, streets\nand other public places of their city (see Millett 2007).\n\nTheophrastus stressed the importance of education and development of\ngood habits in producing moral characters; education, he claimed,\ntames the human soul (fr. 465 FHS&G). In particular, early\neducation trains us in the appropriate emotional response, but also\nhelps us acquire moral principles that are both action-guiding and\ngood in themselves; for instance, in acquiring courage one learns not\nonly to confront danger steadfastly, but also to do so because\nsteadfastness in the face of danger is noble. In addition,\nTheophrastus claimed that education helps us acquire practical reason,\nso that we carefully investigate how we should live and act\naccordingly.\n\nBut virtue can be lost, according to Theophrastus, and adverse\nexternal circumstances may influence a person’s moral character\n(frs. 462–463 FHS&G). Indeed, he is reported to have said\nthat it is very difficult to decide on, to choose, and especially to\nremain steadfast to the best life (fr. 476 FHS&G). Besides, if we\nare to accept Cicero’s testimony, Theophrastus did not think\nthat virtue is sufficient for happiness, since happiness partly\ndepends on factors over which an individual has no control and they\ncan make a person’s life miserable, such as tortures,\nbanishments, bereavements (frs. 495–499 FHS&G). In fact, he\nwas criticized for endorsing, in his book Callisthenes or\nOn Grief, the maxim “Fortune rules life, not\nwisdom”. (fr. 493 FHS&G). But even if Theophrastus stressed\nmore than Aristotle the power of chance to ruin a human life, he still\nassigned special importance to the life of contemplation, which he\nthought of as similar to the life of the gods. In fact, Cicero reports\nthat Theophrastus was involved in a great controversy with another\nPeripatetic philosopher, namely Dicaearchus, who ranked more highly\nthe practical life than that of leisured study, but it may well be the\ncase that this debate is nothing but Cicero’s own creation (frs.\n481–482 FHS&G; see Fortenbaugh 2013).\n\nRegarding his treatment of emotions, Theophrastus agreed with\nAristotle that emotions are complex phenomena involving bodily\nchanges, which manifest themselves as painful or pleasant sensations,\nthought or belief, desire, and in many cases goal-directed behaviour.\nTo take, for instance, the case of anger that features predominantly\nin our sources, it is said to involve the thought that insult has\noccurred, which causes the boiling of blood and warmth around the\nheart, but it also involves changes in countenance and voice, as well\nas the desire for revenge (frs. 271, 441, 446–447, 526, 542\nFHS&G). On the other hand, Theophrastus seems to have diverged\nfrom Aristotle, when he discussed closely related emotions in terms of\nthe more and the less. Using again the example of anger, Theophrastus\npostulated that while anger is characterized by bodily changes and\npainful sensations, the thought that some injustice has occurred, and\nthe wish for retribution, rage involves these same features to a\ngreater degree and faultfinding to a lesser degree (fr. 438\nFHS&G). However, due to the meagre evidence available, it is not\nclear whether Theophrastus thought of difference in degree as merely\ncompatible with difference in kind, or actually determinant of\ndifference in kind (see Fortenbaugh 1985a).\n\nThe interest in politics Theophrastus acquired, most likely, from\nAristotle. It has even been claimed that, in some cases, it was\nAristotle who suggested to Theophrastus the topics of his books on\npolitics and prepared with him the relevant material before his death;\nbut the evidence on this point is not conclusive (see Podlecki 1985).\nOn the other hand, the titles of Theophrastus’ political\ntreatises indicate that in some of them he dealt with topics similar\nto Aristotle’s—e.g., Politics,\nLaws—while in others he introduced new ones—e.g.,\nPolitical Customs, On Kingship, On the Education\nof a King. Not much has survived from these writings, but from\nthe little we know it seems that in politics, too, Theophrastus used\nthe same research methods as in the other disciplines, namely taking\ninto consideration the particular circumstances as well as\nconscientiously collecting and recording all relevant information (see\nWöhrle 2019: 93–6).\n\nTo take his treatise Laws, for instance, Theophrastus treated\nin its twenty-four books all the branches of legislation by comparing,\ndiscussing and criticizing the laws of all Greek states in connection\nwith each and every legal institution (fr. 590 FHS&G). There is\ninteresting material, here, on legal procedures like those of\nimpeachment, retrial and ostracism, but also regulations concerning\nproperty and commerce. In fact, this treatise seems to have been\nintended as a practical guide or an encyclopedia for legislators,\nwhich could be consulted to insure that a prospective law was the best\none available. Furthermore, Theophrastus recognized that legislators\ncan never fully control the course of future events; they legislate in\nresponse to a limited set of circumstances and are likely to overlook\nconditions which may arise in the future and justify exceptions to the\nlaw. So, he talked of the “right moment” (kairos)\nand of politicians who in special circumstances permitted injustice\nfor the benefit of their city-state (frs. 614–615, 617,\n628–630 FHS&G). It has been argued, however, that\nTheophrastus’ treatment of political issues is not always\nsystematic; sometimes it lacks a rigorous point-by-point development\nand is characterized by a rather speculative examination of the\ntheories behind the laws (see Szegedy-Maszak 1981).\n",
    "section_title": "6. Ethics and Politics",
    "entry_title": "Theophrastus",
    "hierarchy_title": "Theophrastus || Ethics and Politics",
    "tokenized_text": [
        "ethic",
        "politics",
        "ethic",
        "politics",
        "title",
        "theophrastus",
        "ethical",
        "work",
        "well",
        "surviving",
        "secondhand",
        "report",
        "becomes",
        "clear",
        "interest",
        "ethic",
        "covered",
        "wide",
        "range",
        "topic",
        "similar",
        "aristotle",
        "eg",
        "virtue",
        "happiness",
        "emotion",
        "pleasure",
        "friendship",
        "also",
        "others",
        "particular",
        "concern",
        "eg",
        "marriage",
        "old",
        "age",
        "wealth",
        "retribution",
        "fr",
        "fhs",
        "g",
        "theophrastus",
        "adopted",
        "aristotle",
        "analysis",
        "virtue",
        "mean",
        "disposition",
        "regard",
        "emotional",
        "response",
        "action",
        "individual",
        "virtue",
        "two",
        "coordinate",
        "vice",
        "one",
        "excess",
        "deficiency",
        "fr",
        "a",
        "fhs",
        "g",
        "illustrate",
        "virtue",
        "mean",
        "disposition",
        "relative",
        "u",
        "theophrastus",
        "referred",
        "garrulous",
        "person",
        "say",
        "much",
        "opposite",
        "say",
        "little",
        "virtuous",
        "person",
        "lay",
        "hold",
        "upon",
        "due",
        "measure",
        "see",
        "also",
        "character",
        "also",
        "gave",
        "similar",
        "account",
        "temperance",
        "courage",
        "moral",
        "virtue",
        "case",
        "temperance",
        "instance",
        "claimed",
        "insensitive",
        "person",
        "fails",
        "desire",
        "accordance",
        "nature",
        "intemperate",
        "person",
        "marked",
        "excessive",
        "desire",
        "whereas",
        "temperate",
        "person",
        "enjoys",
        "pleasure",
        "extent",
        "ought",
        "accordance",
        "nature",
        "worth",
        "noting",
        "account",
        "justice",
        "particular",
        "seems",
        "followed",
        "closely",
        "aristotle",
        "eudemian",
        "ethic",
        "rather",
        "betterknown",
        "nicomachean",
        "ethic",
        "see",
        "fortenbaugh",
        "justice",
        "treated",
        "standard",
        "mean",
        "disposition",
        "coordinate",
        "excess",
        "deficiency",
        "since",
        "neither",
        "man",
        "distributes",
        "larger",
        "quantity",
        "man",
        "distributes",
        "lesser",
        "considered",
        "man",
        "distributes",
        "equal",
        "portion",
        "furthermore",
        "line",
        "aristotelian",
        "conception",
        "virtue",
        "mean",
        "determined",
        "reason",
        "practically",
        "wise",
        "man",
        "would",
        "determine",
        "theophrastus",
        "emphasized",
        "person",
        "must",
        "learn",
        "reason",
        "correctly",
        "word",
        "acquire",
        "practical",
        "wisdom",
        "view",
        "inseparable",
        "moral",
        "virtue",
        "fr",
        "fhs",
        "g",
        "instance",
        "insulted",
        "may",
        "quite",
        "justified",
        "feeling",
        "angry",
        "seeking",
        "revenge",
        "without",
        "practical",
        "wisdom",
        "may",
        "choose",
        "wrong",
        "course",
        "action",
        "fail",
        "achieve",
        "goal",
        "fr",
        "ab",
        "fhs",
        "g",
        "apart",
        "fragment",
        "ethical",
        "treatise",
        "theophrastus",
        "presented",
        "modification",
        "aristotelian",
        "account",
        "virtue",
        "also",
        "extremely",
        "influential",
        "book",
        "character",
        "went",
        "beyond",
        "aristotelian",
        "inheritance",
        "focused",
        "vicious",
        "human",
        "behaviour",
        "precisely",
        "theophrastus",
        "character",
        "collection",
        "thirty",
        "brief",
        "often",
        "humorous",
        "description",
        "sketch",
        "even",
        "caricature",
        "unattractive",
        "moral",
        "behaviour",
        "instance",
        "loquacity",
        "insensitivity",
        "flattery",
        "shamelessness",
        "obnoxiousness",
        "superstition",
        "sketch",
        "preceded",
        "definition",
        "personality",
        "type",
        "entire",
        "collection",
        "preceded",
        "spurious",
        "prologue",
        "indicates",
        "character",
        "came",
        "used",
        "moral",
        "instruction",
        "indeed",
        "many",
        "interpretation",
        "put",
        "forward",
        "regard",
        "composition",
        "purpose",
        "book",
        "regarded",
        "scholar",
        "independent",
        "work",
        "others",
        "argued",
        "collection",
        "extract",
        "one",
        "writing",
        "theophrastus",
        "brought",
        "together",
        "edited",
        "death",
        "coherence",
        "stylistic",
        "unity",
        "collection",
        "suggest",
        "part",
        "derived",
        "unconnected",
        "work",
        "see",
        "diggle",
        "theophrastus",
        "main",
        "interest",
        "seems",
        "limited",
        "merely",
        "portraying",
        "superficial",
        "behavioural",
        "pattern",
        "without",
        "consideration",
        "various",
        "desire",
        "belief",
        "may",
        "underlie",
        "character",
        "trait",
        "theophrastus",
        "contrast",
        "aristotle",
        "hardly",
        "gave",
        "explanation",
        "people",
        "behave",
        "way",
        "motivates",
        "see",
        "fortenbaugh",
        "b",
        "surprising",
        "sketch",
        "immoral",
        "corrupt",
        "character",
        "often",
        "linked",
        "stage",
        "character",
        "pupil",
        "comic",
        "writer",
        "menander",
        "sicon",
        "garrulous",
        "cook",
        "dyscolus",
        "polemon",
        "vehement",
        "person",
        "perikeiromene",
        "see",
        "fortenbaugh",
        "d",
        "moreover",
        "character",
        "also",
        "closely",
        "connected",
        "rhetorical",
        "instruction",
        "well",
        "actual",
        "rhetorical",
        "practice",
        "since",
        "plausible",
        "believe",
        "book",
        "would",
        "use",
        "student",
        "rhetoric",
        "well",
        "rhetorician",
        "wished",
        "study",
        "narrate",
        "emotional",
        "behaviour",
        "indicative",
        "preserved",
        "rhetorical",
        "manuscript",
        "see",
        "fortenbaugh",
        "c",
        "whatever",
        "one",
        "think",
        "purpose",
        "character",
        "doubt",
        "theophrastus",
        "book",
        "constitutes",
        "valuable",
        "testimony",
        "culture",
        "society",
        "contemporary",
        "athens",
        "vividly",
        "depicting",
        "complex",
        "etiquette",
        "considered",
        "appropriate",
        "athenian",
        "citizen",
        "home",
        "street",
        "public",
        "place",
        "city",
        "see",
        "millett",
        "theophrastus",
        "stressed",
        "importance",
        "education",
        "development",
        "good",
        "habit",
        "producing",
        "moral",
        "character",
        "education",
        "claimed",
        "tames",
        "human",
        "soul",
        "fr",
        "fhs",
        "g",
        "particular",
        "early",
        "education",
        "train",
        "u",
        "appropriate",
        "emotional",
        "response",
        "also",
        "help",
        "u",
        "acquire",
        "moral",
        "principle",
        "actionguiding",
        "good",
        "instance",
        "acquiring",
        "courage",
        "one",
        "learns",
        "confront",
        "danger",
        "steadfastly",
        "also",
        "steadfastness",
        "face",
        "danger",
        "noble",
        "addition",
        "theophrastus",
        "claimed",
        "education",
        "help",
        "u",
        "acquire",
        "practical",
        "reason",
        "carefully",
        "investigate",
        "live",
        "act",
        "accordingly",
        "virtue",
        "lost",
        "according",
        "theophrastus",
        "adverse",
        "external",
        "circumstance",
        "may",
        "influence",
        "person",
        "moral",
        "character",
        "fr",
        "fhs",
        "g",
        "indeed",
        "reported",
        "said",
        "difficult",
        "decide",
        "choose",
        "especially",
        "remain",
        "steadfast",
        "best",
        "life",
        "fr",
        "fhs",
        "g",
        "besides",
        "accept",
        "cicero",
        "testimony",
        "theophrastus",
        "think",
        "virtue",
        "sufficient",
        "happiness",
        "since",
        "happiness",
        "partly",
        "depends",
        "factor",
        "individual",
        "control",
        "make",
        "person",
        "life",
        "miserable",
        "torture",
        "banishment",
        "bereavement",
        "fr",
        "fhs",
        "g",
        "fact",
        "criticized",
        "endorsing",
        "book",
        "callisthenes",
        "grief",
        "maxim",
        "fortune",
        "rule",
        "life",
        "wisdom",
        "fr",
        "fhs",
        "g",
        "even",
        "theophrastus",
        "stressed",
        "aristotle",
        "power",
        "chance",
        "ruin",
        "human",
        "life",
        "still",
        "assigned",
        "special",
        "importance",
        "life",
        "contemplation",
        "thought",
        "similar",
        "life",
        "god",
        "fact",
        "cicero",
        "report",
        "theophrastus",
        "involved",
        "great",
        "controversy",
        "another",
        "peripatetic",
        "philosopher",
        "namely",
        "dicaearchus",
        "ranked",
        "highly",
        "practical",
        "life",
        "leisured",
        "study",
        "may",
        "well",
        "case",
        "debate",
        "nothing",
        "cicero",
        "creation",
        "fr",
        "fhs",
        "g",
        "see",
        "fortenbaugh",
        "regarding",
        "treatment",
        "emotion",
        "theophrastus",
        "agreed",
        "aristotle",
        "emotion",
        "complex",
        "phenomenon",
        "involving",
        "bodily",
        "change",
        "manifest",
        "painful",
        "pleasant",
        "sensation",
        "thought",
        "belief",
        "desire",
        "many",
        "case",
        "goaldirected",
        "behaviour",
        "take",
        "instance",
        "case",
        "anger",
        "feature",
        "predominantly",
        "source",
        "said",
        "involve",
        "thought",
        "insult",
        "occurred",
        "cause",
        "boiling",
        "blood",
        "warmth",
        "around",
        "heart",
        "also",
        "involves",
        "change",
        "countenance",
        "voice",
        "well",
        "desire",
        "revenge",
        "fr",
        "fhs",
        "g",
        "hand",
        "theophrastus",
        "seems",
        "diverged",
        "aristotle",
        "discussed",
        "closely",
        "related",
        "emotion",
        "term",
        "le",
        "using",
        "example",
        "anger",
        "theophrastus",
        "postulated",
        "anger",
        "characterized",
        "bodily",
        "change",
        "painful",
        "sensation",
        "thought",
        "injustice",
        "occurred",
        "wish",
        "retribution",
        "rage",
        "involves",
        "feature",
        "greater",
        "degree",
        "faultfinding",
        "lesser",
        "degree",
        "fr",
        "fhs",
        "g",
        "however",
        "due",
        "meagre",
        "evidence",
        "available",
        "clear",
        "whether",
        "theophrastus",
        "thought",
        "difference",
        "degree",
        "merely",
        "compatible",
        "difference",
        "kind",
        "actually",
        "determinant",
        "difference",
        "kind",
        "see",
        "fortenbaugh",
        "a",
        "interest",
        "politics",
        "theophrastus",
        "acquired",
        "likely",
        "aristotle",
        "even",
        "claimed",
        "case",
        "aristotle",
        "suggested",
        "theophrastus",
        "topic",
        "book",
        "politics",
        "prepared",
        "relevant",
        "material",
        "death",
        "evidence",
        "point",
        "conclusive",
        "see",
        "podlecki",
        "hand",
        "title",
        "theophrastus",
        "political",
        "treatise",
        "indicate",
        "dealt",
        "topic",
        "similar",
        "aristotle",
        "seg",
        "politics",
        "lawswhile",
        "others",
        "introduced",
        "new",
        "oneseg",
        "political",
        "custom",
        "kingship",
        "education",
        "king",
        "much",
        "survived",
        "writing",
        "little",
        "know",
        "seems",
        "politics",
        "theophrastus",
        "used",
        "research",
        "method",
        "discipline",
        "namely",
        "taking",
        "consideration",
        "particular",
        "circumstance",
        "well",
        "conscientiously",
        "collecting",
        "recording",
        "relevant",
        "information",
        "see",
        "wöhrle",
        "take",
        "treatise",
        "law",
        "instance",
        "theophrastus",
        "treated",
        "twentyfour",
        "book",
        "branch",
        "legislation",
        "comparing",
        "discussing",
        "criticizing",
        "law",
        "greek",
        "state",
        "connection",
        "every",
        "legal",
        "institution",
        "fr",
        "fhs",
        "g",
        "interesting",
        "material",
        "legal",
        "procedure",
        "like",
        "impeachment",
        "retrial",
        "ostracism",
        "also",
        "regulation",
        "concerning",
        "property",
        "commerce",
        "fact",
        "treatise",
        "seems",
        "intended",
        "practical",
        "guide",
        "encyclopedia",
        "legislator",
        "could",
        "consulted",
        "insure",
        "prospective",
        "law",
        "best",
        "one",
        "available",
        "furthermore",
        "theophrastus",
        "recognized",
        "legislator",
        "never",
        "fully",
        "control",
        "course",
        "future",
        "event",
        "legislate",
        "response",
        "limited",
        "set",
        "circumstance",
        "likely",
        "overlook",
        "condition",
        "may",
        "arise",
        "future",
        "justify",
        "exception",
        "law",
        "talked",
        "right",
        "moment",
        "kairos",
        "politician",
        "special",
        "circumstance",
        "permitted",
        "injustice",
        "benefit",
        "citystate",
        "fr",
        "fhs",
        "g",
        "argued",
        "however",
        "theophrastus",
        "treatment",
        "political",
        "issue",
        "always",
        "systematic",
        "sometimes",
        "lack",
        "rigorous",
        "pointbypoint",
        "development",
        "characterized",
        "rather",
        "speculative",
        "examination",
        "theory",
        "behind",
        "law",
        "see",
        "szegedymaszak"
    ]
}