{
    "main_text": "Formal Accounts || Indirect Interpretation\n4.2 Indirect Interpretation\n\nThe notion of an indirect interpretation was introduced by Carnap in\nhis Foundations of Logic and Mathematics (1939: ch.\n23–24) with the intention of accounting for the semantics of\ntheoretical terms in physics. It goes without saying that this notion\nis understood against the background of the notion of a direct\ninterpretation. Carnap had the following distinction in mind. The\ninterpretation of a descriptive symbol is direct if and only if (i) it\nis given by an assignment of an extension or an intension, and (ii)\nthis assignment is made by expressions of the metalanguage. The\ninterpretation of a descriptive symbol is indirect, by contrast, if\nand only if it is specified by one or several sentences of the object\nlanguage, which then figure as axioms in the respective calculus. Here\nare two simple examples of a direct interpretation:\n\n\n‘R’ designates the property of being\nrational.\n\n‘A’ designates the property of being an\nanimal.\n\n\nThe predicate ‘H’, by contrast, is interpreted in\nan indirect manner by a definition in the object language:\n\n\\[\\forall x(Hx \\leftrightarrow Rx \\wedge Ax).\\]\n\n\nInterpretation of a symbol by a definition counts as one type of\nindirect interpretation. Another type is the interpretation of\ntheoretical terms by the axioms of a scientific theory. Carnap (1939:\n65) remains content with a merely syntactic explanation of indirect\ninterpretation:\n\n\nThe calculus is first constructed floating in the air, so to speak;\nthe construction begins at the top and then adds lower and lower\nlevels. Finally, by the semantical rules, the lowest level is anchored\nat the solid ground of the observable facts. The laws, whether general\nor special, are not directly interpreted, but only the singular\nsentences.\n\n\nThe laws \\(A(\\TC)\\) are thus simply adopted as axioms in the calculus\nwithout assuming any prior interpretation or reference to the world\nfor theoretical terms. (A sentence \\(\\phi\\) being an axiom of a\ncalculus C means that \\(\\phi\\) can be used in any formal\nderivation in C without being a member of the premises.) This\naccount amounts to a formalist understanding of the theoretical\nlanguage in science. It has two particular merits. First, it\ncircumvents Sneed’s problem of theoretical terms since the\naxioms are not required to be true in the interpretation of the\nrespective language that represents the facts of the\ntheory-independent world. The need for assuming such an interpretation\nis simply denied. Second, the account is in line with the contextual\ntheory meaning for theoretical terms as our understanding of such\nterms is explained in terms of the axioms of the respective scientific\ntheories (cf.\n Section 1.2).\n\nThere are less formalist accounts of indirect interpretation in terms\nof explicit model-theoretic notions by Przelecki (1969: ch. 6) and\nAndreas\n (2010).[2]\n The latter account is based on ideas about theoretical terms in\nCarnap (1958). It emerged from an investigation into the similarities\nand dissimilarities between Carnapian postulates and definitions.\nRecall that Carnap viewed the axioms of a scientific theory as\npostulates since they contribute to the interpretation of theoretical\nterms. When explaining the Carnap sentence \\(\\TC^R \\rightarrow \\TC\\),\nCarnap says that, if the Ramsey sentence is true, the theoretical\nterms are to be understood in accordance with some interpretation that\nsatisfies TC. This is the sense in which we can say that\nCarnapian postulates contribute to the interpretation of theoretical\nterms in a manner akin to the interpretation of a defined term by the\ncorresponding definition. Postulates and definitions alike impose a\nconstraint on the admissible, or intended, interpretation of the\ncomplete language \\(L(V)\\), where V contains basic\nand indirectly interpreted terms.\n\nYet, the interpretation of theoretical terms by axioms of a scientific\ntheory differs in several ways from that of a defined term by a\ndefinition. First, the introduction of theoretical terms may be joined\nwith the introduction of another, theoretical domain of\ninterpretation, in addition to the basic domain of interpretation in\nwhich observation terms are interpreted. Second, it must not be\nassumed that the interpretation of theoretical terms results in a\nunique determination of the extension of these terms. This is an\nimplication of Carnap’s doctrine of partial interpretation\n(1958), as will become obvious by the end of this section. Third,\naxioms of a scientific theory are not conservative extensions of the\nobservation language since they enable us to make predictions.\nDefinitions, by contrast, must be conservative (cf. Gupta 2009).\nTaking these differences into account when observing the semantic\nsimilarities between definitions and Carnapian postulates suggests the\nfollowing explanation: a set \\(A(\\TC)\\) of axioms that interprets a\nset \\(V_t\\) of theoretical terms on the basis of a language \\(L(V_o)\\)\nimposes a constraint on the admissible, or intended, interpretations\nof the language \\(L(V_o,V_t)\\). An \\(L(V_o,V_t)\\) structure is\nadmissible if and only if it (i) satisfies the axioms\n\\(A(\\TC)\\) and (ii) extends the intended interpretation of \\(L(V_o)\\)\nto include an interpretation of the theoretical terms.\n\nIn more formal terms (Andreas 2010: 373; Przelecki 1969: ch. 6):\n\n\nDefinition 3 (Set \\(\\mathcal{S}\\) of admissible\nstructures)\n\nLet \\(\\mathcal{A}_o\\) designate the intended interpretation of the\nobservation language. Further, \\(\\MOD(A(\\TC))\\) designates the set of\n\\(L(V_o,V_t)\\) structures that satisfy the axioms \\(A(\\TC)\\).\n\\(\\EXT(\\mathcal{A}_o,V_t,D_t)\\) is the set of \\(L(V_o,V_t)\\)\nstructures that extend \\(\\mathcal{A}_o\\) to interpret the theoretical\nterms, where the domain of interpretation may be extended by a domain\n\\(D_t\\) of theoretical entities.\n\n\\(\\mathcal{S} := \\MOD(A(\\TC)) \\cap \\EXT(\\mathcal{A}_o,V_t,D_t)\\)\nif \\(\\MOD(A(\\TC)) \\cap \\EXT(\\mathcal{A}_o,V_t,D_t) \\ne\n\\varnothing\\);\n\\(\\mathcal{S} := \\EXT(\\mathcal{A}_o,V_t,D_t)\\) if \\(\\MOD(A(\\TC))\n\\cap \\EXT(\\mathcal{A}_o,V_t,D_t) = \\varnothing\\).\n\n\n\nGiven there is a range of admissible, i.e., intended structures, the\nfollowing semantic rules for theoretical sentences suggest\nthemselves:\n\n\nDefinition 4 (Semantics of theoretical sentences)\n\n\\(\\nu : L(V_o,V_t) \\rightarrow \\{T, F, I\\}.\\)\n\n\\(\\nu(\\phi) := T\\) if and only if for all structures \\(\\mathcal{A}\n\\in \\mathcal{S}, \\mathcal{A} \\vDash \\phi\\);\n\\(\\nu(\\phi) := F\\) if and only if for all structures \\(\\mathcal{A}\n\\in \\mathcal{S}, \\mathcal{A} \\not\\vDash \\phi\\);\n\\(\\nu(\\phi) := I\\) (indeterminate) if and only if there are\nstructures \\(\\mathcal{A}_1, \\mathcal{A}_2 \\in \\mathcal{S}\\) such that\n\\(\\mathcal{A}_1 \\vDash \\phi\\) but not \\(\\mathcal{A}_2 \\vDash\n\\phi\\).\n\n\n\nThese semantic rules are motivated by supervaluation logic (van\nFraassen 1969; Priest 2001: ch. 7). A sentence is true if and only if\nit is true in every admissible structure. It is false, by contrast, if\nand only if it is false in every admissible structure. And a sentence\ndoes not have a determinate truth value if and only if it is true in,\nat least, one admissible structure and false in, at least, another\nstructure that is also admissible.\n\nA few properties of the present semantics are noteworthy. First, it\naccounts for Carnap’s idea that the axioms \\(A(\\TC)\\) have a\ntwofold function, viz., setting forth empirical claims and determining\nthe meaning of theoretical terms (Carnap 1958). For, on the one hand,\nthe truth values of the axioms \\(A(\\TC)\\) depend on empirical,\nobservable facts. These axioms, on the other hand, determine the\nadmissible interpretations of the theoretical terms. These two\nseemingly contradictory properties are combined by allowing the axioms\n\\(A(\\TC)\\) to interpret theoretical terms only on condition of there\nbeing a structure that both extends the given interpretation of the\nobservation language and that satisfies these axioms. If there is no\nsuch structure, the theoretical terms remain uninterpreted. This\nsemantics, therefore, can be seen to formally work out the old\ncontextual theory of meaning for theoretical terms.\n\nSecond, Sneed’s problem of theoretical terms\n (Section 3.2)\n does not arise in the present semantics since the formulation of this\nproblem is bound to standard truth-conditional semantics. Third, it is\nclosely related to the Ramsey view of scientific theories as the\nfollowing biconditional holds:\n\n\nProposition 2  \\(\\TC^R\\) if and only if for all\n\\(\\phi \\in A(\\TC), \\nu(\\phi) = T\\).\n\n\nUnlike the Ramsey account, however, the semantics of indirect\ninterpretation does not dispense with theoretical terms. It can rather\nbe shown that allowing for a range of admissible interpretations as\nopposed to a single interpretation does not affect the validity of\nstandard deductive reasoning (Andreas 2010). Hence, a distinctive\nmerit of the indirect interpretation semantics of theoretical terms is\nthat theoretical terms need not be recovered from the Ramsey sentence\nin the first place.\n\nThe label partial interpretation is more common in the\nliterature to describe Carnap’s view that theoretical terms are\ninterpreted by the axioms or postulates of a scientific theory (Suppe\n1974: 86–95). The partial character of interpretation is\nretained in the present account since there is a range of admissible\ninterpretations of the complete language \\(L(V_o,V_t)\\). This allows\nfor the interpretation of theoretical terms to be strengthened by\nfurther postulates, just as Carnap demanded in his 1958 and 1961. To\nstrengthen the interpretation of theoretical terms is to further\nconstrain the range of admissible interpretations of\n\\(L(V_o,V_t)\\).\n\nWhat happens if the axioms A(TC) are inconsistent or fail to be\nempirically adequate? In other words, what happens if there is no\ninterpretation of the theoretical terms such that this interpretation\nsatisfies all the axioms and agrees with the antecedent interpretation\nof the observation terms? In this case, the axioms of the respective\ntheory fail to interpret the theoretical terms. The set of admissible\nstructures, as defined by Definition 3, is empty. At the same time, we\nthink we have some understanding of the theoretical terms, even if the\nrespective theory fails to be fully consistent with the empirical\ndata. For example, we think we have some understanding of the\ntheretical terms in classical mechanics, even though classical\nmechanics is not universally applicable. Moreover, we seem to have\ninconsistent, yet non-trivial scientific theories, such as classical\nelectrodynamics.\n\nConsequently, Andreas (2018) generalized the present semantics so as\nto capture scientific reasoning in a paraconsistent setting. The\nproposal is based on a preferred-models semantics: satisfaction of a\ntheory and agreement with empirical data comes in degrees. Some\ninterpretations score better than others. This idea leads to a strict\npartial order of interpretations. And we understand the theoretical\nterms in such a manner that the set of instances of all the axioms is\nsatisfied to a maximal extent in the context of a given interpretation\nof the observation terms. This proposal parallels certain adaptive\nlogics, developed by Batens (2000) and Meheus et al. (2016). Notably,\nit allows us to capture scientific reasoning with ceteris paribus\nlaws, i.e., laws that hold true most of the time but have exceptions.\nThis could be helpful for the analysis of theoretical terms in\nscientific disciplines other than physics.\n\nRelatively little research has been done on the semantics of\ntheoretical terms in theories from scientific disciplines other than\nphysics. It has remained an open question whether or not formal\nsemantics that were primarily developed to capture theories in physics\nare applicable to theories in biology, chemistry, psychology,\neconomics, etc. For the structuralist framework by Balzer et al.\n(1987) it could be shown that such applications are feasible (see\nBalzer et al. 2000). Rakover (2020) and McClimans (2017) studied\ntheoretical terms in psychology, albeit without explicit\nconsiderations of their formal semantics.\n",
    "section_title": "4.2 Indirect Interpretation",
    "entry_title": "Theoretical Terms in Science",
    "hierarchy_title": "Theoretical Terms in Science || Formal Accounts || Indirect Interpretation",
    "tokenized_text": [
        "formal",
        "account",
        "indirect",
        "interpretation",
        "indirect",
        "interpretation",
        "notion",
        "indirect",
        "interpretation",
        "introduced",
        "carnap",
        "foundation",
        "logic",
        "mathematics",
        "ch",
        "intention",
        "accounting",
        "semantics",
        "theoretical",
        "term",
        "physic",
        "go",
        "without",
        "saying",
        "notion",
        "understood",
        "background",
        "notion",
        "direct",
        "interpretation",
        "carnap",
        "following",
        "distinction",
        "mind",
        "interpretation",
        "descriptive",
        "symbol",
        "direct",
        "given",
        "assignment",
        "extension",
        "intension",
        "ii",
        "assignment",
        "made",
        "expression",
        "metalanguage",
        "interpretation",
        "descriptive",
        "symbol",
        "indirect",
        "contrast",
        "specified",
        "one",
        "several",
        "sentence",
        "object",
        "language",
        "figure",
        "axiom",
        "respective",
        "calculus",
        "two",
        "simple",
        "example",
        "direct",
        "interpretation",
        "r",
        "designates",
        "property",
        "rational",
        "designates",
        "property",
        "animal",
        "predicate",
        "h",
        "contrast",
        "interpreted",
        "indirect",
        "manner",
        "definition",
        "object",
        "language",
        "forall",
        "x",
        "hx",
        "leftrightarrow",
        "rx",
        "wedge",
        "ax",
        "interpretation",
        "symbol",
        "definition",
        "count",
        "one",
        "type",
        "indirect",
        "interpretation",
        "another",
        "type",
        "interpretation",
        "theoretical",
        "term",
        "axiom",
        "scientific",
        "theory",
        "carnap",
        "remains",
        "content",
        "merely",
        "syntactic",
        "explanation",
        "indirect",
        "interpretation",
        "calculus",
        "first",
        "constructed",
        "floating",
        "air",
        "speak",
        "construction",
        "begin",
        "top",
        "add",
        "lower",
        "lower",
        "level",
        "finally",
        "semantical",
        "rule",
        "lowest",
        "level",
        "anchored",
        "solid",
        "ground",
        "observable",
        "fact",
        "law",
        "whether",
        "general",
        "special",
        "directly",
        "interpreted",
        "singular",
        "sentence",
        "law",
        "tc",
        "thus",
        "simply",
        "adopted",
        "axiom",
        "calculus",
        "without",
        "assuming",
        "prior",
        "interpretation",
        "reference",
        "world",
        "theoretical",
        "term",
        "sentence",
        "phi",
        "axiom",
        "calculus",
        "c",
        "mean",
        "phi",
        "used",
        "formal",
        "derivation",
        "c",
        "without",
        "member",
        "premise",
        "account",
        "amount",
        "formalist",
        "understanding",
        "theoretical",
        "language",
        "science",
        "two",
        "particular",
        "merit",
        "first",
        "circumvents",
        "sneed",
        "problem",
        "theoretical",
        "term",
        "since",
        "axiom",
        "required",
        "true",
        "interpretation",
        "respective",
        "language",
        "represents",
        "fact",
        "theoryindependent",
        "world",
        "need",
        "assuming",
        "interpretation",
        "simply",
        "denied",
        "second",
        "account",
        "line",
        "contextual",
        "theory",
        "meaning",
        "theoretical",
        "term",
        "understanding",
        "term",
        "explained",
        "term",
        "axiom",
        "respective",
        "scientific",
        "theory",
        "cf",
        "section",
        "le",
        "formalist",
        "account",
        "indirect",
        "interpretation",
        "term",
        "explicit",
        "modeltheoretic",
        "notion",
        "przelecki",
        "ch",
        "andreas",
        "latter",
        "account",
        "based",
        "idea",
        "theoretical",
        "term",
        "carnap",
        "emerged",
        "investigation",
        "similarity",
        "dissimilarity",
        "carnapian",
        "postulate",
        "definition",
        "recall",
        "carnap",
        "viewed",
        "axiom",
        "scientific",
        "theory",
        "postulate",
        "since",
        "contribute",
        "interpretation",
        "theoretical",
        "term",
        "explaining",
        "carnap",
        "sentence",
        "tcr",
        "rightarrow",
        "tc",
        "carnap",
        "say",
        "ramsey",
        "sentence",
        "true",
        "theoretical",
        "term",
        "understood",
        "accordance",
        "interpretation",
        "satisfies",
        "tc",
        "sense",
        "say",
        "carnapian",
        "postulate",
        "contribute",
        "interpretation",
        "theoretical",
        "term",
        "manner",
        "akin",
        "interpretation",
        "defined",
        "term",
        "corresponding",
        "definition",
        "postulate",
        "definition",
        "alike",
        "impose",
        "constraint",
        "admissible",
        "intended",
        "interpretation",
        "complete",
        "language",
        "l",
        "v",
        "v",
        "contains",
        "basic",
        "indirectly",
        "interpreted",
        "term",
        "yet",
        "interpretation",
        "theoretical",
        "term",
        "axiom",
        "scientific",
        "theory",
        "differs",
        "several",
        "way",
        "defined",
        "term",
        "definition",
        "first",
        "introduction",
        "theoretical",
        "term",
        "may",
        "joined",
        "introduction",
        "another",
        "theoretical",
        "domain",
        "interpretation",
        "addition",
        "basic",
        "domain",
        "interpretation",
        "observation",
        "term",
        "interpreted",
        "second",
        "must",
        "assumed",
        "interpretation",
        "theoretical",
        "term",
        "result",
        "unique",
        "determination",
        "extension",
        "term",
        "implication",
        "carnap",
        "doctrine",
        "partial",
        "interpretation",
        "become",
        "obvious",
        "end",
        "section",
        "third",
        "axiom",
        "scientific",
        "theory",
        "conservative",
        "extension",
        "observation",
        "language",
        "since",
        "enable",
        "u",
        "make",
        "prediction",
        "definition",
        "contrast",
        "must",
        "conservative",
        "cf",
        "gupta",
        "taking",
        "difference",
        "account",
        "observing",
        "semantic",
        "similarity",
        "definition",
        "carnapian",
        "postulate",
        "suggests",
        "following",
        "explanation",
        "set",
        "tc",
        "axiom",
        "interprets",
        "set",
        "v_t",
        "theoretical",
        "term",
        "basis",
        "language",
        "l",
        "v_o",
        "imposes",
        "constraint",
        "admissible",
        "intended",
        "interpretation",
        "language",
        "l",
        "v_o",
        "v_t",
        "l",
        "v_o",
        "v_t",
        "structure",
        "admissible",
        "satisfies",
        "axiom",
        "tc",
        "ii",
        "extends",
        "intended",
        "interpretation",
        "l",
        "v_o",
        "include",
        "interpretation",
        "theoretical",
        "term",
        "formal",
        "term",
        "andreas",
        "przelecki",
        "ch",
        "definition",
        "set",
        "mathcal",
        "admissible",
        "structure",
        "let",
        "mathcal",
        "_o",
        "designate",
        "intended",
        "interpretation",
        "observation",
        "language",
        "mod",
        "tc",
        "designates",
        "set",
        "l",
        "v_o",
        "v_t",
        "structure",
        "satisfy",
        "axiom",
        "tc",
        "ext",
        "mathcal",
        "_o",
        "v_t",
        "d_t",
        "set",
        "l",
        "v_o",
        "v_t",
        "structure",
        "extend",
        "mathcal",
        "_o",
        "interpret",
        "theoretical",
        "term",
        "domain",
        "interpretation",
        "may",
        "extended",
        "domain",
        "d_t",
        "theoretical",
        "entity",
        "mathcal",
        "mod",
        "tc",
        "cap",
        "ext",
        "mathcal",
        "_o",
        "v_t",
        "d_t",
        "mod",
        "tc",
        "cap",
        "ext",
        "mathcal",
        "_o",
        "v_t",
        "d_t",
        "ne",
        "varnothing",
        "mathcal",
        "ext",
        "mathcal",
        "_o",
        "v_t",
        "d_t",
        "mod",
        "tc",
        "cap",
        "ext",
        "mathcal",
        "_o",
        "v_t",
        "d_t",
        "varnothing",
        "given",
        "range",
        "admissible",
        "ie",
        "intended",
        "structure",
        "following",
        "semantic",
        "rule",
        "theoretical",
        "sentence",
        "suggest",
        "definition",
        "semantics",
        "theoretical",
        "sentence",
        "nu",
        "l",
        "v_o",
        "v_t",
        "rightarrow",
        "f",
        "i",
        "nu",
        "phi",
        "t",
        "structure",
        "mathcal",
        "in",
        "mathcal",
        "mathcal",
        "vdash",
        "phi",
        "nu",
        "phi",
        "f",
        "structure",
        "mathcal",
        "in",
        "mathcal",
        "mathcal",
        "notvdash",
        "phi",
        "nu",
        "phi",
        "i",
        "indeterminate",
        "structure",
        "mathcal",
        "_",
        "mathcal",
        "_",
        "in",
        "mathcal",
        "mathcal",
        "_",
        "vdash",
        "phi",
        "mathcal",
        "_",
        "vdash",
        "phi",
        "semantic",
        "rule",
        "motivated",
        "supervaluation",
        "logic",
        "van",
        "fraassen",
        "priest",
        "ch",
        "sentence",
        "true",
        "true",
        "every",
        "admissible",
        "structure",
        "false",
        "contrast",
        "false",
        "every",
        "admissible",
        "structure",
        "sentence",
        "determinate",
        "truth",
        "value",
        "true",
        "least",
        "one",
        "admissible",
        "structure",
        "false",
        "least",
        "another",
        "structure",
        "also",
        "admissible",
        "property",
        "present",
        "semantics",
        "noteworthy",
        "first",
        "account",
        "carnap",
        "idea",
        "axiom",
        "tc",
        "twofold",
        "function",
        "viz",
        "setting",
        "forth",
        "empirical",
        "claim",
        "determining",
        "meaning",
        "theoretical",
        "term",
        "carnap",
        "one",
        "hand",
        "truth",
        "value",
        "axiom",
        "tc",
        "depend",
        "empirical",
        "observable",
        "fact",
        "axiom",
        "hand",
        "determine",
        "admissible",
        "interpretation",
        "theoretical",
        "term",
        "two",
        "seemingly",
        "contradictory",
        "property",
        "combined",
        "allowing",
        "axiom",
        "tc",
        "interpret",
        "theoretical",
        "term",
        "condition",
        "structure",
        "extends",
        "given",
        "interpretation",
        "observation",
        "language",
        "satisfies",
        "axiom",
        "structure",
        "theoretical",
        "term",
        "remain",
        "uninterpreted",
        "semantics",
        "therefore",
        "seen",
        "formally",
        "work",
        "old",
        "contextual",
        "theory",
        "meaning",
        "theoretical",
        "term",
        "second",
        "sneed",
        "problem",
        "theoretical",
        "term",
        "section",
        "arise",
        "present",
        "semantics",
        "since",
        "formulation",
        "problem",
        "bound",
        "standard",
        "truthconditional",
        "semantics",
        "third",
        "closely",
        "related",
        "ramsey",
        "view",
        "scientific",
        "theory",
        "following",
        "biconditional",
        "hold",
        "proposition",
        "tcr",
        "phi",
        "in",
        "tc",
        "nu",
        "phi",
        "t",
        "unlike",
        "ramsey",
        "account",
        "however",
        "semantics",
        "indirect",
        "interpretation",
        "dispense",
        "theoretical",
        "term",
        "rather",
        "shown",
        "allowing",
        "range",
        "admissible",
        "interpretation",
        "opposed",
        "single",
        "interpretation",
        "affect",
        "validity",
        "standard",
        "deductive",
        "reasoning",
        "andreas",
        "hence",
        "distinctive",
        "merit",
        "indirect",
        "interpretation",
        "semantics",
        "theoretical",
        "term",
        "theoretical",
        "term",
        "need",
        "recovered",
        "ramsey",
        "sentence",
        "first",
        "place",
        "label",
        "partial",
        "interpretation",
        "common",
        "literature",
        "describe",
        "carnap",
        "view",
        "theoretical",
        "term",
        "interpreted",
        "axiom",
        "postulate",
        "scientific",
        "theory",
        "suppe",
        "partial",
        "character",
        "interpretation",
        "retained",
        "present",
        "account",
        "since",
        "range",
        "admissible",
        "interpretation",
        "complete",
        "language",
        "l",
        "v_o",
        "v_t",
        "allows",
        "interpretation",
        "theoretical",
        "term",
        "strengthened",
        "postulate",
        "carnap",
        "demanded",
        "strengthen",
        "interpretation",
        "theoretical",
        "term",
        "constrain",
        "range",
        "admissible",
        "interpretation",
        "l",
        "v_o",
        "v_t",
        "happens",
        "axiom",
        "tc",
        "inconsistent",
        "fail",
        "empirically",
        "adequate",
        "word",
        "happens",
        "interpretation",
        "theoretical",
        "term",
        "interpretation",
        "satisfies",
        "axiom",
        "agrees",
        "antecedent",
        "interpretation",
        "observation",
        "term",
        "case",
        "axiom",
        "respective",
        "theory",
        "fail",
        "interpret",
        "theoretical",
        "term",
        "set",
        "admissible",
        "structure",
        "defined",
        "definition",
        "empty",
        "time",
        "think",
        "understanding",
        "theoretical",
        "term",
        "even",
        "respective",
        "theory",
        "fails",
        "fully",
        "consistent",
        "empirical",
        "data",
        "example",
        "think",
        "understanding",
        "theretical",
        "term",
        "classical",
        "mechanic",
        "even",
        "though",
        "classical",
        "mechanic",
        "universally",
        "applicable",
        "moreover",
        "seem",
        "inconsistent",
        "yet",
        "nontrivial",
        "scientific",
        "theory",
        "classical",
        "electrodynamics",
        "consequently",
        "andreas",
        "generalized",
        "present",
        "semantics",
        "capture",
        "scientific",
        "reasoning",
        "paraconsistent",
        "setting",
        "proposal",
        "based",
        "preferredmodels",
        "semantics",
        "satisfaction",
        "theory",
        "agreement",
        "empirical",
        "data",
        "come",
        "degree",
        "interpretation",
        "score",
        "better",
        "others",
        "idea",
        "lead",
        "strict",
        "partial",
        "order",
        "interpretation",
        "understand",
        "theoretical",
        "term",
        "manner",
        "set",
        "instance",
        "axiom",
        "satisfied",
        "maximal",
        "extent",
        "context",
        "given",
        "interpretation",
        "observation",
        "term",
        "proposal",
        "parallel",
        "certain",
        "adaptive",
        "logic",
        "developed",
        "batens",
        "meheus",
        "et",
        "al",
        "notably",
        "allows",
        "u",
        "capture",
        "scientific",
        "reasoning",
        "ceteris",
        "paribus",
        "law",
        "ie",
        "law",
        "hold",
        "true",
        "time",
        "exception",
        "could",
        "helpful",
        "analysis",
        "theoretical",
        "term",
        "scientific",
        "discipline",
        "physic",
        "relatively",
        "little",
        "research",
        "done",
        "semantics",
        "theoretical",
        "term",
        "theory",
        "scientific",
        "discipline",
        "physic",
        "remained",
        "open",
        "question",
        "whether",
        "formal",
        "semantics",
        "primarily",
        "developed",
        "capture",
        "theory",
        "physic",
        "applicable",
        "theory",
        "biology",
        "chemistry",
        "psychology",
        "economics",
        "etc",
        "structuralist",
        "framework",
        "balzer",
        "et",
        "al",
        "could",
        "shown",
        "application",
        "feasible",
        "see",
        "balzer",
        "et",
        "al",
        "rakover",
        "mcclimans",
        "studied",
        "theoretical",
        "term",
        "psychology",
        "albeit",
        "without",
        "explicit",
        "consideration",
        "formal",
        "semantics"
    ]
}