{
    "main_text": "Metaphysics and Physics\n3. Metaphysics and Physics\n\nTheophrastus’ short treatise Metaphysics or On\nFirst Principles is an inquiry into the foundations of natural\nscience; it studies the first principles of nature as well as their\nrelationship to the world of perceptible and changeable entities. It\nis recognized by scholars as an integral and independent work, which\nwas most probably written during Theophrastus’ stay in Assos or,\nat the latest, at the very beginning of Aristotle’s final stay\nin Athens; that is to say, in the period between 347 and 334 BCE. The\nearly date of the composition of this treatise has been argued mainly\non the basis of the following two considerations: (i) Theophrastus\nseems to have known nothing of the central and latest books of\nAristotle’s Metaphysics, and thus concentrated all his\ncomments on the older books, and especially on book Lambda. (ii) Some\nof the puzzles raised by Theophrastus in this treatise are resolved in\nAristotle’s works On the Parts of Animals and On\nthe Generation of Animals; had the Aristotelian works been\navailable to him, he would not have made these remarks (see Most 1988;\nDevereux 1988; Huby 2015).\n\nTo investigate the first principles of nature, Theophrastus depended\non various observations of natural phenomena as well as on existing\ntheories by earlier and contemporary thinkers, which are presented in\nthis treatise sometimes in a sketchy manner and sometimes in more\ndetail. In the case of the Academy, for instance, we find allusions to\nimportant metaphysical views introduced by Plato, but also by\nSpeusippus and Xenocrates. These references cannot be said to\nconstitute mere doxography, since they seem to have served the purposes of\na dialectical examination. Theophrastus subjected the views of other\nphilosophers to a series of objections and criticisms, while he\navoided making definitive assertions; this gives the whole treatise an\naporetic character, which has been compared both with\nAristotle’s Metaphysics B, but also with the style of\nMetaphysics A.\n\nThe first and main subject, occupying more than half of\nTheophrastus’ Metaphysics, is the nature and properties\nof first principles. More specifically, this treatise begins by\ndemarcating the study of first principles as distinct from the objects\nof nature to which they are to be related. Next, it\ndiscusses the nature, number, identity and causality of first\nprinciples; the motion of celestial spheres, and how these connect to\nthe sublunar world; the properties of first principles, i.e., whether\nthey are indeterminate, determinate, or both, and how to understand\ntheir property of being at rest. The first part is followed by two\nextensive appendices, investigating problems relating to the main\nsubject: (i) on epistemology, i.e., on determining the methods of\nknowing everything from first principles down to inanimate beings, and\nhence the nature of the connection between intelligibles and\nsensibles; and (ii) on teleology, i.e., on testing the alternative\nviews of the application to the universe of a certain first principle,\nnamely the principle that everything has a final cause and that nature\ndoes nothing in vain. It is particularly noteworthy that, in his\nMetaphysics, Theophrastus seems not to have been interested\nto explore some of the central themes of Aristotle’s thought,\nnamely those concerned with the being qua being, the relation\nbetween form and matter and the problem of universals (see Sharples 2015).\n\nThe subject of Theophrastus’ take on Aristotle’s teleology\nhas been at the centre of contemporary scholarship.\nTheophrastus’ Metaphysics refers to passages in\nAristotle’s writings that reveal him struggling to explain\ncertain phenomena in terms of his teleological principle, when it may\nhave been better for him to admit that such explanations are simply\ninappropriate. For instance, Theophrastus claimed that natural\nphenomena such as extremely dry and moist seasons, the size of the\ndeer’s horns, or the insects that only live for a day seem to\nviolate the principle that all things in nature are for the sake of\nsomething. He thus suggested that such instances should urge us to\nquestion whether teleological reasons should be put forward in all\ncases without qualification, as well as to acknowledge that there may\nbe limits to the determination of causes. This does not mean, however,\nthat Theophrastus failed to recognize the role of necessity in nature\nnor that he rejected all teleological explanations, though it is true\nthat in his surviving works there are few such examples. So, his\nattitude in this issue should rather be interpreted as showing nothing\nbut caution towards an indiscriminate application of the principle\nthat nature does nothing in vain (see Lennox 1985; Repici 1990; van\nRaalte 1993: 491–2; Gourinat 2015).\n\nAristotle’s teleological worldview seems to give way, in\nTheophrastus’ Metaphysics, to a conception of the\nuniverse as an organism, according to which the cosmos is a single,\ncomplete and coherent entity compared to a living creature. The key\nTheophrastean term for the relationship between intelligibles and\nsensibles is “connection” (sunaphē), which\nis to be understood as a particular kinship characteristic of entities\nthat are inseparable parts of a continuous whole, bound by some\n“partnership” (koinōnia) of a hierarchical\nbut also reciprocal nature. Hence, by claiming that the universe is a\nsingle system subject to one set of laws, Theophrastus questioned\nAristotle’s division between the sublunary and the celestial\nspheres as well as Plato’s tendencies towards dualism. Most\nimportantly, since his unified and coherent cosmos is thought of as an\nensouled and divine being, whose movement becomes the product of\nforces inherent in its different parts, Theophrastus did not think\nthere is need for any additional principle. In other words, it seems\nthat Theophrastus preferred to locate the cause of the movement of the\nheavens in the heavens themselves, rather than in their desire for\nsomething else, and he thus abandoned the Prime Unmoved Mover\npostulated by Aristotle. But although it is generally agreed that\nTheophrastus deviated in this respect from Aristotle, it has also been\nargued that Theophrastus may have been mainly interested to point out\nthe need to supplement this postulate with explanations of perceptible\nmovements, since the Unmoved Mover could never by itself determine all\nof them in full. Besides, it has also been pointed out that Aristotle\ndid not himself believe in an Unmoved Mover of the heavens throughout\nhis career, and other Aristotelians, for instance Alexander of\nAphrodisias, continued later to question whether an Unmoved Mover\nactually plays an essential part in the movement of the heavens (see\nSharples 1985a; Lefebvre 2015; Berti 2015).\n\nTheophrastus discussed the first principles of nature not only in his\nMetaphysics, but also in his various treatises on natural\nphilosophy; there are passages from Simplicius’ and\nPhiloponus’ commentaries on Aristotle’s Physics\n(frs. 144A–B FHS&G), which suggest that physics, according\nto Theophrastus, is just as much concerned with the first principles\nof nature as with its causes and elements. Many titles of\nTheophrastus’ works on natural philosophy are mentioned in our\nsources, e.g., Physics, Opinions of the Natural\nPhilosophers or Opinions in Natural Philosophy, On\nNature, On the Heavens, Meteorology, though it\nis difficult to determine from their few surviving fragments whether\nthey are collections of doxographical material or whether they present\nTheophrastus’ own theories (see Mansfeld 1992; Zhmud 2001, 2006:\n117–65). But even in his role as a doxographer, Theophrastus\nseems to have been careful in expounding accurately the physical\ndoctrines of his predecessors, and presumably more careful than\nAristotle, whether he agreed with them or not (see McDiarmid 1953;\nSchofield 2002).\n\nConcerning Theophrastus’ account of the four elements, it has\nbeen debated to what extent this conforms to the Aristotelian\ndoctrine. In particular, it is not clear whether Theophrastus followed\nAristotle in holding that the heavens are made of a fifth element, the\nether, distinct from the four sublunary elements, or whether he\nclaimed that the heavens are simply made of fire (frs. 158–168\nFHS&G). It has been argued, for instance, that Theophrastus\nabandoned the fifth element, but used it only in arguments against\nPlato without endorsing it himself (see Steinmetz 1964). There is no\ndoubt, on the other hand, that he gave prominence to the element of\nfire. In his short treatise On Fire, Theophrastus\ndistinguished heavenly fire from terrestrial fire, which is always\nmixed with other elements, and pointed out that, in contrast to the\nother three elements, terrestrial fire can be generated artificially\nand constantly requires refuelling. Most importantly, Theophrastus\npostulated that fire, or heat, is active while the other three\nelements are passive (fr. 177 FHS&G). In fact, this Theophrastean\nview has been interpreted as a serious departure from\nAristotle’s physics, according to which hot and cold are active\nwhile moist and dry are passive. Against this interpretation, however,\nit has been remarked that, since the Aristotelian biology postulates\nonly the hot as active, Theophrastus did nothing but extend\nAristotle’s view to physics in general (see Longrigg 1975).\nFurthermore, although some scholars have presented the action of the\nhot as constituting for Theophrastus the reason for the interchanges\nbetween the elements, others have counterclaimed that these should be\nunderstood as qualitative and not just due to a mechanical mixture\n(see Steinmetz 1964; Gottschalk 1967).\n\nBut there are occasions in which Theophrastus’ explanations of\nphysical phenomena clearly differ from Aristotle’s. He explains,\nfor instance, the composition of the winds entirely by dry exhalations\n(frs. 186–194 FHS&G); the sideways motion of the winds by\nthe rotation of the heavens (fr. 186 FHS&G); the saltiness of the\nsea by dry exhalation from the land being carried down again in the\nrain (fr. 220 FHS&G); the rainfall and condensation by direct\nphysical pressure rather than by the effect of cooling (fr. 211\nFHS&G).\n\nFinally, although it seems that Theophrastus’ account of time as\nan accidental attribute of motion is a fairly minor amendment of the\nAristotelian thesis that time is the number of motion (frs.\n151A–C FHS&G), his analysis of place is more interesting.\nSimplicius reports in his commentary on Aristotle’s\nPhysics that Theophrastus indicated a number of difficulties\nresulting from the Aristotelian definition of place as the inner\nboundary of the surrounding body (fr. 146 FHS&G), and thus\nquestioned whether place may be not something that exists in its own\nright, but rather the arrangement and position of a thing as part of\nan ordered whole (fr. 149 FHS&G). Simplicius, moreover, refers to\na passage from Theophrastus’ Physics which he takes to\nbear witness to the relational theory of place that Simplicius himself\nadopts, following his teacher Damascius. In fact, this has been the\ntraditional interpretation of Theophrastus’ account of place,\nnamely that he developed a relational theory of place as a full-blown\nalternative to Aristotle’s defective theory of an absolute\nconcept of place.\n\nNevertheless, a qualified version of the traditional view has been put\nforward as more plausible, according to which Theophrastus’\naccount should not be read as a fully developed conception of place,\nbut as an objection specifically directed against Aristotle’s\nnotion of natural place; that is to say, Theophrastus only attempted\nto provide a new account of natural place within a wider world order,\nrather than of place, in general, as an abstract and quasi-geometrical\nconcept (see Sorabji 1988). Against this interpretation, it has been\nargued that Theophrastus did not have as his target Aristotle’s\nnotion of natural place; in fact, Theophrastus never developed a\ndetailed and coherent alternative theory of place, and the phrasing of\nhis account points most probably to a dialectical context (see Algra\n1992). Lastly, it has also been suggested recently that Theophrastus\ndid not think that his objections to the Aristotelian theory of place\nwere insoluble, and the text cited by Simplicius as bearing witness to\nDamascius’ view is not inconsistent with Aristotle’s\naccount of place; hence, Theophrastus did not offer a new or competing\ntheory of place, but rather shared Aristotle’s view of what\nplace is (see Morison 2010).\n\n",
    "section_title": "3. Metaphysics and Physics",
    "entry_title": "Theophrastus",
    "hierarchy_title": "Theophrastus || Metaphysics and Physics",
    "tokenized_text": [
        "metaphysics",
        "physic",
        "metaphysics",
        "physic",
        "theophrastus",
        "short",
        "treatise",
        "metaphysics",
        "first",
        "principle",
        "inquiry",
        "foundation",
        "natural",
        "science",
        "study",
        "first",
        "principle",
        "nature",
        "well",
        "relationship",
        "world",
        "perceptible",
        "changeable",
        "entity",
        "recognized",
        "scholar",
        "integral",
        "independent",
        "work",
        "probably",
        "written",
        "theophrastus",
        "stay",
        "assos",
        "latest",
        "beginning",
        "aristotle",
        "final",
        "stay",
        "athens",
        "say",
        "period",
        "bce",
        "early",
        "date",
        "composition",
        "treatise",
        "argued",
        "mainly",
        "basis",
        "following",
        "two",
        "consideration",
        "theophrastus",
        "seems",
        "known",
        "nothing",
        "central",
        "latest",
        "book",
        "aristotle",
        "metaphysics",
        "thus",
        "concentrated",
        "comment",
        "older",
        "book",
        "especially",
        "book",
        "lambda",
        "ii",
        "puzzle",
        "raised",
        "theophrastus",
        "treatise",
        "resolved",
        "aristotle",
        "work",
        "part",
        "animal",
        "generation",
        "animal",
        "aristotelian",
        "work",
        "available",
        "would",
        "made",
        "remark",
        "see",
        "devereux",
        "huby",
        "investigate",
        "first",
        "principle",
        "nature",
        "theophrastus",
        "depended",
        "various",
        "observation",
        "natural",
        "phenomenon",
        "well",
        "existing",
        "theory",
        "earlier",
        "contemporary",
        "thinker",
        "presented",
        "treatise",
        "sometimes",
        "sketchy",
        "manner",
        "sometimes",
        "detail",
        "case",
        "academy",
        "instance",
        "find",
        "allusion",
        "important",
        "metaphysical",
        "view",
        "introduced",
        "plato",
        "also",
        "speusippus",
        "xenocrates",
        "reference",
        "said",
        "constitute",
        "mere",
        "doxography",
        "since",
        "seem",
        "served",
        "purpose",
        "dialectical",
        "examination",
        "theophrastus",
        "subjected",
        "view",
        "philosopher",
        "series",
        "objection",
        "criticism",
        "avoided",
        "making",
        "definitive",
        "assertion",
        "give",
        "whole",
        "treatise",
        "aporetic",
        "character",
        "compared",
        "aristotle",
        "metaphysics",
        "b",
        "also",
        "style",
        "metaphysics",
        "a",
        "first",
        "main",
        "subject",
        "occupying",
        "half",
        "theophrastus",
        "metaphysics",
        "nature",
        "property",
        "first",
        "principle",
        "specifically",
        "treatise",
        "begin",
        "demarcating",
        "study",
        "first",
        "principle",
        "distinct",
        "object",
        "nature",
        "related",
        "next",
        "discus",
        "nature",
        "number",
        "identity",
        "causality",
        "first",
        "principle",
        "motion",
        "celestial",
        "sphere",
        "connect",
        "sublunar",
        "world",
        "property",
        "first",
        "principle",
        "ie",
        "whether",
        "indeterminate",
        "determinate",
        "understand",
        "property",
        "rest",
        "first",
        "part",
        "followed",
        "two",
        "extensive",
        "appendix",
        "investigating",
        "problem",
        "relating",
        "main",
        "subject",
        "epistemology",
        "ie",
        "determining",
        "method",
        "knowing",
        "everything",
        "first",
        "principle",
        "inanimate",
        "being",
        "hence",
        "nature",
        "connection",
        "intelligibles",
        "sensibles",
        "ii",
        "teleology",
        "ie",
        "testing",
        "alternative",
        "view",
        "application",
        "universe",
        "certain",
        "first",
        "principle",
        "namely",
        "principle",
        "everything",
        "final",
        "cause",
        "nature",
        "nothing",
        "vain",
        "particularly",
        "noteworthy",
        "metaphysics",
        "theophrastus",
        "seems",
        "interested",
        "explore",
        "central",
        "theme",
        "aristotle",
        "thought",
        "namely",
        "concerned",
        "qua",
        "relation",
        "form",
        "matter",
        "problem",
        "universal",
        "see",
        "sharples",
        "subject",
        "theophrastus",
        "take",
        "aristotle",
        "teleology",
        "centre",
        "contemporary",
        "scholarship",
        "theophrastus",
        "metaphysics",
        "refers",
        "passage",
        "aristotle",
        "writing",
        "reveal",
        "struggling",
        "explain",
        "certain",
        "phenomenon",
        "term",
        "teleological",
        "principle",
        "may",
        "better",
        "admit",
        "explanation",
        "simply",
        "inappropriate",
        "instance",
        "theophrastus",
        "claimed",
        "natural",
        "phenomenon",
        "extremely",
        "dry",
        "moist",
        "season",
        "size",
        "deer",
        "horn",
        "insect",
        "live",
        "day",
        "seem",
        "violate",
        "principle",
        "thing",
        "nature",
        "sake",
        "something",
        "thus",
        "suggested",
        "instance",
        "urge",
        "u",
        "question",
        "whether",
        "teleological",
        "reason",
        "put",
        "forward",
        "case",
        "without",
        "qualification",
        "well",
        "acknowledge",
        "may",
        "limit",
        "determination",
        "cause",
        "mean",
        "however",
        "theophrastus",
        "failed",
        "recognize",
        "role",
        "necessity",
        "nature",
        "rejected",
        "teleological",
        "explanation",
        "though",
        "true",
        "surviving",
        "work",
        "example",
        "attitude",
        "issue",
        "rather",
        "interpreted",
        "showing",
        "nothing",
        "caution",
        "towards",
        "indiscriminate",
        "application",
        "principle",
        "nature",
        "nothing",
        "vain",
        "see",
        "lennox",
        "repici",
        "van",
        "raalte",
        "gourinat",
        "aristotle",
        "teleological",
        "worldview",
        "seems",
        "give",
        "way",
        "theophrastus",
        "metaphysics",
        "conception",
        "universe",
        "organism",
        "according",
        "cosmos",
        "single",
        "complete",
        "coherent",
        "entity",
        "compared",
        "living",
        "creature",
        "key",
        "theophrastean",
        "term",
        "relationship",
        "intelligibles",
        "sensibles",
        "connection",
        "sunaphē",
        "understood",
        "particular",
        "kinship",
        "characteristic",
        "entity",
        "inseparable",
        "part",
        "continuous",
        "whole",
        "bound",
        "partnership",
        "koinōnia",
        "hierarchical",
        "also",
        "reciprocal",
        "nature",
        "hence",
        "claiming",
        "universe",
        "single",
        "system",
        "subject",
        "one",
        "set",
        "law",
        "theophrastus",
        "questioned",
        "aristotle",
        "division",
        "sublunary",
        "celestial",
        "sphere",
        "well",
        "plato",
        "tendency",
        "towards",
        "dualism",
        "importantly",
        "since",
        "unified",
        "coherent",
        "cosmos",
        "thought",
        "ensouled",
        "divine",
        "whose",
        "movement",
        "becomes",
        "product",
        "force",
        "inherent",
        "different",
        "part",
        "theophrastus",
        "think",
        "need",
        "additional",
        "principle",
        "word",
        "seems",
        "theophrastus",
        "preferred",
        "locate",
        "cause",
        "movement",
        "heaven",
        "heaven",
        "rather",
        "desire",
        "something",
        "else",
        "thus",
        "abandoned",
        "prime",
        "unmoved",
        "mover",
        "postulated",
        "aristotle",
        "although",
        "generally",
        "agreed",
        "theophrastus",
        "deviated",
        "respect",
        "aristotle",
        "also",
        "argued",
        "theophrastus",
        "may",
        "mainly",
        "interested",
        "point",
        "need",
        "supplement",
        "postulate",
        "explanation",
        "perceptible",
        "movement",
        "since",
        "unmoved",
        "mover",
        "could",
        "never",
        "determine",
        "full",
        "besides",
        "also",
        "pointed",
        "aristotle",
        "believe",
        "unmoved",
        "mover",
        "heaven",
        "throughout",
        "career",
        "aristotelian",
        "instance",
        "alexander",
        "aphrodisia",
        "continued",
        "later",
        "question",
        "whether",
        "unmoved",
        "mover",
        "actually",
        "play",
        "essential",
        "part",
        "movement",
        "heaven",
        "see",
        "sharples",
        "a",
        "lefebvre",
        "berti",
        "theophrastus",
        "discussed",
        "first",
        "principle",
        "nature",
        "metaphysics",
        "also",
        "various",
        "treatise",
        "natural",
        "philosophy",
        "passage",
        "simplicius",
        "philoponus",
        "commentary",
        "aristotle",
        "physic",
        "fr",
        "ab",
        "fhs",
        "g",
        "suggest",
        "physic",
        "according",
        "theophrastus",
        "much",
        "concerned",
        "first",
        "principle",
        "nature",
        "cause",
        "element",
        "many",
        "title",
        "theophrastus",
        "work",
        "natural",
        "philosophy",
        "mentioned",
        "source",
        "eg",
        "physic",
        "opinion",
        "natural",
        "philosopher",
        "opinion",
        "natural",
        "philosophy",
        "nature",
        "heaven",
        "meteorology",
        "though",
        "difficult",
        "determine",
        "surviving",
        "fragment",
        "whether",
        "collection",
        "doxographical",
        "material",
        "whether",
        "present",
        "theophrastus",
        "theory",
        "see",
        "mansfeld",
        "zhmud",
        "even",
        "role",
        "doxographer",
        "theophrastus",
        "seems",
        "careful",
        "expounding",
        "accurately",
        "physical",
        "doctrine",
        "predecessor",
        "presumably",
        "careful",
        "aristotle",
        "whether",
        "agreed",
        "see",
        "mcdiarmid",
        "schofield",
        "concerning",
        "theophrastus",
        "account",
        "four",
        "element",
        "debated",
        "extent",
        "conforms",
        "aristotelian",
        "doctrine",
        "particular",
        "clear",
        "whether",
        "theophrastus",
        "followed",
        "aristotle",
        "holding",
        "heaven",
        "made",
        "fifth",
        "element",
        "ether",
        "distinct",
        "four",
        "sublunary",
        "element",
        "whether",
        "claimed",
        "heaven",
        "simply",
        "made",
        "fire",
        "fr",
        "fhs",
        "g",
        "argued",
        "instance",
        "theophrastus",
        "abandoned",
        "fifth",
        "element",
        "used",
        "argument",
        "plato",
        "without",
        "endorsing",
        "see",
        "steinmetz",
        "doubt",
        "hand",
        "gave",
        "prominence",
        "element",
        "fire",
        "short",
        "treatise",
        "fire",
        "theophrastus",
        "distinguished",
        "heavenly",
        "fire",
        "terrestrial",
        "fire",
        "always",
        "mixed",
        "element",
        "pointed",
        "contrast",
        "three",
        "element",
        "terrestrial",
        "fire",
        "generated",
        "artificially",
        "constantly",
        "requires",
        "refuelling",
        "importantly",
        "theophrastus",
        "postulated",
        "fire",
        "heat",
        "active",
        "three",
        "element",
        "passive",
        "fr",
        "fhs",
        "g",
        "fact",
        "theophrastean",
        "view",
        "interpreted",
        "serious",
        "departure",
        "aristotle",
        "physic",
        "according",
        "hot",
        "cold",
        "active",
        "moist",
        "dry",
        "passive",
        "interpretation",
        "however",
        "remarked",
        "since",
        "aristotelian",
        "biology",
        "postulate",
        "hot",
        "active",
        "theophrastus",
        "nothing",
        "extend",
        "aristotle",
        "view",
        "physic",
        "general",
        "see",
        "longrigg",
        "furthermore",
        "although",
        "scholar",
        "presented",
        "action",
        "hot",
        "constituting",
        "theophrastus",
        "reason",
        "interchange",
        "element",
        "others",
        "counterclaimed",
        "understood",
        "qualitative",
        "due",
        "mechanical",
        "mixture",
        "see",
        "steinmetz",
        "gottschalk",
        "occasion",
        "theophrastus",
        "explanation",
        "physical",
        "phenomenon",
        "clearly",
        "differ",
        "aristotle",
        "explains",
        "instance",
        "composition",
        "wind",
        "entirely",
        "dry",
        "exhalation",
        "fr",
        "fhs",
        "g",
        "sideways",
        "motion",
        "wind",
        "rotation",
        "heaven",
        "fr",
        "fhs",
        "g",
        "saltiness",
        "sea",
        "dry",
        "exhalation",
        "land",
        "carried",
        "rain",
        "fr",
        "fhs",
        "g",
        "rainfall",
        "condensation",
        "direct",
        "physical",
        "pressure",
        "rather",
        "effect",
        "cooling",
        "fr",
        "fhs",
        "g",
        "finally",
        "although",
        "seems",
        "theophrastus",
        "account",
        "time",
        "accidental",
        "attribute",
        "motion",
        "fairly",
        "minor",
        "amendment",
        "aristotelian",
        "thesis",
        "time",
        "number",
        "motion",
        "fr",
        "ac",
        "fhs",
        "g",
        "analysis",
        "place",
        "interesting",
        "simplicius",
        "report",
        "commentary",
        "aristotle",
        "physic",
        "theophrastus",
        "indicated",
        "number",
        "difficulty",
        "resulting",
        "aristotelian",
        "definition",
        "place",
        "inner",
        "boundary",
        "surrounding",
        "body",
        "fr",
        "fhs",
        "g",
        "thus",
        "questioned",
        "whether",
        "place",
        "may",
        "something",
        "exists",
        "right",
        "rather",
        "arrangement",
        "position",
        "thing",
        "part",
        "ordered",
        "whole",
        "fr",
        "fhs",
        "g",
        "simplicius",
        "moreover",
        "refers",
        "passage",
        "theophrastus",
        "physic",
        "take",
        "bear",
        "witness",
        "relational",
        "theory",
        "place",
        "simplicius",
        "adopts",
        "following",
        "teacher",
        "damascius",
        "fact",
        "traditional",
        "interpretation",
        "theophrastus",
        "account",
        "place",
        "namely",
        "developed",
        "relational",
        "theory",
        "place",
        "fullblown",
        "alternative",
        "aristotle",
        "defective",
        "theory",
        "absolute",
        "concept",
        "place",
        "nevertheless",
        "qualified",
        "version",
        "traditional",
        "view",
        "put",
        "forward",
        "plausible",
        "according",
        "theophrastus",
        "account",
        "read",
        "fully",
        "developed",
        "conception",
        "place",
        "objection",
        "specifically",
        "directed",
        "aristotle",
        "notion",
        "natural",
        "place",
        "say",
        "theophrastus",
        "attempted",
        "provide",
        "new",
        "account",
        "natural",
        "place",
        "within",
        "wider",
        "world",
        "order",
        "rather",
        "place",
        "general",
        "abstract",
        "quasigeometrical",
        "concept",
        "see",
        "sorabji",
        "interpretation",
        "argued",
        "theophrastus",
        "target",
        "aristotle",
        "notion",
        "natural",
        "place",
        "fact",
        "theophrastus",
        "never",
        "developed",
        "detailed",
        "coherent",
        "alternative",
        "theory",
        "place",
        "phrasing",
        "account",
        "point",
        "probably",
        "dialectical",
        "context",
        "see",
        "algra",
        "lastly",
        "also",
        "suggested",
        "recently",
        "theophrastus",
        "think",
        "objection",
        "aristotelian",
        "theory",
        "place",
        "insoluble",
        "text",
        "cited",
        "simplicius",
        "bearing",
        "witness",
        "damascius",
        "view",
        "inconsistent",
        "aristotle",
        "account",
        "place",
        "hence",
        "theophrastus",
        "offer",
        "new",
        "competing",
        "theory",
        "place",
        "rather",
        "shared",
        "aristotle",
        "view",
        "place",
        "see",
        "morison"
    ]
}