{
    "main_text": "Life and Works\n1. Life and Works\n\nDiogenes Laertius is our main source for Theophrastus’ life and\nworks. In his Life of Theophrastus V. 36–38 (fr. 1\nFHS&G: for this abbreviation, see Primary Literature\nBibliography), he reports that Theophrastus was born in Eresos on the\nisland of Lesbos around 371 BCE and his original name was Tyrtamus,\nbut Aristotle changed it to Theophrastus because of the godlike manner\nof his speech (theos-phrazein). According to Diogenes\nLaertius, early in his life Theophrastus was a student of an otherwise\nunheard of Alcippus in his native city and then of Plato in the\nAcademy, where he met Aristotle, who was not more than fifteen years\nhis senior and with whom he had a relationship of colleagues or\nassociates rather than one of teacher and pupil. After Plato’s\ndeath in 347 BCE, Theophrastus travelled with Aristotle to Assos in\nAsia Minor, back to Lesbos, and later on to Macedonia, because\nAristotle was summoned there as tutor of Alexander. Around 335 BCE\nthey both returned to Athens. Aristotle founded his school at the\nLyceum but he had to leave again, when Alexander died in 323 BCE, due\nto the increasing anti-Macedonian feelings. Theophrastus succeeded\nAristotle at the school, which during the next thirty-five years,\nunder his headship, acquired a more institutionalized character. It is\nreported that he lectured to as many as two thousand pupils at a time\nat the Peripatos, among whom we find the Academic skeptic Arcesilaus,\nwho left him for Polemo’s Academy, the comic poet Menander and\nthe politician Demetrius of Phalerum. So, when Demetrius became\ngovernor of Athens in 317 BCE in the Macedonian interest, he protected\nand helped Theophrastus, whose situation had become precarious, as is\ntestified by a prosecution of impiety that was brought against him by\na certain Agnonides.  After Demetrius’ expulsion in 307 BCE, he\nwas again persecuted, more seriously this time, when a law was passed\nforbidding anyone to open a school of philosophy without a government\nlicense; Theophrastus as well as many other philosophers left Athens,\nand he returned only when the law was repealed a year later. He died\naround 287 BCE and in his will, which survives in a copy provided by\nDiogenes Laertius (V. 51–57), he left all his books to his\ndisciple Neleus, including the manuscripts of Aristotle’s works,\nwhich he had inherited when he took over the Lyceum.\n\nDiogenes attributes to Theophrastus well over two hundred\nseparate treatises in different styles, of varying length and on a\nvery wide range of topics, totaling 232,808 lines; of these less than\nten per cent survives. Some works seem to have been intended for use\nwithin the school as basis for Theophrastus’ lectures, while\nothers were intended for a wider audience and they were, therefore,\nwritten in a popular style or in dialogue form. Judging from the\nsurviving material and from their titles, some works were on the same\ntopics as ones by Aristotle, whereas others seem to have dealt with\ntopics related to those of the Aristotelian treatises but not covered\nby them.\n\nUnfortunately, only a few Theophrastean works are extant, mainly\nbecause they seem to have been particularly influential in later\nperiods, and were recopied then for that reason:\n\nTwo large treatises on botany, which constitute the first\nsystematization of the botanical world and one of the most important\ncontributions to botanical science during antiquity and the Middle\nAges:\n\n\nPlant Explanations, six books on the vital functions of plants and\ntheir causes.\nEnquiry into Plants, nine books with material relevant\nfor the writing of Plant Explanations.\n \nThe Characters, a collection of thirty concise, often\nhumorous sketches of negative types of individuals from everyday\nAthenian life.\nTwo short independent treatises:\n\n\nMetaphysics or On First Principles, a treatise\ninvestigating the principles of nature.\nOn the Senses or On Sensations, a treatise\ndealing with theories concerning the senses and their objects from\nParmenides to Democritus and Plato.\n\nA number of minor treatises on more specialized topics:\n\n\nOn Odours, on the production of different perfumes and\non their medicinal characteristics and effects.\nOn Fire, on the origins and properties of fire.\nOn Winds, on the phenomenon of winds and their various\ntypes and aetiology.\nOn Stones, on the origins and various types of stones\nwith a particular focus on precious stones.\nOn Weather Signs, a practical guide of meteorological\nprognoses for the general reader, especially farmers and sailors.\nOn Sweat, on the sources and certain distinctive\nqualities of sweat.\nOn Fatigue, on the seats, symptoms and causes of\nfatigue.\nOn Dizziness, on the phenomenon and causes of\ndizziness.\nOn Fish, on the unusual phenomena of fish which venture\nonto dry land and live in air, or burrow into the ground.\n\n\n\nApart from these extant works, we know that Theophrastus wrote\ntreatises on many more subjects in all areas of philosophy, but of\nthose we have only their titles, some fragments, and few reports and\nparaphrases. The ancient authors who refer to Theophrastus’\nwritings are diverse and vary greatly in their reliability. For\ninstance, traces of Theophrastus’ doctrines can be found in the\nworks of Plutarch, Alexander of Aphrodisias, Galen, Sextus Empiricus,\nDiogenes Laertius, Pliny the Elder, Priscian, Simplicius, Themistius,\nPhotius as well as in Arabic authors (Averroes,\nal-Fārābī, Ibn-an-Nadīm) and Latin sources (Albert\nthe Great, Thomas Aquinas). The following list of titles of\nTheophrastus’ writings\ngives an idea of his prolific philosophical production:\n\nOn logic: On Affirmation and Denial, Prior and\nPosterior Analytics, On the Analysis of Syllogisms,\nDefinitions, Topics, The Reduction of Topics, Preliminaries\nto the Topics, Dialectical Arguments,\nObjections, Sophisms, On the Liar.\nOn physics and psychology: Physics, Opinions of the\nNatural Philosophers or Opinions in Natural Philosophy,\nOn Nature, On the Heavens, Meteorology,\nOn the Soul, On Vision, On Experience.\nOn ethics and politics: On Emotions, On the\nVoluntary, On Virtue, On Happiness, On Marriage, On\nWealth, On Retribution, On Friendship, On\nPleasure, On Drunkenness, Politics, Political\nCustoms, On Kingship, On the Education of a King,\nLaws.\nFinally, on rhetoric, poetics and music: On the Art of\nRhetoric, Rhetorical Precepts, On Enthymemes, Introductions, On\nJudicial Speeches, On Style, On Meters, On Delivery, On Music, On the\nMusicians, Harmonics.\n\n\nDue to the scattered character of our evidence, it remains a challenge\nto reconstruct Theophrastus’ views and to piece together his\nphilosophical preoccupations. The central question which has puzzled\nscholars is, understandably, his relation to Aristotle; that is to\nsay, the question whether he should be treated as a loyal follower of\nAristotle or as an original thinker who was prepared to diverge\nconsiderably from him. Boethius (fr. 72A FHS&G) and Simplicius\n(fr.  151B FHS&G) describe him as someone who systematized\nAristotle’s doctrines, by ordering them and filling their real\nor apparent gaps, whereas Quintillian (fr. 694 FHS&G) reports that\nTheophrastus was accustomed to dissent from Aristotle. It seems,\nhowever, that neither the portrait of Theophrastus as a disciple who\nsimply added footnotes to Aristotle’s work without making any\noriginal contribution of his own, nor the image of him as an innovator\nwho introduced radical changes in the Aristotelian system can be\nupheld. It is true that Theophrastus pointed out difficulties and\nobscurities with regard to some of Aristotle’s theories, but he\ndid not explicitly abandon them or put anything different in their\nplace; his modifications were most likely intended as suggestions\nwithin the Aristotelian framework, and his efforts seem to have been\ndirected at developing the Aristotelian system as well as at meeting\nvarious objections against it. After all, Theophrastus did not adopt\nthe same approach in all of his works and in all subjects. It is\nprobably safe to say that he always began where Aristotle left off,\nbut sometimes his treatment of particular issues did not only expand\nAristotle’s thought but also presented a challenge to it. Even\nin such cases, though, the problems raised by him should not be seen\nas a rejection of the general Aristotelian context, but as specimens\nof a philosophical inquiry that is in line with Aristotle’s\nteaching (see Sharples 1988; Gottschalk 1998; Sorabji 1998).\n\nThe aporetic character of many of his writings, especially on\nmetaphysics, physics and psychology, exemplify Theophrastus’\ndialectical method, which is designed to encourage further\ninvestigation rather than to drive towards an exposition of a\nfull-fledged theory. That is to say, Theophrastus\nintroduced in his treatises the various and conflicting views of\nprevious philosophers, and then subjected them to a series of\ncriticisms, but he did not offer solutions of his own, though he often\nmade it clear that he thought of some views as more plausible than\nothers. It is also important to note that Theophrastus’ aim in\nusing such a method should not be understood merely as polemical and\ncritical, or as a pure logical exercise, but as providing the\npreliminary steps of a constructive inquiry that often sets aside\ngeneral theoretical questions in order to concentrate on the detail\n(see Baltussen 2000).\n\nTo this purpose, Theophrastus amassed all the possible information in\nconnection with a particular subject and tried to find some\nexplanatory order within it. His empirically minded investigations\nthus departed from some of the speculative aspects of the Aristotelian\nwork, given that his attention was centered on the description and\nexplanation of actual phenomena more than on the construction of\nover-arching theories. It is striking, for instance, that he devoted\nseparate treatises to marriage and drunkenness, and that he found it\nimportant to tell us everything from demands made by audiences on\nlecturers to penalties from withdrawing from an agreed property\ndeal. Coupled with all this, there is also an emphasis on strange and\nremarkable phenomena, which he studied with an interest to find a\nsuitable explanation for them; for example, the changing in colour of\nthe chameleon and the octopus (fr. 365 FHS&G; see Sharples 2006;\nIerodiakonou 2020). But the urge to compile a complete and\nwide-ranging set of specific cases did not stop Theophrastus entirely\nfrom drawing theoretical generalizations or from issuing practical\ninstructions. In methodological matters, for instance, he advocated\nthat the possibility of causal explanation cannot be the same for all\nlevels of beings and for all subjects; for instance, in the case of\nthe inquiry about first movers, the heavenly bodies and their final\ncauses, it is more likely that reason should provide the answers,\nwhile in the case of animals, plants or inanimate things, order has to\nbe less apparent and a limit needs to be set to the explanatory\nrequirements. He also defended the principle of multiple explanations,\naccording to which no single cause is sufficient to explain a\nphenomenon that results from many factors all of which should be taken\ninto account, and he applied it much more widely than Aristotle had\ndone (see Wöhrle 1985; Daiber 1992; Gottschalk 1998).\n",
    "section_title": "1. Life and Works",
    "entry_title": "Theophrastus",
    "hierarchy_title": "Theophrastus || Life and Works",
    "tokenized_text": [
        "life",
        "work",
        "life",
        "work",
        "diogenes",
        "laertius",
        "main",
        "source",
        "theophrastus",
        "life",
        "work",
        "life",
        "theophrastus",
        "v",
        "fr",
        "fhs",
        "g",
        "abbreviation",
        "see",
        "primary",
        "literature",
        "bibliography",
        "report",
        "theophrastus",
        "born",
        "eresos",
        "island",
        "lesbos",
        "around",
        "bce",
        "original",
        "name",
        "tyrtamus",
        "aristotle",
        "changed",
        "theophrastus",
        "godlike",
        "manner",
        "speech",
        "theosphrazein",
        "according",
        "diogenes",
        "laertius",
        "early",
        "life",
        "theophrastus",
        "student",
        "otherwise",
        "unheard",
        "alcippus",
        "native",
        "city",
        "plato",
        "academy",
        "met",
        "aristotle",
        "fifteen",
        "year",
        "senior",
        "relationship",
        "colleague",
        "associate",
        "rather",
        "one",
        "teacher",
        "pupil",
        "plato",
        "death",
        "bce",
        "theophrastus",
        "travelled",
        "aristotle",
        "assos",
        "asia",
        "minor",
        "back",
        "lesbos",
        "later",
        "macedonia",
        "aristotle",
        "summoned",
        "tutor",
        "alexander",
        "around",
        "bce",
        "returned",
        "athens",
        "aristotle",
        "founded",
        "school",
        "lyceum",
        "leave",
        "alexander",
        "died",
        "bce",
        "due",
        "increasing",
        "antimacedonian",
        "feeling",
        "theophrastus",
        "succeeded",
        "aristotle",
        "school",
        "next",
        "thirtyfive",
        "year",
        "headship",
        "acquired",
        "institutionalized",
        "character",
        "reported",
        "lectured",
        "many",
        "two",
        "thousand",
        "pupil",
        "time",
        "peripatos",
        "among",
        "find",
        "academic",
        "skeptic",
        "arcesilaus",
        "left",
        "polemo",
        "academy",
        "comic",
        "poet",
        "menander",
        "politician",
        "demetrius",
        "phalerum",
        "demetrius",
        "became",
        "governor",
        "athens",
        "bce",
        "macedonian",
        "interest",
        "protected",
        "helped",
        "theophrastus",
        "whose",
        "situation",
        "become",
        "precarious",
        "testified",
        "prosecution",
        "impiety",
        "brought",
        "certain",
        "agnonides",
        "demetrius",
        "expulsion",
        "bce",
        "persecuted",
        "seriously",
        "time",
        "law",
        "passed",
        "forbidding",
        "anyone",
        "open",
        "school",
        "philosophy",
        "without",
        "government",
        "license",
        "theophrastus",
        "well",
        "many",
        "philosopher",
        "left",
        "athens",
        "returned",
        "law",
        "repealed",
        "year",
        "later",
        "died",
        "around",
        "bce",
        "survives",
        "copy",
        "provided",
        "diogenes",
        "laertius",
        "v",
        "left",
        "book",
        "disciple",
        "neleus",
        "including",
        "manuscript",
        "aristotle",
        "work",
        "inherited",
        "took",
        "lyceum",
        "diogenes",
        "attribute",
        "theophrastus",
        "well",
        "two",
        "hundred",
        "separate",
        "treatise",
        "different",
        "style",
        "varying",
        "length",
        "wide",
        "range",
        "topic",
        "totaling",
        "line",
        "le",
        "ten",
        "per",
        "cent",
        "survives",
        "work",
        "seem",
        "intended",
        "use",
        "within",
        "school",
        "basis",
        "theophrastus",
        "lecture",
        "others",
        "intended",
        "wider",
        "audience",
        "therefore",
        "written",
        "popular",
        "style",
        "dialogue",
        "form",
        "judging",
        "surviving",
        "material",
        "title",
        "work",
        "topic",
        "one",
        "aristotle",
        "whereas",
        "others",
        "seem",
        "dealt",
        "topic",
        "related",
        "aristotelian",
        "treatise",
        "covered",
        "unfortunately",
        "theophrastean",
        "work",
        "extant",
        "mainly",
        "seem",
        "particularly",
        "influential",
        "later",
        "period",
        "recopied",
        "reason",
        "two",
        "large",
        "treatise",
        "botany",
        "constitute",
        "first",
        "systematization",
        "botanical",
        "world",
        "one",
        "important",
        "contribution",
        "botanical",
        "science",
        "antiquity",
        "middle",
        "age",
        "plant",
        "explanation",
        "six",
        "book",
        "vital",
        "function",
        "plant",
        "cause",
        "enquiry",
        "plant",
        "nine",
        "book",
        "material",
        "relevant",
        "writing",
        "plant",
        "explanation",
        "character",
        "collection",
        "thirty",
        "concise",
        "often",
        "humorous",
        "sketch",
        "negative",
        "type",
        "individual",
        "everyday",
        "athenian",
        "life",
        "two",
        "short",
        "independent",
        "treatise",
        "metaphysics",
        "first",
        "principle",
        "treatise",
        "investigating",
        "principle",
        "nature",
        "sens",
        "sensation",
        "treatise",
        "dealing",
        "theory",
        "concerning",
        "sens",
        "object",
        "parmenides",
        "democritus",
        "plato",
        "number",
        "minor",
        "treatise",
        "specialized",
        "topic",
        "odour",
        "production",
        "different",
        "perfume",
        "medicinal",
        "characteristic",
        "effect",
        "fire",
        "origin",
        "property",
        "fire",
        "wind",
        "phenomenon",
        "wind",
        "various",
        "type",
        "aetiology",
        "stone",
        "origin",
        "various",
        "type",
        "stone",
        "particular",
        "focus",
        "precious",
        "stone",
        "weather",
        "sign",
        "practical",
        "guide",
        "meteorological",
        "prognosis",
        "general",
        "reader",
        "especially",
        "farmer",
        "sailor",
        "sweat",
        "source",
        "certain",
        "distinctive",
        "quality",
        "sweat",
        "fatigue",
        "seat",
        "symptom",
        "cause",
        "fatigue",
        "dizziness",
        "phenomenon",
        "cause",
        "dizziness",
        "fish",
        "unusual",
        "phenomenon",
        "fish",
        "venture",
        "onto",
        "dry",
        "land",
        "live",
        "air",
        "burrow",
        "ground",
        "apart",
        "extant",
        "work",
        "know",
        "theophrastus",
        "wrote",
        "treatise",
        "many",
        "subject",
        "area",
        "philosophy",
        "title",
        "fragment",
        "report",
        "paraphrase",
        "ancient",
        "author",
        "refer",
        "theophrastus",
        "writing",
        "diverse",
        "vary",
        "greatly",
        "reliability",
        "instance",
        "trace",
        "theophrastus",
        "doctrine",
        "found",
        "work",
        "plutarch",
        "alexander",
        "aphrodisia",
        "galen",
        "sextus",
        "empiricus",
        "diogenes",
        "laertius",
        "pliny",
        "elder",
        "priscian",
        "simplicius",
        "themistius",
        "photius",
        "well",
        "arabic",
        "author",
        "averroes",
        "alfārābī",
        "ibnannadīm",
        "latin",
        "source",
        "albert",
        "great",
        "thomas",
        "aquinas",
        "following",
        "list",
        "title",
        "theophrastus",
        "writing",
        "give",
        "idea",
        "prolific",
        "philosophical",
        "production",
        "logic",
        "affirmation",
        "denial",
        "prior",
        "posterior",
        "analytics",
        "analysis",
        "syllogism",
        "definition",
        "topic",
        "reduction",
        "topic",
        "preliminary",
        "topic",
        "dialectical",
        "argument",
        "objection",
        "sophism",
        "liar",
        "physic",
        "psychology",
        "physic",
        "opinion",
        "natural",
        "philosopher",
        "opinion",
        "natural",
        "philosophy",
        "nature",
        "heaven",
        "meteorology",
        "soul",
        "vision",
        "experience",
        "ethic",
        "politics",
        "emotion",
        "voluntary",
        "virtue",
        "happiness",
        "marriage",
        "wealth",
        "retribution",
        "friendship",
        "pleasure",
        "drunkenness",
        "politics",
        "political",
        "custom",
        "kingship",
        "education",
        "king",
        "law",
        "finally",
        "rhetoric",
        "poetics",
        "music",
        "art",
        "rhetoric",
        "rhetorical",
        "precept",
        "enthymemes",
        "introduction",
        "judicial",
        "speech",
        "style",
        "meter",
        "delivery",
        "music",
        "musician",
        "harmonic",
        "due",
        "scattered",
        "character",
        "evidence",
        "remains",
        "challenge",
        "reconstruct",
        "theophrastus",
        "view",
        "piece",
        "together",
        "philosophical",
        "preoccupation",
        "central",
        "question",
        "puzzled",
        "scholar",
        "understandably",
        "relation",
        "aristotle",
        "say",
        "question",
        "whether",
        "treated",
        "loyal",
        "follower",
        "aristotle",
        "original",
        "thinker",
        "prepared",
        "diverge",
        "considerably",
        "boethius",
        "fr",
        "a",
        "fhs",
        "g",
        "simplicius",
        "fr",
        "b",
        "fhs",
        "g",
        "describe",
        "someone",
        "systematized",
        "aristotle",
        "doctrine",
        "ordering",
        "filling",
        "real",
        "apparent",
        "gap",
        "whereas",
        "quintillian",
        "fr",
        "fhs",
        "g",
        "report",
        "theophrastus",
        "accustomed",
        "dissent",
        "aristotle",
        "seems",
        "however",
        "neither",
        "portrait",
        "theophrastus",
        "disciple",
        "simply",
        "added",
        "footnote",
        "aristotle",
        "work",
        "without",
        "making",
        "original",
        "contribution",
        "image",
        "innovator",
        "introduced",
        "radical",
        "change",
        "aristotelian",
        "system",
        "upheld",
        "true",
        "theophrastus",
        "pointed",
        "difficulty",
        "obscurity",
        "regard",
        "aristotle",
        "theory",
        "explicitly",
        "abandon",
        "put",
        "anything",
        "different",
        "place",
        "modification",
        "likely",
        "intended",
        "suggestion",
        "within",
        "aristotelian",
        "framework",
        "effort",
        "seem",
        "directed",
        "developing",
        "aristotelian",
        "system",
        "well",
        "meeting",
        "various",
        "objection",
        "theophrastus",
        "adopt",
        "approach",
        "work",
        "subject",
        "probably",
        "safe",
        "say",
        "always",
        "began",
        "aristotle",
        "left",
        "sometimes",
        "treatment",
        "particular",
        "issue",
        "expand",
        "aristotle",
        "thought",
        "also",
        "presented",
        "challenge",
        "even",
        "case",
        "though",
        "problem",
        "raised",
        "seen",
        "rejection",
        "general",
        "aristotelian",
        "context",
        "specimen",
        "philosophical",
        "inquiry",
        "line",
        "aristotle",
        "teaching",
        "see",
        "sharples",
        "gottschalk",
        "sorabji",
        "aporetic",
        "character",
        "many",
        "writing",
        "especially",
        "metaphysics",
        "physic",
        "psychology",
        "exemplify",
        "theophrastus",
        "dialectical",
        "method",
        "designed",
        "encourage",
        "investigation",
        "rather",
        "drive",
        "towards",
        "exposition",
        "fullfledged",
        "theory",
        "say",
        "theophrastus",
        "introduced",
        "treatise",
        "various",
        "conflicting",
        "view",
        "previous",
        "philosopher",
        "subjected",
        "series",
        "criticism",
        "offer",
        "solution",
        "though",
        "often",
        "made",
        "clear",
        "thought",
        "view",
        "plausible",
        "others",
        "also",
        "important",
        "note",
        "theophrastus",
        "aim",
        "using",
        "method",
        "understood",
        "merely",
        "polemical",
        "critical",
        "pure",
        "logical",
        "exercise",
        "providing",
        "preliminary",
        "step",
        "constructive",
        "inquiry",
        "often",
        "set",
        "aside",
        "general",
        "theoretical",
        "question",
        "order",
        "concentrate",
        "detail",
        "see",
        "baltussen",
        "purpose",
        "theophrastus",
        "amassed",
        "possible",
        "information",
        "connection",
        "particular",
        "subject",
        "tried",
        "find",
        "explanatory",
        "order",
        "within",
        "empirically",
        "minded",
        "investigation",
        "thus",
        "departed",
        "speculative",
        "aspect",
        "aristotelian",
        "work",
        "given",
        "attention",
        "centered",
        "description",
        "explanation",
        "actual",
        "phenomenon",
        "construction",
        "overarching",
        "theory",
        "striking",
        "instance",
        "devoted",
        "separate",
        "treatise",
        "marriage",
        "drunkenness",
        "found",
        "important",
        "tell",
        "u",
        "everything",
        "demand",
        "made",
        "audience",
        "lecturer",
        "penalty",
        "withdrawing",
        "agreed",
        "property",
        "deal",
        "coupled",
        "also",
        "emphasis",
        "strange",
        "remarkable",
        "phenomenon",
        "studied",
        "interest",
        "find",
        "suitable",
        "explanation",
        "example",
        "changing",
        "colour",
        "chameleon",
        "octopus",
        "fr",
        "fhs",
        "g",
        "see",
        "sharples",
        "ierodiakonou",
        "urge",
        "compile",
        "complete",
        "wideranging",
        "set",
        "specific",
        "case",
        "stop",
        "theophrastus",
        "entirely",
        "drawing",
        "theoretical",
        "generalization",
        "issuing",
        "practical",
        "instruction",
        "methodological",
        "matter",
        "instance",
        "advocated",
        "possibility",
        "causal",
        "explanation",
        "level",
        "being",
        "subject",
        "instance",
        "case",
        "inquiry",
        "first",
        "mover",
        "heavenly",
        "body",
        "final",
        "cause",
        "likely",
        "reason",
        "provide",
        "answer",
        "case",
        "animal",
        "plant",
        "inanimate",
        "thing",
        "order",
        "le",
        "apparent",
        "limit",
        "need",
        "set",
        "explanatory",
        "requirement",
        "also",
        "defended",
        "principle",
        "multiple",
        "explanation",
        "according",
        "single",
        "cause",
        "sufficient",
        "explain",
        "phenomenon",
        "result",
        "many",
        "factor",
        "taken",
        "account",
        "applied",
        "much",
        "widely",
        "aristotle",
        "done",
        "see",
        "wöhrle",
        "daiber",
        "gottschalk"
    ]
}