{
    "main_text": "The Location Question: How Are Thick Concepts Evaluative? || The Semantic View\n4.1 The Semantic View\n\nThe most widely accepted view of the relation between thick terms and\nevaluation is:\n\n\nSemantic View: The semantic (truth-conditional) meanings of\nthick terms and concepts contain global evaluations.\n\n\nWe can assess the relative plausibility of Semantic and Pragmatic\nViews by seeing how well they explain various patterns of the kinds of\nlinguistic behavior on which linguists rely in assessing claims about\nwhether some feature of an utterance is part of its truth-conditions\nor not. The data we’ll briefly consider below focus on what we\ncalled global evaluations in\n section 3.1;\n Pragmatic Views can allow the meanings of thick terms to contain\nembedded evaluation (Väyrynen 2013: 42–3). The data\ndon’t by themselves entail either the Semantic View or any\nversion of the Pragmatic View. These views should rather be understood\nas claiming to constitute part of the best explanation of a wide body\nof linguistic data involving thick terms.\n\nSome of the relevant linguistic data seem easy to explain if thick\nterms are semantically evaluative. Consider the assertions in\n(1)–(2):\n\n(1)\n# Making fun of an insecure person just for fun is cruel and not\nbad in any way for it.\n(2)\nSpeaker A: It was courageous of Sue to stand up to that\nracist on the bus.\n# Speaker B: Sure, courageous—and not good in any way\nfor it.\n\n\nIn both\n (1)\n and the exchange in\n (2),\n the denial of an evaluation that is normally conveyed by\ncruel and courageous sounds odd, or infelicitous\n(indicated by “#”). If the first half of\n (1)\n has a global evaluation of something as bad in a certain way as part\nof its truth-conditions, the oddness of\n (1)\n can be neatly explained as reflecting a logical contradiction between\nits two halves. The same would go for the exchange in\n (2):\n A’s and B’s utterances entail contradictory\nclaims about whether Sue’s act was good in any way. (See Kyle\n2013a for a discussion of how the Semantic View might allow that\n (1)\n isn’t odd in all contexts.)\n\nIt is natural to assume that if a thick term conveys an evaluation as\na matter of truth-conditions, that evaluation is either positive or\nnegative but not both and the evaluation is the same in all contexts\nwhere the term is used to make an assertion. (We’ll discuss\nnon-assertive contexts below.) But many paradigmatic thick terms can\nbe used to evaluate negatively in some contexts while positively in\nothers. Some philosophers claim that the Semantic View cannot explain\nthis “contextual variability” in the evaluative valence of\nT-utterances. Although frugal normally conveys a positive\nevaluation, calling someone whose “main job is dispensing\nhospitality” frugal counts as a criticism (Blackburn 1992: 286).\nSimilarly, although cruel normally conveys a negative\nevaluation, it might be thought to convey positive evaluation when the\ncruelty of an action is “just what made it such fun” (Hare\n1981: 73). Such variability might be thought to show that thick virtue\nconcepts aren’t evaluative concepts (Brower 1988). However,\nvariability in valence is compatible with the Semantic View\n(Väyrynen 2011). These examples might be thought to involve a\nnon-literal use of the thick term or to convey the non-typical\nevaluation not by way of word meaning but by way of speaker meaning.\n(What the speaker means in using some word can come apart from the\nmeaning that the word has in the language. I can intend to be speaking\nabout plums of any kind when I use the word prune but that\ndoesn’t make it any less the case that in English prune\nmeans dried plums.) Or it might be that the normal evaluation is built\ninto the truth-conditions of the sentences involving it and the\nopposite evaluation can be explained in terms of one of the pragmatic\nmechanisms we’ll consider in\n section 4.2.\n Or it might be that although thick terms are semantically evaluative,\ntheir valence isn’t fixed but rather their meanings allow\ninvolve different evaluations in different contexts (Dancy 1995).\nThese also don’t exhaust the options for a semantic explanation\nof variability (Kyle 2020: 926). More generally, it doesn’t seem\npromising to explain valence reversal by appeal to lexical\ndeflationism, ambiguity, or echoic use of language (Cepollaro 2018).\n\n\nA stronger challenge to the Semantic View is based on two more complex\nsets of linguistic data about thick terms: the evaluations normally\nconveyed by T-utterances seem to survive embedding in various complex\nsentences that usually block truth-conditional content, and those\nevaluations seem to be defeasible in ways that truth-conditional\ncontent isn’t.\n\nThe first set of data concern what happens when atomic sentences\ninvolving thick terms are embedded in various complex sentences;\ntruth-conditional content often doesn’t survive such embedding.\nThe data are clearest in the case of objectionable thick concepts\nwhich were introduced in\n section 2.1.\n (The most comprehensive presentation of the data can be found in\nVäyrynen 2013: ch. 3.) The word chaste applies to a\ncertain kind of sexual restraint. It is typically used to convey\npositive evaluation to the effect that such restraint is praiseworthy\nor good in a certain way. If chaste is in fact objectionable\nand the evaluation that makes it so is part of its truth-conditions,\nthen nothing is chaste; chaste fails to refer. If instead the\nassociated evaluation that makes chaste objectionable is\ntruth-conditionally irrelevant, chaste may be true of things\nwhich just don’t “fit” the evaluation; it will\n“misevaluate” (Eklund 2011).\n\nThose who reject the evaluation of sexual restraint as good and thus\nfind chaste objectionable in its customary positive use (call\nthem chaste-objectors) are at least typically reluctant to\nutter sentences like (3):\n\n(3)\nIsolde is chaste.\n\n\nInterestingly, chaste-objectors are also reluctant to use\nchaste when it is embedded in negation, questions, modal\noperators such as possibly and might, and the\nantecedent of the conditional.\n\n(4)\n\n\na.\nIsolde isn’t chaste.\nb.\nIs Isolde chaste?\nc.\nIsolde might be chaste.\nd.\nIf Isolde is chaste, so is Tristan.\n \n\n\nNone of\n (4a–d)\n entail that Isolde is chaste. So chaste-objectors’\nreluctance to utter\n (4a–d)\n seems hard to explain if the positive evaluation associated with\nchaste is part of the truth-conditions of\n (3).\n Since the evaluation survives when chaste is embedded under\noperators that block truth-conditional content, it appears to\n“project” outside of the truth-conditions of\nchaste. This kind of projection behavior is a general feature\nof T-utterances, since virtually any thick term seems to be in\nprinciple open to being regarded as objectionable. As we’ll see\nin\n section 4.2\n below, this projection behavior is characteristic of certain\ntruth-conditionally irrelevant pragmatic contents and is thus well\nexplained by many Pragmatic Views.\n\nThe Semantic View may, however, offer a different explanation of these\nprojection data. One option is that T-utterances normally convey two\nkinds of evaluations. Perhaps chaste is semantically\nevaluative and, in addition, someone who uses the word thereby conveys\nthat she approves of the semantically associated way of valuing\n(namely, valuing people or behavior positively for showing sexual\nrestraint). Insofar as this latter aspect projects from embeddings\nthat block truth-conditional content and the reluctance of\nchaste-objectors to utter\n (4a–d)\n can be explained as being due only to the latter aspect, their\nreluctance doesn’t show that chaste isn’t also\nsemantically evaluative. (Eklund forthcoming.) This proposal seems,\nhowever, unable by itself to explain the defeasibility data discussed\nbelow, which suggest that even the associated evaluations themselves\ncan be suspended without infelicity.\n\nAnother explanation of the projection data is due to Brent Kyle. It\ncomes in two pieces. The first concerns (4a). When you say someone is\nnot happy, you only say that they lack the quality of being happy, not\nthat they are unhappy. But normally, in the absence of an explicit\nnote to the contrary, we tend to interpret the claim that someone\nisn’t happy as conversationally implicating (conveying,\nsuggesting) that they are unhappy. It should then be equally plausible\nthat not chaste similarly conversationally implicates\nunchaste. Since those who find chaste objectionable\nshould also be reluctant to imply that anyone is unchaste, this would\nexplain why chaste-objectors are reluctant to utter (4a). So\nwhat about (4b–d)? To be a chaste-objector you must\nhave concluded that things aren’t good simply for showing a\ncertain kind of sexual restraint. If the Semantic View is true, it\nfollows that nothing can be chaste. But each of (4b–d) implies\nthat the speaker considers it a live possibility that Isolde is\nchaste. No wonder, then, that chaste-objectors are reluctant\nto assert (4b–d). Since these explanations focus on\ntruth-conditionally irrelevant implications of\n (4a–d),\n they are compatible with the Semantic View (Kyle 2013a: 13–19).\nIn appealing to two distinct types of implicature, this piecemeal\nexplanation is less parsimonious than Pragmatic Views which make do\nwith just one mechanism, but whether that makes the explanation worse\noverall is a complex question up for debate. (For this methodological\nissue, see\n section 3\n of the supplementary document\n “Additional Debates about Thick Concepts and Their Significance”.)\n\nThe second set of data concern the possibility of denying or\nsuspending an evaluation that a T-utterance normally conveys without\nrejecting the utterance itself. Truth-conditional contents cannot be\ndenied in this way. If I say “Gerald asked three questions at\nHeather’s talk” and you reply “No, he asked\ntwo”, you reject my utterance as false. But if you reply “\nNo, he asked four”, you aren’t rejecting the truth of my\nutterance but only its conversational implicature that Gerald asked\nexactly three questions. In\n (1)\n and\n (2)\n direct denials of evaluation following assertive T-utterances are\nodd. But consider:\n\n(5)\nWhether or not Isolde is chaste, she is in no way good for her\nsexual restraint. (Cf. Väyrynen 2013: 66)\n(6)\nWhether or not this is a good thing, Isolde can be truthfully and\nneutrally described as being chaste. (Cf. Bergström 2002: 5)\n(7)\nThe carnival was a lot of fun. But something was missing. It just\nwasn’t lewd. I hope it’ll be lewd next year. (Due to Matti\nEklund)\n\n\nIf these utterances can be acceptable, that would be evidence that the\nevaluation normally conveyed by chaste isn’t part of\nits truth-conditions. A speaker of\n (7)\n makes it clear that she would rejoice in a more sexually explicit\ncarnival, thus shedding a commitment to evaluating the carnival\nnegatively if it were more explicit. If that evaluation were part of\nthe truth-conditions of lewd, we would expect\n (7)\n not to sound coherent on a literal use of lewd. The denial\nin\n (5)\n and suspension in\n (6)\n don’t concern only whether the speaker approves of the way of\nvaluing associated with the thick term but also that evaluation\nitself. An utterance of\n (5)\n brackets the question whether the truth-conditions of\n (3)\n hold and denies the evaluation either way. If you forced a\nchaste-objector to judge\n (3)\n as either true or false, she might prefer to classify it as true\nwhile using something like\n (5)\n to signal that she is using chaste non-evaluatively.\nUttering\n (6)\n would be a way for someone who is agnostic about whether chastity is\ngood in any way to suspend the evaluation while conceding that the\ntruth-conditions of\n (3)\n hold. It isn’t clear how either\n (5)\n or\n (6)\n could be compatible with locating the evaluation in the\ntruth-conditions of\n (3).\n So the proponents of the Semantic View may need to claim that\nutterances of\n (5)–(7)\n either don’t involve literal uses of thick terms or are\ninfelicitous despite the fact that many speakers don’t find them\nto be linguistically odd as utterances.\n\nOne radical way to reconcile the Semantic View with the defeasibility\ndata is to argue that a condition can be part of what constitutes the\nmeaning of an expression even if the expression doesn’t satisfy\nthe condition and even if the condition can be competently rejected by\nusers of the expression. On this view, chaste might entail\ngood for showing sexual restraint as a matter of meaning even\nif things to which chaste applies in fact aren’t good\nin any way and even if some semantically competent speakers reject the\nevaluation without rejecting\n (1).\n In developing this view, Matti Eklund argues that it isn’t\nad hoc because there are other concepts that can plausibly be\ntreated as inconsistent in this kind of way (Eklund 2011).\n\nThe debate about whether the evaluations normally conveyed by thick\nterms are defeasible quickly gets complex and technical. (A fuller\ndiscussion of the defeasibility data and their explanation can be\nfound in Väyrynen 2013: 66–95.) Sometimes the linguistic\nintuitions on which we rely in assessing competing explanations may\nalso be less firm or not as widely shared as we would like. An\nadditional complication is that some evidence about how people in fact\nreason with positive and negative thick terms suggests that\nevaluations are more easily defeasible for positive thick terms than\nfor negative ones (Willemsen and Reuter 2020). Existing work largely\nassumes that positive and negative thick terms behave in largely the\nsame ways. Asymmetrical valence effects would thus complicate matters\nfor both Semantic and Pragmatic Views. How much they would do so\ndepends on how deep a difference in meaning the asymmetry would reflect.\nPascale Willemsen and Kevin Reuter (2020) propose that the valence\neffect is due to a difference in the social norms guiding positive and\nnegative evaluative language, but the issue is under-explored. Another\nfurther issue concerns whether certain kinds of denials of\nT-utterances focused on the evaluations that they normally convey are\nbetter understood as instances of the truth-conditional negation that\nwe learn about in logic classes, or of “metalinguistic”\nnegation which targets aspects of utterances other than their\ntruth-conditional content.\n",
    "section_title": "4.1 The Semantic View",
    "entry_title": "Thick Ethical Concepts",
    "hierarchy_title": "Thick Ethical Concepts || The Location Question: How Are Thick Concepts Evaluative? || The Semantic View",
    "tokenized_text": [
        "location",
        "question",
        "thick",
        "concept",
        "evaluative",
        "semantic",
        "view",
        "semantic",
        "view",
        "widely",
        "accepted",
        "view",
        "relation",
        "thick",
        "term",
        "evaluation",
        "semantic",
        "view",
        "semantic",
        "truthconditional",
        "meaning",
        "thick",
        "term",
        "concept",
        "contain",
        "global",
        "evaluation",
        "ass",
        "relative",
        "plausibility",
        "semantic",
        "pragmatic",
        "view",
        "seeing",
        "well",
        "explain",
        "various",
        "pattern",
        "kind",
        "linguistic",
        "behavior",
        "linguist",
        "rely",
        "assessing",
        "claim",
        "whether",
        "feature",
        "utterance",
        "part",
        "truthconditions",
        "data",
        "briefly",
        "consider",
        "focus",
        "called",
        "global",
        "evaluation",
        "section",
        "pragmatic",
        "view",
        "allow",
        "meaning",
        "thick",
        "term",
        "contain",
        "embedded",
        "evaluation",
        "väyrynen",
        "data",
        "entail",
        "either",
        "semantic",
        "view",
        "version",
        "pragmatic",
        "view",
        "view",
        "rather",
        "understood",
        "claiming",
        "constitute",
        "part",
        "best",
        "explanation",
        "wide",
        "body",
        "linguistic",
        "data",
        "involving",
        "thick",
        "term",
        "relevant",
        "linguistic",
        "data",
        "seem",
        "easy",
        "explain",
        "thick",
        "term",
        "semantically",
        "evaluative",
        "consider",
        "assertion",
        "making",
        "fun",
        "insecure",
        "person",
        "fun",
        "cruel",
        "bad",
        "way",
        "speaker",
        "courageous",
        "sue",
        "stand",
        "racist",
        "bus",
        "speaker",
        "b",
        "sure",
        "courageousand",
        "good",
        "way",
        "exchange",
        "denial",
        "evaluation",
        "normally",
        "conveyed",
        "cruel",
        "courageous",
        "sound",
        "odd",
        "infelicitous",
        "indicated",
        "first",
        "half",
        "global",
        "evaluation",
        "something",
        "bad",
        "certain",
        "way",
        "part",
        "truthconditions",
        "oddness",
        "neatly",
        "explained",
        "reflecting",
        "logical",
        "contradiction",
        "two",
        "half",
        "would",
        "go",
        "exchange",
        "b",
        "utterance",
        "entail",
        "contradictory",
        "claim",
        "whether",
        "sue",
        "act",
        "good",
        "way",
        "see",
        "kyle",
        "a",
        "discussion",
        "semantic",
        "view",
        "might",
        "allow",
        "odd",
        "context",
        "natural",
        "assume",
        "thick",
        "term",
        "conveys",
        "evaluation",
        "matter",
        "truthconditions",
        "evaluation",
        "either",
        "positive",
        "negative",
        "evaluation",
        "context",
        "term",
        "used",
        "make",
        "assertion",
        "discus",
        "nonassertive",
        "context",
        "many",
        "paradigmatic",
        "thick",
        "term",
        "used",
        "evaluate",
        "negatively",
        "context",
        "positively",
        "others",
        "philosopher",
        "claim",
        "semantic",
        "view",
        "explain",
        "contextual",
        "variability",
        "evaluative",
        "valence",
        "tutterances",
        "although",
        "frugal",
        "normally",
        "conveys",
        "positive",
        "evaluation",
        "calling",
        "someone",
        "whose",
        "main",
        "job",
        "dispensing",
        "hospitality",
        "frugal",
        "count",
        "criticism",
        "blackburn",
        "similarly",
        "although",
        "cruel",
        "normally",
        "conveys",
        "negative",
        "evaluation",
        "might",
        "thought",
        "convey",
        "positive",
        "evaluation",
        "cruelty",
        "action",
        "made",
        "fun",
        "hare",
        "variability",
        "might",
        "thought",
        "show",
        "thick",
        "virtue",
        "concept",
        "evaluative",
        "concept",
        "brower",
        "however",
        "variability",
        "valence",
        "compatible",
        "semantic",
        "view",
        "väyrynen",
        "example",
        "might",
        "thought",
        "involve",
        "nonliteral",
        "use",
        "thick",
        "term",
        "convey",
        "nontypical",
        "evaluation",
        "way",
        "word",
        "meaning",
        "way",
        "speaker",
        "meaning",
        "speaker",
        "mean",
        "using",
        "word",
        "come",
        "apart",
        "meaning",
        "word",
        "language",
        "intend",
        "speaking",
        "plum",
        "kind",
        "use",
        "word",
        "prune",
        "make",
        "le",
        "case",
        "english",
        "prune",
        "mean",
        "dried",
        "plum",
        "might",
        "normal",
        "evaluation",
        "built",
        "truthconditions",
        "sentence",
        "involving",
        "opposite",
        "evaluation",
        "explained",
        "term",
        "one",
        "pragmatic",
        "mechanism",
        "consider",
        "section",
        "might",
        "although",
        "thick",
        "term",
        "semantically",
        "evaluative",
        "valence",
        "fixed",
        "rather",
        "meaning",
        "allow",
        "involve",
        "different",
        "evaluation",
        "different",
        "context",
        "dancy",
        "also",
        "exhaust",
        "option",
        "semantic",
        "explanation",
        "variability",
        "kyle",
        "generally",
        "seem",
        "promising",
        "explain",
        "valence",
        "reversal",
        "appeal",
        "lexical",
        "deflationism",
        "ambiguity",
        "echoic",
        "use",
        "language",
        "cepollaro",
        "stronger",
        "challenge",
        "semantic",
        "view",
        "based",
        "two",
        "complex",
        "set",
        "linguistic",
        "data",
        "thick",
        "term",
        "evaluation",
        "normally",
        "conveyed",
        "tutterances",
        "seem",
        "survive",
        "embedding",
        "various",
        "complex",
        "sentence",
        "usually",
        "block",
        "truthconditional",
        "content",
        "evaluation",
        "seem",
        "defeasible",
        "way",
        "truthconditional",
        "content",
        "first",
        "set",
        "data",
        "concern",
        "happens",
        "atomic",
        "sentence",
        "involving",
        "thick",
        "term",
        "embedded",
        "various",
        "complex",
        "sentence",
        "truthconditional",
        "content",
        "often",
        "survive",
        "embedding",
        "data",
        "clearest",
        "case",
        "objectionable",
        "thick",
        "concept",
        "introduced",
        "section",
        "comprehensive",
        "presentation",
        "data",
        "found",
        "väyrynen",
        "ch",
        "word",
        "chaste",
        "applies",
        "certain",
        "kind",
        "sexual",
        "restraint",
        "typically",
        "used",
        "convey",
        "positive",
        "evaluation",
        "effect",
        "restraint",
        "praiseworthy",
        "good",
        "certain",
        "way",
        "chaste",
        "fact",
        "objectionable",
        "evaluation",
        "make",
        "part",
        "truthconditions",
        "nothing",
        "chaste",
        "chaste",
        "fails",
        "refer",
        "instead",
        "associated",
        "evaluation",
        "make",
        "chaste",
        "objectionable",
        "truthconditionally",
        "irrelevant",
        "chaste",
        "may",
        "true",
        "thing",
        "fit",
        "evaluation",
        "misevaluate",
        "eklund",
        "reject",
        "evaluation",
        "sexual",
        "restraint",
        "good",
        "thus",
        "find",
        "chaste",
        "objectionable",
        "customary",
        "positive",
        "use",
        "call",
        "chasteobjectors",
        "least",
        "typically",
        "reluctant",
        "utter",
        "sentence",
        "like",
        "isolde",
        "chaste",
        "interestingly",
        "chasteobjectors",
        "also",
        "reluctant",
        "use",
        "chaste",
        "embedded",
        "negation",
        "question",
        "modal",
        "operator",
        "possibly",
        "might",
        "antecedent",
        "conditional",
        "a",
        "isolde",
        "chaste",
        "b",
        "isolde",
        "chaste",
        "c",
        "isolde",
        "might",
        "chaste",
        "d",
        "isolde",
        "chaste",
        "tristan",
        "none",
        "ad",
        "entail",
        "isolde",
        "chaste",
        "chasteobjectors",
        "reluctance",
        "utter",
        "ad",
        "seems",
        "hard",
        "explain",
        "positive",
        "evaluation",
        "associated",
        "chaste",
        "part",
        "truthconditions",
        "since",
        "evaluation",
        "survives",
        "chaste",
        "embedded",
        "operator",
        "block",
        "truthconditional",
        "content",
        "appears",
        "project",
        "outside",
        "truthconditions",
        "chaste",
        "kind",
        "projection",
        "behavior",
        "general",
        "feature",
        "tutterances",
        "since",
        "virtually",
        "thick",
        "term",
        "seems",
        "principle",
        "open",
        "regarded",
        "objectionable",
        "see",
        "section",
        "projection",
        "behavior",
        "characteristic",
        "certain",
        "truthconditionally",
        "irrelevant",
        "pragmatic",
        "content",
        "thus",
        "well",
        "explained",
        "many",
        "pragmatic",
        "view",
        "semantic",
        "view",
        "may",
        "however",
        "offer",
        "different",
        "explanation",
        "projection",
        "data",
        "one",
        "option",
        "tutterances",
        "normally",
        "convey",
        "two",
        "kind",
        "evaluation",
        "perhaps",
        "chaste",
        "semantically",
        "evaluative",
        "addition",
        "someone",
        "us",
        "word",
        "thereby",
        "conveys",
        "approves",
        "semantically",
        "associated",
        "way",
        "valuing",
        "namely",
        "valuing",
        "people",
        "behavior",
        "positively",
        "showing",
        "sexual",
        "restraint",
        "insofar",
        "latter",
        "aspect",
        "project",
        "embeddings",
        "block",
        "truthconditional",
        "content",
        "reluctance",
        "chasteobjectors",
        "utter",
        "ad",
        "explained",
        "due",
        "latter",
        "aspect",
        "reluctance",
        "show",
        "chaste",
        "also",
        "semantically",
        "evaluative",
        "eklund",
        "forthcoming",
        "proposal",
        "seems",
        "however",
        "unable",
        "explain",
        "defeasibility",
        "data",
        "discussed",
        "suggest",
        "even",
        "associated",
        "evaluation",
        "suspended",
        "without",
        "infelicity",
        "another",
        "explanation",
        "projection",
        "data",
        "due",
        "brent",
        "kyle",
        "come",
        "two",
        "piece",
        "first",
        "concern",
        "a",
        "say",
        "someone",
        "happy",
        "say",
        "lack",
        "quality",
        "happy",
        "unhappy",
        "normally",
        "absence",
        "explicit",
        "note",
        "contrary",
        "tend",
        "interpret",
        "claim",
        "someone",
        "happy",
        "conversationally",
        "implicating",
        "conveying",
        "suggesting",
        "unhappy",
        "equally",
        "plausible",
        "chaste",
        "similarly",
        "conversationally",
        "implicates",
        "unchaste",
        "since",
        "find",
        "chaste",
        "objectionable",
        "also",
        "reluctant",
        "imply",
        "anyone",
        "unchaste",
        "would",
        "explain",
        "chasteobjectors",
        "reluctant",
        "utter",
        "a",
        "bd",
        "chasteobjector",
        "must",
        "concluded",
        "thing",
        "good",
        "simply",
        "showing",
        "certain",
        "kind",
        "sexual",
        "restraint",
        "semantic",
        "view",
        "true",
        "follows",
        "nothing",
        "chaste",
        "bd",
        "implies",
        "speaker",
        "considers",
        "live",
        "possibility",
        "isolde",
        "chaste",
        "wonder",
        "chasteobjectors",
        "reluctant",
        "assert",
        "bd",
        "since",
        "explanation",
        "focus",
        "truthconditionally",
        "irrelevant",
        "implication",
        "ad",
        "compatible",
        "semantic",
        "view",
        "kyle",
        "a",
        "appealing",
        "two",
        "distinct",
        "type",
        "implicature",
        "piecemeal",
        "explanation",
        "le",
        "parsimonious",
        "pragmatic",
        "view",
        "make",
        "one",
        "mechanism",
        "whether",
        "make",
        "explanation",
        "worse",
        "overall",
        "complex",
        "question",
        "debate",
        "methodological",
        "issue",
        "see",
        "section",
        "supplementary",
        "document",
        "additional",
        "debate",
        "thick",
        "concept",
        "significance",
        "second",
        "set",
        "data",
        "concern",
        "possibility",
        "denying",
        "suspending",
        "evaluation",
        "tutterance",
        "normally",
        "conveys",
        "without",
        "rejecting",
        "utterance",
        "truthconditional",
        "content",
        "denied",
        "way",
        "say",
        "gerald",
        "asked",
        "three",
        "question",
        "heather",
        "talk",
        "reply",
        "asked",
        "two",
        "reject",
        "utterance",
        "false",
        "reply",
        "asked",
        "four",
        "rejecting",
        "truth",
        "utterance",
        "conversational",
        "implicature",
        "gerald",
        "asked",
        "exactly",
        "three",
        "question",
        "direct",
        "denial",
        "evaluation",
        "following",
        "assertive",
        "tutterances",
        "odd",
        "consider",
        "whether",
        "isolde",
        "chaste",
        "way",
        "good",
        "sexual",
        "restraint",
        "cf",
        "väyrynen",
        "whether",
        "good",
        "thing",
        "isolde",
        "truthfully",
        "neutrally",
        "described",
        "chaste",
        "cf",
        "bergström",
        "carnival",
        "lot",
        "fun",
        "something",
        "missing",
        "lewd",
        "hope",
        "lewd",
        "next",
        "year",
        "due",
        "matti",
        "eklund",
        "utterance",
        "acceptable",
        "would",
        "evidence",
        "evaluation",
        "normally",
        "conveyed",
        "chaste",
        "part",
        "truthconditions",
        "speaker",
        "make",
        "clear",
        "would",
        "rejoice",
        "sexually",
        "explicit",
        "carnival",
        "thus",
        "shedding",
        "commitment",
        "evaluating",
        "carnival",
        "negatively",
        "explicit",
        "evaluation",
        "part",
        "truthconditions",
        "lewd",
        "would",
        "expect",
        "sound",
        "coherent",
        "literal",
        "use",
        "lewd",
        "denial",
        "suspension",
        "concern",
        "whether",
        "speaker",
        "approves",
        "way",
        "valuing",
        "associated",
        "thick",
        "term",
        "also",
        "evaluation",
        "utterance",
        "bracket",
        "question",
        "whether",
        "truthconditions",
        "hold",
        "denies",
        "evaluation",
        "either",
        "way",
        "forced",
        "chasteobjector",
        "judge",
        "either",
        "true",
        "false",
        "might",
        "prefer",
        "classify",
        "true",
        "using",
        "something",
        "like",
        "signal",
        "using",
        "chaste",
        "nonevaluatively",
        "uttering",
        "would",
        "way",
        "someone",
        "agnostic",
        "whether",
        "chastity",
        "good",
        "way",
        "suspend",
        "evaluation",
        "conceding",
        "truthconditions",
        "hold",
        "clear",
        "either",
        "could",
        "compatible",
        "locating",
        "evaluation",
        "truthconditions",
        "proponent",
        "semantic",
        "view",
        "may",
        "need",
        "claim",
        "utterance",
        "either",
        "involve",
        "literal",
        "us",
        "thick",
        "term",
        "infelicitous",
        "despite",
        "fact",
        "many",
        "speaker",
        "find",
        "linguistically",
        "odd",
        "utterance",
        "one",
        "radical",
        "way",
        "reconcile",
        "semantic",
        "view",
        "defeasibility",
        "data",
        "argue",
        "condition",
        "part",
        "constitutes",
        "meaning",
        "expression",
        "even",
        "expression",
        "satisfy",
        "condition",
        "even",
        "condition",
        "competently",
        "rejected",
        "user",
        "expression",
        "view",
        "chaste",
        "might",
        "entail",
        "good",
        "showing",
        "sexual",
        "restraint",
        "matter",
        "meaning",
        "even",
        "thing",
        "chaste",
        "applies",
        "fact",
        "good",
        "way",
        "even",
        "semantically",
        "competent",
        "speaker",
        "reject",
        "evaluation",
        "without",
        "rejecting",
        "developing",
        "view",
        "matti",
        "eklund",
        "argues",
        "ad",
        "hoc",
        "concept",
        "plausibly",
        "treated",
        "inconsistent",
        "kind",
        "way",
        "eklund",
        "debate",
        "whether",
        "evaluation",
        "normally",
        "conveyed",
        "thick",
        "term",
        "defeasible",
        "quickly",
        "get",
        "complex",
        "technical",
        "fuller",
        "discussion",
        "defeasibility",
        "data",
        "explanation",
        "found",
        "väyrynen",
        "sometimes",
        "linguistic",
        "intuition",
        "rely",
        "assessing",
        "competing",
        "explanation",
        "may",
        "also",
        "le",
        "firm",
        "widely",
        "shared",
        "would",
        "like",
        "additional",
        "complication",
        "evidence",
        "people",
        "fact",
        "reason",
        "positive",
        "negative",
        "thick",
        "term",
        "suggests",
        "evaluation",
        "easily",
        "defeasible",
        "positive",
        "thick",
        "term",
        "negative",
        "one",
        "willemsen",
        "reuter",
        "existing",
        "work",
        "largely",
        "assumes",
        "positive",
        "negative",
        "thick",
        "term",
        "behave",
        "largely",
        "way",
        "asymmetrical",
        "valence",
        "effect",
        "would",
        "thus",
        "complicate",
        "matter",
        "semantic",
        "pragmatic",
        "view",
        "much",
        "would",
        "depends",
        "deep",
        "difference",
        "meaning",
        "asymmetry",
        "would",
        "reflect",
        "pascale",
        "willemsen",
        "kevin",
        "reuter",
        "propose",
        "valence",
        "effect",
        "due",
        "difference",
        "social",
        "norm",
        "guiding",
        "positive",
        "negative",
        "evaluative",
        "language",
        "issue",
        "underexplored",
        "another",
        "issue",
        "concern",
        "whether",
        "certain",
        "kind",
        "denial",
        "tutterances",
        "focused",
        "evaluation",
        "normally",
        "convey",
        "better",
        "understood",
        "instance",
        "truthconditional",
        "negation",
        "learn",
        "logic",
        "class",
        "metalinguistic",
        "negation",
        "target",
        "aspect",
        "utterance",
        "truthconditional",
        "content"
    ]
}