{
    "main_text": "What Are Thick Concepts? Background and Preliminaries\n1. What Are Thick Concepts? Background and Preliminaries\n\nThe designation “thick concept” for concepts that combine\nevaluation and non-evaluative description originates in Bernard\nWilliams’s Ethics and the Limits of Philosophy\n(Williams 1985). Williams seems to have drawn the label\n“thick” from the notion of “thick description”\nintroduced by Gilbert Ryle and adapted to other purposes by the\nanthropologist Clifford Geertz. Ryle characterizes thick descriptions\nas descriptions of human activities not as mere bodily motions but as\ninvolving intentional and purposive detail which help us to understand\nthose activities (Ryle 1968). In Geertz’s terminology thickness\nis a matter of the culturally specific significance of such details\n(Geertz 1973). Unlike thick concepts, thick descriptions in\nRyle’s and Geertz’s senses needn’t involve\nevaluation. But one connection to Williams’s terminology is that\nmany thick concepts incorporate culturally specific information (cf.\nScanlon 2003). Different societies might have sufficiently different\nunderstandings of courage to have distinct concepts of it, and some\nmight lack a concept altogether. There is similar cultural specificity\nto the kind of sexual morality in which chaste\nplays a role and the kind of honor culture in which noble\nhas a point (cf. Williams 1985: 141ff.). While\nthe terminology of “thick” and “thin” concepts\noriginates in Williams, he wasn’t the first to spot the\ndistinction he uses these labels to pick out. For instance, when R.M.\nHare distinguishes “primarily” and\n“secondarily” evaluative words in The Language of\nMorals, his examples of the former are paradigmatic thin concepts\nand some of his examples of the latter are paradigmatic thick\nconcepts. (Hare 1952: 121–2; see also the discussion of\npersuasive definitions in Stevenson 1938.)\n\nThe examples of thick and thin terms and concepts with which we began\nexhibit an intuitive contrast: terms like generous,\ncruel, and tactful appear descriptively more\nspecific or rich in content than terms such as wrong or\ngood, which seem more general or more purely evaluative. Even\nif calling something selfish evaluates it as bad in some way or\nrespect, not just any bad act can count as selfish; it must also\ninvolve the agent giving some significant degree of priority to\nherself over others. How this intuitive contrast is best understood is\nsubject to several controversies and may have no theory-neutral\nanswer.\n\nFirst, in saying that thick terms and concepts are in some sense both\nevaluative and descriptive, what is meant by these notions?\nIllustrative examples of descriptive terms include square,\ngold, wombat, spotted, recursive,\nbeer, unequal in income, and (plausibly)\npainful. Paradigmatic examples of evaluative terms include\nthin terms such as good, bad, ought,\nright, and wrong. We cannot distinguish the\nevaluative and the descriptive simply in terms of different functions\nin our thought and talk. For if judgments involving thick concepts are\nevaluative judgments, then cognitivists and non-cognitivists disagree\nabout their function. According to non-cognitivists, the primary\nfunction of evaluative terms is to express and induce conative\nattitudes, such as desire, preference, or (dis)approval, which\naren’t truth-apt. (A desire for world peace is no more the sort\nof thing that can be true or false than a command like “Shut\nup!”) But according to cognitivists, evaluative terms are like\ndescriptive terms in that their primary function is to express\ncognitive states such as beliefs, which are apt to be assessed as\n(robustly) true or false. Nor can we capture the distinction between\nthick and thin terms by identifying the descriptive with the factual:\nto assume that evaluations cannot be factual would be to assume the\nkind of distinction between “facts” and\n“values” which thick concepts are sometimes thought to\nundermine (see\n section 2.1).\n In neutral terms we may not be able to do much better than to say\nthat the purely descriptive terms are given by a big list of terms\nthat would generally be classified as falling on the is-side\nof the distinction between is and ought and all the\nrest are evaluative terms (Jackson 1998: 120). Descriptive terms would\nthus be purely non-evaluative. This boundary may not be sharp; in\nparticular, it might be vague whether thick terms such as\nhonest should be classified as purely descriptive or partly\nevaluative (Jackson 1998: 120). And even if not vague, it is a matter\nof controversy, as we’ll see in\n section 4.\n In any case, if we take the evaluative to exclude only the\npurely non-evaluative, then non-evaluative description will\nbe something given in purely non-evaluative terms. The interesting\nfeature of thick terms and concepts is that even if they count as\nevaluative on a binary distinction, they are supposed to straddle the\ndistinction.\n\nSecond, it is remarkably difficult to find a suitably neutral positive\ncharacterization of what thick concepts are, beyond the idea that they\nsomehow combine evaluation and non-evaluative description. Williams\ncharacterizes the application of thick concepts as both\n“action-guiding” and “guided by the world”:\ntheir application depends on the way the world is, but also “if\na concept of this kind applies, this often provides someone with a\nreason for action” (Williams 1985: 140; see also Moore 2006;\nHeuer 2012; Smith 2013: 102–5). By contrast, the application of\nthin evaluative concepts is supposed to be purely action-guiding and\nnot world-guided. But moral realists presumably think that the\napplication of thin concepts is also world-guided: whether a thin\nconcept truly applies depends on how the world of objective values\nlies. Other existing characterizations either suffer from similar\nproblems in failing to characterize thick concepts, or else are either\nnot very informative or too theory-laden (see, e.g., Gibbard 1992,\nDancy 1995, Scanlon 2003, Kyle 2020, and for critical discussion\nEklund 2011).\n\nThird, the intuitive contrast between thick and thin terms as terms\nthat somehow combine evaluation and non-evaluative description\nclassifies as thick not only paradigmatic thick concepts in the style\nof cruel, courageous,\nand kind, but also\n“respect-relative” evaluative concepts, pejorative terms,\nand more. The claims “This is a good knife” or\n“Charlie is good with children” ascribe ways of being good\nin certain non-evaluatively described respects. Not just any good\nthing can be a good knife; it must also be a knife, and knife\nis a non-evaluative concept. Similarly,\nspeaking of people as “krauts” or “wingnuts”\ninvolves evaluating them negatively on the basis of, respectively,\ntheir nationality and political affiliation, and calling someone a\njerk involves evaluating him (it usually is a he) negatively for\nhaving certain sorts of non-evaluative features that make a person\nunlikeable. But it is controversial whether paradigmatic thick\nconcepts work in the same way as concepts for specific ways of being\ngood and pejoratives. It is also unclear whether\n“affective” terms such as admirable and\ncontemptible are substantially similar to paradigmatic thick\nterms and concepts. Finally, some philosophers investigate “dual\ncharacter concepts” (for an overview and references, see Reuter\n2019). These are supposed to be similar to thick concepts in involving\nboth description and evaluation, but distinctive in that their\ndescriptive and evaluative dimensions, while related, are independent.\nFor instance, there is a sense in which a person may count as an\nartist if certain descriptive conditions, such as making sculptures\nfor a living, are met. But there is also a sense in which a person may\ncount as an artist if she satisfies norms concerning what an artist\nshould be or do. A person may count as an artist in one sense\nbut not the other. This might be regarded as evidence that\nartist encodes two independent dimensions of content, which\nare weighted differently in different contexts of use. One alternative\nanalysis of such different uses of words like artist is that\nthese words are polysemous. In that case they would stand for\ndifferent concepts in different occurrences, rather than one concept\nwith multiple dimensions of content. The relationship between dual\ncharacter and thick concepts may thus depend on what notion of\nconcepts we work with. This issue has rarely been addressed in detail\nin the literature on thick concepts. Either way, questions arise\nconcerning whether dual character concepts and thick concepts are\nnormative or evaluative in the same kind of way and whether some\nconcepts might be both thick and dual character. Some suggest that empirical\ninvestigation can shed light on the nature of dual character concepts\nand their relation to thick concepts (Reuter 2019; Liao et\nal. 2020). \n\nDespite these complications in characterizing thick terms and\nconcepts, they are widely agreed to be of potentially high\nsignificance. An important assumption in many metaethical debates is\nthat the evaluative and the non-evaluative can be sharply\ndistinguished. If the evaluative and non-evaluative aspects of thick\nterms or concepts aren’t separable into distinct components,\nthese debates may be impacted in a fundamental way. Starting with some\nprominent arguments in the literature concerning the significance of\nthick concepts will naturally lead us to fundamental questions about\ntheir nature.\n",
    "section_title": "1. What Are Thick Concepts? Background and Preliminaries",
    "entry_title": "Thick Ethical Concepts",
    "hierarchy_title": "Thick Ethical Concepts || What Are Thick Concepts? Background and Preliminaries",
    "tokenized_text": [
        "thick",
        "concept",
        "background",
        "preliminary",
        "thick",
        "concept",
        "background",
        "preliminary",
        "designation",
        "thick",
        "concept",
        "concept",
        "combine",
        "evaluation",
        "nonevaluative",
        "description",
        "originates",
        "bernard",
        "williams",
        "ethic",
        "limit",
        "philosophy",
        "williams",
        "williams",
        "seems",
        "drawn",
        "label",
        "thick",
        "notion",
        "thick",
        "description",
        "introduced",
        "gilbert",
        "ryle",
        "adapted",
        "purpose",
        "anthropologist",
        "clifford",
        "geertz",
        "ryle",
        "characterizes",
        "thick",
        "description",
        "description",
        "human",
        "activity",
        "mere",
        "bodily",
        "motion",
        "involving",
        "intentional",
        "purposive",
        "detail",
        "help",
        "u",
        "understand",
        "activity",
        "ryle",
        "geertz",
        "terminology",
        "thickness",
        "matter",
        "culturally",
        "specific",
        "significance",
        "detail",
        "geertz",
        "unlike",
        "thick",
        "concept",
        "thick",
        "description",
        "ryle",
        "geertz",
        "sens",
        "involve",
        "evaluation",
        "one",
        "connection",
        "williams",
        "terminology",
        "many",
        "thick",
        "concept",
        "incorporate",
        "culturally",
        "specific",
        "information",
        "cf",
        "scanlon",
        "different",
        "society",
        "might",
        "sufficiently",
        "different",
        "understanding",
        "courage",
        "distinct",
        "concept",
        "might",
        "lack",
        "concept",
        "altogether",
        "similar",
        "cultural",
        "specificity",
        "kind",
        "sexual",
        "morality",
        "chaste",
        "play",
        "role",
        "kind",
        "honor",
        "culture",
        "noble",
        "point",
        "cf",
        "williams",
        "ff",
        "terminology",
        "thick",
        "thin",
        "concept",
        "originates",
        "williams",
        "first",
        "spot",
        "distinction",
        "us",
        "label",
        "pick",
        "instance",
        "rm",
        "hare",
        "distinguishes",
        "primarily",
        "secondarily",
        "evaluative",
        "word",
        "language",
        "moral",
        "example",
        "former",
        "paradigmatic",
        "thin",
        "concept",
        "example",
        "latter",
        "paradigmatic",
        "thick",
        "concept",
        "hare",
        "see",
        "also",
        "discussion",
        "persuasive",
        "definition",
        "stevenson",
        "example",
        "thick",
        "thin",
        "term",
        "concept",
        "began",
        "exhibit",
        "intuitive",
        "contrast",
        "term",
        "like",
        "generous",
        "cruel",
        "tactful",
        "appear",
        "descriptively",
        "specific",
        "rich",
        "content",
        "term",
        "wrong",
        "good",
        "seem",
        "general",
        "purely",
        "evaluative",
        "even",
        "calling",
        "something",
        "selfish",
        "evaluates",
        "bad",
        "way",
        "respect",
        "bad",
        "act",
        "count",
        "selfish",
        "must",
        "also",
        "involve",
        "agent",
        "giving",
        "significant",
        "degree",
        "priority",
        "others",
        "intuitive",
        "contrast",
        "best",
        "understood",
        "subject",
        "several",
        "controversy",
        "may",
        "theoryneutral",
        "answer",
        "first",
        "saying",
        "thick",
        "term",
        "concept",
        "sense",
        "evaluative",
        "descriptive",
        "meant",
        "notion",
        "illustrative",
        "example",
        "descriptive",
        "term",
        "include",
        "square",
        "gold",
        "wombat",
        "spotted",
        "recursive",
        "beer",
        "unequal",
        "income",
        "plausibly",
        "painful",
        "paradigmatic",
        "example",
        "evaluative",
        "term",
        "include",
        "thin",
        "term",
        "good",
        "bad",
        "ought",
        "right",
        "wrong",
        "distinguish",
        "evaluative",
        "descriptive",
        "simply",
        "term",
        "different",
        "function",
        "thought",
        "talk",
        "judgment",
        "involving",
        "thick",
        "concept",
        "evaluative",
        "judgment",
        "cognitivists",
        "noncognitivists",
        "disagree",
        "function",
        "according",
        "noncognitivists",
        "primary",
        "function",
        "evaluative",
        "term",
        "express",
        "induce",
        "conative",
        "attitude",
        "desire",
        "preference",
        "dis",
        "approval",
        "truthapt",
        "desire",
        "world",
        "peace",
        "sort",
        "thing",
        "true",
        "false",
        "command",
        "like",
        "shut",
        "according",
        "cognitivists",
        "evaluative",
        "term",
        "like",
        "descriptive",
        "term",
        "primary",
        "function",
        "express",
        "cognitive",
        "state",
        "belief",
        "apt",
        "assessed",
        "robustly",
        "true",
        "false",
        "capture",
        "distinction",
        "thick",
        "thin",
        "term",
        "identifying",
        "descriptive",
        "factual",
        "assume",
        "evaluation",
        "factual",
        "would",
        "assume",
        "kind",
        "distinction",
        "fact",
        "value",
        "thick",
        "concept",
        "sometimes",
        "thought",
        "undermine",
        "see",
        "section",
        "neutral",
        "term",
        "may",
        "able",
        "much",
        "better",
        "say",
        "purely",
        "descriptive",
        "term",
        "given",
        "big",
        "list",
        "term",
        "would",
        "generally",
        "classified",
        "falling",
        "isside",
        "distinction",
        "ought",
        "rest",
        "evaluative",
        "term",
        "jackson",
        "descriptive",
        "term",
        "would",
        "thus",
        "purely",
        "nonevaluative",
        "boundary",
        "may",
        "sharp",
        "particular",
        "might",
        "vague",
        "whether",
        "thick",
        "term",
        "honest",
        "classified",
        "purely",
        "descriptive",
        "partly",
        "evaluative",
        "jackson",
        "even",
        "vague",
        "matter",
        "controversy",
        "see",
        "section",
        "case",
        "take",
        "evaluative",
        "exclude",
        "purely",
        "nonevaluative",
        "nonevaluative",
        "description",
        "something",
        "given",
        "purely",
        "nonevaluative",
        "term",
        "interesting",
        "feature",
        "thick",
        "term",
        "concept",
        "even",
        "count",
        "evaluative",
        "binary",
        "distinction",
        "supposed",
        "straddle",
        "distinction",
        "second",
        "remarkably",
        "difficult",
        "find",
        "suitably",
        "neutral",
        "positive",
        "characterization",
        "thick",
        "concept",
        "beyond",
        "idea",
        "somehow",
        "combine",
        "evaluation",
        "nonevaluative",
        "description",
        "williams",
        "characterizes",
        "application",
        "thick",
        "concept",
        "actionguiding",
        "guided",
        "world",
        "application",
        "depends",
        "way",
        "world",
        "also",
        "concept",
        "kind",
        "applies",
        "often",
        "provides",
        "someone",
        "reason",
        "action",
        "williams",
        "see",
        "also",
        "moore",
        "heuer",
        "smith",
        "contrast",
        "application",
        "thin",
        "evaluative",
        "concept",
        "supposed",
        "purely",
        "actionguiding",
        "worldguided",
        "moral",
        "realist",
        "presumably",
        "think",
        "application",
        "thin",
        "concept",
        "also",
        "worldguided",
        "whether",
        "thin",
        "concept",
        "truly",
        "applies",
        "depends",
        "world",
        "objective",
        "value",
        "lie",
        "existing",
        "characterization",
        "either",
        "suffer",
        "similar",
        "problem",
        "failing",
        "characterize",
        "thick",
        "concept",
        "else",
        "either",
        "informative",
        "theoryladen",
        "see",
        "eg",
        "gibbard",
        "dancy",
        "scanlon",
        "kyle",
        "critical",
        "discussion",
        "eklund",
        "third",
        "intuitive",
        "contrast",
        "thick",
        "thin",
        "term",
        "term",
        "somehow",
        "combine",
        "evaluation",
        "nonevaluative",
        "description",
        "classifies",
        "thick",
        "paradigmatic",
        "thick",
        "concept",
        "style",
        "cruel",
        "courageous",
        "kind",
        "also",
        "respectrelative",
        "evaluative",
        "concept",
        "pejorative",
        "term",
        "claim",
        "good",
        "knife",
        "charlie",
        "good",
        "child",
        "ascribe",
        "way",
        "good",
        "certain",
        "nonevaluatively",
        "described",
        "respect",
        "good",
        "thing",
        "good",
        "knife",
        "must",
        "also",
        "knife",
        "knife",
        "nonevaluative",
        "concept",
        "similarly",
        "speaking",
        "people",
        "kraut",
        "wingnuts",
        "involves",
        "evaluating",
        "negatively",
        "basis",
        "respectively",
        "nationality",
        "political",
        "affiliation",
        "calling",
        "someone",
        "jerk",
        "involves",
        "evaluating",
        "usually",
        "negatively",
        "certain",
        "sort",
        "nonevaluative",
        "feature",
        "make",
        "person",
        "unlikeable",
        "controversial",
        "whether",
        "paradigmatic",
        "thick",
        "concept",
        "work",
        "way",
        "concept",
        "specific",
        "way",
        "good",
        "pejoratives",
        "also",
        "unclear",
        "whether",
        "affective",
        "term",
        "admirable",
        "contemptible",
        "substantially",
        "similar",
        "paradigmatic",
        "thick",
        "term",
        "concept",
        "finally",
        "philosopher",
        "investigate",
        "dual",
        "character",
        "concept",
        "overview",
        "reference",
        "see",
        "reuter",
        "supposed",
        "similar",
        "thick",
        "concept",
        "involving",
        "description",
        "evaluation",
        "distinctive",
        "descriptive",
        "evaluative",
        "dimension",
        "related",
        "independent",
        "instance",
        "sense",
        "person",
        "may",
        "count",
        "artist",
        "certain",
        "descriptive",
        "condition",
        "making",
        "sculpture",
        "living",
        "met",
        "also",
        "sense",
        "person",
        "may",
        "count",
        "artist",
        "satisfies",
        "norm",
        "concerning",
        "artist",
        "person",
        "may",
        "count",
        "artist",
        "one",
        "sense",
        "might",
        "regarded",
        "evidence",
        "artist",
        "encodes",
        "two",
        "independent",
        "dimension",
        "content",
        "weighted",
        "differently",
        "different",
        "context",
        "use",
        "one",
        "alternative",
        "analysis",
        "different",
        "us",
        "word",
        "like",
        "artist",
        "word",
        "polysemous",
        "case",
        "would",
        "stand",
        "different",
        "concept",
        "different",
        "occurrence",
        "rather",
        "one",
        "concept",
        "multiple",
        "dimension",
        "content",
        "relationship",
        "dual",
        "character",
        "thick",
        "concept",
        "may",
        "thus",
        "depend",
        "notion",
        "concept",
        "work",
        "issue",
        "rarely",
        "addressed",
        "detail",
        "literature",
        "thick",
        "concept",
        "either",
        "way",
        "question",
        "arise",
        "concerning",
        "whether",
        "dual",
        "character",
        "concept",
        "thick",
        "concept",
        "normative",
        "evaluative",
        "kind",
        "way",
        "whether",
        "concept",
        "might",
        "thick",
        "dual",
        "character",
        "suggest",
        "empirical",
        "investigation",
        "shed",
        "light",
        "nature",
        "dual",
        "character",
        "concept",
        "relation",
        "thick",
        "concept",
        "reuter",
        "liao",
        "et",
        "al",
        "despite",
        "complication",
        "characterizing",
        "thick",
        "term",
        "concept",
        "widely",
        "agreed",
        "potentially",
        "high",
        "significance",
        "important",
        "assumption",
        "many",
        "metaethical",
        "debate",
        "evaluative",
        "nonevaluative",
        "sharply",
        "distinguished",
        "evaluative",
        "nonevaluative",
        "aspect",
        "thick",
        "term",
        "concept",
        "separable",
        "distinct",
        "component",
        "debate",
        "may",
        "impacted",
        "fundamental",
        "way",
        "starting",
        "prominent",
        "argument",
        "literature",
        "concerning",
        "significance",
        "thick",
        "concept",
        "naturally",
        "lead",
        "u",
        "fundamental",
        "question",
        "nature"
    ]
}