{
    "main_text": "Do Thick Concepts Have Distinctive Significance? || The “Anti-Disentangling” Argument\n2.2 The “Anti-Disentangling” Argument\n\nThick terms and concepts challenge the is-ought gap only if\nthey are evaluative in meaning and have analytically sufficient\nnon-evaluative application conditions. It also seems plausible that\nthick terms and concepts have some necessary non-evaluative\napplication conditions. A bad act can be selfish only if it involves\ngiving greater priority to oneself over others in some way and rude\nonly if it causes offense, a good act can be generous only if it\ninvolves giving to others out of one’s own resources. An\nargument offered by John McDowell is often interpreted as showing that\nthere can be no non-evaluative description that is both necessary and\nsufficient for the application of a thick term and, moreover, that\nthis bears on whether the evaluative and non-evaluative aspects of\nthick terms and concepts are separable into distinct components\n(Williams 1985: 140–1; Dancy 1995; Kirchin 2010).\n\nMcDowell is concerned with\n\n\nwhether, corresponding to any value concept, one can always isolate\n… a feature that is there … independently of\nanyone’s value experience being as it is. (McDowell 1981 [1998]:\n200–1)\n\n\nHe targets non-cognitivism in particular as a view that requires the\npossibility of isolating a non-evaluative feature of this kind.\nMcDowell’s argument against this possibility is often called the\n“disentangling argument” (1981 [1998]: 202; cf. 216).\n\n(D1)\nIf an evaluative concept E can be\n“disentangled” into a non-evaluative description D\nthat is co-extensive with E and an evaluation that gives the\nevaluative orientation of E, then it would be possible to\nmaster the extension of E, and thus group together exactly the\nitems to which competent users would apply E, without\nunderstanding its evaluative orientation.\n(D2)\nIt isn’t possible to anticipate the usage of E in a\nway required for mastering its extension without understanding the\nevaluative orientation of E.\n(C)\nTherefore, E cannot be disentangled into non-evaluative\ndescription D that is co-extensive with E plus an\nevaluation that gives the evaluative orientation of E.\n\n\nGiven the conclusion, the label “anti-disentangling\nargument” would seem more accurate (Roberts 2011). In support of\n(D2), McDowell asks us to imagine “a specific conception of some\nmoral virtue … current in a reasonably cohesive moral\ncommunity” and then consider an “outsider” to the\nevaluative perspective of those who deploy the concept (McDowell 1981\n[1998]: 201). An example might be someone who cannot even\nimaginatively engage with the kind of sexual morality that is normally\nconveyed by applying lewd to overt sexual display. Many\npeople find it implausible that such an outsider could master the\nextension of lewd by grasping a non-evaluative content that\napplies to all and only the items the insiders call lewd\n(assuming there is one), and that this is so in principle, not merely\nbecause of the contingent limitations of our language. Unless there is\na way to grasp the extension without engaging with insiders’\nevaluative perspective, it would seem that evaluative classifications\nare in principle not graspable with purely non-evaluative\nrepresentational resources (McDowell 1981 [1998]: 216).\n\nThe key question for present purposes is how the anti-disentangling\nargument bears on thick terms and concepts. (On the argument itself,\nsee Lang 2001; Miller 2003: 250–4; and Roberts 2011, 2013a.) The\nquestion isn’t straightforward. McDowell makes a general claim\nabout evaluative terms. But many writers take it to bear on how thick\nterms and concepts combine evaluation and non-evaluative description,\nspecifically by favoring Inseparability over Separability (Williams\n1985; Kirchin 2010):\n\n\nSeparability: The evaluative and non-evaluative aspects of\nthick terms and concepts are distinct components that can at least in\nprinciple be “disentangled” from one another. (Hare 1952:\n121–2; Hare 1981: 17–8, 73–5; Blackburn 1992, 1998:\n101ff.; Burton 1992; Miller 2003: 244–54; Richard 2008:\n28–33; Elstein and Hurka 2009; Smith 2013; Kyle 2020)\n\nInseparability: Thick terms and concepts are or represent\nirreducible fusions of evaluation and non-evaluative description which\ncannot be “disentangled”. (Williams 1985: 129–30,\n140–1; Putnam 2002: ch. 2; Kirchin 2010, 2017: ch. 2; Roberts\n2011; Harcourt and Thomas 2013)\n\n\nSaying that the anti-disentangling argument favors Inseparability over\nSeparability misstates the case, however. The argument gets a grip on\nthick terms only under the following assumption:\n\n\nDescriptive Equivalence: For every thick term or concept,\nsomeone has or could acquire an independently intelligible purely\nnon-evaluative description with the same extension.\n\n\nAccording to Descriptive Equivalence, the extensions of thick terms\nare determined only by their non-evaluative content; evaluative\ncontent makes no difference to what things fall under a thick term. If\nthis means that an outsider who doesn’t share the evaluative\noutlook associated with a thick concept should nonetheless be able to\nanticipate the insiders’ use, then the anti-disentangling\nargument rules out Descriptive Equivalence. But that favors\nInseparability only if Separability entails Descriptive Equivalence;\nas we’ll see in\n section 3,\n that assumption is highly controversial. (For problems with\nDescriptive Equivalence itself, see Sreenivasan 2001.)\n\nSignificant issues are at stake here. If Separability entails\nDescriptive Equivalence but Descriptive Equivalence is false, then\nthick terms and concepts cannot be analyzed or reduced to thin\nevaluation plus non-evaluative description. For instance,\nrude couldn’t mean bad for causing offense by\nindicating lack of respect. In that case, thin terms\nwouldn’t enjoy conceptual or explanatory priority over the\nthick, and moral theorists would risk ignoring or distorting a\nsubstantial range of moral phenomena if they focused exclusively on\nthe thin. But if Separability doesn’t entail Descriptive\nEquivalence, thick concepts may be explicable in terms of thin\nevaluation plus non-evaluative description even if the\nanti-disentangling argument is sound.\n\nThe debate discussed above has largely supposed that a descriptive\nequivalent would be encoded in the meaning of a thick term, and thus\nwould presumably be something that competent speakers should in\nprinciple be able to articulate. But we would struggle to say what the\nvery many ways of being cruel, for instance, have in common without\nrelying on our understanding of cruel (Little 2000: 279). Our\npoor track record in capturing the extensions of thick terms in\nindependently intelligible non-evaluative terms should then count\nagainst Descriptive Equivalence. But note that, so far as the\nanti-disentangling argument goes, a non-evaluative description could\nbe necessarily extensionally equivalent to an evaluative term or\nconcept without belonging to the latter’s meaning. An evaluative\nconcept could be held to have a non-evaluative “shape” as\na matter of a necessary a posteriori equivalence, perhaps in\nthe way that the necessary synthetic equivalence of “x is\nwater” and “x is H2O” is\ndiscoverable only a posteriori. (D1) clearly allows this\npossibility. (D2) must then remain plausible if ‘possible’\nis read as including the possibility of mastering the extension of an\nevaluative term by latching onto a non-evaluative necessary\nextensional equivalent (provided there is one) in an a\nposteriori way. The notion of disentangling in McDowell’s\nargument is therefore not semantic or conceptual. The argument’s\nreal conclusion seems rather to be:\n\n\nShapelessness: The extensions of evaluative terms and\nconcepts aren’t unified under independently intelligible\nnon-evaluative relations of real similarity, not even as a matter of\nsynthetic a posteriori truth that isn’t settled by the\nmeanings of evaluative terms or concepts. (Miller 2003: 250–4;\nKirchin 2010; Roberts 2011, 2013a; Väyrynen 2014)\n\n\nIf Shapelessness were true, that would explain why the sort of\ndisentanglement targeted by McDowell’s argument isn’t\npossible. Indeed, the non-evaluative shapelessness of the evaluative\nis often thought to provide a particularly good explanation of why\n(D2) is plausible (Roberts 2011: 506).\n\nAlthough Shapelessness is a general issue about evaluative concepts,\nits bearing on thick concepts is worth noting. Suppose an outsider\ncould anticipate insiders’ use of an evaluative term in new\ncases by using similarities between old cases and new cases to infer\nwhether the evaluative term applies in the new cases. Shapelessness\nentails that such similarities would have to be evaluative. If so,\nDescriptive Equivalence is false. Conversely, insofar as the\nextensions of evaluative terms can be mastered on the basis of\nnon-evaluative similarities, Shapelessness is false. The way thick\nterms involve non-evaluative description may be thought to make them a\nparticularly suitable test case for these general issues about\nevaluative concepts. But note, finally, that thick concepts do so only\nif their evaluative aspects are somehow built into them, such as\nperhaps as a matter of meaning. The commitment here is to:\n\n\nInherently Evaluative: The meanings of thick terms and\nconcepts somehow contain evaluation.\n\n\nThis generic thesis covers a range of options regarding what sort of\nevaluation the meanings of thick terms and concepts might be thought\nto contain and how they contain it. Some version of Inherently\nEvaluative clearly is presupposed by Inseparability. By contrast,\nSeparability allows (though doesn’t entail) that thick terms and\nconcepts might convey evaluation only pragmatically, as a matter of\nuse. Different answers to this location question are, again, the topic\nof\n section 4.\n",
    "section_title": "2.2 The “Anti-Disentangling” Argument",
    "entry_title": "Thick Ethical Concepts",
    "hierarchy_title": "Thick Ethical Concepts || Do Thick Concepts Have Distinctive Significance? || The “Anti-Disentangling” Argument",
    "tokenized_text": [
        "thick",
        "concept",
        "distinctive",
        "significance",
        "antidisentangling",
        "argument",
        "antidisentangling",
        "argument",
        "thick",
        "term",
        "concept",
        "challenge",
        "isought",
        "gap",
        "evaluative",
        "meaning",
        "analytically",
        "sufficient",
        "nonevaluative",
        "application",
        "condition",
        "also",
        "seems",
        "plausible",
        "thick",
        "term",
        "concept",
        "necessary",
        "nonevaluative",
        "application",
        "condition",
        "bad",
        "act",
        "selfish",
        "involves",
        "giving",
        "greater",
        "priority",
        "oneself",
        "others",
        "way",
        "rude",
        "cause",
        "offense",
        "good",
        "act",
        "generous",
        "involves",
        "giving",
        "others",
        "one",
        "resource",
        "argument",
        "offered",
        "john",
        "mcdowell",
        "often",
        "interpreted",
        "showing",
        "nonevaluative",
        "description",
        "necessary",
        "sufficient",
        "application",
        "thick",
        "term",
        "moreover",
        "bear",
        "whether",
        "evaluative",
        "nonevaluative",
        "aspect",
        "thick",
        "term",
        "concept",
        "separable",
        "distinct",
        "component",
        "williams",
        "dancy",
        "kirchin",
        "mcdowell",
        "concerned",
        "whether",
        "corresponding",
        "value",
        "concept",
        "one",
        "always",
        "isolate",
        "feature",
        "independently",
        "anyone",
        "value",
        "experience",
        "mcdowell",
        "target",
        "noncognitivism",
        "particular",
        "view",
        "requires",
        "possibility",
        "isolating",
        "nonevaluative",
        "feature",
        "kind",
        "mcdowell",
        "argument",
        "possibility",
        "often",
        "called",
        "disentangling",
        "argument",
        "cf",
        "d",
        "evaluative",
        "concept",
        "e",
        "disentangled",
        "nonevaluative",
        "description",
        "coextensive",
        "e",
        "evaluation",
        "give",
        "evaluative",
        "orientation",
        "e",
        "would",
        "possible",
        "master",
        "extension",
        "e",
        "thus",
        "group",
        "together",
        "exactly",
        "item",
        "competent",
        "user",
        "would",
        "apply",
        "e",
        "without",
        "understanding",
        "evaluative",
        "orientation",
        "d",
        "possible",
        "anticipate",
        "usage",
        "e",
        "way",
        "required",
        "mastering",
        "extension",
        "without",
        "understanding",
        "evaluative",
        "orientation",
        "e",
        "c",
        "therefore",
        "e",
        "disentangled",
        "nonevaluative",
        "description",
        "coextensive",
        "e",
        "plus",
        "evaluation",
        "give",
        "evaluative",
        "orientation",
        "e",
        "given",
        "conclusion",
        "label",
        "antidisentangling",
        "argument",
        "would",
        "seem",
        "accurate",
        "robert",
        "support",
        "d",
        "mcdowell",
        "asks",
        "u",
        "imagine",
        "specific",
        "conception",
        "moral",
        "virtue",
        "current",
        "reasonably",
        "cohesive",
        "moral",
        "community",
        "consider",
        "outsider",
        "evaluative",
        "perspective",
        "deploy",
        "concept",
        "mcdowell",
        "example",
        "might",
        "someone",
        "even",
        "imaginatively",
        "engage",
        "kind",
        "sexual",
        "morality",
        "normally",
        "conveyed",
        "applying",
        "lewd",
        "overt",
        "sexual",
        "display",
        "many",
        "people",
        "find",
        "implausible",
        "outsider",
        "could",
        "master",
        "extension",
        "lewd",
        "grasping",
        "nonevaluative",
        "content",
        "applies",
        "item",
        "insider",
        "call",
        "lewd",
        "assuming",
        "one",
        "principle",
        "merely",
        "contingent",
        "limitation",
        "language",
        "unless",
        "way",
        "grasp",
        "extension",
        "without",
        "engaging",
        "insider",
        "evaluative",
        "perspective",
        "would",
        "seem",
        "evaluative",
        "classification",
        "principle",
        "graspable",
        "purely",
        "nonevaluative",
        "representational",
        "resource",
        "mcdowell",
        "key",
        "question",
        "present",
        "purpose",
        "antidisentangling",
        "argument",
        "bear",
        "thick",
        "term",
        "concept",
        "argument",
        "see",
        "lang",
        "miller",
        "robert",
        "a",
        "question",
        "straightforward",
        "mcdowell",
        "make",
        "general",
        "claim",
        "evaluative",
        "term",
        "many",
        "writer",
        "take",
        "bear",
        "thick",
        "term",
        "concept",
        "combine",
        "evaluation",
        "nonevaluative",
        "description",
        "specifically",
        "favoring",
        "inseparability",
        "separability",
        "williams",
        "kirchin",
        "separability",
        "evaluative",
        "nonevaluative",
        "aspect",
        "thick",
        "term",
        "concept",
        "distinct",
        "component",
        "least",
        "principle",
        "disentangled",
        "one",
        "another",
        "hare",
        "hare",
        "blackburn",
        "ff",
        "burton",
        "miller",
        "richard",
        "elstein",
        "hurka",
        "smith",
        "kyle",
        "inseparability",
        "thick",
        "term",
        "concept",
        "represent",
        "irreducible",
        "fusion",
        "evaluation",
        "nonevaluative",
        "description",
        "disentangled",
        "williams",
        "putnam",
        "ch",
        "kirchin",
        "ch",
        "robert",
        "harcourt",
        "thomas",
        "saying",
        "antidisentangling",
        "argument",
        "favor",
        "inseparability",
        "separability",
        "misstates",
        "case",
        "however",
        "argument",
        "get",
        "grip",
        "thick",
        "term",
        "following",
        "assumption",
        "descriptive",
        "equivalence",
        "every",
        "thick",
        "term",
        "concept",
        "someone",
        "could",
        "acquire",
        "independently",
        "intelligible",
        "purely",
        "nonevaluative",
        "description",
        "extension",
        "according",
        "descriptive",
        "equivalence",
        "extension",
        "thick",
        "term",
        "determined",
        "nonevaluative",
        "content",
        "evaluative",
        "content",
        "make",
        "difference",
        "thing",
        "fall",
        "thick",
        "term",
        "mean",
        "outsider",
        "share",
        "evaluative",
        "outlook",
        "associated",
        "thick",
        "concept",
        "nonetheless",
        "able",
        "anticipate",
        "insider",
        "use",
        "antidisentangling",
        "argument",
        "rule",
        "descriptive",
        "equivalence",
        "favor",
        "inseparability",
        "separability",
        "entail",
        "descriptive",
        "equivalence",
        "see",
        "section",
        "assumption",
        "highly",
        "controversial",
        "problem",
        "descriptive",
        "equivalence",
        "see",
        "sreenivasan",
        "significant",
        "issue",
        "stake",
        "separability",
        "entail",
        "descriptive",
        "equivalence",
        "descriptive",
        "equivalence",
        "false",
        "thick",
        "term",
        "concept",
        "analyzed",
        "reduced",
        "thin",
        "evaluation",
        "plus",
        "nonevaluative",
        "description",
        "instance",
        "rude",
        "mean",
        "bad",
        "causing",
        "offense",
        "indicating",
        "lack",
        "respect",
        "case",
        "thin",
        "term",
        "enjoy",
        "conceptual",
        "explanatory",
        "priority",
        "thick",
        "moral",
        "theorist",
        "would",
        "risk",
        "ignoring",
        "distorting",
        "substantial",
        "range",
        "moral",
        "phenomenon",
        "focused",
        "exclusively",
        "thin",
        "separability",
        "entail",
        "descriptive",
        "equivalence",
        "thick",
        "concept",
        "may",
        "explicable",
        "term",
        "thin",
        "evaluation",
        "plus",
        "nonevaluative",
        "description",
        "even",
        "antidisentangling",
        "argument",
        "sound",
        "debate",
        "discussed",
        "largely",
        "supposed",
        "descriptive",
        "equivalent",
        "would",
        "encoded",
        "meaning",
        "thick",
        "term",
        "thus",
        "would",
        "presumably",
        "something",
        "competent",
        "speaker",
        "principle",
        "able",
        "articulate",
        "would",
        "struggle",
        "say",
        "many",
        "way",
        "cruel",
        "instance",
        "common",
        "without",
        "relying",
        "understanding",
        "cruel",
        "little",
        "poor",
        "track",
        "record",
        "capturing",
        "extension",
        "thick",
        "term",
        "independently",
        "intelligible",
        "nonevaluative",
        "term",
        "count",
        "descriptive",
        "equivalence",
        "note",
        "far",
        "antidisentangling",
        "argument",
        "go",
        "nonevaluative",
        "description",
        "could",
        "necessarily",
        "extensionally",
        "equivalent",
        "evaluative",
        "term",
        "concept",
        "without",
        "belonging",
        "latter",
        "meaning",
        "evaluative",
        "concept",
        "could",
        "held",
        "nonevaluative",
        "shape",
        "matter",
        "necessary",
        "posteriori",
        "equivalence",
        "perhaps",
        "way",
        "necessary",
        "synthetic",
        "equivalence",
        "x",
        "water",
        "x",
        "ho",
        "discoverable",
        "posteriori",
        "d",
        "clearly",
        "allows",
        "possibility",
        "d",
        "must",
        "remain",
        "plausible",
        "possible",
        "read",
        "including",
        "possibility",
        "mastering",
        "extension",
        "evaluative",
        "term",
        "latching",
        "onto",
        "nonevaluative",
        "necessary",
        "extensional",
        "equivalent",
        "provided",
        "one",
        "posteriori",
        "way",
        "notion",
        "disentangling",
        "mcdowell",
        "argument",
        "therefore",
        "semantic",
        "conceptual",
        "argument",
        "real",
        "conclusion",
        "seems",
        "rather",
        "shapelessness",
        "extension",
        "evaluative",
        "term",
        "concept",
        "unified",
        "independently",
        "intelligible",
        "nonevaluative",
        "relation",
        "real",
        "similarity",
        "even",
        "matter",
        "synthetic",
        "posteriori",
        "truth",
        "settled",
        "meaning",
        "evaluative",
        "term",
        "concept",
        "miller",
        "kirchin",
        "robert",
        "a",
        "väyrynen",
        "shapelessness",
        "true",
        "would",
        "explain",
        "sort",
        "disentanglement",
        "targeted",
        "mcdowell",
        "argument",
        "possible",
        "indeed",
        "nonevaluative",
        "shapelessness",
        "evaluative",
        "often",
        "thought",
        "provide",
        "particularly",
        "good",
        "explanation",
        "d",
        "plausible",
        "robert",
        "although",
        "shapelessness",
        "general",
        "issue",
        "evaluative",
        "concept",
        "bearing",
        "thick",
        "concept",
        "worth",
        "noting",
        "suppose",
        "outsider",
        "could",
        "anticipate",
        "insider",
        "use",
        "evaluative",
        "term",
        "new",
        "case",
        "using",
        "similarity",
        "old",
        "case",
        "new",
        "case",
        "infer",
        "whether",
        "evaluative",
        "term",
        "applies",
        "new",
        "case",
        "shapelessness",
        "entail",
        "similarity",
        "would",
        "evaluative",
        "descriptive",
        "equivalence",
        "false",
        "conversely",
        "insofar",
        "extension",
        "evaluative",
        "term",
        "mastered",
        "basis",
        "nonevaluative",
        "similarity",
        "shapelessness",
        "false",
        "way",
        "thick",
        "term",
        "involve",
        "nonevaluative",
        "description",
        "may",
        "thought",
        "make",
        "particularly",
        "suitable",
        "test",
        "case",
        "general",
        "issue",
        "evaluative",
        "concept",
        "note",
        "finally",
        "thick",
        "concept",
        "evaluative",
        "aspect",
        "somehow",
        "built",
        "perhaps",
        "matter",
        "meaning",
        "commitment",
        "inherently",
        "evaluative",
        "meaning",
        "thick",
        "term",
        "concept",
        "somehow",
        "contain",
        "evaluation",
        "generic",
        "thesis",
        "cover",
        "range",
        "option",
        "regarding",
        "sort",
        "evaluation",
        "meaning",
        "thick",
        "term",
        "concept",
        "might",
        "thought",
        "contain",
        "contain",
        "version",
        "inherently",
        "evaluative",
        "clearly",
        "presupposed",
        "inseparability",
        "contrast",
        "separability",
        "allows",
        "though",
        "entail",
        "thick",
        "term",
        "concept",
        "might",
        "convey",
        "evaluation",
        "pragmatically",
        "matter",
        "use",
        "different",
        "answer",
        "location",
        "question",
        "topic",
        "section"
    ]
}