{
    "main_text": "The Location Question: How Are Thick Concepts Evaluative? || Pragmatic Views\n4.2 Pragmatic Views\n\nUnderstanding how else thick terms might be related to evaluation than\nby way of truth-conditions requires a brief look at how utterances can\nin general communicate information that isn’t part of their\ntruth-conditions. Linguists and philosophers of language have\nidentified several other mechanisms of information transfer by which a\nspeaker can communicate information, such as a proposition, that\nisn’t part of the truth-conditions of her utterance. If this\nfurther information is false, that isn’t usually thought to make\nthe utterance itself false, but merely odd in some way. Some of these\nmechanisms operate on other features besides truth-conditions which\nterms may have in virtue of linguistic conventions, others operate\nthrough distinct conversational mechanisms. (For a fuller discussion\nof these mechanisms in the context of thick terms, see Väyrynen\n2013: ch. 5.)\n\nOne way for utterances to communicate further information is\npresupposition:\n\n(8)\nA: “I don’t regret being a member of the\nCommunist party.”\n\nPresupposition: A was a member of the Communist party.\n\n\nHow exactly presuppositions of utterances are related to their\ntruth-conditions is a complex topic. Perhaps A’s\nutterance can be true even if the presupposition is false: you\ncan’t regret something you never did. Either way, linguists\nlargely think that the presupposition isn’t part of the\ntruth-conditions of A’s utterance, but only part of the\n“common ground” of the conversation. Among writers on\nthick concepts, Allan Gibbard and Gopal Sreenivasan speak of the\nevaluations conveyed by T-utterances as presuppositions, but without\ndeveloping the view in detail (Gibbard 1992; Sreenivasan 2001: 26).\nMore detailed and sophisticated developments can be found in Cepollaro\nand Stojanovic (2016) and Cepollaro (2020). An open question about\nthis view is whether the relevant presuppositions are better\nunderstood pragmatically, as conveying the speaker’s beliefs\nabout the conversation’s common ground, or semantically, as\nsomething that expressions carry as part of their meaning. A worry\nabout presuppositional views is that the evaluations normally conveyed\nby objectionable thick concepts have no prospect of being added to the\ncommon ground of the conversation when some addressees find them\nobjectionable, whereas presuppositions not already in the common\nground are expected to be added to it unless challenged. Resources for\naddressing both of these issues might, however, be available in the\ncomplex and subtle contemporary work on presupposition in linguistics\n(cf. Cepollaro 2020: ch. 4). \n\nUtterances can communicate further information by way of conventional\nimplicature (Grice 1975: 25).\n\n(9)\nA: “Shaq is tall but agile.”\n\nConventional implicature: Shaq’s agility is unexpected given his\ntallness.\n\n\nThere is significant consensus that “Shaq is tall but\nagile” and “Shaq is tall and agile” are true in all\nthe same circumstances. But the latter doesn’t communicate a\ncontrast between tallness and agility. The implicated contrast\nproposition isn’t part of the truth-conditions of\nB’s utterance. The implicature is widely regarded as\nconventional because the contrast seems to be part of the standing\nmeaning of but in English; a speaker who finds no difference\nbetween what and and but communicate is in some\nsense not fully competent with but. An implicature of an\nutterance that needn’t be carried by an utterance of a\ntruth-conditionally equivalent sentence is said to be\n“detachable” from the utterance (Grice 1975: 39). In\n section 2.1\n we saw that according to R.M. Hare the evaluative content of thick\nterms is detachable in this sense. But he doesn’t say whether he\nthinks that the evaluative contents of thick terms are conventional\nimplicatures. If the evaluations normally conveyed by T-utterances\nwere conventional implicatures (or semantic presuppositions, for that\nmatter), then thick terms would be inherently evaluative in meaning,\nbut not as a matter of truth-conditions. One problem for this view is\nthat conventional implicatures aren’t defeasible in the ways\nthat the evaluations normally conveyed by T-utterances seem to be:\n“Whether or not Shaq’s agility is unexpected given his\ntallness, Shaq is tall but agile” sounds very odd.\n\nA third way for utterances to communicate further information is\nconversational implicature. Imagine the following conversation at the\ncampus cafeteria:\n\n(10)\nA: Are you coming to Jack’s party?\n\nB: I have to work.\n\nConversational implicature: B can’t come to the\nparty.\n\n\nThe implicature doesn’t look like part of the truth-conditions\nof B’s utterance. All that B says is that she has\nto work. That doesn’t become false if B attends the party\nafter all. The implicature is conversational because A has to\nwork it out from B’s utterance by relying on contextual\nobservations and rules of cooperative communication, such as that\nB wouldn’t utter a sentence that isn’t directly\nrelevant to A’s question unless she was trying to convey\nsomething that is relevant, namely that she won’t be coming to\nthe party. (Grice 1975: 26–31.) Among writers on thick concepts,\nSimon Blackburn occasionally suggests that the evaluations normally\nconveyed by thick terms are conversational implicatures (Blackburn\n1992; his 1998 is harder to read this way; see also Zangwill 1995:\n322). But this view doesn’t explain the projection data above:\nconversational implicatures mostly don’t survive embedding under\nnegation, questions, and so on, except by coincidence. (If B\nhad said “I don’t have to work”, she wouldn’t\nhave implicated that she can’t come to the party.) The\nevaluations normally conveyed by T-utterances are also not as directly\ndeniable as conversational implicatures: “I have to work, but I\ndon’t mean to imply that I won’t be coming to the\nparty” sounds perfectly fine, unlike the similarly direct\ndenials in\n (1)\n and\n (2)\n above. Unlike most views on how thick terms convey evaluation, the\nconversational implicature view has also been tested empirically. In a\nstudy designed to test whether the evaluative aspects of thick\nconcepts are separable from their non-evaluative aspects, Willemsen\nand Reuter (2020) found evidence that the two aren’t separable\nin the way that conversational implicatures are separable from the\ncontents whose utterances generate those implicatures. Further\nempirical studies to test other semantic and pragmatic hypotheses\nabout the relationship between thick terms and evaluation would be a\nwelcome development in the debate. \n\nSo the conversational implicature view about the relationship between\nthick terms and evaluation cannot explain either set of the linguistic\ndata in\n section 4.1.\n The other two do better. Both presuppositions and conventional\nimplicatures project in ways suggested by\n (4a–d).\n These views also predict that\n (1)\n should sound odd: “I regret being a member of the communist\nparty and I never was a member” sounds close to contradictory,\nand so does “Shaq is tall but agile and his being agile\nisn’t unexpected given his tallness”. Pragmatic\npresuppositions in particular also promise to be defeasible in the\nways the evaluations normally conveyed by T-utterances may be taken to\nbe on the back of examples like\n (5)–(7).\n But there might be suitably weak notions of semantic presupposition\nthat also can claim this advantage. \n\nThe pragmatic view developed by Pekka Väyrynen identifies a type\nof pragmatic content that projects and is defeasible but needn’t\nreadily become mutually taken for granted by conversational\nparticipants to explain the evaluations normally conveyed by\nT-utterances. He proposes:\n\n\nNot-At-Issue View: Global evaluations are implications of\nT-utterances which are normally “not at issue” in their\nliteral uses in normal contexts, and which arise conversationally.\n(Väyrynen 2013: 122)\n\n\nWhen someone calls Rihanna’s show lewd, or Donald Trump’s\nstump speech unhinged, a negative evaluation is a generalized\nimplication of the utterance in the sense that it is part of the\nstandard or default interpretation of such utterances, not a one-off\noccurrence. Its generalized status is explained by social facts such\nas that it isn’t common in these parts to use chaste,\ncruel, generous, and so on, neutrally. It is common\nknowledge that those who use a given thick term for the most part\naccept certain evaluations and their utterances for the most part\naccurately reflect their acceptance of those evaluations. (Such social\nfacts may also help explain why thick terms seem more intimately\nconnected to evaluation than other non-evaluative terms that are often\nused evaluatively, such as chocolatey and athletic.)\nBut the implication is “not at issue” in the sense that\nthe evaluation is not the main point of her utterance but rather is\npart of the background that the speaker takes for granted (but\nneedn’t assume his audience to accept) in making the utterance.\nThe main point is to assert that the thing in question falls under the\nterm, against the background evaluation that things falling under the\nterm tend to be bad in a certain sort of way. Insofar as the presence\nof the evaluation can be explained conversationally, we can expect it\nto be open to be denied or suspended by objectors in the ways\nsuggested by the defeasibility data above. And a general feature of\nvarious kind of backgrounded contents is that they project in ways\nillustrated by\n (4a–d).\n (For more on this version of the Pragmatic View, see Väyrynen\n2013: chs. 5–6.)\n\nIf this kind of Pragmatic View is correct, thick concepts seem to lack\nthe broader significance that some have assigned to them. The\nevaluations normally conveyed by T-utterances will be separable from\nthick terms in whatever way pragmatic not-at-issue implications are in\ngeneral separable from the utterances that generate them. And if the\nconclusion that thick terms aren’t semantically evaluative shows\nthat there are no irreducibly evaluative thick concepts that we must\npossess in order to think about their subject matter, thick concepts\ncannot undermine the is-ought distinction, force us to\nrethink reflection and objectivity in ethics, or be conceptually or\nexplanatorily prior to or interdependent with thin concepts\n(Väyrynen 2013: ch. 10). However, the relationship between\nlanguage and concepts is vexed in this area, and may interfere with\nthe implications of Pragmatic Views for the significance of thick\nconcepts. (For discussion, see Väyrynen 2013: 44–51;\nZangwill 2013; Eklund forthcoming.) The overall plausibility of the\nPragmatic View depends on several further issues. One concerns its\nimplications regarding thin terms. For instance, if thin terms are\nalso open to being regarded as objectionable, then the behavior\nexhibited by objectionable thick terms in\n section 4.1\n above either supports a pragmatic view of thin terms as well or\ndoesn’t support the Pragmatic View of thick terms and concepts\n(Eklund forthcoming). Insofar as we are convinced that thin terms are\nsemantically evaluative, this result might be bad news for the\nPragmatic View. (But see Sundell 2016, who argues that thin aesthetic\nterms aren’t inherently evaluative in meaning, but merely used\nevaluatively.) This leads us to our last topic: how do thick and thin\nconcepts differ from one another?\n\nFor a summary of further comparisons between Semantic and Pragmatic\nViews, see\n section 3\n of the supplementary document\n “Additional Debates about Thick Concepts and Their Significance”.\n",
    "section_title": "4.2 Pragmatic Views",
    "entry_title": "Thick Ethical Concepts",
    "hierarchy_title": "Thick Ethical Concepts || The Location Question: How Are Thick Concepts Evaluative? || Pragmatic Views",
    "tokenized_text": [
        "location",
        "question",
        "thick",
        "concept",
        "evaluative",
        "pragmatic",
        "view",
        "pragmatic",
        "view",
        "understanding",
        "else",
        "thick",
        "term",
        "might",
        "related",
        "evaluation",
        "way",
        "truthconditions",
        "requires",
        "brief",
        "look",
        "utterance",
        "general",
        "communicate",
        "information",
        "part",
        "truthconditions",
        "linguist",
        "philosopher",
        "language",
        "identified",
        "several",
        "mechanism",
        "information",
        "transfer",
        "speaker",
        "communicate",
        "information",
        "proposition",
        "part",
        "truthconditions",
        "utterance",
        "information",
        "false",
        "usually",
        "thought",
        "make",
        "utterance",
        "false",
        "merely",
        "odd",
        "way",
        "mechanism",
        "operate",
        "feature",
        "besides",
        "truthconditions",
        "term",
        "may",
        "virtue",
        "linguistic",
        "convention",
        "others",
        "operate",
        "distinct",
        "conversational",
        "mechanism",
        "fuller",
        "discussion",
        "mechanism",
        "context",
        "thick",
        "term",
        "see",
        "väyrynen",
        "ch",
        "one",
        "way",
        "utterance",
        "communicate",
        "information",
        "presupposition",
        "regret",
        "member",
        "communist",
        "party",
        "presupposition",
        "member",
        "communist",
        "party",
        "exactly",
        "presupposition",
        "utterance",
        "related",
        "truthconditions",
        "complex",
        "topic",
        "perhaps",
        "utterance",
        "true",
        "even",
        "presupposition",
        "false",
        "regret",
        "something",
        "never",
        "either",
        "way",
        "linguist",
        "largely",
        "think",
        "presupposition",
        "part",
        "truthconditions",
        "utterance",
        "part",
        "common",
        "ground",
        "conversation",
        "among",
        "writer",
        "thick",
        "concept",
        "allan",
        "gibbard",
        "gopal",
        "sreenivasan",
        "speak",
        "evaluation",
        "conveyed",
        "tutterances",
        "presupposition",
        "without",
        "developing",
        "view",
        "detail",
        "gibbard",
        "sreenivasan",
        "detailed",
        "sophisticated",
        "development",
        "found",
        "cepollaro",
        "stojanovic",
        "cepollaro",
        "open",
        "question",
        "view",
        "whether",
        "relevant",
        "presupposition",
        "better",
        "understood",
        "pragmatically",
        "conveying",
        "speaker",
        "belief",
        "conversation",
        "common",
        "ground",
        "semantically",
        "something",
        "expression",
        "carry",
        "part",
        "meaning",
        "worry",
        "presuppositional",
        "view",
        "evaluation",
        "normally",
        "conveyed",
        "objectionable",
        "thick",
        "concept",
        "prospect",
        "added",
        "common",
        "ground",
        "conversation",
        "addressee",
        "find",
        "objectionable",
        "whereas",
        "presupposition",
        "already",
        "common",
        "ground",
        "expected",
        "added",
        "unless",
        "challenged",
        "resource",
        "addressing",
        "issue",
        "might",
        "however",
        "available",
        "complex",
        "subtle",
        "contemporary",
        "work",
        "presupposition",
        "linguistics",
        "cf",
        "cepollaro",
        "ch",
        "utterance",
        "communicate",
        "information",
        "way",
        "conventional",
        "implicature",
        "grice",
        "shaq",
        "tall",
        "agile",
        "conventional",
        "implicature",
        "shaq",
        "agility",
        "unexpected",
        "given",
        "tallness",
        "significant",
        "consensus",
        "shaq",
        "tall",
        "agile",
        "shaq",
        "tall",
        "agile",
        "true",
        "circumstance",
        "latter",
        "communicate",
        "contrast",
        "tallness",
        "agility",
        "implicated",
        "contrast",
        "proposition",
        "part",
        "truthconditions",
        "b",
        "utterance",
        "implicature",
        "widely",
        "regarded",
        "conventional",
        "contrast",
        "seems",
        "part",
        "standing",
        "meaning",
        "english",
        "speaker",
        "find",
        "difference",
        "communicate",
        "sense",
        "fully",
        "competent",
        "implicature",
        "utterance",
        "carried",
        "utterance",
        "truthconditionally",
        "equivalent",
        "sentence",
        "said",
        "detachable",
        "utterance",
        "grice",
        "section",
        "saw",
        "according",
        "rm",
        "hare",
        "evaluative",
        "content",
        "thick",
        "term",
        "detachable",
        "sense",
        "say",
        "whether",
        "think",
        "evaluative",
        "content",
        "thick",
        "term",
        "conventional",
        "implicatures",
        "evaluation",
        "normally",
        "conveyed",
        "tutterances",
        "conventional",
        "implicatures",
        "semantic",
        "presupposition",
        "matter",
        "thick",
        "term",
        "would",
        "inherently",
        "evaluative",
        "meaning",
        "matter",
        "truthconditions",
        "one",
        "problem",
        "view",
        "conventional",
        "implicatures",
        "defeasible",
        "way",
        "evaluation",
        "normally",
        "conveyed",
        "tutterances",
        "seem",
        "whether",
        "shaq",
        "agility",
        "unexpected",
        "given",
        "tallness",
        "shaq",
        "tall",
        "agile",
        "sound",
        "odd",
        "third",
        "way",
        "utterance",
        "communicate",
        "information",
        "conversational",
        "implicature",
        "imagine",
        "following",
        "conversation",
        "campus",
        "cafeteria",
        "coming",
        "jack",
        "party",
        "b",
        "work",
        "conversational",
        "implicature",
        "b",
        "come",
        "party",
        "implicature",
        "look",
        "like",
        "part",
        "truthconditions",
        "b",
        "utterance",
        "b",
        "say",
        "work",
        "become",
        "false",
        "b",
        "attends",
        "party",
        "implicature",
        "conversational",
        "work",
        "b",
        "utterance",
        "relying",
        "contextual",
        "observation",
        "rule",
        "cooperative",
        "communication",
        "b",
        "utter",
        "sentence",
        "directly",
        "relevant",
        "question",
        "unless",
        "trying",
        "convey",
        "something",
        "relevant",
        "namely",
        "coming",
        "party",
        "grice",
        "among",
        "writer",
        "thick",
        "concept",
        "simon",
        "blackburn",
        "occasionally",
        "suggests",
        "evaluation",
        "normally",
        "conveyed",
        "thick",
        "term",
        "conversational",
        "implicatures",
        "blackburn",
        "harder",
        "read",
        "way",
        "see",
        "also",
        "zangwill",
        "view",
        "explain",
        "projection",
        "data",
        "conversational",
        "implicatures",
        "mostly",
        "survive",
        "embedding",
        "negation",
        "question",
        "except",
        "coincidence",
        "b",
        "said",
        "work",
        "implicated",
        "come",
        "party",
        "evaluation",
        "normally",
        "conveyed",
        "tutterances",
        "also",
        "directly",
        "deniable",
        "conversational",
        "implicatures",
        "work",
        "mean",
        "imply",
        "coming",
        "party",
        "sound",
        "perfectly",
        "fine",
        "unlike",
        "similarly",
        "direct",
        "denial",
        "unlike",
        "view",
        "thick",
        "term",
        "convey",
        "evaluation",
        "conversational",
        "implicature",
        "view",
        "also",
        "tested",
        "empirically",
        "study",
        "designed",
        "test",
        "whether",
        "evaluative",
        "aspect",
        "thick",
        "concept",
        "separable",
        "nonevaluative",
        "aspect",
        "willemsen",
        "reuter",
        "found",
        "evidence",
        "two",
        "separable",
        "way",
        "conversational",
        "implicatures",
        "separable",
        "content",
        "whose",
        "utterance",
        "generate",
        "implicatures",
        "empirical",
        "study",
        "test",
        "semantic",
        "pragmatic",
        "hypothesis",
        "relationship",
        "thick",
        "term",
        "evaluation",
        "would",
        "welcome",
        "development",
        "debate",
        "conversational",
        "implicature",
        "view",
        "relationship",
        "thick",
        "term",
        "evaluation",
        "explain",
        "either",
        "set",
        "linguistic",
        "data",
        "section",
        "two",
        "better",
        "presupposition",
        "conventional",
        "implicatures",
        "project",
        "way",
        "suggested",
        "ad",
        "view",
        "also",
        "predict",
        "sound",
        "odd",
        "regret",
        "member",
        "communist",
        "party",
        "never",
        "member",
        "sound",
        "close",
        "contradictory",
        "shaq",
        "tall",
        "agile",
        "agile",
        "unexpected",
        "given",
        "tallness",
        "pragmatic",
        "presupposition",
        "particular",
        "also",
        "promise",
        "defeasible",
        "way",
        "evaluation",
        "normally",
        "conveyed",
        "tutterances",
        "may",
        "taken",
        "back",
        "example",
        "like",
        "might",
        "suitably",
        "weak",
        "notion",
        "semantic",
        "presupposition",
        "also",
        "claim",
        "advantage",
        "pragmatic",
        "view",
        "developed",
        "pekka",
        "väyrynen",
        "identifies",
        "type",
        "pragmatic",
        "content",
        "project",
        "defeasible",
        "readily",
        "become",
        "mutually",
        "taken",
        "granted",
        "conversational",
        "participant",
        "explain",
        "evaluation",
        "normally",
        "conveyed",
        "tutterances",
        "proposes",
        "notatissue",
        "view",
        "global",
        "evaluation",
        "implication",
        "tutterances",
        "normally",
        "issue",
        "literal",
        "us",
        "normal",
        "context",
        "arise",
        "conversationally",
        "väyrynen",
        "someone",
        "call",
        "rihanna",
        "show",
        "lewd",
        "donald",
        "trump",
        "stump",
        "speech",
        "unhinged",
        "negative",
        "evaluation",
        "generalized",
        "implication",
        "utterance",
        "sense",
        "part",
        "standard",
        "default",
        "interpretation",
        "utterance",
        "oneoff",
        "occurrence",
        "generalized",
        "status",
        "explained",
        "social",
        "fact",
        "common",
        "part",
        "use",
        "chaste",
        "cruel",
        "generous",
        "neutrally",
        "common",
        "knowledge",
        "use",
        "given",
        "thick",
        "term",
        "part",
        "accept",
        "certain",
        "evaluation",
        "utterance",
        "part",
        "accurately",
        "reflect",
        "acceptance",
        "evaluation",
        "social",
        "fact",
        "may",
        "also",
        "help",
        "explain",
        "thick",
        "term",
        "seem",
        "intimately",
        "connected",
        "evaluation",
        "nonevaluative",
        "term",
        "often",
        "used",
        "evaluatively",
        "chocolatey",
        "athletic",
        "implication",
        "issue",
        "sense",
        "evaluation",
        "main",
        "point",
        "utterance",
        "rather",
        "part",
        "background",
        "speaker",
        "take",
        "granted",
        "assume",
        "audience",
        "accept",
        "making",
        "utterance",
        "main",
        "point",
        "assert",
        "thing",
        "question",
        "fall",
        "term",
        "background",
        "evaluation",
        "thing",
        "falling",
        "term",
        "tend",
        "bad",
        "certain",
        "sort",
        "way",
        "insofar",
        "presence",
        "evaluation",
        "explained",
        "conversationally",
        "expect",
        "open",
        "denied",
        "suspended",
        "objector",
        "way",
        "suggested",
        "defeasibility",
        "data",
        "general",
        "feature",
        "various",
        "kind",
        "backgrounded",
        "content",
        "project",
        "way",
        "illustrated",
        "ad",
        "version",
        "pragmatic",
        "view",
        "see",
        "väyrynen",
        "chs",
        "kind",
        "pragmatic",
        "view",
        "correct",
        "thick",
        "concept",
        "seem",
        "lack",
        "broader",
        "significance",
        "assigned",
        "evaluation",
        "normally",
        "conveyed",
        "tutterances",
        "separable",
        "thick",
        "term",
        "whatever",
        "way",
        "pragmatic",
        "notatissue",
        "implication",
        "general",
        "separable",
        "utterance",
        "generate",
        "conclusion",
        "thick",
        "term",
        "semantically",
        "evaluative",
        "show",
        "irreducibly",
        "evaluative",
        "thick",
        "concept",
        "must",
        "posse",
        "order",
        "think",
        "subject",
        "matter",
        "thick",
        "concept",
        "undermine",
        "isought",
        "distinction",
        "force",
        "u",
        "rethink",
        "reflection",
        "objectivity",
        "ethic",
        "conceptually",
        "explanatorily",
        "prior",
        "interdependent",
        "thin",
        "concept",
        "väyrynen",
        "ch",
        "however",
        "relationship",
        "language",
        "concept",
        "vexed",
        "area",
        "may",
        "interfere",
        "implication",
        "pragmatic",
        "view",
        "significance",
        "thick",
        "concept",
        "discussion",
        "see",
        "väyrynen",
        "zangwill",
        "eklund",
        "forthcoming",
        "overall",
        "plausibility",
        "pragmatic",
        "view",
        "depends",
        "several",
        "issue",
        "one",
        "concern",
        "implication",
        "regarding",
        "thin",
        "term",
        "instance",
        "thin",
        "term",
        "also",
        "open",
        "regarded",
        "objectionable",
        "behavior",
        "exhibited",
        "objectionable",
        "thick",
        "term",
        "section",
        "either",
        "support",
        "pragmatic",
        "view",
        "thin",
        "term",
        "well",
        "support",
        "pragmatic",
        "view",
        "thick",
        "term",
        "concept",
        "eklund",
        "forthcoming",
        "insofar",
        "convinced",
        "thin",
        "term",
        "semantically",
        "evaluative",
        "result",
        "might",
        "bad",
        "news",
        "pragmatic",
        "view",
        "see",
        "sundell",
        "argues",
        "thin",
        "aesthetic",
        "term",
        "inherently",
        "evaluative",
        "meaning",
        "merely",
        "used",
        "evaluatively",
        "lead",
        "u",
        "last",
        "topic",
        "thick",
        "thin",
        "concept",
        "differ",
        "one",
        "another",
        "summary",
        "comparison",
        "semantic",
        "pragmatic",
        "view",
        "see",
        "section",
        "supplementary",
        "document",
        "additional",
        "debate",
        "thick",
        "concept",
        "significance"
    ]
}