{
    "main_text": "Life and Career\n1. Life and Career\nThomas Kuhn’s academic life started in physics. He then switched to\nhistory of science, and as his career developed he moved over to\nphilosophy of science, although retaining a strong interest in the\nhistory of physics. In 1943, he graduated from Harvard summa cum\nlaude. Thereafter he spent the remainder of the war years in\nresearch related to radar at Harvard and then in Europe. He gained his\nmaster’s degree in physics in 1946, and his doctorate in 1949, also in\nphysics (concerning an application of quantum mechanics to solid state\nphysics). Kuhn was elected to the prestigious Society of Fellows at\nHarvard, another of whose members was W. V. Quine. At this time, and\nuntil 1956, Kuhn taught a class in science for undergraduates in the\nhumanities, as part of the General Education in Science curriculum,\ndeveloped by James B. Conant, the President of Harvard. This course\nwas centred around historical case studies, and this was Kuhn’s first\nopportunity to study historical scientific texts in detail. His\ninitial bewilderment on reading the scientific work of Aristotle was a\nformative experience, followed as it was by a more or less sudden\nability to understand Aristotle properly, undistorted by knowledge of\nsubsequent science. \n This led Kuhn to concentrate on history of science and in due\ncourse he was appointed to an assistant professorship in general\neducation and the history of science. During this period his work\nfocussed on eighteenth century matter theory and the early history of\nthermodynamics. Kuhn then turned to the history of astronomy, and in\n1957 he published his first book, The Copernican\nRevolution.\n In 1961 Kuhn became a full professor at the University of\nCalifornia at Berkeley, having moved there in 1956 to take up a post\nin history of science, but in the philosophy department. This enabled\nhim to develop his interest in the philosophy of science. At Berkeley\nKuhn’s colleagues included Stanley Cavell, who introduced Kuhn to the\nworks of Wittgenstein, and Paul Feyerabend. With Feyerabend Kuhn\ndiscussed a draft of The Structure of Scientific Revolutions\nwhich was published in 1962 in the series “International\nEncyclopedia of Unified Science”, edited by Otto Neurath and\nRudolf Carnap. The central idea of this extraordinarily\ninfluential—and controversial—book is that the development\nof science is driven, in normal periods of science, by adherence to\nwhat Kuhn called a ‘paradigm’. The functions of a paradigm\nare to supply puzzles for scientists to solve and to provide the tools\nfor their solution. A crisis in science arises when confidence is lost\nin the ability of the paradigm to solve particularly worrying puzzles\ncalled ‘anomalies’. Crisis is followed by a scientific\nrevolution if the existing paradigm is superseded by a rival. Kuhn\nclaimed that science guided by one paradigm would be\n‘incommensurable’ with science developed under a different\nparadigm, by which is meant that there is no common measure for\nassessing the different scientific theories. This thesis of\nincommensurability, developed at the same time by Feyerabend, rules\nout certain kinds of comparison of the two theories and consequently\nrejects some traditional views of scientific development, such as the\nview that later science builds on the knowledge contained within\nearlier theories, or the view that later theories are closer\napproximations to the truth than earlier theories. Most of Kuhn’s\nsubsequent work in philosophy was spent in articulating and developing\nthe ideas in The Structure of Scientific Revolutions,\nalthough some of these, such as the thesis of incommensurability,\nunderwent transformation in the process.\nAccording to Kuhn himself (2000, 307), The Structure of\nScientific Revolutions first aroused interest among social\nscientists, although it did in due course create the interest among\nphilosophers that Kuhn had intended (and also before long among a much\nwider academic and general audience). While acknowledging the\nimportance of Kuhn’s ideas, the philosophical reception was\nnonetheless hostile. For example, Dudley Shapere’s review (1964)\nemphasized the relativist implications of Kuhn’s ideas, and this set\nthe context for much subsequent philosophical discussion. Since the\nfollowing of rules (of logic, of scientific method, etc.) was regarded\nas the sine qua non of rationality, Kuhn’s claim that\nscientists do not employ rules in reaching their decisions appeared\ntantamount to the claim that science is irrational. This was\nhighlighted by his rejection of the distinction between discovery and\njustification (denying that we can distinguish between the\npsychological process of thinking up an idea and the logical process\nof justifying its claim to truth) and his emphasis on\nincommensurability (the claim that certain kinds of comparison between\ntheories are impossible). The negative response among philosophers was\nexacerbated by an important naturalistic tendency in The Structure\nof Scientific Revolutions that was then unfamiliar. A\nparticularly significant instance of this was Kuhn’s insistence on the\nimportance of the history of science for philosophy of science. The\nopening sentence of the book reads: “History, if viewed as a\nrepository for more than anecdote or chronology, could produce a\ndecisive transformation in the image of science by which we are now\npossessed” (1962/1970, 1). Also significant and unfamiliar was\nKuhn’s appeal to psychological literature and examples (such as\nlinking theory-change with the changing appearance of a Gestalt\nimage).\nIn 1964 Kuhn left Berkeley to take up the position of M. Taylor\nPyne Professor of Philosophy and History of Science at Princeton\nUniversity. In the following year an important event took place which\nhelped promote Kuhn’s profile further among philosophers. An\nInternational Colloquium in the Philosophy of Science was held at\nBedford College, London.  One of the key events of the Colloquium was\nintended to be a debate between Kuhn and Feyerabend, with Feyerabend\npromoting the critical rationalism that he shared with Popper. As it\nwas, Feyerabend was ill and unable to attend, and the papers delivered\nfocussed on Kuhn’s work. John Watkins took Feyerabend’s place in a\nsession chaired by Popper. The ensuing discussion, to which Popper and\nalso Margaret Masterman and Stephen Toulmin contributed, compared and\ncontrasted the viewpoints of Kuhn and Popper and thereby helped\nilluminate the significance of Kuhn’s approach. Papers from these\ndiscussants along with contributions from Feyerabend and Lakatos, were\npublished several years later, in Criticism and the Growth of\nKnowledge, edited by Lakatos and Alan Musgrave (1970) (the fourth\nvolume of proceedings from this Colloquium). In the same year the\nsecond edition of The Structure of Scientific Revolutions was\npublished, including an important postscript in which Kuhn clarified\nhis notion of paradigm.  This was in part in response to Masterman’s\n(1970) criticism that Kuhn had used ‘paradigm’ in a wide\nvariety of ways; in addition, Kuhn felt that critics had failed to\nappreciate the emphasis he placed upon the idea of a paradigm as\nan exemplar or model of puzzle-solving.  Kuhn also, for the\nfirst time, explicitly gave his work an anti-realist element by\ndenying the coherence of the idea that theories could be regarded as\nmore or less close to the truth.\nA collection of Kuhn’s essays in the philosophy and history of\nscience was published in 1977, with the title The Essential\nTension taken from one of Kuhn’s earliest essays in which he\nemphasizes the importance of tradition in science. The following year\nsaw the publication of his second historical monograph Black-Body\nTheory and the Quantum Discontinuity, concerning the early\nhistory of quantum mechanics. In 1983 he was named Laurence\nS. Rockefeller Professor of Philosophy at MIT. Kuhn continued\nthroughout the 1980s and 1990s to work on a variety of topics in both\nhistory and philosophy of science, including the development of the\nconcept of incommensurability, and at the time of his death in 1996 he\nwas working on a second philosophical monograph dealing with, among\nother matters, an evolutionary conception of scientific change and\nconcept acquisition in developmental psychology.\n",
    "section_title": "1. Life and Career",
    "entry_title": "Thomas Kuhn",
    "hierarchy_title": "Thomas Kuhn || Life and Career",
    "tokenized_text": [
        "life",
        "career",
        "life",
        "career",
        "thomas",
        "kuhn",
        "academic",
        "life",
        "started",
        "physic",
        "switched",
        "history",
        "science",
        "career",
        "developed",
        "moved",
        "philosophy",
        "science",
        "although",
        "retaining",
        "strong",
        "interest",
        "history",
        "physic",
        "graduated",
        "harvard",
        "summa",
        "cum",
        "laude",
        "thereafter",
        "spent",
        "remainder",
        "war",
        "year",
        "research",
        "related",
        "radar",
        "harvard",
        "europe",
        "gained",
        "master",
        "degree",
        "physic",
        "doctorate",
        "also",
        "physic",
        "concerning",
        "application",
        "quantum",
        "mechanic",
        "solid",
        "state",
        "physic",
        "kuhn",
        "elected",
        "prestigious",
        "society",
        "fellow",
        "harvard",
        "another",
        "whose",
        "member",
        "w",
        "v",
        "quine",
        "time",
        "kuhn",
        "taught",
        "class",
        "science",
        "undergraduate",
        "humanity",
        "part",
        "general",
        "education",
        "science",
        "curriculum",
        "developed",
        "james",
        "b",
        "conant",
        "president",
        "harvard",
        "course",
        "centred",
        "around",
        "historical",
        "case",
        "study",
        "kuhn",
        "first",
        "opportunity",
        "study",
        "historical",
        "scientific",
        "text",
        "detail",
        "initial",
        "bewilderment",
        "reading",
        "scientific",
        "work",
        "aristotle",
        "formative",
        "experience",
        "followed",
        "le",
        "sudden",
        "ability",
        "understand",
        "aristotle",
        "properly",
        "undistorted",
        "knowledge",
        "subsequent",
        "science",
        "led",
        "kuhn",
        "concentrate",
        "history",
        "science",
        "due",
        "course",
        "appointed",
        "assistant",
        "professorship",
        "general",
        "education",
        "history",
        "science",
        "period",
        "work",
        "focussed",
        "eighteenth",
        "century",
        "matter",
        "theory",
        "early",
        "history",
        "thermodynamics",
        "kuhn",
        "turned",
        "history",
        "astronomy",
        "published",
        "first",
        "book",
        "copernican",
        "revolution",
        "kuhn",
        "became",
        "full",
        "professor",
        "university",
        "california",
        "berkeley",
        "moved",
        "take",
        "post",
        "history",
        "science",
        "philosophy",
        "department",
        "enabled",
        "develop",
        "interest",
        "philosophy",
        "science",
        "berkeley",
        "kuhn",
        "colleague",
        "included",
        "stanley",
        "cavell",
        "introduced",
        "kuhn",
        "work",
        "wittgenstein",
        "paul",
        "feyerabend",
        "feyerabend",
        "kuhn",
        "discussed",
        "draft",
        "structure",
        "scientific",
        "revolution",
        "published",
        "series",
        "international",
        "encyclopedia",
        "unified",
        "science",
        "edited",
        "otto",
        "neurath",
        "rudolf",
        "carnap",
        "central",
        "idea",
        "extraordinarily",
        "influentialand",
        "controversialbook",
        "development",
        "science",
        "driven",
        "normal",
        "period",
        "science",
        "adherence",
        "kuhn",
        "called",
        "paradigm",
        "function",
        "paradigm",
        "supply",
        "puzzle",
        "scientist",
        "solve",
        "provide",
        "tool",
        "solution",
        "crisis",
        "science",
        "arises",
        "confidence",
        "lost",
        "ability",
        "paradigm",
        "solve",
        "particularly",
        "worrying",
        "puzzle",
        "called",
        "anomaly",
        "crisis",
        "followed",
        "scientific",
        "revolution",
        "existing",
        "paradigm",
        "superseded",
        "rival",
        "kuhn",
        "claimed",
        "science",
        "guided",
        "one",
        "paradigm",
        "would",
        "incommensurable",
        "science",
        "developed",
        "different",
        "paradigm",
        "meant",
        "common",
        "measure",
        "assessing",
        "different",
        "scientific",
        "theory",
        "thesis",
        "incommensurability",
        "developed",
        "time",
        "feyerabend",
        "rule",
        "certain",
        "kind",
        "comparison",
        "two",
        "theory",
        "consequently",
        "reject",
        "traditional",
        "view",
        "scientific",
        "development",
        "view",
        "later",
        "science",
        "build",
        "knowledge",
        "contained",
        "within",
        "earlier",
        "theory",
        "view",
        "later",
        "theory",
        "closer",
        "approximation",
        "truth",
        "earlier",
        "theory",
        "kuhn",
        "subsequent",
        "work",
        "philosophy",
        "spent",
        "articulating",
        "developing",
        "idea",
        "structure",
        "scientific",
        "revolution",
        "although",
        "thesis",
        "incommensurability",
        "underwent",
        "transformation",
        "process",
        "according",
        "kuhn",
        "structure",
        "scientific",
        "revolution",
        "first",
        "aroused",
        "interest",
        "among",
        "social",
        "scientist",
        "although",
        "due",
        "course",
        "create",
        "interest",
        "among",
        "philosopher",
        "kuhn",
        "intended",
        "also",
        "long",
        "among",
        "much",
        "wider",
        "academic",
        "general",
        "audience",
        "acknowledging",
        "importance",
        "kuhn",
        "idea",
        "philosophical",
        "reception",
        "nonetheless",
        "hostile",
        "example",
        "dudley",
        "shapere",
        "review",
        "emphasized",
        "relativist",
        "implication",
        "kuhn",
        "idea",
        "set",
        "context",
        "much",
        "subsequent",
        "philosophical",
        "discussion",
        "since",
        "following",
        "rule",
        "logic",
        "scientific",
        "method",
        "etc",
        "regarded",
        "sine",
        "qua",
        "non",
        "rationality",
        "kuhn",
        "claim",
        "scientist",
        "employ",
        "rule",
        "reaching",
        "decision",
        "appeared",
        "tantamount",
        "claim",
        "science",
        "irrational",
        "highlighted",
        "rejection",
        "distinction",
        "discovery",
        "justification",
        "denying",
        "distinguish",
        "psychological",
        "process",
        "thinking",
        "idea",
        "logical",
        "process",
        "justifying",
        "claim",
        "truth",
        "emphasis",
        "incommensurability",
        "claim",
        "certain",
        "kind",
        "comparison",
        "theory",
        "impossible",
        "negative",
        "response",
        "among",
        "philosopher",
        "exacerbated",
        "important",
        "naturalistic",
        "tendency",
        "structure",
        "scientific",
        "revolution",
        "unfamiliar",
        "particularly",
        "significant",
        "instance",
        "kuhn",
        "insistence",
        "importance",
        "history",
        "science",
        "philosophy",
        "science",
        "opening",
        "sentence",
        "book",
        "read",
        "history",
        "viewed",
        "repository",
        "anecdote",
        "chronology",
        "could",
        "produce",
        "decisive",
        "transformation",
        "image",
        "science",
        "possessed",
        "also",
        "significant",
        "unfamiliar",
        "kuhn",
        "appeal",
        "psychological",
        "literature",
        "example",
        "linking",
        "theorychange",
        "changing",
        "appearance",
        "gestalt",
        "image",
        "kuhn",
        "left",
        "berkeley",
        "take",
        "position",
        "m",
        "taylor",
        "pyne",
        "professor",
        "philosophy",
        "history",
        "science",
        "princeton",
        "university",
        "following",
        "year",
        "important",
        "event",
        "took",
        "place",
        "helped",
        "promote",
        "kuhn",
        "profile",
        "among",
        "philosopher",
        "international",
        "colloquium",
        "philosophy",
        "science",
        "held",
        "bedford",
        "college",
        "london",
        "one",
        "key",
        "event",
        "colloquium",
        "intended",
        "debate",
        "kuhn",
        "feyerabend",
        "feyerabend",
        "promoting",
        "critical",
        "rationalism",
        "shared",
        "popper",
        "feyerabend",
        "ill",
        "unable",
        "attend",
        "paper",
        "delivered",
        "focussed",
        "kuhn",
        "work",
        "john",
        "watkins",
        "took",
        "feyerabend",
        "place",
        "session",
        "chaired",
        "popper",
        "ensuing",
        "discussion",
        "popper",
        "also",
        "margaret",
        "masterman",
        "stephen",
        "toulmin",
        "contributed",
        "compared",
        "contrasted",
        "viewpoint",
        "kuhn",
        "popper",
        "thereby",
        "helped",
        "illuminate",
        "significance",
        "kuhn",
        "approach",
        "paper",
        "discussant",
        "along",
        "contribution",
        "feyerabend",
        "lakatos",
        "published",
        "several",
        "year",
        "later",
        "criticism",
        "growth",
        "knowledge",
        "edited",
        "lakatos",
        "alan",
        "musgrave",
        "fourth",
        "volume",
        "proceeding",
        "colloquium",
        "year",
        "second",
        "edition",
        "structure",
        "scientific",
        "revolution",
        "published",
        "including",
        "important",
        "postscript",
        "kuhn",
        "clarified",
        "notion",
        "paradigm",
        "part",
        "response",
        "masterman",
        "criticism",
        "kuhn",
        "used",
        "paradigm",
        "wide",
        "variety",
        "way",
        "addition",
        "kuhn",
        "felt",
        "critic",
        "failed",
        "appreciate",
        "emphasis",
        "placed",
        "upon",
        "idea",
        "paradigm",
        "exemplar",
        "model",
        "puzzlesolving",
        "kuhn",
        "also",
        "first",
        "time",
        "explicitly",
        "gave",
        "work",
        "antirealist",
        "element",
        "denying",
        "coherence",
        "idea",
        "theory",
        "could",
        "regarded",
        "le",
        "close",
        "truth",
        "collection",
        "kuhn",
        "essay",
        "philosophy",
        "history",
        "science",
        "published",
        "title",
        "essential",
        "tension",
        "taken",
        "one",
        "kuhn",
        "earliest",
        "essay",
        "emphasizes",
        "importance",
        "tradition",
        "science",
        "following",
        "year",
        "saw",
        "publication",
        "second",
        "historical",
        "monograph",
        "blackbody",
        "theory",
        "quantum",
        "discontinuity",
        "concerning",
        "early",
        "history",
        "quantum",
        "mechanic",
        "named",
        "laurence",
        "s",
        "rockefeller",
        "professor",
        "philosophy",
        "mit",
        "kuhn",
        "continued",
        "throughout",
        "s",
        "s",
        "work",
        "variety",
        "topic",
        "history",
        "philosophy",
        "science",
        "including",
        "development",
        "concept",
        "incommensurability",
        "time",
        "death",
        "working",
        "second",
        "philosophical",
        "monograph",
        "dealing",
        "among",
        "matter",
        "evolutionary",
        "conception",
        "scientific",
        "change",
        "concept",
        "acquisition",
        "developmental",
        "psychology"
    ]
}