{
    "main_text": "Nature and Human Existence\n2. Nature and Human Existence\n\nIn his essay “Nature,” Emerson asserts that there can be\nfound in the natural world “a sanctity which shames our\nreligions.” Thoreau would agree completely with this statement.\nBut in the same essay Emerson also inclines toward Platonism, stating\nthat nature is “emblematic” of higher truths, and\nsuggesting that the material world has value by virtue of being a\nsubsidiary product of mental reality: each natural object is therefore\n“a symbol of some spiritual fact.” For the most part,\nThoreau recoils from the idea that we could find some kind of higher\nreality by looking beyond nature: in the “Friday” chapter\nof A Week on the Concord and Merrimack Rivers, he asks:\n“Is not Nature, rightly read, that of which she is commonly\ntaken to be the symbol merely?” As he sees it, the realm of\nspirit is the physical world, which has a sacred meaning that\ncan be directly perceived. Accordingly, he seeks “to be always\non the alert to find God in nature” (Journal, 9/7/51),\nand to hear “the language which all things and events speak\nwithout metaphor” (Walden, IV). Thoreau’s\nmetaphysical convictions compel him to “defend nature’s\nintrinsic value,” in a way that situates him philosophically in\na place “far removed from Emerson and most\ntranscendentalists” (Cafaro 2004, 132–133). In his\njournal, Thoreau reports that his goal is to “state facts”\nin such a way that “they shall be significant,” rather\nthan allowing himself to be blind to “the significance of\nphenomena” (Journal, 11/9/51 & 8/5/51). Evidently,\nhe does not accept that whatever we register through our aesthetic and\nemotional responses ought to be viewed as unreal. Indeed, Thoreau\nwould argue that the person who is seldom moved by the beauty of\nthings is the one with an inadequate conception of reality, since it\nis the neutral observer who is less well aware of the world as it is.\nAnd he exhorts us to unclutter and simplify our lives, by eliminating\nthe supposed necessities that can entrap us when we mistakenly\nconstrue them as essential (see Hunt, 2020).\n\nTo say that nature is inherently significant is to say that natural\nfacts are neither inert nor value-free. Thoreau urges his reader not\nto “underrate the value of a fact,” since each concrete\ndetail of the world may contain a meaningful truth (“Natural\nHistory of Massachusetts”). Note the phrase: the value of a\nfact. Thoreau does not introduce an artificial distinction\nbetween facts and values, or between primary and secondary qualities.\nWhen we perceive sights, sounds, and textures, we are not standing as\ndisembodied consciousness apart from a world of inanimate mechanisms;\nrather, we are sentient beings immersed in the sensory world, learning\nthe “essential facts of life” only through “the\nperpetual instilling and drenching of the reality that surrounds\nus” (Walden, II). The philosopher who seeks knowledge\nthrough experience should therefore not be surprised to discover\nbeauty and order in natural phenomena. However, these properties are\nnot projected onto nature from an external perspective—rather,\nthey emerge from within the self-maintaining processes of organic\nlife. And the entire environment, the “living earth”\nitself, has something like a life of its own, one which may be going\nwell or badly, containing but not reducible to the biotic existence of\nanimals and plants (Walden, XVII). This is what he elsewhere\ndescribes as the “slumbering subterranean fire in nature which\nnever goes out” (“A Winter Walk”).\n\nThoreau remarks upon the “much grander significance” of\nany natural phenomenon “when not referred to man and his needs\nbut viewed absolutely” (Journal, 11/10/51). The world\nis rich with value that is not of our making, and “whatever we\nhave perceived to be in the slightest degree beautiful is of\ninfinitely more value to us than what we have only as yet discovered\nto be useful and to serve our purpose” (Faith in a\nSeed, 144). It is when we are not guilty of imposing our own\npurposes onto the world that we are able to view it on its own terms.\nOne of the things we then discover is that we are involved in a\npluralistic universe, containing many different points of view other\nthan our own. And when we begin to realize “the infinite extent\nof our relations” (Walden, VIII), we can see that even\nwhat does not at first seem to be good for us may have some\npositive value when considered from a broader perspective. Rather than\ndismissing squirrels as rodents, for instance, we should see them as\n“planters of forests,” and be grateful for the role they\nplay in the distribution of seeds (Journal, 10/22/60).\nLikewise, the “gentle rain which waters my beans and keeps me in\nthe house to-day is not drear and melancholy, but good for me too.\nThough it prevents my hoeing them, it is of far more worth than my\nhoeing. If it should continue so long as to cause the seeds to rot in\nthe ground and destroy the potatoes in the low lands, it would still\nbe good for the grass on the uplands, and, being good for the grass,\nit would be good for me” (Walden, V). Our limited view\noften keeps us from appreciating the harmonious interdependence of all\nparts of the natural world: this is not due to “any confusion or\nirregularity in Nature,” but because of our own incomplete\nknowledge (Walden, XVI). Thoreau declares that he would be\nhappy “if all the meadows on the earth were left in a wild\nstate,” since in tampering with nature we know not what we do\nand sometimes end up doing harm as a result (Walden, X). In\nmany cases we find that “unhandselled nature is worth more even\nby our modes of valuation than our improvements are”\n(Journal, 11/10/60).\n\nIn nature we have access to real value, which can be used as a\nstandard against which to measure our conventional evaluations. An\nexample of the latter is the value that is “arbitrarily\nattached” to gold, which has nothing to do with its\n“intrinsic beauty or value” (Journal, 10/13/60).\nSo it is a mistake to rush to California “as if the true gold\nwere to be found in that direction,” when one has failed to\nappreciate the inherent worth of one’s native soil\n(Journal, 10/18/55). In the economy of nature, a seed is more\nprecious than a diamond, for it contains “the principle of\ngrowth, or life,” and has the ability to become a specific plant\nor tree (Journal, 3/22/61). The seed not only provides\nevidence that nature is filled with “creative genius”\n(Journal, 1/5/56), but it also reminds us that a spark of\ndivinity is present in each human being as well. One of\nThoreau’s favorite analogies—not only a metaphor, as he\nsees it—is that between the ripening of a seed and the\ndevelopment of human potential. “The finest qualities of our\nnature, like the bloom on fruits, can be preserved only by the most\ndelicate handling” (Walden, I). What he calls\n“wildness” is not located only in the nonhuman world; the\nsame creative force is also active in human nature, so that even a\nliterary work of art can reasonably be praised as a manifestation of\nwildness (see “Walking”; Walden, I). There is\n“a perfect analogy between the life of the human being and that\nof the vegetable” (Journal, 5/20/51), and thoughts\n“spring in man’s brain” in just the same way that\n“a plant springs and grows by its own vitality”\n(Journal, 11/8/50; 4/3/58). Thoreau’s exhortations to\nfollow the promptings of one’s genius are based on the idea that\nby obeying our own wild nature we are aligning ourselves with a sacred\npower. What inspires us to realize our highest potential is “the\nprimitive vigor of Nature in us” (Journal, 8/30/56),\nand this influence is something we are able neither to predict nor to\ncomprehend: as he describes it in the “Ktaadn” chapter of\nThe Maine Woods, nature is “primeval, untamed, and\nforever untamable,” a godlike force but not always a kind\none.\n\nAt one point in Walden, Thoreau quips that he\nusually does not count himself among the “true\nidealists” who are inclined to reject “the evidence of\n[their] senses” (Walden, XIV). On the other hand, he\nscorns the sort of materialism that fails to penetrate the inner\nmystery of things, discovering “nothing but surface” in\nits mechanistic observations (Journal, 3/7/59). Instead, he\nargues that we must approach the world as “nature looking into\nnature,” aware of the relation between the form of our own\nperception and what we are able to perceive (Correspondence,\n7/21/41). There are reasons for classifying Thoreau as both a\nnaturalist and a romantic, although both of these categories are\nperhaps too broad to be very helpful. His conception of nature is\ninformed by a syncretic appropriation of Greek, Asian, and other\nsources, and the result is an eclectic vision that is uniquely his\nown. For this reason it is difficult to situate Thoreau within the\nhistory of modern philosophy, but one plausible way of doing so would\nbe to describe him as articulating a version of transcendental\nidealism. If Thoreau is indeed “the American heir to\nKant’s critical philosophy,” as he has been called\n(Oelschlaeger 1991, 136), it is because his investigation of\n“the relation between the subject of knowledge and its\nobject” builds upon a Kantian insight (see Cavell 1992,\n94–95). Yet in order to understand why this might be an accurate\ncategorization, we must proceed from Thoreau’s metaphysics to\nhis epistemology.\n",
    "section_title": "2. Nature and Human Existence",
    "entry_title": "Henry David Thoreau",
    "hierarchy_title": "Henry David Thoreau || Nature and Human Existence",
    "tokenized_text": [
        "nature",
        "human",
        "existence",
        "nature",
        "human",
        "existence",
        "essay",
        "nature",
        "emerson",
        "asserts",
        "found",
        "natural",
        "world",
        "sanctity",
        "shame",
        "religions",
        "thoreau",
        "would",
        "agree",
        "completely",
        "statement",
        "essay",
        "emerson",
        "also",
        "incline",
        "toward",
        "platonism",
        "stating",
        "nature",
        "emblematic",
        "higher",
        "truth",
        "suggesting",
        "material",
        "world",
        "value",
        "virtue",
        "subsidiary",
        "product",
        "mental",
        "reality",
        "natural",
        "object",
        "therefore",
        "symbol",
        "spiritual",
        "fact",
        "part",
        "thoreau",
        "recoil",
        "idea",
        "could",
        "find",
        "kind",
        "higher",
        "reality",
        "looking",
        "beyond",
        "nature",
        "friday",
        "chapter",
        "week",
        "concord",
        "merrimack",
        "river",
        "asks",
        "nature",
        "rightly",
        "read",
        "commonly",
        "taken",
        "symbol",
        "merely",
        "see",
        "realm",
        "spirit",
        "physical",
        "world",
        "sacred",
        "meaning",
        "directly",
        "perceived",
        "accordingly",
        "seek",
        "always",
        "alert",
        "find",
        "god",
        "nature",
        "journal",
        "hear",
        "language",
        "thing",
        "event",
        "speak",
        "without",
        "metaphor",
        "walden",
        "iv",
        "thoreau",
        "metaphysical",
        "conviction",
        "compel",
        "defend",
        "nature",
        "intrinsic",
        "value",
        "way",
        "situates",
        "philosophically",
        "place",
        "far",
        "removed",
        "emerson",
        "transcendentalist",
        "cafaro",
        "journal",
        "thoreau",
        "report",
        "goal",
        "state",
        "fact",
        "way",
        "shall",
        "significant",
        "rather",
        "allowing",
        "blind",
        "significance",
        "phenomenon",
        "journal",
        "evidently",
        "accept",
        "whatever",
        "register",
        "aesthetic",
        "emotional",
        "response",
        "ought",
        "viewed",
        "unreal",
        "indeed",
        "thoreau",
        "would",
        "argue",
        "person",
        "seldom",
        "moved",
        "beauty",
        "thing",
        "one",
        "inadequate",
        "conception",
        "reality",
        "since",
        "neutral",
        "observer",
        "le",
        "well",
        "aware",
        "world",
        "exhorts",
        "u",
        "unclutter",
        "simplify",
        "life",
        "eliminating",
        "supposed",
        "necessity",
        "entrap",
        "u",
        "mistakenly",
        "construe",
        "essential",
        "see",
        "hunt",
        "say",
        "nature",
        "inherently",
        "significant",
        "say",
        "natural",
        "fact",
        "neither",
        "inert",
        "valuefree",
        "thoreau",
        "urge",
        "reader",
        "underrate",
        "value",
        "fact",
        "since",
        "concrete",
        "detail",
        "world",
        "may",
        "contain",
        "meaningful",
        "truth",
        "natural",
        "history",
        "massachusetts",
        "note",
        "phrase",
        "value",
        "fact",
        "thoreau",
        "introduce",
        "artificial",
        "distinction",
        "fact",
        "value",
        "primary",
        "secondary",
        "quality",
        "perceive",
        "sight",
        "sound",
        "texture",
        "standing",
        "disembodied",
        "consciousness",
        "apart",
        "world",
        "inanimate",
        "mechanism",
        "rather",
        "sentient",
        "being",
        "immersed",
        "sensory",
        "world",
        "learning",
        "essential",
        "fact",
        "life",
        "perpetual",
        "instilling",
        "drenching",
        "reality",
        "surround",
        "u",
        "walden",
        "ii",
        "philosopher",
        "seek",
        "knowledge",
        "experience",
        "therefore",
        "surprised",
        "discover",
        "beauty",
        "order",
        "natural",
        "phenomenon",
        "however",
        "property",
        "projected",
        "onto",
        "nature",
        "external",
        "perspectiverather",
        "emerge",
        "within",
        "selfmaintaining",
        "process",
        "organic",
        "life",
        "entire",
        "environment",
        "living",
        "earth",
        "something",
        "like",
        "life",
        "one",
        "may",
        "going",
        "well",
        "badly",
        "containing",
        "reducible",
        "biotic",
        "existence",
        "animal",
        "plant",
        "walden",
        "xvii",
        "elsewhere",
        "describes",
        "slumbering",
        "subterranean",
        "fire",
        "nature",
        "never",
        "go",
        "winter",
        "walk",
        "thoreau",
        "remark",
        "upon",
        "much",
        "grander",
        "significance",
        "natural",
        "phenomenon",
        "referred",
        "man",
        "need",
        "viewed",
        "absolutely",
        "journal",
        "world",
        "rich",
        "value",
        "making",
        "whatever",
        "perceived",
        "slightest",
        "degree",
        "beautiful",
        "infinitely",
        "value",
        "u",
        "yet",
        "discovered",
        "useful",
        "serve",
        "purpose",
        "faith",
        "seed",
        "guilty",
        "imposing",
        "purpose",
        "onto",
        "world",
        "able",
        "view",
        "term",
        "one",
        "thing",
        "discover",
        "involved",
        "pluralistic",
        "universe",
        "containing",
        "many",
        "different",
        "point",
        "view",
        "begin",
        "realize",
        "infinite",
        "extent",
        "relation",
        "walden",
        "viii",
        "see",
        "even",
        "first",
        "seem",
        "good",
        "u",
        "may",
        "positive",
        "value",
        "considered",
        "broader",
        "perspective",
        "rather",
        "dismissing",
        "squirrel",
        "rodent",
        "instance",
        "see",
        "planter",
        "forest",
        "grateful",
        "role",
        "play",
        "distribution",
        "seed",
        "journal",
        "likewise",
        "gentle",
        "rain",
        "water",
        "bean",
        "keep",
        "house",
        "today",
        "drear",
        "melancholy",
        "good",
        "though",
        "prevents",
        "hoeing",
        "far",
        "worth",
        "hoeing",
        "continue",
        "long",
        "cause",
        "seed",
        "rot",
        "ground",
        "destroy",
        "potato",
        "low",
        "land",
        "would",
        "still",
        "good",
        "grass",
        "upland",
        "good",
        "grass",
        "would",
        "good",
        "walden",
        "v",
        "limited",
        "view",
        "often",
        "keep",
        "u",
        "appreciating",
        "harmonious",
        "interdependence",
        "part",
        "natural",
        "world",
        "due",
        "confusion",
        "irregularity",
        "nature",
        "incomplete",
        "knowledge",
        "walden",
        "xvi",
        "thoreau",
        "declares",
        "would",
        "happy",
        "meadow",
        "earth",
        "left",
        "wild",
        "state",
        "since",
        "tampering",
        "nature",
        "know",
        "sometimes",
        "end",
        "harm",
        "result",
        "walden",
        "x",
        "many",
        "case",
        "find",
        "unhandselled",
        "nature",
        "worth",
        "even",
        "mode",
        "valuation",
        "improvement",
        "journal",
        "nature",
        "access",
        "real",
        "value",
        "used",
        "standard",
        "measure",
        "conventional",
        "evaluation",
        "example",
        "latter",
        "value",
        "arbitrarily",
        "attached",
        "gold",
        "nothing",
        "intrinsic",
        "beauty",
        "value",
        "journal",
        "mistake",
        "rush",
        "california",
        "true",
        "gold",
        "found",
        "direction",
        "one",
        "failed",
        "appreciate",
        "inherent",
        "worth",
        "one",
        "native",
        "soil",
        "journal",
        "economy",
        "nature",
        "seed",
        "precious",
        "diamond",
        "contains",
        "principle",
        "growth",
        "life",
        "ability",
        "become",
        "specific",
        "plant",
        "tree",
        "journal",
        "seed",
        "provides",
        "evidence",
        "nature",
        "filled",
        "creative",
        "genius",
        "journal",
        "also",
        "reminds",
        "u",
        "spark",
        "divinity",
        "present",
        "human",
        "well",
        "one",
        "thoreau",
        "favorite",
        "analogiesnot",
        "metaphor",
        "see",
        "itis",
        "ripening",
        "seed",
        "development",
        "human",
        "potential",
        "finest",
        "quality",
        "nature",
        "like",
        "bloom",
        "fruit",
        "preserved",
        "delicate",
        "handling",
        "walden",
        "call",
        "wildness",
        "located",
        "nonhuman",
        "world",
        "creative",
        "force",
        "also",
        "active",
        "human",
        "nature",
        "even",
        "literary",
        "work",
        "art",
        "reasonably",
        "praised",
        "manifestation",
        "wildness",
        "see",
        "walking",
        "walden",
        "perfect",
        "analogy",
        "life",
        "human",
        "vegetable",
        "journal",
        "thought",
        "spring",
        "man",
        "brain",
        "way",
        "plant",
        "spring",
        "grows",
        "vitality",
        "journal",
        "thoreau",
        "exhortation",
        "follow",
        "prompting",
        "one",
        "genius",
        "based",
        "idea",
        "obeying",
        "wild",
        "nature",
        "aligning",
        "sacred",
        "power",
        "inspires",
        "u",
        "realize",
        "highest",
        "potential",
        "primitive",
        "vigor",
        "nature",
        "u",
        "journal",
        "influence",
        "something",
        "able",
        "neither",
        "predict",
        "comprehend",
        "describes",
        "ktaadn",
        "chapter",
        "maine",
        "wood",
        "nature",
        "primeval",
        "untamed",
        "forever",
        "untamable",
        "godlike",
        "force",
        "always",
        "kind",
        "one",
        "one",
        "point",
        "walden",
        "thoreau",
        "quip",
        "usually",
        "count",
        "among",
        "true",
        "idealist",
        "inclined",
        "reject",
        "evidence",
        "sens",
        "walden",
        "xiv",
        "hand",
        "scorn",
        "sort",
        "materialism",
        "fails",
        "penetrate",
        "inner",
        "mystery",
        "thing",
        "discovering",
        "nothing",
        "surface",
        "mechanistic",
        "observation",
        "journal",
        "instead",
        "argues",
        "must",
        "approach",
        "world",
        "nature",
        "looking",
        "nature",
        "aware",
        "relation",
        "form",
        "perception",
        "able",
        "perceive",
        "correspondence",
        "reason",
        "classifying",
        "thoreau",
        "naturalist",
        "romantic",
        "although",
        "category",
        "perhaps",
        "broad",
        "helpful",
        "conception",
        "nature",
        "informed",
        "syncretic",
        "appropriation",
        "greek",
        "asian",
        "source",
        "result",
        "eclectic",
        "vision",
        "uniquely",
        "reason",
        "difficult",
        "situate",
        "thoreau",
        "within",
        "history",
        "modern",
        "philosophy",
        "one",
        "plausible",
        "way",
        "would",
        "describe",
        "articulating",
        "version",
        "transcendental",
        "idealism",
        "thoreau",
        "indeed",
        "american",
        "heir",
        "kant",
        "critical",
        "philosophy",
        "called",
        "oelschlaeger",
        "investigation",
        "relation",
        "subject",
        "knowledge",
        "object",
        "build",
        "upon",
        "kantian",
        "insight",
        "see",
        "cavell",
        "yet",
        "order",
        "understand",
        "might",
        "accurate",
        "categorization",
        "must",
        "proceed",
        "thoreau",
        "metaphysics",
        "epistemology"
    ]
}