{
    "main_text": "The Ethics of Perception\n3. The Ethics of Perception\n\nIf one were asked to name the cardinal virtue of Thoreau’s\nphilosophy, it would be hard to identify a better candidate than\nawareness. He attests to the importance of “being\nforever on the alert,” and of “the discipline of looking\nalways at what is to be seen” (Walden, IV). This\nexercise may enable one to create remarkably intricate descriptions of\na sunset, a battle between red and black ants, or the shapes taken by\nthawing clay on a sand bank; but its primary value lies in the way it\naffects the quality of our experience. “It is something to be\nable to paint a particular picture, or to carve a statue, and so to\nmake a few objects beautiful; but it is far more glorious to carve and\npaint the very atmosphere and medium through which we look”\n(Walden, II). Awareness cannot be classified as exclusively a\nmoral or an intellectual virtue, either, since knowing is an\ninescapably practical and evaluative activity—not to mention, an\nembodied practice. Thoreau portrays himself not from a presumably\nneutral or impersonal vantage point, “but from an embodied point\nof view” in which his somatic sensory experience puts him\n“knowingly in touch with” his surroundings (Goodman 2012,\n36). For such reasons as these, he has sometimes been interpreted as a\n“philosopher of the senses” (Mooney 2009, 195), who offers\nan original response to the central problem of modern philosophy as a\nconsequence of recognizing that knowledge is “dependent on the\nindividual’s ability to see,” and that “the\nworld as known is thus radically dependent on character” (Tauber\n2001, 4–5).\n\nOne of the common tenets of ancient philosophy which was arguably\nabandoned in the period beginning with Descartes is that a person\n“could not have access to the truth” without undertaking a\nprocess of self-purification that would render him or her\n“susceptible to knowing the truth” (Foucault 1997,\n278–279). For Thoreau, it was the work of a lifetime to\ncultivate one’s receptivity to the beauty of the universe.\nBelieving that “the perception of beauty is a moral test”\n(Journal, 6/21/52), Thoreau frequently chastises himself or\nhumanity in general for failing in this respect. “How much of\nbeauty—of color, as well as form—on which our eyes daily\nrest goes unperceived by us,” he laments (Journal,\n8/1/60); and he worries that “Nature has no human inhabitant who\nappreciates her” (Walden, IX). Noticing that his\nsensory awareness has grown less acute since the time of his youth, he\nspeculates that “the child plucks its first flower with an\ninsight into its beauty and significance which the subsequent botanist\nnever retains” (Journal, 7/16/51; 2/5/52). In order to\nattain a clear and truthful view of things, we must refine all the\nfaculties of our embodied consciousness, and become emotionally\nattuned to all the concrete features of the place in which we are\nsituated. We fully know only those facts that are “warm, moist,\nincarnated,” and palpably felt: “A man has not seen a\nthing who has not felt it” (Journal, 2/23/60). In this\nway, Thoreau outlines an epistemological task that will occupy him for\nthe rest of his life; namely, to cultivate a way of attending to\nthings that will allow them to be experienced as elements of a\nmeaningful world.\n\nSince our ability to appreciate the significance of phenomena is so\neasily dulled, it requires a certain discipline in order to become and\nremain a reliable knower of the world. Like Aristotle, Thoreau\nbelieves that the perception of truth “produces a pleasurable\nsensation,” and he adds that a “healthy and refined nature\nwould always derive pleasure from the landscape”\n(Journal, 9/24/54 & 6/27/52). Nature will reward the most\ncareful attention paid by a person who is appropriately disposed, but\nthere is only “as much beauty visible to us in the landscape as\nwe are prepared to appreciate,—not a grain more. The actual\nobjects which one person will see from a particular hilltop are just\nas different from those which another will see as the persons are\ndifferent” (Journal, 11/4/58). One who is in the right\nstate to be capable of giving a “poetic and lively\ndescription” of things will find himself or herself “in a\nliving and beautiful world” (Journal, 10/13/60 &\n12/31/59). Beauty, like color, does not lie only in the eye of the\nbeholder: flowers, for example, are indeed beautiful and brightly\ncolored. Nevertheless, beauty—and color, for that\nmatter—can exist only where there is a beholder to perceive it\n(Journal, 6/15/52 & 1/21/38). From all of his experience\nin the field making observations of natural phenomena, Thoreau gained\nthe insight “that he, the supposedly neutral observer, was\nalways and unavoidably in the center of the observation”\n(McGregor 1997, 113). Because all perception of objects has a\nsubjective aspect, the world can be defined as a sphere centered\naround each conscious perceiver: wherever we are located, “the\nuniverse is built around us, and we are central still”\n(Journal, 8/24/41). This does not mean that we are trapped\ninside of our own consciousness; rather, the point is that it is only\nthrough the lens of our own subjectivity that we have access to the\nexternal world.\n\nWhat we are able to perceive, then, depends not only upon where we are\nphysically located: it is also contingent upon who we are and what we\nvalue, or how our attention is focused. “Objects are concealed\nfrom our view, not so much because they are out of the course of our\nvisual ray as because we do not bring our minds and eyes to bear on\nthem…. A man sees only what concerns him”\n(“Autumnal Tints”). In other words, there is “no\nsuch thing as pure objective observation. Your observation,\nto be interesting, i.e. to be significant, must be\nsubjective” (Journal, 5/6/54). Subjectivity is\nnot an obstacle to truth, according to Thoreau. After all, he says,\n“the truest description, and that by which another living man\ncan most readily recognize a flower, is the unmeasured and eloquent\none which the sight of it inspires” (Journal,\n10/13/60). A true account of the world must do justice to all the\nfamiliar properties of objects that the human mind is capable of\nperceiving. Whether this can be done by a scientific description is a\nvexing question for Thoreau, and one about which he shows considerable\nambivalence. One of his concerns is that the scientist\n“discovers no world for the mind of man with all its faculties\nto inhabit”; by contrast, there is “more humanity”\nin “the unscientific man’s knowledge,” since the\nlatter can explain how certain facts pertain to life\n(Journal, 9/5/51; 2/13/52). He accuses the naturalist of\nfailing to understand color, much less beauty, and asks: “What\nsort of science is that which enriches the understanding, but robs the\nimagination?” (Journal, 10/5/61 & 12/25/51) For\nThoreau, the most reliable observer is one who can “see things\nas they are, grand and beautiful” (Journal,\n1/7/57)—in other words, the beauty and grandeur of the world\nreally are there to be seen, even if we are not always capable of\nseeing them. We can easily fail to perceive the value of being if we\ndo not approach the world with the appropriate kind of emotional\ncomportment.\n\nThoreau sometimes characterizes science as an ideal discipline that\nwill enrich our knowledge and experience: “The true man of\nscience will know nature better by his finer organization; he will\nsmell, taste, see, hear, feel, better than other men. His will be a\ndeeper and finer experience” (“Natural History of\nMassachusetts”). He observes that scientific terminology can\nprovide the means of apprehending something that we had utterly missed\nuntil we had a name for it (see Walls 2012, 108). Yet he also gives\nvoice to the fear that by weighing and measuring things and collecting\nquantitative data we may actually be narrowing our vision. The\nscientist “studies nature as a dead language,” and would\nrather study a dead fish preserved in a jar than a living one in its\nnative element (Journal, 5/10/53 & 11/30/58). In these\nsame journal entries, Thoreau claims that he seeks to experience the\nsignificance of nature, and that “the beauty of the fish”\nis what is most worthy of being measured. On the other hand, when he\nfinds a dead fish in the water, he brings it home to weigh and\nmeasure, covering several pages with his statistical findings\n(Journal, 8/20/54). This is only one of many examples of\nThoreau’s fascination with data-gathering, and yet he repeatedly\nquestions its value, as if he does not know what to make of his own\npenchant for naturalistic research. At the very least, scientific\ninvestigations run the risk of being “trivial and petty,”\nso perhaps what one should do is “learn science and then forget\nit” (Journal, 1/21/53 & 4/22/52). But Thoreau is\nmore deeply troubled by the possibility that “science is\ninhuman,” since objects “seen with a microscope begin to\nbe insignificant,” and this is “not the means of acquiring\ntrue knowledge” (Journal, 5/1/59 & 5/28/54).\nOverall, his position is not that an imaginative awareness of the\nworld is incompatible with knowledge of measurable facts, but that an\nexclusive focus on the latter would blind us to whatever aspects of\nreality fall outside the scope of our measurement.\n\nOne thing we can learn from Thoreau’s comments on scientific\ninquiry is that he cares very much about the following question: what\ncan we know about the world, and how are we able to know it? Although\nhe admires the precision of scientific information, he wonders if what\nit delivers is always bound to be “something less than the vague\npoetic” (Journal, 1/5/50). In principle, a naturalistic\napproach to reality should be able to capture its beauty and\nsignificance; in practice, however, it may be “impossible for\nthe same person to see things from the poet’s point of view and\nthat of the man of science” (Journal, 2/18/52). In that\ncase, the best we can do is try to convey our intimations of the truth\nabout the universe, even if this means venturing far beyond claims\nthat are positively verifiable: “I desire to speak somewhere\nwithout bounds; like a man in his waking moment, to men in\ntheir waking moments; for I am convinced that I cannot exaggerate\nenough even to lay the foundation of a true expression… . The\nwords which express our faith and piety are not definite; yet they are\nsignificant and fragrant like frankincense to superior natures”\n(Walden, XVIII). We should not arbitrarily limit our\nawareness to that which can be described with mathematical exactitude,\nfor perhaps the highest knowledge available to us, Thoreau suggests,\nconsists in “a sudden revelation of the insufficiency of all\nthat we called Knowledge before … it is the lighting up of the\nmist by the sun” (“Walking”). And perhaps this is\nnot a regrettable fact: “At the same time that we are earnest to\nexplore and learn all things, we require that all things be mysterious\nand unexplorable, that land and sea be infinitely wild, unsurveyed and\nunfathomed by us because unfathomable” (Walden, XVII).\nBy acknowledging the limits of what we can know with certainty, we\nopen ourselves up to a wider horizon of experience.\n\nAs one commentator points out, Thoreau’s categories—so to\nspeak—are dynamic, since they are constantly being redefined by\nwhat we perceive, even as they shape our way of seeing (Peck 1990,\n84–85). Every now and then “something will occur which my\nphilosophy has not dreamed of,” Thoreau says, which demonstrates\nthat the “boundaries of the actual are no more fixed and rigid\nthan the elasticity of our imaginations” (Journal,\n5/31/53). Since the thoughts of each knowing subject are “part\nof the meaning of the world,” it is legitimate to ask:\n“Who can say what is? He can only say how he\nsees” (11/4/52 & 12/2/46). Truth is radically\nperspective-dependent, which means that insofar as we are different\npeople we can only be expected to perceive different worlds (Walls\n1995, 213). Thoreau’s position might be described as\nperspectival realism, since he does not conclude that truth is\nrelative but celebrates the diversity of the multifaceted reality that\neach of us knows in his own distinctive way. “How novel and\noriginal must be each new man’s view of the universe!” he\nexclaims, and “how sweet is the perception of a new natural\nfact,” for it suggests to us “what worlds remain to be\nunveiled” (Journal, 4/2/52 & 4/19/52). We may never\ncomprehend the intimate relation between a significant fact and the\nperceiver who appreciates it, but we should trust that it is not in\nvain to view nature with “humane affections”\n(Journal, 2/20/57 & 6/30/52). With respect to any given\nphenomenon, the “point of interest” that concerns us lies\nneither in the independent object nor in the subject alone, but\nsomewhere in between (Journal, 11/5/57). Witnessing the rise\nof positivism and its ideal of complete objectivity, Thoreau attempts\n“to preserve an enchanted world and to place the passionate\nobserver in the center of his or her universe” (Tauber 2001,\n20). It is an admirable goal, and one that remains highly relevant in\nthe intellectual climate of the present day.\n",
    "section_title": "3. The Ethics of Perception",
    "entry_title": "Henry David Thoreau",
    "hierarchy_title": "Henry David Thoreau || The Ethics of Perception",
    "tokenized_text": [
        "ethic",
        "perception",
        "ethic",
        "perception",
        "one",
        "asked",
        "name",
        "cardinal",
        "virtue",
        "thoreau",
        "philosophy",
        "would",
        "hard",
        "identify",
        "better",
        "candidate",
        "awareness",
        "attests",
        "importance",
        "forever",
        "alert",
        "discipline",
        "looking",
        "always",
        "seen",
        "walden",
        "iv",
        "exercise",
        "may",
        "enable",
        "one",
        "create",
        "remarkably",
        "intricate",
        "description",
        "sunset",
        "battle",
        "red",
        "black",
        "ant",
        "shape",
        "taken",
        "thawing",
        "clay",
        "sand",
        "bank",
        "primary",
        "value",
        "lie",
        "way",
        "affect",
        "quality",
        "experience",
        "something",
        "able",
        "paint",
        "particular",
        "picture",
        "carve",
        "statue",
        "make",
        "object",
        "beautiful",
        "far",
        "glorious",
        "carve",
        "paint",
        "atmosphere",
        "medium",
        "look",
        "walden",
        "ii",
        "awareness",
        "classified",
        "exclusively",
        "moral",
        "intellectual",
        "virtue",
        "either",
        "since",
        "knowing",
        "inescapably",
        "practical",
        "evaluative",
        "activitynot",
        "mention",
        "embodied",
        "practice",
        "thoreau",
        "portrays",
        "presumably",
        "neutral",
        "impersonal",
        "vantage",
        "point",
        "embodied",
        "point",
        "view",
        "somatic",
        "sensory",
        "experience",
        "put",
        "knowingly",
        "touch",
        "surroundings",
        "goodman",
        "reason",
        "sometimes",
        "interpreted",
        "philosopher",
        "sens",
        "mooney",
        "offer",
        "original",
        "response",
        "central",
        "problem",
        "modern",
        "philosophy",
        "consequence",
        "recognizing",
        "knowledge",
        "dependent",
        "individual",
        "ability",
        "see",
        "world",
        "known",
        "thus",
        "radically",
        "dependent",
        "character",
        "tauber",
        "one",
        "common",
        "tenet",
        "ancient",
        "philosophy",
        "arguably",
        "abandoned",
        "period",
        "beginning",
        "descartes",
        "person",
        "could",
        "access",
        "truth",
        "without",
        "undertaking",
        "process",
        "selfpurification",
        "would",
        "render",
        "susceptible",
        "knowing",
        "truth",
        "foucault",
        "thoreau",
        "work",
        "lifetime",
        "cultivate",
        "one",
        "receptivity",
        "beauty",
        "universe",
        "believing",
        "perception",
        "beauty",
        "moral",
        "test",
        "journal",
        "thoreau",
        "frequently",
        "chastises",
        "humanity",
        "general",
        "failing",
        "respect",
        "much",
        "beautyof",
        "color",
        "well",
        "formon",
        "eye",
        "daily",
        "rest",
        "go",
        "unperceived",
        "u",
        "lament",
        "journal",
        "worry",
        "nature",
        "human",
        "inhabitant",
        "appreciates",
        "walden",
        "ix",
        "noticing",
        "sensory",
        "awareness",
        "grown",
        "le",
        "acute",
        "since",
        "time",
        "youth",
        "speculates",
        "child",
        "pluck",
        "first",
        "flower",
        "insight",
        "beauty",
        "significance",
        "subsequent",
        "botanist",
        "never",
        "retains",
        "journal",
        "order",
        "attain",
        "clear",
        "truthful",
        "view",
        "thing",
        "must",
        "refine",
        "faculty",
        "embodied",
        "consciousness",
        "become",
        "emotionally",
        "attuned",
        "concrete",
        "feature",
        "place",
        "situated",
        "fully",
        "know",
        "fact",
        "warm",
        "moist",
        "incarnated",
        "palpably",
        "felt",
        "man",
        "seen",
        "thing",
        "felt",
        "journal",
        "way",
        "thoreau",
        "outline",
        "epistemological",
        "task",
        "occupy",
        "rest",
        "life",
        "namely",
        "cultivate",
        "way",
        "attending",
        "thing",
        "allow",
        "experienced",
        "element",
        "meaningful",
        "world",
        "since",
        "ability",
        "appreciate",
        "significance",
        "phenomenon",
        "easily",
        "dulled",
        "requires",
        "certain",
        "discipline",
        "order",
        "become",
        "remain",
        "reliable",
        "knower",
        "world",
        "like",
        "aristotle",
        "thoreau",
        "belief",
        "perception",
        "truth",
        "produce",
        "pleasurable",
        "sensation",
        "add",
        "healthy",
        "refined",
        "nature",
        "would",
        "always",
        "derive",
        "pleasure",
        "landscape",
        "journal",
        "nature",
        "reward",
        "careful",
        "attention",
        "paid",
        "person",
        "appropriately",
        "disposed",
        "much",
        "beauty",
        "visible",
        "u",
        "landscape",
        "prepared",
        "appreciate",
        "not",
        "grain",
        "actual",
        "object",
        "one",
        "person",
        "see",
        "particular",
        "hilltop",
        "different",
        "another",
        "see",
        "person",
        "different",
        "journal",
        "one",
        "right",
        "state",
        "capable",
        "giving",
        "poetic",
        "lively",
        "description",
        "thing",
        "find",
        "living",
        "beautiful",
        "world",
        "journal",
        "beauty",
        "like",
        "color",
        "lie",
        "eye",
        "beholder",
        "flower",
        "example",
        "indeed",
        "beautiful",
        "brightly",
        "colored",
        "nevertheless",
        "beautyand",
        "color",
        "mattercan",
        "exist",
        "beholder",
        "perceive",
        "journal",
        "experience",
        "field",
        "making",
        "observation",
        "natural",
        "phenomenon",
        "thoreau",
        "gained",
        "insight",
        "supposedly",
        "neutral",
        "observer",
        "always",
        "unavoidably",
        "center",
        "observation",
        "mcgregor",
        "perception",
        "object",
        "subjective",
        "aspect",
        "world",
        "defined",
        "sphere",
        "centered",
        "around",
        "conscious",
        "perceiver",
        "wherever",
        "located",
        "universe",
        "built",
        "around",
        "u",
        "central",
        "still",
        "journal",
        "mean",
        "trapped",
        "inside",
        "consciousness",
        "rather",
        "point",
        "lens",
        "subjectivity",
        "access",
        "external",
        "world",
        "able",
        "perceive",
        "depends",
        "upon",
        "physically",
        "located",
        "also",
        "contingent",
        "upon",
        "value",
        "attention",
        "focused",
        "object",
        "concealed",
        "view",
        "much",
        "course",
        "visual",
        "ray",
        "bring",
        "mind",
        "eye",
        "bear",
        "them",
        "man",
        "see",
        "concern",
        "autumnal",
        "tint",
        "word",
        "thing",
        "pure",
        "objective",
        "observation",
        "observation",
        "interesting",
        "ie",
        "significant",
        "must",
        "subjective",
        "journal",
        "subjectivity",
        "obstacle",
        "truth",
        "according",
        "thoreau",
        "say",
        "truest",
        "description",
        "another",
        "living",
        "man",
        "readily",
        "recognize",
        "flower",
        "unmeasured",
        "eloquent",
        "one",
        "sight",
        "inspires",
        "journal",
        "true",
        "account",
        "world",
        "must",
        "justice",
        "familiar",
        "property",
        "object",
        "human",
        "mind",
        "capable",
        "perceiving",
        "whether",
        "done",
        "scientific",
        "description",
        "vexing",
        "question",
        "thoreau",
        "one",
        "show",
        "considerable",
        "ambivalence",
        "one",
        "concern",
        "scientist",
        "discovers",
        "world",
        "mind",
        "man",
        "faculty",
        "inhabit",
        "contrast",
        "humanity",
        "unscientific",
        "man",
        "knowledge",
        "since",
        "latter",
        "explain",
        "certain",
        "fact",
        "pertain",
        "life",
        "journal",
        "accuses",
        "naturalist",
        "failing",
        "understand",
        "color",
        "much",
        "le",
        "beauty",
        "asks",
        "sort",
        "science",
        "enriches",
        "understanding",
        "robs",
        "imagination",
        "journal",
        "thoreau",
        "reliable",
        "observer",
        "one",
        "see",
        "thing",
        "grand",
        "beautiful",
        "journal",
        "in",
        "word",
        "beauty",
        "grandeur",
        "world",
        "really",
        "seen",
        "even",
        "always",
        "capable",
        "seeing",
        "easily",
        "fail",
        "perceive",
        "value",
        "approach",
        "world",
        "appropriate",
        "kind",
        "emotional",
        "comportment",
        "thoreau",
        "sometimes",
        "characterizes",
        "science",
        "ideal",
        "discipline",
        "enrich",
        "knowledge",
        "experience",
        "true",
        "man",
        "science",
        "know",
        "nature",
        "better",
        "finer",
        "organization",
        "smell",
        "taste",
        "see",
        "hear",
        "feel",
        "better",
        "men",
        "deeper",
        "finer",
        "experience",
        "natural",
        "history",
        "massachusetts",
        "observes",
        "scientific",
        "terminology",
        "provide",
        "mean",
        "apprehending",
        "something",
        "utterly",
        "missed",
        "name",
        "see",
        "wall",
        "yet",
        "also",
        "give",
        "voice",
        "fear",
        "weighing",
        "measuring",
        "thing",
        "collecting",
        "quantitative",
        "data",
        "may",
        "actually",
        "narrowing",
        "vision",
        "scientist",
        "study",
        "nature",
        "dead",
        "language",
        "would",
        "rather",
        "study",
        "dead",
        "fish",
        "preserved",
        "jar",
        "living",
        "one",
        "native",
        "element",
        "journal",
        "journal",
        "entry",
        "thoreau",
        "claim",
        "seek",
        "experience",
        "significance",
        "nature",
        "beauty",
        "fish",
        "worthy",
        "measured",
        "hand",
        "find",
        "dead",
        "fish",
        "water",
        "brings",
        "home",
        "weigh",
        "measure",
        "covering",
        "several",
        "page",
        "statistical",
        "finding",
        "journal",
        "one",
        "many",
        "example",
        "thoreau",
        "fascination",
        "datagathering",
        "yet",
        "repeatedly",
        "question",
        "value",
        "know",
        "make",
        "penchant",
        "naturalistic",
        "research",
        "least",
        "scientific",
        "investigation",
        "run",
        "risk",
        "trivial",
        "petty",
        "perhaps",
        "one",
        "learn",
        "science",
        "forget",
        "journal",
        "thoreau",
        "deeply",
        "troubled",
        "possibility",
        "science",
        "inhuman",
        "since",
        "object",
        "seen",
        "microscope",
        "begin",
        "insignificant",
        "mean",
        "acquiring",
        "true",
        "knowledge",
        "journal",
        "overall",
        "position",
        "imaginative",
        "awareness",
        "world",
        "incompatible",
        "knowledge",
        "measurable",
        "fact",
        "exclusive",
        "focus",
        "latter",
        "would",
        "blind",
        "u",
        "whatever",
        "aspect",
        "reality",
        "fall",
        "outside",
        "scope",
        "measurement",
        "one",
        "thing",
        "learn",
        "thoreau",
        "comment",
        "scientific",
        "inquiry",
        "care",
        "much",
        "following",
        "question",
        "know",
        "world",
        "able",
        "know",
        "although",
        "admires",
        "precision",
        "scientific",
        "information",
        "wonder",
        "delivers",
        "always",
        "bound",
        "something",
        "le",
        "vague",
        "poetic",
        "journal",
        "principle",
        "naturalistic",
        "approach",
        "reality",
        "able",
        "capture",
        "beauty",
        "significance",
        "practice",
        "however",
        "may",
        "impossible",
        "person",
        "see",
        "thing",
        "poet",
        "point",
        "view",
        "man",
        "science",
        "journal",
        "case",
        "best",
        "try",
        "convey",
        "intimation",
        "truth",
        "universe",
        "even",
        "mean",
        "venturing",
        "far",
        "beyond",
        "claim",
        "positively",
        "verifiable",
        "desire",
        "speak",
        "somewhere",
        "without",
        "bound",
        "like",
        "man",
        "waking",
        "moment",
        "men",
        "waking",
        "moment",
        "convinced",
        "exaggerate",
        "enough",
        "even",
        "lay",
        "foundation",
        "true",
        "expression",
        "word",
        "express",
        "faith",
        "piety",
        "definite",
        "yet",
        "significant",
        "fragrant",
        "like",
        "frankincense",
        "superior",
        "nature",
        "walden",
        "xviii",
        "arbitrarily",
        "limit",
        "awareness",
        "described",
        "mathematical",
        "exactitude",
        "perhaps",
        "highest",
        "knowledge",
        "available",
        "u",
        "thoreau",
        "suggests",
        "consists",
        "sudden",
        "revelation",
        "insufficiency",
        "called",
        "knowledge",
        "lighting",
        "mist",
        "sun",
        "walking",
        "perhaps",
        "regrettable",
        "fact",
        "time",
        "earnest",
        "explore",
        "learn",
        "thing",
        "require",
        "thing",
        "mysterious",
        "unexplorable",
        "land",
        "sea",
        "infinitely",
        "wild",
        "unsurveyed",
        "unfathomed",
        "u",
        "unfathomable",
        "walden",
        "xvii",
        "acknowledging",
        "limit",
        "know",
        "certainty",
        "open",
        "wider",
        "horizon",
        "experience",
        "one",
        "commentator",
        "point",
        "thoreau",
        "categoriesso",
        "speakare",
        "dynamic",
        "since",
        "constantly",
        "redefined",
        "perceive",
        "even",
        "shape",
        "way",
        "seeing",
        "peck",
        "every",
        "something",
        "occur",
        "philosophy",
        "dreamed",
        "thoreau",
        "say",
        "demonstrates",
        "boundary",
        "actual",
        "fixed",
        "rigid",
        "elasticity",
        "imagination",
        "journal",
        "since",
        "thought",
        "knowing",
        "subject",
        "part",
        "meaning",
        "world",
        "legitimate",
        "ask",
        "say",
        "say",
        "see",
        "truth",
        "radically",
        "perspectivedependent",
        "mean",
        "insofar",
        "different",
        "people",
        "expected",
        "perceive",
        "different",
        "world",
        "wall",
        "thoreau",
        "position",
        "might",
        "described",
        "perspectival",
        "realism",
        "since",
        "conclude",
        "truth",
        "relative",
        "celebrates",
        "diversity",
        "multifaceted",
        "reality",
        "u",
        "know",
        "distinctive",
        "way",
        "novel",
        "original",
        "must",
        "new",
        "man",
        "view",
        "universe",
        "exclaims",
        "sweet",
        "perception",
        "new",
        "natural",
        "fact",
        "suggests",
        "u",
        "world",
        "remain",
        "unveiled",
        "journal",
        "may",
        "never",
        "comprehend",
        "intimate",
        "relation",
        "significant",
        "fact",
        "perceiver",
        "appreciates",
        "trust",
        "vain",
        "view",
        "nature",
        "humane",
        "affection",
        "journal",
        "respect",
        "given",
        "phenomenon",
        "point",
        "interest",
        "concern",
        "u",
        "lie",
        "neither",
        "independent",
        "object",
        "subject",
        "alone",
        "somewhere",
        "journal",
        "witnessing",
        "rise",
        "positivism",
        "ideal",
        "complete",
        "objectivity",
        "thoreau",
        "attempt",
        "preserve",
        "enchanted",
        "world",
        "place",
        "passionate",
        "observer",
        "center",
        "universe",
        "tauber",
        "admirable",
        "goal",
        "one",
        "remains",
        "highly",
        "relevant",
        "intellectual",
        "climate",
        "present",
        "day"
    ]
}