{
    "main_text": "Current Views on Thought Experiments || The Skeptical Objection\n4.1 The Skeptical Objection\n\nOf course, particular thought experiments have been contested. But for\nthe most part, the practice of thought experiments in the sciences has\nbeen cheerfully accepted. Pierre Duhem, the great historian of\nphysics, is almost alone in what has been understood as an outright\ncondemnation of scientific thought experiments (see Duhem 1913, pp.\n304–311). A thought experiment is no substitute for a real\nexperiment, he claimed, and should be forbidden in science, including\nscience education. However, in view of the important role of actual\nthought experiments in the history of physics — from\nGalileo’s falling bodies, to Newton’s bucket, to\nEinstein’s elevator — it is unlikely that anyone will feel\nor should feel much sympathy for Duhem’s strictures. We hasten\nto add that Buzzoni (2018) questions the validity of this reading of\nDuhem, and argues that already Mach’s reception of Duhem’s\nviews suggests a more nuanced reading of Duhem’s position.\n\nPhilosophers can be as critical as Duhem when it comes to thought\nexperimenting in their own field (see Peijnenburg; Atkinson 2003;\nThagard 2014; Wilson 2016). At least thought experiments in science,\nthe skeptic claims, can be tested by physical experiment. However,\nthis is clearly false, since frictionless planes and universes empty\nof all material bodies cannot be produced in any laboratory. True, the\nresults of philosophical thought experiments cannot be even\napproximately tested. But, skeptics say little about why thought\nexperiments enjoy such popularity in philosophy. We are inclined to\nsay that skeptics underestimate the importance of thought experiments\nfor the creative mind in any field. Also, one mustn’t forget\nthat the cognitive power of real world experiments isn’t a\nself-evident matter either.\n\nFew are outright skeptics, however. Many take a more ambiguous stance.\nSören Häggqvist, for example, has developed a normative\nmodel for philosophical thought experiments (see Häggqvist 1996\nand 2009). Surprisingly, none of the commonly accepted philosophical\nthought experiments satisfies his model. And the process of\nidentifying successful thought experiments is only the first step in\naddressing the central epistemological challenge posed by thought\nexperiments. It gets much messier once we begin to ask exactly how\nreliable “successful” thought experiments are. Granted,\nthere is some justice in worrying about the reliability of\nphilosophical thought experiments (see, e.g., Klee 2008). This might\nbe true for ethics (see Dancy 1985, Jackson 1992; Wilson 2016),\nconceptual analysis (see Fodor 1964), and the philosophy of mind:\n“A popular strategy in philosophy is to construct a certain sort\nof thought experiment I call intuition pump. […] Intuition\npumps are often abused, though seldom deliberately” (Dennett\n1985, p. 12). The claim by Dennett and others is that thought\nexperiments too often rest on prejudice and faulty common sense; they\nare inherently conservative, while real science will likely result in\nhighly-counterintuitive outcomes. Dennett believes that thought\nexperiments rest on naive “folk concepts,” which is why\nthey can be so misguided. It is far from clear that this is a fair\ncharge. Everything involved in Galileo’s thought experiment that\nproduced the principle of relativity could be called “folk\nconcepts.” If we are inside a ship and perform a number of\nexperiments, such as walking about, tossing a ball, watching birds fly\nabout, we could not tell whether we are at rest in port or sailing\nover a smooth sea. The upshot is that nature behaves the same either\nway; the laws of nature are the same in any inertial frame. This\nresult is profound and is still with us in Einstein’s\nrelativity, whether it is folk physics or not.\n\nFrequently discussed is the skeptical challenge raised by Kathleen\nWilkes. She expresses a deep suspicion of scenarios such as Derek\nParfit’s people splitting like an amoeba (see Parfit 1987;\nGendler 2002a). Wilkes wants philosophy “to use science fact\nrather than science fiction or fantasy” (Wilkes 1988, p. 1), and\ntherefore to refrain from using thought experiments because they are\n“both problematic and positively misleading” (Wilkes 1988,\np. 2). She claims that thought experiments about personal identity in\nparticular often fail to provide the background conditions against\nwhich the experiment is set (see Wilkes 1988, p. 7). She thinks we\nwould not know what to say if we encountered someone who split like an\namoeba. She insists that a legitimate thought experiment must not\nviolate the known laws of nature. We do agree with Wilkes that\nunderdetermination can be a problem. But instead of dismissing thought\nexperiments in philosophy we should consider it a crucial factor in\nassessing the quality of a thought experiment (see Rescher 2005, pp.\n9–14). That is to say that the more detailed the imaginary\nscenario in the relevant aspects is, the better the thought experiment\n(see Brendel 2004, pp. 97–99; Häggqvist 1996, p. 28).\n\nWe also agree that the inferences drawn in thought experimenting are\nhighly problematic if the hypothetical scenario “is inadequately\ndescribed” (Wilkes 1988, p. 8). But Wilkes seems to think that\nthe lack of description is unavoidable, which supposedly amounts to a\nreason against philosophical thought experiments on personal identity\nbecause persons are not natural kinds. This makes it impossible to\nfill in necessary information to make the thought experiment work\ngiven its unavoidable underdetermination. Wilkes thinks that\n“whenever we are examining the ranges of concepts that do not\npick on natural kinds, the problem of deciding what is or what is not\n‘relevant’ to the success of the thought experiment is yet\nmore problematic than the same question as it arises in science; and,\nunlike the scientific problem, it may not even have an answer in\nprinciple” (Wilkes 1988, p. 15). She adds that scientific laws\n— especially those describing biological kinds like human beings\n— “are not disjoint and independent, detachable from one\nanother […]. They are interrelated, to varying degrees of\ncourse” (Wilkes 1988, p. 29). This implies, for example, that\n“a full psychophysiological account of the processes of human\nperception must at some stage link up with part at least of linguistic\nability; for we typically see things under a certain description, and\nthat description may be a very sophisticated one” (Wilkes 1988,\np. 29). These considerations have her rule out experiments that\nchallenge the human monopoly of personhood. No thought experiment,\nclaims Wilkes, is well conceived if it involves non-human animals or\ncomputers as persons. But also those thought experiments can be ruled\nout which involve the “fission or fusion of humans”\nbecause it is not theoretically possible. “The total impact of\nthe sum of laws that group us together as human beings (a natural kind\ncategory) precludes our splitting into two […] or fusing with\nsomeone else” (Wilkes 1988, p. 36).\n\nOne can ascertain here all too well the inherent difficulties in\nthinking about personal identity and the limited benefit some thought\nexperiments might have for what is deemed the proper metaphysics of\npersonal identity. Nevertheless, good reasons have been given in\nfavour of the use of thought experiments about personal identity (see\nBeck 2006; Kolak 1993; Hershenov 2008). We also feel that the problems\nabout thought experiments on personal identity reveal more about the\nintricate nature of the subject than about the usefulness of\nphilosophical thought experiments. And, disregarding other\nshortcomings in Wilkes’ skepticism (for further discussion of\nWilkes’ views see Beck 1992; Brooks 1994; Focquaert 2003;\nHäggqvist 1996, pp. 27–34), her suggestion that thought\nexperimental scenarios would have to satisfy current scientific\nknowledge about the relevant entities featured in a thought experiment\nis highly implausible. We learn a great deal about the world and our\ntheories when we wonder, for instance, what would have happened after\nthe big bang if the law of gravity had been an inverse cube law\ninstead of an inverse square. Would stars have failed to form?\nReasoning about such a scenario is perfectly coherent and very\ninstructive, even though it violates a law of nature.\n\nTo some extent we should share Wilkes’s concern that thought\nexperimenting seems to be constrained only by relevant logical\nimpossibilities and what seems intuitively acceptable. This is indeed\nproblematic because intuitions can be highly misleading and relevant\nlogical impossibilities are fairly ungrounded if they cannot be\nsupplemented by relevant theoretical impossibilities based on current\nscience in order to avoid the jump into futile fantasy. But in order\nto dismiss thought experimenting as a useful philosophical tool one\nhas to show that intuition cannot be a source of knowledge and that an\nepistemic tool should be useless because there is a serious chance it\ncan fail. Timothy Williamson has argued that we should forget about\nintuition as a cushion in the philosophical armchair (see Williamson\n2004a,b, 2008, pp. 179–207, and 2009; see also Schaffer 2017).\nThe importance of intuitions in philosophy has been neglected in the\npast (see Williamson 2004b, p. 109–110), and for too long\nintuition didn’t receive the attention it deserves (see, e.g.,\nDePaul and Ramsey (eds.) 1998). Besides the traditional divide between\nempiricists, rationalists and skeptics, it is not only a very\nnon-uniform use of the word “intuition” that makes it\ndifficult to assess the progress of the last years of philosophical\ninquiry about intuitions. The situation has been complicated by the\ncontributions of experimental philosophers on intuitions who add\ndifferent reasons to question their reliability (see for a careful\ncritique of those reasons: Ludwig 2007; see also Ludwig 2018).\nGenerally speaking, the reliability of intuitions has been challenged\non two grounds. One stems from an evolutionary explanation of the\ncapacity to intuit; another is due to experiments which supposedly\nshow the cultural relativity or racial and gender sensitivity of\nintuitions (see, e.g., Buckwalter and Stich 2010): “…a\nsubstantial list of philosophical intuitions vary across demographic\ngroups and…they are influenced by a number of prima\nfacie irrelevant factors…Some writers…have urged\nthat these findings justify a thoroughgoing skepticism about the use\nof intuitions as evidence in philosophy…But we think this\nconclusion is much too strong…” (Stich & Toba 2018,\np. 379). After all, knowledge without intuitions (if only common sense\nassumptions) seems impossible.\n\nThe recent discussion of intuitions in epistemology has barely made an\nimpact on philosophical reflections about thought experiments. As far\nas philosophical thought experiments are concerned, this is as it\nshould be, according to Williamson. In this respect George Bealer can\nbe cited in support of Williamson, because for Bealer the talk about\nphilosophical thought experiments reveals a conceptual confusion.\nPhilosophy, he claims, is about “rational intuitions” and\nthought experiments can be only about “physical\nintuitions” (see Bealer 1998, pp. 207–208, and 2002, p.\n74). To many, this is an implausible claim based on a deeply\nproblematic “phenomenology of intuitions” resulting in a\nstrict separation of “rational intuitions” from\n“physical intuitions”, on such grounds as an alleged\nimmutability of “rational intuitions”. There are good\nreasons to believe that thought experiments appeal to intuitions in\norder to give us new insights about different realms of investigation,\nincluding philosophy. This kind of positive connection is what\nWilliamson has in mind when addressing the role of intuitions in\nphilosophical thought experiments like the famous Gettier cases, which\novernight found acceptance by the philosophical community in their aim\nto refute the view that knowledge is justified true belief. While\nWilliamson expects “armchair methods to play legitimately a more\ndominant role in future philosophy” (Williamson 2009, p. 126),\nhe thinks that “we should stop talking about intuition”\n(Williamson 2004b, p. 152). This does not impress proponents of what\nwe call an intuition-based account of thought experiments, and\nprobably for good reasons, given the problems in Williamson’s\napproach (see, e.g., Dohrn 2016; Ichikawa and Jarvis 2009; Schaffer\n2017), and the strong empirical evidence in favour of the positive\nrole that intuitions does play in human cognition (see Myers\n2004).\n",
    "section_title": "4.1 The Skeptical Objection",
    "entry_title": "Thought Experiments",
    "hierarchy_title": "Thought Experiments || Current Views on Thought Experiments || The Skeptical Objection",
    "tokenized_text": [
        "current",
        "view",
        "thought",
        "experiment",
        "skeptical",
        "objection",
        "skeptical",
        "objection",
        "course",
        "particular",
        "thought",
        "experiment",
        "contested",
        "part",
        "practice",
        "thought",
        "experiment",
        "science",
        "cheerfully",
        "accepted",
        "pierre",
        "duhem",
        "great",
        "historian",
        "physic",
        "almost",
        "alone",
        "understood",
        "outright",
        "condemnation",
        "scientific",
        "thought",
        "experiment",
        "see",
        "duhem",
        "pp",
        "thought",
        "experiment",
        "substitute",
        "real",
        "experiment",
        "claimed",
        "forbidden",
        "science",
        "including",
        "science",
        "education",
        "however",
        "view",
        "important",
        "role",
        "actual",
        "thought",
        "experiment",
        "history",
        "physic",
        "galileo",
        "falling",
        "body",
        "newton",
        "bucket",
        "einstein",
        "elevator",
        "unlikely",
        "anyone",
        "feel",
        "feel",
        "much",
        "sympathy",
        "duhem",
        "stricture",
        "hasten",
        "add",
        "buzzoni",
        "question",
        "validity",
        "reading",
        "duhem",
        "argues",
        "already",
        "mach",
        "reception",
        "duhem",
        "view",
        "suggests",
        "nuanced",
        "reading",
        "duhem",
        "position",
        "philosopher",
        "critical",
        "duhem",
        "come",
        "thought",
        "experimenting",
        "field",
        "see",
        "peijnenburg",
        "atkinson",
        "thagard",
        "wilson",
        "least",
        "thought",
        "experiment",
        "science",
        "skeptic",
        "claim",
        "tested",
        "physical",
        "experiment",
        "however",
        "clearly",
        "false",
        "since",
        "frictionless",
        "plane",
        "universe",
        "empty",
        "material",
        "body",
        "produced",
        "laboratory",
        "true",
        "result",
        "philosophical",
        "thought",
        "experiment",
        "even",
        "approximately",
        "tested",
        "skeptic",
        "say",
        "little",
        "thought",
        "experiment",
        "enjoy",
        "popularity",
        "philosophy",
        "inclined",
        "say",
        "skeptic",
        "underestimate",
        "importance",
        "thought",
        "experiment",
        "creative",
        "mind",
        "field",
        "also",
        "one",
        "forget",
        "cognitive",
        "power",
        "real",
        "world",
        "experiment",
        "selfevident",
        "matter",
        "either",
        "outright",
        "skeptic",
        "however",
        "many",
        "take",
        "ambiguous",
        "stance",
        "sören",
        "häggqvist",
        "example",
        "developed",
        "normative",
        "model",
        "philosophical",
        "thought",
        "experiment",
        "see",
        "häggqvist",
        "surprisingly",
        "none",
        "commonly",
        "accepted",
        "philosophical",
        "thought",
        "experiment",
        "satisfies",
        "model",
        "process",
        "identifying",
        "successful",
        "thought",
        "experiment",
        "first",
        "step",
        "addressing",
        "central",
        "epistemological",
        "challenge",
        "posed",
        "thought",
        "experiment",
        "get",
        "much",
        "messier",
        "begin",
        "ask",
        "exactly",
        "reliable",
        "successful",
        "thought",
        "experiment",
        "granted",
        "justice",
        "worrying",
        "reliability",
        "philosophical",
        "thought",
        "experiment",
        "see",
        "eg",
        "klee",
        "might",
        "true",
        "ethic",
        "see",
        "dancy",
        "jackson",
        "wilson",
        "conceptual",
        "analysis",
        "see",
        "fodor",
        "philosophy",
        "mind",
        "popular",
        "strategy",
        "philosophy",
        "construct",
        "certain",
        "sort",
        "thought",
        "experiment",
        "call",
        "intuition",
        "pump",
        "intuition",
        "pump",
        "often",
        "abused",
        "though",
        "seldom",
        "deliberately",
        "dennett",
        "p",
        "claim",
        "dennett",
        "others",
        "thought",
        "experiment",
        "often",
        "rest",
        "prejudice",
        "faulty",
        "common",
        "sense",
        "inherently",
        "conservative",
        "real",
        "science",
        "likely",
        "result",
        "highlycounterintuitive",
        "outcome",
        "dennett",
        "belief",
        "thought",
        "experiment",
        "rest",
        "naive",
        "folk",
        "concept",
        "misguided",
        "far",
        "clear",
        "fair",
        "charge",
        "everything",
        "involved",
        "galileo",
        "thought",
        "experiment",
        "produced",
        "principle",
        "relativity",
        "could",
        "called",
        "folk",
        "concepts",
        "inside",
        "ship",
        "perform",
        "number",
        "experiment",
        "walking",
        "tossing",
        "ball",
        "watching",
        "bird",
        "fly",
        "could",
        "tell",
        "whether",
        "rest",
        "port",
        "sailing",
        "smooth",
        "sea",
        "upshot",
        "nature",
        "behaves",
        "either",
        "way",
        "law",
        "nature",
        "inertial",
        "frame",
        "result",
        "profound",
        "still",
        "u",
        "einstein",
        "relativity",
        "whether",
        "folk",
        "physic",
        "frequently",
        "discussed",
        "skeptical",
        "challenge",
        "raised",
        "kathleen",
        "wilkes",
        "express",
        "deep",
        "suspicion",
        "scenario",
        "derek",
        "parfit",
        "people",
        "splitting",
        "like",
        "amoeba",
        "see",
        "parfit",
        "gendler",
        "a",
        "wilkes",
        "want",
        "philosophy",
        "use",
        "science",
        "fact",
        "rather",
        "science",
        "fiction",
        "fantasy",
        "wilkes",
        "p",
        "therefore",
        "refrain",
        "using",
        "thought",
        "experiment",
        "problematic",
        "positively",
        "misleading",
        "wilkes",
        "p",
        "claim",
        "thought",
        "experiment",
        "personal",
        "identity",
        "particular",
        "often",
        "fail",
        "provide",
        "background",
        "condition",
        "experiment",
        "set",
        "see",
        "wilkes",
        "p",
        "think",
        "would",
        "know",
        "say",
        "encountered",
        "someone",
        "split",
        "like",
        "amoeba",
        "insists",
        "legitimate",
        "thought",
        "experiment",
        "must",
        "violate",
        "known",
        "law",
        "nature",
        "agree",
        "wilkes",
        "underdetermination",
        "problem",
        "instead",
        "dismissing",
        "thought",
        "experiment",
        "philosophy",
        "consider",
        "crucial",
        "factor",
        "assessing",
        "quality",
        "thought",
        "experiment",
        "see",
        "rescher",
        "pp",
        "say",
        "detailed",
        "imaginary",
        "scenario",
        "relevant",
        "aspect",
        "better",
        "thought",
        "experiment",
        "see",
        "brendel",
        "pp",
        "häggqvist",
        "p",
        "also",
        "agree",
        "inference",
        "drawn",
        "thought",
        "experimenting",
        "highly",
        "problematic",
        "hypothetical",
        "scenario",
        "inadequately",
        "described",
        "wilkes",
        "p",
        "wilkes",
        "seems",
        "think",
        "lack",
        "description",
        "unavoidable",
        "supposedly",
        "amount",
        "reason",
        "philosophical",
        "thought",
        "experiment",
        "personal",
        "identity",
        "person",
        "natural",
        "kind",
        "make",
        "impossible",
        "fill",
        "necessary",
        "information",
        "make",
        "thought",
        "experiment",
        "work",
        "given",
        "unavoidable",
        "underdetermination",
        "wilkes",
        "think",
        "whenever",
        "examining",
        "range",
        "concept",
        "pick",
        "natural",
        "kind",
        "problem",
        "deciding",
        "relevant",
        "success",
        "thought",
        "experiment",
        "yet",
        "problematic",
        "question",
        "arises",
        "science",
        "unlike",
        "scientific",
        "problem",
        "may",
        "even",
        "answer",
        "principle",
        "wilkes",
        "p",
        "add",
        "scientific",
        "law",
        "especially",
        "describing",
        "biological",
        "kind",
        "like",
        "human",
        "being",
        "disjoint",
        "independent",
        "detachable",
        "one",
        "another",
        "interrelated",
        "varying",
        "degree",
        "course",
        "wilkes",
        "p",
        "implies",
        "example",
        "full",
        "psychophysiological",
        "account",
        "process",
        "human",
        "perception",
        "must",
        "stage",
        "link",
        "part",
        "least",
        "linguistic",
        "ability",
        "typically",
        "see",
        "thing",
        "certain",
        "description",
        "description",
        "may",
        "sophisticated",
        "one",
        "wilkes",
        "p",
        "consideration",
        "rule",
        "experiment",
        "challenge",
        "human",
        "monopoly",
        "personhood",
        "thought",
        "experiment",
        "claim",
        "wilkes",
        "well",
        "conceived",
        "involves",
        "nonhuman",
        "animal",
        "computer",
        "person",
        "also",
        "thought",
        "experiment",
        "ruled",
        "involve",
        "fission",
        "fusion",
        "human",
        "theoretically",
        "possible",
        "total",
        "impact",
        "sum",
        "law",
        "group",
        "u",
        "together",
        "human",
        "being",
        "natural",
        "kind",
        "category",
        "precludes",
        "splitting",
        "two",
        "fusing",
        "someone",
        "else",
        "wilkes",
        "p",
        "one",
        "ascertain",
        "well",
        "inherent",
        "difficulty",
        "thinking",
        "personal",
        "identity",
        "limited",
        "benefit",
        "thought",
        "experiment",
        "might",
        "deemed",
        "proper",
        "metaphysics",
        "personal",
        "identity",
        "nevertheless",
        "good",
        "reason",
        "given",
        "favour",
        "use",
        "thought",
        "experiment",
        "personal",
        "identity",
        "see",
        "beck",
        "kolak",
        "hershenov",
        "also",
        "feel",
        "problem",
        "thought",
        "experiment",
        "personal",
        "identity",
        "reveal",
        "intricate",
        "nature",
        "subject",
        "usefulness",
        "philosophical",
        "thought",
        "experiment",
        "disregarding",
        "shortcoming",
        "wilkes",
        "skepticism",
        "discussion",
        "wilkes",
        "view",
        "see",
        "beck",
        "brook",
        "focquaert",
        "häggqvist",
        "pp",
        "suggestion",
        "thought",
        "experimental",
        "scenario",
        "would",
        "satisfy",
        "current",
        "scientific",
        "knowledge",
        "relevant",
        "entity",
        "featured",
        "thought",
        "experiment",
        "highly",
        "implausible",
        "learn",
        "great",
        "deal",
        "world",
        "theory",
        "wonder",
        "instance",
        "would",
        "happened",
        "big",
        "bang",
        "law",
        "gravity",
        "inverse",
        "cube",
        "law",
        "instead",
        "inverse",
        "square",
        "would",
        "star",
        "failed",
        "form",
        "reasoning",
        "scenario",
        "perfectly",
        "coherent",
        "instructive",
        "even",
        "though",
        "violates",
        "law",
        "nature",
        "extent",
        "share",
        "wilkes",
        "concern",
        "thought",
        "experimenting",
        "seems",
        "constrained",
        "relevant",
        "logical",
        "impossibility",
        "seems",
        "intuitively",
        "acceptable",
        "indeed",
        "problematic",
        "intuition",
        "highly",
        "misleading",
        "relevant",
        "logical",
        "impossibility",
        "fairly",
        "ungrounded",
        "supplemented",
        "relevant",
        "theoretical",
        "impossibility",
        "based",
        "current",
        "science",
        "order",
        "avoid",
        "jump",
        "futile",
        "fantasy",
        "order",
        "dismiss",
        "thought",
        "experimenting",
        "useful",
        "philosophical",
        "tool",
        "one",
        "show",
        "intuition",
        "source",
        "knowledge",
        "epistemic",
        "tool",
        "useless",
        "serious",
        "chance",
        "fail",
        "timothy",
        "williamson",
        "argued",
        "forget",
        "intuition",
        "cushion",
        "philosophical",
        "armchair",
        "see",
        "williamson",
        "a",
        "b",
        "pp",
        "see",
        "also",
        "schaffer",
        "importance",
        "intuition",
        "philosophy",
        "neglected",
        "past",
        "see",
        "williamson",
        "b",
        "p",
        "long",
        "intuition",
        "receive",
        "attention",
        "deserves",
        "see",
        "eg",
        "depaul",
        "ramsey",
        "ed",
        "besides",
        "traditional",
        "divide",
        "empiricist",
        "rationalist",
        "skeptic",
        "nonuniform",
        "use",
        "word",
        "intuition",
        "make",
        "difficult",
        "ass",
        "progress",
        "last",
        "year",
        "philosophical",
        "inquiry",
        "intuition",
        "situation",
        "complicated",
        "contribution",
        "experimental",
        "philosopher",
        "intuition",
        "add",
        "different",
        "reason",
        "question",
        "reliability",
        "see",
        "careful",
        "critique",
        "reason",
        "ludwig",
        "see",
        "also",
        "ludwig",
        "generally",
        "speaking",
        "reliability",
        "intuition",
        "challenged",
        "two",
        "ground",
        "one",
        "stem",
        "evolutionary",
        "explanation",
        "capacity",
        "intuit",
        "another",
        "due",
        "experiment",
        "supposedly",
        "show",
        "cultural",
        "relativity",
        "racial",
        "gender",
        "sensitivity",
        "intuition",
        "see",
        "eg",
        "buckwalter",
        "stich",
        "a",
        "substantial",
        "list",
        "philosophical",
        "intuition",
        "vary",
        "across",
        "demographic",
        "group",
        "andthey",
        "influenced",
        "number",
        "prima",
        "facie",
        "irrelevant",
        "factorssome",
        "writershave",
        "urged",
        "finding",
        "justify",
        "thoroughgoing",
        "skepticism",
        "use",
        "intuition",
        "evidence",
        "philosophybut",
        "think",
        "conclusion",
        "much",
        "strong",
        "stich",
        "toba",
        "p",
        "knowledge",
        "without",
        "intuition",
        "common",
        "sense",
        "assumption",
        "seems",
        "impossible",
        "recent",
        "discussion",
        "intuition",
        "epistemology",
        "barely",
        "made",
        "impact",
        "philosophical",
        "reflection",
        "thought",
        "experiment",
        "far",
        "philosophical",
        "thought",
        "experiment",
        "concerned",
        "according",
        "williamson",
        "respect",
        "george",
        "bealer",
        "cited",
        "support",
        "williamson",
        "bealer",
        "talk",
        "philosophical",
        "thought",
        "experiment",
        "reveals",
        "conceptual",
        "confusion",
        "philosophy",
        "claim",
        "rational",
        "intuition",
        "thought",
        "experiment",
        "physical",
        "intuition",
        "see",
        "bealer",
        "pp",
        "p",
        "many",
        "implausible",
        "claim",
        "based",
        "deeply",
        "problematic",
        "phenomenology",
        "intuition",
        "resulting",
        "strict",
        "separation",
        "rational",
        "intuition",
        "physical",
        "intuition",
        "ground",
        "alleged",
        "immutability",
        "rational",
        "intuition",
        "good",
        "reason",
        "believe",
        "thought",
        "experiment",
        "appeal",
        "intuition",
        "order",
        "give",
        "u",
        "new",
        "insight",
        "different",
        "realm",
        "investigation",
        "including",
        "philosophy",
        "kind",
        "positive",
        "connection",
        "williamson",
        "mind",
        "addressing",
        "role",
        "intuition",
        "philosophical",
        "thought",
        "experiment",
        "like",
        "famous",
        "gettier",
        "case",
        "overnight",
        "found",
        "acceptance",
        "philosophical",
        "community",
        "aim",
        "refute",
        "view",
        "knowledge",
        "justified",
        "true",
        "belief",
        "williamson",
        "expects",
        "armchair",
        "method",
        "play",
        "legitimately",
        "dominant",
        "role",
        "future",
        "philosophy",
        "williamson",
        "p",
        "think",
        "stop",
        "talking",
        "intuition",
        "williamson",
        "b",
        "p",
        "impress",
        "proponent",
        "call",
        "intuitionbased",
        "account",
        "thought",
        "experiment",
        "probably",
        "good",
        "reason",
        "given",
        "problem",
        "williamson",
        "approach",
        "see",
        "eg",
        "dohrn",
        "ichikawa",
        "jarvis",
        "schaffer",
        "strong",
        "empirical",
        "evidence",
        "favour",
        "positive",
        "role",
        "intuition",
        "play",
        "human",
        "cognition",
        "see",
        "myers"
    ]
}