{
    "main_text": "Method of Translation\n4. Method of Translation\n\n\nIbn Tibbon’s translations are generally literal. Unlike Judah\nal-Harizi, his rival translator, he was not concerned with felicity of\nstyle or purity of language but accuracy in meaning. Thus he uses\nrabbinic as well as biblical expressions, follows the syntax of the\nArabic, and coins new terms, based on the model of the Arabic. He was\ncriticized for this method—by al-Harizi and others—but it\nwas his method and terminology that ultimately won out and became\nauthoritative throughout the later middle ages.\n\n\nIbn Tibbon discusses the problems and difficulties of translation in\nseveral texts: The preface to the translation of the Guide,\nthe prologue to his “Letter on Providence,” the preface to\nthe glossary and the glossary itself, the preface to\nMeteorology, and the commentary on Ecclesiastes. What I would\nlike to do here is present a brief synthetic characterization of Ibn\nTibbon’s method of translation based on these sources. This subject is\nimportant for understanding the work of Ibn Tibbon and the process of\ncreating a philosophical culture in Hebrew.  Translating philosophy,\nmoreover, is a philosophical subject in its own right.\n\n\n1. Editing the text, comparing manuscripts\n\n\nThe first order of business in translating a text is the preparation\nof a reliable edition. Thus Ibn Tibbon, as critical scholar, made\nevery effort to collect and compare manuscripts of the texts on which\nhe worked. For example, in a brief introduction to his “Letter\non Providence,” he describes his efforts to eliminate\ncorruptions in his manuscript of the Guide by acquiring\nadditional copies and comparing them to his Vorlage. In the preface to\nthe Meteorology, similarly, he indicates that he had\nconsulted manuscripts of Aristotle’s work in Toledo and Barcelona, and\nhad studied the commentaries by Alexander, Avicenna, and Averroes, in\norder to help construct a more reliable text closer to the\noriginal.\n\n\n2. Consulting Arabic dictionaries\n\n\nIn the preface to the translation of the Guide, Ibn Tibbon\nexplains that, when confronted with difficult terms, he would consult\nArabic dictionaries. He does not say which dictionaries he consulted,\nbut a report by Todros Todrosi, in the preface to his\nfourteenth-century translation of Averroes’ Middle Commentary on\nAristotle’s Rhetoric (ed. J. Goldenthal, Leipzig, 1842,\np. 3), provides an exact reference: al-Khalil b. Ahmad’s\nKitab al-‘ayn. Todrosi’s report reads as\nfollows:\n\n\nThere was not sufficient power in our knowledge of the Arabic\nlanguage to produce this translation until God graced me with a\nnoble book which includes explanations of each Arabic word and its\ngrammar. It is called Sefer ha-‘Ayin. It is a book that\nthe noble sage, the greatest of translators, Rabbi Samuel Ibn Tibbon,\nmay his memory be for a blessing, made great effort to bring from\nIslamic lands.\n\n\n3. Consulting previous translations\n\n\nIn the preface to the translation of the Guide, Ibn Tibbon\nexplains that, in his translation of Maimonides, he had consulted\nprevious translations, rendered by his father and by others. Moreover,\nhe explains that, when a term already exists, he will follow\nestablished convention, even when he disagrees. One example of this\nambivalent deference to tradition is his definition of\n“logic” in the glossary. The text (from Perush\nha-Millot ha-Zarot, ed. Even-Shemuel, pp. 43-4; corrected by\nHebrew MS London 904, 164b) reads as follows:\n\n\nLogic [higgayon]: Some commentators have\nexplained [the rabbinic phrase] ‘keep your children from\nhiggayon’ [Ber. 28b] as referring to the\nscience called mantiq in Arabic. The Christians call it\n‘dialectic,’ [referring to the discipline as a whole] with\nthe name of one of its parts. I have followed the commentators [with\nrespect to this terminology] and call [logic] the ‘art of\nhiggayon.’ But in my view it would have been better had\nthey called it the ‘art of speech,’ following their\nopinion according to which they define man as ‘living and\nspeaking.’ Indeed, in my opinion, [logic] ought to be called the\n‘art of reason’.\n\n\n4. The use of Saadia’s Tafsir\n\n\nAnother important source of Ibn Tibbon’s translations is the\nArabic translation of the Bible by Saadia Gaon. This presented a ready\nlexicon of sorts for the translator: he could identify the Arabic term\nin Saadia’s Tafsir and replace it with the biblical term it\ntranslated. One example of Ibn Tibbon doing exactly this is found in\nhis glossary, in his discussion of the terms “definition”\nand “description.” His discussion, as found in the\nmanuscript versions (see Perush ha-Millot ha-Zarot, ed.\nEven-Shemuel, pp. 24-5, corrected by Hebrew MS London 904, 161b), is\nas follows:\n\n\nHaving explained the meaning of these five words [namely, the five\npredicables], I will attach to them the explanation of two additional\nterms, namely, geder, ‘definition,’ and\nhoq, ‘description’ … As for the term\nhoq, I do not remember having seen this term used in this way\nby any [previous translator], but I have seen that Rabbenu Saadia\ntranslated the biblical term hoq, as in the phrase hoq\nu-mishpat, ‘a statute and an ordinance’ [see\ne.g. Exod 15:25], as rasm; and similarly he translated\nhuqqay as rusûmî [see e.g. Ps\n50:16]. Because of this, I have translated the Arabic term\nrasm into Hebrew as hoq.\n\n\n5. Consultations with the author\n\n\nWhen all else failed—after consulting dictionaries and previous\ntranslations—Ibn Tibbon addressed his queries to the author\nhimself.  In fact, there is evidence that Ibn Tibbon wrote at least\nthree letters to Maimonides regarding translation and interpretation,\nand that he received at least two letters in response. But only Ibn\nTibbon’s “Letter on Providence” (which was mentioned\nbriefly above), and Maimonides’ “Letter on\nTranslation” survive.  Notable about the latter is that, despite\nIbn Tibbon’s efforts to consult with Maimonides, he generally\nignored the latter’s advice, and continued to follow the\ntranslation terminology and traditions of his father.\n\n\n6. Coining new terms\n\n\nOne of Ibn Tibbon’s most interesting discussions of translation\nis found in his preface to the glossary. There he lists and discusses\nsix types of “strange” or “foreign” terms used\nin his translation of the Guide: neologisms, rare words or\nphrases, derived terms, homonyms, terms created through calque, and\nnew compound expressions. In the preface to the commentary on\nEcclesiastes, he then provides a rare description of how he actually\ncoined a new term through calque. This description reads as\nfollows:\n\n\nHaving mentioned the inductive syllogism, I shall explain what I mean\nby ‘induction,’ when I use it here and elsewhere. I say:\nit seems to me that the philosophers borrowed the Arabic word, which I\nreplace with the Hebrew hippus, from the language of the\nmultitude, who use it to express a notion that resembles what the\nphilosophers intend when they use it. The notion for which the\nmultitude use this word, namely, istiqrâ’, is as\nfollows. They say: ‘I have examined [istaqraytu] a\ncertain land,’ that is, I have traveled through all of it,\nseeing the character [‘inyan] of each of its villages\nand cities. The philosophers then borrowed [this same term] to\nrepresent the examination [haqirah] of a single universal by\nknowing the intention [‘inyan] of each of its parts and\nspecies.  They called such an action istiqrâ’,\nderived a verb from it, and constructed whatever [grammatical forms]\nthey desired.  They said: ‘I have examined\nall of the particulars that are subsumed under a certain\nuniversal,’ that is, I have used the speculative method to pass\nthrough all of them, knowing in this way the intention\n[‘inyan] of each of them. I did not find a single word\nin our language closer to this meaning than hippus, even\nthough the Arabic word, unlike the Hebrew hippus, implies not\nonly the examination of a notion but knowledge of the notion\nexamined.\n\n\n7. Defense of translation\n\n\nAfter completing the first version of the Guide, Judah\nal-Harizi produced a rival translation, apparently at the request of\nsome sages from southern France. al-Harizi’s translation was\nwritten elegantly and in Biblical Hebrew; its goal was to be readable\nand accessible. Ibn Tibbon issued his revised translation, with\nglossary, in response to this challenge. Thus in the preface to the\nglossary he focuses on defending his own work and undermining the work\nof his rival. He exposes al-Harizi’s ignorance of philosophy and\nhighlights his own mastery of the subject matter of the Guide\nand sensitivity to the difficulties of translation.\n\n\nIn the preface to the commentary on Ecclesiastes, Ibn Tibbon also\nseems to provide explanation why the literal translation of\nphilosophical texts is superior. There he emphasizes the importance of\nword order in the construction of meaning. Drawing from the rhetorical\ntradition of “delivery,” he likens a written text to a\nspeech: it uses certain literary devices to imitate gesture, voice,\nand facial expression. The text, describing the method of transmitting\nwisdom through “chapter headings,” reads as follows:\n\n\n[This method of teaching through ‘chapter headings’] can\nbe done orally and in person; it may even be easy for sages and men of\nunderstanding to do this; for the wise instructor has available many\nstratagems, digressions, and circumlocutions with which he can make\nthe understanding student understand his purpose, even when his\npurpose is not made clear or explained. But he cannot do this when\nwriting in a book. A man, for example, might say to his associate:\n‘you did really well when you did that thing,’ while the\nperson addressed will understand that in the former’s opinion\nwhat he did was really bad. This he understands not from the words\nthemselves, which are contrary to the speaker’s purpose, but\nfrom certain affectations and accidents of speech, such as the\nappearance of the speaker’s face, which may become red or green\nlike that of an angry man, or his tone of voice; that is, rather than\nsaying something in a gentle tone, in accordance with the manners of\nspeech used by someone speaking straightforward, such a person would\nspeak [using the tone] of someone who is speaking about something that\nhe considers bad. [The listener can also understand his\ninterlocutor’s purpose] from other things that [the speaker]\nmight attach to the words or attach the words thereto. Many examples\nof this type have been enumerated by the logicians.\n\n\nIbn Tibbon proceeds to discuss the ways to do this in a written\ntext, using rhetorical and poetic devices. The implication for\ntranslation is as follows: any change in the form of a text will have\nserious impact on its meaning.\n",
    "section_title": "4. Method of Translation",
    "entry_title": "Samuel Ibn Tibbon",
    "hierarchy_title": "Samuel Ibn Tibbon || Method of Translation",
    "tokenized_text": [
        "method",
        "translation",
        "method",
        "translation",
        "ibn",
        "tibbon",
        "translation",
        "generally",
        "literal",
        "unlike",
        "judah",
        "alharizi",
        "rival",
        "translator",
        "concerned",
        "felicity",
        "style",
        "purity",
        "language",
        "accuracy",
        "meaning",
        "thus",
        "us",
        "rabbinic",
        "well",
        "biblical",
        "expression",
        "follows",
        "syntax",
        "arabic",
        "coin",
        "new",
        "term",
        "based",
        "model",
        "arabic",
        "criticized",
        "methodby",
        "alharizi",
        "othersbut",
        "method",
        "terminology",
        "ultimately",
        "became",
        "authoritative",
        "throughout",
        "later",
        "middle",
        "age",
        "ibn",
        "tibbon",
        "discus",
        "problem",
        "difficulty",
        "translation",
        "several",
        "text",
        "preface",
        "translation",
        "guide",
        "prologue",
        "letter",
        "providence",
        "preface",
        "glossary",
        "glossary",
        "preface",
        "meteorology",
        "commentary",
        "ecclesiastes",
        "would",
        "like",
        "present",
        "brief",
        "synthetic",
        "characterization",
        "ibn",
        "tibbon",
        "method",
        "translation",
        "based",
        "source",
        "subject",
        "important",
        "understanding",
        "work",
        "ibn",
        "tibbon",
        "process",
        "creating",
        "philosophical",
        "culture",
        "hebrew",
        "translating",
        "philosophy",
        "moreover",
        "philosophical",
        "subject",
        "right",
        "editing",
        "text",
        "comparing",
        "manuscript",
        "first",
        "order",
        "business",
        "translating",
        "text",
        "preparation",
        "reliable",
        "edition",
        "thus",
        "ibn",
        "tibbon",
        "critical",
        "scholar",
        "made",
        "every",
        "effort",
        "collect",
        "compare",
        "manuscript",
        "text",
        "worked",
        "example",
        "brief",
        "introduction",
        "letter",
        "providence",
        "describes",
        "effort",
        "eliminate",
        "corruption",
        "manuscript",
        "guide",
        "acquiring",
        "additional",
        "copy",
        "comparing",
        "vorlage",
        "preface",
        "meteorology",
        "similarly",
        "indicates",
        "consulted",
        "manuscript",
        "aristotle",
        "work",
        "toledo",
        "barcelona",
        "studied",
        "commentary",
        "alexander",
        "avicenna",
        "averroes",
        "order",
        "help",
        "construct",
        "reliable",
        "text",
        "closer",
        "original",
        "consulting",
        "arabic",
        "dictionary",
        "preface",
        "translation",
        "guide",
        "ibn",
        "tibbon",
        "explains",
        "confronted",
        "difficult",
        "term",
        "would",
        "consult",
        "arabic",
        "dictionary",
        "say",
        "dictionary",
        "consulted",
        "report",
        "todros",
        "todrosi",
        "preface",
        "fourteenthcentury",
        "translation",
        "averroes",
        "middle",
        "commentary",
        "aristotle",
        "rhetoric",
        "ed",
        "j",
        "goldenthal",
        "leipzig",
        "p",
        "provides",
        "exact",
        "reference",
        "alkhalil",
        "b",
        "ahmad",
        "kitab",
        "al",
        "ayn",
        "todrosi",
        "report",
        "read",
        "follows",
        "sufficient",
        "power",
        "knowledge",
        "arabic",
        "language",
        "produce",
        "translation",
        "god",
        "graced",
        "noble",
        "book",
        "includes",
        "explanation",
        "arabic",
        "word",
        "grammar",
        "called",
        "sefer",
        "ha",
        "ayin",
        "book",
        "noble",
        "sage",
        "greatest",
        "translator",
        "rabbi",
        "samuel",
        "ibn",
        "tibbon",
        "may",
        "memory",
        "blessing",
        "made",
        "great",
        "effort",
        "bring",
        "islamic",
        "land",
        "consulting",
        "previous",
        "translation",
        "preface",
        "translation",
        "guide",
        "ibn",
        "tibbon",
        "explains",
        "translation",
        "maimonides",
        "consulted",
        "previous",
        "translation",
        "rendered",
        "father",
        "others",
        "moreover",
        "explains",
        "term",
        "already",
        "exists",
        "follow",
        "established",
        "convention",
        "even",
        "disagrees",
        "one",
        "example",
        "ambivalent",
        "deference",
        "tradition",
        "definition",
        "logic",
        "glossary",
        "text",
        "perush",
        "hamillot",
        "hazarot",
        "ed",
        "evenshemuel",
        "pp",
        "corrected",
        "hebrew",
        "m",
        "london",
        "b",
        "read",
        "follows",
        "logic",
        "higgayon",
        "commentator",
        "explained",
        "rabbinic",
        "phrase",
        "keep",
        "child",
        "higgayon",
        "ber",
        "b",
        "referring",
        "science",
        "called",
        "mantiq",
        "arabic",
        "christian",
        "call",
        "dialectic",
        "referring",
        "discipline",
        "whole",
        "name",
        "one",
        "part",
        "followed",
        "commentator",
        "respect",
        "terminology",
        "call",
        "logic",
        "art",
        "higgayon",
        "view",
        "would",
        "better",
        "called",
        "art",
        "speech",
        "following",
        "opinion",
        "according",
        "define",
        "man",
        "living",
        "speaking",
        "indeed",
        "opinion",
        "logic",
        "ought",
        "called",
        "art",
        "reason",
        "use",
        "saadia",
        "tafsir",
        "another",
        "important",
        "source",
        "ibn",
        "tibbon",
        "translation",
        "arabic",
        "translation",
        "bible",
        "saadia",
        "gaon",
        "presented",
        "ready",
        "lexicon",
        "sort",
        "translator",
        "could",
        "identify",
        "arabic",
        "term",
        "saadia",
        "tafsir",
        "replace",
        "biblical",
        "term",
        "translated",
        "one",
        "example",
        "ibn",
        "tibbon",
        "exactly",
        "found",
        "glossary",
        "discussion",
        "term",
        "definition",
        "description",
        "discussion",
        "found",
        "manuscript",
        "version",
        "see",
        "perush",
        "hamillot",
        "hazarot",
        "ed",
        "evenshemuel",
        "pp",
        "corrected",
        "hebrew",
        "m",
        "london",
        "b",
        "follows",
        "explained",
        "meaning",
        "five",
        "word",
        "namely",
        "five",
        "predicables",
        "attach",
        "explanation",
        "two",
        "additional",
        "term",
        "namely",
        "geder",
        "definition",
        "hoq",
        "description",
        "term",
        "hoq",
        "remember",
        "seen",
        "term",
        "used",
        "way",
        "previous",
        "translator",
        "seen",
        "rabbenu",
        "saadia",
        "translated",
        "biblical",
        "term",
        "hoq",
        "phrase",
        "hoq",
        "umishpat",
        "statute",
        "ordinance",
        "see",
        "eg",
        "exod",
        "rasm",
        "similarly",
        "translated",
        "huqqay",
        "rusûmî",
        "see",
        "eg",
        "p",
        "translated",
        "arabic",
        "term",
        "rasm",
        "hebrew",
        "hoq",
        "consultation",
        "author",
        "else",
        "failedafter",
        "consulting",
        "dictionary",
        "previous",
        "translationsibn",
        "tibbon",
        "addressed",
        "query",
        "author",
        "fact",
        "evidence",
        "ibn",
        "tibbon",
        "wrote",
        "least",
        "three",
        "letter",
        "maimonides",
        "regarding",
        "translation",
        "interpretation",
        "received",
        "least",
        "two",
        "letter",
        "response",
        "ibn",
        "tibbon",
        "letter",
        "providence",
        "mentioned",
        "briefly",
        "maimonides",
        "letter",
        "translation",
        "survive",
        "notable",
        "latter",
        "despite",
        "ibn",
        "tibbon",
        "effort",
        "consult",
        "maimonides",
        "generally",
        "ignored",
        "latter",
        "advice",
        "continued",
        "follow",
        "translation",
        "terminology",
        "tradition",
        "father",
        "coining",
        "new",
        "term",
        "one",
        "ibn",
        "tibbon",
        "interesting",
        "discussion",
        "translation",
        "found",
        "preface",
        "glossary",
        "list",
        "discus",
        "six",
        "type",
        "strange",
        "foreign",
        "term",
        "used",
        "translation",
        "guide",
        "neologism",
        "rare",
        "word",
        "phrase",
        "derived",
        "term",
        "homonym",
        "term",
        "created",
        "calque",
        "new",
        "compound",
        "expression",
        "preface",
        "commentary",
        "ecclesiastes",
        "provides",
        "rare",
        "description",
        "actually",
        "coined",
        "new",
        "term",
        "calque",
        "description",
        "read",
        "follows",
        "mentioned",
        "inductive",
        "syllogism",
        "shall",
        "explain",
        "mean",
        "induction",
        "use",
        "elsewhere",
        "say",
        "seems",
        "philosopher",
        "borrowed",
        "arabic",
        "word",
        "replace",
        "hebrew",
        "hippus",
        "language",
        "multitude",
        "use",
        "express",
        "notion",
        "resembles",
        "philosopher",
        "intend",
        "use",
        "notion",
        "multitude",
        "use",
        "word",
        "namely",
        "istiqrâ",
        "follows",
        "say",
        "examined",
        "istaqraytu",
        "certain",
        "land",
        "traveled",
        "seeing",
        "character",
        "inyan",
        "village",
        "city",
        "philosopher",
        "borrowed",
        "term",
        "represent",
        "examination",
        "haqirah",
        "single",
        "universal",
        "knowing",
        "intention",
        "inyan",
        "part",
        "specie",
        "called",
        "action",
        "istiqrâ",
        "derived",
        "verb",
        "constructed",
        "whatever",
        "grammatical",
        "form",
        "desired",
        "said",
        "examined",
        "particular",
        "subsumed",
        "certain",
        "universal",
        "used",
        "speculative",
        "method",
        "pas",
        "knowing",
        "way",
        "intention",
        "inyan",
        "find",
        "single",
        "word",
        "language",
        "closer",
        "meaning",
        "hippus",
        "even",
        "though",
        "arabic",
        "word",
        "unlike",
        "hebrew",
        "hippus",
        "implies",
        "examination",
        "notion",
        "knowledge",
        "notion",
        "examined",
        "defense",
        "translation",
        "completing",
        "first",
        "version",
        "guide",
        "judah",
        "alharizi",
        "produced",
        "rival",
        "translation",
        "apparently",
        "request",
        "sage",
        "southern",
        "france",
        "alharizi",
        "translation",
        "written",
        "elegantly",
        "biblical",
        "hebrew",
        "goal",
        "readable",
        "accessible",
        "ibn",
        "tibbon",
        "issued",
        "revised",
        "translation",
        "glossary",
        "response",
        "challenge",
        "thus",
        "preface",
        "glossary",
        "focus",
        "defending",
        "work",
        "undermining",
        "work",
        "rival",
        "expose",
        "alharizi",
        "ignorance",
        "philosophy",
        "highlight",
        "mastery",
        "subject",
        "matter",
        "guide",
        "sensitivity",
        "difficulty",
        "translation",
        "preface",
        "commentary",
        "ecclesiastes",
        "ibn",
        "tibbon",
        "also",
        "seems",
        "provide",
        "explanation",
        "literal",
        "translation",
        "philosophical",
        "text",
        "superior",
        "emphasizes",
        "importance",
        "word",
        "order",
        "construction",
        "meaning",
        "drawing",
        "rhetorical",
        "tradition",
        "delivery",
        "likens",
        "written",
        "text",
        "speech",
        "us",
        "certain",
        "literary",
        "device",
        "imitate",
        "gesture",
        "voice",
        "facial",
        "expression",
        "text",
        "describing",
        "method",
        "transmitting",
        "wisdom",
        "chapter",
        "heading",
        "read",
        "follows",
        "method",
        "teaching",
        "chapter",
        "heading",
        "done",
        "orally",
        "person",
        "may",
        "even",
        "easy",
        "sage",
        "men",
        "understanding",
        "wise",
        "instructor",
        "available",
        "many",
        "stratagem",
        "digression",
        "circumlocution",
        "make",
        "understanding",
        "student",
        "understand",
        "purpose",
        "even",
        "purpose",
        "made",
        "clear",
        "explained",
        "writing",
        "book",
        "man",
        "example",
        "might",
        "say",
        "associate",
        "really",
        "well",
        "thing",
        "person",
        "addressed",
        "understand",
        "former",
        "opinion",
        "really",
        "bad",
        "understands",
        "word",
        "contrary",
        "speaker",
        "purpose",
        "certain",
        "affectation",
        "accident",
        "speech",
        "appearance",
        "speaker",
        "face",
        "may",
        "become",
        "red",
        "green",
        "like",
        "angry",
        "man",
        "tone",
        "voice",
        "rather",
        "saying",
        "something",
        "gentle",
        "tone",
        "accordance",
        "manner",
        "speech",
        "used",
        "someone",
        "speaking",
        "straightforward",
        "person",
        "would",
        "speak",
        "using",
        "tone",
        "someone",
        "speaking",
        "something",
        "considers",
        "bad",
        "listener",
        "also",
        "understand",
        "interlocutor",
        "purpose",
        "thing",
        "speaker",
        "might",
        "attach",
        "word",
        "attach",
        "word",
        "thereto",
        "many",
        "example",
        "type",
        "enumerated",
        "logician",
        "ibn",
        "tibbon",
        "proceeds",
        "discus",
        "way",
        "written",
        "text",
        "using",
        "rhetorical",
        "poetic",
        "device",
        "implication",
        "translation",
        "follows",
        "change",
        "form",
        "text",
        "serious",
        "impact",
        "meaning"
    ]
}