{
    "main_text": "The Problem of the Direction of Time I || Cosmology\n2.3 Cosmology\n\nCosmology presents us with a number of apparently temporally\nasymmetric mechanisms. The most obvious one is the inexorable\nexpansion of the universe. The spatial scale factor \\(a(t)\\), which we\nmight conceive roughly as the radius of the universe (it gives the\ndistance between co-moving observers), is increasing. The universe\nseems to be uniformly expanding relative to our local frame. Since\nthis temporal asymmetry occupies a rather unique status it is natural\nto wonder whether it might be the “master” arrow.\n\nThe cosmologist Thomas Gold 1962 proposed just this. Believing that\nentropy values covary with the size of the universe, Gold asserts that\nat the maximum radius the thermodynamic arrow will “flip”\ndue to the re-contraction. However, as Richard Tolman 1934 has shown\nin some detail, a universe filled with non-relativistic particles will\nnot suffer entropy increase due to expansion, nor will an expanding\nuniverse uniformly filled with blackbody radiation increase its\nentropy either. Interestingly, Tolman demonstrated that more realistic\nuniverses containing both matter and radiation will change\ntheir entropy contents. Coupled with expansion, various processes will\ncontribute to entropy increase, e.g., energy will flow from the\n“hot” radiation to the “cool” matter. So long\nas the relaxation time of these processes is larger than the expansion\ntime scale, they should generate entropy. We thus have a purely\ncosmological method of entropy generation.\n\nOthers (e.g., Davies 1994) have thought inflation provides a kind of\nentropy-increasing behavior—again, given the sort of matter\ncontent we have in our universe. The inflationary model is an\nalternative of sorts to the standard big bang model, although by now\nit is so well entrenched in the cosmology community that it really\ndeserves the tag “standard”. In this scenario, the\nuniverse is very early in a quantum state called a “false\nvacuum”, a state with a very high energy density and negative\npressure. Gravity acts like Einstein’s cosmological constant, so\nthat it is repulsive rather than attractive. Under this force the\nuniverse enters a period of exponential inflation, with geometry\nresembling de Sitter space. When this period ends any initial\ninhomogeneities will have been smoothed to insignificance. At this\npoint ordinary stellar evolution begins. Loosely associating\ngravitational homogeneity with low-entropy and inhomogeneity with\nhigher entropy, inflation is arguably a source of a low entropy\n“initial” condition.\n\nThere are other proposed sources of cosmological entropy generation,\nbut these should suffice to give the reader a flavor of the idea. We\nshall not be concerned with evaluating these scenarios in any detail.\nRather, our concern is about how these proposals explain time’s\narrow. In particular, how do they square with our earlier claim that\nthe issue boils down to either assuming temporally asymmetric boundary\nconditions or of adding time reversal non-invariant laws of\nnature?\n\nThe answer is not always clear, owing in part to the fact that the\nseparation between laws of nature and boundary conditions is\nespecially slippery in the science of cosmology. Advocates of the\ncosmological explanation of time’s arrow typically see\nthemselves as explaining the origin of the needed low-entropy\ncosmological condition. Some explicitly state that special initial\nconditions are needed for the thermodynamic arrow, but differ with the\nconventional “statistical” school in deducing the origin\nof these initial conditions. Earlier low-entropy conditions are not\nviewed as the boundary conditions of the spacetime. They came about,\naccording to the cosmological schools, about a second or more after\nthe big bang. But when the universe is the size of a small particle, a\nsecond or more is enough time for some kind of cosmological mechanism\nto bring about our low-entropy “initial” condition. What\ncosmologists (primarily) differ about is the precise nature of this\nmechanism. Once the mechanism creates the “initial”\nlow-entropy we have the same sort of explanation of the thermodynamic\nasymmetry as discussed in the previous section. Because the proposed\nmechanisms are supposed to make the special initial conditions\ninevitable or at least highly probable, this maneuver seems like the\nalleged “third way” mentioned above.\n\nThe central question about this type of explanation, as far as\nwe’re concerned, is this: Is the existence of the low\n“initial” state a consequence of the laws of nature alone\nor the laws plus boundary conditions? In other words, first, does the\nproposed mechanism produce low-entropy states given any\ninitial condition, and second, is it a consequence of the\nlaws alone or a consequence of the laws plus initial\nconditions? We want to know whether our question has merely been\nshifted back a step, whether the explanation is a disguised appeal to\nspecial initial conditions. Though we cannot here answer the question\nin general, we can say that the two mechanisms mentioned are not\nlawlike in nature. Expansion fails on two counts. There are boundary\nconditions in expanding universes that do not lead to an entropy\ngradient, i.e., conditions without the right matter-radiation content,\nand there are boundary conditions that do not lead to expansion in\nwhich entropy nonetheless increases, e.g., matter-filled Friedmann\nmodels that do not expand. Inflation fails at least on the second\ncount. Despite advertising, arbitrary initial conditions will not give\nrise to an inflationary period. Furthermore, it’s not clear that\ninflationary periods will give rise to thermodynamic asymmetries\n(Price 1996: ch. 2). The cosmological scenarios do not seem to make\nthe thermodynamic asymmetries a result of nomic necessity. The\ncosmological hypotheses may be true, and in some sense, they may even\nexplain the low-entropy initial state. But they do not appear to\nprovide an explanation of the thermodynamic asymmetry that makes it\nnomologically necessary or even likely.\n\nAnother way to see the point is to consider the question of whether\nthe thermodynamic arrow would “flip” if (say) the universe\nstarted to contract. Gold, as we said above, asserts that at the\nmaximum radius the thermodynamic arrow must “flip” due to\nthe re-contraction. Not positing a thermodynamic flip while\nmaintaining that entropy values covary with the radius of the universe\nis clearly inconsistent—it is what Price (1996) calls the\nfallacy of a “temporal double standard”. Gold does not\ncommit this fallacy, and so he claims that the entropy must decrease\nif ever the universe started to re-contract. However, as Albert\nwrites,\n\n\nthere are plainly locations in the phase space of the world from which\n… the world’s radius will inexorably head up and the\nworld’s entropy will inexorably head down. (2000: 90)\n\n\nSince that is the case, it doesn’t follow from law that the\nthermodynamic arrow will flip during re-contraction; therefore,\nwithout changing the fundamental laws, the Gold mechanism cannot\nexplain the thermodynamic arrow in the sense we want.\n\nFrom these considerations we can understand the basic dilemma\nthat runs throughout Price (1995, 1996): either we explain the earlier\nlow-entropy condition Gold-style or it is inexplicable by\ntime-symmetric physics. Because there is no net asymmetry in a Gold\nuniverse, we might paraphrase Price’s conclusion in a more\ndisturbing manner as the claim that the (local) thermodynamic arrow is\nexplicable just in case (globally) there isn’t one. However,\nnotice that this remark leaves open the idea that the laws governing\nexpansion or inflation are not time reversal invariant. (For more on\nPrice’s basic dilemma, see Callender 1998 and Price 1995.)\n\nFinally, it’s important to remember that this dilemma and the\nneed for a Past Hypothesis are dependent upon a particular physical\nset-up. Can we explain the thermodynamic arrow without invoking a Past\nHypothesis? Inspired by the idea of eternal spontaneous inflation,\nCarroll and Chen (2004, Other Internet Resources) describe a model in\nwhich new baby universes (or “pocket universes”) are\nrepeatedly born from existing universes. Each birth increases the\noverall entropy of the multiverse although within each baby universe\nwe have our familiar thermodynamic asymmetry. The crucial assumption\nin this model – one also found in the gravitational theory of\nBarbour, Koslowski, and Mercati (2014) – is that entropy is\nunbound. It can be arbitrarily high. With this assumption and in these\nmodels, one can do without a past Hypothesis. For discussion, see\nGoldstein, Tumulka, & Zanghi 2016 and Lazarovici and Reichert\n2020.\n",
    "section_title": "2.3 Cosmology",
    "entry_title": "Thermodynamic Asymmetry in Time",
    "hierarchy_title": "Thermodynamic Asymmetry in Time || The Problem of the Direction of Time I || Cosmology",
    "tokenized_text": [
        "problem",
        "direction",
        "time",
        "cosmology",
        "cosmology",
        "cosmology",
        "present",
        "u",
        "number",
        "apparently",
        "temporally",
        "asymmetric",
        "mechanism",
        "obvious",
        "one",
        "inexorable",
        "expansion",
        "universe",
        "spatial",
        "scale",
        "factor",
        "might",
        "conceive",
        "roughly",
        "radius",
        "universe",
        "give",
        "distance",
        "comoving",
        "observer",
        "increasing",
        "universe",
        "seems",
        "uniformly",
        "expanding",
        "relative",
        "local",
        "frame",
        "since",
        "temporal",
        "asymmetry",
        "occupies",
        "rather",
        "unique",
        "status",
        "natural",
        "wonder",
        "whether",
        "might",
        "master",
        "arrow",
        "cosmologist",
        "thomas",
        "gold",
        "proposed",
        "believing",
        "entropy",
        "value",
        "covary",
        "size",
        "universe",
        "gold",
        "asserts",
        "maximum",
        "radius",
        "thermodynamic",
        "arrow",
        "flip",
        "due",
        "recontraction",
        "however",
        "richard",
        "tolman",
        "shown",
        "detail",
        "universe",
        "filled",
        "nonrelativistic",
        "particle",
        "suffer",
        "entropy",
        "increase",
        "due",
        "expansion",
        "expanding",
        "universe",
        "uniformly",
        "filled",
        "blackbody",
        "radiation",
        "increase",
        "entropy",
        "either",
        "interestingly",
        "tolman",
        "demonstrated",
        "realistic",
        "universe",
        "containing",
        "matter",
        "radiation",
        "change",
        "entropy",
        "content",
        "coupled",
        "expansion",
        "various",
        "process",
        "contribute",
        "entropy",
        "increase",
        "eg",
        "energy",
        "flow",
        "hot",
        "radiation",
        "cool",
        "matter",
        "long",
        "relaxation",
        "time",
        "process",
        "larger",
        "expansion",
        "time",
        "scale",
        "generate",
        "entropy",
        "thus",
        "purely",
        "cosmological",
        "method",
        "entropy",
        "generation",
        "others",
        "eg",
        "davy",
        "thought",
        "inflation",
        "provides",
        "kind",
        "entropyincreasing",
        "behavioragain",
        "given",
        "sort",
        "matter",
        "content",
        "universe",
        "inflationary",
        "model",
        "alternative",
        "sort",
        "standard",
        "big",
        "bang",
        "model",
        "although",
        "well",
        "entrenched",
        "cosmology",
        "community",
        "really",
        "deserves",
        "tag",
        "standard",
        "scenario",
        "universe",
        "early",
        "quantum",
        "state",
        "called",
        "false",
        "vacuum",
        "state",
        "high",
        "energy",
        "density",
        "negative",
        "pressure",
        "gravity",
        "act",
        "like",
        "einstein",
        "cosmological",
        "constant",
        "repulsive",
        "rather",
        "attractive",
        "force",
        "universe",
        "enters",
        "period",
        "exponential",
        "inflation",
        "geometry",
        "resembling",
        "de",
        "sitter",
        "space",
        "period",
        "end",
        "initial",
        "inhomogeneity",
        "smoothed",
        "insignificance",
        "point",
        "ordinary",
        "stellar",
        "evolution",
        "begin",
        "loosely",
        "associating",
        "gravitational",
        "homogeneity",
        "lowentropy",
        "inhomogeneity",
        "higher",
        "entropy",
        "inflation",
        "arguably",
        "source",
        "low",
        "entropy",
        "initial",
        "condition",
        "proposed",
        "source",
        "cosmological",
        "entropy",
        "generation",
        "suffice",
        "give",
        "reader",
        "flavor",
        "idea",
        "shall",
        "concerned",
        "evaluating",
        "scenario",
        "detail",
        "rather",
        "concern",
        "proposal",
        "explain",
        "time",
        "arrow",
        "particular",
        "square",
        "earlier",
        "claim",
        "issue",
        "boil",
        "either",
        "assuming",
        "temporally",
        "asymmetric",
        "boundary",
        "condition",
        "adding",
        "time",
        "reversal",
        "noninvariant",
        "law",
        "nature",
        "answer",
        "always",
        "clear",
        "owing",
        "part",
        "fact",
        "separation",
        "law",
        "nature",
        "boundary",
        "condition",
        "especially",
        "slippery",
        "science",
        "cosmology",
        "advocate",
        "cosmological",
        "explanation",
        "time",
        "arrow",
        "typically",
        "see",
        "explaining",
        "origin",
        "needed",
        "lowentropy",
        "cosmological",
        "condition",
        "explicitly",
        "state",
        "special",
        "initial",
        "condition",
        "needed",
        "thermodynamic",
        "arrow",
        "differ",
        "conventional",
        "statistical",
        "school",
        "deducing",
        "origin",
        "initial",
        "condition",
        "earlier",
        "lowentropy",
        "condition",
        "viewed",
        "boundary",
        "condition",
        "spacetime",
        "came",
        "according",
        "cosmological",
        "school",
        "second",
        "big",
        "bang",
        "universe",
        "size",
        "small",
        "particle",
        "second",
        "enough",
        "time",
        "kind",
        "cosmological",
        "mechanism",
        "bring",
        "lowentropy",
        "initial",
        "condition",
        "cosmologist",
        "primarily",
        "differ",
        "precise",
        "nature",
        "mechanism",
        "mechanism",
        "creates",
        "initial",
        "lowentropy",
        "sort",
        "explanation",
        "thermodynamic",
        "asymmetry",
        "discussed",
        "previous",
        "section",
        "proposed",
        "mechanism",
        "supposed",
        "make",
        "special",
        "initial",
        "condition",
        "inevitable",
        "least",
        "highly",
        "probable",
        "maneuver",
        "seems",
        "like",
        "alleged",
        "third",
        "way",
        "mentioned",
        "central",
        "question",
        "type",
        "explanation",
        "far",
        "concerned",
        "existence",
        "low",
        "initial",
        "state",
        "consequence",
        "law",
        "nature",
        "alone",
        "law",
        "plus",
        "boundary",
        "condition",
        "word",
        "first",
        "proposed",
        "mechanism",
        "produce",
        "lowentropy",
        "state",
        "given",
        "initial",
        "condition",
        "second",
        "consequence",
        "law",
        "alone",
        "consequence",
        "law",
        "plus",
        "initial",
        "condition",
        "want",
        "know",
        "whether",
        "question",
        "merely",
        "shifted",
        "back",
        "step",
        "whether",
        "explanation",
        "disguised",
        "appeal",
        "special",
        "initial",
        "condition",
        "though",
        "answer",
        "question",
        "general",
        "say",
        "two",
        "mechanism",
        "mentioned",
        "lawlike",
        "nature",
        "expansion",
        "fails",
        "two",
        "count",
        "boundary",
        "condition",
        "expanding",
        "universe",
        "lead",
        "entropy",
        "gradient",
        "ie",
        "condition",
        "without",
        "right",
        "matterradiation",
        "content",
        "boundary",
        "condition",
        "lead",
        "expansion",
        "entropy",
        "nonetheless",
        "increase",
        "eg",
        "matterfilled",
        "friedmann",
        "model",
        "expand",
        "inflation",
        "fails",
        "least",
        "second",
        "count",
        "despite",
        "advertising",
        "arbitrary",
        "initial",
        "condition",
        "give",
        "rise",
        "inflationary",
        "period",
        "furthermore",
        "clear",
        "inflationary",
        "period",
        "give",
        "rise",
        "thermodynamic",
        "asymmetry",
        "price",
        "ch",
        "cosmological",
        "scenario",
        "seem",
        "make",
        "thermodynamic",
        "asymmetry",
        "result",
        "nomic",
        "necessity",
        "cosmological",
        "hypothesis",
        "may",
        "true",
        "sense",
        "may",
        "even",
        "explain",
        "lowentropy",
        "initial",
        "state",
        "appear",
        "provide",
        "explanation",
        "thermodynamic",
        "asymmetry",
        "make",
        "nomologically",
        "necessary",
        "even",
        "likely",
        "another",
        "way",
        "see",
        "point",
        "consider",
        "question",
        "whether",
        "thermodynamic",
        "arrow",
        "would",
        "flip",
        "say",
        "universe",
        "started",
        "contract",
        "gold",
        "said",
        "asserts",
        "maximum",
        "radius",
        "thermodynamic",
        "arrow",
        "must",
        "flip",
        "due",
        "recontraction",
        "positing",
        "thermodynamic",
        "flip",
        "maintaining",
        "entropy",
        "value",
        "covary",
        "radius",
        "universe",
        "clearly",
        "inconsistentit",
        "price",
        "call",
        "fallacy",
        "temporal",
        "double",
        "standard",
        "gold",
        "commit",
        "fallacy",
        "claim",
        "entropy",
        "must",
        "decrease",
        "ever",
        "universe",
        "started",
        "recontract",
        "however",
        "albert",
        "writes",
        "plainly",
        "location",
        "phase",
        "space",
        "world",
        "world",
        "radius",
        "inexorably",
        "head",
        "world",
        "entropy",
        "inexorably",
        "head",
        "since",
        "case",
        "follow",
        "law",
        "thermodynamic",
        "arrow",
        "flip",
        "recontraction",
        "therefore",
        "without",
        "changing",
        "fundamental",
        "law",
        "gold",
        "mechanism",
        "explain",
        "thermodynamic",
        "arrow",
        "sense",
        "want",
        "consideration",
        "understand",
        "basic",
        "dilemma",
        "run",
        "throughout",
        "price",
        "either",
        "explain",
        "earlier",
        "lowentropy",
        "condition",
        "goldstyle",
        "inexplicable",
        "timesymmetric",
        "physic",
        "net",
        "asymmetry",
        "gold",
        "universe",
        "might",
        "paraphrase",
        "price",
        "conclusion",
        "disturbing",
        "manner",
        "claim",
        "local",
        "thermodynamic",
        "arrow",
        "explicable",
        "case",
        "globally",
        "one",
        "however",
        "notice",
        "remark",
        "leaf",
        "open",
        "idea",
        "law",
        "governing",
        "expansion",
        "inflation",
        "time",
        "reversal",
        "invariant",
        "price",
        "basic",
        "dilemma",
        "see",
        "callender",
        "price",
        "finally",
        "important",
        "remember",
        "dilemma",
        "need",
        "past",
        "hypothesis",
        "dependent",
        "upon",
        "particular",
        "physical",
        "setup",
        "explain",
        "thermodynamic",
        "arrow",
        "without",
        "invoking",
        "past",
        "hypothesis",
        "inspired",
        "idea",
        "eternal",
        "spontaneous",
        "inflation",
        "carroll",
        "chen",
        "internet",
        "resource",
        "describe",
        "model",
        "new",
        "baby",
        "universe",
        "pocket",
        "universe",
        "repeatedly",
        "born",
        "existing",
        "universe",
        "birth",
        "increase",
        "overall",
        "entropy",
        "multiverse",
        "although",
        "within",
        "baby",
        "universe",
        "familiar",
        "thermodynamic",
        "asymmetry",
        "crucial",
        "assumption",
        "model",
        "one",
        "also",
        "found",
        "gravitational",
        "theory",
        "barbour",
        "koslowski",
        "mercati",
        "entropy",
        "unbound",
        "arbitrarily",
        "high",
        "assumption",
        "model",
        "one",
        "without",
        "past",
        "hypothesis",
        "discussion",
        "see",
        "goldstein",
        "tumulka",
        "zanghi",
        "lazarovici",
        "reichert"
    ]
}