{
    "main_text": "Thermodynamic Time Asymmetry: A Brief Guide\n1. Thermodynamic Time Asymmetry: A Brief Guide\n\nFirst developed in Sadi Carnot’s Reflections on the Motive\nPower of Fire 1824, the science of classical thermodynamics is\nintimately associated with the industrial revolution. Most of the\nresults responsible for the science originated from the practice of\nengineers trying to improve steam engines. Originating in France and\nEngland in the late eighteenth and early nineteenth centuries, the\nscience quickly spread throughout Europe. By the mid-nineteenth\ncentury, Rudolf Clausius in Germany and William Thomson (later Lord\nKelvin) in England had developed the theory in great detail. Once\ndeveloped, its scope grew from steam engines and the like to arguably\nall macroscopic processes.\n\nThermodynamics is a “phenomenal” science. That means that\nits variables range over macroscopic parameters such as temperature,\npressure and volume. These are properties that hold at equilibrium,\ni.e., when the values of the macroscopic variables remain\napproximately stable. Whether the microphysics underlying these\nvariables are motive atoms in the void or an imponderable fluid is\nlargely irrelevant to this science. The developers of the theory both\nprided themselves on this fact and at the same time worried about it.\nClausius, for instance, was one of the first to speculate that heat\nconsisted solely of the motion of particles (without an ether), for it\nmade the equivalence of heat with mechanical work less surprising.\nHowever, as was common, he kept his “ontological” beliefs\nseparate from his official statement of the principles of\nthermodynamics because he didn’t wish to (in his words)\n“taint” the latter with the speculative character of the\n former.[1]\n\nA treatment of thermodynamics naturally begins with the statements it\ntakes to be laws of nature. These laws are founded upon observations\nof relationships between particular macroscopic parameters and they\nare justified by the fact they are empirically adequate. No further\njustification of these laws is to be found—at this\nstage—from the details of microphysics. Rather, stable,\ncounterfactual-supporting generalizations about macroscopic features\nare enshrined as law. The typical textbook treatment of thermodynamics\ndescribes some basic concepts, states the laws in a more or less rough\nway and then proceeds to derive the concepts of temperature and\nentropy and the various thermodynamic equations of state. It is worth\nremarking, however, that in the last fifty years the subject has been\npresented with a degree of mathematical rigor not previously achieved.\nOriginating from the early axiomatization by Carathéodory in\n1909, the development of “rational thermodynamics” has\nclarified the concepts and logic of classical thermodynamics to a\ndegree not generally appreciated. There now exist many quite\ndifferent, mathematically exact approaches to thermodynamics, each\nstarting with different primitive kinds and/or observational\nregularities as axioms. (For a popular presentation of a recent\naxiomatization, see Lieb and Yngvason 2000.)\n\nIn the traditional approach classical thermodynamics has two laws, the\nFirst and Second\n Laws.[2]\n The First Law expresses the conservation of energy and is founded\nupon the impossibility of creating a machine that can create energy.\nThe law uses the concept of the internal energy of a system, \\(U\\),\nwhich is a function of the system’s macroscopic variables, e.g.,\ntemperature, volume. For thermally isolated (adiabatic)\nsystems—think of systems such as coffee in a thermos—the\nlaw states that this function, \\(U\\), is such that the work \\(W\\)\ndelivered to a system’s surroundings is compensated by a loss of\ninternal energy, i.e., \\(dW = -dU\\). When James Joule and others\nshowed that mechanical work and heat were interconvertible,\nconsistency with the principle of energy conservation demanded that\nheat, \\(Q\\), considered as a different form of energy, be taken into\naccount. For non-isolated systems we extend the law as \\(dQ = dU +\ndW\\), where \\(dQ\\) is the differential of the amount of heat added to\nthe system (in a reversible manner).\n\nThe conservation of energy tells us nothing about temporally\nasymmetric behavior. It doesn’t follow from the First Law that\ninteracting systems quickly tend to approach equilibrium, and once\nachieved, never leave this state. It is perfectly consistent with the\nFirst Law that systems in equilibrium leave equilibrium. In\nparticular, no limitations are placed on transforming energy from one\nform into another, so the Law permits the possibility of machines that\nremove heat from their environment and turn it into work (a so-called\nperpetual mobile of the second kind). To rule out such machines, and\nmore generally, to capture the amazingly general temporally asymmetric\nbehavior we find, another law is needed. Although Carnot was the first\nto state it, the formulations of Kelvin and Clausius are standard:\n\n\nKelvin’s Second Law: There is no thermodynamic process whose\nsole effect is to transform heat extracted from a source at uniform\ntemperature completely into work.\n\nClausius’ Second Law: There is no thermodynamic process whose\nsole effect is to extract a quantity of heat from a colder reservoir\nand deliver it to a hotter reservoir.\n\n\nKelvin’s version is essentially the same as the version arrived\nat by both Carnot and Planck, whereas Clausius’ version differs\nfrom these in a few\n ways.[3]\n\nClausius’ version transparently rules out anti-thermodynamic\nbehavior such as a hot iron bar extracting heat from a neighboring\ncold iron bar. The cool bar cannot give up a quantity of heat to the\nwarmer bar (without something else happening). Kelvin’s\nstatement is perhaps less obvious. It originates in an observation\nabout steam engines, namely, that heat energy is a “poor”\ngrade of energy. Consider a gas-filled cylinder with a frictionless\npiston holding the gas down at one end. If we put a flame under the\ncylinder, the gas will expand and the piston can perform work, e.g.,\nit might move a ball. However, we can never convert the heat energy\nstraight into work without some other effect occurring. In this case,\nthe gas occupies a larger volume.\n\nIn 1854, Clausius introduced the notion of the “equivalence\nvalue” of a transformation, a concept that is the ancestor of\nthe modern day concept of entropy. Later in 1865 Clausius coined the\nterm “entropy” for a similar concept (the word derives\nfrom the Greek word for transformation). The entropy of a state \\(A\\),\n\\(S(A)\\) is defined as the integral \\(S(A) = \\int^{A}_{O} dQ/T\\) over\na reversible transformation, where \\(O\\) is some arbitrary fixed\nstate. For \\(A\\) to have an entropy, the transformation from \\(O\\) to\n\\(A\\) must be quasi-static, i.e., a succession of equilibrium states.\nContinuity considerations then imply that the initial and final states\n\\(O\\) and \\(A\\) must also be equilibrium states. Put in the language\nof entropy, the Second Law states that in a transformation from\nequilibrium state \\(A\\) to equilibrium state \\(B\\), the inequality\n\\(S(B) - S(A)\\) is greater than or equal to the \\(\\int^{A}_{B} dQ/T\\).\nLoosely put, for realistic systems, this implies that in the\nspontaneous evolution of a thermally closed system the entropy can\nnever decrease and that it attains its maximum value at equilibrium.\nWe are invited to think of the Second Law as driving the system to its\nnew, higher entropy equilibrium state.\n\nWith the Second Law thermodynamics is able to characterize an\nextraordinary range of phenomena under one simple law. Remarkably,\nwhether they are gases filling their available volumes, iron bars in\ncontact coming to the same temperature, vinegar and oil separating, or\nmilk mixing in your coffee, they all have an observable property in\ncommon: their entropy increases. Coupled with the First Law, the\nSecond Law is remarkably powerful. It appears that all classical\nthermodynamical behavior can be derived from these two simple\nstatements (O. Penrose 1970).\n\nThe above sketch represents the conventional way of describing\nthermodynamics and its Second Law. Let me mention a few questions that\nit raises.\n\nFirst, what is the precise location of the time-asymmetry? Almost all\ncommentators claim that it lay in the Second Law. If Uffink (2001) and\nBrown and Uffink (2001) are correct, however, then this\n“static” Second Law does not encode any time asymmetry at\nall. It is, after all, simply a relation between a few variables at\nequilibrium. While that may be right, there is no question that\nthermodynamics, if not its Second Law, makes time-asymmetric\nclaims. The spontaneous movement from non-equilibrium to equilibrium\nhappens and is assumed throughout the field. The only question is\nwhether it must be regarded as a separate assumption (perhaps\ndemanding its own name) or can somehow be derived from existing\nprinciples. It’s also worth remarking that many other principles\nof thermodynamics are time-asymmetric, e.g., the classical heat\nequation.\n\nSecond, what is the scope of the Second Law? There are two issues\nhere. First, does it apply to the universe as a whole, so that we can\nsay the universe’s entropy is increasing, or does it only apply\nto select sub-systems of the universe? (See Uffink 2001 for an\ninteresting historical discussion of this topic.) Many philosophers\nand physicists have balked at the idea that the universe itself has an\nentropy. As one might expect, those in the grip of an operationalist\nphilosophy are especially prone to deny that the universe as a whole\nhas an entropy. Second, what sub-systems of the universe does it\ngovern? Are the principles of thermodynamics responsible for\ngeneralizations about black holes? The field of black hole\nthermodynamics assumes it is (see the section on black hole\nthermodynamics in the entry on\n singularities and black holes,\n for discussion and references), although not all are convinced\n(Dougherty & Callender forthcoming). What about the\nmicro-realm?\n\nThird, how are these laws framed in a relativistic universe? They were\ndeveloped in the nineteenth century with a classical spacetime\nbackground in mind. How do we write the theory in a modern\nformulation? Surprisingly, the issue is as much conceptual as\ntechnical. The correct (special) relativistic transformation rules for\nthermodynamic quantities are controversial. Do Lorentz boosted gases\nappear hotter or colder in the new inertial frame? Albert Einstein\nhimself answered the question about the gas differently throughout his\nlife! With all the current activity of physicists being focused on the\nthermodynamics of black holes in general relativity and quantum\ngravity, it is amusing to note that special relativistic\nthermodynamics is still a field with many open questions, both\nphysically and philosophically (see Earman 1981 and Liu 1994).\n\nFourth, another important question concerns the reduction of\nthermodynamic concepts such as entropy to their mechanical, or\nstatistical mechanical, basis. As even a cursory glance at statistical\nmechanics reveals, there are many candidates for the statistical\nmechanical entropy, each the center of a different program in the\nfoundations of the field. Surprisingly, there is no consensus as to\nwhich entropy is best suited to be the reduction basis of the\nthermodynamic entropy (see, for example, Sklar 1993; Callender 1999;\nLavis 2005; Frigg 2008; Robertson forthcoming). Consequently, there is\nlittle agreement about what grounds the Second Law in statistical\nmechanics.\n\nDespite the worthiness of all of these issues, this article focuses on\ntwo distinct problems associated with the direction of time.\n",
    "section_title": "1. Thermodynamic Time Asymmetry: A Brief Guide",
    "entry_title": "Thermodynamic Asymmetry in Time",
    "hierarchy_title": "Thermodynamic Asymmetry in Time || Thermodynamic Time Asymmetry: A Brief Guide",
    "tokenized_text": [
        "thermodynamic",
        "time",
        "asymmetry",
        "brief",
        "guide",
        "thermodynamic",
        "time",
        "asymmetry",
        "brief",
        "guide",
        "first",
        "developed",
        "sadi",
        "carnot",
        "reflection",
        "motive",
        "power",
        "fire",
        "science",
        "classical",
        "thermodynamics",
        "intimately",
        "associated",
        "industrial",
        "revolution",
        "result",
        "responsible",
        "science",
        "originated",
        "practice",
        "engineer",
        "trying",
        "improve",
        "steam",
        "engine",
        "originating",
        "france",
        "england",
        "late",
        "eighteenth",
        "early",
        "nineteenth",
        "century",
        "science",
        "quickly",
        "spread",
        "throughout",
        "europe",
        "midnineteenth",
        "century",
        "rudolf",
        "clausius",
        "germany",
        "william",
        "thomson",
        "later",
        "lord",
        "kelvin",
        "england",
        "developed",
        "theory",
        "great",
        "detail",
        "developed",
        "scope",
        "grew",
        "steam",
        "engine",
        "like",
        "arguably",
        "macroscopic",
        "process",
        "thermodynamics",
        "phenomenal",
        "science",
        "mean",
        "variable",
        "range",
        "macroscopic",
        "parameter",
        "temperature",
        "pressure",
        "volume",
        "property",
        "hold",
        "equilibrium",
        "ie",
        "value",
        "macroscopic",
        "variable",
        "remain",
        "approximately",
        "stable",
        "whether",
        "microphysics",
        "underlying",
        "variable",
        "motive",
        "atom",
        "void",
        "imponderable",
        "fluid",
        "largely",
        "irrelevant",
        "science",
        "developer",
        "theory",
        "prided",
        "fact",
        "time",
        "worried",
        "clausius",
        "instance",
        "one",
        "first",
        "speculate",
        "heat",
        "consisted",
        "solely",
        "motion",
        "particle",
        "without",
        "ether",
        "made",
        "equivalence",
        "heat",
        "mechanical",
        "work",
        "le",
        "surprising",
        "however",
        "common",
        "kept",
        "ontological",
        "belief",
        "separate",
        "official",
        "statement",
        "principle",
        "thermodynamics",
        "wish",
        "word",
        "taint",
        "latter",
        "speculative",
        "character",
        "former",
        "treatment",
        "thermodynamics",
        "naturally",
        "begin",
        "statement",
        "take",
        "law",
        "nature",
        "law",
        "founded",
        "upon",
        "observation",
        "relationship",
        "particular",
        "macroscopic",
        "parameter",
        "justified",
        "fact",
        "empirically",
        "adequate",
        "justification",
        "law",
        "foundat",
        "stagefrom",
        "detail",
        "microphysics",
        "rather",
        "stable",
        "counterfactualsupporting",
        "generalization",
        "macroscopic",
        "feature",
        "enshrined",
        "law",
        "typical",
        "textbook",
        "treatment",
        "thermodynamics",
        "describes",
        "basic",
        "concept",
        "state",
        "law",
        "le",
        "rough",
        "way",
        "proceeds",
        "derive",
        "concept",
        "temperature",
        "entropy",
        "various",
        "thermodynamic",
        "equation",
        "state",
        "worth",
        "remarking",
        "however",
        "last",
        "fifty",
        "year",
        "subject",
        "presented",
        "degree",
        "mathematical",
        "rigor",
        "previously",
        "achieved",
        "originating",
        "early",
        "axiomatization",
        "carathéodory",
        "development",
        "rational",
        "thermodynamics",
        "clarified",
        "concept",
        "logic",
        "classical",
        "thermodynamics",
        "degree",
        "generally",
        "appreciated",
        "exist",
        "many",
        "quite",
        "different",
        "mathematically",
        "exact",
        "approach",
        "thermodynamics",
        "starting",
        "different",
        "primitive",
        "kind",
        "andor",
        "observational",
        "regularity",
        "axiom",
        "popular",
        "presentation",
        "recent",
        "axiomatization",
        "see",
        "lieb",
        "yngvason",
        "traditional",
        "approach",
        "classical",
        "thermodynamics",
        "two",
        "law",
        "first",
        "second",
        "law",
        "first",
        "law",
        "express",
        "conservation",
        "energy",
        "founded",
        "upon",
        "impossibility",
        "creating",
        "machine",
        "create",
        "energy",
        "law",
        "us",
        "concept",
        "internal",
        "energy",
        "system",
        "u",
        "function",
        "system",
        "macroscopic",
        "variable",
        "eg",
        "temperature",
        "volume",
        "thermally",
        "isolated",
        "adiabatic",
        "systemsthink",
        "system",
        "coffee",
        "thermosthe",
        "law",
        "state",
        "function",
        "u",
        "work",
        "w",
        "delivered",
        "system",
        "surroundings",
        "compensated",
        "loss",
        "internal",
        "energy",
        "ie",
        "dw",
        "du",
        "james",
        "joule",
        "others",
        "showed",
        "mechanical",
        "work",
        "heat",
        "interconvertible",
        "consistency",
        "principle",
        "energy",
        "conservation",
        "demanded",
        "heat",
        "q",
        "considered",
        "different",
        "form",
        "energy",
        "taken",
        "account",
        "nonisolated",
        "system",
        "extend",
        "law",
        "dq",
        "du",
        "dw",
        "dq",
        "differential",
        "amount",
        "heat",
        "added",
        "system",
        "reversible",
        "manner",
        "conservation",
        "energy",
        "tell",
        "u",
        "nothing",
        "temporally",
        "asymmetric",
        "behavior",
        "follow",
        "first",
        "law",
        "interacting",
        "system",
        "quickly",
        "tend",
        "approach",
        "equilibrium",
        "achieved",
        "never",
        "leave",
        "state",
        "perfectly",
        "consistent",
        "first",
        "law",
        "system",
        "equilibrium",
        "leave",
        "equilibrium",
        "particular",
        "limitation",
        "placed",
        "transforming",
        "energy",
        "one",
        "form",
        "another",
        "law",
        "permit",
        "possibility",
        "machine",
        "remove",
        "heat",
        "environment",
        "turn",
        "work",
        "socalled",
        "perpetual",
        "mobile",
        "second",
        "kind",
        "rule",
        "machine",
        "generally",
        "capture",
        "amazingly",
        "general",
        "temporally",
        "asymmetric",
        "behavior",
        "find",
        "another",
        "law",
        "needed",
        "although",
        "carnot",
        "first",
        "state",
        "formulation",
        "kelvin",
        "clausius",
        "standard",
        "kelvin",
        "second",
        "law",
        "thermodynamic",
        "process",
        "whose",
        "sole",
        "effect",
        "transform",
        "heat",
        "extracted",
        "source",
        "uniform",
        "temperature",
        "completely",
        "work",
        "clausius",
        "second",
        "law",
        "thermodynamic",
        "process",
        "whose",
        "sole",
        "effect",
        "extract",
        "quantity",
        "heat",
        "colder",
        "reservoir",
        "deliver",
        "hotter",
        "reservoir",
        "kelvin",
        "version",
        "essentially",
        "version",
        "arrived",
        "carnot",
        "planck",
        "whereas",
        "clausius",
        "version",
        "differs",
        "way",
        "clausius",
        "version",
        "transparently",
        "rule",
        "antithermodynamic",
        "behavior",
        "hot",
        "iron",
        "bar",
        "extracting",
        "heat",
        "neighboring",
        "cold",
        "iron",
        "bar",
        "cool",
        "bar",
        "give",
        "quantity",
        "heat",
        "warmer",
        "bar",
        "without",
        "something",
        "else",
        "happening",
        "kelvin",
        "statement",
        "perhaps",
        "le",
        "obvious",
        "originates",
        "observation",
        "steam",
        "engine",
        "namely",
        "heat",
        "energy",
        "poor",
        "grade",
        "energy",
        "consider",
        "gasfilled",
        "cylinder",
        "frictionless",
        "piston",
        "holding",
        "gas",
        "one",
        "end",
        "put",
        "flame",
        "cylinder",
        "gas",
        "expand",
        "piston",
        "perform",
        "work",
        "eg",
        "might",
        "move",
        "ball",
        "however",
        "never",
        "convert",
        "heat",
        "energy",
        "straight",
        "work",
        "without",
        "effect",
        "occurring",
        "case",
        "gas",
        "occupies",
        "larger",
        "volume",
        "clausius",
        "introduced",
        "notion",
        "equivalence",
        "value",
        "transformation",
        "concept",
        "ancestor",
        "modern",
        "day",
        "concept",
        "entropy",
        "later",
        "clausius",
        "coined",
        "term",
        "entropy",
        "similar",
        "concept",
        "word",
        "derives",
        "greek",
        "word",
        "transformation",
        "entropy",
        "state",
        "a",
        "defined",
        "integral",
        "int",
        "_",
        "dqt",
        "reversible",
        "transformation",
        "o",
        "arbitrary",
        "fixed",
        "state",
        "a",
        "entropy",
        "transformation",
        "o",
        "a",
        "must",
        "quasistatic",
        "ie",
        "succession",
        "equilibrium",
        "state",
        "continuity",
        "consideration",
        "imply",
        "initial",
        "final",
        "state",
        "o",
        "a",
        "must",
        "also",
        "equilibrium",
        "state",
        "put",
        "language",
        "entropy",
        "second",
        "law",
        "state",
        "transformation",
        "equilibrium",
        "state",
        "a",
        "equilibrium",
        "state",
        "b",
        "inequality",
        "b",
        "greater",
        "equal",
        "int",
        "_",
        "b",
        "dqt",
        "loosely",
        "put",
        "realistic",
        "system",
        "implies",
        "spontaneous",
        "evolution",
        "thermally",
        "closed",
        "system",
        "entropy",
        "never",
        "decrease",
        "attains",
        "maximum",
        "value",
        "equilibrium",
        "invited",
        "think",
        "second",
        "law",
        "driving",
        "system",
        "new",
        "higher",
        "entropy",
        "equilibrium",
        "state",
        "second",
        "law",
        "thermodynamics",
        "able",
        "characterize",
        "extraordinary",
        "range",
        "phenomenon",
        "one",
        "simple",
        "law",
        "remarkably",
        "whether",
        "gas",
        "filling",
        "available",
        "volume",
        "iron",
        "bar",
        "contact",
        "coming",
        "temperature",
        "vinegar",
        "oil",
        "separating",
        "milk",
        "mixing",
        "coffee",
        "observable",
        "property",
        "common",
        "entropy",
        "increase",
        "coupled",
        "first",
        "law",
        "second",
        "law",
        "remarkably",
        "powerful",
        "appears",
        "classical",
        "thermodynamical",
        "behavior",
        "derived",
        "two",
        "simple",
        "statement",
        "o",
        "penrose",
        "sketch",
        "represents",
        "conventional",
        "way",
        "describing",
        "thermodynamics",
        "second",
        "law",
        "let",
        "mention",
        "question",
        "raise",
        "first",
        "precise",
        "location",
        "timeasymmetry",
        "almost",
        "commentator",
        "claim",
        "lay",
        "second",
        "law",
        "uffink",
        "brown",
        "uffink",
        "correct",
        "however",
        "static",
        "second",
        "law",
        "encode",
        "time",
        "asymmetry",
        "simply",
        "relation",
        "variable",
        "equilibrium",
        "may",
        "right",
        "question",
        "thermodynamics",
        "second",
        "law",
        "make",
        "timeasymmetric",
        "claim",
        "spontaneous",
        "movement",
        "nonequilibrium",
        "equilibrium",
        "happens",
        "assumed",
        "throughout",
        "field",
        "question",
        "whether",
        "must",
        "regarded",
        "separate",
        "assumption",
        "perhaps",
        "demanding",
        "name",
        "somehow",
        "derived",
        "existing",
        "principle",
        "also",
        "worth",
        "remarking",
        "many",
        "principle",
        "thermodynamics",
        "timeasymmetric",
        "eg",
        "classical",
        "heat",
        "equation",
        "second",
        "scope",
        "second",
        "law",
        "two",
        "issue",
        "first",
        "apply",
        "universe",
        "whole",
        "say",
        "universe",
        "entropy",
        "increasing",
        "apply",
        "select",
        "subsystems",
        "universe",
        "see",
        "uffink",
        "interesting",
        "historical",
        "discussion",
        "topic",
        "many",
        "philosopher",
        "physicist",
        "balked",
        "idea",
        "universe",
        "entropy",
        "one",
        "might",
        "expect",
        "grip",
        "operationalist",
        "philosophy",
        "especially",
        "prone",
        "deny",
        "universe",
        "whole",
        "entropy",
        "second",
        "subsystems",
        "universe",
        "govern",
        "principle",
        "thermodynamics",
        "responsible",
        "generalization",
        "black",
        "hole",
        "field",
        "black",
        "hole",
        "thermodynamics",
        "assumes",
        "see",
        "section",
        "black",
        "hole",
        "thermodynamics",
        "entry",
        "singularity",
        "black",
        "hole",
        "discussion",
        "reference",
        "although",
        "convinced",
        "dougherty",
        "callender",
        "forthcoming",
        "microrealm",
        "third",
        "law",
        "framed",
        "relativistic",
        "universe",
        "developed",
        "nineteenth",
        "century",
        "classical",
        "spacetime",
        "background",
        "mind",
        "write",
        "theory",
        "modern",
        "formulation",
        "surprisingly",
        "issue",
        "much",
        "conceptual",
        "technical",
        "correct",
        "special",
        "relativistic",
        "transformation",
        "rule",
        "thermodynamic",
        "quantity",
        "controversial",
        "lorentz",
        "boosted",
        "gas",
        "appear",
        "hotter",
        "colder",
        "new",
        "inertial",
        "frame",
        "albert",
        "einstein",
        "answered",
        "question",
        "gas",
        "differently",
        "throughout",
        "life",
        "current",
        "activity",
        "physicist",
        "focused",
        "thermodynamics",
        "black",
        "hole",
        "general",
        "relativity",
        "quantum",
        "gravity",
        "amusing",
        "note",
        "special",
        "relativistic",
        "thermodynamics",
        "still",
        "field",
        "many",
        "open",
        "question",
        "physically",
        "philosophically",
        "see",
        "earman",
        "liu",
        "fourth",
        "another",
        "important",
        "question",
        "concern",
        "reduction",
        "thermodynamic",
        "concept",
        "entropy",
        "mechanical",
        "statistical",
        "mechanical",
        "basis",
        "even",
        "cursory",
        "glance",
        "statistical",
        "mechanic",
        "reveals",
        "many",
        "candidate",
        "statistical",
        "mechanical",
        "entropy",
        "center",
        "different",
        "program",
        "foundation",
        "field",
        "surprisingly",
        "consensus",
        "entropy",
        "best",
        "suited",
        "reduction",
        "basis",
        "thermodynamic",
        "entropy",
        "see",
        "example",
        "sklar",
        "callender",
        "lavis",
        "frigg",
        "robertson",
        "forthcoming",
        "consequently",
        "little",
        "agreement",
        "ground",
        "second",
        "law",
        "statistical",
        "mechanic",
        "despite",
        "worthiness",
        "issue",
        "article",
        "focus",
        "two",
        "distinct",
        "problem",
        "associated",
        "direction",
        "time"
    ]
}