{
    "main_text": "Time order\n7. The metaphysics of time perception\n\nIn giving an account of the various aspects of time perception, we\ninevitably make use of concepts that we take to have an objective\ncounterpart in the world: the past, temporal order, causation, change,\nthe passage of time and so on. But one of the most important lessons\nof philosophy, for many writers, is that there may be a gap, perhaps\neven a gulf, between our representation of the world and the world\nitself, even on a quite abstract level. (It would be fair to add that,\nfor other writers, this is precisely not the lesson\nphilosophy teaches.) Philosophy of time is no exception to this.\nIndeed, it is interesting to note how many philosophers have taken the\nview that, despite appearances, time, or some aspect of time, is\nunreal. In this final section, we will take a look at how three\nmetaphysical debates concerning the nature of the world interact with\naccounts of time perception.\n\nThe first debate concerns the reality of tense, that is, our division\nof time into past, present and future. Is time really divided in this\nway? Does what is present slip further and further into the past? Or\ndoes this picture merely reflect our perspective on a reality in which\nthere is no uniquely privileged moment, the present, but simply an\nordered series of moments? A-theorists say that our ordinary\npicture of the world as tensed reflects the world as it really is: the\npassage of time is an objective fact. B-theorists deny this.\n(The terms A-theory and B-theory derive from McTaggart’s (1908)\ndistinction between two ways in which events can be ordered in time,\neither as an A-series—that is in terms of whether they are past,\npresent or future — or as a B-series—that is according to\nwhether they are earlier than, later than, or simultaneous with other\nevents.)\n\nFor B-theorists, the only objective temporal facts concern relations\nof precedence and simultaneity between events. (I ignore here the\ncomplications introduced by the Special Theory of Relativity, since\nB-theory—and perhaps A-theory also—can be reformulated in\nterms which are compatible with the Special Theory.) B-theorists do\nnot deny that our tensed beliefs, such as the belief that a cold front\nis now passing, or that Sally’s wedding was two\nyears ago, may be true, but they assert that what makes such\nbeliefs true are not facts about the pastness, presentness or futurity\nof events, but tenseless facts concerning precedence and simultaneity\n(see Mellor 1998, Oaklander and Smith 1994). On one version of the\nB-theory, for example, my belief that there is a cold front now\npassing is true because the passing of the front is simultaneous\nwith my forming the belief. Now one very serious challenge to the\ntenseless theorist is to explain why, if time does not pass in\nreality, it appears to do so. What, in B-theoretic terms, is the basis\nfor our experience as-of the passage of time?\n\nThe accounts we considered above, first of the temporal restrictions\non our experience, and secondly of our experience of time order, did\nnot explicitly appeal to tensed, or A-theoretic notions. The facts we\ndid appeal to look like purely B-theoretic ones: that causes are\nalways earlier than their effects, that things typically change slowly\nin relation to the speed of transmission of light and sound, that our\ninformation-processing capacities are limited, and that there can be\ncausal connections between memories and experiences. So it may be that\nthe tenseless theorist can discharge the obligation to explain why\ntime seems to pass. But two doubts remain. First, perhaps the A-\ntheorist can produce a simpler explanation of our experience. Second,\nit may turn out that supposedly B-series facts are dependent upon\nA-series ones, so that, for example, a and b are\nsimultaneous by virtue of the fact that both are present.\n\nWhat is clear, though, is that there is no direct argument from\nexperience to the A-theory, since the present of experience, being\ntemporally extended and concerning the past, is very different from\nthe objective present postulated by the A-theory. Further, it cannot\nbe taken for granted that the objective passage of time would explain\nwhatever it is that the experience as-of time’s passage is\nsupposed to amount to. (See Prosser 2005, 2007, 2012, 2016, 2018.)\n\nThe second metaphysical issue that has a crucial bearing on time\nperception is connected with the A/B-theory dispute, and that is the\ndebate between presentists and eternalists. Presentists hold that only\nthe present exists (for an articulation of various kinds of\npresentism, and the challenges they face, see Bourne 2006), whereas\neternalists grant equal reality to all times. the two debates, A-\nversus B-theory and presentism versus eternalism, do not map precisely\nonto each other. Arguably, B-theory is committed to eternalism, but\nA-theorists may not necessarily endorse presentism (though Bourne\nargues that they should).\n\nHow might his be connected to perception? According to the indirect\n(or, as it is sometimes called, representative) theory of perception,\nwe perceive external objects only by perceiving some intermediate\nobject, a sense datum. According to the direct theory, in contrast,\nperception of external objects involves no such intermediary. Now,\nexternal objects are at varying distances from us, and, as noted\nabove, since light and sound travel at finite speeds, that means that\nthe state of objects that we perceive will necessarily lie in the\npast. In the case of stars, where the distances are very considerable,\nthe time gap between light leaving the star and our perceiving it may\nbe one of many years. The presentist holds that past states, events\nand objects are no longer real. But if all that we perceive in the\nexternal world is past, then it seems that the objects of our\nperception (or at least the states of those objects that we perceive)\nare unreal. It is hard to reconcile this with the direct theory of\nperception. It looks on the face of it, therefore, that presentists\nare committed to the indirect theory of perception. (See Power 2010a,\n2010b, 2018, Le Poidevin 2015b.)\n\nThe third and final metaphysical issue that we will discuss in the\ncontext of time perception concerns causal asymmetry. The account of\nour sense of being located at a time which we considered under\n Past, present and the passage of time\n rested on the assumption that causation is asymmetric. Later events,\nit was suggested, cannot affect earlier ones, as a matter of\nmind-independent fact, and this is why we do not perceive the future,\nonly the past. But attempts to explain the basis of causal asymmetry,\nin terms for example of counterfactual dependence, or in probabilistic\nterms, are notoriously problematic. One moral we might draw from the\ndifficulties of reducing causal asymmetry to other asymmetries is that\ncausal asymmetry is primitive, and so irreducible. Another is that\nthat the search for a mind-independent account is mistaken. Perhaps\ncausation in intrinsically symmetric, but some feature of our\npsychological constitution and relation to the world makes causation\nappear asymmetric. This causal perspectivalism is the line\ntaken by Huw Price (1996). That causal asymmetry should be explained\nin part by our psychological constitution, in a way analogous to our\nunderstanding of secondary qualities such as colour, is a radical\nreversal of our ordinary assumptions, but then our ordinary\nunderstanding of a number of apparently objective features of the\nworld—tense, absolute simultaneity—have met with similarly\nradical challenges. Now, if causal asymmetry is mind-dependent in this\nway, then we cannot appeal to it in accounting for our experience of\ntemporal asymmetry—the difference between past and future.\n\nFurther, it is not at all clear that perspectivalism can account for\nthe perception of time order. The mechanism suggested by Mellor (see\n Time Order)\n exploited the asymmetry of causation: it is the fact that the\nperception of A causally influences the perception of B, but not vice\nversa, that gives rise to the perception of A’s being followed\nby B. We can represent this schematically as follows (where the arrow\nstands for an asymmetric causal relation):\n\nP(A)→P(B)→P(A<B)\n\n\nBut if there is no objective asymmetry, then what is the explanation?\nOf course, we can still define causal order in terms of a causal\nbetweenness relation, and we can say that the perceived order follows\nthe objective causal order of the perceptions, in this sense: on the one hand, where A\nis perceived as being followed by B, then the perception of B is\nalways causally between the perception of A and the perception of\nA’s being followed by B (the dash represents a symmetric causal\nrelation):\n\nP(A) – P(B) – P(A<B)\n\n\nOn the other hand, where B is perceived as being followed by A, the perception\nof A is always causally between the perception of B and the perception\nof B’s being followed by A:\n\nP(B) – P(A)) – P(B<A)\n\n\nBut what, on the causal perspectivalist view, would rule out the\nfollowing case?\n\nP(B<A) – P(A) – P(B) – P(A<B)\n\n\nFor such a case would satisfy the above constraints. But it is a case\nin which A is perceived by an observer both as following, and as being\nfollowed by, B, and we know that such a case never occurs in\nexperience. ‘Is perceived by x as followed by’ is\nan asymmetric relation (assuming we are dealing with a single sense\nmodality), and so one that can be grounded in the causal relation only\nif the causal relation is itself asymmetric. Now if perspectivalism\ncannot meet the challenge to explain why, when B is perceived as\nfollowing A, A is never perceived by the same observer as following B,\nit seems that our experience of time order, insofar as it has a causal\nexplanation, requires causation to be objectively asymmetric.\n\nOne strategy the causal perspectivalist could adopt (indeed, the only\none available) is to explain the asymmetric principle above in terms\nof some objective non-causal asymmetry. Price, for example, allows an\nobjective thermodynamic asymmetry, in that an ordered series of states\nof the universe will exhibit what he calls a thermodynamic gradient:\nentropy will be lower at one end of the series than at the end. We\nshould resist the temptation to say that entropy increases, for that\nwould be like asserting that a road goes uphill rather than downhill\nwithout conceding the perspectival nature of descriptions like\n‘uphill’. Could such a thermodynamic asymmetry explain the\nperception of time order? That is a question for the reader to\nponder.\n",
    "section_title": "7. The metaphysics of time perception",
    "entry_title": "The Experience and Perception of Time",
    "hierarchy_title": "The Experience and Perception of Time || Time order",
    "tokenized_text": [
        "time",
        "order",
        "metaphysics",
        "time",
        "perception",
        "giving",
        "account",
        "various",
        "aspect",
        "time",
        "perception",
        "inevitably",
        "make",
        "use",
        "concept",
        "take",
        "objective",
        "counterpart",
        "world",
        "past",
        "temporal",
        "order",
        "causation",
        "change",
        "passage",
        "time",
        "one",
        "important",
        "lesson",
        "philosophy",
        "many",
        "writer",
        "may",
        "gap",
        "perhaps",
        "even",
        "gulf",
        "representation",
        "world",
        "world",
        "even",
        "quite",
        "abstract",
        "level",
        "would",
        "fair",
        "add",
        "writer",
        "precisely",
        "lesson",
        "philosophy",
        "teach",
        "philosophy",
        "time",
        "exception",
        "indeed",
        "interesting",
        "note",
        "many",
        "philosopher",
        "taken",
        "view",
        "despite",
        "appearance",
        "time",
        "aspect",
        "time",
        "unreal",
        "final",
        "section",
        "take",
        "look",
        "three",
        "metaphysical",
        "debate",
        "concerning",
        "nature",
        "world",
        "interact",
        "account",
        "time",
        "perception",
        "first",
        "debate",
        "concern",
        "reality",
        "tense",
        "division",
        "time",
        "past",
        "present",
        "future",
        "time",
        "really",
        "divided",
        "way",
        "present",
        "slip",
        "past",
        "picture",
        "merely",
        "reflect",
        "perspective",
        "reality",
        "uniquely",
        "privileged",
        "moment",
        "present",
        "simply",
        "ordered",
        "series",
        "moment",
        "atheorists",
        "say",
        "ordinary",
        "picture",
        "world",
        "tensed",
        "reflects",
        "world",
        "really",
        "passage",
        "time",
        "objective",
        "fact",
        "btheorists",
        "deny",
        "term",
        "atheory",
        "btheory",
        "derive",
        "mctaggart",
        "distinction",
        "two",
        "way",
        "event",
        "ordered",
        "time",
        "either",
        "aseriesthat",
        "term",
        "whether",
        "past",
        "present",
        "future",
        "bseriesthat",
        "according",
        "whether",
        "earlier",
        "later",
        "simultaneous",
        "event",
        "btheorists",
        "objective",
        "temporal",
        "fact",
        "concern",
        "relation",
        "precedence",
        "simultaneity",
        "event",
        "ignore",
        "complication",
        "introduced",
        "special",
        "theory",
        "relativity",
        "since",
        "btheoryand",
        "perhaps",
        "atheory",
        "alsocan",
        "reformulated",
        "term",
        "compatible",
        "special",
        "theory",
        "btheorists",
        "deny",
        "tensed",
        "belief",
        "belief",
        "cold",
        "front",
        "passing",
        "sally",
        "wedding",
        "two",
        "year",
        "ago",
        "may",
        "true",
        "assert",
        "make",
        "belief",
        "true",
        "fact",
        "pastness",
        "presentness",
        "futurity",
        "event",
        "tenseless",
        "fact",
        "concerning",
        "precedence",
        "simultaneity",
        "see",
        "mellor",
        "oaklander",
        "smith",
        "one",
        "version",
        "btheory",
        "example",
        "belief",
        "cold",
        "front",
        "passing",
        "true",
        "passing",
        "front",
        "simultaneous",
        "forming",
        "belief",
        "one",
        "serious",
        "challenge",
        "tenseless",
        "theorist",
        "explain",
        "time",
        "pas",
        "reality",
        "appears",
        "btheoretic",
        "term",
        "basis",
        "experience",
        "asof",
        "passage",
        "time",
        "account",
        "considered",
        "first",
        "temporal",
        "restriction",
        "experience",
        "secondly",
        "experience",
        "time",
        "order",
        "explicitly",
        "appeal",
        "tensed",
        "atheoretic",
        "notion",
        "fact",
        "appeal",
        "look",
        "like",
        "purely",
        "btheoretic",
        "one",
        "cause",
        "always",
        "earlier",
        "effect",
        "thing",
        "typically",
        "change",
        "slowly",
        "relation",
        "speed",
        "transmission",
        "light",
        "sound",
        "informationprocessing",
        "capacity",
        "limited",
        "causal",
        "connection",
        "memory",
        "experience",
        "may",
        "tenseless",
        "theorist",
        "discharge",
        "obligation",
        "explain",
        "time",
        "seems",
        "pas",
        "two",
        "doubt",
        "remain",
        "first",
        "perhaps",
        "a",
        "theorist",
        "produce",
        "simpler",
        "explanation",
        "experience",
        "second",
        "may",
        "turn",
        "supposedly",
        "bseries",
        "fact",
        "dependent",
        "upon",
        "aseries",
        "one",
        "example",
        "b",
        "simultaneous",
        "virtue",
        "fact",
        "present",
        "clear",
        "though",
        "direct",
        "argument",
        "experience",
        "atheory",
        "since",
        "present",
        "experience",
        "temporally",
        "extended",
        "concerning",
        "past",
        "different",
        "objective",
        "present",
        "postulated",
        "atheory",
        "taken",
        "granted",
        "objective",
        "passage",
        "time",
        "would",
        "explain",
        "whatever",
        "experience",
        "asof",
        "time",
        "passage",
        "supposed",
        "amount",
        "see",
        "prosser",
        "second",
        "metaphysical",
        "issue",
        "crucial",
        "bearing",
        "time",
        "perception",
        "connected",
        "abtheory",
        "dispute",
        "debate",
        "presentist",
        "eternalists",
        "presentist",
        "hold",
        "present",
        "exists",
        "articulation",
        "various",
        "kind",
        "presentism",
        "challenge",
        "face",
        "see",
        "bourne",
        "whereas",
        "eternalists",
        "grant",
        "equal",
        "reality",
        "time",
        "two",
        "debate",
        "a",
        "versus",
        "btheory",
        "presentism",
        "versus",
        "eternalism",
        "map",
        "precisely",
        "onto",
        "arguably",
        "btheory",
        "committed",
        "eternalism",
        "atheorists",
        "may",
        "necessarily",
        "endorse",
        "presentism",
        "though",
        "bourne",
        "argues",
        "might",
        "connected",
        "perception",
        "according",
        "indirect",
        "sometimes",
        "called",
        "representative",
        "theory",
        "perception",
        "perceive",
        "external",
        "object",
        "perceiving",
        "intermediate",
        "object",
        "sense",
        "datum",
        "according",
        "direct",
        "theory",
        "contrast",
        "perception",
        "external",
        "object",
        "involves",
        "intermediary",
        "external",
        "object",
        "varying",
        "distance",
        "u",
        "noted",
        "since",
        "light",
        "sound",
        "travel",
        "finite",
        "speed",
        "mean",
        "state",
        "object",
        "perceive",
        "necessarily",
        "lie",
        "past",
        "case",
        "star",
        "distance",
        "considerable",
        "time",
        "gap",
        "light",
        "leaving",
        "star",
        "perceiving",
        "may",
        "one",
        "many",
        "year",
        "presentist",
        "hold",
        "past",
        "state",
        "event",
        "object",
        "longer",
        "real",
        "perceive",
        "external",
        "world",
        "past",
        "seems",
        "object",
        "perception",
        "least",
        "state",
        "object",
        "perceive",
        "unreal",
        "hard",
        "reconcile",
        "direct",
        "theory",
        "perception",
        "look",
        "face",
        "therefore",
        "presentist",
        "committed",
        "indirect",
        "theory",
        "perception",
        "see",
        "power",
        "a",
        "b",
        "le",
        "poidevin",
        "b",
        "third",
        "final",
        "metaphysical",
        "issue",
        "discus",
        "context",
        "time",
        "perception",
        "concern",
        "causal",
        "asymmetry",
        "account",
        "sense",
        "located",
        "time",
        "considered",
        "past",
        "present",
        "passage",
        "time",
        "rested",
        "assumption",
        "causation",
        "asymmetric",
        "later",
        "event",
        "suggested",
        "affect",
        "earlier",
        "one",
        "matter",
        "mindindependent",
        "fact",
        "perceive",
        "future",
        "past",
        "attempt",
        "explain",
        "basis",
        "causal",
        "asymmetry",
        "term",
        "example",
        "counterfactual",
        "dependence",
        "probabilistic",
        "term",
        "notoriously",
        "problematic",
        "one",
        "moral",
        "might",
        "draw",
        "difficulty",
        "reducing",
        "causal",
        "asymmetry",
        "asymmetry",
        "causal",
        "asymmetry",
        "primitive",
        "irreducible",
        "another",
        "search",
        "mindindependent",
        "account",
        "mistaken",
        "perhaps",
        "causation",
        "intrinsically",
        "symmetric",
        "feature",
        "psychological",
        "constitution",
        "relation",
        "world",
        "make",
        "causation",
        "appear",
        "asymmetric",
        "causal",
        "perspectivalism",
        "line",
        "taken",
        "huw",
        "price",
        "causal",
        "asymmetry",
        "explained",
        "part",
        "psychological",
        "constitution",
        "way",
        "analogous",
        "understanding",
        "secondary",
        "quality",
        "colour",
        "radical",
        "reversal",
        "ordinary",
        "assumption",
        "ordinary",
        "understanding",
        "number",
        "apparently",
        "objective",
        "feature",
        "worldtense",
        "absolute",
        "simultaneityhave",
        "met",
        "similarly",
        "radical",
        "challenge",
        "causal",
        "asymmetry",
        "minddependent",
        "way",
        "appeal",
        "accounting",
        "experience",
        "temporal",
        "asymmetrythe",
        "difference",
        "past",
        "future",
        "clear",
        "perspectivalism",
        "account",
        "perception",
        "time",
        "order",
        "mechanism",
        "suggested",
        "mellor",
        "see",
        "time",
        "order",
        "exploited",
        "asymmetry",
        "causation",
        "fact",
        "perception",
        "causally",
        "influence",
        "perception",
        "b",
        "vice",
        "versa",
        "give",
        "rise",
        "perception",
        "followed",
        "b",
        "represent",
        "schematically",
        "follows",
        "arrow",
        "stand",
        "asymmetric",
        "causal",
        "relation",
        "p",
        "p",
        "b",
        "p",
        "b",
        "objective",
        "asymmetry",
        "explanation",
        "course",
        "still",
        "define",
        "causal",
        "order",
        "term",
        "causal",
        "betweenness",
        "relation",
        "say",
        "perceived",
        "order",
        "follows",
        "objective",
        "causal",
        "order",
        "perception",
        "sense",
        "one",
        "hand",
        "perceived",
        "followed",
        "b",
        "perception",
        "b",
        "always",
        "causally",
        "perception",
        "perception",
        "followed",
        "b",
        "dash",
        "represents",
        "symmetric",
        "causal",
        "relation",
        "p",
        "p",
        "b",
        "p",
        "b",
        "hand",
        "b",
        "perceived",
        "followed",
        "perception",
        "always",
        "causally",
        "perception",
        "b",
        "perception",
        "b",
        "followed",
        "p",
        "b",
        "p",
        "p",
        "b",
        "causal",
        "perspectivalist",
        "view",
        "would",
        "rule",
        "following",
        "case",
        "p",
        "b",
        "p",
        "p",
        "b",
        "p",
        "b",
        "case",
        "would",
        "satisfy",
        "constraint",
        "case",
        "perceived",
        "observer",
        "following",
        "followed",
        "b",
        "know",
        "case",
        "never",
        "occurs",
        "experience",
        "perceived",
        "x",
        "followed",
        "asymmetric",
        "relation",
        "assuming",
        "dealing",
        "single",
        "sense",
        "modality",
        "one",
        "grounded",
        "causal",
        "relation",
        "causal",
        "relation",
        "asymmetric",
        "perspectivalism",
        "meet",
        "challenge",
        "explain",
        "b",
        "perceived",
        "following",
        "never",
        "perceived",
        "observer",
        "following",
        "b",
        "seems",
        "experience",
        "time",
        "order",
        "insofar",
        "causal",
        "explanation",
        "requires",
        "causation",
        "objectively",
        "asymmetric",
        "one",
        "strategy",
        "causal",
        "perspectivalist",
        "could",
        "adopt",
        "indeed",
        "one",
        "available",
        "explain",
        "asymmetric",
        "principle",
        "term",
        "objective",
        "noncausal",
        "asymmetry",
        "price",
        "example",
        "allows",
        "objective",
        "thermodynamic",
        "asymmetry",
        "ordered",
        "series",
        "state",
        "universe",
        "exhibit",
        "call",
        "thermodynamic",
        "gradient",
        "entropy",
        "lower",
        "one",
        "end",
        "series",
        "end",
        "resist",
        "temptation",
        "say",
        "entropy",
        "increase",
        "would",
        "like",
        "asserting",
        "road",
        "go",
        "uphill",
        "rather",
        "downhill",
        "without",
        "conceding",
        "perspectival",
        "nature",
        "description",
        "like",
        "uphill",
        "could",
        "thermodynamic",
        "asymmetry",
        "explain",
        "perception",
        "time",
        "order",
        "question",
        "reader",
        "ponder"
    ]
}