{
    "main_text": "Even If There are Constraints, So What?\n7. Even If There are Constraints, So What?\n\nSince it is not obvious that one can rid oneself of all constraints in\nrealistic models, let us examine the argument that time travel is\nimplausible, and we should think it unlikely to exist in our world, in\nso far as it implies such constraints. The argument goes something\nlike the following. In order to satisfy such constraints one needs\nsome pre-established divine harmony between the global (time travel)\nstructure of space-time and the distribution of particles and fields\non space-like surfaces in it. But it is not plausible that the actual\nworld, or any world even remotely like ours, is constructed with\ndivine harmony as part of the plan. In fact, one might argue, we have\nempirical evidence that conditions in any spatial region can vary\nquite arbitrarily. So we have evidence that such constraints, whatever\nthey are, do not in fact exist in our world. So we have evidence that\nthere are no closed time-like lines in our world or one remotely like\nit. We will now examine this argument in more detail by presenting\nfour possible responses, with counterresponses, to this argument.\n\nResponse 1. There is nothing implausible or new about\nsuch constraints. For instance, if the universe is spatially closed,\nthere has to be enough matter to produce the needed curvature, and\nthis puts constraints on the matter distribution on a space-like\nhypersurface. Thus global space-time structure can quite\nunproblematically constrain matter distributions on space-like\nhypersurfaces in it. Moreover we have no realistic idea what these\nconstraints look like, so we hardly can be said to have evidence that\nthey do not obtain.\n\nCounterresponse 1. Of course there are constraining\nrelations between the global structure of space-time and the matter in\nit. The Einstein equations relate curvature of the manifold to the\nmatter distribution in it. But what is so strange and implausible\nabout the constraints imposed by the existence of closed time-like\ncurves is that these constraints in essence have nothing to do with\nthe Einstein equations. When investigating such constraints one\ntypically treats the particles and/or field in question as test\nparticles and/or fields in a given space-time, i.e., they are assumed\nnot to affect the metric of space-time in any way. In typical\nspace-times without closed time-like curves this means that one has,\nin essence, complete freedom of matter distribution on a space-like\nhypersurface. (See\n response 2\n for some more discussion of this issue). The constraints imposed by\nthe possibility of time travel have a quite different origin and are\nimplausible. In the ordinary case there is a causal interaction\nbetween matter and space-time that results in relations between global\nstructure of space-time and the matter distribution in it. In the time\ntravel case there is no such causal story to be told: there simply has\nto be some pre-established harmony between the global space-time\nstructure and the matter distribution on some space-like surfaces.\nThis is implausible.\n\nResponse 2. Constraints upon matter distributions are\nnothing new. For instance, Maxwell’s equations constrain\nelectric fields \\(\\boldsymbol{E}\\) on an initial surface to be related\nto the (simultaneous) charge density distribution \\(\\varrho\\) by the\nequation \\(\\varrho = \\text{div}(\\boldsymbol{E})\\). (If we assume that\nthe \\(E\\) field is generated solely by the charge distribution, this\nconditions amounts to requiring that the \\(E\\) field at any point in\nspace simply be the one generated by the charge distribution according\nto Coulomb’s inverse square law of electrostatics.) This is not\nimplausible divine harmony. Such constraints can hold as a matter of\nphysical law. Moreover, if we had inferred from the apparent free\nvariation of conditions on spatial regions that there could be no such\nconstraints we would have mistakenly inferred that \\(\\varrho =\n\\text{div}(\\boldsymbol{E})\\) could not be a law of nature.\n\nCounterresponse 2. The constraints imposed by the\nexistence of closed time-like lines are of quite a different character\nfrom the constraint imposed by \\(\\varrho =\n\\text{div}(\\boldsymbol{E})\\). The constraints imposed by \\(\\varrho =\n\\text{div}(\\boldsymbol{E})\\) on the state on a space-like hypersurface\nare:\n\nlocal constraints (i.e., to check whether the constraint holds in\na region you just need to see whether it holds at each point in the\nregion),\nquite independent of the global space-time structure,\nquite independent of how the space-like surface in question is\nembedded in a given space-time, and\nvery simply and generally stateable.\n\n\nOn the other hand, the consistency constraints imposed by the\nexistence of closed time-like curves (i) are not local, (ii) are\ndependent on the global structure of space-time, (iii) depend on the\nlocation of the space-like surface in question in a given space-time,\nand (iv) appear not to be simply stateable other than as the demand\nthat the state on that space-like surface embedded in such and such a\nway in a given space-time, do not lead to inconsistency. On some views\nof laws (e.g., David Lewis’ view) this plausibly implies that\nsuch constraints, even if they hold, could not possibly be laws. But\neven if one does not accept such a view of laws, one could claim that\nthe bizarre features of such constraints imply that it is implausible\nthat such constraints hold in our world or in any world remotely like\nours.\n\nResponse 3. It would be strange if there are\nconstraints in the non-time travel region. It is not strange if there\nare constraints in the time travel region. They should be explained in\nterms of the strange, self-interactive, character of time travel\nregions. In this region there are time-like trajectories from points\nto themselves. Thus the state at such a point, in such a region, will,\nin a sense, interact with itself. It is a well-known fact that systems\nthat interact with themselves will develop into an equilibrium state,\nif there is such an equilibrium state, or else will develop towards\nsome singularity. Normally, of course, self-interaction isn’t\ntrue instantaneous self-interaction, but consists of a feed-back\nmechanism that takes time. But in time travel regions something like\ntrue instantaneous self-interaction occurs. This explains why\nconstraints on states occur in such time travel regions: the states\n“ab initio” have to be “equilibrium\nstates”. Indeed in a way this also provides some picture of why\nindeterminism occurs in time travel regions: at the onset of\nself-interaction states can fork into different equi-possible\nequilibrium states.\n\nCounterresponse 3. This is explanation by woolly\nanalogy. It all goes to show that time travel leads to such bizarre\nconsequences that it is unlikely that it occurs in a world remotely\nlike ours.\n\n\nResponse 4. All of the previous discussion completely\nmisses the point. So far we have been taking the space-time structure\nas given, and asked the question whether a given time travel\nspace-time structure imposes constraints on states on (parts of)\nspace-like surfaces. However, space-time and matter interact. Suppose\nthat one is in a space-time with closed time-like lines, such that\ncertain counterfactual distributions of matter on some neighborhood of\na point \\(p\\) are ruled out if one holds that space-time structure\nfixed. One might then ask\n\n\nWhy does the actual state near \\(p\\) in fact satisfy these\nconstraints? By what divine luck or plan is this local state\ncompatible with the global space-time structure? What if conditions\nnear \\(p\\) had been slightly different?\n\n\nAnd one might take it that the lack of normal answers to these\nquestions indicates that it is very implausible that our world, or any\nremotely like it, is such a time travel universe. However the proper\nresponse to these question is the following. There are no constraints\nin any significant sense. If they hold they hold as a matter of\naccidental fact, not of law. There is no more explanation of them\npossible than there is of any contingent fact. Had conditions in a\nneighborhood of \\(p\\) been otherwise, the global structure of\nspace-time would have been different. So what? The only question\nrelevant to the issue of constraints is whether an arbitrary state on\nan arbitrary spatial surface \\(S\\) can always be embedded into a\nspace-time such that that state on \\(S\\) consistently extends to a\nsolution on the entire space-time.\n\nBut we know the answer to that question. A well-known theorem in\ngeneral relativity says the following: any initial data set on a three\ndimensional manifold \\(S\\) with positive definite metric has a unique\nembedding into a maximal space-time in which \\(S\\) is a Cauchy surface\n(see, e.g., Geroch & Horowitz 1979: 284 for more detail), i.e.,\nthere is a unique largest space-time which has \\(S\\) as a Cauchy\nsurface and contains a consistent evolution of the initial value data\non \\(S\\). Now since \\(S\\) is a Cauchy surface this space-time does not\nhave closed time like curves. But it may have extensions (in which\n\\(S\\) is not a Cauchy surface) which include closed timelike curves,\nindeed it may be that any maximal extension of it would include closed\ntimelike curves. (This appears to be the case for extensions of states\non certain surfaces of Taub-NUT space-times. See Earman, Smeenk, &\nWüthrich 2009). But these extensions, of course, will be\nconsistent. So properly speaking, there are no constraints on states\non space-like surfaces. Nonetheless the space-time in which these are\nembedded may or may not include closed time-like curves.\n\n\nCounterresponse 4. This, in essence, is the\nstonewalling answer which we indicated in section 1. However, whether\nor not you call the constraints imposed by a given space-time on\ndistributions of matter on certain space-like surfaces “genuine\nconstraints”, whether or not they can be considered lawlike, and\nwhether or not they need to be explained, the existence of such\nconstraints can still be used to argue that time travel worlds are so\nbizarre that it is implausible that our world or any world remotely\nlike ours is a time travel world.\n\nSuppose that one is in a time travel world. Suppose that given the\nglobal space-time structure of this world, there are constraints\nimposed upon, say, the state of motion of a ball on some space-like\nsurface when it is treated as a test particle, i.e., when it is\nassumed that the ball does not affect the metric properties of the\nspace-time it is in. (There is lots of other matter that, via the\nEinstein equation, corresponds exactly to the curvature that there is\neverywhere in this time travel worlds.) Now a real ball of course does\nhave some effect on the metric of the space-time it is in. But let us\nconsider a ball that is so small that its effect on the metric is\nnegligible. Presumably it will still be the case that certain states\nof this ball on that space-like surface are not compatible with the\nglobal time travel structure of this universe.\n\nThis means that the actual distribution of matter on such a space-like\nsurface can be extended into a space-time with closed time-like lines,\nbut that certain counterfactual distributions of matter on this\nspace-like surface can not be extended into the same space-time.\nBut note that the changes made in the matter distribution (when\ngoing from the actual to the counterfactual distribution) do not in\nany non-negligible way affect the metric properties of the\nspace-time. (Recall that the changes only effect test particles.)\nThus the reason why the global time travel properties of the\ncounterfactual space-time have to be significantly different from the\nactual space-time is not that there are problems with metric\nsingularities or alterations in the metric that force significant\nglobal changes when we go to the counterfactual matter distribution.\nThe reason that the counterfactual space-time has to be different is\nthat in the counterfactual world the ball’s initial state of\nmotion starting on the space-like surface, could not “meet\nup” in a consistent way with its earlier self (could not be\nconsistently extended) if we were to let the global structure of the\ncounterfactual space-time be the same as that of the actual\nspace-time. Now, it is not bizarre or implausible that there is a\ncounterfactual dependence of manifold structure, even of its topology,\non matter distributions on spacelike surfaces. For instance, certain\nmatter distributions may lead to singularities, others may not. We may\nindeed in some sense have causal power over the topology of the\nspace-time we live in. But this power normally comes via the Einstein\nequations. But it is bizarre to think that there could be a\ncounterfactual dependence of global space-time structure on the\narrangement of certain tiny bits of matter on some space-like surface,\nwhere changes in that arrangement by assumption do not affect the\nmetric anywhere in space-time in any significant way. It is\nimplausible that we live in such a world, or that a world even\nremotely like ours is like that.\n\nLet us illustrate this argument in a different way by assuming that\nwormhole time travel imposes constraints upon the states of people\nprior to such time travel, where the people have so little mass/energy\nthat they have negligible effect, via the Einstein equation, on the\nlocal metric properties of space-time. Do you think it more plausible\nthat we live in a world where wormhole time travel occurs but it only\noccurs when people’s states are such that these local states\nhappen to combine with time travel in such a way that nobody ever\nsucceeds in killing their younger self, or do you think it more\nplausible that we are not in a wormhole time travel\n world?[5]\n",
    "section_title": "7. Even If There are Constraints, So What?",
    "entry_title": "Time Travel and Modern Physics",
    "hierarchy_title": "Time Travel and Modern Physics || Even If There are Constraints, So What?",
    "tokenized_text": [
        "even",
        "constraint",
        "even",
        "constraint",
        "since",
        "obvious",
        "one",
        "rid",
        "oneself",
        "constraint",
        "realistic",
        "model",
        "let",
        "u",
        "examine",
        "argument",
        "time",
        "travel",
        "implausible",
        "think",
        "unlikely",
        "exist",
        "world",
        "far",
        "implies",
        "constraint",
        "argument",
        "go",
        "something",
        "like",
        "following",
        "order",
        "satisfy",
        "constraint",
        "one",
        "need",
        "preestablished",
        "divine",
        "harmony",
        "global",
        "time",
        "travel",
        "structure",
        "spacetime",
        "distribution",
        "particle",
        "field",
        "spacelike",
        "surface",
        "plausible",
        "actual",
        "world",
        "world",
        "even",
        "remotely",
        "like",
        "constructed",
        "divine",
        "harmony",
        "part",
        "plan",
        "fact",
        "one",
        "might",
        "argue",
        "empirical",
        "evidence",
        "condition",
        "spatial",
        "region",
        "vary",
        "quite",
        "arbitrarily",
        "evidence",
        "constraint",
        "whatever",
        "fact",
        "exist",
        "world",
        "evidence",
        "closed",
        "timelike",
        "line",
        "world",
        "one",
        "remotely",
        "like",
        "examine",
        "argument",
        "detail",
        "presenting",
        "four",
        "possible",
        "response",
        "counterresponses",
        "argument",
        "response",
        "nothing",
        "implausible",
        "new",
        "constraint",
        "instance",
        "universe",
        "spatially",
        "closed",
        "enough",
        "matter",
        "produce",
        "needed",
        "curvature",
        "put",
        "constraint",
        "matter",
        "distribution",
        "spacelike",
        "hypersurface",
        "thus",
        "global",
        "spacetime",
        "structure",
        "quite",
        "unproblematically",
        "constrain",
        "matter",
        "distribution",
        "spacelike",
        "hypersurfaces",
        "moreover",
        "realistic",
        "idea",
        "constraint",
        "look",
        "like",
        "hardly",
        "said",
        "evidence",
        "obtain",
        "counterresponse",
        "course",
        "constraining",
        "relation",
        "global",
        "structure",
        "spacetime",
        "matter",
        "einstein",
        "equation",
        "relate",
        "curvature",
        "manifold",
        "matter",
        "distribution",
        "strange",
        "implausible",
        "constraint",
        "imposed",
        "existence",
        "closed",
        "timelike",
        "curve",
        "constraint",
        "essence",
        "nothing",
        "einstein",
        "equation",
        "investigating",
        "constraint",
        "one",
        "typically",
        "treat",
        "particle",
        "andor",
        "field",
        "question",
        "test",
        "particle",
        "andor",
        "field",
        "given",
        "spacetime",
        "ie",
        "assumed",
        "affect",
        "metric",
        "spacetime",
        "way",
        "typical",
        "spacetime",
        "without",
        "closed",
        "timelike",
        "curve",
        "mean",
        "one",
        "essence",
        "complete",
        "freedom",
        "matter",
        "distribution",
        "spacelike",
        "hypersurface",
        "see",
        "response",
        "discussion",
        "issue",
        "constraint",
        "imposed",
        "possibility",
        "time",
        "travel",
        "quite",
        "different",
        "origin",
        "implausible",
        "ordinary",
        "case",
        "causal",
        "interaction",
        "matter",
        "spacetime",
        "result",
        "relation",
        "global",
        "structure",
        "spacetime",
        "matter",
        "distribution",
        "time",
        "travel",
        "case",
        "causal",
        "story",
        "told",
        "simply",
        "preestablished",
        "harmony",
        "global",
        "spacetime",
        "structure",
        "matter",
        "distribution",
        "spacelike",
        "surface",
        "implausible",
        "response",
        "constraint",
        "upon",
        "matter",
        "distribution",
        "nothing",
        "new",
        "instance",
        "maxwell",
        "equation",
        "constrain",
        "electric",
        "field",
        "boldsymbol",
        "e",
        "initial",
        "surface",
        "related",
        "simultaneous",
        "charge",
        "density",
        "distribution",
        "varrho",
        "equation",
        "varrho",
        "text",
        "div",
        "boldsymbol",
        "e",
        "assume",
        "e",
        "field",
        "generated",
        "solely",
        "charge",
        "distribution",
        "condition",
        "amount",
        "requiring",
        "e",
        "field",
        "point",
        "space",
        "simply",
        "one",
        "generated",
        "charge",
        "distribution",
        "according",
        "coulomb",
        "inverse",
        "square",
        "law",
        "electrostatics",
        "implausible",
        "divine",
        "harmony",
        "constraint",
        "hold",
        "matter",
        "physical",
        "law",
        "moreover",
        "inferred",
        "apparent",
        "free",
        "variation",
        "condition",
        "spatial",
        "region",
        "could",
        "constraint",
        "would",
        "mistakenly",
        "inferred",
        "varrho",
        "text",
        "div",
        "boldsymbol",
        "e",
        "could",
        "law",
        "nature",
        "counterresponse",
        "constraint",
        "imposed",
        "existence",
        "closed",
        "timelike",
        "line",
        "quite",
        "different",
        "character",
        "constraint",
        "imposed",
        "varrho",
        "text",
        "div",
        "boldsymbol",
        "e",
        "constraint",
        "imposed",
        "varrho",
        "text",
        "div",
        "boldsymbol",
        "e",
        "state",
        "spacelike",
        "hypersurface",
        "local",
        "constraint",
        "ie",
        "check",
        "whether",
        "constraint",
        "hold",
        "region",
        "need",
        "see",
        "whether",
        "hold",
        "point",
        "region",
        "quite",
        "independent",
        "global",
        "spacetime",
        "structure",
        "quite",
        "independent",
        "spacelike",
        "surface",
        "question",
        "embedded",
        "given",
        "spacetime",
        "simply",
        "generally",
        "stateable",
        "hand",
        "consistency",
        "constraint",
        "imposed",
        "existence",
        "closed",
        "timelike",
        "curve",
        "local",
        "ii",
        "dependent",
        "global",
        "structure",
        "spacetime",
        "iii",
        "depend",
        "location",
        "spacelike",
        "surface",
        "question",
        "given",
        "spacetime",
        "iv",
        "appear",
        "simply",
        "stateable",
        "demand",
        "state",
        "spacelike",
        "surface",
        "embedded",
        "way",
        "given",
        "spacetime",
        "lead",
        "inconsistency",
        "view",
        "law",
        "eg",
        "david",
        "lewis",
        "view",
        "plausibly",
        "implies",
        "constraint",
        "even",
        "hold",
        "could",
        "possibly",
        "law",
        "even",
        "one",
        "accept",
        "view",
        "law",
        "one",
        "could",
        "claim",
        "bizarre",
        "feature",
        "constraint",
        "imply",
        "implausible",
        "constraint",
        "hold",
        "world",
        "world",
        "remotely",
        "like",
        "response",
        "would",
        "strange",
        "constraint",
        "nontime",
        "travel",
        "region",
        "strange",
        "constraint",
        "time",
        "travel",
        "region",
        "explained",
        "term",
        "strange",
        "selfinteractive",
        "character",
        "time",
        "travel",
        "region",
        "region",
        "timelike",
        "trajectory",
        "point",
        "thus",
        "state",
        "point",
        "region",
        "sense",
        "interact",
        "wellknown",
        "fact",
        "system",
        "interact",
        "develop",
        "equilibrium",
        "state",
        "equilibrium",
        "state",
        "else",
        "develop",
        "towards",
        "singularity",
        "normally",
        "course",
        "selfinteraction",
        "true",
        "instantaneous",
        "selfinteraction",
        "consists",
        "feedback",
        "mechanism",
        "take",
        "time",
        "time",
        "travel",
        "region",
        "something",
        "like",
        "true",
        "instantaneous",
        "selfinteraction",
        "occurs",
        "explains",
        "constraint",
        "state",
        "occur",
        "time",
        "travel",
        "region",
        "state",
        "ab",
        "initio",
        "equilibrium",
        "state",
        "indeed",
        "way",
        "also",
        "provides",
        "picture",
        "indeterminism",
        "occurs",
        "time",
        "travel",
        "region",
        "onset",
        "selfinteraction",
        "state",
        "fork",
        "different",
        "equipossible",
        "equilibrium",
        "state",
        "counterresponse",
        "explanation",
        "woolly",
        "analogy",
        "go",
        "show",
        "time",
        "travel",
        "lead",
        "bizarre",
        "consequence",
        "unlikely",
        "occurs",
        "world",
        "remotely",
        "like",
        "response",
        "previous",
        "discussion",
        "completely",
        "miss",
        "point",
        "far",
        "taking",
        "spacetime",
        "structure",
        "given",
        "asked",
        "question",
        "whether",
        "given",
        "time",
        "travel",
        "spacetime",
        "structure",
        "imposes",
        "constraint",
        "state",
        "part",
        "spacelike",
        "surface",
        "however",
        "spacetime",
        "matter",
        "interact",
        "suppose",
        "one",
        "spacetime",
        "closed",
        "timelike",
        "line",
        "certain",
        "counterfactual",
        "distribution",
        "matter",
        "neighborhood",
        "point",
        "p",
        "ruled",
        "one",
        "hold",
        "spacetime",
        "structure",
        "fixed",
        "one",
        "might",
        "ask",
        "actual",
        "state",
        "near",
        "p",
        "fact",
        "satisfy",
        "constraint",
        "divine",
        "luck",
        "plan",
        "local",
        "state",
        "compatible",
        "global",
        "spacetime",
        "structure",
        "condition",
        "near",
        "p",
        "slightly",
        "different",
        "one",
        "might",
        "take",
        "lack",
        "normal",
        "answer",
        "question",
        "indicates",
        "implausible",
        "world",
        "remotely",
        "like",
        "time",
        "travel",
        "universe",
        "however",
        "proper",
        "response",
        "question",
        "following",
        "constraint",
        "significant",
        "sense",
        "hold",
        "hold",
        "matter",
        "accidental",
        "fact",
        "law",
        "explanation",
        "possible",
        "contingent",
        "fact",
        "condition",
        "neighborhood",
        "p",
        "otherwise",
        "global",
        "structure",
        "spacetime",
        "would",
        "different",
        "question",
        "relevant",
        "issue",
        "constraint",
        "whether",
        "arbitrary",
        "state",
        "arbitrary",
        "spatial",
        "surface",
        "s",
        "always",
        "embedded",
        "spacetime",
        "state",
        "s",
        "consistently",
        "extends",
        "solution",
        "entire",
        "spacetime",
        "know",
        "answer",
        "question",
        "wellknown",
        "theorem",
        "general",
        "relativity",
        "say",
        "following",
        "initial",
        "data",
        "set",
        "three",
        "dimensional",
        "manifold",
        "s",
        "positive",
        "definite",
        "metric",
        "unique",
        "embedding",
        "maximal",
        "spacetime",
        "s",
        "cauchy",
        "surface",
        "see",
        "eg",
        "geroch",
        "horowitz",
        "detail",
        "ie",
        "unique",
        "largest",
        "spacetime",
        "s",
        "cauchy",
        "surface",
        "contains",
        "consistent",
        "evolution",
        "initial",
        "value",
        "data",
        "s",
        "since",
        "s",
        "cauchy",
        "surface",
        "spacetime",
        "closed",
        "time",
        "like",
        "curve",
        "may",
        "extension",
        "s",
        "cauchy",
        "surface",
        "include",
        "closed",
        "timelike",
        "curve",
        "indeed",
        "may",
        "maximal",
        "extension",
        "would",
        "include",
        "closed",
        "timelike",
        "curve",
        "appears",
        "case",
        "extension",
        "state",
        "certain",
        "surface",
        "taubnut",
        "spacetime",
        "see",
        "earman",
        "smeenk",
        "wüthrich",
        "extension",
        "course",
        "consistent",
        "properly",
        "speaking",
        "constraint",
        "state",
        "spacelike",
        "surface",
        "nonetheless",
        "spacetime",
        "embedded",
        "may",
        "may",
        "include",
        "closed",
        "timelike",
        "curve",
        "counterresponse",
        "essence",
        "stonewalling",
        "answer",
        "indicated",
        "section",
        "however",
        "whether",
        "call",
        "constraint",
        "imposed",
        "given",
        "spacetime",
        "distribution",
        "matter",
        "certain",
        "spacelike",
        "surface",
        "genuine",
        "constraint",
        "whether",
        "considered",
        "lawlike",
        "whether",
        "need",
        "explained",
        "existence",
        "constraint",
        "still",
        "used",
        "argue",
        "time",
        "travel",
        "world",
        "bizarre",
        "implausible",
        "world",
        "world",
        "remotely",
        "like",
        "time",
        "travel",
        "world",
        "suppose",
        "one",
        "time",
        "travel",
        "world",
        "suppose",
        "given",
        "global",
        "spacetime",
        "structure",
        "world",
        "constraint",
        "imposed",
        "upon",
        "say",
        "state",
        "motion",
        "ball",
        "spacelike",
        "surface",
        "treated",
        "test",
        "particle",
        "ie",
        "assumed",
        "ball",
        "affect",
        "metric",
        "property",
        "spacetime",
        "lot",
        "matter",
        "via",
        "einstein",
        "equation",
        "corresponds",
        "exactly",
        "curvature",
        "everywhere",
        "time",
        "travel",
        "world",
        "real",
        "ball",
        "course",
        "effect",
        "metric",
        "spacetime",
        "let",
        "u",
        "consider",
        "ball",
        "small",
        "effect",
        "metric",
        "negligible",
        "presumably",
        "still",
        "case",
        "certain",
        "state",
        "ball",
        "spacelike",
        "surface",
        "compatible",
        "global",
        "time",
        "travel",
        "structure",
        "universe",
        "mean",
        "actual",
        "distribution",
        "matter",
        "spacelike",
        "surface",
        "extended",
        "spacetime",
        "closed",
        "timelike",
        "line",
        "certain",
        "counterfactual",
        "distribution",
        "matter",
        "spacelike",
        "surface",
        "extended",
        "spacetime",
        "note",
        "change",
        "made",
        "matter",
        "distribution",
        "going",
        "actual",
        "counterfactual",
        "distribution",
        "nonnegligible",
        "way",
        "affect",
        "metric",
        "property",
        "spacetime",
        "recall",
        "change",
        "effect",
        "test",
        "particle",
        "thus",
        "reason",
        "global",
        "time",
        "travel",
        "property",
        "counterfactual",
        "spacetime",
        "significantly",
        "different",
        "actual",
        "spacetime",
        "problem",
        "metric",
        "singularity",
        "alteration",
        "metric",
        "force",
        "significant",
        "global",
        "change",
        "go",
        "counterfactual",
        "matter",
        "distribution",
        "reason",
        "counterfactual",
        "spacetime",
        "different",
        "counterfactual",
        "world",
        "ball",
        "initial",
        "state",
        "motion",
        "starting",
        "spacelike",
        "surface",
        "could",
        "meet",
        "consistent",
        "way",
        "earlier",
        "self",
        "could",
        "consistently",
        "extended",
        "let",
        "global",
        "structure",
        "counterfactual",
        "spacetime",
        "actual",
        "spacetime",
        "bizarre",
        "implausible",
        "counterfactual",
        "dependence",
        "manifold",
        "structure",
        "even",
        "topology",
        "matter",
        "distribution",
        "spacelike",
        "surface",
        "instance",
        "certain",
        "matter",
        "distribution",
        "may",
        "lead",
        "singularity",
        "others",
        "may",
        "may",
        "indeed",
        "sense",
        "causal",
        "power",
        "topology",
        "spacetime",
        "live",
        "power",
        "normally",
        "come",
        "via",
        "einstein",
        "equation",
        "bizarre",
        "think",
        "could",
        "counterfactual",
        "dependence",
        "global",
        "spacetime",
        "structure",
        "arrangement",
        "certain",
        "tiny",
        "bit",
        "matter",
        "spacelike",
        "surface",
        "change",
        "arrangement",
        "assumption",
        "affect",
        "metric",
        "anywhere",
        "spacetime",
        "significant",
        "way",
        "implausible",
        "live",
        "world",
        "world",
        "even",
        "remotely",
        "like",
        "like",
        "let",
        "u",
        "illustrate",
        "argument",
        "different",
        "way",
        "assuming",
        "wormhole",
        "time",
        "travel",
        "imposes",
        "constraint",
        "upon",
        "state",
        "people",
        "prior",
        "time",
        "travel",
        "people",
        "little",
        "massenergy",
        "negligible",
        "effect",
        "via",
        "einstein",
        "equation",
        "local",
        "metric",
        "property",
        "spacetime",
        "think",
        "plausible",
        "live",
        "world",
        "wormhole",
        "time",
        "travel",
        "occurs",
        "occurs",
        "people",
        "state",
        "local",
        "state",
        "happen",
        "combine",
        "time",
        "travel",
        "way",
        "nobody",
        "ever",
        "succeeds",
        "killing",
        "younger",
        "self",
        "think",
        "plausible",
        "wormhole",
        "time",
        "travel",
        "world"
    ]
}