{
    "main_text": "The History of Toleration\n3. The History of Toleration\n\nIn the course of the religious-political conflicts throughout Europe\nthat followed the Reformation, toleration became one of the central\nconcepts of political-philosophical discourse, yet its history reaches\nmuch further back into antiquity (for the following, see esp. Forst\n2013, part 1; cf. also Besier and Schreiner 1990, Nederman 2000,\nZagorin 2003, Creppel 2003, Kaplan 2007 and Bejan 2017). In stoic\nwritings, especially in Cicero, tolerantia is used as a term\nfor a virtue of endurance, of suffering bad luck, pain and injustice\nof various kinds in a proper, steadfast manner. But already in early\nChristian discourse, the term is applied to the challenge of coping\nwith religious difference and conflict. The works of Tertullian and\nCyprianus are most important in that respect.\n\nWithin the Christian framework, a number of arguments for toleration\nhave been developed, based on charity and love for those who err, for\nexample, or on the idea of the two kingdoms and of limited human\nauthority in matters of religious truth, i.e., in matters of the\ndivine kingdom. The most important and far-reaching justification of\ntoleration, however, is the principle credere non potest nisi\nvolens, which holds that only faith based on inner conviction is\npleasing to God, and that such faith has to develop from within,\nwithout external compulsion. Conscience therefore must not be and\ncannot be forced to adopt a certain faith, even if it were the true\none. Yet, Augustine who defends these arguments in his earlier\nwritings, later (when confronted with the danger of a schism between\nRoman Catholics and the so-called Donatists) came to the conclusion\nthat the same reasons of love, of the two kingdoms and of the freedom\nof conscience could also make intolerance and the use of force into a\nChristian duty, if it were the only way to save the soul of another\n(esp. Augustine 408, letter # 93). He cites numerous examples of\nreconverted Catholics to substantiate his position that the proper use\nof force combined with the right teaching can shake men loose from the\nwrong faith and open up their eyes so as to accept the\ntruth—still “from within.” Accordingly, individual\nconscience can and sometimes must be subjected to force. Christian\narguments thus both form the core of many modern justifications of\ntoleration and yet are janus-faced, always bound by the superior aim\nto serve the true faith. Similar to Augustine, Thomas Aquinas later\ndeveloped a number of reasons for limited and conditional toleration,\ndrawing especially strong limits against tolerating any form of\nheresy.\n\nThe question of peaceful coexistence of different\nfaiths—Christian, Jewish and Muslim—was much discussed in\nthe Middle Ages, especially in the 12th century. Abailard\nand Raimundus Lullus wrote inter-religious dialogues searching for\nways of defending the truth of Christian faith while also seeing some\ntruth—religious or at least ethical—in other religions. In\nJudaism and Islam, this was mirrored by writers such as Maimonides or\nIbn Rushd (Averroes), whose defense of philosophical truth-searching\nagainst religious dogma is arguably the most innovative of the period\n(see esp. Averroes 1180).\n\nNicolas of Cusa’s De Pace Fidei (1453) marks an\nimportant step towards a more comprehensive, Christian-humanist\nconception of toleration, though in the conversations among\nrepresentatives of different faiths his core idea of “one\nreligion in various rites” remains a Catholic one. Still, the\nsearch for common elements is a central, increasingly important topic\nin toleration discourses. This is much further developed in Erasmus of\nRotterdam’s humanist idea of a possible religious unity based on\na reduced core faith, trying to avoid religious strife about what\nErasmus saw as non-essential questions of faith\n(adiaphora).\n\nIn contrast with this “irenic” humanist approach, Luther\ndefended the protestant idea of the individual conscience bound only\nto the word of God, which marks the limits of the authority of the\nchurch as well as of the secular powers of the state (Luther 1523).\nThe traditional arguments of free conscience and of the two kingdoms\nwere radicalized in this period. The protestant humanist Sebastian\nCastellio (1554) attacks the intolerance of both Catholic and\nCalvinist practices and argues for the freedom of conscience and\nreason as prerequisites of true faith. In this period, decisive\nelements of early modern toleration discourse were formed: the\ndistinction between church authority and individual religious\nconscience on the one hand and the separation of religious and secular\nauthority on the other.\n\nJean Bodin’s work is important for the further development of\nmodern ideas of toleration in two ways. In his Six Books of a\nCommonweal (1576), he develops a purely political justification\nof toleration, following the thought of the so-called\nPolitiques, whose main concern was the stability of the\nstate. For them, the preservation of political sovereignty took\nprimacy over the preservation of religious unity, and toleration was\nrecommended as a superior policy in a situation of religious plurality\nand strife. This, however, does not amount to the (late modern) idea\nof a fully secular state with general religious liberty. More radical\nstill is Bodin’s religious-philosophical work on the\nColloquium of the Seven (1593), a discourse among\nrepresentatives of different faiths who disagree about fundamental\nreligious and metaphysical issues. For the first time in the tradition\nof religious discourse, in Bodin’s work there is no dominant\nposition, no obvious winners or losers. The agreement that the\nparticipants in the conversation find is based on respect for the\nothers and on the insight that religious differences, even though they\ncan be meaningfully discussed, cannot be resolved in a philosophical\ndiscourse by means of reason alone. Religious plurality is seen here\nas an enduring predicament of finite and historically situated human\nbeings, not as a state to be overcome by the victory of the one and\nonly true faith.\n\nMarked by bitter religious conflicts, the 17th century\nbrought forth a number of toleration theories, among them three\nparadigmatic classics: Baruch de Spinoza’s Tractatus\nTheologico-Politicus (1670), Pierre Bayle’s Commentaire\nPhilosophique (1686) and John Locke’s A Letter\nConcerning Toleration (1689). In his historical critique of\nbiblical religions Spinoza locates their core in the virtues of\njustice and love and separates it from both contested religious dogmas\nand from the philosophical search for truth. The state has the task of\nrealizing peace and justice, thus it has the right to regulate the\nexternal exercise of religion. The natural right to freedom of thought\nand judgment and to “inner” religion cannot, however, be\nentrusted to the state; here political authority finds the factual\nlimits of its power.\n\nBayle’s Commentaire is the most comprehensive attempt\nto refute the arguments for the duty of intolerance that go back to\nAugustine (and especially his interpretation of the parable\n“compel them to come in,” where the master orders his\nservants to force those who were invited to the prepared supper but\ndid not attend to come in; see Luke 14, 15ff.). In his elaborate\nargument against the use of force in matters of religion, Bayle does\nnot primarily take recourse to the idea that religious conscience must\nnot and cannot be forced, for he was aware of the powerful Augustinian\narguments against both points (cf. Forst 2008 and Kilcullen 1988).\nRather, Bayle argued that there is a “natural light” of\npractical reason revealing certain moral truths to every sincere\nperson, regardless of his or her faith, even including atheists. And\nsuch principles of moral respect and of reciprocity cannot be trumped\nby religious truths, according to Bayle, for reasonable religious\nfaith is aware that ultimately it is based on personal faith and\ntrust, not on apprehensions of objective truth. This has often been\nseen as a skeptical argument, yet this is not what Bayle intended;\nwhat he suggested, rather, was that the truths of religion are of a\ndifferent epistemological character than truths arrived at by the use\nof reason alone. Connecting moral and epistemological arguments in\nthis way, Bayle was the first thinker to try to develop a universally\nvalid argument for toleration, one that implied universal toleration\nof persons of different faiths as well as of those seen as lacking any\nfaith.\n\nIn important respects, this is a more radical theory than the (much\nmore popular and influential) one developed by Locke, who\ndistinguishes between state and church in an early liberal perspective\nof natural individual rights. While it is the duty of the state to\nsecure the “civil interests” of its citizens, the\n“care of the soul” cannot be its business, this being a\nmatter between the individual and God to whom alone one is responsible\nin this regard. Hence there is a God-given, inalienable right to the\nfree exercise of religion. Churches are no more than voluntary\nassociations without any right to use force within a legitimate\npolitical order based on the consent of the governed. Locke draws the\nlimits of toleration where a religion does not accept its proper place\nin civil society (such as Catholicism, in Locke’s eyes) as well\nas where atheists deny any higher moral authority and therefore\ndestroy the basis of social order.\n\nIn the 18th century, the conception of a secular state with\nan independent basis of authority and the distinction between the\nroles of citizen and believer in a certain faith were further\ndeveloped, even though Locke’s thought that a stable political\norder did require some common religious basis persisted (with a few\nexceptions, such as the French materialists). In the course of the\nAmerican and the French Revolutions a basic “natural”\nright to religious liberty was recognized, even though the\ninterpretations of what kind of religious dissent could be tolerated\ndiffered.\n\nThinkers of the French Enlightenment argued for toleration on various\ngrounds and, as in Bodin, there was a difference between a focus on\npolitical stability and a focus on religious coexistence. In his\nOn the Spirit of the Laws (1748), Montesquieu argues for the\ntoleration of different religions for the purpose of preserving\npolitical unity and peace, yet he warns that there is a limit to the\nacceptance of new religions or changes to the dominant one, given the\nconnection between a constitution and the morality and habits of a\npeople. In his Persian Letters (1721), however, he had\ndeveloped a more comprehensive theory of religious pluralism. The\ndifference between the two perspectives—political and\ninter-religious—is even more notable in Jean-Jacques\nRousseau’s writings. In his Social Contract (1762), he\ntries to overcome religious strife and intolerance by\ninstitutionalizing a “civic religion” that must be shared\nby all, while in his Emile (1762) he argues for the primacy\nof individual conscience as well as for the aim of a non-dogmatic\n“natural religion.”\n\nThe idea of a “religion of reason” as an alternative to\nestablished religions for the sake of overcoming the quarrels between\nthem was typical for the Enlightenment, and is found in thinkers such\nas Voltaire, Diderot and Kant. In his parable of the rings (which goes\nback to medieval precursors) in the play Nathan the Wise\n(1779), G. E. Lessing offers a powerful image for the peaceful\ncompetition of established religions that both underlines their common\nancestry as well as their differences due to multiple historical\ntraditions of faith. Since there is no objective proof as to their\ntruth for the time being, they are called upon to deliver such proof\nby acting morally and harmoniously until the end of time.\n\nJohn Stuart Mill’s On Liberty (1859) marks the\ntransition to a modern conception of toleration, one that is no longer\noccupied with the question of religious harmony and does not restrict\nthe issue of toleration to religious differences. In Mill’s\neyes, in modern society toleration is also required to cope with other\nforms of irreconcilable cultural, social and political plurality. Mill\noffers three main arguments for toleration. According to his\n“harm principle,” the exercise of political or social\npower is only legitimate if necessary to prevent serious harm done to\none person by another, not to enforce some idea of the good in a\npaternalistic manner. Toleration towards opinions is justified by the\nutilitarian consideration that not just true, but also false opinions\nlead to productive social learning processes. Finally, toleration\ntowards unusual “experiments of living” is justified in a\nromantic way (following Wilhelm von Humboldt), stressing the values of\nindividuality and originality.\n\nThe story of toleration would have to be continued after Mill up to\nthe present, yet this short overview might suffice to draw attention\nto the long and complex history of the concept and to the many forms\nit took as well as the different justifications offered for it. Seen\nhistorically, toleration has been many things: An exercise of love for\nthe other who errs, a strategy of preserving power by offering some\nform of freedom to minorities, a term for the peaceful coexistence of\ndifferent faiths who share a common core, another word for the respect\nfor individual liberty, a postulate of practical reason, or the\nethical promise of a productive pluralistic society.\n",
    "section_title": "3. The History of Toleration",
    "entry_title": "Toleration",
    "hierarchy_title": "Toleration || The History of Toleration",
    "tokenized_text": [
        "history",
        "toleration",
        "history",
        "toleration",
        "course",
        "religiouspolitical",
        "conflict",
        "throughout",
        "europe",
        "followed",
        "reformation",
        "toleration",
        "became",
        "one",
        "central",
        "concept",
        "politicalphilosophical",
        "discourse",
        "yet",
        "history",
        "reach",
        "much",
        "back",
        "antiquity",
        "following",
        "see",
        "esp",
        "forst",
        "part",
        "cf",
        "also",
        "besier",
        "schreiner",
        "nederman",
        "zagorin",
        "creppel",
        "kaplan",
        "bejan",
        "stoic",
        "writing",
        "especially",
        "cicero",
        "tolerantia",
        "used",
        "term",
        "virtue",
        "endurance",
        "suffering",
        "bad",
        "luck",
        "pain",
        "injustice",
        "various",
        "kind",
        "proper",
        "steadfast",
        "manner",
        "already",
        "early",
        "christian",
        "discourse",
        "term",
        "applied",
        "challenge",
        "coping",
        "religious",
        "difference",
        "conflict",
        "work",
        "tertullian",
        "cyprianus",
        "important",
        "respect",
        "within",
        "christian",
        "framework",
        "number",
        "argument",
        "toleration",
        "developed",
        "based",
        "charity",
        "love",
        "err",
        "example",
        "idea",
        "two",
        "kingdom",
        "limited",
        "human",
        "authority",
        "matter",
        "religious",
        "truth",
        "ie",
        "matter",
        "divine",
        "kingdom",
        "important",
        "farreaching",
        "justification",
        "toleration",
        "however",
        "principle",
        "credere",
        "non",
        "potest",
        "nisi",
        "volens",
        "hold",
        "faith",
        "based",
        "inner",
        "conviction",
        "pleasing",
        "god",
        "faith",
        "develop",
        "within",
        "without",
        "external",
        "compulsion",
        "conscience",
        "therefore",
        "must",
        "forced",
        "adopt",
        "certain",
        "faith",
        "even",
        "true",
        "one",
        "yet",
        "augustine",
        "defends",
        "argument",
        "earlier",
        "writing",
        "later",
        "confronted",
        "danger",
        "schism",
        "roman",
        "catholic",
        "socalled",
        "donatist",
        "came",
        "conclusion",
        "reason",
        "love",
        "two",
        "kingdom",
        "freedom",
        "conscience",
        "could",
        "also",
        "make",
        "intolerance",
        "use",
        "force",
        "christian",
        "duty",
        "way",
        "save",
        "soul",
        "another",
        "esp",
        "augustine",
        "letter",
        "cite",
        "numerous",
        "example",
        "reconverted",
        "catholic",
        "substantiate",
        "position",
        "proper",
        "use",
        "force",
        "combined",
        "right",
        "teaching",
        "shake",
        "men",
        "loose",
        "wrong",
        "faith",
        "open",
        "eye",
        "accept",
        "truthstill",
        "within",
        "accordingly",
        "individual",
        "conscience",
        "sometimes",
        "must",
        "subjected",
        "force",
        "christian",
        "argument",
        "thus",
        "form",
        "core",
        "many",
        "modern",
        "justification",
        "toleration",
        "yet",
        "janusfaced",
        "always",
        "bound",
        "superior",
        "aim",
        "serve",
        "true",
        "faith",
        "similar",
        "augustine",
        "thomas",
        "aquinas",
        "later",
        "developed",
        "number",
        "reason",
        "limited",
        "conditional",
        "toleration",
        "drawing",
        "especially",
        "strong",
        "limit",
        "tolerating",
        "form",
        "heresy",
        "question",
        "peaceful",
        "coexistence",
        "different",
        "faithschristian",
        "jewish",
        "muslimwas",
        "much",
        "discussed",
        "middle",
        "age",
        "especially",
        "th",
        "century",
        "abailard",
        "raimundus",
        "lullus",
        "wrote",
        "interreligious",
        "dialogue",
        "searching",
        "way",
        "defending",
        "truth",
        "christian",
        "faith",
        "also",
        "seeing",
        "truthreligious",
        "least",
        "ethicalin",
        "religion",
        "judaism",
        "islam",
        "mirrored",
        "writer",
        "maimonides",
        "ibn",
        "rushd",
        "averroes",
        "whose",
        "defense",
        "philosophical",
        "truthsearching",
        "religious",
        "dogma",
        "arguably",
        "innovative",
        "period",
        "see",
        "esp",
        "averroes",
        "nicolas",
        "cusa",
        "de",
        "pace",
        "fidei",
        "mark",
        "important",
        "step",
        "towards",
        "comprehensive",
        "christianhumanist",
        "conception",
        "toleration",
        "though",
        "conversation",
        "among",
        "representative",
        "different",
        "faith",
        "core",
        "idea",
        "one",
        "religion",
        "various",
        "rite",
        "remains",
        "catholic",
        "one",
        "still",
        "search",
        "common",
        "element",
        "central",
        "increasingly",
        "important",
        "topic",
        "toleration",
        "discourse",
        "much",
        "developed",
        "erasmus",
        "rotterdam",
        "humanist",
        "idea",
        "possible",
        "religious",
        "unity",
        "based",
        "reduced",
        "core",
        "faith",
        "trying",
        "avoid",
        "religious",
        "strife",
        "erasmus",
        "saw",
        "nonessential",
        "question",
        "faith",
        "adiaphora",
        "contrast",
        "irenic",
        "humanist",
        "approach",
        "luther",
        "defended",
        "protestant",
        "idea",
        "individual",
        "conscience",
        "bound",
        "word",
        "god",
        "mark",
        "limit",
        "authority",
        "church",
        "well",
        "secular",
        "power",
        "state",
        "luther",
        "traditional",
        "argument",
        "free",
        "conscience",
        "two",
        "kingdom",
        "radicalized",
        "period",
        "protestant",
        "humanist",
        "sebastian",
        "castellio",
        "attack",
        "intolerance",
        "catholic",
        "calvinist",
        "practice",
        "argues",
        "freedom",
        "conscience",
        "reason",
        "prerequisite",
        "true",
        "faith",
        "period",
        "decisive",
        "element",
        "early",
        "modern",
        "toleration",
        "discourse",
        "formed",
        "distinction",
        "church",
        "authority",
        "individual",
        "religious",
        "conscience",
        "one",
        "hand",
        "separation",
        "religious",
        "secular",
        "authority",
        "jean",
        "bodin",
        "work",
        "important",
        "development",
        "modern",
        "idea",
        "toleration",
        "two",
        "way",
        "six",
        "book",
        "commonweal",
        "develops",
        "purely",
        "political",
        "justification",
        "toleration",
        "following",
        "thought",
        "socalled",
        "politiques",
        "whose",
        "main",
        "concern",
        "stability",
        "state",
        "preservation",
        "political",
        "sovereignty",
        "took",
        "primacy",
        "preservation",
        "religious",
        "unity",
        "toleration",
        "recommended",
        "superior",
        "policy",
        "situation",
        "religious",
        "plurality",
        "strife",
        "however",
        "amount",
        "late",
        "modern",
        "idea",
        "fully",
        "secular",
        "state",
        "general",
        "religious",
        "liberty",
        "radical",
        "still",
        "bodin",
        "religiousphilosophical",
        "work",
        "colloquium",
        "seven",
        "discourse",
        "among",
        "representative",
        "different",
        "faith",
        "disagree",
        "fundamental",
        "religious",
        "metaphysical",
        "issue",
        "first",
        "time",
        "tradition",
        "religious",
        "discourse",
        "bodin",
        "work",
        "dominant",
        "position",
        "obvious",
        "winner",
        "loser",
        "agreement",
        "participant",
        "conversation",
        "find",
        "based",
        "respect",
        "others",
        "insight",
        "religious",
        "difference",
        "even",
        "though",
        "meaningfully",
        "discussed",
        "resolved",
        "philosophical",
        "discourse",
        "mean",
        "reason",
        "alone",
        "religious",
        "plurality",
        "seen",
        "enduring",
        "predicament",
        "finite",
        "historically",
        "situated",
        "human",
        "being",
        "state",
        "overcome",
        "victory",
        "one",
        "true",
        "faith",
        "marked",
        "bitter",
        "religious",
        "conflict",
        "th",
        "century",
        "brought",
        "forth",
        "number",
        "toleration",
        "theory",
        "among",
        "three",
        "paradigmatic",
        "classic",
        "baruch",
        "de",
        "spinoza",
        "tractatus",
        "theologicopoliticus",
        "pierre",
        "bayle",
        "commentaire",
        "philosophique",
        "john",
        "locke",
        "letter",
        "concerning",
        "toleration",
        "historical",
        "critique",
        "biblical",
        "religion",
        "spinoza",
        "locates",
        "core",
        "virtue",
        "justice",
        "love",
        "separate",
        "contested",
        "religious",
        "dogma",
        "philosophical",
        "search",
        "truth",
        "state",
        "task",
        "realizing",
        "peace",
        "justice",
        "thus",
        "right",
        "regulate",
        "external",
        "exercise",
        "religion",
        "natural",
        "right",
        "freedom",
        "thought",
        "judgment",
        "inner",
        "religion",
        "however",
        "entrusted",
        "state",
        "political",
        "authority",
        "find",
        "factual",
        "limit",
        "power",
        "bayle",
        "commentaire",
        "comprehensive",
        "attempt",
        "refute",
        "argument",
        "duty",
        "intolerance",
        "go",
        "back",
        "augustine",
        "especially",
        "interpretation",
        "parable",
        "compel",
        "come",
        "master",
        "order",
        "servant",
        "force",
        "invited",
        "prepared",
        "supper",
        "attend",
        "come",
        "see",
        "luke",
        "ff",
        "elaborate",
        "argument",
        "use",
        "force",
        "matter",
        "religion",
        "bayle",
        "primarily",
        "take",
        "recourse",
        "idea",
        "religious",
        "conscience",
        "must",
        "forced",
        "aware",
        "powerful",
        "augustinian",
        "argument",
        "point",
        "cf",
        "forst",
        "kilcullen",
        "rather",
        "bayle",
        "argued",
        "natural",
        "light",
        "practical",
        "reason",
        "revealing",
        "certain",
        "moral",
        "truth",
        "every",
        "sincere",
        "person",
        "regardless",
        "faith",
        "even",
        "including",
        "atheist",
        "principle",
        "moral",
        "respect",
        "reciprocity",
        "trumped",
        "religious",
        "truth",
        "according",
        "bayle",
        "reasonable",
        "religious",
        "faith",
        "aware",
        "ultimately",
        "based",
        "personal",
        "faith",
        "trust",
        "apprehension",
        "objective",
        "truth",
        "often",
        "seen",
        "skeptical",
        "argument",
        "yet",
        "bayle",
        "intended",
        "suggested",
        "rather",
        "truth",
        "religion",
        "different",
        "epistemological",
        "character",
        "truth",
        "arrived",
        "use",
        "reason",
        "alone",
        "connecting",
        "moral",
        "epistemological",
        "argument",
        "way",
        "bayle",
        "first",
        "thinker",
        "try",
        "develop",
        "universally",
        "valid",
        "argument",
        "toleration",
        "one",
        "implied",
        "universal",
        "toleration",
        "person",
        "different",
        "faith",
        "well",
        "seen",
        "lacking",
        "faith",
        "important",
        "respect",
        "radical",
        "theory",
        "much",
        "popular",
        "influential",
        "one",
        "developed",
        "locke",
        "distinguishes",
        "state",
        "church",
        "early",
        "liberal",
        "perspective",
        "natural",
        "individual",
        "right",
        "duty",
        "state",
        "secure",
        "civil",
        "interest",
        "citizen",
        "care",
        "soul",
        "business",
        "matter",
        "individual",
        "god",
        "alone",
        "one",
        "responsible",
        "regard",
        "hence",
        "godgiven",
        "inalienable",
        "right",
        "free",
        "exercise",
        "religion",
        "church",
        "voluntary",
        "association",
        "without",
        "right",
        "use",
        "force",
        "within",
        "legitimate",
        "political",
        "order",
        "based",
        "consent",
        "governed",
        "locke",
        "draw",
        "limit",
        "toleration",
        "religion",
        "accept",
        "proper",
        "place",
        "civil",
        "society",
        "catholicism",
        "locke",
        "eye",
        "well",
        "atheist",
        "deny",
        "higher",
        "moral",
        "authority",
        "therefore",
        "destroy",
        "basis",
        "social",
        "order",
        "th",
        "century",
        "conception",
        "secular",
        "state",
        "independent",
        "basis",
        "authority",
        "distinction",
        "role",
        "citizen",
        "believer",
        "certain",
        "faith",
        "developed",
        "even",
        "though",
        "locke",
        "thought",
        "stable",
        "political",
        "order",
        "require",
        "common",
        "religious",
        "basis",
        "persisted",
        "exception",
        "french",
        "materialist",
        "course",
        "american",
        "french",
        "revolution",
        "basic",
        "natural",
        "right",
        "religious",
        "liberty",
        "recognized",
        "even",
        "though",
        "interpretation",
        "kind",
        "religious",
        "dissent",
        "could",
        "tolerated",
        "differed",
        "thinker",
        "french",
        "enlightenment",
        "argued",
        "toleration",
        "various",
        "ground",
        "bodin",
        "difference",
        "focus",
        "political",
        "stability",
        "focus",
        "religious",
        "coexistence",
        "spirit",
        "law",
        "montesquieu",
        "argues",
        "toleration",
        "different",
        "religion",
        "purpose",
        "preserving",
        "political",
        "unity",
        "peace",
        "yet",
        "warns",
        "limit",
        "acceptance",
        "new",
        "religion",
        "change",
        "dominant",
        "one",
        "given",
        "connection",
        "constitution",
        "morality",
        "habit",
        "people",
        "persian",
        "letter",
        "however",
        "developed",
        "comprehensive",
        "theory",
        "religious",
        "pluralism",
        "difference",
        "two",
        "perspectivespolitical",
        "interreligiousis",
        "even",
        "notable",
        "jeanjacques",
        "rousseau",
        "writing",
        "social",
        "contract",
        "try",
        "overcome",
        "religious",
        "strife",
        "intolerance",
        "institutionalizing",
        "civic",
        "religion",
        "must",
        "shared",
        "emile",
        "argues",
        "primacy",
        "individual",
        "conscience",
        "well",
        "aim",
        "nondogmatic",
        "natural",
        "religion",
        "idea",
        "religion",
        "reason",
        "alternative",
        "established",
        "religion",
        "sake",
        "overcoming",
        "quarrel",
        "typical",
        "enlightenment",
        "found",
        "thinker",
        "voltaire",
        "diderot",
        "kant",
        "parable",
        "ring",
        "go",
        "back",
        "medieval",
        "precursor",
        "play",
        "nathan",
        "wise",
        "g",
        "e",
        "lessing",
        "offer",
        "powerful",
        "image",
        "peaceful",
        "competition",
        "established",
        "religion",
        "underline",
        "common",
        "ancestry",
        "well",
        "difference",
        "due",
        "multiple",
        "historical",
        "tradition",
        "faith",
        "since",
        "objective",
        "proof",
        "truth",
        "time",
        "called",
        "upon",
        "deliver",
        "proof",
        "acting",
        "morally",
        "harmoniously",
        "end",
        "time",
        "john",
        "stuart",
        "mill",
        "liberty",
        "mark",
        "transition",
        "modern",
        "conception",
        "toleration",
        "one",
        "longer",
        "occupied",
        "question",
        "religious",
        "harmony",
        "restrict",
        "issue",
        "toleration",
        "religious",
        "difference",
        "mill",
        "eye",
        "modern",
        "society",
        "toleration",
        "also",
        "required",
        "cope",
        "form",
        "irreconcilable",
        "cultural",
        "social",
        "political",
        "plurality",
        "mill",
        "offer",
        "three",
        "main",
        "argument",
        "toleration",
        "according",
        "harm",
        "principle",
        "exercise",
        "political",
        "social",
        "power",
        "legitimate",
        "necessary",
        "prevent",
        "serious",
        "harm",
        "done",
        "one",
        "person",
        "another",
        "enforce",
        "idea",
        "good",
        "paternalistic",
        "manner",
        "toleration",
        "towards",
        "opinion",
        "justified",
        "utilitarian",
        "consideration",
        "true",
        "also",
        "false",
        "opinion",
        "lead",
        "productive",
        "social",
        "learning",
        "process",
        "finally",
        "toleration",
        "towards",
        "unusual",
        "experiment",
        "living",
        "justified",
        "romantic",
        "way",
        "following",
        "wilhelm",
        "von",
        "humboldt",
        "stressing",
        "value",
        "individuality",
        "originality",
        "story",
        "toleration",
        "would",
        "continued",
        "mill",
        "present",
        "yet",
        "short",
        "overview",
        "might",
        "suffice",
        "draw",
        "attention",
        "long",
        "complex",
        "history",
        "concept",
        "many",
        "form",
        "took",
        "well",
        "different",
        "justification",
        "offered",
        "seen",
        "historically",
        "toleration",
        "many",
        "thing",
        "exercise",
        "love",
        "errs",
        "strategy",
        "preserving",
        "power",
        "offering",
        "form",
        "freedom",
        "minority",
        "term",
        "peaceful",
        "coexistence",
        "different",
        "faith",
        "share",
        "common",
        "core",
        "another",
        "word",
        "respect",
        "individual",
        "liberty",
        "postulate",
        "practical",
        "reason",
        "ethical",
        "promise",
        "productive",
        "pluralistic",
        "society"
    ]
}