{
    "main_text": "Contemporary Philosophical Approaches to Tort Law || Economic Analysis\n4.1 Economic Analysis\n\nThe\n economic analysis of law\n treats tort law as a mechanism for regulating safety in the context\nof a broader focus on the efficient allocation of social resources.\nThis approach follows Holmes in rejecting the law’s moral\nvocabulary as misleading. Legal economists frequently point out that\nwe, as a society, have made a collective “Decision for\nAccidents” as Guido Calabresi put it in a widely discussed\narticle (1965). We allow people to travel by car and truck even though\nwe know statistically that this will lead to a certain number of\ndeaths per year. We allow major infrastructure projects that will\nimprove safety and convenience even though we know that people will be\ninjured or killed in the course of constructing them. Similar\ndecisions are made, implicitly or explicitly, in determining whether\nto permit a wide range of other activities with potential side effects\non participants or non-participants. Some level of risk is unavoidable\nand justified, but, when activities are carried out on a large scale,\nsome level of injury becomes inevitable; the economic problem is\nfinding the correct level. Rather than analyzing negligence liability\nin terms of what the defendant did to the plaintiff, legal economists\npropose to understand it in terms of a more general social decision to\ndetermine the appropriate amount of safety for which we, as a society,\nare prepared to pay. Life could be made much safer by prohibiting a\nwide range of risk-imposing conduct; economic rationality demands that\nsocieties face the question of whether safety becomes too expensive at\na certain point. For example, traffic accidents could be reduced\ndramatically by imposing speed limits of 5 mph; the cost in other\ngoods, however, including not only convenience but such things as food\nspoilage and emergency services, would be too high. Economic analysis\nproposes to treat tort law as the solution to an optimization problem\nof setting the level of safety that is worth the cost of the steps\ntaken to achieve it, and of allocating the costs of achieving such\nsafety.\n\nAnalyzed in economic terms, the amount of risk that is acceptable in\nsociety should ideally be determined in the same way that every\nquestion about the creation of a cost or benefit should ideally be\ndetermined, that is, through efficient market transactions. In a\nperfectly competitive market, with complete information and no\ntransaction costs, parties could be expected to negotiate, and\ndetermine the terms on which they exposed each other to risks (Posner\n1983). As Ronald Coase puts it in one of the foundational texts of the\neconomic analysis of law (1960), in conditions of perfect competition,\nparties concerned to advance their interests would always bargain\naround legal rules to reach an efficient result. A rational enterprise\nwill be indifferent between engaging in a profitable activity and\nreceiving equivalent payment to refrain from engaging in it. Without\ntransaction costs, legal rules would make no difference to the\nallocation of resources; the only effect of the legal rule would be to\ndetermine the direction of payments. Coase acknowledges that we live\nin a world in which transaction costs make bargaining infeasible. The\ncase of accidental injury illustrates this particularly starkly.\nNobody is in a position to negotiate with everyone who might be\ninjured through the side effects of their driving, cycling, or other\nactivities, or through products they produce; conversely, nobody could\nbe in a position to negotiate with everyone who potentially exposes\nthem to such risks. Thus, there is a problem which economists identify\nas market failure: the parties are unable to reach a mutually\nbeneficial arrangement. Economic analysis recommends the adoption of\nlegal rules that will provide people with incentives to approximate\nthe outcome that would have been achieved by market transactions with\nfull information and no transaction costs.\n\nEconomic analysts of law disagree amongst themselves about the\nappropriate structure of rules to reach the market-ideal level of\nrisk. Some advocate a rule of strict liability, according to which the\nperson carrying out an activity is made to “internalize”\nall of its costs. A rational economic actor engaged is such activities\nwho was forced to internalize is costs would be indifferent between\npaying the costs of avoiding the accident or paying the costs of the\naccident. They will therefore invest resources in avoidance costs up\nto the point at which doing so will reduce expected accident costs.\nStrict liability therefore will yield an optimal investment in safety.\nIt would give potential injurers an incentive to find innovative ways\nto make their activities safer, particularly in a world in which most\ninjuries are caused not by isolated acts but by ongoing activities\nsuch as the manufacture of consumer products or the operation of motor\nvehicles (Calabresi 1965).\n\nA second economic account, introduced by Richard Posner, analyzes the\nefficiency problem of safety differently. On this view, the negligence\nstandard is the appropriate tool to ensure that people neither\noverinvest nor underinvest in safety (Posner 1972). Economically\nrational agents will not overinvest in safety because they will not\nassume expenses from which they expect no return. Underinvestment in\nsafety is a potential problem, and so the key to an efficient level of\ninvestment in safety is to provide those imposing risks with the right\nincentive to reduce them. The appropriate level is set by making\ninjurers bear the cost of excessive risks that they impose. A\nspecific risk counts as excessive if the cost of reducing it is less\nthan the expected cost—the seriousness of the injury discounted\nby its likelihood—of allowing it to occur. If the burden of\nprecaution costs is greater than the discounted cost of the injury,\nthen it is economically rational for the law to permit the defendant\nto impose the risk. If someone is injured because it was not efficient\nto take a precaution, the injurer should not be held liable; provided\nthat the level of precaution taken was economically efficient,\ntransferring funds from the injurer to the injured party is merely\nredistributive, and does not improve the overall social allocation of\nresources. Posner contends that the only point of tort liability is to\nprovide incentives for optimal investment in safety; the fact that the\ndefendant pays the plaintiff in particular is incidental to the\naccount. Instead, Posner suggests that the plaintiff receives payment\nexclusively as an incentive to bring the lawsuit; in effect the\nplaintiff serves as a kind of private attorney general. The role of\nthe plaintiff in Posner’s analysis tracks the role of the\nplaintiff in the standard economic analysis of US antitrust law, in\nwhich damages are awarded to plaintiffs to incentivize them to bring\nsuits without those plaintiffs having been specially affected by the\npervasive negative consequences of anticompetitive behavior.\n\nSome of the ideas that inform economic accounts of tort law have been\naccepted by theorists who do not otherwise endorse such accounts. For\nexample, as part of his broader scheme of distributive justice, Ronald\nDworkin adopts one of its central claims, arguing that voluntary\ncontracting is the ideal solution to problems of social coordination,\nand that other areas of law need to be understood as attempts to\napproximate contractual results in cases of market failure. Dworkin\ndevelops this view in detail in his discussion of tort law as a\n“principle of correction” in (1986: 295), although he is\ncritical of the broader ambitions of economic analysis (Dworkin\n1980).\n\nEconomic analysis has a straightforward explanation of the objective\nstandard in the law of negligence: because tort liability is\nexclusively a matter of providing incentives for future conduct, the\nfact that the defendant was not in a position to avoid a particular\ninjury is irrelevant. Economic analysis views injuries in the past as\n“sunk costs” which can never be recovered. Making an\ninjurer pay for an injury that efficient precautions would have\navoided will provide the same incentive even if the specific injurer did\nnot realize precautions were required.\n\nEconomic analysis also proposes an explanation of why there is no\nliability for negligently causing economic loss in the absence of\nproperty damage. Posner illustrates his account with a case involving\nbusinesses on an island that customers are unable to reach because the\ndefendant negligently damaged the only bridge leading to it. Posner\nsuggests that those losses are not recoverable because the customers\nwill simply take their business elsewhere, and so there will be no net\nloss to the economy. It is not clear whether this account can be\nreconciled with the fact that the law would grant consequential losses\nto the businesses if they had owned the bridge that was damaged. In\nthat case, too, presumably the customers would have taken their\nbusiness elsewhere resulting in no net loss to the economy. (For a\ndifferent economic rationale for the law’s treatment of pure\neconomic loss, see Sharkey 2018.)\n",
    "section_title": "4.1 Economic Analysis",
    "entry_title": "Theories of the Common Law of Torts",
    "hierarchy_title": "Theories of the Common Law of Torts || Contemporary Philosophical Approaches to Tort Law || Economic Analysis",
    "tokenized_text": [
        "contemporary",
        "philosophical",
        "approach",
        "tort",
        "law",
        "economic",
        "analysis",
        "economic",
        "analysis",
        "economic",
        "analysis",
        "law",
        "treat",
        "tort",
        "law",
        "mechanism",
        "regulating",
        "safety",
        "context",
        "broader",
        "focus",
        "efficient",
        "allocation",
        "social",
        "resource",
        "approach",
        "follows",
        "holmes",
        "rejecting",
        "law",
        "moral",
        "vocabulary",
        "misleading",
        "legal",
        "economist",
        "frequently",
        "point",
        "society",
        "made",
        "collective",
        "decision",
        "accident",
        "guido",
        "calabresi",
        "put",
        "widely",
        "discussed",
        "article",
        "allow",
        "people",
        "travel",
        "car",
        "truck",
        "even",
        "though",
        "know",
        "statistically",
        "lead",
        "certain",
        "number",
        "death",
        "per",
        "year",
        "allow",
        "major",
        "infrastructure",
        "project",
        "improve",
        "safety",
        "convenience",
        "even",
        "though",
        "know",
        "people",
        "injured",
        "killed",
        "course",
        "constructing",
        "similar",
        "decision",
        "made",
        "implicitly",
        "explicitly",
        "determining",
        "whether",
        "permit",
        "wide",
        "range",
        "activity",
        "potential",
        "side",
        "effect",
        "participant",
        "nonparticipants",
        "level",
        "risk",
        "unavoidable",
        "justified",
        "activity",
        "carried",
        "large",
        "scale",
        "level",
        "injury",
        "becomes",
        "inevitable",
        "economic",
        "problem",
        "finding",
        "correct",
        "level",
        "rather",
        "analyzing",
        "negligence",
        "liability",
        "term",
        "defendant",
        "plaintiff",
        "legal",
        "economist",
        "propose",
        "understand",
        "term",
        "general",
        "social",
        "decision",
        "determine",
        "appropriate",
        "amount",
        "safety",
        "society",
        "prepared",
        "pay",
        "life",
        "could",
        "made",
        "much",
        "safer",
        "prohibiting",
        "wide",
        "range",
        "riskimposing",
        "conduct",
        "economic",
        "rationality",
        "demand",
        "society",
        "face",
        "question",
        "whether",
        "safety",
        "becomes",
        "expensive",
        "certain",
        "point",
        "example",
        "traffic",
        "accident",
        "could",
        "reduced",
        "dramatically",
        "imposing",
        "speed",
        "limit",
        "mph",
        "cost",
        "good",
        "however",
        "including",
        "convenience",
        "thing",
        "food",
        "spoilage",
        "emergency",
        "service",
        "would",
        "high",
        "economic",
        "analysis",
        "proposes",
        "treat",
        "tort",
        "law",
        "solution",
        "optimization",
        "problem",
        "setting",
        "level",
        "safety",
        "worth",
        "cost",
        "step",
        "taken",
        "achieve",
        "allocating",
        "cost",
        "achieving",
        "safety",
        "analyzed",
        "economic",
        "term",
        "amount",
        "risk",
        "acceptable",
        "society",
        "ideally",
        "determined",
        "way",
        "every",
        "question",
        "creation",
        "cost",
        "benefit",
        "ideally",
        "determined",
        "efficient",
        "market",
        "transaction",
        "perfectly",
        "competitive",
        "market",
        "complete",
        "information",
        "transaction",
        "cost",
        "party",
        "could",
        "expected",
        "negotiate",
        "determine",
        "term",
        "exposed",
        "risk",
        "posner",
        "ronald",
        "coase",
        "put",
        "one",
        "foundational",
        "text",
        "economic",
        "analysis",
        "law",
        "condition",
        "perfect",
        "competition",
        "party",
        "concerned",
        "advance",
        "interest",
        "would",
        "always",
        "bargain",
        "around",
        "legal",
        "rule",
        "reach",
        "efficient",
        "result",
        "rational",
        "enterprise",
        "indifferent",
        "engaging",
        "profitable",
        "activity",
        "receiving",
        "equivalent",
        "payment",
        "refrain",
        "engaging",
        "without",
        "transaction",
        "cost",
        "legal",
        "rule",
        "would",
        "make",
        "difference",
        "allocation",
        "resource",
        "effect",
        "legal",
        "rule",
        "would",
        "determine",
        "direction",
        "payment",
        "coase",
        "acknowledges",
        "live",
        "world",
        "transaction",
        "cost",
        "make",
        "bargaining",
        "infeasible",
        "case",
        "accidental",
        "injury",
        "illustrates",
        "particularly",
        "starkly",
        "nobody",
        "position",
        "negotiate",
        "everyone",
        "might",
        "injured",
        "side",
        "effect",
        "driving",
        "cycling",
        "activity",
        "product",
        "produce",
        "conversely",
        "nobody",
        "could",
        "position",
        "negotiate",
        "everyone",
        "potentially",
        "expose",
        "risk",
        "thus",
        "problem",
        "economist",
        "identify",
        "market",
        "failure",
        "party",
        "unable",
        "reach",
        "mutually",
        "beneficial",
        "arrangement",
        "economic",
        "analysis",
        "recommends",
        "adoption",
        "legal",
        "rule",
        "provide",
        "people",
        "incentive",
        "approximate",
        "outcome",
        "would",
        "achieved",
        "market",
        "transaction",
        "full",
        "information",
        "transaction",
        "cost",
        "economic",
        "analyst",
        "law",
        "disagree",
        "amongst",
        "appropriate",
        "structure",
        "rule",
        "reach",
        "marketideal",
        "level",
        "risk",
        "advocate",
        "rule",
        "strict",
        "liability",
        "according",
        "person",
        "carrying",
        "activity",
        "made",
        "internalize",
        "cost",
        "rational",
        "economic",
        "actor",
        "engaged",
        "activity",
        "forced",
        "internalize",
        "cost",
        "would",
        "indifferent",
        "paying",
        "cost",
        "avoiding",
        "accident",
        "paying",
        "cost",
        "accident",
        "therefore",
        "invest",
        "resource",
        "avoidance",
        "cost",
        "point",
        "reduce",
        "expected",
        "accident",
        "cost",
        "strict",
        "liability",
        "therefore",
        "yield",
        "optimal",
        "investment",
        "safety",
        "would",
        "give",
        "potential",
        "injurers",
        "incentive",
        "find",
        "innovative",
        "way",
        "make",
        "activity",
        "safer",
        "particularly",
        "world",
        "injury",
        "caused",
        "isolated",
        "act",
        "ongoing",
        "activity",
        "manufacture",
        "consumer",
        "product",
        "operation",
        "motor",
        "vehicle",
        "calabresi",
        "second",
        "economic",
        "account",
        "introduced",
        "richard",
        "posner",
        "analyzes",
        "efficiency",
        "problem",
        "safety",
        "differently",
        "view",
        "negligence",
        "standard",
        "appropriate",
        "tool",
        "ensure",
        "people",
        "neither",
        "overinvest",
        "underinvest",
        "safety",
        "posner",
        "economically",
        "rational",
        "agent",
        "overinvest",
        "safety",
        "assume",
        "expense",
        "expect",
        "return",
        "underinvestment",
        "safety",
        "potential",
        "problem",
        "key",
        "efficient",
        "level",
        "investment",
        "safety",
        "provide",
        "imposing",
        "risk",
        "right",
        "incentive",
        "reduce",
        "appropriate",
        "level",
        "set",
        "making",
        "injurers",
        "bear",
        "cost",
        "excessive",
        "risk",
        "impose",
        "specific",
        "risk",
        "count",
        "excessive",
        "cost",
        "reducing",
        "le",
        "expected",
        "costthe",
        "seriousness",
        "injury",
        "discounted",
        "likelihoodof",
        "allowing",
        "occur",
        "burden",
        "precaution",
        "cost",
        "greater",
        "discounted",
        "cost",
        "injury",
        "economically",
        "rational",
        "law",
        "permit",
        "defendant",
        "impose",
        "risk",
        "someone",
        "injured",
        "efficient",
        "take",
        "precaution",
        "injurer",
        "held",
        "liable",
        "provided",
        "level",
        "precaution",
        "taken",
        "economically",
        "efficient",
        "transferring",
        "fund",
        "injurer",
        "injured",
        "party",
        "merely",
        "redistributive",
        "improve",
        "overall",
        "social",
        "allocation",
        "resource",
        "posner",
        "contends",
        "point",
        "tort",
        "liability",
        "provide",
        "incentive",
        "optimal",
        "investment",
        "safety",
        "fact",
        "defendant",
        "pay",
        "plaintiff",
        "particular",
        "incidental",
        "account",
        "instead",
        "posner",
        "suggests",
        "plaintiff",
        "receives",
        "payment",
        "exclusively",
        "incentive",
        "bring",
        "lawsuit",
        "effect",
        "plaintiff",
        "serf",
        "kind",
        "private",
        "attorney",
        "general",
        "role",
        "plaintiff",
        "posner",
        "analysis",
        "track",
        "role",
        "plaintiff",
        "standard",
        "economic",
        "analysis",
        "u",
        "antitrust",
        "law",
        "damage",
        "awarded",
        "plaintiff",
        "incentivize",
        "bring",
        "suit",
        "without",
        "plaintiff",
        "specially",
        "affected",
        "pervasive",
        "negative",
        "consequence",
        "anticompetitive",
        "behavior",
        "idea",
        "inform",
        "economic",
        "account",
        "tort",
        "law",
        "accepted",
        "theorist",
        "otherwise",
        "endorse",
        "account",
        "example",
        "part",
        "broader",
        "scheme",
        "distributive",
        "justice",
        "ronald",
        "dworkin",
        "adopts",
        "one",
        "central",
        "claim",
        "arguing",
        "voluntary",
        "contracting",
        "ideal",
        "solution",
        "problem",
        "social",
        "coordination",
        "area",
        "law",
        "need",
        "understood",
        "attempt",
        "approximate",
        "contractual",
        "result",
        "case",
        "market",
        "failure",
        "dworkin",
        "develops",
        "view",
        "detail",
        "discussion",
        "tort",
        "law",
        "principle",
        "correction",
        "although",
        "critical",
        "broader",
        "ambition",
        "economic",
        "analysis",
        "dworkin",
        "economic",
        "analysis",
        "straightforward",
        "explanation",
        "objective",
        "standard",
        "law",
        "negligence",
        "tort",
        "liability",
        "exclusively",
        "matter",
        "providing",
        "incentive",
        "future",
        "conduct",
        "fact",
        "defendant",
        "position",
        "avoid",
        "particular",
        "injury",
        "irrelevant",
        "economic",
        "analysis",
        "view",
        "injury",
        "past",
        "sunk",
        "cost",
        "never",
        "recovered",
        "making",
        "injurer",
        "pay",
        "injury",
        "efficient",
        "precaution",
        "would",
        "avoided",
        "provide",
        "incentive",
        "even",
        "specific",
        "injurer",
        "realize",
        "precaution",
        "required",
        "economic",
        "analysis",
        "also",
        "proposes",
        "explanation",
        "liability",
        "negligently",
        "causing",
        "economic",
        "loss",
        "absence",
        "property",
        "damage",
        "posner",
        "illustrates",
        "account",
        "case",
        "involving",
        "business",
        "island",
        "customer",
        "unable",
        "reach",
        "defendant",
        "negligently",
        "damaged",
        "bridge",
        "leading",
        "posner",
        "suggests",
        "loss",
        "recoverable",
        "customer",
        "simply",
        "take",
        "business",
        "elsewhere",
        "net",
        "loss",
        "economy",
        "clear",
        "whether",
        "account",
        "reconciled",
        "fact",
        "law",
        "would",
        "grant",
        "consequential",
        "loss",
        "business",
        "owned",
        "bridge",
        "damaged",
        "case",
        "presumably",
        "customer",
        "would",
        "taken",
        "business",
        "elsewhere",
        "resulting",
        "net",
        "loss",
        "economy",
        "different",
        "economic",
        "rationale",
        "law",
        "treatment",
        "pure",
        "economic",
        "loss",
        "see",
        "sharkey"
    ]
}