{
    "main_text": "Contemporary Philosophical Approaches to Tort Law || Corrective Justice\n4.2 Corrective Justice\n\nBeginning in the 1980s, a number of scholars argued that the economic\naccount of negligence fails to capture the most basic and familiar\nfeature of a tort action of any kind, the fact that it is a private\naction that one person brings against another. The core argument is\nthat instrumental accounts are unable to explain the\ncharacteristically private and transactional nature of tortious\nwrongdoing and so unable to explain the nature of the remedy\nappropriate in response to it. In a negligence action, the plaintiff\ncomes before the court complaining of a wrong that the defendant has\ndone to that plaintiff in particular. Unlike the pervasive harms of\nanticompetitive behavior that are regulated in US antitrust law, the\nplaintiff has a particular complaint against the defendant, namely,\nthat the defendant’s carelessness was a violation of that very\nplaintiff’s right to security of person and property. As Ernest\nWeinrib formulates the point, economic analysis proposes separate\nexplanations of why the defendant pays someone and why the plaintiff\nreceives payment from someone, without explaining why the defendant\nowes compensation to the plaintiff in particular; each party faces\nseparate incentives that make no reference to the other (1995). Jules\nColeman develops the same general line of argument in slightly\ndifferent terms: the familiar structural features of tort\nlaw—the fact that a particular plaintiff recovers from a\nparticular defendant for a wrong that that defendant committed against\nthat very plaintiff—cannot be adequately explained by economic\nanalysis, because it leaves out the law’s central focus on the\nfact that the defendant has wronged the plaintiff in particular,\nfocusing instead on incidental factors such as “search,\nadministrative, and transaction costs” (2001: 23).\n\nInstead of understanding the structure of the tort action in terms of\nincentives, Weinrib proposes to understand it in terms of\nAristotle’s category of corrective justice. Aristotle notes that\ncorrective justice rests on the transactional nature of wrongdoing and\nso imposes that transactional nature on the remedy. Corrective justice\nthus differs from what Aristotle calls distributive justice, which is\nconcerned with the distribution of benefits or burdens in accordance\nwith some external criteria, such as the distribution of food on the\nbasis of need or of Olympic medals on the basis of athletic\nperformance. Corrective justice is not comparative in this way. As\nAristotle implies, the wrongdoer’s wrongful deed and the injured\nperson’s suffering are a single act. If I wrongfully injure you,\nmy wrongful act and your injury are the same thing: the wrong consists\nin what I did to you, and your injury consists in what you suffered by\nme. On Weinrib’s argument, the difficulty with economic analysis\nis that it undoes this unity of the wrong. Weinrib points to the ways\nin which the unity of the wrong structures the entire determination of\nliability: for each of the “elements” of a negligence\naction, the court only considers factors that relate the defendant to\nthe plaintiff with respect to the particular transaction. Rather than\nasking whether the defendant was negligent, or imposed a higher than\nnormal risk, the court instead asks whether the defendant was\nnegligent-towards-the-plaintiff, that is, whether the\ndefendant’s carelessness was careless towards the safety of the\nplaintiff in particular; so, too, the court asks whether the kind of\nthing that happened to plaintiff was the reason that the defendant was\nsupposed to be more careful. So too, the court does not ask merely\nwhether the defendant caused the plaintiff’s injury, but rather\nwhether the aspect of the defendant’s act that made it negligent\ncaused the plaintiff’s injury. The inquiry looks only at what\ntranspired between the defendant and the plaintiff: was the defendant\nbeing careful enough in relation to the risk to the plaintiff? Did the\ndefendant owe this specific plaintiff a duty to be careful? Did the\ninjury of which the plaintiff complains fall within the scope of the\nduty that the defendant owed? Did the defendant’s carelessness\ncause the very injury of which the plaintiff complains?\nWeinrib’s argument, then, is that the factors that figure in a\ncourt’s analysis of a negligence action always relate the\nparties to each other, while the factors to which economic analysis\npoints all focus exclusively on one of the parties without reference\nto the other (1995). For economic analysis the plaintiff’s\ninjury by the defendant serves as the occasion for regulation and so\nfor liability but not as its basis. The missing element in economic\naccounts is the transaction; it alone explains why a particular\nplaintiff is entitled to recover from a particular defendant. The same\nrationale explains why there is no duty to rescue in tort law: there\nis no transaction between the parties. The failure of economic\nanalysis to attend to the transaction means that it has no principled\nexplanation of why liability is imposed only for injury but not also\nfor failure to assist where the cost of assisting another would be\nlower than the cost of that person’s anticipated loss. A focus\non providing incentives to reduce risks has no principled basis for\nlimiting its purview to incentives provided to those who have created\nthe risks themselves; the net loss in economic terms is the same\nwhether the risk is of natural or human origin. In either case, in a\nperfectly competitive market without transaction costs, people would\npay others to protect them, yet the law of negligence does not suppose\nthat there is therefore a duty (Ripstein 2016).\n\nThis emphasis on the transactional nature of the unity of the wrong\nprovides an alternative to the economic and Holmesian explanations of\nthe objective standard in a negligence action. Anything relevant to\nany of the elements of negligence must concern the relation between\nthe plaintiff and defendant; as such, no factor that is specific to\nonly one of them could be relevant to the determination of wrongdoing\nand so of liability. On this analysis, a subjective standard—the\none that Holmes contends would be relevant to the “courts of\nheaven”—focuses exclusively on the plaintiff rather than\non how things stand as between the defendant and the plaintiff. As\nsuch, it is unilateral in a way that is foreign to the structure of a\ntort action. The corrective justice account offers a parallel\nexplanation of the “ultrasensitive plaintiff rule”\naccording to which an injured person does not recover for the\ndefendant’s negligent or even knowing exposure of them to things\nfor which they have unusual sensitivities, in either nuisance or\nnegligence, even though a person of normal fortitude would recover for\nthe full extent of their injuries (Ripstein 2016). Once again, an\nunusual sensitivity is a factor that is exclusive to one of the\nparties, and so insufficient to address how things stand between the\ndefendant and the plaintiff. The corrective justice account, then,\nexplains the role of “moral phraseology” in law by drawing\nattention to the interpersonal and relational nature of the relevant\nmorality. That relational structure proposes a systematic response to\nthe Holmesian insistence that concepts of justice must be concerned\nexclusively with good faith efforts. Instead, the corrective justice\naccount focuses on the ordinary demands that ordinary people are\nentitled to make each other. The moral phraseology to which Holmes\ndrew attention is a familiar feature of the way in which people are\nentitled to demand that others be careful around them.\n\nEconomic analysts have responded to the corrective justice critique by\nsuggesting that courts engage in binary adjudication for a variety of\npragmatic reasons, including historical accidents and the beneficial\nincentive effects of putting litigation in the hands of people with\nfinancial stakes in its outcome. In addition, they point to the fact\nthat binary adjudication is a familiar feature of other legal areas\nwhere no private dispute is at issue, most notably US antitrust\nlaw.\n\nThis response arguably misunderstands the corrective justice critique:\nthe claim is not that economic analysis cannot give a functional or\ninstrumental explanation of binary adjudication. The suggestion that\nthe plaintiff receives damages in order to provide an incentive to\ncall out unsafe practices is just such a functional explanation. The\ncorrective justice critique can be put in two different ways. First,\nthe court’s analysis in a tort dispute is all grounded in the\nsingle transaction; it is exclusively backward looking rather than\nforward-looking. It is not just that the decision between the\nplaintiff and the defendant is binary, but rather that it is based\nonly on the specific transaction between them—the remedy is\nexplicable only in terms of the bipolar transactional nature of the\nwrong. Second, the economic analyst’s response represents the\ncorrective justice theory differently than its proponents do, reading\nit as the claim that binary adjudication is effective for achieving\ncorrective justice but for no other purpose. The corrective justice\naccount is not an attempt to explain remedies and court processes by\nasking what goals they best promote. It argues that tort adjudication\nis binary because the wrongs to which it responds are binary: they are\na matter of what the defendant has done to the plaintiff. The\ntransactional nature of wronging underlies the transactional nature of\ntort litigation, and so explains why the particular plaintiff recovers\nfrom the particular defendant. The plaintiff’s entitlement to\nrecover is not an attempt to achieve any other purpose.\n\nSome transaction-focused accounts of corrective justice deploy the\nKantian distinction between duties of right and duties of virtue to\ndevelop a positive account of the specific norms enforced by tort law\n(Kant 1797). On this view, the moral vocabulary to which Holmes draws\nattention is not the general moral vocabulary of virtue or the courts\nof heaven. The relational ideas of what one person does to another\napply to separate persons, each with the purposes of their own. They\nthereby reconcile the ability of separate persons to pursue those\npurposes with the means that they have, centrally their body and their\nproperty. Kantian accounts conceive of rights relationally, rather\nthan focusing on one side of the relation, such as the choices or\ninterests of the rightholder. The violation of rights to person and\nproperty does not extinguish the plaintiff’s entitlement to be\nindependent of the defendant’s choice. Instead, the\nplaintiff’s right to constrain the defendant’s conduct\nsurvives in the form of a claim to a remedy from the defendant in\nparticular (Weinrib 1995; Ripstein 2016). The person who wrongfully\ninjures another or damages the other person’s property can be\ncompelled to return things to their prior condition, that is, to pay\nthe costs of repairing or replacing the property or of enabling the\ninjured party to get on with their life in light of the injuries. In\naddition, people who wrongfully use another person’s\nbody (the tort of battery) or property (the torts of trespass and\nconversion) are required to repair any damage that they do because\nonce again there is a wrongful transaction. This Kantian account also\nhas a direct and straightforward explanation of the rules regarding\neconomic loss: if the defendant damages something on which the\nplaintiff depends but does not own, the wrongful transaction is\nbetween the defendant and the owner of the damaged thing; if the\nplaintiff does not have a right to the damaged object, then although\nthe plaintiff has suffered a loss, no right has been violated. As\nsuch, the plaintiff is not a party to the wrongful transaction, so\nthere is no wrong between the person who damaged the object and the\nplaintiff to be corrected. In the example of the damaged bridge,\nwhether the plaintiff’s right has been violated depends on\nwhether the plaintiff owns the bridge. The economic loss rule is thus\ntreated as an instance of a more general focus on rights to person and\nproperty; those who benefit from property lack the relevant form of\nright in it, and the law of negligence does require a person to\nprotect others from natural perils or the acts of third parties\n(Ripstein 2016).\n\nThe corrective justice account does not deny that tort liability has\nthe effect of deterring careless people and compensating injured\npeople. The point is rather that these effects are insufficient to\nexplain the law’s unwavering focus on the connection between the\nplaintiff and defendant: why this plaintiff is entitled to recover\nfrom this defendant and no one else, and why this defendant is liable\nto this plaintiff and no one else. Seen from the point of view of\neither deterrence or compensation, such a pairing of the defendant and\nthe plaintiff is arbitrary, as is the law’s exclusive focus on\nthe relation between them. From the standpoint of corrective justice,\nthe transaction between the parties is the locus of the wrong and the\ncourt’s exclusive concern is in addressing that wrong.\n",
    "section_title": "4.2 Corrective Justice",
    "entry_title": "Theories of the Common Law of Torts",
    "hierarchy_title": "Theories of the Common Law of Torts || Contemporary Philosophical Approaches to Tort Law || Corrective Justice",
    "tokenized_text": [
        "contemporary",
        "philosophical",
        "approach",
        "tort",
        "law",
        "corrective",
        "justice",
        "corrective",
        "justice",
        "beginning",
        "s",
        "number",
        "scholar",
        "argued",
        "economic",
        "account",
        "negligence",
        "fails",
        "capture",
        "basic",
        "familiar",
        "feature",
        "tort",
        "action",
        "kind",
        "fact",
        "private",
        "action",
        "one",
        "person",
        "brings",
        "another",
        "core",
        "argument",
        "instrumental",
        "account",
        "unable",
        "explain",
        "characteristically",
        "private",
        "transactional",
        "nature",
        "tortious",
        "wrongdoing",
        "unable",
        "explain",
        "nature",
        "remedy",
        "appropriate",
        "response",
        "negligence",
        "action",
        "plaintiff",
        "come",
        "court",
        "complaining",
        "wrong",
        "defendant",
        "done",
        "plaintiff",
        "particular",
        "unlike",
        "pervasive",
        "harm",
        "anticompetitive",
        "behavior",
        "regulated",
        "u",
        "antitrust",
        "law",
        "plaintiff",
        "particular",
        "complaint",
        "defendant",
        "namely",
        "defendant",
        "carelessness",
        "violation",
        "plaintiff",
        "right",
        "security",
        "person",
        "property",
        "ernest",
        "weinrib",
        "formulates",
        "point",
        "economic",
        "analysis",
        "proposes",
        "separate",
        "explanation",
        "defendant",
        "pay",
        "someone",
        "plaintiff",
        "receives",
        "payment",
        "someone",
        "without",
        "explaining",
        "defendant",
        "owes",
        "compensation",
        "plaintiff",
        "particular",
        "party",
        "face",
        "separate",
        "incentive",
        "make",
        "reference",
        "jules",
        "coleman",
        "develops",
        "general",
        "line",
        "argument",
        "slightly",
        "different",
        "term",
        "familiar",
        "structural",
        "feature",
        "tort",
        "lawthe",
        "fact",
        "particular",
        "plaintiff",
        "recovers",
        "particular",
        "defendant",
        "wrong",
        "defendant",
        "committed",
        "plaintiff",
        "adequately",
        "explained",
        "economic",
        "analysis",
        "leaf",
        "law",
        "central",
        "focus",
        "fact",
        "defendant",
        "wronged",
        "plaintiff",
        "particular",
        "focusing",
        "instead",
        "incidental",
        "factor",
        "search",
        "administrative",
        "transaction",
        "cost",
        "instead",
        "understanding",
        "structure",
        "tort",
        "action",
        "term",
        "incentive",
        "weinrib",
        "proposes",
        "understand",
        "term",
        "aristotle",
        "category",
        "corrective",
        "justice",
        "aristotle",
        "note",
        "corrective",
        "justice",
        "rest",
        "transactional",
        "nature",
        "wrongdoing",
        "imposes",
        "transactional",
        "nature",
        "remedy",
        "corrective",
        "justice",
        "thus",
        "differs",
        "aristotle",
        "call",
        "distributive",
        "justice",
        "concerned",
        "distribution",
        "benefit",
        "burden",
        "accordance",
        "external",
        "criterion",
        "distribution",
        "food",
        "basis",
        "need",
        "olympic",
        "medal",
        "basis",
        "athletic",
        "performance",
        "corrective",
        "justice",
        "comparative",
        "way",
        "aristotle",
        "implies",
        "wrongdoer",
        "wrongful",
        "deed",
        "injured",
        "person",
        "suffering",
        "single",
        "act",
        "wrongfully",
        "injure",
        "wrongful",
        "act",
        "injury",
        "thing",
        "wrong",
        "consists",
        "injury",
        "consists",
        "suffered",
        "weinrib",
        "argument",
        "difficulty",
        "economic",
        "analysis",
        "undoes",
        "unity",
        "wrong",
        "weinrib",
        "point",
        "way",
        "unity",
        "wrong",
        "structure",
        "entire",
        "determination",
        "liability",
        "element",
        "negligence",
        "action",
        "court",
        "considers",
        "factor",
        "relate",
        "defendant",
        "plaintiff",
        "respect",
        "particular",
        "transaction",
        "rather",
        "asking",
        "whether",
        "defendant",
        "negligent",
        "imposed",
        "higher",
        "normal",
        "risk",
        "court",
        "instead",
        "asks",
        "whether",
        "defendant",
        "negligenttowardstheplaintiff",
        "whether",
        "defendant",
        "carelessness",
        "careless",
        "towards",
        "safety",
        "plaintiff",
        "particular",
        "court",
        "asks",
        "whether",
        "kind",
        "thing",
        "happened",
        "plaintiff",
        "reason",
        "defendant",
        "supposed",
        "careful",
        "court",
        "ask",
        "merely",
        "whether",
        "defendant",
        "caused",
        "plaintiff",
        "injury",
        "rather",
        "whether",
        "aspect",
        "defendant",
        "act",
        "made",
        "negligent",
        "caused",
        "plaintiff",
        "injury",
        "inquiry",
        "look",
        "transpired",
        "defendant",
        "plaintiff",
        "defendant",
        "careful",
        "enough",
        "relation",
        "risk",
        "plaintiff",
        "defendant",
        "owe",
        "specific",
        "plaintiff",
        "duty",
        "careful",
        "injury",
        "plaintiff",
        "complains",
        "fall",
        "within",
        "scope",
        "duty",
        "defendant",
        "owed",
        "defendant",
        "carelessness",
        "cause",
        "injury",
        "plaintiff",
        "complains",
        "weinrib",
        "argument",
        "factor",
        "figure",
        "court",
        "analysis",
        "negligence",
        "action",
        "always",
        "relate",
        "party",
        "factor",
        "economic",
        "analysis",
        "point",
        "focus",
        "exclusively",
        "one",
        "party",
        "without",
        "reference",
        "economic",
        "analysis",
        "plaintiff",
        "injury",
        "defendant",
        "serf",
        "occasion",
        "regulation",
        "liability",
        "basis",
        "missing",
        "element",
        "economic",
        "account",
        "transaction",
        "alone",
        "explains",
        "particular",
        "plaintiff",
        "entitled",
        "recover",
        "particular",
        "defendant",
        "rationale",
        "explains",
        "duty",
        "rescue",
        "tort",
        "law",
        "transaction",
        "party",
        "failure",
        "economic",
        "analysis",
        "attend",
        "transaction",
        "mean",
        "principled",
        "explanation",
        "liability",
        "imposed",
        "injury",
        "also",
        "failure",
        "assist",
        "cost",
        "assisting",
        "another",
        "would",
        "lower",
        "cost",
        "person",
        "anticipated",
        "loss",
        "focus",
        "providing",
        "incentive",
        "reduce",
        "risk",
        "principled",
        "basis",
        "limiting",
        "purview",
        "incentive",
        "provided",
        "created",
        "risk",
        "net",
        "loss",
        "economic",
        "term",
        "whether",
        "risk",
        "natural",
        "human",
        "origin",
        "either",
        "case",
        "perfectly",
        "competitive",
        "market",
        "without",
        "transaction",
        "cost",
        "people",
        "would",
        "pay",
        "others",
        "protect",
        "yet",
        "law",
        "negligence",
        "suppose",
        "therefore",
        "duty",
        "ripstein",
        "emphasis",
        "transactional",
        "nature",
        "unity",
        "wrong",
        "provides",
        "alternative",
        "economic",
        "holmesian",
        "explanation",
        "objective",
        "standard",
        "negligence",
        "action",
        "anything",
        "relevant",
        "element",
        "negligence",
        "must",
        "concern",
        "relation",
        "plaintiff",
        "defendant",
        "factor",
        "specific",
        "one",
        "could",
        "relevant",
        "determination",
        "wrongdoing",
        "liability",
        "analysis",
        "subjective",
        "standardthe",
        "one",
        "holmes",
        "contends",
        "would",
        "relevant",
        "court",
        "heaven",
        "focuses",
        "exclusively",
        "plaintiff",
        "rather",
        "thing",
        "stand",
        "defendant",
        "plaintiff",
        "unilateral",
        "way",
        "foreign",
        "structure",
        "tort",
        "action",
        "corrective",
        "justice",
        "account",
        "offer",
        "parallel",
        "explanation",
        "ultrasensitive",
        "plaintiff",
        "rule",
        "according",
        "injured",
        "person",
        "recover",
        "defendant",
        "negligent",
        "even",
        "knowing",
        "exposure",
        "thing",
        "unusual",
        "sensitivity",
        "either",
        "nuisance",
        "negligence",
        "even",
        "though",
        "person",
        "normal",
        "fortitude",
        "would",
        "recover",
        "full",
        "extent",
        "injury",
        "ripstein",
        "unusual",
        "sensitivity",
        "factor",
        "exclusive",
        "one",
        "party",
        "insufficient",
        "address",
        "thing",
        "stand",
        "defendant",
        "plaintiff",
        "corrective",
        "justice",
        "account",
        "explains",
        "role",
        "moral",
        "phraseology",
        "law",
        "drawing",
        "attention",
        "interpersonal",
        "relational",
        "nature",
        "relevant",
        "morality",
        "relational",
        "structure",
        "proposes",
        "systematic",
        "response",
        "holmesian",
        "insistence",
        "concept",
        "justice",
        "must",
        "concerned",
        "exclusively",
        "good",
        "faith",
        "effort",
        "instead",
        "corrective",
        "justice",
        "account",
        "focus",
        "ordinary",
        "demand",
        "ordinary",
        "people",
        "entitled",
        "make",
        "moral",
        "phraseology",
        "holmes",
        "drew",
        "attention",
        "familiar",
        "feature",
        "way",
        "people",
        "entitled",
        "demand",
        "others",
        "careful",
        "around",
        "economic",
        "analyst",
        "responded",
        "corrective",
        "justice",
        "critique",
        "suggesting",
        "court",
        "engage",
        "binary",
        "adjudication",
        "variety",
        "pragmatic",
        "reason",
        "including",
        "historical",
        "accident",
        "beneficial",
        "incentive",
        "effect",
        "putting",
        "litigation",
        "hand",
        "people",
        "financial",
        "stake",
        "outcome",
        "addition",
        "point",
        "fact",
        "binary",
        "adjudication",
        "familiar",
        "feature",
        "legal",
        "area",
        "private",
        "dispute",
        "issue",
        "notably",
        "u",
        "antitrust",
        "law",
        "response",
        "arguably",
        "misunderstands",
        "corrective",
        "justice",
        "critique",
        "claim",
        "economic",
        "analysis",
        "give",
        "functional",
        "instrumental",
        "explanation",
        "binary",
        "adjudication",
        "suggestion",
        "plaintiff",
        "receives",
        "damage",
        "order",
        "provide",
        "incentive",
        "call",
        "unsafe",
        "practice",
        "functional",
        "explanation",
        "corrective",
        "justice",
        "critique",
        "put",
        "two",
        "different",
        "way",
        "first",
        "court",
        "analysis",
        "tort",
        "dispute",
        "grounded",
        "single",
        "transaction",
        "exclusively",
        "backward",
        "looking",
        "rather",
        "forwardlooking",
        "decision",
        "plaintiff",
        "defendant",
        "binary",
        "rather",
        "based",
        "specific",
        "transaction",
        "themthe",
        "remedy",
        "explicable",
        "term",
        "bipolar",
        "transactional",
        "nature",
        "wrong",
        "second",
        "economic",
        "analyst",
        "response",
        "represents",
        "corrective",
        "justice",
        "theory",
        "differently",
        "proponent",
        "reading",
        "claim",
        "binary",
        "adjudication",
        "effective",
        "achieving",
        "corrective",
        "justice",
        "purpose",
        "corrective",
        "justice",
        "account",
        "attempt",
        "explain",
        "remedy",
        "court",
        "process",
        "asking",
        "goal",
        "best",
        "promote",
        "argues",
        "tort",
        "adjudication",
        "binary",
        "wrong",
        "responds",
        "binary",
        "matter",
        "defendant",
        "done",
        "plaintiff",
        "transactional",
        "nature",
        "wronging",
        "underlies",
        "transactional",
        "nature",
        "tort",
        "litigation",
        "explains",
        "particular",
        "plaintiff",
        "recovers",
        "particular",
        "defendant",
        "plaintiff",
        "entitlement",
        "recover",
        "attempt",
        "achieve",
        "purpose",
        "transactionfocused",
        "account",
        "corrective",
        "justice",
        "deploy",
        "kantian",
        "distinction",
        "duty",
        "right",
        "duty",
        "virtue",
        "develop",
        "positive",
        "account",
        "specific",
        "norm",
        "enforced",
        "tort",
        "law",
        "kant",
        "view",
        "moral",
        "vocabulary",
        "holmes",
        "draw",
        "attention",
        "general",
        "moral",
        "vocabulary",
        "virtue",
        "court",
        "heaven",
        "relational",
        "idea",
        "one",
        "person",
        "another",
        "apply",
        "separate",
        "person",
        "purpose",
        "thereby",
        "reconcile",
        "ability",
        "separate",
        "person",
        "pursue",
        "purpose",
        "mean",
        "centrally",
        "body",
        "property",
        "kantian",
        "account",
        "conceive",
        "right",
        "relationally",
        "rather",
        "focusing",
        "one",
        "side",
        "relation",
        "choice",
        "interest",
        "rightholder",
        "violation",
        "right",
        "person",
        "property",
        "extinguish",
        "plaintiff",
        "entitlement",
        "independent",
        "defendant",
        "choice",
        "instead",
        "plaintiff",
        "right",
        "constrain",
        "defendant",
        "conduct",
        "survives",
        "form",
        "claim",
        "remedy",
        "defendant",
        "particular",
        "weinrib",
        "ripstein",
        "person",
        "wrongfully",
        "injures",
        "another",
        "damage",
        "person",
        "property",
        "compelled",
        "return",
        "thing",
        "prior",
        "condition",
        "pay",
        "cost",
        "repairing",
        "replacing",
        "property",
        "enabling",
        "injured",
        "party",
        "get",
        "life",
        "light",
        "injury",
        "addition",
        "people",
        "wrongfully",
        "use",
        "another",
        "person",
        "body",
        "tort",
        "battery",
        "property",
        "tort",
        "trespass",
        "conversion",
        "required",
        "repair",
        "damage",
        "wrongful",
        "transaction",
        "kantian",
        "account",
        "also",
        "direct",
        "straightforward",
        "explanation",
        "rule",
        "regarding",
        "economic",
        "loss",
        "defendant",
        "damage",
        "something",
        "plaintiff",
        "depends",
        "wrongful",
        "transaction",
        "defendant",
        "owner",
        "damaged",
        "thing",
        "plaintiff",
        "right",
        "damaged",
        "object",
        "although",
        "plaintiff",
        "suffered",
        "loss",
        "right",
        "violated",
        "plaintiff",
        "party",
        "wrongful",
        "transaction",
        "wrong",
        "person",
        "damaged",
        "object",
        "plaintiff",
        "corrected",
        "example",
        "damaged",
        "bridge",
        "whether",
        "plaintiff",
        "right",
        "violated",
        "depends",
        "whether",
        "plaintiff",
        "owns",
        "bridge",
        "economic",
        "loss",
        "rule",
        "thus",
        "treated",
        "instance",
        "general",
        "focus",
        "right",
        "person",
        "property",
        "benefit",
        "property",
        "lack",
        "relevant",
        "form",
        "right",
        "law",
        "negligence",
        "require",
        "person",
        "protect",
        "others",
        "natural",
        "peril",
        "act",
        "third",
        "party",
        "ripstein",
        "corrective",
        "justice",
        "account",
        "deny",
        "tort",
        "liability",
        "effect",
        "deterring",
        "careless",
        "people",
        "compensating",
        "injured",
        "people",
        "point",
        "rather",
        "effect",
        "insufficient",
        "explain",
        "law",
        "unwavering",
        "focus",
        "connection",
        "plaintiff",
        "defendant",
        "plaintiff",
        "entitled",
        "recover",
        "defendant",
        "one",
        "else",
        "defendant",
        "liable",
        "plaintiff",
        "one",
        "else",
        "seen",
        "point",
        "view",
        "either",
        "deterrence",
        "compensation",
        "pairing",
        "defendant",
        "plaintiff",
        "arbitrary",
        "law",
        "exclusive",
        "focus",
        "relation",
        "standpoint",
        "corrective",
        "justice",
        "transaction",
        "party",
        "locus",
        "wrong",
        "court",
        "exclusive",
        "concern",
        "addressing",
        "wrong"
    ]
}