{
    "main_text": "Responses to Objections\n4. Responses to Objections\n\nWhile it would be premature to say that attempts to construct\nambitious world-directed transcendental arguments have been entirely\nabandoned (see e.g., Peacocke 1989, Grundmann & Misselhorn 2003),\nnonetheless the most common way of responding to these Stroudian\ndifficulties has been to re-think how transcendental arguments might\nbe best used, and to come up with strategies that are in various ways\nmore modest than those we have discussed so far. What characterises\nsuch modest responses is the idea that Stroud is indeed right\nthat all we can really substantiate by way of a transcendental claim\nis how things must appear to us or how we must believe them to\nbe—but then attempt to make this weakened claim do some\nanti-sceptical work. We will briefly consider four such responses: one\nfrom Strawson’s earlier work; one from his later writings; one\nfrom Stroud; and one from Stern 2000. (For other recent examples of\nless ambitious transcendental arguments, see Chang 2008 and Massimi\n2014; also see Coates 2017 on Strawson 1962).\n\nThe first response takes its inspiration from a re-consideration of\nthe Strawsonian transcendental arguments that were criticised by\nStroud, but offers a different interpretation of them in the light of\nthat critique. Thus, it is suggested, the mistake is to see\nStrawson’s argument as straightforwardly world-directed in the\nway that it was presented earlier, as offering a direct response to\nthe sceptic by proving what the sceptic doubts. Rather, it is said,\nthe strategy is more like Aristotle’s elenchic response to the\nsceptic who doubts the principle of non-contradiction: namely, to show\nthat her doubts cannot be intelligibly stated or expressed, as\nacceptance of this principle is a necessary condition for having\nmeaningful thought at all. Likewise, therefore, it can be suggested\nthat Strawson intended his transcendental approach to operate in the\nsame way, where (as Strawson puts it) ‘[the sceptic’s]\ndoubts are unreal, not simply because they are logically unresolvable\ndoubts, but because they amount to the rejection of the whole\nconceptual scheme within which alone such doubts make sense’\n(Strawson 1959: 35; cf. also 106 and 109, and also Glock 2003:\n35–6 and Illies 2003: 44–56). Thus, it may seem, a modest\ntranscendental claim is all that we require, to the effect that the\nsceptic cannot raise a doubt to challenge us here, given what she must\nbelieve in order for her to think or utter anything intelligible at\nall. The transcendental argument is effective, therefore, not by\nshowing that what the sceptic doubts is false, but by showing that\nthose doubts have violated the conditions of meaningfulness, and thus\nrequire no positive answer or response.\n\nNow, whether or not this is the most charitable way of reading\nStrawson’s earlier position, he himself does not seem to have\nadopted quite this first response when he came to reply to Stroud in\nhis later work. Rather, while he accepts Stroud’s insistence\nthat the transcendental claim must be weakened (cf. Strawson 1985: 9),\nhe then also offers what he call a naturalistic reply to the\nsceptic based on Hume and also on some Wittgensteinian ideas developed\nin On Certainty, according to which the right approach to\nsceptical doubts is not to try to answer them with an argument, but to\nshow them to be ‘idle’, as unable to shift those core\nbeliefs which are implanted in us by nature or which lie at the centre\nof our ways of thinking (cf. Strawson 1985: 13). Here, then, the\napproach is not about the meaninglessness or unintelligibility of\nsceptical doubt (as on the first response), but on its inability to\nshift or dislodge our beliefs because of their embeddedness within our\nthinking (where semantic issues need not be the only consideration in\nrendering them embedded in this way). Within this naturalistic\napproach, therefore, Strawson suggests that transcendental arguments\ncan do valuable work, in precisely helping us to show the sceptic that\nsome beliefs are fundamental to us in this way, and thus impervious to\nsceptical doubt just as the naturalist claims—but where to play\nthis role, the transcendental claim only has to be a modest one,\nconcerning what we must believe, not how things are (cf. Strawson\n1985: 21–23; see also Grayling 1985 and Callanan 2011).\n\nA third type of modest approach is offered by Stroud himself, where he\nclaims that even a transcendental argument which shows what we must\nbelieve can have anti-sceptical value, in showing that these beliefs\nare indispensable and invulnerable, in the sense\nthat we not only cannot abandon them, but also we cannot find them to\nbe false in ourselves or others, because to so find them would be to\ngive up believing anything at all. However, Stroud allows that this\nsort of status for the belief in question—for example, the\nbelief that there are enduring particulars, or other minds—does\nnot go as far as ruling out the possibility that belief of this sort\nare in fact not true (see Stroud 1994, 1999).\n\nFinally, in Stern 2000, it is argued that modest transcendental\narguments can be shown to be useful against scepticism, once we\ndistinguish sufficiently carefully between the kinds of scepticism\nthere are, and go for the right target or targets—where a less\ndemanding form of scepticism may perhaps be defeated by a less\nambitious transcendental claim. So, for example, if we take the target\nto be a sceptic who demands certainty, then a modest transcendental\nargument will not suffice. But if we take the sceptic to be one who\ndemands merely justification that may nonetheless be fallible, and who\nclaims we do not have even this because our beliefs are not properly\nsupported by our generally accepted cognitive norms, then (it is\nclaimed) a modest transcendental argument can indeed be useful. So,\nfor example, the justificatory sceptic may claim that our belief in\nother minds seems to be grounded on nothing but the link between\nbehaviour and mentality that we observe in our own case; but then, she\ncan argue, it is based on little more than a poor argument from\nanalogy, which we are not properly warranted in extending to others,\nas we are arguing from only a single instance (viz., ourselves), which\nis an inadequate inductive base on which to reason in this way. In\nresponse, however, it could be argued that unless others appeared to\nus as more than mere bodies, but instead as persons with minds, we\ncould not acquire the capacity to apply mentalistic predicates to\nourselves, and thus become self-conscious. This argument remains\n‘modest’ because its transcendental claim extends only to\nhow others must appear to us, and so is not\n‘world-directed’ in the manner of more ambitious\ntranscendental arguments; but even so, the idea is, it is still\nsufficient to show that our belief in these other minds is not merely\nbased on a faulty inference in the way that the justificatory sceptic\nsupposes, but rather on the nature of our experience—where as\nsuch, it can therefore be used to show that this belief is warranted,\neven if it could still be false.\n\nNow, none of these approaches is unobjectionable, and it remains to be\nseen which, if any, is to be preferred. Concern about the Aristotelian\napproach can relate to whether it can show that belief in X\nis necessary for intelligible thought in general, or for\nthought by creatures like us—where if it only\nestablishes the latter, the possibility of a sceptic raising\nintelligible doubts about it would seem to remain, while establishing\nthe former seems extremely demanding if not impossible (cf.\nKörner 1967). Further, the worry might be raised in a Stroudian\nspirit, that all this approach shows is that doubts cannot be\ncoherently expressed concerning X, but where that then seems\nto fall short of establishing that X is really the case. And\nfinally, while it may perhaps seem right to say that there is\nsomething unintelligible or meaningless about questioning the\nprinciple of non-contradiction (although this can also be challenged:\ncf. Priest 1987), other sceptical doubts do not seem problematic to\nthe same degree. (For further discussion points of this sort, see\nIllies 2003: 54–63.) Along similar lines, critics have also\nquestioned Strawson’s naturalistic approach, as not fully\nanswering the sceptical challenge: for even if a doubt here is\n‘idle’, it does not follow that what is questioned is\nreally true (cf. Valberg 1992: 168–96, Sen 1995). Likewise, when\nit comes to Stroud’s position, as he himself admits, the\nindispensability and invulnerability he speaks of ‘might not\nseem like much reassurance in the face of a general scepticism’\n(Stroud 1999: 168), given that it not only does not rule out the\npossibility of falsity, but also seemingly gives no additional reasons\nfor taking that possibility less seriously. Moreover, it has been\nsuggested that Stroud’s position is unstable, as the claim that\ncertain beliefs are invulnerable on the one hand, and the acceptance\nthat they might be untrue on the other, seem to stand in tension with\none another (see Brueckner 1996). The position proposed in Stern 2000\ntries to get round these difficulties, but has also been accused of\nducking important aspects of the sceptic’s challenge (see e.g.,\nSacks 1999 and 2000: 276–85; and for Sack’s own positive\nproposals, see Sacks 2005a, 2005b and 2006). Finally, for an attempt\nto adopt an approach that is neither ambitious or modest, but\nsomewhere between the two, see McDowell 2006.\n\nWhatever their respective strengths and weaknesses, one thing these\nmodest strategies have suggested is that some of the central features\nof transcendental arguments outlined above do not fit arguments of\nthis less ambitious sort. Thus, these arguments are not\nworld-directed, but are self-, experience-, or belief-directed.\nSecondly, they do not expect the transcendental arguments to refute\nthe sceptic on their own (as it were), but in conjunction with broader\nepistemological or anti-sceptical considerations (such as naturalism,\nor perceptual and other epistemic norms). Thirdly, by offering an\napproach that is more modest, they raise the question of how much\nadequate responses to scepticism are entitled to assume and what kinds\nof reassurance they are meant to provide (cf. Hookway 1999; Cassam\n2007: 51–84; Wang 2012). And in all these ways, they have raised\nexegetical issues about how Kant’s place in the canon discussed\nabove might be understood differently, concerning his attitude to\nscepticism and whether in the end his intentions are best interpreted\nin ‘modest’ or more ambitious terms (cf. Callanan 2006;\nBardon 2006; Stapelford 2008).\n",
    "section_title": "4. Responses to Objections",
    "entry_title": "Transcendental Arguments",
    "hierarchy_title": "Transcendental Arguments || Responses to Objections",
    "tokenized_text": [
        "response",
        "objection",
        "response",
        "objection",
        "would",
        "premature",
        "say",
        "attempt",
        "construct",
        "ambitious",
        "worlddirected",
        "transcendental",
        "argument",
        "entirely",
        "abandoned",
        "see",
        "eg",
        "peacocke",
        "grundmann",
        "misselhorn",
        "nonetheless",
        "common",
        "way",
        "responding",
        "stroudian",
        "difficulty",
        "rethink",
        "transcendental",
        "argument",
        "might",
        "best",
        "used",
        "come",
        "strategy",
        "various",
        "way",
        "modest",
        "discussed",
        "far",
        "characterises",
        "modest",
        "response",
        "idea",
        "stroud",
        "indeed",
        "right",
        "really",
        "substantiate",
        "way",
        "transcendental",
        "claim",
        "thing",
        "must",
        "appear",
        "u",
        "must",
        "believe",
        "bebut",
        "attempt",
        "make",
        "weakened",
        "claim",
        "antisceptical",
        "work",
        "briefly",
        "consider",
        "four",
        "response",
        "one",
        "strawson",
        "earlier",
        "work",
        "one",
        "later",
        "writing",
        "one",
        "stroud",
        "one",
        "stern",
        "recent",
        "example",
        "le",
        "ambitious",
        "transcendental",
        "argument",
        "see",
        "chang",
        "massimi",
        "also",
        "see",
        "coates",
        "strawson",
        "first",
        "response",
        "take",
        "inspiration",
        "reconsideration",
        "strawsonian",
        "transcendental",
        "argument",
        "criticised",
        "stroud",
        "offer",
        "different",
        "interpretation",
        "light",
        "critique",
        "thus",
        "suggested",
        "mistake",
        "see",
        "strawson",
        "argument",
        "straightforwardly",
        "worlddirected",
        "way",
        "presented",
        "earlier",
        "offering",
        "direct",
        "response",
        "sceptic",
        "proving",
        "sceptic",
        "doubt",
        "rather",
        "said",
        "strategy",
        "like",
        "aristotle",
        "elenchic",
        "response",
        "sceptic",
        "doubt",
        "principle",
        "noncontradiction",
        "namely",
        "show",
        "doubt",
        "intelligibly",
        "stated",
        "expressed",
        "acceptance",
        "principle",
        "necessary",
        "condition",
        "meaningful",
        "thought",
        "likewise",
        "therefore",
        "suggested",
        "strawson",
        "intended",
        "transcendental",
        "approach",
        "operate",
        "way",
        "strawson",
        "put",
        "sceptic",
        "doubt",
        "unreal",
        "simply",
        "logically",
        "unresolvable",
        "doubt",
        "amount",
        "rejection",
        "whole",
        "conceptual",
        "scheme",
        "within",
        "alone",
        "doubt",
        "make",
        "sense",
        "strawson",
        "cf",
        "also",
        "also",
        "glock",
        "illies",
        "thus",
        "may",
        "seem",
        "modest",
        "transcendental",
        "claim",
        "require",
        "effect",
        "sceptic",
        "raise",
        "doubt",
        "challenge",
        "u",
        "given",
        "must",
        "believe",
        "order",
        "think",
        "utter",
        "anything",
        "intelligible",
        "transcendental",
        "argument",
        "effective",
        "therefore",
        "showing",
        "sceptic",
        "doubt",
        "false",
        "showing",
        "doubt",
        "violated",
        "condition",
        "meaningfulness",
        "thus",
        "require",
        "positive",
        "answer",
        "response",
        "whether",
        "charitable",
        "way",
        "reading",
        "strawson",
        "earlier",
        "position",
        "seem",
        "adopted",
        "quite",
        "first",
        "response",
        "came",
        "reply",
        "stroud",
        "later",
        "work",
        "rather",
        "accepts",
        "stroud",
        "insistence",
        "transcendental",
        "claim",
        "must",
        "weakened",
        "cf",
        "strawson",
        "also",
        "offer",
        "call",
        "naturalistic",
        "reply",
        "sceptic",
        "based",
        "hume",
        "also",
        "wittgensteinian",
        "idea",
        "developed",
        "certainty",
        "according",
        "right",
        "approach",
        "sceptical",
        "doubt",
        "try",
        "answer",
        "argument",
        "show",
        "idle",
        "unable",
        "shift",
        "core",
        "belief",
        "implanted",
        "u",
        "nature",
        "lie",
        "centre",
        "way",
        "thinking",
        "cf",
        "strawson",
        "approach",
        "meaninglessness",
        "unintelligibility",
        "sceptical",
        "doubt",
        "first",
        "response",
        "inability",
        "shift",
        "dislodge",
        "belief",
        "embeddedness",
        "within",
        "thinking",
        "semantic",
        "issue",
        "need",
        "consideration",
        "rendering",
        "embedded",
        "way",
        "within",
        "naturalistic",
        "approach",
        "therefore",
        "strawson",
        "suggests",
        "transcendental",
        "argument",
        "valuable",
        "work",
        "precisely",
        "helping",
        "u",
        "show",
        "sceptic",
        "belief",
        "fundamental",
        "u",
        "way",
        "thus",
        "impervious",
        "sceptical",
        "doubt",
        "naturalist",
        "claimsbut",
        "play",
        "role",
        "transcendental",
        "claim",
        "modest",
        "one",
        "concerning",
        "must",
        "believe",
        "thing",
        "cf",
        "strawson",
        "see",
        "also",
        "grayling",
        "callanan",
        "third",
        "type",
        "modest",
        "approach",
        "offered",
        "stroud",
        "claim",
        "even",
        "transcendental",
        "argument",
        "show",
        "must",
        "believe",
        "antisceptical",
        "value",
        "showing",
        "belief",
        "indispensable",
        "invulnerable",
        "sense",
        "abandon",
        "also",
        "find",
        "false",
        "others",
        "find",
        "would",
        "give",
        "believing",
        "anything",
        "however",
        "stroud",
        "allows",
        "sort",
        "status",
        "belief",
        "questionfor",
        "example",
        "belief",
        "enduring",
        "particular",
        "mindsdoes",
        "go",
        "far",
        "ruling",
        "possibility",
        "belief",
        "sort",
        "fact",
        "true",
        "see",
        "stroud",
        "finally",
        "stern",
        "argued",
        "modest",
        "transcendental",
        "argument",
        "shown",
        "useful",
        "scepticism",
        "distinguish",
        "sufficiently",
        "carefully",
        "kind",
        "scepticism",
        "go",
        "right",
        "target",
        "targetswhere",
        "le",
        "demanding",
        "form",
        "scepticism",
        "may",
        "perhaps",
        "defeated",
        "le",
        "ambitious",
        "transcendental",
        "claim",
        "example",
        "take",
        "target",
        "sceptic",
        "demand",
        "certainty",
        "modest",
        "transcendental",
        "argument",
        "suffice",
        "take",
        "sceptic",
        "one",
        "demand",
        "merely",
        "justification",
        "may",
        "nonetheless",
        "fallible",
        "claim",
        "even",
        "belief",
        "properly",
        "supported",
        "generally",
        "accepted",
        "cognitive",
        "norm",
        "claimed",
        "modest",
        "transcendental",
        "argument",
        "indeed",
        "useful",
        "example",
        "justificatory",
        "sceptic",
        "may",
        "claim",
        "belief",
        "mind",
        "seems",
        "grounded",
        "nothing",
        "link",
        "behaviour",
        "mentality",
        "observe",
        "case",
        "argue",
        "based",
        "little",
        "poor",
        "argument",
        "analogy",
        "properly",
        "warranted",
        "extending",
        "others",
        "arguing",
        "single",
        "instance",
        "viz",
        "inadequate",
        "inductive",
        "base",
        "reason",
        "way",
        "response",
        "however",
        "could",
        "argued",
        "unless",
        "others",
        "appeared",
        "u",
        "mere",
        "body",
        "instead",
        "person",
        "mind",
        "could",
        "acquire",
        "capacity",
        "apply",
        "mentalistic",
        "predicate",
        "thus",
        "become",
        "selfconscious",
        "argument",
        "remains",
        "modest",
        "transcendental",
        "claim",
        "extends",
        "others",
        "must",
        "appear",
        "u",
        "worlddirected",
        "manner",
        "ambitious",
        "transcendental",
        "argument",
        "even",
        "idea",
        "still",
        "sufficient",
        "show",
        "belief",
        "mind",
        "merely",
        "based",
        "faulty",
        "inference",
        "way",
        "justificatory",
        "sceptic",
        "supposes",
        "rather",
        "nature",
        "experiencewhere",
        "therefore",
        "used",
        "show",
        "belief",
        "warranted",
        "even",
        "could",
        "still",
        "false",
        "none",
        "approach",
        "unobjectionable",
        "remains",
        "seen",
        "preferred",
        "concern",
        "aristotelian",
        "approach",
        "relate",
        "whether",
        "show",
        "belief",
        "x",
        "necessary",
        "intelligible",
        "thought",
        "general",
        "thought",
        "creature",
        "like",
        "uswhere",
        "establishes",
        "latter",
        "possibility",
        "sceptic",
        "raising",
        "intelligible",
        "doubt",
        "would",
        "seem",
        "remain",
        "establishing",
        "former",
        "seems",
        "extremely",
        "demanding",
        "impossible",
        "cf",
        "körner",
        "worry",
        "might",
        "raised",
        "stroudian",
        "spirit",
        "approach",
        "show",
        "doubt",
        "coherently",
        "expressed",
        "concerning",
        "x",
        "seems",
        "fall",
        "short",
        "establishing",
        "x",
        "really",
        "case",
        "finally",
        "may",
        "perhaps",
        "seem",
        "right",
        "say",
        "something",
        "unintelligible",
        "meaningless",
        "questioning",
        "principle",
        "noncontradiction",
        "although",
        "also",
        "challenged",
        "cf",
        "priest",
        "sceptical",
        "doubt",
        "seem",
        "problematic",
        "degree",
        "discussion",
        "point",
        "sort",
        "see",
        "illies",
        "along",
        "similar",
        "line",
        "critic",
        "also",
        "questioned",
        "strawson",
        "naturalistic",
        "approach",
        "fully",
        "answering",
        "sceptical",
        "challenge",
        "even",
        "doubt",
        "idle",
        "follow",
        "questioned",
        "really",
        "true",
        "cf",
        "valberg",
        "sen",
        "likewise",
        "come",
        "stroud",
        "position",
        "admits",
        "indispensability",
        "invulnerability",
        "speaks",
        "might",
        "seem",
        "like",
        "much",
        "reassurance",
        "face",
        "general",
        "scepticism",
        "stroud",
        "given",
        "rule",
        "possibility",
        "falsity",
        "also",
        "seemingly",
        "give",
        "additional",
        "reason",
        "taking",
        "possibility",
        "le",
        "seriously",
        "moreover",
        "suggested",
        "stroud",
        "position",
        "unstable",
        "claim",
        "certain",
        "belief",
        "invulnerable",
        "one",
        "hand",
        "acceptance",
        "might",
        "untrue",
        "seem",
        "stand",
        "tension",
        "one",
        "another",
        "see",
        "brueckner",
        "position",
        "proposed",
        "stern",
        "try",
        "get",
        "round",
        "difficulty",
        "also",
        "accused",
        "ducking",
        "important",
        "aspect",
        "sceptic",
        "challenge",
        "see",
        "eg",
        "sack",
        "sack",
        "positive",
        "proposal",
        "see",
        "sack",
        "a",
        "b",
        "finally",
        "attempt",
        "adopt",
        "approach",
        "neither",
        "ambitious",
        "modest",
        "somewhere",
        "two",
        "see",
        "mcdowell",
        "whatever",
        "respective",
        "strength",
        "weakness",
        "one",
        "thing",
        "modest",
        "strategy",
        "suggested",
        "central",
        "feature",
        "transcendental",
        "argument",
        "outlined",
        "fit",
        "argument",
        "le",
        "ambitious",
        "sort",
        "thus",
        "argument",
        "worlddirected",
        "self",
        "experience",
        "beliefdirected",
        "secondly",
        "expect",
        "transcendental",
        "argument",
        "refute",
        "sceptic",
        "conjunction",
        "broader",
        "epistemological",
        "antisceptical",
        "consideration",
        "naturalism",
        "perceptual",
        "epistemic",
        "norm",
        "thirdly",
        "offering",
        "approach",
        "modest",
        "raise",
        "question",
        "much",
        "adequate",
        "response",
        "scepticism",
        "entitled",
        "assume",
        "kind",
        "reassurance",
        "meant",
        "provide",
        "cf",
        "hookway",
        "cassam",
        "wang",
        "way",
        "raised",
        "exegetical",
        "issue",
        "kant",
        "place",
        "canon",
        "discussed",
        "might",
        "understood",
        "differently",
        "concerning",
        "attitude",
        "scepticism",
        "whether",
        "end",
        "intention",
        "best",
        "interpreted",
        "modest",
        "ambitious",
        "term",
        "cf",
        "callanan",
        "bardon",
        "stapelford"
    ]
}