{
    "main_text": "Origins and Character\n1. Origins and Character\n\nWhat we now know as transcendentalism first arose among the liberal\nNew England Congregationalists, who departed from orthodox Calvinism\nin two respects: they believed in the importance and efficacy of human\nstriving, as opposed to the bleaker Puritan picture of complete and\ninescapable human depravity; and they emphasized the unity rather than\nthe “Trinity” of God (hence the term\n“Unitarian,” originally a term of abuse that they came to\nadopt.) Most of the Unitarians held that Jesus was in some way\ninferior to God the Father but still greater than human beings; a few\nfollowed the English Unitarian Joseph Priestley (1733–1804) in\nholding that Jesus was thoroughly human, although endowed with special\nauthority. The Unitarians’ leading preacher, William Ellery\nChanning (1780–1842), portrayed orthodox Congregationalism as a\nreligion of fear, and maintained that Jesus saved human beings from\nsin, not just from punishment. His sermon “Unitarian\nChristianity” (1819) denounced “the conspiracy of ages\nagainst the liberty of Christians” (P, 336) and helped give the\nUnitarian movement its name. In “Likeness to God” (1828)\nhe proposed that human beings “partake” of Divinity and\nthat they may achieve “a growing likeness to the Supreme\nBeing” (T, 4).\n\nThe Unitarians were “modern.” They attempted to reconcile\nLocke’s empiricism with Christianity by maintaining that the\naccounts of miracles in the Bible provide overwhelming evidence for\nthe truth of religion. It was precisely on this ground, however, that\nthe transcendentalists found fault with Unitarianism. For although\nthey admired Channing’s idea that human beings can become more\nlike God, they were persuaded by Hume that no empirical proof of\nreligion could be satisfactory. In letters written in his freshman\nyear at Harvard (1817), Emerson tried out Hume’s skeptical\narguments on his devout and respected Aunt Mary Moody Emerson, and in\nhis journals of the early 1820s he discusses with approval\nHume’s Dialogues on Natural Religion and his underlying\ncritique of necessary connection. “We have no experience of a\nCreator,” Emerson writes, and therefore we “know of\nnone” (JMN 2, 161).\n\nSkepticism about religion was also engendered by the publication of an\nEnglish translation of F. D. E. Schleiermacher’s Critical\nEssay Upon the Gospel of St. Luke (1825), which introduced the\nidea that the Bible was a product of human history and culture.\nEqually important was the publication in 1833—some fifty years\nafter its initial appearance in Germany—of James Marsh’s\ntranslation of Johann Gottfried von Herder’s Spirit of\nHebrew Poetry (1782). Herder blurred the lines between religious\ntexts and humanly-produced poetry, casting doubt on the authority of\nthe Bible, but also suggesting that texts with equal authority could\nstill be written. It was against this background that Emerson asked in\n1836, in the first paragraph of Nature: “Why should we\nnot have a poetry and philosophy of insight and not of tradition, and\na religion by revelation to us, and not the history of theirs”\n(O, 5). The individual’s “revelation”—or\n“intuition,” as Emerson was later to speak of it—was\nto be the counter both to Unitarian empiricism and Humean\nskepticism.\n\nAn important source for the transcendentalists’ knowledge of\nGerman philosophy was Frederic Henry Hedge (1805–90).\nHedge’s father Levi Hedge, a Harvard professor of logic, sent\nhim to preparatory school in Germany at the age of thirteen, after\nwhich he attended the Harvard Divinity School. Ordained as a Unitarian\nminister, Hedge wrote a long review of the work of Samuel Taylor\nColeridge for the Christian Examiner in 1833. Noting\nColeridge’s fondness for “German metaphysics” and\nhis immense gifts of erudition and expression, he laments that\nColeridge had not made Kant and the post-Kantians more accessible to\nan English-speaking audience. This is the task—to introduce the\n“transcendental philosophy” of Kant, (T, 87)—that\nHedge takes up. In particular, he explains Kant’s idea of a\nCopernican Revolution in philosophy: “[S]ince the supposition\nthat our intuitions depend on the nature of the world without, will\nnot answer, assume that the world without depends on the nature of our\nintuitions.” This “key to the whole critical\nphilosophy,” Hedge continues, explains the possibility of\n“a priori knowledge” (T, 92). Hedge organized what\neventually became known as the Transcendental Club, by suggesting to\nEmerson in 1836 that they form a discussion group for disaffected\nyoung Unitarian clergy. The group included George Ripley and Bronson\nAlcott, had some 30 meetings in four years, and was a sponsor of\nThe Dial and Brook Farm. Hedge was a vocal opponent of\nslavery in the 1830s and a champion of women’s rights in the\n1850s, but he remained a Unitarian minister, and became a professor at\nthe Harvard Divinity School.\n\nAnother source for the transcendentalists’ knowledge of German\nphilosophy was Germaine de Staël (Anne-Louise-Germaine Necker)\n(1766–1817), whose De l’Allemagne (On\nGermany) was a favorite of the young Emerson. In a sweeping\nsurvey of European metaphysics and political philosophy, de Staël\npraises Locke’s devotion to liberty, but sees him as the\noriginator of a sensationalist school of epistemology that leads to\nthe skepticism of Hume. She finds an attractive contrast in the German\ntradition that begins with Leibniz and culminates in Kant, which\nasserts the power and authority of the mind.\n\nJames Marsh (1794–1842), a graduate of Andover and the president\nof the University of Vermont, was equally important for the emerging\nphilosophy of transcendentalism. Marsh was convinced that German\nphilosophy held the key to a reformed theology. His American edition\nof Coleridge’s Aids to Reflection (1829) introduced\nColeridge’s version—much indebted to Schelling—of\nKantian terminology, terminology that runs throughout Emerson’s\nearly work. In Nature, for example, Emerson writes:\n“The Imagination may be defined to be, the use which the Reason\nmakes of the material world” (O, 25).\n\nGerman philosophy and literature was also championed by Thomas\nCarlyle, whom Emerson met on his first trip to Europe in 1831.\nCarlyle’s philosophy of action in such works as Sartor\nResartus resonates with Emerson’s idea in “The\nAmerican Scholar” that action—along with nature and\n“the mind of the Past” (O, 39) is essential to human\neducation. Along with his countrymen Coleridge and Wordsworth, Carlyle\nembraced a “natural supernaturalism,” the view that\nnature, including human beings, has the power and authority\ntraditionally attributed to an independent deity.\n\nPiety towards nature was also a main theme of William Wordsworth,\nwhose poetry was in vogue in America in the 1820s. Wordsworth’s\ndepiction of an active and powerful mind cohered with the shaping\npower of the mind that his collaborator in the Lyrical\nBallads, Samuel Taylor Coleridge, traced to Kant. The idea of\nsuch power pervades Emerson’s Nature, where he writes\nof nature as “obedient” to spirit and counsels each of us\nto “Build … your own world.” Wordsworth has his\nmore receptive mode as well, in which he calls for “a heart that\nwatches and receives” (in “The Tables Turned”), and\nwe find Emerson’s receptive mode from Nature onward, as\nwhen he recounts an ecstatic experience in the woods: “I become\na transparent eyeball. I am nothing; I see all; The currents of the\nuniversal being circulate through me.” (O, 6).\n\nEmerson’s sense that men and women are, as he put it in\nNature, gods “in ruins,” led to one of\ntranscendentalism’s defining events, his delivery of an address\nat the Harvard Divinity School graduation in 1838. Emerson portrayed\nthe contemporary church that the graduates were about to lead as an\n“eastern monarchy of a Christianity” that had become an\n“injuror of man” (O, 58). Jesus, in contrast, was a\n“friend of man.” Yet he was just one of the “true\nrace of prophets,” whose message is not so much their own\ngreatness, as the “greatness of man” (O, 57). Emerson\nrejects the Unitarian argument that miracles prove the truth of\nChristianity, not simply because the evidence is weak, but because\nproof of the sort they envision embodies a mistaken view of the nature\nof religion: “conversion by miracles is a profanation of the\nsoul.” Emerson’s religion is based not on testimony but on\na “perception” that produces a “religious\nsentiment” (O, 55).\n\nThe “Divinity School Address” drew a quick and angry\nresponse from Andrews Norton (1786–1853) of the Harvard Divinity\nSchool, often known as the “Unitarian Pope.” In “The\nNew School in Literature and Religion” (1838), Norton complains\nof “a restless craving for notoriety and excitement,”\nwhich he traces to German “speculatists” and\n“barbarians” and “that hyper-Germanized Englishman,\nCarlyle.” Emerson’s “Address,” he concludes,\nis at once “an insult to religion” (T, 248) and “an\nincoherent rhapsody” (T, 249).\n\nAn earlier transcendentalist scandal surrounded the publication of\nAmos Bronson Alcott’s Conversations with Children Upon the\nGospels (1836). Alcott (1799–1888) was a self-taught\neducator from Connecticut who established a series of schools that\naimed to “draw out” the intuitive knowledge of children.\nHe found anticipations of his views about a priori knowledge in the\nwritings of Plato and Kant, and support in Coleridge’s Aids\nto Reflection for the idea that idealism and materiality could be\nreconciled. Alcott replaced the hard benches of the common schools\nwith more comfortable furniture that he built himself, and left a\ncentral space in his classrooms for dancing. The Conversations\nwith Children Upon the Gospels, based on a school Alcott (and his\nassistant Elizabeth Peabody) ran in Boston, argued that evidence for\nthe truth of Christianity could be found in the unimpeded flow of\nchildren’s thought. What people particularly noticed about\nAlcott’s book, however, were its frank discussions of\nconception, circumcision, and childbirth. Rather than gaining support\nfor his school, the publication of the book caused many parents to\nwithdraw their children from it, and the school—like many of\nAlcott’s projects, failed.\n\nTheodore Parker (1810–60) was the son of a farmer who attended\nHarvard and became a Unitarian minister and accomplished linguist. He\npublished a long critical essay on David Friedrich Strauss’s\nDas Leben Jesu, and translated Wilhelm Martin Leberecht de\nWette’s Introduction to the Old Testament, both of\nwhich cast doubt on the divine inspiration and single authorship of\nthe Bible. After the publication of his “A Discourse Concerning\nthe Transient and Permanent in Christianity” (1841) he was\ninvited to resign from the Boston Association of Ministers (he did\nnot), and was no longer welcome in many pulpits. He argued, much as\nEmerson had in the “Divinity School Address,” that\nChristianity had nothing essential to do with the person of Jesus:\n“If Jesus taught at Athens, and not at Jerusalem; if he had\nwrought no miracle, and none but the human nature had ever been\nascribed to him; if the Old Testament had forever perished at his\nbirth, Christianity would still have been the Word of God …\njust as true, just as lasting, just as beautiful, as now it\nis…” (T, 352). Parker exploited the similarities between\nscience and religious doctrine to argue that although nature and\nreligious truth are permanent, any merely human version of such truth\nis transient. In religious doctrines especially, there are stunning\nreversals, so that “men are burned for professing what men are\nburned for denying” (T, 347).\n\nSurveying the scene in his 1842 lecture, “The\nTranscendentalist,” Emerson begins with a philosophical account,\naccording to which what are generally called “new views”\nare not really new, but rather part of a broad tradition of idealism.\nIt is not a skeptical idealism, however, but an anti-skeptical\nidealism deriving from Kant:\n\nIt is well known to most of my audience, that the Idealism of the\npresent day acquired the name of Transcendental, from the use of that\nterm by Immanuel Kant, of Konigsberg [sic], who replied to the\nskeptical philosophy of Locke, which insisted that there was nothing\nin the intellect which was not previously in the experience of the\nsenses, by showing that there was a very important class of ideas, or\nimperative forms, which did not come by experience, but through which\nexperience was acquired; that these were intuitions of the mind\nitself; and he denominated them Transcendental forms (O, 101–2).\n\n\nEmerson shows here a basic understanding of three Kantian claims,\nwhich can be traced throughout his philosophy: that the human mind\n“forms” experience; that the existence of such mental\noperations is a counter to skepticism; and that\n“transcendental” does not mean “transcendent”\nor beyond human experience altogether, but something through which\nexperience is made possible. Emerson’s idealism is not purely\nKantian, however, for (like Coleridge’s) it contains a strong\nadmixture of Neoplatonism and post-Kantian idealism. Emerson thinks of\nReason, for example, as a faculty of “vision,” as opposed\nto the mundane understanding, which “toils all the time,\ncompares, contrives, adds, argues….” (Letters,\nvol. 1, 413). For many of the transcendentalists the term\n“transcendentalism” represented nothing so technical as an\ninquiry into the presuppositions of human experience, but a new\nconfidence in and appreciation of the mind’s powers, and a\nmodern, non-doctrinal spirituality. The transcendentalist, Emerson\nstates, believes in miracles, conceived as “the perpetual\nopenness of the human mind to new influx of light and\npower…” (O, 100).\n\nEmerson keeps his distance from the transcendentalists in his essay by\nspeaking always of what “they” say or do, despite the fact\nthat he was regarded then and is regarded now as the leading\ntranscendentalist. He notes with some disdain that the\ntranscendentalists are “’not good members of\nsociety,” that they do not work for “the abolition of the\nslave-trade” (though both these charges have been leveled at\nhim). He closes the essay nevertheless with a defense of the\ntranscendentalist critique of a society pervaded by “a spirit of\ncowardly compromise and seeming, which intimates a frightful\nskepticism, a life without love, and an activity without an aim”\n(O, 106). This critique is Emerson’s own in such writings as\n“Self-Reliance,” and “The American Scholar”;\nand it finds a powerful and original restatement in the\n“Economy” chapter of Thoreau’s Walden.\n",
    "section_title": "1. Origins and Character",
    "entry_title": "Transcendentalism",
    "hierarchy_title": "Transcendentalism || Origins and Character",
    "tokenized_text": [
        "origin",
        "character",
        "origin",
        "character",
        "know",
        "transcendentalism",
        "first",
        "arose",
        "among",
        "liberal",
        "new",
        "england",
        "congregationalist",
        "departed",
        "orthodox",
        "calvinism",
        "two",
        "respect",
        "believed",
        "importance",
        "efficacy",
        "human",
        "striving",
        "opposed",
        "bleaker",
        "puritan",
        "picture",
        "complete",
        "inescapable",
        "human",
        "depravity",
        "emphasized",
        "unity",
        "rather",
        "trinity",
        "god",
        "hence",
        "term",
        "unitarian",
        "originally",
        "term",
        "abuse",
        "came",
        "adopt",
        "unitarian",
        "held",
        "jesus",
        "way",
        "inferior",
        "god",
        "father",
        "still",
        "greater",
        "human",
        "being",
        "followed",
        "english",
        "unitarian",
        "joseph",
        "priestley",
        "holding",
        "jesus",
        "thoroughly",
        "human",
        "although",
        "endowed",
        "special",
        "authority",
        "unitarian",
        "leading",
        "preacher",
        "william",
        "ellery",
        "channing",
        "portrayed",
        "orthodox",
        "congregationalism",
        "religion",
        "fear",
        "maintained",
        "jesus",
        "saved",
        "human",
        "being",
        "sin",
        "punishment",
        "sermon",
        "unitarian",
        "christianity",
        "denounced",
        "conspiracy",
        "age",
        "liberty",
        "christian",
        "p",
        "helped",
        "give",
        "unitarian",
        "movement",
        "name",
        "likeness",
        "god",
        "proposed",
        "human",
        "being",
        "partake",
        "divinity",
        "may",
        "achieve",
        "growing",
        "likeness",
        "supreme",
        "unitarian",
        "modern",
        "attempted",
        "reconcile",
        "locke",
        "empiricism",
        "christianity",
        "maintaining",
        "account",
        "miracle",
        "bible",
        "provide",
        "overwhelming",
        "evidence",
        "truth",
        "religion",
        "precisely",
        "ground",
        "however",
        "transcendentalist",
        "found",
        "fault",
        "unitarianism",
        "although",
        "admired",
        "channing",
        "idea",
        "human",
        "being",
        "become",
        "like",
        "god",
        "persuaded",
        "hume",
        "empirical",
        "proof",
        "religion",
        "could",
        "satisfactory",
        "letter",
        "written",
        "freshman",
        "year",
        "harvard",
        "emerson",
        "tried",
        "hume",
        "skeptical",
        "argument",
        "devout",
        "respected",
        "aunt",
        "mary",
        "moody",
        "emerson",
        "journal",
        "early",
        "s",
        "discus",
        "approval",
        "hume",
        "dialogue",
        "natural",
        "religion",
        "underlying",
        "critique",
        "necessary",
        "connection",
        "experience",
        "creator",
        "emerson",
        "writes",
        "therefore",
        "know",
        "none",
        "jmn",
        "skepticism",
        "religion",
        "also",
        "engendered",
        "publication",
        "english",
        "translation",
        "f",
        "d",
        "e",
        "schleiermacher",
        "critical",
        "essay",
        "upon",
        "gospel",
        "st",
        "luke",
        "introduced",
        "idea",
        "bible",
        "product",
        "human",
        "history",
        "culture",
        "equally",
        "important",
        "publication",
        "some",
        "fifty",
        "year",
        "initial",
        "appearance",
        "germanyof",
        "james",
        "marsh",
        "translation",
        "johann",
        "gottfried",
        "von",
        "herder",
        "spirit",
        "hebrew",
        "poetry",
        "herder",
        "blurred",
        "line",
        "religious",
        "text",
        "humanlyproduced",
        "poetry",
        "casting",
        "doubt",
        "authority",
        "bible",
        "also",
        "suggesting",
        "text",
        "equal",
        "authority",
        "could",
        "still",
        "written",
        "background",
        "emerson",
        "asked",
        "first",
        "paragraph",
        "nature",
        "poetry",
        "philosophy",
        "insight",
        "tradition",
        "religion",
        "revelation",
        "u",
        "history",
        "individual",
        "revelation",
        "or",
        "intuition",
        "emerson",
        "later",
        "speak",
        "itwas",
        "counter",
        "unitarian",
        "empiricism",
        "humean",
        "skepticism",
        "important",
        "source",
        "transcendentalist",
        "knowledge",
        "german",
        "philosophy",
        "frederic",
        "henry",
        "hedge",
        "hedge",
        "father",
        "levi",
        "hedge",
        "harvard",
        "professor",
        "logic",
        "sent",
        "preparatory",
        "school",
        "germany",
        "age",
        "thirteen",
        "attended",
        "harvard",
        "divinity",
        "school",
        "ordained",
        "unitarian",
        "minister",
        "hedge",
        "wrote",
        "long",
        "review",
        "work",
        "samuel",
        "taylor",
        "coleridge",
        "christian",
        "examiner",
        "noting",
        "coleridge",
        "fondness",
        "german",
        "metaphysics",
        "immense",
        "gift",
        "erudition",
        "expression",
        "lament",
        "coleridge",
        "made",
        "kant",
        "postkantians",
        "accessible",
        "englishspeaking",
        "audience",
        "taskto",
        "introduce",
        "transcendental",
        "philosophy",
        "kant",
        "that",
        "hedge",
        "take",
        "particular",
        "explains",
        "kant",
        "idea",
        "copernican",
        "revolution",
        "philosophy",
        "ince",
        "supposition",
        "intuition",
        "depend",
        "nature",
        "world",
        "without",
        "answer",
        "assume",
        "world",
        "without",
        "depends",
        "nature",
        "intuitions",
        "key",
        "whole",
        "critical",
        "philosophy",
        "hedge",
        "continues",
        "explains",
        "possibility",
        "priori",
        "knowledge",
        "hedge",
        "organized",
        "eventually",
        "became",
        "known",
        "transcendental",
        "club",
        "suggesting",
        "emerson",
        "form",
        "discussion",
        "group",
        "disaffected",
        "young",
        "unitarian",
        "clergy",
        "group",
        "included",
        "george",
        "ripley",
        "bronson",
        "alcott",
        "meeting",
        "four",
        "year",
        "sponsor",
        "dial",
        "brook",
        "farm",
        "hedge",
        "vocal",
        "opponent",
        "slavery",
        "s",
        "champion",
        "woman",
        "right",
        "s",
        "remained",
        "unitarian",
        "minister",
        "became",
        "professor",
        "harvard",
        "divinity",
        "school",
        "another",
        "source",
        "transcendentalist",
        "knowledge",
        "german",
        "philosophy",
        "germaine",
        "de",
        "staël",
        "annelouisegermaine",
        "necker",
        "whose",
        "de",
        "l",
        "allemagne",
        "germany",
        "favorite",
        "young",
        "emerson",
        "sweeping",
        "survey",
        "european",
        "metaphysics",
        "political",
        "philosophy",
        "de",
        "staël",
        "praise",
        "locke",
        "devotion",
        "liberty",
        "see",
        "originator",
        "sensationalist",
        "school",
        "epistemology",
        "lead",
        "skepticism",
        "hume",
        "find",
        "attractive",
        "contrast",
        "german",
        "tradition",
        "begin",
        "leibniz",
        "culminates",
        "kant",
        "asserts",
        "power",
        "authority",
        "mind",
        "james",
        "marsh",
        "graduate",
        "andover",
        "president",
        "university",
        "vermont",
        "equally",
        "important",
        "emerging",
        "philosophy",
        "transcendentalism",
        "marsh",
        "convinced",
        "german",
        "philosophy",
        "held",
        "key",
        "reformed",
        "theology",
        "american",
        "edition",
        "coleridge",
        "aid",
        "reflection",
        "introduced",
        "coleridge",
        "versionmuch",
        "indebted",
        "schellingof",
        "kantian",
        "terminology",
        "terminology",
        "run",
        "throughout",
        "emerson",
        "early",
        "work",
        "nature",
        "example",
        "emerson",
        "writes",
        "imagination",
        "may",
        "defined",
        "use",
        "reason",
        "make",
        "material",
        "world",
        "german",
        "philosophy",
        "literature",
        "also",
        "championed",
        "thomas",
        "carlyle",
        "emerson",
        "met",
        "first",
        "trip",
        "europe",
        "carlyle",
        "philosophy",
        "action",
        "work",
        "sartor",
        "resartus",
        "resonates",
        "emerson",
        "idea",
        "american",
        "scholar",
        "actionalong",
        "nature",
        "mind",
        "past",
        "essential",
        "human",
        "education",
        "along",
        "countryman",
        "coleridge",
        "wordsworth",
        "carlyle",
        "embraced",
        "natural",
        "supernaturalism",
        "view",
        "nature",
        "including",
        "human",
        "being",
        "power",
        "authority",
        "traditionally",
        "attributed",
        "independent",
        "deity",
        "piety",
        "towards",
        "nature",
        "also",
        "main",
        "theme",
        "william",
        "wordsworth",
        "whose",
        "poetry",
        "vogue",
        "america",
        "s",
        "wordsworth",
        "depiction",
        "active",
        "powerful",
        "mind",
        "cohered",
        "shaping",
        "power",
        "mind",
        "collaborator",
        "lyrical",
        "ballad",
        "samuel",
        "taylor",
        "coleridge",
        "traced",
        "kant",
        "idea",
        "power",
        "pervades",
        "emerson",
        "nature",
        "writes",
        "nature",
        "obedient",
        "spirit",
        "counsel",
        "u",
        "build",
        "world",
        "wordsworth",
        "receptive",
        "mode",
        "well",
        "call",
        "heart",
        "watch",
        "receives",
        "table",
        "turned",
        "find",
        "emerson",
        "receptive",
        "mode",
        "nature",
        "onward",
        "recount",
        "ecstatic",
        "experience",
        "wood",
        "become",
        "transparent",
        "eyeball",
        "nothing",
        "see",
        "current",
        "universal",
        "circulate",
        "me",
        "emerson",
        "sense",
        "men",
        "woman",
        "put",
        "nature",
        "god",
        "ruin",
        "led",
        "one",
        "transcendentalism",
        "defining",
        "event",
        "delivery",
        "address",
        "harvard",
        "divinity",
        "school",
        "graduation",
        "emerson",
        "portrayed",
        "contemporary",
        "church",
        "graduate",
        "lead",
        "eastern",
        "monarchy",
        "christianity",
        "become",
        "injuror",
        "man",
        "jesus",
        "contrast",
        "friend",
        "man",
        "yet",
        "one",
        "true",
        "race",
        "prophet",
        "whose",
        "message",
        "much",
        "greatness",
        "greatness",
        "man",
        "emerson",
        "reject",
        "unitarian",
        "argument",
        "miracle",
        "prove",
        "truth",
        "christianity",
        "simply",
        "evidence",
        "weak",
        "proof",
        "sort",
        "envision",
        "embodies",
        "mistaken",
        "view",
        "nature",
        "religion",
        "conversion",
        "miracle",
        "profanation",
        "soul",
        "emerson",
        "religion",
        "based",
        "testimony",
        "perception",
        "produce",
        "religious",
        "sentiment",
        "divinity",
        "school",
        "address",
        "drew",
        "quick",
        "angry",
        "response",
        "andrew",
        "norton",
        "harvard",
        "divinity",
        "school",
        "often",
        "known",
        "unitarian",
        "pope",
        "new",
        "school",
        "literature",
        "religion",
        "norton",
        "complains",
        "restless",
        "craving",
        "notoriety",
        "excitement",
        "trace",
        "german",
        "speculatists",
        "barbarian",
        "hypergermanized",
        "englishman",
        "carlyle",
        "emerson",
        "address",
        "concludes",
        "insult",
        "religion",
        "incoherent",
        "rhapsody",
        "earlier",
        "transcendentalist",
        "scandal",
        "surrounded",
        "publication",
        "amos",
        "bronson",
        "alcott",
        "conversation",
        "child",
        "upon",
        "gospel",
        "alcott",
        "selftaught",
        "educator",
        "connecticut",
        "established",
        "series",
        "school",
        "aimed",
        "draw",
        "intuitive",
        "knowledge",
        "child",
        "found",
        "anticipation",
        "view",
        "priori",
        "knowledge",
        "writing",
        "plato",
        "kant",
        "support",
        "coleridge",
        "aid",
        "reflection",
        "idea",
        "idealism",
        "materiality",
        "could",
        "reconciled",
        "alcott",
        "replaced",
        "hard",
        "bench",
        "common",
        "school",
        "comfortable",
        "furniture",
        "built",
        "left",
        "central",
        "space",
        "classroom",
        "dancing",
        "conversation",
        "child",
        "upon",
        "gospel",
        "based",
        "school",
        "alcott",
        "assistant",
        "elizabeth",
        "peabody",
        "ran",
        "boston",
        "argued",
        "evidence",
        "truth",
        "christianity",
        "could",
        "found",
        "unimpeded",
        "flow",
        "child",
        "thought",
        "people",
        "particularly",
        "noticed",
        "alcott",
        "book",
        "however",
        "frank",
        "discussion",
        "conception",
        "circumcision",
        "childbirth",
        "rather",
        "gaining",
        "support",
        "school",
        "publication",
        "book",
        "caused",
        "many",
        "parent",
        "withdraw",
        "child",
        "schoollike",
        "many",
        "alcott",
        "project",
        "failed",
        "theodore",
        "parker",
        "son",
        "farmer",
        "attended",
        "harvard",
        "became",
        "unitarian",
        "minister",
        "accomplished",
        "linguist",
        "published",
        "long",
        "critical",
        "essay",
        "david",
        "friedrich",
        "strauss",
        "da",
        "leben",
        "jesu",
        "translated",
        "wilhelm",
        "martin",
        "leberecht",
        "de",
        "wette",
        "introduction",
        "old",
        "testament",
        "cast",
        "doubt",
        "divine",
        "inspiration",
        "single",
        "authorship",
        "bible",
        "publication",
        "discourse",
        "concerning",
        "transient",
        "permanent",
        "christianity",
        "invited",
        "resign",
        "boston",
        "association",
        "minister",
        "longer",
        "welcome",
        "many",
        "pulpit",
        "argued",
        "much",
        "emerson",
        "divinity",
        "school",
        "address",
        "christianity",
        "nothing",
        "essential",
        "person",
        "jesus",
        "jesus",
        "taught",
        "athens",
        "jerusalem",
        "wrought",
        "miracle",
        "none",
        "human",
        "nature",
        "ever",
        "ascribed",
        "old",
        "testament",
        "forever",
        "perished",
        "birth",
        "christianity",
        "would",
        "still",
        "word",
        "god",
        "true",
        "lasting",
        "beautiful",
        "is",
        "parker",
        "exploited",
        "similarity",
        "science",
        "religious",
        "doctrine",
        "argue",
        "although",
        "nature",
        "religious",
        "truth",
        "permanent",
        "merely",
        "human",
        "version",
        "truth",
        "transient",
        "religious",
        "doctrine",
        "especially",
        "stunning",
        "reversal",
        "men",
        "burned",
        "professing",
        "men",
        "burned",
        "denying",
        "surveying",
        "scene",
        "lecture",
        "transcendentalist",
        "emerson",
        "begin",
        "philosophical",
        "account",
        "according",
        "generally",
        "called",
        "new",
        "view",
        "really",
        "new",
        "rather",
        "part",
        "broad",
        "tradition",
        "idealism",
        "skeptical",
        "idealism",
        "however",
        "antiskeptical",
        "idealism",
        "deriving",
        "kant",
        "well",
        "known",
        "audience",
        "idealism",
        "present",
        "day",
        "acquired",
        "name",
        "transcendental",
        "use",
        "term",
        "immanuel",
        "kant",
        "konigsberg",
        "sic",
        "replied",
        "skeptical",
        "philosophy",
        "locke",
        "insisted",
        "nothing",
        "intellect",
        "previously",
        "experience",
        "sens",
        "showing",
        "important",
        "class",
        "idea",
        "imperative",
        "form",
        "come",
        "experience",
        "experience",
        "acquired",
        "intuition",
        "mind",
        "denominated",
        "transcendental",
        "form",
        "emerson",
        "show",
        "basic",
        "understanding",
        "three",
        "kantian",
        "claim",
        "traced",
        "throughout",
        "philosophy",
        "human",
        "mind",
        "form",
        "experience",
        "existence",
        "mental",
        "operation",
        "counter",
        "skepticism",
        "transcendental",
        "mean",
        "transcendent",
        "beyond",
        "human",
        "experience",
        "altogether",
        "something",
        "experience",
        "made",
        "possible",
        "emerson",
        "idealism",
        "purely",
        "kantian",
        "however",
        "like",
        "coleridge",
        "contains",
        "strong",
        "admixture",
        "neoplatonism",
        "postkantian",
        "idealism",
        "emerson",
        "think",
        "reason",
        "example",
        "faculty",
        "vision",
        "opposed",
        "mundane",
        "understanding",
        "toil",
        "time",
        "compare",
        "contrives",
        "add",
        "argues",
        "letter",
        "vol",
        "many",
        "transcendentalist",
        "term",
        "transcendentalism",
        "represented",
        "nothing",
        "technical",
        "inquiry",
        "presupposition",
        "human",
        "experience",
        "new",
        "confidence",
        "appreciation",
        "mind",
        "power",
        "modern",
        "nondoctrinal",
        "spirituality",
        "transcendentalist",
        "emerson",
        "state",
        "belief",
        "miracle",
        "conceived",
        "perpetual",
        "openness",
        "human",
        "mind",
        "new",
        "influx",
        "light",
        "power",
        "emerson",
        "keep",
        "distance",
        "transcendentalist",
        "essay",
        "speaking",
        "always",
        "say",
        "despite",
        "fact",
        "regarded",
        "regarded",
        "leading",
        "transcendentalist",
        "note",
        "disdain",
        "transcendentalist",
        "good",
        "member",
        "society",
        "work",
        "abolition",
        "slavetrade",
        "though",
        "charge",
        "leveled",
        "close",
        "essay",
        "nevertheless",
        "defense",
        "transcendentalist",
        "critique",
        "society",
        "pervaded",
        "spirit",
        "cowardly",
        "compromise",
        "seeming",
        "intimate",
        "frightful",
        "skepticism",
        "life",
        "without",
        "love",
        "activity",
        "without",
        "aim",
        "critique",
        "emerson",
        "writing",
        "selfreliance",
        "american",
        "scholar",
        "find",
        "powerful",
        "original",
        "restatement",
        "economy",
        "chapter",
        "thoreau",
        "walden"
    ]
}