{
    "main_text": "Three-self Theories || Ersatz Monotheism\n2.3 Ersatz Monotheism\n\nA problem for any three-self Trinity theory is that numerically three\nselves are, it would seem, numerically three things. And according to\na theory of essences or natures, a thing which has or which is an\ninstance of an essence or nature is thereby a thing of a certain kind.\nAll Trinity theories include the Nicene claim that the Persons of the\nTrinity have between them but one essence or nature, the divine one.\nBut it would seem that by definition a thing with the divine essence\nis a god, and so three such things would be three gods.\n\nSome three-self theories in effect concede that they imply tritheism\n(three things, each of which has properties sufficient for being a\ngod), but argue that surely a correct Trinity theory can’t avoid\nthe right type of tritheism, and can avoid any undesirable tritheism,\nsuch as ones involving unequal divinity of the Persons, Persons which\nare in some sense independent, or Persons who are in principle\nseparable (McCall 2010, 2014c; Plantinga 1988, 1989; Yandell 2010,\n2015).\n\nRichard Swinburne has long developed and defended a type of three-self\nTrinity theory which in the eyes of most critics seems to be “a\nfairly straightforward form of tritheism” (Alston 1997, 55. See\nalso Clark 1996; Davidson 2016; Feser 1997; Howard-Snyder 2015a;\nMoreland and Craig 2017; Rea 2006; van Inwagen and Howard-Snyder 1998;\nvan Inwagen 2003, 88; Vohánka 2014, 56). In a series of\narticles and books Swinburne’s views have changed in significant\nways (Swinburne 1988, 1994, 2008, 2018), but this entry focuses on his\nlatest work on the Trinity.\n\nSwinburne aims to build his theory on widespread traditional\nagreements between most catholic theologians since at least\nthe fourth and fifth centuries (Swinburne 2018, Section 1). The\nPersons of the Trinity are three beings, each a self which satisfies\nBoethius’s definition of a “person” as “an\nindividual substance (substantia) of a rational nature”\n(421). Each is divine in that each has all the divine attributes.\n“A divine person is naturally understood as one who is\nessentially eternally omnipotent and exists (in some sense)\n’necessarily’” (427). He argues that omnipotence\nentails perfect goodness and omniscience. While all three of the\nPersons exist necessarily (inevitably), the Father does this\nindependently while the Son and Spirit exist of necessity dependently,\nbecause necessarily, the Father exists, and his existence implies that\nhe causes them (437, n. 14). These actions of the Father are\ninevitable and not voluntary, but they are via the Father’s will\n(425, 428). This causing is traditionally described as the eternal\ngeneration of the Son by the Father, and the eternal proceeding of the\nSpirit from the Father, or from the Father and the Son. For Swinburne,\nthe Son is “caused by the Father alone” while the Spirit\nis “caused by the Father and/or through the Son” (429).\nThe theory then is committed to one of these two models of the divine\nprocessions.\n\n\n\n\nSwinburne has constructed a couple versions of an argument which\npurports to show why, if there is at least one divine being or Person,\nthere must be exactly three, with the second and third being caused\nultimately by the first. In other words, given that it is possible\nthat there be a divine Person, it is metaphysically impossible that\nthere be only one, and it is metaphysically necessary that there be\nexactly three. Most trinitarians have assumed that such an argument is\nneither possible nor desirable, as the Trinity can be known only by\ndivine revelation. Against this, Swinburne says that “even if\nyou regard the New Testament as an infallible source of doctrine, you\ncannot derive from it a doctrine of the Trinity”, because when\nit comes to passages about the Spirit,\n\n…there are non-Trinitarian ways of interpreting…[these]\nwhich are just as plausible as interpreting them as expressing the\ndoctrine that the Holy Spirit is a divine person…So unless\nChristians today recognize some good a priori argument for a doctrine\nof the Trinity (and most of them do not recognize such an argument),\nor unless they consider that the fact that the subsequent Church\ntaught a doctrine of the Trinity is a significant reason for\ninterpreting the relevant passages in a Trinitarian way, it seems to\nme that most Christians today (that is, those not acquainted with any\na priori argument for its truth) would not be justified in believing\nthe doctrine. (419–20)\n\n\nOne may wonder if there could be two omnipotent beings; there have\nbeen arguments from theism (at least one god) to monotheism (exactly\none god) based on the idea that it’d be impossible for there to\nbe more than one who is omnipotent. (See the Monotheism entry, section\n 5.)\n Suppose that one omnipotent being willed a certain object to move and\nsimultaneously another omnipotent being willed that it should remain\nin place. It would seem that whether the object moves or stays in\nplace, one of the being’s wills is thwarted, so that, contrary\nto our stipulation, one of them fails to be omnipotent. Swinburne\nargues that such conflicts of will are impossible given the\nomniscience, perfect goodness, and causal relations of the omnipotent\nbeings. In his view, in causing the Son and Spirit, the Father must\n“lay down the rules determining who has the right to do which\nactions; and the other members of the Trinity would recognize his\nright, as the source of their being to lay them down” (428).\n\nInspired by similar arguments given by Richard of St. Victor,\nSwinburne argues that a divine Person must be perfect in love. But\n\n…perfect love must be fully mutual love, reciprocated in kind\nand quantity, involving total sharing, the kind of love involved in a\nperfect marriage; and only a being who could share with him the rule\nof the universe could fully reciprocate the love of another such.\n…it would be a unique best action for the Father to cause the\nexistence of the Son, and so inevitably he would do so. …at\neach moment of everlasting time the Father must always cause the Son\nto exist, and so always keep the Son in being. (429–30)\n\n\nThus, if there is one divine Person, there must also be another.\nFurther, there must be a third, for\n\nA twosome can be selfish. …Perfect love for a\nbeloved…must involve the wish that the beloved should be loved\nby someone else also. Hence it will be a unique best action for the\nFather to cause the existence of a third divine being whom Father and\nSon could love and by whom each could be loved. Hence the Holy Spirit.\nAnd I suggest that it would be best if the Father included the Son as\nco-cause (as he is of all other actions of the Father) in causing the\nSpirit. And again they must have caused the Spirit to exist at each\npast moment of everlasting time. Hence the Trinity must always have\nexisted. (430)\n\n\nWhat stops this process of deity-proliferation from careening into\nfour, seventy-four, or four million divine Persons? Swinburne replies\nthat it is not better to cause four (or more) divine Persons\nthan it is to cause three, since\n\n…when there is an infinite series of incompatible possible good\nactions, each better than the previous one, available to some agent,\nit is not logically possible that he do the best one–because\nthere is no best action. An agent is perfectly good in that situation\nif he does any one of those good actions. So since to bring about only\nthree divine persons would be incompatible with an alternative action\nof bringing about only four divine persons, and so generally, the\nperfect goodness of the Father would be satisfied by his bringing\nabout only two further divine persons. He does not have to bring about\na fourth divine person in order to fulfil his divine nature. To create\na fourth divine person would therefore be an act of will, not an act\nof nature. But then any fourth divine person would not exist\nnecessarily in the sense in which the second and third divine persons\nexist necessarily–his existence would not be a necessary\nconsequence of the existence of a necessary being; and hence he would\nnot be divine. So there cannot be a fourth divine person. There must\nbe and can only be three divine persons. (430–1)\n\n\nIn sum, divinity implies “perfect love”, which implies\nexactly three divine Persons.\n\nLebens and Tuggy (2019) object that such arguments trade on the\nambiguity of “perfect love”. Divinity, by implying moral\nperfection, implies the character trait of being perfectly loving. But\nsomeone may have this and yet not be in the sort of interpersonal\nrelationship that Swinburne describes as “perfect love”.\n(See also Tuggy 2015.) Using familial analogies, Brian Leftow\nchallenges Swinburne’s claim that the three would lack an\noverriding reason to produce a fourth, noting that “Cooperating\nwith two to love yet another is a greater ‘balancing act’\nthan cooperating with one to love yet another” (1999, 241).\n\nTuggy (2004) objects that if a three-self theory like\nSwinburne’s were true, it would seem that one or more members of\nthe Trinity have wrongfully deceived us by leading us to falsely\nbelieve that there is only one divine self. He also argues that the\nNew Testament writings assume that “God” and “the\nFather of Jesus” (in all but a few cases) co-refer, reflecting\nthe assumption that God and the Father are numerically the same. (See\nalso Tuggy 2014, 2019.) Denying this last claim, he argues, amounts to\nan uncharitable and unreasonable attribution of a serious confusion to\nthe New Testament writers and (if they’re to be believed) to\nJesus as well. These arguments are rebutted by William Hasker (2009)\nand the argument is continued in Hasker 2011, Tuggy 2011b, and Tuggy\n2014.\n\nBut as mentioned at the outset, the most common objection to\nSwinburne’s Trinity theory is that it is tritheism and not\nmonotheism. Looking, for instance, at this account of divine\nprocessions, a reader wonders why this doesn’t amount to one god\neternally causing a second god, and with that second god eternally\ncausing a third god. To assuage such concerns, Swinburne argues that\non his model of the Trinity, it is natural to say that there is\n“one God”. Swinburne observes that the Greek\ntheos (and equally the Latin deus) may be used\neither as a name, a singular referring term picking out a certain\nindividual thing, or as a predicate, a descriptive word equivalent in\nmeaning to “divine”, which might in principle be applied\nto more than one thing. Then he observes,\n\nWhile no doubt the Fathers of the [381] Council did not have a clear\nview of what was the sense in which there is just one\n“God” and the sense in which each of the three beings is\n“God” the distinction between the two senses of the\ncrucial words makes available one obvious way of resolving the\napparent contradiction. This is by thinking of these words as having\nthe former sense [i.e. referring to one thing like a name] when the\nCreed says that there is “one God”, and as having the\nlatter sense [i.e. being equivalent the adjective\n“divine”] when it claims that each of the beings “is\nGod.” Thus understood, the Creed is saying that there is one\nunique thing which it names “God,” which consists of three\nbeings. (420)\n\n\nThe suggestion is that the tradition is somewhat confused, but that\ncharitably, we should think its talk of “one God” should\nbe understood as referring to the Trinity. (However, see the opening\nline of the Nicene creed.) What sort of thing is this Trinity? It is\nnot a divine Person, and is not a thing (person or not) with the\ndivine essence. Rather, it is a thing of which the three divine beings\n(selves, persons) are proper parts (425). Despite this complex entity\nnot having the divine essence (and so, not being a god), Swinburne\nsometimes refers to it as “God himself” (424). He argues\nthat these three beings can’t help but cooperate, and so agrees\nwith the traditional claim that apart from the aforementioned eternal\ncausings of one another, any act of one Person of the Trinity is an\nact of all three Persons (425). In sum, “This common\nomnipotence, omniscience, and perfect goodness in the community of\naction makes it that case that in a natural sense there is one\nGod” (428). That is, given the three divine beings described\nabove, it is “natural”, when it comes to the name-like use\nof the word “God,” to apply the term to that thing which\nis the whole consisting of those three Persons. But it remains that\nthere are three things here each of which is divine, and that this\nwhole is not itself divine; it’s hard to see why this is\nmonotheism and not tritheism.\n\nBrian Leftow objects that in Swinburne’s account God is not\nitself divine. Nor does it makes sense to worship it, as it is not the\nsort of thing which can be aware of our addressing it. Further, the\nissue of monotheism isn’t the issue of how unified the divine\nbeings are, but rather of how many there are.\n\n…it is hardly plausible that Greek paganism would have been a\nform of monotheism had Zeus & Co. been more alike, better behaved,\nand linked by the right causal connections. (Leftow 1999, 232; cf. Rea\n2006)\n\n\nMoreover, Swinburne’s theory entails serious inequalities of\npower among the Three, jeopardizes the personhood of each, and carries\nthe serious price of allowing (contrary to most theists) that a divine\nbeing may be created, and the possibility of more than one divine\nbeing (Leftow 1999, 236–40).\n\nDaniel Howard-Snyder (2016) argues that Swinburne is committed to\ndescriptive polytheism, normative polytheism, and cultic polytheism,\nand so is a “polytheist par excellence”. He also\nargues that Swinburne’s account of the Trinity is\nunorthodox.\n\nDaniel Spencer (2019) argues that the several factors which Swinburne\nand others appeal to in order to lend some sort of unity to the three\npersons are obviously inadequate to show how they amount to one God\nand not three gods. At most, we get three divine beings who in some\nways resemble a god. Spencer observes that sometimes Swinburne simply\naccepts tritheism, as when he says that there are three divine\nindividuals or beings (Spencer 2019, 192, 198 n. 2; Swinburne 1994,\n170, 179). In his first treatment of the subject Swinburne talks of\n“three Gods” (Swinburne 1988, 234). In later writings he\ndoesn’t use that phrase, but his conception of the Persons is\nsubstantially the same. Spencer observes that in principle, making the\nPersons proper parts of a whole which is the only God might do the\ntrick (195–6), and Swinburne does suggest that there is a\npart-whole relationship between the Persons and God; however, for\nSwinburne the whole is not a god.\n\nPerhaps the most sympathetic voice in the literature is William Hasker\n(2013, Chapter 18), but in the end he agrees that Swinburne has not\ndone enough to unify the Persons. (Hasker 2013b, Chapters 25–8,\n2018, 5–7; Swinburne 2014)\n",
    "section_title": "2.3 Ersatz Monotheism",
    "entry_title": "Trinity",
    "hierarchy_title": "Trinity || Three-self Theories || Ersatz Monotheism",
    "tokenized_text": [
        "threeself",
        "theory",
        "ersatz",
        "monotheism",
        "ersatz",
        "monotheism",
        "problem",
        "threeself",
        "trinity",
        "theory",
        "numerically",
        "three",
        "self",
        "would",
        "seem",
        "numerically",
        "three",
        "thing",
        "according",
        "theory",
        "essence",
        "nature",
        "thing",
        "instance",
        "essence",
        "nature",
        "thereby",
        "thing",
        "certain",
        "kind",
        "trinity",
        "theory",
        "include",
        "nicene",
        "claim",
        "person",
        "trinity",
        "one",
        "essence",
        "nature",
        "divine",
        "one",
        "would",
        "seem",
        "definition",
        "thing",
        "divine",
        "essence",
        "god",
        "three",
        "thing",
        "would",
        "three",
        "god",
        "threeself",
        "theory",
        "effect",
        "concede",
        "imply",
        "tritheism",
        "three",
        "thing",
        "property",
        "sufficient",
        "god",
        "argue",
        "surely",
        "correct",
        "trinity",
        "theory",
        "avoid",
        "right",
        "type",
        "tritheism",
        "avoid",
        "undesirable",
        "tritheism",
        "one",
        "involving",
        "unequal",
        "divinity",
        "person",
        "person",
        "sense",
        "independent",
        "person",
        "principle",
        "separable",
        "mccall",
        "c",
        "plantinga",
        "yandell",
        "richard",
        "swinburne",
        "long",
        "developed",
        "defended",
        "type",
        "threeself",
        "trinity",
        "theory",
        "eye",
        "critic",
        "seems",
        "fairly",
        "straightforward",
        "form",
        "tritheism",
        "alston",
        "see",
        "also",
        "clark",
        "davidson",
        "feser",
        "howardsnyder",
        "a",
        "moreland",
        "craig",
        "rea",
        "van",
        "inwagen",
        "howardsnyder",
        "van",
        "inwagen",
        "vohánka",
        "series",
        "article",
        "book",
        "swinburne",
        "view",
        "changed",
        "significant",
        "way",
        "swinburne",
        "entry",
        "focus",
        "latest",
        "work",
        "trinity",
        "swinburne",
        "aim",
        "build",
        "theory",
        "widespread",
        "traditional",
        "agreement",
        "catholic",
        "theologian",
        "since",
        "least",
        "fourth",
        "fifth",
        "century",
        "swinburne",
        "section",
        "person",
        "trinity",
        "three",
        "being",
        "self",
        "satisfies",
        "boethius",
        "definition",
        "person",
        "individual",
        "substance",
        "substantia",
        "rational",
        "nature",
        "divine",
        "divine",
        "attribute",
        "divine",
        "person",
        "naturally",
        "understood",
        "one",
        "essentially",
        "eternally",
        "omnipotent",
        "exists",
        "sense",
        "necessarily",
        "argues",
        "omnipotence",
        "entail",
        "perfect",
        "goodness",
        "omniscience",
        "three",
        "person",
        "exist",
        "necessarily",
        "inevitably",
        "father",
        "independently",
        "son",
        "spirit",
        "exist",
        "necessity",
        "dependently",
        "necessarily",
        "father",
        "exists",
        "existence",
        "implies",
        "cause",
        "n",
        "action",
        "father",
        "inevitable",
        "voluntary",
        "via",
        "father",
        "causing",
        "traditionally",
        "described",
        "eternal",
        "generation",
        "son",
        "father",
        "eternal",
        "proceeding",
        "spirit",
        "father",
        "father",
        "son",
        "swinburne",
        "son",
        "caused",
        "father",
        "alone",
        "spirit",
        "caused",
        "father",
        "andor",
        "son",
        "theory",
        "committed",
        "one",
        "two",
        "model",
        "divine",
        "procession",
        "swinburne",
        "constructed",
        "couple",
        "version",
        "argument",
        "purport",
        "show",
        "least",
        "one",
        "divine",
        "person",
        "must",
        "exactly",
        "three",
        "second",
        "third",
        "caused",
        "ultimately",
        "first",
        "word",
        "given",
        "possible",
        "divine",
        "person",
        "metaphysically",
        "impossible",
        "one",
        "metaphysically",
        "necessary",
        "exactly",
        "three",
        "trinitarian",
        "assumed",
        "argument",
        "neither",
        "possible",
        "desirable",
        "trinity",
        "known",
        "divine",
        "revelation",
        "swinburne",
        "say",
        "even",
        "regard",
        "new",
        "testament",
        "infallible",
        "source",
        "doctrine",
        "derive",
        "doctrine",
        "trinity",
        "come",
        "passage",
        "spirit",
        "there",
        "nontrinitarian",
        "way",
        "interpreting",
        "plausible",
        "interpreting",
        "expressing",
        "doctrine",
        "holy",
        "spirit",
        "divine",
        "personso",
        "unless",
        "christian",
        "today",
        "recognize",
        "good",
        "priori",
        "argument",
        "doctrine",
        "trinity",
        "recognize",
        "argument",
        "unless",
        "consider",
        "fact",
        "subsequent",
        "church",
        "taught",
        "doctrine",
        "trinity",
        "significant",
        "reason",
        "interpreting",
        "relevant",
        "passage",
        "trinitarian",
        "way",
        "seems",
        "christian",
        "today",
        "acquainted",
        "priori",
        "argument",
        "truth",
        "would",
        "justified",
        "believing",
        "doctrine",
        "one",
        "may",
        "wonder",
        "could",
        "two",
        "omnipotent",
        "being",
        "argument",
        "theism",
        "least",
        "one",
        "god",
        "monotheism",
        "exactly",
        "one",
        "god",
        "based",
        "idea",
        "impossible",
        "one",
        "omnipotent",
        "see",
        "monotheism",
        "entry",
        "section",
        "suppose",
        "one",
        "omnipotent",
        "willed",
        "certain",
        "object",
        "move",
        "simultaneously",
        "another",
        "omnipotent",
        "willed",
        "remain",
        "place",
        "would",
        "seem",
        "whether",
        "object",
        "move",
        "stay",
        "place",
        "one",
        "will",
        "thwarted",
        "contrary",
        "stipulation",
        "one",
        "fails",
        "omnipotent",
        "swinburne",
        "argues",
        "conflict",
        "impossible",
        "given",
        "omniscience",
        "perfect",
        "goodness",
        "causal",
        "relation",
        "omnipotent",
        "being",
        "view",
        "causing",
        "son",
        "spirit",
        "father",
        "must",
        "lay",
        "rule",
        "determining",
        "right",
        "action",
        "member",
        "trinity",
        "would",
        "recognize",
        "right",
        "source",
        "lay",
        "inspired",
        "similar",
        "argument",
        "given",
        "richard",
        "st",
        "victor",
        "swinburne",
        "argues",
        "divine",
        "person",
        "must",
        "perfect",
        "love",
        "perfect",
        "love",
        "must",
        "fully",
        "mutual",
        "love",
        "reciprocated",
        "kind",
        "quantity",
        "involving",
        "total",
        "sharing",
        "kind",
        "love",
        "involved",
        "perfect",
        "marriage",
        "could",
        "share",
        "rule",
        "universe",
        "could",
        "fully",
        "reciprocate",
        "love",
        "another",
        "it",
        "would",
        "unique",
        "best",
        "action",
        "father",
        "cause",
        "existence",
        "son",
        "inevitably",
        "would",
        "at",
        "moment",
        "everlasting",
        "time",
        "father",
        "must",
        "always",
        "cause",
        "son",
        "exist",
        "always",
        "keep",
        "son",
        "thus",
        "one",
        "divine",
        "person",
        "must",
        "also",
        "another",
        "must",
        "third",
        "twosome",
        "selfish",
        "perfect",
        "love",
        "belovedmust",
        "involve",
        "wish",
        "beloved",
        "loved",
        "someone",
        "else",
        "also",
        "hence",
        "unique",
        "best",
        "action",
        "father",
        "cause",
        "existence",
        "third",
        "divine",
        "father",
        "son",
        "could",
        "love",
        "could",
        "loved",
        "hence",
        "holy",
        "spirit",
        "suggest",
        "would",
        "best",
        "father",
        "included",
        "son",
        "cocause",
        "action",
        "father",
        "causing",
        "spirit",
        "must",
        "caused",
        "spirit",
        "exist",
        "past",
        "moment",
        "everlasting",
        "time",
        "hence",
        "trinity",
        "must",
        "always",
        "existed",
        "stop",
        "process",
        "deityproliferation",
        "careening",
        "four",
        "seventyfour",
        "four",
        "million",
        "divine",
        "person",
        "swinburne",
        "reply",
        "better",
        "cause",
        "four",
        "divine",
        "person",
        "cause",
        "three",
        "since",
        "when",
        "infinite",
        "series",
        "incompatible",
        "possible",
        "good",
        "action",
        "better",
        "previous",
        "one",
        "available",
        "agent",
        "logically",
        "possible",
        "best",
        "onebecause",
        "best",
        "action",
        "agent",
        "perfectly",
        "good",
        "situation",
        "one",
        "good",
        "action",
        "since",
        "bring",
        "three",
        "divine",
        "person",
        "would",
        "incompatible",
        "alternative",
        "action",
        "bringing",
        "four",
        "divine",
        "person",
        "generally",
        "perfect",
        "goodness",
        "father",
        "would",
        "satisfied",
        "bringing",
        "two",
        "divine",
        "person",
        "bring",
        "fourth",
        "divine",
        "person",
        "order",
        "fulfil",
        "divine",
        "nature",
        "create",
        "fourth",
        "divine",
        "person",
        "would",
        "therefore",
        "act",
        "act",
        "nature",
        "fourth",
        "divine",
        "person",
        "would",
        "exist",
        "necessarily",
        "sense",
        "second",
        "third",
        "divine",
        "person",
        "exist",
        "necessarilyhis",
        "existence",
        "would",
        "necessary",
        "consequence",
        "existence",
        "necessary",
        "hence",
        "would",
        "divine",
        "fourth",
        "divine",
        "person",
        "must",
        "three",
        "divine",
        "person",
        "sum",
        "divinity",
        "implies",
        "perfect",
        "love",
        "implies",
        "exactly",
        "three",
        "divine",
        "person",
        "lebens",
        "tuggy",
        "object",
        "argument",
        "trade",
        "ambiguity",
        "perfect",
        "love",
        "divinity",
        "implying",
        "moral",
        "perfection",
        "implies",
        "character",
        "trait",
        "perfectly",
        "loving",
        "someone",
        "may",
        "yet",
        "sort",
        "interpersonal",
        "relationship",
        "swinburne",
        "describes",
        "perfect",
        "love",
        "see",
        "also",
        "tuggy",
        "using",
        "familial",
        "analogy",
        "brian",
        "leftow",
        "challenge",
        "swinburne",
        "claim",
        "three",
        "would",
        "lack",
        "overriding",
        "reason",
        "produce",
        "fourth",
        "noting",
        "cooperating",
        "two",
        "love",
        "yet",
        "another",
        "greater",
        "balancing",
        "act",
        "cooperating",
        "one",
        "love",
        "yet",
        "another",
        "tuggy",
        "object",
        "threeself",
        "theory",
        "like",
        "swinburne",
        "true",
        "would",
        "seem",
        "one",
        "member",
        "trinity",
        "wrongfully",
        "deceived",
        "u",
        "leading",
        "u",
        "falsely",
        "believe",
        "one",
        "divine",
        "self",
        "also",
        "argues",
        "new",
        "testament",
        "writing",
        "assume",
        "god",
        "father",
        "jesus",
        "case",
        "corefer",
        "reflecting",
        "assumption",
        "god",
        "father",
        "numerically",
        "see",
        "also",
        "tuggy",
        "denying",
        "last",
        "claim",
        "argues",
        "amount",
        "uncharitable",
        "unreasonable",
        "attribution",
        "serious",
        "confusion",
        "new",
        "testament",
        "writer",
        "believed",
        "jesus",
        "well",
        "argument",
        "rebutted",
        "william",
        "hasker",
        "argument",
        "continued",
        "hasker",
        "tuggy",
        "b",
        "tuggy",
        "mentioned",
        "outset",
        "common",
        "objection",
        "swinburne",
        "trinity",
        "theory",
        "tritheism",
        "monotheism",
        "looking",
        "instance",
        "account",
        "divine",
        "procession",
        "reader",
        "wonder",
        "amount",
        "one",
        "god",
        "eternally",
        "causing",
        "second",
        "god",
        "second",
        "god",
        "eternally",
        "causing",
        "third",
        "god",
        "assuage",
        "concern",
        "swinburne",
        "argues",
        "model",
        "trinity",
        "natural",
        "say",
        "one",
        "god",
        "swinburne",
        "observes",
        "greek",
        "theos",
        "equally",
        "latin",
        "deus",
        "may",
        "used",
        "either",
        "name",
        "singular",
        "referring",
        "term",
        "picking",
        "certain",
        "individual",
        "thing",
        "predicate",
        "descriptive",
        "word",
        "equivalent",
        "meaning",
        "divine",
        "might",
        "principle",
        "applied",
        "one",
        "thing",
        "observes",
        "doubt",
        "father",
        "council",
        "clear",
        "view",
        "sense",
        "one",
        "god",
        "sense",
        "three",
        "being",
        "god",
        "distinction",
        "two",
        "sens",
        "crucial",
        "word",
        "make",
        "available",
        "one",
        "obvious",
        "way",
        "resolving",
        "apparent",
        "contradiction",
        "thinking",
        "word",
        "former",
        "sense",
        "ie",
        "referring",
        "one",
        "thing",
        "like",
        "name",
        "creed",
        "say",
        "one",
        "god",
        "latter",
        "sense",
        "ie",
        "equivalent",
        "adjective",
        "divine",
        "claim",
        "being",
        "god",
        "thus",
        "understood",
        "creed",
        "saying",
        "one",
        "unique",
        "thing",
        "name",
        "god",
        "consists",
        "three",
        "being",
        "suggestion",
        "tradition",
        "somewhat",
        "confused",
        "charitably",
        "think",
        "talk",
        "one",
        "god",
        "understood",
        "referring",
        "trinity",
        "however",
        "see",
        "opening",
        "line",
        "nicene",
        "creed",
        "sort",
        "thing",
        "trinity",
        "divine",
        "person",
        "thing",
        "person",
        "divine",
        "essence",
        "rather",
        "thing",
        "three",
        "divine",
        "being",
        "self",
        "person",
        "proper",
        "part",
        "despite",
        "complex",
        "entity",
        "divine",
        "essence",
        "god",
        "swinburne",
        "sometimes",
        "refers",
        "god",
        "argues",
        "three",
        "being",
        "help",
        "cooperate",
        "agrees",
        "traditional",
        "claim",
        "apart",
        "aforementioned",
        "eternal",
        "causing",
        "one",
        "another",
        "act",
        "one",
        "person",
        "trinity",
        "act",
        "three",
        "person",
        "sum",
        "common",
        "omnipotence",
        "omniscience",
        "perfect",
        "goodness",
        "community",
        "action",
        "make",
        "case",
        "natural",
        "sense",
        "one",
        "god",
        "given",
        "three",
        "divine",
        "being",
        "described",
        "natural",
        "come",
        "namelike",
        "use",
        "word",
        "god",
        "apply",
        "term",
        "thing",
        "whole",
        "consisting",
        "three",
        "person",
        "remains",
        "three",
        "thing",
        "divine",
        "whole",
        "divine",
        "hard",
        "see",
        "monotheism",
        "tritheism",
        "brian",
        "leftow",
        "object",
        "swinburne",
        "account",
        "god",
        "divine",
        "make",
        "sense",
        "worship",
        "sort",
        "thing",
        "aware",
        "addressing",
        "issue",
        "monotheism",
        "issue",
        "unified",
        "divine",
        "being",
        "rather",
        "many",
        "it",
        "hardly",
        "plausible",
        "greek",
        "paganism",
        "would",
        "form",
        "monotheism",
        "zeus",
        "co",
        "alike",
        "better",
        "behaved",
        "linked",
        "right",
        "causal",
        "connection",
        "leftow",
        "cf",
        "rea",
        "moreover",
        "swinburne",
        "theory",
        "entail",
        "serious",
        "inequality",
        "power",
        "among",
        "three",
        "jeopardizes",
        "personhood",
        "carry",
        "serious",
        "price",
        "allowing",
        "contrary",
        "theist",
        "divine",
        "may",
        "created",
        "possibility",
        "one",
        "divine",
        "leftow",
        "daniel",
        "howardsnyder",
        "argues",
        "swinburne",
        "committed",
        "descriptive",
        "polytheism",
        "normative",
        "polytheism",
        "cultic",
        "polytheism",
        "polytheist",
        "par",
        "excellence",
        "also",
        "argues",
        "swinburne",
        "account",
        "trinity",
        "unorthodox",
        "daniel",
        "spencer",
        "argues",
        "several",
        "factor",
        "swinburne",
        "others",
        "appeal",
        "order",
        "lend",
        "sort",
        "unity",
        "three",
        "person",
        "obviously",
        "inadequate",
        "show",
        "amount",
        "one",
        "god",
        "three",
        "god",
        "get",
        "three",
        "divine",
        "being",
        "way",
        "resemble",
        "god",
        "spencer",
        "observes",
        "sometimes",
        "swinburne",
        "simply",
        "accepts",
        "tritheism",
        "say",
        "three",
        "divine",
        "individual",
        "being",
        "spencer",
        "n",
        "swinburne",
        "first",
        "treatment",
        "subject",
        "swinburne",
        "talk",
        "three",
        "god",
        "swinburne",
        "later",
        "writing",
        "use",
        "phrase",
        "conception",
        "person",
        "substantially",
        "spencer",
        "observes",
        "principle",
        "making",
        "person",
        "proper",
        "part",
        "whole",
        "god",
        "might",
        "trick",
        "swinburne",
        "suggest",
        "partwhole",
        "relationship",
        "person",
        "god",
        "however",
        "swinburne",
        "whole",
        "god",
        "perhaps",
        "sympathetic",
        "voice",
        "literature",
        "william",
        "hasker",
        "chapter",
        "end",
        "agrees",
        "swinburne",
        "done",
        "enough",
        "unify",
        "person",
        "hasker",
        "b",
        "chapter",
        "swinburne"
    ]
}