{
    "main_text": "Tropes as Building Blocks || Tropes and Concrete Particulars\n3.2 Tropes and Concrete Particulars\n\nThe second constructive task facing the trope theorist is that of\nbuilding something that behaves like a concrete particular, using only\ntropes. Exactly how a concrete particular behaves is of course a\nmatter that can be debated. This is not a debate to which the trope\ntheorist has had very much—or at least not anything very\noriginal—to contribute. Instead, the trope theoretical\ndiscussion has been focused on an issue that needs solving\nbefore questions concerning what a concrete particular can or\ncannot do more precisely become relevant: the issue of if and\nhow tropes make up concrete particulars in the first\nplace.\n\nWhether this issue is best approached by considering if and how tropes\ncan make up or ground the existence of what me might call\n‘ordinary’ or ‘everyday’ objects, or if it is\nbetter to concentrate instead on the world’s simplest, most\nfundamental, objects—like those you find discussed in e.g.,\nfundamental physics—is another issue on which trope theorists\ndisagree. Campbell thinks we should concentrate on the latter sort of\nobject. In particular, he thinks we should concentrate on objects that\nhave no other objects as parts, as that way we avoid confusing\n‘substantial’ complexity (and unity) with the—here\nrelevant—qualitative one. David Robb (2005) and Kris McDaniel\n(2001) disagree. This may in part be due to the fact that they both\n(cf. also Paul 2002, 2017) think that objects are\nmereologically composed both on the level of their\nsubstantial parts and on the level of their\n qualitative—trope—parts.[27]\n\nAccording to a majority of the trope theorists, objects are bundles of\ntropes. The alternative is to understand objects as complexes\nconsisting of a substrate in which tropes are instantiated (a view\ndefended by e.g., Martin 1980; Heil 2003; and Lowe 2006). Indeed,\naccording to D. M. Armstrong (1989, 2004)—a staunch but\ncomparatively speaking rather friendly trope-critic—this\nminority view ought to be accepted by the trope theorist.\nArmstrong is most likely wrong, however: several reasons exist for why\none ought to prefer the bundle view (Maurin 2016). One such reason has\nto do with parsimony. If you adopt a substrate-attribute view, you\naccept the existence of substrates on top of the existence of tropes.\nAccepting this additional category of entity makes at least some sense\nif properties are universals. For if objects are bundles of universals\nand universals are entities which are numerically identical across\ninstances, then if object a is qualitatively identical to\nobject b, a is also numerically identical to\nb. Which means that, if objects are bundles of universals,\nthe Identity of Indiscernibles is not just true, but necessarily true,\na consequence few universal realists have been prepared to accept\n(indeed, a consequence that may turn out to be unacceptable as a\nmatter of empirical fact—cf. e.g., French 1988).\nIf objects are substrates exemplifying universals, on the other hand,\nalthough a and b are qualitatively identical, they\nare nevertheless distinct. They are distinct, that is, in virtue\nof being partly constituted by (primitively) distinct\nsubstrates.\n\nThis sort of argument in favor of the substrate-attribute view cannot\nbe recreated for a view on which properties are tropes, however. For,\nif objects are bundles of tropes, because tropes are particulars\nnot universals, even if a and b are\nqualitatively identical, they are not numerically identical. And they\nare not numerically identical because they are constituted by\nnumerically distinct tropes. No need for substrates!\n\nAccording to the bundle view, objects consist of, are made up by, or\nare grounded in, a sufficient number of mutually compresent\nand/or in some other way mutually dependent tropes (cf. e.g.,\nMcDaniel 2001, 2006 and Giberman 2014 for slightly different takes on\nbundling). What is compresence? When the same question was asked about\n(exact) resemblance, the trope theorist had the option of treating the\nrelation as a ‘pseudo-addition’. This was because\nresemblance is an internal relation and so holds necessarily simply\ngiven the existence of its relata. According to most trope-theorists,\nhowever, compresence is an external relation, and hence a\nreal addition to the tropes it\n relates.[28]\n But then adding compresence gives rise to an infinite regress (often\ncalled ‘Bradley’s regress’ after Bradley 1930 [1893];\ncf. also Armstrong 1978; Vallicella 2002 and 2005; Schnieder\n2004; Cameron 2008, 2022; Maurin 2012).\n\nUnlike what was true in the case of resemblance, this regress is most\nlikely a vicious regress. This is because the ‘pattern of\ndependence’ it instantiates is the opposite of that instantiated\nby the resemblance regress. In the resemblance case, for tropes\nt1, t2, and\nt3 to exactly resemble each other, it is enough\nthat they exist. Not so in the compresence case. Tropes\nt1, t2, and\nt3 could exist and not be compresent, which means\nthat in order to ensure that they are compresent, a\ncompresence-trope, c1, must be added to the\nbundle. But c1 could exist without being\ncompresent with those very tropes. Therefore, in order for\nt1, t2, t3\nand c1 to be compresent, there must be\nsomething—call it c2—that makes them\nso. But since c2 could exist and not be compresent\nwith t1, t2,\nt3 and c1, it too needs\nsomething that ensures its compresence with those entities. Enter\nc3. And so on. The existence of this regress\narguably contradicts—and hence functions as a reductio\nagainst—the compresence of the original (first-order) tropes\nand, thereby, the (possible) existence of the concrete particular.\n\nSince concrete particulars (possibly) exist, something must be wrong\nwith this argument. One option is to claim that compresence is\ninternal after all, in which case the regress (if there even is one)\nis benign (Molnar 2003; Heil 2003 and 2012; cf. also\nArmstrong 2006). This may seem attractive especially to those who\nthink of their tropes as non-transferable and as ways\nthings are. Even given this way of thinking of the nature of the\ntrope, however, to take compresence as internal means having to give\nup what are arguably some deeply held modal beliefs. For even if you\nhave reason to think that properties must be ‘borne’ by\nsome object, to be able to solve the regress-problem one would have to\naccept the much stronger thesis that every trope must be borne by a\nspecific object. If the only reason we have for\nthinking that compresence is internal in this sense is that this\nsolves the problem with Bradley’s regress, therefore, we should\nopt to go down this route as a last resort only (cf. Cameron\n2006; Maurin 2010).\n\nAs a way of saving at least some of our modal intuitions while still\navoiding Bradley’s regress, Simons (1994; cf. also\nKeinänen 2011 and Keinänen and Hakkarainen 2014 for a\nslightly different version of this\n view[29])\n suggests we view the concrete particular as constituted partly by a\n‘nucleus’ (made up from mutually and specifically\ndependent tropes) and partly—at least in the normal\ncase—by a ‘halo’ (made up from tropes that depend\nspecifically on the tropes in the nucleus). The result is a structured\nbundle such that, although the tropes in the nucleus at most depend\nfor their existence on the existence of tropes of the same\nkind as those now in its halo, they do not depend specifically on\nthose tropes. In this way, at least some room is made for contingency,\nyet Bradley’s regress is avoided. For, as the tropes in the halo\ndepend specifically for their existence on the tropes that make up the\nnucleus, their existence is enough to guarantee the existence of the\nwhole to which they belong. This is better but perhaps not good\nenough. For, although the same object could now have had a slightly\ndifferent halo, the possibility that the tropes that actually make up\nthe halo could exist and not be joined to this particular\nnucleus is ruled out with no apparent justification (other than that\nthis helps its proponent solve the problem with the Bradley regress)\n(cf. also Garcia 2014 for more kinds of criticism of this\nview).\n\nAccording to several between themselves very different sorts of trope\ntheorists, finally, we should stop bothering with the (nature and\ndependence of the) related tropes and investigate instead the\n(special) nature of compresence itself. This seems intuitive enough.\nAfter all, is it not the business of a relation to relate? According\nto one suggestion along these lines (defended in Simons 2010; Maurin\n2002, 2010 and 2011; and Wieland and Betti 2008; cf. also\nMertz 1996, Robb 2005 and Giberman 2014 for similar views),\nnon-relational tropes have an existence that is independent of the\nexistence of some specific—either non-relational or\nrelational—trope, but relational tropes (including compresence)\ndepend specifically for their existence on the very tropes they\nrelate. This means that if c1 exists, it\nmust relate the tropes it in fact relates, even though those\ntropes might very well exist and not be compresent (at least not with\neach other). There is, then, no regress, and except for\nc1, the tropes involved in constituting the\nconcrete particular could exist without being compresent with each\nother. And this, in turn, means that our modal intuitions are left\nmore or less\n intact.[30]\n\nAccording to Mertz, moreover, to be able to do the unifying work for\nwhich it is introduced, compresence cannot be a universal. If it were,\nthen if one of the concrete particulars whose constituents it joins\nceases to exist, so will every other concrete particular unified by\nthe same (universal) relation of compresence. But, as Mertz points\nout, “this is absurdly counterfactual!” (Mertz 1996: 190).\nNor can it be a state of affairs. For, states of affairs are in\nthemselves complexes, and so could not be used to solve the Bradley\n problem.[31]\n It seems, then, that compresence, if understood in a way that\nblocks the regress, is a trope. Assuming that Bradley’s regress\nthreatens any account according to which many things make up\none unified thing (i.e., assuming that it does not only threaten the\ntrope-bundle theorist), that there is this threat may therefore turn\nout to be a reason in favor of positing tropes (Maurin\n2011).\n\nThe suggestion is not without its critics. To these belong MacBride\nwho argues that, “…to call a trope relational is to pack\ninto its essence the relating function it is supposed to perform\nwithout explaining what Bradley’s regress calls into question,\nviz. the capacity of relations to relate” (2011: 173). Rather\nthan solve the problem, in other words, MacBride thinks the suggestion\n“transfers our original puzzlement to that thing [i.e., the\ncompresence-relation]”. For, he asks “how can positing the\nexistence of a relational trope explain anything about its capacity to\nrelate when it has been stipulated to be the very essence of R that it\nrelates a and b. It is as though the capacity of\nrelational tropes to relate is explained by mentioning the fact that\nthey have a ‘virtus relativa’”(ibid.).\n\nAssuming we agree that there is something that needs\nexplaining (i.e., assuming we agree that how several tropes\ncan—contingently—make up one object needs explaining), we\ncan either reject a proposed solution because we prefer what we think\nis a better solution, or we can reject it because it is in\nitself bad or unacceptable (irrespective of whether there are any\nalternative solutions on offer). MacBride appears to suggest we do the\nlatter. More precisely, what MacBride proposes is that the solution\nfails because it leaves unexplained the special ‘power’ to\nrelate it attributes to the compresence trope. If this is why the\nsuggestion fails, however, then either this is because no\nexplanation that posits something (‘primitively’) apt to\nperform whatever function we need explained, is acceptable, or it is\nbecause in this particular case, an explanation of this kind\nwill not do. If the former, the objection risks leading to an\novergeneration of explanatory failures. Everyone will at some point\nneed to posit some things as fundamental. And in order for those\nfundamental posits to be able to contribute somehow to the theory in\nquestion, it seems we must be allowed to say something about them. We\nmust, to use the terminology introduced by Schaffer, outfit our\nfundamental posits with axioms. But then, as Schaffer also points out\n(2016: 587): “it is a bad question—albeit one that has\ntempted excellent philosophers from Bradley through van Fraassen and\nLewis—to ask how a posit can do what its axioms say, for that\nwork is simply the business of the posit. End of story”.\n\nIf, on the other hand, the problem is isolated to the case at hand, we\nare owed an explanation of what makes this case so special. MacBride\ncomplains that if the ‘explanatory task’ is that of\naccounting for the capacity of compresence to relate, being told that\ncompresence has that capacity ‘by nature’, will not do.\nPerhaps he is right about this. But, then, the explanatory task is\narguably not that one, but rather the task of accounting for the\npossible existence of concrete objects (contingently) made up from\ntropes. If this is the explanatory task, it is far from clear\nwhy positing a special kind of (relational) trope that is ‘by\nnature’ apt to perform its relating function, will not do as an\nexplanation.\n",
    "section_title": "3.2 Tropes and Concrete Particulars",
    "entry_title": "Tropes",
    "hierarchy_title": "Tropes || Tropes as Building Blocks || Tropes and Concrete Particulars",
    "tokenized_text": [
        "trope",
        "building",
        "block",
        "trope",
        "concrete",
        "particular",
        "trope",
        "concrete",
        "particular",
        "second",
        "constructive",
        "task",
        "facing",
        "trope",
        "theorist",
        "building",
        "something",
        "behaves",
        "like",
        "concrete",
        "particular",
        "using",
        "trope",
        "exactly",
        "concrete",
        "particular",
        "behaves",
        "course",
        "matter",
        "debated",
        "debate",
        "trope",
        "theorist",
        "muchor",
        "least",
        "anything",
        "originalto",
        "contribute",
        "instead",
        "trope",
        "theoretical",
        "discussion",
        "focused",
        "issue",
        "need",
        "solving",
        "question",
        "concerning",
        "concrete",
        "particular",
        "precisely",
        "become",
        "relevant",
        "issue",
        "trope",
        "make",
        "concrete",
        "particular",
        "first",
        "place",
        "whether",
        "issue",
        "best",
        "approached",
        "considering",
        "trope",
        "make",
        "ground",
        "existence",
        "might",
        "call",
        "ordinary",
        "everyday",
        "object",
        "better",
        "concentrate",
        "instead",
        "world",
        "simplest",
        "fundamental",
        "objectslike",
        "find",
        "discussed",
        "eg",
        "fundamental",
        "physicsis",
        "another",
        "issue",
        "trope",
        "theorist",
        "disagree",
        "campbell",
        "think",
        "concentrate",
        "latter",
        "sort",
        "object",
        "particular",
        "think",
        "concentrate",
        "object",
        "object",
        "part",
        "way",
        "avoid",
        "confusing",
        "substantial",
        "complexity",
        "unity",
        "thehere",
        "relevantqualitative",
        "one",
        "david",
        "robb",
        "kris",
        "mcdaniel",
        "disagree",
        "may",
        "part",
        "due",
        "fact",
        "cf",
        "also",
        "paul",
        "think",
        "object",
        "mereologically",
        "composed",
        "level",
        "substantial",
        "part",
        "level",
        "qualitativetropeparts",
        "according",
        "majority",
        "trope",
        "theorist",
        "object",
        "bundle",
        "trope",
        "alternative",
        "understand",
        "object",
        "complex",
        "consisting",
        "substrate",
        "trope",
        "instantiated",
        "view",
        "defended",
        "eg",
        "martin",
        "heil",
        "lowe",
        "indeed",
        "according",
        "d",
        "m",
        "armstrong",
        "a",
        "staunch",
        "comparatively",
        "speaking",
        "rather",
        "friendly",
        "tropecriticthis",
        "minority",
        "view",
        "ought",
        "accepted",
        "trope",
        "theorist",
        "armstrong",
        "likely",
        "wrong",
        "however",
        "several",
        "reason",
        "exist",
        "one",
        "ought",
        "prefer",
        "bundle",
        "view",
        "maurin",
        "one",
        "reason",
        "parsimony",
        "adopt",
        "substrateattribute",
        "view",
        "accept",
        "existence",
        "substrate",
        "top",
        "existence",
        "trope",
        "accepting",
        "additional",
        "category",
        "entity",
        "make",
        "least",
        "sense",
        "property",
        "universal",
        "object",
        "bundle",
        "universal",
        "universal",
        "entity",
        "numerically",
        "identical",
        "across",
        "instance",
        "object",
        "qualitatively",
        "identical",
        "object",
        "b",
        "also",
        "numerically",
        "identical",
        "b",
        "mean",
        "object",
        "bundle",
        "universal",
        "identity",
        "indiscernibles",
        "true",
        "necessarily",
        "true",
        "consequence",
        "universal",
        "realist",
        "prepared",
        "accept",
        "indeed",
        "consequence",
        "may",
        "turn",
        "unacceptable",
        "matter",
        "empirical",
        "factcf",
        "eg",
        "french",
        "object",
        "substrate",
        "exemplifying",
        "universal",
        "hand",
        "although",
        "b",
        "qualitatively",
        "identical",
        "nevertheless",
        "distinct",
        "distinct",
        "virtue",
        "partly",
        "constituted",
        "primitively",
        "distinct",
        "substrate",
        "sort",
        "argument",
        "favor",
        "substrateattribute",
        "view",
        "recreated",
        "view",
        "property",
        "trope",
        "however",
        "object",
        "bundle",
        "trope",
        "trope",
        "particular",
        "universal",
        "even",
        "b",
        "qualitatively",
        "identical",
        "numerically",
        "identical",
        "numerically",
        "identical",
        "constituted",
        "numerically",
        "distinct",
        "trope",
        "need",
        "substrate",
        "according",
        "bundle",
        "view",
        "object",
        "consist",
        "made",
        "grounded",
        "sufficient",
        "number",
        "mutually",
        "compresent",
        "andor",
        "way",
        "mutually",
        "dependent",
        "trope",
        "cf",
        "eg",
        "mcdaniel",
        "giberman",
        "slightly",
        "different",
        "take",
        "bundling",
        "compresence",
        "question",
        "asked",
        "exact",
        "resemblance",
        "trope",
        "theorist",
        "option",
        "treating",
        "relation",
        "pseudoaddition",
        "resemblance",
        "internal",
        "relation",
        "hold",
        "necessarily",
        "simply",
        "given",
        "existence",
        "relatum",
        "according",
        "tropetheorists",
        "however",
        "compresence",
        "external",
        "relation",
        "hence",
        "real",
        "addition",
        "trope",
        "relates",
        "adding",
        "compresence",
        "give",
        "rise",
        "infinite",
        "regress",
        "often",
        "called",
        "bradley",
        "regress",
        "bradley",
        "cf",
        "also",
        "armstrong",
        "vallicella",
        "schnieder",
        "cameron",
        "maurin",
        "unlike",
        "true",
        "case",
        "resemblance",
        "regress",
        "likely",
        "vicious",
        "regress",
        "pattern",
        "dependence",
        "instantiates",
        "opposite",
        "instantiated",
        "resemblance",
        "regress",
        "resemblance",
        "case",
        "trope",
        "t",
        "t",
        "t",
        "exactly",
        "resemble",
        "enough",
        "exist",
        "compresence",
        "case",
        "trope",
        "t",
        "t",
        "t",
        "could",
        "exist",
        "compresent",
        "mean",
        "order",
        "ensure",
        "compresent",
        "compresencetrope",
        "c",
        "must",
        "added",
        "bundle",
        "c",
        "could",
        "exist",
        "without",
        "compresent",
        "trope",
        "therefore",
        "order",
        "t",
        "t",
        "t",
        "c",
        "compresent",
        "must",
        "somethingcall",
        "cthat",
        "make",
        "since",
        "c",
        "could",
        "exist",
        "compresent",
        "t",
        "t",
        "t",
        "c",
        "need",
        "something",
        "ensures",
        "compresence",
        "entity",
        "enter",
        "c",
        "existence",
        "regress",
        "arguably",
        "contradictsand",
        "hence",
        "function",
        "reductio",
        "againstthe",
        "compresence",
        "original",
        "firstorder",
        "trope",
        "thereby",
        "possible",
        "existence",
        "concrete",
        "particular",
        "since",
        "concrete",
        "particular",
        "possibly",
        "exist",
        "something",
        "must",
        "wrong",
        "argument",
        "one",
        "option",
        "claim",
        "compresence",
        "internal",
        "case",
        "regress",
        "even",
        "one",
        "benign",
        "molnar",
        "heil",
        "cf",
        "also",
        "armstrong",
        "may",
        "seem",
        "attractive",
        "especially",
        "think",
        "trope",
        "nontransferable",
        "way",
        "thing",
        "even",
        "given",
        "way",
        "thinking",
        "nature",
        "trope",
        "however",
        "take",
        "compresence",
        "internal",
        "mean",
        "give",
        "arguably",
        "deeply",
        "held",
        "modal",
        "belief",
        "even",
        "reason",
        "think",
        "property",
        "must",
        "borne",
        "object",
        "able",
        "solve",
        "regressproblem",
        "one",
        "would",
        "accept",
        "much",
        "stronger",
        "thesis",
        "every",
        "trope",
        "must",
        "borne",
        "specific",
        "object",
        "reason",
        "thinking",
        "compresence",
        "internal",
        "sense",
        "solves",
        "problem",
        "bradley",
        "regress",
        "therefore",
        "opt",
        "go",
        "route",
        "last",
        "resort",
        "cf",
        "cameron",
        "maurin",
        "way",
        "saving",
        "least",
        "modal",
        "intuition",
        "still",
        "avoiding",
        "bradley",
        "regress",
        "simon",
        "cf",
        "also",
        "keinänen",
        "keinänen",
        "hakkarainen",
        "slightly",
        "different",
        "version",
        "view",
        "suggests",
        "view",
        "concrete",
        "particular",
        "constituted",
        "partly",
        "nucleus",
        "made",
        "mutually",
        "specifically",
        "dependent",
        "trope",
        "partlyat",
        "least",
        "normal",
        "caseby",
        "halo",
        "made",
        "trope",
        "depend",
        "specifically",
        "trope",
        "nucleus",
        "result",
        "structured",
        "bundle",
        "although",
        "trope",
        "nucleus",
        "depend",
        "existence",
        "existence",
        "trope",
        "kind",
        "halo",
        "depend",
        "specifically",
        "trope",
        "way",
        "least",
        "room",
        "made",
        "contingency",
        "yet",
        "bradley",
        "regress",
        "avoided",
        "trope",
        "halo",
        "depend",
        "specifically",
        "existence",
        "trope",
        "make",
        "nucleus",
        "existence",
        "enough",
        "guarantee",
        "existence",
        "whole",
        "belong",
        "better",
        "perhaps",
        "good",
        "enough",
        "although",
        "object",
        "could",
        "slightly",
        "different",
        "halo",
        "possibility",
        "trope",
        "actually",
        "make",
        "halo",
        "could",
        "exist",
        "joined",
        "particular",
        "nucleus",
        "ruled",
        "apparent",
        "justification",
        "help",
        "proponent",
        "solve",
        "problem",
        "bradley",
        "regress",
        "cf",
        "also",
        "garcia",
        "kind",
        "criticism",
        "view",
        "according",
        "several",
        "different",
        "sort",
        "trope",
        "theorist",
        "finally",
        "stop",
        "bothering",
        "nature",
        "dependence",
        "related",
        "trope",
        "investigate",
        "instead",
        "special",
        "nature",
        "compresence",
        "seems",
        "intuitive",
        "enough",
        "business",
        "relation",
        "relate",
        "according",
        "one",
        "suggestion",
        "along",
        "line",
        "defended",
        "simon",
        "maurin",
        "wieland",
        "betti",
        "cf",
        "also",
        "mertz",
        "robb",
        "giberman",
        "similar",
        "view",
        "nonrelational",
        "trope",
        "existence",
        "independent",
        "existence",
        "specificeither",
        "nonrelational",
        "relationaltrope",
        "relational",
        "trope",
        "including",
        "compresence",
        "depend",
        "specifically",
        "existence",
        "trope",
        "relate",
        "mean",
        "c",
        "exists",
        "must",
        "relate",
        "trope",
        "fact",
        "relates",
        "even",
        "though",
        "trope",
        "might",
        "well",
        "exist",
        "compresent",
        "least",
        "regress",
        "except",
        "c",
        "trope",
        "involved",
        "constituting",
        "concrete",
        "particular",
        "could",
        "exist",
        "without",
        "compresent",
        "turn",
        "mean",
        "modal",
        "intuition",
        "left",
        "le",
        "intact",
        "according",
        "mertz",
        "moreover",
        "able",
        "unifying",
        "work",
        "introduced",
        "compresence",
        "universal",
        "one",
        "concrete",
        "particular",
        "whose",
        "constituent",
        "join",
        "cease",
        "exist",
        "every",
        "concrete",
        "particular",
        "unified",
        "universal",
        "relation",
        "compresence",
        "mertz",
        "point",
        "absurdly",
        "counterfactual",
        "mertz",
        "state",
        "affair",
        "state",
        "affair",
        "complex",
        "could",
        "used",
        "solve",
        "bradley",
        "problem",
        "seems",
        "compresence",
        "understood",
        "way",
        "block",
        "regress",
        "trope",
        "assuming",
        "bradley",
        "regress",
        "threatens",
        "account",
        "according",
        "many",
        "thing",
        "make",
        "one",
        "unified",
        "thing",
        "ie",
        "assuming",
        "threaten",
        "tropebundle",
        "theorist",
        "threat",
        "may",
        "therefore",
        "turn",
        "reason",
        "favor",
        "positing",
        "trope",
        "maurin",
        "suggestion",
        "without",
        "critic",
        "belong",
        "macbride",
        "argues",
        "to",
        "call",
        "trope",
        "relational",
        "pack",
        "essence",
        "relating",
        "function",
        "supposed",
        "perform",
        "without",
        "explaining",
        "bradley",
        "regress",
        "call",
        "question",
        "viz",
        "capacity",
        "relation",
        "relate",
        "rather",
        "solve",
        "problem",
        "word",
        "macbride",
        "think",
        "suggestion",
        "transfer",
        "original",
        "puzzlement",
        "thing",
        "ie",
        "compresencerelation",
        "asks",
        "positing",
        "existence",
        "relational",
        "trope",
        "explain",
        "anything",
        "capacity",
        "relate",
        "stipulated",
        "essence",
        "r",
        "relates",
        "b",
        "though",
        "capacity",
        "relational",
        "trope",
        "relate",
        "explained",
        "mentioning",
        "fact",
        "virtu",
        "relativa",
        "ibid",
        "assuming",
        "agree",
        "something",
        "need",
        "explaining",
        "ie",
        "assuming",
        "agree",
        "several",
        "trope",
        "cancontingentlymake",
        "one",
        "object",
        "need",
        "explaining",
        "either",
        "reject",
        "proposed",
        "solution",
        "prefer",
        "think",
        "better",
        "solution",
        "reject",
        "bad",
        "unacceptable",
        "irrespective",
        "whether",
        "alternative",
        "solution",
        "offer",
        "macbride",
        "appears",
        "suggest",
        "latter",
        "precisely",
        "macbride",
        "proposes",
        "solution",
        "fails",
        "leaf",
        "unexplained",
        "special",
        "power",
        "relate",
        "attribute",
        "compresence",
        "trope",
        "suggestion",
        "fails",
        "however",
        "either",
        "explanation",
        "posit",
        "something",
        "primitively",
        "apt",
        "perform",
        "whatever",
        "function",
        "need",
        "explained",
        "acceptable",
        "particular",
        "case",
        "explanation",
        "kind",
        "former",
        "objection",
        "risk",
        "leading",
        "overgeneration",
        "explanatory",
        "failure",
        "everyone",
        "point",
        "need",
        "posit",
        "thing",
        "fundamental",
        "order",
        "fundamental",
        "posit",
        "able",
        "contribute",
        "somehow",
        "theory",
        "question",
        "seems",
        "must",
        "allowed",
        "say",
        "something",
        "must",
        "use",
        "terminology",
        "introduced",
        "schaffer",
        "outfit",
        "fundamental",
        "posit",
        "axiom",
        "schaffer",
        "also",
        "point",
        "bad",
        "questionalbeit",
        "one",
        "tempted",
        "excellent",
        "philosopher",
        "bradley",
        "van",
        "fraassen",
        "lewisto",
        "ask",
        "posit",
        "axiom",
        "say",
        "work",
        "simply",
        "business",
        "posit",
        "end",
        "story",
        "hand",
        "problem",
        "isolated",
        "case",
        "hand",
        "owed",
        "explanation",
        "make",
        "case",
        "special",
        "macbride",
        "complains",
        "explanatory",
        "task",
        "accounting",
        "capacity",
        "compresence",
        "relate",
        "told",
        "compresence",
        "capacity",
        "nature",
        "perhaps",
        "right",
        "explanatory",
        "task",
        "arguably",
        "one",
        "rather",
        "task",
        "accounting",
        "possible",
        "existence",
        "concrete",
        "object",
        "contingently",
        "made",
        "trope",
        "explanatory",
        "task",
        "far",
        "clear",
        "positing",
        "special",
        "kind",
        "relational",
        "trope",
        "nature",
        "apt",
        "perform",
        "relating",
        "function",
        "explanation"
    ]
}