{
    "main_text": "Objections to pluralism and responses || Problems regarding mixed discourse\n4.5 Problems regarding mixed discourse\n4.5.1 Mixed atomic sentences\n\n\nThe content of some atomic sentences seems to hark exclusively from\na particular region of discourse. For instance, ‘lactose is a\nsugar’ concerns chemical reality, while ‘\\(7 + 5 = 12\\)’\nis solely about the realm of numbers (and operations on these). Not all\ndiscourse is pure or exclusive, however; we often engage in so-called\n‘mixed discourse’, in which contents from different regions\nof discourse are combined. For example, consider:\n\n(39) Causing pain is bad.\n\n\n\nMixed atomic sentences such as (39) are thought to pose problems for\npluralists. It seems to implicate concepts from the physical domain\n(causation), the mental domain (pain), and the moral domain (badness)\n(Sher 2005: 321–22). Yet, if pluralism is correct, then in which\nway is (39) true? Is it true in the way appropriate to talk of the\nphysical, the mental, or the moral? Is it true in neither of these\nways, or in all of these three ways, or in some altogether different\nway?\n\n\nThe source of the problem may be the difficulty in classifying\ndiscursive content—a classificatory task that is an urgent one\nfor pluralists. For it is unclear how they can maintain that regions of\ndiscourse \\(D_1 , \\ldots ,D_n\\)\npartially determine the ways in which sentences can be true without a\nprocedure for determining which region of discourse\n\\(D_i\\) a given \\(p\\) belongs to.\n\n\nOne suggestion is that a mixed atomic sentence \\(p\\) belongs to\nno particular domain. Another is that it belongs to several (Wyatt 2013). Lynch (2005b:\n340–41) suggested paraphrasing mixed atomic sentences as\nsentences that are classifiable as belonging to particular domains. For\nexample, (39) might be paraphrased as:\n\n(40) We ought not cause pain.\n\n\n\nUnlike (39), the paraphrased (40) appears to be a pure atomic\nsentence belonging to the domain of morals. This proposal remains\nunderdeveloped, however. It is not at all clear that (40) counts as a\nfelicitous paraphrase of (39), and, more generally, unclear whether all\nmixed atomic sentences can be paraphrased such that they belong to just\none domain without thereby altering their meaning, truth-conditions, or\ntruth-values.\n\n\nAnother possible solution addresses the problem head-on by\nquestioning whether atomic sentences really are mixed, thereby denying\nthe need for any such paraphrases. Consider the following\nsentences:\n\n(41) The Mona Lisa is beautiful.\n\n(42) Speeding is illegal.\n\n\nPrima facie, what determines the domain-membership of (41) and (42)\nis the aesthetic and legal predicates ‘is beautiful’ and\n‘is illegal’, respectively. It is an aesthetic matter\nwhether the Mona Lisa is beautiful; this is because (41) is true in\nsome way just in case the Mona Lisa falls in the extension of the\naesthetic predicate ‘is beautiful’ (and mutatis mutandis\nfor (42)). In the same way, we might take (39) to exclusively belong to\nthe moral domain given that the moral predicate ‘is\nbad’. (This solution was presented in the first 2012 version of this entry; see Edwards 2018a for later, more detailed treatment.)\n\n\nIt is crucial to the latter two proposals that any given mixed\natomic sentence \\(p\\) has its domain membership essentially, since such\nmembership is what determines the relevant kind of truth. Sher (2005,\n2011) deals with the problem of mixed atomic sentences differently. On\nher view, the truth of a mixed atomic sentence is not accounted for by\nmembership to some specific domain; rather the ‘factors’\ninvolved in the sentence determine a specific form of correspondence,\nand this specific form of correspondence is what accounts for the truth\nof \\(p\\). The details about which specific form of correspondence obtains\nis determined at the sub-sentential levels of reference, satisfaction,\nand fulfillment. For example, the form of correspondence that accounts\nfor the truth of (39) obtains as a combination of the physical\nfulfillment of ‘the causing of \\(x\\)’, the mental\nreference of ‘pain’, and the moral satisfaction of\n‘\\(x\\) is bad’ (2005: 328). No paraphrase is\nneeded.\n4.5.2 Mixed compounds\n\n\nAnother related problem pertains to two or more sentences joined by\none or more logical connectives, as in\n\n(43) Killing innocent people is wrong and \\(7 + 5 = 12\\).\n\n\n\nUnlike atomic sentences, the mixing here takes place at the\nsentential rather than sub-sentential level: (43) is a conjunction,\nwhich mixes the pure sentence ‘\\(7 + 5 = 12\\)’ with the pure\nsentence ‘killing innocent people is wrong’. (There are, of\ncourse, also mixed compounds that involve mixed atomic sentences.) For\nmany theorists, each conjunct seems to be true in a different way, if\ntrue at all: the first conjunct in whatever way is appropriate to moral\ntheory, and the second conjunct in whatever way is appropriate to\narithmetic. But then, how is the pluralist going to account for the\ntruth of the conjunction (Tappolet 2000: 384)? Pluralists owe an answer\nto the question of which way, exactly, a conjunction is true when its\nconjuncts are true in different ways.\n\n\nAdditional complications arise for pluralists who commit to facts\nbeing what make sentences true (e.g., Lynch 2001: 730), or other such\ntruth-maker or -making theses. Prima facie, we would reasonably expect\nthere to be different kinds of facts that make the conjuncts of (43)\ntrue, and which subsequently account for the differences in their\ndifferent ways of being true. However, what fact or facts makes true\nthe mixed compound? Regarding (43), is it the mathematical fact, the\nmoral fact, or some further kind of fact? On one hand, the claims that\nmathematical or moral facts, respectively, make \\(p\\) true seem to betray\nthe thought that both facts contribute equally to the truth of the\nmixed compound. On the other hand, the claim that some third\n‘mixed’ kind of fact makes \\(p\\) true leaves the pluralist with\nthe uneasy task of telling a rather alchemist story about\nfact-mixtures.\n\n\nFunctionalists about truth (e.g., Lynch 2005b: 396–97) propose\nto deal with compounds by distinguishing between two kinds of realizers\nof the \\(F\\)-role. The first is an atomic realizer, such that an\natomic proposition \\(p\\) is true iff \\(p\\) has a property that realizes the\n\\(F\\)-role. The second is a compound realizer, such that a\ncompound \\(q * r\\) (where \\(q\\) and \\(r\\) may themselves be complex) is true\niff\n\n(44)  \\({*} = \\wedge : q \\wedge r\\) has the property of being an instance of\nthe truth-function for conjunction with conjuncts that both have a\nproperty that realizes the \\(F\\)-role.\n\n(45)  \\({*} = \\vee : q \\vee r\\) has the property of being an instance of the\ntruth-function for disjunction with at least one disjunct that has a\nproperty that realizes the \\(F\\)-role.\n(46)  \\({*} = \\rightarrow : q \\rightarrow r\\) has the property of being an\ninstance of the truth-function for material conditional with an\nantecedent that does not have the property that realizes the\n\\(F\\)-role for its domain or a consequent that has a property that\nrealizes the \\(F\\)-role.\n\n\nThe realizers for atomic sentences are properties like\ncorrespondence, coherence, and superwarrant. The realizer properties\nfor compounds are special, in the sense that realizer properties for a\ngiven kind of compound are only had by compounds of that kind. Witness\nthat each of these compound realizer properties requires any of its\nbearers to be an instance of a specific truth-function. Pure and mixed\ncompounds are treated equally on this proposal: when true, they are\ntrue because they instantiate the truth-function for conjunction,\nhaving two or more conjuncts that have a property that realizes the\n\\(F\\)-role (and mutatis mutandis for disjunctions and material\nconditionals).\n\n\nHowever, this functionalist solution to the problem of mixed\ncompounds relies heavily on that theory’s monism—i.e., its\ninsistence that the single role property \\(F\\) is a universal\ntruth property. This might leave one wondering whether a solution is\nreadily available to someone who rejects the existence of such a\nproperty. One strategy is simply to identify the truth of conjunctions, disjunctions, and conditionals with the kind of properties specified by (44), (45), and (46), respectively (as opposed to taking them to be realizers of a single truth property). Thus, e.g., the truth of any conjunction simply \\(is\\) to be an instance of the truth-function for conjunction with conjuncts that have the property that plays the \\(F\\)-role for them (Kim & Pedersen 2018, Pedersen & Lynch 2018 (Sect. 20.6.2.1). Another strategy is to try to use the resources of multi-valued logic. For example, one can posit an ordered set of designated\nvalues for each way of being true \\(F_1 , \\ldots ,F_n\\) (perhaps according to their status as\n‘heavyweight’ or ‘lightweight’), and then take\nconjunction to be a minimizing operation and disjunction a maximizing\none, i.e., \\(v(p \\wedge q) = \\min\\{v(p), v(q)\\}\\)\nand \\(v(p \\vee q) = \\max\\{v(p), v(q)\\}\\).\nResultingly, each conjunction and disjunction—whether pure or\nmixed—will be either true in some way or false in some way\nstraightforwardly determined by the values of the constituents. For\nexample, consider the sentences\n\n(47) Heat is mean molecular kinetic energy.\n\n(48) Manslaughter is a felony.\n\n\nSuppose that (47) is true in virtue of corresponding to physical\nreality, while (48) true in virtue of cohering with a body of law; and\nsuppose further that correspondence \\((F_1)\\) is more\n‘heavyweight’ than coherence \\((F_2)\\).\nSince conjunction is a minimizing operation and \\(F_2 \\lt F_1\\), then ‘heat is mean molecular\nkinetic energy and manslaughter is a felony’ will be\n\\(F_2\\). Since disjunction is a maximizing operation,\nthen ‘heat is mean molecular kinetic energy or manslaughter is a\nfelony’ will be \\(F_1\\).\n\n\nThe many-valued solution to the problem of mixed compounds just\noutlined is formally adequate because it determines a way that each\ncompound is true. However, while interesting, the proposal needs to be\nsubstantially developed in several respects. For example, how is\nnegation treated—are there several negations, one for each way of\nbeing true, or is there a single negation? Also, taking ‘heat is\nmean molecular kinetic energy and manslaughter is a felony’ to be\ntrue in the way appropriate to law betrays a thought that seems at\nleast initially compelling, viz. that both conjuncts\ncontribute to the truth of the conjunction. Alternatively, one could\ntake mixed compounds to be true in some third way. However, this would\nleave the pluralist with the task of telling some story about how this\nthird way of being true relates to the other two. Again substantial\nwork needs to be done.\n\n\nEdwards (2008) proposed another solution to the problem of mixed\nconjunctions, the main idea of which is to appeal to the following\nbiconditional schema:\n\n(49) \\(p\\) is true\\(_i\\) and \\(q\\) is true\\(_j\\) iff \\(p \\wedge q\\)\nis true\\(_k\\).\n\n\n\nEdwards suggests that pluralists can answer the challenge that mixed\nconjunctions pose by reading the stated biconditional as having an\norder of determination: \\(p \\wedge q\\) is true\\(_k\\) in\nvirtue of \\(p\\)’s being true\\(_i\\) and \\(q\\)’s being\ntrue\\(_j\\), but not vice-versa. This, he maintains,\nexplains what kind of truth a conjunction \\(p \\wedge q\\) has when its\nconjuncts are true in different ways; for the conjunction is\ntrue\\(_k\\) in virtue of having conjuncts that are both\ntrue, where it is inessential whether the conjuncts are true in the\nsame way. Truth\\(_k\\) is a further way of being true\nthat depends on the conjuncts being true in some way without reducing\nto either of them. The property true\\(_k\\) is thus not a\ngeneric or universal truth property that applies to the conjuncts as\nwell as the conjunction.\n\n\nAs Cotnoir (2009) emphasizes, Edwards’ proposal provides too\nlittle information about the nature of true\\(_k\\). What\nlittle is provided makes transparent the commitment to\ntrue\\(_k\\)’s being a truth property had only by\nconjunctions, in which case it is unclear whether Edwards’s\nsolution can generalize. In this regard, Edwards’ proposal is\nsimilar to Lynch’s functionalist proposal, which is committed to\nthere being a specific realizer property for each type of logical\ncompound.\n4.5.3 Mixed inferences\n\n\nMixed inferences—inferences involving truth-apt sentences from\ndifferent domains—appear to be yet another problem for the\npluralist (Tappolet 1997, 2000; Pedersen 2006). One can illustrate the\nproblem by supposing, with the pluralist, that there are two ways of\nbeing true, one of which is predicated of the antecedent of a\nconditional and the other as its consequent. It can be left open in\nwhat way the conditional itself is true. Consider the following\ninference:\n\n(50) Satiated dogs are lazy.\n\n(51) Our dog is satiated.\n(52) Our dog is lazy.\n\n\nThis inference would appear to be valid. However, it is not clear\nthat pluralists can account for its validity by relying on the standard\ncharacterization of validity as necessary truth preservation from\npremises to conclusion. Given that the truth properties applicable to\nrespectively (51) and (52) are different, what truth property is\npreserved in the inference? The pluralist owes an explanation of how\nthe thesis that there are many ways of being true can account for the\nvalidity of mixed inferences.\n\n\nBeall (2000) argued that the account of validity used in\nmulti-valued logics gives pluralists the resources to deal with the\nproblem of mixed inferences. For many-valued logics, validity is\naccounted for in terms of preservation of designated value, where\ndesignated values can be thought of as ways of being true, while\nnon-designated values can be thought of as ways of being false.\nAdopting a designated-value account of validity, pluralists can simply\ntake \\(F_1 , \\ldots ,F_n\\) to be the\nrelevant designated values and define an inference as valid just in\ncase the conclusion is designated if each premise is designated (i.e.,\none of \\(F_1 , \\ldots ,F_n)\\). On\nthis account, the validity of (mixed) arguments whose premises and\nconclusion concern different regions of discourse is evaluable in terms\nof more than one of \\(F_1 , \\ldots ,F_n\\); the validity of (pure) arguments whose premises\nand conclusion pertain to the same region of discourse is evaluable in\nterms of the same \\(F_i\\) (where \\(1 \\le i \\le n)\\). An immediate rejoinder is that the term\n‘true’ in ‘ways of being true’ refers to a\nuniversal way of being true—i.e., being designated simpliciter\n(Tappolet 2000: 384). If so, then the multi-valued solution comes at\nthe cost of inadvertently acknowledging a universal truth property. Of\ncourse, as noted, the existence of a universal truth property poses a\nthreat only to strong pluralism.\n",
    "section_title": "4.5 Problems regarding mixed discourse",
    "entry_title": "Pluralist Theories of Truth",
    "hierarchy_title": "Pluralist Theories of Truth || Objections to pluralism and responses || Problems regarding mixed discourse",
    "tokenized_text": [
        "objection",
        "pluralism",
        "response",
        "problem",
        "regarding",
        "mixed",
        "discourse",
        "problem",
        "regarding",
        "mixed",
        "discourse",
        "mixed",
        "atomic",
        "sentence",
        "content",
        "atomic",
        "sentence",
        "seems",
        "hark",
        "exclusively",
        "particular",
        "region",
        "discourse",
        "instance",
        "lactose",
        "sugar",
        "concern",
        "chemical",
        "reality",
        "solely",
        "realm",
        "number",
        "operation",
        "discourse",
        "pure",
        "exclusive",
        "however",
        "often",
        "engage",
        "socalled",
        "mixed",
        "discourse",
        "content",
        "different",
        "region",
        "discourse",
        "combined",
        "example",
        "consider",
        "causing",
        "pain",
        "bad",
        "mixed",
        "atomic",
        "sentence",
        "thought",
        "pose",
        "problem",
        "pluralist",
        "seems",
        "implicate",
        "concept",
        "physical",
        "domain",
        "causation",
        "mental",
        "domain",
        "pain",
        "moral",
        "domain",
        "badness",
        "sher",
        "yet",
        "pluralism",
        "correct",
        "way",
        "true",
        "true",
        "way",
        "appropriate",
        "talk",
        "physical",
        "mental",
        "moral",
        "true",
        "neither",
        "way",
        "three",
        "way",
        "altogether",
        "different",
        "way",
        "source",
        "problem",
        "may",
        "difficulty",
        "classifying",
        "discursive",
        "contenta",
        "classificatory",
        "task",
        "urgent",
        "one",
        "pluralist",
        "unclear",
        "maintain",
        "region",
        "discourse",
        "d_",
        "ldots",
        "d_n",
        "partially",
        "determine",
        "way",
        "sentence",
        "true",
        "without",
        "procedure",
        "determining",
        "region",
        "discourse",
        "d_i",
        "given",
        "p",
        "belongs",
        "one",
        "suggestion",
        "mixed",
        "atomic",
        "sentence",
        "p",
        "belongs",
        "particular",
        "domain",
        "another",
        "belongs",
        "several",
        "wyatt",
        "lynch",
        "b",
        "suggested",
        "paraphrasing",
        "mixed",
        "atomic",
        "sentence",
        "sentence",
        "classifiable",
        "belonging",
        "particular",
        "domain",
        "example",
        "might",
        "paraphrased",
        "ought",
        "cause",
        "pain",
        "unlike",
        "paraphrased",
        "appears",
        "pure",
        "atomic",
        "sentence",
        "belonging",
        "domain",
        "moral",
        "proposal",
        "remains",
        "underdeveloped",
        "however",
        "clear",
        "count",
        "felicitous",
        "paraphrase",
        "generally",
        "unclear",
        "whether",
        "mixed",
        "atomic",
        "sentence",
        "paraphrased",
        "belong",
        "one",
        "domain",
        "without",
        "thereby",
        "altering",
        "meaning",
        "truthconditions",
        "truthvalues",
        "another",
        "possible",
        "solution",
        "address",
        "problem",
        "headon",
        "questioning",
        "whether",
        "atomic",
        "sentence",
        "really",
        "mixed",
        "thereby",
        "denying",
        "need",
        "paraphrase",
        "consider",
        "following",
        "sentence",
        "mona",
        "lisa",
        "beautiful",
        "speeding",
        "illegal",
        "prima",
        "facie",
        "determines",
        "domainmembership",
        "aesthetic",
        "legal",
        "predicate",
        "beautiful",
        "illegal",
        "respectively",
        "aesthetic",
        "matter",
        "whether",
        "mona",
        "lisa",
        "beautiful",
        "true",
        "way",
        "case",
        "mona",
        "lisa",
        "fall",
        "extension",
        "aesthetic",
        "predicate",
        "beautiful",
        "mutatis",
        "mutandis",
        "way",
        "might",
        "take",
        "exclusively",
        "belong",
        "moral",
        "domain",
        "given",
        "moral",
        "predicate",
        "bad",
        "solution",
        "presented",
        "first",
        "version",
        "entry",
        "see",
        "edward",
        "a",
        "later",
        "detailed",
        "treatment",
        "crucial",
        "latter",
        "two",
        "proposal",
        "given",
        "mixed",
        "atomic",
        "sentence",
        "p",
        "domain",
        "membership",
        "essentially",
        "since",
        "membership",
        "determines",
        "relevant",
        "kind",
        "truth",
        "sher",
        "deal",
        "problem",
        "mixed",
        "atomic",
        "sentence",
        "differently",
        "view",
        "truth",
        "mixed",
        "atomic",
        "sentence",
        "accounted",
        "membership",
        "specific",
        "domain",
        "rather",
        "factor",
        "involved",
        "sentence",
        "determine",
        "specific",
        "form",
        "correspondence",
        "specific",
        "form",
        "correspondence",
        "account",
        "truth",
        "p",
        "detail",
        "specific",
        "form",
        "correspondence",
        "obtains",
        "determined",
        "subsentential",
        "level",
        "reference",
        "satisfaction",
        "fulfillment",
        "example",
        "form",
        "correspondence",
        "account",
        "truth",
        "obtains",
        "combination",
        "physical",
        "fulfillment",
        "causing",
        "x",
        "mental",
        "reference",
        "pain",
        "moral",
        "satisfaction",
        "x",
        "bad",
        "paraphrase",
        "needed",
        "mixed",
        "compound",
        "another",
        "related",
        "problem",
        "pertains",
        "two",
        "sentence",
        "joined",
        "one",
        "logical",
        "connective",
        "killing",
        "innocent",
        "people",
        "wrong",
        "unlike",
        "atomic",
        "sentence",
        "mixing",
        "take",
        "place",
        "sentential",
        "rather",
        "subsentential",
        "level",
        "conjunction",
        "mix",
        "pure",
        "sentence",
        "pure",
        "sentence",
        "killing",
        "innocent",
        "people",
        "wrong",
        "course",
        "also",
        "mixed",
        "compound",
        "involve",
        "mixed",
        "atomic",
        "sentence",
        "many",
        "theorist",
        "conjunct",
        "seems",
        "true",
        "different",
        "way",
        "true",
        "first",
        "conjunct",
        "whatever",
        "way",
        "appropriate",
        "moral",
        "theory",
        "second",
        "conjunct",
        "whatever",
        "way",
        "appropriate",
        "arithmetic",
        "pluralist",
        "going",
        "account",
        "truth",
        "conjunction",
        "tappolet",
        "pluralist",
        "owe",
        "answer",
        "question",
        "way",
        "exactly",
        "conjunction",
        "true",
        "conjuncts",
        "true",
        "different",
        "way",
        "additional",
        "complication",
        "arise",
        "pluralist",
        "commit",
        "fact",
        "make",
        "sentence",
        "true",
        "eg",
        "lynch",
        "truthmaker",
        "making",
        "thesis",
        "prima",
        "facie",
        "would",
        "reasonably",
        "expect",
        "different",
        "kind",
        "fact",
        "make",
        "conjuncts",
        "true",
        "subsequently",
        "account",
        "difference",
        "different",
        "way",
        "true",
        "however",
        "fact",
        "fact",
        "make",
        "true",
        "mixed",
        "compound",
        "regarding",
        "mathematical",
        "fact",
        "moral",
        "fact",
        "kind",
        "fact",
        "one",
        "hand",
        "claim",
        "mathematical",
        "moral",
        "fact",
        "respectively",
        "make",
        "p",
        "true",
        "seem",
        "betray",
        "thought",
        "fact",
        "contribute",
        "equally",
        "truth",
        "mixed",
        "compound",
        "hand",
        "claim",
        "third",
        "mixed",
        "kind",
        "fact",
        "make",
        "p",
        "true",
        "leaf",
        "pluralist",
        "uneasy",
        "task",
        "telling",
        "rather",
        "alchemist",
        "story",
        "factmixtures",
        "functionalist",
        "truth",
        "eg",
        "lynch",
        "b",
        "propose",
        "deal",
        "compound",
        "distinguishing",
        "two",
        "kind",
        "realizers",
        "f",
        "role",
        "first",
        "atomic",
        "realizer",
        "atomic",
        "proposition",
        "p",
        "true",
        "iff",
        "p",
        "property",
        "realizes",
        "f",
        "role",
        "second",
        "compound",
        "realizer",
        "compound",
        "q",
        "r",
        "q",
        "r",
        "may",
        "complex",
        "true",
        "iff",
        "wedge",
        "q",
        "wedge",
        "r",
        "property",
        "instance",
        "truthfunction",
        "conjunction",
        "conjuncts",
        "property",
        "realizes",
        "f",
        "role",
        "vee",
        "q",
        "vee",
        "r",
        "property",
        "instance",
        "truthfunction",
        "disjunction",
        "least",
        "one",
        "disjunct",
        "property",
        "realizes",
        "f",
        "role",
        "rightarrow",
        "q",
        "rightarrow",
        "r",
        "property",
        "instance",
        "truthfunction",
        "material",
        "conditional",
        "antecedent",
        "property",
        "realizes",
        "f",
        "role",
        "domain",
        "consequent",
        "property",
        "realizes",
        "f",
        "role",
        "realizers",
        "atomic",
        "sentence",
        "property",
        "like",
        "correspondence",
        "coherence",
        "superwarrant",
        "realizer",
        "property",
        "compound",
        "special",
        "sense",
        "realizer",
        "property",
        "given",
        "kind",
        "compound",
        "compound",
        "kind",
        "witness",
        "compound",
        "realizer",
        "property",
        "requires",
        "bearer",
        "instance",
        "specific",
        "truthfunction",
        "pure",
        "mixed",
        "compound",
        "treated",
        "equally",
        "proposal",
        "true",
        "true",
        "instantiate",
        "truthfunction",
        "conjunction",
        "two",
        "conjuncts",
        "property",
        "realizes",
        "f",
        "role",
        "mutatis",
        "mutandis",
        "disjunction",
        "material",
        "conditionals",
        "however",
        "functionalist",
        "solution",
        "problem",
        "mixed",
        "compound",
        "relies",
        "heavily",
        "theory",
        "monismie",
        "insistence",
        "single",
        "role",
        "property",
        "f",
        "universal",
        "truth",
        "property",
        "might",
        "leave",
        "one",
        "wondering",
        "whether",
        "solution",
        "readily",
        "available",
        "someone",
        "reject",
        "existence",
        "property",
        "one",
        "strategy",
        "simply",
        "identify",
        "truth",
        "conjunction",
        "disjunction",
        "conditionals",
        "kind",
        "property",
        "specified",
        "respectively",
        "opposed",
        "taking",
        "realizers",
        "single",
        "truth",
        "property",
        "thus",
        "eg",
        "truth",
        "conjunction",
        "simply",
        "is",
        "instance",
        "truthfunction",
        "conjunction",
        "conjuncts",
        "property",
        "play",
        "f",
        "role",
        "kim",
        "pedersen",
        "pedersen",
        "lynch",
        "sect",
        "another",
        "strategy",
        "try",
        "use",
        "resource",
        "multivalued",
        "logic",
        "example",
        "one",
        "posit",
        "ordered",
        "set",
        "designated",
        "value",
        "way",
        "true",
        "f_",
        "ldots",
        "f_n",
        "perhaps",
        "according",
        "status",
        "heavyweight",
        "lightweight",
        "take",
        "conjunction",
        "minimizing",
        "operation",
        "disjunction",
        "maximizing",
        "one",
        "ie",
        "v",
        "p",
        "wedge",
        "q",
        "min",
        "v",
        "p",
        "v",
        "q",
        "v",
        "p",
        "vee",
        "q",
        "max",
        "v",
        "p",
        "v",
        "q",
        "resultingly",
        "conjunction",
        "disjunctionwhether",
        "pure",
        "mixedwill",
        "either",
        "true",
        "way",
        "false",
        "way",
        "straightforwardly",
        "determined",
        "value",
        "constituent",
        "example",
        "consider",
        "sentence",
        "heat",
        "mean",
        "molecular",
        "kinetic",
        "energy",
        "manslaughter",
        "felony",
        "suppose",
        "true",
        "virtue",
        "corresponding",
        "physical",
        "reality",
        "true",
        "virtue",
        "cohering",
        "body",
        "law",
        "suppose",
        "correspondence",
        "f_",
        "heavyweight",
        "coherence",
        "f_",
        "since",
        "conjunction",
        "minimizing",
        "operation",
        "f_",
        "lt",
        "f_",
        "heat",
        "mean",
        "molecular",
        "kinetic",
        "energy",
        "manslaughter",
        "felony",
        "f_",
        "since",
        "disjunction",
        "maximizing",
        "operation",
        "heat",
        "mean",
        "molecular",
        "kinetic",
        "energy",
        "manslaughter",
        "felony",
        "f_",
        "manyvalued",
        "solution",
        "problem",
        "mixed",
        "compound",
        "outlined",
        "formally",
        "adequate",
        "determines",
        "way",
        "compound",
        "true",
        "however",
        "interesting",
        "proposal",
        "need",
        "substantially",
        "developed",
        "several",
        "respect",
        "example",
        "negation",
        "treatedare",
        "several",
        "negation",
        "one",
        "way",
        "true",
        "single",
        "negation",
        "also",
        "taking",
        "heat",
        "mean",
        "molecular",
        "kinetic",
        "energy",
        "manslaughter",
        "felony",
        "true",
        "way",
        "appropriate",
        "law",
        "betrays",
        "thought",
        "seems",
        "least",
        "initially",
        "compelling",
        "viz",
        "conjuncts",
        "contribute",
        "truth",
        "conjunction",
        "alternatively",
        "one",
        "could",
        "take",
        "mixed",
        "compound",
        "true",
        "third",
        "way",
        "however",
        "would",
        "leave",
        "pluralist",
        "task",
        "telling",
        "story",
        "third",
        "way",
        "true",
        "relates",
        "two",
        "substantial",
        "work",
        "need",
        "done",
        "edward",
        "proposed",
        "another",
        "solution",
        "problem",
        "mixed",
        "conjunction",
        "main",
        "idea",
        "appeal",
        "following",
        "biconditional",
        "schema",
        "p",
        "true",
        "_i",
        "q",
        "true",
        "_j",
        "iff",
        "p",
        "wedge",
        "q",
        "true",
        "_k",
        "edward",
        "suggests",
        "pluralist",
        "answer",
        "challenge",
        "mixed",
        "conjunction",
        "pose",
        "reading",
        "stated",
        "biconditional",
        "order",
        "determination",
        "p",
        "wedge",
        "q",
        "true",
        "_k",
        "virtue",
        "p",
        "true",
        "_i",
        "q",
        "true",
        "_j",
        "viceversa",
        "maintains",
        "explains",
        "kind",
        "truth",
        "conjunction",
        "p",
        "wedge",
        "q",
        "conjuncts",
        "true",
        "different",
        "way",
        "conjunction",
        "true",
        "_k",
        "virtue",
        "conjuncts",
        "true",
        "inessential",
        "whether",
        "conjuncts",
        "true",
        "way",
        "truth",
        "_k",
        "way",
        "true",
        "depends",
        "conjuncts",
        "true",
        "way",
        "without",
        "reducing",
        "either",
        "property",
        "true",
        "_k",
        "thus",
        "generic",
        "universal",
        "truth",
        "property",
        "applies",
        "conjuncts",
        "well",
        "conjunction",
        "cotnoir",
        "emphasizes",
        "edward",
        "proposal",
        "provides",
        "little",
        "information",
        "nature",
        "true",
        "_k",
        "little",
        "provided",
        "make",
        "transparent",
        "commitment",
        "true",
        "_k",
        "truth",
        "property",
        "conjunction",
        "case",
        "unclear",
        "whether",
        "edward",
        "solution",
        "generalize",
        "regard",
        "edward",
        "proposal",
        "similar",
        "lynch",
        "functionalist",
        "proposal",
        "committed",
        "specific",
        "realizer",
        "property",
        "type",
        "logical",
        "compound",
        "mixed",
        "inference",
        "mixed",
        "inferencesinferences",
        "involving",
        "truthapt",
        "sentence",
        "different",
        "domainsappear",
        "yet",
        "another",
        "problem",
        "pluralist",
        "tappolet",
        "pedersen",
        "one",
        "illustrate",
        "problem",
        "supposing",
        "pluralist",
        "two",
        "way",
        "true",
        "one",
        "predicated",
        "antecedent",
        "conditional",
        "consequent",
        "left",
        "open",
        "way",
        "conditional",
        "true",
        "consider",
        "following",
        "inference",
        "satiated",
        "dog",
        "lazy",
        "dog",
        "satiated",
        "dog",
        "lazy",
        "inference",
        "would",
        "appear",
        "valid",
        "however",
        "clear",
        "pluralist",
        "account",
        "validity",
        "relying",
        "standard",
        "characterization",
        "validity",
        "necessary",
        "truth",
        "preservation",
        "premise",
        "conclusion",
        "given",
        "truth",
        "property",
        "applicable",
        "respectively",
        "different",
        "truth",
        "property",
        "preserved",
        "inference",
        "pluralist",
        "owes",
        "explanation",
        "thesis",
        "many",
        "way",
        "true",
        "account",
        "validity",
        "mixed",
        "inference",
        "beall",
        "argued",
        "account",
        "validity",
        "used",
        "multivalued",
        "logic",
        "give",
        "pluralist",
        "resource",
        "deal",
        "problem",
        "mixed",
        "inference",
        "manyvalued",
        "logic",
        "validity",
        "accounted",
        "term",
        "preservation",
        "designated",
        "value",
        "designated",
        "value",
        "thought",
        "way",
        "true",
        "nondesignated",
        "value",
        "thought",
        "way",
        "false",
        "adopting",
        "designatedvalue",
        "account",
        "validity",
        "pluralist",
        "simply",
        "take",
        "f_",
        "ldots",
        "f_n",
        "relevant",
        "designated",
        "value",
        "define",
        "inference",
        "valid",
        "case",
        "conclusion",
        "designated",
        "premise",
        "designated",
        "ie",
        "one",
        "f_",
        "ldots",
        "f_n",
        "account",
        "validity",
        "mixed",
        "argument",
        "whose",
        "premise",
        "conclusion",
        "concern",
        "different",
        "region",
        "discourse",
        "evaluable",
        "term",
        "one",
        "f_",
        "ldots",
        "f_n",
        "validity",
        "pure",
        "argument",
        "whose",
        "premise",
        "conclusion",
        "pertain",
        "region",
        "discourse",
        "evaluable",
        "term",
        "f_i",
        "le",
        "le",
        "n",
        "immediate",
        "rejoinder",
        "term",
        "true",
        "way",
        "true",
        "refers",
        "universal",
        "way",
        "trueie",
        "designated",
        "simpliciter",
        "tappolet",
        "multivalued",
        "solution",
        "come",
        "cost",
        "inadvertently",
        "acknowledging",
        "universal",
        "truth",
        "property",
        "course",
        "noted",
        "existence",
        "universal",
        "truth",
        "property",
        "pose",
        "threat",
        "strong",
        "pluralism"
    ]
}