{
    "main_text": "Truth values as objects and referents of sentences || Functional analysis of language and truth values\n1.1 Functional analysis of language and truth values\n\n\nThe approach to language analysis developed by Frege rests essentially\non the idea of a strict discrimination between two main kinds of\nexpressions: proper names (singular terms) and functional\nexpressions. Proper names designate (signify, denote, or refer to)\nsingular objects, and functional expressions designate (signify,\ndenote, or refer to) functions. [Note: In the literature, the\nexpressions ‘designation’, ‘signification’,\n‘denotation’, and ‘reference’ are usually\ntaken to be synonymous. This practice is used throughout the present\nentry.] The name ‘Ukraine’, for example, refers to a\ncertain country, and the expression ‘the capital of’\ndenotes a one-place function from countries to cities, in particular,\na function that maps Ukraine to Kyiv (Kiev). Whereas names are\n“saturated” (complete) expressions, functional expressions\nare “unsaturated” (incomplete) and may be saturated by\napplying them to names, producing in this way new names. Similarly,\nthe objects to which singular terms refer are saturated and the\nfunctions denoted by functional expression are unsaturated. Names to\nwhich a functional expression can be applied are called\nthe arguments of this functional expression, and entities to\nwhich a function can be applied are called the arguments of\nthis function. The object which serves as the reference for the name\ngenerated by an application of a functional expression to its\narguments is called the value of the function for these\narguments. Particularly, the above mentioned functional expression\n‘the capital of’ remains incomplete until applied to some\nname. An application of the function denoted by ‘the capital\nof’ to Ukraine (as an argument) returns Kyiv as the object\ndenoted by the compound expression ‘the capital of\nUkraine’ which, according to Frege, is a proper name of\nKyiv. Note that Frege distinguishes between an \\(n\\)-place function\n\\(f\\) as an unsaturated entity that can be completed by and applied to\narguments \\(a_1\\),…, \\(a_n\\) and its course of values,\nwhich can be seen as the set-theoretic representation of this\nfunction: the set \\[\\{\\langle a_1, \\ldots, a_n, a\\rangle \\mid a =\nf(a_1,\\ldots , a_n)\\}.\\]\n\n\nPursuing this kind of analysis, one is very quickly confronted with\ntwo intricate problems. First, how should one treat\ndeclarative sentences? Should one perhaps separate them into\na specific linguistic category distinct from the ones of names and\nfunction symbols? And second, how—from a functional\npoint of view—should one deal with predicate\nexpressions such as ‘is a city’, ‘is\ntall’, ‘runs’, ‘is bigger than’,\n‘loves’, etc., which are used to denote classes of\nobjects, properties of objects, or relations between them and which\ncan be combined with (applied to) singular terms to obtain sentences?\nIf one considers predicates to be a kind of functional expressions,\nwhat sort of names are generated by applying predicates to their\narguments, and what can serve as referents of these names,\nrespectively values of these functions?\n\nA uniform solution of both problems is obtained by introducing the\nnotion of a truth value. Namely, by applying the criterion of\n“saturatedness” Frege provides a negative answer to the\nfirst of the above problems. Since sentences are a kind of complete\nentities, they should be treated as a sort of proper names, but names\ndestined to denote some specific objects, namely the truth values:\nthe True and the False. In this way one also obtains\na solution of the second problem. Predicates are to be interpreted as\nsome kind of functional expressions, which being applied to these or\nthose names generate sentences referring to one of the two truth\nvalues. For example, if the predicate ‘is a city’ is\napplied to the name ‘Kyiv’, one gets the sentence\n‘Kyiv is a city’, which designates the True\n(i.e., ‘Kyiv is a city’ is true). On the other\nhand, by using the name ‘Mount Everest’, one obtains the\nsentence ‘Mount Everest is a city’ which clearly\ndesignates the False, since ‘Mount Everest is a\ncity’ is false.\n\nFunctions whose values are truth values are called propositional\nfunctions. Frege also referred to them as concepts\n(Begriffe). A typical kind of such functions (besides the\nones denoted by predicates) are the functions denoted by propositional\nconnectives. Negation, for example, can be interpreted as a unary\nfunction converting the True into the False and\nvice versa, and conjunction is a binary function that returns\nthe True as a value when both its argument positions are\nfilled in by the True, etc. Propositional functions mapping\n\\(n\\)-tuples of truth values into truth values are also called\ntruth-value functions.\n\nFrege thus in a first step extended the familiar notion of a numerical\nfunction to functions on singular objects in general and, moreover,\nintroduced a new kind of singular objects that can serve as arguments\nand values of functions on singular objects, the truth values. In a\nfurther step, he considered propositional functions taking functions\nas their arguments. The quantifier phrase ‘every city’,\nfor example, can be applied to the predicate ‘is a\ncapital’ to produce a sentence. The argument of the\nsecond-order function denoted by ‘every city’ is\nthe first-order propositional function on singular objects\ndenoted by ‘is a capital’. The functional value denoted by\nthe sentence ‘Every city is a capital’ is a truth value,\nthe False.\n\nTruth values thus prove to be an extremely effective instrument for a\nlogical and semantical analysis of \n language.[1]\n Moreover, Frege provides truth values (as proper referents of\nsentences) not merely with a pragmatical motivation but also with a\nstrong theoretical justification. The idea of such justification, that\ncan be found in Frege 1892, employs the principle\nof substitutivity of co-referential terms, according to which\nthe reference of a complex singular term must remain unchanged when\nany of its sub-terms is replaced by an expression having the same\nreference. This is actually just an instance of the compositionality\nprinciple mentioned above. If sentences are treated as a kind of\nsingular terms which must have designations, then assuming the\nprinciple of substitutivity one “almost inevitably” (as\nKurt Gödel (1944: 129) explains) is forced to recognize truth\nvalues as the most suitable entities for such\ndesignations. Accordingly, Frege asks:\n\n\nWhat else but the truth value could be found, that belongs quite\ngenerally to every sentence if the reference of its components is\nrelevant, and remains unchanged by substitutions of the kind in\nquestion? (Geach and Black 1952: 64) \n\n\nThe idea underlying this question has been neatly reconstructed by\nAlonzo Church in his Introduction to Mathematical Logic\n(1956: 24–25) by considering the following sequence of four\nsentences:\n\nC1.\nSir Walter Scott is the author of Waverley.\nC2.\nC2. Sir Walter Scott is the man who wrote 29 Waverley\nNovels altogether.\nC3.\nThe number, such that Sir Walter Scott is the man who wrote that\nmany Waverley Novels altogether is 29.\nC4.\nThe number of counties in Utah is 29.\n\n\nC1–C4 present a number of conversion steps each producing\nco-referential sentences. It is claimed that C1 and C2 must have the\nsame designation by substitutivity, for the terms ‘the author of\nWaverley’ and ‘the man who wrote 29\nWaverley Novels altogether’ designate one and the same\nobject, namely Walter Scott. And so must C3 and C4, because the\nnumber, such that Sir Walter Scott is the man who wrote that many\nWaverley Novels altogether is the same as the number of\ncounties in Utah, namely 29. Next, Church argues, it is plausible to\nsuppose that C2, even if not completely synonymous with C3, is at\nleast so close to C3 “so as to ensure its having the same\ndenotation”. If this is indeed the case, then C1 and C4 must\nhave the same denotation (designation) as well. But it seems that the\nonly (semantically relevant) thing these sentences have in common is\nthat both are true. Thus, taken that there must be something what the\nsentences designate, one concludes that it is just their truth value.\nAs Church remarks, a parallel example involving false sentences can be\nconstructed in the same way (by considering, e.g., ‘Sir Walter\nScott is not the author of Waverley’).\n\nThis line of reasoning is now widely known as the “slingshot\nargument”, a term coined by Jon Barwise and John Perry (in\nBarwise and Perry 1981: 395), who stressed thus an extraordinary\nsimplicity of the argument and the minimality of presuppositions\ninvolved. Stated generally, the pattern of the argument goes as\nfollows (cf. Perry 1996). One starts with a certain sentence, and then\nmoves, step by step, to a completely different sentence. Every two\nsentences in any step designate presumably one and the same thing.\nHence, the starting and the concluding sentences of the argument must\nhave the same designation as well. But the only semantically\nsignificant thing they have in common seems to be their truth value.\nThus, what any sentence designates is just its truth value.\n\nA formal version of this argument, employing the term-forming,\nvariable-binding class abstraction (or property abstraction) operator\nλ\\(x\\) (“the class of all \\(x\\) such that” or\n“the property of being such an \\(x\\) that”), was first\nformulated by Church (1943) in his review of Carnap’s\nIntroduction to Semantics. Quine (1953), too, presents a\nvariant of the slingshot using class abstraction, see also (Shramko\nand Wansing 2009a). Other remarkable variations of the argument are\nthose by Kurt Gödel (1944) and Donald Davidson (1967, 1969),\nwhich make use of the formal apparatus of a theory of definite\ndescriptions dealing with the description-forming, variable-binding\niota-operator (ι\\(x\\), “the \\(x\\) such that”). It is\nworth noticing that the formal versions of the slingshot show how to\nmove—using steps that ultimately preserve reference—from\nany true (false) sentence to any other such\nsentence. In view of this result, it is hard to avoid the conclusion\nthat what the sentences refer to are just truth values.\n\nThe slingshot argument has been analyzed in detail by many authors\n(see especially the comprehensive study by Stephen Neale (Neale 2001)\nand references therein) and has caused much controversy notably on the\npart of fact-theorists, i.e., adherents of facts, situations,\npropositions, states of affairs, and other fact-like entities\nconceived as alternative candidates for denotations of declarative\nsentences. Also see the\n supplement on the slingshot argument.\n",
    "section_title": "1.1 Functional analysis of language and truth values",
    "entry_title": "Truth Values",
    "hierarchy_title": "Truth Values || Truth values as objects and referents of sentences || Functional analysis of language and truth values",
    "tokenized_text": [
        "truth",
        "value",
        "object",
        "referent",
        "sentence",
        "functional",
        "analysis",
        "language",
        "truth",
        "value",
        "functional",
        "analysis",
        "language",
        "truth",
        "value",
        "approach",
        "language",
        "analysis",
        "developed",
        "frege",
        "rest",
        "essentially",
        "idea",
        "strict",
        "discrimination",
        "two",
        "main",
        "kind",
        "expression",
        "proper",
        "name",
        "singular",
        "term",
        "functional",
        "expression",
        "proper",
        "name",
        "designate",
        "signify",
        "denote",
        "refer",
        "singular",
        "object",
        "functional",
        "expression",
        "designate",
        "signify",
        "denote",
        "refer",
        "function",
        "note",
        "literature",
        "expression",
        "designation",
        "signification",
        "denotation",
        "reference",
        "usually",
        "taken",
        "synonymous",
        "practice",
        "used",
        "throughout",
        "present",
        "entry",
        "name",
        "ukraine",
        "example",
        "refers",
        "certain",
        "country",
        "expression",
        "capital",
        "denotes",
        "oneplace",
        "function",
        "country",
        "city",
        "particular",
        "function",
        "map",
        "ukraine",
        "kyiv",
        "kiev",
        "whereas",
        "name",
        "saturated",
        "complete",
        "expression",
        "functional",
        "expression",
        "unsaturated",
        "incomplete",
        "may",
        "saturated",
        "applying",
        "name",
        "producing",
        "way",
        "new",
        "name",
        "similarly",
        "object",
        "singular",
        "term",
        "refer",
        "saturated",
        "function",
        "denoted",
        "functional",
        "expression",
        "unsaturated",
        "name",
        "functional",
        "expression",
        "applied",
        "called",
        "argument",
        "functional",
        "expression",
        "entity",
        "function",
        "applied",
        "called",
        "argument",
        "function",
        "object",
        "serf",
        "reference",
        "name",
        "generated",
        "application",
        "functional",
        "expression",
        "argument",
        "called",
        "value",
        "function",
        "argument",
        "particularly",
        "mentioned",
        "functional",
        "expression",
        "capital",
        "remains",
        "incomplete",
        "applied",
        "name",
        "application",
        "function",
        "denoted",
        "capital",
        "ukraine",
        "argument",
        "return",
        "kyiv",
        "object",
        "denoted",
        "compound",
        "expression",
        "capital",
        "ukraine",
        "according",
        "frege",
        "proper",
        "name",
        "kyiv",
        "note",
        "frege",
        "distinguishes",
        "n",
        "place",
        "function",
        "f",
        "unsaturated",
        "entity",
        "completed",
        "applied",
        "argument",
        "a_",
        "a_n",
        "course",
        "value",
        "seen",
        "settheoretic",
        "representation",
        "function",
        "set",
        "langle",
        "a_",
        "ldots",
        "a_n",
        "arangle",
        "mid",
        "f",
        "a_",
        "ldots",
        "a_n",
        "pursuing",
        "kind",
        "analysis",
        "one",
        "quickly",
        "confronted",
        "two",
        "intricate",
        "problem",
        "first",
        "one",
        "treat",
        "declarative",
        "sentence",
        "one",
        "perhaps",
        "separate",
        "specific",
        "linguistic",
        "category",
        "distinct",
        "one",
        "name",
        "function",
        "symbol",
        "second",
        "howfrom",
        "functional",
        "point",
        "viewshould",
        "one",
        "deal",
        "predicate",
        "expression",
        "city",
        "tall",
        "run",
        "bigger",
        "love",
        "etc",
        "used",
        "denote",
        "class",
        "object",
        "property",
        "object",
        "relation",
        "combined",
        "applied",
        "singular",
        "term",
        "obtain",
        "sentence",
        "one",
        "considers",
        "predicate",
        "kind",
        "functional",
        "expression",
        "sort",
        "name",
        "generated",
        "applying",
        "predicate",
        "argument",
        "serve",
        "referent",
        "name",
        "respectively",
        "value",
        "function",
        "uniform",
        "solution",
        "problem",
        "obtained",
        "introducing",
        "notion",
        "truth",
        "value",
        "namely",
        "applying",
        "criterion",
        "saturatedness",
        "frege",
        "provides",
        "negative",
        "answer",
        "first",
        "problem",
        "since",
        "sentence",
        "kind",
        "complete",
        "entity",
        "treated",
        "sort",
        "proper",
        "name",
        "name",
        "destined",
        "denote",
        "specific",
        "object",
        "namely",
        "truth",
        "value",
        "true",
        "false",
        "way",
        "one",
        "also",
        "obtains",
        "solution",
        "second",
        "problem",
        "predicate",
        "interpreted",
        "kind",
        "functional",
        "expression",
        "applied",
        "name",
        "generate",
        "sentence",
        "referring",
        "one",
        "two",
        "truth",
        "value",
        "example",
        "predicate",
        "city",
        "applied",
        "name",
        "kyiv",
        "one",
        "get",
        "sentence",
        "kyiv",
        "city",
        "designates",
        "true",
        "ie",
        "kyiv",
        "city",
        "true",
        "hand",
        "using",
        "name",
        "mount",
        "everest",
        "one",
        "obtains",
        "sentence",
        "mount",
        "everest",
        "city",
        "clearly",
        "designates",
        "false",
        "since",
        "mount",
        "everest",
        "city",
        "false",
        "function",
        "whose",
        "value",
        "truth",
        "value",
        "called",
        "propositional",
        "function",
        "frege",
        "also",
        "referred",
        "concept",
        "begriffe",
        "typical",
        "kind",
        "function",
        "besides",
        "one",
        "denoted",
        "predicate",
        "function",
        "denoted",
        "propositional",
        "connective",
        "negation",
        "example",
        "interpreted",
        "unary",
        "function",
        "converting",
        "true",
        "false",
        "vice",
        "versa",
        "conjunction",
        "binary",
        "function",
        "return",
        "true",
        "value",
        "argument",
        "position",
        "filled",
        "true",
        "etc",
        "propositional",
        "function",
        "mapping",
        "n",
        "tuples",
        "truth",
        "value",
        "truth",
        "value",
        "also",
        "called",
        "truthvalue",
        "function",
        "frege",
        "thus",
        "first",
        "step",
        "extended",
        "familiar",
        "notion",
        "numerical",
        "function",
        "function",
        "singular",
        "object",
        "general",
        "moreover",
        "introduced",
        "new",
        "kind",
        "singular",
        "object",
        "serve",
        "argument",
        "value",
        "function",
        "singular",
        "object",
        "truth",
        "value",
        "step",
        "considered",
        "propositional",
        "function",
        "taking",
        "function",
        "argument",
        "quantifier",
        "phrase",
        "every",
        "city",
        "example",
        "applied",
        "predicate",
        "capital",
        "produce",
        "sentence",
        "argument",
        "secondorder",
        "function",
        "denoted",
        "every",
        "city",
        "firstorder",
        "propositional",
        "function",
        "singular",
        "object",
        "denoted",
        "capital",
        "functional",
        "value",
        "denoted",
        "sentence",
        "every",
        "city",
        "capital",
        "truth",
        "value",
        "false",
        "truth",
        "value",
        "thus",
        "prove",
        "extremely",
        "effective",
        "instrument",
        "logical",
        "semantical",
        "analysis",
        "language",
        "moreover",
        "frege",
        "provides",
        "truth",
        "value",
        "proper",
        "referent",
        "sentence",
        "merely",
        "pragmatical",
        "motivation",
        "also",
        "strong",
        "theoretical",
        "justification",
        "idea",
        "justification",
        "found",
        "frege",
        "employ",
        "principle",
        "substitutivity",
        "coreferential",
        "term",
        "according",
        "reference",
        "complex",
        "singular",
        "term",
        "must",
        "remain",
        "unchanged",
        "subterms",
        "replaced",
        "expression",
        "reference",
        "actually",
        "instance",
        "compositionality",
        "principle",
        "mentioned",
        "sentence",
        "treated",
        "kind",
        "singular",
        "term",
        "must",
        "designation",
        "assuming",
        "principle",
        "substitutivity",
        "one",
        "almost",
        "inevitably",
        "kurt",
        "gödel",
        "explains",
        "forced",
        "recognize",
        "truth",
        "value",
        "suitable",
        "entity",
        "designation",
        "accordingly",
        "frege",
        "asks",
        "else",
        "truth",
        "value",
        "could",
        "found",
        "belongs",
        "quite",
        "generally",
        "every",
        "sentence",
        "reference",
        "component",
        "relevant",
        "remains",
        "unchanged",
        "substitution",
        "kind",
        "question",
        "geach",
        "black",
        "idea",
        "underlying",
        "question",
        "neatly",
        "reconstructed",
        "alonzo",
        "church",
        "introduction",
        "mathematical",
        "logic",
        "considering",
        "following",
        "sequence",
        "four",
        "sentence",
        "c",
        "sir",
        "walter",
        "scott",
        "author",
        "waverley",
        "c",
        "c",
        "sir",
        "walter",
        "scott",
        "man",
        "wrote",
        "waverley",
        "novel",
        "altogether",
        "c",
        "number",
        "sir",
        "walter",
        "scott",
        "man",
        "wrote",
        "many",
        "waverley",
        "novel",
        "altogether",
        "c",
        "number",
        "county",
        "utah",
        "cc",
        "present",
        "number",
        "conversion",
        "step",
        "producing",
        "coreferential",
        "sentence",
        "claimed",
        "c",
        "c",
        "must",
        "designation",
        "substitutivity",
        "term",
        "author",
        "waverley",
        "man",
        "wrote",
        "waverley",
        "novel",
        "altogether",
        "designate",
        "one",
        "object",
        "namely",
        "walter",
        "scott",
        "must",
        "c",
        "c",
        "number",
        "sir",
        "walter",
        "scott",
        "man",
        "wrote",
        "many",
        "waverley",
        "novel",
        "altogether",
        "number",
        "county",
        "utah",
        "namely",
        "next",
        "church",
        "argues",
        "plausible",
        "suppose",
        "c",
        "even",
        "completely",
        "synonymous",
        "c",
        "least",
        "close",
        "c",
        "ensure",
        "denotation",
        "indeed",
        "case",
        "c",
        "c",
        "must",
        "denotation",
        "designation",
        "well",
        "seems",
        "semantically",
        "relevant",
        "thing",
        "sentence",
        "common",
        "true",
        "thus",
        "taken",
        "must",
        "something",
        "sentence",
        "designate",
        "one",
        "concludes",
        "truth",
        "value",
        "church",
        "remark",
        "parallel",
        "example",
        "involving",
        "false",
        "sentence",
        "constructed",
        "way",
        "considering",
        "eg",
        "sir",
        "walter",
        "scott",
        "author",
        "waverley",
        "line",
        "reasoning",
        "widely",
        "known",
        "slingshot",
        "argument",
        "term",
        "coined",
        "jon",
        "barwise",
        "john",
        "perry",
        "barwise",
        "perry",
        "stressed",
        "thus",
        "extraordinary",
        "simplicity",
        "argument",
        "minimality",
        "presupposition",
        "involved",
        "stated",
        "generally",
        "pattern",
        "argument",
        "go",
        "follows",
        "cf",
        "perry",
        "one",
        "start",
        "certain",
        "sentence",
        "move",
        "step",
        "step",
        "completely",
        "different",
        "sentence",
        "every",
        "two",
        "sentence",
        "step",
        "designate",
        "presumably",
        "one",
        "thing",
        "hence",
        "starting",
        "concluding",
        "sentence",
        "argument",
        "must",
        "designation",
        "well",
        "semantically",
        "significant",
        "thing",
        "common",
        "seems",
        "truth",
        "value",
        "thus",
        "sentence",
        "designates",
        "truth",
        "value",
        "formal",
        "version",
        "argument",
        "employing",
        "termforming",
        "variablebinding",
        "class",
        "abstraction",
        "property",
        "abstraction",
        "operator",
        "λ",
        "x",
        "class",
        "x",
        "property",
        "x",
        "first",
        "formulated",
        "church",
        "review",
        "carnap",
        "introduction",
        "semantics",
        "quine",
        "present",
        "variant",
        "slingshot",
        "using",
        "class",
        "abstraction",
        "see",
        "also",
        "shramko",
        "wansing",
        "a",
        "remarkable",
        "variation",
        "argument",
        "kurt",
        "gödel",
        "donald",
        "davidson",
        "make",
        "use",
        "formal",
        "apparatus",
        "theory",
        "definite",
        "description",
        "dealing",
        "descriptionforming",
        "variablebinding",
        "iotaoperator",
        "ι",
        "x",
        "x",
        "worth",
        "noticing",
        "formal",
        "version",
        "slingshot",
        "show",
        "moveusing",
        "step",
        "ultimately",
        "preserve",
        "referencefrom",
        "true",
        "false",
        "sentence",
        "sentence",
        "view",
        "result",
        "hard",
        "avoid",
        "conclusion",
        "sentence",
        "refer",
        "truth",
        "value",
        "slingshot",
        "argument",
        "analyzed",
        "detail",
        "many",
        "author",
        "see",
        "especially",
        "comprehensive",
        "study",
        "stephen",
        "neale",
        "neale",
        "reference",
        "therein",
        "caused",
        "much",
        "controversy",
        "notably",
        "part",
        "facttheorists",
        "ie",
        "adherent",
        "fact",
        "situation",
        "proposition",
        "state",
        "affair",
        "factlike",
        "entity",
        "conceived",
        "alternative",
        "candidate",
        "denotation",
        "declarative",
        "sentence",
        "also",
        "see",
        "supplement",
        "slingshot",
        "argument"
    ]
}