{
    "main_text": "Modified Versions of the Correspondence Theory || Logical Atomism\n7.1 Logical Atomism\n\n\nWittgenstein (1921) and Russell (1918) propose modified fact-based\ncorrespondence accounts of truth as part of their program of\nlogical atomism. Such accounts proceed in two stages. At the\nfirst stage, the basic truth-definition, say (1) from Section 3,\nis restricted to a special subclass of truthbearers, the\nso-called elementary or atomic truthbearers, whose\ntruth is said to consist in their correspondence to (atomic) facts:\nif x is elementary, then x is true iff x\ncorresponds to some (atomic) fact. This restricted definition serves\nas the base-clause for truth-conditional recursion-clauses given at\nthe second stage, at which the truth-values of non-elementary, or\nmolecular, truthbearers are explained recursively in terms of\ntheir logical structure and the truth-values of their simpler\nconstituents. For example: a sentence of the form\n‘not-p’ is true iff ‘p’ is\nfalse; a sentence of the form ‘p and q’\nis true iff ‘p’ is true and\n‘q’ is true; a sentence of the form\n‘p or q’ is true iff\n‘p’ is true or ‘q’ is true,\netc. These recursive clauses (called “truth conditions”)\ncan be reapplied until the truth of a non-elementary, molecular\nsentence of arbitrary complexity is reduced to the truth or falsehood\nof its elementary, atomic constituents.\n\n\nLogical atomism exploits the familiar rules, enshrined in the\ntruth-tables, for evaluating complex formulas on the basis of their\nsimpler constituents. These rules can be understood in two different\nways: (a) as tracing the ontological relations\nbetween complex facts and constituent simpler facts, or (b)\nas tracing logico-semantic relations, exhibiting how the\ntruth-values of complex sentences can be explained in terms of their\nlogical relations to simpler constituent sentences together with the\ncorrespondence and non-correspondence of simple, elementary sentences\nto atomic facts. Logical atomism takes option (b).\n\n\nLogical atomism is designed to go with the ontological view that the\nworld is the totality of atomic facts (cf. Wittgenstein 1921, 2.04);\nthus accommodating objection 3.F2 by doing without funny facts: atomic\nfacts are all the facts there are—although real-life atomists\ntend to allow conjunctive facts, regarding them as mere aggregates of\natomic facts. An elementary truth is true because it corresponds to an\natomic fact: correspondence is still isomorphism, but it holds\nexclusively between elementary truths and atomic facts. There is no\nmatch between truths and facts at the level of non-elementary,\nmolecular truths; e.g., ‘p’, ‘p\nor q’, and ‘p or r’ might\nall be true merely because ‘p’ corresponds to a\nfact). The trick for avoiding logically complex facts lies\nin not assigning any entities to the logical\nconstants. Logical complexity, so the idea goes, belongs to the\nstructure of language and/or thought; it is not a feature of the\nworld. This is expressed by Wittgenstein in an often quoted passage\n(1921, 4.0312): “My fundamental idea is that the ‘logical\nconstants’ are not representatives; that there can be no\nrepresentatives of the logic of facts”; and also by\nRussell (1918, p. 209f.): “You must not look about the real\nworld for an object which you can call ‘or’, and say\n‘Now look at this. This is ‘or’’”.\n\n\nThough accounts of this sort are naturally classified as versions of\nthe correspondence theory, it should be noted that they are strictly\nspeaking in conflict with the basic forms presented in Section\n3. According to logical atomism, it is not the case that for\nevery truth there is a corresponding fact. It is, however, still the\ncase that the being true of every truth is explained in terms\nof correspondence to a fact (or non-correspondence to any fact)\ntogether with (in the case of molecular truths) logical notions\ndetailing the logical structure of complex truthbearers. Logical\natomism attempts to avoid commitment to logically complex, funny facts\nvia structural analysis of truthbearers. It should not be\nconfused with a superficially similar account maintaining that\nmolecular facts are ultimately constituted by atomic facts. The latter\naccount would admit complex facts, offering an ontological analysis of\ntheir structure, and would thus be compatible with the basic forms\npresented in Section 3, because it would be compatible with the claim\nthat for every truth there is a corresponding fact. (For more on\nclassical logical atomism, see Wisdom 1931-1933, Urmson 1953, and the\nentries on\nRussell's logical atomism\nand \nWittgenstein's logical atomism \nin this encyclopedia.)\n\n\nWhile Wittgenstein and Russell seem to have held that the constituents\nof atomic facts are to be determined on the basis of a priori\nconsiderations, Armstrong (1997, 2004) advocates an a\nposteriori form of logical atomism. On his view, atomic facts are\ncomposed of particulars and simple universals (properties and\nrelations). The latter are objective features of the world that ground\nthe objective resemblances between particulars and explain their\ncausal powers. Accordingly, what particulars and universals there are\nwill have to be determined on the basis of total science.\n\nProblems: Logical atomism is not easy to sustain and\nhas rarely been held in a pure form. Among its difficulties are the\nfollowing: (a) What, exactly, are the elementary\ntruthbearers? How are they determined? (b) There are\nmolecular truthbearers, such as subjunctives and counterfactuals, that\ntend to provoke the funny-fact objection but cannot be handled by\nsimple truth-conditional clauses, because their truth-values do not\nseem to be determined by the truth-values of their elementary\nconstituents. (c) Are there universal facts corresponding to\ntrue universal generalizations? Wittgenstein (1921) disapproves of\nuniversal facts; apparently, he wants to re-analyze universal\ngeneralizations as infinite conjunctions of their instances. Russell\n(1918) and Armstrong (1997, 2004) reject this analysis; they admit\nuniversal facts. (d) Negative truths are the most notorious\nproblem case, because they clash with an appealing principle, the\n“truthmaker principle” (cf. Section 8.5), which says that\nfor every truth there must be something in the world that makes it\ntrue, i.e., every true truthbearer must have a truthmaker. Suppose\n‘p’ is elementary. On the account given above,\n‘not-p’ is true iff ‘p’ is\nfalse iff ‘p’ does not correspond to any fact;\nhence, ‘not-p’, if true, is not made true by any\nfact: it does not seem to have a truthmaker. Russell finds himself\ndriven to admit negative facts, regarded by many as paradigmatically\ndisreputable portions of reality. Wittgenstein sometimes talks of\natomic facts that do not exist and calls their very nonexistence a\nnegative fact (cf. 1921, 2.06)—but this is hardly an atomic fact\nitself. Armstrong (1997, chap. 8.7; 2004, chaps. 5-6) holds that\nnegative truths are made true by a second-order “totality\nfact” which says of all the (positive) first-order facts that\nthey are all the first-order facts.\n\nAtomism and the Russellian view of propositions (see\nSection 6). By the time Russell advocated logical atomism (around\n1918), he had given up on what is now referred to as the Russellian\nconception of propositions (which he and G. E. Moore held around\n1903). But Russellian propositons are popular nowadays. Note that\nlogical atomism is not for the friends of Russellian\npropositions. The argument is straightforward. We have logically\ncomplex beliefs some of which are true. According to the friends of\nRussellian propositions, the contents of our beliefs are Russellian\npropositions, and the contents of our true beliefs are true Russellian\npropositions. Since true Russellian propositions are facts, there must\nbe at least as many complex facts as there are true beliefs with\ncomplex contents (and at least as many complex states of affairs as\nthere are true or false beliefs with complex contents). Atomism may\nwork for sentences, public or mental, and for Fregean propositions;\nbut not for Russellian propositions.\n\n\nLogical atomism is designed to address objections to funny facts\n(3.F1). It is not designed to address objections to facts in general\n(3.F2). Here logical atomists will respond by defending (atomic)\nfacts.  According to one defense, facts are needed because mere\nobjects are not sufficiently articulated to serve as\ntruthmakers. If a were the sole truthmaker of\n‘a is F’, then the latter should imply\n‘a is G’, for any\n‘G’. So the truthmaker for ‘a\nis F’ needs at least to involve a\nand Fness. But since Fness is a universal, it could\nbe instantiated in another object, b, hence the mere\nexistence of a and Fness is not sufficient for\nmaking true the claim ‘a\nis F’: a and Fness need to be tied\ntogether in the fact of a’s being F. Armstrong (1997)\nand Olson (1987) also maintain that facts are needed to make sense of\nthe tie that binds particular objects to universals.\n\n\nIn this context it is usually emphasized that facts do not\nsupervene on, hence, are not reducible to, their constituents.\nFacts are entities over and above the particulars and\nuniversals of which they are composed: a’s loving b\nand b’s loving a are not the same fact even though they\nhave the very same constituents.\n\n\nAnother defense of facts, surprisingly rare, would point out that many\nfacts are observable: one can see that the cat is on the mat;\nand this is different from seeing the cat, or the mat, or both. The\nobjection that many facts are not observable would invite the\nrejoinder that many objects are not observable either. (See Austin\n1961, Vendler 1967, chap. 5, and Vision 2004, chap. 3, for more\ndiscussion of anti-fact arguments; see also the\nentry facts in this encyclopedia.)\n\n\nSome atomists propose an atomistic version of definition (1), but\nwithout facts, because they regard facts as slices of reality too\nsuspiciously sentence-like to be taken with full ontological\nseriousness. Instead, they propose events and/or objects-plus-tropes\n(a.k.a. modes, particularized qualities, moments) as the corresponding\nportions of reality. It is claimed that these items are more\n“thingy” than facts but still sufficiently\narticulated—and sufficiently abundant—to serve as adequate\ntruthmakers (cf. Mulligan, Simons, and Smith 1984).\n",
    "section_title": "7.1 Logical Atomism",
    "entry_title": "The Correspondence Theory of Truth",
    "hierarchy_title": "The Correspondence Theory of Truth || Modified Versions of the Correspondence Theory || Logical Atomism",
    "tokenized_text": [
        "modified",
        "version",
        "correspondence",
        "theory",
        "logical",
        "atomism",
        "logical",
        "atomism",
        "wittgenstein",
        "russell",
        "propose",
        "modified",
        "factbased",
        "correspondence",
        "account",
        "truth",
        "part",
        "program",
        "logical",
        "atomism",
        "account",
        "proceed",
        "two",
        "stage",
        "first",
        "stage",
        "basic",
        "truthdefinition",
        "say",
        "section",
        "restricted",
        "special",
        "subclass",
        "truthbearers",
        "socalled",
        "elementary",
        "atomic",
        "truthbearers",
        "whose",
        "truth",
        "said",
        "consist",
        "correspondence",
        "atomic",
        "fact",
        "x",
        "elementary",
        "x",
        "true",
        "iff",
        "x",
        "corresponds",
        "atomic",
        "fact",
        "restricted",
        "definition",
        "serf",
        "baseclause",
        "truthconditional",
        "recursionclauses",
        "given",
        "second",
        "stage",
        "truthvalues",
        "nonelementary",
        "molecular",
        "truthbearers",
        "explained",
        "recursively",
        "term",
        "logical",
        "structure",
        "truthvalues",
        "simpler",
        "constituent",
        "example",
        "sentence",
        "form",
        "notp",
        "true",
        "iff",
        "p",
        "false",
        "sentence",
        "form",
        "p",
        "q",
        "true",
        "iff",
        "p",
        "true",
        "q",
        "true",
        "sentence",
        "form",
        "p",
        "q",
        "true",
        "iff",
        "p",
        "true",
        "q",
        "true",
        "etc",
        "recursive",
        "clause",
        "called",
        "truth",
        "condition",
        "reapplied",
        "truth",
        "nonelementary",
        "molecular",
        "sentence",
        "arbitrary",
        "complexity",
        "reduced",
        "truth",
        "falsehood",
        "elementary",
        "atomic",
        "constituent",
        "logical",
        "atomism",
        "exploit",
        "familiar",
        "rule",
        "enshrined",
        "truthtables",
        "evaluating",
        "complex",
        "formula",
        "basis",
        "simpler",
        "constituent",
        "rule",
        "understood",
        "two",
        "different",
        "way",
        "tracing",
        "ontological",
        "relation",
        "complex",
        "fact",
        "constituent",
        "simpler",
        "fact",
        "b",
        "tracing",
        "logicosemantic",
        "relation",
        "exhibiting",
        "truthvalues",
        "complex",
        "sentence",
        "explained",
        "term",
        "logical",
        "relation",
        "simpler",
        "constituent",
        "sentence",
        "together",
        "correspondence",
        "noncorrespondence",
        "simple",
        "elementary",
        "sentence",
        "atomic",
        "fact",
        "logical",
        "atomism",
        "take",
        "option",
        "b",
        "logical",
        "atomism",
        "designed",
        "go",
        "ontological",
        "view",
        "world",
        "totality",
        "atomic",
        "fact",
        "cf",
        "wittgenstein",
        "thus",
        "accommodating",
        "objection",
        "f",
        "without",
        "funny",
        "fact",
        "atomic",
        "fact",
        "fact",
        "arealthough",
        "reallife",
        "atomists",
        "tend",
        "allow",
        "conjunctive",
        "fact",
        "regarding",
        "mere",
        "aggregate",
        "atomic",
        "fact",
        "elementary",
        "truth",
        "true",
        "corresponds",
        "atomic",
        "fact",
        "correspondence",
        "still",
        "isomorphism",
        "hold",
        "exclusively",
        "elementary",
        "truth",
        "atomic",
        "fact",
        "match",
        "truth",
        "fact",
        "level",
        "nonelementary",
        "molecular",
        "truth",
        "eg",
        "p",
        "p",
        "q",
        "p",
        "r",
        "might",
        "true",
        "merely",
        "p",
        "corresponds",
        "fact",
        "trick",
        "avoiding",
        "logically",
        "complex",
        "fact",
        "lie",
        "assigning",
        "entity",
        "logical",
        "constant",
        "logical",
        "complexity",
        "idea",
        "go",
        "belongs",
        "structure",
        "language",
        "andor",
        "thought",
        "feature",
        "world",
        "expressed",
        "wittgenstein",
        "often",
        "quoted",
        "passage",
        "fundamental",
        "idea",
        "logical",
        "constant",
        "representative",
        "representative",
        "logic",
        "fact",
        "also",
        "russell",
        "p",
        "f",
        "must",
        "look",
        "real",
        "world",
        "object",
        "call",
        "say",
        "look",
        "though",
        "account",
        "sort",
        "naturally",
        "classified",
        "version",
        "correspondence",
        "theory",
        "noted",
        "strictly",
        "speaking",
        "conflict",
        "basic",
        "form",
        "presented",
        "section",
        "according",
        "logical",
        "atomism",
        "case",
        "every",
        "truth",
        "corresponding",
        "fact",
        "however",
        "still",
        "case",
        "true",
        "every",
        "truth",
        "explained",
        "term",
        "correspondence",
        "fact",
        "noncorrespondence",
        "fact",
        "together",
        "case",
        "molecular",
        "truth",
        "logical",
        "notion",
        "detailing",
        "logical",
        "structure",
        "complex",
        "truthbearers",
        "logical",
        "atomism",
        "attempt",
        "avoid",
        "commitment",
        "logically",
        "complex",
        "funny",
        "fact",
        "via",
        "structural",
        "analysis",
        "truthbearers",
        "confused",
        "superficially",
        "similar",
        "account",
        "maintaining",
        "molecular",
        "fact",
        "ultimately",
        "constituted",
        "atomic",
        "fact",
        "latter",
        "account",
        "would",
        "admit",
        "complex",
        "fact",
        "offering",
        "ontological",
        "analysis",
        "structure",
        "would",
        "thus",
        "compatible",
        "basic",
        "form",
        "presented",
        "section",
        "would",
        "compatible",
        "claim",
        "every",
        "truth",
        "corresponding",
        "fact",
        "classical",
        "logical",
        "atomism",
        "see",
        "wisdom",
        "urmson",
        "entry",
        "russell",
        "s",
        "logical",
        "atomism",
        "wittgenstein",
        "s",
        "logical",
        "atomism",
        "encyclopedia",
        "wittgenstein",
        "russell",
        "seem",
        "held",
        "constituent",
        "atomic",
        "fact",
        "determined",
        "basis",
        "priori",
        "consideration",
        "armstrong",
        "advocate",
        "posteriori",
        "form",
        "logical",
        "atomism",
        "view",
        "atomic",
        "fact",
        "composed",
        "particular",
        "simple",
        "universal",
        "property",
        "relation",
        "latter",
        "objective",
        "feature",
        "world",
        "ground",
        "objective",
        "resemblance",
        "particular",
        "explain",
        "causal",
        "power",
        "accordingly",
        "particular",
        "universal",
        "determined",
        "basis",
        "total",
        "science",
        "problem",
        "logical",
        "atomism",
        "easy",
        "sustain",
        "rarely",
        "held",
        "pure",
        "form",
        "among",
        "difficulty",
        "following",
        "exactly",
        "elementary",
        "truthbearers",
        "determined",
        "b",
        "molecular",
        "truthbearers",
        "subjunctive",
        "counterfactuals",
        "tend",
        "provoke",
        "funnyfact",
        "objection",
        "handled",
        "simple",
        "truthconditional",
        "clause",
        "truthvalues",
        "seem",
        "determined",
        "truthvalues",
        "elementary",
        "constituent",
        "c",
        "universal",
        "fact",
        "corresponding",
        "true",
        "universal",
        "generalization",
        "wittgenstein",
        "disapproves",
        "universal",
        "fact",
        "apparently",
        "want",
        "reanalyze",
        "universal",
        "generalization",
        "infinite",
        "conjunction",
        "instance",
        "russell",
        "armstrong",
        "reject",
        "analysis",
        "admit",
        "universal",
        "fact",
        "negative",
        "truth",
        "notorious",
        "problem",
        "case",
        "clash",
        "appealing",
        "principle",
        "truthmaker",
        "principle",
        "cf",
        "section",
        "say",
        "every",
        "truth",
        "must",
        "something",
        "world",
        "make",
        "true",
        "ie",
        "every",
        "true",
        "truthbearer",
        "must",
        "truthmaker",
        "suppose",
        "p",
        "elementary",
        "account",
        "given",
        "notp",
        "true",
        "iff",
        "p",
        "false",
        "iff",
        "p",
        "correspond",
        "fact",
        "hence",
        "notp",
        "true",
        "made",
        "true",
        "fact",
        "seem",
        "truthmaker",
        "russell",
        "find",
        "driven",
        "admit",
        "negative",
        "fact",
        "regarded",
        "many",
        "paradigmatically",
        "disreputable",
        "portion",
        "reality",
        "wittgenstein",
        "sometimes",
        "talk",
        "atomic",
        "fact",
        "exist",
        "call",
        "nonexistence",
        "negative",
        "fact",
        "cf",
        "but",
        "hardly",
        "atomic",
        "fact",
        "armstrong",
        "chap",
        "chap",
        "hold",
        "negative",
        "truth",
        "made",
        "true",
        "secondorder",
        "totality",
        "fact",
        "say",
        "positive",
        "firstorder",
        "fact",
        "firstorder",
        "fact",
        "atomism",
        "russellian",
        "view",
        "proposition",
        "see",
        "section",
        "time",
        "russell",
        "advocated",
        "logical",
        "atomism",
        "around",
        "given",
        "referred",
        "russellian",
        "conception",
        "proposition",
        "g",
        "e",
        "moore",
        "held",
        "around",
        "russellian",
        "propositons",
        "popular",
        "nowadays",
        "note",
        "logical",
        "atomism",
        "friend",
        "russellian",
        "proposition",
        "argument",
        "straightforward",
        "logically",
        "complex",
        "belief",
        "true",
        "according",
        "friend",
        "russellian",
        "proposition",
        "content",
        "belief",
        "russellian",
        "proposition",
        "content",
        "true",
        "belief",
        "true",
        "russellian",
        "proposition",
        "since",
        "true",
        "russellian",
        "proposition",
        "fact",
        "must",
        "least",
        "many",
        "complex",
        "fact",
        "true",
        "belief",
        "complex",
        "content",
        "least",
        "many",
        "complex",
        "state",
        "affair",
        "true",
        "false",
        "belief",
        "complex",
        "content",
        "atomism",
        "may",
        "work",
        "sentence",
        "public",
        "mental",
        "fregean",
        "proposition",
        "russellian",
        "proposition",
        "logical",
        "atomism",
        "designed",
        "address",
        "objection",
        "funny",
        "fact",
        "f",
        "designed",
        "address",
        "objection",
        "fact",
        "general",
        "f",
        "logical",
        "atomists",
        "respond",
        "defending",
        "atomic",
        "fact",
        "according",
        "one",
        "defense",
        "fact",
        "needed",
        "mere",
        "object",
        "sufficiently",
        "articulated",
        "serve",
        "truthmakers",
        "sole",
        "truthmaker",
        "f",
        "latter",
        "imply",
        "g",
        "g",
        "truthmaker",
        "f",
        "need",
        "least",
        "involve",
        "fness",
        "since",
        "fness",
        "universal",
        "could",
        "instantiated",
        "another",
        "object",
        "b",
        "hence",
        "mere",
        "existence",
        "fness",
        "sufficient",
        "making",
        "true",
        "claim",
        "f",
        "fness",
        "need",
        "tied",
        "together",
        "fact",
        "f",
        "armstrong",
        "olson",
        "also",
        "maintain",
        "fact",
        "needed",
        "make",
        "sense",
        "tie",
        "bind",
        "particular",
        "object",
        "universal",
        "context",
        "usually",
        "emphasized",
        "fact",
        "supervene",
        "hence",
        "reducible",
        "constituent",
        "fact",
        "entity",
        "particular",
        "universal",
        "composed",
        "loving",
        "b",
        "b",
        "loving",
        "fact",
        "even",
        "though",
        "constituent",
        "another",
        "defense",
        "fact",
        "surprisingly",
        "rare",
        "would",
        "point",
        "many",
        "fact",
        "observable",
        "one",
        "see",
        "cat",
        "mat",
        "different",
        "seeing",
        "cat",
        "mat",
        "objection",
        "many",
        "fact",
        "observable",
        "would",
        "invite",
        "rejoinder",
        "many",
        "object",
        "observable",
        "either",
        "see",
        "austin",
        "vendler",
        "chap",
        "vision",
        "chap",
        "discussion",
        "antifact",
        "argument",
        "see",
        "also",
        "entry",
        "fact",
        "encyclopedia",
        "atomists",
        "propose",
        "atomistic",
        "version",
        "definition",
        "without",
        "fact",
        "regard",
        "fact",
        "slice",
        "reality",
        "suspiciously",
        "sentencelike",
        "taken",
        "full",
        "ontological",
        "seriousness",
        "instead",
        "propose",
        "event",
        "andor",
        "objectsplustropes",
        "aka",
        "mode",
        "particularized",
        "quality",
        "moment",
        "corresponding",
        "portion",
        "reality",
        "claimed",
        "item",
        "thingy",
        "fact",
        "still",
        "sufficiently",
        "articulatedand",
        "sufficiently",
        "abundantto",
        "serve",
        "adequate",
        "truthmakers",
        "cf",
        "mulligan",
        "simon",
        "smith"
    ]
}