{
    "main_text": "The Epistemological Problem\n2. The Epistemological Problem\n\nThe quest to nail down a viable concept of truthlikeness is motivated,\nat least in part, by fallibilism (§1.1). It is certainly true\nthat a viable notion of distance from the truth\nrenders progress in an inquiry through a succession of false\ntheories at least possible. It is also true that if there is no such\nviable notion, then truth can be retained as the goal of inquiry only\nat the cost of making partial progress towards it virtually\nimpossible. But does the mere possibility of making progress\ntowards the truth improve our epistemic lot? Some have argued that it\ndoesn’t (see for example Laudan 1977, Cohen 1980, Newton-Smith\n1981). One common argument can be recast in the form of a simple\ndilemma. Either we can ascertain the truth, or we can’t. If we\ncan ascertain the truth then we do not need a concept of truthlikeness\n– it is an entirely useless addition to our intellectual\nrepertoire. But if we cannot ascertain the truth, then we cannot\nascertain the degree of truthlikeness of our theories either. So\nagain, the concept is useless for all practical purposes. (See the\nentry on\n scientific progress,\n especially §2.4.)\n\nConsider the second horn of this dilemma. Is it true that if we\ncan’t know what the (whole) truth of some matter is, we also\ncannot ascertain whether or not we are making progress towards it?\nSuppose you are interested in the truth about the weather tomorrow.\nSuppose you learn (from a highly reliable source) that it will be hot.\nEven though you don’t know the whole truth about the\nweather tomorrow, you do know that you have added a truth to your\nexisting corpus of weather beliefs. One does not need to be able to\nascertain the whole truth to ascertain some less-encompassing truths.\nAnd it seems to follow that you can also know you have made at least\nsome progress towards the whole weather truth.\n\nThis rebuttal is too swift. It presupposes that the addition of a new\ntruth \\(A\\) to an existing corpus \\(K\\) guarantees that your revised\nbelief \\(K\\)*\\(A\\) constitutes progress towards the truth. But whether\nor not \\(K\\)*\\(A\\) is closer to the truth than \\(K\\) depends not only\non a theory of truthlikeness but also on a theory of belief revision.\n(See also the entry on the\n logic of belief revision.)\n\nLet’s consider a simple case. Suppose \\(A\\) is some newly\ndiscovered truth, and that \\(A\\) is compatible with \\(K\\). Assume that\nbelief revision in such cases is simply a matter of so-called\nexpansion – i.e., conjoining \\(A\\) to \\(K\\). Consider\nthe case in which \\(K\\) also happens to be true. Then any account of\ntruthlikeness that endorses the value of content for truths (e.g.\nNiiniluoto’s min-sum-average) guarantees that\n\\(K\\)*\\(A\\) is closer to the truth than \\(K\\). That’s a welcome\nresult, but it has rather limited application. Typically one\ndoesn’t know that \\(K\\) is true: so even if one knows that \\(A\\)\nis true, one cannot use this fact to celebrate progress.\n\nThe situation is more dire when it comes to falsehoods. If \\(K\\) is in\nfact false then, without the disastrous principle of the value of\ncontent for falsehoods, there is certainly no guarantee that\n\\(K\\)*\\(A\\) will constitute a step toward the truth. (And even if one\nendorsed the disastrous principle one would hardly be better off. For\nthen the addition of any proposition, whether true or false, would\nconstitute an improvement on a false theory.) Consider again the\nnumber of the planets, \\(N\\). Suppose that the truth is N\\(=8\\), and\nthat your existing corpus \\(K\\) is (\\(N=7 \\vee N=100)\\). Suppose you\nsomehow acquire the truth \\(A\\): \\(N\\gt 7\\). Then \\(K\\)*\\(A\\) is\n\\(N=100\\), which (on average, min-max-average and\nmin-sum-average) is further from the truth than \\(K\\). So\nrevising a false theory by adding truths by no means guarantees\nprogress towards the truth.\n\nFor theories that reject the value of content for truths (e.g., the\naverage proposal) the situation is worse still. Even if \\(K\\)\nhappens to be true, there is no guarantee that expanding \\(K\\) with\ntruths will constitute progress. Of course, there will be certain\ngeneral conditions under which the value of content for truths holds.\nFor example, on the average proposal, the expansion of a true\n\\(K\\) by an atomic truth (or, more generally, by a convex truth) will\nguarantee progress toward the truth.\n\nSo under very special conditions, one can know that the acquisition of\na truth will enhance the overall truthlikeness of one’s\ntheories, but these conditions are exceptionally narrow and provide at\nbest a very weak defense against the dilemma. (See Niiniluoto 2011.\nFor rather more optimistic views of the relation between truthlikeness\nand belief revision see Kuipers 2000, Lavalette, Renardel & Zwart\n2011, Cevolani, Crupi and Festa 2011, and Cevolani, Festa and Kuipers\n2013.)\n\nA different tack is to deny that a concept is useless if there is no\neffective empirical decision procedure for ascertaining whether it\napplies. For even if we cannot know for sure what the value of a\ncertain unobservable magnitude is, we might well have better or worse\nestimates of the value of the magnitude on the evidence. And\nthat may be all we need for the concept to be of practical value.\nConsider, for example, the propensity of a certain coin-tossing set-up\nto produce heads – a magnitude which, for the sake of the\nexample, we assume to be not directly observable. Any non-extreme\nvalue of this magnitude is compatible with any number of heads in a\nsequence of \\(n\\) tosses. So we can never know with certainty what the\nactual propensity is, no matter how many tosses we observe. But we can\ncertainly make rational estimates of the propensity on the basis of\nthe accumulating evidence. Suppose one’s initial state of\nignorance of the propensity is represented by an even distribution of\ncredences over the space of possibilities for the propensity (i.e.,\nthe unit interval). Using Bayes theorem and the Principal Principle,\nafter a fairly small number of tosses we can become quite confident\nthat the propensity lies in a small interval around the observed\nrelative frequency. Our best estimate of the value of the\nmagnitude is its expected value on the evidence.\n\nSimilarly, suppose we don’t and perhaps cannot know which\nconstituent is in fact true. But suppose that we do have a good\nmeasure of distance between constituents (or the elements of some\nsalient partition of the space) \\(C_i\\) and we have selected the right\nextension function. So we have a measure \\(TL(A\\mid C_i)\\)of the\ntruthlikeness of a proposition \\(A\\) given that constituent \\(C_i\\) is\ntrue. Provided we also have a measure of epistemic probability \\(P\\)\n(where \\(P(C_i\\mid e)\\) is the degree of rational credence in \\(C_i\\)\ngiven evidence \\(e)\\) we also have a measure of the expected\ndegree of truthlikeness of \\(A\\) on the evidence (call this\n\\(\\mathbf{E}TL(A\\mid e))\\) which we can identify with the best\nepistemic estimate of truthlikeness. (Niiniluoto, who first explored\nthis concept in his 1977, calls the epistemic estimate of degree of\ntruthlikeness on the evidence, or expected degree of truthlikeness,\nverisimilitude. Since verisimilitude is typically\ntaken to be a synonym for truthlikeness, we will not follow\nhim in this, and will stick instead with expected\ntruthlikeness for the epistemic notion. See also Maher\n(1993).) \n\\[ \\mathbf{E}TL(A\\mid e) = \\sum_i TL(A\\mid C_i)\\times P(C_i \\mid e). \\]\n\n\nClearly, the expected degree of truthlikeness of a proposition \\(is\\)\nepistemically accessible, and it can serve as our best empirical\nestimate of the objective degree of truthlikeness. Progress occurs in\nan inquiry when actual truthlikeness increases. And apparent progress\noccurs when the expected degree of truthlikeness increases. (See the\nentry on\n scientific progress,\n §2.5.) This notion of expected truthlikeness is comparable to,\nbut sharply different from, that of epistemic probability: the\nsupplement on\n Expected Truthlikeness\n discusses some instructive differences between the two concepts.\n\nWith this proposal, Niiniluoto also made a connection with the\napplication of decision theory to epistemology. Decision theory is an\naccount of what it is rational to do in light of one’s beliefs\nand desires. One’s goal, it is assumed, is to maximize utility.\nBut given that one does not have perfect information about the state\nof the world, one cannot know for sure how to accomplish that. Given\nuncertainty, the rule to maximize utility or value cannot be applied\nin normal circumstances. So under conditions of uncertainty, what it\nis rational to do, according to the theory, is to maximize\nsubjective expected utility. Starting with Hempel’s\nclassic 1960 essay, epistemologists conjectured that\ndecision-theoretic tools might be applied to the problem of theory\nacceptance – which hypothesis it is rational to accept\non the basis of the total available evidence to hand. But, as Hempel\nargued, the values or utilities involved in a decision to accept a\nhypothesis cannot be simply regular practical values. These are\ntypically thought to be generated by one’s desires for various\nstates of affairs to obtain in the world. But the fact that one would\nvery much like a certain favored hypothesis to be true does not\nincrease the cognitive value of accepting that hypothesis.\n\nThis much is clear: the utilities should reflect the value or disvalue\nwhich the different outcomes have from the point of view of pure\nscientific research rather than the practical advantages or\ndisadvantages that might result from the application of an accepted\nhypothesis, according as the latter is true or false. Let me refer to\nthe kind of utilities thus vaguely characterized as purely scientific,\nor epistemic, utilities. (Hempel 1960, 465)\n\n\nIf we had a decent theory of epistemic utility (also known as\ncognitive utility or cognitive value), perhaps what\nhypotheses one ought to accept, or what experiments one ought to\nperform, or how one ought to revise one’s corpus of belief in\nthe light of new information, could be determined by the rule:\nmaximize expected epistemic utility (or maximize expected cognitive\nvalue). Thus decision-theoretic epistemology was born.\n\nHempel went on to ask what epistemic utilities are implied in the\nstandard conception of scientific inquiry –\n“…construing the proverbial ’pursuit of\ntruth’ in science as aimed at the establishment of a maximal\nsystem of true statements…” Hempel (1960), p 465)\n\nAlready we have here the germ of the idea central to the truthlikeness\nprogram: that the goal of an inquiry is to end up accepting (or\n“establishing”) the theory that yields the whole truth of\nsome matter. It is interesting that, around the same time that Popper\nwas trying to articulate a content-based account of truthlikeness,\nHempel was attempting to characterize partial fulfillment of the goal\n(that is, of maximally contentful truth) in terms of some combination\nof truth and content. These decision-theoretic considerations lead\nnaturally to a brief consideration of the axiological problem of\ntruthlikeness.\n",
    "section_title": "2. The Epistemological Problem",
    "entry_title": "Truthlikeness",
    "hierarchy_title": "Truthlikeness || The Epistemological Problem",
    "tokenized_text": [
        "epistemological",
        "problem",
        "epistemological",
        "problem",
        "quest",
        "nail",
        "viable",
        "concept",
        "truthlikeness",
        "motivated",
        "least",
        "part",
        "fallibilism",
        "certainly",
        "true",
        "viable",
        "notion",
        "distance",
        "truth",
        "render",
        "progress",
        "inquiry",
        "succession",
        "false",
        "theory",
        "least",
        "possible",
        "also",
        "true",
        "viable",
        "notion",
        "truth",
        "retained",
        "goal",
        "inquiry",
        "cost",
        "making",
        "partial",
        "progress",
        "towards",
        "virtually",
        "impossible",
        "mere",
        "possibility",
        "making",
        "progress",
        "towards",
        "truth",
        "improve",
        "epistemic",
        "lot",
        "argued",
        "see",
        "example",
        "laudan",
        "cohen",
        "newtonsmith",
        "one",
        "common",
        "argument",
        "recast",
        "form",
        "simple",
        "dilemma",
        "either",
        "ascertain",
        "truth",
        "ascertain",
        "truth",
        "need",
        "concept",
        "truthlikeness",
        "entirely",
        "useless",
        "addition",
        "intellectual",
        "repertoire",
        "ascertain",
        "truth",
        "ascertain",
        "degree",
        "truthlikeness",
        "theory",
        "either",
        "concept",
        "useless",
        "practical",
        "purpose",
        "see",
        "entry",
        "scientific",
        "progress",
        "especially",
        "consider",
        "second",
        "horn",
        "dilemma",
        "true",
        "know",
        "whole",
        "truth",
        "matter",
        "also",
        "ascertain",
        "whether",
        "making",
        "progress",
        "towards",
        "suppose",
        "interested",
        "truth",
        "weather",
        "tomorrow",
        "suppose",
        "learn",
        "highly",
        "reliable",
        "source",
        "hot",
        "even",
        "though",
        "know",
        "whole",
        "truth",
        "weather",
        "tomorrow",
        "know",
        "added",
        "truth",
        "existing",
        "corpus",
        "weather",
        "belief",
        "one",
        "need",
        "able",
        "ascertain",
        "whole",
        "truth",
        "ascertain",
        "lessencompassing",
        "truth",
        "seems",
        "follow",
        "also",
        "know",
        "made",
        "least",
        "progress",
        "towards",
        "whole",
        "weather",
        "truth",
        "rebuttal",
        "swift",
        "presupposes",
        "addition",
        "new",
        "truth",
        "a",
        "existing",
        "corpus",
        "k",
        "guarantee",
        "revised",
        "belief",
        "k",
        "a",
        "constitutes",
        "progress",
        "towards",
        "truth",
        "whether",
        "k",
        "a",
        "closer",
        "truth",
        "k",
        "depends",
        "theory",
        "truthlikeness",
        "also",
        "theory",
        "belief",
        "revision",
        "see",
        "also",
        "entry",
        "logic",
        "belief",
        "revision",
        "let",
        "consider",
        "simple",
        "case",
        "suppose",
        "a",
        "newly",
        "discovered",
        "truth",
        "a",
        "compatible",
        "k",
        "assume",
        "belief",
        "revision",
        "case",
        "simply",
        "matter",
        "socalled",
        "expansion",
        "ie",
        "conjoining",
        "a",
        "k",
        "consider",
        "case",
        "k",
        "also",
        "happens",
        "true",
        "account",
        "truthlikeness",
        "endorses",
        "value",
        "content",
        "truth",
        "eg",
        "niiniluoto",
        "minsumaverage",
        "guarantee",
        "k",
        "a",
        "closer",
        "truth",
        "k",
        "welcome",
        "result",
        "rather",
        "limited",
        "application",
        "typically",
        "one",
        "know",
        "k",
        "true",
        "even",
        "one",
        "know",
        "a",
        "true",
        "one",
        "use",
        "fact",
        "celebrate",
        "progress",
        "situation",
        "dire",
        "come",
        "falsehood",
        "k",
        "fact",
        "false",
        "without",
        "disastrous",
        "principle",
        "value",
        "content",
        "falsehood",
        "certainly",
        "guarantee",
        "k",
        "a",
        "constitute",
        "step",
        "toward",
        "truth",
        "even",
        "one",
        "endorsed",
        "disastrous",
        "principle",
        "one",
        "would",
        "hardly",
        "better",
        "addition",
        "proposition",
        "whether",
        "true",
        "false",
        "would",
        "constitute",
        "improvement",
        "false",
        "theory",
        "consider",
        "number",
        "planet",
        "n",
        "suppose",
        "truth",
        "n",
        "existing",
        "corpus",
        "k",
        "n",
        "vee",
        "n",
        "suppose",
        "somehow",
        "acquire",
        "truth",
        "a",
        "ngt",
        "k",
        "a",
        "n",
        "average",
        "minmaxaverage",
        "minsumaverage",
        "truth",
        "k",
        "revising",
        "false",
        "theory",
        "adding",
        "truth",
        "mean",
        "guarantee",
        "progress",
        "towards",
        "truth",
        "theory",
        "reject",
        "value",
        "content",
        "truth",
        "eg",
        "average",
        "proposal",
        "situation",
        "worse",
        "still",
        "even",
        "k",
        "happens",
        "true",
        "guarantee",
        "expanding",
        "k",
        "truth",
        "constitute",
        "progress",
        "course",
        "certain",
        "general",
        "condition",
        "value",
        "content",
        "truth",
        "hold",
        "example",
        "average",
        "proposal",
        "expansion",
        "true",
        "k",
        "atomic",
        "truth",
        "generally",
        "convex",
        "truth",
        "guarantee",
        "progress",
        "toward",
        "truth",
        "special",
        "condition",
        "one",
        "know",
        "acquisition",
        "truth",
        "enhance",
        "overall",
        "truthlikeness",
        "one",
        "theory",
        "condition",
        "exceptionally",
        "narrow",
        "provide",
        "best",
        "weak",
        "defense",
        "dilemma",
        "see",
        "niiniluoto",
        "rather",
        "optimistic",
        "view",
        "relation",
        "truthlikeness",
        "belief",
        "revision",
        "see",
        "kuiper",
        "lavalette",
        "renardel",
        "zwart",
        "cevolani",
        "crupi",
        "festa",
        "cevolani",
        "festa",
        "kuiper",
        "different",
        "tack",
        "deny",
        "concept",
        "useless",
        "effective",
        "empirical",
        "decision",
        "procedure",
        "ascertaining",
        "whether",
        "applies",
        "even",
        "know",
        "sure",
        "value",
        "certain",
        "unobservable",
        "magnitude",
        "might",
        "well",
        "better",
        "worse",
        "estimate",
        "value",
        "magnitude",
        "evidence",
        "may",
        "need",
        "concept",
        "practical",
        "value",
        "consider",
        "example",
        "propensity",
        "certain",
        "cointossing",
        "setup",
        "produce",
        "head",
        "magnitude",
        "sake",
        "example",
        "assume",
        "directly",
        "observable",
        "nonextreme",
        "value",
        "magnitude",
        "compatible",
        "number",
        "head",
        "sequence",
        "n",
        "toss",
        "never",
        "know",
        "certainty",
        "actual",
        "propensity",
        "matter",
        "many",
        "toss",
        "observe",
        "certainly",
        "make",
        "rational",
        "estimate",
        "propensity",
        "basis",
        "accumulating",
        "evidence",
        "suppose",
        "one",
        "initial",
        "state",
        "ignorance",
        "propensity",
        "represented",
        "even",
        "distribution",
        "credence",
        "space",
        "possibility",
        "propensity",
        "ie",
        "unit",
        "interval",
        "using",
        "bayes",
        "theorem",
        "principal",
        "principle",
        "fairly",
        "small",
        "number",
        "toss",
        "become",
        "quite",
        "confident",
        "propensity",
        "lie",
        "small",
        "interval",
        "around",
        "observed",
        "relative",
        "frequency",
        "best",
        "estimate",
        "value",
        "magnitude",
        "expected",
        "value",
        "evidence",
        "similarly",
        "suppose",
        "perhaps",
        "know",
        "constituent",
        "fact",
        "true",
        "suppose",
        "good",
        "measure",
        "distance",
        "constituent",
        "element",
        "salient",
        "partition",
        "space",
        "c_i",
        "selected",
        "right",
        "extension",
        "function",
        "measure",
        "tl",
        "amid",
        "c_i",
        "truthlikeness",
        "proposition",
        "a",
        "given",
        "constituent",
        "c_i",
        "true",
        "provided",
        "also",
        "measure",
        "epistemic",
        "probability",
        "p",
        "p",
        "c_imid",
        "e",
        "degree",
        "rational",
        "credence",
        "c_i",
        "given",
        "evidence",
        "e",
        "also",
        "measure",
        "expected",
        "degree",
        "truthlikeness",
        "a",
        "evidence",
        "call",
        "mathbf",
        "e",
        "tl",
        "amid",
        "e",
        "identify",
        "best",
        "epistemic",
        "estimate",
        "truthlikeness",
        "niiniluoto",
        "first",
        "explored",
        "concept",
        "call",
        "epistemic",
        "estimate",
        "degree",
        "truthlikeness",
        "evidence",
        "expected",
        "degree",
        "truthlikeness",
        "verisimilitude",
        "since",
        "verisimilitude",
        "typically",
        "taken",
        "synonym",
        "truthlikeness",
        "follow",
        "stick",
        "instead",
        "expected",
        "truthlikeness",
        "epistemic",
        "notion",
        "see",
        "also",
        "maher",
        "mathbf",
        "e",
        "tl",
        "amid",
        "e",
        "sum_i",
        "tl",
        "amid",
        "c_i",
        "times",
        "p",
        "c_i",
        "mid",
        "e",
        "clearly",
        "expected",
        "degree",
        "truthlikeness",
        "proposition",
        "is",
        "epistemically",
        "accessible",
        "serve",
        "best",
        "empirical",
        "estimate",
        "objective",
        "degree",
        "truthlikeness",
        "progress",
        "occurs",
        "inquiry",
        "actual",
        "truthlikeness",
        "increase",
        "apparent",
        "progress",
        "occurs",
        "expected",
        "degree",
        "truthlikeness",
        "increase",
        "see",
        "entry",
        "scientific",
        "progress",
        "notion",
        "expected",
        "truthlikeness",
        "comparable",
        "sharply",
        "different",
        "epistemic",
        "probability",
        "supplement",
        "expected",
        "truthlikeness",
        "discus",
        "instructive",
        "difference",
        "two",
        "concept",
        "proposal",
        "niiniluoto",
        "also",
        "made",
        "connection",
        "application",
        "decision",
        "theory",
        "epistemology",
        "decision",
        "theory",
        "account",
        "rational",
        "light",
        "one",
        "belief",
        "desire",
        "one",
        "goal",
        "assumed",
        "maximize",
        "utility",
        "given",
        "one",
        "perfect",
        "information",
        "state",
        "world",
        "one",
        "know",
        "sure",
        "accomplish",
        "given",
        "uncertainty",
        "rule",
        "maximize",
        "utility",
        "value",
        "applied",
        "normal",
        "circumstance",
        "condition",
        "uncertainty",
        "rational",
        "according",
        "theory",
        "maximize",
        "subjective",
        "expected",
        "utility",
        "starting",
        "hempel",
        "classic",
        "essay",
        "epistemologist",
        "conjectured",
        "decisiontheoretic",
        "tool",
        "might",
        "applied",
        "problem",
        "theory",
        "acceptance",
        "hypothesis",
        "rational",
        "accept",
        "basis",
        "total",
        "available",
        "evidence",
        "hand",
        "hempel",
        "argued",
        "value",
        "utility",
        "involved",
        "decision",
        "accept",
        "hypothesis",
        "simply",
        "regular",
        "practical",
        "value",
        "typically",
        "thought",
        "generated",
        "one",
        "desire",
        "various",
        "state",
        "affair",
        "obtain",
        "world",
        "fact",
        "one",
        "would",
        "much",
        "like",
        "certain",
        "favored",
        "hypothesis",
        "true",
        "increase",
        "cognitive",
        "value",
        "accepting",
        "hypothesis",
        "much",
        "clear",
        "utility",
        "reflect",
        "value",
        "disvalue",
        "different",
        "outcome",
        "point",
        "view",
        "pure",
        "scientific",
        "research",
        "rather",
        "practical",
        "advantage",
        "disadvantage",
        "might",
        "result",
        "application",
        "accepted",
        "hypothesis",
        "according",
        "latter",
        "true",
        "false",
        "let",
        "refer",
        "kind",
        "utility",
        "thus",
        "vaguely",
        "characterized",
        "purely",
        "scientific",
        "epistemic",
        "utility",
        "hempel",
        "decent",
        "theory",
        "epistemic",
        "utility",
        "also",
        "known",
        "cognitive",
        "utility",
        "cognitive",
        "value",
        "perhaps",
        "hypothesis",
        "one",
        "ought",
        "accept",
        "experiment",
        "one",
        "ought",
        "perform",
        "one",
        "ought",
        "revise",
        "one",
        "corpus",
        "belief",
        "light",
        "new",
        "information",
        "could",
        "determined",
        "rule",
        "maximize",
        "expected",
        "epistemic",
        "utility",
        "maximize",
        "expected",
        "cognitive",
        "value",
        "thus",
        "decisiontheoretic",
        "epistemology",
        "born",
        "hempel",
        "went",
        "ask",
        "epistemic",
        "utility",
        "implied",
        "standard",
        "conception",
        "scientific",
        "inquiry",
        "construing",
        "proverbial",
        "pursuit",
        "truth",
        "science",
        "aimed",
        "establishment",
        "maximal",
        "system",
        "true",
        "statements",
        "hempel",
        "p",
        "already",
        "germ",
        "idea",
        "central",
        "truthlikeness",
        "program",
        "goal",
        "inquiry",
        "end",
        "accepting",
        "establishing",
        "theory",
        "yield",
        "whole",
        "truth",
        "matter",
        "interesting",
        "around",
        "time",
        "popper",
        "trying",
        "articulate",
        "contentbased",
        "account",
        "truthlikeness",
        "hempel",
        "attempting",
        "characterize",
        "partial",
        "fulfillment",
        "goal",
        "maximally",
        "contentful",
        "truth",
        "term",
        "combination",
        "truth",
        "content",
        "decisiontheoretic",
        "consideration",
        "lead",
        "naturally",
        "brief",
        "consideration",
        "axiological",
        "problem",
        "truthlikeness"
    ]
}