{
    "main_text": "Objections to Deflationism || The Explanatory Role of Truth\n4.1 The Explanatory Role of Truth\n\nThe first objection starts from the observation that (a) in certain\ncontexts an appeal to the notion of truth appears to have an\nexplanatory role and (b) deflationism seems to be inconsistent with\nthat appearance. Some of the contexts in which truth seems to have an\nexplanatory role involve philosophical projects, such as the\n theory of meaning\n (which we will consider below) or explaining the nature of\n knowledge.\n In these cases, the notion of explanation at issue is not so much\ncausal as it is conceptual (see Armour-Garb and Woodbridge\nforthcoming, for more on this). But the notion of truth seems also\nsometimes to play a causal explanatory role, especially with\nregard to explaining various kinds of success – mainly the\nsuccess of scientific theories/method (cf. Putnam 1978 and Boyd 1983)\nand of people’s behavior (cf. Putnam 1978 and Field 1987), but\nalso the kind of success involved in learning from others (Field\n1972). The causal-explanatory role that the notion of truth appears to\nplay in accounts of these various kinds of success has seemed to many\nphilosophers to constitute a major problem for deflationism. For\nexample, Putnam (1978, 20–1, 38) claims, “the notions of\n‘truth’ and ‘reference’ have a\ncausal-explanatory role in … an explanation of the\nbehavior of scientists and the success of science”, and\n“the notion of truth can be used in causal explanations –\nthe success of a man’s behavior may, after all, depend on the\nfact that certain of his beliefs are true – and the\nformal logic of ‘true’ [the feature emphasized by\ndeflationism] is not all there is to the notion of\ntruth”.\n\nWhile a few early arguments against deflationism focus on the role of\ntruth in explanations of the success of science (see Williams 1986 and\nFine 1984a, 1984b for deflationary responses to Putnam and Boyd on\nthis), according to Field (1994a, 271), “the most serious worry\nabout deflationism is that it can’t make sense of the\nexplanatory role of truth conditions: e.g., their role in explaining\nbehavior, or their role in explaining the extent to which behavior is\nsuccessful”. While few theorists endorse the thesis that\nexplanations of behavior in general need to appeal to the notion of\ntruth (even a pre-deflationary Field (1987, 84–5) rejects this,\nbut see Devitt 1997, 325–330, for an opposing position),\nexplanations of the latter, i.e., of behavioral success,\nstill typically proceed in terms of an appeal to truth. This poses a\nprima facie challenge to deflationary views. To illustrate\nthe problem, consider the role of the truth-value of an\nindividual’s belief in whether that person succeeds in\nsatisfying her desires. Let us suppose that Mary wants to get to a\nparty, and she believes that it is being held at 1001 Northside\nAvenue. If her belief is true, then, other things being equal, she is\nlikely to get to the party and get what she wants. But suppose that\nher belief is false, and the party is in fact being held at 1001\nSouthside Avenue. Then it would be more likely, other things being\nequal, that she won’t get what she wants. In an example of this\nsort, the truth of her belief seems to be playing a particular role in\nexplaining why she gets what she wants.\n\nAssuming that Mary’s belief is true, and she gets to the party,\nit might seem natural to say that the latter success occurs\nbecause her belief is true, which might seem to pose a\nproblem for deflationists. However, truth-involving explanations of\nparticular instances of success like this don’t really pose a\ngenuine problem. This is because if we are told the specific content\nof the relevant belief, it is possible to replace the apparently\nexplanatory claim that the belief is true with an equivalent claim\nthat does not appeal to truth. In Mary’s particular case, we\ncould replace i) the claim that she believes that the party is being\nheld at 1001 Northside Avenue, and her belief is true, with ii) the\nclaim that she believes that the party is being held at 1001 Northside\nAvenue, and the party \\(is\\) being held at 1001 Northside Avenue. A\ndeflationist can claim that the appeal to truth in the explanation of\nMary’s success just provides an expressive convenience\n(including, perhaps, the convenience of expressing what would\notherwise require an infinite disjunction (of conjunctions like ii)),\nby saying just that what Mary believed was true, if one did not know\nexactly which belief Mary acted on) (cf. Horwich 1998a, 22–3,\n44–6).\n\nWhile deflationists seem to be able to account for appeals to truth in\nexplanations of particular instances of success, the explanatory-role\nchallenge to deflationism also cites the explanatory role that an\nappeal to truth appears to play in explaining the phenomenon of\nbehavioral success more generally. An explanation of this sort might\ntake the following form:\n\n\n[1]\nPeople act (in general) in such a way that their goals will be\nobtained (as well as possible in the given situation), or in such a\nway that their expectations will not be frustrated, …\nif their beliefs are true.\n[2]\nMany beliefs [people have about how to attain their goals]\nare true.\n[3]\nSo, as a consequence of [1] and [2], people have a tendency to\nattain certain kinds of goals. (Putnam 1978, 101)\n\n\n\nThe generality of [1] in this explanation seems to cover more cases\nthan any definite list of actual beliefs that someone has could\ninclude. Moreover, the fact that [1] supports counterfactuals by\napplying to whatever one might possibly believe (about attaining\ngoals) suggests that it is a law-like generalization. If the truth\npredicate played a fundamental role in the expression of an\nexplanatory law, then deflationism would seem to be\nunsustainable.\n\nA standard deflationary response to this line of reasoning involves\nrejecting the thesis that [1] is a law, seeing it (and truth-involving\nclaims like it) instead as functioning similarly to how the claim\n‘What Mary believes is true’ functions in an explanation\nof her particular instance of behavioral success, just expressing an\neven more indefinite, and thus potentially infinite claim. The latter\nis what makes a claim like [1] seem like an explanatory law, but even\nconsidering this indefiniteness, the standard deflationary account of\n[1] claims that the function of the appeal to the notion of truth\nthere is still just to express a kind of generalization. One way to\nbring out this response is to note that, similar to the deflationary\n“infinite disjunction” account of the claim ‘What\nMary believes is true’, generalizations of the kind offered in\n[1] entail infinite conjunctions of their instances, which\nare claims that can be formulated without appeal to truth. For\nexample, in the case of explaining someone, \\(A\\), accomplishing their\ngoal of getting to a party, deflationsts typically claim that the role\nof citing possession of a true belief is really just to express an\ninfinite conjunction with something like the following form:\n\nIf \\(A\\) believes that the party is 1001 Northside Avenue, and the\nparty is at 1001 Northside Avenue, then \\(A\\) will get what they want;\nand if \\(A\\) believes that the party is at 1001 Southside Avenue, and\nthe party is at 1001 Southside Ave, then \\(A\\) will get what they\nwant; and if \\(A\\) believes that party is at 17 Elm St, and the party\nis at 17 Elm St, then \\(A\\) will get what they want; … and so\non.\n\n\nThe equivalence schema (ES) allows one to capture this infinite\nconjunction (of conditionals) in a finite way. For, on the basis of\nthe schema, one can reformulate the infinite conjunction as:\n\nIf \\(A\\) believes that the party is 1001 Northside Avenue, and that\nthe party is 1001 Northside Avenue is true, then \\(A\\) will get what\nthey want; and if \\(A\\) believes that the party is at 1001 Southside\nAvenue, and that the party is at 1001 Southside Avenue is true, then\n\\(A\\) will get what they want, and if \\(A\\) believes that the party is\nat 17 Elm Street, and that the party is at 17 Elm Street is true, then\n\\(A\\) will get what they want; … and so on.\n\n\nIn turn, this (ES)-reformulated infinite conjunction can be expressed\nas a finite statement with a universal quantifier ranging over\npropositions:\n\nFor every proposition \\(x\\), if what \\(A\\) believes \\(= x\\), and \\(x\\)\nis true, then \\(A\\) will get what they want, other things being equal.\n\n\nThe important point for a deflationist is that one could not express\nthe infinite conjunction regarding the agent’s beliefs and\nbehavioral success unless one had the concept of truth. But\ndeflationists also claim that this is all that the notion of truth is\ndoing here and in similar explanations (cf. Leeds 1978, 1995; Williams\n1986, Horwich 1998a).\n\nHow successful is this standard deflationary response? There are\nseveral critiques in the literature. Some (e.g., Damnjanovic 2005)\nargue that there is no distinction in the first place between\nappearing in a causal-explanatory generalization and being a\ncausal-explanatory property. After all, suppose it is a true\ngeneralization that metal objects conduct electricity. That would\nnormally be taken as sufficient to show that being metal is a\ncausal-explanatory property that one can cite in explaining why\nsomething conducts electricity. But isn’t this a counter, then,\nto deflationism’s thesis that, assuming there is a property of\ntruth at all, it is at most an insubstantial one? If a property is a\ncausal or explanatory property, after all, it is hard to view it as\ninsubstantial.\n\nThe reasoning at issue here may be presented conveniently by expanding\non the general argument considered above and proceeding from an\napparently true causal generalization to the falsity of deflationism\n(ibid.):\n\n\nP1.\nIf a person \\(A\\) has true beliefs, they will get what they want,\nother things being equal.\nC1.\nTherefore, if \\(A\\) has beliefs with the property of being true,\n\\(A\\) will get what they want other things being equal.\nC2.\nTherefore, the property of being true appears in a\ncausal-explanatory generalization.\nC3.\nTherefore, the property of being true is a causal-explanatory\nproperty.\nC4.\nTherefore, deflationism is false.\n\n\n\nCan a deflationist apply the standard deflationary response to this\nargument? Doing so would seem to involve rejecting the inference from\nC2 to C3. After all, the standard reply would say that the role that\nthe appeal to truth plays in P1, the apparent causal generalization,\nis simply its generalizing role of expressing a potentially infinite,\ndisjointed conjunction of unrelated causal connections (cf. Leeds\n1995). So, applying this deflationary response basically hinges on the\nplausibility of rejecting the initial assumption that there is no\ndistinction between appearing in a causal-explanatory generalization\nand being a causal-explanatory property.\n\nIt is worth noting two other responses beyond the standard one that a\ndeflationist might make to the reasoning just set out. The first\noption is to deny the step from P1 to C1. This inference involves the\nexplicit introduction of the property of being true, and, as we have\nseen, some deflationists deny that there is a truth property at all\n(cf. Quine 1970 [1986], Grover, et al. 1975, Leeds 1978,\nBrandom 1994). But, as we noted above, the idea that there is no truth\nproperty may be difficult to sustain given the apparent fact that\n‘is true’ functions grammatically as a predicate.\n\nThe second option is to deny the final step from C3 to C4 and concede\nthat there is a sense in which truth is a causal-explanatory property\nand yet say that it is still not a substantive property (cf.\nDamnjanovic 2005). For example, some philosophers (e.g., Friedman\n1974, van Fraassen 1980, Kitcher 1989, Jackson and Pettit 1990) have\noffered different understandings of\n scientific explanation\n and causal explanation, according to which being a causal and\nexplanatory property might not conflict with being insubstantial\n(perhaps by being an abundant or ungroundable property). This might be\nenough to sustain a deflationary position.\n\nThe standard deflationary response to the explanatory-role challenge\nhas also met with criticisms focused on providing explanations of\ncertain “higher-level” phenomena. Philip Kitcher (2002,\n355–60) concludes that Horwich’s (1998a, 22–3)\napplication of the standard response, in his account of how the notion\nof truth functions in explanations of behavioral success, misses the\nmore systematic role that truth plays in explaining patterns\nof successful behavior, such as when mean-ends beliefs flow from a\nrepresentational device, like a map. Chase Wrenn (2011) agrees with\nKitcher that deflationists need to explain systematic as opposed to\njust singular success, but against Kitcher he argues that\ndeflationists are actually better off than inflationists on this\nfront. Will Gamester (2018, 1252–5) raises a different\n“higher-level factor” challenge, one based on the putative\ninability of the standard deflationary account of the role of truth in\nexplanations of behavioral success to distinguish between coincidental\nand non-coincidental success. Gamester (ibid., 1256–7) claims\nthat an inflationist could mark and account for the difference between\nthe two kinds of success with an explanation that appeals to the\nnotion of truth. But it is not clear that a deflationist cannot also\navail herself of a version of this truth-involving explanation, taking\nit just as the way of expressing in natural language what one might\nformally express with sentential variables and quantifiers (cf. Ramsey\n1927, 1929; Prior 1971, Wrenn 2021, and Armour-Garb and Woodbridge\nforthcoming).\n",
    "section_title": "4.1 The Explanatory Role of Truth",
    "entry_title": "Deflationism About Truth",
    "hierarchy_title": "Deflationism About Truth || Objections to Deflationism || The Explanatory Role of Truth",
    "tokenized_text": [
        "objection",
        "deflationism",
        "explanatory",
        "role",
        "truth",
        "explanatory",
        "role",
        "truth",
        "first",
        "objection",
        "start",
        "observation",
        "certain",
        "context",
        "appeal",
        "notion",
        "truth",
        "appears",
        "explanatory",
        "role",
        "b",
        "deflationism",
        "seems",
        "inconsistent",
        "appearance",
        "context",
        "truth",
        "seems",
        "explanatory",
        "role",
        "involve",
        "philosophical",
        "project",
        "theory",
        "meaning",
        "consider",
        "explaining",
        "nature",
        "knowledge",
        "case",
        "notion",
        "explanation",
        "issue",
        "much",
        "causal",
        "conceptual",
        "see",
        "armourgarb",
        "woodbridge",
        "forthcoming",
        "notion",
        "truth",
        "seems",
        "also",
        "sometimes",
        "play",
        "causal",
        "explanatory",
        "role",
        "especially",
        "regard",
        "explaining",
        "various",
        "kind",
        "success",
        "mainly",
        "success",
        "scientific",
        "theoriesmethod",
        "cf",
        "putnam",
        "boyd",
        "people",
        "behavior",
        "cf",
        "putnam",
        "field",
        "also",
        "kind",
        "success",
        "involved",
        "learning",
        "others",
        "field",
        "causalexplanatory",
        "role",
        "notion",
        "truth",
        "appears",
        "play",
        "account",
        "various",
        "kind",
        "success",
        "seemed",
        "many",
        "philosopher",
        "constitute",
        "major",
        "problem",
        "deflationism",
        "example",
        "putnam",
        "claim",
        "notion",
        "truth",
        "reference",
        "causalexplanatory",
        "role",
        "explanation",
        "behavior",
        "scientist",
        "success",
        "science",
        "notion",
        "truth",
        "used",
        "causal",
        "explanation",
        "success",
        "man",
        "behavior",
        "may",
        "depend",
        "fact",
        "certain",
        "belief",
        "true",
        "formal",
        "logic",
        "true",
        "feature",
        "emphasized",
        "deflationism",
        "notion",
        "truth",
        "early",
        "argument",
        "deflationism",
        "focus",
        "role",
        "truth",
        "explanation",
        "success",
        "science",
        "see",
        "williams",
        "fine",
        "a",
        "b",
        "deflationary",
        "response",
        "putnam",
        "boyd",
        "according",
        "field",
        "a",
        "serious",
        "worry",
        "deflationism",
        "make",
        "sense",
        "explanatory",
        "role",
        "truth",
        "condition",
        "eg",
        "role",
        "explaining",
        "behavior",
        "role",
        "explaining",
        "extent",
        "behavior",
        "successful",
        "theorist",
        "endorse",
        "thesis",
        "explanation",
        "behavior",
        "general",
        "need",
        "appeal",
        "notion",
        "truth",
        "even",
        "predeflationary",
        "field",
        "reject",
        "see",
        "devitt",
        "opposing",
        "position",
        "explanation",
        "latter",
        "ie",
        "behavioral",
        "success",
        "still",
        "typically",
        "proceed",
        "term",
        "appeal",
        "truth",
        "pose",
        "prima",
        "facie",
        "challenge",
        "deflationary",
        "view",
        "illustrate",
        "problem",
        "consider",
        "role",
        "truthvalue",
        "individual",
        "belief",
        "whether",
        "person",
        "succeeds",
        "satisfying",
        "desire",
        "let",
        "u",
        "suppose",
        "mary",
        "want",
        "get",
        "party",
        "belief",
        "held",
        "northside",
        "avenue",
        "belief",
        "true",
        "thing",
        "equal",
        "likely",
        "get",
        "party",
        "get",
        "want",
        "suppose",
        "belief",
        "false",
        "party",
        "fact",
        "held",
        "southside",
        "avenue",
        "would",
        "likely",
        "thing",
        "equal",
        "get",
        "want",
        "example",
        "sort",
        "truth",
        "belief",
        "seems",
        "playing",
        "particular",
        "role",
        "explaining",
        "get",
        "want",
        "assuming",
        "mary",
        "belief",
        "true",
        "get",
        "party",
        "might",
        "seem",
        "natural",
        "say",
        "latter",
        "success",
        "occurs",
        "belief",
        "true",
        "might",
        "seem",
        "pose",
        "problem",
        "deflationists",
        "however",
        "truthinvolving",
        "explanation",
        "particular",
        "instance",
        "success",
        "like",
        "really",
        "pose",
        "genuine",
        "problem",
        "told",
        "specific",
        "content",
        "relevant",
        "belief",
        "possible",
        "replace",
        "apparently",
        "explanatory",
        "claim",
        "belief",
        "true",
        "equivalent",
        "claim",
        "appeal",
        "truth",
        "mary",
        "particular",
        "case",
        "could",
        "replace",
        "claim",
        "belief",
        "party",
        "held",
        "northside",
        "avenue",
        "belief",
        "true",
        "ii",
        "claim",
        "belief",
        "party",
        "held",
        "northside",
        "avenue",
        "party",
        "is",
        "held",
        "northside",
        "avenue",
        "deflationist",
        "claim",
        "appeal",
        "truth",
        "explanation",
        "mary",
        "success",
        "provides",
        "expressive",
        "convenience",
        "including",
        "perhaps",
        "convenience",
        "expressing",
        "would",
        "otherwise",
        "require",
        "infinite",
        "disjunction",
        "conjunction",
        "like",
        "ii",
        "saying",
        "mary",
        "believed",
        "true",
        "one",
        "know",
        "exactly",
        "belief",
        "mary",
        "acted",
        "cf",
        "horwich",
        "a",
        "deflationists",
        "seem",
        "able",
        "account",
        "appeal",
        "truth",
        "explanation",
        "particular",
        "instance",
        "success",
        "explanatoryrole",
        "challenge",
        "deflationism",
        "also",
        "cite",
        "explanatory",
        "role",
        "appeal",
        "truth",
        "appears",
        "play",
        "explaining",
        "phenomenon",
        "behavioral",
        "success",
        "generally",
        "explanation",
        "sort",
        "might",
        "take",
        "following",
        "form",
        "people",
        "act",
        "general",
        "way",
        "goal",
        "obtained",
        "well",
        "possible",
        "given",
        "situation",
        "way",
        "expectation",
        "frustrated",
        "belief",
        "true",
        "many",
        "belief",
        "people",
        "attain",
        "goal",
        "true",
        "consequence",
        "people",
        "tendency",
        "attain",
        "certain",
        "kind",
        "goal",
        "putnam",
        "generality",
        "explanation",
        "seems",
        "cover",
        "case",
        "definite",
        "list",
        "actual",
        "belief",
        "someone",
        "could",
        "include",
        "moreover",
        "fact",
        "support",
        "counterfactuals",
        "applying",
        "whatever",
        "one",
        "might",
        "possibly",
        "believe",
        "attaining",
        "goal",
        "suggests",
        "lawlike",
        "generalization",
        "truth",
        "predicate",
        "played",
        "fundamental",
        "role",
        "expression",
        "explanatory",
        "law",
        "deflationism",
        "would",
        "seem",
        "unsustainable",
        "standard",
        "deflationary",
        "response",
        "line",
        "reasoning",
        "involves",
        "rejecting",
        "thesis",
        "law",
        "seeing",
        "truthinvolving",
        "claim",
        "like",
        "instead",
        "functioning",
        "similarly",
        "claim",
        "mary",
        "belief",
        "true",
        "function",
        "explanation",
        "particular",
        "instance",
        "behavioral",
        "success",
        "expressing",
        "even",
        "indefinite",
        "thus",
        "potentially",
        "infinite",
        "claim",
        "latter",
        "make",
        "claim",
        "like",
        "seem",
        "like",
        "explanatory",
        "law",
        "even",
        "considering",
        "indefiniteness",
        "standard",
        "deflationary",
        "account",
        "claim",
        "function",
        "appeal",
        "notion",
        "truth",
        "still",
        "express",
        "kind",
        "generalization",
        "one",
        "way",
        "bring",
        "response",
        "note",
        "similar",
        "deflationary",
        "infinite",
        "disjunction",
        "account",
        "claim",
        "mary",
        "belief",
        "true",
        "generalization",
        "kind",
        "offered",
        "entail",
        "infinite",
        "conjunction",
        "instance",
        "claim",
        "formulated",
        "without",
        "appeal",
        "truth",
        "example",
        "case",
        "explaining",
        "someone",
        "a",
        "accomplishing",
        "goal",
        "getting",
        "party",
        "deflationsts",
        "typically",
        "claim",
        "role",
        "citing",
        "possession",
        "true",
        "belief",
        "really",
        "express",
        "infinite",
        "conjunction",
        "something",
        "like",
        "following",
        "form",
        "a",
        "belief",
        "party",
        "northside",
        "avenue",
        "party",
        "northside",
        "avenue",
        "a",
        "get",
        "want",
        "a",
        "belief",
        "party",
        "southside",
        "avenue",
        "party",
        "southside",
        "ave",
        "a",
        "get",
        "want",
        "a",
        "belief",
        "party",
        "elm",
        "st",
        "party",
        "elm",
        "st",
        "a",
        "get",
        "want",
        "equivalence",
        "schema",
        "e",
        "allows",
        "one",
        "capture",
        "infinite",
        "conjunction",
        "conditionals",
        "finite",
        "way",
        "basis",
        "schema",
        "one",
        "reformulate",
        "infinite",
        "conjunction",
        "a",
        "belief",
        "party",
        "northside",
        "avenue",
        "party",
        "northside",
        "avenue",
        "true",
        "a",
        "get",
        "want",
        "a",
        "belief",
        "party",
        "southside",
        "avenue",
        "party",
        "southside",
        "avenue",
        "true",
        "a",
        "get",
        "want",
        "a",
        "belief",
        "party",
        "elm",
        "street",
        "party",
        "elm",
        "street",
        "true",
        "a",
        "get",
        "want",
        "turn",
        "e",
        "reformulated",
        "infinite",
        "conjunction",
        "expressed",
        "finite",
        "statement",
        "universal",
        "quantifier",
        "ranging",
        "proposition",
        "every",
        "proposition",
        "x",
        "a",
        "belief",
        "x",
        "x",
        "true",
        "a",
        "get",
        "want",
        "thing",
        "equal",
        "important",
        "point",
        "deflationist",
        "one",
        "could",
        "express",
        "infinite",
        "conjunction",
        "regarding",
        "agent",
        "belief",
        "behavioral",
        "success",
        "unless",
        "one",
        "concept",
        "truth",
        "deflationists",
        "also",
        "claim",
        "notion",
        "truth",
        "similar",
        "explanation",
        "cf",
        "leeds",
        "williams",
        "horwich",
        "a",
        "successful",
        "standard",
        "deflationary",
        "response",
        "several",
        "critique",
        "literature",
        "eg",
        "damnjanovic",
        "argue",
        "distinction",
        "first",
        "place",
        "appearing",
        "causalexplanatory",
        "generalization",
        "causalexplanatory",
        "property",
        "suppose",
        "true",
        "generalization",
        "metal",
        "object",
        "conduct",
        "electricity",
        "would",
        "normally",
        "taken",
        "sufficient",
        "show",
        "metal",
        "causalexplanatory",
        "property",
        "one",
        "cite",
        "explaining",
        "something",
        "conduct",
        "electricity",
        "counter",
        "deflationism",
        "thesis",
        "assuming",
        "property",
        "truth",
        "insubstantial",
        "one",
        "property",
        "causal",
        "explanatory",
        "property",
        "hard",
        "view",
        "insubstantial",
        "reasoning",
        "issue",
        "may",
        "presented",
        "conveniently",
        "expanding",
        "general",
        "argument",
        "considered",
        "proceeding",
        "apparently",
        "true",
        "causal",
        "generalization",
        "falsity",
        "deflationism",
        "ibid",
        "p",
        "person",
        "a",
        "true",
        "belief",
        "get",
        "want",
        "thing",
        "equal",
        "c",
        "therefore",
        "a",
        "belief",
        "property",
        "true",
        "a",
        "get",
        "want",
        "thing",
        "equal",
        "c",
        "therefore",
        "property",
        "true",
        "appears",
        "causalexplanatory",
        "generalization",
        "c",
        "therefore",
        "property",
        "true",
        "causalexplanatory",
        "property",
        "c",
        "therefore",
        "deflationism",
        "false",
        "deflationist",
        "apply",
        "standard",
        "deflationary",
        "response",
        "argument",
        "would",
        "seem",
        "involve",
        "rejecting",
        "inference",
        "c",
        "c",
        "standard",
        "reply",
        "would",
        "say",
        "role",
        "appeal",
        "truth",
        "play",
        "p",
        "apparent",
        "causal",
        "generalization",
        "simply",
        "generalizing",
        "role",
        "expressing",
        "potentially",
        "infinite",
        "disjointed",
        "conjunction",
        "unrelated",
        "causal",
        "connection",
        "cf",
        "leeds",
        "applying",
        "deflationary",
        "response",
        "basically",
        "hinge",
        "plausibility",
        "rejecting",
        "initial",
        "assumption",
        "distinction",
        "appearing",
        "causalexplanatory",
        "generalization",
        "causalexplanatory",
        "property",
        "worth",
        "noting",
        "two",
        "response",
        "beyond",
        "standard",
        "one",
        "deflationist",
        "might",
        "make",
        "reasoning",
        "set",
        "first",
        "option",
        "deny",
        "step",
        "p",
        "c",
        "inference",
        "involves",
        "explicit",
        "introduction",
        "property",
        "true",
        "seen",
        "deflationists",
        "deny",
        "truth",
        "property",
        "cf",
        "quine",
        "grover",
        "et",
        "al",
        "leeds",
        "brandom",
        "noted",
        "idea",
        "truth",
        "property",
        "may",
        "difficult",
        "sustain",
        "given",
        "apparent",
        "fact",
        "true",
        "function",
        "grammatically",
        "predicate",
        "second",
        "option",
        "deny",
        "final",
        "step",
        "c",
        "c",
        "concede",
        "sense",
        "truth",
        "causalexplanatory",
        "property",
        "yet",
        "say",
        "still",
        "substantive",
        "property",
        "cf",
        "damnjanovic",
        "example",
        "philosopher",
        "eg",
        "friedman",
        "van",
        "fraassen",
        "kitcher",
        "jackson",
        "pettit",
        "offered",
        "different",
        "understanding",
        "scientific",
        "explanation",
        "causal",
        "explanation",
        "according",
        "causal",
        "explanatory",
        "property",
        "might",
        "conflict",
        "insubstantial",
        "perhaps",
        "abundant",
        "ungroundable",
        "property",
        "might",
        "enough",
        "sustain",
        "deflationary",
        "position",
        "standard",
        "deflationary",
        "response",
        "explanatoryrole",
        "challenge",
        "also",
        "met",
        "criticism",
        "focused",
        "providing",
        "explanation",
        "certain",
        "higherlevel",
        "phenomenon",
        "philip",
        "kitcher",
        "concludes",
        "horwich",
        "a",
        "application",
        "standard",
        "response",
        "account",
        "notion",
        "truth",
        "function",
        "explanation",
        "behavioral",
        "success",
        "miss",
        "systematic",
        "role",
        "truth",
        "play",
        "explaining",
        "pattern",
        "successful",
        "behavior",
        "meanends",
        "belief",
        "flow",
        "representational",
        "device",
        "like",
        "map",
        "chase",
        "wrenn",
        "agrees",
        "kitcher",
        "deflationists",
        "need",
        "explain",
        "systematic",
        "opposed",
        "singular",
        "success",
        "kitcher",
        "argues",
        "deflationists",
        "actually",
        "better",
        "inflationists",
        "front",
        "gamester",
        "raise",
        "different",
        "higherlevel",
        "factor",
        "challenge",
        "one",
        "based",
        "putative",
        "inability",
        "standard",
        "deflationary",
        "account",
        "role",
        "truth",
        "explanation",
        "behavioral",
        "success",
        "distinguish",
        "coincidental",
        "noncoincidental",
        "success",
        "gamester",
        "ibid",
        "claim",
        "inflationist",
        "could",
        "mark",
        "account",
        "difference",
        "two",
        "kind",
        "success",
        "explanation",
        "appeal",
        "notion",
        "truth",
        "clear",
        "deflationist",
        "also",
        "avail",
        "version",
        "truthinvolving",
        "explanation",
        "taking",
        "way",
        "expressing",
        "natural",
        "language",
        "one",
        "might",
        "formally",
        "express",
        "sentential",
        "variable",
        "quantifier",
        "cf",
        "ramsey",
        "prior",
        "wrenn",
        "armourgarb",
        "woodbridge",
        "forthcoming"
    ]
}