{
    "main_text": "Correspondence as Isomorphism\n6. Correspondence as Isomorphism\n\n\nSome correspondence theories of truth are two-liner mini-theories,\nconsisting of little more than a specific version of (1) or\n(2). Normally, one would expect a bit more, even from a philosophical\ntheory (though mini-theories are quite common in philosophy). One\nwould expect a correspondence theory to go beyond a mere definition\nlike (1) or (2) and discharge a triple task: it should tell us about\nthe workings of the correspondence relation, about the nature of\nfacts, and about the conditions that determine which truthbearers\ncorrespond to which facts.\n\n\nOne can approach this by considering some general principles a\ncorrespondence theory might want to add to its central principle to\nflesh out her theory. The first such principle says that the\ncorrespondence relation must not collapse into\nidentity—“It takes two to make a truth” (Austin\n1950, p. 118):\n\nNonidentity: No truth is identical with a fact\ncorrespondence to which is sufficient for its being a truth.\n\n\n\nIt would be much simpler to say that no truth is identical with a\nfact. However, some authors, e.g. Wittgenstein 1921, hold that a\nproposition (Satz, his truthbearer) is itself a fact, though\nnot the same fact as the one that makes the proposition true (see also\nKing 2007). Nonidentity is usually taken for granted by correspondence\ntheorists as constitutive of the very idea of a correspondence\ntheory—authors who advance contrary arguments to the effect that\ncorrespondence must collapse into identity regard their arguments as\nobjections to any form of correspondence theory (cf. Moore 1901/02,\nFrege 1918-19, p. 60).\n\n\nConcerning the correspondence relation, two aspects can be\ndistinguished: correspondence as correlation\nand correspondence as isomorphism (cf. Pitcher 1964; Kirkham\n1992, chap. 4). Pertaining to the first aspect, familiar from\nmathematical contexts, a correspondence theorist is likely to adopt\nclaim (a), and some may in addition adopt claim (b),\nof:\n\nCorrelation:\n(a) Every truth corresponds to exactly one fact;\n(b) Different truths correspond to different facts.\n\n\n\nTogether, (a) and (b) say that correspondence is a\none-one relation. This seems needlessly strong, and it is not easy to\nfind real-life correspondence theorists who explicitly embrace part\n(b): Why shouldn’t different truths correspond to the\nsame fact, as long as they are not too different? Explicit commitment\nto (a) is also quite rare. However, correspondence theorists\ntend to move comfortably from talk about a given truth to talk\nabout the fact it corresponds to—a move that signals\ncommitment to (a).\n\n\nCorrelation does not imply anything about the inner nature of the\ncorresponding items. Contrast this with correspondence\nas isomorphism, which requires the corresponding items to\nhave the same, or sufficiently similar, constituent structure. This\naspect of correspondence, which is more prominent (and more notorious)\nthan the previous one, is also much more difficult to make\nprecise. Let us say, roughly, that a correspondence theorist may want\nto add a claim to her theory committing her to something like the\nfollowing:\n\nStructure: If an item of kind K corresponds to a certain\nfact, then they have the same or sufficiently similar structure: the\noverall correspondence between a true K and a fact is a matter of\npart-wise correspondences, i.e. of their having corresponding\nconstituents in corresponding places in the same structure, or in\nsufficiently similar structures.\n\n\nThe basic idea is that truthbearers and facts are both complex\nstructured entities: truthbearers are composed of (other truthbearers\nand ultimately of) words, or concepts; facts are composed of (other\nfacts or states of affairs and ultimately of) things, properties, and\nrelations. The aim is to show how the correspondence relation is\ngenerated from underlying relations between the ultimate constituents\nof truthbearers, on the one hand, and the ultimate constituents of\ntheir corresponding facts, on the other. One part of the project will\nbe concerned with these correspondence-generating relations: it will\nlead into a theory that addresses the question how simple words, or\nconcepts, can be about things, properties, and relations;\ni.e., it will merge with semantics or psycho-semantics (depending on\nwhat the truthbearers are taken to be). The other part of the project,\nthe specifically ontological part, will have to provide identity\ncriteria for facts and explain how their simple constituents combine\ninto complex wholes.  Putting all this together should yield an\naccount of the conditions determining which truthbearers correspond to\nwhich facts.\n\n\nCorrelation and Structure reflect distinct aspects of\ncorrespondence. One might want to endorse the former without the\nlatter, though it is hard to see how one could endorse the latter\nwithout embracing at least part (a) of the former.\n\n\nThe isomorphism approach offers an answer to objection 3.C1.  Although\nthe truth that the cat is on the mat does not resemble the cat or the\nmat (the truth doesn’t meow or smell, etc.), it does resemble\nthe fact that the cat is on the mat. This is not a\nqualitative resemblance; it is a more abstract, structural\nresemblance.\n\n\nThe approach also puts objection 3.C2 in some perspective. The\ncorrespondence relation is supposed to reduce to underlying relations\nbetween words, or concepts, and reality. Consequently, a\ncorrespondence theory is little more than a spin-off from semantics\nand/or psycho-semantics, i.e. the theory of intentionality construed\nas incorporating a representational theory of the mind (cf. Fodor\n1989). This reminds us that, as a relation, correspondence is no\nmore—but also no less—mysterious than semantic relations\nin general. Such relations have some curious features, and they raise\na host of puzzles and difficult questions—most notoriously: Can\nthey be explained in terms of natural (causal) relations, or do they\nhave to be regarded as irreducibly non-natural aspects of reality?\nSome philosophers have claimed that semantic relations are too\nmysterious to be taken seriously, usually on the grounds that they are\nnot explainable in naturalistic terms. But one should bear in mind\nthat this is a very general and extremely radical attack on semantics\nas a whole, on the very idea that words and concepts can\nbe about things. The common practice to aim this attack\nspecifically at the correspondence theory seems misleading. As far as\nthe intelligibility of the correspondence relation is concerned, the\ncorrespondence theory will stand, or fall, with the general theory of\nreference and intentionality.\n\n\nIt should be noted, though, that these points concerning objections\n3.C1 and 3.C2 are not independent of one’s views about the\nnature of the primary truthbearers. If truthbearers are taken\nto be sentences of an ordinary language (or an idealized version\nthereof), or if they are taken to be mental representations (sentences\nof the language of thought), the above points hold without\nqualification: correspondence will be a semantic or psycho-semantic\nrelation. If, on the other hand, the primary truthbearers are taken to\nbe propositions, there is a complication:\n\nOn a broadly Fregean view of propositions, propositions\nare constituted by concepts of objects and properties (in the\nlogical, not the psychological, sense of “concept”). On\nthis view, the above points still hold, since the relation between\nconcepts, on the one hand, and the objects and properties they are\nconcepts of, on the other, appears to be a semantic relation,\na concept-semantic relation.\nOn the so-called Russellian view of propositions (which\nthe early Russell inherited mostly from early Moore), propositions are\nconstituted, not of concepts of objects and properties, but of the\nobjects and properties themselves (cf. Russell 1903). On this view,\nthe points above will most likely fail, since the correspondence\nrelation would appear to collapse into the identity relation when\napplied to true Russellian propositions. It is hard to see how a true\nRussellian proposition could be anything but a fact: What would a\nfact be, if not this sort of thing? So the principle of\nNonidentity is rejected, and with it goes the correspondence theory of\ntruth: “Once it is definitely recognized that the proposition is\nto denote, not a belief or form of words, but an object of belief, it\nseems plain that a truth differs in no respect from the reality with\nwhich it was supposed merely to correspond” (Moore 1901-02,\np. 717). A simple, fact-based correspondence theory, applied to\npropositions understood in the Russellian way, thus reduces to\nan identity theory of truth, on which a proposition is true\niff it is a fact, and false, iff it is not a fact. See below,\nSection 8.3; and the entries on\npropositions, \nsingular propositions, and\nstructured propositions\nin this encyclopedia.\n\n\n\nBut Russellians don’t usually renounce the correspondence theory\nentirely. Though they have no room for (1) from Section 3, when\napplied to propositions as truthbearers, correspondence will enter\ninto their account of truth for sentences, public or mental. The\naccount will take the form of Section 3’s (2), applied to\ncategories of truthbearers other than propositions, where Russellian\npropositions show up on the right-hand side in the guise of states of\naffairs that obtain or fail to obtain. Commitment to states of affairs\nin addition to propositions is sometimes regarded with scorn, as a\ngratuitous ontological duplication. But Russellians are not committed\nto states of affairs in addition to propositions, for\npropositions, on their view, must already be states of\naffairs. This conclusion is well nigh inevitable, once true\npropositions have been identified with facts. If a true proposition is\na fact, then a false proposition that might have been true would have\nbeen a fact, if it had been true. So, a (contingent) false proposition\nmust be the same kind of being as a fact, only not a fact—an\nunfact; but that just is a non-obtaining state of affairs under a\ndifferent name. Russellian propositions are states of affairs: the\nfalse ones are states of affairs that do not obtain, and the true ones\nare states of affairs that do obtain.\n\n\nThe Russellian view of propositions is popular nowadays. Somewhat\ncuriously, contemporary Russellians hardly ever refer to propositions\nas facts or states of affairs. This is because they are much concerned\nwith understanding belief, belief attributions, and the semantics of\nsentences. In such contexts, it is more natural to talk\nproposition-language than state-of-affairs-language. It feels odd\n(wrong) to say that someone believes a state of affairs, or that\nstates of affairs are true or false. For that matter, it also feels\nodd (wrong) to say that some propositions are facts, that facts are\ntrue, and that propositions obtain or fail to obtain. Nevertheless,\nall of this must be the literal truth, according to the\nRussellians. They have to claim that “proposition” and\n“state of affairs”, much like “evening star”\nand “morning star”, are different names for the same\nthings—they come with different associations and are at home in\nsomewhat different linguistic environments, which accounts for the\nfelt oddness when one name is transported to the other’s\nenvironment.\n\n\nReturning to the isomorphism approach in general, on a strict or\nnaïve implementation of this approach, correspondence will be a\none-one relation between truths and corresponding facts, which leaves\nthe approach vulnerable to objections against funny facts (3.F1): each\ntrue truthbearer, no matter how complex, will be assigned a matching\nfact. Moreover, since a strict implementation of isomorphism assigns\ncorresponding entities to all (relevant) constituents of truthbearers,\ncomplex facts will contain objects corresponding to the logical\nconstants (“not”, “or”, “if-then”,\netc.), and these “logical objects” will have to be\nregarded as constituents of the world. Many philosophers have found it\nhard to believe in the existence of all these funny facts and funny\nquasi-logical objects.\n\n\nThe isomorphism approach has never been advocated in a fully\nnaïve form, assigning corresponding objects to each and every\nwrinkle of our verbal or mental utterings. Instead, proponents try to\nisolate the “relevant” constituents of truthbearers\nthrough meaning analysis, aiming to uncover the logical form,\nor deep structure, behind ordinary language and thought. This deep\nstructure might then be expressed in an ideal-language\n(typically, the language of predicate logic), whose syntactic\nstructure is designed to mirror perfectly the ontological structure of\nreality. The resulting view—correspondence as isomorphism\nbetween properly analyzed truthbearers and facts—avoids\nassigning strange objects to such phrases as “the average\nhusband”, “the sake of”, and “the present king\nof France”; but the view remains committed to logically complex\nfacts and to logical objects corresponding to the logical\nconstants.\n\n\nAustin (1950) rejects the isomorphism approach on the grounds that it\nprojects the structure of our language onto the world. On his version\nof the correspondence theory (a more elaborated variant of (4) applied\nto statements), a statement as a whole is correlated to a state of\naffairs by arbitrary linguistic conventions without mirroring the\ninner structure of its correlate (cf. also Vision 2004). This approach\nappears vulnerable to the objection that it avoids funny facts at the\nprice of neglecting systematicity. Language does not provide separate\nlinguistic conventions for each statement: that would require too vast\na number of conventions. Rather, it seems that the truth-values of\nstatements are systematically determined, via a relatively small set\nof conventions, by the semantic values (relations to reality) of their\nsimpler constituents. Recognition of this systematicity is built right\ninto the isomorphism approach.\n\n\nCritics frequently echo Austin’s\n“projection”-complaint, 3.F2, that a traditional\ncorrespondence theory commits “the error of reading back into\nthe world the features of language” (Austin 1950, p. 155;\ncf. also, e.g., Rorty 1981). At bottom, this is a pessimistic stance:\nif there is a prima facie structural resemblance between a mode of\nspeech or thought and some ontological category, it is inferred,\npessimistically, that the ontological category is an illusion, a\nmatter of us projecting the structure of our language or thought into\nthe world. Advocates of traditional correspondence theories can be\nseen as taking the opposite stance: unless there are specific reasons\nto the contrary, they are prepared to assume, optimistically, that the\nstructure of our language and/or thought reflects genuine ontological\ncategories, that the structure of our language and/or thought is, at\nleast to a significant extent, the way it is because of the\nstructure of the world.\n",
    "section_title": "6. Correspondence as Isomorphism",
    "entry_title": "The Correspondence Theory of Truth",
    "hierarchy_title": "The Correspondence Theory of Truth || Correspondence as Isomorphism",
    "tokenized_text": [
        "correspondence",
        "isomorphism",
        "correspondence",
        "isomorphism",
        "correspondence",
        "theory",
        "truth",
        "twoliner",
        "minitheories",
        "consisting",
        "little",
        "specific",
        "version",
        "normally",
        "one",
        "would",
        "expect",
        "bit",
        "even",
        "philosophical",
        "theory",
        "though",
        "minitheories",
        "quite",
        "common",
        "philosophy",
        "one",
        "would",
        "expect",
        "correspondence",
        "theory",
        "go",
        "beyond",
        "mere",
        "definition",
        "like",
        "discharge",
        "triple",
        "task",
        "tell",
        "u",
        "working",
        "correspondence",
        "relation",
        "nature",
        "fact",
        "condition",
        "determine",
        "truthbearers",
        "correspond",
        "fact",
        "one",
        "approach",
        "considering",
        "general",
        "principle",
        "correspondence",
        "theory",
        "might",
        "want",
        "add",
        "central",
        "principle",
        "flesh",
        "theory",
        "first",
        "principle",
        "say",
        "correspondence",
        "relation",
        "must",
        "collapse",
        "identity",
        "take",
        "two",
        "make",
        "truth",
        "austin",
        "p",
        "nonidentity",
        "truth",
        "identical",
        "fact",
        "correspondence",
        "sufficient",
        "truth",
        "would",
        "much",
        "simpler",
        "say",
        "truth",
        "identical",
        "fact",
        "however",
        "author",
        "eg",
        "wittgenstein",
        "hold",
        "proposition",
        "satz",
        "truthbearer",
        "fact",
        "though",
        "fact",
        "one",
        "make",
        "proposition",
        "true",
        "see",
        "also",
        "king",
        "nonidentity",
        "usually",
        "taken",
        "granted",
        "correspondence",
        "theorist",
        "constitutive",
        "idea",
        "correspondence",
        "theoryauthors",
        "advance",
        "contrary",
        "argument",
        "effect",
        "correspondence",
        "must",
        "collapse",
        "identity",
        "regard",
        "argument",
        "objection",
        "form",
        "correspondence",
        "theory",
        "cf",
        "moore",
        "frege",
        "p",
        "concerning",
        "correspondence",
        "relation",
        "two",
        "aspect",
        "distinguished",
        "correspondence",
        "correlation",
        "correspondence",
        "isomorphism",
        "cf",
        "pitcher",
        "kirkham",
        "chap",
        "pertaining",
        "first",
        "aspect",
        "familiar",
        "mathematical",
        "context",
        "correspondence",
        "theorist",
        "likely",
        "adopt",
        "claim",
        "may",
        "addition",
        "adopt",
        "claim",
        "b",
        "correlation",
        "every",
        "truth",
        "corresponds",
        "exactly",
        "one",
        "fact",
        "b",
        "different",
        "truth",
        "correspond",
        "different",
        "fact",
        "together",
        "b",
        "say",
        "correspondence",
        "oneone",
        "relation",
        "seems",
        "needlessly",
        "strong",
        "easy",
        "find",
        "reallife",
        "correspondence",
        "theorist",
        "explicitly",
        "embrace",
        "part",
        "b",
        "different",
        "truth",
        "correspond",
        "fact",
        "long",
        "different",
        "explicit",
        "commitment",
        "also",
        "quite",
        "rare",
        "however",
        "correspondence",
        "theorist",
        "tend",
        "move",
        "comfortably",
        "talk",
        "given",
        "truth",
        "talk",
        "fact",
        "corresponds",
        "toa",
        "move",
        "signal",
        "commitment",
        "correlation",
        "imply",
        "anything",
        "inner",
        "nature",
        "corresponding",
        "item",
        "contrast",
        "correspondence",
        "isomorphism",
        "requires",
        "corresponding",
        "item",
        "sufficiently",
        "similar",
        "constituent",
        "structure",
        "aspect",
        "correspondence",
        "prominent",
        "notorious",
        "previous",
        "one",
        "also",
        "much",
        "difficult",
        "make",
        "precise",
        "let",
        "u",
        "say",
        "roughly",
        "correspondence",
        "theorist",
        "may",
        "want",
        "add",
        "claim",
        "theory",
        "committing",
        "something",
        "like",
        "following",
        "structure",
        "item",
        "kind",
        "k",
        "corresponds",
        "certain",
        "fact",
        "sufficiently",
        "similar",
        "structure",
        "overall",
        "correspondence",
        "true",
        "k",
        "fact",
        "matter",
        "partwise",
        "correspondence",
        "ie",
        "corresponding",
        "constituent",
        "corresponding",
        "place",
        "structure",
        "sufficiently",
        "similar",
        "structure",
        "basic",
        "idea",
        "truthbearers",
        "fact",
        "complex",
        "structured",
        "entity",
        "truthbearers",
        "composed",
        "truthbearers",
        "ultimately",
        "word",
        "concept",
        "fact",
        "composed",
        "fact",
        "state",
        "affair",
        "ultimately",
        "thing",
        "property",
        "relation",
        "aim",
        "show",
        "correspondence",
        "relation",
        "generated",
        "underlying",
        "relation",
        "ultimate",
        "constituent",
        "truthbearers",
        "one",
        "hand",
        "ultimate",
        "constituent",
        "corresponding",
        "fact",
        "one",
        "part",
        "project",
        "concerned",
        "correspondencegenerating",
        "relation",
        "lead",
        "theory",
        "address",
        "question",
        "simple",
        "word",
        "concept",
        "thing",
        "property",
        "relation",
        "ie",
        "merge",
        "semantics",
        "psychosemantics",
        "depending",
        "truthbearers",
        "taken",
        "part",
        "project",
        "specifically",
        "ontological",
        "part",
        "provide",
        "identity",
        "criterion",
        "fact",
        "explain",
        "simple",
        "constituent",
        "combine",
        "complex",
        "whole",
        "putting",
        "together",
        "yield",
        "account",
        "condition",
        "determining",
        "truthbearers",
        "correspond",
        "fact",
        "correlation",
        "structure",
        "reflect",
        "distinct",
        "aspect",
        "correspondence",
        "one",
        "might",
        "want",
        "endorse",
        "former",
        "without",
        "latter",
        "though",
        "hard",
        "see",
        "one",
        "could",
        "endorse",
        "latter",
        "without",
        "embracing",
        "least",
        "part",
        "former",
        "isomorphism",
        "approach",
        "offer",
        "answer",
        "objection",
        "c",
        "although",
        "truth",
        "cat",
        "mat",
        "resemble",
        "cat",
        "mat",
        "truth",
        "meow",
        "smell",
        "etc",
        "resemble",
        "fact",
        "cat",
        "mat",
        "qualitative",
        "resemblance",
        "abstract",
        "structural",
        "resemblance",
        "approach",
        "also",
        "put",
        "objection",
        "c",
        "perspective",
        "correspondence",
        "relation",
        "supposed",
        "reduce",
        "underlying",
        "relation",
        "word",
        "concept",
        "reality",
        "consequently",
        "correspondence",
        "theory",
        "little",
        "spinoff",
        "semantics",
        "andor",
        "psychosemantics",
        "ie",
        "theory",
        "intentionality",
        "construed",
        "incorporating",
        "representational",
        "theory",
        "mind",
        "cf",
        "fodor",
        "reminds",
        "u",
        "relation",
        "correspondence",
        "morebut",
        "also",
        "lessmysterious",
        "semantic",
        "relation",
        "general",
        "relation",
        "curious",
        "feature",
        "raise",
        "host",
        "puzzle",
        "difficult",
        "questionsmost",
        "notoriously",
        "explained",
        "term",
        "natural",
        "causal",
        "relation",
        "regarded",
        "irreducibly",
        "nonnatural",
        "aspect",
        "reality",
        "philosopher",
        "claimed",
        "semantic",
        "relation",
        "mysterious",
        "taken",
        "seriously",
        "usually",
        "ground",
        "explainable",
        "naturalistic",
        "term",
        "one",
        "bear",
        "mind",
        "general",
        "extremely",
        "radical",
        "attack",
        "semantics",
        "whole",
        "idea",
        "word",
        "concept",
        "thing",
        "common",
        "practice",
        "aim",
        "attack",
        "specifically",
        "correspondence",
        "theory",
        "seems",
        "misleading",
        "far",
        "intelligibility",
        "correspondence",
        "relation",
        "concerned",
        "correspondence",
        "theory",
        "stand",
        "fall",
        "general",
        "theory",
        "reference",
        "intentionality",
        "noted",
        "though",
        "point",
        "concerning",
        "objection",
        "c",
        "c",
        "independent",
        "one",
        "view",
        "nature",
        "primary",
        "truthbearers",
        "truthbearers",
        "taken",
        "sentence",
        "ordinary",
        "language",
        "idealized",
        "version",
        "thereof",
        "taken",
        "mental",
        "representation",
        "sentence",
        "language",
        "thought",
        "point",
        "hold",
        "without",
        "qualification",
        "correspondence",
        "semantic",
        "psychosemantic",
        "relation",
        "hand",
        "primary",
        "truthbearers",
        "taken",
        "proposition",
        "complication",
        "broadly",
        "fregean",
        "view",
        "proposition",
        "proposition",
        "constituted",
        "concept",
        "object",
        "property",
        "logical",
        "psychological",
        "sense",
        "concept",
        "view",
        "point",
        "still",
        "hold",
        "since",
        "relation",
        "concept",
        "one",
        "hand",
        "object",
        "property",
        "concept",
        "appears",
        "semantic",
        "relation",
        "conceptsemantic",
        "relation",
        "socalled",
        "russellian",
        "view",
        "proposition",
        "early",
        "russell",
        "inherited",
        "mostly",
        "early",
        "moore",
        "proposition",
        "constituted",
        "concept",
        "object",
        "property",
        "object",
        "property",
        "cf",
        "russell",
        "view",
        "point",
        "likely",
        "fail",
        "since",
        "correspondence",
        "relation",
        "would",
        "appear",
        "collapse",
        "identity",
        "relation",
        "applied",
        "true",
        "russellian",
        "proposition",
        "hard",
        "see",
        "true",
        "russellian",
        "proposition",
        "could",
        "anything",
        "fact",
        "would",
        "fact",
        "sort",
        "thing",
        "principle",
        "nonidentity",
        "rejected",
        "go",
        "correspondence",
        "theory",
        "truth",
        "definitely",
        "recognized",
        "proposition",
        "denote",
        "belief",
        "form",
        "word",
        "object",
        "belief",
        "seems",
        "plain",
        "truth",
        "differs",
        "respect",
        "reality",
        "supposed",
        "merely",
        "correspond",
        "moore",
        "p",
        "simple",
        "factbased",
        "correspondence",
        "theory",
        "applied",
        "proposition",
        "understood",
        "russellian",
        "way",
        "thus",
        "reduces",
        "identity",
        "theory",
        "truth",
        "proposition",
        "true",
        "iff",
        "fact",
        "false",
        "iff",
        "fact",
        "see",
        "section",
        "entry",
        "proposition",
        "singular",
        "proposition",
        "structured",
        "proposition",
        "encyclopedia",
        "russellians",
        "usually",
        "renounce",
        "correspondence",
        "theory",
        "entirely",
        "though",
        "room",
        "section",
        "applied",
        "proposition",
        "truthbearers",
        "correspondence",
        "enter",
        "account",
        "truth",
        "sentence",
        "public",
        "mental",
        "account",
        "take",
        "form",
        "section",
        "applied",
        "category",
        "truthbearers",
        "proposition",
        "russellian",
        "proposition",
        "show",
        "righthand",
        "side",
        "guise",
        "state",
        "affair",
        "obtain",
        "fail",
        "obtain",
        "commitment",
        "state",
        "affair",
        "addition",
        "proposition",
        "sometimes",
        "regarded",
        "scorn",
        "gratuitous",
        "ontological",
        "duplication",
        "russellians",
        "committed",
        "state",
        "affair",
        "addition",
        "proposition",
        "proposition",
        "view",
        "must",
        "already",
        "state",
        "affair",
        "conclusion",
        "well",
        "nigh",
        "inevitable",
        "true",
        "proposition",
        "identified",
        "fact",
        "true",
        "proposition",
        "fact",
        "false",
        "proposition",
        "might",
        "true",
        "would",
        "fact",
        "true",
        "contingent",
        "false",
        "proposition",
        "must",
        "kind",
        "fact",
        "factan",
        "unfact",
        "nonobtaining",
        "state",
        "affair",
        "different",
        "name",
        "russellian",
        "proposition",
        "state",
        "affair",
        "false",
        "one",
        "state",
        "affair",
        "obtain",
        "true",
        "one",
        "state",
        "affair",
        "obtain",
        "russellian",
        "view",
        "proposition",
        "popular",
        "nowadays",
        "somewhat",
        "curiously",
        "contemporary",
        "russellians",
        "hardly",
        "ever",
        "refer",
        "proposition",
        "fact",
        "state",
        "affair",
        "much",
        "concerned",
        "understanding",
        "belief",
        "belief",
        "attribution",
        "semantics",
        "sentence",
        "context",
        "natural",
        "talk",
        "propositionlanguage",
        "stateofaffairslanguage",
        "feel",
        "odd",
        "wrong",
        "say",
        "someone",
        "belief",
        "state",
        "affair",
        "state",
        "affair",
        "true",
        "false",
        "matter",
        "also",
        "feel",
        "odd",
        "wrong",
        "say",
        "proposition",
        "fact",
        "fact",
        "true",
        "proposition",
        "obtain",
        "fail",
        "obtain",
        "nevertheless",
        "must",
        "literal",
        "truth",
        "according",
        "russellians",
        "claim",
        "proposition",
        "state",
        "affair",
        "much",
        "like",
        "evening",
        "star",
        "morning",
        "star",
        "different",
        "name",
        "thingsthey",
        "come",
        "different",
        "association",
        "home",
        "somewhat",
        "different",
        "linguistic",
        "environment",
        "account",
        "felt",
        "oddness",
        "one",
        "name",
        "transported",
        "environment",
        "returning",
        "isomorphism",
        "approach",
        "general",
        "strict",
        "naïve",
        "implementation",
        "approach",
        "correspondence",
        "oneone",
        "relation",
        "truth",
        "corresponding",
        "fact",
        "leaf",
        "approach",
        "vulnerable",
        "objection",
        "funny",
        "fact",
        "f",
        "true",
        "truthbearer",
        "matter",
        "complex",
        "assigned",
        "matching",
        "fact",
        "moreover",
        "since",
        "strict",
        "implementation",
        "isomorphism",
        "assigns",
        "corresponding",
        "entity",
        "relevant",
        "constituent",
        "truthbearers",
        "complex",
        "fact",
        "contain",
        "object",
        "corresponding",
        "logical",
        "constant",
        "ifthen",
        "etc",
        "logical",
        "object",
        "regarded",
        "constituent",
        "world",
        "many",
        "philosopher",
        "found",
        "hard",
        "believe",
        "existence",
        "funny",
        "fact",
        "funny",
        "quasilogical",
        "object",
        "isomorphism",
        "approach",
        "never",
        "advocated",
        "fully",
        "naïve",
        "form",
        "assigning",
        "corresponding",
        "object",
        "every",
        "wrinkle",
        "verbal",
        "mental",
        "utterings",
        "instead",
        "proponent",
        "try",
        "isolate",
        "relevant",
        "constituent",
        "truthbearers",
        "meaning",
        "analysis",
        "aiming",
        "uncover",
        "logical",
        "form",
        "deep",
        "structure",
        "behind",
        "ordinary",
        "language",
        "thought",
        "deep",
        "structure",
        "might",
        "expressed",
        "ideallanguage",
        "typically",
        "language",
        "predicate",
        "logic",
        "whose",
        "syntactic",
        "structure",
        "designed",
        "mirror",
        "perfectly",
        "ontological",
        "structure",
        "reality",
        "resulting",
        "viewcorrespondence",
        "isomorphism",
        "properly",
        "analyzed",
        "truthbearers",
        "factsavoids",
        "assigning",
        "strange",
        "object",
        "phrase",
        "average",
        "husband",
        "sake",
        "present",
        "king",
        "france",
        "view",
        "remains",
        "committed",
        "logically",
        "complex",
        "fact",
        "logical",
        "object",
        "corresponding",
        "logical",
        "constant",
        "austin",
        "reject",
        "isomorphism",
        "approach",
        "ground",
        "project",
        "structure",
        "language",
        "onto",
        "world",
        "version",
        "correspondence",
        "theory",
        "elaborated",
        "variant",
        "applied",
        "statement",
        "statement",
        "whole",
        "correlated",
        "state",
        "affair",
        "arbitrary",
        "linguistic",
        "convention",
        "without",
        "mirroring",
        "inner",
        "structure",
        "correlate",
        "cf",
        "also",
        "vision",
        "approach",
        "appears",
        "vulnerable",
        "objection",
        "avoids",
        "funny",
        "fact",
        "price",
        "neglecting",
        "systematicity",
        "language",
        "provide",
        "separate",
        "linguistic",
        "convention",
        "statement",
        "would",
        "require",
        "vast",
        "number",
        "convention",
        "rather",
        "seems",
        "truthvalues",
        "statement",
        "systematically",
        "determined",
        "via",
        "relatively",
        "small",
        "set",
        "convention",
        "semantic",
        "value",
        "relation",
        "reality",
        "simpler",
        "constituent",
        "recognition",
        "systematicity",
        "built",
        "right",
        "isomorphism",
        "approach",
        "critic",
        "frequently",
        "echo",
        "austin",
        "projection",
        "complaint",
        "f",
        "traditional",
        "correspondence",
        "theory",
        "commits",
        "error",
        "reading",
        "back",
        "world",
        "feature",
        "language",
        "austin",
        "p",
        "cf",
        "also",
        "eg",
        "rorty",
        "bottom",
        "pessimistic",
        "stance",
        "prima",
        "facie",
        "structural",
        "resemblance",
        "mode",
        "speech",
        "thought",
        "ontological",
        "category",
        "inferred",
        "pessimistically",
        "ontological",
        "category",
        "illusion",
        "matter",
        "u",
        "projecting",
        "structure",
        "language",
        "thought",
        "world",
        "advocate",
        "traditional",
        "correspondence",
        "theory",
        "seen",
        "taking",
        "opposite",
        "stance",
        "unless",
        "specific",
        "reason",
        "contrary",
        "prepared",
        "assume",
        "optimistically",
        "structure",
        "language",
        "andor",
        "thought",
        "reflects",
        "genuine",
        "ontological",
        "category",
        "structure",
        "language",
        "andor",
        "thought",
        "least",
        "significant",
        "extent",
        "way",
        "structure",
        "world"
    ]
}