{
    "main_text": "Neo-Pragmatic Theories of Truth\n2. Neo-Pragmatic Theories of Truth\n\nPragmatic theories of truth enjoyed a resurgence in the last decades\nof the twentieth century. This resurgence was especially visible in\ndebates between Hilary Putnam (1926–2016) and Richard Rorty\n(1931–2007) though broadly pragmatic ideas were defended by\nother philosophers as well (Bacon 2012: Ch. 4). (One example is\nCrispin Wright’s superassertibility theory (1992, 2001) which he\nclaims is “as well equipped to express the aspiration for a\ndeveloped pragmatist conception of truth as any other candidate”\n(2001: 781) though he does not accept the pragmatist label.) While\nthese “neo-pragmatic” theories of truth sometimes\nresembled the classical pragmatic accounts of Peirce, James, or Dewey,\nthey also differed significantly, often by framing the concept of\ntruth in explicitly epistemic terms such as assertibility or by\ndrawing on intervening philosophical developments.\n\nAt the outset, neo-pragmatism was motivated by a renewed\ndissatisfaction with correspondence theories of truth and the\nmetaphysical frameworks supporting them. Some neo-pragmatic theories\nof truth grew out of a rejection of metaphysical realism (e.g., Putnam\n1981; for background see Khlentzos 2016). If metaphysical realism\ncannot be supported then this undermines a necessary condition for the\ncorrespondence theory of truth: namely, that there be a\nmind-independent reality to which propositions correspond. Other\nneo-pragmatic approaches emerged from a rejection of\nrepresentationalism: if knowledge is not the mind representing\nobjective reality—if we cannot make clear sense of how the mind\ncould be a “mirror of nature” to use Rorty’s (1979)\nterm—then we are also well-advised to give up thinking of truth\nin realist, correspondence terms. Despite these similar starting\npoints, neo-pragmatic theories took several different and evolving\nforms over the final decades of the twentieth century.\n\nAt one extreme some neo-pragmatic theories of truth seemed to endorse\nrelativism about truth (whether and in what sense they did remains a\npoint of contention). This view was closely associated with\ninfluential work by Richard Rorty (1982, 1991a,b). The rejection of\nrepresentationalism and the correspondence theory of truth could lead\nto the conclusion that inquiry is best viewed as aiming at agreement\nor “solidarity”, not knowledge or truth as these terms are\ntraditionally understood. This had the radical consequence of\nsuggesting that truth is no more than “what our peers will,\nceteris paribus, let us get away with saying” (Rorty\n1979: 176; Rorty [2010a: 45] admits this phrase is provocative) or\njust “an expression of commendation” (Rorty 1991a: 23).\nNot surprisingly, many found this position deeply problematic since it\nappears to relativize truth to whatever one’s audience will\naccept (Baghramian 2004: 147). A related concern is that this position\nalso seems to conflate truth with justification, suggesting that if a\nclaim meets contextual standards of acceptability then it also counts\nas true (Gutting 2003). Rorty for one often admitted as much, noting\nthat he tended to “swing back and forth between trying to reduce\ntruth to justification and propounding some form of minimalism about\ntruth” (1998: 21).\n\nA possible response to the accusation of relativism is to claim that\nthis neo-pragmatic approach does not aim to be a full-fledged theory\nof truth. Perhaps truth is actually a rather light-weight concept and\ndoes not need the heavy metaphysical lifting implied by putting\nforward a “theory”. If the goal is not to describe what\ntruth is but rather to describe how “truth” is used, then\nthese uses are fairly straightforward: among other things, to make\ngeneralizations (“everything you said is true”), to\ncommend (“so true!”), and to caution (“what you said\nis justified, but it might not be true”) (Rorty 1998: 22; 2000:\n4). None of these uses requires that we embark on a possibly fruitless\nhunt for the conditions that make a proposition true, or for a proper\ndefinition or theory of truth. If truth is “indefinable”\n(Rorty 2010b: 391) then Rorty’s approach should not be described as\na definition or theory of truth, relativist or otherwise.\n\nThis approach differs in some noteworthy ways from earlier pragmatic\naccounts of truth. For one thing it is able to draw on, and draw\nparallels with, a range of well-developed non-correspondence theories\nof truth that begin (and sometimes end) by stressing the fundamental\nequivalence of “S is p” and\n“‘S is p’ is true”. These\ntheories, including disquotationalism, deflationism, and minimalism,\nsimply were not available to earlier pragmatists (though Peirce does\nat times discuss the underlying notions). Furthermore, while Peirce\nand Dewey, for example, were proponents of scientific inquiry and\nscientific processes of verification, on this neo-pragmatic approach\nscience is no more objective or rational than other disciplines: as\nRorty put it, “the only sense in which science is exemplary is\nthat it is a model of human solidarity” (1991b: 39). Finally, on\nthis approach Peirce, James, and Dewey simply did not go far enough:\nthey failed to recognize the radical implications of their accounts of\ntruth, or else failed to convey these implications adequately. In turn\nmuch of the critical response to this kind of neo-pragmatism is that\nit goes too far by treating truth merely as a sign of commendation\n(plus a few other monor functions). In other words, this type of\nneo-pragmatism can be accused of going to unpragmatic extremes\n(e.g., Haack 1998; also the exchange in Rorty & Price 2010).\n\nA less extreme version of neo-pragmatism attempts to preserve\ntruth’s objectivity and independence while still rejecting\nmetaphysical realism. This version was most closely associated with\nHilary Putnam, though Putnam’s views changed over time (see\nHildebrand 2003 for an overview of Putnam’s evolution). While\nthis approach frames truth in epistemic terms—primarily in terms\nof justification and verification—it amplifies these terms to\nensure that truth is more than mere consensus. For example, this\napproach might identify “being true with being warrantedly\nassertible under ideal conditions” (Putnam 2012b: 220). More\nspecifically, it might demand “that truth is independent of\njustification here and now, but not independent of all\njustification” (Putnam 1981: 56).\n\nRather than play up assertibility before one’s peers or\ncontemporaries, this neo-pragmatic approach frames truth in terms of\nideal warranted assertibility: namely, warranted assertibility in the\nlong run and before all audiences, or at least before all\nwell-informed audiences. Not only does this sound much less relativist\nbut it also bears a strong resemblance to Peirce’s and\nDewey’s accounts (though Putnam, for one, resisted the\ncomparison: “my admiration for the classical pragmatists does\nnot extend to any of the different theories of truth that Peirce,\nJames, and Dewey advanced” [2012c: 70]).\n\nTo repeat, this neo-pragmatic approach is designed to avoid the\nproblems facing correspondence theories of truth while still\npreserving truth’s objectivity. In the 1980s this view was\nassociated with Putnam’s broader program of “internal\nrealism”: the idea that “what objects does the world\nconsist of? is a question that it only makes sense to ask\nwithin a theory or description” (Putnam 1981: 49,\nemphasis in original). Internal realism was designed as an alternative\nto metaphysical realism that dispensed with achieving an external\n“God’s Eye Point of View” while still preserving\ntruth’s objectivity, albeit internal to a given theory. (For\nadditional criticisms of metaphysical realism see Khlentzos 2016.) In\nthe mid-1990s Putnam’s views shifted toward what he called\n“natural realism” (1999; for a critical discussion of\nPutnam’s changing views see Wright 2000). This shift came about\nin part because of problems with defining truth in epistemic terms\nsuch as ideal warranted assertibility. One problem is that it is\ndifficult to see how one can verify either what these ideal conditions\nare or whether they have been met: either one might attempt to do so\nby taking an external “god’s eye view”, which would\nbe inconsistent with internal realism, or one might come to this\ndetermination from within one’s current theory, which would be\ncircular and relativistic. (As Putnam put it, “to talk of\nepistemically ‘ideal’ connections must either be\nunderstood outside the framework of internal realism or it too must be\nunderstood in a solipsistic manner ” (2012d: 79–80).)\nSince neither option seems promising this does not bode well for\ninternal realism or for any account of truth closely associated with\nit.\n\nIf internal realism cannot be sustained then a possible fallback\nposition is “natural realism”—the view “that\nthe objects of (normal ‘veridical’) perception are\n‘external’ things, and, more generally, aspects of\n‘external’ reality” (Putnam 1999: 10)—which\nleads to a reconciliation of sorts with the correspondence theory of\ntruth. A natural realism suggests “that true empirical\nstatements correspond to states of affairs that actually obtain”\n(Putnam 2012a: 97), though this does not commit one to a\ncorrespondence theory of truth across the board. In other words,\nnatural realism leaves open the possibility that not all true\nstatements “correspond” to a state of affairs, and even\nthose that do (such as empirical statements) do not always correspond\nin the same way (Putnam 2012c: 68–69; 2012a: 98). While not a\nringing endorsement of the correspondence theory of truth, at least as\ntraditionally understood, this neo-pragmatic approach is not a\nflat-out rejection either.\n\nViewing truth in terms of ideal warranted assertibility has obvious\npragmatic overtones of Peirce and Dewey. In contrast, viewing truth in\nterms of a commitment to natural realism is not so clearly pragmatic\nthough some parallels still exist. Because natural realism allows for\ndifferent types of truth-conditions—some but not all statements\nare true in virtue of correspondence—it is compatible with the\ntruth-aptness of normative discourse: just because ethical statements,\nfor example, do not correspond in an obvious way to ethical state of\naffairs is no reason to deny that they can be true (Putnam 2002). In\naddition, like earlier pragmatic theories of truth, this neo-pragmatic\napproach redefines correspondence: in this case, by taking a pluralist\napproach to the correspondence relation itself (Goodman 2013; see also\nHowat 2021 and Shields (forthcoming) for recent attempts to show the\ncompatibility of pragmatic and correspondence theories of truth).\n\nThese two approaches—one tending toward relativism, the other\ntending toward realism—represented the two main currents in late\ntwentieth century neo-pragmatism. Both approaches, at least initially,\nframed truth in terms of justification, verification, or\nassertibility, reflecting a debt to the earlier accounts of Peirce,\nJames, and Dewey. Subsequently they evolved in opposite directions.\nThe first approach, associated with Rorty, flirts with relativism and\nimplies that truth is not the important philosophical concept it has\nlong been taken to be. Here, to take a neo-pragmatic stance toward\ntruth is to recognize the relatively mundane functions this concept\nplays: to generalize, to commend, to caution and not much else. To ask\nfor more, to ask for something “beyond the here and now”,\nonly commits us to “the banal thought that we might be\nwrong” (Rorty 2010a: 45). The second neo-pragmatic approach,\nassociated with Putnam, attempts to preserve truth’s objectivity\nand the important role it plays across scientific, mathematical,\nethical, and political discourse. This could mean simply “that\ntruth is independent of justification here and now” or\n“that to call a statement of any kind…true is to say that\nit has the sort of correctness appropriate to the kind of statement it\nis” (2012a: 97–98). On this account truth points to\nstandards of correctness more rigorous than simply what our peers will\nlet us get away with saying.\n",
    "section_title": "2. Neo-Pragmatic Theories of Truth",
    "entry_title": "The Pragmatic Theory of Truth",
    "hierarchy_title": "The Pragmatic Theory of Truth || Neo-Pragmatic Theories of Truth",
    "tokenized_text": [
        "neopragmatic",
        "theory",
        "truth",
        "neopragmatic",
        "theory",
        "truth",
        "pragmatic",
        "theory",
        "truth",
        "enjoyed",
        "resurgence",
        "last",
        "decade",
        "twentieth",
        "century",
        "resurgence",
        "especially",
        "visible",
        "debate",
        "hilary",
        "putnam",
        "richard",
        "rorty",
        "though",
        "broadly",
        "pragmatic",
        "idea",
        "defended",
        "philosopher",
        "well",
        "bacon",
        "ch",
        "one",
        "example",
        "crispin",
        "wright",
        "superassertibility",
        "theory",
        "claim",
        "well",
        "equipped",
        "express",
        "aspiration",
        "developed",
        "pragmatist",
        "conception",
        "truth",
        "candidate",
        "though",
        "accept",
        "pragmatist",
        "label",
        "neopragmatic",
        "theory",
        "truth",
        "sometimes",
        "resembled",
        "classical",
        "pragmatic",
        "account",
        "peirce",
        "james",
        "dewey",
        "also",
        "differed",
        "significantly",
        "often",
        "framing",
        "concept",
        "truth",
        "explicitly",
        "epistemic",
        "term",
        "assertibility",
        "drawing",
        "intervening",
        "philosophical",
        "development",
        "outset",
        "neopragmatism",
        "motivated",
        "renewed",
        "dissatisfaction",
        "correspondence",
        "theory",
        "truth",
        "metaphysical",
        "framework",
        "supporting",
        "neopragmatic",
        "theory",
        "truth",
        "grew",
        "rejection",
        "metaphysical",
        "realism",
        "eg",
        "putnam",
        "background",
        "see",
        "khlentzos",
        "metaphysical",
        "realism",
        "supported",
        "undermines",
        "necessary",
        "condition",
        "correspondence",
        "theory",
        "truth",
        "namely",
        "mindindependent",
        "reality",
        "proposition",
        "correspond",
        "neopragmatic",
        "approach",
        "emerged",
        "rejection",
        "representationalism",
        "knowledge",
        "mind",
        "representing",
        "objective",
        "realityif",
        "make",
        "clear",
        "sense",
        "mind",
        "could",
        "mirror",
        "nature",
        "use",
        "rorty",
        "termthen",
        "also",
        "welladvised",
        "give",
        "thinking",
        "truth",
        "realist",
        "correspondence",
        "term",
        "despite",
        "similar",
        "starting",
        "point",
        "neopragmatic",
        "theory",
        "took",
        "several",
        "different",
        "evolving",
        "form",
        "final",
        "decade",
        "twentieth",
        "century",
        "one",
        "extreme",
        "neopragmatic",
        "theory",
        "truth",
        "seemed",
        "endorse",
        "relativism",
        "truth",
        "whether",
        "sense",
        "remains",
        "point",
        "contention",
        "view",
        "closely",
        "associated",
        "influential",
        "work",
        "richard",
        "rorty",
        "a",
        "b",
        "rejection",
        "representationalism",
        "correspondence",
        "theory",
        "truth",
        "could",
        "lead",
        "conclusion",
        "inquiry",
        "best",
        "viewed",
        "aiming",
        "agreement",
        "solidarity",
        "knowledge",
        "truth",
        "term",
        "traditionally",
        "understood",
        "radical",
        "consequence",
        "suggesting",
        "truth",
        "peer",
        "ceteris",
        "paribus",
        "let",
        "u",
        "get",
        "away",
        "saying",
        "rorty",
        "rorty",
        "a",
        "admits",
        "phrase",
        "provocative",
        "expression",
        "commendation",
        "rorty",
        "a",
        "surprisingly",
        "many",
        "found",
        "position",
        "deeply",
        "problematic",
        "since",
        "appears",
        "relativize",
        "truth",
        "whatever",
        "one",
        "audience",
        "accept",
        "baghramian",
        "related",
        "concern",
        "position",
        "also",
        "seems",
        "conflate",
        "truth",
        "justification",
        "suggesting",
        "claim",
        "meet",
        "contextual",
        "standard",
        "acceptability",
        "also",
        "count",
        "true",
        "gutting",
        "rorty",
        "one",
        "often",
        "admitted",
        "much",
        "noting",
        "tended",
        "swing",
        "back",
        "forth",
        "trying",
        "reduce",
        "truth",
        "justification",
        "propounding",
        "form",
        "minimalism",
        "truth",
        "possible",
        "response",
        "accusation",
        "relativism",
        "claim",
        "neopragmatic",
        "approach",
        "aim",
        "fullfledged",
        "theory",
        "truth",
        "perhaps",
        "truth",
        "actually",
        "rather",
        "lightweight",
        "concept",
        "need",
        "heavy",
        "metaphysical",
        "lifting",
        "implied",
        "putting",
        "forward",
        "theory",
        "goal",
        "describe",
        "truth",
        "rather",
        "describe",
        "truth",
        "used",
        "us",
        "fairly",
        "straightforward",
        "among",
        "thing",
        "make",
        "generalization",
        "everything",
        "said",
        "true",
        "commend",
        "true",
        "caution",
        "said",
        "justified",
        "might",
        "true",
        "rorty",
        "none",
        "us",
        "requires",
        "embark",
        "possibly",
        "fruitless",
        "hunt",
        "condition",
        "make",
        "proposition",
        "true",
        "proper",
        "definition",
        "theory",
        "truth",
        "truth",
        "indefinable",
        "rorty",
        "b",
        "rorty",
        "approach",
        "described",
        "definition",
        "theory",
        "truth",
        "relativist",
        "otherwise",
        "approach",
        "differs",
        "noteworthy",
        "way",
        "earlier",
        "pragmatic",
        "account",
        "truth",
        "one",
        "thing",
        "able",
        "draw",
        "draw",
        "parallel",
        "range",
        "welldeveloped",
        "noncorrespondence",
        "theory",
        "truth",
        "begin",
        "sometimes",
        "end",
        "stressing",
        "fundamental",
        "equivalence",
        "p",
        "p",
        "true",
        "theory",
        "including",
        "disquotationalism",
        "deflationism",
        "minimalism",
        "simply",
        "available",
        "earlier",
        "pragmatist",
        "though",
        "peirce",
        "time",
        "discus",
        "underlying",
        "notion",
        "furthermore",
        "peirce",
        "dewey",
        "example",
        "proponent",
        "scientific",
        "inquiry",
        "scientific",
        "process",
        "verification",
        "neopragmatic",
        "approach",
        "science",
        "objective",
        "rational",
        "discipline",
        "rorty",
        "put",
        "sense",
        "science",
        "exemplary",
        "model",
        "human",
        "solidarity",
        "b",
        "finally",
        "approach",
        "peirce",
        "james",
        "dewey",
        "simply",
        "go",
        "far",
        "enough",
        "failed",
        "recognize",
        "radical",
        "implication",
        "account",
        "truth",
        "else",
        "failed",
        "convey",
        "implication",
        "adequately",
        "turn",
        "much",
        "critical",
        "response",
        "kind",
        "neopragmatism",
        "go",
        "far",
        "treating",
        "truth",
        "merely",
        "sign",
        "commendation",
        "plus",
        "monor",
        "function",
        "word",
        "type",
        "neopragmatism",
        "accused",
        "going",
        "unpragmatic",
        "extreme",
        "eg",
        "haack",
        "also",
        "exchange",
        "rorty",
        "price",
        "le",
        "extreme",
        "version",
        "neopragmatism",
        "attempt",
        "preserve",
        "truth",
        "objectivity",
        "independence",
        "still",
        "rejecting",
        "metaphysical",
        "realism",
        "version",
        "closely",
        "associated",
        "hilary",
        "putnam",
        "though",
        "putnam",
        "view",
        "changed",
        "time",
        "see",
        "hildebrand",
        "overview",
        "putnam",
        "evolution",
        "approach",
        "frame",
        "truth",
        "epistemic",
        "termsprimarily",
        "term",
        "justification",
        "verificationit",
        "amplifies",
        "term",
        "ensure",
        "truth",
        "mere",
        "consensus",
        "example",
        "approach",
        "might",
        "identify",
        "true",
        "warrantedly",
        "assertible",
        "ideal",
        "condition",
        "putnam",
        "b",
        "specifically",
        "might",
        "demand",
        "truth",
        "independent",
        "justification",
        "independent",
        "justification",
        "putnam",
        "rather",
        "play",
        "assertibility",
        "one",
        "peer",
        "contemporary",
        "neopragmatic",
        "approach",
        "frame",
        "truth",
        "term",
        "ideal",
        "warranted",
        "assertibility",
        "namely",
        "warranted",
        "assertibility",
        "long",
        "run",
        "audience",
        "least",
        "wellinformed",
        "audience",
        "sound",
        "much",
        "le",
        "relativist",
        "also",
        "bear",
        "strong",
        "resemblance",
        "peirce",
        "dewey",
        "account",
        "though",
        "putnam",
        "one",
        "resisted",
        "comparison",
        "admiration",
        "classical",
        "pragmatist",
        "extend",
        "different",
        "theory",
        "truth",
        "peirce",
        "james",
        "dewey",
        "advanced",
        "c",
        "repeat",
        "neopragmatic",
        "approach",
        "designed",
        "avoid",
        "problem",
        "facing",
        "correspondence",
        "theory",
        "truth",
        "still",
        "preserving",
        "truth",
        "objectivity",
        "s",
        "view",
        "associated",
        "putnam",
        "broader",
        "program",
        "internal",
        "realism",
        "idea",
        "object",
        "world",
        "consist",
        "question",
        "make",
        "sense",
        "ask",
        "within",
        "theory",
        "description",
        "putnam",
        "emphasis",
        "original",
        "internal",
        "realism",
        "designed",
        "alternative",
        "metaphysical",
        "realism",
        "dispensed",
        "achieving",
        "external",
        "god",
        "eye",
        "point",
        "view",
        "still",
        "preserving",
        "truth",
        "objectivity",
        "albeit",
        "internal",
        "given",
        "theory",
        "additional",
        "criticism",
        "metaphysical",
        "realism",
        "see",
        "khlentzos",
        "mids",
        "putnam",
        "view",
        "shifted",
        "toward",
        "called",
        "natural",
        "realism",
        "critical",
        "discussion",
        "putnam",
        "changing",
        "view",
        "see",
        "wright",
        "shift",
        "came",
        "part",
        "problem",
        "defining",
        "truth",
        "epistemic",
        "term",
        "ideal",
        "warranted",
        "assertibility",
        "one",
        "problem",
        "difficult",
        "see",
        "one",
        "verify",
        "either",
        "ideal",
        "condition",
        "whether",
        "met",
        "either",
        "one",
        "might",
        "attempt",
        "taking",
        "external",
        "god",
        "eye",
        "view",
        "would",
        "inconsistent",
        "internal",
        "realism",
        "one",
        "might",
        "come",
        "determination",
        "within",
        "one",
        "current",
        "theory",
        "would",
        "circular",
        "relativistic",
        "putnam",
        "put",
        "talk",
        "epistemically",
        "ideal",
        "connection",
        "must",
        "either",
        "understood",
        "outside",
        "framework",
        "internal",
        "realism",
        "must",
        "understood",
        "solipsistic",
        "manner",
        "d",
        "since",
        "neither",
        "option",
        "seems",
        "promising",
        "bode",
        "well",
        "internal",
        "realism",
        "account",
        "truth",
        "closely",
        "associated",
        "internal",
        "realism",
        "sustained",
        "possible",
        "fallback",
        "position",
        "natural",
        "realism",
        "the",
        "view",
        "object",
        "normal",
        "veridical",
        "perception",
        "external",
        "thing",
        "generally",
        "aspect",
        "external",
        "reality",
        "putnam",
        "which",
        "lead",
        "reconciliation",
        "sort",
        "correspondence",
        "theory",
        "truth",
        "natural",
        "realism",
        "suggests",
        "true",
        "empirical",
        "statement",
        "correspond",
        "state",
        "affair",
        "actually",
        "obtain",
        "putnam",
        "a",
        "though",
        "commit",
        "one",
        "correspondence",
        "theory",
        "truth",
        "across",
        "board",
        "word",
        "natural",
        "realism",
        "leaf",
        "open",
        "possibility",
        "true",
        "statement",
        "correspond",
        "state",
        "affair",
        "even",
        "empirical",
        "statement",
        "always",
        "correspond",
        "way",
        "putnam",
        "c",
        "a",
        "ringing",
        "endorsement",
        "correspondence",
        "theory",
        "truth",
        "least",
        "traditionally",
        "understood",
        "neopragmatic",
        "approach",
        "flatout",
        "rejection",
        "either",
        "viewing",
        "truth",
        "term",
        "ideal",
        "warranted",
        "assertibility",
        "obvious",
        "pragmatic",
        "overtone",
        "peirce",
        "dewey",
        "contrast",
        "viewing",
        "truth",
        "term",
        "commitment",
        "natural",
        "realism",
        "clearly",
        "pragmatic",
        "though",
        "parallel",
        "still",
        "exist",
        "natural",
        "realism",
        "allows",
        "different",
        "type",
        "truthconditionssome",
        "statement",
        "true",
        "virtue",
        "correspondenceit",
        "compatible",
        "truthaptness",
        "normative",
        "discourse",
        "ethical",
        "statement",
        "example",
        "correspond",
        "obvious",
        "way",
        "ethical",
        "state",
        "affair",
        "reason",
        "deny",
        "true",
        "putnam",
        "addition",
        "like",
        "earlier",
        "pragmatic",
        "theory",
        "truth",
        "neopragmatic",
        "approach",
        "redefines",
        "correspondence",
        "case",
        "taking",
        "pluralist",
        "approach",
        "correspondence",
        "relation",
        "goodman",
        "see",
        "also",
        "howat",
        "shield",
        "forthcoming",
        "recent",
        "attempt",
        "show",
        "compatibility",
        "pragmatic",
        "correspondence",
        "theory",
        "truth",
        "two",
        "approachesone",
        "tending",
        "toward",
        "relativism",
        "tending",
        "toward",
        "realismrepresented",
        "two",
        "main",
        "current",
        "late",
        "twentieth",
        "century",
        "neopragmatism",
        "approach",
        "least",
        "initially",
        "framed",
        "truth",
        "term",
        "justification",
        "verification",
        "assertibility",
        "reflecting",
        "debt",
        "earlier",
        "account",
        "peirce",
        "james",
        "dewey",
        "subsequently",
        "evolved",
        "opposite",
        "direction",
        "first",
        "approach",
        "associated",
        "rorty",
        "flirt",
        "relativism",
        "implies",
        "truth",
        "important",
        "philosophical",
        "concept",
        "long",
        "taken",
        "take",
        "neopragmatic",
        "stance",
        "toward",
        "truth",
        "recognize",
        "relatively",
        "mundane",
        "function",
        "concept",
        "play",
        "generalize",
        "commend",
        "caution",
        "much",
        "else",
        "ask",
        "ask",
        "something",
        "beyond",
        "commits",
        "u",
        "banal",
        "thought",
        "might",
        "wrong",
        "rorty",
        "a",
        "second",
        "neopragmatic",
        "approach",
        "associated",
        "putnam",
        "attempt",
        "preserve",
        "truth",
        "objectivity",
        "important",
        "role",
        "play",
        "across",
        "scientific",
        "mathematical",
        "ethical",
        "political",
        "discourse",
        "could",
        "mean",
        "simply",
        "truth",
        "independent",
        "justification",
        "call",
        "statement",
        "kindtrue",
        "say",
        "sort",
        "correctness",
        "appropriate",
        "kind",
        "statement",
        "a",
        "account",
        "truth",
        "point",
        "standard",
        "correctness",
        "rigorous",
        "simply",
        "peer",
        "let",
        "u",
        "get",
        "away",
        "saying"
    ]
}