{
    "main_text": "The Lvov Years: 1895–1938 || On the so-called Relative Truths (1900)\n3.2 Actions and Products (1912)\n\nFor quite some time Twardowski thought that logic was dependent on\npsychology\n [10],\n and continued to hold the psychologistic idea of meaning as mental\ncontent from Content and Object. In his\n‘Self-Portrait,’ Twardowski says that he changed his mind\nin an anti-psychologistic sense because of Husserl's Logical\nInvestigations\n (1900/01).[11]\n ‘Actions and Products’ (1912) is the first printed work\nwhere Twardowski favors an ‘Aristotelian’ view of ideal\nmeaning, i.e. of meaning in specie, which he associates with\nthat of Husserl's in the Logical Investigations. \n\nIn marking the line of demarcation between logic and psychology on the\nbasis of the distinction act/product which underlies his theory of\nmeaning, Twardowski writes:\n\nIndeed, a rigorous demarcation of products from actions has already\ncontributed enormously to liberating logic from psychological\naccretions. (Twardowski 1912, §45, 132)\n\n\nTwardowski's mature theory of meaning is connected with the rigorous\ndefinition of the distinction between actions and\nproducts of actions (while in Relative Truths he speaks\nof judgments as actions or products). On the basis of grammatical\nanalyses, purporting however to show logically salient differences,\nTwardowski establishes a basic distinction between physical,\npsychical (i.e. mental), and psychophysical actions and\ntheir products. The analysis is reminiscent in philosophical style of\nthat of ‘the presented’ in Content and Object,\nthough more general, and a nice example of the method which has become\nnow strongly associated with analytic philosophy.\n\nThe relationship between an action and what results from it, its\nproduct, is exemplified linguistically in the relationship between a\nverb and the corresponding noun as internal complement (Twardowski\n1912, §1, 10; §8, 107): \n\n\n\n\n\nAct\nProduct \n\nPhysical\nrunning\nrun \n\nMental\njudging\njudgment \n\nPsychophysical\nspeaking\nspeech  \n\n\n\nA psychophysical product (e.g., a speech) differs from a mental\nproduct (e.g., a judgment) because it is perceptible to senses; it\ndiffers from a physical product (e.g., a run) because in the\npsychophysical action which produces it (speaking) a mental action is\nalso involved, which has bearing on the physical action, and thus on\nits product (§10). In some cases, a psychophysical product\nexpresses a mental product; for instance, a sentence is a\npsychophysical product which expresses a mental product, a\njudgment.\n\nTwardowski points out that the meaning of the noun\n‘judgment,’ like other nouns (‘mistake’), is\nambiguous between action and product. A judgment in the sense of the\naction (a judging) is a judgment in the psychological sense,\nwhile a judgment in the sense of the product is a judgment in the\nlogical sense (§14) (a third meaning of\n‘judgment’ is that of ‘disposition, aptitude to make\ncorrect judgments,’ §15).\n\nTwardowski points out that he uses ‘judgment’ in the sense\nof ‘judgment in the logical sense,’ i.e. the product of\nthe action of judging, and he clarifies that what he means now by\n‘judgment-product’ is the content of judgment in\nContent and Object (§24, n. 37, 117). Exactly as it was\nthe case there, the judgment exists as long as someone performs the\ncorresponding action of judging; for this reason, it is called a\nnon-enduring product (§23, 116).\n\nNon-enduring products do not exist in actuality separately from the\ncorresponding actions, but only in conjunction with them; we can only\nanalyze them abstractly apart from these actions. On the other hand,\nenduring products can and do exist in actuality apart from the actions\nowing to which they arise (Twardowski 1912, n. 41, 116).\n\nEnduring products last longer than the action which produces\nthem; they originate from a transformation or a rearrangement of\npre-existing physical material in the course of the action: footprints\nin the sand are enduring products arising from the change of\nconfiguration of grains of sand (the material) as a product of the\naction of walking applied to that material (Twardowski points out that\nthe product is not the grains of sand arranged in some way, but the\narrangement itself, §26). If actions are processes, non-enduring\nproducts are events whereas enduring products present\nthemselves as things (§ 27). Among enduring products, we\nfind physical products (such as footprints in the sand) and\npsychophysical products (such as paintings). A mental product, such as\na judgment, is never enduring (§29), but it can have its\nexpression in an enduring psychophysical product, such as a\nwritten sentence. \n\nThe process of preserving non-enduring products such as judgments in\nenduring products such as written sentences is a complex one\n(§37), and goes in two steps. \n\nIn step one a spoken sentence is produced which expresses a judgment,\nin such a way that the judgment is the meaning of the sentence and the\nsentence is the sign of the judgment. The process goes as follows. A\nnon-enduring mental product, a judgment (together with the action of\njudging), which is non-perceptible, gives rise—by being its\n(partial) cause—to a non-enduring psychophysical product, a\nspoken sentence, which is perceptible. In this case, the spoken\nsentence is the expression of the judgment (§30). Now, if\nthe spoken sentence becomes itself a partial cause of another\njudgment, which (we would say) is a token of the same type of the\ninitial judgment (by partially causing an action of judging which\nproduces that other judgment in another person or at a different time\nin the same person), then the spoken sentence can also count as\nthe sign of the judgment, and the judgment as the\nmeaning of the expression (§32, §34). The condition\njust sketched in the antecedent is fundamental: without it, a sentence\np might very well have been an expression of a judgment\nj once (j was a partial cause of p), but no\nmeaning is linked with p: for, if p is incomprehensible,\nnamely it is not a partial cause of another judgment j′,\nthen nothing can be said to be its meaning (§31).\n\nStep two is to preserve the spoken sentence (a non-enduring\npsychophysical product) in an enduring psychophysical product\ns, a written\n sentence.[12]\n When a judgment is preserved in this way, it has in the sign an\nexistence called potential. This is because the sign may at any\nmoment cause the formation of an identical or similar judgment\n(Twardowski 1912, §34), and it will be able to (partially) cause\njudgments as long as it lasts. In consequence of this,\n‘meaning’ can therefore also mean \n\nthe capacity to evoke a mental product in the individual on whom a\npsychophysical product acts as a sign of that mental product, or, more\nbriefly, the capacity to bring the corresponding mental product to\nawareness. (Twardowski 1912, n. 51, 125.)\n\n\nOnce they are preserved in this two-step way, non-enduring products\nassume not only the illusory appearance of enduring products, but also\nof products which are somehow independent from the actions\nwhich produce them. The appearance of independence is made stronger by\nthe fact that we do as if one and the same judgment-product existed in\nall individuals, although many judgment-products are elicited\nby the written sentence-product. All these many judgments are\ndifferent from each other, but, insofar as we consider a judgment to\nbe the meaning of a sentence which is its sign\n\nthere must be a group of common attributes in these individual mental\nproducts. And it is precisely these common attributes (in which these\nindividual products accord) that we ordinarily regard as the meaning\nof the psychophysical product, as the content inherent in it, provided\nof course that these common attributes correspond to the intent with\nwhich that psychophysical product was utilized as a sign. [...] Thus,\nwe speak of only a single meaning of a sign—barring cases of\nambiguity—and not of as many meanings as there are mental\nproducts that are aroused or capable of being aroused, by that sign in\nthe persons on whom it acts. Now, a meaning conceived in this matter\nis no longer a concrete mental product, but something at which we\narrive by way of an abstraction performed on concrete products.\n(Twardowski 1912, §39, 128)\n\n\nTo this passage, Twardowski appends a note referring to Husserl's\nnotion of ideal meaning. The relationship between Husserl's and\nTwardowski's notion of meaning as well as the status of Twardowski's\nunique meaning has been and remains object of discussion (see\nPaczkowska-Łagowska 1979, Buczyńska-Garewicz 1980, Placek\n1996, Brandl 1998, Schaar 2015, 108). These matters should be\nconsidered as yet unsettled. \n\nThe introduction of the notion of the unique meaning of a sentence\nleads Twardowski to make a further distinction between substitutive\n(artefacta) and non-substitutive judgments. Substitutive judgments\naren't real judgments, but fictitious ones. The latter are in fact the\npresented judgments of Content and Object; the difference is\nthat in Actions and Products, Twardowski applies the concept of\nsubstitutive judgments explicitly to logic: the sentences uttered or\nwritten by logicians-at-work are not sentences which express or have\nas meanings judgments which are really passed by them, but only\npresented judgments, produced thus by actions of\npresenting—which are different actions from actual judging acts.\nThis happens for instance when a logician constructs a valid syllogism\nmade up of materially false sentences to give examples of formally\nvalid inferences (§44, 130). In this case, the logician does not\nactually judge that all triangles are square, that all squares are\nround, and that all triangles are round, but she merely\npresents the corresponding judgments. The sentences ‘all\ntriangles are square,’ ‘all squares are round,’ and\n‘all triangles are round’ are not real sentences, but\nartificial ones, because they are “expressions of artificial\nproducts that substitute for actual judgments, namely merely\nrepresented judgments” (Ibid.). The meanings of these artificial\nsentences are artificial judgments, because they are merely presented,\nnot passed. These artificial judgments are the subject-matter of logic\n(on this point, Twardowski is again indebted to Bolzano). Operating\nwith surrogate sentences such as ‘all triangles are\nsquare’ constitutes the most extreme example of “making\nmental products independent of the actions owing to which alone they\ncan truly (actually) exist” (§44, 131). \n\nTwardowski's distinction between acts and products is presently being\nre-discovered in act-based theories of semantic content, within which\nTwardowski's notion of product is considered an interesting\nalternative to the notion of proposition (as the mind-independent and\nlanguage-independent content of assertions, meaning of sentences,\nprimary truthbearer, and object of propositional attitudes). See\nMoltmann 2014.\n",
    "section_title": "3.2 Actions and Products (1912)",
    "entry_title": "Kazimierz Twardowski",
    "hierarchy_title": "Kazimierz Twardowski || The Lvov Years: 1895–1938 || On the so-called Relative Truths (1900)",
    "tokenized_text": [
        "lvov",
        "year",
        "socalled",
        "relative",
        "truth",
        "action",
        "product",
        "quite",
        "time",
        "twardowski",
        "thought",
        "logic",
        "dependent",
        "psychology",
        "continued",
        "hold",
        "psychologistic",
        "idea",
        "meaning",
        "mental",
        "content",
        "content",
        "object",
        "selfportrait",
        "twardowski",
        "say",
        "changed",
        "mind",
        "antipsychologistic",
        "sense",
        "husserl",
        "s",
        "logical",
        "investigation",
        "action",
        "product",
        "first",
        "printed",
        "work",
        "twardowski",
        "favor",
        "aristotelian",
        "view",
        "ideal",
        "meaning",
        "ie",
        "meaning",
        "specie",
        "associate",
        "husserl",
        "s",
        "logical",
        "investigation",
        "marking",
        "line",
        "demarcation",
        "logic",
        "psychology",
        "basis",
        "distinction",
        "actproduct",
        "underlies",
        "theory",
        "meaning",
        "twardowski",
        "writes",
        "indeed",
        "rigorous",
        "demarcation",
        "product",
        "action",
        "already",
        "contributed",
        "enormously",
        "liberating",
        "logic",
        "psychological",
        "accretion",
        "twardowski",
        "twardowski",
        "s",
        "mature",
        "theory",
        "meaning",
        "connected",
        "rigorous",
        "definition",
        "distinction",
        "action",
        "product",
        "action",
        "relative",
        "truth",
        "speaks",
        "judgment",
        "action",
        "product",
        "basis",
        "grammatical",
        "analysis",
        "purporting",
        "however",
        "show",
        "logically",
        "salient",
        "difference",
        "twardowski",
        "establishes",
        "basic",
        "distinction",
        "physical",
        "psychical",
        "ie",
        "mental",
        "psychophysical",
        "action",
        "product",
        "analysis",
        "reminiscent",
        "philosophical",
        "style",
        "presented",
        "content",
        "object",
        "though",
        "general",
        "nice",
        "example",
        "method",
        "become",
        "strongly",
        "associated",
        "analytic",
        "philosophy",
        "relationship",
        "action",
        "result",
        "product",
        "exemplified",
        "linguistically",
        "relationship",
        "verb",
        "corresponding",
        "noun",
        "internal",
        "complement",
        "twardowski",
        "act",
        "product",
        "physical",
        "running",
        "run",
        "mental",
        "judging",
        "judgment",
        "psychophysical",
        "speaking",
        "speech",
        "psychophysical",
        "product",
        "eg",
        "speech",
        "differs",
        "mental",
        "product",
        "eg",
        "judgment",
        "perceptible",
        "sens",
        "differs",
        "physical",
        "product",
        "eg",
        "run",
        "psychophysical",
        "action",
        "produce",
        "speaking",
        "mental",
        "action",
        "also",
        "involved",
        "bearing",
        "physical",
        "action",
        "thus",
        "product",
        "case",
        "psychophysical",
        "product",
        "express",
        "mental",
        "product",
        "instance",
        "sentence",
        "psychophysical",
        "product",
        "express",
        "mental",
        "product",
        "judgment",
        "twardowski",
        "point",
        "meaning",
        "noun",
        "judgment",
        "like",
        "noun",
        "mistake",
        "ambiguous",
        "action",
        "product",
        "judgment",
        "sense",
        "action",
        "judging",
        "judgment",
        "psychological",
        "sense",
        "judgment",
        "sense",
        "product",
        "judgment",
        "logical",
        "sense",
        "third",
        "meaning",
        "judgment",
        "disposition",
        "aptitude",
        "make",
        "correct",
        "judgment",
        "twardowski",
        "point",
        "us",
        "judgment",
        "sense",
        "judgment",
        "logical",
        "sense",
        "ie",
        "product",
        "action",
        "judging",
        "clarifies",
        "mean",
        "judgmentproduct",
        "content",
        "judgment",
        "content",
        "object",
        "n",
        "exactly",
        "case",
        "judgment",
        "exists",
        "long",
        "someone",
        "performs",
        "corresponding",
        "action",
        "judging",
        "reason",
        "called",
        "nonenduring",
        "product",
        "nonenduring",
        "product",
        "exist",
        "actuality",
        "separately",
        "corresponding",
        "action",
        "conjunction",
        "analyze",
        "abstractly",
        "apart",
        "action",
        "hand",
        "enduring",
        "product",
        "exist",
        "actuality",
        "apart",
        "action",
        "owing",
        "arise",
        "twardowski",
        "n",
        "enduring",
        "product",
        "last",
        "longer",
        "action",
        "produce",
        "originate",
        "transformation",
        "rearrangement",
        "preexisting",
        "physical",
        "material",
        "course",
        "action",
        "footprint",
        "sand",
        "enduring",
        "product",
        "arising",
        "change",
        "configuration",
        "grain",
        "sand",
        "material",
        "product",
        "action",
        "walking",
        "applied",
        "material",
        "twardowski",
        "point",
        "product",
        "grain",
        "sand",
        "arranged",
        "way",
        "arrangement",
        "action",
        "process",
        "nonenduring",
        "product",
        "event",
        "whereas",
        "enduring",
        "product",
        "present",
        "thing",
        "among",
        "enduring",
        "product",
        "find",
        "physical",
        "product",
        "footprint",
        "sand",
        "psychophysical",
        "product",
        "painting",
        "mental",
        "product",
        "judgment",
        "never",
        "enduring",
        "expression",
        "enduring",
        "psychophysical",
        "product",
        "written",
        "sentence",
        "process",
        "preserving",
        "nonenduring",
        "product",
        "judgment",
        "enduring",
        "product",
        "written",
        "sentence",
        "complex",
        "one",
        "go",
        "two",
        "step",
        "step",
        "one",
        "spoken",
        "sentence",
        "produced",
        "express",
        "judgment",
        "way",
        "judgment",
        "meaning",
        "sentence",
        "sentence",
        "sign",
        "judgment",
        "process",
        "go",
        "follows",
        "nonenduring",
        "mental",
        "product",
        "judgment",
        "together",
        "action",
        "judging",
        "nonperceptible",
        "give",
        "riseby",
        "partial",
        "causeto",
        "nonenduring",
        "psychophysical",
        "product",
        "spoken",
        "sentence",
        "perceptible",
        "case",
        "spoken",
        "sentence",
        "expression",
        "judgment",
        "spoken",
        "sentence",
        "becomes",
        "partial",
        "cause",
        "another",
        "judgment",
        "would",
        "say",
        "token",
        "type",
        "initial",
        "judgment",
        "partially",
        "causing",
        "action",
        "judging",
        "produce",
        "judgment",
        "another",
        "person",
        "different",
        "time",
        "person",
        "spoken",
        "sentence",
        "also",
        "count",
        "sign",
        "judgment",
        "judgment",
        "meaning",
        "expression",
        "condition",
        "sketched",
        "antecedent",
        "fundamental",
        "without",
        "sentence",
        "p",
        "might",
        "well",
        "expression",
        "judgment",
        "j",
        "j",
        "partial",
        "cause",
        "p",
        "meaning",
        "linked",
        "p",
        "p",
        "incomprehensible",
        "namely",
        "partial",
        "cause",
        "another",
        "judgment",
        "j",
        "nothing",
        "said",
        "meaning",
        "step",
        "two",
        "preserve",
        "spoken",
        "sentence",
        "nonenduring",
        "psychophysical",
        "product",
        "enduring",
        "psychophysical",
        "product",
        "written",
        "sentence",
        "judgment",
        "preserved",
        "way",
        "sign",
        "existence",
        "called",
        "potential",
        "sign",
        "may",
        "moment",
        "cause",
        "formation",
        "identical",
        "similar",
        "judgment",
        "twardowski",
        "able",
        "partially",
        "cause",
        "judgment",
        "long",
        "last",
        "consequence",
        "meaning",
        "therefore",
        "also",
        "mean",
        "capacity",
        "evoke",
        "mental",
        "product",
        "individual",
        "psychophysical",
        "product",
        "act",
        "sign",
        "mental",
        "product",
        "briefly",
        "capacity",
        "bring",
        "corresponding",
        "mental",
        "product",
        "awareness",
        "twardowski",
        "n",
        "preserved",
        "twostep",
        "way",
        "nonenduring",
        "product",
        "assume",
        "illusory",
        "appearance",
        "enduring",
        "product",
        "also",
        "product",
        "somehow",
        "independent",
        "action",
        "produce",
        "appearance",
        "independence",
        "made",
        "stronger",
        "fact",
        "one",
        "judgmentproduct",
        "existed",
        "individual",
        "although",
        "many",
        "judgmentproducts",
        "elicited",
        "written",
        "sentenceproduct",
        "many",
        "judgment",
        "different",
        "insofar",
        "consider",
        "judgment",
        "meaning",
        "sentence",
        "sign",
        "must",
        "group",
        "common",
        "attribute",
        "individual",
        "mental",
        "product",
        "precisely",
        "common",
        "attribute",
        "individual",
        "product",
        "accord",
        "ordinarily",
        "regard",
        "meaning",
        "psychophysical",
        "product",
        "content",
        "inherent",
        "provided",
        "course",
        "common",
        "attribute",
        "correspond",
        "intent",
        "psychophysical",
        "product",
        "utilized",
        "sign",
        "thus",
        "speak",
        "single",
        "meaning",
        "signbarring",
        "case",
        "ambiguityand",
        "many",
        "meaning",
        "mental",
        "product",
        "aroused",
        "capable",
        "aroused",
        "sign",
        "person",
        "act",
        "meaning",
        "conceived",
        "matter",
        "longer",
        "concrete",
        "mental",
        "product",
        "something",
        "arrive",
        "way",
        "abstraction",
        "performed",
        "concrete",
        "product",
        "twardowski",
        "passage",
        "twardowski",
        "appends",
        "note",
        "referring",
        "husserl",
        "s",
        "notion",
        "ideal",
        "meaning",
        "relationship",
        "husserl",
        "s",
        "twardowski",
        "s",
        "notion",
        "meaning",
        "well",
        "status",
        "twardowski",
        "s",
        "unique",
        "meaning",
        "remains",
        "object",
        "discussion",
        "see",
        "paczkowskałagowska",
        "buczyńskagarewicz",
        "placek",
        "brandl",
        "schaar",
        "matter",
        "considered",
        "yet",
        "unsettled",
        "introduction",
        "notion",
        "unique",
        "meaning",
        "sentence",
        "lead",
        "twardowski",
        "make",
        "distinction",
        "substitutive",
        "artefacta",
        "nonsubstitutive",
        "judgment",
        "substitutive",
        "judgment",
        "nt",
        "real",
        "judgment",
        "fictitious",
        "one",
        "latter",
        "fact",
        "presented",
        "judgment",
        "content",
        "object",
        "difference",
        "action",
        "product",
        "twardowski",
        "applies",
        "concept",
        "substitutive",
        "judgment",
        "explicitly",
        "logic",
        "sentence",
        "uttered",
        "written",
        "logiciansatwork",
        "sentence",
        "express",
        "meaning",
        "judgment",
        "really",
        "passed",
        "presented",
        "judgment",
        "produced",
        "thus",
        "action",
        "presentingwhich",
        "different",
        "action",
        "actual",
        "judging",
        "act",
        "happens",
        "instance",
        "logician",
        "construct",
        "valid",
        "syllogism",
        "made",
        "materially",
        "false",
        "sentence",
        "give",
        "example",
        "formally",
        "valid",
        "inference",
        "case",
        "logician",
        "actually",
        "judge",
        "triangle",
        "square",
        "square",
        "round",
        "triangle",
        "round",
        "merely",
        "present",
        "corresponding",
        "judgment",
        "sentence",
        "triangle",
        "square",
        "square",
        "round",
        "triangle",
        "round",
        "real",
        "sentence",
        "artificial",
        "one",
        "expression",
        "artificial",
        "product",
        "substitute",
        "actual",
        "judgment",
        "namely",
        "merely",
        "represented",
        "judgment",
        "ibid",
        "meaning",
        "artificial",
        "sentence",
        "artificial",
        "judgment",
        "merely",
        "presented",
        "passed",
        "artificial",
        "judgment",
        "subjectmatter",
        "logic",
        "point",
        "twardowski",
        "indebted",
        "bolzano",
        "operating",
        "surrogate",
        "sentence",
        "triangle",
        "square",
        "constitutes",
        "extreme",
        "example",
        "making",
        "mental",
        "product",
        "independent",
        "action",
        "owing",
        "alone",
        "truly",
        "actually",
        "exist",
        "twardowski",
        "s",
        "distinction",
        "act",
        "product",
        "presently",
        "rediscovered",
        "actbased",
        "theory",
        "semantic",
        "content",
        "within",
        "twardowski",
        "s",
        "notion",
        "product",
        "considered",
        "interesting",
        "alternative",
        "notion",
        "proposition",
        "mindindependent",
        "languageindependent",
        "content",
        "assertion",
        "meaning",
        "sentence",
        "primary",
        "truthbearer",
        "object",
        "propositional",
        "attitude",
        "see",
        "moltmann"
    ]
}