{
    "main_text": "Yogācāra || Ultimate truth\n3.2 Ultimate truth\n\nIn the Commentary on the Sūtra of Intent\n(Ārya-saṃdhinirmocana-sūtra, Mdo sde\nca 1b–55b) it is stated that “Reality as it is, which is\nthe intentional object of a pure consciousness, is the definition of\nthe perfect nature. This must be so because it is with respect to this\nthat the Victorious Buddha attributed all phenomena as natureless,\nultimately.” (Mdo sde ca 35b) Vasubandhu’s [TSN]\ndefines “the perfect nature (pariniṣpanna) as the\neternal nonexistence of ‘as it appears’ of ‘what\nappears’ because it is unalterable.” ([TSN] 3, Sems\ntsam chi 10a) “What appears” is the dependent\nnature—a series of cognitive events, the representations.\n“As it appears” is the imaginary nature—the unreal\nconceptual fabrication of the subject-object duality. The\nrepresentations, (i.e., the dependent nature) appear in the cognition\nas if they have in them the subject-object duality, even though the\ndependent nature is wholly devoid of such subject-object duality. The\nperfect nature is therefore this eternal nonexistence of the imaginary\nnature—the duality—in the dependent nature.\n\nVasubandhu defines the perfect nature as the ultimate truth and\nidentifies it with mere-consciousness. “This is the ultimate\n(paramārtha) of the dharmas, and so it is the reality\n(tathatā) too. Because its reality is like this all the time, it\nis mere consciousness.” (Triṃ 25, Sems\ntsam shi 3b) Accordingly Sthiramati’s Commentary on the\nThirty Verses (Triṃśikābhāṣya\n[TriṃB], Sems tsam shi 146b–171b), explains\n“ultimate” (paramārtha) here as referring to\n“’ world-transcending knowledge’\n(lokottara-nirvikalpa-jñāna) in that there is\nnothing that surpasses it. Since it is the object of [the transcendent\nknowledge], it is the ultimate. It is even like the space in having\nthe same taste everywhere. It is the perfect nature, which is\nstainless and unchangable. Therefore, it is known as the\n‘ultimate.’” ([TriṃB], Sems tsam shi\n169ab)\n\nSo, as we can see the dependent and the imaginary natures together\nexplain the Yogācāra’s conventional reality and the perfect\nnature explains its conception of the ultimate reality. The first two\nnatures provide an argument for the Yogācāra’s empirical and\npractical standpoints (vyavahāra), conventional truth and the\nthird nature an argument for its ultimate truth. Even then the\ndependent nature alone is conventionally real and the perfect nature\nalone is ultimately real. By contrast, the imaginary nature is unreal\nand false even by the empirical and practical standards. This is true\nin spite of the fact the imaginary nature is constitutive of the\nconventional truth.\n\nSo, the perfect nature—nondual mind, i.e., emptiness\n(śūnyatā) of the subject-object duality—is the\nultimate reality of the Yogācāra conception. Ultimate truth\ntakes various forms as it is understood within the Yogācārin\ntradition. As Maitreyanātha states, ultimate truth takes three\nprimary forms—as emptiness it is the ultimate object, as\nnirvāṇa it is the ultimate attainment, and as nonconceptual\nknowledge it is the ultimate realization ([MVK], Sems tsam\nphi 42B).\n\nYogācāra Arguments\n\nThe core argument in support of the only mind thesis is the\nimpossibility of the existence of external objects. Vasubandhu\ndevelops this argument in his Viṃ 1–27 as does\nDignāga in his Examination of the Intentional Object\n(Ālambanaparīkṣāvṛtti,\nĀPV 1–8, Tshad ma ce 86a–87b)\nagainst the atomists (Naiyāyikas-Vaiśeṣika and\n Ābhidharmikas[8]).\n Against the Yogācāra idealist thesis the realist opponents,\nas Vasubandhu observes, raise three objections:—“If\nconsciousness (does) not (arise) out from an object (i) neither the\ndetermination or certainty (niyama) in regard to place (deśa) and\ntime (kāla), (ii) nor the indetermination or unexclusiveness\n(aniyama) in regard to the series of (consciousness) (iii) nor the\nperformance of the (specific) function (kṛtyakriya) are\nlogically possible (yuktā)” (Viṁ 2, Sems\ntsam shi 3a).\n\nVasubandhu offers his Yogācāra reply in the\nViṃ to these realist objections and insists that the\nidealist position does not face these three problems. The first\nproblem is not an issue for the Yogācāra since dreams\n(svapna) account for the spatio-temporal determination. In dreams, in\nthe absence of an external object, one still has the cognition of a\nwoman, or a man in only determinate / specific time and place, and not\narbitrarily and not everywhere and not in any moment. Neither is the\nsecond problem of the lack of an intersubjective agreement an issue\nfor the Yogācāra. The case of the pretas (hungry-ghosts)\naccount for intersubjective agreement as they look at water they\nalone, not other beings, see rivers of pus, urine, excrement, and\ncollectively hallucinates demons as the hell guardians. Although pus,\nurine, excrement and hell guardians are nonexistent externally, due to\nthe maturation of their collective karma, pretas exclusively\nexperience the series of cognitions (vijñapti), other beings do\nnot encounter such experience (Viṃ 3, Sems\ntsam shi). Nor is the lack of causal efficacy of the impressions\nor representations in the consciousness a problem for the\nYogācāra. As in the case of wet dreams, even without a union\nof the couple, the emission of semen can occur, and so the\nrepresentations in the consciousness are causally efficient even\nwithout the externally real object.\n\nYogācāra’s defensive arguments against the realist\nchallenges are quite strong. However unless Yogācāra is able\nto undermine the core realist thesis—i.e., reality of the\nexternal objects—and its key supporting argument—the\nexistence of atoms—then the debate could go either way.\nTherefore Yogācāra shows the nonexistence, or unreality of\nthe atoms as the basis of the external object to reject the realist\nposition.\n\nYogācāra’s impressions-only theory and the\nSautrāntika’s representationalist theory both explain our sensory\nexperience (the spatio-temporal determinacy, intersubjective\nagreement, and causal efficacy). They agree on what the observables\nare: mental entities, including mental images but also emotions such\nas desires. They also agree that karma plays vital role in explaining\nour experience. The realist theory, though, according to\nDignāga’s Investigation About the Support of the\nCognition (Ālambanaparīkṣāvṛ\ntti [ĀlamPV]) has to posit the reality of additional\nphysical objects, things that are in principle unobservable, given\nthat all we experience in the cognition are our impressions\n([ĀlamPV], Tshad ma ce 86a).\n\nIf the realist thesis were correct, then there would be three\nalternatives for the atoms to act as the intentional objects of\ncognition.\n\nAtoms of the things would be either one in the way the\nNyya-Vaieika conceives the whole as something constituted by\nparts but being single, one, different from the parts that\ncompose it, and having a real existence apart from the existence of\nthe parts. Or\nthings would have to be constituted by multiple atoms\ni.e., a number or a group of atoms coexisting one besides the other\nwithout forming a composite whole as a result of mutual\ncohesion between the atoms. Or\nthings would have to be atoms grouped together,\nmassed together as a unity among themselves with a tight cohesion.\nYogācāra contends that these are the only three alternatives\nin which the reality of the external objects can functioning as the\nobjects of cognition.\n\n\nOf the three alternatives: (1) points to the unity of a thing\nconceived as a whole; and (2) and (3) point to the\nmultiplicity looking at the things as loose atoms, i.e.,\ncomposite atoms. Not one of the three possibilities is, on\nYogācāra’s account, admissible as the object of cognition\nhowever. The first is inadmissible because nowhere an external object\nis grasped as a unity, whole, one apart\nfrom its parts ([ĀlamPV] Tshad ma ce 86b). The second is\ninadmissible because when we see things we find that the atoms are not\nperceived individually as one by one ([Viṃ] 13, Sems\ntsam shi 3b). The third alternative is also rejected because the\natoms in this case cannot be proved to exist as an indivisible\n([Viṃ] 14, Sems tsam shi 3b).\n\nFurther, if there were a simultaneous conjunction of an atom with\nother six atoms coming from the six directions, the atom would have\nsix parts because that which is the locus of one atom cannot be the\nlocus of another atom. If the locus of one atom were the locus of the\nsix atoms, which were in conjunction with it, then since all the seven\natoms would have the same common locus, the whole mass constituted by\nthe seven atoms would be of the size of a single atom, because of the\nmutual exclusion of the occupants of a locus. Consequently, there\nwould be no visible mass (Viṃ12, Sems tsam shi\n3b).\n\nSince unity is an essential characteristic of being the whole, or\ncomposite whereas indivisibility an essential characteristic of being\nan atom when both the unity and individuality of the atoms are\nrejected, then the whole and indivisible atoms are no longer\nadmissible. Therefore, Vasubandhu sums up the Yogācāra\nobjections against the reality of the external sense-objects\n(āyatanas) as: “An external sense-object is unreal because\nit cannot be the intentional object of cognition either as (1) a\nsingle thing or (2) as a multiple in [isolated] atoms; or (3) as a\naggregate because the atom is not proven to exist”\n(Viṃ11, Sems tsam shi 3b).\n\nThe realist insists that the external sense objects are real and that\ntheir reality is ascertained by the various means of knowledge\n(pramāṇas) of which perception (pratyakṣa) is the\nmost important. If the external sense objects are nonexistents, there\ncan be no intentional objects, then cognition would not arise. Since\ncognitions do arise, there must be external objects as their\nintentional objects.\n\nTo this objection, Yogācāra employs two arguments to refute\nthe realist claim and to establish the mechanism of cognition, which\ntakes place without the atoms of an external object. The first\nargument shows that atoms do not satisfy the criterion of being the\nintentional object, therefore they do not cause the perception.\n“Perceptual cognition [takes place] just like in dreams and the\nlike [even without an external object]; moreover, when that\n[cognition] occurs, the external object is not seen; how can it be\nthought that this is a case of perception?”\n(Viṃ16, Sems tsam shi 3b).\n\nThe second is the time-lag argument, according to which, there is a\ntime-gap between the perceptual judgement we make and the actual\nperceptual process. When we make a perceptual judgement, at that time\nwe do not perceive the external object as it is in our mental\nconsciousness (manovijñāna) that carries out the judgement\nand since the visual consciousness that perceives the object has\nalready ceased. Hence at the time when the mental consciousness\ndelivers it judgment, the perceptual cognition no longer exists since\nall things are momentary. Therefore the atoms of an external object is\nnot the intentional object of perceptual cognition, since it has\nalready ceased and does not now exist therefore it is not responsible\nfor the cognition’s having the content it has, like the unseen events\noccurring on the other side of the wall (Vasubandhu’s\nViṃśatikā-kārikāvṛtti\n[ViṃKV] 16–17).\n\nYogācāra therefore concludes that we cannot postulate the\nreality of an external object through direct perception. However since\nin perceptual cognition we are directly aware of something, there must\nbe an intentional object of the perceptual cognition. That intentional\nobject of perceptual cognition is, according to the\nYogācāra, none other than the subliminal impressions\n(vāsanās) passing from their latent state contained in the\nstorehouse consciousness (ālayavijñāna) to their\nconscious level. Therefore the impressions are the only things that\nare conventionally real.\n\nVasubandhu’s [TSN] 35–36 inspired by the Buddhist traditional\nreligious beliefs also offers others arguments to defend the idealism\nof Yogācāra:\n\none and the same thing appears differently to beings that are in\ndifferent states of existence (pretas, men, and gods);\nthe ability of the bodhisattvas and\ndhyāyins (practitioners of meditation) who have attained\nthe power of thinking (cetovaśitā) to visualise\nobjects at will;\nthe capacity of the yogins who have attained serenity of\nmind (śamatha) and a direct vision of dharmas as they\nreally are (dharma-vipaśyanā) to perceive things at\nthe very moment of the concentration of mind\n(manasikāra) with their essential characteristics of\nflux, suffering, nonself, empty; and\nthe power of those who have attained intuitive knowledge\n(nirvikalpakajñāna) which enables them not to\nblock the perception of things.\n\n\nAll these arguments based on the facts of experience show that objects\ndo not exist really outside the mind, that they are products of mental\ncreation and that their appearance is entirely mind dependent.\nTherefore the Yogācāra’s theory of the two truths concludes\nthat the whole world is a product of mind—it is the collective\nmental actions (karma) of all beings. All living beings see the same\nworld because of the identical maturation of their karmic\nconsequences. Since the karmic histories of beings are same, there is\nhomogeneity in the way in which the world is experienced and\nperceived. This is the reason there is an orderly world instead of\nchaotic and arbitrariness. This is also the reason behind the\nimpressions of the objectivity of the world.\n",
    "section_title": "3.2 Ultimate truth",
    "entry_title": "The Theory of Two Truths in India",
    "hierarchy_title": "The Theory of Two Truths in India || Yogācāra || Ultimate truth",
    "tokenized_text": [
        "yogācāra",
        "ultimate",
        "truth",
        "ultimate",
        "truth",
        "commentary",
        "sūtra",
        "intent",
        "āryasaṃdhinirmocanasūtra",
        "mdo",
        "sde",
        "ca",
        "bb",
        "stated",
        "reality",
        "intentional",
        "object",
        "pure",
        "consciousness",
        "definition",
        "perfect",
        "nature",
        "must",
        "respect",
        "victorious",
        "buddha",
        "attributed",
        "phenomenon",
        "natureless",
        "ultimately",
        "mdo",
        "sde",
        "ca",
        "b",
        "vasubandhu",
        "tsn",
        "defines",
        "perfect",
        "nature",
        "pariniṣpanna",
        "eternal",
        "nonexistence",
        "appears",
        "appears",
        "unalterable",
        "tsn",
        "sems",
        "tsam",
        "chi",
        "a",
        "appears",
        "dependent",
        "naturea",
        "series",
        "cognitive",
        "event",
        "representation",
        "appears",
        "imaginary",
        "naturethe",
        "unreal",
        "conceptual",
        "fabrication",
        "subjectobject",
        "duality",
        "representation",
        "ie",
        "dependent",
        "nature",
        "appear",
        "cognition",
        "subjectobject",
        "duality",
        "even",
        "though",
        "dependent",
        "nature",
        "wholly",
        "devoid",
        "subjectobject",
        "duality",
        "perfect",
        "nature",
        "therefore",
        "eternal",
        "nonexistence",
        "imaginary",
        "naturethe",
        "dualityin",
        "dependent",
        "nature",
        "vasubandhu",
        "defines",
        "perfect",
        "nature",
        "ultimate",
        "truth",
        "identifies",
        "mereconsciousness",
        "ultimate",
        "paramārtha",
        "dharma",
        "reality",
        "tathatā",
        "reality",
        "like",
        "time",
        "mere",
        "consciousness",
        "triṃ",
        "sems",
        "tsam",
        "shi",
        "b",
        "accordingly",
        "sthiramati",
        "commentary",
        "thirty",
        "verse",
        "triṃśikābhāṣya",
        "triṃb",
        "sems",
        "tsam",
        "shi",
        "bb",
        "explains",
        "ultimate",
        "paramārtha",
        "referring",
        "worldtranscending",
        "knowledge",
        "lokottaranirvikalpajñāna",
        "nothing",
        "surpasses",
        "since",
        "object",
        "transcendent",
        "knowledge",
        "ultimate",
        "even",
        "like",
        "space",
        "taste",
        "everywhere",
        "perfect",
        "nature",
        "stainless",
        "unchangable",
        "therefore",
        "known",
        "ultimate",
        "triṃb",
        "sems",
        "tsam",
        "shi",
        "ab",
        "see",
        "dependent",
        "imaginary",
        "nature",
        "together",
        "explain",
        "yogācāra",
        "conventional",
        "reality",
        "perfect",
        "nature",
        "explains",
        "conception",
        "ultimate",
        "reality",
        "first",
        "two",
        "nature",
        "provide",
        "argument",
        "yogācāra",
        "empirical",
        "practical",
        "standpoint",
        "vyavahāra",
        "conventional",
        "truth",
        "third",
        "nature",
        "argument",
        "ultimate",
        "truth",
        "even",
        "dependent",
        "nature",
        "alone",
        "conventionally",
        "real",
        "perfect",
        "nature",
        "alone",
        "ultimately",
        "real",
        "contrast",
        "imaginary",
        "nature",
        "unreal",
        "false",
        "even",
        "empirical",
        "practical",
        "standard",
        "true",
        "spite",
        "fact",
        "imaginary",
        "nature",
        "constitutive",
        "conventional",
        "truth",
        "perfect",
        "naturenondual",
        "mind",
        "ie",
        "emptiness",
        "śūnyatā",
        "subjectobject",
        "dualityis",
        "ultimate",
        "reality",
        "yogācāra",
        "conception",
        "ultimate",
        "truth",
        "take",
        "various",
        "form",
        "understood",
        "within",
        "yogācārin",
        "tradition",
        "maitreyanātha",
        "state",
        "ultimate",
        "truth",
        "take",
        "three",
        "primary",
        "formsas",
        "emptiness",
        "ultimate",
        "object",
        "nirvāṇa",
        "ultimate",
        "attainment",
        "nonconceptual",
        "knowledge",
        "ultimate",
        "realization",
        "mvk",
        "sems",
        "tsam",
        "phi",
        "b",
        "yogācāra",
        "argument",
        "core",
        "argument",
        "support",
        "mind",
        "thesis",
        "impossibility",
        "existence",
        "external",
        "object",
        "vasubandhu",
        "develops",
        "argument",
        "viṃ",
        "dignāga",
        "examination",
        "intentional",
        "object",
        "ālambanaparīkṣāvṛtti",
        "āpv",
        "tshad",
        "ce",
        "ab",
        "atomists",
        "naiyāyikasvaiśeṣika",
        "ābhidharmikas",
        "yogācāra",
        "idealist",
        "thesis",
        "realist",
        "opponent",
        "vasubandhu",
        "observes",
        "raise",
        "three",
        "objection",
        "consciousness",
        "arise",
        "object",
        "neither",
        "determination",
        "certainty",
        "niyama",
        "regard",
        "place",
        "deśa",
        "time",
        "kāla",
        "ii",
        "indetermination",
        "unexclusiveness",
        "aniyama",
        "regard",
        "series",
        "consciousness",
        "iii",
        "performance",
        "specific",
        "function",
        "kṛtyakriya",
        "logically",
        "possible",
        "yuktā",
        "viṁ",
        "sems",
        "tsam",
        "shi",
        "a",
        "vasubandhu",
        "offer",
        "yogācāra",
        "reply",
        "viṃ",
        "realist",
        "objection",
        "insists",
        "idealist",
        "position",
        "face",
        "three",
        "problem",
        "first",
        "problem",
        "issue",
        "yogācāra",
        "since",
        "dream",
        "svapna",
        "account",
        "spatiotemporal",
        "determination",
        "dream",
        "absence",
        "external",
        "object",
        "one",
        "still",
        "cognition",
        "woman",
        "man",
        "determinate",
        "specific",
        "time",
        "place",
        "arbitrarily",
        "everywhere",
        "moment",
        "neither",
        "second",
        "problem",
        "lack",
        "intersubjective",
        "agreement",
        "issue",
        "yogācāra",
        "case",
        "pretas",
        "hungryghosts",
        "account",
        "intersubjective",
        "agreement",
        "look",
        "water",
        "alone",
        "being",
        "see",
        "river",
        "pu",
        "urine",
        "excrement",
        "collectively",
        "hallucinates",
        "demon",
        "hell",
        "guardian",
        "although",
        "pu",
        "urine",
        "excrement",
        "hell",
        "guardian",
        "nonexistent",
        "externally",
        "due",
        "maturation",
        "collective",
        "karma",
        "pretas",
        "exclusively",
        "experience",
        "series",
        "cognition",
        "vijñapti",
        "being",
        "encounter",
        "experience",
        "viṃ",
        "sems",
        "tsam",
        "shi",
        "lack",
        "causal",
        "efficacy",
        "impression",
        "representation",
        "consciousness",
        "problem",
        "yogācāra",
        "case",
        "wet",
        "dream",
        "even",
        "without",
        "union",
        "couple",
        "emission",
        "semen",
        "occur",
        "representation",
        "consciousness",
        "causally",
        "efficient",
        "even",
        "without",
        "externally",
        "real",
        "object",
        "yogācāra",
        "defensive",
        "argument",
        "realist",
        "challenge",
        "quite",
        "strong",
        "however",
        "unless",
        "yogācāra",
        "able",
        "undermine",
        "core",
        "realist",
        "thesisie",
        "reality",
        "external",
        "objectsand",
        "key",
        "supporting",
        "argumentthe",
        "existence",
        "atomsthen",
        "debate",
        "could",
        "go",
        "either",
        "way",
        "therefore",
        "yogācāra",
        "show",
        "nonexistence",
        "unreality",
        "atom",
        "basis",
        "external",
        "object",
        "reject",
        "realist",
        "position",
        "yogācāra",
        "impressionsonly",
        "theory",
        "sautrāntika",
        "representationalist",
        "theory",
        "explain",
        "sensory",
        "experience",
        "spatiotemporal",
        "determinacy",
        "intersubjective",
        "agreement",
        "causal",
        "efficacy",
        "agree",
        "observables",
        "mental",
        "entity",
        "including",
        "mental",
        "image",
        "also",
        "emotion",
        "desire",
        "also",
        "agree",
        "karma",
        "play",
        "vital",
        "role",
        "explaining",
        "experience",
        "realist",
        "theory",
        "though",
        "according",
        "dignāga",
        "investigation",
        "support",
        "cognition",
        "ālambanaparīkṣāvṛ",
        "tti",
        "ālampv",
        "posit",
        "reality",
        "additional",
        "physical",
        "object",
        "thing",
        "principle",
        "unobservable",
        "given",
        "experience",
        "cognition",
        "impression",
        "ālampv",
        "tshad",
        "ce",
        "a",
        "realist",
        "thesis",
        "correct",
        "would",
        "three",
        "alternative",
        "atom",
        "act",
        "intentional",
        "object",
        "cognition",
        "atom",
        "thing",
        "would",
        "either",
        "one",
        "way",
        "nyyavaieika",
        "conceives",
        "whole",
        "something",
        "constituted",
        "part",
        "single",
        "one",
        "different",
        "part",
        "compose",
        "real",
        "existence",
        "apart",
        "existence",
        "part",
        "thing",
        "would",
        "constituted",
        "multiple",
        "atom",
        "ie",
        "number",
        "group",
        "atom",
        "coexisting",
        "one",
        "besides",
        "without",
        "forming",
        "composite",
        "whole",
        "result",
        "mutual",
        "cohesion",
        "atom",
        "thing",
        "would",
        "atom",
        "grouped",
        "together",
        "massed",
        "together",
        "unity",
        "among",
        "tight",
        "cohesion",
        "yogācāra",
        "contends",
        "three",
        "alternative",
        "reality",
        "external",
        "object",
        "functioning",
        "object",
        "cognition",
        "three",
        "alternative",
        "point",
        "unity",
        "thing",
        "conceived",
        "whole",
        "point",
        "multiplicity",
        "looking",
        "thing",
        "loose",
        "atom",
        "ie",
        "composite",
        "atom",
        "one",
        "three",
        "possibility",
        "yogācāra",
        "account",
        "admissible",
        "object",
        "cognition",
        "however",
        "first",
        "inadmissible",
        "nowhere",
        "external",
        "object",
        "grasped",
        "unity",
        "whole",
        "one",
        "apart",
        "part",
        "ālampv",
        "tshad",
        "ce",
        "b",
        "second",
        "inadmissible",
        "see",
        "thing",
        "find",
        "atom",
        "perceived",
        "individually",
        "one",
        "one",
        "viṃ",
        "sems",
        "tsam",
        "shi",
        "b",
        "third",
        "alternative",
        "also",
        "rejected",
        "atom",
        "case",
        "proved",
        "exist",
        "indivisible",
        "viṃ",
        "sems",
        "tsam",
        "shi",
        "b",
        "simultaneous",
        "conjunction",
        "atom",
        "six",
        "atom",
        "coming",
        "six",
        "direction",
        "atom",
        "would",
        "six",
        "part",
        "locus",
        "one",
        "atom",
        "locus",
        "another",
        "atom",
        "locus",
        "one",
        "atom",
        "locus",
        "six",
        "atom",
        "conjunction",
        "since",
        "seven",
        "atom",
        "would",
        "common",
        "locus",
        "whole",
        "mass",
        "constituted",
        "seven",
        "atom",
        "would",
        "size",
        "single",
        "atom",
        "mutual",
        "exclusion",
        "occupant",
        "locus",
        "consequently",
        "would",
        "visible",
        "mass",
        "viṃ",
        "sems",
        "tsam",
        "shi",
        "b",
        "since",
        "unity",
        "essential",
        "characteristic",
        "whole",
        "composite",
        "whereas",
        "indivisibility",
        "essential",
        "characteristic",
        "atom",
        "unity",
        "individuality",
        "atom",
        "rejected",
        "whole",
        "indivisible",
        "atom",
        "longer",
        "admissible",
        "therefore",
        "vasubandhu",
        "sum",
        "yogācāra",
        "objection",
        "reality",
        "external",
        "senseobjects",
        "āyatanas",
        "external",
        "senseobject",
        "unreal",
        "intentional",
        "object",
        "cognition",
        "either",
        "single",
        "thing",
        "multiple",
        "isolated",
        "atom",
        "aggregate",
        "atom",
        "proven",
        "exist",
        "viṃ",
        "sems",
        "tsam",
        "shi",
        "b",
        "realist",
        "insists",
        "external",
        "sense",
        "object",
        "real",
        "reality",
        "ascertained",
        "various",
        "mean",
        "knowledge",
        "pramāṇas",
        "perception",
        "pratyakṣa",
        "important",
        "external",
        "sense",
        "object",
        "nonexistents",
        "intentional",
        "object",
        "cognition",
        "would",
        "arise",
        "since",
        "cognition",
        "arise",
        "must",
        "external",
        "object",
        "intentional",
        "object",
        "objection",
        "yogācāra",
        "employ",
        "two",
        "argument",
        "refute",
        "realist",
        "claim",
        "establish",
        "mechanism",
        "cognition",
        "take",
        "place",
        "without",
        "atom",
        "external",
        "object",
        "first",
        "argument",
        "show",
        "atom",
        "satisfy",
        "criterion",
        "intentional",
        "object",
        "therefore",
        "cause",
        "perception",
        "perceptual",
        "cognition",
        "take",
        "place",
        "like",
        "dream",
        "like",
        "even",
        "without",
        "external",
        "object",
        "moreover",
        "cognition",
        "occurs",
        "external",
        "object",
        "seen",
        "thought",
        "case",
        "perception",
        "viṃ",
        "sems",
        "tsam",
        "shi",
        "b",
        "second",
        "timelag",
        "argument",
        "according",
        "timegap",
        "perceptual",
        "judgement",
        "make",
        "actual",
        "perceptual",
        "process",
        "make",
        "perceptual",
        "judgement",
        "time",
        "perceive",
        "external",
        "object",
        "mental",
        "consciousness",
        "manovijñāna",
        "carry",
        "judgement",
        "since",
        "visual",
        "consciousness",
        "perceives",
        "object",
        "already",
        "ceased",
        "hence",
        "time",
        "mental",
        "consciousness",
        "delivers",
        "judgment",
        "perceptual",
        "cognition",
        "longer",
        "exists",
        "since",
        "thing",
        "momentary",
        "therefore",
        "atom",
        "external",
        "object",
        "intentional",
        "object",
        "perceptual",
        "cognition",
        "since",
        "already",
        "ceased",
        "exist",
        "therefore",
        "responsible",
        "cognition",
        "content",
        "like",
        "unseen",
        "event",
        "occurring",
        "side",
        "wall",
        "vasubandhu",
        "viṃśatikākārikāvṛtti",
        "viṃkv",
        "yogācāra",
        "therefore",
        "concludes",
        "postulate",
        "reality",
        "external",
        "object",
        "direct",
        "perception",
        "however",
        "since",
        "perceptual",
        "cognition",
        "directly",
        "aware",
        "something",
        "must",
        "intentional",
        "object",
        "perceptual",
        "cognition",
        "intentional",
        "object",
        "perceptual",
        "cognition",
        "according",
        "yogācāra",
        "none",
        "subliminal",
        "impression",
        "vāsanās",
        "passing",
        "latent",
        "state",
        "contained",
        "storehouse",
        "consciousness",
        "ālayavijñāna",
        "conscious",
        "level",
        "therefore",
        "impression",
        "thing",
        "conventionally",
        "real",
        "vasubandhu",
        "tsn",
        "inspired",
        "buddhist",
        "traditional",
        "religious",
        "belief",
        "also",
        "offer",
        "others",
        "argument",
        "defend",
        "idealism",
        "yogācāra",
        "one",
        "thing",
        "appears",
        "differently",
        "being",
        "different",
        "state",
        "existence",
        "pretas",
        "men",
        "god",
        "ability",
        "bodhisattva",
        "dhyāyins",
        "practitioner",
        "meditation",
        "attained",
        "power",
        "thinking",
        "cetovaśitā",
        "visualise",
        "object",
        "capacity",
        "yogins",
        "attained",
        "serenity",
        "mind",
        "śamatha",
        "direct",
        "vision",
        "dharma",
        "really",
        "dharmavipaśyanā",
        "perceive",
        "thing",
        "moment",
        "concentration",
        "mind",
        "manasikāra",
        "essential",
        "characteristic",
        "flux",
        "suffering",
        "nonself",
        "empty",
        "power",
        "attained",
        "intuitive",
        "knowledge",
        "nirvikalpakajñāna",
        "enables",
        "block",
        "perception",
        "thing",
        "argument",
        "based",
        "fact",
        "experience",
        "show",
        "object",
        "exist",
        "really",
        "outside",
        "mind",
        "product",
        "mental",
        "creation",
        "appearance",
        "entirely",
        "mind",
        "dependent",
        "therefore",
        "yogācāra",
        "theory",
        "two",
        "truth",
        "concludes",
        "whole",
        "world",
        "product",
        "mindit",
        "collective",
        "mental",
        "action",
        "karma",
        "being",
        "living",
        "being",
        "see",
        "world",
        "identical",
        "maturation",
        "karmic",
        "consequence",
        "since",
        "karmic",
        "history",
        "being",
        "homogeneity",
        "way",
        "world",
        "experienced",
        "perceived",
        "reason",
        "orderly",
        "world",
        "instead",
        "chaotic",
        "arbitrariness",
        "also",
        "reason",
        "behind",
        "impression",
        "objectivity",
        "world"
    ]
}