{
    "main_text": "The Lambek systems || Modelling grammatical composition\n2.1   Modelling grammatical composition\nThe type language to be considered in this section consists of a\nsmall set of atomic types, and is closed under the binary operations\nproduct, left and right division. Some notational conventions: in the\nspecification below, lower case p ranges over atomic types,\nupper case A, B over arbitrary types. We pronounce\nA\\B as ‘A under B’\nand B/A as ‘B over A’\nthus to make clear which part of the ‘fraction’ is the\ndenominator (A), and which is the numerator\n(B).  \n\nTypes: A,B ::= p | A ⊗ B\n| A\\B | B/A\n\nIn categorizing linguistic expressions, atomic types stand for\nphrases that one can think of as grammatically ‘complete’.\nExamples, for English, could be s for declarative sentences\n(‘Mary dreams’,…), np for noun phrases\n(‘Mary’, ‘the girl’,…), n for\ncommon nouns (‘girl’, ‘smart girl’,…).\nDivision expresses incompleteness: an expression with\ntype A\\B (B/A) will produce a\nphrase of type B when it is put together with a phrase of\ntype A to its left (right).  Product types A\n⊗ B explicitly express the formation of a complex\nphrase out of constituent parts of type A and B in\nthat order.  So if ‘Mary’ is typed as np and the\nverb ‘dreams’ as np\\s, we\nobtain s for the combination ‘Mary dreams’ by\nmultiplying out these types: np ⊗\n(np\\s). Similarly for the combination ‘the\ngirl dreams’, where one would start from a\ntype np/n for the determiner and n for\n‘girl’: ((np/n) ⊗ n)\n⊗ (np\\s).\nTo make this informal description of the interpretation of the type\nlanguage precise, we turn to modal logic. Frames F =\n(W,R), in the categorial setting, consist of a\nset W of linguistic resources (expressions,\n‘signs’), structured in terms of a ternary relation\nR. This ternary relation stands for grammatical composition, or\n‘Merge’ as it is known in the generative tradition: read\nRxyz as “the expression x is obtained by\nputting together the subexpressions y\nand z”. For comparison: in the Routley-Meyer semantics\nfor relevance logic, R would be the accessibility relation\ninterpreting the fusion operation.\nA model M is a pair (F,V)\nwhere V is an interpretation (valuation) sending atomic types\nto subsets of W.  For complex types, the valuation respects\nthe clauses below.  We write x ∈ V(A)\nas M,x ⊩ A or, if no confusion will\narise, x ⊩ A.\n\nx ⊩ A ⊗ B iff\n∃yz such that Rxyz and y\n⊩ A and z ⊩ B\ny ⊩ C/B iff ∀xz,\nif Rxyz and z ⊩ B, then x\n⊩ C\nz ⊩ A\\C iff ∀xy,\nif Rxyz and y ⊩ A, then x\n⊩ C\n\nA syntactic calculus for a categorial type language is a deductive\nsystem producing statements of the form A ⊢ B\n(‘B is derivable from A’).  A\nstatement A ⊢ B holds in a model\n(‘M ⊨ A ⊢ B’)\nif V(A) ⊆ V(B); it is valid\n(‘⊨ A ⊢\nB’) if it holds in all models. For the minimal grammar\nlogic, the set of derivations in the syntactic calculus is freely\ngenerated from the axiom and rules of inference below. This minimal\nsystem, for historical reasons, is known as NL (for\n‘Non-associative Lambek calculus’).  The\nfirst line states that derivability is a reflexive, transitive\nrelation, i.e., a preorder.  The bidirectional (‘if and only\nif’) inference rules of the second line characterize the product\nand division operations as a residuated triple as it is known in\nresiduation theory. (Galatos et al. 2007 provides good\nbackground reading.) The syntactic calculus, so defined, precisely\nfits the intended interpretation of the type language, in the sense of\nthe soundness and completeness result below.\n\npreorder laws:\n  \nA ⊢ A (reflexivity)\nfrom A ⊢ B and B\n⊢ C infer A ⊢ C (transitivity)\n\n\nresiduation laws: A ⊢\nC/B iff A ⊗ B\n⊢ C iff B ⊢ A\\C\nsoundness and completeness: A ⊢ B is\nprovable in the grammatical base logic NL iff\n⊨ A ⊢ B, i.e., iff V(A)\n⊆ V(B) for every valuation V on every\nframe F (Došen 1992).\n\nThe completeness result for NL does not impose any restrictions on\nthe interpretation of the Merge\nrelation R. This means that the theorems\nand inference rules of the minimal grammar logic have the status of\ngrammatical invariants: properties of type combination that hold no\nmatter what the structural particularities of individual languages may\nbe.  Here are some examples of such universally valid principles. They\ncome in pairs, because of the left-right symmetry relating slash and\nbackslash.\n\napplication:\n \n(A/B) ⊗ B ⊢ A\nB ⊗ (B\\A) ⊢ A\n\n\nco-application: \n \nA ⊢ (A ⊗ B)/B\nA ⊢ B\\(B ⊗ A)\n\n\nlifting: \n \nA ⊢ B/(A\\B)\nA ⊢ (B/A)\\B\n\n\nmonotonicity: from A ⊢ B and C\n⊢ D infer any of the following:\n \nA ⊗ C ⊢ B ⊗ D\nA/D ⊢ B/C\nD\\A ⊢ C\\B\n\n\n\nGiven the universal freely generated syntactic calculus discussed\nabove, the task of providing a categorial grammar for\na particular language is reduced to specifying its lexicon:\nthe typelogical framework, in this sense, represents the culminating\npoint of ‘lexicalizing’ grammar formalisms.  A categorial\nlexicon is a relation associating each word with a finite number of\ntypes.  Given a lexicon Lex, a categorial grammar assigns\ntype B to a string of words w1 ··· \nwn iff for 1 ≤ i ≤ n,\n(wi,Ai) ∈ Lex,\nand X ⊢ B is provable in the syntactic\ncalculus where X is a product formula with\nyield A1\n··· An. The grammar can be\nconsidered adequate if the strings w1\n··· wn are indeed judged to be the wellformed\nphrases of type B.\nLexical type assignments don't have to be handcrafted: Buszkowski\nand Penn (1990) model the acquisition of the lexicon as a\nprocess of solving type equations. Their unification-based algorithms\ntake function-argument structures as input (binary trees with a\ndistinguised head daughter); one obtains variations depending on\nwhether the solution should assign a unique type to every vocabulary\nitem (so-called rigid grammars), or whether one accepts multiple\nassignments (k-valued grammars, with k as the\nmaximal lexical ambiguity factor). Kanazawa (1998) studies learnable\nclasses of grammars from this perspective, in the sense of\nGold’s notion of identifiability ‘in the limit’.\nThis line of research is by now well established, for typelogical\ngrammars proper, and for the related pregroup formalism discussed\nunder §6.\nThe radical lexicalism of typelogical grammar means there is no\nroom for construction specific rule stipulations: central grammatical\nnotions, rather than being postulated, must emerge from the type\nstructure. Here are some examples.\n\nValency. Intransitive verbs (‘dreams’,\n‘sleeps’) form a complete sentence with just a subject\nnoun phrase to their left; transitive verbs (‘sees’,\n‘admires’) require both a subject to their left and a\ndirect object to their right. Such selectional requirements are\nexpressed in terms of the directional\nimplications: np\\s for intransitive,\n(np\\s)/np for transitive verbs.  In a\ncontext-free grammar, these distinctions require the postulation of\nnew non-terminals.\nCase. The distinction between phrases that can fulfill\nany noun phrase selectional requirement (say, proper names) versus\ncase-marked pronouns insisting on playing the subject or direct object\nrole is expressed through higher-order type assignment: proper names\ncan be typed simply as np, subject pronouns\n(‘he’, ‘she’)\nas s/(np\\s), direct object pronouns (and\nreflexives) as\n((np\\s)/np)\\(np\\s).\nUnder such typing, one correctly distinguishes between the grammatical\n‘he sees her’ versus the ill-formed ‘him likes\nshe’.\nComplements vs modifiers.  Compare exocentric types\n(A/B or B\\A with A\n≠ B) versus endocentric\ntypes A/A, A\\A. The latter express\nmodification; optionality of modifier phrases follows. Compare\n‘the girl’, ‘the smart girl’, ‘the girl\n(who teases Bill)’, with ‘girl’ typed as n,\n‘smart’ as n/n and the relative clause\n‘who teases Bill’ as n\\n.\nFiller-gap dependencies.  Types with nested implications\nA/(C/B), A/(B\\C),\netc., signal the withdrawal of a gap hypothesis of type B in\na domain of type C. The relative pronoun ‘who’ in\n‘the girl who teases Bill’ is typed as\n(n\\n)/(np\\s): it combines with a\nsentence of which the subject must remain unexpressed, as one sees\nfrom the ill-formed ‘the girl who Mary teases Bill’.\n\nSequent calculus, decidability. How can we decide whether a\nstatement A ⊢ B is indeed a theorem of the\nsyntactic calculus?  In the presence of expanding rules, such as\nLifting, this is not immediately obvious: the transitivity inference\nfrom A ⊢ B and B ⊢ C\nto A ⊢ C involves a ‘lemma’\nformula B which disappears from the conclusion, and there is\nan infinite number of candidate lemma formulas to consider.  A key\npoint of Lambek's original papers consists in the reformulation of the\nsyntactic calculus in an equivalent Gentzen-style sequent format,\nwhich enjoys cut-elimination.\nSequents for the grammatical base logic NL are\nstatements X ⇒ A, where X (the\nantecedent) is a structure, and A (the succedent) a type\nformula. The antecedent structure is required to be non-empty. A\nstructure is either a single formula, or a binary branching tree with\nformulas at the leaves.  In the sequent rules below, the tree\nstructure of the antecedent is indicated by bracketing\n(–,–).  The notation X[Y] refers to a\nstructure X containing a distinguished\nsubstructure Y.  For every connective (type-forming\noperation), there are two inference rules, introducing the connective\nto the left or to the right of the derivability arrow.  In this\nsequent presentation, as in Gentzen's propositional logics, Cut\nis an admissible rule: every proof of a theorem that makes use of Cut\ninferences can be transformed into an equivalent cut-free derivation.\nBackward-chaining proof search in the cut-free system respects the\nsubformula property and immediately yields a decision procedure.\n\n\n\n\n\n\n\n\n\n\n \n\n\nA⇒A\n\n\n\nAx\n\n\n\n\n\n\nY⇒A  X[A]⇒B\n\n\nX[Y]⇒B\n\n\n\nCut\n\n\n\n\n\n\n\n\nX⇒A  Y⇒B\n\n\n(X,Y)⇒A⊗B\n\n\n\n(⊗R)\n\n\n\n\n\n\nX[(A,B)]⇒C\n\n\nX[A⊗B]⇒C\n\n\n\n(⊗L)\n\n\n\n\n\n\n\n\nY⇒B  X[A]⇒C\n\n\nX[(Y,B\\A)]⇒C\n\n\n\n(\\L)\n\n\n\n\n\n\n(B,X)⇒A\n\n\nX⇒B\\A\n\n\n\n(\\R)\n\n\n\n\n\n\n\n\nY⇒B  X[A]⇒C\n\n\nX[(A/B,Y)]⇒C\n\n\n\n(/L)\n\n\n\n\n\n\n(X,B)⇒A\n\n\nX⇒A/B\n\n\n\n(/R)\n\n\n\n\nNL: Sequent Calculus \n\nA landscape of calculi. From the pure residuation logic, one obtains\na hierarchy of calculi by attributing associativity and/or\ncommutativity properties to the composition operation ⊗. These\ncalculi reflect different views on how the grammatical material is\nstructured.  The table below summarizes the options. \n\n\n\nlogic\nstructure\nassociative\ncommutative\n\n\nNL\ntree\n–\n–\n\n\nL\nstring\n✓\n–\n\n\nNLP\nmobile\n–\n✓\n\n\nLP (=MILL)\nmultiset\n✓\n✓\n\n\n\n\nFor reasons of historical precedence, the system of Lambek 1958, with\nan associative composition operation, is referred to as L; the\npure residuation logic NL, i.e., the non-associative version\nof L, was introduced later in Lambek 1961.  Addition of\ncommutativity turns L and NL into LP\nand NLP, respectively. LP, Lambek calculus with\nPermutation, was introduced in van Benthem 1983; in retrospect, this\nthe implication/fusion fragment of Multiplicative Intuitionistic\nLinear Logic (MILL). The commutative variant of NL has been\nstudied by Kandulski; it has not found significant linguistic\napplications. For the four systems in the hierarchy, one writes\n(N)L(P)* for the (non-conservative) extension\nwhich allows empty antecedents.\n\nIn the presentation of the syntactic calculus, the structural options\ntake the form of non-logical axioms (postulates), which one\nadds to the residuation laws.  In the sequent presentation, one has\ncorresponding structural rules.  The sequent calculus\nfor L(P) also allows for a sugared presentation where\nthe antecedent is treated as a list or a multiset of formulas; the\ninference steps for the structural rules can then be left implicit.\nWith respect to the frame semantics, each of the structural options\nintroduces a constraint on the interpretation of the Merge relation\nR⊗.  Completeness for the calculi with structural options is\nthen with respect to all frames respecting the relevant constraints\n(Došen 1992). The associative calculus L in fact allows\nmore specific models where we read Rxyz as x\n= y · z, with · a\nbinary concatenation operation.  Pentus (1995) presents a\nquite intricate proof that L is indeed complete with respect to\nsuch free semigroup models (or language models, as they are also\ncalled).\n\nstructural postulates: \n  \nA ⊗ B ⊢ B\n  ⊗ A (commutativity)\nA ⊗ (B ⊗ C) ≡\n  (A ⊗ B) ⊗ C (associativity)\n\n\ncorresponding structural rules for the sequent presentation:\n\n  \n\n\n\n\n\n\nW[(Y,X)]⇒C\n\n\nW[(X,Y)]⇒C\n\n\n\n(comm.)\n\n\n\n\n\n\nW[((X,Y),Z)]⇒C\n\n\nW[(X,(Y,Z))]⇒C\n\n\n\n(assoc.)\n\n\n\n\n\n\nframe constraint for commutativity:\n∀xyz(Rxyz implies Rxzy)\nframe constraint for associativity (rebracketing to the left):\n∀xyzrs(Rrxs and Rsyz imply\n∃t(Rrtz and Rtxy)); similarly for the\nother direction\n\nA characteristic property of LP is the collapse of the\ndistinction between left and right division: A\\B\nand B/A become interderivable.  From\na syntactic point of view, the global availability of\nassociativity and/or commutativity in LP would entail that\narbitrary changes in constituent structure and/or word order cannot\naffect the well-formedness of an expression — a position that\nfew linguists will subscribe to.  Whether global associativity as we\nfind it in L is a viable option for syntax is open to dispute. Lambek\npoints to cases of overgeneration resulting from free rebracketing in\nhis 1961 paper, but later reverts to the associative view. In the\nfollowing section, we will see that LP is perfectly legitimate\nas a calculus of meaning composition. In §3, we discuss\ncontrolled forms of structural reasoning, anchored in lexical\ntype assignment, as an alternative to the problematic all-or-nothing\noptions.\n",
    "section_title": "2.1   Modelling grammatical composition",
    "entry_title": "Typelogical Grammar",
    "hierarchy_title": "Typelogical Grammar || The Lambek systems || Modelling grammatical composition",
    "tokenized_text": [
        "lambek",
        "system",
        "modelling",
        "grammatical",
        "composition",
        "modelling",
        "grammatical",
        "composition",
        "type",
        "language",
        "considered",
        "section",
        "consists",
        "small",
        "set",
        "atomic",
        "type",
        "closed",
        "binary",
        "operation",
        "product",
        "left",
        "right",
        "division",
        "notational",
        "convention",
        "specification",
        "lower",
        "case",
        "p",
        "range",
        "atomic",
        "type",
        "upper",
        "case",
        "b",
        "arbitrary",
        "type",
        "pronounce",
        "ab",
        "b",
        "ba",
        "b",
        "thus",
        "make",
        "clear",
        "part",
        "fraction",
        "denominator",
        "numerator",
        "b",
        "type",
        "b",
        "p",
        "b",
        "ab",
        "ba",
        "categorizing",
        "linguistic",
        "expression",
        "atomic",
        "type",
        "stand",
        "phrase",
        "one",
        "think",
        "grammatically",
        "complete",
        "example",
        "english",
        "could",
        "declarative",
        "sentence",
        "mary",
        "dream",
        "np",
        "noun",
        "phrase",
        "mary",
        "girl",
        "n",
        "common",
        "noun",
        "girl",
        "smart",
        "girl",
        "division",
        "express",
        "incompleteness",
        "expression",
        "type",
        "ab",
        "ba",
        "produce",
        "phrase",
        "type",
        "b",
        "put",
        "together",
        "phrase",
        "type",
        "left",
        "right",
        "product",
        "type",
        "b",
        "explicitly",
        "express",
        "formation",
        "complex",
        "phrase",
        "constituent",
        "part",
        "type",
        "b",
        "order",
        "mary",
        "typed",
        "np",
        "verb",
        "dream",
        "nps",
        "obtain",
        "combination",
        "mary",
        "dream",
        "multiplying",
        "type",
        "np",
        "nps",
        "similarly",
        "combination",
        "girl",
        "dream",
        "one",
        "would",
        "start",
        "type",
        "npn",
        "determiner",
        "n",
        "girl",
        "npn",
        "n",
        "nps",
        "make",
        "informal",
        "description",
        "interpretation",
        "type",
        "language",
        "precise",
        "turn",
        "modal",
        "logic",
        "frame",
        "f",
        "w",
        "r",
        "categorial",
        "setting",
        "consist",
        "set",
        "w",
        "linguistic",
        "resource",
        "expression",
        "sign",
        "structured",
        "term",
        "ternary",
        "relation",
        "r",
        "ternary",
        "relation",
        "stand",
        "grammatical",
        "composition",
        "merge",
        "known",
        "generative",
        "tradition",
        "read",
        "rxyz",
        "expression",
        "x",
        "obtained",
        "putting",
        "together",
        "subexpressions",
        "z",
        "comparison",
        "routleymeyer",
        "semantics",
        "relevance",
        "logic",
        "r",
        "would",
        "accessibility",
        "relation",
        "interpreting",
        "fusion",
        "operation",
        "model",
        "pair",
        "f",
        "v",
        "v",
        "interpretation",
        "valuation",
        "sending",
        "atomic",
        "type",
        "subset",
        "w",
        "complex",
        "type",
        "valuation",
        "respect",
        "clause",
        "write",
        "x",
        "v",
        "x",
        "confusion",
        "arise",
        "x",
        "a",
        "x",
        "b",
        "iff",
        "yz",
        "rxyz",
        "z",
        "b",
        "cb",
        "iff",
        "xz",
        "rxyz",
        "z",
        "b",
        "x",
        "c",
        "z",
        "ac",
        "iff",
        "xy",
        "rxyz",
        "x",
        "c",
        "syntactic",
        "calculus",
        "categorial",
        "type",
        "language",
        "deductive",
        "system",
        "producing",
        "statement",
        "form",
        "b",
        "b",
        "derivable",
        "statement",
        "b",
        "hold",
        "model",
        "b",
        "v",
        "v",
        "b",
        "valid",
        "b",
        "hold",
        "model",
        "minimal",
        "grammar",
        "logic",
        "set",
        "derivation",
        "syntactic",
        "calculus",
        "freely",
        "generated",
        "axiom",
        "rule",
        "inference",
        "minimal",
        "system",
        "historical",
        "reason",
        "known",
        "nl",
        "nonassociative",
        "lambek",
        "calculus",
        "first",
        "line",
        "state",
        "derivability",
        "reflexive",
        "transitive",
        "relation",
        "ie",
        "preorder",
        "bidirectional",
        "inference",
        "rule",
        "second",
        "line",
        "characterize",
        "product",
        "division",
        "operation",
        "residuated",
        "triple",
        "known",
        "residuation",
        "theory",
        "galatos",
        "et",
        "al",
        "provides",
        "good",
        "background",
        "reading",
        "syntactic",
        "calculus",
        "defined",
        "precisely",
        "fit",
        "intended",
        "interpretation",
        "type",
        "language",
        "sense",
        "soundness",
        "completeness",
        "result",
        "preorder",
        "law",
        "reflexivity",
        "b",
        "b",
        "c",
        "infer",
        "c",
        "transitivity",
        "residuation",
        "law",
        "cb",
        "iff",
        "b",
        "c",
        "iff",
        "b",
        "ac",
        "soundness",
        "completeness",
        "b",
        "provable",
        "grammatical",
        "base",
        "logic",
        "nl",
        "iff",
        "b",
        "ie",
        "iff",
        "v",
        "v",
        "b",
        "every",
        "valuation",
        "v",
        "every",
        "frame",
        "f",
        "došen",
        "completeness",
        "result",
        "nl",
        "impose",
        "restriction",
        "interpretation",
        "merge",
        "relation",
        "r",
        "mean",
        "theorem",
        "inference",
        "rule",
        "minimal",
        "grammar",
        "logic",
        "status",
        "grammatical",
        "invariant",
        "property",
        "type",
        "combination",
        "hold",
        "matter",
        "structural",
        "particularity",
        "individual",
        "language",
        "may",
        "example",
        "universally",
        "valid",
        "principle",
        "come",
        "pair",
        "leftright",
        "symmetry",
        "relating",
        "slash",
        "backslash",
        "application",
        "ab",
        "b",
        "b",
        "ba",
        "coapplication",
        "b",
        "b",
        "b",
        "b",
        "lifting",
        "b",
        "ab",
        "ba",
        "b",
        "monotonicity",
        "b",
        "c",
        "infer",
        "following",
        "c",
        "b",
        "ad",
        "bc",
        "da",
        "cb",
        "given",
        "universal",
        "freely",
        "generated",
        "syntactic",
        "calculus",
        "discussed",
        "task",
        "providing",
        "categorial",
        "grammar",
        "particular",
        "language",
        "reduced",
        "specifying",
        "lexicon",
        "typelogical",
        "framework",
        "sense",
        "represents",
        "culminating",
        "point",
        "lexicalizing",
        "grammar",
        "formalism",
        "categorial",
        "lexicon",
        "relation",
        "associating",
        "word",
        "finite",
        "number",
        "type",
        "given",
        "lexicon",
        "lex",
        "categorial",
        "grammar",
        "assigns",
        "type",
        "b",
        "string",
        "word",
        "w",
        "wn",
        "iff",
        "n",
        "wi",
        "ai",
        "lex",
        "x",
        "b",
        "provable",
        "syntactic",
        "calculus",
        "x",
        "product",
        "formula",
        "yield",
        "a",
        "grammar",
        "considered",
        "adequate",
        "string",
        "w",
        "wn",
        "indeed",
        "judged",
        "wellformed",
        "phrase",
        "type",
        "b",
        "lexical",
        "type",
        "assignment",
        "nt",
        "handcrafted",
        "buszkowski",
        "penn",
        "model",
        "acquisition",
        "lexicon",
        "process",
        "solving",
        "type",
        "equation",
        "unificationbased",
        "algorithm",
        "take",
        "functionargument",
        "structure",
        "input",
        "binary",
        "tree",
        "distinguised",
        "head",
        "daughter",
        "one",
        "obtains",
        "variation",
        "depending",
        "whether",
        "solution",
        "assign",
        "unique",
        "type",
        "every",
        "vocabulary",
        "item",
        "socalled",
        "rigid",
        "grammar",
        "whether",
        "one",
        "accepts",
        "multiple",
        "assignment",
        "kvalued",
        "grammar",
        "k",
        "maximal",
        "lexical",
        "ambiguity",
        "factor",
        "kanazawa",
        "study",
        "learnable",
        "class",
        "grammar",
        "perspective",
        "sense",
        "gold",
        "notion",
        "identifiability",
        "limit",
        "line",
        "research",
        "well",
        "established",
        "typelogical",
        "grammar",
        "proper",
        "related",
        "pregroup",
        "formalism",
        "discussed",
        "radical",
        "lexicalism",
        "typelogical",
        "grammar",
        "mean",
        "room",
        "construction",
        "specific",
        "rule",
        "stipulation",
        "central",
        "grammatical",
        "notion",
        "rather",
        "postulated",
        "must",
        "emerge",
        "type",
        "structure",
        "example",
        "valency",
        "intransitive",
        "verb",
        "dream",
        "sleep",
        "form",
        "complete",
        "sentence",
        "subject",
        "noun",
        "phrase",
        "left",
        "transitive",
        "verb",
        "see",
        "admires",
        "require",
        "subject",
        "left",
        "direct",
        "object",
        "right",
        "selectional",
        "requirement",
        "expressed",
        "term",
        "directional",
        "implication",
        "nps",
        "intransitive",
        "nps",
        "np",
        "transitive",
        "verb",
        "contextfree",
        "grammar",
        "distinction",
        "require",
        "postulation",
        "new",
        "nonterminals",
        "case",
        "distinction",
        "phrase",
        "fulfill",
        "noun",
        "phrase",
        "selectional",
        "requirement",
        "say",
        "proper",
        "name",
        "versus",
        "casemarked",
        "pronoun",
        "insisting",
        "playing",
        "subject",
        "direct",
        "object",
        "role",
        "expressed",
        "higherorder",
        "type",
        "assignment",
        "proper",
        "name",
        "typed",
        "simply",
        "np",
        "subject",
        "pronoun",
        "s",
        "nps",
        "direct",
        "object",
        "pronoun",
        "reflexive",
        "nps",
        "np",
        "nps",
        "typing",
        "one",
        "correctly",
        "distinguishes",
        "grammatical",
        "see",
        "versus",
        "illformed",
        "like",
        "complement",
        "v",
        "modifier",
        "compare",
        "exocentric",
        "type",
        "ab",
        "ba",
        "b",
        "versus",
        "endocentric",
        "type",
        "aa",
        "aa",
        "latter",
        "express",
        "modification",
        "optionality",
        "modifier",
        "phrase",
        "follows",
        "compare",
        "girl",
        "smart",
        "girl",
        "girl",
        "tease",
        "bill",
        "girl",
        "typed",
        "n",
        "smart",
        "nn",
        "relative",
        "clause",
        "tease",
        "bill",
        "nn",
        "fillergap",
        "dependency",
        "type",
        "nested",
        "implication",
        "a",
        "cb",
        "a",
        "bc",
        "etc",
        "signal",
        "withdrawal",
        "gap",
        "hypothesis",
        "type",
        "b",
        "domain",
        "type",
        "c",
        "relative",
        "pronoun",
        "girl",
        "tease",
        "bill",
        "typed",
        "nn",
        "nps",
        "combine",
        "sentence",
        "subject",
        "must",
        "remain",
        "unexpressed",
        "one",
        "see",
        "illformed",
        "girl",
        "mary",
        "tease",
        "bill",
        "sequent",
        "calculus",
        "decidability",
        "decide",
        "whether",
        "statement",
        "b",
        "indeed",
        "theorem",
        "syntactic",
        "calculus",
        "presence",
        "expanding",
        "rule",
        "lifting",
        "immediately",
        "obvious",
        "transitivity",
        "inference",
        "b",
        "b",
        "c",
        "c",
        "involves",
        "lemma",
        "formula",
        "b",
        "disappears",
        "conclusion",
        "infinite",
        "number",
        "candidate",
        "lemma",
        "formula",
        "consider",
        "key",
        "point",
        "lambek",
        "s",
        "original",
        "paper",
        "consists",
        "reformulation",
        "syntactic",
        "calculus",
        "equivalent",
        "gentzenstyle",
        "sequent",
        "format",
        "enjoys",
        "cutelimination",
        "sequents",
        "grammatical",
        "base",
        "logic",
        "nl",
        "statement",
        "x",
        "x",
        "antecedent",
        "structure",
        "succedent",
        "type",
        "formula",
        "antecedent",
        "structure",
        "required",
        "nonempty",
        "structure",
        "either",
        "single",
        "formula",
        "binary",
        "branching",
        "tree",
        "formula",
        "leaf",
        "sequent",
        "rule",
        "tree",
        "structure",
        "antecedent",
        "indicated",
        "bracketing",
        "notation",
        "x",
        "refers",
        "structure",
        "x",
        "containing",
        "distinguished",
        "substructure",
        "y",
        "every",
        "connective",
        "typeforming",
        "operation",
        "two",
        "inference",
        "rule",
        "introducing",
        "connective",
        "left",
        "right",
        "derivability",
        "arrow",
        "sequent",
        "presentation",
        "gentzen",
        "s",
        "propositional",
        "logic",
        "cut",
        "admissible",
        "rule",
        "every",
        "proof",
        "theorem",
        "make",
        "use",
        "cut",
        "inference",
        "transformed",
        "equivalent",
        "cutfree",
        "derivation",
        "backwardchaining",
        "proof",
        "search",
        "cutfree",
        "system",
        "respect",
        "subformula",
        "property",
        "immediately",
        "yield",
        "decision",
        "procedure",
        "aa",
        "ax",
        "ya",
        "x",
        "b",
        "x",
        "b",
        "cut",
        "xa",
        "yb",
        "x",
        "ab",
        "r",
        "x",
        "b",
        "c",
        "x",
        "ab",
        "c",
        "l",
        "yb",
        "x",
        "c",
        "x",
        "ba",
        "c",
        "l",
        "b",
        "x",
        "a",
        "xba",
        "r",
        "yb",
        "x",
        "c",
        "x",
        "ab",
        "c",
        "l",
        "x",
        "b",
        "a",
        "xab",
        "r",
        "nl",
        "sequent",
        "calculus",
        "landscape",
        "calculus",
        "pure",
        "residuation",
        "logic",
        "one",
        "obtains",
        "hierarchy",
        "calculus",
        "attributing",
        "associativity",
        "andor",
        "commutativity",
        "property",
        "composition",
        "operation",
        "calculus",
        "reflect",
        "different",
        "view",
        "grammatical",
        "material",
        "structured",
        "table",
        "summarizes",
        "option",
        "logic",
        "structure",
        "associative",
        "commutative",
        "nl",
        "tree",
        "l",
        "string",
        "nlp",
        "mobile",
        "lp",
        "mill",
        "multiset",
        "reason",
        "historical",
        "precedence",
        "system",
        "lambek",
        "associative",
        "composition",
        "operation",
        "referred",
        "l",
        "pure",
        "residuation",
        "logic",
        "nl",
        "ie",
        "nonassociative",
        "version",
        "l",
        "introduced",
        "later",
        "lambek",
        "addition",
        "commutativity",
        "turn",
        "l",
        "nl",
        "lp",
        "nlp",
        "respectively",
        "lp",
        "lambek",
        "calculus",
        "permutation",
        "introduced",
        "van",
        "benthem",
        "retrospect",
        "implicationfusion",
        "fragment",
        "multiplicative",
        "intuitionistic",
        "linear",
        "logic",
        "mill",
        "commutative",
        "variant",
        "nl",
        "studied",
        "kandulski",
        "found",
        "significant",
        "linguistic",
        "application",
        "four",
        "system",
        "hierarchy",
        "one",
        "writes",
        "n",
        "l",
        "p",
        "nonconservative",
        "extension",
        "allows",
        "empty",
        "antecedent",
        "presentation",
        "syntactic",
        "calculus",
        "structural",
        "option",
        "take",
        "form",
        "nonlogical",
        "axiom",
        "postulate",
        "one",
        "add",
        "residuation",
        "law",
        "sequent",
        "presentation",
        "one",
        "corresponding",
        "structural",
        "rule",
        "sequent",
        "calculus",
        "l",
        "p",
        "also",
        "allows",
        "sugared",
        "presentation",
        "antecedent",
        "treated",
        "list",
        "multiset",
        "formula",
        "inference",
        "step",
        "structural",
        "rule",
        "left",
        "implicit",
        "respect",
        "frame",
        "semantics",
        "structural",
        "option",
        "introduces",
        "constraint",
        "interpretation",
        "merge",
        "relation",
        "r",
        "completeness",
        "calculus",
        "structural",
        "option",
        "respect",
        "frame",
        "respecting",
        "relevant",
        "constraint",
        "došen",
        "associative",
        "calculus",
        "l",
        "fact",
        "allows",
        "specific",
        "model",
        "read",
        "rxyz",
        "x",
        "z",
        "binary",
        "concatenation",
        "operation",
        "pentus",
        "present",
        "quite",
        "intricate",
        "proof",
        "l",
        "indeed",
        "complete",
        "respect",
        "free",
        "semigroup",
        "model",
        "language",
        "model",
        "also",
        "called",
        "structural",
        "postulate",
        "b",
        "b",
        "commutativity",
        "b",
        "c",
        "b",
        "c",
        "associativity",
        "corresponding",
        "structural",
        "rule",
        "sequent",
        "presentation",
        "w",
        "x",
        "c",
        "w",
        "x",
        "c",
        "comm",
        "w",
        "x",
        "z",
        "c",
        "w",
        "x",
        "z",
        "c",
        "assoc",
        "frame",
        "constraint",
        "commutativity",
        "xyz",
        "rxyz",
        "implies",
        "rxzy",
        "frame",
        "constraint",
        "associativity",
        "rebracketing",
        "left",
        "xyzrs",
        "rrxs",
        "rsyz",
        "imply",
        "t",
        "rrtz",
        "rtxy",
        "similarly",
        "direction",
        "characteristic",
        "property",
        "lp",
        "collapse",
        "distinction",
        "left",
        "right",
        "division",
        "ab",
        "ba",
        "become",
        "interderivable",
        "syntactic",
        "point",
        "view",
        "global",
        "availability",
        "associativity",
        "andor",
        "commutativity",
        "lp",
        "would",
        "entail",
        "arbitrary",
        "change",
        "constituent",
        "structure",
        "andor",
        "word",
        "order",
        "affect",
        "wellformedness",
        "expression",
        "position",
        "linguist",
        "subscribe",
        "whether",
        "global",
        "associativity",
        "find",
        "l",
        "viable",
        "option",
        "syntax",
        "open",
        "dispute",
        "lambek",
        "point",
        "case",
        "overgeneration",
        "resulting",
        "free",
        "rebracketing",
        "paper",
        "later",
        "reverts",
        "associative",
        "view",
        "following",
        "section",
        "see",
        "lp",
        "perfectly",
        "legitimate",
        "calculus",
        "meaning",
        "composition",
        "discus",
        "controlled",
        "form",
        "structural",
        "reasoning",
        "anchored",
        "lexical",
        "type",
        "assignment",
        "alternative",
        "problematic",
        "allornothing",
        "option"
    ]
}