{
    "main_text": "Theoretical Frameworks || Objects of Understanding\n2.1 Objects of Understanding\n\nAt least at first glance, the objects of understanding appear to be so\nvaried that it is not obvious where one might find a common thread.\nThus, we can understand fields of study, particular states of affairs,\ninstitutions, other people, and on and on (cf. Elgin\n1996: 123).\n\nIn line with the discussion in Ancient philosophy, and setting aside\nfor the moment special issues related to understanding other people\n(see Section 5), let us start with the generic view that the objects\nof understanding are something like “connections” or\n“relations”. Following a distinction from Kim (1994\n[2010]), we can contrast two ways of thinking about these connections\nand relations—i.e., these plausible objects of\nunderstanding.\n\nAccording to explanatory internalism, the connections or\nexplanatory relations one grasps are “logico-linguistic”\nrelations that hold among a person’s beliefs or attitudes, or\nmore exactly the contents of those beliefs or attitudes (Kim 1994\n[2010]). What we grasp or see, when we understand some\nphenomenon, are how these various contents are logically or\nsemantically related to one another.\n\nKim argues that Hempel is a paradigm example of an explanatory\ninternalist (Kim 1994 [2010]; cf. 1999 [2010]). For instance, suppose\nthat one wants to explain and hence understand why a particular bar of\nmetal began to rust (McCain 2016: ch. 9). A good Hempelian explanation\nwould be one in which a sentence describing the rusting follows\ninferentially from (a) a statement of the initial conditions (the\nmoisture in the air, the constitution of the bar) and (b) a further\nlaw-like statement connecting the moisture, the constitution of the\nbar, and the onset of rust.\n\nThis Hempelian framework seems internalist because what you see or\ngrasp, when you understand the phenomenon, are connections among the\npropositions you accept—more exactly, you see or grasp different\ninferential or probabilistic connections among the contents of your\nbeliefs that bear on the rusting. As Kim puts it:\n\n\nthe basic relation that generates an explanatory relation is a\nlogico-linguistic one that connects descriptions of events, and the\njob of formulating an explanation consists, it seems, in merely\nre-arranging appropriate items in the body of propositions that\nconstitute our total knowledge at a time. In explaining something,\nthen, all action takes place within the epistemic system, on\nthe subjective side of the divide between knowledge and the reality\nknown, or between representation and the world represented. (Kim 1994\n[2010: 171–172])\n\n\nAn explanatory externalist by comparison holds that the basic\nconnections or relationship one grasps, when one understands, are not\nlogico-linguistic but metaphysical. What you grasp, when you\nunderstand why the metal began to rust, are not primarily\nrelationships among your beliefs or their contents. Rather, you\nprimarily grasp real, mind-independent relationships that obtain in\nthe world.\n\nTheorists who hold that the objects of understanding are\ninternal—i.e., logico-linguistic relations, the grasp of which\nyields understanding—vary somewhat about which relations count.\nAlthough it seems clear in Hempel that the objects are inferential\nrelationships of deductive and inductive support, epistemologists\noften appeal in a general way to relations of coherence. Thus\nCarter and Gordon write:\n\n\nWe think it is clear that objectual understanding—for\nexample, as one attains when one grasps the relevant coherence-making\nrelations between propositions comprising some subject matter—is\na particularly valuable epistemic good… Understanding wider\nsubject matters will tend to be more cognitively demanding than\nunderstanding narrow subject matters because more\npropositions must be believed and their relations grasped. (Carter\n& Gordon 2014: 7–8)\n\n\nKvanvig likewise points to the importance of coherence:\n\n\nCentral to the notion of understanding are various coherence-like\nelements: to have understanding is to grasp explanatory and conceptual\nconnections between various pieces of information involved in the\nsubject matter in question. Such language involves a subjective\nelement (the grasping or seeing of the connections in question) and a\nmore objective, epistemic element. The more objective, epistemic\nelement is precisely the kind of element identified by coherentists as\ncentral to the notion of epistemic justification or rationality, as\nclarified, in particular, by Lehrer (1974), BonJour (1985) and Lycan\n(1988). (Kvanvig 2018: 699)\n\n\nOther epistemologists similarly point to coherence relations as the\nobjects of understanding (e.g., Riggs 2003: 192). Since\n“coherence” is presumably a relation that holds among the\ncontents of beliefs, and not among items out there in the world, these\nviews would qualify as internalist accounts of the objects of\nunderstanding, according to the Kimean framework. (For further\nexamples and criticism, see Khalifa 2017a.)\n\nFor externalists about the object of understanding, especially\nconcerning phenomena “out there in the world”, the\nproposed objects vary. For instance, there is some support for the\nidea that the objects are nomic relations, or relationships\naccording to which individual events and other phenomena are explained\nby laws, and upper-level laws are explained by lower-level or more\nfundamental laws (Railton 1978). Another view is that the objects are\ncausal relations (Salmon 1984; Lipton 1991 [2004]), or more\ngenerally dependence relations (Kim 1974, 1994; Grimm 2014,\n2017; Greco 2014; Dellsén 2020), where causation is usually\ntaken to be just one species of dependence.\n\nA variation on the “dependence relationships” idea is that\nthe objects of understanding are “possibility spaces” (cf.\nle Bihan 2017). Indeed, on the plausible assumption that dependence is\nan essentially modal notion—that is, fundamentally tied to ideas\nof possibility and necessity—dependence relations ineliminably\ngive rise to or generate possibility spaces. This is in keeping with a\nsuggestion by Robert Nozick that\n\n\nexplanation locates something in actuality, showing its actual\nconnections with other things, while understanding locates it\nin a network of possibility, showing the connections it would have to\nother nonactual things or processes. (Nozick 1981: 12; cf. Grimm\n2008)\n\n\nNote that the distinction between internal and external explanation\nrelations is related to, but cross-cuts, another influential\ndistinction by Wesley Salmon, between ontic and epistemic accounts of\nexplanation (Salmon 1989; for discussion see Bechtel & Abrahamsen\n2005 and Craver 2014). Salmon’s distinction has come in for\ncriticism (see, e.g., Illari 2013; Bokulich 2016, 2018), because among\nother things it is not clear why epistemic accounts should not be\nontic or world-involving; knowledge is an epistemic concept, after\nall, but it is ontic or world-involving in virtue of the truth\ncondition. The distinction between explanatory internalism and\nexternalism plausibly avoids this concern.\n\nSuppose in any case that the objects of understanding—the\nconnections or relations we grasp when we understand—are out\nthere in the world, and are not simply logico-linguistic items or\nelements of our psychology. According to a further important\ndistinction from John Greco (2014), it does not follow that these\nlogico-linguistic/psychological items—or more generally these\nmental representations—do not play a crucial role in\nour coming to understand, because the representations typically play\nthe role of vehicles of understanding, even if they are not\nthemselves understanding’s object. More generally, Greco notes,\nit is important to distinguish between the object of\nunderstanding vs. the vehicle of understanding, i.e.,\n“between the thing understood and its\nrepresentation” (Greco 2014: 293).\n\nThus consider that a good map—say, of Midtown Manhattan—is\ntypically a vehicle of understanding rather than an object of\nunderstanding. When it is accurate, it allows the mind to grasp how\nthe streets and landmarks of Midtown are laid out, and to appreciate\nthe relationships they bear to one another. Or again, typically when\nyou take a look at your car’s gas gauge and form the belief that\nthe tank is half empty, the gauge is the vehicle by which you\nform your belief about the gas, but it is not the object of\nyour belief (see Dretske 1981). Assuming that the gauge is functioning\nproperly, the object of your belief is the gas itself, while the gauge\nis simply the vehicle that represents the state of the gas to you.\n\n(Of course, either the map or the gauge could become an\nobject of understanding—one could think about how the streets\nand landmarks are represented, e.g., the different colors or shapes or\nfonts the map uses to represent Midtown, or the length of the\ngauge—but this would be to “involve a representation of a\nrepresentation” (Greco 2014: 293). And while the mind is capable\nof such an act, it represents an element of abstraction, and plausibly\na departure from our usual way of engaging with the world.)\n\nThis distinction between objects and vehicles of understanding leaves\nopen the possibility that mental representations might not be the only\nvehicles of understanding, or the only way of latching on to real\nrelations in the world. Perhaps a person might come to understand the\nworld by first manually manipulating it, thus noting the possibilities\nthat it affords and how its different elements are connected (cf.\nLipton 2009; Kuorikoski and Ylikoski 2015). This would be a way to\n“directly” grasp causal structure, a structure that could\nthen—cognitively downstream, as it were—be represented by\nthe mind, perhaps in the form of mental maps, or “dependence\nmaps” (see Section 2.2).\n\nAppreciating the contrast between vehicle of understanding and object\nof understanding helps to reveal that in addition to pure internalist\nviews about the object of understanding (where the objects of\nunderstanding are logico-linguistic relations), and pure externalist\nviews (where the objects are worldly), there are also possible hybrid\nviews.\n\nFor instance, on the sort of view we find in Michael Strevens’s\nDepth (2008), what we grasp in the first instance are\nrelations that hold among the contents of our beliefs: relations of\ndeductive entailment or coherence or probabilistic support. This view\nis not simply internalist, however, because grasping these\nlogico-linguistic relationships, and in particular the relationships\nof deductive entailment, “mirror” the real relationships\nthat obtain in the world, and thus provide a vehicle for apprehending\nthose relationships (Strevens 2008: 72). Thus Strevens holds that his\ntheory is able to:\n\n\nshow how a deductive argument, or similar formal structure, can\nrepresent causal influence…. When a deductive argument is of\nthe right sort to represent a causal process that has as a consequence\nthe state of affairs asserted to hold by the argument’s\nconclusion, I say that the argument causally entails the\nconclusion. A derivation that causally entails its conclusion, then,\nis one that can be used to represent (whether truly or not) a causal\nprocess that has the concluding state of affairs as its consequence.\n(Strevens 2012: 449)\n\n\nOn this view, by grasping or appreciating the necessitating force of\nan entailment relation one thereby grasps or appreciates the\nnecessitating force of a causal relation—or, at least, something\nimportantly like it.\n\nAccording to another hybrid approach, the internal logical or\nprobabilistic relationships do not mirror the relationships\nout there in the world, but rather provide evidence for the\nexistence of relationships out there in the world. Thus some hold that\nwhen things go well an appreciation or grasp of the probabilistic\nconnections among the various things we believe allows us to infer the\nexistence of real causal connections in the world (see\nSpirtes, Glymour, & Scheines 1993; Pearl 2000 [2009]). As\nWesley Salmon characterizes an earlier version of this idea,\n\n\nThe explanatory significance of statistical relations is indirect.\nTheir fundamental import lies in the fact… that they constitute\nevidence for causal relations. (Salmon 1984: 192)\n\n\nBearing in mind earlier distinctions, these would be accounts on which\none’s appreciation of statistical relations is the vehicle\nthrough which one grasps real (external) causal relations in the\nworld.\n",
    "section_title": "2.1 Objects of Understanding",
    "entry_title": "Understanding",
    "hierarchy_title": "Understanding || Theoretical Frameworks || Objects of Understanding",
    "tokenized_text": [
        "theoretical",
        "framework",
        "object",
        "understanding",
        "object",
        "understanding",
        "least",
        "first",
        "glance",
        "object",
        "understanding",
        "appear",
        "varied",
        "obvious",
        "one",
        "might",
        "find",
        "common",
        "thread",
        "thus",
        "understand",
        "field",
        "study",
        "particular",
        "state",
        "affair",
        "institution",
        "people",
        "cf",
        "elgin",
        "line",
        "discussion",
        "ancient",
        "philosophy",
        "setting",
        "aside",
        "moment",
        "special",
        "issue",
        "related",
        "understanding",
        "people",
        "see",
        "section",
        "let",
        "u",
        "start",
        "generic",
        "view",
        "object",
        "understanding",
        "something",
        "like",
        "connection",
        "relation",
        "following",
        "distinction",
        "kim",
        "contrast",
        "two",
        "way",
        "thinking",
        "connection",
        "relationsie",
        "plausible",
        "object",
        "understanding",
        "according",
        "explanatory",
        "internalism",
        "connection",
        "explanatory",
        "relation",
        "one",
        "grasp",
        "logicolinguistic",
        "relation",
        "hold",
        "among",
        "person",
        "belief",
        "attitude",
        "exactly",
        "content",
        "belief",
        "attitude",
        "kim",
        "grasp",
        "see",
        "understand",
        "phenomenon",
        "various",
        "content",
        "logically",
        "semantically",
        "related",
        "one",
        "another",
        "kim",
        "argues",
        "hempel",
        "paradigm",
        "example",
        "explanatory",
        "internalist",
        "kim",
        "cf",
        "instance",
        "suppose",
        "one",
        "want",
        "explain",
        "hence",
        "understand",
        "particular",
        "bar",
        "metal",
        "began",
        "rust",
        "mccain",
        "ch",
        "good",
        "hempelian",
        "explanation",
        "would",
        "one",
        "sentence",
        "describing",
        "rusting",
        "follows",
        "inferentially",
        "statement",
        "initial",
        "condition",
        "moisture",
        "air",
        "constitution",
        "bar",
        "b",
        "lawlike",
        "statement",
        "connecting",
        "moisture",
        "constitution",
        "bar",
        "onset",
        "rust",
        "hempelian",
        "framework",
        "seems",
        "internalist",
        "see",
        "grasp",
        "understand",
        "phenomenon",
        "connection",
        "among",
        "proposition",
        "acceptmore",
        "exactly",
        "see",
        "grasp",
        "different",
        "inferential",
        "probabilistic",
        "connection",
        "among",
        "content",
        "belief",
        "bear",
        "rusting",
        "kim",
        "put",
        "basic",
        "relation",
        "generates",
        "explanatory",
        "relation",
        "logicolinguistic",
        "one",
        "connects",
        "description",
        "event",
        "job",
        "formulating",
        "explanation",
        "consists",
        "seems",
        "merely",
        "rearranging",
        "appropriate",
        "item",
        "body",
        "proposition",
        "constitute",
        "total",
        "knowledge",
        "time",
        "explaining",
        "something",
        "action",
        "take",
        "place",
        "within",
        "epistemic",
        "system",
        "subjective",
        "side",
        "divide",
        "knowledge",
        "reality",
        "known",
        "representation",
        "world",
        "represented",
        "kim",
        "explanatory",
        "externalist",
        "comparison",
        "hold",
        "basic",
        "connection",
        "relationship",
        "one",
        "grasp",
        "one",
        "understands",
        "logicolinguistic",
        "metaphysical",
        "grasp",
        "understand",
        "metal",
        "began",
        "rust",
        "primarily",
        "relationship",
        "among",
        "belief",
        "content",
        "rather",
        "primarily",
        "grasp",
        "real",
        "mindindependent",
        "relationship",
        "obtain",
        "world",
        "theorist",
        "hold",
        "object",
        "understanding",
        "internalie",
        "logicolinguistic",
        "relation",
        "grasp",
        "yield",
        "understandingvary",
        "somewhat",
        "relation",
        "count",
        "although",
        "seems",
        "clear",
        "hempel",
        "object",
        "inferential",
        "relationship",
        "deductive",
        "inductive",
        "support",
        "epistemologist",
        "often",
        "appeal",
        "general",
        "way",
        "relation",
        "coherence",
        "thus",
        "carter",
        "gordon",
        "write",
        "think",
        "clear",
        "objectual",
        "understandingfor",
        "example",
        "one",
        "attains",
        "one",
        "grasp",
        "relevant",
        "coherencemaking",
        "relation",
        "proposition",
        "comprising",
        "subject",
        "matteris",
        "particularly",
        "valuable",
        "epistemic",
        "good",
        "understanding",
        "wider",
        "subject",
        "matter",
        "tend",
        "cognitively",
        "demanding",
        "understanding",
        "narrow",
        "subject",
        "matter",
        "proposition",
        "must",
        "believed",
        "relation",
        "grasped",
        "carter",
        "gordon",
        "kvanvig",
        "likewise",
        "point",
        "importance",
        "coherence",
        "central",
        "notion",
        "understanding",
        "various",
        "coherencelike",
        "element",
        "understanding",
        "grasp",
        "explanatory",
        "conceptual",
        "connection",
        "various",
        "piece",
        "information",
        "involved",
        "subject",
        "matter",
        "question",
        "language",
        "involves",
        "subjective",
        "element",
        "grasping",
        "seeing",
        "connection",
        "question",
        "objective",
        "epistemic",
        "element",
        "objective",
        "epistemic",
        "element",
        "precisely",
        "kind",
        "element",
        "identified",
        "coherentists",
        "central",
        "notion",
        "epistemic",
        "justification",
        "rationality",
        "clarified",
        "particular",
        "lehrer",
        "bonjour",
        "lycan",
        "kvanvig",
        "epistemologist",
        "similarly",
        "point",
        "coherence",
        "relation",
        "object",
        "understanding",
        "eg",
        "riggs",
        "since",
        "coherence",
        "presumably",
        "relation",
        "hold",
        "among",
        "content",
        "belief",
        "among",
        "item",
        "world",
        "view",
        "would",
        "qualify",
        "internalist",
        "account",
        "object",
        "understanding",
        "according",
        "kimean",
        "framework",
        "example",
        "criticism",
        "see",
        "khalifa",
        "a",
        "externalists",
        "object",
        "understanding",
        "especially",
        "concerning",
        "phenomenon",
        "world",
        "proposed",
        "object",
        "vary",
        "instance",
        "support",
        "idea",
        "object",
        "nomic",
        "relation",
        "relationship",
        "according",
        "individual",
        "event",
        "phenomenon",
        "explained",
        "law",
        "upperlevel",
        "law",
        "explained",
        "lowerlevel",
        "fundamental",
        "law",
        "railton",
        "another",
        "view",
        "object",
        "causal",
        "relation",
        "salmon",
        "lipton",
        "generally",
        "dependence",
        "relation",
        "kim",
        "grimm",
        "greco",
        "dellsén",
        "causation",
        "usually",
        "taken",
        "one",
        "specie",
        "dependence",
        "variation",
        "dependence",
        "relationship",
        "idea",
        "object",
        "understanding",
        "possibility",
        "space",
        "cf",
        "le",
        "bihan",
        "indeed",
        "plausible",
        "assumption",
        "dependence",
        "essentially",
        "modal",
        "notionthat",
        "fundamentally",
        "tied",
        "idea",
        "possibility",
        "necessitydependence",
        "relation",
        "ineliminably",
        "give",
        "rise",
        "generate",
        "possibility",
        "space",
        "keeping",
        "suggestion",
        "robert",
        "nozick",
        "explanation",
        "locates",
        "something",
        "actuality",
        "showing",
        "actual",
        "connection",
        "thing",
        "understanding",
        "locates",
        "network",
        "possibility",
        "showing",
        "connection",
        "would",
        "nonactual",
        "thing",
        "process",
        "nozick",
        "cf",
        "grimm",
        "note",
        "distinction",
        "internal",
        "external",
        "explanation",
        "relation",
        "related",
        "crosscuts",
        "another",
        "influential",
        "distinction",
        "wesley",
        "salmon",
        "ontic",
        "epistemic",
        "account",
        "explanation",
        "salmon",
        "discussion",
        "see",
        "bechtel",
        "abrahamsen",
        "craver",
        "salmon",
        "distinction",
        "come",
        "criticism",
        "see",
        "eg",
        "illari",
        "bokulich",
        "among",
        "thing",
        "clear",
        "epistemic",
        "account",
        "ontic",
        "worldinvolving",
        "knowledge",
        "epistemic",
        "concept",
        "ontic",
        "worldinvolving",
        "virtue",
        "truth",
        "condition",
        "distinction",
        "explanatory",
        "internalism",
        "externalism",
        "plausibly",
        "avoids",
        "concern",
        "suppose",
        "case",
        "object",
        "understandingthe",
        "connection",
        "relation",
        "grasp",
        "understandare",
        "world",
        "simply",
        "logicolinguistic",
        "item",
        "element",
        "psychology",
        "according",
        "important",
        "distinction",
        "john",
        "greco",
        "follow",
        "logicolinguisticpsychological",
        "itemsor",
        "generally",
        "mental",
        "representationsdo",
        "play",
        "crucial",
        "role",
        "coming",
        "understand",
        "representation",
        "typically",
        "play",
        "role",
        "vehicle",
        "understanding",
        "even",
        "understanding",
        "object",
        "generally",
        "greco",
        "note",
        "important",
        "distinguish",
        "object",
        "understanding",
        "vs",
        "vehicle",
        "understanding",
        "ie",
        "thing",
        "understood",
        "representation",
        "greco",
        "thus",
        "consider",
        "good",
        "mapsay",
        "midtown",
        "manhattanis",
        "typically",
        "vehicle",
        "understanding",
        "rather",
        "object",
        "understanding",
        "accurate",
        "allows",
        "mind",
        "grasp",
        "street",
        "landmark",
        "midtown",
        "laid",
        "appreciate",
        "relationship",
        "bear",
        "one",
        "another",
        "typically",
        "take",
        "look",
        "car",
        "gas",
        "gauge",
        "form",
        "belief",
        "tank",
        "half",
        "empty",
        "gauge",
        "vehicle",
        "form",
        "belief",
        "gas",
        "object",
        "belief",
        "see",
        "dretske",
        "assuming",
        "gauge",
        "functioning",
        "properly",
        "object",
        "belief",
        "gas",
        "gauge",
        "simply",
        "vehicle",
        "represents",
        "state",
        "gas",
        "course",
        "either",
        "map",
        "gauge",
        "could",
        "become",
        "object",
        "understandingone",
        "could",
        "think",
        "street",
        "landmark",
        "represented",
        "eg",
        "different",
        "color",
        "shape",
        "font",
        "map",
        "us",
        "represent",
        "midtown",
        "length",
        "gaugebut",
        "would",
        "involve",
        "representation",
        "representation",
        "greco",
        "mind",
        "capable",
        "act",
        "represents",
        "element",
        "abstraction",
        "plausibly",
        "departure",
        "usual",
        "way",
        "engaging",
        "world",
        "distinction",
        "object",
        "vehicle",
        "understanding",
        "leaf",
        "open",
        "possibility",
        "mental",
        "representation",
        "might",
        "vehicle",
        "understanding",
        "way",
        "latching",
        "real",
        "relation",
        "world",
        "perhaps",
        "person",
        "might",
        "come",
        "understand",
        "world",
        "first",
        "manually",
        "manipulating",
        "thus",
        "noting",
        "possibility",
        "affords",
        "different",
        "element",
        "connected",
        "cf",
        "lipton",
        "kuorikoski",
        "ylikoski",
        "would",
        "way",
        "directly",
        "grasp",
        "causal",
        "structure",
        "structure",
        "could",
        "thencognitively",
        "downstream",
        "werebe",
        "represented",
        "mind",
        "perhaps",
        "form",
        "mental",
        "map",
        "dependence",
        "map",
        "see",
        "section",
        "appreciating",
        "contrast",
        "vehicle",
        "understanding",
        "object",
        "understanding",
        "help",
        "reveal",
        "addition",
        "pure",
        "internalist",
        "view",
        "object",
        "understanding",
        "object",
        "understanding",
        "logicolinguistic",
        "relation",
        "pure",
        "externalist",
        "view",
        "object",
        "worldly",
        "also",
        "possible",
        "hybrid",
        "view",
        "instance",
        "sort",
        "view",
        "find",
        "michael",
        "strevens",
        "depth",
        "grasp",
        "first",
        "instance",
        "relation",
        "hold",
        "among",
        "content",
        "belief",
        "relation",
        "deductive",
        "entailment",
        "coherence",
        "probabilistic",
        "support",
        "view",
        "simply",
        "internalist",
        "however",
        "grasping",
        "logicolinguistic",
        "relationship",
        "particular",
        "relationship",
        "deductive",
        "entailment",
        "mirror",
        "real",
        "relationship",
        "obtain",
        "world",
        "thus",
        "provide",
        "vehicle",
        "apprehending",
        "relationship",
        "strevens",
        "thus",
        "strevens",
        "hold",
        "theory",
        "able",
        "show",
        "deductive",
        "argument",
        "similar",
        "formal",
        "structure",
        "represent",
        "causal",
        "influence",
        "deductive",
        "argument",
        "right",
        "sort",
        "represent",
        "causal",
        "process",
        "consequence",
        "state",
        "affair",
        "asserted",
        "hold",
        "argument",
        "conclusion",
        "say",
        "argument",
        "causally",
        "entail",
        "conclusion",
        "derivation",
        "causally",
        "entail",
        "conclusion",
        "one",
        "used",
        "represent",
        "whether",
        "truly",
        "causal",
        "process",
        "concluding",
        "state",
        "affair",
        "consequence",
        "strevens",
        "view",
        "grasping",
        "appreciating",
        "necessitating",
        "force",
        "entailment",
        "relation",
        "one",
        "thereby",
        "grasp",
        "appreciates",
        "necessitating",
        "force",
        "causal",
        "relationor",
        "least",
        "something",
        "importantly",
        "like",
        "according",
        "another",
        "hybrid",
        "approach",
        "internal",
        "logical",
        "probabilistic",
        "relationship",
        "mirror",
        "relationship",
        "world",
        "rather",
        "provide",
        "evidence",
        "existence",
        "relationship",
        "world",
        "thus",
        "hold",
        "thing",
        "go",
        "well",
        "appreciation",
        "grasp",
        "probabilistic",
        "connection",
        "among",
        "various",
        "thing",
        "believe",
        "allows",
        "u",
        "infer",
        "existence",
        "real",
        "causal",
        "connection",
        "world",
        "see",
        "spirtes",
        "glymour",
        "scheines",
        "pearl",
        "wesley",
        "salmon",
        "characterizes",
        "earlier",
        "version",
        "idea",
        "explanatory",
        "significance",
        "statistical",
        "relation",
        "indirect",
        "fundamental",
        "import",
        "lie",
        "fact",
        "constitute",
        "evidence",
        "causal",
        "relation",
        "salmon",
        "bearing",
        "mind",
        "earlier",
        "distinction",
        "would",
        "account",
        "one",
        "appreciation",
        "statistical",
        "relation",
        "vehicle",
        "one",
        "grasp",
        "real",
        "external",
        "causal",
        "relation",
        "world"
    ]
}