{
    "main_text": "Universals in the Via Antiqua\n8. Universals in the Via Antiqua\n\nIn this framework, we have first of all the universal or common terms\nof spoken and written languages, which are common on account of being\nimposed upon universal concepts of the human mind. The concepts\nthemselves are universal on account of being obtained by the activity\nof the abstractive human mind from experiences of singulars. But the\nprocess of concept formation also involves various stages.\n\nIn the first place, the sensory information collected by the single\nsenses is distinguished, synthesized, and collated by the higher\nsensory faculties of the common sense [sensus communis] and\nthe so-called cogitative power [vis cogitativa], to be stored\nin sensory memory as phantasms, the sensory representations\nof singulars in their singularity. The active intellect\n[intellectus agens] uses this sensory information to extract\nits intelligible content and produce the intelligible species\n[species intelligibiles], the universal representations of\nseveral individuals in their various degrees of formal unity,\ndisregarding their distinctive features and individuating conditions\nin the process of abstraction.\n\nThe intelligible species are stored in the intellectual memory of the\npotential intellect [intellectus possibilis], which can then\nuse them to form the corresponding concept in an act of thought, for\nexample, in forming a judgment. The intelligible species and the\nconcepts themselves, being formed by individual human minds, are\nindividual in their being, insofar as they pertain to this or that\nhuman mind. However, since they are the result of abstraction, in\ntheir information content they are universal.\n\nNow insofar as this universal information content is common to all\nminds that form these concepts at all, and therefore it is a common\nintelligible content gained by these minds from their objects insofar\nas they are conceived by these minds in a universal manner, later\nscholastic thinkers refer to it as the objective concept\n[conceptus obiectivus], distinguishing it from the formal or\nsubjective concepts [conceptus formales seu subiectivi],\nwhich are the individual acts of individual minds carrying this\ninformation (just as the individual copies of a book carry the\ninformation content of the\n book).[40]\n It is this objective concept that is identified as the universal of\nthe human mind (distinguished from the universals of the divine mind),\nnamely, a species, a genus, a difference, a property, or an accident.\n(Note that these are only the simple concepts. Complex concepts, such\nas those corresponding to complex terms and propositions are the\nproducts of the potential intellect using these concepts in its\nfurther operations.)\n\nThese universals, then, as the objective concepts of the mind, would\nbe classified as beings of reason [entia rationis], the being\nof which consists in their being conceived (cf. Klima 1993b and\nSchmidt 1966). To be sure, they are not merely fictitious objects, for\nthey are grounded in the nature of things insofar as they carry the\nuniversal information content abstracted from the singulars. But then\nagain, the universal information content of the objective concept\nitself, considered not insofar as it is in the mind as its object, but\nin itself, disregarding whatever may carry it, is distinguished from\nits carriers both in the mind and in the ultimate objects of the mind,\nthe singular things, as the nature of these things in its absolute\nconsideration.\n\nHowever, the common nature as such cannot exist on its own any more\nthan a book could exist without any copies of it or any minds\nconceiving of it. So, this common nature has real existence only in\nthe singulars, informing them, and giving them their recognizably\ncommon characteristics. However, these common characteristics can be\nrecognized as such only by a mind capable of abstracting the common\nnature from experiencing it in its really existing singular instances.\nBut it is on account of the real existence of these individualized\ninstances in the singulars that the common nature can truly be\npredicated of the singulars, as long as they are actually informed by\nthese individualized instances.\n\nThe items thus distinguished and their interconnections can be\nrepresented by the following block-diagram. The dashed frames indicate\nthat the items enclosed by them have a certain reduced ontological\nstatus, a “diminished” mode of being, while the boxes\npartly sharing a side indicate the (possible) partial identities of\nthe items they\n enclose.[41]\n The arrows pointing from the common term to the singulars, their\nindividualized natures and items in the mind on this diagram represent\nsemantic relations, which I am going to explain later, in connection\nwith Ockham’s innovations. The rest of the arrows indicate the\nflow of information from experience of singulars through the sensory\nfaculties to the abstractive mind, and to the application of the\nuniversal information abstracted by the mind to further singular\nexperiences in acts of judgment.\n\n\n\nFigure 4. The via antiqua\nconception\n\n\nObviously, this is a rather complicated picture. However, its\ncomplexity itself should not be regarded as problematic or even\nsurprising, for that matter. After all, this diagram merely\nsummarizes, and distinguishes the main stages of, how the human mind\nprocesses the intelligible, universal information received from a\nmultitude of singular experiences, and then again, how it applies this\ninformation in classifying further experiences. This process may\nreasonably be expected to be complex, and should not be expected to\ninvolve fewer stages than, e.g., setting up, and retrieving\ninformation from, a computer database.\n\nWhat renders this picture more problematic is rather the difficulties\ninvolved in identifying and distinguishing these stages and the\ncorresponding items. Further complications were also generated by the\nvariations in terminology among several authors, and the various\ncriteria of identity and distinctness applied by them in introducing\nvarious different notions of identity and distinctness. In fact, many\nof the great debates of the authors working within this framework can\nbe characterized precisely as disputing the identity or distinctness\nof the items featured here, or the very criteria of identifying or\ndistinguishing them.\n\nFor example, already Abelard raised the question whether the concept\nor mental image, which we may identify in the diagram as the objective\nconcept of later authors, should be identified with the act of\nthought, which we may identify as the subjective concept, or perhaps a\nfurther act of the mind, called formatio, namely, the\npotential intellect’s act of forming the concept, using the\nintelligible species as the principle of its action. Such distinctions\nwere later on severely criticized by authors such as John Peter Olivi\nand others, who argued for the elimination of intelligible species,\nand, in general, of any intermediaries between an act of the intellect\nand its ultimate objects, the singulars conceived in a universal\n manner.[42]\n\nAgain, looking at the diagram on the side of the singulars, most\n13th century authors agreed that what accounts for the\nspecific unity of several individuals of the same species, namely,\ntheir specific nature, should be something other than what accounts\nfor their numerical distinctness, namely, their principle of\nindividuation. However, one singular entity in a species of several\nco-specific individuals has to contain both the principle of the\nspecific unity of these individuals and its own principle of\nindividuation. Therefore, this singular entity, being a composite at\nleast of its specific nature and its principle of individuation, has\nto be distinct from its specific nature. At any rate, this is the\nsituation with material substances, whose principle of individuation\nwas held to be their matter. However, based on this reasoning,\nimmaterial substances, such as angels, could not be regarded as\nnumerically distinct on account of their matter, but only on account\nof their form. But since form is the principle of specific unity,\ndifference in form causes specific diversity. Therefore, on this\nbasis, any two angels had to be regarded as different in species. This\nconclusion was explicitly drawn by Aquinas and others, but it was\nrejected by Augustinian theologians, and it was condemned in Paris in\n 1277.[43]\n\nSo, no wonder authors such as Henry of Ghent and Duns Scotus worked\nout alternative accounts of individuation, introducing not only\ndifferent principles of individuation, such as the Scotists’\nfamous (or infamous) haecceity, but also different criteria\nof distinctness and identity, such as those grounding Henry of\nGhent’s intentional distinction, or Scotus’s\nformal\n distinction,[44]\n or even later Suarez’ modal\n distinction.[45]\n\nBut even further problems arose from considering the identity or\ndistinctness of the individualized natures signified by several common\nterms in one and the same individual. The metaphysical debate over the\nreal distinction of essence and existence from this point of view is\nnothing but the issue whether the individualized common nature\nsignified by the definition of a thing is the same as the act of being\nsignified by the verb ‘is’ in the same thing. In fact, the\nfamous problem of the plurality vs. unity of substantial forms may\nalso be regarded as a dispute over whether the common natures\nsignified by the substantial predicates on the Porphyrian tree in the\ncategory of substance are distinct or the same in the same individual\n(cf. Callus 1967). Finally, and this appears to be the primary\nmotivation for Ockham’s innovations, there was the question\nwhether one must regard all individualized common natures signified in\nthe same individual by several predicates in the ten Aristotelian\ncategories as distinct from one another. For the affirmative answer\nwould involve commitment to a virtually limitless multiplication of\nentities.\n\nIndeed, according to Ockham, the via antiqua conception would\nentail that\n\na column is to the right by to-the-rightness, God is creating by\ncreation, is good by goodness, just by justice, mighty by might, an\naccident inheres by inherence, a subject is subjected by subjection,\nthe apt is apt by aptitude, a chimera is nothing by nothingness,\nsomeone blind is blind by blindness, a body is mobile by mobility, and\nso on for other, innumerable\n cases.[46]\n\n\nAnd this is nothing, but “multiplying beings according to the\nmultiplicity of terms… which, however, is erroneous and leads\nfar away from the\n truth”.[47]\n",
    "section_title": "8. Universals in the Via Antiqua",
    "entry_title": "The Medieval Problem of Universals",
    "hierarchy_title": "The Medieval Problem of Universals || Universals in the Via Antiqua",
    "tokenized_text": [
        "universal",
        "via",
        "antiqua",
        "universal",
        "via",
        "antiqua",
        "framework",
        "first",
        "universal",
        "common",
        "term",
        "spoken",
        "written",
        "language",
        "common",
        "account",
        "imposed",
        "upon",
        "universal",
        "concept",
        "human",
        "mind",
        "concept",
        "universal",
        "account",
        "obtained",
        "activity",
        "abstractive",
        "human",
        "mind",
        "experience",
        "singular",
        "process",
        "concept",
        "formation",
        "also",
        "involves",
        "various",
        "stage",
        "first",
        "place",
        "sensory",
        "information",
        "collected",
        "single",
        "sens",
        "distinguished",
        "synthesized",
        "collated",
        "higher",
        "sensory",
        "faculty",
        "common",
        "sense",
        "sensus",
        "communis",
        "socalled",
        "cogitative",
        "power",
        "vi",
        "cogitativa",
        "stored",
        "sensory",
        "memory",
        "phantasm",
        "sensory",
        "representation",
        "singular",
        "singularity",
        "active",
        "intellect",
        "intellectus",
        "agens",
        "us",
        "sensory",
        "information",
        "extract",
        "intelligible",
        "content",
        "produce",
        "intelligible",
        "specie",
        "specie",
        "intelligibiles",
        "universal",
        "representation",
        "several",
        "individual",
        "various",
        "degree",
        "formal",
        "unity",
        "disregarding",
        "distinctive",
        "feature",
        "individuating",
        "condition",
        "process",
        "abstraction",
        "intelligible",
        "specie",
        "stored",
        "intellectual",
        "memory",
        "potential",
        "intellect",
        "intellectus",
        "possibilis",
        "use",
        "form",
        "corresponding",
        "concept",
        "act",
        "thought",
        "example",
        "forming",
        "judgment",
        "intelligible",
        "specie",
        "concept",
        "formed",
        "individual",
        "human",
        "mind",
        "individual",
        "insofar",
        "pertain",
        "human",
        "mind",
        "however",
        "since",
        "result",
        "abstraction",
        "information",
        "content",
        "universal",
        "insofar",
        "universal",
        "information",
        "content",
        "common",
        "mind",
        "form",
        "concept",
        "therefore",
        "common",
        "intelligible",
        "content",
        "gained",
        "mind",
        "object",
        "insofar",
        "conceived",
        "mind",
        "universal",
        "manner",
        "later",
        "scholastic",
        "thinker",
        "refer",
        "objective",
        "concept",
        "conceptus",
        "obiectivus",
        "distinguishing",
        "formal",
        "subjective",
        "concept",
        "conceptus",
        "formales",
        "seu",
        "subiectivi",
        "individual",
        "act",
        "individual",
        "mind",
        "carrying",
        "information",
        "individual",
        "copy",
        "book",
        "carry",
        "information",
        "content",
        "book",
        "objective",
        "concept",
        "identified",
        "universal",
        "human",
        "mind",
        "distinguished",
        "universal",
        "divine",
        "mind",
        "namely",
        "specie",
        "genus",
        "difference",
        "property",
        "accident",
        "note",
        "simple",
        "concept",
        "complex",
        "concept",
        "corresponding",
        "complex",
        "term",
        "proposition",
        "product",
        "potential",
        "intellect",
        "using",
        "concept",
        "operation",
        "universal",
        "objective",
        "concept",
        "mind",
        "would",
        "classified",
        "being",
        "reason",
        "entia",
        "rationis",
        "consists",
        "conceived",
        "cf",
        "klima",
        "b",
        "schmidt",
        "sure",
        "merely",
        "fictitious",
        "object",
        "grounded",
        "nature",
        "thing",
        "insofar",
        "carry",
        "universal",
        "information",
        "content",
        "abstracted",
        "singular",
        "universal",
        "information",
        "content",
        "objective",
        "concept",
        "considered",
        "insofar",
        "mind",
        "object",
        "disregarding",
        "whatever",
        "may",
        "carry",
        "distinguished",
        "carrier",
        "mind",
        "ultimate",
        "object",
        "mind",
        "singular",
        "thing",
        "nature",
        "thing",
        "absolute",
        "consideration",
        "however",
        "common",
        "nature",
        "exist",
        "book",
        "could",
        "exist",
        "without",
        "copy",
        "mind",
        "conceiving",
        "common",
        "nature",
        "real",
        "existence",
        "singular",
        "informing",
        "giving",
        "recognizably",
        "common",
        "characteristic",
        "however",
        "common",
        "characteristic",
        "recognized",
        "mind",
        "capable",
        "abstracting",
        "common",
        "nature",
        "experiencing",
        "really",
        "existing",
        "singular",
        "instance",
        "account",
        "real",
        "existence",
        "individualized",
        "instance",
        "singular",
        "common",
        "nature",
        "truly",
        "predicated",
        "singular",
        "long",
        "actually",
        "informed",
        "individualized",
        "instance",
        "item",
        "thus",
        "distinguished",
        "interconnection",
        "represented",
        "following",
        "blockdiagram",
        "dashed",
        "frame",
        "indicate",
        "item",
        "enclosed",
        "certain",
        "reduced",
        "ontological",
        "status",
        "diminished",
        "mode",
        "box",
        "partly",
        "sharing",
        "side",
        "indicate",
        "possible",
        "partial",
        "identity",
        "item",
        "enclose",
        "arrow",
        "pointing",
        "common",
        "term",
        "singular",
        "individualized",
        "nature",
        "item",
        "mind",
        "diagram",
        "represent",
        "semantic",
        "relation",
        "going",
        "explain",
        "later",
        "connection",
        "ockham",
        "innovation",
        "rest",
        "arrow",
        "indicate",
        "flow",
        "information",
        "experience",
        "singular",
        "sensory",
        "faculty",
        "abstractive",
        "mind",
        "application",
        "universal",
        "information",
        "abstracted",
        "mind",
        "singular",
        "experience",
        "act",
        "judgment",
        "figure",
        "via",
        "antiqua",
        "conception",
        "obviously",
        "rather",
        "complicated",
        "picture",
        "however",
        "complexity",
        "regarded",
        "problematic",
        "even",
        "surprising",
        "matter",
        "diagram",
        "merely",
        "summarizes",
        "distinguishes",
        "main",
        "stage",
        "human",
        "mind",
        "process",
        "intelligible",
        "universal",
        "information",
        "received",
        "multitude",
        "singular",
        "experience",
        "applies",
        "information",
        "classifying",
        "experience",
        "process",
        "may",
        "reasonably",
        "expected",
        "complex",
        "expected",
        "involve",
        "fewer",
        "stage",
        "eg",
        "setting",
        "retrieving",
        "information",
        "computer",
        "database",
        "render",
        "picture",
        "problematic",
        "rather",
        "difficulty",
        "involved",
        "identifying",
        "distinguishing",
        "stage",
        "corresponding",
        "item",
        "complication",
        "also",
        "generated",
        "variation",
        "terminology",
        "among",
        "several",
        "author",
        "various",
        "criterion",
        "identity",
        "distinctness",
        "applied",
        "introducing",
        "various",
        "different",
        "notion",
        "identity",
        "distinctness",
        "fact",
        "many",
        "great",
        "debate",
        "author",
        "working",
        "within",
        "framework",
        "characterized",
        "precisely",
        "disputing",
        "identity",
        "distinctness",
        "item",
        "featured",
        "criterion",
        "identifying",
        "distinguishing",
        "example",
        "already",
        "abelard",
        "raised",
        "question",
        "whether",
        "concept",
        "mental",
        "image",
        "may",
        "identify",
        "diagram",
        "objective",
        "concept",
        "later",
        "author",
        "identified",
        "act",
        "thought",
        "may",
        "identify",
        "subjective",
        "concept",
        "perhaps",
        "act",
        "mind",
        "called",
        "formatio",
        "namely",
        "potential",
        "intellect",
        "act",
        "forming",
        "concept",
        "using",
        "intelligible",
        "specie",
        "principle",
        "action",
        "distinction",
        "later",
        "severely",
        "criticized",
        "author",
        "john",
        "peter",
        "olivi",
        "others",
        "argued",
        "elimination",
        "intelligible",
        "specie",
        "general",
        "intermediary",
        "act",
        "intellect",
        "ultimate",
        "object",
        "singular",
        "conceived",
        "universal",
        "manner",
        "looking",
        "diagram",
        "side",
        "singular",
        "th",
        "century",
        "author",
        "agreed",
        "account",
        "specific",
        "unity",
        "several",
        "individual",
        "specie",
        "namely",
        "specific",
        "nature",
        "something",
        "account",
        "numerical",
        "distinctness",
        "namely",
        "principle",
        "individuation",
        "however",
        "one",
        "singular",
        "entity",
        "specie",
        "several",
        "cospecific",
        "individual",
        "contain",
        "principle",
        "specific",
        "unity",
        "individual",
        "principle",
        "individuation",
        "therefore",
        "singular",
        "entity",
        "composite",
        "least",
        "specific",
        "nature",
        "principle",
        "individuation",
        "distinct",
        "specific",
        "nature",
        "rate",
        "situation",
        "material",
        "substance",
        "whose",
        "principle",
        "individuation",
        "held",
        "matter",
        "however",
        "based",
        "reasoning",
        "immaterial",
        "substance",
        "angel",
        "could",
        "regarded",
        "numerically",
        "distinct",
        "account",
        "matter",
        "account",
        "form",
        "since",
        "form",
        "principle",
        "specific",
        "unity",
        "difference",
        "form",
        "cause",
        "specific",
        "diversity",
        "therefore",
        "basis",
        "two",
        "angel",
        "regarded",
        "different",
        "specie",
        "conclusion",
        "explicitly",
        "drawn",
        "aquinas",
        "others",
        "rejected",
        "augustinian",
        "theologian",
        "condemned",
        "paris",
        "wonder",
        "author",
        "henry",
        "ghent",
        "dun",
        "scotus",
        "worked",
        "alternative",
        "account",
        "individuation",
        "introducing",
        "different",
        "principle",
        "individuation",
        "scotists",
        "famous",
        "infamous",
        "haecceity",
        "also",
        "different",
        "criterion",
        "distinctness",
        "identity",
        "grounding",
        "henry",
        "ghent",
        "intentional",
        "distinction",
        "scotus",
        "formal",
        "distinction",
        "even",
        "later",
        "suarez",
        "modal",
        "distinction",
        "even",
        "problem",
        "arose",
        "considering",
        "identity",
        "distinctness",
        "individualized",
        "nature",
        "signified",
        "several",
        "common",
        "term",
        "one",
        "individual",
        "metaphysical",
        "debate",
        "real",
        "distinction",
        "essence",
        "existence",
        "point",
        "view",
        "nothing",
        "issue",
        "whether",
        "individualized",
        "common",
        "nature",
        "signified",
        "definition",
        "thing",
        "act",
        "signified",
        "verb",
        "thing",
        "fact",
        "famous",
        "problem",
        "plurality",
        "vs",
        "unity",
        "substantial",
        "form",
        "may",
        "also",
        "regarded",
        "dispute",
        "whether",
        "common",
        "nature",
        "signified",
        "substantial",
        "predicate",
        "porphyrian",
        "tree",
        "category",
        "substance",
        "distinct",
        "individual",
        "cf",
        "callus",
        "finally",
        "appears",
        "primary",
        "motivation",
        "ockham",
        "innovation",
        "question",
        "whether",
        "one",
        "must",
        "regard",
        "individualized",
        "common",
        "nature",
        "signified",
        "individual",
        "several",
        "predicate",
        "ten",
        "aristotelian",
        "category",
        "distinct",
        "one",
        "another",
        "affirmative",
        "answer",
        "would",
        "involve",
        "commitment",
        "virtually",
        "limitless",
        "multiplication",
        "entity",
        "indeed",
        "according",
        "ockham",
        "via",
        "antiqua",
        "conception",
        "would",
        "entail",
        "column",
        "right",
        "totherightness",
        "god",
        "creating",
        "creation",
        "good",
        "goodness",
        "justice",
        "mighty",
        "might",
        "accident",
        "inheres",
        "inherence",
        "subject",
        "subjected",
        "subjection",
        "apt",
        "apt",
        "aptitude",
        "chimera",
        "nothing",
        "nothingness",
        "someone",
        "blind",
        "blind",
        "blindness",
        "body",
        "mobile",
        "mobility",
        "innumerable",
        "case",
        "nothing",
        "multiplying",
        "being",
        "according",
        "multiplicity",
        "terms",
        "however",
        "erroneous",
        "lead",
        "far",
        "away",
        "truth"
    ]
}