{
    "main_text": "Universals in the Via Moderna\n9. Universals in the Via Moderna\n\nTo be sure, as the very debates within the via antiqua\nframework concerning the identity or non-identity of various items\ndistinguished in that framework indicate, Ockham’s charges are\nnot quite\n justified.[48]\n After all, several via antiqua authors did allow\nthe identification of the significata of terms belonging to\nvarious categories, so their “multiplication of beings”\ndid not necessarily match the multiplicity of terms. Furthermore,\nsince via antiqua authors also distinguished between various\nmodes or senses of being, allowing various sorts of\n“diminished” kinds of being, such as beings of\nreason, their ontological commitments were certainly not as\nunambiguous as Ockham would have us believe in this passage. However,\nif we contrast the diagram of the via antiqua framework above\nwith the following schematic representation of the via\nmoderna framework introduced by Ockham, we can immediately\nappreciate the point of Ockham’s innovations.\n\n\n\nFigure 5. The via moderna\nconception\n\n\nWithout a doubt, it is the captivating simplicity of this picture,\nespecially as compared with the complexity of the via antiqua\npicture, that was the major appeal of the Ockhamist approach. There\nare fewer items here, equally on the same ontological footing,\ndistinguished from one another in terms of the same unambiguous\ndistinction, the numerical distinction between individual real\nentities.\n\nTo be sure, there still are universals in this picture. But these\nuniversals are neither common natures “contracted” to\nindividuals by some really or merely formally distinct principle of\nindividuation, nor some universal objects of the mind, which exist in\na “diminished” manner, as beings of reason.\nOckham’s universals, at least in his mature\n theory,[49]\n are just our common terms and our common concepts. Our common terms,\nwhich are just singular utterances or inscriptions, are common in\nvirtue of being subordinated to our common concepts. Our common\nconcepts, on the other hand, are just singular acts of our singular\nminds. Their universality consists simply in the universality of their\nrepresentative function. For example, the common term\n‘man’ is a spoken or written universal term of English,\nbecause it is subordinated to that concept of our minds by which we\nconceive of each man indifferently. (See Klima, 2011) It is this\nindifference in its representative function that enables the singular\nact of my mind to conceive of each man in a universal manner, and the\nsame goes for the singular act of your mind. Accordingly, there is no\nneed to assume that there is anything in the individual humans,\ndistinct from these humans themselves, a common yet individualized\nnature waiting to be abstracted by the mind. All we need to assume is\nthat two humans are more similar to each other than either of them to\na brute animal, and all animals are more similar to each other than\nany of them to a plant, etc., and that the mind, being able to\nrecognize this similarity, is able to represent the humans by means of\na common specific concept, the animals by means of a common generic\nconcept, all living things by means of a more general generic concept,\n etc.[50]\n In this way, then, the common terms subordinated to these concepts\nneed not signify some abstract common nature in the mind, and\nconsequently its individualized instances in the singulars, for they\ndirectly signify the singulars themselves, just as they are directly\nconceived by the universally representative acts of the mind. So, what\nthese common terms signify are just the singulars themselves, which\nare also the things referred to by these terms when they are used in\npropositions. Using the customary rendering of the medieval logical\nterminology, the things ultimately signified by a common term are its\nsignificata, while the things referred to by the same term\nwhen it is used in a proposition are their (personal)\n supposita.[51]\n\nNow if we compare the two diagrams representing the respective\nconceptions of the two viae, we can see just how radically\nOckham’s innovations changed the character of the semantic\nrelations connecting terms, concepts and things. In both\nviae, common terms are subordinated to common concepts, and\nit is in virtue of this subordination that they ultimately signify\nwhat their concepts represent. In the via moderna, a concept\nis just an act of the mind representing singulars in a more or less\nindifferent manner, yielding a more or less universal signification\nfor the term. In the via antiqua, however, the act of the\nmind is just one item in a whole series of intermediary\nrepresentations, distinguished in terms of their different functions\nin processing universal information, and connected by their common\ncontent, ultimately representing the common, yet individualized\nnatures of their\n singulars.[52]\n Accordingly, a common term, expressing this common content, is\nprimarily subordinated to the objective concept of the mind. But of\ncourse, this objective concept is only the common content of the\nsingular representative acts of singular minds, their subjective\nconcepts, formed by means of the intelligible species, abstracted by\ntheir active intellects. On the other hand, the objective concept,\nabstracting from all individuating conditions, expresses only what is\ncommon to all singulars, namely, their nature considered absolutely.\nBut this absolutely considered nature is only the common content of\nwhat informs each singular of the same nature in its actual real\nexistence. So, the term’s ultimate significata will\nhave to be the individualized natures of the singulars. But these\nultimate significata may still not be the singulars\nthemselves, namely, when the things informed by these\nsignificata are not metaphysically simple. In the via\nmoderna conception, therefore, the ultimate significata\nof a term are nothing but those singular things that can be the\nterm’s supposita in various propositions, as a matter\nof semantics. By contrast, in the via antiqua conception, a\nterm’s ultimate significata may or may not be the same\nthings as the term’s (personal) supposita, depending on\nthe constitution of these supposita, as a matter of\nmetaphysics. The singulars will be the supposita of the term\nwhen it is used as the subject term of a proposition in which\nsomething is predicated about the things informed by these ultimate\nsignificata (in the case of metaphysically simple entities,\nthe term’s significata and supposita\n coincide).[53]\n\nNevertheless, despite the nominalists’ charges to the contrary,\nthe via antiqua framework, as far as its semantic\nconsiderations are concerned, was no more committed to the real\ndistinction of the significata and supposita of its\ncommon terms than the via moderna framework was. For if the\nsemantic theory in itself had precluded the identification of these\nsemantic values, then the question of possible identity of these\nvalues could not have been meaningfully raised in the first place.\nFurthermore, in that case such identifications would have been\nprecluded as meaningless even when talking about metaphysically simple\nentities, such as angels and God, whereas the metaphysical simplicity\nof these entities was expressed precisely in terms of such\nidentifications. But also in the mundane cases of the\nsignificata and supposita of concrete and abstract\nuniversal terms in the nine accidental categories, several via\nantiqua authors argued for the identification of these semantic\nvalues both within and across categories. First of all there was\nAristotle’s authority for the claim that action and passion are\nthe same\n motion,[54]\n so the significata of terms in these two categories could not be\nregarded as really distinct entities. But several authors also argued\nfor the identification of relations with their foundations, that is to\nsay, for the identity of the significata of relative terms with the\nsignificata of terms in the categories quantity and quality. (For\nexample, on this conception, my equality in height to you would be\njust my height, provided you were of the same height, and not a\ndistinct “equality-thing” somehow attached to my height,\ncaused by our equal\n heights.)[55]\n\nBy contrast, what makes the via moderna approach simpler is\nthat it “automatically” achieves such identifications\nalready on the basis of its semantic principles. Since in this\napproach the significata of concrete common terms are just\nthe singulars directly represented by the corresponding concepts, the\nsignificata and (personal) supposita of terms are\ntaken to be the same singulars from the beginning. So these common\nterms signify and supposit for the same things\neither absolutely, provided the term is absolute, or in\nrelation to other singulars, provided the term is\nconnotative. But even in the case of connotative terms, such\nas relative terms (in fact, all terms in the nine accidental\ncategories, except for some abstract terms in the category quality,\naccording to Ockham) we do not need to assume the existence of some\nmysterious relational entities informing singular substances. For\nexample, the term ‘father’ need not be construed as\nsignifying in me an inherent relation, my fatherhood, somehow\nconnecting me to my son, and suppositing for me on that account in the\ncontext of a proposition; rather, it should merely be construed as\nsignifying me in relation to my son, thereby suppositing for me in the\ncontext of a proposition, while connoting my son.\n",
    "section_title": "9. Universals in the Via Moderna",
    "entry_title": "The Medieval Problem of Universals",
    "hierarchy_title": "The Medieval Problem of Universals || Universals in the Via Moderna",
    "tokenized_text": [
        "universal",
        "via",
        "moderna",
        "universal",
        "via",
        "moderna",
        "sure",
        "debate",
        "within",
        "via",
        "antiqua",
        "framework",
        "concerning",
        "identity",
        "nonidentity",
        "various",
        "item",
        "distinguished",
        "framework",
        "indicate",
        "ockham",
        "charge",
        "quite",
        "justified",
        "several",
        "via",
        "antiqua",
        "author",
        "allow",
        "identification",
        "significata",
        "term",
        "belonging",
        "various",
        "category",
        "multiplication",
        "being",
        "necessarily",
        "match",
        "multiplicity",
        "term",
        "furthermore",
        "since",
        "via",
        "antiqua",
        "author",
        "also",
        "distinguished",
        "various",
        "mode",
        "sens",
        "allowing",
        "various",
        "sort",
        "diminished",
        "kind",
        "being",
        "reason",
        "ontological",
        "commitment",
        "certainly",
        "unambiguous",
        "ockham",
        "would",
        "u",
        "believe",
        "passage",
        "however",
        "contrast",
        "diagram",
        "via",
        "antiqua",
        "framework",
        "following",
        "schematic",
        "representation",
        "via",
        "moderna",
        "framework",
        "introduced",
        "ockham",
        "immediately",
        "appreciate",
        "point",
        "ockham",
        "innovation",
        "figure",
        "via",
        "moderna",
        "conception",
        "without",
        "doubt",
        "captivating",
        "simplicity",
        "picture",
        "especially",
        "compared",
        "complexity",
        "via",
        "antiqua",
        "picture",
        "major",
        "appeal",
        "ockhamist",
        "approach",
        "fewer",
        "item",
        "equally",
        "ontological",
        "footing",
        "distinguished",
        "one",
        "another",
        "term",
        "unambiguous",
        "distinction",
        "numerical",
        "distinction",
        "individual",
        "real",
        "entity",
        "sure",
        "still",
        "universal",
        "picture",
        "universal",
        "neither",
        "common",
        "nature",
        "contracted",
        "individual",
        "really",
        "merely",
        "formally",
        "distinct",
        "principle",
        "individuation",
        "universal",
        "object",
        "mind",
        "exist",
        "diminished",
        "manner",
        "being",
        "reason",
        "ockham",
        "universal",
        "least",
        "mature",
        "theory",
        "common",
        "term",
        "common",
        "concept",
        "common",
        "term",
        "singular",
        "utterance",
        "inscription",
        "common",
        "virtue",
        "subordinated",
        "common",
        "concept",
        "common",
        "concept",
        "hand",
        "singular",
        "act",
        "singular",
        "mind",
        "universality",
        "consists",
        "simply",
        "universality",
        "representative",
        "function",
        "example",
        "common",
        "term",
        "man",
        "spoken",
        "written",
        "universal",
        "term",
        "english",
        "subordinated",
        "concept",
        "mind",
        "conceive",
        "man",
        "indifferently",
        "see",
        "klima",
        "indifference",
        "representative",
        "function",
        "enables",
        "singular",
        "act",
        "mind",
        "conceive",
        "man",
        "universal",
        "manner",
        "go",
        "singular",
        "act",
        "mind",
        "accordingly",
        "need",
        "assume",
        "anything",
        "individual",
        "human",
        "distinct",
        "human",
        "common",
        "yet",
        "individualized",
        "nature",
        "waiting",
        "abstracted",
        "mind",
        "need",
        "assume",
        "two",
        "human",
        "similar",
        "either",
        "brute",
        "animal",
        "animal",
        "similar",
        "plant",
        "etc",
        "mind",
        "able",
        "recognize",
        "similarity",
        "able",
        "represent",
        "human",
        "mean",
        "common",
        "specific",
        "concept",
        "animal",
        "mean",
        "common",
        "generic",
        "concept",
        "living",
        "thing",
        "mean",
        "general",
        "generic",
        "concept",
        "etc",
        "way",
        "common",
        "term",
        "subordinated",
        "concept",
        "need",
        "signify",
        "abstract",
        "common",
        "nature",
        "mind",
        "consequently",
        "individualized",
        "instance",
        "singular",
        "directly",
        "signify",
        "singular",
        "directly",
        "conceived",
        "universally",
        "representative",
        "act",
        "mind",
        "common",
        "term",
        "signify",
        "singular",
        "also",
        "thing",
        "referred",
        "term",
        "used",
        "proposition",
        "using",
        "customary",
        "rendering",
        "medieval",
        "logical",
        "terminology",
        "thing",
        "ultimately",
        "signified",
        "common",
        "term",
        "significata",
        "thing",
        "referred",
        "term",
        "used",
        "proposition",
        "personal",
        "supposita",
        "compare",
        "two",
        "diagram",
        "representing",
        "respective",
        "conception",
        "two",
        "viae",
        "see",
        "radically",
        "ockham",
        "innovation",
        "changed",
        "character",
        "semantic",
        "relation",
        "connecting",
        "term",
        "concept",
        "thing",
        "viae",
        "common",
        "term",
        "subordinated",
        "common",
        "concept",
        "virtue",
        "subordination",
        "ultimately",
        "signify",
        "concept",
        "represent",
        "via",
        "moderna",
        "concept",
        "act",
        "mind",
        "representing",
        "singular",
        "le",
        "indifferent",
        "manner",
        "yielding",
        "le",
        "universal",
        "signification",
        "term",
        "via",
        "antiqua",
        "however",
        "act",
        "mind",
        "one",
        "item",
        "whole",
        "series",
        "intermediary",
        "representation",
        "distinguished",
        "term",
        "different",
        "function",
        "processing",
        "universal",
        "information",
        "connected",
        "common",
        "content",
        "ultimately",
        "representing",
        "common",
        "yet",
        "individualized",
        "nature",
        "singular",
        "accordingly",
        "common",
        "term",
        "expressing",
        "common",
        "content",
        "primarily",
        "subordinated",
        "objective",
        "concept",
        "mind",
        "course",
        "objective",
        "concept",
        "common",
        "content",
        "singular",
        "representative",
        "act",
        "singular",
        "mind",
        "subjective",
        "concept",
        "formed",
        "mean",
        "intelligible",
        "specie",
        "abstracted",
        "active",
        "intellect",
        "hand",
        "objective",
        "concept",
        "abstracting",
        "individuating",
        "condition",
        "express",
        "common",
        "singular",
        "namely",
        "nature",
        "considered",
        "absolutely",
        "absolutely",
        "considered",
        "nature",
        "common",
        "content",
        "informs",
        "singular",
        "nature",
        "actual",
        "real",
        "existence",
        "term",
        "ultimate",
        "significata",
        "individualized",
        "nature",
        "singular",
        "ultimate",
        "significata",
        "may",
        "still",
        "singular",
        "namely",
        "thing",
        "informed",
        "significata",
        "metaphysically",
        "simple",
        "via",
        "moderna",
        "conception",
        "therefore",
        "ultimate",
        "significata",
        "term",
        "nothing",
        "singular",
        "thing",
        "term",
        "supposita",
        "various",
        "proposition",
        "matter",
        "semantics",
        "contrast",
        "via",
        "antiqua",
        "conception",
        "term",
        "ultimate",
        "significata",
        "may",
        "may",
        "thing",
        "term",
        "personal",
        "supposita",
        "depending",
        "constitution",
        "supposita",
        "matter",
        "metaphysics",
        "singular",
        "supposita",
        "term",
        "used",
        "subject",
        "term",
        "proposition",
        "something",
        "predicated",
        "thing",
        "informed",
        "ultimate",
        "significata",
        "case",
        "metaphysically",
        "simple",
        "entity",
        "term",
        "significata",
        "supposita",
        "coincide",
        "nevertheless",
        "despite",
        "nominalist",
        "charge",
        "contrary",
        "via",
        "antiqua",
        "framework",
        "far",
        "semantic",
        "consideration",
        "concerned",
        "committed",
        "real",
        "distinction",
        "significata",
        "supposita",
        "common",
        "term",
        "via",
        "moderna",
        "framework",
        "semantic",
        "theory",
        "precluded",
        "identification",
        "semantic",
        "value",
        "question",
        "possible",
        "identity",
        "value",
        "could",
        "meaningfully",
        "raised",
        "first",
        "place",
        "furthermore",
        "case",
        "identification",
        "would",
        "precluded",
        "meaningless",
        "even",
        "talking",
        "metaphysically",
        "simple",
        "entity",
        "angel",
        "god",
        "whereas",
        "metaphysical",
        "simplicity",
        "entity",
        "expressed",
        "precisely",
        "term",
        "identification",
        "also",
        "mundane",
        "case",
        "significata",
        "supposita",
        "concrete",
        "abstract",
        "universal",
        "term",
        "nine",
        "accidental",
        "category",
        "several",
        "via",
        "antiqua",
        "author",
        "argued",
        "identification",
        "semantic",
        "value",
        "within",
        "across",
        "category",
        "first",
        "aristotle",
        "authority",
        "claim",
        "action",
        "passion",
        "motion",
        "significata",
        "term",
        "two",
        "category",
        "could",
        "regarded",
        "really",
        "distinct",
        "entity",
        "several",
        "author",
        "also",
        "argued",
        "identification",
        "relation",
        "foundation",
        "say",
        "identity",
        "significata",
        "relative",
        "term",
        "significata",
        "term",
        "category",
        "quantity",
        "quality",
        "example",
        "conception",
        "equality",
        "height",
        "would",
        "height",
        "provided",
        "height",
        "distinct",
        "equalitything",
        "somehow",
        "attached",
        "height",
        "caused",
        "equal",
        "height",
        "contrast",
        "make",
        "via",
        "moderna",
        "approach",
        "simpler",
        "automatically",
        "achieves",
        "identification",
        "already",
        "basis",
        "semantic",
        "principle",
        "since",
        "approach",
        "significata",
        "concrete",
        "common",
        "term",
        "singular",
        "directly",
        "represented",
        "corresponding",
        "concept",
        "significata",
        "personal",
        "supposita",
        "term",
        "taken",
        "singular",
        "beginning",
        "common",
        "term",
        "signify",
        "supposit",
        "thing",
        "either",
        "absolutely",
        "provided",
        "term",
        "absolute",
        "relation",
        "singular",
        "provided",
        "term",
        "connotative",
        "even",
        "case",
        "connotative",
        "term",
        "relative",
        "term",
        "fact",
        "term",
        "nine",
        "accidental",
        "category",
        "except",
        "abstract",
        "term",
        "category",
        "quality",
        "according",
        "ockham",
        "need",
        "assume",
        "existence",
        "mysterious",
        "relational",
        "entity",
        "informing",
        "singular",
        "substance",
        "example",
        "term",
        "father",
        "need",
        "construed",
        "signifying",
        "inherent",
        "relation",
        "fatherhood",
        "somehow",
        "connecting",
        "son",
        "suppositing",
        "account",
        "context",
        "proposition",
        "rather",
        "merely",
        "construed",
        "signifying",
        "relation",
        "son",
        "thereby",
        "suppositing",
        "context",
        "proposition",
        "connoting",
        "son"
    ]
}