{
    "main_text": "The Classical Approach || Jeremy Bentham\n2.1 Jeremy Bentham\n\n\nJeremy Bentham (1748–1832) was influenced both by Hobbes'\naccount of human nature and Hume's account of social\nutility. He famously held that humans were ruled by two sovereign\nmasters — pleasure and pain. We seek pleasure and the avoidance\nof pain, they “…govern us in all we do, in all we say, in\nall we think…” (Bentham PML, 1). Yet he also promulgated the\nprinciple of utility as the standard of right action on the part of\ngovernments and individuals. Actions are approved when they\nare such as to promote happiness, or pleasure, and disapproved of when\nthey have a tendency to cause unhappiness, or pain (PML). Combine\nthis criterion of rightness with a view that we should be actively\ntrying to promote overall happiness, and one has a serious\nincompatibility with psychological egoism. Thus, his apparent\nendorsement of Hobbesian psychological egoism created problems in\nunderstanding his moral theory since psychological egoism rules out\nacting to promote the overall well-being when that it is incompatible\nwith one's own. For the psychological egoist, that is not\neven a possibility. So, given ‘ought implies can’ it\nwould follow that we are not obligated to act to promote overall\nwell-being when that is incompatible with our own. This generates\na serious tension in Bentham's thought, one that was drawn to his\nattention. He sometimes seemed to think that he could reconcile\nthe two commitments empirically, that is, by noting that when people\nact to promote the good they are helping themselves, too. But\nthis claim only serves to muddy the waters, since the standard\nunderstanding of psychological egoism  —  and Bentham's own\nstatement of his view  —  identifies motives of action which are\nself-interested. Yet this seems, again, in conflict with his own\nspecification of the method for making moral decisions which is not to\nfocus on self-interest  —  indeed, the addition of extent as a\nparameter along which to measure pleasure produced distinguishes this\napproach from ethical egoism. Aware of the difficulty, in later\nyears he seemed to pull back from a full-fledged commitment to\npsychological egoism, admitting that people do sometimes act\nbenevolently — with the overall good of humanity in mind.\n\n\nBentham also benefited from Hume's work, though in many ways\ntheir approaches to moral philosophy were completely different.  Hume\nrejected the egoistic view of human nature. Hume also focused on\ncharacter evaluation in his system. Actions are significant as\nevidence of character, but only have this derivative significance. In\nmoral evaluation the main concern is that of character. Yet Bentham\nfocused on act-evaluation. There was a tendency — remarked on by\nJ. B. Schneewind (1990), for example — to move away from focus on\ncharacter evaluation after Hume and towards act-evaluation. Recall\nthat Bentham was enormously interested in social reform. Indeed,\nreflection on what was morally problematic about laws and policies\ninfluenced his thinking on utility as a standard. When one legislates,\nhowever, one is legislating in support of, or against, certain\nactions. Character — that is, a person's true\ncharacter — is known, if known at all, only by that person. If one\nfinds the opacity of the will thesis plausible then character, while\ntheoretically very interesting, isn't a practical focus for\nlegislation.  Further, as Schneewind notes, there was an increasing\nsense that focus on character would actually be disruptive, socially,\nparticularly if one's view was that a person who didn't\nagree with one on a moral issues was defective in terms of his or her\ncharacter, as opposed to simply making a mistake reflected in\naction.\n\n\nBut Bentham does take from Hume the view that utility is the measure\nof virtue — that is, utility more broadly construed than\nHume's actual usage of the term. This is because Hume made\na distinction between pleasure that the perception of virtue generates\nin the observer, and social utility, which consisted in a trait's\nhaving tangible benefits for society, any instance of which may or may\nnot generate pleasure in the observer. But Bentham is not simply\nreformulating a Humean position — he's merely been\ninfluenced by Hume's arguments to see pleasure as a measure or\nstandard of moral value. So, why not move from pleasurable\nresponses to traits to pleasure as a kind of\nconsequence which is good, and in relation to which, actions\nare morally right or wrong? Bentham, in making this move, avoids a\nproblem for Hume. On Hume's view it seems that the\nresponse — corrected, to be sure —  determines the trait's\nquality as a virtue or vice. But on Bentham's view the action\n(or trait) is morally good, right, virtuous in view of the\nconsequences it generates, the pleasure or utility it produces, which\ncould be completely independent of what our responses are to the\ntrait. So, unless Hume endorses a kind of ideal observer test for\nvirtue, it will be harder for him to account for how it is people make\nmistakes in evaluations of virtue and vice. Bentham, on the other\nhand, can say that people may not respond to the actions good\nqualities — perhaps they don't perceive the good\neffects. But as long as there are these good effects which are, on\nbalance, better than the effects of any alternative course of action,\nthen the action is the right one. Rhetorically, anyway, one can see\nwhy this is an important move for Bentham to be able to make. He was a\nsocial reformer. He felt that people often had responses to certain\nactions — of pleasure or disgust  —  that did not reflect anything\nmorally significant at all. Indeed, in his discussions of\nhomosexuality, for example, he explicitly notes that\n‘antipathy’ is not sufficient reason to legislate against\na practice:\n\n\nThe circumstances from which this antipathy may have taken its rise\nmay be worth enquiring to…. One is the physical antipathy to\nthe offence…. The act is to the highest degree odious and\ndisgusting, that is, not to the man who does it, for he does it only\nbecause it gives him pleasure, but to one who thinks [?]  of it. Be it\nso, but what is that to him? (Bentham OAO, v. 4, 94)\n\n\nBentham then notes that people are prone to use their physical\nantipathy as a pretext to transition to moral antipathy, and the\nattending desire to punish the persons who offend their taste.\nThis is illegitimate on his view for a variety of reasons, one of which\nis that to punish a person for violations of taste, or on the basis of\nprejudice, would result in runaway punishments, “…one\nshould never know where to stop…” The prejudice in\nquestion can be dealt with by showing it “to be\nill-grounded”. This reduces the antipathy to the act in\nquestion. This demonstrates an optimism in Bentham. If a\npain can be demonstrated to be based on false beliefs then he believes\nthat it can be altered or at the very least ‘assuaged and\nreduced’. This is distinct from the view that a pain or\npleasure based on a false belief should be discounted. Bentham\ndoes not believe the latter. Thus Bentham's hedonism is a\nvery straightforward hedonism. The one intrinsic good is\npleasure, the bad is pain. We are to promote pleasure and act to\nreduce pain. When called upon to make a moral decision one\nmeasures an action's value with respect to pleasure and pain\naccording to the following: intensity (how strong the pleasure or pain\nis), duration (how long it lasts), certainty (how likely the pleasure\nor pain is to be the result of the action), proximity (how close the\nsensation will be to performance of the action), fecundity (how likely\nit is to lead to further pleasures or pains), purity (how much\nintermixture there is with the other sensation). One also\nconsiders extent — the number of people affected by the\naction.\n\n\nKeeping track of all of these parameters can be complicated and time\nconsuming. Bentham does not recommend that they figure into every\nact of moral deliberation because of the efficiency costs which need to\nbe considered. Experience can guide us. We know that the\npleasure of kicking someone is generally outweighed by the pain\ninflicted on that person, so such calculations when confronted with a\ntemptation to kick someone are unnecessary. It is reasonable to\njudge it wrong on the basis of past experience or consensus. One\ncan use ‘rules of thumb’ to guide action, but these rules\nare overridable when abiding by them would conflict with the promotion\nof the good.\n\n\nBentham's view was surprising to many at the time at least in part\nbecause he viewed the moral quality of an action to be determined\ninstrumentally. It isn't so much that there is a particular kind of\naction that is intrinsically wrong; actions that are wrong are wrong\nsimply in virtue of their effects, thus, instrumentally wrong. This\ncut against the view that there are some actions that by their very\nnature are just wrong, regardless of their effects.  Some may be wrong\nbecause they are ‘unnatural’ — and, again, Bentham\nwould dismiss this as a legitimate criterion. Some may be wrong\nbecause they violate liberty, or autonomy. Again, Bentham would view\nliberty and autonomy as good — but good instrumentally, not\nintrinsically. Thus, any action deemed wrong due to a violation of\nautonomy is derivatively wrong on instrumental grounds as well. This\nis interesting in moral philosophy — as it is far removed from\nthe Kantian approach to moral evaluation as well as from natural law\napproaches. It is also interesting in terms of political philosophy\nand social policy. On Bentham's view the law is not monolithic and\nimmutable.  Since effects of a given policy may change, the moral\nquality of the policy may change as well. Nancy Rosenblum noted that\nfor Bentham one doesn't simply decide on good laws and leave it at\nthat: “Lawmaking must be recognized as a continual process in\nresponse to diverse and changing desires that require\nadjustment” (Rosenblum 1978, 9). A law that is good at one point\nin time may be a bad law at some other point in time. Thus, lawmakers\nhave to be sensitive to changing social circumstances.  To be fair to\nBentham's critics, of course, they are free to agree with him that\nthis is the case in many situations, just not all — and that\nthere is still a subset of laws that reflect the fact that some\nactions just are intrinsically wrong regardless of\nconsequences. Bentham is in the much more difficult position of\narguing that effects are all there are to moral evaluation of action\nand policy.\n",
    "section_title": "2.1 Jeremy Bentham",
    "entry_title": "The History of Utilitarianism",
    "hierarchy_title": "The History of Utilitarianism || The Classical Approach || Jeremy Bentham",
    "tokenized_text": [
        "classical",
        "approach",
        "jeremy",
        "bentham",
        "jeremy",
        "bentham",
        "jeremy",
        "bentham",
        "influenced",
        "hobbes",
        "account",
        "human",
        "nature",
        "hume",
        "s",
        "account",
        "social",
        "utility",
        "famously",
        "held",
        "human",
        "ruled",
        "two",
        "sovereign",
        "master",
        "pleasure",
        "pain",
        "seek",
        "pleasure",
        "avoidance",
        "pain",
        "govern",
        "u",
        "say",
        "think",
        "bentham",
        "pml",
        "yet",
        "also",
        "promulgated",
        "principle",
        "utility",
        "standard",
        "right",
        "action",
        "part",
        "government",
        "individual",
        "action",
        "approved",
        "promote",
        "happiness",
        "pleasure",
        "disapproved",
        "tendency",
        "cause",
        "unhappiness",
        "pain",
        "pml",
        "combine",
        "criterion",
        "rightness",
        "view",
        "actively",
        "trying",
        "promote",
        "overall",
        "happiness",
        "one",
        "serious",
        "incompatibility",
        "psychological",
        "egoism",
        "thus",
        "apparent",
        "endorsement",
        "hobbesian",
        "psychological",
        "egoism",
        "created",
        "problem",
        "understanding",
        "moral",
        "theory",
        "since",
        "psychological",
        "egoism",
        "rule",
        "acting",
        "promote",
        "overall",
        "wellbeing",
        "incompatible",
        "one",
        "s",
        "psychological",
        "egoist",
        "even",
        "possibility",
        "given",
        "ought",
        "implies",
        "would",
        "follow",
        "obligated",
        "act",
        "promote",
        "overall",
        "wellbeing",
        "incompatible",
        "generates",
        "serious",
        "tension",
        "bentham",
        "s",
        "thought",
        "one",
        "drawn",
        "attention",
        "sometimes",
        "seemed",
        "think",
        "could",
        "reconcile",
        "two",
        "commitment",
        "empirically",
        "noting",
        "people",
        "act",
        "promote",
        "good",
        "helping",
        "claim",
        "serf",
        "muddy",
        "water",
        "since",
        "standard",
        "understanding",
        "psychological",
        "egoism",
        "bentham",
        "s",
        "statement",
        "view",
        "identifies",
        "motif",
        "action",
        "selfinterested",
        "yet",
        "seems",
        "conflict",
        "specification",
        "method",
        "making",
        "moral",
        "decision",
        "focus",
        "selfinterest",
        "indeed",
        "addition",
        "extent",
        "parameter",
        "along",
        "measure",
        "pleasure",
        "produced",
        "distinguishes",
        "approach",
        "ethical",
        "egoism",
        "aware",
        "difficulty",
        "later",
        "year",
        "seemed",
        "pull",
        "back",
        "fullfledged",
        "commitment",
        "psychological",
        "egoism",
        "admitting",
        "people",
        "sometimes",
        "act",
        "benevolently",
        "overall",
        "good",
        "humanity",
        "mind",
        "bentham",
        "also",
        "benefited",
        "hume",
        "s",
        "work",
        "though",
        "many",
        "way",
        "approach",
        "moral",
        "philosophy",
        "completely",
        "different",
        "hume",
        "rejected",
        "egoistic",
        "view",
        "human",
        "nature",
        "hume",
        "also",
        "focused",
        "character",
        "evaluation",
        "system",
        "action",
        "significant",
        "evidence",
        "character",
        "derivative",
        "significance",
        "moral",
        "evaluation",
        "main",
        "concern",
        "character",
        "yet",
        "bentham",
        "focused",
        "actevaluation",
        "tendency",
        "remarked",
        "j",
        "b",
        "schneewind",
        "example",
        "move",
        "away",
        "focus",
        "character",
        "evaluation",
        "hume",
        "towards",
        "actevaluation",
        "recall",
        "bentham",
        "enormously",
        "interested",
        "social",
        "reform",
        "indeed",
        "reflection",
        "morally",
        "problematic",
        "law",
        "policy",
        "influenced",
        "thinking",
        "utility",
        "standard",
        "one",
        "legislates",
        "however",
        "one",
        "legislating",
        "support",
        "certain",
        "action",
        "character",
        "person",
        "s",
        "true",
        "character",
        "known",
        "known",
        "person",
        "one",
        "find",
        "opacity",
        "thesis",
        "plausible",
        "character",
        "theoretically",
        "interesting",
        "nt",
        "practical",
        "focus",
        "legislation",
        "schneewind",
        "note",
        "increasing",
        "sense",
        "focus",
        "character",
        "would",
        "actually",
        "disruptive",
        "socially",
        "particularly",
        "one",
        "s",
        "view",
        "person",
        "nt",
        "agree",
        "one",
        "moral",
        "issue",
        "defective",
        "term",
        "character",
        "opposed",
        "simply",
        "making",
        "mistake",
        "reflected",
        "action",
        "bentham",
        "take",
        "hume",
        "view",
        "utility",
        "measure",
        "virtue",
        "utility",
        "broadly",
        "construed",
        "hume",
        "s",
        "actual",
        "usage",
        "term",
        "hume",
        "made",
        "distinction",
        "pleasure",
        "perception",
        "virtue",
        "generates",
        "observer",
        "social",
        "utility",
        "consisted",
        "trait",
        "s",
        "tangible",
        "benefit",
        "society",
        "instance",
        "may",
        "may",
        "generate",
        "pleasure",
        "observer",
        "bentham",
        "simply",
        "reformulating",
        "humean",
        "position",
        "s",
        "merely",
        "influenced",
        "hume",
        "s",
        "argument",
        "see",
        "pleasure",
        "measure",
        "standard",
        "moral",
        "value",
        "move",
        "pleasurable",
        "response",
        "trait",
        "pleasure",
        "kind",
        "consequence",
        "good",
        "relation",
        "action",
        "morally",
        "right",
        "wrong",
        "bentham",
        "making",
        "move",
        "avoids",
        "problem",
        "hume",
        "hume",
        "s",
        "view",
        "seems",
        "response",
        "corrected",
        "sure",
        "determines",
        "trait",
        "s",
        "quality",
        "virtue",
        "vice",
        "bentham",
        "s",
        "view",
        "action",
        "trait",
        "morally",
        "good",
        "right",
        "virtuous",
        "view",
        "consequence",
        "generates",
        "pleasure",
        "utility",
        "produce",
        "could",
        "completely",
        "independent",
        "response",
        "trait",
        "unless",
        "hume",
        "endorses",
        "kind",
        "ideal",
        "observer",
        "test",
        "virtue",
        "harder",
        "account",
        "people",
        "make",
        "mistake",
        "evaluation",
        "virtue",
        "vice",
        "bentham",
        "hand",
        "say",
        "people",
        "may",
        "respond",
        "action",
        "good",
        "quality",
        "perhaps",
        "nt",
        "perceive",
        "good",
        "effect",
        "long",
        "good",
        "effect",
        "balance",
        "better",
        "effect",
        "alternative",
        "course",
        "action",
        "action",
        "right",
        "one",
        "rhetorically",
        "anyway",
        "one",
        "see",
        "important",
        "move",
        "bentham",
        "able",
        "make",
        "social",
        "reformer",
        "felt",
        "people",
        "often",
        "response",
        "certain",
        "action",
        "pleasure",
        "disgust",
        "reflect",
        "anything",
        "morally",
        "significant",
        "indeed",
        "discussion",
        "homosexuality",
        "example",
        "explicitly",
        "note",
        "antipathy",
        "sufficient",
        "reason",
        "legislate",
        "practice",
        "circumstance",
        "antipathy",
        "may",
        "taken",
        "rise",
        "may",
        "worth",
        "enquiring",
        "to",
        "one",
        "physical",
        "antipathy",
        "offence",
        "act",
        "highest",
        "degree",
        "odious",
        "disgusting",
        "man",
        "give",
        "pleasure",
        "one",
        "think",
        "bentham",
        "oao",
        "v",
        "bentham",
        "note",
        "people",
        "prone",
        "use",
        "physical",
        "antipathy",
        "pretext",
        "transition",
        "moral",
        "antipathy",
        "attending",
        "desire",
        "punish",
        "person",
        "offend",
        "taste",
        "illegitimate",
        "view",
        "variety",
        "reason",
        "one",
        "punish",
        "person",
        "violation",
        "taste",
        "basis",
        "prejudice",
        "would",
        "result",
        "runaway",
        "punishment",
        "one",
        "never",
        "know",
        "stop",
        "prejudice",
        "question",
        "dealt",
        "showing",
        "illgrounded",
        "reduces",
        "antipathy",
        "act",
        "question",
        "demonstrates",
        "optimism",
        "bentham",
        "pain",
        "demonstrated",
        "based",
        "false",
        "belief",
        "belief",
        "altered",
        "least",
        "assuaged",
        "reduced",
        "distinct",
        "view",
        "pain",
        "pleasure",
        "based",
        "false",
        "belief",
        "discounted",
        "bentham",
        "believe",
        "latter",
        "thus",
        "bentham",
        "s",
        "hedonism",
        "straightforward",
        "hedonism",
        "one",
        "intrinsic",
        "good",
        "pleasure",
        "bad",
        "pain",
        "promote",
        "pleasure",
        "act",
        "reduce",
        "pain",
        "called",
        "upon",
        "make",
        "moral",
        "decision",
        "one",
        "measure",
        "action",
        "s",
        "value",
        "respect",
        "pleasure",
        "pain",
        "according",
        "following",
        "intensity",
        "strong",
        "pleasure",
        "pain",
        "duration",
        "long",
        "last",
        "certainty",
        "likely",
        "pleasure",
        "pain",
        "result",
        "action",
        "proximity",
        "close",
        "sensation",
        "performance",
        "action",
        "fecundity",
        "likely",
        "lead",
        "pleasure",
        "pain",
        "purity",
        "much",
        "intermixture",
        "sensation",
        "one",
        "also",
        "considers",
        "extent",
        "number",
        "people",
        "affected",
        "action",
        "keeping",
        "track",
        "parameter",
        "complicated",
        "time",
        "consuming",
        "bentham",
        "recommend",
        "figure",
        "every",
        "act",
        "moral",
        "deliberation",
        "efficiency",
        "cost",
        "need",
        "considered",
        "experience",
        "guide",
        "u",
        "know",
        "pleasure",
        "kicking",
        "someone",
        "generally",
        "outweighed",
        "pain",
        "inflicted",
        "person",
        "calculation",
        "confronted",
        "temptation",
        "kick",
        "someone",
        "unnecessary",
        "reasonable",
        "judge",
        "wrong",
        "basis",
        "past",
        "experience",
        "consensus",
        "one",
        "use",
        "rule",
        "thumb",
        "guide",
        "action",
        "rule",
        "overridable",
        "abiding",
        "would",
        "conflict",
        "promotion",
        "good",
        "bentham",
        "s",
        "view",
        "surprising",
        "many",
        "time",
        "least",
        "part",
        "viewed",
        "moral",
        "quality",
        "action",
        "determined",
        "instrumentally",
        "nt",
        "much",
        "particular",
        "kind",
        "action",
        "intrinsically",
        "wrong",
        "action",
        "wrong",
        "wrong",
        "simply",
        "virtue",
        "effect",
        "thus",
        "instrumentally",
        "wrong",
        "cut",
        "view",
        "action",
        "nature",
        "wrong",
        "regardless",
        "effect",
        "may",
        "wrong",
        "unnatural",
        "bentham",
        "would",
        "dismiss",
        "legitimate",
        "criterion",
        "may",
        "wrong",
        "violate",
        "liberty",
        "autonomy",
        "bentham",
        "would",
        "view",
        "liberty",
        "autonomy",
        "good",
        "good",
        "instrumentally",
        "intrinsically",
        "thus",
        "action",
        "deemed",
        "wrong",
        "due",
        "violation",
        "autonomy",
        "derivatively",
        "wrong",
        "instrumental",
        "ground",
        "well",
        "interesting",
        "moral",
        "philosophy",
        "far",
        "removed",
        "kantian",
        "approach",
        "moral",
        "evaluation",
        "well",
        "natural",
        "law",
        "approach",
        "also",
        "interesting",
        "term",
        "political",
        "philosophy",
        "social",
        "policy",
        "bentham",
        "s",
        "view",
        "law",
        "monolithic",
        "immutable",
        "since",
        "effect",
        "given",
        "policy",
        "may",
        "change",
        "moral",
        "quality",
        "policy",
        "may",
        "change",
        "well",
        "nancy",
        "rosenblum",
        "noted",
        "bentham",
        "one",
        "nt",
        "simply",
        "decide",
        "good",
        "law",
        "leave",
        "lawmaking",
        "must",
        "recognized",
        "continual",
        "process",
        "response",
        "diverse",
        "changing",
        "desire",
        "require",
        "adjustment",
        "rosenblum",
        "law",
        "good",
        "one",
        "point",
        "time",
        "may",
        "bad",
        "law",
        "point",
        "time",
        "thus",
        "lawmaker",
        "sensitive",
        "changing",
        "social",
        "circumstance",
        "fair",
        "bentham",
        "s",
        "critic",
        "course",
        "free",
        "agree",
        "case",
        "many",
        "situation",
        "still",
        "subset",
        "law",
        "reflect",
        "fact",
        "action",
        "intrinsically",
        "wrong",
        "regardless",
        "consequence",
        "bentham",
        "much",
        "difficult",
        "position",
        "arguing",
        "effect",
        "moral",
        "evaluation",
        "action",
        "policy"
    ]
}