{
    "main_text": "Precursors to the Classical Approach\n1. Precursors to the Classical Approach\n\n\nThough the first systematic account of utilitarianism was developed\nby Jeremy Bentham (1748–1832), the core insight motivating the theory\noccurred much earlier. That insight is that morally appropriate\nbehavior will not harm others, but instead increase happiness or\n‘utility.’ What is distinctive about utilitarianism\nis its approach in taking that insight and developing an account of\nmoral evaluation and moral direction that expands on it. Early\nprecursors to the Classical Utilitarians include the British Moralists,\nCumberland, Shaftesbury, Hutcheson, Gay, and Hume. Of these,\nFrancis Hutcheson (1694–1746) is explicitly utilitarian when it comes\nto action choice.\n\n\nSome of the earliest utilitarian thinkers were the\n‘theological’ utilitarians such as Richard Cumberland\n(1631–1718) and John Gay (1699–1745). They believed that\npromoting human happiness was incumbent on us since it was approved by\nGod. After enumerating the ways in which humans come under\nobligations (by perceiving the “natural consequences of\nthings”, the obligation to be virtuous, our civil obligations\nthat arise from laws, and obligations arising from “the authority\nof God”) John Gay writes: “…from the consideration\nof these four sorts of obligation…it is evident that a full and\ncomplete obligation which will extend to all cases, can only be that\narising from the authority of God; because God only can in all\ncases make a man happy or miserable: and therefore, since we are\nalways obliged to that conformity called virtue, it is evident\nthat the immediate rule or criterion of it is the will of God”\n(R, 412). Gay held that since God wants the happiness of mankind,\nand since God's will gives us the criterion of virtue,\n“…the happiness of mankind may be said to be the criterion\nof virtue, but once removed” (R, 413). This view\nwas combined with a view of human motivation with egoistic\nelements. A person's individual salvation, her eternal\nhappiness, depended on conformity to God's will, as did virtue\nitself. Promoting human happiness and one's own coincided,\nbut, given God's design, it was not an accidental\ncoincidence.\n\n\nThis approach to utilitarianism, however, is not theoretically clean\nin the sense that it isn't clear what essential work God does, at\nleast in terms of normative ethics. God as the source of\nnormativity is compatible with utilitarianism, but utilitarianism\ndoesn't require this.\n\n\nGay's influence on later writers, such as Hume, deserves\nnote. It is in Gay's essay that some of the\nquestions that concerned Hume on the nature of virtue are\naddressed. For example, Gay was curious about how to explain our\npractice of approbation and disapprobation of action and\ncharacter. When we see an act that is vicious we disapprove of\nit. Further, we associate certain things with their effects, so\nthat we form positive associations and negative associations that also\nunderwrite our moral judgments. Of course, that we view happiness,\nincluding the happiness of others as a good, is due to God's\ndesign. This is a feature crucial to the theological approach,\nwhich would clearly be rejected by Hume in favor of a naturalistic view\nof human nature and a reliance on our sympathetic engagement with\nothers, an approach anticipated by Shaftesbury (below). The\ntheological approach to utilitarianism would be developed later by\nWilliam Paley, for example, but the lack of any theoretical necessity\nin appealing to God would result in its diminishing appeal.\n\n\nAnthony Ashley Cooper, the 3rd Earl of Shaftesbury\n(1671–1713) is generally thought to have been the one of the earliest\n‘moral sense’ theorists, holding that we possess a kind\nof “inner eye” that allows us to make moral\ndiscriminations. This seems to have been an innate sense of right\nand wrong, or moral beauty and deformity. Again, aspects of this\ndoctrine would be picked up by Francis Hutcheson and David Hume\n(1711–1776). Hume, of course, would clearly reject any robust\nrealist implications. If the moral sense is like the other\nperceptual senses and enables us to pick up on properties out there in\nthe universe around us, properties that exist independent from our\nperception of them, that are objective, then Hume clearly was not a\nmoral sense theorist in this regard. But perception picks up on\nfeatures of our environment that one could regard as having a\ncontingent quality. There is one famous passage where Hume likens moral\ndiscrimination to the perception of secondary qualities, such as\ncolor. In modern terminology, these are response-dependent\nproperties, and lack objectivity in the sense that they do not exist\nindependent of our responses. This is radical. If an\nact is vicious, its viciousness is a matter of the human\nresponse (given a corrected perspective) to the act (or its perceived\neffects) and thus has a kind of contingency that seems unsettling,\ncertainly unsettling to those who opted for the theological option.\n\n\nSo, the view that it is part of our very nature to make moral\ndiscriminations is very much in Hume. Further — and what is\nrelevant to the development of utilitarianism — the view of\nShaftesbury that the virtuous person contributes to the good of the\nwhole — would figure into Hume's writings, though\nmodified. It is the virtue that contributes to the good of the\nwhole system, in the case of Hume's artificial virtues.\n\n\nShaftesbury held that in judging someone virtuous or good in a moral\nsense we need to perceive that person's impact on the systems of\nwhich he or she is a part. Here it sometimes becomes difficult to\ndisentangle egoistic versus utilitarian lines of thought in\nShaftesbury. He clearly states that whatever guiding force there is has\nmade nature such that it is “…the private\ninterest and good of every one, to work towards the\ngeneral good, which if a creature ceases to promote, he is\nactually so far wanting to himself, and ceases to promote his own\nhappiness and welfare…” (R, 188). It is hard, sometimes,\nto discern the direction of the ‘because’ — if one\nshould act to help others because it supports a system in which\none's own happiness is more likely, then it looks really like a\nform of egoism. If one should help others because that's the\nright thing to do — and, fortunately, it also ends up promoting\none's own interests, then that's more like utilitarianism,\nsince the promotion of self-interest is a welcome effect but not what,\nall by itself, justifies one's character or actions.\n\n\nFurther, to be virtuous a person must have certain psychological\ncapacities  —  they must be able to reflect on character, for example,\nand represent to themselves the qualities in others that are either\napproved or disapproved of.\n\n…in this case alone it is we call any creature worthy or\nvirtuous when it can have the notion of a public interest, and can\nattain the speculation or science of what is morally good or ill,\nadmirable or blameable, right or wrong….we never say\nof….any mere beast, idiot, or changeling, though ever so\ngood-natured, that he is worthy or virtuous. (Shaftesbury IVM; BKI,\nPII, sec. iii)\n\n\n\nThus, animals are not objects of moral appraisal on the view, since\nthey lack the necessary reflective capacities. Animals also lack\nthe capacity for moral discrimination and would therefore seem to lack\nthe moral sense. This raises some interesting questions. It\nwould seem that the moral sense is a perception that something\nis the case. So it isn't merely a discriminatory sense that\nallows us to sort perceptions. It also has a propositional\naspect, so that animals, which are not lacking in other senses are\nlacking in this one.\n\n\nThe virtuous person is one whose affections, motives, dispositions\nare of the right sort, not one whose behavior is simply of the right\nsort and who is able to reflect on goodness, and her own goodness [see\nGill]. Similarly, the vicious person is one who exemplifies the\nwrong sorts of mental states, affections, and so forth. A person\nwho harms others through no fault of his own “…because he\nhas convulsive fits which make him strike and wound such as approach\nhim” is not vicious since he has no desire to harm anyone and his\nbodily movements in this case are beyond his control.\n\n\nShaftesbury approached moral evaluation via the virtues and vices.\nHis utilitarian leanings are distinct from his moral sense approach,\nand his overall sentimentalism. However, this approach highlights the\nmove away from egoistic views of human nature — a trend picked\nup by Hutcheson and Hume, and later adopted by Mill in criticism of\nBentham's version of utilitarianism. For writers like Shaftesbury and\nHutcheson the main contrast was with egoism rather than\nrationalism.\n\n\nLike Shaftesbury, Francis Hutcheson was very much interested in\nvirtue evaluation. He also adopted the moral sense\napproach. However, in his writings we also see an emphasis\non action choice and the importance of moral deliberation to action\nchoice. Hutcheson, in An Inquiry Concerning Moral Good and\nEvil, fairly explicitly spelled out a utilitarian principle of\naction choice. (Joachim Hruschka (1991) notes, however, that it was\nLeibniz who first spelled out a utilitarian decision procedure.)\n\n\n….In comparing the moral qualities of actions…we are led\nby our moral sense of virtue to judge thus; that in equal\ndegrees of happiness, expected to proceed from the action, the\nvirtue is in proportion to the number of persons to whom the\nhappiness shall extend (and here the dignity, or moral\nimportance of persons, may compensate numbers); and, in\nequal numbers, the virtue is the quantity of the\nhappiness, or natural good; or that the virtue is in a compound ratio of the\nquantity of good, and number of enjoyers….so\nthat that action is best, which procures\nthe greatest happiness for the greatest numbers; and\nthat worst, which, in like manner, occasions\nmisery. (R, 283–4)\n\n\n\nScarre notes that some hold the moral sense approach incompatible\nwith this emphasis on the use of reason to determine what we ought to\ndo; there is an opposition between just apprehending what's\nmorally significant and a model in which we need to reason to figure\nout what morality demands of us. But Scarre notes these are not\nactually incompatible:\n\nThe picture which emerges from Hutcheson's discussion is of a\ndivision of labor, in which the moral sense causes us to look with\nfavor on actions which benefit others and disfavor those which harm\nthem, while consequentialist reasoning determines a more precise\nranking order of practical options in given situations. (Scarre,\n53–54)\n\n\nScarre then uses the example of telling a lie to illustrate: lying\nis harmful to the person to whom one lies, and so this is viewed with\ndisfavor, in general. However, in a specific case, if a lie is\nnecessary to achieve some notable good, consequentialist reasoning will\nlead us to favor the lying. But this example seems to\nput all the emphasis on a consideration of consequences in\nmoral approval and disapproval. Stephen Darwall notes (1995,\n216 ff.) that the moral sense is concerned\nwith motives — we approve, for example, of the motive of\nbenevolence, and the wider the scope the better. It is the motives\nrather than the consequences that are the objects of approval and\ndisapproval.  But inasmuch as the morally good person cares about what\nhappens to others, and of course she will, she will rank order acts in\nterms of their effects on others, and reason is used in calculating\neffects. So there is no incompatibility at all.\n\n\nHutcheson was committed to maximization, it seems. However, he\ninsisted on a caveat — that “the dignity or moral\nimportance of persons may compensate numbers.” He added\na deontological constraint — that we have a duty to others in\nvirtue of their personhood to accord them fundamental dignity\nregardless of the numbers of others whose happiness is to be affected\nby the action in question.\n\n\nHume was heavily influenced by Hutcheson, who was one of his\nteachers. His system also incorporates insights made by\nShaftesbury, though he certainly lacks Shaftesbury's confidence\nthat virtue is its own reward. In terms of his place in the\nhistory of utilitarianism we should note two distinct effects his\nsystem had. Firstly, his account of the social utility of the\nartificial virtues influenced Bentham's thought on utility.\nSecondly, his account of the role sentiment played in moral judgment\nand commitment to moral norms influenced Mill's thoughts about\nthe internal sanctions of morality. Mill would diverge from\nBentham in developing the ‘altruistic’ approach to\nUtilitarianism (which is actually a misnomer, but more on that\nlater). Bentham, in contrast to Mill, represented the egoistic\nbranch — his theory of human nature reflected Hobbesian\npsychological egoism.\n",
    "section_title": "1. Precursors to the Classical Approach",
    "entry_title": "The History of Utilitarianism",
    "hierarchy_title": "The History of Utilitarianism || Precursors to the Classical Approach",
    "tokenized_text": [
        "precursor",
        "classical",
        "approach",
        "precursor",
        "classical",
        "approach",
        "though",
        "first",
        "systematic",
        "account",
        "utilitarianism",
        "developed",
        "jeremy",
        "bentham",
        "core",
        "insight",
        "motivating",
        "theory",
        "occurred",
        "much",
        "earlier",
        "insight",
        "morally",
        "appropriate",
        "behavior",
        "harm",
        "others",
        "instead",
        "increase",
        "happiness",
        "utility",
        "distinctive",
        "utilitarianism",
        "approach",
        "taking",
        "insight",
        "developing",
        "account",
        "moral",
        "evaluation",
        "moral",
        "direction",
        "expands",
        "early",
        "precursor",
        "classical",
        "utilitarian",
        "include",
        "british",
        "moralist",
        "cumberland",
        "shaftesbury",
        "hutcheson",
        "gay",
        "hume",
        "francis",
        "hutcheson",
        "explicitly",
        "utilitarian",
        "come",
        "action",
        "choice",
        "earliest",
        "utilitarian",
        "thinker",
        "theological",
        "utilitarian",
        "richard",
        "cumberland",
        "john",
        "gay",
        "believed",
        "promoting",
        "human",
        "happiness",
        "incumbent",
        "u",
        "since",
        "approved",
        "god",
        "enumerating",
        "way",
        "human",
        "come",
        "obligation",
        "perceiving",
        "natural",
        "consequence",
        "thing",
        "obligation",
        "virtuous",
        "civil",
        "obligation",
        "arise",
        "law",
        "obligation",
        "arising",
        "authority",
        "god",
        "john",
        "gay",
        "writes",
        "from",
        "consideration",
        "four",
        "sort",
        "obligationit",
        "evident",
        "full",
        "complete",
        "obligation",
        "extend",
        "case",
        "arising",
        "authority",
        "god",
        "god",
        "case",
        "make",
        "man",
        "happy",
        "miserable",
        "therefore",
        "since",
        "always",
        "obliged",
        "conformity",
        "called",
        "virtue",
        "evident",
        "immediate",
        "rule",
        "criterion",
        "god",
        "r",
        "gay",
        "held",
        "since",
        "god",
        "want",
        "happiness",
        "mankind",
        "since",
        "god",
        "s",
        "give",
        "u",
        "criterion",
        "virtue",
        "the",
        "happiness",
        "mankind",
        "may",
        "said",
        "criterion",
        "virtue",
        "removed",
        "r",
        "view",
        "combined",
        "view",
        "human",
        "motivation",
        "egoistic",
        "element",
        "person",
        "s",
        "individual",
        "salvation",
        "eternal",
        "happiness",
        "depended",
        "conformity",
        "god",
        "s",
        "virtue",
        "promoting",
        "human",
        "happiness",
        "one",
        "s",
        "coincided",
        "given",
        "god",
        "s",
        "design",
        "accidental",
        "coincidence",
        "approach",
        "utilitarianism",
        "however",
        "theoretically",
        "clean",
        "sense",
        "nt",
        "clear",
        "essential",
        "work",
        "god",
        "least",
        "term",
        "normative",
        "ethic",
        "god",
        "source",
        "normativity",
        "compatible",
        "utilitarianism",
        "utilitarianism",
        "nt",
        "require",
        "gay",
        "s",
        "influence",
        "later",
        "writer",
        "hume",
        "deserves",
        "note",
        "gay",
        "s",
        "essay",
        "question",
        "concerned",
        "hume",
        "nature",
        "virtue",
        "addressed",
        "example",
        "gay",
        "curious",
        "explain",
        "practice",
        "approbation",
        "disapprobation",
        "action",
        "character",
        "see",
        "act",
        "vicious",
        "disapprove",
        "associate",
        "certain",
        "thing",
        "effect",
        "form",
        "positive",
        "association",
        "negative",
        "association",
        "also",
        "underwrite",
        "moral",
        "judgment",
        "course",
        "view",
        "happiness",
        "including",
        "happiness",
        "others",
        "good",
        "due",
        "god",
        "s",
        "design",
        "feature",
        "crucial",
        "theological",
        "approach",
        "would",
        "clearly",
        "rejected",
        "hume",
        "favor",
        "naturalistic",
        "view",
        "human",
        "nature",
        "reliance",
        "sympathetic",
        "engagement",
        "others",
        "approach",
        "anticipated",
        "shaftesbury",
        "theological",
        "approach",
        "utilitarianism",
        "would",
        "developed",
        "later",
        "william",
        "paley",
        "example",
        "lack",
        "theoretical",
        "necessity",
        "appealing",
        "god",
        "would",
        "result",
        "diminishing",
        "appeal",
        "anthony",
        "ashley",
        "cooper",
        "rd",
        "earl",
        "shaftesbury",
        "generally",
        "thought",
        "one",
        "earliest",
        "moral",
        "sense",
        "theorist",
        "holding",
        "posse",
        "kind",
        "inner",
        "eye",
        "allows",
        "u",
        "make",
        "moral",
        "discrimination",
        "seems",
        "innate",
        "sense",
        "right",
        "wrong",
        "moral",
        "beauty",
        "deformity",
        "aspect",
        "doctrine",
        "would",
        "picked",
        "francis",
        "hutcheson",
        "david",
        "hume",
        "hume",
        "course",
        "would",
        "clearly",
        "reject",
        "robust",
        "realist",
        "implication",
        "moral",
        "sense",
        "like",
        "perceptual",
        "sens",
        "enables",
        "u",
        "pick",
        "property",
        "universe",
        "around",
        "u",
        "property",
        "exist",
        "independent",
        "perception",
        "objective",
        "hume",
        "clearly",
        "moral",
        "sense",
        "theorist",
        "regard",
        "perception",
        "pick",
        "feature",
        "environment",
        "one",
        "could",
        "regard",
        "contingent",
        "quality",
        "one",
        "famous",
        "passage",
        "hume",
        "likens",
        "moral",
        "discrimination",
        "perception",
        "secondary",
        "quality",
        "color",
        "modern",
        "terminology",
        "responsedependent",
        "property",
        "lack",
        "objectivity",
        "sense",
        "exist",
        "independent",
        "response",
        "radical",
        "act",
        "vicious",
        "viciousness",
        "matter",
        "human",
        "response",
        "given",
        "corrected",
        "perspective",
        "act",
        "perceived",
        "effect",
        "thus",
        "kind",
        "contingency",
        "seems",
        "unsettling",
        "certainly",
        "unsettling",
        "opted",
        "theological",
        "option",
        "view",
        "part",
        "nature",
        "make",
        "moral",
        "discrimination",
        "much",
        "hume",
        "relevant",
        "development",
        "utilitarianism",
        "view",
        "shaftesbury",
        "virtuous",
        "person",
        "contributes",
        "good",
        "whole",
        "would",
        "figure",
        "hume",
        "s",
        "writing",
        "though",
        "modified",
        "virtue",
        "contributes",
        "good",
        "whole",
        "system",
        "case",
        "hume",
        "s",
        "artificial",
        "virtue",
        "shaftesbury",
        "held",
        "judging",
        "someone",
        "virtuous",
        "good",
        "moral",
        "sense",
        "need",
        "perceive",
        "person",
        "s",
        "impact",
        "system",
        "part",
        "sometimes",
        "becomes",
        "difficult",
        "disentangle",
        "egoistic",
        "versus",
        "utilitarian",
        "line",
        "thought",
        "shaftesbury",
        "clearly",
        "state",
        "whatever",
        "guiding",
        "force",
        "made",
        "nature",
        "the",
        "private",
        "interest",
        "good",
        "every",
        "one",
        "work",
        "towards",
        "general",
        "good",
        "creature",
        "cease",
        "promote",
        "actually",
        "far",
        "wanting",
        "cease",
        "promote",
        "happiness",
        "welfare",
        "r",
        "hard",
        "sometimes",
        "discern",
        "direction",
        "one",
        "act",
        "help",
        "others",
        "support",
        "system",
        "one",
        "s",
        "happiness",
        "likely",
        "look",
        "really",
        "like",
        "form",
        "egoism",
        "one",
        "help",
        "others",
        "s",
        "right",
        "thing",
        "fortunately",
        "also",
        "end",
        "promoting",
        "one",
        "s",
        "interest",
        "s",
        "like",
        "utilitarianism",
        "since",
        "promotion",
        "selfinterest",
        "welcome",
        "effect",
        "justifies",
        "one",
        "s",
        "character",
        "action",
        "virtuous",
        "person",
        "must",
        "certain",
        "psychological",
        "capacity",
        "must",
        "able",
        "reflect",
        "character",
        "example",
        "represent",
        "quality",
        "others",
        "either",
        "approved",
        "disapproved",
        "in",
        "case",
        "alone",
        "call",
        "creature",
        "worthy",
        "virtuous",
        "notion",
        "public",
        "interest",
        "attain",
        "speculation",
        "science",
        "morally",
        "good",
        "ill",
        "admirable",
        "blameable",
        "right",
        "wrongwe",
        "never",
        "say",
        "ofany",
        "mere",
        "beast",
        "idiot",
        "changeling",
        "though",
        "ever",
        "goodnatured",
        "worthy",
        "virtuous",
        "shaftesbury",
        "ivm",
        "bki",
        "pii",
        "sec",
        "iii",
        "thus",
        "animal",
        "object",
        "moral",
        "appraisal",
        "view",
        "since",
        "lack",
        "necessary",
        "reflective",
        "capacity",
        "animal",
        "also",
        "lack",
        "capacity",
        "moral",
        "discrimination",
        "would",
        "therefore",
        "seem",
        "lack",
        "moral",
        "sense",
        "raise",
        "interesting",
        "question",
        "would",
        "seem",
        "moral",
        "sense",
        "perception",
        "something",
        "case",
        "nt",
        "merely",
        "discriminatory",
        "sense",
        "allows",
        "u",
        "sort",
        "perception",
        "also",
        "propositional",
        "aspect",
        "animal",
        "lacking",
        "sens",
        "lacking",
        "one",
        "virtuous",
        "person",
        "one",
        "whose",
        "affection",
        "motif",
        "disposition",
        "right",
        "sort",
        "one",
        "whose",
        "behavior",
        "simply",
        "right",
        "sort",
        "able",
        "reflect",
        "goodness",
        "goodness",
        "see",
        "gill",
        "similarly",
        "vicious",
        "person",
        "one",
        "exemplifies",
        "wrong",
        "sort",
        "mental",
        "state",
        "affection",
        "forth",
        "person",
        "harm",
        "others",
        "fault",
        "because",
        "convulsive",
        "fit",
        "make",
        "strike",
        "wound",
        "approach",
        "vicious",
        "since",
        "desire",
        "harm",
        "anyone",
        "bodily",
        "movement",
        "case",
        "beyond",
        "control",
        "shaftesbury",
        "approached",
        "moral",
        "evaluation",
        "via",
        "virtue",
        "vice",
        "utilitarian",
        "leaning",
        "distinct",
        "moral",
        "sense",
        "approach",
        "overall",
        "sentimentalism",
        "however",
        "approach",
        "highlight",
        "move",
        "away",
        "egoistic",
        "view",
        "human",
        "nature",
        "trend",
        "picked",
        "hutcheson",
        "hume",
        "later",
        "adopted",
        "mill",
        "criticism",
        "bentham",
        "s",
        "version",
        "utilitarianism",
        "writer",
        "like",
        "shaftesbury",
        "hutcheson",
        "main",
        "contrast",
        "egoism",
        "rather",
        "rationalism",
        "like",
        "shaftesbury",
        "francis",
        "hutcheson",
        "much",
        "interested",
        "virtue",
        "evaluation",
        "also",
        "adopted",
        "moral",
        "sense",
        "approach",
        "however",
        "writing",
        "also",
        "see",
        "emphasis",
        "action",
        "choice",
        "importance",
        "moral",
        "deliberation",
        "action",
        "choice",
        "hutcheson",
        "inquiry",
        "concerning",
        "moral",
        "good",
        "evil",
        "fairly",
        "explicitly",
        "spelled",
        "utilitarian",
        "principle",
        "action",
        "choice",
        "joachim",
        "hruschka",
        "note",
        "however",
        "leibniz",
        "first",
        "spelled",
        "utilitarian",
        "decision",
        "procedure",
        "in",
        "comparing",
        "moral",
        "quality",
        "actionswe",
        "led",
        "moral",
        "sense",
        "virtue",
        "judge",
        "thus",
        "equal",
        "degree",
        "happiness",
        "expected",
        "proceed",
        "action",
        "virtue",
        "proportion",
        "number",
        "person",
        "happiness",
        "shall",
        "extend",
        "dignity",
        "moral",
        "importance",
        "person",
        "may",
        "compensate",
        "number",
        "equal",
        "number",
        "virtue",
        "quantity",
        "happiness",
        "natural",
        "good",
        "virtue",
        "compound",
        "ratio",
        "quantity",
        "good",
        "number",
        "enjoyersso",
        "action",
        "best",
        "procures",
        "greatest",
        "happiness",
        "greatest",
        "number",
        "worst",
        "like",
        "manner",
        "occasion",
        "misery",
        "r",
        "scarre",
        "note",
        "hold",
        "moral",
        "sense",
        "approach",
        "incompatible",
        "emphasis",
        "use",
        "reason",
        "determine",
        "ought",
        "opposition",
        "apprehending",
        "s",
        "morally",
        "significant",
        "model",
        "need",
        "reason",
        "figure",
        "morality",
        "demand",
        "u",
        "scarre",
        "note",
        "actually",
        "incompatible",
        "picture",
        "emerges",
        "hutcheson",
        "s",
        "discussion",
        "division",
        "labor",
        "moral",
        "sense",
        "cause",
        "u",
        "look",
        "favor",
        "action",
        "benefit",
        "others",
        "disfavor",
        "harm",
        "consequentialist",
        "reasoning",
        "determines",
        "precise",
        "ranking",
        "order",
        "practical",
        "option",
        "given",
        "situation",
        "scarre",
        "scarre",
        "us",
        "example",
        "telling",
        "lie",
        "illustrate",
        "lying",
        "harmful",
        "person",
        "one",
        "lie",
        "viewed",
        "disfavor",
        "general",
        "however",
        "specific",
        "case",
        "lie",
        "necessary",
        "achieve",
        "notable",
        "good",
        "consequentialist",
        "reasoning",
        "lead",
        "u",
        "favor",
        "lying",
        "example",
        "seems",
        "put",
        "emphasis",
        "consideration",
        "consequence",
        "moral",
        "approval",
        "disapproval",
        "stephen",
        "darwall",
        "note",
        "ff",
        "moral",
        "sense",
        "concerned",
        "motif",
        "approve",
        "example",
        "motive",
        "benevolence",
        "wider",
        "scope",
        "better",
        "motif",
        "rather",
        "consequence",
        "object",
        "approval",
        "disapproval",
        "inasmuch",
        "morally",
        "good",
        "person",
        "care",
        "happens",
        "others",
        "course",
        "rank",
        "order",
        "act",
        "term",
        "effect",
        "others",
        "reason",
        "used",
        "calculating",
        "effect",
        "incompatibility",
        "hutcheson",
        "committed",
        "maximization",
        "seems",
        "however",
        "insisted",
        "caveat",
        "dignity",
        "moral",
        "importance",
        "person",
        "may",
        "compensate",
        "numbers",
        "added",
        "deontological",
        "constraint",
        "duty",
        "others",
        "virtue",
        "personhood",
        "accord",
        "fundamental",
        "dignity",
        "regardless",
        "number",
        "others",
        "whose",
        "happiness",
        "affected",
        "action",
        "question",
        "hume",
        "heavily",
        "influenced",
        "hutcheson",
        "one",
        "teacher",
        "system",
        "also",
        "incorporates",
        "insight",
        "made",
        "shaftesbury",
        "though",
        "certainly",
        "lack",
        "shaftesbury",
        "s",
        "confidence",
        "virtue",
        "reward",
        "term",
        "place",
        "history",
        "utilitarianism",
        "note",
        "two",
        "distinct",
        "effect",
        "system",
        "firstly",
        "account",
        "social",
        "utility",
        "artificial",
        "virtue",
        "influenced",
        "bentham",
        "s",
        "thought",
        "utility",
        "secondly",
        "account",
        "role",
        "sentiment",
        "played",
        "moral",
        "judgment",
        "commitment",
        "moral",
        "norm",
        "influenced",
        "mill",
        "s",
        "thought",
        "internal",
        "sanction",
        "morality",
        "mill",
        "would",
        "diverge",
        "bentham",
        "developing",
        "altruistic",
        "approach",
        "utilitarianism",
        "actually",
        "misnomer",
        "later",
        "bentham",
        "contrast",
        "mill",
        "represented",
        "egoistic",
        "branch",
        "theory",
        "human",
        "nature",
        "reflected",
        "hobbesian",
        "psychological",
        "egoism"
    ]
}