{
    "main_text": "The Classical Approach || John Stuart Mill\n2.2 John Stuart Mill\n\n\nJohn Stuart Mill (1806–1873) was a follower of Bentham, and, through\nmost of his life, greatly admired Bentham's work even though he\ndisagreed with some of Bentham's claims — particularly on\nthe nature of ‘happiness.’ Bentham, recall, had\nheld that there were no qualitative differences between pleasures, only\nquantitative ones. This left him open to a variety of\ncriticisms. First, Bentham's Hedonism was too\negalitarian. Simple-minded pleasures, sensual pleasures, were\njust as good, at least intrinsically, than more sophisticated and\ncomplex pleasures. The pleasure of drinking a beer in front of\nthe T.V. surely doesn't rate as highly as the pleasure one gets\nsolving a complicated math problem, or reading a poem, or listening to\nMozart. Second, Bentham's view that there were no\nqualitative differences in pleasures also left him open to the\ncomplaint that on his view human pleasures were of no more value than\nanimal pleasures and, third, committed him to the corollary that the\nmoral status of animals, tied to their sentience, was the same as that\nof humans. While harming a puppy and harming a person are both\nbad, however, most people had the view that harming the person was\nworse. Mill sought changes to the theory that could accommodate\nthose sorts of intuitions.\n\n\nTo this end, Mill's hedonism was influenced by perfectionist\nintuitions. There are some pleasures that are more fitting than\nothers. Intellectual pleasures are of a higher, better, sort than\nthe ones that are merely sensual, and that we share with animals.\nTo some this seems to mean that Mill really wasn't a hedonistic\nutilitarian. His view of the good did radically depart from\nBentham's view. However, like Bentham, the good still\nconsists in pleasure, it is still a psychological state. There is\ncertainly that similarity. Further, the basic structures of the\ntheories are the same (for more on this see Donner 1991). While it is\ntrue that Mill is more comfortable with notions like\n‘rights’ this does not mean that he, in actuality, rejected\nutilitarianism. The rationale for all the rights he recognizes is\nutilitarian.\n\n\nMill's ‘proof’ of the claim that intellectual\npleasures are better in kind than others, though, is highly\nsuspect. He doesn't attempt a mere appeal to raw\nintuition. Instead, he argues that those persons who have experienced\nboth view the higher as better than the lower. Who would rather be a\nhappy oyster, living an enormously long life, than a person living a\nnormal life? Or, to use his most famous example — it is better to\nbe Socrates ‘dissatisfied’ than a fool\n‘satisfied.’ In this way Mill was able to solve a problem\nfor utilitarianism.\n\n\nMill also argued that the principle could be proven, using another\nrather notorious argument:\n\nThe only proof capable of being given that an object is visible is\nthat people actually see it…. In like manner, I apprehend, the\nsole evidence it is possible to produce that anything is desirable is\nthat people do actually desire it. If the end which the utilitarian\ndoctrine proposes to itself were not, in theory and in practiced,\nacknowledged to be an end, nothing could ever convince any person that\nit was so. (Mill, U, 81)\n\n\nMill then continues to argue that people desire happiness — the\nutilitarian end — and that the general happiness is “a good\nto the aggregate of all persons.” (81)\n\n\nG. E. Moore (1873–1958) criticized this as fallacious. He\nargued that it rested on an obvious ambiguity:\n\n\nMill has made as naïve and artless a use of the naturalistic\nfallacy as anybody could desire. “Good”, he tells us,\nmeans “desirable”, and you can only find out what is\ndesirable by seeking to find out what is actually desired….\nThe fact is that “desirable” does not mean “able to\nbe desired” as “visible” means “able to be\nseen.” The desirable means simply what ought to be\ndesired or deserves to be desired; just as the detestable means not\nwhat can be but what ought to be detested… (Moore, PE, 66–7)\n\n\n\nIt should be noted, however, that Mill was offering this as an\nalternative to Bentham's view which had been itself criticized as\na ‘swine morality,’ locating the good in pleasure in a kind\nof indiscriminate way. The distinctions he makes strike many as\nintuitively plausible ones. Bentham, however, can accommodate\nmany of the same intuitions within his system. This is because he\nnotes that there are a variety of parameters along which we\nquantitatively measure pleasure  —  intensity and duration are just two\nof those. His complete list is the following: intensity,\nduration, certainty or uncertainty, propinquity or remoteness,\nfecundity, purity, and extent. Thus, what Mill\ncalls the intellectual pleasures will score more highly than the\nsensual ones along several parameters, and this could give us reason to\nprefer those pleasures  —  but it is a quantitative not a qualitative\nreason, on Bentham's view. When a student decides to\nstudy for an exam rather than go to a party, for example, she is making\nthe best decision even though she is sacrificing short term\npleasure. That's because studying for the exam, Bentham\ncould argue, scores higher in terms of the long term pleasures doing\nwell in school lead to, as well as the fecundity of the pleasure in\nleading to yet other pleasures. However, Bentham will have to\nconcede that the very happy oyster that lives a very long time could,\nin principle, have a better life than a normal human.\n\n\nMill's version of utilitarianism differed from Bentham's\nalso in that he placed weight on the effectiveness of internal\nsanctions — emotions like guilt and remorse which serve to\nregulate our actions. This is an off-shoot of the different view\nof human nature adopted by Mill. We are the sorts of beings that\nhave social feelings, feelings for others, not just ourselves. We\ncare about them, and when we perceive harms to them this causes painful\nexperiences in us. When one perceives oneself to be the agent of\nthat harm, the negative emotions are centered on the self. One\nfeels guilt for what one has done, not for what one sees another\ndoing. Like external forms of punishment, internal sanctions are\ninstrumentally very important to appropriate action. Mill also\nheld that natural features of human psychology, such as conscience and\na sense of justice, underwrite motivation. The sense of justice,\nfor example, results from very natural impulses. Part of this\nsense involves a desire to punish those who have harmed others, and\nthis desire in turn “…is a spontaneous outgrowth from two\nsentiments, both in the highest degree natural…; the impulse of\nself-defense, and the feeling of sympathy.” (Chapter 5,\nUtilitarianism) Of course, he goes on, the justification\nmust be a separate issue. The feeling is there naturally, but it\nis our ‘enlarged’ sense, our capacity to include the\nwelfare of others into our considerations, and make intelligent\ndecisions, that gives it the right normative force.\n\n\nLike Bentham, Mill sought to use utilitarianism to inform law and\nsocial policy. The aim of increasing happiness underlies his\narguments for women's suffrage and free speech. We can be\nsaid to have certain rights, then — but those rights are\nunderwritten by utility. If one can show that a purported right\nor duty is harmful, then one has shown that it is not genuine.\nOne of Mills most famous arguments to this effect can be found in his\nwriting on women's suffrage when he discusses the ideal marriage\nof partners, noting that the ideal exists between individuals of\n“cultivated faculties” who influence each other\nequally. Improving the social status of women was important\nbecause they were capable of these cultivated faculties, and denying\nthem access to education and other opportunities for development is\nforgoing a significant source of happiness. Further, the men who\nwould deny women the opportunity for education, self-improvement, and\npolitical expression do so out of base motives, and the resulting\npleasures are not ones that are of the best sort.\n\n\nBentham and Mill both attacked social traditions that were justified\nby appeals to natural order. The correct appeal is to utility\nitself. Traditions often turned out to be “relics”\nof “barbarous” times, and appeals to nature as a form\nof justification were just ways to try rationalize continued deference\nto those\nrelics.\nIn the latter part of the 20th century some writers criticized\nutilitarianism for its failure to accommodate virtue evaluation.\nHowever, though virtue is not the central normative concept in Mill's\ntheory, it is an extremely important one.  In Chapter 4 of\nUtilitarianism Mill noted \n… does the utilitarian doctrine deny that people\ndesire virtue, or maintain that virtue is not a thing to be desired?\nThe very reverse.  It maintains not only that virtue is to be desired,\nbut also that it is to be desired disinterestedly, for\nitself. Whatever may be the opinion of utilitarian moralists as to the\noriginal conditions by which virtue is made virtue … they not only\nplace virtue at the very head of things which are good as a means to\nthe ultimate end, but they also recognize as a psychological fact the\npossibility of its being, to the individual, a good in itself, without\nlooking to any end beyond it; and hold, that the mind is not in a\nright state, not in a state conformable to Utility, not in the state\nmost conducive to the general happiness, unless it does love virtue in\nthis manner …\nIn Utilitarianism Mill argues that virtue not only has\ninstrumental value, but is constitutive of the good life.  A person\nwithout virtue is morally lacking, is not as able to promote the good.\nHowever, this view of virtue is someone complicated by rather cryptic\nremarks Mill makes about virtue in his A System of Logic in\nthe section in which he discusses the “Art of Life.”  There he seems\nto associate virtue with aesthetics, and morality is reserved for the\nsphere of ‘right’ or ‘duty‘.  Wendy Donner\nnotes that separating virtue from right allows Mill to solve another\nproblem for the theory: the demandingness problem (Donner 2011).  This\nis the problem that holds that if we ought to maximize utility, if\nthat is the right thing to do, then doing right requires enormous\nsacrifices (under actual conditions), and that requiring such\nsacrifices is too demanding. With duties, on Mill's view, it is\nimportant that we get compliance, and that justifies coercion.  In the\ncase of virtue, however, virtuous actions are those which it is\n“…for the general interest that they remain free.”\n",
    "section_title": "2.2 John Stuart Mill",
    "entry_title": "The History of Utilitarianism",
    "hierarchy_title": "The History of Utilitarianism || The Classical Approach || John Stuart Mill",
    "tokenized_text": [
        "classical",
        "approach",
        "john",
        "stuart",
        "mill",
        "john",
        "stuart",
        "mill",
        "john",
        "stuart",
        "mill",
        "follower",
        "bentham",
        "life",
        "greatly",
        "admired",
        "bentham",
        "s",
        "work",
        "even",
        "though",
        "disagreed",
        "bentham",
        "s",
        "claim",
        "particularly",
        "nature",
        "happiness",
        "bentham",
        "recall",
        "held",
        "qualitative",
        "difference",
        "pleasure",
        "quantitative",
        "one",
        "left",
        "open",
        "variety",
        "criticism",
        "first",
        "bentham",
        "s",
        "hedonism",
        "egalitarian",
        "simpleminded",
        "pleasure",
        "sensual",
        "pleasure",
        "good",
        "least",
        "intrinsically",
        "sophisticated",
        "complex",
        "pleasure",
        "pleasure",
        "drinking",
        "beer",
        "front",
        "tv",
        "surely",
        "nt",
        "rate",
        "highly",
        "pleasure",
        "one",
        "get",
        "solving",
        "complicated",
        "math",
        "problem",
        "reading",
        "poem",
        "listening",
        "mozart",
        "second",
        "bentham",
        "s",
        "view",
        "qualitative",
        "difference",
        "pleasure",
        "also",
        "left",
        "open",
        "complaint",
        "view",
        "human",
        "pleasure",
        "value",
        "animal",
        "pleasure",
        "third",
        "committed",
        "corollary",
        "moral",
        "status",
        "animal",
        "tied",
        "sentience",
        "human",
        "harming",
        "puppy",
        "harming",
        "person",
        "bad",
        "however",
        "people",
        "view",
        "harming",
        "person",
        "worse",
        "mill",
        "sought",
        "change",
        "theory",
        "could",
        "accommodate",
        "sort",
        "intuition",
        "end",
        "mill",
        "s",
        "hedonism",
        "influenced",
        "perfectionist",
        "intuition",
        "pleasure",
        "fitting",
        "others",
        "intellectual",
        "pleasure",
        "higher",
        "better",
        "sort",
        "one",
        "merely",
        "sensual",
        "share",
        "animal",
        "seems",
        "mean",
        "mill",
        "really",
        "nt",
        "hedonistic",
        "utilitarian",
        "view",
        "good",
        "radically",
        "depart",
        "bentham",
        "s",
        "view",
        "however",
        "like",
        "bentham",
        "good",
        "still",
        "consists",
        "pleasure",
        "still",
        "psychological",
        "state",
        "certainly",
        "similarity",
        "basic",
        "structure",
        "theory",
        "see",
        "donner",
        "true",
        "mill",
        "comfortable",
        "notion",
        "like",
        "right",
        "mean",
        "actuality",
        "rejected",
        "utilitarianism",
        "rationale",
        "right",
        "recognizes",
        "utilitarian",
        "mill",
        "s",
        "proof",
        "claim",
        "intellectual",
        "pleasure",
        "better",
        "kind",
        "others",
        "though",
        "highly",
        "suspect",
        "nt",
        "attempt",
        "mere",
        "appeal",
        "raw",
        "intuition",
        "instead",
        "argues",
        "person",
        "experienced",
        "view",
        "higher",
        "better",
        "lower",
        "would",
        "rather",
        "happy",
        "oyster",
        "living",
        "enormously",
        "long",
        "life",
        "person",
        "living",
        "normal",
        "life",
        "use",
        "famous",
        "example",
        "better",
        "socrates",
        "dissatisfied",
        "fool",
        "satisfied",
        "way",
        "mill",
        "able",
        "solve",
        "problem",
        "utilitarianism",
        "mill",
        "also",
        "argued",
        "principle",
        "could",
        "proven",
        "using",
        "another",
        "rather",
        "notorious",
        "argument",
        "proof",
        "capable",
        "given",
        "object",
        "visible",
        "people",
        "actually",
        "see",
        "it",
        "like",
        "manner",
        "apprehend",
        "sole",
        "evidence",
        "possible",
        "produce",
        "anything",
        "desirable",
        "people",
        "actually",
        "desire",
        "end",
        "utilitarian",
        "doctrine",
        "proposes",
        "theory",
        "practiced",
        "acknowledged",
        "end",
        "nothing",
        "could",
        "ever",
        "convince",
        "person",
        "mill",
        "u",
        "mill",
        "continues",
        "argue",
        "people",
        "desire",
        "happiness",
        "utilitarian",
        "end",
        "general",
        "happiness",
        "good",
        "aggregate",
        "persons",
        "g",
        "e",
        "moore",
        "criticized",
        "fallacious",
        "argued",
        "rested",
        "obvious",
        "ambiguity",
        "mill",
        "made",
        "naïve",
        "artless",
        "use",
        "naturalistic",
        "fallacy",
        "anybody",
        "could",
        "desire",
        "good",
        "tell",
        "u",
        "mean",
        "desirable",
        "find",
        "desirable",
        "seeking",
        "find",
        "actually",
        "desired",
        "fact",
        "desirable",
        "mean",
        "able",
        "desired",
        "visible",
        "mean",
        "able",
        "seen",
        "desirable",
        "mean",
        "simply",
        "ought",
        "desired",
        "deserves",
        "desired",
        "detestable",
        "mean",
        "ought",
        "detested",
        "moore",
        "pe",
        "noted",
        "however",
        "mill",
        "offering",
        "alternative",
        "bentham",
        "s",
        "view",
        "criticized",
        "swine",
        "morality",
        "locating",
        "good",
        "pleasure",
        "kind",
        "indiscriminate",
        "way",
        "distinction",
        "make",
        "strike",
        "many",
        "intuitively",
        "plausible",
        "one",
        "bentham",
        "however",
        "accommodate",
        "many",
        "intuition",
        "within",
        "system",
        "note",
        "variety",
        "parameter",
        "along",
        "quantitatively",
        "measure",
        "pleasure",
        "intensity",
        "duration",
        "two",
        "complete",
        "list",
        "following",
        "intensity",
        "duration",
        "certainty",
        "uncertainty",
        "propinquity",
        "remoteness",
        "fecundity",
        "purity",
        "extent",
        "thus",
        "mill",
        "call",
        "intellectual",
        "pleasure",
        "score",
        "highly",
        "sensual",
        "one",
        "along",
        "several",
        "parameter",
        "could",
        "give",
        "u",
        "reason",
        "prefer",
        "pleasure",
        "quantitative",
        "qualitative",
        "reason",
        "bentham",
        "s",
        "view",
        "student",
        "decides",
        "study",
        "exam",
        "rather",
        "go",
        "party",
        "example",
        "making",
        "best",
        "decision",
        "even",
        "though",
        "sacrificing",
        "short",
        "term",
        "pleasure",
        "s",
        "studying",
        "exam",
        "bentham",
        "could",
        "argue",
        "score",
        "higher",
        "term",
        "long",
        "term",
        "pleasure",
        "well",
        "school",
        "lead",
        "well",
        "fecundity",
        "pleasure",
        "leading",
        "yet",
        "pleasure",
        "however",
        "bentham",
        "concede",
        "happy",
        "oyster",
        "life",
        "long",
        "time",
        "could",
        "principle",
        "better",
        "life",
        "normal",
        "human",
        "mill",
        "s",
        "version",
        "utilitarianism",
        "differed",
        "bentham",
        "s",
        "also",
        "placed",
        "weight",
        "effectiveness",
        "internal",
        "sanction",
        "emotion",
        "like",
        "guilt",
        "remorse",
        "serve",
        "regulate",
        "action",
        "offshoot",
        "different",
        "view",
        "human",
        "nature",
        "adopted",
        "mill",
        "sort",
        "being",
        "social",
        "feeling",
        "feeling",
        "others",
        "care",
        "perceive",
        "harm",
        "cause",
        "painful",
        "experience",
        "u",
        "one",
        "perceives",
        "oneself",
        "agent",
        "harm",
        "negative",
        "emotion",
        "centered",
        "self",
        "one",
        "feel",
        "guilt",
        "one",
        "done",
        "one",
        "see",
        "another",
        "like",
        "external",
        "form",
        "punishment",
        "internal",
        "sanction",
        "instrumentally",
        "important",
        "appropriate",
        "action",
        "mill",
        "also",
        "held",
        "natural",
        "feature",
        "human",
        "psychology",
        "conscience",
        "sense",
        "justice",
        "underwrite",
        "motivation",
        "sense",
        "justice",
        "example",
        "result",
        "natural",
        "impulse",
        "part",
        "sense",
        "involves",
        "desire",
        "punish",
        "harmed",
        "others",
        "desire",
        "turn",
        "is",
        "spontaneous",
        "outgrowth",
        "two",
        "sentiment",
        "highest",
        "degree",
        "natural",
        "impulse",
        "selfdefense",
        "feeling",
        "sympathy",
        "chapter",
        "utilitarianism",
        "course",
        "go",
        "justification",
        "must",
        "separate",
        "issue",
        "feeling",
        "naturally",
        "enlarged",
        "sense",
        "capacity",
        "include",
        "welfare",
        "others",
        "consideration",
        "make",
        "intelligent",
        "decision",
        "give",
        "right",
        "normative",
        "force",
        "like",
        "bentham",
        "mill",
        "sought",
        "use",
        "utilitarianism",
        "inform",
        "law",
        "social",
        "policy",
        "aim",
        "increasing",
        "happiness",
        "underlies",
        "argument",
        "woman",
        "s",
        "suffrage",
        "free",
        "speech",
        "said",
        "certain",
        "right",
        "right",
        "underwritten",
        "utility",
        "one",
        "show",
        "purported",
        "right",
        "duty",
        "harmful",
        "one",
        "shown",
        "genuine",
        "one",
        "mill",
        "famous",
        "argument",
        "effect",
        "found",
        "writing",
        "woman",
        "s",
        "suffrage",
        "discus",
        "ideal",
        "marriage",
        "partner",
        "noting",
        "ideal",
        "exists",
        "individual",
        "cultivated",
        "faculty",
        "influence",
        "equally",
        "improving",
        "social",
        "status",
        "woman",
        "important",
        "capable",
        "cultivated",
        "faculty",
        "denying",
        "access",
        "education",
        "opportunity",
        "development",
        "forgoing",
        "significant",
        "source",
        "happiness",
        "men",
        "would",
        "deny",
        "woman",
        "opportunity",
        "education",
        "selfimprovement",
        "political",
        "expression",
        "base",
        "motif",
        "resulting",
        "pleasure",
        "one",
        "best",
        "sort",
        "bentham",
        "mill",
        "attacked",
        "social",
        "tradition",
        "justified",
        "appeal",
        "natural",
        "order",
        "correct",
        "appeal",
        "utility",
        "tradition",
        "often",
        "turned",
        "relic",
        "barbarous",
        "time",
        "appeal",
        "nature",
        "form",
        "justification",
        "way",
        "try",
        "rationalize",
        "continued",
        "deference",
        "relic",
        "latter",
        "part",
        "th",
        "century",
        "writer",
        "criticized",
        "utilitarianism",
        "failure",
        "accommodate",
        "virtue",
        "evaluation",
        "however",
        "though",
        "virtue",
        "central",
        "normative",
        "concept",
        "mill",
        "s",
        "theory",
        "extremely",
        "important",
        "one",
        "chapter",
        "utilitarianism",
        "mill",
        "noted",
        "utilitarian",
        "doctrine",
        "deny",
        "people",
        "desire",
        "virtue",
        "maintain",
        "virtue",
        "thing",
        "desired",
        "reverse",
        "maintains",
        "virtue",
        "desired",
        "also",
        "desired",
        "disinterestedly",
        "whatever",
        "may",
        "opinion",
        "utilitarian",
        "moralist",
        "original",
        "condition",
        "virtue",
        "made",
        "virtue",
        "place",
        "virtue",
        "head",
        "thing",
        "good",
        "mean",
        "ultimate",
        "end",
        "also",
        "recognize",
        "psychological",
        "fact",
        "possibility",
        "individual",
        "good",
        "without",
        "looking",
        "end",
        "beyond",
        "hold",
        "mind",
        "right",
        "state",
        "state",
        "conformable",
        "utility",
        "state",
        "conducive",
        "general",
        "happiness",
        "unless",
        "love",
        "virtue",
        "manner",
        "utilitarianism",
        "mill",
        "argues",
        "virtue",
        "instrumental",
        "value",
        "constitutive",
        "good",
        "life",
        "person",
        "without",
        "virtue",
        "morally",
        "lacking",
        "able",
        "promote",
        "good",
        "however",
        "view",
        "virtue",
        "someone",
        "complicated",
        "rather",
        "cryptic",
        "remark",
        "mill",
        "make",
        "virtue",
        "system",
        "logic",
        "section",
        "discus",
        "art",
        "life",
        "seems",
        "associate",
        "virtue",
        "aesthetic",
        "morality",
        "reserved",
        "sphere",
        "right",
        "duty",
        "wendy",
        "donner",
        "note",
        "separating",
        "virtue",
        "right",
        "allows",
        "mill",
        "solve",
        "another",
        "problem",
        "theory",
        "demandingness",
        "problem",
        "donner",
        "problem",
        "hold",
        "ought",
        "maximize",
        "utility",
        "right",
        "thing",
        "right",
        "requires",
        "enormous",
        "sacrifice",
        "actual",
        "condition",
        "requiring",
        "sacrifice",
        "demanding",
        "duty",
        "mill",
        "s",
        "view",
        "important",
        "get",
        "compliance",
        "justifies",
        "coercion",
        "case",
        "virtue",
        "however",
        "virtuous",
        "action",
        "for",
        "general",
        "interest",
        "remain",
        "free"
    ]
}