{
    "main_text": "Supervaluationism\n5. Supervaluationism\n\nAccording to supervaluationists, borderline statements lack a\ntruth-value. This neatly explains why it is universally impossible to\nknow the truth-value of a borderline statement. Supervaluationists\noffer details about the nature of absolute borderline cases. Simple\nsentences about borderline cases lack a truth-value. Compounds of\nthese statements can have a truth-value if they come out true\nregardless of how the statement is admissibly precisified. For\ninstance, ‘Either Mr. Stoop is tall or it is not the case that\nMr. Stoop is tall’ is true because it comes out true under all\nways of sharpening ‘tall’. Thus the method of\nsupervaluations allows one to retain all the theorems of standard\nlogic while admitting “truth-value gaps”.\n\nOne may wonder whether this striking result is a genuine convergence\nwith standard logic. Is the supervaluationist characterizing vague\nstatements as propositions? Or is he merely pointing out that certain\nnon-propositions have a structure isomorphic to logical theorems?\n(Some electrical circuits are isomorphic to tautologies but this does\nnot make the circuits tautologies.) Kit Fine (1975, 282), and\nespecially David Lewis (1982), characterize vagueness as\nhyper-ambiguity. Instead of there being one vague concept, there are\nmany precise concepts that closely resemble each other.\n‘Child’ can mean a human being at most one day old or mean\na human being at most two days old or mean a human being at most three\ndays old …. Thus the logic of vagueness is a logic for\nequivocators. Lewis’ idea is that ambiguous statements are true\nwhen they come out true under all disambiguations. But logicians\nnormally require that a statement be disambiguated before\nlogic is applied. The mere fact that an ambiguous statement comes out\ntrue under all its disambiguations does not show that the statement\nitself is true. Sentences which are actually disambiguated\nmay have truth-values. But the best that can be said of those that\nmerely could be disambiguated is that they would\nhave had a truth-value had they been disambiguated (Tye 1989).\n\nSupervaluationism will converge with classical logic only if each word\nof the supervaluated sentence is uniformly interpreted. For instance,\n‘Either a carbon copy of Teddy Roosevelt’s signature is an\nautograph or it is not the case that a carbon copy of Teddy\nRoosevelt’s signature is an autograph’ comes out true only\nif ‘autograph’ is interpreted the same way in both\ndisjuncts. Vague sentences resist mixed interpretations. However,\nmixed interpretations are permissible for ambiguous sentences. As\nLewis himself notes in a criticism of relevance logic, ‘Scrooge\nwalked along the bank on his way to the bank’ can receive a\nmixed disambiguation. When exterminators offer ‘non-toxic ant\npoison’, we charitably switch relativizations within the noun\nphrase: the substance is safe for human beings but deadly for\nants.\n\nEven if one agrees that supervaluationism converges with classical\nlogic about theoremhood, they clearly differ in other respects.\nSupervaluationism requires rejection of inference rules such as\ncontraposition, conditional proof and reductio ad absurdum\n(Williamson 1994, 151–152). In the eyes of the\nsupervaluationist, a demonstration that a statement is not true does\nnot guarantee that the statement is false.\n\nThe supervaluationist is also under pressure to reject semantic\nprinciples which are intimately associated with the application of\nlogical laws. According to Alfred Tarski’s Convention T, a\nstatement ‘\\(S\\)’ is true if and only if \\(S\\). In other\nwords, truth is disquotational. Supervaluationists say that being\nsupertrue (being true under all precisifications) suffices for being\ntrue. But given Convention T, supertruth would then be disquotational.\nSince the supervaluationists accept the principle of excluded middle,\nthe combination of Convention T and ‘P or ~P’ being\nsupertrue would force them to say ‘\\(P\\)’ is supertrue or\n‘\\(\\neg P\\)’ is supertrue (even if ‘\\(P\\)’\napplies a predicate to a borderline case). This would imply that\neither ‘\\(P\\)’ is true or ‘\\(\\neg P\\)’ is true\n(Williamson 1994, 162–163). And that would be a fatal loss of\ntruth-value gaps for supervaluationism.\n\nThere is a final concern about the “ontological honesty”\nof the supervaluationist’s existential quantifier. As part of\nhis solution to the sorites paradox, the supervaluationist asserts,\n“There is a human being who, for some \\(n\\), was a child when\n\\(n\\) days old but not when \\(n + 1\\) days old.” For this\nstatement comes out true under all admissible precisifications of\n‘child’. However, when pressed the supervaluationist adds\na codicil: “Oh, of course I do not mean that there really is a\nsharp threshold for childhood.”\n\nAfter the clarification, some wonder how supervaluationists differs\nfrom drastic metaphysical skeptics. In his nihilist days, Peter Unger\n(1979) admitted that it is useful to talk as if there are\nchildren. But he insisted that strictly speaking, vague terms such as\n‘child’ cannot apply to anything. Unger was free to use\nsupervaluationism as a theory to explain our ordinary discourse about\nchildren. (Unger instead used other resources to explain how we\nfruitfully apply empty predicates.) But once the dust had cleared and\nthe precise rubble came into focus, Unger had to conclude that there\nare no children.\n\nOfficially, the supervaluationist rejects the induction step of the\nsorites argument. Unofficially, he seems to instead reject the\nbase step of the sorites argument.\n\nSupervaluationists encourage the view that all vagueness is a matter\nof linguistic indecision: the reason why there are borderline cases is\nthat we have not bothered to make up our minds. The method of\nsupervaluation allows us to assign truth-values prior to any\ndecisions. Expressivists think this is a mistake akin to assigning\ntruth-values to normative claims (MacFarlane 2016). They model\nvagueness as practical uncertainty as to whether to treat a borderline\n\\(F\\) as an \\(F\\). The deliberator may accept the tautologies of\nclassical logic as constraints governing competing plans for drawing\nlines. I can accept “Either Donald is bald or not” without\naccepting either disjunct. An existentially quantified sentence can be\naccepted even when no instance is. A shrug of the shoulders signals\nreadiness to go either way, not ignorance as to which possible world\none inhabits.\n\nThe expressivist is poised to explain how supervaluationism developed\ninto the most respected theory of vagueness. Frege portrayed vagueness\nas negligent under-definition: One haphazardly introduces a necessary\ncondition here, a sufficient condition there, but fails to supply a\ncondition that is both necessary and sufficient. Supervaluationists\ncounter that indecision can be both intentional and functional.\nInstead of committing ourselves prematurely, we fill in meanings as we\ngo along in light of new information and interests.\n\nPsychologists may deny that we could really commit ourselves to the\ncomplete precisifications envisaged by the supervaluationist (which\nencompass an entire language). Many of these comprehensive\nalternatives are too complex for memory. For instance, any\nprecisification admitting a long band of random verdicts will be\nalgorithmically complex and so not compressible in a rule. Realistic\nalternatives are only modestly more precise than ordinary usage.\n\nNevertheless, the supervaluationist’s conjecture about gradual\nprecisification is popular for the highly stipulative enterprise of\npromulgating and enforcing laws (Endicott 2000). Judges frequently\nseem to exercise and control discretion by means of vague language.\nUncertainties about the scope of discretion may arise from\nhigher-order vagueness (Schauer 2016).\n\nDiscretion through gap-filling pleases those who regard adjudication\nas a creative process. It alarms those who think we should be judged\nby laws rather than men. The doctrine of discretion through\nindeterminacy has also been questioned on the grounds that the source\nof the discretion is the generality of the legal terms rather than\ntheir vagueness (Poscher 2012).\n\nBy David Lanius’s (2019) reckoning, the only function for\nvagueness in law is strategic. Drunk driving is discouraged by the\nvagueness of ‘drunk’ in the way it is discouraged by\nrandom testing of motorists. Scattershot enforcement becomes a welcome\nfeature of the legal system rather than a bug in the legal\nprogramming. Motorists stay sober to avoid participation in a\npunishment lottery.\n\nJudicial variance is just what one expects if the judges are making a\nforced choice on borderline cases. Judges cannot confess ignorance and\nso are compelled to assert beyond their evidence. Little wonder that\nwhat comes out of their mouth is affected by irrelevancies such as\nwhat went in their mouths for lunch. This susceptibility to bias by\nirrelevant factors (weather, order effects, anchoring) could be\neliminated by methodical use of a lottery. The lottery could be\nweighted to the fact that borderline crimes vary in how close they\ncome to being clear crimes.\n\nHrahn Asgeirsson (2020, chapter 3) admits that the descriptive\nquestion ‘Is this drunk driving?’ cannot be more reliably\nanswered by a judge than anyone else when it is a borderline case. But\nhe thinks the normative question, ‘Should this be counted as\ndrunk driving?’ could be better answered by those with superior\nknowledge of legislative intent.\n",
    "section_title": "5. Supervaluationism",
    "entry_title": "Vagueness",
    "hierarchy_title": "Vagueness || Supervaluationism",
    "tokenized_text": [
        "supervaluationism",
        "supervaluationism",
        "according",
        "supervaluationists",
        "borderline",
        "statement",
        "lack",
        "truthvalue",
        "neatly",
        "explains",
        "universally",
        "impossible",
        "know",
        "truthvalue",
        "borderline",
        "statement",
        "supervaluationists",
        "offer",
        "detail",
        "nature",
        "absolute",
        "borderline",
        "case",
        "simple",
        "sentence",
        "borderline",
        "case",
        "lack",
        "truthvalue",
        "compound",
        "statement",
        "truthvalue",
        "come",
        "true",
        "regardless",
        "statement",
        "admissibly",
        "precisified",
        "instance",
        "either",
        "mr",
        "stoop",
        "tall",
        "case",
        "mr",
        "stoop",
        "tall",
        "true",
        "come",
        "true",
        "way",
        "sharpening",
        "tall",
        "thus",
        "method",
        "supervaluations",
        "allows",
        "one",
        "retain",
        "theorem",
        "standard",
        "logic",
        "admitting",
        "truthvalue",
        "gap",
        "one",
        "may",
        "wonder",
        "whether",
        "striking",
        "result",
        "genuine",
        "convergence",
        "standard",
        "logic",
        "supervaluationist",
        "characterizing",
        "vague",
        "statement",
        "proposition",
        "merely",
        "pointing",
        "certain",
        "nonpropositions",
        "structure",
        "isomorphic",
        "logical",
        "theorem",
        "electrical",
        "circuit",
        "isomorphic",
        "tautology",
        "make",
        "circuit",
        "tautology",
        "kit",
        "fine",
        "especially",
        "david",
        "lewis",
        "characterize",
        "vagueness",
        "hyperambiguity",
        "instead",
        "one",
        "vague",
        "concept",
        "many",
        "precise",
        "concept",
        "closely",
        "resemble",
        "child",
        "mean",
        "human",
        "one",
        "day",
        "old",
        "mean",
        "human",
        "two",
        "day",
        "old",
        "mean",
        "human",
        "three",
        "day",
        "old",
        "thus",
        "logic",
        "vagueness",
        "logic",
        "equivocator",
        "lewis",
        "idea",
        "ambiguous",
        "statement",
        "true",
        "come",
        "true",
        "disambiguation",
        "logician",
        "normally",
        "require",
        "statement",
        "disambiguated",
        "logic",
        "applied",
        "mere",
        "fact",
        "ambiguous",
        "statement",
        "come",
        "true",
        "disambiguation",
        "show",
        "statement",
        "true",
        "sentence",
        "actually",
        "disambiguated",
        "may",
        "truthvalues",
        "best",
        "said",
        "merely",
        "could",
        "disambiguated",
        "would",
        "truthvalue",
        "disambiguated",
        "tye",
        "supervaluationism",
        "converge",
        "classical",
        "logic",
        "word",
        "supervaluated",
        "sentence",
        "uniformly",
        "interpreted",
        "instance",
        "either",
        "carbon",
        "copy",
        "teddy",
        "roosevelt",
        "signature",
        "autograph",
        "case",
        "carbon",
        "copy",
        "teddy",
        "roosevelt",
        "signature",
        "autograph",
        "come",
        "true",
        "autograph",
        "interpreted",
        "way",
        "disjuncts",
        "vague",
        "sentence",
        "resist",
        "mixed",
        "interpretation",
        "however",
        "mixed",
        "interpretation",
        "permissible",
        "ambiguous",
        "sentence",
        "lewis",
        "note",
        "criticism",
        "relevance",
        "logic",
        "scrooge",
        "walked",
        "along",
        "bank",
        "way",
        "bank",
        "receive",
        "mixed",
        "disambiguation",
        "exterminator",
        "offer",
        "nontoxic",
        "ant",
        "poison",
        "charitably",
        "switch",
        "relativizations",
        "within",
        "noun",
        "phrase",
        "substance",
        "safe",
        "human",
        "being",
        "deadly",
        "ant",
        "even",
        "one",
        "agrees",
        "supervaluationism",
        "converges",
        "classical",
        "logic",
        "theoremhood",
        "clearly",
        "differ",
        "respect",
        "supervaluationism",
        "requires",
        "rejection",
        "inference",
        "rule",
        "contraposition",
        "conditional",
        "proof",
        "reductio",
        "ad",
        "absurdum",
        "williamson",
        "eye",
        "supervaluationist",
        "demonstration",
        "statement",
        "true",
        "guarantee",
        "statement",
        "false",
        "supervaluationist",
        "also",
        "pressure",
        "reject",
        "semantic",
        "principle",
        "intimately",
        "associated",
        "application",
        "logical",
        "law",
        "according",
        "alfred",
        "tarski",
        "convention",
        "statement",
        "s",
        "true",
        "s",
        "word",
        "truth",
        "disquotational",
        "supervaluationists",
        "say",
        "supertrue",
        "true",
        "precisifications",
        "suffices",
        "true",
        "given",
        "convention",
        "supertruth",
        "would",
        "disquotational",
        "since",
        "supervaluationists",
        "accept",
        "principle",
        "excluded",
        "middle",
        "combination",
        "convention",
        "p",
        "p",
        "supertrue",
        "would",
        "force",
        "say",
        "p",
        "supertrue",
        "neg",
        "p",
        "supertrue",
        "even",
        "p",
        "applies",
        "predicate",
        "borderline",
        "case",
        "would",
        "imply",
        "either",
        "p",
        "true",
        "neg",
        "p",
        "true",
        "williamson",
        "would",
        "fatal",
        "loss",
        "truthvalue",
        "gap",
        "supervaluationism",
        "final",
        "concern",
        "ontological",
        "honesty",
        "supervaluationist",
        "existential",
        "quantifier",
        "part",
        "solution",
        "sorites",
        "paradox",
        "supervaluationist",
        "asserts",
        "human",
        "n",
        "child",
        "n",
        "day",
        "old",
        "n",
        "day",
        "old",
        "statement",
        "come",
        "true",
        "admissible",
        "precisifications",
        "child",
        "however",
        "pressed",
        "supervaluationist",
        "add",
        "codicil",
        "oh",
        "course",
        "mean",
        "really",
        "sharp",
        "threshold",
        "childhood",
        "clarification",
        "wonder",
        "supervaluationists",
        "differs",
        "drastic",
        "metaphysical",
        "skeptic",
        "nihilist",
        "day",
        "peter",
        "unger",
        "admitted",
        "useful",
        "talk",
        "child",
        "insisted",
        "strictly",
        "speaking",
        "vague",
        "term",
        "child",
        "apply",
        "anything",
        "unger",
        "free",
        "use",
        "supervaluationism",
        "theory",
        "explain",
        "ordinary",
        "discourse",
        "child",
        "unger",
        "instead",
        "used",
        "resource",
        "explain",
        "fruitfully",
        "apply",
        "empty",
        "predicate",
        "dust",
        "cleared",
        "precise",
        "rubble",
        "came",
        "focus",
        "unger",
        "conclude",
        "child",
        "officially",
        "supervaluationist",
        "reject",
        "induction",
        "step",
        "sorites",
        "argument",
        "unofficially",
        "seems",
        "instead",
        "reject",
        "base",
        "step",
        "sorites",
        "argument",
        "supervaluationists",
        "encourage",
        "view",
        "vagueness",
        "matter",
        "linguistic",
        "indecision",
        "reason",
        "borderline",
        "case",
        "bothered",
        "make",
        "mind",
        "method",
        "supervaluation",
        "allows",
        "u",
        "assign",
        "truthvalues",
        "prior",
        "decision",
        "expressivists",
        "think",
        "mistake",
        "akin",
        "assigning",
        "truthvalues",
        "normative",
        "claim",
        "macfarlane",
        "model",
        "vagueness",
        "practical",
        "uncertainty",
        "whether",
        "treat",
        "borderline",
        "f",
        "f",
        "deliberator",
        "may",
        "accept",
        "tautology",
        "classical",
        "logic",
        "constraint",
        "governing",
        "competing",
        "plan",
        "drawing",
        "line",
        "accept",
        "either",
        "donald",
        "bald",
        "without",
        "accepting",
        "either",
        "disjunct",
        "existentially",
        "quantified",
        "sentence",
        "accepted",
        "even",
        "instance",
        "shrug",
        "shoulder",
        "signal",
        "readiness",
        "go",
        "either",
        "way",
        "ignorance",
        "possible",
        "world",
        "one",
        "inhabits",
        "expressivist",
        "poised",
        "explain",
        "supervaluationism",
        "developed",
        "respected",
        "theory",
        "vagueness",
        "frege",
        "portrayed",
        "vagueness",
        "negligent",
        "underdefinition",
        "one",
        "haphazardly",
        "introduces",
        "necessary",
        "condition",
        "sufficient",
        "condition",
        "fails",
        "supply",
        "condition",
        "necessary",
        "sufficient",
        "supervaluationists",
        "counter",
        "indecision",
        "intentional",
        "functional",
        "instead",
        "committing",
        "prematurely",
        "fill",
        "meaning",
        "go",
        "along",
        "light",
        "new",
        "information",
        "interest",
        "psychologist",
        "may",
        "deny",
        "could",
        "really",
        "commit",
        "complete",
        "precisifications",
        "envisaged",
        "supervaluationist",
        "encompass",
        "entire",
        "language",
        "many",
        "comprehensive",
        "alternative",
        "complex",
        "memory",
        "instance",
        "precisification",
        "admitting",
        "long",
        "band",
        "random",
        "verdict",
        "algorithmically",
        "complex",
        "compressible",
        "rule",
        "realistic",
        "alternative",
        "modestly",
        "precise",
        "ordinary",
        "usage",
        "nevertheless",
        "supervaluationist",
        "conjecture",
        "gradual",
        "precisification",
        "popular",
        "highly",
        "stipulative",
        "enterprise",
        "promulgating",
        "enforcing",
        "law",
        "endicott",
        "judge",
        "frequently",
        "seem",
        "exercise",
        "control",
        "discretion",
        "mean",
        "vague",
        "language",
        "uncertainty",
        "scope",
        "discretion",
        "may",
        "arise",
        "higherorder",
        "vagueness",
        "schauer",
        "discretion",
        "gapfilling",
        "plea",
        "regard",
        "adjudication",
        "creative",
        "process",
        "alarm",
        "think",
        "judged",
        "law",
        "rather",
        "men",
        "doctrine",
        "discretion",
        "indeterminacy",
        "also",
        "questioned",
        "ground",
        "source",
        "discretion",
        "generality",
        "legal",
        "term",
        "rather",
        "vagueness",
        "poscher",
        "david",
        "lanius",
        "reckoning",
        "function",
        "vagueness",
        "law",
        "strategic",
        "drunk",
        "driving",
        "discouraged",
        "vagueness",
        "drunk",
        "way",
        "discouraged",
        "random",
        "testing",
        "motorist",
        "scattershot",
        "enforcement",
        "becomes",
        "welcome",
        "feature",
        "legal",
        "system",
        "rather",
        "bug",
        "legal",
        "programming",
        "motorist",
        "stay",
        "sober",
        "avoid",
        "participation",
        "punishment",
        "lottery",
        "judicial",
        "variance",
        "one",
        "expects",
        "judge",
        "making",
        "forced",
        "choice",
        "borderline",
        "case",
        "judge",
        "confess",
        "ignorance",
        "compelled",
        "assert",
        "beyond",
        "evidence",
        "little",
        "wonder",
        "come",
        "mouth",
        "affected",
        "irrelevancy",
        "went",
        "mouth",
        "lunch",
        "susceptibility",
        "bias",
        "irrelevant",
        "factor",
        "weather",
        "order",
        "effect",
        "anchoring",
        "could",
        "eliminated",
        "methodical",
        "use",
        "lottery",
        "lottery",
        "could",
        "weighted",
        "fact",
        "borderline",
        "crime",
        "vary",
        "close",
        "come",
        "clear",
        "crime",
        "hrahn",
        "asgeirsson",
        "chapter",
        "admits",
        "descriptive",
        "question",
        "drunk",
        "driving",
        "reliably",
        "answered",
        "judge",
        "anyone",
        "else",
        "borderline",
        "case",
        "think",
        "normative",
        "question",
        "counted",
        "drunk",
        "driving",
        "could",
        "better",
        "answered",
        "superior",
        "knowledge",
        "legislative",
        "intent"
    ]
}