{
    "main_text": "Comparison with Ambiguity and Generality\n2. Comparison with Ambiguity and Generality\n\n‘Tall’ is relative. A 1.8 meter pygmy is tall for a pygmy\nbut a 1.8 meter Masai is not tall for a Masai. Although relativization\ndisambiguates, it does not eliminate borderline cases. There are\nshorter pygmies who are borderline tall for a pygmy and taller Masai\nwho are borderline tall for a Masai. The direct bearers of vagueness\nare a word’s full disambiguations such as ‘tall for an\neighteenth-century French man’. Words are only vague indirectly,\nby virtue of having a sense that is vague. In contrast, an ambiguous\nword bears its ambiguity directly—simply in virtue of having\nmultiple meanings.\n\nThis contrast between vagueness and ambiguity is obscured by the fact\nthat most words are both vague and ambiguous. ‘Child’ is\nambiguous between ‘offspring’ and ‘immature\noffspring’. The latter reading of ‘child’ is vague\nbecause there are borderline cases of immature offspring. The contrast\nis further complicated by the fact that most words are also general.\nFor instance, ‘child’ covers both boys and girls.\n\nAmbiguity and vagueness also contrast with respect to the\nspeaker’s discretion. If a word is ambiguous, the speaker can\nresolve the ambiguity without departing from literal usage. For\ninstance, he can declare that he meant ‘child’ to express\nthe concept of an immature offspring. If a word is vague, the speaker\ncannot resolve the borderline case. For instance, the speaker cannot\nmake ‘child’ literally mean anyone under eighteen just by\nintending it. That concept is not, as it were, on the menu\ncorresponding to ‘child’. He would be understood as taking\na special liberty with the term to suit a special purpose.\nAcknowledging departure from ordinary usage would relieve him of the\nobligation to defend the sharp cut-off.\n\nWhen the movie director Alfred Hitchcock mused ‘All actors are\nchildren’ he was taking liberties with clear negative cases of\n‘child’ rather than its borderline cases. The aptness of\nhis generalization is not judged by its literal truth-value (because\nit is obviously untrue). Likewise, we do not judge precisifications of\nborderline cases by their truth-values (because they are obviously not\nascertainable as true or false). We instead judge precisifications by\ntheir simplicity, conservativeness, and fruitfulness. A\nprecisification that draws the line across the borderline cases\nconserves more paradigm usage than one that draws the line across\nclear cases. But conservatism is just one desideratum among many.\nSometimes the best balance is achieved at the cost of turning former\npositive cases into negative cases.\n\nOnce we shift from literal to figurative usage, we gain fictive\ncontrol over our entire vocabulary—not just vague words. When a\ntravel agent says ‘France is a hexagon’, we do not infer\nthat she has committed the geometrical error of classifying France as\na six-sided polygon. We instead interpret the travel agent as speaking\nfiguratively, as meaning that France is shaped like a hexagon.\nSimilarly, when the travel agent says ‘Reno is the biggest\nlittle city’, we do not interpret her as overlooking the\nvagueness of ‘little city’. Just as she uses the obvious\nfalsehood of ‘France is a hexagon’ to signal a metaphor,\nshe uses the obvious indeterminacy of ‘Reno is the biggest\nlittle city’ to signal hyperbole.\n\nGiven that speakers lack any literal discretion over vague terms, we\nought not to chide them for indecisiveness. Where there is no decision\nto be made, there is no scope for vice. Speakers would have literal\ndiscretion if statements applying a predicate to its borderline cases\nwere just permissible variations in linguistic usage. For the sake of\ncomparison, consider discretion between alternative spellings.\nProfessor Letterman uses ‘judgment’ instead of\n‘judgement’ because he wants to promote the principle that\na silent E signals a long vowel. He still has fond memories of Tom\nLehrer’s 1971 children’s song “Silent E”:\n\nWho can turn a can into a cane?\n\nWho can turn a pan into a pane?\n\nIt’s not too hard to see,\n\nIt’s Silent E.\n\n\nWho can turn a cub into a cube?\n\nWho can turn a tub into a tube?\n\nIt’s elementary\n\nFor Silent E.\n\n\nProfessor Letterman disapproves of those who add the misleading E but\nconcedes that ‘judgement’ is a permissible spelling; he\ndoes not penalize his students for misspelling when they make their\nhard-hearted choice of ‘judgement’. Indeed, Professor\nLetterman scolds students if they fail to stick with the same spelling\nthroughout the composition. Choose but stick to your choice!\n\nProfessor Letterman’s assertion ‘The word for my favorite\nmental act is spelled j-u-d-g-m-e-n-t’ is robust with respect to\nthe news that it is also spelled j-u-d-g-e-m-e-n-t. He would continue\nto assert it. He can conjoin the original assertion with information\nabout the alternative: ‘The word for my favorite mental act is\nspelled j-u-d-g-m-e-n-t and is also spelled j-u-d-g-e-m-e-n-t’.\nIn contrast, Professor Letterman’s assertion that ‘Martha\nis a woman’ is not robust with respect to the news that Martha\nis a borderline case of ‘woman’ (say, Letterman learns\nMartha is younger than she looks). The new information would lead\nLetterman to retract his assertion in favor of a hedged remark such as\n‘Martha might be a woman and Martha might not be a woman’.\nProfessor Letterman’s loss of confidence is hard to explain if\nthe information about her borderline status were simply news of a\ndifferent but permissible way of describing her. Discoveries of\nnotational variants do not warrant changes in former beliefs.\n\nNews of borderline status has an evidential character. Loss of clarity\nbrings loss of warrant. If you do not lower your confidence, you are\nopen to the charge of dogmatism. To concede that your ferry is a\nborderline case of ‘seaworthy’ is to concede that you do\nnot know that your ship is seaworthy. That is why debates can be\ndissolved by showing that the dispute is over an absolute borderline\ncase. The debaters should both become agnostic. After all, they do not\nhave a license to form beliefs beyond their evidence. If your ferry is\nborderline seaworthy, you are not free to believe it is seaworthy.\n\nAccording to W. K. Clifford, belief beyond the evidence is always\nmorally forbidden, not just irrational. William James countered that\nbelief beyond the evidence is permissible when there is a forced,\nmomentous, live option. Can I survive the destruction of my body,\nsimply by virtue of a strong psychological resemblance with a future\nperson? The answer affects my prospects for immortality. James says\nthat my belief that this is borderline survival does not forbid me\nfrom believing that it is survival. Whether I exercise this\nprerogative depends on my temperament. Since momentous borderline\ncases are so prevalent in speculative matters, much philosophical\ndisagreement is a matter of personality differences.\n\nThe Clifford drop into agnosticism is especially quick for those who\nbelieve that evidence supports a unique judgment. A detective who\nthinks the evidence shows Gray is a murderer cannot concede that the\nevidence equally permits the judgment that Gray is not a murderer. If\nthe detective concedes that Gray’s act is borderline murder,\nthen he cannot shed the hedge and believe the act is murder.\n\nIn the case of relative borderline cases, the hedge can be shed by the\ndiscovery of a novel species of evidence. Murder inquiries were\nsometimes inconclusive because the suspect had an identical twin.\nAfter detectives learned that identical twins have distinct\nfingerprints, some of these borderline cases became decidable.\nPresently, there are some borderline cases arising from the extreme\nsimilarity in DNA between identical twins. Soon, geneticists will be\nable to reliably discern the slight differences between twin DNA that\narise from mutations.\n\nNews of an alternative sense is like news of an alternative spelling;\nthere is no evidential impact (except for meta-linguistic beliefs\nabout the nature of words). Your assertion that ‘All bachelors\nare men’ is robust with respect to the news that\n‘bachelor’ has an alternative sense in which it means a\nmale seal. Assertions are not robust with respect to news of hidden\ngenerality. If a South African girl says ‘No elephant can be\ndomesticated’ but learns there is another species of elephant\nindigenous to Asia, she will lose some confidence; maybe Asian\nelephants can be domesticated. News of hidden generality has\nevidential impact. When it comes to robustness, vagueness resembles\ngenerality more than vagueness resembles ambiguity.\n\nMathematical terms such as ‘prime number’ show that a term\ncan be general without being vague. A term can also be vague without\nbeing general. Borderline cases of analytically empty predicates\nillustrate this possibility.\n\nGenerality is obviously useful. Often, lessons about a particular\n\\(F\\) can be projected to other \\(F\\)s in virtue of their common\n\\(F\\)-ness. When a girl learns that her cat has a nictitating\nmembrane that protects its eyes, she rightly expects that her\nneighbor’s cat also has a nictitating membrane. Generality saves\nlabor. When the girl says that she wants a toy rather than clothes,\nshe narrows the range of acceptable gifts without going through the\ntrouble of specifying a particular gift. The girl also balances\nvalues: a gift should be intrinsically desired and yet also be a\nsurprise. If uncertain about which channel is the weather channel, she\ncan hedge by describing the channel as ‘forty-something’.\nThere is an inverse relationship between the contentfulness of a\nproposition and its probability: the more specific a claim, the less\nlikely it is to be true. By gauging generality, we can make sensible\ntrade-offs between truth and detail.\n\n‘Vague’ has a sense that is synonymous with abnormal\ngenerality. This precipitates many equivocal explanations of\nvagueness. For instance, many commentators say that vagueness exists\nbecause broad categories ease the task of classification. If I can\ndescribe your sweater as red, then I do not need to ascertain whether\nit is scarlet. This freedom to use wide intervals obviously helps us\nto learn, teach, communicate, and remember. But so what? The problem\nis to explain the existence of borderline cases. Are they present\nbecause vagueness serves a function? Or are borderline cases\nside-effects of ordinary conversation—like the echoes indoor\nlisteners learn to ignore?\n\nEvery natural language is both vague and ambiguous. However, both\nfeatures seem eliminable. Indeed, both are eliminated in miniature\nlanguages such as checkers notation, computer programming languages,\nand mathematical descriptions. Moreover, it seems that both vagueness\nand ambiguity ought to be minimized. ‘Vague’ and\n‘ambiguous’ are pejorative terms. And they deserve their\nbad reputations. Think of all the automotive misery that has been\nprefaced by\n\nDriver: Do I turn left?\n\nPassenger: Right.\n\n\nEnglish can be lethal. Philosophers have long motivated appeals for an\nideal language by pointing out how ambiguity creates the menace of\nequivocation:\n\nNo child should work.\n\nEvery person is a child of someone.\n\nTherefore, no one should work.\n\n\nHappily, we know how to criticize and correct all equivocations.\nIndeed, every natural language is self-disambiguating in the sense\nthat each has all the resources needed to uniquely specify any reading\none desires.\n",
    "section_title": "2. Comparison with Ambiguity and Generality",
    "entry_title": "Vagueness",
    "hierarchy_title": "Vagueness || Comparison with Ambiguity and Generality",
    "tokenized_text": [
        "comparison",
        "ambiguity",
        "generality",
        "comparison",
        "ambiguity",
        "generality",
        "tall",
        "relative",
        "meter",
        "pygmy",
        "tall",
        "pygmy",
        "meter",
        "masai",
        "tall",
        "masai",
        "although",
        "relativization",
        "disambiguates",
        "eliminate",
        "borderline",
        "case",
        "shorter",
        "pygmy",
        "borderline",
        "tall",
        "pygmy",
        "taller",
        "masai",
        "borderline",
        "tall",
        "masai",
        "direct",
        "bearer",
        "vagueness",
        "word",
        "full",
        "disambiguation",
        "tall",
        "eighteenthcentury",
        "french",
        "man",
        "word",
        "vague",
        "indirectly",
        "virtue",
        "sense",
        "vague",
        "contrast",
        "ambiguous",
        "word",
        "bear",
        "ambiguity",
        "directlysimply",
        "virtue",
        "multiple",
        "meaning",
        "contrast",
        "vagueness",
        "ambiguity",
        "obscured",
        "fact",
        "word",
        "vague",
        "ambiguous",
        "child",
        "ambiguous",
        "offspring",
        "immature",
        "offspring",
        "latter",
        "reading",
        "child",
        "vague",
        "borderline",
        "case",
        "immature",
        "offspring",
        "contrast",
        "complicated",
        "fact",
        "word",
        "also",
        "general",
        "instance",
        "child",
        "cover",
        "boy",
        "girl",
        "ambiguity",
        "vagueness",
        "also",
        "contrast",
        "respect",
        "speaker",
        "discretion",
        "word",
        "ambiguous",
        "speaker",
        "resolve",
        "ambiguity",
        "without",
        "departing",
        "literal",
        "usage",
        "instance",
        "declare",
        "meant",
        "child",
        "express",
        "concept",
        "immature",
        "offspring",
        "word",
        "vague",
        "speaker",
        "resolve",
        "borderline",
        "case",
        "instance",
        "speaker",
        "make",
        "child",
        "literally",
        "mean",
        "anyone",
        "eighteen",
        "intending",
        "concept",
        "menu",
        "corresponding",
        "child",
        "would",
        "understood",
        "taking",
        "special",
        "liberty",
        "term",
        "suit",
        "special",
        "purpose",
        "acknowledging",
        "departure",
        "ordinary",
        "usage",
        "would",
        "relieve",
        "obligation",
        "defend",
        "sharp",
        "cutoff",
        "movie",
        "director",
        "alfred",
        "hitchcock",
        "mused",
        "actor",
        "child",
        "taking",
        "liberty",
        "clear",
        "negative",
        "case",
        "child",
        "rather",
        "borderline",
        "case",
        "aptness",
        "generalization",
        "judged",
        "literal",
        "truthvalue",
        "obviously",
        "untrue",
        "likewise",
        "judge",
        "precisifications",
        "borderline",
        "case",
        "truthvalues",
        "obviously",
        "ascertainable",
        "true",
        "false",
        "instead",
        "judge",
        "precisifications",
        "simplicity",
        "conservativeness",
        "fruitfulness",
        "precisification",
        "draw",
        "line",
        "across",
        "borderline",
        "case",
        "conserve",
        "paradigm",
        "usage",
        "one",
        "draw",
        "line",
        "across",
        "clear",
        "case",
        "conservatism",
        "one",
        "desideratum",
        "among",
        "many",
        "sometimes",
        "best",
        "balance",
        "achieved",
        "cost",
        "turning",
        "former",
        "positive",
        "case",
        "negative",
        "case",
        "shift",
        "literal",
        "figurative",
        "usage",
        "gain",
        "fictive",
        "control",
        "entire",
        "vocabularynot",
        "vague",
        "word",
        "travel",
        "agent",
        "say",
        "france",
        "hexagon",
        "infer",
        "committed",
        "geometrical",
        "error",
        "classifying",
        "france",
        "sixsided",
        "polygon",
        "instead",
        "interpret",
        "travel",
        "agent",
        "speaking",
        "figuratively",
        "meaning",
        "france",
        "shaped",
        "like",
        "hexagon",
        "similarly",
        "travel",
        "agent",
        "say",
        "reno",
        "biggest",
        "little",
        "city",
        "interpret",
        "overlooking",
        "vagueness",
        "little",
        "city",
        "us",
        "obvious",
        "falsehood",
        "france",
        "hexagon",
        "signal",
        "metaphor",
        "us",
        "obvious",
        "indeterminacy",
        "reno",
        "biggest",
        "little",
        "city",
        "signal",
        "hyperbole",
        "given",
        "speaker",
        "lack",
        "literal",
        "discretion",
        "vague",
        "term",
        "ought",
        "chide",
        "indecisiveness",
        "decision",
        "made",
        "scope",
        "vice",
        "speaker",
        "would",
        "literal",
        "discretion",
        "statement",
        "applying",
        "predicate",
        "borderline",
        "case",
        "permissible",
        "variation",
        "linguistic",
        "usage",
        "sake",
        "comparison",
        "consider",
        "discretion",
        "alternative",
        "spelling",
        "professor",
        "letterman",
        "us",
        "judgment",
        "instead",
        "judgement",
        "want",
        "promote",
        "principle",
        "silent",
        "e",
        "signal",
        "long",
        "vowel",
        "still",
        "fond",
        "memory",
        "tom",
        "lehrer",
        "child",
        "song",
        "silent",
        "e",
        "turn",
        "cane",
        "turn",
        "pan",
        "pane",
        "hard",
        "see",
        "silent",
        "e",
        "turn",
        "cub",
        "cube",
        "turn",
        "tub",
        "tube",
        "elementary",
        "silent",
        "e",
        "professor",
        "letterman",
        "disapproves",
        "add",
        "misleading",
        "e",
        "concedes",
        "judgement",
        "permissible",
        "spelling",
        "penalize",
        "student",
        "misspelling",
        "make",
        "hardhearted",
        "choice",
        "judgement",
        "indeed",
        "professor",
        "letterman",
        "scold",
        "student",
        "fail",
        "stick",
        "spelling",
        "throughout",
        "composition",
        "choose",
        "stick",
        "choice",
        "professor",
        "letterman",
        "assertion",
        "word",
        "favorite",
        "mental",
        "act",
        "spelled",
        "judgment",
        "robust",
        "respect",
        "news",
        "also",
        "spelled",
        "judgement",
        "would",
        "continue",
        "assert",
        "conjoin",
        "original",
        "assertion",
        "information",
        "alternative",
        "word",
        "favorite",
        "mental",
        "act",
        "spelled",
        "judgment",
        "also",
        "spelled",
        "judgement",
        "contrast",
        "professor",
        "letterman",
        "assertion",
        "martha",
        "woman",
        "robust",
        "respect",
        "news",
        "martha",
        "borderline",
        "case",
        "woman",
        "say",
        "letterman",
        "learns",
        "martha",
        "younger",
        "look",
        "new",
        "information",
        "would",
        "lead",
        "letterman",
        "retract",
        "assertion",
        "favor",
        "hedged",
        "remark",
        "martha",
        "might",
        "woman",
        "martha",
        "might",
        "woman",
        "professor",
        "letterman",
        "loss",
        "confidence",
        "hard",
        "explain",
        "information",
        "borderline",
        "status",
        "simply",
        "news",
        "different",
        "permissible",
        "way",
        "describing",
        "discovery",
        "notational",
        "variant",
        "warrant",
        "change",
        "former",
        "belief",
        "news",
        "borderline",
        "status",
        "evidential",
        "character",
        "loss",
        "clarity",
        "brings",
        "loss",
        "warrant",
        "lower",
        "confidence",
        "open",
        "charge",
        "dogmatism",
        "concede",
        "ferry",
        "borderline",
        "case",
        "seaworthy",
        "concede",
        "know",
        "ship",
        "seaworthy",
        "debate",
        "dissolved",
        "showing",
        "dispute",
        "absolute",
        "borderline",
        "case",
        "debater",
        "become",
        "agnostic",
        "license",
        "form",
        "belief",
        "beyond",
        "evidence",
        "ferry",
        "borderline",
        "seaworthy",
        "free",
        "believe",
        "seaworthy",
        "according",
        "w",
        "k",
        "clifford",
        "belief",
        "beyond",
        "evidence",
        "always",
        "morally",
        "forbidden",
        "irrational",
        "william",
        "james",
        "countered",
        "belief",
        "beyond",
        "evidence",
        "permissible",
        "forced",
        "momentous",
        "live",
        "option",
        "survive",
        "destruction",
        "body",
        "simply",
        "virtue",
        "strong",
        "psychological",
        "resemblance",
        "future",
        "person",
        "answer",
        "affect",
        "prospect",
        "immortality",
        "james",
        "say",
        "belief",
        "borderline",
        "survival",
        "forbid",
        "believing",
        "survival",
        "whether",
        "exercise",
        "prerogative",
        "depends",
        "temperament",
        "since",
        "momentous",
        "borderline",
        "case",
        "prevalent",
        "speculative",
        "matter",
        "much",
        "philosophical",
        "disagreement",
        "matter",
        "personality",
        "difference",
        "clifford",
        "drop",
        "agnosticism",
        "especially",
        "quick",
        "believe",
        "evidence",
        "support",
        "unique",
        "judgment",
        "detective",
        "think",
        "evidence",
        "show",
        "gray",
        "murderer",
        "concede",
        "evidence",
        "equally",
        "permit",
        "judgment",
        "gray",
        "murderer",
        "detective",
        "concedes",
        "gray",
        "act",
        "borderline",
        "murder",
        "shed",
        "hedge",
        "believe",
        "act",
        "murder",
        "case",
        "relative",
        "borderline",
        "case",
        "hedge",
        "shed",
        "discovery",
        "novel",
        "specie",
        "evidence",
        "murder",
        "inquiry",
        "sometimes",
        "inconclusive",
        "suspect",
        "identical",
        "twin",
        "detective",
        "learned",
        "identical",
        "twin",
        "distinct",
        "fingerprint",
        "borderline",
        "case",
        "became",
        "decidable",
        "presently",
        "borderline",
        "case",
        "arising",
        "extreme",
        "similarity",
        "dna",
        "identical",
        "twin",
        "soon",
        "geneticist",
        "able",
        "reliably",
        "discern",
        "slight",
        "difference",
        "twin",
        "dna",
        "arise",
        "mutation",
        "news",
        "alternative",
        "sense",
        "like",
        "news",
        "alternative",
        "spelling",
        "evidential",
        "impact",
        "except",
        "metalinguistic",
        "belief",
        "nature",
        "word",
        "assertion",
        "bachelor",
        "men",
        "robust",
        "respect",
        "news",
        "bachelor",
        "alternative",
        "sense",
        "mean",
        "male",
        "seal",
        "assertion",
        "robust",
        "respect",
        "news",
        "hidden",
        "generality",
        "south",
        "african",
        "girl",
        "say",
        "elephant",
        "domesticated",
        "learns",
        "another",
        "specie",
        "elephant",
        "indigenous",
        "asia",
        "lose",
        "confidence",
        "maybe",
        "asian",
        "elephant",
        "domesticated",
        "news",
        "hidden",
        "generality",
        "evidential",
        "impact",
        "come",
        "robustness",
        "vagueness",
        "resembles",
        "generality",
        "vagueness",
        "resembles",
        "ambiguity",
        "mathematical",
        "term",
        "prime",
        "number",
        "show",
        "term",
        "general",
        "without",
        "vague",
        "term",
        "also",
        "vague",
        "without",
        "general",
        "borderline",
        "case",
        "analytically",
        "empty",
        "predicate",
        "illustrate",
        "possibility",
        "generality",
        "obviously",
        "useful",
        "often",
        "lesson",
        "particular",
        "f",
        "projected",
        "f",
        "virtue",
        "common",
        "f",
        "ness",
        "girl",
        "learns",
        "cat",
        "nictitating",
        "membrane",
        "protects",
        "eye",
        "rightly",
        "expects",
        "neighbor",
        "cat",
        "also",
        "nictitating",
        "membrane",
        "generality",
        "save",
        "labor",
        "girl",
        "say",
        "want",
        "toy",
        "rather",
        "clothes",
        "narrow",
        "range",
        "acceptable",
        "gift",
        "without",
        "going",
        "trouble",
        "specifying",
        "particular",
        "gift",
        "girl",
        "also",
        "balance",
        "value",
        "gift",
        "intrinsically",
        "desired",
        "yet",
        "also",
        "surprise",
        "uncertain",
        "channel",
        "weather",
        "channel",
        "hedge",
        "describing",
        "channel",
        "fortysomething",
        "inverse",
        "relationship",
        "contentfulness",
        "proposition",
        "probability",
        "specific",
        "claim",
        "le",
        "likely",
        "true",
        "gauging",
        "generality",
        "make",
        "sensible",
        "tradeoff",
        "truth",
        "detail",
        "vague",
        "sense",
        "synonymous",
        "abnormal",
        "generality",
        "precipitate",
        "many",
        "equivocal",
        "explanation",
        "vagueness",
        "instance",
        "many",
        "commentator",
        "say",
        "vagueness",
        "exists",
        "broad",
        "category",
        "ease",
        "task",
        "classification",
        "describe",
        "sweater",
        "red",
        "need",
        "ascertain",
        "whether",
        "scarlet",
        "freedom",
        "use",
        "wide",
        "interval",
        "obviously",
        "help",
        "u",
        "learn",
        "teach",
        "communicate",
        "remember",
        "problem",
        "explain",
        "existence",
        "borderline",
        "case",
        "present",
        "vagueness",
        "serf",
        "function",
        "borderline",
        "case",
        "sideeffects",
        "ordinary",
        "conversationlike",
        "echo",
        "indoor",
        "listener",
        "learn",
        "ignore",
        "every",
        "natural",
        "language",
        "vague",
        "ambiguous",
        "however",
        "feature",
        "seem",
        "eliminable",
        "indeed",
        "eliminated",
        "miniature",
        "language",
        "checker",
        "notation",
        "computer",
        "programming",
        "language",
        "mathematical",
        "description",
        "moreover",
        "seems",
        "vagueness",
        "ambiguity",
        "ought",
        "minimized",
        "vague",
        "ambiguous",
        "pejorative",
        "term",
        "deserve",
        "bad",
        "reputation",
        "think",
        "automotive",
        "misery",
        "prefaced",
        "driver",
        "turn",
        "left",
        "passenger",
        "right",
        "english",
        "lethal",
        "philosopher",
        "long",
        "motivated",
        "appeal",
        "ideal",
        "language",
        "pointing",
        "ambiguity",
        "creates",
        "menace",
        "equivocation",
        "child",
        "work",
        "every",
        "person",
        "child",
        "someone",
        "therefore",
        "one",
        "work",
        "happily",
        "know",
        "criticize",
        "correct",
        "equivocation",
        "indeed",
        "every",
        "natural",
        "language",
        "selfdisambiguating",
        "sense",
        "resource",
        "needed",
        "uniquely",
        "specify",
        "reading",
        "one",
        "desire"
    ]
}