{
    "main_text": "The Nature of Vaihinger’s Fictionalism\n5. The Nature of Vaihinger’s Fictionalism\n\n\nCentral to Vaihinger’s project in the PAO is a\ndistinction between two sorts of fictions: (1) what he (somewhat\ninaptly) terms ‘semi-fictions,’ which are “methods\nand concepts based upon a simple deviation from reality”\n(PAO 59); and (2) ‘real’ or ‘genuine\nfictions’ which are self-contradictory concepts\n(ibid.).  In other words, semi-fictions are statements or propositions\nthat happen not to correspond to the world; genuine fictions are those\nthat claim something impossible about the world.\n\n\nAn important example the first kind is what Vaihinger calls the\n“abstractive” or “neglective” fiction\n(PAO, 14–17, 140–41). Such fictions are roughly\nwhat we have in mind today when we speak of ‘idealized\nmodels’ (contemporary philosophers of science sometimes\ndistinguish further between “Aristotelian” and\n“Galilean” methods of idealization. See the article on\nModels in Science. Vaihinger does not clearly distinguish these). A\nstandard example is the model of the planetary system given in\nclassical mechanics:\n\n\n\nIn physics we find such a fiction in the fact that masses of\nundeniable extension, e.g., the sun and the earth, in connection with\nthe derivation of certain basic concepts of mechanics and the\ncalculation of their reciprocal attraction are reduced to points or\nconcentrated into points (gravitational points) in order, by means of\nthis fiction, to facilitate the presentation of the more composite\nphenomena. Such a neglect of elements is especially resorted to where\na very small factor is assumed to be zero. (PAO \n16)\n\n\nThe idea is familiar. If what we are interested in is determining\nthe trajectory and velocity of the planets around the Sun, then it is\nuseful to ignore or iron-out a wide variety of features of the system,\ne.g., the size of the planets, the presence of friction, the\ngravitational pull that the planets and their moons exert on one\nanother. Here, then, we evidently have a clear-cut case in which\n“pretending” that certain things are true of the solar\nsystem can greatly aid our aim of prediction. As Vaihinger notes, we\nget the “right” results here because the properties of the\nsystem we are ignoring have only a negligible influence on the\nphenomena we are interested in studying. The solar system behaves\nnearly just as it would if the planets were\nmass points, etc. This suggests a counterfactual understanding of\nfictions: by reasoning from assumptions that are false—sometimes\nradically false—at the actual world, we may still arrive at\nconclusions that are true, or quite nearly true, at the actual world.\nIf those results are arrived at more efficiently by entertaining the\nfiction, then the fiction is justified.\n\n\nIf this is Vaihinger’s view, however, it would appear to face a\nserious difficulty. For, his main interest is in the so-called\n“real fictions,” which, as noted above, are not merely\nfalse, but contradictory. Since everything follows from a\ncontradiction, any counterfactual whose antecedent is a real fiction\nwill be trivially true, and this is to say they cannot possibly do the\nwork Vaihinger envisions (Appiah 2017, 11; Cohen 1923, 485). One way to\nrespond, here, is to note that the logic with which Vaihinger operates\nis still essentially the version of Aristotelian logic found in Kant\nand throughout much of the nineteenth century. Such\npre-twentieth-century logics often implicitly reject the principle\nex contradictione quodlibet. See, e.g., the discussion of\nconditionals in the influential Port-Royal Logic (Arnauld and\nNicole 1996, 100).\n\n\nRelatedly, but from a more contemporary perspective, one might read\nVaihinger as anticipating some recent views on counterpossible\nreasoning (Pollard 2010). Consider the following counterfactual\nconditionals:\n\n(1)\nIf Fermat’s last theorem were false, then\n      no argument for it would be sound.\n(2)\nIf Fermat’s last theorem were false, then\n      Andrew Wiles would deserve eternal fame.\n(3)\nIf intuitionistic logic were correct, then the Law\n      of Excluded Middle would fail.\n(4)\nIf intuitionistic logic were correct, then the Law\n      of Excluded Middle would hold.\n\n\n\nIntuitively, (1) and (3) are true while (2) and (4) are false.\nMoreover, someone who rejects intuitionism might well wish to\nargue against intuitionism by relying on something like (3),\neven though what the antecedent states is, by her lights, impossible.\nThese facts have led some to suppose that (1) and (3) are not merely\ntrue, but non-trivially true (for more on these sorts of arguments, see\nthe entry for Impossible Worlds). Vaihinger’s fictionalism might\nthus be read as adding a heap of substantive examples to the list of\nalleged non-trivial counterpossible conditionals.\n\n\nThis sort of reading seems supported by examples that Vaihinger\nhimself gives, and the theory of “fictive judgments” he\nbases on them. One of Vaihinger’s favorite examples is:\n\n(5)\nIf the circle were a polygon, then it would be\n      subject to the laws of rectilinear figures. (PAO,\n      193)\n\n\n\nThough (5)’s antecedent and consequent both state something\nimpossible, Vaihinger contends it forms the basis of\nArchimedes’s proof of the area of a circle using the method of\nexhaustion (PAO 177). Here, then, is a case in which a proof\nno one would wish to call trivial allegedly proceeds from a\ncontradictory assumption. Generalizing, Vaihinger claims, “in a\nhypothetical connection [sc. conditional proposition], not only real\nand possible but also unreal and impossible things can be introduced,\nbecause it is merely the connection between the two presuppositions\nand not their actual reality that is being expressed”\n(PAO 193–94).\n\n\nAnthony Appiah rejects this kind of interpretation, on the grounds\nthat such counterpossibles are unintelligible (2017, 11–17; cf.\nWilholt 2014, 112). Instead, he suggests Vaihinger’s talk of\nuseful contradictions is more fruitfully understood as referring to\nthe use of multiple mutually incompatible models. In particular, the\npoint is that we may find it useful to regard certain phenomena in one\nway for some purposes, but in another, incompatible way for other\npurposes. Even when it turns out to be useful to combine incompatible\nmodels for understanding one and the same phenomenon (or range of\nphenomena), Appiah suggests, Vaihinger need not be committed to a\nparaconsistent logic. Rather, drawing on (Cartwright 1999), he\nsuggests that using a model does not involve drawing out each of its\nlogical implications, but instead a kind of skill of “knowing\nwhich lines of inference one should and which one should not\nfollow” (2017, 13). Moreover, because our main aim in using\nmodels is not ultimately to obtain the truth about the physical world,\nbut to get around in it, there is no reason to avoid such\ninconsistency (2017, 14–17).\n\n\nAppiah’s interpretation allows those who are wary of\nparaconsistent logics to salvage something philosophically promising\nfrom Vaihinger’s talk of contradictions. It also perhaps has the\nadvantage of doing greater justice to the multifarious character of\nVaihinger’s theory of fictions. For, while Vaihinger claims that\nthe fictive judgment has a “hypothetical element,” he does\nnot simply reduce fictive judgments to conditionals (PAO\n194).  On the other hand, the interpretation stumbles against texts in\nwhich Vaihinger suggests that the contradictions of real fictions\nexist\nwithin theories or models, not between them. For example, the\nconcept of a (classical) atom is supposed to be a real fiction because\nit is absurd to suppose something which occupies space, but\nnevertheless has no extension. This is to say that the atomistic\nfiction is itself contradictory, not merely that it conflicts with\nother ways of modeling matter. Another way of putting the worry is to\nnote that the interpretation blurs the apparently sharp distinction\nbetween semi-fictions and real fictions: any model will be a real\nfiction as long as we use it together with another model incompatible\nwith it.\n\n\nFor yet another approach, which denies that Vaihinger has or needs a\ngeneral account of how contradictory fictions can be fruitful, see\n(Fine 1993, 9–11). On this reading, Vaihinger is interested only\nin surveying actual scientific practice, and revealing that, as a\nmatter of fact, it does make fruitful use of real fictions;\nthe question of how this is possible is beside the point. There is\nsomething to this characterization of Vaihinger’s procedure,\nwhich trades more in examples than in general pronouncements. However,\nit will also be difficult for proponents of this reading to explain\npassages like these: “This purpose [of thought] can only be that\nof facilitating conceptual activity, of effecting a safe and rapid\nconnection of sensations. What we have to show, therefore, is\nhow fictional methods and constructs render this\npossible” (PAO 52, emphasis added); “the\nphilosophy of as if shows that and why these false and\ncontradictory representations are still useful” (1921a, 532,\nemphasis added). Here, Vaihinger seems to indicate that his purpose is\nnot just to enumerate instances of useful fictions, but to explain how\nand why they are useful.\n\n\nIn addition to Vaihinger’s specific analysis of fictions, one\nmight wonder about his precise brand of fictionalism. Contemporary\nphilosophers distinguish between “hermeneutic\nfictionalism” and “revolutionary fictionalism” (see\nthe entry on Fictionalism). Hermeneutic fictionalism holds that\ncertain domains of discourse are fictional, in the sense that\ntheir participants are not aiming at literal truth, but only seeming\nto do so. Some textual evidence speaks in favor of reading Vaihinger\nas a hermeneutic fictionalist. For example, he writes: “the\naxiom and the hypothesis … endeavor to be expressions of\nreality. The fiction, on the other hand, is not such an expression nor\ndoes it claim to be one” (PAO 60). And\nVaihinger’s theory of the fictive judgment maintains that many\njudgements of the syntactic form ‘A is B’ are\nproperly analyzed as, or merely elliptical for, ‘A is to be\nregarded as if it were B’—“the\n‘is’ is a very short abbreviation for an exceedingly\ncomplicated train of thought” (PAO 195). On the other\nhand, in many places Vaihinger clearly indicates that he thinks we\noften treat what would be better regarded as fictional discourse as\naiming at truth. Many disputes, he suggests, can be resolved by\nreinterpreting such discourse fictionally. Thus, for example,\nproponents of classical atomism have been wrong to think that their\ntheory is true, but their opponents have also been wrong to believe\nthat the theory should therefore be given up (PAO 53). He\nmakes an analogous point about the dispute between substantivalists\nand relationalists over the nature of space (PAO\n170–71). So, Vaihinger appears to be a revolutionary\nfictionalist at least about some discourses in which he is\ninterested.\n",
    "section_title": "5. The Nature of Vaihinger’s Fictionalism",
    "entry_title": "Hans Vaihinger",
    "hierarchy_title": "Hans Vaihinger || The Nature of Vaihinger’s Fictionalism",
    "tokenized_text": [
        "nature",
        "vaihinger",
        "fictionalism",
        "nature",
        "vaihinger",
        "fictionalism",
        "central",
        "vaihinger",
        "project",
        "pao",
        "distinction",
        "two",
        "sort",
        "fiction",
        "somewhat",
        "inaptly",
        "term",
        "semifictions",
        "method",
        "concept",
        "based",
        "upon",
        "simple",
        "deviation",
        "reality",
        "pao",
        "real",
        "genuine",
        "fiction",
        "selfcontradictory",
        "concept",
        "ibid",
        "word",
        "semifictions",
        "statement",
        "proposition",
        "happen",
        "correspond",
        "world",
        "genuine",
        "fiction",
        "claim",
        "something",
        "impossible",
        "world",
        "important",
        "example",
        "first",
        "kind",
        "vaihinger",
        "call",
        "abstractive",
        "neglective",
        "fiction",
        "pao",
        "fiction",
        "roughly",
        "mind",
        "today",
        "speak",
        "idealized",
        "model",
        "contemporary",
        "philosopher",
        "science",
        "sometimes",
        "distinguish",
        "aristotelian",
        "galilean",
        "method",
        "idealization",
        "see",
        "article",
        "model",
        "science",
        "vaihinger",
        "clearly",
        "distinguish",
        "standard",
        "example",
        "model",
        "planetary",
        "system",
        "given",
        "classical",
        "mechanic",
        "physic",
        "find",
        "fiction",
        "fact",
        "mass",
        "undeniable",
        "extension",
        "eg",
        "sun",
        "earth",
        "connection",
        "derivation",
        "certain",
        "basic",
        "concept",
        "mechanic",
        "calculation",
        "reciprocal",
        "attraction",
        "reduced",
        "point",
        "concentrated",
        "point",
        "gravitational",
        "point",
        "order",
        "mean",
        "fiction",
        "facilitate",
        "presentation",
        "composite",
        "phenomenon",
        "neglect",
        "element",
        "especially",
        "resorted",
        "small",
        "factor",
        "assumed",
        "zero",
        "pao",
        "idea",
        "familiar",
        "interested",
        "determining",
        "trajectory",
        "velocity",
        "planet",
        "around",
        "sun",
        "useful",
        "ignore",
        "ironout",
        "wide",
        "variety",
        "feature",
        "system",
        "eg",
        "size",
        "planet",
        "presence",
        "friction",
        "gravitational",
        "pull",
        "planet",
        "moon",
        "exert",
        "one",
        "another",
        "evidently",
        "clearcut",
        "case",
        "pretending",
        "certain",
        "thing",
        "true",
        "solar",
        "system",
        "greatly",
        "aid",
        "aim",
        "prediction",
        "vaihinger",
        "note",
        "get",
        "right",
        "result",
        "property",
        "system",
        "ignoring",
        "negligible",
        "influence",
        "phenomenon",
        "interested",
        "studying",
        "solar",
        "system",
        "behaves",
        "nearly",
        "would",
        "planet",
        "mass",
        "point",
        "etc",
        "suggests",
        "counterfactual",
        "understanding",
        "fiction",
        "reasoning",
        "assumption",
        "falsesometimes",
        "radically",
        "falseat",
        "actual",
        "world",
        "may",
        "still",
        "arrive",
        "conclusion",
        "true",
        "quite",
        "nearly",
        "true",
        "actual",
        "world",
        "result",
        "arrived",
        "efficiently",
        "entertaining",
        "fiction",
        "fiction",
        "justified",
        "vaihinger",
        "view",
        "however",
        "would",
        "appear",
        "face",
        "serious",
        "difficulty",
        "main",
        "interest",
        "socalled",
        "real",
        "fiction",
        "noted",
        "merely",
        "false",
        "contradictory",
        "since",
        "everything",
        "follows",
        "contradiction",
        "counterfactual",
        "whose",
        "antecedent",
        "real",
        "fiction",
        "trivially",
        "true",
        "say",
        "possibly",
        "work",
        "vaihinger",
        "envisions",
        "appiah",
        "cohen",
        "one",
        "way",
        "respond",
        "note",
        "logic",
        "vaihinger",
        "operates",
        "still",
        "essentially",
        "version",
        "aristotelian",
        "logic",
        "found",
        "kant",
        "throughout",
        "much",
        "nineteenth",
        "century",
        "pretwentiethcentury",
        "logic",
        "often",
        "implicitly",
        "reject",
        "principle",
        "ex",
        "contradictione",
        "quodlibet",
        "see",
        "eg",
        "discussion",
        "conditionals",
        "influential",
        "portroyal",
        "logic",
        "arnauld",
        "nicole",
        "relatedly",
        "contemporary",
        "perspective",
        "one",
        "might",
        "read",
        "vaihinger",
        "anticipating",
        "recent",
        "view",
        "counterpossible",
        "reasoning",
        "pollard",
        "consider",
        "following",
        "counterfactual",
        "conditionals",
        "fermat",
        "last",
        "theorem",
        "false",
        "argument",
        "would",
        "sound",
        "fermat",
        "last",
        "theorem",
        "false",
        "andrew",
        "wile",
        "would",
        "deserve",
        "eternal",
        "fame",
        "intuitionistic",
        "logic",
        "correct",
        "law",
        "excluded",
        "middle",
        "would",
        "fail",
        "intuitionistic",
        "logic",
        "correct",
        "law",
        "excluded",
        "middle",
        "would",
        "hold",
        "intuitively",
        "true",
        "false",
        "moreover",
        "someone",
        "reject",
        "intuitionism",
        "might",
        "well",
        "wish",
        "argue",
        "intuitionism",
        "relying",
        "something",
        "like",
        "even",
        "though",
        "antecedent",
        "state",
        "light",
        "impossible",
        "fact",
        "led",
        "suppose",
        "merely",
        "true",
        "nontrivially",
        "true",
        "sort",
        "argument",
        "see",
        "entry",
        "impossible",
        "world",
        "vaihinger",
        "fictionalism",
        "might",
        "thus",
        "read",
        "adding",
        "heap",
        "substantive",
        "example",
        "list",
        "alleged",
        "nontrivial",
        "counterpossible",
        "conditionals",
        "sort",
        "reading",
        "seems",
        "supported",
        "example",
        "vaihinger",
        "give",
        "theory",
        "fictive",
        "judgment",
        "base",
        "one",
        "vaihinger",
        "favorite",
        "example",
        "circle",
        "polygon",
        "would",
        "subject",
        "law",
        "rectilinear",
        "figure",
        "pao",
        "though",
        "antecedent",
        "consequent",
        "state",
        "something",
        "impossible",
        "vaihinger",
        "contends",
        "form",
        "basis",
        "archimedes",
        "proof",
        "area",
        "circle",
        "using",
        "method",
        "exhaustion",
        "pao",
        "case",
        "proof",
        "one",
        "would",
        "wish",
        "call",
        "trivial",
        "allegedly",
        "proceeds",
        "contradictory",
        "assumption",
        "generalizing",
        "vaihinger",
        "claim",
        "hypothetical",
        "connection",
        "sc",
        "conditional",
        "proposition",
        "real",
        "possible",
        "also",
        "unreal",
        "impossible",
        "thing",
        "introduced",
        "merely",
        "connection",
        "two",
        "presupposition",
        "actual",
        "reality",
        "expressed",
        "pao",
        "anthony",
        "appiah",
        "reject",
        "kind",
        "interpretation",
        "ground",
        "counterpossibles",
        "unintelligible",
        "cf",
        "wilholt",
        "instead",
        "suggests",
        "vaihinger",
        "talk",
        "useful",
        "contradiction",
        "fruitfully",
        "understood",
        "referring",
        "use",
        "multiple",
        "mutually",
        "incompatible",
        "model",
        "particular",
        "point",
        "may",
        "find",
        "useful",
        "regard",
        "certain",
        "phenomenon",
        "one",
        "way",
        "purpose",
        "another",
        "incompatible",
        "way",
        "purpose",
        "even",
        "turn",
        "useful",
        "combine",
        "incompatible",
        "model",
        "understanding",
        "one",
        "phenomenon",
        "range",
        "phenomenon",
        "appiah",
        "suggests",
        "vaihinger",
        "need",
        "committed",
        "paraconsistent",
        "logic",
        "rather",
        "drawing",
        "cartwright",
        "suggests",
        "using",
        "model",
        "involve",
        "drawing",
        "logical",
        "implication",
        "instead",
        "kind",
        "skill",
        "knowing",
        "line",
        "inference",
        "one",
        "one",
        "follow",
        "moreover",
        "main",
        "aim",
        "using",
        "model",
        "ultimately",
        "obtain",
        "truth",
        "physical",
        "world",
        "get",
        "around",
        "reason",
        "avoid",
        "inconsistency",
        "appiah",
        "interpretation",
        "allows",
        "wary",
        "paraconsistent",
        "logic",
        "salvage",
        "something",
        "philosophically",
        "promising",
        "vaihinger",
        "talk",
        "contradiction",
        "also",
        "perhaps",
        "advantage",
        "greater",
        "justice",
        "multifarious",
        "character",
        "vaihinger",
        "theory",
        "fiction",
        "vaihinger",
        "claim",
        "fictive",
        "judgment",
        "hypothetical",
        "element",
        "simply",
        "reduce",
        "fictive",
        "judgment",
        "conditionals",
        "pao",
        "hand",
        "interpretation",
        "stumble",
        "text",
        "vaihinger",
        "suggests",
        "contradiction",
        "real",
        "fiction",
        "exist",
        "within",
        "theory",
        "model",
        "example",
        "concept",
        "classical",
        "atom",
        "supposed",
        "real",
        "fiction",
        "absurd",
        "suppose",
        "something",
        "occupies",
        "space",
        "nevertheless",
        "extension",
        "say",
        "atomistic",
        "fiction",
        "contradictory",
        "merely",
        "conflict",
        "way",
        "modeling",
        "matter",
        "another",
        "way",
        "putting",
        "worry",
        "note",
        "interpretation",
        "blur",
        "apparently",
        "sharp",
        "distinction",
        "semifictions",
        "real",
        "fiction",
        "model",
        "real",
        "fiction",
        "long",
        "use",
        "together",
        "another",
        "model",
        "incompatible",
        "yet",
        "another",
        "approach",
        "denies",
        "vaihinger",
        "need",
        "general",
        "account",
        "contradictory",
        "fiction",
        "fruitful",
        "see",
        "fine",
        "reading",
        "vaihinger",
        "interested",
        "surveying",
        "actual",
        "scientific",
        "practice",
        "revealing",
        "matter",
        "fact",
        "make",
        "fruitful",
        "use",
        "real",
        "fiction",
        "question",
        "possible",
        "beside",
        "point",
        "something",
        "characterization",
        "vaihinger",
        "procedure",
        "trade",
        "example",
        "general",
        "pronouncement",
        "however",
        "also",
        "difficult",
        "proponent",
        "reading",
        "explain",
        "passage",
        "like",
        "purpose",
        "thought",
        "facilitating",
        "conceptual",
        "activity",
        "effecting",
        "safe",
        "rapid",
        "connection",
        "sensation",
        "show",
        "therefore",
        "fictional",
        "method",
        "construct",
        "render",
        "possible",
        "pao",
        "emphasis",
        "added",
        "philosophy",
        "show",
        "false",
        "contradictory",
        "representation",
        "still",
        "useful",
        "a",
        "emphasis",
        "added",
        "vaihinger",
        "seems",
        "indicate",
        "purpose",
        "enumerate",
        "instance",
        "useful",
        "fiction",
        "explain",
        "useful",
        "addition",
        "vaihinger",
        "specific",
        "analysis",
        "fiction",
        "one",
        "might",
        "wonder",
        "precise",
        "brand",
        "fictionalism",
        "contemporary",
        "philosopher",
        "distinguish",
        "hermeneutic",
        "fictionalism",
        "revolutionary",
        "fictionalism",
        "see",
        "entry",
        "fictionalism",
        "hermeneutic",
        "fictionalism",
        "hold",
        "certain",
        "domain",
        "discourse",
        "fictional",
        "sense",
        "participant",
        "aiming",
        "literal",
        "truth",
        "seeming",
        "textual",
        "evidence",
        "speaks",
        "favor",
        "reading",
        "vaihinger",
        "hermeneutic",
        "fictionalist",
        "example",
        "writes",
        "axiom",
        "hypothesis",
        "endeavor",
        "expression",
        "reality",
        "fiction",
        "hand",
        "expression",
        "claim",
        "one",
        "pao",
        "vaihinger",
        "theory",
        "fictive",
        "judgment",
        "maintains",
        "many",
        "judgement",
        "syntactic",
        "form",
        "b",
        "properly",
        "analyzed",
        "merely",
        "elliptical",
        "regarded",
        "b",
        "short",
        "abbreviation",
        "exceedingly",
        "complicated",
        "train",
        "thought",
        "pao",
        "hand",
        "many",
        "place",
        "vaihinger",
        "clearly",
        "indicates",
        "think",
        "often",
        "treat",
        "would",
        "better",
        "regarded",
        "fictional",
        "discourse",
        "aiming",
        "truth",
        "many",
        "dispute",
        "suggests",
        "resolved",
        "reinterpreting",
        "discourse",
        "fictionally",
        "thus",
        "example",
        "proponent",
        "classical",
        "atomism",
        "wrong",
        "think",
        "theory",
        "true",
        "opponent",
        "also",
        "wrong",
        "believe",
        "theory",
        "therefore",
        "given",
        "pao",
        "make",
        "analogous",
        "point",
        "dispute",
        "substantivalists",
        "relationalists",
        "nature",
        "space",
        "pao",
        "vaihinger",
        "appears",
        "revolutionary",
        "fictionalist",
        "least",
        "discourse",
        "interested"
    ]
}