{
    "main_text": "The Nature of Vaihinger’s Fictionalism\n6. The As-If Philosophy and Kantianism\n\n\nThe most obvious aim of the PAO is to establish the\ncentrality of fictions to our cognitive life. But there is also a\nbroader, and in some ways more ambitious, aim to the book—to\nprovide the kind of “corrected Kantianism” Lange had tried\nto establish in the History of Materialism. As we saw above,\nVaihinger views Kant’s system as riddled with inconsistencies,\nwhich arise from the alleged fact that Kant retains certain elements\nof his pre-critical dogmatism even after adopting the critical\nstandpoint.  The As-If philosophy can be seen as an attempt to retain\nwhat Vaihinger takes to be Kant’s core philosophical insights,\nwhile removing the inconsistencies that beset the surrounding system\nin which those insights were originally couched. \n\n\nAs was noted above, a major problem for Vaihinger’s early view,\nas for many of the Neo-Kantians of his day, was the status of the thing\nin itself. Vaihinger now consistently rejects this notion, predictably\nlabelling it a fiction. Given that things in themselves are supposed to\nbe transcendent substances that causally\naffect us, this rejection follows immediately from his view\nthat the concepts of substance and cause are themselves fictions\n(PAO 55–56). True to form, however, Vaihinger still\nholds that the concept of things in themselves has some utility: as\nCohen had argued, it serves as a “limiting concept”\n(PAO 55), ensuring that we restrict our inquiries to what is\nempirically given to us. As we have seen, Vaihinger puts an\ninstrumentalist spin on this Kantian idea; all knowledge is empirical\nin the sense that our guiding cognitive aim is the prediction and\ncontrol of empirical phenomena, not correspondence to objective reality\n(though, once again, it bears emphasizing that Vaihinger does not seem\nto be claiming that such correspondence is impossible, only that it is\nincidental to our main epistemic aim).\n\n\nVaihinger’s rejection of the thing in itself is implicit in\nthe general label he gives to his own philosophical view,\n“idealistic positivism.” The ‘positivism’ here\nis in part an epistemological, and in part a metaphysical thesis. The\nepistemological thesis is that “what is given consists only of\nsensations” (PAO 124; cf. xxviii). The metaphysical\nthesis is that “what we usually term reality consists of\nour sensational contents [Empfindungsinhalte]”\n(PAO xxx, emphasis added); “Nothing exists\nexcept sensations” (PAO 44, emphasis added; cf. 1921a,\n532–33). This extreme view (for which Vaihinger does not argue)\nhas the immediate conclusion that all knowledge is of appearances,\nsince nothing exists except appearances.\n\n\nIn addition to this radical kind of empiricism, the PAO\ncontinues to uphold the broadly Kantian view that cognition is\nnecessarily limited, or, as Vaihinger sometimes puts it, that\nthere is no “identity between thought and being.” However,\nit is no longer limited in the sense of being cut off from some\ntranscendent realm of things in themselves, but in being essentially\nincomplete. The point is best appreciated by attending to another\ndistinction central to the PAO—that between\nfictions and hypotheses. Hypotheses (not to be\nconfused with so-called “hypothetical judgments”) are\njudgments that are “problematic” in form, i.e., which have\nthe form ‘it is possible that A is B’\n(where the relevant sense of possibility is epistemic). Thus, if the\njudgment ‘matter is composed of atoms’ is a hypothesis,\nthe person making it is maintaining that it may be true, and holds out\nhope that it may be confirmed or falsified in the future. By contrast,\nand as we have seen already, the fictive judgment has the form\n‘A is to be regarded as if it were B\n(when in fact A is not B).’ Since Vaihinger\nholds that such judgments can be licensed by their practical utility,\nand because it is our practical aims that ultimately guide and\nconstrain theoretical inquiry, Vaihinger infers that every theory will\nnecessarily involve some fictions; not even the best theory will\nconsist entirely of hypotheses, much less true hypotheses.\n\n\nThe distinction between hypotheses and fictions is important for\nunderstanding Vaihinger’s revised brand of Kantianism in another\nway as well. In the Dialectic, Kant had argued that dogmatic\nmetaphysics necessarily leads reason into a series of conflicts, or\n“antinomies,” with itself. It can produce, that is,\nequally valid arguments putatively establishing both that freedom\nexists and that freedom does not exist, that matter is composed of\nsimples and that matter is not composed of simples, and so on. Kant\nclaims that these conflicts are “natural” to reason, since\nreason has an innate drive to know the “unconditioned.” He\nargues, however, that these conflicts can be avoided if (and only if)\none recognizes the non-spatiotemporality of things in themselves.\nTranscendental idealism allows us to maintain that in some of the\nantinomial conflicts it is possible for both the thesis and antithesis\nto be false without contradiction, and that in others it is possible\nfor both to be true without contradiction. The critical philosophy\nthus has the distinct advantage of being able to explain how certain\napparently insoluble metaphysical debates arise, and of providing the\nonly possible resolution of those debates. Vaihinger similarly posits\na natural human tendency to confuse, not appearances and things in\nthemselves, but fictions and hypotheses. Many statements that are\nintroduced into our discourse as fictions end up being taken for\nhypotheses. And vice versa, many propositions that are originally\nintended as hypotheses are retained with mere fictional significance.\nVaihinger calls this the “law of ideational shifts”\n(Gesetz der Ideenverschiebung) (PAO 92–99).\nSeemingly intractable debates in the sciences can be resolved, he\nmaintains, by systematically recognizing this distinction. Thus, for\ninstance, certain arguments against atomism are cogent if intended to\nestablish that atomism is false (since it is contradictory);\nbut they are erroneous if intended to imply that atomism should be\nrejected. Likewise, arguments for atomism are sure to fail if they are\nmeant to establish the existence of atoms; but they are perfectly\nacceptable if they only aim to show that atomistic discourse is useful\nand indeed essential for scientific practice. For, the atomist’s\ndiscourse is best understood as a conscious fiction. As Vaihinger\nsuggests, the confusion arises from ignoring the essential practical\ndimension of thought (PAO xviii).\n\n\nHow successful is Vaihinger in resolving the alleged tensions in\nKant’s critical philosophy? On one level, straightforwardly\nrejecting things in themselves and endorsing an ontology only of\nsensations clearly avoids the supposed problem of attributing causal\nefficacy to transcendent objects. On another, however, it would appear\nthat Vaihinger cannot so easily reject things in themselves without\ncausing problems for his basic epistemological view. For one, an\nobvious question arises as to what it is that has\nthe sensational contents that serve as Vaihinger’s ontological\nbasics. For another, we have seen that Vaihinger’s arguments in\nthe Introduction hold that the mind or\n“psyche” operates on sensory stimuli, and that it\nhas certain ends to which fictions are expedient means. If nothing\nexists except sensations, then it seems we must read Vaihinger’s\ntalk of ‘mind’ loosely, perhaps as referring to some\nparticular kind of collection of or relation between sensations. But,\none is tempted to say, it is simply incoherent to suggest that\nsensations themselves are the bearers of sensations, that they have\naims, that they operate on and systematize other sensations, etc. At\nthe very least, “operation” would seem to be a causal\nnotion, so that Vaihinger’s causal fictionalism threatens to\nundermine the arguments at the foundation of his system. Vaihinger\nsometimes attempts to respond to these sorts of worries. He suggests,\nfor example, “From our point of view the sequence of sensations\nconstitutes ultimate reality, and two poles are mentally added,\nsubject and object” (PAO 56); “nothing exists\nexcept sensations which we analyze into two poles, subject and\nobject … . In other words, the ego and the\n‘thing in itself’ are fictions” (PAO\n44). The question of course is who the we is here that is\ndoing the mental adding. Perhaps Vaihinger intends such talk\nto itself be fictional. But he cannot hold that without undermining\nthe very motivation for his fictionalism. Nor does Vaihinger ever make\nclear and precise exactly what “poles” of sensations are\nsupposed to be.\n\n\nOne may also worry that, throughout the PAO, Vaihinger has\nreverted to a crudely psychologistic version of Kantianism that both\nhe and Cohen had earlier rejected. On this score, Vaihinger is more\neasily defended. Though his fictionalism draws on certain biological\nand psychological theories, his main concern is still epistemological:\n“Apart from the general warning not to confuse fictions with\nreality, we may also call attention to the fact that every fiction\nmust be able to justify itself, i.e., must justify itself by\nwhat it accomplishes for the progress of science” (PAO\n79). There would arguably be a confusion if Vaihinger held that the\nfact that certain concepts (or dispositions to form them) are\npsychologically innate justifies us in believing that there\nexist objects exemplifying them. But that is precisely the view he\nwishes to reject. The appeal to the theory of natural selection is\nintended to suggest a pragmatic, rather than evidential,\njustification for the use of those concepts. In this sense,\nVaihinger sees himself as drawing on Kant’s method of justifying\nthe concepts of God, freedom, and immortality on practical grounds,\nbut extending it beyond the domain of moral philosophy.\n",
    "section_title": "6. The As-If Philosophy and Kantianism",
    "entry_title": "Hans Vaihinger",
    "hierarchy_title": "Hans Vaihinger || The Nature of Vaihinger’s Fictionalism",
    "tokenized_text": [
        "nature",
        "vaihinger",
        "fictionalism",
        "asif",
        "philosophy",
        "kantianism",
        "obvious",
        "aim",
        "pao",
        "establish",
        "centrality",
        "fiction",
        "cognitive",
        "life",
        "also",
        "broader",
        "way",
        "ambitious",
        "aim",
        "bookto",
        "provide",
        "kind",
        "corrected",
        "kantianism",
        "lange",
        "tried",
        "establish",
        "history",
        "materialism",
        "saw",
        "vaihinger",
        "view",
        "kant",
        "system",
        "riddled",
        "inconsistency",
        "arise",
        "alleged",
        "fact",
        "kant",
        "retains",
        "certain",
        "element",
        "precritical",
        "dogmatism",
        "even",
        "adopting",
        "critical",
        "standpoint",
        "asif",
        "philosophy",
        "seen",
        "attempt",
        "retain",
        "vaihinger",
        "take",
        "kant",
        "core",
        "philosophical",
        "insight",
        "removing",
        "inconsistency",
        "beset",
        "surrounding",
        "system",
        "insight",
        "originally",
        "couched",
        "noted",
        "major",
        "problem",
        "vaihinger",
        "early",
        "view",
        "many",
        "neokantians",
        "day",
        "status",
        "thing",
        "vaihinger",
        "consistently",
        "reject",
        "notion",
        "predictably",
        "labelling",
        "fiction",
        "given",
        "thing",
        "supposed",
        "transcendent",
        "substance",
        "causally",
        "affect",
        "u",
        "rejection",
        "follows",
        "immediately",
        "view",
        "concept",
        "substance",
        "cause",
        "fiction",
        "pao",
        "true",
        "form",
        "however",
        "vaihinger",
        "still",
        "hold",
        "concept",
        "thing",
        "utility",
        "cohen",
        "argued",
        "serf",
        "limiting",
        "concept",
        "pao",
        "ensuring",
        "restrict",
        "inquiry",
        "empirically",
        "given",
        "u",
        "seen",
        "vaihinger",
        "put",
        "instrumentalist",
        "spin",
        "kantian",
        "idea",
        "knowledge",
        "empirical",
        "sense",
        "guiding",
        "cognitive",
        "aim",
        "prediction",
        "control",
        "empirical",
        "phenomenon",
        "correspondence",
        "objective",
        "reality",
        "though",
        "bear",
        "emphasizing",
        "vaihinger",
        "seem",
        "claiming",
        "correspondence",
        "impossible",
        "incidental",
        "main",
        "epistemic",
        "aim",
        "vaihinger",
        "rejection",
        "thing",
        "implicit",
        "general",
        "label",
        "give",
        "philosophical",
        "view",
        "idealistic",
        "positivism",
        "positivism",
        "part",
        "epistemological",
        "part",
        "metaphysical",
        "thesis",
        "epistemological",
        "thesis",
        "given",
        "consists",
        "sensation",
        "pao",
        "cf",
        "xxviii",
        "metaphysical",
        "thesis",
        "usually",
        "term",
        "reality",
        "consists",
        "sensational",
        "content",
        "empfindungsinhalte",
        "pao",
        "xxx",
        "emphasis",
        "added",
        "nothing",
        "exists",
        "except",
        "sensation",
        "pao",
        "emphasis",
        "added",
        "cf",
        "a",
        "extreme",
        "view",
        "vaihinger",
        "argue",
        "immediate",
        "conclusion",
        "knowledge",
        "appearance",
        "since",
        "nothing",
        "exists",
        "except",
        "appearance",
        "addition",
        "radical",
        "kind",
        "empiricism",
        "pao",
        "continues",
        "uphold",
        "broadly",
        "kantian",
        "view",
        "cognition",
        "necessarily",
        "limited",
        "vaihinger",
        "sometimes",
        "put",
        "identity",
        "thought",
        "being",
        "however",
        "longer",
        "limited",
        "sense",
        "cut",
        "transcendent",
        "realm",
        "thing",
        "essentially",
        "incomplete",
        "point",
        "best",
        "appreciated",
        "attending",
        "another",
        "distinction",
        "central",
        "paothat",
        "fiction",
        "hypothesis",
        "hypothesis",
        "confused",
        "socalled",
        "hypothetical",
        "judgment",
        "judgment",
        "problematic",
        "form",
        "ie",
        "form",
        "possible",
        "b",
        "relevant",
        "sense",
        "possibility",
        "epistemic",
        "thus",
        "judgment",
        "matter",
        "composed",
        "atom",
        "hypothesis",
        "person",
        "making",
        "maintaining",
        "may",
        "true",
        "hold",
        "hope",
        "may",
        "confirmed",
        "falsified",
        "future",
        "contrast",
        "seen",
        "already",
        "fictive",
        "judgment",
        "form",
        "regarded",
        "b",
        "fact",
        "b",
        "since",
        "vaihinger",
        "hold",
        "judgment",
        "licensed",
        "practical",
        "utility",
        "practical",
        "aim",
        "ultimately",
        "guide",
        "constrain",
        "theoretical",
        "inquiry",
        "vaihinger",
        "infers",
        "every",
        "theory",
        "necessarily",
        "involve",
        "fiction",
        "even",
        "best",
        "theory",
        "consist",
        "entirely",
        "hypothesis",
        "much",
        "le",
        "true",
        "hypothesis",
        "distinction",
        "hypothesis",
        "fiction",
        "important",
        "understanding",
        "vaihinger",
        "revised",
        "brand",
        "kantianism",
        "another",
        "way",
        "well",
        "dialectic",
        "kant",
        "argued",
        "dogmatic",
        "metaphysics",
        "necessarily",
        "lead",
        "reason",
        "series",
        "conflict",
        "antinomy",
        "produce",
        "equally",
        "valid",
        "argument",
        "putatively",
        "establishing",
        "freedom",
        "exists",
        "freedom",
        "exist",
        "matter",
        "composed",
        "simple",
        "matter",
        "composed",
        "simple",
        "kant",
        "claim",
        "conflict",
        "natural",
        "reason",
        "since",
        "reason",
        "innate",
        "drive",
        "know",
        "unconditioned",
        "argues",
        "however",
        "conflict",
        "avoided",
        "one",
        "recognizes",
        "nonspatiotemporality",
        "thing",
        "transcendental",
        "idealism",
        "allows",
        "u",
        "maintain",
        "antinomial",
        "conflict",
        "possible",
        "thesis",
        "antithesis",
        "false",
        "without",
        "contradiction",
        "others",
        "possible",
        "true",
        "without",
        "contradiction",
        "critical",
        "philosophy",
        "thus",
        "distinct",
        "advantage",
        "able",
        "explain",
        "certain",
        "apparently",
        "insoluble",
        "metaphysical",
        "debate",
        "arise",
        "providing",
        "possible",
        "resolution",
        "debate",
        "vaihinger",
        "similarly",
        "posit",
        "natural",
        "human",
        "tendency",
        "confuse",
        "appearance",
        "thing",
        "fiction",
        "hypothesis",
        "many",
        "statement",
        "introduced",
        "discourse",
        "fiction",
        "end",
        "taken",
        "hypothesis",
        "vice",
        "versa",
        "many",
        "proposition",
        "originally",
        "intended",
        "hypothesis",
        "retained",
        "mere",
        "fictional",
        "significance",
        "vaihinger",
        "call",
        "law",
        "ideational",
        "shift",
        "gesetz",
        "der",
        "ideenverschiebung",
        "pao",
        "seemingly",
        "intractable",
        "debate",
        "science",
        "resolved",
        "maintains",
        "systematically",
        "recognizing",
        "distinction",
        "thus",
        "instance",
        "certain",
        "argument",
        "atomism",
        "cogent",
        "intended",
        "establish",
        "atomism",
        "false",
        "since",
        "contradictory",
        "erroneous",
        "intended",
        "imply",
        "atomism",
        "rejected",
        "likewise",
        "argument",
        "atomism",
        "sure",
        "fail",
        "meant",
        "establish",
        "existence",
        "atom",
        "perfectly",
        "acceptable",
        "aim",
        "show",
        "atomistic",
        "discourse",
        "useful",
        "indeed",
        "essential",
        "scientific",
        "practice",
        "atomist",
        "discourse",
        "best",
        "understood",
        "conscious",
        "fiction",
        "vaihinger",
        "suggests",
        "confusion",
        "arises",
        "ignoring",
        "essential",
        "practical",
        "dimension",
        "thought",
        "pao",
        "xviii",
        "successful",
        "vaihinger",
        "resolving",
        "alleged",
        "tension",
        "kant",
        "critical",
        "philosophy",
        "one",
        "level",
        "straightforwardly",
        "rejecting",
        "thing",
        "endorsing",
        "ontology",
        "sensation",
        "clearly",
        "avoids",
        "supposed",
        "problem",
        "attributing",
        "causal",
        "efficacy",
        "transcendent",
        "object",
        "another",
        "however",
        "would",
        "appear",
        "vaihinger",
        "easily",
        "reject",
        "thing",
        "without",
        "causing",
        "problem",
        "basic",
        "epistemological",
        "view",
        "one",
        "obvious",
        "question",
        "arises",
        "sensational",
        "content",
        "serve",
        "vaihinger",
        "ontological",
        "basic",
        "another",
        "seen",
        "vaihinger",
        "argument",
        "introduction",
        "hold",
        "mind",
        "psyche",
        "operates",
        "sensory",
        "stimulus",
        "certain",
        "end",
        "fiction",
        "expedient",
        "mean",
        "nothing",
        "exists",
        "except",
        "sensation",
        "seems",
        "must",
        "read",
        "vaihinger",
        "talk",
        "mind",
        "loosely",
        "perhaps",
        "referring",
        "particular",
        "kind",
        "collection",
        "relation",
        "sensation",
        "one",
        "tempted",
        "say",
        "simply",
        "incoherent",
        "suggest",
        "sensation",
        "bearer",
        "sensation",
        "aim",
        "operate",
        "systematize",
        "sensation",
        "etc",
        "least",
        "operation",
        "would",
        "seem",
        "causal",
        "notion",
        "vaihinger",
        "causal",
        "fictionalism",
        "threatens",
        "undermine",
        "argument",
        "foundation",
        "system",
        "vaihinger",
        "sometimes",
        "attempt",
        "respond",
        "sort",
        "worry",
        "suggests",
        "example",
        "point",
        "view",
        "sequence",
        "sensation",
        "constitutes",
        "ultimate",
        "reality",
        "two",
        "pole",
        "mentally",
        "added",
        "subject",
        "object",
        "pao",
        "nothing",
        "exists",
        "except",
        "sensation",
        "analyze",
        "two",
        "pole",
        "subject",
        "object",
        "word",
        "ego",
        "thing",
        "fiction",
        "pao",
        "question",
        "course",
        "mental",
        "adding",
        "perhaps",
        "vaihinger",
        "intends",
        "talk",
        "fictional",
        "hold",
        "without",
        "undermining",
        "motivation",
        "fictionalism",
        "vaihinger",
        "ever",
        "make",
        "clear",
        "precise",
        "exactly",
        "pole",
        "sensation",
        "supposed",
        "one",
        "may",
        "also",
        "worry",
        "throughout",
        "pao",
        "vaihinger",
        "reverted",
        "crudely",
        "psychologistic",
        "version",
        "kantianism",
        "cohen",
        "earlier",
        "rejected",
        "score",
        "vaihinger",
        "easily",
        "defended",
        "though",
        "fictionalism",
        "draw",
        "certain",
        "biological",
        "psychological",
        "theory",
        "main",
        "concern",
        "still",
        "epistemological",
        "apart",
        "general",
        "warning",
        "confuse",
        "fiction",
        "reality",
        "may",
        "also",
        "call",
        "attention",
        "fact",
        "every",
        "fiction",
        "must",
        "able",
        "justify",
        "ie",
        "must",
        "justify",
        "accomplishes",
        "progress",
        "science",
        "pao",
        "would",
        "arguably",
        "confusion",
        "vaihinger",
        "held",
        "fact",
        "certain",
        "concept",
        "disposition",
        "form",
        "psychologically",
        "innate",
        "justifies",
        "u",
        "believing",
        "exist",
        "object",
        "exemplifying",
        "precisely",
        "view",
        "wish",
        "reject",
        "appeal",
        "theory",
        "natural",
        "selection",
        "intended",
        "suggest",
        "pragmatic",
        "rather",
        "evidential",
        "justification",
        "use",
        "concept",
        "sense",
        "vaihinger",
        "see",
        "drawing",
        "kant",
        "method",
        "justifying",
        "concept",
        "god",
        "freedom",
        "immortality",
        "practical",
        "ground",
        "extending",
        "beyond",
        "domain",
        "moral",
        "philosophy"
    ]
}