{
    "main_text": "How Is Intrinsic Value to Be Computed?\n5. How Is Intrinsic Value to Be Computed?\n\nIn our assessments of intrinsic value, we are often and understandably\nconcerned not only with whether something is good or bad but\nwith how good or bad it is. Arriving at an answer to the\nlatter question is not straightforward. At least three problems\nthreaten to undermine the computation of intrinsic value.\n\nFirst, there is the possibility that the relation of intrinsic\nbetterness is not transitive (that is, the possibility that something\nA is intrinsically better than something else B,\nwhich is itself intrinsically better than some third thing C,\nand yet A is not intrinsically better than C).\nDespite the very natural assumption that this relation is transitive,\nit has been argued that it is not (Rachels 1998; Temkin 1987, 1997,\n2012). Should this in fact be the case, it would seriously complicate\ncomparisons, and hence assessments, of intrinsic value.\n\nSecond, there is the possibility that certain values are\nincommensurate. For example, Ross at one point contends that it is\nimpossible to compare the goodness of pleasure with that of virtue.\nWhereas he had suggested in The Right and the Good that\npleasure and virtue could be measured on the same scale of goodness,\nin Foundations of Ethics he declares this to be impossible,\nsince (he claims) it would imply that pleasure of a certain intensity,\nenjoyed by a sufficient number of people or for a sufficient time,\nwould counterbalance virtue possessed or manifested only by a small\nnumber of people or only for a short time; and this he professes to be\nincredible (Ross 1939, p. 275). But there is some confusion here. In\nclaiming that virtue and pleasure are incommensurate for the reason\ngiven, Ross presumably means that they cannot be measured on the same\nratio scale. (A ratio scale is one with an arbitrary unit but\na fixed zero point. Mass and length are standardly measured on ratio\nscales.) But incommensurability on a ratio scale does not imply\nincommensurability on every scale—an ordinal scale, for\ninstance. (An ordinal scale is simply one that supplies an ordering\nfor the quantity in question, such as the measurement of arm-strength\nthat is provided by an arm-wrestling competition.) Ross’s\nremarks indicate that he in fact believes that virtue and pleasure\nare commensurate on an ordinal scale, since he appears to\nsubscribe to the arch-puritanical view that any amount of virtue is\nintrinsically better than any amount of pleasure. This view is just\none example of the thesis that some goods are “higher”\nthan others, in the sense that any amount of the former is better than\nany amount of the latter. This thesis can be traced to the ancient\nGreeks (Plato, Philebus, 21a-e; Aristotle, Nicomachean\nEthics, 1174a), and it has been endorsed by many philosophers\nsince, perhaps most famously by Mill (Mill 1863, paras. 4 ff).\nInterest in the thesis has recently been revived by a set of intricate\nand intriguing puzzles, posed by Derek Parfit, concerning the relative\nvalues of low-quantity/high-quality goods and\nhigh-quantity/low-quality goods (Parfit 1984, Part IV). One response\nto these puzzles (eschewed by Parfit himself) is to adopt the thesis\nof the nontransitivity of intrinsic betterness. Another is to insist\non the thesis that some goods are higher than others. Such a response\ndoes not by itself solve the puzzles that Parfit raises, but, to the\nextent that it helps, it does so at the cost of once again\ncomplicating the computation of intrinsic value.\n\nTo repeat: contrary to what Ross says, the thesis that some goods are\nhigher than others implies that such goods are commensurate, and not\nthat they are incommensurate. Some people do hold, however, that\ncertain values really are incommensurate and thus cannot be compared\non any meaningful scale. (Isaiah Berlin [1909–1997], for\nexample, is often thought to have said this about the values of\nliberty and equality. Whether he is best interpreted in this way is\ndebatable. See Berlin 1969.) This view constitutes a more radical\nthreat to the computation of intrinsic value than does the view that\nintrinsic betterness is not transitive. The latter view presupposes at\nleast some measure of commensurability. If A is better than\nB and B is better than C, then A\nis commensurate with B and B is commensurate with\nC; and even if it should turn out that A is not\nbetter than C, it may still be that A is\ncommensurate with C, either because it is as good as\nC or because it is worse than C. But if A\nis incommensurate with B, then A is neither better\nthan nor as good as nor worse than B. (Some claim, however,\nthat the reverse does not hold and that, even if A is neither\nbetter than nor as good as nor worse than B, still A\nmay be “on a par” with B and thus be roughly\ncomparable with it. Cf. Chang 1997, 2002.) If such a case can arise,\nthere is an obvious limit to the extent to which we can meaningfully\nsay how good a certain complex whole is (here, “whole” is\nused to refer to whatever kind of entity may have intrinsic value);\nfor, if such a whole comprises incommensurate goods A and\nB, then there will be no way of establishing just how good it\nis overall, even if there is a way of establishing how good it is with\nrespect to each of A and B.\n\nThere is a third, still more radical threat to the computation of\nintrinsic value. Quite apart from any concern with the\ncommensurability of values, Moore famously claims that there is no\neasy formula for the determination of the intrinsic value of complex\nwholes because of the truth of what he calls the “principle of\norganic unities” (Moore 1903, p. 96). According to this\nprinciple, the intrinsic value of a whole must not be assumed to be\nthe same as the sum of the intrinsic values of its parts (Moore 1903,\np. 28) As an example of an organic unity, Moore gives the case of the\nconsciousness of a beautiful object; he says that this has great\nintrinsic value, even though the consciousness as such and the\nbeautiful object as such each have comparatively little, if any,\nintrinsic value. If the principle of organic unities is true, then\nthere is scant hope of a systematic approach to the computation of\nintrinsic value. Although the principle explicitly rules out only\nsummation as a method of computation, Moore’s remarks strongly\nsuggest that there is no relation between the parts of a whole and the\nwhole itself that holds in general and in terms of which the value of\nthe latter can be computed by aggregating (whether by summation or by\nsome other means) the values of the former. Moore’s position has\nbeen endorsed by many other philosophers. For example, Ross says that\nit is better that one person be good and happy and another bad and\nunhappy than that the former be good and unhappy and the latter bad\nand happy, and he takes this to be confirmation of Moore’s\nprinciple (Ross 1930, p. 72). Broad takes organic unities of the sort\nthat Moore discusses to be just one instance of a more general\nphenomenon that he believes to be at work in many other situations, as\nwhen, for example, two tunes, each pleasing in its own right, make for\na cacophonous combination (Broad 1985, p. 256). Others have furnished\nstill further examples of organic unities (Chisholm 1986, ch. 7; Lemos\n1994, chs. 3 and 4, and 1998; Hurka 1998).\n\nWas Moore the first to call attention to the phenomenon of organic\nunities in the context of intrinsic value? This is debatable. Despite\nthe fact that he explicitly invoked what he called a “principle\nof summation” that would appear to be inconsistent with the\nprinciple of organic unities, Brentano appears nonetheless to have\nanticipated Moore’s principle in his discussion of\nSchadenfreude, that is, of malicious pleasure; he condemns\nsuch an attitude, even though he claims that pleasure as such is\nintrinsically good (Brentano 1969, p. 23 n). Certainly Chisholm takes\nBrentano to be an advocate of organic unities (Chisholm 1986, ch. 5),\nascribing to him the view that there are many kinds of organic unity\nand building on what he takes to be Brentano’s insights (and,\ngoing further back in the history of philosophy, the insights of St.\nThomas Aquinas [1225–1274] and others).\n\nRecently, a special spin has been put on the principle of organic\nunities by so-called “particularists.” Jonathan Dancy, for\nexample, has claimed (in keeping with Korsgaard and others mentioned\nin Section 3 above), that something’s intrinsic value need not\nsupervene on its intrinsic properties alone; in fact, the\nsupervenience-base may be so open-ended that it resists\ngeneralization. The upshot, according to Dancy, is that the intrinsic\nvalue of something may vary from context to context; indeed, the\nvariation may be so great that the thing’s value changes\n“polarity” from good to bad, or vice versa (Dancy\n2000). This approach to value constitutes an endorsement of the\nprinciple of organic unities that is even more subversive of the\ncomputation of intrinsic value than Moore’s; for Moore holds\nthat the intrinsic value of something is and must be constant, even if\nits contribution to the value of wholes of which it forms a part is\nnot, whereas Dancy holds that variation can occur at both levels.\n\nNot everyone has accepted the principle of organic unities; some have\nheld out hope for a more systematic approach to the computation of\nintrinsic value. However, even someone who is inclined to measure\nintrinsic value in terms of summation must acknowledge that there is a\nsense in which the principle of organic unities is obviously true.\nConsider some complex whole, W, that is composed of three\ngoods, X, Y, and Z, which are wholly\nindependent of one another. Suppose that we had a ratio scale on which\nto measure these goods, and that their values on this scale were 10,\n20, and 30, respectively. We would expect someone who takes intrinsic\nvalue to be summative to declare the value of W to be (10 +\n20 + 30 =) 60. But notice that, if X, Y, and\nZ are parts of W, then so too, presumably, are the\ncombinations X-and-Y, X-and-Z, and\nY-and-Z; the values of these combinations, computed\nin terms of summation, will be 30, 40, and 50, respectively. If the\nvalues of these parts of W were also taken into consideration\nwhen evaluating W, the value of W would balloon to\n180. Clearly, this would be a distortion. Someone who wishes to\nmaintain that intrinsic value is summative must thus show not only how\nthe various alleged examples of organic unities provided by Moore and\nothers are to be reinterpreted, but also how, in the sort of case just\nsketched, it is only the values of X, Y, and\nZ, and not the values either of any combinations of these\ncomponents or of any parts of these components, that are to be taken\ninto account when evaluating W itself. In order to bring some\nsemblance of manageability to the computation of intrinsic value, this\nis precisely what some writers, by appealing to the idea of\n“basic” intrinsic value, have tried to do. The general\nidea is this. In the sort of example just given, each of X,\nY, and Z is to be construed as having basic\nintrinsic value; if any combinations or parts of X,\nY, and Z have intrinsic value, this value is not\nbasic; and the value of W is to be computed by appealing only\nto those parts of W that have basic intrinsic value.\n\nGilbert Harman was one of the first explicitly to discuss basic\nintrinsic value when he pointed out the apparent need to invoke such\nvalue if we are to avoid distortions in our evaluations (Harman 1967).\nHowever, he offers no precise account of the concept of basic\nintrinsic value and ends his paper by saying that he can think of no\nway to show that nonbasic intrinsic value is to be computed in terms\nof the summation of basic intrinsic value. Several philosophers have\nsince tried to do better. Many have argued that nonbasic intrinsic\nvalue cannot always be computed by summing basic intrinsic\nvalue. Suppose that states of affairs can bear intrinsic value. Let\nX be the state of affairs of John being pleased to a certain\ndegree x, and Y be the state of affairs of Jane\nbeing displeased to a certain degree y, and suppose that\nX has a basic intrinsic value of 10 and Y a basic\nintrinsic value of −20. It seems reasonable to sum these values\nand attribute an intrinsic value of −10 to the conjunctive state\nof affairs X&Y. But what of the disjunctive state of\naffairs XvY or the negative state of affairs ~X? How\nare their intrinsic values to be computed? Summation seems to\nbe a nonstarter in these cases. Nonetheless, attempts have been made\neven in such cases to show how the intrinsic value of a complex whole\nis to be computed in a nonsummative way in terms of the basic\nintrinsic values of simpler states, thus preserving the idea that\nbasic intrinsic value is the key to the computation of all intrinsic\nvalue (Quinn 1974, Chisholm 1975, Oldfield 1977, Carlson 1997). (These\nattempts have generally been based on the assumption that states of\naffairs are the sole bearers of intrinsic value. Matters\nwould be considerably more complicated if it turned out that entities\nof several different ontological categories could all have intrinsic\nvalue.)\n\nSuggestions as to how to compute nonbasic intrinsic value in terms of\nbasic intrinsic value of course presuppose that there is such a thing\nas basic intrinsic value, but few have attempted to provide an account\nof what basic intrinsic value itself consists in. Fred Feldman is one\nof the few (Feldman 2000; cf. Feldman 1997, pp. 116–18).\nSubscribing to the view that only states of affairs bear intrinsic\nvalue, Feldman identifies several features that any state of affairs\nthat has basic intrinsic value in particular must possess. He\nmaintains, for example, that whatever has basic intrinsic value must\nhave it to a determinate degree and that this value cannot be\n“defeated” by any Moorean organic unity. In this way,\nFeldman seeks to preserve the idea that intrinsic value is summative\nafter all. He does not claim that all intrinsic value is to be\ncomputed by summing basic intrinsic value, but he does insist that the\nvalue of entire worlds is to be computed in this way.\n\nDespite the detail in which Feldman characterizes the concept of basic\nintrinsic value, he offers no strict analysis of it. Others have tried\nto supply such an analysis. For example, by noting that, even if it is\ntrue that only states have intrinsic value, it may yet be that not all\nstates have intrinsic value, Zimmerman suggests (to put matters\nsomewhat roughly) that basic intrinsic value is the intrinsic value\nhad by states none of whose proper parts have intrinsic value\n(Zimmerman 2001, ch. 5). On this basis he argues that disjunctive and\nnegative states in fact have no intrinsic value at all, and thereby\nseeks to show how all intrinsic value is to be computed in terms of\nsummation after all.\n\nTwo final points. First, we are now in a position to see why it was\nsaid above (in Section 2) that perhaps not all intrinsic value is\nnonderivative. If it is correct to distinguish between basic and\nnonbasic intrinsic value and also to compute the latter in terms of\nthe former, then there is clearly a respectable sense in which\nnonbasic intrinsic value is derivative. Second, if states with basic\nintrinsic value account for all the value that there is in the world,\nsupport is found for Chisholm’s view (reported in Section 2)\nthat some ontological version of Moore’s isolation test is\nacceptable.\n",
    "section_title": "5. How Is Intrinsic Value to Be Computed?",
    "entry_title": "Intrinsic vs. Extrinsic Value",
    "hierarchy_title": "Intrinsic vs. Extrinsic Value || How Is Intrinsic Value to Be Computed?",
    "tokenized_text": [
        "intrinsic",
        "value",
        "computed",
        "intrinsic",
        "value",
        "computed",
        "assessment",
        "intrinsic",
        "value",
        "often",
        "understandably",
        "concerned",
        "whether",
        "something",
        "good",
        "bad",
        "good",
        "bad",
        "arriving",
        "answer",
        "latter",
        "question",
        "straightforward",
        "least",
        "three",
        "problem",
        "threaten",
        "undermine",
        "computation",
        "intrinsic",
        "value",
        "first",
        "possibility",
        "relation",
        "intrinsic",
        "betterness",
        "transitive",
        "possibility",
        "something",
        "intrinsically",
        "better",
        "something",
        "else",
        "b",
        "intrinsically",
        "better",
        "third",
        "thing",
        "c",
        "yet",
        "intrinsically",
        "better",
        "c",
        "despite",
        "natural",
        "assumption",
        "relation",
        "transitive",
        "argued",
        "rachel",
        "temkin",
        "fact",
        "case",
        "would",
        "seriously",
        "complicate",
        "comparison",
        "hence",
        "assessment",
        "intrinsic",
        "value",
        "second",
        "possibility",
        "certain",
        "value",
        "incommensurate",
        "example",
        "ross",
        "one",
        "point",
        "contends",
        "impossible",
        "compare",
        "goodness",
        "pleasure",
        "virtue",
        "whereas",
        "suggested",
        "right",
        "good",
        "pleasure",
        "virtue",
        "could",
        "measured",
        "scale",
        "goodness",
        "foundation",
        "ethic",
        "declares",
        "impossible",
        "since",
        "claim",
        "would",
        "imply",
        "pleasure",
        "certain",
        "intensity",
        "enjoyed",
        "sufficient",
        "number",
        "people",
        "sufficient",
        "time",
        "would",
        "counterbalance",
        "virtue",
        "possessed",
        "manifested",
        "small",
        "number",
        "people",
        "short",
        "time",
        "professes",
        "incredible",
        "ross",
        "p",
        "confusion",
        "claiming",
        "virtue",
        "pleasure",
        "incommensurate",
        "reason",
        "given",
        "ross",
        "presumably",
        "mean",
        "measured",
        "ratio",
        "scale",
        "ratio",
        "scale",
        "one",
        "arbitrary",
        "unit",
        "fixed",
        "zero",
        "point",
        "mass",
        "length",
        "standardly",
        "measured",
        "ratio",
        "scale",
        "incommensurability",
        "ratio",
        "scale",
        "imply",
        "incommensurability",
        "every",
        "scalean",
        "ordinal",
        "scale",
        "instance",
        "ordinal",
        "scale",
        "simply",
        "one",
        "supply",
        "ordering",
        "quantity",
        "question",
        "measurement",
        "armstrength",
        "provided",
        "armwrestling",
        "competition",
        "ross",
        "remark",
        "indicate",
        "fact",
        "belief",
        "virtue",
        "pleasure",
        "commensurate",
        "ordinal",
        "scale",
        "since",
        "appears",
        "subscribe",
        "archpuritanical",
        "view",
        "amount",
        "virtue",
        "intrinsically",
        "better",
        "amount",
        "pleasure",
        "view",
        "one",
        "example",
        "thesis",
        "good",
        "higher",
        "others",
        "sense",
        "amount",
        "former",
        "better",
        "amount",
        "latter",
        "thesis",
        "traced",
        "ancient",
        "greek",
        "plato",
        "philebus",
        "ae",
        "aristotle",
        "nicomachean",
        "ethic",
        "a",
        "endorsed",
        "many",
        "philosopher",
        "since",
        "perhaps",
        "famously",
        "mill",
        "mill",
        "para",
        "ff",
        "interest",
        "thesis",
        "recently",
        "revived",
        "set",
        "intricate",
        "intriguing",
        "puzzle",
        "posed",
        "derek",
        "parfit",
        "concerning",
        "relative",
        "value",
        "lowquantityhighquality",
        "good",
        "highquantitylowquality",
        "good",
        "parfit",
        "part",
        "iv",
        "one",
        "response",
        "puzzle",
        "eschewed",
        "parfit",
        "adopt",
        "thesis",
        "nontransitivity",
        "intrinsic",
        "betterness",
        "another",
        "insist",
        "thesis",
        "good",
        "higher",
        "others",
        "response",
        "solve",
        "puzzle",
        "parfit",
        "raise",
        "extent",
        "help",
        "cost",
        "complicating",
        "computation",
        "intrinsic",
        "value",
        "repeat",
        "contrary",
        "ross",
        "say",
        "thesis",
        "good",
        "higher",
        "others",
        "implies",
        "good",
        "commensurate",
        "incommensurate",
        "people",
        "hold",
        "however",
        "certain",
        "value",
        "really",
        "incommensurate",
        "thus",
        "compared",
        "meaningful",
        "scale",
        "isaiah",
        "berlin",
        "example",
        "often",
        "thought",
        "said",
        "value",
        "liberty",
        "equality",
        "whether",
        "best",
        "interpreted",
        "way",
        "debatable",
        "see",
        "berlin",
        "view",
        "constitutes",
        "radical",
        "threat",
        "computation",
        "intrinsic",
        "value",
        "view",
        "intrinsic",
        "betterness",
        "transitive",
        "latter",
        "view",
        "presupposes",
        "least",
        "measure",
        "commensurability",
        "better",
        "b",
        "b",
        "better",
        "c",
        "commensurate",
        "b",
        "b",
        "commensurate",
        "c",
        "even",
        "turn",
        "better",
        "c",
        "may",
        "still",
        "commensurate",
        "c",
        "either",
        "good",
        "c",
        "worse",
        "c",
        "incommensurate",
        "b",
        "neither",
        "better",
        "good",
        "worse",
        "b",
        "claim",
        "however",
        "reverse",
        "hold",
        "even",
        "neither",
        "better",
        "good",
        "worse",
        "b",
        "still",
        "may",
        "par",
        "b",
        "thus",
        "roughly",
        "comparable",
        "cf",
        "chang",
        "case",
        "arise",
        "obvious",
        "limit",
        "extent",
        "meaningfully",
        "say",
        "good",
        "certain",
        "complex",
        "whole",
        "whole",
        "used",
        "refer",
        "whatever",
        "kind",
        "entity",
        "may",
        "intrinsic",
        "value",
        "whole",
        "comprises",
        "incommensurate",
        "good",
        "b",
        "way",
        "establishing",
        "good",
        "overall",
        "even",
        "way",
        "establishing",
        "good",
        "respect",
        "b",
        "third",
        "still",
        "radical",
        "threat",
        "computation",
        "intrinsic",
        "value",
        "quite",
        "apart",
        "concern",
        "commensurability",
        "value",
        "moore",
        "famously",
        "claim",
        "easy",
        "formula",
        "determination",
        "intrinsic",
        "value",
        "complex",
        "whole",
        "truth",
        "call",
        "principle",
        "organic",
        "unity",
        "moore",
        "p",
        "according",
        "principle",
        "intrinsic",
        "value",
        "whole",
        "must",
        "assumed",
        "sum",
        "intrinsic",
        "value",
        "part",
        "moore",
        "p",
        "example",
        "organic",
        "unity",
        "moore",
        "give",
        "case",
        "consciousness",
        "beautiful",
        "object",
        "say",
        "great",
        "intrinsic",
        "value",
        "even",
        "though",
        "consciousness",
        "beautiful",
        "object",
        "comparatively",
        "little",
        "intrinsic",
        "value",
        "principle",
        "organic",
        "unity",
        "true",
        "scant",
        "hope",
        "systematic",
        "approach",
        "computation",
        "intrinsic",
        "value",
        "although",
        "principle",
        "explicitly",
        "rule",
        "summation",
        "method",
        "computation",
        "moore",
        "remark",
        "strongly",
        "suggest",
        "relation",
        "part",
        "whole",
        "whole",
        "hold",
        "general",
        "term",
        "value",
        "latter",
        "computed",
        "aggregating",
        "whether",
        "summation",
        "mean",
        "value",
        "former",
        "moore",
        "position",
        "endorsed",
        "many",
        "philosopher",
        "example",
        "ross",
        "say",
        "better",
        "one",
        "person",
        "good",
        "happy",
        "another",
        "bad",
        "unhappy",
        "former",
        "good",
        "unhappy",
        "latter",
        "bad",
        "happy",
        "take",
        "confirmation",
        "moore",
        "principle",
        "ross",
        "p",
        "broad",
        "take",
        "organic",
        "unity",
        "sort",
        "moore",
        "discus",
        "one",
        "instance",
        "general",
        "phenomenon",
        "belief",
        "work",
        "many",
        "situation",
        "example",
        "two",
        "tune",
        "pleasing",
        "right",
        "make",
        "cacophonous",
        "combination",
        "broad",
        "p",
        "others",
        "furnished",
        "still",
        "example",
        "organic",
        "unity",
        "chisholm",
        "ch",
        "lemos",
        "chs",
        "hurka",
        "moore",
        "first",
        "call",
        "attention",
        "phenomenon",
        "organic",
        "unity",
        "context",
        "intrinsic",
        "value",
        "debatable",
        "despite",
        "fact",
        "explicitly",
        "invoked",
        "called",
        "principle",
        "summation",
        "would",
        "appear",
        "inconsistent",
        "principle",
        "organic",
        "unity",
        "brentano",
        "appears",
        "nonetheless",
        "anticipated",
        "moore",
        "principle",
        "discussion",
        "schadenfreude",
        "malicious",
        "pleasure",
        "condemns",
        "attitude",
        "even",
        "though",
        "claim",
        "pleasure",
        "intrinsically",
        "good",
        "brentano",
        "p",
        "n",
        "certainly",
        "chisholm",
        "take",
        "brentano",
        "advocate",
        "organic",
        "unity",
        "chisholm",
        "ch",
        "ascribing",
        "view",
        "many",
        "kind",
        "organic",
        "unity",
        "building",
        "take",
        "brentano",
        "insight",
        "going",
        "back",
        "history",
        "philosophy",
        "insight",
        "st",
        "thomas",
        "aquinas",
        "others",
        "recently",
        "special",
        "spin",
        "put",
        "principle",
        "organic",
        "unity",
        "socalled",
        "particularists",
        "jonathan",
        "dancy",
        "example",
        "claimed",
        "keeping",
        "korsgaard",
        "others",
        "mentioned",
        "section",
        "something",
        "intrinsic",
        "value",
        "need",
        "supervene",
        "intrinsic",
        "property",
        "alone",
        "fact",
        "superveniencebase",
        "may",
        "openended",
        "resists",
        "generalization",
        "upshot",
        "according",
        "dancy",
        "intrinsic",
        "value",
        "something",
        "may",
        "vary",
        "context",
        "context",
        "indeed",
        "variation",
        "may",
        "great",
        "thing",
        "value",
        "change",
        "polarity",
        "good",
        "bad",
        "vice",
        "versa",
        "dancy",
        "approach",
        "value",
        "constitutes",
        "endorsement",
        "principle",
        "organic",
        "unity",
        "even",
        "subversive",
        "computation",
        "intrinsic",
        "value",
        "moore",
        "moore",
        "hold",
        "intrinsic",
        "value",
        "something",
        "must",
        "constant",
        "even",
        "contribution",
        "value",
        "whole",
        "form",
        "part",
        "whereas",
        "dancy",
        "hold",
        "variation",
        "occur",
        "level",
        "everyone",
        "accepted",
        "principle",
        "organic",
        "unity",
        "held",
        "hope",
        "systematic",
        "approach",
        "computation",
        "intrinsic",
        "value",
        "however",
        "even",
        "someone",
        "inclined",
        "measure",
        "intrinsic",
        "value",
        "term",
        "summation",
        "must",
        "acknowledge",
        "sense",
        "principle",
        "organic",
        "unity",
        "obviously",
        "true",
        "consider",
        "complex",
        "whole",
        "w",
        "composed",
        "three",
        "good",
        "x",
        "z",
        "wholly",
        "independent",
        "one",
        "another",
        "suppose",
        "ratio",
        "scale",
        "measure",
        "good",
        "value",
        "scale",
        "respectively",
        "would",
        "expect",
        "someone",
        "take",
        "intrinsic",
        "value",
        "summative",
        "declare",
        "value",
        "w",
        "notice",
        "x",
        "z",
        "part",
        "w",
        "presumably",
        "combination",
        "xandy",
        "xandz",
        "yandz",
        "value",
        "combination",
        "computed",
        "term",
        "summation",
        "respectively",
        "value",
        "part",
        "w",
        "also",
        "taken",
        "consideration",
        "evaluating",
        "w",
        "value",
        "w",
        "would",
        "balloon",
        "clearly",
        "would",
        "distortion",
        "someone",
        "wish",
        "maintain",
        "intrinsic",
        "value",
        "summative",
        "must",
        "thus",
        "show",
        "various",
        "alleged",
        "example",
        "organic",
        "unity",
        "provided",
        "moore",
        "others",
        "reinterpreted",
        "also",
        "sort",
        "case",
        "sketched",
        "value",
        "x",
        "z",
        "value",
        "either",
        "combination",
        "component",
        "part",
        "component",
        "taken",
        "account",
        "evaluating",
        "w",
        "order",
        "bring",
        "semblance",
        "manageability",
        "computation",
        "intrinsic",
        "value",
        "precisely",
        "writer",
        "appealing",
        "idea",
        "basic",
        "intrinsic",
        "value",
        "tried",
        "general",
        "idea",
        "sort",
        "example",
        "given",
        "x",
        "z",
        "construed",
        "basic",
        "intrinsic",
        "value",
        "combination",
        "part",
        "x",
        "z",
        "intrinsic",
        "value",
        "value",
        "basic",
        "value",
        "w",
        "computed",
        "appealing",
        "part",
        "w",
        "basic",
        "intrinsic",
        "value",
        "gilbert",
        "harman",
        "one",
        "first",
        "explicitly",
        "discus",
        "basic",
        "intrinsic",
        "value",
        "pointed",
        "apparent",
        "need",
        "invoke",
        "value",
        "avoid",
        "distortion",
        "evaluation",
        "harman",
        "however",
        "offer",
        "precise",
        "account",
        "concept",
        "basic",
        "intrinsic",
        "value",
        "end",
        "paper",
        "saying",
        "think",
        "way",
        "show",
        "nonbasic",
        "intrinsic",
        "value",
        "computed",
        "term",
        "summation",
        "basic",
        "intrinsic",
        "value",
        "several",
        "philosopher",
        "since",
        "tried",
        "better",
        "many",
        "argued",
        "nonbasic",
        "intrinsic",
        "value",
        "always",
        "computed",
        "summing",
        "basic",
        "intrinsic",
        "value",
        "suppose",
        "state",
        "affair",
        "bear",
        "intrinsic",
        "value",
        "let",
        "x",
        "state",
        "affair",
        "john",
        "pleased",
        "certain",
        "degree",
        "x",
        "state",
        "affair",
        "jane",
        "displeased",
        "certain",
        "degree",
        "suppose",
        "x",
        "basic",
        "intrinsic",
        "value",
        "basic",
        "intrinsic",
        "value",
        "seems",
        "reasonable",
        "sum",
        "value",
        "attribute",
        "intrinsic",
        "value",
        "conjunctive",
        "state",
        "affair",
        "x",
        "disjunctive",
        "state",
        "affair",
        "xvy",
        "negative",
        "state",
        "affair",
        "x",
        "intrinsic",
        "value",
        "computed",
        "summation",
        "seems",
        "nonstarter",
        "case",
        "nonetheless",
        "attempt",
        "made",
        "even",
        "case",
        "show",
        "intrinsic",
        "value",
        "complex",
        "whole",
        "computed",
        "nonsummative",
        "way",
        "term",
        "basic",
        "intrinsic",
        "value",
        "simpler",
        "state",
        "thus",
        "preserving",
        "idea",
        "basic",
        "intrinsic",
        "value",
        "key",
        "computation",
        "intrinsic",
        "value",
        "quinn",
        "chisholm",
        "oldfield",
        "carlson",
        "attempt",
        "generally",
        "based",
        "assumption",
        "state",
        "affair",
        "sole",
        "bearer",
        "intrinsic",
        "value",
        "matter",
        "would",
        "considerably",
        "complicated",
        "turned",
        "entity",
        "several",
        "different",
        "ontological",
        "category",
        "could",
        "intrinsic",
        "value",
        "suggestion",
        "compute",
        "nonbasic",
        "intrinsic",
        "value",
        "term",
        "basic",
        "intrinsic",
        "value",
        "course",
        "presuppose",
        "thing",
        "basic",
        "intrinsic",
        "value",
        "attempted",
        "provide",
        "account",
        "basic",
        "intrinsic",
        "value",
        "consists",
        "fred",
        "feldman",
        "one",
        "feldman",
        "cf",
        "feldman",
        "pp",
        "subscribing",
        "view",
        "state",
        "affair",
        "bear",
        "intrinsic",
        "value",
        "feldman",
        "identifies",
        "several",
        "feature",
        "state",
        "affair",
        "basic",
        "intrinsic",
        "value",
        "particular",
        "must",
        "posse",
        "maintains",
        "example",
        "whatever",
        "basic",
        "intrinsic",
        "value",
        "must",
        "determinate",
        "degree",
        "value",
        "defeated",
        "moorean",
        "organic",
        "unity",
        "way",
        "feldman",
        "seek",
        "preserve",
        "idea",
        "intrinsic",
        "value",
        "summative",
        "claim",
        "intrinsic",
        "value",
        "computed",
        "summing",
        "basic",
        "intrinsic",
        "value",
        "insist",
        "value",
        "entire",
        "world",
        "computed",
        "way",
        "despite",
        "detail",
        "feldman",
        "characterizes",
        "concept",
        "basic",
        "intrinsic",
        "value",
        "offer",
        "strict",
        "analysis",
        "others",
        "tried",
        "supply",
        "analysis",
        "example",
        "noting",
        "even",
        "true",
        "state",
        "intrinsic",
        "value",
        "may",
        "yet",
        "state",
        "intrinsic",
        "value",
        "zimmerman",
        "suggests",
        "put",
        "matter",
        "somewhat",
        "roughly",
        "basic",
        "intrinsic",
        "value",
        "intrinsic",
        "value",
        "state",
        "none",
        "whose",
        "proper",
        "part",
        "intrinsic",
        "value",
        "zimmerman",
        "ch",
        "basis",
        "argues",
        "disjunctive",
        "negative",
        "state",
        "fact",
        "intrinsic",
        "value",
        "thereby",
        "seek",
        "show",
        "intrinsic",
        "value",
        "computed",
        "term",
        "summation",
        "two",
        "final",
        "point",
        "first",
        "position",
        "see",
        "said",
        "section",
        "perhaps",
        "intrinsic",
        "value",
        "nonderivative",
        "correct",
        "distinguish",
        "basic",
        "nonbasic",
        "intrinsic",
        "value",
        "also",
        "compute",
        "latter",
        "term",
        "former",
        "clearly",
        "respectable",
        "sense",
        "nonbasic",
        "intrinsic",
        "value",
        "derivative",
        "second",
        "state",
        "basic",
        "intrinsic",
        "value",
        "account",
        "value",
        "world",
        "support",
        "found",
        "chisholm",
        "view",
        "reported",
        "section",
        "ontological",
        "version",
        "moore",
        "isolation",
        "test",
        "acceptable"
    ]
}