{
    "main_text": "Major Yogācāra Arguments and Positions || Three Natures and Non-Duality\n4.3 Three Natures and Non-Duality\n\nVasubandhu did the work of defending the controversial,\nYogācāra thesis of appearance-only\n(vijñaptimātra) in his Twenty Verses. In\nhis short, poetic works the Thirty Verses and the Three\nNatures Exposition, he does not entertain\n objections.[40]\n Instead, he draws together the basic doctrinal and conceptual\nvocabulary of the Yogācāra tradition and forms an elegant,\ncoherent system. The Thirty Verses includes a complete\ntreatment of the Buddhist path from a Yogācāra perspective.\nIn order to understand Vasubandhu’s contribution in this text,\nit would be necessary to place it against the wide backdrop of\nprevious Yogācāra doctrine. This scholarly work is ongoing.\nHere, let us focus instead on introducing the basics of the intricate\ndoctrinal structure formulated in the Three Natures\nExposition.\n\nThe Three Natures Exposition takes as its topic, and its\ntitle, the three natures of reality from a Yogācāra\nperspective: These are the fabricated nature\n(parikalpita-svabhāva), the dependent nature\n(paratantra-svabhāva) and the perfected nature\n(pariniṣpanna-svabhāva). In Yogācāra\nmetaphysics, things no longer have only one nature, one\nsvabhāva; rather, things have three different, if\ninterconnected, natures. We may note immediately how fundamentally\nthis differs from the Treasury, in which the apparent purpose\nis, at all times, to determine the singular nature of each entity\n(dharma). In that context, to discover that an entity must be\nadmitted to have more than one, distinct nature, would be to discover\nthat that entity is unreal. Something that changes, for instance, is\ninternally inconsistent because of exhibiting multiple natures.\nVasubandhu employs exactly such arguments to deny the ultimate reality\nof many specific entities (dharma) in the Treasury.\nSuch entities, he says, are unreal; like a “self,” they\nare only conceptual fabrications (parikalpita).\n\nOne of the basic distinguishing features of Great Vehicle\n(Mahāyāna) metaphysics is the affirmation that not only the\nperson, but all entities (dharma) are empty of a\n“self” or an inherent nature (svabhāva).\nThat means, in the terms laid out in the Treasury, that\nall dharmas are only conceptual fabrications. But that is not\nthe only way of looking at things. To say that all things have\nthree inherent natures is not to take back the Great\nVehicle’s denial of inherent natures, but rather to explain it.\nIt is to say that, what we ordinarily take to be a thing’s\nindividual character or identity is best understood from three angles,\nso as to explode its unity. The first nature is the fabricated nature,\nwhich is the thing as it appears to be. Of course, to use this term is\nto indicate the acceptance that things do not really exist the way\nthey appear. This is a thing’s nature as it might be defined and\nexplained in ordinary Abhidharma philosophy, but with the added\nproviso that we all know that this is not really how things work. The\nsecond nature is the dependent nature, which Vasubandhu defines as the\ncausal process of the thing’s fabrication, the causal\nstory that brings about the thing’s apparent nature. The third\nnature, finally, is the emptiness of the first nature—the\nfact that it is unreal, that it does not exist as it\nappears.\n\nLet’s take the most important example, for Buddhists, of a thing\nthat appears real but has no nature: the self. With this as our\nexample of something mistakenly thought to have a nature\n(svabhāva), we may run through its three\nnatures. The self as it appears is just my self. I seem to be here, as\na living being, typing on a keyboard, thinking thoughts. That is the\nfirst nature. The second nature is the causal story that brings about\nthis seeming self, which is the cycle of dependent origination. We\nmight appeal to the standard Abhidharma causal story, and say that the\ntwelve sense bases or the five aggregates, causally conjoined, bring\nabout the conceptually-fabricated self. In the Yogācāra,\nthis causal story is entirely mental, of course, so we cannot appeal\nto the sense bases themselves as the real cause. Rather, the sense\nbases only appear to be there due to karmic conditioning in\nmy mental stream. For this reason, the second nature should instead be\nsaid to be the causal series according to which the mental seeds\nplanted by previous deeds ripen into the appearance of the sense\nbases, so that I think I am perceiving things—which, in turn,\nmakes me think I have a self. Finally, the third nature is the\nnon-existence of the self, the fact that it does not exist where it\nappears. Of course, if there was a real self, I could not have\nprovided my explanation of how it comes to appear to be there. In\nVasubandhu’s telling, the three natures are all one reality\nviewed from three distinct angles. They are the appearance, the\nprocess, and the emptiness of that same apparent entity.\n\nWith this in mind, we can read the opening verses of the Three\nNatures Exposition:\n\n\n1. Fabricated, dependent and perfected: So the wise understand, in\ndepth, the three natures.\n\n2. What appears is the dependent. How it appears is the fabricated.\nBecause of being dependent on conditions. Because of being only\nfabrication.\n\n3. The eternal non-existence of the appearance as it is appears: That\nis known to be the perfected nature, because of being always the\nsame.\n\n4. What appears there? The unreal fabrication. How does it appear? As\na dual self. What is its nonexistence? That by which the nondual\nreality is\n there.[41]\n\n\nThese verses emphasize the crystalline, internal structure to the\nthree natures. “What appears” is one nature (the\ndependent), whereas “how it appears” is the fabricated.\n“The eternal non-existence of the appearance as it\nappears” is the perfected. These are ways of talking of the same\nentity, or event, from different perspectives. Also evident here is\nthe crucial Yogācāra concept of “duality.” The\nfabricated is said to appear as a “dual self,” whereas\nreality (dharmatā) is nondual. Since, as we have seen\nabove, Vasubandhu believes in the selflessness of all dharmas, the\n“dual self” is the false appearance of a self that is\nattributed to any entity. Things and selves mistakenly appear\n“dual.” What does this mean?\n\nThe twosome denied by the denial of “duality” has many\ninterpretations across Yogācāra thought, but for Vasubandhu\nthe most important kinds of duality are conceptual duality\nand perceptual\n duality.[42]\n Conceptual duality is the bifurcation of the universe that appears\nnecessary in the formation of any concept. When we say of any given\nthing that it is “physical,” we are effectively saying, at\nthe same time, that all things are either “physical” or\n“not physical.” We create a “duality”\naccording to which we may understand all things as falling into either\none or the other category. This is what it is to define something, and\nto ascribe it its characteristic nature (svabhāva). This\nis why every “self” is “dual.” To say\nsomething is what it is imposes a duality upon the world. And, given\nthat the world is in causal flux and does not accord with any\nconceptual construct, every duality imposes a false construct upon the\nworld. To illuminate this with regard to the person, when I say that\n“I” exist, I am dividing the universe into\n“self” and “other”—me and not-me. Since,\nfor Buddhists, the self is unreal, this is a mistaken imposition, and\nof course many ignorant, selfish actions follow from this fundamental\nconceptual error.\n\nIn addition, but closely related to conceptual duality, is\nperceptual duality. This is the distinction between sensory\norgans and their objects that appears in perception. When I see a\ntree, I have the immediate impression that there is a distinction\nbetween that tree, which I see, and my eye organs, which see the tree.\nI take it that my eyes are “grasping” the tree, and\nfurthermore I understand that the eyes (my eyes) are part of me,\nwhereas the tree is not part of me. The same is true of all of the\nsensory organs and their objects. The Abhidharma system calls the\nsensory organs the “internal” sense bases, and the sensory\nobjects the “external” ones. It is the combination of the\n“internal” sense bases upon which I impose the false\nconstruction of self. Thus perception provides the basis for the\nconceptual distinction between self and other.\n\nFor Yogācāra Buddhists, however, sense perception is just as\nfalse a “duality” as are false conceptual constructions.\nGiven that the external world must be only mind, the sensory\nexperience that we have of a world “out there” is only a\nfigment of our imagination. The self/other distinction implicit in\nperception is as much a false imposition as is the self/other\ndistinction implicit in the concept, “self.” Perception,\nlike conceptualization, is only a matter of the mind generating\n“dual” images. As counterintuitive as this sounds, it may\nbe clarified by analogy to the idea of a multi-player virtual reality\ngame. In a shared virtual reality experience, the first thing the\ncomputer system must be able to track is where, objectively,\neverything is (where the various players are, where the castle with\nthe hidden jewels is, where the dragon is hiding, etc.). Then, when\nany new player logs in, the system can place that player somewhere in\nthe multi-dimensional, virtual world. At that point, the computer must\ngenerate a sensory perspective for that individual. Immediately that\nperson experiences herself to exist in a world of a certain kind, with\ncertain abilities to move around, and fight, and so on. But this is\nonly a trick of the software. The world is unreal, and so is the\nplayer’s subjective perspective on that world.\n\nFor the Yogācāra, our sensory experience is something like\nthis. We are all only mental, and so the apparent physicalities that\nintervene between us are merely false constructions of our deluded\nminds. Furthermore, the physical body that we take ourselves to have,\nas we negotiate the world, making use of our senses, is also not\nthere. Both external and internal realities are mistaken to the degree\nthat we see them as “two” and not “nondual”\nconstructions arising out of a single mental stream.\n\nVasubandhu’s clearest, most evocative, and most famous\nexplanation of the three natures appears later on, when they are\nanalogized to a magician’s production of an illusion of an\nelephant, using a piece of wood and a magical spell:\n\n\n27. It is just as [something] made into a magical illusion with the\npower of an incantation (mantra) appears as the self of an\nelephant. A mere appearance (ākāramātra) is\nthere, but the elephant does not exist at all.\n\n28. The fabricated nature is the elephant; the dependent is its\nappearance (ākṛti); and the nonexistence of an\nelephant there is the perfected.\n\n29. In the same way, the fabrication of what does not exist appears as\nthe self of duality from the root mind. The duality is utterly\nnonexistent. A mere appearance (ākṛtimātraka)\nis there.\n\n30. The root-consciousness is like the incantation. Suchness\n(tathatā) is understood to be like the piece of wood.\nConstruction (vikalpa) should be accepted to be like the\nappearance of the elephant. The duality is like the\n elephant.[43]\n\n\nNotice the two different elements here in the ending of Verse 30: The\n“appearance of the elephant” is\n“construction,” that is, the ongoing process of\nimagination that arises from the karmic causal stream. The real\nproblem, though, “duality,” the dangerous, false\ndistinction between self and other, is analogized to the illusory\nelephant itself. If I am at a magic show, I should expect to see the\n“appearance of an elephant.” That will make the show worth\nattending. But if I am not a fool, I will not imagine myself to\nactually see an elephant. That would be to construct\nduality. For Vasubandhu, this is a crucial distinction. The basic\nproblem for living beings in his view is not that we\nexperience an illusory world; the problem is that we are\nfooled into accepting the reality of our perceptions and our\nconcepts. Once we no longer believe, once we see the falsity of the\nillusion, the illusion goes away and we can come to experience the\ntruth that lies behind the illusion—the ineffable\n“suchness” (tathatā), the piece of wood.\n",
    "section_title": "4.3 Three Natures and Non-Duality",
    "entry_title": "Vasubandhu",
    "hierarchy_title": "Vasubandhu || Major Yogācāra Arguments and Positions || Three Natures and Non-Duality",
    "tokenized_text": [
        "major",
        "yogācāra",
        "argument",
        "position",
        "three",
        "nature",
        "nonduality",
        "three",
        "nature",
        "nonduality",
        "vasubandhu",
        "work",
        "defending",
        "controversial",
        "yogācāra",
        "thesis",
        "appearanceonly",
        "vijñaptimātra",
        "twenty",
        "verse",
        "short",
        "poetic",
        "work",
        "thirty",
        "verse",
        "three",
        "nature",
        "exposition",
        "entertain",
        "objection",
        "instead",
        "draw",
        "together",
        "basic",
        "doctrinal",
        "conceptual",
        "vocabulary",
        "yogācāra",
        "tradition",
        "form",
        "elegant",
        "coherent",
        "system",
        "thirty",
        "verse",
        "includes",
        "complete",
        "treatment",
        "buddhist",
        "path",
        "yogācāra",
        "perspective",
        "order",
        "understand",
        "vasubandhu",
        "contribution",
        "text",
        "would",
        "necessary",
        "place",
        "wide",
        "backdrop",
        "previous",
        "yogācāra",
        "doctrine",
        "scholarly",
        "work",
        "ongoing",
        "let",
        "u",
        "focus",
        "instead",
        "introducing",
        "basic",
        "intricate",
        "doctrinal",
        "structure",
        "formulated",
        "three",
        "nature",
        "exposition",
        "three",
        "nature",
        "exposition",
        "take",
        "topic",
        "title",
        "three",
        "nature",
        "reality",
        "yogācāra",
        "perspective",
        "fabricated",
        "nature",
        "parikalpitasvabhāva",
        "dependent",
        "nature",
        "paratantrasvabhāva",
        "perfected",
        "nature",
        "pariniṣpannasvabhāva",
        "yogācāra",
        "metaphysics",
        "thing",
        "longer",
        "one",
        "nature",
        "one",
        "svabhāva",
        "rather",
        "thing",
        "three",
        "different",
        "interconnected",
        "nature",
        "may",
        "note",
        "immediately",
        "fundamentally",
        "differs",
        "treasury",
        "apparent",
        "purpose",
        "time",
        "determine",
        "singular",
        "nature",
        "entity",
        "dharma",
        "context",
        "discover",
        "entity",
        "must",
        "admitted",
        "one",
        "distinct",
        "nature",
        "would",
        "discover",
        "entity",
        "unreal",
        "something",
        "change",
        "instance",
        "internally",
        "inconsistent",
        "exhibiting",
        "multiple",
        "nature",
        "vasubandhu",
        "employ",
        "exactly",
        "argument",
        "deny",
        "ultimate",
        "reality",
        "many",
        "specific",
        "entity",
        "dharma",
        "treasury",
        "entity",
        "say",
        "unreal",
        "like",
        "self",
        "conceptual",
        "fabrication",
        "parikalpita",
        "one",
        "basic",
        "distinguishing",
        "feature",
        "great",
        "vehicle",
        "mahāyāna",
        "metaphysics",
        "affirmation",
        "person",
        "entity",
        "dharma",
        "empty",
        "self",
        "inherent",
        "nature",
        "svabhāva",
        "mean",
        "term",
        "laid",
        "treasury",
        "dharma",
        "conceptual",
        "fabrication",
        "way",
        "looking",
        "thing",
        "say",
        "thing",
        "three",
        "inherent",
        "nature",
        "take",
        "back",
        "great",
        "vehicle",
        "denial",
        "inherent",
        "nature",
        "rather",
        "explain",
        "say",
        "ordinarily",
        "take",
        "thing",
        "individual",
        "character",
        "identity",
        "best",
        "understood",
        "three",
        "angle",
        "explode",
        "unity",
        "first",
        "nature",
        "fabricated",
        "nature",
        "thing",
        "appears",
        "course",
        "use",
        "term",
        "indicate",
        "acceptance",
        "thing",
        "really",
        "exist",
        "way",
        "appear",
        "thing",
        "nature",
        "might",
        "defined",
        "explained",
        "ordinary",
        "abhidharma",
        "philosophy",
        "added",
        "proviso",
        "know",
        "really",
        "thing",
        "work",
        "second",
        "nature",
        "dependent",
        "nature",
        "vasubandhu",
        "defines",
        "causal",
        "process",
        "thing",
        "fabrication",
        "causal",
        "story",
        "brings",
        "thing",
        "apparent",
        "nature",
        "third",
        "nature",
        "finally",
        "emptiness",
        "first",
        "naturethe",
        "fact",
        "unreal",
        "exist",
        "appears",
        "let",
        "take",
        "important",
        "example",
        "buddhist",
        "thing",
        "appears",
        "real",
        "nature",
        "self",
        "example",
        "something",
        "mistakenly",
        "thought",
        "nature",
        "svabhāva",
        "may",
        "run",
        "three",
        "nature",
        "self",
        "appears",
        "self",
        "seem",
        "living",
        "typing",
        "keyboard",
        "thinking",
        "thought",
        "first",
        "nature",
        "second",
        "nature",
        "causal",
        "story",
        "brings",
        "seeming",
        "self",
        "cycle",
        "dependent",
        "origination",
        "might",
        "appeal",
        "standard",
        "abhidharma",
        "causal",
        "story",
        "say",
        "twelve",
        "sense",
        "base",
        "five",
        "aggregate",
        "causally",
        "conjoined",
        "bring",
        "conceptuallyfabricated",
        "self",
        "yogācāra",
        "causal",
        "story",
        "entirely",
        "mental",
        "course",
        "appeal",
        "sense",
        "base",
        "real",
        "cause",
        "rather",
        "sense",
        "base",
        "appear",
        "due",
        "karmic",
        "conditioning",
        "mental",
        "stream",
        "reason",
        "second",
        "nature",
        "instead",
        "said",
        "causal",
        "series",
        "according",
        "mental",
        "seed",
        "planted",
        "previous",
        "deed",
        "ripen",
        "appearance",
        "sense",
        "base",
        "think",
        "perceiving",
        "thingswhich",
        "turn",
        "make",
        "think",
        "self",
        "finally",
        "third",
        "nature",
        "nonexistence",
        "self",
        "fact",
        "exist",
        "appears",
        "course",
        "real",
        "self",
        "could",
        "provided",
        "explanation",
        "come",
        "appear",
        "vasubandhu",
        "telling",
        "three",
        "nature",
        "one",
        "reality",
        "viewed",
        "three",
        "distinct",
        "angle",
        "appearance",
        "process",
        "emptiness",
        "apparent",
        "entity",
        "mind",
        "read",
        "opening",
        "verse",
        "three",
        "nature",
        "exposition",
        "fabricated",
        "dependent",
        "perfected",
        "wise",
        "understand",
        "depth",
        "three",
        "nature",
        "appears",
        "dependent",
        "appears",
        "fabricated",
        "dependent",
        "condition",
        "fabrication",
        "eternal",
        "nonexistence",
        "appearance",
        "appears",
        "known",
        "perfected",
        "nature",
        "always",
        "appears",
        "unreal",
        "fabrication",
        "appear",
        "dual",
        "self",
        "nonexistence",
        "nondual",
        "reality",
        "verse",
        "emphasize",
        "crystalline",
        "internal",
        "structure",
        "three",
        "nature",
        "appears",
        "one",
        "nature",
        "dependent",
        "whereas",
        "appears",
        "fabricated",
        "eternal",
        "nonexistence",
        "appearance",
        "appears",
        "perfected",
        "way",
        "talking",
        "entity",
        "event",
        "different",
        "perspective",
        "also",
        "evident",
        "crucial",
        "yogācāra",
        "concept",
        "duality",
        "fabricated",
        "said",
        "appear",
        "dual",
        "self",
        "whereas",
        "reality",
        "dharmatā",
        "nondual",
        "since",
        "seen",
        "vasubandhu",
        "belief",
        "selflessness",
        "dharma",
        "dual",
        "self",
        "false",
        "appearance",
        "self",
        "attributed",
        "entity",
        "thing",
        "self",
        "mistakenly",
        "appear",
        "dual",
        "mean",
        "twosome",
        "denied",
        "denial",
        "duality",
        "many",
        "interpretation",
        "across",
        "yogācāra",
        "thought",
        "vasubandhu",
        "important",
        "kind",
        "duality",
        "conceptual",
        "duality",
        "perceptual",
        "duality",
        "conceptual",
        "duality",
        "bifurcation",
        "universe",
        "appears",
        "necessary",
        "formation",
        "concept",
        "say",
        "given",
        "thing",
        "physical",
        "effectively",
        "saying",
        "time",
        "thing",
        "either",
        "physical",
        "physical",
        "create",
        "duality",
        "according",
        "may",
        "understand",
        "thing",
        "falling",
        "either",
        "one",
        "category",
        "define",
        "something",
        "ascribe",
        "characteristic",
        "nature",
        "svabhāva",
        "every",
        "self",
        "dual",
        "say",
        "something",
        "imposes",
        "duality",
        "upon",
        "world",
        "given",
        "world",
        "causal",
        "flux",
        "accord",
        "conceptual",
        "construct",
        "every",
        "duality",
        "imposes",
        "false",
        "construct",
        "upon",
        "world",
        "illuminate",
        "regard",
        "person",
        "say",
        "exist",
        "dividing",
        "universe",
        "self",
        "me",
        "notme",
        "since",
        "buddhist",
        "self",
        "unreal",
        "mistaken",
        "imposition",
        "course",
        "many",
        "ignorant",
        "selfish",
        "action",
        "follow",
        "fundamental",
        "conceptual",
        "error",
        "addition",
        "closely",
        "related",
        "conceptual",
        "duality",
        "perceptual",
        "duality",
        "distinction",
        "sensory",
        "organ",
        "object",
        "appears",
        "perception",
        "see",
        "tree",
        "immediate",
        "impression",
        "distinction",
        "tree",
        "see",
        "eye",
        "organ",
        "see",
        "tree",
        "take",
        "eye",
        "grasping",
        "tree",
        "furthermore",
        "understand",
        "eye",
        "eye",
        "part",
        "whereas",
        "tree",
        "part",
        "true",
        "sensory",
        "organ",
        "object",
        "abhidharma",
        "system",
        "call",
        "sensory",
        "organ",
        "internal",
        "sense",
        "base",
        "sensory",
        "object",
        "external",
        "one",
        "combination",
        "internal",
        "sense",
        "base",
        "upon",
        "impose",
        "false",
        "construction",
        "self",
        "thus",
        "perception",
        "provides",
        "basis",
        "conceptual",
        "distinction",
        "self",
        "yogācāra",
        "buddhist",
        "however",
        "sense",
        "perception",
        "false",
        "duality",
        "false",
        "conceptual",
        "construction",
        "given",
        "external",
        "world",
        "must",
        "mind",
        "sensory",
        "experience",
        "world",
        "figment",
        "imagination",
        "selfother",
        "distinction",
        "implicit",
        "perception",
        "much",
        "false",
        "imposition",
        "selfother",
        "distinction",
        "implicit",
        "concept",
        "self",
        "perception",
        "like",
        "conceptualization",
        "matter",
        "mind",
        "generating",
        "dual",
        "image",
        "counterintuitive",
        "sound",
        "may",
        "clarified",
        "analogy",
        "idea",
        "multiplayer",
        "virtual",
        "reality",
        "game",
        "shared",
        "virtual",
        "reality",
        "experience",
        "first",
        "thing",
        "computer",
        "system",
        "must",
        "able",
        "track",
        "objectively",
        "everything",
        "various",
        "player",
        "castle",
        "hidden",
        "jewel",
        "dragon",
        "hiding",
        "etc",
        "new",
        "player",
        "log",
        "system",
        "place",
        "player",
        "somewhere",
        "multidimensional",
        "virtual",
        "world",
        "point",
        "computer",
        "must",
        "generate",
        "sensory",
        "perspective",
        "individual",
        "immediately",
        "person",
        "experience",
        "exist",
        "world",
        "certain",
        "kind",
        "certain",
        "ability",
        "move",
        "around",
        "fight",
        "trick",
        "software",
        "world",
        "unreal",
        "player",
        "subjective",
        "perspective",
        "world",
        "yogācāra",
        "sensory",
        "experience",
        "something",
        "like",
        "mental",
        "apparent",
        "physicality",
        "intervene",
        "u",
        "merely",
        "false",
        "construction",
        "deluded",
        "mind",
        "furthermore",
        "physical",
        "body",
        "take",
        "negotiate",
        "world",
        "making",
        "use",
        "sens",
        "also",
        "external",
        "internal",
        "reality",
        "mistaken",
        "degree",
        "see",
        "two",
        "nondual",
        "construction",
        "arising",
        "single",
        "mental",
        "stream",
        "vasubandhu",
        "clearest",
        "evocative",
        "famous",
        "explanation",
        "three",
        "nature",
        "appears",
        "later",
        "analogized",
        "magician",
        "production",
        "illusion",
        "elephant",
        "using",
        "piece",
        "wood",
        "magical",
        "spell",
        "something",
        "made",
        "magical",
        "illusion",
        "power",
        "incantation",
        "mantra",
        "appears",
        "self",
        "elephant",
        "mere",
        "appearance",
        "ākāramātra",
        "elephant",
        "exist",
        "fabricated",
        "nature",
        "elephant",
        "dependent",
        "appearance",
        "ākṛti",
        "nonexistence",
        "elephant",
        "perfected",
        "way",
        "fabrication",
        "exist",
        "appears",
        "self",
        "duality",
        "root",
        "mind",
        "duality",
        "utterly",
        "nonexistent",
        "mere",
        "appearance",
        "ākṛtimātraka",
        "rootconsciousness",
        "like",
        "incantation",
        "suchness",
        "tathatā",
        "understood",
        "like",
        "piece",
        "wood",
        "construction",
        "vikalpa",
        "accepted",
        "like",
        "appearance",
        "elephant",
        "duality",
        "like",
        "elephant",
        "notice",
        "two",
        "different",
        "element",
        "ending",
        "verse",
        "appearance",
        "elephant",
        "construction",
        "ongoing",
        "process",
        "imagination",
        "arises",
        "karmic",
        "causal",
        "stream",
        "real",
        "problem",
        "though",
        "duality",
        "dangerous",
        "false",
        "distinction",
        "self",
        "analogized",
        "illusory",
        "elephant",
        "magic",
        "show",
        "expect",
        "see",
        "appearance",
        "elephant",
        "make",
        "show",
        "worth",
        "attending",
        "fool",
        "imagine",
        "actually",
        "see",
        "elephant",
        "would",
        "construct",
        "duality",
        "vasubandhu",
        "crucial",
        "distinction",
        "basic",
        "problem",
        "living",
        "being",
        "view",
        "experience",
        "illusory",
        "world",
        "problem",
        "fooled",
        "accepting",
        "reality",
        "perception",
        "concept",
        "longer",
        "believe",
        "see",
        "falsity",
        "illusion",
        "illusion",
        "go",
        "away",
        "come",
        "experience",
        "truth",
        "lie",
        "behind",
        "illusionthe",
        "ineffable",
        "suchness",
        "tathatā",
        "piece",
        "wood"
    ]
}