{
    "main_text": "Major Yogācāra Arguments and Positions || Three Natures and Non-Duality\n5. Controversy over Vasubandhu as “Idealist”\n\nLet us posit that metaphysical idealism need not be the\ncounterintuitive view that all that exists is, simply, mental. To call\na view idealist it is sufficient merely that it hold that everything\nis dependent upon mind—a mind, or many minds. Idealists\nhold that the natures or forms of things are mind-dependent. Of\ncourse, such dependence is, in itself, counterintuitive, given that we\ngenerally take the physical world to have existence independent of\nminds. Contemporary prevailing wisdom holds that the direction of\ncausal dependence goes in the opposite direction; the physical world\nin fact generates and sustains minds (using neurons to do so).\nIdealism says that ideas, or minds, are in one way or other behind, or\nprior to, all other forms of existence.\n\nGiven this definition, is Vasubandhu, the author of the Twenty\nVerses and the Thirty Verses and probably the Three\nNatures Exposition, a metaphysical idealist? At first blush, it\nseems quite sensible to say that he is. The evident purpose of the\nTwenty Verses is to argue that the core background\nassumptions of Mahāyāna Buddhism (especially its views on\nkarma) suggest the idealistic thesis that is asserted in the\ntext’s opening: “In the Great Vehicle, the threefold world\nis only\n appearance.”[44]\n Vasubandhu argues throughout the Twenty Verses that whatever\naspects of the world appear to be independent of mind, they are better\nexplained as mental constructions. What that means is, apparently,\nthat not only is Vasubandhu an idealist in the sense that he believes\nthat everything in experience is dependent upon mind, but he also\nbelieves that everything simply is mind. This is the radical\n“mind only” (cittamātra) position that he\nbelieves is necessitated by adherence to a Mahāyāna\nworldview.\n\nThings are not quite this simple, however. First, it is important to\nnote two levels to Vasubandhu’s “idealism.” The\nfirst level points to an analysis of what appears in perception.\nVasubandhu says that everything that we ordinarily ascribe existence\nin the world—such as a self or an object—is actually only\nmental. Tables and nebulae and eyes are mental fabrications that have\nno existence apart from their “shape”\n(ākāra), the way they\n appear.[45]\n The second level points to the causal story that brings about such\nappearances. Along with other Yogācārins, Vasubandhu argues\nthat that causal story too is only mental. Perception, in the\nform of active sensory and mental consciousnesses, is caused by the\n“storehouse consciousness”\n(ālayavijñāna), which stores, in mental\nform, the seeds of all of our future experiences. The storehouse is\nconstantly replenished, because new “seeds”\n(bīja) are created every time we enact a morally\nsignificant action (karma).\n\nIt is mental causation, then, that brings about our mental\nexperiences. It is this second level, then, that confirms Vasubandhu\nas an idealist. Not only the reality that we inhabit (which we\nordinarily think of as at least partly non-mental), but also the\ncausal supports upon which such a reality depends, are only\nmental. Even if the storehouse consciousnesses of living beings\nprovided ongoing support to a real, physical world, we would\nstill want to call that view “idealism” for its\ninsistence on the causal priority of the mental. Since Vasubandhu does\nnot say as much, but instead says that everything that is created by\nminds is itself mental, we might say that in addition to a causal\nidealism, Vasubandhu’s is a universal, ontological idealism.\n\nBehind both of these levels, however, there is an important sense in\nwhich Vasubandhu is not really an idealist. Like all\nMahāyāna Buddhists, Vasubandhu believes that whatever can be\nstated in language is only conventional, and therefore, from an\nultimate perspective, it is mistaken. Ultimate reality is an\ninconceivable “thusness” (tathatā) that is\nperceived and known only by enlightened beings. Ultimately, therefore,\nthe idea of “mind” is just as mistaken as are ordinary\n“external objects.” For this reason, we can say that\nVasubandhu is an idealist, but only in the realm of conventions.\nUltimately, he affirms ineffability.\n\n\n\n\nLevel 1\nExperience\n False Appearances (self, objects,\nconcepts) \nIdealism \n\nLevel 2\nCausality\nStorehouse Consciousness (produces\nconsciousness)\nIdealism \n\nLevel 3\nUltimate Reality\nOnly Buddhas Know (tathatā)\n Ineffability \n \n\n\nLevels of Analysis of Vasubandhu\n\n\nIt is extremely important to keep these levels apart, in order to\nprevent Vasubandhu from committing an evident self-contradiction. At\nthe end of his commentary to verse 10 of the Twenty Verses,\nVasubandhu imagines an interlocutor challenging the appearance-only\nview by saying that if no dharmas exist at all, then so also\nappearance-only doesn’t exist. How, then, can it be established?\nThis charge of self-referential incoherence is faced by anti-realists\nof all stripes, and it is familiar to Buddhist philosophers from\nNāgārjuna’s Vīgrahavyāvartanī.\n(See the entry on\n Nāgārjuna\n in this encyclopedia.) Vasubandhu’s reply in the Twenty\nVerses Commentary is that appearance-only does not mean the\nnonexistence of dharmas. It only means the absence of a nature\n(svabhāva) that is falsely attributed to a constructed\nself (kalpitātmanā), and Vasubandhu is quick to say\nthat when one establishes appearance-only, appearance-only must\nalso be understood to be itself a construction, without a\nself. Otherwise, there would be something other than an appearance,\nwhich would by definition contradict appearance-only. All there is, is\nappearance, and everything that appears is a false construction of\nself.\n\nWe can take two important lessons from this. First,\nrepresentation-only cannot be the ultimate truth. If Vasubandhu were\naffirming the ultimate reality of the “mind-only” causal\nstory that brings about appearances, or the appearances themselves\n(levels 2 and 1, respectively), then he would surely have said so in\nresponse to the charge of self-referential, nihilistic incoherence.\nInstead, his argument adverts to another level for ultimate reality.\nMadhyamaka critics of Yogācāra have made much of the notion\nthat the latter have reified the mind and made it a new\n “ultimate.”[46]\n Yet Vasubandhu’s position is clearly intended to elude such a\ncritique.\n\nSecond, for Vasubandhu the lack of a self-nature\n(svabhāva) just is, precisely, what he means by\n“appearance-only.” This is also contrary to a common\nunderstanding of Yogācāra which arises from the equation of\n“appearance-only” with “mind-only.” This\nequation is not, technically, a mistake in the case of Vasubandhu. He\nsays, specifically, that “mind” (citta) and\n“appearance” (vijñapti) are synonyms. The\nmistake is what we moderns tend to think, based on a background\nassumption of mind/matter Cartesian dualism—namely, that the\nexpression “mind only” is used to affirm the reality of\nthe mental at the expense of the physical. Here, reality is certainly\nnot physical, but that is not Vasubandhu’s point. His point is\nto equate the lack of independent nature (svabhāva) with\nthe product of mental construction. This is a simple statement of\nidealism, as mentioned above: Everything that exists must either have\nindependent existence, or be dependent upon mind, a mental\nconstruction; and since, for the Great Vehicle, nothing has\nindependent existence, everything is only a mental construction. What\nit means to be “mind only,” then, is not simply to be made\nof mental stuff rather than physical stuff. It is to be a false\nconstruction by a deluded mind. Again, we can see that there is no\npossibility that Vasubandhu is talking about the\n“ultimate” here.\n\nThese points, and the above table, may clarify some of the\ndifficulties in the ongoing, contentious debates over whether\nVasubandhu and other Yogācārins should be classified as\nidealists or mystics. A quarter century ago, Thomas A. Kochumuttom\n(1982) argued quite powerfully and sensibly for his time that\nVasubandhu should not be called an idealist, but he was\narguing primarily against authors such as Theodore Stcherbatsky and S.\nN. Dasgupta, about whom he wrote (200):\n\nAll of the above quoted passages clearly show that their authors\nalmost unanimously accept vijñapti-mātratā\nor prajñapti-mātratā or\ncitta-mātratā as the Yogācārin’s\ndescription of the absolute, undefiled, undifferentiated, non-dual,\ntranscendent, pure, ultimate, permanent, unchanging, eternal,\nsupra-mundane, unthinkable, Reality, which, according to them, is the\nsame as Parniṣpanna-svabhāva, or\nNirvāṇa, or Pure Consciousness, or\nDharma-dhātu, or Dharma-kāya, or the\nAbsolute Idea of Hegel, or the Brahman of Vedānta.\n\n\nOne can appreciate Kochumuttom’s frustration. Vasubandhu is\ncautious not to conflate a description of perceived entities as\nreducible to only mind (Level 1) with a description of the ineffable\nultimate reality (Level 3). Vasubandhu explicitly denies that\n“mind” has ultimate reality. He is not a Hegelian\nidealist.\n\nBut not all idealists are Hegelian, absolute idealists. Among\nidealisms, Vasubandhu’s is more closely aligned with\nKant’s, in that both assert that the objects of our experience\nare only representations, while both also affirm the reality of\nunknowable things in themselves (Ding an\n sich).[47]\n Kochumuttom was aware of this, and even in the course of his extended\nargument against using the term “idealism” for Vasubandhu,\nhe allowed that the term might be appropriate if understood in this\nway:\n\nThis should not be understood to mean that there are no things other\nthan consciousness. On the contrary, it means only that what falls\nwithin the range of experience are different forms of consciousness,\nwhile the things-in-themselves remain beyond the limits of experience.\n(48)\n\n\nThe form in which a thing is thought to be grasped is purely imagined\n(parikalpita), and therefore is no sure guide to the\nthing-in-itself. It is in this sense, and only in this sense, that\nVasubandhu’s system can be called idealism. It by no means\nimplies that there is nothing apart from ideas or consciousness. (53)\n\n\nIs the term “idealism” acceptable for the view that, even\nif nothing expressible in language has ultimate reality, mental events\nare still more real than physical events, which do not have\neven conventional reality? Perhaps “conventionalist\nidealism” would be a good term for this view, but surely it sits\nsquarely within the range of idealisms. To say, with emphasis, as some\ndo, that this view is not idealism, may be to privilege a\nnarrow understanding of the term.\n\nIn addition, the issue may be more than semantic. It will strike some\nas overstating the case to say, as Kochumuttom does, that the fact\nthat everything within perception is only mind “by no means\nimplies that there is nothing apart from ideas or\nconsciousness.” Vasubandhu’s arguments in the Twenty\nVerses are intended to exclude the possibility of anything at all\nthat may be coherently asserted to be\n non-mental.[48]\n So the doctrine of appearance-only does imply that there is\nnothing apart from ideas or consciousness, at least, as far as logic\nand implications are allowed to go. The only exceptions would be\nthings about which we can say nothing. So what could allow us to say\nabout them that they are\n exceptions?[49]\n\nWhether or not one wants to use the word “idealism” for\nVasubandhu thus depends to a large degree upon just how strongly one\nwants to lean upon the idea that idealists must affirm the\nultimate reality of mind. The main arguments that remain\nagainst viewing Vasubandhu as an idealist, exemplified prominently\ntoday by Dan Lusthaus, emphasize this idea. Given that many Buddhists\nin India, Tibet and East Asia have understood the Yogācāra\nto be affirming the ultimate reality of the mental, the denial of such\na view on Vasubandhu’s behalf is an important and useful\ncorrective. Lusthaus believes that Vasubandhu is not a\n“metaphysical idealist” or an “ontological\nidealist” but rather an “epistemological idealist,”\nmeaning that Vasubandhu is concerned only about awareness and its\ncontents, and is not in the business of affirming or denying anything\nabout ultimate reality. For this reason, Lusthaus refers to\nYogācāra as\n “phenomenology.”[50]\n\nA final complaint is that the use of the term “idealism”\nis anachronistic or for some other reason inappropriate in its\napplication to pre-modern India. Kochummutom’s point that the\nterm encompasses too much is well taken. It is one thing (perhaps\nalready stretching the meaning) to apply the term\n“idealism,” as R.P. Srivastava (1973) does, to modern\nthinkers whose views have been influenced by European idealists, such\nas Aurobindo, Vivekananda and Radhakrishnan. But it is anachronistic\nif we are to impose upon Vasubandhu the modern associations and\nbaggage that come along with the term, which would include an advocacy\nof private, personal, sacred, “religious experience.”\nVasubandhu may be an idealist, in a strict sense, but he is not what\n20th century religious studies textbooks call a\n“mystic philosopher.” Vasubandhu does not, generally,\nappeal to his own, individual personal experience as evidence or\nconfirmation of his positions. On the contrary, Vasubandhu repeatedly\nemploys reasoning to cast doubts upon the apparent realities evident\nthrough perception, whether external or internal. This is, perhaps, a\nreason to avoid describing Vasubandhu as a\n“phenomenologist.” His work does not take the direct\nexamination of “experience” as its theme, but, rather, it\ndraws upon scripture and rational argumentation for its critiques of\nthe available accounts of reality.\n",
    "section_title": "5. Controversy over Vasubandhu as “Idealist”",
    "entry_title": "Vasubandhu",
    "hierarchy_title": "Vasubandhu || Major Yogācāra Arguments and Positions || Three Natures and Non-Duality",
    "tokenized_text": [
        "major",
        "yogācāra",
        "argument",
        "position",
        "three",
        "nature",
        "nonduality",
        "controversy",
        "vasubandhu",
        "idealist",
        "let",
        "u",
        "posit",
        "metaphysical",
        "idealism",
        "need",
        "counterintuitive",
        "view",
        "exists",
        "simply",
        "mental",
        "call",
        "view",
        "idealist",
        "sufficient",
        "merely",
        "hold",
        "everything",
        "dependent",
        "upon",
        "minda",
        "mind",
        "many",
        "mind",
        "idealist",
        "hold",
        "nature",
        "form",
        "thing",
        "minddependent",
        "course",
        "dependence",
        "counterintuitive",
        "given",
        "generally",
        "take",
        "physical",
        "world",
        "existence",
        "independent",
        "mind",
        "contemporary",
        "prevailing",
        "wisdom",
        "hold",
        "direction",
        "causal",
        "dependence",
        "go",
        "opposite",
        "direction",
        "physical",
        "world",
        "fact",
        "generates",
        "sustains",
        "mind",
        "using",
        "neuron",
        "idealism",
        "say",
        "idea",
        "mind",
        "one",
        "way",
        "behind",
        "prior",
        "form",
        "existence",
        "given",
        "definition",
        "vasubandhu",
        "author",
        "twenty",
        "verse",
        "thirty",
        "verse",
        "probably",
        "three",
        "nature",
        "exposition",
        "metaphysical",
        "idealist",
        "first",
        "blush",
        "seems",
        "quite",
        "sensible",
        "say",
        "evident",
        "purpose",
        "twenty",
        "verse",
        "argue",
        "core",
        "background",
        "assumption",
        "mahāyāna",
        "buddhism",
        "especially",
        "view",
        "karma",
        "suggest",
        "idealistic",
        "thesis",
        "asserted",
        "text",
        "opening",
        "great",
        "vehicle",
        "threefold",
        "world",
        "appearance",
        "vasubandhu",
        "argues",
        "throughout",
        "twenty",
        "verse",
        "whatever",
        "aspect",
        "world",
        "appear",
        "independent",
        "mind",
        "better",
        "explained",
        "mental",
        "construction",
        "mean",
        "apparently",
        "vasubandhu",
        "idealist",
        "sense",
        "belief",
        "everything",
        "experience",
        "dependent",
        "upon",
        "mind",
        "also",
        "belief",
        "everything",
        "simply",
        "mind",
        "radical",
        "mind",
        "cittamātra",
        "position",
        "belief",
        "necessitated",
        "adherence",
        "mahāyāna",
        "worldview",
        "thing",
        "quite",
        "simple",
        "however",
        "first",
        "important",
        "note",
        "two",
        "level",
        "vasubandhu",
        "idealism",
        "first",
        "level",
        "point",
        "analysis",
        "appears",
        "perception",
        "vasubandhu",
        "say",
        "everything",
        "ordinarily",
        "ascribe",
        "existence",
        "worldsuch",
        "self",
        "objectis",
        "actually",
        "mental",
        "table",
        "nebula",
        "eye",
        "mental",
        "fabrication",
        "existence",
        "apart",
        "shape",
        "ākāra",
        "way",
        "appear",
        "second",
        "level",
        "point",
        "causal",
        "story",
        "brings",
        "appearance",
        "along",
        "yogācārins",
        "vasubandhu",
        "argues",
        "causal",
        "story",
        "mental",
        "perception",
        "form",
        "active",
        "sensory",
        "mental",
        "consciousness",
        "caused",
        "storehouse",
        "consciousness",
        "ālayavijñāna",
        "store",
        "mental",
        "form",
        "seed",
        "future",
        "experience",
        "storehouse",
        "constantly",
        "replenished",
        "new",
        "seed",
        "bīja",
        "created",
        "every",
        "time",
        "enact",
        "morally",
        "significant",
        "action",
        "karma",
        "mental",
        "causation",
        "brings",
        "mental",
        "experience",
        "second",
        "level",
        "confirms",
        "vasubandhu",
        "idealist",
        "reality",
        "inhabit",
        "ordinarily",
        "think",
        "least",
        "partly",
        "nonmental",
        "also",
        "causal",
        "support",
        "upon",
        "reality",
        "depends",
        "mental",
        "even",
        "storehouse",
        "consciousness",
        "living",
        "being",
        "provided",
        "ongoing",
        "support",
        "real",
        "physical",
        "world",
        "would",
        "still",
        "want",
        "call",
        "view",
        "idealism",
        "insistence",
        "causal",
        "priority",
        "mental",
        "since",
        "vasubandhu",
        "say",
        "much",
        "instead",
        "say",
        "everything",
        "created",
        "mind",
        "mental",
        "might",
        "say",
        "addition",
        "causal",
        "idealism",
        "vasubandhu",
        "universal",
        "ontological",
        "idealism",
        "behind",
        "level",
        "however",
        "important",
        "sense",
        "vasubandhu",
        "really",
        "idealist",
        "like",
        "mahāyāna",
        "buddhist",
        "vasubandhu",
        "belief",
        "whatever",
        "stated",
        "language",
        "conventional",
        "therefore",
        "ultimate",
        "perspective",
        "mistaken",
        "ultimate",
        "reality",
        "inconceivable",
        "thusness",
        "tathatā",
        "perceived",
        "known",
        "enlightened",
        "being",
        "ultimately",
        "therefore",
        "idea",
        "mind",
        "mistaken",
        "ordinary",
        "external",
        "objects",
        "reason",
        "say",
        "vasubandhu",
        "idealist",
        "realm",
        "convention",
        "ultimately",
        "affirms",
        "ineffability",
        "level",
        "experience",
        "false",
        "appearance",
        "self",
        "object",
        "concept",
        "idealism",
        "level",
        "causality",
        "storehouse",
        "consciousness",
        "produce",
        "consciousness",
        "idealism",
        "level",
        "ultimate",
        "reality",
        "buddha",
        "know",
        "tathatā",
        "ineffability",
        "level",
        "analysis",
        "vasubandhu",
        "extremely",
        "important",
        "keep",
        "level",
        "apart",
        "order",
        "prevent",
        "vasubandhu",
        "committing",
        "evident",
        "selfcontradiction",
        "end",
        "commentary",
        "verse",
        "twenty",
        "verse",
        "vasubandhu",
        "imago",
        "interlocutor",
        "challenging",
        "appearanceonly",
        "view",
        "saying",
        "dharma",
        "exist",
        "also",
        "appearanceonly",
        "exist",
        "established",
        "charge",
        "selfreferential",
        "incoherence",
        "faced",
        "antirealists",
        "stripe",
        "familiar",
        "buddhist",
        "philosopher",
        "nāgārjuna",
        "vīgrahavyāvartanī",
        "see",
        "entry",
        "nāgārjuna",
        "encyclopedia",
        "vasubandhu",
        "reply",
        "twenty",
        "verse",
        "commentary",
        "appearanceonly",
        "mean",
        "nonexistence",
        "dharma",
        "mean",
        "absence",
        "nature",
        "svabhāva",
        "falsely",
        "attributed",
        "constructed",
        "self",
        "kalpitātmanā",
        "vasubandhu",
        "quick",
        "say",
        "one",
        "establishes",
        "appearanceonly",
        "appearanceonly",
        "must",
        "also",
        "understood",
        "construction",
        "without",
        "self",
        "otherwise",
        "would",
        "something",
        "appearance",
        "would",
        "definition",
        "contradict",
        "appearanceonly",
        "appearance",
        "everything",
        "appears",
        "false",
        "construction",
        "self",
        "take",
        "two",
        "important",
        "lesson",
        "first",
        "representationonly",
        "ultimate",
        "truth",
        "vasubandhu",
        "affirming",
        "ultimate",
        "reality",
        "mindonly",
        "causal",
        "story",
        "brings",
        "appearance",
        "appearance",
        "level",
        "respectively",
        "would",
        "surely",
        "said",
        "response",
        "charge",
        "selfreferential",
        "nihilistic",
        "incoherence",
        "instead",
        "argument",
        "advert",
        "another",
        "level",
        "ultimate",
        "reality",
        "madhyamaka",
        "critic",
        "yogācāra",
        "made",
        "much",
        "notion",
        "latter",
        "reified",
        "mind",
        "made",
        "new",
        "ultimate",
        "yet",
        "vasubandhu",
        "position",
        "clearly",
        "intended",
        "elude",
        "critique",
        "second",
        "vasubandhu",
        "lack",
        "selfnature",
        "svabhāva",
        "precisely",
        "mean",
        "appearanceonly",
        "also",
        "contrary",
        "common",
        "understanding",
        "yogācāra",
        "arises",
        "equation",
        "appearanceonly",
        "mindonly",
        "equation",
        "technically",
        "mistake",
        "case",
        "vasubandhu",
        "say",
        "specifically",
        "mind",
        "citta",
        "appearance",
        "vijñapti",
        "synonym",
        "mistake",
        "modern",
        "tend",
        "think",
        "based",
        "background",
        "assumption",
        "mindmatter",
        "cartesian",
        "dualismnamely",
        "expression",
        "mind",
        "used",
        "affirm",
        "reality",
        "mental",
        "expense",
        "physical",
        "reality",
        "certainly",
        "physical",
        "vasubandhu",
        "point",
        "point",
        "equate",
        "lack",
        "independent",
        "nature",
        "svabhāva",
        "product",
        "mental",
        "construction",
        "simple",
        "statement",
        "idealism",
        "mentioned",
        "everything",
        "exists",
        "must",
        "either",
        "independent",
        "existence",
        "dependent",
        "upon",
        "mind",
        "mental",
        "construction",
        "since",
        "great",
        "vehicle",
        "nothing",
        "independent",
        "existence",
        "everything",
        "mental",
        "construction",
        "mean",
        "mind",
        "simply",
        "made",
        "mental",
        "stuff",
        "rather",
        "physical",
        "stuff",
        "false",
        "construction",
        "deluded",
        "mind",
        "see",
        "possibility",
        "vasubandhu",
        "talking",
        "ultimate",
        "point",
        "table",
        "may",
        "clarify",
        "difficulty",
        "ongoing",
        "contentious",
        "debate",
        "whether",
        "vasubandhu",
        "yogācārins",
        "classified",
        "idealist",
        "mystic",
        "quarter",
        "century",
        "ago",
        "thomas",
        "a",
        "kochumuttom",
        "argued",
        "quite",
        "powerfully",
        "sensibly",
        "time",
        "vasubandhu",
        "called",
        "idealist",
        "arguing",
        "primarily",
        "author",
        "theodore",
        "stcherbatsky",
        "s",
        "n",
        "dasgupta",
        "wrote",
        "quoted",
        "passage",
        "clearly",
        "show",
        "author",
        "almost",
        "unanimously",
        "accept",
        "vijñaptimātratā",
        "prajñaptimātratā",
        "cittamātratā",
        "yogācārin",
        "description",
        "absolute",
        "undefiled",
        "undifferentiated",
        "nondual",
        "transcendent",
        "pure",
        "ultimate",
        "permanent",
        "unchanging",
        "eternal",
        "supramundane",
        "unthinkable",
        "reality",
        "according",
        "parniṣpannasvabhāva",
        "nirvāṇa",
        "pure",
        "consciousness",
        "dharmadhātu",
        "dharmakāya",
        "absolute",
        "idea",
        "hegel",
        "brahman",
        "vedānta",
        "one",
        "appreciate",
        "kochumuttom",
        "frustration",
        "vasubandhu",
        "cautious",
        "conflate",
        "description",
        "perceived",
        "entity",
        "reducible",
        "mind",
        "level",
        "description",
        "ineffable",
        "ultimate",
        "reality",
        "level",
        "vasubandhu",
        "explicitly",
        "denies",
        "mind",
        "ultimate",
        "reality",
        "hegelian",
        "idealist",
        "idealist",
        "hegelian",
        "absolute",
        "idealist",
        "among",
        "idealism",
        "vasubandhu",
        "closely",
        "aligned",
        "kant",
        "assert",
        "object",
        "experience",
        "representation",
        "also",
        "affirm",
        "reality",
        "unknowable",
        "thing",
        "ding",
        "sich",
        "kochumuttom",
        "aware",
        "even",
        "course",
        "extended",
        "argument",
        "using",
        "term",
        "idealism",
        "vasubandhu",
        "allowed",
        "term",
        "might",
        "appropriate",
        "understood",
        "way",
        "understood",
        "mean",
        "thing",
        "consciousness",
        "contrary",
        "mean",
        "fall",
        "within",
        "range",
        "experience",
        "different",
        "form",
        "consciousness",
        "thingsinthemselves",
        "remain",
        "beyond",
        "limit",
        "experience",
        "form",
        "thing",
        "thought",
        "grasped",
        "purely",
        "imagined",
        "parikalpita",
        "therefore",
        "sure",
        "guide",
        "thinginitself",
        "sense",
        "sense",
        "vasubandhu",
        "system",
        "called",
        "idealism",
        "mean",
        "implies",
        "nothing",
        "apart",
        "idea",
        "consciousness",
        "term",
        "idealism",
        "acceptable",
        "view",
        "even",
        "nothing",
        "expressible",
        "language",
        "ultimate",
        "reality",
        "mental",
        "event",
        "still",
        "real",
        "physical",
        "event",
        "even",
        "conventional",
        "reality",
        "perhaps",
        "conventionalist",
        "idealism",
        "would",
        "good",
        "term",
        "view",
        "surely",
        "sits",
        "squarely",
        "within",
        "range",
        "idealism",
        "say",
        "emphasis",
        "view",
        "idealism",
        "may",
        "privilege",
        "narrow",
        "understanding",
        "term",
        "addition",
        "issue",
        "may",
        "semantic",
        "strike",
        "overstating",
        "case",
        "say",
        "kochumuttom",
        "fact",
        "everything",
        "within",
        "perception",
        "mind",
        "mean",
        "implies",
        "nothing",
        "apart",
        "idea",
        "consciousness",
        "vasubandhu",
        "argument",
        "twenty",
        "verse",
        "intended",
        "exclude",
        "possibility",
        "anything",
        "may",
        "coherently",
        "asserted",
        "nonmental",
        "doctrine",
        "appearanceonly",
        "imply",
        "nothing",
        "apart",
        "idea",
        "consciousness",
        "least",
        "far",
        "logic",
        "implication",
        "allowed",
        "go",
        "exception",
        "would",
        "thing",
        "say",
        "nothing",
        "could",
        "allow",
        "u",
        "say",
        "exception",
        "whether",
        "one",
        "want",
        "use",
        "word",
        "idealism",
        "vasubandhu",
        "thus",
        "depends",
        "large",
        "degree",
        "upon",
        "strongly",
        "one",
        "want",
        "lean",
        "upon",
        "idea",
        "idealist",
        "must",
        "affirm",
        "ultimate",
        "reality",
        "mind",
        "main",
        "argument",
        "remain",
        "viewing",
        "vasubandhu",
        "idealist",
        "exemplified",
        "prominently",
        "today",
        "dan",
        "lusthaus",
        "emphasize",
        "idea",
        "given",
        "many",
        "buddhist",
        "india",
        "tibet",
        "east",
        "asia",
        "understood",
        "yogācāra",
        "affirming",
        "ultimate",
        "reality",
        "mental",
        "denial",
        "view",
        "vasubandhu",
        "behalf",
        "important",
        "useful",
        "corrective",
        "lusthaus",
        "belief",
        "vasubandhu",
        "metaphysical",
        "idealist",
        "ontological",
        "idealist",
        "rather",
        "epistemological",
        "idealist",
        "meaning",
        "vasubandhu",
        "concerned",
        "awareness",
        "content",
        "business",
        "affirming",
        "denying",
        "anything",
        "ultimate",
        "reality",
        "reason",
        "lusthaus",
        "refers",
        "yogācāra",
        "phenomenology",
        "final",
        "complaint",
        "use",
        "term",
        "idealism",
        "anachronistic",
        "reason",
        "inappropriate",
        "application",
        "premodern",
        "india",
        "kochummutom",
        "point",
        "term",
        "encompasses",
        "much",
        "well",
        "taken",
        "one",
        "thing",
        "perhaps",
        "already",
        "stretching",
        "meaning",
        "apply",
        "term",
        "idealism",
        "rp",
        "srivastava",
        "modern",
        "thinker",
        "whose",
        "view",
        "influenced",
        "european",
        "idealist",
        "aurobindo",
        "vivekananda",
        "radhakrishnan",
        "anachronistic",
        "impose",
        "upon",
        "vasubandhu",
        "modern",
        "association",
        "baggage",
        "come",
        "along",
        "term",
        "would",
        "include",
        "advocacy",
        "private",
        "personal",
        "sacred",
        "religious",
        "experience",
        "vasubandhu",
        "may",
        "idealist",
        "strict",
        "sense",
        "th",
        "century",
        "religious",
        "study",
        "textbook",
        "call",
        "mystic",
        "philosopher",
        "vasubandhu",
        "generally",
        "appeal",
        "individual",
        "personal",
        "experience",
        "evidence",
        "confirmation",
        "position",
        "contrary",
        "vasubandhu",
        "repeatedly",
        "employ",
        "reasoning",
        "cast",
        "doubt",
        "upon",
        "apparent",
        "reality",
        "evident",
        "perception",
        "whether",
        "external",
        "internal",
        "perhaps",
        "reason",
        "avoid",
        "describing",
        "vasubandhu",
        "phenomenologist",
        "work",
        "take",
        "direct",
        "examination",
        "experience",
        "theme",
        "rather",
        "draw",
        "upon",
        "scripture",
        "rational",
        "argumentation",
        "critique",
        "available",
        "account",
        "reality"
    ]
}