{
    "main_text": "Major Yogācāra Arguments and Positions || Defense of Appearance Only\n4.1 Defense of Appearance Only\n\nThe Twenty Verses is Vasubandhu’s most readable, and\nevidently analytic, philosophical text, and it has consequently drawn\na significant degree of modern scholarly\n attention.[34]\n It begins with a simple statement, which Vasubandhu defends\nthroughout the brief text and commentary: “Everything in the\nthree realms is only appearance\n (vijñaptimātra).”[35]\n The three realms are the three states into which Buddhists believe\nliving beings may be reborn. For all beings except for Buddhas and\nadvanced bodhisattvas, the three realms make up the universe.\nVasubandhu glosses this statement with citations from scripture that\nmake it clear that he means to say that there no things\n(artha), only minds (citta) and mental qualities\n(caitta). He says that the experience of the three realms is\nlike the appearance of hairs in front of someone with eye disease. It\nis the experience of something that does not exist as it appears.\nAlthough the term has a history of controversy among interpreters of\nYogācāra, it seems safe to say that the Twenty\nVerses defends at least some form of idealism. (See the section\non the controversy over Vasubandhu as idealist.)\n\nAfter stating his thesis that everything is “only\napparent,” Vasubandhu immediately voices a potential\ncounter-argument, which consists in four reasons that the three realms\nbeing appearance only is impossible: First and second, why are things\nrestricted to specific places and times, respectively? Apparent\nobjects can appear anywhere, at any time. Third, why do beings in a\ngiven place and time experience the same objects, and not different\nobjects according to their distinct continua? And fourth, why do\nobjects perform causal functions in the real world, when merely\napparent mental objects do not?\n\nThese objections aim to prove the impossibility that the world is\nmerely apparent by arguing that the elements of ordinary experience\nbehave in ways that what is merely apparent does not. Vasubandhu sets\nup, and meets, these objections in order to prove the possibility, and\nhence the viability of the theory, that everything in experience is\nappearance only. He shows, essentially, that the objector has a narrow\nview of what is possible for merely apparent things; appearances are\nnot necessarily limited in the ways the objector thinks.\n\nNotice that it is not incumbent upon Vasubandhu here to prove that\nall instances of the merely apparent transcend the\nlimitations assumed by the objector. He has not set up this objection\nin order to try to prove, absurdly, that all mental images,\nfor instance, are spatially restricted, or that all mere\nappearances perform observable causal functions in the real world. On\nthe contrary, one upshot of the recognition that things are appearance\nonly will be that things do not have the cause-and-effect structure\nthat we ordinarily take them to have. In any event, the positive\nargument that ordinary experience is, in fact, illusory, comes later\nand takes the form of an argument to the best explanation. Before an\nexplanation can be the best, though, it must be a possibility. So\nhere, all Vasubandhu must do to counter these initial objections is\nprovide, for each, a single example of a mental event that exemplifies\nthe behavior that the objector claims is only available to physical\n objects.[36]\n\nTo defeat the objections that mental objects are not restricted in\nspace and time, Vasubandhu provides the counterexample that in dreams\nobjects often appear to exist in one place and time, as they do in\nordinary waking reality. In a dream, I can be looking at shells on a\nbeach on Long Island, during the summer of my eighth year. It is only\nupon waking that I come to realize that the dream objects (the shells,\nthe beach) were only mental fabrications, temporally dislocated, with\nno spatial reality. Thus, what is merely apparent can\nsometimes have the character of appearing in a particular place and\ntime. To say they do not is to misremember the\n experience.[37]\n\nNext, to defeat the objection that unlike ordinary physical objects,\nmerely apparent objects are not intersubjectively shared by different\nbeings, Vasubandhu provides the counterexample that in hell, demonic\nentities appear to torment groups of hell beings. This is a case of a\nshared hallucination. When the objector wonders why the demons might\nnot in fact be real, Vasubandhu appeals to karma theory: Any being\nwith sufficient merit—sufficient “good\nkarma”—to generate a body capable of withstanding the\npainful fires of hell would never be born into hell in the first\nplace. Any creature in hell that is not suffering must be an\napparition generated by the negative karma of the tormented.\n\nFinally, to defeat the objection that merely apparent objects do not\nproduce functional causal results, Vasubandhu provides the memorable\ncounterexample of a wet dream, in which an evident, physical result is\nproduced by an imagined sexual encounter with a nonexistent lover.\n\nThe initial objection to the mere possibility of the “appearance\nonly” theory quelled, Vasubandhu turns to his main positive\nproof. This consists in a systematic evaluation of every possible\naccount of sensory objects as physical, which ultimately leads\nVasubandhu to conclude that no account of physicality makes more\nsense, or is more parsimonious, than the theory that it is appearance\nonly.\n\nBefore turning to Vasubandhu’s treatment of physics, it is worth\nstopping to note the crucial importance that Buddhist karma theory\nplays in Vasubandhu’s argument, overall. First, the proof of\nshared hallucinations in hell depends upon the particulars of the\nBuddhist belief in the hells. Of course, we might have believed in\nshared hallucinations even without believing in karma. But the\ntormenters in hell play an important, double role in\nVasubandhu’s argument. He has the objector raise the question\nagain, and suggest as a last-ditch effort that perhaps, the tormenters\nare physical entities generated and controlled by the karmic energies\nof the tormented. At this, Vasubandhu challenges his objector: If\nyou’re willing to admit that karma generates physical entities,\nand makes them move around (pick up swords and saws, etc.), so that\nthey might create painful results in the mental streams of the\ntormented, why not just eliminate the physical? Isn’t it simpler\nto say that the mind generates mental images that torment the\n mind?[38]\n This a crucial question, because it resonates beyond hell beings,\nacross Buddhist karmic theory.\n\nIn the Treasury of the Abhidharma, Vasubandhu expressed the\nwidely-held Buddhist view that in addition to causing beings’\nparticular rebirths, karma also shapes the realms into which beings\nare reborn and the non-sentient contents of those realms. Such a\nbelief provides Indian religions with answers to questions often\nthought unanswerable by western theisms, such as why the mudslide took\nout my neighbor’s house, but not mine. But this view of karmic\ncausality requires that the physical causes of positive or negative\nexperiences are linked back to our intentional acts. (For more on the\ncontinuity problems associated with karmic causality, see the\ndiscussion of the disproof of invisible physicality.) Vasubandhu does\nnot say so explicitly, but if it is easier to imagine the causes of a\nmind-only hell demon than a physical one, it should also be easier to\nimagine the causes of a mind-only mudslide—assuming that both\nare generated as a karmic repercussion for the beings that encounter\nthem. The background assumption that any physical world must be\nsubject to karma, therefore places the realist on the defensive from\nthe start. Can the external realist adduce a theory intellectually\nsatisfying enough to counter Vasubandhu’s suggestion that we\nthrow up our hands and admit that what appears to be out there is only\nin our minds?\n\nIt is in response to this that the objector cites scripture,\nsaying that the Buddha did after all, teach of the sense bases, saying\nthat eyes perceive physical forms, and so on. As discussed above,\nVasubandhu reinterprets this scripture as having a “special\nintention” (abhiprāya). (See the section\nconcerning scriptures.) The Buddha did not intend to affirm the\nultimate reality of such entities. Yet the objector is not satisfied\nwith Vasubandhu’s alternate reading of the Buddha’s words.\nIn order to doubt such an explicit, repeated, statement, Vasubandhu\nneeds to prove that it could not be interpreted directly.\nEven if the appearance-only world is possible, and even if it accounts\nbetter for karmic causality than the physical world, a direct reading\nof scripture is still supported, unless and until its doctrines are\nshown to be internally inconsistent.\n",
    "section_title": "4.1 Defense of Appearance Only",
    "entry_title": "Vasubandhu",
    "hierarchy_title": "Vasubandhu || Major Yogācāra Arguments and Positions || Defense of Appearance Only",
    "tokenized_text": [
        "major",
        "yogācāra",
        "argument",
        "position",
        "defense",
        "appearance",
        "defense",
        "appearance",
        "twenty",
        "verse",
        "vasubandhu",
        "readable",
        "evidently",
        "analytic",
        "philosophical",
        "text",
        "consequently",
        "drawn",
        "significant",
        "degree",
        "modern",
        "scholarly",
        "attention",
        "begin",
        "simple",
        "statement",
        "vasubandhu",
        "defends",
        "throughout",
        "brief",
        "text",
        "commentary",
        "everything",
        "three",
        "realm",
        "appearance",
        "vijñaptimātra",
        "three",
        "realm",
        "three",
        "state",
        "buddhist",
        "believe",
        "living",
        "being",
        "may",
        "reborn",
        "being",
        "except",
        "buddha",
        "advanced",
        "bodhisattva",
        "three",
        "realm",
        "make",
        "universe",
        "vasubandhu",
        "gloss",
        "statement",
        "citation",
        "scripture",
        "make",
        "clear",
        "mean",
        "say",
        "thing",
        "artha",
        "mind",
        "citta",
        "mental",
        "quality",
        "caitta",
        "say",
        "experience",
        "three",
        "realm",
        "like",
        "appearance",
        "hair",
        "front",
        "someone",
        "eye",
        "disease",
        "experience",
        "something",
        "exist",
        "appears",
        "although",
        "term",
        "history",
        "controversy",
        "among",
        "interpreter",
        "yogācāra",
        "seems",
        "safe",
        "say",
        "twenty",
        "verse",
        "defends",
        "least",
        "form",
        "idealism",
        "see",
        "section",
        "controversy",
        "vasubandhu",
        "idealist",
        "stating",
        "thesis",
        "everything",
        "apparent",
        "vasubandhu",
        "immediately",
        "voice",
        "potential",
        "counterargument",
        "consists",
        "four",
        "reason",
        "three",
        "realm",
        "appearance",
        "impossible",
        "first",
        "second",
        "thing",
        "restricted",
        "specific",
        "place",
        "time",
        "respectively",
        "apparent",
        "object",
        "appear",
        "anywhere",
        "time",
        "third",
        "being",
        "given",
        "place",
        "time",
        "experience",
        "object",
        "different",
        "object",
        "according",
        "distinct",
        "continuum",
        "fourth",
        "object",
        "perform",
        "causal",
        "function",
        "real",
        "world",
        "merely",
        "apparent",
        "mental",
        "object",
        "objection",
        "aim",
        "prove",
        "impossibility",
        "world",
        "merely",
        "apparent",
        "arguing",
        "element",
        "ordinary",
        "experience",
        "behave",
        "way",
        "merely",
        "apparent",
        "vasubandhu",
        "set",
        "meet",
        "objection",
        "order",
        "prove",
        "possibility",
        "hence",
        "viability",
        "theory",
        "everything",
        "experience",
        "appearance",
        "show",
        "essentially",
        "objector",
        "narrow",
        "view",
        "possible",
        "merely",
        "apparent",
        "thing",
        "appearance",
        "necessarily",
        "limited",
        "way",
        "objector",
        "think",
        "notice",
        "incumbent",
        "upon",
        "vasubandhu",
        "prove",
        "instance",
        "merely",
        "apparent",
        "transcend",
        "limitation",
        "assumed",
        "objector",
        "set",
        "objection",
        "order",
        "try",
        "prove",
        "absurdly",
        "mental",
        "image",
        "instance",
        "spatially",
        "restricted",
        "mere",
        "appearance",
        "perform",
        "observable",
        "causal",
        "function",
        "real",
        "world",
        "contrary",
        "one",
        "upshot",
        "recognition",
        "thing",
        "appearance",
        "thing",
        "causeandeffect",
        "structure",
        "ordinarily",
        "take",
        "event",
        "positive",
        "argument",
        "ordinary",
        "experience",
        "fact",
        "illusory",
        "come",
        "later",
        "take",
        "form",
        "argument",
        "best",
        "explanation",
        "explanation",
        "best",
        "though",
        "must",
        "possibility",
        "vasubandhu",
        "must",
        "counter",
        "initial",
        "objection",
        "provide",
        "single",
        "example",
        "mental",
        "event",
        "exemplifies",
        "behavior",
        "objector",
        "claim",
        "available",
        "physical",
        "object",
        "defeat",
        "objection",
        "mental",
        "object",
        "restricted",
        "space",
        "time",
        "vasubandhu",
        "provides",
        "counterexample",
        "dream",
        "object",
        "often",
        "appear",
        "exist",
        "one",
        "place",
        "time",
        "ordinary",
        "waking",
        "reality",
        "dream",
        "looking",
        "shell",
        "beach",
        "long",
        "island",
        "summer",
        "eighth",
        "year",
        "upon",
        "waking",
        "come",
        "realize",
        "dream",
        "object",
        "shell",
        "beach",
        "mental",
        "fabrication",
        "temporally",
        "dislocated",
        "spatial",
        "reality",
        "thus",
        "merely",
        "apparent",
        "sometimes",
        "character",
        "appearing",
        "particular",
        "place",
        "time",
        "say",
        "misremember",
        "experience",
        "next",
        "defeat",
        "objection",
        "unlike",
        "ordinary",
        "physical",
        "object",
        "merely",
        "apparent",
        "object",
        "intersubjectively",
        "shared",
        "different",
        "being",
        "vasubandhu",
        "provides",
        "counterexample",
        "hell",
        "demonic",
        "entity",
        "appear",
        "torment",
        "group",
        "hell",
        "being",
        "case",
        "shared",
        "hallucination",
        "objector",
        "wonder",
        "demon",
        "might",
        "fact",
        "real",
        "vasubandhu",
        "appeal",
        "karma",
        "theory",
        "sufficient",
        "meritsufficient",
        "good",
        "karma",
        "to",
        "generate",
        "body",
        "capable",
        "withstanding",
        "painful",
        "fire",
        "hell",
        "would",
        "never",
        "born",
        "hell",
        "first",
        "place",
        "creature",
        "hell",
        "suffering",
        "must",
        "apparition",
        "generated",
        "negative",
        "karma",
        "tormented",
        "finally",
        "defeat",
        "objection",
        "merely",
        "apparent",
        "object",
        "produce",
        "functional",
        "causal",
        "result",
        "vasubandhu",
        "provides",
        "memorable",
        "counterexample",
        "wet",
        "dream",
        "evident",
        "physical",
        "result",
        "produced",
        "imagined",
        "sexual",
        "encounter",
        "nonexistent",
        "lover",
        "initial",
        "objection",
        "mere",
        "possibility",
        "appearance",
        "theory",
        "quelled",
        "vasubandhu",
        "turn",
        "main",
        "positive",
        "proof",
        "consists",
        "systematic",
        "evaluation",
        "every",
        "possible",
        "account",
        "sensory",
        "object",
        "physical",
        "ultimately",
        "lead",
        "vasubandhu",
        "conclude",
        "account",
        "physicality",
        "make",
        "sense",
        "parsimonious",
        "theory",
        "appearance",
        "turning",
        "vasubandhu",
        "treatment",
        "physic",
        "worth",
        "stopping",
        "note",
        "crucial",
        "importance",
        "buddhist",
        "karma",
        "theory",
        "play",
        "vasubandhu",
        "argument",
        "overall",
        "first",
        "proof",
        "shared",
        "hallucination",
        "hell",
        "depends",
        "upon",
        "particular",
        "buddhist",
        "belief",
        "hell",
        "course",
        "might",
        "believed",
        "shared",
        "hallucination",
        "even",
        "without",
        "believing",
        "karma",
        "tormenter",
        "hell",
        "play",
        "important",
        "double",
        "role",
        "vasubandhu",
        "argument",
        "objector",
        "raise",
        "question",
        "suggest",
        "lastditch",
        "effort",
        "perhaps",
        "tormenter",
        "physical",
        "entity",
        "generated",
        "controlled",
        "karmic",
        "energy",
        "tormented",
        "vasubandhu",
        "challenge",
        "objector",
        "willing",
        "admit",
        "karma",
        "generates",
        "physical",
        "entity",
        "make",
        "move",
        "around",
        "pick",
        "sword",
        "saw",
        "etc",
        "might",
        "create",
        "painful",
        "result",
        "mental",
        "stream",
        "tormented",
        "eliminate",
        "physical",
        "simpler",
        "say",
        "mind",
        "generates",
        "mental",
        "image",
        "torment",
        "mind",
        "crucial",
        "question",
        "resonates",
        "beyond",
        "hell",
        "being",
        "across",
        "buddhist",
        "karmic",
        "theory",
        "treasury",
        "abhidharma",
        "vasubandhu",
        "expressed",
        "widelyheld",
        "buddhist",
        "view",
        "addition",
        "causing",
        "being",
        "particular",
        "rebirth",
        "karma",
        "also",
        "shape",
        "realm",
        "being",
        "reborn",
        "nonsentient",
        "content",
        "realm",
        "belief",
        "provides",
        "indian",
        "religion",
        "answer",
        "question",
        "often",
        "thought",
        "unanswerable",
        "western",
        "theism",
        "mudslide",
        "took",
        "neighbor",
        "house",
        "mine",
        "view",
        "karmic",
        "causality",
        "requires",
        "physical",
        "cause",
        "positive",
        "negative",
        "experience",
        "linked",
        "back",
        "intentional",
        "act",
        "continuity",
        "problem",
        "associated",
        "karmic",
        "causality",
        "see",
        "discussion",
        "disproof",
        "invisible",
        "physicality",
        "vasubandhu",
        "say",
        "explicitly",
        "easier",
        "imagine",
        "cause",
        "mindonly",
        "hell",
        "demon",
        "physical",
        "one",
        "also",
        "easier",
        "imagine",
        "cause",
        "mindonly",
        "mudslideassuming",
        "generated",
        "karmic",
        "repercussion",
        "being",
        "encounter",
        "background",
        "assumption",
        "physical",
        "world",
        "must",
        "subject",
        "karma",
        "therefore",
        "place",
        "realist",
        "defensive",
        "start",
        "external",
        "realist",
        "adduce",
        "theory",
        "intellectually",
        "satisfying",
        "enough",
        "counter",
        "vasubandhu",
        "suggestion",
        "throw",
        "hand",
        "admit",
        "appears",
        "mind",
        "response",
        "objector",
        "cite",
        "scripture",
        "saying",
        "buddha",
        "teach",
        "sense",
        "base",
        "saying",
        "eye",
        "perceive",
        "physical",
        "form",
        "discussed",
        "vasubandhu",
        "reinterprets",
        "scripture",
        "special",
        "intention",
        "abhiprāya",
        "see",
        "section",
        "concerning",
        "scripture",
        "buddha",
        "intend",
        "affirm",
        "ultimate",
        "reality",
        "entity",
        "yet",
        "objector",
        "satisfied",
        "vasubandhu",
        "alternate",
        "reading",
        "buddha",
        "word",
        "order",
        "doubt",
        "explicit",
        "repeated",
        "statement",
        "vasubandhu",
        "need",
        "prove",
        "could",
        "interpreted",
        "directly",
        "even",
        "appearanceonly",
        "world",
        "possible",
        "even",
        "account",
        "better",
        "karmic",
        "causality",
        "physical",
        "world",
        "direct",
        "reading",
        "scripture",
        "still",
        "supported",
        "unless",
        "doctrine",
        "shown",
        "internally",
        "inconsistent"
    ]
}