{
    "main_text": "The Basics: People, Activities and Overview of Doctrines || Overview of Doctrines\n2.3 Overview of Doctrines\n\nDespite the pluralism of the Vienna Circle’s views, there did\nexist a minimal consensus which may be put as follows. A theory of\nscientific knowledge was propagated which sought to renew empiricism\nby freeing it from the impossible task of justifying the claims of the\nformal sciences. It will be noted that this updating did not leave\nempiricism unchanged.\n\nFollowing the logicism of Frege and Russell, the Circle considered\nlogic and mathematics to be analytic in nature. Extending\nWittgenstein’s insight about logical truths to mathematical ones\nas well, the Circle considered both to be tautological. Like true\nstatements of logic, mathematical statements did not express factual\ntruths: devoid of empirical content they only concerned ways of\nrepresenting the world, spelling out implication relations between\nstatements. The knowledge claims of logic and mathematics gained their\njustification on purely formal grounds, by proof of their derivability\nby stated rules from stated axioms and premises. (Depending on the\nstanding of these axioms and premises, justification was conditional\nor unconditional.) Thus defanged of appeals to rational intuition, the\ncontribution of pure reason to human knowledge (in the form of logic\nand mathematics) was thought easily integrated into the empiricist\nframework. (Carnap sought to accommodate Gödel’s\nincompleteness results by separating analyticity from effective\nprovability and by postulating that arithmetic consisted of an\ninfinite series of ever richer arithmetical languages; see the\ndiscussion and references in section 3.2 below.)\n\nThe synthetic statements of the empirical sciences meanwhile were held\nto be cognitively meaningful if and only if they were empirically\ntestable in some sense. They derived their justification as knowledge\nclaims from successful tests. Here the Circle appealed to a criterion of meaningfulness\n(cognitive significance) the correct formulation of which was problematical and much\ndebated (and will be discussed in greater detail in section 3.1\nbelow). Roughly, if synthetic statements failed testability in\nprinciple they were considered to be cognitively meaningless and to\ngive rise only to pseudo-problems. No third category of significance\nbesides that of a priori analytical and a posteriori\nsynthetic statements was admitted: in particular, Kant’s\nsynthetic a priori was banned as having been refuted by the\nprogress of science itself. (The theory of relativity showed what had\nbeen held to be an example of the synthetic a priori, namely\nEuclidean geometry, to be false as the geometry of physical space.)\nThus the Circle rejected the knowledge claims of metaphysics as being\nneither analytic and a priori nor empirical and synthetic.\n(On related but different grounds, they also rejected the knowledge\nclaims of normative ethics: whereas conditional norms could be\ngrounded in means-ends relations, unconditional norms remained\nunprovable in empirical terms and so depended crucially on the\ndisputed substantive a priori intuition.)\n\nGiven their empiricism, all of the members of the Vienna Circle also\ncalled into question the principled separation of the natural and the\nhuman sciences. They were happy enough to admit to differences in\ntheir object domains, but denied the categorical difference in both\ntheir overarching methodologies and ultimate goals in inquiry, which\nthe historicist tradition in the still only emerging social sciences\nand the idealist tradition in philosophy insisted on. The\nCircle’s own methodologically monist position was sometimes\nrepresented under the heading of “unified science”.\nPrecisely how such a unification of the sciences was to be effected or\nunderstood remained a matter for further discussion (see section 3.3\nbelow).\n\nIt is easy to see that, combined with the rejection of rational\nintuition, the Vienna Circle’s exclusive apportionment of reason\ninto either formal a priori reasoning, issuing in analytic\ntruths (or contradictions), and substantive a posteriori\nreasoning, issuing in synthetic truths (or falsehoods), severely\nchallenged the traditional understanding of philosophy. All members of\nthe Circle hailed the end of distinctive philosophical system\nbuilding. In line with the Tractatus claim that all\nphilosophy is really a critique of language, the Vienna Circle took\nthe so-called linguistic turn, the turn to representation as the\nproper subject matter of philosophy. Philosophy itself was denied a\nseparate first-order domain of expertise and declared a second-order\ninquiry. Whether the once queen of the sciences was thereby reduced to\nthe mere handmaiden of the latter was still left open. It remained a\nmatter of disagreement what type of distinctively\nphilosophical insight, if any, would remain legitimate. Just as\nimportantly, however, the tools of modern logic were employed also for\nmetatheoretical construction, not just for the reduction of empirical\nclaims to their observational base or, more generally, for the\nderivation of their observational consequences. For the price of\nabandoning foundationalist certainty this allowed for an enormous\nexpansion of the domain of empirical discourse. Ultimately, it opened\nthe space for the still ongoing discussions of scientific realism and\nits alternatives (see section 3.4 below).\n\nThe Circle’s leading protagonists differed in how they\nconceptualized this reflexive second-order inquiry that the linguistic\nturn had inaugurated. Nevertheless, they all agreed broadly that the\nways of representing the world were largely determined by convention.\nA multitude of ideas hide behind this invocation of conventionality.\nOne particularly radical one is the denial of the apodicity of all\napriority, the denial of the claim that knowledge justified through\nreason alone represents truths that are unconditionally necessary.\nAnother one is the imputation of agency in the construction of the\nlogico-linguistic frameworks that make human cognition possible, the\ndenial that conventionality could only mean acquiescence in tradition.\nWhether such ideas were followed by individual members of the Circle,\nhowever, depended on their own interests and influences. It is these\noften overlooked or misunderstood differences that hold the key to\nunderstanding the interplay of occasionally incompatible positions\nthat make up Vienna Circle philosophy. (As can be seen from some of\ntheir internal disputes, moreover, these differences were also not\nalways obvious to the protagonists themselves.)\n\nTo see a striking example, consider their overarching conceptions of\nphilosophy itself. Some protagonists retained the idea that philosophy\npossessed a separate disciplinary identity from science and, like\nSchlick, turned philosophy into a distinctive, albeit non-formal\nactivity of meaning determination. Others, like Carnap, agreed on the\ndistinction between philosophy and science but turned philosophy into\na purely formal enterprise, the so-called logic of science. Still\nothers went even further and, like Neurath under the banner of\n“unified science”, also rejected philosophy as a separate\ndiscipline and treated what remained of it, after the rejection of\nmetaphysics, as its partly empirical meta-theory, to be set beside the logic of science. With Schlick, then,\nphilosophy became the activity of achieving a much clarified and\ndeepened understanding of the cognitive and linguistic practices\nactually already employed in science and everyday discourse. By\ncontrast, for Carnap, philosophy investigated and reconstructed\nexisting language fragments, developed new logico-linguistic\nframeworks and suggested possible formal conventions for science,\nwhile, for Neurath, the investigation of science was pursued by an\ninterdisciplinary meta-theory that encompassed empirical disciplines,\nagain with a pragmatic orientation. Thus we find in apparent\ncompetition different conceptions of post-metaphysical philosophy: the\nprojects of experiential meaning determination, of formal rational\nreconstruction and of naturalistic explications of leading theoretical\nand methodological notions. (For roughly representative early\nessay-length statements of their positions see Schlick 1930, Carnap\n1932a and Neurath 1932a; later restatements are given in Schlick 1937,\nCarnap 1936b and Neurath 1936b.) In the more detailed discussions\nbelow these differences of overall approach will figure repeatedly\n(see also section 3.6 below).\n\nCriticisms of the basic positions adopted in the Vienna Circle are\nlegion, though it may be questioned whether most of them took account\nof the sophisticated variations on offer. (Sometimes the\nCircle’s own writings are disregarded altogether and\n“logical positivism” is discussed only via the proxy of\nAyer’s popular exposition; see, e.g., Soames 2003.) But some\nNeo-Kantians like Ernst Cassirer may claim that they too accepted\ndevelopments like the merely relative a priori and an\nappropriate conception of the historical development of science.\nLikewise, Wittgensteinians may claim that Wittgenstein’s own\nopposition to metaphysics only concerned false attempts to render it\nintelligible: his merely ineffable but uneliminated metaphysics\nconcerned precisely what for him were essentials of ways of\nrepresenting the world. The commonest criticisms, however, concerned\nnot the uniqueness of the Vienna Circle’s doctrines, or their\nfaithfulness to their supposed sources, but whether they were tenable\nat all. Prominent objects of this type of criticism include the\nverificationist theory of meaning and its claimed anti-metaphysical\nand non-cognitivist consequences as well as its own significance; the\nreductionism in phenomenalist or physicalist guises that appeared to\nattend the Circle’s attempted operationalisation of the logical\natomism of Russell and Wittgenstein; and the Circle’s alleged\nscientism in general and their formalist and a-historical conception\nof scientific cognition in particular. These criticisms are discussed\nin some detail below in order to assess why which of the associated\ndoctrines remain of what importance.\n\nAs noted, the Vienna Circle did not last long: its philosophical\nrevolution came at a cost. Yet what was so socially, indeed\npolitically, explosive about what appears on first sight to be a\nparticularly arid, if not astringent, doctrine of specialist\nscientific knowledge? To a large part, precisely what made it so\ncontroversial philosophically: its claim to refute opponents not by\nproving their statements to be false but by showing them to be\n(cognitively) meaningless. Whatever the niceties of their\nphilosophical argument here, the socio-political impact of the Vienna\nCircle’s philosophies of science was obvious and profound. All\nof them opposed the increasing groundswell of radically mistaken,\nindeed irrational, ways of thinking about thought and its place in the\nworld. In their time and place, the mere demand that public discourse\nbe perspicuous, in particular, that reasoning be valid and premises\ntrue—a demand implicit in their general ideal of\nreason—placed them in the middle of crucial socio-political\nstruggles. Some members and sympathisers of the Circle also actively\nopposed the then increasingly popular völkisch\nsupra-individual holism in social science as a dangerous intellectual\naberration. Not only did such ideas support racism and fascism in\npolitics, but such ideas themselves were supported only by radically\nmistaken arguments concerning the nature and explanation of organic\nand unorganic matter. So the first thing that made all of the Vienna\nCircle philosophies politically relevant was the contingent fact that\nin their day much political discourse exhibited striking epistemic\ndeficits. That some of the members of the Circle went, without logical\nblunders, still further by arguing that socio-political considerations\ncan play a legitimate role in some instances of theory choice due to\nunderdetermination is yet another matter. This particular issue will\nnot be pursued further here (see references at the end of section 2.1\nabove), nor the general topic of the Circle’s embedding in\nmodernism and the discourse of modernity (see Putnam 1981b for a\nreductionist, Galison 1990 for a foundationalist, Uebel 1996 for a\nconstructivist reading of their modernism, Dahms 2004 for an account\nof personal relations with representatives of modernism in art and\narchitecture).\n",
    "section_title": "2.3 Overview of Doctrines",
    "entry_title": "Vienna Circle",
    "hierarchy_title": "Vienna Circle || The Basics: People, Activities and Overview of Doctrines || Overview of Doctrines",
    "tokenized_text": [
        "basic",
        "people",
        "activity",
        "overview",
        "doctrine",
        "overview",
        "doctrine",
        "overview",
        "doctrine",
        "despite",
        "pluralism",
        "vienna",
        "circle",
        "view",
        "exist",
        "minimal",
        "consensus",
        "may",
        "put",
        "follows",
        "theory",
        "scientific",
        "knowledge",
        "propagated",
        "sought",
        "renew",
        "empiricism",
        "freeing",
        "impossible",
        "task",
        "justifying",
        "claim",
        "formal",
        "science",
        "noted",
        "updating",
        "leave",
        "empiricism",
        "unchanged",
        "following",
        "logicism",
        "frege",
        "russell",
        "circle",
        "considered",
        "logic",
        "mathematics",
        "analytic",
        "nature",
        "extending",
        "wittgenstein",
        "insight",
        "logical",
        "truth",
        "mathematical",
        "one",
        "well",
        "circle",
        "considered",
        "tautological",
        "like",
        "true",
        "statement",
        "logic",
        "mathematical",
        "statement",
        "express",
        "factual",
        "truth",
        "devoid",
        "empirical",
        "content",
        "concerned",
        "way",
        "representing",
        "world",
        "spelling",
        "implication",
        "relation",
        "statement",
        "knowledge",
        "claim",
        "logic",
        "mathematics",
        "gained",
        "justification",
        "purely",
        "formal",
        "ground",
        "proof",
        "derivability",
        "stated",
        "rule",
        "stated",
        "axiom",
        "premise",
        "depending",
        "standing",
        "axiom",
        "premise",
        "justification",
        "conditional",
        "unconditional",
        "thus",
        "defanged",
        "appeal",
        "rational",
        "intuition",
        "contribution",
        "pure",
        "reason",
        "human",
        "knowledge",
        "form",
        "logic",
        "mathematics",
        "thought",
        "easily",
        "integrated",
        "empiricist",
        "framework",
        "carnap",
        "sought",
        "accommodate",
        "gödel",
        "incompleteness",
        "result",
        "separating",
        "analyticity",
        "effective",
        "provability",
        "postulating",
        "arithmetic",
        "consisted",
        "infinite",
        "series",
        "ever",
        "richer",
        "arithmetical",
        "language",
        "see",
        "discussion",
        "reference",
        "section",
        "synthetic",
        "statement",
        "empirical",
        "science",
        "meanwhile",
        "held",
        "cognitively",
        "meaningful",
        "empirically",
        "testable",
        "sense",
        "derived",
        "justification",
        "knowledge",
        "claim",
        "successful",
        "test",
        "circle",
        "appealed",
        "criterion",
        "meaningfulness",
        "cognitive",
        "significance",
        "correct",
        "formulation",
        "problematical",
        "much",
        "debated",
        "discussed",
        "greater",
        "detail",
        "section",
        "roughly",
        "synthetic",
        "statement",
        "failed",
        "testability",
        "principle",
        "considered",
        "cognitively",
        "meaningless",
        "give",
        "rise",
        "pseudoproblems",
        "third",
        "category",
        "significance",
        "besides",
        "priori",
        "analytical",
        "posteriori",
        "synthetic",
        "statement",
        "admitted",
        "particular",
        "kant",
        "synthetic",
        "priori",
        "banned",
        "refuted",
        "progress",
        "science",
        "theory",
        "relativity",
        "showed",
        "held",
        "example",
        "synthetic",
        "priori",
        "namely",
        "euclidean",
        "geometry",
        "false",
        "geometry",
        "physical",
        "space",
        "thus",
        "circle",
        "rejected",
        "knowledge",
        "claim",
        "metaphysics",
        "neither",
        "analytic",
        "priori",
        "empirical",
        "synthetic",
        "related",
        "different",
        "ground",
        "also",
        "rejected",
        "knowledge",
        "claim",
        "normative",
        "ethic",
        "whereas",
        "conditional",
        "norm",
        "could",
        "grounded",
        "meansends",
        "relation",
        "unconditional",
        "norm",
        "remained",
        "unprovable",
        "empirical",
        "term",
        "depended",
        "crucially",
        "disputed",
        "substantive",
        "priori",
        "intuition",
        "given",
        "empiricism",
        "member",
        "vienna",
        "circle",
        "also",
        "called",
        "question",
        "principled",
        "separation",
        "natural",
        "human",
        "science",
        "happy",
        "enough",
        "admit",
        "difference",
        "object",
        "domain",
        "denied",
        "categorical",
        "difference",
        "overarching",
        "methodology",
        "ultimate",
        "goal",
        "inquiry",
        "historicist",
        "tradition",
        "still",
        "emerging",
        "social",
        "science",
        "idealist",
        "tradition",
        "philosophy",
        "insisted",
        "circle",
        "methodologically",
        "monist",
        "position",
        "sometimes",
        "represented",
        "heading",
        "unified",
        "science",
        "precisely",
        "unification",
        "science",
        "effected",
        "understood",
        "remained",
        "matter",
        "discussion",
        "see",
        "section",
        "easy",
        "see",
        "combined",
        "rejection",
        "rational",
        "intuition",
        "vienna",
        "circle",
        "exclusive",
        "apportionment",
        "reason",
        "either",
        "formal",
        "priori",
        "reasoning",
        "issuing",
        "analytic",
        "truth",
        "contradiction",
        "substantive",
        "posteriori",
        "reasoning",
        "issuing",
        "synthetic",
        "truth",
        "falsehood",
        "severely",
        "challenged",
        "traditional",
        "understanding",
        "philosophy",
        "member",
        "circle",
        "hailed",
        "end",
        "distinctive",
        "philosophical",
        "system",
        "building",
        "line",
        "tractatus",
        "claim",
        "philosophy",
        "really",
        "critique",
        "language",
        "vienna",
        "circle",
        "took",
        "socalled",
        "linguistic",
        "turn",
        "turn",
        "representation",
        "proper",
        "subject",
        "matter",
        "philosophy",
        "philosophy",
        "denied",
        "separate",
        "firstorder",
        "domain",
        "expertise",
        "declared",
        "secondorder",
        "inquiry",
        "whether",
        "queen",
        "science",
        "thereby",
        "reduced",
        "mere",
        "handmaiden",
        "latter",
        "still",
        "left",
        "open",
        "remained",
        "matter",
        "disagreement",
        "type",
        "distinctively",
        "philosophical",
        "insight",
        "would",
        "remain",
        "legitimate",
        "importantly",
        "however",
        "tool",
        "modern",
        "logic",
        "employed",
        "also",
        "metatheoretical",
        "construction",
        "reduction",
        "empirical",
        "claim",
        "observational",
        "base",
        "generally",
        "derivation",
        "observational",
        "consequence",
        "price",
        "abandoning",
        "foundationalist",
        "certainty",
        "allowed",
        "enormous",
        "expansion",
        "domain",
        "empirical",
        "discourse",
        "ultimately",
        "opened",
        "space",
        "still",
        "ongoing",
        "discussion",
        "scientific",
        "realism",
        "alternative",
        "see",
        "section",
        "circle",
        "leading",
        "protagonist",
        "differed",
        "conceptualized",
        "reflexive",
        "secondorder",
        "inquiry",
        "linguistic",
        "turn",
        "inaugurated",
        "nevertheless",
        "agreed",
        "broadly",
        "way",
        "representing",
        "world",
        "largely",
        "determined",
        "convention",
        "multitude",
        "idea",
        "hide",
        "behind",
        "invocation",
        "conventionality",
        "one",
        "particularly",
        "radical",
        "one",
        "denial",
        "apodicity",
        "apriority",
        "denial",
        "claim",
        "knowledge",
        "justified",
        "reason",
        "alone",
        "represents",
        "truth",
        "unconditionally",
        "necessary",
        "another",
        "one",
        "imputation",
        "agency",
        "construction",
        "logicolinguistic",
        "framework",
        "make",
        "human",
        "cognition",
        "possible",
        "denial",
        "conventionality",
        "could",
        "mean",
        "acquiescence",
        "tradition",
        "whether",
        "idea",
        "followed",
        "individual",
        "member",
        "circle",
        "however",
        "depended",
        "interest",
        "influence",
        "often",
        "overlooked",
        "misunderstood",
        "difference",
        "hold",
        "key",
        "understanding",
        "interplay",
        "occasionally",
        "incompatible",
        "position",
        "make",
        "vienna",
        "circle",
        "philosophy",
        "seen",
        "internal",
        "dispute",
        "moreover",
        "difference",
        "also",
        "always",
        "obvious",
        "protagonist",
        "see",
        "striking",
        "example",
        "consider",
        "overarching",
        "conception",
        "philosophy",
        "protagonist",
        "retained",
        "idea",
        "philosophy",
        "possessed",
        "separate",
        "disciplinary",
        "identity",
        "science",
        "like",
        "schlick",
        "turned",
        "philosophy",
        "distinctive",
        "albeit",
        "nonformal",
        "activity",
        "meaning",
        "determination",
        "others",
        "like",
        "carnap",
        "agreed",
        "distinction",
        "philosophy",
        "science",
        "turned",
        "philosophy",
        "purely",
        "formal",
        "enterprise",
        "socalled",
        "logic",
        "science",
        "still",
        "others",
        "went",
        "even",
        "like",
        "neurath",
        "banner",
        "unified",
        "science",
        "also",
        "rejected",
        "philosophy",
        "separate",
        "discipline",
        "treated",
        "remained",
        "rejection",
        "metaphysics",
        "partly",
        "empirical",
        "metatheory",
        "set",
        "beside",
        "logic",
        "science",
        "schlick",
        "philosophy",
        "became",
        "activity",
        "achieving",
        "much",
        "clarified",
        "deepened",
        "understanding",
        "cognitive",
        "linguistic",
        "practice",
        "actually",
        "already",
        "employed",
        "science",
        "everyday",
        "discourse",
        "contrast",
        "carnap",
        "philosophy",
        "investigated",
        "reconstructed",
        "existing",
        "language",
        "fragment",
        "developed",
        "new",
        "logicolinguistic",
        "framework",
        "suggested",
        "possible",
        "formal",
        "convention",
        "science",
        "neurath",
        "investigation",
        "science",
        "pursued",
        "interdisciplinary",
        "metatheory",
        "encompassed",
        "empirical",
        "discipline",
        "pragmatic",
        "orientation",
        "thus",
        "find",
        "apparent",
        "competition",
        "different",
        "conception",
        "postmetaphysical",
        "philosophy",
        "project",
        "experiential",
        "meaning",
        "determination",
        "formal",
        "rational",
        "reconstruction",
        "naturalistic",
        "explication",
        "leading",
        "theoretical",
        "methodological",
        "notion",
        "roughly",
        "representative",
        "early",
        "essaylength",
        "statement",
        "position",
        "see",
        "schlick",
        "carnap",
        "a",
        "neurath",
        "a",
        "later",
        "restatement",
        "given",
        "schlick",
        "carnap",
        "b",
        "neurath",
        "b",
        "detailed",
        "discussion",
        "difference",
        "overall",
        "approach",
        "figure",
        "repeatedly",
        "see",
        "also",
        "section",
        "criticism",
        "basic",
        "position",
        "adopted",
        "vienna",
        "circle",
        "legion",
        "though",
        "may",
        "questioned",
        "whether",
        "took",
        "account",
        "sophisticated",
        "variation",
        "offer",
        "sometimes",
        "circle",
        "writing",
        "disregarded",
        "altogether",
        "logical",
        "positivism",
        "discussed",
        "via",
        "proxy",
        "ayer",
        "popular",
        "exposition",
        "see",
        "eg",
        "soames",
        "neokantians",
        "like",
        "ernst",
        "cassirer",
        "may",
        "claim",
        "accepted",
        "development",
        "like",
        "merely",
        "relative",
        "priori",
        "appropriate",
        "conception",
        "historical",
        "development",
        "science",
        "likewise",
        "wittgensteinians",
        "may",
        "claim",
        "wittgenstein",
        "opposition",
        "metaphysics",
        "concerned",
        "false",
        "attempt",
        "render",
        "intelligible",
        "merely",
        "ineffable",
        "uneliminated",
        "metaphysics",
        "concerned",
        "precisely",
        "essential",
        "way",
        "representing",
        "world",
        "commonest",
        "criticism",
        "however",
        "concerned",
        "uniqueness",
        "vienna",
        "circle",
        "doctrine",
        "faithfulness",
        "supposed",
        "source",
        "whether",
        "tenable",
        "prominent",
        "object",
        "type",
        "criticism",
        "include",
        "verificationist",
        "theory",
        "meaning",
        "claimed",
        "antimetaphysical",
        "noncognitivist",
        "consequence",
        "well",
        "significance",
        "reductionism",
        "phenomenalist",
        "physicalist",
        "guise",
        "appeared",
        "attend",
        "circle",
        "attempted",
        "operationalisation",
        "logical",
        "atomism",
        "russell",
        "wittgenstein",
        "circle",
        "alleged",
        "scientism",
        "general",
        "formalist",
        "ahistorical",
        "conception",
        "scientific",
        "cognition",
        "particular",
        "criticism",
        "discussed",
        "detail",
        "order",
        "ass",
        "associated",
        "doctrine",
        "remain",
        "importance",
        "noted",
        "vienna",
        "circle",
        "last",
        "long",
        "philosophical",
        "revolution",
        "came",
        "cost",
        "yet",
        "socially",
        "indeed",
        "politically",
        "explosive",
        "appears",
        "first",
        "sight",
        "particularly",
        "arid",
        "astringent",
        "doctrine",
        "specialist",
        "scientific",
        "knowledge",
        "large",
        "part",
        "precisely",
        "made",
        "controversial",
        "philosophically",
        "claim",
        "refute",
        "opponent",
        "proving",
        "statement",
        "false",
        "showing",
        "cognitively",
        "meaningless",
        "whatever",
        "nicety",
        "philosophical",
        "argument",
        "sociopolitical",
        "impact",
        "vienna",
        "circle",
        "philosophy",
        "science",
        "obvious",
        "profound",
        "opposed",
        "increasing",
        "groundswell",
        "radically",
        "mistaken",
        "indeed",
        "irrational",
        "way",
        "thinking",
        "thought",
        "place",
        "world",
        "time",
        "place",
        "mere",
        "demand",
        "public",
        "discourse",
        "perspicuous",
        "particular",
        "reasoning",
        "valid",
        "premise",
        "truea",
        "demand",
        "implicit",
        "general",
        "ideal",
        "reasonplaced",
        "middle",
        "crucial",
        "sociopolitical",
        "struggle",
        "member",
        "sympathiser",
        "circle",
        "also",
        "actively",
        "opposed",
        "increasingly",
        "popular",
        "völkisch",
        "supraindividual",
        "holism",
        "social",
        "science",
        "dangerous",
        "intellectual",
        "aberration",
        "idea",
        "support",
        "racism",
        "fascism",
        "politics",
        "idea",
        "supported",
        "radically",
        "mistaken",
        "argument",
        "concerning",
        "nature",
        "explanation",
        "organic",
        "unorganic",
        "matter",
        "first",
        "thing",
        "made",
        "vienna",
        "circle",
        "philosophy",
        "politically",
        "relevant",
        "contingent",
        "fact",
        "day",
        "much",
        "political",
        "discourse",
        "exhibited",
        "striking",
        "epistemic",
        "deficit",
        "member",
        "circle",
        "went",
        "without",
        "logical",
        "blunder",
        "still",
        "arguing",
        "sociopolitical",
        "consideration",
        "play",
        "legitimate",
        "role",
        "instance",
        "theory",
        "choice",
        "due",
        "underdetermination",
        "yet",
        "another",
        "matter",
        "particular",
        "issue",
        "pursued",
        "see",
        "reference",
        "end",
        "section",
        "general",
        "topic",
        "circle",
        "embedding",
        "modernism",
        "discourse",
        "modernity",
        "see",
        "putnam",
        "b",
        "reductionist",
        "galison",
        "foundationalist",
        "uebel",
        "constructivist",
        "reading",
        "modernism",
        "dahms",
        "account",
        "personal",
        "relation",
        "representative",
        "modernism",
        "art",
        "architecture"
    ]
}