{
    "main_text": "Metaethical theological voluntarism || Which act of divine will?\n2.3 Which act of divine will?\n\nAssume, then, that theological voluntarism is an account of\nobligation-type properties. A second issue concerning the proper\nformulation of the view concerns the relevant act of divine will. Is\nthe requisite act of divine will to be understood as an act of\ncommanding, or instead as some mental act like choosing, intending,\npreferring, or wishing? And if one holds that the act of the divine\nwill is a mental act, should the mental act to which the theological\nvoluntarist appeals in order to account for obligation be one whose\nobject is the action that is made obligatory, or one whose object is\nthe state of affairs that the action is obligatory? We have, to\nsimplify matters, three options:\n\n(1)\n\nThat it is obligatory for A to φ depends on God’s\ncommanding A to φ.\n(2)\n\nThat it is obligatory for A to φ depends on God’s\nwilling that A φ.\n(3)\n\nThat it is obligatory for A to φ depends on God’s\nwilling that it be obligatory for A to φ.\n\n\nOne might think that the central issue here would be to decide between\nthe speech-act view (1) and the mental acts views (2) and (3); it\nmight be thought to be less important, an issue of intramural interest\nonly, to decide between (2) and (3). But this is not right. The\nimportant debate is between (1) and (2). For (3) is, understood in one\nway, no competitor with either (1) or (2); and understood differently,\nit has little argumentative support.\nThe dispute between (1) and (2)\n\nThere is an ongoing debate whether (1) or (2) is the better\nformulation of theological voluntarism about obligation. There are\ninitially plausible points on both sides of the issue. In favor of\n(1), one might appeal to the centrality of the image of God as\ncommander in the Abrahamic faiths. In favor of (2), one might appeal to\nthe centrality to theistic belief and practice of the idea that doing\nGod’s will is the standard for the moral life.\n\nWith only these initial points, there can be no resolution, and so\ndefenders of these two formulations of theological voluntarism have\nsought other argumentative routes. One might try to reduce (2) to\nabsurdity. One who is rational does not intend what one knows will not\nhappen; and, on the orthodox conception of God, God is both rational\nand omniscient. This entails that God will never intend something that\nwill not happen. If obligation arises from divine intentions, though,\nthen no obligations will ever be violated. Since this is absurd, one\nshould prefer (1) over (2). But defenders of (2) have a plausible\nresponse. First, defenders of (1) are in no better a position than\ndefenders of (2). For it is a sincerity condition on the giving of\ncommands that the commander intend that the commanded perform the\naction; and so if this objection reduces (2) to absurdity, the only\nway that the defender of (1) can avoid having his or her position\nreduced to absurdity is by holding that God is not necessarily\nsincere. Second, the notion of intention admits of various readings,\nand there is a reading of intention suitable for theological\nvoluntarism that does not have the untoward result that no created\nrational beings could ever act contrary to a divine intention. It is\nstandard to distinguish between God’s antecedent and\nGod’s consequent will: God’s consequent will is\nGod’s will absolutely considered, as bearing on all actual\ncircumstances; God’s antecedent will is God’s will\nconsidered with respect to some proper subset of actual circumstances.\n(To use an example of Aquinas’s, one drawn from the discussion\nin which the distinction between antecedent and consequent will is\nmade [Summa Theologiae, Ia, Q. 19, A. 6]: while in one way\nGod wills that all persons be saved, in another way God does not will\nthat all be saved; indeed, God wills that some persons be damned. What\nmakes this coherent is that the sense of willing in which God wills\nthat all be saved is antecedent: prior to a consideration of all of\nthe particulars of persons’ situations, God wills their\nsalvation; but in light of all of the particulars of persons’\nsituations—including the circumstance that some persons have\nwillingly rejected friendship with God—God wills their\ndamnation.) So while there is a sense in which it is true that all\nthat God intends must come to pass, this sense is that of consequent\nintending rather than antecedent intending. On (2), then, one can say\nthat the theological voluntarist holds that obligation depends on\ncertain of God’s antecedent intentions. (See also\nMurphy 1998, pp. 17–21.)\n\nWe might ask, in order to bring the differences between these views\nbetter out into the light, what our considered opinion is in cases in\nwhich a divine antecedent intention that A φ and a divine\ncommand that A φ pull apart. It is far from clear that it\nis a real option for God to command that A φ while not\nintending that A φ. Though this possibility is endorsed\nby Wierenga 1983 (p. 390) and is at least entertained in Murphy 1998\n(p. 9), for God to issue such a command would be for God to command\ninsincerely—something that many would be loath to allow. (See\nalso Adams 1999, p. 260 and Murphy 2002, 2.5). But the other option\nappears unproblematic enough. God might intend for humans to act a\ncertain way while not commanding them to do so. In such a scenario,\none might ask, is obligation engendered? If yes, then it seems to\ncount in favor of the divine will view (2); if no, then it seems to\ncount in favor of the divine command view (1).\n\nAdams claims that obligations are not engendered in such cases;\nactually made demands are necessary. He offers three reasons for\npreferring the command conception in these cases. The first is that\nholding that obligation is a matter of divine command rather than\ndivine will makes possible a distinction between the obligatory and\nthe supererogatory: we can say that while God’s commands somehow\nmakes certain acts obligatory, if God does will that we perform some\nact but does not command it, performing that act is supererogatory.\nThe second is an appeal to the idea that theological voluntarism is a\nsocial conception of obligation: obligation arises in the context of\nthe social relationship between God and created rational beings. (Not\nall versions of theological voluntarism affirm this; see the\ndiscussion of (3) below.) But, Adams says, in social relationships\nobligations arise only when demands are actually made. And the third\nreason is that there is something unsavory about obligations allegedly\nresulting from an act of divine will that is not expressed as a\ncommand: “Games in which one party incurs guilt for failing to\nguess the unexpressed wishes of the other party are not nice games.\nThey are no nicer if God is thought of as a party to them”\n(Adams 1999, p. 261).\n\nBut the defender of the divine will view (2) has some responses\navailable. The defender of this view can say, with respect to the\nfirst point, that a divine will view can capture the difference\nbetween the obligatory and the supererogatory not by appeal to the\ndifference between acts of divine will that are expressed as commands\nand those that are not but rather as a difference between distinct\ntypes of act of divine will: the difference, say, between what God\nintends that we do and what God merely prefers that we do (cf. Quinn\n1999, p. 56). Or, in the alternative, the distinction can be made\nwithin the divine will: one might characterize as obligatory those\nactions that God wills that one perform, and as supererogatory those\nactions that God wills that one perform if one is willing to do\nso, so that if one performs the action, one is doing what God\nwills, but if one does not, one is not doing what God wills that one\nnot do. With respect to the second and third points, the defender of\nthe divine will view can directly challenge Adams’ view that\nobligations generated within social relationships must always be\nexpressed as demands. Spouses, for example, often take themselves to\nbe obligated by what their spouses intend with respect to their\nbehavior; indeed, it would be unseemly to hold oneself to be bound by\none’s spouse’s will only if the spouse has actually made a\ndemand on one. (“How can you blame me for not helping you empty\nthe dishwasher? You didn’t tell me to!” does not often go\nover well.) One often wants another to perform some action without\nbeing told to; many actions have their value only through being\nperformed without being prompted by a command. But, on (1), no act of\nthe form ‘φ-ing, though God has not told me to\nφ’ could ever be obligatory.\n\nHere is a thought experiment that may help to decide the dispute\nbetween these two camps. For it to be possible for one to give another\na command to φ, there must be a linguistic practice available to\nthe addressee in terms of which the speaker can formulate a command.\nThis is not just for the sake of having the means to communicate a\ncommand: rather, commands are essentially linguistic items, and cannot\nbe defined except in such terms. Imagine, though, that a certain\ncreated rational being, Mary, inhabits a linguistic community in which\nthere is no practice of commanding. One can successfully make\nassertions to Mary, and among these assertions can be assertions about\none’s own psychological states, but one cannot successfully\ncommand Mary to do anything. Here is the question: so long as\nMary’s linguistic resources are confined to those afforded by\nthis practice, can God impose obligations on her? The defender of (1)\nwill have to say No: for Mary cannot be commanded to do anything. The\ndefender of (2) will have to say Yes: God could have an antecedent\nintention that Mary perform some action and (to sidestep worries about\nbeing under an obligation that one cannot know about) could inform\nMary that God has that intention with respect to her conduct.\n\nThe debate between defenders of (1) and defenders of (2) is ongoing,\nand at present far from conclusive. (For some recent interventions\ninto this debate, see Mann 2005b, Miller 2009a, and Jordan 2012.)\nOption (3)\n\nThe other formulation of theological voluntarism that we noted is that\nin which the act of divine will is that of willing that the state of\naffairs that it is obligatory for A to φ obtain. Unlike\nthe formulations (1) and (2), which admit of various sorts of\ndependence relationship between the act of divine will and the\nobligation, (3) is limited to something like a causal picture. (It\nobviously could not be that its being obligatory for A to\nφ is identical to God’s willing that it be\nobligatory for A to φ, on pain of a vicious regress.) The\nidea expressed here is that ultimately all obligations are present\nbecause of efficacious acts of the divine will, in particular, acts of\nwilling that those obligations be in force.\n\nThis account is compatible with (1) and (2), because it could be that\nthe way that God makes it the case that an act is obligatory is\nnecessarily through the giving of commands (as in (1)) or through\nantecedently intending (as in (2)) the performance of that action. So\nit is not really, in its most general form, a competitor to\n(1) and (2). It could be made a competitor by adding claims about the\nway that the divine will brings it about that these obligations\nobtain. A defender of (3) might add that on his or her view the divine\nintention that A be obligated to φ is the immediate,\ntotal, and exclusive cause of its being obligatory for A to\nφ (cf. Quinn 1999, p. 55). If so, then a divine command that\nA φ or a divine antecedent intention that A\nφ could not be partial or mediate causes of its being obligatory\nfor A to φ. But note that even thus strengthened (3) is\ncompatible with (1) or (2) understood as an identity claim: if the\nclaim is that obligations just are divine commands or divine\nintentions, then the compatibility with (1) and (2) is\nreestablished.\n\nEven if it turns out that (3) is not an obvious competitor with (1)\nand (2), it is still worth asking whether it is true. Though Quinn\neventually rejected (3), at one point he argued for it by appeal to\ndivine sovereignty: because every state of affairs that obtains\nthat does not involve God’s existing depends on God’s\nwill, a fortiori every normative state of affairs that does not\ninvolve God’s existing depends on God’s will. (Quinn\nthought that its being obligatory to obey God is a state of\naffairs that involves God’s existing [Quinn 1990, pp.\n298–299], but for a reason to reject that claim see Murphy 1998,\npp. 12–13.) It does not seem, though, that this argument would\nsupport (3) in the strengthened version that holds that the dependence\nmust be immediate, total, and exclusive. After all, very few folks\nwant to say that every state of affairs that is brought about by\nGod’s will is brought about by God’s will exclusively,\ntotally, and immediately. While it is plausibly part of theism that\nevery state of affairs that obtains, apart from those that involve\nGod, is somehow dependent on God’s will, this does not show that\ndeontic states of affairs are more interestingly connected to the\ndivine will than states of affairs involving mathematics, or physics,\nor accounting (Murphy 1998, pp. 14–16).\n\nWe may put (3) to the side, then. While some formulations of it may\nvery well be true, those formulations for which there is argumentative\nsupport do not establish much in the way of interesting metaethical\nconclusions. The debate concerning whether (1) and (2) is the more\nadequate formulation of theological voluntarism is ongoing, and we\nshould thus proceed in a way that is as far as possible neutral\nbetween the two (though admittedly unwieldy) by saying that\nAs moral obligations to φ depend on God’s\ncommands/intentions that A φ. (By\n‘intentions’ I will mean antecedent intentions.) Allowing\nfor both of these possibilities, what can be said about the\nrelationship of dependence holding between divine commands/intentions\nand moral obligations?\n",
    "section_title": "2.3 Which act of divine will?",
    "entry_title": "Theological Voluntarism",
    "hierarchy_title": "Theological Voluntarism || Metaethical theological voluntarism || Which act of divine will?",
    "tokenized_text": [
        "metaethical",
        "theological",
        "voluntarism",
        "act",
        "divine",
        "act",
        "divine",
        "assume",
        "theological",
        "voluntarism",
        "account",
        "obligationtype",
        "property",
        "second",
        "issue",
        "concerning",
        "proper",
        "formulation",
        "view",
        "concern",
        "relevant",
        "act",
        "divine",
        "requisite",
        "act",
        "divine",
        "understood",
        "act",
        "commanding",
        "instead",
        "mental",
        "act",
        "like",
        "choosing",
        "intending",
        "preferring",
        "wishing",
        "one",
        "hold",
        "act",
        "divine",
        "mental",
        "act",
        "mental",
        "act",
        "theological",
        "voluntarist",
        "appeal",
        "order",
        "account",
        "obligation",
        "one",
        "whose",
        "object",
        "action",
        "made",
        "obligatory",
        "one",
        "whose",
        "object",
        "state",
        "affair",
        "action",
        "obligatory",
        "simplify",
        "matter",
        "three",
        "option",
        "obligatory",
        "φ",
        "depends",
        "god",
        "commanding",
        "φ",
        "obligatory",
        "φ",
        "depends",
        "god",
        "willing",
        "φ",
        "obligatory",
        "φ",
        "depends",
        "god",
        "willing",
        "obligatory",
        "φ",
        "one",
        "might",
        "think",
        "central",
        "issue",
        "would",
        "decide",
        "speechact",
        "view",
        "mental",
        "act",
        "view",
        "might",
        "thought",
        "le",
        "important",
        "issue",
        "intramural",
        "interest",
        "decide",
        "right",
        "important",
        "debate",
        "understood",
        "one",
        "way",
        "competitor",
        "either",
        "understood",
        "differently",
        "little",
        "argumentative",
        "support",
        "dispute",
        "ongoing",
        "debate",
        "whether",
        "better",
        "formulation",
        "theological",
        "voluntarism",
        "obligation",
        "initially",
        "plausible",
        "point",
        "side",
        "issue",
        "favor",
        "one",
        "might",
        "appeal",
        "centrality",
        "image",
        "god",
        "commander",
        "abrahamic",
        "faith",
        "favor",
        "one",
        "might",
        "appeal",
        "centrality",
        "theistic",
        "belief",
        "practice",
        "idea",
        "god",
        "standard",
        "moral",
        "life",
        "initial",
        "point",
        "resolution",
        "defender",
        "two",
        "formulation",
        "theological",
        "voluntarism",
        "sought",
        "argumentative",
        "route",
        "one",
        "might",
        "try",
        "reduce",
        "absurdity",
        "one",
        "rational",
        "intend",
        "one",
        "know",
        "happen",
        "orthodox",
        "conception",
        "god",
        "god",
        "rational",
        "omniscient",
        "entail",
        "god",
        "never",
        "intend",
        "something",
        "happen",
        "obligation",
        "arises",
        "divine",
        "intention",
        "though",
        "obligation",
        "ever",
        "violated",
        "since",
        "absurd",
        "one",
        "prefer",
        "defender",
        "plausible",
        "response",
        "first",
        "defender",
        "better",
        "position",
        "defender",
        "sincerity",
        "condition",
        "giving",
        "command",
        "commander",
        "intend",
        "commanded",
        "perform",
        "action",
        "objection",
        "reduces",
        "absurdity",
        "way",
        "defender",
        "avoid",
        "position",
        "reduced",
        "absurdity",
        "holding",
        "god",
        "necessarily",
        "sincere",
        "second",
        "notion",
        "intention",
        "admits",
        "various",
        "reading",
        "reading",
        "intention",
        "suitable",
        "theological",
        "voluntarism",
        "untoward",
        "result",
        "created",
        "rational",
        "being",
        "could",
        "ever",
        "act",
        "contrary",
        "divine",
        "intention",
        "standard",
        "distinguish",
        "god",
        "antecedent",
        "god",
        "consequent",
        "god",
        "consequent",
        "god",
        "absolutely",
        "considered",
        "bearing",
        "actual",
        "circumstance",
        "god",
        "antecedent",
        "god",
        "considered",
        "respect",
        "proper",
        "subset",
        "actual",
        "circumstance",
        "use",
        "example",
        "aquinas",
        "one",
        "drawn",
        "discussion",
        "distinction",
        "antecedent",
        "consequent",
        "made",
        "summa",
        "theologiae",
        "ia",
        "q",
        "one",
        "way",
        "god",
        "will",
        "person",
        "saved",
        "another",
        "way",
        "god",
        "saved",
        "indeed",
        "god",
        "will",
        "person",
        "damned",
        "make",
        "coherent",
        "sense",
        "willing",
        "god",
        "will",
        "saved",
        "antecedent",
        "prior",
        "consideration",
        "particular",
        "person",
        "situation",
        "god",
        "will",
        "salvation",
        "light",
        "particular",
        "person",
        "situationsincluding",
        "circumstance",
        "person",
        "willingly",
        "rejected",
        "friendship",
        "godgod",
        "will",
        "damnation",
        "sense",
        "true",
        "god",
        "intends",
        "must",
        "come",
        "pas",
        "sense",
        "consequent",
        "intending",
        "rather",
        "antecedent",
        "intending",
        "one",
        "say",
        "theological",
        "voluntarist",
        "hold",
        "obligation",
        "depends",
        "certain",
        "god",
        "antecedent",
        "intention",
        "see",
        "also",
        "murphy",
        "pp",
        "might",
        "ask",
        "order",
        "bring",
        "difference",
        "view",
        "better",
        "light",
        "considered",
        "opinion",
        "case",
        "divine",
        "antecedent",
        "intention",
        "φ",
        "divine",
        "command",
        "φ",
        "pull",
        "apart",
        "far",
        "clear",
        "real",
        "option",
        "god",
        "command",
        "φ",
        "intending",
        "φ",
        "though",
        "possibility",
        "endorsed",
        "wierenga",
        "p",
        "least",
        "entertained",
        "murphy",
        "p",
        "god",
        "issue",
        "command",
        "would",
        "god",
        "command",
        "insincerelysomething",
        "many",
        "would",
        "loath",
        "allow",
        "see",
        "also",
        "adam",
        "p",
        "murphy",
        "option",
        "appears",
        "unproblematic",
        "enough",
        "god",
        "might",
        "intend",
        "human",
        "act",
        "certain",
        "way",
        "commanding",
        "scenario",
        "one",
        "might",
        "ask",
        "obligation",
        "engendered",
        "yes",
        "seems",
        "count",
        "favor",
        "divine",
        "view",
        "seems",
        "count",
        "favor",
        "divine",
        "command",
        "view",
        "adam",
        "claim",
        "obligation",
        "engendered",
        "case",
        "actually",
        "made",
        "demand",
        "necessary",
        "offer",
        "three",
        "reason",
        "preferring",
        "command",
        "conception",
        "case",
        "first",
        "holding",
        "obligation",
        "matter",
        "divine",
        "command",
        "rather",
        "divine",
        "make",
        "possible",
        "distinction",
        "obligatory",
        "supererogatory",
        "say",
        "god",
        "command",
        "somehow",
        "make",
        "certain",
        "act",
        "obligatory",
        "god",
        "perform",
        "act",
        "command",
        "performing",
        "act",
        "supererogatory",
        "second",
        "appeal",
        "idea",
        "theological",
        "voluntarism",
        "social",
        "conception",
        "obligation",
        "obligation",
        "arises",
        "context",
        "social",
        "relationship",
        "god",
        "created",
        "rational",
        "being",
        "version",
        "theological",
        "voluntarism",
        "affirm",
        "see",
        "discussion",
        "adam",
        "say",
        "social",
        "relationship",
        "obligation",
        "arise",
        "demand",
        "actually",
        "made",
        "third",
        "reason",
        "something",
        "unsavory",
        "obligation",
        "allegedly",
        "resulting",
        "act",
        "divine",
        "expressed",
        "command",
        "game",
        "one",
        "party",
        "incurs",
        "guilt",
        "failing",
        "guess",
        "unexpressed",
        "wish",
        "party",
        "nice",
        "game",
        "nicer",
        "god",
        "thought",
        "party",
        "adam",
        "p",
        "defender",
        "divine",
        "view",
        "response",
        "available",
        "defender",
        "view",
        "say",
        "respect",
        "first",
        "point",
        "divine",
        "view",
        "capture",
        "difference",
        "obligatory",
        "supererogatory",
        "appeal",
        "difference",
        "act",
        "divine",
        "expressed",
        "command",
        "rather",
        "difference",
        "distinct",
        "type",
        "act",
        "divine",
        "difference",
        "say",
        "god",
        "intends",
        "god",
        "merely",
        "prefers",
        "cf",
        "quinn",
        "p",
        "alternative",
        "distinction",
        "made",
        "within",
        "divine",
        "one",
        "might",
        "characterize",
        "obligatory",
        "action",
        "god",
        "will",
        "one",
        "perform",
        "supererogatory",
        "action",
        "god",
        "will",
        "one",
        "perform",
        "one",
        "willing",
        "one",
        "performs",
        "action",
        "one",
        "god",
        "will",
        "one",
        "one",
        "god",
        "will",
        "one",
        "respect",
        "second",
        "third",
        "point",
        "defender",
        "divine",
        "view",
        "directly",
        "challenge",
        "adam",
        "view",
        "obligation",
        "generated",
        "within",
        "social",
        "relationship",
        "must",
        "always",
        "expressed",
        "demand",
        "spouse",
        "example",
        "often",
        "take",
        "obligated",
        "spouse",
        "intend",
        "respect",
        "behavior",
        "indeed",
        "would",
        "unseemly",
        "hold",
        "oneself",
        "bound",
        "one",
        "spouse",
        "spouse",
        "actually",
        "made",
        "demand",
        "one",
        "blame",
        "helping",
        "empty",
        "dishwasher",
        "tell",
        "often",
        "go",
        "well",
        "one",
        "often",
        "want",
        "another",
        "perform",
        "action",
        "without",
        "told",
        "many",
        "action",
        "value",
        "performed",
        "without",
        "prompted",
        "command",
        "act",
        "form",
        "φing",
        "though",
        "god",
        "told",
        "φ",
        "could",
        "ever",
        "obligatory",
        "thought",
        "experiment",
        "may",
        "help",
        "decide",
        "dispute",
        "two",
        "camp",
        "possible",
        "one",
        "give",
        "another",
        "command",
        "φ",
        "must",
        "linguistic",
        "practice",
        "available",
        "addressee",
        "term",
        "speaker",
        "formulate",
        "command",
        "sake",
        "mean",
        "communicate",
        "command",
        "rather",
        "command",
        "essentially",
        "linguistic",
        "item",
        "defined",
        "except",
        "term",
        "imagine",
        "though",
        "certain",
        "created",
        "rational",
        "mary",
        "inhabits",
        "linguistic",
        "community",
        "practice",
        "commanding",
        "one",
        "successfully",
        "make",
        "assertion",
        "mary",
        "among",
        "assertion",
        "assertion",
        "one",
        "psychological",
        "state",
        "one",
        "successfully",
        "command",
        "mary",
        "anything",
        "question",
        "long",
        "mary",
        "linguistic",
        "resource",
        "confined",
        "afforded",
        "practice",
        "god",
        "impose",
        "obligation",
        "defender",
        "say",
        "mary",
        "commanded",
        "anything",
        "defender",
        "say",
        "yes",
        "god",
        "could",
        "antecedent",
        "intention",
        "mary",
        "perform",
        "action",
        "sidestep",
        "worry",
        "obligation",
        "one",
        "know",
        "could",
        "inform",
        "mary",
        "god",
        "intention",
        "respect",
        "conduct",
        "debate",
        "defender",
        "defender",
        "ongoing",
        "present",
        "far",
        "conclusive",
        "recent",
        "intervention",
        "debate",
        "see",
        "mann",
        "b",
        "miller",
        "a",
        "jordan",
        "option",
        "formulation",
        "theological",
        "voluntarism",
        "noted",
        "act",
        "divine",
        "willing",
        "state",
        "affair",
        "obligatory",
        "φ",
        "obtain",
        "unlike",
        "formulation",
        "admit",
        "various",
        "sort",
        "dependence",
        "relationship",
        "act",
        "divine",
        "obligation",
        "limited",
        "something",
        "like",
        "causal",
        "picture",
        "obviously",
        "could",
        "obligatory",
        "φ",
        "identical",
        "god",
        "willing",
        "obligatory",
        "φ",
        "pain",
        "vicious",
        "regress",
        "idea",
        "expressed",
        "ultimately",
        "obligation",
        "present",
        "efficacious",
        "act",
        "divine",
        "particular",
        "act",
        "willing",
        "obligation",
        "force",
        "account",
        "compatible",
        "could",
        "way",
        "god",
        "make",
        "case",
        "act",
        "obligatory",
        "necessarily",
        "giving",
        "command",
        "antecedently",
        "intending",
        "performance",
        "action",
        "really",
        "general",
        "form",
        "competitor",
        "could",
        "made",
        "competitor",
        "adding",
        "claim",
        "way",
        "divine",
        "brings",
        "obligation",
        "obtain",
        "defender",
        "might",
        "add",
        "view",
        "divine",
        "intention",
        "obligated",
        "φ",
        "immediate",
        "total",
        "exclusive",
        "cause",
        "obligatory",
        "φ",
        "cf",
        "quinn",
        "p",
        "divine",
        "command",
        "φ",
        "divine",
        "antecedent",
        "intention",
        "φ",
        "could",
        "partial",
        "mediate",
        "cause",
        "obligatory",
        "φ",
        "note",
        "even",
        "thus",
        "strengthened",
        "compatible",
        "understood",
        "identity",
        "claim",
        "claim",
        "obligation",
        "divine",
        "command",
        "divine",
        "intention",
        "compatibility",
        "reestablished",
        "even",
        "turn",
        "obvious",
        "competitor",
        "still",
        "worth",
        "asking",
        "whether",
        "true",
        "though",
        "quinn",
        "eventually",
        "rejected",
        "one",
        "point",
        "argued",
        "appeal",
        "divine",
        "sovereignty",
        "every",
        "state",
        "affair",
        "obtains",
        "involve",
        "god",
        "existing",
        "depends",
        "god",
        "fortiori",
        "every",
        "normative",
        "state",
        "affair",
        "involve",
        "god",
        "existing",
        "depends",
        "god",
        "quinn",
        "thought",
        "obligatory",
        "obey",
        "god",
        "state",
        "affair",
        "involves",
        "god",
        "existing",
        "quinn",
        "pp",
        "reason",
        "reject",
        "claim",
        "see",
        "murphy",
        "pp",
        "seem",
        "though",
        "argument",
        "would",
        "support",
        "strengthened",
        "version",
        "hold",
        "dependence",
        "must",
        "immediate",
        "total",
        "exclusive",
        "folk",
        "want",
        "say",
        "every",
        "state",
        "affair",
        "brought",
        "god",
        "brought",
        "god",
        "exclusively",
        "totally",
        "immediately",
        "plausibly",
        "part",
        "theism",
        "every",
        "state",
        "affair",
        "obtains",
        "apart",
        "involve",
        "god",
        "somehow",
        "dependent",
        "god",
        "show",
        "deontic",
        "state",
        "affair",
        "interestingly",
        "connected",
        "divine",
        "state",
        "affair",
        "involving",
        "mathematics",
        "physic",
        "accounting",
        "murphy",
        "pp",
        "may",
        "put",
        "side",
        "formulation",
        "may",
        "well",
        "true",
        "formulation",
        "argumentative",
        "support",
        "establish",
        "much",
        "way",
        "interesting",
        "metaethical",
        "conclusion",
        "debate",
        "concerning",
        "whether",
        "adequate",
        "formulation",
        "theological",
        "voluntarism",
        "ongoing",
        "thus",
        "proceed",
        "way",
        "far",
        "possible",
        "neutral",
        "two",
        "though",
        "admittedly",
        "unwieldy",
        "saying",
        "moral",
        "obligation",
        "φ",
        "depend",
        "god",
        "commandsintentions",
        "φ",
        "intention",
        "mean",
        "antecedent",
        "intention",
        "allowing",
        "possibility",
        "said",
        "relationship",
        "dependence",
        "holding",
        "divine",
        "commandsintentions",
        "moral",
        "obligation"
    ]
}