{
    "main_text": "The Moral Obligation to Vote\n2. The Moral Obligation to Vote\n\nSurveys show that most citizens in contemporary democracies believe\nthere is some sort of moral obligation to vote (Mackie 2010:\n8–9). Other surveys show most moral and political philosophers\nagree (Schwitzgebel and Rust 2010). They tend to believe that citizens\nhave a duty to vote even when these citizens rightly believe their\nfavored party or candidate has no serious chance of winning (Campbell,\nGurin, and Mill 1954: 195). Further, most people seem to think that\nthe duty to vote specifically means a duty to turn out to vote\n(perhaps only to cast a blank ballot), rather than a duty to vote a\nparticular way. On this view, citizens have a duty simply to cast a\nvote, but nearly any good-faith vote is morally acceptable.\n\nMany popular arguments for a duty to vote rely upon the idea that\nindividual votes make a significant difference. For instance, one\nmight argue that that there is a duty to vote because there is a duty\nto protect oneself, a duty to help others, or to produce good\ngovernment, or the like. However, these arguments face the problem, as\ndiscussed in section 1, that individual votes have vanishingly small\ninstrumental value (or disvalue)\n\nFor instance, one early hypothesis was that voting might be a form of\ninsurance, meant to to prevent democracy from collapsing (Downs 1957:\n257). Following this suggestion, suppose one hypothesizes that\ncitizens have a duty to vote in order to help prevent democracy from\ncollapsing. Suppose there is some determinate threshold of votes under\nwhich a democracy becomes unstable and collapses. The problem here is\nthat just as there is a vanishingly small probability that any\nindividual’s vote would decide the election, so there is a\nvanishingly small chance that any vote would decisively put the number\nof votes above that threshold. Alternatively, suppose that as fewer\nand fewer citizens vote, the probability of democracy collapsing\nbecomes incrementally higher. If so, to show there is a duty to vote,\none would first need to show that the marginal expected benefits of\nthe nth vote, in reducing the chance of democratic collapse,\nexceed the expected costs (including opportunity costs).\n\nA plausible argument for a duty to vote would thus not depend on\nindividual votes having significant expected value or impact on\ngovernment or civic culture. Instead, a plausible argument for a duty\nto vote should presume that individual votes make little difference in\nchanging the outcome of election, but then identify a reason why\ncitizens should vote anyway.\n\nOne suggestion (Beerbohm 2012) is that citizens have a duty to vote to\navoid complicity with injustice. On this view, representatives act in\nthe name of the citizens. Citizens count as partial authors of the\nlaw, even when the citizens do not vote or participate in government.\nCitizens who refuse to vote are thus complicit in allowing their\nrepresentatives to commit injustice. Perhaps failure to resist\ninjustice counts as kind of sponsorship. (This theory thus implies\nthat citizens do not merely have a duty to vote rather than abstain,\nbut specifically have a duty to vote for candidates and policies that\nwill reduce injustice.) \n\nAnother popular argument, which does not turn on the efficacy of\nindividual votes, is the “Generalization Argument”:\n\nWhat if everyone were to stay home and not vote? The results would be\ndisastrous! Therefore, I (you/she) should vote. (Lomasky and G.\nBrennan 2000: 75)\n\n\nThis popular argument can be parodied in a way that exposes its\nweakness. Consider:\n\nWhat if everyone were to stay home and not farm? Then we would all\nstarve to death! Therefore, I (you/she) should each become farmers.\n(Lomasky and G. Brennan 2000: 76)\n\n\nThe problem with this argument, as stated, is that even if it would be\ndisastrous if no one or too few performed some activity, it does not\nfollow that everyone ought to perform it. Instead, one conclude that\nit matters that sufficient number of people perform the activity. In\nthe case of farming, we think it’s permissible for people to\ndecide for themselves whether to farm or not, because market\nincentives suffice to ensure that enough people farm.\n\nHowever, even if the Generalization Argument, as stated, is unsound,\nperhaps it is on to something. There are certain classes of actions in\nwhich we tend to presume everyone ought to participate (or ought not\nto participate). For instance, suppose a university places a sign\nsaying, “Keep off the newly planted grass.” It’s not\nas though the grass will die if one person walks on it once. If I were\nallowed to walk on it at will while the rest of you refrained from\ndoing so, the grass would probably be fine. Still, it would seem\nunfair if the university allowed me to walk on the grass at will but\nforbade everyone else from doing so. It seems more appropriate to\nimpose the duty to keep off the lawn equally on everyone. Similarly,\nif the government wants to raise money to provide a public good, it\ncould just tax a randomly chosen minority of the citizens. However, it\nseems more fair or just for everyone (at least above a certain income\nthreshold) to pay some taxes, to share in the burden of providing\npolice protection.\n\nWe should thus ask: is voting more like the first kind of activity, in\nwhich it is only imperative that enough people do it, or the second\nkind, in which it’s imperative that everyone do it? One\ndifference between the two kinds of activities is what abstention does\nto others. If I abstain from farming, I don’t thereby take\nadvantage of or free ride on farmers’ efforts. Rather, I\ncompensate them for whatever food I eat by buying that food on the\nmarket. In the second set of cases, if I freely walk across the lawn\nwhile everyone else walks around it, or if I enjoy police protection\nbut don’t pay taxes, it appears I free ride on others’\nefforts. They bear an uncompensated differential burden in maintaining\nthe grass or providing police protection, and I seem to be taking\nadvantage of them.\n\nA defender of a duty to vote might thus argue that non-voters free\nride on voters. Non-voters benefit from the government that voters\nprovide, but do not themselves help to provide government. \n\nThere are at least a few arguments for a duty to vote that do not\ndepend on the controversial assumption that individual votes make a\ndifference:\n\n The Generalization/Public Goods/Debt to Society\nArgument: Claims that citizens who abstain from voting thereby\nfree ride on the provision of good government, or fail to pay their\n“debts to society”.\n The Civic Virtue Argument: Claims that citizens have a\nduty to exercise civic virtue, and thus to vote.\n The Complicity Argument: Claims that citizens have a\nduty to vote (for just outcomes) in order to avoid being complicit in\nthe injustice their governments commit.\n\n\nHowever, there is a general challenge to these arguments in support of\na duty to vote. Call this the particularity problem: To show\nthat there is a duty to vote, it is not enough to appeal to some goal\nG that citizens plausibly have a duty to support, and then to\nargue that voting is one way they can support or help achieve\nG. Instead, proponents of a duty to vote need to show\nspecifically that voting is the only way, or the required way, to\nsupport G (J. Brennan 2011a). The worry is that the three\narguments above might only show that voting is one way among many to\ndischarge the duty in question. Indeed, it might not be even be an\nespecially good way, let alone the only or obligatory way to discharge\nthe duty.\n\nFor instance, suppose one argues that citizens should vote because\nthey ought to exercise civic virtue. One must explain why a duty to\nexercise civic virtue specifically implies a duty to vote, rather than\na duty just to perform one of thousands of possible acts of civic\nvirtue. Or, if a citizen has a duty to to be an agent who helps\npromote other citizens’ well-being, it seems this duty could be\ndischarged by volunteering, making art, or working at a productive job\nthat adds to the social surplus. If a citizen has a duty to to avoid\ncomplicity in injustice, it seems that rather than voting, she could\nengage in civil disobedience; write letters to newspaper editors,\npamphlets, or political theory books; donate money; engage in\nconscientious abstention; protest; assassinate criminal political\nleaders; or do any number of other activities. It’s unclear why\nvoting is special or required.\n\nNote that the particularity problem need not be framed in\nconsequentialist terms, i.e., both defenders and critics of the duty\nto vote need not say that what determines whether voting is morally\nrequired depends on whether voting has the highest expected\nconsequences. Rather, the issue is whether voting is simply one of\nmany ways to discharge an underlying duty or respond to underlying\nreasons, or whether voting is in some way special and unique, such\nthat these reasons select voting in particular as an obligatory means\nof responding to these underlying reasons.\n\nMaskivker (2019) responds partly to this objection by saying, in\neffect, “Why not both?” J. Brennan (2011a) and Freiman (2020) say\nthat the underlying grounds for any duty to vote can be discharged\n(and discharged better) through actions other than voting. Maskivker\ntakes this to suggest not that voting is optional, but that one should\nvote (if one is already sufficiently well-informed and\npublicly-spirited) and also performs these other actions. Maskivker\ngrounds her argument on a deontological duty of easy aid: if one can\nprovide aid to others at very low cost to oneself, then one should do\nso. For already well-informed citizens, voting is an instance of easy\naid. \n",
    "section_title": "2. The Moral Obligation to Vote",
    "entry_title": "The Ethics and Rationality of Voting",
    "hierarchy_title": "The Ethics and Rationality of Voting || The Moral Obligation to Vote",
    "tokenized_text": [
        "moral",
        "obligation",
        "vote",
        "moral",
        "obligation",
        "vote",
        "survey",
        "show",
        "citizen",
        "contemporary",
        "democracy",
        "believe",
        "sort",
        "moral",
        "obligation",
        "vote",
        "mackie",
        "survey",
        "show",
        "moral",
        "political",
        "philosopher",
        "agree",
        "schwitzgebel",
        "rust",
        "tend",
        "believe",
        "citizen",
        "duty",
        "vote",
        "even",
        "citizen",
        "rightly",
        "believe",
        "favored",
        "party",
        "candidate",
        "serious",
        "chance",
        "winning",
        "campbell",
        "gurin",
        "mill",
        "people",
        "seem",
        "think",
        "duty",
        "vote",
        "specifically",
        "mean",
        "duty",
        "turn",
        "vote",
        "perhaps",
        "cast",
        "blank",
        "ballot",
        "rather",
        "duty",
        "vote",
        "particular",
        "way",
        "view",
        "citizen",
        "duty",
        "simply",
        "cast",
        "vote",
        "nearly",
        "goodfaith",
        "vote",
        "morally",
        "acceptable",
        "many",
        "popular",
        "argument",
        "duty",
        "vote",
        "rely",
        "upon",
        "idea",
        "individual",
        "vote",
        "make",
        "significant",
        "difference",
        "instance",
        "one",
        "might",
        "argue",
        "duty",
        "vote",
        "duty",
        "protect",
        "oneself",
        "duty",
        "help",
        "others",
        "produce",
        "good",
        "government",
        "like",
        "however",
        "argument",
        "face",
        "problem",
        "discussed",
        "section",
        "individual",
        "vote",
        "vanishingly",
        "small",
        "instrumental",
        "value",
        "disvalue",
        "instance",
        "one",
        "early",
        "hypothesis",
        "voting",
        "might",
        "form",
        "insurance",
        "meant",
        "prevent",
        "democracy",
        "collapsing",
        "down",
        "following",
        "suggestion",
        "suppose",
        "one",
        "hypothesizes",
        "citizen",
        "duty",
        "vote",
        "order",
        "help",
        "prevent",
        "democracy",
        "collapsing",
        "suppose",
        "determinate",
        "threshold",
        "vote",
        "democracy",
        "becomes",
        "unstable",
        "collapse",
        "problem",
        "vanishingly",
        "small",
        "probability",
        "individual",
        "vote",
        "would",
        "decide",
        "election",
        "vanishingly",
        "small",
        "chance",
        "vote",
        "would",
        "decisively",
        "put",
        "number",
        "vote",
        "threshold",
        "alternatively",
        "suppose",
        "fewer",
        "fewer",
        "citizen",
        "vote",
        "probability",
        "democracy",
        "collapsing",
        "becomes",
        "incrementally",
        "higher",
        "show",
        "duty",
        "vote",
        "one",
        "would",
        "first",
        "need",
        "show",
        "marginal",
        "expected",
        "benefit",
        "nth",
        "vote",
        "reducing",
        "chance",
        "democratic",
        "collapse",
        "exceed",
        "expected",
        "cost",
        "including",
        "opportunity",
        "cost",
        "plausible",
        "argument",
        "duty",
        "vote",
        "would",
        "thus",
        "depend",
        "individual",
        "vote",
        "significant",
        "expected",
        "value",
        "impact",
        "government",
        "civic",
        "culture",
        "instead",
        "plausible",
        "argument",
        "duty",
        "vote",
        "presume",
        "individual",
        "vote",
        "make",
        "little",
        "difference",
        "changing",
        "outcome",
        "election",
        "identify",
        "reason",
        "citizen",
        "vote",
        "anyway",
        "one",
        "suggestion",
        "beerbohm",
        "citizen",
        "duty",
        "vote",
        "avoid",
        "complicity",
        "injustice",
        "view",
        "representative",
        "act",
        "name",
        "citizen",
        "citizen",
        "count",
        "partial",
        "author",
        "law",
        "even",
        "citizen",
        "vote",
        "participate",
        "government",
        "citizen",
        "refuse",
        "vote",
        "thus",
        "complicit",
        "allowing",
        "representative",
        "commit",
        "injustice",
        "perhaps",
        "failure",
        "resist",
        "injustice",
        "count",
        "kind",
        "sponsorship",
        "theory",
        "thus",
        "implies",
        "citizen",
        "merely",
        "duty",
        "vote",
        "rather",
        "abstain",
        "specifically",
        "duty",
        "vote",
        "candidate",
        "policy",
        "reduce",
        "injustice",
        "another",
        "popular",
        "argument",
        "turn",
        "efficacy",
        "individual",
        "vote",
        "generalization",
        "argument",
        "everyone",
        "stay",
        "home",
        "vote",
        "result",
        "would",
        "disastrous",
        "therefore",
        "youshe",
        "vote",
        "lomasky",
        "g",
        "brennan",
        "popular",
        "argument",
        "parodied",
        "way",
        "expose",
        "weakness",
        "consider",
        "everyone",
        "stay",
        "home",
        "farm",
        "would",
        "starve",
        "death",
        "therefore",
        "youshe",
        "become",
        "farmer",
        "lomasky",
        "g",
        "brennan",
        "problem",
        "argument",
        "stated",
        "even",
        "would",
        "disastrous",
        "one",
        "performed",
        "activity",
        "follow",
        "everyone",
        "ought",
        "perform",
        "instead",
        "one",
        "conclude",
        "matter",
        "sufficient",
        "number",
        "people",
        "perform",
        "activity",
        "case",
        "farming",
        "think",
        "permissible",
        "people",
        "decide",
        "whether",
        "farm",
        "market",
        "incentive",
        "suffice",
        "ensure",
        "enough",
        "people",
        "farm",
        "however",
        "even",
        "generalization",
        "argument",
        "stated",
        "unsound",
        "perhaps",
        "something",
        "certain",
        "class",
        "action",
        "tend",
        "presume",
        "everyone",
        "ought",
        "participate",
        "ought",
        "participate",
        "instance",
        "suppose",
        "university",
        "place",
        "sign",
        "saying",
        "keep",
        "newly",
        "planted",
        "grass",
        "though",
        "grass",
        "die",
        "one",
        "person",
        "walk",
        "allowed",
        "walk",
        "rest",
        "refrained",
        "grass",
        "would",
        "probably",
        "fine",
        "still",
        "would",
        "seem",
        "unfair",
        "university",
        "allowed",
        "walk",
        "grass",
        "forbade",
        "everyone",
        "else",
        "seems",
        "appropriate",
        "impose",
        "duty",
        "keep",
        "lawn",
        "equally",
        "everyone",
        "similarly",
        "government",
        "want",
        "raise",
        "money",
        "provide",
        "public",
        "good",
        "could",
        "tax",
        "randomly",
        "chosen",
        "minority",
        "citizen",
        "however",
        "seems",
        "fair",
        "everyone",
        "least",
        "certain",
        "income",
        "threshold",
        "pay",
        "tax",
        "share",
        "burden",
        "providing",
        "police",
        "protection",
        "thus",
        "ask",
        "voting",
        "like",
        "first",
        "kind",
        "activity",
        "imperative",
        "enough",
        "people",
        "second",
        "kind",
        "imperative",
        "everyone",
        "one",
        "difference",
        "two",
        "kind",
        "activity",
        "abstention",
        "others",
        "abstain",
        "farming",
        "thereby",
        "take",
        "advantage",
        "free",
        "ride",
        "farmer",
        "effort",
        "rather",
        "compensate",
        "whatever",
        "food",
        "eat",
        "buying",
        "food",
        "market",
        "second",
        "set",
        "case",
        "freely",
        "walk",
        "across",
        "lawn",
        "everyone",
        "else",
        "walk",
        "around",
        "enjoy",
        "police",
        "protection",
        "pay",
        "tax",
        "appears",
        "free",
        "ride",
        "others",
        "effort",
        "bear",
        "uncompensated",
        "differential",
        "burden",
        "maintaining",
        "grass",
        "providing",
        "police",
        "protection",
        "seem",
        "taking",
        "advantage",
        "defender",
        "duty",
        "vote",
        "might",
        "thus",
        "argue",
        "nonvoters",
        "free",
        "ride",
        "voter",
        "nonvoters",
        "benefit",
        "government",
        "voter",
        "provide",
        "help",
        "provide",
        "government",
        "least",
        "argument",
        "duty",
        "vote",
        "depend",
        "controversial",
        "assumption",
        "individual",
        "vote",
        "make",
        "difference",
        "generalizationpublic",
        "goodsdebt",
        "society",
        "argument",
        "claim",
        "citizen",
        "abstain",
        "voting",
        "thereby",
        "free",
        "ride",
        "provision",
        "good",
        "government",
        "fail",
        "pay",
        "debt",
        "society",
        "civic",
        "virtue",
        "argument",
        "claim",
        "citizen",
        "duty",
        "exercise",
        "civic",
        "virtue",
        "thus",
        "vote",
        "complicity",
        "argument",
        "claim",
        "citizen",
        "duty",
        "vote",
        "outcome",
        "order",
        "avoid",
        "complicit",
        "injustice",
        "government",
        "commit",
        "however",
        "general",
        "challenge",
        "argument",
        "support",
        "duty",
        "vote",
        "call",
        "particularity",
        "problem",
        "show",
        "duty",
        "vote",
        "enough",
        "appeal",
        "goal",
        "g",
        "citizen",
        "plausibly",
        "duty",
        "support",
        "argue",
        "voting",
        "one",
        "way",
        "support",
        "help",
        "achieve",
        "g",
        "instead",
        "proponent",
        "duty",
        "vote",
        "need",
        "show",
        "specifically",
        "voting",
        "way",
        "required",
        "way",
        "support",
        "g",
        "j",
        "brennan",
        "a",
        "worry",
        "three",
        "argument",
        "might",
        "show",
        "voting",
        "one",
        "way",
        "among",
        "many",
        "discharge",
        "duty",
        "question",
        "indeed",
        "might",
        "even",
        "especially",
        "good",
        "way",
        "let",
        "alone",
        "obligatory",
        "way",
        "discharge",
        "duty",
        "instance",
        "suppose",
        "one",
        "argues",
        "citizen",
        "vote",
        "ought",
        "exercise",
        "civic",
        "virtue",
        "one",
        "must",
        "explain",
        "duty",
        "exercise",
        "civic",
        "virtue",
        "specifically",
        "implies",
        "duty",
        "vote",
        "rather",
        "duty",
        "perform",
        "one",
        "thousand",
        "possible",
        "act",
        "civic",
        "virtue",
        "citizen",
        "duty",
        "agent",
        "help",
        "promote",
        "citizen",
        "wellbeing",
        "seems",
        "duty",
        "could",
        "discharged",
        "volunteering",
        "making",
        "art",
        "working",
        "productive",
        "job",
        "add",
        "social",
        "surplus",
        "citizen",
        "duty",
        "avoid",
        "complicity",
        "injustice",
        "seems",
        "rather",
        "voting",
        "could",
        "engage",
        "civil",
        "disobedience",
        "write",
        "letter",
        "newspaper",
        "editor",
        "pamphlet",
        "political",
        "theory",
        "book",
        "donate",
        "money",
        "engage",
        "conscientious",
        "abstention",
        "protest",
        "assassinate",
        "criminal",
        "political",
        "leader",
        "number",
        "activity",
        "unclear",
        "voting",
        "special",
        "required",
        "note",
        "particularity",
        "problem",
        "need",
        "framed",
        "consequentialist",
        "term",
        "ie",
        "defender",
        "critic",
        "duty",
        "vote",
        "need",
        "say",
        "determines",
        "whether",
        "voting",
        "morally",
        "required",
        "depends",
        "whether",
        "voting",
        "highest",
        "expected",
        "consequence",
        "rather",
        "issue",
        "whether",
        "voting",
        "simply",
        "one",
        "many",
        "way",
        "discharge",
        "underlying",
        "duty",
        "respond",
        "underlying",
        "reason",
        "whether",
        "voting",
        "way",
        "special",
        "unique",
        "reason",
        "select",
        "voting",
        "particular",
        "obligatory",
        "mean",
        "responding",
        "underlying",
        "reason",
        "maskivker",
        "responds",
        "partly",
        "objection",
        "saying",
        "effect",
        "j",
        "brennan",
        "a",
        "freiman",
        "say",
        "underlying",
        "ground",
        "duty",
        "vote",
        "discharged",
        "discharged",
        "better",
        "action",
        "voting",
        "maskivker",
        "take",
        "suggest",
        "voting",
        "optional",
        "one",
        "vote",
        "one",
        "already",
        "sufficiently",
        "wellinformed",
        "publiclyspirited",
        "also",
        "performs",
        "action",
        "maskivker",
        "ground",
        "argument",
        "deontological",
        "duty",
        "easy",
        "aid",
        "one",
        "provide",
        "aid",
        "others",
        "low",
        "cost",
        "oneself",
        "one",
        "already",
        "wellinformed",
        "citizen",
        "voting",
        "instance",
        "easy",
        "aid"
    ]
}