{
    "main_text": "Who Should Be Allowed to Vote? Should Everyone Receive Equal Voting Rights? || Democratic Challenges to One Person, One Vote\n6.2 Non-Democratic Challenges to One Person, One Vote\n\nEarly defenders of democracy were concerned to show democracy is\nsuperior to aristocracy, monarchy, or oligarchy. However, in recent\nyears, epistocracy has emerged as a major contender to\ndemocracy (Estlund 2003, 2007; Landemore 2012). A system is said to be\nepistocratic to the extent that the system formally allocates\npolitical power on the basis of knowledge or political competence. For\ninstance, an epistocracy might give university-educated citizens\nadditional votes (Mill 1861), exclude citizens from voting unless they\ncan pass a voter qualification exam, weigh votes by each voter’s\ndegree of political knowledge while correcting for the influence of\ndemographic factors, or create panels of experts who have the right to\nveto democratic legislation (Caplan 2007; J. Brennan 2011b;\nLópez-Guerra 2014; Mulligan 2015).\n\nArguments for epistocracy generally center on concerns about\ndemocratic incompetence. Epistocrats hold that democracy imbues\ncitizens with the right to vote in a promiscuous way. Ample empirical\nresearch has shown that the mean, median, and modal levels of basic\npolitical knowledge (let alone social scientific knowledge) among\ncitizens is extremely low (Somin 2013; Caplan 2007; Delli Carpini and\nKeeter 1996). Further, political knowledge makes a significant\ndifference in how citizens vote and what policies they support\n(Althaus 1998, 2003; Caplan 2007; Gilens 2012). Epistocrats believe\nthat restricting or weighting votes would protect against some of the\ndownsides of democratic incompetence. \n\nOne argument for epistocracy is that the legitimacy of political\ndecisions depends upon them being made competently and in good faith.\nConsider, as an analogy: In a criminal trial, the jury’s\ndecision is high stakes; their decision can remove a person’s\nrights or greatly harm their life, liberty, welfare, or property. If a\njury made its decision out of ignorance, malice, whimsy, or on the\nbasis of irrational and biased thought processes, we arguably should\nnot and probably would not regard the jury’s decision as\nauthoritative or legitimate. Instead, we think the criminal has a\nright to a trial conducted by competent people in good faith. In many\nrespects, electoral decisions are similar to jury decisions: they also\nare high stakes, and can result in innocent people losing their lives,\nliberty, welfare, or property. If the legitimacy and authority of a\njury decision depends upon the jury making a competent decision in\ngood faith, then perhaps so should the legitimacy and authority of\nmost other governmental decisions, including the decisions that\nelectorates and their representatives make. Now, suppose, in light of\nwidespread voter ignorance and irrationality, it turns out that\ndemocratic electorates tend to make incompetent decisions. If so, then\nthis seems to provide at least presumptive grounds for favoring\nepistocracy over democracy (J. Brennan 2011b). \n\nSome dispute whether epistocracy would in fact perform better than\ndemocracy, even in principle. Epistocracy generally attempts to\ngenerate better political outcomes by in some way raising the average\nreliability of political decision-makers. Political scientists Lu Hong\nand Scott Page (2004) adduced a mathematical theorem showing that\nunder the right conditions, cognitive diversity among the participants\nin a collective decision more strongly contributes to the group making\na smart decision than does increasing the individual\nparticipants’ reliability. On the Hong-Page theorem, it is\npossible that having a large number of diverse but unreliable\ndecision-makers in a collective decision will outperform having a\nsmaller number of less diverse but more reliable decision-makers.\nThere is some debate over whether the Hong-Page theorem has any\nmathematical substance (Thompson 2014 claims it does not), whether\nreal-world political decisions meet the conditions of the theorem, and\nif so, to what extent that justifies universal suffrage, or merely\nshows that having widespread but restricted suffrage is superior to\nhaving highly restricted suffrage (Landemore 2012; Somin 2013:\n113–5).\n\nRelatedly, Condorcet’s Jury Theorem holds that under the right\nconditions, provided the average voter is reliable, as more and more\nvoters are added to a collective decision, the probability that the\ndemocracy will make the right choice approaches 1 (List and Goodin\n2001). However, assuming the theorem applies to real-life democratic\ndecisions, whether the theorem supports or condemns democracy depends\non how reliable voters are. If voters do systematically worse than\nchance (e.g., Althaus 2003; Caplan 2007), then the theorem instead\nimplies that large democracies almost always make the wrong\nchoice.\n\nOne worry about certain forms of epistocracy, such as a system in\nwhich voters must earn the right to vote by passing an examination, is\nthat such systems might make decisions that are biased toward members\nof certain demographic groups. After all, political knowledge is not\nevenly dispersed among all demographic groups. (At the very least, the\nkinds of knowledge political scientists have been studying are not\nevenly distributed. Whether other kinds of knowledge are better\ndistributed is an open question.) On average, in the United States, on\nmeasures of basic political knowledge, whites know more than blacks,\npeople in the Northeast know more than people in the South, men know\nmore than women, middle-aged people know more than the young or old,\nand high-income people know more than the poor (Delli Carpini and\nKeeter 1996: 137–177). If such a voter examination system were\nimplemented, the resulting electorate would be whiter, maler, richer,\nmore middle-aged, and better employed than the population at large.\nDemocrats might reasonably worry that for this very reason an\nepistocracy would not take the interests of non-whites, women, the\npoor, or the unemployed into proper consideration. \n\nHowever, at least one form of epistocracy may be able to avoid this\nobjection. Consider, for instance, the “enfranchisement\nlottery”: \n\nThe enfranchisement lottery consists of two devices. First, there\nwould be a sortition to disenfranchise the vast majority of the\npopulation. Prior to every election, all but a random sample of the\npublic would be excluded. I call this device the exclusionary\nsortition because it merely tells us who will not be entitled to vote\nin a given contest. Indeed, those who survive the sortition (the\npre-voters) would not be automatically enfranchised. Like everyone in\nthe larger group from which they are drawn, pre-voters would be\nassumed to be insufficiently competent to vote. This is where the\nsecond device comes in. To finally become enfranchised and vote,\npre-voters would gather in relatively small groups to participate in a\ncompetence-building process carefully designed to optimize their\nknowledge about the alternatives on the ballot. (López-Guerra\n2014: 4; cf. Ackerman and Fishkin 2005)\n\n\nUnder this scheme, no one has any presumptive right to vote. Instead,\neveryone has, by default, equal eligibility to be selected to become a\nvoter. Before the enfranchisement lottery takes place, candidates\nwould proceed with their campaigns as they do in democracy. However,\nthey campaign without knowing which citizens in particular will\neventually acquire the right to vote. Immediately before the election,\na random but representative subset of citizens is then selected by\nlottery. These citizens are not automatically granted the right to\nvote. Instead, the chosen citizens merely acquire permission to earn\nthe right to vote. To earn this right, they must then participate in\nsome sort of competence-building exercise, such as studying party\nplatforms or meeting in a deliberative forum with one another. In\npractice this system might suffer corruption or abuse, but,\nepistocrats respond, so does democracy in practice. For epistocrats,\nthe question is which system works better, i.e., produces the best or\nmost substantively just outcomes, all things considered.\n\nOne important deontological objection to epistocracy is that it may be\nincompatible with public reason liberalism (Estlund 2007). Public\nreason liberals hold that distribution of coercive political power is\nlegitimate and authoritative only if all reasonable people subject to\nthat power have strong enough grounds to endorse a justification for\nthat power (Vallier and D’Agostino 2013). By definition,\nepistocracy imbues some citizens with greater power than others on the\ngrounds that these citizens have greater social scientific knowledge.\nHowever, the objection goes, reasonable people could disagree about\njust what counts as expertise and just who the experts are. If\nreasonable people disagree about what counts as expertise and who the\nexperts are, then epistocracy distributes political power on terms not\nall reasonable people have conclusive grounds to endorse. Epistocracy\nthus distributes political power on terms not all reasonable people\nhave conclusive grounds to endorse. (See, however, Mulligan 2015.)\n",
    "section_title": "6.2 Non-Democratic Challenges to One Person, One Vote",
    "entry_title": "The Ethics and Rationality of Voting",
    "hierarchy_title": "The Ethics and Rationality of Voting || Who Should Be Allowed to Vote? Should Everyone Receive Equal Voting Rights? || Democratic Challenges to One Person, One Vote",
    "tokenized_text": [
        "allowed",
        "vote",
        "everyone",
        "receive",
        "equal",
        "voting",
        "right",
        "democratic",
        "challenge",
        "one",
        "person",
        "one",
        "vote",
        "nondemocratic",
        "challenge",
        "one",
        "person",
        "one",
        "vote",
        "early",
        "defender",
        "democracy",
        "concerned",
        "show",
        "democracy",
        "superior",
        "aristocracy",
        "monarchy",
        "oligarchy",
        "however",
        "recent",
        "year",
        "epistocracy",
        "emerged",
        "major",
        "contender",
        "democracy",
        "estlund",
        "landemore",
        "system",
        "said",
        "epistocratic",
        "extent",
        "system",
        "formally",
        "allocates",
        "political",
        "power",
        "basis",
        "knowledge",
        "political",
        "competence",
        "instance",
        "epistocracy",
        "might",
        "give",
        "universityeducated",
        "citizen",
        "additional",
        "vote",
        "mill",
        "exclude",
        "citizen",
        "voting",
        "unless",
        "pas",
        "voter",
        "qualification",
        "exam",
        "weigh",
        "vote",
        "voter",
        "degree",
        "political",
        "knowledge",
        "correcting",
        "influence",
        "demographic",
        "factor",
        "create",
        "panel",
        "expert",
        "right",
        "veto",
        "democratic",
        "legislation",
        "caplan",
        "j",
        "brennan",
        "b",
        "lópezguerra",
        "mulligan",
        "argument",
        "epistocracy",
        "generally",
        "center",
        "concern",
        "democratic",
        "incompetence",
        "epistocrats",
        "hold",
        "democracy",
        "imbues",
        "citizen",
        "right",
        "vote",
        "promiscuous",
        "way",
        "ample",
        "empirical",
        "research",
        "shown",
        "mean",
        "median",
        "modal",
        "level",
        "basic",
        "political",
        "knowledge",
        "let",
        "alone",
        "social",
        "scientific",
        "knowledge",
        "among",
        "citizen",
        "extremely",
        "low",
        "somin",
        "caplan",
        "delli",
        "carpini",
        "keeter",
        "political",
        "knowledge",
        "make",
        "significant",
        "difference",
        "citizen",
        "vote",
        "policy",
        "support",
        "althaus",
        "caplan",
        "gilens",
        "epistocrats",
        "believe",
        "restricting",
        "weighting",
        "vote",
        "would",
        "protect",
        "downside",
        "democratic",
        "incompetence",
        "one",
        "argument",
        "epistocracy",
        "legitimacy",
        "political",
        "decision",
        "depends",
        "upon",
        "made",
        "competently",
        "good",
        "faith",
        "consider",
        "analogy",
        "criminal",
        "trial",
        "jury",
        "decision",
        "high",
        "stake",
        "decision",
        "remove",
        "person",
        "right",
        "greatly",
        "harm",
        "life",
        "liberty",
        "welfare",
        "property",
        "jury",
        "made",
        "decision",
        "ignorance",
        "malice",
        "whimsy",
        "basis",
        "irrational",
        "biased",
        "thought",
        "process",
        "arguably",
        "probably",
        "would",
        "regard",
        "jury",
        "decision",
        "authoritative",
        "legitimate",
        "instead",
        "think",
        "criminal",
        "right",
        "trial",
        "conducted",
        "competent",
        "people",
        "good",
        "faith",
        "many",
        "respect",
        "electoral",
        "decision",
        "similar",
        "jury",
        "decision",
        "also",
        "high",
        "stake",
        "result",
        "innocent",
        "people",
        "losing",
        "life",
        "liberty",
        "welfare",
        "property",
        "legitimacy",
        "authority",
        "jury",
        "decision",
        "depends",
        "upon",
        "jury",
        "making",
        "competent",
        "decision",
        "good",
        "faith",
        "perhaps",
        "legitimacy",
        "authority",
        "governmental",
        "decision",
        "including",
        "decision",
        "electorate",
        "representative",
        "make",
        "suppose",
        "light",
        "widespread",
        "voter",
        "ignorance",
        "irrationality",
        "turn",
        "democratic",
        "electorate",
        "tend",
        "make",
        "incompetent",
        "decision",
        "seems",
        "provide",
        "least",
        "presumptive",
        "ground",
        "favoring",
        "epistocracy",
        "democracy",
        "j",
        "brennan",
        "b",
        "dispute",
        "whether",
        "epistocracy",
        "would",
        "fact",
        "perform",
        "better",
        "democracy",
        "even",
        "principle",
        "epistocracy",
        "generally",
        "attempt",
        "generate",
        "better",
        "political",
        "outcome",
        "way",
        "raising",
        "average",
        "reliability",
        "political",
        "decisionmakers",
        "political",
        "scientist",
        "lu",
        "hong",
        "scott",
        "page",
        "adduced",
        "mathematical",
        "theorem",
        "showing",
        "right",
        "condition",
        "cognitive",
        "diversity",
        "among",
        "participant",
        "collective",
        "decision",
        "strongly",
        "contributes",
        "group",
        "making",
        "smart",
        "decision",
        "increasing",
        "individual",
        "participant",
        "reliability",
        "hongpage",
        "theorem",
        "possible",
        "large",
        "number",
        "diverse",
        "unreliable",
        "decisionmakers",
        "collective",
        "decision",
        "outperform",
        "smaller",
        "number",
        "le",
        "diverse",
        "reliable",
        "decisionmakers",
        "debate",
        "whether",
        "hongpage",
        "theorem",
        "mathematical",
        "substance",
        "thompson",
        "claim",
        "whether",
        "realworld",
        "political",
        "decision",
        "meet",
        "condition",
        "theorem",
        "extent",
        "justifies",
        "universal",
        "suffrage",
        "merely",
        "show",
        "widespread",
        "restricted",
        "suffrage",
        "superior",
        "highly",
        "restricted",
        "suffrage",
        "landemore",
        "somin",
        "relatedly",
        "condorcet",
        "jury",
        "theorem",
        "hold",
        "right",
        "condition",
        "provided",
        "average",
        "voter",
        "reliable",
        "voter",
        "added",
        "collective",
        "decision",
        "probability",
        "democracy",
        "make",
        "right",
        "choice",
        "approach",
        "list",
        "goodin",
        "however",
        "assuming",
        "theorem",
        "applies",
        "reallife",
        "democratic",
        "decision",
        "whether",
        "theorem",
        "support",
        "condemns",
        "democracy",
        "depends",
        "reliable",
        "voter",
        "voter",
        "systematically",
        "worse",
        "chance",
        "eg",
        "althaus",
        "caplan",
        "theorem",
        "instead",
        "implies",
        "large",
        "democracy",
        "almost",
        "always",
        "make",
        "wrong",
        "choice",
        "one",
        "worry",
        "certain",
        "form",
        "epistocracy",
        "system",
        "voter",
        "must",
        "earn",
        "right",
        "vote",
        "passing",
        "examination",
        "system",
        "might",
        "make",
        "decision",
        "biased",
        "toward",
        "member",
        "certain",
        "demographic",
        "group",
        "political",
        "knowledge",
        "evenly",
        "dispersed",
        "among",
        "demographic",
        "group",
        "least",
        "kind",
        "knowledge",
        "political",
        "scientist",
        "studying",
        "evenly",
        "distributed",
        "whether",
        "kind",
        "knowledge",
        "better",
        "distributed",
        "open",
        "question",
        "average",
        "united",
        "state",
        "measure",
        "basic",
        "political",
        "knowledge",
        "white",
        "know",
        "black",
        "people",
        "northeast",
        "know",
        "people",
        "south",
        "men",
        "know",
        "woman",
        "middleaged",
        "people",
        "know",
        "young",
        "old",
        "highincome",
        "people",
        "know",
        "poor",
        "delli",
        "carpini",
        "keeter",
        "voter",
        "examination",
        "system",
        "implemented",
        "resulting",
        "electorate",
        "would",
        "whiter",
        "maler",
        "richer",
        "middleaged",
        "better",
        "employed",
        "population",
        "large",
        "democrat",
        "might",
        "reasonably",
        "worry",
        "reason",
        "epistocracy",
        "would",
        "take",
        "interest",
        "nonwhites",
        "woman",
        "poor",
        "unemployed",
        "proper",
        "consideration",
        "however",
        "least",
        "one",
        "form",
        "epistocracy",
        "may",
        "able",
        "avoid",
        "objection",
        "consider",
        "instance",
        "enfranchisement",
        "lottery",
        "enfranchisement",
        "lottery",
        "consists",
        "two",
        "device",
        "first",
        "would",
        "sortition",
        "disenfranchise",
        "vast",
        "majority",
        "population",
        "prior",
        "every",
        "election",
        "random",
        "sample",
        "public",
        "would",
        "excluded",
        "call",
        "device",
        "exclusionary",
        "sortition",
        "merely",
        "tell",
        "u",
        "entitled",
        "vote",
        "given",
        "contest",
        "indeed",
        "survive",
        "sortition",
        "prevoters",
        "would",
        "automatically",
        "enfranchised",
        "like",
        "everyone",
        "larger",
        "group",
        "drawn",
        "prevoters",
        "would",
        "assumed",
        "insufficiently",
        "competent",
        "vote",
        "second",
        "device",
        "come",
        "finally",
        "become",
        "enfranchised",
        "vote",
        "prevoters",
        "would",
        "gather",
        "relatively",
        "small",
        "group",
        "participate",
        "competencebuilding",
        "process",
        "carefully",
        "designed",
        "optimize",
        "knowledge",
        "alternative",
        "ballot",
        "lópezguerra",
        "cf",
        "ackerman",
        "fishkin",
        "scheme",
        "one",
        "presumptive",
        "right",
        "vote",
        "instead",
        "everyone",
        "default",
        "equal",
        "eligibility",
        "selected",
        "become",
        "voter",
        "enfranchisement",
        "lottery",
        "take",
        "place",
        "candidate",
        "would",
        "proceed",
        "campaign",
        "democracy",
        "however",
        "campaign",
        "without",
        "knowing",
        "citizen",
        "particular",
        "eventually",
        "acquire",
        "right",
        "vote",
        "immediately",
        "election",
        "random",
        "representative",
        "subset",
        "citizen",
        "selected",
        "lottery",
        "citizen",
        "automatically",
        "granted",
        "right",
        "vote",
        "instead",
        "chosen",
        "citizen",
        "merely",
        "acquire",
        "permission",
        "earn",
        "right",
        "vote",
        "earn",
        "right",
        "must",
        "participate",
        "sort",
        "competencebuilding",
        "exercise",
        "studying",
        "party",
        "platform",
        "meeting",
        "deliberative",
        "forum",
        "one",
        "another",
        "practice",
        "system",
        "might",
        "suffer",
        "corruption",
        "abuse",
        "epistocrats",
        "respond",
        "democracy",
        "practice",
        "epistocrats",
        "question",
        "system",
        "work",
        "better",
        "ie",
        "produce",
        "best",
        "substantively",
        "outcome",
        "thing",
        "considered",
        "one",
        "important",
        "deontological",
        "objection",
        "epistocracy",
        "may",
        "incompatible",
        "public",
        "reason",
        "liberalism",
        "estlund",
        "public",
        "reason",
        "liberal",
        "hold",
        "distribution",
        "coercive",
        "political",
        "power",
        "legitimate",
        "authoritative",
        "reasonable",
        "people",
        "subject",
        "power",
        "strong",
        "enough",
        "ground",
        "endorse",
        "justification",
        "power",
        "vallier",
        "agostino",
        "definition",
        "epistocracy",
        "imbues",
        "citizen",
        "greater",
        "power",
        "others",
        "ground",
        "citizen",
        "greater",
        "social",
        "scientific",
        "knowledge",
        "however",
        "objection",
        "go",
        "reasonable",
        "people",
        "could",
        "disagree",
        "count",
        "expertise",
        "expert",
        "reasonable",
        "people",
        "disagree",
        "count",
        "expertise",
        "expert",
        "epistocracy",
        "distributes",
        "political",
        "power",
        "term",
        "reasonable",
        "people",
        "conclusive",
        "ground",
        "endorse",
        "epistocracy",
        "thus",
        "distributes",
        "political",
        "power",
        "term",
        "reasonable",
        "people",
        "conclusive",
        "ground",
        "endorse",
        "see",
        "however",
        "mulligan"
    ]
}