{
    "main_text": "Indivisibilism || Chatton’s Response to Aristotle in Four Conclusions\n5.6 Chatton’s Response to Aristotle in Four Conclusions\n\nChatton thought the touching argument could be defanged in one move.\nLooking carefully at Aristotle’s arguments Chatton notices that\nthe discreteness of the indivisibles and a kind of temporal notion of\ncomposition are really doing most of the work. Aristotle is imagining\nwhat would happen if small, discrete, separated, independently\nexisting things would come together and make a continuum; he is\nthinking of Democritus in particular, and of his atoms, existing\nin actu apart from anything they might compose. But this view\nhas very little relevance to what Chatton was trying to do with\nindivisibles in theology. Although the motion of an indivisible may be\nproblematic and needs to be clarified, the first step to getting\nindivisibles positively involved in the physics of angelic and\ncelestial motion is simply to reverse their banishment by Aristotle.\nChatton did not oppose the touching argument merely because he was\nforced to when his critics raised it against him; rather\nChatton’s treatment of indivisibles denies the relevance of the\ntouching argument because he thinks the perceived universality of its\nconclusion is merely illusory.\n\nIn Quaestio de compositione continui, a text which dates from\nthe 1320’s and which contains a better organized and clearer\ndiscussion than his Reportatio of the same time period,\nChatton (or possibly one of his followers) offers four conclusions,\neach of which sounds a bit strange in isolation, but which make sense\nin the context of the touching argument. First we quote him, then give\nsome analysis that may relieve some of the strangeness:\n\n\nConclusion #1: ...I hold three conclusions. First,\nthat no continuum is composed of indivisibles existing in\nactu, because there is a contradiction between the terms\n“continuum” and “an indivisible in\nactu”. This is because if there is a continuum, its parts\nare so related that none exists on its own, actually [in\nactu] separated from the other parts; but if an indivisible did\nactually [in actu] exist, it would have to exist on its own,\nseparated from other parts of the same kind. Democritus says the\nopposite, positing the continuum to be composed from atoms, which form\na “continuum” merely through a kind of congregation.\nAristotle proceeds against him for this reason, but Aristotle’s\narguments do not apply to someone who agrees that\n“continuum” and “indivisible in actu”\ncontradict, [as I do]. (Quaestio de compositione continui,\nparagraph 56)\n\n\nChatton’s main concession here is that “indivisible in\nactu entails discrete”, and discrete does conflict with\ncontinuous, as Aristotle shows. This seems to mean that Chatton\nconcedes the whole of subcase (2a) in the touching argument but denies\nits relevance. Aristotle’s case (2a) applies to Democritus, for\nexample, but not to those who believe instead in indivisibles in\npotentia:\n\n\nConclusion #2: The second conclusion is that the\ncontinuum is composed of indivisibles in potentia.\n(Quaestio de compositione continui, paragraph 57)\n\n\nHere Chatton claims, not surprisingly, that there is another kind of\nindivisible; these he calls “indivisibles in\npotentia”, which can compose a continuum. Given the\nconcession in the first conclusion, it must be the case that these\nindivisibles in potentia are not discrete.\n\nThis is the master key to understanding Chatton’s critique of\nAristotle. For it is the discreteness of the contained indivisible\nthat Chatton denies, and which he views as doing all the work in the\ntouching argument, not only in case (2a), but even in cases (1a) and\n(1b). This fact about the touching argument is easy to miss, since it\nmay seem as if the conflict between discrete and continuous only\noccurs in case (2). But it is discreteness that insured the\npossibility of touching, and since both of subcases under case (1)\ndepend upon touching to get the inconsistencies, without the\nassumption of their discreteness (what Chatton calls their being\nin actu), none of the arguments in case (1) can even get\nstarted. Hence Chatton believes he has, with these two paragraphs,\ndispensed with cases (1a), (1b), and (2a) in the touching argument in\none go.\n\nBut really case (2b) is also taken care of, since in that subcase\nAristotle simply shows that indivisibles are not discrete, something\nChatton already conceded. Hence, he sidesteps the entire touching\nargument with these first two conclusions.\n\nTwo further conclusions that Chatton gives seemed strange to his\ncontemporaries and stranger still to us. They are aimed at the final\nargument sketched in 5.5 above, the one relating composition and\ninfinite divisibility in continua. That argument forces Chatton to\ntake a stand on how his indivisibles in potentia compose a\ncontinuum, and on infinite divisibility in such a way that he evades\nAristotle’s reasoning in that argument. His next conclusion\nbegins the process:\n\n\nConclusion #3: The third conclusion is: while no\ncreature could, granting the way the world actually works, complete\nthe division of a continuum, or divide it into pieces without the part\nthey just divided having parts of its own, or see an indivisible\nentity on its own; nevertheless, God could do any of these things, and\nhe could confer upon a creature the power to do any of them as well.\nAnd why not, given that God can perfectly well make physical fire\naffect our souls [in hell], and can make it so that the human eye can\nsee a spiritual creature? (Quaestio de compositione continui,\nparagraph 58)\n\n\nChatton’s third claim is that indivisibles in potentia\nare not naturally the bottom level of division of any\nextended magnitude. However, God can complete the division of a\ncontinuum into partless parts (indivisibles) and cause one of them, or\nindeed any indivisible, to be seen alone (he is thinking of angels\nhere). Such a thing would be an indivisible in actu. This\nsuggests that for him indivisibles in actu are, for example,\nwhat the bottom level would be if God supernaturally completed the\ndivision of an extended continuum; there is no contradiction involved\nwith such indivisibles “being in” an extended thing or\nwith them being the supernatural result of dividing it, there is only\na problem with them discretely composing it, which Chatton already\ndenied. The indivisible parts of true continua do not and cannot\nmetaphysically precede them in order to compose them. Chatton in\neffect denies the first premise of the argument, that\n“Everything composed of certain realities is divisible\ninto those realities as parts”; continua are composed of\nindivisibles in potentia, but divisible, and that only by\nGod, into indivisibles in actu. This leads to a surprising\ncorollary: God can break the geometric line into lowest constituents,\nbut he cannot restore it from those pieces, since this is a\ncontradiction.\n\nWhat recourse does the Aristotelian have at this point? Perhaps simply\nto point out that however it goes with divisibility and with the\ntouching of indivisibles, nevertheless continua are infinitely\ndivisible, and indivisibles aren’t divisible, so they cannot be\nintegral parts of continua. This is practically to define\n“continuous” as “infinitely divisible”, but\nnevertheless it is a powerful intuition, and Aristotle would certainly\nnot be the last to insist on it. Chatton’s final conclusion is\naimed at this last gasp. He simply denies, on theological grounds,\nthat a finite continuum is infinitely divisible, and this helps\nexplain the motivation for what is otherwise his strangest claim:\n\n\nConclusion #4: I say, therefore, that in all existing\nthings there are only finitely many entities, whether of an\nindivisible or divisible kind. Nor could God make it be the case that\ninfinitely many things compose any continuum in the physical world,\nnor could He make it the case that, in any existing thing, there are\nparts composing it so numerous that there can’t be more\n[absolutely]; but rather, [it is correct merely to say that]\nthe components will be so great a plurality that there cannot be more\nin the particular thing, because [absolutely speaking] God\ncan always make more of something beyond any given plurality.\n(Quaestio de compositione continui, paragraph 82)\n\n\nChatton’s final conclusion breaks into four parts:\n\n(1) All existing things, because finite, have at most finitely many\nentities in them or composing them [naturally].\n\n(2) It is logically impossible for any existing thing [even a\ncontinuum] to have infinitely many entities in it or composing it,\nwhere “infinite” means “so many things that there\ncannot be more, absolutely speaking”. Nothing can be an absolute\nplenum.\n\n(3) It is logically possible that a given thing cannot have any more\nentities in it as a particular individual thing. There is such a thing\nas relative fullness.\n\n(4) The reason for (2) and (3) is that God by his absolute power can\nmake more of a thing beyond any given number of that thing. Absolute\nfullness would restrict God’s absolute power and so is\nimpossible, as (2) claims; while relative fullness is self-consistent\nand consistent with God’s absolute power and so is possible, as\n(3) claims.\n\nThe upshot of these four clauses is that no finite thing is infinitely\ndivisible into parts; no physical thing because all such are finite,\nnor anything else if ‘infinite’ means so much there\ncannot be more in it, for a given object cannot always have more\nin it and remain the same object, and, speaking generally, even if\ncontinuum c were composed of infinitely many entities of type\ne, God can always make more e’s.\nAristotle’s argument connecting composition and infinite\ndivisibility uses an illegitimate view of infinity, given divine\npower.\n\nChatton had more to say about how indivisibles touch, and his ideas\nwere again original and useful enough that even Wodeham, his\nstaunchest critic, was willing to apply them in certain contexts,\nremarking that Chatton’s arguments were a rational way to defend\nan unreasonable conclusion. But overall we should say that\nChatton’s indivisibilism is not an organic theory of structure\nof continua meant to undergird mathematics or even physics, rather, it\nsimply shows a way to go against Aristotle in order to save the\ntheological situation.\n",
    "section_title": "5.6 Chatton’s Response to Aristotle in Four Conclusions",
    "entry_title": "Walter Chatton",
    "hierarchy_title": "Walter Chatton || Indivisibilism || Chatton’s Response to Aristotle in Four Conclusions",
    "tokenized_text": [
        "indivisibilism",
        "chatton",
        "response",
        "aristotle",
        "four",
        "conclusion",
        "chatton",
        "response",
        "aristotle",
        "four",
        "conclusion",
        "chatton",
        "thought",
        "touching",
        "argument",
        "could",
        "defanged",
        "one",
        "move",
        "looking",
        "carefully",
        "aristotle",
        "argument",
        "chatton",
        "notice",
        "discreteness",
        "indivisibles",
        "kind",
        "temporal",
        "notion",
        "composition",
        "really",
        "work",
        "aristotle",
        "imagining",
        "would",
        "happen",
        "small",
        "discrete",
        "separated",
        "independently",
        "existing",
        "thing",
        "would",
        "come",
        "together",
        "make",
        "continuum",
        "thinking",
        "democritus",
        "particular",
        "atom",
        "existing",
        "actu",
        "apart",
        "anything",
        "might",
        "compose",
        "view",
        "little",
        "relevance",
        "chatton",
        "trying",
        "indivisibles",
        "theology",
        "although",
        "motion",
        "indivisible",
        "may",
        "problematic",
        "need",
        "clarified",
        "first",
        "step",
        "getting",
        "indivisibles",
        "positively",
        "involved",
        "physic",
        "angelic",
        "celestial",
        "motion",
        "simply",
        "reverse",
        "banishment",
        "aristotle",
        "chatton",
        "oppose",
        "touching",
        "argument",
        "merely",
        "forced",
        "critic",
        "raised",
        "rather",
        "chatton",
        "treatment",
        "indivisibles",
        "denies",
        "relevance",
        "touching",
        "argument",
        "think",
        "perceived",
        "universality",
        "conclusion",
        "merely",
        "illusory",
        "quaestio",
        "de",
        "compositione",
        "continui",
        "text",
        "date",
        "contains",
        "better",
        "organized",
        "clearer",
        "discussion",
        "reportatio",
        "time",
        "period",
        "chatton",
        "possibly",
        "one",
        "follower",
        "offer",
        "four",
        "conclusion",
        "sound",
        "bit",
        "strange",
        "isolation",
        "make",
        "sense",
        "context",
        "touching",
        "argument",
        "first",
        "quote",
        "give",
        "analysis",
        "may",
        "relieve",
        "strangeness",
        "conclusion",
        "hold",
        "three",
        "conclusion",
        "first",
        "continuum",
        "composed",
        "indivisibles",
        "existing",
        "actu",
        "contradiction",
        "term",
        "continuum",
        "indivisible",
        "actu",
        "continuum",
        "part",
        "related",
        "none",
        "exists",
        "actually",
        "actu",
        "separated",
        "part",
        "indivisible",
        "actually",
        "actu",
        "exist",
        "would",
        "exist",
        "separated",
        "part",
        "kind",
        "democritus",
        "say",
        "opposite",
        "positing",
        "continuum",
        "composed",
        "atom",
        "form",
        "continuum",
        "merely",
        "kind",
        "congregation",
        "aristotle",
        "proceeds",
        "reason",
        "aristotle",
        "argument",
        "apply",
        "someone",
        "agrees",
        "continuum",
        "indivisible",
        "actu",
        "contradict",
        "quaestio",
        "de",
        "compositione",
        "continui",
        "paragraph",
        "chatton",
        "main",
        "concession",
        "indivisible",
        "actu",
        "entail",
        "discrete",
        "discrete",
        "conflict",
        "continuous",
        "aristotle",
        "show",
        "seems",
        "mean",
        "chatton",
        "concedes",
        "whole",
        "subcase",
        "a",
        "touching",
        "argument",
        "denies",
        "relevance",
        "aristotle",
        "case",
        "a",
        "applies",
        "democritus",
        "example",
        "believe",
        "instead",
        "indivisibles",
        "potentia",
        "conclusion",
        "second",
        "conclusion",
        "continuum",
        "composed",
        "indivisibles",
        "potentia",
        "quaestio",
        "de",
        "compositione",
        "continui",
        "paragraph",
        "chatton",
        "claim",
        "surprisingly",
        "another",
        "kind",
        "indivisible",
        "call",
        "indivisibles",
        "potentia",
        "compose",
        "continuum",
        "given",
        "concession",
        "first",
        "conclusion",
        "must",
        "case",
        "indivisibles",
        "potentia",
        "discrete",
        "master",
        "key",
        "understanding",
        "chatton",
        "critique",
        "aristotle",
        "discreteness",
        "contained",
        "indivisible",
        "chatton",
        "denies",
        "view",
        "work",
        "touching",
        "argument",
        "case",
        "a",
        "even",
        "case",
        "a",
        "b",
        "fact",
        "touching",
        "argument",
        "easy",
        "miss",
        "since",
        "may",
        "seem",
        "conflict",
        "discrete",
        "continuous",
        "occurs",
        "case",
        "discreteness",
        "insured",
        "possibility",
        "touching",
        "since",
        "subcases",
        "case",
        "depend",
        "upon",
        "touching",
        "get",
        "inconsistency",
        "without",
        "assumption",
        "discreteness",
        "chatton",
        "call",
        "actu",
        "none",
        "argument",
        "case",
        "even",
        "get",
        "started",
        "hence",
        "chatton",
        "belief",
        "two",
        "paragraph",
        "dispensed",
        "case",
        "a",
        "b",
        "a",
        "touching",
        "argument",
        "one",
        "go",
        "really",
        "case",
        "b",
        "also",
        "taken",
        "care",
        "since",
        "subcase",
        "aristotle",
        "simply",
        "show",
        "indivisibles",
        "discrete",
        "something",
        "chatton",
        "already",
        "conceded",
        "hence",
        "sidestep",
        "entire",
        "touching",
        "argument",
        "first",
        "two",
        "conclusion",
        "two",
        "conclusion",
        "chatton",
        "give",
        "seemed",
        "strange",
        "contemporary",
        "stranger",
        "still",
        "u",
        "aimed",
        "final",
        "argument",
        "sketched",
        "one",
        "relating",
        "composition",
        "infinite",
        "divisibility",
        "continuum",
        "argument",
        "force",
        "chatton",
        "take",
        "stand",
        "indivisibles",
        "potentia",
        "compose",
        "continuum",
        "infinite",
        "divisibility",
        "way",
        "evades",
        "aristotle",
        "reasoning",
        "argument",
        "next",
        "conclusion",
        "begin",
        "process",
        "conclusion",
        "third",
        "conclusion",
        "creature",
        "could",
        "granting",
        "way",
        "world",
        "actually",
        "work",
        "complete",
        "division",
        "continuum",
        "divide",
        "piece",
        "without",
        "part",
        "divided",
        "part",
        "see",
        "indivisible",
        "entity",
        "nevertheless",
        "god",
        "could",
        "thing",
        "could",
        "confer",
        "upon",
        "creature",
        "power",
        "well",
        "given",
        "god",
        "perfectly",
        "well",
        "make",
        "physical",
        "fire",
        "affect",
        "soul",
        "hell",
        "make",
        "human",
        "eye",
        "see",
        "spiritual",
        "creature",
        "quaestio",
        "de",
        "compositione",
        "continui",
        "paragraph",
        "chatton",
        "third",
        "claim",
        "indivisibles",
        "potentia",
        "naturally",
        "bottom",
        "level",
        "division",
        "extended",
        "magnitude",
        "however",
        "god",
        "complete",
        "division",
        "continuum",
        "partless",
        "part",
        "indivisibles",
        "cause",
        "one",
        "indeed",
        "indivisible",
        "seen",
        "alone",
        "thinking",
        "angel",
        "thing",
        "would",
        "indivisible",
        "actu",
        "suggests",
        "indivisibles",
        "actu",
        "example",
        "bottom",
        "level",
        "would",
        "god",
        "supernaturally",
        "completed",
        "division",
        "extended",
        "continuum",
        "contradiction",
        "involved",
        "indivisibles",
        "extended",
        "thing",
        "supernatural",
        "result",
        "dividing",
        "problem",
        "discretely",
        "composing",
        "chatton",
        "already",
        "denied",
        "indivisible",
        "part",
        "true",
        "continuum",
        "metaphysically",
        "precede",
        "order",
        "compose",
        "chatton",
        "effect",
        "denies",
        "first",
        "premise",
        "argument",
        "everything",
        "composed",
        "certain",
        "reality",
        "divisible",
        "reality",
        "part",
        "continuum",
        "composed",
        "indivisibles",
        "potentia",
        "divisible",
        "god",
        "indivisibles",
        "actu",
        "lead",
        "surprising",
        "corollary",
        "god",
        "break",
        "geometric",
        "line",
        "lowest",
        "constituent",
        "restore",
        "piece",
        "since",
        "contradiction",
        "recourse",
        "aristotelian",
        "point",
        "perhaps",
        "simply",
        "point",
        "however",
        "go",
        "divisibility",
        "touching",
        "indivisibles",
        "nevertheless",
        "continuum",
        "infinitely",
        "divisible",
        "indivisibles",
        "divisible",
        "integral",
        "part",
        "continuum",
        "practically",
        "define",
        "continuous",
        "infinitely",
        "divisible",
        "nevertheless",
        "powerful",
        "intuition",
        "aristotle",
        "would",
        "certainly",
        "last",
        "insist",
        "chatton",
        "final",
        "conclusion",
        "aimed",
        "last",
        "gasp",
        "simply",
        "denies",
        "theological",
        "ground",
        "finite",
        "continuum",
        "infinitely",
        "divisible",
        "help",
        "explain",
        "motivation",
        "otherwise",
        "strangest",
        "claim",
        "conclusion",
        "say",
        "therefore",
        "existing",
        "thing",
        "finitely",
        "many",
        "entity",
        "whether",
        "indivisible",
        "divisible",
        "kind",
        "could",
        "god",
        "make",
        "case",
        "infinitely",
        "many",
        "thing",
        "compose",
        "continuum",
        "physical",
        "world",
        "could",
        "make",
        "case",
        "existing",
        "thing",
        "part",
        "composing",
        "numerous",
        "absolutely",
        "rather",
        "correct",
        "merely",
        "say",
        "component",
        "great",
        "plurality",
        "particular",
        "thing",
        "absolutely",
        "speaking",
        "god",
        "always",
        "make",
        "something",
        "beyond",
        "given",
        "plurality",
        "quaestio",
        "de",
        "compositione",
        "continui",
        "paragraph",
        "chatton",
        "final",
        "conclusion",
        "break",
        "four",
        "part",
        "existing",
        "thing",
        "finite",
        "finitely",
        "many",
        "entity",
        "composing",
        "naturally",
        "logically",
        "impossible",
        "existing",
        "thing",
        "even",
        "continuum",
        "infinitely",
        "many",
        "entity",
        "composing",
        "infinite",
        "mean",
        "many",
        "thing",
        "absolutely",
        "speaking",
        "nothing",
        "absolute",
        "plenum",
        "logically",
        "possible",
        "given",
        "thing",
        "entity",
        "particular",
        "individual",
        "thing",
        "thing",
        "relative",
        "fullness",
        "reason",
        "god",
        "absolute",
        "power",
        "make",
        "thing",
        "beyond",
        "given",
        "number",
        "thing",
        "absolute",
        "fullness",
        "would",
        "restrict",
        "god",
        "absolute",
        "power",
        "impossible",
        "claim",
        "relative",
        "fullness",
        "selfconsistent",
        "consistent",
        "god",
        "absolute",
        "power",
        "possible",
        "claim",
        "upshot",
        "four",
        "clause",
        "finite",
        "thing",
        "infinitely",
        "divisible",
        "part",
        "physical",
        "thing",
        "finite",
        "anything",
        "else",
        "infinite",
        "mean",
        "much",
        "given",
        "object",
        "always",
        "remain",
        "object",
        "speaking",
        "generally",
        "even",
        "continuum",
        "c",
        "composed",
        "infinitely",
        "many",
        "entity",
        "type",
        "e",
        "god",
        "always",
        "make",
        "e",
        "aristotle",
        "argument",
        "connecting",
        "composition",
        "infinite",
        "divisibility",
        "us",
        "illegitimate",
        "view",
        "infinity",
        "given",
        "divine",
        "power",
        "chatton",
        "say",
        "indivisibles",
        "touch",
        "idea",
        "original",
        "useful",
        "enough",
        "even",
        "wodeham",
        "staunchest",
        "critic",
        "willing",
        "apply",
        "certain",
        "context",
        "remarking",
        "chatton",
        "argument",
        "rational",
        "way",
        "defend",
        "unreasonable",
        "conclusion",
        "overall",
        "say",
        "chatton",
        "indivisibilism",
        "organic",
        "theory",
        "structure",
        "continuum",
        "meant",
        "undergird",
        "mathematics",
        "even",
        "physic",
        "rather",
        "simply",
        "show",
        "way",
        "go",
        "aristotle",
        "order",
        "save",
        "theological",
        "situation"
    ]
}