{
    "main_text": "How Should We Think about the Morality of War? || The Decisive Role of Necessity and Proportionality\n2.5 The Decisive Role of Necessity and Proportionality\n\nTraditional just war theory construes jus ad bellum and\njus in bello as sets of principles, satisfying which is\nnecessary and sufficient for a war’s being permissible. Jus\nad bellum typically comprises the following six principles:\n\nJust Cause: the war is an attempt to avert the right kind of\ninjury.\nLegitimate Authority: the war is fought by an entity that has the\nauthority to fight such wars.\nRight Intention: that entity intends to achieve the just cause,\nrather than using it as an excuse to achieve some wrongful end.\nReasonable Prospects of Success: the war is sufficiently likely\nto achieve its aims.\nProportionality: the morally weighted goods achieved by the war\noutweigh the morally weighted bads that it will cause.\nLast Resort (Necessity): there is no other less harmful way to\nachieve the just cause.\n\n\nTypically the jus in bello list comprises:\n\nDiscrimination: belligerents must always distinguish between\nmilitary objectives and civilians, and intentionally attack only\nmilitary objectives.\nProportionality: foreseen but unintended harms must be\nproportionate to the military advantage achieved.\nNecessity: the least harmful means feasible must be used.\n\n\nThese all matter to the ethics of war, and will be addressed below.\nHowever, it is unhelpful to view them as a checklist of necessary and\nsufficient conditions. When they are properly understood, only\nproportionality and necessity (in the guise of last resort in the\njus ad bellum) are necessary conditions for a war, or an act\nin a war, to be permissible, since no matter how badly going to war\nfails the other ad bellum criteria (for example) it might\nstill be permissible because it is the least awful of one’s\nalternatives, and so satisfies the necessity and proportionality\nconstraints.\n\nTo get an intuitive grasp on necessity and proportionality, note that\nif someone threatens my life, then killing her would be proportionate;\nbut if I could stop her by knocking her out, then killing her would be\nunnecessary, and so impermissible. The necessity and proportionality\nconstraints have the same root: with few exceptions (perhaps when it\nis deserved), harm is intrinsically bad. Harms (and indeed all bads)\nthat we cause must therefore be justified by some positive reason that\ncounts in their favour—such as good achieved or evil averted\n(Lazar 2012a). Both the necessity and proportionality constraints\ninvolve comparing the bads caused by an action with the goods that it\nachieves. They differ only in the kinds of options they compare.\n\nThe use of force is proportionate when the harm done is\ncounterbalanced by the good achieved in averting a threat. To\ndetermine this, we typically compare the candidate course of action\nwith what would happen if we allowed the threat to eventuate.\n\nOf course, in most cases we will have more than one means of averting\nor mitigating the threat. And a harmful option can be permissible only\nif all the harm that it involves is justified by a\ncorresponding good achieved. If some alternative would as successfully\navert the threat, but cause less harm, then the more harmful option is\nimpermissible, because it involves unnecessary harm.\n\nWhere an option O aims to avert a threat T, we determine\nO’s necessity by comparing it with all the other options\nthat will either mitigate or avert T. We determine its\nproportionality by comparing it with the harm suffered if T\nshould come about. The only difference between the proportionality and\nnecessity constraints is that the former involves comparing\none’s action with a very specific counterfactual\nscenario—in which we don’t act to avert the\nthreat—while the latter involves comparing it with all your\navailable options that have some prospect of averting or mitigating\nthe threat. In my view, we should simply expand this so that the\nnecessity constraint compares all your available options bar none.\nThen proportionality would essentially involve comparing each option\nwith the alternative of doing nothing, while necessity would involve\ncomparing all options (including doing nothing) in terms of their\nrespective balances of goods and bads. On this approach, necessity\nwould subsume proportionality. But this is a technical point with\nlittle substantive payoff.\n\nMore substantively, necessity and proportionality judgements concern\nconsequences, and yet they are typically made ex ante, before\nwe know what the results of our actions will be. They must therefore\nbe modified to take this uncertainty into account. The most obvious\nsolution is simply to refer to expected threats and\nexpected harms, where the expected harm of an option O\nis the probability-weighted average of the harms that might result if\nI take O, and the expected threat is the probability-weighted\naverage of the consequences of doing nothing to prevent the\nthreat—allowing for the possibility that the threat might not\neventuate at all (Lazar 2012b). We would also have to factor in the\noptions’ probability of averting the threat. This simple move\nobscures a number of important and undertheorised issues that we\ncannot discuss in detail here. For now, we must simply note that\nproportionality and necessity must be appropriately indexed to the\nagent’s uncertainty.\n\nNecessity and proportionality judgements involve weighing harms\ninflicted and threats averted, indeed all relevant goods and bads. The\nsimplest way to proceed would be to aggregate the harms to individual\npeople on each side, and call the act proportionate just in case it\naverts more harm than it causes, and necessary just in case no\nalternative involves less harm. But few deontologists, and indeed few\nnon-philosophers, think in this naively aggregative way. Instead we\nshould weight harms (etc.) according to factors such as whether the\nagent is directly responsible for them, and whether they are intended\nor merely\n foreseen.[9]\n Many also think that we can, perhaps even must, give greater\nimportance in our deliberations to our loved ones (for example) than\nto those tied to us only by the common bonds of humanity (Hurka 2007;\nLazar 2013; for criticism, see Lefkowitz 2009). Similarly, we might justifiably\nprioritise defending our own state’s sovereignty and territorial\nintegrity, even when doing so would not be impartially\n best.[10]\n Only when all these and other factors (many of which are discussed\nbelow) are taken into consideration can we form defensible conclusions\nabout which options are necessary and proportionate.\n\nThe other elements of the ethics of war contribute to the evaluation\nof proportionality and necessity, in one (or more) of three ways:\nidentifying positive reasons in favour of fighting; delineating the\nnegative reasons against fighting; or as staging-posts on the way to\njudgements of necessity and proportionality.\n\nGiven the gravity of the decision to go to war, only very serious\nthreats can give us just cause to fight. So if just cause is\nsatisfied, then you have weighty positive reasons to fight. Lacking\njust cause does not in itself aggravate the badness of\nfighting, but does make it less likely that the people killed in\npursuing one’s war aims will be liable to be killed (more on\nthis below, and see McMahan 2005a), which makes killing very hard to\njustify. Even if having a just cause is not strictly speaking a\nnecessary condition for warfare to be permissible, the absence of a\njust cause makes it very difficult for a war to satisfy\nproportionality.\n\nIf legitimate authority is satisfied then additional positive reasons\ncount in favour of fighting (see below). If it is not satisfied, then\nthis adds an additional reason against fighting, which must be\novercome for fighting to be proportionate.\n\nThe “reasonable prospects of success” criterion is a\nsurmountable hurdle on the way to proportionality. Typically, if a war\nlacks reasonable prospects of success, then it will be\ndisproportionate, since wars always involve causing significant harms,\nand if those harms are likely to be pointless then they are unlikely\nto be justified. But of course sometimes one’s likelihood of\nvictory is very low, and yet fighting is still the best available\noption, and so necessary and proportionate. Having reasonable\nprospects of success matters only for the same reasons that necessity\nand proportionality matter. If necessity and proportionality are\nsatisfied, then the reasonable prospects of success standard is\nirrelevant.\n\nRight intention may also be irrelevant, but insofar as it matters its\nabsence would be a reason against fighting; having the right intention\ndoes not give a positive reason to fight.\n\nLastly, discrimination is crucial to establishing proportionality and\nnecessity, because it tells us how to weigh the lives taken in\nwar.\n",
    "section_title": "2.5 The Decisive Role of Necessity and Proportionality",
    "entry_title": "War",
    "hierarchy_title": "War || How Should We Think about the Morality of War? || The Decisive Role of Necessity and Proportionality",
    "tokenized_text": [
        "think",
        "morality",
        "war",
        "decisive",
        "role",
        "necessity",
        "proportionality",
        "decisive",
        "role",
        "necessity",
        "proportionality",
        "traditional",
        "war",
        "theory",
        "construes",
        "jus",
        "ad",
        "bellum",
        "jus",
        "bello",
        "set",
        "principle",
        "satisfying",
        "necessary",
        "sufficient",
        "war",
        "permissible",
        "jus",
        "ad",
        "bellum",
        "typically",
        "comprises",
        "following",
        "six",
        "principle",
        "cause",
        "war",
        "attempt",
        "avert",
        "right",
        "kind",
        "injury",
        "legitimate",
        "authority",
        "war",
        "fought",
        "entity",
        "authority",
        "fight",
        "war",
        "right",
        "intention",
        "entity",
        "intends",
        "achieve",
        "cause",
        "rather",
        "using",
        "excuse",
        "achieve",
        "wrongful",
        "end",
        "reasonable",
        "prospect",
        "success",
        "war",
        "sufficiently",
        "likely",
        "achieve",
        "aim",
        "proportionality",
        "morally",
        "weighted",
        "good",
        "achieved",
        "war",
        "outweigh",
        "morally",
        "weighted",
        "bad",
        "cause",
        "last",
        "resort",
        "necessity",
        "le",
        "harmful",
        "way",
        "achieve",
        "cause",
        "typically",
        "jus",
        "bello",
        "list",
        "comprises",
        "discrimination",
        "belligerent",
        "must",
        "always",
        "distinguish",
        "military",
        "objective",
        "civilian",
        "intentionally",
        "attack",
        "military",
        "objective",
        "proportionality",
        "foreseen",
        "unintended",
        "harm",
        "must",
        "proportionate",
        "military",
        "advantage",
        "achieved",
        "necessity",
        "least",
        "harmful",
        "mean",
        "feasible",
        "must",
        "used",
        "matter",
        "ethic",
        "war",
        "addressed",
        "however",
        "unhelpful",
        "view",
        "checklist",
        "necessary",
        "sufficient",
        "condition",
        "properly",
        "understood",
        "proportionality",
        "necessity",
        "guise",
        "last",
        "resort",
        "jus",
        "ad",
        "bellum",
        "necessary",
        "condition",
        "war",
        "act",
        "war",
        "permissible",
        "since",
        "matter",
        "badly",
        "going",
        "war",
        "fails",
        "ad",
        "bellum",
        "criterion",
        "example",
        "might",
        "still",
        "permissible",
        "least",
        "awful",
        "one",
        "alternative",
        "satisfies",
        "necessity",
        "proportionality",
        "constraint",
        "get",
        "intuitive",
        "grasp",
        "necessity",
        "proportionality",
        "note",
        "someone",
        "threatens",
        "life",
        "killing",
        "would",
        "proportionate",
        "could",
        "stop",
        "knocking",
        "killing",
        "would",
        "unnecessary",
        "impermissible",
        "necessity",
        "proportionality",
        "constraint",
        "root",
        "exception",
        "perhaps",
        "deserved",
        "harm",
        "intrinsically",
        "bad",
        "harm",
        "indeed",
        "bad",
        "cause",
        "must",
        "therefore",
        "justified",
        "positive",
        "reason",
        "count",
        "favoursuch",
        "good",
        "achieved",
        "evil",
        "averted",
        "lazar",
        "a",
        "necessity",
        "proportionality",
        "constraint",
        "involve",
        "comparing",
        "bad",
        "caused",
        "action",
        "good",
        "achieves",
        "differ",
        "kind",
        "option",
        "compare",
        "use",
        "force",
        "proportionate",
        "harm",
        "done",
        "counterbalanced",
        "good",
        "achieved",
        "averting",
        "threat",
        "determine",
        "typically",
        "compare",
        "candidate",
        "course",
        "action",
        "would",
        "happen",
        "allowed",
        "threat",
        "eventuate",
        "course",
        "case",
        "one",
        "mean",
        "averting",
        "mitigating",
        "threat",
        "harmful",
        "option",
        "permissible",
        "harm",
        "involves",
        "justified",
        "corresponding",
        "good",
        "achieved",
        "alternative",
        "would",
        "successfully",
        "avert",
        "threat",
        "cause",
        "le",
        "harm",
        "harmful",
        "option",
        "impermissible",
        "involves",
        "unnecessary",
        "harm",
        "option",
        "aim",
        "avert",
        "threat",
        "determine",
        "necessity",
        "comparing",
        "option",
        "either",
        "mitigate",
        "avert",
        "t",
        "determine",
        "proportionality",
        "comparing",
        "harm",
        "suffered",
        "come",
        "difference",
        "proportionality",
        "necessity",
        "constraint",
        "former",
        "involves",
        "comparing",
        "one",
        "action",
        "specific",
        "counterfactual",
        "scenarioin",
        "act",
        "avert",
        "threatwhile",
        "latter",
        "involves",
        "comparing",
        "available",
        "option",
        "prospect",
        "averting",
        "mitigating",
        "threat",
        "view",
        "simply",
        "expand",
        "necessity",
        "constraint",
        "compare",
        "available",
        "option",
        "bar",
        "none",
        "proportionality",
        "would",
        "essentially",
        "involve",
        "comparing",
        "option",
        "alternative",
        "nothing",
        "necessity",
        "would",
        "involve",
        "comparing",
        "option",
        "including",
        "nothing",
        "term",
        "respective",
        "balance",
        "good",
        "bad",
        "approach",
        "necessity",
        "would",
        "subsume",
        "proportionality",
        "technical",
        "point",
        "little",
        "substantive",
        "payoff",
        "substantively",
        "necessity",
        "proportionality",
        "judgement",
        "concern",
        "consequence",
        "yet",
        "typically",
        "made",
        "ex",
        "ante",
        "know",
        "result",
        "action",
        "must",
        "therefore",
        "modified",
        "take",
        "uncertainty",
        "account",
        "obvious",
        "solution",
        "simply",
        "refer",
        "expected",
        "threat",
        "expected",
        "harm",
        "expected",
        "harm",
        "option",
        "probabilityweighted",
        "average",
        "harm",
        "might",
        "result",
        "take",
        "expected",
        "threat",
        "probabilityweighted",
        "average",
        "consequence",
        "nothing",
        "prevent",
        "threatallowing",
        "possibility",
        "threat",
        "might",
        "eventuate",
        "lazar",
        "b",
        "would",
        "also",
        "factor",
        "option",
        "probability",
        "averting",
        "threat",
        "simple",
        "move",
        "obscures",
        "number",
        "important",
        "undertheorised",
        "issue",
        "discus",
        "detail",
        "must",
        "simply",
        "note",
        "proportionality",
        "necessity",
        "must",
        "appropriately",
        "indexed",
        "agent",
        "uncertainty",
        "necessity",
        "proportionality",
        "judgement",
        "involve",
        "weighing",
        "harm",
        "inflicted",
        "threat",
        "averted",
        "indeed",
        "relevant",
        "good",
        "bad",
        "simplest",
        "way",
        "proceed",
        "would",
        "aggregate",
        "harm",
        "individual",
        "people",
        "side",
        "call",
        "act",
        "proportionate",
        "case",
        "averts",
        "harm",
        "cause",
        "necessary",
        "case",
        "alternative",
        "involves",
        "le",
        "harm",
        "deontologists",
        "indeed",
        "nonphilosophers",
        "think",
        "naively",
        "aggregative",
        "way",
        "instead",
        "weight",
        "harm",
        "etc",
        "according",
        "factor",
        "whether",
        "agent",
        "directly",
        "responsible",
        "whether",
        "intended",
        "merely",
        "foreseen",
        "many",
        "also",
        "think",
        "perhaps",
        "even",
        "must",
        "give",
        "greater",
        "importance",
        "deliberation",
        "loved",
        "one",
        "example",
        "tied",
        "u",
        "common",
        "bond",
        "humanity",
        "hurka",
        "lazar",
        "criticism",
        "see",
        "lefkowitz",
        "similarly",
        "might",
        "justifiably",
        "prioritise",
        "defending",
        "state",
        "sovereignty",
        "territorial",
        "integrity",
        "even",
        "would",
        "impartially",
        "best",
        "factor",
        "many",
        "discussed",
        "taken",
        "consideration",
        "form",
        "defensible",
        "conclusion",
        "option",
        "necessary",
        "proportionate",
        "element",
        "ethic",
        "war",
        "contribute",
        "evaluation",
        "proportionality",
        "necessity",
        "one",
        "three",
        "way",
        "identifying",
        "positive",
        "reason",
        "favour",
        "fighting",
        "delineating",
        "negative",
        "reason",
        "fighting",
        "stagingposts",
        "way",
        "judgement",
        "necessity",
        "proportionality",
        "given",
        "gravity",
        "decision",
        "go",
        "war",
        "serious",
        "threat",
        "give",
        "u",
        "cause",
        "fight",
        "cause",
        "satisfied",
        "weighty",
        "positive",
        "reason",
        "fight",
        "lacking",
        "cause",
        "aggravate",
        "badness",
        "fighting",
        "make",
        "le",
        "likely",
        "people",
        "killed",
        "pursuing",
        "one",
        "war",
        "aim",
        "liable",
        "killed",
        "see",
        "mcmahan",
        "a",
        "make",
        "killing",
        "hard",
        "justify",
        "even",
        "cause",
        "strictly",
        "speaking",
        "necessary",
        "condition",
        "warfare",
        "permissible",
        "absence",
        "cause",
        "make",
        "difficult",
        "war",
        "satisfy",
        "proportionality",
        "legitimate",
        "authority",
        "satisfied",
        "additional",
        "positive",
        "reason",
        "count",
        "favour",
        "fighting",
        "see",
        "satisfied",
        "add",
        "additional",
        "reason",
        "fighting",
        "must",
        "overcome",
        "fighting",
        "proportionate",
        "reasonable",
        "prospect",
        "success",
        "criterion",
        "surmountable",
        "hurdle",
        "way",
        "proportionality",
        "typically",
        "war",
        "lack",
        "reasonable",
        "prospect",
        "success",
        "disproportionate",
        "since",
        "war",
        "always",
        "involve",
        "causing",
        "significant",
        "harm",
        "harm",
        "likely",
        "pointless",
        "unlikely",
        "justified",
        "course",
        "sometimes",
        "one",
        "likelihood",
        "victory",
        "low",
        "yet",
        "fighting",
        "still",
        "best",
        "available",
        "option",
        "necessary",
        "proportionate",
        "reasonable",
        "prospect",
        "success",
        "matter",
        "reason",
        "necessity",
        "proportionality",
        "matter",
        "necessity",
        "proportionality",
        "satisfied",
        "reasonable",
        "prospect",
        "success",
        "standard",
        "irrelevant",
        "right",
        "intention",
        "may",
        "also",
        "irrelevant",
        "insofar",
        "matter",
        "absence",
        "would",
        "reason",
        "fighting",
        "right",
        "intention",
        "give",
        "positive",
        "reason",
        "fight",
        "lastly",
        "discrimination",
        "crucial",
        "establishing",
        "proportionality",
        "necessity",
        "tell",
        "u",
        "weigh",
        "life",
        "taken",
        "war"
    ]
}