{
    "main_text": "Work in the foundations and philosophy of mathematics || Das Kontinuum\n3.1 Das Kontinuum\n\n\nAnother mathematical “possible” to which Weyl gave a \ngreat deal of thought is the continuum. During the period \n1918–1921 he wrestled with the problem of providing the \nmathematical continuum—the real number line—with a \nlogically sound formulation. Weyl had become increasingly critical of\nthe principles underlying the set-theoretic construction of the \nmathematical continuum. He had come to believe that the whole \nset-theoretical approach involved vicious \n circles[11]\n to such an extent that, as he says, “every cell (so to speak) \nof this mighty organism is permeated by contradiction.” In \nDas Kontinuum he tries to overcome this by providing \nanalysis with a predicative formulation—not, as \nRussell and Whitehead had attempted, by introducing a hierarchy of \nlogically ramified types, which Weyl seems to have regarded as \nexcessively complicated—but rather by confining the \ncomprehension principle to formulas whose bound variables range over \njust the initial given entities (numbers). Accordingly he restricts \nanalysis to what can be done in terms of natural numbers with the aid\nof three basic logical operations, together with the operation of \nsubstitution and the process of “iteration”, i.e., \nprimitive recursion. Weyl recognized that the effect of this \nrestriction would be to render unprovable many of the central results\nof classical analysis—e.g., Dirichlet’s principle that any \nbounded set of real numbers has a least upper \n bound[12]—but\n he was prepared to accept this as part of the price that must be paid\nfor the security of mathematics.\n\n\nAs Weyl saw it, there is an unbridgeable gap between intuitively \ngiven continua (e.g. those of space, time and motion) on the one \nhand, and the “discrete” exact concepts of mathematics \n(e.g. that of natural \n number[13])\n on the other. The presence of this chasm meant that the construction \nof the mathematical continuum could not simply be “read \noff” from intuition. It followed, in Weyl’s view, that the \nmathematical continuum must be treated as if it were an element of \nthe transcendent realm, and so, in the end, justified in the same way\nas a physical theory. It was not enough that the mathematical theory \nbe consistent; it must also be reasonable. \n\nDas Kontinuum embodies Weyl’s attempt at formulating a \ntheory of the continuum which satisfies the first, and, as far as \npossible, the second, of these requirements. In the following \npassages from this work he acknowledges the difficulty of the task:\n\n\n\n… the conceptual world of mathematics is so foreign to what \nthe intuitive continuum presents to us that the demand for \ncoincidence between the two must be dismissed as absurd. (Weyl 1987, \n108)\n\n\n… the continuity given to us immediately by intuition (in the \nflow of time and of motion) has yet to be grasped mathematically as a\ntotality of discrete “stages” in accordance with that \npart of its content which can be conceptualized in an exact way. \n(Ibid., \n 24)[14]\n\n\n\nExact time- or space-points are not the ultimate, underlying atomic \nelements of the duration or extension given to us in experience. On \nthe contrary, only reason, which thoroughly penetrates what is \nexperientially given, is able to grasp these exact ideas. And only in\nthe arithmetico- analytic concept of the real number belonging to the\npurely formal sphere do these ideas crystallize into full \ndefiniteness. (Ibid., 94)\n\n\nWhen our experience has turned into a real process in a real world \nand our phenomenal time has spread itself out over this world and \nassumed a cosmic dimension, we are not satisfied with replacing the \ncontinuum by the exact concept of the real number, in spite of the \nessential and undeniable inexactness arising from what is given. \n(Ibid., 93) \n\n\n\nAs these quotations show, Weyl had come to accept that it was in \nprinciple impossible to furnish the continuum as presented to \nintuition with an exact mathematical formulation : so, with \nreluctance, he lowered his sights. In Das Kontinuum his goal\nwas, first and foremost, to establish the consistency of the\nmathematical theory of the continuum by putting the \narithmetical notion of real number on a firm logical basis. \nOnce this had been achieved, he would then proceed to show that this \ntheory is reasonable by employing it as the foundation for a\nplausible account of continuous process in the objective physical \n world.[15]\n\n\n\nIn §6 of Das Kontinuum Weyl presents his conclusions as\nto the relationship between the intuitive and mathematical \ncontinua. He poses the question: Does the mathematical \nframework he has erected provide an adequate representation of \nphysical or temporal continuity as it is actually \nexperienced? In posing this question we can see the continuing \ninfluence of Husserl and phenomenological doctrine. Weyl begins his \ninvestigation by noting that, according to his theory, if one asks \nwhether a given function is continuous, the answer is not fixed once \nand for all, but is, rather, dependent on the extent of the domain of\nreal numbers which have been defined up to the point at which the \nquestion is posed. Thus the continuity of a function must always \nremain provisional; the possibility always exists that a \nfunction deemed continuous now may, with the emergence of \n“new” real numbers, turn out to be discontinuous in \nthe future. \n [16]\n\n\n\nTo reveal the discrepancy between this formal account of continuity \nbased on real numbers and the properties of an intuitively given \ncontinuum, Weyl next considers the experience of seeing a pencil \nlying on a table before him throughout a certain time interval. The \nposition of the pencil during this interval may be taken as a \nfunction of the time, and Weyl takes it as a fact of observation that\nduring the time interval in question this function is continuous and \nthat its values fall within a definite range. And so, he says,\n\nThis observation entitles me to assert that during a certain period\nthis pencil was on the table; and even if my right to do so is not\nabsolute, it is nevertheless reasonable and well-grounded. It is\nobviously absurd to suppose that this right can be undermined by\n“an expansion of our principles of definition”—as if\nnew moments of time, overlooked by my intuition could be added to this\ninterval, moments in which the pencil was, perhaps, in the vicinity of\nSirius or who knows where. If the temporal continuum can be\nrepresented by a variable which “ranges over” the real\nnumbers, then it appears to be determined thereby how narrowly or\nwidely we must understand the concept “real number” and\nthe decision about this must not be entrusted to logical deliberations\nover principles of definition and the like. (Weyl 1987, 88)\n\n\nTo drive the point home, Weyl focuses attention on the fundamental \ncontinuum of immediately given phenomenal time, that is, as \nhe characterizes it,\n\n… to that constant form of my experiences of consciousness by\nvirtue of which they appear to me to flow by successively. (By\n“experiences” I mean what I experience, exactly as I\nexperience it. I do not mean real psychical or even physical processes\nwhich occur in a definite psychic-somatic individual, belong to a real\nworld, and, perhaps, correspond to the direct experiences.)\n(Ibid., 88)\n\n\nIn order to correlate mathematical concepts with phenomenal time in \nthis sense Weyl grants the possibility of introducing a rigidly \npunctate “now” and of identifying and exhibiting the \nresulting temporal points. On the collection of these temporal points\nis defined the relation of earlier than as well as a \ncongruence relation of equality of temporal intervals, the \nbasic constituents of a simple mathematical theory of time. Now Weyl \nobserves that the discrepancy between phenomenal time and the concept\nof real number would vanish if the following pair of conditions could\nbe shown to be satisfied:\n\nThe immediate expression of the intuitive finding that during\na certain period I saw the pencil lying there were construed in such a\nway that the phrase “during a certain period” was replaced\nby “in every temporal point which falls within a certain time\nspan OE”. [Weyl goes on to say parenthetically here that he admits\n“that this no longer reproduces what is intuitively present, but\none will have to let it pass, if it is really legitimate to\ndissolve a period into temporal points.”)\nIf \\(P\\) is a temporal point, then the domain of rational\nnumbers to which \\(l\\) belongs if and only if there is a time\npoint \\(L\\) earlier than \\(P\\) such that\n\n\\[\nOL = l{.}OE\n\\]\n\n\n\ncan be constructed arithmetically in pure number theory on the basis \nof our principles of definition, and is therefore a real number in \nour sense. (Ibid., 89)\n\n\n\n\nCondition 2 means that, if we take the time span \\(OE\\) as a \nunit, then each temporal point \\(P\\) is correlated with a \ndefinite real number. In an addendum Weyl also stipulates the \nconverse.\n\n\nBut can temporal intuition itself provide evidence for the truth or \nfalsity of these two conditions? Weyl thinks not. In fact, he states \nquite categorically that\n\n… everything we are demanding here is obvious nonsense: to\nthese questions, the intuition of time provides no answer—just\nas a man makes no reply to questions which clearly are addressed to\nhim by mistake and, therefore, are unintelligible when addressed to\nhim. (Ibid., 90)\n\n\nThe grounds for this assertion are by no means immediately evident, \nbut one gathers from the passages following it that Weyl regards the \nexperienced continuous flow of phenomenal time as \nconstituting an insuperable barrier to the whole enterprise of \nrepresenting the continuum as experienced in terms of individual \npoints, and even to the characterization of “individual \ntemporal point” itself. As he says,\nThe view of a flow consisting of points and, therefore,\nalso dissolving into points turns out to be mistaken: precisely what\neludes us is the nature of the continuity, the flowing from point to\npoint; in other words, the secret of how the continually enduring\npresent can continually slip away into the receding past. Each one of\nus, at every moment, directly experiences the true character of this\ntemporal continuity. But, because of the genuine primitiveness of\nphenomenal time, we cannot put our experiences into words. So we shall\ncontent ourselves with the following description. What I am conscious\nof is for me both a being-now and, in its essence, something which,\nwith its temporal position, slips away. In this way there arises the\npersisting factual extent, something ever new which endures and changes\nin consciousness. (Ibid., 91–92)\n\n\nWeyl sums up what he thinks can be affirmed about “objectively \npresented time”—by which he presumably means \n“phenomenal time described in an objective \nmanner”—in the following two assertions, which he claims \napply equally, mutatis mutandis, to every intuitively given \ncontinuum, in particular, to the continuum of spatial extension. \n(Ibid., 92):\n\nAn individual point in it is non-independent, i.e., is pure\nnothingness when taken by itself, and exists only as a “point of\ntransition” (which, of course, can in no way be understood\nmathematically);\nIt is due to the essence of time (and not to contingent\nimperfections in our medium) that a fixed temporal point cannot be\nexhibited in any way, that always only an approximate, never an exact\ndetermination is possible. \n\n\n\nThe fact that single points in a true continuum “cannot be \nexhibited” arises, Weyl asserts, from the fact that they are \nnot genuine individuals and so cannot be characterized by their \nproperties. In the physical world they are never defined absolutely, \nbut only in terms of a coordinate system, which, in an arresting \nmetaphor, Weyl describes as “the unavoidable residue of the \neradication of the ego.” This metaphor, which Weyl was to \nemploy more than \n once[17],\n again reflects the continuing influence of phenomenological doctrine \nin his thinking : here, the thesis that the existent is given in the \nfirst instance as the contents of a consciousness.\n",
    "section_title": "3.1 Das Kontinuum",
    "entry_title": "Hermann Weyl",
    "hierarchy_title": "Hermann Weyl || Work in the foundations and philosophy of mathematics || Das Kontinuum",
    "tokenized_text": [
        "work",
        "foundation",
        "philosophy",
        "mathematics",
        "da",
        "kontinuum",
        "da",
        "kontinuum",
        "another",
        "mathematical",
        "possible",
        "weyl",
        "gave",
        "great",
        "deal",
        "thought",
        "continuum",
        "period",
        "wrestled",
        "problem",
        "providing",
        "mathematical",
        "continuumthe",
        "real",
        "number",
        "linewith",
        "logically",
        "sound",
        "formulation",
        "weyl",
        "become",
        "increasingly",
        "critical",
        "principle",
        "underlying",
        "settheoretic",
        "construction",
        "mathematical",
        "continuum",
        "come",
        "believe",
        "whole",
        "settheoretical",
        "approach",
        "involved",
        "vicious",
        "circle",
        "extent",
        "say",
        "every",
        "cell",
        "speak",
        "mighty",
        "organism",
        "permeated",
        "contradiction",
        "da",
        "kontinuum",
        "try",
        "overcome",
        "providing",
        "analysis",
        "predicative",
        "formulationnot",
        "russell",
        "whitehead",
        "attempted",
        "introducing",
        "hierarchy",
        "logically",
        "ramified",
        "type",
        "weyl",
        "seems",
        "regarded",
        "excessively",
        "complicatedbut",
        "rather",
        "confining",
        "comprehension",
        "principle",
        "formula",
        "whose",
        "bound",
        "variable",
        "range",
        "initial",
        "given",
        "entity",
        "number",
        "accordingly",
        "restricts",
        "analysis",
        "done",
        "term",
        "natural",
        "number",
        "aid",
        "three",
        "basic",
        "logical",
        "operation",
        "together",
        "operation",
        "substitution",
        "process",
        "iteration",
        "ie",
        "primitive",
        "recursion",
        "weyl",
        "recognized",
        "effect",
        "restriction",
        "would",
        "render",
        "unprovable",
        "many",
        "central",
        "result",
        "classical",
        "analysiseg",
        "dirichlet",
        "principle",
        "bounded",
        "set",
        "real",
        "number",
        "least",
        "upper",
        "bound",
        "but",
        "prepared",
        "accept",
        "part",
        "price",
        "must",
        "paid",
        "security",
        "mathematics",
        "weyl",
        "saw",
        "unbridgeable",
        "gap",
        "intuitively",
        "given",
        "continuum",
        "eg",
        "space",
        "time",
        "motion",
        "one",
        "hand",
        "discrete",
        "exact",
        "concept",
        "mathematics",
        "eg",
        "natural",
        "number",
        "presence",
        "chasm",
        "meant",
        "construction",
        "mathematical",
        "continuum",
        "could",
        "simply",
        "read",
        "intuition",
        "followed",
        "weyl",
        "view",
        "mathematical",
        "continuum",
        "must",
        "treated",
        "element",
        "transcendent",
        "realm",
        "end",
        "justified",
        "way",
        "physical",
        "theory",
        "enough",
        "mathematical",
        "theory",
        "consistent",
        "must",
        "also",
        "reasonable",
        "da",
        "kontinuum",
        "embodies",
        "weyl",
        "attempt",
        "formulating",
        "theory",
        "continuum",
        "satisfies",
        "first",
        "far",
        "possible",
        "second",
        "requirement",
        "following",
        "passage",
        "work",
        "acknowledges",
        "difficulty",
        "task",
        "conceptual",
        "world",
        "mathematics",
        "foreign",
        "intuitive",
        "continuum",
        "present",
        "u",
        "demand",
        "coincidence",
        "two",
        "must",
        "dismissed",
        "absurd",
        "weyl",
        "continuity",
        "given",
        "u",
        "immediately",
        "intuition",
        "flow",
        "time",
        "motion",
        "yet",
        "grasped",
        "mathematically",
        "totality",
        "discrete",
        "stage",
        "accordance",
        "part",
        "content",
        "conceptualized",
        "exact",
        "way",
        "ibid",
        "exact",
        "time",
        "spacepoints",
        "ultimate",
        "underlying",
        "atomic",
        "element",
        "duration",
        "extension",
        "given",
        "u",
        "experience",
        "contrary",
        "reason",
        "thoroughly",
        "penetrates",
        "experientially",
        "given",
        "able",
        "grasp",
        "exact",
        "idea",
        "arithmetico",
        "analytic",
        "concept",
        "real",
        "number",
        "belonging",
        "purely",
        "formal",
        "sphere",
        "idea",
        "crystallize",
        "full",
        "definiteness",
        "ibid",
        "experience",
        "turned",
        "real",
        "process",
        "real",
        "world",
        "phenomenal",
        "time",
        "spread",
        "world",
        "assumed",
        "cosmic",
        "dimension",
        "satisfied",
        "replacing",
        "continuum",
        "exact",
        "concept",
        "real",
        "number",
        "spite",
        "essential",
        "undeniable",
        "inexactness",
        "arising",
        "given",
        "ibid",
        "quotation",
        "show",
        "weyl",
        "come",
        "accept",
        "principle",
        "impossible",
        "furnish",
        "continuum",
        "presented",
        "intuition",
        "exact",
        "mathematical",
        "formulation",
        "reluctance",
        "lowered",
        "sight",
        "da",
        "kontinuum",
        "goal",
        "first",
        "foremost",
        "establish",
        "consistency",
        "mathematical",
        "theory",
        "continuum",
        "putting",
        "arithmetical",
        "notion",
        "real",
        "number",
        "firm",
        "logical",
        "basis",
        "achieved",
        "would",
        "proceed",
        "show",
        "theory",
        "reasonable",
        "employing",
        "foundation",
        "plausible",
        "account",
        "continuous",
        "process",
        "objective",
        "physical",
        "world",
        "da",
        "kontinuum",
        "weyl",
        "present",
        "conclusion",
        "relationship",
        "intuitive",
        "mathematical",
        "continuum",
        "pose",
        "question",
        "mathematical",
        "framework",
        "erected",
        "provide",
        "adequate",
        "representation",
        "physical",
        "temporal",
        "continuity",
        "actually",
        "experienced",
        "posing",
        "question",
        "see",
        "continuing",
        "influence",
        "husserl",
        "phenomenological",
        "doctrine",
        "weyl",
        "begin",
        "investigation",
        "noting",
        "according",
        "theory",
        "one",
        "asks",
        "whether",
        "given",
        "function",
        "continuous",
        "answer",
        "fixed",
        "rather",
        "dependent",
        "extent",
        "domain",
        "real",
        "number",
        "defined",
        "point",
        "question",
        "posed",
        "thus",
        "continuity",
        "function",
        "must",
        "always",
        "remain",
        "provisional",
        "possibility",
        "always",
        "exists",
        "function",
        "deemed",
        "continuous",
        "may",
        "emergence",
        "new",
        "real",
        "number",
        "turn",
        "discontinuous",
        "future",
        "reveal",
        "discrepancy",
        "formal",
        "account",
        "continuity",
        "based",
        "real",
        "number",
        "property",
        "intuitively",
        "given",
        "continuum",
        "weyl",
        "next",
        "considers",
        "experience",
        "seeing",
        "pencil",
        "lying",
        "table",
        "throughout",
        "certain",
        "time",
        "interval",
        "position",
        "pencil",
        "interval",
        "may",
        "taken",
        "function",
        "time",
        "weyl",
        "take",
        "fact",
        "observation",
        "time",
        "interval",
        "question",
        "function",
        "continuous",
        "value",
        "fall",
        "within",
        "definite",
        "range",
        "say",
        "observation",
        "entitles",
        "assert",
        "certain",
        "period",
        "pencil",
        "table",
        "even",
        "right",
        "absolute",
        "nevertheless",
        "reasonable",
        "wellgrounded",
        "obviously",
        "absurd",
        "suppose",
        "right",
        "undermined",
        "expansion",
        "principle",
        "definition",
        "as",
        "new",
        "moment",
        "time",
        "overlooked",
        "intuition",
        "could",
        "added",
        "interval",
        "moment",
        "pencil",
        "perhaps",
        "vicinity",
        "sirius",
        "know",
        "temporal",
        "continuum",
        "represented",
        "variable",
        "range",
        "real",
        "number",
        "appears",
        "determined",
        "thereby",
        "narrowly",
        "widely",
        "must",
        "understand",
        "concept",
        "real",
        "number",
        "decision",
        "must",
        "entrusted",
        "logical",
        "deliberation",
        "principle",
        "definition",
        "like",
        "weyl",
        "drive",
        "point",
        "home",
        "weyl",
        "focus",
        "attention",
        "fundamental",
        "continuum",
        "immediately",
        "given",
        "phenomenal",
        "time",
        "characterizes",
        "constant",
        "form",
        "experience",
        "consciousness",
        "virtue",
        "appear",
        "flow",
        "successively",
        "experience",
        "mean",
        "experience",
        "exactly",
        "experience",
        "mean",
        "real",
        "psychical",
        "even",
        "physical",
        "process",
        "occur",
        "definite",
        "psychicsomatic",
        "individual",
        "belong",
        "real",
        "world",
        "perhaps",
        "correspond",
        "direct",
        "experience",
        "ibid",
        "order",
        "correlate",
        "mathematical",
        "concept",
        "phenomenal",
        "time",
        "sense",
        "weyl",
        "grant",
        "possibility",
        "introducing",
        "rigidly",
        "punctate",
        "identifying",
        "exhibiting",
        "resulting",
        "temporal",
        "point",
        "collection",
        "temporal",
        "point",
        "defined",
        "relation",
        "earlier",
        "well",
        "congruence",
        "relation",
        "equality",
        "temporal",
        "interval",
        "basic",
        "constituent",
        "simple",
        "mathematical",
        "theory",
        "time",
        "weyl",
        "observes",
        "discrepancy",
        "phenomenal",
        "time",
        "concept",
        "real",
        "number",
        "would",
        "vanish",
        "following",
        "pair",
        "condition",
        "could",
        "shown",
        "satisfied",
        "immediate",
        "expression",
        "intuitive",
        "finding",
        "certain",
        "period",
        "saw",
        "pencil",
        "lying",
        "construed",
        "way",
        "phrase",
        "certain",
        "period",
        "replaced",
        "every",
        "temporal",
        "point",
        "fall",
        "within",
        "certain",
        "time",
        "span",
        "oe",
        "weyl",
        "go",
        "say",
        "parenthetically",
        "admits",
        "longer",
        "reproduces",
        "intuitively",
        "present",
        "one",
        "let",
        "pas",
        "really",
        "legitimate",
        "dissolve",
        "period",
        "temporal",
        "points",
        "p",
        "temporal",
        "point",
        "domain",
        "rational",
        "number",
        "l",
        "belongs",
        "time",
        "point",
        "l",
        "earlier",
        "p",
        "ol",
        "l",
        "oe",
        "constructed",
        "arithmetically",
        "pure",
        "number",
        "theory",
        "basis",
        "principle",
        "definition",
        "therefore",
        "real",
        "number",
        "sense",
        "ibid",
        "condition",
        "mean",
        "take",
        "time",
        "span",
        "oe",
        "unit",
        "temporal",
        "point",
        "p",
        "correlated",
        "definite",
        "real",
        "number",
        "addendum",
        "weyl",
        "also",
        "stipulates",
        "converse",
        "temporal",
        "intuition",
        "provide",
        "evidence",
        "truth",
        "falsity",
        "two",
        "condition",
        "weyl",
        "think",
        "fact",
        "state",
        "quite",
        "categorically",
        "everything",
        "demanding",
        "obvious",
        "nonsense",
        "question",
        "intuition",
        "time",
        "provides",
        "answerjust",
        "man",
        "make",
        "reply",
        "question",
        "clearly",
        "addressed",
        "mistake",
        "therefore",
        "unintelligible",
        "addressed",
        "ibid",
        "ground",
        "assertion",
        "mean",
        "immediately",
        "evident",
        "one",
        "gather",
        "passage",
        "following",
        "weyl",
        "regard",
        "experienced",
        "continuous",
        "flow",
        "phenomenal",
        "time",
        "constituting",
        "insuperable",
        "barrier",
        "whole",
        "enterprise",
        "representing",
        "continuum",
        "experienced",
        "term",
        "individual",
        "point",
        "even",
        "characterization",
        "individual",
        "temporal",
        "point",
        "say",
        "view",
        "flow",
        "consisting",
        "point",
        "therefore",
        "also",
        "dissolving",
        "point",
        "turn",
        "mistaken",
        "precisely",
        "eludes",
        "u",
        "nature",
        "continuity",
        "flowing",
        "point",
        "point",
        "word",
        "secret",
        "continually",
        "enduring",
        "present",
        "continually",
        "slip",
        "away",
        "receding",
        "past",
        "one",
        "u",
        "every",
        "moment",
        "directly",
        "experience",
        "true",
        "character",
        "temporal",
        "continuity",
        "genuine",
        "primitiveness",
        "phenomenal",
        "time",
        "put",
        "experience",
        "word",
        "shall",
        "content",
        "following",
        "description",
        "conscious",
        "beingnow",
        "essence",
        "something",
        "temporal",
        "position",
        "slip",
        "away",
        "way",
        "arises",
        "persisting",
        "factual",
        "extent",
        "something",
        "ever",
        "new",
        "endures",
        "change",
        "consciousness",
        "ibid",
        "weyl",
        "sum",
        "think",
        "affirmed",
        "objectively",
        "presented",
        "time",
        "by",
        "presumably",
        "mean",
        "phenomenal",
        "time",
        "described",
        "objective",
        "manner",
        "in",
        "following",
        "two",
        "assertion",
        "claim",
        "apply",
        "equally",
        "mutatis",
        "mutandis",
        "every",
        "intuitively",
        "given",
        "continuum",
        "particular",
        "continuum",
        "spatial",
        "extension",
        "ibid",
        "individual",
        "point",
        "nonindependent",
        "ie",
        "pure",
        "nothingness",
        "taken",
        "exists",
        "point",
        "transition",
        "course",
        "way",
        "understood",
        "mathematically",
        "due",
        "essence",
        "time",
        "contingent",
        "imperfection",
        "medium",
        "fixed",
        "temporal",
        "point",
        "exhibited",
        "way",
        "always",
        "approximate",
        "never",
        "exact",
        "determination",
        "possible",
        "fact",
        "single",
        "point",
        "true",
        "continuum",
        "exhibited",
        "arises",
        "weyl",
        "asserts",
        "fact",
        "genuine",
        "individual",
        "characterized",
        "property",
        "physical",
        "world",
        "never",
        "defined",
        "absolutely",
        "term",
        "coordinate",
        "system",
        "arresting",
        "metaphor",
        "weyl",
        "describes",
        "unavoidable",
        "residue",
        "eradication",
        "ego",
        "metaphor",
        "weyl",
        "employ",
        "reflects",
        "continuing",
        "influence",
        "phenomenological",
        "doctrine",
        "thinking",
        "thesis",
        "existent",
        "given",
        "first",
        "instance",
        "content",
        "consciousness"
    ]
}