{
    "main_text": "Philosophy of Education\n5. Philosophy of Education\n\nWhile in London, Whitehead became involved in many practical aspects\nof tertiary education, serving as President of the Mathematical\nAssociation, Dean of the Faculty of Science and Chairman of the\nAcademic Council of the Senate at the University of London, Chairman\nof the Delegacy for Goldsmiths’ College, and several other\nadministrative posts. Many of his essays about education date from\nthis time and appear in his book, The Aims of Education and Other\nEssays (1929a).\n\nAt its core, Whitehead’s philosophy of education emphasizes the\nidea that a good life is most profitably thought of as an educated or\ncivilized life, two terms which Whitehead often uses interchangeably.\nAs we think, we live. Thus it is only as we improve our thoughts that\nwe improve our lives. The result, says Whitehead, is that “There\nis only one subject matter for education, and that is Life in all its\nmanifestations” (1929a: 10). This view in turn has corollaries\nfor both the content of education and its method of delivery.\n\n(a) With regard to delivery, Whitehead emphasizes the importance of\nremembering that a “pupil’s mind is a growing organism\n… it is not a box to be ruthlessly packed with alien\nideas” (1929a: 47). Instead, it is the purpose of education to\nstimulate and guide each student’s self-development. It is not\nthe job of the educator simply to insert into his students’\nminds little chunks of knowledge.\n\nWhitehead conceives of the student’s educational process of\nself-development as an organic and cyclic process in which each cycle\nconsists of three stages: first the stage of romance, then the stage\nof precision, and finally, the stage of generalization. The first\nstage is all about “free exploration, initiated by\nwonder”, the second about the disciplined “acquirement of\ntechnique and detailed knowledge”, and the third about\n“the free application of what has been learned” (Lowe\n1990: 61). These stages, continually recurring in cycles, determine\nwhat Whitehead calls “The Rhythm of Education” (cf. 1929a:\n24–44). In the context of mathematics, Whitehead’s three\nstages can be conceived of as the stage of undisciplined intuition,\nthe stage of logical reasoning, and the stage of logically guided\nintuition. By skipping stage one, and never arriving at stage three,\nbad math teachers deny students the major motivation to love\nmathematics: the joy of pattern recognition.\n\nThat education does not involve inserting into the student’s\nmind little chunks of knowledge is clear from the description of\nculture that Whitehead offers as the opening of the first and title\nessay of The Aims of Education:\n\n\nCulture is activity of thought, and receptiveness of beauty and humane\nfeeling. Scraps of information have nothing to do with it. (1929a:\n1)\n\n\nOn the contrary, Whitehead writes,\n\n\nwe must beware of what I call ‘inert ideas’—that is\nto say, ideas that are merely received into the mind without being\nutilized, or tested, or thrown into fresh combinations, (1929a:\n1–2)\n\n\nand he holds that “education is the acquisition of the art of\nthe [interconnection and] utilization of knowledge” (1929a: 6),\nand that ideas remain disconnected and non-utilized unless they are\nrelated\n\n\nto that stream, compounded of sense perceptions, feelings, hopes,\ndesires, and of mental activities adjusting thought to thought, which\nforms our life. (1929a: 4)\n\n\nThis point—the point where Whitehead links the art of education\nto the stream of experience that forms our life—is the meeting\npoint of Whitehead’s philosophy of education with his philosophy\nof experience, which is also called: ‘process\nphilosophy.’\n\nAccording to Whitehead’s process philosophy, the stream of\nexperience that forms our life consists of occasions of experience,\neach of which is a synthesis of many feelings having objective content\n(what is felt) and subjective form (how it is felt); also, the\nsynthesis of feelings is not primarily controlled by their objective\ncontent, but by their subjective form. According to Whitehead’s\nphilosophy of education, the attempt to educate a person by merely\nfocusing on objective content—on inert ideas, scraps of\ninformation, bare knowledge—while disregarding the subjective\nform or emotional pattern of that person’s experience can never\nbe successful. The art of education has to take into account the\nsubjective receptiveness and appreciation of beauty and human\ngreatness, the subjective emotions of interest, joy and adventure, and\n“the ultimate motive power” (1929a: 62), that is, the\nsense of importance, values and possibilities (cf.1929a:\n45–65).\n\n(b) With regard to content, Whitehead holds that any adequate\neducation must include a literary component, a scientific component,\nand a technical component.\n\nAccording to Whitehead:\n\n\nAny serious fundamental change in the intellectual outlook of human\nsociety must necessarily be followed by an educational revolution.\n(1929a: 116)\n\n\nIn particular, the scientific revolution and the fundamental changes\nit entailed in the seventeenth and subsequent centuries have been\nfollowed by an educational revolution that was still ongoing in the\ntwentieth century. In 1912, Whitehead wrote:\n\n\nWe are, in fact, in the midst of an educational revolution caused by\nthe dying away of the classical impulse which has dominated European\nthought since the time of the Renaissance. … What I mean is the\nloss of that sustained reference to classical literature for the sake\nof finding in it the expression of our best thoughts on all subjects.\n… There are three fundamental changes … Science now\nenters into the very texture of our thoughts … Again,\nmechanical inventions, which are the product of science, by altering\nthe material possibilities of life, have transformed our industrial\nsystem, and thus have changed the very structure of Society. Finally,\nthe idea of the World now means to us the whole round world of human\naffairs, from the revolutions of China to those of Peru. … The\ntotal result of these changes is that the supreme merit of immediate\nrelevance to the full compass of modern life has been lost to\nclassical literature. (1947 [1968: 175–176])\n\n\nWhitehead listed the scientific and industrial revolutions as well as\nglobalization as the major causes for the educational reforms of the\nnineteenth and twentieth century. These fundamental changes indeed\nimplied new standards for what counts as genuine knowledge. However,\ntogether with these new standards emerged a romantic anxiety—the\nanxiety that the new standards of genuine knowledge, education, and\nliving might impoverish human experience and damage both individual\nand social wellbeing. Hence arose the bifurcation of culture into the\nculture of “natural scientists” and the culture of\n“literary intellectuals” (cf. Snow 1959), and the many\nassociated debates in the context of various educational\nreforms—for example, the 1880s debate in Victorian England, when\nWhitehead was a Cambridge student, between T. H. Huxley, an outspoken\nchampion of science, defending the claims of modern scientific\neducation, and Matthew Arnold, a leading man of letters, defending the\nclaims of classical literary education.\n\nAs for Whitehead, in whom the scientific and the romantic spirit\nmerged, one cannot say that he sided with either Huxley or Arnold. He\ntook his distance from those who, motivated by the idea that the\nsciences embody the ultimate modes of thought, sided with Huxley, but\nalso from those who, motivated by conservatism, that is, by an\nanachronistic longing for a highly educated upper class and an elitist\nhorror of educational democratization, sided with Arnold (cf. 1947\n[1968: 23–24]). Next to not taking a stance in the debate on\nwhich is the ultimate mode of thought, the scientific or the literary,\nhence rejecting the antithesis between scientific and literary\neducation, Whitehead also rejected the antithesis between thought and\naction (cf. 1947 [1968: 172]) and hence, between a liberal, that is,\nmainly intellectual and theoretical, education, and a technical, that\nis, mainly manual and practical, education (cf. 1929a: 66–92).\nIn other words, according to Whitehead, we can identify three instead\nof two cultures but, moreover, we must refrain from promoting any one\nof these three at the expense of the other two. He writes:\n\n\nMy point is, that no course of study can claim any position of ideal\ncompleteness. Nor are the omitted factors of subordinate importance.\nThe insistence in the Platonic culture on disinterested intellectual\nappreciation is a psychological error. Action and our implication in\nthe transition of events amid the inevitable bond of cause to effect\nare fundamental. An education which strives to divorce intellectual or\naesthetic life from these fundamental facts carries with it the\ndecadence of civilisation. (1929a: 73)\n\nDisinterested scientific curiosity is a passion for an ordered\nintellectual vision of the connection of events. But the …\nintervention of action even in abstract science is often overlooked.\nNo man of science wants merely to know. He acquires knowledge to\nappease his passion for discovery. He does not discover in order to\nknow, he knows in order to discover. The pleasure which art and\nsciences can give to toil is the enjoyment which arises from\nsuccessfully directed intention. (1929a: 74)\n\nThe antithesis between a technical and a liberal education is\nfallacious. There can be no technical education which is not liberal,\nand no liberal education which is not technical: that is, no education\nwhich does not import both technique and intellectual vision. (1929a:\n74)\n\nThere are three main methods which are required in a national system\nof education, namely, the literary curriculum, the scientific\ncurriculum, the technical curriculum. But each of these curricula\nshould include the other two … each of these sides …\nshould be illuminated by the others. (1929a: 75)\n\n\nFor more details and an extensive bibliography on Whitehead’s\nphilosophy of education, cf. Part VI of Volume 1 of the Handbook\nof Whiteheadian Process Thought (Weber & Desmond 2008:\n185–214). For some recent Whiteheadian contributions to\nEducating for an Ecological Civilization, see Ford &\nRowe (eds.) 2017.\n",
    "section_title": "5. Philosophy of Education",
    "entry_title": "Alfred North Whitehead",
    "hierarchy_title": "Alfred North Whitehead || Philosophy of Education",
    "tokenized_text": [
        "philosophy",
        "education",
        "philosophy",
        "education",
        "london",
        "whitehead",
        "became",
        "involved",
        "many",
        "practical",
        "aspect",
        "tertiary",
        "education",
        "serving",
        "president",
        "mathematical",
        "association",
        "dean",
        "faculty",
        "science",
        "chairman",
        "academic",
        "council",
        "senate",
        "university",
        "london",
        "chairman",
        "delegacy",
        "goldsmith",
        "college",
        "several",
        "administrative",
        "post",
        "many",
        "essay",
        "education",
        "date",
        "time",
        "appear",
        "book",
        "aim",
        "education",
        "essay",
        "a",
        "core",
        "whitehead",
        "philosophy",
        "education",
        "emphasizes",
        "idea",
        "good",
        "life",
        "profitably",
        "thought",
        "educated",
        "civilized",
        "life",
        "two",
        "term",
        "whitehead",
        "often",
        "us",
        "interchangeably",
        "think",
        "live",
        "thus",
        "improve",
        "thought",
        "improve",
        "life",
        "result",
        "say",
        "whitehead",
        "one",
        "subject",
        "matter",
        "education",
        "life",
        "manifestation",
        "a",
        "view",
        "turn",
        "corollary",
        "content",
        "education",
        "method",
        "delivery",
        "regard",
        "delivery",
        "whitehead",
        "emphasizes",
        "importance",
        "remembering",
        "pupil",
        "mind",
        "growing",
        "organism",
        "box",
        "ruthlessly",
        "packed",
        "alien",
        "idea",
        "a",
        "instead",
        "purpose",
        "education",
        "stimulate",
        "guide",
        "student",
        "selfdevelopment",
        "job",
        "educator",
        "simply",
        "insert",
        "student",
        "mind",
        "little",
        "chunk",
        "knowledge",
        "whitehead",
        "conceives",
        "student",
        "educational",
        "process",
        "selfdevelopment",
        "organic",
        "cyclic",
        "process",
        "cycle",
        "consists",
        "three",
        "stage",
        "first",
        "stage",
        "romance",
        "stage",
        "precision",
        "finally",
        "stage",
        "generalization",
        "first",
        "stage",
        "free",
        "exploration",
        "initiated",
        "wonder",
        "second",
        "disciplined",
        "acquirement",
        "technique",
        "detailed",
        "knowledge",
        "third",
        "free",
        "application",
        "learned",
        "lowe",
        "stage",
        "continually",
        "recurring",
        "cycle",
        "determine",
        "whitehead",
        "call",
        "rhythm",
        "education",
        "cf",
        "a",
        "context",
        "mathematics",
        "whitehead",
        "three",
        "stage",
        "conceived",
        "stage",
        "undisciplined",
        "intuition",
        "stage",
        "logical",
        "reasoning",
        "stage",
        "logically",
        "guided",
        "intuition",
        "skipping",
        "stage",
        "one",
        "never",
        "arriving",
        "stage",
        "three",
        "bad",
        "math",
        "teacher",
        "deny",
        "student",
        "major",
        "motivation",
        "love",
        "mathematics",
        "joy",
        "pattern",
        "recognition",
        "education",
        "involve",
        "inserting",
        "student",
        "mind",
        "little",
        "chunk",
        "knowledge",
        "clear",
        "description",
        "culture",
        "whitehead",
        "offer",
        "opening",
        "first",
        "title",
        "essay",
        "aim",
        "education",
        "culture",
        "activity",
        "thought",
        "receptiveness",
        "beauty",
        "humane",
        "feeling",
        "scrap",
        "information",
        "nothing",
        "a",
        "contrary",
        "whitehead",
        "writes",
        "must",
        "beware",
        "call",
        "inert",
        "idea",
        "that",
        "say",
        "idea",
        "merely",
        "received",
        "mind",
        "without",
        "utilized",
        "tested",
        "thrown",
        "fresh",
        "combination",
        "a",
        "hold",
        "education",
        "acquisition",
        "art",
        "interconnection",
        "utilization",
        "knowledge",
        "a",
        "idea",
        "remain",
        "disconnected",
        "nonutilized",
        "unless",
        "related",
        "stream",
        "compounded",
        "sense",
        "perception",
        "feeling",
        "hope",
        "desire",
        "mental",
        "activity",
        "adjusting",
        "thought",
        "thought",
        "form",
        "life",
        "a",
        "pointthe",
        "point",
        "whitehead",
        "link",
        "art",
        "education",
        "stream",
        "experience",
        "form",
        "lifeis",
        "meeting",
        "point",
        "whitehead",
        "philosophy",
        "education",
        "philosophy",
        "experience",
        "also",
        "called",
        "process",
        "philosophy",
        "according",
        "whitehead",
        "process",
        "philosophy",
        "stream",
        "experience",
        "form",
        "life",
        "consists",
        "occasion",
        "experience",
        "synthesis",
        "many",
        "feeling",
        "objective",
        "content",
        "felt",
        "subjective",
        "form",
        "felt",
        "also",
        "synthesis",
        "feeling",
        "primarily",
        "controlled",
        "objective",
        "content",
        "subjective",
        "form",
        "according",
        "whitehead",
        "philosophy",
        "education",
        "attempt",
        "educate",
        "person",
        "merely",
        "focusing",
        "objective",
        "contenton",
        "inert",
        "idea",
        "scrap",
        "information",
        "bare",
        "knowledgewhile",
        "disregarding",
        "subjective",
        "form",
        "emotional",
        "pattern",
        "person",
        "experience",
        "never",
        "successful",
        "art",
        "education",
        "take",
        "account",
        "subjective",
        "receptiveness",
        "appreciation",
        "beauty",
        "human",
        "greatness",
        "subjective",
        "emotion",
        "interest",
        "joy",
        "adventure",
        "ultimate",
        "motive",
        "power",
        "a",
        "sense",
        "importance",
        "value",
        "possibility",
        "cfa",
        "b",
        "regard",
        "content",
        "whitehead",
        "hold",
        "adequate",
        "education",
        "must",
        "include",
        "literary",
        "component",
        "scientific",
        "component",
        "technical",
        "component",
        "according",
        "whitehead",
        "serious",
        "fundamental",
        "change",
        "intellectual",
        "outlook",
        "human",
        "society",
        "must",
        "necessarily",
        "followed",
        "educational",
        "revolution",
        "a",
        "particular",
        "scientific",
        "revolution",
        "fundamental",
        "change",
        "entailed",
        "seventeenth",
        "subsequent",
        "century",
        "followed",
        "educational",
        "revolution",
        "still",
        "ongoing",
        "twentieth",
        "century",
        "whitehead",
        "wrote",
        "fact",
        "midst",
        "educational",
        "revolution",
        "caused",
        "dying",
        "away",
        "classical",
        "impulse",
        "dominated",
        "european",
        "thought",
        "since",
        "time",
        "renaissance",
        "mean",
        "loss",
        "sustained",
        "reference",
        "classical",
        "literature",
        "sake",
        "finding",
        "expression",
        "best",
        "thought",
        "subject",
        "three",
        "fundamental",
        "change",
        "science",
        "enters",
        "texture",
        "thought",
        "mechanical",
        "invention",
        "product",
        "science",
        "altering",
        "material",
        "possibility",
        "life",
        "transformed",
        "industrial",
        "system",
        "thus",
        "changed",
        "structure",
        "society",
        "finally",
        "idea",
        "world",
        "mean",
        "u",
        "whole",
        "round",
        "world",
        "human",
        "affair",
        "revolution",
        "china",
        "peru",
        "total",
        "result",
        "change",
        "supreme",
        "merit",
        "immediate",
        "relevance",
        "full",
        "compass",
        "modern",
        "life",
        "lost",
        "classical",
        "literature",
        "whitehead",
        "listed",
        "scientific",
        "industrial",
        "revolution",
        "well",
        "globalization",
        "major",
        "cause",
        "educational",
        "reform",
        "nineteenth",
        "twentieth",
        "century",
        "fundamental",
        "change",
        "indeed",
        "implied",
        "new",
        "standard",
        "count",
        "genuine",
        "knowledge",
        "however",
        "together",
        "new",
        "standard",
        "emerged",
        "romantic",
        "anxietythe",
        "anxiety",
        "new",
        "standard",
        "genuine",
        "knowledge",
        "education",
        "living",
        "might",
        "impoverish",
        "human",
        "experience",
        "damage",
        "individual",
        "social",
        "wellbeing",
        "hence",
        "arose",
        "bifurcation",
        "culture",
        "culture",
        "natural",
        "scientist",
        "culture",
        "literary",
        "intellectual",
        "cf",
        "snow",
        "many",
        "associated",
        "debate",
        "context",
        "various",
        "educational",
        "reformsfor",
        "example",
        "s",
        "debate",
        "victorian",
        "england",
        "whitehead",
        "cambridge",
        "student",
        "t",
        "h",
        "huxley",
        "outspoken",
        "champion",
        "science",
        "defending",
        "claim",
        "modern",
        "scientific",
        "education",
        "matthew",
        "arnold",
        "leading",
        "man",
        "letter",
        "defending",
        "claim",
        "classical",
        "literary",
        "education",
        "whitehead",
        "scientific",
        "romantic",
        "spirit",
        "merged",
        "one",
        "say",
        "sided",
        "either",
        "huxley",
        "arnold",
        "took",
        "distance",
        "motivated",
        "idea",
        "science",
        "embody",
        "ultimate",
        "mode",
        "thought",
        "sided",
        "huxley",
        "also",
        "motivated",
        "conservatism",
        "anachronistic",
        "longing",
        "highly",
        "educated",
        "upper",
        "class",
        "elitist",
        "horror",
        "educational",
        "democratization",
        "sided",
        "arnold",
        "cf",
        "next",
        "taking",
        "stance",
        "debate",
        "ultimate",
        "mode",
        "thought",
        "scientific",
        "literary",
        "hence",
        "rejecting",
        "antithesis",
        "scientific",
        "literary",
        "education",
        "whitehead",
        "also",
        "rejected",
        "antithesis",
        "thought",
        "action",
        "cf",
        "hence",
        "liberal",
        "mainly",
        "intellectual",
        "theoretical",
        "education",
        "technical",
        "mainly",
        "manual",
        "practical",
        "education",
        "cf",
        "a",
        "word",
        "according",
        "whitehead",
        "identify",
        "three",
        "instead",
        "two",
        "culture",
        "moreover",
        "must",
        "refrain",
        "promoting",
        "one",
        "three",
        "expense",
        "two",
        "writes",
        "point",
        "course",
        "study",
        "claim",
        "position",
        "ideal",
        "completeness",
        "omitted",
        "factor",
        "subordinate",
        "importance",
        "insistence",
        "platonic",
        "culture",
        "disinterested",
        "intellectual",
        "appreciation",
        "psychological",
        "error",
        "action",
        "implication",
        "transition",
        "event",
        "amid",
        "inevitable",
        "bond",
        "cause",
        "effect",
        "fundamental",
        "education",
        "strives",
        "divorce",
        "intellectual",
        "aesthetic",
        "life",
        "fundamental",
        "fact",
        "carry",
        "decadence",
        "civilisation",
        "a",
        "disinterested",
        "scientific",
        "curiosity",
        "passion",
        "ordered",
        "intellectual",
        "vision",
        "connection",
        "event",
        "intervention",
        "action",
        "even",
        "abstract",
        "science",
        "often",
        "overlooked",
        "man",
        "science",
        "want",
        "merely",
        "know",
        "acquires",
        "knowledge",
        "appease",
        "passion",
        "discovery",
        "discover",
        "order",
        "know",
        "know",
        "order",
        "discover",
        "pleasure",
        "art",
        "science",
        "give",
        "toil",
        "enjoyment",
        "arises",
        "successfully",
        "directed",
        "intention",
        "a",
        "antithesis",
        "technical",
        "liberal",
        "education",
        "fallacious",
        "technical",
        "education",
        "liberal",
        "liberal",
        "education",
        "technical",
        "education",
        "import",
        "technique",
        "intellectual",
        "vision",
        "a",
        "three",
        "main",
        "method",
        "required",
        "national",
        "system",
        "education",
        "namely",
        "literary",
        "curriculum",
        "scientific",
        "curriculum",
        "technical",
        "curriculum",
        "curriculum",
        "include",
        "two",
        "side",
        "illuminated",
        "others",
        "a",
        "detail",
        "extensive",
        "bibliography",
        "whitehead",
        "philosophy",
        "education",
        "cf",
        "part",
        "vi",
        "volume",
        "handbook",
        "whiteheadian",
        "process",
        "thought",
        "weber",
        "desmond",
        "recent",
        "whiteheadian",
        "contribution",
        "educating",
        "ecological",
        "civilization",
        "see",
        "ford",
        "rowe",
        "ed"
    ]
}