{
    "main_text": "From Kant to the Philosophy of Values\n2. From Kant to the Philosophy of Values\n\nWindelband’s views on normativity are strongly influenced by his\nteacher Lotze. In his Logic (1874), Lotze distinguishes\nbetween psychological laws which determine how thinking proceeds as a\nmatter of fact, and logical laws, which are normative laws and\nprescribe how thinking ought to proceed (Lotze 1874: §x;\n§332, §337). This distinction also corresponds to a\ndistinction between act and content. Lotze observes that\n“ideas” do occur in us as acts or events of the mind. But\ntheir content does not consist in such acts, is not reducible to\nmental activity, and does not exist in the way empirical processes and\nentities may be said to exist. It is not real, but “valid”\n(Lotze 1874: §§314–318).\n\nThe distinction between the factual and the normative would become the\ncornerstone of Windelband’s “philosophy of values”.\nIn his early writings, however, Windelband does not yet embrace this\ndistinction. In his habilitation thesis Über die\nGewißheit der Erkenntnis (1873), he argues that logic is a\nnormative discipline, but that it needs to be put on a psychological\nbasis. This is because the justification of our knowledge claims is\nalways dependent on and relative to specific epistemic purposes which,\nin turn, are given psychologically. Although he criticizes the\nidentification of the conditions of knowledge with psychophysical\nprocesses, he does think of psychology and logic or epistemology as\ncontinuous with one another. His 1875 “Die Erkenntnislehre unter\ndem völkerpsychologischen Gesichtspunkte” [“The\ntheory of knowledge from the perspective of folk-psychology”]\nwhich was published in Moritz Lazarus’ and Heyman\nSteinthal’s Zeitschrift für Völkerpsychologie und\nSprachwissenschaft [Journal of folk psychology and\nlinguistics], is more radical. It denies that logical norms are\nindependent of the conscious mind and claims that the origins of\nlogical norms are to be found in the social history of humankind: the\nprinciple of contradiction emerges in situations of social conflict\ntogether with the distinction between true and false beliefs; and the\nlaw of sufficient reason comes into being when conflicts between rival\nviews are no longer settled by brute force. On this picture, logical\nprinciples exist only when humans cognize them. There is no boundary\nbetween psychological acts and objective logical laws, or between\nactual historical acceptance and normative validity.\n\nThis is precisely the type of thinking that Windelband will later\nreject as “psychologistic”, “historicist”, and\n“relativist” (1883: 116–117, 132). It is not clear\nwhat led Windelband to this change of view, but a deeper engagement\nwith the Critique of Pure Reason and with the Kant\nscholarship of his time, in particular with works by Kuno Fischer\n(1860), Herman Cohen (1871), and Friedrich Paulsen (1875), seem to\nhave factored in. The clear contours of Windelband’s\nanti-psychologistic interpretation of Kant emerge for the first time\nin his 1877 paper “Über die verschiedenen Phasen der\nKantischen Lehre vom Ding-an-sich” [“On the different\nstages of the Kantian doctrine of the thing-in-itself”]. In this\nessay, Windelband argues against the idea, held by prominent figures\nof the “back-to-Kant” movement like Friedrich Albert Lange\n(1828–1875) and Hermann von Helmholtz (1821–1894), that\nknowledge emerges from an interaction between subject and object.\nAccording to their view, the object affects the subject’s mind,\nwhile the subject provides the a priori cognitive structures\nthat organize representations. These a priori structures are\ninnate as they consist in the psychophysical constitution of the human\nsensory apparatus and mind. Cohen’s critique of this\n(mis)interpretation focuses on the concept of the a priori\nand the question of objectivity (Cohen 1871). Windelband, in contrast,\ntakes the problem of the thing-in-itself and the concept of truth as\nhis starting points. His critique of the subject-object-interaction\nmodel leads him to an immanent conception of truth, according to which\ntruth consists in the normative rules according to which our judgments\nought to be formed. The immanent concept of truth thus shifts\nthe focus of philosophical analysis on the universal and necessary\n“rules” that ground our judgments.\n\nThe 1877 essay gives a genetic account of the development of\nKant’s views about the thing-in-itself from the Inaugural\nDissertation (1770) to the second edition of the Critique of\nPure Reason (1787). This genetic reconstruction is supposed to\nreveal the underlying philosophical problems and motivations that\ndrove Kant’s thinking, as well as the inner tensions that,\naccording to Windelband, permeate critical philosophy. In particular,\nWindelband identifies a “gulf” (1877: 225) between\nKant’s critique of knowledge and the metaphysics of morals, as\nwell as a tension between the psychological account of the faculties,\nand Kant’s mature anti-psychologism. He distinguishes between\nfour phases in Kant’s thinking about the thing-in-itself, and\nargues that residues of the latter three stages are present in both\neditions of the Critique (1781; 1787) and in the\nProlegomena (1783).\n\nThe first phase, Windelband argues, is that of the Inaugural\nDissertation (1770). Kant adopts Leibniz’s distinction\nbetween noumena and phenomena while formulating a genuinely novel\nthought: he introduces the psychological distinction between receptive\nsensibility and the spontaneous intellect. This distinction allows him\nto maintain the claim that, unlike intuitions, concepts relate to\nthings-in-themselves (1877: 240–241).\n\nIn the second phase, Kant concerns himself more deeply with the\nquestion how the concepts of the understanding can relate to objects.\nHe is driven to the insight that \n\n\n[w]e can only have a priori knowledge of that which we\nproduce by the lawlike forms of our rational activities\n[Vernunfthandlungen]. (1877: 246) \n\n\nHere, Windelband follows Fischer’s claim that the categories of\nthe understanding are a priori valid for experience because\nthey produce or “make” it (Fischer 1860). Because the\nunderstanding cannot “make” the thing-in-itself, the\nthing-in-itself cannot be known.\n\nAccording to Windelband, Kant then proceeds to inquire why we are even\nassuming the existence of things-in-themselves if we cannot know them.\nHere he enters his third, most radical phase. Kant now thinks of the\nthing-in-itself as a fiction, an illegitimate hypostasis in which \n\n\nthe universal form of the synthetic act of the understanding is seen\nas something that exists independently of experience. (1877: 254) \n\n\nWindelband argues that it is only by dismissing the existence of the\nthing-in-itself and by jettisoning the phenomena-noumena distinction\nthat Kant can undertake his anti-psychologistic turn. With the\nrejection of the thing-in-itself, the characterization of sensibility\nas “receptive” also needs to be abandoned. And that makes\na psychological construal of the faculties nonsensical. Kant is then\nalso able to abandon the concept of truth as correspondence between\nrepresentations and objects in favor of a strictly immanent\nconception. The immanent conception defines truth in terms of the\nuniversal and necessary rules that the relations between our\nrepresentations need to accord to (1877: 259–260).\n\nAnd yet, Kant could not rest with this radical view given his\ncommitments in moral philosophy. Practical reason, and in particular\nthe idea that the moral law does not depend on the qualities of humans\nas sensuous beings, but only on reason, demands a return to the\nassumption that the thing-in-itself exists (1877: 262). In the fourth\nphase, Kant thus reintroduces the thing-in-itself, while maintaining\nhis anti-psychologism.\n\nThis genetic reconstruction allows Windelband to think of the conflict\nbetween the different views of the thing-in-itself that had emerged\nwithin the neo-Kantian tradition as reflective of inherent tensions in\nthe Critique. He argues that Kant was especially unclear with\nrespect to psychologism: the distinction between judgment (as a\ncognitive process) and justification (as logical and normative) is\ninadequately articulated in the first Critique. Hence Kant is\nat least partly responsible for the fact that in the first wave of\nneo-Kantianism represented by Lange and Helmholtz “the new\nconcept of aprioricity was soon dragged down to the old idea of\npsychological priority” (1883: 101).\n\nBut Windelband’s approach to Kant is not merely historical. His\nsympathies clearly lie with the Kant of the third phase. For\nWindelband, the insight that natural psychological processes are\n“utterly irrelevant” for the truth value of our\nrepresentations (1882b: 24), and the idea that the ultimate problem of\nphilosophy is that of normativity and justification—not a\nquaestio facti, but a quaestio juris (1882b:\n26)—need to be defended from Kant’s own unclarities on\nthese matters. Windelband’s “philosophy of values”\ncan thus be understood as an attempt to purify, explicate and develop\nthe radical insights of the anti-psychologistic move in Kant’s\n“third phase”.\n\nThe cornerstone of this endeavor is the immanent conception of truth.\nWindelband repeatedly returns to discussing the correspondence theory\nof knowledge with its metaphor of a “mirror relation”\nbetween mind and object. He criticizes the misconception that our\nsensual perceptions are the things-in-themselves and that these things\ncould be compared with our representations. Any comparison must occur\nbetween representations, since things and representations are\n“incommensurable” (1881: 130). According to Windelband,\nKant’s central innovation consists in the insight that the truth\nof our judgments, and the relation of our representations to an object\nare not to be found in correspondence at all. Rather, it consists in\nthe “rules” for combining representations (1881: 134).\nThis leads Windelband to define truth as the “normality of\nthinking” (1881: 138)—with “normality” meaning\nthat thinking proceeds in accordance with rules or norms. Windelband\nalso conceptualizes the object of knowledge in terms of the rules of\njudgment. The object of knowledge is nothing other than \n\n\na rule according to which representational elements ought to organize\nthemselves, in order for them to be recognized as universally valid in\nthis organization. (1881: 135).\n\n\nWindelband uses the terms “axioms” and\n“values” interchangeably to refer to the most fundamental\nrules, and he uses the term “norms” often, but not fully\nconsistently to refer to values or axioms as they relate to\npsychological experience and the cultural-historical world. Focusing\nhis interpretation on “values” and “norms”,\nWindelband captures the structural similarity of Kant’s three\nCritiques in terms of immanent truth: if truth is nothing\nother than accordance with a rule, then there is moral and aesthetic\ntruth in just the same way as there is epistemic truth (1881: 140). In\na later text, Windelband describes the unified project of the three\nCritiques in terms of the necessary and universal relation\nbetween thought and object. He writes that the postulates of practical\nreason relate to intelligible objects (ideas) just “as\nnecessarily” as the intuitions and categories relate to the\nobject of experience, and that teleological judgment constructs the\npurposive whole of nature just “as universally” as the\nprinciples of pure understanding apply the categories to experience\n(1904a: 151). While this formulation glosses over some of the nuances\nof the distinction between constitutive and regulative uses of reason,\nWindelband’s main intention is not that of giving a detailed and\nfully accurate reconstruction of Kant’s philosophy. In line with\nhis famous dictum that “understanding Kant means to go beyond\nhim” (1915: iv), he instead seeks to revive the critical project\nin a manner that allows it to answer the needs of his own time. And\nWindelband thinks that the critical philosophy required at the time of\nhis writing is a “philosophy of values” which reveals the\nmost fundamental values in epistemology, ethics, and aesthetics.\n",
    "section_title": "2. From Kant to the Philosophy of Values",
    "entry_title": "Wilhelm Windelband",
    "hierarchy_title": "Wilhelm Windelband || From Kant to the Philosophy of Values",
    "tokenized_text": [
        "kant",
        "philosophy",
        "value",
        "kant",
        "philosophy",
        "value",
        "windelband",
        "view",
        "normativity",
        "strongly",
        "influenced",
        "teacher",
        "lotze",
        "logic",
        "lotze",
        "distinguishes",
        "psychological",
        "law",
        "determine",
        "thinking",
        "proceeds",
        "matter",
        "fact",
        "logical",
        "law",
        "normative",
        "law",
        "prescribe",
        "thinking",
        "ought",
        "proceed",
        "lotze",
        "x",
        "distinction",
        "also",
        "corresponds",
        "distinction",
        "act",
        "content",
        "lotze",
        "observes",
        "idea",
        "occur",
        "u",
        "act",
        "event",
        "mind",
        "content",
        "consist",
        "act",
        "reducible",
        "mental",
        "activity",
        "exist",
        "way",
        "empirical",
        "process",
        "entity",
        "may",
        "said",
        "exist",
        "real",
        "valid",
        "lotze",
        "distinction",
        "factual",
        "normative",
        "would",
        "become",
        "cornerstone",
        "windelband",
        "philosophy",
        "value",
        "early",
        "writing",
        "however",
        "windelband",
        "yet",
        "embrace",
        "distinction",
        "habilitation",
        "thesis",
        "über",
        "die",
        "gewißheit",
        "der",
        "erkenntnis",
        "argues",
        "logic",
        "normative",
        "discipline",
        "need",
        "put",
        "psychological",
        "basis",
        "justification",
        "knowledge",
        "claim",
        "always",
        "dependent",
        "relative",
        "specific",
        "epistemic",
        "purpose",
        "turn",
        "given",
        "psychologically",
        "although",
        "criticizes",
        "identification",
        "condition",
        "knowledge",
        "psychophysical",
        "process",
        "think",
        "psychology",
        "logic",
        "epistemology",
        "continuous",
        "one",
        "another",
        "die",
        "erkenntnislehre",
        "unter",
        "dem",
        "völkerpsychologischen",
        "gesichtspunkte",
        "theory",
        "knowledge",
        "perspective",
        "folkpsychology",
        "published",
        "moritz",
        "lazarus",
        "heyman",
        "steinthal",
        "zeitschrift",
        "für",
        "völkerpsychologie",
        "und",
        "sprachwissenschaft",
        "journal",
        "folk",
        "psychology",
        "linguistics",
        "radical",
        "denies",
        "logical",
        "norm",
        "independent",
        "conscious",
        "mind",
        "claim",
        "origin",
        "logical",
        "norm",
        "found",
        "social",
        "history",
        "humankind",
        "principle",
        "contradiction",
        "emerges",
        "situation",
        "social",
        "conflict",
        "together",
        "distinction",
        "true",
        "false",
        "belief",
        "law",
        "sufficient",
        "reason",
        "come",
        "conflict",
        "rival",
        "view",
        "longer",
        "settled",
        "brute",
        "force",
        "picture",
        "logical",
        "principle",
        "exist",
        "human",
        "cognize",
        "boundary",
        "psychological",
        "act",
        "objective",
        "logical",
        "law",
        "actual",
        "historical",
        "acceptance",
        "normative",
        "validity",
        "precisely",
        "type",
        "thinking",
        "windelband",
        "later",
        "reject",
        "psychologistic",
        "historicist",
        "relativist",
        "clear",
        "led",
        "windelband",
        "change",
        "view",
        "deeper",
        "engagement",
        "critique",
        "pure",
        "reason",
        "kant",
        "scholarship",
        "time",
        "particular",
        "work",
        "kuno",
        "fischer",
        "herman",
        "cohen",
        "friedrich",
        "paulsen",
        "seem",
        "factored",
        "clear",
        "contour",
        "windelband",
        "antipsychologistic",
        "interpretation",
        "kant",
        "emerge",
        "first",
        "time",
        "paper",
        "über",
        "die",
        "verschiedenen",
        "phasen",
        "der",
        "kantischen",
        "lehre",
        "vom",
        "dingansich",
        "different",
        "stage",
        "kantian",
        "doctrine",
        "thinginitself",
        "essay",
        "windelband",
        "argues",
        "idea",
        "held",
        "prominent",
        "figure",
        "backtokant",
        "movement",
        "like",
        "friedrich",
        "albert",
        "lange",
        "hermann",
        "von",
        "helmholtz",
        "knowledge",
        "emerges",
        "interaction",
        "subject",
        "object",
        "according",
        "view",
        "object",
        "affect",
        "subject",
        "mind",
        "subject",
        "provides",
        "priori",
        "cognitive",
        "structure",
        "organize",
        "representation",
        "priori",
        "structure",
        "innate",
        "consist",
        "psychophysical",
        "constitution",
        "human",
        "sensory",
        "apparatus",
        "mind",
        "cohen",
        "critique",
        "mi",
        "interpretation",
        "focus",
        "concept",
        "priori",
        "question",
        "objectivity",
        "cohen",
        "windelband",
        "contrast",
        "take",
        "problem",
        "thinginitself",
        "concept",
        "truth",
        "starting",
        "point",
        "critique",
        "subjectobjectinteraction",
        "model",
        "lead",
        "immanent",
        "conception",
        "truth",
        "according",
        "truth",
        "consists",
        "normative",
        "rule",
        "according",
        "judgment",
        "ought",
        "formed",
        "immanent",
        "concept",
        "truth",
        "thus",
        "shift",
        "focus",
        "philosophical",
        "analysis",
        "universal",
        "necessary",
        "rule",
        "ground",
        "judgment",
        "essay",
        "give",
        "genetic",
        "account",
        "development",
        "kant",
        "view",
        "thinginitself",
        "inaugural",
        "dissertation",
        "second",
        "edition",
        "critique",
        "pure",
        "reason",
        "genetic",
        "reconstruction",
        "supposed",
        "reveal",
        "underlying",
        "philosophical",
        "problem",
        "motivation",
        "drove",
        "kant",
        "thinking",
        "well",
        "inner",
        "tension",
        "according",
        "windelband",
        "permeate",
        "critical",
        "philosophy",
        "particular",
        "windelband",
        "identifies",
        "gulf",
        "kant",
        "critique",
        "knowledge",
        "metaphysics",
        "moral",
        "well",
        "tension",
        "psychological",
        "account",
        "faculty",
        "kant",
        "mature",
        "antipsychologism",
        "distinguishes",
        "four",
        "phase",
        "kant",
        "thinking",
        "thinginitself",
        "argues",
        "residue",
        "latter",
        "three",
        "stage",
        "present",
        "edition",
        "critique",
        "prolegomenon",
        "first",
        "phase",
        "windelband",
        "argues",
        "inaugural",
        "dissertation",
        "kant",
        "adopts",
        "leibniz",
        "distinction",
        "noumenon",
        "phenomenon",
        "formulating",
        "genuinely",
        "novel",
        "thought",
        "introduces",
        "psychological",
        "distinction",
        "receptive",
        "sensibility",
        "spontaneous",
        "intellect",
        "distinction",
        "allows",
        "maintain",
        "claim",
        "unlike",
        "intuition",
        "concept",
        "relate",
        "thingsinthemselves",
        "second",
        "phase",
        "kant",
        "concern",
        "deeply",
        "question",
        "concept",
        "understanding",
        "relate",
        "object",
        "driven",
        "insight",
        "w",
        "e",
        "priori",
        "knowledge",
        "produce",
        "lawlike",
        "form",
        "rational",
        "activity",
        "vernunfthandlungen",
        "windelband",
        "follows",
        "fischer",
        "claim",
        "category",
        "understanding",
        "priori",
        "valid",
        "experience",
        "produce",
        "make",
        "fischer",
        "understanding",
        "make",
        "thinginitself",
        "thinginitself",
        "known",
        "according",
        "windelband",
        "kant",
        "proceeds",
        "inquire",
        "even",
        "assuming",
        "existence",
        "thingsinthemselves",
        "know",
        "enters",
        "third",
        "radical",
        "phase",
        "kant",
        "think",
        "thinginitself",
        "fiction",
        "illegitimate",
        "hypostasis",
        "universal",
        "form",
        "synthetic",
        "act",
        "understanding",
        "seen",
        "something",
        "exists",
        "independently",
        "experience",
        "windelband",
        "argues",
        "dismissing",
        "existence",
        "thinginitself",
        "jettisoning",
        "phenomenanoumena",
        "distinction",
        "kant",
        "undertake",
        "antipsychologistic",
        "turn",
        "rejection",
        "thinginitself",
        "characterization",
        "sensibility",
        "receptive",
        "also",
        "need",
        "abandoned",
        "make",
        "psychological",
        "construal",
        "faculty",
        "nonsensical",
        "kant",
        "also",
        "able",
        "abandon",
        "concept",
        "truth",
        "correspondence",
        "representation",
        "object",
        "favor",
        "strictly",
        "immanent",
        "conception",
        "immanent",
        "conception",
        "defines",
        "truth",
        "term",
        "universal",
        "necessary",
        "rule",
        "relation",
        "representation",
        "need",
        "accord",
        "yet",
        "kant",
        "could",
        "rest",
        "radical",
        "view",
        "given",
        "commitment",
        "moral",
        "philosophy",
        "practical",
        "reason",
        "particular",
        "idea",
        "moral",
        "law",
        "depend",
        "quality",
        "human",
        "sensuous",
        "being",
        "reason",
        "demand",
        "return",
        "assumption",
        "thinginitself",
        "exists",
        "fourth",
        "phase",
        "kant",
        "thus",
        "reintroduces",
        "thinginitself",
        "maintaining",
        "antipsychologism",
        "genetic",
        "reconstruction",
        "allows",
        "windelband",
        "think",
        "conflict",
        "different",
        "view",
        "thinginitself",
        "emerged",
        "within",
        "neokantian",
        "tradition",
        "reflective",
        "inherent",
        "tension",
        "critique",
        "argues",
        "kant",
        "especially",
        "unclear",
        "respect",
        "psychologism",
        "distinction",
        "judgment",
        "cognitive",
        "process",
        "justification",
        "logical",
        "normative",
        "inadequately",
        "articulated",
        "first",
        "critique",
        "hence",
        "kant",
        "least",
        "partly",
        "responsible",
        "fact",
        "first",
        "wave",
        "neokantianism",
        "represented",
        "lange",
        "helmholtz",
        "new",
        "concept",
        "aprioricity",
        "soon",
        "dragged",
        "old",
        "idea",
        "psychological",
        "priority",
        "windelband",
        "approach",
        "kant",
        "merely",
        "historical",
        "sympathy",
        "clearly",
        "lie",
        "kant",
        "third",
        "phase",
        "windelband",
        "insight",
        "natural",
        "psychological",
        "process",
        "utterly",
        "irrelevant",
        "truth",
        "value",
        "representation",
        "b",
        "idea",
        "ultimate",
        "problem",
        "philosophy",
        "normativity",
        "justificationnot",
        "quaestio",
        "facti",
        "quaestio",
        "juris",
        "b",
        "need",
        "defended",
        "kant",
        "unclarities",
        "matter",
        "windelband",
        "philosophy",
        "value",
        "thus",
        "understood",
        "attempt",
        "purify",
        "explicate",
        "develop",
        "radical",
        "insight",
        "antipsychologistic",
        "move",
        "kant",
        "third",
        "phase",
        "cornerstone",
        "endeavor",
        "immanent",
        "conception",
        "truth",
        "windelband",
        "repeatedly",
        "return",
        "discussing",
        "correspondence",
        "theory",
        "knowledge",
        "metaphor",
        "mirror",
        "relation",
        "mind",
        "object",
        "criticizes",
        "misconception",
        "sensual",
        "perception",
        "thingsinthemselves",
        "thing",
        "could",
        "compared",
        "representation",
        "comparison",
        "must",
        "occur",
        "representation",
        "since",
        "thing",
        "representation",
        "incommensurable",
        "according",
        "windelband",
        "kant",
        "central",
        "innovation",
        "consists",
        "insight",
        "truth",
        "judgment",
        "relation",
        "representation",
        "object",
        "found",
        "correspondence",
        "rather",
        "consists",
        "rule",
        "combining",
        "representation",
        "lead",
        "windelband",
        "define",
        "truth",
        "normality",
        "thinking",
        "with",
        "normality",
        "meaning",
        "thinking",
        "proceeds",
        "accordance",
        "rule",
        "norm",
        "windelband",
        "also",
        "conceptualizes",
        "object",
        "knowledge",
        "term",
        "rule",
        "judgment",
        "object",
        "knowledge",
        "nothing",
        "rule",
        "according",
        "representational",
        "element",
        "ought",
        "organize",
        "order",
        "recognized",
        "universally",
        "valid",
        "organization",
        "windelband",
        "us",
        "term",
        "axiom",
        "value",
        "interchangeably",
        "refer",
        "fundamental",
        "rule",
        "us",
        "term",
        "norm",
        "often",
        "fully",
        "consistently",
        "refer",
        "value",
        "axiom",
        "relate",
        "psychological",
        "experience",
        "culturalhistorical",
        "world",
        "focusing",
        "interpretation",
        "value",
        "norm",
        "windelband",
        "capture",
        "structural",
        "similarity",
        "kant",
        "three",
        "critique",
        "term",
        "immanent",
        "truth",
        "truth",
        "nothing",
        "accordance",
        "rule",
        "moral",
        "aesthetic",
        "truth",
        "way",
        "epistemic",
        "truth",
        "later",
        "text",
        "windelband",
        "describes",
        "unified",
        "project",
        "three",
        "critique",
        "term",
        "necessary",
        "universal",
        "relation",
        "thought",
        "object",
        "writes",
        "postulate",
        "practical",
        "reason",
        "relate",
        "intelligible",
        "object",
        "idea",
        "necessarily",
        "intuition",
        "category",
        "relate",
        "object",
        "experience",
        "teleological",
        "judgment",
        "construct",
        "purposive",
        "whole",
        "nature",
        "universally",
        "principle",
        "pure",
        "understanding",
        "apply",
        "category",
        "experience",
        "a",
        "formulation",
        "gloss",
        "nuance",
        "distinction",
        "constitutive",
        "regulative",
        "us",
        "reason",
        "windelband",
        "main",
        "intention",
        "giving",
        "detailed",
        "fully",
        "accurate",
        "reconstruction",
        "kant",
        "philosophy",
        "line",
        "famous",
        "dictum",
        "understanding",
        "kant",
        "mean",
        "go",
        "beyond",
        "iv",
        "instead",
        "seek",
        "revive",
        "critical",
        "project",
        "manner",
        "allows",
        "answer",
        "need",
        "time",
        "windelband",
        "think",
        "critical",
        "philosophy",
        "required",
        "time",
        "writing",
        "philosophy",
        "value",
        "reveals",
        "fundamental",
        "value",
        "epistemology",
        "ethic",
        "aesthetic"
    ]
}