{
    "main_text": "Wundt’s “individual psychology” || Consciousness\n4.2 Consciousness\n\nPsychology finds consciousness to be constituted of three major\nact-categories: representation, willing, and feeling; our discussion\nis limited to the first two. Now while Wundt is forced to speak of\nrepresentations and representational acts as distinct, he is\nnevertheless clear that they are merely different aspects of a single\nflowing process. This is his so-called theory of actuality\n(Aktualitätstheorie) (1911a: 145). Representations are\nrepresentational acts, never the “objects with constant\nproperties” propounded by adherents of a so-called theory of\nsubstantiality (Substantialitätstheorie) (1911a: 145).\nThis identity of representation and representational act typifies what\nwe may call Wundt’s “monistic\n perspectivism”.[29]\n Everywhere he insists that the “psychic processes form a\nunitary flow of events [einheitliches\n Geschehen[30]\n ]”, the constituents of which—“representing,\nfeeling, willing, etc.”—are “only differentiated\nthrough psychological analysis and abstraction” (1911a: 145).\nKeeping in mind the underlying active unity of the psychic, let us\nexamine some of Wundt’s “analyses and\nabstractions”.\n\nAs discussed in the previous section, all consciousness originates in\nsensations. These, however, are never given to consciousness in a\n“pure” state as individual sensory atoms, but are always\nperceived as already\n compounded[31]\n into representations (Vorstellungen), that is, into\n“images of an object or of a process in the external\nworld” (PP II: 3; 1). Representations may be either\nperceptions (Wahrnehmungen) or intuitions\n(Anschauungen): the same representation is called a\n“perception” if considered as the presentation of\nobjective reality, and an “intuition” if considered in\nterms of the accompanying conscious, subjective activity (PP\nII: 1). If the representation’s object is not real (cf.\nPP II: 479) but merely thought, then it is a so-called\nreproduced\n representation.[32]\n\nNow the formative process, by which sensations are connected\ninto representations either through temporal sequencing or spatial\nordering (PP II: 3), constitutes a main aspect of the\nactivity we call consciousness; the other is the “coming and\ngoing of [these] representations” (PP II: 256). On the\nevidence of “innumerable psychological\n facts”,[33]\n Wundt claims that all representations are formed through\n“psychological synthesis of sensations”, and that this\nsynthesis accompanies every representational act (PP II:\n256). We are therefore entitled to take the act of representational\nsynthesis as a “characteristic feature of consciousness\nitself” (PP II: 256). Although consciousness consists\nin the formation of representations, on the one hand, and of the\ncoming and going of such representations, on the other\nhand—i.e., although its contents are a continuous streaming of\nfusing and diffusing representations—yet it is not merely this\n(PP II: 256). We are also aware within our consciousness of\nanother activity operating upon our representations, namely of paying\nthem attention (PP II: 266).\n\nAttention may be understood in terms of the differing degrees to which\nrepresentations are present (gegenwärtig) in\nconsciousness. These varying degrees of presence correspond to the\nvarying degrees to which consciousness is “turned towards\n[zugewandt]” them (PP II: 267). Wundt appeals\nto an analogy:\n\n\nThis feature of consciousness can be clarified by that common image we\nuse in calling consciousness an inner vision. If we say that the\nrepresentations present [gegenwärtig] at a particular\nmoment are in consciousness’s field of vision\n[Blickfeld], then that part of the field upon which our\nattention is turned may be called the inner focal point of vision\n[Blickpunkt]. The entry of a representation into the field of\ninner vision we call “perception”, and its entry into the\nfocal point of vision we call “apperception”. (PP\nII: 267)\n\n\nThus consciousness is a function of the scope of attention, which may\nbe broader (as perception) or narrower (as\n apperception[34]\n ). Apperception, in turn, may either actively select and focus upon a\nperceived representation, or it may passively find certain\nrepresentations suddenly thrusting themselves into the center of\nattention (PP II: 267; 562). There is no distinct boundary\nbetween the perceived and the apperceived, and Wundt’s analogy\nmay be misleading (cf. esp. PP II: 268) to the extent that it\ngives the impression of two separable forms of attention able in\nprinciple to subsist together simultaneously (that is, apperception\nfocusing upon a point in the perceptual field while that field\ncontinues to be perceived). No: perceptive attention becomes\napperceptive attention just as it focuses more strenuously,\nconstricting the perceptive field. The more it contracts, the\n“brighter” the representation appears, now becoming the\nfocal point of apperception as the fringes of the perceptual field\nretreat into “darkness” (PP II: 268). For Wundt,\nthe distinguishing feature of the apperceptive focus is that it\n“always forms a unitary representation”, so that a\nnarrower focal point (or rather, the focal “field”\n[PP II: 268; 477]) results in a correspondingly higher\nintensity of attention (PP II: 269). Hence\n\n\nthe degree of apperception is not to be measured according to the\nstrength of the external impression [i.e. physically or\nphysiologically], but solely according to the subjective activity\nthrough which consciousness turns to a particular sense-stimulus.\n(PP II: 269)\n\n\nThus,\n apperception[35]\n is closely akin to the will, indeed is a primordial expression of\nwill: “the act of apperception in every case consists in an\ninner act of will [Willenshandlung]” (L I:\n34). By contrast, Wundt argues that the processes by which the\nrepresentations are themselves formed, fused, synthesized, and\n“delivered” into the perceptual field, are associative\nprocesses “independent of apperception” (PP II:\n278–9; 437, ff). Passive apperception may be characterized\nsimply by saying that here the associative form of representational\nconnection is predominant (cf. L I: 34), whereas when\n“the active apperception successively raises representations\ninto the focal field of consciousness”, this active\npassage of representations obeys the special laws of what Wundt calls\n“apperceptive connection” (PP II: 279). He does\nnot consider the types of association to be genuine psychological\nlaws, i.e. laws governing the “succession of\nrepresentations”, because they merely generate the\npossible kinds of representational compounds. It is\napperception, in accordance with its own laws, that\n“decides” which of these possible connections are realized\nin consciousness (L I: 34). We see here the important role\nplayed by his so-called\n voluntarism:[36]\n associationist psychologists, according to Wundt, cannot give an\naccount of the (subjective) activity that immediately\ncharacterizes consciousness (cf. Wundt 1911b: 721, ff.; Lipps 1903:\n202, ff.; cf. esp. L I: 33). Yet this is not to deny\nassociation of sensations altogether. Rather, it is to conceive of\nassociation as merely a subliminal process, the products of which,\nrepresentations, then become the actual objects of consciousness. Thus\nthe “apperceptive connections of representations presuppose the\nvarious types of association”, especially the associative\n fusion[37]\n of sensations into\n representations.[38]\n\nApperception operates according to its own peculiar laws (PP\nII: 470). These laws, like those of association, govern acts of\ncombination (Verbindung) and separation (Zerlegung).\nHow do apperceptive laws differ from those of association? Wundt\nwrites:\n\n\nAssociation everywhere gives the first impetus to [apperceptive]\ncombinations. Through association we combine, e.g., the\nrepresentations of a tower and of a\n church.[39]\n But no matter how familiar the coexistence of these representations\nmay be, mere association does not help us form the representation of a\nchurch-tower. For this latter representation does not contain the two\nconstitutive representations in a merely external coexistence; rather,\nin the [representation of the church-tower], the representation of the\nchurch has come to adhere [anhaften] to the representation of\nthe tower, more closely determining the latter. In this way, the\nagglutination of representations forms the first level of\napperceptive combination. (PP II: 476; on\n“agglutination of representations”, see also L I:\n38, f.)\n\n\nIt is on the basis of such “agglutinative”\nrepresentations, exhibiting characteristics essentially different from\ntheir constituents, that apperception continues to synthesize ever\nmore representations, a process resulting in their compression\n(Verdichtung) or displacement (Verschiebung)\n(PP II: 476–7; cf. L I: 43). The more the\noriginal associative or agglutinated representations are compressed or\ndisplaced, the more they disappear altogether from consciousness,\nleaving in their stead a single representation whose original\ncomposite structure has disappeared. This process, which Wundt calls\n“representational synthesis” proper, is reiterated at ever\nhigher levels until even the sensory foundation vanishes, as in the\ncase of abstract and symbolic concepts (L I: 39).\n\nApperception is not only a synthetic process; it is also governed by\nrules of separation. Apperceptive separation operates only upon the\nrepresentations already synthesized out of the “associative\nstock [Assoziationsvorrath]”, but does not necessarily\ndecompose them into their original parts (PP II: 478).\nWundt’s notion of apperceptive separation is one of the most\nphilosophically original, consequential, and ambiguous of his\ntheories. He argues that it is usually the case that\n\n\nthe original representational totality [ursprüngliche\nGesammtvorstellung] is present to our consciousness at first as\nan indistinct complex of individual representations. These individual\nparts and the manner of their connection become distinct only through\nthe separative activity of apperception. (PP II: 478)\n\n\nThus, conscious thought and judgment (on judgment, see SP I:\n34, ff., esp. 37, ff.) (separating and combining subject and\npredicate) is not, as may seem at first blush, an act of\n\n\ngathering together [representational] components and then fitting them\ntogether in the successive articulation of the total representation\n[Gesammtvorstellung]. (PP II: 478)\n\n\nRather, “the whole, albeit in an indistinct form, must have been\napperceived prior to its parts” (PP II: 478). Only in\nthis way can one explain the\n\n\nwell-known fact that we can easily and without trouble finish\n[composing] a complicated sentence-structure. This would be impossible\nif the whole had not been represented at the outset. The\naccomplishment of the judgment-function therefore consists, from the\npsychological point of view, only in our successively making clearer\nthe obscure outlines of the total picture [Gesammtbild], so\nthat at the end of the composite thought-act the whole, too, stands\nmore clearly before our consciousness. (PP II: 478)\n\n\nBecause according to Wundt’s principle of “actuality\n[Aktualität]” consciousness is purely an activity,\nit is impossible to render his theory in terms of\n“structures”. It consists in constantly interacting\nprocesses: on the one hand, there are associative processes\nthat fuse sensations into elemental representations. These stream into\nand thereby constitute a fluctuating field of attention:\nflowing and broad, it is called “perception;” ebbing and\nconcentrate, “apperception”. As an activity, attention is\nan expression of will; since consciousness just is attention in its\nshifting forms, it is the activity of will manifested in the\nselection, combination, and separation of disposable representations\n(PP II: 564). These representations are constantly\n“worked over” by apperception, which through its synthetic\nand diaeretic activity constructs them into ever “higher\ndevelopmental forms of consciousness”, such that in the end\ntheir origins in sensation and perception might be completely erased.\nIn other words, as the apperceptive activity becomes increasingly\nintense it seems as it were to rise above the field of perception,\nabove the field of its own constructs, becoming aware of itself as\npure activity, as pure self-consciousness:\n\n\nrooted in the constant activity [Wirksamkeit] of\napperception, [self-consciousness] … retreats completely into\napperception alone, so that, after the completion of the development\nof consciousness, the will appears as the only content of\nself-consciousness…. (PP II:\n 564)[40]\n\n\nThus the self as will appears to itself as independent from and\nopposed to an external world of both sensation and culture, though\nWundt hastens to add that this is but an illusion; in reality,\n“the abstract self-consciousness maintains constantly the full\nsensible background of the empirical self-consciousness”\n(PP II:\n 564).[41]\n",
    "section_title": "4.2 Consciousness",
    "entry_title": "Wilhelm Maximilian Wundt",
    "hierarchy_title": "Wilhelm Maximilian Wundt || Wundt’s “individual psychology” || Consciousness",
    "tokenized_text": [
        "wundt",
        "individual",
        "psychology",
        "consciousness",
        "consciousness",
        "psychology",
        "find",
        "consciousness",
        "constituted",
        "three",
        "major",
        "actcategories",
        "representation",
        "willing",
        "feeling",
        "discussion",
        "limited",
        "first",
        "two",
        "wundt",
        "forced",
        "speak",
        "representation",
        "representational",
        "act",
        "distinct",
        "nevertheless",
        "clear",
        "merely",
        "different",
        "aspect",
        "single",
        "flowing",
        "process",
        "socalled",
        "theory",
        "actuality",
        "aktualitätstheorie",
        "a",
        "representation",
        "representational",
        "act",
        "never",
        "object",
        "constant",
        "property",
        "propounded",
        "adherent",
        "socalled",
        "theory",
        "substantiality",
        "substantialitätstheorie",
        "a",
        "identity",
        "representation",
        "representational",
        "act",
        "typifies",
        "may",
        "call",
        "wundt",
        "monistic",
        "perspectivism",
        "everywhere",
        "insists",
        "psychic",
        "process",
        "form",
        "unitary",
        "flow",
        "event",
        "einheitliches",
        "geschehen",
        "constituent",
        "which",
        "representing",
        "feeling",
        "willing",
        "etc",
        "are",
        "differentiated",
        "psychological",
        "analysis",
        "abstraction",
        "a",
        "keeping",
        "mind",
        "underlying",
        "active",
        "unity",
        "psychic",
        "let",
        "u",
        "examine",
        "wundt",
        "analysis",
        "abstraction",
        "discussed",
        "previous",
        "section",
        "consciousness",
        "originates",
        "sensation",
        "however",
        "never",
        "given",
        "consciousness",
        "pure",
        "state",
        "individual",
        "sensory",
        "atom",
        "always",
        "perceived",
        "already",
        "compounded",
        "representation",
        "vorstellungen",
        "image",
        "object",
        "process",
        "external",
        "world",
        "pp",
        "ii",
        "representation",
        "may",
        "either",
        "perception",
        "wahrnehmungen",
        "intuition",
        "anschauungen",
        "representation",
        "called",
        "perception",
        "considered",
        "presentation",
        "objective",
        "reality",
        "intuition",
        "considered",
        "term",
        "accompanying",
        "conscious",
        "subjective",
        "activity",
        "pp",
        "ii",
        "representation",
        "object",
        "real",
        "cf",
        "pp",
        "ii",
        "merely",
        "thought",
        "socalled",
        "reproduced",
        "representation",
        "formative",
        "process",
        "sensation",
        "connected",
        "representation",
        "either",
        "temporal",
        "sequencing",
        "spatial",
        "ordering",
        "pp",
        "ii",
        "constitutes",
        "main",
        "aspect",
        "activity",
        "call",
        "consciousness",
        "coming",
        "going",
        "representation",
        "pp",
        "ii",
        "evidence",
        "innumerable",
        "psychological",
        "fact",
        "wundt",
        "claim",
        "representation",
        "formed",
        "psychological",
        "synthesis",
        "sensation",
        "synthesis",
        "accompanies",
        "every",
        "representational",
        "act",
        "pp",
        "ii",
        "therefore",
        "entitled",
        "take",
        "act",
        "representational",
        "synthesis",
        "characteristic",
        "feature",
        "consciousness",
        "pp",
        "ii",
        "although",
        "consciousness",
        "consists",
        "formation",
        "representation",
        "one",
        "hand",
        "coming",
        "going",
        "representation",
        "handie",
        "although",
        "content",
        "continuous",
        "streaming",
        "fusing",
        "diffusing",
        "representationsyet",
        "merely",
        "pp",
        "ii",
        "also",
        "aware",
        "within",
        "consciousness",
        "another",
        "activity",
        "operating",
        "upon",
        "representation",
        "namely",
        "paying",
        "attention",
        "pp",
        "ii",
        "attention",
        "may",
        "understood",
        "term",
        "differing",
        "degree",
        "representation",
        "present",
        "gegenwärtig",
        "consciousness",
        "varying",
        "degree",
        "presence",
        "correspond",
        "varying",
        "degree",
        "consciousness",
        "turned",
        "towards",
        "zugewandt",
        "pp",
        "ii",
        "wundt",
        "appeal",
        "analogy",
        "feature",
        "consciousness",
        "clarified",
        "common",
        "image",
        "use",
        "calling",
        "consciousness",
        "inner",
        "vision",
        "say",
        "representation",
        "present",
        "gegenwärtig",
        "particular",
        "moment",
        "consciousness",
        "field",
        "vision",
        "blickfeld",
        "part",
        "field",
        "upon",
        "attention",
        "turned",
        "may",
        "called",
        "inner",
        "focal",
        "point",
        "vision",
        "blickpunkt",
        "entry",
        "representation",
        "field",
        "inner",
        "vision",
        "call",
        "perception",
        "entry",
        "focal",
        "point",
        "vision",
        "call",
        "apperception",
        "pp",
        "ii",
        "thus",
        "consciousness",
        "function",
        "scope",
        "attention",
        "may",
        "broader",
        "perception",
        "narrower",
        "apperception",
        "apperception",
        "turn",
        "may",
        "either",
        "actively",
        "select",
        "focus",
        "upon",
        "perceived",
        "representation",
        "may",
        "passively",
        "find",
        "certain",
        "representation",
        "suddenly",
        "thrusting",
        "center",
        "attention",
        "pp",
        "ii",
        "distinct",
        "boundary",
        "perceived",
        "apperceived",
        "wundt",
        "analogy",
        "may",
        "misleading",
        "cf",
        "esp",
        "pp",
        "ii",
        "extent",
        "give",
        "impression",
        "two",
        "separable",
        "form",
        "attention",
        "able",
        "principle",
        "subsist",
        "together",
        "simultaneously",
        "apperception",
        "focusing",
        "upon",
        "point",
        "perceptual",
        "field",
        "field",
        "continues",
        "perceived",
        "perceptive",
        "attention",
        "becomes",
        "apperceptive",
        "attention",
        "focus",
        "strenuously",
        "constricting",
        "perceptive",
        "field",
        "contract",
        "brighter",
        "representation",
        "appears",
        "becoming",
        "focal",
        "point",
        "apperception",
        "fringe",
        "perceptual",
        "field",
        "retreat",
        "darkness",
        "pp",
        "ii",
        "wundt",
        "distinguishing",
        "feature",
        "apperceptive",
        "focus",
        "always",
        "form",
        "unitary",
        "representation",
        "narrower",
        "focal",
        "point",
        "rather",
        "focal",
        "field",
        "pp",
        "ii",
        "result",
        "correspondingly",
        "higher",
        "intensity",
        "attention",
        "pp",
        "ii",
        "hence",
        "degree",
        "apperception",
        "measured",
        "according",
        "strength",
        "external",
        "impression",
        "ie",
        "physically",
        "physiologically",
        "solely",
        "according",
        "subjective",
        "activity",
        "consciousness",
        "turn",
        "particular",
        "sensestimulus",
        "pp",
        "ii",
        "thus",
        "apperception",
        "closely",
        "akin",
        "indeed",
        "primordial",
        "expression",
        "act",
        "apperception",
        "every",
        "case",
        "consists",
        "inner",
        "act",
        "willenshandlung",
        "l",
        "contrast",
        "wundt",
        "argues",
        "process",
        "representation",
        "formed",
        "fused",
        "synthesized",
        "delivered",
        "perceptual",
        "field",
        "associative",
        "process",
        "independent",
        "apperception",
        "pp",
        "ii",
        "ff",
        "passive",
        "apperception",
        "may",
        "characterized",
        "simply",
        "saying",
        "associative",
        "form",
        "representational",
        "connection",
        "predominant",
        "cf",
        "l",
        "whereas",
        "active",
        "apperception",
        "successively",
        "raise",
        "representation",
        "focal",
        "field",
        "consciousness",
        "active",
        "passage",
        "representation",
        "obeys",
        "special",
        "law",
        "wundt",
        "call",
        "apperceptive",
        "connection",
        "pp",
        "ii",
        "consider",
        "type",
        "association",
        "genuine",
        "psychological",
        "law",
        "ie",
        "law",
        "governing",
        "succession",
        "representation",
        "merely",
        "generate",
        "possible",
        "kind",
        "representational",
        "compound",
        "apperception",
        "accordance",
        "law",
        "decides",
        "possible",
        "connection",
        "realized",
        "consciousness",
        "l",
        "see",
        "important",
        "role",
        "played",
        "socalled",
        "voluntarism",
        "associationist",
        "psychologist",
        "according",
        "wundt",
        "give",
        "account",
        "subjective",
        "activity",
        "immediately",
        "characterizes",
        "consciousness",
        "cf",
        "wundt",
        "b",
        "ff",
        "lipps",
        "ff",
        "cf",
        "esp",
        "l",
        "yet",
        "deny",
        "association",
        "sensation",
        "altogether",
        "rather",
        "conceive",
        "association",
        "merely",
        "subliminal",
        "process",
        "product",
        "representation",
        "become",
        "actual",
        "object",
        "consciousness",
        "thus",
        "apperceptive",
        "connection",
        "representation",
        "presuppose",
        "various",
        "type",
        "association",
        "especially",
        "associative",
        "fusion",
        "sensation",
        "representation",
        "apperception",
        "operates",
        "according",
        "peculiar",
        "law",
        "pp",
        "ii",
        "law",
        "like",
        "association",
        "govern",
        "act",
        "combination",
        "verbindung",
        "separation",
        "zerlegung",
        "apperceptive",
        "law",
        "differ",
        "association",
        "wundt",
        "writes",
        "association",
        "everywhere",
        "give",
        "first",
        "impetus",
        "apperceptive",
        "combination",
        "association",
        "combine",
        "eg",
        "representation",
        "tower",
        "church",
        "matter",
        "familiar",
        "coexistence",
        "representation",
        "may",
        "mere",
        "association",
        "help",
        "u",
        "form",
        "representation",
        "churchtower",
        "latter",
        "representation",
        "contain",
        "two",
        "constitutive",
        "representation",
        "merely",
        "external",
        "coexistence",
        "rather",
        "representation",
        "churchtower",
        "representation",
        "church",
        "come",
        "adhere",
        "anhaften",
        "representation",
        "tower",
        "closely",
        "determining",
        "latter",
        "way",
        "agglutination",
        "representation",
        "form",
        "first",
        "level",
        "apperceptive",
        "combination",
        "pp",
        "ii",
        "agglutination",
        "representation",
        "see",
        "also",
        "l",
        "f",
        "basis",
        "agglutinative",
        "representation",
        "exhibiting",
        "characteristic",
        "essentially",
        "different",
        "constituent",
        "apperception",
        "continues",
        "synthesize",
        "ever",
        "representation",
        "process",
        "resulting",
        "compression",
        "verdichtung",
        "displacement",
        "verschiebung",
        "pp",
        "ii",
        "cf",
        "l",
        "original",
        "associative",
        "agglutinated",
        "representation",
        "compressed",
        "displaced",
        "disappear",
        "altogether",
        "consciousness",
        "leaving",
        "stead",
        "single",
        "representation",
        "whose",
        "original",
        "composite",
        "structure",
        "disappeared",
        "process",
        "wundt",
        "call",
        "representational",
        "synthesis",
        "proper",
        "reiterated",
        "ever",
        "higher",
        "level",
        "even",
        "sensory",
        "foundation",
        "vanishes",
        "case",
        "abstract",
        "symbolic",
        "concept",
        "l",
        "apperception",
        "synthetic",
        "process",
        "also",
        "governed",
        "rule",
        "separation",
        "apperceptive",
        "separation",
        "operates",
        "upon",
        "representation",
        "already",
        "synthesized",
        "associative",
        "stock",
        "assoziationsvorrath",
        "necessarily",
        "decompose",
        "original",
        "part",
        "pp",
        "ii",
        "wundt",
        "notion",
        "apperceptive",
        "separation",
        "one",
        "philosophically",
        "original",
        "consequential",
        "ambiguous",
        "theory",
        "argues",
        "usually",
        "case",
        "original",
        "representational",
        "totality",
        "ursprüngliche",
        "gesammtvorstellung",
        "present",
        "consciousness",
        "first",
        "indistinct",
        "complex",
        "individual",
        "representation",
        "individual",
        "part",
        "manner",
        "connection",
        "become",
        "distinct",
        "separative",
        "activity",
        "apperception",
        "pp",
        "ii",
        "thus",
        "conscious",
        "thought",
        "judgment",
        "judgment",
        "see",
        "sp",
        "ff",
        "esp",
        "ff",
        "separating",
        "combining",
        "subject",
        "predicate",
        "may",
        "seem",
        "first",
        "blush",
        "act",
        "gathering",
        "together",
        "representational",
        "component",
        "fitting",
        "together",
        "successive",
        "articulation",
        "total",
        "representation",
        "gesammtvorstellung",
        "pp",
        "ii",
        "rather",
        "whole",
        "albeit",
        "indistinct",
        "form",
        "must",
        "apperceived",
        "prior",
        "part",
        "pp",
        "ii",
        "way",
        "one",
        "explain",
        "wellknown",
        "fact",
        "easily",
        "without",
        "trouble",
        "finish",
        "composing",
        "complicated",
        "sentencestructure",
        "would",
        "impossible",
        "whole",
        "represented",
        "outset",
        "accomplishment",
        "judgmentfunction",
        "therefore",
        "consists",
        "psychological",
        "point",
        "view",
        "successively",
        "making",
        "clearer",
        "obscure",
        "outline",
        "total",
        "picture",
        "gesammtbild",
        "end",
        "composite",
        "thoughtact",
        "whole",
        "stand",
        "clearly",
        "consciousness",
        "pp",
        "ii",
        "according",
        "wundt",
        "principle",
        "actuality",
        "aktualität",
        "consciousness",
        "purely",
        "activity",
        "impossible",
        "render",
        "theory",
        "term",
        "structure",
        "consists",
        "constantly",
        "interacting",
        "process",
        "one",
        "hand",
        "associative",
        "process",
        "fuse",
        "sensation",
        "elemental",
        "representation",
        "stream",
        "thereby",
        "constitute",
        "fluctuating",
        "field",
        "attention",
        "flowing",
        "broad",
        "called",
        "perception",
        "ebbing",
        "concentrate",
        "apperception",
        "activity",
        "attention",
        "expression",
        "since",
        "consciousness",
        "attention",
        "shifting",
        "form",
        "activity",
        "manifested",
        "selection",
        "combination",
        "separation",
        "disposable",
        "representation",
        "pp",
        "ii",
        "representation",
        "constantly",
        "worked",
        "apperception",
        "synthetic",
        "diaeretic",
        "activity",
        "construct",
        "ever",
        "higher",
        "developmental",
        "form",
        "consciousness",
        "end",
        "origin",
        "sensation",
        "perception",
        "might",
        "completely",
        "erased",
        "word",
        "apperceptive",
        "activity",
        "becomes",
        "increasingly",
        "intense",
        "seems",
        "rise",
        "field",
        "perception",
        "field",
        "construct",
        "becoming",
        "aware",
        "pure",
        "activity",
        "pure",
        "selfconsciousness",
        "rooted",
        "constant",
        "activity",
        "wirksamkeit",
        "apperception",
        "selfconsciousness",
        "retreat",
        "completely",
        "apperception",
        "alone",
        "completion",
        "development",
        "consciousness",
        "appears",
        "content",
        "selfconsciousness",
        "pp",
        "ii",
        "thus",
        "self",
        "appears",
        "independent",
        "opposed",
        "external",
        "world",
        "sensation",
        "culture",
        "though",
        "wundt",
        "hastens",
        "add",
        "illusion",
        "reality",
        "abstract",
        "selfconsciousness",
        "maintains",
        "constantly",
        "full",
        "sensible",
        "background",
        "empirical",
        "selfconsciousness",
        "pp",
        "ii"
    ]
}