{
    "main_text": "The Anthropological Side of Language Production and the Humboldtian Model of Communication; Laying the Basis of Modern Structural Linguistics\n7. Humboldtian and Cartesian Linguistics\n\nIf linguistic signs no longer function as instruments for\ncommunicating independently existing thoughts and ideas from one mind\nto another, as Descartes, his followers and the empiricists believed,\nthis raises the question of how individuals can communicate with each\nother through language, a question that becomes even more urgent if,\nas Humboldt maintained, states of consciousness cannot be transmitted\nfrom one individual to another at all, for “there can be nothing\nin our mind than that which is the result of its own activity”\n(eigne Thätigkeit) (GS Vol 5: 382). However, any\ncommunication between individuals presupposes a shared foundation:\n“We understand the word we hear only, because we could have said\nit ourselves” (GS Vol 5: 382). The words we hear and those that\nwe utter are the stimuli for our language capacity to generate\nparticipatory responses. However, shared language capacity and\nlinguistic competence cannot guarantee that one individual understands\nwhat the other is saying. Only through dialogue with the other can\nthey test their understanding, amend and correct it, if necessary.\nEvery understanding is therefore also a non-understanding, Humboldt\nargued. Thinking, in other words, is by its very nature tied to man’s\nsocial existence which means that it requires “a Thou that\ncorresponds to the I”. A concept, Humboldt argued, can attain\nits distinctness and clarity only through its being reflected back\nfrom the intellect of another person (einer fremden\nDenkkraft, GS Vol 5: 380) with language as the only mediator\nbetween one intellect and another. At this point it becomes evident\nhow radically Humboldt’s linguistic philosophy and his language\nstudies part company with the traditional Cartesian way of\nunderstanding language. There existed for him a communicative\nprototype of human speech that is embedded in the structure of\nlanguage itself manifesting itself in the different languages. This\n“prototype of all language” (Urtypus aller\nSprachen) finds expression through the personal pronoun, that is,\nby the differentiation between the second and the third person. All\nspeech is directed at someone and its structure cannot be understood\nby applying Cartesian grammatical analysis to it, because from a\nlogical and grammatical point of view, it makes no difference whether\nI use the first, second or third personal pronoun, when in each case\nthese pronouns function as the subject of a sentence. But for Humboldt\nI and he really are different entities, and with them, he argued, all\npossibilities are exhausted: because they constitute the I and the\nnot-I. Thou is also a not I but unlike he, not in the “sphere of\nall beings”, but rather in another sphere of common action and\ninteraction. In his empirical investigations Humboldt therefore paid\nspecial attention to the system of personal pronouns in a given\nlanguage because it was from there that one could reconstruct the\nspecific manifestation of the prototypal speech situation. Following\nthis line of research in his Academy addresses “On the Dual\nForm” (1827) and “On the Relationship of the Adverbs of\nPlace with the Pronoun in some Languages” (1829) Humboldt\nanalyzed several dozen languages of different language groups from\naround the globe. It is in these texts that the marriage of philosophy\nof language and empirical linguistics that characterizes his work, can\nbest be studied. \n\nCartesian linguistics is intimately connected with the notion of\nUniversal or Philosophical Grammar and, given its revival in Chomsky’s\ngenerative approach to language and his naming of Humboldt as one of\nhis immediate precursors, Humboldt’s relation to this tradition needs\nto be clarified. First of all, Humboldt was decidedly critical of all\nattempts to construct a system of Philosophical Grammar supposedly\nunderlying all natural languages, because it was patterned after the\nconcepts of Latin and French grammar and in practice had resulted in\nthe writing of grammars that violated the nature of the Non-European\nlanguages by forcing them into the procrustean bed of a Western\nsystem, whose categories were completely alien to their own inherent\nstructures (GS Vol 5: 355). He did not, however, reject the idea of\nlinguistic universals. On the contrary, these constituted the backbone\nof his concept of linguistic variety, the fact namely that each\nlanguage by its structure and formation was able to represent a\nspecific view of the world (Weltansicht). With Kant he\nbelieved in the universality of the mental structures and Kantian\ncategories represented for him the rules and the laws of thinking that\nwere ultimately responsible also for the rule systems that govern our\nlinguistic utterances. But he rejected the idea that these structures\nwere themselves already a kind of logical grammar from which a\nPhilosophical Grammar could directly be deduced. Therefore, the\ncomparative study of the languages required some new kind of Universal\nGrammar to serve as tertium comparationes for the linguist\nnot to lose himself in endless and aimless comparisons. Hence he\nreplaced the traditional principles with a radically different\nconception that he had derived from his work in comparative anatomy at\nJena in 1794: the notion of type, used first in his Plan for a\nComparative Anthropology of 1795 and which he now adapted to the\nstudy of language. As the title of his treatise Fundamentals of\nthe Linguistic Prototype (Grundzüge des allgemeinen\nSprachtypus) suggests, the term stands for the idea of a\nprototype of language, similar in concept to Goethe’s idea of a\nprotoplant (Urpflanze) which was not to be confused with a\nreal plant but instead embodied the essential features found in all\nexisting plants. But whereas Goethe’s Urpflanze was something\nquasi-real that could be perceived through one’s mental eyes, Goethe\nclaimed, Humboldt’s type is of a different\n nature[5]\n Since linguistic form is not something material or something\nabstracted from natural languages, but pertains to a\nVerrichtung (performance) namely the production of\nspeech, Humboldt’s prototype embodies the ensemble of elements and\nrule systems that must be considered common and essential for speech\nproduction in all languages (Verfahrensweise); in short, it\nis a generative rather than a substantive notion. Once established,\nthrough a combination of philosophical-methodological reflection and\nconcrete linguistic analysis, the linguistic prototype was to serve\nand did serve Humboldt as a guide and tertium comparationis\nfor the study and comparison of different languages and language\ngroups. In short, the prototype is not to be seen as an object, a list\nof specific surface structure features, nor does it resemble any\nexisting actual language, but instead stands for the communality of\nelements, rules, and structures that underlie all language production.\nFor example, the existence of phonetic elements in a given language,\nconstituting a sound system (Lautsystem) and its\nindividual word always combining a sound-unit with a thought-unit,\nmust be understood as part of the prototypal nature of language,\nwhereas the particular Lautsystem of that language as it\nresulted from its historical development becomes the subject of\nspecific linguistic investigations. \n\nSimilarly, but on a larger scale, Humboldt thought the investigation\nof individual languages and their specific form and character should\nbe guided by the linguist’s awareness of the prototypal element in\nthem while his work should also contribute to our knowledge of the\nprototype. The task of the linguist was therefore “to study each\nlanguage as a fragment of the universal language of the human\nspecies”, (“comme un fragment du langage\ngénéral du genre humain”) (Essai sur les\nlangues du Nouveau Continent in Stetter 2004: 238). Yet for\nHumboldt languages do not differ from each other as species\n(Gattungen) but as individuals; their character does not\npertain to the species but to them as individuals as conditioned by\nand as a result of their own specific historical development (GS Vol\n6: 150). The comparative study of the world’s languages, as Humboldt\nenvisioned it, thus represented a constant challenge to the empirical\nlinguist and to the philosopher; namely, to discover in the linguistic\ndata that which relates to the prototypal in language and to increase\nour knowledge of the nature of language and the human language\ncapacity. Furthermore, he saw the importance of linguistic studies\n(Sprachstudien) in the discovery of the part language plays\nin the formation and transmission of ideas (Vorstellungen)\nnot just in “the metaphysical sense” as conditioning the\ncreation of concepts, but also in the way in which an individual\nlanguage imparts its formative imprint on these concepts (GS Vol 6:\n147). \n\nThere are some critical distinctions that Humboldt employs in his\nlinguistic writings, which shed light on his understanding of language\nand the approach he follows in his empirical investigations. Most\nfamous (and often misunderstood) is his distinction between language\nperceived as product (Werk) or ergon on the one hand\nand as activity (Tätigkeit) or energeia on the\nother (Humboldt 1836: LVII). It is not identical with the distinction\nintroduced by Saussure between langue and parole,\nsince Humboldt’s distinction cuts across both langue and\nparole and both can be seen from the angle of either process\nor product. Because Humboldt perceived language not as a fixed entity\nor object, but as something transitory, something that is real only in\nthe moment of speaking, as an activity, he thought “its true\ndefinition can only be a genetic one” (Humboldt 1836: LVVII).\nThus he distinguished sharply (as did his contemporary Schleiermacher)\nbefore Saussure and twentieth-century linguistics, between language\n(Sprache) and Speech (Rede). In his French\nEssai of 1811 he also uses Saussure’s third term,\nlangage in a similar manner as pertaining to language in a\ngeneral sense. \n\nAlthough he developed almost single-handedly against the tenets of his\ntime and of most of the Nineteenth Century a structural approach for\nhis investigation of dozens of mostly non-European languages, Humboldt\ndid not consider the study of a language’s structure, its\nBau, the ultimate end of linguistics. Because language in its\nfullest sense occurs only in the societal context in its acts of\nspeech production and in what is being said through them, its true\nnature can only be intimated and perceived in living discourse\n(verbundener Rede) and should be studied equally in its\nlasting manifestations in the works of culture and of science, in\nliterature, poetry, and philosophy.\n\nA comprehensive account and just assessment of Humboldt’s achievements\nin philosophy of language and linguistics will become possible only as\nthe new complete edition of his Writings on Linguistics\n(Schriften zur Sprachwissenschaft), presently under way,\nbecomes\n available.[6]\n\n",
    "section_title": "7. Humboldtian and Cartesian Linguistics",
    "entry_title": "Wilhelm von Humboldt",
    "hierarchy_title": "Wilhelm von Humboldt || The Anthropological Side of Language Production and the Humboldtian Model of Communication; Laying the Basis of Modern Structural Linguistics",
    "tokenized_text": [
        "anthropological",
        "side",
        "language",
        "production",
        "humboldtian",
        "model",
        "communication",
        "laying",
        "basis",
        "modern",
        "structural",
        "linguistics",
        "humboldtian",
        "cartesian",
        "linguistics",
        "linguistic",
        "sign",
        "longer",
        "function",
        "instrument",
        "communicating",
        "independently",
        "existing",
        "thought",
        "idea",
        "one",
        "mind",
        "another",
        "descartes",
        "follower",
        "empiricist",
        "believed",
        "raise",
        "question",
        "individual",
        "communicate",
        "language",
        "question",
        "becomes",
        "even",
        "urgent",
        "humboldt",
        "maintained",
        "state",
        "consciousness",
        "transmitted",
        "one",
        "individual",
        "another",
        "nothing",
        "mind",
        "result",
        "activity",
        "eigne",
        "thätigkeit",
        "g",
        "vol",
        "however",
        "communication",
        "individual",
        "presupposes",
        "shared",
        "foundation",
        "understand",
        "word",
        "hear",
        "could",
        "said",
        "g",
        "vol",
        "word",
        "hear",
        "utter",
        "stimulus",
        "language",
        "capacity",
        "generate",
        "participatory",
        "response",
        "however",
        "shared",
        "language",
        "capacity",
        "linguistic",
        "competence",
        "guarantee",
        "one",
        "individual",
        "understands",
        "saying",
        "dialogue",
        "test",
        "understanding",
        "amend",
        "correct",
        "necessary",
        "every",
        "understanding",
        "therefore",
        "also",
        "nonunderstanding",
        "humboldt",
        "argued",
        "thinking",
        "word",
        "nature",
        "tied",
        "man",
        "social",
        "existence",
        "mean",
        "requires",
        "thou",
        "corresponds",
        "concept",
        "humboldt",
        "argued",
        "attain",
        "distinctness",
        "clarity",
        "reflected",
        "back",
        "intellect",
        "another",
        "person",
        "einer",
        "fremden",
        "denkkraft",
        "g",
        "vol",
        "language",
        "mediator",
        "one",
        "intellect",
        "another",
        "point",
        "becomes",
        "evident",
        "radically",
        "humboldt",
        "linguistic",
        "philosophy",
        "language",
        "study",
        "part",
        "company",
        "traditional",
        "cartesian",
        "way",
        "understanding",
        "language",
        "existed",
        "communicative",
        "prototype",
        "human",
        "speech",
        "embedded",
        "structure",
        "language",
        "manifesting",
        "different",
        "language",
        "prototype",
        "language",
        "urtypus",
        "aller",
        "sprachen",
        "find",
        "expression",
        "personal",
        "pronoun",
        "differentiation",
        "second",
        "third",
        "person",
        "speech",
        "directed",
        "someone",
        "structure",
        "understood",
        "applying",
        "cartesian",
        "grammatical",
        "analysis",
        "logical",
        "grammatical",
        "point",
        "view",
        "make",
        "difference",
        "whether",
        "use",
        "first",
        "second",
        "third",
        "personal",
        "pronoun",
        "case",
        "pronoun",
        "function",
        "subject",
        "sentence",
        "humboldt",
        "really",
        "different",
        "entity",
        "argued",
        "possibility",
        "exhausted",
        "constitute",
        "noti",
        "thou",
        "also",
        "unlike",
        "sphere",
        "being",
        "rather",
        "another",
        "sphere",
        "common",
        "action",
        "interaction",
        "empirical",
        "investigation",
        "humboldt",
        "therefore",
        "paid",
        "special",
        "attention",
        "system",
        "personal",
        "pronoun",
        "given",
        "language",
        "one",
        "could",
        "reconstruct",
        "specific",
        "manifestation",
        "prototypal",
        "speech",
        "situation",
        "following",
        "line",
        "research",
        "academy",
        "address",
        "dual",
        "form",
        "relationship",
        "adverb",
        "place",
        "pronoun",
        "language",
        "humboldt",
        "analyzed",
        "several",
        "dozen",
        "language",
        "different",
        "language",
        "group",
        "around",
        "globe",
        "text",
        "marriage",
        "philosophy",
        "language",
        "empirical",
        "linguistics",
        "characterizes",
        "work",
        "best",
        "studied",
        "cartesian",
        "linguistics",
        "intimately",
        "connected",
        "notion",
        "universal",
        "philosophical",
        "grammar",
        "given",
        "revival",
        "chomsky",
        "generative",
        "approach",
        "language",
        "naming",
        "humboldt",
        "one",
        "immediate",
        "precursor",
        "humboldt",
        "relation",
        "tradition",
        "need",
        "clarified",
        "first",
        "humboldt",
        "decidedly",
        "critical",
        "attempt",
        "construct",
        "system",
        "philosophical",
        "grammar",
        "supposedly",
        "underlying",
        "natural",
        "language",
        "patterned",
        "concept",
        "latin",
        "french",
        "grammar",
        "practice",
        "resulted",
        "writing",
        "grammar",
        "violated",
        "nature",
        "noneuropean",
        "language",
        "forcing",
        "procrustean",
        "bed",
        "western",
        "system",
        "whose",
        "category",
        "completely",
        "alien",
        "inherent",
        "structure",
        "g",
        "vol",
        "however",
        "reject",
        "idea",
        "linguistic",
        "universal",
        "contrary",
        "constituted",
        "backbone",
        "concept",
        "linguistic",
        "variety",
        "fact",
        "namely",
        "language",
        "structure",
        "formation",
        "able",
        "represent",
        "specific",
        "view",
        "world",
        "weltansicht",
        "kant",
        "believed",
        "universality",
        "mental",
        "structure",
        "kantian",
        "category",
        "represented",
        "rule",
        "law",
        "thinking",
        "ultimately",
        "responsible",
        "also",
        "rule",
        "system",
        "govern",
        "linguistic",
        "utterance",
        "rejected",
        "idea",
        "structure",
        "already",
        "kind",
        "logical",
        "grammar",
        "philosophical",
        "grammar",
        "could",
        "directly",
        "deduced",
        "therefore",
        "comparative",
        "study",
        "language",
        "required",
        "new",
        "kind",
        "universal",
        "grammar",
        "serve",
        "tertium",
        "comparationes",
        "linguist",
        "lose",
        "endless",
        "aimless",
        "comparison",
        "hence",
        "replaced",
        "traditional",
        "principle",
        "radically",
        "different",
        "conception",
        "derived",
        "work",
        "comparative",
        "anatomy",
        "jena",
        "notion",
        "type",
        "used",
        "first",
        "plan",
        "comparative",
        "anthropology",
        "adapted",
        "study",
        "language",
        "title",
        "treatise",
        "fundamental",
        "linguistic",
        "prototype",
        "grundzüge",
        "de",
        "allgemeinen",
        "sprachtypus",
        "suggests",
        "term",
        "stand",
        "idea",
        "prototype",
        "language",
        "similar",
        "concept",
        "goethe",
        "idea",
        "protoplant",
        "urpflanze",
        "confused",
        "real",
        "plant",
        "instead",
        "embodied",
        "essential",
        "feature",
        "found",
        "existing",
        "plant",
        "whereas",
        "goethe",
        "urpflanze",
        "something",
        "quasireal",
        "could",
        "perceived",
        "one",
        "mental",
        "eye",
        "goethe",
        "claimed",
        "humboldt",
        "type",
        "different",
        "nature",
        "since",
        "linguistic",
        "form",
        "something",
        "material",
        "something",
        "abstracted",
        "natural",
        "language",
        "pertains",
        "verrichtung",
        "performance",
        "namely",
        "production",
        "speech",
        "humboldt",
        "prototype",
        "embodies",
        "ensemble",
        "element",
        "rule",
        "system",
        "must",
        "considered",
        "common",
        "essential",
        "speech",
        "production",
        "language",
        "verfahrensweise",
        "short",
        "generative",
        "rather",
        "substantive",
        "notion",
        "established",
        "combination",
        "philosophicalmethodological",
        "reflection",
        "concrete",
        "linguistic",
        "analysis",
        "linguistic",
        "prototype",
        "serve",
        "serve",
        "humboldt",
        "guide",
        "tertium",
        "comparationis",
        "study",
        "comparison",
        "different",
        "language",
        "language",
        "group",
        "short",
        "prototype",
        "seen",
        "object",
        "list",
        "specific",
        "surface",
        "structure",
        "feature",
        "resemble",
        "existing",
        "actual",
        "language",
        "instead",
        "stand",
        "communality",
        "element",
        "rule",
        "structure",
        "underlie",
        "language",
        "production",
        "example",
        "existence",
        "phonetic",
        "element",
        "given",
        "language",
        "constituting",
        "sound",
        "system",
        "lautsystem",
        "individual",
        "word",
        "always",
        "combining",
        "soundunit",
        "thoughtunit",
        "must",
        "understood",
        "part",
        "prototypal",
        "nature",
        "language",
        "whereas",
        "particular",
        "lautsystem",
        "language",
        "resulted",
        "historical",
        "development",
        "becomes",
        "subject",
        "specific",
        "linguistic",
        "investigation",
        "similarly",
        "larger",
        "scale",
        "humboldt",
        "thought",
        "investigation",
        "individual",
        "language",
        "specific",
        "form",
        "character",
        "guided",
        "linguist",
        "awareness",
        "prototypal",
        "element",
        "work",
        "also",
        "contribute",
        "knowledge",
        "prototype",
        "task",
        "linguist",
        "therefore",
        "study",
        "language",
        "fragment",
        "universal",
        "language",
        "human",
        "specie",
        "comme",
        "un",
        "fragment",
        "du",
        "langage",
        "général",
        "du",
        "genre",
        "humain",
        "essai",
        "sur",
        "le",
        "langues",
        "du",
        "nouveau",
        "continent",
        "stetter",
        "yet",
        "humboldt",
        "language",
        "differ",
        "specie",
        "gattungen",
        "individual",
        "character",
        "pertain",
        "specie",
        "individual",
        "conditioned",
        "result",
        "specific",
        "historical",
        "development",
        "g",
        "vol",
        "comparative",
        "study",
        "world",
        "language",
        "humboldt",
        "envisioned",
        "thus",
        "represented",
        "constant",
        "challenge",
        "empirical",
        "linguist",
        "philosopher",
        "namely",
        "discover",
        "linguistic",
        "data",
        "relates",
        "prototypal",
        "language",
        "increase",
        "knowledge",
        "nature",
        "language",
        "human",
        "language",
        "capacity",
        "furthermore",
        "saw",
        "importance",
        "linguistic",
        "study",
        "sprachstudien",
        "discovery",
        "part",
        "language",
        "play",
        "formation",
        "transmission",
        "idea",
        "vorstellungen",
        "metaphysical",
        "sense",
        "conditioning",
        "creation",
        "concept",
        "also",
        "way",
        "individual",
        "language",
        "imparts",
        "formative",
        "imprint",
        "concept",
        "g",
        "vol",
        "critical",
        "distinction",
        "humboldt",
        "employ",
        "linguistic",
        "writing",
        "shed",
        "light",
        "understanding",
        "language",
        "approach",
        "follows",
        "empirical",
        "investigation",
        "famous",
        "often",
        "misunderstood",
        "distinction",
        "language",
        "perceived",
        "product",
        "werk",
        "ergon",
        "one",
        "hand",
        "activity",
        "tätigkeit",
        "energeia",
        "humboldt",
        "lvii",
        "identical",
        "distinction",
        "introduced",
        "saussure",
        "langue",
        "parole",
        "since",
        "humboldt",
        "distinction",
        "cut",
        "across",
        "langue",
        "parole",
        "seen",
        "angle",
        "either",
        "process",
        "product",
        "humboldt",
        "perceived",
        "language",
        "fixed",
        "entity",
        "object",
        "something",
        "transitory",
        "something",
        "real",
        "moment",
        "speaking",
        "activity",
        "thought",
        "true",
        "definition",
        "genetic",
        "one",
        "humboldt",
        "lvvii",
        "thus",
        "distinguished",
        "sharply",
        "contemporary",
        "schleiermacher",
        "saussure",
        "twentiethcentury",
        "linguistics",
        "language",
        "sprache",
        "speech",
        "rede",
        "french",
        "essai",
        "also",
        "us",
        "saussure",
        "third",
        "term",
        "langage",
        "similar",
        "manner",
        "pertaining",
        "language",
        "general",
        "sense",
        "although",
        "developed",
        "almost",
        "singlehandedly",
        "tenet",
        "time",
        "nineteenth",
        "century",
        "structural",
        "approach",
        "investigation",
        "dozen",
        "mostly",
        "noneuropean",
        "language",
        "humboldt",
        "consider",
        "study",
        "language",
        "structure",
        "bau",
        "ultimate",
        "end",
        "linguistics",
        "language",
        "fullest",
        "sense",
        "occurs",
        "societal",
        "context",
        "act",
        "speech",
        "production",
        "said",
        "true",
        "nature",
        "intimated",
        "perceived",
        "living",
        "discourse",
        "verbundener",
        "rede",
        "studied",
        "equally",
        "lasting",
        "manifestation",
        "work",
        "culture",
        "science",
        "literature",
        "poetry",
        "philosophy",
        "comprehensive",
        "account",
        "assessment",
        "humboldt",
        "achievement",
        "philosophy",
        "language",
        "linguistics",
        "become",
        "possible",
        "new",
        "complete",
        "edition",
        "writing",
        "linguistics",
        "schriften",
        "zur",
        "sprachwissenschaft",
        "presently",
        "way",
        "becomes",
        "available"
    ]
}