{
    "main_text": "The Soul || The Powers Characteristic of the Human Soul\n7.7 The Powers Characteristic of the Human Soul\n\nCharacteristic of human souls, or human beings, are the intellective\nand motive powers, that is to say, the intellect and will. William\nthinks that of these, the will is by far the more noble power, and he\nis accordingly puzzled by the fact that neither Aristotle nor Avicenna\nhave much to say about it. These authors do, however, discuss the\nintellective power at great length, and William accordingly devotes\nconsiderable attention to combating errors he sees in their teachings\non the intellect.\n7.7.1 The Motive Power: the Will\n\nWilliam develops his account of the will using the metaphor of a king\nin his kingdom. The will “holds the position in the whole human\nbeing and in the human soul of an emperor and king,” while\n“the intellective or rational power holds the place and function\nof counselor in the kingdom of the human soul” (OO II suppl.\n95a; Teske 2000, 126, 129). William treats acts of\nwill—expressed in the indicative mood by “I will”\n(volo) or “I refuse” (nolo)—as a\nkind of command that cannot be disobeyed, as distinguished from mere\nlikings expressed in the form “I would like”\n(vellem) or “I would rather not’\n(nollem). He holds that as a king must understand in order to\nmake use of his counselors’ advice, so the will must not simply\nbe an appetitive power but must also have its own capacity to\napprehend. Likewise, the intellect must have its own desires. But he\nnotes in On Virtues, that like a king the will need not heed\nthe advice of its counselor; it may instead “give itself over to\nthe advice of its slaves, that is, the inner powers and the\nsenses”; in so doing it “gives itself over into becoming a\nslave of its slaves and is like a king … who follows the will\nand advice of senseless children” (OO I, 122a).\n\nWilliam frequently emphasizes the difference between voluntary action\nand the actions of brute animals. Animals operate in a\n“servile” manner, in the sense that they respond to their\npassions without having control over these responses. A human being,\nin contrast, has power over the suggestion of its desires; its will is\n“most free and is in every way in its own power and\ndominion” (OO II suppl., 94a; Teske 2000, 123). This is why\nhuman beings, unlike animals, can be imputed with blame or merit for\ntheir deeds.\n\nAccording to William, the freedom of the will consists in the fact\nthat the will “can neither be forced in any way to its proper\nand first operation, which is to will or refuse, nor prevented from\nthe same; and I mean that it is not possible for someone to will\nsomething and entirely refuse that he will it or to refuse to will\nsomething, entirely willing that he will it” (OO I, 957aA). In\nother words, William defines force and prevention of the will in terms\nof higher-order volitions and refusals: for the will to be forced is\nfor it to refuse to will X and nonetheless be made to will\nX, and for it to be prevented is for it to will to will\nX and be made to refuse X. In a number of works,\nWilliam argues that neither force nor prevention of the will is\npossible: if someone refuses to will X, this must be because\nhe takes X to be bad and thus he must refuse X\nrather than will it; and if someone wills to will X, this\nmust be because he takes X to be good, and thus he must will\nX rather than refuse it.\n7.7.2 The Intellective Power\n\nWilliam’s discussions of the intellective power are driven by a\nconcern to attack errors he sees in his contemporaries and Greek and\nIslamic thinkers. While his reasons for rejecting these errors are\nclear enough, if at times based on a confused understanding of his\nsources, his own views on the nature of cognition are less well\ndeveloped. Yet it is clear that, with the exception of our knowledge\nof first principles and the concepts they involve and certain cases of\nsupernaturally revealed knowledge, William wishes to present a\nnaturalistic account of cognition in this life in which God plays no\nspecial role.\n\nIn both On the Soul and On the Universe William\nattacks at length theories of cognition that posit an agent intellect\n(intellectus agens) or agent intelligence (intelligentia\nagens). He incorrectly ascribes the latter theory to Aristotle,\nalthough in fact it is Avicenna’s teaching; he ascribes the\nformer theory to certain unnamed contemporaries. These theories view\ncognition as involving the active impression of intelligible signs or\nforms—what we might call concepts—on a receptive or\npassive recipient. The agent intellect or agent intelligence is taken\nto perform this function of impressing intelligible forms on our\nmaterial intellect, which is so-called because like matter it is\nreceptive of forms, albeit intelligible forms. The chief difference\nbetween the agent intellect and agent intelligence, as far as the\ntheory of cognition is concerned, is that the former is treated as a\npart of the human soul, while the latter is taken to be a spiritual\nsubstance apart from the human soul, identified with Avicenna’s\ntenth intelligence. William notes how the agent intellect or agent\nintelligence is viewed by analogy with light or the sun; as light or\nthe sun through its light serves to render actual merely potentially\nexisting colors, so the agent intellect or intelligence serves to\nrender actual intelligible forms existing potentially in the material\nintellect.\n\nWilliam as usual offers a large number of objections to these\ntheories. He attacks as inappropriate the analogies with light or the\nsun, and argues that the theory of the agent and material intellects\nis incompatible with the simplicity of the soul, as it posits these\nintellects as two distinct parts of the soul, one active and one\nreceptive. In the case of both the agent intellect and the agent\nintelligence, he argues that their proponents will be forced to hold\nthe absurd result that human beings know everything that is naturally\nknowable, whereas in fact we must study and learn and observe in order\nto acquire much of our knowledge.\n\nAs for his own views on the intellective power, William holds that,\nlike all the powers of the soul, the intellective power in the present\nlife of misery has been corrupted. Therefore an account of it must\ndistinguish its operation in its pure, uncorrupted state from its\noperation in the present life. In its pure state it is capable of\nknowing, without reliance on the senses, everything naturally\nknowable, even sensible things, and thus presumably also is capable of\npossessing the concepts in terms of which such knowledge is\nformulated. In its present state, however, most of its knowledge and\nrepertoire of concepts stems in some manner from sense experience.\n\nThe knowledge of which the intellective power is naturally capable\nextends not just to universals, but also to singulars. For the\nintellect is naturally directed at the true as the will is at the\ngood, and has as its end knowledge of the first truth, the creator,\nwho is singular. William also notes our knowledge of ourselves and the\nimportance of singular knowledge for our dealings with the world.\nUnfortunately, he provides no theory of the nature of singular\ncognition, and this issue must be left on the agenda until taken up by\nthinkers such as Scotus and Ockham in the late thirteenth and early\nfourteenth centuries.\n\nWilliam proposes a representationalist theory of cognition. He holds\nthat it is not things or states of affairs themselves that are in the\nintellective power but rather signs or intelligible forms that serve\nto represent them. He takes these signs to be mental habits, that is\nto say, not bare potentialities but potentialities most ready to be\nactualized. Propositions are those complexes formed from signs through\nwhich states of affairs are represented to the mind. Although William\nspeaks of these signs as likenesses, he is well aware of the\ndifficulty in thinking of concepts as such, and he concludes that in\nfact there need not be a likeness between a sign and that of which it\nis a sign (OO II suppl. 214b; Teske 2000, 454).\n\nA key question William confronts is how we acquire concepts and\nknowledge in the present life. In On the Soul he draws an\nimportant distinction. In the case of the first rules of truth and\nmorality, he speaks of God as a mirror or book of all truths in which\nhuman beings naturally and without an intermediary, and thus without\nreliance on sense experience, read these rules. Likewise, God\nimpresses or inscribes on our intellective power the intelligible\nsigns in terms of which these first rules or principles are\nformulated. Thus, William posits at least some innate concepts; he\nnotes, for example, in On Virtues and Morals  that the\nconcept of the true (veri) is innate (OO I, 124a). God also\nreveals to some prophets in this life “hidden objects of\nknowledge to which the created intellect cannot attain except by the\ngift and grace of divine revelation” (OO II suppl., 211b; Teske\n2000, 445).\n\nDoes William therefore hold, as some have held (Gilson 1926), that at\nleast in the case of these rules God in some special manner\nilluminates the human intellect? This might be suggested by his\nreferences to the intellective power as spiritual vision and his\nfrequent use of the language of vision and illumination in his\naccounts of cognition. And yet, according to William, the first rules\nof truth and morality are “known through themselves” or\nself-evident. They are “lights in themselves … visible\nthrough themselves without the help of something else” (OO II\nsuppl., 210b; Teske 2000, 443), and they serve to illuminate to the\nintellect the conclusions drawn from them. God’s role, it would\nseem, is to impress upon or supply to our intellect, in some way,\nthese principles, but William gives no indication that he takes God to\nshed a special light on these principles in order that they may be\nknown: once possessed they are, as it were, self illuminating.\n\nThe first rules of truth and morality and the concepts in terms of\nwhich they are formulated form only a small subset, however, of our\ncognitive repertoire. The remainder of our concepts and knowledge,\nleaving to one side the special divine revelation made to prophets,\nstems in some way from our dealings with the sensible world. But the\nproblem William faces is to explain how this is so. The problem, he\nsays, is that “sensation … brings to the intellect\nsensible substances and intellectual ones united to bodies [i.e.,\nsouls]. But it does not imprint [pingit] upon it their\nintelligible forms, because it does not receive such forms of\nthem” (OO II suppl., 213a; Teske 2000, 449).\n\nWilliam’s response to this problem is to hold that the senses\nhave the role simply of stimulating the intellective power in such a\nway that it “forms on its own and in itself intelligible forms\nfor itself” (OO I, 914b), a doctrine he draws from Augustine.\nAccording to this account, the intellect is fundamentally active in\nthe acquisition of intelligible forms. William speaks of the intellect\nas able, under the prompting of the senses, to consider the substances\nthat underlie sensible accidents, and speaks of the intellect as\n“abstracting” from sense experience in the sense that it\nforms concepts of so-called “vague individuals” by\nstripping away perceptible features that serve to distinguish one\nindividual from another. In these cases, William says, “the\nintellect is occasionally inscribed by these forms that are more\nseparate and more appropriate to its nature” (OO II suppl.,\n213b; Teske 2000, 450).\n\nA third cognitive process William mentions, conjunction or connection,\nis concerned not with the acquisition of intelligible forms, but\nrather with how knowledge of one thing brings with it knowledge of\nanother. In particular, William argues that knowledge of a cause\nbrings with it knowledge of the effect.\n\nWilliam is particularly concerned, however, that his account of the\nintellect’s generation of intelligible forms will require a\ndivision of the intellect into active and passive parts—the very\ndistinction between an agent and material or receptive intellect he\nhas devoted so much energy to attacking. The need to make this\ndivision of the intellect into two part is because it is impossible\nfor the same thing to be both active and passive in the same respect,\nand yet in treating the intellect as indivisible it looks as though\nWilliam is in fact committed to its being both active and passive in\nthe same respect in the formation and reception of intelligible\nforms.\n\nWilliam’s attempts to resolve this problem are repeated in a\nnumber of works and couched in highly metaphorical language that poses\nsevere problems of interpretation. The intellective power is both\n“a riverbed and fountain of the scientific and sapiential waters\n… Hence, in one respect it overflows and shines forth on\nitself, and in another respect it receives such outpouring or\nradiance” (OO II, suppl. 216b; Teske 2000, 457). William holds\nthat because on this account the intellective power is not active and\npassive in the same respect, he is not forced to divide the\nintellect into two distinct parts, one active and one passive.\n",
    "section_title": "7.7 The Powers Characteristic of the Human Soul",
    "entry_title": "William of Auvergne",
    "hierarchy_title": "William of Auvergne || The Soul || The Powers Characteristic of the Human Soul",
    "tokenized_text": [
        "soul",
        "power",
        "characteristic",
        "human",
        "soul",
        "power",
        "characteristic",
        "human",
        "soul",
        "characteristic",
        "human",
        "soul",
        "human",
        "being",
        "intellective",
        "motive",
        "power",
        "say",
        "intellect",
        "william",
        "think",
        "far",
        "noble",
        "power",
        "accordingly",
        "puzzled",
        "fact",
        "neither",
        "aristotle",
        "avicenna",
        "much",
        "say",
        "author",
        "however",
        "discus",
        "intellective",
        "power",
        "great",
        "length",
        "william",
        "accordingly",
        "devotes",
        "considerable",
        "attention",
        "combating",
        "error",
        "see",
        "teaching",
        "intellect",
        "motive",
        "power",
        "william",
        "develops",
        "account",
        "using",
        "metaphor",
        "king",
        "kingdom",
        "hold",
        "position",
        "whole",
        "human",
        "human",
        "soul",
        "emperor",
        "king",
        "intellective",
        "rational",
        "power",
        "hold",
        "place",
        "function",
        "counselor",
        "kingdom",
        "human",
        "soul",
        "oo",
        "ii",
        "suppl",
        "a",
        "teske",
        "william",
        "treat",
        "act",
        "willexpressed",
        "indicative",
        "mood",
        "volo",
        "refuse",
        "nolo",
        "as",
        "kind",
        "command",
        "disobeyed",
        "distinguished",
        "mere",
        "liking",
        "expressed",
        "form",
        "would",
        "like",
        "vellem",
        "would",
        "rather",
        "nollem",
        "hold",
        "king",
        "must",
        "understand",
        "order",
        "make",
        "use",
        "counselor",
        "advice",
        "must",
        "simply",
        "appetitive",
        "power",
        "must",
        "also",
        "capacity",
        "apprehend",
        "likewise",
        "intellect",
        "must",
        "desire",
        "note",
        "virtue",
        "like",
        "king",
        "need",
        "heed",
        "advice",
        "counselor",
        "may",
        "instead",
        "give",
        "advice",
        "slave",
        "inner",
        "power",
        "sens",
        "give",
        "becoming",
        "slave",
        "slave",
        "like",
        "king",
        "follows",
        "advice",
        "senseless",
        "child",
        "oo",
        "a",
        "william",
        "frequently",
        "emphasizes",
        "difference",
        "voluntary",
        "action",
        "action",
        "brute",
        "animal",
        "animal",
        "operate",
        "servile",
        "manner",
        "sense",
        "respond",
        "passion",
        "without",
        "control",
        "response",
        "human",
        "contrast",
        "power",
        "suggestion",
        "desire",
        "free",
        "every",
        "way",
        "power",
        "dominion",
        "oo",
        "ii",
        "suppl",
        "a",
        "teske",
        "human",
        "being",
        "unlike",
        "animal",
        "imputed",
        "blame",
        "merit",
        "deed",
        "according",
        "william",
        "freedom",
        "consists",
        "fact",
        "neither",
        "forced",
        "way",
        "proper",
        "first",
        "operation",
        "refuse",
        "prevented",
        "mean",
        "possible",
        "someone",
        "something",
        "entirely",
        "refuse",
        "refuse",
        "something",
        "entirely",
        "willing",
        "oo",
        "aa",
        "word",
        "william",
        "defines",
        "force",
        "prevention",
        "term",
        "higherorder",
        "volition",
        "refusal",
        "forced",
        "refuse",
        "x",
        "nonetheless",
        "made",
        "x",
        "prevented",
        "x",
        "made",
        "refuse",
        "x",
        "number",
        "work",
        "william",
        "argues",
        "neither",
        "force",
        "prevention",
        "possible",
        "someone",
        "refuse",
        "x",
        "must",
        "take",
        "x",
        "bad",
        "thus",
        "must",
        "refuse",
        "x",
        "rather",
        "someone",
        "will",
        "x",
        "must",
        "take",
        "x",
        "good",
        "thus",
        "must",
        "x",
        "rather",
        "refuse",
        "intellective",
        "power",
        "william",
        "discussion",
        "intellective",
        "power",
        "driven",
        "concern",
        "attack",
        "error",
        "see",
        "contemporary",
        "greek",
        "islamic",
        "thinker",
        "reason",
        "rejecting",
        "error",
        "clear",
        "enough",
        "time",
        "based",
        "confused",
        "understanding",
        "source",
        "view",
        "nature",
        "cognition",
        "le",
        "well",
        "developed",
        "yet",
        "clear",
        "exception",
        "knowledge",
        "first",
        "principle",
        "concept",
        "involve",
        "certain",
        "case",
        "supernaturally",
        "revealed",
        "knowledge",
        "william",
        "wish",
        "present",
        "naturalistic",
        "account",
        "cognition",
        "life",
        "god",
        "play",
        "special",
        "role",
        "soul",
        "universe",
        "william",
        "attack",
        "length",
        "theory",
        "cognition",
        "posit",
        "agent",
        "intellect",
        "intellectus",
        "agens",
        "agent",
        "intelligence",
        "intelligentia",
        "agens",
        "incorrectly",
        "ascribes",
        "latter",
        "theory",
        "aristotle",
        "although",
        "fact",
        "avicenna",
        "teaching",
        "ascribes",
        "former",
        "theory",
        "certain",
        "unnamed",
        "contemporary",
        "theory",
        "view",
        "cognition",
        "involving",
        "active",
        "impression",
        "intelligible",
        "sign",
        "formswhat",
        "might",
        "call",
        "conceptson",
        "receptive",
        "passive",
        "recipient",
        "agent",
        "intellect",
        "agent",
        "intelligence",
        "taken",
        "perform",
        "function",
        "impressing",
        "intelligible",
        "form",
        "material",
        "intellect",
        "socalled",
        "like",
        "matter",
        "receptive",
        "form",
        "albeit",
        "intelligible",
        "form",
        "chief",
        "difference",
        "agent",
        "intellect",
        "agent",
        "intelligence",
        "far",
        "theory",
        "cognition",
        "concerned",
        "former",
        "treated",
        "part",
        "human",
        "soul",
        "latter",
        "taken",
        "spiritual",
        "substance",
        "apart",
        "human",
        "soul",
        "identified",
        "avicenna",
        "tenth",
        "intelligence",
        "william",
        "note",
        "agent",
        "intellect",
        "agent",
        "intelligence",
        "viewed",
        "analogy",
        "light",
        "sun",
        "light",
        "sun",
        "light",
        "serf",
        "render",
        "actual",
        "merely",
        "potentially",
        "existing",
        "color",
        "agent",
        "intellect",
        "intelligence",
        "serf",
        "render",
        "actual",
        "intelligible",
        "form",
        "existing",
        "potentially",
        "material",
        "intellect",
        "william",
        "usual",
        "offer",
        "large",
        "number",
        "objection",
        "theory",
        "attack",
        "inappropriate",
        "analogy",
        "light",
        "sun",
        "argues",
        "theory",
        "agent",
        "material",
        "intellect",
        "incompatible",
        "simplicity",
        "soul",
        "posit",
        "intellect",
        "two",
        "distinct",
        "part",
        "soul",
        "one",
        "active",
        "one",
        "receptive",
        "case",
        "agent",
        "intellect",
        "agent",
        "intelligence",
        "argues",
        "proponent",
        "forced",
        "hold",
        "absurd",
        "result",
        "human",
        "being",
        "know",
        "everything",
        "naturally",
        "knowable",
        "whereas",
        "fact",
        "must",
        "study",
        "learn",
        "observe",
        "order",
        "acquire",
        "much",
        "knowledge",
        "view",
        "intellective",
        "power",
        "william",
        "hold",
        "like",
        "power",
        "soul",
        "intellective",
        "power",
        "present",
        "life",
        "misery",
        "corrupted",
        "therefore",
        "account",
        "must",
        "distinguish",
        "operation",
        "pure",
        "uncorrupted",
        "state",
        "operation",
        "present",
        "life",
        "pure",
        "state",
        "capable",
        "knowing",
        "without",
        "reliance",
        "sens",
        "everything",
        "naturally",
        "knowable",
        "even",
        "sensible",
        "thing",
        "thus",
        "presumably",
        "also",
        "capable",
        "possessing",
        "concept",
        "term",
        "knowledge",
        "formulated",
        "present",
        "state",
        "however",
        "knowledge",
        "repertoire",
        "concept",
        "stem",
        "manner",
        "sense",
        "experience",
        "knowledge",
        "intellective",
        "power",
        "naturally",
        "capable",
        "extends",
        "universal",
        "also",
        "singular",
        "intellect",
        "naturally",
        "directed",
        "true",
        "good",
        "end",
        "knowledge",
        "first",
        "truth",
        "creator",
        "singular",
        "william",
        "also",
        "note",
        "knowledge",
        "importance",
        "singular",
        "knowledge",
        "dealing",
        "world",
        "unfortunately",
        "provides",
        "theory",
        "nature",
        "singular",
        "cognition",
        "issue",
        "must",
        "left",
        "agenda",
        "taken",
        "thinker",
        "scotus",
        "ockham",
        "late",
        "thirteenth",
        "early",
        "fourteenth",
        "century",
        "william",
        "proposes",
        "representationalist",
        "theory",
        "cognition",
        "hold",
        "thing",
        "state",
        "affair",
        "intellective",
        "power",
        "rather",
        "sign",
        "intelligible",
        "form",
        "serve",
        "represent",
        "take",
        "sign",
        "mental",
        "habit",
        "say",
        "bare",
        "potentiality",
        "potentiality",
        "ready",
        "actualized",
        "proposition",
        "complex",
        "formed",
        "sign",
        "state",
        "affair",
        "represented",
        "mind",
        "although",
        "william",
        "speaks",
        "sign",
        "likeness",
        "well",
        "aware",
        "difficulty",
        "thinking",
        "concept",
        "concludes",
        "fact",
        "need",
        "likeness",
        "sign",
        "sign",
        "oo",
        "ii",
        "suppl",
        "b",
        "teske",
        "key",
        "question",
        "william",
        "confronts",
        "acquire",
        "concept",
        "knowledge",
        "present",
        "life",
        "soul",
        "draw",
        "important",
        "distinction",
        "case",
        "first",
        "rule",
        "truth",
        "morality",
        "speaks",
        "god",
        "mirror",
        "book",
        "truth",
        "human",
        "being",
        "naturally",
        "without",
        "intermediary",
        "thus",
        "without",
        "reliance",
        "sense",
        "experience",
        "read",
        "rule",
        "likewise",
        "god",
        "impress",
        "inscribes",
        "intellective",
        "power",
        "intelligible",
        "sign",
        "term",
        "first",
        "rule",
        "principle",
        "formulated",
        "thus",
        "william",
        "posit",
        "least",
        "innate",
        "concept",
        "note",
        "example",
        "virtue",
        "moral",
        "concept",
        "true",
        "veri",
        "innate",
        "oo",
        "a",
        "god",
        "also",
        "reveals",
        "prophet",
        "life",
        "hidden",
        "object",
        "knowledge",
        "created",
        "intellect",
        "attain",
        "except",
        "gift",
        "grace",
        "divine",
        "revelation",
        "oo",
        "ii",
        "suppl",
        "b",
        "teske",
        "william",
        "therefore",
        "hold",
        "held",
        "gilson",
        "least",
        "case",
        "rule",
        "god",
        "special",
        "manner",
        "illuminates",
        "human",
        "intellect",
        "might",
        "suggested",
        "reference",
        "intellective",
        "power",
        "spiritual",
        "vision",
        "frequent",
        "use",
        "language",
        "vision",
        "illumination",
        "account",
        "cognition",
        "yet",
        "according",
        "william",
        "first",
        "rule",
        "truth",
        "morality",
        "known",
        "selfevident",
        "light",
        "visible",
        "without",
        "help",
        "something",
        "else",
        "oo",
        "ii",
        "suppl",
        "b",
        "teske",
        "serve",
        "illuminate",
        "intellect",
        "conclusion",
        "drawn",
        "god",
        "role",
        "would",
        "seem",
        "impress",
        "upon",
        "supply",
        "intellect",
        "way",
        "principle",
        "william",
        "give",
        "indication",
        "take",
        "god",
        "shed",
        "special",
        "light",
        "principle",
        "order",
        "may",
        "known",
        "possessed",
        "self",
        "illuminating",
        "first",
        "rule",
        "truth",
        "morality",
        "concept",
        "term",
        "formulated",
        "form",
        "small",
        "subset",
        "however",
        "cognitive",
        "repertoire",
        "remainder",
        "concept",
        "knowledge",
        "leaving",
        "one",
        "side",
        "special",
        "divine",
        "revelation",
        "made",
        "prophet",
        "stem",
        "way",
        "dealing",
        "sensible",
        "world",
        "problem",
        "william",
        "face",
        "explain",
        "problem",
        "say",
        "sensation",
        "brings",
        "intellect",
        "sensible",
        "substance",
        "intellectual",
        "one",
        "united",
        "body",
        "ie",
        "soul",
        "imprint",
        "pingit",
        "upon",
        "intelligible",
        "form",
        "receive",
        "form",
        "oo",
        "ii",
        "suppl",
        "a",
        "teske",
        "william",
        "response",
        "problem",
        "hold",
        "sens",
        "role",
        "simply",
        "stimulating",
        "intellective",
        "power",
        "way",
        "form",
        "intelligible",
        "form",
        "oo",
        "b",
        "doctrine",
        "draw",
        "augustine",
        "according",
        "account",
        "intellect",
        "fundamentally",
        "active",
        "acquisition",
        "intelligible",
        "form",
        "william",
        "speaks",
        "intellect",
        "able",
        "prompting",
        "sens",
        "consider",
        "substance",
        "underlie",
        "sensible",
        "accident",
        "speaks",
        "intellect",
        "abstracting",
        "sense",
        "experience",
        "sense",
        "form",
        "concept",
        "socalled",
        "vague",
        "individual",
        "stripping",
        "away",
        "perceptible",
        "feature",
        "serve",
        "distinguish",
        "one",
        "individual",
        "another",
        "case",
        "william",
        "say",
        "intellect",
        "occasionally",
        "inscribed",
        "form",
        "separate",
        "appropriate",
        "nature",
        "oo",
        "ii",
        "suppl",
        "b",
        "teske",
        "third",
        "cognitive",
        "process",
        "william",
        "mention",
        "conjunction",
        "connection",
        "concerned",
        "acquisition",
        "intelligible",
        "form",
        "rather",
        "knowledge",
        "one",
        "thing",
        "brings",
        "knowledge",
        "another",
        "particular",
        "william",
        "argues",
        "knowledge",
        "cause",
        "brings",
        "knowledge",
        "effect",
        "william",
        "particularly",
        "concerned",
        "however",
        "account",
        "intellect",
        "generation",
        "intelligible",
        "form",
        "require",
        "division",
        "intellect",
        "active",
        "passive",
        "partsthe",
        "distinction",
        "agent",
        "material",
        "receptive",
        "intellect",
        "devoted",
        "much",
        "energy",
        "attacking",
        "need",
        "make",
        "division",
        "intellect",
        "two",
        "part",
        "impossible",
        "thing",
        "active",
        "passive",
        "respect",
        "yet",
        "treating",
        "intellect",
        "indivisible",
        "look",
        "though",
        "william",
        "fact",
        "committed",
        "active",
        "passive",
        "respect",
        "formation",
        "reception",
        "intelligible",
        "form",
        "william",
        "attempt",
        "resolve",
        "problem",
        "repeated",
        "number",
        "work",
        "couched",
        "highly",
        "metaphorical",
        "language",
        "pose",
        "severe",
        "problem",
        "interpretation",
        "intellective",
        "power",
        "riverbed",
        "fountain",
        "scientific",
        "sapiential",
        "water",
        "hence",
        "one",
        "respect",
        "overflow",
        "shine",
        "forth",
        "another",
        "respect",
        "receives",
        "outpouring",
        "radiance",
        "oo",
        "ii",
        "suppl",
        "b",
        "teske",
        "william",
        "hold",
        "account",
        "intellective",
        "power",
        "active",
        "passive",
        "respect",
        "forced",
        "divide",
        "intellect",
        "two",
        "distinct",
        "part",
        "one",
        "active",
        "one",
        "passive"
    ]
}