{
    "main_text": "Ethics\n4. Ethics\n\n\nWilliam's ethics starts with two generally accepted early medieval\nclaims: (1) evil is not any positively existing thing but only the\nprivation of good (Sen 277.1); (2) every act or event that occurs is\nperformed or condoned by God and therefore good (Sen 277.11-15). These\nlead William, among others, to situate moral good and evil in the\nhuman mind.\n\n\nTo this end, William names the elements of a fairly complex moral\npsychology: vice, desire/lust, pleasure, will, intention, and consent.\nAny or all of these elements might play a role in sinful behavior.\nVice itself is not necessarily bad, since the vices are not acquired\nhabits but inborn dispositions. Vices incline us to bad behavior but\ndo not necessarily compel the will: there is no sin unless we consent\nto the behavior the vice inclines us toward (Sen 278.10). Carnal\ndesire, lust, and pleasure, on the other hand, are always morally\nbad. William writes extensively about sexual lust and pleasure,\nespecially as they are involved in the transmission of original\nsin. Before the fall, sex was no more pleasurable than \"putting your\nfinger in your mouth\" (Sen. 254). In our fallen condition, however,\nlust and pleasure can never be removed from the act. Because our\n\"ability\" to experience this pleasure is the result of original sin,\nthe pleasure itself is always culpable. Consent to a sexual act under\nthe proper circumstances—e.g., between lawful spouses for the\npurpose of procreation—only lessens the gravity of the sin (Sen\n255; 246).  In William's moral psychology, will, intention, and\nconsent are the undifferentiated elements of voluntary action. These\nplay the most significant role, but sin is not exclusively in the\nwill, consent, or intention.\n\n\nOur best hope to avoid sin is to will what is right for the right\nreasons. However, when it comes to discovering what is right, and\ntherefore what ought to be willed, we start out at a disadvantage. The\nhuman mind naturally has the power to discern good and evil (Sen\n253.10; IGP II 4), but one of the effects of the Fall is that our\nrational capacities have been clouded and diminished. Before the Fall\nthe senses were subject to reason; after the Fall this is reversed\n(Sen 253.12-15), for since then the mind has become more closely\nattached and even enslaved to the body. This is the fomes of\nsin, a carnal weakness that clouds our reason and makes us more\ninclined to sin (Sen 246.39).  Fear, not reason, is the key for\nWilliam, since \"fear is the beginning of all wisdom\"\n(Sen. 276.1). William describes three kinds of fear (Sen\n276.17-34). First is the natural fear of danger and pain; even Jesus\nwas subject to this fear. Second is fear of losing material things or\nthe fear of punishment in hell. This fear shows that one values\ncomfort and material things more that goodness and justice.  People\nmotivated by this second fear will act rightly out of fear of losing\nmaterial goods or fear of the torments of hell, but not out of good or\nright intention: \"he does not merit grace who serves not his love of\njustice but his love of things or his fear of punishment\" (Sen\n261.23-25). Third is the fear that arises from respect for God's\njustice and power. This respectful fear of God, with knowledge of our\nown weakness and fallibility, \"is better called the love of God\" (Sen\n276.39-43). This humble fear of God should be our guide to what is\nright.\n\n\nWilliam's influence on Abelard here is obvious. Primarily, William and\nperhaps others from the school of Anselm of Laon were responsible for\nthe delineating the complex moral psychology that is at the core of\nAbelard's ethics. The major differences are with regard to reason and\nresponsibility. Because of our fallen state, William has little regard\nfor the ability of human reason to correctly discern what is\ngood. William is also content to prove that evil is no thing by\nsituating its source somehow in the human mind. He is not interested\nin showing that we are responsible, only that we, and not God, are\naccountable. Our will, like our mind and body, is defective and we\nsuffer the consequences of its failures. It is Abelard who takes this\nmoral psychology and develops from it a theory of moral\nresponsibility.\n5.  Philosophical Theology\n\n\nWilliam is committed to the belief that the mysteries of faith are\nbeyond the scope of human reason, but this does not prevent him from\ndiscussing the issues philosophically and using his skill as a\nlogician to prove his point.\n\n\nThe problem of free will and divine foreknowledge is familiar: if\nGod's foreknowledge is infallible, then future events, including the\nactions of human beings, all happen of necessity; on the other hand,\nif future events,including the actions of human beings, could occur\notherwise, then God's foreknowledge would fallible. William denies\nboth propositions. With regard to the first he offers two\narguments. He claims that God foresees the whole range of possible\nchoices and infallibly foreknows which option free creatures will\nchoose (Sen 237; 238). The event itself is not necessary; in fact, God\ninfallibly foresees that the event is not necessary. He then adds an\ninteresting claim about future contingent propositions: they are\ndeterminately true or false, but it is the infallibility of divine\nforeknowledge that makes them so. The future event itself which the\nproposition is about does not yet exist and is indeterminate\n(eventus rerum de quibus agitur indeterminate) (Sen\n238.36). William seems to hold both that the future is indeterminate\nand that God's foreknowledge is determinately true or false.\n\n\nThe second proposition, ‘if future events, including the actions\nof human beings, could occur otherwise, then God's foreknowledge is\nfallible’, was interpreted in several ways by William's\ncontemporaries. Some held that if the event could occur otherwise God\nwould be fallible. Others held that because the event could occur\notherwise God actually is fallible (see Mews 2005: 135). The former\nwould reject the claim that the event could occur otherwise, but the\nlatter would simply reject divine infallibility, arguing rather that\nGod is just very lucky epistemically. Both views are theologically\nsuspect, of course, and William argued that both inferences are\ninvalid.  But he does so by introducing an unexplained modal intuition\nthat in context looks question-begging: the inference from ‘the\nevent could occur otherwise’ to ‘God is or could be\ndeceived’ is not necessary. It is possible that the former be\ntrue and the latter false because \"it is never necessary that the\nimpossible follow from the possible, and it is impossible for God to\nbe, or to have been, deceived\" (Sen 237.68).\n\n\nWilliam deftly avoids the overreaching that got philosophers like\nRoscelin and Abelard into such trouble. He outlines a theory of\nmetaphorical language for describing God, and argues that the\nfundamental relations of the Trinity are beyond the powers of the\nhuman mind to comprehend.\n\n\nPredicates such as good, just, etc.,when applied to God have a\nmetaphorical rather than their usual literal meaning. As described\nabove, William argued that all significant words are imposed to name\nexisting things in the world and these words generate sound\nunderstandings of those things they were imposed to signify. When we\nimpose the word ‘just’ or ‘good’ to name a\njust or good person, we do so because justice or goodness is in some\nway a quality of that person or her actions. God, on the other hand,\nis goodness itself and justice itself. The dignity and power of God\ncannot be grasped by human reason and so we cannot even conceive of\nGod sufficiently to accurately impose words that name divine\nattributes: \"words imposed for human use are used metaphorically for\nspeaking about God\" [ad loquendum de Deo transferuntur] (Sen\n236.46).\n\n\nWhenever he discusses the Trinity, William associates the Father with\npower, the Son with wisdom and the Holy Spirit with love. But this\nmetaphor is not intended to help us toward rational understanding of\nthe Trinity, or to provide a clear delineation of properties of the\nthree ersons in any way that would allow an explanation of their\nrelations and differences. William argues that there is nothing like\nthe Trinity in the created world and so there is nothing the human\nmind is able to comprehend that could be used as an analogue for\nexplaining the fundamental relation of the Trinity, three persons\nirreducibly present in one substance: \"I do not see by what quality I\nwould be able to explain this, since nothing similar can be found in\nthe nature of any thing\" (Sen 236.86). William rejects Augustine's\nmetaphors of the sun and sunshine and the mind and reason. Sunshine is\nan accident of the air and is no part of the substance of the\nsun. Likewise, reason is a power of the mind and not its substance\n(Sen 236.101). William also explains that neither of his theories of\nuniversals can be applied to explain the sameness and difference of\nthe divine persons. Material essence realism would imply that the\npersons in the Godhead are accidentally individuated, and this is\nunacceptable. The indifference theory would require the non-identity\nof three separate substances, which is also contrary to the teaching\nof the faith. What is William's ultimate conclusion?  \"Because no\nlikeness <to any created thing> could be described, the Trinity\nmust be defended by faith alone\" (Sen 236.91).",
    "section_title": "4. Ethics",
    "entry_title": "William of Champeaux",
    "hierarchy_title": "William of Champeaux || Ethics",
    "tokenized_text": [
        "ethic",
        "ethic",
        "william",
        "s",
        "ethic",
        "start",
        "two",
        "generally",
        "accepted",
        "early",
        "medieval",
        "claim",
        "evil",
        "positively",
        "existing",
        "thing",
        "privation",
        "good",
        "sen",
        "every",
        "act",
        "event",
        "occurs",
        "performed",
        "condoned",
        "god",
        "therefore",
        "good",
        "sen",
        "lead",
        "william",
        "among",
        "others",
        "situate",
        "moral",
        "good",
        "evil",
        "human",
        "mind",
        "end",
        "william",
        "name",
        "element",
        "fairly",
        "complex",
        "moral",
        "psychology",
        "vice",
        "desirelust",
        "pleasure",
        "intention",
        "consent",
        "element",
        "might",
        "play",
        "role",
        "sinful",
        "behavior",
        "vice",
        "necessarily",
        "bad",
        "since",
        "vice",
        "acquired",
        "habit",
        "inborn",
        "disposition",
        "vice",
        "incline",
        "u",
        "bad",
        "behavior",
        "necessarily",
        "compel",
        "sin",
        "unless",
        "consent",
        "behavior",
        "vice",
        "incline",
        "u",
        "toward",
        "sen",
        "carnal",
        "desire",
        "lust",
        "pleasure",
        "hand",
        "always",
        "morally",
        "bad",
        "william",
        "writes",
        "extensively",
        "sexual",
        "lust",
        "pleasure",
        "especially",
        "involved",
        "transmission",
        "original",
        "sin",
        "fall",
        "sex",
        "pleasurable",
        "putting",
        "finger",
        "mouth",
        "sen",
        "fallen",
        "condition",
        "however",
        "lust",
        "pleasure",
        "never",
        "removed",
        "act",
        "ability",
        "experience",
        "pleasure",
        "result",
        "original",
        "sin",
        "pleasure",
        "always",
        "culpable",
        "consent",
        "sexual",
        "act",
        "proper",
        "circumstanceseg",
        "lawful",
        "spouse",
        "purpose",
        "procreationonly",
        "lessens",
        "gravity",
        "sin",
        "sen",
        "william",
        "s",
        "moral",
        "psychology",
        "intention",
        "consent",
        "undifferentiated",
        "element",
        "voluntary",
        "action",
        "play",
        "significant",
        "role",
        "sin",
        "exclusively",
        "consent",
        "intention",
        "best",
        "hope",
        "avoid",
        "sin",
        "right",
        "right",
        "reason",
        "however",
        "come",
        "discovering",
        "right",
        "therefore",
        "ought",
        "willed",
        "start",
        "disadvantage",
        "human",
        "mind",
        "naturally",
        "power",
        "discern",
        "good",
        "evil",
        "sen",
        "igp",
        "ii",
        "one",
        "effect",
        "fall",
        "rational",
        "capacity",
        "clouded",
        "diminished",
        "fall",
        "sens",
        "subject",
        "reason",
        "fall",
        "reversed",
        "sen",
        "since",
        "mind",
        "become",
        "closely",
        "attached",
        "even",
        "enslaved",
        "body",
        "fomes",
        "sin",
        "carnal",
        "weakness",
        "cloud",
        "reason",
        "make",
        "u",
        "inclined",
        "sin",
        "sen",
        "fear",
        "reason",
        "key",
        "william",
        "since",
        "fear",
        "beginning",
        "wisdom",
        "sen",
        "william",
        "describes",
        "three",
        "kind",
        "fear",
        "sen",
        "first",
        "natural",
        "fear",
        "danger",
        "pain",
        "even",
        "jesus",
        "subject",
        "fear",
        "second",
        "fear",
        "losing",
        "material",
        "thing",
        "fear",
        "punishment",
        "hell",
        "fear",
        "show",
        "one",
        "value",
        "comfort",
        "material",
        "thing",
        "goodness",
        "justice",
        "people",
        "motivated",
        "second",
        "fear",
        "act",
        "rightly",
        "fear",
        "losing",
        "material",
        "good",
        "fear",
        "torment",
        "hell",
        "good",
        "right",
        "intention",
        "merit",
        "grace",
        "serf",
        "love",
        "justice",
        "love",
        "thing",
        "fear",
        "punishment",
        "sen",
        "third",
        "fear",
        "arises",
        "respect",
        "god",
        "s",
        "justice",
        "power",
        "respectful",
        "fear",
        "god",
        "knowledge",
        "weakness",
        "fallibility",
        "better",
        "called",
        "love",
        "god",
        "sen",
        "humble",
        "fear",
        "god",
        "guide",
        "right",
        "william",
        "s",
        "influence",
        "abelard",
        "obvious",
        "primarily",
        "william",
        "perhaps",
        "others",
        "school",
        "anselm",
        "laon",
        "responsible",
        "delineating",
        "complex",
        "moral",
        "psychology",
        "core",
        "abelard",
        "s",
        "ethic",
        "major",
        "difference",
        "regard",
        "reason",
        "responsibility",
        "fallen",
        "state",
        "william",
        "little",
        "regard",
        "ability",
        "human",
        "reason",
        "correctly",
        "discern",
        "good",
        "william",
        "also",
        "content",
        "prove",
        "evil",
        "thing",
        "situating",
        "source",
        "somehow",
        "human",
        "mind",
        "interested",
        "showing",
        "responsible",
        "god",
        "accountable",
        "like",
        "mind",
        "body",
        "defective",
        "suffer",
        "consequence",
        "failure",
        "abelard",
        "take",
        "moral",
        "psychology",
        "develops",
        "theory",
        "moral",
        "responsibility",
        "philosophical",
        "theology",
        "william",
        "committed",
        "belief",
        "mystery",
        "faith",
        "beyond",
        "scope",
        "human",
        "reason",
        "prevent",
        "discussing",
        "issue",
        "philosophically",
        "using",
        "skill",
        "logician",
        "prove",
        "point",
        "problem",
        "free",
        "divine",
        "foreknowledge",
        "familiar",
        "god",
        "s",
        "foreknowledge",
        "infallible",
        "future",
        "event",
        "including",
        "action",
        "human",
        "being",
        "happen",
        "necessity",
        "hand",
        "future",
        "event",
        "including",
        "action",
        "human",
        "being",
        "could",
        "occur",
        "otherwise",
        "god",
        "s",
        "foreknowledge",
        "would",
        "fallible",
        "william",
        "denies",
        "proposition",
        "regard",
        "first",
        "offer",
        "two",
        "argument",
        "claim",
        "god",
        "foresees",
        "whole",
        "range",
        "possible",
        "choice",
        "infallibly",
        "foreknows",
        "option",
        "free",
        "creature",
        "choose",
        "sen",
        "event",
        "necessary",
        "fact",
        "god",
        "infallibly",
        "foresees",
        "event",
        "necessary",
        "add",
        "interesting",
        "claim",
        "future",
        "contingent",
        "proposition",
        "determinately",
        "true",
        "false",
        "infallibility",
        "divine",
        "foreknowledge",
        "make",
        "future",
        "event",
        "proposition",
        "yet",
        "exist",
        "indeterminate",
        "eventus",
        "rerum",
        "de",
        "quibus",
        "agitur",
        "indeterminate",
        "sen",
        "william",
        "seems",
        "hold",
        "future",
        "indeterminate",
        "god",
        "s",
        "foreknowledge",
        "determinately",
        "true",
        "false",
        "second",
        "proposition",
        "future",
        "event",
        "including",
        "action",
        "human",
        "being",
        "could",
        "occur",
        "otherwise",
        "god",
        "s",
        "foreknowledge",
        "fallible",
        "interpreted",
        "several",
        "way",
        "william",
        "s",
        "contemporary",
        "held",
        "event",
        "could",
        "occur",
        "otherwise",
        "god",
        "would",
        "fallible",
        "others",
        "held",
        "event",
        "could",
        "occur",
        "otherwise",
        "god",
        "actually",
        "fallible",
        "see",
        "mew",
        "former",
        "would",
        "reject",
        "claim",
        "event",
        "could",
        "occur",
        "otherwise",
        "latter",
        "would",
        "simply",
        "reject",
        "divine",
        "infallibility",
        "arguing",
        "rather",
        "god",
        "lucky",
        "epistemically",
        "view",
        "theologically",
        "suspect",
        "course",
        "william",
        "argued",
        "inference",
        "invalid",
        "introducing",
        "unexplained",
        "modal",
        "intuition",
        "context",
        "look",
        "questionbegging",
        "inference",
        "event",
        "could",
        "occur",
        "otherwise",
        "god",
        "could",
        "deceived",
        "necessary",
        "possible",
        "former",
        "true",
        "latter",
        "false",
        "never",
        "necessary",
        "impossible",
        "follow",
        "possible",
        "impossible",
        "god",
        "deceived",
        "sen",
        "william",
        "deftly",
        "avoids",
        "overreaching",
        "got",
        "philosopher",
        "like",
        "roscelin",
        "abelard",
        "trouble",
        "outline",
        "theory",
        "metaphorical",
        "language",
        "describing",
        "god",
        "argues",
        "fundamental",
        "relation",
        "trinity",
        "beyond",
        "power",
        "human",
        "mind",
        "comprehend",
        "predicate",
        "good",
        "etc",
        "applied",
        "god",
        "metaphorical",
        "rather",
        "usual",
        "literal",
        "meaning",
        "described",
        "william",
        "argued",
        "significant",
        "word",
        "imposed",
        "name",
        "existing",
        "thing",
        "world",
        "word",
        "generate",
        "sound",
        "understanding",
        "thing",
        "imposed",
        "signify",
        "impose",
        "word",
        "good",
        "name",
        "good",
        "person",
        "justice",
        "goodness",
        "way",
        "quality",
        "person",
        "action",
        "god",
        "hand",
        "goodness",
        "justice",
        "dignity",
        "power",
        "god",
        "grasped",
        "human",
        "reason",
        "even",
        "conceive",
        "god",
        "sufficiently",
        "accurately",
        "impose",
        "word",
        "name",
        "divine",
        "attribute",
        "word",
        "imposed",
        "human",
        "use",
        "used",
        "metaphorically",
        "speaking",
        "god",
        "ad",
        "loquendum",
        "de",
        "deo",
        "transferuntur",
        "sen",
        "whenever",
        "discus",
        "trinity",
        "william",
        "associate",
        "father",
        "power",
        "son",
        "wisdom",
        "holy",
        "spirit",
        "love",
        "metaphor",
        "intended",
        "help",
        "u",
        "toward",
        "rational",
        "understanding",
        "trinity",
        "provide",
        "clear",
        "delineation",
        "property",
        "three",
        "ersons",
        "way",
        "would",
        "allow",
        "explanation",
        "relation",
        "difference",
        "william",
        "argues",
        "nothing",
        "like",
        "trinity",
        "created",
        "world",
        "nothing",
        "human",
        "mind",
        "able",
        "comprehend",
        "could",
        "used",
        "analogue",
        "explaining",
        "fundamental",
        "relation",
        "trinity",
        "three",
        "person",
        "irreducibly",
        "present",
        "one",
        "substance",
        "see",
        "quality",
        "would",
        "able",
        "explain",
        "since",
        "nothing",
        "similar",
        "found",
        "nature",
        "thing",
        "sen",
        "william",
        "reject",
        "augustine",
        "s",
        "metaphor",
        "sun",
        "sunshine",
        "mind",
        "reason",
        "sunshine",
        "accident",
        "air",
        "part",
        "substance",
        "sun",
        "likewise",
        "reason",
        "power",
        "mind",
        "substance",
        "sen",
        "william",
        "also",
        "explains",
        "neither",
        "theory",
        "universal",
        "applied",
        "explain",
        "sameness",
        "difference",
        "divine",
        "person",
        "material",
        "essence",
        "realism",
        "would",
        "imply",
        "person",
        "godhead",
        "accidentally",
        "individuated",
        "unacceptable",
        "indifference",
        "theory",
        "would",
        "require",
        "nonidentity",
        "three",
        "separate",
        "substance",
        "also",
        "contrary",
        "teaching",
        "faith",
        "william",
        "s",
        "ultimate",
        "conclusion",
        "likeness",
        "created",
        "thing",
        "could",
        "described",
        "trinity",
        "must",
        "defended",
        "faith",
        "alone",
        "sen"
    ]
}