{
    "main_text": "The Ground of Induction\n7. Objections to Williams’ proposed solution to the problem of induction\n\nWilliams’ treatment of induction created quite a stir when it\nappeared, but attracted criticisms of varying power from commentators\nwedded to more defeatist attitudes, and was eclipsed by the Popperian\nstrategy of replacing an epistemology of confirmation with one that\nfocused on refutation. It thus exercised less influence than it\ndeserves. It is a closely reasoned, deductively argued defense of the\nrationality of inductive inference, well meriting continued\nattention.\n\nIts reliance on a priori reasoning (as opposed to any\ncontingent principles such as the “uniformity of nature”\nor the action of laws of nature) means that it should hold in all\npossible worlds. Williams’ argument would thus be easily\ndefeated by the exhibition of a possible world in which inductive\nreasoning did not work (in the sense of mostly yielding false\nconclusions). However, critics of Williams have not offered such a\npossible non-inductive world. Chaotic worlds are not non-inductive (as\nthe induction from chaos to more chaos is correct in them), while a\nworld with an anti-inductive demon, who falsifies, say, most of the\ninductive inferences I make, is not clearly non-inductive either\n(since although most of my inductions have false conclusions,\nit does not follow that most inductions in general have false\nconclusions).\n\nMarc Lange (2011) does however propose a counterexample, arising from\nthe “purely formal” nature of Williams’ argument.\nShould it not apply equally to “grue” as to\n“green”? Objects are grue if they are green up to some\nfuture point in time, and blue thereafter. The problem is to show that\nour sample, to date, of green things is not a sample of things\nactually grue. (Williams’s own views on the grue problem are\ngiven in his “How Reality is Reasonable” in (2018)).\n\nStove (1986, 131–144) argued that his more specific version of\nWilliams’s argument (see below) was not subject to the\nobjection, and that the failure of induction in the case of\n‘grue’ showed that inductive logic was not purely\nformal—but then neither was deductive logic.\n\nOther criticisms arise from the suggestion that the proportional\nsyllogism in general is not a justified form of inference without some\nassumption of randomness. Any proportional syllogism (with exact\nnumbers) is of the form\n\nThe proportion of Fs that are G is\nr.\na is F.\nSo, the probability that a is G is r.\n\n\n(Or, if we let B be the proposition that the proportion of\nFs that are G is r, and we let\np(h | e) be the conditional\nprobability of hypothesis h on evidence e, then we\ncan express the above proportional syllogism in the language of\nprobability as follows: p(Ga | Fa\n& B) = r.)\n\nDo we not need to assume that a is chosen\n“randomly”, in the sense that all Fs have an\nequal chance of being chosen? Otherwise, how do we know that\na is not chosen with some bias, which would make its\nprobability of being G different from r?\n\nDefenders of the proportional syllogism (McGrew 2003; Campbell and\nFranklin 2004) argue that no assumption of randomness is needed. Any\ninformation about bias would indeed change the probability, but that\nis a trivial fact about any argument. An argument infers from given\npremises to a given conclusion; a different argument, with a different\nforce, moves from some other (additional) premises to that conclusion.\nGiven just that the vast majority of airline flights land safely, I\ncan have rational confidence that my flight will land safely, even\nthough there are any number of other possible premises (such as that I\nhave just seen the wheels fall off) that would change the probability\nif I added them to the argument. The fact that the probability of the\nconclusion on other evidence would be different is no reason\nto change the probability assessment on the given evidence.\n\nSimilar reasoning applies to any other property that a may\nhave (or, in the case of the Williams argument, that the sample may\nhave), such as having been observed or being in the past. If there is\nsome positive reason to think that property relevant to the conclusion\n(that a is G), that reason needs to be explained; if\nnot, there is no reason to believe it affects the argument and the\noriginal probability given by the proportional syllogism stands.\n\nSerious criticisms specific to Williams’s argument have been\nbased on claims that the proportional syllogism, though correct in\ngeneral, has been misapplied by Williams. Any proportional\nsyllogism,\n\nThe proportion of Fs that are G is\nr.\na is F.\nSo, the probability that a is G is\nr,\n\n\nis subject to the objection that, in the case at hand, there is\nactually further information about the Fs that is relevant to\nthe conclusion Ga. For example, in\n\nThe proportion of candidates who will be appointed to the board of\nAlbert Smith Corp is 10%.\nAlbert Smith Jr is a candidate.\nSo, the probability that Albert Smith Jr will be appointed is\n10%,\n\n\nit is arguable that information is hidden in the proper names that is\nfavorably relevant to the younger Smith’s chance of success. The\nquestion then is whether the same could happen with the proportional\nsyllogism in Williams’ argument for induction. Maher (1996)\nargues that there is such a problem. In this version of\nWilliams’ argument:\n\nThe proportion of large samples whose complexion approximately\nmatches the population is over 95%.\nS is a large sample.\nSo, the probability that the complexion of S matches the\npopulation is over 95%,\n\n\nis there, typically, any further information about the sample\nS that is relevant to whether it matches the population? The\npotentially relevant information one has is the proportion in\nS of the attribute to be predicted (blue, or whatever it\nmight be). Can that be relevant to matching?\n\nIt certainly can be relevant. For example, if the proportion of blue\nitems in the sample is 100%, it suggests that the population\nproportion is close to 100%; that is positively relevant to matching\nsince samples of near-homogeneous populations are more likely to\nmatch. (For example, if the population proportion is 100%,\nall samples match the population.) Conversely, fewer samples\nmatch the population when the population proportion is near one\nhalf.\n\nDavid Stove (1986), in defending Williams’ argument, proposed to\navoid this problem by taking a more particular case of the argument\nwhich would not be subject to the objection. Stove proposed:\n\n\nIf F is the class of ravens, G the class of black\nthings, S a sample of 3020 ravens, r = 0.95, and\n‘match’ means having proportion within 3% of the\npopulation proportion, then it is evident that ‘The proportion\nof Fs that are Gs is x’ is not\nsubstantially unfavorable to matching (for all x).\n\n\nFor even in the worst case, when the proportion of black things is one\nhalf, it is still true that the vast majority of samples match the\npopulation (Stove 1986, 66–75).\n\nStove’s reply emphasizes how strong the mathematical truth about\nmatching of samples is: it is not merely that, for any population size\nand proportion, one can find a sample size and degree of match such\nthat samples of that size mostly match; it is the much stronger result\nthat one can fix the sample size and degree of match beforehand,\nwithout needing knowledge of the population size and proportion. For\nexample, the vast majority of 3020-size samples match to within\n3%—irrespective of the population size (provided of course that\nit is larger than 3020) and the proportion of objects with the\ncharacteristic under investigation..\n\nMaher also objects that the attribute itself, such as\n“blue”, might be a priori relevant to its\nproportion in the sample and hence to matching. For example, if\n“blue” is one of a large range of possible colors, then\na priori it is unlikely that an individual is blue and\nunlikely that a sample will have many blue items. As with any Bayesian\nreasoning, a prior probability close to zero (or one) requires a lot\nof evidence to overcome; in this case, we would conclude that a sample\nwith a high proportion of blue items was most likely a coincidence,\nand the posterior probability of the sample matching the population\nwould still not be high.\n\nScott Campbell (2001), in reply to Maher, argues that priors do not\ndominate observations in the way Maher suggests. By analogy, suppose\nthat, while blindfolded, I throw a dart at a dartboard. I am told that\n99 of the 100 spots on the board are the same color, and that there\nare 145 choices of color for the spots. After throwing, I observe just\nthe spot I have hit and find it is blue. Then (in the absence of\nfurther information), the chance is very high that almost all the\nother spots are blue. The prior improbability of blue does not prevent\nthat. In the same way, the fact that the vast majority of samples\nmatch the population gives good reason to suppose that the observed\nsample does too, irrespective of any prior information of the kind\nMaher advances.\n\nWilliams’ defense of induction thus has resources to supply\nanswers to the criticisms that have been made of it. It remains the\nmost objectivist and ambitious justification of induction.\n",
    "section_title": "7. Objections to Williams’ proposed solution to the problem of induction",
    "entry_title": "Donald Cary Williams",
    "hierarchy_title": "Donald Cary Williams || The Ground of Induction",
    "tokenized_text": [
        "ground",
        "induction",
        "objection",
        "williams",
        "proposed",
        "solution",
        "problem",
        "induction",
        "williams",
        "treatment",
        "induction",
        "created",
        "quite",
        "stir",
        "appeared",
        "attracted",
        "criticism",
        "varying",
        "power",
        "commentator",
        "wedded",
        "defeatist",
        "attitude",
        "eclipsed",
        "popperian",
        "strategy",
        "replacing",
        "epistemology",
        "confirmation",
        "one",
        "focused",
        "refutation",
        "thus",
        "exercised",
        "le",
        "influence",
        "deserves",
        "closely",
        "reasoned",
        "deductively",
        "argued",
        "defense",
        "rationality",
        "inductive",
        "inference",
        "well",
        "meriting",
        "continued",
        "attention",
        "reliance",
        "priori",
        "reasoning",
        "opposed",
        "contingent",
        "principle",
        "uniformity",
        "nature",
        "action",
        "law",
        "nature",
        "mean",
        "hold",
        "possible",
        "world",
        "williams",
        "argument",
        "would",
        "thus",
        "easily",
        "defeated",
        "exhibition",
        "possible",
        "world",
        "inductive",
        "reasoning",
        "work",
        "sense",
        "mostly",
        "yielding",
        "false",
        "conclusion",
        "however",
        "critic",
        "williams",
        "offered",
        "possible",
        "noninductive",
        "world",
        "chaotic",
        "world",
        "noninductive",
        "induction",
        "chaos",
        "chaos",
        "correct",
        "world",
        "antiinductive",
        "demon",
        "falsifies",
        "say",
        "inductive",
        "inference",
        "make",
        "clearly",
        "noninductive",
        "either",
        "since",
        "although",
        "induction",
        "false",
        "conclusion",
        "follow",
        "induction",
        "general",
        "false",
        "conclusion",
        "marc",
        "lange",
        "however",
        "propose",
        "counterexample",
        "arising",
        "purely",
        "formal",
        "nature",
        "williams",
        "argument",
        "apply",
        "equally",
        "grue",
        "green",
        "object",
        "grue",
        "green",
        "future",
        "point",
        "time",
        "blue",
        "thereafter",
        "problem",
        "show",
        "sample",
        "date",
        "green",
        "thing",
        "sample",
        "thing",
        "actually",
        "grue",
        "williams",
        "view",
        "grue",
        "problem",
        "given",
        "reality",
        "reasonable",
        "stove",
        "argued",
        "specific",
        "version",
        "williams",
        "argument",
        "see",
        "subject",
        "objection",
        "failure",
        "induction",
        "case",
        "grue",
        "showed",
        "inductive",
        "logic",
        "purely",
        "formalbut",
        "neither",
        "deductive",
        "logic",
        "criticism",
        "arise",
        "suggestion",
        "proportional",
        "syllogism",
        "general",
        "justified",
        "form",
        "inference",
        "without",
        "assumption",
        "randomness",
        "proportional",
        "syllogism",
        "exact",
        "number",
        "form",
        "proportion",
        "f",
        "g",
        "r",
        "f",
        "probability",
        "g",
        "r",
        "let",
        "b",
        "proposition",
        "proportion",
        "f",
        "g",
        "r",
        "let",
        "p",
        "h",
        "e",
        "conditional",
        "probability",
        "hypothesis",
        "h",
        "evidence",
        "e",
        "express",
        "proportional",
        "syllogism",
        "language",
        "probability",
        "follows",
        "p",
        "ga",
        "fa",
        "b",
        "r",
        "need",
        "assume",
        "chosen",
        "randomly",
        "sense",
        "f",
        "equal",
        "chance",
        "chosen",
        "otherwise",
        "know",
        "chosen",
        "bias",
        "would",
        "make",
        "probability",
        "g",
        "different",
        "r",
        "defender",
        "proportional",
        "syllogism",
        "mcgrew",
        "campbell",
        "franklin",
        "argue",
        "assumption",
        "randomness",
        "needed",
        "information",
        "bias",
        "would",
        "indeed",
        "change",
        "probability",
        "trivial",
        "fact",
        "argument",
        "argument",
        "infers",
        "given",
        "premise",
        "given",
        "conclusion",
        "different",
        "argument",
        "different",
        "force",
        "move",
        "additional",
        "premise",
        "conclusion",
        "given",
        "vast",
        "majority",
        "airline",
        "flight",
        "land",
        "safely",
        "rational",
        "confidence",
        "flight",
        "land",
        "safely",
        "even",
        "though",
        "number",
        "possible",
        "premise",
        "seen",
        "wheel",
        "fall",
        "would",
        "change",
        "probability",
        "added",
        "argument",
        "fact",
        "probability",
        "conclusion",
        "evidence",
        "would",
        "different",
        "reason",
        "change",
        "probability",
        "assessment",
        "given",
        "evidence",
        "similar",
        "reasoning",
        "applies",
        "property",
        "may",
        "case",
        "williams",
        "argument",
        "sample",
        "may",
        "observed",
        "past",
        "positive",
        "reason",
        "think",
        "property",
        "relevant",
        "conclusion",
        "g",
        "reason",
        "need",
        "explained",
        "reason",
        "believe",
        "affect",
        "argument",
        "original",
        "probability",
        "given",
        "proportional",
        "syllogism",
        "stand",
        "serious",
        "criticism",
        "specific",
        "williams",
        "argument",
        "based",
        "claim",
        "proportional",
        "syllogism",
        "though",
        "correct",
        "general",
        "misapplied",
        "williams",
        "proportional",
        "syllogism",
        "proportion",
        "f",
        "g",
        "r",
        "f",
        "probability",
        "g",
        "r",
        "subject",
        "objection",
        "case",
        "hand",
        "actually",
        "information",
        "f",
        "relevant",
        "conclusion",
        "ga",
        "example",
        "proportion",
        "candidate",
        "appointed",
        "board",
        "albert",
        "smith",
        "corp",
        "albert",
        "smith",
        "jr",
        "candidate",
        "probability",
        "albert",
        "smith",
        "jr",
        "appointed",
        "arguable",
        "information",
        "hidden",
        "proper",
        "name",
        "favorably",
        "relevant",
        "younger",
        "smith",
        "chance",
        "success",
        "question",
        "whether",
        "could",
        "happen",
        "proportional",
        "syllogism",
        "williams",
        "argument",
        "induction",
        "maher",
        "argues",
        "problem",
        "version",
        "williams",
        "argument",
        "proportion",
        "large",
        "sample",
        "whose",
        "complexion",
        "approximately",
        "match",
        "population",
        "large",
        "sample",
        "probability",
        "complexion",
        "match",
        "population",
        "typically",
        "information",
        "sample",
        "relevant",
        "whether",
        "match",
        "population",
        "potentially",
        "relevant",
        "information",
        "one",
        "proportion",
        "attribute",
        "predicted",
        "blue",
        "whatever",
        "might",
        "relevant",
        "matching",
        "certainly",
        "relevant",
        "example",
        "proportion",
        "blue",
        "item",
        "sample",
        "suggests",
        "population",
        "proportion",
        "close",
        "positively",
        "relevant",
        "matching",
        "since",
        "sample",
        "nearhomogeneous",
        "population",
        "likely",
        "match",
        "example",
        "population",
        "proportion",
        "sample",
        "match",
        "population",
        "conversely",
        "fewer",
        "sample",
        "match",
        "population",
        "population",
        "proportion",
        "near",
        "one",
        "half",
        "david",
        "stove",
        "defending",
        "williams",
        "argument",
        "proposed",
        "avoid",
        "problem",
        "taking",
        "particular",
        "case",
        "argument",
        "would",
        "subject",
        "objection",
        "stove",
        "proposed",
        "f",
        "class",
        "raven",
        "g",
        "class",
        "black",
        "thing",
        "sample",
        "raven",
        "r",
        "match",
        "mean",
        "proportion",
        "within",
        "population",
        "proportion",
        "evident",
        "proportion",
        "f",
        "g",
        "x",
        "substantially",
        "unfavorable",
        "matching",
        "x",
        "even",
        "worst",
        "case",
        "proportion",
        "black",
        "thing",
        "one",
        "half",
        "still",
        "true",
        "vast",
        "majority",
        "sample",
        "match",
        "population",
        "stove",
        "stove",
        "reply",
        "emphasizes",
        "strong",
        "mathematical",
        "truth",
        "matching",
        "sample",
        "merely",
        "population",
        "size",
        "proportion",
        "one",
        "find",
        "sample",
        "size",
        "degree",
        "match",
        "sample",
        "size",
        "mostly",
        "match",
        "much",
        "stronger",
        "result",
        "one",
        "fix",
        "sample",
        "size",
        "degree",
        "match",
        "beforehand",
        "without",
        "needing",
        "knowledge",
        "population",
        "size",
        "proportion",
        "example",
        "vast",
        "majority",
        "size",
        "sample",
        "match",
        "within",
        "irrespective",
        "population",
        "size",
        "provided",
        "course",
        "larger",
        "proportion",
        "object",
        "characteristic",
        "investigation",
        "maher",
        "also",
        "object",
        "attribute",
        "blue",
        "might",
        "priori",
        "relevant",
        "proportion",
        "sample",
        "hence",
        "matching",
        "example",
        "blue",
        "one",
        "large",
        "range",
        "possible",
        "color",
        "priori",
        "unlikely",
        "individual",
        "blue",
        "unlikely",
        "sample",
        "many",
        "blue",
        "item",
        "bayesian",
        "reasoning",
        "prior",
        "probability",
        "close",
        "zero",
        "one",
        "requires",
        "lot",
        "evidence",
        "overcome",
        "case",
        "would",
        "conclude",
        "sample",
        "high",
        "proportion",
        "blue",
        "item",
        "likely",
        "coincidence",
        "posterior",
        "probability",
        "sample",
        "matching",
        "population",
        "would",
        "still",
        "high",
        "scott",
        "campbell",
        "reply",
        "maher",
        "argues",
        "prior",
        "dominate",
        "observation",
        "way",
        "maher",
        "suggests",
        "analogy",
        "suppose",
        "blindfolded",
        "throw",
        "dart",
        "dartboard",
        "told",
        "spot",
        "board",
        "color",
        "choice",
        "color",
        "spot",
        "throwing",
        "observe",
        "spot",
        "hit",
        "find",
        "blue",
        "absence",
        "information",
        "chance",
        "high",
        "almost",
        "spot",
        "blue",
        "prior",
        "improbability",
        "blue",
        "prevent",
        "way",
        "fact",
        "vast",
        "majority",
        "sample",
        "match",
        "population",
        "give",
        "good",
        "reason",
        "suppose",
        "observed",
        "sample",
        "irrespective",
        "prior",
        "information",
        "kind",
        "maher",
        "advance",
        "williams",
        "defense",
        "induction",
        "thus",
        "resource",
        "supply",
        "answer",
        "criticism",
        "made",
        "remains",
        "objectivist",
        "ambitious",
        "justification",
        "induction"
    ]
}