{
    "main_text": "Metaphysics\n5. Metaphysics\n\nWilliam is the first thinker in the Latin West to develop a systematic\nmetaphysics (as ontology) based on the concepts of being\n(esse) and essence (essentia). Influenced by\nBoethius and Avicenna, he develops this metaphysics in his early work,\nOn the Trinity, as a preliminary to his account of the\nTrinity, and he returns to it in other works, especially in On the\nUniverse. The central theme of his metaphysics is that all\nexisting things, besides God, are composites of essence, on the one\nhand, and their being or existence, on the other, which is said to be\nacquired or partaken from God, the source of all being. God, in\ncontrast, involves no composition of essence and being, but is his\nbeing.\n\nInspired by Boethius’s distinction in De hebdomadibus\nbetween what is good by participation and what is good by substance,\nWilliam works these ideas out in terms of a distinction between a\nbeing by participation (ens participatione) and a being by\nsubstance or essence (ens substantia / ens per essentiam). By\nthe essence of a thing William means what is signified by its\ndefinition or species name. Under the influence of Avicenna, he often\nrefers to essence as a thing’s quiddity (quidditas,\nliterally, “whatness”), which he identifies with\nBoethius’s notion of quod est or “that which\nis.” Analogously, he identifies a thing’s being\n(esse) or existence with the notion of quo est or\n“by which it is.” In the case of a being by participation,\nits essence and features incidental to the essence are distinct from\nits being; William describes its being as clothed by them or as what\nwould be left if they were stripped away. Such a being (ens)\nis said to participate in or acquire its being (esse). At\ntimes William, following Avicenna, speaks of its being as accidental\nto it, by which he just emphasizes that its being is not part of the\nessence.\n\nA being (ens) by substance, in contrast, does not participate\nin or acquire being but is its very being: “there is also the\nbeing whose essence is for it being (esse) and whose essence\nwe predicate when we say, ‘It is,’ so that it itself and\nits being (esse) … are one thing in every way”\n(Switalski 1976, 17; Teske and Wade 1989, 65).\n\nIn the second chapter of On the Trinity, William also notes\nthat the term “being” (esse) may be used to mean\na thing’s essence (similar to Avicenna’s esse\nproprium), but this sense of “being” plays a minor\nrole in his thought.\n\nWilliam argues that there must be a being by essence; otherwise, no\nbeing could be intelligible. Thus, if there were just beings by\nparticipation, there would have to be either a circle of beings each\nof which participates in the being of what is prior to it in the\ncircle, with the absurd consequence that a thing would ultimately\nparticipate in its own being; or else there would have to be an\ninfinite series of beings, each member of which participates in the\nbeing of what is prior in the series. But then, for a member of the\nseries—say, A—to be, would be for it to have or\nparticipate in the being of B; and for B to be, in\nturn, would be for it to have or participate in the being of\nC, and so on. But if this were so, the being of no member of\nthe series could be intelligible, since any attempt to spell it out\nwould result in an account of the form: A’s having\nB’s having C’s having ad\ninfinitum. Since being is intelligible, William concludes that\nthere is a being by essence.\n\nBesides the distinctions between being by participation and being by\nessence, William mentions sixteen other distinctions, including the\ndistinctions between being of need (esse indigentiae) and\nbeing of sufficiency (esse sufficientiae), possible being\n(esse possibile) and being necessary through itself (esse\nnecesse per se ipsum), false and true being, and flowing and\nlasting being. William takes these distinctions to be coextensive with\nthe distinction between being by participation and being by essence.\nUsing a form of argument drawn from Avicenna, he argues that given the\nfirst member of each distinction, we can prove the existence of the\nsecond (see On the Trinity, ch. 6).\n\nThe distinction between possible being (possibile esse) and\nnecessary being through itself (necesse esse per se ipsum),\nwhich William draws from Avicenna, plays a prominent role in\nWilliam’s thought. William’s notion of a possible is not\nthat of something that exists in some possible world, but is rather\nthe notion of something whose essence neither requires nor rules out\nits having being. William treats such possibles as in some sense prior\nto being. In the case of those that have being and thus actually\nexist, he holds that the possible “and its being\n(esse), which does not belong to it essentially, are really\ntwo. The one comes to the other and does not fall within its\ndefinition or quiddity. Being (ens) [i.e., a being] in this\nway is, therefore, composite and also resolvable into its possibility,\nor quiddity, and its being (esse)” (Switalski 1976, 44;\nTeske and Wade 1989, 87). Some commentators see in such remarks the\nidea that a real or mind-independent distinction obtains between being\nand essence in possible beings.\n\nIn contrast, the being and essence of a being necessary through itself\nare not two; such a being does not participate in being but is its\nbeing and cannot but exist.\n\nWilliam argues there can be only one being by substance or being\nnecessary through itself. Speaking from a metaphysical point of view,\nhe follows Avicenna and calls it the First (primum). Speaking\nas a Christian, he identifies it with God, the creator, as he thinks\nis indicated by Biblical references to God as “he who is”:\n“being,” he says, is a proper name of God (see e.g. On\nthe Trinity, ch. 4).\n\nThe uniqueness of a being by substance is, William argues, a\nconsequence of its absolute simplicity, since nothing could\ndifferentiate two or more absolutely simple beings. The absolute\nsimplicity of a being by substance, in turn, is a consequence of the\nfact that it cannot be caused (not, at least by an external causation;\nWilliam argues that the being by substance is the Christian Trinity of\npersons and he admits a kind of internal causation in the Trinity).\nFor everything that is caused is other than its being and thus is a\nbeing by participation, whereas a being by essence or substance is its\nbeing. But a composite or non-simple being must have an external\ncause, and must therefore be a being by participation. Therefore, the\nbeing by substance, that is to say, God, cannot be composite, but must\nbe absolutely simple.\n\nGod’s absolute simplicity also entails that he is neither a\nuniversal (i.e., neither a genus nor species), nor an individual\nfalling under such. For, William argues, genera and species are\nthemselves composite, and the individuals that fall under them have a\nquiddity or definition and therefore compositeness. Nevertheless,\nWilliam thinks God is an individual, since he holds that all that\nexists is either a universal or an individual (OO I, 855ab).\n\nWilliam appeals to God’s power to show God has will and\nknowledge. He argues that God must be omnipotent: he cannot be forced\nor impeded and has a “two-way” power (potentia),\nidentified by William with what Aristotle calls a rational power. This\nis a power that “extends to both opposites, namely, to make and\nnot to make” (Switalski 1976, 57; Teske and Wade 1989, 99), in\ncontrast with something, such as fire, which when “it encounters\nwhat can be heated is not able to heat or not to heat . . . but it\nnecessarily has only the power to heat” (Switalski 1976, 54;\nTeske and Wade 1989, 97). However, because a two-way power is poised\nbetween acting and not-acting, it must be inclined to acting by\nsomething, and William thinks this can only be through a choice.\nTherefore, God must have will and choice; and since “it is\nimpossible that there be will and choice where there is no\nknowledge” (Switalski 1976, 59; Teske and Wade 1989, 101), God\nmust also have knowledge. William goes on to argue that God must\nindeed be omniscient, since “his wisdom is absolute and free,\nnot bound in any way to things, nor dependent upon them”\n(Switalski 1976, 61; Teske and Wade 1989, 102).\n\nWilliam takes his claim that God has a two-way power to imply that God\ncould have known or willed otherwise than he did. But, as William\nrealizes, this raises the difficulty that if God had known or willed\notherwise, it would seem that he would have been different, and this\nseems to be impossible given his absolute simplicity. In response,\nWilliam frequently emphasizes that by the very same act of knowing or\nwill by which God in fact knows or wills one thing, he could have\nknown or willed something else (OO I, 780a; Teske 2007, 105). Thus,\nwhen we say “God knows or wills X,” we must distinguish\nthe act of knowing or willing, which is identical with God and utterly\nthe same in every possible situation, from the object X to which it is\nrelated.\n",
    "section_title": "5. Metaphysics",
    "entry_title": "William of Auvergne",
    "hierarchy_title": "William of Auvergne || Metaphysics",
    "tokenized_text": [
        "metaphysics",
        "metaphysics",
        "william",
        "first",
        "thinker",
        "latin",
        "west",
        "develop",
        "systematic",
        "metaphysics",
        "ontology",
        "based",
        "concept",
        "esse",
        "essence",
        "essentia",
        "influenced",
        "boethius",
        "avicenna",
        "develops",
        "metaphysics",
        "early",
        "work",
        "trinity",
        "preliminary",
        "account",
        "trinity",
        "return",
        "work",
        "especially",
        "universe",
        "central",
        "theme",
        "metaphysics",
        "existing",
        "thing",
        "besides",
        "god",
        "composite",
        "essence",
        "one",
        "hand",
        "existence",
        "said",
        "acquired",
        "partaken",
        "god",
        "source",
        "god",
        "contrast",
        "involves",
        "composition",
        "essence",
        "inspired",
        "boethius",
        "distinction",
        "de",
        "hebdomadibus",
        "good",
        "participation",
        "good",
        "substance",
        "william",
        "work",
        "idea",
        "term",
        "distinction",
        "participation",
        "en",
        "participatione",
        "substance",
        "essence",
        "en",
        "substantia",
        "en",
        "per",
        "essentiam",
        "essence",
        "thing",
        "william",
        "mean",
        "signified",
        "definition",
        "specie",
        "name",
        "influence",
        "avicenna",
        "often",
        "refers",
        "essence",
        "thing",
        "quiddity",
        "quidditas",
        "literally",
        "whatness",
        "identifies",
        "boethius",
        "notion",
        "quod",
        "est",
        "is",
        "analogously",
        "identifies",
        "thing",
        "esse",
        "existence",
        "notion",
        "quo",
        "est",
        "is",
        "case",
        "participation",
        "essence",
        "feature",
        "incidental",
        "essence",
        "distinct",
        "william",
        "describes",
        "clothed",
        "would",
        "left",
        "stripped",
        "away",
        "en",
        "said",
        "participate",
        "acquire",
        "esse",
        "time",
        "william",
        "following",
        "avicenna",
        "speaks",
        "accidental",
        "emphasizes",
        "part",
        "essence",
        "en",
        "substance",
        "contrast",
        "participate",
        "acquire",
        "also",
        "whose",
        "essence",
        "esse",
        "whose",
        "essence",
        "predicate",
        "say",
        "esse",
        "one",
        "thing",
        "every",
        "way",
        "switalski",
        "teske",
        "wade",
        "second",
        "chapter",
        "trinity",
        "william",
        "also",
        "note",
        "term",
        "esse",
        "may",
        "used",
        "mean",
        "thing",
        "essence",
        "similar",
        "avicenna",
        "esse",
        "proprium",
        "sense",
        "play",
        "minor",
        "role",
        "thought",
        "william",
        "argues",
        "must",
        "essence",
        "otherwise",
        "could",
        "intelligible",
        "thus",
        "being",
        "participation",
        "would",
        "either",
        "circle",
        "being",
        "participates",
        "prior",
        "circle",
        "absurd",
        "consequence",
        "thing",
        "would",
        "ultimately",
        "participate",
        "else",
        "would",
        "infinite",
        "series",
        "being",
        "member",
        "participates",
        "prior",
        "series",
        "member",
        "seriessay",
        "ato",
        "would",
        "participate",
        "b",
        "b",
        "turn",
        "would",
        "participate",
        "c",
        "member",
        "series",
        "could",
        "intelligible",
        "since",
        "attempt",
        "spell",
        "would",
        "result",
        "account",
        "form",
        "b",
        "c",
        "ad",
        "infinitum",
        "since",
        "intelligible",
        "william",
        "concludes",
        "essence",
        "besides",
        "distinction",
        "participation",
        "essence",
        "william",
        "mention",
        "sixteen",
        "distinction",
        "including",
        "distinction",
        "need",
        "esse",
        "indigentiae",
        "sufficiency",
        "esse",
        "sufficientiae",
        "possible",
        "esse",
        "possibile",
        "necessary",
        "esse",
        "necesse",
        "per",
        "se",
        "ipsum",
        "false",
        "true",
        "flowing",
        "lasting",
        "william",
        "take",
        "distinction",
        "coextensive",
        "distinction",
        "participation",
        "essence",
        "using",
        "form",
        "argument",
        "drawn",
        "avicenna",
        "argues",
        "given",
        "first",
        "member",
        "distinction",
        "prove",
        "existence",
        "second",
        "see",
        "trinity",
        "ch",
        "distinction",
        "possible",
        "possibile",
        "esse",
        "necessary",
        "necesse",
        "esse",
        "per",
        "se",
        "ipsum",
        "william",
        "draw",
        "avicenna",
        "play",
        "prominent",
        "role",
        "william",
        "thought",
        "william",
        "notion",
        "possible",
        "something",
        "exists",
        "possible",
        "world",
        "rather",
        "notion",
        "something",
        "whose",
        "essence",
        "neither",
        "requires",
        "rule",
        "william",
        "treat",
        "possible",
        "sense",
        "prior",
        "case",
        "thus",
        "actually",
        "exist",
        "hold",
        "possible",
        "esse",
        "belong",
        "essentially",
        "really",
        "two",
        "one",
        "come",
        "fall",
        "within",
        "definition",
        "quiddity",
        "en",
        "ie",
        "way",
        "therefore",
        "composite",
        "also",
        "resolvable",
        "possibility",
        "quiddity",
        "esse",
        "switalski",
        "teske",
        "wade",
        "commentator",
        "see",
        "remark",
        "idea",
        "real",
        "mindindependent",
        "distinction",
        "obtains",
        "essence",
        "possible",
        "being",
        "contrast",
        "essence",
        "necessary",
        "two",
        "participate",
        "exist",
        "william",
        "argues",
        "one",
        "substance",
        "necessary",
        "speaking",
        "metaphysical",
        "point",
        "view",
        "follows",
        "avicenna",
        "call",
        "first",
        "primum",
        "speaking",
        "christian",
        "identifies",
        "god",
        "creator",
        "think",
        "indicated",
        "biblical",
        "reference",
        "god",
        "say",
        "proper",
        "name",
        "god",
        "see",
        "eg",
        "trinity",
        "ch",
        "uniqueness",
        "substance",
        "william",
        "argues",
        "consequence",
        "absolute",
        "simplicity",
        "since",
        "nothing",
        "could",
        "differentiate",
        "two",
        "absolutely",
        "simple",
        "being",
        "absolute",
        "simplicity",
        "substance",
        "turn",
        "consequence",
        "fact",
        "caused",
        "least",
        "external",
        "causation",
        "william",
        "argues",
        "substance",
        "christian",
        "trinity",
        "person",
        "admits",
        "kind",
        "internal",
        "causation",
        "trinity",
        "everything",
        "caused",
        "thus",
        "participation",
        "whereas",
        "essence",
        "substance",
        "composite",
        "nonsimple",
        "must",
        "external",
        "cause",
        "must",
        "therefore",
        "participation",
        "therefore",
        "substance",
        "say",
        "god",
        "composite",
        "must",
        "absolutely",
        "simple",
        "god",
        "absolute",
        "simplicity",
        "also",
        "entail",
        "neither",
        "universal",
        "ie",
        "neither",
        "genus",
        "specie",
        "individual",
        "falling",
        "william",
        "argues",
        "genus",
        "specie",
        "composite",
        "individual",
        "fall",
        "quiddity",
        "definition",
        "therefore",
        "compositeness",
        "nevertheless",
        "william",
        "think",
        "god",
        "individual",
        "since",
        "hold",
        "exists",
        "either",
        "universal",
        "individual",
        "oo",
        "ab",
        "william",
        "appeal",
        "god",
        "power",
        "show",
        "god",
        "knowledge",
        "argues",
        "god",
        "must",
        "omnipotent",
        "forced",
        "impeded",
        "twoway",
        "power",
        "potentia",
        "identified",
        "william",
        "aristotle",
        "call",
        "rational",
        "power",
        "power",
        "extends",
        "opposite",
        "namely",
        "make",
        "make",
        "switalski",
        "teske",
        "wade",
        "contrast",
        "something",
        "fire",
        "encounter",
        "heated",
        "able",
        "heat",
        "heat",
        "necessarily",
        "power",
        "heat",
        "switalski",
        "teske",
        "wade",
        "however",
        "twoway",
        "power",
        "poised",
        "acting",
        "notacting",
        "must",
        "inclined",
        "acting",
        "something",
        "william",
        "think",
        "choice",
        "therefore",
        "god",
        "must",
        "choice",
        "since",
        "impossible",
        "choice",
        "knowledge",
        "switalski",
        "teske",
        "wade",
        "god",
        "must",
        "also",
        "knowledge",
        "william",
        "go",
        "argue",
        "god",
        "must",
        "indeed",
        "omniscient",
        "since",
        "wisdom",
        "absolute",
        "free",
        "bound",
        "way",
        "thing",
        "dependent",
        "upon",
        "switalski",
        "teske",
        "wade",
        "william",
        "take",
        "claim",
        "god",
        "twoway",
        "power",
        "imply",
        "god",
        "could",
        "known",
        "willed",
        "otherwise",
        "william",
        "realizes",
        "raise",
        "difficulty",
        "god",
        "known",
        "willed",
        "otherwise",
        "would",
        "seem",
        "would",
        "different",
        "seems",
        "impossible",
        "given",
        "absolute",
        "simplicity",
        "response",
        "william",
        "frequently",
        "emphasizes",
        "act",
        "knowing",
        "god",
        "fact",
        "know",
        "will",
        "one",
        "thing",
        "could",
        "known",
        "willed",
        "something",
        "else",
        "oo",
        "a",
        "teske",
        "thus",
        "say",
        "god",
        "know",
        "will",
        "x",
        "must",
        "distinguish",
        "act",
        "knowing",
        "willing",
        "identical",
        "god",
        "utterly",
        "every",
        "possible",
        "situation",
        "object",
        "x",
        "related"
    ]
}