{
    "main_text": "Metaphysical Atomism || The Argument for Substance\n3.2 The Argument for Substance\n\nAs we have seen, the immediate goal of the argument for substance is\nto establish that there are things that exist necessarily. In the\ncontext of the assumption that anything complex could fail to exist\nthrough decomposition, this conclusion entails that there are simples\n(2.021). While the argument is presented as a two-stage modus\ntollens, it is conveniently reconstructed as a reductio ad\nabsurdum (The following interpretation of the argument is a\ncompressed version of that provided in Proops 2004. For two recent\nalternatives, see Zalabardo 2015, 243–254 and Morris 2008, ch.1,\nand 2017; and for criticisms of Morris, see Potter 2009): \n\nSuppose, for reductio, that\n\n  [1] There is no substance (that is, nothing exists in\nevery possible world).\n\nThen\n\n  [2] Everything exists contingently.\n\nBut then\n\n  [3] Whether a proposition has sense depends on whether\nanother proposition is true.\n\nSo\n\n  [4] We cannot draw up pictures of the world (true or\nfalse).\n\nBut\n\n  [5] We can draw up such pictures.\n\n\nContradiction So\n\n  [6] There is substance (that is, some things exist in\nevery possible world).\n\n\n\nOur [5] is the main suppressed premise. It means, simply, that we can\nframe senseful propositions. Let us now consider how we might try to\ndefend the inference from [2] to [3] on Wittgensteinian principles. As\na preliminary, note that, given Wittgenstein’s equation in the\nNotes on Logic of having sense with having truth-poles\n(NB, 99), it seems reasonable to suppose that for a sentence\nto “have sense” with respect to a given world is for it to\nhave a truth value with respect to that world. Let us assume that this\nis so. Now suppose that everything exists contingently. Then, in\nparticular, the referents of the semantically simple symbols occurring\nin a fully analysed sentence will exist contingently. But then any\nsuch sentence will contain a semantically simple symbol that fails to\nrefer with respect to some possible world (As we will shortly see,\nthis step is in fact controversial.). Suppose, as a background\nassumption, that there are no contingent simples. (It will be argued\nbelow that this assumption plausibly follows from certain Tractarian\ncommitments.) Then, if we assume that a sentence containing a\nsemantically simple term is neither true nor false evaluated with\nrespect to a world in which its purported referent (namely, a complex\nexisting contingently at the actual world) fails to exist — and,\nfor now, we do — then, for any such fully analysed sentence,\nthere will be some world such that the sentence depends for its truth\nvaluedness with respect to that world on the truth with respect to\nthat world of some other sentence, viz., the sentence stating\nthat the constituents of the relevant complex are configured in a\nmanner necessary and sufficient for its existence. It follows that if\neverything exists contingently, then whether a sentence is senseful\nwith respect to a world will depend on whether another sentence is\ntrue with respect to that world.\n\nThe step from [3] to [4] runs as follows. Suppose that whether any\nsentence “has sense” (i.e., on our reading, has a\ntruth-value) depends (in the way just explained) on whether another is\ntrue. Then every sentence will have an “indeterminate\nsense” in the sense that it will lack a truth value with respect\nto at least one possible world. But an indeterminate sense is no sense\nat all, for a proposition by its very nature “reaches through\nthe whole logical space” (3.42) (i.e., it is truth-valued with\nrespect to every possible\n world).[6]\n So if every sentence depended for its “sense” (i.e.,\ntruth-valuedness) on the truth of another, no sentence would have a\ndeterminate sense, and so no sentence would have a sense. In which\ncase we would be unable to frame senseful propositions (i.e., to\n“draw up pictures of the world true or false”). \n\nOne apparent difficulty concerns the assumption that to have sense is\njust to be true or false. How can such a view be attributed to the\nWittgenstein of the Tractatus given his view that tautology,\nwhich is true, and contradiction, which is false, are without sense\n(sinnlos) (4.461)? The seeds of an answer may be contained in\na remark from Wittgenstein’s lectures at Cambridge during the\nyear 1934–1935. Looking back on what he’d written in the\nTractatus, he says:\n\nWhen I called tautologies senseless I meant to stress a connection\nwith a quantity of sense, namely 0. ([AM]), 137)\n\n\nIt is possible, then, that Wittgenstein is thinking of a\nsinnlos proposition as a proposition that “has\nsense” but has it to a zero degree. According to this\nconception, a tautology, being true, is, in contrast to a nonsensical\nstring, in the running for possessing a non-zero quantity of sense,\nbut is so constructed that, in the end, it doesn’t get to have\none. And, importantly, in virtue of being in the running for having a\nnon-zero quantity of sense its possession of a zero quantity amounts\nto its, broadly speaking, ‘having sense’. Such a view,\naccording to which, for some non-count noun N, an N-less entity has N,\nbut has a zero quantity of it, is not without precedent in the\ntradition. Kant, for example, regards rest (motionlessness) as a\nspecies of motion: a zero quantity of it (Bader, Other Internet\nResources, 22–23). If, in a similar fashion,\nSinnlosigkeit is a species of Sinn, the equation of\nhaving Sinn with being true or false will be preserved. To\noffer a full defence of this understanding of Sinnlosigkeit\nwould take us too far afield, but I mention it to show that the\ncurrent objection is not decisive.\n\nAnother apparent difficulty for this reconstruction arises from its\nappearing to contradict Tractatus 3.24, which clearly\nsuggests that if the complex entity A were not to exist, the\nproposition “F[A]” would be false,\nrather than, as the argument requires, without truth value. But the\ndifficulty is only apparent. It merely shows that 3.24 belongs to a\ntheory that assumes that the world does have substance. On\nthis assumption Wittgenstein can say that whenever an apparent name\noccurs that appears to mention a complex this is only because it is\nnot, after all, a genuine name — and this is what he does say.\nBut on the assumption that the world has no substance, so that\neverything is complex, Wittgenstein can no longer say this.\nFor now he must allow that the semantically simple symbols occurring\nin a proposition’s final analysis do refer to complexes. So in\nthe context of the assumption that every proposition has a final\nanalysis, the reductio assumption of the argument for\nsubstance entails the falsity of 3.24. But since 3.24 is assumed to be\nfalse only in the context of a reductio, it is something that\nWittgenstein can consistently endorse (This solution to the apparent\ndifficulty for the present reconstruction is owed, in its essentials,\nto David Pears (see Pears 1987 [1989, 78]).\n\nTo complete the argument it only remains to show that Tractarian\ncommitments extrinsic to the argument for substance rule out\ncontingent\n simples.[7]\n Suppose a is a contingent simple. Then “a\nexists” must be a contingent proposition. But it cannot be an\nelementary proposition because it will be entailed by any elementary\nproposition containing ‘a,’ and elementary\npropositions are logically independent (4.211). So “a\nexists” must be non-elementary, and so further analyzable. And\nyet there would seem to be no satisfactory analysis of this\nproposition on the assumption that ‘a’ names a\ncontingent simple — no analysis, that is to say, that is both\nintrinsically plausible and compatible with Tractarian principles.\nWittgenstein cannot analyse “a exists” as the\nproposition “∃x(x = a)”\nfor two reasons. First, he would reject this analysis on the grounds\nthat it makes an ineliminable use of the identity sign (5.534).\nSecond, given his analysis of existential quantifications as\ndisjunctions, the proposition “∃x(x =\na)” would be further analysed as the\nnon-contingent proposition “a = a\n∨ a = b ∨ a =\nc…”. Nor can he analyse “a\nexists” as “~[ ~Fa & ~Ga &\n~Ha…]” — that is, as the negation of the\nconjunction of the negations of every elementary proposition involving\n“a.” To suppose that it could, is to suppose that\nthe proposition “~Fa & ~Ga &\n~Ha…” means “a does not\nexist,” and yet by the lights of the Tractatus this\nproposition would show a’s existence —\nor, more correctly, it would show something that one tries to put into\nwords by saying “a exists” (cf. 5.535,\nCorr, 126)). So, pending an unforeseen satisfactory analysis\nof “a exists,” this proposition will have to be\nanalysed as a complex of propositions not involving a. In\nother words, ‘a’ will have to be treated as an\nincomplete symbol and the fact of a’s existence will\nhave to be taken to consist in the fact that objects other than\na stand configured thus and so. But that would seem to entail\nthat a is not simple.\n\nThe argument for substance may be criticized on several grounds.\nFirst, the step leading from [2] to [3] relies on the assumption that\na name fails to refer with respect to a possible world at which its\nactual-world referent does not exist. This amounts to the\ncontroversial assumption that names do not function as what Nathan\nSalmon has called “obstinately rigid designators” (Salmon\n1981, 34). Secondly, the step leading from [3] to [4] relies on the\nassumption that a sentence that is neither true nor false with respect\nto some possible world fails to express a sense. As Wittgenstein was\nlater to realize, the case of intuitively senseful, yet vague\nsentences plausibly constitutes a counterexample (cf. PI\nSection 99). Lastly, one may question the assumption that it makes\nsense to speak of a final analysis, given that the procedure for\nanalysing a sentence of ordinary language has not been made clear (See\nPI, Sections 60, 63–4, and Section 91). \n",
    "section_title": "3.2 The Argument for Substance",
    "entry_title": "Wittgenstein’s Logical Atomism",
    "hierarchy_title": "Wittgenstein’s Logical Atomism || Metaphysical Atomism || The Argument for Substance",
    "tokenized_text": [
        "metaphysical",
        "atomism",
        "argument",
        "substance",
        "argument",
        "substance",
        "seen",
        "immediate",
        "goal",
        "argument",
        "substance",
        "establish",
        "thing",
        "exist",
        "necessarily",
        "context",
        "assumption",
        "anything",
        "complex",
        "could",
        "fail",
        "exist",
        "decomposition",
        "conclusion",
        "entail",
        "simple",
        "argument",
        "presented",
        "twostage",
        "modus",
        "tollens",
        "conveniently",
        "reconstructed",
        "reductio",
        "ad",
        "absurdum",
        "following",
        "interpretation",
        "argument",
        "compressed",
        "version",
        "provided",
        "proops",
        "two",
        "recent",
        "alternative",
        "see",
        "zalabardo",
        "morris",
        "ch",
        "criticism",
        "morris",
        "see",
        "potter",
        "suppose",
        "reductio",
        "substance",
        "nothing",
        "exists",
        "every",
        "possible",
        "world",
        "everything",
        "exists",
        "contingently",
        "whether",
        "proposition",
        "sense",
        "depends",
        "whether",
        "another",
        "proposition",
        "true",
        "draw",
        "picture",
        "world",
        "true",
        "false",
        "draw",
        "picture",
        "contradiction",
        "substance",
        "thing",
        "exist",
        "every",
        "possible",
        "world",
        "main",
        "suppressed",
        "premise",
        "mean",
        "simply",
        "frame",
        "senseful",
        "proposition",
        "let",
        "u",
        "consider",
        "might",
        "try",
        "defend",
        "inference",
        "wittgensteinian",
        "principle",
        "preliminary",
        "note",
        "given",
        "wittgenstein",
        "equation",
        "note",
        "logic",
        "sense",
        "truthpoles",
        "nb",
        "seems",
        "reasonable",
        "suppose",
        "sentence",
        "sense",
        "respect",
        "given",
        "world",
        "truth",
        "value",
        "respect",
        "world",
        "let",
        "u",
        "assume",
        "suppose",
        "everything",
        "exists",
        "contingently",
        "particular",
        "referent",
        "semantically",
        "simple",
        "symbol",
        "occurring",
        "fully",
        "analysed",
        "sentence",
        "exist",
        "contingently",
        "sentence",
        "contain",
        "semantically",
        "simple",
        "symbol",
        "fails",
        "refer",
        "respect",
        "possible",
        "world",
        "shortly",
        "see",
        "step",
        "fact",
        "controversial",
        "suppose",
        "background",
        "assumption",
        "contingent",
        "simple",
        "argued",
        "assumption",
        "plausibly",
        "follows",
        "certain",
        "tractarian",
        "commitment",
        "assume",
        "sentence",
        "containing",
        "semantically",
        "simple",
        "term",
        "neither",
        "true",
        "false",
        "evaluated",
        "respect",
        "world",
        "purported",
        "referent",
        "namely",
        "complex",
        "existing",
        "contingently",
        "actual",
        "world",
        "fails",
        "exist",
        "fully",
        "analysed",
        "sentence",
        "world",
        "sentence",
        "depends",
        "truth",
        "valuedness",
        "respect",
        "world",
        "truth",
        "respect",
        "world",
        "sentence",
        "viz",
        "sentence",
        "stating",
        "constituent",
        "relevant",
        "complex",
        "configured",
        "manner",
        "necessary",
        "sufficient",
        "existence",
        "follows",
        "everything",
        "exists",
        "contingently",
        "whether",
        "sentence",
        "senseful",
        "respect",
        "world",
        "depend",
        "whether",
        "another",
        "sentence",
        "true",
        "respect",
        "world",
        "step",
        "run",
        "follows",
        "suppose",
        "whether",
        "sentence",
        "sense",
        "ie",
        "reading",
        "truthvalue",
        "depends",
        "way",
        "explained",
        "whether",
        "another",
        "true",
        "every",
        "sentence",
        "indeterminate",
        "sense",
        "sense",
        "lack",
        "truth",
        "value",
        "respect",
        "least",
        "one",
        "possible",
        "world",
        "indeterminate",
        "sense",
        "sense",
        "proposition",
        "nature",
        "reach",
        "whole",
        "logical",
        "space",
        "ie",
        "truthvalued",
        "respect",
        "every",
        "possible",
        "world",
        "every",
        "sentence",
        "depended",
        "sense",
        "ie",
        "truthvaluedness",
        "truth",
        "another",
        "sentence",
        "would",
        "determinate",
        "sense",
        "sentence",
        "would",
        "sense",
        "case",
        "would",
        "unable",
        "frame",
        "senseful",
        "proposition",
        "ie",
        "draw",
        "picture",
        "world",
        "true",
        "false",
        "one",
        "apparent",
        "difficulty",
        "concern",
        "assumption",
        "sense",
        "true",
        "false",
        "view",
        "attributed",
        "wittgenstein",
        "tractatus",
        "given",
        "view",
        "tautology",
        "true",
        "contradiction",
        "false",
        "without",
        "sense",
        "sinnlos",
        "seed",
        "answer",
        "may",
        "contained",
        "remark",
        "wittgenstein",
        "lecture",
        "cambridge",
        "year",
        "looking",
        "back",
        "written",
        "tractatus",
        "say",
        "called",
        "tautology",
        "senseless",
        "meant",
        "stress",
        "connection",
        "quantity",
        "sense",
        "namely",
        "possible",
        "wittgenstein",
        "thinking",
        "sinnlos",
        "proposition",
        "proposition",
        "sense",
        "zero",
        "degree",
        "according",
        "conception",
        "tautology",
        "true",
        "contrast",
        "nonsensical",
        "string",
        "running",
        "possessing",
        "nonzero",
        "quantity",
        "sense",
        "constructed",
        "end",
        "get",
        "one",
        "importantly",
        "virtue",
        "running",
        "nonzero",
        "quantity",
        "sense",
        "possession",
        "zero",
        "quantity",
        "amount",
        "broadly",
        "speaking",
        "sense",
        "view",
        "according",
        "noncount",
        "noun",
        "n",
        "nless",
        "entity",
        "n",
        "zero",
        "quantity",
        "without",
        "precedent",
        "tradition",
        "kant",
        "example",
        "regard",
        "rest",
        "motionlessness",
        "specie",
        "motion",
        "zero",
        "quantity",
        "bader",
        "internet",
        "resource",
        "similar",
        "fashion",
        "sinnlosigkeit",
        "specie",
        "sinn",
        "equation",
        "sinn",
        "true",
        "false",
        "preserved",
        "offer",
        "full",
        "defence",
        "understanding",
        "sinnlosigkeit",
        "would",
        "take",
        "u",
        "far",
        "afield",
        "mention",
        "show",
        "current",
        "objection",
        "decisive",
        "another",
        "apparent",
        "difficulty",
        "reconstruction",
        "arises",
        "appearing",
        "contradict",
        "tractatus",
        "clearly",
        "suggests",
        "complex",
        "entity",
        "exist",
        "proposition",
        "f",
        "would",
        "false",
        "rather",
        "argument",
        "requires",
        "without",
        "truth",
        "value",
        "difficulty",
        "apparent",
        "merely",
        "show",
        "belongs",
        "theory",
        "assumes",
        "world",
        "substance",
        "assumption",
        "wittgenstein",
        "say",
        "whenever",
        "apparent",
        "name",
        "occurs",
        "appears",
        "mention",
        "complex",
        "genuine",
        "name",
        "say",
        "assumption",
        "world",
        "substance",
        "everything",
        "complex",
        "wittgenstein",
        "longer",
        "say",
        "must",
        "allow",
        "semantically",
        "simple",
        "symbol",
        "occurring",
        "proposition",
        "final",
        "analysis",
        "refer",
        "complex",
        "context",
        "assumption",
        "every",
        "proposition",
        "final",
        "analysis",
        "reductio",
        "assumption",
        "argument",
        "substance",
        "entail",
        "falsity",
        "since",
        "assumed",
        "false",
        "context",
        "reductio",
        "something",
        "wittgenstein",
        "consistently",
        "endorse",
        "solution",
        "apparent",
        "difficulty",
        "present",
        "reconstruction",
        "owed",
        "essential",
        "david",
        "pear",
        "see",
        "pear",
        "complete",
        "argument",
        "remains",
        "show",
        "tractarian",
        "commitment",
        "extrinsic",
        "argument",
        "substance",
        "rule",
        "contingent",
        "simple",
        "suppose",
        "contingent",
        "simple",
        "exists",
        "must",
        "contingent",
        "proposition",
        "elementary",
        "proposition",
        "entailed",
        "elementary",
        "proposition",
        "containing",
        "elementary",
        "proposition",
        "logically",
        "independent",
        "exists",
        "must",
        "nonelementary",
        "analyzable",
        "yet",
        "would",
        "seem",
        "satisfactory",
        "analysis",
        "proposition",
        "assumption",
        "name",
        "contingent",
        "simple",
        "analysis",
        "say",
        "intrinsically",
        "plausible",
        "compatible",
        "tractarian",
        "principle",
        "wittgenstein",
        "analyse",
        "exists",
        "proposition",
        "x",
        "x",
        "two",
        "reason",
        "first",
        "would",
        "reject",
        "analysis",
        "ground",
        "make",
        "ineliminable",
        "use",
        "identity",
        "sign",
        "second",
        "given",
        "analysis",
        "existential",
        "quantification",
        "disjunction",
        "proposition",
        "x",
        "x",
        "would",
        "analysed",
        "noncontingent",
        "proposition",
        "b",
        "c",
        "analyse",
        "exists",
        "fa",
        "ga",
        "ha",
        "negation",
        "conjunction",
        "negation",
        "every",
        "elementary",
        "proposition",
        "involving",
        "a",
        "suppose",
        "could",
        "suppose",
        "proposition",
        "fa",
        "ga",
        "ha",
        "mean",
        "exist",
        "yet",
        "light",
        "tractatus",
        "proposition",
        "would",
        "show",
        "existence",
        "correctly",
        "would",
        "show",
        "something",
        "one",
        "try",
        "put",
        "word",
        "saying",
        "exists",
        "cf",
        "corr",
        "pending",
        "unforeseen",
        "satisfactory",
        "analysis",
        "exists",
        "proposition",
        "analysed",
        "complex",
        "proposition",
        "involving",
        "a",
        "word",
        "treated",
        "incomplete",
        "symbol",
        "fact",
        "existence",
        "taken",
        "consist",
        "fact",
        "object",
        "stand",
        "configured",
        "thus",
        "would",
        "seem",
        "entail",
        "simple",
        "argument",
        "substance",
        "may",
        "criticized",
        "several",
        "ground",
        "first",
        "step",
        "leading",
        "relies",
        "assumption",
        "name",
        "fails",
        "refer",
        "respect",
        "possible",
        "world",
        "actualworld",
        "referent",
        "exist",
        "amount",
        "controversial",
        "assumption",
        "name",
        "function",
        "nathan",
        "salmon",
        "called",
        "obstinately",
        "rigid",
        "designators",
        "salmon",
        "secondly",
        "step",
        "leading",
        "relies",
        "assumption",
        "sentence",
        "neither",
        "true",
        "false",
        "respect",
        "possible",
        "world",
        "fails",
        "express",
        "sense",
        "wittgenstein",
        "later",
        "realize",
        "case",
        "intuitively",
        "senseful",
        "yet",
        "vague",
        "sentence",
        "plausibly",
        "constitutes",
        "counterexample",
        "cf",
        "pi",
        "section",
        "lastly",
        "one",
        "may",
        "question",
        "assumption",
        "make",
        "sense",
        "speak",
        "final",
        "analysis",
        "given",
        "procedure",
        "analysing",
        "sentence",
        "ordinary",
        "language",
        "made",
        "clear",
        "see",
        "pi",
        "section",
        "section"
    ]
}