{
    "main_text": "Moral and Political Writings\n3. Moral and Political Writings\n\nWhen Wollstonecraft began to engage in political commentary in\nreviewing Price’s A Discourse on the Love of our Country, she\npraised him for his account of true patriotism as ‘the result of\nreason, not the undirected impulse of nature, ever tending to selfish\nextremes’ as well as his defence of Christianity’s prescription\nof universal benevolence against those who argued that such sentiments were\nincompatible with the love of one’s country. She endorsed his view of\nliberty of conscience as a sacred right and wrote sympathetically\nabout his plea for the repeal of the Test and Corporation Acts, which\nimposed civil disabilities on Dissenters. She also seemed to support\nhis claim that the political Settlement of 1689 was wanting in that it\ndid not make for full representation of the people and hence made only\nfor partial liberty. Finally, Wollstonecraft reproduced the passage in\nwhich Price linked the American and French revolutions and clamoured\nfor the end of despotism throughout Europe.\n\nWhen not so long thereafter she came to write her Vindication of\nthe Rights of Men (1790), Wollstonecraft attacked Edmund Burke\nfor having set upon an harmless elderly preacher in his\nReflections; yet her own review justifies Burke’s depiction\nof Price’s sermon as inflammatory. Far from thinking that the events\ntaking place in France gave grounds for rejoicing, Burke feared their\nconsequences from the very start. The National Assembly’s confiscation\nof the Church’s property, he predicted, would lead to further\nconfiscations, undermine the fundamental right to property, and result\nin anarchy, which only the rise of a charismatic, authoritarian figure could bring to\nan end.\n\nOf the disagreements between Price and Wollstonecraft, on the one\nhand, and Burke, on the other, one of the deepest was over their\nrespective view of the nature of civil society and of political power\nin general. The two friends believed that government, the rule of law,\nand all human relations could be simplified, explicated, and rendered\ntransparent, and both were convinced that this was the task ahead for\nall lovers of liberty. For Burke, on the contrary, civil society\nconsisted of countless ineffable links between individuals. The\nlatter’s relationship to authority was for the most part no less\nineffable; moreover, he believed sound political judgement to be the\nproduct of experience, and he cautioned prudence. To sweep away\nestablished practices and institutions and think of politics as a mere\nmatter of administrating in accordance with a set of abstract rules or\nrights uninformed by the customs and culture, and hence the national\ncharacter, of a people was, in his view, to demonstrate a crass\ndisregard for the most obvious facts of human nature and history (Conniff 1999).\nBurke’s argument led him to dwell on France’s financial position in\nsome detail, and he defended its royal family and its Church; he\ninsisted, moreover, that it was already benefiting from a policy of\ngradual reform. The overall effect Burke sought to achieve was to depict\nhis opponent as theoretically confused, politically naive, generally\nmisinformed; and to show, most damnably of all, that Price’s sermon on the Love of\nour Country, with all its affirmation of feelings for humanity,\nproved him to be unpatriotic.\n\nWollstonecraft’s Vindication was the first of many replies.\nAmongst those that followed was one by Catharine Macaulay, who had\ninfluenced Wollstonecraft’s pedagogy and was much admired by her (Gunther-Canada 1998; Coffee, 2019). Wollstonecraft’s riposte is an interesting and rhetorically powerful\nwork in its own right as well as a necessary introduction to the\nVindication of the Rights of Woman. It consists mostly of a\nsustained attack on Burke rather than a defence of the rights of man.\nThis is partly because Wollstonecraft took for granted a Lockean\nconception of God-given rights discoverable by reason, except when the\nlatter was warped by self-love. Wollstonecraft further believed that\nGod made all things right and that the cause of all evil was man. In\nher view, Burke’s Reflections showed its author to be blind\nto man-made poverty and injustice; this she attributed to his\ninfatuation with rank, Queen Marie-Antoinette, and the English\nConstitution. Demonstrating her familiarity with Burke’s other works\nand speeches, especially A Philosophical Enquiry into the Origin\nof our Ideas of the Sublime and Beautiful (1757) and the\nSpeech on Conciliation with America (1775), she also argued\nthat he was inconsistent, if only because of the impossibility, as she\nsaw it, of reconciling his sympathy for the American cause with his\nreaction to events in France. In this, Wollstonecraft was far from\nalone and many who had followed Burke’s parliamentary career and heard\nhis Speeches to the House of Commons were astonished by what they\nthought was a radical and inexplicable change of position.\n\nAs she was to do in her next and more famous Vindication,\nWollstonecraft did not simply clamour for rights, but emphasised that\nthese entail duties; but she also insisted that none could be expected\nto perform duties whose natural rights were not respected. Furthermore\nshe used David Hume’s History of England (1754–62) to\ncontend that England’s laws were the product of historical contingency\nand insisted that only those institutions that could withstand the\nscrutiny of reason and be shown to be in conformity with natural\nrights and God’s justice merited respect and obedience. There was no\nquestion of blanket reverence for the past and its juridical legacy.\nAs for civilization, she thought its progress very uneven and\ndismissed the culture of politeness and polish as nothing but a screen\nbehind which hypocrisy, egotism and greed festered unchecked. Finally,\nopposing nature and reason to artifice and politeness, she made\nherself the true patriot and Burke the fickle Francophile. She was the\nclear-headed independent thinker, he the emotive creature of a system\nof patronage. She exhibited manly virtues, he effeminacy; although Mary Fairclough argues that, in truth, there was much in common between each thinker’s treatment of feelings and instincts (Fairclough 2020).\n\nIn the midst of her tirade she turned, rather unexpectedly, to the\nsubject of family life and the limits of parental authority,\nespecially in relation to arranged marriages (Tomaselli 2001). She condemned marriages\nof convenience together with late marriages: both fostered immorality\nin her view. Indeed, from her perspective, nearly every aspect of the\nprevailing culture had that consequence, for, in bringing girls up to\nbe nothing but empty headed playthings, parents made for a morally\nbankrupt society. Such beings could never make dutiful mothers, as\nthey took the horizon to be the eyes of the men they flirted with. The\nmoral depravity of a society devoted to the acquisition of property\nand its conspicuous display rather than to the pursuit of reason and\nthe protection of natural rights found the means of its reproduction\nin the family, she contended. Here her dispute was not just with\nBurke, but implicitly also with Price (Jones, 2005). In his sermon, he had deplored\nthe sexual depravity of the times that he saw embodied even in those\nhe considered patriots. But to seek only to vindicate the rights of\nmen, as Price had done, was insufficient and misconceived, according\nto Wollstonecraft. If one sought a truly moral society, the family had\nto change, and this, in turn, required a complete transformation in the\nnature of the relationship between men and women before, and within,\nmarriage (Botting 2006). Only a sound upbringing of both the sexes could secure that.\nThis was the nub of her attack on political theorists and\neducationalists alike.\n\nWhen Wollstonecraft came to write The Vindication of the Rights of\nWoman, which she did within a matter of months following the\npublication of her first overtly political work, the moral\nrejuvenation of society and the happiness of individual women were\nwoven together. Women were ill-prepared for their duties as social\nbeings and imprisoned in a web of false expectations that would\ninevitably make them miserable. She wanted women to become\nrational and independent beings whose sense of worth came, not\nfrom their appearance, but from their inner perception of self-command\nand knowledge. Women had to be educated; their minds and bodies had to\nbe trained. This would make them good companions, wives, mothers and\ncitizens (Brace 2000). Above all it would make them fully human, that is, beings\nruled by reason and characterised by self-command. Besides criticisms\nof existing pedagogical practices and theories, most notably\nRousseau’s Emile (1762), the Vindication contains\nmany social and political proposals which range from a detailed\noutline of necessary changes in school curriculum to the suggestion\nthat women be granted not only civil and political rights, but have\nelected representatives of their own. It argues that women should be\ntaught skills so as to be able to support themselves and their\nchildren in widowhood, and never have to marry or remarry out of\nfinancial necessity. It seeks to reclaim midwifery for women, against\nthe encroachment of men into this profession, and contends that women\ncould be physicians just as well as nurses. It urges women to extend\ntheir interests to encompass politics and the concerns of the whole of\nhumanity. It also contains advice on how to make marriages last. In\nWollstonecraft’s view, marriages ought to have friendship rather than\nphysical attraction as their basis (Kendrick 2019). Husbands and wives ought not,\nmoreover, to be overly intimate and should maintain a degree of\nreserve towards each other.  This said, she thought sex should be based on genuine mutual physical desire.\n\nWollstonecraft wanted women to aspire to full citizenship, to be\nworthy of it, and this necessitated the development of reason.\nRational women would perceive their real duties. They would forgo the\nworld of mere appearances, the world of insatiable needs on which\neighteenth-century society was based, as Adam Smith had explained more\nlucidly than anyone, and of which France was the embodiment, in\nWollstonecraft’s conception (Leddy 2016).\n\nThat she embraced the social and economic consequences of her vision\nof happy marriages, based on friendship and producing the next moral\ngeneration was spelled out further in her subsequent work, An\nHistorical and Moral View of the Origin and Progress of the French\nRevolution; and the Effect It Has Produced in Europe (1794). In\nthat work, she endeavoured, amongst other things, to assess the merits\nand demerits of the progress of humanity and establish the causes of\nFrench despotism. The picture she drew of ancien\nrégime France was of a country ruled by superstition,\nand morally and politically degenerate. Borrowing from Smith, whose\nTheory of Moral Sentiments (1759) and Inquiry into the\nNature and Causes of the Wealth of Nations (1776) she had drawn\non previously, she sketched a possible future society in which the\ndivision of labour would be kept to a minimum and the sexes would be\nnot only educated together but encouraged to work in family units.\nSingle sex institutions and, for instance, all-male workshops\nencouraged lasciviousness in her view. She thus looked forward to a\nsociety in which small businesses and farms would provide basic,\ninstead of superfluous, needs.\n\nThe combination of her experience of her unrequited love for\nImlay, the dictates of her own emotions, and the tribulations of a\ntrip in Northern Europe led her to reconsider her view of the power of reason.\nIndeed, she was also to review her opinion of France, polite culture and\nmanners, even Catholicism which she had abhorred, a loathing that her\nstay in Portugal had done much to strengthen. The Letters Written\nDuring A Short Residence in Sweden, Norway and Denmark (1796),\nwhose influence on travel literature as well as the Romantic movement\nis by no means negligible, show Wollstonecraft to have begun to\nespouse an increasingly nuanced view of the world, and to have sought to\ndevelop an even more fluid account of the relationship between reason, the imagination, and the\npassions, as well as of modernity. Thus she grew a little closer to\nBurke in that she came to think that the tyranny of commercial wealth\nmight be worse than that of rank and privilege. Whilst in France, she\nhad already begun to write less critically of the English system of\ngovernment. She had witnessed the Terror, fallen in love, born a child\nout of wedlock, been rejected, and attempted suicide. A second suicide\nattempt lay ahead. So did the prospect of happiness with William\nGodwin, a prospect cut short by her death in childbirth. Posthumous\nnotoriety was to follow as Wollstonecraft became identified only with\nthe Vindication of the Rights of Woman and that work was\nironically, in turn, equated with a flouting of social conventions,\nprincipally in relation to marriage.\n",
    "section_title": "3. Moral and Political Writings",
    "entry_title": "Mary Wollstonecraft",
    "hierarchy_title": "Mary Wollstonecraft || Moral and Political Writings",
    "tokenized_text": [
        "moral",
        "political",
        "writing",
        "moral",
        "political",
        "writing",
        "wollstonecraft",
        "began",
        "engage",
        "political",
        "commentary",
        "reviewing",
        "price",
        "discourse",
        "love",
        "country",
        "praised",
        "account",
        "true",
        "patriotism",
        "result",
        "reason",
        "undirected",
        "impulse",
        "nature",
        "ever",
        "tending",
        "selfish",
        "extreme",
        "well",
        "defence",
        "christianity",
        "prescription",
        "universal",
        "benevolence",
        "argued",
        "sentiment",
        "incompatible",
        "love",
        "one",
        "country",
        "endorsed",
        "view",
        "liberty",
        "conscience",
        "sacred",
        "right",
        "wrote",
        "sympathetically",
        "plea",
        "repeal",
        "test",
        "corporation",
        "act",
        "imposed",
        "civil",
        "disability",
        "dissenter",
        "also",
        "seemed",
        "support",
        "claim",
        "political",
        "settlement",
        "wanting",
        "make",
        "full",
        "representation",
        "people",
        "hence",
        "made",
        "partial",
        "liberty",
        "finally",
        "wollstonecraft",
        "reproduced",
        "passage",
        "price",
        "linked",
        "american",
        "french",
        "revolution",
        "clamoured",
        "end",
        "despotism",
        "throughout",
        "europe",
        "long",
        "thereafter",
        "came",
        "write",
        "vindication",
        "right",
        "men",
        "wollstonecraft",
        "attacked",
        "edmund",
        "burke",
        "set",
        "upon",
        "harmless",
        "elderly",
        "preacher",
        "reflection",
        "yet",
        "review",
        "justifies",
        "burke",
        "depiction",
        "price",
        "sermon",
        "inflammatory",
        "far",
        "thinking",
        "event",
        "taking",
        "place",
        "france",
        "gave",
        "ground",
        "rejoicing",
        "burke",
        "feared",
        "consequence",
        "start",
        "national",
        "assembly",
        "confiscation",
        "church",
        "property",
        "predicted",
        "would",
        "lead",
        "confiscation",
        "undermine",
        "fundamental",
        "right",
        "property",
        "result",
        "anarchy",
        "rise",
        "charismatic",
        "authoritarian",
        "figure",
        "could",
        "bring",
        "end",
        "disagreement",
        "price",
        "wollstonecraft",
        "one",
        "hand",
        "burke",
        "one",
        "deepest",
        "respective",
        "view",
        "nature",
        "civil",
        "society",
        "political",
        "power",
        "general",
        "two",
        "friend",
        "believed",
        "government",
        "rule",
        "law",
        "human",
        "relation",
        "could",
        "simplified",
        "explicated",
        "rendered",
        "transparent",
        "convinced",
        "task",
        "ahead",
        "lover",
        "liberty",
        "burke",
        "contrary",
        "civil",
        "society",
        "consisted",
        "countless",
        "ineffable",
        "link",
        "individual",
        "latter",
        "relationship",
        "authority",
        "part",
        "le",
        "ineffable",
        "moreover",
        "believed",
        "sound",
        "political",
        "judgement",
        "product",
        "experience",
        "cautioned",
        "prudence",
        "sweep",
        "away",
        "established",
        "practice",
        "institution",
        "think",
        "politics",
        "mere",
        "matter",
        "administrating",
        "accordance",
        "set",
        "abstract",
        "rule",
        "right",
        "uninformed",
        "custom",
        "culture",
        "hence",
        "national",
        "character",
        "people",
        "view",
        "demonstrate",
        "crass",
        "disregard",
        "obvious",
        "fact",
        "human",
        "nature",
        "history",
        "conniff",
        "burke",
        "argument",
        "led",
        "dwell",
        "france",
        "financial",
        "position",
        "detail",
        "defended",
        "royal",
        "family",
        "church",
        "insisted",
        "moreover",
        "already",
        "benefiting",
        "policy",
        "gradual",
        "reform",
        "overall",
        "effect",
        "burke",
        "sought",
        "achieve",
        "depict",
        "opponent",
        "theoretically",
        "confused",
        "politically",
        "naive",
        "generally",
        "misinformed",
        "show",
        "damnably",
        "price",
        "sermon",
        "love",
        "country",
        "affirmation",
        "feeling",
        "humanity",
        "proved",
        "unpatriotic",
        "wollstonecraft",
        "vindication",
        "first",
        "many",
        "reply",
        "amongst",
        "followed",
        "one",
        "catharine",
        "macaulay",
        "influenced",
        "wollstonecraft",
        "pedagogy",
        "much",
        "admired",
        "gunthercanada",
        "coffee",
        "wollstonecraft",
        "riposte",
        "interesting",
        "rhetorically",
        "powerful",
        "work",
        "right",
        "well",
        "necessary",
        "introduction",
        "vindication",
        "right",
        "woman",
        "consists",
        "mostly",
        "sustained",
        "attack",
        "burke",
        "rather",
        "defence",
        "right",
        "man",
        "partly",
        "wollstonecraft",
        "took",
        "granted",
        "lockean",
        "conception",
        "godgiven",
        "right",
        "discoverable",
        "reason",
        "except",
        "latter",
        "warped",
        "selflove",
        "wollstonecraft",
        "believed",
        "god",
        "made",
        "thing",
        "right",
        "cause",
        "evil",
        "man",
        "view",
        "burke",
        "reflection",
        "showed",
        "author",
        "blind",
        "manmade",
        "poverty",
        "injustice",
        "attributed",
        "infatuation",
        "rank",
        "queen",
        "marieantoinette",
        "english",
        "constitution",
        "demonstrating",
        "familiarity",
        "burke",
        "work",
        "speech",
        "especially",
        "philosophical",
        "enquiry",
        "origin",
        "idea",
        "sublime",
        "beautiful",
        "speech",
        "conciliation",
        "america",
        "also",
        "argued",
        "inconsistent",
        "impossibility",
        "saw",
        "reconciling",
        "sympathy",
        "american",
        "cause",
        "reaction",
        "event",
        "france",
        "wollstonecraft",
        "far",
        "alone",
        "many",
        "followed",
        "burke",
        "parliamentary",
        "career",
        "heard",
        "speech",
        "house",
        "common",
        "astonished",
        "thought",
        "radical",
        "inexplicable",
        "change",
        "position",
        "next",
        "famous",
        "vindication",
        "wollstonecraft",
        "simply",
        "clamour",
        "right",
        "emphasised",
        "entail",
        "duty",
        "also",
        "insisted",
        "none",
        "could",
        "expected",
        "perform",
        "duty",
        "whose",
        "natural",
        "right",
        "respected",
        "furthermore",
        "used",
        "david",
        "hume",
        "history",
        "england",
        "contend",
        "england",
        "law",
        "product",
        "historical",
        "contingency",
        "insisted",
        "institution",
        "could",
        "withstand",
        "scrutiny",
        "reason",
        "shown",
        "conformity",
        "natural",
        "right",
        "god",
        "justice",
        "merited",
        "respect",
        "obedience",
        "question",
        "blanket",
        "reverence",
        "past",
        "juridical",
        "legacy",
        "civilization",
        "thought",
        "progress",
        "uneven",
        "dismissed",
        "culture",
        "politeness",
        "polish",
        "nothing",
        "screen",
        "behind",
        "hypocrisy",
        "egotism",
        "greed",
        "festered",
        "unchecked",
        "finally",
        "opposing",
        "nature",
        "reason",
        "artifice",
        "politeness",
        "made",
        "true",
        "patriot",
        "burke",
        "fickle",
        "francophile",
        "clearheaded",
        "independent",
        "thinker",
        "emotive",
        "creature",
        "system",
        "patronage",
        "exhibited",
        "manly",
        "virtue",
        "effeminacy",
        "although",
        "mary",
        "fairclough",
        "argues",
        "truth",
        "much",
        "common",
        "thinker",
        "treatment",
        "feeling",
        "instinct",
        "fairclough",
        "midst",
        "tirade",
        "turned",
        "rather",
        "unexpectedly",
        "subject",
        "family",
        "life",
        "limit",
        "parental",
        "authority",
        "especially",
        "relation",
        "arranged",
        "marriage",
        "tomaselli",
        "condemned",
        "marriage",
        "convenience",
        "together",
        "late",
        "marriage",
        "fostered",
        "immorality",
        "view",
        "indeed",
        "perspective",
        "nearly",
        "every",
        "aspect",
        "prevailing",
        "culture",
        "consequence",
        "bringing",
        "girl",
        "nothing",
        "empty",
        "headed",
        "plaything",
        "parent",
        "made",
        "morally",
        "bankrupt",
        "society",
        "being",
        "could",
        "never",
        "make",
        "dutiful",
        "mother",
        "took",
        "horizon",
        "eye",
        "men",
        "flirted",
        "moral",
        "depravity",
        "society",
        "devoted",
        "acquisition",
        "property",
        "conspicuous",
        "display",
        "rather",
        "pursuit",
        "reason",
        "protection",
        "natural",
        "right",
        "found",
        "mean",
        "reproduction",
        "family",
        "contended",
        "dispute",
        "burke",
        "implicitly",
        "also",
        "price",
        "jones",
        "sermon",
        "deplored",
        "sexual",
        "depravity",
        "time",
        "saw",
        "embodied",
        "even",
        "considered",
        "patriot",
        "seek",
        "vindicate",
        "right",
        "men",
        "price",
        "done",
        "insufficient",
        "misconceived",
        "according",
        "wollstonecraft",
        "one",
        "sought",
        "truly",
        "moral",
        "society",
        "family",
        "change",
        "turn",
        "required",
        "complete",
        "transformation",
        "nature",
        "relationship",
        "men",
        "woman",
        "within",
        "marriage",
        "botting",
        "sound",
        "upbringing",
        "sex",
        "could",
        "secure",
        "nub",
        "attack",
        "political",
        "theorist",
        "educationalist",
        "alike",
        "wollstonecraft",
        "came",
        "write",
        "vindication",
        "right",
        "woman",
        "within",
        "matter",
        "month",
        "following",
        "publication",
        "first",
        "overtly",
        "political",
        "work",
        "moral",
        "rejuvenation",
        "society",
        "happiness",
        "individual",
        "woman",
        "woven",
        "together",
        "woman",
        "illprepared",
        "duty",
        "social",
        "being",
        "imprisoned",
        "web",
        "false",
        "expectation",
        "would",
        "inevitably",
        "make",
        "miserable",
        "wanted",
        "woman",
        "become",
        "rational",
        "independent",
        "being",
        "whose",
        "sense",
        "worth",
        "came",
        "appearance",
        "inner",
        "perception",
        "selfcommand",
        "knowledge",
        "woman",
        "educated",
        "mind",
        "body",
        "trained",
        "would",
        "make",
        "good",
        "companion",
        "wife",
        "mother",
        "citizen",
        "brace",
        "would",
        "make",
        "fully",
        "human",
        "being",
        "ruled",
        "reason",
        "characterised",
        "selfcommand",
        "besides",
        "criticism",
        "existing",
        "pedagogical",
        "practice",
        "theory",
        "notably",
        "rousseau",
        "emile",
        "vindication",
        "contains",
        "many",
        "social",
        "political",
        "proposal",
        "range",
        "detailed",
        "outline",
        "necessary",
        "change",
        "school",
        "curriculum",
        "suggestion",
        "woman",
        "granted",
        "civil",
        "political",
        "right",
        "elected",
        "representative",
        "argues",
        "woman",
        "taught",
        "skill",
        "able",
        "support",
        "child",
        "widowhood",
        "never",
        "marry",
        "remarry",
        "financial",
        "necessity",
        "seek",
        "reclaim",
        "midwifery",
        "woman",
        "encroachment",
        "men",
        "profession",
        "contends",
        "woman",
        "could",
        "physician",
        "well",
        "nurse",
        "urge",
        "woman",
        "extend",
        "interest",
        "encompass",
        "politics",
        "concern",
        "whole",
        "humanity",
        "also",
        "contains",
        "advice",
        "make",
        "marriage",
        "last",
        "wollstonecraft",
        "view",
        "marriage",
        "ought",
        "friendship",
        "rather",
        "physical",
        "attraction",
        "basis",
        "kendrick",
        "husband",
        "wife",
        "ought",
        "moreover",
        "overly",
        "intimate",
        "maintain",
        "degree",
        "reserve",
        "towards",
        "said",
        "thought",
        "sex",
        "based",
        "genuine",
        "mutual",
        "physical",
        "desire",
        "wollstonecraft",
        "wanted",
        "woman",
        "aspire",
        "full",
        "citizenship",
        "worthy",
        "necessitated",
        "development",
        "reason",
        "rational",
        "woman",
        "would",
        "perceive",
        "real",
        "duty",
        "would",
        "forgo",
        "world",
        "mere",
        "appearance",
        "world",
        "insatiable",
        "need",
        "eighteenthcentury",
        "society",
        "based",
        "adam",
        "smith",
        "explained",
        "lucidly",
        "anyone",
        "france",
        "embodiment",
        "wollstonecraft",
        "conception",
        "leddy",
        "embraced",
        "social",
        "economic",
        "consequence",
        "vision",
        "happy",
        "marriage",
        "based",
        "friendship",
        "producing",
        "next",
        "moral",
        "generation",
        "spelled",
        "subsequent",
        "work",
        "historical",
        "moral",
        "view",
        "origin",
        "progress",
        "french",
        "revolution",
        "effect",
        "produced",
        "europe",
        "work",
        "endeavoured",
        "amongst",
        "thing",
        "ass",
        "merit",
        "demerit",
        "progress",
        "humanity",
        "establish",
        "cause",
        "french",
        "despotism",
        "picture",
        "drew",
        "ancien",
        "régime",
        "france",
        "country",
        "ruled",
        "superstition",
        "morally",
        "politically",
        "degenerate",
        "borrowing",
        "smith",
        "whose",
        "theory",
        "moral",
        "sentiment",
        "inquiry",
        "nature",
        "cause",
        "wealth",
        "nation",
        "drawn",
        "previously",
        "sketched",
        "possible",
        "future",
        "society",
        "division",
        "labour",
        "would",
        "kept",
        "minimum",
        "sex",
        "would",
        "educated",
        "together",
        "encouraged",
        "work",
        "family",
        "unit",
        "single",
        "sex",
        "institution",
        "instance",
        "allmale",
        "workshop",
        "encouraged",
        "lasciviousness",
        "view",
        "thus",
        "looked",
        "forward",
        "society",
        "small",
        "business",
        "farm",
        "would",
        "provide",
        "basic",
        "instead",
        "superfluous",
        "need",
        "combination",
        "experience",
        "unrequited",
        "love",
        "imlay",
        "dictate",
        "emotion",
        "tribulation",
        "trip",
        "northern",
        "europe",
        "led",
        "reconsider",
        "view",
        "power",
        "reason",
        "indeed",
        "also",
        "review",
        "opinion",
        "france",
        "polite",
        "culture",
        "manner",
        "even",
        "catholicism",
        "abhorred",
        "loathing",
        "stay",
        "portugal",
        "done",
        "much",
        "strengthen",
        "letter",
        "written",
        "short",
        "residence",
        "sweden",
        "norway",
        "denmark",
        "whose",
        "influence",
        "travel",
        "literature",
        "well",
        "romantic",
        "movement",
        "mean",
        "negligible",
        "show",
        "wollstonecraft",
        "begun",
        "espouse",
        "increasingly",
        "nuanced",
        "view",
        "world",
        "sought",
        "develop",
        "even",
        "fluid",
        "account",
        "relationship",
        "reason",
        "imagination",
        "passion",
        "well",
        "modernity",
        "thus",
        "grew",
        "little",
        "closer",
        "burke",
        "came",
        "think",
        "tyranny",
        "commercial",
        "wealth",
        "might",
        "worse",
        "rank",
        "privilege",
        "whilst",
        "france",
        "already",
        "begun",
        "write",
        "le",
        "critically",
        "english",
        "system",
        "government",
        "witnessed",
        "terror",
        "fallen",
        "love",
        "born",
        "child",
        "wedlock",
        "rejected",
        "attempted",
        "suicide",
        "second",
        "suicide",
        "attempt",
        "lay",
        "ahead",
        "prospect",
        "happiness",
        "william",
        "godwin",
        "prospect",
        "cut",
        "short",
        "death",
        "childbirth",
        "posthumous",
        "notoriety",
        "follow",
        "wollstonecraft",
        "became",
        "identified",
        "vindication",
        "right",
        "woman",
        "work",
        "ironically",
        "turn",
        "equated",
        "flouting",
        "social",
        "convention",
        "principally",
        "relation",
        "marriage"
    ]
}