{
    "main_text": "Philosophy of Language || Contextualism, Minimalism, and the Lexicon\n3.5 Contextualism, Minimalism, and the Lexicon\n\n“Ordinary language” philosophers of the 1950s and 1960s\nregarded work in formal semantics as essentially irrelevant to issues\nof meaning in natural language. Following Austin and the later\nWittgenstein, they identified meaning with use and were prone to\nconsider the different patterns of use of individual expressions as\noriginating different meanings of the word. Grice (1975) argued that\nsuch a proliferation of meanings could be avoided by distinguishing\nbetween what is asserted by a sentence (to be identified with its\ntruth conditions) and what is communicated by it in a given context\n(or in every “normal” context). For example, consider the\nfollowing exchange:\n\nA: Will Kim be hungry\nat 11am?\nB: Kim had breakfast.\n\n\nAlthough B does not literally assert that Kim had breakfast on that\nparticular day (see, however, Partee 1973), she does communicate as\nmuch. More precisely, A could infer the communicated content by\nnoticing that the asserted sentence, taken literally (“Kim had\nbreakfast at least once in her life”), would be less informative\nthan required in the context: thus, it would violate one or more\nprinciples of conversation (“maxims”) whereas there is no\nreason to suppose that the speaker intended to opt out of\nconversational cooperation (see the entries on\n Paul Grice\n and\n pragmatics).\n If the interlocutor assumes that the speaker intended him to infer\nthe communicated content—i.e., that Kim had breakfast that\nmorning, so presumably she would not be hungry at\n11—cooperation is preserved. Such non-asserted content, called\n‘implicature’, need not be an addition to the overtly\nasserted content: e.g., in irony asserted content is negated rather\nthan expanded by the implicature (think of a speaker uttering\n“Paul is a fine friend” to implicate that Paul has\nwickedly betrayed her).\n\nGrice’s theory of conversation and implicatures was interpreted\nby many (including Grice himself) as a convincing way of accounting\nfor the variety of contextually specific communicative contents while\npreserving the uniqueness of a sentence’s “literal”\nmeaning, which was identified with truth conditions and regarded as\ndetermined by syntax and the conventional meanings of the occurring\nwords, as in formal semantics. The only semantic role context was\nallowed to play was in determining the content of indexical words\n(such as ‘I’, ‘now’, ‘here’, etc.)\nand the effect of context-sensitive structures (such as tense) on a\nsentence’s truth conditions. However, in about the same years\nTravis (1975) and Searle (1979, 1980) pointed out that the semantic\nrelevance of context might be much more pervasive, if not universal:\nintuitively, the same sentence type could have very different truth\nconditions in different contexts, though no indexical expression or\nstructure appeared to be involved. Take the sentence “There is\nmilk in the fridge”: in the context of morning breakfast it will\nbe considered true if there is a carton of milk in the fridge and\nfalse if there is a patch of milk on a tray in the fridge, whereas in\nthe context of cleaning up the kitchen truth conditions are reversed.\nExamples can be multiplied indefinitely, as indefinitely many factors\ncan turn out to be relevant to the truth or falsity of a sentence as\nuttered in a particular context. Such variety cannot be plausibly\nreduced to traditional polysemy such as the polysemy of\n‘property’ (meaning quality or real estate), nor can it be\ndescribed in terms of Gricean implicatures: implicatures are supposed\nnot to affect a sentence’s truth conditions, whereas here it is\nprecisely the sentence’s truth conditions that are seen as\nvarying with context.\n\nThe traditionalist could object by challenging the\ncontextualist’s intuitions about truth conditions. “There\nis milk in the fridge”, she could argue, is true if and only if\nthere is a certain amount (a few molecules will do) of a certain\norganic substance in the relevant fridge (for versions of this\nobjection, Cappelen & Lepore 2005). So the sentence is true both\nin the carton case and in the patch case; it would be false only if\nthe fridge did not contain any amount of any kind of milk (whether cow\nmilk or goat milk or elephant milk). The contextualist’s reply\nis that, in fact, neither the speaker nor the interpreter is aware of\nsuch alleged literal content (the point is challenged by Fodor 1983,\nCarston 2002); but “what is said” must be intuitively\naccessible to the conversational participants (Availability\nPrinciple, Recanati 1989). If truth conditions are associated\nwith what is said—as the traditionalist would agree they\nare—then in many cases a sentence’s literal content, if\nthere is such a thing, does not determine a complete, evaluable\nproposition. For a genuine proposition to arise, a sentence\ntype’s literal content (as determined by syntax and conventional\nword meaning) must be enriched or otherwise modified by primary\npragmatic processes based on the speakers’ background\nknowledge relative to each particular context of use of the sentence.\nSuch processes differ from Gricean implicature-generating processes in\nthat they come into play at the sub-propositional level; moreover,\nthey are not limited to saturation of indexicals but may\ninclude the replacement of a constituent with another. These tenets\ndefine contextualism (Recanati 1993; Bezuidenhout 2002; Carston 2002;\nrelevance theory (Sperber & Wilson 1986) is in some respects a\nprecursor of such views). Contextualists take different stands on\nnature of the semantic contribution made by words to sentences, though\nthey typically agree that it is insufficient to fix truth conditions\n(Stojanovic 2008). See Del Pinal (2018) for an argument that radical\ncontextualism (in particular, truth-conditional pragmatics) should\ninstead commit to rich lexical items which, in certain conditions, do\nsuffice to fix truth conditions.\n\nEven if sentence types have no definite truth conditions, it does not\nfollow that lexical types do not make definite or predictable\ncontributions to the truth conditions of sentences (think of indexical\nwords). It does follow, however, that conventional word meanings are\nnot the final constituents of complete propositions (see Allot &\nTextor 2012). Does this imply that there are no such things as lexical\nmeanings understood as features of a language? If so, how should we\naccount for word acquisition and lexical competence in general?\nRecanati (2004) does not think that contextualism as such is committed\nto meaning eliminativism, the view on which words as types have no\nmeaning; nevertheless, he regards it as defensible. Words could be\nsaid to have, rather than “meaning”, a semantic\npotential, defined as the collection of past uses of a word\nw on the basis of which similarities can be established\nbetween source situations (i.e., the circumstances in which a speaker\nhas used w) and target situations (i.e., candidate occasions\nof application of w). It is natural to object that even\nadmitting that long-term memory could encompass such an immense amount\nof information (think of the number of times ‘table’ or\n‘woman’ are used by an average speaker in the course of\nher life), surely working memory could not review such information to\nmake sense of new uses. On the other hand, if words were associated\nwith “more abstract schemata corresponding to types of\nsituations”, as Recanati suggests as a less radical alternative\nto meaning eliminativism, one wonders what the difference would be\nwith respect to traditional accounts in terms of polysemy.\n\nOther conceptions of “what is said” make more room for the\nsemantic contribution of conventional word meanings. Bach (1994)\nagrees with contextualists that the linguistic meaning of words (plus\nsyntax and after saturation) does not always determine complete,\ntruth-evaluable propositions; however, he maintains that they do\nprovide some minimal semantic information, a so-called\n‘propositional radical’, that allows pragmatic processes\nto issue in one or more propositions. Bach identifies “what is\nsaid” with this minimal information. However, many have objected\nthat minimal content is extremely hard to isolate (Recanati 2004;\nStanley 2007). Suppose it is identified with the content that all the\nutterances of a sentence type share; unfortunately, no such content\ncan be attributed to a sentence such as “Every bottle is in the\nfridge”, for there is no proposition that is stably asserted by\nevery utterance of it (surely not the proposition that every bottle in\nthe universe is in the fridge, which is never asserted).\nStanley’s (2007) indexicalism rejects the notion of\nminimal proposition and any distinction between semantic content and\ncommunicated content: communicated content can be entirely captured by\nmeans of consciously accessible, linguistically controlled content\n(content that results from semantic value together with the provision\nof values to free variables in syntax, or semantic value together with\nthe provision of arguments to functions from semantic types to\npropositions) together with general conversational norms. Accordingly,\nStanley generalizes contextual saturation processes that are usually\nregarded as characteristic of indexicals, tense, and a few other\nstructures; moreover, he requires that the relevant variables be\nlinguistically encoded, either syntactically or lexically. It remains\nto be seen whether such solutions apply (in a non-ad hoc way)\nto all the examples of content modulation that have been presented in\nthe literature.\n\nFinally, minimalism (Borg 2004, 2012; Cappelen & Lepore\n2005) is the view that appears (and intends) to be closest to the\nFrege-Montague tradition. The task of a semantic theory is said to be\nminimal in that it is supposed to account only for the literal meaning\nof sentences: context does not affect literal semantic content but\n“what the speaker says” as opposed to “what the\nsentence means” (Borg 2012). In this sense, semantics is not\nanother name for the theory of meaning, because not all\nmeaning-related properties are semantic properties (Borg 2004).\nContrary to contextualism and Bach’s theory, minimalism holds\nthat lexicon and syntax together determine complete truth-evaluable\npropositions. Indeed, this is definitional for lexical meaning: word\nmeanings are the kind of things which, if one puts enough of them\ntogether in the right sort of way, then what one gets is propositional\ncontent (Borg 2012). Borg believes that, in order to be\ntruth-evaluable, propositional contents must be “about the\nworld”, and that this entails some form of semantic externalism.\nHowever, the identification of lexical meaning with reference makes it\nhard to account for semantic relations such as synonymy, analytic\nentailment or the difference between ambiguity and polysemy, and\nsyntactically relevant properties: the difference between “John\nis easy to please” and “John is eager to please”\ncannot be explained by the fact that ‘easy’ means the\nproperty easy (see the\nentry on\n ambiguity).\n To account for semantically based syntactic properties, words may\ncome with “instructions” that are not, however,\nconstitutive of a word’s meaning like meaning postulates (which\nBorg rejects), though awareness of them is part of a speaker’s\ncompetence. Once more, lexical semantic competence is divorced from\ngrasp of word meaning. In conclusion, some information counts as\nlexical if it is either perceived as such in “firm, type-level\nlexical intuitions” or capable of affecting the word’s\nsyntactic behavior. Borg concedes that even such an extended\nconception of lexical content will not capture, e.g., analytic\nentailments such as the relation between ‘bachelor’ and\n‘unmarried’.\n",
    "section_title": "3.5 Contextualism, Minimalism, and the Lexicon",
    "entry_title": "Word Meaning",
    "hierarchy_title": "Word Meaning || Philosophy of Language || Contextualism, Minimalism, and the Lexicon",
    "tokenized_text": [
        "philosophy",
        "language",
        "contextualism",
        "minimalism",
        "lexicon",
        "contextualism",
        "minimalism",
        "lexicon",
        "ordinary",
        "language",
        "philosopher",
        "s",
        "s",
        "regarded",
        "work",
        "formal",
        "semantics",
        "essentially",
        "irrelevant",
        "issue",
        "meaning",
        "natural",
        "language",
        "following",
        "austin",
        "later",
        "wittgenstein",
        "identified",
        "meaning",
        "use",
        "prone",
        "consider",
        "different",
        "pattern",
        "use",
        "individual",
        "expression",
        "originating",
        "different",
        "meaning",
        "word",
        "grice",
        "argued",
        "proliferation",
        "meaning",
        "could",
        "avoided",
        "distinguishing",
        "asserted",
        "sentence",
        "identified",
        "truth",
        "condition",
        "communicated",
        "given",
        "context",
        "every",
        "normal",
        "context",
        "example",
        "consider",
        "following",
        "exchange",
        "kim",
        "hungry",
        "am",
        "b",
        "kim",
        "breakfast",
        "although",
        "b",
        "literally",
        "assert",
        "kim",
        "breakfast",
        "particular",
        "day",
        "see",
        "however",
        "partee",
        "communicate",
        "much",
        "precisely",
        "could",
        "infer",
        "communicated",
        "content",
        "noticing",
        "asserted",
        "sentence",
        "taken",
        "literally",
        "kim",
        "breakfast",
        "least",
        "life",
        "would",
        "le",
        "informative",
        "required",
        "context",
        "thus",
        "would",
        "violate",
        "one",
        "principle",
        "conversation",
        "maxim",
        "whereas",
        "reason",
        "suppose",
        "speaker",
        "intended",
        "opt",
        "conversational",
        "cooperation",
        "see",
        "entry",
        "paul",
        "grice",
        "pragmatic",
        "interlocutor",
        "assumes",
        "speaker",
        "intended",
        "infer",
        "communicated",
        "contentie",
        "kim",
        "breakfast",
        "morning",
        "presumably",
        "would",
        "hungry",
        "cooperation",
        "preserved",
        "nonasserted",
        "content",
        "called",
        "implicature",
        "need",
        "addition",
        "overtly",
        "asserted",
        "content",
        "eg",
        "irony",
        "asserted",
        "content",
        "negated",
        "rather",
        "expanded",
        "implicature",
        "think",
        "speaker",
        "uttering",
        "paul",
        "fine",
        "friend",
        "implicate",
        "paul",
        "wickedly",
        "betrayed",
        "grice",
        "theory",
        "conversation",
        "implicatures",
        "interpreted",
        "many",
        "including",
        "grice",
        "convincing",
        "way",
        "accounting",
        "variety",
        "contextually",
        "specific",
        "communicative",
        "content",
        "preserving",
        "uniqueness",
        "sentence",
        "literal",
        "meaning",
        "identified",
        "truth",
        "condition",
        "regarded",
        "determined",
        "syntax",
        "conventional",
        "meaning",
        "occurring",
        "word",
        "formal",
        "semantics",
        "semantic",
        "role",
        "context",
        "allowed",
        "play",
        "determining",
        "content",
        "indexical",
        "word",
        "etc",
        "effect",
        "contextsensitive",
        "structure",
        "tense",
        "sentence",
        "truth",
        "condition",
        "however",
        "year",
        "travis",
        "searle",
        "pointed",
        "semantic",
        "relevance",
        "context",
        "might",
        "much",
        "pervasive",
        "universal",
        "intuitively",
        "sentence",
        "type",
        "could",
        "different",
        "truth",
        "condition",
        "different",
        "context",
        "though",
        "indexical",
        "expression",
        "structure",
        "appeared",
        "involved",
        "take",
        "sentence",
        "milk",
        "fridge",
        "context",
        "morning",
        "breakfast",
        "considered",
        "true",
        "carton",
        "milk",
        "fridge",
        "false",
        "patch",
        "milk",
        "tray",
        "fridge",
        "whereas",
        "context",
        "cleaning",
        "kitchen",
        "truth",
        "condition",
        "reversed",
        "example",
        "multiplied",
        "indefinitely",
        "indefinitely",
        "many",
        "factor",
        "turn",
        "relevant",
        "truth",
        "falsity",
        "sentence",
        "uttered",
        "particular",
        "context",
        "variety",
        "plausibly",
        "reduced",
        "traditional",
        "polysemy",
        "polysemy",
        "property",
        "meaning",
        "quality",
        "real",
        "estate",
        "described",
        "term",
        "gricean",
        "implicatures",
        "implicatures",
        "supposed",
        "affect",
        "sentence",
        "truth",
        "condition",
        "whereas",
        "precisely",
        "sentence",
        "truth",
        "condition",
        "seen",
        "varying",
        "context",
        "traditionalist",
        "could",
        "object",
        "challenging",
        "contextualist",
        "intuition",
        "truth",
        "condition",
        "milk",
        "fridge",
        "could",
        "argue",
        "true",
        "certain",
        "amount",
        "molecule",
        "certain",
        "organic",
        "substance",
        "relevant",
        "fridge",
        "version",
        "objection",
        "cappelen",
        "lepore",
        "sentence",
        "true",
        "carton",
        "case",
        "patch",
        "case",
        "would",
        "false",
        "fridge",
        "contain",
        "amount",
        "kind",
        "milk",
        "whether",
        "cow",
        "milk",
        "goat",
        "milk",
        "elephant",
        "milk",
        "contextualist",
        "reply",
        "fact",
        "neither",
        "speaker",
        "interpreter",
        "aware",
        "alleged",
        "literal",
        "content",
        "point",
        "challenged",
        "fodor",
        "carston",
        "said",
        "must",
        "intuitively",
        "accessible",
        "conversational",
        "participant",
        "availability",
        "principle",
        "recanati",
        "truth",
        "condition",
        "associated",
        "saidas",
        "traditionalist",
        "would",
        "agree",
        "arethen",
        "many",
        "case",
        "sentence",
        "literal",
        "content",
        "thing",
        "determine",
        "complete",
        "evaluable",
        "proposition",
        "genuine",
        "proposition",
        "arise",
        "sentence",
        "type",
        "literal",
        "content",
        "determined",
        "syntax",
        "conventional",
        "word",
        "meaning",
        "must",
        "enriched",
        "otherwise",
        "modified",
        "primary",
        "pragmatic",
        "process",
        "based",
        "speaker",
        "background",
        "knowledge",
        "relative",
        "particular",
        "context",
        "use",
        "sentence",
        "process",
        "differ",
        "gricean",
        "implicaturegenerating",
        "process",
        "come",
        "play",
        "subpropositional",
        "level",
        "moreover",
        "limited",
        "saturation",
        "indexicals",
        "may",
        "include",
        "replacement",
        "constituent",
        "another",
        "tenet",
        "define",
        "contextualism",
        "recanati",
        "bezuidenhout",
        "carston",
        "relevance",
        "theory",
        "sperber",
        "wilson",
        "respect",
        "precursor",
        "view",
        "contextualists",
        "take",
        "different",
        "stand",
        "nature",
        "semantic",
        "contribution",
        "made",
        "word",
        "sentence",
        "though",
        "typically",
        "agree",
        "insufficient",
        "fix",
        "truth",
        "condition",
        "stojanovic",
        "see",
        "del",
        "pinal",
        "argument",
        "radical",
        "contextualism",
        "particular",
        "truthconditional",
        "pragmatic",
        "instead",
        "commit",
        "rich",
        "lexical",
        "item",
        "certain",
        "condition",
        "suffice",
        "fix",
        "truth",
        "condition",
        "even",
        "sentence",
        "type",
        "definite",
        "truth",
        "condition",
        "follow",
        "lexical",
        "type",
        "make",
        "definite",
        "predictable",
        "contribution",
        "truth",
        "condition",
        "sentence",
        "think",
        "indexical",
        "word",
        "follow",
        "however",
        "conventional",
        "word",
        "meaning",
        "final",
        "constituent",
        "complete",
        "proposition",
        "see",
        "allot",
        "textor",
        "imply",
        "thing",
        "lexical",
        "meaning",
        "understood",
        "feature",
        "language",
        "account",
        "word",
        "acquisition",
        "lexical",
        "competence",
        "general",
        "recanati",
        "think",
        "contextualism",
        "committed",
        "meaning",
        "eliminativism",
        "view",
        "word",
        "type",
        "meaning",
        "nevertheless",
        "regard",
        "defensible",
        "word",
        "could",
        "said",
        "rather",
        "meaning",
        "semantic",
        "potential",
        "defined",
        "collection",
        "past",
        "us",
        "word",
        "w",
        "basis",
        "similarity",
        "established",
        "source",
        "situation",
        "ie",
        "circumstance",
        "speaker",
        "used",
        "w",
        "target",
        "situation",
        "ie",
        "candidate",
        "occasion",
        "application",
        "w",
        "natural",
        "object",
        "even",
        "admitting",
        "longterm",
        "memory",
        "could",
        "encompass",
        "immense",
        "amount",
        "information",
        "think",
        "number",
        "time",
        "table",
        "woman",
        "used",
        "average",
        "speaker",
        "course",
        "life",
        "surely",
        "working",
        "memory",
        "could",
        "review",
        "information",
        "make",
        "sense",
        "new",
        "us",
        "hand",
        "word",
        "associated",
        "abstract",
        "schema",
        "corresponding",
        "type",
        "situation",
        "recanati",
        "suggests",
        "le",
        "radical",
        "alternative",
        "meaning",
        "eliminativism",
        "one",
        "wonder",
        "difference",
        "would",
        "respect",
        "traditional",
        "account",
        "term",
        "polysemy",
        "conception",
        "said",
        "make",
        "room",
        "semantic",
        "contribution",
        "conventional",
        "word",
        "meaning",
        "bach",
        "agrees",
        "contextualists",
        "linguistic",
        "meaning",
        "word",
        "plus",
        "syntax",
        "saturation",
        "always",
        "determine",
        "complete",
        "truthevaluable",
        "proposition",
        "however",
        "maintains",
        "provide",
        "minimal",
        "semantic",
        "information",
        "socalled",
        "propositional",
        "radical",
        "allows",
        "pragmatic",
        "process",
        "issue",
        "one",
        "proposition",
        "bach",
        "identifies",
        "said",
        "minimal",
        "information",
        "however",
        "many",
        "objected",
        "minimal",
        "content",
        "extremely",
        "hard",
        "isolate",
        "recanati",
        "stanley",
        "suppose",
        "identified",
        "content",
        "utterance",
        "sentence",
        "type",
        "share",
        "unfortunately",
        "content",
        "attributed",
        "sentence",
        "every",
        "bottle",
        "fridge",
        "proposition",
        "stably",
        "asserted",
        "every",
        "utterance",
        "surely",
        "proposition",
        "every",
        "bottle",
        "universe",
        "fridge",
        "never",
        "asserted",
        "stanley",
        "indexicalism",
        "reject",
        "notion",
        "minimal",
        "proposition",
        "distinction",
        "semantic",
        "content",
        "communicated",
        "content",
        "communicated",
        "content",
        "entirely",
        "captured",
        "mean",
        "consciously",
        "accessible",
        "linguistically",
        "controlled",
        "content",
        "content",
        "result",
        "semantic",
        "value",
        "together",
        "provision",
        "value",
        "free",
        "variable",
        "syntax",
        "semantic",
        "value",
        "together",
        "provision",
        "argument",
        "function",
        "semantic",
        "type",
        "proposition",
        "together",
        "general",
        "conversational",
        "norm",
        "accordingly",
        "stanley",
        "generalizes",
        "contextual",
        "saturation",
        "process",
        "usually",
        "regarded",
        "characteristic",
        "indexicals",
        "tense",
        "structure",
        "moreover",
        "requires",
        "relevant",
        "variable",
        "linguistically",
        "encoded",
        "either",
        "syntactically",
        "lexically",
        "remains",
        "seen",
        "whether",
        "solution",
        "apply",
        "nonad",
        "hoc",
        "way",
        "example",
        "content",
        "modulation",
        "presented",
        "literature",
        "finally",
        "minimalism",
        "borg",
        "cappelen",
        "lepore",
        "view",
        "appears",
        "intends",
        "closest",
        "fregemontague",
        "tradition",
        "task",
        "semantic",
        "theory",
        "said",
        "minimal",
        "supposed",
        "account",
        "literal",
        "meaning",
        "sentence",
        "context",
        "affect",
        "literal",
        "semantic",
        "content",
        "speaker",
        "say",
        "opposed",
        "sentence",
        "mean",
        "borg",
        "sense",
        "semantics",
        "another",
        "name",
        "theory",
        "meaning",
        "meaningrelated",
        "property",
        "semantic",
        "property",
        "borg",
        "contrary",
        "contextualism",
        "bach",
        "theory",
        "minimalism",
        "hold",
        "lexicon",
        "syntax",
        "together",
        "determine",
        "complete",
        "truthevaluable",
        "proposition",
        "indeed",
        "definitional",
        "lexical",
        "meaning",
        "word",
        "meaning",
        "kind",
        "thing",
        "one",
        "put",
        "enough",
        "together",
        "right",
        "sort",
        "way",
        "one",
        "get",
        "propositional",
        "content",
        "borg",
        "borg",
        "belief",
        "order",
        "truthevaluable",
        "propositional",
        "content",
        "must",
        "world",
        "entail",
        "form",
        "semantic",
        "externalism",
        "however",
        "identification",
        "lexical",
        "meaning",
        "reference",
        "make",
        "hard",
        "account",
        "semantic",
        "relation",
        "synonymy",
        "analytic",
        "entailment",
        "difference",
        "ambiguity",
        "polysemy",
        "syntactically",
        "relevant",
        "property",
        "difference",
        "john",
        "easy",
        "please",
        "john",
        "eager",
        "please",
        "explained",
        "fact",
        "easy",
        "mean",
        "property",
        "easy",
        "see",
        "entry",
        "ambiguity",
        "account",
        "semantically",
        "based",
        "syntactic",
        "property",
        "word",
        "may",
        "come",
        "instruction",
        "however",
        "constitutive",
        "word",
        "meaning",
        "like",
        "meaning",
        "postulate",
        "borg",
        "reject",
        "though",
        "awareness",
        "part",
        "speaker",
        "competence",
        "lexical",
        "semantic",
        "competence",
        "divorced",
        "grasp",
        "word",
        "meaning",
        "conclusion",
        "information",
        "count",
        "lexical",
        "either",
        "perceived",
        "firm",
        "typelevel",
        "lexical",
        "intuition",
        "capable",
        "affecting",
        "word",
        "syntactic",
        "behavior",
        "borg",
        "concedes",
        "even",
        "extended",
        "conception",
        "lexical",
        "content",
        "capture",
        "eg",
        "analytic",
        "entailment",
        "relation",
        "bachelor",
        "unmarried"
    ]
}