{
    "main_text": "The Value of Work || Opposition to Work and Work-centred Culture\n2.2 Opposition to Work and Work-centred Culture\n\nThat work is a potential source of income, social and personal goods,\nmeaning, or dignity, does not entail that work in fact\nprovides these goods or that work is good for us on balance.\nSince the Industrial Revolution in particular, many philosophers and\nsocial theorists have been sceptical about the value of work and of\nthe work-centred cultures typical of contemporary affluent societies\n(Deranty 2015).\n\nCrucially, much of the scepticism surrounding the value of work is not\nscepticism about the value of work per se but scepticism\nabout the value of work in present day social conditions or scepticism\nabout the veneration of work found in the “Protestant work\nethic” (Weber 1904–05) or in work-centred societies.\nSceptics about work-centred culture question whether popular\nenthusiasm for work is rational or well-informed or whether it gives\nadequate credence to alternatives to work-centred culture (Cholbi\n2018b, Sage 2019). Indeed, many critics of contemporary work\narrangements essentially argue that good or desirable work is possible\nbut rarer than we suppose. In “Useful Work versus Useful\nToil,” (1884), for example, the socialist activist William\nMorris rejects “the creed of modern morality that all labor is\ngood in itself” and argues for a distinction between work that\nis “a blessing, a lightening of life” and work that is\n“a mere curse, a burden to life,” offering us no hope of\nrest, no hope of producing anything genuinely useful, and no hope of\npleasure in its performance. Similarly, the anarchist Bob Black opens\nhis essay “The Abolition of Work” (1985) as follows:\n\nNo one should ever work. Work is the source of nearly all the misery\nin the world. Almost any evil you’d care to name comes from\nworking or from living in a world designed for work. In order to stop\nsuffering, we have to stop working.\n\n\nBut Black proceeds to define work as “forced labor, that is,\ncompulsory production.” His ‘abolition’ of work is\nthus compatible with individuals voluntarily engaging in\neconomically productive activities, which (as we have seen) can\nresemble work in its essentials.\n\nDanaher (2019:54) allows that work can contribute to human well-being,\nbut as presently organized, the world of work is “structurally\nbad” and unlikely to change in these respects:\n\nThe labor market in most developed countries has settled into an\nequilibrium pattern that makes work very bad for many people, that is\ngetting worse as a result of technical and institutional changes, and\nthat is very difficult to reform or improve in such a way as to remove\nits bad-making properties.\n\n\nThus, even those espousing stridently ‘anti-work’\npositions usually target not work as such, but work as it has been\norganized or understood in the contemporary world. Indeed, much of\ntheir ire is directed at current conditions of employment, which (as\nnoted earlier) is only one prominent species work can take.\n\nThe sceptical case against work or work culture has many dimensions,\nbut can be fruitfully analysed as having four strands:\n\n\n\nGoods not realized: While work can be a source of various\ngoods, many people’s working lives fail to provide them these\ngoods. Popular enthusiasm for work thus seems misplaced, according to\nwork sceptics, for “the moral sanctity of work is painfully out\nof step with the way that a vast proportion of people actually\nexperience their jobs” (Frayne 2015: 62–63).\n\nWith respect to the exchange value of work, work is often poorly\ncompensated or insecure. Contemporary economies are increasingly\ncharacterized by a ‘hollowing out’ of middle class labor,\nwherein wages continue to increase for those at the upper end of the\nwage scale, wages stagnate at the bottom end of the scale, and the\nnumber of workers in the middle strata shrinks. This has resulted in\nthe emergence of a class of ‘working poor,’ individuals\nwho lack sufficient income to pay for basic needs such as housing or\nfood despite being employed.\n\nMany of the other potential goods of work are enjoyed by some workers,\nbut many receive little social recognition or do not achieve a greater\nsense of community through their work. A good deal of socially\nvaluable or ‘essential’ work is largely invisible to its\nbeneficiaries. Many jobs are dull or unchallenging, contributing\nlittle to the development or exercise of our more sophisticated human\ncapacities. It is difficult to envision, for instance, that toll booth\nworkers find their jobs or stimulating or challenging (aside from\ntesting their ability to withstand repetition or boredom).\n\nModern work has been oriented around the division of labor,\ni.e., the increasing separation of productive processes into ever\nsmaller tasks. (The factory assembly line provides the model here.)\nThe division of labor results in workers becoming hyper-specialists,\nwho repetitively perform narrow or simple tasks. Although the division\nof labor increases overall economic productivity, critics such as the\nclassical economist Adam Smith worried that it eventually makes\nworkers “as stupid and ignorant as it is possible for a human\ncreature to become.” (Smith 1776 [1976]: V.1.178) As to meaning\nor dignity, a wide swath of human work neither engages workers nor\nallows them to exercise their autonomous judgment, and many work in\noppressive or exploitative conditions seemingly at odds with the\ndignity of the work they perform. \n\n\nInternal tensions among work goods: A characteristic of\nwork-centred societies is that their members look to work to provide\nthem with many different goods. But work (and employment in\nparticular) may be ill-suited to provide this package of goods, i.e.,\nwork may be capable of providing some of these goods but only at the\nexpense of others. For instance, many of the professions that\nindividuals view as offering the greatest opportunities for meaningful\nwork (such as education, counseling, or care for the sick, young, or\ndisabled) are among the poorest paid professions. Contemporary labor\nmarkets thus seem to offer a workers the opportunity for an inadequate\nincome or meaningful work, but rarely both. The psychologist Barry\nSchwartz argues (2015) that our non-material motivations for work,\nsuch as seeking meaningfulness, social engagement, and opportunities\nfor autonomy, are in motivational competition with the monetary\nincentives associated with work. The monetary incentives distort\nworkplace attitudes and behaviours so that the non-material goods we\nseek in work are crowded out by a focus on productivity and the\neconomic goods work makes available. That labor markets are\ncompetitive may also undermine the social benefits of work, for even\nthose who succeed in the labor market do so by being ‘pitted\nagainst’ other workers in ways that reduce solidarity among\nthem, turning fellow citizens into rivals who are indifferent (or even\nhostile to) each other’s interests (Hussain 2020). \n\n\nUnrecognized bads or costs: Sceptics also point to\n‘bads’ or costs associated with work that tend to go\nunrecognized. The most obvious of these is the opportunity costs\nresulting from the amount of time spent working. Typically, full-time\nworkers spend 1,500–2,500 hours per year on the job, equivalent\nto around nine to fifteen weeks annually. These are hours that, were\nthey not allocated to working, could be devoted to leisure, sleep,\nexercise, family life, civic and community engagement, and so on (Rose\n2016). These hours do not include the considerable amount of time that\nworkers expend on training or educating themselves for work or on\ncommuting to and from workplaces. Nor does it include the hours that\nmany salaried workers are expected to be ‘connected’ or\n‘on call’ by their employers. Formal employment also tends\nto preclude workers from work other than that performed for their\nemployers, with the result that workers often end up paying other\nworkers for that labor. Such costs include the hiring of housekeepers,\nchild care providers, maintenance experts and landscapers, etc. And\nwhile unemployment seems to have adverse effects on our physical and\nmental well-being, working is not free of adverse health effects\neither, including stress, emotional frustration, and physical ailments\nfrom repetitive work tasks or ergonomic deficiencies in workplace\ndesign.\n\nSceptics also argue that when work fails to deliver certain kinds of\ngoods, workers suffer certain psychological bads. Three such classes\nof bads merit particular attention:\n\nMarx’s critique of work under capitalism rests on the notion\nthat work often lacks goods whose absence gives rise to the further\nbad of alienation. Marx (1844) proposed that work under\ncapitalism alienates workers from what they produce, inasmuch as\nworkers have little if any say over what is produced and how; from the\nact of work itself, inasmuch as workers are compelled by economic\nnecessity to work and so do not take intrinsic satisfaction in\nworking; from their own human nature or “species-essence,”\ninasmuch as workers do not witness their own agency or intentions\n“objectified” in the products of their work; and from\nother workers, inasmuch as capitalism treats workers as\ninterchangeable inputs of production and pits worker against worker.\nIn terms of our earlier enumeration of the goods of work, Marx’s\nappeal to alienation suggests that the absence of these goods is not\nmerely a lack or a deprivation but is a positive bad of work in its\nown right (Elster 1989, Brudney 1998, Kandiyali 2020).\nMany work sceptics emphasize how work may distort our priorities\nor values. The value of work, in their eyes, has come to be an\nunquestioned ethical dogma. “The economists and the moralists\nhave cast a sacred halo over work,” according to Paul LaFargue\n(1883), instilling us in the “delusion” of the “love\nof work.” (See also Frayne 2015.) Bertrand Russell (1932) argued\nthat the veneration of work has eroded our appreciation of the value\nof leisure and idleness. (See also O’Connor 2018.) Economists\nsuch as Keynes (1930) observed that the dramatic increases in economic\nproductivity have often not led to reductions in work time, a\ndevelopment he attributes to a work ethic that stymies our capacity to\nenjoy leisure and abundance.\nThe social cachet of work may end up warping our moral\nrelationship to ourselves, treating ourselves not as intrinsically\nvaluable but as mere instruments of production. Hannah Arendt (1958)\nargued that conceiving of ourselves primarily as workers leads to a\nsort of instrumental stance on ourselves and other human agents, in\nwhich we come to view ourselves purely as resources for production or\nsites of consumption. More recent critics have proposed that\nwork-centred cultures encourage us to view the self as a commodity to\nbe ‘branded’ or marketed to prospective employers (Davis\n2003).\n\n\nLastly, work can have costs to others besides workers themselves. The\naforementioned opportunity costs deriving from time devoted to work\nmay worsen workers’ relationships with others or bar their\ncommunities from making use of those workers’ skills for\nsocially worthwhile purposes. Some work arguably makes workers\ncomplicit in harmful or unjust practices, such as the sale of tobacco\nor unhealthy foods. Workers may also impose negative\nexternalities through their work. For example, working outside\nthe home typically results in a greater environmental impact,\nincluding contributions to the carbon outputs responsible for global\nclimate change (James 2018). \n\n\nAlternatives sources of work-related goods: A last thread in\n‘anti-work’ thinking is that, even to the degree that work\nis good, it is not obviously uniquely situated to provide the goods it\nprovides. A sense of social recognition or identity can be rooted in\ndomains of human life besides employment, such as volunteer work,\nfamily life, religion, or friendship. “Ludic” activities,\ni.e., play, can offer opportunities to exercise and hone our rational\ncapacities (Black 1985, Nguyen 2019). Some have proposed that virtual\nreality will provide us simulacra of work-like activities that could\nthereby substitute for work itself. Contrary to Gheaus and Herzog\n(2016) then, work may not be a “a privileged context” for\nrealizing the goods we associate with work. \n\n\nAnti-work theorists typically call for work to be re-valued such that\nindividuals will ‘work to live, not live to work,’ as well\nas policies (such as reductions in the mandated weekly working time)\nto minimize the influence of work on our quality of life. That work is\nboth unavoidable and seemingly necessary but frustrating might suggest\nthe wisdom of an ironic stance toward work (de Botton 2010).\n",
    "section_title": "2.2 Opposition to Work and Work-centred Culture",
    "entry_title": "Philosophical Approaches to Work and Labor",
    "hierarchy_title": "Philosophical Approaches to Work and Labor || The Value of Work || Opposition to Work and Work-centred Culture",
    "tokenized_text": [
        "value",
        "work",
        "opposition",
        "work",
        "workcentred",
        "culture",
        "opposition",
        "work",
        "workcentred",
        "culture",
        "work",
        "potential",
        "source",
        "income",
        "social",
        "personal",
        "good",
        "meaning",
        "dignity",
        "entail",
        "work",
        "fact",
        "provides",
        "good",
        "work",
        "good",
        "u",
        "balance",
        "since",
        "industrial",
        "revolution",
        "particular",
        "many",
        "philosopher",
        "social",
        "theorist",
        "sceptical",
        "value",
        "work",
        "workcentred",
        "culture",
        "typical",
        "contemporary",
        "affluent",
        "society",
        "deranty",
        "crucially",
        "much",
        "scepticism",
        "surrounding",
        "value",
        "work",
        "scepticism",
        "value",
        "work",
        "per",
        "se",
        "scepticism",
        "value",
        "work",
        "present",
        "day",
        "social",
        "condition",
        "scepticism",
        "veneration",
        "work",
        "found",
        "protestant",
        "work",
        "ethic",
        "weber",
        "workcentred",
        "society",
        "sceptic",
        "workcentred",
        "culture",
        "question",
        "whether",
        "popular",
        "enthusiasm",
        "work",
        "rational",
        "wellinformed",
        "whether",
        "give",
        "adequate",
        "credence",
        "alternative",
        "workcentred",
        "culture",
        "cholbi",
        "b",
        "sage",
        "indeed",
        "many",
        "critic",
        "contemporary",
        "work",
        "arrangement",
        "essentially",
        "argue",
        "good",
        "desirable",
        "work",
        "possible",
        "rarer",
        "suppose",
        "useful",
        "work",
        "versus",
        "useful",
        "toil",
        "example",
        "socialist",
        "activist",
        "william",
        "morris",
        "reject",
        "creed",
        "modern",
        "morality",
        "labor",
        "good",
        "argues",
        "distinction",
        "work",
        "blessing",
        "lightening",
        "life",
        "work",
        "mere",
        "curse",
        "burden",
        "life",
        "offering",
        "u",
        "hope",
        "rest",
        "hope",
        "producing",
        "anything",
        "genuinely",
        "useful",
        "hope",
        "pleasure",
        "performance",
        "similarly",
        "anarchist",
        "bob",
        "black",
        "open",
        "essay",
        "abolition",
        "work",
        "follows",
        "one",
        "ever",
        "work",
        "work",
        "source",
        "nearly",
        "misery",
        "world",
        "almost",
        "evil",
        "care",
        "name",
        "come",
        "working",
        "living",
        "world",
        "designed",
        "work",
        "order",
        "stop",
        "suffering",
        "stop",
        "working",
        "black",
        "proceeds",
        "define",
        "work",
        "forced",
        "labor",
        "compulsory",
        "production",
        "abolition",
        "work",
        "thus",
        "compatible",
        "individual",
        "voluntarily",
        "engaging",
        "economically",
        "productive",
        "activity",
        "seen",
        "resemble",
        "work",
        "essential",
        "danaher",
        "allows",
        "work",
        "contribute",
        "human",
        "wellbeing",
        "presently",
        "organized",
        "world",
        "work",
        "structurally",
        "bad",
        "unlikely",
        "change",
        "respect",
        "labor",
        "market",
        "developed",
        "country",
        "settled",
        "equilibrium",
        "pattern",
        "make",
        "work",
        "bad",
        "many",
        "people",
        "getting",
        "worse",
        "result",
        "technical",
        "institutional",
        "change",
        "difficult",
        "reform",
        "improve",
        "way",
        "remove",
        "badmaking",
        "property",
        "thus",
        "even",
        "espousing",
        "stridently",
        "antiwork",
        "position",
        "usually",
        "target",
        "work",
        "work",
        "organized",
        "understood",
        "contemporary",
        "world",
        "indeed",
        "much",
        "ire",
        "directed",
        "current",
        "condition",
        "employment",
        "noted",
        "earlier",
        "one",
        "prominent",
        "specie",
        "work",
        "take",
        "sceptical",
        "case",
        "work",
        "work",
        "culture",
        "many",
        "dimension",
        "fruitfully",
        "analysed",
        "four",
        "strand",
        "good",
        "realized",
        "work",
        "source",
        "various",
        "good",
        "many",
        "people",
        "working",
        "life",
        "fail",
        "provide",
        "good",
        "popular",
        "enthusiasm",
        "work",
        "thus",
        "seems",
        "misplaced",
        "according",
        "work",
        "sceptic",
        "moral",
        "sanctity",
        "work",
        "painfully",
        "step",
        "way",
        "vast",
        "proportion",
        "people",
        "actually",
        "experience",
        "job",
        "frayne",
        "respect",
        "exchange",
        "value",
        "work",
        "work",
        "often",
        "poorly",
        "compensated",
        "insecure",
        "contemporary",
        "economy",
        "increasingly",
        "characterized",
        "hollowing",
        "middle",
        "class",
        "labor",
        "wherein",
        "wage",
        "continue",
        "increase",
        "upper",
        "end",
        "wage",
        "scale",
        "wage",
        "stagnate",
        "bottom",
        "end",
        "scale",
        "number",
        "worker",
        "middle",
        "stratum",
        "shrink",
        "resulted",
        "emergence",
        "class",
        "working",
        "poor",
        "individual",
        "lack",
        "sufficient",
        "income",
        "pay",
        "basic",
        "need",
        "housing",
        "food",
        "despite",
        "employed",
        "many",
        "potential",
        "good",
        "work",
        "enjoyed",
        "worker",
        "many",
        "receive",
        "little",
        "social",
        "recognition",
        "achieve",
        "greater",
        "sense",
        "community",
        "work",
        "good",
        "deal",
        "socially",
        "valuable",
        "essential",
        "work",
        "largely",
        "invisible",
        "beneficiary",
        "many",
        "job",
        "dull",
        "unchallenging",
        "contributing",
        "little",
        "development",
        "exercise",
        "sophisticated",
        "human",
        "capacity",
        "difficult",
        "envision",
        "instance",
        "toll",
        "booth",
        "worker",
        "find",
        "job",
        "stimulating",
        "challenging",
        "aside",
        "testing",
        "ability",
        "withstand",
        "repetition",
        "boredom",
        "modern",
        "work",
        "oriented",
        "around",
        "division",
        "labor",
        "ie",
        "increasing",
        "separation",
        "productive",
        "process",
        "ever",
        "smaller",
        "task",
        "factory",
        "assembly",
        "line",
        "provides",
        "model",
        "division",
        "labor",
        "result",
        "worker",
        "becoming",
        "hyperspecialists",
        "repetitively",
        "perform",
        "narrow",
        "simple",
        "task",
        "although",
        "division",
        "labor",
        "increase",
        "overall",
        "economic",
        "productivity",
        "critic",
        "classical",
        "economist",
        "adam",
        "smith",
        "worried",
        "eventually",
        "make",
        "worker",
        "stupid",
        "ignorant",
        "possible",
        "human",
        "creature",
        "become",
        "smith",
        "v",
        "meaning",
        "dignity",
        "wide",
        "swath",
        "human",
        "work",
        "neither",
        "engages",
        "worker",
        "allows",
        "exercise",
        "autonomous",
        "judgment",
        "many",
        "work",
        "oppressive",
        "exploitative",
        "condition",
        "seemingly",
        "odds",
        "dignity",
        "work",
        "perform",
        "internal",
        "tension",
        "among",
        "work",
        "good",
        "characteristic",
        "workcentred",
        "society",
        "member",
        "look",
        "work",
        "provide",
        "many",
        "different",
        "good",
        "work",
        "employment",
        "particular",
        "may",
        "illsuited",
        "provide",
        "package",
        "good",
        "ie",
        "work",
        "may",
        "capable",
        "providing",
        "good",
        "expense",
        "others",
        "instance",
        "many",
        "profession",
        "individual",
        "view",
        "offering",
        "greatest",
        "opportunity",
        "meaningful",
        "work",
        "education",
        "counseling",
        "care",
        "sick",
        "young",
        "disabled",
        "among",
        "poorest",
        "paid",
        "profession",
        "contemporary",
        "labor",
        "market",
        "thus",
        "seem",
        "offer",
        "worker",
        "opportunity",
        "inadequate",
        "income",
        "meaningful",
        "work",
        "rarely",
        "psychologist",
        "barry",
        "schwartz",
        "argues",
        "nonmaterial",
        "motivation",
        "work",
        "seeking",
        "meaningfulness",
        "social",
        "engagement",
        "opportunity",
        "autonomy",
        "motivational",
        "competition",
        "monetary",
        "incentive",
        "associated",
        "work",
        "monetary",
        "incentive",
        "distort",
        "workplace",
        "attitude",
        "behaviour",
        "nonmaterial",
        "good",
        "seek",
        "work",
        "crowded",
        "focus",
        "productivity",
        "economic",
        "good",
        "work",
        "make",
        "available",
        "labor",
        "market",
        "competitive",
        "may",
        "also",
        "undermine",
        "social",
        "benefit",
        "work",
        "even",
        "succeed",
        "labor",
        "market",
        "pitted",
        "worker",
        "way",
        "reduce",
        "solidarity",
        "among",
        "turning",
        "fellow",
        "citizen",
        "rival",
        "indifferent",
        "even",
        "hostile",
        "interest",
        "hussain",
        "unrecognized",
        "bad",
        "cost",
        "sceptic",
        "also",
        "point",
        "bad",
        "cost",
        "associated",
        "work",
        "tend",
        "go",
        "unrecognized",
        "obvious",
        "opportunity",
        "cost",
        "resulting",
        "amount",
        "time",
        "spent",
        "working",
        "typically",
        "fulltime",
        "worker",
        "spend",
        "hour",
        "per",
        "year",
        "job",
        "equivalent",
        "around",
        "nine",
        "fifteen",
        "week",
        "annually",
        "hour",
        "allocated",
        "working",
        "could",
        "devoted",
        "leisure",
        "sleep",
        "exercise",
        "family",
        "life",
        "civic",
        "community",
        "engagement",
        "rose",
        "hour",
        "include",
        "considerable",
        "amount",
        "time",
        "worker",
        "expend",
        "training",
        "educating",
        "work",
        "commuting",
        "workplace",
        "include",
        "hour",
        "many",
        "salaried",
        "worker",
        "expected",
        "connected",
        "call",
        "employer",
        "formal",
        "employment",
        "also",
        "tends",
        "preclude",
        "worker",
        "work",
        "performed",
        "employer",
        "result",
        "worker",
        "often",
        "end",
        "paying",
        "worker",
        "labor",
        "cost",
        "include",
        "hiring",
        "housekeeper",
        "child",
        "care",
        "provider",
        "maintenance",
        "expert",
        "landscaper",
        "etc",
        "unemployment",
        "seems",
        "adverse",
        "effect",
        "physical",
        "mental",
        "wellbeing",
        "working",
        "free",
        "adverse",
        "health",
        "effect",
        "either",
        "including",
        "stress",
        "emotional",
        "frustration",
        "physical",
        "ailment",
        "repetitive",
        "work",
        "task",
        "ergonomic",
        "deficiency",
        "workplace",
        "design",
        "sceptic",
        "also",
        "argue",
        "work",
        "fails",
        "deliver",
        "certain",
        "kind",
        "good",
        "worker",
        "suffer",
        "certain",
        "psychological",
        "bad",
        "three",
        "class",
        "bad",
        "merit",
        "particular",
        "attention",
        "marx",
        "critique",
        "work",
        "capitalism",
        "rest",
        "notion",
        "work",
        "often",
        "lack",
        "good",
        "whose",
        "absence",
        "give",
        "rise",
        "bad",
        "alienation",
        "marx",
        "proposed",
        "work",
        "capitalism",
        "alienates",
        "worker",
        "produce",
        "inasmuch",
        "worker",
        "little",
        "say",
        "produced",
        "act",
        "work",
        "inasmuch",
        "worker",
        "compelled",
        "economic",
        "necessity",
        "work",
        "take",
        "intrinsic",
        "satisfaction",
        "working",
        "human",
        "nature",
        "speciesessence",
        "inasmuch",
        "worker",
        "witness",
        "agency",
        "intention",
        "objectified",
        "product",
        "work",
        "worker",
        "inasmuch",
        "capitalism",
        "treat",
        "worker",
        "interchangeable",
        "input",
        "production",
        "pit",
        "worker",
        "worker",
        "term",
        "earlier",
        "enumeration",
        "good",
        "work",
        "marx",
        "appeal",
        "alienation",
        "suggests",
        "absence",
        "good",
        "merely",
        "lack",
        "deprivation",
        "positive",
        "bad",
        "work",
        "right",
        "elster",
        "brudney",
        "kandiyali",
        "many",
        "work",
        "sceptic",
        "emphasize",
        "work",
        "may",
        "distort",
        "priority",
        "value",
        "value",
        "work",
        "eye",
        "come",
        "unquestioned",
        "ethical",
        "dogma",
        "economist",
        "moralist",
        "cast",
        "sacred",
        "halo",
        "work",
        "according",
        "paul",
        "lafargue",
        "instilling",
        "u",
        "delusion",
        "love",
        "work",
        "see",
        "also",
        "frayne",
        "bertrand",
        "russell",
        "argued",
        "veneration",
        "work",
        "eroded",
        "appreciation",
        "value",
        "leisure",
        "idleness",
        "see",
        "also",
        "connor",
        "economist",
        "keynes",
        "observed",
        "dramatic",
        "increase",
        "economic",
        "productivity",
        "often",
        "led",
        "reduction",
        "work",
        "time",
        "development",
        "attribute",
        "work",
        "ethic",
        "stymy",
        "capacity",
        "enjoy",
        "leisure",
        "abundance",
        "social",
        "cachet",
        "work",
        "may",
        "end",
        "warping",
        "moral",
        "relationship",
        "treating",
        "intrinsically",
        "valuable",
        "mere",
        "instrument",
        "production",
        "hannah",
        "arendt",
        "argued",
        "conceiving",
        "primarily",
        "worker",
        "lead",
        "sort",
        "instrumental",
        "stance",
        "human",
        "agent",
        "come",
        "view",
        "purely",
        "resource",
        "production",
        "site",
        "consumption",
        "recent",
        "critic",
        "proposed",
        "workcentred",
        "culture",
        "encourage",
        "u",
        "view",
        "self",
        "commodity",
        "branded",
        "marketed",
        "prospective",
        "employer",
        "davis",
        "lastly",
        "work",
        "cost",
        "others",
        "besides",
        "worker",
        "aforementioned",
        "opportunity",
        "cost",
        "deriving",
        "time",
        "devoted",
        "work",
        "may",
        "worsen",
        "worker",
        "relationship",
        "others",
        "bar",
        "community",
        "making",
        "use",
        "worker",
        "skill",
        "socially",
        "worthwhile",
        "purpose",
        "work",
        "arguably",
        "make",
        "worker",
        "complicit",
        "harmful",
        "unjust",
        "practice",
        "sale",
        "tobacco",
        "unhealthy",
        "food",
        "worker",
        "may",
        "also",
        "impose",
        "negative",
        "externality",
        "work",
        "example",
        "working",
        "outside",
        "home",
        "typically",
        "result",
        "greater",
        "environmental",
        "impact",
        "including",
        "contribution",
        "carbon",
        "output",
        "responsible",
        "global",
        "climate",
        "change",
        "james",
        "alternative",
        "source",
        "workrelated",
        "good",
        "last",
        "thread",
        "antiwork",
        "thinking",
        "even",
        "degree",
        "work",
        "good",
        "obviously",
        "uniquely",
        "situated",
        "provide",
        "good",
        "provides",
        "sense",
        "social",
        "recognition",
        "identity",
        "rooted",
        "domain",
        "human",
        "life",
        "besides",
        "employment",
        "volunteer",
        "work",
        "family",
        "life",
        "religion",
        "friendship",
        "ludic",
        "activity",
        "ie",
        "play",
        "offer",
        "opportunity",
        "exercise",
        "hone",
        "rational",
        "capacity",
        "black",
        "nguyen",
        "proposed",
        "virtual",
        "reality",
        "provide",
        "u",
        "simulacrum",
        "worklike",
        "activity",
        "could",
        "thereby",
        "substitute",
        "work",
        "contrary",
        "gheaus",
        "herzog",
        "work",
        "may",
        "privileged",
        "context",
        "realizing",
        "good",
        "associate",
        "work",
        "antiwork",
        "theorist",
        "typically",
        "call",
        "work",
        "revalued",
        "individual",
        "work",
        "live",
        "live",
        "work",
        "well",
        "policy",
        "reduction",
        "mandated",
        "weekly",
        "working",
        "time",
        "minimize",
        "influence",
        "work",
        "quality",
        "life",
        "work",
        "unavoidable",
        "seemingly",
        "necessary",
        "frustrating",
        "might",
        "suggest",
        "wisdom",
        "ironic",
        "stance",
        "toward",
        "work",
        "de",
        "botton"
    ]
}