{
    "main_text": "Debates in Contemporary Political Theory || The Liberal Rejection of World Government\n2.2 The Liberal Rejection of World Government\n\nWe now turn to debates about world government among contemporary\nliberal theorists. Since the publication of John Rawls’s\nlandmark A Theory of Justice in 1971, liberal theorists such\nas Charles Beitz and Thomas Pogge have sought to formulate a\ncosmopolitan version of liberalism by extending Rawlsian principles of\ndomestic justice to the international realm. According to Beitz, a\ncosmopolitan liberal conception of international morality is\n\n\nconcerned with the moral relations of members of a universal community\nin which state boundaries have a merely derivative significance. (1979\n[1999a: 181–2])\n\n\nCosmopolitan liberalism evaluates the morality of domestic and\ninternational institutions based on “an impartial consideration\nof the claims of each person who would be affected” (1999b:\n287). A cosmopolitan liberal theory of global justice thus begins with\na conception of humanity as a common moral community of free and equal\npersons. There is debate among contemporary theorists about the\nrelationship and distinction between moral cosmopolitanism and\npolitical or institutional cosmopolitanism in the form of a world\nstate or government (Beitz 1994; Dufek 2013; Ypi 2013; Cabrera 2018\nand 2019).\n\nContemporary liberal theorists have traditionally argued that world\ngovernment, in the form of a global leviathan with supreme\nlegislative, executive, adjudicative and enforcement powers, is\nlargely unnecessary to solve problems such as war, global poverty, and\nenvironmental catastrophe. World government so conceived is neither\nnecessary nor sufficient to achieve the aims of a liberal agenda (Yack\n2012). Even cosmopolitan liberals have not argued that moral\ncosmopolitanism necessarily entails political cosmopolitanism in the\nform of a world government.\n\nAlthough Rawls himself rejects cosmopolitan liberalism, disagreeing\nwith his liberal critics on several critical issues related to global\ndistributive justice, they are united in their agreement that a world\nstate is not part of a liberal ideal for world order. In his treatise\non global order, The Law of Peoples, Rawls forwards the\nconcept of a society of peoples, governed by principles that will\naccommodate “cooperative associations and federations among\npeoples, but will not affirm a world-state” (1999: 36). He\nexplicitly states his reason for rejecting the idea of a world state\nor government:\n\n\nHere I follow Kant’s lead in Perpetual Peace (1795) in\nthinking that a world government—by which I mean a unified\npolitical regime with the legal powers normally exercised by central\ngovernments—would either be a global despotism or else would\nrule over a fragile empire torn by frequent civil strife as various\nregions and peoples tried to gain their political freedom and\nautonomy. (1999: 36)\n\n\nOther liberal thinkers have similarly rejected the desirability of\nworld government in the form of a domestic state writ large to cover\nthe entire globe (Beitz 1999b: 182; Jones 1999: 229; Tan 2000 and\n2004; Pogge 1988: 285; Satz 1999: 77–8; Risse 2012).\n\nIn a related objection, “communitarian” liberals, such as\nMichael Walzer, argue against a centralized world government as a\nthreat to social pluralism. Walzer thus endorses “sovereign\nstatehood” as “a way of protecting distinct historical\ncultures, sometimes national, sometimes ethnic/religious in\ncharacter”, and rejects a centralized global order because he\ndoes not\n\n\nsee how it could accommodate anything like the range of cultural and\nreligious difference that we see around us today. … For some\ncultures and most orthodox religions can only survive if they are\npermitted degrees of separation that are incompatible with globalism.\nAnd so the survival of these groups would be at risk; under the rules\nof the global state, they would not be able to sustain and pass on\ntheir way of life. (2004: 172 and 176)\n\n\nAt the same time that distinct communities may constitute intrinsic\nhuman goods, Walzer also endorses social and political pluralism as an\ninstrumental good: given the diversity of human values, he argues that\nthey\n\n\nare best pursued politically in circumstances where there are many\navenues of pursuit, many agents in pursuit. The dream of a single\nagent—the enlightened despot, the civilizing imperium, the\ncommunist vanguard, the global state—is a delusion. (2004:\n188)\n\n\nA world of distinct, autonomous communities may be important to\ncurbing the appetite of a hegemonic or global state to re-make the\nworld in its own image. Liberal nationalists and communitarians thus\nobject to world government due to the homogeneity\nargument—world government may be so strong and pervasive as to\ncreate a homogenizing effect, obliterating distinct cultures and\ncommunities that are intrinsically valuable. Liberal political\npluralists (Muñiz-Fraticelli 2014) are concerned that any\nstate, including a world government, could destroy associative groups\nthat constitute legitimate sources of political authority; and by\ndestroying the rich social pluralism that animates human life (Walzer\n2004), produce a loss of value (Miller 2007; Valentini 2012).\n\nThe liberal rejection of world government, however, does not amount to\nan endorsement of the conventional system of sovereign states or the\ncontemporary international order, “with its extreme injustices,\ncrippling poverty, and inequalities” (Rawls 1999: 117).\nRawls’s rejection of a world government does not negate the\nlegitimacy and desirability of establishing international or\ntransnational institutions to regulate cooperation between peoples and\neven to discharge certain common inter-societal duties. Thus, after\nhis rejection of a world state, Rawls goes on to say that in a\nwell-ordered society of peoples, organizations\n\n\n(such as the United Nations ideally conceived) may have the authority\nto express for the society of well-ordered peoples their condemnation\nof unjust domestic institutions in other countries and clear cases of\nthe violation of human rights. In grave cases they may try to correct\nthem by economic sanctions, or even by military intervention. The\nscope of these powers covers all peoples and reaches their domestic\naffairs. (1999: 36)\n\n\nRawls’s vision of global order clearly rejects a world of\natomistic sovereign states with the traditional powers of absolute\nsovereignty. Instead, his global vision includes “new\ninstitutions and practices” to “constrain outlaw states\nwhen they appear” (1999: 48), to promote human rights, and to\ndischarge the duty of assistance owed to burdened societies.\n\nThomas Pogge argues that realizing\n\n\na peaceful and ecologically sound future will … require\nsupranational institutions and organizations that limit the\nsovereignty rights of states more severely than is the current\npractice. (2000: 213)\n\n\nHe sees this development to be possible only when a majority of states\nare stable democracies (2000: 213–4). Pogge thus appears to\nagree with Rawls that the path to perpetual peace (and environmental\nsafety) lies in promoting the development of well-ordered states,\ncharacterized by democratically representative, responsive and\nresponsible domestic governments.\n\nAs these lines of argument by Rawls and Pogge suggest, liberals have\nbeen quick to reject framing the choice of world orders as one between\neither a world of traditional sovereign states or a\nworld with a global central government. Pogge has asserted that\nliberals should\n\n\ndispense with the traditional concept of sovereignty and leave behind\nall-or-nothing debates about world government.\n\n\nInstead, he argues for an\n\n\nintermediate solution that provides for some central organs of world\ngovernment without, however, investing them with [exclusive]\n“ultimate sovereign power and authority”. (1988: 285)\n\n\nIn this “multi-layered scheme in which ultimate political\nauthority is vertically dispersed”, states that retain ultimate\npolitical authority in some areas would be juxtaposed with a world\ngovernment with “central coercive mechanisms of law\nenforcement” that has ultimate political authority in other\nareas (Pogge 2009: 205–6). Debra Satz has also argued that\nframing the choice as one between the current states system and\n“an all-powerful world-state” poses a false dilemma:\n\n\nthe contrast between a system of sovereign states and a centralized\nworld-state is too crude. There are many other possibilities,\nincluding a state system restrained by international and\nintergovernmental institutions, a non-state-based economic system, a\nglobal separation-of-powers scheme, international federalism, and\nregional political-economic structures, such as those currently being\ndeveloped in western Europe and the Americas (via NAFTA). (Satz 1999:\n77–8)\n\n\nSimon Caney has also endorsed a system of international institutions\ndesigned to\n\n\nprovide a reliable and effective means of protecting people’s\nbasis interests (and instrumental consideration) and also to provide a\nfair forum for determining which rules should govern the global\neconomy (a procedural component). (2006: 734)\n\n\nAs the many liberal proposals for moral improvement of the world order\nindicate, liberal objections to world government—whether they\ntake the form of tyranny/homogeneity arguments and/or the\ninefficiency/soullessness objections—are not motivated by a\ncomplacent attitude towards the contemporary world order and its\nresulting conditions (Pogge 2000). As Charles Jones has put it, these\nvalid and plausible objections to world government do not show that\n“the status quo is preferable to some alternative\narrangement” (1999: 229). While liberal theorists acknowledge\nthe tyrannical potential of a world government, they also acknowledge\nthat “sovereign states are themselves often the cause of the\nrights-violations of their citizens” (1999: 229). Kok-Chor Tan\ncharacterizes liberal proposals for world order to involve, therefore,\nneither world government nor absolute state sovereignty. Instead,\nliberals have argued consistently for restrictions on the traditional\npowers of sovereignty, as well as for the vertical dispersion of\nsovereignty, “upwards towards supranational bodies, and also\ndownwards toward particular communities within states” (2000:\n101). In such a world order, states become “another level of\nappeal, and not the sole and final one” (2000: 101).\n\nDavid Held argues that this dispersion of sovereignty is inevitable\ngiven that the nation-state does not exist in an insular world, but a\nhighly interdependent and complex system: the contemporary reality\nconsists of a globalized economy, international organizations,\nregional and global institutions, international law, and military\nalliances, all of which operate to shape and constrain individual\nstates. Although national sovereignty still has a place in the\ncontemporary world order,\n\n\ninterconnected authority structures … displace notions of\nsovereignty as an illimitable, indivisible and exclusive form of\npublic power. (1995: 137)\n\n\nIn Held’s account of cosmopolitan democracy, the universal\nrealization of the liberal ideal of autonomy, derived from Kant,\nultimately requires long-term institutional developments such as the\ncreation of a global parliament, an international criminal court, the\ndemilitarization of states, and global distributive justice in the\nform of a guaranteed annual income for each individual (1995:\n279–80). Although cosmopolitan theorists tend to reject the\ndichotomy posed between a political system of sovereign states and one\nwith a centralized world government, and have tended to eschew the\nterminology of the world state in their accounts of global democratic\ninstitutional reform, William Scheuerman has argued that some of their\nproposals of supranational institutions mimic core attributes of\ntraditional statehood, thus inadvertently bringing the world state\nback into liberal cosmopolitan visions of world order (2014). It is\nthus an open question whether “statist cosmopolitanism”\n(Ypi 2011), which considers states as viable agents of cosmopolitan\njustice, is feasible, or whether cosmopolitanism requires transcending\nthe state system (Ulaş 2017).\n",
    "section_title": "2.2 The Liberal Rejection of World Government",
    "entry_title": "World Government",
    "hierarchy_title": "World Government || Debates in Contemporary Political Theory || The Liberal Rejection of World Government",
    "tokenized_text": [
        "debate",
        "contemporary",
        "political",
        "theory",
        "liberal",
        "rejection",
        "world",
        "government",
        "liberal",
        "rejection",
        "world",
        "government",
        "turn",
        "debate",
        "world",
        "government",
        "among",
        "contemporary",
        "liberal",
        "theorist",
        "since",
        "publication",
        "john",
        "rawls",
        "landmark",
        "theory",
        "justice",
        "liberal",
        "theorist",
        "charles",
        "beitz",
        "thomas",
        "pogge",
        "sought",
        "formulate",
        "cosmopolitan",
        "version",
        "liberalism",
        "extending",
        "rawlsian",
        "principle",
        "domestic",
        "justice",
        "international",
        "realm",
        "according",
        "beitz",
        "cosmopolitan",
        "liberal",
        "conception",
        "international",
        "morality",
        "concerned",
        "moral",
        "relation",
        "member",
        "universal",
        "community",
        "state",
        "boundary",
        "merely",
        "derivative",
        "significance",
        "a",
        "cosmopolitan",
        "liberalism",
        "evaluates",
        "morality",
        "domestic",
        "international",
        "institution",
        "based",
        "impartial",
        "consideration",
        "claim",
        "person",
        "would",
        "affected",
        "b",
        "cosmopolitan",
        "liberal",
        "theory",
        "global",
        "justice",
        "thus",
        "begin",
        "conception",
        "humanity",
        "common",
        "moral",
        "community",
        "free",
        "equal",
        "person",
        "debate",
        "among",
        "contemporary",
        "theorist",
        "relationship",
        "distinction",
        "moral",
        "cosmopolitanism",
        "political",
        "institutional",
        "cosmopolitanism",
        "form",
        "world",
        "state",
        "government",
        "beitz",
        "dufek",
        "ypi",
        "cabrera",
        "contemporary",
        "liberal",
        "theorist",
        "traditionally",
        "argued",
        "world",
        "government",
        "form",
        "global",
        "leviathan",
        "supreme",
        "legislative",
        "executive",
        "adjudicative",
        "enforcement",
        "power",
        "largely",
        "unnecessary",
        "solve",
        "problem",
        "war",
        "global",
        "poverty",
        "environmental",
        "catastrophe",
        "world",
        "government",
        "conceived",
        "neither",
        "necessary",
        "sufficient",
        "achieve",
        "aim",
        "liberal",
        "agenda",
        "yack",
        "even",
        "cosmopolitan",
        "liberal",
        "argued",
        "moral",
        "cosmopolitanism",
        "necessarily",
        "entail",
        "political",
        "cosmopolitanism",
        "form",
        "world",
        "government",
        "although",
        "rawls",
        "reject",
        "cosmopolitan",
        "liberalism",
        "disagreeing",
        "liberal",
        "critic",
        "several",
        "critical",
        "issue",
        "related",
        "global",
        "distributive",
        "justice",
        "united",
        "agreement",
        "world",
        "state",
        "part",
        "liberal",
        "ideal",
        "world",
        "order",
        "treatise",
        "global",
        "order",
        "law",
        "people",
        "rawls",
        "forward",
        "concept",
        "society",
        "people",
        "governed",
        "principle",
        "accommodate",
        "cooperative",
        "association",
        "federation",
        "among",
        "people",
        "affirm",
        "worldstate",
        "explicitly",
        "state",
        "reason",
        "rejecting",
        "idea",
        "world",
        "state",
        "government",
        "follow",
        "kant",
        "lead",
        "perpetual",
        "peace",
        "thinking",
        "world",
        "governmentby",
        "mean",
        "unified",
        "political",
        "regime",
        "legal",
        "power",
        "normally",
        "exercised",
        "central",
        "governmentswould",
        "either",
        "global",
        "despotism",
        "else",
        "would",
        "rule",
        "fragile",
        "empire",
        "torn",
        "frequent",
        "civil",
        "strife",
        "various",
        "region",
        "people",
        "tried",
        "gain",
        "political",
        "freedom",
        "autonomy",
        "liberal",
        "thinker",
        "similarly",
        "rejected",
        "desirability",
        "world",
        "government",
        "form",
        "domestic",
        "state",
        "writ",
        "large",
        "cover",
        "entire",
        "globe",
        "beitz",
        "b",
        "jones",
        "tan",
        "pogge",
        "satz",
        "risse",
        "related",
        "objection",
        "communitarian",
        "liberal",
        "michael",
        "walzer",
        "argue",
        "centralized",
        "world",
        "government",
        "threat",
        "social",
        "pluralism",
        "walzer",
        "thus",
        "endorses",
        "sovereign",
        "statehood",
        "way",
        "protecting",
        "distinct",
        "historical",
        "culture",
        "sometimes",
        "national",
        "sometimes",
        "ethnicreligious",
        "character",
        "reject",
        "centralized",
        "global",
        "order",
        "see",
        "could",
        "accommodate",
        "anything",
        "like",
        "range",
        "cultural",
        "religious",
        "difference",
        "see",
        "around",
        "u",
        "today",
        "culture",
        "orthodox",
        "religion",
        "survive",
        "permitted",
        "degree",
        "separation",
        "incompatible",
        "globalism",
        "survival",
        "group",
        "would",
        "risk",
        "rule",
        "global",
        "state",
        "would",
        "able",
        "sustain",
        "pas",
        "way",
        "life",
        "time",
        "distinct",
        "community",
        "may",
        "constitute",
        "intrinsic",
        "human",
        "good",
        "walzer",
        "also",
        "endorses",
        "social",
        "political",
        "pluralism",
        "instrumental",
        "good",
        "given",
        "diversity",
        "human",
        "value",
        "argues",
        "best",
        "pursued",
        "politically",
        "circumstance",
        "many",
        "avenue",
        "pursuit",
        "many",
        "agent",
        "pursuit",
        "dream",
        "single",
        "agentthe",
        "enlightened",
        "despot",
        "civilizing",
        "imperium",
        "communist",
        "vanguard",
        "global",
        "stateis",
        "delusion",
        "world",
        "distinct",
        "autonomous",
        "community",
        "may",
        "important",
        "curbing",
        "appetite",
        "hegemonic",
        "global",
        "state",
        "remake",
        "world",
        "image",
        "liberal",
        "nationalist",
        "communitarians",
        "thus",
        "object",
        "world",
        "government",
        "due",
        "homogeneity",
        "argumentworld",
        "government",
        "may",
        "strong",
        "pervasive",
        "create",
        "homogenizing",
        "effect",
        "obliterating",
        "distinct",
        "culture",
        "community",
        "intrinsically",
        "valuable",
        "liberal",
        "political",
        "pluralist",
        "muñizfraticelli",
        "concerned",
        "state",
        "including",
        "world",
        "government",
        "could",
        "destroy",
        "associative",
        "group",
        "constitute",
        "legitimate",
        "source",
        "political",
        "authority",
        "destroying",
        "rich",
        "social",
        "pluralism",
        "animates",
        "human",
        "life",
        "walzer",
        "produce",
        "loss",
        "value",
        "miller",
        "valentini",
        "liberal",
        "rejection",
        "world",
        "government",
        "however",
        "amount",
        "endorsement",
        "conventional",
        "system",
        "sovereign",
        "state",
        "contemporary",
        "international",
        "order",
        "extreme",
        "injustice",
        "crippling",
        "poverty",
        "inequality",
        "rawls",
        "rawls",
        "rejection",
        "world",
        "government",
        "negate",
        "legitimacy",
        "desirability",
        "establishing",
        "international",
        "transnational",
        "institution",
        "regulate",
        "cooperation",
        "people",
        "even",
        "discharge",
        "certain",
        "common",
        "intersocietal",
        "duty",
        "thus",
        "rejection",
        "world",
        "state",
        "rawls",
        "go",
        "say",
        "wellordered",
        "society",
        "people",
        "organization",
        "united",
        "nation",
        "ideally",
        "conceived",
        "may",
        "authority",
        "express",
        "society",
        "wellordered",
        "people",
        "condemnation",
        "unjust",
        "domestic",
        "institution",
        "country",
        "clear",
        "case",
        "violation",
        "human",
        "right",
        "grave",
        "case",
        "may",
        "try",
        "correct",
        "economic",
        "sanction",
        "even",
        "military",
        "intervention",
        "scope",
        "power",
        "cover",
        "people",
        "reach",
        "domestic",
        "affair",
        "rawls",
        "vision",
        "global",
        "order",
        "clearly",
        "reject",
        "world",
        "atomistic",
        "sovereign",
        "state",
        "traditional",
        "power",
        "absolute",
        "sovereignty",
        "instead",
        "global",
        "vision",
        "includes",
        "new",
        "institution",
        "practice",
        "constrain",
        "outlaw",
        "state",
        "appear",
        "promote",
        "human",
        "right",
        "discharge",
        "duty",
        "assistance",
        "owed",
        "burdened",
        "society",
        "thomas",
        "pogge",
        "argues",
        "realizing",
        "peaceful",
        "ecologically",
        "sound",
        "future",
        "require",
        "supranational",
        "institution",
        "organization",
        "limit",
        "sovereignty",
        "right",
        "state",
        "severely",
        "current",
        "practice",
        "see",
        "development",
        "possible",
        "majority",
        "state",
        "stable",
        "democracy",
        "pogge",
        "thus",
        "appears",
        "agree",
        "rawls",
        "path",
        "perpetual",
        "peace",
        "environmental",
        "safety",
        "lie",
        "promoting",
        "development",
        "wellordered",
        "state",
        "characterized",
        "democratically",
        "representative",
        "responsive",
        "responsible",
        "domestic",
        "government",
        "line",
        "argument",
        "rawls",
        "pogge",
        "suggest",
        "liberal",
        "quick",
        "reject",
        "framing",
        "choice",
        "world",
        "order",
        "one",
        "either",
        "world",
        "traditional",
        "sovereign",
        "state",
        "world",
        "global",
        "central",
        "government",
        "pogge",
        "asserted",
        "liberal",
        "dispense",
        "traditional",
        "concept",
        "sovereignty",
        "leave",
        "behind",
        "allornothing",
        "debate",
        "world",
        "government",
        "instead",
        "argues",
        "intermediate",
        "solution",
        "provides",
        "central",
        "organ",
        "world",
        "government",
        "without",
        "however",
        "investing",
        "exclusive",
        "ultimate",
        "sovereign",
        "power",
        "authority",
        "multilayered",
        "scheme",
        "ultimate",
        "political",
        "authority",
        "vertically",
        "dispersed",
        "state",
        "retain",
        "ultimate",
        "political",
        "authority",
        "area",
        "would",
        "juxtaposed",
        "world",
        "government",
        "central",
        "coercive",
        "mechanism",
        "law",
        "enforcement",
        "ultimate",
        "political",
        "authority",
        "area",
        "pogge",
        "debra",
        "satz",
        "also",
        "argued",
        "framing",
        "choice",
        "one",
        "current",
        "state",
        "system",
        "allpowerful",
        "worldstate",
        "pose",
        "false",
        "dilemma",
        "contrast",
        "system",
        "sovereign",
        "state",
        "centralized",
        "worldstate",
        "crude",
        "many",
        "possibility",
        "including",
        "state",
        "system",
        "restrained",
        "international",
        "intergovernmental",
        "institution",
        "nonstatebased",
        "economic",
        "system",
        "global",
        "separationofpowers",
        "scheme",
        "international",
        "federalism",
        "regional",
        "politicaleconomic",
        "structure",
        "currently",
        "developed",
        "western",
        "europe",
        "america",
        "via",
        "nafta",
        "satz",
        "simon",
        "caney",
        "also",
        "endorsed",
        "system",
        "international",
        "institution",
        "designed",
        "provide",
        "reliable",
        "effective",
        "mean",
        "protecting",
        "people",
        "basis",
        "interest",
        "instrumental",
        "consideration",
        "also",
        "provide",
        "fair",
        "forum",
        "determining",
        "rule",
        "govern",
        "global",
        "economy",
        "procedural",
        "component",
        "many",
        "liberal",
        "proposal",
        "moral",
        "improvement",
        "world",
        "order",
        "indicate",
        "liberal",
        "objection",
        "world",
        "governmentwhether",
        "take",
        "form",
        "tyrannyhomogeneity",
        "argument",
        "andor",
        "inefficiencysoullessness",
        "objectionsare",
        "motivated",
        "complacent",
        "attitude",
        "towards",
        "contemporary",
        "world",
        "order",
        "resulting",
        "condition",
        "pogge",
        "charles",
        "jones",
        "put",
        "valid",
        "plausible",
        "objection",
        "world",
        "government",
        "show",
        "status",
        "quo",
        "preferable",
        "alternative",
        "arrangement",
        "liberal",
        "theorist",
        "acknowledge",
        "tyrannical",
        "potential",
        "world",
        "government",
        "also",
        "acknowledge",
        "sovereign",
        "state",
        "often",
        "cause",
        "rightsviolations",
        "citizen",
        "kokchor",
        "tan",
        "characterizes",
        "liberal",
        "proposal",
        "world",
        "order",
        "involve",
        "therefore",
        "neither",
        "world",
        "government",
        "absolute",
        "state",
        "sovereignty",
        "instead",
        "liberal",
        "argued",
        "consistently",
        "restriction",
        "traditional",
        "power",
        "sovereignty",
        "well",
        "vertical",
        "dispersion",
        "sovereignty",
        "upwards",
        "towards",
        "supranational",
        "body",
        "also",
        "downwards",
        "toward",
        "particular",
        "community",
        "within",
        "state",
        "world",
        "order",
        "state",
        "become",
        "another",
        "level",
        "appeal",
        "sole",
        "final",
        "one",
        "david",
        "held",
        "argues",
        "dispersion",
        "sovereignty",
        "inevitable",
        "given",
        "nationstate",
        "exist",
        "insular",
        "world",
        "highly",
        "interdependent",
        "complex",
        "system",
        "contemporary",
        "reality",
        "consists",
        "globalized",
        "economy",
        "international",
        "organization",
        "regional",
        "global",
        "institution",
        "international",
        "law",
        "military",
        "alliance",
        "operate",
        "shape",
        "constrain",
        "individual",
        "state",
        "although",
        "national",
        "sovereignty",
        "still",
        "place",
        "contemporary",
        "world",
        "order",
        "interconnected",
        "authority",
        "structure",
        "displace",
        "notion",
        "sovereignty",
        "illimitable",
        "indivisible",
        "exclusive",
        "form",
        "public",
        "power",
        "held",
        "account",
        "cosmopolitan",
        "democracy",
        "universal",
        "realization",
        "liberal",
        "ideal",
        "autonomy",
        "derived",
        "kant",
        "ultimately",
        "requires",
        "longterm",
        "institutional",
        "development",
        "creation",
        "global",
        "parliament",
        "international",
        "criminal",
        "court",
        "demilitarization",
        "state",
        "global",
        "distributive",
        "justice",
        "form",
        "guaranteed",
        "annual",
        "income",
        "individual",
        "although",
        "cosmopolitan",
        "theorist",
        "tend",
        "reject",
        "dichotomy",
        "posed",
        "political",
        "system",
        "sovereign",
        "state",
        "one",
        "centralized",
        "world",
        "government",
        "tended",
        "eschew",
        "terminology",
        "world",
        "state",
        "account",
        "global",
        "democratic",
        "institutional",
        "reform",
        "william",
        "scheuerman",
        "argued",
        "proposal",
        "supranational",
        "institution",
        "mimic",
        "core",
        "attribute",
        "traditional",
        "statehood",
        "thus",
        "inadvertently",
        "bringing",
        "world",
        "state",
        "back",
        "liberal",
        "cosmopolitan",
        "vision",
        "world",
        "order",
        "thus",
        "open",
        "question",
        "whether",
        "statist",
        "cosmopolitanism",
        "ypi",
        "considers",
        "state",
        "viable",
        "agent",
        "cosmopolitan",
        "justice",
        "feasible",
        "whether",
        "cosmopolitanism",
        "requires",
        "transcending",
        "state",
        "system",
        "ulaş"
    ]
}