{
    "main_text": "Metaphysics || Being and categories\n3.4 Being and categories\n\nSince Wyclif thought of substance as the ultimate substrate of\nexistence and subject of predication in relation to anything else, the\nonly way to demonstrate the reality of the items belonging to other\ncategories was to conceive of them as forms and attributes of\nsubstance. Accordingly, he insists that quantity, quality, and\nrelations, considered as accidents, are forms inherent in the\ncomposite substances (cf. De ente praedicamentali, ch. 6, p.\n48). In this way, just like Walter Burley, Wyclif wanted to safeguard\nthe reality of accidents as well as their (real) distinction from\nsubstance and from each other, while at the same time affirming their\ndependence on substance in existence. \n3.4.1 Quantity\n\nAmong the nine genera of accidents, quantity is the most important\none, as it is the basis of all further accidents, because every other\naccident presupposes it. Indeed, quantity orders substance for\nreceiving quality and the other accidental forms. In his commentary on\nthe Categories (ch. 10, § 4) and in the first part of\nhis Summa Logicae (pars I, ch. 44) Ockham had\nclaimed that it was superfluous to posit quantitative forms really\ndistinct from substance and quality, since quantity presupposes what\nit is intended to explain, that is, the extension of material\nsubstances and their having parts outside parts. As an accident,\nquantity presupposes substance as its substrate of inherence. Like\nBurley, Wyclif also denies that material substance can be actually\nextended without the presence of quantitative forms in it, thereby\naffirming their necessity (cf. De ente praedicamentali, ch.\n6, p. 50.), and consequently he tries to confute Ockham’s\nargumentation (ibidem, pp. 50–58). He admits that the\nexistence of any quantity always implies that of substance, but he\nalso believes that the actual existence of parts in a substance\nnecessarily implies the presence of a quantitative form in it,\ndistinct (1) from the substance (say Socrates) in which it inheres,\nand (2) from the truth, grounded on the substance at issue, that this\nsame substance is a quantified thing (ibidem, pp.\n51–53). He does not give us any sound metaphysical reason for\nthis preference. Nevertheless, it is easily understandable, when\nconsidered from the point of view of his semantic presuppositions,\naccording to which, the reality itself is the interpretative pattern\nof our language.\n\nAs a consequence, the structure of language is a mere mirroring of\nthat of reality. In Wyclif’s opinion, therefore, some entities\nmust correspond in the world to the abstract terms of the category of\nquantity (like ‘magnitudo’) – entities\nreally distinct from the things signified by the substantial terms. In\nany case, the most important evidence he offers for proving his thesis\nis a sort of abductive reasoning, whose implicit premise is the\nfollowing inferential rule: if we can recognize a thing as the same\nthing before and after its undertaking a process of change, then what\nis changed is not the thing at issue, but a distinct entity really\npresent in that thing as one of its real aspects. The second premise\nis the observation that men are of different size during their lives.\nAnd the conclusion is that those changes are due to an accidental form\ndistinct from the substances in which it inheres (ibidem, p.\n50).\n3.4.2 Quality\n\nImmediately after quantity, quality comes. Following Aristotle\n(Categories, ch. 8, 8a 25), Wyclif defines quality as that in\nvirtue of which substances are said to be qualified. The chief feature\nof Wyclif ’s treatment of quality is his twofold consideration\nof quality as an abstract form and as a concrete accident. In De\nente praedicamentali he clearly states that quality is an\nabsolute entity, with a well determined nature, and really distinct\nfrom substance (cf. ch. 7, p. 61). Furthermore, even if incidentally,\nagainst Burley, he notes that qualitative forms can admit a more or a\nless, since the propria passio of the category of quality is to be\nmore or less intense (see ibidem, ch. 3, p. 28). \n\nBy contrast, in the De actibus animae (pars II, ch.\n4), he seems to conceive of it as a mode of substance, without an\nactually distinct reality. Truly, there is no effective difference\nbetween the theses on quality maintained in those two works, but only\na difference of point of view. As what he says about the\nreal-and-essential distinction and the first sub-type of formal\ndistinction makes evident, quality considered in an absolute way,\naccording to its main level of being, is an abstract form, really\ndistinct from substance; yet, if considered from the point of view of\nits existence as a concrete accident, it is not really distinct from\nthe substance in which it is present, but only formally. In the latter\ncase,it is a mere mode of the substance, like any other concrete\naccident. In fact, in the De ente praedicamentali Wyclif\nspeaks of quality,using the abstract term, while in the De actibus\nanimae he constantly utilises concrete expressions, such as\n‘quale’ and ‘substantia\nqualis.’\n3.4.3 Relations and relatives\n\nAristotle’s treatment of relations in the Categories\n(ch. 7) and in the Metaphysics (V, ch.15) is opaque and\nincomplete. Because of this fact, in the Late Antiquity and in the\nMiddle Ages many authors tried to reformulate the doctrine of\nrelatives. Wyclif ’s attempt is one of the most interesting\namong those of the whole Middle Ages, as he very likely was the first\nmedieval author able to work out a concept of relation conceived of as\nan accidental form which is in both the relatives at once, even though\nin different ways. Consequently his relation can be considered the\nontological equivalent to our modern functions with two variables, or\ntwo-place predicates, whereas all the other authors of the Middle Ages\nhad thought of the relations in terms of monadic functions. As a\nmatter of fact, according to Wyclif, relation is different from\nquality and quantity, since it presupposes them just as what follows\nby nature presupposes what precedes. Moreover, quantity and quality\nare, in a certain way, absolute entities, but relation qua such is a\nsort of link between two things (see De ente praedicamentali,\nch. 7, p. 61).\n\nWyclif thinks that the items directly falling into any categorial\nfield are simple accidental forms, therefore he distinguishes between\nrelations (relationes) and relatives (relativa or\nad aliquid) – these latter being the aggregates formed\nby a substance, a relation, and the foundation (fundamentum),\nof the relation. Accordingly, the relationship between relation and\nrelatives is, for him, similar to the ones between quantity and what\nis quantified, and quality and what is qualified. The relation is the\nvery cause of the nature of the aggregates (that is, the relatives) of\nwhich it is a constituent; yet, unlike the other accidental forms,\nrelations do not directly inhere in their substrates, but are present\nin them only by means of other accidental forms, that Wyclif,\nfollowing a well established tradition, calls ‘foundations of\nthe relation’. In his view, quantity and quality only can be the\nfoundation of a categorial relation (ibidem, pp.\n61–62).Thus, according to Wyclif’s description, in the act\nof relating one substance to another four different constitutive\nelements can be singled out: (1) the relation itself (for instance,\nthe form of similarity); (2) the foundation of the relation, that is,\nthe absolute entity in virtue of which the relation at issue is\npresent in the two substances correlated to each other (in this case,\nthe form of whiteness which makes the two substances at issue similar\nto each other); (3) the subject of the relation (or its first\nextreme), that is, the aggregate compound of (a) the\nsubstance which denominatively receives the names of the relation (in\nour example, the substance which is similar to another, say Socrates)\nand (b) of the foundation of the relation ; (4) the second\nextreme (of the relation), that is, another aggregate compund of a\nsubstance and its own foundation, that the subject of the relation is\nconnected with, (in our example, a second substance which is, in its\nturn, similar to the first one, say Plato).\n\nThe fundamentum of the relation is the main component, since\nit (1) joins the relation to the underlying substances, (2) lets the\nrelation link the subject to the object, and (3) transmits to the\nrelation some of its properties. Even though relation depends for its\nexistence on the foundation, its being is really distinct from it, as\nwhen the foundation fails the relation also fails, but not vice versa\n(ibidem, pp. 62–64 and 67).\n\nSome rather important conclusions about the nature and the ontological\nstatus of relations and relatives follow from these premisses:\n\nrelation is a truth (veritas) whose kind of reality is\nfeebler than that of any other accident, as it depends upon the\nsimultaneous existence of three different things: the two extremes (of\nthe relation) and the foundation. \nA relation can (indirectly) inhere in a substance without any\nchange in the latter, but simply because of a change in another one.\nFor example: given two things, one white and the other black, if the\nblack thing becomes white, then, because of such a change, a new\naccident, that is, a relation of similarity, will inhere also in the\nfirst thing, apart from any other change in it.\nAll the true relatives ( propria relativa) are simultaneous by\nnature (see ibidem, p. 64), since the real cause of being a\nrelative is relation, which at the same time (indirectly) inheres in\ntwo things, thereby making both ones relatives.\n\n\nLike Duns Scotus, Wyclif divides relations into transcendental and\ncategorial relations (ibidem p. 61–62), and, moreover,\nlike many of his predecessors and contemporaries, among the latter he\ncontrasts real relatives (relativa secundum esse) with\nrelatives of reason (relativa rationis), or linguistic\nrelatives (relativa secundum dici – see\nibidem, pp. 62–64). Wyclif defines real relatives as\nthose aggregates (1) made up of a substance and (2) an absolute\naccidental form (quantity or quality), (3) whose reality consists in\nbeing correlated to something else. If one of these three conditions\nis not fulfilled, we will speak of relatives of reason (cf.\nibidem, p. 63).\n\nIn this way, Wyclif eliminates from the description of the relatives\nof reason any reference to our mind, and utilizes objective criteria\nonly, based on the framework of reality itself. In fact he maintains\nthat there are three kinds of relations of reason, each one\ncharacterized by the occurrence of at least one of these negative\nconditions: (1) one of the two extremes of the relation is not a\nsubstance with its foundation; (2) both the extremes of the relation\nare not substances; (3) there is no foundation for the relation, or it\nis not an absolute accident – that is, a quantity, or a quality\n(ibidem). The strategy which supports this choice is evident:\nWyclif attempts to substitute references to mental activity by\nreferences to external reality. In other words, he seeks to reduce\nepistemology to ontology, in accordance with his realist program.\n",
    "section_title": "3.4 Being and categories",
    "entry_title": "John Wyclif",
    "hierarchy_title": "John Wyclif || Metaphysics || Being and categories",
    "tokenized_text": [
        "metaphysics",
        "category",
        "category",
        "since",
        "wyclif",
        "thought",
        "substance",
        "ultimate",
        "substrate",
        "existence",
        "subject",
        "predication",
        "relation",
        "anything",
        "else",
        "way",
        "demonstrate",
        "reality",
        "item",
        "belonging",
        "category",
        "conceive",
        "form",
        "attribute",
        "substance",
        "accordingly",
        "insists",
        "quantity",
        "quality",
        "relation",
        "considered",
        "accident",
        "form",
        "inherent",
        "composite",
        "substance",
        "cf",
        "de",
        "ente",
        "praedicamentali",
        "ch",
        "p",
        "way",
        "like",
        "walter",
        "burley",
        "wyclif",
        "wanted",
        "safeguard",
        "reality",
        "accident",
        "well",
        "real",
        "distinction",
        "substance",
        "time",
        "affirming",
        "dependence",
        "substance",
        "existence",
        "quantity",
        "among",
        "nine",
        "genus",
        "accident",
        "quantity",
        "important",
        "one",
        "basis",
        "accident",
        "every",
        "accident",
        "presupposes",
        "indeed",
        "quantity",
        "order",
        "substance",
        "receiving",
        "quality",
        "accidental",
        "form",
        "commentary",
        "category",
        "ch",
        "first",
        "part",
        "summa",
        "logicae",
        "par",
        "ch",
        "ockham",
        "claimed",
        "superfluous",
        "posit",
        "quantitative",
        "form",
        "really",
        "distinct",
        "substance",
        "quality",
        "since",
        "quantity",
        "presupposes",
        "intended",
        "explain",
        "extension",
        "material",
        "substance",
        "part",
        "outside",
        "part",
        "accident",
        "quantity",
        "presupposes",
        "substance",
        "substrate",
        "inherence",
        "like",
        "burley",
        "wyclif",
        "also",
        "denies",
        "material",
        "substance",
        "actually",
        "extended",
        "without",
        "presence",
        "quantitative",
        "form",
        "thereby",
        "affirming",
        "necessity",
        "cf",
        "de",
        "ente",
        "praedicamentali",
        "ch",
        "p",
        "consequently",
        "try",
        "confute",
        "ockham",
        "argumentation",
        "ibidem",
        "pp",
        "admits",
        "existence",
        "quantity",
        "always",
        "implies",
        "substance",
        "also",
        "belief",
        "actual",
        "existence",
        "part",
        "substance",
        "necessarily",
        "implies",
        "presence",
        "quantitative",
        "form",
        "distinct",
        "substance",
        "say",
        "socrates",
        "inheres",
        "truth",
        "grounded",
        "substance",
        "issue",
        "substance",
        "quantified",
        "thing",
        "ibidem",
        "pp",
        "give",
        "u",
        "sound",
        "metaphysical",
        "reason",
        "preference",
        "nevertheless",
        "easily",
        "understandable",
        "considered",
        "point",
        "view",
        "semantic",
        "presupposition",
        "according",
        "reality",
        "interpretative",
        "pattern",
        "language",
        "consequence",
        "structure",
        "language",
        "mere",
        "mirroring",
        "reality",
        "wyclif",
        "opinion",
        "therefore",
        "entity",
        "must",
        "correspond",
        "world",
        "abstract",
        "term",
        "category",
        "quantity",
        "like",
        "magnitudo",
        "entity",
        "really",
        "distinct",
        "thing",
        "signified",
        "substantial",
        "term",
        "case",
        "important",
        "evidence",
        "offer",
        "proving",
        "thesis",
        "sort",
        "abductive",
        "reasoning",
        "whose",
        "implicit",
        "premise",
        "following",
        "inferential",
        "rule",
        "recognize",
        "thing",
        "thing",
        "undertaking",
        "process",
        "change",
        "changed",
        "thing",
        "issue",
        "distinct",
        "entity",
        "really",
        "present",
        "thing",
        "one",
        "real",
        "aspect",
        "second",
        "premise",
        "observation",
        "men",
        "different",
        "size",
        "life",
        "conclusion",
        "change",
        "due",
        "accidental",
        "form",
        "distinct",
        "substance",
        "inheres",
        "ibidem",
        "p",
        "quality",
        "immediately",
        "quantity",
        "quality",
        "come",
        "following",
        "aristotle",
        "category",
        "ch",
        "a",
        "wyclif",
        "defines",
        "quality",
        "virtue",
        "substance",
        "said",
        "qualified",
        "chief",
        "feature",
        "wyclif",
        "treatment",
        "quality",
        "twofold",
        "consideration",
        "quality",
        "abstract",
        "form",
        "concrete",
        "accident",
        "de",
        "ente",
        "praedicamentali",
        "clearly",
        "state",
        "quality",
        "absolute",
        "entity",
        "well",
        "determined",
        "nature",
        "really",
        "distinct",
        "substance",
        "cf",
        "ch",
        "p",
        "furthermore",
        "even",
        "incidentally",
        "burley",
        "note",
        "qualitative",
        "form",
        "admit",
        "le",
        "since",
        "propria",
        "passio",
        "category",
        "quality",
        "le",
        "intense",
        "see",
        "ibidem",
        "ch",
        "p",
        "contrast",
        "de",
        "actibus",
        "animae",
        "par",
        "ii",
        "ch",
        "seems",
        "conceive",
        "mode",
        "substance",
        "without",
        "actually",
        "distinct",
        "reality",
        "truly",
        "effective",
        "difference",
        "thesis",
        "quality",
        "maintained",
        "two",
        "work",
        "difference",
        "point",
        "view",
        "say",
        "realandessential",
        "distinction",
        "first",
        "subtype",
        "formal",
        "distinction",
        "make",
        "evident",
        "quality",
        "considered",
        "absolute",
        "way",
        "according",
        "main",
        "level",
        "abstract",
        "form",
        "really",
        "distinct",
        "substance",
        "yet",
        "considered",
        "point",
        "view",
        "existence",
        "concrete",
        "accident",
        "really",
        "distinct",
        "substance",
        "present",
        "formally",
        "latter",
        "case",
        "mere",
        "mode",
        "substance",
        "like",
        "concrete",
        "accident",
        "fact",
        "de",
        "ente",
        "praedicamentali",
        "wyclif",
        "speaks",
        "quality",
        "using",
        "abstract",
        "term",
        "de",
        "actibus",
        "animae",
        "constantly",
        "utilises",
        "concrete",
        "expression",
        "quale",
        "substantia",
        "qualis",
        "relation",
        "relative",
        "aristotle",
        "treatment",
        "relation",
        "category",
        "ch",
        "metaphysics",
        "v",
        "ch",
        "opaque",
        "incomplete",
        "fact",
        "late",
        "antiquity",
        "middle",
        "age",
        "many",
        "author",
        "tried",
        "reformulate",
        "doctrine",
        "relative",
        "wyclif",
        "attempt",
        "one",
        "interesting",
        "among",
        "whole",
        "middle",
        "age",
        "likely",
        "first",
        "medieval",
        "author",
        "able",
        "work",
        "concept",
        "relation",
        "conceived",
        "accidental",
        "form",
        "relative",
        "even",
        "though",
        "different",
        "way",
        "consequently",
        "relation",
        "considered",
        "ontological",
        "equivalent",
        "modern",
        "function",
        "two",
        "variable",
        "twoplace",
        "predicate",
        "whereas",
        "author",
        "middle",
        "age",
        "thought",
        "relation",
        "term",
        "monadic",
        "function",
        "matter",
        "fact",
        "according",
        "wyclif",
        "relation",
        "different",
        "quality",
        "quantity",
        "since",
        "presupposes",
        "follows",
        "nature",
        "presupposes",
        "precedes",
        "moreover",
        "quantity",
        "quality",
        "certain",
        "way",
        "absolute",
        "entity",
        "relation",
        "qua",
        "sort",
        "link",
        "two",
        "thing",
        "see",
        "de",
        "ente",
        "praedicamentali",
        "ch",
        "p",
        "wyclif",
        "think",
        "item",
        "directly",
        "falling",
        "categorial",
        "field",
        "simple",
        "accidental",
        "form",
        "therefore",
        "distinguishes",
        "relation",
        "relationes",
        "relative",
        "relativa",
        "ad",
        "aliquid",
        "latter",
        "aggregate",
        "formed",
        "substance",
        "relation",
        "foundation",
        "fundamentum",
        "relation",
        "accordingly",
        "relationship",
        "relation",
        "relative",
        "similar",
        "one",
        "quantity",
        "quantified",
        "quality",
        "qualified",
        "relation",
        "cause",
        "nature",
        "aggregate",
        "relative",
        "constituent",
        "yet",
        "unlike",
        "accidental",
        "form",
        "relation",
        "directly",
        "inhere",
        "substrate",
        "present",
        "mean",
        "accidental",
        "form",
        "wyclif",
        "following",
        "well",
        "established",
        "tradition",
        "call",
        "foundation",
        "relation",
        "view",
        "quantity",
        "quality",
        "foundation",
        "categorial",
        "relation",
        "ibidem",
        "pp",
        "thus",
        "according",
        "wyclif",
        "description",
        "act",
        "relating",
        "one",
        "substance",
        "another",
        "four",
        "different",
        "constitutive",
        "element",
        "singled",
        "relation",
        "instance",
        "form",
        "similarity",
        "foundation",
        "relation",
        "absolute",
        "entity",
        "virtue",
        "relation",
        "issue",
        "present",
        "two",
        "substance",
        "correlated",
        "case",
        "form",
        "whiteness",
        "make",
        "two",
        "substance",
        "issue",
        "similar",
        "subject",
        "relation",
        "first",
        "extreme",
        "aggregate",
        "compound",
        "substance",
        "denominatively",
        "receives",
        "name",
        "relation",
        "example",
        "substance",
        "similar",
        "another",
        "say",
        "socrates",
        "b",
        "foundation",
        "relation",
        "second",
        "extreme",
        "relation",
        "another",
        "aggregate",
        "compund",
        "substance",
        "foundation",
        "subject",
        "relation",
        "connected",
        "example",
        "second",
        "substance",
        "turn",
        "similar",
        "first",
        "one",
        "say",
        "plato",
        "fundamentum",
        "relation",
        "main",
        "component",
        "since",
        "join",
        "relation",
        "underlying",
        "substance",
        "let",
        "relation",
        "link",
        "subject",
        "object",
        "transmits",
        "relation",
        "property",
        "even",
        "though",
        "relation",
        "depends",
        "existence",
        "foundation",
        "really",
        "distinct",
        "foundation",
        "fails",
        "relation",
        "also",
        "fails",
        "vice",
        "versa",
        "ibidem",
        "pp",
        "rather",
        "important",
        "conclusion",
        "nature",
        "ontological",
        "status",
        "relation",
        "relative",
        "follow",
        "premiss",
        "relation",
        "truth",
        "veritas",
        "whose",
        "kind",
        "reality",
        "feebler",
        "accident",
        "depends",
        "upon",
        "simultaneous",
        "existence",
        "three",
        "different",
        "thing",
        "two",
        "extreme",
        "relation",
        "foundation",
        "relation",
        "indirectly",
        "inhere",
        "substance",
        "without",
        "change",
        "latter",
        "simply",
        "change",
        "another",
        "one",
        "example",
        "given",
        "two",
        "thing",
        "one",
        "white",
        "black",
        "black",
        "thing",
        "becomes",
        "white",
        "change",
        "new",
        "accident",
        "relation",
        "similarity",
        "inhere",
        "also",
        "first",
        "thing",
        "apart",
        "change",
        "true",
        "relative",
        "propria",
        "relativa",
        "simultaneous",
        "nature",
        "see",
        "ibidem",
        "p",
        "since",
        "real",
        "cause",
        "relative",
        "relation",
        "time",
        "indirectly",
        "inheres",
        "two",
        "thing",
        "thereby",
        "making",
        "one",
        "relative",
        "like",
        "dun",
        "scotus",
        "wyclif",
        "divide",
        "relation",
        "transcendental",
        "categorial",
        "relation",
        "ibidem",
        "p",
        "moreover",
        "like",
        "many",
        "predecessor",
        "contemporary",
        "among",
        "latter",
        "contrast",
        "real",
        "relative",
        "relativa",
        "secundum",
        "esse",
        "relative",
        "reason",
        "relativa",
        "rationis",
        "linguistic",
        "relative",
        "relativa",
        "secundum",
        "dici",
        "see",
        "ibidem",
        "pp",
        "wyclif",
        "defines",
        "real",
        "relative",
        "aggregate",
        "made",
        "substance",
        "absolute",
        "accidental",
        "form",
        "quantity",
        "quality",
        "whose",
        "reality",
        "consists",
        "correlated",
        "something",
        "else",
        "one",
        "three",
        "condition",
        "fulfilled",
        "speak",
        "relative",
        "reason",
        "cf",
        "ibidem",
        "p",
        "way",
        "wyclif",
        "eliminates",
        "description",
        "relative",
        "reason",
        "reference",
        "mind",
        "utilizes",
        "objective",
        "criterion",
        "based",
        "framework",
        "reality",
        "fact",
        "maintains",
        "three",
        "kind",
        "relation",
        "reason",
        "one",
        "characterized",
        "occurrence",
        "least",
        "one",
        "negative",
        "condition",
        "one",
        "two",
        "extreme",
        "relation",
        "substance",
        "foundation",
        "extreme",
        "relation",
        "substance",
        "foundation",
        "relation",
        "absolute",
        "accident",
        "quantity",
        "quality",
        "ibidem",
        "strategy",
        "support",
        "choice",
        "evident",
        "wyclif",
        "attempt",
        "substitute",
        "reference",
        "mental",
        "activity",
        "reference",
        "external",
        "reality",
        "word",
        "seek",
        "reduce",
        "epistemology",
        "ontology",
        "accordance",
        "realist",
        "program"
    ]
}