{
    "main_text": "Scientific Interests\n5. Scientific Interests\n\nWe may reasonably conclude from several surviving fragments and a\nlarge number of testimonia that Xenophanes was well aware of\nthe teachings of the Milesian philosopher-scientists (Thales,\nAnaximander, and Anaximenes), and sought to improve on them. While\nmany of the details of his own ‘scientific’ views remain\nobscure, the range and interconnectedness of his interests make him an\nimportant figure in the development of Ionian scientific theory.\nTheodoretus, Stobaeus, and Olympiodorus (all in A 36) credit him with\na view of earth as the archê or “first\nprinciple” of all things. Yet Galen (also in A36) rejects this\nattribution, and B29 equates “all things which come into being\nand grow” with “earth and water”. A\ntwo-substance archê would, moreover, be compatible with\nthe many references to physical mixtures. A33 credits Xenophanes with\na view of the sea as containing many mixtures, while B37 notes the\npresence of water in rocky caves, and A50 reports a view of the soul\nas earth and water. Insofar as some natural bodies are described as\nconsisting entirely of water (or of a part of water, as in A46 where\n“the sweet portion” of the water is drawn up from the sea\nand separated off), it would be best to understand Xenophanes’\n“two-substance theory” in a distributed sense: all things\nare either earth, or water, or earth combined with water.\n\nXenophanes appears to have explored many of the same phenomena studied\nat an earlier date by the Milesians. B28 presents a view of the nature\nand extent of the earth’s depths; B30 identifies the sea as the\nsource of clouds, wind, and rain; B32 comments on the nature of Iris\n(rainbow); B37 notes the presence of water in caves; B39 and 40\nmention “cherry trees” and “frogs”;\nA38–45 discuss various astronomical phenomena, and A48 indicates\nan interest in periodic volcanic eruptions in Sicily. Hippolytus (A33)\ncredits Xenophanes with a theory of alternating periods of world-wide\nflood and drought that was inspired, at least in part, by the\ndiscovery of fossilized remains of sea creatures at inland locations.\nWhether or not Xenophanes himself traveled to Syracuse, Paros, and\nMalta where these remains were found, his use of this information as\nthe basis for a broad explanation of phenomena is an implicit\ntestimonial to the heuristic value of information gained through\ntravel and observation.\n\nMany testimonia credit Xenophanes with an interest in\nmeteorological and astronomical phenomena. Not only are these comments\nof interest in their own right, they also present us what was arguably\nhis single most important scientific contribution--his contention that\nclouds or cloud-like substances play a basic role in a great many\nnatural phenomena. The term nephos (“cloud”)\nappears only twice in the fragments of his work (in B30 and 32) but\nmany testimonia either bear directly on the nature of clouds\nor make use of clouds in order to explain the nature of other\nphenomena. To cite an example of the first type, according to Diogenes\nLaertius “he says…the clouds are formed by the\nsun’s vapor [i.e. vapor caused by the heat from the sun’s\nrays] raising and lifting them to the surrounding air”\n(A1.24–5). Aëtius (A46) provides a similar account:\n\nXenophanes (says that) things in the heavens occur through the heat of\nthe sun as the initial cause; for when the moisture is drawn up from\nthe sea, the sweet portion, separating because of its fineness and\nturning into mists, combines into clouds, trickled down in drops of\nrain due to compression, and vaporizes the winds.\n\n\nB30 gives us essentially the same view in Xenophanes’ own\nwords:\n\nThe sea is the source of water and of wind,\n\nFor without the great sea, there would be no wind\n\nNor streams of rivers, nor rainwater from on high\n\nBut the great sea is the begetter of clouds, winds, and rivers.\n\n\nHaving accounted for the formation of clouds in mechanistic terms\nthrough processes of vaporization and compression Xenophanes proceeds\nto make use of clouds to explain a large number of meteorological and\nastronomical phenomena. The general claim appears in the\npseudo-Plutarch Miscellanies: “he says that the sun and\nthe stars come into being from the clouds” (A32), and\nAëtius gives us many specific applications: \n\nThe stars come into being from burning clouds (A38).\n\n\nThe sort of fires that appear on ships--whom some call the Dioscuri\n[St. Elmo’s fire]--are tiny clouds glimmering in virtue of the\nsort of motion they have (A39).\n\nThe sun consists of burning clouds…a mass of little fires,\nthemselves constructed from the massing together of the moist\nexhalation (A40).\n\nThe moon is compressed cloud (A43).\n\nAll things of this sort [comets, shooting stars, meteors] are either\ngroups or movements of clouds (A44).\n\nFlashes of lightning come about through the shining of the clouds\nbecause of the movement (A45).\n\n\nAs it happens, clouds are natural candidates for the\nexplanans in a scientific account. Since they are midway in\nform between a solid and gaseous state they are easily linked with\nsolids, liquids, and gases of various kinds. And since they occupy a\nregion midway between the surface of the earth and the upper regions\nof the heavens, they are well positioned to link the two basic\nsubstances of earth and water with many astronomical phenomena.\n\nAnother important feature of Xenophanes’ cloud-based approach to\nunderstanding natural phenomena is the application of this theory to a\nset of phenomena closely linked with traditional religious belief. We\nhave already seen this in the thoroughly naturalistic accounts given\nof the “great sea”, sun, moon, and stars, but nowhere is\nthe contrast of the old and new ways of thinking more evident than in\nhis comments on “Iris”--rainbow:\n\nAnd she whom they call Iris, this too is by nature a cloud.\n\nPurple, red, and greenish-yellow to behold. (B32)\n\n\nFor the members of Xenophanes’ audience “Iris”\nreferred to the messenger goddess of Homer’s Iliad (2,\n686) and Hesiod’s Theogony (780) and a set of\natmospheric phenomena (halos, coronae, and cloud iridescence) commonly\nconsidered portents or signs of the intentions of divine beings. As\nthe daughter of Thaumas (“marvel”) Iris was the natural\nmarvel par excellence. Yet for Xenophanes,\n‘she’ is really an ‘it’ and a\n‘this’ (the Greek neuter demonstrative touto), by\nnature a purple, red, and greenish-yellow cloud. It is, moreover,\nsomething that is there for us ‘to behold’ or ‘to\nlook at’ (idesthai). Perhaps nowhere in presocratic\nphilosophy can we find a clearer expression of the character of the\nIonian ‘intellectual revolution’—a decision to put\naside an older way of thinking about events grounded in a belief in\ndivine beings in favor of an approach to understanding the world that\nemploys wide-ranging inquiry and direct observation and resorts to\nstrictly physical causes and forces. Having deprived the gods of human\nform and clothing and removed the divine to some permanent and distant\nlocation, Xenophanes proceeds to strip a wide range of natural\nphenomena of all vestiges of religious or spiritual significance. His\nde-mythologized account of natural phenomena is, in short, the logical\ncomplement to his thoroughly de-naturalized account of the divine\nnature.\n\nDespite its several virtues, Xenophanes’ physical theory appears\nto have had little impact on later thinkers. Anaxagoras followed his\nlead on the nature of the rainbow (cf. DK 59 B19) and Empedocles knew\n(but repudiated) his claim of the earth’s indefinitely extended\ndepths (DK 31 B39). But both Plato and Aristotle appear to have\nignored Xenophanes’ scientific views or assigned them little\nimportance. One factor that may have contributed to this chilly\nreception was the absence of any expression by Xenophanes of the kind\nof commitment to teleology that both Plato and Aristotle regarded as\nessential to a proper understanding of the cosmos. Xenophanes’\nuniverse is controlled by a set of forces, but it is never described\nas “heading toward the best” nor is it directed toward\nsome best result by a controlling intelligence. (Xenophanes’\ndivine does “shake all things” by the thought of his mind\n(alone), but he is never described as in any way directing or\ncontrolling particular events.) It is also obvious that\nXenophanes’ heavenly bodies would have fallen far short of the\nlevel of perfection that, with Aristotle, became a hallmark of\nclassical astronomical theory. Not only are Xenophanes’ heavenly\nbodies not divine beings, they undergo creation and destruction at\nregular intervals. Only from the perspective of a much later period\ncan the merits of Xenophanes’ scientific views be fairly\nappreciated. Many centuries would have to pass before an emphasis on\ndirect observation and the use of entirely natural causes and forces\nwould become the scientific orthodoxy.\n",
    "section_title": "5. Scientific Interests",
    "entry_title": "Xenophanes",
    "hierarchy_title": "Xenophanes || Scientific Interests",
    "tokenized_text": [
        "scientific",
        "interest",
        "scientific",
        "interest",
        "may",
        "reasonably",
        "conclude",
        "several",
        "surviving",
        "fragment",
        "large",
        "number",
        "testimonia",
        "xenophanes",
        "well",
        "aware",
        "teaching",
        "milesian",
        "philosopherscientists",
        "thales",
        "anaximander",
        "anaximenes",
        "sought",
        "improve",
        "many",
        "detail",
        "scientific",
        "view",
        "remain",
        "obscure",
        "range",
        "interconnectedness",
        "interest",
        "make",
        "important",
        "figure",
        "development",
        "ionian",
        "scientific",
        "theory",
        "theodoretus",
        "stobaeus",
        "olympiodorus",
        "credit",
        "view",
        "earth",
        "archê",
        "first",
        "principle",
        "thing",
        "yet",
        "galen",
        "also",
        "a",
        "reject",
        "attribution",
        "b",
        "equates",
        "thing",
        "come",
        "grow",
        "earth",
        "water",
        "twosubstance",
        "archê",
        "would",
        "moreover",
        "compatible",
        "many",
        "reference",
        "physical",
        "mixture",
        "a",
        "credit",
        "xenophanes",
        "view",
        "sea",
        "containing",
        "many",
        "mixture",
        "b",
        "note",
        "presence",
        "water",
        "rocky",
        "cave",
        "a",
        "report",
        "view",
        "soul",
        "earth",
        "water",
        "insofar",
        "natural",
        "body",
        "described",
        "consisting",
        "entirely",
        "water",
        "part",
        "water",
        "a",
        "sweet",
        "portion",
        "water",
        "drawn",
        "sea",
        "separated",
        "would",
        "best",
        "understand",
        "xenophanes",
        "twosubstance",
        "theory",
        "distributed",
        "sense",
        "thing",
        "either",
        "earth",
        "water",
        "earth",
        "combined",
        "water",
        "xenophanes",
        "appears",
        "explored",
        "many",
        "phenomenon",
        "studied",
        "earlier",
        "date",
        "milesians",
        "b",
        "present",
        "view",
        "nature",
        "extent",
        "earth",
        "depth",
        "b",
        "identifies",
        "sea",
        "source",
        "cloud",
        "wind",
        "rain",
        "b",
        "comment",
        "nature",
        "iris",
        "rainbow",
        "b",
        "note",
        "presence",
        "water",
        "cave",
        "b",
        "mention",
        "cherry",
        "tree",
        "frog",
        "a",
        "discus",
        "various",
        "astronomical",
        "phenomenon",
        "a",
        "indicates",
        "interest",
        "periodic",
        "volcanic",
        "eruption",
        "sicily",
        "hippolytus",
        "a",
        "credit",
        "xenophanes",
        "theory",
        "alternating",
        "period",
        "worldwide",
        "flood",
        "drought",
        "inspired",
        "least",
        "part",
        "discovery",
        "fossilized",
        "remains",
        "sea",
        "creature",
        "inland",
        "location",
        "whether",
        "xenophanes",
        "traveled",
        "syracuse",
        "paros",
        "malta",
        "remains",
        "found",
        "use",
        "information",
        "basis",
        "broad",
        "explanation",
        "phenomenon",
        "implicit",
        "testimonial",
        "heuristic",
        "value",
        "information",
        "gained",
        "travel",
        "observation",
        "many",
        "testimonia",
        "credit",
        "xenophanes",
        "interest",
        "meteorological",
        "astronomical",
        "phenomenon",
        "comment",
        "interest",
        "right",
        "also",
        "present",
        "u",
        "arguably",
        "single",
        "important",
        "scientific",
        "contribution",
        "contention",
        "cloud",
        "cloudlike",
        "substance",
        "play",
        "basic",
        "role",
        "great",
        "many",
        "natural",
        "phenomenon",
        "term",
        "nephos",
        "cloud",
        "appears",
        "twice",
        "fragment",
        "work",
        "b",
        "many",
        "testimonia",
        "either",
        "bear",
        "directly",
        "nature",
        "cloud",
        "make",
        "use",
        "cloud",
        "order",
        "explain",
        "nature",
        "phenomenon",
        "cite",
        "example",
        "first",
        "type",
        "according",
        "diogenes",
        "laertius",
        "saysthe",
        "cloud",
        "formed",
        "sun",
        "vapor",
        "ie",
        "vapor",
        "caused",
        "heat",
        "sun",
        "ray",
        "raising",
        "lifting",
        "surrounding",
        "air",
        "a",
        "aëtius",
        "a",
        "provides",
        "similar",
        "account",
        "xenophanes",
        "say",
        "thing",
        "heaven",
        "occur",
        "heat",
        "sun",
        "initial",
        "cause",
        "moisture",
        "drawn",
        "sea",
        "sweet",
        "portion",
        "separating",
        "fineness",
        "turning",
        "mist",
        "combine",
        "cloud",
        "trickled",
        "drop",
        "rain",
        "due",
        "compression",
        "vaporizes",
        "wind",
        "b",
        "give",
        "u",
        "essentially",
        "view",
        "xenophanes",
        "word",
        "sea",
        "source",
        "water",
        "wind",
        "without",
        "great",
        "sea",
        "would",
        "wind",
        "stream",
        "river",
        "rainwater",
        "high",
        "great",
        "sea",
        "begetter",
        "cloud",
        "wind",
        "river",
        "accounted",
        "formation",
        "cloud",
        "mechanistic",
        "term",
        "process",
        "vaporization",
        "compression",
        "xenophanes",
        "proceeds",
        "make",
        "use",
        "cloud",
        "explain",
        "large",
        "number",
        "meteorological",
        "astronomical",
        "phenomenon",
        "general",
        "claim",
        "appears",
        "pseudoplutarch",
        "miscellany",
        "say",
        "sun",
        "star",
        "come",
        "cloud",
        "a",
        "aëtius",
        "give",
        "u",
        "many",
        "specific",
        "application",
        "star",
        "come",
        "burning",
        "cloud",
        "a",
        "sort",
        "fire",
        "appear",
        "ship",
        "call",
        "dioscuri",
        "st",
        "elmo",
        "fire",
        "tiny",
        "cloud",
        "glimmering",
        "virtue",
        "sort",
        "motion",
        "a",
        "sun",
        "consists",
        "burning",
        "cloudsa",
        "mass",
        "little",
        "fire",
        "constructed",
        "massing",
        "together",
        "moist",
        "exhalation",
        "a",
        "moon",
        "compressed",
        "cloud",
        "a",
        "thing",
        "sort",
        "comet",
        "shooting",
        "star",
        "meteor",
        "either",
        "group",
        "movement",
        "cloud",
        "a",
        "flash",
        "lightning",
        "come",
        "shining",
        "cloud",
        "movement",
        "a",
        "happens",
        "cloud",
        "natural",
        "candidate",
        "explanans",
        "scientific",
        "account",
        "since",
        "midway",
        "form",
        "solid",
        "gaseous",
        "state",
        "easily",
        "linked",
        "solid",
        "liquid",
        "gas",
        "various",
        "kind",
        "since",
        "occupy",
        "region",
        "midway",
        "surface",
        "earth",
        "upper",
        "region",
        "heaven",
        "well",
        "positioned",
        "link",
        "two",
        "basic",
        "substance",
        "earth",
        "water",
        "many",
        "astronomical",
        "phenomenon",
        "another",
        "important",
        "feature",
        "xenophanes",
        "cloudbased",
        "approach",
        "understanding",
        "natural",
        "phenomenon",
        "application",
        "theory",
        "set",
        "phenomenon",
        "closely",
        "linked",
        "traditional",
        "religious",
        "belief",
        "already",
        "seen",
        "thoroughly",
        "naturalistic",
        "account",
        "given",
        "great",
        "sea",
        "sun",
        "moon",
        "star",
        "nowhere",
        "contrast",
        "old",
        "new",
        "way",
        "thinking",
        "evident",
        "comment",
        "iris",
        "rainbow",
        "call",
        "iris",
        "nature",
        "cloud",
        "purple",
        "red",
        "greenishyellow",
        "behold",
        "b",
        "member",
        "xenophanes",
        "audience",
        "iris",
        "referred",
        "messenger",
        "goddess",
        "homer",
        "iliad",
        "hesiod",
        "theogony",
        "set",
        "atmospheric",
        "phenomenon",
        "halo",
        "corona",
        "cloud",
        "iridescence",
        "commonly",
        "considered",
        "portent",
        "sign",
        "intention",
        "divine",
        "being",
        "daughter",
        "thaumas",
        "marvel",
        "iris",
        "natural",
        "marvel",
        "par",
        "excellence",
        "yet",
        "xenophanes",
        "really",
        "greek",
        "neuter",
        "demonstrative",
        "touto",
        "nature",
        "purple",
        "red",
        "greenishyellow",
        "cloud",
        "moreover",
        "something",
        "u",
        "behold",
        "look",
        "idesthai",
        "perhaps",
        "nowhere",
        "presocratic",
        "philosophy",
        "find",
        "clearer",
        "expression",
        "character",
        "ionian",
        "intellectual",
        "revolution",
        "a",
        "decision",
        "put",
        "aside",
        "older",
        "way",
        "thinking",
        "event",
        "grounded",
        "belief",
        "divine",
        "being",
        "favor",
        "approach",
        "understanding",
        "world",
        "employ",
        "wideranging",
        "inquiry",
        "direct",
        "observation",
        "resort",
        "strictly",
        "physical",
        "cause",
        "force",
        "deprived",
        "god",
        "human",
        "form",
        "clothing",
        "removed",
        "divine",
        "permanent",
        "distant",
        "location",
        "xenophanes",
        "proceeds",
        "strip",
        "wide",
        "range",
        "natural",
        "phenomenon",
        "vestige",
        "religious",
        "spiritual",
        "significance",
        "demythologized",
        "account",
        "natural",
        "phenomenon",
        "short",
        "logical",
        "complement",
        "thoroughly",
        "denaturalized",
        "account",
        "divine",
        "nature",
        "despite",
        "several",
        "virtue",
        "xenophanes",
        "physical",
        "theory",
        "appears",
        "little",
        "impact",
        "later",
        "thinker",
        "anaxagoras",
        "followed",
        "lead",
        "nature",
        "rainbow",
        "cf",
        "dk",
        "b",
        "empedocles",
        "knew",
        "repudiated",
        "claim",
        "earth",
        "indefinitely",
        "extended",
        "depth",
        "dk",
        "b",
        "plato",
        "aristotle",
        "appear",
        "ignored",
        "xenophanes",
        "scientific",
        "view",
        "assigned",
        "little",
        "importance",
        "one",
        "factor",
        "may",
        "contributed",
        "chilly",
        "reception",
        "absence",
        "expression",
        "xenophanes",
        "kind",
        "commitment",
        "teleology",
        "plato",
        "aristotle",
        "regarded",
        "essential",
        "proper",
        "understanding",
        "cosmos",
        "xenophanes",
        "universe",
        "controlled",
        "set",
        "force",
        "never",
        "described",
        "heading",
        "toward",
        "best",
        "directed",
        "toward",
        "best",
        "result",
        "controlling",
        "intelligence",
        "xenophanes",
        "divine",
        "shake",
        "thing",
        "thought",
        "mind",
        "alone",
        "never",
        "described",
        "way",
        "directing",
        "controlling",
        "particular",
        "event",
        "also",
        "obvious",
        "xenophanes",
        "heavenly",
        "body",
        "would",
        "fallen",
        "far",
        "short",
        "level",
        "perfection",
        "aristotle",
        "became",
        "hallmark",
        "classical",
        "astronomical",
        "theory",
        "xenophanes",
        "heavenly",
        "body",
        "divine",
        "being",
        "undergo",
        "creation",
        "destruction",
        "regular",
        "interval",
        "perspective",
        "much",
        "later",
        "period",
        "merit",
        "xenophanes",
        "scientific",
        "view",
        "fairly",
        "appreciated",
        "many",
        "century",
        "would",
        "pas",
        "emphasis",
        "direct",
        "observation",
        "use",
        "entirely",
        "natural",
        "cause",
        "force",
        "would",
        "become",
        "scientific",
        "orthodoxy"
    ]
}