{
    "main_text": "The Extant Paradoxes || The Paradoxes of Motion\n2.2 The Paradoxes of Motion\n\n\nAristotle is most concerned with Zeno in Physics 6, the book\ndevoted to the theory of the continuum. In Physics 6.9, \nAristotle states that Zeno had four arguments concerning motion that \nare difficult to resolve, gives a summary paraphrase of each, and \noffers his own analysis. The ancient commentators on this chapter \nprovide little additional information. Thus reconstruction of these \nfamous arguments rests almost exclusively on Aristotle’s incomplete \npresentation. Note that Aristotle’s remarks leave open the \npossibility that there were other Zenonian arguments against motion \nthat he deemed less difficult to resolve. More importantly, \nAristotle’s presentation gives no indication of how these four \narguments might have functioned within the kind of dialectical scheme\nindicated by Plato’s Parmenides.\n2.2.1 The Stadium, or The Dichotomy\n\n\n“First,” Aristotle says, “there is the argument \nabout its being impossible to move because what moves must reach the \nhalf-way point earlier than the end” (Ph. \n6.9, 239b11–13). He says no more about this argument here \nbut alludes to his earlier discussion of it in Physics 6.2, \nwhere, after arguing that both time and magnitude are continuous, he \nasserts: “Therefore the argument of Zeno falsely presumes that \nit is not possible to traverse or make contact with unlimited things \nindividually in a limited time” (233a21–3). \nSubsequently, in Physics 8.8, he again raises the question \nof how to respond “to those posing the question of Zeno’s \nargument, if one must always pass through the half-way point, and \nthese are unlimited, and it is impossible to traverse things \nunlimited” (263a4–6), and he proceeds to offer what \nhe claims is a more adequate solution than the one presented in \nPhysics 6.2. The argument Aristotle is alluding to in these \npassages gets its name from his mention in Topics 8.8 of \n“Zeno’s argument that it is not possible to move or to traverse\nthe stadium” as a prime example of an argument opposed to \ncommon belief yet difficult to resolve (160b7–9).\n\n\nThe following reconstruction attempts to remain true to this evidence\nand thus to capture something of how Zeno may originally have argued.\nFor anyone (S) to traverse the finite distance across a \nstadium from p0 to p1 within \na limited amount of time, S must first reach the point half \nway between p0 and p1, namely\np2. \n\n\n\n\n\nBefore S reaches p2, S must \nfirst reach the point half way between p0 and \np2, namely p3. Again, before \nS reaches p3, S must first \nreach the point half way between p0 and \np3, namely p4. There is a \nhalf way point again to be reached between p0 and\np4. In fact, there is always another half way \npoint that must be reached before reaching any given half way point, \nso that the number of half way points that must be reached between \nany pn and any pn-1 is \nunlimited. But it is impossible for S to reach an unlimited \nnumber of half way points within a limited amount of time. Therefore,\nit is impossible for S to traverse the stadium or, indeed, \nfor S to move at all; in general, it is impossible to move \nfrom one place to another.\n2.2.2 The Achilles\n\n\nImmediately after his brief presentation of the Stadium, Aristotle \nintroduces the most famous of Zeno’s paradoxes of motion, that of \nAchilles and the Tortoise: “Second is the one called \n‘Achilles’: this is that the slowest runner never will be\novertaken by the fastest; for it is necessary for the one chasing to \ncome first to where the one fleeing started from, so that it is \nnecessary for the slower runner always to be ahead some” \n(Ph. 6.9, 239b14–18). Simplicius adds the \nidentification of the slowest runner as the tortoise (in Ph.\n1014, 5). Aristotle remarks that this argument is merely a variation \non the Dichotomy, with the difference that it does not depend on \ndividing in half the distance taken (Ph. 6.9, \n239b18–20), and his analysis, such as it is, emphasizes \nthat this paradox is to be resolved in the same way as the first \nparadox of motion. Whether this is actually the case is debatable.\n\nIf a tortoise starts ahead of Achilles in a race, the tortoise will\nnever be overtaken by Achilles. Let the start of the race be\nrepresented as follows: \n\n\n\n\n\n\nDuring the time it takes Achilles to reach the point from which the \ntortoise started (t0), the tortoise will have \nprogressed some distance (d1) beyond that point, \nnamely to t1, as follows:\n\n\n\n\n\nLikewise, during the time it then takes Achilles to reach the new \npoint the tortoise has reached (t1), the tortoise\nwill have progressed some new distance (d2) \nbeyond the tortoise’s new starting point, namely to \nt2, as follows:\n\n\n\n\n\nThe tortoise will again have progressed some further distance \n(d3) beyond t2, namely to \nt3, in the time it takes Achilles to move from \na2(=t1) to \na3(=t2). In fact, during the \ntime it takes Achilles to reach the tortoise’s location at the \nbeginning of that time, the tortoise will always have moved some \ndistance ahead, so that every time Achilles reaches the tortoise’s \nnew starting point, the tortoise will be ahead some. Therefore, the \nslowest runner in the race, the tortoise, will never be overtaken by \nthe fastest runner, Achilles.\n2.2.3 The Arrow\n\n\nAristotle’s discussion of the relation of motion and time in \nPhysics 6.8 prepares the way for his objection to the \nZenonian paradox of motion he mentions at the very beginning of \nPhysics 6.9: “Zeno reasons fallaciously; for he says \nthat if every thing always is resting whenever it is against what is \nequal, and what moves is always in the now, then the moving arrow is \nmotionless” (Ph. 6.9, 239b5–7). Aristotle \nremarks that Zeno relies on the false supposition that time is \ncomposed of indivisible “nows” or instants \n(b8–9), a point he soon repeats in identifying the \nargument purporting to show that “the moving arrow is standing \nstill” as the third of Zeno’s paradoxes of motion \n(b30–3). In his Life of Pyrrho, Diogenes Laertius\nreports, “Zeno abolishes motion, saying, ‘What moves \nmoves neither in the place it is nor in a place it is not” \n(D.L. 9.72 = Zeno B4 DK; cf. Epiphanius, Against the \nHeretics 3.11). This report, which Diels and Kranz took to \npreserve a genuine fragment of Zeno’s book, appears to suggest how \nthe argument that the moving arrow is at rest may have figured as \npart of a broader argument against motion. Diogenes, however, is not \na particularly good source for Zeno’s arguments: his Life of \nZeno notes only that he was the first to propound the \n“Achilles” argument, along with many others (D.L. 9.29). \nIt is just as likely, therefore, that Diogenes’ report depends \non an intervening attempt to couch the paradoxes of motion reported \nby Aristotle in the dilemmatic form Plato indicates was typical of \nZenonian argumentation.\n\n\nEven if Diogenes’ report happens to be reliable, we still must rely \non Aristotle in trying to reconstruct the argument that, as in \nDiogenes’ report, what moves does not move in the place where it is. \n(We get no indication from him of any argument of Zeno’s to show that\nwhat moves does not move where it is not; perhaps that was thought \nself-evident.) And Aristotle’s evidence in this instance is an even \nmore meager basis for reconstruction than usual. Thus, according to \nAristotle, the moving arrow (A) is actually standing still. \nThe argument for this conclusion seems to be as follows: What moves \nis always, throughout the duration of its motion, in the now, that is\nto say, in one instant of time after another. So, throughout its \nflight, A is in one instant of time after another. At any \nparticular instant during its flight (t), A \noccupies a place exactly equivalent to its length, that is, \nA is “against what is equal.” But whatever is \nagainst what is equal is resting. So A is resting at \nt. But t is no different than the other instants \nduring A‘s flight, so that what is the case with \nA at t is the case with A at every other \ninstant of its flight. Thus A is resting at every instant of\nits flight, and this amounts to the moving arrow always being \nmotionless or standing still.\n2.2.4. The Moving Rows\n\n\n“Fourth,” Aristotle says, “is the one about the\nthings in the stadium moving from opposite directions, being of equal\nbulk, alongside things of equal size, with some moving from the end of\nthe stadium and some from the middle, at equal speed, in which case he\nsupposes it turns out that half the time is equal to its double”\n(Ph. 6.9, 239b33–240a1).\n\n\nAristotle’s ensuing discussion of what he takes to be Zeno’s mistakes\nis based on an exempli gratia scenario normally taken as a\nbasis for reconstruction, as it is here. “For example,”\nAristotle says, “let the resting equal masses be those marked\nAA, let those\nmarked BB be beginning from the middle, being\nequal in number and size to these, and let those marked\nCC be beginning from the end, being equal in\nnumber and size to these, and moving at the same speed as\nthe Bs” (Arist. Ph.  6.9,\n240a4–8). \n\n\n\n\nA A A A\nB B B B\n→\n←\nC C C C\n\n\nDiagram 1\n\n  \n\n\nA A A A\nB B B B\nC C C C\n\nDiagram 2\n\n\n\n\n\nDiagram 1 represents a plausible way of understanding what Aristotle\nenvisages as the starting position in Zeno’s paradox, even though his\ndescription of this position is somewhat underdetermined. Aristotle\ncontinues: “It follows that the\nleading B and the\nleading C are at the end at the same time,\nonce they move past one another”\n(240a9–10). This description suggests a final\nposition as represented in Diagram 2. Since we have no other\nindication of how Zeno himself thought he could derive the conclusion\nAristotle reports, that “half the time is equal to its\ndouble,” from the description of this situation, we have to rely\non Aristotle for this as well: “It follows,” Aristotle\nsays, “that the [leading] C has gone\npast all [the Bs], while the\n[leading] B has gone past half\n[the As], so that the time is half; for each\nof the two is alongside each other for an equal amount of time. But it\nalso follows that the leading B has gone past\nall the\nCs; for the leading C\nand the leading B will be at the opposite ends\nat the same time, because both are alongside\nthe As for an equal time”\n(204a10–17). Apparently, Zeno somehow meant to infer\nfrom the fact that the leading B moves past\ntwo As in the same time it moves past all\nfour Cs that half the time is equal to its\ndouble. The challenge is to develop from this less than startling fact\nanything more than a facile appearance of paradox. Since it is\nstressed that all the bodies are of the same size and that the moving\nbodies move at the same speed, Zeno would appear to have relied on\nsome such postulate as that a body in motion proceeding at constant\nspeed will move past bodies of the same size in the same amount of\ntime. He could have argued that in the time it takes all\nthe Cs to move past all\nthe Bs, the leading B\nmoves past two As or goes two lengths, and the\nleading B also moves past\nfour Cs or goes four lengths. According to the\npostulate, then, the time the leading B\ntravels must be the same as half the time it travels. Unfortunately,\nthe evidence for this particular paradox does not enable us to\ndetermine just how Zeno may in fact have argued. Aristotle thinks the\nargument depends upon a transparent falsehood, and one must therefore\nkeep in mind, if it seems he was right, that Aristotle’s presentation\nand reconstruction may itself be colored by his desire to bear out his\naccusation.\n",
    "section_title": "2.2 The Paradoxes of Motion",
    "entry_title": "Zeno of Elea",
    "hierarchy_title": "Zeno of Elea || The Extant Paradoxes || The Paradoxes of Motion",
    "tokenized_text": [
        "extant",
        "paradox",
        "paradox",
        "motion",
        "paradox",
        "motion",
        "aristotle",
        "concerned",
        "zeno",
        "physic",
        "book",
        "devoted",
        "theory",
        "continuum",
        "physic",
        "aristotle",
        "state",
        "zeno",
        "four",
        "argument",
        "concerning",
        "motion",
        "difficult",
        "resolve",
        "give",
        "summary",
        "paraphrase",
        "offer",
        "analysis",
        "ancient",
        "commentator",
        "chapter",
        "provide",
        "little",
        "additional",
        "information",
        "thus",
        "reconstruction",
        "famous",
        "argument",
        "rest",
        "almost",
        "exclusively",
        "aristotle",
        "incomplete",
        "presentation",
        "note",
        "aristotle",
        "remark",
        "leave",
        "open",
        "possibility",
        "zenonian",
        "argument",
        "motion",
        "deemed",
        "le",
        "difficult",
        "resolve",
        "importantly",
        "aristotle",
        "presentation",
        "give",
        "indication",
        "four",
        "argument",
        "might",
        "functioned",
        "within",
        "kind",
        "dialectical",
        "scheme",
        "indicated",
        "plato",
        "parmenides",
        "stadium",
        "dichotomy",
        "first",
        "aristotle",
        "say",
        "argument",
        "impossible",
        "move",
        "move",
        "must",
        "reach",
        "halfway",
        "point",
        "earlier",
        "end",
        "ph",
        "b",
        "say",
        "argument",
        "alludes",
        "earlier",
        "discussion",
        "physic",
        "arguing",
        "time",
        "magnitude",
        "continuous",
        "asserts",
        "therefore",
        "argument",
        "zeno",
        "falsely",
        "presumes",
        "possible",
        "traverse",
        "make",
        "contact",
        "unlimited",
        "thing",
        "individually",
        "limited",
        "time",
        "a",
        "subsequently",
        "physic",
        "raise",
        "question",
        "respond",
        "posing",
        "question",
        "zeno",
        "argument",
        "one",
        "must",
        "always",
        "pas",
        "halfway",
        "point",
        "unlimited",
        "impossible",
        "traverse",
        "thing",
        "unlimited",
        "a",
        "proceeds",
        "offer",
        "claim",
        "adequate",
        "solution",
        "one",
        "presented",
        "physic",
        "argument",
        "aristotle",
        "alluding",
        "passage",
        "get",
        "name",
        "mention",
        "topic",
        "zeno",
        "argument",
        "possible",
        "move",
        "traverse",
        "stadium",
        "prime",
        "example",
        "argument",
        "opposed",
        "common",
        "belief",
        "yet",
        "difficult",
        "resolve",
        "b",
        "following",
        "reconstruction",
        "attempt",
        "remain",
        "true",
        "evidence",
        "thus",
        "capture",
        "something",
        "zeno",
        "may",
        "originally",
        "argued",
        "anyone",
        "traverse",
        "finite",
        "distance",
        "across",
        "stadium",
        "p",
        "p",
        "within",
        "limited",
        "amount",
        "time",
        "must",
        "first",
        "reach",
        "point",
        "half",
        "way",
        "p",
        "p",
        "namely",
        "p",
        "reach",
        "p",
        "must",
        "first",
        "reach",
        "point",
        "half",
        "way",
        "p",
        "p",
        "namely",
        "p",
        "reach",
        "p",
        "must",
        "first",
        "reach",
        "point",
        "half",
        "way",
        "p",
        "p",
        "namely",
        "p",
        "half",
        "way",
        "point",
        "reached",
        "p",
        "p",
        "fact",
        "always",
        "another",
        "half",
        "way",
        "point",
        "must",
        "reached",
        "reaching",
        "given",
        "half",
        "way",
        "point",
        "number",
        "half",
        "way",
        "point",
        "must",
        "reached",
        "pn",
        "pn",
        "unlimited",
        "impossible",
        "reach",
        "unlimited",
        "number",
        "half",
        "way",
        "point",
        "within",
        "limited",
        "amount",
        "time",
        "therefore",
        "impossible",
        "traverse",
        "stadium",
        "indeed",
        "move",
        "general",
        "impossible",
        "move",
        "one",
        "place",
        "another",
        "achilles",
        "immediately",
        "brief",
        "presentation",
        "stadium",
        "aristotle",
        "introduces",
        "famous",
        "zeno",
        "paradox",
        "motion",
        "achilles",
        "tortoise",
        "second",
        "one",
        "called",
        "achilles",
        "slowest",
        "runner",
        "never",
        "overtaken",
        "fastest",
        "necessary",
        "one",
        "chasing",
        "come",
        "first",
        "one",
        "fleeing",
        "started",
        "necessary",
        "slower",
        "runner",
        "always",
        "ahead",
        "ph",
        "b",
        "simplicius",
        "add",
        "identification",
        "slowest",
        "runner",
        "tortoise",
        "ph",
        "aristotle",
        "remark",
        "argument",
        "merely",
        "variation",
        "dichotomy",
        "difference",
        "depend",
        "dividing",
        "half",
        "distance",
        "taken",
        "ph",
        "b",
        "analysis",
        "emphasizes",
        "paradox",
        "resolved",
        "way",
        "first",
        "paradox",
        "motion",
        "whether",
        "actually",
        "case",
        "debatable",
        "tortoise",
        "start",
        "ahead",
        "achilles",
        "race",
        "tortoise",
        "never",
        "overtaken",
        "achilles",
        "let",
        "start",
        "race",
        "represented",
        "follows",
        "time",
        "take",
        "achilles",
        "reach",
        "point",
        "tortoise",
        "started",
        "t",
        "tortoise",
        "progressed",
        "distance",
        "d",
        "beyond",
        "point",
        "namely",
        "t",
        "follows",
        "likewise",
        "time",
        "take",
        "achilles",
        "reach",
        "new",
        "point",
        "tortoise",
        "reached",
        "t",
        "tortoise",
        "progressed",
        "new",
        "distance",
        "d",
        "beyond",
        "tortoise",
        "new",
        "starting",
        "point",
        "namely",
        "t",
        "follows",
        "tortoise",
        "progressed",
        "distance",
        "d",
        "beyond",
        "t",
        "namely",
        "t",
        "time",
        "take",
        "achilles",
        "move",
        "a",
        "t",
        "a",
        "t",
        "fact",
        "time",
        "take",
        "achilles",
        "reach",
        "tortoise",
        "location",
        "beginning",
        "time",
        "tortoise",
        "always",
        "moved",
        "distance",
        "ahead",
        "every",
        "time",
        "achilles",
        "reach",
        "tortoise",
        "new",
        "starting",
        "point",
        "tortoise",
        "ahead",
        "therefore",
        "slowest",
        "runner",
        "race",
        "tortoise",
        "never",
        "overtaken",
        "fastest",
        "runner",
        "achilles",
        "arrow",
        "aristotle",
        "discussion",
        "relation",
        "motion",
        "time",
        "physic",
        "prepares",
        "way",
        "objection",
        "zenonian",
        "paradox",
        "motion",
        "mention",
        "beginning",
        "physic",
        "zeno",
        "reason",
        "fallaciously",
        "say",
        "every",
        "thing",
        "always",
        "resting",
        "whenever",
        "equal",
        "move",
        "always",
        "moving",
        "arrow",
        "motionless",
        "ph",
        "b",
        "aristotle",
        "remark",
        "zeno",
        "relies",
        "false",
        "supposition",
        "time",
        "composed",
        "indivisible",
        "now",
        "instant",
        "b",
        "point",
        "soon",
        "repeat",
        "identifying",
        "argument",
        "purporting",
        "show",
        "moving",
        "arrow",
        "standing",
        "still",
        "third",
        "zeno",
        "paradox",
        "motion",
        "b",
        "life",
        "pyrrho",
        "diogenes",
        "laertius",
        "report",
        "zeno",
        "abolishes",
        "motion",
        "saying",
        "move",
        "move",
        "neither",
        "place",
        "place",
        "dl",
        "zeno",
        "b",
        "dk",
        "cf",
        "epiphanius",
        "heretic",
        "report",
        "diels",
        "kranz",
        "took",
        "preserve",
        "genuine",
        "fragment",
        "zeno",
        "book",
        "appears",
        "suggest",
        "argument",
        "moving",
        "arrow",
        "rest",
        "may",
        "figured",
        "part",
        "broader",
        "argument",
        "motion",
        "diogenes",
        "however",
        "particularly",
        "good",
        "source",
        "zeno",
        "argument",
        "life",
        "zeno",
        "note",
        "first",
        "propound",
        "achilles",
        "argument",
        "along",
        "many",
        "others",
        "dl",
        "likely",
        "therefore",
        "diogenes",
        "report",
        "depends",
        "intervening",
        "attempt",
        "couch",
        "paradox",
        "motion",
        "reported",
        "aristotle",
        "dilemmatic",
        "form",
        "plato",
        "indicates",
        "typical",
        "zenonian",
        "argumentation",
        "even",
        "diogenes",
        "report",
        "happens",
        "reliable",
        "still",
        "must",
        "rely",
        "aristotle",
        "trying",
        "reconstruct",
        "argument",
        "diogenes",
        "report",
        "move",
        "move",
        "place",
        "get",
        "indication",
        "argument",
        "zeno",
        "show",
        "move",
        "move",
        "perhaps",
        "thought",
        "selfevident",
        "aristotle",
        "evidence",
        "instance",
        "even",
        "meager",
        "basis",
        "reconstruction",
        "usual",
        "thus",
        "according",
        "aristotle",
        "moving",
        "arrow",
        "actually",
        "standing",
        "still",
        "argument",
        "conclusion",
        "seems",
        "follows",
        "move",
        "always",
        "throughout",
        "duration",
        "motion",
        "say",
        "one",
        "instant",
        "time",
        "another",
        "throughout",
        "flight",
        "one",
        "instant",
        "time",
        "another",
        "particular",
        "instant",
        "flight",
        "occupies",
        "place",
        "exactly",
        "equivalent",
        "length",
        "equal",
        "whatever",
        "equal",
        "resting",
        "resting",
        "t",
        "different",
        "instant",
        "flight",
        "case",
        "case",
        "every",
        "instant",
        "flight",
        "thus",
        "resting",
        "every",
        "instant",
        "flight",
        "amount",
        "moving",
        "arrow",
        "always",
        "motionless",
        "standing",
        "still",
        "moving",
        "row",
        "fourth",
        "aristotle",
        "say",
        "one",
        "thing",
        "stadium",
        "moving",
        "opposite",
        "direction",
        "equal",
        "bulk",
        "alongside",
        "thing",
        "equal",
        "size",
        "moving",
        "end",
        "stadium",
        "middle",
        "equal",
        "speed",
        "case",
        "supposes",
        "turn",
        "half",
        "time",
        "equal",
        "double",
        "ph",
        "ba",
        "aristotle",
        "ensuing",
        "discussion",
        "take",
        "zeno",
        "mistake",
        "based",
        "exempli",
        "gratia",
        "scenario",
        "normally",
        "taken",
        "basis",
        "reconstruction",
        "example",
        "aristotle",
        "say",
        "let",
        "resting",
        "equal",
        "mass",
        "marked",
        "aa",
        "let",
        "marked",
        "bb",
        "beginning",
        "middle",
        "equal",
        "number",
        "size",
        "let",
        "marked",
        "cc",
        "beginning",
        "end",
        "equal",
        "number",
        "size",
        "moving",
        "speed",
        "b",
        "arist",
        "ph",
        "a",
        "b",
        "b",
        "b",
        "b",
        "c",
        "c",
        "c",
        "c",
        "diagram",
        "b",
        "b",
        "b",
        "b",
        "c",
        "c",
        "c",
        "c",
        "diagram",
        "diagram",
        "represents",
        "plausible",
        "way",
        "understanding",
        "aristotle",
        "envisages",
        "starting",
        "position",
        "zeno",
        "paradox",
        "even",
        "though",
        "description",
        "position",
        "somewhat",
        "underdetermined",
        "aristotle",
        "continues",
        "follows",
        "leading",
        "b",
        "leading",
        "c",
        "end",
        "time",
        "move",
        "past",
        "one",
        "another",
        "a",
        "description",
        "suggests",
        "final",
        "position",
        "represented",
        "diagram",
        "since",
        "indication",
        "zeno",
        "thought",
        "could",
        "derive",
        "conclusion",
        "aristotle",
        "report",
        "half",
        "time",
        "equal",
        "double",
        "description",
        "situation",
        "rely",
        "aristotle",
        "well",
        "follows",
        "aristotle",
        "say",
        "leading",
        "c",
        "gone",
        "past",
        "b",
        "leading",
        "b",
        "gone",
        "past",
        "half",
        "time",
        "half",
        "two",
        "alongside",
        "equal",
        "amount",
        "time",
        "also",
        "follows",
        "leading",
        "b",
        "gone",
        "past",
        "c",
        "leading",
        "c",
        "leading",
        "b",
        "opposite",
        "end",
        "time",
        "alongside",
        "equal",
        "time",
        "a",
        "apparently",
        "zeno",
        "somehow",
        "meant",
        "infer",
        "fact",
        "leading",
        "b",
        "move",
        "past",
        "two",
        "time",
        "move",
        "past",
        "four",
        "c",
        "half",
        "time",
        "equal",
        "double",
        "challenge",
        "develop",
        "le",
        "startling",
        "fact",
        "anything",
        "facile",
        "appearance",
        "paradox",
        "since",
        "stressed",
        "body",
        "size",
        "moving",
        "body",
        "move",
        "speed",
        "zeno",
        "would",
        "appear",
        "relied",
        "postulate",
        "body",
        "motion",
        "proceeding",
        "constant",
        "speed",
        "move",
        "past",
        "body",
        "size",
        "amount",
        "time",
        "could",
        "argued",
        "time",
        "take",
        "c",
        "move",
        "past",
        "b",
        "leading",
        "b",
        "move",
        "past",
        "two",
        "go",
        "two",
        "length",
        "leading",
        "b",
        "also",
        "move",
        "past",
        "four",
        "c",
        "go",
        "four",
        "length",
        "according",
        "postulate",
        "time",
        "leading",
        "b",
        "travel",
        "must",
        "half",
        "time",
        "travel",
        "unfortunately",
        "evidence",
        "particular",
        "paradox",
        "enable",
        "u",
        "determine",
        "zeno",
        "may",
        "fact",
        "argued",
        "aristotle",
        "think",
        "argument",
        "depends",
        "upon",
        "transparent",
        "falsehood",
        "one",
        "must",
        "therefore",
        "keep",
        "mind",
        "seems",
        "right",
        "aristotle",
        "presentation",
        "reconstruction",
        "may",
        "colored",
        "desire",
        "bear",
        "accusation"
    ]
}