{
    "main_text": "The Axioms\n1. The Axioms\nThe introduction to Zermelo's paper makes it clear that set theory is regarded as a fundamental theory:\n\nSet theory is that branch of mathematics whose task is to\n  investigate mathematically the fundamental notions\n  “number”, “order”, and\n  “function”, taking them in their pristine, simple form,\n  and to develop thereby the logical foundations of all of arithmetic\n  and analysis; thus it constitutes an indispensable component of the\n  science of mathematics.\n (1908b: 261)[1]\n\nThis is followed by an acknowledgment that it is necessary to\nreplace the central assumption that we can ‘assign to an\narbitrary logically definable notion a “set”, or\n“class”, as its “extension” ’\n(1908b: 261). Zermelo goes on:\n\nIn solving the problem [this presents] we must, on the one hand,\nrestrict these principles [distilled from the actual operation with\nsets] sufficiently to exclude all contradictions and, on the other,\ntake them sufficiently wide to retain all that is valuable in this\ntheory. (1908b: 261)\n\nThe ‘central assumption’ which Zermelo describes (let\nus call it the Comprehension Principle, or CP) had come to be seen by\nmany as the principle behind the derivation of the set-theoretic\ninconsistencies. Russell (1903: §104) says the following:\n\nPerhaps the best way to state the suggested solution [of the\n  Russell-Zermelo contradiction] is to say that, if a collection of\n  terms can only be defined by a variable propositional function,\n  then, though a class as many may be admitted, a class as one must be\n  denied. We took it as axiomatic that the class as one is to be found\n  wherever there is a class as many; but this axiom need not be\n  universally admitted, and appears to have been the source of the\n  contradiction. By denying it, therefore, the whole difficulty will\n  be overcome.\n\nBut it is by no means clear that ‘the whole difficulty’\nis thereby ‘overcome’. Russell makes a clear\nidentification of the principle he cites (a version of CP) as the\nsource of error, but this does not in the least make it clear what is\nto take its \nplace.[2] \nIn his Grundgesetze (see e.g., Frege\n1903: §146–147) Frege recognises that his (in)famous Law V\nis based on a conversion principle which allows us to assume that for\nany concept (function), there is an object which contains precisely\nthose things which fall under that concept (or for which the function\nreturns the value ‘True’). Law V is then the principle\nwhich says that two such extension objects a, b stemming\nfrom two concepts F, G are the same if, and only\nif, F and G are extensionally equivalent. Frege clearly\nconsiders the ‘conversion’ of concepts to extensions as\nfundamental; he also regards it as widely used in mathematics (even if\nonly implicitly), and thus that he is not ‘doing anything\nnew’ by using such a principle of conversion and the attendant\n‘basic law of logic’, Law V. (The CP follows immediately\nfrom Law V.) Frege was made aware by Russell (1902) that his Law V is\ncontradictory, since Russell's paradox flows easily from it. In the\nAppendix to Grundgesetze (Frege 1903), Frege says this:\n\nHardly anything more unwelcome can befall a scientific writer\n  than to have one of the foundations of his edifice shaken after the\n  work is finished. This is the position into which I was put by a\n  letter from Mr Bertrand Russell as the printing of this volume was\n  nearing completion. The matter concerns my Basic Law (V). I have\n  never concealed from myself that it is not as obvious as the others\n  nor as obvious as must properly be required of a logical\n  law. Indeed, I pointed out this very weakness in the foreword to the\n  first volume, p. VII. I would gladly have dispensed with this\n  foundation if I had known of some substitute for it. Even now, I do\n  not see how arithmetic can be founded scientifically, how the\n  numbers can be apprehended as logical objects and brought under\n  consideration, if it is not—at least\n  conditionally—permissible to pass from a concept to its\n  extension. May I always speak of the extension of a concept, of a\n  class? And if not, how are the exceptions to be recognised? May one\n  always infer from the extension of one concept's coinciding with\n  that of a second that every object falling under the first concept\n  also falls under the latter? These questions arise from Mr Russell's\n  communication. …What is at stake here is not my approach to a\n  foundation in particular, but rather the very possibility of any\n  logical foundation of\n  arithmetic. (p. 253)[3]\n\nThe difficulty could hardly be summed up more succinctly. It was\nthe replacement of assumptions involving the unfettered conversion of\nconcepts to objects which was Zermelo's main task in his\naxiomatisation.\nZermelo's system was based on the presupposition that\n\nSet theory is concerned with a “domain” 𝔅 of\n  individuals, which we shall call simply “objects” and\n  among which are the “sets”. If two symbols, a\n  and b, denote the same object, we write a = b,\n  otherwise\na ≠ b. We say of an\nobject a that it “exists” if it belongs to the\ndomain 𝔅; likewise we say of a class 𝔎 of objects that\n“there exist objects of the class 𝔎” if 𝔅\ncontains at least one individual of this class. (1908b: 262)\n\nGiven this, the one fundamental relation is that of set membership,\n‘ε’ , which allows one to state that an\nobject a belongs to, or is in, a set b, written\n‘a ε \n b’.[4]\n Zermelo then laid down seven axioms which\ngive a partial description of what is to be found in B. These\ncan be described as follows:\n\nExtensionalityThis says roughly that sets are\n  determined by the elements they contain.\nAxiom of Elementary SetsThis asserts (a) the\n  existence of a set which contains no members (denoted\n  ‘0’ by Zermelo, now commonly denoted by\n  ‘∅’); (b) the existence, for any object a,\n  of the singleton set {a} which has a as its sole\n  member; and (c) the existence, for any two\n  objects a, b, of the unordered pair\n  {a, b}, which has just a, b as its\n  members.\nSeparation (Aussonderungsaxiom)This asserts\nthat, for any given set a, and any given ‘definite’\nproperty of elements in 𝔅 (more on this below), one can\n‘separate’ out from a as a set just those elements\nwhich satisfy the given property.\nPower SetThis says that for any set, the collection\nof all subsets of that set is also a set.\nUnionThis says that for any set, the collection of\nthe members of the members of that set also forms a set.\nChoiceThis says that for any set of pairwise\ndisjoint, non-empty sets, there exists a set (which is a subset of the\nunion set to which the given set gives rise) which contains exactly\none member from each member of the given set.\n\nInfinityThis final axiom asserts the existence of an\ninfinitely large set which contains the empty set, and for each\nset a that it contains, also contains the set\n{a}. (Thus, this infinite set must contain ∅, {∅},\n{{∅}}, ….)\n\nWith the inclusion of this last, Zermelo explicitly rejects any\nattempt to prove the existence of an infinite collection from other\nprinciples, as we find in Dedekind (1888: §66), or in Frege via\nthe establishment of what is known as ‘Hume's Principle’.\nThe four central axioms of Zermelo's system are the Axioms of\nInfinity and Power Set, which together show the existence of\nuncountable sets, the Axiom of Choice, to which we will devote some\nspace below, and the Axiom of Separation. This latter allows that any\n‘definite’ property φ does in fact give rise to a set,\nnamely the set of all those things which are already included in some\nset a and which have the property φ, in other words, gives\nrise to a certain subset of a, namely the subset of all the\nφ-things in a. Thus, it follows from this latter that there\nwill generally be many sets giving partial extensions of φ, namely\nthe φ-things in a, the φ-things in b, the\nφ-things in c, and so on. However, there will be no\nguarantee of the existence of a unique extension-set for φ, as, of\ncourse, there is under the CP, namely a = {x :\nφ(x)}.\nZermelo shows that, on the basis of his system, the two central\nparadoxes, that of the greatest set and that of Russell, cannot\narise. In fact, Zermelo proves:\n\nEvery set M possesses at least one\n  subset M0 that is not an element\n  of M. (1908b: 265)\n\nThe proof is an easy modification of the argument for Russell's\nParadox, using the contradiction this time as a reductio. By\nSeparation, let M0 be the subset of M\nconsisting of those elements x of M such\nthat \nx ∉ x. Now either \nM0 ∈ M0\nor M0 ∉ M0. Assume\nthat \nM0 ∈ M0. Since \nM0 is a subset\nof M, this tells us that \nM0 ∈ M. But M0 is then a member of M\nwhich fails to satisfy the condition for belonging\nto M0, showing\nthat \nM0 ∉ M0, which is a\ncontradiction. Hence,\nnecessarily, \nM0 ∉ M0. But now\nif we suppose that M0 were in M,\nthen M0 itself is bound to be\nin M0 by the defining condition of this\nset. Hence, \nM0 ∉ M on pain of\ncontradiction. The argument for the Russell paradox is used here to\nconstructive effect: one person's contradiction is another person's\nreductio. Zermelo comments:\n\nIt follows from the theorem that not all objects x of the\n  domain 𝔅 can be elements of one and the same set; that is,\n  the domain 𝔅 is not itself a set, and this disposes of the\n  “Russell antinomy” so far as we are concerned. (1908b:\n  265) \nFor, in the absence of something like the CP, there is no\noverriding reason to think that there must be a universal\nset.[5]\nBut although this deals with the Russell paradox and the paradox of\nthe universal set, it does not tackle the general consistency of the\nsystem. Zermelo was well aware of this, as is clear from the\nIntroduction to his paper:\n\nI have not yet even been able to prove rigorously that my axioms\n  are “consistent”, though this is certainly very\n  essential; instead I have had to confine myself to pointing out now\n  and then that the “antinomies” discovered so far vanish\n  one and all if the principles here proposed are adopted as a\n  basis. But I hope to have done at least some useful spadework hereby\n  for subsequent investigations in such deeper problems. (1908b:\n  262)\n\nIt should be remarked in passing that Zermelo doesn't deal specifically with the\nBurali-Forti paradox either, for the simple reason that it cannot be properly\nformulated in his system, since it deals either with well-orderings\ngenerally or with the general concept of ordinal number. We will come\nback to this below. However, assuming that the known paradoxes can be\navoided, another question comes to the fore: if the Separation Axiom\nis to be the basic principle for the workaday creation of sets, is it\nadequate? This question, too, will be taken up later.\nThere were attempts at the statement of axioms before Zermelo, both\npublicly and in private\n correspondence.[6] \nIn particular, Cantor, in correspondence\nwith Hilbert and Dedekind in the late 1890s, had endeavoured to\ndescribe some principles of set \nexistence[7] \nwhich he thought were legitimate, and would\nnot give rise to the construction of what he called\n‘inconsistent totalities’, totalities which engender\ncontradictions. (The best known of these totalities were the totality\nof all ordinals and the totality of all cardinals.) These principles\nincluded those of set union and a form of the replacement axiom, as\nwell as principles which seem to guarantee that every cardinal number\nis an aleph, which we call for short the ‘Aleph Hypothesis\n(AH)’.\nDespite this, there are reasons for calling Zermelo's system the\nfirst real axiomatisation of set theory. It is clear above all that\nZermelo's intention was to reveal the fundamental nature of the theory\nof sets and to preserve its achievements, while at the same time\nproviding a general replacement for the CP.\n",
    "section_title": "1. The Axioms",
    "entry_title": "Zermelo’s Axiomatization of Set Theory",
    "hierarchy_title": "Zermelo’s Axiomatization of Set Theory || The Axioms",
    "tokenized_text": [
        "axiom",
        "axiom",
        "introduction",
        "zermelo",
        "s",
        "paper",
        "make",
        "clear",
        "set",
        "theory",
        "regarded",
        "fundamental",
        "theory",
        "set",
        "theory",
        "branch",
        "mathematics",
        "whose",
        "task",
        "investigate",
        "mathematically",
        "fundamental",
        "notion",
        "number",
        "order",
        "function",
        "taking",
        "pristine",
        "simple",
        "form",
        "develop",
        "thereby",
        "logical",
        "foundation",
        "arithmetic",
        "analysis",
        "thus",
        "constitutes",
        "indispensable",
        "component",
        "science",
        "mathematics",
        "b",
        "followed",
        "acknowledgment",
        "necessary",
        "replace",
        "central",
        "assumption",
        "assign",
        "arbitrary",
        "logically",
        "definable",
        "notion",
        "set",
        "class",
        "extension",
        "b",
        "zermelo",
        "go",
        "solving",
        "problem",
        "present",
        "must",
        "one",
        "hand",
        "restrict",
        "principle",
        "distilled",
        "actual",
        "operation",
        "set",
        "sufficiently",
        "exclude",
        "contradiction",
        "take",
        "sufficiently",
        "wide",
        "retain",
        "valuable",
        "theory",
        "b",
        "central",
        "assumption",
        "zermelo",
        "describes",
        "let",
        "u",
        "call",
        "comprehension",
        "principle",
        "cp",
        "come",
        "seen",
        "many",
        "principle",
        "behind",
        "derivation",
        "settheoretic",
        "inconsistency",
        "russell",
        "say",
        "following",
        "perhaps",
        "best",
        "way",
        "state",
        "suggested",
        "solution",
        "russellzermelo",
        "contradiction",
        "say",
        "collection",
        "term",
        "defined",
        "variable",
        "propositional",
        "function",
        "though",
        "class",
        "many",
        "may",
        "admitted",
        "class",
        "one",
        "must",
        "denied",
        "took",
        "axiomatic",
        "class",
        "one",
        "found",
        "wherever",
        "class",
        "many",
        "axiom",
        "need",
        "universally",
        "admitted",
        "appears",
        "source",
        "contradiction",
        "denying",
        "therefore",
        "whole",
        "difficulty",
        "overcome",
        "mean",
        "clear",
        "whole",
        "difficulty",
        "thereby",
        "overcome",
        "russell",
        "make",
        "clear",
        "identification",
        "principle",
        "cite",
        "version",
        "cp",
        "source",
        "error",
        "least",
        "make",
        "clear",
        "take",
        "place",
        "grundgesetze",
        "see",
        "eg",
        "frege",
        "frege",
        "recognises",
        "famous",
        "law",
        "v",
        "based",
        "conversion",
        "principle",
        "allows",
        "u",
        "assume",
        "concept",
        "function",
        "object",
        "contains",
        "precisely",
        "thing",
        "fall",
        "concept",
        "function",
        "return",
        "value",
        "true",
        "law",
        "v",
        "principle",
        "say",
        "two",
        "extension",
        "object",
        "b",
        "stemming",
        "two",
        "concept",
        "f",
        "g",
        "f",
        "g",
        "extensionally",
        "equivalent",
        "frege",
        "clearly",
        "considers",
        "conversion",
        "concept",
        "extension",
        "fundamental",
        "also",
        "regard",
        "widely",
        "used",
        "mathematics",
        "even",
        "implicitly",
        "thus",
        "anything",
        "new",
        "using",
        "principle",
        "conversion",
        "attendant",
        "basic",
        "law",
        "logic",
        "law",
        "v",
        "cp",
        "follows",
        "immediately",
        "law",
        "v",
        "frege",
        "made",
        "aware",
        "russell",
        "law",
        "v",
        "contradictory",
        "since",
        "russell",
        "s",
        "paradox",
        "flow",
        "easily",
        "appendix",
        "grundgesetze",
        "frege",
        "frege",
        "say",
        "hardly",
        "anything",
        "unwelcome",
        "befall",
        "scientific",
        "writer",
        "one",
        "foundation",
        "edifice",
        "shaken",
        "work",
        "finished",
        "position",
        "put",
        "letter",
        "mr",
        "bertrand",
        "russell",
        "printing",
        "volume",
        "nearing",
        "completion",
        "matter",
        "concern",
        "basic",
        "law",
        "v",
        "never",
        "concealed",
        "obvious",
        "others",
        "obvious",
        "must",
        "properly",
        "required",
        "logical",
        "law",
        "indeed",
        "pointed",
        "weakness",
        "foreword",
        "first",
        "volume",
        "p",
        "vii",
        "would",
        "gladly",
        "dispensed",
        "foundation",
        "known",
        "substitute",
        "even",
        "see",
        "arithmetic",
        "founded",
        "scientifically",
        "number",
        "apprehended",
        "logical",
        "object",
        "brought",
        "consideration",
        "notat",
        "least",
        "conditionallypermissible",
        "pas",
        "concept",
        "extension",
        "may",
        "always",
        "speak",
        "extension",
        "concept",
        "class",
        "exception",
        "recognised",
        "may",
        "one",
        "always",
        "infer",
        "extension",
        "one",
        "concept",
        "s",
        "coinciding",
        "second",
        "every",
        "object",
        "falling",
        "first",
        "concept",
        "also",
        "fall",
        "latter",
        "question",
        "arise",
        "mr",
        "russell",
        "s",
        "communication",
        "what",
        "stake",
        "approach",
        "foundation",
        "particular",
        "rather",
        "possibility",
        "logical",
        "foundation",
        "arithmetic",
        "p",
        "difficulty",
        "could",
        "hardly",
        "summed",
        "succinctly",
        "replacement",
        "assumption",
        "involving",
        "unfettered",
        "conversion",
        "concept",
        "object",
        "zermelo",
        "s",
        "main",
        "task",
        "axiomatisation",
        "zermelo",
        "s",
        "system",
        "based",
        "presupposition",
        "set",
        "theory",
        "concerned",
        "domain",
        "𝔅",
        "individual",
        "shall",
        "call",
        "simply",
        "object",
        "among",
        "set",
        "two",
        "symbol",
        "b",
        "denote",
        "object",
        "write",
        "b",
        "otherwise",
        "b",
        "say",
        "object",
        "exists",
        "belongs",
        "domain",
        "𝔅",
        "likewise",
        "say",
        "class",
        "𝔎",
        "object",
        "exist",
        "object",
        "class",
        "𝔎",
        "𝔅",
        "contains",
        "least",
        "one",
        "individual",
        "class",
        "b",
        "given",
        "one",
        "fundamental",
        "relation",
        "set",
        "membership",
        "ε",
        "allows",
        "one",
        "state",
        "object",
        "belongs",
        "set",
        "b",
        "written",
        "ε",
        "b",
        "zermelo",
        "laid",
        "seven",
        "axiom",
        "give",
        "partial",
        "description",
        "found",
        "b",
        "described",
        "follows",
        "extensionalitythis",
        "say",
        "roughly",
        "set",
        "determined",
        "element",
        "contain",
        "axiom",
        "elementary",
        "setsthis",
        "asserts",
        "existence",
        "set",
        "contains",
        "member",
        "denoted",
        "zermelo",
        "commonly",
        "denoted",
        "b",
        "existence",
        "object",
        "singleton",
        "set",
        "sole",
        "member",
        "c",
        "existence",
        "two",
        "object",
        "b",
        "unordered",
        "pair",
        "b",
        "b",
        "member",
        "separation",
        "aussonderungsaxiom",
        "asserts",
        "given",
        "set",
        "given",
        "definite",
        "property",
        "element",
        "𝔅",
        "one",
        "separate",
        "set",
        "element",
        "satisfy",
        "given",
        "property",
        "power",
        "setthis",
        "say",
        "set",
        "collection",
        "subset",
        "set",
        "also",
        "set",
        "unionthis",
        "say",
        "set",
        "collection",
        "member",
        "member",
        "set",
        "also",
        "form",
        "set",
        "choicethis",
        "say",
        "set",
        "pairwise",
        "disjoint",
        "nonempty",
        "set",
        "exists",
        "set",
        "subset",
        "union",
        "set",
        "given",
        "set",
        "give",
        "rise",
        "contains",
        "exactly",
        "one",
        "member",
        "member",
        "given",
        "set",
        "infinitythis",
        "final",
        "axiom",
        "asserts",
        "existence",
        "infinitely",
        "large",
        "set",
        "contains",
        "empty",
        "set",
        "set",
        "contains",
        "also",
        "contains",
        "set",
        "thus",
        "infinite",
        "set",
        "must",
        "contain",
        "inclusion",
        "last",
        "zermelo",
        "explicitly",
        "reject",
        "attempt",
        "prove",
        "existence",
        "infinite",
        "collection",
        "principle",
        "find",
        "dedekind",
        "frege",
        "via",
        "establishment",
        "known",
        "hume",
        "s",
        "principle",
        "four",
        "central",
        "axiom",
        "zermelo",
        "s",
        "system",
        "axiom",
        "infinity",
        "power",
        "set",
        "together",
        "show",
        "existence",
        "uncountable",
        "set",
        "axiom",
        "choice",
        "devote",
        "space",
        "axiom",
        "separation",
        "latter",
        "allows",
        "definite",
        "property",
        "φ",
        "fact",
        "give",
        "rise",
        "set",
        "namely",
        "set",
        "thing",
        "already",
        "included",
        "set",
        "property",
        "φ",
        "word",
        "give",
        "rise",
        "certain",
        "subset",
        "namely",
        "subset",
        "φthings",
        "a",
        "thus",
        "follows",
        "latter",
        "generally",
        "many",
        "set",
        "giving",
        "partial",
        "extension",
        "φ",
        "namely",
        "φthings",
        "φthings",
        "b",
        "φthings",
        "c",
        "however",
        "guarantee",
        "existence",
        "unique",
        "extensionset",
        "φ",
        "course",
        "cp",
        "namely",
        "x",
        "φ",
        "x",
        "zermelo",
        "show",
        "basis",
        "system",
        "two",
        "central",
        "paradox",
        "greatest",
        "set",
        "russell",
        "arise",
        "fact",
        "zermelo",
        "prof",
        "every",
        "set",
        "posse",
        "least",
        "one",
        "subset",
        "m",
        "element",
        "m",
        "b",
        "proof",
        "easy",
        "modification",
        "argument",
        "russell",
        "s",
        "paradox",
        "using",
        "contradiction",
        "time",
        "reductio",
        "separation",
        "let",
        "m",
        "subset",
        "consisting",
        "element",
        "x",
        "x",
        "x",
        "either",
        "m",
        "m",
        "m",
        "m",
        "assume",
        "m",
        "m",
        "since",
        "m",
        "subset",
        "tell",
        "u",
        "m",
        "m",
        "m",
        "member",
        "fails",
        "satisfy",
        "condition",
        "belonging",
        "m",
        "showing",
        "m",
        "m",
        "contradiction",
        "hence",
        "necessarily",
        "m",
        "m",
        "suppose",
        "m",
        "m",
        "bound",
        "m",
        "defining",
        "condition",
        "set",
        "hence",
        "m",
        "pain",
        "contradiction",
        "argument",
        "russell",
        "paradox",
        "used",
        "constructive",
        "effect",
        "one",
        "person",
        "s",
        "contradiction",
        "another",
        "person",
        "s",
        "reductio",
        "zermelo",
        "comment",
        "follows",
        "theorem",
        "object",
        "x",
        "domain",
        "𝔅",
        "element",
        "one",
        "set",
        "domain",
        "𝔅",
        "set",
        "disposes",
        "russell",
        "antinomy",
        "far",
        "concerned",
        "b",
        "absence",
        "something",
        "like",
        "cp",
        "overriding",
        "reason",
        "think",
        "must",
        "universal",
        "set",
        "although",
        "deal",
        "russell",
        "paradox",
        "paradox",
        "universal",
        "set",
        "tackle",
        "general",
        "consistency",
        "system",
        "zermelo",
        "well",
        "aware",
        "clear",
        "introduction",
        "paper",
        "yet",
        "even",
        "able",
        "prove",
        "rigorously",
        "axiom",
        "consistent",
        "though",
        "certainly",
        "essential",
        "instead",
        "confine",
        "pointing",
        "antinomy",
        "discovered",
        "far",
        "vanish",
        "one",
        "principle",
        "proposed",
        "adopted",
        "basis",
        "hope",
        "done",
        "least",
        "useful",
        "spadework",
        "hereby",
        "subsequent",
        "investigation",
        "deeper",
        "problem",
        "b",
        "remarked",
        "passing",
        "zermelo",
        "nt",
        "deal",
        "specifically",
        "buraliforti",
        "paradox",
        "either",
        "simple",
        "reason",
        "properly",
        "formulated",
        "system",
        "since",
        "deal",
        "either",
        "wellorderings",
        "generally",
        "general",
        "concept",
        "ordinal",
        "number",
        "come",
        "back",
        "however",
        "assuming",
        "known",
        "paradox",
        "avoided",
        "another",
        "question",
        "come",
        "fore",
        "separation",
        "axiom",
        "basic",
        "principle",
        "workaday",
        "creation",
        "set",
        "adequate",
        "question",
        "taken",
        "later",
        "attempt",
        "statement",
        "axiom",
        "zermelo",
        "publicly",
        "private",
        "correspondence",
        "particular",
        "cantor",
        "correspondence",
        "hilbert",
        "dedekind",
        "late",
        "s",
        "endeavoured",
        "describe",
        "principle",
        "set",
        "existence",
        "thought",
        "legitimate",
        "would",
        "give",
        "rise",
        "construction",
        "called",
        "inconsistent",
        "totality",
        "totality",
        "engender",
        "contradiction",
        "best",
        "known",
        "totality",
        "totality",
        "ordinal",
        "totality",
        "cardinal",
        "principle",
        "included",
        "set",
        "union",
        "form",
        "replacement",
        "axiom",
        "well",
        "principle",
        "seem",
        "guarantee",
        "every",
        "cardinal",
        "number",
        "aleph",
        "call",
        "short",
        "aleph",
        "hypothesis",
        "ah",
        "despite",
        "reason",
        "calling",
        "zermelo",
        "s",
        "system",
        "first",
        "real",
        "axiomatisation",
        "set",
        "theory",
        "clear",
        "zermelo",
        "s",
        "intention",
        "reveal",
        "fundamental",
        "nature",
        "theory",
        "set",
        "preserve",
        "achievement",
        "time",
        "providing",
        "general",
        "replacement",
        "cp"
    ]
}