{
    "main_text": "Complementarity between li and qi, and among related terms\n6. Major Interpreters of Zhu Xi\n\nZhu Xi was an active scholar-intellectual who held discussions and\ndisputes with other scholars, both in correspondence and in person.\nHis thought can be understood by contrast with the thought of his\nintellectual rivals as well as through his positive views. For\nexample, his series of letters with Zhang Shi on the topic of\nself-cultivation and moral psychology, preserved in the Collected\nWritings of Master Zhu (Zhuzi wenji), provides an\nilluminating record of these two dedicated Confucians’ quest for\na well-grounded, efficacious approach to self-cultivation. He debated\nwith Lü Zuqian (1134–1181) on the nature of education. Zhu\nfocused on the Confucian Way and moral practice in education while Lu\nargued for a broader-based humanities approach. Zhu held a series of\ndebates with Lu Jiuyuan (Xiangshan: 1139–93) on the nature of\nrealization and moral conduct. Whereas Zhu advocated regimens of\nstudy, reflection, observation, and practice, Lu spoke simply of\nreflecting on self and clarifying the mind, considering that once the\nmind was clear one would know spontaneously what to do in any\nsituation. Zhu also corresponded with the “utilitarian”\nConfucian scholar Chen Liang (1143–94), who disputed Zhu’s\nfocus on individual moral realization and the received\n“Way” with a broader institutional approach that was more\nsensitive to empirical facts and conditions. Zhu generally eclipsed\nall of the other scholars of his day, partly because he outlived them\nand had so many students but mainly because his system was so\ncompelling. It was comprehensive yet nuanced, tightly reasoned yet\naccommodating of individual differences. It preserved the essential\nConfucian Way, yet ramified it to meet the challenges of Buddhism and\nDaoism as spiritual teachings. Zhu’s influence rose at the end\nof the Southern Song dynasty and became decisive during the Yuan\ndynasty when his edition of the Four Books was adopted as the\nbasis of the imperial examination system arranged by scholars trained\nin his approach.\n\nWhile raising his standing in pedagogy, this focus on the Four\nBooks came at the expense of Zhu’s deeper, more nuanced\ntexts and dialogues, and opened the door to undue philosophic\ncriticism. The schematic presentation of Zhu’s broad theory of\nli pattern and qi cosmic vapor that lay in the\nbackground of his commentary to the Four Books easily opened\nhim to charges of dualism and of reading abstract categories into the\ndown to earth, essentially practical ancient texts. Because his\ncommentary was focused on reading and understanding the meaning,\nintent, and cultivation message of the Four Books, critics\ngeneralized that Zhu and his method were essentially scholastic and\nwould be myopic and stilted in facing real situations. Anyone who\nperuses the corpus of Zhu’s writings and dialogues, however,\nwill find that his ontology is not a crude dualism but a holism built\nof complementary, mutually implicative elements that never exist in\nseparation. Also, his reflections are always informed by knowledge of\nhistory, current events, practical observation, and personal\nreflection, as his method of observation applies generally to objects\n(and self) and phenomena while respecting texts, which he took to be\nhandbooks of ethical insight and practice, after all. Even Zhu’s\ncomments on Confucius and Mencius often refer back to the person and\nthe speech context, and thus are not entirely scholastic. His method\nof observation opened the door to breakthroughs beyond the\n“verities” of the classics, though he was careful not to\nplay up this fact because most of his intellectual colleagues\nprimarily sought the truth in the texts, thinking empirical facts were\ndistractions from the essential Natural-patterning (tianli)\nthat was reflected most adequately in the canonical texts.\n\nWhereas early generations of Zhu’s followers were acquainted\nwith his broad learning, incisive style, and open spirit, Confucians\nof the Ming and Qing dynasties knew him mostly through his edition of\nthe Four Books, through which they targeted their criticisms\nof his thought. Zhu’s most eminent critic was the Ming\nscholar-official Wang Yangming (1472–1529). He rejected\nZhu’s approach to observation as too objective and open-ended,\nas outward and diffuse and neglectful of concentration and inwardness. It could\nbe said that, in his criticisms, Wang was reacting more to the\nscholastic attitudes fostered by the examination system than to Zhu Xi\nhimself. Wang ultimately respected Zhu and went on to compile a text\nin which he argued that, in later life, Zhu’s thought had taken a \na subjective, practical turn that anticipated Wang’s\napproach.\n\nScholars of the late Ming through the early Qing period\n(mid-seventeenth to early eighteenth century), notably, Wang Fuzhi\n(1619–92) and Dai Zhen (Tai Chen, 1723–77), disputed Zhu\non philosophical and textual grounds. Whereas Zhu had allegedly insisted on the\npriority of “pattern” over qi, (roughly, form\nover matter), Wang and Dai followed the Northern Song thinker Zhang\nZai in affirming the priority of qi, viewing patterns as\na posteriori evolutionary realizations of qi\ninteractions. They thought this account dissolved the threat of any\nhint of dualism in cosmology, ontology, and human nature. For his\npart, Zhu Xi would have responded that, fundamentally,\n“pattern” is implicated in the very make-up and possible\nconfigurations of qi, which is why the regular a\nposteriori patterns can emerge. Li\n“patterning” provides for the standing orders and\nprocesses, based on the steady interactions of yin-yang, five\nphases, etc., that give rise to the heaven-earth world order, with its\nfull complement of ten thousand things. The fundamental a\npriori patterns are necessary to the world order and provide the\nfecund context in which the a posteriori forms emerge\ncontinuously. Wang and Dai’s qi-based view could not\naccount for existence and the variegated yet systematic given world\norder in this sense. At the same time, Zhu did not think that\n“patterns” were absolutely determinative. They just set\ncertain “possibilities of order” that are realized when\nthe necessary qi conditions obtained. For the most part, he\nregistered the range of randomness and free flow in qi\nactivity that is best exemplified in the randomness of weather systems\nand seismic events.\n\nAs to textual grounds, Wang and Dai argued that Zhu was so enamored of\nhis metaphysics of pattern and qi that he constantly read\nthem into the classical texts. For example, Dai said Zhu blandly\nassociated Confucius’ term tian (heaven) with his own\nnotion of li (pattern), quoting Analects 11:9 where\nConfucius, in sorrow over the death of his disciple Yan Hui, cried\nthat “Heaven has forsaken me”. Da questioned how Zhu Xi could \nreasonably claim that Confucius was crying that li had\nforsaken him? Critics tend to find this counter-intuitive\nexample of Dai’s against Zhu’s approach to be compelling. However,\nconsulting Zhu’s original commentary, we find that he noted that\nthis phrase was not literally about heaven but rather expressed\nConfucius’ utmost sorrow, that Confucius felt Yan Hui’s\ndeath as if it was his own son’s, without mentioning\n“pattern”. This example does not support Wang and\nDai’s claim in the least. It illustrates that Zhu’s\ncommentary was nuanced and sensitive to pragmatic, situational usages\ndespite his penchant to see his own notion of “pattern” in\nsome of Confucius’ usages of “heaven”. Moreover, as\nthe intellectual historian Daniel Gardner shows, Zhu’s\ncommentary was not intended as simply a glossary with comments. It was\nintended as a guide to self-cultivation. Hence, Zhu sometimes recast\npassages in the Analects more generally to show their broader\nimplications for self-cultivation and realization, often with the\nisolated countryside student in mind. Gardner shows how Zhu had\neffectively enriched the text as a tool for self-cultivation whereas\nearlier commentaries of the Han and Tang dynasties had just given\nglosses necessary for answering examination questions.\n\nKnown in the seventeenth and eighteenth centuries in the West through\nthe work of Jesuits in China, Zhu Xi’s thought and texts were\nmade more widely available to western scholarship in the late\nnineteenth century. Notably, James Legge (1815–1897) based his\ntranslations of the Chinese Classics on Zhu Xi’s commentaries,\nwhich he quoted and discussed at length in his footnotes to the texts. Early in\nthe twentieth century, a Chinese student of John Dewey\n(1859–1951) at Cornell, Hu Shi (1891–1962), initially\nfollowed the empirical, textual Qing scholars in viewing Zhu as a\nscholastic metaphysician. But, after reading Zhu’s\nDialogues for himself in old age, Hu contended that Zhu’s method of\nobservation was not scholastic but essentially scientific in nature.\nJ.P. Bruce, who translated a book of Zhu’s collected writings in\nthe 1920s, viewed Zhu’s notion of li (pattern;\nprinciple) in light of Stoic natural law. From the 1930s, the eminent\nhistorian of Chinese philosophy, Feng Youlan, interpreted li\nalong the lines of platonic Forms making Zhu Xi appear to be an\nidealist and abstract thinker. In the 1950s, Carsun Chang naturalized\nthe notion of li by aligning it with the Aristotelian\n“nature” or “essence”, thereby locking\nZhu’s thought into a sort of rigid descriptive metaphysics.\n\nFrom the 1960s, Mou Zongsan interpreted and criticized Zhu’s\nontology and ethics on Kantian grounds, claiming Zhu had erected an\na priori framework but then illicitly sought to derive\nfurther a priori knowledge (of patterns) by a\nposteriori means (observation). In the 1970s, the intellectual\nhistorian, Qian Mu examined and explained Zhu Xi’s thought\ndirectly in traditional indigenous terms, without reading western\nconcepts and logical patterns into his system. Scholars wanting to\nread Zhu Xi on his own terms, largely unmediated by western thought,\nturn to the five volume Zhu Xi anthology edited by Qian Mu as a rich\nstarting point.\n\nIn 1956, Joseph Needham, a chemist, made a significant breakthrough by\ninterpreting Zhu’s system in terms of a process philosophy,\nWhitehead’s organic naturalism. Needham successfully recast much\nof Zhu’s language in naturalistic rather than metaphysical\nterms. The cultural, moral dimension of Needham’s account has\nbeen developed by Cheng-ying Cheng and John Berthrong while the\nscientific dimension has been examined by Yung Sik Kim. In the 1980s,\nA.C. Graham offered the most insightful and apt account of Zhu’s\nterminology and pattern of thought in, “What Was New in the\nCh’eng-Chu Theory of Human Nature?” and other writings.\nGraham showed decisively that the term li refers to an\nembedded contextual “pattern”, rather than to any sort of\nabstract form or principle. He reminded us that the term li\nnever figures in propositions or logical sequences, as would be\nnatural for “principle”. Rather, li are always\nconceived as structuring, balancing, modulating, guiding phenomena,\nprocesses, reflection and human discernment and response. For example,\none never finds moral syllogisms in Zhu Xi’s writings. Many of\nZhu’s discussions thus concern moral emotional intelligence:\nattunement, sensitivity, discernment, and response. Joseph Adler views\nli as indicative of an “ordering” tendency that\nmay be manifested as “pattern” or as\n“principle” in differing contexts. (We might say that\npeople devise principles in the light of observed patterns.) Adler\nalso examines the key roles played by the Book of Change and\nZhou Dunyi in the formation of Zhu’s thought, and joins Thomas\nWilson and Hoyt Tillman in showing the extent to which Zhu Xi\nre-visioned, revised, and recast the Confucian Way. Adler shows how\nZhu Xi made Zhou Dunyi a pivotal figure in the succession of the\nConfucian Way while Wilson is interested in Zhu’s account of the\nWay as a sort of educational-ideological revision, and Tillman is\ninterested in how Zhu’s account of the Way eventually outlasted\nother competing versions that might have offered more practical and\nliberal openings in late imperial China.\n\nAdvances continue to be made in Zhu Xi studies in the present century.\nOn the one hand, intellectual historians, such as Yingshi Yu, examine\nZhu Xi’s historical, political, and cultural backgrounds, as well as\nhis intellectual milieu. Other intellectual historians, such as Hoyt\nTilman and Hans van Ess study Zhu Xi’s intellectual collaborators and\nrivals.  Still others, such as Chun-chieh Huang and his colleagues\nexamine the differing receptions and adaptations of Zhu Xi’s thought by\nConfucian scholars around East Asia. On the other hand, philosophical\ninterpreter Brook Ziporyn has developed a “coherence” reading of\nli (pattern). Drawing on the parallel model of li\nand shi in Huayan Buddhism, he views Zhu Xi’s li as\nthe organizing, cohering element in qi phenomena, writ large and small.\nGiven the intimate connection between li and truth in Zhu\nXi’s thought, the coherence account of li recalls the\ncoherence theory of truth in 20th century Western philosophy. While\n“coherence” is an apt and suggestive account of the organizing and\ncohering function of li, it cannot serve as a direct\ntranslation of the term li. Ethicists, such as Stephen Angle, Yong\nHuang, and Justin Tiwald examine Confucian ethics in general and Zhu\nXi’s ethics in particular as species of virtue ethics, as conceived in\nrecent Anglo-American ethical thought. They have identified overlaps\nand similarities between these ethical approaches. Other scholars,\nsuch as Ming-huei Lee and the present author have identified Kantian\nelements in Zhu Xi’s efforts to justify Confucian ethics and\ncultivation. Finally, Shui Chuen Lee and others find support in Zhu\nXi’s system of thought for a viable Confucian approach to\nenvironmental ethics.\n\nIn summary, the depth and range of Zhu Xi’s thought were\nunparalleled in the Chinese intellectual tradition and around East\nAsia. Zhu Xi studies globally continue to be vital, wide-ranging, and\ncontentious, and continue to attract increasing interest around the world.\n",
    "section_title": "6. Major Interpreters of Zhu Xi",
    "entry_title": "Zhu Xi",
    "hierarchy_title": "Zhu Xi || Complementarity between li and qi, and among related terms",
    "tokenized_text": [
        "complementarity",
        "li",
        "qi",
        "among",
        "related",
        "term",
        "major",
        "interpreter",
        "zhu",
        "xi",
        "zhu",
        "xi",
        "active",
        "scholarintellectual",
        "held",
        "discussion",
        "dispute",
        "scholar",
        "correspondence",
        "person",
        "thought",
        "understood",
        "contrast",
        "thought",
        "intellectual",
        "rival",
        "well",
        "positive",
        "view",
        "example",
        "series",
        "letter",
        "zhang",
        "shi",
        "topic",
        "selfcultivation",
        "moral",
        "psychology",
        "preserved",
        "collected",
        "writing",
        "master",
        "zhu",
        "zhuzi",
        "wenji",
        "provides",
        "illuminating",
        "record",
        "two",
        "dedicated",
        "confucian",
        "quest",
        "wellgrounded",
        "efficacious",
        "approach",
        "selfcultivation",
        "debated",
        "lü",
        "zuqian",
        "nature",
        "education",
        "zhu",
        "focused",
        "confucian",
        "way",
        "moral",
        "practice",
        "education",
        "lu",
        "argued",
        "broaderbased",
        "humanity",
        "approach",
        "zhu",
        "held",
        "series",
        "debate",
        "lu",
        "jiuyuan",
        "xiangshan",
        "nature",
        "realization",
        "moral",
        "conduct",
        "whereas",
        "zhu",
        "advocated",
        "regimen",
        "study",
        "reflection",
        "observation",
        "practice",
        "lu",
        "spoke",
        "simply",
        "reflecting",
        "self",
        "clarifying",
        "mind",
        "considering",
        "mind",
        "clear",
        "one",
        "would",
        "know",
        "spontaneously",
        "situation",
        "zhu",
        "also",
        "corresponded",
        "utilitarian",
        "confucian",
        "scholar",
        "chen",
        "liang",
        "disputed",
        "zhu",
        "focus",
        "individual",
        "moral",
        "realization",
        "received",
        "way",
        "broader",
        "institutional",
        "approach",
        "sensitive",
        "empirical",
        "fact",
        "condition",
        "zhu",
        "generally",
        "eclipsed",
        "scholar",
        "day",
        "partly",
        "outlived",
        "many",
        "student",
        "mainly",
        "system",
        "compelling",
        "comprehensive",
        "yet",
        "nuanced",
        "tightly",
        "reasoned",
        "yet",
        "accommodating",
        "individual",
        "difference",
        "preserved",
        "essential",
        "confucian",
        "way",
        "yet",
        "ramified",
        "meet",
        "challenge",
        "buddhism",
        "daoism",
        "spiritual",
        "teaching",
        "zhu",
        "influence",
        "rose",
        "end",
        "southern",
        "song",
        "dynasty",
        "became",
        "decisive",
        "yuan",
        "dynasty",
        "edition",
        "four",
        "book",
        "adopted",
        "basis",
        "imperial",
        "examination",
        "system",
        "arranged",
        "scholar",
        "trained",
        "approach",
        "raising",
        "standing",
        "pedagogy",
        "focus",
        "four",
        "book",
        "came",
        "expense",
        "zhu",
        "deeper",
        "nuanced",
        "text",
        "dialogue",
        "opened",
        "door",
        "undue",
        "philosophic",
        "criticism",
        "schematic",
        "presentation",
        "zhu",
        "broad",
        "theory",
        "li",
        "pattern",
        "qi",
        "cosmic",
        "vapor",
        "lay",
        "background",
        "commentary",
        "four",
        "book",
        "easily",
        "opened",
        "charge",
        "dualism",
        "reading",
        "abstract",
        "category",
        "earth",
        "essentially",
        "practical",
        "ancient",
        "text",
        "commentary",
        "focused",
        "reading",
        "understanding",
        "meaning",
        "intent",
        "cultivation",
        "message",
        "four",
        "book",
        "critic",
        "generalized",
        "zhu",
        "method",
        "essentially",
        "scholastic",
        "would",
        "myopic",
        "stilted",
        "facing",
        "real",
        "situation",
        "anyone",
        "peru",
        "corpus",
        "zhu",
        "writing",
        "dialogue",
        "however",
        "find",
        "ontology",
        "crude",
        "dualism",
        "holism",
        "built",
        "complementary",
        "mutually",
        "implicative",
        "element",
        "never",
        "exist",
        "separation",
        "also",
        "reflection",
        "always",
        "informed",
        "knowledge",
        "history",
        "current",
        "event",
        "practical",
        "observation",
        "personal",
        "reflection",
        "method",
        "observation",
        "applies",
        "generally",
        "object",
        "self",
        "phenomenon",
        "respecting",
        "text",
        "took",
        "handbook",
        "ethical",
        "insight",
        "practice",
        "even",
        "zhu",
        "comment",
        "confucius",
        "mencius",
        "often",
        "refer",
        "back",
        "person",
        "speech",
        "context",
        "thus",
        "entirely",
        "scholastic",
        "method",
        "observation",
        "opened",
        "door",
        "breakthrough",
        "beyond",
        "verity",
        "classic",
        "though",
        "careful",
        "play",
        "fact",
        "intellectual",
        "colleague",
        "primarily",
        "sought",
        "truth",
        "text",
        "thinking",
        "empirical",
        "fact",
        "distraction",
        "essential",
        "naturalpatterning",
        "tianli",
        "reflected",
        "adequately",
        "canonical",
        "text",
        "whereas",
        "early",
        "generation",
        "zhu",
        "follower",
        "acquainted",
        "broad",
        "learning",
        "incisive",
        "style",
        "open",
        "spirit",
        "confucian",
        "ming",
        "qing",
        "dynasty",
        "knew",
        "mostly",
        "edition",
        "four",
        "book",
        "targeted",
        "criticism",
        "thought",
        "zhu",
        "eminent",
        "critic",
        "ming",
        "scholarofficial",
        "wang",
        "yangming",
        "rejected",
        "zhu",
        "approach",
        "observation",
        "objective",
        "openended",
        "outward",
        "diffuse",
        "neglectful",
        "concentration",
        "inwardness",
        "could",
        "said",
        "criticism",
        "wang",
        "reacting",
        "scholastic",
        "attitude",
        "fostered",
        "examination",
        "system",
        "zhu",
        "xi",
        "wang",
        "ultimately",
        "respected",
        "zhu",
        "went",
        "compile",
        "text",
        "argued",
        "later",
        "life",
        "zhu",
        "thought",
        "taken",
        "subjective",
        "practical",
        "turn",
        "anticipated",
        "wang",
        "approach",
        "scholar",
        "late",
        "ming",
        "early",
        "qing",
        "period",
        "midseventeenth",
        "early",
        "eighteenth",
        "century",
        "notably",
        "wang",
        "fuzhi",
        "dai",
        "zhen",
        "tai",
        "chen",
        "disputed",
        "zhu",
        "philosophical",
        "textual",
        "ground",
        "whereas",
        "zhu",
        "allegedly",
        "insisted",
        "priority",
        "pattern",
        "qi",
        "roughly",
        "form",
        "matter",
        "wang",
        "dai",
        "followed",
        "northern",
        "song",
        "thinker",
        "zhang",
        "zai",
        "affirming",
        "priority",
        "qi",
        "viewing",
        "pattern",
        "posteriori",
        "evolutionary",
        "realization",
        "qi",
        "interaction",
        "thought",
        "account",
        "dissolved",
        "threat",
        "hint",
        "dualism",
        "cosmology",
        "ontology",
        "human",
        "nature",
        "part",
        "zhu",
        "xi",
        "would",
        "responded",
        "fundamentally",
        "pattern",
        "implicated",
        "makeup",
        "possible",
        "configuration",
        "qi",
        "regular",
        "posteriori",
        "pattern",
        "emerge",
        "li",
        "patterning",
        "provides",
        "standing",
        "order",
        "process",
        "based",
        "steady",
        "interaction",
        "yinyang",
        "five",
        "phase",
        "etc",
        "give",
        "rise",
        "heavenearth",
        "world",
        "order",
        "full",
        "complement",
        "ten",
        "thousand",
        "thing",
        "fundamental",
        "priori",
        "pattern",
        "necessary",
        "world",
        "order",
        "provide",
        "fecund",
        "context",
        "posteriori",
        "form",
        "emerge",
        "continuously",
        "wang",
        "dai",
        "qibased",
        "view",
        "could",
        "account",
        "existence",
        "variegated",
        "yet",
        "systematic",
        "given",
        "world",
        "order",
        "sense",
        "time",
        "zhu",
        "think",
        "pattern",
        "absolutely",
        "determinative",
        "set",
        "certain",
        "possibility",
        "order",
        "realized",
        "necessary",
        "qi",
        "condition",
        "obtained",
        "part",
        "registered",
        "range",
        "randomness",
        "free",
        "flow",
        "qi",
        "activity",
        "best",
        "exemplified",
        "randomness",
        "weather",
        "system",
        "seismic",
        "event",
        "textual",
        "ground",
        "wang",
        "dai",
        "argued",
        "zhu",
        "enamored",
        "metaphysics",
        "pattern",
        "qi",
        "constantly",
        "read",
        "classical",
        "text",
        "example",
        "dai",
        "said",
        "zhu",
        "blandly",
        "associated",
        "confucius",
        "term",
        "tian",
        "heaven",
        "notion",
        "li",
        "pattern",
        "quoting",
        "analects",
        "confucius",
        "sorrow",
        "death",
        "disciple",
        "yan",
        "hui",
        "cried",
        "heaven",
        "forsaken",
        "da",
        "questioned",
        "zhu",
        "xi",
        "could",
        "reasonably",
        "claim",
        "confucius",
        "cry",
        "li",
        "forsaken",
        "critic",
        "tend",
        "find",
        "counterintuitive",
        "example",
        "dai",
        "zhu",
        "approach",
        "compelling",
        "however",
        "consulting",
        "zhu",
        "original",
        "commentary",
        "find",
        "noted",
        "phrase",
        "literally",
        "heaven",
        "rather",
        "expressed",
        "confucius",
        "utmost",
        "sorrow",
        "confucius",
        "felt",
        "yan",
        "hui",
        "death",
        "son",
        "without",
        "mentioning",
        "pattern",
        "example",
        "support",
        "wang",
        "dai",
        "claim",
        "least",
        "illustrates",
        "zhu",
        "commentary",
        "nuanced",
        "sensitive",
        "pragmatic",
        "situational",
        "usage",
        "despite",
        "penchant",
        "see",
        "notion",
        "pattern",
        "confucius",
        "usage",
        "heaven",
        "moreover",
        "intellectual",
        "historian",
        "daniel",
        "gardner",
        "show",
        "zhu",
        "commentary",
        "intended",
        "simply",
        "glossary",
        "comment",
        "intended",
        "guide",
        "selfcultivation",
        "hence",
        "zhu",
        "sometimes",
        "recast",
        "passage",
        "analects",
        "generally",
        "show",
        "broader",
        "implication",
        "selfcultivation",
        "realization",
        "often",
        "isolated",
        "countryside",
        "student",
        "mind",
        "gardner",
        "show",
        "zhu",
        "effectively",
        "enriched",
        "text",
        "tool",
        "selfcultivation",
        "whereas",
        "earlier",
        "commentary",
        "han",
        "tang",
        "dynasty",
        "given",
        "gloss",
        "necessary",
        "answering",
        "examination",
        "question",
        "known",
        "seventeenth",
        "eighteenth",
        "century",
        "west",
        "work",
        "jesuit",
        "china",
        "zhu",
        "xi",
        "thought",
        "text",
        "made",
        "widely",
        "available",
        "western",
        "scholarship",
        "late",
        "nineteenth",
        "century",
        "notably",
        "james",
        "legge",
        "based",
        "translation",
        "chinese",
        "classic",
        "zhu",
        "xi",
        "commentary",
        "quoted",
        "discussed",
        "length",
        "footnote",
        "text",
        "early",
        "twentieth",
        "century",
        "chinese",
        "student",
        "john",
        "dewey",
        "cornell",
        "hu",
        "shi",
        "initially",
        "followed",
        "empirical",
        "textual",
        "qing",
        "scholar",
        "viewing",
        "zhu",
        "scholastic",
        "metaphysician",
        "reading",
        "zhu",
        "dialogue",
        "old",
        "age",
        "hu",
        "contended",
        "zhu",
        "method",
        "observation",
        "scholastic",
        "essentially",
        "scientific",
        "nature",
        "jp",
        "bruce",
        "translated",
        "book",
        "zhu",
        "collected",
        "writing",
        "s",
        "viewed",
        "zhu",
        "notion",
        "li",
        "pattern",
        "principle",
        "light",
        "stoic",
        "natural",
        "law",
        "s",
        "eminent",
        "historian",
        "chinese",
        "philosophy",
        "feng",
        "youlan",
        "interpreted",
        "li",
        "along",
        "line",
        "platonic",
        "form",
        "making",
        "zhu",
        "xi",
        "appear",
        "idealist",
        "abstract",
        "thinker",
        "s",
        "carsun",
        "chang",
        "naturalized",
        "notion",
        "li",
        "aligning",
        "aristotelian",
        "nature",
        "essence",
        "thereby",
        "locking",
        "zhu",
        "thought",
        "sort",
        "rigid",
        "descriptive",
        "metaphysics",
        "s",
        "mou",
        "zongsan",
        "interpreted",
        "criticized",
        "zhu",
        "ontology",
        "ethic",
        "kantian",
        "ground",
        "claiming",
        "zhu",
        "erected",
        "priori",
        "framework",
        "illicitly",
        "sought",
        "derive",
        "priori",
        "knowledge",
        "pattern",
        "posteriori",
        "mean",
        "observation",
        "s",
        "intellectual",
        "historian",
        "qian",
        "mu",
        "examined",
        "explained",
        "zhu",
        "xi",
        "thought",
        "directly",
        "traditional",
        "indigenous",
        "term",
        "without",
        "reading",
        "western",
        "concept",
        "logical",
        "pattern",
        "system",
        "scholar",
        "wanting",
        "read",
        "zhu",
        "xi",
        "term",
        "largely",
        "unmediated",
        "western",
        "thought",
        "turn",
        "five",
        "volume",
        "zhu",
        "xi",
        "anthology",
        "edited",
        "qian",
        "mu",
        "rich",
        "starting",
        "point",
        "joseph",
        "needham",
        "chemist",
        "made",
        "significant",
        "breakthrough",
        "interpreting",
        "zhu",
        "system",
        "term",
        "process",
        "philosophy",
        "whitehead",
        "organic",
        "naturalism",
        "needham",
        "successfully",
        "recast",
        "much",
        "zhu",
        "language",
        "naturalistic",
        "rather",
        "metaphysical",
        "term",
        "cultural",
        "moral",
        "dimension",
        "needham",
        "account",
        "developed",
        "chengying",
        "cheng",
        "john",
        "berthrong",
        "scientific",
        "dimension",
        "examined",
        "yung",
        "sik",
        "kim",
        "s",
        "ac",
        "graham",
        "offered",
        "insightful",
        "apt",
        "account",
        "zhu",
        "terminology",
        "pattern",
        "thought",
        "new",
        "ch",
        "engchu",
        "theory",
        "human",
        "nature",
        "writing",
        "graham",
        "showed",
        "decisively",
        "term",
        "li",
        "refers",
        "embedded",
        "contextual",
        "pattern",
        "rather",
        "sort",
        "abstract",
        "form",
        "principle",
        "reminded",
        "u",
        "term",
        "li",
        "never",
        "figure",
        "proposition",
        "logical",
        "sequence",
        "would",
        "natural",
        "principle",
        "rather",
        "li",
        "always",
        "conceived",
        "structuring",
        "balancing",
        "modulating",
        "guiding",
        "phenomenon",
        "process",
        "reflection",
        "human",
        "discernment",
        "response",
        "example",
        "one",
        "never",
        "find",
        "moral",
        "syllogism",
        "zhu",
        "xi",
        "writing",
        "many",
        "zhu",
        "discussion",
        "thus",
        "concern",
        "moral",
        "emotional",
        "intelligence",
        "attunement",
        "sensitivity",
        "discernment",
        "response",
        "joseph",
        "adler",
        "view",
        "li",
        "indicative",
        "ordering",
        "tendency",
        "may",
        "manifested",
        "pattern",
        "principle",
        "differing",
        "context",
        "might",
        "say",
        "people",
        "devise",
        "principle",
        "light",
        "observed",
        "pattern",
        "adler",
        "also",
        "examines",
        "key",
        "role",
        "played",
        "book",
        "change",
        "zhou",
        "dunyi",
        "formation",
        "zhu",
        "thought",
        "join",
        "thomas",
        "wilson",
        "hoyt",
        "tillman",
        "showing",
        "extent",
        "zhu",
        "xi",
        "revisioned",
        "revised",
        "recast",
        "confucian",
        "way",
        "adler",
        "show",
        "zhu",
        "xi",
        "made",
        "zhou",
        "dunyi",
        "pivotal",
        "figure",
        "succession",
        "confucian",
        "way",
        "wilson",
        "interested",
        "zhu",
        "account",
        "way",
        "sort",
        "educationalideological",
        "revision",
        "tillman",
        "interested",
        "zhu",
        "account",
        "way",
        "eventually",
        "outlasted",
        "competing",
        "version",
        "might",
        "offered",
        "practical",
        "liberal",
        "opening",
        "late",
        "imperial",
        "china",
        "advance",
        "continue",
        "made",
        "zhu",
        "xi",
        "study",
        "present",
        "century",
        "one",
        "hand",
        "intellectual",
        "historian",
        "yingshi",
        "yu",
        "examine",
        "zhu",
        "xi",
        "historical",
        "political",
        "cultural",
        "background",
        "well",
        "intellectual",
        "milieu",
        "intellectual",
        "historian",
        "hoyt",
        "tilman",
        "han",
        "van",
        "es",
        "study",
        "zhu",
        "xi",
        "intellectual",
        "collaborator",
        "rival",
        "still",
        "others",
        "chunchieh",
        "huang",
        "colleague",
        "examine",
        "differing",
        "reception",
        "adaptation",
        "zhu",
        "xi",
        "thought",
        "confucian",
        "scholar",
        "around",
        "east",
        "asia",
        "hand",
        "philosophical",
        "interpreter",
        "brook",
        "ziporyn",
        "developed",
        "coherence",
        "reading",
        "li",
        "pattern",
        "drawing",
        "parallel",
        "model",
        "li",
        "shi",
        "huayan",
        "buddhism",
        "view",
        "zhu",
        "xi",
        "li",
        "organizing",
        "cohering",
        "element",
        "qi",
        "phenomenon",
        "writ",
        "large",
        "small",
        "given",
        "intimate",
        "connection",
        "li",
        "truth",
        "zhu",
        "xi",
        "thought",
        "coherence",
        "account",
        "li",
        "recall",
        "coherence",
        "theory",
        "truth",
        "th",
        "century",
        "western",
        "philosophy",
        "coherence",
        "apt",
        "suggestive",
        "account",
        "organizing",
        "cohering",
        "function",
        "li",
        "serve",
        "direct",
        "translation",
        "term",
        "li",
        "ethicist",
        "stephen",
        "angle",
        "yong",
        "huang",
        "justin",
        "tiwald",
        "examine",
        "confucian",
        "ethic",
        "general",
        "zhu",
        "xi",
        "ethic",
        "particular",
        "specie",
        "virtue",
        "ethic",
        "conceived",
        "recent",
        "angloamerican",
        "ethical",
        "thought",
        "identified",
        "overlap",
        "similarity",
        "ethical",
        "approach",
        "scholar",
        "minghuei",
        "lee",
        "present",
        "author",
        "identified",
        "kantian",
        "element",
        "zhu",
        "xi",
        "effort",
        "justify",
        "confucian",
        "ethic",
        "cultivation",
        "finally",
        "shui",
        "chuen",
        "lee",
        "others",
        "find",
        "support",
        "zhu",
        "xi",
        "system",
        "thought",
        "viable",
        "confucian",
        "approach",
        "environmental",
        "ethic",
        "summary",
        "depth",
        "range",
        "zhu",
        "xi",
        "thought",
        "unparalleled",
        "chinese",
        "intellectual",
        "tradition",
        "around",
        "east",
        "asia",
        "zhu",
        "xi",
        "study",
        "globally",
        "continue",
        "vital",
        "wideranging",
        "contentious",
        "continue",
        "attract",
        "increasing",
        "interest",
        "around",
        "world"
    ]
}