{
    "main_text": "Are zombies conceivable? || Arguments against the conceivability of zombies\n4.2 Arguments against the conceivability of zombies\n\nAlthough in the past it was quite widely accepted that zombies are\nconceivable, skepticism has grown. Before considering direct attacks\non the idea, let us briefly recall three views which once appeared to\nsupport the claim that we can know a priori that dualism is\nfalse — hence, on reasonable assumptions, that zombies are not\nconceivable. \n\nThe first is verificationism, according to which a (declarative)\nsentence is meaningful just in case its truth or falsity can be\nverified. This entails that unverifiable sentences are literally\nmeaningless, so that no metaphysical claim according to which\nunobservable nonphysical items exist can be true. However, since our\nability to think and talk about our experiences is itself a problem\nfor verificationism, to presuppose this view when attacking the zombie\nidea would beg the question. The second view appeals to\nWittgenstein’s private language argument. Although not crudely\nverificationistic, it depends on the assumption that in order for\nwords to be meaningful, their use must be open to public checking. But\nsince this checkability assumption, if sound, would prove that we\ncannot talk about qualia in the ways defenders of the zombie\npossibility think we can, it too seems question-begging in the present\ncontext. According to the third view, behaviorism, there is no more to\nhaving mental states than being disposed to behave in certain ways. As\na possible basis for attacking the zombie idea, behaviorism is in a\nsimilar situation to verificationism and the private language\nargument. Zombies would satisfy all behavioral conditions for full\nconsciousness, so that if we could know a priori that behaviorism was\ncorrect, zombie worlds would be inconceivable for that reason. It\nseems unlikely, though, that behaviorism can be shown to be correct.\n(Dennett 1991 defends a position with strong affinities to\nbehaviorism, though it might be better classified as a variety of\nfunctionalism). \n\nFunctionalism is a much more widely supported approach to the mental.\nAccording to it, mental states are not just a matter of behavior and\ndispositions, but of causal or other functional relations among\nsensory inputs, internal states, and behavioral outputs. (It is\nimportant to take account of internal functions not necessarily\nreflected in behavioral dispositions, otherwise functionalism falls to\nthe usual objections to behaviorism, such as the\n‘homunculus-head’ described in the last section (Kirk\n2005, 2013, 2017).) Now, since zombies would satisfy all the\nfunctional conditions for full consciousness, functionalism entails\nthat zombies are impossible — though it would obviously be\nquestion-begging to presuppose it when attacking the zombie idea.\nIncreasingly sophisticated versions of functionalism are being\ndeveloped, however, and any arguments for it are a fortiori arguments\nagainst the possibility of zombies. (For defenses of functionalism\nagainst zombies see Dennett 1991; 1995; 1999; Kirk 2017; Shoemaker\n1999; Tye 2006; 2008; for doubts about functionalism’s capacity\nto deal with zombies see for example Harnad 1995.)\n\nApart from broad-front functionalist theories of the mental, there are\nmore narrowly focused attacks on the conceivability of zombies, some\nof which are noted below. \n\nCan we really imagine zombies? Daniel Dennett thinks those\nwho accept the conceivability of zombies have failed to imagine them\nthoroughly enough: ‘they invariably underestimate the task of\nconception (or imagination), and end up imagining something that\nviolates their own definition’ (1995, p. 322. Marcus 2004 makes\na related point). Given his broadly functionalist model of\nconsciousness, he argues, we can see why the ‘putative contrast\nbetween zombies and conscious beings is illusory’ (325. See also\nhis 1991; 1999). Consciousness is ‘not a single wonderful\nseparable thing … but a huge complex of many different\ninformational capacities’ (1995, 324. Cottrell 1999 supports\nthis approach).\n\nThe ‘epistemic approach’. Stoljar (2006, 2020)\nemphasizes that the conceivability argument presupposes we have a\ncomplete knowledge of the relevant physical facts, when it is likely\nthat we don’t. If that is right, we cannot properly conceive of\nthe possibilities in question, in which case premiss (1) of the\nconceivability argument is false. A bonus of this view is that it\nleaves us free to suppose there is a reductive explanation of\nconsciousness — that the physical facts are such that there is\nconsciousness in all possible worlds where those facts obtain —\neven when we don’t know what those facts are.\n\nZombies’ utterances. Suppose I smell roasting coffee\nbeans and say, ‘Mm! I love that smell!’. Everyone would\nrightly assume I was talking about my experience. But now suppose my\nzombie twin produces the same utterance. He too seems to be talking\nabout an experience, but in fact he isn’t because he’s\njust a zombie. Is he mistaken? Is he lying? Could his utterance\nsomehow be interpreted as true, or is it totally without truth value?\nNigel Thomas (1996) argues that ‘any line that zombiphiles take\non these questions will get them into serious trouble’.\n\nKnowing about and referring to qualia. Recall that by\ndefinition a zombie world is just like our world as physicalists\nsuppose it to be, but without consciousness. Since this implies that\nconsciousness depends on something nonphysical, it follows that\nzombies (assuming they are possible in the first place) could be made\nconscious by the addition of something nonphysical, which might as\nwell be qualia. And given that a zombie world would be causally\nclosed, these qualia would have to be causally inert: perhaps still\ncaused by the correlated physical processes, perhaps just parallel to\nthem. It therefore seems that if a zombie world is conceivable, so is\nepiphenomenalism. (Of course this does not require epiphenomenalism to\nbe actually true as well as conceivable.) If that is correct,\nobjections to the conceivability of epiphenomenalism are also\nobjections to the conceivability of zombies, the most obvious of these\nbeing simply that experiences have effects on behavior. A less obvious\nobjection starts from the fact that we refer to and know\nabout our conscious experiences — which can hardly be\ndenied, since otherwise we could not be discussing these ideas in the\nfirst place. The objection appeals to the widely held view that\nwhatever we can know about or refer to must have effects on us, if\nonly indirectly (Kripke 1972/80). On that basis our counterparts in\nepiphenomenalistic worlds could not know about or refer to their\nqualia, with the consequence that (given the above reasoning) neither\nepiphenomenalistic worlds nor zombie worlds are conceivable.\n\nTo this attack Chalmers replies that the crucial consideration is that\nwe are ‘acquainted’ with our experiences. This\n‘intimate epistemic relation’ both ensures that we can\nrefer to experiences and also justifies our claims to know about them.\nSince, in contrast, our zombie twins have no experiences, what appear\nto be their judgments about experience are unjustified. Chalmers\nsuggests that even if qualia have no causal influence on our\njudgments, their mere presence in the appropriate physical context\nensures that our thoughts are about those qualia. He thinks it also\nconstitutes justification for our knowledge claims even if experiences\nare not explanatorily relevant to making the judgments in question\n(Chalmers 1996, 172—209; 1999, 493f; see also his 2003,\n2010).\n\nThe problem of epistemic contact. Just now it seemed that if\nzombies are conceivable, then epiphenomenalist and parallelist worlds\nare also conceivable. In that case the friends of zombies must explain\nhow the epiphenomenal qualia in such worlds could possibly be objects\nof acquaintance, or indeed make any sort of intimate contribution to\npeople’s lives; and here Kirk (2005; 2008) suggests the zombie\nidea faces a further difficulty. This emerges when we consider such\nthings as attending to, thinking about, comparing and —\nespecially — remembering our experiences. These activities bring\nus into ‘epistemic contact’ with them and involve\ncognitive processing, which in turn involves changes causing other\nchanges. Being causally inert, the epiphenomenal qualia themselves\ncould not do that processing; so if they actually constitute our\nexperiences (as epiphenomenalism and parallelism imply) then the\nnecessary processing must be purely physical. The trouble is that the\nzombie story appears to make it impossible for such processing to put\nus into epistemic contact with epiphenomenal qualia. This is because\nthe only resources it can appeal to for that purpose are the assumed\ncausation of qualia by neural processes and their isomorphism with\nthem: factors which cannot do the necessary cognitive work (Kirk 2005;\n2008). If that is right, the notions of epiphenomenal qualia and\nzombies lead to a contradiction. They imply a conception of\nconsciousness which requires people to be in epistemic contact with\ntheir qualia, while at the same time ruling out the possibility of\nsuch contact.\n\n‘Powerful qualities’. Another interesting\nobjection to the zombie idea is based on the (controversial) idea of\n‘powerful qualities’: the view that all properties are\nboth dispositional and qualitative, and indeed that a thing’s\ndispositions are identical with its qualities. Alexander Carruth\n(2016), for example, argues that the conceivability argument\npresupposes that while physical properties are dispositional,\nphenomenal ones are qualitative. On that basis a zombie duplicate of\nour world would instantiate our world’s dispositional properties\nbut not its phenomenal ones. The powerful qualities view rules that\nout a priori, making it not even conceivable. For if a\nthing’s dispositions are identical with its qualities, nothing\ncan instantiate certain dispositional properties without also\ninstantiating all qualities supposedly identical with them. Countering\nthis line of argument, Henry Taylor (2017) claims it depends on an\nimplausible account of the distinction between the physical and the\nphenomenal, arguing in particular that the physical cannot be confined\nto the dispositional. \n\nFor other attacks on the conceivability of zombies see Balog 1999;\nCottrell 1999; Harnad 1995; Kirk 2005, 2008, 2013; Marcus 2004;\nShoemaker 1999; Stoljar 2001; Tye 2006. \n",
    "section_title": "4.2 Arguments against the conceivability of zombies",
    "entry_title": "Zombies",
    "hierarchy_title": "Zombies || Are zombies conceivable? || Arguments against the conceivability of zombies",
    "tokenized_text": [
        "zombie",
        "conceivable",
        "argument",
        "conceivability",
        "zombie",
        "argument",
        "conceivability",
        "zombie",
        "although",
        "past",
        "quite",
        "widely",
        "accepted",
        "zombie",
        "conceivable",
        "skepticism",
        "grown",
        "considering",
        "direct",
        "attack",
        "idea",
        "let",
        "u",
        "briefly",
        "recall",
        "three",
        "view",
        "appeared",
        "support",
        "claim",
        "know",
        "priori",
        "dualism",
        "false",
        "hence",
        "reasonable",
        "assumption",
        "zombie",
        "conceivable",
        "first",
        "verificationism",
        "according",
        "declarative",
        "sentence",
        "meaningful",
        "case",
        "truth",
        "falsity",
        "verified",
        "entail",
        "unverifiable",
        "sentence",
        "literally",
        "meaningless",
        "metaphysical",
        "claim",
        "according",
        "unobservable",
        "nonphysical",
        "item",
        "exist",
        "true",
        "however",
        "since",
        "ability",
        "think",
        "talk",
        "experience",
        "problem",
        "verificationism",
        "presuppose",
        "view",
        "attacking",
        "zombie",
        "idea",
        "would",
        "beg",
        "question",
        "second",
        "view",
        "appeal",
        "wittgenstein",
        "private",
        "language",
        "argument",
        "although",
        "crudely",
        "verificationistic",
        "depends",
        "assumption",
        "order",
        "word",
        "meaningful",
        "use",
        "must",
        "open",
        "public",
        "checking",
        "since",
        "checkability",
        "assumption",
        "sound",
        "would",
        "prove",
        "talk",
        "qualia",
        "way",
        "defender",
        "zombie",
        "possibility",
        "think",
        "seems",
        "questionbegging",
        "present",
        "context",
        "according",
        "third",
        "view",
        "behaviorism",
        "mental",
        "state",
        "disposed",
        "behave",
        "certain",
        "way",
        "possible",
        "basis",
        "attacking",
        "zombie",
        "idea",
        "behaviorism",
        "similar",
        "situation",
        "verificationism",
        "private",
        "language",
        "argument",
        "zombie",
        "would",
        "satisfy",
        "behavioral",
        "condition",
        "full",
        "consciousness",
        "could",
        "know",
        "priori",
        "behaviorism",
        "correct",
        "zombie",
        "world",
        "would",
        "inconceivable",
        "reason",
        "seems",
        "unlikely",
        "though",
        "behaviorism",
        "shown",
        "correct",
        "dennett",
        "defends",
        "position",
        "strong",
        "affinity",
        "behaviorism",
        "though",
        "might",
        "better",
        "classified",
        "variety",
        "functionalism",
        "functionalism",
        "much",
        "widely",
        "supported",
        "approach",
        "mental",
        "according",
        "mental",
        "state",
        "matter",
        "behavior",
        "disposition",
        "causal",
        "functional",
        "relation",
        "among",
        "sensory",
        "input",
        "internal",
        "state",
        "behavioral",
        "output",
        "important",
        "take",
        "account",
        "internal",
        "function",
        "necessarily",
        "reflected",
        "behavioral",
        "disposition",
        "otherwise",
        "functionalism",
        "fall",
        "usual",
        "objection",
        "behaviorism",
        "homunculushead",
        "described",
        "last",
        "section",
        "kirk",
        "since",
        "zombie",
        "would",
        "satisfy",
        "functional",
        "condition",
        "full",
        "consciousness",
        "functionalism",
        "entail",
        "zombie",
        "impossible",
        "though",
        "would",
        "obviously",
        "questionbegging",
        "presuppose",
        "attacking",
        "zombie",
        "idea",
        "increasingly",
        "sophisticated",
        "version",
        "functionalism",
        "developed",
        "however",
        "argument",
        "fortiori",
        "argument",
        "possibility",
        "zombie",
        "defense",
        "functionalism",
        "zombie",
        "see",
        "dennett",
        "kirk",
        "shoemaker",
        "tye",
        "doubt",
        "functionalism",
        "capacity",
        "deal",
        "zombie",
        "see",
        "example",
        "harnad",
        "apart",
        "broadfront",
        "functionalist",
        "theory",
        "mental",
        "narrowly",
        "focused",
        "attack",
        "conceivability",
        "zombie",
        "noted",
        "really",
        "imagine",
        "zombie",
        "daniel",
        "dennett",
        "think",
        "accept",
        "conceivability",
        "zombie",
        "failed",
        "imagine",
        "thoroughly",
        "enough",
        "invariably",
        "underestimate",
        "task",
        "conception",
        "imagination",
        "end",
        "imagining",
        "something",
        "violates",
        "definition",
        "p",
        "marcus",
        "make",
        "related",
        "point",
        "given",
        "broadly",
        "functionalist",
        "model",
        "consciousness",
        "argues",
        "see",
        "putative",
        "contrast",
        "zombie",
        "conscious",
        "being",
        "illusory",
        "see",
        "also",
        "consciousness",
        "single",
        "wonderful",
        "separable",
        "thing",
        "huge",
        "complex",
        "many",
        "different",
        "informational",
        "capacity",
        "cottrell",
        "support",
        "approach",
        "epistemic",
        "approach",
        "stoljar",
        "emphasizes",
        "conceivability",
        "argument",
        "presupposes",
        "complete",
        "knowledge",
        "relevant",
        "physical",
        "fact",
        "likely",
        "right",
        "properly",
        "conceive",
        "possibility",
        "question",
        "case",
        "premiss",
        "conceivability",
        "argument",
        "false",
        "bonus",
        "view",
        "leaf",
        "u",
        "free",
        "suppose",
        "reductive",
        "explanation",
        "consciousness",
        "physical",
        "fact",
        "consciousness",
        "possible",
        "world",
        "fact",
        "obtain",
        "even",
        "know",
        "fact",
        "zombie",
        "utterance",
        "suppose",
        "smell",
        "roasting",
        "coffee",
        "bean",
        "say",
        "mm",
        "love",
        "smell",
        "everyone",
        "would",
        "rightly",
        "assume",
        "talking",
        "experience",
        "suppose",
        "zombie",
        "twin",
        "produce",
        "utterance",
        "seems",
        "talking",
        "experience",
        "fact",
        "zombie",
        "mistaken",
        "lying",
        "could",
        "utterance",
        "somehow",
        "interpreted",
        "true",
        "totally",
        "without",
        "truth",
        "value",
        "nigel",
        "thomas",
        "argues",
        "line",
        "zombiphiles",
        "take",
        "question",
        "get",
        "serious",
        "trouble",
        "knowing",
        "referring",
        "qualia",
        "recall",
        "definition",
        "zombie",
        "world",
        "like",
        "world",
        "physicalists",
        "suppose",
        "without",
        "consciousness",
        "since",
        "implies",
        "consciousness",
        "depends",
        "something",
        "nonphysical",
        "follows",
        "zombie",
        "assuming",
        "possible",
        "first",
        "place",
        "could",
        "made",
        "conscious",
        "addition",
        "something",
        "nonphysical",
        "might",
        "well",
        "qualia",
        "given",
        "zombie",
        "world",
        "would",
        "causally",
        "closed",
        "qualia",
        "would",
        "causally",
        "inert",
        "perhaps",
        "still",
        "caused",
        "correlated",
        "physical",
        "process",
        "perhaps",
        "parallel",
        "therefore",
        "seems",
        "zombie",
        "world",
        "conceivable",
        "epiphenomenalism",
        "course",
        "require",
        "epiphenomenalism",
        "actually",
        "true",
        "well",
        "conceivable",
        "correct",
        "objection",
        "conceivability",
        "epiphenomenalism",
        "also",
        "objection",
        "conceivability",
        "zombie",
        "obvious",
        "simply",
        "experience",
        "effect",
        "behavior",
        "le",
        "obvious",
        "objection",
        "start",
        "fact",
        "refer",
        "know",
        "conscious",
        "experience",
        "hardly",
        "denied",
        "since",
        "otherwise",
        "could",
        "discussing",
        "idea",
        "first",
        "place",
        "objection",
        "appeal",
        "widely",
        "held",
        "view",
        "whatever",
        "know",
        "refer",
        "must",
        "effect",
        "u",
        "indirectly",
        "kripke",
        "basis",
        "counterpart",
        "epiphenomenalistic",
        "world",
        "could",
        "know",
        "refer",
        "qualia",
        "consequence",
        "given",
        "reasoning",
        "neither",
        "epiphenomenalistic",
        "world",
        "zombie",
        "world",
        "conceivable",
        "attack",
        "chalmers",
        "reply",
        "crucial",
        "consideration",
        "acquainted",
        "experience",
        "intimate",
        "epistemic",
        "relation",
        "ensures",
        "refer",
        "experience",
        "also",
        "justifies",
        "claim",
        "know",
        "since",
        "contrast",
        "zombie",
        "twin",
        "experience",
        "appear",
        "judgment",
        "experience",
        "unjustified",
        "chalmers",
        "suggests",
        "even",
        "qualia",
        "causal",
        "influence",
        "judgment",
        "mere",
        "presence",
        "appropriate",
        "physical",
        "context",
        "ensures",
        "thought",
        "qualia",
        "think",
        "also",
        "constitutes",
        "justification",
        "knowledge",
        "claim",
        "even",
        "experience",
        "explanatorily",
        "relevant",
        "making",
        "judgment",
        "question",
        "chalmers",
        "f",
        "see",
        "also",
        "problem",
        "epistemic",
        "contact",
        "seemed",
        "zombie",
        "conceivable",
        "epiphenomenalist",
        "parallelist",
        "world",
        "also",
        "conceivable",
        "case",
        "friend",
        "zombie",
        "must",
        "explain",
        "epiphenomenal",
        "qualia",
        "world",
        "could",
        "possibly",
        "object",
        "acquaintance",
        "indeed",
        "make",
        "sort",
        "intimate",
        "contribution",
        "people",
        "life",
        "kirk",
        "suggests",
        "zombie",
        "idea",
        "face",
        "difficulty",
        "emerges",
        "consider",
        "thing",
        "attending",
        "thinking",
        "comparing",
        "especially",
        "remembering",
        "experience",
        "activity",
        "bring",
        "u",
        "epistemic",
        "contact",
        "involve",
        "cognitive",
        "processing",
        "turn",
        "involves",
        "change",
        "causing",
        "change",
        "causally",
        "inert",
        "epiphenomenal",
        "qualia",
        "could",
        "processing",
        "actually",
        "constitute",
        "experience",
        "epiphenomenalism",
        "parallelism",
        "imply",
        "necessary",
        "processing",
        "must",
        "purely",
        "physical",
        "trouble",
        "zombie",
        "story",
        "appears",
        "make",
        "impossible",
        "processing",
        "put",
        "u",
        "epistemic",
        "contact",
        "epiphenomenal",
        "qualia",
        "resource",
        "appeal",
        "purpose",
        "assumed",
        "causation",
        "qualia",
        "neural",
        "process",
        "isomorphism",
        "factor",
        "necessary",
        "cognitive",
        "work",
        "kirk",
        "right",
        "notion",
        "epiphenomenal",
        "qualia",
        "zombie",
        "lead",
        "contradiction",
        "imply",
        "conception",
        "consciousness",
        "requires",
        "people",
        "epistemic",
        "contact",
        "qualia",
        "time",
        "ruling",
        "possibility",
        "contact",
        "powerful",
        "quality",
        "another",
        "interesting",
        "objection",
        "zombie",
        "idea",
        "based",
        "controversial",
        "idea",
        "powerful",
        "quality",
        "view",
        "property",
        "dispositional",
        "qualitative",
        "indeed",
        "thing",
        "disposition",
        "identical",
        "quality",
        "alexander",
        "carruth",
        "example",
        "argues",
        "conceivability",
        "argument",
        "presupposes",
        "physical",
        "property",
        "dispositional",
        "phenomenal",
        "one",
        "qualitative",
        "basis",
        "zombie",
        "duplicate",
        "world",
        "would",
        "instantiate",
        "world",
        "dispositional",
        "property",
        "phenomenal",
        "one",
        "powerful",
        "quality",
        "view",
        "rule",
        "priori",
        "making",
        "even",
        "conceivable",
        "thing",
        "disposition",
        "identical",
        "quality",
        "nothing",
        "instantiate",
        "certain",
        "dispositional",
        "property",
        "without",
        "also",
        "instantiating",
        "quality",
        "supposedly",
        "identical",
        "countering",
        "line",
        "argument",
        "henry",
        "taylor",
        "claim",
        "depends",
        "implausible",
        "account",
        "distinction",
        "physical",
        "phenomenal",
        "arguing",
        "particular",
        "physical",
        "confined",
        "dispositional",
        "attack",
        "conceivability",
        "zombie",
        "see",
        "balog",
        "cottrell",
        "harnad",
        "kirk",
        "marcus",
        "shoemaker",
        "stoljar",
        "tye"
    ]
}