{
    "url": "action-perception",
    "title": "Action-based Theories of Perception",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Robert Briscoe\n<rbriscoe@gmail.com>\nRick Grush\n<rgrush@ucsd.edu>\nAlison Springle\n<alisonspringle@gmail.com>",
        "author_links": [
            {
                "mailto:rbriscoe%40gmail%2ecom": "rbriscoe@gmail.com"
            },
            {
                "http://rickgrush.net/": "Rick Grush"
            },
            {
                "mailto:rgrush%40ucsd%2eedu": "rgrush@ucsd.edu"
            },
            {
                "mailto:alisonspringle%40gmail%2ecom": "alisonspringle@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nRobert Briscoe\n&lt;<a href=\"mailto:rbriscoe%40gmail%2ecom\"><em>rbriscoe<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;<br/>\n<a href=\"http://rickgrush.net/\" target=\"other\">Rick Grush</a>\n&lt;<a href=\"mailto:rgrush%40ucsd%2eedu\"><em>rgrush<abbr title=\" at \">@</abbr>ucsd<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nAlison Springle\n&lt;<a href=\"mailto:alisonspringle%40gmail%2ecom\"><em>alisonspringle<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Jul 8, 2015",
        "substantive revision Tue Sep 19, 2023"
    ],
    "preamble": "\n\nAction is a means of acquiring perceptual information about the\nenvironment. Turning around, for example, alters your spatial\nrelations to surrounding objects and, hence, which of their properties\nyou visually perceive. Moving your hand over an object’s surface\nenables you to feel its shape, temperature, and texture. Sniffing and\nwalking around a room enables you to track down the source of an\nunpleasant smell. Active or passive movements of the body can also\ngenerate useful sources of perceptual information (Gibson 1966, 1979).\nThe pattern of optic flow in the retinal image produced by forward\nlocomotion, for example, contains information about the direction in\nwhich you are heading, while motion parallax is a “cue”\nused by the visual system to estimate the relative distances of\nobjects in your field of view. In these uncontroversial ways and\nothers, perception is instrumentally dependent on action. According to\nan explanatory framework that Susan Hurley (1998) dubs the\n“Input-Output Picture”, the dependence of perception on\naction is purely instrumental:\n\n\nMovement can alter sensory inputs and so result in different\nperceptions… changes in output are merely a means to changes in\ninput, on which perception depends directly. (1998: 342)\n\n\nThe different action-based theories of perception, reviewed in this\nentry, challenge the Input-Output Picture. They maintain that\nperception can also depend in a noninstrumental or\nconstitutive way on action (or, more generally, on capacities\nfor object-directed motor control). This position has taken many\ndifferent forms in the history of philosophy and psychology (for\noverviews, see Mandik 2005; Chemero 2011; Creem‐Regehr &\nKunz 2010; Nanay 2013; Drayson 2017; Springle & Machamer 2016;\nGrush & Springle 2019; and Ferretti 2021). Most action-based\ntheories of perception in the last 300 years, however, have looked to\naction in order to explain how vision, in particular, acquires either\nall or some of its spatial representational content.\nAccordingly, these are the theories on which we shall focus here.\n\nThis entry is historically structured. We begin in\n Section 1\n by discussing George Berkeley’s Towards a New Theory of\nVision (1709), the historical locus classicus of\naction-based theories of perception, and one of the most influential\ntexts on vision ever written. Berkeley argues that the basic or\n“proper” deliverance of vision is not an arrangement of\nvoluminous objects in three-dimensional space, but rather a\ntwo-dimensional manifold of light and color. We then turn to a\ndiscussion of Lotze, Helmholtz, and the local sign doctrine.\nThe “local signs” were felt cues for the mind to know what\nsort of spatial content to imbue visual experience with. For Lotze,\nthese cues were “inflowing” kinaesthetic feelings that\nresult from actually moving the eyes, while, for Helmholtz, they were\n“outflowing” motor commands sent to move the eyes.\n\nIn\n Section 2,\n we discuss sensorimotor contingency theories, which became prominent\nin the latter half of the 20th century. These views\nmaintain that an ability to predict the sensory consequences of\nself-initiated actions is necessary for perception. Among the\nmotivations for this family of theories is the problem of visual\ndirection constancy—why do objects appear to be stationary\neven though the locations on the retina to which they reflect light\nchange with every eye movement?—as well as experiments on\nadaptation to optical rearrangement devices (ORDs) and sensory\nsubstitution.\n\nSection 3\n examines two other important 20th century theories.\nAccording to what we shall call the motor component\ntheory, efference copies generated in the oculomotor system\nand/or proprioceptive feedback from eye-movements are used together\nwith incoming sensory inputs to determine the spatial attributes of\nperceived objects. Efferent readiness theories, by\ncontrast, look to the particular ways in which perceptual states\nprepare the observer to move and act in relation to the\nenvironment. The modest readiness theory, as we shall\ncall it, claims that the way an object’s spatial attributes are\nrepresented in visual experience can be modulated by one or another\nform of covert action planning. The bold readiness\ntheory argues for the stronger claim that perception just\nis covert readiness for action.\n\nIn\n Section 4,\n we move to the disposition theory, most\ninfluentially articulated by Gareth Evans (1982, 1985), but more\nrecently defended by Rick Grush (2000, 2007). Evans’ theory is,\nat its core, very similar to the bold efferent readiness theory. There\nare some notable differences, though. Evans’ account is more\nfinely articulated in some philosophical respects. It also does not\nposit a reduction of perception to behavioral dispositions, but rather\nposits that certain complicated relations between perceptual input and\nbehavioral provide spatial content. Grush proposes a very specific\ntheory that is like Evans’ in that it does not posit a\nreduction, but unlike Evans’ view, does not put behavioral\ndispositions and sensory input on an undifferentiated footing.\n",
    "toc": [
        {
            "#EarlActiBaseTheo": "1. Early Action-Based Theories"
        },
        {
            "#MoveToucNewTheoVisi": "1.1 Movement and Touch in the New Theory Of Vision"
        },
        {
            "#ObjeBerkTheo": "1.2 Objections to Berkeley’s Theory"
        },
        {
            "#LotzHelmLocaSignDoct": "1.3 Lotze, Helmholtz, and the Local Sign Doctrine"
        },
        {
            "#SensContTheo": "2. Sensorimotor Contingency Theories"
        },
        {
            "#EffeVisuDireCons": "2.1 Efference and Visual Direction Constancy"
        },
        {
            "#ObjeEffeCopyTheo": "2.1.1 Objections to the Efference Copy Theory"
        },
        {
            "#AlteEffeCopyTheo": "2.1.2 Alternatives to the Efference Copy Theory"
        },
        {
            "#ReafTheo": "2.2 The Reafference Theory"
        },
        {
            "#HeldExpePrisAdap": "2.2.1 Held’s Experiments On Prism Adaptation"
        },
        {
            "#ChalReafTheo": "2.2.2 Challenges to the Reafference Theory"
        },
        {
            "#EnacAppr": "2.3 The Enactive Approach"
        },
        {
            "#EvidForEnacAppr": "2.3.1 Evidence for the Enactive Approach"
        },
        {
            "#ChalEnacAppr": "2.3.2 Challenges to the Enactive Approach"
        },
        {
            "#MotoCompEffeReadTheo": "3. Motor Component and Efferent Readiness Theories"
        },
        {
            "#MotoCompTheoEmboVisuPerc": "3.1 The Motor Component Theory (Embodied Visual Perception)"
        },
        {
            "#EffeReadTheo": "3.2 The Efferent Readiness Theory"
        },
        {
            "#ModeReadTheo": "3.2.1 The Modest Readiness Theory"
        },
        {
            "#BoldReadTheo": "3.2.2 The Bold Readiness Theory"
        },
        {
            "#SkilTheo": "4. Skill/Disposition Theories"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Early Action-Based Theories\n\nTwo doctrines dominate philosophical and psychological discussions of\nthe relationship between action and space perception from the\n18th to the early 20th century. The\nfirst is that the immediate objects of sight are\ntwo-dimensional manifolds of light and color, lacking perceptible\nextension in depth. The second is that vision must be\n“educated” by the sense of touch—understood as\nincluding both kinaesthesis and proprioceptive position sense—if\nthe former is to acquire its apparent outward, three-dimensional\nspatial significance. The relevant learning process is associationist:\nnormal vision results when tangible ideas of distance (derived from\nexperiences of unimpeded movement) and solid shape (derived from\nexperiences of contact and differential resistance) are elicited by\nthe visible ideas of light and color with which they have been\nhabitually associated. The widespread acceptance of both doctrines\nowes much to the influence of George Berkeley’s New Theory\nof Vision (1709).\n\nThe Berkeleyan approach looks to action in order to explain how depth\nis “added” to a phenomenally two-dimensional visual field.\nThe spatial ordering of the visual field itself, however, is taken to\nbe immediately given in experience (Hatfield & Epstein 1979;\nFalkenstein 1994; but see Grush 2007). Starting in the 19th\ncentury, a number of theorists, including Johann Steinbuch\n(1770–1818), Hermann Lotze (1817–1881), Hermann von\nHelmholtz (1821–1894), Wilhelm Wundt (1832–1920), and\nErnst Mach (1838–1916), argued that all abilities for\nvisual spatial localization, including representation of up/down and\nleft/right direction within the two-dimensional visual field, depend\non motor factors, in particular, gaze-directing movements of the eye\n(Hatfield 1990: chaps. 4–5). This idea is the basis of the\n“local sign” doctrine, which we examine in\n Section 2.3.\n1.1 Movement and Touch in the New Theory Of Vision\n\nThere are three principal respects in which motor action is central to\nBerkeley’s project in the New Theory of Vision (1709).\nFirst, Berkeley argues that visual experiences convey information\nabout three-dimensional space only to the extent that they enable\nperceivers to anticipate the tactile consequences of actions directed\nat surrounding objects. In §45 of the New Theory,\nBerkeley writes:\n\n\n…I say, neither distance, nor things placed at a distance are\nthemselves, or their ideas, truly perceived by sight…. whoever\nwill look narrowly into his own thoughts, and examine what he means by\nsaying, he sees this or that thing at a distance, will agree with me,\nthat what he sees only suggests to his understanding, that after\nhaving passed a certain distance, to be measured by the motion of his\nbody, which is perceivable by touch, he shall come to perceive such\nand such tangible ideas which have been usually connected with such\nand such visible ideas.\n\n\nAnd later in the Treatise Concerning the Principles of Human\nKnowledge (1734: §44):\n\n\n…in strict truth the ideas of sight, when we apprehend by them\ndistance and things placed at a distance, do not suggest or mark out\nto us things actually existing at a distance, but only admonish us\nwhat ideas of touch will be imprinted in our minds at such and such\ndistances of time, and in consequence of such or such actions.\n…[V]isible ideas are the language whereby the governing spirit\n… informs us what tangible ideas he is about to imprint upon\nus, in case we excite this or that motion in our own bodies.\n\n\nThe view Berkeley defends in these passages has recognizable\nantecedents in Locke’s Essay Concerning Human\nUnderstanding (1690: Book II, Chap. 9, §§8–10).\nThere Locke maintained that the immediate objects of sight are\n“flat” or lack outward depth; that sight must be\ncoordinated with touch in order to mediate judgments concerning the\ndisposition of objects in three-dimensional space; and that visible\nideas “excite” in the mind movement-based ideas of\ndistance through an associative process akin to that whereby words\nsuggest their meanings: the process is “performed so constantly,\nand so quick, that we take that for the perception of our sensation,\nwhich is an idea formed by our judgment.”\n\nA long line of philosophers—including Condillac (1754), Reid\n(1785), Smith (1811), Mill (1842, 1843), Bain (1855, 1868), and Dewey\n(1891)—accepted this view of the relation between sight and\ntouch.\n\nThe second respect in which action plays a prominent role in the\nNew Theory is teleological. Sight not only derives its\nthree-dimensional spatial significance from bodily movement, its\npurpose is to help us engage in such movement adaptively:\n\n\n…the proper objects of vision constitute an universal language\nof the Author of nature, whereby we are instructed how to regulate our\nactions, in order to attain those things, that are necessary to the\npreservation and well-being of our bodies, as also to avoid whatever\nmay be hurtful and destructive of them. It is by their information\nthat we are principally guided in all the transactions and concerns of\nlife. (1709: §147)\n\n\nAlthough Berkeley does not explain how vision instructs us in\nregulating our actions, the answer is reasonably clear from the\npreceding account of depth perception: seeing an object or scene can\nelicit tangible ideas that directly motivate self-preserving action.\nThe tactual ideas associated with a rapidly looming ball in the visual\nfield, for example, can directly motivate the subject to shift\nposition defensively or to catch it before being struck. (For recent\nversions and critical assessments of the view that perception of the\nenvironment’s spatial layout is systematically sensitive to the\nsubject’s abilities and goals for action, see Proffitt 2006,\n2008; Bennett 2011; Firestone 2013; and Siegel 2014).\n\nThe third respect in which action is central to the New\nTheory is psychological. Tangible ideas of distance are elicited\nnot only by (1) visual or “pictorial” depth cues such as\nobject’s degree of blurriness (objects appear increasingly\n“confused” as they approach the observer), but also by\nkinaesthetic, muscular sensations resulting from (2) changes in the\nvergence angle of the eyes (1709: §16) and (3) accommodation of\nthe lens (1709: §27). Like many contemporary theories of spatial\nvision, the Berkeleyan account thus acknowledges an important role for\noculomotor factors in our perception of distance.\n1.2 Objections to Berkeley’s Theory\n\nCritics of Berkeley’s theory in the 18th and\n19th centuries (for reviews, see Bain 1868; Smith 2000;\nAtherton 2005) principally targeted three claims:\n\n(a)\nthat “distance, of it self and immediately, cannot be\nseen” (Berkeley 1709: §1);\n(b)\nthat sight depends on learned connections with experiences of\nmovement and touch for its outward, spatial significance; and\n(c)\nthat “habitual connexion”, i.e., association, would by\nitself enable touch to “educate” vision in the manner\nrequired by (b).\n\n\nMost philosophers and perceptual psychologists now concur with\nArmstrong’s (1960) assessment that the “single\npoint” argument for claim (a)—“distance being a line\ndirected end-wise to the eye, it projects only one point in the fund\nof the eye, which point remains invariably the same, whether the\ndistance be longer or shorter” (Berkeley 1709:\n§2)—conflates spatial properties of the retinal image with\nthose of the objects of sight (also see Condillac 1746/2001: 102;\nAbbott 1864: chap. 1). In contrast with claim (a), we should note,\nboth contemporary “ecological” and information-processing\napproaches in vision science assume that the spatial representational\ncontents of visual experience are robustly three-dimensional: vision\nis no less a distance sense than touch.\n\nThree sorts of objections targeted on claim (b) were prominent. First,\nit is not evident to introspection that visual experiences reliably\nelicit tactile and kinaesthetic images as Berkeley suggests. As Bain\nsuccinctly formulates this objection:\n\n\nIn perceiving distance, we are not conscious of tactual feelings or\nlocomotive reminiscences; what we see is a visible quality, and\nnothing more. (1868: 194)\n\n\nSecond, sight is often the refractory party when conflicts with touch\narise. Consider the experience of seeing a three-dimensional scene in\na painting: “I know, without any doubt”, writes\nCondillac,\n\n\nthat it is painted on a flat surface; I have touched it, and yet this\nknowledge, repeated experience, and all the judgments I can make do\nnot prevent me from seeing convex figures. Why does this appearance\npersist? (1746/2001: I, §6, 3)\n\n\nLast, vision in many animals does not need tutoring by touch before it\nis able to guide spatially directed movement and action. Cases in\nwhich non-human neonates respond adaptively to the distal sources of\nvisual stimulation\n\n\nimply that external objects are seen to be so…. They prove, at\nleast, the possibility that the opening of the eye may be at once\nfollowed by the perception of external objects as such, or, in other\nwords, by the perception or sensation of outness. (Bailey 1842: 30;\nfor replies, see Smith 1811: 385–390)\n\n\nHere it would be in principle possible for a proponent of\nBerkeley’s position to maintain that, at least for such animals,\nthe connection between visual ideas and ideas of touch is innate and\nnot learned (see Stewart 1829: 241–243; Mill 1842:\n106–110). While this would abandon Berkeley’s empiricism\nand associationism, it would maintain the claim that vision provides\ndepth information only because its ideas are connected to tangible\nideas.\n\nRegarding claim (c), many critics denied that the supposed\n“habitual connexion” between vision and touch actually\nobtains. Suppose that the novice perceiver sees a remote tree at\ntime1 and walks in its direction until she makes contact\nwith it at time2. The problem is that the perceiver’s\ninitial visual experience of the tree at time1 is not\ntemporally contiguous with the locomotion-based experience of the\ntree’s distance completed at time2. Indeed, at\ntime2 the former experience no longer exists. “The\nassociation required”, Abbott thus writes,\n\n\ncannot take place, for the simple reason that the ideas to be\nassociated cannot co-exist. We cannot at one and the same moment be\nlooking at an object five, ten, fifty yards off, and be achieving our\nlast step towards it. (1864: 24)\n\n\nFinally, findings from perceptual psychology have more recently been\nleveled against the view that vision is educated by touch. Numerous\nstudies of how subjects respond to lens-, mirror-, and prism-induced\ndistortions of visual experience (Gibson 1933; Harris 1965, 1980; Hay\net al. 1965; Rock & Harris 1967) indicate that not only\nis sight resistant to correction from touch, it will often dominate or\n“capture” the latter when intermodal conflicts arise. This\npoint will be discussed in greater depth in\n Section 3\n below.\n1.3 Lotze, Helmholtz, and the Local Sign Doctrine\n\nLike Berkeley, Hermann Lotze (1817–1881) and Hermann von\nHelmholtz (1821–1894) affirm the role played by active movement\nand touch in the genesis of three-dimensional visuospatial\nawareness:\n\n\n…there can be no possible sense in speaking of any other truth\nof our perceptions other than practical truth. Our\nperceptions of things cannot be anything other than symbols, naturally\ngiven signs for things, which we have learned to use in order to\ncontrol our motions and actions. When we have learned to read those\nsigns in the proper manner, we are in a condition to use them to\norient our actions such that they achieve their intended effect; that\nis to say, that new sensations arise in an expected manner\n(Helmholtz 2005 [1924]: 19, our emphasis).\n\n\nLotze and Helmholtz go further than Berkeley in maintaining that\nbodily movement also plays a role in the construction of the\ntwo-dimensional visual field, taken for granted by most previous\naccounts of vision (but for exceptions, see Hatfield 1990: ch. 4).\n\nThe problem of two-dimensional spatial localization, as Lotze and\nHelmholtz understand it, is the problem of assigning a unique,\neye-relative (or “oculocentric”) direction to every point\nin the visual field. Lotze’s commitment to mind-body dualism\nprecluded looking to any physical or anatomical spatial ordering in\nthe visual system for a solution to this problem (Lotze 1887 [1879]:\n§§276–77). Rather, Lotze maintains that every discrete\nvisual impression is attended by a “special extra\nsensation” whose phenomenal character varies as a function of\nits origin on the retina. Collectively, these extra sensations or\n“local signs” constitute a “system of graduated,\nqualitative tokens” (1887 [1879]: §283) that bridge the gap\nbetween the spatial structure of the nonconscious retinal image and\nthe spatial structure represented in conscious visual awareness.\n\nWhat sort of sensation, however, is suited to play the individuating\nrole attributed to a local sign? Lotze appeals to kinaesthetic\nsensations that accompany gaze-directing movements of the eyes (1887\n[1879]: §§284–86). If P is the location on\nthe retina stimulated by a distal point d and F is\nthe fovea, then PF is the arc that must be traversed in order\nto align the direction of gaze with d. As the eye moves\nthrough arc PF, its changing position gives rise to a\ncorresponding series of kinaesthetic sensations\np0, p1,\np2, …pn, and\nit is this consciously experienced series, unique to P, that\nconstitutes P’s local sign. By contrast, if Q\nwere rather the location on the retina stimulated by d, then\nthe eye’s foveating movement through arc QF would\nelicit a different series of kinaesthetic sensations\nk0, k1,\nk2, …kn unique\nto Q.\n\nImportantly, Lotze allows that retinal stimulation need not trigger an\novert movement of the eye. Rather, even in the absence of the\ncorresponding saccade, stimulating point P will elicit\nkinaesthetic sensation p0, and this sensation\nwill, in turn, recall from memory the rest of the series with which it\nis associated p1,\n…pn.\n\n\nAccordingly, though there is no movement of the eye, there arises the\nrecollection of something, greater or smaller, that must be\naccomplished if the stimuli at P and Q, which arouse\nonly a weak sensation, are to arouse sensations of the highest degree\nof strength and clearness. (1887 [1879]: §285)\n\n\nIn this way, Lotze accounts for our ability to perceive multiple\nlocations in the visual field at the same time.\n\nHelmholtz 2005 [1924] fully accepts the need for local signs in\ntwo-dimensional spatial localization, but makes an important\nmodification to Lotze’s theory. In particular, he maintains that\nlocal signs are not feelings that originate in the adjustment of the\nocular musculature, i.e., a form of afferent, sensory\n“inflow” from the eyes, but rather feelings of innervation\n(Innervationsgefühlen) produced by the effort of the\nwill (Willensanstrengung) to move the eyes, i.e., a form of\nefferent, motor “outflow”. In general, to each perceptible\nlocation in the visual field there is an associated readiness or\nimpulse of the will (Willensimpuls) to move eyes in the\nmanner required in order to fixate it. As Ernst Mach later formulates\nHelmholtz’s view: “The will to perform movements of the\neyes, or the innervation to the act, is itself the space\nsensation” (Mach 1897 [1886]: 59).\n\nHelmholtz favored a motor outflow version of the local sign doctrine\nfor two main reasons. First, he was skeptical that afferent\nregistrations of eye position are precise enough to play the role\nassigned to them by Lotze’s theory (2005 [1924]: 47–49).\nRecent research has shown that proprioceptive inflow from ocular\nmuscular stretch receptors does in fact play a quantifiable role in\nestimating direction of gaze, but efferent outflow is normally the\nmore heavily weighted source of information (Bridgeman 2010; see\n Section 2.1.1\n below).\n\nSecond, attempting a saccade when the eyes are paralyzed or otherwise\nimmobilized results in an apparent shift of the visual scene in the\nsame direction (Helmholtz 2005 [1924]: 205–06; Mach 1897 [1886]:\n59–60). This finding would make sense if efferent signals to the\neye are used to determine the direction of gaze: the visual system\n“infers” that perceived objects are moving because they\nwould have to be in order for retinal stimulation to remain constant\ndespite the change in eye direction predicted on the basis of motor\noutflow.\n\nAlthough Helmholtz was primarily concerned to show that “our\njudgments as to the direction of the visual axis are simply the result\nof the effort of will involved in trying to alter the adjustment of\nthe eyes” (2005 [1924]: 205–06), the evidence he adduces\nalso implies that efferent signals play a critical role in our\nperception of stability in the world across saccadic eye movements. In\nthe next section, we trace the influence of this idea on theories in\nthe 20th century.\n2. Sensorimotor Contingency Theories\n\nAction-based accounts of perception proliferate diversely in\n20th century. In this section, we focus on the reafference\ntheory of Richard Held and the more recent enactive approach of J.\nKevin O’Regan, Alva Noë, and others. Central to both\naccounts is the view that perception and perceptually guided action\ndepend on abilities to anticipate the sensory effects of bodily\nmovements. To be a perceiver it is necessary to have knowledge of what\nO’Regan and Noë call the laws of sensorimotor\ncontingency—“the structure of the rules governing the\nsensory changes produced by various motor actions”\n(O’Regan & Noë 2001: 941).\n\nWe start with two sources of motivation for theories that make\nknowledge of sensorimotor contingencies necessary and/or sufficient\nfor spatially contentful perceptual experience. The first is the idea\nthat the visual system exploits efference copy, i.e., a copy\nof the outflowing saccade command signal, in order to distinguish\nchanges in visual stimulation caused by movement of the eye from those\ncaused by object movement. The second is a long line of experiments,\nfirst performed by Stratton and Helmholtz in the 19th\ncentury, on how subjects adapt to lens-, mirror-, and prism-induced\nmodifications of visual experience. We follow up with objections to\nthese theories and alternatives.\n2.1 Efference and Visual Direction Constancy\n\nThe problem of visual direction constancy (VDC) is the problem of how\nwe perceive a stable world despite variations in visual stimulation\ncaused by saccadic eye movements. When we execute a saccade, the image\nof the world projected on the retina rapidly displaces in the\ndirection of rotation, yet the directions of perceived objects appear\nconstant. Such perceptual stability is crucial for ordinary visuomotor\ninteraction with surrounding the environment. As Bruce Bridgeman\nwrites,\n\n\nPerceiving a stable visual world establishes the platform on which all\nother visual function rests, making possible judgments about the\npositions and motions of the self and of other objects. (2010: 94)\n\n\nThe problem of VDC divides into two questions (MacKay 1973): First,\nwhich sources of information are used to determine whether\nthe observer-relative position of an object has changed between\nfixations? Second, how are relevant sources of information\nused by the visual system to achieve this function?\n\nThe historically most influential answer to the first question is that\nthe visual system has access to a copy of the efferent or\n“outflowing” saccade command signal. These signals carry\ninformation specifying the direction and magnitude of eye movements\nthat can be used to compensate for or “cancel out”\ncorresponding displacements of the retinal image.\n\nIn the 19th century, Bell (1823), Purkyně (1825), and\nHering (1861 [1990]), Helmholtz (2005 [1924]), and Mach (1897 [1886])\ndeployed the efference copy theory to illuminate a variety of\nexperimental findings, e.g., the tendency in subjects with partially\nparalyzed eye muscles to perceive movement of the visual scene when\nattempting to execute a saccade (for a review, see Bridgeman 2010.)\nThe theory’s most influential formulation, however, came from\nErich von Holst and Horst Mittelstädt in the early 1950s.\nAccording to what they dubbed the “reafference principle”\n(von Holst & Mittelstädt 1950; von Holst 1954), the visual\nsystem exploits a copy of motor directives to the eye in order to\ndistinguish between exafferent visual stimulation, caused by\nchanges in the world, and reafferent visual stimulation,\ncaused by changes in the direction of gaze:\n\n\nLet us imagine an active CNS sending out orders, or\n“commands” … to the effectors and receiving signals\nfrom its sensory organs. Signals that predictably come when nothing\noccurs in the environment are necessarily a result of its own\nactivity, i.e., are reafferences. All signals that come when\nno commands are given are exafferences and signify changes in\nthe environment or in the state of the organism caused by external\nforces. … The difference between that which is to be expected\nas the result of a command and the totality of what is reported by the\nsensory organs is the proportion of exafference…. It is only\nthis difference to which there are compensatory reflexes; only this\ndifference determines, for example during a moving glance at movable\nobjects, the actually perceived direction of visual objects. This,\nthen, is the solution that we propose, which we have termed the\n“reafference principle”: distinction of reafference and\nexafference by a comparison of the total afference with the\nsystem’s state—the “command”.\n(Mittelstädt 1971; translated by Bridgeman et al. 1994:\n251).\n\n\nIt is only when the displacement of the retinal image differs from the\ndisplacement predicted on the basis of the efference copy, i.e., when\nthe latter fails to “cancel out” the former, that subjects\nexperience a change of some sort in the perceived scene (see\n Figure 1).\n The relevant upshot is that VDC has an essential motoric component:\nthe apparent stability of an object’s eye-relative position in\nthe world depends on the perceiver’s ability to integrate\nincoming retinal signals with extraretinal information concerning the\nmagnitude and direction of impending eye movements.\n\n\n\nFigure 1: (a) When the eye is\nstationary, both efference copy (EC) and afference produced by\ndisplacement of the retinal image (A) are absent. (b) Turning the eye\n10° to the right results in a corresponding shift of the retinal\nimage. Since the magnitude of the eye movement specified by EC and the\nmagnitude of retinal image displacement cancel out, no movement in the\nworld or “exafference” (EA) is registered.\n\n2.1.1 Objections to the Efference Copy Theory\n\nThe foregoing solution to the problem of VDC faces challenges on\nmultiple, empirical fronts. First, there is evidence\nthat proprioceptive signals from the extraocular muscles make a\nnon-trivial contribution to estimates of eye position, although the\ngain of efference copy is approximately 2.4 times greater (Bridgeman\n& Stark 1991). Second, in the autokinetic\neffect, a fixed luminous dot appears to wander when the field of\nview is dark and thus completely unstructured. This finding is\ninconsistent with theories according to which retinotopic location and\nefference copy are the sole determinants of eye-relative direction.\nThird, the hypothesized compensation process, if\npsychologically real, would be highly inaccurate since subjects fail\nto notice displacements of the visual world up to 30% of total saccade\nmagnitude (Bridgeman et al. 1975), and the locations of\nflashed stimuli are systematically misperceived when presented near\nthe time of a saccade (Deubel 2004). Last, when image\ndisplacements concurrent with a saccade are large, but just below\nthreshold for detection, visually attended objects appear to\n“jump” or “jiggle” against a stable background\n(Brune and Lücking 1969; Bridgeman 1981). Efference copy\ntheories, however, as Bridgeman observes,\n\n\ndo not allow the possibility that parts of the image can move relative\nto one another—the visual world is conceived as a monolithic\nobject. The observation would seem to eliminate all efference copy and\nrelated theories in a single stroke. (2010: 102)\n\n2.1.2 Alternatives to the Efference Copy Theory\n\nThe reference object theory of Deubel and Bridgeman denies\nthat efference copy is used to “cancel out” displacements\nof the retinal image caused by saccadic eye-movements (Deubel et\nal. 2002; Deubel 2004; Bridgeman 2010). According to this theory,\nvisual attention shifts to the saccade target and a small number of\nother objects in its vicinity (perhaps four or fewer) before eye\nmovement is initiated. Although little visual scene information is\npreserved from one fixation to the next, the features of these objects\nas well as precise information about their presaccadic, eye-relative\nlocations is preserved. After the eye has landed, the visual system\nsearches for the target or one of its neighbors within a limited\nspatial region around the landing site. If the postsaccadic\nlocalization of this “landmark” object succeeds, the world\nappears to be stable. If this object is not found, however,\ndisplacement is perceived. On this approach, efference copy does not\ndirectly support VDC. Rather, the role of efference copy is to\nmaintain an estimate of the direction of gaze, which can be integrated\nwith incoming retinal stimulation to determine the static,\nobserver-relative locations of perceived objects. For a recent,\nphilosophically oriented discussion, see Wu 2014.\n\nA related alternative to the von Holst-Mittelstädt model is the\nspatial remapping theory of Duhamel and Colby (Duhamel et\nal. 1992; Colby et al. 1995). The role of saccade\nefference copy on this theory is to initiate an updating of the\neye-relative locations of a small number of attended or otherwise\nsalient objects. When post-saccadic object locations are sufficiently\ncongruent with the updated map, stability is perceived. Single-cell\nand fMRI studies show that neurons at various stages in the\nvisual-processing hierarchy exploit a copy of the saccade command\nsignal in order to shift their receptive field locations in the\ndirection of an impending eye movement microseconds before its\ninitiation (Merriam & Colby 2005; Merriam et al. 2007).\nEfference copy indicating an impending saccade 20° to the right,\nin effect, tells relevant neurons:\n\n\nIf you are now firing in response to an item x in your\nreceptive field, then stop firing at x. If there is currently\nan item y in the region of oculocentric visual space that\nwould be coincident with your receptive field after a saccade 20°\nto the right, then start firing at y.\n\n\nSuch putative updating responses are strongest in parietal cortex and\nat higher levels in visual processing (V3A and hV4) and weakest at\nlower levels (V1 and V2).\n2.2 The Reafference Theory\n\nIn 1961, Richard Held proposed that the reafference principle could be\nused to construct a general “neural model” of perception\nand perceptually guided action (for recent applications, see\nJékely et al. 2021). Held’s reafference theory goes\nbeyond the account of von Holst and Mittelstädt in three main\nways. First, information about movement parameters\nspecified by efference copy is not simply summated with reafferent\nstimulation. Rather, subjects are assumed to acquire knowledge of the\nspecific sensory consequences of different bodily movements.\nThis knowledge is contained in a hypothesized “correlational\nstorage” area and used to determine whether or not the\nreafferent stimulations that result from a given type of action match\nthose that resulted in the past (Held 1961: 30).\nSecond, the reafference theory is not limited to eye\nmovements, but extends to “any motor system that can be a source\nof reafferent visual stimulation”. Third,\nknowledge of the way reafferent stimulation depends on self-produced\nmovement is used for purposes of sensorimotor control: planning and\ncontrolling object-directed actions in the present depends on access\nto information concerning the visual consequences of performing such\nactions in the past.\n\nThe reafference theory was also significantly motivated by studies of\nhow subjects adapt to devices that alter the relationship between the\ndistal visual world and sensory input by rotating, reversing, or\nlaterally displacing the retinal image (for helpful guides to the\nliterature on this topic, see Rock 1966; Howard & Templeton 1966;\nEpstein 1967; and Welch 1978). We will refer to these as optical\nrearrangement devices (or ORDs for short). In what\nfollows, we review experimental work on ORDs starting with the\nAmerican psychologist George Stratton in the late 19th century.\n\nStratton conducted two dramatic experiments using a lens system that\neffected an 180º rotation of the retinal image in his right eye\n(his left eye was kept covered). The first experiment involved wearing\nthe device for 21.5 hours over the course of three days (1896); the\nsecond experiment involved wearing the device for 81.5 hours over the\ncourse of 8 days (1897a,b). In both cases, Stratton kept a detailed\ndiary of how his visual, imaginative, and proprioceptive experiences\nunderwent modification as a consequence of inverted vision. In 1899,\nhe performed a lesser-known but equally dramatic three-day experiment,\nusing a pair of mirrors that presented his eyes with a view of his own\nbody from a position in space directly above his head\n (Figure 2).\n\n\n\nFigure 2: The apparatus designed by\nStratton (1899). Stratton saw a view of his own body from the\nperspective of mirror AB, worn above his head.\n\n\nIn both experiments, Stratton reported a brief period of initial\nvisual confusion and breakdown in visuomotor skill:\n\n\nAlmost all movements performed under the direct guidance of sight were\nlaborious and embarrassed. Inappropriate movements were constantly\nmade; for instance, in order to move my hand from a place in the\nvisual field to some other place which I had selected, the muscular\ncontraction which would have accomplished this if the normal visual\narrangement had existed, now carried my hand to an entirely different\nplace. (1897a: 344)\n\n\nFurther bewilderment was caused by a “swinging” of the\nvisual field with head movements as well as jarring discord between\nwhere things were respectively seen and imagined to be:\n\n\nObjects lying at the moment outside the visual field (things at the\nside of the observer, for example) were at first mentally represented\nas they would have appeared in normal vision…. The actual\npresent perception remained in this way entirely isolated and out of\nharmony with the larger whole made up by [imaginative] representation.\n(1896: 615)\n\n\nAfter a seemingly short period of adjustment, Stratton reported a\ngradual re-establishment of harmony between the deliverances of sight\nand touch. By the end of his experiments on inverted vision, it was\nnot only possible for Stratton to perform many visuomotor actions\nfluently and without error, the visual world often appeared to him to\nbe “right side up” (1897a: 358) and “in normal\nposition” (1896: 616). Just what this might mean will\nbe discussed below in\n Section 2.2.\n\nAnother influential, if less dramatic, experiment was performed by\nHelmholtz (2005 [1924]: §29), who practiced reaching to targets\nwhile wearing prisms that displaced the retinal image 16–18°\nto the left. The initial tendency was to reach too far in the\ndirection of lateral displacement. After a number of trials, however,\nreaching gradually regained its former level of accuracy. Helmholtz\nmade two additional discoveries. First, there was an intermanual\ntransfer effect: visuomotor adaptation to prisms extended to his\nnon-exposed hand. Second, immediately after removing the prisms from\nhis eyes, errors were made in the opposite direction, i.e., when\nreaching for a target, Helmholtz now moved his hand too far to the\nright. This negative after-effect is now standardly used as a\nmeasure of adaptation to lateral displacement.\n\nStratton and Helmholtz’s findings catalyzed a research tradition\non ORD adaptation that experienced its heyday in the 1960s and 1970s.\nTwo questions dominated studies conducted during this period. First,\nwhat are the necessary and sufficient conditions for adaptation to\noccur? In particular, which sources of information do\nsubjects use when adapting to the various perceptual and sensorimotor\ndiscrepancies caused by ORDs? Second, just what happens when\nsubjects adapt to perceptual rearrangement? What is the “end\nproduct” of the relevant form of perceptual learning?\n2.2.1 Held’s Experiments On Prism Adaptation\n\nHeld’s answer to the first question is that subjects must\nreceive visual feedback from active movement, i.e., reafferent\nvisual stimulation, in order for significant and stable\nadaptation to occur (Held & Hein 1958; Held 1961; Held &\nBossom 1961). Evidence for this conclusion came from experiments in\nwhich participants wore laterally displacing prisms during both active\nand passive movement conditions. In the active movement condition, the\nsubject moved her visible hand back and forth along a fixed arc in\nsynchrony with a metronome. In the passive movement condition, the\nsubject’s hand was passively moved at the same rate by the\nexperimenters. Although the overall pattern of visual stimulation was\nidentical in both conditions, adaptation was reported only when\nsubjects engaged in self-movement. Reafferent stimulation, Held and\nBossom concluded on the basis of this and other studies,\n\n\nis the source of ordered contact with the environment which is\nresponsible for both the stability, under typical conditions, and the\nadaptability, to certain atypical conditions, of visual-spatial\nperformance. (1961: 37)\n\n\nHeld’s answer to the second question is couched in terms of the\nreafference theory: subjects adapt to ORDs only when they have\nrelearned the sensory consequences of their bodily movements. In the\ncase of adaptation to lateral displacement, they must relearn the way\nretinal stimulations vary as a function of reaching for targets at\ndifferent body-relative locations. This relearning is assumed to\ninvolve an updating of the mappings from motor output to reafferent\nsensory feedback in the hypothesized “correlational\nstorage” module mentioned above.\n2.2.2 Challenges to the Reafference Theory\n\nThe reafference theory faces a number of objections.\nFirst, the theory is an extension of von Holst and\nMittelstädt’s reafference principle, according to which\nefference copy is used to cancel out shifts of the retinal image\ncaused by saccadic eye movements. The latter was specifically intended\nto explain why we do not experience object displacement in the world\nwhenever we change the direction of gaze. There is nothing, at first\nblush, however, that is analogous to the putative need for\n“cancellation” or “discounting” of the retinal\nimage in the case of prism adaptation. As Welch puts it, “There\nis no visual position constancy here, so why should a model originally\ndevised to explain this constancy be appropriate?” (1978:\n16).\n\nSecond, the reafference theory fails to explain just\nhow stored efference-reafference correlations are supposed to explain\nvisuomotor control. How does having the ability to anticipate the\nretinal stimulations that would caused by a certain type of hand\nmovement enable one actually to perform the movement in question?\nWithout elaboration, all that Held’s theory seems to explain is\nwhy subjects are surprised when reafferences generated by their\nmovements are non-standard (Rock 1966: 117).\n\nThird, adaptation to ORDs, contrary to the theory, is\nnot restricted to situations in which subjects receive reafferent\nvisual feedback, but may also take place when subjects receive\nfeedback generated by passive effector or whole-body movement (Singer\n& Day 1966; Templeton et al. 1966; Fishkin 1969).\nAdaptation is even possible in the complete absence of motor action\n(Howard et al. 1965; Kravitz & Wallach 1966).\n\nIn general, the extent to which adaptation occurs depends not on the\navailability of reafferent stimulation, but rather on the presence of\neither of two related kinds of information concerning “the\npresence and nature of the optical rearrangement” (Welch 1978:\n24). Following Welch, we shall refer to this view as the\n“information hypothesis”.\n\nOne source of information present in a displaced visual array concerns\nthe veridical directions of objects from the observer (Rock 1966:\nchaps. 2–4). Normally, when engaging in forward locomotion, the\nperceived radial direction of an object straight ahead of the\nobserver’s body remains constant while the perceived radial\ndirections of objects to either side undergo constant change. This\npattern also obtains when the observer wears prisms that displace the\nretinal image to side. Hence, “an object seen through prisms\nwhich retains the same radial direction as we approach must be seen to\nbe moving in toward the sagittal plane” (Rock 1966: 105). On\nRock’s view, at least some forms of adaptation to ORDs can be\nexplained by our ability to detect and exploit such invariant sources\nof spatial informational in locomotion-generated patterns of optic\nflow.\n\nAnother related source of information for adaptation derives from the\nconflict between seen and proprioceptively experienced limb\nposition (Wallach 1968; Ularik & Canon 1971). When this\ndiscrepancy is made conspicuous, proponents of the information\nhypothesis have found that passively moved (Melamed et al.\n1973), involuntarily moved (Mather & Lackner 1975), and even\nimmobile subjects (Kravitz & Wallach 1966) exhibit significant\nadaption. Although self-produced bodily movement is not necessary for\nadaptation to occur, it provides subjects with especially salient\ninformation about the discrepancy between sight and touch (Moulden\n1971): subjects are able proprioceptively to determine the location of\na moving limb much more accurately than a stationary or passively\nmoved limb. It is the enhancement of the visual-proprioceptive\nconflict rather than reafferent visual stimulation, on this\ninterpretation, that explains why active movement yields more\nadaptation than passive movement in Held’s experiments.\n\nA final objection to the reafference theory concerns\nthe end product of adaptation to ORDs. According to the\ntheory, adaptation occurs when subjects learn new rules of\nsensorimotor dependence that govern how actions affect sensory inputs.\nThere is a significant body of evidence, however, that much, if not\nall, adaptation rather occurs at the proprioceptive level. Stratton,\nsummarizing the results of his experiment on mirror-based optical\nrearrangement, wrote:\n\n\n…the principle stated in an earlier paper—that in the\nend we would feel a thing to be wherever we constantly saw\nit—can be justified in a wider sense than I then intended\nit to be taken…. We may now, I think, safely include\ndifferences of distance as well, and assert that the spatial\ncoincidence of touch and sight does not require that an object in a\ngiven tactual position should appear visually in any particular\ndirection or at any particular distance. In whatever place the tactual\nimpression’s visual counterpart regularly appeared, this would\neventually seem the only appropriate place for it to appear in. If we\nwere always to see our bodies a hundred yards away, we would probably\nalso feel them there. (1899: 498, our emphasis)\n\n\nOn this interpretation, the plasticity revealed by ORDs is primarily\nproprioceptive and kinaesthetic, rather than visual. Stratton’s\nworld came to look “right side up” (1897b: 469) after\nadaptation to the inverted retinal image because things were\nfelt where they were visually perceived to be—not\nbecause, his “entire visual field flipped over” (Kuhn 2012\n[1962]: 112). This is clear from the absence of a visual negative\naftereffect when Stratton finally removed his inverting lenses at\nthe end of his eight-day experiment:\n\n\nThe visual arrangement was immediately recognized as the old one of\npre-experimental days; yet the reversal of everything from the order\nto which I had grown accustomed during the past week, gave the scene a\nsurprising, bewildering air which lasted for several hours. It was\nhardly the feeling, though, that things were upside down. (1897b:\n470)\n\n\nMoreover, Stratton reported changes in kinaesthesis during\nthe course of the experiment consistent with the alleged\nproprioceptive shift:\n\n\nwhen one was most at home in the unusual experience the head\nseemed to be moving in the very opposite direction from that which the\nmotor sensations themselves would suggest. (1907: 156)\n\n\nOn this view, the end product of adaptation to an ORD is a\nrecalibration of proprioceptive position sense at one or more points\nof articulation in the body (see the entry on\n bodily awareness).\n As you practice reaching for a target while wearing laterally\ndisplacing prisms, for example, the muscle spindles, joint receptors,\nand Golgi tendon organs in your shoulder and arm continue to generate\nthe same patterns of action potentials as before, but the\nproprioceptive and kinaesthetic meaning assigned to them by\ntheir “consumers” in the brain undergoes change: whereas\nbefore they signified that your arm was moving along one path through\nthe seven-dimensional space of possible arm configurations (the human\narm has seven degrees of freedom: three at the wrist, one at the\nelbow, and three at the shoulder), they gradually come to signify that\nit is moving along a different path in that kinematic space, namely,\nthe one consistent with the prismatically distorted visual feedback\nyou are receiving. Similar recalibrations are possible with respect to\nsources of information for head and eye position. After adapting to\nlaterally displacing prisms, signals from receptors in your neck that\npreviously signified the alignment of your head and torso, for\nexample, may come to signify that your head is turned slightly to the\nside. For discussion, see Harris 1965, 1980; Welch 1978: chap. 3; and\nBriscoe 2016.\n2.3 The Enactive Approach\n\nThe enactive approach defended by J. Kevin O’Regan and Alva\nNoë (O’Regan & Noë 2001; Noë 2004, 2005,\n2010; O’Regan 2011) is best viewed as an extension of the\nreafference theory. According to the enactive approach, spatially\ncontentful, world-presenting perceptual experience depends on implicit\nknowledge of the way sensory stimulations vary as a function of bodily\nmovement. “Over the course of life”, O’Regan and\nNoë write,\n\n\na person will have encountered myriad visual attributes and visual\nstimuli, and each of these will have particular sets of sensorimotor\ncontingencies associated with it. Each such set will have been\nrecorded and will be latent, potentially available for recall: the\nbrain thus has mastery of all these sensorimotor sets. (2001: 945)\n\n\nTo see an object o as having the location and shape\nproperties it has it is necessary (1) to receive sensory stimulations\nfrom o and (2) to use those stimulations in order to retrieve\nthe set of sensorimotor contingencies associated with o on\nthe basis of past encounters. In this sense, seeing is a\n“two-step” process (Noë 2004: 164). It is important\nto emphasize, however, that the enactive approach distances itself\nfrom the idea that vision is functionally dedicated, in whole or in\npart, to the guidance of spatially directed actions:\n“Our claim”, Noë writes,\n\n\nis that seeing depends on an appreciation of the sensory effects of\nmovement (not, as it were, on the practical significance of\nsensation)…. Actionism is not committed to the general claim\nthat seeing is a matter of knowing how to act in respect of or in\nrelation to the things we see. (Noë 2010: 249)\n\n\nThe enactive approach also has strong affinities with the\nsense-data tradition. According to Noë, an\nobject’s visually apparent shape is the shape of the 2D patch\nthat would occlude the object on a plane perpendicular to the line of\nsight, i.e., the shape of the patch projected by the object on the\nfrontal plane in accordance with the laws of linear perspective.\nNoë calls this the object’s “perspectival\nshape” (P-shape) (for other accounts of the perspectival nature\nof perception, see Hill 2022, chap. 3; Green & Schellenberg 2018;\nLande 2018; and Green 2022). An object’s visually apparent size,\nin turn, is the size of the patch projected by the object on the\nfrontal plane. Noë calls this the object’s\n“perspectival size” (P-size). Appearances are\n“perceptually basic” (Noë 2004: 81) because in order\nto see an object’s actual spatial properties it is necessary\nboth to see its 2D P-properties and to understand how they would vary\n(undergo transformation) with changes in one’s point of view.\nThis conception of what it is to perceive objects as voluminous\nspace-occupiers is closely to akin to views defended by Russell\n(1918), Broad (1923), and Price (1950). It also worth mentioning that\nthe enactive approach has strong affinities to views in the\nphenomenological tradition that are beyond the scope of this entry\n(but for discussion, see Thompson 2005; Hickerson 2007; and the entry\non\n phenomenology).\n2.3.1 Evidence for the Enactive Approach\n\nThe enactive approach rests its case on three main sources of\nempirical support. The first derives from experiments\nwith optical rearrangement devices (ORDs), discussed in\n Section 2.2\n above. Hurley and Noë (2003) maintain that adaptation to ORDs\nonly occurs when subjects relearn the systematic patterns of\ninterdependence between active movement and reafferent visual\nstimulation. Moreover, contrary to the proprioceptive change theory of\nStratton, Harris, and Rock, Hurley and Noë argue that the end\nproduct of adaptation to inversion and reversal of the retinal image\nis genuinely visual in nature: during the final stage of adaptation,\nvisual experience “rights itself”.\n\nIn\n Section 2.2\n above, we reviewed empirical evidence against the view that active\nmovement and corresponding reafferent stimulation are necessary for\nadaptation to ORDs. Accordingly, we will focus here on Hurley and\nNoë’s objections to the proprioceptive-change theory.\nAccording to the latter, “what is actually modified [by the\nadaptation process] is the interpretation of nonvisual information\nabout positions of body parts” (Harris 1980: 113). Once\nintermodal harmony is restored, the subject will again be able to\nperform visuomotor actions without error or difficulty, and she will\nagain feel at home in the visually perceived world.\n\nHurley and Noë do not contest the numerous sources of empirical\nand introspective evidence that Stratton, Harris, and Rock adduce for\nthe proprioceptive-change theory. Rather they reject the theory on the\nbasis of what they take to be an untoward epistemic implication\nconcerning adaptation to left-right reversal:\n\n\nwhile rightward things really look and feel leftward to you,\nthey come to seem to look and feel rightward. So the true\nqualities of your experience are no longer self-evident to you. (2003:\n155)\n\n\nThe proprioceptive-change theory, however, does not imply such radical\nintrospective error. According to proponents of the theory, experience\nnormalizes after adaptation to reversal not because things that really\nlook leftward “seem to look rightward” (what this might\nmean is enigmatic at best), but rather because the subjects eventually\nbecome familiar with the way things look when reversed—much as\nordinary subjects can learn to read mirror-reversed writing fluently\n(Harris 1965: 435–36). Things seem “normal” after\nadaptation, in other words, because subjects are again able to cope\nwith the visually perceived world in a fluent and unreflective\nmanner.\n\nA second line of evidence for the enactive approach\ncomes from well-known experiments on tactile-visual sensory\nsubstitution (TVSS) devices that transform outputs from a\nlow-resolution video camera into a matrix of vibrotactile stimulation\non the skin of one’s back (Bach-y-Rita 1972, 2004) or\nelectrotactile stimulation on the surface of one’s tongue\n(Sampaio et al. 2001).\n\nAt first, blind subjects equipped with a TVSS device experience its\noutputs as purely tactile. After a short time, however, many subjects\ncease to notice the tactile stimulations themselves and instead report\nhaving quasi-visual experiences of the objects arrayed in space in\nfront of them. Indeed, with a significant amount of supervised\ntraining, blind subjects can learn to discriminate spatial properties\nsuch as shape, size, and location and even to perform simple\n“eye”-hand coordination tasks such as catching or batting\na ball. A main finding of relevance in early experiments was that\nsubjects learn to “see” by means of TVSS only when they\nhave active control over movement of the video camera. Subjects who\nreceive visual input passively—and therefore lack any knowledge\nof how (or whether) the camera is moving—experience only\nmeaningless, tactile stimulation.\n\nHurley and Noë argue that passively stimulated subjects do not\nlearn to “see” by means of sensory substitution because\nthey are unable to learn the laws of sensorimotor contingency that\ngovern the prosthetic modality:\n\n\nactive movement is required in order for the subject to acquire\npractical knowledge of the change from sensorimotor contingencies\ncharacteristic of touch to those characteristic of vision and the\nability to exploit this change skillfully. (Hurley & Noë\n2003: 145)\n\n\nAn alternative explanation, however, is that subjects who do not\ncontrol camera movement—and who are not otherwise attuned to how\nthe camera is moving—are simply unable to extract any\ninformation about the structure of the distal scene from the\nincoming pattern of sensory stimulations. In consequence they do not\nengage in “distal attribution” (Epstein et al.\n1986; Loomis 1992; Siegel & Warren 2010): they do not perceive\nthrough the changing pattern of proximal stimulation to a\nspatially external scene in the environment. For development of this\nalternative explanation in the context of Bayesian perceptual\npsychology, see Briscoe 2019.\n\nA final source of evidence for the enactive approach\ncomes from studies of visuomotor development in the absence of normal,\nreafferent visual stimulation. Held & Hein 1963 performed an\nexperiment in which pairs of kittens were harnessed to a carousel in a\nsmall, cylindrical chamber. One of the kittens was able to engage in\nfree circumambulation while wearing a harness. The other kitten was\nsuspended in the air in a metal gondola whose motions were driven by\nthe first harnessed kitten. When the first kitten walked, both kittens\nmoved and received identical visual stimulation. However, only the\nfirst kitten received reafferent visual feedback as the result of\nself-movement. Held and Hein reported that only mobile\nkittens developed normal depth perception—as evidenced by their\nunwillingness to step over the edge of a visual cliff, blinking\nreactions to looming objects, and visually guided paw placing\nresponses. Noë (2004) argues that this experiment supports the\nenactive approach: in order to develop normal visual depth perception\nit is necessary to learn how motor outputs lead to changes to visual\ninputs.\n\nThere are two main reasons to be skeptical of this assessment.\nFirst, there is evidence that passive transport in\nthe gondola may have disrupted the development of the kittens’\ninnate visual paw placing responses (Ganz 1975: 206).\nSecond, the fact that passive kittens were prepared\nto walk over the edge of a visual cliff does not show that their\nvisual experience of depth was abnormal. Rather, as Jesse\nPrinz (2006) argues, it may only indicate that they “did not\nhave enough experience walking on edges to anticipate the bodily\naffordances of the visual world”.\n2.3.2 Challenges to the Enactive Approach\n\nThe enactive approach confronts objections on multiple fronts. We\nfocus on just three of them here (but for discussion and potential\nreplies, see Block 2005; Prinz 2006; Briscoe 2008; Clark 2009: chap.\n8; Block 2012; and Hutto & Myin 2017). First, the\napproach is essentially an elaboration of Held’s reafference\ntheory and, as such, faces many of the same empirical obstacles.\nEvidence, for example, that active movement per se is not\nnecessary for perceptual adaptation to optical rearrangement\n (Section 2.2)\n is at variance with predictions made by the reafference theory and\nthe enactive approach alike.\n\nA second line of criticism targets the alleged\nperceptual priority of P-properties. According to the enactive\napproach, P-properties are “perceptually basic” (Noë\n2004: 81) because in order to see an object’s intrinsic, 3D\nspatial properties it is necessary to see its 2D P-properties and to\nunderstand how they would undergo transformation with variation in\none’s point of view. When we view a tilted coin, critics argue,\nhowever, we do not see something that looks—in either\nan epistemic or non-epistemic sense of “looks”—like\nan upright ellipse. Rather, we see what looks like a disk that is\npartly nearer and partly farther away from us. In general, the\napparent shapes of the objects we perceive are not 2D but have\nextension in depth (Austin 1962; Gibson 1979; Smith 2000; Schwitzgebel\n2006; Briscoe 2008; Hopp 2013).\n\nSupport for this objection comes from work in mainstream vision\nscience. In particular, there is abundant empirical evidence that an\nobject’s 3D shape is specified by sources of spatial information\nin the light reflected or emitted from the object’s surfaces to\nthe perceiver’s eyes as well as by oculomotor factors (for\nreviews, see Cutting & Vishton 1995; Palmer 1999; and Bruce et\nal. 2003). Examples include binocular disparity, vergence,\naccommodation, motion parallax, texture gradients, occlusion, height\nin the visual field, relative angular size, reflections, and shading.\nThat such shape-diagnostic information having once been processed by\nthe visual system is not lost in conscious visual experience of the\nobject is shown by standard psychophysical methods in which\nexperimenters manipulate the availability of different spatial depth\ncues and gauge the perceptual effects. Objects, for example, look\nsomewhat flattened under uniform illumination conditions that\neliminate shadows and highlights, and egocentric distances are\nunderestimated for objects positioned beyond the operative range of\nbinocular disparity, accommodation, and vergence. Results of such\nexperimentation show that observers can literally see the difference\nmade by the presence or absence of a certain cue in the light\navailable to the eyes (Smith 2000; Briscoe 2008; for debate on whether\n2D perspectival properties should be introduced into scientific\nexplanations of shape perception, see Bennett 2012; McLaughlin 2016;\nLande 2018; Morales & Firestone 2020; Linton 2021; Burge &\nBurge 2022; Cheng et al. 2022; and Morales & Firestone 2023).\n\nAccording to the influential dual systems model (DSM) of visual\nprocessing (Milner & Goodale 1995/2006; Goodale & Milner\n2004), visual consciousess and visuomotor control are supported by\nfunctionally and anatomically distinct visual subsystems (these are\nthe ventral and dorsal information processing\nstreams, respectively). In particular, proponents of the DSM maintain\nthat the contents of visual experience are not used by motor\nprogramming areas in the primate brain:\n\n\nThe visual information used by the dorsal stream for programming and\non-line control, according to the model, is not perceptual in\nnature …[I]t cannot be accessed consciously, even in principle.\nIn other words, although we may be conscious of the actions we\nperform, the visual information used to program and control those\nactions can never be experienced. (Milner & Goodale 2008:\n775–776)\n\n\nA final criticism of the enactive approach is that it\nis empirically falsified by evidence for the DSM (see the commentaries\non O’Regan & Noë 2001; Clark 2009: chap. 8; Briscoe\n2014; and the essays collected in Gangopadhyay et al. 2010):\nthe bond it posits between what we see and what we do is much too\ntight to comport with what neuroscience has to tells us about their\nfunctional relations.\n\nThe enactivist can make two points in reply to this objection. First,\nexperimental findings indicate that there are a number of contexts in\nwhich information present in conscious vision is utilized for purposes\nof motor programming (see Briscoe 2009 and Briscoe & Schwenkler\n2015). Action and perception are not as sharply dissociated as\nproponents of DSM sometimes claim.\n\nSecond, the enactive approach, as emphasized above, rejects the idea\nthat the function of vision is to guide actions. It\n\n\ndoes not claim that visual awareness depends on visuomotor skill, if\nby “visuomotor skill” one means the ability to make use of\nvision to reach out and manipulate or grasp. Our claim is that seeing\ndepends on an appreciation of the sensory effects of movement (not, as\nit were, on the practical significance of sensation). (Noë 2010:\n249)\n\n\nSince the enactive approach is not committed to the idea that seeing\ndepends on knowing how to act in relation to what we see, it is not\nthreatened by empirical evidence for a functional dissociation between\nvisual awareness and visually guided action.\n3. Motor Component and Efferent Readiness Theories\n\nAt this point, it should be clear that the claim that perception is\nactive or action-based is far from unambiguous.\nPerceiving may implicate action in the sense that it is taken\nconstitutively to involve associations with touch (Berkeley 1709),\nkinaesthetic feedback from changes in eye position (Lotze 1887\n[1879]), consciously experienced “effort of the will”\n(Helmholtz 2005 [1924]), or knowledge of the way reafferent sensory\nstimulation varies as a function of movement (Held 1961; O’Regan\n& Noë 2001; Hurley & Noë 2003).\n\nIn this section, we shall examine two additional conceptions of the\nrole of action in perception. According to the motor component\ntheory, as we shall call it, efference copies generated in\nthe oculomotor system and/or proprioceptive feedback from\neye-movements are used in tandem with incoming sensory inputs to\ndetermine the spatial attributes of perceived objects (Helmholtz 2005\n[1924]; Mack 1979; Shebilske 1984, 1987; Ebenholtz 2002; Briscoe\n2021). Efferent readiness theories, by contrast,\nappeal to the particular ways in which perceptual states\nprepare the observer to move and act in relation to the\nenvironment. The modest readiness theory, as we shall\ncall it, claims that the way an object’s spatial attributes are\nrepresented in visual experience is sometimes modulated by one or\nanother form of covert action planning (Festinger et al.\n1967; Coren 1986; Vishton et al. 2007). The bold\nreadiness theory argues for the stronger, constitutive claim\nthat, as J.G. Taylor puts its, “perception and multiple\nsimultaneous readiness for action are one and the same thing”\n(1968: 432).\n3.1 The Motor Component Theory (Embodied Visual Perception)\n\nAs pointed out in\n Section 2.3.2,\n there are numerous, independently variable sources of information\nabout the spatial layout of the environment in the light sampled by\nthe eye. In many cases, however, processing of stimulus information\nrequires or is optimized by recruiting sources of auxiliary\ninformation from outside the visual system. These may be directly\nintegrated with incoming visual information or used to change the\nweighting assigned to one or another source of optical stimulus\ninformation (Shams & Kim 2010; Ernst 2012).\n\nAn importantly different recruitment strategy involves combining\nvisual input with non-perceptual information originating in the\nbody’s motor control systems, in particular, efference copy,\nand/or proprioceptive feedback from active movement (kinaesthesis).\nThe motor component theory, as we shall call it, is\npremised on evidence for such motor-modal processing.\n\nThe motor component theory can be made more concrete by examining\nthree situations in which the spatial contents of visual experience\nare modulated by information concerning recently initiated or\nimpending bodily movements:\n\nApparent direction: The retinal image produced by\nan object is ambiguous with respect to the object’s direction in\nthe absence of extraretinal information concerning the orientation of\nthe eye relative to the head. While there is evidence that\nproprioceptive inflow from muscle spindles in the extraocular muscles\nis used to encode eye position, as Sherrington 1918 proposed,\noutflowing efference copy is generally regarded as the more\nheavily weighted source of information (Bridgeman & Stark 1991).\nThe problem of visual direction constancy was discussed in detail in\n Section 2.1\n above.\nApparent distance and size: When an object is at\nclose range, its distance in depth from the perceiver can be\ndetermined on the basis of three variables: (1) the distance between\nthe perceiver’s eyes, (2) the vergence angle formed by the line\nof sight from each eye to the object, and (3) the direction of gaze.\nInformation about (1) is updated in the course of development as the\nperceiver’s body grows. Information about (2) and (3), which\nvary from one moment to the next, is obtained from efference copy of\nthe motor command to fixate the object as well as proprioceptive\nfeedback from the extraocular muscles. Since an object’s\napparent size is a function of its perceived distance from the\nperceiver and the angle it subtends on the retina (Emmert 1881),\ninformation about (2) and (3) can thus modulate visual size perception\n(Mon-Williams et al. 1997).\nApparent motion: In the most familiar case of\nmotion perception, the subject visually tracks a moving target, e.g.,\na bird in flight, against a stable background using smooth\npursuit eye movements. As Bridgeman et al. 1994 note,\nsmooth pursuit “reverses the movement conditions on the retina:\nthe tracked object sweeps across the retina very little, while the\nbackground undergoes a brisk motion” (p. 255). Nonetheless, it\nis the target that appears to be in motion while the environment\nappears to be stationary. There is evidence that the visual system is\nable to compensate for pursuit induced retinal motion by means of\nefference-based information about the changing direction of gaze (for\na review, see Furman & Gur 2012). This has been used to explain\nthe travelling moon illusion (Post & Leibowitz 1985: 637).\nNeuropsychological findings indicate that failure to integrate\nefference-based information about eye movement leads to a breakdown in\nperceived background stability during smooth pursuit (Haarmeier et\nal. 1997; Nakamura & Colby 2002; Fischer et al.\n2012).\n\n\nThe motor component theory is a version of the view that perception is\nembodied in the sense of Prinz 2009 (see the entry on\n embodied cognition).\n Prinz explains that\n\n\nembodied mental capacities, are ones that depend on mental\nrepresentations or processes that relate to the body…. Such\nrepresentations and processes come in two forms: there are\nrepresentations and processes that represent or respond to body, such\nas a perception of bodily movement, and there are representations and\nprocesses that affect the body, such as motor commands (2009:\n420).\n\n\nThe three examples presented above provide empirical support for the\nthesis that visual perception is embodied in this sense. For\nadditional examples, see Ebenholtz 2002: chap. 4, and for further\ndiscussion of various senses of embodiment, see Alsmith & de\nVignemount 2012, de Vignemont & Alsmith 2017, Bermúdez 2018,\nStoneham 2018, and Berendzen 2023.\n3.2 The Efferent Readiness Theory\n\nPatients with frontal lobe damage sometimes exhibit pathological\n“utilization behaviour” (Lhermitte 1983) in which the\nsight of an object automatically elicits behaviors typically\nassociated with it, such as automatically pouring water into a glass\nand drinking it whenever a bottle of water and a glass are present\n(Frith et al. 2000: 1782). That normal subjects often do not\nautomatically perform actions afforded by a perceived object, however,\ndoes not mean that they do not plan, or imaginatively rehearse, or\notherwise represent them. (On the contrary, recent neuroscientific\nfindings suggest that merely perceiving an object often covertly\nprepares the motor system to engage with it in a certain manner. For\noverviews, see Jeannerod 2006 and Rizzolatti 2008.)\n\nEfferent readiness theories are based on the idea that covert\npreparation for action is “an integral part of the perceptual\nprocess” and not “merely a consequence of the\nperceptual process that has preceded it” (Coren 1986: 394).\nAccording to the modest readiness theory, as we shall\ncall it, covert motor preparation can sometimes influence the way an\nobject’s spatial attributes are represented in perceptual\nexperience. The bold readiness theory, by contrast,\nargues for the stronger, constitutive claim that to perceive an\nobject’s spatial properties just is to be prepared or\nready to act in relation to the object in certain ways (Sperry 1952;\nTaylor 1962, 1965, 1968).\n3.2.1 The Modest Readiness Theory\n\nA number of empirical findings motivate the modest readiness theory.\nFestinger et al. 1967 tested the view that visual contour\nperception is\n\n\ndetermined by the particular sets of preprogrammed efferent\ninstructions that are activated by the visual input into a state of\nreadiness for immediate use. (p. 34)\n\n\nContact lenses that produce curved retinal input were placed on the\nright eye of three observers, who were instructed to scan a\nhorizontally oriented line with their left eye covered for 40 minutes.\nThe experimenters reported that there was an average of 44% adaptation\nwhen the line was physically straight but retinally curved, and an\naverage of 18% adaptation when the line was physically curved but\nretinally straight (see Miller & Festinger 1977, however, for\nconflicting results).\n\nAn elegantly designed set of experiments by Coren 1986 examined the\nrole of efferent readiness in the visual perception of direction and\nextent. Coren’s experiments support the hypothesis that the\nspatial parameter controlling the length of a saccade is not the\nangular direction of the target relative to the line of sight, but\nrather the direction of the center of gravity (COG) of all the stimuli\nin its vicinity (Coren & Hoenig 1972; Findlay 1982).\nImportantly,\n\n\nthe bias arises from the computation of the saccade that\nwould be made and, hence, is held in readiness, rather than\nthe saccade actually emitted. (Coren 1986: 399)\n\n\nThe COG bias is illustrated in\n Figure 3.\n In the first row (top), there are no extraneous\nstimuli near the saccade target. Hence, the saccade from the point of\nfixation to the target is unbiased. In the second\nrow, by contrast, the location of an extraneous stimulus\n(×) results in a saccade from the point of fixation that\nundershoots its target, while in the third row the\nsaccade overshoots its target. In the fourth row,\nchanging the location of the extraneous stimulus eliminates the COG\nbias: because the extraneous stimulus is near the point of fixation\nrather than the saccade target, the saccade is accurate.\n\n\n\nFigure 3: The effect of starting eye\nposition on saccade programming (after Coren 1986: 405)\n\n\nThe COG bias is evolutionarily adaptive: eye movements will bring both\nthe saccade target as well as nearby objects into high acuity vision,\nthereby maximizing the amount of information obtained with each\nsaccade. Motor preparation or “efferent readiness” to\nexecute an undershooting or overshooting saccade, Coren found,\nhowever, can also give rise to a corresponding illusion of\nextent (1986: 404–406). Observers, e.g., will perceptually\nunderestimate the length of the distance between the point of fixation\nand the saccade target when there is an extraneous stimulus on the\nnear side of the target (as in the second row of\n Figure 3)\n and will perceptually overestimate the length of the distance when\nthere is an extraneous stimulus on the far side of the target (as in\nthe third row of\n Figure 3).\n\nAccording to Coren, the well-known Müller-Lyer illusion can be\nexplained within this framework. The outwardly turned wings in\nMüller-Lyer display shift the COG outward from each vertex, while\nthe inwardly turned wings in this figure shift the COG inward. This\ninfluences both saccade length from vertex to vertex as well as the\napparent length of the central line segments. The influence of COG on\nefferent readiness to execute eye movements, Coren argues (1986:\n400–403), also explains why the line segments in the\nMüller-Lyer display can be replaced with small dots while leaving\nthe illusion intact as well as the effects of varying wing length and\nwing angle on the magnitude of the illusion.\n3.2.2 The Bold Readiness Theory\n\nThe modest readiness theory holds that the way an object’s\nspatial attributes are represented in visual experience is sometimes\nmodulated by one or another form of covert action planning. The\nbold readiness theory argues for a stronger,\nconstitutive claim: to perceive an object’s spatial properties\njust is to be prepared or ready to act in relation to the\nobject in certain ways. We begin by examining J.G. Taylor’s\n“behavioral theory” of perception (Taylor 1962, 1965,\n1968).\n\nTaylor’s behavioral theory of perception identifies the\nconscious experience of seeing an object’s spatial properties\nwith the passive activation of a specific set of learned or\n“preprogrammed” motor routines:\n\n\n[P]erception is a state of multiple simultaneous readiness for actions\ndirected to the objects in the environment that are acting on the\nreceptor organs at any one moment. The actions in question have been\nacquired by the individual in the course of his life and have been\ndetermined by the reinforcing contingencies in the environment in\nwhich he grew up. What determines the content of perception is not the\nproperties of the sensory transducers that are operated on by stimulus\nenergies from the environment, but the properties of the behaviour\nconditioned to those stimulus energies…. (1965: 1, our\nemphasis)\n\n\nAccording to Taylor’s theory, sensory stimulation gives rises to\nspatially contentful visual experience as a consequence of\nassociative, reinforcement learning: we perceive an object as having\nthe spatial attribute G when the types of proximal sensory\nstimulation caused by the object have been conditioned to the\nperformance of actions sensitive to G (1962: 42). The\nconscious experience of seeing an object’s distance, e.g., is\nconstituted by the subject’s learned readiness to perform\nspecific whole body and limb movements that were reinforced when the\nsubject previously received stimulation from objects at the same\nremove. In general, differences in the spatial content of a visual\nexperience are identified with differences in the subject’s\nstate of “multiple simultaneous readiness” to interact\nwith the objects represented in the experience.\n\nThe main problem with Taylor’s theory is one that besets\nbehaviorist theories of perception in general: it assumes that for any\nvisible spatial property G, there will be some distinctive\nset of behavioral responses that are constitutive of perceiving the\nobject as having G. The problem with this assumption, as\nMohan Matthen (1988) puts it,\n\n\nthere is no such thing as the proper response, or even a\nrange of functionally appropriate responses, to what perception tells\nus. (p. 20, see also Hurley 2001: 17)\n\n4. Skill/Disposition Theories\n\nThe last approach we shall discuss has roots in, and similarities to,\nmany of the proposals covered above, but is most closely aligned with\nthe bold readiness theory. We will follow Grush (2007) in calling this\napproach the disposition theory (see Grush 2007: 394, for discussion\nof the name). The primary proponent of this position is Gareth Evans,\nwhose work on spatial representation focused on understanding how we\nmanage to perceive objects as occupying locations in egocentric space.\nRelated views have been defended by Peacocke 1992, chap. 3; Simmons\n2003; Schellenberg 2007, 2010; Briscoe 2009, 2014; Ward et al. 2011;\nAlsmith 2012; Mandrigin 2021; de Vignemont 2021; and Nave et al.\n2022.\n\nThe starting point of Evans’ theory is that the subject’s\nperceptual systems have isolated a channel of sensory input, an\n“information link”, through which she receives information\nabout the object. The information link by itself does not allow the\nsubject to know the location of this object. Rather, it is when the\ninformation link is able to induce in the subject appropriate kinds of\nbehavioral dispositions that it becomes imbued with spatial\nimport:\n\n\nThe subject hears the sound as coming from such-and-such a position,\nbut how is the position to be specified? Presumably in\negocentric terms (he hears the sound as up, or down, to the\nright or to the left, in front or behind). These terms specify the\nposition of the sound in relation to the observer’s own body;\nand they derive their meaning in part from their complicated\nconnections with the subject’s actions. (Evans 1982:\n155)\n\n\nThis is not a version of a motor theory (e.g., Poincaré 1907:\n71). The behavioral responses in question are not to be\nunderstood as raw patterns of motor activations, or even muscular\nsensations. Such a reduction would face challenges anyway, since for\nany location in egocentric space, there are an infinite number of\nkinematic configurations (movements) that would, for example, effect a\ngrasp to that location; and for any kinematic configuration, there are\nan infinite number of dynamic profiles (temporal patterns of muscular\nforce) that would yield that configuration. The behavioral responses\nin question are overt environmental behavior:\n\n\nIt may well be that the input-output connections can be finitely\nstated only if the output is described in explicitly spatial terms\n(e.g., ‘extending the arm’, ‘walking forward two\nfeet’, etc.). If this is so, it would rule out the reduction of\nthe egocentric spatial vocabulary to a muscular vocabulary. But such a\nreduction is certainly not needed for the point being urged here,\nwhich is that the spatial information embodied in auditory perception\nis specifiable only in a vocabulary whose terms derive their meaning\npartly from being linked with bodily actions. Even given an\nirreducibility, it would remain the case that possession of such\ninformation is directly manifestable in behaviour issuing from no\ncalculation; it is just that there would be indefinitely many ways in\nwhich the manifestation can occur. (Evans 1982: 156)\n\n\nAlso, on this proposal, all modalities are in the same boat. As such\nthe disposition theory is more ambitious than most of the theories\nalready discussed, which are limited to vision. Not only is there no\nreduction of perceptual spatial content to a “muscular\nvocabulary”, there is also no reduction of the spatial content\nof some perceptual modalities to that of one or more others—as\nthere was for Berkeley, who sought to reduce the spatial content of\nvision to that of touch, and whose program forced a distinction\nbetween two spaces, visual space and tangible space:\n\n\nThe spatial content of auditory and tactual-kinaesthetic perceptions\nmust be specified in the same terms—egocentric terms. …\nIt is a consequence of this that perceptions from both systems will be\nused to build up a unitary picture of the world. There is only one\negocentric space, because there is only one behavioural space. (Evans\n1982: 160)\n\n\nRelatedly, for Evans it is not even the case that spatial perceptual\ncontent, for all modalities, is being reduced to behavioral\ndispositions. Rather, perceptual inputs and behavioral outputs\njointly and holistically yield a single behavioral space:\n\n\nEgocentric spatial terms are the terms in which the content of our\nspatial experiences would be formulated, and those in which our\nimmediate behavioural plans would be expressed. This duality is no\ncoincidence: an egocentric space can exist only for an animal in which\na complex network of connections exists between perceptual input and\nbehavioural output. A perceptual input—even if, in some loose\nsense, it encapsulates spatial information (because it belongs to a\nrange of inputs which vary systematically with some spatial\nfacts)—cannot have a spatial significance for an organism except\nin so far as it has a place in such a complex network of input-output\nconnections. (Evans 1982: 154)\n\nEgocentric spatial terms and spatial descriptions of bodily movement\nwould, on this view, form a structure familiar to philosophers under\nthe title “holistic”. (Evans 1982: 156, fn. 26)\n\n\nThis last point and the associated quotes address a common\nmisconception of the disposition theory. It would be easy to read the\ntheory as providing a proposal of the following sort: A creature\ngets sensory information from a stimulus, and the problem is to\ndetermine where that stimulus is located in egocentric space; the\nsolution is that features of that sensory episode induce dispositions\nto behavior targeting some egocentric location. While this sort\nof thing is indeed a problem, it is relatively superficial. Any\ncreature facing this problem must already have the capacity\nto grasp egocentric spatial location contents, and the problem is\nwhich of these ready-at-hand contents it should assign to the\nstimulus. But the disposition theory is addressing a deeper question:\nin virtue of what does this creature have a capacity to grasp\negocentric spatial contents to begin with? The answer is that the\ncreature must have a rich set of interconnections between sensory\ninputs (and their attendant information links) and dispositions for\nbehavioral outputs.\n\nRick Grush (2000, 2007) has adopted Evans’ theory, and attempted\nto clarify and expand upon it, particularly in three areas: first, the\ndistinction between the disposition theory and other approaches;\nsecond, the neural implementation of the disposition theory; and\nfinally the specific kinds of dispositions that are relevant for the\nissue of spatial experience.\n\nThe theory depends on behavioral dispositions. Grush (2007) argues\nthat there are two distinctions that need to be made: first, the\norganism might possess i) knowledge of what the consequences (bodily,\nenvironmental, or sensory) of a given action will be; or ii) knowledge\nof which motor commands will bring about a given desired end state (of\nthe body, environment, or sensory channels) (Grush 2007: 408). I might\nbe able to recognize that a series of moves someone shows me will\nforce my grandmaster opponent into checkmate (knowledge of the first\nsort, the consequences of a given set of actions), and yet not have\nbeen anywhere near the skill level to have come up with that series of\nmoves on my own (knowledge of the second sort, what actions will\nachieve a desired effect). Sensorimotor contingency theorists appeal\nto knowledge of the first sort—though Noë (2004: 90) flirts\nwith appealing to knowledge of the second sort to explain the\nperceptual grasp of P-shapes; to the extent he does, he is embracing a\ndisposition theoretic account of P-shapes. Disposition theorists, and\nbold readiness theorists\n (Section 3.2.2)\n appeal to knowledge of the second sort. These are the dispositions of\nthe disposition theory: given some goal, the organism is disposed to\nexecute certain actions.\n\nThis leads to the second distinction, between type-specifying\nand detail-specifying dispositions. Grush (2007: 393)\nmaintains that only the latter are directly relevant for spatial\nperception. A type-specifying disposition is a disposition to execute\nsome type of behavior with respect to an object or place. For\nexample, an organism might be disposed to grasp, bite, flee, or\nfoveate some object. This sort of disposition is not relevant to the\nspatial content of the experience on the disposition theory. Rather,\nwhat are relevant are detail-specifying dispositions: the specifics of\nhow I am disposed to act to execute any of these behavior types. When\nreaching to grab the cup to take a drink (type), do I move my hand\nlike so (straight ahead, say), or like such (off to the right)? When I\nwant to foveate or orient towards (behavior type) the ant crawling up\nthe wall, do a I move my head and eyes like this, or like\nthat?\n\nThis latter distinction allows the disposition theory to answer one of\nthe main objections to the bold readiness theory (described at the end\nof section\n 3.2.2)\n that there is no single special disposition connected to perceiving\nany given object. That is true of type-specifying dispositions, but\nnot of detail-specifying dispositions. Given the ant’s location\nthere is indeed a very limited range of detail specifying dispositions\nthat will allow me to foveate it (though this might require\nconstraints on possible actions, such as minimum jerk or\nother such constraints).\n\nGrush (2007; 2009) has proposed a detailed implementation of the\ndisposition theory in terms of neural information processing. The\nproposal involves more mathematics than is appropriate here, and so a\nquick qualitative description will have to suffice (for more detail,\nsee Grush 2007; 2009). The basic idea is that relevant cortical areas\nlearn sets of basis functions which, to put it very roughly,\nencode equivalence classes of combinations of sensory and postural\nsignals (for discussion, see Pouget et al. 2002). For\nexample, many combinations of eye orientation and location of\nstimulation on the retina correspond to a visual stimulus that is\ndirectly in front of the head. Sorting such bodily postural\ninformation (not just eye orientation, but any postural information\nthat affects sensation, which is most) and sensory condition pairs\ninto useful equivalence classes is the first half of the job.\n\nWhat this does is encode incoming information in a way that renders it\nready to be of use in guiding behavior, since the equivalence classes\nare precisely those for which a given kind of motor program is\nappropriate. The next part corresponds to how this information, so\nrepresented, can be used to produce the details of such a motor\nprogram. For every type of action in a creature’s\nbehavioral repertoire (grasp, approach, avoid, foveate, bite, etc.)\nits motor areas have a set of linear coefficients, easily implemented\nas a set of neural connection strengths, and when these are applied to\na set of basis function values, a detailed behavior is specified. For\nexample, when a creature senses an object O1, a\nset of basis function values B1 for that stimulus\nis produced. If the creature decides to execute overt action\nA1, then the B1 basis function\nvalues are multiplied by the coefficient corresponding to\nA1. The result is an instance of behavior type\nA1 executed with respect to object\nO1. If the creature had decide instead to execute\naction A2, with respect to O1,\nthe B1 basis function values would have been\nmultiplied by the A2 set of coefficients, and the\nresult would be a motor behavior executing A2 on\nobject O1.\n\nAccordingly, the disposition theory has a very different account of\nwhat is happening with sensory substitution devices than Susan Hurley\nand Alva Noë (see\n Section 2.3.2\n above). On the disposition theory, what allows the user of such a\ndevice to have spatial experience is not the ability to anticipate how\nthe sensory input will change upon execution of movement as the\nsensorimotor contingency theory would have it. Rather, it is that the\nsubject’s brain has learned to take these sensory inputs\ntogether with postural signals to produce sets of basis functions that\npoise the subject to act with respect to the object that is causing\nthe sensory signals (see Grush 2007: 406).\n\nOne objection to disposition theories is what Hurley has called\nThe Myth of the Giving:\n\n\nTo suppose that … the content of intentions can be taken as\nunproblematically primitive in explaining how the content of\nexperience is possible, is to succumb to the myth of the giving.\n(Hurley 1998: 241)\n\n\nThe idea behind this objection is that one is simply shifting the debt\nfrom one credit card to another when one takes as problematic the\nspatial content of perception, and then appeals to motor behavior as\nthe supplier of this content. For then, of course, the question will\nbe: Whence the spatial content of motor behavior?\n\nThe disposition theory, however, does not posit any such unilateral\nreduction (though Taylor’s bold readiness theory arguably does,\nsee\n Section 3.2.2\n above). As discussed above, Evans explicitly claims that the\nbehavioral space is holistically determined by both behavior and\nperception. And on Grush’s account spatial content is\nimplemented in the construction of basis function values, and these\nvalues coordinate transitions from perceptual input to\nbehavioral output. As such, they are highly analogous to inferences\nwhose conditions of application are given in sensory-plus-postural\nterms and whose consequences of application manifest in behavioral\nterms. The import of the states that represent these basis function\nvalues is no more narrowly motor than the meaning of a conditional can\nbe identified with its consequent (or its antecedent, for that matter)\nin isolation.\n\nAnother very common objection, one that is often leveled at many forms\nof motor theory, has to do with the fact that even paralyzed people,\nwith very few possibilities for action, seem capable in many cases of\nnormal spatial perception. Such objections would, at a minimum, place\nsignificant pressure on any views that explain perceptual content by\nappeal to actual behavior. It is also easy to see how even\nhypothetical behavior would be called into question in such cases,\nsince in many such cases behavior is not physically possible.\nGrush’s theory (2007), right or wrong, has something specific to\nsay about this objection. Since spatial content is taken to be\nmanifested in the production of basis function values in the cortex,\nthe prediction is that any impairments manifesting farther down the\nchain, the brain stem or spinal cord, for example, need have no direct\neffect on spatial content. So long as the relevant brain areas have\nthe wherewithal to produce sets of basis function values suitable for\nconstructing a motor sequence (if multiplied by the\naction-type-specific coefficients), then the occasioning perceptual\nepisode will have spatial content.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Abbott, T.K., 1864, <em>Sight and Touch: An Attempt to Disprove\nthe Received (or Berkeleian) Theory of Vision</em>, London: Longman\n&amp; Co.",
                "Alsmith, A., 2021,“The Structure of Egocentric Space”,\nIn <em>The World at Our Fingertips: A Multidisciplinary Exploration of\nPeripersonal Space</em>, F. de Vignemont, H.Y. Wong, A. Farné\nand A. Serino (eds.), Oxford: Oxford University Press.",
                "Alsmith, A. and F. de Vignemont, 2012, “Embodying the Mind\nand Representing the Body”, <em>Review of Philosophy and\nPsychology</em>, 3(1): 1–13.",
                "Armstrong, D.M., 1960, <em>Berkeley's theory of vision</em>,\nParkville: Melbourne University Press.",
                "Atherton, M., 2005, “Berkeley’s Theory of Vision and\nIts Reception”, in <em>The Cambridge Companion to Berkeley</em>,\nNew York: Cambridge University Press, pp. 94–124.",
                "Austin, J.L., 1962, <em>Sense and Sensibilia</em>, Oxford:\nClarendon.",
                "Bach-y-Rita, P., 1972, <em>Brain Mechanisms in Sensory\nSubstitution</em>, New York: Academic Press.",
                "–––, 2004, “Tactile Sensory Substitution\nStudies”, <em>Annals of the New York Academy of Sciences</em>,\n1013: 83–91.",
                "Bach-y-Rita, P. and S.W. Kercel, 2003, “Sensory Substitution\nand the Human–Machine Interface”, <em>Trends in Cognitive\nSciences</em>, 7(12): 541–546.",
                "Bailey, S., 1842, <em>A Review of Berkeley’s Theory of\nVision, Designed to Show the Unsoundness of That Celebrated\nSpeculation</em>, London: James Ridgway.",
                "Bain, A., 1855, <em>The Senses and the Intellect</em>, New York:\nAppleton.",
                "–––, 1868, <em>Mental and Moral Science</em>,\nLondon: Longmans, Green, and Co.",
                "Bell, C., 1823, “Idea of a New Anatomy of the Brain”,\nin <em>Francois Magendie, Charles Bell and the Course of the Spinal\nNerves</em>, P. Cranefield (ed.), Mt. Kisco, NY: Futura, 1974.",
                "Bennett, D. J., 2011, “How the World is Measured Up in Size\nExperience”, <em>Philosophy and Phenomenological Research</em>,\n83: 345–365.",
                "Bennett, D.J., 2012, “Seeing Shape: Shape Appearances and\nShape Constancy”, <em>British Journal for the Philosophy of\nScience,</em> 63(3): 487–518.",
                "Berendzen, J.C., 2023, <em>Embodied Idealism: Merleau-Ponty's\nTranscendental Philosophy</em>, Oxford: Oxford University Press.",
                "Berkeley, G., 1709, “An Essay Towards a New Theory of\nVision”, in <em>Berkeley: Philosophical Writings</em>, D. Clarke\n(ed.), Cambridge: Cambridge University Press, 2008.",
                "–––, 1734, <em>A Treatise Concerning the\nPrinciples of Human Knowledge</em>, K. Winkler (ed.), Indianapolis:\nHackett, 1982.",
                "Bermúdez, J.L., 2018, <em>The Bodily Self</em>, Cambridge,\nMA: MIT Press.",
                "Block, N., 2005, “Review of <em>Action in\nPerception</em>”, <em>Journal of Philosophy</em>, 102:\n259–272.",
                "–––, 2012, “Discussion of J. Kevin\nO’Regan’s <em>Why Red Doesn’t Sound Like a Bell:\nUnderstanding the Feel of Consciousness</em>”, <em>Review of\nPhilosophy and Psychology</em>, 3: 89–108.",
                "Bridgeman, B., 1981, “Cognitive Factors in Subjective\nStabilization of the Visual World”, <em>Acta Psychologica</em>,\n48: 111–121.",
                "–––, 2010, “Space Constancy: The Rise and\nFall of Perceptual Compensation”, in <em>Space and Time in\nPerception and Action</em>, pp. 94–108.",
                "Bridgeman, B., D. Hendry, and L. Stark, 1975, “Failure to\nDetect Displacement of the Visual World During Saccadic Eye\nMovements”, <em>Vision Res</em>, 15: 719–722.",
                "Bridgeman, B. and L. Stark, 1991, “Ocular Proprioception and\nEfference Copy in Registering Visual Direction”, <em>Vision\nRes</em>, 31: 1903–1913.",
                "Bridgeman B, A.H.C. van der Heijden, and B. Velichkovsky, 1994,\n“A Theory of Visual Stability Across Saccadic Eye\nMovements”, <em>Behavioral and Brain Sciences</em>, 17:\n247–292.",
                "Briscoe, R., 2008, “Vision, Action, and\nMake-Perceive”, <em>Mind and Language</em>, 23:\n457–497.",
                "–––, 2009, “Egocentric Spatial\nRepresentation in Action and Perception”, <em>Philosophy and\nPhenomenological Research</em>, 79: 423–460.",
                "–––, 2014, “Spatial Content and Motoric\nSignificance”, <em>Avant</em> 2 (<em>Enactivism: Arguments and\nApplications</em>): 199–216.",
                "–––, 2016. “Multisensory Processing and\nPerceptual Consciousness: Part I”, <em>Philosophy Compass</em>\n11(2): 121–133",
                "–––, 2019, “Bodily Action and Distal\nAttribution in Sensory Substitution”, in <em>Sensory\nSubstitution and Augmentation</em>, F. Macpherson (ed.), Oxford\nUniversity Press, Proceedings of the British Academy Series, pp.\n173–186.",
                "–––, 2021. “Bodily Awareness and Novel\nTypes of Multisensory Features”, in <em>Between Vision and\nAction</em>, a special issue of <em>Synthese</em>, 198,\n3913–3941, edited by G. Ferretti and S. Zipoli Caiani.",
                "Briscoe, R. and J. Schwenkler, 2015, “Conscious Vision in\nAction”, <em>Cognitive Science</em> 39: 1435–1467.",
                "Broad, C.D., 1923, <em>Scientific Thought</em>, C.K. Ogden (ed.),\nNew York: Harcourt, Brace.",
                "Bruce, V., P. Greene, and M. Georgeson, 2003, <em>Visual\nPerception: Physiology, Psychology and Ecology</em>, London:\nPsychology Press, 4th edition.",
                "Brune, F. and C.H. Lücking, 1969, “<em>Okulomotorik,\nBewegungswahrnehmung and Raumkonstanz der Sehdinge</em>”,\n<em>Der Nervenarzt</em>, 40: 692–700.",
                "Burge, J., &amp; Burge, T., 2022, “Shape, Perspective, and\nWhat Is and Is Not Perceived: Comment on Morales, Bax, and Firestone\n(2020)”, <em>Psychological Review</em>. Advance online\npublication. doi:10.1037/rev0000363",
                "Chemero, A. 2011, <em>Radical Embodied Cognitive Science</em>,\nCambridge, MA: MIT Press.",
                "Cheng, T., Lin, Y. and Wu, C.W., 2022. “Perspectival Shapes\nare Viewpoint-dependent Relational Properties”,\n<em>Psychological Review</em>. Advance online publication.\ndoi:10.1037/rev0000404",
                "Clark, A., 2009, <em>Supersizing the Mind</em>, Oxford: Oxford\nUniversity Press.",
                "Colby, C.L., J. Duhamel, and M.E. Goldberg, 1995,\n“Oculocentric Spatial Representation in Parietal Cortex”,\n<em>Cerebral Cortex</em>, 5: 470–481.",
                "Colby, C.L. and M.E. Goldberg, 1992, “The Updating of the\nRepresentation of Visual Space in Parietal Cortex by Intended Eye\nMovements”, <em>Science</em>, 255(5040): 90–92.",
                "Condillac, E., 1746, <em>Essay on the Origin of Human\nKnowledge</em>, H. Aarsleff (ed.), Cambridge: Cambridge University\nPress, 2001.",
                "–––, 1754, <em>Treatise on the Sensations</em>,\nG. Carr (trans.), London: Favil, 1930.",
                "Coren, S., 1986, “An Efferent Component in the Visual\nPerception of Direction and Extent”, <em>Psychological\nReview</em>, 93(4): 391–410.",
                "Coren, S. and P. Hoenig, 1972, “Effect of Non-Target Stimuli\nupon the Length of Voluntary Saccades”, <em>Perceptual and\nMotor</em> Skills, 34: 499–508.",
                "Creem‐Regehr, S.H. and Kunz, B.R., 2010. “Perception\nand Action”; <em>Wiley Interdisciplinary Reviews: Cognitive\nScience</em>, 1(6): 800–810.",
                "Cutting, J.E. and P.M. Vishton, 1995, “Perceiving Layout and\nKnowing Distances”, in <em>Perception of Space and Motion</em>,\nW. Epstein and S. Rogers (eds.), San Diego, CA: Academic Press, pp.\n69–117.",
                "Deubel, H., 2004, “Localization of Targets Across Saccades:\nRole of Landmark Objects”, <em>Visual Cognition</em>,\n11(2–3): 173–202.",
                "Deubel, H., W.X. Schneider, and B. Bridgeman, 2002,\n“Transsaccadic Memory of Position and Form”, <em>Progress\nin Brain Research</em>, 140: 165–180.",
                "Dewey, J., 1891, <em>Psychology</em>, New York: American Book\nCompany.",
                "Drayson, Z., 2017, “What is Action-oriented\nPerception?”, <em>Logic, Methodology and Philosophy of Science:\nProceedings of the 15th International Congress</em>, pp.\n1–14.",
                "Duhamel, J., C. Colby, and M. E. Goldberg, 1992, “The\nUpdating of the Representation of Visual Space in Parietal Cortex by\nIntended Eye Movements”, <em>Science</em>, 255:\n90–92.",
                "Ebenholtz, S., 2002, <em>Oculomotor Systems and Perception</em>,\nCambridge: Cambridge University Press.",
                "Emmert, E., 1881, “<em>Größenverhältnisse\nder Nachbilder</em>”, <em>Klinische Monatsblätter für\nAugenheilkunde und für augenärztliche Fortbildung</em>, 19:\n443–450.",
                "Epstein, W., 1967, <em>Varieties of Perceptual Learning</em>, New\nYork: McGraw Hill.",
                "Epstein, W., B. Hughes, S.L. Schneider, and P. Bach-y-Rita, 1986,\n“Is There Anything Out There? A Study of Distal Attribution in\nResponse to Vibrotactile Stimulation”, <em>Perception</em>, 15:\n275–284",
                "Ernst, M., 2012, “Optimal Multisensory Integration:\nAssumptions and Limits”, in <em>The New Handbook of Multisensory\nProcessing</em>, B. Stein, (ed.), Cambridge, MA: MIT Press, pp.\n527–544.",
                "Evans, G., 1982, <em>The Varieties of Reference</em>, Oxford:\nOxford University Press.",
                "–––, 1985, “Molyneux’s\nQuestion”, in <em>The Collected Papers of Gareth Evans</em>, A.\nPhillips (ed.), London: Oxford University Press.",
                "Falkenstein, L., 1994, “Intuition and Construction in\nBerkeley's Account of Visual Space”, <em>Journal of the History\nof Philosophy</em>, 32(1): 63–84.",
                "Ferretti, G., 2021, “Visual Phenomenology Versus Visuomotor\nImagery: How Can We be Aware of Action Properties?”,\n<em>Synthese</em>, 198, 3309–3338.",
                "Festinger, L., C.A. Burnham, H. Ono, and D. Bamber, 1967,\n“Efference and the Conscious Experience of Perception”,\n<em>Journal of Experimental Psychology Monographs</em>, 74(4, Pt 2):\n1–36.",
                "Findlay, J.M., 1982, “Global Visual Processing for Saccadic\nEye Movements”, <em>Vision Research</em>, 22(8):\n1033–1045.",
                "Firestone, C., 2013, “How ‘Paternalistic’ is\nSpatial Perception? Why Wearing a Heavy Backpack\nDoesn’t—and Couldn’t—Make Hills Look\nSteeper”, <em>Perspectives on Psychological science</em>, 8(4):\n455–473.",
                "Fischer, E., H.H. Bülthoff, N.K. Logothetis, and A. Bartels,\n2012, “Human Areas V3A and V6 Compensate for Self-Induced Planar\nVisual Motion”, <em>Neuron</em>, 73(6): 1228–1240.",
                "Fishkin, S., 1969, “Passive vs. Active Exposure and Other\nVariables Related to the Occurrence of Hand Adaptation to Lateral\nDisplacement”, <em>Perceptual and Motor Skills</em>, 29:\n291–297.",
                "Frith, C.D. and D.M. Wolpert, 2000, “Abnormalities in the\nAwareness and Control of Action”, <em>Philosophical Transactions\nof the Royal Society B: Biological Sciences</em>, 355(1404):\n1771–1788.",
                "Furman, M. and M. Gur, 2012, “And Yet it Moves: Perceptual\nIllusions and Neural Mechanisms of Pursuit Compensation During Smooth\nPursuit Eye Movements”, <em>Neuroscience &amp; Biobehavioral\nReviews</em>, 36(1): 143–151.",
                "Gangopadhyay, N., M. Madary, and F. Spicer, 2010, <em>Perception,\nAction, and Consciousness: Sensorimotor Dynamics and Two Visual\nSystems</em>, Oxford: Oxford University Press.",
                "Ganz, L., 1975, “Orientation in Visual Space by Neonates and\nits Modification by Visual Deprivation”, in <em>The\nDevelopmental Neuropsychology of Sensory Deprivation</em>, A. Riesen\n(ed.), New York: Academic Press, pp. 169–210.",
                "Gibson, J.J., 1933, “Adaptation, After-Effect and Contrast\nin the Perception of Curved Lines”, <em>Journal of Experimental\nPsychology</em>, 16(1): 1–31.",
                "–––, 1966, <em>The Senses Considered as\nPerceptual Systems</em>, Boston, MA: Houghton Mifflin.",
                "–––, 1979, <em>The Ecological Approach to Visual\nPerception</em>, Boston, MA: Houghton Mifflin.",
                "Goodale, M.A. and A.D. Milner, 2004, <em>Sight Unseen: An\nExploration of Conscious and Unconscious Vision</em>, Oxford: Oxford\nUniversity Press.",
                "Green, E.J., 2022, “The Puzzle of Cross‐modal Shape\nExperience.” <em>Noûs</em>, 56(4): 867–896.",
                "Green, E.J. and Schellenberg, S., 2018, “Spatial Perception:\nThe Perspectival Aspect of Perception.” <em>Philosophy\nCompass</em>, 13(2), p.e12472.",
                "Grush, R., 2000, “Self, World and Space: The Meaning and\nMechanisms of Ego- and Allocentric Spatial Representation”,\n<em>Brain and Mind</em>, 1: 59–92.",
                "–––, 2007, “Skill Theory v2.0:\nDispositions, Emulation, and Spatial Perception”,\n<em>Synthese</em>, 159: 389–416.",
                "–––, 2009, “Space, time, and\nobjects”, <em>The Oxford Handbook of Philosophy and\nNeuroscience</em>, John Bickle(ed), New York, NY: Oxford University\nPress, pp. 311–345.",
                "Grush, R., and Springle, A. 2019, “Agency, Perception,\nSpace, and Subjectivity”, <em>Phenomenology and the Cognitive\nSciences</em>, 18(5), 799–818.",
                "Haarmeier, T., Thier, P., Repnow, M. and D. Petersen, 1997,\n“False Perception of Motion in a Patient Who Cannot Compensate\nfor Eye Movements”, <em>Nature</em>, 389: 849–851.",
                "Harris, C.S., 1965, “Perceptual Adaptation to Inverted,\nReversed, and Displaced Vision”, <em>Psychological Review</em>,\n72(6): 419–444.",
                "–––, 1980, “Insight or Out of Sight? Two\nExamples of Perceptual Plasticity in the Human Adult”,\n<em>Visual Coding and Adaptability</em>, C.S. Harris (ed.), pp.\n95–149.",
                "Hatfield, G.C., 1990, <em>The Natural and the Normative: Theories\nof Spatial Perception from Kant to Helmholtz</em>, Cambridge, MA: MIT\nPress.",
                "Hatfield, G.C. and W. Epstein, 1979, “The Sensory Core and\nthe Medieval Foundations of Early Modern Perceptual Theory”,\n<em>Isis</em>, 70(3): 363–384.",
                "Hay, J.C., H.L. Pick, Jr., and K. Ikeda, 1965, “Visual\nCapture Produced by Prism Spectacles”, <em>Psychonomic\nScience</em>, 2: 215–216.",
                "Hein, A. and R. Held, 1962, “A Neural Model for Labile\nSensorimotor Coordinations”, in <em>Biological Prototypes and\nSynthetic Systems</em> (Volume 1), E. Bernard and M. Kare (eds.), New\nYork: Plenum Press, pp. 71–74.",
                "Held, R., 1961, “Exposure-History as a Factor in Maintaining\nStability of Perception and Coordination”, <em>The Journal of\nNervous and Mental Disease</em>, 132(1): 26–32.",
                "–––, 1965, “Plasticity in Sensory-Motor\nSystems”, <em>Scientific American</em>, 213: 84–94.",
                "Held, R. and J. Bossom, 1961, “Neonatal Deprivation and\nAdult Rearrangement: Complementary Techniques for Analyzing Plastic\nSensory-Motor Coordinations”, <em>Journal of Comparative and\nPhysiological Psychology</em>, 54(1): 33–37.",
                "Held, R. and A. Hein, 1958, “Adaptation of Disarranged\nHand-Eye Coordination Contingent upon Re-Afferent Stimulation”,\n<em>Perceptual and Motor Skills</em>, 8: 87–90.",
                "–––, 1963, “Movement-Produced Stimulation\nin the Development of Visually Guided Behavior”, <em>Journal of\nComparative and Physiological Psychology</em>, 56: 872–876.",
                "Helmholtz, H, 2005 [1924], <em>Treatise on Physiological\nOptics</em> (Volume 3), New York: Dover.",
                "Hering, E., 1861, <em>Beiträge zur Physiologie</em> (Volume\n1), Leipzig: Engelman. (Reissued with an introduction by B. Bridgeman,\nBerlin: Springer, 1990).",
                "Hickerson, R., 2007, “Perception as Knowing How to Act: Alva\nNoë’s <em>Action In Perception</em>”,\n<em>Philosophical Psychology</em>, 20(4): 505–517.",
                "Hill, C., 2022, <em>Perceptual Experience.</em> Oxford: Oxford\nUniversity Press.",
                "von Holst, E., 1954, “Relations Between the Central Nervous\nSystem and the Peripheral Organs”, <em>The British Journal of\nAnimal Behaviour</em>, 2(3): 89–94.",
                "von Holst, E. and H. Mittelstädt, 1950, “<em>Das\nReafferenzprinzip, Wechselwirkungen zwischen Zerntalnervensystem und\nPeripherie</em>”, <em>Naturwissenschaften</em>, 27:\n464–476.",
                "Hopp, W., 2013, “No Such Look: Problems with the Dual\nContent Theory”, <em>Phenomenology and the Cognitive\nSciences</em>, 12(4): 813–833.",
                "Howard, I.P., B. Craske, and W.B. Templeton, 1965,\n“Visuomotor Adaptation to Discordant Exafferent\nStimulation”, <em>Journal of Experimental Psychology</em>,\n70(2): 189–191.",
                "Howard, I.P. and W.B. Templeton, 1966, <em>Human Spatial\nOrientation</em>, New York: Wiley.",
                "Hurley, S.L., 1998, <em>Consciousness in Action</em>, Cambridge,\nMA: Harvard University Press.",
                "Hurley, S.L. and A. Noë, 2003, “Neural Plasticity and\nConsciousness”, <em>Biology and Philosophy</em>, 18:\n131–168.",
                "Hutto, D. D., and Myin, E., 2017. <em>Evolving enactivism: Basic\nMinds Meet Content</em>. Cambridge, MA: MIT Press.",
                "Jeannerod, M., 2006, <em>Motor Cognition: What Actions Tell the\nSelf</em>, Oxford: Oxford University Press.",
                "Jékely, G., Godfrey-Smith, P., and Keijzer, F., 2021,\n“Reafference and the Origin of the Self in Early Nervous System\nEvolution”, <em>Phil. Trans. R. Soc. B</em> 376: 20190764.",
                "Kiverstein, J., 2010, “Sensorimotor Knowledge and the\nContents of Experience”, in Gangopadhyay et al. 2010:\n257–274.",
                "Kravitz, J. and H. Wallach, 1966, “Adaptation to Displaced\nVision Contingent upon Vibrating Stimulation”, <em>Psychonomic\nScience</em>, 6: 465–466.",
                "Kuhn, T.S., 2012 [1962], <em>The Structure of Scientific\nRevolutions</em>, Chicago: University of Chicago Press.",
                "Lande, K., 2018, “The Perspectival Character of\nPerception”, <em>The Journal of Philosophy</em>, 115(4):\n187–214.",
                "Lhermitte, F., 1983, “Utilization Behaviour and its Relation\nto Lesions of the Frontal Lobes”, <em>Brain</em>, 106(2):\n237–255.",
                "Linton, P., 2021, “Conflicting Shape Percepts Explained by\nPerception Cognition Distinction”, <em>Proceedings of the\nNational Academy of Sciences of the United States of America</em>,\n118(10), Article e2024195118.",
                "Locke, J., 1690, <em>An Essay Concerning Human Understanding</em>,\nP. Nidditch (ed.), New York: Oxford University Press, 1979.",
                "Loomis, J.M., 1992, “Distal Attribution and Presence”,\n<em>Presence: Teleoperators and Virtual Environments</em>, 1(1):\n113–119.",
                "Lotze, H., 1887 [1879], <em>Metaphysics, in Three Books: Ontology,\nCosmology, and Psychology</em> (Volume 2), B. Bosanquet (trans.),\nOxford: Clarendon.",
                "Mach, E., 1897 [1886], <em>Contributions to the Analysis of the\nSensations</em>, C.M. Williams (trans.), Chicago: Open Court,\n1897.",
                "Mack, A., 1979, “Non-Visual Determinants of\nPerception”, <em>Behavioral and Brain Sciences</em>, 2(1):\n75–76.",
                "MacKay, D.M., 1973, “Visual Stability and Voluntary Eye\nMovements”, in <em>Central Processing of Visual Information A:\nIntegrative Functions and Comparative Data</em>, Berlin: Springer, pp.\n307–331.",
                "Mandik, P., 2005, “Action-Oriented Representation”, in\n<em>Cognition and the Brain: The Philosophy and Neuroscience\nMovement</em>, K. Akins and A. Brook (eds.), Cambridge: Cambridge\nUniversity Press.",
                "Mandrigin, A., 2021, “The Where of Bodily Awareness”,\n<em>Synthese</em>, 198(3): 1887–1903.",
                "Mather, J. and J. Lackner, 1975, “Adaptation to Visual\nRearrangement Elicited by Tonic Vibration Reflexes”,\n<em>Experimental Brain Research</em>, 24: 103–105.",
                "Matthen, M., 1988, “Biological Functions and Perceptual\nContent”, <em>Journal of Philosophy</em>, 85: 5–27.",
                "McLaughlin, B.P., 2016. “The Skewed View from Here: Normal\nGeometrical Misperception”, <em>Philosophical Topics</em>,\n44(2): 231–299.",
                "Melamed, L., M. Halay, and J. Gildow, 1973, “Effect of\nExternal Target Presence on Visual Adaptation with Active and Passive\nMovement”, <em>Journal of Experimental Psychology</em>, 98:\n125–130.",
                "Merriam, E.P. and C. Colby, 2005, “Active Vision in Parietal\nand Extrastriate Cortex”, <em>The Neuroscientist</em>, 11:\n484–493.",
                "Merriam, E.P., C.R. Genovese, and C.L. Colby, 2007,\n“Remapping in Human Visual Cortex”, <em>Journal of\nNeurophysiology</em>, 97(2): 1738–1755.",
                "Mill, J.S., 1842, “Bailey on Berkeley’s Theory of\nVision”, <em>Westminster Review</em>, 38: 318–336.",
                "–––, 1843, “Rejoinder to Mr.\nBailey’s Reply”, <em>Westminster Review</em>, 39:\n491–494.",
                "Miller, J. and L. Festinger, 1977, “Impact of Oculomotor\nRetraining on the Visual Perception of Curvature”, <em>Journal\nof Experimental Psychology: Human Perception and Performance</em>,\n3(2): 187–200.",
                "Milner, A.D. and M.A. Goodale, 1995, <em>The Visual Brain in\nAction</em>, Oxford: Oxford University Press, 2<sup>nd</sup> edition,\n2006.",
                "–––, 2008, “Two Visual Systems\nRe-viewed”, <em>Neuropsychologia</em>, 46: 774–785.",
                "Mittelstädt, H., 1971, <em>Reafferenzprinzip—Apologie\nund Kritik</em>, in <em>Vorträge der Erlanger\nPhysiologentagung</em>, Berlin: Springer, pp. 161–171.",
                "Mon-Williams, M., J.R. Tresilian, A. Plooy, J.P. Wann, and J.\nBroerse, 1997, “Looking at the Task in Hand: Vergence Eye\nMovements and Perceived Size”, <em>Experimental Brain\nResearch</em>, 117(3): 501–506.",
                "Morales, J., Bax, A. and Firestone, C., 2020, “Sustained\nRepresentation of Perspectival Shape”, <em>Proceedings of the\nNational Academy of Sciences</em>, 117(26): 14873–14882.",
                "Morales, J. and Firestone, C., 2023. “Empirical Evidence for\nPerspectival Similarity”, <em>Psychological Review</em>. Advance\nonline publication. doi:10.1037/rev0000403",
                "Moulden, B., 1971, “Adaptation to Displaced Vision:\nReafference is a Special Case of the Cue-Discrepancy\nHypothesis”, <em>The Quarterly Journal of Experimental\nPsychology</em>, 23: 113–117.",
                "Nakamura, K. and C. Colby, 2002, “Updating of the Visual\nRepresentation in Monkey Striate and Extrastriate Cortex during\nSaccades”, <em>Proceedings of the National Academy of\nSciences</em>, 99(6): 4026–4031.",
                "Nanay, B., 2013, <em>Between Perception and Action,</em> Oxford:\nOxford University Press.",
                "Nave, K., Deane, G., Miller, M. and Clark, A., 2022.\n“Expecting Some Action: Predictive Processing and the\nConstruction of Conscious Experience”, <em>Review of Philosophy\nand Psychology</em>, pp.1–19.",
                "Noë, A., 2004, <em>Action in Perception</em>, Cambridge, MA:\nMIT Press.",
                "–––, 2005, “Real Presence”,\n<em>Philosophical Topics</em>, 33: 235–264.",
                "–––, 2009, <em>Out of our Heads</em>, New York:\nHill and Wang.",
                "–––, 2010, “Vision without\nRepresentation”, in Gangopadhyay et al. 2010::\n245–256.",
                "O’Regan, J.K., 2011, <em>Why Red Doesn’t Sound Like a\nBell: Explaining the Feel of Consciousness</em>, Oxford: Oxford\nUniversity Press.",
                "O’Regan, J.K. and A. Noë, 2001, “A Sensorimotor\nAccount of Vision and Visual Consciousness”, <em>Behavioral and\nBrain Sciences</em>, 24: 939–973.",
                "Palmer, S.E., 1999, <em>Vision Science: Photons to\nPhenomenology</em>, Cambridge, MA: MIT Press.",
                "Poincaré, H., 1907, <em>La Science et\nL'Hypothése</em>, Paris: Flammarion.",
                "Post, R.B. and H.W. Leibowitz, 1985, “A Revised Analysis of\nthe Role of Efference in Motion Perception”,\n<em>Perception</em>, 14(5): 631–643.",
                "Pouget, A., S. Deneve, and J.-R., Duhamel, 2002, “A\nComputational Perspective on the Neural Basis of Multisensory Spatial\nRepresentation”, <em>Nature Reviews: Neuroscience</em>, 3:\n741–747.",
                "Price, H.H., 1950, <em>Perception</em>, London: Methuen,\n2<sup>nd</sup> edition.",
                "Prinz, J.J., 2006, “Putting the Brakes on Enactive\nPerception”, <em>Psyche</em>, 12: 1–19.",
                "–––, 2009, “Is Consciousness\nEmbodied?” in <em>The Cambridge Handbook of Situated\nCognition</em>, P. Robbins and M. Aydede (eds.), Cambridge: Cambridge\nUniversity Press, pp. 419–436.",
                "Proffitt, D., 2006, “Embodied Perception and the Economy of\nAction”, <em>Perspectives on Psychological Science</em>, 1:\n110–122.",
                "–––, 2008. “An Action-specific Approach to\nSpatial Perception”, in <em>Embodiment, Ego-space, and\nAction</em>, R. Klatzky, B. MacWhinney, and M. Berhmann (eds.),\nMahwah, NJ: Erlbaum, pp. 179–202.",
                "Purkyně, J., 1825, “<em>Über die Scheinbewegungen,\nwelche im subjectiven Umfang des Gesichtsinnes vorkommen</em>”,\n<em>Bulletin der naturwessenschaftlichen Sektion der Schlesischen\nGesellschaft</em>, 4: 9–10.",
                "Reid, T., 1785, <em>Essays on the Intellectual Powers of Man</em>,\nCambridge, MA: MIT Press, 1969.",
                "Rizzolatti, G., 2008, <em>Mirrors in the Brain</em>, New York:\nOxford University Press.",
                "Rock, I., 1966, <em>The Nature of Perceptual Adaptation</em>, New\nYork: Basic Books.",
                "Rock, I. and C.S. Harris, 1967, “Vision and Touch”,\n<em>Scientific American</em>, 216: 96–107.",
                "Russell, B., 1918, “The Philosophy of Logical\nAtomism”, in <em>Logic and Knowledge</em>, London: Allen and\nUnwin, 1956, pp. 177–281.",
                "Sampaio, E., S. Maris, and P. Bach-y-Rita, 2001, “Brain\nPlasticity: ‘Visual’ Acuity of Blind Persons via the\nTongue”, <em>Brain Research</em>, 908: 204–207.",
                "Schellenberg, S., 2007. “Action and Self-location in\nPerception.” <em>Mind</em>, 116(463): 603–632.",
                "–––, 2010. “Perceptual Experience and the\nCapacity to Act”, in <em>Perception, Action, and Consciousness:\nSensorimotor Dynamics and Two visual Systems</em>, N. Gangopadhyay, M.\nMadary, and F. Spicer (eds.), Oxford: Oxford University Press, pp.\n145–160.",
                "Schwitzgebel, E., 2006, “Do Things Look Flat?”\n<em>Philosophy &amp; Phenomenological Research</em>, 72:\n589–599.",
                "Shams, L. and R. Kim, 2010, “Crossmodal Influences on Visual\nPerception”, <em>Physics of Life Reviews</em>, 7(3):\n269–284.",
                "Shebilske, W.L., 1984, “Context Effects and Efferent Factors\nin Perception and Cognition”, in <em>Cognition and Motor\nProcesses</em>, W. Prinz and A.F. Sanders (eds.), Berlin:\nSpringer-Verlag, pp. 99–119.",
                "–––, 1987, “An Ecological Efference\nMediation Theory of Natural Event Perception”, in\n<em>Perspectives on Perception and Actions</em>, H. Heuer and A.F.\nSanders (eds.), Hillsdale, NJ: Erlbaum, pp. 195–213.",
                "Sherrington, C.S., 1918, “Observations on the Sensual Role\nof the Proprioceptive Nerve Supply of the Extrinsic Ocular\nMuscles”, <em>Brain</em>, 41: 332–343.",
                "Siegel, S., 2014. “Affordances and the Contents of\nPerception”, in <em>Does Perception Have Content?</em>, Berit\nBrogaard (ed.), Oxford: Oxford University Press, pp. 39–76.",
                "Siegle, J.H. and W.H. Warren, 2010, “Distal Attribution and\nDistance Perception in Sensory Substitution”,\n<em>Perception</em>, 39(2): 208–223.",
                "Simmons, A., 2003, “Spatial Perception from a Cartesian\nPoint of View”, <em>Philosophical Topics</em>, 31(1/2):\n395–423.",
                "Singer, G. and R. Day, 1966, “Spatial Adaptation and\nAftereffect with Optically Transformed Vision: Effects of Active and\nPassive Responding and the Relationship between Test and Exposure\nResponses”, <em>Journal of Experimental Psychology</em>, 71:\n725–731.",
                "Smith, A., 1811, <em>The Works of Adam Smith</em> (Volume 5), D.\nStewart. (ed.), London: T. Cadell and W. Davies.",
                "Smith, A.D., 2000, “Space and Sight”, <em>Mind</em>,\n109: 481–518.",
                "Sperry, R.W., 1952, “Neurology and the Mind-Brain\nProblem”, <em>American Scientist</em>, 291–312.",
                "Springle, A., &amp; Machamer, P., 2016, “Perceiving and\nKnowing as Activities” in <em>Philosophy as the Foundation of\nKnowledge, Action and Ethos</em>, J. Kaczmarek, R. Kleszcz (eds.),\nLodz: Lodz University Press, pp. 39–54.",
                "Stewart, D., 1829, <em>Elements of the Philosophy of the Human\nMind</em>, in <em>The Collected Works of Dugald Stewart</em> (Volume\n2), W. Hamilton (ed.), Westmead, UK: Gregg International Publishers,\n1971.",
                "Stoneham, T., 2020, “Action, Knowledge and Embodiment in\nBerkeley and Locke”, <em>Philosophical Explorations</em>, 21(1):\n41–59.",
                "Stratton, G.M., 1896, “Some Preliminary Experiments on\nVision without Inversion of the Retinal Image”,\n<em>Psychological Review</em>, 3: 611–617.",
                "–––, 1897(a and b), “Vision Without\nInversion of the Retinal Image”, <em>Psychological Review</em>,\n4(4): 341–360 and 4(5)463–481.",
                "–––, 1899, “The Spatial Harmony of Touch\nand Sight”, <em>Mind</em>, 8: 492–505.",
                "–––, 1907, “Eye-Movements and Visual\nDirection”, <em>Psychological Bulletin</em>, 4:\n155–158.",
                "Taylor, J.G., 1962, <em>The Behavioral Basis of Perception</em>,\nNew Haven, CT: Yale University Press.",
                "–––, 1965, “The Behavioral Basis of\nPerceived Size and Distance”, <em>Canadian Journal of\nPsychology</em>, 19(1): 1–14.",
                "–––, 1968, “Perception as a Function of\nBehaviour”, <em>Studies in Logic and the Foundations of\nMathematics</em>, 52: 431–436.",
                "Templeton, W., I. Howard, and A. Lowman, 1966, “Passively\nGenerated Adaptation to Prismatic Distortion”, <em>Perceptual\nand Motor Skills</em>, 22: 140–142.",
                "Thompson, E., 2005, “Sensorimotor Subjectivity and the\nEnactive Approach to Experience”, <em>Phenomenology and the\nCognitive Sciences</em>, 4(4): 407–427.",
                "Uhlarik, J.J. and L.K. Canon, 1971, “Influence of Concurrent\nand Terminal Exposure Conditions on the Nature of Perceptual\nAdaptation”, <em>Journal of Experimental Psychology</em>, 91:\n233–239.",
                "de Vignemont, F., 2021. “A Minimal Sense of\nHere-ness”, <em>The Journal of Philosophy</em>, 118(4):\n169–187.",
                "de Vignemont, F. and Alsmith, A. eds., 2017, <em>The\nSubject’s Matter: Self-Consciousness and the Body</em>,\nCambridge, MA: MIT Press.",
                "Vishton, P.M., N.J. Stephens, L.A. Nelson, S.E. Morra, K.L.\nBrunick, and J.A. Stevens, 2007, “Planning to Reach for an\nObject Changes How the Reacher Perceives It”, <em>Psychological\nScience</em>, 18: 713–719.",
                "Wallach, H., 1968, “Informational Discrepancy as a Basis of\nPerceptual Adaptation”, in <em>The Neuropsychology of Spatially\nOriented Behaviour</em>, S. Friedman (ed.), Homewood, IL: Dorsey, pp.\n209–230.",
                "Ward, D., Roberts, T. and Clark, A., 2011, “Knowing What We\nCan Do: Actions, Intentions, and the Construction of Phenomenal\nExperience”, <em>Synthese</em>, 181: 375–394.",
                "Welch, R., 1978, <em>Perceptual Modification: Adapting to Altered\nSensory Environments</em>, New York: Academic Press.",
                "Wu, W., 2014, “Against Division: Consciousness, Information\nand the Visual Streams”, <em>Mind &amp; Language</em>, 29(4):\n383–406."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Abbott, T.K., 1864, <em>Sight and Touch: An Attempt to Disprove\nthe Received (or Berkeleian) Theory of Vision</em>, London: Longman\n&amp; Co.</li>\n<li>Alsmith, A., 2021,“The Structure of Egocentric Space”,\nIn <em>The World at Our Fingertips: A Multidisciplinary Exploration of\nPeripersonal Space</em>, F. de Vignemont, H.Y. Wong, A. Farné\nand A. Serino (eds.), Oxford: Oxford University Press.</li>\n<li>Alsmith, A. and F. de Vignemont, 2012, “Embodying the Mind\nand Representing the Body”, <em>Review of Philosophy and\nPsychology</em>, 3(1): 1–13.</li>\n<li>Armstrong, D.M., 1960, <em>Berkeley's theory of vision</em>,\nParkville: Melbourne University Press.</li>\n<li>Atherton, M., 2005, “Berkeley’s Theory of Vision and\nIts Reception”, in <em>The Cambridge Companion to Berkeley</em>,\nNew York: Cambridge University Press, pp. 94–124.</li>\n<li>Austin, J.L., 1962, <em>Sense and Sensibilia</em>, Oxford:\nClarendon.</li>\n<li>Bach-y-Rita, P., 1972, <em>Brain Mechanisms in Sensory\nSubstitution</em>, New York: Academic Press.</li>\n<li>–––, 2004, “Tactile Sensory Substitution\nStudies”, <em>Annals of the New York Academy of Sciences</em>,\n1013: 83–91.</li>\n<li>Bach-y-Rita, P. and S.W. Kercel, 2003, “Sensory Substitution\nand the Human–Machine Interface”, <em>Trends in Cognitive\nSciences</em>, 7(12): 541–546.</li>\n<li>Bailey, S., 1842, <em>A Review of Berkeley’s Theory of\nVision, Designed to Show the Unsoundness of That Celebrated\nSpeculation</em>, London: James Ridgway.</li>\n<li>Bain, A., 1855, <em>The Senses and the Intellect</em>, New York:\nAppleton.</li>\n<li>–––, 1868, <em>Mental and Moral Science</em>,\nLondon: Longmans, Green, and Co.</li>\n<li>Bell, C., 1823, “Idea of a New Anatomy of the Brain”,\nin <em>Francois Magendie, Charles Bell and the Course of the Spinal\nNerves</em>, P. Cranefield (ed.), Mt. Kisco, NY: Futura, 1974.</li>\n<li>Bennett, D. J., 2011, “How the World is Measured Up in Size\nExperience”, <em>Philosophy and Phenomenological Research</em>,\n83: 345–365.</li>\n<li>Bennett, D.J., 2012, “Seeing Shape: Shape Appearances and\nShape Constancy”, <em>British Journal for the Philosophy of\nScience,</em> 63(3): 487–518.</li>\n<li>Berendzen, J.C., 2023, <em>Embodied Idealism: Merleau-Ponty's\nTranscendental Philosophy</em>, Oxford: Oxford University Press.</li>\n<li>Berkeley, G., 1709, “An Essay Towards a New Theory of\nVision”, in <em>Berkeley: Philosophical Writings</em>, D. Clarke\n(ed.), Cambridge: Cambridge University Press, 2008.</li>\n<li>–––, 1734, <em>A Treatise Concerning the\nPrinciples of Human Knowledge</em>, K. Winkler (ed.), Indianapolis:\nHackett, 1982.</li>\n<li>Bermúdez, J.L., 2018, <em>The Bodily Self</em>, Cambridge,\nMA: MIT Press.</li>\n<li>Block, N., 2005, “Review of <em>Action in\nPerception</em>”, <em>Journal of Philosophy</em>, 102:\n259–272.</li>\n<li>–––, 2012, “Discussion of J. Kevin\nO’Regan’s <em>Why Red Doesn’t Sound Like a Bell:\nUnderstanding the Feel of Consciousness</em>”, <em>Review of\nPhilosophy and Psychology</em>, 3: 89–108.</li>\n<li>Bridgeman, B., 1981, “Cognitive Factors in Subjective\nStabilization of the Visual World”, <em>Acta Psychologica</em>,\n48: 111–121.</li>\n<li>–––, 2010, “Space Constancy: The Rise and\nFall of Perceptual Compensation”, in <em>Space and Time in\nPerception and Action</em>, pp. 94–108.</li>\n<li>Bridgeman, B., D. Hendry, and L. Stark, 1975, “Failure to\nDetect Displacement of the Visual World During Saccadic Eye\nMovements”, <em>Vision Res</em>, 15: 719–722.</li>\n<li>Bridgeman, B. and L. Stark, 1991, “Ocular Proprioception and\nEfference Copy in Registering Visual Direction”, <em>Vision\nRes</em>, 31: 1903–1913.</li>\n<li>Bridgeman B, A.H.C. van der Heijden, and B. Velichkovsky, 1994,\n“A Theory of Visual Stability Across Saccadic Eye\nMovements”, <em>Behavioral and Brain Sciences</em>, 17:\n247–292.</li>\n<li>Briscoe, R., 2008, “Vision, Action, and\nMake-Perceive”, <em>Mind and Language</em>, 23:\n457–497.</li>\n<li>–––, 2009, “Egocentric Spatial\nRepresentation in Action and Perception”, <em>Philosophy and\nPhenomenological Research</em>, 79: 423–460.</li>\n<li>–––, 2014, “Spatial Content and Motoric\nSignificance”, <em>Avant</em> 2 (<em>Enactivism: Arguments and\nApplications</em>): 199–216.</li>\n<li>–––, 2016. “Multisensory Processing and\nPerceptual Consciousness: Part I”, <em>Philosophy Compass</em>\n11(2): 121–133</li>\n<li>–––, 2019, “Bodily Action and Distal\nAttribution in Sensory Substitution”, in <em>Sensory\nSubstitution and Augmentation</em>, F. Macpherson (ed.), Oxford\nUniversity Press, Proceedings of the British Academy Series, pp.\n173–186.</li>\n<li>–––, 2021. “Bodily Awareness and Novel\nTypes of Multisensory Features”, in <em>Between Vision and\nAction</em>, a special issue of <em>Synthese</em>, 198,\n3913–3941, edited by G. Ferretti and S. Zipoli Caiani.</li>\n<li>Briscoe, R. and J. Schwenkler, 2015, “Conscious Vision in\nAction”, <em>Cognitive Science</em> 39: 1435–1467.</li>\n<li>Broad, C.D., 1923, <em>Scientific Thought</em>, C.K. Ogden (ed.),\nNew York: Harcourt, Brace.</li>\n<li>Bruce, V., P. Greene, and M. Georgeson, 2003, <em>Visual\nPerception: Physiology, Psychology and Ecology</em>, London:\nPsychology Press, 4th edition.</li>\n<li>Brune, F. and C.H. Lücking, 1969, “<em>Okulomotorik,\nBewegungswahrnehmung and Raumkonstanz der Sehdinge</em>”,\n<em>Der Nervenarzt</em>, 40: 692–700.</li>\n<li>Burge, J., &amp; Burge, T., 2022, “Shape, Perspective, and\nWhat Is and Is Not Perceived: Comment on Morales, Bax, and Firestone\n(2020)”, <em>Psychological Review</em>. Advance online\npublication. doi:10.1037/rev0000363</li>\n<li>Chemero, A. 2011, <em>Radical Embodied Cognitive Science</em>,\nCambridge, MA: MIT Press.</li>\n<li>Cheng, T., Lin, Y. and Wu, C.W., 2022. “Perspectival Shapes\nare Viewpoint-dependent Relational Properties”,\n<em>Psychological Review</em>. Advance online publication.\ndoi:10.1037/rev0000404</li>\n<li>Clark, A., 2009, <em>Supersizing the Mind</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Colby, C.L., J. Duhamel, and M.E. Goldberg, 1995,\n“Oculocentric Spatial Representation in Parietal Cortex”,\n<em>Cerebral Cortex</em>, 5: 470–481.</li>\n<li>Colby, C.L. and M.E. Goldberg, 1992, “The Updating of the\nRepresentation of Visual Space in Parietal Cortex by Intended Eye\nMovements”, <em>Science</em>, 255(5040): 90–92.</li>\n<li>Condillac, E., 1746, <em>Essay on the Origin of Human\nKnowledge</em>, H. Aarsleff (ed.), Cambridge: Cambridge University\nPress, 2001.</li>\n<li>–––, 1754, <em>Treatise on the Sensations</em>,\nG. Carr (trans.), London: Favil, 1930.</li>\n<li>Coren, S., 1986, “An Efferent Component in the Visual\nPerception of Direction and Extent”, <em>Psychological\nReview</em>, 93(4): 391–410.</li>\n<li>Coren, S. and P. Hoenig, 1972, “Effect of Non-Target Stimuli\nupon the Length of Voluntary Saccades”, <em>Perceptual and\nMotor</em> Skills, 34: 499–508.</li>\n<li>Creem‐Regehr, S.H. and Kunz, B.R., 2010. “Perception\nand Action”; <em>Wiley Interdisciplinary Reviews: Cognitive\nScience</em>, 1(6): 800–810.</li>\n<li>Cutting, J.E. and P.M. Vishton, 1995, “Perceiving Layout and\nKnowing Distances”, in <em>Perception of Space and Motion</em>,\nW. Epstein and S. Rogers (eds.), San Diego, CA: Academic Press, pp.\n69–117.</li>\n<li>Deubel, H., 2004, “Localization of Targets Across Saccades:\nRole of Landmark Objects”, <em>Visual Cognition</em>,\n11(2–3): 173–202.</li>\n<li>Deubel, H., W.X. Schneider, and B. Bridgeman, 2002,\n“Transsaccadic Memory of Position and Form”, <em>Progress\nin Brain Research</em>, 140: 165–180.</li>\n<li>Dewey, J., 1891, <em>Psychology</em>, New York: American Book\nCompany.</li>\n<li>Drayson, Z., 2017, “What is Action-oriented\nPerception?”, <em>Logic, Methodology and Philosophy of Science:\nProceedings of the 15th International Congress</em>, pp.\n1–14.</li>\n<li>Duhamel, J., C. Colby, and M. E. Goldberg, 1992, “The\nUpdating of the Representation of Visual Space in Parietal Cortex by\nIntended Eye Movements”, <em>Science</em>, 255:\n90–92.</li>\n<li>Ebenholtz, S., 2002, <em>Oculomotor Systems and Perception</em>,\nCambridge: Cambridge University Press.</li>\n<li>Emmert, E., 1881, “<em>Größenverhältnisse\nder Nachbilder</em>”, <em>Klinische Monatsblätter für\nAugenheilkunde und für augenärztliche Fortbildung</em>, 19:\n443–450.</li>\n<li>Epstein, W., 1967, <em>Varieties of Perceptual Learning</em>, New\nYork: McGraw Hill.</li>\n<li>Epstein, W., B. Hughes, S.L. Schneider, and P. Bach-y-Rita, 1986,\n“Is There Anything Out There? A Study of Distal Attribution in\nResponse to Vibrotactile Stimulation”, <em>Perception</em>, 15:\n275–284</li>\n<li>Ernst, M., 2012, “Optimal Multisensory Integration:\nAssumptions and Limits”, in <em>The New Handbook of Multisensory\nProcessing</em>, B. Stein, (ed.), Cambridge, MA: MIT Press, pp.\n527–544.</li>\n<li>Evans, G., 1982, <em>The Varieties of Reference</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 1985, “Molyneux’s\nQuestion”, in <em>The Collected Papers of Gareth Evans</em>, A.\nPhillips (ed.), London: Oxford University Press.</li>\n<li>Falkenstein, L., 1994, “Intuition and Construction in\nBerkeley's Account of Visual Space”, <em>Journal of the History\nof Philosophy</em>, 32(1): 63–84.</li>\n<li>Ferretti, G., 2021, “Visual Phenomenology Versus Visuomotor\nImagery: How Can We be Aware of Action Properties?”,\n<em>Synthese</em>, 198, 3309–3338.</li>\n<li>Festinger, L., C.A. Burnham, H. Ono, and D. Bamber, 1967,\n“Efference and the Conscious Experience of Perception”,\n<em>Journal of Experimental Psychology Monographs</em>, 74(4, Pt 2):\n1–36.</li>\n<li>Findlay, J.M., 1982, “Global Visual Processing for Saccadic\nEye Movements”, <em>Vision Research</em>, 22(8):\n1033–1045.</li>\n<li>Firestone, C., 2013, “How ‘Paternalistic’ is\nSpatial Perception? Why Wearing a Heavy Backpack\nDoesn’t—and Couldn’t—Make Hills Look\nSteeper”, <em>Perspectives on Psychological science</em>, 8(4):\n455–473.</li>\n<li>Fischer, E., H.H. Bülthoff, N.K. Logothetis, and A. Bartels,\n2012, “Human Areas V3A and V6 Compensate for Self-Induced Planar\nVisual Motion”, <em>Neuron</em>, 73(6): 1228–1240.</li>\n<li>Fishkin, S., 1969, “Passive vs. Active Exposure and Other\nVariables Related to the Occurrence of Hand Adaptation to Lateral\nDisplacement”, <em>Perceptual and Motor Skills</em>, 29:\n291–297.</li>\n<li>Frith, C.D. and D.M. Wolpert, 2000, “Abnormalities in the\nAwareness and Control of Action”, <em>Philosophical Transactions\nof the Royal Society B: Biological Sciences</em>, 355(1404):\n1771–1788.</li>\n<li>Furman, M. and M. Gur, 2012, “And Yet it Moves: Perceptual\nIllusions and Neural Mechanisms of Pursuit Compensation During Smooth\nPursuit Eye Movements”, <em>Neuroscience &amp; Biobehavioral\nReviews</em>, 36(1): 143–151.</li>\n<li>Gangopadhyay, N., M. Madary, and F. Spicer, 2010, <em>Perception,\nAction, and Consciousness: Sensorimotor Dynamics and Two Visual\nSystems</em>, Oxford: Oxford University Press.</li>\n<li>Ganz, L., 1975, “Orientation in Visual Space by Neonates and\nits Modification by Visual Deprivation”, in <em>The\nDevelopmental Neuropsychology of Sensory Deprivation</em>, A. Riesen\n(ed.), New York: Academic Press, pp. 169–210.</li>\n<li>Gibson, J.J., 1933, “Adaptation, After-Effect and Contrast\nin the Perception of Curved Lines”, <em>Journal of Experimental\nPsychology</em>, 16(1): 1–31.</li>\n<li>–––, 1966, <em>The Senses Considered as\nPerceptual Systems</em>, Boston, MA: Houghton Mifflin.</li>\n<li>–––, 1979, <em>The Ecological Approach to Visual\nPerception</em>, Boston, MA: Houghton Mifflin.</li>\n<li>Goodale, M.A. and A.D. Milner, 2004, <em>Sight Unseen: An\nExploration of Conscious and Unconscious Vision</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Green, E.J., 2022, “The Puzzle of Cross‐modal Shape\nExperience.” <em>Noûs</em>, 56(4): 867–896.</li>\n<li>Green, E.J. and Schellenberg, S., 2018, “Spatial Perception:\nThe Perspectival Aspect of Perception.” <em>Philosophy\nCompass</em>, 13(2), p.e12472.</li>\n<li>Grush, R., 2000, “Self, World and Space: The Meaning and\nMechanisms of Ego- and Allocentric Spatial Representation”,\n<em>Brain and Mind</em>, 1: 59–92.</li>\n<li>–––, 2007, “Skill Theory v2.0:\nDispositions, Emulation, and Spatial Perception”,\n<em>Synthese</em>, 159: 389–416.</li>\n<li>–––, 2009, “Space, time, and\nobjects”, <em>The Oxford Handbook of Philosophy and\nNeuroscience</em>, John Bickle(ed), New York, NY: Oxford University\nPress, pp. 311–345.</li>\n<li>Grush, R., and Springle, A. 2019, “Agency, Perception,\nSpace, and Subjectivity”, <em>Phenomenology and the Cognitive\nSciences</em>, 18(5), 799–818.</li>\n<li>Haarmeier, T., Thier, P., Repnow, M. and D. Petersen, 1997,\n“False Perception of Motion in a Patient Who Cannot Compensate\nfor Eye Movements”, <em>Nature</em>, 389: 849–851.</li>\n<li>Harris, C.S., 1965, “Perceptual Adaptation to Inverted,\nReversed, and Displaced Vision”, <em>Psychological Review</em>,\n72(6): 419–444.</li>\n<li>–––, 1980, “Insight or Out of Sight? Two\nExamples of Perceptual Plasticity in the Human Adult”,\n<em>Visual Coding and Adaptability</em>, C.S. Harris (ed.), pp.\n95–149.</li>\n<li>Hatfield, G.C., 1990, <em>The Natural and the Normative: Theories\nof Spatial Perception from Kant to Helmholtz</em>, Cambridge, MA: MIT\nPress.</li>\n<li>Hatfield, G.C. and W. Epstein, 1979, “The Sensory Core and\nthe Medieval Foundations of Early Modern Perceptual Theory”,\n<em>Isis</em>, 70(3): 363–384.</li>\n<li>Hay, J.C., H.L. Pick, Jr., and K. Ikeda, 1965, “Visual\nCapture Produced by Prism Spectacles”, <em>Psychonomic\nScience</em>, 2: 215–216.</li>\n<li>Hein, A. and R. Held, 1962, “A Neural Model for Labile\nSensorimotor Coordinations”, in <em>Biological Prototypes and\nSynthetic Systems</em> (Volume 1), E. Bernard and M. Kare (eds.), New\nYork: Plenum Press, pp. 71–74.</li>\n<li>Held, R., 1961, “Exposure-History as a Factor in Maintaining\nStability of Perception and Coordination”, <em>The Journal of\nNervous and Mental Disease</em>, 132(1): 26–32.</li>\n<li>–––, 1965, “Plasticity in Sensory-Motor\nSystems”, <em>Scientific American</em>, 213: 84–94.</li>\n<li>Held, R. and J. Bossom, 1961, “Neonatal Deprivation and\nAdult Rearrangement: Complementary Techniques for Analyzing Plastic\nSensory-Motor Coordinations”, <em>Journal of Comparative and\nPhysiological Psychology</em>, 54(1): 33–37.</li>\n<li>Held, R. and A. Hein, 1958, “Adaptation of Disarranged\nHand-Eye Coordination Contingent upon Re-Afferent Stimulation”,\n<em>Perceptual and Motor Skills</em>, 8: 87–90.</li>\n<li>–––, 1963, “Movement-Produced Stimulation\nin the Development of Visually Guided Behavior”, <em>Journal of\nComparative and Physiological Psychology</em>, 56: 872–876.</li>\n<li>Helmholtz, H, 2005 [1924], <em>Treatise on Physiological\nOptics</em> (Volume 3), New York: Dover.</li>\n<li>Hering, E., 1861, <em>Beiträge zur Physiologie</em> (Volume\n1), Leipzig: Engelman. (Reissued with an introduction by B. Bridgeman,\nBerlin: Springer, 1990).</li>\n<li>Hickerson, R., 2007, “Perception as Knowing How to Act: Alva\nNoë’s <em>Action In Perception</em>”,\n<em>Philosophical Psychology</em>, 20(4): 505–517.</li>\n<li>Hill, C., 2022, <em>Perceptual Experience.</em> Oxford: Oxford\nUniversity Press.</li>\n<li>von Holst, E., 1954, “Relations Between the Central Nervous\nSystem and the Peripheral Organs”, <em>The British Journal of\nAnimal Behaviour</em>, 2(3): 89–94.</li>\n<li>von Holst, E. and H. Mittelstädt, 1950, “<em>Das\nReafferenzprinzip, Wechselwirkungen zwischen Zerntalnervensystem und\nPeripherie</em>”, <em>Naturwissenschaften</em>, 27:\n464–476.</li>\n<li>Hopp, W., 2013, “No Such Look: Problems with the Dual\nContent Theory”, <em>Phenomenology and the Cognitive\nSciences</em>, 12(4): 813–833.</li>\n<li>Howard, I.P., B. Craske, and W.B. Templeton, 1965,\n“Visuomotor Adaptation to Discordant Exafferent\nStimulation”, <em>Journal of Experimental Psychology</em>,\n70(2): 189–191.</li>\n<li>Howard, I.P. and W.B. Templeton, 1966, <em>Human Spatial\nOrientation</em>, New York: Wiley.</li>\n<li>Hurley, S.L., 1998, <em>Consciousness in Action</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>Hurley, S.L. and A. Noë, 2003, “Neural Plasticity and\nConsciousness”, <em>Biology and Philosophy</em>, 18:\n131–168.</li>\n<li>Hutto, D. D., and Myin, E., 2017. <em>Evolving enactivism: Basic\nMinds Meet Content</em>. Cambridge, MA: MIT Press.</li>\n<li>Jeannerod, M., 2006, <em>Motor Cognition: What Actions Tell the\nSelf</em>, Oxford: Oxford University Press.</li>\n<li>Jékely, G., Godfrey-Smith, P., and Keijzer, F., 2021,\n“Reafference and the Origin of the Self in Early Nervous System\nEvolution”, <em>Phil. Trans. R. Soc. B</em> 376: 20190764.</li>\n<li>Kiverstein, J., 2010, “Sensorimotor Knowledge and the\nContents of Experience”, in Gangopadhyay et al. 2010:\n257–274.</li>\n<li>Kravitz, J. and H. Wallach, 1966, “Adaptation to Displaced\nVision Contingent upon Vibrating Stimulation”, <em>Psychonomic\nScience</em>, 6: 465–466.</li>\n<li>Kuhn, T.S., 2012 [1962], <em>The Structure of Scientific\nRevolutions</em>, Chicago: University of Chicago Press.</li>\n<li>Lande, K., 2018, “The Perspectival Character of\nPerception”, <em>The Journal of Philosophy</em>, 115(4):\n187–214.</li>\n<li>Lhermitte, F., 1983, “Utilization Behaviour and its Relation\nto Lesions of the Frontal Lobes”, <em>Brain</em>, 106(2):\n237–255.</li>\n<li>Linton, P., 2021, “Conflicting Shape Percepts Explained by\nPerception Cognition Distinction”, <em>Proceedings of the\nNational Academy of Sciences of the United States of America</em>,\n118(10), Article e2024195118.</li>\n<li>Locke, J., 1690, <em>An Essay Concerning Human Understanding</em>,\nP. Nidditch (ed.), New York: Oxford University Press, 1979.</li>\n<li>Loomis, J.M., 1992, “Distal Attribution and Presence”,\n<em>Presence: Teleoperators and Virtual Environments</em>, 1(1):\n113–119.</li>\n<li>Lotze, H., 1887 [1879], <em>Metaphysics, in Three Books: Ontology,\nCosmology, and Psychology</em> (Volume 2), B. Bosanquet (trans.),\nOxford: Clarendon.</li>\n<li>Mach, E., 1897 [1886], <em>Contributions to the Analysis of the\nSensations</em>, C.M. Williams (trans.), Chicago: Open Court,\n1897.</li>\n<li>Mack, A., 1979, “Non-Visual Determinants of\nPerception”, <em>Behavioral and Brain Sciences</em>, 2(1):\n75–76.</li>\n<li>MacKay, D.M., 1973, “Visual Stability and Voluntary Eye\nMovements”, in <em>Central Processing of Visual Information A:\nIntegrative Functions and Comparative Data</em>, Berlin: Springer, pp.\n307–331.</li>\n<li>Mandik, P., 2005, “Action-Oriented Representation”, in\n<em>Cognition and the Brain: The Philosophy and Neuroscience\nMovement</em>, K. Akins and A. Brook (eds.), Cambridge: Cambridge\nUniversity Press.</li>\n<li>Mandrigin, A., 2021, “The Where of Bodily Awareness”,\n<em>Synthese</em>, 198(3): 1887–1903.</li>\n<li>Mather, J. and J. Lackner, 1975, “Adaptation to Visual\nRearrangement Elicited by Tonic Vibration Reflexes”,\n<em>Experimental Brain Research</em>, 24: 103–105.</li>\n<li>Matthen, M., 1988, “Biological Functions and Perceptual\nContent”, <em>Journal of Philosophy</em>, 85: 5–27.</li>\n<li>McLaughlin, B.P., 2016. “The Skewed View from Here: Normal\nGeometrical Misperception”, <em>Philosophical Topics</em>,\n44(2): 231–299.</li>\n<li>Melamed, L., M. Halay, and J. Gildow, 1973, “Effect of\nExternal Target Presence on Visual Adaptation with Active and Passive\nMovement”, <em>Journal of Experimental Psychology</em>, 98:\n125–130.</li>\n<li>Merriam, E.P. and C. Colby, 2005, “Active Vision in Parietal\nand Extrastriate Cortex”, <em>The Neuroscientist</em>, 11:\n484–493.</li>\n<li>Merriam, E.P., C.R. Genovese, and C.L. Colby, 2007,\n“Remapping in Human Visual Cortex”, <em>Journal of\nNeurophysiology</em>, 97(2): 1738–1755.</li>\n<li>Mill, J.S., 1842, “Bailey on Berkeley’s Theory of\nVision”, <em>Westminster Review</em>, 38: 318–336.</li>\n<li>–––, 1843, “Rejoinder to Mr.\nBailey’s Reply”, <em>Westminster Review</em>, 39:\n491–494.</li>\n<li>Miller, J. and L. Festinger, 1977, “Impact of Oculomotor\nRetraining on the Visual Perception of Curvature”, <em>Journal\nof Experimental Psychology: Human Perception and Performance</em>,\n3(2): 187–200.</li>\n<li>Milner, A.D. and M.A. Goodale, 1995, <em>The Visual Brain in\nAction</em>, Oxford: Oxford University Press, 2<sup>nd</sup> edition,\n2006.</li>\n<li>–––, 2008, “Two Visual Systems\nRe-viewed”, <em>Neuropsychologia</em>, 46: 774–785.</li>\n<li>Mittelstädt, H., 1971, <em>Reafferenzprinzip—Apologie\nund Kritik</em>, in <em>Vorträge der Erlanger\nPhysiologentagung</em>, Berlin: Springer, pp. 161–171.</li>\n<li>Mon-Williams, M., J.R. Tresilian, A. Plooy, J.P. Wann, and J.\nBroerse, 1997, “Looking at the Task in Hand: Vergence Eye\nMovements and Perceived Size”, <em>Experimental Brain\nResearch</em>, 117(3): 501–506.</li>\n<li>Morales, J., Bax, A. and Firestone, C., 2020, “Sustained\nRepresentation of Perspectival Shape”, <em>Proceedings of the\nNational Academy of Sciences</em>, 117(26): 14873–14882.</li>\n<li>Morales, J. and Firestone, C., 2023. “Empirical Evidence for\nPerspectival Similarity”, <em>Psychological Review</em>. Advance\nonline publication. doi:10.1037/rev0000403</li>\n<li>Moulden, B., 1971, “Adaptation to Displaced Vision:\nReafference is a Special Case of the Cue-Discrepancy\nHypothesis”, <em>The Quarterly Journal of Experimental\nPsychology</em>, 23: 113–117.</li>\n<li>Nakamura, K. and C. Colby, 2002, “Updating of the Visual\nRepresentation in Monkey Striate and Extrastriate Cortex during\nSaccades”, <em>Proceedings of the National Academy of\nSciences</em>, 99(6): 4026–4031.</li>\n<li>Nanay, B., 2013, <em>Between Perception and Action,</em> Oxford:\nOxford University Press.</li>\n<li>Nave, K., Deane, G., Miller, M. and Clark, A., 2022.\n“Expecting Some Action: Predictive Processing and the\nConstruction of Conscious Experience”, <em>Review of Philosophy\nand Psychology</em>, pp.1–19.</li>\n<li>Noë, A., 2004, <em>Action in Perception</em>, Cambridge, MA:\nMIT Press.</li>\n<li>–––, 2005, “Real Presence”,\n<em>Philosophical Topics</em>, 33: 235–264.</li>\n<li>–––, 2009, <em>Out of our Heads</em>, New York:\nHill and Wang.</li>\n<li>–––, 2010, “Vision without\nRepresentation”, in Gangopadhyay et al. 2010::\n245–256.</li>\n<li>O’Regan, J.K., 2011, <em>Why Red Doesn’t Sound Like a\nBell: Explaining the Feel of Consciousness</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>O’Regan, J.K. and A. Noë, 2001, “A Sensorimotor\nAccount of Vision and Visual Consciousness”, <em>Behavioral and\nBrain Sciences</em>, 24: 939–973.</li>\n<li>Palmer, S.E., 1999, <em>Vision Science: Photons to\nPhenomenology</em>, Cambridge, MA: MIT Press.</li>\n<li>Poincaré, H., 1907, <em>La Science et\nL'Hypothése</em>, Paris: Flammarion.</li>\n<li>Post, R.B. and H.W. Leibowitz, 1985, “A Revised Analysis of\nthe Role of Efference in Motion Perception”,\n<em>Perception</em>, 14(5): 631–643.</li>\n<li>Pouget, A., S. Deneve, and J.-R., Duhamel, 2002, “A\nComputational Perspective on the Neural Basis of Multisensory Spatial\nRepresentation”, <em>Nature Reviews: Neuroscience</em>, 3:\n741–747.</li>\n<li>Price, H.H., 1950, <em>Perception</em>, London: Methuen,\n2<sup>nd</sup> edition.</li>\n<li>Prinz, J.J., 2006, “Putting the Brakes on Enactive\nPerception”, <em>Psyche</em>, 12: 1–19.</li>\n<li>–––, 2009, “Is Consciousness\nEmbodied?” in <em>The Cambridge Handbook of Situated\nCognition</em>, P. Robbins and M. Aydede (eds.), Cambridge: Cambridge\nUniversity Press, pp. 419–436.</li>\n<li>Proffitt, D., 2006, “Embodied Perception and the Economy of\nAction”, <em>Perspectives on Psychological Science</em>, 1:\n110–122.</li>\n<li>–––, 2008. “An Action-specific Approach to\nSpatial Perception”, in <em>Embodiment, Ego-space, and\nAction</em>, R. Klatzky, B. MacWhinney, and M. Berhmann (eds.),\nMahwah, NJ: Erlbaum, pp. 179–202.</li>\n<li>Purkyně, J., 1825, “<em>Über die Scheinbewegungen,\nwelche im subjectiven Umfang des Gesichtsinnes vorkommen</em>”,\n<em>Bulletin der naturwessenschaftlichen Sektion der Schlesischen\nGesellschaft</em>, 4: 9–10.</li>\n<li>Reid, T., 1785, <em>Essays on the Intellectual Powers of Man</em>,\nCambridge, MA: MIT Press, 1969.</li>\n<li>Rizzolatti, G., 2008, <em>Mirrors in the Brain</em>, New York:\nOxford University Press.</li>\n<li>Rock, I., 1966, <em>The Nature of Perceptual Adaptation</em>, New\nYork: Basic Books.</li>\n<li>Rock, I. and C.S. Harris, 1967, “Vision and Touch”,\n<em>Scientific American</em>, 216: 96–107.</li>\n<li>Russell, B., 1918, “The Philosophy of Logical\nAtomism”, in <em>Logic and Knowledge</em>, London: Allen and\nUnwin, 1956, pp. 177–281.</li>\n<li>Sampaio, E., S. Maris, and P. Bach-y-Rita, 2001, “Brain\nPlasticity: ‘Visual’ Acuity of Blind Persons via the\nTongue”, <em>Brain Research</em>, 908: 204–207.</li>\n<li>Schellenberg, S., 2007. “Action and Self-location in\nPerception.” <em>Mind</em>, 116(463): 603–632.</li>\n<li>–––, 2010. “Perceptual Experience and the\nCapacity to Act”, in <em>Perception, Action, and Consciousness:\nSensorimotor Dynamics and Two visual Systems</em>, N. Gangopadhyay, M.\nMadary, and F. Spicer (eds.), Oxford: Oxford University Press, pp.\n145–160.</li>\n<li>Schwitzgebel, E., 2006, “Do Things Look Flat?”\n<em>Philosophy &amp; Phenomenological Research</em>, 72:\n589–599.</li>\n<li>Shams, L. and R. Kim, 2010, “Crossmodal Influences on Visual\nPerception”, <em>Physics of Life Reviews</em>, 7(3):\n269–284.</li>\n<li>Shebilske, W.L., 1984, “Context Effects and Efferent Factors\nin Perception and Cognition”, in <em>Cognition and Motor\nProcesses</em>, W. Prinz and A.F. Sanders (eds.), Berlin:\nSpringer-Verlag, pp. 99–119.</li>\n<li>–––, 1987, “An Ecological Efference\nMediation Theory of Natural Event Perception”, in\n<em>Perspectives on Perception and Actions</em>, H. Heuer and A.F.\nSanders (eds.), Hillsdale, NJ: Erlbaum, pp. 195–213.</li>\n<li>Sherrington, C.S., 1918, “Observations on the Sensual Role\nof the Proprioceptive Nerve Supply of the Extrinsic Ocular\nMuscles”, <em>Brain</em>, 41: 332–343.</li>\n<li>Siegel, S., 2014. “Affordances and the Contents of\nPerception”, in <em>Does Perception Have Content?</em>, Berit\nBrogaard (ed.), Oxford: Oxford University Press, pp. 39–76.</li>\n<li>Siegle, J.H. and W.H. Warren, 2010, “Distal Attribution and\nDistance Perception in Sensory Substitution”,\n<em>Perception</em>, 39(2): 208–223.</li>\n<li>Simmons, A., 2003, “Spatial Perception from a Cartesian\nPoint of View”, <em>Philosophical Topics</em>, 31(1/2):\n395–423.</li>\n<li>Singer, G. and R. Day, 1966, “Spatial Adaptation and\nAftereffect with Optically Transformed Vision: Effects of Active and\nPassive Responding and the Relationship between Test and Exposure\nResponses”, <em>Journal of Experimental Psychology</em>, 71:\n725–731.</li>\n<li>Smith, A., 1811, <em>The Works of Adam Smith</em> (Volume 5), D.\nStewart. (ed.), London: T. Cadell and W. Davies.</li>\n<li>Smith, A.D., 2000, “Space and Sight”, <em>Mind</em>,\n109: 481–518.</li>\n<li>Sperry, R.W., 1952, “Neurology and the Mind-Brain\nProblem”, <em>American Scientist</em>, 291–312.</li>\n<li>Springle, A., &amp; Machamer, P., 2016, “Perceiving and\nKnowing as Activities” in <em>Philosophy as the Foundation of\nKnowledge, Action and Ethos</em>, J. Kaczmarek, R. Kleszcz (eds.),\nLodz: Lodz University Press, pp. 39–54.</li>\n<li>Stewart, D., 1829, <em>Elements of the Philosophy of the Human\nMind</em>, in <em>The Collected Works of Dugald Stewart</em> (Volume\n2), W. Hamilton (ed.), Westmead, UK: Gregg International Publishers,\n1971.</li>\n<li>Stoneham, T., 2020, “Action, Knowledge and Embodiment in\nBerkeley and Locke”, <em>Philosophical Explorations</em>, 21(1):\n41–59.</li>\n<li>Stratton, G.M., 1896, “Some Preliminary Experiments on\nVision without Inversion of the Retinal Image”,\n<em>Psychological Review</em>, 3: 611–617.</li>\n<li>–––, 1897(a and b), “Vision Without\nInversion of the Retinal Image”, <em>Psychological Review</em>,\n4(4): 341–360 and 4(5)463–481.</li>\n<li>–––, 1899, “The Spatial Harmony of Touch\nand Sight”, <em>Mind</em>, 8: 492–505.</li>\n<li>–––, 1907, “Eye-Movements and Visual\nDirection”, <em>Psychological Bulletin</em>, 4:\n155–158.</li>\n<li>Taylor, J.G., 1962, <em>The Behavioral Basis of Perception</em>,\nNew Haven, CT: Yale University Press.</li>\n<li>–––, 1965, “The Behavioral Basis of\nPerceived Size and Distance”, <em>Canadian Journal of\nPsychology</em>, 19(1): 1–14.</li>\n<li>–––, 1968, “Perception as a Function of\nBehaviour”, <em>Studies in Logic and the Foundations of\nMathematics</em>, 52: 431–436.</li>\n<li>Templeton, W., I. Howard, and A. Lowman, 1966, “Passively\nGenerated Adaptation to Prismatic Distortion”, <em>Perceptual\nand Motor Skills</em>, 22: 140–142.</li>\n<li>Thompson, E., 2005, “Sensorimotor Subjectivity and the\nEnactive Approach to Experience”, <em>Phenomenology and the\nCognitive Sciences</em>, 4(4): 407–427.</li>\n<li>Uhlarik, J.J. and L.K. Canon, 1971, “Influence of Concurrent\nand Terminal Exposure Conditions on the Nature of Perceptual\nAdaptation”, <em>Journal of Experimental Psychology</em>, 91:\n233–239.</li>\n<li>de Vignemont, F., 2021. “A Minimal Sense of\nHere-ness”, <em>The Journal of Philosophy</em>, 118(4):\n169–187.</li>\n<li>de Vignemont, F. and Alsmith, A. eds., 2017, <em>The\nSubject’s Matter: Self-Consciousness and the Body</em>,\nCambridge, MA: MIT Press.</li>\n<li>Vishton, P.M., N.J. Stephens, L.A. Nelson, S.E. Morra, K.L.\nBrunick, and J.A. Stevens, 2007, “Planning to Reach for an\nObject Changes How the Reacher Perceives It”, <em>Psychological\nScience</em>, 18: 713–719.</li>\n<li>Wallach, H., 1968, “Informational Discrepancy as a Basis of\nPerceptual Adaptation”, in <em>The Neuropsychology of Spatially\nOriented Behaviour</em>, S. Friedman (ed.), Homewood, IL: Dorsey, pp.\n209–230.</li>\n<li>Ward, D., Roberts, T. and Clark, A., 2011, “Knowing What We\nCan Do: Actions, Intentions, and the Construction of Phenomenal\nExperience”, <em>Synthese</em>, 181: 375–394.</li>\n<li>Welch, R., 1978, <em>Perceptual Modification: Adapting to Altered\nSensory Environments</em>, New York: Academic Press.</li>\n<li>Wu, W., 2014, “Against Division: Consciousness, Information\nand the Visual Streams”, <em>Mind &amp; Language</em>, 29(4):\n383–406.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "bodily awareness",
            "cognition: embodied",
            "phenomenology"
        ],
        "entry_link": [
            {
                "../bodily-awareness/": "bodily awareness"
            },
            {
                "../embodied-cognition/": "cognition: embodied"
            },
            {
                "../phenomenology/": "phenomenology"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=action-perception\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/action-perception/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=action-perception&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/action-perception/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=action-perception": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/action-perception/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=action-perception&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/action-perception/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://philpapers.org/browse/spatial-experience/\" target=\"other\">Spatial Experience</a>\n at Philpapers.org."
        ],
        "listed_links": [
            {
                "http://philpapers.org/browse/spatial-experience/": "Spatial Experience"
            }
        ]
    }
}