{
    "url": "aesthetic-judgment",
    "title": "Aesthetic Judgment",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Nick Zangwill\n<zangwillnick@gmail.com>",
        "author_links": [
            {
                "mailto:zangwillnick%40gmail%2ecom": "zangwillnick@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nNick Zangwill\n&lt;<a href=\"mailto:zangwillnick%40gmail%2ecom\"><em>zangwillnick<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Feb 28, 2003",
        "substantive revision Thu Feb 16, 2023"
    ],
    "preamble": "\n\nBeauty is an important part of our lives. Ugliness too. It is no\nsurprise then that philosophers since antiquity have been interested\nin our experiences of and judgments about beauty and ugliness. They\nhave tried to understand the nature of these experiences and\njudgments, and they have also wanted to know whether these experiences\nand judgments were legitimate. Both these projects took a sharpened\nform in the twentieth century, when this part of our lives came under\na sustained attack in both European and North American intellectual\ncircles. Much of the discourse about beauty since the eighteenth\ncentury had deployed a notion of the “aesthetic”, and so\nthat notion in particular came in for criticism. This disdain for the\naesthetic may have roots in a broader cultural Puritanism, which fears\nthe connection between the aesthetic and pleasure. At one time, from\nthe 1960s to the 1990s, even to suggest that an artwork might be good\nbecause it is pleasurable, as opposed to cognitively, morally or\npolitically beneficial, was to court derision. (This is less true\nnow.) The twentieth century was not kind to the notions of beauty or\nthe aesthetic. Nevertheless, there were always some\nthinkers—philosophers, as well as others in the study of\nparticular arts—who persisted in thinking seriously about beauty\nand the aesthetic. In the first part of this essay, we will look at\nthe particularly rich account of judgments of beauty given to us by\nImmanuel Kant. The notion of a “judgment of taste” is\ncentral to Kant’s account and also to virtually everyone working\nin traditional aesthetics; so we begin by examining Kant’s\ncharacterization of the judgment of taste. In the second part, we look\nat the issues that twentieth century thinkers raised. In the third\npart, we consider disinterestedness, which is taken by Kant to be part\nof the judgment of taste. We end, in the fourth part, by drawing on\nKant’s account of the judgment of taste to consider whether the\nnotion of the aesthetic is viable.\n",
    "toc": [
        {
            "#JudgTast": "1. The Judgment of Taste"
        },
        {
            "#Subj": "1.1 Subjectivity"
        },
        {
            "#Norm": "1.2 Normativity"
        },
        {
            "#RecaNorm": "1.3 Recasting Normativity"
        },
        {
            "#NormPlea": "1.4 Normativity and Pleasure"
        },
        {
            "#JudgTastBigQues": "1.5 Judgments of Taste and the Big Question"
        },
        {
            "#OtheFeatAestJudg": "2. Other Features of Aesthetic Judgments"
        },
        {
            "#AestTrut": "2.1 Aesthetic Truth"
        },
        {
            "#MindDepeNonaDepe": "2.2 Mind-dependence and Nonaesthetic Dependence"
        },
        {
            "#WhicNonAestPropDoAestPropDepe": "2.3 On Which Non-aesthetic Properties Do Aesthetic Properties Depend?"
        },
        {
            "#DepeLawl": "2.4 Dependence and Lawlessness"
        },
        {
            "#PrimCorr": "2.5 The Primacy of Correctness"
        },
        {
            "#Disi": "3. Disinterestedness"
        },
        {
            "#DisiLessAmbi": "3.1 Disinterestedness: More and Less Ambitious"
        },
        {
            "#ProbDisi": "3.2 Problems with Disinterestedness"
        },
        {
            "#NotiAest": "4. The Notion of the Aesthetic"
        },
        {
            "#SomeTermRema": "4.1 Some Terminological Remarks"
        },
        {
            "#Prob": "4.2 The Problem"
        },
        {
            "#HierProp": "4.3 A Hierarchical Proposal"
        },
        {
            "#BeauSubl": "4.4 Beauty and Sublimity"
        },
        {
            "#AestMora": "4.5 Aesthetic Morals"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Refe": "References"
        },
        {
            "#FurtRead": "Further Reading"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Judgment of Taste\n\nWhat is a judgment of taste? Kant isolated two fundamental necessary\nconditions for a judgment to be a judgment of\ntaste—subjectivity and universality (Kant\n1790/2000). Other conditions may also contribute to what it is to be a\njudgment of taste, but they are consequential on, or predicated on,\nthe two fundamental conditions. In this respect Kant followed the lead\nof Hume and other writers in the British sentimentalist tradition\n(Hume 1757/1985).\n1.1 Subjectivity\n\nThe first necessary condition of a judgment of taste is that it is\nessentially subjective. What this means is that the judgment\nof taste is based on a feeling of pleasure or displeasure. This\ndistinguishes judgments of taste from empirical judgments. Central\nexamples of judgments of taste are judgments of beauty and ugliness.\nJudgments of taste can be about art or nature.\n\nThis subjectivist thesis would be over-strict if it were interpreted\nin an “atomistic” fashion, so that some subjective\nresponse corresponds to every judgment of taste, and vice versa.\nSometimes one makes a judgment of taste on inductive grounds or on the\nbasis of authority. But these cases indirectly rely on judgements made\non the basis of subjective responses. A more holistic picture of the\nrelation between response and judgment would preserve the spirit of\nthe subjectivist doctrine while fitting our actual lives more\naccurately. The subjectivist doctrine needs to be refined in order to\ndeal with the cases of induction and authority. But it must not be\nabandoned. The doctrine is basically right.\n\nHowever, it is not obvious what to make of the subjectivity of the\njudgment of taste. We need an account of the nature of the pleasure on\nwhich judgments of beauty are based.\n\nBeyond a certain point, this issue cannot be pursued independently of\nmetaphysical issues about realism, for the metaphysics we favor is\nbound to affect our view of the nature of the pleasure we take in\nbeauty. In particular, we need to know whether or not pleasure in\nbeauty represents properties of beauty and ugliness that things\npossess. If not, does it involve the cognitive faculties that we\ndeploy in understanding the world, as Kant thought? Or is it not a\nmatter of the cognitive faculties, but a matter of sentimental\nreactions, which are schooled in various ways, as Hume and others\nthought? These are very hard questions. But there are some things we\ncan say about the pleasure involved in finding something beautiful\nwithout raising the temperature too high.\n\nKant makes various points about pleasure in the beautiful, which fall\nshort of what we might call his “deep” account of the\nnature of pleasure in beauty, according to which it is the harmonious\nfree play of the cognitive faculties, of imagination and\nunderstanding. According to Kant’s “surface” account\nof pleasure in beauty, it is not mere sensuous gratification, as in\nthe pleasure of sensation, or of eating and drinking. Unlike such\npleasures, pleasure in beauty is occasioned by the perceptual\nrepresentation of a thing. (In contemporary terms, we would put this\nby saying that pleasure in beauty has an intentional content.)\nMoreover, unlike other sorts of intentional pleasures, pleasure in\nbeauty is “disinterested”. This means, roughly, that it is\na pleasure that does not involve desire—pleasure in beauty is\ndesire-free. That is, the pleasure is neither based on desire nor does\nit produce one by itself. In this respect, pleasure in beauty is\nunlike pleasure in the agreeable, unlike pleasure in what is good for\nme, and unlike pleasure in what is morally good. According to Kant,\nall such pleasures are “interested”—they are bound\nup with desire. This is discussed in section 3 below. This is all\nimportant as far as it goes, but it is all negative. We need to know\nwhat pleasure in beauty is, as well as what it is\nnot. What can be said of a more positive nature?\n1.2 Normativity\n\nIn order to see what is special about pleasure in beauty, we must\nshift the focus back to consider what is special about the judgment of\ntaste. For Kant, the judgment of taste claims “universal\nvalidity”, which he describes as follows:\n\n\n… … if [someone] pronounces that something is beautiful,\nthen he expects the very same satisfaction of others: he judges not\nmerely for himself, but for everyone, and speaks of beauty as if it\nwere a property of things. Hence he says that the thing is\nbeautiful, and does not count on the agreement of others with his\njudgment of satisfaction because he has frequently found them to the\nagreeable with his own, but rather demands it from them. He\nrebukes them if they judge otherwise, and denies that they have taste,\nfor he nevertheless requires that they ought to have it; and to this\nextent one cannot say, “Everyone has his special taste”.\nThis would be as much as to say that there is no taste at all, i.e. no\naesthetic judgment that could make a rightful claim to the assent of\neveryone. (Kant 1790, 5: 212–213 [2000: 98]; see also 2000:\n164–166–139)\n\n\nKant’s idea is that in a judgment of taste, we demand or require\nagreement from other human beings in a way we do not in our judgments\nabout the niceness of Canary-wine, which is just a question of\nindividual preference. In many cases, in matters of taste and beauty,\nwe think that others ought to share our judgment, and we\nblame them if they don’t. This is because the judgment of taste\nhas this aspiration to universal validity that it seems “as\nif [beauty] were a property of things”.\n\nNow, if the above quotation were all that Kant had to say by way of\nelucidating the judgment of taste, then he would not have said enough.\nFor the following question is left hanging: why do we require\nthat others share our judgment? We might want others to share\nour judgment for all sorts of strange reasons. Maybe we will feel more\ncomfortable. Maybe we will win a bet. And if we say that they\nought to judge a certain way, we need to say more. In what\nsense is this true? What if someone cannot appreciate some excellent\nwork of art because they are grief-stricken? What if it would distract\nsomeone from some socially worthy project? Of what nature is this\n“ought”?\n\nWe can recast the point about how we ought to judge in austere terms\nby saying that there is a certain normative constraint on our\njudgments of taste, which is absent in our judgments about the\nniceness of Canary-wine. The most primitive expression of this\nnormativity is this: some are correct, others\nincorrect. Or perhaps, even more cautiously: some\njudgments are better than others. We do not think that something\nis beautiful merely to me, in the way that we might say that\nsome things just happen to give me sensuous pleasure. Of\ncourse, we might well say “I think X is\nbeautiful”, because we wish to express uncertainty, but where we\njudge confidently, we think of our judgment as being correct.\nAnd that means that we think that the opposite judgment would be\nincorrect. We assume that not all judgments of beauty are equally\nappropriate. “Each to their own taste” only applies to\njudgments of niceness and nastiness, which Kant calls “judgments\nof agreeableness” (see Kant 1790, 5: 212–213,\n291–292 [2000: 97–98, 171–172]).\n\nOf course, some people just know about food. There are\nexperts and authorities on making delicious food and in knowing what\nwill taste good (Kant 1790, 5: 213 [2000: 98]). But what these people\nknow is what will taste pleasurable to a certain kind of palate. In a\nsense, some things just do taste better than others, and some\njudgments of excellence in food are better than others. There is even\na sense in which some are correct and others incorrect. Still, this is\nonly relative to “normal” human beings. There is no idea\nof correctness according to which someone with very unusual pleasures\nand displeasure is at fault, or according to which the majority of\nhuman beings can be wrong. (Kant says that judgments of agreeableness\nhave “general” but not “universal” validity;\n1790, 5: 213 [2000: 213].) But in the case of judgments of taste or\nbeauty, correctness is not hostage to what most people like or judge.\nWe may say that it is a mistake to use much salt or sugar but that is\nonly because it swamps the flavors that are enjoyed by most\npeople.\n\nTo say that a judgment of taste makes a claim to correctness might\nseem merely to shift from the problematic “ought” that is\ninvolved in a judgment of taste to a problematic\n“correctness” or “betterness”. This may be\ninevitable. We are dealing with a normative notion, and while some\nnormative notions may be explainable in terms of others, we cannot\nexpress normative notions in non-normative terms.\n\nIn some cases, the correctness of a judgment of taste may be\nimpossibly difficult to decide. We may even think that there is no\nright answer to be had if we are asked to compare two very different\nthings. But in many other cases, we think that there\nis a right and a wrong answer at which we are aiming, and\nthat our judgments can be erroneous. If we do not think this, in at\nleast some cases, then we are not making a judgment of taste—we\nare doing something else.\n\nIt is true that there is a popular idea that is sometimes expressed by\nsaying that no judgments of taste are really better than others.\nPeople sometimes say, “There is no right and wrong about matters\nof taste”. Others express a related thought by saying that\nbeauty is “relative” to individual judgment or preference,\nor that it is “socially relative”. Such skeptical views\nhave some following outside the academy, as well as in certain of the\nhumanities. Many even express distaste for the idea that judgments of\ntaste have a normative claim, as if that would be uncouth or\noppressive. However, if we are describing our thought as it is, not\nhow it ought to be, then there is no getting away from the fact that\nnormativity is a necessary condition of judgments of taste or beauty.\nTwo points should embarrass the skeptic: firstly, people who express\nanti-normativist skeptical views are merely theorizing. In\nthe case of judgments of beauty, anti-normativist skepticism is out of\nstep with practice, especially their own practice. As with moral\nrelativism, one can almost always catch a professed skeptic about\njudgments of beauty making and acting on non-skeptical judgments of\nbeauty—for example, in their judgments about music, nature and\neveryday household objects around them. Skeptics do not practice what\nthey preach. Secondly, one thing that drives people to this\nimplausible skepticism, which is so out of line with their own\npractice, is a perceived connection with tolerance or\nanti-authoritarianism. This is what they see as attractive in it. But\nthis is upside-down. For if “it is all relative” and no\njudgment is better than any other, then relativists put their\nown judgments beyond criticism, and they cannot get it wrong. Only\nthose who think that there is a right and wrong in judgment can\nmodestly admit that they might be wrong. What looks like an ideology\nof tolerance is, in fact, the opposite. \n\nSome so-called “experimental philosophers” have questioned\nthe thesis that judgments of taste aspire to correctness on the basis\nof empirical evidence about those who make judgments of taste (Cova\n& Pain 2012). But it is not clear that the empirical evidence\ncited supports that skeptical thesis. For the evidence is just that\nthat the experimental subjects tick boxes that ask directly about\ncorrectness in judgment. But in psychological experiments there is a\nrequirement of opacity of the point of an experiment to the\nexperimental subjects (Hughes 2016). Furthermore, people often wax\nphilosophical in a way that is out of step with their actual\nconceptual practice. For example, some beginners in introductory moral\nphilosophy classes inconsistently claim that all moral views are\nequally correct, and that it is very bad to think otherwise. People\nwho think in a certain way may be defective in self-knowledge, just as\nthose who take part in social rituals may not be able to describe\nthose rituals (see Zangwill 2019 for critical discussion). We should\nalso bear in mind that the skeptical thesis would also be very\nsurprising given that it departs from not just centuries but millennia\nof reflection on our aesthetic lives. The answers to questionnaires\nabout correctness in judgment do not reveal the deep nature of\npeople’s thoughts.\n1.3 Recasting Normativity\n\nIn the normative claim of judgments of taste, as formulated above,\nother people do not figure in the account. This is an\naustere explanation of what Kant meant, or perhaps of what he\nought to have meant, when he said that the judgment of taste claims\n“universal validity”, by contrast with judgments about the\nniceness of Canary-wine. Given this account, we can\nexplain the fact that we think that others ought to share our\njudgment. They ought to share it on pain of making a judgment which is\nincorrect or inappropriate. And this would be why we do in\nfact look to others to share our judgment; we do not want them to make\nincorrect judgments. It seems that Kant’s reference to other\npeople in characterizing the normativity of judgments of taste has\ndropped out of the picture as inessential.\n\nHowever, it is not clear whether Kant would go along with this, for he\ncharacterizes normativity in a way that ties in with his eventual\nexplanation of its possibility. Kant expresses the normative\nidea in a very particular way. He writes:\n\n\n[we] demand such assent universally (Kant 1790, 5: 214 [2000: 99])\n\n\nAnd Kant says that the judgment of taste involves\n\n\nits validity for everyone. (Kant 1790, 5: 212 [2000: 97])\n\n\nBy contrast, Kant thinks that although we sometimes speak as\nif our judgments of the agreeable are universally valid\n(“Lamb tastes better with garlic”), in fact they are not:\njudgments of the agreeable appeal only to most but not to\nall people (Kant 1790, 5: 213 [2000: 98]).\n\nHowever, the austere characterization attempts to catch a more basic\nidea of normativity—one that might serve as the target of rival\nexplanations. In order to explain how subjectively universal judgments\nare possible, Kant has a complicated story about the harmonious\ninterplay of the cognitive faculties—imagination and\nunderstanding—which he thinks constitutes pleasure in beauty\n(Kant 1790, 5: 219 [2000: 104]). This “deep” account of\npleasure in beauty is highly controversial and not particularly\nplausible (see Budd 2001). But we can see why Kant gives it. For Kant,\nthe normative claim of the judgment of taste has its roots in the more\ngeneral workings of our cognitive faculties, which Kant thinks we can\nassume others share. Thus, we have the beginnings of an explanation of\nhow such a pleasure can ground a judgment that makes a universal\nclaim. However, Kant does not have much to say about the nature of the\n“universality” or normativity that is being explained by\nsuch a speculative account of pleasure in beauty. It is no accident\nthat Kant phrases the obligation in interpersonal terms, considering\nwhere he is going. And it is no great fault on his part that he does\nso. But for our purposes, we need to separate what is being explained\nfrom its explanation. For if Kant’s explanation does not work,\nwe want to be left with a characterization of the normativity he was\ntrying to explain. We need to separate Kant’s problem from his\nsolution, so that the former is left if the latter fails. There may be\nalternative solutions to his problem.\n1.4 Normativity and Pleasure\n\nAs described, normativity attaches to judgments of taste\nthemselves. What does this imply for pleasure in beauty?\nSince judgments of taste are based on responses of pleasure, it would\nmake little sense if our judgments were more or less appropriate but\nour responses were not. The normative claim of our judgments of taste\nmust derive from the fact that we think that some responses\nare better or more appropriate to their object than others. Responses\nonly license judgments which can be more or less appropriate because\nresponses themselves can be more or less appropriate. If I get\npleasure from drinking Canary-wine and you do not, neither of us will\nthink of the other as being mistaken. But if you don’t\nget pleasure from Shakespeare’s Sonnets, I will think\nof you as being in error—not just your judgment, but\nyour liking. I think that I am right to have my\nresponse, and that your response is\ndefective. Someone who thinks that there is, in Hume’s\nwords, “an equality of genius” between some inferior\ncomposer, on the one hand, and J. S. Bach, on the other, has a\ndefective sensibility (Hume 1757 [1985: 230]). Roger Scruton\nputs the point well when he says:\n\n\nWhen we study [the Einstein Tower and the Giotto campanile] …\nour attitude is not simply one of curiosity, accompanied by some\nindefinable pleasure or satisfaction. Inwardly, we affirm our\npreference as valid…. (Scruton 1979: 105) \n\n\nThis is the reason why we demand the same feeling from\nothers, even if we do not expect it. We think that our response is\nmore appropriate to its object than its opposite. And, in turn, this\nis why we think that our judgment about that object\nis more correct than its opposite. The normativity of judgment derives\nfrom the normativity of feeling.\n\nBut how can some feelings be better or worse than others? To\nanswer this question, we need to ask: how far does the normativity of\njudgments of taste inhere in the feeling itself? The realist about\nbeauty will say that the feeling has normativity built into it in\nvirtue of its representational content; the feelings themselves can be\nmore or less veridical. Pleasure in beauty, for example, has as its\nobject the property of beauty; we find the beauty\npleasurable. A Humean sentimentalist will probably say that\nnormativity is something we somehow construct or foist upon our\npleasures and displeasures, which have no such content. And Kant has\nhis own account, which appeals to cognitive states that are not\nbeliefs. The issue is controversial. However, what we can say for sure\nis that it is definitive of pleasure in beauty that it licenses\njudgments that make claim to correctness. Beyond this, there will be\ntheoretical divergence.\n\nThis normativity is definitive of the judgment of taste, and is its\nsecond defining characteristic, which we should add to the fact that\nit is based on subjective grounds of pleasure or displeasure.\n1.5 Judgments of Taste and the Big Question\n\nWe can sum things up like this: judgments of taste occupy a mid-point\nbetween judgments of niceness and nastiness, and empirical judgments\nabout the external world. Judgments of taste are like empirical\njudgments in that they have universal validity, but they are unlike\nempirical judgment in that they are made on the basis of an inner\nsubjective response. Conversely, judgments of taste are like judgments\nof niceness or nastiness in that they are made on the basis of an\ninner subjective response, but they are unlike judgments of niceness\nand nastiness, which make no claim to universal validity. To cut the\ndistinctions the other way: in respect of normativity, judgments of\ntaste are like empirical judgments and unlike judgments of niceness or\nnastiness, but in respect of subjectivity, judgments of taste are\nunlike empirical judgments and like judgments of niceness or\nnastiness. So, we have a three-fold division: empirical judgments,\njudgments of taste, and judgments of niceness or nastiness. And\njudgments of taste have the two points of similarity and dissimilarity\non each side just noted.\n\nAs Kant recognized (more or less following Hume), all this is a point\nfrom which to theorize. The hard question is\nwhether, and if so how, such a subjectively\nuniversal judgment is possible. On the face of it, the two\ncharacteristics are in tension with each other. Our puzzle is this:\nwhat must be the nature of pleasure in beauty if the judgments we base\non it can make claim to correctness? This is the Big Question in\naesthetics. Kant’s problem was the right one, even if his\nsolution was not.\n\nHowever, our hope thus far has been to get clearer about what it is\nthat is under scrutiny in this debate. Once we are armed with a modest\naccount of what a judgment of taste is, we can then proceed to more\nambitious questions about whether or not judgments of taste represent\nreal properties of beauty and ugliness, and if not, how else the\nnormativity of aesthetic judgment is to be explained. We can even\nconsider whether or not our whole practice of making judgments of\ntaste is defective and should be jettisoned. But first things\nfirst.\n2. Other Features of Aesthetic Judgments\n\nThere is more to aesthetic judgment than just subjectivity and\nnormativity, and this should be described more fully. The following is\na survey of a number of other candidate features of aesthetic\njudgments: truth, mind-independence, nonaesthetic dependence, and\nlawlessness.\n2.1 Aesthetic Truth\n\nThe normativity of aesthetic judgments can be recast in terms\nof a particular conception of aesthetic truth. For some purposes, it\nis useful to do this. It might be thought that deploying the idea of\naesthetic truth commits us to the existence of an aesthetic\nreality. But this springs from the assumption that a strong\ncorrespondence conception of truth is all there ever is to truth in\nany area where we might employ the notion. In many\nareas—scientific and psychological thought, for example—a\nstrong correspondence conception of truth is likely to be in question.\nHowever, the conception of truth applicable in aesthetics might be one\naccording to which truth only implies the sort of normativity\ndescribed above, according to which there are correct and incorrect\njudgments of taste, or at least that some judgments are better than\nothers.\n\nIf we deploy the notion of truth, we might express the normative idea\nby saying if a judgment is true then its opposite is false. Or we\nmight say that the law of non-contradiction applies to aesthetic\njudgments: there are some aesthetic judgments such that they and their\nnegations cannot both be true. This principle need not hold of all\njudgments of taste, so long as it holds of a significant proportion of\nthem.\n\nSuch a normative conception of truth is stronger than a notion of\ntruth which is merely a device for “semantic assent”; that\nis, normative truth is more than thin “disquotational”\ntruth, according to which the notion of truth is merely a device for\nsemantic ascent. Thus we can say “x is beautiful’ is true\nif and only if x is beautiful. Even judgments of the agreeable, about\nthe niceness of Canary-wine, can have access to an inconsequential\ndisquotational conception of truth. We can say “Canary-wine is\nnice’ is true if and only if Canary-wine is nice” without\nraising the temperature. However, judgments about the niceness of\nCanary-wine do not aspire to a normative conception of truth. There\nare no right and wrong answers to the question of whether Canary-wine\nreally is nice. And so, of neither the judgment that it is nice nor\nthe judgment that it is not nice can it be said that if it is true\nthen its opposite is false. But this is what we do say of some\naesthetic judgments.\n\nHowever, although we can cast aesthetic normativity in terms\nof truth, we need not do so. Aesthetic “truth”, in fact,\nadds little to the notion of correctness that we have already\nencountered. We can do without the word “true”. We can say\nthat something cannot both be beautiful and ugly (in the same respect\nat the same time), and that if something is beautiful then it is not\nugly (in the same respect at the same\n time).[1]\n\n2.2 Mind-dependence and Nonaesthetic Dependence\n\nGiven an understanding of the normativity of judgments of\ntaste—which we might or might not express in terms of aesthetic\ntruth—we can and should add some further normative features.\n\nOne such feature is mind-independence. Mind-independence is\nbest expressed as a negative thesis: whether something is beautiful\ndoes not depend on my judgment. Thinking it so does not make it so.\nThis can be re-expressed in conditional terms: it is not the case that\nif I think something is beautiful then it is beautiful. This is common\nsense. For example, most of us think that our judgments have improved\nsince we were younger. We think that some of our past judgments were\nin error. Thinking it so, at that time, did not make it so. Perhaps\nsome more complicated, sophisticated mind-dependence thesis holds; but\na simple mind-dependence claim flouts common sense.\n\nWe also think that beauty, ugliness and other aesthetic properties\ndepend on nonaesthetic properties. Dependence contrasts with\nmind-independence in that it says what aesthetic properties\ndo depend on, as opposed to what they do not depend\non: the aesthetic properties of a thing depend on its nonaesthetic\nproperties. This dependence relation implies (but is not identical\nwith) the supervenience relation or relations: (a) two aesthetically\nunlike things must also be nonaesthetically unlike; (b) something\ncould not change aesthetically unless it also changed\nnonaesthetically; and (c) something could not have been aesthetically\ndifferent unless it were also nonaesthetically different. These are,\nrespectively: cross-object supervenience, cross-time supervenience,\nand cross-world supervenience. (“Supervenience” has often\nbeen discussed under the heading of “dependence” but they\nare distinct relations, related in a complex way.) Sibley’s\npapers “Aesthetic Concepts” and\n“Aesthetic/Nonaesthetic” were pioneering discussions of\nthe dependence of the aesthetic on the nonaesthetic (Sibley 1959,\n1965). (It is interesting that he never described the dependence in\nmodal terms.)\n\nThis claim is very intuitive, but let us try to say something more in\nsupport of it. It seems to be a deep fact about beauty and other\naesthetic properties that they are inherently “sociable”;\nbeauty cannot be lonely. Something cannot be barely beautiful; if\nsomething is beautiful then it must be in virtue of its nonaesthetic\nproperties. Furthermore, knowing this is a constraint on our judgments\nabout beauty and other aesthetic properties. We cannot just judge that\nsomething is beautiful; we must judge that it is beautiful in virtue\nof its nonaesthetic properties. We usually do so, and not to do so is\nbizarre. (Even in cases of testimony, we think that the aesthetic\nproperties of a thing hold in virtue of nonaesthetic properties that\nthe aesthetic expert knows.) Of course, we might not have in mind\nevery single nonaesthetic property of the thing, nor know exactly how\nthe nonaesthetic properties produce their aesthetic effects. But we\nthink that certain nonaesthetic properties are responsible\nfor the aesthetic properties and that without those nonaesthetic\nproperties, the aesthetic properties would not have been instantiated.\nBeauty does not float free, and recognizing this is constitutive of\naesthetic thought. Our aesthetic thought, therefore, is fundamentally\ndifferent from our thought about colors, with which it is often\ncompared. Perhaps colors are tied in some intimate way to intrinsic or\nextrinsic physical properties of the surfaces of things, such as\nreflectance properties. But color thought does not presuppose this.\nSomeone might even think that colors are bare properties of things.\nBut one cannot think that beauty is bare; it is essential to aesthetic\nthought to realize that the aesthetic properties of a thing arise from\nits nonaesthetic properties.\n\nThe principles of correctness, mind-independence and dependence can be\nphrased in the property mode or in terms of truth. We can cast them\neither way. We can say that whether something is beautiful does not\ndepend on what we think about it, but it does depend on its\nnonaesthetic features. Or we can equally well say that the truth of\naesthetic judgments is independent of our aesthetic judgments but it\nis dependent on nonaesthetic truths. Semantic ascent changes\nlittle.\n2.3 On Which Non-aesthetic Properties Do Aesthetic Properties Depend?\n\nSome have argued that what aesthetic properties depend on (their\n“dependence base”) extends beyond the intrinsic physical\nand sensory features of the object of aesthetic assessment (for\nexample Walton 1970), who follows Gombrich 1959, especially p. 313).\nOn this view, the nonaesthetic dependence base always includes\n“contextual properties”—matters to do with the\norigin of the work of art, or other works of art. Others dispute this\n(Zangwill 1999). This is one aspect of debates over formalism in many\ndomains. These issues are both central theoretical commitments as well\nas reflecting substantive aesthetic differences in the approach to\nmaking and appreciating various arts, as well as the aesthetics of\nnature. But such debates all presuppose that some dependence\nthesis holds. The controversial questions are about the\nextent of the dependence base of aesthetic properties, not\nwhether aesthetic properties have some nonaesthetic\ndependence base.\n\nOne view is that aesthetic properties depend on the\nappearances of things—the way things look or sound, for\nexample (see Mitrović 2013, 2018). If so, there is a\nsense in which aesthetic properties are mind-dependent, since\nappearances are appearances to some observer. However, some say that\nthere can be aesthetic properties of abstract objects such as\nmathematical or logical proofs or structures. Others say that ideas or\nconcepts in conceptual art may be the bearers of aesthetic properties.\n(Schellekens 2007). Those aesthetic properties would be\nmind-independent. The question of the aesthetic properties of abstract\nobjects is a controversial one (Kivy 1991, Barker 2009).\n2.4 Dependence and Lawlessness\n\nThus far we have been making positive claims about features of\naesthetic judgments. Let us now consider the claim that there are no\ninteresting nonaesthetic-to-aesthetic laws or principles, and the\nclaim that an aesthetic/nonaesthetic dependence relation can obtain,\neven though there are no such interesting laws or principles. Here\n“interesting” laws or principles means generalizations to\nthe effect that anything of such and such a nonaesthetic kind is of\nsuch and such aesthetic kind, and these generalizations can\nbe used to predict aesthetic properties on the basis of knowledge of\nnonaesthetic properties. In this sense, many find it plausible that\nthere are no laws of taste and aesthetic properties are anomalous.\n\nThe problem of the source of correctness in aesthetic judgment is\nindependent of the question of whether there are laws, rules or\nprinciples of taste. There is no reason to think that the possibility\nof correct or true judgments depends on the existence of laws, rules\nor principles from which we can deduce our correct or true\n judgments.[2]\n\nNevertheless, the anomalousness of aesthetics is worth thinking about\nin its own right. Many aestheticians agree that the aesthetic is\nanomalous in the above sense. But they are not agreed on the\nexplanation of anomalousness.\n\nA notable exception to this consensus is Monroe Beardsley, who\nclaims—heroically and extraordinarily—that there are\nexactly three aesthetic principles: things are aesthetically excellent\neither by being unified or intense or complex (Beardsley 1958: chapter\nXI). However, Beardsley’s “trinitarian” position\nfaces difficulties similar to those faced by moral philosophers who\nappeal to “thick” concepts. If Beardsley insists on a\nlawlike connection between his three thick substantive aesthetic\nproperties (unity, intensity and complexity) and aesthetic value, he\ncan only do so at the cost of conceding anomalousness between the\nthree thick substantive aesthetic properties and nonaesthetic\nproperties. There are three layers and one can hold onto laws between\nthe top and middle layers only by losing laws between the middle and\nbottom layers. Maybe intensity is always aesthetically good, but there\nare no laws about what makes things intense.\n\nGranting the anomalousness of aesthetic properties, then, we need to\nexplain it. There is much plausibility in Hume and Kant’s\nsuggestion that what explains the anomalousness of the aesthetic is\nthe first feature of judgments of taste—that judgments of taste\nare essentially subjective, unlike ordinary empirical judgments about\nphysical, sensory, or semantic properties (Hume 1757 [1985:\n231–232]; Kant 1790, 5: 213–216, 281–286 [2000:\n99–101, 136–142, 162–167]). This is why the two\nsorts of concepts are not “nomologically made for each\nother” (as Donald Davidson [1970] says about mental and physical\nconcepts). How can we bring an essentially subjective range of\njudgments nomologically into line with a range of empirical judgments?\nThe two kinds of judgments answer to quite different sets of\nconstraints. Frank Sibley observed that aesthetic concepts are not\npositively “condition-governed” (Sibley 1959). And Mary\nMothersill claimed that there are no laws of taste. But neither did\nmuch to explain those facts. The appeal to subjectivity explains what\nSibley and Mothersill notice and describe. Indeed, Mothersill writes\nof her “First Thesis” (FT) that there are no genuine\nprinciples or laws of taste: “…FT is central to\naesthetics, and there is nothing more fundamental from which it could\nbe derived” (Mothersill 1984: 143). But it seems that it\ncan be derived from the subjectivity of judgments of\ntaste.\n\nThis kind of anomalousness is one thing, dependence or supervenience\nanother. Even though aesthetic properties are anomalous, they depend\nand supervene on nonaesthetic properties. Many find such a combination\nof relations uncomfortable outside aesthetics, such as in moral\nphilosophy and the philosophy of mind. Yet there seem to be good\nreasons to embrace both principles in aesthetics. Both are firmly\nrooted in ordinary aesthetic thought.\n2.5 The Primacy of Correctness\n\nAesthetic judgments have certain essential features, and corresponding\nto those features are certain principles. We can group correctness,\nmind-independence, and nonaesthetic dependence together. However, it\ndoes no harm to focus on the feature of correctness or universal\nvalidity for this is the most basic of the features. If aesthetic\njudgments did not claim correctness or universal validity, they could\nnot claim the other features. If explaining correctness or universal\nvalidity is a problem, then so is explaining mind-independence and\ndependence. But clearly there is a problem about explaining\nall three features. Why does our aesthetic thought have these three\nfeatures and thus operate according to these three principles? And\nwhat is the source of the right of aesthetic judgments to\nthem? Hume and Kant spend much mental effort on these questions. These\npresuppositions of aesthetic judgments need to be explained and\njustified. Given that our aesthetic judgments have these commitments,\nwe need to know how such judgments are possible, how they are actual,\nand how they are legitimate. Having described and analyzed, as we have\ndone here, we need to explain and justify. But, as noted earlier, we\nfirst need a good description of what we are trying to explain and\njustify.\n3. Disinterestedness\n3.1 Disinterestedness: More and Less Ambitious\n\nAn idea that plays a large role in Kant’s discussion of the\nsubjective universality of the judgment of taste is that of\ndisinterestedness; and the idea has appealed to many. Kant makes two\nclaims: (a) that pleasure in the beautiful is\n“disinterested”; and (b) that only pleasure in the\nbeautiful is “disinterested” (Kant 1790, 5: 204–210\n[2000: 90–96: 42–50]). These claims are important for\nKant’s project, for Kant connects disinterestedness with the\nclaim to universal validity of the judgment of taste. Before we go any\nfurther, it is important to recognize that the German word\n“interesse” has a special meaning in eighteenth\ncentury German, and it should not be confused with similar sounding\nEnglish words or contemporary German words. For Kant, an\ninteresse means a kind of pleasure that is not connected with\ndesire; it is neither grounded in desire, nor does it produce it.\n\nWe should distinguish Kant’s more ambitious thesis that\nonly pleasure in the beautiful is disinterested from his less\nambitious claim simply that pleasure in the beautiful is\ndisinterested—for it seems that there could in principle be\nother disinterested pleasures. The less ambitious claim, however, is\ncontroversial enough.\n\nA relatively uncontroversial part of the less ambitious claim is that\npleasure in the beautiful is not grounded in the satisfaction\nof desire. It is plausible, surely, that when we take pleasure in\nsomething that we find beautiful, this is not pleasure in the thought\nthat we have got something that we desire. Kant wants pleasure in the\nbeautiful to be open to all (so there should be no “aesthetic\nluck”), and if desires vary from person to person, it seems that\nwe could not require that pleasure from everyone, as the idea\nof universal validity requires. The claim to universal validity would\nbe lost if pleasure in beauty were not disinterested in the sense of\nnot being based on desire. This part of the idea of disinterestedness\nhas much plausibility.\n3.2 Problems with Disinterestedness\n\nHowever, it is not so clear that pleasure in the beautiful does not\nproduce desire, which Kant also requires for a pleasure to be\ndisinterested. The issue here is whether the pleasure can produce\ndesire from itself. Kant admits that we have certain general\nconcerns with beauty that mean that desire may follow from a judgment\nof beauty, but according to Kant, such desires do not have their\nsource solely in pleasure in the beautiful (Kant 1790, sections 41 and\n42, on “empirical interest” and “intellectual\ninterest). It may be that we have desires concerning beautiful things,\nas Kant allows in sections 41 and 42 of the Critique of\nJudgment, but so long as those desires are not intrinsic to the\npleasure in beauty, the doctrine that all pleasure in beauty is\ndisinterested is undisturbed. (Critics of Kant sometimes miss this\npoint.)\n\nThe less ambitious thesis is controversial because of the second\ncomponent. An opponent of Kant might claim, not implausibly, that\npleasure in beauty can produce desire by itself. It is not\nclear who is right on this point.\n\nMoreover, whether only pleasure in beauty is disinterested,\nand no other kind of pleasures are disinterested—the ambitious\nthesis—is also controversial. These are live issues.\nKant’s views have much to be said for them. But we can also\nsympathize with those who are doubtful.\n\nHume would probably deny Kant’s separation of pleasure in beauty\nfrom the motivations that lead us to act. Like other British\nsentimentalists, Hume thinks that sentiment and passion both fall on\nthe active side of the human mind. So, sentiments are active in\nthemselves. However, this aspect of the British sentimentalist views\nlooks like a general weakness since they have no convincing place for\na faculty of practical reason, and that means, in turn, that they lack\nany intelligible conception of human action (Korsgaard 1996, 2009).\nHume’s psychology has no plausible understanding of human\nagency; we are pushed around by our passions.\n\nIn his Genealogy of Morals, Friedrich Nietzsche targets\nKant’s separation of pleasure in beauty from desire, a\nseparation that is designed to make beauty available to all\nhuman beings (Nietzsche 1887 [1998], book 3, section 6, the first\npage, but not what follows, which targets Schopenhauer). This\ncriticism is distinct from criticism of the idea that judgments of\nbeauty are valid for all human beings. Nietzsche protests\nthat the idea of pleasure in beauty is cut-off from the\nparticularities and idiosyncrasies of our passionate lives is\nunrealistic and undesirable. It is not clear who is right here. The\nnub of the issue is the nature of pleasure in the beautiful. Does it\nhave its source in what Human beings share, or in what distinguishes\nthem? Kant might argue, against Nietzsche, that seeing pleasure in\nbeauty as springing from what varies between people, not only places\npeople at the mercy of their good or bad aesthetic upbringing, but\nalso makes untenable the normative claims to correctness or universal\nvalidity that are part of judgments of beauty, as we ordinarily\nconceive of them. “Ought”, in this case, seems to imply\n“can”. If we lack what it takes to appreciate a certain\nbeauty, then it cannot be required of us, and the normativity of the\njudgment of taste would be lost. Or so it seems. If judgments of\nbeauty were based on variable pleasures or displeasures, then it seems\nthat the claim to correctness is fraudulent.\n\nBut this only follows if we follow Kant in locating pleasure in\nbeauty, and our right to make judgments of beauty, in faculties that\nall human beings share. Perhaps there are rarefied beauties that only\nNietzsche’s elite special souls can appreciate. For Kant, there\nis an aesthetic “ought” that binds all human beings only\nbecause we share the cognitive faculties that it takes to have the\npleasure in question. But this is not the only conceivable source of\nthe aesthetic “ought”. One non-Kantian suggestion would be\nto locate the source of normativity of the judgment of taste, in the\nworld, not in what human beings share. This would be to invoke a kind\nof “aesthetic realism”, whereby beauty and ugliness are\ngenuine properties of the world, which make our judgments better or\nworse. That view might seem metaphysically extravagant. The trouble,\nthough, is how to understand the aesthetic “ought” without\nthat kind of view. Not easy! On a realist view, beauty need not be\nuniversally available. But if so, it seems that the rationale for\nKant’s doctrine(s) of disinterestedness falls away. The Kantian\nand perhaps Humean view locates the source of normativity in what we\nshare. But Nietzsche would ask: is there, and should there, be\nsomething that humans share in their responses to beauty? Do we want\naristocratic or democratic\n aesthetics?[3]\n4. The Notion of the Aesthetic\n4.1 Some Terminological Remarks\n\nLet us now turn to the contemporary notion of the aesthetic. The\npredicate “aesthetic” can qualify many different kinds of\nthings: judgments, experiences, concepts, properties, or words. It is\nprobably best to take aesthetic judgments as central. We can\nunderstand other aesthetic kinds of things in terms of aesthetic\njudgments: aesthetic properties are those that are ascribed in\naesthetic judgments; aesthetic experiences are those that ground\naesthetic judgments; aesthetic concepts are those that are deployed in\naesthetic judgments; and aesthetic words are those that have the\nfunction of being used in the linguistic expression of aesthetic\njudgments.\n\nThe most common contemporary notion of an aesthetic judgment would\ntake judgments of beauty and ugliness as paradigms—what we\ncalled “judgments of taste” in part 1. And it excludes\njudgments about physical properties, such as shape and size, and\njudgments about sensory properties, such as colors and sounds.\nHowever, in addition to judgments of beauty and ugliness, the\ncontemporary notion of an aesthetic judgment is typically used to\ncharacterize a class of judgments that also includes judgments of\ndaintiness, dumpiness, delicacy and elegance. In this respect, the\ncontemporary notion seems to be broader than Kant’s, since he\nfocused just on judgments of beauty and ugliness. However, there is\nalso a respect in which the contemporary notion seems to be narrower\nthan Kant’s notion. For Kant used the notion to include both\njudgments of beauty (or of taste) as well as judgments of the\nagreeable—for instance, the judgment that Canary-wine\nis nice (Kant 1790, 5: 203–204, 214 [2000: 89–90 and 99]).\nBut the modern notion, unlike Kant’s, usually excludes\njudgments of the agreeable. Moreover, the contemporary notion usually\nexcludes judgments about pictorial and semantic content of a work of\nart. For example, the judgment that a painting represents a flower\nmight be “relevant” to an aesthetic judgment about it, but\nit is not itself an aesthetic judgment.\n4.2 The Problem\n\nThere are worries: is the contemporary classification\n“aesthetic” arbitrary? What is it that distinguishes\njudgments as aesthetic? What do they have in common? How do they\ndiffer from other kinds of judgment? Do these judgments form a\nwell-behaved kind?\n\nIt may be worth mentioning in passing that the notion of an aesthetic\njudgment should obviously not be elucidated in terms of the idea of a\nwork of art; we make aesthetic judgments about nature and we make\nnonaesthetic judgments about works of art.\n\nThe articulation and defense of the notion of the aesthetic in modern\ntimes is associated with Monroe Beardsley (1958, 1982) and Frank\nSibley (1959, 1965). But their work was attacked by George Dickie, Ted\nCohen and Peter Kivy among others (Dickie 1965, Cohen 1973, Kivy\n1975).\n\nAs noted in Section 2.4, Beardsley claimed, heroically, that aesthetic\nexperience is distinguished by its unity, intensity and complexity.\nDickie argued, in reply, that such characteristics were either not\nplausibly necessary conditions of aesthetic experience, or else that\nBeardsley’s description of them was inadequate. Part of\nDickie’s attack was beside the point, since he confused\naesthetic experiences with the experiences of works of art; the fact\nthat some experiences of works of art are not as Beardsley describes\nis irrelevant. But it cannot be denied that Dickie was right that even\nif the problems with characterizing the three features were resolved,\nit would still not be plausible that the three Beardsleyian features\nare necessary (or sufficient) conditions of aesthetic experience.\nNevertheless, all that would show would be that\nBeardsley’s account of the aesthetic is inadequate.\nThat Beardsley’s extraordinary and heroic trinitarian doctrine\ncannot be maintained does not mean that the notion of the aesthetic\nshould be abandoned. That would be a flawed induction from a single\ninstance.\n\nSibley claimed that the discernment of aesthetic properties requires a\nspecial sensitivity, whereas the discernment of nonaesthetic\nproperties could be achieved by anyone with normal eyes and ears.\nFurthermore, Sibley claimed that it was distinctive of aesthetic terms\nor concepts that they were not “condition-governed”, in\nthe sense that they had no nonaesthetic positive criteria for their\napplication. He thought of the faculty of taste as special mental\nfaculty, possessed by people with a distinctive sensitivity. This\naccount of the aesthetic was inadvisable, since it allowed critics\nlike Cohen and Kivy to argue that ascribing many aesthetic properties\ndid not in fact require a special faculty, since anyone can\ndistinguish a graceful line from an ungraceful line. Moreover, some\naesthetic ascriptions, such as elegance, do seem to be\nnonaesthetically “condition-governed”, in Sibley’s\nsense. Nevertheless—once again—that\nSibley’s positive account of the aesthetic is\nimplausible should not lead us to despair about the aesthetic. On the\nother hand, a pessimistic induction, now with two instances under its\nbelt, is perhaps looking a little less unhealthy—especially\ngiven two such distinguished exponents.\n\nDespite this, Sibley was surely minimally right to think that\nascribing aesthetic properties to a thing requires more than merely\nknowing its nonaesthetic properties. Whether or not the extra\nsomething is distinctively difficult, erudite, sophisticated or\nnon-condition-governed, it is something over and above nonaesthetic\nunderstanding. So perhaps we should keep on trying to articulate the\nnotion of the aesthetic, or at least a useful notion of the\naesthetic.\n4.3 A Hierarchical Proposal\n\nOne strategy is the following: begin with the account of what it is to\nbe a judgment of taste, or of beauty and ugliness, that was outlined\nin part 1, and then use that to elucidate a broader notion of an\naesthetic judgment. To recall, it was argued that Kant was right, with\nqualifications, to think that the crucial thing about the judgment of\ntaste is that it has what he calls “subjective\nuniversality”; judgments of taste are those that are (a) based\non responses of pleasure or displeasure, and (b) claim universal\nvalidity, where that can be minimally interpreted as a normative\naspiration. The present strategy is to use this Kantian account in\norder to ground a wider category of the aesthetic, which includes\njudgments of taste along with judgments of daintiness, dumpiness,\ndelicacy, elegance, and the rest.\n\nLet us call judgments of taste, or judgments of beauty and ugliness,\n“verdictive aesthetic judgments”, and let us call the\nother aesthetic judgments (of daintiness, dumpiness, elegance,\ndelicacy, etc.) “substantive aesthetic judgments”. The\nidea is that these substantive judgments are aesthetic in virtue of\nsome special close relation to verdictive judgments of taste, which\nare subjectively universal. We can assume that judgments of beauty and\nugliness coincide with judgments of aesthetic merit and demerit.\nHowever, even if beauty were taken to be a substantive aesthetic\nnotion, like elegance, delicacy or daintiness, there would remain some\nother overarching notion of aesthetic merit or excellence, and we\ncould take that notion as central.\n\nOn this approach, judgments of daintiness, dumpiness, delicacy and\nelegance stand in some special and intimate relation to judgments of\nbeauty and ugliness (or aesthetic merit and demerit), and it is only\nin virtue of this intimate relation that we can think of all these\njudgments as belonging to the same category. This is a hierarchical\nrather than an egalitarian conception of aesthetic notions\n\nNow, what exactly is this special intimate relation between verdictive\nand substantive aesthetic judgments? One suggestion is this: first,\nsubstantive judgments describe ways of being beautiful or\nugly (Burton 1992, Zangwill 1995). It is part of what it\nis for a thing to be elegant, delicate or dainty that it is\nbeautiful in a particular way. And second, it is part of the\nmeaning of substantive aesthetic judgments that they imply\nverdictive aesthetic judgments. This is the hierarchical proposal.\n\nRemark: this claim need not be one about all words like\n“dainty” and “delicate”, but it is about the\nparticular substantive judgments that we linguistically\nexpress in such words on particular occasions. Both Beardsley and\nSibley seem to have made the mistake of casting these issues at the\nlinguistic level rather than at the level of thought; they focused not\non aesthetic words instead of aesthetic judgments and responses.\nSibley did say in footnote 1 of Sibley 1959 that he was concerned with\n“uses” of aesthetic words, but he and everyone else\nignored that qualification.\n\nLet us now see how this hierarchical proposal works. Consider an\nabstract pattern of curving lines, which is elegant. It might be\nnecessary that that pattern is beautiful. This is because the\nbeauty depends on or is determined by that specific\npattern. But it is not part of what it is to be that pattern\nthat it is beautiful. That is, the pattern is necessarily beautiful\nbut it is not essentially beautiful. (On the general distinction\nbetween necessity and essence, see Fine 1994.) Furthermore, we can\nthink of that pattern without thinking of it as beautiful.\n\nBy contrast, it is both necessary and essential that\nsomething that is elegant is beautiful. And this is reflected in our\nconcepts and judgments. We can think of the pattern without thereby\nthinking of it as beautiful, but to think of the pattern as elegant is\nto think of it as beautiful, at least in certain respects. Hence\nelegance is an aesthetic concept.\n\nThe hierarchical proposal thus seems to characterize a non-arbitrary\nand useful notion of the aesthetic. If so, the contemporary broad\nnotion of the aesthetic can be vindicated.\n\nTo see how this works, consider representational properties. Are they\naesthetic properties? Suppose that a painting represents a tree and is\na beautiful representation of a tree. It is not merely beautiful\nand a tree representation but beautiful as a tree\nrepresentation (Zangwill 1999). Of course, that the painting\nrepresents a tree is “relevant” to whether it is beautiful\nbecause it is part of what its beauty depends on. But being beautiful\nis not part of what it is to be a representation of a tree or even\nthat representation of a tree. Moreover, to think that the painting\nrepresents a tree is not thereby to think that it is beautiful. Being\nbeautiful is not an essential property of the representation, and\nthinking of the representation does not mean thinking of it as\nbeautiful, even though it may be necessary that it is beautiful. Hence\nrepresentational properties are not aesthetic properties.\n\nThe proposal faces a challenge, however. Jerrold Levinson has argued\nthat not all substantive properties have evaluative valence (Levinson\n2001). One of his examples is of “starkly grim”. Being\nstarkly grim seems not always to be a way of being beautiful or ugly.\nThe defender of hierarchy could reply that it is specific uses of\nthese words, in context, that pick out features that have evaluative\nvalences. If so, the particular instance of stark grimness might be a\nvaluable aspect of a thing however it is with other instances of stark\ngrimness. But it might be replied that particular instances of stark\ngrimness may be value-neutral? The issue is a difficult one, and I\nleave the issue here.\n\nIf the hierarchical suggestion fails, then we lack one way of\nvindicating the modern broad notion of the aesthetic. Maybe there are\nother ways to give unity to the notion of the aesthetic. However, it\nis not clear that there is another feasible way in the literature.\nLevinson thinks of aesthetic properties as a certain kind of\nappearance properties. We might note that this will immediately rule\nout the aesthetic properties of abstract objects by fiat. More\nimportantly, there remains the question of what kind of appearance\nproperties aesthetic properties are. Even if we are happy with\nindefinite boundaries of the aesthetic, we need some sense of what the\nsub-class is, and its relation to pleasure and beauty. (We might\ncompare the difficulties in characterizing a notion of the aesthetic\nwith the difficulties characterizing a notion of logic.)\n4.4 Beauty and Sublimity\n\nOne notion that is hard to place among other aesthetic notions is that\nof sublimity. There is a long and venerable tradition of thinking that\nbeauty and sublimity share equal status as fundamental aesthetic\ncategories. Sublimity comes in different varieties. Kant distinguishes\n“mathematically” and “dynamically” sublime,\nroughly, corresponding to our sense of the enormity and power of\nthings. The fundamental question about beauty and sublimity is whether\nthey exclude each other. According to the long and venerable\ntradition, if something is sublime then it is not beautiful and vice\nversa. Many have conceived of sublimity such that it excludes beauty.\nBut this is questionable.\n\nIf we conceive of beauty narrowly, where it merely means a certain\nelegance and prettiness (as Levinson does in Levinson 2012), then that\nnarrow concept of beauty would be a substantive aesthetic property.\nThat notion of beauty may exclude sublimity. However, it is\nnot clear that there is reason to restrict beauty in this way. If, on\nthe contrary, beauty (or at least a concept of beauty) is a\ngeneric over-arching aesthetic value, then one suggestion would be\nthat sublimity should be understood as a kind of beauty. In\nthat case, it would turn out that it is sublimity that is a\nsubstantive aesthetic concept, not beauty. On that view, beauty and\nsublimity are not opposed to each other. Instead sublimity is a kind\nof magnificent beauty or a spectacular or extraordinary way of being\nbeautiful.\n\nEdmund Burke links sublimity with pain as well as pleasure, perhaps\ndrawing on Aristotle’s idea of “catharsis” (Burke\n1757). The idea seems to be that judgments of sublimity are grounded\non both pleasure and pain, whereas judgments of beauty are grounded\nonly on pleasure. While this may fit the aesthetic experience of wind\nand rain in a storm at sea or up a mountain, it does not fit the\nsublimity of the stars in the sky and sublime delicacy of a\nspider’s web, where there is no exciting terror. So the pain\naccount is not generally true of the sublime.\n\nRichard Wagner claimed that there was musical sublimity in\nBeethoven’s Ninth Symphony, and that was its great innovation,\nto take us beyond the merely musically-beautiful to the sublime\n(Wagner 1870, contrast Hanslick 1950, 1986). Many musicologists follow\nWagner, (such as Richard Taruskin [1989, 2019]). But on that view, if\nsublimity is associated with danger and extremity, it is not clear\nthat we have a plausible story of why people seek out the sublime in\nmusic. Is it a kind of thrill-seeking, like fairground rides or rock\nclimbing, where people believe themselves to be in danger or at least\ncannot help imagining that they are? Is their experience of\nBeethoven’s Ninth mixed with pain in this way? This seems\nunlikely. Pain and fear have natural expressions on the human face,\nbut the human faces of audiences listening to Beethoven’s Ninth\nare not noticeably different from the human faces listening to Mozart,\nChopin or Tchaikovsky. Their faces are unlike those of those on\nfairground rides or rock climbers who have to make difficult moves.\nFurthermore, the audience of the Ninth are not motivated to flee from\nthe concert hall. Do they have to be strapped into their seats to\nprevent escape as on a fairground ride (contra McClary 1991)? By\ncontrast, on the substantive view of the sublime as a kind of beauty,\nthere is a distinctive kind of pleasure that characterizes the\nexperience of the sublime, on which judgments of the sublime are\nbased. It is an intense pleasure, to be sure. But intensity does not\nentail a mixture with pain.\n\nSublimity in a representational art, such as painting, is a different\nmatter. John Martin’s wonderful painting Apocalypse,\nfor example, does evoke a kind of terror, at least imagined terror. We\nmight plausibly say that this sublimity is not a kind of beauty, even\nthough it is certainly a kind of artistic excellence. What\nthis suggests is that we should avoid a unitary theory of the\nsublime. Some sublimity is a way of being beautiful, and some is\nnot.\n\nThe main downside of this view is that it breaks with one major strand\nof the intellectual tradition in thinking about the sublime in\nopposition to beauty. But it is hard to know much to weigh that\nif we are seeking a useful concept for organizing our experiences of\nart and nature.\n4.5 Aesthetic Morals\n\nSubstantive aesthetic judgments attracted much attention in the latter\nhalf of the twentieth century. If the hierarchical proposal is right,\nthey cannot be studied in isolation, for the role of such judgments is\nto serve verdictive aesthetic judgments of beauty and ugliness. Beauty\nand ugliness are the primary aesthetic notions, which give sense to\nthe wider class that contemporary aestheticians include as\n“aesthetic”. The broad notion of the aesthetic can be\nfixed by what it is to judge that something is beautiful or ugly, or\nthat it has aesthetic merit or demerit. By seeing beauty and ugliness\nas the preeminent aesthetic notions we can make sense of a unitary\ncategory of the aesthetic, which includes the dainty and the dumpy,\nelegance and sublimity, and which excludes physical, sensory and\nrepresentational properties of things, as well as their agreeableness.\nThe hierarchical proposal seems to allow us to make the\naesthetic/nonaesthetic distinction in a useful way and answer\nBeardsley and Sibley’s critics. Perhaps in this way the notion\nof the aesthetic can be defended. However, some may think that\nLevinson is right about substantive aesthetic concepts and judgments,\nin which case the notion of the aesthetic has a question mark hanging\nover it.\n",
    "bibliography": {
        "categories": [
            "References",
            "Further Reading"
        ],
        "cat_ref_text": {
            "References": [
                "</h3>\n<ul class=\"hanging\">",
                "Barker, John, 2009, “Mathematical Beauty”, <em>Sztuka\ni Filozofia</em>, 35: 65–74.\n<p class=\"bibnote\">\nA powerful defence of the claim that mathematical and logical proofs\nhave aesthetic properties.</p>",
                "Beardsley, Monroe C., 1958, <em>Aesthetics: Problems in the\nPhilosophy of Criticism</em>, Indianapolis, IN: Hackett.\n<p class=\"bibnote\">\nAn extraordinary work, impressive in scope, deploying the notion of\nthe aesthetic. The target of Dickie’s critique.</p>",
                "–––, 1982, <em>The Aesthetic Point of View:\nSelected Essays</em>, Ithaca, NY: Cornell University Press.\n<p class=\"bibnote\">\nA selection of Beardsley’s essays.</p>",
                "Blackburn, Simon, 1998, <em>Ruling Passions: A Theory of Practical\nReasoning</em>, Oxford: Oxford University Press.\n<p class=\"bibnote\">\nA defense of expressivism, a modern version of Hume’s\nsentimentalism.</p>",
                "Budd, Malcolm, 2001, “The Pure Judgement of Taste as an\nAesthetic Reflective Judgement”, <em>British Journal of\nAesthetics</em>, 41(3): 247–260.\ndoi:10.1093/bjaesthetics/41.3.247\n<p class=\"bibnote\">\nRefreshingly less deferential than many writings on Kant.</p>",
                "Burke, Edmund, 1757 [1998], <em>A Philosophical Enquiry into the\nOrigin of Our Ideas of the Sublime and Beautiful</em>, London: R. and\nJ. Dodsley. Reprinted Harmonsworth: Penguin, 1998.\n<p class=\"bibnote\">\nA classic, although it is sometimes eccentric.</p>",
                "Burton, Stephan L., 1992, “‘Thick’ Concepts\nRevised”, <em>Analysis</em>, 52(1): 28–32.\ndoi:10.1093/analys/52.1.28\n<p class=\"bibnote\">\nAn insightful account of substantive aesthetic descriptions, and also\nof so-called “thick moral concepts”.</p>",
                "Cohen, Ted, 1973, “ Aesthetic/Non-Aesthetic and the Concept\nof Taste: A Critique of Sibley’s Position”,\n<em>Theoria</em>, 39(1–3): 113–152.\ndoi:10.1111/j.1755-2567.1973.tb00633.x\n<p class=\"bibnote\">\nArgues that Sibley’s account of what makes concepts aesthetic\nwill not do.</p>",
                "Cova, Florian and Nicholas Pain, 2012, “Can Folk Aesthetics\nGround Aesthetic Realism?”, <em>Monist</em>, 95(2):\n241–263. doi:10.5840/monist201295214\n<p class=\"bibnote\">\nArgues that folk aesthetic is not normativist.</p>",
                "Dickie, George, 1965, “Beardsley’s Phantom Aesthetic\nExperience”, <em>Journal of Philosophy</em>, 62(5):\n129–136. doi:10.2307/2023490\n<p class=\"bibnote\">\nArgues that Beardsley’s account of aesthetic experience will not\ndo.</p>",
                "Davidson, Donald, 1970 [1980], “Mental Events”, in\n<em>Experience and Theory</em>, Lawrence Foster and J. W. Swanson\n(eds), Amherst, MA: University of Massachusetts Press and Duckworth.\nReprinted in <em>Essays on Actions and Events</em>, Oxford: Clarendon\nPress, 1980, ch. 11. doi:10.1093/0199246270.003.0011\n<p class=\"bibnote\">\nA classic paper in the philosophy of mind arguing for a version of\nmaterialism without strict laws relating the mental and the\nphysical.</p>",
                "Fine, Kit, 1994, “Essence and Modality: The Second\nPhilosophical Perspectives Lecture”, <em>Philosophical\nPerspectives</em>, 8: 1–16. doi:10.2307/2214160\n<p class=\"bibnote\">\nDistinguishes essence from modality; of general philosophical\nimportance.</p>",
                "Gombrich, Ernst H., 1959, <em>Art and Illusion: A Study in the\nPsychology of Pictorial Representation</em>, London: Phaiden.\n<p class=\"bibnote\">\nArgues for anti-formalism by appeal to indiscernibles.</p>",
                "Gorodeisky, Keren and Eric Marcus, 2018, “Aesthetic\nRationality”, <em>The Journal of Philosophy</em>, 115(3):\n113–140.",
                "–––, 2022, “Aesthetic\nKnowledge”, <em>Philosophical Studies</em>, 179:\n2507–2535.",
                "Hanslick, Eduard, 1986, <em>On the Musically Beautiful</em>,\ntransl. Geoffrey Payzant, Indianapolis: Hackett.\n<p class=\"bibnote\">\nClassic work of musical aesthetics, first published in 1854. Written\nwith panache and wit.</p>",
                "Hanslick, Eduard, 1950, <em>Hanslick’s Music Criticism</em>,\ntranslated and edited by Henry Pleasants, London: Dover.\n<p class=\"bibnote\">\nCritical reviews of Bach and Wagner and others. You almost feel sorry\nfor Wagner reading some of these.</p>",
                "Hughes, Brian, 2016, <em>Rethinking Psychology: Good Science, Bad\nScience, Pseudo-Science</em>, London: Macmillan.\n<p class=\"bibnote\">\nThorough critique of much questionnaire psychology, posing fundamental\nchallenges for so-called “experimental\nphilosophy”.</p>",
                "Hume, David, 1757 [1985], “Of the Standard of Taste”,\npage reference is to reprint in <em>Essays: Moral, Political and\nLiterary</em>, Eugene Miller (ed.), Indianapolis, IN: Liberty, 1985.\n<p class=\"bibnote\">\nHume’s classic attempt to reconcile sentimentalism with\nnormativity.</p>",
                "Kant, Immanuel, 1790 [2000], <em>Critique of the Power of\nJudgment</em> (<em>Kritik der Urteilskraft</em>), page reference to\nthe 2000 translation by Paul Guyer and Eric Matthews, Cambridge:\nCambridge University Press.\n<p class=\"bibnote\">\n Includes the idea that judgments of beauty and ugliness are\nsubjectively universal, and much else.</p>",
                "Kivy, Peter, 1975, “What Makes ‘Aesthetic’ Terms\n<em>Aesthetic</em>?”, <em>Philosophy and Phenomenological\nResearch</em>, 36(2): 197–211.\n<p class=\"bibnote\">\nArgues that Sibley’s unitary notion of the aesthetic has no\nbasis. Kivy also makes a positive suggestion.</p>",
                "–––, 1991, “Science and Aesthetic\nAppreciation”, <em>Midwest Studies in Philosophy</em>, 16(1):\n180–195. doi:10.1111/j.1475-4975.1991.tb00238.x\n<p class=\"bibnote\">\nSympathetic to mathematical beauty.</p>",
                "Korsgaard, Christine M., 1996, <em>The Sources of\nNormativity</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511554476\n<p class=\"bibnote\">\nDefends a Kantian view of agency and includes a powerful critique of\nsentimentalist accounts.</p>",
                "–––, 2009, <em>Self-Constitution: Agency,\nIdentity, and Integrity</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199552795.001.0001\n<p class=\"bibnote\">\n Deploys the idea that we aim at a kind of unity in our\nactions.</p>",
                "Levinson, Jerrold, 2001, “Aesthetic Properties, Evaluative\nForce, and Differences of Sensibility”, in <em>Aesthetic\nConcepts: Essays After Sibley</em>, Emily Brady and Jerrold Levinson\n(eds.), Oxford: Oxford University Press, pp. 61–80. Reprinted in\nJerrold Levinson, <em>Contemplating Art: Essays in Aesthetics</em>,\nOxford: Oxford University Press, 2015: 315–335.\ndoi:10.1093/acprof:oso/9780199206179.003.0020\n<p class=\"bibnote\">\nArgues for some neutral substantive aesthetic properties.</p>",
                "–––, 2012, “Musical Beauty”,\n<em>Teorema</em>, 31(3): 127–135. Reprinted in Jerrold Levinson,\n<em>Musical Concerns: Essays in Philosophy of Music</em>, Oxford:\nOxford University Press, 2015: 58–66.\ndoi:10.1093/acprof:oso/9780199669660.003.0006\n<p class=\"bibnote\">\nA nuanced examination of one notion of beauty.</p>",
                "Lord, Errol, 2019, “The Nature of Perceptual Expertise and\nthe Rationality of Criticism”, <em>Ergo</em>, 6(29). \ndoi:10.3998/ergo.12405314.0006.029",
                "McClary, Susan, 1991: <em>Feminine Endings: Music, Gender, and\nSexuality</em>. Minneapolis: University of Minnesota Press.\n<p class=\"bibnote\">\nA classic of so-called ‘New Musicology’.</p>",
                "Mitrović, Branko, 2013, <em>Visuality for Architects:\nArchitectural Creativity and Modern Theories of Perception and\nImagination</em>, Charlottesville, VA: University of Virginia Press.\n<p class=\"bibnote\">\nPuts the visual dimension back into architecture.</p>",
                "–––, 2018, “Visuality and Aesthetic\nFormalism”, <em>British Journal of Aesthetics</em>, 58(2):\n147–163. doi:10.1093/aesthj/ayy001\n<p class=\"bibnote\">\n Explores and defends the psychological basis of visual\nformalism.</p>",
                "Mothersill, Mary, 1984, <em>Beauty Restored</em>, Oxford: Oxford\nUniversity Press.\n<p class=\"bibnote\">\nAn exploration of the notion of beauty, with some historical\ncoverage.</p>",
                "Nguyen, C Thi, 2020, “Autonomy and Aesthetic\nEngagement”, <em>Mind</em>, 129(516): 1127–1156.",
                "Nietzsche, Friedrich, 1887 [1998], <em>On the Genealogy of\nMorals</em> (<em>Zur Genealogie der Moral: Eine Streitschrift</em>),\nMaudemarie Clarke and Alan J. Swensen (trans.), Indianapolis, IN:\nHackett, 1998.\n<p class=\"bibnote\">\nBook 3, sections 1–6. An interesting, and not at all uncareful,\ncritique of Kant’s aesthetics. In this passage he is not\nconcerned with Schopenhauer.</p>",
                "Scruton, Roger, 1974, <em>Art and Imagination: A Study in the\nPhilosophy of Mind</em>, London: Methuen.\n<p class=\"bibnote\">\nA wide-ranging book, in which the role of imagination is\nhighlighted.</p>",
                "–––, 1979, <em>The Aesthetics of\nArchitecture</em>, London: Methuen.\n<p class=\"bibnote\">\nA superb discussion of architecture, but also contains much material\nrelevant to more central topics in aesthetics.</p>",
                "Schellekens, Elisabeth 2007 [2017], “Conceptual Art”,\n<em>Stanford Encyclopedia of Philosophy</em> (Winter 2017 edition),\nEdward N. Zalta (ed.). URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2017/entries/conceptual-art/\" target=\"other\">https://plato.stanford.edu/archives/win2017/entries/conceptual-art/</a>&gt;\n <p class=\"bibnote\">\nA sympathetic interpretation of some of the claims of conceptual\nartists about their work.</p>",
                "Sibley, Frank, 1959, “Aesthetic Concepts”,\n<em>Philosophical Review</em>, 68(4): 421–450; reprinted in\nSibley 2001: 1–23. 10.2307/2182490 &amp;\ndoi:10.1093/0198238991.003.0001\n<p class=\"bibnote\">\nSibley’s classic paper, which makes the notion of the aesthetic\ncentral. The target of Cohen and Kivy’s critiques.</p>",
                "–––, 1965, “Aesthetic and\nNonaesthetic”, <em>Philosophical Review</em>, 74(2):\n135–159; reprinted in Sibley 2001: 33–51.\ndoi:10.2307/2183262 &amp; doi:10.1093/0198238991.003.0003\n<p class=\"bibnote\">\nExplores the dependence of aesthetic features on nonaesthetic\nfeatures. This paper was originally the second part of Sibley’s\npaper “Aesthetic Concepts”.</p>",
                "–––, 2001, <em>Approach to Aesthetics</em>, John\nBenson, Betty Redfern, and Jeremy Roxbee Cox (eds.), Oxford University\nPress. doi:10.1093/0198238991.001.0001",
                "Taruskin, Richard, 1989 [1995], “Resisting the Ninth”,\n<em>Nineteenth-Century Music</em>, 12(3): 241–256; reprinted in\nhis <em>Text and Act: Essays on Music and Performance</em>, Oxford:\nOxford University Press, 1995: 235–261. doi:10.2307/746505\n<p class=\"bibnote\">\nAgrees with Wagner about the sublime and the beautiful in\nBeethoven’s Ninth Symphony.</p>",
                "–––, 2019, “Essence <em>or</em>\nContext”, in <em>Essence and Context</em>, Rima Povilioniene,\nRūta Stanevičiūtė, and Nick Zangwill (eds.), New\nYork: Springer-Palgrave-Macmillan. Reprinted in Richard Taruskin,\nCursed Questions: On Music and Its Social Practices, University of\nCalifornia Press, 2020.\n<p class=\"bibnote\">\nArgues against a Hanslickean view and argues for a Wagnerian\nconception of the sublime in Beethoven.</p>",
                "Wagner, Richard 1870 [2014], <em>Beethoven</em>, translated by\nRoger Allen, Boydell Press. Originally published Leipzig: Verlag von\nE. W. Fritzsche.\n<p class=\"bibnote\">\nMakes claims about the sublime in Beethoven.</p>",
                "Walton, Kendall, 1970, “Categories of Art”,\n<em>Philosophical Review</em>, 79: 334–367.\n<p class=\"bibnote\">\nInfluential series of anti-formalist arguments.</p>",
                "Williams, Jessica J., 2021, “Kant on Aesthetic\nAttention”, <em>British Journal of Aesthetics</em> 61. No. 4,\npp. 421–435.\n<p class=\"bibnote\">\n A vigorous recent investigation of Kant’s views.</p>",
                "Zangwill, Nick, 1995 [2001], “The Beautiful, the Dainty and\nthe Dumpy”, <em>British Journal of Aesthetics</em>, 35(4):\n317–329; reprinted slightly modified in Zangwill 2001:\n9–23. doi:10.1093/bjaesthetics/35.4.317\n<p class=\"bibnote\">\nIncludes a statement and defense of the centrality of beauty and\nugliness among other aesthetic concepts.</p>",
                "–––, 1999 [2001], “Feasible Aesthetic\nFormalism”, <em>Noûs</em>, 33(4): 610–629; reprinted\nin Zangwill 2001: 55–81. doi:10.1111/0029-4624.00196\n<p class=\"bibnote\">\nArgues for a “moderate” formalist view that allows that\nthings can be “dependently beautiful”, in Kant’s\nsense.</p>",
                "–––, 2001, <em>The Metaphysics of Beauty</em>,\nIthaca, NY: Cornell University Press.",
                "–––, 2013, “Nietzsche on Kant on Beauty\nand Disinterest”, <em>History of Philosophy Quarterly</em>,\n30(1): 75–91.\n [<a href=\"http://hpq.press.uillinois.edu/30/1/zangwill.html\" target=\"other\">Zangwill 2013 available online</a>]\n <p class=\"bibnote\">\nSympathetically interprets and defends Nietzsche’s criticism of\nKant on disinterest.</p>",
                "–––, 2019, “Folk Aesthetics and\nNormativity: A Critique of Experimental Aesthetics”, in\n<em>Advances in Experimental Philosophy of Aesthetics</em>, Florian\nCova and Sébastien Réhault (eds), London: Bloomsbury.\n<p class=\"bibnote\">\nCriticizes ‘experimental philosophy’, in general, and in\nparticular the experimental denial that ordinary aesthetic judgments\nclaim correctness.</p>",
                "Zemach, Eddy, 1995, <em>Real Beauty</em>, University Park: Penn\nState Press.\n<p class=\"bibnote\">\nArgues for an extreme realist view.</p>",
                "Zuckert, Rachel, 2007, <em>Kant on Beauty and Biology: An\nInterpretation of the Critique of Judgment</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9780511487323\n<p class=\"bibnote\">\nAn insightful scholarly and philosophical investigation.</p>\n</ul>\n<h3 id=\"FurtRead\">"
            ],
            "Further Reading": [
                "</h3>\n<ul class=\"hanging\">",
                "Bender, John W., 1995, “General but Defeasible Reasons in\nAesthetic Evaluation: The Particularist/Generalist Dispute”,\n<em>Journal of Aesthetics and Art Criticism</em>, 53(4):\n379–392. doi:10.2307/430973",
                "Dickie, George, 1988, <em>Evaluating Art</em>, Philadelphia:\nTemple University Press.",
                "Goldman, Alan, 1995, <em>Aesthetic Value</em>, Boulder, CO:\nWestview.",
                "Greenberg, Clement, 1999, <em>Homemade Esthetics</em>, Oxford:\nOxford University Press.",
                "Hopkins, Robert, 2011, “How to Be a Pessimist about\nAesthetic Testimony”,, <em>Journal of Philosophy</em>, 108(3):\n138–157. doi:10.5840/jphil201110838",
                "Kivy, Peter, 1968, “Aesthetic Aspects and Aesthetic\nQualities”, <em>Journal of Philosophy</em>, 65(4): 85–93.\ndoi:10.2307/2024481",
                "Levinson, Jerrold, 1992 [1996], “Pleasure and the Value of\nWorks of Art”, <em>The British Journal of Aesthetics</em>,\n32(4): 295–306. Reprinted in his <em>The Pleasures of\nAesthetics: Philosophical Essays</em>, Ithaca, NY: Cornell University\nPress, 11–24. doi:10.1093/bjaesthetics/32.4.295",
                "McCloskey, Mary, 1987, <em>Kant’s Aesthetic</em>, New York:\nSUNY Press.",
                "Plato, <em>Hippias Major</em>. In <em>Plato’s Complete\nWorks</em>, edited by John Cooper, Indianapolis: Hackett, 1997.",
                "Saito, Yuriko, 2001, “Everyday Aesthetics”,\n<em>Philosophy and Literature</em>, 25)1): 87–95.\ndoi:10.1353/phl.2001.0018",
                "–––, 2007, <em>Everyday Aesthetics</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780199278350.001.0001",
                "Scruton, Roger, 1983, “Understanding Music”, in his\n<em>The Aesthetic Understanding: Essays in the Philosophy of Art and\nCulture</em>, London: Carcanet.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"Refe\">References</h3>\n<ul class=\"hanging\">\n<li>Barker, John, 2009, “Mathematical Beauty”, <em>Sztuka\ni Filozofia</em>, 35: 65–74.\n<p class=\"bibnote\">\nA powerful defence of the claim that mathematical and logical proofs\nhave aesthetic properties.</p></li>\n<li>Beardsley, Monroe C., 1958, <em>Aesthetics: Problems in the\nPhilosophy of Criticism</em>, Indianapolis, IN: Hackett.\n<p class=\"bibnote\">\nAn extraordinary work, impressive in scope, deploying the notion of\nthe aesthetic. The target of Dickie’s critique.</p></li>\n<li>–––, 1982, <em>The Aesthetic Point of View:\nSelected Essays</em>, Ithaca, NY: Cornell University Press.\n<p class=\"bibnote\">\nA selection of Beardsley’s essays.</p></li>\n<li>Blackburn, Simon, 1998, <em>Ruling Passions: A Theory of Practical\nReasoning</em>, Oxford: Oxford University Press.\n<p class=\"bibnote\">\nA defense of expressivism, a modern version of Hume’s\nsentimentalism.</p></li>\n<li>Budd, Malcolm, 2001, “The Pure Judgement of Taste as an\nAesthetic Reflective Judgement”, <em>British Journal of\nAesthetics</em>, 41(3): 247–260.\ndoi:10.1093/bjaesthetics/41.3.247\n<p class=\"bibnote\">\nRefreshingly less deferential than many writings on Kant.</p></li>\n<li>Burke, Edmund, 1757 [1998], <em>A Philosophical Enquiry into the\nOrigin of Our Ideas of the Sublime and Beautiful</em>, London: R. and\nJ. Dodsley. Reprinted Harmonsworth: Penguin, 1998.\n<p class=\"bibnote\">\nA classic, although it is sometimes eccentric.</p></li>\n<li>Burton, Stephan L., 1992, “‘Thick’ Concepts\nRevised”, <em>Analysis</em>, 52(1): 28–32.\ndoi:10.1093/analys/52.1.28\n<p class=\"bibnote\">\nAn insightful account of substantive aesthetic descriptions, and also\nof so-called “thick moral concepts”.</p></li>\n<li>Cohen, Ted, 1973, “ Aesthetic/Non-Aesthetic and the Concept\nof Taste: A Critique of Sibley’s Position”,\n<em>Theoria</em>, 39(1–3): 113–152.\ndoi:10.1111/j.1755-2567.1973.tb00633.x\n<p class=\"bibnote\">\nArgues that Sibley’s account of what makes concepts aesthetic\nwill not do.</p></li>\n<li>Cova, Florian and Nicholas Pain, 2012, “Can Folk Aesthetics\nGround Aesthetic Realism?”, <em>Monist</em>, 95(2):\n241–263. doi:10.5840/monist201295214\n<p class=\"bibnote\">\nArgues that folk aesthetic is not normativist.</p></li>\n<li>Dickie, George, 1965, “Beardsley’s Phantom Aesthetic\nExperience”, <em>Journal of Philosophy</em>, 62(5):\n129–136. doi:10.2307/2023490\n<p class=\"bibnote\">\nArgues that Beardsley’s account of aesthetic experience will not\ndo.</p></li>\n<li>Davidson, Donald, 1970 [1980], “Mental Events”, in\n<em>Experience and Theory</em>, Lawrence Foster and J. W. Swanson\n(eds), Amherst, MA: University of Massachusetts Press and Duckworth.\nReprinted in <em>Essays on Actions and Events</em>, Oxford: Clarendon\nPress, 1980, ch. 11. doi:10.1093/0199246270.003.0011\n<p class=\"bibnote\">\nA classic paper in the philosophy of mind arguing for a version of\nmaterialism without strict laws relating the mental and the\nphysical.</p></li>\n<li>Fine, Kit, 1994, “Essence and Modality: The Second\nPhilosophical Perspectives Lecture”, <em>Philosophical\nPerspectives</em>, 8: 1–16. doi:10.2307/2214160\n<p class=\"bibnote\">\nDistinguishes essence from modality; of general philosophical\nimportance.</p></li>\n<li>Gombrich, Ernst H., 1959, <em>Art and Illusion: A Study in the\nPsychology of Pictorial Representation</em>, London: Phaiden.\n<p class=\"bibnote\">\nArgues for anti-formalism by appeal to indiscernibles.</p></li>\n<li>Gorodeisky, Keren and Eric Marcus, 2018, “Aesthetic\nRationality”, <em>The Journal of Philosophy</em>, 115(3):\n113–140.</li>\n<li>–––, 2022, “Aesthetic\nKnowledge”, <em>Philosophical Studies</em>, 179:\n2507–2535.</li>\n<li>Hanslick, Eduard, 1986, <em>On the Musically Beautiful</em>,\ntransl. Geoffrey Payzant, Indianapolis: Hackett.\n<p class=\"bibnote\">\nClassic work of musical aesthetics, first published in 1854. Written\nwith panache and wit.</p></li>\n<li>Hanslick, Eduard, 1950, <em>Hanslick’s Music Criticism</em>,\ntranslated and edited by Henry Pleasants, London: Dover.\n<p class=\"bibnote\">\nCritical reviews of Bach and Wagner and others.  You almost feel sorry\nfor Wagner reading some of these.</p></li>\n<li>Hughes, Brian, 2016, <em>Rethinking Psychology: Good Science, Bad\nScience, Pseudo-Science</em>, London: Macmillan.\n<p class=\"bibnote\">\nThorough critique of much questionnaire psychology, posing fundamental\nchallenges for so-called “experimental\nphilosophy”.</p></li>\n<li>Hume, David, 1757 [1985], “Of the Standard of Taste”,\npage reference is to reprint in <em>Essays: Moral, Political and\nLiterary</em>, Eugene Miller (ed.), Indianapolis, IN: Liberty, 1985.\n<p class=\"bibnote\">\nHume’s classic attempt to reconcile sentimentalism with\nnormativity.</p></li>\n<li>Kant, Immanuel, 1790 [2000], <em>Critique of the Power of\nJudgment</em> (<em>Kritik der Urteilskraft</em>), page reference to\nthe 2000 translation by Paul Guyer and Eric Matthews, Cambridge:\nCambridge University Press.\n<p class=\"bibnote\">\n Includes the idea that judgments of beauty and ugliness are\nsubjectively universal, and much else.</p></li>\n<li>Kivy, Peter, 1975, “What Makes ‘Aesthetic’ Terms\n<em>Aesthetic</em>?”, <em>Philosophy and Phenomenological\nResearch</em>, 36(2): 197–211.\n<p class=\"bibnote\">\nArgues that Sibley’s unitary notion of the aesthetic has no\nbasis. Kivy also makes a positive suggestion.</p></li>\n<li>–––, 1991, “Science and Aesthetic\nAppreciation”, <em>Midwest Studies in Philosophy</em>, 16(1):\n180–195. doi:10.1111/j.1475-4975.1991.tb00238.x\n<p class=\"bibnote\">\nSympathetic to mathematical beauty.</p></li>\n<li>Korsgaard, Christine M., 1996, <em>The Sources of\nNormativity</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511554476\n<p class=\"bibnote\">\nDefends a Kantian view of agency and includes a powerful critique of\nsentimentalist accounts.</p></li>\n<li>–––, 2009, <em>Self-Constitution: Agency,\nIdentity, and Integrity</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199552795.001.0001\n<p class=\"bibnote\">\n Deploys the idea that we aim at a kind of unity in our\nactions.</p></li>\n<li>Levinson, Jerrold, 2001, “Aesthetic Properties, Evaluative\nForce, and Differences of Sensibility”, in <em>Aesthetic\nConcepts: Essays After Sibley</em>, Emily Brady and Jerrold Levinson\n(eds.), Oxford: Oxford University Press, pp. 61–80. Reprinted in\nJerrold Levinson, <em>Contemplating Art: Essays in Aesthetics</em>,\nOxford: Oxford University Press, 2015: 315–335.\ndoi:10.1093/acprof:oso/9780199206179.003.0020\n<p class=\"bibnote\">\nArgues for some neutral substantive aesthetic properties.</p></li>\n<li>–––, 2012, “Musical Beauty”,\n<em>Teorema</em>, 31(3): 127–135. Reprinted in Jerrold Levinson,\n<em>Musical Concerns: Essays in Philosophy of Music</em>, Oxford:\nOxford University Press, 2015: 58–66.\ndoi:10.1093/acprof:oso/9780199669660.003.0006\n<p class=\"bibnote\">\nA nuanced examination of one notion of beauty.</p></li>\n<li>Lord, Errol, 2019, “The Nature of Perceptual Expertise and\nthe Rationality of Criticism”, <em>Ergo</em>, 6(29). \ndoi:10.3998/ergo.12405314.0006.029</li>\n<li>McClary, Susan, 1991: <em>Feminine Endings: Music, Gender, and\nSexuality</em>. Minneapolis: University of Minnesota Press.\n<p class=\"bibnote\">\nA classic of so-called ‘New Musicology’.</p></li>\n<li>Mitrović, Branko, 2013, <em>Visuality for Architects:\nArchitectural Creativity and Modern Theories of Perception and\nImagination</em>, Charlottesville, VA: University of Virginia Press.\n<p class=\"bibnote\">\nPuts the visual dimension back into architecture.</p></li>\n<li>–––, 2018, “Visuality and Aesthetic\nFormalism”, <em>British Journal of Aesthetics</em>, 58(2):\n147–163. doi:10.1093/aesthj/ayy001\n<p class=\"bibnote\">\n Explores and defends the psychological basis of visual\nformalism.</p></li>\n<li>Mothersill, Mary, 1984, <em>Beauty Restored</em>, Oxford: Oxford\nUniversity Press.\n<p class=\"bibnote\">\nAn exploration of the notion of beauty, with some historical\ncoverage.</p></li>\n<li>Nguyen, C Thi, 2020, “Autonomy and Aesthetic\nEngagement”, <em>Mind</em>, 129(516): 1127–1156.</li>\n<li>Nietzsche, Friedrich, 1887 [1998], <em>On the Genealogy of\nMorals</em> (<em>Zur Genealogie der Moral: Eine Streitschrift</em>),\nMaudemarie Clarke and Alan J. Swensen (trans.), Indianapolis, IN:\nHackett, 1998.\n<p class=\"bibnote\">\nBook 3, sections 1–6. An interesting, and not at all uncareful,\ncritique of Kant’s aesthetics. In this passage he is not\nconcerned with Schopenhauer.</p></li>\n<li>Scruton, Roger, 1974, <em>Art and Imagination: A Study in the\nPhilosophy of Mind</em>, London: Methuen.\n<p class=\"bibnote\">\nA wide-ranging book, in which the role of imagination is\nhighlighted.</p></li>\n<li>–––, 1979, <em>The Aesthetics of\nArchitecture</em>, London: Methuen.\n<p class=\"bibnote\">\nA superb discussion of architecture, but also contains much material\nrelevant to more central topics in aesthetics.</p></li>\n<li>Schellekens, Elisabeth 2007 [2017], “Conceptual Art”,\n<em>Stanford Encyclopedia of Philosophy</em> (Winter 2017 edition),\nEdward N. Zalta (ed.). URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2017/entries/conceptual-art/\" target=\"other\">https://plato.stanford.edu/archives/win2017/entries/conceptual-art/</a>&gt;\n <p class=\"bibnote\">\nA sympathetic interpretation of some of the claims of conceptual\nartists about their work.</p></li>\n<li>Sibley, Frank, 1959, “Aesthetic Concepts”,\n<em>Philosophical Review</em>, 68(4): 421–450; reprinted in\nSibley 2001: 1–23. 10.2307/2182490 &amp;\ndoi:10.1093/0198238991.003.0001\n<p class=\"bibnote\">\nSibley’s classic paper, which makes the notion of the aesthetic\ncentral. The target of Cohen and Kivy’s critiques.</p></li>\n<li>–––, 1965, “Aesthetic and\nNonaesthetic”, <em>Philosophical Review</em>, 74(2):\n135–159; reprinted in Sibley 2001: 33–51.\ndoi:10.2307/2183262 &amp; doi:10.1093/0198238991.003.0003\n<p class=\"bibnote\">\nExplores the dependence of aesthetic features on nonaesthetic\nfeatures. This paper was originally the second part of Sibley’s\npaper “Aesthetic Concepts”.</p></li>\n<li>–––, 2001, <em>Approach to Aesthetics</em>, John\nBenson, Betty Redfern, and Jeremy Roxbee Cox (eds.), Oxford University\nPress. doi:10.1093/0198238991.001.0001</li>\n<li>Taruskin, Richard, 1989 [1995], “Resisting the Ninth”,\n<em>Nineteenth-Century Music</em>, 12(3): 241–256; reprinted in\nhis <em>Text and Act: Essays on Music and Performance</em>, Oxford:\nOxford University Press, 1995: 235–261. doi:10.2307/746505\n<p class=\"bibnote\">\nAgrees with Wagner about the sublime and the beautiful in\nBeethoven’s Ninth Symphony.</p></li>\n<li>–––, 2019, “Essence <em>or</em>\nContext”, in <em>Essence and Context</em>, Rima Povilioniene,\nRūta Stanevičiūtė, and Nick Zangwill (eds.), New\nYork: Springer-Palgrave-Macmillan. Reprinted in Richard Taruskin,\nCursed Questions: On Music and Its Social Practices, University of\nCalifornia Press, 2020.\n<p class=\"bibnote\">\nArgues against a Hanslickean view and argues for a Wagnerian\nconception of the sublime in Beethoven.</p></li>\n<li>Wagner, Richard 1870 [2014], <em>Beethoven</em>, translated by\nRoger Allen, Boydell Press. Originally published Leipzig: Verlag von\nE. W. Fritzsche.\n<p class=\"bibnote\">\nMakes claims about the sublime in Beethoven.</p></li>\n<li>Walton, Kendall, 1970, “Categories of Art”,\n<em>Philosophical Review</em>, 79: 334–367.\n<p class=\"bibnote\">\nInfluential series of anti-formalist arguments.</p></li>\n<li>Williams, Jessica J., 2021, “Kant on Aesthetic\nAttention”, <em>British Journal of Aesthetics</em> 61. No. 4,\npp. 421–435.\n<p class=\"bibnote\">\n A vigorous recent investigation of Kant’s views.</p></li>\n<li>Zangwill, Nick, 1995 [2001], “The Beautiful, the Dainty and\nthe Dumpy”, <em>British Journal of Aesthetics</em>, 35(4):\n317–329; reprinted slightly modified in Zangwill 2001:\n9–23. doi:10.1093/bjaesthetics/35.4.317\n<p class=\"bibnote\">\nIncludes a statement and defense of the centrality of beauty and\nugliness among other aesthetic concepts.</p></li>\n<li>–––, 1999 [2001], “Feasible Aesthetic\nFormalism”, <em>Noûs</em>, 33(4): 610–629; reprinted\nin Zangwill 2001: 55–81. doi:10.1111/0029-4624.00196\n<p class=\"bibnote\">\nArgues for a “moderate” formalist view that allows that\nthings can be “dependently beautiful”, in Kant’s\nsense.</p></li>\n<li>–––, 2001, <em>The Metaphysics of Beauty</em>,\nIthaca, NY: Cornell University Press.</li>\n<li>–––, 2013, “Nietzsche on Kant on Beauty\nand Disinterest”, <em>History of Philosophy Quarterly</em>,\n30(1): 75–91.\n [<a href=\"http://hpq.press.uillinois.edu/30/1/zangwill.html\" target=\"other\">Zangwill 2013 available online</a>]\n <p class=\"bibnote\">\nSympathetically interprets and defends Nietzsche’s criticism of\nKant on disinterest.</p></li>\n<li>–––, 2019, “Folk Aesthetics and\nNormativity: A Critique of Experimental Aesthetics”, in\n<em>Advances in Experimental Philosophy of Aesthetics</em>, Florian\nCova and Sébastien Réhault (eds), London: Bloomsbury.\n<p class=\"bibnote\">\nCriticizes ‘experimental philosophy’, in general, and in\nparticular the experimental denial that ordinary aesthetic judgments\nclaim correctness.</p></li>\n<li>Zemach, Eddy, 1995, <em>Real Beauty</em>, University Park: Penn\nState Press.\n<p class=\"bibnote\">\nArgues for an extreme realist view.</p></li>\n<li>Zuckert, Rachel, 2007, <em>Kant on Beauty and Biology: An\nInterpretation of the Critique of Judgment</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9780511487323\n<p class=\"bibnote\">\nAn insightful scholarly and philosophical investigation.</p></li>\n</ul>\n<h3 id=\"FurtRead\">Further Reading</h3>\n<ul class=\"hanging\">\n<li>Bender, John W., 1995, “General but Defeasible Reasons in\nAesthetic Evaluation: The Particularist/Generalist Dispute”,\n<em>Journal of Aesthetics and Art Criticism</em>, 53(4):\n379–392. doi:10.2307/430973</li>\n<li>Dickie, George, 1988, <em>Evaluating Art</em>, Philadelphia:\nTemple University Press.</li>\n<li>Goldman, Alan, 1995, <em>Aesthetic Value</em>, Boulder, CO:\nWestview.</li>\n<li>Greenberg, Clement, 1999, <em>Homemade Esthetics</em>, Oxford:\nOxford University Press.</li>\n<li>Hopkins, Robert, 2011, “How to Be a Pessimist about\nAesthetic Testimony”,, <em>Journal of Philosophy</em>, 108(3):\n138–157. doi:10.5840/jphil201110838</li>\n<li>Kivy, Peter, 1968, “Aesthetic Aspects and Aesthetic\nQualities”, <em>Journal of Philosophy</em>, 65(4): 85–93.\ndoi:10.2307/2024481</li>\n<li>Levinson, Jerrold, 1992 [1996], “Pleasure and the Value of\nWorks of Art”, <em>The British Journal of Aesthetics</em>,\n32(4): 295–306. Reprinted in his <em>The Pleasures of\nAesthetics: Philosophical Essays</em>, Ithaca, NY: Cornell University\nPress, 11–24. doi:10.1093/bjaesthetics/32.4.295</li>\n<li>McCloskey, Mary, 1987, <em>Kant’s Aesthetic</em>, New York:\nSUNY Press.</li>\n<li>Plato, <em>Hippias Major</em>. In <em>Plato’s Complete\nWorks</em>, edited by John Cooper, Indianapolis: Hackett, 1997.</li>\n<li>Saito, Yuriko, 2001, “Everyday Aesthetics”,\n<em>Philosophy and Literature</em>, 25)1): 87–95.\ndoi:10.1353/phl.2001.0018</li>\n<li>–––, 2007, <em>Everyday Aesthetics</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780199278350.001.0001</li>\n<li>Scruton, Roger, 1983, “Understanding Music”, in his\n<em>The Aesthetic Understanding: Essays in the Philosophy of Art and\nCulture</em>, London: Carcanet.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "aesthetic, concept of the",
            "Aristotle, General Topics: aesthetics",
            "Hume, David: aesthetics",
            "Kant, Immanuel: aesthetics and teleology",
            "pleasure",
            "relativism"
        ],
        "entry_link": [
            {
                "../aesthetic-concept/": "aesthetic, concept of the"
            },
            {
                "../aristotle-aesthetics/": "Aristotle, General Topics: aesthetics"
            },
            {
                "../hume-aesthetics/": "Hume, David: aesthetics"
            },
            {
                "../kant-aesthetics/": "Kant, Immanuel: aesthetics and teleology"
            },
            {
                "../pleasure/": "pleasure"
            },
            {
                "../relativism/": "relativism"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=aesthetic-judgment\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/aesthetic-judgment/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=aesthetic-judgment&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/aesthetic-judgment/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=aesthetic-judgment": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/aesthetic-judgment/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=aesthetic-judgment&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/aesthetic-judgment/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://www.aesthetics-online.org/\" target=\"other\">American Society for Aesthetics</a>"
        ],
        "listed_links": [
            {
                "https://www.aesthetics-online.org/": "American Society for Aesthetics"
            }
        ]
    }
}