{
    "url": "analogy-medieval",
    "title": "Medieval Theories of Analogy",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "E. Jennifer Ashworth\n\nDomenic D’Ettore\n<dettod@stthom.edu>",
        "author_links": [
            {
                "https://uwaterloo.ca/philosophy/about/people/emeriti": "E. Jennifer Ashworth"
            },
            {
                "mailto:dettod%40stthom%2eedu": "dettod@stthom.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"https://uwaterloo.ca/philosophy/about/people/emeriti\" target=\"other\">E. Jennifer Ashworth</a>\n<br/>\nDomenic D’Ettore\n&lt;<a href=\"mailto:dettod%40stthom%2eedu\"><em>dettod<abbr title=\" at \">@</abbr>stthom<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Nov 29, 1999",
        "substantive revision Wed Dec 1, 2021"
    ],
    "preamble": "\n\nMedieval theories of analogy were a response to problems in three\nareas: logic, theology, and metaphysics. Logicians were concerned with\nthe use of words having more than one sense, whether completely\ndifferent, or related in some way. Theologians were concerned with\nlanguage about God. How can we speak about a transcendent, totally\nsimple spiritual being without altering the sense of the words we use?\nMetaphysicians were concerned with talk about reality. How can we say\nthat both substances (e.g., Socrates) and accidents (e.g., the\nbeardedness of Socrates) exist when one is dependent on the other; how\ncan we say that both God and creatures exist, when one is created by\nthe other? Medieval thinkers reacted to these three problems by\ndeveloping a theory which divided words into three sorts,\nindependently of context. Some were univocal (always used with the\nsame sense), some were purely equivocal (used with quite different\nsenses), and some were analogical (used with related senses).\nAnalogical terms were thought to be particularly useful in metaphysics\nand theology, but they were routinely discussed in commentaries on\nAristotle’s logic and in logic textbooks. The background to the\ndiscussion was given by what is often called the analogy of being or\nmetaphysical analogy, the doctrine that reality is divided both\nhorizontally into the very different realities of substances and\naccidents and vertically into the very different realities of God and\ncreatures, and that these realities are analogically related.\nNonetheless, the phrase “medieval theories of analogy” as\nused here will refer to semantic analogy, a set of linguistic and\nlogical doctrines supplemented, at least from the fourteenth century\non, by doctrines about the nature of human concepts.\n\nThere were three main types of semantic analogy, each based on a type\nof metaphysical analogy. In the original Greek sense, analogy involved\na comparison of two proportions or relations. Thus\n‘principle’ was said to be an analogical term when said of\na point and a spring of water because a point is related to a line as\na spring is related to a river. This type of analogy came to be called\nthe analogy of proportionality. In the second sense, analogy involved\na relation between two things, of which one is primary and the other\nsecondary. Thus ‘healthy’ was said to be an analogical\nterm when said of a dog and its food because while the dog has health\nin the primary sense, its food is healthy only secondarily as\ncontributing to or causing the health of the dog. This second type of\nanalogy became known as the analogy of attribution, and its special\nmark was being said in a prior and a posterior sense (per prius et\nposterius). A third type of analogy, sometimes used by\ntheologians, appealed to a relation of likeness between God and\ncreatures. Creatures are called good or just because their goodness or\njustice imitates or reflects the goodness or justice of God. This type\nof analogy was called the analogy of imitation or participation. Of\nthe three types, it is the analogy of attribution that is central to\nmedieval discussions.\n\nFrom the fourteenth century on discussions of analogy focused not so\nmuch on linguistic usages as on the nature of the concepts that\ncorresponded to the words used. Is there just one concept that\ncorresponds to an analogical term, or is there a sequence of concepts?\nIf the latter, how are the members of the sequence ordered and related\nto each other? Moreover, how far should we distinguish between\nso-called formal concepts (or acts of mind) and objective concepts\n(whatever it is that is the object of the act of understanding)? These\ndiscussions were still influential at the time of Descartes.\n",
    "toc": [
        {
            "#MediTheoLang": "1. Medieval Theories of Language"
        },
        {
            "#ProbLogiTheoMeta": "2. Problems in Logic, Theology, and Metaphysics"
        },
        {
            "#HistWordAnal": "3. History of the Word ‘Analogy’"
        },
        {
            "#DiviEqui": "4. Divisions of Equivocation"
        },
        {
            "#DiviAnal": "5. Divisions of Analogy"
        },
        {
            "#ThomAqui": "6. Thomas Aquinas"
        },
        {
            "#JohnDunsScotRoleConc": "7. John Duns Scotus and the Role of Concepts"
        },
        {
            "#CardCajeNewAppr": "8. Cardinal Cajetan: A New Approach"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Medieval Theories of Language\n\nMedieval logicians and philosophers of language were principally\nconcerned with the relationship between utterances, concepts, and\nthings. Written language was only of secondary importance. They agreed\nthat spoken language was conventional, having its origin in\nimposition, or the decision to correlate certain sounds with certain\nobjects. Concepts, however, were natural, in the sense that all human\nbeings with similar experiences had the same concepts, without any\ndecision being involved. The key semantic notion was signification,\nrather than meaning, though translated sources tend to obscure this by\ntranslating ‘significatio’ as ‘meaning’. For a\nterm to signify is for it to function as a sign, to represent or make\nknown something beyond itself. A typical spoken term, such as\n‘horse’ or ‘dog’, signifies in two ways. It\nsignifies or makes known the concept with which it has to be\ncorrelated in order to function significatively at all, and it also\nsignifies or makes known something external to and independent of the\nmind. Modifications were made to this simple scheme to cover the cases\nof special terms, including syncategorematic terms, such as\n‘every’ and ‘not’, fictional terms such as\n‘chimera’, and privative terms such as\n‘blindness’; and modifications were also made to cover the\ncase of special predicates, such as “is a genus”, or\n“is thought about”, but we need not concern ourselves with\nthese modifications here.\n\nTheories of signification were complicated by the metaphysical problem\nof common natures. If we say that words signify not only concepts but\nthings external to and independent of the mind do we mean that\n‘human being’ and ‘tall’ signify special\ncommon objects such as humanity or tallness, or do we mean that they\nsignify Socrates and his quality of being tall? For Aquinas, who did\nnot want to give common natures any kind of intermediary existence\nindependent of both concepts and actual things, the significate\n(significatum) of a term was the intellect’s conception\n(whether simple or definitional) of the thing signified; the thing\nsignified (res significata) was usually the property or the\nnature characterizing individual external objects; and the referent\n(suppositum) was the individual external object itself,\nviewed as the bearer of the property or nature. However,‘human\nbeing’ cannot be said to  signify  Socrates, since the\nmind cannot conceive physical individuals as such. In the fourteenth\ncentury, further developments took place. There was a new focus on the\nnotion of a mental language superior to spoken language, and concepts,\nas parts of this mental language, were themselves regarded as having\nsignification. Moreover, Scotists and nominalists agreed that, at\nleast in principle, physical individuals could be conceived as such.\nWilliam of Ockham and his followers not only denied the existence of\ncommon natures but insisted that spoken words did not signify\nconcepts. As a result, both spoken words and the concepts to which\nspoken words are subordinated have the same significates, namely\nindividual things and their individual properties, such as the\ntallness of Socrates. Other nominalists, notably Buridan, insisted\nthat spoken words did signify concepts as well as individuals, for\nconcepts are required to mediate between spoken words and individual\nthings.\n\nIn addition to having signification, terms were also said to have\nmodes of signifying (modi significandi). These modes of\nsignifying were related to the term’s logical and grammatical\nfunctions, and include such essential features as being a noun, verb,\nor adjective, and such accidental features as time (which includes\ntense without being limited to it), gender, and case. More generally,\nthey included being abstract (e.g., justice) and concrete (e.g.,\njust). They also include modes of predication, related to\nAristotle’s ten categories, such as substantial (e.g., horse),\nqualitative (e.g., brown), quantitative (e.g., square), relative and\nso on. The notion of modes of signifying was developed from the early\ntwelfth century on, though it was specially emphasized by the\nspeculative grammarians of the late thirteenth century.\n\nIt is important to recognize that medieval thinkers had a\ncompositionalist view of language signification, and so words were\nthought to be endowed as units both with their signification and with\nnearly all their modes of signifying in advance of the role they would\nsubsequently play in propositions. Moreover, the doctrine of common\nnatures suggested that terms, at least those terms which seem to fall\nwithin Aristotle’s ten categories (substance, quality, quantity\nand so on), each correspond to a common nature and so have a\nsignification which is fixed and precise. This meant that questions of\nuse and context, though explored by medieval logicians especially\nthrough supposition theory, were not thought to be crucial to the\ndetermination of a term as equivocal, analogical or univocal. It also\nmeant that terms which did not fit into Aristotle’s categorial\nframework needed a special account. This problem relates especially to\ntheology, because God was thought to transcend the categories in the\nsense that none of them apply to him, and also to metaphysics, because\nof the so-called transcendental terms, ‘being’,\n‘one’, ‘good’. These transcend the categories\nin the sense that they belong no more to one category than to another,\nand they do not correspond to common natures.\n2. Problems in Logic, Theology, and Metaphysics\n\nIn order to understand how the theory of analogy arose we have to bear\nin mind the history of education in the Latin-speaking western part of\nEurope. During the so-called dark ages, learning was largely confined\nto monasteries, and people had access to very few texts from the\nancient world. This situation had changed dramatically by the\nbeginning of the thirteenth century. The first universities (Bologna,\nParis, Oxford) had been established, and the recovery of the writings\nof Aristotle supplemented by the works of Islamic philosophers was\nwell under way.\n\nOne source for the theory of analogy is the doctrine of equivocal\nterms found in logic texts. Until the early twelfth century, the only\nparts of Aristotle’s logic to be available in Latin were the\nCategories and On Interpretation, supplemented by a\nfew other works including the monographs and commentaries of Boethius.\nThe Categories opens with a brief characterization of terms\nused equivocally, such as ‘animal’ used of real human\nbeings and pictured human beings, and terms used univocally, such as\n‘animal’ used of human beings and oxen. In the first case,\nthe spoken term is the same but there are two distinct significates or\nintellectual conceptions; in the second case, both the spoken term and\nthe significate are the same. We should note that equivocal terms\ninclude homonyms (two words with the same form but different senses,\ne.g., ‘pen’), polysemous words (one word with two or more\nsenses), and, for medieval thinkers, proper names shared by different\npeople. By the mid-twelfth century the rest of Aristotle’s logic\nhad been recovered, including the Sophistical Refutations in\nwhich Aristotle discusses three types of equivocation and how these\ncontribute to fallacies in logic. For writers throughout the later\nmiddle ages, the discussion of analogical terms was fitted into the\nframework of univocal and equivocal terms provided by Aristotle and\nhis commentators. We will return to this below.\n\nTwelfth-century theology is another important source for the doctrine\nof analogy, for twelfth-century theologians such as Gilbert of\nPoitiers and Alan of Lille explored the problem of divine language in\ndepth. Their work initially sprang from works on the Trinity by\nAugustine and Boethius. These authors insisted that God is absolutely\nsimple, so that no distinctions can be made between God’s\nessence and his existence, or between one perfection, such as\ngoodness, and another, such as wisdom, or, more generally, between God\nand his properties. New attention was also paid to Greek theologians,\nespecially Pseudo-Dionysius. These theologians insisted on God’s\nabsolute transcendence, and on what came to be called negative\ntheology. We cannot affirm anything positive about God, because no\naffirmation can be appropriate to a transcendent being. It is better\nto deny properties of God, saying for instance that he is not good\n(i.e., in the human sense), and still better to say that God is not\nexistent but super-existent, not substance but super-substantial, not\ngood but super-good. These theological doctrines raised the general\nproblem of how we can speak meaningfully of God at all, but they also\nraised a number of particular problems. Must we say that “God is\njustice” means the same as “God is just”? Must we\nsay that “God is just” means the same as “God is\ngood”? Can we say that God is just and that Peter is just as\nwell? For our purposes, this last question is the most important, for\nit raises the question of one word used of two different\nrealities.\n\nThe third source for doctrines of analogy is metaphysics. The first\npart of Aristotle’s Metaphysics had been translated by\nthe mid-twelfth century, though the full text was recovered only\ngradually. One crucial text is found in Metaphysics 4.2\n(1003a33–35): “There are many senses (multis\nmodis) in which being (ens) can be said, but they are\nrelated to one central point (ad unum), one definite kind of\nthing, and are not equivocal. Everything which is healthy is related\nto health…. and everything which is medical to\nmedicine….” In this text, Aristotle raises the general\nproblem of the word ‘being’ and its different senses, and\nhe also introduces what is known as pros hen equivocation or\nfocal meaning, the idea that different senses may be unified through a\nrelationship to one central sense. Another foundational text is from\nAvicenna’s Metaphysics, also translated into Latin\nduring the twelfth century, where he writes that being (ens)\nis neither a genus nor a predicate predicated equally of all its\nsubordinates, but rather a notion (intentio) in which they\nagree according to the prior and the posterior. As we shall see below,\nthis reference to the prior and the posterior is particularly\nimportant.\n\nSome further background for the development of doctrines of analogy is\nprovided by Aristotle’s discussion of scientific reasoning in\nhis Posterior Analytics, first commented on in the 1220s by\nRobert Grosseteste. One important issue was how analogical relations\nmight be used to find a way of referring to things which did not\nbelong to one genus and lacked a common name. A popular example\nthroughout the middle ages involved Aristotle’s account of the\nrelation between the ‘bone’ of a cuttlefish, a spine, and\na normal bone (Posterior Analytics, 14.2, 98a20–23),\nthough there was some disagreement about the type of analogy involved.\nEven more important was Aristotle’s view that scientific\nreasoning requires demonstrative syllogisms, which, in order to be\nlogically valid, must have a middle term that avoids the fallacy of\nequivocation. How far analogical terms could fill that role was a\nfrequent topic of discussion and controversy. In the thirteenth\ncentury, in his questions on Aristotle’s Physics,\nGeoffrey of Aspall remarked that analogy did not rule out univocity or\nprevent a subject from being one, while in the early fourteenth\ncentury, Scotus preferred to preserve unity by abandoning the use of\nanalogical terms. In the late fifteenth century Cajetan strongly\nsupported the claim that analogical terms could function as middle\nterms. None of these authors suggested that natural science and\ntheology could appeal to analogical relationships to produce\nprobabilistic rather than demonstrative arguments.\n3. History of the Word ‘Analogy’\n\nThe Latin term ‘analogia’ had various senses. In\nscriptural exegesis, according to Aquinas, analogy was the method of\nshowing that one part of scripture did not conflict with another. In\nrhetoric and grammar, analogy was the method of settling a doubt about\na word’s form by appeal to a similar and more certain case.\nSeveral twelfth-century theologians use the word in this sense. In\ntranslations of Pseudo-Dionysius, the term had a strictly ontological\nsense, for it refers to a being’s capacity for participation in\ndivine perfections as this relates to lower or higher beings. In\nlogic, authors were aware that the Greek word\n‘αναλογια’,\nsometimes called ‘analogia’ in Latin, but often\ntranslated as ‘proportio’ or\n‘proportionalitas’, referred to the comparison\nbetween two proportions. However, by the 1220s the word came to be\nlinked with the phrase “in a prior and a posterior sense”\nand by the 1250s terms said according to a comparison of proportions\nwere normally separated from terms said according to a prior and a\nposterior sense.\n\nThe phrase “in a prior and a posterior sense” seems to\nhave been derived from Arabic philosophy. H.A. Wolfson has presented\nevidence for Aristotle’s recognition of a type of term\nintermediate between equivocal and univocal terms, some instances of\nwhich were characterized by their use according to priority and\nposteriority. He showed that Alexander of Aphrodisias called this type\nof term ‘ambiguous’ and that the Arabic philosophers,\nstarting with Alfarabi, made being said in a prior and a posterior\nsense the main characteristic of all ambiguous terms. So far as the\nmedieval Latin west is concerned, the main sources for the notion of\nan ambiguous term said in a prior and a posterior sense are Algazel\nand Avicenna, both of whom became known in the second half of the\ntwelfth century, and both of whom used the notion to explain uses of\nthe word ‘being’.\n\nThe word ‘analogical’ soon became linked with the word\n‘ambiguous’ in Latin authors. Speaking of the cuttlefish\nexample in his commentary on Aristotle’s Posterior\nAnalytics, Grosseteste says that Aristotle’s use of analogy\nto find a common term produces ambiguous names said according to a\nprior and a posterior sense, and he uses the phrase\n“ambiguum analogum”. In the same decade, the\nGlossa of the theologian Alexander of Hales links being said\nin a prior and a posterior sense with ambiguity and (in one possibly\nunreliable manuscript) with analogy, and the writings of Philip the\nChancellor also link being said in a prior and a posterior sense with\nanalogy. In logic textbooks, the word ‘analogy’ in the new\nsense appears in the Summe metenses, once dated around 1220,\nbut now thought to be by Nicholas of Paris, writing between 1240 and\n1260. The new use of ‘analogy’ rapidly became standard in\nboth logicians and theologians.\n4. Divisions of Equivocation\n\nIn order to understand the way in which theories of analogy developed,\nwe need to consider the divisions of equivocation found in medieval\nauthors. In his commentary on the Categories, Boethius\npresented a series of divisions which he took from Greek authors. The\nfirst division was into chance equivocals and deliberate equivocals.\nIn the first case, the occurrences of the equivocal term were totally\nunconnected, as when a barking animal, a marine animal, and a\nconstellation were all called ‘canis’ (dog).\nChance equivocation was also called pure equivocation, and it was\ncarefully distinguished from analogy by later writers. In the second\ncase, that of deliberate equivocation, some intention on the part of\nthe speakers was involved, and the occurrences of the equivocal term\ncould be related in various ways. Boethius himself gave four\nsubdivisions. These are found in various later sources, including\nOckham’s commentary on the Categories, but as we shall\nsee, other subdivisions became more popular.\n\nThe first of Boethius’s four subdivisions was similitude, used\nof the case of the noun ‘animal’ said of both real human\nbeings and pictured human beings. Medieval logicians seem to have been\ntotally unaware of the fact that the Greek word used by Aristotle was\ngenuinely polysemous, meaning both animal and image, and they\nexplained the extended use of ‘animal’ in terms of a\nlikeness between the two referents — a likeness which had\nnothing to do with the significate of the term ‘animal’,\nwhich picks out a certain kind of nature, but which was nonetheless\nmore than metaphorical in that the external shape of the pictured\nobject does correspond to that of the living object. Those medieval\nauthors whose discussion of equivocation was very brief tended to use\nthis example, and they often claimed that Aristotle introduced it in\norder to accommodate analogy as a kind of equivocation. On the other\nhand, authors whose discussion was more extensive tended to drop both\nthe example and the subdivision of similitude.\n\nBoethius’s second type of equivocation is\n‘analogia’ in the Greek sense, and the standard\nexample was the word ‘principium’ (principle or\norigin), which was said to apply to unity with respect to number and\nto point with respect to a line, or to both the source of a river and\nthe heart of an animal. ‘Principium’ is a noun\nand, as such, might be expected to pick out a common nature, but\nalthough a unity, a point, a source and a heart can all be called\n‘principium’ with equal propriety, there is no\ncommon nature involved. Mathematical objects, rivers, and hearts,\nrepresent not merely different natural kinds, but different\ncategories, in that mathematical objects fall under the category of\nquantity, and hearts at least under the category of substance. What\nallows these disparate things to be grouped together is a similarity\nof relations: a source is to a river as a heart is to an animal\n— or so it was claimed. While theologians, including Aquinas\nhimself in De veritate, and the fourteenth-century Dominican\nThomas Sutton, occasionally make use of this type of analogy, most\nlogicians do not even mention it.\n\nThe last two subdivisions found in Boethius are ‘of one\norigin’ (ab uno), with the example of the word\n‘medical’, and ‘in relation to one’ (ad\nunum), with the example of the word ‘healthy’. These\nsubdivisions correspond to Aristotle’s pros hen\nequivocation. The example ‘healthy’ (sanum) as\nsaid of animals, their diet, and their urine is particularly important\nhere. ‘Sanum’, like other adjectives, was classified as a\nconcrete accidental term. As such, it did not fall within an\nAristotelian category, since its primary signification had two\nelements whose combination was variously explained. On the one hand,\nsome kind of reference is made to the abstract entity health, which\nbelongs to the category of quality; on the other hand, some kind of\nreference is made to an external object which belongs to the category\nof substance. This dual reference precludes the term from picking out\na natural kind, though in the case of other adjectives, such as\n‘brown’, no problem is caused thereby. Brown things may\nnot form a natural kind, but at least they are all physical objects,\nand ‘brown’ is used in the same sense of each one.\n‘Healthy’, however, is more complicated. To say that Rover\nis healthy is to say that Rover is a thing having health, and\nobviously this analysis can’t be applied to diet, which is\ncalled healthy only because it causes health in an animal, or to\nurine, which is called healthy only when it is the sign of health in\nan animal. Whatever the properties which characterize urine and food,\nthey are different from those characterizing the animal.\n\nWe should also note that in the same passage of his commentary on the\nCategories, Boethius linked deliberate equivocation with\nmetaphor, in which the sense of one word with an established\nsignification was extended to apply improperly to something else. A\nfavourite medieval example was ‘smiling’ said of flowering\nmeadows. Later logicians supported this link between equivocation and\nmetaphor by an appeal to Aristotle’s divisions of equivocation\nin his Sophistical Refutations, where he remarked that the\nsecond type was based on common usage. As we shall see, the question\nof metaphor’s relation to analogy became particularly important\nin post-thirteenth-century discussions.\n5. Divisions of Analogy\n\nBoethius’s subdivisions had one major failure: they did not seem\nto accommodate the different uses of the word ‘being’\n(ens). As a result, many authors used a new threefold\ndivision which included Boethius’s last two subdivisions and one\nmore. They presented the division as a division of deliberate\nequivocals, and they identified deliberate equivocals with analogical\nterms. This threefold division of analogy was established in the\nthirteenth century, in response to a remark by Averroes in his\ncommentary on the Metaphysics to the effect that Aristotle\nhad classified ‘healthy’ as a case of relationship to one\nthing as an end, ‘medical’ as a case of relationship to\none thing as an agent, and ‘being’ (ens) as a\ncase of relationship to one subject. It is found in Thomas\nAquinas’s own commentary on the Metaphysics, as well as\nin his fifteenth-century follower Capreolus. An analogical term is now\nseen as one which is said of two things in a prior and a posterior\nsense, and it is grounded in various kinds of attribution or\nrelationship to the primary object: food is healthy as a cause of a\nhealthy animal, a procedure is medical when applied by a medical\nagent, a quality has being by virtue of the existent substance that it\ncharacterizes.\n\nA second threefold division of analogy arose from reflection on the\nrelationship between equivocal and analogical terms. Analogical terms\nwere said to be intermediaries between equivocal and univocal terms,\nand the standard view was that analogical terms were intermediary\nbetween chance equivocals and univocals, and hence that they were to\nbe identified with deliberate equivocals. The notion of an\nintermediary term, however, is open to more than one interpretation,\nand some authors went further in suggesting that at least some\nanalogical terms were intermediary between univocals and deliberate\nequivocals, so that they were not equivocal in any of the normal\nsenses at all. Towards the end of the thirteenth century, an anonymous\ncommentator on the Sophistical Refutations gives the\nfollowing classification. First, there are analogical terms which are\nunivocal in a broad sense of ‘univocal’. Here reference\nwas made to genus terms such as ‘animal’. Human beings and\ndonkeys participate equally in the common nature animal, but are not\nthemselves equal, since human beings are more perfect than donkeys.\nThis type of analogy was routinely discussed in response to a remark\nAristotle had made in Physics VII (249a22–25) which, in\nLatin translation, asserted that many equivocations are hidden in a\ngenus. Medieval logicians felt obliged to fit this claim into the\nframework of equivocation and analogy, even if the consensus was that\nin the end the use of genus terms was univocal. Second, there are\nthose analogical terms such as ‘being’ (ens)\nwhich are not equivocal, because only one concept or nature\n(ratio) seems to be involved, and which are not univocal\neither, because things participate this one ratio unequally,\nin a prior and a posterior way. It is these terms which are the\ngenuine intermediaries. Third, there are those analogical terms which\nare deliberate equivocals, because there are two concepts or natures\n(rationes) which are participated in a prior and a posterior\nway. The example here was ‘healthy’. This second threefold\ndivision was much discussed. Duns Scotus bitterly criticized it in his\nearlier logical writings. Walter Burley claimed that both the first\nand the second kinds of analogical term could properly be regarded as\nunivocal in a wide sense. The division was popular in the fifteenth\ncentury with such Thomists as Capreolus, who realized its closeness to\nthe account given by Aquinas in his Sentences commentary.\n6. Thomas Aquinas\n\nDespite the vast modern literature devoted to Aquinas’s theory\nof analogy, he has very little to say about analogy as such. He uses a\ngeneral division into equivocal, univocal, and analogical uses of\nterms, and he presents both of the threefold divisions of analogy\nmentioned in the previous section, but he offers no prolonged\ndiscussion, and he writes as if he is simply using the divisions,\ndefinitions, and examples with which everyone is familiar. His\nimportance lies in the way he used this standard material to present\nan account of the divine names, or how it is we can meaningfully use\nsuch words as ‘good’ and ‘wise’ of God.\n\nThe background to this account has to be understood in terms of\nAquinas’s theology and metaphysics. Three doctrines are\nparticularly important. First, there is the distinction between being\nexistent, good, wise, and so on, essentially, and being existent,\ngood, wise, and so on, by participation. God is whatever he is\nessentially, and as a result he is existence itself, goodness itself,\nwisdom itself. Creatures are existent, good, wise, only by sharing in\nGod’s existence, goodness, and wisdom, and this sharing has\nthree features. It involves a separation between the creature and what\nthe creature has; it involves a deficient similarity to God; and it is\nbased on a causal relation. What is essentially existent or good is\nthe cause of what has existence or goodness by participation. Second,\nthere is the general doctrine of causality according to which every\nagent produces something like itself. Agent causality and similarity\ncannot be separated. Third, there is Aquinas’s belief that we\nare indeed entitled to claim that God is existent, good, wise, and so\non, even though we cannot know his essence.\n\nAgainst this background, Aquinas asks how we are to interpret the\ndivine names. He argues that they cannot be purely equivocal, for we\ncould not then make intelligible claims about God. Nor can they be\npurely univocal, for God’s manner of existence and his\nrelationship to his properties are sufficiently different from ours\nthat the words must be used in somewhat different senses. Hence, the\nwords we use of God must be analogical, used in different but related\nsenses. To be more precise, it seems that such words as\n‘good’ and ‘wise’ must involve a relationship\nto one prior reality, and they must be predicated in a prior and a\nposterior sense, for these are the marks of analogical terms.\n\nNonetheless, the divine names do not function exactly like ordinary\nanalogical terms such as ‘healthy’. We need to begin by\nmaking use of the distinction between the thing signified (a nature or\nproperty) and the mode of signifying. All the words we use have a\ncreaturely mode of signifying in that they imply time and composition,\nneither of which can pertain to God. When speaking of God, we must\nrecognize this fact, and attempt to discount it. To say “God is\ngood” is not to imply that God has a separable property,\ngoodness, and that he has it in a temporally limited way. God is\neternally identical to goodness itself. But even when we have\ndiscounted the creaturely mode of signifying, we are left with the\nfact that God’s goodness is not like our goodness. \n\nOne major controversy over Aquinas’s writings concerns the variation\nin his writings over the roles analogy of attribution and analogy of\nproportionality (or analogy in the Greek sense). In his early\nwritings, Aquinas questioned whether the standard account of the\nanalogy of attribution was sufficient for his purposes. In his\ncommentary on the Sentences, he suggests that there is one\nkind of analogy in which the analogical term is used in a prior and a\nposterior sense, and another kind of analogy, the analogy of\nimitation, which applies to God and creatures. In his De\nveritate, he argues that the analogy of attribution involves a\ndeterminate relation, which cannot hold between God and creatures, and\nthat the analogy of proportionality must be used for the divine names.\nWe must compare the relation between God and his properties to the\nrelation between creatures and their properties. It has been argued\nthat Aquinas discovered that this solution was deeply flawed, given\nthat the problem of divine names arises precisely because the\nrelationship of God to his properties is so radically different from\nour relation to our properties. Accordingly, in his later discussions\nof the divine names, notably in the Summa contra gentiles and\nthe Summa theologiae, Aquinas returns to the analogy of\nattribution, but links it much more closely with his doctrines of\ncausal similitude. Montagnes has pointed\nout that Aquinas came to place much greater\nemphasis on agent causation, the active transmission of properties\nfrom God to creatures, than on exemplar causality, the\ncreature’s passive reflection or imitation of God’s\nproperties. In this context, Aquinas makes considerable use of his\nontological distinction between univocal causes, whose effects are\nfully like them, and non-univocal causes, whose effects are not fully\nlike them. God is an analogical cause, and this is the reality that\nunderlies our use of analogical language. Other scholars, notably\nHochschild, have argued that Aquinas never abandons the doctrine of\nthe De Veritate. Citing passages in the Summa\nTheologiae that explicitly employ analogy of proportionality,\nHochschild argues that Aquinas appeals to one or another\nclassification of analogy based on the dialectical context of his\nremarks. Where the context calls for addressing the causal\nrelationship between God and creatures, Aquinas appeals to\nclassifications of analogy of attribution. Where the context calls for\naddressing the formal structure of the similarity between God and\ncreatures, Aquinas appeals to analogy of proportionality. Hochschild\nargues furthermore that there is an asymmetrical relationship between\nanalogy of proportionality and the forms of analogy of attribution\nthat involve cause and effect relationships between analogates.\nAnalogy of proportionality can occur with or without causal\nrelationships between the analogates. (E.g. There is an analogy of\nproportionality between the intellect’s act of seeing and the eye’s\nact of seeing, but no causal relationship between them.) However,\ncause and effect relationships between analogates in an analogy of\nattribution always presuppose an analogy of proportionality as the\nformal structure of the similarity between the analogate that is the\ncause and the analogate that is the effect. \n\nAnother controversy over Aquinas’s writings on analogy concerns\nhis explicit statements in some passages (notably in\nthe Summa Theologiae) that one analogate is included in\nthe definition of the other analogate or analogates. Specifically, the\nanalogate of which the term is said in a prior way must be\nincluded in the definition of the posterior analogate or analogates,\njust as the definition of healthy food includes a reference to the\nhealthiness of an animal. There are two grounds for the\ncontroversy. One is that Aquinas also explicitly denies (notably\nin the De Veritate) that the rule that one analogate\nappears in the definition of the others applies to cases of names said\nof God and creatures. Another ground is that it is simply difficult to\nsee how the rule could apply to names said of God and creatures given\nAquinas’s insistence (including in the Summa Theologiae) that\nthese names are not said of God only by relation to creatures nor are\nthey said of creatures only by relation to God. One proposed solution\nto the difficulty of fitting the definition of a name as said of God\ninto the definition of a name as said of a creature draws on Aquinas’s\ndoctrine of participation through agent causality.\nAlthough the reference to God in the definition\nof the creature is not direct or explicit, it\noccurs through our recognition that when\nhumans are said to be good, this means that they have a participated\ngoodness which must be caused by that which is goodness itself. The\nnature of this causal relation between God and creature\nexplains the sense in which terms are said in a prior way of God.\nSo as far as imposition is concerned, terms are\ngiven their signification on the basis of creaturely effects, and,\nbefore we learn about God, we may think that their prior use is to\nrefer to creaturely perfections. However, when we come to know God as\nthe first cause and fully perfect being, we recognize that their prior\napplication is to God. The sixteenth-century Thomist Francis Sylvester of\nFerrara proposes that the naming of the creature by reference to God\ninvolves a distinct act of imposition of signification upon a name\nfrom the original act of imposition. A merit of this approach is\nthat it helps us to explain Aquinas’s insistence on\nthe distinction between the analogy of many-to-one and the analogy of\none-to-another. In the first case, both food and medicine are said to\nbe healthy because each is related to something else, the health of an\nanimal. In the second case, food is said to be healthy because of its\nrelation to the health of an animal. Only the second kind of analogy\napplies to the divine names, for no non-metaphorical name that we\napply to God can ever be explained in terms of something other than\nGod. Our use of divine names has to reflect God’s absolute\npriority.\n7. John Duns Scotus and the Role of Concepts\n\nOne of the issues that Aquinas touched on but did not settle was that\nof the number of rationes an analogical term was associated\nwith. This issue stems from Aristotle’s\nCategories. As translated by Boethius, Aristotle introduced\nthe distinction between univocal and equivocal terms by claiming that\nwhereas univocal terms were subordinated to one substantiae\nratio, equivocal terms were subordinated to more than one\nsubstantiae ratio. The word ‘ratio’ here\nis capable of various interpretations, including ‘definition or\ndescription’, ‘analysis’, or ‘concept’,\nbut by the early fourteenth century logicians and theologians came to\nagree that the appropriate interpretation was ‘concept’.\nThe second threefold division of analogy given above suggests the\nimportance of a focus on concepts; and the question of how many\nconcepts an analogical term was subordinated to came to be central.\nThe nominalists held that so-called analogical terms were either\nmetaphorical or were straightforwardly equivocal terms subordinated to\ntwo distinct concepts, but the Thomists were split. Analogical terms\ncould be viewed as subordinated to an ordered cluster of concepts\n(possibly but not necessarily described as a disjunction of concepts);\nor they could be subordinated to a single concept which represents in\na prior and a posterior manner (per prius et posterius).\n\nThe issue was considerably complicated by the influence of John Duns\nScotus. In his early logical commentaries, Scotus had argued that it\nwas impossible to have two concepts that were related in a prior and\nposterior way, just as it was impossible to have a single concept that\ncaptured such a relationship. As a result, ‘being’ was a\nchance equivocal, and metaphor, which was a matter of linguistic\nusage, replaced semantic analogy. However, Scotus did believe in\nmetaphysical analogy, whereby God and creatures, substances and\naccidents were related in a prior and posterior way, and in his later\ntheological works he argued that without a unified concept of being\nneither metaphysics nor theology would be possible. Accordingly, he\nreplaced the claim that ‘being’ was a chance equivocal\nwith the claim that it was univocal. In order to support this claim,\nhe rejected the common doctrine that for a term to be univocal it had\nto be a strictly categorial term, picking out some natural kind or\nother. He argued that it was sufficient for univocity that\ncontradiction would arise when the term was affirmed and denied of the\nsame thing. He then argued that ‘being’ (ens) was\na univocal term subordinated to a single univocal concept.\n\nWhat one should make of the relationship between the single\nunivocal concept of being and the being common to finite and infinite\nbeing (as substance and accidents) has proved to be a dividing point\nfor the Scotist tradition. Dumont has described how even the earliest\nfollowers of Duns Scotus struggled to bring together the seemingly\ncompeting claims of Scotus himself that, on the one hand, (a) there is\none univocal concept of being that is common to God and creatures,\nand, on the other hand, (b) God and creatures are entirely\ndiverse realities with no real commonality. Different Scotists have\nemphasized one point or the other, with some Scotists taking the\nposition that there is a real community in being between God and\ncreatures in order to preserve the unity of the univocal concept of\nbeing, and other Scotists taking the position that the univocal\nconcept of being is purely logical in order to preserve the real\ndiversity between God and creatures. In developing these positions,\nScotists distinguish between different orders or kinds of univocity\nand analogy, including between logical and metaphysical univocity and\nlogical and metaphysical analogy. In the seventeenth century, the great\nScotist philosopher Bartolmaeus Mastrius proposed that, in reality,\nbeing is analogous to God and creatures, but analogy is not a medium\nbetween equivocation and univocation. Instead, every analogy reduces\nlogically to equivocation or to univocation. In the case of being as\ncommon to God and creatures, the analogy reduces to univocation. In\nrecent scholarship, Cross has defended a similar interpretation of\nScotus’s doctrine, affirming that the semantics of analogy reduce to\nor depend upon a more fundamental core of univocity.  \n\nEven for those within the Thomistic tradition, Scotus’ arguments\nabout the univocity of ‘being’ had to be taken seriously.\nOn the one hand, the word does not seem to be straightforwardly\nequivocal, in the sense of being subordinated to more than one\nconcept, for we at least have the illusion of being able to grasp\n‘being’ as a general term. As Scotus pointed out, in an\nargument reproduced by all who considered the issue (dubbed “the\nfamous argument from a certain and a doubtful concept” by the early\nScotist Peter Thomae), we can grasp that something is a being while\ndoubting whether it is a substance or an accident, and this surely\ninvolves having a relatively simple concept of being at our disposal.\nOn the other hand, there does not seem to be any common nature\ninvolved, and in the absence of a common nature, Thomists thought that\nto call the term ‘univocal’ was inappropriate. What was\nneeded was a way of allowing the concept to enjoy some kind of unity,\nwhile allowing the word to have a significate that was not a simple\ncommon nature. For many thinkers from the early fourteenth century\nonward, the distinction between formal and objective concepts provided\nthe answer.\n\nThe formal concept was the act of mind or conception that represented\nan object, and the objective concept was the object represented. A\nformal concept is a sign or signifier, and an objective concept is\nwhat is signified. If the spoken word ‘being’\ncorresponds to just one formal concept (a point on which there were\nsome differences of opinion), the focus of discussion shifts to the\nstatus of the objective concept. Is it the actual thing in the world\nwhich is thought about; is it a common nature or some other kind of\nintermediary entity which is distinct from the external object without\nbeing mind-dependent; or is it a special kind of mind-dependent object\nwhich has only objective being, the being of being thought (esse\nobjective, esse cognitum)? In the case of ‘being’,\nsince we are clearly not talking about either an individual thing or a\ncommon nature, we get back to the original set of questions about\nanalogical concepts, now posed at a different level. That is, are we\ntalking about a special ordering intrinsic to a single objective\nconcept, or are we talking about an ordered sequence of objective\nconcepts which corresponds to the one formal concept?\n8. Cardinal Cajetan: A New Approach\n\nThomists’ discussions of analogy from the beginning of the fourteenth\ncentury onward are dominated by controversy with the arguments of\nScotus and the Scotists. Beginning with the fifteenth-century Thomist John\nCapreolus and culminating with the fifteenth-sixteenth century Thomist Thomas de\nvio Cajetan, a set of influential Thomists turned to the threefold\ndivision of analogy in Thomas Aquinas’s commentary on\nthe Sentences as providing the key for resolving a\nset of questions inspired by Scotus about (a) the number\nof rationes, intentiones, or concepts\ninvolved in analogy, (b) the distinction between logical and\nmetaphysical univocity and analogy, and (c) how analogy is compatible\nwith valid syllogistic demonstration. The approach of these Thomists\nmarks a departure from earlier Thomists, such as Hervaeus Natalis, and\narguably a departure from the later works of Thomas Aquinas himself\n(such as the Summa Contra Gentiles, De Potentia, and\nSumma Theologiae). Montagnes and Wippel have argued strongly\nthat these fifteenth-sixteenth century Thomists depart from the mature position\nof Aquinas. Hochschild has argued to the contrary. McInerny argued\nthat Cajetan not only misses the mark on the mature thought of\nAquinas, but even misinterprets Aquinas’s early commentary on the\nSentences. Dewan has contended that McInerny’s criticism\nof Cajetan relies both on overlooking direct statements by\nAquinas in the commentary on the Sentences passage\nin question and on omissions of words and phrases from the passage\nthat support Cajetan’s interpretation.\n\nThe commentary on the Sentences passage in question\ndivides analogy into: (1) the analogous according\nto intentio (“intentio” is a synonym\nfor ratio or concept), but not according\nto esse (act of being); (2) the analogous according\nto esse, but not according to intentio;\nand (3) the analogous both according\nto intentio and according to esse.\nAquinas offers healthy as belonging to an animal, to urine, and to\nmedicine as an example of the first kind of analogy; body as belonging\nto corruptible and incorruptible bodies as an example of the second\nkind of analogy — which Aquinas says is not a case of analogy from the\nperspective of logic but is analogy from the perspective of\nmetaphysics and physics; and, finally, being, truth, and goodness as\nexamples of the third kind of analogy. Capreolus and Cajetan affirm\nthat the first kind of analogy (analogy of attribution) requires more\nthan one ratio or concept — e.g., one for the\nhealthiness of an animal; another for the healthiness of urine;\nanother for the healthiness of medicine; etc. They maintain that this\ndiversity of rationes prevents a name that is being said\nby analogy in this way from appearing in a valid syllogistic\ndemonstration. By contrast, names said by analogy in the second way\nhave only one ratio and present no obstacle to\ndemonstrative reasoning. Indeed, names said by analogy in the second\nway are not even considered analogous but univocal from the\nperspective of logic, which considers\nthe ratio apart from\nits esse rather\nthan the ratio together with\nits esse. Names said by analogy in the third way have\none ratio in a qualified sense of unity. As Cajetan\nexplains it, strictly speaking the different analogates have\ndiverse rationes, but, inasmuch as the diverse\nanalogates in the third mode of analogy are proportionally similar to\none another, it follows that the ratio of one\nis proportionally one and the same as\nthe ratio of the other. Cajetan draws the further\ninference that valid demonstration can proceed on the basis of this\nkind of analogy provided that what is demonstrated from one analogate\nabout another is demonstrated about the other only insofar as the\nanalogates are proportionally similar. Accordingly, Cajetan claims\nthat names said by analogy in the third way (which Cajetan calls\nanalogy of proper proportionality) meet John Duns Scotus’s conditions\nfor univocity: they have sufficient unity to ground a contradiction\nand to serve as a middle term in a syllogism without the fallacy of\nequivocation. \n\nThe marriage that Capreolus makes implicitly and that Cajetan makes\nexplicitly between the third mode of analogy in\nAquinas’s commentary on the Sentences and analogy\nof proportionality in Aquinas’s De Veritate plays a\nkey role in their approach to defending analogy against Scotist\nobjections, and it is one of several points on which modern\nscholarship has taken Cajetan in particular to task as an interpreter\nof the thought of Thomas Aquinas. Cajetan is frequently criticised in\nmodern scholarship for his claim that analogy of proportionality\nis the only mode of analogy that is analogy in the strict sense\n(proprie) and the other modes of analogy are only analogy in\na looser sense (abusive). This claim is not original to\nCajetan, and can be found in the writings of the late thirteenth to early\nfourteenth century Thomist, Thomas Sutton. Cajetan’s contemporary\nThomist critics, such as Francis Sylvester of Ferrara and Sylvester\nMazzolini Prierias dispute Cajetan’s interpretation of analogy of\nproper proportionality and its relationship to other modes of analogy.\nFrancis Sylvester goes so far as to propose that analogy of\nproportionality is a subdivision of a subdivision of analogy of\nattribution. Tavuzzi has called attention to several other ways that\nCajetan’s contemporary Thomists divided up the modes of analogy in\nopposition to Cajetan’s threefold division.  \n\nWhatever the merits of the writings of Capreolus and Cajetan on\nanalogy are for their insight into the position of Thomas Aquinas,\ntheir writings and the writings of their Thomist and Scotist critics\noffer great insight into the ongoing philosophical reflection of the\nmedieval Aristotelian tradition in the logic, metaphysics, and\nepistemology of analogy. \n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Andersen, Claus A., 2016, <em>Metaphysik im Barockscotismus:\nUnterschungen zum Metaphysikwerk Des Bartholmaeus Mastrius: Mit\nDokumentation der Metaphysik in der scotistischen Tradition ca.\n1620–1750</em>, Amsterdam/ Philadelphia: John Benjamin’s Publishing\nCompany.",
                "Ashworth, E. J., 1991, “Signification and Modes of\nSignifying in Thirteenth-Century Logic: A Preface to Aquinas on\nAnalogy,” <em>Medieval Philosophy and Theology</em> 1:\n39–67.",
                "–––, 1992, “Analogy and Equivocation in\nThirteenth-Century Logic: Aquinas in Context,” <em>Mediaeval\nStudies</em> 54: 94–135.",
                "–––, 1992, “Analogical Concepts: The\nFourteenth-Century Background to Cajetan,” <em>Dialogue</em> 31:\n399–413.",
                "–––, 1995, “Suárez on the Analogy\nof Being: Some Historical Background,” <em>Vivarium</em> 33:\n50–75.",
                "–––, 1996, “Analogy, Univocation, and\nEquivocation in some Early Fourteenth-Century Authors,” in\n<em>Aristotle in Britain during the Middle Ages</em>, John Marenbon\n(ed.), Belgium: Brepols, pp. 233–47.",
                "–––, 1997, “Analogy and Equivocation in\nThomas Sutton, O.P.” in <em>Vestigia, Imagines, Verba: Semiotics\nand Logic in Medieval Theological Texts (XIIth-XIVth Century)</em>,\nCostantino Marmo (ed.), Turnhout: Brepols, pp. 289–303.",
                "–––, 2008, <em>Les théories de\nl’analogie du XIIe au XVIe siècle</em>, Paris: Vrin.",
                "–––, 2013, “Analogy and Metaphor from\nThomas Aquinas to Duns Scotus and Walter Burley,” in <em>Later\nMediaeval Metaphysics: Ontology, Language, and Logic</em>, Charles\nBolyard and Rondo Keele (eds.), New York: Fordham University Press,\npp. 223–48, 291–99.",
                "–––, 2013, “Being and Analogy,” in\n<em>A Companion to Walter Burley</em>, Alessandro D. Conti (ed.),\nLeiden, Boston: Brill, pp. 135–65.",
                "–––, 2014, “Aquinas on Analogy,” in\n<em>Debates in Medieval Philosophy</em>, Jeffrey Hause (ed.), New\nYork: Routledge, pp. 232–242.",
                "–––, 2017, “Philosophy of Language: Words,\nConcepts, Things, and Non-Things,” in <em>The Routledge\nCompanion to Sixteenth-Century Philosophy</em>, Henrik Lagerlund and\nBenjamin Hill (eds.), New York: Routledge, pp. 350–372.",
                "Boulnois, Olivier, 1996, “Duns Scot, théoricien de\nl’analogie de l’être,” in <em>John Duns\nScotus: Metaphysics and Ethics</em>, edited by Ludger Honnefelder,\nRega Wood, and Mechthild Dreyer, Studien und Texte zur\nGeistesgeschichte des Mittelalters 53, Leiden, New York, Cologne: E.\nJ. Brill, pp. 293–315.",
                "Brown, Stephen, 1971, “Robert Cowton, OFM and the\nAnalogy of the Concept of Being,” <em>Franciscan\nStudies</em> 31: 5–40.",
                "Cross, Richard, 2012, “Duns Scotus and Analogy: A Brief\nNote,” <em>Modern Schoolman</em> 89: 147–54.",
                "D’Ettore, Domenic, 2014, “The Fifteenth-Century\nThomist Dispute over Participation in an Analogous Concept: John\nCapreolus, Dominic of Flanders, and Paul Soncinas,”\n<em>Mediaeval Studies</em> 76: 241–273.",
                "–––, 2016, “Some Renaissance Thomists on\nAnalogy in Demonstration,” <em>Angelicum</em> 93:\n927–950.",
                "–––, 2018, “One Is in the Definition of All: The\nRenaissance Thomist Controversy over a ‘Rule’ for Names Said by\nAnalogy,” <em>The Thomist</em> 82: 89–111.",
                "–––, 2019, <em>Analogy After Aquinas: Logical Problems,\nThomistic Answers</em>, Washington, D.C.: The Catholic University of\nAmerica Press.",
                "–––, 2020, “Analogy of Disjunction: John Duns Scotus\nvs. Hervaeus Natalis on the Univocity or Analogy of\nBeing,” <em>Studia Neoaristotelica</em> 17: 7–33.",
                "–––, 2021, “Does Analogy Work in Demonstration? A\nScotist’s Critique of Thomism,” <em>International\nPhilosophical Quarterly </em>61: 47–60.",
                "Dewan, Lawrence, 2007, “St. Thomas and Analogy: the\nLogician and the Metaphysician,” in <em>Laudemus viros\ngloriosos: Essays in Honor of Armand Maurer</em>, R. E. Houser (ed.),\nNotre Dame, IN: University of Notre Dame Press: 132–145.",
                "Di Liso, Saverio, 2005, “Alcune Trattazioni\nTardo-Medievali Sull’univocità e l’analogia\nDell’ente,” <em>Rivista Di Storia Della\nFilosofia</em> 60: 193–223.",
                "Dumont, Stephen D., 1992, “Transcendental Being: Scotus\nand Scotists,” <em>Topoi </em>11: 135–148.",
                "Henninger, Mark, 2006, “Thomas Sutton on Univocation,\nEquivocation and Analogy,” <em>The Thomist</em> 70:\n537–535.",
                "–––, 2006, “Henry of Harclay on the\nUnivocal Concept of Being,” <em>Mediaeval Studies</em>, 68:\n205–237.",
                "Hochschild, Joshua P., 2010, <em>The Semantics of Analogy:\nRereading Cajetan’s</em> De Nominum Analogia, Notre Dame,\nIndiana: University of Notre Dame Press.",
                "–––, 2013, “Proportionality and Divine Naming: Did St.\nThomas Change His Mind about Analogy?,” <em>The\nThomist </em>77: 531–58.",
                "–––, 2019, “Aquinas’s two concepts of analogy and a\ncomplex semantics for naming a simple God,” <em>The\nThomist</em> 83: 155–84.",
                "Klima, Gyula, 2002, “Aquinas’ Theory of the Copula and\nthe Analogy of Being,” <em>Logical Analysis and History of\nPhilosophy</em> 5: 159–76.",
                "Libera, Alain de, 1989, “Les sources gréco-arabes de\nla théorie médiévale de l’analogie de\nl’être,” <em>Les études philosophiques</em>,\n3/4: 319–45.",
                "Lonfat, Joël, 2004, “Archéologie de la\nnotion d’analogie d’Aristote à Saint Thomas\nd’Aquin,” <em>Archives</em> <em>d’histoire</em> <em>doctrinale\net littéraire du Moyen Âge</em> 71: 35–107.",
                "McInerny, Ralph, 1986, “The Analogy of Names is a Logical\nDoctrine,” in <em>Being and Predication: Thomistic\nInterpretations</em>, Washington, D.C.: The Catholic University of\nAmerica Press, pp. 279–86.",
                "–––, 1992, “Aquinas and Analogy: Where Cajetan Went\nWrong,” <em>Philosophical Topics</em>, 20(2): 103–124,\n[<em>Medieval Philosophy</em>, Sandra Edwards (ed.)]",
                "–––, 1996, <em>Aquinas and Analogy</em>, Washington, D.C.:\nThe Catholic University of America Press. ",
                "Montagnes, Bernard, 1963, <em>La doctrine de l’analogie de\nl’être d’après Saint Thomas\nd’Aquin</em>, Philosophes médiévaux 6, Louvain:\nPublications Universitaires; Paris: Béatrice-Nauwelaerts.",
                "–––, 2004, <em>The Doctrine of the Analogy of\nBeing According to Thomas Aquinas</em>, trans. E. M. Macierowski, P.\nVandevelde, and Andrew Tallon, Marquette Studies in Philosophy 25,\nMilwaukee: Marquette University Press.",
                "Mora-Márquez, Ana María, 2017,\n“Aristotle’s Fallacy of Equivocation and its 13th Century\nReception,” in <em>Formal Approaches and Natural Language\nin Medieval Logic</em>, Laurent Cesalli, Alain de\nLibera, Frédéric Goubier (eds.), Barcelona/\nRome: Fédération Internationale des\nInstituts d’Études Mediévales: 217–38.",
                "Novák, Lukáš,\n2021, “Suárez’s Notion of\nAnalogy,” <em>American Catholic Philosophical\nQuarterly</em> 95: 195–233.",
                "Park, Seung-Chan, 1999, <em>Die Rezeption der mittelalterlichen\nSprachphilosophie in der Theologie des Thomas von Aquin. Mit besondere\nBerücksichtigung der Analogie.</em> Studien und Texte zur\nGeistesgeschichte des Mittalters 65, Leiden, Boston, Köln:\nBrill.",
                "Pini, Giorgio, 2002, <em>Scoto e L’analogia: Logica e\nmetafisica nei commenti aristotelici</em>, Pisa: Scuola Normale\nSuperiore. ",
                "–––, 2021, “Before univocity: Duns Scotus’s rejection\nof analogy,” in <em>Interpreting Duns Scotus: critical\nessays</em>, Giorgio Pini (ed.), Cambridge: Cambridge\nUniversity Press (<em>forthcoming</em>).",
                "Reynolds, Philip L., 2003, “Analogy of Names in\nBonaventure,” <em>Mediaeval Studies</em>, 65: 117–62.",
                "Rosier, Irène, 1995, “<em>Res significata</em> et\n<em>modus significandi</em>: Les implications d’une distinction\nmédiévale,” in <em>Sprachtheorien in\nSpätantike und Mittelalter</em>, Sten Ebbesen (ed.),\nTübingen: Gunter Narr Verlag, pp. 135–68.",
                "Smith, Garrett R., 2019, “The analogy of being in the\nScotist tradition,” <em>American Catholic Philosophical\nQuarterly</em> 93: 633–73.",
                "–––, 2021, “Analogy after Duns Scotus: the role of the\n<em>analogia entis </em>in the Scotist metaphysics at Barcelona,\n1320–1330,” in <em>Interpreting Duns Scotus: critical\nessays</em>, Giorgio Pini (ed.), Cambridge: Cambridge\nUniversity Press (<em>forthcoming</em>).<em> </em>",
                "Valente, Luisa, 2008, <em>Logique et théologie. Les\nécoles parisiennes entre 1150 et 1220</em>, Paris: Vrin.",
                "Wolfson, H. A., 1938, “The Amphibolous Terms in Aristotle,\nArabic Philosophy and Maimonides,” <em>Harvard Theological\nReview</em>, 31: 151–73; reprinted in idem, <em>Studies in the\nHistory of Philosophy and Religion</em>, I. Twersky and G. H. Williams\n(eds.), Cambridge, MA and London: Harvard University Press, 1973.\nVolume 1, pp. 455–77."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Andersen, Claus A., 2016, <em>Metaphysik im Barockscotismus:\nUnterschungen zum Metaphysikwerk Des Bartholmaeus Mastrius: Mit\nDokumentation der Metaphysik in der scotistischen Tradition ca.\n1620–1750</em>, Amsterdam/ Philadelphia: John Benjamin’s Publishing\nCompany.</li>\n<li>Ashworth, E. J., 1991, “Signification and Modes of\nSignifying in Thirteenth-Century Logic: A Preface to Aquinas on\nAnalogy,” <em>Medieval Philosophy and Theology</em> 1:\n39–67.</li>\n<li>–––, 1992, “Analogy and Equivocation in\nThirteenth-Century Logic: Aquinas in Context,” <em>Mediaeval\nStudies</em> 54: 94–135.</li>\n<li>–––, 1992, “Analogical Concepts: The\nFourteenth-Century Background to Cajetan,” <em>Dialogue</em> 31:\n399–413.</li>\n<li>–––, 1995, “Suárez on the Analogy\nof Being: Some Historical Background,” <em>Vivarium</em> 33:\n50–75.</li>\n<li>–––, 1996, “Analogy, Univocation, and\nEquivocation in some Early Fourteenth-Century Authors,” in\n<em>Aristotle in Britain during the Middle Ages</em>, John Marenbon\n(ed.), Belgium: Brepols, pp. 233–47.</li>\n<li>–––, 1997, “Analogy and Equivocation in\nThomas Sutton, O.P.” in <em>Vestigia, Imagines, Verba: Semiotics\nand Logic in Medieval Theological Texts (XIIth-XIVth Century)</em>,\nCostantino Marmo (ed.), Turnhout: Brepols, pp. 289–303.</li>\n<li>–––, 2008, <em>Les théories de\nl’analogie du XIIe au XVIe siècle</em>, Paris: Vrin.</li>\n<li>–––, 2013, “Analogy and Metaphor from\nThomas Aquinas to Duns Scotus and Walter Burley,” in <em>Later\nMediaeval Metaphysics: Ontology, Language, and Logic</em>, Charles\nBolyard and Rondo Keele (eds.), New York: Fordham University Press,\npp. 223–48, 291–99.</li>\n<li>–––, 2013, “Being and Analogy,” in\n<em>A Companion to Walter Burley</em>, Alessandro D. Conti (ed.),\nLeiden, Boston: Brill, pp. 135–65.</li>\n<li>–––, 2014, “Aquinas on Analogy,” in\n<em>Debates in Medieval Philosophy</em>, Jeffrey Hause (ed.), New\nYork: Routledge, pp. 232–242.</li>\n<li>–––, 2017, “Philosophy of Language: Words,\nConcepts, Things, and Non-Things,” in <em>The Routledge\nCompanion to Sixteenth-Century Philosophy</em>, Henrik Lagerlund and\nBenjamin Hill (eds.), New York: Routledge, pp. 350–372.</li>\n<li>Boulnois, Olivier, 1996, “Duns Scot, théoricien de\nl’analogie de l’être,” in <em>John Duns\nScotus: Metaphysics and Ethics</em>, edited by Ludger Honnefelder,\nRega Wood, and Mechthild Dreyer, Studien und Texte zur\nGeistesgeschichte des Mittelalters 53, Leiden, New York, Cologne: E.\nJ. Brill, pp. 293–315.</li>\n<li>Brown, Stephen, 1971, “Robert Cowton, OFM and the\nAnalogy of the Concept of Being,” <em>Franciscan\nStudies</em> 31: 5–40.</li>\n<li>Cross, Richard, 2012, “Duns Scotus and Analogy: A Brief\nNote,” <em>Modern Schoolman</em> 89: 147–54.</li>\n<li>D’Ettore, Domenic, 2014, “The Fifteenth-Century\nThomist Dispute over Participation in an Analogous Concept: John\nCapreolus, Dominic of Flanders, and Paul Soncinas,”\n<em>Mediaeval Studies</em> 76: 241–273.</li>\n<li>–––, 2016, “Some Renaissance Thomists on\nAnalogy in Demonstration,” <em>Angelicum</em> 93:\n927–950.</li>\n<li>–––, 2018, “One Is in the Definition of All: The\nRenaissance Thomist Controversy over a ‘Rule’ for Names Said by\nAnalogy,” <em>The Thomist</em> 82: 89–111.</li>\n<li>–––, 2019, <em>Analogy After Aquinas: Logical Problems,\nThomistic Answers</em>, Washington, D.C.: The Catholic University of\nAmerica Press.</li>\n<li>–––, 2020, “Analogy of Disjunction: John Duns Scotus\nvs. Hervaeus Natalis on the Univocity or Analogy of\nBeing,” <em>Studia Neoaristotelica</em> 17: 7–33.</li>\n<li>–––, 2021, “Does Analogy Work in Demonstration? A\nScotist’s Critique of Thomism,” <em>International\nPhilosophical Quarterly </em>61: 47–60.</li>\n<li>Dewan, Lawrence, 2007, “St. Thomas and Analogy: the\nLogician and the Metaphysician,” in <em>Laudemus viros\ngloriosos: Essays in Honor of Armand Maurer</em>, R. E. Houser (ed.),\nNotre Dame, IN: University of Notre Dame Press: 132–145.</li>\n<li>Di Liso, Saverio, 2005, “Alcune Trattazioni\nTardo-Medievali Sull’univocità e l’analogia\nDell’ente,” <em>Rivista Di Storia Della\nFilosofia</em> 60: 193–223.</li>\n<li>Dumont, Stephen D., 1992, “Transcendental Being: Scotus\nand Scotists,” <em>Topoi </em>11: 135–148.</li>\n<li>Henninger, Mark, 2006, “Thomas Sutton on Univocation,\nEquivocation and Analogy,” <em>The Thomist</em> 70:\n537–535.</li>\n<li>–––, 2006, “Henry of Harclay on the\nUnivocal Concept of Being,” <em>Mediaeval Studies</em>, 68:\n205–237.</li>\n<li>Hochschild, Joshua P., 2010, <em>The Semantics of Analogy:\nRereading Cajetan’s</em> De Nominum Analogia, Notre Dame,\nIndiana: University of Notre Dame Press.</li>\n<li>–––, 2013, “Proportionality and Divine Naming: Did St.\nThomas Change His Mind about Analogy?,” <em>The\nThomist </em>77: 531–58.</li>\n<li>–––, 2019, “Aquinas’s two concepts of analogy and a\ncomplex semantics for naming a simple God,” <em>The\nThomist</em> 83: 155–84.</li>\n<li>Klima, Gyula, 2002, “Aquinas’ Theory of the Copula and\nthe Analogy of Being,” <em>Logical Analysis and History of\nPhilosophy</em> 5: 159–76.</li>\n<li>Libera, Alain de, 1989, “Les sources gréco-arabes de\nla théorie médiévale de l’analogie de\nl’être,” <em>Les études philosophiques</em>,\n3/4: 319–45.</li>\n<li>Lonfat, Joël, 2004, “Archéologie de la\nnotion d’analogie d’Aristote à Saint Thomas\nd’Aquin,” <em>Archives</em> <em>d’histoire</em> <em>doctrinale\net littéraire du Moyen Âge</em> 71: 35–107.</li>\n<li>McInerny, Ralph, 1986, “The Analogy of Names is a Logical\nDoctrine,” in <em>Being and Predication: Thomistic\nInterpretations</em>, Washington, D.C.: The Catholic University of\nAmerica Press, pp. 279–86.</li>\n<li>–––, 1992, “Aquinas and Analogy: Where Cajetan Went\nWrong,” <em>Philosophical Topics</em>, 20(2): 103–124,\n[<em>Medieval Philosophy</em>, Sandra Edwards (ed.)]</li>\n<li>–––, 1996, <em>Aquinas and Analogy</em>, Washington, D.C.:\nThe Catholic University of America Press. </li>\n<li>Montagnes, Bernard, 1963, <em>La doctrine de l’analogie de\nl’être d’après Saint Thomas\nd’Aquin</em>, Philosophes médiévaux 6, Louvain:\nPublications Universitaires; Paris: Béatrice-Nauwelaerts.</li>\n<li>–––, 2004, <em>The Doctrine of the Analogy of\nBeing According to Thomas Aquinas</em>, trans. E. M. Macierowski, P.\nVandevelde, and Andrew Tallon, Marquette Studies in Philosophy 25,\nMilwaukee: Marquette University Press.</li>\n<li>Mora-Márquez, Ana María, 2017,\n“Aristotle’s Fallacy of Equivocation and its 13th Century\nReception,” in <em>Formal Approaches and Natural Language\nin Medieval Logic</em>, Laurent Cesalli, Alain de\nLibera, Frédéric Goubier (eds.), Barcelona/\nRome: Fédération Internationale des\nInstituts d’Études Mediévales: 217–38.</li>\n<li>Novák, Lukáš,\n2021, “Suárez’s Notion of\nAnalogy,” <em>American Catholic Philosophical\nQuarterly</em> 95: 195–233.</li>\n<li>Park, Seung-Chan, 1999, <em>Die Rezeption der mittelalterlichen\nSprachphilosophie in der Theologie des Thomas von Aquin. Mit besondere\nBerücksichtigung der Analogie.</em> Studien und Texte zur\nGeistesgeschichte des Mittalters 65, Leiden, Boston, Köln:\nBrill.</li>\n<li>Pini, Giorgio, 2002, <em>Scoto e L’analogia: Logica e\nmetafisica nei commenti aristotelici</em>, Pisa: Scuola Normale\nSuperiore. </li>\n<li>–––, 2021, “Before univocity: Duns Scotus’s rejection\nof analogy,” in <em>Interpreting Duns Scotus: critical\nessays</em>, Giorgio Pini (ed.), Cambridge: Cambridge\nUniversity Press (<em>forthcoming</em>).</li>\n<li>Reynolds, Philip L., 2003, “Analogy of Names in\nBonaventure,” <em>Mediaeval Studies</em>, 65: 117–62.</li>\n<li>Rosier, Irène, 1995, “<em>Res significata</em> et\n<em>modus significandi</em>: Les implications d’une distinction\nmédiévale,” in <em>Sprachtheorien in\nSpätantike und Mittelalter</em>, Sten Ebbesen (ed.),\nTübingen: Gunter Narr Verlag, pp. 135–68.</li>\n<li>Smith, Garrett R., 2019, “The analogy of being in the\nScotist tradition,” <em>American Catholic Philosophical\nQuarterly</em> 93: 633–73.</li>\n<li>–––, 2021, “Analogy after Duns Scotus: the role of the\n<em>analogia entis </em>in the Scotist metaphysics at Barcelona,\n1320–1330,” in <em>Interpreting Duns Scotus: critical\nessays</em>, Giorgio Pini (ed.), Cambridge: Cambridge\nUniversity Press (<em>forthcoming</em>).<em> </em></li>\n<li>Valente, Luisa, 2008, <em>Logique et théologie. Les\nécoles parisiennes entre 1150 et 1220</em>, Paris: Vrin.</li>\n<li>Wolfson, H. A., 1938, “The Amphibolous Terms in Aristotle,\nArabic Philosophy and Maimonides,” <em>Harvard Theological\nReview</em>, 31: 151–73; reprinted in idem, <em>Studies in the\nHistory of Philosophy and Religion</em>, I. Twersky and G. H. Williams\n(eds.), Cambridge, MA and London: Harvard University Press, 1973.\nVolume 1, pp. 455–77.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aquinas, Thomas",
            "Aristotle, General Topics: categories",
            "Aristotle, General Topics: logic",
            "Boethius, Anicius Manlius Severinus",
            "Duns Scotus, John",
            "Grosseteste, Robert",
            "semiotics: medieval"
        ],
        "entry_link": [
            {
                "../aquinas/": "Aquinas, Thomas"
            },
            {
                "../aristotle-categories/": "Aristotle, General Topics: categories"
            },
            {
                "../aristotle-logic/": "Aristotle, General Topics: logic"
            },
            {
                "../boethius/": "Boethius, Anicius Manlius Severinus"
            },
            {
                "../duns-scotus/": "Duns Scotus, John"
            },
            {
                "../grosseteste/": "Grosseteste, Robert"
            },
            {
                "../semiotics-medieval/": "semiotics: medieval"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=analogy-medieval\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/analogy-medieval/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=analogy-medieval&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/analogy-medieval/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=analogy-medieval": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/analogy-medieval/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=analogy-medieval&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/analogy-medieval/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://pvspade.com/Logic/\" target=\"other\">Paul Vincent Spade’s Mediaeval Logic and Philosophy pages</a>",
            "<a href=\"https://www.prdl.org/\">Post-Reformation Digital Library</a>. The\n PRDL (prdl.org) is an excellent resource for late medieval and early\nmodern texts both in philosophy and in theology. "
        ],
        "listed_links": [
            {
                "http://pvspade.com/Logic/": "Paul Vincent Spade’s Mediaeval Logic and Philosophy pages"
            },
            {
                "https://www.prdl.org/": "Post-Reformation Digital Library"
            }
        ]
    }
}