{
    "url": "concepts",
    "title": "Concepts",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Eric Margolis\n<eric.margolis@ubc.ca>\nStephen Laurence\n<s.laurence@sheffield.ac.uk>",
        "author_links": [
            {
                "http://www.margolisphilosophy.com/": "Eric Margolis"
            },
            {
                "mailto:eric%2emargolis%40ubc%2eca": "eric.margolis@ubc.ca"
            },
            {
                "https://www.sheffield.ac.uk/philosophy/people/academic-staff/stephen-laurence": "Stephen Laurence"
            },
            {
                "mailto:s%2elaurence%40sheffield%2eac%2euk": "s.laurence@sheffield.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\n<a href=\"http://www.margolisphilosophy.com/\" target=\"other\">Eric Margolis</a>\n&lt;<a href=\"mailto:eric%2emargolis%40ubc%2eca\"><em>eric<abbr title=\" dot \">.</abbr>margolis<abbr title=\" at \">@</abbr>ubc<abbr title=\" dot \">.</abbr>ca</em></a>&gt;<br/>\n<a href=\"https://www.sheffield.ac.uk/philosophy/people/academic-staff/stephen-laurence\" target=\"other\">Stephen Laurence</a>\n&lt;<a href=\"mailto:s%2elaurence%40sheffield%2eac%2euk\"><em>s<abbr title=\" dot \">.</abbr>laurence<abbr title=\" at \">@</abbr>sheffield<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Nov 7, 2005",
        "substantive revision Mon Jun 17, 2019"
    ],
    "preamble": "\n\nConcepts are the building blocks of thoughts. Consequently, they are\ncrucial to such psychological processes as categorization, inference,\nmemory, learning, and decision-making. This much is relatively\nuncontroversial. But the nature of concepts—the kind of things\nconcepts are—and the constraints that govern a theory of\nconcepts have been the subject of much debate (Margolis & Laurence\n1999, Margolis & Laurence 2015). This is due, at least in part, to\nthe fact that disputes about concepts often reflect deeply opposing\napproaches to the study of the mind, to language, and even to\nphilosophy itself. In this entry, we provide an overview of theories\nof concepts, and outline some of the disputes that have shaped debates\nsurrounding the nature of concepts. The entry is organized around five\nsignificant issues that are focal points for many theories of\nconcepts. Not every theory of concepts takes a stand on each of the\nfive, but viewed collectively these issues show why the theory of\nconcepts has been such a rich and lively topic in recent years. The\nfive issues are: (1) the ontology of concepts, (2) the structure of\nconcepts, (3) empiricism and nativism about concepts, (4) concepts and\nnatural language, and (5) concepts and conceptual analysis.\n",
    "toc": [
        {
            "#OntCon": "1. The ontology of concepts"
        },
        {
            "#ConMenRep": "1.1 Concepts as mental representations"
        },
        {
            "#ConAbi": "1.2 Concepts as abilities"
        },
        {
            "#ConFreSen": "1.3 Concepts as abstract objects"
        },
        {
            "#IssTer": "1.4 Is the issue merely terminological?"
        },
        {
            "#StrCon": "2. The structure of concepts"
        },
        {
            "#ClaThe": "2.1 The classical theory"
        },
        {
            "#ProThe": "2.2 The prototype theory"
        },
        {
            "#TheThe": "2.3 The theory theory"
        },
        {
            "#ConAto": "2.4 Conceptual atomism"
        },
        {
            "#PluEli": "2.5 Pluralism and eliminativism"
        },
        {
            "#EmpNatAboCon": "3. Empiricism and nativism about concepts"
        },
        {
            "#RenIntEmpDis": "3.1 Renewed interest in the empiricism/nativism dispute"
        },
        {
            "#EmpAboCon": "3.2 Empiricism about concepts"
        },
        {
            "#NatAboCon": "3.3 Nativism about concepts"
        },
        {
            "#ConNatLan": "4. Concepts and natural language"
        },
        {
            "#TheConWitLan": "4.1 Can there be concepts without language?"
        },
        {
            "#PriBetLanCon": "4.2 The priority between language and concepts"
        },
        {
            "#LinDetLinRel": "4.3 Linguistic determinism and linguistic relativity"
        },
        {
            "#ConConAna": "5. Concepts and conceptual analysis"
        },
        {
            "#AttConAna": "5.1 Attractions of conceptual analysis"
        },
        {
            "#ObjConAna": "5.2 Objections to conceptual analysis"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The ontology of concepts\n\nWe begin with the issue of the ontological status of a concept. The\nthree main options are to identify concepts with mental\nrepresentations, with abilities, and with abstract objects such as\nFregean senses.\n1.1. Concepts as mental representations\n\nThe first of these views maintains that concepts are psychological\nentities, taking as its starting point the representational theory of\nthe mind (RTM). According to RTM, thinking occurs in an internal\nsystem of representation. Beliefs and desires and other propositional\nattitudes enter into mental processes as internal symbols. For\nexample, Sue might believe that Dave is taller than Cathy, and also\nbelieve that Cathy is taller than Ben, and together these may cause\nSue to believe that Dave is taller than Ben. Her beliefs would be\nconstituted by mental representations that are about Dave, Cathy and\nBen and their relative heights. What makes these beliefs, as opposed\nto desires or other psychological states, is that the symbols have the\ncharacteristic causal-functional role of beliefs. (RTM is usually\npresented as taking beliefs and other propositional attitudes to be\nrelations between an agent and a mental representation (e.g., Fodor\n1987). But given that the relation in question is a matter of having a\nrepresentation with a particular type of functional role, it is\nsimpler to say that occurrent beliefs just are mental representations\nwith this functional role.)\n\nMany advocates of RTM take the mental representations involved in\nbeliefs and other propositional attitudes to have internal structure.\nAccordingly, the representations that figure in Sue’s beliefs\nwould be composed of more basic representations. For theorists who\nadopt the mental representation view of concepts, concepts are\nidentified with these more basic representations.\n\nEarly advocates of RTM (e.g., Locke (1690/1975) and Hume (1739/1978))\ncalled these more basic representations ideas, and often took\nthem to be mental images. But modern versions of RTM assume that much\nthought is not grounded in mental images. The classic contemporary\ntreatment maintains, instead, that the internal system of\nrepresentation has a language-like syntax and a compositional\nsemantics. According to this view, much of thought is grounded in\nword-like mental representations. This view is often referred\nto as the language of thought hypothesis (Fodor 1975).\nHowever, the analogy with language isn’t perfect; obviously, the\ninternal symbol system must lack many of the properties associated\nwith a natural language. Nonetheless, like a natural language, the\ninternal system’s formulae are taken to have subject/predicate\nform and to include logical devices, such as quantifiers and\nvariables. In addition, the content of a complex symbol is supposed to\nbe a function of its syntactic structure and the contents of its\nconstituents. Returning to Sue’s beliefs, the supposition is\nthat they are composed of such symbols as DAVE, CATHY and TALLER and\nthat her beliefs represent what they do in virtue of the contents of\nthese symbols and how they are arranged .\n\nThe mental representation view of concepts is the default position in\ncognitive science (Carey 2009, Pinker 2007) and enjoys widespread\nsupport in the philosophy of mind, particularly among philosophers who\nview their work as being aligned with research in cognitive science\n(e.g., Carruthers 2006, Millikan 2000, Fodor 2003, Margolis &\nLaurence\n 2007).[1]\n Supporters of this view argue for it on explanatory grounds. They\nmaintain that concepts and structured mental representations play a\ncrucial role in accounting for the productivity of thought (i.e., the\nfact that human beings can entertain an unbounded number of thoughts),\nin explaining how mental processes can be both rational and\nimplemented in the brain, and in accommodating the need for\nstructure-sensitive mental processes (Fodor 1987; see also the entry\n language of thought hypothesis).\n\nCritics of this view argue that it is possible to have propositional\nattitudes without having explicitly entertained the relevant mental\nrepresentations. Daniel Dennett (1977), for example, argues that most\npeople believe zebras don’t wear overcoats in the\nwild—and a million other similar facts—even though\nthey have never stopped to consider such matters. Dennett also notes\nthat computing systems can lack representations corresponding to the\nexplanations we cite in characterizing and predicting their behavior.\nFor example, it may make perfect sense to say of a chess-playing\ncomputer that it thinks that it is good to get one’s queen out\nearly, even though we know from how the computer is programmed that it\nhas no representation with that very content (see Dennett 1978, 1987\nfor these and related criticisms and Fodor 1987 and Manfredi 1993 for\nresponses).\n\nOther critics claim that RTM is too closely associated with\ncommonsense psychology, which they argue should be abandoned as a\nstagnant and degenerate research program (Churchland 1981; see entry\n eliminative materialism),\n or that developments in computational modeling (esp. connectionism\nand dynamic systems theory) offer alternatives, particularly to the\nlanguage of thought version of RTM (e.g., see Clark 1993, Van Gelder\n1995, Elman et al. 1996, McClelland et al. 2010; see Fodor &\nPylyshyn 1988, Marcus 2001, and Gallistel & King 2009 for critical\ndiscussion of theories that don’t employ combinatorial\nstructure.)\n1.2 Concepts as abilities\n\nAccording to the abilities view, it’s wrong to maintain that\nconcepts are mental particulars—concepts are neither mental\nimages nor word-like entities in a language of thought. Rather,\nconcepts are abilities that are peculiar to cognitive agents (e.g.,\nDummett 1993, Bennett & Hacker 2008, Kenny 2010). The concept CAT,\nfor example, might amount to the ability to discriminate cats from\nnon-cats and to draw certain inferences about cats.\n\nWhile the abilities view is maintained by a diverse group of\nphilosophers, the most prominent reason for adopting the view is a\ndeep skepticism about the existence and utility of mental\nrepresentations, skepticism that traces back Ludwig Wittgenstein\n(1953/1958). One of the most influential arguments along these lines\nclaims that mental representations are explanatorily idle because they\nreintroduce the very sorts of problems they are supposed to explain.\nFor example, Michael Dummett cautions against trying to explain\nknowledge of a first language on the model of knowledge of a second\nlanguage. In the case of a second language, it is reasonable to\nsuppose that understanding the language involves translating its words\nand sentences into words and sentences of one’s first language.\nBut according to Dummett, one can’t go on to translate words and\nsentences of one’s first language into a prior mental language.\n“[T]here is really no sense to speaking of a concept’s\ncoming into someone’s mind. All we can think of is some image\ncoming to mind which we take as in some way representing the concept,\nand this gets us no further forward, since we still have to ask in\nwhat his associating that concept with that image consists”\n(Dummett 1993, p. 98). In other words, the mental representation\nitself is just another item whose significance bears explaining.\nEither we are involved in a vicious regress, having to invoke yet\nanother layer of representation (and so on indefinitely) or we might\nas well stop with the external language and explain its significance\ndirectly. (For critical discussion of this type of regress argument,\nsee Fodor 1975, Crane 2015, Laurence & Margolis 1997).\n\nNot surprisingly, critics of the abilities view argue in the other\ndirection. They note difficulties that the abilities view inherits by\nits rejection of mental representations. One is that the view is\nill-equipped to explain the productivity of thought; another is that\nit can say little about mental processes. And if proponents of the\nabilities view remain neutral about the existence of mental\nrepresentations, they open themselves to the criticism that\nexplication of these abilities is best given in terms of underlying\nmental representations and processes (see Fodor 1968 and Chomsky 1980\nfor general discussion of the anti-intellectualist tradition in the\nphilosophy of mind).\n1.3 Concepts as abstract objects\n\nAn alternative conception of concepts takes concepts to be abstract\nobjects of one type or another. The idea behind this view is that\nconcepts are the meanings (or “contents”) of words and\nphrases as opposed to mental objects or mental states.  This type of\nview has most prominently been associated with the view that concepts\nare Fregean senses (e.g., Peacocke 1992, Zalta 2001), so it is this\nversion of the view that concepts are abstract objects that we will\nfocus on here. For proponents of this view, concepts, as meanings,\nmediate between thought and language, on the one hand, and referents,\non the other. An expression without a referent (“Pegasus”)\nneedn’t lack a meaning, since it still has a sense. Similarly,\nthe same referent can be associated with different expressions (e.g.,\n“Eric Blair” and “George Orwell”) because they\nconvey different senses.  Senses are more discriminating than\nreferents. Each sense has a unique perspective on its referent—a\nmode of presentation which represents the referent in a particular\nway. Differences in cognitive content trace back to differences in\nmodes of presentation. It’s for this reason that the thought\nthat George Orwell is Eric Blair lacks the triviality of the\nthought that George Orwell is George Orwell even though George\nOrwell and Eric Blair are the same person. Philosophers who take\nconcepts to be senses particularly emphasize this feature of\nsenses. Christopher Peacocke, for example, locates the subject matter\nof a theory of concepts as follows: “Concepts C\nand D are distinct if and only if there are two complete\npropositional contents that differ at most in that one\ncontains C substituted in one or more places for\nD, and one of which is potentially informative while the\nother is not” (Peacocke 1992, p. 2). In other words, C\nand D embody differing modes of presentation. (See the entry\n Frege\n for discussion of the sense/reference distinction and for more on the\nexplanatory functions associated with senses. To avoid terminological\nconfusion, we should note that Frege himself did not use the term\n\"concept\" for senses, but rather for the referents of predicates.\nSimilarly, it is worth noting that Frege uses the term \"thought\" to\nstand for propositions, so for Frege thoughts are not psychological\nstates at all but rather the meanings of psychological states.)\n\nThe view that concepts are Fregean senses, like the abilities view, is\ngenerally held by philosophers who are opposed to identifying concepts\nwith mental representations. Peacocke himself doesn’t go so far\nas to argue that mental representations are explanatorily idle, but he\ndoes think that mental representations are too fine-grained for\nphilosophical purposes. “It is possible for one and the same\nconcept to receive different mental representations in different\nindividuals” (Peacocke 1992, p. 3). He is also concerned that\nidentifying concepts with mental representations rules out the\npossibility of there being concepts that human beings have never\nentertained, or couldn’t ever entertain.\n\nIf we accept that a thinker’s possession of a concept must be\nrealized by some subpersonal state involving a mental representation,\nwhy not say simply that the concept is the mental representation? Just\nthis proposal is made by Margolis and Laurence (1999, 77). Mental\nrepresentations that are concepts could even be typed by the\ncorresponding possession condition of the sort I favour. This seems to\nme an entirely legitimate notion of a kind of mental representation;\nbut it is not quite the notion of a concept. It can, for instance, be\ntrue that there are concepts human beings may never acquire, because\nof their intellectual limitations, or because the sun will expand to\neradicate human life before humans reach a stage at which they can\nacquire these concepts. ‘There are concepts that will never be\nacquired’ cannot mean or imply ‘There are mental\nrepresentations which are not mental representations in anyone’s\nmind’. If concepts are individuated by their possession\nconditions, on the other hand, there is no problem about the existence\nof concepts that will never be acquired. They are simply concepts\nwhose possession conditions will never be satisfied by any thinkers.\n(Peacocke, 2005, p. 169).\n\n\nAdvocates of the mental representation view would respond to these\narguments by invoking the type/token distinction with respect to\nmental representations. Just as two speakers can each produce distinct\ninstances (that is, tokens)of the same type of word (e.g., the word\n“chair”), different thinkers’ minds can produce\ndistinct instances (that is, tokens) of the same type of mental\nrepresentation (e.g., the mental representation CHAIR). How does this\nhelp with the present objection? According to the mental\nrepresentation view, to say that there are concepts that haven’t\nbeen acquired by anyone is just to say that, for some types of mental\nrepresentations, there has not yet been a token in anyone’s\nmind; to say that some concepts will never be acquired by anyone is\njust to say that, for some types of mental representations, there\nnever will be a token in anyone’s mind (Margolis & Laurence\n2007).\n\nCritics of the sense-based view have questioned the utility of\nappealing to such abstract objects (Quine 1960). One difficulty stems\nfrom the fact that senses, as abstract entities, stand outside of the\ncausal realm. The question then is how we can access these objects.\nAdvocates of the Fregean sense view describe our access to senses by\nmeans of the metaphor of “grasping”—we are said to\ngrasp the sense of an expression. But grasping here is just a metaphor\nfor a cognitive relation that needs to be explicated. Moreover, though\nsenses are hypothesized as providing different modes of presentation\nfor referents, it is not clear why senses themselves do not generate\nthe mode of presentation problem (Fodor 1998). Since they are external\nto our minds, just as referents typically are, it isn’t clear\nwhy we can’t stand in different epistemic relations towards them\njust as we can to referents. In the same way that we can have\ndifferent modes of presentation for a number (the only even prime, the\nsum of one and one, Tim’s favorite number, etc.), we ought to be\nable to have different modes of presentation for a given sense.\n1.4 Is the issue merely terminological?\n\nStepping back from the details of these three views, there is no\nreason, in principle, why the different views of concepts\ncouldn’t be combined in various ways. For instance, one might\nmaintain that concepts are mental representations that are typed in\nterms of the Fregean senses they express (see Margolis & Laurence\n2007 for discussion).\nOne might also question whether the dispute about ontology is a\nsubstantive dispute. Perhaps there is only a terminological issue\nabout which things ought to be granted the label\n“concepts”. If so, why not just call mental\nrepresentations “concepts1”, the relevant\nabilities “concepts2”, senses\n“concepts3”, and leave it at that?\n\nHowever, the participants in the dispute don’t generally view it\nas a terminological one. Perhaps this is because they associate their\nown theories of concepts with large-scale commitments about the way\nthat philosophers should approach the study of mind and language.\nUndoubtedly, from Dummett’s perspective, philosophers who\nembrace the mental representation view also embrace RTM, and RTM, as\nhe sees it, is fundamentally misguided. Likewise, from Fodor’s\nperspective, RTM is critical to the study of the mind, so an approach\nlike Dummett’s, which disallows RTM, places inappropriate a\npriori constraints on the study of the mind. Given that the\ndisagreement about concepts is so closely tied to such clearly\nsubstantive explanatory disagreements, the debate about what concepts\nare would itself seem to be a substantive disagreement about what\nsorts of entities are best suited to playing the central explanatory\nroles associated with concepts.\n\nOf course, it is possible to introduce new theoretical terms\n(“concepts1”,\n“concepts2”, and\n“concepts3”) for the different theoretical\nposits made by the different approaches we have been considering (the\nability view, the mental representation view, and the abstract object\nview), and then reconstruct the debate regarding these different\napproaches as a merely terminological disagreement about which of\nthese terms we should use. But notice that it is possible to do the\nsame thing even for clear-cut substantive debates. For example, we\ncould introduce new terms for moral goodness as understood by\ndeontologists (“good1”) and as understood by\nconsequentialists (“good2”), and then\nreconstruct the debate about what moral goodness consists in as a\nmerely terminological disagreement about which term we should use,\n“good1” or “good2”. Or\nwe could introduce “human1” for humans as\nunderstood by standard evolutionary accounts (according to which\nhumans have nonhuman primate ancestors) and\n“human2” for humans understood by creationists\n(according to which they don't), and reconstruct the debate between\nthese different approaches as a merely terminological issue about\nwhich term we should use, “human1” or\n“human2”.  The danger, of course, is that this\nwould drain the very idea of a merely terminological debate\nof its utility and obscure very real differences between different\nsorts of disagreements (e.g., stipulative vs. substantive) that would\nall end up counting as “merely terminological”.\n\nIn the remainder of this entry we will frame questions from the\nperspective of the mental representation view, but readers who prefer\na different view can reframe the issues in their preferred terms.  For\nexample, the questions “Can there be concepts without\nlanguage?” is typically understood on the mental representation\nview as asking whether a pre-linguistic or non-linguistic agent can\nentertain mental representations of a particular kind.  If one adopts\nthe view that concepts are abstract objects, the corresponding\nquestion might be whether a pre-linguistic or non-linguistic agent can\nstand in the concept possession relation to concepts understood as\nabstract objects of a certain type.  And if one adopts the view that\nconcepts are abilities, the corresponding question might be whether a\npre-linguistic or non-linguistic agent can have the abilities that are\nconstitutive of concept possession.\n2. The structure of concepts\n\nJust as thoughts are composed of concepts, many concepts are\nthemselves complex entities that are composed of other concepts or\nmore basic representational components. In this section, we look at\ndifferent proposals about the structure of what are often called\nlexical concepts. Roughly speaking, these are concepts that\ntend to be associated with individual words in natural\nlanguage—concepts like BIRD and WALK as opposed to manifestly\ncomplex concepts like NOCTURNAL ANIMALS THAT LIVE IN TREES or TO WALK\nAIMLESSLY ON A NEWLY PAVED ROAD. With BIRD and WALK and similar\nconcepts, it isn’t obvious what type of internal structure (if\nany) they have, and this has led to a great deal of controversy\n(Margolis & Laurence 1999, Murphy 2002). Accounts of the structure\nof lexical concepts have focused on concepts for categories of\nobjects, actions, and events rather than concepts for individuals. Our\ndiscussion will share this focus (see, e.g., Blok et al. 2005 and\nLevine 2010 for discussion of concepts of individuals).\n2.1 The classical theory\n\nIn one way or another, all theories regarding the structure of\nconcepts are developments of, or reactions to, the classical\ntheory of concepts. According to the classical theory, a lexical\nconcept C has definitional structure in that it is composed\nof simpler concepts that express necessary and sufficient conditions\nfor falling under C. The stock example is the concept\nBACHELOR, which is traditionally said to have the constituents\nUNMARRIED and MAN. If the example is taken at face value, the idea is\nthat something falls under BACHELOR if it is an unmarried man and only\nif it is an unmarried man. According to the classical theory, lexical\nconcepts generally will exhibit this same sort of definitional\nstructure. This includes such philosophically interesting concepts as\nTRUTH, GOODNESS, FREEDOM, and JUSTICE.\n\nBefore turning to other theories of conceptual structure, it’s\nworth pausing to see what’s so appealing about classical or\ndefinitional structure. Much of its appeal comes from the way it\noffers unified treatments of concept acquisition, categorization, and\nreference determination. In each case, the crucial work is being done\nby the very same components. Concept acquisition can be understood as\na process in which new complex concepts are created by assembling\ntheir definitional constituents. Categorization can be understood as a\npsychological process in which a complex concept is matched to a\ntarget item by checking to see if each and every one of its\ndefinitional constituents applies to the target. And reference\ndetermination, we’ve already seen, is a matter of whether the\ndefinitional constituents do apply to the target.\n\nThese considerations alone would be enough to show why the classical\ntheory has been held in such high regard. But the classical theory\nreceives further motivation through its connection with a\nphilosophical method that goes back to antiquity and that continues to\nexert its influence over contemporary thought. This is the method of\nconceptual analysis. Paradigmatic conceptual analyses offer\ndefinitions of concepts that are to be tested against potential\ncounterexamples that are identified via thought experiments.\nConceptual analysis is supposed to be a distinctively a priori\nactivity that many take to be the essence of philosophy. To the extent\nthat paradigmatic conceptual analyses are available and successful,\nthis will convey support for the classical theory. Conversely, if the\ndefinitions aren’t there to be discovered, this would seem to\nput in jeopardy a venerable view of what philosophy is and how\nphilosophical investigations ought to proceed (see\n section 5\n below).\n\nThe classical theory has come under considerable pressure in the last\nforty years or so, not just in philosophy but in psychology and other\nfields as well. For psychologists, the main problem has been that the\nclassical theory has difficulty explaining a robust set of empirical\nfindings. At the center of this work is the discovery that certain\ncategories are taken to be more representative or typical and that\ntypicality scores correlate with a wide variety of psychological data\n(for reviews, see Smith & Medin 1981, Murphy 2002). For instance,\napples are judged to be more typical than plums with respect to the\ncategory of fruit, and correspondingly apples are judged to have more\nfeatures in common with fruit. There are many other findings of this\nkind. One other is that more typical items are categorized more\nefficiently. For example, subjects are quicker to judge that apples\nare a kind of fruit than to judge that plums are. The problem\nisn’t that the classical theory is inconsistent with results\nlike these but that it does nothing to explain them.\n\nIn philosophy, the classical theory has been subjected to a number of\ncriticisms but perhaps the most fundamental is that attempts to\nspecify definitions for concepts have a poor track record. Quite\nsimply, there are too few examples of successful definitional\nanalyses, and certainly none that are uncontroversial (Wittgenstein\n1953/1958, Fodor 1981). The huge literature on the analysis of\nknowledge is representative of the state of things. Since Edmund\nGettier (1963) first challenged the traditional definition of\nKNOWLEDGE (as JUSTIFIED TRUE BELIEF), there has been widespread\nagreement among philosophers that the traditional definition is\nincorrect or at least incomplete (see the entry\n the analysis of knowledge)).\n But no one can seem to agree on what the correct definition is.\nDespite the enormous amount of effort that has gone into the matter,\nand the dozens of papers written on the issue, we are still lacking a\nsatisfactory and complete definition. It could be that the problem is\nthat definitions are hard to come by. But another\npossibility—one that many philosophers are now taking\nseriously—is that our concepts lack definitional structure.\n2.2 The prototype theory\n\nWhat other type of structure could they have? A non-classical\nalternative that emerged in the second half of the twentieth century\nis the prototype theory (e.g., Hampton 2006). According to\nthis theory, a lexical concept C doesn’t have\ndefinitional structure but has probabilistic structure in that\nsomething falls under C just in case it satisfies a\nsufficient number of properties encoded by C’s\nconstituents. The prototype theory has its philosophical roots in\nWittgenstein’s (1953/1958) famous remark that the things covered\nby a term often share a family resemblance, and it has its\npsychological roots in Eleanor Rosch’s groundbreaking\nexperimental treatment of much the same idea (Rosch & Mervis 1975,\nRosch 1978). The prototype theory is especially at home in dealing\nwith the typicality effects that were left unexplained by the\nclassical theory. One standard strategy is to maintain that, on the\nprototype theory, categorization is to be understood as a similarity\ncomparison process, where similarity is computed as a function of the\nnumber of constituents that two concepts hold in common. On this\nmodel, the reason apples are judged to be more typical than plums is\nthat the concept APPLE shares more of its constituents with FRUIT.\nLikewise, this is why apples are judged to be a kind of fruit faster\nthan plums are.\n\nThe prototype theory does well in accounting for a variety of\npsychological phenomena and it helps to explain why definitions may be\nso hard to produce. But the prototype theory has its own problems and\nlimitations. One is that its treatment of categorization works best\nfor quick and unreflective judgments. Yet when it comes to more\nreflective judgments, people go beyond the outcome of a similarity\ncomparison. If asked whether a dog that is surgically altered to look\nlike a raccoon is a dog or a raccoon, the answer for most of us, and\neven for children, is that it is remains a dog (see Keil 1989, Gelman\n2003 for discussion). Another criticism that has been raised against\ntaking concepts to have prototype structure concerns compositionality.\nWhen a patently complex concept has a prototype structure, it often\nhas emergent properties, ones that don’t derive from the\nprototypes of its constituents (e.g., PET FISH encodes properties such\nas brightly colored, which have no basis in the prototype structure\nfor either PET or FISH). Further, many patently complex concepts\ndon’t even have a prototype structure (e.g., CHAIRS THAT WERE\nPURCHASED ON A WEDNESDAY) (Fodor & Lepore 1996, Fodor 1998; for\nresponses to the arguments from compositionality, see Prinz 2002,\nRobbins 2002, Hampton & Jönsson 2012, and Del Pinal\n2016).\n\nOne general solution that addresses all of these problems is to hold\nthat a prototype constitutes just part of the structure of a concept.\nIn addition, concepts have conceptual cores, which specify\nthe information relevant to more considered judgments and which\nunderwrite compositional processes. Of course, this just raises the\nquestion of what sort of structure conceptual cores have. One\nsuggestion is that conceptual cores have classical structure (Osherson\n& Smith 1981, Landau 1982). This won’t do, however, since it\njust raises once again most of the problems associated with the\nclassical theory (Laurence & Margolis 1999).\n2.3 The theory theory\n\nAnother and currently more popular suggestion is that cores are best\nunderstood in terms of the theory theory of concepts. This is\nthe view that concepts stand in relation to one another in the same\nway as the terms of a scientific theory and that categorization is a\nprocess that strongly resembles scientific theorizing (see, e.g.,\nCarey 1985, 2009, Gopnik & Meltzoff 1997, Keil 1989). It’s\ngenerally assumed, as well, that the terms of a scientific theory are\ninterdefined so that a theoretical term’s content is determined\nby its unique role in the theory in which it occurs.\n\nThe theory theory is especially well-suited to explaining the sorts of\nreflective categorization judgments that proved to be difficult for\nthe prototype theory. For example, theory theorists maintain that\nchildren override perceptual similarity in assessing the situation\nwhere the dog is made to look like a raccoon, claiming that even\nchildren are in possession of a rudimentary biological theory. This\ntheory tells them that being a dog isn’t just a matter of\nlooking like a dog. More important is having the appropriate hidden\nproperties of dogs—the dog essence (see Atran & Medin 2008\non folkbiology). Another advantage of the theory theory is that it is\nsupposed to help to explain important aspects of conceptual\ndevelopment. Conceptual change in childhood is said to follow the same\npattern as theory change in science.\n\nOne problem that has been raised against the theory theory is that it\nhas difficulty in allowing for different people to possess the same\nconcepts (or even for the same person to have the same concept over\ntime). The reason is that the theory theory is holistic. A\nconcept’s content is determined by its role in a theory, not by\nits being composed of just a handful of constituents. Since beliefs\nthat enter people’s mental theories are likely to be different\nfrom one another (and are likely to change), there may be no\nprincipled basis for comparison (Fodor & Lepore 1992). Another\nproblem with the theory theory concerns the analogy to theory change\nin science. The analogy suggests that children undergo radical\nconceptual reorganization in the course of cognitive development, but\nmany of the central case studies have proved to be controversial on\nempirical grounds, with evidence that the relevant concepts are\nimplicated in core knowledge systems that are enriched in development\nbut not fundamentally altered (see Spelke & Kinzler 2007 on core\nknowledge). However, there are certain specific examples where radical\nconceptual reorganization is plausible, for instance, when children\neventually develop a theory of matter that allows them to\ndifferentiate weight from density, and air from nothing (Carey\n2009).\n2.4 Conceptual atomism\n\nA radical alternative to all of the theories we’ve mentioned so\nfar is conceptual atomism, the view that lexical concepts\nhave no semantic structure (Fodor 1998, Millikan 2000). According to\nconceptual atomism, the content of a concept isn’t determined by\nits relation to other concepts but by its relation to the world.\n\nConceptual atomism follows in the anti-descriptivist tradition that\ntraces back to Saul Kripke, Hilary Putnam, and others working in the\nphilosophy of language (see Kripke 1972/80, Putnam 1975, Devitt 1981).\nKripke, for example, argues that proper names function like mere tags\nin that they have no descriptive content (Kripke 1972/80). On a\ndescription theory one might suppose that “Gödel”\nmeans something like the discoverer of the incompleteness of\narithmetic. But Kripke points out we could discover that Schmitt\nreally discovered the incompleteness of arithmetic and that Gödel\ncould have killed Schmitt and passed the work off as his own. The\npoint is that if the description theory were correct, we would be\nreferring to Schmitt when we say “Gödel”. But\nintuitively that’s not the case at all. In the imagined\nscenario, the sentence “Gödel discovered the incompleteness\nof arithmetic” is saying something false about Gödel, not\nsomething trivially true about the discoverer of the incompleteness of\narithmetic, whoever that might be (though see Machery et al. 2004 on\nwhether this intuition is universal and Genone 2012 for discussion of\nthe role of intuitions in theories of reference). Kripke’s\nalternative account of names is that they achieve their reference by\nstanding in a causal relation to their referents. Conceptual atomism\nemploys a similar strategy while extending the model to all sorts of\nconcepts, not just ones for proper names.\n2.5 Pluralism and eliminativism\n\nAt present, the nature of conceptual structure remains unsettled.\nPerhaps part of the problem is that more attention needs to be given\nto the question of what explanatory work conceptual structure is\nsupposed to do and the possibility that there are different types of\nstructure associated with different explanatory functions. We’ve\nseen that conceptual structure is invoked to explain, among other\nthings, typicality effects, reflective categorization, cognitive\ndevelopment, reference determination, and compositionality. But there\nis no reason to assume that a single type of structure can explain all\nof these things. As a result, there is no reason why philosophers\nshouldn’t maintain that concepts have different types of\nstructure. For example, notice that atomism is largely motivated by\nanti-descriptivism. In effect, the atomist maintains that considerable\npsychological variability is consistent with concepts entering into\nthe same mind-world causal relations, and that it’s the latter\nthat determines a concept’s reference. But just because the\nmechanisms of reference determination permit considerable\npsychological variability doesn’t mean that there aren’t,\nin fact, significant patterns for psychologists to uncover. On the\ncontrary, the evidence for typicality effects is impressive by any\nmeasure. For this reason, it isn’t unreasonable to claim that\nconcepts do have prototype structure even if that structure has\nnothing to do with the determination of a concept’s referent.\nSimilar considerations suggest that concepts may have theory-structure\nand perhaps other types of structure as well (see Laurence &\nMargolis 1999 on different types of conceptual structure). \n\nOne way of responding to the plurality of conceptual structures is to\nsuppose that concepts have multiple types of structure. This is the\ncentral idea behind conceptual pluralism. According to one\nversion of conceptual pluralism, suggested by Laurence & Margolis\n(1999), a given concept will have a variety of different types of\nstructure associated with it as components of the concept in question.\nFor example, concepts may have atomic cores that are linked to\nprototypes, internalized theories, and so on. On this approach, the\ndifferent types of structure that are components of a given concept\nplay different explanatory roles. Reference determination and\ncompositionality have more to do with the atomic cores themselves and\nhow they are causally related to things outside of the mind, while\nrapid categorization and certain inferences depend on prototype\nstructure, and more considered inferences and reasoning depend upon\ntheory structure. Many variants on this general proposal are possible,\nbut the basic idea is that, while concepts have a plurality of\ndifferent types of structure with different explanatory roles, this\ndiffering structure remains unified through the links to an atomic\nrepresentation that provides a concept’s reference. One\nchallenge for this type of account is to delineate which of the\ncognitive resources that are associated with a concept should be\ncounted as part of its structure and which should not. As a general\nframework, the account is neutral regarding this question, but as the\nframework is filled in, clarification will be needed regarding the\nstatus of potential types of structure. \n\nA different form of pluralism about conceptual structure doesn’t\nemploy atomic cores but simply says that the prototype, theory, etc.\nare all themselves concepts (Weiskopf 2009). Rather than holding that\na single concept (e.g., the concept CAT) has multiple types of\nstructure as components, as in the first form of pluralism, this form\ntakes each type of structure to be a concept on its own,\nresulting in a plurality of concepts (CAT1,\nCAT2, CAT3, etc). On this view, it is wrong to\nsuppose that there is such a thing as the concept CAT. Instead,\nthere are many cat-concepts, each with a different type of structure,\nwhere each is involved in just a subset of the high-level\npsychological processes associated with cats. CAT1, for\nexample, might explain some instances of categorization and some\ninferences, while CAT2, CAT3, etc. explain\nothers. What’s more, on this form of pluralism, people might\nalso differ with respect to which kinds of cat-concepts they possess.\nAnd even if two people have a cat-concept with the same general type\nof structure (e.g., prototype structure), the concepts might still be\nrather different (treating prototypical cats as having rather\ndifferent sorts of properties). In response to this second form of\npluralism, some philosophers have argued that CAT1,\nCAT2, etc. may be better understood as different senses of\na single CAT concept, on analogy with the different senses of a\npolysemous linguistic expression (e.g. the physical object\nsense and the content sense of “book”)(Vicente\n& Manrique 2016). Regardless of whether one accepts this point\nabout polysemy, an important challenge facing this second\n(“multiple concepts”) version of pluralism is to explain\nwhy all of the different cat-concepts count as cat-concepts—that\nis, to explain what unifies the plurality of cat-concepts. A natural\nanswer to this challenge is that what unifies them is that they all\nrefer to the same category, the category of cats. But it is not so\nclear that they can all refer to the same category given the\ndifferences between the different cat-concepts and the way that they\nfunction in cognition. For example, a standard prototype structure\nwould capture prototypical cats and exclude the highly unusual,\natypical cats that a theory structure would cover, and consequently\nthe two concepts would refer to distinct (though related) categories.\n\n\nIn all of its forms, pluralism about conceptual structure recognizes\nthat concepts have diverse functions and that a corresponding variety\nof types of representations are needed to fulfill these functions.\nThese same considerations have led some theorists to advocate\nconcept eliminativism—the view that there are no concepts\n(Machery 2009). The reasoning behind concept eliminativism is that\nconcept should be understood to be a natural kind if concepts\nexist at all, and that natural kinds ought to have significant\ncommonalities that can be discovered using empirical methods,\nincluding commonalities that go well beyond the criteria that are\ninitially used to characterize them. But according to concept\neliminativists, there are no such commonalities that hold among the\ntypes of representations that pluralists embrace. Perhaps we need\nprototypes and theories and other types of representations for\ndistinct higher-level cognitive processes, but they are too diverse to\nwarrant the claim that they constitute a single kind. On this view,\nthen, we should simply abandon the theoretical construct of a concept\nand refer only to more fine-grained types of representations, such as\nprototypes and theories. Opponents of concept eliminativism have\nresponded to the eliminativist’s challenge in a number of ways.\nSome have argued that Machery’s criteria for elimination are\nsimply too strong and that concept, understood as a\nhigher-level kind or perhaps a functional kind, has great utility in\npsychological models of cognitive processes (e.g., Hampton 2010,\nLalumera 2010, Strohminger & Moore 2010). Others have argued that\nMachery’s criteria for something’s being a natural kind\nare too restrictive and that his view would have the consequence of\nruling out clear cases of legitimate higher-level kinds in science\ngenerally (e.g., Gonnerman & Weinberg 2010, Margolis &\nLaurence 2010). And others have argued that even if we grant\nMachery’s stringent criteria for being a natural kind,\nelimination wouldn’t follow, as concepts are natural\nkinds according to his criteria (Samuels & Ferreira 2010, Weiskopf\n2010). (For further critical discussion of eliminativism, see the peer\ncommentary that appears with Machery 2010 and the author’s\nresponse.) \n3. Empiricism and nativism about concepts\n\nOne of the oldest questions about concepts concerns whether there are\nany innate concepts and, if so, how much of the conceptual system is\ninnate. Empiricists maintain that there are few if any innate concepts\nand that most cognitive capacities are acquired on the basis of a few\nrelatively simple general-purpose cognitive mechanisms. Nativists, on\nthe other hand, maintain that there may be many innate concepts and\nthat the mind has a great deal of innate differentiation into complex\ndomain-specific subsystems.\n3.1 Renewed interest in the empiricism/nativism dispute\n\nIn recent years, the debate over innate concepts has been\nreinvigorated as advances in cognitive science have provided\nphilosophers with new tools for revisiting and refining the\ntraditional dispute (see, e.g., Elman et al. 1996, Carruthers,\nLaurence, & Stich 2005, 2006, 2007, Johnson 2010). Philosophers\nhave greatly benefited from empirical studies in such diverse fields\nas developmental psychology, evolutionary psychology, cognitive\nanthropology, neuroscience, linguistics, and ethology. Part of the\nphilosophical interest of this work is that, while the scientists\nthemselves take sides on the empiricist-nativist dispute, their\ntheories and data are often open to interpretation.\n\nAs an example, one of the earliest lines of investigation that\nappeared to support traditional nativist conceptions of the mind was\nthe study of language (Pinker 1994). Noam Chomsky and his followers\nargued that language acquisition succeeds even though children are\nonly exposed to severely limited evidence about the structure of their\nlanguage (Chomsky 1967, 1975, 1988; see also Laurence & Margolis\n2001). Given the way that the final state (e.g., knowledge of English)\noutstrips the data that are available to children, we can only\npostulate that the human mind brings to language acquisition a complex\nset of language-specific dispositions. For Chomsky, these dispositions\nare grounded in a set of innate principles that constrain all possible\nhuman natural languages, viz., universal grammar (see Baker 2001 and\nRoberts 2017 on universal grammar).\n\nNot surprisingly, many philosophers have questioned Chomsky’s\nposition. The ensuing debate has helped to sharpen the crucial\narguments and the extent to which nativist models should continue to\ncommand their central place in linguistic theory. (On the empiricist\nside, see Cowie 1999, Prinz 2002, and Sampson 2005; on the nativist\nside, see Laurence & Margolis 2001 and Pietroski & Crain 2012;\nsee also the entry\n innateness and language\n and the entry\n philosophy of linguistics).\n For instance, one of Fiona Cowie’s criticisms of\nChomsky’s poverty of the stimulus argument is that any induction\nestablishes a conclusion that outstrips the available data; hence,\ngoing beyond the data in the case of language acquisition\ndoesn’t argue for innate language-specific\ndispositions—or else there would have to be a specific innate\ndisposition for every induction we make (for an earlier version of\nthis argument, see Putnam 1967, Goodman 1969). Both Laurence &\nMargolis (2001) and Crain & Pietroski (2001) respond by teasing\nout the various ways in which the problem of language acquisition goes\nbeyond general problems about induction.\n3.2 Empiricism about concepts\n\nTraditionally, empiricists have argued that all concepts derive from\nsensations. Concepts were understood to be formed from copies of\nsensory representations and assembled in accordance with a set of\ngeneral-purpose learning rules, e.g., Hume’s principles of\nassociation (Hume 1739/1978). On this view, the content of any concept\nmust be analyzable in terms of its perceptual basis. Any purported\nconcept that fails this test embodies a confusion. Thus David Hume\nends his Enquiry with the famous remark:\n\nWhen we run over libraries, persuaded of these principles, what havoc\nmust we make? If we take in our hand any volume; of divinity or school\nmetaphysics, for instance; let us ask, Does it contain any\nabstract reasoning concerning quantity or number? No. Does it\ncontain any experimental reasoning concerning matter of fact and\nexistence? No. Commit it then to the flames: For it can contain\nnothing but sophistry and illusion. (1748/1975, p. 165)\n\n\nA similar doctrine was maintained by the logical positivists in the\nearly Twentieth Century, though the positivists couched the view in\nlinguistic terms (Ayer 1959). Their principle of verification required\nfor a sentence or statement to be meaningful that it have empirical\nconsequences, and, on some formulations of the principle, that the\nmeaning of a sentence is the empirical procedure for confirming it\n(see the entry\n Vienna Circle).\n Sentences that have no empirical consequences were deemed to be\nmeaningless. Since a good deal of philosophy purports to express\npropositions that transcend all possible experience, the positivists\nwere happy to say that these philosophical doctrines are entirely\ndevoid of content and are composed of sentences that aren’t\nmerely false but are literally gibberish.\n\nDespite the unpopularity of verificationism (though see Dummett 1993,\nWright 1989, and Dennett 1991), a growing number of philosophers are\nattracted to modified forms of empiricism, forms that primarily\nemphasize psychological relations between the conceptual system and\nperceptual and motor states, not semantic relations. An example is\nLawrence Shapiro’s defense of the claim that the type of body\nthat an organism has profoundly affects its cognitive operations as\nwell as the way that the organism is likely to conceptualize the world\n(Shapiro 2004). Shapiro’s claim is directed against\nphilosophical theories that willfully ignore contingent facts about\nhuman bodies as if a human mind could inhere in wildly different body\ntypes. Drawing on a number of empirical research programs, Shapiro\ncites examples that appear to support what he calls the embodied\nmind thesis, viz., that “minds profoundly reflect the\nbodies in which they are contained” (Shapiro 2004, p. 167).\n\nJesse Prinz (2002) also defends a modified form of empiricism. Prinz\nclaims that “all (human) concepts are copies or combinations of\ncopies of perceptual representations” (Prinz 2002, p. 108).\nThough the reference to copies is a nod to Hume, Prinz certainly\ndoesn’t buy into Hume’s verificationism. In fact, Prinz\nadopts a causal theory of content of the kind that is usually\nassociated with atomistic theories of concepts (e.g., Fodor 1998);\nthus Prinz’s theory of intentional content doesn’t require\na concept to inherit the specifically perceptual content of its\nconstituents. Nonetheless, Prinz thinks that every concept derives\nfrom perceptual representations. Perhaps the best way to understand\nthe claim is that the mental representations that are activated when\nsomeone thinks about something—no matter what the\nthought—are representations that originate in neural circuits\nwith perceptual or motor functions and that the mental process is\naffected by that origin. Suppose, for example, that one is thinking\nabout a hammer. Then she is either activating representations that\ninhere in visual circuits, or representations involved in circuits\nthat control hand shape, etc., and her thought is affected in some way\nby the primary function of these circuits. Following Lawrence Barsalou\n(1999; see also Barsalou et al. 2003), Prinz characterizes concept\npossession as a kind of simulation “tantamount to entering a\nperceptual state of the kind one would be in if one were to experience\nthe thing it represents” (Prinz 2002, p. 150).\n\nOne challenge to this view of cognition is its implication for\nabstract concepts. It’s one thing to say that the concept HAMMER\ninvolves the activation of circuits related to hand shape; it’s\nquite another to identify representations tied to a particular sensory\nmodality underlying such concepts as TRUTH, DEMOCRACY, ENTROPY, and\nNINETEEN (Adams & Campbell 1999, Brewer 1999). Logical concepts\nare also a challenge. Prinz suggests as a perceptual basis for the\nconcept of disjunction that it is based on feelings of hesitation.\nHowever, his more considered view seems to be that logical concepts\nare best understood as operations, not representations. The resulting\ntheory is one in which thoughts lack logical form. The trouble is that\nthis makes it difficult to see how to distinguish logically equivalent\nthoughts. A related problem is that, since composition for Prinz does\nnot yield structurally complex representations, there seems to be\nnothing to distinguish the type of contents associated with judgements\n(propositional contents) from those associated lists or even single\nconcepts (for related discussion Fodor 2003). Finally, there are\ndifficulties regarding how to interpret behavioral and neurological\nevidence that is supposed to support Prinz and Barsalou’s case\nagainst amodal representations. For example, Machery (2007) points out\nthat proponents of amodal representations typically suppose that\nimagery is useful in solving certain types of problems. So to argue\nagainst amodal representations, it is not enough to show that sensory\nrepresentations show up in a task in which experimental subjects are\nnot explicitly told to visualize a solution, since the use of\nsensory-based imagery in a task is perfectly compatible with there\nalso being amodal representations in play. (For further critical\ndiscussion of the form of empiricism that is opposed to amodal\nrepresentations, see Weiskopf 2007, Dove 2009, and Mahon 2015).\n3.3 Nativism about concepts\n\nPerhaps the most influential discussion of concepts in relation to the\nnativism/empiricism debate is Jerry Fodor’s (1975, 1981)\nargument for the claim that virtually all lexical concepts are innate.\nFodor (1975) argued that there are theoretical problems with all\nmodels of concept learning in that all such models treat concept\nlearning as hypothesis testing. The problem is that the correct\nhypothesis invariably employs the very concept to be learned and hence\nthe concept has to be available to a learner prior to the learning\ntaking place. In his (1981), Fodor developed this argument by allowing\nthat complex concepts (and only complex concepts) can be learned in\nthat they can be assembled from their constituents during the learning\nprocess. He went on to argue that lexical concepts lack semantic\nstructure and consequently that virtually all lexical concepts must be\ninnate—a position known as radical concept nativism.\nFodor’s arguments have had a great deal of influence on debates\nabout nativism and concept learning, especially amongst cognitive\nscientists. Few if any have endorsed Fodor’s radical\nconclusions, but many have shaped their views of cognitive development\nat least in part in response to Fodor’s arguments (Jackendoff\n1989, Levin & Pinker 1991, Spelke & Tsivkin 2001, Carey 2009).\nAnd Fodor has convinced many that primitive concepts are in principle\nunlearnable (see, e.g., Pinker 2007). Fodor’s arguments for this\nconclusion, however, can be challenged in a number of ways. The most\ndirect way to challenge it is to construct an account of what it is to\nlearn a primitive concept and to show that it is immune to\nFodor’s challenges (Margolis 1998, Laurence & Margolis 2002,\nCarey 2009).\n\nFodor himself changed his view about these issues when he revisited\nthem in Fodor (2008). He now maintains that while considerations about\nthe need for hypothesis testing show that no concepts can be learned,\nnot even complex concepts, this does not require concepts to be innate\n(Fodor 2008). Instead, Fodor suggests that they are largely acquired\nvia processes that are merely biological in that they don’t\nadmit of a psychological-level description. Though such a\n“biological” account of concept acquisition does offer an\nalternative to the innate/learned dichotomy, there are reasons for\nsupposing that many concepts are learned all the same (Margolis &\nLaurence 2011). These include the fact that a person’s\nconceptual system is highly sensitive to the surrounding culture. For\nexample, the concept PURGATORY comes from cultural products such as\nbooks, stories, and sermons. But clearly these can only succeed in\nconveying the concept when mediated by the right sort of psychological\nprocesses. Acquiring such concepts is a cognitive-level achievement,\nnot a merely biological one.\n\nAlthough much of the philosophical discussion of concept nativism has\nfocused on Fodor’s radical concept nativism, it is important to\nnote that other less radical approaches to the origins of concepts\nexist and that these other approaches embrace a fair amount of\nlearning—they just hold that much of this learning is structured\nby innate special-purpose acquisition systems (for example, Gallistel\n1990, Keil 1989, Spelke & Newport 1998, Baillargeon 2008, Carey 2009,\nMargolis & Laurence 2013, Tooby & Cosmides 2016).\n\nOne further issue concerning innate concepts that is in dispute is\nwhether the very idea of innateness makes sense. A common point among\nthose who are skeptical of the notion is the observation that all\ntraits are dependent upon interactions between genes and the\nenvironment and that there is no way to fully untangle the two (Elman\net al. 1996, Griffiths 2002; see also Clark 1998 and Marcus 2004, and\nthe entry on the\n distinction between innate and acquired characteristics).\n Nonetheless, there are clear differences between models of the mind\nwith empiricist leanings and models of the mind with nativist\nleanings, and the notion of innateness may be thought to earn its\nusefulness by marking these differences (Margolis & Laurence\n(2013). For discussion of different proposals of what innateness is\nsee Ariew (1999), Cowie (1999), Samuels (2002), Mallon & Weinberg\n(2006), Mameli (2008) and Khalidi (2015).\n4. Concepts and natural language\n\nWe turn now to the issue of how concepts and thoughts relate to\nlanguage.\n4.1 Can there be concepts without language?\n\nSome philosophers maintain that possession of natural language is\nnecessary for having any concepts (Brandom 1994, Davidson 1975,\nDummett 1993) and that the tight connection between the two can be\nestablished on a priori grounds. In a well known passage, Donald\nDavidson summarizes his position as follows:\n\nWe have the idea of belief only from the role of belief in the\ninterpretation of language, for as a private attitude it is not\nintelligible except as an adjustment to the public norm provided by\nlanguage. It follows that a creature must be a member of a speech\ncommunity if it is to have the concept of belief. And given the\ndependence of other attitudes on belief, we can say more generally\nthat only a creature that can interpret speech can have the concept of\na thought.\n\n\nCan a creature have a belief if it does not have the concept of\nbelief? It seems to me it cannot, and for this reason. Someone cannot\nhave a belief unless he understands the possibility of being mistaken,\nand this requires grasping the contrast between truth and\nerror—true belief and false belief. But this contrast, I have\nargued, can emerge only in the context of interpretation, which alone\nforces us to the idea of an objective, public truth. (Davidson 1975,\np. 170).\n\n\nThe argument links having beliefs and concepts with having the concept\nof belief. Since Davidson thinks that non-linguistic creatures\ncan’t have the concept of belief, they can’t have other\nconcepts as well. Why the concept of belief is needed to have other\nconcepts is somewhat obscure in Davidson’s writings (Carruthers\n1992). And whether language is necessary for this particular concept\nis not obvious. In fact, there is an ongoing research program in\ncognitive science that addresses this very issue. A variety of\nnon-linguistic tasks have been given to animals and infants to\ndetermine the extent to which they are able to attribute mental states\nto others (see Andrews & Beck 2018 for work on animals and\nBaillargeon et al. 2015 for work on infants). These and related\nstudies provide strong evidence that at least some aspects of theory\nof mind are nonlinguistic.\n\nDavidson offers a pair of supplementary arguments that may elucidate\nwhy he is hesitant to turn the issue over to the cognitive scientists.\nHe gives the example of a man engaging in a non-linguistic task where\nthe man indicates his answer by making a choice, for example,\nselecting an apple over a pear. Davidson comments that until the man\nactually says what he has in mind, there will always be a question\nabout the conceptualization guiding his choice. “Repeated tests\nmay make some readings of his actions more plausible than others, but\nthe problem will remain how to determine when he judges two objects of\nchoice to be identical” (1975, p. 163). The second argument\npoints to the difficulties of settling upon a specification of what a\nnon-linguistic creature is thinking. “The dog, we say, knows\nthat its master is home. But does it know that Mr. Smith (who is the\nmaster) is home? We have no real idea how to settle, or make sense of,\nthese questions” (1975, p, 163). It’s not clear how\nseriously Davidson himself takes these arguments. Many philosophers\nhave been unconvinced. Notice that both arguments turn on an\nunderdetermination claim—e.g., that the interpretation of the\nman’s action is underdetermined by the non-linguistic evidence.\nBut much the same thing is true even if we add what the man says (or\nto be more precise, if we add what the man utters). The linguistic\nevidence doesn’t guarantee a correct interpretation any more\nthan the non-linguistic evidence does.\n\nDavidson appears to be employing a very high standard for attributing\nconcepts to animals. In effect, he is asking for proof that our\nattributions are correct. In contrast, most philosophers who are happy\nto attribute concepts to animals do so because of a wealth of data\nthat are best explained by appealing to an internal system of\nrepresentation (e.g., Bermudez 2003, Carruthers 2006, Camp 2009; for\noverviews within cognitive science, see Gallistel 1990, Bekoff, Allen,\n& Burghardt 2002, and Shettleworth 2010). For example, many\nspecies of birds cache food for later retrieval. Their very survival\ndepends upon their ability to successfully recover, in some cases,\nmore than 10,000 different caches in a single season. Researchers\nstudying one species of caching birds have shown that not only do the\nbirds represent the location of the food, but they integrate this\ninformation with information about the quality of the food, its\nperishability, and whether their caching was observed by other birds.\nEvidence here comes from demonstrations of selective retrieval and\nrecaching of food items under experimentally controlled conditions.\nBirds will retrieve more perishable items first. When highly valued\nfood items become highly perishable, they shift strategies to retrieve\na higher percentage of less perishable food items. And birds that have\nthemselves stolen food from other birds will selectively recache\nstored food when they are observed caching it (see Clayton, Bussey,\n& Dickinson 2003, Emery, Dally, & Clayton 2004). Experimental\ndata of this kind provide evidence for particular concepts in birds\n(of food types, locations, and so on) as well as surprisingly\nsophisticated cognitive operations that make use of them.\n\nThere is a great deal of controversy among philosophers about the\nimplications of this type of research. Proponents of RTM are, of\ncourse, entirely happy with the idea that the scientific theories of\nwhat birds are doing can be taken at face value. Other philosophers\nmaintain that if the scientific theories say that birds are computing\nan algorithm for determining a caching strategy, then this can only be\nread as a façon de parler. Still others will grant that animals\nhave representations but go on to claim that these representation are\nof a lesser status, not to be confused with concepts (Brandom 1994,\n2000, McDowell 1994).\n\nThis raises an interesting question about whether there is a motivated\nand principled difference between concepts in humans and mere\nrepresentations in animals (Laurence & Margolis 2012).\nPhilosophers who maintain that there is such a difference often cite\nthe role of concepts in reasoning. For example, Robert Brandom claims\nthat representations in animals do little more than act as reliable\nmechanisms of discrimination. These representations are supposed to be\nlike thermometers, responding to specific environmental features yet\nwithout entering into appropriate inferential processes. However,\nit’s not clear what counts as an appropriate inferential\nprocess, and certainly there is room for differing opinions on this\npoint. Moreover, whatever reasoning amounts to, comparative psychology\nis replete with examples that suggest that animals are capable of far\nmore than reliable detection. Animals may not be as smart as humans,\nbut that doesn’t mean they are as dumb as thermometers (see\nHurley & Nudds 2006 and Carruthers 2006 on reasoning in\nanimals).\n4.2 The priority between language and concepts\n\nEven if it’s agreed that it is possible to have concepts in the\nabsence of language, there is a dispute about how the two are related.\nSome maintain that concepts are prior to and independent of natural\nlanguage, and that natural language is just a means for conveying\nthought (Fodor 1975, Pinker 1994). Others maintain that at least some\ntypes of thinking (and hence some concepts) occur in the internal\nsystem of representation constituting our natural language competence\n(Carruthers 1996, 2002, Spelke 2003) or that natural language augments\nour concepts in significant ways (Lupyan 2012).\n\nThe arguments for deciding between these two positions involve a\nmixture of theoretical and empirical considerations. Proponents of the\nfirst view have claimed that language is ambiguous in ways that\nthought presumably is not. For example, the natural language sentence\neveryone loves someone could be interpreted to mean that for\neach person, there is some person that they love, or to mean that\neveryone loves one and the same person (Pinker 1994). Proponents of\nthe first view have also argued that since language itself has to be\nlearned, thought is prior to language (Fodor 1975; Pinker 1994). A\nthird and similar consideration is that people seem to be able\nformulate novel concepts which are given a linguistic label later; the\nconcept comes first, the linguistic label second (Pinker 1994).\n\nProponents of the alternative view—that some thinking occurs in\nlanguage—have pointed to the phenomenology of thought. It\ncertainly seems as if we are thinking in language when we\n“hear” ourselves silently talking to ourselves (Carruthers\n1996; see also Langland-Hassan & Vicente 2018 on the nature and\nsignificance of inner speech). Another type of consideration that\nproponents of this view highlight is the finding that success on\ncertain tasks (e.g., spatial reorientation that relies on combining\nlandmark information with geometrical information) is selectively\nimpaired when the linguistic system is engaged but not when comparable\nattention is given to non-linguistic distractors. The suggestion is\nthat solving these tasks requires thinking in one’s natural\nlanguage and that some of the crucial concepts must be couched\nlinguistically (Hermer-Vazquez, Spelke, & Katsnelson 2001;\nShusterman & Spelke 2005; Carruthers 2002; see also Gleitman &\nPapafragou 2012 for a critical overview of a range of tasks where\nonline processing has been thought to rely on linguistic\nrepresentation).\n4.3 Linguistic determinism and linguistic relativity\n\nFinally, one further issue that bears mentioning is the status of\nvarious claims regarding linguistic determinism and linguistic\nrelativity. Linguistic determinism is the doctrine that the\nlanguage a person speaks both causes her to conceptualize the world in\ncertain ways and limits what she can think about by imposing\nboundaries on her conceptual system; as a result, people who speak\nvery different languages are likely to conceptualize the world in\ncorrespondingly different ways. Linguistic relativity is the\nweaker doctrine that the language one speaks influences how one\nthinks.\n\nLinguistic determinism is historically associated with the writings of\nBenjamin Lee Whorf (Whorf 1956). Whorf was especially interested in\nthe languages of the indigenous people of America. He famously argued\nthat the Hopi both speak and think about time in ways that are\nincongruent with European languages and thought. Rather than viewing\ntime as a continuum that flows evenly throughout the universe and that\ncan be broken up into countable events occurring in the past, present,\nand future, the Hopi are supposed to focus on change as a process.\nTheir conceptual system is also supposed to differ from ours in that\nit embodies a distinction between things that are or have been\naccessible to perception versus things that are not, where the latter\ncategory includes things in the future as well as mythical and mental\nconstructs.\n\nThe claim that the Hopi lack our concept of time has not stood up to\nscrutiny. Whorf used clumsy translations of Hopi speech that concealed\nthe extent to which they talk about time (references to yesterday,\ntomorrow, days of the week, lunar phases, etc.). More interestingly,\nWhorf provided no direct evidence of how the Hopi think. Instead, he\nused the circular reasoning that they don’t think about\ntime as we do because they don’t talk about time as we\ndo. In fact, the Hopi use numerous familiar devices for time keeping,\nsuch as calendar strings and sun dials, and their sensitivity to time\nis evident a wide variety of cultural practices (Pinker 1994).\n\nLinguistic determinism isn’t an especially promising doctrine\nand has few adherents these days, but linguistic relativity is the\nsubject of a spirited debate (see Gumperz & Levinson 1996,\nBowerman & Levinson 2001, and Gentner & Goldin-Meadow 2003).\nSome recent examples of particular interest include whether language\ninfluences how we conceptualize spatial frames of reference (in\nnon-linguistic spatial reasoning) (e.g., Li & Gleitman 2002,\nLevinson et al. 2002, Levinson 2003, Li et al. 2011), spatial\nrelations (in non-linguistic reasoning) (e.g., Choi & Bowerman\n1991, Hespos & Spelke 2004), sex (the impact of grammatical\ngender) (e.g., Boroditsky, Schmidt, & Phillips 2003) and number\n(e.g., Gordon 2004, Pica et al. 2004, Laurence & Margolis\n2007).\n5. Concepts and conceptual analysis\n\nSome of the deepest divides in contemporary philosophy concern the\nlimits of empirical inquiry, the status of conceptual analysis, and\nthe nature of philosophy itself (see, e.g., Chalmers 1996, Jackson\n1998, DePaul & Ramsey 1998, Block & Stalnaker 1999, Williamson\n2007, Stich 2012, Machery 2017, Strevens 2018). And concepts are right\nat the center of these disputes. For many, philosophy is essentially\nthe a priori analysis of concepts, which can and should be done\nwithout leaving the proverbial armchair. We’ve already seen that\nin the paradigm case, an analysis embodies a definition; it specifies\na set of conditions that are individually necessary and jointly\nsufficient for the application of the concept. For proponents of\ntraditional conceptual analysis, the analysis of a concept is\nsuccessful to the extent that the proposed definition matches\npeople’s intuitions about particular cases, including\nhypothetical cases that figure in crucial thought experiments.\n5.1 Attractions of conceptual analysis\n\nConceptual analysis has been attractive to philosophers for a number\nof reasons. One is that it makes sense of a good deal of philosophical\npractice—what George Bealer (1998) calls the standard\njustificatory procedure. Thought experiments and the elicitation\nof intuitions are characteristic features of philosophical practice.\nIf this practice is justified, then there has to be an understanding\nof what philosophy is that explains why. Conceptual analysis is\nsupposed to provide just what’s needed here. Intuitions can be\nsaid to be of value to philosophy precisely because they help us to\nget clearer about our concepts, especially concepts of intrinsic\nphilosophical interest (JUSTICE, KNOWLEDGE, etc.).\n\nA related attraction is that conceptual analysis explains how\nphilosophy could be an a priori discipline, as many suppose it is. If\nphilosophy is primarily about concepts and concepts can be\ninvestigated from the armchair, then the a priori character of\nphilosophy is secured (Jackson 1998).\n\nA third attraction of conceptual analysis is that conceptual analysis\nhas been argued to be a necessary precursor for answering questions\nabout ontological reduction, that is, the sort of reduction that takes\nplace when it’s argued that genes are DNA segments, that\nsensations are brain states, and so on (Chalmers 1996, Jackson 1998).\nAccording to one way of filling this view out, one has to begin with\nan a priori analysis of the higher-level concept, particularly an\nanalysis that makes explicit its causal relations. One can then appeal\nto empirical findings regarding the things that actually have those\ncausal relations. For example, neuroscience may reveal that\nsuch-and-such brain state has the causal relations that analysis\nreveals to be constitutive of our concept of pain. In the course of\ndoing this, neuroscience is supposed to be showing us what pain is\n(Lewis 1966, Armstrong 1968). But neuroscience is only in a position\nto do this against the background of the philosophical work that goes\ninto articulating the concept. (For detailed treatments of this view\nof reduction, see Chalmers 1996, 2010 and Jackson 1998—though it\nshould be noted that Chalmers argues that PAIN, and other concepts of\nconscious mental states, cannot be analyzed solely in terms of their\ncausal relations and concludes from this that consciousness itself is\nirreducible.) This work has generated a great deal of debate (e.g.,\nBlock & Stalnaker 1999, Levine 2001, Laurence & Margolis 2003,\nYablo 2008, Papineau 2002).\n\nA fourth attraction is that conceptual analysis may offer normative\nguidance (Goldman 1986). For instance, epistemologists face the\nquestion of whether our inferential practices are justified and, if\nso, what justifies them. One standard answer is that they can be\njustified if they conform to our intuitions about what counts as a\njustified inference (Goldman 1986). In other words, an analysis of our\nconcept of justification is supposed to be all that is needed in order\nto establish that a set of inference rules is justified. So if it ever\nturned out that different groups of people employed qualitatively\ndifferent sets of inferential principles, we could establish the\nepistemically preferable one by showing that it does a better job of\nconforming to our concept of justification.\n5.2 Objections to conceptual analysis\n\nMany philosophers who are opposed to conceptual analysis identify\ntheir approach as being naturalistic (e.g., Devitt 1996,\nKornblith 2002, Papineau 2013; see also the entry\n naturalism).\n A common theme of this work is that philosophy is supposed to be\ncontinuous with science and that philosophical theories are to be\ndefended on largely explanatory grounds, not on the basis of a priori\narguments that appeal to intuition. Accordingly, perceived\ndifficulties with conceptual analysis provide arguments for\nnaturalism.\n\nOne such argument centers around the failures of the classical theory\nof concepts. Earlier, in\n Section 2,\n we noted that paradigmatic conceptual analyses require concepts to\nhave classical structure, an assumption that is increasingly difficult\nto maintain. For this reason, a number of philosophers have expressed\nskepticism about the viability of conceptual analysis as a\nphilosophical method (e.g., Ramsey 1998, Stich 1992). Others, however,\nhave called into question the connection between conceptual analysis\nand definitions (Chalmers & Jackson 2001).\n\nAnother objection to conceptual analysis is that the intuitions that\nphilosophers routinely rely upon may not be shared. Anyone who teaches\nphilosophy certainly knows that half the time students have the\n“wrong intuitions”. But who are we to say that they are\nwrong? And given that people disagree about their intuitions, these\ncan hardly be treated as objective data (Cummins 1998).\n\nThings become even more interesting if we branch out to other\ncultures. In a preliminary study of East Asian vs. Western intuitions,\nJonathan Weinberg, Shaun Nichols, & Stephen Stich (2001) found\nthat East Asians often have the “wrong intuitions”\nregarding variations on classic philosophical thought experiments,\nincluding Gettier-type thought experiments (though see Machery et al\n2017 for evidence that some of these intuitions may in fact be\nuniversal). At the very least, this work suggests that philosophers\nshould be cautious about moving from their own intuitions to claims\nabout the proper analysis of a concept.\n\nWhat’s more, the possibility of cultural diversity raises a\ntroubling question for philosophers who want to establish normative\nclaims on the basis of analyses of concepts, such as the concept of\njustification. Suppose, for example, that East Asian culture offers a\ndifferent concept of justification than the one that is embedded in\nWestern commonsense thought (assuming for sake of argument that there\nis a single concept of justification in each culture). In addition,\nsuppose that East Asians employ different inferential practices than\nour own and that their practices do a fair job of conforming to their\nconcept of justification and that ours do a fair job of conforming to\nour own. On what basis, then, are we to compare and evaluate these\ndiffering practices? Does it really make sense to say that ours are\nsuperior on the ground that they conform better to our\nconcept of justification? Wouldn’t this just be a form of\nepistemic prejudice? After all, the question arises whether, given the\ntwo concepts of justification, ours is the one that ought to be used\nfor performing normative epistemic evaluations (Stich 1990; for\nfurther discussion see Williamson 2005, Sosa 2009, Stich 2009,\nWeinberg, Nichols, & Stich 2001, Weinberg et al. 2010).\n\nThe critique of traditional philosophical analysis has also generated\nproposals for various types of normative, revisionary projects.\nInstead of asking which cases are or are not covered by a concept,\nthey ask how a concept should be modified or what new concept should\nbe adopted in its place, given the practical context in which the\nconcept is used—for example, given the goal of promoting social\nequality (Haslanger 2012, Cappelen 2018).\n\nMuch is at stake in the debate between conceptual analysts and\nnaturalists, and it is likely to be a central topic in the theory of\nconcepts for the foreseeable future.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Adams, F. &amp; Campbell, K. (1999). Modality and Abstract\nConcepts. <em>Behavioral and Brain Sciences</em>, 22: 610.",
                "Andrews, K. &amp; Beck, J. (2017). <em>The Routledge Handbook of\nPhilosophy of Animal Minds</em>, London: Routledge.",
                "Ariew, A. (1999). Innateness is Canalization: In Defense of a\nDevelopmental Account of Innateness, in V. Hardcastle (ed.), <em>Where\nBiology Meets Psychology: Philosophical Essays</em>, pp. 117–38.\nCambridge, MA: MIT Press.",
                "Armstrong, D. (1968). <em>A Materialist Theory of Mind</em>,\nLondon: Routledge.",
                "Atran, S. &amp; Medin, D. (2008). <em>The Native Mind and the\nCultural Construction of Nature</em>, Cambridge, MA: MIT Press.",
                "Ayer, A.J. (1959). <em>Logical Positivism</em>, New York: The Free\nPress.",
                "Baker, M. (2001). <em>The Atoms of Language: The Mind’s\nHidden Rules of Grammar</em>, New York: Basic Books.",
                "Baillargeon, R. (2008). Innate Ideas Revisited: For a Principle of\nPersistence in Infants’ Physical Reasoning. <em>Perspectives on\nPsychological Science</em>, 3 (1): 2–13.",
                "Baillargeon, R., Scott, R.M., He, Z., Sloane, S., Setoh, P., Jin,\nK.-S., Wu, D., &amp; Bian, L. (2015). Psychological and Sociomoral\nReasoning in Infancy, in M.Mikulincer &amp; P.R. Shaver (eds.),\n<em>APA Handbook of Personality and Social Psychology: Volume 1.\nAttitudes and Social Cognition</em>, Washington, DC: American\nPsychological Association, pp. 79–150.",
                "Barsalou, L. (1999). Perceptual Symbol Systems. <em>Behavioral and\nBrain Sciences</em>, 22: 577–609.",
                "Barsalou, L., Simmons, W., Barbey, A., &amp; Wilson, C. (2003).\nGrounding Conceptual Knowledge in Modality-Specific Systems.\n<em>Trends in Cognitive Science</em>, 7 (2): 84–89.",
                "Bealer, G. (1998). Intuition and the Autonomy of Philosophy, in M.\nDePaul &amp; W. Ramsey (eds.) <em>Rethinking Intuition: The Psychology\nof Intuition and Its Role in Philosophical Inquiry</em>, Lanham, MD:\nRowman &amp; Littlefield, pp. 201–239.",
                "Bekoff, M., Allen, C., &amp; Burghardt, G. (2002). <em>The\nCognitive Animal: Empirical and Theoretical Perspectives on Animal\nCognition</em>, Cambridge, MA: MIT Press.",
                "Bennett, M. &amp; Hacker, P. (2008). <em>History of Cognitive\nNeuroscience</em>, Oxford: Wiley-Blackwell.",
                "Bermudez, J. (2003). <em>Thinking Without Words</em>, Oxford:\nOxford University Press.",
                "Block, N. &amp; Stalnaker, R. (1999). Conceptual Analysis and the\nExplanatory Gap, <em>Philosophical Review</em>, 108 (1):\n1–46.",
                "Blok, S., Newman, G. &amp; Rips, L.J. (2005). Individuals and\nTheir Concepts, in W.-K. Ahn, R.L. Goldstone, B.C. Love, A.B. Markman,\n&amp; P. Wolff (eds.), <em>Categorization Inside and Outside the\nLaboratory: Essays in Honor of Douglas L. Medin</em>, Washington, DC:\nAmerican Psychological Association, pp. 127–149.",
                "Boroditsky, L., Schmidt, L., &amp; Phillips, W. (2003). Sex,\nSyntax, and Semantics, in D. Gentner &amp; S. Goldin-Meadow (eds.)\n<em>Language in Mind</em>, Cambridge, MA: MIT Press, pp.\n61–79.",
                "Bowerman, M. &amp; Levinson, S. (2001). <em>Language Acquisition\nand Conceptual Development</em>, Cambridge: Cambridge University\nPress.",
                "Brandom, R. (1994). <em>Making It Explicit: Reasoning,\nRepresenting, and Discursive Commitment</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "––– (2000). <em>Articulating Reasons: An Introduction to\nInferentialism</em>, Cambridge, MA: Harvard University Press.",
                "Brewer, W. (1999). Perceptual Symbols: The Power and Limitations\nof a Theory of Dynamic Imagery and Structured Frames, <em>Behavioral\nand Brain Sciences</em>, 22: 611–12.",
                "Camp, E. (2009). A Language of Baboon Thought?, in R.W. Lurz (ed.)\n<em>The Philosophy of Animal Minds</em>, Cambridge: Cambridge\nUniversity Press, pp. 108–127.",
                "Cappelen, H. (2018). <em>Fixing Language: An Essay on Conceptual\nEngineering</em>, Oxford: Oxford University Press.",
                "Carey, S. (1985). <em>Conceptual Change in Childhood</em>,\nCambridge, MA: MIT Press.",
                "––– (2009). <em>The Origin of Concepts</em>, Oxford: Oxford\nUniversity Press.",
                "Carruthers, P. (1992). <em>The Animals Issue: Moral Theory in\nPractice</em>, Cambridge: Cambridge University Press.",
                "––– (1996). <em>Language, Thought, and\nConsciousness</em>, Cambridge: Cambridge University Press.",
                "––– (2002). The Cognitive Functions of Language,\n<em>Behavioral and Brain Sciences</em>, 25: 657–74.",
                "––– (2006). <em>The Architecture of the Mind: Massive\nModularity and the Flexibility of Thought</em>, New York: Oxford\nUniversity Press.",
                "Carruthers, P., Laurence, S., &amp; Stich, S. (2005). <em>The\nInnate Mind: Structure and Contents</em>, Oxford: Oxford University\nPress.",
                "––– (2006). <em>The\nInnate Mind: Culture and Cognition</em>, Oxford: Oxford University\nPress.",
                "––– (2007). <em>The Innate Mind: Foundations and\nthe Future</em>, Oxford: Oxford University Press.",
                "Chalmers, D. (1996). <em>The Conscious Mind: In Search of a\nFundamental Theory</em>, Oxford: Oxford University Press.",
                "––– (2010). <em>The Character of Consciousness</em>,\nOxford: Oxford University Press.",
                "Chalmers, D. &amp; Jackson, F. (2001). Conceptual Analysis and\nReductive Explanation, <em>Philosophical Review</em>, 110:\n315–61.",
                "Choi, S. &amp; Bowerman, M. (1991). Learning to Express Motion\nEvents in English and Korean: The Influence of Language-Specific\nLexicalization Patterns, <em>Cognition</em>, 41: 83–121.",
                "Chomsky, N. (1967). Recent Contributions to the Theory of Innate\nIdeas, <em>Synthese</em>, 17: 2–11. Reprinted in S. Stich (ed.)\n<em>Innate Ideas</em>, Berkeley: University of California Press, pp.\n121–31.",
                "––– (1975). <em>Reflections on Language</em>, New York:\nPantheon.",
                "––– (1980). <em>Rules and Representations</em>, New York:\nColumbia University Press.",
                "––– (1988). <em>Language and the Problems of Knowledge:\nThe Managua Lectures</em>, Cambridge, MA: MIT Press.",
                "Churchland, P. (1981). Eliminative Materialism and Propositional\nAttitudes, <em>Journal of Philosophy</em>, 78 (2): 67–90.",
                "Clark, A. (1993). <em>Associative Engines: Connectionism,\nConcepts, and Representational Change</em>, Cambridge, MA: MIT\nPress.",
                "––– (1998). Twisted Tales: Causal Complexity and Cognitive\nScientific Explanation, <em>Minds and Machines</em>, 8:\n76–99.",
                "Clayton, N., Bussey, T., &amp; Dickinson, A. (2003). Can Animals\nRecall the Past and Plan for the Future? <em>Nature Reviews:\nNeuroscience</em>, 4: 685–91",
                "Cowie, F. (1999). <em>What’s Within: Nativism\nReconsidered</em>, Oxford: Oxford University Press.",
                "Crain, S. &amp; Pietroski, P. (2001). Nature, Nurture, and\nUniversal Grammar, <em>Linguistics and Philosophy</em>, 24:\n139–186.",
                "Crane, T. (2015). <em>The Mechanical Mind, Third Edition</em>,\nLondon: Routledge.",
                "Cummins, R. (1998). Reflection on Reflective Equilibrium, in M.\nDePaul &amp; W. Ramsey (eds.), <em>Rethinking Intuition: The\nPsychology of Intuition and Its Role in Philosophical Inquiry</em>,\nLanham, MD: Rowman &amp; Littlefield, pp. 113–27.",
                "Davidson, D. (1975). Thought and Talk. In his <em>Inquiries into\nTruth and Interpretation</em>, Oxford: Oxford University Press.",
                "Del Pinal, G. (2016). Prototypes as Compositional Components of\nConcepts, <em>Synthese</em>, 193 (9): 2899–2927.",
                "Dennett, D. (1977). A Cure for the Common Code. Reprinted in D.\nDennett (1978) <em>Brainstorms</em>, Cambridge, MA: MIT Press.",
                "––– (1978). <em>Brainstorms: Philosophical\nEssays on Mind and Psychology</em>, Cambridge, MA: MIT Press.",
                "––– (1987). <em>The Intentional Stance</em>, Cambridge,\nMA: MIT Press.",
                "––– (1991). <em>Consciousness Explained</em>, Boston:\nLittle, Brown and Company.",
                "DePaul, M. &amp; Ramsey, W. (1998). <em>Rethinking Intuition: The\nPsychology of Intuition and Its Role in Philosophical Inquiry</em>,\nLanham, MD: Rowman &amp; Littlefield.",
                "Devitt, M. (1981). <em>Designation</em>, New York: Columbia\nUniversity Press.",
                "––– (1996). <em>Coming to Our Senses: A Naturalistic\nProgram for Semantic Localism</em>, Cambridge: Cambridge University\nPress.",
                "Dove, G. (2009). Beyond Perceptual Symbols: A Call for\nRepresentational Pluralism, <em>Cognition</em>, 110:\n412–431.",
                "Dummett, M. (1993). <em>Seas of Language</em>, Oxford: Oxford\nUniversity Press.",
                "Elman, J., Bates, E., Johnson, M., Karmiloff-Smith, A., Parisi,\nD., and Plunkett, K. (1996). <em>Rethinking Innateness: A\nConnectionist Perspective on Development</em>, Cambridge, MA: MIT\nPress.",
                "Emery, N., Dally, J., &amp; Clayton, N. (2004). Western Scrub-Jays\n(<em>Aphelocoma Californica</em>) Use Cognitive Strategies to Protect\nTheir Caches from Thieving Conspecifics, <em>Animal Cognition</em>, 7:\n37–43.",
                "Fodor, J. (1968). The Appeal to Tacit Knowledge, <em>Journal of\nPhilosophy</em>, 65 (20): 627–640.",
                "––– (1975). <em>The Language of Thought</em>, Cambridge, MA:\nHarvard University Press.",
                "––– (1981). The Present Status of the Innateness\nControversy. In his <em>Representations: Philosophical Essays on the\nFoundations of Cognitive Science</em>, Cambridge, MA: MIT Press.",
                "––– (1987). <em>Psychosemantics: The Problem of Meaning in\nthe Philosophy of Mind</em>, Cambridge, MA: MIT Press.",
                "––– (1998). <em>Concepts: Where Cognitive Science Went\nWrong</em>, New York: Oxford University Press.",
                "––– (2003). <em>Hume Variations</em>, Oxford: Oxford\nUniversity Press.",
                "––– (2008). <em>LOT 2: The Language of Thought\nRevisited</em>, New York: Oxford University Press.",
                "Fodor, J. &amp; Lepore, E. (1992). <em>Holism: A Shopper’s\nGuide</em>, Oxford: Blackwell.",
                "––– (1996). The Red Herring and the Pet\nFish: Why Concepts Still Can’t Be Prototypes,\n<em>Cognition</em>, 58: 253–270.",
                "Fodor, J. &amp; Pylyshyn, Z. (1988). Connectionism and Cognitive\nArchitecture: A Critical Analysis, <em>Cognition</em>, 28:\n3–71.",
                "Gallistel, C.R. &amp; King, A. (2009). <em>Memory and the\nComputational Brain: Why Cognitive Science Will Transform\nNeuroscience</em>, Oxford: Wiley-Blackwell.",
                "––– (1990). <em>The Organization of Learning</em>,\nCambridge, MA: MIT Press.",
                "Gelman, S. (2003). <em>The Essential Child: Origins of\nEssentialism in Everyday Thought</em>, Oxford: Oxford University\nPress.",
                "Genone, E. (1963). Theories of Reference and Experimental\nPhilosophy. <em>Philosophy Compass</em>, 7 (2): 152–163.",
                "Gentner, D. &amp; Goldin-Meadow, S. (2003). <em>Language in\nMind</em>, Cambridge, MA: MIT Press.",
                "Gettier, E. (1963). Is Justified True Belief Knowledge?\n<em>Analysis</em>, 23: 121–123.",
                "Gleitman, L. &amp; Papafragou, A. (2012). New Perspectives on\nLanguage and Thought, in K. Holyoak &amp; R. Morrison (eds.),\n<em>Oxford Handbook of Thinking and Reasoning</em>, Oxford: Oxford\nUniversity Press, pp. 543–568.",
                "Goldman, A. (1986). <em>Epistemology and Cognition</em>,\nCambridge, MA: MIT Press.",
                "Gonnerman, C. &amp; Weinberg, J. (2010). Two Uneliminated Uses for\n‘Concepts’: Hybrids and Guides for Inquiry, <i>Behavioral\nand Brain Sciences</i>, 33: 211–212",
                "Goodman, N. (1969). The Emporer’s New Ideas, in S. Hook\n(<em>ed.</em>), <em>Language and Philosophy</em>, New York: NYU Press,\npp. 138–42.",
                "Gopnik, A., &amp; Meltzoff, A. (1997). <em>Words, Thoughts, and\nTheories</em>, Cambridge, MA: MIT Press.",
                "Gordon, P. (2004). Numerical Cognition Without Words: Evidence\nfrom Amazonia, <em>Science</em>, 306: 496–499.",
                "Griffiths, P. (2002). What Is Innateness? <em>Monist</em>, 85 (1):\n70–85.",
                "Gumperz, J. &amp; Levinson, S. (1996). <em>Rethinking Linguistic\nRelativity</em>, Cambridge: Cambridge University Press.",
                "Hampton, J. (2006). Concepts as Prototypes, in B.H. Ross (ed.),\n<i>Psychology of Learning and Motivation</i> (Volume 46), New York:\nAcademic Press, pp. 79–113",
                "––– (2010). Concept Talk Cannot Be Avoided, <i>Behavioral\nand Brain Sciences</i>, 33: 212–213",
                "Hampton, J. &amp; Jönsson, M. (2012). Typicality and\nCompositionality: The Logic of Combining Vague Concepts, in M.\nWerning, W. Hintzen, &amp; E. Machery (eds.), <em>Oxford Handbook of\nCompositionality.</em> Oxford: Oxford University Press.",
                "Haslanger, S. (2012). <em>Resisting Reality: Social Construction\nand Social Critique</em>, Oxford: Oxford University Press.",
                "Hermer-Vazquez, L., Spelke, E., &amp; Katsnelson, A. (2001).\nSources of Flexibility in Human Cognition: Dual-Task Studies of Space\nand Language, <em>Cognitive Psychology</em>, 39: 3–36.",
                "Hespos, S. &amp; Spelke, E. (2004). Conceptual Precursors to\nLanguage, <em>Nature</em>, 430: 453–456.",
                "Hume, D. (1739/1978). <em>A Treatise of Human Nature</em>, Oxford:\nOxford University Press.",
                "––– (1748/1975). <em>Enquiries Concerning Human Understanding\nand Concerning the Principles of Morals</em>, Oxford: Oxford\nUniversity Press.",
                "Hurley, S. &amp; Nudds, M. (2006) <em>Rational Animals?</em>,\nOxford: Oxford University Press.",
                "Jackendoff, R. (1989). What is a Concept, that a Person May Grasp\nIt? <em>Mind &amp; Language</em>, 4: 68–102.",
                "Jackson, F. (1998). <em>From Metaphysics to Ethics: A Defense of\nConceptual Analysis</em>, Oxford: Oxford University Press.",
                "Johnson, S.P. (2010). <em>Neuroconstructivism: The New Science of\nCognitive Development</em>, Oxford: Oxford University Press.",
                "Keil, F. (1989). <em>Concepts, Kinds, and Cognitive\nDevelopment</em>, Cambridge, MA: MIT Press.",
                "Kenny, A. (2010). Concepts, Brains, and Behaviour, <em>Grazer\nPhilosophische Studien</em>, 81 (1): 105–113.",
                "Khalidi, M.A. (2015). Innateness as a Natural Cognitive Kind,\n<em>Philosophical Psychology</em>, 29 (3): 319–333.",
                "Kornblith, H. (2002). <em>Knowledge and Its Place in Nature</em>,\nOxford: Oxford University Press.",
                "Kripke, S. (1972/1980). <em>Naming and Necessity</em>, Cambridge,\nMA: Harvard University Press.",
                "Lalumera, E. (2010). Concepts are a Functional Kind, <i>Behavioral\nand Brain Sciences</i>, 33: 217–218",
                "Landau, B. (1982). Will the Real Grandmother Please Stand Up? The\nPsychological Reality of Dual Meaning Representations, <em>Journal of\nPsycholinguistic Research</em>, 11 (1): 47–62.",
                "Langland-Hassan, P. &amp; Vicente, A. (2018). <em>Inner Speech:\nNew Voices</em>, Oxford: Oxford University Press.",
                "Laurence, S. &amp; Margolis, E. (1997). Regress Arguments Against\nthe Language of Thought, <em>Analysis</em>, 57: 60–66.",
                "––– (1999). Concepts and Cognitive\nScience, in E. Margolis &amp; S. Laurence (eds.), <em>Concepts: Core\nReadings</em>, Cambridge, MA: MIT Press, pp. 3–81.",
                "––– (2001). The Poverty of the\nStimulus Argument, <em>British Journal for the Philosophy of\nScience</em>, 52: 217–76.",
                "––– (2002). Radical Concept Nativism,\n<em>Cognition</em>, 86: 25–55.",
                "––– (2007). Linguistic Determinism and\nthe Innate Basis of Number, in P. Carruthers, S. Laurence, &amp; S.\nStich (eds.), <em>The Innate Mind: Foundations and the Future</em>,\nNew York: Oxford University Press, pp. 139–169.",
                "––– (2012). The Scope of the\nConceptual, in E. Margolis, R. Samuels, &amp; S. Stich (eds.), <em>The\nOxford Handbook of Philosophy of Cognitive Science</em>, New York:\nOxford University Press, pp. 291–317.",
                "Levin, B. &amp; Pinker, S. (1991). Introduction, in B. Levin &amp;\nS. Pinker (eds.), <em>Lexical and Conceptual Semantics</em>, Oxford:\nBlackwell.",
                "Levine, J. (2001). <em>Purple Haze: The Puzzle of\nConsciousness</em>, Oxford: Oxford University Press.",
                "––– (2010). Demonstrative Thought. <em>Mind &amp;\nLanguage</em>, 25 (2): 169–195.",
                "Levinson, S. (2003). <em>Space in Language and Cognition:\nExplorations in Cognitive Diversity</em>, Cambridge: Cambridge\nUniversity Press.",
                "Levinson, S., Kita, S., Haun, D., &amp; Rasch, B. (2002).\nReturning the Tables: Language Affects Spatial Reasoning,\n<em>Cognition</em>, 84: 155–188.",
                "Lewis, D. (1966). An Argument for the Identity Theory, <em>Journal\nof Philosophy</em>, 63 (1): 17–25.",
                "Li, P. &amp; Gleitman, L. (2002). Turning the Tables: Language and\nSpatial Reasoning, <em>Cognition</em>, 83: 265–294.",
                "Li, P., Abarbanell, L., Gleitman, L. &amp; Papafragou, A. (2011).\nSpatial Reasoning in Tenejapan Mayans, <em>Cognition</em>, 120 (1):\n33–53.",
                "Locke, J. (1690/1975). <em>An Essay Concerning Human\nUnderstanding</em>, New York: Oxford University Press.",
                "Lupyan, G. (2012). What Do Words Do? Toward a Theory of\nLanguage-Augmented Thought, in B.H. Ross (ed.), <i>Psychology of\nLearning and Motivation</i> (Volume 57), New York: Academic Press, pp.\n155–297",
                "Machery, E. (2007). Concept Empiricism: A Methodological Critique,\n<em>Cognition</em>, 104: 19–46.",
                "––– (2009). <em>Doing Without Concepts</em>, New York:\nOxford University Press.",
                "––– (2010). Precis of <em>Doing Without Concepts</em>,\n<em>Behavioral and Brain Sciences</em>, 33: 195–244.",
                "––– (2017). <em>Philosophy within Its Proper Bounds</em>,\nOxford: Oxford University Press.",
                "Machery, E., Mallon, R., Nichols, S. &amp; Stich, S. (2004).\nSemantics, Cross-Cultural Style, <em>Cognition</em>, 92: B1–B12.",
                "Machery, E., Stich, S., Rose, D., Chatterjee, A., Karasawa, K.,\nStruchiner, N., Sirker, S., Usui, N., &amp; Hashimoto, T. (2017).\nGettier Across Cultures. <em>Noûs</em>, 51 (3):\n645–664.",
                "Mahon, B.Z. (2015). What is Embodied about Cognition?\n<em>Language, Cognition, and Neuroscience</em>, 30 (4):\n420–429.",
                "Mallon, R. &amp; Weinberg, J. (2006). Innateness as Closed Process\nInvariance, <em>Philosophy of Science</em>, 73 (3):\n323–344.",
                "Mameli, M. (2008). On Innateness: The Clutter Hypothesis and the\nCluster Hypothesis. <em>The Journal of Philosophy</em>, 105 (12):\n719–736.",
                "Manfredi, P. (1993). Tacit Beliefs and Other Doxastic Attitudes.\n<em>Philosophia</em>, 22 (1): 95–117.",
                "Marcus, G. (2001). <em>The Algebraic Mind: Integrating\nConnectionism and Cognitive Science</em>, Cambridge, MA: MIT\nPress.",
                "––– (2004). <em>The Birth of the Mind: How a Tiny Number of\nGenes Creates the Complexities of Human Thought</em>, New York: Basic\nBooks.",
                "Margolis, E. (1998). How to Acquire a Concept, <em>Mind &amp;\nLanguage</em>, 13: 347–369.",
                "Margolis, E. &amp; Laurence, S. (1999). <em>Concepts: Core\nReadings</em>, Cambridge, MA: MIT Press.",
                "––– (2007). The Ontology of Concepts\n— Abstract Objects or Mental Representations?\n<em>Noûs</em>, 41 (4): 561–593.",
                "––– (2010). Concepts and Theoretical\nUnification, <i>Behavioral and Brain Sciences</i>, 33:\n219–220.",
                "––– (2011). Learning Matters: The Role\nof Learning in Concept Acquisition, <em>Mind &amp; Language</em>, 26\n(5): 507–539.",
                "––– (2013). In Defense of Nativism,\n<i>Philosophical Studies</i>, 165 (2): 693–718.",
                "––– (2015). <em>The Conceptual Mind:\nNew Directions in the Study of Concepts</em>, Cambridge, MA: MIT\nPress.",
                "McClelland, J., Botvinick, M., Noelle, D., Plaut, D., Rogers, T.,\nSeidenberg, M., &amp; Smith, L. (2010). Letting Structure Emerge:\nConnectionist and Dynamic Systems Approaches to Cognition, <em>Trends\nin Cognitive Sciences</em>, 14: 348–56.",
                "McDowell, J. (1994). <em>Mind and World</em>, Cambridge, MA:\nHarvard University Press.",
                "Millikan, R. (2000). <em>On Clear and Confused Ideas</em>,\nCambridge: Cambridge University Press.",
                "Murphy, G. (2002). <em>The Big Book of Concepts</em>, Cambridge,\nMA: MIT Press.",
                "Osherson, D., &amp; Smith, E. (1981). On the Adequacy of Prototype\nTheory as a Theory of Concepts, <em>Cognition</em>, 9:\n35–58.",
                "Papineau, D. (2002). <em>Thinking About Consciousness</em>,\nOxford: Oxford University Press.",
                "––– (2013). The Poverty of Conceptual Analysis,\nin M.  Haug (ed.),<i>The Armchair or the Laboratory?</i>, New York:\nRoutledge, pp. 166–194",
                "Peacocke, C. (1992). <em>A Study of Concepts</em>, Cambridge, MA:\nMIT Press.",
                "––– (2005). Rationale and Maxims in the Study of\nConcepts, <em>Noûs</em>, 39 (1): 167–78.",
                "Pica, P., Lemer, C., Izard, V., &amp; Dehaene, S. (2004). Exact\nand Approximate Arithmetic in an Amazonian Indigene Group,\n<em>Science</em>, 306: 499–503.",
                "Pietroski, P. &amp; Crain, S. (2012). The Language Faculty, in E.\nMargolis, R. Samuels, &amp; S. Stich (eds.), <em>The Oxford Handbook\nof Philosophy of Cognitive Science</em>, New York: Oxford University\nPress, pp. 361–381.",
                "Pinker, S. (1994). <em>The Language Instinct: The New Science of\nLanguage and Mind.</em> London: Penguin.",
                "––– (2007). <em>The Stuff of Thought: Language\nas a Window into Human Nature.</em> London: Penguin.",
                "Prinz, J. (2002). <em>Furnishing the Mind: Concepts and Their\nPerceptual Basis</em>, Cambridge, MA.: MIT Press.",
                "Putnam, H. (1967). The ‘Innateness Hypothesis’ and\nExplanatory Models in Linguistics, <em>Synthese</em>, 17: 12–22;\nreprinted in H. Putnam, <em>Philosophical Papers</em> (Volume 2: Mind,\nLanguage and Reality), Cambridge: Cambridge University Press, pp.\n107–116.",
                "––– (1975). The Meaning of ‘Meaning’, in H.\nPutnam, <em>Philosophical Papers</em> (Volume 2: Mind, Language and\nReality), pp. 215–271, Cambridge: Cambridge University\nPress.",
                "Quine, W.V.O. (1960). <em>Word and Object</em>, Cambridge, MA: MIT\nPress.",
                "Ramsey, W. (1998). Prototypes and Conceptual Analysis, in M.\nDePaul &amp; W. Ramsey (eds.), <em>Rethinking Intuition: The\nPsychology of Intuition and Its Role in Philosophical Inquiry</em>,\nLanham, MD: Rowman &amp; Littlefield, pp. 161–77.",
                "Robbins, P. (2002). How to Blunt the Sword of Compositionality,\n<em>Noûs</em>, 36 (2): 313–34.",
                "Roberts, I. (2017). <em>The Oxford Handbook of Universal\nGrammar</em>, Oxford University Press.",
                "Rosch, E. (1978). Principles of Categorization, in E. Rosch &amp;\nB. Lloyd (eds.), <em>Cognition and Categorization</em>, Hillsdale, NJ:\nLawrence Erlbaum Associates, pp. 27–48.",
                "Rosch, E., &amp; Mervis, C. (1975). Family Resemblances: Studies\nin the Internal Structure of Categories, <em>Cognitive\nPsychology</em>, 7: 573–605.",
                "Sampson, G. (2005). <em>The “Language Instinct”\nDebate</em>, revised edition, London: Continuum.",
                "Samuels, R. (2002). Nativism in Cognitive Science, <em>Mind &amp;\nLanguage</em>, 17 (3): 233–65.",
                "Samuels, R. &amp; Ferreira, M. (2010). Why <i>Don’t</i>\nConcepts Constitute a Natural Kind, <i>Behavioral and Brain\nSciences</i>, 33: 222–223.",
                "Shapiro, L. (2004). <em>The Mind Incarnate</em>, Oxford: Oxford\nUniversity Press.",
                "Shettleworth, S. (2010). <em>Cognition, Evolution, and Behavior,\n2nd edition</em>, New York: Oxford University Press.",
                "Shusterman, A. &amp; Spelke, E. (2005). Language and the\nDevelopment of Spatial Reasoning, in P. Carruthers, S. Laurence, &amp;\nS. Stich (eds.), <em>The Innate Mind: Structure and Contents</em>, New\nYork: Oxford University Press, pp. 89–106.",
                "Smith, E., &amp; Medin, D. (1981). <em>Categories and\nConcepts</em>, Cambridge, MA: Harvard University Press.",
                "Sosa, E. (2009). A Defense of the Use of Intuitions in Philosophy,\nin D. Murphy &amp; M. Bishop (eds.), <em>Stich and His Critics</em>,\nOxford: Wiley-Blackwell.",
                "Spelke, E.S. (2003). What Makes Us Smart? Core Knowledge and\nNatural Language, in D. Gentner &amp; S. Goldin-Meadow (eds.),\n<em>Language in Mind</em>, Cambridge, MA: MIT Press, pp\n277–311.",
                "Spelke, E.S. &amp; Kinzler, K.D. (1992). Core Knowledge,\n<em>Developmental Science</em>, 10 (1): 89–96.",
                "Spelke, E.S. &amp; Newport, E. (1998). Nativism, Empiricism, and\nthe Development of Knowledge, in W. Damon (series ed.) and R.M. Lerner\n(volume ed.), <i>Handbook of Child Psychology</i> (<em>Volume 1:\nTheoretical Models of Human Development</em>), fifth edition, New\nYork: Wiley, pp. 275–340.",
                "Spelke, E.S. &amp; Tsivkin, S. (2001). Initial Knowledge and\nConceptual Change: Space and Number, in M. Bowerman &amp; S. Levinson\n(eds.), <i>Language Acquisition and Conceptual Development</i>,\nCambridge: Cambridge University Press.",
                "Stich, S. (1990). <em>The Fragmentation of Reason</em>, Cambridge,\nMA: MIT Press.",
                "––– (1992). What Is a Theory of Mental Representation?\n<em>Mind</em>, 101 (402): 243–61.",
                "––– (2009). Reply to Sosa. In D. Murphy &amp;\nM. Bishop (eds.). <em>Stich and His Critics</em>, Oxford:\nWiley-Blackwell.",
                "––– (2012). <em>Collected Papers</em> (Volume 2:\nKnowledge, Rationality, and Morality, 1978–2010), Oxford: Oxford\nUniversity Press.",
                "Strevens, M. (2018). <em>Thinking Off Your Feet: How Empirical\nPsychology Vindicates Armchair Psychology</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "Strohminger, N. &amp; Moore, B. (2010). Banishing the Thought,\n<i>Behavioral and Brain Sciences</i>, 33: 225–226",
                "Tooby, J. &amp; Cosmides, L. (2016). The Theoretical Foundations\nof Evolutionary Psychology. In D. Buss (ed.) <em>The Handbook of\nEvolutionary Psychology, Second Edition</em>, Wiley, pp.\n3–87.",
                "Van Gelder, T. (1995). What Might Cognition Be, If Not\nComputation? <i>Journal of Philosophy</i>, 91: 345–381.",
                "Vicente, A. &amp; Manrique, F.M. (2016). The Big Concepts Paper: A\nDefense of Hybridism, <em>British Journal for the Philosophy of\nScience</em>, 67: 59–88.",
                "Weinberg, J., Gonnerman, C., Buckner, C., &amp; Alexander, J.\n(2010). Are Philosophers Expert Intuiters? <em>Philosophical\nPsychology</em>, 23 (3): 331–355.",
                "Weinberg, J., Nichols, S., &amp; Stich, S. (2001). Normativity and\nEpistemic Intuitions, <em>Philosophical Topics</em>, 29 (1&amp;2):\n429–460.",
                "Weiskopf, D. (2007). Concept Empiricism and the Vehicles of\nThought, <i>Journal of Consciousness Studies</i>, 14: pp.\n156–183.",
                "––– (2009). The Plurality of Concepts, <i>Synthese</i>,\n169: 145–173.",
                "––– (2010). The Theoretical Indispensability of Concepts,\n<i>Behavioral and Brain Sciences</i>, 33: 228–229",
                "Whorf, B. (1956). <em>Language, Thought, and Reality</em>,\nCambridge, MA: MIT Press.",
                "Williamson, T. (2005). Armchair Philosophy, Metaphysical Modality\nand Counterfactual Thinking, <em>Proceedings of the Aristotelian\nSociety</em>, 105: 1–23.",
                "––– (2007). <em>The Philosophy of Philosophy</em>,\nOxford: Blackwell.",
                "Wittgenstein, L. (1953/1958). <em>Philosophical\nInvestigations</em>, 3rd edition, G.E.M. Anscombe (trans.), Oxford:\nBlackwell.",
                "Wright, C. (1989). The Verification Principle: Another\nPuncture—Another Patch, <em>Mind</em>, 98: 611–622.",
                "Yablo, S. (2008). <em>Thoughts: Papers on Mind, Meaning, and\nModality</em>, Oxford University Press.",
                "Zalta, E. (2001). Fregean Senses, Modes of Presentation, and\nConcepts, <em>Philosophical Perspectives</em>, 15: 335–359."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Adams, F. &amp; Campbell, K. (1999). Modality and Abstract\nConcepts. <em>Behavioral and Brain Sciences</em>, 22: 610.</li>\n<li>Andrews, K. &amp; Beck, J. (2017). <em>The Routledge Handbook of\nPhilosophy of Animal Minds</em>, London: Routledge.</li>\n<li>Ariew, A. (1999). Innateness is Canalization: In Defense of a\nDevelopmental Account of Innateness, in V. Hardcastle (ed.), <em>Where\nBiology Meets Psychology: Philosophical Essays</em>, pp. 117–38.\nCambridge, MA: MIT Press.</li>\n<li>Armstrong, D. (1968). <em>A Materialist Theory of Mind</em>,\nLondon: Routledge.</li>\n<li>Atran, S. &amp; Medin, D. (2008). <em>The Native Mind and the\nCultural Construction of Nature</em>, Cambridge, MA: MIT Press.</li>\n<li>Ayer, A.J. (1959). <em>Logical Positivism</em>, New York: The Free\nPress.</li>\n<li>Baker, M. (2001). <em>The Atoms of Language: The Mind’s\nHidden Rules of Grammar</em>, New York: Basic Books.</li>\n<li>Baillargeon, R. (2008). Innate Ideas Revisited: For a Principle of\nPersistence in Infants’ Physical Reasoning. <em>Perspectives on\nPsychological Science</em>, 3 (1): 2–13.</li>\n<li>Baillargeon, R., Scott, R.M., He, Z., Sloane, S., Setoh, P., Jin,\nK.-S., Wu, D., &amp; Bian, L. (2015). Psychological and Sociomoral\nReasoning in Infancy, in M.Mikulincer &amp; P.R. Shaver (eds.),\n<em>APA Handbook of Personality and Social Psychology: Volume 1.\nAttitudes and Social Cognition</em>, Washington, DC: American\nPsychological Association, pp. 79–150.</li>\n<li>Barsalou, L. (1999). Perceptual Symbol Systems. <em>Behavioral and\nBrain Sciences</em>, 22: 577–609.</li>\n<li>Barsalou, L., Simmons, W., Barbey, A., &amp; Wilson, C. (2003).\nGrounding Conceptual Knowledge in Modality-Specific Systems.\n<em>Trends in Cognitive Science</em>, 7 (2): 84–89.</li>\n<li>Bealer, G. (1998). Intuition and the Autonomy of Philosophy, in M.\nDePaul &amp; W. Ramsey (eds.) <em>Rethinking Intuition: The Psychology\nof Intuition and Its Role in Philosophical Inquiry</em>, Lanham, MD:\nRowman &amp; Littlefield, pp. 201–239.</li>\n<li>Bekoff, M., Allen, C., &amp; Burghardt, G. (2002). <em>The\nCognitive Animal: Empirical and Theoretical Perspectives on Animal\nCognition</em>, Cambridge, MA: MIT Press.</li>\n<li>Bennett, M. &amp; Hacker, P. (2008). <em>History of Cognitive\nNeuroscience</em>, Oxford: Wiley-Blackwell.</li>\n<li>Bermudez, J. (2003). <em>Thinking Without Words</em>, Oxford:\nOxford University Press.</li>\n<li>Block, N. &amp; Stalnaker, R. (1999). Conceptual Analysis and the\nExplanatory Gap, <em>Philosophical Review</em>, 108 (1):\n1–46.</li>\n<li>Blok, S., Newman, G. &amp; Rips, L.J. (2005). Individuals and\nTheir Concepts, in W.-K. Ahn, R.L. Goldstone, B.C. Love, A.B. Markman,\n&amp; P. Wolff (eds.), <em>Categorization Inside and Outside the\nLaboratory: Essays in Honor of Douglas L. Medin</em>, Washington, DC:\nAmerican Psychological Association, pp. 127–149.</li>\n<li>Boroditsky, L., Schmidt, L., &amp; Phillips, W. (2003). Sex,\nSyntax, and Semantics, in D. Gentner &amp; S. Goldin-Meadow (eds.)\n<em>Language in Mind</em>, Cambridge, MA: MIT Press, pp.\n61–79.</li>\n<li>Bowerman, M. &amp; Levinson, S. (2001). <em>Language Acquisition\nand Conceptual Development</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Brandom, R. (1994). <em>Making It Explicit: Reasoning,\nRepresenting, and Discursive Commitment</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>––– (2000). <em>Articulating Reasons: An Introduction to\nInferentialism</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Brewer, W. (1999). Perceptual Symbols: The Power and Limitations\nof a Theory of Dynamic Imagery and Structured Frames, <em>Behavioral\nand Brain Sciences</em>, 22: 611–12.</li>\n<li>Camp, E. (2009). A Language of Baboon Thought?, in R.W. Lurz (ed.)\n<em>The Philosophy of Animal Minds</em>, Cambridge: Cambridge\nUniversity Press, pp. 108–127.</li>\n<li>Cappelen, H. (2018). <em>Fixing Language: An Essay on Conceptual\nEngineering</em>, Oxford: Oxford University Press.</li>\n<li>Carey, S. (1985). <em>Conceptual Change in Childhood</em>,\nCambridge, MA: MIT Press.</li>\n<li>––– (2009). <em>The Origin of Concepts</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Carruthers, P. (1992). <em>The Animals Issue: Moral Theory in\nPractice</em>, Cambridge: Cambridge University Press.</li>\n<li>––– (1996). <em>Language, Thought, and\nConsciousness</em>, Cambridge: Cambridge University Press.</li>\n<li>––– (2002). The Cognitive Functions of Language,\n<em>Behavioral and Brain Sciences</em>, 25: 657–74.</li>\n<li>––– (2006). <em>The Architecture of the Mind: Massive\nModularity and the Flexibility of Thought</em>, New York: Oxford\nUniversity Press.</li>\n<li>Carruthers, P., Laurence, S., &amp; Stich, S. (2005). <em>The\nInnate Mind: Structure and Contents</em>, Oxford: Oxford University\nPress.</li>\n<li>––– (2006). <em>The\nInnate Mind: Culture and Cognition</em>, Oxford: Oxford University\nPress.</li>\n<li>––– (2007). <em>The Innate Mind: Foundations and\nthe Future</em>, Oxford: Oxford University Press.</li>\n<li>Chalmers, D. (1996). <em>The Conscious Mind: In Search of a\nFundamental Theory</em>, Oxford: Oxford University Press.</li>\n<li>––– (2010). <em>The Character of Consciousness</em>,\nOxford: Oxford University Press.</li>\n<li>Chalmers, D. &amp; Jackson, F. (2001). Conceptual Analysis and\nReductive Explanation, <em>Philosophical Review</em>, 110:\n315–61.</li>\n<li>Choi, S. &amp; Bowerman, M. (1991). Learning to Express Motion\nEvents in English and Korean: The Influence of Language-Specific\nLexicalization Patterns, <em>Cognition</em>, 41: 83–121.</li>\n<li>Chomsky, N. (1967). Recent Contributions to the Theory of Innate\nIdeas, <em>Synthese</em>, 17: 2–11. Reprinted in S. Stich (ed.)\n<em>Innate Ideas</em>, Berkeley: University of California Press, pp.\n121–31.</li>\n<li>––– (1975). <em>Reflections on Language</em>, New York:\nPantheon.</li>\n<li>––– (1980). <em>Rules and Representations</em>, New York:\nColumbia University Press.</li>\n<li>––– (1988). <em>Language and the Problems of Knowledge:\nThe Managua Lectures</em>, Cambridge, MA: MIT Press.</li>\n<li>Churchland, P. (1981). Eliminative Materialism and Propositional\nAttitudes, <em>Journal of Philosophy</em>, 78 (2): 67–90.</li>\n<li>Clark, A. (1993). <em>Associative Engines: Connectionism,\nConcepts, and Representational Change</em>, Cambridge, MA: MIT\nPress.</li>\n<li>––– (1998). Twisted Tales: Causal Complexity and Cognitive\nScientific Explanation, <em>Minds and Machines</em>, 8:\n76–99.</li>\n<li>Clayton, N., Bussey, T., &amp; Dickinson, A. (2003). Can Animals\nRecall the Past and Plan for the Future? <em>Nature Reviews:\nNeuroscience</em>, 4: 685–91</li>\n<li>Cowie, F. (1999). <em>What’s Within: Nativism\nReconsidered</em>, Oxford: Oxford University Press.</li>\n<li>Crain, S. &amp; Pietroski, P. (2001). Nature, Nurture, and\nUniversal Grammar, <em>Linguistics and Philosophy</em>, 24:\n139–186.</li>\n<li>Crane, T. (2015). <em>The Mechanical Mind, Third Edition</em>,\nLondon: Routledge.</li>\n<li>Cummins, R. (1998). Reflection on Reflective Equilibrium, in M.\nDePaul &amp; W. Ramsey (eds.), <em>Rethinking Intuition: The\nPsychology of Intuition and Its Role in Philosophical Inquiry</em>,\nLanham, MD: Rowman &amp; Littlefield, pp. 113–27.</li>\n<li>Davidson, D. (1975). Thought and Talk. In his <em>Inquiries into\nTruth and Interpretation</em>, Oxford: Oxford University Press.</li>\n<li>Del Pinal, G. (2016). Prototypes as Compositional Components of\nConcepts, <em>Synthese</em>, 193 (9): 2899–2927.</li>\n<li>Dennett, D. (1977). A Cure for the Common Code. Reprinted in D.\nDennett (1978) <em>Brainstorms</em>, Cambridge, MA: MIT Press.</li>\n<li>––– (1978). <em>Brainstorms: Philosophical\nEssays on Mind and Psychology</em>, Cambridge, MA: MIT Press.</li>\n<li>––– (1987). <em>The Intentional Stance</em>, Cambridge,\nMA: MIT Press.</li>\n<li>––– (1991). <em>Consciousness Explained</em>, Boston:\nLittle, Brown and Company.</li>\n<li>DePaul, M. &amp; Ramsey, W. (1998). <em>Rethinking Intuition: The\nPsychology of Intuition and Its Role in Philosophical Inquiry</em>,\nLanham, MD: Rowman &amp; Littlefield.</li>\n<li>Devitt, M. (1981). <em>Designation</em>, New York: Columbia\nUniversity Press.</li>\n<li>––– (1996). <em>Coming to Our Senses: A Naturalistic\nProgram for Semantic Localism</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Dove, G. (2009). Beyond Perceptual Symbols: A Call for\nRepresentational Pluralism, <em>Cognition</em>, 110:\n412–431.</li>\n<li>Dummett, M. (1993). <em>Seas of Language</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Elman, J., Bates, E., Johnson, M., Karmiloff-Smith, A., Parisi,\nD., and Plunkett, K. (1996). <em>Rethinking Innateness: A\nConnectionist Perspective on Development</em>, Cambridge, MA: MIT\nPress.</li>\n<li>Emery, N., Dally, J., &amp; Clayton, N. (2004). Western Scrub-Jays\n(<em>Aphelocoma Californica</em>) Use Cognitive Strategies to Protect\nTheir Caches from Thieving Conspecifics, <em>Animal Cognition</em>, 7:\n37–43.</li>\n<li>Fodor, J. (1968). The Appeal to Tacit Knowledge, <em>Journal of\nPhilosophy</em>, 65 (20): 627–640.</li>\n<li>––– (1975). <em>The Language of Thought</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>––– (1981). The Present Status of the Innateness\nControversy. In his <em>Representations: Philosophical Essays on the\nFoundations of Cognitive Science</em>, Cambridge, MA: MIT Press.</li>\n<li>––– (1987). <em>Psychosemantics: The Problem of Meaning in\nthe Philosophy of Mind</em>, Cambridge, MA: MIT Press.</li>\n<li>––– (1998). <em>Concepts: Where Cognitive Science Went\nWrong</em>, New York: Oxford University Press.</li>\n<li>––– (2003). <em>Hume Variations</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>––– (2008). <em>LOT 2: The Language of Thought\nRevisited</em>, New York: Oxford University Press.</li>\n<li>Fodor, J. &amp; Lepore, E. (1992). <em>Holism: A Shopper’s\nGuide</em>, Oxford: Blackwell.</li>\n<li>––– (1996). The Red Herring and the Pet\nFish: Why Concepts Still Can’t Be Prototypes,\n<em>Cognition</em>, 58: 253–270.</li>\n<li>Fodor, J. &amp; Pylyshyn, Z. (1988). Connectionism and Cognitive\nArchitecture: A Critical Analysis, <em>Cognition</em>, 28:\n3–71.</li>\n<li>Gallistel, C.R. &amp; King, A. (2009). <em>Memory and the\nComputational Brain: Why Cognitive Science Will Transform\nNeuroscience</em>, Oxford: Wiley-Blackwell.</li>\n<li>––– (1990). <em>The Organization of Learning</em>,\nCambridge, MA: MIT Press.</li>\n<li>Gelman, S. (2003). <em>The Essential Child: Origins of\nEssentialism in Everyday Thought</em>, Oxford: Oxford University\nPress.</li>\n<li>Genone, E. (1963). Theories of Reference and Experimental\nPhilosophy. <em>Philosophy Compass</em>, 7 (2): 152–163.</li>\n<li>Gentner, D. &amp; Goldin-Meadow, S. (2003). <em>Language in\nMind</em>, Cambridge, MA: MIT Press.</li>\n<li>Gettier, E. (1963). Is Justified True Belief Knowledge?\n<em>Analysis</em>, 23: 121–123.</li>\n<li>Gleitman, L. &amp; Papafragou, A. (2012). New Perspectives on\nLanguage and Thought, in K. Holyoak &amp; R. Morrison (eds.),\n<em>Oxford Handbook of Thinking and Reasoning</em>, Oxford: Oxford\nUniversity Press, pp. 543–568.</li>\n<li>Goldman, A. (1986). <em>Epistemology and Cognition</em>,\nCambridge, MA: MIT Press.</li>\n<li>Gonnerman, C. &amp; Weinberg, J. (2010). Two Uneliminated Uses for\n‘Concepts’: Hybrids and Guides for Inquiry, <i>Behavioral\nand Brain Sciences</i>, 33: 211–212</li>\n<li>Goodman, N. (1969). The Emporer’s New Ideas, in S. Hook\n(<em>ed.</em>), <em>Language and Philosophy</em>, New York: NYU Press,\npp. 138–42.</li>\n<li>Gopnik, A., &amp; Meltzoff, A. (1997). <em>Words, Thoughts, and\nTheories</em>, Cambridge, MA: MIT Press.</li>\n<li>Gordon, P. (2004). Numerical Cognition Without Words: Evidence\nfrom Amazonia, <em>Science</em>, 306: 496–499.</li>\n<li>Griffiths, P. (2002). What Is Innateness? <em>Monist</em>, 85 (1):\n70–85.</li>\n<li>Gumperz, J. &amp; Levinson, S. (1996). <em>Rethinking Linguistic\nRelativity</em>, Cambridge: Cambridge University Press.</li>\n<li>Hampton, J. (2006). Concepts as Prototypes, in B.H. Ross (ed.),\n<i>Psychology of Learning and Motivation</i> (Volume 46), New York:\nAcademic Press, pp. 79–113</li>\n<li>––– (2010). Concept Talk Cannot Be Avoided, <i>Behavioral\nand Brain Sciences</i>, 33: 212–213</li>\n<li>Hampton, J. &amp; Jönsson, M. (2012). Typicality and\nCompositionality: The Logic of Combining Vague Concepts, in M.\nWerning, W. Hintzen, &amp; E. Machery (eds.), <em>Oxford Handbook of\nCompositionality.</em> Oxford: Oxford University Press.</li>\n<li>Haslanger, S. (2012). <em>Resisting Reality: Social Construction\nand Social Critique</em>, Oxford: Oxford University Press.</li>\n<li>Hermer-Vazquez, L., Spelke, E., &amp; Katsnelson, A. (2001).\nSources of Flexibility in Human Cognition: Dual-Task Studies of Space\nand Language, <em>Cognitive Psychology</em>, 39: 3–36.</li>\n<li>Hespos, S. &amp; Spelke, E. (2004). Conceptual Precursors to\nLanguage, <em>Nature</em>, 430: 453–456.</li>\n<li>Hume, D. (1739/1978). <em>A Treatise of Human Nature</em>, Oxford:\nOxford University Press.</li>\n<li>––– (1748/1975). <em>Enquiries Concerning Human Understanding\nand Concerning the Principles of Morals</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Hurley, S. &amp; Nudds, M. (2006) <em>Rational Animals?</em>,\nOxford: Oxford University Press.</li>\n<li>Jackendoff, R. (1989). What is a Concept, that a Person May Grasp\nIt? <em>Mind &amp; Language</em>, 4: 68–102.</li>\n<li>Jackson, F. (1998). <em>From Metaphysics to Ethics: A Defense of\nConceptual Analysis</em>, Oxford: Oxford University Press.</li>\n<li>Johnson, S.P. (2010). <em>Neuroconstructivism: The New Science of\nCognitive Development</em>, Oxford: Oxford University Press.</li>\n<li>Keil, F. (1989). <em>Concepts, Kinds, and Cognitive\nDevelopment</em>, Cambridge, MA: MIT Press.</li>\n<li>Kenny, A. (2010). Concepts, Brains, and Behaviour, <em>Grazer\nPhilosophische Studien</em>, 81 (1): 105–113.</li>\n<li>Khalidi, M.A. (2015). Innateness as a Natural Cognitive Kind,\n<em>Philosophical Psychology</em>, 29 (3): 319–333.</li>\n<li>Kornblith, H. (2002). <em>Knowledge and Its Place in Nature</em>,\nOxford: Oxford University Press.</li>\n<li>Kripke, S. (1972/1980). <em>Naming and Necessity</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>Lalumera, E. (2010). Concepts are a Functional Kind, <i>Behavioral\nand Brain Sciences</i>, 33: 217–218</li>\n<li>Landau, B. (1982). Will the Real Grandmother Please Stand Up? The\nPsychological Reality of Dual Meaning Representations, <em>Journal of\nPsycholinguistic Research</em>, 11 (1): 47–62.</li>\n<li>Langland-Hassan, P. &amp; Vicente, A. (2018). <em>Inner Speech:\nNew Voices</em>, Oxford: Oxford University Press.</li>\n<li>Laurence, S. &amp; Margolis, E. (1997). Regress Arguments Against\nthe Language of Thought, <em>Analysis</em>, 57: 60–66.</li>\n<li>––– (1999). Concepts and Cognitive\nScience, in E. Margolis &amp; S. Laurence (eds.), <em>Concepts: Core\nReadings</em>, Cambridge, MA: MIT Press, pp. 3–81.</li>\n<li>––– (2001). The Poverty of the\nStimulus Argument, <em>British Journal for the Philosophy of\nScience</em>, 52: 217–76.</li>\n<li>––– (2002). Radical Concept Nativism,\n<em>Cognition</em>, 86: 25–55.</li>\n<li>––– (2007). Linguistic Determinism and\nthe Innate Basis of Number, in P. Carruthers, S. Laurence, &amp; S.\nStich (eds.), <em>The Innate Mind: Foundations and the Future</em>,\nNew York: Oxford University Press, pp. 139–169.</li>\n<li>––– (2012). The Scope of the\nConceptual, in E. Margolis, R. Samuels, &amp; S. Stich (eds.), <em>The\nOxford Handbook of Philosophy of Cognitive Science</em>, New York:\nOxford University Press, pp. 291–317.</li>\n<li>Levin, B. &amp; Pinker, S. (1991). Introduction, in B. Levin &amp;\nS. Pinker (eds.), <em>Lexical and Conceptual Semantics</em>, Oxford:\nBlackwell.</li>\n<li>Levine, J. (2001). <em>Purple Haze: The Puzzle of\nConsciousness</em>, Oxford: Oxford University Press.</li>\n<li>––– (2010). Demonstrative Thought. <em>Mind &amp;\nLanguage</em>, 25 (2): 169–195.</li>\n<li>Levinson, S. (2003). <em>Space in Language and Cognition:\nExplorations in Cognitive Diversity</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Levinson, S., Kita, S., Haun, D., &amp; Rasch, B. (2002).\nReturning the Tables: Language Affects Spatial Reasoning,\n<em>Cognition</em>, 84: 155–188.</li>\n<li>Lewis, D. (1966). An Argument for the Identity Theory, <em>Journal\nof Philosophy</em>, 63 (1): 17–25.</li>\n<li>Li, P. &amp; Gleitman, L. (2002). Turning the Tables: Language and\nSpatial Reasoning, <em>Cognition</em>, 83: 265–294.</li>\n<li>Li, P., Abarbanell, L., Gleitman, L. &amp; Papafragou, A. (2011).\nSpatial Reasoning in Tenejapan Mayans, <em>Cognition</em>, 120 (1):\n33–53.</li>\n<li>Locke, J. (1690/1975). <em>An Essay Concerning Human\nUnderstanding</em>, New York: Oxford University Press.</li>\n<li>Lupyan, G. (2012). What Do Words Do? Toward a Theory of\nLanguage-Augmented Thought, in B.H. Ross (ed.), <i>Psychology of\nLearning and Motivation</i> (Volume 57), New York: Academic Press, pp.\n155–297</li>\n<li>Machery, E. (2007). Concept Empiricism: A Methodological Critique,\n<em>Cognition</em>, 104: 19–46.</li>\n<li>––– (2009). <em>Doing Without Concepts</em>, New York:\nOxford University Press.</li>\n<li>––– (2010). Precis of <em>Doing Without Concepts</em>,\n<em>Behavioral and Brain Sciences</em>, 33: 195–244.</li>\n<li>––– (2017). <em>Philosophy within Its Proper Bounds</em>,\nOxford: Oxford University Press.</li>\n<li>Machery, E., Mallon, R., Nichols, S. &amp; Stich, S. (2004).\nSemantics, Cross-Cultural Style, <em>Cognition</em>, 92: B1–B12.</li>\n<li>Machery, E., Stich, S., Rose, D., Chatterjee, A., Karasawa, K.,\nStruchiner, N., Sirker, S., Usui, N., &amp; Hashimoto, T. (2017).\nGettier Across Cultures. <em>Noûs</em>, 51 (3):\n645–664.</li>\n<li>Mahon, B.Z. (2015). What is Embodied about Cognition?\n<em>Language, Cognition, and Neuroscience</em>, 30 (4):\n420–429.</li>\n<li>Mallon, R. &amp; Weinberg, J. (2006). Innateness as Closed Process\nInvariance, <em>Philosophy of Science</em>, 73 (3):\n323–344.</li>\n<li>Mameli, M. (2008). On Innateness: The Clutter Hypothesis and the\nCluster Hypothesis. <em>The Journal of Philosophy</em>, 105 (12):\n719–736.</li>\n<li>Manfredi, P. (1993). Tacit Beliefs and Other Doxastic Attitudes.\n<em>Philosophia</em>, 22 (1): 95–117.</li>\n<li>Marcus, G. (2001). <em>The Algebraic Mind: Integrating\nConnectionism and Cognitive Science</em>, Cambridge, MA: MIT\nPress.</li>\n<li>––– (2004). <em>The Birth of the Mind: How a Tiny Number of\nGenes Creates the Complexities of Human Thought</em>, New York: Basic\nBooks.</li>\n<li>Margolis, E. (1998). How to Acquire a Concept, <em>Mind &amp;\nLanguage</em>, 13: 347–369.</li>\n<li>Margolis, E. &amp; Laurence, S. (1999). <em>Concepts: Core\nReadings</em>, Cambridge, MA: MIT Press.</li>\n<li>––– (2007). The Ontology of Concepts\n— Abstract Objects or Mental Representations?\n<em>Noûs</em>, 41 (4): 561–593.</li>\n<li>––– (2010). Concepts and Theoretical\nUnification, <i>Behavioral and Brain Sciences</i>, 33:\n219–220.</li>\n<li>––– (2011). Learning Matters: The Role\nof Learning in Concept Acquisition, <em>Mind &amp; Language</em>, 26\n(5): 507–539.</li>\n<li>––– (2013). In Defense of Nativism,\n<i>Philosophical Studies</i>, 165 (2): 693–718.</li>\n<li>––– (2015). <em>The Conceptual Mind:\nNew Directions in the Study of Concepts</em>, Cambridge, MA: MIT\nPress.</li>\n<li>McClelland, J., Botvinick, M., Noelle, D., Plaut, D., Rogers, T.,\nSeidenberg, M., &amp; Smith, L. (2010). Letting Structure Emerge:\nConnectionist and Dynamic Systems Approaches to Cognition, <em>Trends\nin Cognitive Sciences</em>, 14: 348–56.</li>\n<li>McDowell, J. (1994). <em>Mind and World</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Millikan, R. (2000). <em>On Clear and Confused Ideas</em>,\nCambridge: Cambridge University Press.</li>\n<li>Murphy, G. (2002). <em>The Big Book of Concepts</em>, Cambridge,\nMA: MIT Press.</li>\n<li>Osherson, D., &amp; Smith, E. (1981). On the Adequacy of Prototype\nTheory as a Theory of Concepts, <em>Cognition</em>, 9:\n35–58.</li>\n<li>Papineau, D. (2002). <em>Thinking About Consciousness</em>,\nOxford: Oxford University Press.</li>\n<li>––– (2013). The Poverty of Conceptual Analysis,\nin M.  Haug (ed.),<i>The Armchair or the Laboratory?</i>, New York:\nRoutledge, pp. 166–194</li>\n<li>Peacocke, C. (1992). <em>A Study of Concepts</em>, Cambridge, MA:\nMIT Press.</li>\n<li>––– (2005). Rationale and Maxims in the Study of\nConcepts, <em>Noûs</em>, 39 (1): 167–78.</li>\n<li>Pica, P., Lemer, C., Izard, V., &amp; Dehaene, S. (2004). Exact\nand Approximate Arithmetic in an Amazonian Indigene Group,\n<em>Science</em>, 306: 499–503.</li>\n<li>Pietroski, P. &amp; Crain, S. (2012). The Language Faculty, in E.\nMargolis, R. Samuels, &amp; S. Stich (eds.), <em>The Oxford Handbook\nof Philosophy of Cognitive Science</em>, New York: Oxford University\nPress, pp. 361–381.</li>\n<li>Pinker, S. (1994). <em>The Language Instinct: The New Science of\nLanguage and Mind.</em> London: Penguin.</li>\n<li>––– (2007). <em>The Stuff of Thought: Language\nas a Window into Human Nature.</em> London: Penguin.</li>\n<li>Prinz, J. (2002). <em>Furnishing the Mind: Concepts and Their\nPerceptual Basis</em>, Cambridge, MA.: MIT Press.</li>\n<li>Putnam, H. (1967). The ‘Innateness Hypothesis’ and\nExplanatory Models in Linguistics, <em>Synthese</em>, 17: 12–22;\nreprinted in H. Putnam, <em>Philosophical Papers</em> (Volume 2: Mind,\nLanguage and Reality), Cambridge: Cambridge University Press, pp.\n107–116.</li>\n<li>––– (1975). The Meaning of ‘Meaning’, in H.\nPutnam, <em>Philosophical Papers</em> (Volume 2: Mind, Language and\nReality), pp. 215–271, Cambridge: Cambridge University\nPress.</li>\n<li>Quine, W.V.O. (1960). <em>Word and Object</em>, Cambridge, MA: MIT\nPress.</li>\n<li>Ramsey, W. (1998). Prototypes and Conceptual Analysis, in M.\nDePaul &amp; W. Ramsey (eds.), <em>Rethinking Intuition: The\nPsychology of Intuition and Its Role in Philosophical Inquiry</em>,\nLanham, MD: Rowman &amp; Littlefield, pp. 161–77.</li>\n<li>Robbins, P. (2002). How to Blunt the Sword of Compositionality,\n<em>Noûs</em>, 36 (2): 313–34.</li>\n<li>Roberts, I. (2017). <em>The Oxford Handbook of Universal\nGrammar</em>, Oxford University Press.</li>\n<li>Rosch, E. (1978). Principles of Categorization, in E. Rosch &amp;\nB. Lloyd (eds.), <em>Cognition and Categorization</em>, Hillsdale, NJ:\nLawrence Erlbaum Associates, pp. 27–48.</li>\n<li>Rosch, E., &amp; Mervis, C. (1975). Family Resemblances: Studies\nin the Internal Structure of Categories, <em>Cognitive\nPsychology</em>, 7: 573–605.</li>\n<li>Sampson, G. (2005). <em>The “Language Instinct”\nDebate</em>, revised edition, London: Continuum.</li>\n<li>Samuels, R. (2002). Nativism in Cognitive Science, <em>Mind &amp;\nLanguage</em>, 17 (3): 233–65.</li>\n<li>Samuels, R. &amp; Ferreira, M. (2010). Why <i>Don’t</i>\nConcepts Constitute a Natural Kind, <i>Behavioral and Brain\nSciences</i>, 33: 222–223.</li>\n<li>Shapiro, L. (2004). <em>The Mind Incarnate</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Shettleworth, S. (2010). <em>Cognition, Evolution, and Behavior,\n2nd edition</em>, New York: Oxford University Press.</li>\n<li>Shusterman, A. &amp; Spelke, E. (2005). Language and the\nDevelopment of Spatial Reasoning, in P. Carruthers, S. Laurence, &amp;\nS. Stich (eds.), <em>The Innate Mind: Structure and Contents</em>, New\nYork: Oxford University Press, pp. 89–106.</li>\n<li>Smith, E., &amp; Medin, D. (1981). <em>Categories and\nConcepts</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Sosa, E. (2009). A Defense of the Use of Intuitions in Philosophy,\nin D. Murphy &amp; M. Bishop (eds.), <em>Stich and His Critics</em>,\nOxford: Wiley-Blackwell.</li>\n<li>Spelke, E.S. (2003). What Makes Us Smart? Core Knowledge and\nNatural Language, in D. Gentner &amp; S. Goldin-Meadow (eds.),\n<em>Language in Mind</em>, Cambridge, MA: MIT Press, pp\n277–311.</li>\n<li>Spelke, E.S. &amp; Kinzler, K.D. (1992). Core Knowledge,\n<em>Developmental Science</em>, 10 (1): 89–96.</li>\n<li>Spelke, E.S. &amp; Newport, E. (1998). Nativism, Empiricism, and\nthe Development of Knowledge, in W. Damon (series ed.) and R.M. Lerner\n(volume ed.), <i>Handbook of Child Psychology</i> (<em>Volume 1:\nTheoretical Models of Human Development</em>), fifth edition, New\nYork: Wiley, pp. 275–340.</li>\n<li>Spelke, E.S. &amp; Tsivkin, S. (2001). Initial Knowledge and\nConceptual Change: Space and Number, in M. Bowerman &amp; S. Levinson\n(eds.), <i>Language Acquisition and Conceptual Development</i>,\nCambridge: Cambridge University Press.</li>\n<li>Stich, S. (1990). <em>The Fragmentation of Reason</em>, Cambridge,\nMA: MIT Press.</li>\n<li>––– (1992). What Is a Theory of Mental Representation?\n<em>Mind</em>, 101 (402): 243–61.</li>\n<li>––– (2009). Reply to Sosa. In D. Murphy &amp;\nM. Bishop (eds.). <em>Stich and His Critics</em>, Oxford:\nWiley-Blackwell.</li>\n<li>––– (2012). <em>Collected Papers</em> (Volume 2:\nKnowledge, Rationality, and Morality, 1978–2010), Oxford: Oxford\nUniversity Press.</li>\n<li>Strevens, M. (2018). <em>Thinking Off Your Feet: How Empirical\nPsychology Vindicates Armchair Psychology</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>Strohminger, N. &amp; Moore, B. (2010). Banishing the Thought,\n<i>Behavioral and Brain Sciences</i>, 33: 225–226</li>\n<li>Tooby, J. &amp; Cosmides, L. (2016). The Theoretical Foundations\nof Evolutionary Psychology. In D. Buss (ed.) <em>The Handbook of\nEvolutionary Psychology, Second Edition</em>, Wiley, pp.\n3–87.</li>\n<li>Van Gelder, T. (1995). What Might Cognition Be, If Not\nComputation? <i>Journal of Philosophy</i>, 91: 345–381.</li>\n<li>Vicente, A. &amp; Manrique, F.M. (2016). The Big Concepts Paper: A\nDefense of Hybridism, <em>British Journal for the Philosophy of\nScience</em>, 67: 59–88.</li>\n<li>Weinberg, J., Gonnerman, C., Buckner, C., &amp; Alexander, J.\n(2010). Are Philosophers Expert Intuiters? <em>Philosophical\nPsychology</em>, 23 (3): 331–355.</li>\n<li>Weinberg, J., Nichols, S., &amp; Stich, S. (2001). Normativity and\nEpistemic Intuitions, <em>Philosophical Topics</em>, 29 (1&amp;2):\n429–460.</li>\n<li>Weiskopf, D. (2007). Concept Empiricism and the Vehicles of\nThought, <i>Journal of Consciousness Studies</i>, 14: pp.\n156–183.</li>\n<li>––– (2009). The Plurality of Concepts, <i>Synthese</i>,\n169: 145–173.</li>\n<li>––– (2010). The Theoretical Indispensability of Concepts,\n<i>Behavioral and Brain Sciences</i>, 33: 228–229</li>\n<li>Whorf, B. (1956). <em>Language, Thought, and Reality</em>,\nCambridge, MA: MIT Press.</li>\n<li>Williamson, T. (2005). Armchair Philosophy, Metaphysical Modality\nand Counterfactual Thinking, <em>Proceedings of the Aristotelian\nSociety</em>, 105: 1–23.</li>\n<li>––– (2007). <em>The Philosophy of Philosophy</em>,\nOxford: Blackwell.</li>\n<li>Wittgenstein, L. (1953/1958). <em>Philosophical\nInvestigations</em>, 3rd edition, G.E.M. Anscombe (trans.), Oxford:\nBlackwell.</li>\n<li>Wright, C. (1989). The Verification Principle: Another\nPuncture—Another Patch, <em>Mind</em>, 98: 611–622.</li>\n<li>Yablo, S. (2008). <em>Thoughts: Papers on Mind, Meaning, and\nModality</em>, Oxford University Press.</li>\n<li>Zalta, E. (2001). Fregean Senses, Modes of Presentation, and\nConcepts, <em>Philosophical Perspectives</em>, 15: 335–359.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "abilities",
            "animal: cognition",
            "belief",
            "cognition: embodied",
            "connectionism",
            "Frege, Gottlob",
            "innate/acquired distinction",
            "innateness: and language",
            "knowledge: analysis of",
            "language of thought hypothesis",
            "linguistics: philosophy of",
            "materialism: eliminative",
            "mental content: nonconceptual",
            "mental representation",
            "mind: computational theory of",
            "naturalism",
            "Vienna Circle"
        ],
        "entry_link": [
            {
                "../abilities/": "abilities"
            },
            {
                "../cognition-animal/": "animal: cognition"
            },
            {
                "../belief/": "belief"
            },
            {
                "../embodied-cognition/": "cognition: embodied"
            },
            {
                "../connectionism/": "connectionism"
            },
            {
                "../frege/": "Frege, Gottlob"
            },
            {
                "../innate-acquired/": "innate/acquired distinction"
            },
            {
                "../innateness-language/": "innateness: and language"
            },
            {
                "../knowledge-analysis/": "knowledge: analysis of"
            },
            {
                "../language-thought/": "language of thought hypothesis"
            },
            {
                "../linguistics/": "linguistics: philosophy of"
            },
            {
                "../materialism-eliminative/": "materialism: eliminative"
            },
            {
                "../content-nonconceptual/": "mental content: nonconceptual"
            },
            {
                "../mental-representation/": "mental representation"
            },
            {
                "../computational-mind/": "mind: computational theory of"
            },
            {
                "../naturalism/": "naturalism"
            },
            {
                "../vienna-circle/": "Vienna Circle"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=concepts\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/concepts/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=concepts&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/concepts/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=concepts": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/concepts/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=concepts&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/concepts/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://philpapers.org/browse/concepts\" target=\"other\">Concepts</a>,\n entry in the category <i>philosophy of mind</i> at\nPhilPapers.org."
        ],
        "listed_links": [
            {
                "http://philpapers.org/browse/concepts": "Concepts"
            }
        ]
    }
}