{
    "url": "concept-evil",
    "title": "The Concept of Evil",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Todd Calder\n<Todd.Calder@SMU.CA>",
        "author_links": [
            {
                "mailto:Todd%2eCalder%40SMU%2eCA": "Todd.Calder@SMU.CA"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nTodd Calder\n&lt;<a href=\"mailto:Todd%2eCalder%40SMU%2eCA\"><em>Todd<abbr title=\" dot \">.</abbr>Calder<abbr title=\" at \">@</abbr>SMU<abbr title=\" dot \">.</abbr>CA</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Nov 26, 2013",
        "substantive revision Mon Oct 3, 2022"
    ],
    "preamble": "\n\nSince World War II, moral, political, and legal philosophers have\nbecome increasingly interested in the concept of evil. This interest\nhas been partly motivated by ascriptions of ‘evil’ by\nlaymen, social scientists, journalists, and politicians as they try to\nunderstand and respond to various atrocities and horrors, such as\ngenocides, terrorist attacks, mass murders, and tortures and killing\nsprees by psychopathic serial killers. It seems that we cannot capture\nthe moral significance of these actions and their perpetrators by\ncalling them ‘wrong’ or ‘bad’ or even\n‘very very wrong’ or ‘very very bad.’ We need\nthe concept of evil.\n\nTo avoid confusion, it is important to note that there are at least\ntwo concepts of evil: a broad concept and a narrow concept. The broad\nconcept picks out any bad state of affairs, wrongful action, or\ncharacter flaw. The suffering of a toothache is evil in the broad\nsense as is a harmless lie. Evil in the broad sense has been\ndivided into two categories: natural evil and moral evil. Natural\nevils are bad states of affairs which do not result from the\nintentions or negligence of moral agents. Hurricanes and toothaches\nare examples of natural evils. By contrast, moral evils do result from\nthe intentions or negligence of moral agents. Murder and lying are\nexamples of moral evils.\n\nEvil in the broad sense, which includes all natural and moral evils,\ntends to be the sort of evil referenced in theological contexts, such\nas in discussions of the problem of evil. The problem of evil is the\nproblem of accounting for evil in a world created by an all-powerful,\nall-knowing, all-good God. It seems that if the creator has these\nattributes, there would be no evil in the world. But there is evil in\nthe world. Thus, there is reason to believe that an all-powerful,\nall-knowing, all-good creator does not exist.\n\nIn contrast to the broad concept of evil, the narrow concept of evil\npicks out only the most morally despicable sorts of actions,\ncharacters, events, etc. As Marcus Singer puts it\n“‘evil’ [in this sense] … is the worst\npossible term of opprobrium imaginable” (Singer 2004, 185).\nSince the narrow concept of evil involves moral condemnation, it is\nappropriately ascribed only to moral agents and their actions. For\nexample, if only human beings are moral agents, then only human beings\ncan perform evil actions. Evil in this narrower sense is more often\nmeant when the term ‘evil’ is used in contemporary moral,\npolitical, and legal contexts. This entry will focus on evil in this\nnarrower sense. The entry will not discuss evil in the broad sense or\nthe problem of evil to any significant degree (these topics will be\ndiscussed briefly only in section 2).\n\nThe main issues discussed by philosophers on the topic of evil have\nbeen: Should we use the term ‘evil’ in our moral,\npolitical, and legal discourse and thinking, or is evil an out-dated\nor empty concept which should be abandoned? What is the relationship\nbetween evil and other moral concepts such as badness and wrongdoing?\nWhat are the necessary and sufficient conditions for evil action? What\nare the necessary and sufficient conditions for evil character? What\nis the relationship between evil action and evil character? What types\nof evil actions and characters can exist? What is the proper analysis\nof derivative concepts such as evil institution?\n\nThis entry gives an overview of answers to these questions found in\nthe literature.\n",
    "toc": [
        {
            "#EviSkeVerEviRev": "1. Evil-Skepticism Versus Evil-Revivalism"
        },
        {
            "#EviSup": "1.1 Evil and the Supernatural"
        },
        {
            "#EviExpPow": "1.2 Evil and Explanatory Power"
        },
        {
            "#DanEvi": "1.3 The Dangers of ‘Evil’"
        },
        {
            "#NieAttEvi": "1.3.1 Nietzsche’s Attack on Evil"
        },
        {
            "#ArgFavConEvi": "1.4 Arguments in Favor of the Concept of Evil"
        },
        {
            "#HisTheEvi": "2. The History of Theories of Evil"
        },
        {
            "#DuaPriTheEvi": "2.1 Dualist and Privation Theories of Evil"
        },
        {
            "#KanTheEvi": "2.2 Kant’s Theory of Evil"
        },
        {
            "#AreAnaEvi": "2.3 Arendt’s Analyses of Evil"
        },
        {
            "#ConTheEviAct": "3. Contemporary Theories of Evil Action"
        },
        {
            "#EviWro": "3.1 Evil and Wrongdoing"
        },
        {
            "#EviHar": "3.2 Evil and Harm"
        },
        {
            "#EviMot": "3.3 Evil and Motivation"
        },
        {
            "#EviAff": "3.4 Evil and Affect"
        },
        {
            "#EviRel": "3.5 Evil and Relation"
        },
        {
            "#EviRes": "3.6 Evil and Responsibility"
        },
        {
            "#Psy": "3.6.1 Psychopaths"
        },
        {
            "#BadUpb": "3.6.2 Bad Upbringings"
        },
        {
            "#Ign": "3.6.3 Ignorance"
        },
        {
            "#ConTheEviCha": "4. Contemporary Theories of Evil Character/Personhood"
        },
        {
            "#ActBasAcc": "4.1 Action-Based Accounts"
        },
        {
            "#AffBasAcc": "4.2 Affect-Based Accounts"
        },
        {
            "#MotBasAcc": "4.3 Motivation-Based Accounts"
        },
        {
            "#RegAcc": "4.4 Regularity Accounts"
        },
        {
            "#DisAcc": "4.5 Dispositional Accounts"
        },
        {
            "#AddThes": "4.6 Additional Theses About Evil Personhood"
        },
        {
            "#Fix": "4.6.1 The Fixity Thesis"
        },
        {
            "#Con": "4.6.2 The Consistency Thesis"
        },
        {
            "#Mir": "4.6.3 The Mirror Thesis"
        },
        {
            "#EviIns": "5. Evil Institutions"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Evil-Skepticism Versus Evil-Revivalism\n\nEvil-skeptics believe we should abandon the concept of evil. On this\nview we can more accurately, and less perniciously, understand and\ndescribe morally despicable actions, characters, and events using more\npedestrian moral concepts such as badness and wrongdoing. By contrast,\nevil-revivalists believe that the concept of evil has a place in our\nmoral and political thinking and discourse. On this view, the concept\nof evil should be revived, not abandoned (see Russell 2006 and\n2007).\n\nSomeone who believes that we should do away with moral discourse\naltogether could be called a moral-skeptic or a moral nihilist.\nEvil-skepticism is not as broad. Evil-skeptics believe the concept of\nevil is particularly problematic and should be abandoned while other\nmoral concepts, such as right, wrong, good, and bad, are worth\nkeeping.\n\nEvil-skeptics give three main reasons to abandon the concept of evil:\n(1) the concept of evil involves unwarranted metaphysical commitments\nto dark spirits, the supernatural, or the devil; (2) the concept of\nevil is useless because it lacks explanatory power; and (3) the\nconcept of evil can be harmful or dangerous when used in moral,\npolitical, and legal contexts, and so, it should not be used in those\ncontexts, if at all.\n1.1 Evil and the Supernatural\n\nThe concept of evil is often associated with supernatural powers or\ncreatures, especially in fictional and religious contexts. The\nmonsters of fictions, such as vampires, witches, and werewolves, are\nthought to be paradigms of evil. These creatures possess powers and\nabilities that defy scientific explanation, and perhaps human\nunderstanding. Many popular horror films also depict evil as the\nresult of dark forces or Satanic possession. We find similar\nreferences to supernatural forces and creatures when the term\n‘evil’ is used in religious contexts. Some evil-skeptics\nbelieve that the concept of evil necessarily makes reference to\nsupernatural spirits, dark forces, or creatures. According to these\ntheorists if we do not believe that these spirits, forces, or monsters\nexist, we should only use the term ‘evil’ in fictional\ncontexts, if at all (See Clendinnen 1999, 79–113; Cole 2006,\n2019).\n\nEvil-revivalists respond that the concept of evil need not make\nreference to supernatural spirits, dark forces, or monsters. There is\na secular moral concept of evil which is distinct from fictional or\nreligious conceptions, and it is this secular conception of evil that\nis meant most often when the term ‘evil’ is used in moral\nand political contexts (see Garrard 2002, 325; Card 2010,\n10–17). Evil-revivalists seek to offer plausible analyses of\nevil which do not make reference to supernatural spirits, dark forces,\nor monsters, but which fully capture secular uses of the term\n‘evil.’ Evil-revivalists believe that if they are able to\noffer plausible analyses of evil which do not make reference to the\nsupernatural, they will have successfully defended the concept of evil\nfrom the objection that ascriptions of evil necessarily imply\nunwarranted metaphysical commitments (see sections 3 and 4 for secular\naccounts of evil).\n1.2 Evil and Explanatory Power\n\nSome evil-skeptics argue that we should abandon the concept of evil\nbecause it lacks explanatory power and therefore is a useless concept\n(see, e.g., Clendinnen 1999, 79–113; Cole 2006, 2019;\nBaron-Cohen 2011). The concept of evil would have explanatory power,\nor be explanatorily useful, if it were able to explain why certain\nactions were performed or why these actions were performed by certain\nagents rather than by others. Evil-skeptics such as Inga Clendinnen\nand Philip Cole argue that the concept of evil cannot provide\nexplanations of this sort and thus should be abandoned.\n\nAccording to Clendinnen the concept of evil cannot explain the\nperformance of actions because it is an essentially dismissive\nclassification. To say that a person, or an action, is evil is just to\nsay that that person, or action, defies explanation or is\nincomprehensible (see Clendinnen 1999, 81; Baron-Cohen 2011, 5-7; see\nalso, Pocock 1985). (Joel Feinberg (2003) also believes that evil\nactions are essentially incomprehensible. But he does not think that\nwe should abandon the concept of evil for this reason.)\n\nSimilarly, Cole believes that the concept of evil is often employed\nwhen we lack a complete explanation for why an action was performed.\nFor instance, we might wonder why two ten-year-old boys, Robert\nThompson and Jon Venerables, tortured and murdered two-year-old James\nBulger while other ten-year-old boys with similar genetic\ncharacteristics and upbringings cause little harm? Cole believes that\nthe concept of evil is employed in these cases to provide the missing\nexplanation. However, Cole argues that the concept of evil does not\nprovide a genuine explanation in these cases because to say that an\naction is evil is just to say either that the action resulted from\nsupernatural forces or that the action is a mystery. To say that an\nevent resulted from supernatural forces is not to give a genuine\nexplanation of the event because these forces do not exist. To say\nthat an event is a mystery is not to give a genuine explanation of an\nevent, but rather, it is to suggest that the event cannot be explained\n(at least with the information currently available) (2006,\n6–9).\n\nEvil-revivalists have offered several responses to the objection that\nthe concept of evil should be abandoned because it is explanatorily\nuseless. One common response is that the concept of evil might be\nworth keeping for descriptive or prescriptive purposes even if it\nisn’t explanatorily useful (Garrard 2002, 323–325; Russell\n2009, 268–269).\n\nAnother common response is to argue that evil is no less explanatorily\nuseful than other moral concepts such as good, bad, right, and wrong\n(Garrard 2002, 322–326; Russell 2009, 268–269). Thus, if\nwe should abandon the concept of evil we should abandon these other\nmoral concepts as well.\n\nEve Garrard and Luke Russell also point out that even if the concept\nof evil cannot provide a complete explanation for the performance of\nan action, it can provide a partial explanation. For instance, Garrard\nargues that evil actions result from a particular kind of motivation.\nCall this an E-motivation. Thus, to say that an action is evil is to\nsay that it has resulted from an E-motivation. This provides a partial\nexplanation for why the action was performed. Furthermore, Garrard has\nargued that if evil actions result from particularly unsavory\nmotivational states then the concept of evil is able to explain why we\nreact with horror in the face of evil actions.  That is, we react with\nhorror in the face of evil actions because they result from\nparticularly despicable motivational states (Garrard 2019, 197. See\nalso, de Wijze 2019, 212). \n1.3 The Dangers of ‘Evil’\n\nSome evil-skeptics believe that we should abandon the concept of evil\nbecause it is too harmful or dangerous to use (See e.g., Cole 2006,\n21, and 2019; Held 2001, 107). No one can deny that the term\n‘evil’ can be harmful or dangerous when it is misapplied,\nused perniciously, or used without sensitivity to complicated\nhistorical or political contexts. For instance, it is likely that by\ncalling terrorists ‘evildoers’ and Iraq, Iran, and North\nKorea ‘the axis of evil’ former U.S. President George W.\nBush made it more likely that suspected terrorists would be mistreated\nand less likely that there would be peaceful relations between the\npeoples and governments of Iraq, Iran, and North Korea and the peoples\nand government of the United States.\n\nBut should we abandon the concept of evil because it leads to harm\nwhen it is misapplied or abused? Claudia Card argues that “If\nthe likelihood of the ideological abuse of a concept were sufficient\nreason to abandon the concept, we should probably abandon all\nnormative concepts, certainly ‘right’ and\n‘wrong.’” (Card 2010, 15) And yet evil-skeptics do\nnot believe that we should abandon all normative concepts. So why do\nthey believe that we should abandon the concept of evil?\n\nAn evil-skeptic might reply that we should abandon only the concept of\nevil, and not other normative concepts, because the concept of evil is\nparticularly dangerous or susceptible to abuse. We can discern several\nreasons why ascriptions of evil might be thought to be more harmful or\ndangerous than ascriptions of other normative concepts such as badness\nor wrongdoing. First, since ascriptions of evil are the greatest form\nof moral condemnation, when the term ‘evil’ is misapplied\nwe subject someone to a particularly harsh judgement undeservedly.\nFurthermore, it is reasonable to assume that evildoers not only\ndeserve the greatest form of moral condemnation but also the greatest\nform of punishment. Thus, not only are wrongfully accused evildoers\nsubjected to harsh judgments undeservedly, they may be subjected to\nharsh punishments undeservedly as well.\n\nAnother reason that ascriptions of evil can be particularly harmful or\ndangerous is that it isn’t always clear what people mean when\nthey use the term ‘evil.’ As Eve Garrard puts it\n“the general obscurity surrounding the term makes some thinkers\nvery reluctant to appeal to the idea of evil”(Garrard 2002,\n322). For instance, some people believe that to say that someone\nperformed an evil action implies that that person acted out of\nmalevolence (see e.g., Kekes 2005), while others believe that\nevildoing can result from many different sorts of motives, even good\nmotives (see e.g., Card 2002). Given this ambiguity, it might be\nunclear whether an attribution of evil attributes despicable\npsychological attributes to an evildoer, and this ambiguity might\nresult in an overly harsh judgment.\n\nOther ambiguities concerning the meaning of the term\n‘evil’ may be even more harmful. For instance, on some\nconceptions of evil, evildoers are possessed, inhuman, incorrigible,\nor have fixed character traits (See Cole 2006, 1–21 and 2019;\nRussell 2006, 2010, and 2014; Haybron 2002a and 2002b). These\nmetaphysical and psychological theses about evildoers are\ncontroversial. Many who use the term ‘evil’ do not mean to\nimply that evildoers are possessed, inhuman, incorrigible, or that\nthey have fixed character traits. But others do. If evildoers have\nthese traits, and thus will continue to perform evil actions no matter\nwhat we do, the only appropriate response might be to isolate them\nfrom society or to have them executed. But if evildoers do not have\nthese fixed dispositions and they are treated as if they do, they will\nlikely be mistreated.\n\nThus, while most theorists agree that the concept of evil can be\nharmful or dangerous there is considerable disagreement about what\nconclusion should be drawn from this fact. Evil-skeptics believe that\nbecause the concept of evil is harmful or dangerous we should abandon\nit in favour of less dangerous concepts such as badness and\nwrongdoing. Evil-revivalists believe that because the concept of evil\nis harmful or dangerous more philosophical work needs to be done on it\nto clear up ambiguities and reduce the likelihood of abuse or misuse.\nCard and Kekes argue that it is more dangerous to ignore evil than to\ntry to understand it (Card 2002 and 2010; Kekes 1990). For if we do\nnot understand evil we will be ill-equipped to root out its sources,\nand thus, we will be unable to prevent evils from occurring in the\nfuture.\n1.3.1 Nietzsche’s Attack on Evil\n\nThe most celebrated evil-skeptic, nineteenth century German\nphilosopher Friedrich Nietzsche, also argues that the concept of evil\nshould be abandoned because it is dangerous. Like contemporary\nevil-skeptics whom he inspired, Nietzsche argues that the concept\nof evil should be abandoned because it does not describe a moral\nreality, but instead, is merely used to demonize enemies. In addition,\nhe also argues that the concept of evil is dangerous because it\nhas negative effects on human potential and vitality by promoting the\nweak in spirit and suppressing the strong. In On the Genealogy of\nMorality: A Polemic, Nietzsche argues that the concept of evil\narose from the negative emotions of envy, hatred, and resentment (he\nuses the French term ressentiment to capture an attitude that\ncombines these elements). He contends that the powerless and weak\ncreated the concept of evil to take revenge against their oppressors.\nNietzsche believes that the concepts of good and evil contribute to an\nunhealthy view of life which judges relief from suffering as more\nvaluable than creative self-expression and accomplishment. For this\nreason Nietzsche believes that we should seek to move beyond\njudgements of good and evil (Nietzsche 1886 and 1887).\n\nNietzsche’s skeptical attack on the concept of evil has\nencouraged philosophers to ignore the nature and moral significance of\nevil and instead focus on the motives people might have for using the\nterm ‘evil’ (Card 2002, 28; Cole 2019, 178).\n\nIn the Atrocity Paradigm, Claudia Card defends the concept of\nevil from Nietzsche’s skeptical attack (Card 2002, 27–49).\nCard rejects Nietzsche’s view that ascriptions of evil merely\ndemonize enemies and indicate a negative life-denying perspective.\nInstead, she argues that judgments of evil often indicate a healthy\nrecognition that one has been treated unjustly. Eve Garrard and David\nMcNaughton go even further in their rejection of Nietzsche’s\nform of evil-skepticism, arguing that it is morally objectionable to\nquestion ascriptions of evil by victims of atrocious crimes (Garrard\nand McNaughton 2012, 11–14).\n\nCard also argues that we have just as much reason to question the\nmotives of people who believe we should abandon the concept of evil as\nwe do to question the motives of people who use the concept. She\nsuggests that people who want to abandon the concept of evil may be\noverwhelmed by the task of understanding and preventing evil and would\nrather focus on the less daunting task of questioning the motives of\npeople who use the term (Card 2002, 29).\n1.4 Arguments in Favor of the Concept of Evil\n\nSome people believe that we should not abandon the concept of evil\nbecause only the concept of evil can capture the moral significance of\nacts, characters, and events such as sadistic torture, serial killers,\nHitler, and the Holocaust. As Daniel Haybron puts it “Prefix\nyour adjectives [such as ‘wrong’ or ‘bad’]\nwith as many ‘very’s as you like; you still fall short.\nOnly ‘evil’, it seems, will do” (Haybron 2002b,\n260). According to this line of argument, it is hard to deny that evil\nexists; and if evil exists, we need a concept to capture this immoral\nextreme. Eve Garrard and David McNaughton argue similarly that the\nconcept of evil captures a distinct part of our moral phenomenology,\nspecifically, “collect[ing] together those wrongful actions to\nwhich we have ... a response of moral horror” (Garrard and\nMcNaughton 2012, 13–17).\n\nA second argument in favour of the concept of evil is that it is only\nby facing evil, i.e., by becoming clear about its nature and origins,\nthat we can hope to prevent future evils from occurring and live good\nlives (Kekes 1990, Card 2010).\n\nA third reason to keep the concept of evil is that categorizing\nactions and practices as evil helps to focus our limited energy and\nresources. If evils are the worst sorts of moral wrongs, we should\nprioritize the reduction of evil over the reduction of other wrongs\nsuch as unjust inequalities. For instance, Card believes that it is\nmore important to prevent the evils of domestic violence than it is to\nensure that women and men are paid equal wages for equal work (Card\n2002, 96–117).\n\nA fourth reason not to abandon the concept of evil is that by\ncategorizing actions and practices as evil we are better able to set\nlimits to legitimate responses to evil. By having a greater\nunderstanding of the nature of evil we are better able to guard\nagainst responding to evil with further evils (Card 2010,\n7–8).\n2. The History of Theories of Evil\n\nPrior to World War II there was very little philosophical literature\non the concept of evil in the narrow sense. However, philosophers have\nconsidered the nature and origins of evil in the broad sense since\nancient times. Although this entry is primarily concerned with evil in\nthe narrow sense, it is useful to survey the history of theories of\nevil in the broad sense since these theories provide the backdrop\nagainst which theories of evil in the narrow sense have been\ndeveloped.\n2.1 Dualist and Privation Theories of Evil\n\nThe history of theories of evil began with attempts to solve the\nproblem of evil, i.e., attempts to reconcile the existence of evil (in\nthe broad sense) with an all-powerful, all-knowing, all-good God or\ncreator. Philosophers and theologians have recognized that to solve\nthe problem of evil it is important to understand the nature of evil.\nAs the Neoplatonist Plotinus put it “Those inquiring whence Evil\nenters into beings, or rather into a certain order of beings, would be\nmaking the best beginning if they established, first of all, what\nprecisely Evil is” (Plotinus, Enneads, I, 8, 1).\n\nOne theory of evil that provides a solution to the problem of evil is\nManichaean dualism. According to Manichaean dualism, the universe is\nthe product of an ongoing battle between two coequal and coeternal\nfirst principles: God and the Prince of Darkness. From these first\nprinciples follow good and evil substances which are in a constant\nbattle for supremacy. The material world constitutes a stage of this\ncosmic battle where the forces of evil have trapped the forces of\ngoodness in matter. For example, the human body is evil while the\nhuman soul is good and must be freed from the body through strict\nadherence to Manichaean teaching. The Manichaean solution to the\nproblem of evil is that God is neither all-powerful nor the sole\ncreator of the world. God is supremely good and creates only good\nthings, but he or she is powerless to prevent the Prince of Darkness\nfrom creating evil. (For more about Manichaeanism see Coyel 2009 and\nLieu 1985; Greenless 2007).\n\nSince its inception, Manichaean dualism has been criticized for\nproviding little empirical support for its extravagant cosmology. A\nsecond problem is that, for a theist, it is hard to accept that God is\nnot an all-powerful sole creator. For these reasons influential, early\nChristian philosophers such as Saint Augustine, who initially accepted\nthe Manichaean theory of evil, eventually rejected it in favor of the\nNeoplatonist approach. (See Augustine, Confessions; On\nthe Morals of the Manichaeans; Reply to Manichaeus;\nBurt, Augustine’s World.)\n\nAccording to the Neoplatonists, evil does not exist as a substance or\nproperty but instead as a privation of substance, form, and goodness\n(Plotinus, Enneads, I, 8; See also O’Brien 1996). For\ninstance, the evil of disease consists in a privation of health, and\nthe evil of sin consist in a privation of virtue. The Neoplatonist\ntheory of evil provides a solution to the problem of evil because if\nevil is a privation of substance, form, and goodness, then God creates\nno evil. All of God’s creation is good, evil is a lack of being\nand goodness.\n\nOne problem with the privation theory’s solution to the problem\nof evil is that it provides only a partial solution to the problem of\nevil since even if God creates no evil we must still explain why God\nallows privation evils to exist (See Calder 2007a; Kane 1980). An even\nmore significant problem is that the privation theory seems to fail as\na theory of evil since it doesn’t seem to be able to account for\ncertain paradigmatic evils. For instance, it seems that we cannot\nequate the evil of pain with the privation of pleasure or some other\nfeeling. Pain is a distinct phenomenological experience which is\npositively bad and not merely not good. Similarly, a sadistic torturer\nis not just not as good as she could be. She is not simply lacking in\nkindness or compassion. She desires her victims’ suffering for\npleasure. These are qualities she has, not qualities she lacks, and\nthey are positively bad and not merely lacking in goodness (Calder\n2007a; Kane 1980. See Anglin and Goetz 1982 and Grant 2015 for replies\nto these objections).\n2.2 Kant’s Theory of Evil\n\nImmanuel Kant, in his Religion Within the Limits of Reason\nAlone, was the first to offer a purely secular theory of evil,\ni.e., a theory that does not make reference to supernatural or divine\nentities and which is not developed as a response to the problem of\nevil. Kant’s concern is to make sense of three apparently\nconflicting truths about human nature: (1) we are radically free, (2)\nwe are by nature inclined toward goodness, (3) we are by nature\ninclined toward evil.\n\nKant’s thoughts on evil and morality have had an important\ninfluence on subsequent philosophers writing about the nature of evil\nsuch as Hanna Arendt, Claudia Card, and Richard Bernstein. However,\nmost theorists acknowledge that Kant’s theory is disappointing\nas a theory of evil in the narrow sense since it does not pick out\nonly the morally worst sorts of actions and characters. (See, e.g.,\nCard 2010, 37). Instead, Kant equates evil with having a will that is\nnot fully good.\n\nAccording to Kant, we have a morally good will only if we choose to\nperform morally right actions because they are morally right (Kant\n1785, 4: 393–4:397; Kant 1793, Bk I). On Kant’s view,\nanyone who does not have a morally good will has an evil will. There\nare three grades of evil which can be seen as increasingly more evil\nstages of corruption in the will. First there is frailty. A person\nwith a frail will attempts to perform morally right actions because\nthese actions are morally right, but she is too weak to follow through\nwith her plans. Instead, she ends up doing wrong due to a weakness of\nwill (Kant 1793, Bk I, 24–25).\n\nThe next stage of corruption is impurity. A person with an impure will\ndoes not attempt to perform morally right actions just because these\nactions are morally right. Instead, she performs morally right actions\npartly because these actions are morally right and partly because of\nsome other incentive, e.g., self-interest. Someone with an impure will\nperforms morally right actions, but only partly for the right reason.\nKant believes that this form of defect in the will is worse than\nfrailty even though the frail person does wrong while the impure\nperson does right. Impurity is worse than frailty because an impure\nperson has allowed an incentive other than the moral law to guide her\nactions while the frail person tries, but fails, to do the right thing\nfor the right reason (Kant 1793, Bk I, 25–26).\n\nThe final stage of corruption is perversity, or wickedness. Someone\nwith a perverse will inverts the proper order of the incentives.\nInstead of prioritizing the moral law over all other incentives, she\nprioritizes self-love over the moral law. Thus, her actions conform to\nthe moral law only if they are in her self-interest. Someone with a\nperverse will need not do anything wrong because actions which best\npromote her self-interest may conform to the moral law. But since the\nreason she performs morally right actions is self-love and not because\nthese actions are morally right, her actions have no moral worth and,\naccording to Kant, her will manifests the worst form of evil possible\nfor a human being. Kant considers someone with a perverse will an evil\nperson (Kant 1793, Bk I, 25).\n\nMost contemporary theorists reject Kant’s view that the worst\nform of evil involves prioritizing self-interest over the moral law\n(See, e.g., Card 2010, 37 and 2002; Garrard 2002; Kekes 2005).\nWhether, and to what extent, a person, or her will, is evil seems to\ndepend on details about her motives and the harms she brings about and\nnot just on whether she prioritizes self-interest over the moral law.\nFor instance, it seems far worse to torture someone for sadistic\npleasure than to tell the truth to gain a good reputation. In fact, it\nseems reasonable to suppose that the first act (sadistic torture)\nindicates an evil will while the second act (telling the truth for\nself-interest) indicates a will that is merely lacking in moral\ngoodness. But for Kant, both acts indicate wills that are equally evil\n(for attempts to address this criticism see Garcia 2002, Goldberg\n2017, and Timmons 2017).\n\nKant makes several other controversial claims about the nature of evil\nin Religion Within the Limits of Reason Alone. One of these\nclaims is that there is a radical evil in human nature. By this he\nmeans that all human beings have a propensity to subordinate the moral\nlaw to self-interest and that this propensity is radical, or rooted,\nin human nature in the sense that it is inextirpable. Kant also\nbelieves that we are imputable for this propensity to evil (Kant 1793,\nBk I). Richard Bernstein argues that Kant cannot coherently hold both\nof these theses since we could not be responsible for a propensity\nthat is in us originally and that we cannot be rid of (Bernstein 2002,\n11–35). Notwithstanding this important criticism, several\nphilosophers have argued that Kant’s thoughts on radical evil\noffer important insights into the nature of evil. For example, Paul\nFormosa argues that Kant’s reflections on radical evil draw our\nattention to the fact that even the best of us can revert to evil, and\nthus, that we must be constantly vigilant against the radical evil of\nour natures (Formosa 2007. See also, Bernstein 2002 and Goldberg\n2017).\n\nIn his Confessions, Saint Augustine tells us that one day he\nstole some pears for the sole sake of doing something wrong\n(Augustine, Confessions, II, v-x). Kant rejects the idea that\nhuman beings can be motivated in this way (Kant 1793, Bk I, sect. 2).\nFor Kant, human beings always have either the moral law or self-love\nas their incentive for acting. Only a devil could do what is wrong\njust because it is wrong. (For more about Kant and diabolical evil see\nBernstein 2002, 36–42; Card 2010 and 2016, 36–61; Allison\n2001, 86–100; and Timmons 2017, 319–327).\n2.3 Arendt’s Analyses of Evil\n\nSecular analyses of the concept of evil in the narrow sense began in\nthe twentieth century with the work of Hanna Arendt. Arendt’s\nthoughts on the nature of evil stem from her attempt to understand and\nevaluate the horrors of the Nazi death camps. In the Origins of\nTotalitarianism (1951), Arendt borrows Kant’s term\n‘radical evil’ to describe the evil of the Holocaust.\nHowever, Arendt does not mean what Kant means by ‘radical\nevil’ (see section 2.2 for Kant’s view of radical evil).\nInstead, Arendt uses the term to denote a new form of wrongdoing which\ncannot be captured by other moral concepts. For Arendt, radical evil\ninvolves making human beings as human beings superfluous. This is\naccomplished when human beings are made into living corpses who lack\nany spontaneity or freedom. According to Arendt a distinctive feature\nof radical evil is that it isn’t done for humanly understandable\nmotives such as self-interest, but merely to reinforce totalitarian\ncontrol and the idea that everything is possible (Arendt 1951,\n437–459; Bernstein 2002, 203–224).\n\nIn Origins of Totalitarianism Arendt’s analysis of evil\nfocuses on evils which results from systems put in place by\ntotalitarian regimes. Her analysis does not address the character and\nculpability of individuals who take part in the perpetration of evil.\nIn Eichmann in Jerusalem: A Report on the Banality of Evil,\nArendt turns her attention to individual culpability for evil through\nher analysis of the Nazi functionary Adolf Eichmann who was tried in\nJerusalem for organizing the deportation and transportation of Jews to\nthe Nazi concentration and extermination camps. Arendt went to\nJerusalem in 1961 to report on Eichmann’s trial for The New\nYorker magazine. In Eichmann in Jerusalem, she argues\nthat “desk murderers” such as Eichmann were not motivated\nby demonic or monstrous motives. Instead, “It was sheer\nthoughtlessness—something by no means identical with\nstupidity—that predisposed [Eichmann] to become one of the\ngreatest criminals of that period” (Arendt 1963, 287–288).\nAccording to Arendt, Eichmann’s motives and character were banal\nrather than monstrous. She describes him as a “terrifyingly\nnormal” human being who simply did not think very deeply about\nwhat he was doing.\n\nArendt’s reflections on Eichmann and her concept of the banality\nof evil have been both influential and controversial (For theorists\nwho believe Arendt’s thoughts are particularly pertinent today,\nsee Bar On 2012 and Bernstein 2008. For a discussion of the\ncontroversy see Young-Bruehl 1982). Some theorists take Arendt’s\nthesis of the banality of evil as a datum to be explained. For\ninstance, social psychologists Stanley Milgram (1974) and Philip\nZimbardo (2007) have attempted to explain how social conditions can\nlead ordinary people to perform evil actions. Others have contested\nArendt’s suggestion that ordinary people can be regular sources\nof evil (see Card 2010; Calder 2003 and 2009).\n\nThere is also controversy concerning the relationship between\nArendt’s notions of radical and banal evil. In a letter she\nwrote to Gershom Scholem in response to some critical\ncomments he made about Eichmann in Jerusalem, Arendt\nwrites “You are completely right that I have changed my mind and\nno longer speak of radical evil” (Arendt and Scholem 2017, 209). This\nsuggests that by the time Arendt wrote Eichmann in\nJerusalem she had abandoned the notion of radical evil.\nHowever, several Arendt scholars reject this view (Berstein 2002;\nBirmingham 2019). For example, Peg Birmingham argues that “Arendt\nnever wavers in her claim that extreme [or radical] evil is the\nsystematic production of perfect superfluousness” (Birmingham 2019,\n160). According to Birmingham, “[Arendt’s] account of the\nbanality of evil is an account of the production of the moral\nthoughtlessness that is concomitant with [radical evil]. They are\ninterdependent” (Birmingham 2019, 160). \n3. Contemporary Theories of Evil Action\n\nSpurred on by Arendt’s work, and dissatisfied with analyses of\nevil found in the history of philosophy, several theorists since the\n1980s have sought to offer necessary and sufficient conditions for\nevil. Some theorists focus on evil character, or evil personhood, as\nthe root concept of evil (See, e.g., Haybron 2002b, 280; Perrett 2002,\n304–305; Singer 2004, 190). These theorists consider the concept\nof evil action to be a derivative concept, i.e., they define an evil\naction as the sort of action that an evil person performs. But just as\nmany theorists, or more, believe that the concept of evil action is\nthe root concept of evil (See, e.g., Garrard 1998, 44; Russell 2014,\n31–34; Kekes 2005, 2; Thomas 1993, 74–82). These theorists\nconsider the concept of evil personhood to be a derivative concept,\ni.e., they define an evil person as someone who performs, or is prone\nto perform, evil actions. Some theorists who believe that evil action\nis the root concept believe that only one or two component properties\nare essential for evil action, while others believe that evil action\nhas a multitude of essential components. This section discusses\ndifferent views about the essential components of evil action.\n3.1 Evil and Wrongdoing\n\nMost philosophers, and laypeople, assume that wrongfulness is an\nessential component of evil action (See e.g., Card 2002, Garrard 1998,\nFormosa 2008). It seems that, to be evil, an action must, at least, be\nwrong. However, this claim is not universally accepted (Calder 2013).\nThe central question for most theorists is: what more is required for\nevil than mere wrongdoing? One controversial answer to this question\nis that nothing more is required: an evil action is just a very\nwrongful action (Russell 2007 and 2014). This position is resisted by\nmost evil-revivalists who claim instead that evil is qualitatively,\nrather than merely quantitatively, distinct from mere wrongdoing (See,\ne.g., Steiner 2002; Garrard 1998 and 2002; Calder 2013 and\n2019).\n\nTo determine whether evil is qualitatively distinct from mere\nwrongdoing we must first understand what it is for two concepts to be\nqualitatively distinct. According to some theorists two concepts are\nqualitatively distinct if, and only if, all instantiations of the\nfirst concept share a property which no instantiation of the second\nconcept shares (Steiner 2002; Garrard 1998, 2002; Russell, 2007). For\ninstance, Hillel Steiner claims that “evil acts are\ndistinguished from ordinary wrongs through the presence of an extra\nquality that is completely absent in the performance of ordinary\nwrongs” (Steiner 2002, 184). According to Steiner, the extra\nquality shared by all evil actions and lacking from merely wrongful\nactions, is the perpetrator’s pleasure; evil action consists in\ntaking pleasure in doing wrong. No merely wrongful action is\npleasurable for its doer (for more about Steiner’s theory of\nevil see Section 3.4).\n\nTodd Calder (2013) disputes this understanding of what it is for two\nconcepts to be qualitatively distinct, arguing instead that two\nconcepts are qualitatively distinct provided they do not share all of\ntheir essential properties. Thus, evil actions are qualitatively\ndistinct from merely wrongful actions provided the essential\nproperties of evil actions are not also the essential properties of\nmerely wrongful actions but had to a greater degree.\n\nCalder argues that on plausible theories of evil and wrongdoing, evil\nand wrongdoing do not share all of their essential properties, and\nthus, evil and wrongdoing are qualitatively distinct. For instance,\nCalder argues that it is an essential property of evil actions that\nthe evildoer intends that his victim suffer significant harm while it\nis not an essential property of wrongful actions that the wrongdoer\nintend to cause harm. For instance, cheating, lying, and risky\nbehaviour can be wrongful even if the wrongdoer does not intend to\ncause harm (Calder 2013).\n\nHallie Liberto and Fred Harrington go even further than Calder in\narguing that two concepts can be non-quantitatively distinct even\nthough instantiations of the two concepts share properties (Liberto\nand Harrington 2016). According to Liberto and Harrington, two\nconcepts are non-quantitatively distinct provided one of the concepts\nhas a property which determines the degree to which that concept is\ninstantiated that does not determine the degree to which the second\nconcept is instantiated. For instance, Liberto and Harrington suggest\nthat both altruistic and heroic actions have the following essential\nproperties: (1) they are performed for the sake of others, and (2)\nthey are performed at some cost or risk to the agent. However, the\ndegree to which an action is altruistic is determined by the degree to\nwhich it is performed for the sake of others (and not by the degree to\nwhich it is performed at some cost or risk to the agent) while the\ndegree to which an action is heroic is determined by the degree to\nwhich it is performed at some cost or risk to the agent (and not by\nthe degree to which it is performed for the sake of others). They call\nthis form of concept distinctness “quality of emphasis\ndistinctness” (Liberto and Harrington 2016, 1595).\n\nImportantly, if Liberto and Harrington are right that two concepts can\nbe non-quantitatively distinct by being quality of emphasis distinct,\nthen Calder is wrong to think that two concepts can be\nnon-quantitatively distinct only if they do not share all of their\nessential properties. Liberto and Harrington argue further that evil\nand wrongdoing are non-quantitatively distinct in the sense of being\nquality of emphasis distinct. Consider, for example, Claudia\nCard’s theory of evil according to which “evil is\nreasonably foreseeable intolerable harm, produced by inexcusable\nwrongs” (Card 2010, 16). Liberto and Harrington argue that using\nthis theory we could say that degrees of evil are determined by\ndegrees of harm, while degrees of wrongdoing are not. If so, evil and\nwrongdoing are non-quantitatively distinct by being quality of\nemphasis distinct. (For a rebuttal of Liberto’s and Harrington’s\nquality of emphasis account of non-quantitative distinctness see\nCalder 2019, 225–226.)\n3.2 Evil and Harm\n\nMost theorists writing about the concept of evil believe that evil\nactions must cause or allow significant harm to at least one victim\n(see, e.g., Card 2002; Kekes 2005; Veltlesen 2005; Calder 2013 and\n2019; Formosa 2013 and 2019; Goldberg 2019). However, three sorts of\narguments have been used to contest this claim.\n\nFirst, some theorists argue that evil actions need not cause or allow\nsignificant harm because we can perform evil actions by attempting (or\nseriously risking) to cause harm, even if we fail. For example, on\nthis view, it would be evil to attempt to detonate a bomb in a room\nfull of innocent people, even if the attempt is thwarted by the police\n(See Kramer 2011, 204–205; Russell 2014 52–53; Formosa\n2019, 263–262).\n\nSecond, some theorists argue that evil actions need not cause or allow\nsignificant harm because we can perform evil actions by merely taking\npleasure in a victim’s suffering (Calder 2002, 56; Garrard 2002,\n327; Kramer 2011, 211; Formosa 2019, 262–263). For instance, imagine\nthat Alex takes pleasure in witnessing Carol’s extreme\nsuffering, but that Alex does not cause Carol’s suffering. Some\npeople would call this act of sadistic voyeurism evil even though it\ncauses no additional harm to the victim (we can imagine that Carol is\nnot aware that Alex takes pleasure in her suffering so that the\nwitnessing of her suffering does not aggravate the harm). \n\nTheorists who believe that cases of failed attempts and/or sadistic\nvoyeurism show that evil actions need not cause or allow significant\nharm nevertheless tend to believe that evil actions must be connected\nin an appropriate way to significant harm (See, e.g., Kramer 2011,\n203–223; Russell 2007, 676; Formosa 2019, 262–265). However,\nothers dispute this contention. These theorists argue instead that\nthere can be cases of “small-scale evil” where evil\nactions involve very little or no harm (De Wijze 2018; Garrard 1998\nand 2002; Morton 2004, 60). These cases constitute the third sort of\nargument against the claim that evil actions must cause or allow\nsignificant harm. For example Eve Garrard has suggested that\nschoolyard bullies perform evil actions even though they do not cause\nvery much harm (Garrard 1998, 45), while Stephen de Wijze has argued\nthat torturing and killing what you know to be a lifelike robot would\nbe evil even if the robot has no conscious life (De Wijze 2018,\n34).\n\nTwo sorts of responses can be given to these sorts of cases. First, we\ncan argue that, while the action in question is evil, it does, in\nfact, involve significant harm. This sort of response seems\nappropriate for the bullying case (See Kramer 2011, 218). Second, we\ncan argue that, while the action in question wouldn’t be\nharmful, it wouldn’t be evil either. This sort of response seems\nappropriate for the robot case.\n\nFurthermore, in response to all three arguments for the claim that\nevil actions need not cause or allow significant harm (i.e. failed\nattempts, sadistic voyeurs, and small-scale evil), we can argue that\ntheorists who deploy these arguments confuse evil actions with evil\ncharacters. For example, we can argue that failed attempts seem evil\nbecause attempting to perform an evil action is an indication that the\nagent performing the action has an evil character and not because the\naction itself is evil (See Calder 2015a, 121). Similarly, we can argue\nthat given their intentions, motives, and feelings, sadistic voyeurs\nand robot torturers are evil persons even though they do not perform\nevil actions (for more about evil character see Section 4).\n\nAssuming that harm is an essential component of evil, the question\nthen becomes how much, or what type of, harm is required for evil? In\nthe Roots of Evil John Kekes argues that the harm of evil\nmust be serious and excessive (Kekes 2005, 1–3). In an earlier\nwork, Kekes specifies that a serious harm is one that\n“interferes with the functioning of a person as a full-fledged\nagent.” (Kekes 1998, 217). Claudia Card describes the harm of\nevil as an intolerable harm. By an intolerable harm, Card means a harm\nthat makes life not worth living from the point of view of the person\nwhose life it is. Examples of intolerable harms include severe\nphysical or mental suffering as well as the deprivation of basics such\nas food, clean drinking water, and social contact (Card 2002, 16).\nAccording to Paul Formosa, evil actions involve significant harms,\nwhich are typically instantiated by life-ending, life-wrecking, or\nseverely autonomy impairing harms (Formosa 2013 and 2019). (For\nfurther discussion of the harm component see Russell 2014,\n64–68).\n3.3 Evil and Motivation\n\nMost theorists writing about evil believe that evil action requires a\ncertain sort of motivational state. Once again, this claim is somewhat\ncontroversial. In the Atrocity Paradigm, Claudia Card makes a\npoint of defining evil without reference to perpetrator motives. She\ndoes this because she wants her theory to focus on alleviating the\nsuffering of victims rather than on understanding the motives of\nperpetrators (Card 2002, 9). Card’s theory also has the virtue\nof being able to count as evil actions which stem from a variety of\nmotives.\n\nHowever, while Card claims that the atrocity paradigm does not have a\nmotivation component, part of the plausibility of her theory comes\nfrom the fact that it restricts the class of evil actions to\nthose that follow from certain sorts of motives. Card’s theory\nof evil is “that evils are reasonably foreseeable intolerable\nharms produced by inexcusable wrongs” (Card 2010, 16). While\nthis account of evil allows for a wide range of motivations, it does\nspecify that evildoers must foresee the harm they produce and lack a\nmoral justification for producing the harm. In other words, for Card,\nevildoers are motivated by a desire for some object or state of\naffairs which does not justify the harm they foreseeably inflict.\n\nOther philosophers have suggested that evildoers desire to cause harm,\nor to do wrong, for more specific reasons such as pleasure (Steiner\n2002), the desire to do what is wrong (Perrett 2002), the desire to\nannihilate all being (Eagleton 2010), or the destruction of others for\nits own sake (Cole 2006). When evil is restricted to actions that\nfollow from these sorts of motivations, theorists sometimes say that\ntheir subject is pure, radical, diabolical, or monstrous evil. This\nsuggests that their discussion is restricted to a type, or form, of\nevil and not to evil per se.\n\nWhile some philosophers argue that certain motives, such as\nmalevolence or malice, are necessary for evil, others focus instead on\nmotives or desires that evildoers lack. For instance, Adam Morton\ncontends that evildoers are crucially uninhibited by barriers against\nconsidering harming or humiliating others that ought to be there\n(Morton 2004, 57). Similarly, Laurence Thomas contends that one\ndistinctive feature of an evildoer is that “whereas normally a\nperson’s moral sensibilities would get in the way of his\nperforming an act of such moral gravity [i.e., one that results in\nserious harm], this does not happen when a person performs an evil\nact” (Thomas 1993, 77).\n\nEve Garrard’s theory of evil also focuses on a deficiency in the\nmotivational structure of the evildoer. To understand Garrard’s\ntheory of evil we need to understand the difference between\nmetaphysical and psychological silencers. A metaphysical silencer is a\nreason which is so weighty that, objectively speaking, it takes away\nthe reason-giving force of some other consideration. When this happens\nwe say that the less weighty consideration has been metaphysically\nsilenced. By contrast, a psychological silencer is a reason which is\nso weighty for an individual that, subjectively, it takes\naway the reason-giving force of some other consideration. When this\nhappens we say that the consideration has been psychologically\nsilenced for the individual.\n\nConsider Peter Singer’s case of coming across a child drowning\nin a shallow pond (Singer 1972). If we came across a child drowning in\na shallow pond, the need to rescue the child would be so morally\nimportant that it would metaphysically silence the desire to keep our\nclothes clean as a reason for acting or not acting. That is, when a\nchild is in urgent need of rescue, considerations about keeping our\nclothes clean lose all of their reason-giving force. They cease to be\nreasons for acting or not acting. For many people, especially for\nvirtuous people, considerations about keeping their clothes clean are\nalso psychologically silenced by the urgent need to rescue a child\ndrowning in a shallow pond. In other words, virtuous people are\ncompletely unmoved by considerations about keeping their clothes clean\nwhen presented with children in urgent need of rescue.\n\nAccording to Garrard, the evildoer has a particularly despicable\nmotivational structure. She psychologically silences considerations\nthat are so morally weighty that they metaphysically silence the very\nconsiderations which move her to act (Garrard 1998, 55. See also\nGarrard 2002 and 2019). For instance, it would be evil to\npsychologically silence the urgent need to rescue a drowning child as\na reason for acting because we desire to keep our clothes clean.\n\nCritics of Garrard’s theory of evil argue that it is too\nrestrictive since it does not count as evil actions which cause, or\nallow, significant harm for no good reason when the agent is slightly\nmotivated by morally important considerations (Russell 2007, 675;\nCalder 2015a, 118). For instance, on Garrard’s theory it would\nnot be evil for John to allow a child to drown in a shallow pond if he\nwas slightly motivated to rescue her but not motivated enough to dirty\nhis clothes. Yet it seems that John would do evil by allowing a child\nto drown for those reasons.\n\nOther theorists have developed mixed accounts of the motivational\ncomponent of evildoing. According to these theorists, some forms of\nevildoing are partly constituted by lacking motives\nthat ought to exist while others are partly constituted by having\nbad motives. For example, Matthew Kramer argues that evil actions are\nmotivated by either sadism, heartlessness, or recklessness (Kramer\n2011, 187–203). Paul Formosa argues, contra Kramer, that some evil\nactions follow from other motives—not sadism, heartlessness, or\nrecklessness—such as anger or fear, and that any attempt to\nconstruct a list of motivating states for evil action is bound to be\nincomplete or ad hoc (Formosa 2019, 261). Rather than offer a list of\npossible motivating states for evil action, Todd Calder’s motivational\ncomponent of evildoing states that to perform an evil action\nan agent must desire his victim’s significant harm (or\nstates of affairs inconsistent with the absence of this\nharm) for an unworthy goal, where an unworthy goal is a goal which\n“if attained, would not make for a better state of affairs than\nif the harm was averted and the goal not attained” (Calder 2015a, 120.\nSee also Calder 2003, 266–267).\n3.4 Evil and Affect\n\nSome theorists believe that a perpetrator’s feelings or emotions at\nthe time of acting are relevant to whether an action is evil. For\nexample, Laurence Thomas believes that evildoers take delight in\ncausing harm or feel hatred toward their victims (Thomas 1993,\n76–77. See also Formosa 2019, 264). Hillel Steiner goes even\nfurther by contending that there are just two components of evil:\npleasure and wrongdoing. According to Steiner “[e]vil acts are\nwrong acts that are pleasurable for their doer” (Steiner 2002,\n189).\n\nCritics of Steiner’s view argue that it is neither necessary nor\nsufficient for evil to take pleasure in performing wrongful actions.\nCritics argue that it is not necessary to take pleasure in doing wrong\nto perform an evil action since it is sufficient to intentionally\ncause significant harm for an unworthy goal such as self-interest\n(Calder 2013). Imagine that a serial killer tortures and kills his\nvictims but that he does not take pleasure in torturing and killing.\nIt seems that this serial killer is an evildoer even though he does\nnot take pleasure in doing wrong.\n\nCritics of Steiner’s view argue that it is not sufficient for\nperforming an evil action to take pleasure in performing a wrongful\naction since we would not think that it was evil to take pleasure in\nperforming a wrongful action if the victim did not suffer significant\nharm. For instance, it wouldn’t be evil to take pleasure in\ntelling a white lie (Russell 2007).\n3.5 Evil and Relation\n\nSome theorists argue that the relationship between perpetrators and\nvictims is an important element of evil action. For example, Nel\nNoddings (1989) argues that a primary form of evil consists in\nneglecting relations, while Zachary Goldberg (2019) argues that to\nfully understand evil we must understand the asymmetric power\nrelations that exist between perpetrators and victims. Todd Calder\n(2022) argues that to make sense of the difference between evil action\nand complicity in evil we must incorporate a relational component into\nour theory of evil action. According to Calder’s relational\ncomponent, to perform an evil action we must be close to our victim or\ntheir harm (either socially, physically, or agentially). Calder\ncontends that if the relational component is not satisfied the\nconnection between a perpetrator’s actions and their\nvictim’s harm is too tenuous to support a charge of evil action\nand can, at most, support a charge of complicity in evil (Calder 2022,\n474–475).\n\nOther questions concerning the relationship between perpetrators of\nevil and their victims center on the relationship between evil and\nforgiveness. Some theorists define evil as the unforgivable. Others\nargue that it should be up to victims to decide whether perpetrators\nof evil can be forgiven (Norlock 2019, 283–285). Other interesting\nquestions concerning the relationship between evil and forgiveness\ninclude whether forgiveness requires reconciliation, whether only the\ndirect victims of evil can forgive perpetrators, and whether victims\nof evil can be obligated to forgive, or to not forgive. (See Norlock\n2019; MacLachlin 2009; Thomas 2009).\n3.6 Evil and Responsibility\n\nIt is universally accepted that to perform an evil action an agent\nmust be morally responsible for what she does. Although hurricanes and\nrattle snakes can cause great harm, they cannot perform evil actions\nbecause they are not moral agents. Furthermore, moral agents only\nperform evil actions when they are morally responsible for what they\ndo and their actions are morally inexcusable (see e.g., Kekes 2005;\nCard 2010; Formosa 2008 and 2013). To meet these conditions evildoers\nmust act voluntarily, intend or foresee their victim’s\nsuffering, and lack moral justification for their actions. It is\nparticularly controversial whether these conditions are met in three\nsorts of cases: (1) serious harms brought about by psychopaths; (2)\nserious harms brought about by individuals who have had bad\nupbringings; and (3) serious harms brought about through\nignorance.\n3.6.1 Psychopaths\n\nPsychopathy is a syndrome that consists in lacking certain emotional,\ninterpersonal, and behavioural traits and having others (Hare 1999).\nSome of the defining characteristics of psychopathy include shallow\nemotions, egocentricity, deceitfulness, impulsivity, a lack of\nempathy, and a lack of guilt and remorse. Particularly relevant for\nassessments of moral responsibility is the psychopath’s\ninability to care for others and for the rules of morality.\n\nAccording to the M’Naughten rules for criminal insanity, a\nperson is legally insane if, due to a disease of the mind at the time\nof acting, she is unable to know the nature or quality of her action\nor to know that what she is doing is wrong. For instance, a delusional\nschizophrenic who believes that her neighbour is a demon is not\nresponsible for harming her neighbour since she does not understand\nthat she is harming an innocent person; she believes she is defending\nherself from an inhuman malicious agent. Many philosophers believe\nthat the M’Naughten rules give us the conditions for moral\nresponsibility as well as the conditions for criminal responsibility\n(see, e.g., Wolf 1987).\n\nIt is controversial whether psychopaths are insane according to the\nstandard set by the M’Naughten rules since it is controversial\nwhether psychopaths know that their actions are wrong. Motivational\ninternalists believe that it is conceptually impossible to believe\n(and thus to know) that an action is morally wrong and yet be\ncompletely unmotivated to refrain from performing the action.\nThat is, for the internalist, there is a conceptual connection between\nbelieving that an action is wrong and having a con-attitude toward the\naction. The internalist believes that one may be able to knowingly do\nwhat is wrong because, all things considered, she cares more about\nsomething that is incompatible with refraining from wrongdoing,\nprovided she is at least somewhat inclined to refrain from doing what\nshe knows to be wrong. Since psychopaths seem to be completely\nindifferent to whether their actions are right or wrong, motivational\ninternalists believe that they do not truly believe, or understand,\nthat what they do is morally wrong. At most, they might believe that\ntheir harmful actions break societal conventions. But it may be one\nthing to believe that one has broken a societal convention and quite\nanother to believe that one has broken a moral rule. Philosophers who\nreject the internalist thesis, i.e., motivational externalists, are\nmore willing to believe that psychopaths know the difference between\nright and wrong. According to motivational externalists, moral\nknowledge only requires an intellectual capacity to identify right and\nwrong, and not the ability to care about morality. Since psychopaths\nare not intellectually deficient, motivational externalists do not\nthink there is any reason to believe that psychopaths cannot tell the\ndifference between right and wrong. (For more about how the\ninternalist and externalist theses relate to the moral responsibility\nof psychopaths see Brink 1989, 45–50; Duff 1977; Haksar 1965;\nand Milo 1984. See also Rosati 2006. Recently, some theorists writing\nabout the moral responsibility of psychopaths have tried to avoid the\ninternalist/externalist debate. It is beyond the purview of this entry\nto survey this literature. See Levy 2007 and 2014, Matravers 2008,\nTalbert 2008, Aharoni, Kiehl, and Sinnott-Armstrong 2011, Nelkin\n2015.)\n3.6.2 Bad Upbringings\n\nThe degree to which deviant behavior is caused by bad upbringings\nrather than genetic starting points or individual choices is a\ndifficult empirical question. Assuming that there is a strong causal\nconnection between bad upbringings and deviant behaviour, there are\ntwo main arguments for the claim that we should not hold perpetrators\nmorally responsible for behaviour that has resulted from bad\nupbringings. The first argument contends that since we do not choose\nour upbringings we should not be held responsible for crimes which\nresult from our upbringings (See, e.g., Cole 2006, 122–147).\nSusan Wolf (1987) offers a variant of this argument. According to Wolf\npeople who have had particularly bad upbringings are unable to make\naccurate normative judgements because they have been taught the wrong\nvalues. Wolf likens people who have been taught the wrong values to\npeople suffering from psychosis because like psychotics they are\nunable to make accurate judgements about the world. For example, Wolf\nhas us consider the case of Jojo, the son of Jo, a ruthless dictator\nof a small South American country. Jo believes that there is nothing\nwrong with torturing or executing innocent people. In fact, he enjoys\nexpressing his unlimited power by ordering his guards to do just that.\nJojo is given a special education which includes spending much of his\nday with his father. The predictable result of this education is that\nJojo acquires his father’s values. Wolf argues that we should\nnot hold Jojo responsible for torturing innocent people since his\nupbringing has made him unable to judge that these actions are wrong.\nSince Jojo is unable to judge that his actions are wrong he meets the\nconditions for insanity as stated in the M’Naghten rules (See\nsection 3.5.1 above).\n\nThe second argument for the claim that we should not hold people\nmorally responsible for crimes that result from bad upbringings begins\nwith the supposition that we are morally responsible for our crimes\nonly if we are appropriate objects of reactive attitudes, such as\nresentment (Strawson 1963). According to this argument, perpetrators\nof crimes who have had particularly bad upbringings are not\nappropriate objects of reactive attitudes since there is no point to\nexpressing these attitudes toward these perpetrators. A proponent of\nthis argument must then explain why there is no point to expressing\nreactive attitudes toward these perpetrators. In his paper\n“Responsibility and the Limits of Evil: Variations on a\nStrawsonian Theme” (1987) Gary Watson considers various ways to\nmake sense of the claim that there is no point to expressing reactive\nattitudes toward people who commit crimes due to bad upbringings.\nWatson’s discussion centres on the case of Robert Alton Harris.\nAs a child, Harris was an affectionate good-hearted boy. Family\nmembers say that an abusive mother and harsh treatment at corrections\nfacilities turned him into a malicious cold-blooded murderer.\n3.6.3 Ignorance\n\nSometimes ignorance is used as an excuse for putative evildoing (Jones\n1999, 69–70). The argument goes something like this: if an agent\nhas no good reason to believe that she causes significant harm without\nmoral justification, then she is not morally responsible for causing\nthis harm because she has no good reason to act otherwise. For\ninstance, if Dorian shoots a gun into some bushes on a country estate\nwithout having any reason to believe that a man is hiding there, he is\nnot morally responsible for harming a man who is hiding there (this\ncase comes from Oscar Wilde’s A Picture of Dorian\nGray). In this way ignorance can be a legitimate excuse for\ncausing unjustified harm.\n\nHowever, since Aristotle, theorists have recognized that ignorance is\nonly a legitimate excuse for causing unjustified harm when we are not\nresponsible for our ignorance, i.e., when the ignorance is\nnon-culpable (Nichomachean Ethics, Bk III). One sort\nof culpable ignorance which has received a fair bit of attention from\nphilosophers writing about evil is ignorance that results from\nself-deception. In self-deception we evade acknowledging to ourselves\nsome truth or what we would see as the truth if our beliefs were based\non an unbiased assessment of available evidence. “Self-deceivers\nare initially aware of moments when they shift their attention away\nfrom available evidence to something else, although they may not be\naware of the overall project of their self-deception.” (Jones\n1999, 82). Some tactics used by self-deceivers to evade acknowledging\nsome truth, including (1) avoiding thinking about the truth, (2)\ndistracting themselves with rationalizations that are contrary to the\ntruth, (3) systematically failing to make inquiries that would lead to\nevidence of the truth and (4) ignoring available evidence of the truth\nor distracting their attention from this evidence (Jones 1999, 82).\nSeveral theorists writing about evil have suggested that\nself-deception plays a significant role in the production of evil\nactions and institutions (Calder 2003 and 2004; Jones 1999; \nMorton 2004, 57–58; Thomas 2012).\n4. Contemporary Theories of Evil Character/Personhood\n\nThe terms ‘evil personhood’ and ‘evil\ncharacter’ are used interchangeably in the literature. This\nentry will follow this convention.\n\nExtant theories of evil personhood can be cross-listed as regularity\nor dispositional accounts on the one hand, and as action-based,\naffect-based, or motivation-based accounts on the other (aggregative\naccounts are also possible, however, it isn’t clear that any\ntheorist currently holds an aggregative account [See Russell 2014,\n139–153]). For example, John Kekes holds an action-based\nregularity account (Kekes 1990, 48; 1998, 217; 2005, 2), while Todd\nCalder holds a motive-based dispositional account (Calder 2009,\n22–27).\n\nAccording to regularity accounts, evil persons have evil-making\nproperties habitually, or on a regular basis. According to\ndispositional accounts, evil persons need never have evil-making\nproperties. It is sufficient to have a disposition to have evil-making\nproperties.\n\nAction-based accounts contend that evil-making properties are certain\nsorts of actions—evil actions. Affect-based accounts contend\nthat evil-making properties are certain sorts of feelings—evil\nfeelings. Motivation-based accounts contend that evil-making\nproperties are certain sorts of motivations—evil desires.\n\nSome theorists argue for more than one sort of evil-making property.\nFor example, Luke Russell argues that both evil actions and evil\nfeelings are evil making properties (Russell 2014, 292), while Daniel\nHaybron argues that evil feelings and evil motivations are evil-making\nproperties (Haybron 2002b, 269).\n4.1 Action-Based Accounts\n\nMost theorists writing about evil personhood hold action-based\naccounts (See, e.g., Barry 2013, 87; Kekes 2005, 2; Thomas 1993, 82;\nRussell 2014, 180). According to action-based accounts, evil persons\nperform evil actions often enough, or are disposed to perform evil\nactions. For example, Laurence Thomas argues that “a person with\nan evil character is one who is often enough prone to do evil\nacts” (Thomas 1993, 82).\n\nCritics argue that the problem with action-based accounts is that it\nseems sufficient for evil personhood to have evil feelings or\nmotivations, and thus, evil persons need not perform, or be disposed\nto perform, evil actions. For instance, it seems that a harmless\nsadist who relishes in the suffering of others but who is not disposed\nto perform evil actions, could still be an evil person. Similarly, a\ncowardly or incompetent sadist who strongly desires to cause others\nsuffering but who is not disposed to perform evil actions, is still an\nevil person (Calder 2009, 23; Haybron 2002b, 264).\n4.2 Affect-Based Accounts\n\nAccording to affect-based accounts, evil people have certain sorts of\nfeelings or emotions. For instance, Colin McGinn argues that “an\nevil character is one that derives pleasure from pain and pain from\npleasure” (McGinn 1997, 62). There is some initial plausibility\nto this view since sadism and malicious envy are paradigms of evil.\nHowever, while it is undoubtedly true that some evil people are\nsadistic or maliciously envious, there is reason to believe that\nfeelings of pleasure in pain or pain in pleasure, or any other sorts\nof feelings, are neither necessary nor sufficient for evil character.\nThe problem with thinking that certain sorts of feelings are necessary\nfor evil character is that an evil person might routinely cause\nserious harm to her victims without any accompanying feelings. For\ninstance, someone who routinely runs down pedestrians out of\nindifference for their well-being, and without any accompanying\nfeelings, seems to qualify as an evil person (Calder 2003, 368).\n\nThe problem with thinking that certain sorts of feelings, such as\nfeelings of pleasure in another person’s pain, are sufficient\nfor evil character is that these sorts of feelings might be\ninvoluntary and not endorsed by the person who has them. For instance,\nJohn might be just so constituted to experience pleasure in the face\nof another person’s pain. If John does not desire to take\npleasure in other people’s pain, and is horrified by his\nsadistic feelings, it seems too harsh to call him evil. He should be\npitied rather than condemned. Calling someone like John\n‘evil’ would be like blaming someone for her patellar\nreflex (Calder 2003, 368–369).\n4.3 Motivation-Based Accounts\n\nAccording to motivation-based accounts, to be an evil person is to be\nmotivated in a certain sort of way. For instance, Todd Calder argues\nthat to be an evil person it is sufficient to have a regular\npropensity for e-desires. An e-desire is a motivational state that\nconsists in a desire for what is correctly believed to be someone\nelse’s significant harm for an unworthy goal or for what would\ncorrectly be believed to be someone else’s significant harm for\nan unworthy goal in the absence of self-deception (see Section 3.5.3\nfor more on self-deceptive evil). According to Calder, significant\nharm is desired for an unworthy goal if a state of affairs\nconsisting of the achievement of the goal together with the harm would\nbe less valuable than if the goal was not achieved and the harm was\navoided (Calder 2003 and 2009. See also Card, 2002, 21 for a similar\nview).\n\nA problem for motivation-based accounts is to explain why we should\njudge someone as evil based solely on her motivations. In other words,\nwhy judge someone as the morally worst sort of person for having\ncertain desires if these desires do not result in significant harm?\nWhy not judge people as evil only if they actually cause significant\nharm? One way to respond to this objection is to point out that even\nif e-desires do not result in significant harm on some particular\noccasion or for some particular person, e-desires do, for most people\nmost of the time, lead to significant harm (Julia Driver’s\nconsequentialist theory of virtue and vice (2001) uses a similar line\nof thought). Or else, a proponent of a motivation-based account could\ninsist that judgments of evil character look inward to an\nagent’s psychology and not to the effects (or likely effects) of\nher actions (See Calder 2007b for a similar view about virtue and\nvice).\n\nHowever, if we insist that judgements of evil character look inward to\nan agent’s psychology and not to the effects of her actions, why\njudge evil character solely on the basis of her motives? Why not take\ninto account the agent’s affective states as well? (Haybron\n2002b, 267)\n4.4 Regularity Accounts\n\nAccording to regularity accounts, evil persons have evil-making\nproperties frequently, or on a regular basis (See, e.g., Card 2002,\n21; Kekes 1990, 48; 1998, 217; 2005, 3; Stone 2009, 23). For instance,\nJohn Kekes writes that when “agents are regular sources of evil\n... we can identify them, and not merely their actions and character\ntraits, as evil” (Kekes 1990, 48). An advantage of regularity\naccounts is that they explain the intuition that evil persons deserve\nour strongest moral condemnation (Russell 2014, 135). For if evil\npersons have evil-making properties frequently, or on a regular basis,\nthen it makes sense to say that they are the worst sorts of people and\ndeserve our strongest moral condemnation.\n\nHowever, one problem with regularity accounts is that they do not seem\nto be able to make sense of the fact that some evil persons only very\nrarely (if ever) have evil-making properties. For instance, Luke\nRussell argues that we should reject regularity accounts because they\ncannot accommodate the intuition that a brooding spree killer could be\nevil (Russell 2014, 139). The brooding spree killer does not perform\nevil actions frequently or regularly. She plans and fantasizes about\nher attack, and then performs evil actions sporadically or all at\nonce. Thus, Russell argues, if brooding spree killers can be evil, as\nwe think they can be, then we should reject regularity accounts.\n\nNotice, however, that Russell’s counterexample only works\nagainst action-based regularity accounts, since proponents of affect\nor motivation based regularity accounts could argue that brooding\nspree killers do have evil-making properties, i.e. evil feelings or\nevil desires, habitually or regularly during the planning and/or\nfantasizing phase (even if they do not perform evil actions) and thus,\ncount as evil persons on these sorts of regularity accounts. So the\nquestion becomes, are there persons who are comparable to brooding\nspree killers in that they have evil feelings or desires sporadically\nor infrequently rather than on a regular basis? It seems that there\nmight be cases of this sort when opportunities for evil feelings and\ndesires are scarce. For example, we can imagine that an evil person\nmight fail to have evil feelings and desires because she has been\nstranded on a deserted island. After many years without potential\nvictims and needing to focus all of her attention on survival, she\nmight lack evil feelings and desires due to a poverty of stimulus.\nThis would mean that she is no longer an evil person on affect and\nmotivation based regularity accounts. However, it seems that we should\nsay that she is still an evil person if she is still disposed to have\nevil feelings and desires in the sense that her evil feelings and\ndesires would immediately return if she were presented with a victim.\nIf so, we should reject affect and motivation based regularity\naccounts.\n4.5 Dispositional Accounts\n\nMost theorists writing about evil personhood adopt dispositional\naccounts (See, e.g., Barry 2013, 87; Haybron 2002a, 70; Russell 2010\nand 2014, 154–195). Broadly speaking, dispositional accounts\ncontend that someone is an evil person if, and only if, she is\ndisposed to have evil-making properties.\n\nA potential problem for dispositional accounts is that they seem to\nconflict with the intuition that evil persons are rare since most of\nus are disposed to have evil-making properties in certain sorts of\nsituations (Russell 2014, 159). For example, assuming for the moment\nthat evil actions are evil-making properties, Stanley Milgram has\nshown that most of us are disposed to perform evil actions\n(specifically, administering potentially lethal electric shocks to\ninnocent people) when in certain experimental conditions (i.e. when\nasked to do so by a researcher working for a prestigious institution\nin the context of a study on punishment and learning) (Milgram 1974).\nMilgram’s experiments were designed to explain how thousands of\nordinary people could have played a role in bringing about the\nHolocaust during the Nazi era. Milgram’s research suggests that\nmost of us are disposed to perform evil actions when influenced,\nmanipulated, or pressed to do so by authority figures, as many people\nwere in Nazi Germany (Russell 2014, 170–173). But if most of us\nare disposed to perform evil actions in these situations then it seems\nthat on the dispositional account of evil personhood, most of us are\nevil, and thus, evil is not rare.\n\nTo make sense of the rarity of evil personhood, Luke Russell proposes\na restricted dispositional account according to which someone is an\nevil person if, and only if, she is strongly disposed to perform evil\nactions in only autonomy-favoring conditions (Russell 2014,\n72–75. Peter Barry argues for a similar view [See Barry 2013,\n82–90]).To be “strongly” disposed (as opposed to\nmerely disposed) to have evil-making properties is to be very likely,\nas opposed to merely able, to have evil-making properties (Russell\n2014, 156). Autonomy-favoring conditions are conditions in which an\nevildoer is not “deceived, threatened, coerced, or\npressed” (Russell 2014, 173), and thus, able to do what she\ntruly wants to do. According to Russell, although most of us are\nstrongly disposed to perform evil actions in Milgram scenarios, since\nMilgram scenarios are not autonomy-favoring conditions, most of us are\nnot evil persons.\n\nSeveral objections have been raised against Russell’s\nautonomy-favoring dispositional account (Calder 2015b). One objection\nis that it isn’t clear that Russell’s restricted\ndispositional account is an improvement over a more basic\ndispositional account according to which evil persons are simply\nstrongly disposed to perform evil actions (Calder 2015b,\n356–357). For it might be argued that since most of the subjects\nof Milgram’s experiments were surprised and distressed by what\nthey were asked to do, they would not have taken part in further\niterations of the experiment. If so, the subjects of Milgram’s\nexperiments were strongly disposed to perform evil actions only when\nsurprised by the novel circumstances of Milgram’s experiment,\nand not on an on-going basis in those circumstances. But if we do not\nhave a disposition to perform evil actions on an on-going basis, then\nwe do not really have a strong disposition to perform evil actions, or\nat least, one could argue, not in the sense implicitly meant by the\nbasic dispositional account. Furthermore, if some subjects of\nMilgram’s experiments would have willingly taken part in further\niterations of the experiment, it isn’t clear that they\nwouldn’t have been evil persons, which runs counter to\nRussell’s autonomy-favoring dispositional account.\n\nA second objection to Russell’s autonomy-favoring dispositional\naccount is that it is tailor-made to capture an intuition that some of\nus do not share: that most people could not be evil persons in any\nenvironment, even hostile political ones. Russell’s theory is\nbased on the idea that if most of us would be strongly disposed to\nperform evil actions in certain sorts of environments, such as in Nazi\nGermany, then we aren’t evil persons if we are disposed to\nperform evil actions in only those situations. But we might reject\nthis reasoning and argue instead that most of us are susceptible to\nbecoming evil persons in these environments, and so, need to be wary\nof these environments.\n4.6 Additional Theses about Evil Personhood\n\nIn addition to arguing for regularity or dispositional accounts on the\none hand, and action-based, affect-based, or motivation-based accounts\non the other, theorists have argued for several additional theses\nconcerning evil personhood.\n4.6.1 The Fixity Thesis\n\nAccording to the fixity thesis, evil persons have particularly fixed,\nor durable, characters such that it is very difficult to go from evil\nto non-evil, and changes of this sort rarely occur. Theorists add\nfixity components to their theories of evil personhood to capture the\nintuition that evil persons are near moral write-offs, beyond\n“communication and negotiation, reform and redemption”\n(Russell 2014 169. See also, Barry 2013, 82–87).\n\nTodd Calder has argued against the fixity thesis. Imagine that Darlene\nhas a highly fixed disposition to perform evil actions that she does\nlittle to resist. Geoff also has a disposition to perform evil\nactions, but this disposition is not highly fixed because he is\nindifferent about whether he should be disposed to perform evil\nactions and is, in general, capricious and unprincipled. It\nisn’t clear that Darlene is an evil person while Geoff is not.\nIf so, the characters of evil persons need not be highly fixed (Calder\n2015b, 354).\n4.6.2 The Consistency Thesis\n\nAccording to the consistency thesis, evil persons have evil-making\nproperties, or are disposed to have evil-making properties,\nconsistently, or almost all of the time. For instance, Daniel Haybron\nargues that “To be evil is ... to be consistently vicious in the\nfollowing sense: one is not aligned with the good to a morally\nsignificant extent” (Haybron 2002b, 269). By this he means that\nevil people almost always lack empathy and concern for others, and\nthey are in no way motivated to help others or to do what is morally\nright.\n\nSome theorists contrast the consistency thesis with the extremity\nthesis according to which evil persons have some set of character\ntraits to an extreme degree, e.g. extreme callousness or extreme\nmaliciousness (Haybron 2002a; Barry 2013, 56–71). The extremity\nthesis is consistent with most theories of evil personhood. The\nconsistency thesis is more controversial.\n\nCritics of the consistency thesis argue that it is too restrictive\n(Calder 2009, 22–27; Russell 2010, 241). Imagine that Bob loves\nto torture children and does so frequently, but that Bob also displays\ngenuine compassion for the elderly, perhaps by volunteering at a\nlong-term care facility on a regular basis. According to the\nconsistency thesis, Bob is not an evil person because he does not have\nevil-making characteristics consistently. And yet most people would\nwant to say that torturing children for fun on a regular basis is\nenough to make Bob an evil person (Calder 2009, 22–27).\n4.6.3 The Mirror Thesis\n\nAccording to the mirror thesis an evil person is the mirror-image of a\nmoral saint. Several theorists who write about evil personhood endorse\nthis thesis and use it to argue for their theories (Barry 2009; 2013;\nHaybron 2002b). For instance, Daniel Haybron argues that one reason to\naccept his contention that evil persons are wholly (or almost wholly)\nunaligned with the good is that it fits well with the intuition that\nmoral saints are “perfectly, or near-perfectly, aligned with the\ngood” (Haybron 2002b, 274. This argument makes an implicit\nappeal to the mirror thesis.\n\nLuke Russell rejects the mirror thesis, arguing that while moral\nsaints are morally admirable in all respects, some paradigmatic evil\npersons possess some morally admirable traits, such as courage,\ncommitment, and loyalty, which help them achieve their immoral goals\n(Russell 2010, 241–242). Since evil persons need not be bad in\nevery respect and moral saints must be good in every respect, we\nshould reject the mirror thesis. In response, Peter Brian Barry argues\nthat on plausible conceptions of moral sainthood, i.e. those that can\nmake sense of actual moral saints such as Mahatma Gandhi, Martin\nLuther King Jr., and Mother Teresa, moral saints can have some moral\nflaws (Barry 2011). Thus, the fact that some evil persons have some\nadmirable traits shouldn’t convince us to reject the mirror\nthesis.\n5. Evil Institutions\n\nWhile most theorists writing about evil focus on evil action and evil\ncharacter, there has also been some discussion of evil institutions.\nWhen we speak of ‘evil institutions’ we might mean one of\ntwo things: (1) organizations that are evil or that perform evil\nactions, or (2) social practices that are evil, such as slavery and\ngenocide. Since an organization can only be evil, or perform evil\nactions, if it is morally responsible for what it does, the debate\nconcerning the concept of evil institutions in sense (1) is discussed\nunder the heading of ‘collective responsibility.’ Evil\ninstitutions in this sense will not be discussed in this entry. (For a\nrecent contribution to this literature which makes explicit reference\nto evil collectives, see Scarre 2012.)\n\nAccording to Claudia Card, an institution, in sense (2), i.e., a\nsocial practice, is evil if it is reasonably foreseeable that\nintolerable harm will result from its normal or correct operation\nwithout justification or moral excuse (2002, 20; 2010, 18,\n27–35). For instance, genocide is an evil institution since\nsignificant suffering and a loss of social vitality result from its\nnormal and correct operation without moral justification (Card 2010,\n237–293).\n\nHowever, while Card’s account of evil institutions correctly\nidentifies genocide and other paradigmatically evil institutions as\nevil, her account also classifies as evil some institutions which are\nless obviously evil such as capital punishment, marriage, and\nmotherhood (Card 2002, 2010). Her classification of marriage and\nmotherhood as evil has been particularly controversial.\n\nAccording to Card, marriage and motherhood are evil institutions\nbecause it is reasonably foreseeable that their normal, or correct,\noperation will lead to intolerable harm in the form of domestic abuse\nwithout justification or excuse (Card 2002, 139–165). For\ninstance, Card argues that the normal, or correct, operation of\nmarriage leads to spousal abuse “because it provides incentives\nfor partners to stay in broken relationships, places obstacles in the\nway of escaping from broken relationships, gives perpetrators of abuse\nvirtually unlimited rights of access to their victims, and makes some\nforms of abuse difficult or impossible to detect or prove”\n(Calder 2009, 28). Card argues that there is no moral justification\nfor the intolerable harm that results from the institution of marriage\nsince nothing prevents us from abolishing marriage in favour of other\nless dangerous institutions.\n\nCritics argue that even if Card is correct that it is reasonably\nforeseeable that the institution of marriage will lead to intolerable\nharms, it is too heavy-handed to call marriage an evil institution.\nFor instance, Todd Calder has argued that an institution should be\nconsidered evil only if intolerable harm is an essential component of\nthe institution. Since suffering and a loss of social vitality are\nessential components of genocide, genocide is an evil institution. But\nsince spousal abuse is not an essential component of marriage,\nmarriage is not an evil institution (Calder 2009, 27–30).\n",
    "bibliography": {
        "categories": [
            "Other Interesting But Uncited Works"
        ],
        "cat_ref_text": {
            "Other Interesting But Uncited Works": [
                "</h3>\n<ul class=\"hanging\">",
                "Anderson-Gold, S. and Pablo Muchnik (eds.), 2010, <em>Kant’s\nAnatomy of Evil</em>, Cambridge: Cambridge University Press.",
                "Aquinas, T., <em>Summa Theologia</em> (Volume 8: <em>Creation,\nVariety and Evil</em>), T. Gilby (trans.). Cambridge: Cambridge\nUniversity Press, 2006.",
                "–––, <em>On Evil</em>, R. Regan (trans.).\nOxford: Oxford University Press, 2003.",
                "Barry, P.B., 2017, <em>The Fiction of Evil</em>, Oxon:\nRoutledge.",
                "Calder, T., 2004, “Evil, Ignorance, and the 9/11\nTerrorists,” <em>Social Philosophy Today</em>, 20:\n53–66.",
                "Card, C., 2001, “Inequalities versus Evils,” in\n<em>Controversies in Feminism</em>, J. Sterba (ed.), Oxford:\nRowman&amp; Littlefield Publishers, Inc, pp. 83–98.",
                "Cesarani, D., 2004, <em>Becoming Eichmann: Rethinking the Life,\nCrimes, and Trial of a “Desk Murderer,”</em> Rayleigh,\nEssex: Da Capo Press.",
                "Cleckley, H., 1955, <em>The Mask of Sanity: An Attempt To Clarify\nSome Issues About the So-Called Psychopathic Personality</em>, St.\nLouis: The C.V. Mosby Company, 3<sup>rd</sup> edition.",
                "Haybron, D.M., 1999, “Evil Characters,” <em>American\nPhilosophical Quarterly</em>, 36 (2): 131–148.",
                "Kekes, J., 1988, “Understanding Evil,” <em>American\nPhilosophical Quarterly</em>, 25 (1): 13–23.",
                "Lara, M.P. (ed.), 2001, <em>Rethinking Evil: Contemporary\nPerspectives</em>, Berkeley: University of California Press.",
                "–––, 2007, <em>Narrating Evil: A\nPostmetaphysical theory of reflective Judgment</em>, New York:\nColumbia University Press.",
                "Mathewes, C.T., 2001, <em>Evil and the Augustinian Tradition</em>,\nCambridge: Cambridge University Press.",
                "Midgley, M., 1984, <em>Wickedness: A Philosophical Essay</em>,\nLondon: Routledge &amp; Kegan Paul.",
                "Milo, R.D., 1998, “Virtue, Knowledge, and Wickedness,”\n<em>Social Philosophy and Policy</em>, 5 (1): 196–215.",
                "Neiman, S., 2002, <em>Evil: an Alternative History of\nPhilosophy</em>, Princeton: Princeton University Press.",
                "Papish, L., 2018, <em>Kant on Evil, Self-Deception, and Moral\nReform</em>, Oxford: Oxford University Press.",
                "Rae, G., 2019, <em>Evil in the Western Philosophical\nTradition</em>, Edinburgh: Edinburgh University Press.",
                "Russell, L., 2020, <em>Being Evil</em>, Oxford: Oxford University\nPress.",
                "Stocker, M., 1979, “Desiring the Bad: An Essay in Moral\nPsychology,” <em>The Journal of Philosophy</em>, 76 (12):\n738–753.",
                "Svendsen, L., 2010, <em>A Philosophy of Evil</em>, K.A. Pierce\n(trans.). Champaign: Dalkey Archive Press.",
                "Thomas, L., 1989, <em>Living Morally</em>, Philadelphia: Temple\nUniversity Press.",
                "–––, 1996, “Becoming an Evil Society: The\nSelf and Strangers,” <em>Political Theory</em>, 24 (2):\n271–294.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Aharoni, E., K.A. Kiehl, and W. Sinnott-Armstrong, 2012,\n“Can Psychopathic Offenders Discern Moral Wrongs? A New Look at\nthe Moral/Conventional Distinction,” <em>Journal of Abnormal\nPsychology</em>, 121 (2): 484–497.</li>\n<li>Allison, H.E., 2001, “Reflections on the Banality of\n(Radical) Evil: A Kantian Analysis,” in <em>Rethinking Evil:\nContemporary Perspectives</em>, María Pía Lara (ed.),\nBerkeley: University of California Press, pp. 86–100.</li>\n<li>Anglin, B. and S. Goetz, 1982, “Evil Is Privation,”\n<em>International Journal of the Philosophy of Religion</em>, 13 (1):\n3–12.</li>\n<li>Arendt, H., 1951 [1985], <em>The Origins of Totalitarianism</em>,\nSan Diego: A Harvest Book, Harcourt, Inc.</li>\n<li>–––, 1963 [1994], <em>Eichmann in Jerusalem: A\nReport on the Banality of Evil</em>, New York: Penguin Books.</li>\n<li>Arendt, H. and G. Scholem, 2017, <em>The Correspondence of Hannah\nArendt and Gershom Scholem</em>, ed. Marie Luise Knott, trans. Anthony\nDavid, Chicago: The University of Chicago Press.</li>\n<li>Aristotle, <em>Nichomachean Ethics</em>, M. Ostwald (trans.),\nUpper Saddle River, New Jersey: Prentice Hall, 1999.</li>\n<li>Augustine, <em>Confessions</em>, H. Chadwick (trans.), Oxford:\nOxford University Press, 1991.</li>\n<li>–––, <em>On the Morals of the Manichaeans</em>,\nin <em>Writings in Connection With the Manichaean Heresy</em>, Vol 2\nof <em>The Works of Aurelius Augustine: Bishop of Hippo</em>, R.\nStothert (trans.), Rev. M. Dods (ed.), Edinburgh: T&amp;T Clark, 1872,\npp. 51–63.</li>\n<li>–––, <em>Reply to Manichaeus’ Fundamental\nEpistle</em> in <em>Writings in Connection With the Manichaean\nHeresy</em>, Vol 2 of <em>The Works of Aurelius Augustine: Bishop of\nHippo</em>, R. Stothert (trans.), Rev. M. Dods (ed.), Edinburgh:\nT&amp;T Clark, 1872, pp. 132–144.</li>\n<li>Bar On, B., 2012, “Standing Between Us and Our Grave\nWrongdoings,” <em>Midwest Studies in Philosophy</em>, XXXVI:\n112–126.</li>\n<li>Baron-Cohen, S., 2011, <em>The Science of Evil: on Empathy and the\nOrigins of Cruelty</em>, New York: Basic Books.</li>\n<li>Barry, P.B., 2009, “Moral Saints, Moral Monsters, and the\nMirror Thesis,” <em>American Philosophical Quarterly</em>, 46\n(2): 163–176.</li>\n<li>–––, 2011, “In Defense of the Mirror\nThesis,” <em>Philosophical Studies</em>, 155 (2):\n199–205.</li>\n<li>–––, 2013, <em>Evil and Moral Psychology</em>,\nNew York: Routledge.</li>\n<li>Bernstein, R., 2002, <em>Radical Evil: a philosophical\ninterrogation</em>, Malden, MA: Polity Press.</li>\n<li>–––, 2008, “Are Arendt’s Reflections\non Evil Still Relevant?,” <em>The Review of Politics</em>, 70\n(1): 64–76.</li>\n<li>Birmingham, P. 2019, “Hannah Arendt’s Double Account of Evil:\nPolitical Superfluousness and Moral Thoughtlessness,” in the\n<em>Routledge Handbook of the Philosophy of Evil</em>, Thomas Nys and\nStephen de Wijze (ed.), London and New York: Routledge, pp.\n148–162.</li>\n<li>Brink, D., 1989, <em>Moral Realism and the Foundations of\nEthics</em>, New York: Cambridge University Press.</li>\n<li>Burt, D.X., 1996, <em>Augustine’s World: An Introduction to\nHis Speculative Philosophy</em>, Lanham, MD: University Press of\nAmerica.</li>\n<li>Calder, T., 2002, “Towards a Theory of Evil: A Critique of\nLaurence Thomas’s Theory of Evil Acts,” in\n<em>Earth’s Abominations: Philosophical Studies of Evil</em>, D.\nM. Haybron (ed.), New York: Rodopi, pp. 51–61.</li>\n<li>–––, 2003, “The Apparent Banality of\nEvil,” <em>Journal of Social Philosophy</em>, 34 (3):\n364–376.</li>\n<li>–––, 2007a, “Is the Privation Theory of\nEvil Dead?” <em>American Philosophical Quarterly</em>, 44 (4):\n371–381.</li>\n<li>–––, 2007b, “Against Consequentialist\nTheories of Virtue and Vice,” <em>Utilitas</em>, 19 (2):\n201–219.</li>\n<li>–––, 2009, “The Prevalence of Evil,”\nin <em>Evil, Political Violence and Forgiveness</em>, A. Veltman and\nK. Norlock (eds.), Lanham, MD: Lexington Books, pp.\n13–34.</li>\n<li>–––, 2013, “Is Evil Just Very\nWrong?” <em>Philosophical Studies</em>, 163 (1):\n177–196.</li>\n<li>–––, 2015a, “Evil and Its Opposite,”\n<em>Journal of Value Inquiry</em>, 49 (1–2): 113–130.</li>\n<li>–––, 2015b, “Evil Persons,”\n<em>Criminal Justice Ethics</em>, 34 (3): 350–360.</li>\n<li>–––, 2019, “Evil and Wrongdoing,” in\n<em>The Routledge Handbook of the Philosophy of Evil</em>, Thomas Nys and\nStephen de Wijze (eds.), London and New York: Routledge, pp.\n218–233.</li>\n<li>–––, 2022, “Evil and Feminist Ethics: A Modified\nCardian Theory of Evil,” <em>Social Theory and Practice</em>, 48 (3):\n457–484.</li>\n<li>Card, C., 2002, <em>The Atrocity Paradigm: A Theory of Evil</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 2010, <em>Confronting Evils: Terrorism,\nTorture, Genocide</em>. Cambridge: Cambridge University Press.</li>\n<li>–––, 2016, “Taking Pride in Being\nBad,” in <em>Oxford Studies in Normative Ethics</em>, 6:\n37–55.</li>\n<li>Clendinnen, I., 1999, <em>Reading the Holocaust</em>, Cambridge:\nCambridge University Press.</li>\n<li>Cole, P., 2006, <em>The Myth of Evil: Demonizing the Enemy</em>,\nWestport, CT: Praeger.</li>\n<li>–––, 2019, “Deliver us from Evil,”\nin <em>The Routledge Handbook of the Philosophy of Evil</em>, Thomas Nys\nand Stephen de Wijze (ed.), London and New York: Routledge, pp.\n177–188.</li>\n<li>Coyel, J.K., 2009, Manichaeism and Its Legacy, Boston: Brill\nAcademic Publishers.</li>\n<li>De Wijze, S., 2018, “Small-Scale Evil,” <em>Journal of\nValue Inquiry</em>, 52 (1): 25–35.</li>\n<li>–––,2019, “Defining the Concept of Evil:\nInsights from our Pre-Cognitive Responses,” in the <em>Routledge\nHandbook of the Philosophy of Evil</em>, Thomas Nys and Stephen de\nWijze (ed.), London and New York: Routledge, pp. 203–217.</li>\n<li>Driver, J., 2001, <em>Uneasy Virtue</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Duff, A., 1977, “Psychopathy and Moral Understanding,”\n<em>American Philosophical Quarterly</em>, 14 (3): 189–200.</li>\n<li>Eagleton, T., 2010, <em>On Evil</em>, New Haven, CT: Yale\nUniversity Press.</li>\n<li>Feinberg, J., 2003, “Evil,” in <em>Problems at the\nRoots of Law</em>, Oxford: Oxford University Press.</li>\n<li>Formosa, P., 2007, “Kant on the Radical Evil of Human\nNature,” <em>The Philosophical Forum</em>, 38 (3):\n221–245.</li>\n<li>–––,2008, “A Conception of Evil,”\n<em>Journal of Value Inquiry</em>, 42 (2): 217–239.</li>\n<li>–––,2013, “Evils, Wrongs and Dignity: How\nto Test a Theory of Evil,” <em>Journal of Value Inquiry</em>, 47\n(3): 235–253.</li>\n<li>–––,2019, “Different Substantive Conceptions of\nEvil Actions,” in the <em>Routledge Handbook of the Philosophy of\nEvil</em>, Thomas Nys and Stephen de Wijze (ed.), London and New York:\nRoutledge, pp. 256–266.</li>\n<li>Garcia, E.V., 2002, “A Kantian Theory of Evil,”\n<em>The Monist</em>, 85 (2): 194–209.</li>\n<li>Garrard, E., 1998, “The Nature of Evil,”\n<em>Philosophical Explorations: An International Journal for the\nPhilosophy of Mind and</em> Action, 1 (1): 43–60.</li>\n<li>–––, 2002, “Evil as an Explanatory\nConcept,” <em>The Monist</em>, 85 (2): 320–336.</li>\n<li>–––, 2019, “Does the Term\n‘Evil’ Have Any Explanatory Power,” in <em>The\nRoutledge Handbook of the Philosophy of Evil</em>, Thomas Nys and\nStephen de Wijze (ed.), London and New York: Routledge,\npp. 189–202.</li>\n<li>Garrard, E. and David McNaughton, 2012, “Speak No\nEvil” <em>Midwest Studies in Philosophy</em>, XXXVI:\n1–17.</li>\n<li>Goldberg, Z.J., 2017, “Can Kant’s Theory of Radical\nEvil Be Saved?” <em>Kantian Review</em>, 22 (3):\n395–419.</li>\n<li>–––, 2019, “A Relational Approach to Evil\nAction: Vulnerability and its Exploitation,” <em>Journal of Value\nInquiry</em>, 53 (1): 33–53.</li>\n<li>Grant, W.M., 2015, “The Privation Account of Moral Evil: A\nDefense,” <em>International Philosophical Quarterly</em>, 55\n(3): 271–286.</li>\n<li>Greenless, D., 2007, <em>The Gospel of the Prophet Mani</em>, San\nDiego: The Book Tree.</li>\n<li>Haksar, V., 1965, “The Responsibility of Psychopaths,”\n<em>Philosophical Quarterly</em>, 15 (59): 135–45.</li>\n<li>Hare, R.D., 1999, <em>Without Conscience: The Disturbing World of\nthe Psychopaths Among Us</em>, New York: The Guilford Press.</li>\n<li>Haybron, D.M., 2002a, “Consistency of Character and the\nCharacter of Evil,” in <em>Earth’s Abominations:\nPhilosophical Studies of Evil</em>, D.M. Haybron (ed.), New York:\nRodopi, pp. 63–78.</li>\n<li>–––, 2002b, “Moral Monsters and\nSaints,” <em>The Monist</em>, 85 (2): 260–284.</li>\n<li>Held, V., 2001, “The Language of Evil,” in\n<em>Controversies in Feminism</em>, J. Sterba (ed.), Oxford:\nRowman&amp; Littlefield Publishers, Inc, pp. 107–110.</li>\n<li>Jones, D., 1999, <em>Moral Responsibility in the Holocaust: A\nStudy in the Ethics of Character</em>, Lanham, MD: Rowman&amp;\nLittlefield Publishers, Inc.</li>\n<li>Kane, G.S., 1980, “Evil and Privation,”\n<em>International Journal of the Philosophy of Religion</em>, 11 (1):\n3–58.</li>\n<li>Kekes, J., 1990, <em>Facing Evil</em>, Princeton: Princeton\nUniversity Press.</li>\n<li>–––, 1998, “The Reflexivity of\nEvil,” <em>Social Philosophy and Policy</em>, 15 (1):\n216–232.</li>\n<li>–––, 2005, <em>The Roots of Evil</em>, Ithaca:\nCornell University Press.</li>\n<li>Kant, I., 1785, <em>The Groundwork of the Metaphysics of\nMorals</em>, M. Gregor (Trans. and ed.), New York: Cambridge\nUniversity Press, 1997.</li>\n<li>–––, 1793, <em>Religion Within the Limits of\nReason Alone</em>, T. M. Greene and H. H. Hudson (trans.), La Salle,\nIL: The Open Court Publishing Co., 1960.</li>\n<li>Kramer, M.H., 2011, <em>The Ethics of Capital Punishment: A\nPhilosophical Investigation of Evil and Its Consequences</em>, Oxford:\nOxford University Press.</li>\n<li>Levy, N., 2007, “The Responsibility of the Psychopath\nRevisited,” <em>Philosophy, Psychiatry, &amp; Psychology</em>, 14\n(2): 129–138.</li>\n<li>–––, 2014, “Psychopaths and Blame: The\nArgument from Content,” <em>Philosophical Psychology</em>, 27\n(3): 351–367.</li>\n<li>Liberto, H. and Fred Harrington, 2016, “Evil, Wrongdoing,\nand Concept Distinctness” <em>Philosophical Studies</em>, 173\n(6): 1591–1602.</li>\n<li>Lieu, S.N.C., 1985, <em>Manichaeism: In the Later Roman Empire and\nMedieval China A Historical Survey</em>, Manchester: Manchester\nUniversity Press.</li>\n<li>MacLachlan, A., 2009, “Moral Powers and Forgivable Evils,” in\n<em>Evil, Political Violence and Forgiveness</em>, A. Veltman and K.\nNorlock (eds.), Lanham, MD: Lexington Books, pp.\n135–157.</li>\n<li>Matravers, M., 2007, “Holding Psychopaths\nResponsible,” <em>Philosophy, Psychiatry, &amp; Psychology</em>,\n14 (2): 139–142.</li>\n<li>McGinn, C., 1997, <em>Ethics, Evil, and Fiction</em>, Oxford:\nClarendon Press.</li>\n<li>Milgram, S., 1974, <em>Obedience to Authority: An Experimental\nView</em>, New York: Harper and Row, Publishers.</li>\n<li>Milo, R.D., 1984, <em>Immorality</em>, Princeton: Princeton\nUniversity Press.</li>\n<li>Morton, A., 2004, <em>On Evil</em>, New York: Routledge.</li>\n<li>Nelkin, D.K., 2015, “Psychopaths, Incorrigible Racists, and the\nFaces of Responsibility,” <em>Ethics</em>, 125: 357–390.</li>\n<li>Nietzsche, F., 1886, <em>Beyond Good and Evil: Prelude to a\nPhilosophy of the Future</em>, in <em>The Nietzsche Reader</em>, K. A.\nPearson and D. Large (ed.), Malden, MA: Blackwell Publishing Ltd,\n2006, pp. 311–359.</li>\n<li>–––, 1887, <em>On the Genealogy of Morality: A\nPolemic</em>, in <em>The Nietzsche Reader</em>, K. A. Pearson and D.\nLarge (ed.), Malden, MA: Blackwell Publishing Ltd, 2006, pp.\n390–435.</li>\n<li>Noddings, Nel, 1989, <em>Women and Evil</em>, Berkeley:\nUniversity of California Press.</li>\n<li>Norlock, K. J., 2019, “Evil and Forgiveness,” in\n<em>The Routledge Handbook of the Philosophy of Evil</em>, Thomas Nys\nand Stephen de Wijze (ed.), London and New York: Routledge,\npp. 282–293.</li>\n<li>O’Brien, D., 1996, “Plotinus on matter and\nevil,” in <em>The Cambridge Companion to Plotinus</em>, L.P.\nGerson (ed.), Cambridge: Cambridge University Press, pp.\n171–195.</li>\n<li>Perrett, R.W., 2002, “Evil and Human Nature,”\n<em>Monist</em>, 85 (2): 304–319.</li>\n<li>Plotinus, <em>The Enneads</em>, S. Mackenna (trans.), London:\nFaber, 4th edition, revised by B.S. Page, 1969.</li>\n<li>Pocock, D., 1985, “Unruly Evil,” in <em>The\nAnthropology of Evil</em>, D. Parkin (ed.), Oxford: Basil Blackwell\nLtd, pp. 42–56.</li>\n<li>Rosati, C. S., 2008, “Moral Motivation”, <em>The\nStanford Encyclopedia of Philosophy</em> (Fall 2008 Edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2008/entries/moral-motivation/\">https://plato.stanford.edu/archives/fall2008/entries/moral-motivation/</a>&gt;.</li>\n<li>Russell, L., 2006, “Evil-Revivalism Versus\nEvil-Skepticism,” <em>Journal of Value Inquiry</em>, 40:\n89–105.</li>\n<li>–––, 2007, “Is Evil Action Qualitatively\nDistinct From Ordinary Wrongdoing?” <em>Australasian Journal of\nPhilosophy</em>, 85 (4): 659–677.</li>\n<li>–––, 2009, “He Did It Because he Was\nEvil,” <em>American Philosophical Quarterly</em>, 46 (3):\n267–282.</li>\n<li>–––, 2010, “Dispositional Accounts of Evil\nPersonhood,” <em>Philosophical Studies</em>, 149 (2):\n231–250.</li>\n<li>–––, 2014, <em>Evil: A Philosophical\nInvestigation</em>, Oxford: Oxford University Press.</li>\n<li>Scarre, G., 2012, “Evil Collectives,” <em>Midwest\nStudies in Philosophy</em>, XXXVI: 74–92.</li>\n<li>Singer, M.G., 2004, “The Concept of Evil,”\n<em>Philosophy</em>, 79: 185–214.</li>\n<li>Singer, P., 1972, “Famine, Affluence, and Morality,”\n<em>Philosophy and Public Affairs</em>, 1 (3): 229–243.</li>\n<li>Steiner, H., 2002, “Calibrating Evil,” <em>The\nMonist</em>, 85 (2): 183–193.</li>\n<li>Stone, M.H., 2009, <em>The Anatomy of Evil</em>, New York:\nPrometheus Books.</li>\n<li>Strawson, P., 1963, “Freedom and Resentment,” in\n<em>Perspectives on Moral Responsibility</em>, J. M. Fischer and M.\nRavizza (ed.), Ithaca: Cornell University Press, 1993, pp.\n45–66.</li>\n<li>Talbert, M., 2008, “Blame and Responsiveness to Moral\nReasons: Are Psychopaths Blameworthy?” <em>Pacific Philosophical\nQuarterly</em>, 89: 516–535.</li>\n<li>Thomas, L., 1993, <em>Vessels of Evil: American Slavery and the\nHolocaust</em>, Philadelphia: Temple University Press.</li>\n<li>–––, 2009, “Evil and Forgiveness: The\nPossibility of Moral Redemption,” in <em>Evil, Political\nViolence and Forgiveness</em>, A. Veltman and K. Norlock (eds.),\nLanham, MD: Lexington Books, pp. 115–133.</li>\n<li>–––, 2012, “Self-Deception as the\nHandmaiden of Evil,” <em>Midwest Studies in Philosophy</em>,\nXXXVI: 53–61.</li>\n<li>Timmons, M., 2017, “The Good, the Bad, and the\nBadass,” in <em>Significance and System: Essays on Kant’s\nEthics</em>, Oxford: Oxford University Press, pp. 293–330.</li>\n<li>Vetlesen, A.J., 2005, <em>Evil and Human Agency: Understanding\nCollective Evildoing</em>, Cambridge: Cambridge University Press.</li>\n<li>Watson, G., 1987, “Responsibility and the Limits of Evil:\nVariations on a Strawsonian Theme,” in <em>Responsibility,\nCharacter, and the Emotions</em>, F.D. Schoeman (ed.), Cambridge:\nCambridge University Press, pp. 256–286.</li>\n<li>Wolf, S., 1987, “Sanity and the Metaphysics of\nResponsibility,” in <em>Responsibility, Character, and the\nEmotions</em>, F.D. Schoeman (ed.), Cambridge: Cambridge University\nPress, pp. 46–62.</li>\n<li>Young-Bruehl, E., 1982, <em>Hannah Arendt: For Love of the\nWorld</em>, New Haven, CT: Yale University Press.</li>\n<li>Zimbardo, P., 2007, <em>The Lucifer Effect: Understanding How Good\nPeople Turn Evil</em>, New York: Random House Trade Paperbacks.</li>\n</ul>\n<h3>Other Interesting But Uncited Works</h3>\n<ul class=\"hanging\">\n<li>Anderson-Gold, S. and Pablo Muchnik (eds.), 2010, <em>Kant’s\nAnatomy of Evil</em>, Cambridge: Cambridge University Press.</li>\n<li>Aquinas, T., <em>Summa Theologia</em> (Volume 8: <em>Creation,\nVariety and Evil</em>), T. Gilby (trans.). Cambridge: Cambridge\nUniversity Press, 2006.</li>\n<li>–––, <em>On Evil</em>, R. Regan (trans.).\nOxford: Oxford University Press, 2003.</li>\n<li>Barry, P.B., 2017, <em>The Fiction of Evil</em>, Oxon:\nRoutledge. </li>\n<li>Calder, T., 2004, “Evil, Ignorance, and the 9/11\nTerrorists,” <em>Social Philosophy Today</em>, 20:\n53–66.</li>\n<li>Card, C., 2001, “Inequalities versus Evils,” in\n<em>Controversies in Feminism</em>, J. Sterba (ed.), Oxford:\nRowman&amp; Littlefield Publishers, Inc, pp. 83–98.</li>\n<li>Cesarani, D., 2004, <em>Becoming Eichmann: Rethinking the Life,\nCrimes, and Trial of a “Desk Murderer,”</em> Rayleigh,\nEssex: Da Capo Press.</li>\n<li>Cleckley, H., 1955, <em>The Mask of Sanity: An Attempt To Clarify\nSome Issues About the So-Called Psychopathic Personality</em>, St.\nLouis: The C.V. Mosby Company, 3<sup>rd</sup> edition.</li>\n<li>Haybron, D.M., 1999, “Evil Characters,” <em>American\nPhilosophical Quarterly</em>, 36 (2): 131–148.</li>\n<li>Kekes, J., 1988, “Understanding Evil,” <em>American\nPhilosophical Quarterly</em>, 25 (1): 13–23.</li>\n<li>Lara, M.P. (ed.), 2001, <em>Rethinking Evil: Contemporary\nPerspectives</em>, Berkeley: University of California Press.</li>\n<li>–––, 2007, <em>Narrating Evil: A\nPostmetaphysical theory of reflective Judgment</em>, New York:\nColumbia University Press.</li>\n<li>Mathewes, C.T., 2001, <em>Evil and the Augustinian Tradition</em>,\nCambridge: Cambridge University Press.</li>\n<li>Midgley, M., 1984, <em>Wickedness: A Philosophical Essay</em>,\nLondon: Routledge &amp; Kegan Paul.</li>\n<li>Milo, R.D., 1998, “Virtue, Knowledge, and Wickedness,”\n<em>Social Philosophy and Policy</em>, 5 (1): 196–215.</li>\n<li>Neiman, S., 2002, <em>Evil: an Alternative History of\nPhilosophy</em>, Princeton: Princeton University Press.</li>\n<li>Papish, L., 2018, <em>Kant on Evil, Self-Deception, and Moral\nReform</em>, Oxford: Oxford University Press.</li>\n<li>Rae, G., 2019, <em>Evil in the Western Philosophical\nTradition</em>, Edinburgh: Edinburgh University Press.</li>\n<li>Russell, L., 2020, <em>Being Evil</em>, Oxford: Oxford University\nPress.</li>\n<li>Stocker, M., 1979, “Desiring the Bad: An Essay in Moral\nPsychology,” <em>The Journal of Philosophy</em>, 76 (12):\n738–753.</li>\n<li>Svendsen, L., 2010, <em>A Philosophy of Evil</em>, K.A. Pierce\n(trans.). Champaign: Dalkey Archive Press.</li>\n<li>Thomas, L., 1989, <em>Living Morally</em>, Philadelphia: Temple\nUniversity Press.</li>\n<li>–––, 1996, “Becoming an Evil Society: The\nSelf and Strangers,” <em>Political Theory</em>, 24 (2):\n271–294.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Augustine, Saint",
            "evil: problem of",
            "Kant, Immanuel: moral philosophy",
            "Kant, Immanuel: philosophy of religion",
            "moral motivation",
            "moral responsibility",
            "moral skepticism",
            "Nietzsche, Friedrich: moral and political philosophy",
            "Plato: middle period metaphysics and epistemology",
            "Plotinus",
            "reasons for action: internal vs. external",
            "responsibility: collective"
        ],
        "entry_link": [
            {
                "../augustine/": "Augustine, Saint"
            },
            {
                "../evil/": "evil: problem of"
            },
            {
                "../kant-moral/": "Kant, Immanuel: moral philosophy"
            },
            {
                "../kant-religion/": "Kant, Immanuel: philosophy of religion"
            },
            {
                "../moral-motivation/": "moral motivation"
            },
            {
                "../moral-responsibility/": "moral responsibility"
            },
            {
                "../skepticism-moral/": "moral skepticism"
            },
            {
                "../nietzsche-moral-political/": "Nietzsche, Friedrich: moral and political philosophy"
            },
            {
                "../plato-metaphysics/": "Plato: middle period metaphysics and epistemology"
            },
            {
                "../plotinus/": "Plotinus"
            },
            {
                "../reasons-internal-external/": "reasons for action: internal vs. external"
            },
            {
                "../collective-responsibility/": "responsibility: collective"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=concept-evil\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/concept-evil/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=concept-evil&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/concept-evil/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=concept-evil": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/concept-evil/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=concept-evil&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/concept-evil/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}