{
    "url": "conceptual-art",
    "title": "Conceptual Art",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Elisabeth Schellekens\n<Elisabeth.schellekens@filosofi.uu.se>",
        "author_links": [
            {
                "http://katalog.uu.se/empinfo/?id=N13-2457": "Elisabeth Schellekens"
            },
            {
                "mailto:Elisabeth%2eschellekens%40filosofi%2euu%2ese": "Elisabeth.schellekens@filosofi.uu.se"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"http://katalog.uu.se/empinfo/?id=N13-2457\" target=\"other\">Elisabeth Schellekens</a>\n&lt;<a href=\"mailto:Elisabeth%2eschellekens%40filosofi%2euu%2ese\"><em>Elisabeth<abbr title=\" dot \">.</abbr>schellekens<abbr title=\" at \">@</abbr>filosofi<abbr title=\" dot \">.</abbr>uu<abbr title=\" dot \">.</abbr>se</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Jun 7, 2007",
        "substantive revision Wed Mar 23, 2022"
    ],
    "preamble": "\n\nThe philosophy of art addresses a broad spectrum of theoretical issues\narising from a wide variety of objects of attention. These range from\nPaleolithic cave painting to postmodern poetry, and from the problem\nof how music can convey emotion to that of the metaphysical status of\nfictional characters. Until recently, however, philosophical interest\nin conceptual art, or conceptualism, has been notably sparse. Why?\nAfter all, both philosophy and the myriad kinds and styles of art and\nart-making that fall under the conceptual tradition all have one thing\nin common: they are both intended to make you think and ask pressing\nquestions. What are those questions and how do we go about answering\nthem?\n",
    "toc": [
        {
            "#ConArtWhaIt": "1. Conceptual Art – What Is It?"
        },
        {
            "#Int": "1.1 Introduction"
        },
        {
            "#LimArtRolArt": "1.2 The Limits of Art and the Role of Artists"
        },
        {
            "#ArtMed": "1.3 Artistic Media"
        },
        {
            "#ArtIde": "1.4 Art as Idea"
        },
        {
            "#SemRep": "1.5 Semantic Representation"
        },
        {
            "#PhiConArtWhaIt": "2. The Philosophy of Conceptual Art – What is it?"
        },
        {
            "#FivPhiThe": "3. Five Philosophical Themes"
        },
        {
            "#DefArt": "3.1 The Definition of Art"
        },
        {
            "#OntMedArt": "3.2 The Ontology and Media of Art"
        },
        {
            "#AesValArt": "3.3 The Aesthetic Value of Art"
        },
        {
            "#IntArt": "3.4 The Interpretation of Art"
        },
        {
            "#CogValArt": "3.5 The Cognitive Value of Art"
        },
        {
            "#FurQue": "4. Further Questions"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Conceptual Art – What Is It?\n1.1 Introduction\n\nFew artistic movements have attracted so much controversy and debate\nas conceptual art. By its nature, conceptual art has a tendency to\nprovoke intense and perhaps even extreme reactions in its audiences.\nWhile some people find conceptual art very refreshing and relevant,\nmany others consider it shocking, distasteful, and conspicuously\nlacking in craftsmanship. Some even simply deny that it is art at all.\nConceptual art, it seems, is something that we either love or\nhate.\n\nThis divisive character is, however, far from accidental. Most\nconceptual art actively sets out to be controversial in so far as it\nseeks to challenge and probe us about what we tend to take as given in\nthe domain of art. In fact, this capacity to evoke argument and debate\nlies at the very heart of what conceptual art sets out to do, namely\nto make us question our assumptions not only about what may properly\nqualify as art and what the function of the artist should be, but also\nabout what our role as spectators should involve. It should come as no\nsurprise, then, that conceptual art can cause frustration or vexation\n– to raise difficult and sometimes even annoying questions is\nprecisely what conceptual art in general aspires to do. In reacting\nstrongly to conceptual art we are, in some important sense, playing\nright into its hands.\n\nThe first difficulty that a philosophical investigation of conceptual\nart encounters has to do with identifying the object of examination,\nor at least the category of objects under scrutiny. In the words of\nthe art historian Paul Wood,\n\n[i]t is not at all clear where the boundaries of ‘conceptual\nart’ are to be drawn, which artists and which works to include.\nLooked at in one way, conceptual art gets to be like Lewis\nCarroll’s Cheshire cat, dissolving away until nothing is left\nbut a grin: a handful of works made over a few short years by a small\nnumber of artists… Then again, regarded under a different\naspect, conceptual art can seem like nothing less than the hinge\naround which the past turned into the present. (Wood 2002, 6)\n\n\nOn a strict historical reading, the expression ‘conceptual\nart’ refers to the artistic movement that reached its pinnacle\nbetween 1966 and 1972 (Lippard\n 1973).[1]\n Among its most famous adherents at its early stage we find artists\nsuch as Joseph Kosuth, Robert Morris, Joseph Beuys, Adrian Piper, to\nname but a few. What unites the conceptual art of this period is the\nabsorption of the lessons learnt from other twentieth-century art\nmovements such as Dadaism, Surrealism, Suprematism, Abstract\nExpressionism and the Fluxus group, together with the ambition once\nand for all to ‘free’ art of the Modernist paradigm. Most\nimportantly, perhaps, conceptual art of the 1960s and 70s sought to\novercome a backdrop against which art’s principal aim is to\nproduce something beautiful or aesthetically pleasing. Art, early\nconceptual artists held, is redundant if it does not make us think. In\ntheir belief that most artistic institutions were not conducive to\nreflection but merely promoted a conservative and even consumerist\nconception of art and artists, conceptual artists in the mid-1960s to\nthe early 1970s instead tried to encourage a revisionary understanding\nof art, the artist, and artistic experience.\n\nWhile conceptual art in its purest form might arguably be limited to\nworks produced during these five or six years half a century ago, it\nseems overly narrow – certainly from a philosophical perspective\n– to limit our inquiry to works produced during that period\nalone. For although the work created during that time might generally\nbe conceived as more directly anti-establishment and anti-consumerist\nthan later conceptual art, the spirit of early conceptual art seems to\nhave carried on relatively undiluted into the very late twentieth and\ntwenty-first centuries, as witnessed by pieces such as Tracey\nEmin’s Unmade Bed, Damian Hirst’s The\nPhysical Impossibility of Death in the Mind of Someone Living,\nand Ai Weiwei’s Surveillance Camera.\n\nThe highly individualised character of the intellectual exploration\nthat conceptual art urges us to engage in has always been such that\nany attempt to pinpoint a specific common denominator other than this\ngeneral vision and approach to art, art-making and society at large\ninvariably fails to catch its very essence. The means of artistic\nexpression, we are told, are infinite and the topics available for\nquestioning and discussion are limitless. It belongs to the very\nnature of conceptual art, then, to be – like Lewis’\nCheshire cat – elusive and slippery. Conceptual artists, be it\nJoseph Beuys or Marina Abramovic, pursue artistic originality and\nrepresentation in every possible way. For that reason, one\nmight find oneself obliged to replace the slightly lofty cliché\naccording to which there are as many definitions of conceptual art as\nthere are conceptual artists, with an even more extreme version of the\nclaim, namely, that there are as many definitions of conceptual art as\nthere are conceptual artworks.\n\nNevertheless, in the midst of this deliberately produced uncertainty\nabout the nature of conceptual art, a handful of characteristics and\ngeneral aims do seem to recur, and although they should not be seen as\ncriteria for conceptual art strictly speaking, they may be considered\ntenets fundamental to (most) conceptual art.\n1.2 The Limits of Art and the Role of Artists\n\nFirst and foremost, conceptual art challenges our intuitions\nconcerning the limits of what may count as art and what it is an\nartist does. It does so, on the one hand, by postulating ever more\ncomplex objects as candidates for the status of ‘artwork’,\nand, on the other hand, by distancing the task of the artist from the\nactual making and manipulating of the artistic material.\n\nA characteristic way in which conceptual art explores the boundaries\nof the artwork is by a process of questioning where the realm of the\nartistic ends and that of utility begins. Continuing the tradition of\nMarcel Duchamp’s readymades such as Fountain, or\nBottlerack, it sets out to overthrow our traditional\nconceptions of what an art object should be made of and what it should\nlook like. The artwork is a process rather than a\nmaterial thing, and as such it is no longer something that\ncan be grasped merely by seeing, hearing or touching the end product\nof that process. The notion of agency in art-making is thus\nparticularly emphasised. In many cases, the ‘art-making’\nand the ‘artwork’ come together, because what is sought is\nan identification of the notion of the work of art with the conceptual\nactivity of the artist. Conceptual art, politicised and influenced by\nevents such as the ‘May Days’ in Paris (1968), the\n‘Hot Autumn’ in Italy (1969), the Vietnam War, and the\nrise of feminism, promotes a rapprochement between art-making\nand criticism – both artistic and social – by raising\nquestions about the products of artistic activities and the very\npurpose of art. To use the words of Joseph Kosuth, it ‘annexes\nthe functions of the critic, and makes a middle-man\nunnecessary.’ (Guercio 1999, 39).\n1.3 Artistic Media\n\nAs a direct result of its examination of what may properly qualify as\nart, and of the markedly broad conception of what may constitute an\nart object resulting from this examination, conceptual art tends to\nreject traditional artistic media such as conventional painting or\nsculpture. Instead, it has found itself drawn to alternative means of\nexpression, including performances, photography, films, videos,\nevents, bodies, new ready-mades and new mixed media. In a nutshell,\nnothing can be ruled out in principle for use as possible artistic\nmedia, as can be seen, for example, in Richard Long’s photograph\nof a line made in the grass by\n walking[2],\n Bruce Nauman’s nine minute film of the artist himself playing\none note on a violin whilst walking around in his\n studio[3],\n Janine Antoni’s use of chocolate and soap, Marina\nAbramovic’s display of an array of everyday objects, including\nknives, torches and feathers, which the audience is invited to apply\ndirectly on to the artist’s body, and Piero Manzoni’s act\nof signing a woman’s\n arm[4].\n1.4 Art as Idea\n\nThe most fundamentally revisionary feature of conceptual art is the\nway in which it proclaims itself to be an art of the mind rather than\nthe senses: it rejects traditional artistic media because it locates\nthe artwork at the level of ideas rather than that of\nobjects. Because more weight tends to given to creative\nprocess than physical material, and because art should be about\nintellectual inquiry and reflection rather than beauty and aesthetic\npleasure (as traditionally conceived), the identity of the work of art\nis said to lie in the idea at the heart of the piece in question. In\nthe words of Kosuth, ‘[t]he actual works of art are ideas’\n(Lippard 1973, 25). For conceptual art, ‘the idea or concept is\nthe most important aspect of the work’ (LeWitt 1967, 166). Art\nis ‘de-materialised’, and in this sense held to be prior\nto its materialisation in any given object.\n\nThe claim that the conceptual artwork is to be identified with an idea\nthat may be seen to underlie it has far-reaching ramifications. It not\nonly affects the ontology of the conceptual artwork but also\nprofoundly alters the role of the artist by casting her in the role of\nthinker rather than object-maker. Moreover, it calls for a thorough\nreview of the way in which we perceive, engage and appreciate\nartworks. Further still, it links art so intimately to ideas and\nconcepts that even a principled distinction between the domain of art\nand the realm of thought seems difficult to preserve.\n1.5 Semantic Representation\n\nFor all these reasons, the kind of representation employed in\nconceptual artworks is best described in terms of the transmission of\nideas. In conceptual art, the representation at work can generally be\nseen as semantic rather than illustrative. That is\nto say, it sets out to have and convey a specific meaning rather than\nto depict a scene, person or event. Even in cases where a work makes\nuse of illustrative representation, conceptual art is still putting\nthat representation to a distinctively semantic use, in the sense of\nthere being an intention to represent something one cannot see with\nthe naked eye. Accordingly, the conceptual artist’s task is to\ncontemplate and formulate this meaning – to be a\n‘meaning-maker’.\n2. The Philosophy of Conceptual Art – What is it?\n\nOn the whole, the philosophical concerns raised by conceptual art can\nbe divided into two main categories. First, there are specific\nquestions to do with conceptual art itself, and the claims which\nunderpin the project that drives it. Philosophical investigations\nmight thus be called for not only in relation to the internal\nconsistency and coherence of the project and its set goals, but also\nwith regards to the particular tenets outlined above. For example,\nwhat does it mean to say that every single thing, person or event is a\npossible candidate for an artistic medium and does that suggestion not\nrender the category of art, as we know it, redundant?\n\nSecond, conceptual art poses philosophical problems from a wider\nperspective, in so far as one might expect philosophy to provide us\nwith unitary accounts of the nature of art, the role of the artist,\nand artistic experience. In many important respects, conceptual art\nsits very uncomfortably with other, often more traditional artforms\nand artworks, and this tension highlights a pressing issue for anyone\ninterested in the possibility of a universal theory of art. For if\nthere is to be one rule for conceptual art and another for all other\nkinds of art, are there still good grounds for thinking of conceptual\nart as a kind of art? Moreover, could not every particular kind of\nartform or artwork demand a separate theory of art, artist and\nartistic experience?\n\nIf we are to sidestep such an intrinsic division between conceptual\nart on the one hand, and other kinds of art on the other, then\ntheories concerned mainly with art that is not conceptual will have to\nmake many significant concessions in order to incorporate the\nproblematic case that conceptual artworks present. At the very least,\na compromise will have to be reached concerning what we mean by the\nterm ‘artwork’.\n\nOne of the over-riding concerns that beset the philosophy of\nconceptual art is thus whether and, if so, why one should actively\npursue unified accounts in the philosophy of art. Whether one comes\nout of that investigation embracing a broader – albeit perhaps\nvaguer – set of concepts and tools than one started off with, or\nwhether one considers oneself forced to abandon any hope of anything\nbut very specific theories of art, artist, and artistic experience,\nconceptual art obliges us to think about where we stand on these\nissues.\n\nPhilosophizing about conceptual art is, then, not merely\nphilosophizing about one specific artform. It is philosophizing about\nthe most revisionary kind of art, one that sees its own task as being\nprofoundly philosophical in nature. Let us now turn to five more\nspecific philosophical themes that conceptual art urges us to\nconsider.\n3. Five Philosophical Themes\n3.1 The Definition of Art\n\nThe problem of defining art is by no means a problem for conceptual\nart alone. Two principal difficulties immediately arise in the context\nof any attempt to form a definition. First, the category of art is\nparticularly heterogeneous. Simply put, there seems to be an infinite\nvariety of things, or kinds of thing, that need to fall under its\njurisdiction. Second, there is great variety of opinion on what any\nputative definition of art should actually consist of.\n\nOn the standard conception, a definition is something that provides us\nwith necessary and sufficient conditions for some thing x to\nbe F, so that, for example, it is a necessary and sufficient condition\nfor a number to be an even number that it is (i) an integer and (ii)\ndivisible by two. Accordingly, a definition of art must be capable of\noutlining a clear set of conditions that must be satisfied.\n\nThere have been no shortages of attempts to define art in this manner.\nMost prominently perhaps, it has been suggested that art ought to be\ndefined in terms of its aesthetic character, so that, roughly,\nx is an artwork if and only if x gives rise to an\naesthetic experience (e.g., Beardsley 1958). Notwithstanding the\ndifficulties that this particular suggestion entails (we shall return\nto this in §3.3), the advent of a kind of art that is as\nprofoundly revisionary and difficult to classify as conceptual art\nrenders the attempt to provide a general definition applicable to\nall art particularly complex. It is no coincidence, then,\nthat a neo-Wittgensteinian approach came to dominate the philosophy of\nart in the late 1950s and 1960s. Drawing support from\nanti-essentialist theories of language, it was suggested that art was\nnumbered among the various concepts that are, by their very nature,\n‘essentially contested’ (Gallie 1948; see also Weitz\n1956). That is to say, some concepts – such as that pertaining\nto sports, for example– simply do not allow for definitions in\nterms of necessary and sufficient conditions, and art is best as\nunderstood as one of them. In the words of Morris Weitz, art may\nbe\n\nan open concept. New conditions have constantly arisen and will\nundoubtedly constantly arise; new art forms, new movements will\nemerge, which will demand decisions on the part of those\ninterested… as to whether the concept should be extended or\nnot. (Weitz 1956, 32)\n\n\nThe act of proposing a definition of art thus becomes a less stringent\nexercise of conceptual analysis. The alternative method proposed by\nneo-Wittgensteinians such as Weitz in attempting to identify art and\nexplain how we are to distinguish it from non-art is the notion of\nfamily resemblance (see Wittgenstein 1953,\n§66–71). Faced with the question ‘Is X an\nartwork?’, what we should do is try to detect strands of\nresemblance with paradigmatic instances of an artwork. If some\nsignificant resemblance to such a paradigmatic case is observed, we\ncan rightly call the object of our scrutiny a work of art.\n\nThe proposal, though interesting, is not without its own difficulties.\nOne problem that immediately arises relates to the idea of resemblance\nitself, and the way it rapidly expands in such a way as to render it\nclose to useless. This is for the simple reason that we can always\nfind some way in which some given thing may be said to resemble any\nother given thing. This kind of openness, it is important to note, is\nnot something that fits in with the programme of conceptual\nart. Whilst conceptual art does hold that any kind of object could be\na work of art, it is not saying that every object is a work\nof art. Far from it. Much conceptual art, in exploring the boundaries\nbetween the realms of the artistic and that of function and utility,\nis perceptually indistinguishable from non-art, such as Andy\nWarhol’s Brillo Boxes. In that sense, conceptual art\npresents a particularly difficult case for the neo-Wittgensteinian\nmethod of identification. After all, the only way in which\nWarhol’s Brillo Boxes does not resemble any other stack\nof Brillo Boxes is the sense in which the former is a work of art and\nthe latter is not. The notion of resemblance is clearly of little use\nhere.\n\nPicking up on this concern, Arthur Danto has famously suggested that\nit is in fact a non-manifest relation that makes something an artwork\nrather than an observable property (Danto 1981). That is to say,\nartworks acquire that status in virtue of their relations to the\nhistorical and social setting constituted by the practices and\nconventions of art, our artistic heritage, the intentions of artists,\nand so on — the ‘artworld’ (see also Dickie\n1974). The general idea here is that artworks are generated within a\nsocial and artistic context, and so being an artwork is a function of\ncertain social relations. Conceptual art reinforces the idea that art\nand non-art can be perceptually indistinguishable and so cannot be\nmarked off from each other by ‘exhibited’ properties\n alone.[5]\n\nSetting aside the details of such an account, one of the things\nconceptual art has helped philosophers to grasp more fully is that any\nsuccessful general definition, or indeed principled theory of the\nidentification of art, will need to have the non-manifest properties\nof artworks at its centre. It is the meaning that the artist infuses\ninto the work and the meaning that we as audience stand to gain from\nit that contains the key to its status as art (more on this in\n§3.4). To use the example of Warhol’s Brillo Boxes\nagain, the work of the conceptual artist seems primarily to be the\nwork of imbuing objects with a particular kind of meaning.\n\nA more promising line of enquiry has been developed by David Davies.\nTaking his cue from the problems posed by conceptual art, Davies\nargues that a unified definition of art can only be found if we think\nof art primarily in terms of the creative process or series of actions\nresulting in a material thing or other ‘focus of\nappreciation’. In that sense, the artwork is primarily\nidentified with the intentional acts through which it comes into being\nrather than with the end-product of that process (Davies 2004). Art,\non this view, is better understood as a kind of performance than as a\nmanifest object. By shifting the focus of our attention in this way,\nwe can overcome many of the difficulties associated with defining art,\nmost notably that of its heterogeneity. It may be, then, that the most\nenduring lesson to be learnt from conceptual art with regards to the\ndefinition of art is not so much that a conceptual analysis of art is\ncompletely unattainable, as that we simply have been looking in the\nwrong place.\n3.2 The Ontology and Media of Art\n\nThe claim that conceptual art is to be identified less with a\nperceivable object than with the meaning or idea it aims to convey,\ngives rise to a host of complex ontological questions. The rejection\nof traditional artistic media, together with the de-materialisation of\nthe art object, forces us to reconsider what seemed to be relatively\nuncomplicated aspects of artistic experience. The answers to questions\nsuch as ‘Is there in fact any one thing (or set of things) that\nwe must perceive in artistic appreciation?’, and ‘Is it a\nnecessary condition for the existence of an artwork that it have a\nmedium?’ suddenly become a good deal less obvious.\n\nIn the first instance, conceptual art drives us to review the common\nassumption that appropriate appreciation and engagement with an\nartwork must involve a direct first-hand experience of that piece\nitself. The idea here, to use Frank Sibley’s words, is that\n\n[p]eople have to see the grace or unity of a work,\nhear the plaintiveness or frenzy in the music,\nnotice the gaudiness of colour scheme, feel the\npower of a novel, its mood, or its uncertainty of tone. They may be\nstruck by these qualities at once, or they may come to perceive them\nonly after repeated viewings, hearings, or readings, and with the help\nof critics. But unless they do perceive them for themselves, aesthetic\nenjoyment, appreciation, and judgement are beyond them… the\ncrucial thing is to see, hear, or feel. (Sibley 1965, 137).\n\n\nThe assumption in question is, then, that although we seem to gain\nsomething from looking at, for example, a postcard or poster of\nKatsushika Hokusai's Fine Wine, Clear Morning or\nÉlisabeth Vigée Le Brun’s Self-Portrait in a\nStraw Hat , a genuine judgement about its artistic character\nnecessitates one’s own un-mediated perceptual experience of it.\nBut – and herein lies the crux of the problem for conceptual art\n– what if there is nothing for us to get a first-hand perceptual\nexperience of? In the case of Walter De Maria’s Vertical\nEarth Kilometer\n (1977)[6],\n a kilometre-long metal shaft plunged into the surface of the earth so\nthat only the very top is visible, first-hand perceptual experience is\nsimply not something that can be had. More pertinently, what does it\neven mean to have a perceptual engagement with an artwork that claims,\nbasically, to be an idea?\n\nPerhaps the most pressing question, however, has to do with the extent\nto which we are to take conceptual art’s claim of\nde-materialisation seriously. Does the de-materialisation of such art\nnot suggest that there is not only a rejection of traditional artistic\nmedia in conceptual art, but an outright refutation of artistic media\nin general? One possible way of making sense of this idea is with a\ndistinction outlined by Davies, namely that between physical\nmedium and vehicular medium (Davies 2004). Crucially, a\nvehicular medium is said to incorporate not only physical objects\n(such as paintings and sculptures, say) but also actions, events, and\ngenerally more complex entities. In Davies’ words, ‘[t]he\nproduct of an artist’s manipulation of a vehicular medium will\nthen be the vehicle whereby a particular artistic statement\nis articulated… The vehicle may, as in the case of\nPicasso’s Guernica, be a physical object, or, as in the\ncase of Coleridge’s Kubla Kahn, a linguistic\nstructure-type, or, as arguably in the case of Duchamp’s\nFountain, an action of a particular kind.’ (Davies\n2004, 59). Adhering to this vehicular medium in art, may then at least\nequip philosophers with a notion that can deflate the concern of\nwhether conceptual art, by rejecting physical media, denies the need\nfor all artistic media.\n\nClearly, conceptual art is not the first kind of art to raise\nontological concerns of this kind. After all, music and literary art,\nbe it traditional or avant-garde, hardly present\nstraightforward cases either. The question of what exactly\nconstitutes, say, a novel or a musical work have been widely discussed\nfor some time (e.g. Davies 2001; Ingarden 1973; Wollheim 1980)\nBuilding on the suggestion that artworks such as musical pieces and\nliterary works are best understood in terms of universals or\n‘types’, one view that has been widely discussed in the\nlast two decades or so is based on the idea that not only musical and\nliterary artworks, but all artworks, are types. More\nspecifically, they are to be conceived of as ‘event- or\naction-types’ (Currie 1988). According to this theory, the\nartwork is thus not the material thing itself but, rather, the way in\nwhich the artist arrived at the underlying structure shared by all\ninstances or performances of that work.\n\nWhilst the general approach fostered by both Currie and Davies is\nclearly congenial to some aspects of conceptual art, it might\nnevertheless still be the case that further work needs to be done if\nthe view that artworks are basically event- or action-types is to\naccommodate all art in the conceptual tradition. Further questions\ninclude what role, if any, is played by the (set of) material thing(s)\nthat many conceptual artists undeniably do present us with.\nWhat, in other words, are we to make of the object (be it a human body\nor a video-recording) that is supposed to transmit the idea which, in\nturn, is said to be the genuine artwork? A good philosophical\nexplanation needs to be given as to how the material thing that is\nregularly presented to the audience is, in fact, relevant to the\nartwork itself. Is the vehicular medium constitutive of the artwork,\nand if so, how exactly does that square with the claim of\nde-materialisation?\n3.3 The Aesthetic Value of Art\n\nUnderlying the claim that we need to have a direct experiential\nencounter with an artwork in order to appreciate it appropriately is\nthe fact that some of the properties that bear on the value of a work\ncan only be grasped in this way. The properties in question here are\ngenerally aesthetic properties, and the assumption motivating\nthe experiential requirement is that the appreciation of artworks\nnecessarily involves an aesthetic element (i.e. not necessarily beauty\nper se, but something aesthetically pleasing or\nrewarding).\n\nHowever, one of the most distinguishing features of conceptual art,\nsetting out as it does to replace illustrative representation with\nsemantic representation, is that it does not prioritise aesthetic\nexperience in a traditional sense. Conceptual art is intended as an\nart of the mind: it generally appeals to matters of the intellect and\nemphasises art’s cognitive rather than\naesthetic value. In the words of Timothy Binkley, traditional\naesthetics is preoccupied ‘with perceptual entities’ and\nthis ‘leads aesthetics to extol and examine the “work of\nart”, while averting its attention almost entirely from the\nmyriad other aspects of that complex cultural activity we call\n“art” ’ (Binkley 1977, 271).\n\nWe can now see that the experiential requirement may well fail to have\nany bite with regards to conceptual artworks because the\nartist’s aim does not necessarily involve conferring to the work\nof art properties that must be experienced directly in order to be\ngrasped and fully appreciated. If there is to be any kind of\nfirst-hand experiential requirement for the appropriate appreciation\nof conceptual artworks, it will perhaps be of a kind that focuses on\nan imaginative engagement with the idea central to the artwork rather\nthan a perceptual experience of its aesthetic properties (see\nSchellekens 2007)\n\nThe main philosophical question highlighted by conceptual art in this\ncontext, then, is the following: ‘Does art really need to be\naesthetic, and, if so, in what sense?’. In Binkley’s\nopinion, and in support of conceptual art, one does not necessarily\nhave to think of art in terms of aesthetic value –whilst a lot\nof ‘art has chosen to articulate in the medium of an aesthetic\nspace’, there is ‘no a priori reason why art must confine\nitself to the creation of aesthetic objects. It might opt for\narticulation in a semantic space instead of an aesthetic one so that\nartistic meaning is not embodied in a physical object or event’\n(Binkley 1977, 273).\n\nHowever, not everyone has endorsed such a liberal view about the\nseparation between the aesthetic and the\n artistic[7].\n If art does not aim at having aesthetic value, what, one might argue,\nwill set it apart from non-art? Which view one decides to favour on\nthis point may well end up being an issue about definition. If one\nwishes to define art in terms of aesthetic experience, the question\nfinds a clear-cut answer, namely that conceptual art simply cannot be\nconsidered a kind of art. The down-side of that position is, however,\na whole set of difficult concerns to do with things, such as nature or\npersons, that hardly qualify as art even though they invite aesthetic\nexperiences. If one is impressed by these worries and cannot see any\ndecisive philosophical reason to uphold the aesthetic view, there is\nlittle, if anything, to block a conception of art which is not\nnecessarily aesthetic. One may, then, think of aesthetic value as\none kind of artistic value that, alongside with moral,\nreligious, political, historical and financial value, some artworks\nhave and others do\n not.[8]\n\nNow, even if it is granted that art need not be aesthetic, it is still\npossible to hold that conceptual art does not qualify as good\nart because it does not (aim to) yield aesthetic experiences. But\nwhile this may be a viable position to hold in relation to the project\nof conceptual art in general, it cannot be used to attack conceptual\nart on its own grounds. Saying, for example, of Michael\nCraig-Martin’s An Oak Tree that one cannot consider it\na great work of art because it fails to give rise to a distinctively\naesthetic kind of pleasure does not actually undermine the project.\nConceptual art, as we now know, is more about conveying meaning\nthrough a vehicular medium than about furnishing its audiences with\nexperiences of, say, beauty. Any attack on this fundamental feature of\nconceptual art targets not so much an individual work of art but\nrather finds fault with the artistic tradition itself.\n3.4 The Interpretation of Art\n\nAt the most basic level of inquiry, two queries arise about\ninterpretation in art: (i) what ‘tools’ do we use to\ninterpret artworks?, and (ii) what is it we do when we interpret\nartworks? In the case of conceptual art, a satisfactory answer to (i)\nwill most probably appeal to elements such as the narrative aids\nprovided by artists or curators (e.g. catalogues, titles, exhibited\nexplanations, labels, etc.); the appropriate mode of perception (i.e.\nlooking or listening); and what we know about the artwork’s and\nartist’s social, historical, political or artistic context.\nDepending on the ontological status of the particular piece (if it is,\nsay, a ready-made or a performance), these elements can be combined in\ndifferent ways to explain our interpretative habits and practices.\n\nIn addressing (ii) we will most likely need to refer to the various\nmental abilities we put to use in such interpretative exercises (e.g.\nimagination, empathy); and also to ask precisely what the target of\nour interpretation is. This latter task is not as unproblematic as it\nmay seem, for it is not always clear whether it is the object itself\nthat should be under scrutiny, the object’s perceptual\nproperties (and, if so, which), the idea at the heart of the work, or\nthe artist’s intentions in making the piece. It seems unlikely\nthat the question will find an adequate answer until we find an\nacceptable solution to the problem mentioned above, namely ‘Is\nthe vehicular medium a constitutive part of the conceptual artwork or\nnot, and if so how?’.\n\nTwo further philosophical questions about the notion of artistic\ninterpretation take on a particularly complex dimension in relation to\nconceptual art. First, exactly what information is relevant in\nartistic interpretation? And, more importantly, to what extent should\nthe artist’s intention be allowed to determine the\nappropriate interpretation? Views differ widely on this topic. In\ntheir article, ‘The Intentional Fallacy’, William Wimsatt\nand Monroe Beardsley famously argue in relation to the literary arts\nthat the only kind of evidence that is relevant to interpretation is\nthat which is internal to the work in question. (Wimsatt &\nBeardsley 1946). An artist’s intention or design is of no\ninterpretative significance. Obviously, this position seems difficult\nto defend in the case of conceptual art: when we are dealing with\npieces such as Warhol’s Brillo Boxes, where the\ninternal evidence is clearly insufficient to discern that it is an\nartwork in the first place, it seems that we need to know that Warhol\nintended the boxes to be viewed qua art, at the very\nleast.\n\nNow, even if we do wish to defend the view that the artist’s\nintention needs to be taken into account somehow in the interpretation\nof conceptual art, further questions still require our attention here.\nMost centrally, should the artist’s intention always be\nconsidered the decisive factor in interpretation and\nmust it always be involved? Generally speaking, there are two\nmain strands of intentionalist positions available. On the one hand,\nthere is an approach which holds that the artist’s intention\ndetermines an artwork’s meaning, and thus cannot be overlooked\n– or indeed superseded – in artistic interpretation (e.g.,\nCarroll 1992). On the other hand, there is a view that the interpreter\nought to construct the best hypothesis concerning the artist’s\nactual intention with the help of, say, the text and biographical\nnotes, and that this hypothesis confers meaning on the work in\nquestion (e.g., Levinson 1992).\n\nAt least at a first glance, it may seem that conceptual art presents a\nstronger case for the first approach to interpretation, since the\nartist’s intention is all we have to go by, quite literally, in\nworks such as Robert Barry’s simple statement entitled All\nthe Things I Know But of which I am Not at the Moment Thinking\n(1969) (see, e.g., Maes 2010 and Gover 2012). Nevertheless, the\nquestion cannot be settled quite so easily, for many conceptual\nartists make a point of putting all the interpretative onus on the\nspectator. How often are we told, after all, that a specific\nartwork’s meaning rests entirely in our hands; that ‘it\nmeans whatever you want it to mean’?\n\nThis leads us to the second question that is especially pertinent for\na kind of art that sets out to convey an idea or meaning, namely\nwhether there can be more than one correct or appropriate\ninterpretation of an artwork. Again, several theories present\nthemselves as eligible candidates in relation to this problem. One\nsuggestion has centred around the idea that there can be a\nmultiplicity of appropriate or correct divergent interpretations of\none and the same artwork which cannot be reduced to one underlying\ninterpretation or ranked in relation to each other (e.g., Margolis\n1991; Goldman 1990). In opposition to this view, however, another\napproach has it that there is in fact always a single best\ninterpretation which is better than any other (e.g., Beardsley 1970).\nThe aim of artistic interpretation is, then, in Matthew Kieran’s\nwords, ‘restricted to discovering the one true meaning of an\nartwork.’ (Kieran 1996, 239). Whilst conceptual art certainly\nseems to rest on something like the interpretative plurality of the\nfirst view, it is not obvious how a kind of art that presents itself\nas an idea can, in reality, accommodate such indeterminacy.\n\nThere are good reasons to believe that of all the questions conceptual\nart gives rise to, interpretation is the most problematic from an\ninternal point of view. The conundrum can be put in the following\nterms. If the conceptual work is the idea, it seems reasonable to\nassume that artistic interpretation will consist primarily in coming\nto understand that idea (which is conceded by the artist to the\nartwork considered as such). In other words, if we take conceptual\nart’s de-materialisation claim seriously, we are left with a\nnotion of interpretation which is relatively constrained to the\nartist’s intention and to the claim that that intention\ndetermines the appropriate or correct interpretation for that\nparticular work.\n\nAs we have seen, though, we are often encouraged by conceptual artists\nto take the interpretative exercise into our own hands, so to speak,\nand not be shy to use features about ourselves and our own lives as\ninterpretive tools. We are, in other words, asked to combine the idea\nof art as idea with the claim that we can, as spectators, convey an\nentirely new and fresh interpretation onto an artwork that is nothing\nbut an idea which, by definition, needs to be about or concerned with\nsomething. So, if the idea is the art, then how can my idiosyncratic\ninterpretation of that idea be anywhere near valid? It seems, then\nthat in order to be coherent, conceptual art must give up either the\nclaim that the actual artwork is nothing other than the idea, or the\nclaim that the interpretative onus lies on the viewer.\n3.5 The Cognitive Value of Art\n\nIn seeking to convey a semantic representation through a vehicular\nmedium, conceptual art arguably aims to have cognitive – rather\nthan aesthetic – value. By cognitive value, what is meant is\nsimply the value an artwork may have in virtue of enhancing or\nincreasing our understanding of some topic, notion or event.\nInterestingly, conceptual art seems to assume that the aesthetic\ndetracts from or divests art of its possible cognitive value in such a\nway as to render the two kinds of value close to mutually exclusive\n(Schellekens 2007).\n\nThe attempt to separate the aesthetic from the cognitive is far from a\nrecent investigative endeavour in philosophical circles. In the very\nfirst section of Kant’s Critique of the Power of\nJudgement, a clear-cut distinction is outlined between aesthetic\nand cognitive (or ‘logical’) judgements. However, few\nartistic movements have pressed these questions about the division\nbetween aesthetic value on the one hand, and cognitive value on the\nother, as scrupulously and explicitly as conceptual art. In fact,\nconceptual art makes things very difficult for itself by holding that\nthe only kind of artistic value that is entirely legitimate\nis cognitive value.\n\nClearly, conceptual art is not the only kind of art that may have\ncognitive value – many other artforms aim to have cognitive\nvalue in addition to aesthetic value – and most of us\nwould agree that part of why we find art rewarding is precisely\nbecause it often yields some kind of understanding. That is to say, we\nread novels, look at paintings and listen to music not only because of\nthe pleasure it may afford, but also because it tends to make us\nricher human beings, better able to make sense of the world around\nus.\n\nUncontroversial as this claim may seem, some philosophers have denied\nthat art should either have or seek to have cognitive value. Most\nfamously perhaps, expressivists such as Clive Bell and Roger Fry held\nthat art should only seek to express and arouse emotions (Bell 1914;\nFry 1920). James Young has defended a view whereby\navant-garde art, like conceptual art, cannot yield any\nsignificant knowledge or understanding (Young 2001, 77).\n\nYoung’s argument focuses on the notion of exemplification which\nhe locates at the heart of the only kind of semantic representation\nand cognitive value that can be ascribed to artworks such as\nconceptual ones. Exemplification is a form of reference to properties\nby means of a sample (or exemplar). An exemplar ‘stands for some\nproperty by [non-metaphorically, literally] possessing the\nproperty’ (Young 2001, 72). In the case of conceptual art, a\nwork then exemplifies an idea or concept. So, for example, Tom\nMarioni’s The Act of Drinking Beer with One’s Friends\nis the Highest Form of Art\n (1970)[9]\n – a piece involving the artist and his friends drinking beer\ntogether – is an exemplar of the idea at the heart of the work,\nnamely that drinking beer with one’s friends is the highest\nart-form of all. This is the work’s statement. However, as Young\npoints out, it doesn’t follow from the fact that something\nexpresses a statement or has meaning that it has significant cognitive\nvalue. All things considered, the kind of statement that conceptual\nartworks and their like are typically able to make, according to\nYoung, are merely truisms. If conceptual art yields cognitive value,\nthat is to say, it tends to be so trivial that it barely deserves the\nname.\n\nThe argument puts a finger on an experience shared by many spectators\nof conceptual art who feel conned or deceived by it. Not only are\nconceptual artworks not beautiful, one might object, they don’t\neven tell us anything over and beyond banal clichés. What,\nthen, is conceptual art really good for?\n\nIf there is to be a way out of this difficulty, we will have to take\nthe bull by the horns and discuss exactly what (kind of) understanding\none may gain from it. This answer will have to be cashed out in terms\nof two concerns: one about the content of the knowledge, and\nanother about the kind of knowledge in question. First,\nknowledge yielded by art can be about the artwork – not only the\ntechniques employed, the work’s history and tradition, and so\non, but also the meaning and thoughts that the work conveys. Second,\nart can yield either propositional knowledge or knowledge by\nacquaintance. Whereas the first consists of knowledge given to us in\nterms of propositions and can either be concerned with the artwork\nitself (e.g. knowledge ‘that [Manet's famous painting]\nrepresents the Emperor Maximilan’s execution') or a reality\nbeyond that work (e.g. knowledge ‘that horrible things are often\ndone in the name of political revolutions’), the second kind of\nknowledge has the potential to enable one to imagine what it would be\nlike to be in a certain position or situation, to empathize, to come\nvery close to experiencing what it would be like to have that kind of\nexperience first-hand (e.g. what it is like to witness the execution\nof a dishonoured Emperor).\n\nThe notions of knowledge and cognitive value, whilst at the very heart\nof the conceptual project, raise a manifold of important questions\nthat require solid and cogent philosophical answers. Perhaps\nexemplification can still serve an epistemological purpose by inviting\nus to engage with the issues raised by a work of art in a richer and\nmore imaginative way; in a way that makes us think about questions of\nphilosophical interest in particular way – a way that\npropositions alone cannot do? Perhaps the key to conceptual\nart’s value lies in a more challenging intellectual relationship\nwith the work, a genuine engagement with the idea in question.\nExploring this avenue may yet help us see what kind of non-trivial\ncognitive value conceptual art is capable of yielding.\n4. Further Questions\n\nMany more questions centred around these five philosophical themes\nremain to be examined in relation to conceptual art. With regards to\nconcerns about defining art, we need to address the increasing number\nof worries to do with exactly how we are to distinguish art from\nnon-art, and indeed whether there really is a distinction (if only\ntheoretical) to be drawn here. That is to say, if conceptual art is at\ntimes not only perceptually indistinguishable from non-art but it is\nalso the case that everything is alleged to be (part of) a potential\nartwork, perhaps the inevitable outcome is that there simply cannot be\na principled distinction between art and non-art. So, does the\nconceptual project lead to the end of the category of art as such?\n\nFrom the ontological perspective, this set of concerns acquires an\neven more aggressive flavour: if art should be all about putting\nforward ideas and making statements, why, one might wonder, do we need\nthe conceptual artwork at all? Can we not merely ask the same\nquestions and make the same statements directly?\n\nIn addition to these questions, the host of issues that have been\nraised about interpretation, intention, appreciation and the way they\nare (or should be) related have not yet been silenced. For art that is\nas discourse-dependent as most conceptual art is, it is not always\nclear whether there is anything more to interpreting conceptual art\nthan just being told what the idea in question is. And if so, can we\nstill call this interpretation?\n\nFinally, what are we to make of the relation between aesthetic and\ncognitive value in conceptual art – should they be considered as\nin opposition or even as mutually exclusive? If the only kind of value\nthat is of genuine artistic importance is cognitive value, it will be\ndifficult to avoid the definitional and ontological concerns mentioned\nabove. Also, it will call for a deeply revisionary conception of art,\none fundamentally hostile to the very notions we are probably most\nused to associating with art, namely beauty and aesthetic\npleasure.\n\nCentral to the philosophy of conceptual art is thus the provocative\nspirit of the project under investigation – conceptual art\nthrows down the gauntlet by challenging us to reconsider every aspect\nof artistic experience, and it may well be up to philosophy to pick it\nup and address some of the questions conceptual art makes its business\nto raise. Conceptual art actively aims to be thought-provoking,\nstimulating and inspiring, and if only for that reason, philosophers\ninterested in art should not pass it by unaffected.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Alberro, Alexander &amp; Blake, Stimson (eds.), 1999.\n<em>Conceptual Art: A Critical Anthology</em>, Cambridge, MA: MIT\nPress.",
                "Alberro, Alexander&amp; Buchmann, Sabeth (eds.), 2006. <em>Art\nafter Conceptual Art</em>, Cambridge, MA &amp; Vienna: MIT\nPress/General Foundation.",
                "Beardsley, Monroe, 1970. <em>The Possibility of Criticism</em>,\nDetroit: Wayne State University Press.",
                "Bell, Clive, 1914. <em>Art</em>, London.",
                "Binkley, Timothy, 1977. ‘Piece: Contra Aesthetics’,\n<em>Journal of Aesthetics and Art Criticism</em>, 35:\n265–277.",
                "Budd, Malcolm, 1995. <em>Values of Art: Painting, Poetry, and\nMusic</em>, London: Penguin.",
                "Caldarola, Elisa, 2021. ‘On Tags and Conceptual Street\nArt’, <em>Philosophical Inquiries</em>, IX(2):\n93–114.",
                "–––, 2021. ‘Exemplification,\nKnowledge, and Education of the Emotions through Conceptual\nArt’, <em>Discipline Filosofiche</em>, XXXI(1):\n179–195.",
                "Carroll, Noel, 1992. ‘Art, Intention, and\nConversation’, <em>Intention and Interpretation</em>, G.\nIseminger (ed.), Philadelphia: Temple University Press, pp.\n97–131.",
                "Corris, Michael (ed.), 2004. <em>Conceptual Art: Theory, Myth, and\nPractice</em>, Cambridge: Cambridge University Press.",
                "Cray, Wesley, 2014. ‘Conceptual Art, Ideas and\nOntology’, <em>Journal of Aesthetics and Art Criticism</em>, 72:\n265–277.",
                "Currie, Gregory, 1988. <em>An Ontology of Art</em>, New York: St\nMartin’s Press.",
                "Dal Sasso, David &amp; Schellekens, Elisabeth,\n2022. <em>Aesthetics, Philosophy and Conceptual Art.</em> London:\nBloomsbury. ",
                "Danto, Arthur C., 1964. ‘The Artworld’, <em>Journal of\nPhilosophy</em>, 61: 571–584.",
                "–––, 1981. <em>The Transfiguration of the\nCommonplace</em>, Cambridge, MA: Harvard University Press.",
                "Davies, David, 2004. <em>Art as Performance</em>, Oxford:\nBlackwells.",
                "Davies, Stephen, 2001. <em>Musical Works and Performances: A\nPhilosophical Exploration</em>, Oxford: Oxford University Press.",
                "Dickie, George, 1973. ‘The Institutional Conception of\nArt’, in Tilghman, Benjamin (ed.). <em>Language and\nAesthetics</em>, Lawrence: University Press of Kansas, pp.\n21–30.",
                "–––, 1974, <em>Art and the Aesthetic: An\nInstitutional Analysis</em>, Ithaca, NY: Cornell University\nPress.",
                "Fry, R., 1920. <em>Vision and Design</em>, London: Chatto &amp;\nWindus.",
                "Godfrey, Tony, 1998. <em>Conceptual Art</em>, London: Phaidon\nPress.",
                "Goldie, Peter &amp; Schellekens, Elisabeth (eds.), 2007.\n<em>Philosophy and Conceptual Art</em>, Oxford: Oxford University\nPress.",
                "–––, 2009. <em>Who’s Afraid of Conceptual\nArt?</em>, London: Routledge.",
                "Goldman, Alan, 1990. ‘Interpreting Art and\nLiterature’, <em>Journal of Aesthetics and Art Criticism</em>,\n48: 205–14.",
                "Gover, Karen, 2012. ‘What is Humpty Dumptyism in\nContemporary Art? A Reply to Maes’, <em>British Journal of\nAesthetics</em>, 52: 169–181.",
                "Hanson, Louise. 2015. “Conceptual Art and the Acquaintance\nPrinciple.” <em>The Journal of Aesthetics and Art\nCriticism</em>, 73(3): 247–258.",
                "Harrison, Charles, 1991. <em>Essays on Art and Language</em>,\nCambridge, MA: MIT Press.",
                "Ingarden, Roman, 1973. <em>The Literary Work of Art</em>, G.G.\nGrabowicz (trans.), Evanston, Ill.: Northwestern University\nPress.",
                "Irvin, Sherri &amp; Dodd, Julian, 2017. ‘In Advance of the\nBroken Theory: Philosophy and Contemporary Art’, <em>Journal of\nAesthetics and Art Criticism</em>, 75(4): 375–386.",
                "Kieran, Matthew, 1996. ‘In Defence of Critical\nPluralism’, <em>British Journal of Aesthetics</em>, 36:\n239–251.",
                "Kosuth, Joseph, 1969. <em>Art After Philosophy and After:\nCollected Writings, 1966–1990</em>, Cambridge, MA: MIT\nPress.",
                "Lewitt, Sol, 1967. ‘Paragraphs on Conceptual Art’,\n<em>Artforum</em>, 5(10): 79–83.",
                "–––, 1969. ‘Sentences on Conceptual\nArt’, <em>Art-Language: The Journal of Conceptual Art</em>, 1\n(May): 11–13. Reprinted in Osborne, 2002.",
                "Levinson, Jerrold, 1979. ‘Defining Art Historically’,\n<em>British Journal of Aesthetics</em>, 19: 232–250.",
                "–––, 1992. ‘Intention and Interpretation:\nA Last Look’, <em>Intention and Interpretation</em>, G.\nIseminger (ed.), Philadelphia: Temple University Press, pp.\n221–256.",
                "Lippard, Lucy, 1973. <em>Six Years: The Dematerialization of the\nArt Object 1966–1972</em>, New York: Praeger.",
                "Maes, Hans, 2010. ‘Intention, Interpretation, and\nContemporary Visual Art’, <em>British Journal of\nAesthetics</em>, 50: 121–138.",
                "Margolis, Joseph, 1991. <em>The Truth About Relativism</em>,\nOxford: Blackwell.",
                "Meyer, Ursula, 1972. <em>Conceptual Art</em>, New York: Dutton\nPress.",
                "Morgan, Robert C., 1996. <em>Art into Ideas: Essays on Conceptual\nArt</em>, Cambridge: Cambridge University Press.",
                "Newman, M. &amp; Bird, J. (eds.), 1999. <em>Rewriting Conceptual\nArt</em>, London: Reaktion Books.",
                "Osborne, Peter (ed.), 2002. <em>Conceptual Art: Themes and\nMovements</em>, London &amp; New York: Phaidon Press.",
                "Pakes, Anna, 2019. ‘Can There Be Conceptual\nDance?’ <em>Midwest Studies in Philosophy</em>, 44:\n195–212.",
                "Piper, Adrian, 1993. ‘The Logic of Modernism’,\n<em>Flash Art</em>, 26: 56–58.",
                "Sauchelli, Andrea, 2016. ‘The Acquaintance Principle,\nAesthetic Judgments and Conceptual Art’, <em>Journal of\nAesthetic Education</em>, 50: 1–15.",
                "Schellekens, Elisabeth, 2005. ‘“Seeing is\nBelieving” and “Believing is Seeing”‘,\n<em>Acta Analytica</em>, 20: 10–23.",
                "–––, 2007. ‘The Aesthetic Value of\nIdeas’, <em>Philosophy and Conceptual Art</em>, Oxford: Oxford\nUniversity Press, pp. 71–91.",
                "Shelley, James, 2003. ‘The Problem of Non-Perceptual\nArt’, <em>British Journal of Aesthetics</em>, 43:\n363–78.",
                "Sibley, Frank, 1965. ‘Aesthetic and Nonaesthetic’,\n<em>Philosophical Review</em>, 74: 135–59",
                "Young, James, 2001. <em>Art and Knowledge</em>, London:\nRoutledge.",
                "Walton, Kendall, 1970. ‘Categories of Art’,\n<em>Philosophical Review</em>, 79: 334–67.",
                "Weitz, Morris, 1956. ‘The Role of Theory in\nAesthetics’, <em>Journal of Aesthetics and Art Criticism,</em>\n15: 27–35.",
                "Wimsatt, W. K. &amp; Beardsley M. C., 1946. ‘The Intentional\nFallacy’, <em>Sewanee Review</em>, LIV: 468–488.",
                "Wollheim, Richard, 1980. <em>Art and Its Objects</em>, Cambridge:\nCambridge University Press.",
                "Wood, Paul, 2002. <em>Conceptual Art</em>, London: Tate\nPublishing. Series: Movements in Modern Art."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Alberro, Alexander &amp; Blake, Stimson (eds.), 1999.\n<em>Conceptual Art: A Critical Anthology</em>, Cambridge, MA: MIT\nPress.</li>\n<li>Alberro, Alexander&amp; Buchmann, Sabeth (eds.), 2006. <em>Art\nafter Conceptual Art</em>, Cambridge, MA &amp; Vienna: MIT\nPress/General Foundation.</li>\n<li>Beardsley, Monroe, 1970. <em>The Possibility of Criticism</em>,\nDetroit: Wayne State University Press.</li>\n<li>Bell, Clive, 1914. <em>Art</em>, London.</li>\n<li>Binkley, Timothy, 1977. ‘Piece: Contra Aesthetics’,\n<em>Journal of Aesthetics and Art Criticism</em>, 35:\n265–277.</li>\n<li>Budd, Malcolm, 1995. <em>Values of Art: Painting, Poetry, and\nMusic</em>, London: Penguin.</li>\n<li>Caldarola, Elisa, 2021. ‘On Tags and Conceptual Street\nArt’, <em>Philosophical Inquiries</em>, IX(2):\n93–114.</li>\n<li>–––, 2021. ‘Exemplification,\nKnowledge, and Education of the Emotions through Conceptual\nArt’, <em>Discipline Filosofiche</em>, XXXI(1):\n179–195.</li>\n<li>Carroll, Noel, 1992. ‘Art, Intention, and\nConversation’, <em>Intention and Interpretation</em>, G.\nIseminger (ed.), Philadelphia: Temple University Press, pp.\n97–131.</li>\n<li>Corris, Michael (ed.), 2004. <em>Conceptual Art: Theory, Myth, and\nPractice</em>, Cambridge: Cambridge University Press.</li>\n<li>Cray, Wesley, 2014. ‘Conceptual Art, Ideas and\nOntology’, <em>Journal of Aesthetics and Art Criticism</em>, 72:\n265–277.</li>\n<li>Currie, Gregory, 1988. <em>An Ontology of Art</em>, New York: St\nMartin’s Press.</li>\n<li>Dal Sasso, David &amp; Schellekens, Elisabeth,\n2022. <em>Aesthetics, Philosophy and Conceptual Art.</em> London:\nBloomsbury. </li>\n<li>Danto, Arthur C., 1964. ‘The Artworld’, <em>Journal of\nPhilosophy</em>, 61: 571–584.</li>\n<li>–––, 1981. <em>The Transfiguration of the\nCommonplace</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Davies, David, 2004. <em>Art as Performance</em>, Oxford:\nBlackwells.</li>\n<li>Davies, Stephen, 2001. <em>Musical Works and Performances: A\nPhilosophical Exploration</em>, Oxford: Oxford University Press.</li>\n<li>Dickie, George, 1973. ‘The Institutional Conception of\nArt’, in Tilghman, Benjamin (ed.). <em>Language and\nAesthetics</em>, Lawrence: University Press of Kansas, pp.\n21–30.</li>\n<li>–––, 1974, <em>Art and the Aesthetic: An\nInstitutional Analysis</em>, Ithaca, NY: Cornell University\nPress.</li>\n<li>Fry, R., 1920. <em>Vision and Design</em>, London: Chatto &amp;\nWindus.</li>\n<li>Godfrey, Tony, 1998. <em>Conceptual Art</em>, London: Phaidon\nPress.</li>\n<li>Goldie, Peter &amp; Schellekens, Elisabeth (eds.), 2007.\n<em>Philosophy and Conceptual Art</em>, Oxford: Oxford University\nPress.</li>\n<li>–––, 2009. <em>Who’s Afraid of Conceptual\nArt?</em>, London: Routledge.</li>\n<li>Goldman, Alan, 1990. ‘Interpreting Art and\nLiterature’, <em>Journal of Aesthetics and Art Criticism</em>,\n48: 205–14.</li>\n<li>Gover, Karen, 2012. ‘What is Humpty Dumptyism in\nContemporary Art? A Reply to Maes’, <em>British Journal of\nAesthetics</em>, 52: 169–181.</li>\n<li>Hanson, Louise. 2015. “Conceptual Art and the Acquaintance\nPrinciple.” <em>The Journal of Aesthetics and Art\nCriticism</em>, 73(3): 247–258.</li>\n<li>Harrison, Charles, 1991. <em>Essays on Art and Language</em>,\nCambridge, MA: MIT Press.</li>\n<li>Ingarden, Roman, 1973. <em>The Literary Work of Art</em>, G.G.\nGrabowicz (trans.), Evanston, Ill.: Northwestern University\nPress.</li>\n<li>Irvin, Sherri &amp; Dodd, Julian, 2017. ‘In Advance of the\nBroken Theory: Philosophy and Contemporary Art’, <em>Journal of\nAesthetics and Art Criticism</em>, 75(4): 375–386.</li>\n<li>Kieran, Matthew, 1996. ‘In Defence of Critical\nPluralism’, <em>British Journal of Aesthetics</em>, 36:\n239–251.</li>\n<li>Kosuth, Joseph, 1969. <em>Art After Philosophy and After:\nCollected Writings, 1966–1990</em>, Cambridge, MA: MIT\nPress.</li>\n<li>Lewitt, Sol, 1967. ‘Paragraphs on Conceptual Art’,\n<em>Artforum</em>, 5(10): 79–83.</li>\n<li>–––, 1969. ‘Sentences on Conceptual\nArt’, <em>Art-Language: The Journal of Conceptual Art</em>, 1\n(May): 11–13. Reprinted in Osborne, 2002.</li>\n<li>Levinson, Jerrold, 1979. ‘Defining Art Historically’,\n<em>British Journal of Aesthetics</em>, 19: 232–250.</li>\n<li>–––, 1992. ‘Intention and Interpretation:\nA Last Look’, <em>Intention and Interpretation</em>, G.\nIseminger (ed.), Philadelphia: Temple University Press, pp.\n221–256.</li>\n<li>Lippard, Lucy, 1973. <em>Six Years: The Dematerialization of the\nArt Object 1966–1972</em>, New York: Praeger.</li>\n<li>Maes, Hans, 2010. ‘Intention, Interpretation, and\nContemporary Visual Art’, <em>British Journal of\nAesthetics</em>, 50: 121–138.</li>\n<li>Margolis, Joseph, 1991. <em>The Truth About Relativism</em>,\nOxford: Blackwell.</li>\n<li>Meyer, Ursula, 1972. <em>Conceptual Art</em>, New York: Dutton\nPress.</li>\n<li>Morgan, Robert C., 1996. <em>Art into Ideas: Essays on Conceptual\nArt</em>, Cambridge: Cambridge University Press.</li>\n<li>Newman, M. &amp; Bird, J. (eds.), 1999. <em>Rewriting Conceptual\nArt</em>, London: Reaktion Books.</li>\n<li>Osborne, Peter (ed.), 2002. <em>Conceptual Art: Themes and\nMovements</em>, London &amp; New York: Phaidon Press.</li>\n<li>Pakes, Anna, 2019. ‘Can There Be Conceptual\nDance?’ <em>Midwest Studies in Philosophy</em>, 44:\n195–212.</li>\n<li>Piper, Adrian, 1993. ‘The Logic of Modernism’,\n<em>Flash Art</em>, 26: 56–58.</li>\n<li>Sauchelli, Andrea, 2016. ‘The Acquaintance Principle,\nAesthetic Judgments and Conceptual Art’, <em>Journal of\nAesthetic Education</em>, 50: 1–15.</li>\n<li>Schellekens, Elisabeth, 2005. ‘“Seeing is\nBelieving” and “Believing is Seeing”‘,\n<em>Acta Analytica</em>, 20: 10–23.</li>\n<li>–––, 2007. ‘The Aesthetic Value of\nIdeas’, <em>Philosophy and Conceptual Art</em>, Oxford: Oxford\nUniversity Press, pp. 71–91.</li>\n<li>Shelley, James, 2003. ‘The Problem of Non-Perceptual\nArt’, <em>British Journal of Aesthetics</em>, 43:\n363–78.</li>\n<li>Sibley, Frank, 1965. ‘Aesthetic and Nonaesthetic’,\n<em>Philosophical Review</em>, 74: 135–59</li>\n<li>Young, James, 2001. <em>Art and Knowledge</em>, London:\nRoutledge.</li>\n<li>Walton, Kendall, 1970. ‘Categories of Art’,\n<em>Philosophical Review</em>, 79: 334–67.</li>\n<li>Weitz, Morris, 1956. ‘The Role of Theory in\nAesthetics’, <em>Journal of Aesthetics and Art Criticism,</em>\n15: 27–35.</li>\n<li>Wimsatt, W. K. &amp; Beardsley M. C., 1946. ‘The Intentional\nFallacy’, <em>Sewanee Review</em>, LIV: 468–488.</li>\n<li>Wollheim, Richard, 1980. <em>Art and Its Objects</em>, Cambridge:\nCambridge University Press.</li>\n<li>Wood, Paul, 2002. <em>Conceptual Art</em>, London: Tate\nPublishing. Series: Movements in Modern Art.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "aesthetic, concept of the",
            "aesthetic experience",
            "aesthetics: aesthetic judgment",
            "art, definition of",
            "Beardsley, Monroe C.: aesthetics",
            "Kant, Immanuel: aesthetics and teleology",
            "Wittgenstein, Ludwig: aesthetics"
        ],
        "entry_link": [
            {
                "../aesthetic-concept/": "aesthetic, concept of the"
            },
            {
                "../aesthetic-experience/": "aesthetic experience"
            },
            {
                "../aesthetic-judgment/": "aesthetics: aesthetic judgment"
            },
            {
                "../art-definition/": "art, definition of"
            },
            {
                "../beardsley-aesthetics/": "Beardsley, Monroe C.: aesthetics"
            },
            {
                "../kant-aesthetics/": "Kant, Immanuel: aesthetics and teleology"
            },
            {
                "../wittgenstein-aesthetics/": "Wittgenstein, Ludwig: aesthetics"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=conceptual-art\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/conceptual-art/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=conceptual-art&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/conceptual-art/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=conceptual-art": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/conceptual-art/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=conceptual-art&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/conceptual-art/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://www.artnet.com/\" target=\"other\">artnet: Fine Art, Decorative Art, and Design – The Art World Online</a>",
            "<a href=\"https://www.guggenheim.org/new-york/collections/collection-online/\" target=\"other\">The Guggenheim Collection Online</a>",
            "<a href=\"https://www.moma.org/\" target=\"other\">The Museum of Modern Art</a>\n (MoMA)",
            "<a href=\"https://www.tate.org.uk/\" target=\"other\">Tate Online</a>"
        ],
        "listed_links": [
            {
                "https://www.artnet.com/": "artnet: Fine Art, Decorative Art, and Design – The Art World Online"
            },
            {
                "https://www.guggenheim.org/new-york/collections/collection-online/": "The Guggenheim Collection Online"
            },
            {
                "https://www.moma.org/": "The Museum of Modern Art"
            },
            {
                "https://www.tate.org.uk/": "Tate Online"
            }
        ]
    }
}