{
    "url": "condillac",
    "title": "Étienne Bonnot de Condillac",
    "authorship": {
        "year": "Copyright © 2017",
        "author_text": "Lorne Falkenstein\n\nGiovanni Grandi\n<Giovanni.Grandi@ubc.ca>",
        "author_links": [
            {
                "http://publish.uwo.ca/~lfalkens/": "Lorne Falkenstein"
            },
            {
                "mailto:Giovanni%2eGrandi%40ubc%2eca": "Giovanni.Grandi@ubc.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2017</a> by\n\n<br/>\n<a href=\"http://publish.uwo.ca/~lfalkens/\" target=\"other\">Lorne Falkenstein</a>\n<br/>\nGiovanni Grandi\n&lt;<a href=\"mailto:Giovanni%2eGrandi%40ubc%2eca\"><em>Giovanni<abbr title=\" dot \">.</abbr>Grandi<abbr title=\" at \">@</abbr>ubc<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Oct 17, 2002",
        "substantive revision Thu Sep 21, 2017"
    ],
    "preamble": "\n\nÉtienne Bonnot, Abbé de Condillac, was the chief\nexponent of a radically empiricist account of the workings of the mind\nthat has since come to be referred to as “sensationism.”\nWhereas John Locke’s empiricism followed upon a rejection of\ninnate principles and innate ideas, Condillac went further and\nrejected innate abilities as well. On his version of empiricism,\nexperience not only provides us with “ideas” or the raw\nmaterials for knowledge, it also teaches us how to focus attention,\nremember, imagine, abstract, judge, and reason. It forms our desires\nand teaches us what to will. Moreover, it provides us with the best\nlessons in the performance of these operations, so that a study of how\nwe originally learn to perform them also tells us how those operations\nought to be performed. The pursuit of this tenet led Condillac to\narticulate an early developmental psychology, with explicit\npedagogical and methodological implications. His concerns also led him\nto focus on the theory of perception, and to advance important and\noriginal views on our perception of spatial form. He offered a more\nsearching, careful, and precise account of what exactly is given to us\nby each of the sense organs than any that had been offered up to his\nday, and presented a highly nuanced account of how this raw data is\nworked up into our beliefs about the world around us. \n",
    "toc": [
        {
            "#Works": "1. Life and Works"
        },
        {
            "#Metaphysics": "2. The Metaphysics of Condillac’s Sensationism"
        },
        {
            "#Essay": "3. Sensation in the Essay"
        },
        {
            "#Treatise": "4. Sensation in the Treatise"
        },
        {
            "#Faculties": "5. The Development of Higher Cognitive Faculties"
        },
        {
            "#Signs": "6. Signs and the “Language of Action”"
        },
        {
            "#Analytic": "7. Languages as Analytic Methods"
        },
        {
            "#Animal": "8. The Animal Soul, Moral Laws, and Immortality"
        },
        {
            "#Commerce": "9. Commerce and Government"
        },
        {
            "#Problems": "10. Problems with Condillac’s Sensationism"
        },
        {
            "#Idealism": "10.1 Idealism"
        },
        {
            "#Materialism": "10.2 Materialism"
        },
        {
            "#Memory": "10.3 Memory and Liberty"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Works\n\nCondillac was born on September 30, 1714 in Grenoble as the third son\nof Gabriel Bonnot, Vicomte de Mably, and Catherine de La Coste.\n(“Condillac” was the name of an estate purchased by his\nfather in 1720.) He is said to have had very poor eyesight and a weak\nphysical constitution, factors that so retarded his intellectual\ndevelopment that as late as his twelfth year he was still unable to\nread. His education began only in his teens, first under the direction\nof a local priest, then at Lyons, where he went to live with his older\nbrother, Jean, after the death of their father. Perhaps because of his\nreticence and his late learning his family regarded him as possessing\nlimited intellectual abilities. He nonetheless managed to continue his\neducation as a seminarian in Paris, at Saint-Suplice and at the\nSorbonne. He took holy orders in 1740 and wore a cassock for the rest\nof his life, but did no pastoral work. After some years spent living\nthe life of a man of letters in Paris, during which he came to be\nclosely acquainted with Rousseau and Diderot, and published work that\nwon him election to the Prussian Academy of the Sciences (1749), he\naccepted a position as tutor to the Prince of Parma, a post that he\nheld from 1758–68. He returned to Paris in 1768 and was elected\nto the French Academy in that year, but he left the city shortly\nafter, in 1773, and took up residence on a country estate he had\npurchased near Beaugency. He died there on August 3, 1780. \n\nCondillac published two main philosophical works: the Essay on the\nOrigin of Human Knowledge of 1746, and the Treatise on\nSensations of 1754, both of which were devoted to expositing his\nviews on the role of experience in the development of our cognitive\ncapacities.\n\nThe earlier Essay was a less radical work. Though it sought\nto explain how the cognitive faculties are developed as a consequence\nof sensation, it took sensation itself largely for granted. Condillac\nexplicitly rejected the views that the mind can make judgments that it\nis not aware of, and that we can confuse the products of inferential\noperations with immediately given sensations. As a consequence, he\nmaintained, in opposition to Molyneux, Locke, and Berkeley, that we do\nnot need to learn to perceive visual depth. However, the\nEssay was also more wide-ranging than the Treatise.\nIt devoted attention to the development of language and its role both\nin the acquisition of our more sophisticated cognitive powers and in\nthe generation of false philosophies. These are topics that Condillac\nlater relegated to his works on logic.\n\nIn the Treatise Condillac focused just on our pre-linguistic\ncognitive abilities, which he came to think he might have\nunderestimated when he wrote the Essay. He retracted his\nearlier claim that perception is a transparent process and accepted\nboth that it involves unconscious inference from what is given in\nsensation and that sensation itself may contain more than it is at\nfirst perceived to contain. He also retracted his earlier claim that\ndepth is immediately perceived by vision. To support these revised\nopinions, he proposed a famous thought experiment. He asked his\nreaders to consider an originally inanimate and insentient human being\n(Condillac spoke of a being that is just a “statue” of a\nhuman being) and to consider what this being could come to know were\nit to acquire each of the senses in isolation from the others, or each\nin combination with just one or two others. In proposing this question\nCondillac was asking a more radical version of the question Molyneux\nhad posed to Locke: would a person born blind and made to see perceive\nspatial features well enough upon first sight to be able to identify\ncubes and spheres without touching them? Condillac was asking what a\nperson endowed with just a sense of smell would think upon acquiring\nthe power of hearing, or what a person endowed with vision would know\nif unaffected by hunger, incapable of motion, and unaware of any\ntactile sensation. His answer to these questions sought not just to\nexplain how this person would acquire ideas of space and of external\nobjects, but to prove that nothing more would be needed for it to\nacquire all the knowledge and all of the abilities that we have other\nthan just to experience a sufficiently rich array of sensations.\n\nCondillac’s other philosophical works support and embellish the\ndoctrines of the Essay and the Treatise. They are\nthe Treatise on Systems of 1749, which is devoted to\ncritiquing the metaphysics and the methodology of earlier\nphilosophers, the Treatise on Animals of 1755, which attempts\nto explain how human souls differ from those of animals with respect\nto intelligence and free will, the “Dissertation on\nLiberty”, an important short work appended to the Treatise\non Sensations that further addresses the issue of human free\nwill, the “Summary [extrait raisonné] of the\nTreatise on Sensations,” originally included in the\nTreatise on Animals, and a textbook on Logic (1780). He also\npublished a work on commerce and government, assembled a dictionary of\nsynonyms, and put together a multi-volume course of studies that he\nhad developed while tutoring the Prince of Parma. The latter dealt\nprincipally with history but also included some philosophical\nmaterial, including a different presentation of logic. At the time of\nhis death he left an incomplete a work entitled The Language of\nCalculation.\n2. The Metaphysics of Condillac’s Sensationism\n\nCondillac’s account of the development of our cognitive\ncapacities was informed by a particular conception of the nature of\nthe mind and the sensations it is originally given. He argued that the\nmind must be an unextended or immaterial substance (Essay\nI.i.1\n §6).[1]\n When it senses, nothing actually passes into it from the outside\nworld or the body. Instead the action of external objects on the sense\norgans brings about changes in the body and these changes serve as the\nmerely occasional cause of the production of sensations in the mind.\n\n\nSensations are modifications of our being. To understand them as\nimages of something distinct from us is to treat them as\n“ideas” rather than simply as “sensations,”\nand that is an operation that is so far from being automatic that it\nexceeds the capacities of animals. However, unlike Reid, who was later\nto argue for a rigorous distinction between sensations, considered as\nstates of feeling experienced by the mind, and perceptions, considered\nas acts of thinking something about an object, Condillac maintained\nthat sensations do lend themselves to being treated as ideas. He\ndenied that sensations are “something that only occurs aside\nfrom thoughts and modifies them” and insisted that they are\n“as representative” as any other thought experienced by\nthe mind (Essay I.ii.2 §9).\n3. Sensation in the Essay\n\nMost early modern philosophers were impressed by the facts of\ngeometrical optics, which teach that light imprints an inverted,\nleft-right reversed image of the external world on the concave surface\nof the back of the eye. If we accept that the eye is the means of\nvisual perception, then this teaching appears to imply that the eyes\nfilter out information about the distance at which objects are set\noutwards from us and transmit just information about position along\nthe horizon and the azimuth to the mind. After all, while points at\ndifferent angles of inclination upwards or downwards from the horizon,\nor at different compass directions will project light to different\nparts of the retina, points that differ only with reference to their\ndistance outwards from the eye will project light onto the same part\nof the eye. But if differences in distance outwards make no difference\nto the impression on the eye, and the mind is only affected as a\nconsequence of how the eye is affected, then information about outward\ndistances is not conveyed to the mind. It would seem, therefore, that\nvisual perception must originally lack information about distance\noutwards. It must consist of an awareness of images that are only\ntwo-dimensional projections of solid objects in a three dimensional\nspace. \n\nBut the Condillac of the Essay was not impressed by these\nconsiderations. Though he admitted that the image imprinted by light\non the eye is merely two-dimensional, he denied that the mind must\ntherefore only be aware of a two-dimensional image (Essay\nI.vi §2). However he had little to say about how the mind might\nacquire information about outward distances, and instead confined\nhimself to attacking the standard\n account.[2]\n On the standard account, when I perceive a three dimensional object,\nsuch as a uniformly coloured globe, I must really see a two\ndimensional projection of that object, variously shaded in its\ndifferent parts, and then judge that this two-dimensional, variously\ncoloured image is a representation of a uniformly coloured\nthree-dimensional object (the classic presentation of this view is to\nbe found in Locke’s Essay, book II, chapter ix,\nparagraph 8). But I am not conscious of seeing a flat, variously\ncoloured circle, nor am I conscious of making a judgment about what\nthis image represents. Instead, I seem to immediately see a uniformly\ncoloured, three-dimensional object. Moreover, try as I might, I cannot\nmake myself aware of drawing an inference. And I have so little\nawareness of the flat, variously coloured circle that I supposedly see\nthat, without the aid of instruction in drawing or painting, I would\nhave no idea that it bears any relation to a uniformly coloured globe.\nCondillac found this insupportable. The mind, he maintained, cannot be\nso deeply ignorant of what it senses or of what it does\n(Essay I.vi §§3–5).\n\nConsistently with the view that we do not need to learn to perceive\ndepth, Condillac maintained that we do not need to learn to perceive\nseparation in any other spatial dimension. Consequently, a previously\nblind person, made to see for the first time, should see colours to be\nextended over all three dimensions. The alternative, in\nCondillac’s view is that the newly sighted person would\nexperience just a “mathematical point” of colour, and he\nrejected this as patently absurd (Essay I.vi.\n§§12–14).\n\nCondillac was aware that these claims had been challenged by such\nempirical studies of recovered vision as were available at the time.\nIn 1728, the English surgeon, William Chesselden, had reported to the\nBritish Royal Society that subjects recovering from operations to\nremove cataracts that had blinded them since birth appeared to need to\nlearn to associate what they saw with tactile experience before they\ncould recognize shapes or objects. Condillac replied to this contrary\nevidence by claiming that it would take some time for newly sighted\nsubjects to learn how to focus the eyes in order to perceive colours\ndistinctly, and so to see their outlines. It would then take time for\nthe subjects to attend to the shapes that distinctly seen colours\nexhibit, since we can expect that at first they would be overwhelmed\nand confused by the variety of information presented by the eyes, much\nlike a person gaining a first glimpse of a Bosch painting. Finally,\neven after they came to see colours as, say, outlining square or round\nshapes, they might still hesitate to assume that simply because an\nobject looks to have a certain shape, that therefore it must be felt\nto have that shape as well. For all of these reasons, time might pass\nand the subject might appear to be learning to associate visual\nexperiences with tangible objects, even though the colours that are\noriginally seen are already extended and shaped in three dimensions\n(Essay I.vi. §16).\n4. Sensation in the Treatise\n\nCondillac’s reply to the Chesselden data contained the germs of\nan insight that was to be central for the later Treatise: the\nclaim that visual sensations, and indeed all sensations, might contain\ninformation that goes unnoticed by a subject simply because it is not\nattended to. This insight, already present in the Essay, was\nsubversive. It challenged that work’s rejection of perception by\nmeans of unconscious sensations and unconscious inferences. It led to\nthe Treatise’s claim that having a sensation does not\nimply being conscious of everything that sensation involves\n(Treatise I.xi.8, III.iii.6). \n\nIn his Logic, Condillac illustrated this point by asking his\nreaders to imagine a group of people who travel by night to a chateau\nsituated on a high point before a vast panorama of fields, mountains,\ncities, towns, and forests. At dawn, the windows are thrown open for\njust an instant. In that instant, each member of the company\nexperiences a compound visual sensation consisting of multiple,\nsimultaneously present colour patches disposed in space so as to\ndepict all the parts of the panorama that lies out in a particular\ndirection. But from the view obtained in just an instant, no one can\nsay what it was that they saw. If the shutters are left open for more\nthan an instant nothing new is presented to the company. That is, they\ndo not have any sensation they did not have in the first instant. They\ncome to perceive what it is they at first already sensed by\nselectively attending to each of its parts in turn and then noting how\nthese parts are related to one another (Logic, Part I,\nChapter ii).\n\nCondillac had always appreciated that this act of attention is not an\ninnate operation, any more than such higher cognitive operations as\nabstraction, judgment, or reasoning are innate operations. We need to\nlearn how to attend to what we sense. Experience itself serves as our\nteacher. The operation of attention is invoked by our needs and\ninterests. We attend first to what promises to satisfy our needs and\ninterests, which are always with us and which always direct our\nthought. Our knowledge of what promises to satisfy our needs and\ninterests is a product of past experience, which has made us aware of\nwhat objects are connected with the frustration or satisfaction of\nthose needs and interests. The needs and interests themselves are\ndeveloped as a consequence of a past experience of pleasure and pain,\nwhich in turn are intrinsic features not just of tactile experience,\nbut of all of our sensations. However, in the Essay Condillac\nhad not appreciated the full implications of this view. Recognizing\nthose implications required being more careful about specifying what\nis originally given in sensation, what is originally attended to, and\nwhat leads us to attend to anything else. The device of the slowly\nanimated “statue” was invoked to assist in making these\ndeterminations.\n\nCondillac supposed that the most primitive form of experience would be\nthe sense of smell. A being (Condillac’s “statue”)\nendowed with just this one sense but no motive power would, Condillac\nsupposed, be capable of receiving pleasure or pain from the experience\nof different odoriferous objects. However, all that the being could do\nto avoid painful or acquire pleasurable sensations would be to try to\ndistract itself with remembered or imagined smells when occurrent ones\nproved uninteresting or unappealing.\n\nWe would consider such a being to be a being who smells, say, a rose,\nand who is thereby affected in a certain way. Some might consider this\neffect to be a rose smell sensation that somehow stands before the\nmind as an object of contemplation. Others might consider the effect\nto be an act that has the scent of a rose as its intentional object,\nor an act of feeling a certain way (“rose-scentedly”). But\nCondillac maintained that the being itself would not at first have any\nconception of objects distinct from itself or even any conception of\nitself, let alone any views on the metaphysical status of its sensory\nstates. When it smells a rose, it experiences itself as simply being\nthe smell of a rose (Treatise I.i.2). If it smells more than\none object at once, the smells likely amalgamate into a single,\ncomplex scent that it experiences as simple and unique. If it\nexperiences different smells in succession, the memory of the earlier\none may linger while the other comes to be present and then it may\nbecome aware of itself as having been something different from what it\nis now so will discover that is a thing that endures through time\n(Treatise I.ii.10).\n\nIf the being were allowed to have senses of sound in addition to\nsmell, different, simultaneously experienced sounds would likewise be\nexperienced by it as one noise, but Condillac supposed that any sound\nwould be too different from any simultaneously occurring taste for the\ntwo to be amalgamated, as long as either one had once been experienced\non its own. Thus, a being endowed with senses of both smell and\nhearing would experience itself as being both a smell and a sound, and\nso would experience itself as having a double existence\n(Treatise I.ix.3–4). It would not, however, necessarily\nexperience itself as being two things at once, at least not\nif we take the term “thing” to refer to substances.\nCondillac claimed that, were each particular smell only ever\nexperienced in conjunction with just one particular sound, and vice\nversa, the two would not be thought of as distinct things or\nsubstances, even though they would be distinguished from one another.\nInstead, the smell would be experienced as having a sound and the\nsound as having a scent. Otherwise put, each would play the role of\nproperty to the other. This is all that there ever is to our concept\nof substance, insofar as that concept has any meaning at all and is\nnot simply a meaningless word invented by philosophers. Substance is\nnot some substratum in which properties inhere, but a collection of\nsensations or qualities or properties commonly observed to occur\ntogether (Treatise I.xii.3, III.iv.2).\n\nAs has been noted, in the Treatise Condillac abandoned his\nearlier view that we immediately see depth. However, he continued to\nmaintain that light and colours are extended over the remaining two\ndimensions. A being endowed with a sense of sight and presented with a\nvariously coloured panorama would not experience all the different\ncolours to be amalgamated into a point. Neither, Condillac supposed,\nwould it blend the different colours with one another so as to see a\nuniformly coloured expanse. It would still continue to experience\nitself as simply being each of the colours it sees. Insofar as these\ncolours are not merely multiple but outside of one another in space,\nthe being would experience itself as not merely having a multiple\nexistence, but also as being “outside” of itself. As\nCondillac put it, insofar as it is red it experiences itself as being\noutside of itself insofar as it is as green (Treatise\nI.xi.8).\n\nIt was at this point that Condillac’s thesis that sensing does\nnot entail being conscious of all that one senses came to the fore. We\nwould think that if colours are extended and different colours are\nsimultaneously seen without being blended, then there must be edges\nbetween them, and shapes outlined by those edges. Condillac accepted\nthat this would in fact be the case. But he denied that his\n“statue” would necessarily have to be aware of this fact.\nThe “statue” would need some reason to turn its attention\nto the boundaries between colours, to identify the various parts of\nthose boundaries, and to notice what shape they constitute. But if it\nonly considered colour sensations to be its own states of being, and\ntook pleasure or pain only in their chromatic qualities and not in\ntheir shapes (a rather large presumption that Condillac seems not to\nhave realized making), it would have no reason to notice that colours\nhave shapes or even that they have particular locations relative to\none another. Consequently, even though it would experience colours as\nbeing extended and outside of one another, it would not notice that\nthe array of simultaneously present colour sensations forms an\nunbroken continuum. It would experience its coloured self merely as an\naggregate of distinct extensions, vaguely perceived as not having any\ndefinite boundaries or shapes, and not recognized as having any\nlocations relative to one another. Consequently, it would have no\ndeveloped concept of space (Treatise I.xi.8–9).\n\nCondillac maintained that it is only through the sense of touch that a\nbeing first acquires an awareness of space as an external continuum\nextending outwards beyond the bounds of its body, and an awareness of\nother objects in this space. Touch then teaches us to attribute\nsmells, sounds, tastes, and colours to external objects.\n\nLike Thomas Reid, who some ten years later also set about\ninvestigating what each of the senses can lead us to learn, Condillac\ntook the tactile sensation of solidity to be crucial for the\ndevelopment of an awareness of space and of external objects. Only\nwhereas Reid maintained that we are innately so constituted as to\nunderstand the purely qualitative sensation of solidity as sign\nsignifying a quality of external objects, Condillac attempted to\nexplain how experiences of the sensation of solidity could put us in a\nposition to infer that we have spatially extended bodies and that\nsomething else exists outside of our bodies (Treatise\nII.v).\n\nThese inferences arise as a consequence of the comparison of two\ncases, one where a being touches itself, the other where it touches\nsomething else. A being that touches itself experiences a sensation of\nsolidity in its hand and an “answering” sensation of\nsolidity in the part of its body that it touches, thereby experiencing\nitself as being solid, as being two instances of solidity, and as\nbeing two instances of solidity outside of one another. Were the being\nto lift its hand from its body and touch another part of its body, the\npair of these sensations would cease and then after a time one member\nof the pair would recur in the company of a different partner. The\nbeing would experience a new sensation of solidity outside of the one\nit receives from its hand, but its awareness of the different body\nparts that it touches would be like its awareness of colours. Though\nexperienced as being outside of one another, the touched body parts\nwould not be experienced as forming a continuum or as spatially\nrelated to one another. However, were the being to move its hand over\nits body without lifting it, it would experience a continuous sequence\nof sensations of solidity arising from different body parts. Moving\nthe hand repeatedly in the same way would always produce the same\nseries of sensations. Condillac did not go into any more detail, but\nhe seems to have presumed that this would be enough to warrant the\ninference that the touched body parts coexist and form a continuum.\nThus, through moving its hands over itself, the “statue”\nis supposed to acquire an awareness that it has a spatially extended\nbody.\n\nWhen the “statue” touches another object, it experiences\nonly one sensation of solidity without the answering sensation. The\nabsence of the second sensation is supposed to induce the judgment\nthat there is something else that is solid. An awareness of the shape\nof objects and their locations in an ambient space is then developed\non this basis. The “statue” subsequently learns to\nattribute smells and sounds to objects by discovering that moving\nobjects can make these sensations appear or disappear\n(Treatise III.i-ii). Moving its hands before its eyes and\ndiscovering how this causes colour sensations to appear or disappear\nleads it to think of colour sensations at first as being on the\nsurface of its eyes, then as being outside of it beyond arm’s\nlength, and then as being on the surfaces of particular tangible\nobjects within arms length (Treatise III.iii.1–19).\nHaving reached this stage of development, it is ready to learn to\nperceive objects to be at even more remote distances through\ndiscovering associations between such visual distance cues as the\nclarity and apparent size of visual images and the distance that must\nbe crossed to touch an object. The interpretation of the cues then\nbecomes so natural that we seem to be directly seeing depth. Condillac\nquietly ignored his earlier objections to this position\n(Treatise III.iii.20–33).\n5. The Development of the Higher Cognitive Faculties\n\nCondillac’s account of how sensation gives rise to the exercise\nof our higher cognitive faculties is broadly the same in the\nEssay and the Treatise. Such differences as there\nare between the two works arise from Condillac’s decision to\nfocus the Treatise on pre-linguistic abilities. In the\nEssay Condillac defined perception as the impression first\noccasioned in the mind by the action of objects on the senses. He\nmaintained that we are always conscious of perceptions, but that this\nconsciousness comes in varying degrees, which are a function of the\nstrength with which objects act on the senses, the degree of intrinsic\npainfulness or pleasantness of the perception, and, most importantly,\nthe extent to which the perception has been associated with our needs,\nwhich are ultimately a function of the pleasure and pain we receive\nfrom our perceptions. A high degree of consciousness is what we call\nattention. Our attention is naturally drawn to those perceptions that\nare most pleasurable or painful, and consequently to those perceptions\nthat we have connected with those that are most pleasurable or\npainful. Thus, experience of pleasure and pain is what first instructs\nus where to focus our attention. Learning where to focus attention is\nimportant, because many perceptions can be present at once, and a\nconsciousness that is evenly distributed over a great number of\nperceptions knows none of them very clearly or distinctly\n(Essay I.ii.1. §§1–14). \n\nThose perceptions that we attend to can seem to drown out the others\nand produce the illusion that they alone exist, whereas those\nperceptions that we are less conscious of can be so faint that it is\nimpossible to recall that we have had them the instant after the\nstimulus that produced them fades. Those perceptions that we attend to\ncan also continue for some time after the stimulus that produced them\nhas ceased. This produces an experience that Condillac referred to as\n“reminiscence” (réminiscence). An object\ncontinuously acting on our sense organs causes us to now experience a\nparticular perception while we are simultaneously conscious of an\necho, as it were, of an identical past perception, produced just a\nmoment ago. Condillac’s reasoning is less than explicit at this\npoint, but he seems to have taken this experience to provide us with\nan awareness of what we might call the “pastness” of the\necho, and at the same time of the continued existence of an identical\nself which experienced both the past perception and the current ones.\nThe idea of self is thus not the product of a Cartesian intellectual\nintuition. Like the idea of one’s own extended body and of other\nextended things, it is discovered through having a particular kind of\nsensory experience, in this case, the experience of reminiscence\n(Essay I.ii.1. §15).\n\nIn the Essay, Condillac distinguished between reminiscence,\nunderstood as the perception that one is perceiving something that one\nhas perceived before, and memory. Memory is not the process of forming\nan image of something one has experienced before. Condillac instead\ndescribed it as the process of forming an idea just of signs or\ncircumstances that have been associated with a previously experienced\nobject. The operation of forming an image of a previously experienced\nobject is not memory but “imagination,” or reminiscence,\nif the imagined object is thought of as one that has been experienced\nbefore. (Since signs are not discussed in the Treatise, the\ndistinction between memory and imagination/reminiscence does not\nappear in that work, and both reminiscence and what the Essay\ncalls vivid imagination are named “memory.” However, it is\nnot clear that this is a doctrinal shift as opposed to a mere change\nof emphasis mandated by the different project of the\nTreatise.) Imagination becomes possible once a perception has\nbecome familiar from a number of previous experiences, which give the\nmind a facility to repeat that perception at will. The operation of\nimagination is enhanced if the perception is simple, composed of\nsimple parts that are organized in accord with some guiding principle\nthat can be invoked in reconstructing it, or customarily connected\nwith other, presently occurring perceptions. Since connections with\nother, customarily connected perceptions need to be noticed, and\nattention is a function of need, which is in turn established by past\nexperience of pleasure and pain, imagination is ultimately a function\nof past experience. The same can be said of memory, with the\nqualification that, insofar as memory involves the recollection of\nsigns, its operation also presupposes the ability to make use of signs\n(Essay I.ii.2–3, Treatise I.ii).\n6. Signs and the “Language of Action”\n\nLike Reid after him, Condillac drew a distinction between three kinds\nof signs: accidental, natural, and instituted (Essay I.ii.4).\n\n\nAccidental signs are objects or circumstances that have been\nfrequently encountered in conjunction with an object, so that the\noccurrence of the former induces the mind to imagine the latter.\nThough he made a great deal of the significance of his employment of\nthe principle of association when giving summary presentations of his\nwork, one of Condillac’s great shortcomings is his treatment of\nassociation. He did little more than employ the term. Unlike Hume, he\ndid not distinguish between resemblance, contiguity, and cause and\neffect, and he offered no detailed analysis of causal association.\nWhen compared with Hume’s accounts of how association is\nresponsible for our beliefs about matters of chance and probability,\nour trust in testimony, our reliance on general rules, and our\ntendencies to allow our reasoning to be influenced by credulity,\neducation, and passion, Condillac’s account of association is\nvery impoverished.\n\nNatural signs are the cries and gestures that we instinctively produce\nupon having particular experiences. Unlike Reid, Condillac insisted\nthat we are not born with a knowledge of the meaning of natural signs;\nwe are only born with the disposition to produce them on certain\noccasions. We produce them, moreover, without intending to do so and\nwithout intending to communicate anything by them. We only discover\nthat they have a certain signification through hearing or seeing\nourselves or others produce the sign on characteristic occasions, and\nso coming to associate the latter with the former. To go in the other\ndirection, and produce the sign in order to induce the thought of some\ncircumstance in others, would be to use the sign as an instituted\nrather than a natural sign.\n\nThe same might be said of accidental signs. To imagine dawn upon\nhearing the crow of a cock is to be affected by an accidental sign; to\nimitate the crow of a cock in order to signify dawn is to institute a\nsign, and is an operation of a higher order.\n\nReid was later to maintain that the creation of instituted signs\npresupposes an agreement among a community of speakers, which in turn\npresupposes language, and this led him to declare that there must be\nsome language that is innately understood rather than established by\nconvention. But Condillac had already explained how an artificial\nlanguage can be instituted without innately understood signs\n(Essay II.i.1. §§1–4). Familiarity with the\nsignification of natural signs, which are instinctively produced but\nnot innately understood, will lead one to think of the sign upon\nwitnessing the object that it signifies. For example, having learned\nto associate the cries that are made by those attacked by a wild\nanimal with those circumstances, I will think of those cries upon\nseeing a wild animal approach and think of the effect that hearing\nthem has previously had on myself and others. It is then a small, but\nmomentous step to utter those cries in order, first, to signify the\napproach of a wild animal to others and induce them to flee, and then\nto signify this particular danger to oneself or others without\nbothering to imagine an approaching wild animal, as a way of\nabbreviating the process of thought. With this step, a move is made\nfrom being affected by accidental and natural signs we happen to\nchance upon in the course of experience to employing instituted signs\nto stand for experiences. The first stage in taking this step is the\ndevelopment of what Condillac called the “language of\naction,” a language composed of cries and gestures culled from\nnatural language. A spoken language of arbitrary sounds and a written\nlanguage are then gradually invented by users of the language of\naction (Essay II.i.1. §§5–8).\n\nSince memory just is the imagination of signs, the development of\ninstituted signs makes memory possible (natural and accidental signs\nare only ever sensed, not remembered). The institution of signs\nfurther allows us to set up names for groups of ideas that are too\ncomplicated to be distinctively yet collectively imagined, such as\nideas of any number larger than six, of substances, of complex modes\n(notably moral and aesthetic qualities) and of genera and species of\nthings (Essay I.iv). It is also supposed to give us control\nover our imagination and an ability to govern our attention\n(Essay I.ii.4. §46). This allows us to reflect on other\naspects of our experience than those most immediately related to our\nneeds. Reflection brings connections between objects to our attention\nthat we would not otherwise notice and puts us in a position to refine\nour language by instituting names for what we have discovered. A more\nrefined language facilitates yet more exact reflection, and language\nand our reflective capacities proceed to work in tandem to develop our\ncognitive abilities to their highest level (Essay\nI.ii.5).\n7. Languages as Analytic Methods\n\nIn later works (Treatise of Animals [1755], Grammar,\npart of the Course of Study for the Prince of Parma, [1768],\nand Logic [1780]), Condillac explained more clearly the\ntransition from a language of natural signs to the language of action\nmade up of institutional signs.\n\nHe explicitly distinguished two types of “language of\naction.” The first one is “natural” (and thus\nappears to correspond to the use of natural signs also described in\nthe Essay). Its signs depend on the conformation of the\norgans (Treatise of Animals II. 4, Grammar I.1,\nLogic II.2). As a consequence, different species of animals\nhave a different natural language insofar as they have different\norgans (Treatise of Animals II.4). This language is innate in\nits expression since different signs are naturally caused by different\nideas independently of any learning. However, the interpretation of\nthis language is not innate: we have to learn to interpret its signs\n(Grammar I.1, Logic II.2). (Strictly speaking,\ncries, facial expressions, and gestures are signs only insofar as we\ninterpret them: before any interpretation they are just the effects on\nour body of some ideas occurring in our minds.) The second type of\nlanguage of action is institutional or artificial. Condillac makes\nclear that its signs are artificial but they are not arbitrary\n(Grammar I.1). They are not arbitrary because they are chosen\naccording to a rule of analogy with the natural signs\n(Grammar I.1, Logic II.2).\n\nThe transition from the natural language of action to the\ninstitutional language of action is a gradual process dictated by the\nneed to analyze natural signs. As Condillac explains, there is no\nsuccession of various ideas in the mind of the speaker of the natural\nlanguage of action: the idea of the external object affecting him or\nher, a judgment about the object, and the passions it arouses occur\nmore or less at the same time. In a similar fashion their visible and\naudible natural signs (the gestures, facial expressions, and cries\nmade) occur more or less at the same time, although the beginning of a\ndecomposition of these signs is already prompted by the mere\nspatio-temporal constraints of any visible action: it takes some time\nto jump around or to extend one own’s arm. Let’s imagine a\nsituation in which we have a speaker of the natural language and its\nfirst interpreter. In the presence of an animal, previously\nexperienced as dangerous, the speaker goes into a fright. The action\nthat follows appears to be confused to the interpreter, since it is\nthe immediate expression of a variety of ideas all occurring at the\nsame time in the mind of the speaker. The desire to understand leads\nthe interpreter to the beginning of an analysis of the action and, as\na consequence, to an analysis of ideas: for example, the attention of\nthe interpreter is drawn first to the object pointed at by the\nspeaker’s finger and then to speaker’s face expressing\nfear. The related ideas that were simultaneous in the mind of the\nspeaker become successive for the interpreter. The success and failure\nof the interpreter incites the speaker to be clear to herself and to\nothers: the speaker is motivated to analyze her own ideas so that she\nmay break down the corresponding visible and audible signs and be\nbetter understood. This breaking down of signs makes the job easier\nfor the interpreter who in her turn replies by decomposing her own\ngestures in accordance with the analysis of ideas. This gradual\nprocess of decomposition or articulation of gestures, cries, and\nfacial expressions marks the passage from a natural language of action\nto an institutional language of action (Grammar I.1 &\nI.7, Logic II.2).\n\nThus, language of action and analysis of ideas mutually enrich each\nother, according to a hierarchy of needs (at first, communication will\nbe about food and immediate dangers). The decomposing of signs\nmatching the analysis of ideas leads to the creation of new signs,\nfollowing a rule of analogy with the signs already known and this\nprocess allows the consideration of further ideas. Conversely, no\nconsideration of more refined ideas would be possible without the\ncorresponding signs. An example that Condillac favors is that of the\nsystem of numeration based on the ten fingers, which allows for the\nprogress of arithmetic: a single finger is first used to designate the\nunit but can subsequently be used for designating 10, 100, and so on\n(Language of Calculi I.1).\n\nFrom the primitive artificial language of action a language of\narticulated sounds emerged, as Condillac had already explained in\ndetail in the Essay: cries of different tonality were deemed\nsuitable to express different emotions. This phenomenon is at the\norigin of the tonal accent of Greek and Latin, which Condillac took to\nbe closer to the first spoken languages of humanity. Onomatopeia, he\nspeculated, may have been at the origin of certain words used to\ndesignate certain things, while other words were chosen by way of\nanalogy: for example, words for mental operations originally indicated\nwords for the operations of the sense-organs (Essay II.i.2-3,\nGrammar I.7). Grammar gradually emerged, first reflecting the\nmost basic needs of humanity and then gaining in complexity as needs\nmultiplied. (Condillac makes the conjecture that in the syntax of\nthese first languages the object of the action came first and preceded\nthe verb, since the object was the most vital point of interest for\nprimitive people: Essay II.i.9, Grammar II.8)\n\nThe first spoken languages of humanity combined a language of\narticulated sounds with the language of action. They resembled more a\nkind of chant accompanied by a “dance” of gestures and\nsteps: this fact also explains why a Roman or Greek orator could be\nunderstood by a large crowd of people, while a modern Frenchman could\nnot (Essay II.i.1-3).\n\nAfter a phase in which the language of action had been fruitfully\ncombined with the language of articulated sounds, different elements\nof this mix began to develop autonomously. They also recombined later\nin various guises. On this basis, Condillac attempted to account for\nthe development of arts and forms of expression such as music, dance,\ntheatre, poetry. For example, the language of action can dispense\naltogether with sounds of any kind, while extending the range of its\nexpressive gestures: already impressed by accounts of ancient\npantomimes, Condillac saw this point confirmed by the modern\ndevelopment of the language of signs for deaf-and-dumb people in the\nschool of the Abbé de l’Epée (Essay\nII.i.4, Grammar I.1). By developing only the tonal part of\nthe sounds, the language of action can turn into music, unaccompanied\nby any words and gestures (Essay II.i.5).\n\nThe details of this account of the development of arts are highly\ndebatable, but Condillac thought that on its basis he had been able to\nexplain the reasons for some disputes in art criticism. Whatever\nworked for an ancient language does not work for a modern language\nthat has shed most of its language of action component. Thus we should\nnot expect modern tragedy in French to replicate modes of expression\nprecisely designed for a more expressive language like that of ancient\ntragedy. (Essay II.i.3)\n\nThe transition from the natural language of action to the artificial\nlanguage of action and from this latter to the language of articulate\nsounds is recapitulated in an amplified form in the general movement\nof arts and civilization away from primitive forms of languages that\nare more expressive of emotions towards forms of language that are\nmore descriptive. All historical languages can be considered as\n“analytic methods,” since their grammar, prosody, and\nvocabulary reflect a certain stage in the development of analysis.\nHowever, in the formation of historical languages various\ncontingencies such as the climate and the temper of people played a\nrole. Historical languages contain many errors made in the analysis of\nfacts and these errors are passed on from generation to generation\n(Grammar I.1-8, Logic II.3-4). Science should strive\nto be based on a “well-formed language.” Late in his life,\nCondillac took algebra to be the best model of such a well-formed\nlanguage (Logic II.5). In algebra we show clearly and by a\nlimited number of steps how to find certain unknown quantities given\ncertain known quantities. Condillac took himself to have done\nsomething similar for philosophy. What is initially known is\nsensation. Condillac took himself to have shown in his work the\ngenesis of all mental life from this primitive element (Logic\nII.7-8).\n8. The Animal Soul, Moral Laws, and Immortality \n\nAt the beginning the Essay, Condillac demonstrated that the\nsoul is immaterial, in opposition to Locke’s hypothesis of\nthinking matter. According to Condillac, God cannot give to matter the\npower to think. The operations of thought show by themselves the unity\nof consciousness, and the unity of consciousness is only accountable\nby presupposing a simple and indivisible subject of inherence for\nconsciousness itself. Condillac presents this line of argument by\nsaying that individual perceptions are indivisible in their nature and\nso they cannot inhere in different substances. Even assuming that each\nindividual perception inheres in a separate individual substance, the\nact of comparing perceptions could not occur without a simple and\nindivisible substratum. “However, a mass matter is not one; it\nis a multitude” or, as Condillac also said, matter is an\nassemblage or collection of things (Essay I.i.1 §6).\nTherefore, the soul must be an immaterial substance.\n\nAt the same time, Condillac made clear that after the fall of the\nfirst man and woman the soul has become dependent on the body: the\nbuilding blocks of mental life, sensations, are occasioned by various\nphysical motions caused by the external objects affecting the senses\nand the nervous system (Essay I.i.1 §8). If higher\ncognitive functions are ultimately to be explained merely in terms of\ntransformations of sensations, then Condillac was left with the\nproblem of showing the precise line of demarcation between humans and\nother animals. Two solutions to this problem were foreclosed to\nCondillac. One possible solution was the view of Aristotle: the human\nsoul is characterized by a higher rational part in addition to the\nvegetative and animal parts (the vegetative part being responsible for\nnutrition and growth, and the animal part being responsible for\nsensation and motion). Condillac’s sensism argued precisely\nagainst this essentialist view of the difference between higher and\nlower cognitive functions and by extension against the essentialist\nview of the difference between humans and animals. The second\nsolution, which in Condillac’s times was proposed by Buffon in his\nNatural History (1749-53), was the Cartesian hypothesis of a\nmechanical soul. According to Descartes, only the rational soul is\nresponsible for consciousness. Animals, being devoid of this kind of\nsoul, are mere machines and thus incapable of being conscious.\nCondillac, on his part, was rather inclined to endorse the\ncommon-sense view that makes animals capable of sensation and thus of\nconsciousness.\n\nIn the Essay, Condillac had identified the use of language as\nnecessary for higher cognitive functions, including memory, the\ncontrol of the imagination, and reflection. Animals, which at best\nhave the use of natural signs, can only recall (imagine) absent\nobjects if a present object has been habitually associated with them.\nUnable to use at will signs standing for absent objects, they are\nwithout memory. Thus they live from moment to moment, without any\nproper notion of a continued past existence in which various events\nare connected. Everyday is like a new day for them, and they simply\nrepeat habitual patterns of behaviour most conducive to their\nsurvival. They are at best capable of what Condillac calls\n‘reminiscence’ and thus they can recognize an object as\npreviously experienced. The case of a boy who grew up among bears in\nthe woods between Lithuania and Poland appeared to provide\nconfirmation for animals’ mental inferiority: found unable to\nspeak, this youth only gradually learned the language, and afterwards\ncould not recall his past life nor did he have any notion of having\nspent many years in the woods (Essay I.iv.2\n§§23-25). Another case, that of a deaf-and-dumb boy who\nsuddenly recovered his hearing, further confirmed Condillac’s\nhypothesis: after a period of learning, the boy confirmed that while\nhe was deaf he could not attach any meaning to the sign of the cross\nthat he saw his parents doing, nor did he have any notion of death,\nlife after death, or God (Essay I.iv.2 §§13-22).\n(Condillac regretted that the examiners of the case had asked the boy\nmerely about his religious beliefs.) Subsequently, as is evident in\nhis correspondence with Cramer and Maupertuis, Condillac had come to\nbelieve that he had drawn too sharp a line between lower and higher\ncognitive functions and that thus he had in effect reintroduced a\ndualism of reason and sensation in the mind.\n\nCondillac addressed this problem in the Treatise of\nSensations by recognizing a level of pre-linguistic reflection\nthat is common to animals and human beings. At the same time,\nCondillac insisted drawing a distinction between the pre-linguistic\ncapacities of human beings and those of animals. He described at\nlength how the statue acquires the ideas of extended objects by touch\nand how it comes to refer the causes of sensations received by the\nother senses to these objects. Touch is considered as a sort of\npre-linguistic instrument of analysis: it originally discriminates\nparts outside of parts in its objects and by its means, sensations\nbecome ideas, that is, they acquire a reference to external objects.\nCondillac then argued that animals must be inferior to humans because\ntheir sense of touch is not as developed as that of human beings. He\nthought that human hands and fingers are uniquely adapted to receiving\na multiplicity of different impressions and therefore the human sense\nof touch is able to discriminate more accurately the qualities of\nobjects than that of other animals. From this difference of degree,\nCondillac went on to argue for a difference of kind between the soul\nof animals and that of humans: God in his benevolence would not trap a\nsoul capable of superior operations in an inferior body like that of\nanimals; therefore, the soul of animals must be of an inferior kind\n(Treatise, The Plan of This Work, Note).\n\nIn the Treatise of Animals Condillac further developed his\nviews. He repeated what he had said in the Treatise of\nSensations: animals are capable of pre-linguistic reflection,\njust like humans. They judge and compare ideas and by these means\ndiscover how to do things necessary for their survival. By this kind\nof reflection, all animals learn the proper use of their organs, in\norder to flee what is dangerous and search what is useful to them.\nReflection is at the origin of the formation habits, like the one that\nmakes us avoid a falling object that is heavy. As the actions\noriginally done deliberately by reflection are gradually turned into\nhabits, “the animal touches, sees, walks without reflecting on\nwhat it is doing” (Treatise of Animals, II.1). Thus,\nthe more habits are formed, the less need there is for reflection.\nWhat is called instinct in animals is not an innate pattern of\nbehaviour, but rather a well-developed habit (Treatise of\nAnimals II.5). This habit bears witness to the effort of\ninventive reflection that originally taught animals the use of their\norgans: birds have to learn how build their nests and beavers have to\nlearn how to build their shelters (Treatise of Animals\nII.2).\n\nCondillac, however, thinks animals are less inventive than humans\nbecause they have fewer needs and also “fewer means to multiply\ntheir own ideas and make combinations of all sort” (Treatise\nof Animals, II.2). In different words, animals are more easily\nsatisfied with their lot and they are less intelligent. Contrary to\nwhat many authors say, animals of the same species do not do the same\nthings because they imitate each other. Rather, they all end up doing\nthe same things, because they have the same needs and the same organs\nperfectly suited to the satisfaction of those needs. Thus, each animal\nacquires the same habits as any other animal of the same species,\nwhether placed alone or in company. Paradoxically, humans end up being\ndifferent from each other precisely because they are the only animals\nthat imitate each other. There is relatively little communication of\nideas by way of language among animals: their needs are more limited\nand therefore they do not need to learn from each other as much as\nhumans do. Humans, on the contrary, desire to learn from each other\nmore and so imitate each other. As they communicate more with each\nother, they also discover the differences in their talents and\ninterests and put them to use for themselves and others (Treatise\nof Animals II.3). Animals keep to their subsistence economy,\nwhile humans develop a system of division of labour in order to\nsatisfy their needs: one might start by trying to be a skilled hunter\nlike his neighbour only to discover that he had better leave hunting\nto his neighbor and concentrate on the manufacture of bows and arrows.\nSince, individuals are often placed in different circumstances\nrequiring different solutions, new needs emerge. As new needs emerge,\nuseful discoveries are made and social ties get stronger. Just like in\nthe Essay, the intertwined factors of language and social\nintercourse make humans superior to animals in their capacities.\n\nThe difference between humans and animals is still characterized by\nCondillac as difference of degree. For example, animals have a natural\nlanguage of action, just like humans, and they use it to communicate\nwith each other their needs and to help each other. The signs of this\nlanguage vary among different species not only according to the\ndifferent ideas they have but also according to the variety of organs\n(external conformation) they possess, since these organs condition the\nway ideas can be expressed. Animals of different species whose\nexternal conformation resembles each other can communicate with each\nother, at least to a certain extent: Condillac describes the case of\ndogs that can go as far as understanding not simply the language of\naction but also the language of articulate sounds of humans. But\nanimals whose external conformation is widely different from ours\ncannot communicate with us, as the case of the parrot shows: it can\narticulate sounds, but both his ideas and his language of action is\nwidely different from ours (Treatise of Animals II.4).\n\nCondillac seems to have thought that only humans have organs that\nallow for the language of action to be relatively more expressive,\nthus keeping a kind of parallelism between the cognitive capacities of\nthe mind and the complexity of the structure of the body (a complexity\nnot simply reducible to that of the brain but also including that of\nthe peripheral organs).\n\nWhat ultimately sets apart humans from animals is the knowledge of God\nand morals. In the middle of the Treatise of Animals,\nCondillac inserts a long chapter he claims to have submitted as an\nanonymous dissertation to the Academy of Berlin just a few years\nbefore. Here Condillac proceeds to demonstrate the existence of God.\nCondillac insists on a natural progression of ideas: at first, humans\nrealized that their happiness or unhappiness depended completely on\nexternal causes and posited deities equivalent to the powers of\nnature. Then they came to posit a first cause in order to avoid an\ninfinite regression in explanation of these natural powers. Finally,\nthe presence of design leads them to recognize this cause as\nintelligent and free (Treatise of Animals II.6). While the\ndetails of this chapter are not original, they set the stage for\nCondillac’s moral argument for the immortality of the soul.\n\nCondillac first insists on the spontaneous emergence of moral laws.\nThe more humans reflect on their common needs, the more they realize\nhow necessary it is to help each other and refrain from certain kinds\nof action. Thus “they come to agree on what is allowed and what\nis forbidden, and their conventions become laws to which action must\nbe subordinated: this is the beginning of morality”\n(Treatise of Animals, II.7). \n\nAt first they think of these laws as conventions they designed to\nenhance their well-being, given the needs that they have and the\nscarcity of means to satisfy them. But as they discover the existence\nof God, they recognize that God, by disposing of everything in nature,\nis the ultimate source of goods and evils that may befall human\nbeings. Moral laws then acquire a providential meaning: by obeying\nthese laws, humans obey God himself, who is the author of nature. The\nlaws of morality are both natural laws and laws of divine institution,\nsince nature is God’s creation. But given that the proportion of\ngoods and evils in this life does not correspond to the merits and\ndemerits of individuals, it is necessary to postulate a life after\ndeath where the just will be rewarded and the wicked will be\npunished.\n\nThus, According to Condillac, the immortality of the human soul is not\na consequence of its immateriality. All created beings, whether\nimmaterial or material, are naturally contingent: “if we\nconsider only the nature of the soul, it can cease to be. Who created\nit can let it go back to nothingness. It will continue to exist only\nbecause God is just. But in this way immortality is guaranteed to the\nsoul as if it were a consequence of its essence” (Treatise\nof Animals II.7). Immortality is guaranteed to the human soul\nsince the human soul is capable of knowing God’s laws and God is\nsupremely just: only in this derivative sense, “immortality is\nguaranteed to the soul as if it were a consequence of its\nessence.”\n\nUnlike human beings, animals are incapable of knowing moral laws. God\nhas not granted them the means to distinguish between what is right\nand what is wrong and so “he has shown that he does not expect\nanything from them” (Treatise of Animals II.7).\n“Nothing is enjoined and nothing is forbidden to beasts. Their\nonly rule is force. Incapable of merit and demerit, they have no right\nto divine justice. Their soul is thus mortal” (Treatise of\nAnimals II.7). But the soul of animals is immaterial, just like\nthe one of humans. Thus, we see how Condillac was able to separate the\nquestion of the immateriality of the soul from the question of the\nimmortality of the soul.\n\nAn objection could be raised against Condillac: if small children, who\nare still too young to know moral laws, suffer and die, would they be\nrewarded in the afterlife as compensation for their sufferings? And\nshould we not think the same of animals, who are like small children,\nsuffering and yet incapable of knowledge of moral laws? Condillac\nappears not to have appreciated the strength of this objection: for\nhim, the sufferings of animals are either a means to warn them of\ndanger or a necessary consequence of the laws of nature instituted by\nGod. That an analogy could be drawn to children or mentally disabled\npeople is not considered by Condillac.\n9. Commerce and Government\n\nIn the Treatise of Sensations, Condillac said that “The\nwords ‘goodness’ and ‘beauty’ express the\nproperties through which things contribute to our pleasure. As a\nresult, every sentient being has ideas of goodness and of beauties\nrelative to himself” (Treatise IV.iii.1). He further\nsaid that “the good and the beautiful are not at all absolute: they\nare relative to the nature of the man who judges them and to his\nmakeup” (Treatise, IV.iii.3). He clarified in a footnote\nthat he was not referring to goodness and beauty in themselves but\nabout the judgments that a man, who lives alone (as the statue of the\nTreatise of Sensations), may make of them: not everything\nthat such a man judges as good will be morally good, nor everything he\njudges beautiful will be really beautiful. Indeed we have seen that\nCondillac thought that people in society could come to an agreement\nabout moral laws and that these should be taken as objectively valid.\nAt the same time, Condillac insisted on a certain degree of relativity\nin the estimation of goods and evils. The human stage of development\nis characterized by a multiplication of needs, and it appears that\nthis by itself would allow for a variety in preferences, given the\ndifferent conditions of people. Humans are the first creatures that\ncan turn self-love in a proper desire for self-preservation, since\nanimals cannot have the notion of death. But humans may conceive of a\nvariety of ways of satisfying the same material needs. Moreover, their\nneeds multiply well beyond the mere material sphere of\nself-preservation. To describe this potentially unlimited development\nof needs, Condillac went as far as to say that even if humans were\nable to satisfy all their needs they would still be unable to satisfy\ntheir most pressing need, which is the need to desire (Treatise of\nAnimals II.8).\n\nIn one of his later works, Commerce and Government (1776),\nCondillac considered what he took to be some of the economic and\npolitical implications of his views. The book was published three\nmonths before Adam Smith’s Wealth of Nations, and it is\nrightly considered a milestone in the tradition of\nlaissez-faire economics and classical liberalism.\n\nCondillac began with an examination of economic value, which he\nthought was determined by the utility and relative scarcity of a good\n(Commerce and Government I.1). Since people in different\nsituations of life estimate goods differently, social cooperation\nbased on the division of labour becomes possible through the market.\nAs Condillac said, thus anticipating by one century the insights of\nmarginalists, in every voluntary market transaction each party gives\nwhat he or she values less in exchange for what he or she values more\n(Commerce and Government I.6). It follows that every free\nexchange is to the mutual benefit of both parties. Condillac justified\nproperty rights in a Lockian fashion by original occupation,\nappropriation by labour, or voluntary transfer (Commerce and\nGovernment I.12). The government’s main task is to maintain the\norder of society both internally and externally (Commerce and\nGovernment I.10), but the welfare of citizens is better\nguaranteed by the removal of barriers to free enterprise and free\ntrade, as Condillac argued at length in the second part of the work.\nGovernment’s various “blows” against the freedom of\ncommerce, such as taxes on consumption, monopolies, cartels, trade\nbarriers, price controls, currency manipulations, public debt, and\nwars, only benefit a few privileged people who are politically\nconnected. Economic interventionism leads to an unhealthy and\n“excessive” multiplication of needs in the group of people\nprivileged by these measures. This multiplication of needs is\nmanifested by the rise in the consumption of luxury products\n(Commerce and Government I.27, preface to Part II, II.16).\n(This unhealthy and excessive multiplication of needs, manifested by a\ntaste for luxury, should be contrasted with the healthy development of\nneeds that characterizes the rise of humans above the mere level of\nanimal economy described by Condillac in the Treatise of\nAnimals.) On the other hand, economic interventionism pushes back\nthe majority into a sort of animal economy, where they are constantly\nthreatened by poverty and starvation. Thus, policies of economic\nintervention exacerbate social inequalities. The equilibrating\nmechanism of the market would mitigate inequalities by lowering the\nprices of goods thanks to open competition among entrepreneurs\n(Commerce and Government II.1). Whatever inequalities remain\nin a free market society would just reflect a difference in talents\nand would rather be to the benefit of all. Certainly, the desire for\nhuman welfare cannot legitimately justify measures such as price\ncontrols on goods of first necessity such as wheat. These measures are\nnot only unjust but also turn out to be counterproductive,\nnotwithstanding the best intentions of advocates of restrictions on\nprivate property rights: “The rights of humanity opposed to those of\nproperty! What gibberish!” (Commerce and Government\nII.15)\n10. Problems with Condillac’s Sensationism\n10.1 Idealism\n\nIn the Essay Condillac not only claimed that sensations are\noccasioned by the action of external objects on our sense organs, but\nalso that they are images or representations of those objects. More\nprecisely, he claimed that the objects that affect our sense organs\nmust be extended and hence material things, though they may not have\nthe precise shapes or sizes that our senses represent them as having,\nand though they do not have colours on their surfaces or bear\nqualities of smell and taste (Essay I.i.2.\n§§11–12). But if “we never leave ourselves and\nnever perceive anything other than our own thoughts,” as\nCondillac claimed at the outset of the Essay (I.i.1.\n§1), then what could entitle us to maintain that our sensations\nbear this degree of resemblance to external objects or that there even\nis an external world containing objects that occasion our sensations?\n\n\nIn the Essay, Condillac contented himself with replying to\nthis question by claiming that while we have a clear idea what it\nmeans to attribute extension to an object, we have no clear idea what\nit means to say that objects are coloured or scented, and that while\nthere is evidence that proves that we do not always perceive the sizes\nor shapes of objects correctly, there is no evidence that proves that\nwe are wrong to think that external objects have some form of\nextension (Essay I.i.2. §§11–13). Neither\nclaim is compelling. Indeed, it is astounding how someone familiar\nwith Descartes’s dreaming argument could have made the latter\none. But both were asserted without any further elaboration or\ndefence. As Diderot later pointed out in his Letter on the\nBlind, for Condillac to rest his case against scepticism about\nthe existence of an external world on such facile grounds was to\nignore the powerful reasons for denying the existence of material\nthings that had been articulated by Berkeley.\n\nThis is not a problem that Condillac rectified in the\nTreatise. Instead, he attempted to side-step it by focusing\njust on the question of how experience leads us to form the idea that\nthere are extended, external objects that bear the qualities of\ncolour, taste, and smell exhibited in our sensations, while eschewing\nany over-confident metaphysical claims about the extent to which this\nidea may be correct. Indeed, towards close of the Treatise he\nadmitted that the question of whether material things exist is not one\nthat we are in any position to answer. We cannot be sure that objects\nare extended, shaped, and mobile, yet colourless, odourless, and\ntasteless. For all we know the objects that cause our sensations may\nnot only be extended and solid, but endowed with qualities that\nresemble our sensations of smell, taste, and colour. Or they may be\nnot only colourless, odourless, and tasteless but unextended\n(Treatise IV.v).\n\nHowever, Condillac had no right to simply-side step the metaphysical\nquestion of the nature of body. His account of how touch instructs the\neyes to see figures and locations describes the hands as extended\nobjects that move through space and touch various parts of the\nextended surfaces of the eyes (Treatise III.iii.1–9).\nOne cannot remain agnostic about whether spatially extended objects\nreally exist if one’s theory of perception presupposes that\none’s sense organs are themselves extended and mobile.\n10.2 Materialism\n\nCondillac’s account of sensation also fit uneasily with his\nclaim that the mind is immaterial. He took sensations to be\nmodifications of the mind’s being. He also stipulated that such\nthings as colours and scents are sensations. In the Essay, he\nspecified that there is nothing in bodies that resembles colours or\nscents and that these qualities are something that belongs to sentient\ncreatures alone (Essay I.i.2. §12). In the\nTreatise, employing a striking turn of phrase, he claimed\nthat while we might think of a being who possessed only the sense of\nsmell as a being who scents a rose, for itself this being will simply\nbe the smell of a rose. “From its perspective,” he wrote,\n“the odours are nothing other than its own modifications or\nmanners of being” (Treatise I.i.2). The same holds of\ncolours. A being whom we would describe as seeing red would at first\nexperience itself as simply being red. Touch would instruct it to\nattribute this redness to other objects. But this instruction cannot\nbe known to be correct, whereas there can be no question that the\nsensation of red is a modification of the being of a sentient\ncreature. Red is not, therefore, what might be called the intentional\nobject of an act of sensing, or if it is, it is so only derivatively;\nit is primarily a quality of the sentient being, who experiences\nitself as literally turning red when it has this sensation\n(Treatise I.xi.8). \n\nThe problem with this position becomes clear when it is considered\nthat Condillac also maintained that colours are extended. In the\nEssay he claimed that were we to have no other sensations\nthan those of light and colour they would “trace\n(traceront) extension, lines, and figures before our\neyes” so that we would find these ideas to be contained in our\nsensations (Essay I.i.2. §9). Moreover, this discovery\nis not an effect of learning or association. Extension and shape are\noriginal features possessed by visual sensations, discernible simply\nby attentive reflection. Someone blind since birth and newly made to\nsee would not originally perceive everything before him as if it were\na “point” (i.e., an unextended spot of colour), but would\nexperience “light distributed (répandue) in\nevery direction [outwards as well as above, below, to the left and to\nthe right]” (Essay I.vi. §§12, 14). Condillac\ncontinued to retain this view in the Treatise, though with\nsome refinements: Whereas in the Essay he had maintained that\ncolours are extended over all three dimensions, in the\nTreatise he endorsed the Berkeleyan position that we learn to\nperceive depth. He also maintained that we do not immediately\nappreciate that colours are bounded and figured even in two\ndimensions, but need to learn that they have these features. But he\ncontinued to maintain that the colours we originally experience are\nextended over two dimensions. “Colour presents [offre]\nextension to the soul that it modifies,” he wrote in the\nTreatise, “because it is itself extended. This is a\nfact that cannot be brought into doubt. It is demonstrated by\nobservation” (Treatise I.xi.8). Insofar as colours are\nextended they must have shapes, even if those shapes are not\nimmediately perceived. The process of learning to perceive shape does\nnot transform our colour sensations and lead them to acquire\nproperties they did not previously have; it merely leads us to\ndiscover ones that were there all along. This is the point of claiming\nthat not everything that is necessarily involved with a sensation need\nbe perceived by it.\n\nCondillac thus appears to have been committed to four mutually\nantagonistic propositions:\n\nColours are extended.\nColours are sensations.\nSensations are modifications of the mind’s being.\nThe mind is unextended.\n\n\nHume had confronted the conflict between these propositions by denying\n(3) and (4). For Hume, our visual impressions are compounds that\nconsist of a number of minimally visible, coloured points that are\ndisposed alongside another in space, but the notion that impressions\nand ideas inhere in some mental substance is unintelligible, whether\nthis substance is taken to be material or immaterial. Reid, in\ncontrast, had insisted on (3) and (4) but had declared that the term\n“colour” is used equivocally in (1) and (2). We experience\nsensations of colour, which are unextended states of feeling\nexperienced by the mind in just the same way as it experiences\nfeelings of pleasure or pain. But colour terminology is most often\nused to refer to some unknown thing in external objects that causes us\nto experience these sensations. These external, so-called\n“coloured” objects are conceived as being extended and\nfigured, but the mind does not become aware of them by contemplating\nsome internal, iconic representation or image. It has a thought that\nrefers to them. Affection of our sense organs does not produce an\nimpression or image; it occasions a thought. The thought itself is\nunextended, like the mind whose state it is, but it is a thought\nof or about an object. The object is thought to\npossess a quality of extension, as well as to be a cause of a certain\nconcomitant sensation of colour. But the thought that this\nobject is extended and a cause of a sensation of colour is itself\nneither extended nor coloured. So for Reid, either\n“colours” are powers in extended, external objects to\nbring about sensations in us, in which case they are not sensations\nhad by the mind, or they are sensations had by the mind, in which case\nthey are not extended. \n\nHowever, unlike Hume and Reid, Condillac was unwilling to deny or\nqualify any of (1)-(4). Unlike Hume, he insisted on the existence of\nan immaterial mind who is the subject of sensations of colour\n(Essay I.i.1. §6). And unlike Reid, he insisted that\ncolours are unequivocally both modifications of the mind’s being\nand literally extended. These commitments exposed him to charges of\ntacit materialism. Most notably, René Réaumur, writing\nunder the pseudonym of the Abbé de Lignac, observed in the\nsupplements to his Lettres à un Américan\n(1756), that just as Condillac had accused Buffon of supposing that\nmachines have a quality that is essential to spirits, sensibility, so\nCondillac was liable to the charge of supposing that spirits have a\nquality that belongs uniquely to machines, three dimensionality.\n\nCondillac’s response to this charge, in his “Lettre de M.\nl’abbé de Condillac à l’auteur des Lettres\nà un Américan” (1756, and appended to subsequent\neditions of the Treatise on Animals) was to claim that,\n“If I say that our sensations give us an idea of extension, it\nis only because we take them for qualities of objects when we refer\nthem to something external. But I have proven many times that they\ncertainly do not give us this idea when we consider them as a manner\nof being of our soul.” This echoes claims made in the\nEssay and the Treatise. In the Essay,\nCondillac claimed that we attribute the extension or shape we find in\ncolours to something outside of us rather than to ourselves considered\nas thinking subjects (I.i.2. §11), presumably because extension\nis incompatible with the simplicity that must be ascribed to a\nthinking being. In almost the same breath, he claimed that we are\nwrong to imagine that the chromatic quality of colours (as opposed to\nthe extension and shape they map out) actually lies on the surface of\nexternal objects, purportedly because we have no clear idea of what it\nwould mean for a body to be coloured (I.i.2. §12). But such\nclaims are hardly adequate to avoid the problem and perhaps not even\ncoherent. Either the chromatic qualities that we experience as\nmodifications of our being are extended or they are not. If they are\nextended, then the claim that we do not recognize this fact when we\nthink of them as modifications of our own being is merely an evasion.\nIf they are not extended, then if we never experience anything other\nthan our own sensations, as Condillac claimed at the outset of the\nEssay, it is mysterious how we come to attribute extension to\nexternal objects.\n\nIn the Treatise, Condillac was no longer willing to declare\nthat objects can be known to be either extended or colourless. He\nsimply claimed that its experiences would lead his\n“statue” to first conceive of colours as modifications of\nits own being, then to conceive them as modifications of its extended\nsense organs, and finally to conceive them as modifications of\nexternal objects (Treatise III.3). But this was not to answer\nthe metaphysical problem but rather to ignore it. If colours are in\nfact extended, as the Treatise continued to insist, yet the\nmind ultimately only knows its own sensations, however variously they\nmight be transformed by cognitive processing, then we can only come to\nbe in a position to attribute colours to external objects if we first\nexperience those colours, which suggests that they must modify our\nbeing.\n\nThough Condillac’s official reply to the charge of materialism,\nas expressed in the letter to Lignac, is something of a\ndisappointment, scholars have occasionally read the Treatise\nas taking some steps towards a more radical way of dealing with the\nproblem. Recall that in that work Condillac advanced the view that\neven though colours are in fact extended and bounded, it is not\nintuitively evident that they are. We need to learn to see their\nshapes. Interestingly, what teaches us to see these shapes are tactile\nsensations of solidity and observations of the appearance and\ndisappearance of colours consequent upon moving our hands before our\neyes. Since neither sensations of solidity nor the tactile sensations\nthat accompany hand motions are patently extensive in character, and\ncolours themselves might as well not be so far as the early learner is\nconcerned, some scholars have suggested that the Condillac of the\nTreatise meant to claim that our perceptions of space are\nconstructed from raw data that, as they are at first experienced by\nthe mind, are in no way spatial. Insofar as the Treatise does\nmove towards this more radical view, it can be seen as a precursor of\nsuch 19th century Berkeleyan theories of vision as those of Steinbuch,\nMill, Helmholtz, and Wundt. However, those later theories invoked\nnotions of local signs (sensations specific to which nerve is being\nstimulated) and made explicit appeals to kinaesthetic sensations that\nare simply absent from Condillac’s work. Lacking those notions,\nCondillac claimed that an awareness of space cannot be generated from\naspatial sensations, and he represented his statue, not as\nconstructing space, but as discovering the spatial features that were\nalready present in its sensations from the first. Viewing him as a\nprecursor of 19th century Berkeleyanism risks overlooking this fact\nand, as a consequence, misrepresenting his thought.\n10.3 Memory and Liberty\n\nIn both the Essay and the Treatise Condillac set out\nto show that all of our cognitive and conative faculties are generated\nfrom sensation and can be derived from that operation alone. To this\nend he identified perception, consciousness, and attention as all\nbeing different aspects of the one operation of sensation. Perception\nis the impression sensation makes upon the mind, consciousness is this\nimpression considered as something experienced by the mind, and\nattention is simply a more vivid perception. But when Condillac came\nto account for memory and reminiscence, this project stalled. It is\nnot implausible to maintain that a sensation might continue to be\nexperienced after the object that occasioned it has ceased to act on\nthe sense organ. But such an “echo” of a past sensation is\nitself a present phenomenon. It might be fainter than other sensations\nthat are now occurring, but being experienced to be faint is not the\nsame thing as being thought to have originated in the past. Rather\nthan explain how sensation can give rise to an awareness of pastness\nCondillac simply helped himself to the notion. In the Essay,\nhe defined “reminiscence” as the awareness that a\nperception has been had “before” without anywhere\nexplaining how the idea that one thing can be “before”\nanother could arise simply from sensation (Essay I.ii.1.\n§15). In the Treatise he distinguished the memory of a\nsensation from a current sensation by calling the former “weakly\nsensing what one was (sentir foiblement ce qu’elle a\nété)” and the latter “vividly sensing\nwhat one is (sentir vivement ce qu’elle est).”\nBut then he immediately went on to say that recalled sensations can\nsometimes be more vivid than current ones (Treatise\nI.ii.8–9). So what necessarily distinguishes remembered\nsensation from current sensation, on this account, is just that\nremembered sensations are of what “was.” But this is not\nto explain how we could get the idea that a sensation is of what was\nas opposed to what is. \n\nSimilar difficulties arise in connection with the will. In the\nEssay, Condillac supposed that the imagination is initially\noutside of our control. Unless driven by need to conceive the means of\nachieving an end, we imagine what we do only because in the course of\nexperience we sense accidental or natural signs that suggest\nparticular ideas to us. The use of instituted signs is supposed to\nchange this circumstance and give us a new ability to control our\nthoughts (Essay I.ii.4.§§45–46). But it is\nnot clear why this should be the case (note, in this regard, the\napparent contradiction between Essay I.ii.4. §39 and\n§46). Just because a being has acquired the ability to produce\nsigns in order to induce thought, it does not follow that this ability\nmust be under the subject’s voluntary control, and if the\nproduction of instituted signs is outside of our control, it is not\nclear how their use can give us a power to control our thoughts.\n\nThe “sensationist” label notwithstanding, there is some\nsuggestion that Condillac may have taken both memory and volition to\nbe primitive functions of the soul that are not in fact reducible to\nsensation. In the Essay he described our awareness of the\ntemporal sequence of our perceptions as a “fundamental\nexperience (première expérience)”\n(Essay I.ii.1. §15) and in the Dissertation on Liberty\n(§§9–10) he seems to have taken freedom of choice and\nthe ability to spontaneously direct attention to be original abilities\nthat the soul has whenever it is not impelled by some pressing\nneed.\n\nThese views of memory and will are not necessarily inconsistent with\nCondillac’s sensationism, his repeated claims to derive all the\nmind’s capacities from the operation of sensation\nnotwithstanding. There are stronger and weaker ways of understanding\nCondillac’s sensationism. On the stronger understanding,\nCondillac meant to say that sensation produces all of the other\ncapacities of the soul. On the weaker understanding, he only meant to\nsay that sensation instructs us in the proper employment of our\ncapacities. The weaker reading is compatible with allowing original,\nirreducible powers of memory and free choice, provided that we take\nthose powers to be ones that we do not at first know how to\neffectively direct or employ. The stronger reading attributes an\nabsolutely rigorous empiricism to Condillac — one that does not\nadmit that the mind is endowed with any innate abilities. It is not\nclear what Condillac would have had to gain by insisting on such a\nrigorous empiricism. Locke’s rejection of innate ideas and\ninnate principles was bound up with a reaction to unquestioned\nauthority and a demand that all knowledge claims be demonstrable by\nappeal to common experience. But allowing that we possess innate\ncognitive capacities and innate conative abilities does not interfere\nwith this demand, particularly if we stress, as the weak reading does,\nthat we need to learn how to employ these capacities and abilities,\nand that experience serves as our best and only true teacher. The\npedagogical and methodological conclusions that Condillac most wanted\nto draw still follow from that qualification, without having to invoke\nthe strong reading.\n",
    "bibliography": {
        "categories": [
            "Primary Literature",
            "Secondary Literature"
        ],
        "cat_ref_text": {
            "Primary Literature": [
                "</h3>\n<h4>Condillac’s Works</h4>\n<ul>",
                "<em>Lettres inédites à Gabriel Cramer</em>, Georges\nLe Roy (ed.), Paris: Press Universitaires de France, 1953. For\nimportant revisions to Le Roy’s dating of Condillac’s\nletters, see Petacco 1971.",
                "<em>Les Monades</em>, Bongie, Laurence (ed.), in <em>Studies on\nVoltaire and the Eighteenth Century</em>, 187, 1980.",
                "<em>Oeuvres philosophiques</em>, Georges Le Roy (ed.), 3 volumes,\nParis: Presses Universitaires de France, 1947–1951.\n\n<ul>",
                "Volume I (1947) contains the <em>Essai sur l’origine des\nconnoissances humaines, Traité des Systêmes,\nTraité des Sensations</em>, “Dissertation sur la\nliberté,” “Réponse a un reproche qui\nm’a été fait sur le project exécuté\ndans le Traité des Sensations,” “Extrait\nraisonné du traité des sensations,”\n<em>Traité des Animaux</em>, “Lettre de monsieur\nl’abbé de Condillac à l’auteur des\n‘Lettres à un Américan,’”\n“Discours de réception a l’académie\nFrançoise,” and selections from the <em>Cours\nd’études pour l’instruction du Prince de\nParme</em>, including the introduction to the course of studies,\n<em>Grammaire, De l’art d’écrire, De l’art de\nraisonner</em>, and <em>De l’art de Penser</em>, It is prefaced\nby Le Roy’s introduction, surveying Condillac’s life, the\ndevelopment of his thought, and his influence.",
                "Volume II (1948) contains excerpts from the treatment of ancient\nand modern history in the <em>Cours d’études, Le Commerce\net le Gouvernement, La Logique, La Langue des Calculs</em>, and\ncorrespondence.",
                "Volume III (1951) contains the <em>Dictionnaire des synonymes</em>\nand a bibliography containing directions regarding Condillac\nmanuscripts and correspondence.\n</ul>",
                "<em>Condillac</em>, Lefèvre, Roger, Vienne: Segliers, 1966.\nThis contains substantial selections from Condillac’s works\ninterpersed with running commentary. It is an excellent introduction\nto his thought.",
                "<em>Essay on the Origin of Human Knowledge</em>, Hans Aarsleff\n(trans.), Cambridge: Cambridge University Press, 2001.",
                "<em>La Logique/Logic</em>, W. R. Albury (ed. and trans.), New\nYork: Abaris, 1980. This is a bilingual edition with English\ntranslation and a facsimilie reproduction of an early French edition\non facing pages. Unfortunately, the editor neglects to indicate which\nedition is being reproduced.",
                "<em>Condillac’s treatise on the sensations</em>, Geraldine\nCarr (trans.), London: Favil Press, 1930.",
                "<em>An Essay on the Origin of Human Knowledge: being a supplement\nto Mr. Locke’s essay on the human understanding</em>, Thomas\nNugent (trans.), London: J. Nourse, 1756. Reprinted in facsimilie,\n1971, Gainsville: Scholar’s Facsimilies and Reprints.",
                "<em>Philosophical Writings of Etienne Bonnot, Abbé de\nCondillac</em>, 2 volumes, Franklin Philip (trans.), Hillsdale NJ:\nLawrence Erlbaum, 1982–87.\n\n<ul>",
                "Volume I (1982) contains <em>A Treatise on Systems, A Treatise on\nSensations</em>, and <em>Logic, or the First Developments of the Art\nof Thinking</em>. The translation of Condillac’s introduction to\nthe <em>Treatise on Sensations</em>, contains a translation of the\n“Extrait rasonné,” without acknowledgement or\nseparation from the rest of Condillac’s original introduction.\nThe translation of the <em>Treatise on Sensations</em>, omits the\n“Dissertation on Liberty.”",
                "Volume II (1987) contains a judicious abridgment of the <em>Essay\non the Origin of Human Knowledge</em>, and the introduction to the\n<em>Course of Study for the Prince of Parma</em>,\n</ul>",
                "<em>Commerce and Government Considered in Their Mutual\nRelationship</em>, Shelagh Eltis (trans.), with an introduction by\nShelagh Eltis and Walter Eltis, Indianapolis: Liberty Fund, 2008.\n</ul>\n<h4>Related Primary Source Material</h4>\n<ul class=\"hanging\">",
                "Buffon, Georges-Louis Leclerc, Comte de, <em>Histoire naturelle,\ngénérale et particulière</em>, Paris: Imprimerie\nRoyale, 1749–53.",
                "Bonnet, Charles, 1755, <em>Essai de psychologie</em>, Hildesheim:\nOlms, 1978.",
                "Chesselden, W., 1728, “An Account of some Observations made\nby a young Gentleman who was born blind ... and was couch’d\nbetween 13 and 14 Years of Age,” London: W. Innys, 1729;\nreprinted in Royal Society of London, <em>Philosophical\nTransactions</em>, 35 (402): 447–450.",
                "Diderot, Denis, 1749, “Letter on the Blind for the Use of\nThose Who See,” in <em>Diderot’s Early Philosophical\nWorks</em>, Margaret Jourdain (trans.), New York: Burt Franklin,\n1972.",
                "Helvetius, Claude A., 1760, <em>De L’esprit, or, Essays on\nthe mind and its several faculties</em>, New York: Burt Franklin,\n1970.",
                "Hume, David, 1739, <em>A Treatise of Human Nature</em>, Book I,\nDavid Fate Norton and Mary J. Norton (eds.), Oxford: Oxford University\nPress, 2000.",
                "Lignac, Joseph Adrien Lelarge, Abbé de [Réaumur,\nRené Antoine Ferchault de], 1756, <em>Suite des “Lettres\nà un Américan” sur les IV et V Volumes de l’\n“Histoire Naturelle” de M. de Buffon, et sur le\n“Traité des Animaux” de M. l’abbé de\nCondillac</em>, 4 vols., Hambourg. (Cited by Le Roy in Condillac,\n<em>Oeuvres philosophiques</em>, vol. I: 381 n.19.)",
                "Reid, Thomas, 1764, <em>An Inquiry into the Human Mind on the\nPrinciples of Common Sense</em>, Derek R. Brookes (ed.), University\nPark: The Pennsylvania State University, 1997.",
                "Tetens, Johan Nicolai, 1777, <em>Philosophische Versuche über\ndie menschliche Natur und ihre Entwicklung</em>, Wilhelm Uebele (ed.),\nBerlin: Reuther &amp; Richard, 1913.\n</ul>\n<!--pdf include <br/>\npdf include-->\n<h3>"
            ],
            "Secondary Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Aarsleff, Hans, 1975, “Condillac’s Speechless\nStatue,” <em>Akten des II. Internationalen\nLeibniz-Kongresses</em> (Volume 4), Wiesbaden: 287–302.",
                "Aarsleff, Hans, 1982, <em>From Locke to Saussure: Essays on the\nStudy of Language and Intellectual History</em>, Minneapolis:\nUniversity of Minnesota.",
                "Aarsleff, Hans, 2006, “Philosophy of Language,” in\nKnud Haakonssen (ed.), <em>The Cambridge History of Eighteenth-Century\nPhilosophy</em>, Volume 1, Cambridge: Cambridge University Press.",
                "Albury, W. R., 1986, “The order of Ideas,” in John A.\nShuster (ed.), <em>The Politics and Rhetoric of Scientific\nMethod</em>, Dordrecht: Kluwer.",
                "Baertschi, Bernard, 1984, “La statue de Condillac, image du\nreel ou fiction logique?” <em>Revue Philosophique de\nLouvain</em>, 82: 335–364.",
                "Baguenault de Puchesse, Gustave, 1910, <em>Condillac: sa vie, sa\nphilosophie, son influence</em>, Paris: Plon-Nourrit.",
                "Beal, M. W., 1973, “Condillac as Precursor of Kant,”\n<em>Studies on Voltaire and the Eighteenth Century</em>, 102:\n193–229.",
                "Bertrand, Aliènor (ed.), 2002, <em>Condillac:\nL’origine de langage</em>, Paris: Presses Universitaires de\nFrance.",
                "Bertrand, Aliènor (ed.), 2002, <em>Le vocabulaire de\nCondillac</em>, Paris: Ellipses.",
                "Bongie, Laurence L., 1978, “A new Condillac Letter and the\nGenesis of the <em>Traité des sensations</em>,”\n<em>Journal of the History of Philosophy</em>, 16: 83–94.",
                "Cassirer, Ernst, 1951, <em>The Philosophy of the\nEnlightenment</em>, C.A. Koellin and James P. Pettegrove (trans.),\nBoston: Beacon.",
                "Charrak, André, 2003, <em>Empirisme et métaphysique:\nL’Essai sur l’origine des connaissances humaines de\nCondillac</em>, Paris: J. Vrin.",
                "Dagognet, François, 2004, <em>L’animal selon\nCondillac: Étude sur le Traité des animaux</em>, Paris:\nJ. Vrin.",
                "Derrida, Jacques, 1987, <em>The Archaeology of the Frivolous</em>,\nJohn P. Leavy (trans.), Lincoln: University of Nebraska.",
                "Duchesneau, François, 1974, “Condillac critique de\nLocke,” <em>Studi Internationali di Filosofia</em>, 6:\n77–98.",
                "Falkenstein, Lorne, 2005, “Condillac’s Paradox,”\n<em>Journal of the History of Philosophy</em>, 43: 403–435.",
                "Funke, Gerhard, 1957, “Natur und zweite Natur im\nkonsequenten Sensualismus. Condillacs Transformationstheorie,”\n<em>Philosophia Narturalis</em>, 4: 101–125.",
                "George, Rolf A., 1991, “The Tradition of Thought\nExperiments,” in Tamara Horowitz (ed.), <em>Epistemology in\nThought Experiments in Science and Philosophy</em>, Lanham: Rowman\n&amp; Littlefield.",
                "Gilot, Michel and Sgard, Jean, 1981, “Biographie,” in\nJean Sgard, ed., <em>Corpus Condillac</em>, Geneva: Slatkine.",
                "Grandi, Giovanni B., 2008, “Reid and Condillac on Sensation\nand Perception: A Thought Experiment on Sensory Deprivation,”\n<em>Southwest Philosophy Review</em>, 24: 191–200.",
                "Hasnaoui, C., 1977, “Condillac, chemins du\nsensualisme,” in M. Duchet and M. Jalley (eds.), <em>Langues et\nlangages de Leibniz à l’ encyclopédie</em>, Paris:\nU.G.E.",
                "Heidsieck, François, 1985, “La métaphysique de\nCondillac,” <em>Archives de Philosophie</em>, 48:\n643–652.",
                "Hine McNiven, Ellen, 1979, <em>A Critical Study of\nCondillac’s Traité des Systems</em>, The Hague: M.\nNijhoff.",
                "Jacquette, Dale, 2015, “Condillac’s Analytic\nDilemma,” <em>History of Philosophy Quarterly</em>, 32:\n141–160.",
                "Joly, Andre, 1985, “Cartesian or Condillacian\nLinguistics?” <em>Topoi</em>, 4: 145–49.",
                "Knight, Isabel F., 1968, “Bibliographical Essay,” in\nIsabel Knight, <em>The Geometric Spirit: The Abbé de Condillac\nand the French Enlightenment</em>, New Haven: Yale.",
                "Knight, Isabel F., 1968, <em>The Geometric Spirit: The Abbé\nde Condillac and the French Enlightenment</em>, New Haven: Yale.\nThough dated, this work remains unsurpassed as the authorative\ntreatment of Condillac’s thought in English.",
                "Kourim. Z., 1974. “Le discours de la méthode de\nCondillac,” <em>Revue de métaphysique et de morale</em>,\n79: 177–195.",
                "Kreimendahl, Lothar, 1982, “Condillac und die Monaden. Zu\neinem neuaufgefundenen Text des Abbés,” <em>Archiv\nfür Geschichte der Philosophie</em>, 64: 280–288.",
                "Kreimendahl, Lothar, 1984, “Bibliographie des Schrifttums zu\nCondillac (1840–1980),” <em>Zeitschrift für\nphilosophische Forchung</em>, 38: 311–321.",
                "Kreimendahl, Lothar, 1994, <em>Hauptwerke der Philosophie.\nRationalismus und Empirismus</em>, Stuttgart: Reclam.",
                "Krüger, Lorenz, 1973, “Empirismus und Sensualismus: ein\nExkurs über Condillac,” in Lorenz Krüger (ed.),\n<em>Der Begriff des Empirismus. Erkenntnistheoretische Studien am\nBeispiel John Lockes</em>, Berlin: De Gruyter.",
                "Koana, Akiko, 1985, “La theorie musicale dans\nl’epistemologie de Condillac,” in Peter McCormick (ed.),\n<em>The Reasons of Art</em>, Ottawa: University of Ottawa.",
                "Lenoir, Raymond, 1924, <em>Condillac</em>, Paris: F. Alcan.",
                "LeRoy, Georges, 1937, <em>La psychologie de Condillac</em>, Paris:\nBoivin.",
                "Malherbe, Michel, 2004, “Introduction” to Condillac,\n<em>Traité des animaux</em>, Paris: J. Vrin.",
                "McRae, Robert, 1961, <em>The Problem of the Unity of the Sciences:\nBacon to Kant</em>, Toronto: University of Toronto.",
                "Morgan, Michael J., 1977, <em>Molyneux’s Question. Vision,\nTouch and the Philosophy of Perception</em>, Cambridge: Cambridge\nUniversity Press.",
                "O’Neal, John C, 1996, <em>The Authority of Experience:\nSensationist Theory in the French Enlightenment</em>, University Park:\nThe Pennsylvania State University.",
                "Oppenheimer, Angelika, 2006, “Introduction”, Angelika\nOppenheimer (trans.), <em>Versuch über den Ursprung der\nmenschlichen Erkenntnis</em>, Würzburg: Königshausen &amp;\nNeumann.",
                "Paganini, Gianni, 1992, “Psychologie et physiologie de\nl’entendement chez Condillac,” <em>Dix-huitieme\nsiecle</em>, 24: 165–178.",
                "Paganini, Gianni, 1988, “Signes, imagination et\nmémoire: De la psychologie de Wolff à l’Essai de\nCondillac” <em>Revue des Sciences Philosophiques et\nTheologiques</em>, 72: 287–300.",
                "Paradis, André, 1993, “De Condillac a Pinel ou les\nfondements philosophiques du traitement moral,”\n<em>Philosophiques</em>, 20: 69–112.",
                "Pastore, Nicholas, 1971, <em>Selective History of Theories of\nVisual Perception: 1650–1950</em>, New York: Oxford.",
                "Pécharman, Martine, 1999, “Signification et langage\ndans l’Essai de Condillac,” <em>Revue de\nmétaphysique et de morale</em>, (1): 81–103.",
                "Petacco, Piero, 1971, “Note sul carteggio\nCondillac–Cramer,” <em>Belfagor</em>, 26:\n83–95.",
                "Robert, Thomas, 2012, “Les deux langages d’action\ncondillaciens: corps, langage, connaissances,” <em>Rivista\nitaliana di filosofia del linguaggio</em>, 5: 150–162.",
                "Roberts, Lissa, 1992, “Condillac, Lavoiser, and the\nInstrumentalization of Science,” <em>Kennis Methode</em>, 16:\n172–190.",
                "Rousseau, Nicholas, 1986, <em>Connaissance et langage chez\nCondillac</em>, Geneva: Droz.",
                "Sgard, Jean (ed.), 1981, <em>Corpus Condillac</em>, Geneva:\nSlatkine.",
                "Sgard, Jean (ed.), 1982, <em>Condillac et les problèmes du\nlangage</em>, Geneva: Slatkine.",
                "Wells, G.A., 1987, <em>The Origin of Language: Aspects of the\nDiscussion from Condillac to Wundt</em>, Chicago: Open Court.",
                "Wojciechowska, Wanda, “Le sensualisme de Condillac,”\n<em>Revue philosophique de la France et de\nl’étranger</em>, 158: 297–320.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3>Primary Literature</h3>\n<h4>Condillac’s Works</h4>\n<ul>\n<li><em>Lettres inédites à Gabriel Cramer</em>, Georges\nLe Roy (ed.), Paris: Press Universitaires de France, 1953. For\nimportant revisions to Le Roy’s dating of Condillac’s\nletters, see Petacco 1971.</li>\n<li><em>Les Monades</em>, Bongie, Laurence (ed.), in <em>Studies on\nVoltaire and the Eighteenth Century</em>, 187, 1980.</li>\n<li><em>Oeuvres philosophiques</em>, Georges Le Roy (ed.), 3 volumes,\nParis: Presses Universitaires de France, 1947–1951.\n\n<ul>\n<li>Volume I (1947) contains the <em>Essai sur l’origine des\nconnoissances humaines, Traité des Systêmes,\nTraité des Sensations</em>, “Dissertation sur la\nliberté,” “Réponse a un reproche qui\nm’a été fait sur le project exécuté\ndans le Traité des Sensations,” “Extrait\nraisonné du traité des sensations,”\n<em>Traité des Animaux</em>, “Lettre de monsieur\nl’abbé de Condillac à l’auteur des\n‘Lettres à un Américan,’”\n“Discours de réception a l’académie\nFrançoise,” and selections from the <em>Cours\nd’études pour l’instruction du Prince de\nParme</em>, including the introduction to the course of studies,\n<em>Grammaire, De l’art d’écrire, De l’art de\nraisonner</em>, and <em>De l’art de Penser</em>, It is prefaced\nby Le Roy’s introduction, surveying Condillac’s life, the\ndevelopment of his thought, and his influence.</li>\n<li>Volume II (1948) contains excerpts from the treatment of ancient\nand modern history in the <em>Cours d’études, Le Commerce\net le Gouvernement, La Logique, La Langue des Calculs</em>, and\ncorrespondence.</li>\n<li>Volume III (1951) contains the <em>Dictionnaire des synonymes</em>\nand a bibliography containing directions regarding Condillac\nmanuscripts and correspondence.</li>\n</ul> </li>\n<li><em>Condillac</em>, Lefèvre, Roger, Vienne: Segliers, 1966.\nThis contains substantial selections from Condillac’s works\ninterpersed with running commentary. It is an excellent introduction\nto his thought.</li>\n<li><em>Essay on the Origin of Human Knowledge</em>, Hans Aarsleff\n(trans.), Cambridge: Cambridge University Press, 2001.</li>\n<li><em>La Logique/Logic</em>, W. R. Albury (ed. and trans.), New\nYork: Abaris, 1980. This is a bilingual edition with English\ntranslation and a facsimilie reproduction of an early French edition\non facing pages. Unfortunately, the editor neglects to indicate which\nedition is being reproduced.</li>\n<li><em>Condillac’s treatise on the sensations</em>, Geraldine\nCarr (trans.), London: Favil Press, 1930.</li>\n<li><em>An Essay on the Origin of Human Knowledge: being a supplement\nto Mr. Locke’s essay on the human understanding</em>, Thomas\nNugent (trans.), London: J. Nourse, 1756. Reprinted in facsimilie,\n1971, Gainsville: Scholar’s Facsimilies and Reprints.</li>\n<li><em>Philosophical Writings of Etienne Bonnot, Abbé de\nCondillac</em>, 2 volumes, Franklin Philip (trans.), Hillsdale NJ:\nLawrence Erlbaum, 1982–87.\n\n<ul>\n<li>Volume I (1982) contains <em>A Treatise on Systems, A Treatise on\nSensations</em>, and <em>Logic, or the First Developments of the Art\nof Thinking</em>. The translation of Condillac’s introduction to\nthe <em>Treatise on Sensations</em>, contains a translation of the\n“Extrait rasonné,” without acknowledgement or\nseparation from the rest of Condillac’s original introduction.\nThe translation of the <em>Treatise on Sensations</em>, omits the\n“Dissertation on Liberty.”</li>\n<li>Volume II (1987) contains a judicious abridgment of the <em>Essay\non the Origin of Human Knowledge</em>, and the introduction to the\n<em>Course of Study for the Prince of Parma</em>,</li>\n</ul> </li>\n<li><em>Commerce and Government Considered in Their Mutual\nRelationship</em>, Shelagh Eltis (trans.), with an introduction by\nShelagh Eltis and Walter Eltis, Indianapolis: Liberty Fund, 2008.</li>\n</ul>\n<h4>Related Primary Source Material</h4>\n<ul class=\"hanging\">\n<li>Buffon, Georges-Louis Leclerc, Comte de, <em>Histoire naturelle,\ngénérale et particulière</em>, Paris: Imprimerie\nRoyale, 1749–53.</li>\n<li>Bonnet, Charles, 1755, <em>Essai de psychologie</em>, Hildesheim:\nOlms, 1978.</li>\n<li>Chesselden, W., 1728, “An Account of some Observations made\nby a young Gentleman who was born blind ... and was couch’d\nbetween 13 and 14 Years of Age,” London: W. Innys, 1729;\nreprinted in Royal Society of London, <em>Philosophical\nTransactions</em>, 35 (402): 447–450.</li>\n<li>Diderot, Denis, 1749, “Letter on the Blind for the Use of\nThose Who See,” in <em>Diderot’s Early Philosophical\nWorks</em>, Margaret Jourdain (trans.), New York: Burt Franklin,\n1972.</li>\n<li>Helvetius, Claude A., 1760, <em>De L’esprit, or, Essays on\nthe mind and its several faculties</em>, New York: Burt Franklin,\n1970.</li>\n<li>Hume, David, 1739, <em>A Treatise of Human Nature</em>, Book I,\nDavid Fate Norton and Mary J. Norton (eds.), Oxford: Oxford University\nPress, 2000.</li>\n<li>Lignac, Joseph Adrien Lelarge, Abbé de [Réaumur,\nRené Antoine Ferchault de], 1756, <em>Suite des “Lettres\nà un Américan” sur les IV et V Volumes de l’\n“Histoire Naturelle” de M. de Buffon, et sur le\n“Traité des Animaux” de M. l’abbé de\nCondillac</em>, 4 vols., Hambourg. (Cited by Le Roy in Condillac,\n<em>Oeuvres philosophiques</em>, vol. I: 381 n.19.)</li>\n<li>Reid, Thomas, 1764, <em>An Inquiry into the Human Mind on the\nPrinciples of Common Sense</em>, Derek R. Brookes (ed.), University\nPark: The Pennsylvania State University, 1997.</li>\n<li>Tetens, Johan Nicolai, 1777, <em>Philosophische Versuche über\ndie menschliche Natur und ihre Entwicklung</em>, Wilhelm Uebele (ed.),\nBerlin: Reuther &amp; Richard, 1913.</li>\n</ul>\n<!--pdf include <br/>\npdf include-->\n<h3>Secondary Literature</h3>\n<ul class=\"hanging\">\n<li>Aarsleff, Hans, 1975, “Condillac’s Speechless\nStatue,” <em>Akten des II. Internationalen\nLeibniz-Kongresses</em> (Volume 4), Wiesbaden: 287–302.</li>\n<li>Aarsleff, Hans, 1982, <em>From Locke to Saussure: Essays on the\nStudy of Language and Intellectual History</em>, Minneapolis:\nUniversity of Minnesota.</li>\n<li>Aarsleff, Hans, 2006, “Philosophy of Language,” in\nKnud Haakonssen (ed.), <em>The Cambridge History of Eighteenth-Century\nPhilosophy</em>, Volume 1, Cambridge: Cambridge University Press.</li>\n<li>Albury, W. R., 1986, “The order of Ideas,” in John A.\nShuster (ed.), <em>The Politics and Rhetoric of Scientific\nMethod</em>, Dordrecht: Kluwer.</li>\n<li>Baertschi, Bernard, 1984, “La statue de Condillac, image du\nreel ou fiction logique?” <em>Revue Philosophique de\nLouvain</em>, 82: 335–364.</li>\n<li>Baguenault de Puchesse, Gustave, 1910, <em>Condillac: sa vie, sa\nphilosophie, son influence</em>, Paris: Plon-Nourrit.</li>\n<li>Beal, M. W., 1973, “Condillac as Precursor of Kant,”\n<em>Studies on Voltaire and the Eighteenth Century</em>, 102:\n193–229.</li>\n<li>Bertrand, Aliènor (ed.), 2002, <em>Condillac:\nL’origine de langage</em>, Paris: Presses Universitaires de\nFrance.</li>\n<li>Bertrand, Aliènor (ed.), 2002, <em>Le vocabulaire de\nCondillac</em>, Paris: Ellipses.</li>\n<li>Bongie, Laurence L., 1978, “A new Condillac Letter and the\nGenesis of the <em>Traité des sensations</em>,”\n<em>Journal of the History of Philosophy</em>, 16: 83–94.</li>\n<li>Cassirer, Ernst, 1951, <em>The Philosophy of the\nEnlightenment</em>, C.A. Koellin and James P. Pettegrove (trans.),\nBoston: Beacon.</li>\n<li>Charrak, André, 2003, <em>Empirisme et métaphysique:\nL’Essai sur l’origine des connaissances humaines de\nCondillac</em>, Paris: J. Vrin.</li>\n<li>Dagognet, François, 2004, <em>L’animal selon\nCondillac: Étude sur le Traité des animaux</em>, Paris:\nJ. Vrin.</li>\n<li>Derrida, Jacques, 1987, <em>The Archaeology of the Frivolous</em>,\nJohn P. Leavy (trans.), Lincoln: University of Nebraska.</li>\n<li>Duchesneau, François, 1974, “Condillac critique de\nLocke,” <em>Studi Internationali di Filosofia</em>, 6:\n77–98.</li>\n<li>Falkenstein, Lorne, 2005, “Condillac’s Paradox,”\n<em>Journal of the History of Philosophy</em>, 43: 403–435.</li>\n<li>Funke, Gerhard, 1957, “Natur und zweite Natur im\nkonsequenten Sensualismus. Condillacs Transformationstheorie,”\n<em>Philosophia Narturalis</em>, 4: 101–125.</li>\n<li>George, Rolf A., 1991, “The Tradition of Thought\nExperiments,” in Tamara Horowitz (ed.), <em>Epistemology in\nThought Experiments in Science and Philosophy</em>, Lanham: Rowman\n&amp; Littlefield.</li>\n<li>Gilot, Michel and Sgard, Jean, 1981, “Biographie,” in\nJean Sgard, ed., <em>Corpus Condillac</em>, Geneva: Slatkine.</li>\n<li>Grandi, Giovanni B., 2008, “Reid and Condillac on Sensation\nand Perception: A Thought Experiment on Sensory Deprivation,”\n<em>Southwest Philosophy Review</em>, 24: 191–200.</li>\n<li>Hasnaoui, C., 1977, “Condillac, chemins du\nsensualisme,” in M. Duchet and M. Jalley (eds.), <em>Langues et\nlangages de Leibniz à l’ encyclopédie</em>, Paris:\nU.G.E.</li>\n<li>Heidsieck, François, 1985, “La métaphysique de\nCondillac,” <em>Archives de Philosophie</em>, 48:\n643–652.</li>\n<li>Hine McNiven, Ellen, 1979, <em>A Critical Study of\nCondillac’s Traité des Systems</em>, The Hague: M.\nNijhoff.</li>\n<li>Jacquette, Dale, 2015, “Condillac’s Analytic\nDilemma,” <em>History of Philosophy Quarterly</em>, 32:\n141–160.</li>\n<li>Joly, Andre, 1985, “Cartesian or Condillacian\nLinguistics?” <em>Topoi</em>, 4: 145–49.</li>\n<li>Knight, Isabel F., 1968, “Bibliographical Essay,” in\nIsabel Knight, <em>The Geometric Spirit: The Abbé de Condillac\nand the French Enlightenment</em>, New Haven: Yale.</li>\n<li>Knight, Isabel F., 1968, <em>The Geometric Spirit: The Abbé\nde Condillac and the French Enlightenment</em>, New Haven: Yale.\nThough dated, this work remains unsurpassed as the authorative\ntreatment of Condillac’s thought in English.</li>\n<li>Kourim. Z., 1974. “Le discours de la méthode de\nCondillac,” <em>Revue de métaphysique et de morale</em>,\n79: 177–195.</li>\n<li>Kreimendahl, Lothar, 1982, “Condillac und die Monaden. Zu\neinem neuaufgefundenen Text des Abbés,” <em>Archiv\nfür Geschichte der Philosophie</em>, 64: 280–288.</li>\n<li>Kreimendahl, Lothar, 1984, “Bibliographie des Schrifttums zu\nCondillac (1840–1980),” <em>Zeitschrift für\nphilosophische Forchung</em>, 38: 311–321.</li>\n<li>Kreimendahl, Lothar, 1994, <em>Hauptwerke der Philosophie.\nRationalismus und Empirismus</em>, Stuttgart: Reclam.</li>\n<li>Krüger, Lorenz, 1973, “Empirismus und Sensualismus: ein\nExkurs über Condillac,” in Lorenz Krüger (ed.),\n<em>Der Begriff des Empirismus. Erkenntnistheoretische Studien am\nBeispiel John Lockes</em>, Berlin: De Gruyter.</li>\n<li>Koana, Akiko, 1985, “La theorie musicale dans\nl’epistemologie de Condillac,” in Peter McCormick (ed.),\n<em>The Reasons of Art</em>, Ottawa: University of Ottawa.</li>\n<li>Lenoir, Raymond, 1924, <em>Condillac</em>, Paris: F. Alcan.</li>\n<li>LeRoy, Georges, 1937, <em>La psychologie de Condillac</em>, Paris:\nBoivin.</li>\n<li>Malherbe, Michel, 2004, “Introduction” to Condillac,\n<em>Traité des animaux</em>, Paris: J. Vrin.</li>\n<li>McRae, Robert, 1961, <em>The Problem of the Unity of the Sciences:\nBacon to Kant</em>, Toronto: University of Toronto.</li>\n<li>Morgan, Michael J., 1977, <em>Molyneux’s Question. Vision,\nTouch and the Philosophy of Perception</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>O’Neal, John C, 1996, <em>The Authority of Experience:\nSensationist Theory in the French Enlightenment</em>, University Park:\nThe Pennsylvania State University.</li>\n<li>Oppenheimer, Angelika, 2006, “Introduction”, Angelika\nOppenheimer (trans.), <em>Versuch über den Ursprung der\nmenschlichen Erkenntnis</em>, Würzburg: Königshausen &amp;\nNeumann.</li>\n<li>Paganini, Gianni, 1992, “Psychologie et physiologie de\nl’entendement chez Condillac,” <em>Dix-huitieme\nsiecle</em>, 24: 165–178.</li>\n<li>Paganini, Gianni, 1988, “Signes, imagination et\nmémoire: De la psychologie de Wolff à l’Essai de\nCondillac” <em>Revue des Sciences Philosophiques et\nTheologiques</em>, 72: 287–300.</li>\n<li>Paradis, André, 1993, “De Condillac a Pinel ou les\nfondements philosophiques du traitement moral,”\n<em>Philosophiques</em>, 20: 69–112.</li>\n<li>Pastore, Nicholas, 1971, <em>Selective History of Theories of\nVisual Perception: 1650–1950</em>, New York: Oxford.</li>\n<li>Pécharman, Martine, 1999, “Signification et langage\ndans l’Essai de Condillac,” <em>Revue de\nmétaphysique et de morale</em>, (1): 81–103.</li>\n<li>Petacco, Piero, 1971, “Note sul carteggio\nCondillac–Cramer,” <em>Belfagor</em>, 26:\n83–95.</li>\n<li>Robert, Thomas, 2012, “Les deux langages d’action\ncondillaciens: corps, langage, connaissances,” <em>Rivista\nitaliana di filosofia del linguaggio</em>, 5: 150–162.</li>\n<li>Roberts, Lissa, 1992, “Condillac, Lavoiser, and the\nInstrumentalization of Science,” <em>Kennis Methode</em>, 16:\n172–190.</li>\n<li>Rousseau, Nicholas, 1986, <em>Connaissance et langage chez\nCondillac</em>, Geneva: Droz.</li>\n<li>Sgard, Jean (ed.), 1981, <em>Corpus Condillac</em>, Geneva:\nSlatkine.</li>\n<li>Sgard, Jean (ed.), 1982, <em>Condillac et les problèmes du\nlangage</em>, Geneva: Slatkine.</li>\n<li>Wells, G.A., 1987, <em>The Origin of Language: Aspects of the\nDiscussion from Condillac to Wundt</em>, Chicago: Open Court.</li>\n<li>Wojciechowska, Wanda, “Le sensualisme de Condillac,”\n<em>Revue philosophique de la France et de\nl’étranger</em>, 158: 297–320.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Berkeley, George",
            "color",
            "Helmholtz, Hermann von",
            "Hume, David",
            "Locke, John",
            "perception: the problem of",
            "Reid, Thomas"
        ],
        "entry_link": [
            {
                "../berkeley/": "Berkeley, George"
            },
            {
                "../color/": "color"
            },
            {
                "../hermann-helmholtz/": "Helmholtz, Hermann von"
            },
            {
                "../hume/": "Hume, David"
            },
            {
                "../locke/": "Locke, John"
            },
            {
                "../perception-problem/": "perception: the problem of"
            },
            {
                "../reid/": "Reid, Thomas"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=condillac\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/condillac/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=condillac&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/condillac/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=condillac": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/condillac/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=condillac&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/condillac/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.c18.org/\" target=\"other\">c18: International Society for Eighteenth Century Studies.</a>"
        ],
        "listed_links": [
            {
                "http://www.c18.org/": "c18: International Society for Eighteenth Century Studies."
            }
        ]
    }
}