{
    "url": "confucianism-modern",
    "title": "Modern Confucianism",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "David Elstein\n<elsteind@newpaltz.edu>",
        "author_links": [
            {
                "https://hawksites.newpaltz.edu/asianstudies/david-elstein/": "David Elstein"
            },
            {
                "mailto:elsteind%40newpaltz%2eedu": "elsteind@newpaltz.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\n<a href=\"https://hawksites.newpaltz.edu/asianstudies/david-elstein/\" target=\"other\">David Elstein</a>\n&lt;<a href=\"mailto:elsteind%40newpaltz%2eedu\"><em>elsteind<abbr title=\" at \">@</abbr>newpaltz<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Dec 11, 2023"
    ],
    "preamble": "\n\nModern or contemporary Confucianism refers to developments in\nConfucian thought from the early twentieth century to the present. It\nis frequently referred to as New Confucianism, though this term is\nsometimes used more narrowly (for more, see below). It can also create\nsome confusion with the term Neo-Confucianism, which typically means\nSong-Ming Confucianism. All these terms—modern Confucianism,\ncontemporary Confucianism, and New Confucianism—are used to\ntranslate the common Chinese terms for this period, dangdai xin\nruxue 當代新儒學 or xiandai xin\nrujia 現代新儒家. A growing number\nof scholars use “Ruism” instead of\n“Confucianism”, as it is closer to the Chinese terms.\nHowever, Confucianism remains the more familiar English term.\n\nModern Confucianism is often called the third major era of Confucian\nthought (MZCW 9a: 1–17; Tu 1993: 141–59). The first\nclassical period was from around 500 BCE to the first or second\ncentury CE, and the second wave was the Song-Ming period. The defining\ncharacteristics of modern Confucianism are, as the name implies, a\nconcern with modernity and what that should mean for Chinese culture,\nand significant engagement with Western philosophy, primarily European\nEnlightenment and post-Enlightenment thought (Rošker 2016; Tan\n2009; Van den Stock 2016). Modern Confucian thinkers merged historical\nanalysis with novel interpretations and theories for adapting\nConfucian thought to a vastly different world. This entry will sketch\nthe historical background of modern Confucianism and introduce the\nmajor figures included, then go on to examine their views on modernity\nand tradition, knowledge, human nature, and politics.\n",
    "toc": [
        {
            "#BackScop": "1. Background and Scop"
        },
        {
            "#ModeTrad": "2. Modernity and Tradition"
        },
        {
            "#CulturalDifferences": "2.1 Cultural Differences"
        },
        {
            "#ChinHumaCultWestMateCult": "2.2 Chinese Humanistic Culture and Western Materialist Culture"
        },
        {
            "#Know": "3. Knowledge"
        },
        {
            "#MoraKnowCognKnow": "3.1 Moral Knowing and Cognitive Knowing"
        },
        {
            "#KnowThroAffeConn": "3.2 Knowledge through Affective Connection"
        },
        {
            "#RealInteIntuFreeWill": "3.3 The Reality of Intellectual Intuition and Free Will"
        },
        {
            "#HumaNatuPers": "4. Human Nature and the Person"
        },
        {
            "#RejeBuddDarwViewHumaNatu": "4.1 Rejection of Buddhist and Darwinian Views on Human Nature"
        },
        {
            "#TwoTierSelfTranEmpi": "4.2 The Two-Tier Self: Transcendental and Empirical"
        },
        {
            "#TranSelfManiAffeConn": "4.3 The Transcendental Self Manifested in Affective Connection"
        },
        {
            "#SingSelfMode": "4.4 The Single Self Model"
        },
        {
            "#PoliThou": "5. Political Thought"
        },
        {
            "#DemoThroSelfRestMora": "5.1 Democracy through Self-Restriction of Morality"
        },
        {
            "#PoliEquaEquaSubj": "5.2 Political Equality from Equal Subjectivity"
        },
        {
            "#RealRuleVirtDemo": "5.3 Realizing Rule by Virtue in Democracy"
        },
        {
            "#ReceDeve": "6. Recent Developments"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Background and Scope\n\nThe Opium Wars (1839–1842 and 1856–1860), in which China\nsuffered defeat at the hands of Britain and France, marked the\nbeginning of greater interest in Western knowledge, initially to catch\nup to their superior military technology. Toward the latter part of\nthe nineteenth century, Chinese reformers began to look deeper into\nthe scientific and technological advantages of the Western countries,\nbecoming convinced that their political and economic systems laid the\ngroundwork for them. Yan Fu was influential in translating scientific,\neconomic, and philosophical works into Chinese. Interest in Western\nknowledge led to sending students overseas to study, and eventually\nthe establishment of universities in China. The major figures of\ncontemporary Confucianism were part of this educational reform, either\nteaching or studying at universities established on the European\nmodel, which no Confucian philosopher had before. Modern Confucianism\nis characterized in part by this transformation into an academic\nfield.\n\nIn the early twentieth century, Chinese scholars began to publish\ntheir own histories of Chinese philosophy and analyses of Chinese\nculture, which may be considered the initial works of contemporary\nConfucianism. Some of the significant milestones were Liang\nShuming’s Eastern and Western Cultures and Their\nPhilosophies (1921) and Feng Youlan’s History of\nChinese Philosophy (1931 and 1934). Xiong Shili’s New\nTreatise on the Uniqueness of Consciousness (1932) is sometimes\nconsidered the first work of modern Confucianism proper.\n\nThe great interest in Western knowledge in China was often accompanied\nby a degree of disdain for tradition, and there was a camp that felt\nthat all of traditional Chinese culture was an impediment to\nmodernization and should be discarded. Modern Confucianism developed\nin response to this, defending the value of Chinese tradition,\nConfucianism especially, and arguing that it can support modernization\nrather than obstruct it (Van den Stock 2016: 143; Yao 2000:\n268–73). In particular, it can accommodate science and\ndemocracy, which many in China had latched onto as the roots of\nWestern dominance. Modern Confucianism is thus somewhat conservative,\nas it is inherently a defense of aspects of Chinese tradition, but\nalso recognizes the need for adaptation and evolution.\n\nThis entry focuses on a group of scholars who exemplify these features\nand developed the most influential Confucian philosophies of the\ntwentieth century: Xiong Shili 熊十力\n(1885–1968) and his followers Mou Zongsan\n牟宗三 (1909–1995), Tang Junyi\n唐君毅 (1909–1978), and Xu Fuguan\n徐復觀 (1903–1982). The latter three (along\nwith Zhang Junmai) were involved in writing what has become known as\nthe New Confucian Manifesto. Originally drafted by Tang with comments\nfrom the others, this document is retrospectively identified as a\nwatershed in modern Confucian thought (Makeham 2003a: 27–29;\nSolé-Farràs 2014). They are often called disciples of\nXiong (Ng Yu-kwan 2003: 219), but that is a little misleading. Mou and\nTang attended classes with Xiong while students, and Mou does call\nXiong his teacher while also not shying from critical judgment of\nXiong’s philosophy (Mou 1991 [2014: 47–48]). Tang admitted\nhe didn’t understand Xiong very well and chose not to follow him\nclosely (TJCW 26: 2.363; Fröhlich 2017: 36–37). At one\npoint, he said his teacher was Fang Dongmei, not Xiong (Chiu 2016: 5,\n15). Xu met Xiong much later in life during WWII when he was an army\nofficer. None followed Xiong very precisely in their scholarship, as\nXiong himself said (TJCW 26: 2.362). They were inspired by his\ncharacter and sense of cultural mission more than they adhered to his\nideas or methods.\n\nWhat they did share with Xiong is a strong preference for the Wang\nYangming wing of Confucian thought, a focus on intuitive and\nexperiential moral knowledge, and the belief that firm moral values\nare critical for the health of a culture (N. S. Chan 2011:\n25–64). New Confucianism specifically usually refers to this\ngroup and their followers. They identify as defenders of Chinese\nthought and culture, especially as Confucians. They are concerned with\nthe relevance of Chinese thought when the institutions and cultural\ncircumstances that supported it no longer existed. While differing in\nnumerous respects that will become clear throughout the entry, they\nhad enough in common to constitute an identifiable group. Their\nhistorical work on Chinese philosophy, significant as it is, will not\nbe a major focus. Rather, this entry will emphasize their distinct\nprojects relating to the ideas of Confucian and Chinese modernity, and\nwhat they believed Chinese philosophy could contribute to world\nphilosophy.\n\nXiong Shili was born into a poor family in rural Hubei. His parents\ndied when he was young, leaving little opportunity for formal\nschooling. He joined in various revolutionary activities in his\ntwenties, but in the years after the 1911 Revolution, abandoned\npolitical action and turned to study. In 1920 Xiong went to study\nYogacara Buddhism at the China Institute for Inner Learning. Two years\nlater, he was invited by Cai Yuanpei to teach at Beijing University.\nThere he initially taught Yogacara thought, but gradually became\ndissatisfied with aspects of it. He began to make a critique of\ntraditional Yogacara, moving toward a form blended with more Confucian\nelements that he published in 1932 as New Treatise on the\nUniqueness of Consciousness. This was a seminal event and made\nXiong’s reputation. While he published other works, it remains\nwhat he is best known for. Xiong suffered from poor health for much of\nhis life, often taking extended leaves from teaching. Already in his\nsixties at the time of the Communist revolution in 1949, he chose to\nremain in China. He suffered from attacks during the Cultural\nRevolution and died in Shanghai in 1968 at the age of 84.\n\nMou Zongsan was born in rural Shandong province in 1909. In 1927, he\nmoved to Beijing, enrolling at Beijing University. After finishing his\ndegree in philosophy, he moved around China, struggling to support\nhimself and his family in a series of editing and teaching posts. In\n1949, Mou fled to Taiwan, where he began to reflect on how the history\nof China had led to the failure of democracy and subsequent Communist\ntakeover, and articulating a Confucian theory of democracy. He later\nhad to move to Hong Kong, where he produced one of his major works,\nthe three-volume Heart-mind and Human Nature as Reality\n(1968–69). His last philosophical phase was a sustained\nengagement with Kant in which he attempts to show that Kant’s\nphilosophical project was doomed and could only be reconstructed and\nrealized through Chinese philosophy (Mou 1991 [2014: 56]). His goal\nwas to give morality a stable foundation by demonstrating the reality\nof the free autonomous will. In addition to translating Kant’s\nthree Critiques, he wrote Intellectual Intuition and\nChinese Philosophy (1971), Appearances and Things in\nThemselves (1975), and On the Highest Good (1985). These\nmade him widely acclaimed as the greatest Chinese philosopher of the\ntwentieth century. Mou died in Taiwan in 1995.\n\nTang Junyi was born in Sichuan province in 1909. He studied philosophy\ninitially at Beijing University, then National Southeast University\n(subsequently National Central University), graduating in 1932. Like\nMou Zongsan, he moved around frequently during the war with Japan and\nsubsequent Chinese civil war, also choosing to leave in 1949 when he\nwent to Hong Kong, where he remained until the end of his life in\n1978. He became one of the founders of New Asia College, one of the\nfirst Chinese-language institutes of higher education in the British\ncolony. Tang was also extraordinarily prolific, writing extensively on\nthe moral self, Chinese and Western cultures, the history of Chinese\nphilosophy, knowledge, ethics, metaphysics, and political thought. His\nregular themes were articulating the essential connections between\nindividuals and between the mind and world that are the basis for\nexistence, human nature and morality, and knowledge. Among his most\nfrequently cited works are Cultural Consciousness and Moral\nReason (1958), his multi-volume Origins of Chinese\nPhilosophy (1966–1973), and his last book, the two-volume\nLife Existence and the Horizons of Mind (1977).\n\nAlso born into a rural family, in Hubei province (the native place of\nXiong Shili) in 1903, Xu Fuguan followed a very different path than\nhis slightly younger contemporaries Mou and Tang. After finishing\nschool in China, he joined the Nationalist army for a stable income.\nHe went to Japan in 1928 to study economics, but had to return to\nChina after a year due to financial difficulties. He went back to\nJapan in 1930 to attend army officers’ school, leaving in 1931\nafter the Japanese invasion of Manchuria. He spent the next fifteen\nyears as an army officer, rising to the rank of general and for a time\nserving as the personal aide to President Jiang Jieshi (Chiang\nKai-shek), retiring in 1946. He too fled China in 1949 and settled in\nTaiwan to pursue a second career as a teacher. Xu eventually took a\nposition in the Chinese department at the newly established Donghai\n(Tunghai) University, and wrote extensively on Chinese intellectual\nhistory, culture, literature, and art. He is perhaps best known for\nA History of Chinese Theories of Human Nature (1963), its\nsequel Intellectual History of the Two Han Dynasties\n(1975–76), and The Spirit of Chinese Art (1966), along\nwith several collections of essays on intellectual history, culture,\nand politics. He was forced out of his teaching job in 1969 due to\ncriticisms of the government and had to move to Hong Kong. Although he\ndid not reside in Taiwan again, he died there in 1982.\n2. Modernity and Tradition\n\nThe questions of how China should approach modernization and what\nremains valuable in Chinese tradition were crucial ones for modern\nConfucian philosophers. All of them lived through massive upheavals in\ntheir world: the fall of the imperial government, the failure of the\nfirst Republican government, the Japanese invasion, and the Communist\ntakeover of China. The worlds of their formative and later years were\nwildly different. Attacks on traditional culture increased over the\nearly twentieth century, spearheaded by intellectuals such as Chen\nDuxiu (a founder of the Chinese Communist Party) and Hu Shi (Republic\nof China ambassador to the US and an influential figure in Chinese\nliberalism). All of these four figures address to some extent the\nquestion of how to modernize while preserving the valuable features of\nChinese traditions, and further, to justify the positive aspects of\nmodernity through autochthonic values (Marchal 2016: 221; Schmidt\n2011: 275–83). They were also strongly critical of aspects of\nWestern culture, which they tended to identify with modernity.\n\nThe relatively greater success of Japan to modernize while the Chinese\nrevolution failed to produce a stable government or a strong state led\nto serious reflection. Mou, Tang, and Xu all wrote on where things\nwent wrong, and why Chinese culture had failed to develop some of the\nkey features of modernity such as science and democracy. They were\ngreat admirers of these achievements, as well as other aspects of\nmodern life such as specialized academic fields, equality and human\nrights, and greater individual freedoms. At the same time, they did\nnot endorse all of Western modernity. They understandably condemned\nimperialism and colonialism (even as all three resided at times in the\nBritish colony of Hong Kong), and they found modern Western culture\nspiritually and morally lacking. While attempting to understand where\nChinese culture had gone wrong, they also diagnosed what they saw as\nthe ills of Western culture (which they often discussed without much\nregard to the distinctions between different nations or cultures).\n2.1 Cultural Differences\n\nThe common analysis was that Western culture excelled in knowledge,\nanalysis, and the employment of reason, tendencies inherited from\nancient Greek philosophy. Mou Zongsan put it this way: Western culture\nwas defined by the “analytic spirit of the fulfillment of\nreason”, by which he meant the tendency toward abstraction, the\nsearch for underlying concepts and general laws, and separating the\nsubject and object of investigation (MZCW 9b: 194–96). He also\ncalls the Western mode of thought “the constructive presentation\nof reason”, because of its focus on constructing consistent\npractices, institutions, and structures (democratic bodies, scientific\ninstitutes) which are assessed on procedural grounds (following\ndemocratic practice or adhering to the scientific method and standards\nof evidence) rather than directly on whether their results are good\nfor the society (MZCW 10: 54–61). Chinese culture lacked this\nfocus on objectivity and structures, which impeded developing these\nmodern institutions.\n\nXu Fuguan analyzed Chinese and Western cultures in very similar ways.\nAlthough recognizing the vast gulf between ancient Greece and modern\nEurope and America, he saw the Greek focus on knowledge as the key\nfeature of the modern Western mind. Greek investigation took nature as\nits primary object, and in ancient Greek society,\n\n\nthey still felt the most capable, most useful, and most successful\nperson was the “knower”…. For the Greeks, knowledge\nwas beauty and truth. (Xu 1952 [2022: 99])\n\n\nThe major difference between the ancients and moderns was that in\nGreece, the ancients pursued knowledge simply for education, while\n\n\nmoderns use it to pursue power. Francis Bacon said, “Knowledge\nis power”. This one sentence lays bare the spiritual core of\nmodern Western culture. (Xu 1952 [2022: 100])\n\n\nIn China, learning was not fundamentally about knowledge, but for the\npurpose of improving moral practice. Even moral philosophy was not\nabout perfecting moral theory, but realizing morality in one’s\nactions (Xu 1952 [2022: 104]). With its focus on improving moral life,\nknowledge that did not have an obvious relation to moral practice was\nslighted and so the kind of value-neutral, disinterested investigation\nof nature that led to science did not develop in China.\n2.2 Chinese Humanistic Culture and Western Materialist Culture\n\nTang Junyi was the most preoccupied with cultural questions and\ncarried out the most thorough analysis of the cultural differences\nbetween China and the West, though even he was not immune from\nsimplifying “the West” into one. His views on the starting\npoints of Chinese and Greek philosophy are very similar, but he was\nmore thoughtful about what constitutes culture and why an\nunderstanding of culture is important. Culture is what separate humans\nfrom other animals. He writes,\n\n\nCulture is the manifestation or creation of human spiritual\nactivity…. By spiritual activity, I mean activity which is led\nby a self-conscious ideal or purpose, and which self-consciously seeks\nto realize this ideal or purpose. (TJCW 12: 1)\n\n\nAnimals have awareness and perhaps form concepts, but do not\nself-consciously guide their behavior in order to realize particular\nideals in the world: this is uniquely human (TJCW 12: 379). This is\nprecisely what Tang means by spirit and spiritual activity:\n\n\nWhat makes spirit become spirit is that the mind must self-consciously\naffirm or uphold an ideal, and make realizing this ideal and value its\naspiration. (TJCW 12: 3)\n\n\nVarious cultural practices and institutions, which for Tang\nencompasses everything from the family to the economy, art, the\nsciences, and more, are products of action to realize some ideal (Tan\n2009: 548). Chinese culture is the result of attempts to realize\nChinese ideals.\n\nA conclusion he draws from this, that he never makes fully explicit,\nis that we can use this concept as a standard to evaluate at least\ncertain aspects of a culture. A culture may fail to realize its ideals\nor pursue them through inefficient means. It might have conflicting\nideals which cannot be simultaneously realized. More controversially,\nTang believes we can evaluate the ideals themselves according to\nwhether they are reasonable or not. One aspect of this is logical\nconsistency, but it also includes cohering with human nature and the\njudgments of moral intuition (liangzhi 良知)\n(Fröhlich 2017: 143). Ideals that are not reflective of human\nnature will not lead to a good culture even if realized fully. Mou and\nXu would certainly agree. While all found much to admire in modern\nWestern culture, they were also strongly critical of excessive\nindividualism, social alienation, undue focus on satisfying desires,\nand attenuated moral and spiritual life. While others in China at the\ntime favored complete Westernization to sweep away the old culture,\nthey were convinced that this would be a mistake (Rošker\n2016: 110). What they wanted were the aspects of modernity that would\nbetter realize traditional Chinese ideals.\n\nTang Junyi’s examination of Western culture illustrates these\ncriticisms in more detail. Since culture is a human creation, the\nspirit underlying all culture (wenhua 文化) is\nthe humanistic (renwen 人文) spirit (TJCW 11: 1).\nTrue humanism for Tang affirms and respects the existence and value of\nhuman nature, personality, human relationships, culture, and history\n(TJCW 11: 2). Western culture excelled at non-humanism (science and\nmathematics) and trans-humanism (religion), but not humanism (TJCW 11:\n25). Western humanism ended up turning to either God or nature and\nfailed to affirm properly the existence of the virtuous person. It\neither treated people as objects to be investigated like other parts\nof nature (as in science) or as essentially flawed products of\noriginal sin. It was always caught between science and religion (TJCW\n11: 63). It failed to put the person as subject first. The basis of\nhumanism has to be the value of the individual, and the unlimited\nvalue of the individual and basis for the ultimate dignity of\nindividual is the moral mind inherent in everyone (TJCW 11: 185). This\nis precisely the strength of Chinese humanism, and why Chinese culture\nmust be the basis of a healthy humanistic tradition.\n\nTang was critical of monotheistic religions (Christianity in\nparticular) for being overly focused on the transcendent and not\nenough on this world, but the modern world is even worse because it\ndisregards the transcendent aspect of humanity entirely. Tang credited\nChristianity with recognizing the absolute significance and highest\ndignity of the person, which made it the origin of modern Western\nhumanism (TJCW 11: 34–35). However, religion centered on a\ntranscendent god cannot be a stable foundation for humanism.\nChristianity does not affirm the ultimate value of the person. What\nhas ultimate value is God, the creator of the person, not the person,\nand the person can never become God (TJCW 26: 2.201, 265). As a result\nChristianity did not sufficiently affirm the value of the person or\naction in this world, instead seeking transcendence. Still, it\naffirmed the importance of morality and spirituality in a way that was\nlost in the transition to modernity.\n\nModern Western culture has the opposite problem, treating people as\nobjects of study and losing the importance of the subject and\nspiritual aspect of humanity. In Tang’s scheme, a life that\nrecognizes the moral and spiritual qualities of human beings and the\nworld, recognizing that these have a transcendent aspect beyond the\nmaterial, is on a higher level than one that focuses only on the\nmaterial world (Chiu 2016:\n 133).[1]\n And that turn away from the higher level of transcendence toward the\nsensible is precisely what happened during the modern period, in his\nview (Metzger 2005: 248–51; Van den Stock 2021: 233).\nEnlightenment developments in mathematics and science treated the\nworld as an object for study and increasingly such study was\nabstracted in general laws and mathematical formulas. The British\nempirical tradition strongly emphasized that sensory experience is the\nfoundation of all knowledge. Art and literature turned from spiritual\nto worldly themes as well. This focus on the sensible led to\nutilitarianism, which focused on satisfying felt desires, and the\ndevelopment of modern economics which treats people as independent\nindividuals pursuing their personal preferences (TJCW 26:\n2.345–46). Individualism emphasized uniqueness of personality,\nnot common humanity (Metzger 1977: 42–45). This reduced people\nto animals who just follow their desires (TJCW 9: 328–29;\nFröhlich 2017: 83–84). The dignity of being human was lost,\nand that is the fundamental cause of cultural problems. Morality needs\nto be built on spiritual value, not instrumental or utilitarian value\n(Chiu 2023: 4–5; Van den Stock 2016: 253). This is why\npreserving Chinese culture is critical, because it properly recognizes\nthe inner spiritual value of humanity.\n\nThe distaste for utilitarianism and treating desires as central is\ncommon in modern Confucianism, as is the belief that the strength of\nChinese culture is that it recognizes that people have values beyond\ndesire satisfaction. Xu Fuguan said that Western utilitarian\nindividualism has nothing to do with Chinese culture (Xu 1952 [2022:\n133]). The distinctive feature of Chinese culture is valuing the\nheart-mind which is distinct from and above desires (Xu 1953 [2022:\n174–76]). Mou Zongsan similarly distinguished moral values from\ndesires based on biology, which are fundamentally different categories\n(MZCW 22: 5–6). Xiong Shili did not discuss utilitarianism in\nany detail, but like Tang, condemned treating people as objects for\nstudy and making objective analysis the basis for all knowledge (Xiong\n1932 [2015: 181–82]). Chinese culture correctly emphasized\nseeking wisdom in oneself and one’s fundamental nature. This is\nthe wisdom worth having (Xiong 1932 [2015: 298–99]). The common\nthread is that while modern Western culture (“modern” and\n“Western” are virtually synonyms in this discourse)\n(Rošker 2016: 16) has great achievements worth learning from,\nmorally it is completely deficient. They have been aptly called\ncultural nationalists because of their commitment to certain Chinese\ncultural values, inspired by Xiong Shili (N. S. Chan 2011:\n65–94; Fröhlich 2017: 85–86; Xu 1980b). The strength\nof Chinese culture, and why it must be preserved and indeed spread, is\nthat it values the person correctly, as a subject with ultimate value.\nModernity can help realize this value by improving people’s\nmaterial lives, but the humanistic values must be preserved.\n3. Knowledge\n\nModern Confucian epistemic thought typically divides knowledge into\ntwo broad kinds: knowledge of the world or things and knowledge of\nmorality or the person. This is often discussed in terms from\nSong-Ming Confucianism, knowledge from seeing and hearing (jianwen\nzhi zhi 見聞之知) and knowledge of the\nvirtuous nature (dexing zhi zhi\n德性之知). Each of the philosophers examined\nhere approaches this distinction in a slightly different way, while\nsharing the insistence that morality and values cannot be approached\nobjectively and empirically, but are still realities that can be\nknown. They admired the achievements of science in increasing\nknowledge about the world, but held that science could not be the\nroute to understand morality (Rošker 2016: 101). However, this\ndoes not mean there are no moral truths or that human beings cannot\ngrasp them: relativism or skepticism were never seriously entertained.\nIt means that moral knowledge has to be understood in a different way.\nA common philosophical problem is interpreting and defending the\nConfucian way of acquiring moral knowledge, especially the intuitive\napproach of Wang Yangming.\n\nXiong Shili established the basic distinction which Mou, Tang, and Xu\nfollowed. In Xiong’s thought, wisdom (zhi 智) is\nthe cognition of fundamental reality, which he also identifies as the\ntrue mind. Discernment (hui 慧) is cognition of mundane\nthings and what is ordinarily called knowledge. Wisdom is non-dual,\nwithout separation of self and other (Xiong 1932 [2015: 21–22]).\nHe also employed the terms “derivative knowledge” and\n“direct knowledge” (Guo 2021: 100–103). Throughout\nthe New Treatise, Xiong emphasizes the interdependence and\nunity of the mind and cognitive objects, and the importance of wisdom\nover discernment. Knowledge (discernment) is useful for navigating the\nworld of phenomena, but useless for understanding fundamental reality,\nwhich has to be sought within one’s own mind (Xiong 1932 [2015:\n25–26]; Ng Yu-kwan 2003: 231; Tan 2009: 544). Treating it as an\nobject will get nowhere:\n\n\nThe absolute [quality] of principle does not belong to the realm of\nthe conceivable. It can be known only through internal\nself-realization. (Xiong 1932 [2015: 159])\n\n\nThis focus on the internal and knowing in a non-conceptual manner was\npicked up by each of his followers.\n3.1 Moral Knowing and Cognitive Knowing\n\nXu Fuguan called this direct awareness embodied recognition\n(tiren 體認), a term employed by Xiong that goes\nback to Wang Yangming. It is a direct, irrefutable feeling, which Xu\nidentifies with the basic moral feelings described by Mengzi. It has\nnothing to do with science:\n\n\nThe development of contemporary science is unable to deny the Chinese\nculture of the heart-mind. This is because the question is not whether\nthis function is located in the\n heart[2]\n or the brain, but rather whether the function described in Chinese\nculture exists in the physiology of humanity. That is, whether there\nare the functions described by Mengzi: the feelings of alarm and\ncompassion, shame and dislike, approval and disapproval, declining and\nyielding, and so on. If this kind of function does not exist in life,\nthen there is nothing more to say. If, on the other hand, we can have\nembodied recognition of the feelings of alarm and compassion, shame\nand dislike, approval and disapproval, declining and yielding, then\nthis proves that there is some part of our body that possesses\nthis function.\n\nIt is just like how some people believe contemporary psychology cannot\nconfirm the activity of the soul described in literature. But if the\nactivity of the soul cannot be confirmed by doing psychology\nexperiments, then this is a problem with psychology\nitself. The key is whether there is this activity of the soul in\npeople’s lives. (Xu 1953 [2022: 168])\n\n\nThe reality of the experienced feeling is enough for Xu. If science\ncannot confirm it or explain it, that is a problem with science, not\nevidence that the feelings are not real.\n\nXu distinguishes the moral nature and the cognitive nature of the\nheart-mind. The moral nature (dexing 德性) is\nconstituted by the four basic moral responses described by Mengzi. The\ncognitive nature (zhixing 知性) of the heart-mind\nis important, but it belongs to a fundamentally distinct category and\ncannot generate moral responses. The cognitive nature generates\nknowledge of the external world, but accumulating facts cannot by\nitself elicit a moral response (Xu 1963 [1990, 240]). While Xu remains\na realist about value, he agrees that values are a different sort of\nthing than facts about the world. Which is not to say that knowledge\nis not important or should be neglected. Knowledge plays two critical\nroles in Xu’s thought. The first is to “clarify the object\nof morality”; the second is to “provide rational means for\n[realizing] morality” (Xu 1963 [1990: 287]). The second role is\nthe function of instrumental reason. Greater knowledge of the world\nmeans a better chance of selecting the right means that will lead to\nsuccessful action and not violating one’s good intentions\ninadvertently. The first function is a little murkier as Xu did not\ngive a clear example of what he meant. An illustration might be\nMengzi 1A7, where King Xuan is humane to the ox that he saves\nfrom being sacrificed, but not to his people. The king’s\nhumaneness is misplaced: he is concerned about the ox’s\nsuffering but not about his people’s. It is not that he used the\nwrong means, but that he is mistaken about what merits his compassion.\nKnowledge can rectify this type of misconception. Knowledge is still\ninstrumental, as what has intrinsic value is moral practice, not\nknowledge in itself.\n3.2 Knowledge through Affective Connection\n\nTang Junyi’s views on knowledge and cognition are complex. His\nlast book, Life Existence and the Horizons of Mind, is an\nattempt to classify all possible ways of cognizing the world into nine\nbroad horizons (on “horizon” see Wu 2002). A full\nexamination of these is not possible here (see Van den Stock 2021),\nbut we can identify some key themes. Like Xiong and Xu, Tang\ndistinguished different kinds of knowledge. Moral knowledge, knowledge\nof the virtuous nature in Confucianism, is self-awareness of the\nhumane (ren 仁) heart-mind and nature, which must\nspontaneously come from oneself. Empirical knowledge, knowledge from\nseeing and hearing, is knowledge of the phenomenal world learned from\nexternal study. This empirical knowledge is useful, and its\ndevelopment is where Western culture excelled, but it must be\ncontrolled by moral knowledge, not the other way around.\n\n\nThis knowledge of the virtuous nature, which illuminates the internal,\nis knowledge of persons’ existence in themselves. People\nabsolutely cannot have knowledge of the virtuous nature through\nknowledge of society or nature, which illuminates the external. (TJCW\n11: 65–66)\n\n\nIn his schema of nine horizons, science for the most part is placed in\nthe third horizon of functioning in order, which cognizes cause-effect\nrelations (TJCW 25: 1.29). Broadly construed, it could also include\nlogic and mathematics, which Tang places in the fifth horizon of\ndetached observation because they focus on pure connections of thought\n(TJCW 25: 1.30–31). Both are lower than the horizon of moral\npractice (the sixth). Detached observation is about observing and\nunderstanding, not changing things, and remaining here is morally\nrepugnant for Tang: we must go onto the horizon of morality which\nattempts to realize ideals in the world to improve it (TJCW 25:\n1.445–46). This is another way of expressing that morality is on\na higher level than scientific knowledge.\n\nThe concept of affective connection (gantong\n感通) occupies a central role in Tang’s thought. The\nChinese term combines the words for “to stimulate or\naffect” (gan) and “to connect or be\nconnected”, with the further sense of lacking impediment or\nobstruction (tong). “Affective” must be\nunderstood in this sense: not necessarily related to feelings, but\nmore simply one thing affecting another. Tang defines it thusly:\n\n\nThis affective connection itself is [the heart-mind] directly meeting\nwith the objects of a cognitive horizon, and directly being aware of\nand observing them. (TJCW 26: 2.235)\n\n\nCritically, this is connection to a wider objective reality, not\nmerely a subjective awareness (Metzger 1977: 35). Affective connection\nis, among other things, the essential capacity of the heart-mind to\ncognize and interact with any other existent. One implication Tang\nwants to draw from this is that that mind and world are essentially\nconnected and interdependent (TJCW 25: 1.3–4; Tan 2009: 547).\nHuman life is constituted by connecting with and cognizing other\nexistents, including other people (further discussed in the section on\nhuman nature). Through cognizing other objects, we also become aware\nof the subject, and eventually to what Tang calls the\ntrans-subjective/objective horizons (the last three). Understanding\nthe subject cannot be done objectively: it must be approached through\npersonal experience and realization of the lived existence of the\nsubject (TJCW 26: 2.318).\n3.3 The Reality of Intellectual Intuition and Free Will\n\nMou Zongsan held similar views on the limits of science (MZCW 22: 50),\nbut as that topic was covered already, here the focus is Mou’s\njustification of knowledge of the free will. His later philosophy\nfocused on demonstrating the reality of autonomy and morality, which\nhe felt Kant failed to do (Schmidt 2011). For Kant, because knowledge\nis limited to the world of appearances, free will remains something\nbeyond the bounds of human knowledge. Freedom remains a postulate, or\na mere idea, but can never be known (Kant 1785 [1997: 63], 4:459). Mou\ncriticized Kant for precisely this point and argued that Chinese\nphilosophy could provide what Kant could not: knowledge of free\nwill.\n\nAccording to Mou, Confucian philosophers also wanted to establish the\na priori conditions of morality. As in Kant, this a priori condition\nis freedom or autonomy (MZCW 5: 1.11; Lee 2017: 15). Mou concedes that\ntheoretical knowledge of the free will is not possible; however, he\ncriticizes Kant for not understanding that the truth of the free will\nhas to be grasped and known practically rather than theoretically.\nThis is what Confucianism achieved, and how it confirms that the free,\nautonomous will is a reality and not merely a postulate: it is\nrealized and verified through moral activity in the world.\n\nAutonomy for Mou requires independence from interests, inclinations,\nand external control. Morality has to be founded on a principle that\nthe will gives to itself. A will that is decided or controlled by\nanything external is not a free, autonomous will (MZCW 5: 1.136). Free\nwill cannot be an effect brought about by something else; it can only\nbe a cause (MZCW 20: 247). In addition, he writes,\n\n\nIf it requires a lower interest from something external to stimulate\nit, then it is not the fundamental heart-mind; it is not the true,\nautonomous will that gives the law to itself. (MZCW 5: 1.171)\n\n\nMorality requires the will to determine itself, free from the\ninfluence, control, or stimulation of an external object.\n\nThis describes autonomy, but is not an argument for it; for that, we\nhave to look elsewhere. One way Mou argues for the reality of autonomy\ncan be sketched out like this:\n\nAutonomy is necessary for morality to be possible.\nMorality is a reality\nTherefore, autonomy is a reality\n\n\nMou turns around Kant’s argument that because we cannot know\nthat we are free, we cannot know that morality is real. We know that\nmorality is real, and therefore we know that autonomy is real (see\nFung 2021: 617–18; Schmidt 2011: 265). After discussing why the\nfundamental heart-mind has to be unlimited in order for morality to be\npossible, Mou gives a theoretical account of intellectual intuition\n(non-sensible intuition of the autonomous self) and says,\n\n\nIntellectual intuition must not only be affirmed theoretically, it\nmust emerge in reality…. When we speak of the fundamental\nheart-mind, it is as a concrete presence, such as the feelings of\nalarm and compassion or shame and disgust that emerge at any time as\nMengzi spoke about. When it sees one’s father it naturally knows\nfiliality; when it sees one’s older brother it naturally knows\nbrotherly respect (these are not biological instincts, but the\nfundamental heart-mind). When it should feel alarm and compassion, it\nfeels alarm and compassion. When it should feel shame and dislike, it\nfeels shame and dislike, and so on. (MZCW 20: 249)\n\n\nThese moral responses are real presences, and they require the\nfundamental heart-mind (one of the terms Mou uses for self as a thing\nin itself, not appearance) to be possible. Kant only approached\nmorality theoretically, but Chinese philosophy makes practical\nknowledge of morality possible (Billioud 2012: 79–81; Tan 2009:\n559). Morality is a fact because we feel it: the moral responses are a\ndefinite presence which cannot be denied.\n\nAs knowledge through understanding requires sensible intuition,\nintellectual knowledge requires intellectual intuition: intuition of\nthings in themselves and not mere appearances. Kant attributed\nintellectual intuition only to God, denying that humans had that\ncapacity (Bunnin 2008; N. S. Chan 2011: 142). For Mou, humans have\nintellectual intuition of a limited sort, and that is how knowledge of\nthe true self (also called fundamental heart-mind or nature in itself,\nnot different from the creative power of the universe) is possible\n(Billioud 2012: 75–76). Intellectual intuition is\nnon-discursive, direct knowledge of the self unmediated by the\ncategories of the understanding (MZCW 10: 204). Thus, the content of\nthe intuition itself cannot be put into words, but he does say it is\nintuition of the fundamental heart-mind and humaneness in itself (MZCW\n10: 249–50). A moment of awareness of what is morally right is\nan instance of intellectual intuition. It is in the process of moral\nresponse that the fundamental mind intuits itself, and the mind\nbecomes aware of its own infinite moral responsiveness.\n\nMou here brings together these themes: distinguishing theoretical and\npractical knowledge, and insisting that practical (moral) knowledge\nhas to be approached in an experiential, intuitive way that focuses on\nuncovering the true self. He calls these intensional truths, in that\nthey are subject-dependent, unlike extensional truths (MZCW 29:\n19–27; Rošker 2016: 118). This approach of course raises\nquestions. One problem with this intuitive method is that it can\nhardly avoid reflecting culturally learned responses and may take them\nto be a priori and necessary, believing them to be representative of\nhuman nature as a whole. Tang Junyi, for example, insists,\n\n\nFiliality should be constructed on moral reason, and this means that\nit has absolute significance. This is to say that I should be filial\neven if my parents do not love me. (TJCW 12: 43)\n\n\nPeople from other cultures might dispute that strongly. Mou also does\nnot explain how to distinguish true intellectual intuition from what\nmay feel like intellectual intuition, but not intuit its object\ncorrectly (Fung 2021: 616). Furthermore, his argument relies on\naccepting the Kantian view of morality that requires autonomy. If one\ndoes not accept that premise, this argument does not persuade.\n4. Human Nature and the Person\n\nModern Confucianism has been strongly influenced by Western\nphilosophy. It is therefore not surprising that many modern Confucian\nphilosophical problems can fit tidily in the typical Western\nphilosophy categories. Their concept of the person, however, does not.\nTheir discourses on the person range across metaphysics, philosophy of\nmind, epistemology, and metaethics. The previous section demonstrated\nhow their views on knowledge center around defending knowledge of\nvalue. Here we get deeper into questions of what defines human beings,\nwhat reason means, the source of value, how we know ethical action is\npossible, and more.\n\nBefore looking at the modern Confucians themselves, a few words about\nwhy this issue is so central would be useful. The question of human\nnature has a long history in Chinese philosophy, and as self-conscious\ninheritors of this tradition, modern Confucians wanted to relate their\nviews to major figures of the past, especially the classical thinkers\nKongzi (Confucius) and Mengzi (Mencius), and the Ming Confucian Wang\nYangming. They demoted Zhu Xi, the most influential Song Confucian,\nand had no tolerance for the evidential learning scholarship of the\nQing period. The true Confucian tradition (in their minds) follows\nMengzi in affirming that human nature is good, and Wang Yangming in\nasserting that moral values and motivation must be uncovered in\noneself, not in phenomena. This wing of the Confucian tradition\nasserted that people have not just a potential but tendency toward\nmoral action, and this tendency is definitive of being human. Anyone\ncan become a sage, the paragon of moral excellence. It is what being\nfully human means. This is how these Confucians answer the questions\nof why and how to be moral: it is what is natural for us, and we have\nthe knowledge and motivations in the mind already.\n\nIn the modern period, Confucians had two main concerns. One was the\nexplicit attacks on Chinese culture as well as the general upheaval\nand sense of value instability brought about by the events of the\ntime. What had been a reasonably stable (if inequitable) political and\nsocial structure had collapsed without a clear replacement. Many\npeople were fascinated by novelty and turned away from traditional\nvalues. The other, not unrelated, concern was the reductionism and\nlack of true moral value that they found in Western culture. Xiong\nShili never left China, but Mou, Tang, and Xu all spent time in Hong\nKong and traveled to Europe and the US as well. They were not pleased\nwith what they found. Utilitarianism and related reductionist\napproaches that did not distinguish moral value from happiness, desire\nsatisfaction, survival, or any other non-moral value were entirely\nunacceptable to them. Tang Junyi wrote,\n\n\nThe most important point for our affirming the value of a kind of\ncultural activity is that it directly reveals the value of the human\nspirit itself, and not its instrumental or utilitarian value….\nWe must strictly adhere to the standpoint of the Chinese cultural\ntradition which emphasizes the distinction between human beings and\nanimals and between right and utility, and apply this in cultural\nchoices. Therefore, for decades we have needed to eliminate by their\nroots utilitarianism, materialism, and any form of naturalism that\ndoes not distinguish between human beings and animals. (TJCW 9:\n328)\n\n\nThese naturalistic approaches are not only philosophically misguided,\nbut extremely harmful to moral practice as well.\n4.1 Rejection of Buddhist and Darwinian Views on Human Nature\n\nXiong Shili focused on reality and phenomena, but he does have a few\nremarks on human nature that leave some important clues. One reason\nXiong began to criticize orthodox Yogacara is that he was dissatisfied\nwith how they categorized cognitions, but he also wanted to assert the\nessential goodness of human nature. One of his criticisms of Buddhists\nis that they treated evil as an innate part of human nature, which\nwould imply that it cannot (and perhaps should not) be eradicated.\n\n\n[The Yogacara monk Dharmapāla] presumed that of the various\nproductive powers, there are those that are contaminated and those\nthat are uncontaminated, and hence he used “productive\npower” to refer to both. This is to hold living beings in\ndisdain, and resolutely to uphold [the existence of] the root of evil.\nHis stupidity and boorishness were great indeed. He agreed that there\nhas always been contaminated productive power—that the root of\nevil in humans is innately endowed. (Xiong 1932 [2015: 141])\n\n\nThe correct view is that human nature is undefiled. Habituated\ntendencies can be good or bad, accord with human nature or not, but\nthey are adventitious and do not affect the pure inherent nature\n(Xiong 1932 [2015: 144–46]). In short, evil is not part of human\nnature and the human task is to remove defiled habituated tendencies\nand return to that fundamental nature (Major 2021: 941–42).\nXiong returned to the classic Song-Ming Confucian position on human\nnature.\n\nXiong simultaneously rejected Darwinism, partly on the grounds\ndescribed by Tang Junyi above, failing to distinguish between human\nbeings and animals, and partly because the picture of organisms\ncompeting for individual survival did not comport with his worldview.\nEvolutionary ideas had been introduced into China with Yan Fu’s\nheavily edited translation of Thomas Henry Huxley (1898), which could\nbe better described as a reworking of the text than a translation as\nYan freely rearranged it and added much of his own commentary (Sun\n2022). The potential consequences of Darwin’s view of survival\nof the fittest are described precisely by a hypothetical interlocutor\nin Xiong’s text:\n\n\nThe myriad life forms are fond of antipathy and like to kill. World\nhistory reads largely as a book of mutual annihilation….\nSomeone asked, “It is certain that antipathy is something that\nappears late [among sentient beings.] This can be verified by\nDarwin’s theory of the survival of the fittest, according to\nwhich it should be that antipathy also arises from the need to\nsurvive. There is no need to deem it to be an affliction”. I\nreplied, “The facts discovered by those who endorse the theory\nof mutualism are clearly at odds with Darwin’s thesis….\n[Cheng] Yichuan also said: ‘It is only by closely helping one\nanother that all living things between heaven and earth are able to\nlive.’ Everything he said was verified. It is thus understood\nthat living existence requires close help and not competition”.\n(Xiong 1932 [2015: 259–60])\n\n\nThe moral consequences of evolution (as he understood them) were\nunacceptable to Xiong. Although he of course knew the history of\nviolence between human beings, this is not how life has to be or\nshould be. Treating hate and competition as part of human nature\nimplies accepting it. That would fundamentally contradict\nXiong’s picture not just of human nature, but of how the world\nworks. What Xiong did not do was expand much on what human nature is,\nor, aside from reliance on personal experience (Xiong 1932 [2015:\n204–5]; Major 2021: 947–48), how we know it and realize\nit. Mou, Tang, and Xu all developed theories about this.\n4.2 The Two-Tier Self: Transcendental and Empirical\n\nThe broad picture is shared by all three. As elucidated above, all\naccepted that knowledge of human nature and moral values has to be\nsubjective and intuitive, not empirical. Following the Mengzi-Wang\nYangming strand of Confucianism, the goodness of human nature consists\nof a set of basic moral responses which everyone feels and, when not\nobstructed by selfishness, do not err. The questions of what the\ngoodness of human nature means, how we know it, and how we can realize\nit in life are fundamental to most of Mou Zongsan’s and Tang\nJunyi’s philosophical work, so their answers require some\ndetail. These will be followed by some examination of Xu\nFuguan’s less metaphysical approach.\n\nThe issue of desires had loomed large in Buddhist and Neo-Confucian\nthought, and one task for Mou and Tang was to distinguish\nself-centered desires from the moral responses. The feeling of wanting\nto eat a favorite food and the feeling of wanting to save a stranger\nfrom harm are not the same category of thing. The challenge for them\nis that both the former and latter seem to be part of human nature, if\nthat means universal, unlearned feelings and behaviors. If anything,\nthe self-centered desires seem more universal. And yet, for Tang,\nfollowing Mengzi, it is important to distinguish human beings and\nanimals. Mou put it slightly differently: “People have an animal\nnature and a human nature” (MZCW 9a: 71). The point is much the\nsame: being human means controlling and overcoming desires. What they\nwant to do is to demonstrate that everyone has the category of moral\nresponses, even if they rarely act on them. That is human nature\nproperly understood.\n\nMou and Tang both address this challenge by appealing to two levels of\nthe person: an empirical self which experiences desires, and a true or\ntranscendent self constituted by the moral responses. Since that true\nself belongs to a higher ontological level, it represents what the\nperson truly is, and that is what we should follow. The model here is\nrecognizably Kantian, distinguishing moral responses which proceed\nfrom free will and the true self from inclinations or desires which\nare part of appearances. It is not surprising that Kant made such an\nimpact on modern Confucian philosophers, Mou and Tang especially. The\nexperience of moral responses is also critical for both of them, as\nthe reality of the true self has to be grasped practically rather than\ntheoretically (Wong 2021).\n\nWe saw earlier how Mou argued that intellectual intuition is a reality\nfor human beings and so knowledge of the free will is possible and\nmorality is real. Mou develops this view into what he calls moral\nmetaphysics (in contrast to Kant’s metaphysics of morals),\nbecause morality is the basis for metaphysical truths, namely the\nreality of the autonomous self (Billioud 2012: 49–50; Lee 2013:\n24). The true self for Mou cannot be an appearance but must be a thing\nin itself, belonging to the intelligible world. Only then is free will\npossible. If it were part of the world of appearances, it would be\nsubject to causal laws and be determined or affected by things\nexternal to it. Then morality would not exist. The source of\nmorality—which Mou calls free will, the fundamental mind\n(benxin 本心), or human nature as reality\n(xingti 性體)—has to be absolute and\nunconditional, not an appearance (MZCW 20: 245–47). The primary\ndifference between Mou and Kant concerns the nature and role of\nfeelings (Lee 1990: 37–42). For Kant, feelings were appearances\nand could not be the basis of morality. For Mou, ordinary feelings\n(such as desires) belong to the world of appearances and are\nheteronomous motivations. But there is another category of moral\nfeelings which are different.\n\nMou claims that there is another type of feeling entirely which\nbelongs to (or is) the true self, the autonomous person as a thing in\nitself. These are rational feelings, not sensible (MZCW 22: 14). He\ncreated several terms for these feelings, such as “moral\nfeelings of illuminating awareness” (mingjue jueqing\n明覺覺情) or “ontological moral\nfeelings” (bentilun de jueqing\n本體論的覺情) (Billioud 2012:\n170–76; Lee 2021: 259–60). The moral responses identified\nby Mengzi belong to this category. Mengzi illustrated these feelings\nby considering the situation of a person seeing a child about to fall\ninto a well. In such a case, he claimed, anyone would have a feeling\nof alarm and compassion toward the child (Mengzi 2A6). For\nMou, this sort of situation is the way we become aware of the true\nself through the moral reaction, a process that he calls reflective\nverification (one aspect of intellectual intuition [MZCW 20:\n252]):\n\n\nThis awakening due to astonishment is like the red sun rising out of\nbottom of the sea; it is not at all sensible. Therefore, the\nreflective verification in question is the illuminating awareness of\nintellect itself reflecting its own light back onto itself and not a\nphenomenal mind different from itself sensibly and passively coming to\ncognize it, which could never reach it in itself. So this reflective\nunderstanding is purely intellectual and not the passivity of\nsensibility. (MZCW 21: 105)\n\n\nOne key point here is that this reflective verification has both\nepistemic and moral significance. It is a way we come to realize the\ntrue self, in both the senses of knowing it and making it real and\nactive (Billioud 2012: 198–207; Shi & Lin 2015: 553). When\nwe have such a response, we know the true self (the fundamental mind,\nnature in itself) and are prompted to act on it. Because the\nmoral responses come from the true self as a thing in itself and are\nnot part of the sensible world, they are not heteronomous and\nautonomous morality is possible. The important moral distinction for\nMou is not between reason and inclination, as in Kant, but between two\ndifferent kinds of feeling: intellectual or ontological feeling (from\nthe true self) and sensible feeling (from the empirical self).\n\nGranting Mou’s claim that the moral feelings belong to the true\nself and are categorically different from empirical feelings, what he\ndoes not explain is how an agent can reliably discern which is which.\nMorality is not a matter of acting on a rational, universalizable\nprinciple, which an agent could deliberate about, but acting on the\nprompting of the fundamental mind. It is not a biological instinct,\nbut subjectively can feel similar as something the agent is compelled\nto do in a non-rational way (Shi & Lin 2015: 547–48). From\nthe agent’s internal perspective then, it may be difficult or\nimpossible to tell what is a moral response belonging to the\nfundamental mind and what is a desire or instinct from the empirical\nself (Suter 2018: 229). As there is no further objective criterion to\njudge what is right or wrong, whether Mou’s moral metaphysics\ncan adequately guide action is a concern (Shi & Lin 2015: 559).\nThis is not to deny that the true self may be a reality in the way\nthat he describes, but to raise the question of whether we can\nreliably tell when we’re accessing the fundamental mind and when\nwe’re not.\n4.3 The Transcendental Self Manifested in Affective Connection\n\nAlthough he is not typically considered a Kantian, Tang Junyi also\ndistinguishes two selves. There is a true self, which he usually calls\nthe transcendental self (chaoyue ziwo\n超越自我) (or transcendent; Tang did not\nconsistently distinguish “transcendent” and\n“transcendental”, using chaoyue 超越\nfor both) or moral self (daode ziwo\n道德自我). Then there is an empirical self\n(jingyan ziwo 經驗自我 or xianshi\nziwo 現實自我) (Pong 2008; Rošker\n2016: 94). Human nature is to be identified with the transcendental\nself, not the empirical self of desires (S. Y. Chan 2002:\n306–7). However, his route to demonstrating the reality of the\nmoral self is very different.\n\nThe overarching theme of Tang’s philosophy is interdependence in\nthe form of affective connection. The primary way he supports the\nexistence of the transcendental self is the reality of affective\nconnection with other existents, especially people. It is the basis of\nmorality for Tang (Chiu 2016: 155; Van den Stock 2016: 250). The\nempirical self of desires is self-centered: it attempts to use the\nworld to fulfill its desires. Insofar as our actions recognize the\nequal subjectivity of other people, we transcend the narrow self and\nrealize the transcendental self (TJCW 9: 38). This is not a universal\nself (Metzger 2005: 220). Tang was clear that he departed from Fichte\nin not merging people into a great self (TJCW 25: 1.506).\nPeople have desires, but they have other sorts of feelings and\nmotives, what Tang calls the feelings from human nature\n(xingqing\n 性情):[3]\n\n\nPeople truly have a kind of feeling from human nature that surpasses\nindividual life and finds completion in affective connection with\npeople and things. (TJCW 9: 97)\n\n\nThis is what the goodness of human nature means.\n\nOne of the main ways that Tang illustrates the reality of the\ntranscendental self that connects to others is through pointing out\nhow human practice presupposes the reality and value of other people\nas subjects. Cultural activities—including economy, politics,\nscience, philosophy, art, and much more—are all ways in which,\nusually unconsciously, the moral self manifests through affective\nconnection which treats other people as subjects (Rošker 2016:\n156; Van den Stock 2016: 339). Put somewhat differently, culture is\nabout establishing the world of moral personality, which is\nKant’s kingdom of ends (TJCW 12: Preface, 13). Here he was\ninspired by Fichte and British idealism (Metzger 2005: 215–16;\nTseng 2019: 838). Culture is an attempt to realize certain ideals in\nthe world in a conscious way, and Tang asserts that anyone who\nconsciously holds and tries to realize an ideal reveals their\ntranscendental self. Having an ideal involves a notion of how one\nwants oneself and the world to be, and assumes that one has the\nfreedom and ability to try to bring this about. It means transcending\nexisting reality and thinking about and working toward how to make it\nbetter, and this reveals the transcendental self mastering the\nempirical self (TJCW 12: 3–9). As Tang’s method for\ndemonstrating this is the same for all cultural activities, one\nexample will suffice to illustrate it, the example of science.\n\nThe usual belief in modern Confucianism is that science is\ninstrumentally valuable, because scientific discoveries can lead to\nimprovements in people’s lives (Xu 1952 [2022: 117–23]).\nTang recognizes that science can be a moral good in this instrumental\nway, but insists that the practice of science itself manifests the\ntranscendental self. The possibility of searching for truth cannot be\nseparated from moral reason and embodies moral value. The common view\nis that science aims at truth, which is distinct from goodness, but\nfor him science is not value-neutral (TJCW 12: 223–24).\nScientific understanding involves grasping common properties or\npatterns in the world through formation of a concept connecting past\nand future events, which follow the same principle. To search for\nthese principles requires transcending one’s natural instincts\nand desires for the sake of abstract truth which has no immediate\nrelation to one’s desires. This ability to transcend these\nmanifests moral goodness and the possibility of reason controlling\ndesires (TJCW 12: 226–27). Furthermore, scientific laws are\nuniversal and objective. The possibility of shared understanding of\nthem means minds have similar cognitive abilities. And as a matter of\npractice, scientists seek to have their findings published,\nrecognized, and understood by other people. This is an implicit\nacknowledgment that being understood by other people is important, and\nthat people have independent minds that can reach similar\nunderstanding (TJCW 12: 233–36). This shared understanding is a\nform of affective connection.\n\nAt this juncture we may ask what Tang has demonstrated: does this\naffective connection he describes constitute knowledge of\nother people’s subjectivity and shared moral reason? Or is it an\nassumption of cultural practices such as science, philosophy, and art,\nbut remains short of knowledge? This is a complicated question on\nwhich Tang equivocated in his writings. In one related discussion,\nTang examines the Confucian belief in the universal moral mind, and\nsays that through reason one can universalize the humane nature and\nheart-mind and know that all people have them. Immediately following\nhe calls this belief a kind of faith and says,\n\n\nThis faith that the humane nature and heart-mind must exist can\nlikewise not be proved positively by the use of pure reason and\nargument. At most, we can use a negative argument that it is\nimpossible to assert that it does not exist, and so show that it must\nexist. That it exists is revealed negatively in the fact that people\nfeel uneasy about evil and suffering. If you feel uneasy about yours\nand others’ evil and suffering, this is negative proof that you\nhave the humane nature and heart-mind of perfect goodness that [wants\nto] remove evil and suffering…. If you say that you have no\nuneasiness toward evil and suffering at all, then I do not believe\nyou. How do I know that you feel uneasy? Because I do…. Even if\nyou do not reveal this humane nature and heart-mind for now and\nyourself feel you don’t have it, I still affirm that you must\nhave it. The reason is because in the end, I cannot accept that you do\nnot have it, so I affirm that you do: there is no other reason. (TJCW\n11: 247–49)\n\n\nThis evidently falls short of knowledge.\n\nEven in his last work, it is difficult to pin down precisely what Tang\nthinks, whether affective connection with other minds is a known\nreality or whether it is a matter of faith or an assumption to make\nsense of our practices in life. Perhaps his final word on the subject\nis in the postscript to Life Existence and the Horizons of\nMind, an extended discussion on faith, meaning, and the role of\nphilosophy. People must have ideals, and he says the objective\nexistence of a universal human way and universal human nature is a\nconviction based on the possibility of shared rational ideas (TJCW 26:\n2.370). Ultimately, he seems to conclude that we need this sort of\nconviction for life to have meaning and to support moral practice.\n\n\nA belief in the metaphysical origin of the light of perfect goodness\nas an absolute truth then makes possible the action of making the\nirrational into the rational. (TJCW 26: 2.381)\n\n\nHere Tang’s deep interest in religion bears brief mention (for\nmore see Tang 1955 [1981]; Fröhlich 2017: chap. 5; W. Ng 1998;\nVan den Stock 2021: 226–35). Religion is critical for Tang,\nmeaning belief in an absolute spiritual reality (TJCW 9: 354). The\nfundamental demand of religion is to affirm a transcendent absolute\nthat can preserve all values. In Confucianism, this is faith in the\nfundamental mind and nature themselves (TJCW 11: 319–20, 335).\nIt might be best to conclude that for Tang, whether this was knowledge\nor not in a theoretical way was beside the point (Chiu 2016:\n157–58; 2023: 296). It is a postulate, in Kant’s sense: an\nidea we must apply to ourselves (Schmidt 2011: 291 n31). We must have\nfaith in the possibility of goodness in ourselves and others to go on\nliving.\n4.4 The Single Self Model\n\nXu Fuguan took a simpler approach to the question of knowing human\nnature and the source of values. He felt that the model of Western\nmetaphysics should not be applied to Chinese philosophy, so he\nrejected the metaphysical orientation of Xiong, Mou, and Tang (Huang\n2018 [2019: 56–57]; Ni 2002: 291). He did not distinguish two\nlevels of self as Tang and Mou did. He refers to morality as\nsupra-empirical (chao jingyan 超經驗) (Xu\n1963 [1990: 86]), but not transcendental or metaphysical. He agreed\nthat moral facts cannot be uncovered by investigation of the external\nworld. However, Xu denies that Confucian is a form of idealism, or\nthat the heart-mind is something beyond the physiology of the body (Ni\n2002: 286–87). Xu refers to his view as “embodied\nlearning” (xing er zhong xue\n形而中學) rather than metaphysics (xing er\nshang xue 形而上學) (Xu 1953 [2022:\n168]). He agrees with Tang and Mou that we have inherent moral\nresponses, but they are not indications of a transcendental self. He\ndoes not seem very concerned with pinning down precisely where the\nmoral responses come from; the reality of experiencing them is\nenough.\n\nAt the same time, Xu insists that morality cannot be known through\ninvestigation of world: science cannot confirm or disprove morality.\nAlthough he rarely mentioned Kant, he did apparently accept that\nmorality could not be empirical if it were to be universal (Xu 1963\n[1990: 86]). What defines human beings is that they can control their\ndesires and they have the capacity for self-mastery (zizhu\n自主) (Xu 1963 [1990: 161, 165–66]). He\ndistinguishes two categories of motives. There are the physiological\ndesires associated with the body, and there are the responses of the\nheart-mind (Elstein 2021a: 205). In Mengzi’s paradigm case of\nseeing a child about to fall into a well, the feeling of alarm and\ncompassion is not a response of the desires, but the direct\nmanifesting of the heart-mind (Xu 1963 [1990: 172]). Unfortunately, he\nnever explained how we discern the difference between desires and the\nmoral responses of the heart-mind, when it seems these can be easily\nconfused.\n\nPerhaps the most reliable guide is to look at what we prefer from\nothers. Xu believes, following Mengzi, that people have a universal\npreference for virtue. But when we look at ourselves, we all too\nreadily rationalize desires as moral responses or make excuses for our\nconduct. Xu instead looks at what people prefer in others, especially\nin rulers. This is what makes the Confucian ideal of rule by virtue\npossible: the fact that people respond to the virtue of rulers and\nprefer humane rule (Xu 1966 [2022: 244–45]). The suggestion is\nthat we can avoid the complications of self-interest better by looking\nnot at what people do or what they want to do, but what they expect\nand want from other people. Xu does not go as far as to suggest a\nuniversalizing test (as Tang Junyi did), but he did say, “The\nWay is what is accepted by each person, or slightly different, what\neveryone accepts from a position of equality” (Xu 1954 [2022:\n181]). It is not a great leap from here to a universalizing test to\ndistinguish moral and immoral (or amoral) motives.\n\nWe find in these thinkers a characteristic not only of modern\nConfucianism, but most Confucianism. They are not very concerned with\ndefining or determining what is good or right (which they believe is\nusually obvious) or with offering a decision procedure. Even Mou\nZongsan, who said ethics must be based on a categorical imperative\n(MZCW 20: 447), did not discuss how to apply it in practice. Their\nmain concern is to show that morality is part of human nature, and to\ndemonstrate how we can know this. Humans are fundamentally moral\nbeings for them, and so moral practice is a matter of accessing or\ndeveloping what we already have in us. Ideally, skill in moral\npractice should get a point of being effortless. There is no necessary\nconflict between reason and inclination, between what one desires and\nwhat is right. The ideal of the sage, who knows and does what is right\nwithout thought or effort, remained real in modern Confucian thought,\neven if they also recognized that it was a distant goal (TJCW 26:\n2.216–17). The goal is to reveal what persons are, such that\nmoral practice is part of who we are and becoming a sage is at least a\npossibility.\n5. Political Thought\n\nPolitical thought was and remains a critical area in modern\nConfucianism. Mou, Tang, and Xu all responded to the failure of\ninitial efforts toward democracy in China with arguments for why\ndemocracy was not only compatible with Confucianism, but a necessary\nevolution for it (Elstein 2014; Fröhlich 2017). (Xiong had less\nto say about politics (Van den Stock 2016: 222–25).) Strong\nopposition to Communism led them to leave China, but they were also\ndisappointed by the Nationalist dictatorship on Taiwan.\n\nTheir support of a Confucian justification for democracy was a way of\nresponding to three alternative views: two critical of Confucianism\nand one supportive of Confucianism but critical of democracy. The\nfirst two were Chinese Communism and liberalism. The Communist\ninsistence on materialism and reduction of morality to class interest\nwas unacceptable to all three as it amounted to a rejection of the\nmoral self. Liberals in Taiwan supported democracy but insisted\nChinese culture was an obstacle to it that had to be swept away.\nModern Confucians agreed with democracy as an end, but the means could\nnot be giving up Chinese culture. The last, anti-democratic group was\nthe Nationalist government and its supporters in Taiwan. They\nsupported traditional culture, including Confucianism, but used it,\nalong with the need to fight Communism, to justify their one-party\nrule (Huang 2018 [2019: 94–95]). A fourth view opposed to\ndemocracy, Confucian meritocracy (Bai 2020; Bell 2015; Jiang 2012),\ndid not exist at the time, but they would have rejected it, too. The\nmodern Confucianism position contains these common elements: due to\nhistorical limitations earlier Confucian thinkers had not advocated\ndemocracy, Confucianism is not only not antithetical to democracy but\nin reality democracy is the way to realize Confucian ideals, and\ndemocracy in fact needs Confucianism or something like it to be\nstable.\n5.1 Democracy through Self-Restriction of Morality\n\nMou Zongsan’s political thought features two important\ninnovations. The first is his idea of an indirect or dialectical\nconnection between Confucian ethical thought and democracy. The\nsecond, closely related, is the belief that objective, democratic\ninstitutions are necessary to make possible the Confucian ideal of\nsagely rulership. This is how Mou addresses the complete absence of\ndemocratic institutions in the history of Confucian thought while\nstill arguing for their importance.\n\nMou argued that traditional Confucianism failed by assuming too tight\na relationship between ethics and politics. He distinguishes two types\nof connections between them: direct (zhitong\n直通) and indirect (qutong 曲通).\nDeveloping democracy requires an indirect connection (MZCW 10:\n61–62). In politics, direct connection is between a virtuous\nleader and moral politics: the belief that a morally good ruler is\nnecessary and sufficient for good government. Politics cannot be\nlinked so closely to morality and needs to have some independence (Lee\n2017: 85). The way Mou justifies this is through his famous concept of\nself-restriction (or self-negation) (ziwo kanxian\n自我坎陷) (MZCW 10: 64). Morality has to limit\nitself to allow for the development of amoral political\nstructures.\n\nThe moral reasoning at the foundation of Confucian thought must\nrestrict itself to allow for the development of theoretical or\nconstructive reason so politics can be partly separated from morality.\nDemocracy is not a moral system. Elections are not limited to the\nvirtuous. In the traditional ideal of sagely rulers and worthy\nministers, government is not independent from morality, as the\npossibility of good government depends on moral rulers and officials.\nHowever, traditional Confucian thought had no system to transmit power\nreliably only to sages and worthies. That system was inherently\nunstable. In democracy, political virtue is embodied in objective\nstructures, not individuals. Realizing morality in politics thus\ndemands moral reason restrict itself so theoretical reason can\ndevelop, as only theoretical reason can produce value-neutral\ndemocratic institutions (MZCW 10: 65, 151–52). This indirect\nconnection between morality and politics realizes moral goals better\nthan a direct connection can.\n\nThe philosophical foundation for democracy is Mengzi’s doctrine\nthat human nature is good. Mou argues that democracy is in fact\nnecessary to realize the goal of Confucian morality, to allow each\nperson to realize their good nature. However, we must be precise about\nthe kind of necessity this is. It is not logical necessity. There is\nno logical contradiction in an autocratic government allowing people\nto realize the goodness of human nature. It simply does not often work\nout. The necessity Mou talks about is dialectical or practical. It is\na question of what kind of government is most likely to make possible\nthe goal of realizing Confucian morality.\n5.2 Political Equality from Equal Subjectivity\n\nTang’s arguments for democracy proceed along similar lines,\nbasing democracy on the equality of persons and the need for objective\ninstitutions. However, he employs his characteristic focus on\naffective connection and recognizing the subjectivity of other people\nto support democracy. It is critical for Tang that democracy is not\njust a modus vivendi that simply recognizes practically that\npeople won’t accept giving up their rights. It must be based on\nequality of personality, exactly what Chinese culture puts at the\nfoundation (TJCW 9: 325). The basis of this is the universal moral\nheart-mind:\n\n\nWe say that the infinite value of the individual and highest dignity\nof the person are founded on possession of the heart-mind of moral\nreason. (TJCW 11: 195)\n\n\nAs covered previously, Tang thinks this heart-mind (he also calls it\nthe humane heart-mind) is minimally a presupposition of most activity\nin life. It is something we feel in ourselves and believe it is a\nuniversal characteristic of humanity.\n\nOne of Tang’s innovations is to illustrate how political\nactivity is itself a way of experiencing affective connection with\nothers. Tang starts with the bare desire for power, something humans\nshare with animals. The difference is that people are necessarily\nself-aware, and so someone desiring power knows they cannot pursue it\nblindly without it being self-defeating. They will have to regulate\nthis desire and consider how to realize it most effectively, and when\nthey do so, they already begin to transcend the desire for power\nitself (TJCW 12: 123). The desire for power is a desire for other\npeople to submit to me and follow my will, and that itself recognizes\nthat other people have a will of their own (TJCW 12: 125). We do not\nseek submission from things, but simply use them. Going further, the\nway to get people to submit is provide something they value (such as\ntheir continued life). Then satisfying my desire for power depends on\nbeing able to provide something that other people value, and I tacitly\nrecognize that they have their own values, which I must understand.\nThrough this process, recognizing that others have values and seeking\nto persuade them to submit, the selfish heart-mind can transform into\na public-spirited heart-mind, though Tang admits this won’t\nnecessarily happen (TJCW 12: 132–35; Fröhlich 2017:\n168–75). Still, even here affective connection has been\nestablished. Tang wants to show that even the bare desire of power\nmust recognize the existence of other minds with wills and values of\ntheir own.\n\nThe route to democracy is based on recognition of others’ minds\nand applying moral reason which demands universality. As I wish for my\nown rights and the ability to participate in government, rational\nconsistency requires that I respect others’ rights and desire to\nparticipate in government. I must begin to see my own political\nactivity as something that could be approved by others. “Then on\nthe basis of reason, we set up a form of participating in government\nthat is publicly accepted and universally approved”. This is\ndemocracy (TJCW 11: 187). In contrast to Hobbes, Tang holds the belief\nthat people are not absolutely selfish, though of course they act\nselfishly at times. The state is not formed by a social contract among\nindividuals. Communities are an inherent part of human life even\nbefore there were states. (TJCW 12: 169–74). Communities are\nrequired by universal reason. Democracy is of course not perfect, but\nrealizes the requirements of reason better than alternative forms of\ngovernment. The flaws of democracy cannot be rectified by laws alone.\nElevating people’s moral consciousness is necessary (TJCW 12:\n200–205). This is why Tang thinks strictly political liberalism\nis fatally flawed. Democracy needs a vision of persons as moral\nbeings.\n5.3 Realizing Rule by Virtue in Democracy\n\nAccording to Xu Fuguan, the highest value in Confucianism and the\nultimate source of its democratic ideals is life (sheng\n生). Valuing life above all is the true spirit of humanism, and\nit must come before all other political ideals (Xu 1953 [2022: 157]).\nXu means a biological notion of life primarily, so caring for the\nphysical self takes priority over caring for the moral self. Xu\nfurther emphasizes that respecting life means respecting individual\npersons. The primary duty of government is providing for\npeople’s material needs; education and pursuit of the good come\nafter that (Xu 1979 [1988]: 198), so a Confucian government can never\njustify harming individuals in the name of either their own good or\nthe good of society as a whole.\n\nXu claims Confucianism is democratic in spirit. Ideas of human dignity\nand equality that are foundational for liberal democracy were part of\nChinese culture, by which he means Confucian thought (Xu 1966 [2022:\n235]). Universal human nature implies a certain kind of equality, and\nas Mengzi emphasizes it is the moral potential which makes people\ndifferent from beasts, it is not a great leap to an idea of human\ndignity in virtue of this nature (Gao 2010). However, these ideals can\nbe the basis for democracy, but ideals are not enough. What is\nnecessary are objective institutions to guarantee the realization of\nthese ideals (Xu 1953 [2022: 149–50]). What required a sage\nruler in earlier Confucian political theory is routinized in\ndemocracy; the rulers respect the dignity of the people because they\nhave no choice. Virtue is objectified so it no longer relies on\ncaprice.\n\nXu considers rule by virtue and non-action the foundations of\ntraditional Confucian political thought and still apply in a Confucian\ndemocracy. For Xu, non-action means “not using one’s\npersonal preferences to rule the people, and not using coercive means\nto rule the people” (Xu 1966 [2022: 237]). Instead, virtue\noperates through rituals (Xu 1951 [2022: 72]). In his analysis, the\nsage rulers of the past reflected and implemented the people’s\npreferences; they did not impose their own ideas (Xu 1953 [2022:\n143–44]). But getting rid of one’s own preferences is very\ndifficult to do, and the value of democracy is putting structural\nlimits on governors’ ability to rule according to their desires.\nWhere traditional Confucian politics depended on the ruler being\nwilling to set aside his own preferences, democracy removes the\nsubjective element: the governors must follow the people’s\npreferences whether they want to or not. By removing the uncertainty\nof relying on individual virtue, democracy is actually the full\nrealization of the ideal of rule by virtue (Xie 2008: 183–85).\nThis is why Xu believes democracy is the natural path for Confucianism\nto take.\n\nWhere Xu is most Confucian is that he does not see law as sufficient\nfor good government. Law is necessary, but so is virtue and providing\na moral basis for government (Xu 1959 [2022: 229–30]). Xu\nbelieves the problem with Western democracy is it just treats people\nas physical beings acting to satisfy desires (what he sometimes\ncriticizes as the utilitarian view) (Xu 1980a: 241; 2022: 96). Western\npolitics is inadequate because it ignores the moral self, assuming\npeople are merely self-interested. The common interest is just a\nresult of individual interests limiting and controlling each other; it\nis not based on awareness of shared morality and respect for human\ndignity. What needs to be added is the concept of people as moral\nbeings, the virtue dimension (Xu 1951 [2022: 73–74]). Xu makes a\nmoral argument for democracy: it allows better realization of the\npotential of human nature than all other systems. His faith in human\nnature manifests in trusting people to allow them to develop their own\nmoral selves.\n6. Recent Developments\n\nModern Confucian philosophy is of course not limited to these four\nscholars, nor did its development stop with the twentieth century. Mou\nZongsan and Tang Junyi in particular were instrumental in training the\nfollowing generations of Chinese philosophers in Taiwan and Hong Kong,\nwhere their thought remains very influential. When mainland China\nbegan opening in the 1980s, scholars there initiated major projects on\nthe study of modern Confucianism. New editions of their works were\npublished, including those who had lived outside of China (usually\nexcising their criticisms of the Communist Party). Scholarly exchanges\nbetween Hong Kong, Taiwan, and China also picked up, with the result\nthat these once-separate scholarly communities are now intertwined,\nwith some mainland scholars now developing their own modern Confucian\nphilosophies (sometimes explicitly in opposition to Mou, Tang, and Xu)\n(Chen 2006 [2009]; Li Zehou 2015 [2018]; Y. Li 2021).\n\nThe fundamentals of modern Confucianism can be found in these other\nphilosophers: interest in modernity and what it means for China, and\ninfluence from Western philosophy, in vocabulary or ideas or both. Any\nChinese philosopher in East Asia now has to know Western philosophy as\nwell as Chinese, and comparisons are everywhere. For the most part,\nthe influence goes in one direction still. East Asian philosophers\nknow Western philosophy much better than Western philosophers know any\nAsian philosophy. Fortunately, some translations have become available\nrecently, and with luck this will continue. Modern Confucian\nphilosophers believed they had something important to offer the world,\nand their views are beginning to get some interest outside of East\nAsia.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Bai, Tongdong, 2020, <em>Against Political Equality: The Confucian\nCase</em>, (The Princeton-China Series 2), Princeton, NJ: Princeton\nUniversity Press. doi:10.1515/9780691197463",
                "Bell, Daniel, 2015, <em>The China Model: Political Meritocracy and\nthe Limits of Democracy</em>, Princeton, NJ: Princeton University\nPress. doi:10.1515/9781400883486",
                "Billioud, Sébastien, 2012, <em>Thinking through Confucian\nModernity: A Study of Mou Zongsan’s Moral Metaphysics</em>,\nLeiden: Brill. doi:10.1163/9789004215542",
                "Bunnin, Nicholas, 2008, “God’s Knowledge and Ours:\nKant and Mou Zongsan on Intellectual Intuition”, <em>Journal of\nChinese Philosophy</em>, 35(4): 613–624.\ndoi:10.1111/j.1540-6253.2008.00507.x",
                "Chan, N. Serina, 2011, <em>The Thought of Mou Zongsan</em>,\n(Modern Chinese Philosophy 4), Leiden/Boston: Brill.\ndoi:10.1163/ej.9789004212114.i-340",
                "Chan, Sin Yee, 2002, “Tang Junyi: Moral Idealism and Chinese\nCulture”, in Cheng and Bunnin 2002: 305–326 (ch. 15).\ndoi:10.1002/9780470753491.ch16",
                "Chen Lai 陈来, 2006 [2009],\n传统与现代 :\n人文主义的视界 , first\nedition, Beijing: Beijing University Press. Translated as\n<em>Tradition and Modernity: A Humanist View</em>, Edmund Ryden\n(trans.), (Brill’s Humanities in China Library 3),\nLeiden/Boston: Brill, 2009. doi:10.1163/ej.9789004165786.i-386",
                "Cheng, Chung-ying and Nicholas Bunnin (eds), 2002,\n<em>Contemporary Chinese Philosophy</em>, Malden, MA: Blackwell\nPublishers. doi:10.1002/9780470753491",
                "Chiu King Pong 趙敬邦, 2016, <em>Thomé H.\nFang, Tang Junyi and Huayan Thought: A Confucian Appropriation of\nBuddhist Ideas in Response to Scientism in Twentieth-Century\nChina</em>, (Modern Chinese Philosophy, 8), Leiden/Boston: Brill.\ndoi:10.1163/9789004313880",
                "–––, 2023, <em>The Holiness in Ordinariness: On\nTang Junyi’s Study of Human Being</em>\n即凡建聖:\n唐君毅人學論, (History of Chinese\nThought Series 27), Taibei: National Taiwan University Press.",
                "Elstein, David, 2014, <em>Democracy in Contemporary Confucian\nPhilosophy</em>, (Routledge Studies in Contemporary Philosophy 60),\nNew York: Routledge. doi:10.4324/9780203495186",
                "–––, 2021a, “Xu Fuguan: Realizing the\nHuman Spirit”, in Elstein 2021b: 199–220.\ndoi:10.1007/978-3-030-56475-9_10",
                "––– (ed.), 2021b, <em>Dao Companion to\nContemporary Confucian Philosophy</em>, (Dao Companions to Chinese\nPhilosophy 15), Cham: Springer. doi:10.1007/978-3-030-56475-9",
                "Feng Youlan 馮友蘭, 1931, <em>History of Chinese\nPhilosophy</em> 中國哲學史, vol. 1,\nShanghai: Shenzhou guoguangshe.",
                "–––, 1934, <em>History of Chinese\nPhilosophy</em> 中國哲學史, vol. 2,\nShanghai: Commercial Press.",
                "Fröhlich, Thomas, 2017, <em>Tang Junyi: Confucian Philosophy\nand the Challenge of Modernity</em>, (Modern Chinese Philosophy, 13),\nLeiden/Boston: Brill. doi:10.1163/9789004330139",
                "Fung, Yiu-ming, 2021, “Methods and Approaches in\nContemporary Confucianism”, in Elstein 2021b: 609–626.\ndoi:10.1007/978-3-030-56475-9_27",
                "Gao Ruiquan, 2010, “Confucian Socialism or Confucian\nLiberalism? Looking at the Different Dimension of the Contemporary\nConfucian Concept of ‘Equality’ through the Work of Xu\nFuguan\n儒家社会主义，还是儒家自由主义？–从徐复观看现代儒家‘平等’观念的不同向度”,\n<em>Academic Monthly</em> 学术月刊, 42(6):\n26–34.",
                "Guo Qiyong, 2021, “Xiong Shili’s Ontology”, in\nElstein 2021b: 89–104. doi:10.1007/978-3-030-56475-9_5",
                "Huang Junjie (Huang Chun-chieh) 黃俊傑, 2018\n[2019],\n東亞儒學視域中的徐復觀及其思想\n, (Dong Ya ruxue yanjiu congshu 4), Taibei: National Taiwan University\nInstitute for Advanced Research in Humanities and Social Sciences\nCenter for Research on East Asian Confucianisms. Translated as <em>Xu\nFuguan in the Context of East Asian Confucianisms</em>, Diana\nArghirescu (trans.), (Confucian Cultures), Honolulu: University of\nHawaiʻi Press, East-West Center, 2019.\ndoi:10.1515/9780824880521",
                "Jiang Qing, 2012, <em>A Confucian Constitutional Order: How\nChina’s Ancient Past Can Shape Its Political Future</em>, Daniel\nBell and Ruiping Fan (eds), Edmund Ryden (trans.), (The\nPrinceton-China Series), Princeton, NJ: Princeton University\nPress.",
                "Kant, Immanuel, 1785 [1997], <em>Grundlegung zur Metaphysik der\nSitten</em>, Riga: Johann Friedrich Hartknoch; translated as\n<em>Groundwork of the Metaphysics of Morals</em>, Mary J. Gregor\n(trans.), Cambridge, New York: Cambridge University Press, 1997.",
                "Lee Ming-huei [Li Minghui] 李明輝, 1990,\n<em>Confucianism and Kant</em>\n儒家與康德, Taibei: Linking Press.",
                "–––, 2013, <em>The Self-Transformation of\nContemporary Confucianism</em>\n當代儒學的自我轉化,\nRevised edition, Taibei: Academia Sinica Institute of Chinese\nLiterature and Philosophy.",
                "–––, 2017, <em>Confucianism: Its Roots and\nGlobal Significance</em>, David Edward Jones (ed.), (Confucian\nCultures), Honolulu: University of Hawaiʻi Press, East-West\nCenter.",
                "–––, 2021, “Mou Zongsan: Between\nConfucianism and Kantianism”, in Elstein 2021b: 255–275.\ndoi:10.1007/978-3-030-56475-9_12",
                "Li, Yong, 2021, “Recent Developments in Confucianism in\nMainland China”, in Elstein 2021b: 587–608.\ndoi:10.1007/978-3-030-56475-9_26",
                "Li Zehou 李泽厚, 2015 [2018],\n由巫到礼 释礼归仁,\nfirst edition, Beijing: SDX Joint Publishing Company. Translated as\n<em>The Origins of Chinese Thought: From Shamanism to Ritual\nRegulations and Humaneness</em>, Robert A. Carleo (trans.), (Modern\nChinese Philosophy 17), Leiden/Boston: Brill, 2018.\ndoi:10.1163/9789004379626",
                "Liang Shuming 梁漱溟, 1921, <em>Eastern and\nWestern Culture and Their Philosophies</em>\n東西文化及其哲學,\nShanghai: Commercial Press.",
                "Major, Philippe, 2021, “The Confucian Atomistic Individual?\nSelfhood in Xiong Shili’s New Treatise on the Uniqueness of\nConsciousness”, <em>Philosophy East and West</em>, 71(4):\n938–958. doi:10.1353/pew.2021.0063",
                "Makeham, John, 2003a, “The Retrospective Creation of New\nConfucianism”, in Makeham 2003b: 25–53.\ndoi:10.1057/9781403982414_2",
                "––– (ed.), 2003b, <em>New Confucianism: A\nCritical Examination</em>, New York: Palgrave.\ndoi:10.1057/9781403982414",
                "Marchal, Kai, 2016, “Paradoxes and Possibilities of\n‘Confucian Freedom’: From Yan Fu (1853–1921) to Mou\nZongsan (1909–1995)”, <em>Philosophy East and West</em>,\n66(1): 218–258. doi:10.1353/pew.2016.0001",
                "<em>Mengzi</em>, 2008, Bryan W. Van Norden (trans.), Indianapolis:\nHackett.",
                "Metzger, Thomas A., 1977, <em>Escape from Predicament:\nNeo-Confucianism and China’s Evolving Political Culture</em>,\n(Studies of the East Asian Institute, Columbia University), New York:\nColumbia University Press.",
                "–––, 2005, <em>A Cloud across the Pacific:\nEssays on the Clash between Chinese and Western Political Theories\nToday</em>, (Academic Monograph on Political Philosophy. China\nStudies), Hong Kong: Chinese University Press.",
                "Mou Zongsan 牟宗三, 1955, <em>Philosophy of\nHistory</em> 歷史哲學, Gaoxiong: Qiangsheng\nPress; reprinted in [MZCW 9b], pp. 1–484.",
                "–––, 1959, <em>Moral Idealism</em>\n道德的理想主義, Taibei:\nWenxing Books, Taizhong: Donghai University Press; reprinted in [MZCW\n9a], pp. 1–353.",
                "–––, 1961, <em>Authority and Governance</em>\n政道與治道, Taibei: Guangwen Books,\nreprinted in [MZCW 10].",
                "–––, 1968–69, <em>Heart-Mind and Human\nNature as Reality</em> 心體與性體, 3\nvols., Taibei: Zhengzhong Books; reprinted in [MZCW 5–7].",
                "–––, 1971, <em>Intellectual Intuition and\nChinese Philosophy</em>\n智的直覺與中國哲學,\nTaibei: Commercial Press; reprinted in [MZCW 20].",
                "–––, 1975, <em>Appearances and\nThings-in-Themselves</em>\n現象與物自身, Taibei: Student\nBooks; reprinted in [MZCW 21].",
                "–––, 1983, <em>Nineteen Lectures on Chinese\nPhilosophy</em>\n中國哲學十九講, Taibei:\nStudent Books; reprinted in [MZCW 29].",
                "–––, 1985, <em>On the Perfect Good</em>\n圓善論, Taibei: Student Books; reprinted in [MZCW\n22]",
                "–––, 1991, “Objective Understanding and\nthe Remaking of Chinese Culture\n客觀的瞭解與中國文化的再造,”\n<em>Legein Monthly</em> 鵝湖月刊 16(11):\n2–10; reprinted in [MZCW 27], pp. 419–438; translated in\nMou 2014, 31–60.",
                "–––, 2003, <em>Complete Works of Mou\nZongsan</em> 牟宗三先生全集,\n32 volumes, Taibei: Linking Books.\n\n<ul class=\"hanging\">\n[MZCW 5] <em>Heart-Mind and Human Nature as Reality Book 1</em>\n心體與性體1冊, volume 1 of 3.\n[MZCW 6] <em>Heart-Mind and Human Nature as Reality Book 2</em>\n心體與性體2冊, volume 2 of 3.\n[MZCW 5] <em>Heart-Mind and Human Nature as Reality Book 3</em>\n心體與性體3冊, volume 3 of 3.\n[MZCW 9a] <em>Moral Idealism</em>\n道德的理想主義.\n[MZCW 9b] <em>Philosophy of History</em>\n歷史哲學.\n[MZCW 10] <em>Authority and Governance</em>\n政道與治道.\n[MZCW 20] <em>Intellectual Intuition and Chinese Philosophy</em>\n智的直覺與中國哲學.\n[MZCW 21] <em>Appearances and Things-in-Themselves</em>\n現象與物自身.\n[MZCW 22] <em>On the Perfect Good</em>\n圓善論.\n[MZCW 27] <em>Anthology of Late Writings of Mou Zongsan</em>\n牟宗三先生晚期文集.\n[MZCW 29] <em>Nineteen Lectures on Chinese Philosophy</em>\n中國哲學十九講.\n</ul> ",
                "[MZCW 5] <em>Heart-Mind and Human Nature as Reality Book 1</em>\n心體與性體1冊, volume 1 of 3.",
                "[MZCW 6] <em>Heart-Mind and Human Nature as Reality Book 2</em>\n心體與性體2冊, volume 2 of 3.",
                "[MZCW 5] <em>Heart-Mind and Human Nature as Reality Book 3</em>\n心體與性體3冊, volume 3 of 3.",
                "[MZCW 9a] <em>Moral Idealism</em>\n道德的理想主義.",
                "[MZCW 9b] <em>Philosophy of History</em>\n歷史哲學.",
                "[MZCW 10] <em>Authority and Governance</em>\n政道與治道.",
                "[MZCW 20] <em>Intellectual Intuition and Chinese Philosophy</em>\n智的直覺與中國哲學.",
                "[MZCW 21] <em>Appearances and Things-in-Themselves</em>\n現象與物自身.",
                "[MZCW 22] <em>On the Perfect Good</em>\n圓善論.",
                "[MZCW 27] <em>Anthology of Late Writings of Mou Zongsan</em>\n牟宗三先生晚期文集.",
                "[MZCW 29] <em>Nineteen Lectures on Chinese Philosophy</em>\n中國哲學十九講.",
                "–––, 2014, <em>Late Works of Mou Zongsan:\nSelected Essays on Chinese Philosophy</em>, Jason Clower (ed./trans.),\n(Modern Chinese Philosophy 7), Leiden/Boston: Brill.\ndoi:10.1163/9789004278905",
                "Ng, William (吳有能), 1998, “T’ang\nChun-I on Transcendence: Foundations of a New-Confucian Religious\nHumanism”, <em>Monumenta Serica</em>, 46(1): 291–322.\ndoi:10.1080/02549948.1998.11731320",
                "Ng Yu-kwan, 2003, “Xiong Shili’s Metaphysical Theory\nabout the Non-Separability of Substance and Function”, in\nMakeham 2003b: 219–251. doi:10.1057/9781403982414_9",
                "Ni, Peimin, 2002, “Practical Humanism of Xu Fuguan”,\nin Cheng and Bunnin 2002: 281–304.\ndoi:10.1002/9780470753491.ch15",
                "Pong Wen-berng 彭文本, 2008, “Theory of\nIndividuality of Tang Junyi\n唐君毅論「個體的自我」,”\n<em>Philosophy and Culture</em>\n哲學與文化, 36(8): 77–100.",
                "Rošker, Jana, 2016, <em>The Rebirth of the Moral Self: The\nSecond Generation of Modern Confucians and Their Modernization\nDiscourses</em>, Hong Kong: The Chinese University Press.",
                "Schmidt, Stephan, 2011, “Mou Zongsan, Hegel, and Kant: The\nQuest for Confucian Modernity”, <em>Philosophy East and\nWest</em>, 61(2): 260–302. doi:10.1353/pew.2011.0029",
                "Shi, Weimin and Chiulo Lin, 2015, “Confucian Moral\nExperience and Its Metaphysical Foundation: From the Point of View of\nMou Zongsan”, <em>Philosophy East and West</em>, 65(2):\n542–566. doi:10.1353/pew.2015.0027",
                "Sun, Yifeng, 2022, “Yan Fu’s Translation\n‘Principle(s)’ and Huxley’s <em>Evolution and\nEthics</em>”, <em>Perspectives: Studies in Translation Theory\nand Practice</em>, 1–14. doi: 10.1080/0907676X.2022.2160264",
                "Solé-Farràs, Jesús, 2014, <em>New\nConfucianism in Twenty-First Century China: The Construction of a\nDiscourse</em>, (Routledge Contemporary China Series 108),\nAbingdon/New York: Routledge. doi:10.4324/9781315880457",
                "Suter, Rafael, 2018, “Transmitting the Sage’s\n‘Heart’ (I): Unsealing Moral Autonomy—Intellectual\nIntuition and Mou Zongsan’s Reconstruction of the\n‘Continuity of the Way’ (Daotong)”, <em>Philosophy\nEast and West</em>, 68(1): 223–241.\ndoi:10.1353/pew.2018.0011",
                "Tan, Sor-hoon, 2009, “Contemporary Neo-Confucian\nPhilosophy”, in <em>Routledge History of Chinese\nPhilosophy</em>, Bo Mou (ed.) (Routledge History of World Philosophies\n3), London/New York: Routledge, chapter 17.",
                "Tang Junyi 唐君毅, 1953, <em>The Spiritual Value\nof Chinese Culture</em>\n中國文化之精神價值.\nTaibei: Zhengzhong Books; reprinted in [TJCW 9].",
                "[T’ang Chün-i], 1955 [1981], “The Spirit of\nReligion and Modern Man: The Co-Operation of Man with Heaven for the\nSalvation of Mankind from Being Regarded as Purely Material”, in\n<em>Chinese Essays on Religion and Faith</em>, Douglas Lancanshire\n(ed.), San Francisco: Chinese Materials Center, 45–52.",
                "–––, 1958, <em>The Development of the Chinese\nHumanistic Spirit</em>\n中國人文精神之發展,\nHong Kong: Rensheng Press; reprinted in [TJCW 11].",
                "–––, 1958, <em>Cultural Consciousness and Moral\nReason</em>\n文化意識與道德理性,\nHong Kong: Youlian Press; reprinted in [TJCW 12].",
                "–––, 1966, <em>Origins of Chinese Philosophy:\nIntroduction</em> 中國哲學原論:\n導論, Hong Kong: Rensheng Press; reprinted in [TJCW\n17].",
                "–––, 1968, <em>Origins of Chinese Philosophy: On\nHuman Nature</em> 中國哲學原論:\n原性篇, Hong Kong: New Asia College; reprinted in\n[TJCW 18].",
                "–––, 1973, <em>Origins of Chinese Philosophy: On\nthe Way</em> 中國哲學原論:\n原道篇, 3 vols., Hong Kong: New Asia College;\nreprinted in [TJCW 19–21].",
                "–––, 1977, <em>Life Existence and the Horizons\nof Mind</em>\n生命存在與心靈境界,\n2 vols., Taibei: Student Books; [TJCW 25–26].",
                "–––, 2016, <em>Complete Works of Tang Junyi</em>\n唐君毅全集, Beijing: Jiuzhou chubanshe.\n\n<ul class=\"hanging\">\n[TJCW 9] <em>The Spiritual Value of Chinese Culture</em>\n中国文化之精神价值.\n[TJCW 11] <em>The Development of the Chinese Humanistic\nSpirit</em>\n中国人文精神之发展.\n[TJCW 12] <em>Cultural Consciousness and Moral Reason</em>\n文化意识与道德理性.\n[TJCW 17] <em>Origins of Chinese Philosophy: Introduction</em>\n中国哲学原论:\n导论.\n[TJCW 18] <em>Origins of Chinese Philosophy: On Human Nature</em>\n中国哲学原论:\n原性篇.\n[TJCW 19] <em>Origins of Chinese Philosophy: On the Way</em>\n中国哲学原论:\n原道篇, volume 1 of 3.\n[TJCW 20] <em>Origins of Chinese Philosophy: On the Way</em>\n中国哲学原论:\n原道篇, volume 2 of 3.\n[TJCW 21] <em>Origins of Chinese Philosophy: On the Way</em>\n中国哲学原论:\n原道篇, volume 3 of 3.\n[TJCW 25] <em>Life Existence and the Horizons of Mind, Volume\n1</em>\n生命存在与心灵境界,\nvolume 1 of 2.\n[TJCW 26] <em>Life Existence and the Horizons of Mind, Volume\n2</em>\n生命存在与心灵境界,\nvolume 2 of 2.\n</ul> ",
                "[TJCW 9] <em>The Spiritual Value of Chinese Culture</em>\n中国文化之精神价值.",
                "[TJCW 11] <em>The Development of the Chinese Humanistic\nSpirit</em>\n中国人文精神之发展.",
                "[TJCW 12] <em>Cultural Consciousness and Moral Reason</em>\n文化意识与道德理性.",
                "[TJCW 17] <em>Origins of Chinese Philosophy: Introduction</em>\n中国哲学原论:\n导论.",
                "[TJCW 18] <em>Origins of Chinese Philosophy: On Human Nature</em>\n中国哲学原论:\n原性篇.",
                "[TJCW 19] <em>Origins of Chinese Philosophy: On the Way</em>\n中国哲学原论:\n原道篇, volume 1 of 3.",
                "[TJCW 20] <em>Origins of Chinese Philosophy: On the Way</em>\n中国哲学原论:\n原道篇, volume 2 of 3.",
                "[TJCW 21] <em>Origins of Chinese Philosophy: On the Way</em>\n中国哲学原论:\n原道篇, volume 3 of 3.",
                "[TJCW 25] <em>Life Existence and the Horizons of Mind, Volume\n1</em>\n生命存在与心灵境界,\nvolume 1 of 2.",
                "[TJCW 26] <em>Life Existence and the Horizons of Mind, Volume\n2</em>\n生命存在与心灵境界,\nvolume 2 of 2.",
                "Tseng, Roy, 2019, “The Endless Pursuit of Self-Perfection: A\nHidden Dialogue between Mou Zongsan and F. H. Bradley”,\n<em>Philosophy East and West</em>, 69(3): 828–848.\ndoi:10.1353/pew.2019.0065",
                "Tu Wei-ming, 1993, <em>Way, Learning, and Politics: Essays on the\nConfucian Intellectual</em> (SUNY Series in Chinese Philosophy and\nCulture), Albany, NY: State University of New York Press.",
                "Van den Stock, Ady, 2016, <em>The Horizon of Modernity:\nSubjectivity and Social Structure in New Confucian Philosophy</em>,\n(Modern Chinese Philosophy 11), Leiden/Boston: Brill.\ndoi:10.1163/9789004301108",
                "–––, 2021, “Beyond the Horizon: Philosophy\nand Religion in the Late Work of Tang Junyi (1909–1978)”,\nin Elstein 2021b: 221–253. doi:10.1007/978-3-030-56475-9_11",
                "Wong, Wai-ying, 2021, “Discursive Understanding and\nExperiential Confirmation: Mou Zongsan and Tang Junyi on Human\nNature”, in Elstein 2021b: 469–487.\ndoi:10.1007/978-3-030-56475-9_21",
                "Wu, Jiang, 2002, “What Is <em>Jingjie</em>? Defining\nConfucian Spirituality in the Modern Chinese Intellectual\nContext”, <em>Monumenta Serica</em>, 50: 441–462.",
                "Xie Xiaodong 谢晓东, 2008. <em>Contemporary New\nConfucianism and Liberalism: A Comparative Study of Xu Fuguan's and\nYin Haiguang's Political Philosophy</em>\n现代新儒学与自由主义：徐复观殷海光政治哲学比较研究,\nBeijing: Dongfang.",
                "Xiong Shili 熊十力, 1932 [2015], <em>Xin weishi\nlun</em>, Zhejiang Provincial Library. Translated as <em>New Treatise\non the Uniqueness of Consciousness</em>, John Makeham (trans.), (World\nThought in Translation), New Haven, CT: Yale University Press.",
                "Xu Fuguan 徐復觀, 1963 [1990], <em>A History of\nChinese Theories of Human Nature: The Pre-Qin Period</em>\n中國人性論史:\n先秦篇, Taibei: Commercial Press.",
                "–––, 1966, <em>The Spirit of Chinese Art</em>\n中國藝術精神, Taizhong: Donghai\nUniversity Press.",
                "–––, 1979 [1988], <em>Confucian Political\nThought and Democracy, Freedom and Human Rights</em>\n儒家政治思想與民主自由人權,\nXiao Xinyi (ed.), Revised edition, Taibei: Student Books.",
                "–––, 1980a, <em>Miscellaneous Writings of Xu\nFuguan: Reflections</em> 徐復觀雜文:\n記所思, Taibei: Times Publishing.",
                "–––, 1980b, “Mourning Xiong Shili\n悼念熊十力先生”, in\n<em>The Finest Selected Writings of Xu Fuguan</em>\n徐復觀文錄選粹, Xiao Xinyi\n(ed.), Taibei: Student Books, 339–342.",
                "–––, 2022, <em>The Chinese Liberal Spirit:\nSelected Writings of Xu Fuguan</em>, David Elstein (ed./trans.),\nAlbany, NY: SUNY Press.",
                "Yan Fu 嚴復, 1898, <em>On Heavenly Evolution</em>\n天演論, 2 vols., Mianyang, China: Shenshi jizhai.\n(Based on Thomas Henry Huxley's <em>Evolution and Ethics</em>, this is\na partial translation and rearrangement of the original with Yan's own\ncommentary.)",
                "Yao, Xinzhong, 2000, <em>An Introduction to Confucianism</em>,\n(Introduction to Religion), New York: Cambridge University Press.\ndoi:10.1017/CBO9780511800887"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Bai, Tongdong, 2020, <em>Against Political Equality: The Confucian\nCase</em>, (The Princeton-China Series 2), Princeton, NJ: Princeton\nUniversity Press. doi:10.1515/9780691197463</li>\n<li>Bell, Daniel, 2015, <em>The China Model: Political Meritocracy and\nthe Limits of Democracy</em>, Princeton, NJ: Princeton University\nPress. doi:10.1515/9781400883486</li>\n<li>Billioud, Sébastien, 2012, <em>Thinking through Confucian\nModernity: A Study of Mou Zongsan’s Moral Metaphysics</em>,\nLeiden: Brill. doi:10.1163/9789004215542</li>\n<li>Bunnin, Nicholas, 2008, “God’s Knowledge and Ours:\nKant and Mou Zongsan on Intellectual Intuition”, <em>Journal of\nChinese Philosophy</em>, 35(4): 613–624.\ndoi:10.1111/j.1540-6253.2008.00507.x</li>\n<li>Chan, N. Serina, 2011, <em>The Thought of Mou Zongsan</em>,\n(Modern Chinese Philosophy 4), Leiden/Boston: Brill.\ndoi:10.1163/ej.9789004212114.i-340</li>\n<li>Chan, Sin Yee, 2002, “Tang Junyi: Moral Idealism and Chinese\nCulture”, in Cheng and Bunnin 2002: 305–326 (ch. 15).\ndoi:10.1002/9780470753491.ch16</li>\n<li>Chen Lai 陈来, 2006 [2009],\n传统与现代 :\n人文主义的视界 , first\nedition, Beijing: Beijing University Press. Translated as\n<em>Tradition and Modernity: A Humanist View</em>, Edmund Ryden\n(trans.), (Brill’s Humanities in China Library 3),\nLeiden/Boston: Brill, 2009. doi:10.1163/ej.9789004165786.i-386</li>\n<li>Cheng, Chung-ying and Nicholas Bunnin (eds), 2002,\n<em>Contemporary Chinese Philosophy</em>, Malden, MA: Blackwell\nPublishers. doi:10.1002/9780470753491</li>\n<li>Chiu King Pong 趙敬邦, 2016, <em>Thomé H.\nFang, Tang Junyi and Huayan Thought: A Confucian Appropriation of\nBuddhist Ideas in Response to Scientism in Twentieth-Century\nChina</em>, (Modern Chinese Philosophy, 8), Leiden/Boston: Brill.\ndoi:10.1163/9789004313880</li>\n<li>–––, 2023, <em>The Holiness in Ordinariness: On\nTang Junyi’s Study of Human Being</em>\n即凡建聖:\n唐君毅人學論, (History of Chinese\nThought Series 27), Taibei: National Taiwan University Press.</li>\n<li>Elstein, David, 2014, <em>Democracy in Contemporary Confucian\nPhilosophy</em>, (Routledge Studies in Contemporary Philosophy 60),\nNew York: Routledge. doi:10.4324/9780203495186</li>\n<li>–––, 2021a, “Xu Fuguan: Realizing the\nHuman Spirit”, in Elstein 2021b: 199–220.\ndoi:10.1007/978-3-030-56475-9_10</li>\n<li>––– (ed.), 2021b, <em>Dao Companion to\nContemporary Confucian Philosophy</em>, (Dao Companions to Chinese\nPhilosophy 15), Cham: Springer. doi:10.1007/978-3-030-56475-9</li>\n<li>Feng Youlan 馮友蘭, 1931, <em>History of Chinese\nPhilosophy</em> 中國哲學史, vol. 1,\nShanghai: Shenzhou guoguangshe.</li>\n<li>–––, 1934, <em>History of Chinese\nPhilosophy</em> 中國哲學史, vol. 2,\nShanghai: Commercial Press.</li>\n<li>Fröhlich, Thomas, 2017, <em>Tang Junyi: Confucian Philosophy\nand the Challenge of Modernity</em>, (Modern Chinese Philosophy, 13),\nLeiden/Boston: Brill. doi:10.1163/9789004330139</li>\n<li>Fung, Yiu-ming, 2021, “Methods and Approaches in\nContemporary Confucianism”, in Elstein 2021b: 609–626.\ndoi:10.1007/978-3-030-56475-9_27</li>\n<li>Gao Ruiquan, 2010, “Confucian Socialism or Confucian\nLiberalism? Looking at the Different Dimension of the Contemporary\nConfucian Concept of ‘Equality’ through the Work of Xu\nFuguan\n儒家社会主义，还是儒家自由主义？–从徐复观看现代儒家‘平等’观念的不同向度”,\n<em>Academic Monthly</em> 学术月刊, 42(6):\n26–34.</li>\n<li>Guo Qiyong, 2021, “Xiong Shili’s Ontology”, in\nElstein 2021b: 89–104. doi:10.1007/978-3-030-56475-9_5</li>\n<li>Huang Junjie (Huang Chun-chieh) 黃俊傑, 2018\n[2019],\n東亞儒學視域中的徐復觀及其思想\n, (Dong Ya ruxue yanjiu congshu 4), Taibei: National Taiwan University\nInstitute for Advanced Research in Humanities and Social Sciences\nCenter for Research on East Asian Confucianisms. Translated as <em>Xu\nFuguan in the Context of East Asian Confucianisms</em>, Diana\nArghirescu (trans.), (Confucian Cultures), Honolulu: University of\nHawaiʻi Press, East-West Center, 2019.\ndoi:10.1515/9780824880521</li>\n<li>Jiang Qing, 2012, <em>A Confucian Constitutional Order: How\nChina’s Ancient Past Can Shape Its Political Future</em>, Daniel\nBell and Ruiping Fan (eds), Edmund Ryden (trans.), (The\nPrinceton-China Series), Princeton, NJ: Princeton University\nPress.</li>\n<li>Kant, Immanuel, 1785 [1997], <em>Grundlegung zur Metaphysik der\nSitten</em>, Riga: Johann Friedrich Hartknoch; translated as\n<em>Groundwork of the Metaphysics of Morals</em>, Mary J. Gregor\n(trans.), Cambridge, New York: Cambridge University Press, 1997.</li>\n<li>Lee Ming-huei [Li Minghui] 李明輝, 1990,\n<em>Confucianism and Kant</em>\n儒家與康德, Taibei: Linking Press.</li>\n<li>–––, 2013, <em>The Self-Transformation of\nContemporary Confucianism</em>\n當代儒學的自我轉化,\nRevised edition, Taibei: Academia Sinica Institute of Chinese\nLiterature and Philosophy.</li>\n<li>–––, 2017, <em>Confucianism: Its Roots and\nGlobal Significance</em>, David Edward Jones (ed.), (Confucian\nCultures), Honolulu: University of Hawaiʻi Press, East-West\nCenter.</li>\n<li>–––, 2021, “Mou Zongsan: Between\nConfucianism and Kantianism”, in Elstein 2021b: 255–275.\ndoi:10.1007/978-3-030-56475-9_12</li>\n<li>Li, Yong, 2021, “Recent Developments in Confucianism in\nMainland China”, in Elstein 2021b: 587–608.\ndoi:10.1007/978-3-030-56475-9_26</li>\n<li>Li Zehou 李泽厚, 2015 [2018],\n由巫到礼 释礼归仁,\nfirst edition, Beijing: SDX Joint Publishing Company. Translated as\n<em>The Origins of Chinese Thought: From Shamanism to Ritual\nRegulations and Humaneness</em>, Robert A. Carleo (trans.), (Modern\nChinese Philosophy 17), Leiden/Boston: Brill, 2018.\ndoi:10.1163/9789004379626</li>\n<li>Liang Shuming 梁漱溟, 1921, <em>Eastern and\nWestern Culture and Their Philosophies</em>\n東西文化及其哲學,\nShanghai: Commercial Press.</li>\n<li>Major, Philippe, 2021, “The Confucian Atomistic Individual?\nSelfhood in Xiong Shili’s New Treatise on the Uniqueness of\nConsciousness”, <em>Philosophy East and West</em>, 71(4):\n938–958. doi:10.1353/pew.2021.0063</li>\n<li>Makeham, John, 2003a, “The Retrospective Creation of New\nConfucianism”, in Makeham 2003b: 25–53.\ndoi:10.1057/9781403982414_2</li>\n<li>––– (ed.), 2003b, <em>New Confucianism: A\nCritical Examination</em>, New York: Palgrave.\ndoi:10.1057/9781403982414</li>\n<li>Marchal, Kai, 2016, “Paradoxes and Possibilities of\n‘Confucian Freedom’: From Yan Fu (1853–1921) to Mou\nZongsan (1909–1995)”, <em>Philosophy East and West</em>,\n66(1): 218–258. doi:10.1353/pew.2016.0001</li>\n<li><em>Mengzi</em>, 2008, Bryan W. Van Norden (trans.), Indianapolis:\nHackett.</li>\n<li>Metzger, Thomas A., 1977, <em>Escape from Predicament:\nNeo-Confucianism and China’s Evolving Political Culture</em>,\n(Studies of the East Asian Institute, Columbia University), New York:\nColumbia University Press.</li>\n<li>–––, 2005, <em>A Cloud across the Pacific:\nEssays on the Clash between Chinese and Western Political Theories\nToday</em>, (Academic Monograph on Political Philosophy. China\nStudies), Hong Kong: Chinese University Press.</li>\n<li>Mou Zongsan 牟宗三, 1955, <em>Philosophy of\nHistory</em> 歷史哲學, Gaoxiong: Qiangsheng\nPress; reprinted in [MZCW 9b], pp. 1–484.</li>\n<li>–––, 1959, <em>Moral Idealism</em>\n道德的理想主義, Taibei:\nWenxing Books, Taizhong: Donghai University Press; reprinted in [MZCW\n9a], pp. 1–353.</li>\n<li>–––, 1961, <em>Authority and Governance</em>\n政道與治道, Taibei: Guangwen Books,\nreprinted in [MZCW 10].</li>\n<li>–––, 1968–69, <em>Heart-Mind and Human\nNature as Reality</em> 心體與性體, 3\nvols., Taibei: Zhengzhong Books; reprinted in [MZCW 5–7].</li>\n<li>–––, 1971, <em>Intellectual Intuition and\nChinese Philosophy</em>\n智的直覺與中國哲學,\nTaibei: Commercial Press; reprinted in [MZCW 20].</li>\n<li>–––, 1975, <em>Appearances and\nThings-in-Themselves</em>\n現象與物自身, Taibei: Student\nBooks; reprinted in [MZCW 21].</li>\n<li>–––, 1983, <em>Nineteen Lectures on Chinese\nPhilosophy</em>\n中國哲學十九講, Taibei:\nStudent Books; reprinted in [MZCW 29].</li>\n<li>–––, 1985, <em>On the Perfect Good</em>\n圓善論, Taibei: Student Books; reprinted in [MZCW\n22]</li>\n<li>–––, 1991, “Objective Understanding and\nthe Remaking of Chinese Culture\n客觀的瞭解與中國文化的再造,”\n<em>Legein Monthly</em> 鵝湖月刊 16(11):\n2–10; reprinted in [MZCW 27], pp. 419–438; translated in\nMou 2014, 31–60.</li>\n<li>–––, 2003, <em>Complete Works of Mou\nZongsan</em> 牟宗三先生全集,\n32 volumes, Taibei: Linking Books.\n\n<ul class=\"hanging\">\n<li>[MZCW 5] <em>Heart-Mind and Human Nature as Reality Book 1</em>\n心體與性體1冊, volume 1 of 3.</li>\n<li>[MZCW 6] <em>Heart-Mind and Human Nature as Reality Book 2</em>\n心體與性體2冊, volume 2 of 3.</li>\n<li>[MZCW 5] <em>Heart-Mind and Human Nature as Reality Book 3</em>\n心體與性體3冊, volume 3 of 3.</li>\n<li>[MZCW 9a] <em>Moral Idealism</em>\n道德的理想主義.</li>\n<li>[MZCW 9b] <em>Philosophy of History</em>\n歷史哲學.</li>\n<li>[MZCW 10] <em>Authority and Governance</em>\n政道與治道.</li>\n<li>[MZCW 20] <em>Intellectual Intuition and Chinese Philosophy</em>\n智的直覺與中國哲學.</li>\n<li>[MZCW 21] <em>Appearances and Things-in-Themselves</em>\n現象與物自身.</li>\n<li>[MZCW 22] <em>On the Perfect Good</em>\n圓善論.</li>\n<li>[MZCW 27] <em>Anthology of Late Writings of Mou Zongsan</em>\n牟宗三先生晚期文集.</li>\n<li>[MZCW 29] <em>Nineteen Lectures on Chinese Philosophy</em>\n中國哲學十九講.</li>\n</ul> </li>\n<li>–––, 2014, <em>Late Works of Mou Zongsan:\nSelected Essays on Chinese Philosophy</em>, Jason Clower (ed./trans.),\n(Modern Chinese Philosophy 7), Leiden/Boston: Brill.\ndoi:10.1163/9789004278905</li>\n<li>Ng, William (吳有能), 1998, “T’ang\nChun-I on Transcendence: Foundations of a New-Confucian Religious\nHumanism”, <em>Monumenta Serica</em>, 46(1): 291–322.\ndoi:10.1080/02549948.1998.11731320</li>\n<li>Ng Yu-kwan, 2003, “Xiong Shili’s Metaphysical Theory\nabout the Non-Separability of Substance and Function”, in\nMakeham 2003b: 219–251. doi:10.1057/9781403982414_9</li>\n<li>Ni, Peimin, 2002, “Practical Humanism of Xu Fuguan”,\nin Cheng and Bunnin 2002: 281–304.\ndoi:10.1002/9780470753491.ch15</li>\n<li>Pong Wen-berng 彭文本, 2008, “Theory of\nIndividuality of Tang Junyi\n唐君毅論「個體的自我」,”\n<em>Philosophy and Culture</em>\n哲學與文化, 36(8): 77–100.</li>\n<li>Rošker, Jana, 2016, <em>The Rebirth of the Moral Self: The\nSecond Generation of Modern Confucians and Their Modernization\nDiscourses</em>, Hong Kong: The Chinese University Press.</li>\n<li>Schmidt, Stephan, 2011, “Mou Zongsan, Hegel, and Kant: The\nQuest for Confucian Modernity”, <em>Philosophy East and\nWest</em>, 61(2): 260–302. doi:10.1353/pew.2011.0029</li>\n<li>Shi, Weimin and Chiulo Lin, 2015, “Confucian Moral\nExperience and Its Metaphysical Foundation: From the Point of View of\nMou Zongsan”, <em>Philosophy East and West</em>, 65(2):\n542–566. doi:10.1353/pew.2015.0027</li>\n<li>Sun, Yifeng, 2022, “Yan Fu’s Translation\n‘Principle(s)’ and Huxley’s <em>Evolution and\nEthics</em>”, <em>Perspectives: Studies in Translation Theory\nand Practice</em>, 1–14. doi: 10.1080/0907676X.2022.2160264</li>\n<li>Solé-Farràs, Jesús, 2014, <em>New\nConfucianism in Twenty-First Century China: The Construction of a\nDiscourse</em>, (Routledge Contemporary China Series 108),\nAbingdon/New York: Routledge. doi:10.4324/9781315880457</li>\n<li>Suter, Rafael, 2018, “Transmitting the Sage’s\n‘Heart’ (I): Unsealing Moral Autonomy—Intellectual\nIntuition and Mou Zongsan’s Reconstruction of the\n‘Continuity of the Way’ (Daotong)”, <em>Philosophy\nEast and West</em>, 68(1): 223–241.\ndoi:10.1353/pew.2018.0011</li>\n<li>Tan, Sor-hoon, 2009, “Contemporary Neo-Confucian\nPhilosophy”, in <em>Routledge History of Chinese\nPhilosophy</em>, Bo Mou (ed.) (Routledge History of World Philosophies\n3), London/New York: Routledge, chapter 17.</li>\n<li>Tang Junyi 唐君毅, 1953, <em>The Spiritual Value\nof Chinese Culture</em>\n中國文化之精神價值.\nTaibei: Zhengzhong Books; reprinted in [TJCW 9].</li>\n<li>[T’ang Chün-i], 1955 [1981], “The Spirit of\nReligion and Modern Man: The Co-Operation of Man with Heaven for the\nSalvation of Mankind from Being Regarded as Purely Material”, in\n<em>Chinese Essays on Religion and Faith</em>, Douglas Lancanshire\n(ed.), San Francisco: Chinese Materials Center, 45–52.</li>\n<li>–––, 1958, <em>The Development of the Chinese\nHumanistic Spirit</em>\n中國人文精神之發展,\nHong Kong: Rensheng Press; reprinted in [TJCW 11].</li>\n<li>–––, 1958, <em>Cultural Consciousness and Moral\nReason</em>\n文化意識與道德理性,\nHong Kong: Youlian Press; reprinted in [TJCW 12].</li>\n<li>–––, 1966, <em>Origins of Chinese Philosophy:\nIntroduction</em> 中國哲學原論:\n導論, Hong Kong: Rensheng Press; reprinted in [TJCW\n17].</li>\n<li>–––, 1968, <em>Origins of Chinese Philosophy: On\nHuman Nature</em> 中國哲學原論:\n原性篇, Hong Kong: New Asia College; reprinted in\n[TJCW 18].</li>\n<li>–––, 1973, <em>Origins of Chinese Philosophy: On\nthe Way</em> 中國哲學原論:\n原道篇, 3 vols., Hong Kong: New Asia College;\nreprinted in [TJCW 19–21].</li>\n<li>–––, 1977, <em>Life Existence and the Horizons\nof Mind</em>\n生命存在與心靈境界,\n2 vols., Taibei: Student Books; [TJCW 25–26].</li>\n<li>–––, 2016, <em>Complete Works of Tang Junyi</em>\n唐君毅全集, Beijing: Jiuzhou chubanshe.\n\n<ul class=\"hanging\">\n<li>[TJCW 9] <em>The Spiritual Value of Chinese Culture</em>\n中国文化之精神价值.</li>\n<li>[TJCW 11] <em>The Development of the Chinese Humanistic\nSpirit</em>\n中国人文精神之发展.</li>\n<li>[TJCW 12] <em>Cultural Consciousness and Moral Reason</em>\n文化意识与道德理性.</li>\n<li>[TJCW 17] <em>Origins of Chinese Philosophy: Introduction</em>\n中国哲学原论:\n导论.</li>\n<li>[TJCW 18] <em>Origins of Chinese Philosophy: On Human Nature</em>\n中国哲学原论:\n原性篇.</li>\n<li>[TJCW 19] <em>Origins of Chinese Philosophy: On the Way</em>\n中国哲学原论:\n原道篇, volume 1 of 3.</li>\n<li>[TJCW 20] <em>Origins of Chinese Philosophy: On the Way</em>\n中国哲学原论:\n原道篇, volume 2 of 3.</li>\n<li>[TJCW 21] <em>Origins of Chinese Philosophy: On the Way</em>\n中国哲学原论:\n原道篇, volume 3 of 3.</li>\n<li>[TJCW 25] <em>Life Existence and the Horizons of Mind, Volume\n1</em>\n生命存在与心灵境界,\nvolume 1 of 2.</li>\n<li>[TJCW 26] <em>Life Existence and the Horizons of Mind, Volume\n2</em>\n生命存在与心灵境界,\nvolume 2 of 2.</li>\n</ul> </li>\n<li>Tseng, Roy, 2019, “The Endless Pursuit of Self-Perfection: A\nHidden Dialogue between Mou Zongsan and F. H. Bradley”,\n<em>Philosophy East and West</em>, 69(3): 828–848.\ndoi:10.1353/pew.2019.0065</li>\n<li>Tu Wei-ming, 1993, <em>Way, Learning, and Politics: Essays on the\nConfucian Intellectual</em> (SUNY Series in Chinese Philosophy and\nCulture), Albany, NY: State University of New York Press.</li>\n<li>Van den Stock, Ady, 2016, <em>The Horizon of Modernity:\nSubjectivity and Social Structure in New Confucian Philosophy</em>,\n(Modern Chinese Philosophy 11), Leiden/Boston: Brill.\ndoi:10.1163/9789004301108</li>\n<li>–––, 2021, “Beyond the Horizon: Philosophy\nand Religion in the Late Work of Tang Junyi (1909–1978)”,\nin Elstein 2021b: 221–253. doi:10.1007/978-3-030-56475-9_11</li>\n<li>Wong, Wai-ying, 2021, “Discursive Understanding and\nExperiential Confirmation: Mou Zongsan and Tang Junyi on Human\nNature”, in Elstein 2021b: 469–487.\ndoi:10.1007/978-3-030-56475-9_21</li>\n<li>Wu, Jiang, 2002, “What Is <em>Jingjie</em>? Defining\nConfucian Spirituality in the Modern Chinese Intellectual\nContext”, <em>Monumenta Serica</em>, 50: 441–462.</li>\n<li>Xie Xiaodong 谢晓东, 2008. <em>Contemporary New\nConfucianism and Liberalism: A Comparative Study of Xu Fuguan's and\nYin Haiguang's Political Philosophy</em>\n现代新儒学与自由主义：徐复观殷海光政治哲学比较研究,\nBeijing: Dongfang.</li>\n<li>Xiong Shili 熊十力, 1932 [2015], <em>Xin weishi\nlun</em>, Zhejiang Provincial Library. Translated as <em>New Treatise\non the Uniqueness of Consciousness</em>, John Makeham (trans.), (World\nThought in Translation), New Haven, CT: Yale University Press.</li>\n<li>Xu Fuguan 徐復觀, 1963 [1990], <em>A History of\nChinese Theories of Human Nature: The Pre-Qin Period</em>\n中國人性論史:\n先秦篇, Taibei: Commercial Press.</li>\n<li>–––, 1966, <em>The Spirit of Chinese Art</em>\n中國藝術精神, Taizhong: Donghai\nUniversity Press.</li>\n<li>–––, 1979 [1988], <em>Confucian Political\nThought and Democracy, Freedom and Human Rights</em>\n儒家政治思想與民主自由人權,\nXiao Xinyi (ed.), Revised edition, Taibei: Student Books.</li>\n<li>–––, 1980a, <em>Miscellaneous Writings of Xu\nFuguan: Reflections</em> 徐復觀雜文:\n記所思, Taibei: Times Publishing.</li>\n<li>–––, 1980b, “Mourning Xiong Shili\n悼念熊十力先生”, in\n<em>The Finest Selected Writings of Xu Fuguan</em>\n徐復觀文錄選粹, Xiao Xinyi\n(ed.), Taibei: Student Books, 339–342.</li>\n<li>–––, 2022, <em>The Chinese Liberal Spirit:\nSelected Writings of Xu Fuguan</em>, David Elstein (ed./trans.),\nAlbany, NY: SUNY Press.</li>\n<li>Yan Fu 嚴復, 1898, <em>On Heavenly Evolution</em>\n天演論, 2 vols., Mianyang, China: Shenshi jizhai.\n(Based on Thomas Henry Huxley's <em>Evolution and Ethics</em>, this is\na partial translation and rearrangement of the original with Yan's own\ncommentary.)</li>\n<li>Yao, Xinzhong, 2000, <em>An Introduction to Confucianism</em>,\n(Introduction to Religion), New York: Cambridge University Press.\ndoi:10.1017/CBO9780511800887</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Chinese Philosophy: epistemology",
            "Chinese Philosophy: Song-Ming Confucianism",
            "Confucianism",
            "Mencius"
        ],
        "entry_link": [
            {
                "../chinese-epistemology/": "Chinese Philosophy: epistemology"
            },
            {
                "../song-ming-confucianism/": "Chinese Philosophy: Song-Ming Confucianism"
            },
            {
                "../mencius/": "Mencius"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=confucianism-modern\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/confucianism-modern/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=confucianism-modern&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/confucianism-modern/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=confucianism-modern": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/confucianism-modern/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=confucianism-modern&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/confucianism-modern/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://philpapers.org/browse/new-confucianism\" target=\"other\">Bibliography on New Confucianism</a>,\n at philpapers.org, edited by Stephen C. Angle, Wesleyan\nUniversity"
        ],
        "listed_links": [
            {
                "https://philpapers.org/browse/new-confucianism": "Bibliography on New Confucianism"
            }
        ]
    }
}