{
    "url": "derrida",
    "title": "Jacques Derrida",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Leonard Lawlor\n<lul19@psu.edu>",
        "author_links": [
            {
                "https://philosophy.la.psu.edu/people/lul19": "Leonard Lawlor"
            },
            {
                "mailto:lul19%40psu%2eedu": "lul19@psu.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"https://philosophy.la.psu.edu/people/lul19\" target=\"other\">Leonard Lawlor</a>\n&lt;<a href=\"mailto:lul19%40psu%2eedu\"><em>lul19<abbr title=\" at \">@</abbr>psu<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Nov 22, 2006",
        "substantive revision Fri Aug 27, 2021"
    ],
    "preamble": "\n\nJacques Derrida (1930–2004) was the founder of\n“deconstruction,” a way of criticizing not only both\nliterary and philosophical texts but also political institutions.\nAlthough Derrida at times expressed regret concerning the fate of the\nword “deconstruction,” its popularity indicates the\nwide-ranging influence of his thought, in philosophy, in literary\ncriticism and theory, in art and, in particular, architectural theory,\nand in political theory. Indeed, Derrida’s fame nearly reached\nthe status of a media star, with hundreds of people filling\nauditoriums to hear him speak, with films and television programs\ndevoted to him, with countless books and articles devoted to his\nthinking. Beside critique, Derridean deconstruction consists in an\nattempt to re-conceive the difference that divides self-consciousness\n(the difference of the “of” in consciousness of oneself).\nBut even more than the re-conception of difference, and perhaps more\nimportantly, deconstruction attempts to render justice. Indeed,\ndeconstruction is relentless in this pursuit since justice is\nimpossible to achieve.\n",
    "toc": [
        {
            "#LifWor": "1. Life and Works"
        },
        {
            "#Inc": "2. “The Incorruptibles”"
        },
        {
            "#BasArgImpTimHeaOneSpeSecSov": "3. Basic Argumentation and its Implications: Time, Hearing-Oneself-Speak, the Secret, and Sovereignty"
        },
        {
            "#ElaBasArgWorHos": "4. Elaboration of the Basic Argumentation: The Worst and Hospitality"
        },
        {
            "#Dec": "5. Deconstruction"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#WorDer": "Works by Derrida"
        },
        {
            "#EngTra": "English translations"
        },
        {
            "#RefFurRea": "References and further reading"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Works\n\nDerrida was born on July 15, 1930 in El-Biar (a suburb of Algiers),\nAlgeria (then a part of France), into a Sephardic Jewish family.\nBecause Derrida’s writing concerns auto-bio-graphy (writing\nabout one’s life as a form of relation to oneself), many of his\nwritings are auto-biographical. So, for instance in Monolingualism\nof the Other (1998), Derrida recounts how, when he was in the\n“lycée” (high school), the Vichy regime in France\nproclaimed certain interdictions concerning the native languages of\nAlgeria, in particular Berber. Derrida calls his experience of the\n“interdiction” “unforgettable and\ngeneralizable” (1998, p. 37). In fact, the “Jewish\nlaws” passed by the Vichy regime interrupted his high school\nstudies.\n\nImmediately after World War II, Derrida started to study philosophy.\nIn 1949, he moved to Paris, where he prepared for the entrance exam in\nphilosophy for the prestigious École Normale Supérieure.\nDerrida failed his first attempt at this exam, but passed it in his\nsecond try in 1952. In one of the many eulogies that he wrote for\nmembers of his generation, Derrida recounts that, as he went into the\ncourtyard toward the building in which he would sit for the second\ntry, Gilles Deleuze passed him, smiling and saying, “My thoughts\nare with you, my very best thoughts.” Indeed, Derrida entered\nthe École Normale at a time when a remarkable generation of\nphilosophers and thinkers was coming of age. We have already mentioned\nDeleuze, but there was also Foucault, Althusser, Lyotard, Barthes, and\nMarin. Merleau-Ponty, Sartre, de Beauvoir, Levi-Strauss, Lacan,\nRicœur, Blanchot, and Levinas were still alive. The Fifties in\nFrance was the time of phenomenology, and Derrida studied closely\nHusserl’s then published works as well as some of the archival\nmaterial that was then available. The result was a Masters thesis from\nthe academic year 1953–54 called The Problem of Genesis in\nHusserl’s Philosophy; Derrida published this text in 1990.\nMost importantly, at the École Normale, Derrida studied Hegel\nwith Jean Hyppolite. Hyppolite (along with Maurice de Gandillac) was\nto direct Derrida’s doctoral thesis, “The Ideality of the\nLiterary Object”; Derrida never completed this thesis. His\nstudies with Hyppolite however led Derrida to a noticeably Hegelian\nreading of Husserl, one already underway through the works of\nHusserl’s assistant, Eugen Fink. Derrida claimed in his 1980\nspeech “The Time of a Thesis” (presented on the occasion\nof him finally receiving his doctorate) that he never studied\nMerleau-Ponty and Sartre and that especially he never subscribed to\ntheir readings of Husserl and phenomenology in general. With so much\nMerleau-Ponty archival material available, it is possible now however\nto see similarities between Merleau-Ponty’s final studies of\nHusserl and Derrida’s first studies. Nevertheless, even if one\nknows Merleau-Ponty’s thought well, one is taken aback by\nDerrida’s one hundred and fifty page long Introduction to his\nFrench translation of Husserl’s “The Origin of\nGeometry” (1962). Derrida’s Introduction looks to be a\nradically new understanding of Husserl insofar as Derrida stresses the\nproblem of language in Husserl’s thought of history.\n\nThe 1960s is a decade of great achievement for this generation of\nFrench thinkers. 1961 sees the publication of Foucault’s\nmonumental History of Madness (Madness and\nCivilization). At this time, Derrida is participating in a\nseminar taught by Foucault; on the basis of it, he will write\n“Cogito and the History of Madness” (1963), in which he\ncriticizes Foucault’s early thought, especially Foucault’s\ninterpretation of Descartes. “Cogito and the History of\nMadness” will result in a rupture between Derrida and Foucault,\nwhich will never fully heal. In the early 60s, Derrida reads Heidegger\nand Levinas carefully. The recently published lecture course from\n1964–1965, Heidegger: The Question of Being and\nHistory, allows us to see how Derrida developed his questions to\nHeidegger. In 1964, Derrida publishes a long two part essay on\nLevinas, “Violence and Metaphysics.” It is hard to\ndetermine which of Derrida’s early essays is the most important,\nbut certainly “Violence and Metaphysics” has to be a\nleading candidate.\n\nWhat comes through clearly in “Violence and Metaphysics”\nis Derrida’s great sympathy for Levinas’s thought of\nalterity, and at the same it is clear that Derrida is taking some\ndistance from Levinas’s thought. Despite this distance,\n“Violence and Metaphysics” will open up a lifetime\nfriendship with Levinas. In 1967 (at the age of thirty-seven), Derrida\nhas his “annus mirabilis,” publishing three books at once:\nWriting and Difference, Voice and Phenomenon, and\nOf Grammatology. In all three, Derrida uses the word\n“deconstruction” (to which we shall return below) in\npassing to describe his project. The word catches on immediately and\ncomes to define Derrida’s thought. From then on up to the\npresent, the word is bandied about, especially in the Anglophone\nworld. It comes to be associated with a form of writing and thinking\nthat is illogical and imprecise. It must be noted that Derrida’s\nstyle of writing contributed not only to his great popularity but also\nto the great animosity some felt towards him. His style is frequently\nmore literary than philosophical and therefore more evocative than\nargumentative.\n\nCertainly, Derrida’s style is not traditional. In the same\nspeech from 1980 at the time of him being awarded a doctorate, Derrida\ntells us that, in the Seventies, he devoted himself to developing a\nstyle of writing. The most clearest example is his 1974 Glas\n(“Death Knell” would be an approximate English\ntranslation; the current English translation simply uses the word\n“glas”); here Derrida writes in two columns, with the left\ndevoted to a reading of Hegel and the right devoted to a reading of\nthe French novelist-playwright Jean Genet. Another example would be\nhis 1980 Postcard from Socrates to Freud and Beyond; the\nopening two hundred pages of this book consist of love letters\naddressed to no one in particular. It seems that sometime around this\ntime (1980), Derrida reverted back to the more linear and somewhat\nargumentative style, the very style that defined his texts from the\nSixties. He never however renounced a kind of evocation, a calling\nforth that truly defines deconstruction. Derrida takes the idea of a\ncall from Heidegger. Starting in 1968 with “The Ends of\nMan,” Derrida devoted a number of texts to Heidegger’s\nthought. But, it is really with the 1978 publication of The Truth\nin Painting, and then throughout the 1980s, that Derrida\nintensified his reading of Heidegger. In particular, he wrote a series\nof essays on the question of sex or race in Heidegger\n(“Geschlecht I–IV”). While frequently critical,\nthese essays often provide new insights into Heidegger’s\nthought. The culminating essay in Derrida’s series on Heidegger\nis his 1992 Aporias.\n\nWhile Derrida’s intensive work on Husserl and phenomenology was\nprimarily limited to the late 1960s, and to the publication of\nVoice and Phenomenon in 1967, this one book produced many\ncriticisms of his reading of Husserl. Most notable is J. Claude\nEvans’ Strategies of Deconstruction: Derrida and the Myth of\nthe Voice in 1991 (for other criticisms, see Bernet 1988, Brough\n1993, Mohanty 1997, and Zahavi 1999). Although throughout his career\nDerrida would mention Husserl in passing, he surprisingly wrote a\nchapter on Husserl in his Touching: Jean-Luc Nancy. One of\nthe places where he mentions Husserl is his 1971 address to a\ncommunication conference in Montreal, “Signature Event\nContext.” He publishes this article as the final chapter of\nMargins of Philosophy in 1972. While “Signature Event\nContext” contains a short discussion of Husserl, its real focus\nis Austin’s speech act theory. The connection Derrida makes\nbetween Husserl’s phenomenology and Austin’s speech act\ntheory is that both reject citations from the realm of meaningfulness\n(Husserl) or of the performative (Austin). (Speech theory had a\nsubstantial influence on French philosophy at this moment, and Derrida\nwould continue to refer to the constative/performative distinction\nthroughout his career.) In any case, the English translation of\n“Signature Event Context” appeared in the first volume of\nthe new journal Glyph in 1977. The editor of Glyph,\nSam Weber, invited John Searle to write a response to “Signature\nEvent Context.” In his response, “Reiterating the\nDifferences: A Reply to Derrida,” Searle points out a number of\nflaws in Derrida’s argumentation and his understanding of\nAustin. For the second volume of Glyph (also published in\n1977), Derrida contributed a response to Searle’s\n“Reply” called “Limited Inc a b c.” In\ncontrast to Searle’s ten page “Reply,”\nDerrida’s “Limited Inc” ran to ninety pages.\nDerrida’s “Limited Inc” is an almost merciless\ncriticism of Searle, whom he calls “Sarl.” For instance,\nhe points out that Searle in his “Reply” hardly mentions\nsignature, event, or context. “Limited Inc” indicates\nDerrida’s growing frustration with the reception of his work,\nespecially in the Anglophone world. His frustration must have\nculminated when he was offered an honorary degree at Cambridge\nUniversity in 1992. A group of analytic philosophers wrote an open\nletter\n (available online)\n to the Times of London, in which they objected to Derrida\nreceiving this honorary degree. Despite the letter, Cambridge\nUniversity awarded Derrida the degree.\n\nThroughout the Sixties, having been invited by Hyppolite and\nAlthusser, Derrida taught at the École Normale. In 1983, he\nbecame “Director of Studies” in “Philosophical\nInstitutions” at the École des Hautes Études en\nSciences Sociales in Paris; he will hold this position until his\ndeath. Starting in the Seventies, Derrida held many appointments in\nAmerican universities, in particular Johns Hopkins University and Yale\nUniversity. From 1987, Derrida taught one semester a year at the\nUniversity of California at Irvine. Derrida’s close relationship\nwith Irvine led to the establishment of the Derrida archives there.\nAlso during the Seventies, Derrida associated himself with GREPH\n(“Le Groupe de Recherche sur l’Enseignement\nPhilosophique,” in English: “The Group Investigating the\nTeaching of Philosophy”). As its name suggests, this group\ninvestigated how philosophy is taught in the high schools and\nuniversities in France. Derrida wrote several texts based on this\nresearch, many of which were collected in Du droit à la\nphilosophie (1990, one part of this book has been translated into\nEnglish as Eyes of the University. Right to Philosophy 2). In\n1982, Derrida was also one of the founders of the Collège\nInternationale de Philosophie in Paris, and served as its first\ndirector from 1982 to 1984.\n\nIn the 1990s, Derrida’s works went in two simultaneous\ndirections that tend to intersect and overlap with one another:\npolitics and religion. These two directions were probably first\nclearly evident in Derrida’s 1989 “Force of Law.”\nBut one can see them better in his 1993 Specters of Marx,\nwhere Derrida insisted that a deconstructed (or criticized) Marxist\nthought is still relevant to today’s world despite globalization\nand that a deconstructed Marxism consists in a new messianism, a\nmessianism of a “democracy to come.” But, even though\nDerrida was approaching the end of his life, he produced many\ninteresting texts in the Nineties and into the new century. For\ninstance, Derrida’s 1996 text on Levinas, “A Word of\nWelcome,” lays out the most penetrating logic of the same and\nother through a discussion of hospitality. In his final works on\nsovereignty, in particular, Rogues (2003), Derrida shows that\nthe law always contains the possibility of suspension, which means\nthat even the most democratic of nations (the United States for\nexample) resembles a “rogue state” or perhaps is the most\n“roguish” of all states. Based on lectures first presented\nduring the summer of 1998,The Animal that Therefore I am)\nappeared as the first posthumous work in 2006; concerning animality,\nit indicates Derrida’s continuous interest in the question of\nlife. We see this interest in life also in Derrida’s lectures on\nthe death penalty, where he questions the meaning of cruelty (which is\nmore cruel, the death penalty or life in prison?). Animal life and\npower is the theme of Derrida’s last lecture courses on\n“The Beast and the Sovereign.” (For a study of this final\ncourse, see Krell 2013.)\n\nSometime in 2002, Derrida was diagnosed with pancreatic cancer. He\ndied on October 8, 2004. Since his death two biographies have appeared\n(Powell 2006 and Peeters 2013).\n2. “The Incorruptibles”\n\nAs we noted, Derrida became famous at the end of the 1960s, with the\npublication of three books in 1967. At this time, other great books\nappear: Foucault’s Les mots et les choses (The\nOrder of Things is the English language title) in 1966;\nDeleuze’s Difference and Repetition in 1968. It is hard\nto deny that the philosophy publications of this epoch indicate that\nwe have before us a kind of philosophical moment (a moment perhaps\ncomparable to the moment of German Idealism at the beginning of the\n19th century). Hélène Cixous calls this\ngeneration of French philosophers “the incorruptibles.” In\nthe last interview Derrida gave (to Le Monde on August 19,\n2004), he provided an interpretation of “the\nincorruptibles”: “By means of metonymy, I call this\napproach [of ‘the incorruptibles’] an intransigent, even\nincorruptible, ethos of writing and thinking …,\nwithout concession even to philosophy, and not letting public opinion,\nthe media, or the phantasm of an intimidating readership frighten or\nforce us into simplifying or repressing. Hence the strict taste for\nrefinement, paradox, and aporia.” Derrida proclaims that today,\nmore than ever, “this predilection [for paradox and aporia]\nremains a requirement.” How are we to understand this\nrequirement, this predilection for “refinement, paradox, and\naporia”?\n\nIn an essay from 1998, “Typewriter Ribbon,” Derrida\ninvestigates the relation of confession to archives. But, before he\nstarts the investigation (which will concern primarily Rousseau), he\nsays, “Let us put in place the premises of our question.”\nHe says, “Will this be possible for us? Will we one day be able\nto, and in a single gesture, to join the thinking of the event to the\nthinking of the machine? Will we be able to think, what is called\nthinking, at one and the same time, both what is happening (we call\nthat an event) and the calculable programming of an automatic\nrepetition (we call that a machine). For that, it would be necessary\nin the future (but there will be no future except on this condition)\nto think both the event and the machine as two compatible or even\nin-dissociable concepts. Today they appear to us to be\nantinomic” (Without Alibi, p. 72). These two concepts\nappear to us to be antinomic because we conceive an event as something\nsingular and non-repeatable. Moreover, Derrida associates this\nsingularity to the living. The living being undergoes a sensation and\nthis sensation (an affect or feeling for example) gets inscribed in\norganic material. The idea of an inscription leads Derrida to the\nother pole. The machine that inscribes is based in repetition;\n“It is destined, that is, to reproduce impassively,\nimperceptibly, without organ or organicity, the received commands. In\na state of anaesthesis, it would obey or command a calculable program\nwithout affect or auto-affection, like an indifferent automaton”\n(Without Alibi, p. 73). The automatic nature of the inorganic\nmachine is not the spontaneity attributed to organic life. It is easy\nto see the incompatibility of the two concepts: organic, living\nsingularity (the event) and inorganic, dead universality (mechanical\nrepetition). Derrida says that, if we can make these two concepts\ncompatible, “you can bet not only (and I insist on not only)\nwill one have produced a new logic, an unheard of conceptual form. In\ntruth, against the background and at the horizon of our present\npossibilities, this new figure would resemble a monster.” The\nmonstrosity of this paradox between event and repetition announces,\nperhaps, another kind of thinking, an impossible thinking: the\nimpossible event (there must be resemblance to the past which cancels\nthe singularity of the event) and the only possible event (since any\nevent in order to be event worthy of its name must be singular and\nnon-resembling). Derrida concludes this discussion by saying:\n“To give up neither the event nor the machine, to subordinate\nneither one to the other, neither to reduce one to the other: this is\nperhaps a concern of thinking that has kept a certain number of\n‘us’ working for the last few decades” (Without\nAlibi, p. 74). This “us” refers to Derrida’s\ngeneration of thinkers: “the incorruptibles.” What Derrida\nsays here defines a general project which consists in trying to\nconceive the relation between machine-like repeatability and\nirreplaceable singularity neither as a relation of externality\n(external as in Descartes’s two substance or as in\nPlatonism’s two worlds) nor as a relation of homogeneity (any\nform of reductionism would suffice here to elucidate a homogeneous\nrelation). Instead, the relation is one in which the elements are\ninternal to one another and yet remain heterogeneous. Derrida’s\nfamous term “différance” (to which we shall return\nbelow) refers to this relation in which machine-like repeatability is\ninternal to irreplaceable singularity and yet the two remain\nheterogeneous to one another.\n\nOf course, Cixous intends with the word “incorruptibles”\nthat the generation of French philosophers who came of age in the\nSixties, what they wrote and did, will never decay, will remain\nendlessly new and interesting. This generation will remain pure. But,\nthe term is particularly appropriate for Derrida, since his thought\nconcerns precisely the idea of purity and therefore contamination.\nContamination, in Derrida, implies that an opposition consisting in\ntwo pure poles separated by an indivisible line never exists. In other\nwords, traditionally (going back to Plato’s myths but also\nChristian theology), we think that there was an original pure state of\nbeing (direct contact with the forms or the Garden of Eden) which\naccidentally became corrupt. In contrast, Derrida tries to show that\nno term or idea or reality is ever pure in this way; one term always\nand necessarily “infects” the other.\n\nNevertheless, for Derrida, a kind of purity remains as a value. In his\n1992 The Monolingualism of the Other, Derrida speaks of his\n“shameful intolerance” for anything but the purity of the\nFrench language (as opposed to French contaminated with English words\nlike “le weekend”). Derrida says, “I still do not\ndare admit this compulsive demand for a purity of language except\nwithin boundaries of which I can be sure: this demand is neither\nethical, political, nor social. It does not inspire any judgment in\nme. It simply exposes me to suffering when someone, who can be myself,\nhappens to fall short of it. I suffer even further when I catch myself\nor am caught ‘red-handed’ in the act. … Above all,\nthis demand remains so inflexible that it sometimes goes beyond the\ngrammatical point of view, it even neglects ‘style’ in\norder to bow to a more hidden rule, to ‘listen’ to the\ndomineering murmur of an order which someone in me flatters himself to\nunderstand, even in situations where he would be the only one to do\nso, in a tête-à-tête with the idiom, the final\ntarget: a last will of the language, in sum, a law of the language\nthat would entrust itself only to me. …I therefore admit to a\npurity which is not very pure. Anything but a purism. It is, at least,\nthe only impure ‘purity’ for which I dare confess a\ntaste” (Monolingualism, p. 46). Derrida’s taste\nfor purity is such that he seeks the idioms of a language. The idioms\nof a language are what make the language singular. An idiom is so pure\nthat we seem unable to translate it out of that language. For example,\nDerrida always connects the French idiom “il faut,”\n“it is necessary,” to “une faute,” “a\nfault” and to “un défaut,” “a\ndefect”; but we cannot make this linguistic connection between\nnecessity and a fault in English. This idiom seems to belong alone to\nFrench; it seems as though it cannot be shared; so far, there is no\nbabble of several languages in the one sole French language. And yet,\neven within one language, an idiom can be shared. Here is another\nFrench idiom: “il y va d’un certain pas.” Even in\nFrench, this idiom can be “translated.” On the one hand,\nif one takes the “il y va” literally, one has a sentence\nabout movement to a place (“y”: there) at a certain pace\n(“un certain pas”: a certain step). On the other hand, if\none takes the “il y va” idiomatically (“il y\nva”: what is at issue), one has a sentence (perhaps more\nphilosophical) about the issue of negation (“un certain\npas”: “a certain kind of not”). This undecidability\nin how to understand an idiom within one sole language indicates that,\nalready in French, in the one French language, there is already\ntranslation and, as Derrida would say, “Babelization.”\nTherefore, for Derrida, “a pure language” means a language\nwhose terms necessarily include a plurality of senses that cannot be\nreduced down to one sense that is the proper meaning. In other words,\nthe taste for purity in Derrida is a taste for impropriety and\ntherefore impurity. The value of purity in Derrida means that anyone\nwho conceives language in terms of proper or pure meanings must be\ncriticized.\n3. Basic Argumentation and its Implications: Time, Hearing-Oneself-Speak, the Secret, and Sovereignty\n\nAlready we are very close to Derrida’s basic argumentation. The\nbasic argumentation always attempts to show that no one is able to\nseparate irreplaceable singularity and machine-like repeatability (or\n“iterability,” as Derrida frequently says) into two\nsubstances that stand outside of one another; nor is anyone able to\nreduce one to the other so that we would have one pure substance (with\nattributes or modifications). Machine-like repeatability and\nirreplaceable singularity, for Derrida, are like two forces that\nattract one another across a limit that is indeterminate and\ndivisible. Yet, to understand the basic argumentation, we must be, as\nDerrida himself says in Rogues, “responsible guardians\nof the heritage of transcendental idealism” (Rogues, p.\n134; see also Limited Inc, p. 93). Kant had of course opened\nup the possibility of this way of philosophizing: arguing back (Kant\ncalled this arguing back a “deduction”) from the givenness\nof experience to the conditions that are necessarily required for the\nway experience is given. These conditions would function as a\nfoundation for all experience. Following Kant (but also Husserl and\nHeidegger), Derrida then is always interested in necessary and\nfoundational conditions of experience.\n\nSo, let us start with the simplest argument that we can formulate. If\nwe reflect on experience in general, what we cannot deny is that\nexperience is conditioned by time. Every experience, necessarily,\ntakes place in the present. In the present experience, there is the\nkernel or point of the now. What is happening right now is a kind of\nevent, different from every other now I have ever experienced. Yet,\nalso in the present, I remember the recent past and I anticipate what\nis about to happen. The memory and the anticipation consist in\nrepeatability. Because what I experience now can be immediately\nrecalled, it is repeatable and that repeatability therefore motivates\nme to anticipate the same thing happening again. Therefore, what is\nhappening right now is also not different from every other\nnow I have ever experienced. At the same time, the present\nexperience is an event and it is not an event because it is\nrepeatable. This “at the same time” is the crux of the\nmatter for Derrida. The conclusion is that we can have no experience\nthat does not essentially and inseparably contain these two agencies\nof event and repeatability.\n\nThis basic argument contains four important implications.\nFirst, experience as the experience of the present is never a\nsimple experience of something present over and against me, right\nbefore my eyes as in an intuition; there is always another agency\nthere. Repeatability contains what has passed away and is no longer\npresent and what is about to come and is not yet present. The\npresent therefore is always complicated by non-presence. Derrida calls\nthis minimal repeatability found in every experience “the\ntrace.” Indeed, the trace is a kind of proto-linguisticality\n(Derrida also calls it “arche-writing”), since language in\nits most minimal determination consists in repeatable forms.\nSecond, the argument has disturbed the traditional structure\nof transcendental philosophy, which consists in a linear relation\nbetween foundational conditions and founded experience. In traditional\ntranscendental philosophy (as in Kant for example), an empirical event\nsuch as what is happening right now is supposed to be\nderivative from or founded upon conditions which are not\nempirical. Yet, Derrida’s basic argument demonstrates that the\nempirical event is a non-separable part of the structural or\nfoundational conditions. Or, in traditional transcendental philosophy,\nthe empirical event is supposed to be an accident that overcomes an\nessential structure. But with Derrida’s argument, we see that\nthis accident cannot be removed or eliminated. We can describe this\nsecond implication in still another way. In traditional philosophy we\nalways speak of a kind of first principle or origin and that origin is\nalways conceived as self-identical (again something like a Garden of\nEden principle). Yet, here we see that the origin is immediately\ndivided, as if the “fall” into division, accidents, and\nempirical events has always already taken place. In Of\nSpirit, Derrida calls this kind of origin\n“origin-heterogeneous”: the origin is heterogeneous\nimmediately (Of Spirit, pp. 107–108). Third,\nif the origin is always heterogeneous, then nothing is ever given\nas such in certainty. Whatever is given is given as other\nthan itself, as already past or as still to come. What becomes\nfoundational therefore in Derrida is this “as”: origin as\nthe heterogeneous “as.” The “as” means that\nthere is no knowledge as such, there is no truth as such, there is no\nperception, no intuition of anything as such. Faith, perjury, and\nlanguage are already there in the origin. Fourth, if\nsomething like a fall has always already taken place, has taken place\nessentially or necessarily, then every experience contains an aspect\nof lateness. It seems as though I am always late for the origin since\nit seems to have always already disappeared. Every experience then is\nalways not quite on time or, as Derrida quotes Hamlet, time is\n“out of joint.” Late in his career, Derrida will call this\ntime being out of joint “anachronism” (see for instance\nOn the Name, p. 94). As we shall see in a moment, anachronism\nfor Derrida is the flip side of what he calls “spacing”\n(espacement); space is out of place. But we should also keep\nin mind, as we move forward that the phrase “out of joint”\nalludes to justice: being out of joint, time is necessarily unjust or\nviolent.\n\nSo far, we can say that the argument is quite simple although it has\nwide-ranging implications. It is based on an analysis of experience,\nbut it is also based in the experience of what Derrida has called\n“auto-affection.” We find the idea of auto-affection (or\nself-affection) in ancient Greek philosophy, for example in\nAristotle’s definition of God as “thought thinking\nitself.” Auto-affection occurs when I affect myself, when the\naffecting is the same as the affected. As we said above, Derrida will\nfrequently write about autobiography as a form of auto-affection or\nself-relation. In the very late The Animal that Therefore I\nam, Derrida tells us what he is trying to do with auto-affection:\n“if the auto-position, the automonstrative autotely of\nthe ‘I,’ even in the human, implies the ‘I’ to\nbe an other that must welcome within itself some irreducible\nhetero-affection (as I [that is, Derrida] have tried to demonstrate\nelsewhere [my emphasis]), then this autonomy of the\n‘I’ can be neither pure nor rigorous; it would not be able\nto form the basis for a simple and linear differentiation of the human\nfrom the animal” (The Animal that Therefore I am, p.\n95). Always, Derrida tries to show that auto-affection is\nhetero-affection; the experience of the same (I am thinking about\nmyself) is the experience of the other (insofar as I think about\nmyself I am thinking of someone or something else at the same time).\nBut, in order to understand more fully the basic argumentation, let us\nlook at three of these “other places” where Derrida has\n“attempted” to show that an irreducible hetero-affection\ninfects auto-affection.\n\nThe first occurs in Voice and Phenomenon, Derrida’s\n1967 study of Husserl. While this is a small book, it aims to\ncriticize what Husserl calls the “principle of all\nprinciples” for phenomenology, that is, that evidentness is\nbased in an intuition, intuition being different from a sign (Husserl\n2014, 43–44, paragraph 24). In Voice and Phenomenon\nDerrida recognizes that perception, for Husserl, is that of\nadumbrations, with an intentional meaning unifying the different\nprofiles. However, Derrida sees in the principle of all principles and\nin Husserl’s introduction of an Idea in the Kantian sense\n(Husserl 2014, 284–285, paragraph 143) the imposition of a telos\nfor perception towards a pure intuition, pure presence or givenness,\nuncontaminated by signification.\n\nMore specifically, Derrida argues that, when Husserl describes\nlived-experience (Erlebnis), even absolute subjectivity, he\nis speaking of an interior monologue, auto-affection as\nhearing-oneself-speak. According to Derrida, hearing-oneself-speak is,\nfor Husserl, “an auto-affection of an absolutely unique\ntype” (Voice and Phenomenon, p. 67). It is unique\nbecause there seems to be no external detour from the hearing to the\nspeaking; in hearing-oneself-speak there is self-proximity. It seems\ntherefore that I hear myself speak immediately in the very\nmoment that I am speaking. According to Derrida,\nHusserl’s own description of temporalization however undermines\nthe idea that I hear myself speak immediately. On the one hand,\nHusserl describes what he calls the “living present,” the\npresent that I am experiencing right now, and yet Husserl also says\nthat the living present is thick. The living present is thick because\nit includes phases other than the now, in particular, what Husserl\ncalls “protention,” the anticipation (or\n“awaiting,” we might say) of the approaching future and\n“retention,” the memory of the recent past. As is well\nknown, Derrida focuses on the status of retention in Voice and\nPhenomenon. Retention in Husserl has a strange status since\nHusserl wants to include it in the present as a kind of perception and\nat the same time he recognizes that it is different from the present\nas a kind of non-perception. For Derrida, Husserl’s descriptions\nimply that the living present, by always folding the recent past back\ninto itself, by always folding primary memory into the present\nperception, involves a difference in the very middle of it\n(Voice and Phenomenon, p. 56). In other words, in the very\nmoment, when silently I speak to myself, it must be the case that\nthere is a minuscule hiatus differentiating me into the speaker and\ninto the hearer. There must be a hiatus that differentiates me from\nmyself, a hiatus or gap without which I would not be a hearer as\nwell as a speaker. This hiatus also defines the trace, a minimal\nrepeatability. And this hiatus, this fold of repetition, is found in\nthe very moment of hearing-myself-speak. Derrida stresses that\n“moment” or “instant” translates the German\n“Augenblick,” which literally means “blink of the\neye.” When Derrida stresses the literal meaning of\n“Augenblick,” he is in effect “deconstructing”\nauditory auto-affection into visual auto-affection. When I look in the\nmirror, for example, it is necessary that I am “distanced”\nor “spaced” from the mirror. I must be distanced from\nmyself so that I am able to be both seer and seen.\nThe space between, however, remains obstinately invisible.\nRemaining invisible, the space gouges out the eye, blinds it. I see\nmyself over there in the mirror and yet, that self over there is other\nthan me; so, I am not able to see myself as such. What Derrida is\ntrying to demonstrate here is that this “spacing”\n(espacement) or blindness is essentially necessary for all\nforms of auto-affection, even tactile auto-affection which seems to be\nimmediate.\n\nNow, let us go to another “other place,” which can be\nfound in “How to Avoid Speaking.” Here Derrida discusses\nnegative theology by means of the idea of\n“dénégation,” “denegation” or\n“denial.” The French word\n“dénégation” translates Freud’s term\n“Verneinung.” Both words’ prefixes imply an emphasis\nof negation (although the French prefix also implies a negation of a\nnegation). Yet, within psychoanalysis and in particular in Freud, the\nterm ,“Verneinung” implies that when the patient denies a\ndesire or wish, he or she has indicated to the analyst precisely what\nhe or she unconsciously desires or wishes. The denial then functions\nas a sort of disguised confirmation of the analyst’s\ninterpretation of the patient’s symptoms or problem. In short,\nand this is what Derrida is most interested in, psychoanalysis has\nisolated a negation which is in fact an affirmation. The fundamental\nquestion then for negative theology, but also for psychoanalysis, and\nfor Derrida is how to deny and yet also not deny. This\nduality between not telling and telling is why Derrida takes up the\nidea of the secret. In “How to Avoid Speaking,” Derrida\nsays, and this is an important comment for understanding the secret in\nDerrida: “There is a secret of denial\n[dénégation] and a denial\n[dénégation] of the secret. The secret as\nsuch, as secret, separates and already institutes a negativity;\nit is a negation that denies itself. It de-negates itself”\n(Languages of the Unsayable, p. 25, my emphasis). Here\nDerrida speaks of a secret as such. A secret as such is\nsomething that must not be spoken; we then have the first negation:\n“I promise not to give the secret away.” And yet,\nin order to possess a secret really, to have it\nreally, I must tell it to myself. Here we can see the\nrelation of hearing-oneself-speak that we just saw in Voice and\nPhenomenon. Keeping a secret includes necessarily auto-affection:\nI must speak to myself of the secret. We might however say more, we\nmight even say that I am too weak for this speaking of the secret to\nmyself not to happen. I must have a conceptual grasp of it; I have to\nframe a representation of the secret. With the idea of a\nre-presentation (I must present the secret to myself again in\norder to possess it really), we also see retention, repetition, and\nthe trace or a name. A trace of the secret must be formed, in which\ncase, the secret is in principle shareable. If the secret must be\nnecessarily shareable, it is always already shared. In other words, in\norder to frame the representation of the secret, I must negate the\nfirst negation, in which I promised not to tell the secret: I must\ntell the secret to myself as if I were someone else. I thereby make a\nsecond negation, a so to speak “de-” or\n“un-negation,” which means I must break the promise not to\ntell the secret. In order to keep the secret (or the promise), I must\nnecessarily not keep the secret (I must violate the promise). So, I\npossess the secret and do not possess it. This structure has the\nconsequence of there being no secret as such. A secret is\nnecessarily shared. As Derrida says in “How to Avoid\nSpeaking,”\n\nThis denial [dénégation] does not happen [to\nthe secret] by accident; it is essential and originary. … The\nenigma … is the sharing of the secret, and not only shared to\nmy partner in the society but the secret shared within itself, its\n‘own’ partition, which divides the essence of a secret\nthat cannot even appear to one alone except in starting to be lost, to\ndivulge itself, hence to dissimulate itself, as secret, in showing\nitself: dissimulating its dissimulation. There is no secret as such; I\ndeny it. And this is what I confide in secret to whomever allies\nhimself to me. This is the secret of the alliance. (Languages of\nthe Unsayable, p. 25)\n\n\nNow, finally, let us go to one of the most recent of Derrida’s\nwritings, to his 2002 “The Reason of the Strongest,” the\nfirst essay in the book called Rogues. There Derrida is\ndiscussing the United Nations, which he says combines the two\nprinciples of Western political thought: sovereignty and democracy.\nBut, “democracy and sovereignty are at the same time, but also\nby turns, inseparable and in contradiction with one another”\n(Rogues, p. 100). Democracy and sovereignty contradict one\nanother in the following way. And here Derrida is speaking of pure\nsovereignty, the very “essence of sovereignty”\n(Rogues, p. 100). On the one hand, in order to be sovereign,\none must wield power oneself, take responsibility for its use by\noneself, which means that the use of power, if it is to be sovereign,\nmust be silent; the sovereign does not have to give reasons; the\nsovereign must exercise power in secret. In other words, sovereignty\nattempts to possess power indivisibly, it tries not to share,\nand not sharing means contracting power into an instant—the\ninstant of action, of an event, of a singularity. We can see the\noutline here of Derrida’s deconstruction not only of the\nhearing-oneself-speak auto-affection but also of the auto-affection of\nthe promising-to-oneself to keep a secret. On the other hand,\ndemocracy calls for the sovereign to share power, to give reasons, to\nuniversalize. In democracy the use of power therefore is always an\nabuse of power (see Haddad 2013, pp. 51–65). Derrida can also\nsay that sovereignty and democracy are inseparable from one another\n(the contradiction makes them heterogeneous to one another) because\ndemocracy even though it calls for universalization (giving reasons in\nan assembly) also requires force, freedom, a decision, sovereign\npower. For Derrida, in democracy, a decision (the use of power) is\nalways urgent; and yet (here is the contradiction), democracy takes\ntime, democracy makes one wait so that the use of power can be\ndiscussed. Power can never be exercised without its communication; as\nDerrida says, “As soon as I speak to the other, I submit to the\nlaw of giving reason(s), I share a virtually universalizable medium, I\ndivide my authority” (Rogues, p. 101). There must be\nsovereignty, and yet, there can be no use of power without the sharing\nof it through repetition. More precisely, as Derrida says,\n“Since [sovereignty] never succeeds in [not sharing] except in a\ncritical, precarious, and unstable fashion, sovereignty can only\ntend, for a limited time, to reign without sharing. It can\nonly tend toward imperial hegemony. To make use of the time is already\nan abuse” (Rogues, p. 102, Derrida’s emphasis).\nThis tendency defines what Derrida calls “the worst,” a\ntendency toward the complete appropriation or extermination of all the\nothers.\n4. Elaboration of the Basic Argumentation: The Worst and Hospitality\n\nThroughout his career, Derrida elaborates on the basic argumentation\nin many ways. But Derrida always uses the argumentation against one\nidea, which Derrida calls “the worst” (le pire).\nWe can extract a definition of the worst from “Faith and\nKnowledge” (Religion, p. 65). It revolves around an\nambiguous phrase “plus d’un,” which could be\ntranslated in English as “more than one,” “more of\none,” or “no more one.” On the one hand, this phrase\nmeans that in auto-affection, even while it is “auto,” the\nsame, there is more than one; immediately with one, there is two, the\nself and other, and others. On the other hand, it means that there is\na lot more of one, only one, the most one. The worst derives from this\nsecond sense of “plus d’un.” The worst is a\nsuperlative; it is the worst violence. Derrida, it seems,\ndistinguishes the worst violence from what Kant had called\n“radical evil.” Radical evil is literally radical, evil at\nthe root. It consists in the small, “infinitesimal\ndifference” (see Of Grammatology, p. 234) between me\nand an other, even between me and an other in me. Derrida would\ndescribe this infinitesimal hiatus as the address, the\n“à” or the “to”; it is not only\ndifference, across the distance of the address, it is also repetition.\nAnd, it is not only a repetition; this self-divergence is also\nviolence, a rending of oneself, an incision. Derrida’s\nappropriation of Kant’s idea of radical evil has led certain\ncommentators to stress a kind of fundamental atheism in Derrida\ndespite the fact that he seems very interested in religion and faith\n(see Hägglund, 2008, pp. 112–113; for an opposing\nviewpoint, see Caputo, 1999, p. 312). Despite this controversy around\nDerrida’s alleged theism or atheism, it looks as though, for\nhim, radical evil is not absolute evil (see Philosophy in a Time\nof Terror, p. 99). The worst violence occurs when the\nother to which one is related is completely appropriated to\nor completely in one’s self, when an address reaches\nits proper destination, when it reaches only its\nproper destination. Reaching only its proper destination, the\naddress will exclude more, many more, and that “many\nmore,” at the limit, amounts to all. It is this\ncomplete exclusion or this extermination of the most\n– there is no limit to this violence—that makes this\nviolence the worst violence. The worst is a relation that makes of\nmore than one simply one, that makes, out of a division, an\nindivisible sovereignty. We can see again that the worst resembles the\n“pure actuality” of Aristotle’s Prime Mover, the One\nGod: the sphere, or better, the globe of thought thinking\nitself (Rogues, p. 15).\n\nWhat we have just laid out is the structure of the worst in\nDerrida’s thinking. But the structure, for Derrida, can always\nhappen as an event. Derrida thinks that today, “in a time of\nterror,” after the end of the Cold War, when globalization is\ntaking place, the fragility of the nation-state is being tested more\nand more. Agencies such as the International Criminal Court, the\ndemand for universal human rights encroach on nation-state\nsovereignty. But the result of this universalization or\n“worlding” (“mondialisation” is the French\nword for globalization) is that the concept of war, and thus of world\nwar, of enemy, and even of terrorism, along with the distinctions\nbetween civilian and military or between army, police, and militia,\nall of these concepts and distinctions are losing their pertinence. As\nDerrida says here in Rogues “what is called September\n11 will not have created or revealed this situation, although it will\nhave surely media-theatricalized it” (Rogues, pp.\n154–55). Now, with globalization, there is no identifiable enemy\nin the form of a “state” territory with whom one (in\nRogues Derrida uses this phrase: “the United States and\nits allies”) would wage what could still be called a\n“war,” even if we think of this as a war on international\nterrorism. The balance of terror of the Cold War that insured that no\nescalation of nuclear weapons would lead to a suicidal operation,\nDerrida says, “all that is over.” Instead, “a new\nviolence is being prepared and in truth has been unleashed for some\ntime now, in a way that is more visibly suicidal or auto-immune than\never. This violence no longer has to do with world war or\neven with war, even less with some right to wage war. And\nthis is hardly re-assuring – indeed, quite the contrary”\n(Rogues, p. 156).\n\nWhat does it mean to be “more suicidal”? To be more\nsuicidal is to kill oneself more. The “more”\nmeans that, since there is only a fragile distinction between states\n(there is no identification of the enemy), one’s state or self\nincludes more and more of the others. But, if one’s self\nincludes others that threaten (so-called “terrorist\ncells,” for example), then, if one wants to immune oneself, then\none must murder more and more of those others that are inside. Since\nthe others are inside one’s state or one’s self,\none is required to kill more and more of oneself. This context is very\ndifferent from the rigid and external opposition, symbolized by the\nso-called “Iron Curtain,” that defined the Cold War. There\nand then, “we” had an identifiable enemy, with a\nname, which allowed the number of the enemies to be limited.\nBut here and now, today, the number of “enemies” is\npotentially unlimited. Every other is wholly other\n(“tout autre est tout autre” [cf. The\nPolitics of Friendship, p. 232]) and thus every single other\nneeds to be rejected by the immune system. This innumerable rejection\nresembles a genocide or what is worse an absolute threat. The absolute\nthreat can no longer be contained when it comes neither from an\nalready constituted state nor even from a potential state that might\nbe treated as a rogue state (Rogues, p. 105). What Derrida is\nsaying here is that the worst is possible, here and now, more\npossible than ever.\n\nAs I said, Derrida always uses the basic argumentation that we have\nlaid out against the idea of the worst; today the tendency towards the\nworst is greater than ever. The purpose in the application –\nthis purpose defines deconstruction—is to move us towards, not\nthe worst violence, not the most violence, but the least violence\n(Writing and Difference, p. 130). How does the application of\nthe argumentation against the worst work? Along with globalization,\nthe post-Cold War period sees, as Derrida says in “Faith and\nKnowledge,” a “return of the religious”\n(Religion, pp. 42–43; see also Caputo 1997, pp.\n152–159). So, in “Faith and Knowledge,” Derrida lays\nout the etymology of the Latin word “religion” (he\nacknowledges that the etymology is problematic). The etymology implies\nthat there are “two sources” of religion:\n“religio,” which implies a holding back or a being\nunscathed, safe and sound; and “re-legere,” which implies\na linking up with another through faith (Religion, p. 16). We\ncan see in this etymology the inseparable dualities we examined above:\nsingular event and machine-like repeatability; auto-affection as\nhetero-affection. Most importantly, Derrida is trying to understand\nthe “link” that defines religion prior to the link between\nman as such and the divinity of God. What we can see in this attempt\nto conceive the link as it is prior to its determination in terms of\nman and God is an attempt to make the link be as open as possible.\nDerrida is attempting to “un-close,” as much as possible,\nthe sphericity or englobing of thought thinking itself – in\norder to open the link as wide as possible, open it to every single\nother, to any other whatsoever. Throughout his career, Derrida is\nalways interested in the status of animality since it determines the\nlimit between man and others. As his final book demonstrates,\nL’animal que donc je suis, Derrida is attempting to\nopen the link even to animals. Animals are other and, because\n“every other is wholly other” (tout autre est tout\nautre), the link must be open to them too. Here despite the\nimmense influence they have had on his thought, Derrida breaks with\nboth Heidegger and Levinas both of whom did not open the link this\nwide (see Points, p. 279). Here, with the “door”\nor “border” open as wide as possible, we encounter\nDerrida’s idea of “unconditional hospitality,” which\nmeans letting others in no matter what, without asking them for\npapers, without judging them, even when they are uninvited. All are to\nbe treated not as enemies who must be expelled or exterminated, but as\nfriends. Nevertheless, as Derrida constantly stresses, we cannot\nreally identify the friend as such. Unconditional hospitality is\ndangerous.\n\nThis danger explains why unconditional openness of the borders is not\nthe best (as opposed to what we were calling the worst above); it is\nonly the less bad or less evil, the less violence. Indeed, it looks as\nthough the unconditional opening is not possible. There always seems\nto be factual conditions. Among all the others we must decide, we must\nassign them papers, which means that there is always, still,\nnecessarily violence at the borders. At once, in hospitality, there is\nthe force that moves towards to the other to welcome and the force to\nremain unscathed and pulled back from the other, trying to keep the\ndoor closed. Here too, in hospitality, we see Derrida’s idea of\na “messianicity without messiah.” Because letting all the\nothers in is impossible (but we must note that Derrida’s concept\nof possibility or virtuality, of the “perhaps,” is\ncomplicated; see in particular Politics of Friendship, p.\n29), this de-closing is always to come in the future like the messiah\ncoming or coming back (Derrida plays on the French word for the\nfuture, “l’avenir,” which literally means “to\ncome,” “à venir”). We must make one more\npoint. The impossibility of unconditional hospitality means that any\nattempt to open the globe completely is insufficient. Being\ninsufficient, every attempt therefore requires criticism; it must be\n“deconstructed,” as Derrida would say. But this\ndeconstruction would be a deconstruction that recognizes its own\ninsufficiency. Deconstruction, to which we now turn, never therefore\nresults in good conscience, in the good conscience that comes with\nthinking we have done enough to render justice.\n5. Deconstruction\n\nAs we said at the beginning, “deconstruction” is the most\nfamous of Derrida’s terms. He seems to have appropriated the\nterm from Heidegger’s use of “destruction” in\nBeing and Time. But we can get a general sense of what\nDerrida means with deconstruction by recalling Descartes’s First\nMeditation. There Descartes says that for a long time he has been\nmaking mistakes. The criticism of his former beliefs both mistaken and\nvalid aims towards uncovering a “firm and permanent\nfoundation.” The image of a foundation implies that the\ncollection of his former beliefs resembles a building. In the First\nMeditation then, Descartes is in effect taking down this old building,\n“de-constructing” it. We have also seen how much Derrida\nis indebted to traditional transcendental philosophy which really\nstarts here with Descartes’ search for a “firm and\npermanent foundation.” But with Derrida, we know now, the\nfoundation is not a unified self but a divisible limit between myself\nand myself as an other (auto-affection as hetero-affection:\n“origin-heterogeneous”).\n\nDerrida has provided many definitions of deconstruction. But three\ndefinitions are classical. The first is early, being found in\nthe 1971 interview “Positions” and in the 1972 Preface to\nDissemination: deconstruction consists in “two\nphases” (Positions, pp. 41–42,\nDissemination, pp.4–6). At this stage of his career\nDerrida speaks of “metaphysics” as if the Western\nphilosophical tradition was monolithic and homogeneous. At times he\nalso speaks of “Platonism,” as Nietzsche did. Simply,\ndeconstruction is a criticism of Platonism, which is defined by the\nbelief that existence is structured in terms of oppositions (separate\nsubstances or forms) and that the oppositions are hierarchical, with\none side of the opposition being more valuable than the other. The\nfirst phase of deconstruction attacks this belief by\nreversing the Platonistic hierarchies: the hierarchies\nbetween the invisible or intelligible and the visible or sensible;\nbetween essence and appearance; between the soul and body; between\nliving memory and rote memory; between mnēmē and\nhypomnēsis; between voice and writing; between finally\ngood and evil. In order to clarify deconstruction’s “two\nphases,” let us restrict ourselves to one specific opposition,\nthe opposition between appearance and essence. Prior to Derrida,\nNietzsche had also criticized this opposition, and it is criticized in\na lot of Twentieth Century philosophy. So, in Platonism, essence is\nmore valuable than appearance. In deconstruction however, we reverse\nthis, making appearance more valuable than essence. How? Here we could\nresort to empiricist arguments (in Hume for example) that show that\nall knowledge of what we call essence depends on the experience of\nwhat appears. But then, this argumentation would imply that essence\nand appearance are not related to one another as separate oppositional\npoles. The argumentation in other words would show us that essence can\nbe reduced down to a variation of appearances (involving the roles of\nmemory and anticipation). The reduction is a reduction to what we can\ncall “immanence,” which carries the sense of\n“within” or “in.” So, we would say that what\nwe used to call essence is found in appearance, essence is\nmixed into appearance. Now, we can back track a bit in the\nhistory of Western metaphysics. On the basis of the reversal of the\nessence-appearance hierarchy and on the basis of the reduction to\nimmanence, we can see that something like a decision (a perhaps\nimpossible decision) must have been made at the beginning of the\nmetaphysical tradition, a decision that instituted the hierarchy of\nessence-appearance and separated essence from appearance. This\ndecision is what really defines Platonism or\n“metaphysics.” After this retrospection, we can turn now\nto a second step in the reversal-reduction of Platonism, which is the\nsecond “phase” of deconstruction. The previously inferior\nterm must be re-inscribed as the “origin” or\n“resource” of the opposition and hierarchy itself. How\nwould this re-inscription or redefinition of appearance work? Here we\nwould have to return to the idea that every appearance or every\nexperience is temporal. In the experience of the present, there is\nalways a small difference between the moment of now-ness and the past\nand the future. (It is perhaps possible that Hume had already\ndiscovered this small difference when, in the Treatise, he\nspeaks of the idea of relation.) In any case, this infinitesimal\ndifference is not only a difference that is non-dualistic, but also it\nis a difference that is, as Derrida would say,\n“undecidable.” Although the minuscule difference is\nvirtually unnoticeable in everyday common experience, when we in fact\nnotice it, we cannot decide if we are experiencing a memory\nor a present perception, if we are experiencing a present perception\nor an anticipation. (Bergson makes a similar claim in his\n“Memory of the Present and False Recognition”\n[Mind-Energy, pp. 109–151] and Deleuze extends\nBergson’s insight in his “The Actual and the\nVirtual” [Dialogues, pp. 148–152].) When we\nnotice the difference, we are indeed experiencing the present, but the\npresent is recognized as “contaminated” by the past and\nfuture. Insofar as the difference is undecidable (perception –\nwhat we see right now – contaminated with memory or the present\ncontaminated with the past: the experienced difference is an\nexperience of what Derrida would call the “trace”), the\ndifference destabilizes the original decision that instituted the\nhierarchy. After the redefinition of the previously inferior term,\nDerrida usually changes the term’s orthography, for example,\nwriting “différence” with an “a” as\n“différance” in order to indicate the\nchange in its status. Différance (which is found in appearances\nwhen we recognize their temporal nature) then refers to the\nundecidable resource into which “metaphysics”\n“cut” in order to makes its decision. In\n“Positions,” Derrida calls names like\n“différance” “old names” or\n“paleonyms,” and there he also provides a list of these\n“old terms”: “pharmakon”;\n“supplement”; “trace”; “hymen”;\n“gram”; “spacing”; and “incision”\n(Positions, p. 43). These names are old because, like the\nword “appearance” or the word “difference,”\nthey have been used for centuries in the history of Western philosophy\nto refer to the inferior position in hierarchies. But now, they are\nbeing used to refer to the resource that has never had a name in\n“metaphysics”; they are being used to refer to the\nresource that is indeed “older” than the metaphysical\ndecision.\n\nThis first definition of deconstruction as two phases gives way to the\nrefinement we find in the “Force of Law” (which dates from\n1989–1990). This second definition is less metaphysical\nand more political. In “Force of Law,” Derrida says that\ndeconstruction is practiced in two styles (Deconstruction and the\nPossibility of Justice, p. 21). These “two styles” do\nnot correspond to the “two phases” in the earlier\ndefinition of deconstruction. On the one hand, there is the\ngenealogical style of deconstruction, which recalls the history of a\nconcept or theme. Earlier in his career, in Of Grammatology,\nDerrida had laid out, for example, the history of the concept of\nwriting. But now what is at issue is the history of justice. On the\nother hand, there is the more formalistic or structural style of\ndeconstruction, which examines a-historical paradoxes or aporias. In\n“Force of Law,” Derrida lays out three aporias, although\nthey all seem to be variants of one, an aporia concerning the unstable\nrelation between law (the French term is “droit,” which\nalso means “right”) and justice.\n\nDerrida calls the first aporia, “the epoche of\nthe rule” (Deconstruction and the Possibility of\nJustice, pp. 22–23). Our most common axiom in ethical or\npolitical thought is that to be just or unjust and to exercise\njustice, one must be free and responsible for one’s actions and\ndecisions. Here Derrida in effect is asking: what is freedom. On the\none hand, freedom consists in following a rule; but in the case of\njustice, we would say that a judgment that simply followed the law was\nonly right, not just. For a decision to be just, not only must a judge\nfollow a rule but also he or she must “re-institute” it,\nin a new judgment. Thus a decision aiming at justice (a free decision)\nis both regulated and unregulated. The law must be conserved and also\ndestroyed or suspended, suspension being the meaning of the\nword “epoche.” Each case is other, each decision is\ndifferent and requires an absolutely unique interpretation which no\nexisting coded rule can or ought to guarantee. If a judge\nprogrammatically follows a code, he or she is a “calculating\nmachine.” Strict calculation or arbitrariness, one or the other\nis unjust, but they are both involved; thus, in the present, we cannot\nsay that a judgment, a decision is just, purely just. For Derrida, the\n“re-institution” of the law in a unique decision is a kind\nof violence since it does not conform perfectly to the instituted\ncodes; the law is always, according to Derrida, founded in violence.\nThe violent re-institution of the law means that justice is\nimpossible. Derrida calls the second aporia “the ghost\nof the undecidable” (Deconstruction and the Possibility of\nJustice, pp. 24–26). A decision begins with the initiative\nto read, to interpret, and even to calculate. But to make such a\ndecision, one must first of all experience what Derrida calls\n“undecidability.” One must experience that the case, being\nunique and singular, does not fit the established codes and therefore\na decision about it seems to be impossible. The undecidable, for\nDerrida, is not mere oscillation between two significations. It is the\nexperience of what, though foreign to the calculable and the rule, is\nstill obligated. We are obligated – this is a kind of\nduty—to give oneself up to the impossible decision, while taking\naccount of rules and law. As Derrida says, “A decision that did\nnot go through the ordeal of the undecidable would not be a free\ndecision, it would only be the programmable application or unfolding\nof a calculable process” (Deconstruction and the Possibility\nof Justice, p. 24). And once the ordeal is past (“if this\never happens,” as Derrida says), then the decision has again\nfollowed or given itself a rule and is no longer presently just.\nJustice therefore is always to come in the future, it is never\npresent. There is apparently no moment during which a decision could\nbe called presently and fully just. Either it has not followed a rule,\nhence it is unjust; or it has followed a rule, which has no\nfoundation, which makes it again unjust; or if it did follow\na rule, it was calculated and again unjust since it did not\nrespect the singularity of the case. This relentless injustice is why\nthe ordeal of the undecidable is never past. It keeps coming back like\na “phantom,” which “deconstructs from the inside\nevery assurance of presence, and thus every criteriology that would\nassure us of the justice of the decision” (Deconstruction\nand the Possibility of Justice, pp. 24–25). Even though\njustice is impossible and therefore always to come in or from the\nfuture, justice is not, for Derrida, a Kantian ideal, which brings us\nto the third aporia. The third is called “the urgency\nthat obstructs the horizon of knowledge” (Deconstruction and\nthe Possibility of Justice, pp. 26–28). Derrida stresses\nthe Greek etymology of the word “horizon”: “As its\nGreek name suggests, a horizon is both the opening and limit that\ndefines an infinite progress or a period of waiting.” Justice,\nhowever, even though it is un-presentable, does not wait. A just\ndecision is always required immediately. It cannot furnish itself with\nunlimited knowledge. The moment of decision itself remains a finite\nmoment of urgency and precipitation. The instant of decision is then\nthe moment of madness, acting in the night of non-knowledge and\nnon-rule. Once again we have a moment of irruptive violence. This\nurgency is why justice has no horizon of expectation (either\nregulative or messianic). Justice remains an event yet to come.\nPerhaps one must always say “can-be” (the French word for\n“perhaps” is “peut-être,” which\nliterally means “can be”) for justice. This ability for\njustice aims however towards what is impossible.\n\nEven later in Derrida’s career he will formalize, beyond these\naporias, the nature of deconstruction. The third definition of\ndeconstruction can be found in an essay from 2000 called “Et\nCetera.” Here Derrida in fact presents the principle that\ndefines deconstruction:\n\nEach time that I say ‘deconstruction and X (regardless of the\nconcept or the theme),’ this is the prelude to a very singular\ndivision that turns this X into, or rather makes appear in this X,\nan impossibility that becomes its proper and sole\npossibility, with the result that between the X as possible and the\n‘same’ X as impossible, there is nothing but a relation of\nhomonymy, a relation for which we have to provide an account….\nFor example, here referring myself to demonstrations I have already\nattempted …, gift, hospitality, death itself (and therefore so\nmany other things) can be possible only as impossible, as the\nim-possible, that is, unconditionally (Deconstructions: a\nUser’s Guide, p. 300, my emphasis).\n\n\nEven though the word “deconstruction” has been bandied\nabout, we can see now the kind of thinking in which deconstruction\nengages. It is a kind of thinking that never finds itself at the end.\nJustice – this is undeniable – is impossible (perhaps\njustice is the “impossible”) and therefore it is necessary\nto make justice possible in countless ways.\n\nFinally, with the publication of the death penalty lectures, we have\nanother definition of deconstruct, one also dating from 2000 (lecture\ndated March 1/8, 2000). Here is what Derrida says:\n\nTo deconstruct death, then, that is the subject, while recalling that\nwe do not know what it is, if and when it happens, and to whom. ...\nThe dream of deconstruction, a convulsive movement to have done with\ndeath itself. Not to put into question again the question, what is\ndeath? when and where does it take place? etc. What comes afterward?\nand so forth. But to deconstruct death. Final period. And with the\nsame blow, to come to blows with death and put it out of action. No\nless than that. Death to death (The Death Penalty (Volume 1),\npp. 240–241).\n\n\n“No less than that. Death to death”: This shows us that\nperhaps even more than justice deconstruction values (if we can speak\nof a moral value) life more than anything else. But, this life is not\nunscathed; it is life in its irreducible connection to death. Thus\nwhat deconstruction values is survival.\n",
    "bibliography": {
        "categories": [
            "<a name=\"WorDer\">Primary Literature</a>",
            "<a name=\"RefFurRea\">Secondary Literature</a>"
        ],
        "cat_ref_text": {
            "<a name=\"WorDer\">Primary Literature</a>": [
                "</h3>\n<h4>Works by Derrida</h4>\n<ul class=\"hanging\">",
                "<em>Adieu</em> à <em>Emmanuel Levinas</em>. Paris:\nGalilée, 1997. English translation by Michael Naas and\nPascalle-Anne Brault as <em>Adieu to Emmanuel Levinas</em>, Stanford:\nStanford University Press, 1999.",
                "<em>L’animal que donc je suis</em>, Paris: Galilée,\n2006.",
                "<em>Anne Dufourmantelle invite Jacques Derrida à\nrépondre. De l’hospitalité</em>, Paris:\nCalmann-Lévy, 1997.",
                "<em>Apories</em>, Paris: Galilée, 1996.",
                "<em>L’Archéologie du frivole: Lire Condillac</em>,\nParis: Denoël/Gontheier, 1973.",
                "<em>Béliers</em>, Paris: Galilée, 2003.",
                "<em>Le Calcul des langues</em>, Paris: Seuil, 2020.",
                "<em>La Carte Postale de Socrate à Freud et au-dela</em>,\nParis: Flammarion, 1980.",
                "<em>Chaque fois unique, la fin du monde</em>, Paris:\nGalilée, 2003.",
                "<em>Le “concept” du 11 septembre, Dialogues à\nNew York (octobre-décembre 2001) avec Giovanna Borradori</em>,\nwith Jürgen Habermas, Paris: Galilée, 2004.",
                "<em>Demeure</em>, Paris: Galilée, 1998.",
                "<em>Demeure, Athènes. Photographies de Jean-François\nBonhomme</em>, Paris: Galilée, 2009.",
                "<em>La Dissemination</em>, Paris: Seuil, 1972.",
                "<em>Donner le temps: 1. La fausse monnaie</em>, Paris:\nGalilée, 1991.",
                "<em>Donne le temps II</em>. Paris: Seul, 2021.",
                "<em>Du droit à la philosophie</em>, Paris: Galilée,\n1990.",
                "<em>L’Ecriture et la différence</em>, Paris: Seuil,\n1967.",
                "“Et cetera… (and so on, und so weiter, and so forth,\net ainsi de suite, und so überall, etc.),” in <em>Jacques\nDerrida</em>, edited by Marie-Louise Mallet et Ginette Michaud, Paris:\nEditions de l’Herne, 2004, pp. 21–34.",
                "<em>États d’âme de la psychanalyse</em>, Paris:\nGalilée, 2000.",
                "<em>Foi et savoir suivi de Le siècle et le pardon</em>,\nParis: Seuil, 2001.",
                "<em>Force de loi</em>, Paris: Galilée, 1994.",
                "<em>Glas</em>, Paris: Denoël/Gontheier, 1981 [1974], two\nvolumes.",
                "<em>De la grammatologie</em>, Paris: Minuit, 1967.",
                "<em>De l’esprit</em>, Paris: Galilée, 1987.",
                "<em>Heidegger: la question de l’Être et\nl’Histoire</em>, Cours de l’ENS-Ulm 1964–1965,\nParis: , 2013.",
                "<em>Histoire du mensonge. Prolégomènes</em>, Paris:\nGalilée, 2012.",
                "<em>Hospotalité. Volume 1. Séminaire</em>\n(1995-1996). Paris: Seul, 2021.",
                "“Je suis en guerre contre moi-même,” interview\nin <em>Le Monde</em>, August 19, 2004.",
                "<em>Khôra</em>, Paris: Galilée, 1993.",
                "<em>Limited Inc</em>, Paris: Galilée, 1990.",
                "<em>Marges de la philosophie</em>, Paris: Minuit, 1972.",
                "<em>Memoires for Paul de Man</em>, Paris: Galilée,\n1988.",
                "<em>Le monolinguisme de l’autre</em>, Paris: Galilée,\n1996.",
                "<em>L’Oreille de l’autre: otobiographies, transferts,\ntraductions</em>, Textes et débats avec Jacques Derrida,\nMontreal: VLB, 1982.",
                "Edmund Husserl, <em>L’Origine de la\ngéométrie</em>, traduction et introduction par Jacques\nDerrida, Paris: Presses Universitaires de France, 1974 [1962].",
                "<em>Papier Machine</em>, Paris: Galilée, 2001.",
                "<em>Pardonner. L’impardonnable et\nl’imprescriptible</em>, Paris: Galilée, 2012.",
                "<em>Le Parjure et le pardon</em>: Volume I, <em>Séminaire\n(1997–1998)</em>, Paris: Seuil, 2019.",
                "<em>Le Parjure et le pardon</em>: Volume II, <em>Séminaire\n(1998–1999)</em>, Paris: Seuil, 2020.",
                "<em>Points de suspension, Entretiens</em>, Paris: Galilée,\n1992.",
                "<em>Politiques de l’amitié</em>, Paris:\nGalilée, 1994.",
                "<em>Positions</em>, Paris: Minuit, 1972.",
                "<em>Le Problème de la genèse dans la philosophie de\nHusserl</em>, Paris: Presses Universitaires de France, 1990.",
                "<em>Psyche: Inventions de l’autre</em>, Paris:\nGalilée, 1987.",
                "<em>Psyche: Inventions de l’autre, II</em>, Paris:\nGalilée, 2003.",
                "<em>De quoi demain… Dialogue</em>, Paris:\nFayard/Galilée, 2001.",
                "<em>La Religion</em> (edited with Gianni Vattimo), Paris: Seuil,\n1996.",
                "<em>Sauf le nom</em>, Paris: Galilée, 1993.",
                "<em>Schibboleth pour Paul Celan</em>, Paris: Galilée,\n1986.",
                "<em>Séminaire. Le bête et le souverain. Volume I\n(2001–2002)</em>, Paris: Galilée, 2008.",
                "<em>Séminaire. Le bête et le souverain. Volume II\n(2002–2003)</em>, Paris: Galilée, 2010.",
                "<em>Séminaire. La peine de mort. Volume 1\n(1999–2000)</em>, Paris: Galilée, 2012.",
                "<em>Séminaire. La peine de mort, Volume II\n(2000–2001)</em>, Paris: Galilée, 2015.",
                "<em>Spectres de Marx</em>, Paris: Galilée, 1993.",
                "<em>Théorie et pratique. Cours de l’ENS-Ulm\n1975–1976</em>, Paris: Galilée, 2017.",
                "<em>Le Toucher, Jean-Luc Nancy</em>, Paris: Galilée,\n2000.",
                "<em>La Vérité en peinture</em>, Paris: Flammarion,\n1978.",
                "<em>La Vie la mort. Séminaire (1975–1976)</em>,\nParis: Seuil, 2019.",
                "<em>La Voix et le phénomène</em>, Paris: Presses\nUniversitaires de France, 1983 [1967].",
                "<em>Voyous</em>, Paris: Galilée, 2003.",
                "<em>Ulysse</em> <em>Gramophone</em>, Paris: Galilée,\n1987.\n</ul>\n<h4><a name=\"EngTra\">English translations</a></h4>\n<ul class=\"hanging\">",
                "<em>Acts of Religion</em>, ed., Gil Anidjar, London: Routledge,\n2002.",
                "<em>Adieu to Emmanuel Levinas</em>, trans., Michael Naas and\nPascalle-Anne Brault, Stanford: Stanford University Press, 1999.",
                "<em>Advances</em>, trans. Philippe Lynes. Minneapolis: University\nof Minnesota Press, 2017.",
                "<em>The Animal that Therefore I am</em>, ed., Marie-Loiuse Mallet,\ntrans., David Wills, New York: Fordham University Press, 2008.",
                "<em>Aporias</em>, trans., Thomas Dutoit, Stanford: Stanford\nUniversity Press, 1993.",
                "<em>The Archeology of the Frivolous: Reading Condillac</em>,\ntrans., John P. Leavey, Jr., Pittsburgh: Duquesne University Press,\n1980.",
                "<em>Athens, Still Remains: The Photographs of Jean-Francois\nBonhomme</em>, trans., Pascale-Anne Brault and Michael Naas, New York:\nFordham University Press, 2010.",
                "<em>The Beast and the Sovereign</em> (Volume 1), trans. Geoffrey\nBennigton, Chicago: University of Chicago Press, 2009.",
                "<em>The Beast and the Sovereign</em> (Volume 2), trans. Geoffrey\nBennington, Chicago: University of Chicago, 2011.",
                "<em>Clang: Glas</em>, trans. David Wills and Geoffrey Bennington.\nMinneapolis: University of Minnesota Press, 2021.",
                "<em>The Death Penalty</em> (Volume 1), trans. Peggy Kamuf,\nChicago: University of Chicago Press, 2014.",
                "<em>The Death Penalty</em> (Volume 2), trans. Elizabeth\nRottenberg, Chicago: University of Chicago Press, 2017.",
                "<em>Dissemination</em>, trans., Barbara Johnson, Chicago:\nUniversity of Chicago Press, 1981.",
                "<em>The Ear of the Other: Otobiography, Transference,\nTranslation</em>, trans., Peggy Kamuf, New York: Schocken, 1985.",
                "<em>Edmund Husserl’s Origin of Geometry: An\nIntroduction</em>, trans., John P. Leavey, Jr., Lincoln, NE:\nUniversity of Nebraska Press, 1989 [1978].",
                "“Et Cetera,” translated by Geoff Bennington, in\n<em>Deconstructions: A User’s Guide</em>, edited by Nicolas\nRoyle, London: Palgrave Macmillan, 2000, pp. 282–305.",
                "<em>Eyes of the University: Right to Philosophy 2</em>, Stanford:\nStanford University Press, 2004.",
                "<em>For What Tomorrow … A Dialogue</em>, trans., Jeff Fort\nStanford: Stanford University Press, 2004.",
                "“Force of Law,” trans., Mary Quaintance, in\n<em>Deconstruction and the Possibility of Justice</em>, eds., Drucilla\nCornell, Michael Rosenfeld, and David Gray Carlson, New York:\nRoutledge, 1992, pp. 3–67.",
                "<em>The Gift of Death and Literature in Secret. Second\nEdition</em>, trans., David Wills, Chicago: University of Chicago\nPress, 2008.",
                "<em>Given Time: 1. Counterfeit Money</em>, trans., Peggy Kamuf,\nChicago: University of Chicago, 1992.",
                "<em>Glas</em>, trans., John P. Leavey, Jr. and Richard Rand,\nLincoln: University of Nebraska Press, 1986.",
                "<em>Heidegger: The Question of Being and History</em>, trans.,\nGeoffrey Bennington, Chicago: University of Chicago Press, 2013.",
                "“How to Avoid Speaking: Denials,” translated by Ken\nFrieden, in <em>Languages of the Unsayable</em>, eds., Sanford Budick\nand Wolfgang Iser, New York: Columbia University Press, 1989,\n3–70.",
                "<em>Learning to Live Finally: The Last Interview</em>, trans.,\nPacalle-Ann Brault and Michael Naas, Hoboken, NJ: Meilville House\nPublishing, 2007.",
                "<em>Limited Inc</em>, trans., Samuel Weber, Evanston: Northwestern\nUniversity Press, 1988 [1977].",
                "“Limited Inc,” in <em>Glyph 2: Johns Hopkins Textual\nStudies</em>, 1977, 162–254.",
                "<em>Margins of Philosophy</em>, trans., Alan Bass, Chicago:\nUniversity of Chicago Press, 1982.",
                "<em>Memoirs for Paul de Man</em>, trans., Cecile Lindsay, Jonathan\nCuller, and Eduardo Cadava, New York: Columbia University Press,\n1986.",
                "<em>Monolinguism of the Other</em>, trans., Patrick Mensah,\nStanford: Stanford University Press, 1998.",
                "<em>Of Grammatology</em>, trans., Gayatri Spivak, Baltimore: The\nJohns Hopkins University Press, 1974.",
                "<em>Of Hospitality: Anne Dufourmantelle Invites Jacques Derrida to\nRespond</em>, trans., Rachel Bowlby, Stanford: Stanford University\nPress, 2000.",
                "<em>On the Name</em>, ed., Thomas Dutoit, Stanford: Stanford\nUniversity Press, 1995.",
                "<em>Of Spirit</em>, trans., Rachel Bowlby, Chicago: University of\nChicago, 1989.",
                "<em>On Touching – Jean-Luc Nancy</em>, trans., Christine\nIrizarry, Stanford: Stanford University Press, 2005.",
                "<em>Paper Machine</em>, trans., Rachel Bowlby, Stanford: Stanford\nUniversity Press, 2005.",
                "<em>Philosophy in the Time of Terror: Dialogues with Jürgen\nHabermas and Jacques Derrida</em>, ed., Giovanna Borradori, Chicago:\nUniversity of Chicago Press, 2003.",
                "<em>Points … Interviews, 1974–1994</em>, trans.,\nPeggy Kamuf and others, Stanford: Stanford University Press,\n1995.",
                "<em>Politics of Friendship</em>, trans., George Collins, London:\nVerso, 1997.",
                "<em>Positions</em>, trans., Alan Bass, Chicago: University of\nChicago Press, 1981.",
                "<em>The Postcard from Socrates to Freud and Beyond</em>, trans.,\nAlan Bass, Chicago: University of Chicago Press, 1987.",
                "<em>The Problem of Genesis in Husserl’s Philosophy</em>,\ntrans., Marion Hobson, Chicago: University of Chicago Press,\n2003.",
                "<em>Religion</em>, trans., Samuel Weber,. Stanford: Stanford\nUniversity Press, 1998.",
                "<em>Rogues</em>, trans., Pascale-Anne Brault and Michael Naas,\nStanford: Stanford University Press, 2005.",
                "“Signature Event Context,” in <em>Glyph: Johns Hopkins\nTextual Studies</em>, 1977, 172–197.",
                "<em>Sovereignties in Question: The Poetics of Paul Celan</em>,\neds., Thomas Dutoit and Outi Pasanen, New York: Fordham University\nPress, 2005.",
                "<em>Specters of Marx</em>, trans., Peggy Kamuf, New York:\nRoutledge, 1994.",
                "<em>Theory and Practice</em>, trans. David Wills, Chicago:\nUniversity of Chicago Press, 2019.",
                "<em>The Truth in Painting</em>, trans., Geoff Bennington and Ian\nMcLeod, Chicago: University of Chicago Press, 1987.",
                "<em>Speech and Phenomena</em>, trans., David B. Allison, Evanston,\nIL: Northwestern University Press, 1973.",
                "<em>Voice and Phenomenon</em>, trans., Leonard Lawlor, Evanston,\nIL: Northwestern University Press, 2011.",
                "<em>Without Alibi</em>, edited, translated, and with an\nintroduction by Peggy Kamuf, Stanford: Stanford University Press,\n2002. (The French versions of many of these essays can be found in\n<em>Jacques Derrida</em>, edited by Marie-Louise Mallet et Ginette\nMichaud. Paris: Editions de l’Herne, 2004.)",
                "<em>The Work of Mourning</em>, eds., Pascale-Anne Brault and\nMichael Naas, Chicago: University of Chicago Press, 2001.",
                "<em>Writing and</em> <em>Difference</em>, trans., Alan Bass,\nChicago: University of Chicago, 1978.\n</ul>\n<h3>"
            ],
            "<a name=\"RefFurRea\">Secondary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Bergson, Henri, 1920, <em>Mind-Energy</em>, trans. H. Wildon Carr,\nLondon: Macmillan and Company.",
                "Bernet, Rudolf, 1988, “Husserl’s Theory of Signs\nRevisited,” in <em>Edmund Husserl and the Phenomenological\nTradition</em>, Washington, D.C.: Catholic University of American\nPress, pp. 1–24.",
                "Brough, John, 1993, “Husserl and the Deconstruction of\nTime,” in <em>Review of Metaphysics</em>, 46 (3):\n503–536.",
                "Caputo, John D., 1999, <em>The</em> <em>Prayers and Tears of\nJacques Derrida</em>, Bloomington: Indiana University Press,\n1999.",
                "Cheah, Pheng, and Guerlac, Suzanne, eds., 2009, <em>Derrida and\nthe Time of the Political</em>, Durham: University of North Carolina\nPress.",
                "Cixous, Hélène, and Derrida, Jacques, 2001,\n<em>Veils</em>, trans., Geoff Bennington, Stanford: Stanford\nUniversity Press.",
                "Cornell, Drucilla; Rosenfeld, Michael; and Carlson, David Gray,\neds., 1992, <em>Deconstruction and the Possibility of</em>\n<em>Justice</em>, New York: Routledge.",
                "Cutrofello, Andrew, 2005, <em>Continental Philosophy: A\nContemporary Introduction</em>, New York and London: Routledge.",
                "DeArmitt, Pleshette, and Saghafi, Kas, eds., 2006, <em>Epoche</em>\n(Special Memorial Issue) “An Entrusted Responsibility: Reading\nand Remembering Jacques Derrida,” 10 (2) (Spring).",
                "Deleuze, Gilles, and Claire Parnet, 1987, <em>Dialogues</em>,\ntrans. Hugh Tomlinson and Barbara Habberjam, New York: Columbia\nUniversity Press.",
                "Descombes, Vincent, 1980, <em>Modern French Philosophy</em>,\ntrans., L. Scott-Fox and J.M. Harding, New York: Cambridge University\nPress.",
                "Evans, J. Claude, 1991, <em>Strategies of Deconstruction: Derrida\nand the Myth of the Voice</em>, Minneapolis: University of Minnesota\nPress.",
                "Gasché, Rodolphe, 1994, <em>Inventions of Difference: On\nJacques Derrida</em>, Cambridge, MA: Harvard University Press.",
                "–––, 1999, <em>Of Minimal Things: Studies on the\nNotion of the Relation</em>, Stanford: Stanford University Press.",
                "–––, 1986, <em>The</em> <em>Tain of the Mirror:\nDerrida and the Philosophy of Reflection</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "Gutting, Gary, 2001, <em>French Philosophy in the Twentieth\nCentury</em>, New York: Cambridge University Press.",
                "Haddad, Samir, 2013, <em>Derrida and the Inheritance of\nDemocracy</em>, Bloomington: Indiana University Press.",
                "Hägglund, Martin, 2008, <em>Radical Atheism: Derrida and the\nTime of Live</em>, Stanford: Stanford University Press.",
                "Husserl, Edmund, 2014, <em>Ideas I</em>, tr. Daniel O. Dahlstrom,\nIndianapolis: Hackett Publishing Company.",
                "Krell, David Farrell, 2013, <em>Derrida and our Animal Others:\nDerrida’s Final Seminar, “The Beast and the\nSovereign”</em>, Bloomington: Indiana University Press.",
                "Lawlor, Leonard, ed., 1994, “Spindel Conference 1993:\nDerrida’s Interpretation of Husserl,” <em>The Southern\nJournal of Philosophy</em> (Supplement), Volume 22.",
                "–––, 2002, <em>Derrida and Husserl: The Basic\nProblem of Phenomenology</em>, Bloomington: Indiana University\nPress.",
                "–––, 2007, <em>This is not Sufficient: An Essay\non Animality and Human Nature in Derrida</em>, New York: Columbia\nUniversity Press.",
                "Mitchell, W.J.T., and Davidson, Arnold, eds., 2007, <em>The Late\nDerrida</em>, Chicago: University of Chicago Press.",
                "Mohanty, Jitendranath, 1997, <em>Phenomenology: Between\nEssentialism and Transcendental Philosophy</em>, Evanston:\nNorthwestern University Press.",
                "–––, 2003, <em>Taking on the Tradition: Jacques\nDerrida and the Legacies of Deconstruction</em>, Stanford, CA:\nStanford University Press.",
                "Naas, Michael, 2008, <em>Derrida from now on</em>, Bronx, NY:\nFordham University Press.",
                "–––, 2012, <em>Miracles and Machine: Jacques\nDerrida and the Two Sources of Religion, Science, and Media</em>,\nBronx, NY: Fordham University Press.",
                "–––, 2015, <em>The End of the World and other\nTeachable Moments: Jacques Derrida’s Final Seminar</em>, Bronx,\nNY: Fordham University Press.",
                "Peeters, Benoist, 2013, <em>Derrida: A Biography</em>, trans.,\nAndrew Brown, Cambridge: Polity Press.",
                "Powell, Jason, 2006, <em>Derrida: A Biography</em>, London:\nContinuum.",
                "Royle, Nicolas, 2000, <em>Deconstruction: A User’s\nGuide</em>, London: Palgrave Macmillan.",
                "Saghafi, Kas, 2010, <em>Apparitions – Of Derrida’s\nOther</em>, New York: Fordham University Press.",
                "Sallis, John, ed., 1987, <em>Deconstruction and Philosophy</em>,\nChicago: University of Chicago Press.",
                "Salmon, Peter, 2020, <em>An Event Perhaps: A Biography of Jacques\nDerrida</em>, London: Verso.",
                "Schrift, Alan, 2006, <em>Twentieth Century French Philosophy: Key\nThemes and Thinkers</em>, Oxford: Blackwell Publishing.",
                "Searle, John, 1977, “Reiterating the Differences: A Reply to\nDerrida,” in <em>Glyph: Johns Hopkins Textual Studies</em>,\n198–208.",
                "Wood, David, ed., 1994, <em>Derrida: A Critical Reader</em>,\nCambridge, MA: Blackwell.",
                "–––, ed., 1993, <em>Of Derrida, Heidegger, and\nSpirit</em>, Evanston: Northwestern University Press.",
                "Wood, David, and Bernasconi, Robert, eds., 1988, <em>Derrida and\nDifférance</em>, Evanston: Northwestern University Press.",
                "Zahavi, Dan, 1999, <em>Self-Awareness and Alterity</em>, Evanston:\nNorthwestern University Press.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"WorDer\">Primary Literature</a></h3>\n<h4>Works by Derrida</h4>\n<ul class=\"hanging\">\n<li><em>Adieu</em> à <em>Emmanuel Levinas</em>. Paris:\nGalilée, 1997. English translation by Michael Naas and\nPascalle-Anne Brault as <em>Adieu to Emmanuel Levinas</em>, Stanford:\nStanford University Press, 1999.</li>\n<li><em>L’animal que donc je suis</em>, Paris: Galilée,\n2006.</li>\n<li><em>Anne Dufourmantelle invite Jacques Derrida à\nrépondre. De l’hospitalité</em>, Paris:\nCalmann-Lévy, 1997.</li>\n<li><em>Apories</em>, Paris: Galilée, 1996.</li>\n<li><em>L’Archéologie du frivole: Lire Condillac</em>,\nParis: Denoël/Gontheier, 1973.</li>\n<li><em>Béliers</em>, Paris: Galilée, 2003.</li>\n<li><em>Le Calcul des langues</em>, Paris: Seuil, 2020.</li>\n<li><em>La Carte Postale de Socrate à Freud et au-dela</em>,\nParis: Flammarion, 1980.</li>\n<li><em>Chaque fois unique, la fin du monde</em>, Paris:\nGalilée, 2003.</li>\n<li><em>Le “concept” du 11 septembre, Dialogues à\nNew York (octobre-décembre 2001) avec Giovanna Borradori</em>,\nwith Jürgen Habermas, Paris: Galilée, 2004.</li>\n<li><em>Demeure</em>, Paris: Galilée, 1998.</li>\n<li><em>Demeure, Athènes. Photographies de Jean-François\nBonhomme</em>, Paris: Galilée, 2009.</li>\n<li><em>La Dissemination</em>, Paris: Seuil, 1972.</li>\n<li><em>Donner le temps: 1. La fausse monnaie</em>, Paris:\nGalilée, 1991.</li>\n<li><em>Donne le temps II</em>. Paris: Seul, 2021.</li>\n<li><em>Du droit à la philosophie</em>, Paris: Galilée,\n1990.</li>\n<li><em>L’Ecriture et la différence</em>, Paris: Seuil,\n1967.</li>\n<li>“Et cetera… (and so on, und so weiter, and so forth,\net ainsi de suite, und so überall, etc.),” in <em>Jacques\nDerrida</em>, edited by Marie-Louise Mallet et Ginette Michaud, Paris:\nEditions de l’Herne, 2004, pp. 21–34.</li>\n<li><em>États d’âme de la psychanalyse</em>, Paris:\nGalilée, 2000.</li>\n<li><em>Foi et savoir suivi de Le siècle et le pardon</em>,\nParis: Seuil, 2001.</li>\n<li><em>Force de loi</em>, Paris: Galilée, 1994.</li>\n<li><em>Glas</em>, Paris: Denoël/Gontheier, 1981 [1974], two\nvolumes.</li>\n<li><em>De la grammatologie</em>, Paris: Minuit, 1967.</li>\n<li><em>De l’esprit</em>, Paris: Galilée, 1987.</li>\n<li><em>Heidegger: la question de l’Être et\nl’Histoire</em>, Cours de l’ENS-Ulm 1964–1965,\nParis: , 2013.</li>\n<li><em>Histoire du mensonge. Prolégomènes</em>, Paris:\nGalilée, 2012.</li>\n<li><em>Hospotalité. Volume 1. Séminaire</em>\n(1995-1996). Paris: Seul, 2021.</li>\n<li>“Je suis en guerre contre moi-même,” interview\nin <em>Le Monde</em>, August 19, 2004.</li>\n<li><em>Khôra</em>, Paris: Galilée, 1993.</li>\n<li><em>Limited Inc</em>, Paris: Galilée, 1990.</li>\n<li><em>Marges de la philosophie</em>, Paris: Minuit, 1972.</li>\n<li><em>Memoires for Paul de Man</em>, Paris: Galilée,\n1988.</li>\n<li><em>Le monolinguisme de l’autre</em>, Paris: Galilée,\n1996.</li>\n<li><em>L’Oreille de l’autre: otobiographies, transferts,\ntraductions</em>, Textes et débats avec Jacques Derrida,\nMontreal: VLB, 1982.</li>\n<li>Edmund Husserl, <em>L’Origine de la\ngéométrie</em>, traduction et introduction par Jacques\nDerrida, Paris: Presses Universitaires de France, 1974 [1962].</li>\n<li><em>Papier Machine</em>, Paris: Galilée, 2001.</li>\n<li><em>Pardonner. L’impardonnable et\nl’imprescriptible</em>, Paris: Galilée, 2012.</li>\n<li><em>Le Parjure et le pardon</em>: Volume I, <em>Séminaire\n(1997–1998)</em>, Paris: Seuil, 2019.</li>\n<li><em>Le Parjure et le pardon</em>: Volume II, <em>Séminaire\n(1998–1999)</em>, Paris: Seuil, 2020.</li>\n<li><em>Points de suspension, Entretiens</em>, Paris: Galilée,\n1992.</li>\n<li><em>Politiques de l’amitié</em>, Paris:\nGalilée, 1994.</li>\n<li><em>Positions</em>, Paris: Minuit, 1972.</li>\n<li><em>Le Problème de la genèse dans la philosophie de\nHusserl</em>, Paris: Presses Universitaires de France, 1990.</li>\n<li><em>Psyche: Inventions de l’autre</em>, Paris:\nGalilée, 1987.</li>\n<li><em>Psyche: Inventions de l’autre, II</em>, Paris:\nGalilée, 2003.</li>\n<li><em>De quoi demain… Dialogue</em>, Paris:\nFayard/Galilée, 2001.</li>\n<li><em>La Religion</em> (edited with Gianni Vattimo), Paris: Seuil,\n1996.</li>\n<li><em>Sauf le nom</em>, Paris: Galilée, 1993.</li>\n<li><em>Schibboleth pour Paul Celan</em>, Paris: Galilée,\n1986.</li>\n<li><em>Séminaire. Le bête et le souverain. Volume I\n(2001–2002)</em>, Paris: Galilée, 2008.</li>\n<li><em>Séminaire. Le bête et le souverain. Volume II\n(2002–2003)</em>, Paris: Galilée, 2010.</li>\n<li><em>Séminaire. La peine de mort. Volume 1\n(1999–2000)</em>, Paris: Galilée, 2012.</li>\n<li><em>Séminaire. La peine de mort, Volume II\n(2000–2001)</em>, Paris: Galilée, 2015.</li>\n<li><em>Spectres de Marx</em>, Paris: Galilée, 1993.</li>\n<li><em>Théorie et pratique. Cours de l’ENS-Ulm\n1975–1976</em>, Paris: Galilée, 2017.</li>\n<li><em>Le Toucher, Jean-Luc Nancy</em>, Paris: Galilée,\n2000.</li>\n<li><em>La Vérité en peinture</em>, Paris: Flammarion,\n1978.</li>\n<li><em>La Vie la mort. Séminaire (1975–1976)</em>,\nParis: Seuil, 2019.</li>\n<li><em>La Voix et le phénomène</em>, Paris: Presses\nUniversitaires de France, 1983 [1967].</li>\n<li><em>Voyous</em>, Paris: Galilée, 2003.</li>\n<li><em>Ulysse</em> <em>Gramophone</em>, Paris: Galilée,\n1987.</li>\n</ul>\n<h4><a name=\"EngTra\">English translations</a></h4>\n<ul class=\"hanging\">\n<li><em>Acts of Religion</em>, ed., Gil Anidjar, London: Routledge,\n2002.</li>\n<li><em>Adieu to Emmanuel Levinas</em>, trans., Michael Naas and\nPascalle-Anne Brault, Stanford: Stanford University Press, 1999.</li>\n<li><em>Advances</em>, trans. Philippe Lynes. Minneapolis: University\nof Minnesota Press, 2017.</li>\n<li><em>The Animal that Therefore I am</em>, ed., Marie-Loiuse Mallet,\ntrans., David Wills, New York: Fordham University Press, 2008.</li>\n<li><em>Aporias</em>, trans., Thomas Dutoit, Stanford: Stanford\nUniversity Press, 1993.</li>\n<li><em>The Archeology of the Frivolous: Reading Condillac</em>,\ntrans., John P. Leavey, Jr., Pittsburgh: Duquesne University Press,\n1980.</li>\n<li><em>Athens, Still Remains: The Photographs of Jean-Francois\nBonhomme</em>, trans., Pascale-Anne Brault and Michael Naas, New York:\nFordham University Press, 2010.</li>\n<li><em>The Beast and the Sovereign</em> (Volume 1), trans. Geoffrey\nBennigton, Chicago: University of Chicago Press, 2009.</li>\n<li><em>The Beast and the Sovereign</em> (Volume 2), trans. Geoffrey\nBennington, Chicago: University of Chicago, 2011.</li>\n<li><em>Clang: Glas</em>, trans. David Wills and Geoffrey Bennington.\nMinneapolis: University of Minnesota Press, 2021.</li>\n<li><em>The Death Penalty</em> (Volume 1), trans. Peggy Kamuf,\nChicago: University of Chicago Press, 2014.</li>\n<li><em>The Death Penalty</em> (Volume 2), trans. Elizabeth\nRottenberg, Chicago: University of Chicago Press, 2017.</li>\n<li><em>Dissemination</em>, trans., Barbara Johnson, Chicago:\nUniversity of Chicago Press, 1981.</li>\n<li><em>The Ear of the Other: Otobiography, Transference,\nTranslation</em>, trans., Peggy Kamuf, New York: Schocken, 1985.</li>\n<li><em>Edmund Husserl’s Origin of Geometry: An\nIntroduction</em>, trans., John P. Leavey, Jr., Lincoln, NE:\nUniversity of Nebraska Press, 1989 [1978].</li>\n<li>“Et Cetera,” translated by Geoff Bennington, in\n<em>Deconstructions: A User’s Guide</em>, edited by Nicolas\nRoyle, London: Palgrave Macmillan, 2000, pp. 282–305.</li>\n<li><em>Eyes of the University: Right to Philosophy 2</em>, Stanford:\nStanford University Press, 2004.</li>\n<li><em>For What Tomorrow … A Dialogue</em>, trans., Jeff Fort\nStanford: Stanford University Press, 2004.</li>\n<li>“Force of Law,” trans., Mary Quaintance, in\n<em>Deconstruction and the Possibility of Justice</em>, eds., Drucilla\nCornell, Michael Rosenfeld, and David Gray Carlson, New York:\nRoutledge, 1992, pp. 3–67.</li>\n<li><em>The Gift of Death and Literature in Secret. Second\nEdition</em>, trans., David Wills, Chicago: University of Chicago\nPress, 2008.</li>\n<li><em>Given Time: 1. Counterfeit Money</em>, trans., Peggy Kamuf,\nChicago: University of Chicago, 1992.</li>\n<li><em>Glas</em>, trans., John P. Leavey, Jr. and Richard Rand,\nLincoln: University of Nebraska Press, 1986.</li>\n<li><em>Heidegger: The Question of Being and History</em>, trans.,\nGeoffrey Bennington, Chicago: University of Chicago Press, 2013.</li>\n<li>“How to Avoid Speaking: Denials,” translated by Ken\nFrieden, in <em>Languages of the Unsayable</em>, eds., Sanford Budick\nand Wolfgang Iser, New York: Columbia University Press, 1989,\n3–70.</li>\n<li><em>Learning to Live Finally: The Last Interview</em>, trans.,\nPacalle-Ann Brault and Michael Naas, Hoboken, NJ: Meilville House\nPublishing, 2007.</li>\n<li><em>Limited Inc</em>, trans., Samuel Weber, Evanston: Northwestern\nUniversity Press, 1988 [1977].</li>\n<li>“Limited Inc,” in <em>Glyph 2: Johns Hopkins Textual\nStudies</em>, 1977, 162–254.</li>\n<li><em>Margins of Philosophy</em>, trans., Alan Bass, Chicago:\nUniversity of Chicago Press, 1982.</li>\n<li><em>Memoirs for Paul de Man</em>, trans., Cecile Lindsay, Jonathan\nCuller, and Eduardo Cadava, New York: Columbia University Press,\n1986.</li>\n<li><em>Monolinguism of the Other</em>, trans., Patrick Mensah,\nStanford: Stanford University Press, 1998.</li>\n<li><em>Of Grammatology</em>, trans., Gayatri Spivak, Baltimore: The\nJohns Hopkins University Press, 1974.</li>\n<li><em>Of Hospitality: Anne Dufourmantelle Invites Jacques Derrida to\nRespond</em>, trans., Rachel Bowlby, Stanford: Stanford University\nPress, 2000.</li>\n<li><em>On the Name</em>, ed., Thomas Dutoit, Stanford: Stanford\nUniversity Press, 1995.</li>\n<li><em>Of Spirit</em>, trans., Rachel Bowlby, Chicago: University of\nChicago, 1989.</li>\n<li><em>On Touching – Jean-Luc Nancy</em>, trans., Christine\nIrizarry, Stanford: Stanford University Press, 2005.</li>\n<li><em>Paper Machine</em>, trans., Rachel Bowlby, Stanford: Stanford\nUniversity Press, 2005.</li>\n<li><em>Philosophy in the Time of Terror: Dialogues with Jürgen\nHabermas and Jacques Derrida</em>, ed., Giovanna Borradori, Chicago:\nUniversity of Chicago Press, 2003.</li>\n<li><em>Points … Interviews, 1974–1994</em>, trans.,\nPeggy Kamuf and others, Stanford: Stanford University Press,\n1995.</li>\n<li><em>Politics of Friendship</em>, trans., George Collins, London:\nVerso, 1997.</li>\n<li><em>Positions</em>, trans., Alan Bass, Chicago: University of\nChicago Press, 1981.</li>\n<li><em>The Postcard from Socrates to Freud and Beyond</em>, trans.,\nAlan Bass, Chicago: University of Chicago Press, 1987.</li>\n<li><em>The Problem of Genesis in Husserl’s Philosophy</em>,\ntrans., Marion Hobson, Chicago: University of Chicago Press,\n2003.</li>\n<li><em>Religion</em>, trans., Samuel Weber,. Stanford: Stanford\nUniversity Press, 1998.</li>\n<li><em>Rogues</em>, trans., Pascale-Anne Brault and Michael Naas,\nStanford: Stanford University Press, 2005.</li>\n<li>“Signature Event Context,” in <em>Glyph: Johns Hopkins\nTextual Studies</em>, 1977, 172–197.</li>\n<li><em>Sovereignties in Question: The Poetics of Paul Celan</em>,\neds., Thomas Dutoit and Outi Pasanen, New York: Fordham University\nPress, 2005.</li>\n<li><em>Specters of Marx</em>, trans., Peggy Kamuf, New York:\nRoutledge, 1994.</li>\n<li><em>Theory and Practice</em>, trans. David Wills, Chicago:\nUniversity of Chicago Press, 2019.</li>\n<li><em>The Truth in Painting</em>, trans., Geoff Bennington and Ian\nMcLeod, Chicago: University of Chicago Press, 1987.</li>\n<li><em>Speech and Phenomena</em>, trans., David B. Allison, Evanston,\nIL: Northwestern University Press, 1973.</li>\n<li><em>Voice and Phenomenon</em>, trans., Leonard Lawlor, Evanston,\nIL: Northwestern University Press, 2011.</li>\n<li><em>Without Alibi</em>, edited, translated, and with an\nintroduction by Peggy Kamuf, Stanford: Stanford University Press,\n2002. (The French versions of many of these essays can be found in\n<em>Jacques Derrida</em>, edited by Marie-Louise Mallet et Ginette\nMichaud. Paris: Editions de l’Herne, 2004.)</li>\n<li><em>The Work of Mourning</em>, eds., Pascale-Anne Brault and\nMichael Naas, Chicago: University of Chicago Press, 2001.</li>\n<li><em>Writing and</em> <em>Difference</em>, trans., Alan Bass,\nChicago: University of Chicago, 1978.</li>\n</ul>\n<h3><a name=\"RefFurRea\">Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Bergson, Henri, 1920, <em>Mind-Energy</em>, trans. H. Wildon Carr,\nLondon: Macmillan and Company.</li>\n<li>Bernet, Rudolf, 1988, “Husserl’s Theory of Signs\nRevisited,” in <em>Edmund Husserl and the Phenomenological\nTradition</em>, Washington, D.C.: Catholic University of American\nPress, pp. 1–24.</li>\n<li>Brough, John, 1993, “Husserl and the Deconstruction of\nTime,” in <em>Review of Metaphysics</em>, 46 (3):\n503–536.</li>\n<li>Caputo, John D., 1999, <em>The</em> <em>Prayers and Tears of\nJacques Derrida</em>, Bloomington: Indiana University Press,\n1999.</li>\n<li>Cheah, Pheng, and Guerlac, Suzanne, eds., 2009, <em>Derrida and\nthe Time of the Political</em>, Durham: University of North Carolina\nPress.</li>\n<li>Cixous, Hélène, and Derrida, Jacques, 2001,\n<em>Veils</em>, trans., Geoff Bennington, Stanford: Stanford\nUniversity Press.</li>\n<li>Cornell, Drucilla; Rosenfeld, Michael; and Carlson, David Gray,\neds., 1992, <em>Deconstruction and the Possibility of</em>\n<em>Justice</em>, New York: Routledge.</li>\n<li>Cutrofello, Andrew, 2005, <em>Continental Philosophy: A\nContemporary Introduction</em>, New York and London: Routledge.</li>\n<li>DeArmitt, Pleshette, and Saghafi, Kas, eds., 2006, <em>Epoche</em>\n(Special Memorial Issue) “An Entrusted Responsibility: Reading\nand Remembering Jacques Derrida,” 10 (2) (Spring).</li>\n<li>Deleuze, Gilles, and Claire Parnet, 1987, <em>Dialogues</em>,\ntrans. Hugh Tomlinson and Barbara Habberjam, New York: Columbia\nUniversity Press.</li>\n<li>Descombes, Vincent, 1980, <em>Modern French Philosophy</em>,\ntrans., L. Scott-Fox and J.M. Harding, New York: Cambridge University\nPress.</li>\n<li>Evans, J. Claude, 1991, <em>Strategies of Deconstruction: Derrida\nand the Myth of the Voice</em>, Minneapolis: University of Minnesota\nPress.</li>\n<li>Gasché, Rodolphe, 1994, <em>Inventions of Difference: On\nJacques Derrida</em>, Cambridge, MA: Harvard University Press.</li>\n<li>–––, 1999, <em>Of Minimal Things: Studies on the\nNotion of the Relation</em>, Stanford: Stanford University Press.</li>\n<li>–––, 1986, <em>The</em> <em>Tain of the Mirror:\nDerrida and the Philosophy of Reflection</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>Gutting, Gary, 2001, <em>French Philosophy in the Twentieth\nCentury</em>, New York: Cambridge University Press.</li>\n<li>Haddad, Samir, 2013, <em>Derrida and the Inheritance of\nDemocracy</em>, Bloomington: Indiana University Press.</li>\n<li>Hägglund, Martin, 2008, <em>Radical Atheism: Derrida and the\nTime of Live</em>, Stanford: Stanford University Press.</li>\n<li>Husserl, Edmund, 2014, <em>Ideas I</em>, tr. Daniel O. Dahlstrom,\nIndianapolis: Hackett Publishing Company.</li>\n<li>Krell, David Farrell, 2013, <em>Derrida and our Animal Others:\nDerrida’s Final Seminar, “The Beast and the\nSovereign”</em>, Bloomington: Indiana University Press.</li>\n<li>Lawlor, Leonard, ed., 1994, “Spindel Conference 1993:\nDerrida’s Interpretation of Husserl,” <em>The Southern\nJournal of Philosophy</em> (Supplement), Volume 22.</li>\n<li>–––, 2002, <em>Derrida and Husserl: The Basic\nProblem of Phenomenology</em>, Bloomington: Indiana University\nPress.</li>\n<li>–––, 2007, <em>This is not Sufficient: An Essay\non Animality and Human Nature in Derrida</em>, New York: Columbia\nUniversity Press.</li>\n<li>Mitchell, W.J.T., and Davidson, Arnold, eds., 2007, <em>The Late\nDerrida</em>, Chicago: University of Chicago Press.</li>\n<li>Mohanty, Jitendranath, 1997, <em>Phenomenology: Between\nEssentialism and Transcendental Philosophy</em>, Evanston:\nNorthwestern University Press.</li>\n<li>–––, 2003, <em>Taking on the Tradition: Jacques\nDerrida and the Legacies of Deconstruction</em>, Stanford, CA:\nStanford University Press.</li>\n<li>Naas, Michael, 2008, <em>Derrida from now on</em>, Bronx, NY:\nFordham University Press.</li>\n<li>–––, 2012, <em>Miracles and Machine: Jacques\nDerrida and the Two Sources of Religion, Science, and Media</em>,\nBronx, NY: Fordham University Press.</li>\n<li>–––, 2015, <em>The End of the World and other\nTeachable Moments: Jacques Derrida’s Final Seminar</em>, Bronx,\nNY: Fordham University Press.</li>\n<li>Peeters, Benoist, 2013, <em>Derrida: A Biography</em>, trans.,\nAndrew Brown, Cambridge: Polity Press.</li>\n<li>Powell, Jason, 2006, <em>Derrida: A Biography</em>, London:\nContinuum.</li>\n<li>Royle, Nicolas, 2000, <em>Deconstruction: A User’s\nGuide</em>, London: Palgrave Macmillan.</li>\n<li>Saghafi, Kas, 2010, <em>Apparitions – Of Derrida’s\nOther</em>, New York: Fordham University Press.</li>\n<li>Sallis, John, ed., 1987, <em>Deconstruction and Philosophy</em>,\nChicago: University of Chicago Press.</li>\n<li>Salmon, Peter, 2020, <em>An Event Perhaps: A Biography of Jacques\nDerrida</em>, London: Verso.</li>\n<li>Schrift, Alan, 2006, <em>Twentieth Century French Philosophy: Key\nThemes and Thinkers</em>, Oxford: Blackwell Publishing.</li>\n<li>Searle, John, 1977, “Reiterating the Differences: A Reply to\nDerrida,” in <em>Glyph: Johns Hopkins Textual Studies</em>,\n198–208.</li>\n<li>Wood, David, ed., 1994, <em>Derrida: A Critical Reader</em>,\nCambridge, MA: Blackwell.</li>\n<li>–––, ed., 1993, <em>Of Derrida, Heidegger, and\nSpirit</em>, Evanston: Northwestern University Press.</li>\n<li>Wood, David, and Bernasconi, Robert, eds., 1988, <em>Derrida and\nDifférance</em>, Evanston: Northwestern University Press.</li>\n<li>Zahavi, Dan, 1999, <em>Self-Awareness and Alterity</em>, Evanston:\nNorthwestern University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Deleuze, Gilles",
            "Foucault, Michel",
            "Heidegger, Martin",
            "Husserl, Edmund",
            "Levinas, Emmanuel",
            "phenomenology",
            "postmodernism",
            "Ricoeur, Paul"
        ],
        "entry_link": [
            {
                "../deleuze/": "Deleuze, Gilles"
            },
            {
                "../foucault/": "Foucault, Michel"
            },
            {
                "../heidegger/": "Heidegger, Martin"
            },
            {
                "../husserl/": "Husserl, Edmund"
            },
            {
                "../levinas/": "Levinas, Emmanuel"
            },
            {
                "../phenomenology/": "phenomenology"
            },
            {
                "../postmodernism/": "postmodernism"
            },
            {
                "../ricoeur/": "Ricoeur, Paul"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=derrida\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/derrida/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=derrida&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/derrida/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=derrida": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/derrida/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=derrida&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/derrida/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://hydra.humanities.uci.edu/derrida/\" target=\"other\">Derrida Online</a>",
            "<a href=\"http://derridaseminars.org/\" target=\"other\">Derrida Seminars Translation Project</a>"
        ],
        "listed_links": [
            {
                "http://hydra.humanities.uci.edu/derrida/": "Derrida Online"
            },
            {
                "http://derridaseminars.org/": "Derrida Seminars Translation Project"
            }
        ]
    }
}