{
    "url": "diodorus-cronus",
    "title": "Diodorus Cronus",
    "authorship": {
        "year": "Copyright © 2018",
        "author_text": "David Sedley",
        "author_links": [],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2018</a> by\n\n<br/>\nDavid Sedley\n\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Aug 4, 2009",
        "substantive revision Thu Oct 18, 2018"
    ],
    "preamble": "\n\n\nDiodorus was a pioneering logician, and the most celebrated member of\nthe Dialectical School of the 4th–3rd\nc. BCE.  His contributions to logic—in particular, definitions\nof modal terms and the criteria for a sound conditional—are\ncovered in the article on the Dialectical School (see also Section 2\nof the entry on \n  fatalism). The present article\nadds a conspectus of Diodorus’s other ideas. His use of paradox is at\nleast as prominent in our ancient sources about him as are those\nconstructive contributions to logical theory.\n",
    "toc": [
        {
            "#Lif": "1. Life"
        },
        {
            "#MinMot": "2. Minima and motion"
        },
        {
            "#Sem": "3. Semantics"
        },
        {
            "#PhiPos": "4. Philosophical position"
        },
        {
            "#Inf": "5. Influence"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#ColTesCom": "Collections of testimonia, with commentary"
        },
        {
            "#SecLit": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life\n\n\nDiodorus died around 284 BCE at Alexandria in Egypt. His date of\nbirth is unknown. It used to be common to consider him old enough to\nhave influenced Aristotle (died 322 BCE), but there are no strong\ngrounds for this. The dating was based largely on Aristotle’s\nresponse in Metaphysics Theta 3 to the modal theory of\n‘the Megarics’; but the theory discussed there differs from\nthat of Diodorus, who in any case (see below) should not necessarily be\nassumed to be a Megaric, however great his debt to the school that went\nunder that name. The best evidence tends rather to make Diodorus an\nolder contemporary of, and a living influence on, the first generation\nof the Stoic school, which began life ca 300 BCE. Zeno of\nCitium, the school’s founder, is said to have been\na pupil of Diodorus (among others). Among Zeno’s\nfellow-pupils in Diodorus’s class is reported to have been Philo,\nhimself later a highly original logician in his own right (see\nthe entry on\n Dialectical School \nin this encyclopedia).\n\n\nDiodorus came from Iasos in the eastern Aegean. In terms of\naffiliation he is regularly spoken of in our sources as a\n‘Dialectician’. How distinct this school was from the\n‘Megaric’ school is a matter of dispute, and one testimony\ndoes speak of a certain ‘Diodorus the Megaric’ (see Denyer\n2002), who may well be Diodorus Cronus. But at all events no evidence\nthat we possess associates him in any way with the town of Megara,\nafter which the Megaric school was named. Apart from his birthplace, we\nhear of him as active at Athens in or around the last decade of the\nfourth century, and later at Alexandria. These were the two major\ncultural centres of the age.\n\n\n‘Cronus’ was his nickname, said to have been inherited\nfrom his teacher Apollonius Cronus. It meant roughly ‘old\nfogey’. But Diodorus, far from being an old fogey, comes over as\na rather flamboyant and non-traditional figure. To prove a point about\nthe non-natural character of language (see 3 below), he renamed one of\nhis slaves ‘Allamēn’ (not a randomly chosen sound but\na Greek conjunction favoured by logicians like Diodorus for introducing\nthe minor premise of a syllogism, ‘But now …’). And\nin defiance of the male-centred customs of contemporary philosophical\neducation, he trained all five of his daughters in dialectic. His work\nin logic was so well known that, according to the Alexandrian poet\nCallimachus, even the crows on the rooftops recognized his wisdom,\ncawing out Diodorean questions about the soundness of a conditional.\nAnd his celebrated Master Argument, with which he sought to establish\nhis modal definitions, was said to be hotly debated even at dinner\nparties.\n\n\nThere is no evidence that he wrote anything, and the choice of oral\nargument rather than written exposition would fit his label\n‘Dialectician’, which refers to the Socratic practice of\nquestion-and-answer philosophical discussion. According to the\nanecdotal tradition (not necessarily to be trusted), he died after\npublic humiliation at the court of the Alexandrian ruler Ptolemy Soter,\nhaving failed to solve a set of logical puzzles propounded there by the\nMegaric philosopher Stilpo.\n2. Minima and motion\n\n\nDiodorus is credited with four paradoxes of motion, which inevitably\ncall to mind the celebrated four motion paradoxes of Zeno of Elea.\n\n\n Of Diodorus’s four paradoxes (Sextus Empiricus,\nAgainst the professors 10.85–118), two rested on the\nhypothesis that matter and space are only finitely divisible, namely\ninto vanishingly small quanta, termed by him ‘smallest and\npartless’ (elachista kai amerē) bodies and places.\nHe may have postulated similar minima for time as well. Sextus calls\nthe postulation of minima Diodorus’s ‘hypothesis’, but\nthe denial of motion his ‘own doctrine’ (10.85–86), and we\nmight do well to accept this distinction of status. Although there is\nplentiful evidence that Diodorus did himself endorse the thesis of\nminima as a correct account of the world’s constitution, it was a\ncontroversial view, to which a dialectician could not count on his\ninterlocutors’ agreement. Hence in arguing against motion he may\nhave treated it as a hypothesis, and designed some of his arguments to\nbe independent of it.\n\n\nCertainly some of those puzzled by Zeno’s dichotomy argument\nagainst motion (see Zeno of Elea 2.2.1) had sought to resolve the\npuzzlement by postulating a smallest magnitude. That solution, although\nrejected by Aristotle, was defended by his contemporary Xenocrates, a\nleading Platonist. Diodorus, a generation later, can be seen taking up\nthis supposed solution to the Zenonian paradox and showing that it\nitself in fact generates a new motion paradox, the first of his four.\n(1) A minimal and partless body could never be moving, he argues,\nbecause it always exactly fills the minimal space that it occupies. It\nmay next appear in a precisely adjacent space, but in the intervening\ntime it could never be in transition from the one space to the\nother: that would have required its being partly in and partly not in\nthe original space, whereas what has no parts cannot be\n‘partly’ in anything. (The basic argument goes back to\nPlato, Parmenides 138d–e and Aristotle, Physics\n6.10.)\n\n\nAlthough he here denies that things move, Diodorus is not rejecting\nordinary experience, as Zeno of Elea is generally held to have done. He\nconcedes the empirical fact that things are in different places at\ndifferent times, and therefore that an item can be said to ‘have\nmoved’. What he denies is that motion could ever be taking place\nin the present. It may nevertheless be true that something has moved.\nThe result, a staccato analysis of motion comparable to a series of\nfilm frames, is quite sufficient to account for our experience.\n\n\nBut can it be true that something, in this case motion, has\nhappened, when it was never true to say of it ‘It is\nhappening’? Yes, replies Diodorus (Sextus, 10.97–100): for\nexample, ‘These men have married’ may be true despite the\nfact that there was never a time when it was true to say of them\n‘These men are marrying,’ since they each married at a\ndifferent time. This supporting argument, drawn from Diodorus’s\nlogical arsenal, sits comfortably with the assumption that the staccato\ntheory of motion really was his own doctrine. Although unmistakably in\nthe tradition of Zeno of Elea, it is an attempt to make us re-analyse,\nrather than reject, phenomenal change.\n\n\nDiodorus also sought to defend his motion doctrine with his second\nand third motion paradoxes, both of them independent of the hypothesis\nof minima.\n\n\n(Paradox 2) ‘If something is moving, it is moving either in the place\nit is in, or in the place it is not in. But it is moving neither in the\nplace it is in (for it is at rest in it [subsequently further explained\nas: “for it completely fills it”]) nor in the place it is\nnot in (for it is not in it). Therefore it is not the case that\nsomething is moving’ (Sextus, 10.87). This is sometimes\nattributed to Zeno of Elea, and it certainly owes some of its\ninspiration to him, but the dilemmatic form, at least, seems more\ncharacteristic of Diodorus.\n\n\n(Paradox 3) ‘What is moving is immediately in a place. But what is in\na place is not moving. Therefore what is moving is not moving’\n(Sextus, 10.112). Too brief to admit of close analysis, this looks like\na descendant of Zeno’s Arrow paradox (see Zeno of Elea 2.2.3).\nHow far it can be deemed to differ, other than in form, from the first\nhorn of Diodorus’s preceding dilemma is unclear.\n\n\nDiodorus’s fourth motion paradox appeals to the theory of\nminima once again. It assumes that a moving body, if there were one,\nwould consist of a set of minima, and that the whole body would be\nmoving if and only if a preponderance of its constituent minima were\nmoving. The point of choosing minima as the relevant constituents is\npresumably (cf. Sextus Empiricus, Outlines of Pyrrhonism 3.76)\nto avoid the vicious regress that would threaten if everything moved by\ncourtesy of the movement of a preponderance of its parts, which\nthemselves moved by courtesy of the movement of their parts,\nand so on: minima, being defined precisely by their partlessness,\nprovide the starting point from which composite motion—if there\nis such a thing—would be built up. The paradox asks us to\nimagine a body consisting of three minima, two moving plus one\nstationary. Thanks to this simple majority, the whole body is in\nmotion. Hence if a further stationary minimum were now added to it,\nthat could not be enough to halt its motion, being in a minority of 1\nto the original 3, which, taken as a whole, have been assumed to be\nmoving, and therefore preponderate. And stationary minima can go on\nbeing added to the body, one at a time, until it consists of 10,000\nminima, only two of which are individually moving, and yet the whole\nbody will, absurdly, nonetheless be moving, because of the\never-increasing preponderance of its moving parts.\n\n\nSextus (10.113–18), who reports this paradox, thinks the fallacy\nobvious, as it no doubt is, since on the original assumption, if it is\nto be acceptable, whether a whole body is moving or not should be a\nfunction of what the majority of its minimal parts, each taken on its\nown, are doing. What is most interesting about the paradox is that it\nis a variant of the Sorites or little-by-little argument (see next\nsection), and thus clear evidence that Diodorus used to employ this\nform of argument, whose invention is in fact attributed to his\nforerunner Eubulides (see Dialectical School).\n3. Semantics\n\n\nThe classic Sorites, or ‘heap argument’, seeks to show\nthat even 10,000 grains do not make a heap, on the ground that (a)\nthree grains do not, and (b) the addition of one grain could never be\nenough to turn a non-heap into a heap: however often a further grain is\nadded, no precise boundary between non-heap and heap is ever found.\nApplications of this argument form were widespread in the Hellenistic\nage, and the Stoic logician Chrysippus wrote many books trying to solve\nit. Diodorus is a likely source or inspiration for this Hellenistic\npreoccupation (see previous paragraph).\n\n\nThe Sorites is a particularly lethal weapon when used in the field\nof semantics, threatening to erase the boundaries on which rigid\ndefinitions depend. It may be relevant, then, that Diodorus is reported\nto have propounded a semantic theory of his own (Aulus Gellius,\nAttic nights 11.12.1–3; cf. 1 above, the story of his\nrenaming his slave, reported by Ammonius, On Aristotle’s De\ninterpretatione 38.17–20). This was based on the\n‘conventionalist’ thesis expressed by the character\nHermogenes in Plato’s Cratylus, according to whom nothing but\nconvention—whether national, local or simply\nprivate—determines the meaning of a word, and any convenient\nstring of sounds can in principle be used to convey any meaning.\nDiodorus’s inference from this was that the sole determinant of any\nword’s meaning is the intention of the utterer on any given occasion\non which it is used. He went on to infer that there are no actual\nambiguities: given the assumption that a word is on each occasion\nuttered with one specific meaning in mind, a word has only one meaning\nat any time.\n\n\nOne may wonder whether this semantic theory, which reduced meaning to\nutterer’s meaning, was designed to remedy the kind of damage\nthat the Sorites threatened. If meanings are determined purely by the\nutterer’s intention on each occasion, a radical reconsideration\nof definitional theory seems in any event to be called for. And it may\nbe that counting the grains becomes simply irrelevant to the\ndetermination of what constitutes a heap.\n\nDiodorus was also closely associated with the ‘Veiled’\nparadox (Diogenes Laertius, 2.111; Lucian, Sale of lives,\n22–3): you know who your father is; you don’t know who the\nveiled man over there is; but that veiled man is your father;\nso you both do and do not know who your father is. We might conjecture\nDiodorus’ own solution to have been once again a semantic\none. At each of its occurrences ‘know’ has, in the\nrespondent’s mind, a distinct meaning appropriate to the case\n(acquaintance, recognition), and hence no contradiction is\ninvolved.\n4. Philosophical position\n\n\nDiodorus was known as a great dialectician. Zeno of Elea had been\ncalled by Aristotle (in a lost work) the founder of dialectic, and the\nmotion paradoxes make it clear that Diodorus modelled himself to a\nconsiderable extent on Zeno.\n\n\nOn the other hand Diodorus’s Dialectical school was Socratic in its\naffiliation (see the entry on\n Dialectical School \nin this encyclopedia, section 1). As mentioned above, it was a branch or\noffshoot of the Megaric school, founded by Euclides of Megara and\nrecognized as one of the minor ‘Socratic’ schools, thanks\nto Euclides’s close association with Socrates.\n\n\nThe latter, Socratic link can be developed further. The Dialectical\nschool is listed by Diogenes Laertius (1.18) as one of the\n‘ethical’ sects—surprisingly, given that no ethical\ndoctrines or interests are recorded for any of its known members. The\nexplanation may lie in a well-known passage in Plato’s\nApology (38a), where Socrates remarks that ‘The greatest\ngood for man is to hold discussions every day about virtue and about\nthe other things about which you hear me conversing\n[dialegomenou, cognate with ‘dialectic’] and\nexamining myself and others. And the unexamined life is not worth\nliving for man…’ The Dialecticians may have concluded,\nfollowing Socrates, that the development and exercise of dialectical\nskills are themselves the supreme fulfilment of the human self. If so,\nit becomes that much easier to accept that Diodorus and his colleagues\ngave their philosophy a Socratic pedigree.\n\n\nHowever, there need be no tension between the Zenonian and the\nSocratic roots of Diodorus’s philosophy. Indeed, in Plato’s\nParmenides (135c–d) a very young and still developing Socrates\nis advised by Parmenides to exercise his dialectical skills according\nto the model set by Zeno—a method which, perhaps significantly\nfor Diodorus, involves systematically examining the consequences of a\n‘hypothesis’.\n\n\nTo synthesize the methodologies of Zeno and Socrates may have seemed\nto Diodorus the ideal way to be a dialectician, and to achieve the\nhuman good.\n5. Influence\n\n\nDespite the above characterization, Diodorus’s philosophy did not\nprovide a comprehensive tripartite philosophical system—physics,\nethics and logic—of the kind that was to flourish in the ensuing\nHellenistic age. It is therefore unsurprising that his school did not\nlast far into the third century BCE. Instead, some of his key ideas\nwere appropriated by the dominant schools of the age, namely the\nStoics, the Epicureans and the sceptically inclined dialecticians of\nthe New Academy. Thus it was Diodorus’s propositional logic (see\nDialectical School), rather than the logic of terms developed by\nAristotle, that became the basis of the remarkable Stoic logical\nsystem (see the entry on\n Stoicism \n\nin this encyclopedia, section 4, “Logic”). Diodorus’s\nMaster Argument stood at the very centre of Hellenistic debates about\ndeterminism (see especially Cicero, On fate). His theory of\nminima was endorsed by Epicurus as a key part of his own physical\natomism (see the entry on\n Epicurus\nin this encyclopedia, section 3). And some of Diodorus’s dialectical\nparadoxes, most notably the Sorites, became integral to the\nmethodology of the New Academy.\n",
    "bibliography": {
        "categories": [
            "<a id=\"ColTesCom\">Collections of testimonia, with commentary</a>",
            "<a id=\"SecLit\">Secondary Literature</a>"
        ],
        "cat_ref_text": {
            "<a id=\"ColTesCom\">Collections of testimonia, with commentary</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Döring, K., 1972, <em>Die Megariker. Kommentierte Sammlung\nder Testimonien</em>, Amsterdam: Grüner.",
                "Giannantoni, G., 1983–1990, <em>Socratis et Socraticorum\nReliquiae</em>, 4 vols., Naples: Bibliopolis.",
                "Montoneri, L., 1984, <em>I megarici</em>, Catania: Symbolon.",
                "Muller, R., 1985, <em>Les mégariques. Fragments et\ntémoignages</em>, Paris: Vrin\n</ul>\n<h3>"
            ],
            "<a id=\"SecLit\">Secondary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Becker, O., 1961, “Zur Rekonstruktion des ‘kurieuon\nlogos’ des Diodoros Kronos”, in <em>Erkenntnis und\nVerantwortung</em>, J. Derbolav and F. Nicolin (eds.),\nDüsseldorf: Schwann, 250–63.",
                "Bobzien, S., 1993, “Chrysippus’ modal logic and its\nrelation to Philo and Diodorus”, in <em>Dialektiker und\nStoiker</em>, K. Döring and Th. Ebert (eds.), Stuttgart: Franz\nSteiner, pp. 63–84.",
                "–––, 1998, <em>Determinism and Freedom in Stoic\nPhilosophy</em>, Oxford: Clarendon Press.",
                "Denyer, N.C., 1981a, “Time and Modality in Diodorus\nCronus”, <em>Theoria</em>, 47: 31–53.",
                "–––, 1981b, “The atomism of Diodorus Cronus”,\n<em>Prudentia</em>, 13: 33–45.",
                "–––, 1996, “Gaskin on the Master Argument”,\n<em>Archiv für Geschichte der Philosophie</em>, 78:\n166–80.",
                "–––, 2002, “Neglected evidence for Diodorus\nCronus”, <em>The Classical Quarterly</em>, 52:\n597–600.",
                "–––, 2009, “Diodorus Cronus: Modality, the Master\nArgument and Formalisation”, <em>Humana Mente</em>, 8:\n33–46\n [<a href=\"https://www.semanticscholar.org/paper/Diodorus-Cronus-%3A-Modality-%2C-the-Master-Argument-Denyer/74d638afad034b2d96e6f22b8ffbbf10e83168fd\" target=\"other\">Preprint available online</a>].",
                "Ebert, T., 2008, “In defence of the Dialectical\nschool”, in <em>Anthropine Sophia</em>, F. Alesse et al. (eds.),\nNaples: Bibliopolis, pp. 275–93",
                "Gaskin, R., 1995, <em>The Sea-Battle and the Master\nArgument. Aristotle and Diodorus Cronus on the Metaphysics of the\nFuture</em>, Berlin, New York: de Gruyter.",
                "–––, 1996, “Reconstructing the Master\nArgument: response to Denyer”, <em>Archiv für Geschichte\nder Philosophie</em>, 78: 181–91.",
                "Hintikka, J., 1973, <em>Time and Necessity</em>, Oxford: Oxford\nUniversity Press, pp. 179–213.",
                "Kneale, M. and W., 1962, <em>The Development of Logic</em>,\nOxford: Clarendon Press.",
                "Prior, A.N., 1955, “Diodorean Modalities”, <em>The\nPhilosophical Quarterly</em>, 5: 205–213",
                "–––, 1967, <em>Past, Present, and Future</em>,\nOxford: Clarendon Press.",
                "Sedley, D., 1977, “Diodorus Cronus and Hellenistic\nPhilosophy”, <em>Proceedings of the Cambridge Philological\nSociety</em>, 203 NS 23: 74–120.",
                "Sorabji, R., 1983, <em>Time, Creation and the Continuum</em>,\nLondon: Duckworth.",
                "Verde, F., 2013, <em>Elachista. La dottrina dei minimi\nnell’Epicureismo</em>, Leuven: Leuven University Press.",
                "Weidemann, H., 1993, “Zeit und Wahrheit bei Diodor”,\nin <em>Dialektiker und Stoiker</em>, K. Döring and Th. Ebert\n(eds.), Stuttgart: Franz Steiner, pp. 319–29.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<h3><a id=\"ColTesCom\">Collections of testimonia, with commentary</a></h3>\n<ul class=\"hanging\">\n<li>Döring, K., 1972, <em>Die Megariker. Kommentierte Sammlung\nder Testimonien</em>, Amsterdam: Grüner.</li>\n<li>Giannantoni, G., 1983–1990, <em>Socratis et Socraticorum\nReliquiae</em>, 4 vols., Naples: Bibliopolis.</li>\n<li>Montoneri, L., 1984, <em>I megarici</em>, Catania: Symbolon.</li>\n<li>Muller, R., 1985, <em>Les mégariques. Fragments et\ntémoignages</em>, Paris: Vrin</li>\n</ul>\n<h3><a id=\"SecLit\">Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Becker, O., 1961, “Zur Rekonstruktion des ‘kurieuon\nlogos’ des Diodoros Kronos”, in <em>Erkenntnis und\nVerantwortung</em>, J. Derbolav and F. Nicolin (eds.),\nDüsseldorf: Schwann, 250–63.</li>\n<li>Bobzien, S., 1993, “Chrysippus’ modal logic and its\nrelation to Philo and Diodorus”, in <em>Dialektiker und\nStoiker</em>, K. Döring and Th. Ebert (eds.), Stuttgart: Franz\nSteiner, pp. 63–84.</li>\n<li>–––, 1998, <em>Determinism and Freedom in Stoic\nPhilosophy</em>, Oxford: Clarendon Press.</li>\n<li>Denyer, N.C., 1981a, “Time and Modality in Diodorus\nCronus”, <em>Theoria</em>, 47: 31–53.</li>\n<li>–––, 1981b, “The atomism of Diodorus Cronus”,\n<em>Prudentia</em>, 13: 33–45.</li>\n<li>–––, 1996, “Gaskin on the Master Argument”,\n<em>Archiv für Geschichte der Philosophie</em>, 78:\n166–80.</li>\n<li>–––, 2002, “Neglected evidence for Diodorus\nCronus”, <em>The Classical Quarterly</em>, 52:\n597–600.</li>\n<li>–––, 2009, “Diodorus Cronus: Modality, the Master\nArgument and Formalisation”, <em>Humana Mente</em>, 8:\n33–46\n [<a href=\"https://www.semanticscholar.org/paper/Diodorus-Cronus-%3A-Modality-%2C-the-Master-Argument-Denyer/74d638afad034b2d96e6f22b8ffbbf10e83168fd\" target=\"other\">Preprint available online</a>].</li>\n<li>Ebert, T., 2008, “In defence of the Dialectical\nschool”, in <em>Anthropine Sophia</em>, F. Alesse et al. (eds.),\nNaples: Bibliopolis, pp. 275–93</li>\n<li>Gaskin, R., 1995, <em>The Sea-Battle and the Master\nArgument. Aristotle and Diodorus Cronus on the Metaphysics of the\nFuture</em>, Berlin, New York: de Gruyter.</li>\n<li>–––, 1996, “Reconstructing the Master\nArgument: response to Denyer”, <em>Archiv für Geschichte\nder Philosophie</em>, 78: 181–91.</li>\n<li>Hintikka, J., 1973, <em>Time and Necessity</em>, Oxford: Oxford\nUniversity Press, pp. 179–213.</li>\n<li>Kneale, M. and W., 1962, <em>The Development of Logic</em>,\nOxford: Clarendon Press.</li>\n<li>Prior, A.N., 1955, “Diodorean Modalities”, <em>The\nPhilosophical Quarterly</em>, 5: 205–213</li>\n<li>–––, 1967, <em>Past, Present, and Future</em>,\nOxford: Clarendon Press.</li>\n<li>Sedley, D., 1977, “Diodorus Cronus and Hellenistic\nPhilosophy”, <em>Proceedings of the Cambridge Philological\nSociety</em>, 203 NS 23: 74–120.</li>\n<li>Sorabji, R., 1983, <em>Time, Creation and the Continuum</em>,\nLondon: Duckworth.</li>\n<li>Verde, F., 2013, <em>Elachista. La dottrina dei minimi\nnell’Epicureismo</em>, Leuven: Leuven University Press.</li>\n<li>Weidemann, H., 1993, “Zeit und Wahrheit bei Diodor”,\nin <em>Dialektiker und Stoiker</em>, K. Döring and Th. Ebert\n(eds.), Stuttgart: Franz Steiner, pp. 319–29.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "ambiguity",
            "conditionals",
            "Cratylus",
            "Dialectical School",
            "Diodorus Cronus",
            "Epicureanism",
            "Epicurus",
            "Hegel, Georg Wilhelm Friedrich: dialectics",
            "logic: ancient",
            "Megaric School",
            "Socrates",
            "Sorites paradox",
            "Stoicism",
            "Zeno of Citium",
            "Zeno of Elea"
        ],
        "entry_link": [
            {
                "../ambiguity/": "ambiguity"
            },
            {
                "../conditionals/": "conditionals"
            },
            {
                "../dialectical-school/": "Dialectical School"
            },
            {
                "../diodorus-cronus/": "Diodorus Cronus"
            },
            {
                "../epicurus/": "Epicurus"
            },
            {
                "../hegel-dialectics/": "Hegel, Georg Wilhelm Friedrich: dialectics"
            },
            {
                "../logic-ancient/": "logic: ancient"
            },
            {
                "../socrates/": "Socrates"
            },
            {
                "../sorites-paradox/": "Sorites paradox"
            },
            {
                "../stoicism/": "Stoicism"
            },
            {
                "../zeno-elea/": "Zeno of Elea"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=diodorus-cronus\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/diodorus-cronus/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=diodorus-cronus&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/diodorus-cronus/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=diodorus-cronus": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/diodorus-cronus/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=diodorus-cronus&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/diodorus-cronus/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}