{
    "url": "dutch-book",
    "title": "Dutch Book Arguments",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Susan Vineberg\n<susan.vineberg@wayne.edu>",
        "author_links": [
            {
                "mailto:susan%2evineberg%40wayne%2eedu": "susan.vineberg@wayne.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nSusan Vineberg\n&lt;<a href=\"mailto:susan%2evineberg%40wayne%2eedu\"><em>susan<abbr title=\" dot \">.</abbr>vineberg<abbr title=\" at \">@</abbr>wayne<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Jun 15, 2011",
        "substantive revision Sat May 14, 2022"
    ],
    "preamble": "\n\nThe Dutch Book argument (DBA) for probabilism (namely the view that an\nagent’s degrees of belief should satisfy the axioms of\nprobability) traces to Ramsey’s work in “Truth and\nProbability”. He mentioned only in passing that an agent who\nviolates the probability axioms would be vulnerable to having a book\nmade against him and this has led to considerable debate and confusion\nboth about exactly what Ramsey intended to show and about if, and how,\na cogent version of the argument can be given. The basic idea behind\nthe argument has also been applied in defense of a variety of\nprinciples, some of which place additional constraints on an\nagent’s current beliefs, with others, such as\nConditionalization, purporting to govern how degrees of belief should\nevolve over time.\n",
    "toc": [
        {
            "#BasiDutcBookArguForProb": "1. The Basic Dutch Book Argument for Probabilism"
        },
        {
            "#ProbAxioDutcBookTheo": "1.1 The Probability Axioms and the Dutch Book Theorem"
        },
        {
            "#DetaVersDutcBookArgu": "1.2 A Detailed Version of the Dutch Book Argument"
        },
        {
            "#ConvDutcBookTheo": "1.3 The Converse Dutch Book Theorem"
        },
        {
            "#ItRatiViolProbAxio": "1.4 Can it be Rational to Violate the Probability Axioms?"
        },
        {
            "#DutcBookArguProbCons": "2. The Dutch Book Argument and Probabilistic Consistency"
        },
        {
            "#DutcBookArguReveInco": "2.1 The Dutch Book Argument as Revealing Inconsistency"
        },
        {
            "#DeprArgu": "2.2 Depragmatized Arguments"
        },
        {
            "#CohePragConsCons": "2.3 Coherence as a Pragmatic Consistency Constraint"
        },
        {
            "#DutcBookArguForCounAddi": "3. A Dutch Book Argument for Countable Additivity"
        },
        {
            "#DiacDutcBookArgu": "4. Diachronic Dutch Book Arguments"
        },
        {
            "#Cond": "4.1 Conditionalization"
        },
        {
            "#JeffCond": "4.2 Jeffrey Conditionalization"
        },
        {
            "#PrinRefl": "4.3 The Principle of Reflection"
        },
        {
            "#OtheUsesDutcBookArgu": "5. Other Uses of Dutch Book Arguments"
        },
        {
            "#SleeBeau": "5.1 Sleeping Beauty"
        },
        {
            "#PrinPrin": "5.2 The Principal Principle"
        },
        {
            "#DutcBookRatiChoi": "5.3 Dutch Books and Rational Choice"
        },
        {
            "#Conc": "6. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Basic Dutch Book Argument for Probabilism\n1.1 The Probability Axioms and the Dutch Book Theorem\n\nThe conclusion of the basic DBA is that the degrees of belief, or\ncredences, that an agent attaches to the members of a set \\(X\\)\nof propositions, or sometimes statements or\nsentences, should satisfy the axioms of probability. The basic\naxioms of probability are generally taken as requiring that for \\(A\n\\in X\\),\n\n(1)\\(0 \\le \\pr(A)\\) [Non-Negativity];\n(2)if \\(A\\) is a tautology, then \\(\\pr(A) = 1\\) [Normalization];\n(3)if \\(A\\) and \\(B\\) are incompatible, then \\(\\pr(A\\vee B) = \\pr(A) + \\pr(B)\\) [Finite Additivity].\n\n\nCondition 2, which requires only that the truths of propositional\nlogic are given the value one, is sometimes replaced with\n\n(\\(2'\\))if \\(A\\) is a logical truth, then \\(\\pr(A) =1\\),\n\n\nor even\n\n(\\(2''\\))if \\(A\\) is a necessary truth, then \\(\\pr(A) =1\\).\n\n\nThe distinctions between these formulations of the axioms are\nconnected with the objects that probabilities are appropriately\nattached to and on the reasonableness of the argument’s\nconclusion; but, for the immediate purpose of outlining the basic\nargument, the differences are not crucial.\n\nThe DBA itself begins with the so-called Dutch Book theorem, which\nconcerns the conditions under which a set of bets guarantees a net\nloss to one side, or a Dutch Book. With de Finetti, it is here assumed\nthat a bet on a proposition \\(H\\) is an arrangement\nthat has the following canonical form:\n\n\n\n\\(H\\)\nPayoff \n\nTrue\n\\(S - qS\\) \n\nFalse\n\\(-qS\\)  \n\n\nThe table gives the net payoff to an agent who buys a bet with stake\n\\(S\\) for the price \\(qS\\), where \\(S\\)\nis won if \\(H\\) is true. \\(S\\) is called\nthe stake, as it is the total amount involved in the wager,\nthat is the payoff in the case that \\(H\\) is true\ntogether with the amount forfeited if \\(H\\) is false.\nThe quantity \\(q\\) is called the betting\nquotient, which is the amount lost if \\(H\\) is\nfalse divided by the stake. The Dutch Book theorem can now be\nstated:\n\nGiven a set of betting quotients that fails to satisfy the probability\naxioms, there is a set of bets with those quotients that guarantees a\nnet loss to one side.\n\nIt is easy to show how it is possible to make book against someone\nwith betting quotients that violate the probability axioms. Let\n\\(Q(H)\\) be the agent’s betting quotient for \\(H\\).\nAssuming that the agent’s betting quotients\nviolate the axioms, a bookie can guarantee himself a profit by placing\nbets with the agent as described below. For simplicity the stake is\nset here at $1, but the following recipes for constructing a book\nagainst such a person are easily adapted for other stakes.\n\nAxiom 1: Suppose that \\(Q(H) \\lt 0\\). In this case, the bookie buys\nthe bet that pays $1 if \\(H\\) is true and 0 otherwise,\nfor the negative price \\(Q(H)\\), which means that the agent collects\n\\(Q(H)\\), and pays out $1 if \\(H\\) is true, and $0\notherwise. Here the agent is betting against \\(H\\) and\nthe payoff table for the agent is as follows:\n\n\n\n\\(H\\)\nPayoff \n\nT\n\\(-[1 - Q(H)]\\) \n\nF\n\\(Q(H)\\)  \n\n\nSince \\(Q(H)\\) is negative, the agent will suffer a net loss\nregardless of the truth-value of \\(H\\).\n\nAxiom 2: Suppose that an agent’s betting quotient for a\ntautology (or a logical or necessary truth) \\(H\\) is\nnot equal to 1. If \\(Q(H) \\gt 1\\) the bookie sells the bet that pays\n$1 if \\(H\\) is true and 0 otherwise, for \\(Q(H)\\). In\nthe case where \\(Q(H) \\lt 1\\), the bookie will buy the bet in which\nthe agent pays the bookie $1 if \\(H\\) is true and\nnothing if \\(H\\) is false, for \\(Q(H)\\). In this case,\nthe payoff table for the agent will again be as above for axiom 1.\nNotice that since \\(H\\) is a tautology (or logical or\nnecessary truth) it must be true, which means that at the conclusion\nof the bet, the agent will have lost [\\(1-Q(H)\\)].\n\nAxiom 3 (Additivity): Assume that \\(H_{1}\\) and \\(H_{2}\\) are mutually\nexclusive and that \\(Q(H_{1}\\vee H_{2}) \\ne Q(H_{1}) + Q(H_{2})\\).\nThere are two cases, \n\n\\[\\begin{align} \nQ(H_1\\vee H_2) &\\gt Q(H_1) + Q(H_2), \\text{ and} \\\\ \nQ(H_1\\vee H_2) &\\lt Q(H_1) + Q(H_2). \n\\end{align}\\]\n\n\nIf \\(Q(H_{1}\\vee H_{2}) \\lt Q(H_{1}) + Q(H_{2})\\), then the bookie\nwill offer the agent the bet that pays $1 if \\(H_{1}\\) and 0 otherwise\nfor \\(Q(H_{1})\\) and the bet that pays $1 if \\(H_{2}\\) is true and 0\notherwise for \\(Q(H_{2})\\). The bookie then buys the bet that will pay\nhim $1, if \\((H_{1}\\vee H_{2})\\) is true and 0 otherwise, for the\nprice of \\(Q(H_{1}\\vee H_{2})\\). The possible payoffs to the agent are\nsummed up in the following table:\n\n\n\n\\(H_{1}\\)\n\\(H_{2}\\)\nNet Payoff \n\nT\nF\n[\\(1 - Q(H_{1}) - Q(H_{2}) + Q(H_{1}\\vee H_{2}) - 1\\)]\n\n\nF\nT\n[\\(1 - Q(H_{1}) - Q(H_{2}) + Q(H_{1}\\vee H_{2}) - 1\\)]\n\n\nF\nF\n[\\(-Q(H_{1}) - Q(H_{2}) + Q(H_{1}\\vee H_{2})\\)] \n\n\n\nSince \\(Q(H_{1}\\vee H_{2}) \\lt Q(H_{1}) + Q(H_{2})\\), the agent loses\nin each case and thus the collection of bets assures a loss. If\n\\(Q(H_{1}\\vee H_{2}) \\gt Q(H_{1}) + Q(H_{2})\\), then the bookie simply\nreverses the direction of the bets.\n\nLetting \\(V(H)\\) be the payoff if \\(H\\) is true, the\nexpected value of a bet on \\(H\\) is expressed by the\nequation: \n\n\\[ \\text{Exp}(H) = V(H)Q(H) + V(-H)(1-Q(H)). \\]\n\n\nThus, for each axiom, the individual bets involved in making the book\nare fair, which is to say they have an expected value of zero, when\ncalculated using the agent’s betting quotients, yet collectively\nthey will produce a sure loss. The Dutch Book argument assumes that an\nagent’s degrees of belief are linked with her betting quotients.\nThis, together with the Dutch Book theorem, is used to establish\nthat degrees of belief that violate the probability axioms are\nassociated with bets that are fair in the above sense, yet are also\ntied to a sure loss. The argument then concludes that agents ought to\nobey the axioms. This leaves open just what the association amounts to\nand what sort of problem the prospect of such sure loss is supposed to\nbe.\n1.2 A Detailed Version of the Dutch Book Argument\n\nThe Dutch Book argument has often been presented as establishing that\ndegrees of belief that violate the axioms are irrational because they\ncan (or do) lead to bad consequences. It assumes that an agent’s\ndegrees of belief are associated with her betting quotients such that\n(1) for an agent with degree of belief \\(q\\) in \\(M\\)\na bet on or against \\(M\\) at\ncorresponding odds will be acceptable. With payoffs in dollars and\nstake \\(S\\), this amounts to the claim that the agent\nshould be willing to take either direction of a bet with a cost of\n$\\(Sq\\) that pays\n\n\n\n\\($S\\)\nif \\(M\\) \n\n\\($0\\)\notherwise  \n\n\nBut then (2) by the Dutch Book theorem a cunning bettor could assure\nhimself a profit from someone who violates the probability axioms.\nSince (3) violating the axioms leaves the bettor open to being Dutch\nBooked (that is, being on the losing side of the Dutch Book) because\nher degrees of belief make acceptable bets leading to a sure loss, it\nis concluded that (4) one ought to satisfy the probability axioms\n(i.e. that probabilism is true). In some presentations, the first\npremise is strengthened to the claim that the agent actually will\naccept those bets on \\(M\\) for which her degree of\nbelief matches the betting quotient, in an effort to tighten the\nconnection between violating the axioms and the sure loss.\n\nA bit of terminology is in need of clarification here. De Finetti\nidentified degrees of belief with betting quotients and termed degrees\nof belief that are susceptible to a Dutch Book incoherent;\nthose that are not so susceptible he called coherent (de Finetti\n1937). ‘Susceptible’ here should be understood in the\nsense of the above theorem, namely that bets are specifiable\ncorresponding to those degrees of belief that will produce a sure loss\nto one side. Given the theorem, coherence amounts to satisfaction of\nthe probability axioms, with incoherence involving their violation,\nand accordingly the terms are often used as a shorthand way of\nspecifying whether the axioms are satisfied. However, both Ramsey and\nde Finetti understood incoherence to be a kind of inconsistency, and\nsome use the term in this sense. There are various questions about\nunderstanding violation of the probability axioms and susceptibility\nto a Dutch Book as a  kind of inconsistency, as will be\ndiscussed, and so here it will be best to use ‘incoherent’\nfor degrees of belief that violate the probability axioms, and that by\nthe Dutch Book theorem are associated with susceptibility to a sure\nloss, and leave open whether incoherence understood as such involves a\nform of inconsistency.\n1.3 The Converse Dutch Book Theorem\n\nThere is reason to accept the conclusion of the DBA that one ought to\nsatisfy the probability axioms so as to avoid a Dutch Book only\ninsofar as satisfying the axioms affords at least the possibility of\navoiding exposure to a sure loss (Hájek 2005; 2008a,b). Here, the\nConverse Dutch Book theorem, proven independently by Lehman (1955) and\nKemeny (1955), plays an important role. Roughly stated the result is\nthat\n\nFor a set of betting quotients that obeys the probability axioms,\nthere is no set of bets (with those quotients) that guarantees a sure\nloss (win) to one side.\n\n\nIt assures that the agent would not be exploitable in any event, and\nthus establishes an advantage to obeying the axioms. Notice that the\ntheorem states that having betting quotients adhering to the axioms\nassures that one will not be susceptible to a sure loss, rather than\nmaking just the minimal claim required to establish an advantage to\ncoherence that such vulnerability may be avoided.\n\nBoth the Dutch Book theorem and its converse are sensitive to the\nformulation of the axioms, as well as to the understanding of\n‘bet’, ‘sure loss’ and what it means for such\na loss to be guaranteed. Special care must be taken with the\ncharacterization of the probability axioms when it comes to the\nConverse Dutch Book theorem. Given that the axioms are formulated such\nthat the second axiom only requires that tautologies receive\nprobability one, it is possible to satisfy the axioms, yet still be\nopen to a sure loss. Consider the claim that if \\(b\\)\nhas \\(F\\) then something has \\(F\\). This\nis not tautological, but betting against it would leave one vulnerable\nto a sure loss. Sometimes the second axiom is instead formulated as\nrequiring that all logical truths receive probability one, but\nsatisfying this constraint leaves open the possibility of a sure loss\nby betting against a necessary truth such as ‘nothing is both\nred and green all over’. Even with strengthening the second\naxiom to require that all necessary truths receive probability one,\nthere is still a reading upon which the Converse Dutch Book theorem is\nfalse, since an agent will be vulnerable to a sure loss if she\nattaches a probability less than one to a known truth (or a\nprobability greater than zero to a known falsehood). One response to\nthis is to restrict ‘sure loss’ to those losses that do\nnot depend on contingent facts. Instead the restriction could be made\nto losses that are ‘sure’ in the sense that there is a\nmechanical formula for inflicting the loss, thus removing the sort of\ncounterexample to the Converse Dutch Book theorem with which we began,\nand the need to strengthen the axioms. A related move involves\nrestricting the allowable bets, rather than limiting what counts as a\nsure loss.\n\nIn observing that the Dutch Book theorem and the DBA are sensitive to\nthe formulation of the probability axioms, it should be noted that\nwhereas classical logic is generally presumed, probability axioms can\nbe formulated, with suitable adjustments, for non-classical logics.\nWeatherson argues that this is appropriate in representations of\nrational belief, and formulates axioms of probability that are built\nupon an intuitionistic logic, for which he then gives a Dutch Book\nargument (Weatherson 2003).\n\nIt is clear that in order for the Dutch Book theorem to hold,\n‘sure loss’ must be taken to mean loss if the bets are in\nfact placed and settled. Violation of the probability axioms under any\nof their formulations does not guarantee an actual loss. Still more\nmust be said here about the meaning of ‘sure loss’, which\nsuggests some sort of necessity but does not tell us whether this is\nsupposed to be a particular form of logical necessity, metaphysical\nnecessity, or perhaps some other relative necessity. If ‘sure\nloss’ were taken as foreseeable loss, then an agent could\nviolate the axioms by attaching positive probability to a necessary\nfalsehood, where there is no foreseeable loss given the current state\nof knowledge concerning the proposition in question. There is also an\nissue concerning whether it is the agent who must be able to foresee\nthe loss. If ‘sure’ means decidable, then neither the\nformulation that logical nor that necessary truths receive probability\none will do, since there is no decision procedure for determining in\ngeneral whether a given sentence is a logical truth, let alone a\nnecessary one. Clearly, there is a delicate balance that must be\nstruck between the formulation of the probability axioms, and the\nunderstanding of ‘bets’ and ‘sure loss’ for\nthe Dutch Book theorem and its converse to hold.\n\nThere is a further issue with the Converse Dutch Book theorem, because\nthere are books that can be made against agents who violate other\nprobabilistic norms, such as Reflection, countable additivity and\nothers (see sections 3, 4, and 5). Satisfaction of the basic axioms is\nno guarantee that one will not be open to a book due to violation of\nsome other norm. A correct formulation of the theorem must accordingly\nrestrict the form and number of the allowable bets. Kemeny and Lehman\nput restrictions on the allowable bets (for example their betting\nsystems are restricted to a finite number of bets), and these seem to\nrule out such counterexamples. However, it remains to be shown that\navoiding book with such a restricted set of bets suffices to justify\nadherence to the axioms. The problem here becomes especially pressing\nwith the observation, discussed in the following section, that\nincoherent agents need not be generally vulnerable to a sure loss, and\nthus that both coherent and incoherent agents alike may be subject to\nsome books and not others. What is needed in arguing for adherence to\nthe probability axioms is the further claim that the bets which lead\nto sure losses and that are associated with incoherence pose a special\nproblem, although this threatens the use that many proponents of the\nDBA have wanted to make of Dutch Book arguments in defending other\nnorms.\n\nA related problem concerns the assumption made in the version of the\nDBA presented in section 1.2 that agents will accept, or at least find\nacceptable, those ‘fair bets’ on or against \\(P\\)\nwhere their degree of belief matches the betting\nquotient for the bet. As discussed in the next section, it is not true\nthat all such bets will be accepted, or even be regarded as\nacceptable, and additional bets may be accepted (or found acceptable).\nFor various reasons someone might accept bets in cases where her\ncredences do not correspond to the betting quotients of those bets,\nincluding where the bets constitute a Dutch Book. Thus, we need to be\nconcerned more generally with the array of bets that agents will\naccept (or find acceptable). But since this widens the class of bets\nthat can be used to produce a book, if anything it makes the problem\nfor the DBA that a coherent agent may be subject to a Dutch Book even\nworse. The version of the DBA in section 1.2 could be modified with\nthe claim that agents accept (or find acceptable) only bets that are\nfair or favorable, that is those with a non-negative expected value as\ncalculated using their degrees of belief. This rules out some\nadditional bets that would produce a Dutch Book for a coherent agent,\nbut not those that enter into the DBAs for other norms. However, this\nassumption does not hold generally, and fails to address other issues\nconfronting the argument.\n1.4 Can it be Rational to Violate the Probability Axioms?\n\nAs noted above, the sure loss guaranteed by the Dutch Book theorem\nneed not amount to an actual loss. Indeed a bookie could reverse the\ndirection of the bets that would guarantee a loss for an incoherent\nagent so as to guarantee her a win, or there could be some sort of\nother prize that might be awarded for being incoherent. An incoherent\nagent might not be confronted by a clever bookie who could, or would,\ntake advantage of her, perhaps because she can take effective measures\nto avoid such folk. Even if so confronted, the agent can always\nprevent a sure loss by simply refusing to bet. It won’t do to\nrespond to such a possibility by insisting on the stronger assumption\nthat an agent will always take bets where the expected value of each\nis non-negative, because this simply gives the argument a false\npremise. In any case, it is clear that the trouble with being\nincoherent cannot be that it will lead to losses. Rather, the idea\nbehind the version of the argument in section 1.2 should be taken to\nbe that incoherence opens one up to sure losses, in a way that having\ncoherent beliefs does not (given an appropriate version of the\nConverse Dutch Book theorem), and that such potential vulnerability\ndemands adherence to the axioms.\n\nWe may question whether either the conclusion that one ought to\nsatisfy the axioms or that incoherence is irrational follows\nfrom simply being open to a sure loss. If the threat of such a loss is\nseen as unlikely, say, if the agent thinks she won’t face a\nclever bookie, has confidence that her charms will prevent her from\nending up on the losing side of a Dutch Book, or just thinks she\nwon’t take bets leading to a Dutch Book if they are offered,\nthen it is hard to see why the mere potential of a sure loss should\ndemand coherence. Another problem here is the special status accorded\nto sure losses. In fact the potential sure loss is symmetric with a\npossible sure gain. As Hájek emphasizes, there is a\ncorresponding “Czech Book Argument”, which parallels the\nDBA, with the conclusion that one ought to violate the probability\ncalculus (Hájek 2005, 2008a). Construed as above, the DBA\nappears to be canceled out by the “Czech Book Argument”,\nalthough Hájek shows that the potential canceling out can be\navoided by reformulating the DBA with the assumption that the agent\nshould accept bets that are either fair or favorable (Hájek\n2008a). Still, it is compatible with the Dutch Book theorem that an\nincoherent agent could end up on the side of a sure gain, and so\nincoherence cannot be condemned as irrational simply by citing the\npossibility of sure losses.\n\nAlthough the threat of a sure loss may be remote, and an agent could\nface a sure gain, there are some situations in which incoherence is\nmore closely tied to actual losses. Some versions of the DBA appeal to\nsuch scenarios as a preliminary to attempting to establish the general\nirrationality of being incoherent. One tactic has been to argue that\nincoherence is irrational in so-called forced betting situations, and\nthen that the prohibition against being incoherent in such situations\ncan be universalized (Jackson and Pargetter 1976). In a forced betting\nsituation the agent is required to post betting quotients, and then to\nplace bets with those quotients, where the stake and direction of the\nbets are dictated by an opponent. Assuming that the only source of\nvalue is the money (valued linearly) involved in the wagers, it is\nclaimed that it is irrational to be incoherent in such a situation.\nBut this doesn’t follow if the irrationality is taken as arising\nfrom actual losses that would result. Even in a forced betting\nscenario, there may be reasons to suppose that incoherent betting\nquotients will not be taken advantage of, as may occur if making book\nwould require knowledge of some very complicated logical truth\n(Kennedy and Chihara 1979). Here too, the direction of the bets could\nbe chosen so that an incoherent agent will have a sure gain. This\nwould be an odd forced betting situation, but if the agent had reason\nto believe that this would occur, it could actually be advisable for\nher to post incoherent odds.\n\nOne might begin instead with a competitive betting situation, in which\nit is given that both sides attempt to maximize their gain. Here there\nis a closer connection between incoherence and loss, since the bookie\nwill be trying to maximize his profit, and so a sure gain for an\nincoherent agent could only be the result of a mistake. If it is\nassumed that the agent is also forced to bet and that the bookie will\nact optimally, the agent should post coherent odds, for otherwise she\nwill be subject to a bankrupting Dutch Book. Of course if the\ncompetitive situation is one in which the agent can refuse to bet,\nhaving incoherent betting quotients need not leave her open to an\nactual loss.\n\nEven in those forced betting situations and competitive betting\nsituations in which it is irrational to post incoherent betting\nquotients, it still need not be irrational to have incoherent degrees\nof belief (Kennedy and Chihara 1979; Adams and Rosenkrantz 1980). For\nexample, if the agent must post odds on what she knows to be either a\nlogical truth or a logical falsehood in a forced betting situation,\nshe may be better off with a betting quotient of either 1 or 0, rather\nthan some intermediate value, for she is susceptible to a Dutch Book\nin the latter event, but she could end up with the objectively correct\nvalue in the former case and thus would avoid a loss. But it seems\nthat she can have reasons for an intermediate level of confidence,\nmaking such an evaluation more rational, at least in the sense of\nreflecting her available evidence, than an extreme one. Alternatively\nthe agent may simply have no idea whatsoever about the logical status\nof what is in fact a logical truth upon which she must post odds, in\nwhich case a confidence of .5, or perhaps remaining entirely agnostic\nby not adopting any particular level of confidence, seems more\nreasonable than her being fully confident despite her ignorance.\n\nAt the least, such examples raise questions about the connection that\nthe DBA presupposes between partial beliefs and favorable/unfavorable\nbetting odds. In the case where an agent must give her betting\nquotient for what is in fact a logical truth, any value less than one\nleaves her vulnerable to a sure loss, possibly a bankrupting one, yet\nin such cases not all such credences are rationally on a par. The\nissue here seems to be more than simply one about how well the\nunderlying theory of action and belief works for extreme values, but\nalso about the relevant conception of rational belief. Rational\naction-guiding credences should generally reflect the agent’s\nevidence, yet at least in the cases above, probabilism seems sometimes\nto require that they do not. One may question whether the appropriate\nor intended sense of ‘rational’ is invoked in these cases\nin which it seems right to say that rational beliefs can come apart\nfrom betting quotients, but such objections just highlight the lack of\nclarity in most presentations of the argument over what sort of\nrationality is supposed to be at stake. It has been said, for\ninstance, that it is ideal rationality that demands adherence to the\naxioms, but this notion too is unclear. What can be said though is\nthat there are cases in which degrees of belief do satisfy an\nimportant ideal of rationality but where they seem to come apart from\nbetting quotients, and this puts additional pressure on the premise\nthat agents should be willing to accept bets where their degrees of\nbelief match the betting quotient.\n\nNeither a forced nor a competitive betting situation per se guarantees\nthat incoherence will result in actual losses, and even in the special\ncases in which it would bring them about, it appears that having\nincoherent degrees of belief need not be irrational. Indeed, whereas\ndegrees of belief may generally be thought of as guides to action, and\nas well-modeled by betting quotients in many cases, forced and\ncompetitive betting situations in fact reinforce the point that they\nare not always straightforwardly linked. Thus, arguments for the claim\nthat incoherence is generally irrational that begin with the claim\nthat it is irrational in forced betting situations fail to get off the\nground, let alone show that it is irrational outside of such\nsituations, where the connection between incoherence and the\npossibility of losses is even more tenuous. Still, forced and\ncompetitive betting situations are helpful in identifying rational\nconstraints under idealized conditions, and can serve as useful models\nof action in some situations. Under highly circumscribed conditions,\nwhere the agent’s goals are limited, they show that it is\nprudent to post coherent betting quotients. It is a bad feature of\nincoherent betting quotients, whether or not they correspond to such\ndegrees of belief, that in a forced betting situation they provide the\nopportunity for a clever bookie to inflict a sure loss, and guarantee\nit in competitive ones with a utility-maximizing opponent. But, the\nspecial conditions that make it rational to have coherent betting\nquotients, so as to avoid a sure loss, are not met in general. In some\ncircumstances, a small sure loss can be better than the chance of a\ngreater loss. Additionally, where there is something of value that is\nlinked to a wager besides the stake, it can also be rational to act so\nas to bring about a sure loss on a bet.\n\nAside from the reasons given above for the fact that it can be\nrational to leave oneself open to, or act so as to guarantee, a sure\nloss, situations in which the value of a bet is not fully represented\nby its monetary payoff conditions present challenges for versions of\nthe DBA that take the problem with incoherence as stemming from the\nthreat of losing money. An agent may not wish to risk losing money on\na large bet, due to additional bad consequences that would or might\nensue, or the agent may suffer anxiety over the prospect of loss. De\nFinetti and others insist on limiting the stakes in an effort to get\naround this problem, but Ramsey already observed that one might have a\n“reluctance to bother with trifles”, which is to say that\nthere is a negative value to placing bets with little potential gain.\nPerhaps there is some range for which the stakes are neither too high\nnor too low, such that the monetary payoffs may be taken as at least a\nreasonable approximation of the value of the bets, but this further\nlimits the situations in which a sure loss may be inflicted.\n \n\nIt\nis\nstandardly assumed, as in the version of the DBA given in section\n1.2, that an agent will be willing to buy or sell a bet on \\(S\\) for which\nher credence matches the betting quotient.  But in practice,\nbuying a bet may have a different value for an agent than selling that\nbet, because there is typically a lag between the time that a bet is\nplaced and when it is settled, as Rowbottom (2007) points out.\n Selling a bet involves collecting a sum up front and potentially\npaying out latter, which often has greater value than paying the same\nprice up front and with the potential payoff obtained later.\n This asymmetry between the value of buying and selling bets also\nconstrains the situations in which a Dutch Book can be\nmade.\n\nAnother problem involving the value of bets arises in establishing the\nadditivity axiom, for even if each in a set of bets is acceptable, it\ndoes not follow that they would be jointly acceptable. Consider a\nperson with 4 dollars, who needs 2 dollars for bus fare. He might be\nwilling to take either one of two wagers that cost 2 dollars for a\nchance at winning enough money to buy a newspaper to read on the ride,\nbut be unwilling to risk all 4 dollars, and the possibility of having\nto walk home. One response here is to insist that the bets should be\npresented in terms of utilities rather than money, although this\nraises difficulties of its own, since these are not objective\ncommodities. Such an approach involves assuming either directly or\nindirectly that such utilities are additive, but even this is not\nenough. While it may plausibly be argued that given a set of credences\nand utilities, pragmatic rationality requires maximizing expected\nvalue with respect to those credences and utilities, so that an agent\nwith incoherent degrees of belief is committed to accepting bets\n(paying off in utility) that lead to a sure loss, the problem for the\nDBA remains that being so committed to a sure loss is still not\nnecessarily irrational. See (Maher 1993).\n\nIt is clear that the version of the DBA presented in section 1.2 is\nfar from cogent. There is a gap between the agent’s degrees of\nbelief and the acceptance of bets that would produce a sure loss, and\nthe possibility of such a loss need not entail irrationality. One can\nspecify situations in which the connections are tighter, but this\nfails to establish the general claim of probabilism.\n2. The Dutch Book Argument and Probabilistic Consistency\n2.1 The Dutch Book Argument as Revealing Inconsistency\n\nA popular response to the objections to the DBA considered in section\none suggests that incoherence is not a pragmatic defect per se, and\nthat the Dutch Book is merely a dramatic device for illustrating a\nkind of logical defect. Skyrms (1987) attributes this reading of the\nDBA to Ramsey, finding support in his remarks that\n\nAny definite set of degrees of belief which broke them [the laws of\nprobability] would be inconsistent in the sense that it violated the\nlaws of preference between options…If anyone’s mental\ncondition violated these laws, his choice would depend on the precise\nform in which the options were offered him, which would be absurd. He\ncould have a book made against him by a cunning bettor and would stand\nto lose in any event. (Ramsey 1926, p. 41)\n\n\nAdditional support for this interpretation can be found in\nRamsey’s assertion that the subject of his paper is the\nlogic of partial belief.\n\nMany authors, including Armendt (1993), Christensen (1996, 2004),\nHellman (1997), Howson and Urbach (1993), and more recently, Briggs\n(2009) and Mahtani (2015),  have endorsed and elaborated upon the\nidea that violation of the probability axioms amounts to a kind of\ninconsistency. For example, Armendt (1993) tells us that it involves\nan inconsistency that is revealed by the fact that degrees of belief\nguide action, and that Dutch Book vulnerability amounts to giving\nconflicting evaluations to the same option(s). He calls this\n“divided-mind” inconsistency, which he says is a flaw of\nrationality. This fits the typical sort of case where an agent\nviolates additivity, and sometimes applies to violations of the other\naxioms, but incoherence does not always entail having two different\nevaluations of the same option. Although degrees of belief often serve\nas guides to action, they need not be tied to an evaluation of options\nat all. However, it is a fundamental assumption of most versions of\nthe DBA that credences do have such a role, as in the theories of\nRamsey and de Finetti, so it is of interest that even with this\nassumption, incoherence need not involve giving conflicting\nevaluations (Vineberg 2001). Consider for instance a person who is\nless than fully confident of Fermat’s Last Theorem, perhaps\nbecause they don’t know that it has been proven. On at least\nsome ways of understanding propositions, this need not entail\nattaching two different judgments to the same proposition. One could\nalso violate coherence by only attaching a probability of less than\none to a single proposition that is a logical truth, or one could\navoid different evaluations by having the same level of confidence in\nevery proposition. These examples aside, even the additivity axiom is\nproblematic on Armendt’s interpretation, for it requires, for\nmutually exclusive propositions \\(p\\) and \\(q\\),\nthat joint bets on \\(p\\) and on \\(q\\)\namount to the same option as a bet on \\(p\\)\nor \\(q\\). This in turn presumes that\nvalues are additive, which goes beyond simply having degrees of\nconfidence in \\(p, q\\), and their disjunction, although Armendt (1993)\nsuggests that the assumption is generally met and appropriate for the\npurposes of the DBA.\n\nIn “Truth and Probability”, Ramsey assumes that, at least\nunder idealized conditions, degrees of belief manifest themselves in\npreferences for options. This allows Ramsey to characterize the\ninconsistency involved in violating the probability axioms in terms of\nviolating the axioms of rational preference. While he never claims\nthat degrees of belief are necessarily linked to preferences, the\nmodel of belief and preference that he offers assumes such an\nassociation, and indeed a great achievement of the paper is what\namounts to a representation theorem establishing that an agent\nsatisfying the axioms that he specifies for rational preference can be\nrepresented as having degrees of belief that satisfy the probability\naxioms. In the model he offers, degrees of belief serve as guides to\naction through their connection with preferences, so that therein at\nleast incoherence does manifest itself in preference\ninconsistency. But the way that Ramsey casts the inconsistency\ninvolved in violating the axioms in terms of preference inconsistency\nleaves it unclear that his goal of characterizing the logic of partial\nbelief has been satisfactorily met. One trouble is that it does not\nshow us that the preference inconsistency to which incoherent beliefs\nare tied is appropriately analogous to inconsistency for simple (or\nfull) belief, which involves believing inconsistent propositions, i.e.\na set of propositions that cannot all be true. Another worry is that\nin Ramsey’s model degrees of belief are linked with preferences,\nand it seems that having a degree of belief does not by its nature\nrequire any such connection with preference and action. One can surely\nhave finely graded beliefs in propositions without those beliefs being\nconnected to preferences.  Moreover, consistency for full belief\nderives from the concept of belief as holding propositions to be true\nand from the logic of propositions, without any such assumed tie to\naction, and although Ramsey thought that such a connection was\nnecessary to clarify the idea of partial belief, it seems that a fully\nanalogous characterization of consistency for partial belief should do\nwithout it.  \n2.2 Depragmatized Arguments\n\nSeveral philosophers have sought to establish coherence as a\nconsistency constraint on degrees of belief through a version of the\nDBA that does not presuppose any definite connection between degrees\nof belief and preference (Christensen 1996, 2004; Howson and Urbach\n1993; Hellman 1997). These so-called depragmatized arguments\npurport to improve upon Ramsey’s treatment by making clear how\ncoherence is supposed to mirror the ordinary notion of consistency.\nHowson and Urbach attempt this by identifying an agent’s degree\nof belief in \\(M\\) with the bets she regards as fair,\nsuch that for credence \\(q\\) in \\(M\\), a\nbet with cost $\\(Sq\\) that pays\n\n\n\n\\($S\\)\nif \\(M\\) \n\n\\($0\\)\notherwise  \n\n\nis taken as fair. They then employ the Dutch Book theorem to argue\nthat incoherent degrees of belief cannot in fact be fair betting\nquotients, and thus that incoherence involves taking a set of bets as\nfair that cannot be fair, which is supposed to parallel having\ninconsistent beliefs.\n\nThere are several problems that undermine Howson and Urbach’s\napproach. The most basic is that an agent with degree of belief \\(q\\)\nin \\(M\\) need not regard bets of the\nabove form as fair for a variety of reasons. To begin with she may\nsimply lack the concept of a fair bet. Secondly, she could have\ncredence \\(q\\), yet acknowledge the bet above as\nexplicitly unfair. For instance, if she knows \\(M\\) to\nbe either a logical truth or a logical falsehood, but has no idea\nwhich, her confidence that it is true could be ½, though she\nmay well know that this would not be a fair betting quotient for it.\nCasting credences in terms of the bets that are regarded as fair is\nalso problematic in that it appears to associate degrees of belief\nwith having certain full beliefs, which some take to be problematic.\nThe argument also clearly falters over the additivity axiom, since\neven if an agent regards each of a set of bets as individually fair,\nthey may not be collectively fair by her lights, so she need not\nevaluate the bets required to produce a book as fair bets. Here, and\nin the basic assumption about the individual bets that an agent finds\nfair, it is in effect assumed that money acts as a measure of value.\nNot only is this not generally true, it calls attention to the fact\nthat the argument has not really been depragmatized. While Howson and\nUrbach do not rely on either the assumption that agents will (or\nshould) act in accordance with their degrees of belief or that they\nshould be willing to accept either direction of a fair bet, they do\nassume that agents make evaluations of bets, which are tied to the\nconcept of pragmatic value. Maher (1997) argues that their way of\nspelling out fairness in terms of a primitive concept of advantage, so\nas to avoid the notions of preference and utility, fails. Indeed, it\nis hard to see that the latter notions can be avoided in explicating\nthe concept of fairness, upon which their argument depends.\n\nA similar argument is offered by Christensen (1996), except that his\ndepragmatized DBA further weakens the connection between degrees of\nbelief and bets. Where Howson and Urbach specify that an agent will\nregard a bet as fair, Christensen assumes only that the bet is\nsanctioned as fair or justified by the agent’s beliefs, thus\navoiding the first objection to Howson and Urbach’s treatment.\nHe then invokes the Dutch Book theorem to argue that incoherent\ndegrees of belief sanction as fair a set of bets that cannot be fair,\nand claims this reveals that incoherence is fundamentally an\nepistemic, and indeed a logical, defect. But his argument clearly\nfaces the previous difficulty over the additivity axiom since, even if\ntwo bets are sanctioned individually, it does not follow that they are\nsanctioned jointly. In response to this problem, Christensen (2004)\nmodified his argument by restricting the assumption about the\nsanctioning of bets to “simple agents” who value only\nmoney, value it linearly, etc., so that monetary payoffs function as\nutilities for them. He then argued that degrees of belief that violate\nthe probability axioms in a simple agent are rationally defective\nbecause they sanction bets that would be guaranteed to lose money.\nFrom this he claimed that since it is the incoherent beliefs\nthemselves that have been shown to be defective, such beliefs are\nrationally defective in all agents.\n\nHere again, the pragmatic dimension of the argument seems to have been\nmerely submerged. Degrees of belief do not sanction bets in isolation\nfrom preference, and so the alleged defect in the simple agent who\nviolates the probability axioms cannot be pinned merely on those\nbeliefs. Since it is not the simple agent’s beliefs themselves\nthat have been shown to be defective, but rather those beliefs in\ncombination with her preferences, the inference that incoherent\ndegrees of belief are rationally defective in all agents is invalid.\nFor all that has been shown, such beliefs might be fine in combination\nwith a different preference structure. Not only is it premature to\nconclude that incoherence is rationally defective generally,\nChristensen has not argued convincingly that incoherence is rationally\nor logically defective even in simple agents. It could be rational for\na simple agent to be incoherent if she were surrounded by “Czech\nbookies”, who will offer bets so that she is on the winning,\nrather than the losing, side of the book, because in this situation\nincoherence will lead to satisfaction of her one goal as a simple\nagent of increasing her monetary gain. Of course it is incoherence as\na logical defect, rather than one of means/ends rationality, that is\nChristensen’s focus, but since sanctioning bets as fair that\ncannot be fair is not a property of incoherent credences alone, he has\nnot shown incoherence to be on a par with inconsistency with full\nbelief, where the defect lies with the beliefs themselves.\n2.3 Coherence as a Pragmatic Consistency Constraint\n\nThe depragmatized DBAs attempt to use the Dutch Book theorem to show\nthat incoherent degrees of belief involve a kind of inconsistency on\ntheir own, irrespective of the way in which they link up with\nparticular preferences. But the claim of inconsistency here requires\nthat credences be tied to evaluations of fairness, which in turn\ninvokes a concept of valuation that goes beyond merely having degrees\nof belief. If an agent’s degrees of belief are incoherent, and\nhe makes evaluations of bets using the standard expectation rule, then\nthere will be bets (with payoffs in some measure of utility) such that\ncalculated individually these will have expected value zero, and will\nin this sense be fair by his lights, but which lead to a net loss, and\nso may be said to be unfair. The unfairness can be deduced from the\nagent’s beliefs and their connection with the agent’s\nutilities, which establishes the defect brought out by the Dutch Book\nas internal to the agent, marking a crucial difference between the\nloss so inflicted and the sort requiring superior factual knowledge on\nthe part of the bookie. While the linkage between the agent’s\ncredences and his evaluation of bets is crucial to this result, the\nneeded connection is independent of the agent’s particular\npreference for goods, and so it could be said that the failure to\ncorrespond to fair betting quotients is a property of the\nagent’s beliefs, as tied to evaluations of acts, yielding the\nresult that incoherent credences, appropriately connected with\npreference, display a property that is analogous to inconsistency for\nfull belief.\n\nThere is then a version of the DBA that seems close to what Ramsey had\nin mind, which claims that insofar as degrees of belief link up\nsuitably with preferences, incoherence is associated with a property\nmirroring inconsistency, although this still need not amount to\ndivided-mind inconsistency in Armendt’s sense, nor is it\nentirely akin to inconsistency for full beliefs, which are\ncharacterized directly without any assumed connection to preference\nand action. The agent by whose lights each of a set of bets looks fair\n(or favorable), that is, should be evaluated as fair (or\nfavorable) although they lead collectively to a Dutch Book, which can\nbe set up by examining simply the agent’s credences, has a\nsystem of evaluation that is self-defeating, and as such may be said\nto exhibit a form of irrationality. On this reading, the vulnerability\nassociated with incoherence is theoretical, and linked closely with\nthe agent’s utilities, which means that actual vulnerability\ndepends not only upon an appropriately situated bookie, but also upon\nthe availability of suitable commodities that measure those utilities.\nWith this in place, bets can be fixed that constitute a book on the\nbasis of the agent’s credences, but which are fair (or\nfavorable) by the agent’s lights.  Notice that the\nprevious points, that an agent might avoid book by refusing to bet and\nthat one might end up on the side of a sure gain, are now otiose, for\nhere it is the agent’s evaluations, rather than their\nconsequences that are implicated by the Dutch Book.  Still, the\nDBA depends upon the theory of preference and utility, and as Kaplan\nnotes (Kaplan 1996), this does not emerge straightforwardly from\nstandard presentations of the argument of the sort considered in\nsection one, nor in the depragmatized versions, as observed in the\nprevious section.  \n\nThe assumptions of the DBA are significant. It is the agent’s\nsystem of credences together with the way they are involved in\nevaluating options that is implicated by the Dutch Book. To conclude\nthat simply having incoherent credences is irrational, a further\nargument is needed showing that rationality demands that credences be\nlinked to evaluations of bets as in the DBA, but there is little to\nsuggest that graded degrees of belief must be so connected. Indeed,\nthe DBA assumes not only that there is some connection between an\nagent’s credences and the evaluation of options, but that one\nshould evaluate a bet as fair if it has an expected value of zero,\nusing one’s credences with the standard expectation rule. This\nbuilds in that an agent’s credences are related such that for\neach \\(H\\), \n\n\\[ \\cr(\\text{not }H) = 1 - \\cr(H). \\]\n\n\nHedden calls attention to this assumption, which he terms Negation\nCoherence, noting that it follows from the claim that credences\nsatisfy finite additivity and normalization (Hedden 2013). The premise\nof the DBA that connects credences with fair betting quotients thus\npresupposes a significant part of the probabilist’s claim.\n \n\nEven assuming the appropriate kind of connection between credences and\nevaluations of options, it may be objected still that the sort of\ninconsistency revealed through the Dutch Book vulnerability involved\nin violating the probability axioms is not necessarily\nirrational, particularly in cases where this is due to the failure to\ngrasp some subtle or complex logical or other\nnecessary truths. It is hard to see that rationality requires\nagents to attempt to remove such inconsistencies in their belief\nsystems; indeed for most it would be both hopeless and\ncounterproductive. Nor does it seem correct to count as more rational\nthe person who avoids inconsistency, by refusing to have an opinion in\nthe face of evidence, than the person with less than full confidence\nin a logical truth, who takes the incomplete evidence into account.\nOne option is to insist that coherence is a requirement on ideal\nagents. It might be suggested instead that coherence is one of a\nnumber of ideals, whose satisfaction may sometimes conflict, and that\nan incoherent agent may still be rational in the sense that they have\noptimally managed their opinions in light of the totality of their\ngoals and constraints. Whatever the conclusion about the irrationality\nof being incoherent though, with idealizing assumptions about the\nconnection between degrees of belief and the evaluation of options,\nthe DBA succeeds in establishing incoherence as an evaluative defect.\n \n\nThere\nremain some disputes about how to understand the DBA for probabilism,\nand whether it provides an appropriate defense for the claim.  As\ndiscussed, some take the DBA to show that the probability axioms are a\ncondition of consistency for action guiding degrees of belief, where\nhaving incoherent credences involves faulty evaluations of\noptions.  It is sometimes added that incoherence thus indicates a\nform of epistemic irrationality.  Although incoherence may be\nheld to depart from a certain ideal of rationality in this way, it\nneed not mean that it is, all things considered, irrational to violate\nthe probability axioms, as noted by Huttegger (2013).  On this\nunderstanding, the claim that violating the probability axioms is a\nform of irrationality proceeds from the claim of inconsistency. \n\n\nOthers\nwho accept the idea that the problem with Dutch Book vulnerability is\nnot that it leads to bad consequences, but that it signals an internal\ndefect in the agent’s credences, simply say that DBAs that meet\ncertain conditions, including being constructible by a bookie without\nrequiring more than knowledge of the agent’s credences,\nestablish that the credences leading to a Dutch Book under these\nconditions display a form of irrationality, without suggesting that\nDutch Book vulnerability is form of inconsistency. Both ways of\nunderstanding DBAs have been carried over to arguments in support of\nadditional probabilistic norms.\n\n\nTaking\nthe view that Dutch Book vulnerability indicates a form of\ninconsistency has the advantage that it makes clear the sort of\nirrationality involved in cases of Dutch Book vulnerability, and\navoids the implausible claim that rationality always requires avoiding\nDutch Book vulnerability.  However, the view faces a difficulty\nin that the Dutch Book vulnerability for those who violate other\nproposed norms of probability seems less clearly a matter of\ninconsistency, as will be suggested in the following sections. \nThose who understand DBAs as proceeding directly from Dutch Book\nvulnerability to the claim of irrationality, without the intermediate\nconclusion that Dutch Books indicate inconsistency, must qualify what\nis to count as Dutch Book vulnerability and the sort of irrationality\nthat is at stake.  Pettigrew (2020) suggests that the relevant\nsort of Dutch Book vulnerability is a sure loss in every world that is\nepistemically possible for the agent, and that the conclusion to draw\nfrom this is that someone who is so vulnerable is epistemically\nirrational. Insofar as it is epistemic rationality that is of concern,\nthis formulation has the virtue of not counting the person who could\nbe made to lose money in every metaphysically possible world, on the\nbasis of having less than full confidence in some metaphysical truths,\nas subject to a proper Dutch Book and so irrational.  But, this\nstill leaves questions about what is to count as epistemically\nrational, and how in general this lines up with Dutch Book\nvulnerability.  Questions remain too about whether the pragmatic\nbasis of the Dutch Book argument offers appropriate grounds for\ndefending probabilistic norms of epistemic rationality, and this has\nspurred interest in alternative nonpragmatic justifications of such\nnorms.  See Pettigrew (2019).\n\n3. A Dutch Book Argument for Countable Additivity\n\nGiven a countable infinity of mutually exclusive and exhaustive ways\n\\(W_i\\) in which the proposition \\(A\\) can be true, the\nPrinciple of Countable Additivity requires that \n\n\\[ \\pr(A) = \\sum_{i=1}^{\\infty} \\pr(W_i). \\]\n\n\nA Dutch Book argument can be constructed for the principle by\nextending the Dutch Book for finite additivity (Adams 1962; Jeffrey\n2004; Williamson 1999) by appealing to an infinite set of bets that\neach pay $1 if \\(W_i\\) is true for the price \\(\\pr(W_i)\\). In the case\nof the Dutch Book argument for countable additivity, there is an\nadditional reason beyond those for the basic argument to favor the\ninterpretation of it, as Jeffrey does, as establishing the principle\nas a consistency constraint, since the loss is purely theoretical.\nThere is no threat of an actual loss to an agent since this would\nrequire an infinite series of bets, which cannot all be made and\nsettled. However, the principle itself is controversial, making the\nDutch Book argument for countable additivity highly provocative. Both\nde Finetti (1972) and Savage (1954) argued that the principle should\nnot be invoked as a constraint on rational degrees of belief.  A\nconsequence of the principle is that it prohibits positive credences\nthat are uniformly distributed over a countably infinite partition,\nand yet it seems at least acceptable, in the absence of a reason to\nfavor some possibilities over others, to adopt such a distribution.\nIntuitively, a uniform distribution ought to count as consistent,\nwhich puts pressure on the idea, at least when it comes to countable\nadditivity, that Dutch Books reveal a defect that is substantially\nanalogous to inconsistency. In the background, as with the basic\nargument, the Dutch Book argument for countable additivity makes\nsignificant assumptions about how degrees of belief are linked with\npreference and assessments of value. For details concerning how these\nrelate to the demand that an agent’s degrees of belief satisfy\ncountable additivity, see (Seidenfeld and Schervish 1983).  For a\nrecent critical discussion of the argument, see Pettigrew (2020).\n4. Diachronic Dutch Book Arguments\n\nThe basic idea behind the Dutch Book argument for probabilism has been\nused in defense of a variety of principles that purport to govern how\nbeliefs should evolve over time. In each case, it is argued that the\nagent who violates the principle is subject to a Dutch Book. Here, the\nbets involved are placed at different times, but there is an algorithm\nfor placing the bets that is available at the outset guaranteeing a\nprofit to one side. Such arguments are generally referred to as\n“Dutch Strategy” arguments.\n4.1 Conditionalization\n\nThe Rule of Conditionalization is commonly endorsed for updating\nprobabilities in response to new information.  It states\nthat an agent with the probability function \\(\\pr_1\\) at time \\(t_1\\)\nwho learns \\(E\\) and nothing stronger at time \\(t_2\\)\nshould obtain her new probability function \\(\\pr_2\\) from her old\nprobability function by conditionalizing on \\(E\\), i.e.\nfor each proposition \\(A\\), \\(\\pr_2(A) = \\pr_1(A\\mid\nE)\\), where the\nconditional probability\n\\(\\pr(A\\mid E)\\) is given in terms of the ratio formula: \\(\\pr(A\\mid E) = \\pr(A\n\\& E)/\\pr(E)\\).  There\nis a Dutch Book (strategy) argument purporting to show that an agent\nought to change beliefs by conditionalization, which was constructed\nby Lewis (1999), but was first reported by Teller (1973).  If an\nagent violates this rule by adjusting her probabilities such that\n\\(\\pr_2(A) \\lt \\pr_1(A\\mid E)\\), a bookie can inflict a sure loss by\nfirst selling the agent the following three bets:\n\n\n\n(Bet 1)\nfor \\(\\pr_1(A\\wedge E)\\): \n\n \n\\($1\\)\nif \\(A \\wedge E\\) \n\n \n\\($0\\)\notherwise  \n\n\n\n\n(Bet 2)\nfor \\(\\pr_1(A\\mid E)\\pr_1(\\neg E)\\): \n\n \n\\($\\pr_1(A\\mid E)\\)\nif \\(\\neg E\\) \n\n \n\\($0\\)\notherwise  \n\n\n\n\n(Bet 3)\nfor \\([\\pr_1(A\\mid E) - \\pr_2(A)]\\cdot\n\\pr_1(E)\\): \n\n \n\\($\\pr_1(A\\mid E) - \\pr_2(A)\\)\nif \\(E\\) \n\n \n\\($0\\)\notherwise  \n\n\nIf \\(E\\) is false, the agent has a net loss of\n[\\(\\pr_{1}(A\\mid E) -\\) \\(\\pr_{2}(A)\\)] \\(\\pr_{1}(E)\\). If \\(E\\)\nis true, then the bookie buys back a fourth bet:\n\n\n\n(Bet 4)\nfor \\(\\pr_2(A)\\): \n\n \n\\($1\\)\nif \\(A\\) \n\n \n\\($0\\)\notherwise  \n\n\nBets 1 and 2 together amount to a conditional bet on \\(A\\),\nwhich is called off if \\(E\\) is\nfalse. In the event that \\(E\\) is true, this bet is\nbought back at the lower price of \\(\\pr_{2}(A)\\). Bet 3 spreads the\nexpected winnings of that exchange in order to assure a profit in the\ncase that \\(E\\) is false. Thus, if \\(E\\)\nis true the agent suffers a net loss of [ \\(\\pr_{1}(A\\mid E) -\n\\pr_{2}(A)\\)] \\(\\pr_{1}(E)\\). If \\(\\pr_{2}(A) \\gt \\pr_{1}(A\\mid E)\\),\nthen the strategy involves reversing the direction of the above bets.\nWhere dollars are taken as measures of utility, each bet is fair given\nthe agent’s beliefs at the time offered.  There is also a\nconverse Dutch Book theorem that shows that adhering to\nconditionalization avoids Dutch Book vulnerability Skyrms\n(1987b).\n\nWhile\nthe argument has often been cited\nin support of the Rule of Conditionalization as characterized above,\nthere are significant assumptions and limitations to Lewis’\nDutch Strategy argument in defense of the claim that rational updating\nrequires conditionalization on the evidence in accordance with the\nrule.  As\nvan Fraassen points out, the Dutch Strategy given above does\nnot yield an argument for the diachronic Principle of\nConditionalization as stated (van Fraassen 1989). There is no strategy\nfor the bookie that guarantees him a profit from an agent for whom\n\\(\\pr_{2}(A) \\ne \\pr_{1}(A\\mid E)\\) unless the agent makes a\ncommitment to violate the rule in a particular way in advance. The\nidea that the above bets constitute a betting strategy yielding a\nDutch Book tacitly assumes that the agent’s alternative rule \\(D\\)\nis fixed at time \\(t_{1}\\), before it is known\nwhether or not \\(E\\) is true, and that the agent is\nsure to follow the rule if \\(E\\) is learned.\n\nHowever, the bookie can guarantee himself a profit in some cases even\nif it is not assumed that the agent will follow though by placing a\nside bet that he wins in the event that the agent does not change\nbeliefs as planned. The Dutch Strategy depends upon the fact that the\nagent initially has some definite probability that he will shift\nprobabilities in the event that \\(E\\), in some\nparticular way that is not the result of conditionalization on \\(E\\).\nThe Dutch Strategy argument in no way establishes\nthat one must have such a probability, and so at most shows that one\nshould not have a plan involving a fixed probability to update upon\nlearning \\(E\\) in a way that differs from\nconditionalizing on \\(E\\).\n\nEven where it is assumed that an agent is fully committed to following\nthrough on some alternative to the Rule of Condtionalization, there\nare questions about what the Dutch Strategy shows. As with the basic\nDBA for probabilism, it is possible to devise scenarios in which it\nwould be rational to leave oneself open to a Dutch Strategy by\nannouncing a deviant updating rule, and so the Dutch Strategy argument\nshould not be taken to show that it is strictly irrational to have an\nupdating rule other than Conditionalization. Rather, the existence of\nthe strategy points to a tension in adopting such a rule. Shifting\nfrom \\(\\pr_{1}\\) to \\(\\pr_{2}\\) by conditionalizing on \\(E\\)\nis equivalent to invariance, i.e. for each\nproposition \\(A\\), \\(\\pr_{1}(A\\mid E) =\\)\n\\(\\pr_{2}(A\\mid E)\\). Adopting a rule for updating other than\nConditionalization is thus tantamount to holding at time \\(t_{1}\\)\nthat for some \\(A\\), \\(\\pr_{1}(A\\mid E) \\ne\\)\n\\(\\pr_{2}(A\\mid E)\\). Note that the bookie simply takes advantage of\nthe difference between the agent’s probability for A given \\(E\\)\nat \\(t_{1}\\) and at \\(t_{2}\\). Where the agent is\ncertain at \\(t_{1}\\) that he would update via some deviant rule \\(D\\),\nthe rule induces a conditional probability at that\ntime for \\(A\\) given \\(E\\) that differs\nfrom \\(\\pr_{1}(A\\mid E)\\). In such a case, \\(\\pr_{2}(A\\mid E)\\) is\nfixed at \\(t_{1}\\) by the agent’s credal state, and so given\nthat \\(\\pr_{1}(A\\mid E) \\ne\\) \\(\\pr_{2}(A\\mid E)\\), the agent’s\ncredences may be said to exhibit a kind of inconsistency. While this\nis problematic in a way that the sort of inconsistency involved\nin simply having different levels of confidence for a proposition at\ndifferent times is not, it appears less like inconsistency for full\nbelief than failing to obey the probability axioms, where the agent\nhas evaluations according to which each in a set of bets is fair at a\nsingle time. While \\(\\pr_{2}(A\\mid E)\\) may be fixed at \\(t_{1}\\),\nthis is not the agent’s conditional probability at \\(t_{1}\\),\nbut rather the probability for \\(A\\) given \\(E\\)\nthat she will come to have at \\(t_{2}\\) upon learning\n\\(E\\). Such updating plans are part of the\nagent’s credal system though, for which Dutch Book vulnerability\nmay plausibly be held to signal a defect.\n\nThe Dutch Strategy against the non-conditionalizer, as described\nabove, also depends upon the assumption that either E will be learned\nor the altenative not E will be learned.  Otherwise, there is no\nguarantee that a loss can be inflicted, even if, on the condition that\nE is learned, the agent plans to adjust her credences such that\n\\(\\pr_2(A) ≠\\pr_1(A\\mid E)\\).  More generally, the existence of a\nDutch Strategy assumes a learning scenario in which the agent’s\npossible total evidence is one of a set of propositions \\(\\{E_1, E_2,\n\\ldots, E_n\\}\\) that characterize what can be learned. \n\nGallow (2019) calls attention to the fact that the Rule of\nConditionalization as stated in the form above does not depend upon\nthe possible evidential propositions that may be learned, but only the\nprior credences and what is actually learned.  Constructing a Dutch\nStrategy against a non-conditionalizer requires having a rule that\nspecifies how they will update their credences given the alternative\npossible evidence that they might have learned.  So, at most the Dutch\nStrategy Argument defends the Rule of Conditionalization in an\nappropriate learning scenario that specifies the possible evidence\nthat may be obtained.  Gallow also emphasizes that the propositions in\nthe learning scenario must form a partition, as some presentations\nexplicitly assume.  If they do not, that is some of the \\(E_i\\)\noverlap, he shows that Dutch Strategies are possible against\nconditionalizers. For instance, where \\(E_1\\) and \\(E_2\\)\nare the evidential propositions that may be learned and they overlap,\nlearning either will raise the conditionalizer's credence in their\nconjunction.  A Dutch Strategy can be constructed that takes advantage\nof the difference between the prior credence for the conjunction and\nthe foreseeable rise in the conjunction upon either learning\n\\(E_1\\) or learning \\(E_2\\). Gallow suggests that learning\nscenarios may exist in which the possible evidence fails to form a\npartition, and that evidence can be acquired outside of any learning\nscenario at all.\n\n\nThese\nobservations put significant pressure on the Dutch Strategy argument,\nespecially when the argument is read, as Gallow does, as drawing the\nconclusion that violating the Rule of Conditionalization is\nepistemically irrational on the grounds that doing so involves\nvulnerability to a Dutch Strategy. The Rule of Conditionalization, as\nstated above, says to conditionalize on the evidence E obtained,\nirrespective of the evidence that might have been obtained instead, so\nin particular it counsels conditionalizing both in learning scenarios\nthat form a partition and those that do not. But, as Gallow shows,\nconditionalizing in the latter case can involve vulnerability to a\ndiachronic Dutch Book, so Dutch Strategy vulnerability fails to\ndiscriminate between cases in which the rule, as characterized above,\nis adopted and cases in which it is violated.\n \n\nOne\noption for preserving the force to the Dutch Strategy argument for the\nRule of Conditionalization as given is to insist that ideally\nrational agents will always obtain evidence in a learning scenario\nthat forms a partition, which is a view that Gallow plausibly\nattributes to Lewis (1999). Even if this is right for highly idealized\nepistemic agents, it leaves the status of the Principle of\nConditionalization unclear in more ordinary circumstances and so fails\nto establish the principle as a general norm. Moreover, such a defense\nof conditionalization would depend upon more than just the claim\nthat vulnerability to a Dutch Strategy involves irrationality, but\nalso upon the claim that there are rationality constraints on possible\nlearning scenarios.   \n\nAn alternative is simply to amend the Rule of Conditionalization to\nbuild in that it only applies in learning scenarios that form a\npartition. This would allow for a Dutch Strategy argument for the\nnarrower claim that epistemic rationality requires conditionalizing in\nlearning scenarios that form a partition, provided that the notion of\nepistemic rationality here also makes sense of the Dutch Strategy\nvulnerability of conditionalizers in other learning scenarios. \n\nOne more limitation to observe about Lewis’ Dutch Strategy\nargument for changing credences by Conditionalization stems from his\nformulation of the principle itself in terms of the ratio formula,\nwhich requires that the prior probability of the evidence\nconditionalized on is non-zero.  Rescorla (2019) addresses this by\ngiving a form of conditionalization, which he terms Kolmogorov\nConditionalization, that permits conditionalizing on evidence with\nnull priors. He then proves a Dutch Book theorem and converse for it,\nwhere the theorems involve generalized learning scenarios.  \n4.2 Jeffrey Conditionalization\n\nJeffrey proposes a further Generalized Conditionalization Rule (also\ntermed Probability Kinematics or Jeffrey\nConditionalization) to cover cases in which experience does not\nmanifest itself in some evidential proposition \\(E\\)\nshifting to one, but rather stems from a shift in probabilities over\nsome partition \\(\\{E_{i}\\}\\) (Jeffrey 1983). Jeffrey’s Rule\nstates that \n\n\\[ \\pr_2(A) = \\sum_{i=1}^{n} \\pr_1(A \\mid E_i) \\pr_2(E_i), \\]\n\n\nwhich is equivalent to the invariance condition that \\(pr_1(A\\mid E_i)\n= pr_2(A\\mid E_i)\\), for each element \\(E_i\\) of the partition. To\nmaintain that updating goes by Jeffrey Conditionalization is to\nmandate invariance for each proposition \\(A\\). This\nmight seem to be required, as Armendt shows that a Dutch Strategy can\nbe constructed against an agent who has a rule for updating that\nconflicts with Jeffrey’s Rule (Armendt 1980). As with the Rule\nof Conditionalization though, the Dutch Strategy does not show that\nthere is any problem with having probabilities over a partition, and\nthen abandoning one’s prior conditional probabilities over that\npartition, that is violating invariance; the problem is with adopting\na rule of this sort in advance. As with the simple Rule of\nConditionalization, Skyrms (1987b) shows that there is also a converse\nDutch Strategy argument showing that following Jeffrey’s Rule\navoids a Dutch Book.  It is built in here that Jeffrey’s Rule\napplies in cases in which credences shift over a partition, but as\nbefore if the agent’s learning scenario does not form a partition,\nGallow (2019) shows that, as with the Simple Conditionalization,\nJeffrey Conditionalizers may be subject to a Dutch Strategy as\nwell. \n\nWhile the Rule of Conditionalization is generally presented as\ndemanding that agents satisfy invariance for each proposition, and\nvarious authors have rightly complained that this demands an\nunreasonable rigidity of belief (Bacchus, Kyburg, and Thalos 1990;\nLevi 2002), Jeffrey does not treat the condition as a strict\nrequirement on rational belief change (Jeffrey 2004). He leaves open\nthe possibility that when probabilities are shifted over a partition,\nthe conditional probabilities could change, although this leaves the\nunanswered question as to when invariance is reasonable to assume. In\nany case, as with the Simple Rule of Conditionalization, the Dutch\nStrategy argument here tells in the same way against planned\nviolations of invariance.  \n4.3 The Principle of Reflection\n\nA Dutch Strategy argument has also been given for the controversial\nPrinciple of Reflection, which requires that for any proposition \\(A\\)\nand any future time \\(t\\), an\nagent’s current probability for \\(A\\) conditional\non later assigning it probability \\(r\\) is itself \\(r\\),\nthat is pr \\((A\\mid \\pr_{t}(A) = r) = r\\). In\nviolating Reflection, the agent fails to endorse certain of her\npossible future judgments, which as van Fraassen showed (van Fraassen\n1984), opens the door to a Dutch Strategy. If the agent violates\nReflection in that \\(\\pr(A\\mid \\pr_{t}(A) = r) \\gt r\\), the bookie\nsells the following bets:\n\n\n\n(Bet 1)\nfor \\(\\pr(A \\wedge \\pr_t(A) = r)\\): \n\n \n\\($1\\)\nif \\((A \\wedge \\pr_t(A) = r)\\) \n\n \n\\($0\\)\notherwise  \n\n\n\n\n(Bet 2)\nfor \\(x\\,\\pr(\\pr_t(A)\\ne r)\\): \n\n \n\\($x\\)\nif \\(\\pr_t(A)\\ne r\\) \n\n \n\\($0\\)\notherwise  \n\n\n\n\n(Bet 3)\nfor \\((x-r)\\,\\pr(\\pr_{t}(A) = r)\\): \n\n \n\\($x-r\\)\nif \\(\\pr_t(A) = r\\) \n\n \n\\($0\\)\notherwise  \n\n\nwhere \\(x = \\pr(A \\mid \\pr_{t}(A) = r)\\).\n\nIn the event that \\(\\pr_{t}(A) = r\\), the bookie then buys a fourth\nbet from the agent on \\(A\\) with a prize of 1, with a\nprice of the agent’s new probability.\n\nThe idea that the existence of such a strategy shows that agents\nshould satisfy Reflection has been widely disputed, even by many who\ntake the Dutch Book arguments for probabilism and conditionalization\nas having force. Much of the discussion stems from a variety of\ncounterexamples to Reflection in which it appears irrational not to\nviolate the principle. One example, due to Talbott, turns on the fact\nthat real agents lack perfect recall (Talbott 1991). He considers a\nperson who had spaghetti \\((S)\\) the previous night, say November 16,\nand contemplates the probability that she will give to her having\neaten spaghetti on that day in year’s time. Since she eats\nspaghetti on average one out of every ten days, she thinks it likely\nthat \\(\\pr_{t}(S) = 0\\).1. But surely she should not assign a\nprobability of 0.1 to her having had spaghetti the previous night\nconditional on the claim that \\(\\pr_{t}(S) = 0\\).1, since she is\nnearly certain (say \\(\\pr_{t}(S) = 0\\).99) of what she had for dinner\nthe previous night.\n\nThe forgetting that makes it reasonable to violate Reflection in\nTalbott’s spaghetti dinner example involves one type of limited\nfuture impairment. Christensen gives a different case in which an\nagent has just consumed a mind-altering drug (LSQ) that he expects in\nhour’s time will make him believe that he can fly, without\nconferring upon him any such power (Christensen 1991). However, this\nis the only effect of the drug, so that the agent’s faculties\nwill remain otherwise acute. Before the drug takes effect, the agent\nshould not take his probability that he can fly conditional on his\ncoming to believe it in an hour to be high, as required by Reflection,\nbecause what he will think when under the influence is irrelevant to\nhis ability to fly. A similar example involving Ulysses and the Sirens\nis discussed by van Fraassen (1995).\n\nIt is important in both of these examples that it is not only\nreasonable to violate Reflection, but that to do otherwise would\ninvolve failing to properly account for the evidence about the\nunreliability of one’s future beliefs. Christensen’s own\nresponse involves arguing that because the bets in diachronic Dutch\nBook arguments are made over time, unlike in the synchronic argument\nfor the probability axioms, they do not reveal a form of inconsistency\nthat is generally irrational. One of several troubles with this is\nthat it would require rejecting the claim that the Dutch Strategy\nagainst agents who plan to violate Conditionalization reveals any sort\nof problematic inconsistency. Other problems with Christensen’s\nresponse are discussed in (Vineberg 1997).\n\nOthers have tried to respond to the counterexamples by distinguishing\nfeatures of the Dutch Strategy argument for Reflection that do not\ninvolve dismissing all diachronic Dutch Book arguments. For instance,\nHitchcock emphasizes that it is important to consider what the bookie\nknows in assessing the relevance of Dutch Books on an agent’s\nrationality (Hitchcock 2004). He observes that unlike the case in\nwhich an agent violates the probability axioms, where the bookie can\ndetermine and place the bets with only the knowledge of the\nagent’s beliefs, in Talbott’s example, the bookie may need\nto exploit information that is unavailable to the agent in order to\nmake the Dutch Book.\n\nTaking into account what a bookie needs to know in order to guarantee\nhimself a profit fails to distinguish adequately between the Dutch\nBooks that appear to be norms of rationality and those that do not.\nFirst, as Hitchcock acknowledges, this won’t work to resolve the\ntension between the Dutch Strategy argument for Reflection and many of\nthe other counterexamples. In Christensen’s example, taking LSQ\ndoes not have any effect on memory, it merely changes the\nagent’s evaluation of his ability to fly, that is, he changes\nhis view of a very limited bit of evidence, so that the Dutch Strategy\ncan be carried out without the bookie having relevant information that\nthe agent lacks.\n\nStill, perhaps we might take the fact that a book can be made without\nhaving knowledge beyond that of the agent as at least a necessary\ncondition for a telling book. Various cases, besides that of the\nspaghetti dinner, give plausibility to the idea that a Dutch Book only\nestablishes the unreasonableness of violating a particular principle\nwhen the book is made with no special knowledge not possessed by the\nagent. Consider an agent who violates the probability axioms in virtue\nof failing to recognize some complicated logical truth. Arguably this\nis not unreasonable, and setting up a Dutch Book in this case would\nrequire knowledge that the agent lacks. But, insofar as the\nirrationality in violating the axioms stems from the fact that it is\nsupposed to be a form of inconsistency, as both Hitchcock and\nChristensen maintain, then the fact that a bookie might need (logical)\nknowledge that the agent lacks in order to set up the book, is\nirrelevant to whether the book has force. Whether an agent’s\nbeliefs are inconsistent, unlike the question of whether she\nis to be regarded as reasonable, is independent of what she or anybody\nelse knows.\n\nBriggs offers another way of distinguishing those Dutch Books that\nmark the violation of a genuine norm from those that do not (Briggs\n2009). The contention is that whereas the Dutch Strategy against those\nwho violate Conditionalization reveals what Briggs terms incoherence,\nwhich is taken to be a form of inconsistency, the Dutch Strategy\nagainst violators of Reflection reveals merely self-doubt, which\ninvolves an agent who suspects herself of incoherence. Briggs assumes\nthat an agent’s credences “condone” accepting\ncertain bets as fair, and that an agent’s credences admit of a\nDutch Book just in case those credences condone a set of bets that\nyield a net loss to the agent in every world where the agent has those\ncredences and accordingly would condone the bets. Violating the\nprobability axioms, Conditionalization or Reflection makes one\nvulnerable to a Dutch Book in this sense. Briggs observes that the\nbets in the Dutch Books that may be constructed against someone\nviolating either the probability axioms or Conditionalization will\nyield a net loss in every possible world; but, the bets in the Dutch\nStrategy against the violator of Reflection will not result in a loss\nin certain worlds in which the agent’s beliefs differ from those\nthat she has in the actual world. Accordingly, Briggs suggests that\nincoherence is marked by Dutch Books that involve bets that result in\na loss in every world, and thus that violation of Reflection does not\ninvolve incoherence.  \n\nThis way of attempting to save the Dutch Strategy argument for\nConditionalization, while jettisoning that for Reflection, is\ncriticized by Mahtani (2012), who argues that Briggs’ test\nmistakenly counts certain cases of mere self-doubt as\nincoherence.  Mahtani proposes a new way of understanding\nDutch Book arguments as revealing incoherence, according to which an\nagent is incoherent if and only if she would accept as fair a set of\nbets that would result in a loss under any interpretation of the\nclaims involved (Mahtani 2015). With this understanding, violation of\nthe probability axioms reveals incoherence, but violations of\nReflection and cases of self-doubt in which the agent isn’t sure\nof her own credences do not count as incoherence, as they do not\ninvolve proper Dutch Books that result in a loss under any\ninterpretation. As she discusses, this way of understanding Dutch\nBooks leaves it open as to whether there is a proper Dutch Book\nargument for Conditionalization.\n\nBoth Briggs and Mahtani extract the condition of incoherence from the\nfeatures of certain bets.  However, it remains unclear as to\nhow precisely the concept of incoherence, in their sense, is to be\nunderstood, although they seem to take it as a form\nof inconsistency.  Still, the discussion is important\nfor there is some intuition that violating Reflection is less similar\nto holding inconsistent beliefs than violating the probability axioms.\nWhen it comes to Conditionalization, Briggs takes the Dutch Book\nargument as establishing the full principle that the rule will be\nfollowed, which appears too strong, since the consistency required by\nrationality does not seem to require having a plan for updating nor to\nstrictly require following through on such a plan. Indeed, precisely\nwhat sort of inconsistency is involved in cases where one is\nsusceptible to a Dutch Strategy on account of having an alternative\nupdating rule to Conditionalization remains unclear, and is perhaps a\npoint in favor of Mahtani’s analysis upon which the status of\nConditionalization remains inconclusive. Against Mahtani, Pust\n(2021) claims that her reading of logical form is too narrow, and that\ngiven a more plausible account of logical form, cases of self-doubt\nwill be subject to Dutch Books that establish incoherence. Moreover,\nPust argues that the point applies to Dutch Books against violators of\nReflection, so that they too will count as incoherent. If this is\nright, Mahtani’s new understanding of Dutch Book arguments would\nfail to distinguish as intended between Dutch Books\nto undermine the Dutch Strategy argument for Reflection.\n The proposals of both Briggs and Mahtani must contend with\nthe subtle connection between credences and bets. Mahtani associates\ncredences with bets that the agent would accept as fair, but as\npreviously noted, having credences need not go along with accepting\nbets as fair in the way needed to connect the violation of various\nprobabilistic norms with a Dutch Book. While Briggs acknowledges that\nthere is a complex relationship between credences and bets, the notion\nthat credences condone certain bets also appears to be in the spirit\nof the depragmatized DBAs, which, as observed, suffer from various\ndifficulties.  \n\nPettigrew (2020) offers another way of jettisoning the Dutch Strategy\nargument for Reflection, while retaining that for Conditionalization.\n He observes that the Reflection principle is synchronic, whereas\nthe Dutch Strategy argument for it is diachronic.  As a result,\nhe claims that the Dutch Strategy argument here fails to target\nReflection.  Instead, he says that since violators of Reflection\ncan’t follow conditionalization, if they have an updating rule, it is\nthis departure from Conditionalization that is implicated by the Dutch\nStategy. This approach to distinguishing the Dutch Strategy argument\nfor Reflection from that for Conditionalization and the probability\naxioms does not involve some sort of consistency, but rather it is in\nline with taking Dutch Strategy arguments to move directly from Dutch\nBook vulnerability to irrationality.  The trouble is that\nviolators of Reflection are subject to a Dutch Strategy no matter what\nfuture credences they come to have, regardless of whether they\nadopt a particular updating rule, so given the understanding of\nDutch Strategy vulnerability as indicating some form of irrationality,\nit is hard to see here why the Dutch Strategy argument for Reflection\ndoesn’t defend the principle as a norm.\n\nThe significance of distinguishing between different types of Dutch\nBooks so as to mark off some as pointing to a form of incoherence or\nirrationality is unclear. Whereas one or another\nproposal may comport better with our intuitions about what is\nintuitively incoherent (inconsistent), or irrational, if we retain\nRamsey’s idea of credences as guides to action, then any way of\ndistinguishing between Dutch Books here looks problematic, since any\ncredences that lead to a sure loss are, at least to some extent,\ndefective as a guide to action.  \n\nRather than defend the idea that violations of Reflection can be\nrational by attempting to distinguish the Dutch Strategy argument for\nthe principle from other Dutch Book arguments that are desirable to\nretain, an alternative is to take each kind of Dutch Book as pointing\nto a defect, and then argue that the most reasonable attitude in\nsome circumstances is to hold on to less than ideal\ncredences. The view that Dutch Book vulnerability generally\ninvolves a departure from the ideal of consistency is\nendorsed in defense of Reflection by Huttegger (2013).  The\nidea is that whereas the Dutch Strategy argument does establish\nReflection as a kind of consistency constraint, this doesn’t require\nthat in bad circumstances departure from the ideal cannot\nbe the most rational option overall.  This response does\nassume that violations of Reflection can sensibly be held as a form of\ninconsistency, and this remains controversial.\n5. Other Uses of Dutch Book Arguments\n5.1 Sleeping Beauty\n\nAn interesting application of Dutch Strategy arguments has been made\nby Hitchcock to the perplexing Sleeping Beauty problem (Hitchcock\n2004). In the problem, Beauty is to undergo an experiment in which she\nwill be put to sleep on Sunday night, after which a fair coin will be\ntossed. If it comes up heads, she will be awakened just once for a\nshort time on Monday, and if tails she will also be awakened again on\nTuesday. In each case, after being awakened, she will be put back to\nsleep with drugs that will erase her memory of having been awake. On\nWednesday, she is awakened and the experiment ends. Beauty is aware of\nthese facts about the experiment, so that when she wakes up during the\nexperiment she will not know whether it is Monday or Tuesday. The\nproblem is to determine what her probability should be for heads upon\nawakening within the experiment. Elga introduced the problem into the\nphilosophical literature (Elga 2000), and argued that upon awakening\nBeauty should shift her probability from the value of ½\nthat she assigned on Sunday night to ⅓. Lewis argued\nshortly thereafter that Beauty’s probability upon awakening\nshould remain at ½ (Lewis 2001), and additional\narguments have followed on both sides. Hitchcock shows that there is a\nDutch Strategy against either answer, but then argues that there is\nonly force to the one against Beauty if she sticks with\n½.\n\nThe strategies serve as potential counterarguments to the two ways of\nanswering the problem, rather than showing that it is irrational to\nswitch to ⅓ or stick with ½ per se,\nsince the individual strategies depend upon the plan to have a\nparticular probability upon awakening. If Beauty plans to switch to\nprobability ⅓ for heads, the Dutch Strategy is just an\napplication of the general strategy against someone who violates\nReflection. Hitchcock argues that this would not establish\nBeauty’s irrationality, since in this case the bookie must know\nduring the experiment what day it is in order to implement the\nstrategy, which is information that Beauty lacks. On the other hand,\nif Beauty sticks with ½, a strategy can be carried out\nwithout the bookie having to know more than Beauty by having the\nbookie undergo the experiment with her and offer a bet against heads\non Sunday and a bet on heads whenever Beauty and the bookie awake\nwithin the experiment. If the coin lands heads, the bookie sells\nBeauty just one bet on heads, with her gain totaling less than her\nloss on the first bet against heads. If the coin lands tails, the\nbookie sells a bet on heads once on Monday and the same bet again on\nTuesday, so as to again produce a loss for Beauty. Hitchcock takes\nthis book to tell against the answer ½, and in favor of\n⅓.\n\nOne trouble with defending the answer of ⅓ in this way\nis that what a bookie must know to assure himself a profit does not\ncharacterize what is essential to a proper Dutch Book. There is also a\nparticular reason to suppose that Beauty’s predicament is one in\nwhich reasonable degrees of belief and betting quotients can come\napart, because the third bet needed to make book in the switching case\nis only offered when it is sure to be a losing bet (discussed in\nVineberg 2004—see the Other Internet Resources, and Bradley and\nLeitgeb 2006). In this case the bookie exploits features of the\nexperiment, so that the strategy can be carried out without his\npossessing knowledge of the day. But the fact that the bets leading to\nbook are triggered by the circumstances suggests that it is not just\nBeauty’s beliefs on which the strategy depends, and hence the\nloss does not reflect a purely internal defect, despite the fact that\nthe bookie can implement the strategy without having access during the\nexperiment to knowledge that Beauty lacks. Draper and Pust also argue\nthat Hitchcock’s use of a Dutch Book argument is subject to an\nobjection from evidential decision theory (Draper and Pust 2008).\n5.2 The Principal Principle\nRecently, Richard Pettigrew (2020) has offered a Dutch Book\nargument for Lewis’ Principal Principle as an additional\nconstraint on rational credences.  The Principal Principle requires\nthat an agent’s credences about chances be such that her\ncredence for the proposition, \\(A\\) conditional on the chance of \\(A\\)\nbeing \\(r\\), is equal to \\(r\\).  Supposing that \\(\\text{cr}\\)\nis the agent’s credence function and \\(\\text{ch}\\) a chance\nfunction such that \\(\\text{ch}(A) = r\\) says that the chance\nof \\(A\\) is \\(r\\), the requirement is that\n\\(\\text{cr}(A/\\text{ch}(A) = r) = r\\).  The principle has a similar\nstructure to the Principle of Reflection, with the chance of \\(A\\) at\nthe current time t in place of the agent's credence in \\(A\\) at a\nfuture time \\(t\\). So, it is not so surprising that if\n\\(\\text{cr}(A/\\text{ch}(A) = r) \\neq r\\), there is a collection of\nbets in accordance with those credences that produce a kind of Dutch\nBook.  For details see Pettigrew (2020).  However, there are\nsignificant differences between the arguments for the Principal\nPrinciple and that for the Reflection Principle.  First, since the\nagent’s future credences do not figure in the Principal\nPrinciple, the bets are part of a Dutch Book proper, rather than a\nDutch Strategy.  While this avoids some concerns about Dutch Strategy\narguments, a problematic difference is that the bets, which are given\nin terms of chances do not guarantee a sure loss, but only an expected\none, whatever the chances may be.\nFor Ramsey and de Finetti, the point of appealing to a Dutch Book\nargument was to establish probabilistic constraints using precise\nterms that were tied to verifiable conditions, making it crucial that\nthe bets constituting a book are given definite payoff conditions and\ncan be settled. However, the book against the violator of the\nPrincipal Principle involves bets on chances, which lack the\ndefinitive settlement conditions that would produce a sure loss. To\nthe extent that the underlying problem associated with Dutch Book\nvulnerability lies with the agent’s evaluations rather than\nmerely with their pragmatic consequences, as discussed previously, the\nlack of a sure loss here may not be crucial. Still, the motivation for\ntaking the Dutch Book vulnerability in cases where the probability\naxioms are violated as an indication of irrationality appears to\nderive from the idea that it leads to a sure loss, so that the merely\nexpected loss associated with violating the Principal Principle, is\nless clearly irrational. In particular, credences that are associated\nwith a mere expectation of loss, rather than a sure loss, are less\nclearly held to indicate an inconsistency in the agent’s action\nguiding evaluations. Such credences may still be irrational, but\nclarifying the source seems to require appealing to the nature of\nchance, which remains unsettled.\n5.3 Dutch Books and Rational Choice\n\nDutch Books have also been used to show that there are limitations on\nthe proper applications of credences within the standard decision\ntheoretic framework. Given that the available evidence often appears\nto dictate only vague or interval-valued credences, it has been argued\nthat rationality permits having such unsharp credences. Elga uses a\nkind of reverse Dutch Book involving a series of bets that are sure to\nresult in a net gain for the agent to argue that credences must be\nsharp (Elga 2010). The idea is that a rational agent must accept at\nleast one of the bets in the series, but that there does not appear to\nbe a satisfactory set of decision rules for unsharp credences with\nthis consequence.\n\nMcGee constructs another type of Dutch Book with implications for\ndecision theory. Suppose that an agent’s probability function is\nnot concentrated at finitely many points. Such a state of opinion, in\nwhich the agent does not rule out all but a finite number of\npossibilities, seems both consistent and reasonable, yet assuming that\nan agent’s utilities are unbounded, McGee shows that there is an\ninfinite series of bets, each with positive expected value, which\ntogether assure a loss (McGee 1999). Assuming that it is reasonable to\nhave probabilities that are not concentrated at finitely many points,\nMcGee calls into question the general adequacy of the decision\ntheoretic framework, and in particular the principle of utility\nmaximization that his Dutch Book argument presumes.\n6. Conclusion\n\nIt remains defensible that the Dutch Book argument shows that the\nprobability axioms are something like consistency constraints on\npartial belief, at least given some substantial decision-theoretic\nassumptions, unlike the idea that their violation is a pragmatic\nliability. But this interpretation is less successful for the various\nother norms for which Dutch Book arguments have been constructed. The\nDutch Strategy arguments for the Principle of Conditionalization and\nfor Jeffrey’s Rule do not fully support the norms, but only the\nweaker claim that one should not commit in advance to following an\nalternative rule under some additional conditions, and the sense in\nwhich it may be said to be inconsistent to do so seems different from\nwhat is involved in violating the axioms. The other claims considered\nhere for which Dutch Book arguments have been constructed are even\nless plausibly regarded as consistency constraints, and thus seem to\nbe a different sort of requirement on ideal rationality. This suggests\nthe need to identify ‘consistency’ with a narrower set of\nconditions than mere Dutch Book vulnerability, if we are not to\nabandon the idea of the probability axioms as a consistency constraint\nthat extends the ordinary concept and, perhaps, reject the DBA\naltogether. A more fine-grained analysis of the various Dutch Books\nmight yield a way of marking off those that point to genuine\ninconsistency from those exhibiting some other sort of defect, but a\nsatisfactory way of accomplishing this remains illusive.\n\nAmong those who endorse at least certain Dutch Book arguments,\nsome regard them as establishing rationality requirements without\nembracing the idea that Dutch Book vulnerability involves a kind of\ninconsistency.  This avoids the problem of making sense of the\ninconsistency involved in Dutch Book vulnerability, but faces\nchallenges in specifying the sort of rationality that is at stake.\n Responses to the Dutch Strategy argument for Reflection have\nprompted a particularly wide array of attitudes towards\nDutch Book vulnerability.  It is striking that nearly a century\nafter the publication of Ramsey’s paper, there remains so much\ndisagreement and continued work on how to understand Dutch Book\narguments.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Adams Ernest W., 1962, “On Rational Betting Systems”,\n<em>Archiv für mathematische Logik and Grundlagenforschung</em>,\n6: 7–29.",
                "Adams, Ernest W. and Roger D. Rosenkrantz, 1980, “Applying\nthe Jeffrey Decision Model to Rational Betting and Information\nAcquisition”, <em>Theory and Decision</em>, 12: 1–20.",
                "Armendt, Brad, 1980, “Is There a Dutch Book Argument for\nProbability Kinematics”, 47: 583–588.",
                "–––, 1993, “Dutch Books, Additivity and\nUtility Theory”, <em>Philosophical Topics</em>, 21 (1):\n1–20.",
                "Bacchus, F., H.E. Kyburg, and M. Thalos, 1990, “Against\nConditionalization”, <em>Synthese</em>, (85):\n475–506.",
                "Bradley, Darren, and Hannes Leitgeb, 2006, “When Betting\nOdds and Credences Come Apart: More Worries for Dutch Book\nArguments”, <em>Analysis</em>, 66 (2): 119–127.",
                "Briggs, Rachael, 2009, “Distorted Reflection”,\n<em>Philosophical Review</em>, 118 (1): 59–85.",
                "Christensen, David, 1991, “Clever Bookies and Coherent\nBeliefs”, <em>The Philosophical Review</em>, 100 (2):\n229–247.",
                "–––, 1996, “Dutch-Book Arguments\nDepragmatized: Epistemic Consistency For Partial Believers”,\n<em>The Journal of Philosophy</em>, 93: 450–479.",
                "–––, 2004, <em>Putting Logic in its Place</em>,\nNew York: Oxford University Press.",
                "de Finetti, Bruno, 1937, “Foresight: Its Logical Laws, Its\nSubjective Sources”, in Henry E. Kyburg and Howard E.K Smokler\n(eds.), <em>Studies in Subjective Probability</em>, Huntington, NY:\nRobert E. Kreiger Publishing Co.",
                "–––, 1972, <em>Probability, Induction and\nStatistics</em>, New York: Wiley.",
                "Draper, Kai and Joel Pust, 2008, “Diachronic Dutch Books\nand Sleeping Beauty”, <em>Synthese</em>, 164.2: 281-287.",
                "Elga, Adam, 2000, “Self-locating Belief and the Sleeping\nBeauty Problem”, <em>Analysis</em>, 60 (2): 143–147.",
                "–––, 2020, “Subjective Probabilities Should be\nSharp”, <em>Philosopher’s Imprint</em>, 10 (5):\n1-11.",
                "Gallow, J. Dimitri, 2019, “Diachronic Dutch Books and\nEvidential Import”, <em>Philosophy and Phenomenological\nResearch</em>, XCIX (1): 49-80.",
                "Hájek, Alan, 2005, “Scotching Dutch Books?” in\nJohn Hawthorne (ed.), <em>Philosophical Perspectives</em>, 19:\n139–51.",
                "–––, 2008a, “Arguments For-or\nAgainst-Probabilism?” <em>British Journal for the Philosophy of\nScience</em>, 59: 793–819.",
                "–––, 2008b, “Dutch Book Arguments”,\nin Paul Anand, Prasanta Pattanaik and Clemens Puppe (eds.), <em>The\nOxford Handbook of Rational and Social Choice</em>, pp. 173–195,\nOxford: Oxford University Press.",
                "Hedden, Brian, 2013, “Incoherence without\nExploitability”, <em>Noûs</em> 47(3): 482-495.",
                "–––, 1997, “Bayes and Beyond”, <em>Philosophy of\nScience</em>, 64 (2): 191–221.",
                "Hitchcock, Christopher, 2004, “Beauty and the Bets”,\n<em>Synthese</em>, 139: 405–420.",
                "Howson, Colin, and Peter Urbach, 1993, <em>Scientific Reasoning:\nThe Bayesian Approach</em>, second edition, La Salle, Illinois: Open\nCourt.",
                "Huttegger, Simon M., 2013, “In Defense of\nReflection”, <em>Philosophy of Science</em>, 80 (3):\n413-433.",
                "Jackson, Frank, and Robert Pargetter, 1976, “A Modified\nDutch Book Argument”, <em>Philosophical Studies</em>, 29:\n403–407.",
                "Jeffrey, Richard, 2004, <em>Subjective Probability: The Real\nThing</em>, Cambridge: Cambridge University Press.",
                "–––, 1983, <em>The Logic of Decision</em>,\nsecond edition, Chicago: The University of Chicago Press.",
                "Kaplan, Mark, 1996, <em>Decision Theory as Philosophy</em>,\nCambridge: Cambridge University Press.",
                "Kemeny, John, 1955, “Fair Bets and Inductive Probabilities\n”, <em>Journal of Symbolic Logic</em>, 20 (3):\n263–273.",
                "Kennedy, Ralph, and Charles Chihara, 1979, “The Dutch Book\nArgument: Its Logical Flaws, Its Subjective Sources”,\n<em>Philosophical Studies</em>, 36: 19–33.",
                "Lehman, R. Sherman, 1955, “On Confirmation and Rational\nBetting”, <em>Journal of Symbolic Logic</em>, 20 (3):\n251–262.",
                "Levi, Isaac, 2002, “Money Pumps and Diachronic Dutch\nBooks”, <em>Philosophy of Science</em>, 69 (3):\nS235–247.",
                "Lewis, David, 1999, <em>Papers in Metaphysics and\nEpistemology</em>, Cambridge: Cambridge University Press.",
                "–––, 2001, “Sleeping Beauty: reply to\nElga”, <em>Analysis</em>, 61 (3): 171–176.",
                "Maher, Patrick, 1993, <em>Betting on Theories</em>, Cambridge:\nCambridge University Press.",
                "–––, 1997, “Depragmatized Dutch Book\nArguments”, <em>Philosophy of Science</em>, 64 (2):\n291–305.",
                "Mahtani, Anna, 2012, “Diachronic Dutch Book\nArguments”, <em>The Philosophical Review</em>, 121 (3):\n443-450.",
                "–––, 2015, “Dutch Books, Coherence, and\nLogical Consistency”, <em>Noûs</em>, 49: 522-537.",
                "McGee, Vann, 1999, “An Airtight Dutch Book”,\n<em>Analysis</em>, 59 (4): 257–265. ",
                "Pettigrew, Richard, 2019, “Epistemic Utility Arguments for Probabilism”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Winter 2019\nEdition), Edward N. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/win2019/entries/epistemic-utility/\">https://plato.stanford.edu/archives/win2019/entries/epistemic-utility/</a>&gt;.",
                "–––, 2020, <em>Dutch Book Arguments</em>,\nCambridge: Cambridge University Press.",
                "Pust, Joel, 2021, “Dutch Books and Logical Form”,\n<em>Philosophy of Science</em>, 88: 961-970.",
                "Ramsey, F.P., 1926., “Truth and Probability”, in Henry\nE. Kyburg and Howard E.K Smokler (eds.), <em>Studies in Subjective\nProbability</em>, Huntington, NY: Robert E. Kreiger Publishing\nCo.",
                "Rescorla, Michael, 2018, “A Dutch Book Theorem and Converse\nDutch Book Theorem for Kolmogorov Conditionalization”, <em>The\nReview of Symbolic Logic</em>,  11 (4): 708-735.",
                "Rowbottom, Darrell P., 2007, “The Insufficiency of the\nDutch Book Argument”, <em>Studia Logica: An International\nJournal for Symbolic Logic</em>,  87 (1): 65-71.",
                "Savage, L.J., 1954, <em>The Foundations of Statistics</em>, New\nYork: Wiley.",
                "Seidenfeld, Teddy, and Mark J. Schervish, 1983, “A Conflict\nBetween Finite Additivity and Avoiding Dutch Book”,\n<em>Philosophy of Science</em>, 50: 398–412.",
                "Shimony, Abner, 1955, “Coherence and the Axioms of\nConfirmation”, <em>Journal of Symbolic Logic</em>, 20 (3):\n1–28.",
                "Skyrms, Brian, 1987a, “Coherence”, in N. Rescher\n(ed.), <em>Scientific Inquiry in Philosophical Perspective</em>,\nPittsburgh: University of Pittsburgh Press, 225–242.",
                "–––, 1987b, “Dynamic Coherence and\nProbability Kinematics”, <em>Philosophy of Science</em>, 54:\n1–20.",
                "Talbott, W., 1991, “Two Principles of Bayesian\nEpistemology”, <em>Philosophical Studies</em>, 62:\n135–150.",
                "Teller, Paul, 1973, “Conditionalization and\nObservation”, <em>Synthese</em>, 26: 218–258.",
                "van Fraassen, Bas, 1995, “Belief and the Problem of Ulysses\nand the Sirens”,<em> Philosophical Studies</em>, 77:\n7–37.",
                "–––, 1984, “Belief and the Will”,\n<em>Journal of Philosophy</em>, 81 (May): 235–256.",
                "–––, 1989, <em>Laws and Symmetry</em>, New\nYork: Oxford University Press.",
                "Vineberg, Susan, 1997, “Dutch Books, Dutch Strategies and\nWhat They Show About Rationality”, <em>Philosophical\nStudies</em>, 86: 185–201.",
                "–––, 2001, “The Notion of Consistency for\nPartial Belief”, <em>Philosophical Studies</em>, 102:\n281–296.",
                "Weatherson, Brian, 2003, “From Classical to Intuitionistic\nProbability”, <em>Notre Dame Journal of Formal Logic</em>, 44\n(2): 111-23.",
                "Williamson, Jon, 1999, “Countable Additivity and Subjective\nProbability”, <em>British Journal for the Philosophy of\nScience</em> 50: 401–416."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Adams Ernest W., 1962, “On Rational Betting Systems”,\n<em>Archiv für mathematische Logik and Grundlagenforschung</em>,\n6: 7–29.</li>\n<li>Adams, Ernest W. and Roger D. Rosenkrantz, 1980, “Applying\nthe Jeffrey Decision Model to Rational Betting and Information\nAcquisition”, <em>Theory and Decision</em>, 12: 1–20.</li>\n<li>Armendt, Brad, 1980, “Is There a Dutch Book Argument for\nProbability Kinematics”, 47: 583–588.</li>\n<li>–––, 1993, “Dutch Books, Additivity and\nUtility Theory”, <em>Philosophical Topics</em>, 21 (1):\n1–20.</li>\n<li>Bacchus, F., H.E. Kyburg, and M. Thalos, 1990, “Against\nConditionalization”, <em>Synthese</em>, (85):\n475–506.</li>\n<li>Bradley, Darren, and Hannes Leitgeb, 2006, “When Betting\nOdds and Credences Come Apart: More Worries for Dutch Book\nArguments”, <em>Analysis</em>, 66 (2): 119–127.</li>\n<li>Briggs, Rachael, 2009, “Distorted Reflection”,\n<em>Philosophical Review</em>, 118 (1): 59–85.</li>\n<li>Christensen, David, 1991, “Clever Bookies and Coherent\nBeliefs”, <em>The Philosophical Review</em>, 100 (2):\n229–247.</li>\n<li>–––, 1996, “Dutch-Book Arguments\nDepragmatized: Epistemic Consistency For Partial Believers”,\n<em>The Journal of Philosophy</em>, 93: 450–479.</li>\n<li>–––, 2004, <em>Putting Logic in its Place</em>,\nNew York: Oxford University Press.</li>\n<li>de Finetti, Bruno, 1937, “Foresight: Its Logical Laws, Its\nSubjective Sources”, in Henry E. Kyburg and Howard E.K Smokler\n(eds.), <em>Studies in Subjective Probability</em>, Huntington, NY:\nRobert E. Kreiger Publishing Co.</li>\n<li>–––, 1972, <em>Probability, Induction and\nStatistics</em>, New York: Wiley.</li>\n<li>Draper, Kai and Joel Pust, 2008, “Diachronic Dutch Books\nand Sleeping Beauty”, <em>Synthese</em>, 164.2: 281-287.</li>\n<li>Elga, Adam, 2000, “Self-locating Belief and the Sleeping\nBeauty Problem”, <em>Analysis</em>, 60 (2): 143–147.</li>\n<li>–––, 2020, “Subjective Probabilities Should be\nSharp”, <em>Philosopher’s Imprint</em>, 10 (5):\n1-11.</li>\n<li>Gallow, J. Dimitri, 2019, “Diachronic Dutch Books and\nEvidential Import”, <em>Philosophy and Phenomenological\nResearch</em>, XCIX (1): 49-80.</li>\n<li>Hájek, Alan, 2005, “Scotching Dutch Books?” in\nJohn Hawthorne (ed.), <em>Philosophical Perspectives</em>, 19:\n139–51.</li>\n<li>–––, 2008a, “Arguments For-or\nAgainst-Probabilism?” <em>British Journal for the Philosophy of\nScience</em>, 59: 793–819.</li>\n<li>–––, 2008b, “Dutch Book Arguments”,\nin Paul Anand, Prasanta Pattanaik and Clemens Puppe (eds.), <em>The\nOxford Handbook of Rational and Social Choice</em>, pp. 173–195,\nOxford: Oxford University Press.</li>\n<li>Hedden, Brian, 2013, “Incoherence without\nExploitability”, <em>Noûs</em> 47(3): 482-495.</li>\n<li>–––, 1997, “Bayes and Beyond”, <em>Philosophy of\nScience</em>, 64 (2): 191–221.</li>\n<li>Hitchcock, Christopher, 2004, “Beauty and the Bets”,\n<em>Synthese</em>, 139: 405–420.</li>\n<li>Howson, Colin, and Peter Urbach, 1993, <em>Scientific Reasoning:\nThe Bayesian Approach</em>, second edition, La Salle, Illinois: Open\nCourt.</li>\n<li>Huttegger, Simon M., 2013, “In Defense of\nReflection”, <em>Philosophy of Science</em>, 80 (3):\n413-433.</li>\n<li>Jackson, Frank, and Robert Pargetter, 1976, “A Modified\nDutch Book Argument”, <em>Philosophical Studies</em>, 29:\n403–407.</li>\n<li>Jeffrey, Richard, 2004, <em>Subjective Probability: The Real\nThing</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 1983, <em>The Logic of Decision</em>,\nsecond edition, Chicago: The University of Chicago Press.</li>\n<li>Kaplan, Mark, 1996, <em>Decision Theory as Philosophy</em>,\nCambridge: Cambridge University Press.</li>\n<li>Kemeny, John, 1955, “Fair Bets and Inductive Probabilities\n”, <em>Journal of Symbolic Logic</em>, 20 (3):\n263–273.</li>\n<li>Kennedy, Ralph, and Charles Chihara, 1979, “The Dutch Book\nArgument: Its Logical Flaws, Its Subjective Sources”,\n<em>Philosophical Studies</em>, 36: 19–33.</li>\n<li>Lehman, R. Sherman, 1955, “On Confirmation and Rational\nBetting”, <em>Journal of Symbolic Logic</em>, 20 (3):\n251–262.</li>\n<li>Levi, Isaac, 2002, “Money Pumps and Diachronic Dutch\nBooks”, <em>Philosophy of Science</em>, 69 (3):\nS235–247.</li>\n<li>Lewis, David, 1999, <em>Papers in Metaphysics and\nEpistemology</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2001, “Sleeping Beauty: reply to\nElga”, <em>Analysis</em>, 61 (3): 171–176.</li>\n<li>Maher, Patrick, 1993, <em>Betting on Theories</em>, Cambridge:\nCambridge University Press.</li>\n<li>–––, 1997, “Depragmatized Dutch Book\nArguments”, <em>Philosophy of Science</em>, 64 (2):\n291–305.</li>\n<li>Mahtani, Anna, 2012, “Diachronic Dutch Book\nArguments”, <em>The Philosophical Review</em>, 121 (3):\n443-450.</li>\n<li>–––, 2015, “Dutch Books, Coherence, and\nLogical Consistency”, <em>Noûs</em>, 49: 522-537.</li>\n<li>McGee, Vann, 1999, “An Airtight Dutch Book”,\n<em>Analysis</em>, 59 (4): 257–265. </li>\n<li>Pettigrew, Richard, 2019, “Epistemic Utility Arguments for Probabilism”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Winter 2019\nEdition), Edward N. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/win2019/entries/epistemic-utility/\">https://plato.stanford.edu/archives/win2019/entries/epistemic-utility/</a>&gt;.</li>\n<li>–––, 2020, <em>Dutch Book Arguments</em>,\nCambridge: Cambridge University Press.</li>\n<li>Pust, Joel, 2021, “Dutch Books and Logical Form”,\n<em>Philosophy of Science</em>, 88: 961-970.</li>\n<li>Ramsey, F.P., 1926., “Truth and Probability”, in Henry\nE. Kyburg and Howard E.K Smokler (eds.), <em>Studies in Subjective\nProbability</em>, Huntington, NY: Robert E. Kreiger Publishing\nCo.</li>\n<li>Rescorla, Michael, 2018, “A Dutch Book Theorem and Converse\nDutch Book Theorem for Kolmogorov Conditionalization”, <em>The\nReview of Symbolic Logic</em>,  11 (4): 708-735.</li>\n<li>Rowbottom, Darrell P., 2007, “The Insufficiency of the\nDutch Book Argument”, <em>Studia Logica: An International\nJournal for Symbolic Logic</em>,  87 (1): 65-71.</li>\n<li>Savage, L.J., 1954, <em>The Foundations of Statistics</em>, New\nYork: Wiley.</li>\n<li>Seidenfeld, Teddy, and Mark J. Schervish, 1983, “A Conflict\nBetween Finite Additivity and Avoiding Dutch Book”,\n<em>Philosophy of Science</em>, 50: 398–412.</li>\n<li>Shimony, Abner, 1955, “Coherence and the Axioms of\nConfirmation”, <em>Journal of Symbolic Logic</em>, 20 (3):\n1–28.</li>\n<li>Skyrms, Brian, 1987a, “Coherence”, in N. Rescher\n(ed.), <em>Scientific Inquiry in Philosophical Perspective</em>,\nPittsburgh: University of Pittsburgh Press, 225–242.</li>\n<li>–––, 1987b, “Dynamic Coherence and\nProbability Kinematics”, <em>Philosophy of Science</em>, 54:\n1–20.</li>\n<li>Talbott, W., 1991, “Two Principles of Bayesian\nEpistemology”, <em>Philosophical Studies</em>, 62:\n135–150.</li>\n<li>Teller, Paul, 1973, “Conditionalization and\nObservation”, <em>Synthese</em>, 26: 218–258.</li>\n<li>van Fraassen, Bas, 1995, “Belief and the Problem of Ulysses\nand the Sirens”,<em> Philosophical Studies</em>, 77:\n7–37.</li>\n<li>–––, 1984, “Belief and the Will”,\n<em>Journal of Philosophy</em>, 81 (May): 235–256.</li>\n<li>–––, 1989, <em>Laws and Symmetry</em>, New\nYork: Oxford University Press.</li>\n<li>Vineberg, Susan, 1997, “Dutch Books, Dutch Strategies and\nWhat They Show About Rationality”, <em>Philosophical\nStudies</em>, 86: 185–201.</li>\n<li>–––, 2001, “The Notion of Consistency for\nPartial Belief”, <em>Philosophical Studies</em>, 102:\n281–296.</li>\n<li>Weatherson, Brian, 2003, “From Classical to Intuitionistic\nProbability”, <em>Notre Dame Journal of Formal Logic</em>, 44\n(2): 111-23.</li>\n<li>Williamson, Jon, 1999, “Countable Additivity and Subjective\nProbability”, <em>British Journal for the Philosophy of\nScience</em> 50: 401–416.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "belief, formal representations of",
            "epistemology: Bayesian",
            "preferences",
            "probability, interpretations of",
            "Ramsey, Frank"
        ],
        "entry_link": [
            {
                "../formal-belief/": "belief, formal representations of"
            },
            {
                "../epistemology-bayesian/": "epistemology: Bayesian"
            },
            {
                "../preferences/": "preferences"
            },
            {
                "../probability-interpret/": "probability, interpretations of"
            },
            {
                "../ramsey/": "Ramsey, Frank"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=dutch-book\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/dutch-book/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=dutch-book&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/dutch-book/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=dutch-book": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/dutch-book/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=dutch-book&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/dutch-book/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Vineberg, Susan (2004),\n “<a href=\"http://fitelson.org/few/few_04/vineberg.pdf\" target=\"other\">Beauty’s Cautionary Tale</a>”."
        ],
        "listed_links": [
            {
                "http://fitelson.org/few/few_04/vineberg.pdf": "Beauty’s Cautionary Tale"
            }
        ]
    }
}