{
    "url": "ehrenfels",
    "title": "Christian von Ehrenfels",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Robin Rollinger\n<robinrollinger@yahoo.com>\nCarlo Ierna\n<carlo.ierna@phil.uu.nl>",
        "author_links": [
            {
                "http://ophen.org/pers-100182": "Robin Rollinger"
            },
            {
                "mailto:robinrollinger%40yahoo%2ecom": "robinrollinger@yahoo.com"
            },
            {
                "http://ierna.name": "Carlo Ierna"
            },
            {
                "mailto:carlo%2eierna%40phil%2euu%2enl": "carlo.ierna@phil.uu.nl"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\n<a href=\"http://ophen.org/pers-100182\" target=\"other\">Robin Rollinger</a>\n&lt;<a href=\"mailto:robinrollinger%40yahoo%2ecom\"><em>robinrollinger<abbr title=\" at \">@</abbr>yahoo<abbr title=\" dot \">.</abbr>com</em></a>&gt;<br/>\n<a href=\"http://ierna.name\" target=\"other\">Carlo Ierna</a>\n&lt;<a href=\"mailto:carlo%2eierna%40phil%2euu%2enl\"><em>carlo<abbr title=\" dot \">.</abbr>ierna<abbr title=\" at \">@</abbr>phil<abbr title=\" dot \">.</abbr>uu<abbr title=\" dot \">.</abbr>nl</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu May 28, 2015",
        "substantive revision Thu Dec 12, 2019"
    ],
    "preamble": "\nChristian von Ehrenfels (b. June 20, 1859, d. September 8, 1932) was an\nAustrian philosopher and psychologist from the school of Franz\nBrentano. He proved himself to be a highly independent and diverse\nthinker by formulating the notion of Gestalt qualities,\nelaborating on a new theory of value, and developing new ideas in\nsexual ethics and cosmology. He drew on what he learned not only from\nBrentano, but also from Alexius Meinong, the Austrian economists, and\nevolution theorists. Nevertheless, Ehrenfels (as he shall henceforth be\ndesignated) was also critical of his various mentors on a number of\nissues. Though he was very much a theorist, he was by no means aloof\nregarding the social and cultural problems of his time. Thus he also\nattempted to respond to these problems by forging new paths towards their\nsolutions.\n",
    "toc": [
        {
            "#LifWor": "1. Life and Work"
        },
        {
            "#GesQua": "2. Gestalt Qualities"
        },
        {
            "#TheVal": "3. Theory of Values"
        },
        {
            "#SexEth": "4. Sexual Ethics"
        },
        {
            "#Mat": "5. Philosophy of Mathematics"
        },
        {
            "#Cos": "6. Cosmology"
        },
        {
            "#Leg": "7. Legacy"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PriLit": "Primary Literature"
        },
        {
            "#SecLit": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        },
        {
            "#Ack": "Acknowledgments"
        }
    ],
    "main_text": "\n1. Life and Work\nChristian Julius Leopold Karl, Freiherr von Ehrenfels, was born in\nRodaun near Vienna. He grew up in his father’s castle in Brunn\nam Walde (see Valent 2016 for more biographical details on\nEhrenfels’ youth). Though he was the eldest son and accordingly\nthe rightful heir to the family estate, he decided in 1882, when he\nwas 23 years old, to give away his birthright to his younger brother\nand to devote himself entirely to philosophy, poetry, and music. At\nfirst Ehrenfels went to Vienna in 1877 to undertake agricultural\nstudies, but in the winter semester 1879/80 he enrolled at the\nuniversity where he began his studies in philosophy with Franz\nBrentano, Thomas Masaryk, and the young Alexius Meinong, while also\nattending lectures of Franz Exner, Ludwig Boltzmann, and Ernst Mach\n(Valent 2016, 179). At the same time he also began to study\ncomposition with Anton Bruckner. As an enthusiastic follower of\nRichard Wagner he was to write librettos for Wagnerian-style music\ndramas. Ehrenfels then also links his loss of\nChristian faith to the start of his academic studies and the discovery\nof Wagner (Höfer 2017, 25). In 1882 Ehrenfels undertook a\n“pilgrimage” to Bayreuth in order to attend the first\nperformance of Wagner’s Parzifal. This visit triggered\nboth the end of his uncritical personal admiration of Wagner (though not\nof his art) and the insight that his own musical abilities were\ninadequate, ending his lessons with Bruckner (Höfer 2017, 26).\n\nAs regards Ehrenfels’ philosophical pursuits, his interest in\nBrentano’s philosophy gave way to a receptivity to the ideas of\nMeinong, the new young lecturer who had also studied with Brentano,\nbut who was already developing views of his own, particularly in the\ntheory of relations, which diverged from Brentano’s orthodox\nteachings (see Rollinger 2008). According to Ehrenfels’ later\naccount, Brentano’s smooth and polished delivery did not impress\nhim nearly as much as Meinong’s cumbersome search for the truth\n(Ehrenfels in PSIV, 426–429). Another student who also preferred\nMeinong over Brentano was Alois Höfler (also a Wagnerian), who\nbecame a close friend of Ehrenfels after first meeting him in Brunn in\n1876 (Valent 2016, 178). Having started to lecture in Vienna only in\n1878, Meinong was awarded a position in Graz in 1882, where Ehrenfels\nfollowed him in the winter semester of 1884/1885, after a year of\nmilitary service. Ehrenfels wrote his dissertation on Relations of\nMagnitude and Numbers. A Psychological Study in Graz under\nMeinong’s guidance, likely based on an extensive commentary on\nMeinong’s 1882 article “Hume Studien II: zur\nRelationstheorie” (see Ierna 2017a, 165 and Ehrenfels 2017).\nEhrenfels returned to Vienna, where he completed his Habilitation\n(a second thesis, in addition to the doctoral thesis, in order to\nqualify for a teaching position) “On Feeling and Willing”\n(Ehrenfels 1887, in PSIII, 15–97), in which he opposed the\nBrentanian doctrine concerning emotions and also laid down the\npsychological foundation for his later theory of value.\nDespite such opposition, it must not be overlooked that\nEhrenfels’ basic orientation is unquestionably Brentanian,\ninsofar as he never gives up thinking that consciousness is inwardly\nperceived and is directed at objects. He shares this psychological\nbasis for philosophy with other prominent students of Brentano, such\nas Meinong, Carl Stumpf, Anton Marty, Edmund Husserl, Kasimir\nTwardowski, and Thomas Masaryk. In addition it should be pointed out\nthat, though Ehrenfels did not accept Brentano’s own peculiar\nversion of theism, he shared with Brentano a concern for the more\n“spiritual” side of things. There is, by contrast, hardly\nany trace of such a concern in the thought of Meinong.\nEhrenfels lectured in Vienna during the summer semesters from 1891,\nwhile travelling in the winter semesters. In 1894 he met the young\nwidow Emma von Hartmann at a meeting of the Academic Wagner\nSociety and married her in the same year. In 1896 he was awarded\na position at the University of Prague (PSII, 21 ff.) where he would\nbecome a full professor in 1899 and, despite initial misgivings,\nremain until his retirement. This of course meant that he was a\ncolleague of Marty (in large measure an orthodox follower of\nBrentano), who in fact found Ehrenfels’ non-cognitivist\norientation in value theory completely reprehensible.  When Ehrenfels\nsupported hiring Höfler in Prague as a professor of pedagogy,\nthis brought him into bitter conflict with Marty, who even ascribed\n“naive egoism” to him (Dölling 1999, 141; Valent\n2016, 194; Janoušek and Rollinger 2017, 314). Ehrenfels\nmaintained a close relationship with Meinong and, unlike Meinong\nhimself and Höfler, managed to stay on good terms with\nBrentano. However much Ehrenfels drew upon ideas of Meinong or anyone\nelse, however, he spent his years in Prague as an independent thinker\nand teacher. Both Franz Kafka, Felix Weltsch, and Max Brod were\nfamiliar with Ehrenfels as a teacher and found him to be a rather\ncolorful and interesting figure (see also the quotation from Emma von\nEhrenfels’ biographic sketch in PSII, 26).\nAs pessimism began to grow in the early twentieth century,\nEhrenfels became increasingly concerned with reviving European culture\n(Valent 2016, § 9). According to Max Brod, Ehrenfels’\nCosmogony “was a document of this generation [the\n“Generation nevertheless” (Generation des\nTrotzdem)], which for the first time embodied a mood of impending\ndoom, tough without vanishing into fear” (quoted from Frechette\n2017, 325). It is also in this context that he developed his ideas for\nreforming sexual ethics.  In essence he advocated polygamy for the\nsuperior men, in order to increase the population of people with\nhigher qualities. He was at the same time opposed to those who\nadvocated racial purity and was instead all in favor of mixed\nraces. He did not see Jews as a threat to the “Aryan race”\nand in fact acknowledged their great cultural achievements (PSIII,\n262), although he did fear “the yellow peril” (see\nEhrenfels 1908, Dickinson 2002). His proposal for a new sexual ethic\nin order to enhance the European stock was, however, not well\nreceived.  As the years went on, Ehrenfels himself lost enthusiasm for\nit, but was instead more concerned with developing a new religion. He\ndid not think that Christianity, with its demands for faith where\nreason could no longer be effective, was viable. The new religion was\nto be built upon a thoroughly rational dualistic principle of\ncosmogony, which also to a large extent drew upon the concept\nof Gestalt qualities that he had developed early in his\ncareer. It should also be mentioned here that Ehrenfels found the same\nconcept to be fruitful in the domain of mathematics.\nEhrenfels died just one year before Adolf Hitler, who was of course\nfanatical in advancing racial purity, came to power in Germany.\nEhrenfels was thus spared the agony of seeing the prospect of western\ncivilization becoming something diametrically opposed to his own\nvision. Unlike many a philosopher of the twentieth century, however, it\nshould be kept in mind that Ehrenfels indeed had a vision. In this\nregard he was more comparable to a Leibniz or a Hume as opposed to our\npresent-day specialists in this or that particular domain of\nphilosophical inquiry. Nevertheless, much of his philosophical work\nalso exhibits detailed analysis and rigorous argumentation and may well\nbe appreciated by contemporary philosophers who do not share his\ndriving concerns.\n2. Gestalt Qualities\n“Gestalt” is probably the best known\ncontribution of Ehrenfels to philosophy and psychology. As Ehrenfels\nhimself points out in his 1890 article “Über\n‘Gestaltqualitäten’” (“On ‘Gestalt Qualities’”), he was inspired by a series of\nremarks in Ernst Mach’s 1886 book\nBeiträge zur Analyse der Empfindungen (Contributions to\nthe Analysis of Sensations), in particular Mach’s claim that\nwe would be able to sense spatial shapes and melodies (“tone\nshapes”) directly. Mach begins by discussing the comparison of\ngeometrical shapes: “In examining two figures which are alike\n[gleiche Gestalten] but differently colored (for example, two\nletters of the same size and shape, but of different colors), we\nrecognize their sameness of form [gleiche Form] at the first\nglance, in spite of the difference of color-sensation.” (Mach\n1886, 43, translation from Mach 1914, 105, the same example can be\nfound already in Stumpf 1883, 115, which Ehrenfels had read\npreviously.)  However, Mach then also proceeds to apply the\nterm Gestalt in a metaphorical sense to the qualitative moments\nof melodies.\nGestalten, for Mach, appear thanks to an equality\n(Gleichheit) in the sensations, which can be noticed “at\na glance”, i.e., they are given directly, not deduced or\nabstracted. Mach argues that the geometrical similarity of two whole\nfigures would be given by the lower level equality of their elements\n(lengths, angles, etc.) (Mach 1886, 47; Mach 1914, 109). In analogy to\nhis considerations about space, Mach also applies this analysis to\ntime, finding the same “immediate” perception of\nGestalt in rhythm and melody (Mach 1886, 128; Mach 1914, 285).\nIn this way, Mach used the term Gestalt to indicate the\ncharacteristics of a whole that depend on the specific configuration of\nits parts. This formed one of the starting points for Ehrenfels’\nmuch more focused discussions of Gestalten in 1890. The other\nstarting point is of course the discussion in the School of Brentano\nabout parts and wholes, “relations of relations” and higher\norder objects in general (in various terminologies). In particular,\nEhrenfels’ teacher Alexius Meinong had dedicated a work\nspecifically to the theory of relations (Meinong 1882), which is also\nrepeatedly referred to by Ehrenfels, underscoring that relations are\ncrucially important to his discussion and explicitly pointing out that\nrelations themselves are nothing but Gestalt qualities\n(Ehrenfels 1890; Smith 1988, 101). At the same time, and due to more or\nless the same set of influences, Husserl also had used the term\nGestalt and Gestaltmoment to indicate higher-order\nquasi-qualities and the unitary framework of the whole intuition (in a\nlecture from January 1890, see Husserl 2005, and in the 1891\nPhilosophy of Arithmetic, where he switches his terminology to\n“figural moment”). Despite such anticipations and parallels\n(see also the critical remarks by Zimmer in Albertazzi et al. 2001, 135\nff.), it was Ehrenfels’ work that thematized this whole topic and\nbrought such diverse approaches into focus, thereby turning the\npsychology of Gestalten into a topic in its own right and\nfixating the terminology, problems, and scope of the debate about\nhigher order objects and relations for the years to come.\n It is likely that Ehrenfels’ musical interests, particularly\nWagner’s music and the concept of\n“Leitmotiv”, influenced his idea of\nGestaltqualität and his choice of melodies as a main\nexample. Through Wagner there may be an implicit undercurrent of German\nIdealism and romanticism that in Ehrenfels obtains a\n(Brentanist/Meinongian) psychological formulation (Höfer 2017,\n34–38).\nThe fundamental question with which Ehrenfels begins is the\nfollowing: “Is a melody (i) a mere sum [Zusammenfassung]\nof elements, or (ii) something novel in relation to this sum, something\nthat certainly goes hand in hand with but is distinguishable from the\nsum of elements?” (Ehrenfels 1890, tr. Smith 1988, 83) According\nto Ehrenfels, insofar as Mach spoke of Gestalten as objects of\nsensation, he could not have considered them as “mere sum of\nelements”, but rather as something new. Indeed, Stumpf had\nformulated a similar conclusion, claiming that with fusion the simple\nelements in sensation appear as parts of one greater whole: “the\nqualities are not in the least changed [… ] but a new relation\nis introduced between them, which establishes a closer unity than that\nbetween members of a mere sum” (Stumpf 1890, 64). According to\nEhrenfels, as soon as one is committed to the idea that something other\nthan the sum of the tones makes up the melody, “one has in effect\naccepted what we call the tonal Gestalt” (Ehrenfels\n1890; Smith 1988, 91). More precisely:\nLet us suppose, on the one hand, that the series of\ntones t1,\nt2, t3, …, tn, on being sounded, is\napprehended by a conscious subject S as a tonal Gestalt\n(so that the memory-images of all the tones are simultaneously present\nto him); and let us suppose also that the sum of these n tones,\neach with its particular temporal determination, is brought to\npresentation by n unities of consciousness in such a way that each of\nthese n individuals has in his consciousness only one single\ntone-presentation. Then the question arises whether the\nconsciousness S, in apprehending the melody, brings more to his\npresentation than the n distinct individuals taken together.\n(Ehrenfels 1890; Smith 1988, 85)\nEhrenfels argues that a Gestalt is more (or at least other)\nthan the sum of its parts, which helps to explain how people can\nremember melodies without having absolute pitch and in different keys,\nwhich would be incompatible with the view of melodies as mere sums of\ntones (Ehrenfels 1890; Smith 1988, 90 ff.). Based on these preliminary\nobservations and the rejection of simplistic objections, Ehrenfels\nintroduces his definition of a Gestalt:\nBy a Gestalt quality we understand a positive\ncontent of presentation bound up in consciousness with the presence of\ncomplexes of mutually separable (i.e., independently presentable)\nelements. That complex of presentations which is necessary for the\nexistence of a given Gestalt quality we call the foundation\n[Grundlage] of that quality. (Ehrenfels 1890; Smith\n1988, 93)\nFurthermore, he introduces an important distinction here: “We\ncan however exhaustively partition all possible Gestalt\nqualities into the two non-overlapping categories of temporal and\nnon-temporal.” Specifically, in the case of temporal\nGestalt qualities “at most one element can be given in\nperceptual presentation”, the rest being available only in memory\nor anticipation, while non-temporal Gestalt qualities\n“are qualities whose foundation can be given completely in\nperceptual presentation” (Ehrenfels 1890; Smith 1988, 94).\nHarmony and timbre would be examples of non-temporal\nGestalt qualities and with respect to chords, among others,\nEhrenfels points out that “the Gestalt quality may\nsometimes force itself into the foreground, i.e., may make demands on\nour attention to such an extent that it is difficult to resolve its\nfoundation into elements” (Ehrenfels 1890; Smith 1988, 95). This\nshows the need for abstraction to identify the various layers of tonal\ncomplexes, as we find in Stumpf’s (1883, 101) characterization of\nfusion of consonant tones as “less easily and completely\nrecognized as a multiplicity”. Indeed, Ehrenfels also speaks of\nfusion, and like Stumpf (1890, 65 ff., 193), even of fusion (and hence\nGestalten) among different senses:\nThe intimate fusion of touch, temperature and sometimes also\ntaste and smell sensations into a single unified total impression\nraises the question of whether we do not have here Gestalt\nqualities which are built up upon a foundation belonging to several\nsensory regions. […] we must also accept the possibility of\nGestalt qualities comprehending complexes of elements of\ndifferent categories. (Ehrenfels 1890; Smith 1988, 97)\nTemporal Gestalt qualities, on the other hand, are\ngenerated by “every change of any kind in a presentational\ncomplex, providing it proceeds in some definite direction”,\nspecifically, if such change “reveals a unified character, so\nthat we have (or could have) a name to designate it” (Ehrenfels\n1890; Smith 1988, 97 ff.), it identifies a Gestalt quality.\nHowever, not only change, but also persistence, such as the sustaining\nof a note, can give rise to a peculiar Gestalt quality\n(Ehrenfels 1890; Smith 1988, 101).\nSimilarly to Husserl, who points to collective nouns as identifying\nthe figural moments that characterize Inbegriffe (swarm,\nflock, herd, etc.), Ehrenfels also tries to find helpful indicators in\nordinary language, but cannot but lament the poverty of the available\nterminology:\nWe have to make do with a few words for isolated examples\nfrom the whole range of possible colour changes (e.g. blushing,\nblanching, darkening, glowing, etc.). […] Beside the musical\ntemporal qualities already considered we have to recognize also such\nnoise or resonance Gestalten as, say, thundering, exploding,\nrustling, splashing, etc. (Ehrenfels 1890; Smith 1988, 98,\n100)\nEhrenfels proceeds to highlight Gestalt qualities in almost\nevery domain. First of all, relations also fall “under the\nconcept of Gestalt quality” (Ehrenfels 1890; Smith 1988, 101),\nsince they consist in a presentational complex of separable elements\n(as in the case of the similarity relation between red and orange),\nthough the two categories cannot be straightforwardly be equated\n(Ehrenfels 1890; Smith 1988, 102). Also in the case where elements\ncannot be combined, i.e., logical incompatibility (as in the case of a\nround square), there is nevertheless an unintuitive unity to the\nwhole, which is again a Gestalt quality: “If I am to\ndeny the existence of a round square, then I must be in a position to\nthink this round square. i.e., to combine the two determinations\nroundness and squareness in some way or other.” (Ehrenfels 1890;\nSmith 1988, 103). Moreover, since one can form unintuitive\npresentations also when the elements are compatible, Ehrenfels argues\nthat the movement of going from an unintuitive to the corresponding\nintuitive presentation gives rise to a Gestalt quality.\nThus anyone confronted with, say, a complicated description\nof a work of architecture will first of all form a merely indirect\npresentation of it, which will then be rounded out by gradual execution\nor fulfilment of the various merely intended components, to yield an\nintuitive total picture. But this process of formation of the intuitive\npresentation directly from the indirect presentation is something that\nhappens, a process of change, which serves as the foundation for a\nspecific temporal Gestalt quality. (Ehrenfels 1890, tr.\nSmith 1988, 104)\nGiven the Gestalt nature of relations, including in\nparticular relations of comparison, Ehrenfels argues that\nGestalten can themselves also be compared to one another and\nhence give rise to increasingly higher order Gestalt\nqualities. Ehrenfels suggest among other things, that temporal\nGestalten can be compared with respect to their rhythm or that\nwe can recognize the composer due to similarities in the melodies\n(Ehrenfels 1890, tr. Smith 1988, 105 ff.).\nImportantly, Ehrenfels also argues that temporal Gestalt\nqualities are not limited to outer perception, but also occur in inner\nperception, where the growing or diminishing of desires, fears,\nexpectations, etc. are compared to a crescendo or diminuendo in music\n(Ehrenfels 1890; Smith 1988, 101). With respect to the possibility of\nhigher-order Gestalten, Ehrenfels adds to this the\n“intimate unity with which we combine presentational contents of\nphysical and psychical occurrences” as in all cases of deliberate\nactions “expressed by means of common nouns (kindness, service,\nrivalry, marriage, theft, war, etc.) or verbs (entreat, complain, help,\nrob, avenge, etc.)” (Ehrenfels 1890;. Smith 1988, 107).\nIf we accept any such “union of the physical and the\npsychical” as the basis for a Gestalt quality, then of\ncourse Gestalten are to be found everywhere: “all\ndesignations of human individuals or groups of whatever kind (Hans and\nPaul, priests, manual workers, Scotsmen, rogues, etc.), as well as most\ndesignations for human corporations and institutions (state, authority,\nthe insurance market, etc.), all names of places and territories, and\nequally all names of animal species” (Ehrenfels 1890; Smith 1988,\n107). This leads straight to Ehrenfels’ remarkable claim that\n“the larger part of both our everyday and our scientific\nvocabulary designates Gestalt qualities”. Not only does\nevery verb (with the partial exception of being and having and few\nothers) designate a (temporal) Gestalt, but also “every\nnoun and adjective having reference to more than a single\npresentational element” (Ehrenfels 1890; Smith 1988, 108).\nYet a problem remains, namely whether Gestalt qualities\narise as a result of some activity on our part when confronted with the\nrelevant complex of elements or without any contribution of the\nintellect. Mach held the latter view, that “Gestalten\nare objects of ‘sensation’ just as soon as their respective\nfoundations are given to consciousness” (Ehrenfels 1890; Smith\n1988, 111). Ehrenfels points out first of all that Gestalten\nare not always noticed (e.g. proverbially seeing the trees but not the\nforest) and some effort seems to be required in grasping a shape by\nfilling out and complementing the Gestalt suggested by the\nfoundations, e.g. when “seeing” the third dimension\nsuggested by the cues of a perspectival drawing (Ehrenfels 1890; Smith\n1988, 111 ff.). While we do not actually generate the Gestalt\nin a separate act, specifically meant to add it to the foundation, we\ndo expend effort in completing the required set of presentational\nelements needed for the Gestalt, which then arises\nspontaneously. This, however, does not exclude that different\nGestalten may supervene on the same foundations and that we\ncan switch between them by changing the focus of our attention. By\nbringing a different complex of presentational elements into the\nforeground, i.e., by varying the foundations, we can also (indirectly)\nvary the Gestalt (Ehrenfels 1890; Smith 1988, 112 ff.).\nHaving now found Gestalt qualities nearly everywhere,\nEhrenfels suggests “that the theory of Gestalt qualities\nwould perhaps be qualified to bridge the gulf between the various\nsensory regions, and indeed between the various categories of the\npresentable in general” (Ehrenfels 1890, Smith 1988, 114), which\nultimately “would yield the possibility of comprehending the\nwhole of the known world under a single mathematical formula”\n(Ehrenfels 1890; Smith 1988, 116). Indeed, Ehrenfels will go on to\napply the concept of Gestalt in very disparate fields, ranging\nfrom mathematics to cosmology, thereby also bestowing a peculiar unity\nto his entire oeuvre (see Ierna 2017b).\n3. Theory of Values\nSoon after publishing his article on Gestalt qualities,\nEhrenfels produced a series of articles under the title\n“Werttheorie und Ethik” (1893–1894) which were followed by\nhis two-volume System der Werttheorie (1897–1898). The first\nvolume in particular, entitled Allgemeine Werttheorie, Psychologie\ndes Begehrens, concerns us in this section.\nIt is most appropriate, according to Ehrenfels, to begin a\nphilosophical investigation by taking into account what is indicated by\nordinary language. However, by no means is it obligatory to leave the\nmatter there. Sometimes a revision of the concept in question is\nneeded. Such a revision he finds to be necessary regarding the concept\nof value. While ordinary language seems to indicate that the value of\nsomething is among its objective properties, such a value-property is\nnot to be found in reality. Rather, as long as we adhere to such a\nconception of value, it seems to be mystical. Though we ordinarily\nthink that we desire objects because they are “valuable”\n(i.e., because they supposedly have this “mystical,\nincomprehensible essence”), the fact of the matter, says\nEhrenfels, is that we ascribe value to objects because we desire them\n(Ehrenfels 1897, 2, also see Fabian in Albertazzi et al. 1996,\n166; Reicher 2017, 284 f.).\nBesides the view that value is some sort of mystical property of\nobjects, other ones are identified by Ehrenfels in opposition to his.\nAmong these views is the one put forward by the so-called “first\nschool” of Austrian value theory, as put forward by certain\noutstanding economists (specifically C. Menger, E. Böhm von\nBawerk, and F. von Wieser, as mentioned in Ehrenfels 1897, 3 n.). On\nthis view the value of objects “is neither a property nor an\nessence of them, considered as such, but rather merely their\nindispensability in the satisfaction of our desires” (Ehrenfels\n1897, 3). While Ehrenfels fully appreciates this school’s\ncontribution to the understanding of value (Smith 1994, 282), he\nnonetheless thinks that it does not provide a satisfactory theory of\nvalue in general due to its narrow focus on economic value. There are\nfor him other types of value besides this, as exhibited by\ncounter-examples (as when the lock of hair belonging to one’s\nmother is kept as a thing of value). A general theory of value on his\nview is to illuminate economic value and not vice versa.\nYet another attempt to characterize value without assigning it the\nstatus of a mystical property of certain objects is the one that had\nbeen put forward by Brentano, which Ehrenfels formulates as\nfollows:\nNot all desired things are valuable, but rather only those\nwhich are worthy of being desired. Whether this worthiness\nbelongs to a thing, however, is not in the particular case yielded from\nthe investigation of the objective nature of the thing, but rather from\nthe subjective consideration of the desire directed at the thing. From\nthe examination of our own mental activity in the act of desire we\ndiscern whether this is directed at something valuable or not.\n(Ehrenfels 1897, 3–4)\nIn contemporary terms, Brentano is a cognitivist, for he maintains\nthat loving and hating (the acts of valuing on his view) can be\ncharacterized as correct (Brentano 1889). The “second\nschool” of Austrian value theory, to which the early Meinong\n(1894) as well as Ehrenfels belong, distanced itself from\nBrentano’s cognitivism, while building on his method of\ndescriptive psychology (Grassl in PSI, 5). Here we should note,\nhowever, that Ehrenfels came to develop views in aesthetics that can be\ncontrasted with the non-cognitivism found in his early work. This later\ndevelopment will be discussed further at the end of the present\nsection.\nAn important aspect of Ehrenfels’ value theory is his view\nregarding the relation of desire to feeling. He characterizes feeling\nas anything that occurs on the scale that ranges from pleasure to pain\n(Ehrenfels 1897, 5 ff.). Indifference is the central point in this\nscale. Desire also encompasses a range of phenomena, consisting of\nwishing, striving, and willing (Ehrenfels 1897, 6 ff.). There is,\naccording to Ehrenfels, clearly a difference between feeling and\ndesire, though they are also connected in a psychologically interesting\nway. While Brentano seems to think that his inclusion of feeling and\ndesire in a single class of psychical phenomena is supported by inner\nperception, Ehrenfels points out how ineffective an appeal to inner\nperception is in such matters of dispute (this, however, does not\nprevent Ehrenfels from making similar appeals at crucial junctures of\nhis value theory). Moreover, Brentano argues for his classification of\ndesire together with feeling by presenting us with a range of phenomena\nwhich seem to shade off into each other, beginning with a feeling and\nending with not only a desire, but with a full-fledged instance of\nwilling (Brentano 1874, 308 ff.; Brentano 1995, 183 ff.). Nevertheless,\nEhrenfels maintains that instances in which there occurs feeling\nwithout desire and desire without feeling serve to demonstrate that\nthey do not belong together in the same class of psychical phenomena\n(Ehrenfels 1897, 10 ff.). It is, in addition, on his view desire rather\nthan feeling that determines what is valuable. It was Meinong who first\ninsisted on the distinction between feeling and desire, although he\nregarded feelings rather than desires to be determinative of values\n(Meinong 1894, §§ 5–6). Ehrenfels’ general theory of\nvalue thus stands in contrast with those that were advocated by both of\nhis mentors (also see Reicher 2017, 285 f.).\nEhrenfels also criticizes the traditional view (especially prominent\nin Kantian ethics) that reason (Vernunft) can direct our\ndesires (Ehrenfels 1897, 8 ff.). On his view reason may be used to\nconstruct complexes of presentations, which are then set as goals by\nour desires, though reason itself is unable to set these as goals.\nEhrenfels also thinks that reason can determine the means whereby a\ngoal is to be achieved, but this is again not the same as setting\ngoals. Aside from its involvement in shaping the presentations of ends\nand the determination of the means to them, Ehrenfels rejects any\nsuggestion that reason plays any additional role in valuation.\nWhile the view that desire and not reason determines value will\nsuggest to many that Ehrenfels wants to assert that nothing is valuable\nfor each individual aside from its own pleasure, the underlying\nassumption that one desires only one’s own feeling of pleasure.\nOur experience, however, shows us that this assumption is false.\n“In the most common circumstances of our everyday life our\ndesiring aims directly at certain routine external tasks such as\neating, drinking, waiting, sitting, sleeping, etc., without there being\npresented thereby the state of feeling which corresponds to\nthese” (Ehrenfels 1897, 27; Smith 1994, 283 ff.). Nevertheless,\nobtaining what we desire does result in an increase of pleasure\nrelative to the state that would be experienced without the desire\nbeing satisfied (Ehrenfels 1897, 31 ff.).\nFar from desire being aimed at such concrete things as feelings, it\nis rather described by Ehrenfels in the following way:\nDesiring a thing means either desiring the existence of a\nthing, or possession of it, in which case the desire is directed at an\nexistence, though not of the thing itself, but rather of its\navailability, and at the same time at a non-existence, the absence of\nall disturbances which obstruct that availability. (Ehrenfels\n1897, 53)\nWe can of course have “negative” desires that are as\nsuch directed at the non-existence of something. Though Ehrenfels does\nnot use any technical term in application to the correlate of desire,\nit is understandable to suggest that he has “states of\naffairs” (Sachverhalte) in mind here (Smith 1994,\n286).\nIt has been said that the theory of value that Ehrenfels developed\nin his early work was non-cognitivist in his general theory of values.\nIn his aesthetics, however, we find a very different view regarding\nvalues of works of art. This view is expressed in a posthumously\npublished dialogue, “Was ist Schönheit?”, where he\nsays “that absolute beauty is given and comes about wherever we\ngrasp with feeling or sensation a certain lawfulness\n[Gesetztmäßigkeit] that we cannot\nyet comprehend with the understanding” (PSII, 164). There\nare, according to Ehrenfels, no differences in taste in art. As regards\nmusic, for instance, the apparent difference in taste among people is\ncharacterized as follows:\nMost fundamentally much rather difference in the capacity for\nmusical perception, that is to say, the faculty of apprehension, of\nimagination and memory for tonal forms [Tongestalten] –\nfurthermore difference in inner rhythm and inner gestures with which we\nunconsciously accompany our speech, thoughts, and feelings –\ndifference in our instinctual life [Triebleben], even in the\nformation of our senses. (PSII, 164–165.)\nIn short, absolute beauty is the same for all of us, though our\ndifferences in the apprehension of works of art misleads us into\nthinking that beauty is merely relative, just “a matter of\ntaste”. While this development in Ehrenfels aesthetics away from\nhis earlier non-cognitivism has not gone unnoticed (Reicher 2006, 2009)\nit is a domain that he himself left open for further investigation. It\napparently calls for revision of his earlier non-cognitivism as well as\nexplorations of connections between the theory of Gestalt\nqualities and aesthetics.\nWhile Ehrenfels’ early work on value theory and ethics remained\nfor the most part within the domain now called\n“metaethics”, he did make an effort in his later work to\ndevelop a theory of normative ethics. His most passionate attempt to do\nso will be considered in the following section.\n4. Sexual Ethics\nWhile Ehrenfels’ treatise on sexual ethics of 1907 might\nunderstandably be considered extremely controversial and inappropriate\nby today’s standards, it was much less so at the time it was\nwritten. Most of the seemingly radical ideas and proposals were\nrelatively popular and widespread in educated society at the time, and\nthe controversial nature of his article is rather due to the original\nway in which Ehrenfels combines and connects them, taking them to\nconsiderably farther reaching conclusions (compare Dickinson 2002,\n265–268). The general tenor of this treatise was already anticipated in\nliterary form by Ehrenfels’ choral drama Siegmar und\nHeliea from 1898/1899 (see PSII, 28 ff.).\nEhrenfels aimed at a recuperation of a “natural sexual\nmorality”, which would preserve and advance the healthy\nconstitution of a species, as opposed to the cultural sexual morality\nof his time, which would instead corrupt it (Ehrenfels 1907, 8). This\ncould be effected by recognizing that the main biological function of\nthe sexual drive, namely reproduction, is not the only one. Sexuality also\nserves selection, not in the sense of natural selection as survival of\nthe fittest, but selection aimed at ensuring reproduction by the best,\nleading to the progressive improvement of the species (Ehrenfels 1907,\n9 ff.). This selection is the first and foremost function of male sex\ndrive, which is why Ehrenfels speaks of “virile selection”\n(Ehrenfels 1907, 79, compare Dickinson 2002, 258). Since according to\nEhrenfels males represent the active sex, not just among humans, but\n“in the entire bisexual animal kingdom”, and the\nfemales’ sex drive is only operative as a response to the\nmales’, the male sex drive is the biologically more important\none, and hence the basis for re-establishing the natural sexual\nmorality.\nAs the males’ sex drive exceeds the females’, the males\nwill and should compete with one another for the possibility of\nreproducing with as many females as possible (Ehrenfels 1907, 46). For\na sexually well-endowed man (“einen sexual\nvollkräftigen Mann”), it is advisable\nto have regular, pleasurable intercourse with healthy women or girls\n(Ehrenfels 1907, 62), leading to polygyny, which is the only\n“healthy natural sexual life” (Ehrenfels 1907, 13). For\nEhrenfels, this would actually present a “solution to virtually\nall the major problems confronting European societies” (Dickinson\n2002, 257) in his time. Thanks to competition and polygyny, only the\nbest males will reproduce and will do so in greater numbers than in a\nmonogamous culture, in which virile selection is absent (Ehrenfels\n1907, 11, 30) and where knights and knaves alike rule as lords in their\nfamilies. Conversely, since monandric women have more children than\npolyandric ones (Ehrenfels 1907, 14), and men will only want to care\nfor children that they can be sure to have fathered, females should\nremain monandric and even avoid serial polyandry (Ehrenfels 1907, 12).\nBesides the biological reasons, another concern for Ehrenfels is the\nwell-being of the children in successive marriages, i.e., serial\npolyandry, which would destroy the trust among parents and children, as\na stepfather and alimony would never be a satisfactory replacement\n(Ehrenfels 1907, 68).\nAccording to Ehrenfels, women would remain so impressed and\noverwhelmed by their first sexual experience, that not even the hottest\nfires of passion will ever consume that memory, and hence they should\navoid pre-marital sex to ensure future happiness in married life\n(Ehrenfels 1907, 65). On the other hand, abstinence is not suitable for\nmen, who should certainly have some previous experience so as to be\nfully aware of their sexual duties and to avoid becoming hypersensitive\nto intimate physical contact (Ehrenfels 1907, 69). Nevertheless, the\nyouth should abstain from sex, not just actual but also fantasized, for\nmoral and hygienical reasons until reaching full sexual maturity\n(Ehrenfels 1907, 61). What Ehrenfels considered “unnatural”\nsexual activities, such as masturbation and homosexuality, should be\navoided and condemned, although they can be tolerated as long as they\ndo not damage anyone’s health (Ehrenfels 1907, 56). Indeed,\nautoeroticism, when practiced in moderation, does not cause any\nnoticeable harm (Ehrenfels 1907, 61), and both autoeroticism and\nhomosexual relationships among females, being the passive sex, would\nnot be as harmful as among men, and can hence be considered as lighter\ntransgressions (Ehrenfels 1907, 16).\nMonogamy, however, is a serious danger to the well-being of society,\naccording to Ehrenfels. Not only does a monogamous society morally and\nlegally sanction (Ehrenfels 1907, 78), even “sanctify”\n(Ehrenfels 1907, 81), female possessiveness and jealousy, by\nestablishing an unnatural and merely culturally justified exclusive\nright on the father of her children (Ehrenfels 1907, 79), but also\nthereby engenders all kinds of sexual corruption and general\ndegenerations. By enforcing an unnatural sexual morality, it leads to\ndouble standards (Dickinson 2002, 259), where men are driven by their\nsexuality to prostitutes, pornophilia and hyperaesthesia. Due to the\ndemand their appetites generate, men who buy sexual satisfaction are\ncomplicit in the human trade and the corruption of young women who\nenter into prostitution, though it would go too far to forbid\nprostitution altogether (Ehrenfels 1907, 62). The natural sex drive of\nmen, which cannot be satisfied through monogamy, drifts into extremes,\nboth toward pornophilia (“die Freude am\nSchweinischen”), i.e., pure sensualistic, even animalistic\nstimulation, disregarding the function of reproduction, through\nmasturbation or in brothels (with all the risks of STDs), and in the\nother direction toward incessant search for variety and exotic\neroticisms (Ehrenfels 1907, 49).\nThe one positive side effect of monogamy is that it has led to the\n“sublimation of sexual affects”, as modern psychology has\nit, among sexually frustrated males. Since males cannot find full\nsatisfaction for their sex drive in monogamous marriage, they divert\ntheir superfluous energy into other pursuits, such as cultural\nachievements of various sorts: “accumulation of ownership and\npossessions, economical and social organization, artistic and\nscientific achievements, indeed in works of charity and neighborly\nlove” (Ehrenfels 1907, 31).\nEhrenfels connects these themes of gender and sexuality to larger\nissues of economy, sociology and politics. For instance, while\nhistorically the institution of monogamy enabled women (and their\nchildren) to join the workforce as partners in the family business\n(Ehrenfels 1907, 37), the changing economical situation, which favors\nlarger enterprises, puts monogamy at a distinct disadvantage by\nlimiting the opportunities for married women to work. This also\nnegatively affects the overall composition and growth of the workforce,\nsince the advanced techniques available for family planning (Ehrenfels\n1907, 42 ff.) and the rising age (especially among the higher educated)\nat which couples marry and have children, leads to lower birthrates\n(Ehrenfels 1907, 35 ff.). Monogamy, Ehrenfels argues, leads to a\ndecrease both in quality as well as the quantity of the population\n(compare Dickinson 2002, 259), and hence a deficit in the workforce\nthat can be compensated for only through immigration (Ehrenfels 1907,\n43). This has repercussions on a global scale, because Ehrenfels\nfeared, as many did at the time, the competition of other races,\nspecifically the “Mongolian” or yellow race. In particular\nthe Chinese would be an indomitable competitor economically, as they\ncould sink wages by offering lower cost labor thanks to their greater\nnumber and fertility (Ehrenfels 1907, 86 ff.). The “Mongol\ntsunami” (“Mongolenflut”) would interrupt\ncultural development for centuries and for Ehrenfels the only\nremedy was to adopt his newly developed sexual ethics as soon as\npossible in order to increase quantity and quality of the population.\nEhrenfels regarded his reform as absolutely crucial for humanity at\nlarge in the long term, noting that in the end also the Mongol hordes\nwould have to adopt it, when they would eventually face the same\nproblems down the road (Ehrenfels 1907, 94).\n\nEhrenfels had the opportunity to present his proposal in the Vienna\nPsychoanalytic Society on December 23, 1908, where Isidor Sadger\nobserved not only that “all of this seems like an adolescent\nsexual fantasy”, but more significantly that behind\nEhrenfels’ views there would seem to be a personal history,\nregarding the author’s own sexuality (cf. Dickinson 2002,\n268–270). In reply to this, Ehrenfels pointed out that his\nproposal had grown out of the realization that it was not necessarily\nhe who needed to curb his sex drive, but that the dominant morality\nwas a distortion of the natural one.\n\nThe sexual and social reforms he proposed in numerous articles,\nopinion pieces, and lectures spanning more than a decade (PSII, 30,\nn. 29), were for the most part met with deafening silence (PSII, 35,\n40; Valent 2016, 193).\n5. Philosophy of Mathematics\nLike most of Brentano’s students, Ehrenfels also wrote various\nworks on the philosophy of mathematics: first of all his 1885\ndissertation on\n“Größenrelationen und Zahlen:\neine psychologische Studie” (“Relations of Magnitude\nand Numbers: a Psychological Study”), then his article\n“Zur Philosophie der Mathematik” (“On the\nPhilosophy of Mathematics”) in 1891, the same year as\nHusserl’s Philosophy of Arithmetic, and finally in 1922\nhis booklet on Das Primzahlengesetz (The Law of\nPrime Numbers). As Simons (1988, 10) observes, his early\nmathematical works are representative of the Brentanian approach as it\ncan also be found in Husserl’s and Stumpf’s habilitation\nworks.\nIndeed, in his (Ehrenfels 1885, Ierna 2017a) dissertation Ehrenfels\npresents an account of the concept of number and the philosophy of\nmathematics that is for the most part the traditional Brentanian one,\nthough unsurprisingly including many Meinongian elements. Ehrenfels\nclaims that by abstracting from all particularities of two objects and\nconsidering them merely as the foundations of a relation of difference,\nwe obtain the concept of two. If we then add another object, we need to\ncompare and distinguish not only the first-order relations among the\nfoundations, but also the second-order relation of difference among the\nfirst-order relations of difference, and so on for every additional\nelement. This leads to a rapid increase in complication, as illustrated\nin Husserl’s critique of such an approach in the second chapter\nof the Philosophy of Arithmetic. Ehrenfels likewise concludes\nthat this process of distinction soon leads beyond our limited\npresentational capacities and requires more convenient, though\nindirect, ways of presenting numbers. Hence, he argues that higher\nnumbers can only be reached by successive presentations of partial\nnumbers, e.g. nine by three times three.\nEhrenfels presents an interesting account of the golden ratio\n(1:1.618) as the point where the relations of similarity and difference\nare in balance, i.e., two magnitudes that stand to each other in the\ngolden ratio are as similar as they are different. Towards the end of\nthe work Ehrenfels’ discussion of higher-order relations and of\ncomparisons of relations independently of their foundations leads him\ninto formulations that could be seen as anticipating his later concept\nof Gestalt qualities.\nIn his article on the philosophy of mathematics Ehrenfels starts\nwith an analysis of the presentation of number and the concepts of\nunity and multiplicity. He denies an empirical basis to number\npresentations: “The presentation of number is not extracted from\nexternal perception, but is actually inserted into it” (Ehrenfels\n1891, 287). Ehrenfels takes relations of difference as the foundation\nfor the concept of multiplicity and goes on to describe the\nconstruction of numbers through counting, by successive addition of\nunities (Ehrenfels 1891, 289 ff.). Like other Brentanists, he comments\non the limits of our cognitive capacities and points out that we can\nhave a presentation of higher numbers only indirectly, i.e.,\nsymbolically (Ehrenfels 1891, 292, also see 289 where he refers to\nHusserl 1887). Ehrenfels here chooses the Meinongian terminology,\nspeaking of indirect or founded contents (see his notes on 292 ff.), but\nalso follows Brentano’s approach when remarking on the power of\nsigns to function as surrogates for presentations (Ehrenfels 1891,\n296). He gives an extensive critique of Kant’s famous doctrine\nthat “7+5=12” would be an example of a synthetic\nproposition a priori, with a quite idiosyncratic argumentation, stating\nthat the a priori or a posteriori character of the\nsum would depend on the possibility of a direct intuition of its\nelements, i.e., a proper presentation. If we have to externalize the\nprocess by use of signs when the numbers exceed our cognitive\ncapacities, then how can we claim to be able to perform such\ncalculations a priori? Ehrenfels lists several examples that\ninvolve external aids, such as the use of logarithmic tables: looking\nup a number on a list is hardly an “a priori”\ncognitive act (Ehrenfels 1891, 329). The interesting aspect of his\napproach is that he takes mathematics in this way as an essentially\ncomputational science, relying on external artifacts (“physical\naides”) and hence as a science which necessarily has a large\na posteriori component (Ehrenfels 1891, 331). In the second\nhalf of the article, however, Ehrenfels provides a critique of J.S.\nMill and empiricism in mathematics, along the same lines as Stumpf had\ndone in his habilitation work. Like Husserl and fellow Meinong-student\nKonrad Zindler, he points out that in the progress of calculation with\nsigns one often hits on “unpresentable” combinations, i.e.,\ncombinations of signs that cannot be combined into a proper\npresentation (Ehrenfels 1891, 342). Yet, these “impossible”\ncombinations do then lead to correct results. (This paragraph is based\nin part on Ierna 2011).\nEhrenfels himself assigns an important biographical role to his\nlast major work in the philosophy of mathematics, while its actual\nphilosophical and mathematical significance is much more modest, as we\nwill see. Ehrenfels states in the preface to Das\nPrimzahlengesetz that, after a long depression following WWI, the\ncontemplation of the “field of numbers and their eternal,\nnecessary connections” soothed his agonized spirit\n(“Weltangst”) (Ehrenfels 1922, III). In the preface\nto the work he retraces the development of the core idea of the book,\ndescribing very poetically how in April 1919 the idea\n“blossomed” in his mind about the distribution of prime\nnumbers (Ehrenfels 1922, IV: “An einem warmen Aprilvormittag\n1919 ist mir – in der Sonne gelagert neben der Gruft meines\nVaters – „der Knopf aufgegangen” für das\nWesentliche der Lösung.”) Ehrenfels himself at first took\nit only as a rediscovery of already well-established mathematical\ninsights, but having been informed by his friend and colleague the\nmathematician Gerhard Kowalewski that the matter of the distribution\nof primes was far from settled, Ehrenfels tried to work out his idea\nin a more systematic fashion, convinced to have hit on something new\nand worthwhile.\nEhrenfels’ core idea in Das Primzahlengesetz\nis to apply the notion of Gestalt to number series to find the\nlaw-like regularities in the distribution of prime numbers. Therefore\nEhrenfels decided to include the entire text of his 1890 article\n“Über Gestaltqualitäten” in the work,\nunchanged, though split into two parts. In the course of his\ndiscussion, Ehrenfels once again goes down the familiar road of\nBrentanist mathematics: a discussion of proper and symbolic\npresentations of number, the limits of our presentational capacity,\nproper number conceptions as based on (higher order) relations of\ndistinction, etc. (Ehrenfels 1922, 30 ff.) He explicitly considers the\nproper number presentations as Gestalt qualities, and to be\nprecise, as presentations of “second order”. Collections of\nnumbers, which he calls Zahlenfiguren, would be of third\norder. These number figures play a central role in, literally,\n“figuring out” the prime numbers: by generating series of\nnumber figures corresponding to all multiples of a base number, which\ncan then be combined in such a way as to filter out the primes.\nHowever, in the end the result of this procedure turns out to be\nquite trivial from a mathematical perspective: “It actually\nmerely leads to a simplification of the method known as the\n“Sieve of Eratosthenes” already being practiced for more\nthan 2000 years” (Ehrenfels 1922, 48). The method of the sieve\nconsists in identifying and then eliminating all divisible numbers by\ngenerating them from multiplications of primes. If one wants to find\nall the prime numbers between 0 and 100, one would proceed by striking\nall multiples of two, then all multiples of three, etc. until only the\nprimes remain. Ehrenfels’ approach shortens the process by\navoiding repeated strikings, as would happen e.g. with 6 as multiple of\nboth 2 and 3 (Ehrenfels 1922, 49). As Simons (1986, 112) argues, this\nis merely computationally faster than the traditional method of the\nsieve of Eratosthenes (but slower than other methods, as experimentally\nverified by Simons 1988, 12), but not a substantially new\nalgorithm.\n6. Cosmology\nIn his 1916 Kosmogonie, Ehrenfels aims at laying out the\nfundamental Gestalt of the world as a whole. Ehrenfels wants to\nelucidate the origin, development, and ultimate destiny of the\nuniverse. On the one hand, he considers it as a Kosmos in the\nclassical sense of an ordered, harmonious whole, governed by an\nordering principle that establishes the wholeness and unity of the\nworld. However, Ehrenfels also acknowledges a principle of disunity\nand entropy: chaos and chance. For Ehrenfels, the world as we know it\nis generated through the complementary activity of these two cosmic\nprinciples (compare PSII, 44 ff.; Valent 2016, 195; Höfer 2017,\n46; Ierna 2017b, §3).\nThis results in a religious dualism. The contraposition of chaos and\ncosmos explains the presence of both good and evil, reason and chance,\netc. in the world, allowing Ehrenfels to provide a theodicy.\nNevertheless, the cosmic principles themselves cannot be\nstraightforwardly regarded as absolutely good or evil. Moreover,\nalthough Ehrenfels calls the ordering principle “God”, it\ncannot be understood as the omnipotent creator of western monotheism\n(also dubbed “solotheism” by Ehrenfels), since neither\ncosmic principle is absolute in itself. Creation can only be achieved\nby both principles working in tandem and consists in God ordering and\n“shaping” or “forming”\n(“Gestalten” in its verbal form) the world in\nperpetual contrast with chaos. Hence, the Kosmogonie does not\ncarry the tone of a typically Christian religious work, nor is it\nsimply a transposition of ancient or eastern mythologies into modern\nEurope. Rather, Ehrenfels had the ambition to formulate a general\nframework for a (utopian) future world-spanning religion, based on a\nfirm scientific foundation (Ehrenfels 1916, 150, also see PSII,\n52). Indeed, Ehrenfels presents his dualism explicitly as a scientific\nhypothesis to be investigated and proven, and concludes that it can in\nfact explain the world as it is and can be confirmed by experience\n(Ehrenfels 1916, 23, 35).\nIn the fourth paragraph of the sixth chapter, Ehrenfels formulates\nsix dogmas for his new religion: 1) The world is the combined product\nof the active principle of order and form\n(“Gestaltung”) and the passive principle of chaos.\n2) The world has a beginning but no end. Order and form are eternally\nprogressing and increasing. 3) The principle of unity is bodiless and\nrather “soul-like”. 4) The eternal progress of the world\nproceeds from an eternal internal development in the principle of\nunity. 5) The world is not a result of a purposeful will, but of a\nblind forming (“Gestalten”). 6) We human beings\nare part of the divine and hence collaborators in the divine works.\nThese last two points are particularly relevant, because Ehrenfels\nwill conclude the Kosmogonie with the admittedly\nunsubstantiated claim that the principle of unity and order is coming\nto self-awareness through the human mind and that it is in and through\nhuman beings that its blind creative impulse can acquire a purpose\n(Ehrenfels 1916, 86, 207).\nThe mere formulation of the six dogmas, as Ehrenfels clearly states\nat the end of the fourth paragraph of the sixth chapter, cannot have\nthe pretension to constitute without further ado a fully formed\nreligion. In his 1922 Gedanken über die\nReligion der Zukunft, Ehrenfels then sketches in more detail what\nis still missing in the Kosmogonie. Here, as well as in the\nKosmogonie, he provides a description or morphology of\nreligion rather than a definition (in the Kosmogonie he spoke\nof a physiognomy as Weltbeschreibung). Religions in general\nconsist of four aspects:\n\na Weltanschauuung, an encompassing vision of the world\nbased on metaphysical assumptions, that address the “big\nquestions” of why, whence, and whereto;\na Morallehre or moral standard that tells us which actions\nare good or evil, allowed or reprehensible;\na Kultus, or a system of traditional practices that allow\nthe faithful to relate to whichever powers of the cosmos they\nacknowledge;\nexemplary Idealgestalten, imaginary or historical figures\nto emulate, i.e., heroes and saints.\n\nHowever, Ehrenfels in this writing renounces\nthe soul-like nature of the divine and formulates a new theory of the\n“superposition of units of consciousness”. Ehrenfels claims\nthat wherever there is a living cell, there we can speak of some form\nof “consciousness”. This would hold not only for\nunicellular organisms, but also for plants, animals and humans. If\nevery living cell of my body is somehow conscious, then also the\nindividual cells in my brain must be. Yet while each and every\nindividual neuron is conscious in itself, collectively they also\nconstitute my unitary consciousness as a human being. This leads\nEhrenfels through analogy to formulate the idea of “personalities\nof higher order”, indeed a Volksseele would be more than\na mere poetic fiction. As support for this thesis Ehrenfels points to\norganic metaphors for social processes (such as competition for limited\nresources) as well as the purposeful unity displayed by bee swarms that\ncollectively act like a single organism. Similarly, a few years later\nin Die Religion der Zukunft, he also states explicitly that\nall intellects participate in the divine intellect (Ehrenfels 1929, in\nPSIV, 286).\nEhrenfels’ thoughts and writings about cosmology and religion\ndidn’t remain at the level of mere academic\n“armchair” speculations. Besides his engagement for sexual\nreform and the racial question in opinion pieces and speeches, he also\nactively sought to concretely establish the new religion sketched\nabove. Indeed, Ehrenfels went so far as to publicly appeal in an open\nletter to the president of Czechoslovakia, his former fellow\nBrentano-pupil Thomas Masaryk, to act as the founder of the new\nreligion (Ehrenfels 1929, in PSIV, 289 ff.). Although\nsympathetic to his concerns, Masaryk politely rebuffed him, clearly\ndistinguishing between his personal religious thoughts and his public\npolitical role (see Masaryk’s letter to Ehrenfels in PSIV,\n294 ff.).\n7. Legacy\nInevitably, what comes to mind first and foremost when speaking of\nEhrenfels’ legacy, is the idea of Gestalt. Whatever the\ninspiration by Mach or parallel developments in Husserl, it was\nEhrenfels’ seminal paper “Über\nGestaltqualitäten” that gave rise to\nthe ensuing debates in the school of Brentano and beyond. As Smith\n(1988, 12) observes: “The importance of Ehrenfels’ paper\nrests on the fact that it contains the first concentrated reflections\non the question ‘what complex perceived formations such as\nspatial figures or melodies might be’.” Ehrenfels’\noriginal proposal of\n“Gestaltqualitäten” still\nleft many issues open or unclear, which were soon taken up in various\nways by his fellow Brentanians. Despite opposition against his\nterminological choice and the development of alternative terminologies,\nsuch as Meinong’s “founded contents” (1891, 253) and\nHusserl’s “figural moments” (1891, 236 n. 1) or\n“moments of unity” (1901, 230), Ehrenfels’ article\nfixed the terminology and many of the conceptual categories. At\nvariance with Brentano’s other pupils, Ehrenfels did not manage\nto establish a school or movement of his own, although he was the first\nteacher of Max Wertheimer in Prague. While Ehrenfels’ work\nsketched the larger picture and provided a general framework to\napproach Gestalt phenomena, many of the details were worked\nout subsequently by the Graz and Berlin schools of Gestalt\npsychology, formed by the students of Stumpf (Max Wertheimer, Kurt\nKoffka and Wolfgang Köhler) and Meinong (Stephan Witasek and\nVittorio Benussi). Systematically, the schools differ mainly in their\nviews on how Gestalt qualities originate. Contra Ehrenfels,\nthe Graz school argued that Gestalten are actively produced by\nour intellect on the basis of the Gestalt switch phenomenon\n(see, among others, Smith 1994, 259 ff.).\nHowever, the results that may be regarded as Ehrenfels’ most original and\ninfluential contributions, both the original article on\nGestalt as well as his engagement with value theory, were\nmostly products of his early career (compare PSII, 21 ff.). The\nendeavors Ehrenfels passionately pursued later on, even though\npartially related to and building on his earlier work, ended for the\nmost part in failure. His proposals for sexual and social reforms fell\nflat, the idea of establishing a new religion went nowhere, and the\ndiscovery of the one and only law of primes turned out to be a very\nminor accomplishment (cf. PSII, 53).\nThe notion of Gestalt, to the contrary, obtained great\ninfluence also beyond the school of Brentano and its offspring (compare\nZimmer in Albertazzi et al. 2001, 141 ff.). In particular, the idea of\nGestalt switch and a holistic interpretation of higher-order\nphenomena in various contexts, has served as a metaphor and inspiration\nfor (among others) the idea of incommensurability of scientific theories in\nThomas Kuhn and the logical positivism of the Vienna Circle,\nparticularly Rudolf Carnap’s holism, which in turn influenced\nW. V. O. Quine’s. While increasingly removed from its original\nformulation, the historical starting point for it all is\nEhrenfels’ article on Gestalt qualities.\n",
    "bibliography": {
        "categories": [
            "<a id=\"PriLit\">Primary Literature</a>",
            "<a id=\"SecLit\">Secondary Literature</a>"
        ],
        "cat_ref_text": {
            "<a id=\"PriLit\">Primary Literature</a>": [
                "</h3>\n<h4>Works by Ehrenfels</h4>\n<ul class=\"hanging\">",
                "von Ehrenfels, Christian, 1885, <i>Größenrelationen und\nZahlen: eine psychologische Studie</i> (dissertation), Carlo Ierna\n(ed.) in Jutta Valent and Ulf Höfer (eds.) <em>Christian von\nEhrenfels: Philosophie – Gestalttheorie – Kunst:\nÖsterreichische Ideengeschichte Im Fin de Siècle</em>,\nBerlin: De Gruyter, pp. 185–234, 2017.",
                "–––, 1887, <i>Über Fühlen und\nWollen. Eine psychologische Studie</i>. Vienna: Kaiserliche Akademie\nder Wissenschaften. (Reprint in Fabian 1988: 15–97.)\n[<a href=\"https://archive.org/details/ueberfhlenundwo00ehregoog\" target=\"other\">available online</a>]",
                "–––, 1890, “Über\n‘Gestaltqualitäten’”, <i>Vierteljahrsschrift\nfür wissenschaftliche Philosophie</i>, 14: 249–292. (Reprint\nin Fabian 1988: 128–155.)\n[<a href=\"http://gallica.bnf.fr/ark:/12148/bpt6k94141n/f254.image\" target=\"other\">available online</a>]",
                "–––, 1891, “Zur Philosophie der\nMathematik”, <i>Vierteljahrsschrift für wissenschaftliche\nPhilosophie</i>, 15: 285–347. (Reprint in Fabian 1988:\n415–451.)\n[<a href=\"http://gallica.bnf.fr/ark:/12148/bpt6k941420/f290.image\" target=\"other\">available online</a>]",
                "–––, 1893, “Werttheorie und\nEthik”, <i>Vierteljahrsschrift für wissenschaftliche\nPhilosophie</i>, 17: 76–110, 200–266, 321–363,\n413–475. (Reprint in Fabian 1982: 23–151.)\n[<a href=\"http://gallica.bnf.fr/ark:/12148/bpt6k94144p/f83.image\" target=\"other\">available online</a>]",
                "–––, 1894, “Werttheorie und\nEthik”, <i>Vierteljahrsschrift für wissenschaftliche\nPhilosophie</i>, 18: 77–97. (Reprint in Fabian 1982:\n151–166.)\n[<a href=\"http://gallica.bnf.fr/ark:/12148/bpt6k941451/f82.image\" target=\"other\">available online</a>]",
                "–––, 1897, <i>System der Werttheorie, I:\nAllgemeine Werttheorie, Psychologie des Begehrens</i>. Leipzig:\nO. R. Reisland. (Reprint in Fabian 1982: 201–406.)\n[<a href=\"https://archive.org/details/systemderwertth00ehregoog\" target=\"other\">available online</a>]",
                "–––, 1898, <i>System der Werttheorie, II:\nGrundzüge einer Ethik, Psychologie des Begehrens</i>. Leipzig:\nO. R. Reisland. (Reprint in Fabian 1982: 407–593.)\n[<a href=\"https://archive.org/details/systemderwertth01ehregoog\" target=\"other\">available online</a>]",
                "–––, 1907, <i>Sexualethik</i>. Wiesbaden:\nBergman. [<a href=\"https://archive.org/details/sexualethik00ehregoog\" target=\"other\">available online</a>]",
                "–––, 1908, “Die gelbe\nGefahr”, <i>Sexual-Probleme</i>, 4: 185–205.",
                "–––, 1916, <i>Kosmogonie</i>. Jena:\nDietrichs. (Reprint in Fabian 1990: 69–230.)",
                "–––, 1922, <i>Das Primzahlengesetz, entwickelt\nund dargestellt auf Grund der Gestalttheorie</i>. Leipzig:\nReisland. (Reprint in Fabian 1988: 455–505.)",
                "–––, 1922, “Gedanken über die\nReligion der Zukunft” (in 8 articles), <i>Prager Presse</i>, 23\nApril, 7/14 May, 28 May, 4 June, 18 June, 2 July, 16 July, 27 August\n1922. (Reprinted in Fabian 1990: 231–280.)",
                "–––, 1932 (dictated), “Über\n‘Gestaltqualitäten’”, <i>Philosophia</i>\n(Belgrade), 2 (1937): 139–141. (Reprint in F. Weinhandl (ed.)\n1960: 61–63.)",
                "–––, [PSI], <i>Philosophische Schriften,\nI. Werttheorie </i>, Munich and Vienna: Philosophia. (Reprints include\nEhrenfels 1897, Ehrenfels 1898.) Edited by Reinhard Fabian, 1982.",
                "–––, [PSII], <i>Philosophische Schriften,\nII. Ästhetik</i>, Munich and Vienna: Philosophia. Edited by\nReinhard Fabian, 1986.",
                "–––, [PSIII], <i>Philosophische Schriften,\nIII. Psychologie, Ethik, Erkenntnistheorie</i>, Munich and Vienna:\nPhilosophia. (Reprints include Ehrenfels 1887, Ehrenfels 1890.) Edited\nby Reinhard Fabian, 1988.",
                "–––, [PSIV], <i>Philosophische Schriften,\nIV. Metaphysik</i>, Reinhard Fabian (ed.), Munich and Vienna:\nPhilosophia, 1990.\n</ul>\n<h4>Translations of Works by Ehrenfels</h4>\n<ul class=\"hanging\">",
                "<i>Cosmogony</i>, translation of Ehrenfels 1916, Mildred Focht\n(trans.), New York: Comet Press, 1948.",
                "“On ‘Gestalt Qualities’”, translation of\nEhrenfels 1890, Barry Smith (trans.), in B. Smith (ed.) 1988:\n82–117.",
                "“Gestalt Level and Purity”, translation of\npp. 93–96 in Ehrenfels 1916, Barry Smith (trans.), in Smith\n(ed.) 1988: 118–120,\n <a href=\"http://ontology.buffalo.edu/smith/book/FoGT/Ehrenfels_Purity.pdf\" target=\"other\">available online</a>.",
                "“On ‘Gestalt Qualities’, translation of\nEhrenfels 1932, Mildred Focht (trans.), revised and corrected by Barry\nSmith, in Smith (ed.) 1988: 121–123,\n <a href=\"http://ontology.buffalo.edu/smith/book/FoGT/Ehrenfels_Gestalt_1932.pdf\" target=\"other\">available online</a>.\n</ul>\n<h4>Primary Works by Other Philosophers</h4>\n<ul class=\"hanging\">",
                "Brentano, Franz, 1874, <i>Psychologie vom empirischen\nStandpunkte</i> I. Leipzig: Duncker &amp; Humblot.\n [<a href=\"https://archive.org/details/psychologievome00kraugoog\" target=\"other\">available online</a>]",
                "–––, 1889, <i>Vom Ursprung sittlicher\nErkenntnis</i>. Leipzig: Duncker &amp; Humblot.\n [<a href=\"https://archive.org/details/vomursprungsitt00brengoog\" target=\"other\">available online</a>]",
                "–––, 1995, <i>Psychology from an\nEmpirical Standpoint</i>. London: Routledge. (Translated by\nAntos. C. Rancurello et al.)",
                "Husserl, Edmund, 1887, <i>Über den Begriff der\nZahl. Psychologische Analysen</i>. Halle: Heynemann’sche\nBuchdruckerei (F. Beyer).\n [<a href=\"http://www.freidok.uni-freiburg.de/volltexte/5870/\" target=\"other\">available online</a>]",
                "–––, 1891, <i>Philosophie der\nArithmetik. Psychologische und Logische Untersuchungen</i>,\nHalle-Saale: C.E.M. Pfeffer (Robert Stricker).\n [<a href=\"http://www.freidok.uni-freiburg.de/volltexte/6159/\" target=\"other\">available online</a>]",
                "–––, 1901, <i>Logische Untersuchungen. Zweiter\nTheil, Untersuchungen zur Phänomenologie und Theorie der\nErkenntnis</i>. Halle: Niemeyer.\n [<a href=\"http://www.freidok.uni-freiburg.de/volltexte/6020/\" target=\"other\">available online</a>]",
                "–––, 1889/1890, “Lecture on the Concept of\nNumber (WS 1889/1890)”, in Ierna, Carlo (ed.), <i>The New\nYearbook for Phenomenology and Phenomenological Philosophy</i>,\n5 (2005): 278–309. (Translated by Ierna Carlo.)\n[<a href=\"http://essential.metapress.com/content/y07w660702l20467/\" target=\"other\">available online</a>]",
                "Kindinger, Rudolf (ed.), 1965, <i>Philosophenbriefe aus der\nwissenschaftlichen Korrespondenz von Alexius Meinong</i>. Graz:\nAkademische Druck- und Verlagsanstalt.",
                "Mach, Ernst, 1886, <i>Beiträge zur Analyse der\nEmpfindungen</i>. Jena: Gustav Fischer.\n [<a href=\"https://archive.org/details/beitrgezuranaly00machgoog\" target=\"other\">available online</a>]",
                "–––, 1914, <i>The Analysis of Sensations</i>. \nChicago: Open Court. (Translation by C. M. Williams of Mach 1886.)\n[<a href=\"https://archive.org/details/contributionsto00machgoog\" target=\"other\">available online</a>]",
                "Meinong, Alexius, 1882, “Hume Studien II. Zur\nRelationstheorie” in <i>Sitzungsberichte der\nphilosophisch-historischen Klasse der Kaiserlichen Akademie der\nWissenschaften in Wien</i>, Band 101, Vienna, 573–752.\n [<a href=\"https://archive.org/stream/sitzungsbericht101stuoft\" target=\"other\">available online</a>]",
                "–––, 1891, “Zur Psychologie der\nKomplexionen und Relationen” in <i>Zeitschrift für\nPsychologie und Physiologie der Sinnesorgane</i> II: 245–265. \n[<a href=\"http://vlp.mpiwg-berlin.mpg.de/references?id=lit14340&amp;page=p0245\" target=\"other\">available online</a>]",
                "–––, 1894, <i>Psychologisch-ethische\nUntersuchungen zur Werth-Theorie</i>. Graz: Leuschner &amp; Lubensky.\n [<a href=\"https://archive.org/details/psychologischet02meingoog\" target=\"other\">available online</a>]",
                "Menger, Carl, 1871, <i>Grundsätze der\nVolkswirtschaftslehre</i>, Vienna: Wilhelm\nBraumüller. [<a href=\"http://www.mises.de/public_home/article/63\" target=\"other\">available online</a>]",
                "Stumpf, Carl, 1883, <i>Tonpsychologie</i>. Vol. 1. Leipzig: Hirzel.\n [<a href=\"https://archive.org/details/tonpsychologie01stumgoog\" target=\"other\">available online</a>]",
                "–––,\n1890, <i>Tonpsychologie</i>. Vol. 2. Leipzig: Hirzel.\n [<a href=\"https://archive.org/details/tonpsychologie00stumgoog\" target=\"other\">available online</a>]",
                "Urban, Wilbur Marshall, 1909, <i>Valuation: Its Nature and its\nLaws</i>. London: Swan Sonnenschein &amp; Co.\n [<a href=\"https://archive.org/details/valuationitsnat00urbagoog\" target=\"other\">available online</a>]",
                "Wieser, Friedrich von, 1889, <i>Der natürliche\nWerth</i>. Vienna: Alfred Hölder.\n [<a href=\"https://archive.org/details/dernatrlichewer00wiesgoog\" target=\"other\">available online</a>]\n</ul>\n<h3>"
            ],
            "<a id=\"SecLit\">Secondary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Albertazzi, Liliana, Massimo Libardi, and Roberto Poli (eds.),\n1996, <i>The School of Franz Brentano</i>. Dordrecht: Kluwer.",
                "Albertazzi, Liliana, Dale Jacquette, and Roberto Poli (eds.),\n2001, <i>The School of Alexius Meinong</i>. Aldershot: Ashgate.",
                "Ash, Mitchell G., 1995, <i>Gestalt Psychology in German Culture\n1890–1967: Holism and the Quest for Objectivity</i>. Cambridge:\nCambridge University Press.",
                "Dickinson, Edward, 2002, “Sex and the ‘Yellow\nPeril’: Christian von Ehrenfels’ Program for the Revision\nof the European Sexual Order, 1902–1910” in <i>German\nStudies Review</i>, 25(2): 255–284.\n [<a href=\"http://www.jstor.org/stable/1432992\" target=\"other\">available online</a>]",
                "Dölling, Evelyn, 1999, <i>“Wahrheit suchen und Wahrheit\nbekennen.” Alexius Meinong: Skizze seines Lebens</i>. Amsterdam\nand Atlanta: Rodopi.",
                "Eaton, Howard O., 1930, <i>The Austrian Philosophy of\nValues</i>. Norman: Oklahoma University Press.",
                "Fabian, Reinhard (ed.), 1986, <i>Christian von Ehrenfels: Leben\nund Werk</i>. Amsterdam and Atlanta: Rodopi.",
                "–––, 1996, “Christian von Ehrenfels\n1859–1932”, in Albertazzi et al., 161–174.",
                "Fréchette, Guillaume, 2017, “Bergman and\nBrentano”, in Kriegel, Uriah (ed.), <em>The Routledge Handbook\nof Franz Brentano and the Brentano School</em>, London and New York:\nRoutledge, pp. 323–333.",
                "Grassl, Wolfgang, and Smith, Barry (eds.), 1986, <i>Austrian\nEconomics: Historical and Philosophical Background</i>. London and\nSydney: Croom Helm.",
                "Höfer, Ulf, 2017,\n“Ehrenfels, Wagner und der Gestaltbegriff”, in Valent,\nJutta and Höfer, Ulf (eds.), <em>Christian von Ehrenfels:\nPhilosophie – Gestalttheorie – Kunst: Österreichische\nIdeengeschichte Im Fin de Siècle,</em> De Gruyter, pp.\n21–52.",
                "Ierna, Carlo, 2009, “Husserl et Stumpf sur la Gestalt et la\nfusion”, in <i>Philosophiques</i>, 36(2):\n489–510. [<a href=\"http://id.erudit.org/iderudit/039482ar\" target=\"other\">available online</a>]",
                "–––, 2011, “Brentano and\nMathematics”, in <i>Revue Roumaine de Philosophie</i>, 55(1):\n149–167.",
                "–––, 2017a, “On Ehrenfels’\nDissertation”, in Valent, Jutta and Höfer, Ulf\n(eds.), <em>Christian von Ehrenfels: Philosophie –\nGestalttheorie – Kunst: Österreichische Ideengeschichte Im\nFin de Siècle</em>, De Gruyter, pp. 163–184.",
                "–––, 2017b, “Die Gestalten und das\nGestalten der Welt”, in Valent, Jutta and Höfer, Ulf\n(eds.), <em>Christian von Ehrenfels: Philosophie –\nGestalttheorie – Kunst: Österreichische Ideengeschichte Im\nFin de Siècle</em>, De Gruyter, pp. 53–68.",
                "Janoušek, Hynek and Rollinger, Robin, 2017, “The\nPrague School”, in Kriegel, Uriah (ed.), <em>The Routledge\nHandbook of Franz Brentano and the Brentano School</em>, London and\nNew York: Routledge, pp. 313–322.",
                "Reicher, Maria E., 2006, “Austrian Aesthetics”, in\nMark Textor (ed.), <i>Austrian Philosophy and Analytic\nPhilosophy</i>. London: Routledge, 293–323.",
                "–––, 2009, “Value Facts and Value\nExperiences in Early Phenomenology”, in Beatrice Centi and\nWolfgang Huemer (eds.), <i>Values and Ontology: Problems and\nPerspectives</i>. Frankfurt: Ontos, 105–135.",
                "–––, 2017, “Ehrenfels and Brentano”,\nin Kriegel, Uriah (ed.), <em>The Routledge Handbook of Franz Brentano\nand the Brentano School</em>, London and New York: Routledge,\npp. 283–292.",
                "Rollinger, Robin D., 2008, <i>Austrian Phenomenology: Brentano,\nHusserl, Meinong, and Others on Mind and Object</i>. Frankfurt:\nOntos.",
                "Simons, Peter, 1986, “Mathematik als Wissenschaft der\nGestalten”, in in Fabian 1986, 112–135.",
                "–––, 1988, “Einleitung”, in\nR. Fabian (ed.) 1988, 1–12.",
                "Smith, Barry (ed.), 1988, <i>Foundations of Gestalt\n Theory</i>. Munich and Vienna: Philosophia.",
                "–––, 1994, <i>Austrian Philosophy: The Legacy of\nFranz Brentano</i>. Chicago and Lasalle, IL: Open Court.",
                "Valent, Jutta, 2016, “Christian von Ehrenfels. Eine\nIntellektuelle Biographie: Neue Forschungsergebnisse Aus Dem\nNachlass”, in David, Marian and Antonelli, Mauro\n(eds.), <em>Existence, Fiction, Assumption: Meinongian Themes and the\nHistory of Austrian Philosophy</em>. De Gruyter,\npp. 175–206.",
                "Weinhandl, Ferdinand (ed.), 1960, <i>Gestalthaftes\nSehen. Ergebnisse und Aufgaben der Morphologie. Zum\nhundertjährigen Geburtstag von Christian von\nEhrenfels</i>. Darmstadt: Wissenschaftliche Buchgesellschaft.",
                "Zimmer, Alfred, 2001, “Christian von Ehrenfels”, in\nAlbertazzi et al. 2001, 135–143.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<h3><a id=\"PriLit\">Primary Literature</a></h3>\n<h4>Works by Ehrenfels</h4>\n<ul class=\"hanging\">\n<li>von Ehrenfels, Christian, 1885, <i>Größenrelationen und\nZahlen: eine psychologische Studie</i> (dissertation), Carlo Ierna\n(ed.)  in Jutta Valent and Ulf Höfer (eds.) <em>Christian von\nEhrenfels: Philosophie – Gestalttheorie – Kunst:\nÖsterreichische Ideengeschichte Im Fin de Siècle</em>,\nBerlin: De Gruyter, pp. 185–234, 2017.</li>\n<li>–––, 1887, <i>Über Fühlen und\nWollen. Eine psychologische Studie</i>. Vienna: Kaiserliche Akademie\nder Wissenschaften. (Reprint in Fabian 1988: 15–97.)\n[<a href=\"https://archive.org/details/ueberfhlenundwo00ehregoog\" target=\"other\">available online</a>]</li>\n<li>–––, 1890, “Über\n‘Gestaltqualitäten’”, <i>Vierteljahrsschrift\nfür wissenschaftliche Philosophie</i>, 14: 249–292. (Reprint\nin Fabian 1988: 128–155.)\n[<a href=\"http://gallica.bnf.fr/ark:/12148/bpt6k94141n/f254.image\" target=\"other\">available online</a>]</li>\n<li>–––, 1891, “Zur Philosophie der\nMathematik”, <i>Vierteljahrsschrift für wissenschaftliche\nPhilosophie</i>, 15: 285–347. (Reprint in Fabian 1988:\n415–451.)\n[<a href=\"http://gallica.bnf.fr/ark:/12148/bpt6k941420/f290.image\" target=\"other\">available online</a>]</li>\n<li>–––, 1893, “Werttheorie und\nEthik”, <i>Vierteljahrsschrift für wissenschaftliche\nPhilosophie</i>, 17: 76–110, 200–266, 321–363,\n413–475. (Reprint in Fabian 1982: 23–151.)\n[<a href=\"http://gallica.bnf.fr/ark:/12148/bpt6k94144p/f83.image\" target=\"other\">available online</a>]</li>\n<li>–––, 1894, “Werttheorie und\nEthik”, <i>Vierteljahrsschrift für wissenschaftliche\nPhilosophie</i>, 18: 77–97. (Reprint in Fabian 1982:\n151–166.)\n[<a href=\"http://gallica.bnf.fr/ark:/12148/bpt6k941451/f82.image\" target=\"other\">available online</a>]</li>\n<li>–––, 1897, <i>System der Werttheorie, I:\nAllgemeine Werttheorie, Psychologie des Begehrens</i>. Leipzig:\nO. R. Reisland. (Reprint in Fabian 1982: 201–406.)\n[<a href=\"https://archive.org/details/systemderwertth00ehregoog\" target=\"other\">available online</a>]</li>\n<li>–––, 1898, <i>System der Werttheorie, II:\nGrundzüge einer Ethik, Psychologie des Begehrens</i>. Leipzig:\nO. R. Reisland. (Reprint in Fabian 1982: 407–593.)\n[<a href=\"https://archive.org/details/systemderwertth01ehregoog\" target=\"other\">available online</a>]</li>\n<li>–––, 1907, <i>Sexualethik</i>. Wiesbaden:\nBergman. [<a href=\"https://archive.org/details/sexualethik00ehregoog\" target=\"other\">available online</a>]</li>\n<li>–––, 1908, “Die gelbe\nGefahr”, <i>Sexual-Probleme</i>, 4: 185–205.</li>\n<li>–––, 1916, <i>Kosmogonie</i>. Jena:\nDietrichs. (Reprint in Fabian 1990: 69–230.)</li>\n<li>–––, 1922, <i>Das Primzahlengesetz, entwickelt\nund dargestellt auf Grund der Gestalttheorie</i>. Leipzig:\nReisland. (Reprint in Fabian 1988: 455–505.)</li>\n<li>–––, 1922, “Gedanken über die\nReligion der Zukunft” (in 8 articles), <i>Prager Presse</i>, 23\nApril, 7/14 May, 28 May, 4 June, 18 June, 2 July, 16 July, 27 August\n1922. (Reprinted in Fabian 1990: 231–280.)</li>\n<li>–––, 1932 (dictated), “Über\n‘Gestaltqualitäten’”, <i>Philosophia</i>\n(Belgrade), 2 (1937): 139–141. (Reprint in F. Weinhandl (ed.)\n1960: 61–63.)\n\n</li><li>–––, [PSI], <i>Philosophische Schriften,\nI. Werttheorie </i>, Munich and Vienna: Philosophia. (Reprints include\nEhrenfels 1897, Ehrenfels 1898.) Edited by Reinhard Fabian, 1982.</li>\n<li>–––, [PSII], <i>Philosophische Schriften,\nII. Ästhetik</i>, Munich and Vienna: Philosophia. Edited by\nReinhard Fabian, 1986.</li>\n<li>–––, [PSIII], <i>Philosophische Schriften,\nIII. Psychologie, Ethik, Erkenntnistheorie</i>, Munich and Vienna:\nPhilosophia. (Reprints include Ehrenfels 1887, Ehrenfels 1890.) Edited\nby Reinhard Fabian, 1988.</li>\n<li>–––, [PSIV], <i>Philosophische Schriften,\nIV. Metaphysik</i>, Reinhard Fabian (ed.), Munich and Vienna:\nPhilosophia, 1990.</li>\n</ul>\n<h4>Translations of Works by Ehrenfels</h4>\n<ul class=\"hanging\">\n<li><i>Cosmogony</i>, translation of Ehrenfels 1916, Mildred Focht\n(trans.), New York: Comet Press, 1948.</li>\n<li>“On ‘Gestalt Qualities’”, translation of\nEhrenfels 1890, Barry Smith (trans.), in B. Smith (ed.) 1988:\n82–117.</li>\n<li>“Gestalt Level and Purity”, translation of\npp. 93–96 in Ehrenfels 1916, Barry Smith (trans.), in Smith\n(ed.) 1988: 118–120,\n <a href=\"http://ontology.buffalo.edu/smith/book/FoGT/Ehrenfels_Purity.pdf\" target=\"other\">available online</a>.</li>\n<li>“On ‘Gestalt Qualities’, translation of\nEhrenfels 1932, Mildred Focht (trans.), revised and corrected by Barry\nSmith, in Smith (ed.) 1988: 121–123,\n <a href=\"http://ontology.buffalo.edu/smith/book/FoGT/Ehrenfels_Gestalt_1932.pdf\" target=\"other\">available online</a>.</li>\n</ul>\n<h4>Primary Works by Other Philosophers</h4>\n<ul class=\"hanging\">\n<li>Brentano, Franz, 1874, <i>Psychologie vom empirischen\nStandpunkte</i> I. Leipzig: Duncker &amp; Humblot.\n [<a href=\"https://archive.org/details/psychologievome00kraugoog\" target=\"other\">available online</a>]</li>\n<li>–––, 1889, <i>Vom Ursprung sittlicher\nErkenntnis</i>. Leipzig: Duncker &amp; Humblot.\n [<a href=\"https://archive.org/details/vomursprungsitt00brengoog\" target=\"other\">available online</a>]</li>\n<li>–––, 1995, <i>Psychology from an\nEmpirical Standpoint</i>. London: Routledge. (Translated by\nAntos. C. Rancurello et al.)</li>\n<li>Husserl, Edmund, 1887, <i>Über den Begriff der\nZahl. Psychologische Analysen</i>. Halle: Heynemann’sche\nBuchdruckerei (F. Beyer).\n [<a href=\"http://www.freidok.uni-freiburg.de/volltexte/5870/\" target=\"other\">available online</a>]</li>\n<li>–––, 1891, <i>Philosophie der\nArithmetik. Psychologische und Logische Untersuchungen</i>,\nHalle-Saale: C.E.M. Pfeffer (Robert Stricker).\n [<a href=\"http://www.freidok.uni-freiburg.de/volltexte/6159/\" target=\"other\">available online</a>]</li>\n<li>–––, 1901, <i>Logische Untersuchungen. Zweiter\nTheil, Untersuchungen zur Phänomenologie und Theorie der\nErkenntnis</i>. Halle: Niemeyer.\n [<a href=\"http://www.freidok.uni-freiburg.de/volltexte/6020/\" target=\"other\">available online</a>]</li>\n<li>–––, 1889/1890, “Lecture on the Concept of\nNumber (WS 1889/1890)”, in Ierna, Carlo (ed.), <i>The New\nYearbook for Phenomenology and Phenomenological Philosophy</i>,\n5 (2005): 278–309. (Translated by Ierna Carlo.)\n[<a href=\"http://essential.metapress.com/content/y07w660702l20467/\" target=\"other\">available online</a>]</li>\n<li>Kindinger, Rudolf (ed.), 1965, <i>Philosophenbriefe aus der\nwissenschaftlichen Korrespondenz von Alexius Meinong</i>. Graz:\nAkademische Druck- und Verlagsanstalt.</li>\n<li>Mach, Ernst, 1886, <i>Beiträge zur Analyse der\nEmpfindungen</i>. Jena: Gustav Fischer.\n [<a href=\"https://archive.org/details/beitrgezuranaly00machgoog\" target=\"other\">available online</a>]</li>\n<li>–––, 1914, <i>The Analysis of Sensations</i>. \nChicago: Open Court. (Translation by C. M. Williams of Mach 1886.)\n[<a href=\"https://archive.org/details/contributionsto00machgoog\" target=\"other\">available online</a>]</li>\n<li>Meinong, Alexius, 1882, “Hume Studien II. Zur\nRelationstheorie” in <i>Sitzungsberichte der\nphilosophisch-historischen Klasse der Kaiserlichen Akademie der\nWissenschaften in Wien</i>, Band 101, Vienna, 573–752.\n [<a href=\"https://archive.org/stream/sitzungsbericht101stuoft\" target=\"other\">available online</a>]</li>\n<li>–––, 1891, “Zur Psychologie der\nKomplexionen und Relationen” in <i>Zeitschrift für\nPsychologie und Physiologie der Sinnesorgane</i> II: 245–265. \n[<a href=\"http://vlp.mpiwg-berlin.mpg.de/references?id=lit14340&amp;page=p0245\" target=\"other\">available online</a>]</li>\n<li>–––, 1894, <i>Psychologisch-ethische\nUntersuchungen zur Werth-Theorie</i>. Graz: Leuschner &amp; Lubensky.\n [<a href=\"https://archive.org/details/psychologischet02meingoog\" target=\"other\">available online</a>]</li>\n<li>Menger, Carl, 1871, <i>Grundsätze der\nVolkswirtschaftslehre</i>, Vienna: Wilhelm\nBraumüller. [<a href=\"http://www.mises.de/public_home/article/63\" target=\"other\">available online</a>]</li>\n<li>Stumpf, Carl, 1883, <i>Tonpsychologie</i>. Vol. 1. Leipzig: Hirzel.\n [<a href=\"https://archive.org/details/tonpsychologie01stumgoog\" target=\"other\">available online</a>]</li>\n<li>–––,\n1890, <i>Tonpsychologie</i>. Vol. 2. Leipzig: Hirzel.\n [<a href=\"https://archive.org/details/tonpsychologie00stumgoog\" target=\"other\">available online</a>]</li>\n<li>Urban, Wilbur Marshall, 1909, <i>Valuation: Its Nature and its\nLaws</i>. London: Swan Sonnenschein &amp; Co.\n [<a href=\"https://archive.org/details/valuationitsnat00urbagoog\" target=\"other\">available online</a>]</li>\n<li>Wieser, Friedrich von, 1889, <i>Der natürliche\nWerth</i>. Vienna: Alfred Hölder.\n [<a href=\"https://archive.org/details/dernatrlichewer00wiesgoog\" target=\"other\">available online</a>]</li>\n</ul>\n<h3><a id=\"SecLit\">Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Albertazzi, Liliana, Massimo Libardi, and Roberto Poli (eds.),\n1996, <i>The School of Franz Brentano</i>. Dordrecht: Kluwer.</li>\n<li>Albertazzi, Liliana, Dale Jacquette, and Roberto Poli (eds.),\n2001, <i>The School of Alexius Meinong</i>. Aldershot: Ashgate.</li>\n<li>Ash, Mitchell G., 1995, <i>Gestalt Psychology in German Culture\n1890–1967: Holism and the Quest for Objectivity</i>. Cambridge:\nCambridge University Press.</li>\n<li>Dickinson, Edward, 2002, “Sex and the ‘Yellow\nPeril’: Christian von Ehrenfels’ Program for the Revision\nof the European Sexual Order, 1902–1910” in <i>German\nStudies Review</i>, 25(2): 255–284.\n [<a href=\"http://www.jstor.org/stable/1432992\" target=\"other\">available online</a>]</li>\n<li>Dölling, Evelyn, 1999, <i>“Wahrheit suchen und Wahrheit\nbekennen.” Alexius Meinong: Skizze seines Lebens</i>. Amsterdam\nand Atlanta: Rodopi.</li>\n<li>Eaton, Howard O., 1930, <i>The Austrian Philosophy of\nValues</i>. Norman: Oklahoma University Press.</li>\n<li>Fabian, Reinhard (ed.), 1986, <i>Christian von Ehrenfels: Leben\nund Werk</i>. Amsterdam and Atlanta: Rodopi.</li>\n<li>–––, 1996, “Christian von Ehrenfels\n1859–1932”, in Albertazzi et al., 161–174.</li>\n<li>Fréchette, Guillaume, 2017, “Bergman and\nBrentano”, in Kriegel, Uriah (ed.), <em>The Routledge Handbook\nof Franz Brentano and the Brentano School</em>, London and New York:\nRoutledge, pp. 323–333.</li>\n<li>Grassl, Wolfgang, and Smith, Barry (eds.), 1986, <i>Austrian\nEconomics: Historical and Philosophical Background</i>. London and\nSydney: Croom Helm.</li>\n<li>Höfer, Ulf, 2017,\n“Ehrenfels, Wagner und der Gestaltbegriff”, in Valent,\nJutta and Höfer, Ulf (eds.), <em>Christian von Ehrenfels:\nPhilosophie – Gestalttheorie – Kunst: Österreichische\nIdeengeschichte Im Fin de Siècle,</em> De Gruyter, pp.\n21–52.</li>\n<li>Ierna, Carlo, 2009, “Husserl et Stumpf sur la Gestalt et la\nfusion”, in <i>Philosophiques</i>, 36(2):\n489–510. [<a href=\"http://id.erudit.org/iderudit/039482ar\" target=\"other\">available online</a>]</li>\n<li>–––, 2011, “Brentano and\nMathematics”, in <i>Revue Roumaine de Philosophie</i>, 55(1):\n149–167.</li>\n<li>–––, 2017a, “On Ehrenfels’\nDissertation”, in Valent, Jutta and Höfer, Ulf\n(eds.), <em>Christian von Ehrenfels: Philosophie –\nGestalttheorie – Kunst: Österreichische Ideengeschichte Im\nFin de Siècle</em>, De Gruyter, pp. 163–184.</li>\n<li>–––, 2017b, “Die Gestalten und das\nGestalten der Welt”, in Valent, Jutta and Höfer, Ulf\n(eds.), <em>Christian von Ehrenfels: Philosophie –\nGestalttheorie – Kunst: Österreichische Ideengeschichte Im\nFin de Siècle</em>, De Gruyter, pp.  53–68.</li>\n<li>Janoušek, Hynek and Rollinger, Robin, 2017, “The\nPrague School”, in Kriegel, Uriah (ed.), <em>The Routledge\nHandbook of Franz Brentano and the Brentano School</em>, London and\nNew York: Routledge, pp.  313–322.</li>\n<li>Reicher, Maria E., 2006, “Austrian Aesthetics”, in\nMark Textor (ed.), <i>Austrian Philosophy and Analytic\nPhilosophy</i>. London: Routledge, 293–323.</li>\n<li>–––, 2009, “Value Facts and Value\nExperiences in Early Phenomenology”, in Beatrice Centi and\nWolfgang Huemer (eds.), <i>Values and Ontology: Problems and\nPerspectives</i>. Frankfurt: Ontos, 105–135.</li>\n<li>–––, 2017, “Ehrenfels and Brentano”,\nin Kriegel, Uriah (ed.), <em>The Routledge Handbook of Franz Brentano\nand the Brentano School</em>, London and New York: Routledge,\npp. 283–292.</li>\n<li>Rollinger, Robin D., 2008, <i>Austrian Phenomenology: Brentano,\nHusserl, Meinong, and Others on Mind and Object</i>. Frankfurt:\nOntos.</li>\n<li>Simons, Peter, 1986, “Mathematik als Wissenschaft der\nGestalten”, in in Fabian 1986, 112–135.</li>\n<li>–––, 1988, “Einleitung”, in\nR. Fabian (ed.) 1988, 1–12.</li>\n<li>Smith, Barry (ed.), 1988, <i>Foundations of Gestalt\n Theory</i>. Munich and Vienna: Philosophia.</li>\n<li>–––, 1994, <i>Austrian Philosophy: The Legacy of\nFranz Brentano</i>. Chicago and Lasalle, IL: Open Court.</li>\n<li>Valent, Jutta, 2016, “Christian von Ehrenfels. Eine\nIntellektuelle Biographie: Neue Forschungsergebnisse Aus Dem\nNachlass”, in David, Marian and Antonelli, Mauro\n(eds.), <em>Existence, Fiction, Assumption: Meinongian Themes and the\nHistory of Austrian Philosophy</em>. De Gruyter,\npp. 175–206.</li>\n<li>Weinhandl, Ferdinand (ed.), 1960, <i>Gestalthaftes\nSehen. Ergebnisse und Aufgaben der Morphologie. Zum\nhundertjährigen Geburtstag von Christian von\nEhrenfels</i>. Darmstadt: Wissenschaftliche Buchgesellschaft.</li>\n<li>Zimmer, Alfred, 2001, “Christian von Ehrenfels”, in\nAlbertazzi et al. 2001, 135–143.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Brentano, Franz",
            "Husserl, Edmund",
            "intentionality",
            "Mach, Ernst",
            "Meinong, Alexius",
            "Stumpf, Carl",
            "value theory"
        ],
        "entry_link": [
            {
                "../brentano/": "Brentano, Franz"
            },
            {
                "../husserl/": "Husserl, Edmund"
            },
            {
                "../intentionality/": "intentionality"
            },
            {
                "../ernst-mach/": "Mach, Ernst"
            },
            {
                "../meinong/": "Meinong, Alexius"
            },
            {
                "../stumpf/": "Stumpf, Carl"
            },
            {
                "../value-theory/": "value theory"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ehrenfels\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/ehrenfels/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=ehrenfels&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/ehrenfels/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ehrenfels": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/ehrenfels/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=ehrenfels&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/ehrenfels/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://gams.uni-graz.at/archive/objects/context:bag/methods/sdef:Context/get?mode=generation1-ehrenfels\" target=\"other\">Ehrenfels’ page</a>,\n at the Franz Brentano Archiv Graz, in German.",
            "<a href=\"http://www.zeno.org/nid/20001820338\" target=\"other\">Ehrenfels</a>,\n entry in Rudolf Eisler, Philosophen–Lexikon, Berlin: Mittler, 1912."
        ],
        "listed_links": [
            {
                "http://gams.uni-graz.at/archive/objects/context:bag/methods/sdef:Context/get?mode=generation1-ehrenfels": "Ehrenfels’ page"
            },
            {
                "http://www.zeno.org/nid/20001820338": "Ehrenfels"
            }
        ]
    }
}