{
    "url": "epistemology-evolutionary",
    "title": "Evolutionary Epistemology",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Michael Bradie\n<mbradie@bgsu.edu>\nWilliam Harms\n<wharms@uw.edu>",
        "author_links": [
            {
                "http://www.bgsu.edu/departments/phil/faculty/page26741.html": "Michael Bradie"
            },
            {
                "mailto:mbradie%40bgsu%2eedu": "mbradie@bgsu.edu"
            },
            {
                "mailto:wharms%40uw%2eedu": "wharms@uw.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"http://www.bgsu.edu/departments/phil/faculty/page26741.html\" target=\"other\">Michael Bradie</a>\n&lt;<a href=\"mailto:mbradie%40bgsu%2eedu\"><em>mbradie<abbr title=\" at \">@</abbr>bgsu<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nWilliam Harms\n&lt;<a href=\"mailto:wharms%40uw%2eedu\"><em>wharms<abbr title=\" at \">@</abbr>uw<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Jan 11, 2001",
        "substantive revision Tue Jan 21, 2020"
    ],
    "preamble": "\n\nEvolutionary Epistemology is a naturalistic approach to epistemology\nwhich emphasizes the importance of natural selection in two primary\nroles. In the first role, selection is the generator and maintainer of\nthe reliability of our senses and cognitive mechanisms, as well as the\n“fit” between those mechanisms and the world. In the\nsecond role, trial and error learning and the evolution of scientific\ntheories are construed as selection processes. \n",
    "toc": [
        {
            "#HistProbIssu": "1. History, Problems, and Issues"
        },
        {
            "#EvolEpisMechEEMVersEvolEpisTheoEET": "1.1 The Evolution of Epistemological Mechanisms (EEM) versus The Evolutionary Epistemology of Theories (EET)"
        },
        {
            "#OntoVersPhyl": "1.2 Ontogeny versus Phylogeny"
        },
        {
            "#DescVersPresAppr": "1.3 Descriptive versus Prescriptive Approaches"
        },
        {
            "#FutuPros": "1.4 Future Prospects"
        },
        {
            "#ExpaCirc": "1.5 Expanding the Circle"
        },
        {
            "#FormMode": "2. Formal Models"
        },
        {
            "#StatOptiMode": "2.1 Static Optimization Models"
        },
        {
            "#PopuDyna": "2.2 Population Dynamics"
        },
        {
            "#MultLeveEvol": "2.3 Multi-Level Evolution"
        },
        {
            "#Mean": "2.4 Meaning"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. History, Problems, and Issues\n\nTraditional epistemology has its roots in Plato and the ancient\nskeptics. One strand emerges from Plato’s interest in the\nproblem of distinguishing between knowledge and true belief. His\nsolution was to suggest that knowledge differs from true belief in\nbeing justified. Ancient skeptics complained that all attempts to\nprovide any such justification were hopelessly flawed. Another strand\nemerges from the attempt to provide a reconstruction of human\nknowledge showing how the pieces of human knowledge fit together in a\nstructure of mutual support. This project got its modern stamp from\nDescartes and comes in empiricist as well as rationalist versions\nwhich in turn can be given either a foundational or coherentist twist.\nThe two strands are woven together by a common theme. The bonds that\nhold the reconstruction of human knowledge together are the\njustificational and evidential relations which enable us to\ndistinguish knowledge from true belief. \n\nThe traditional approach is predicated on the assumption that\nepistemological questions have to be answered in ways which do not\npresuppose any particular knowledge. The argument is that any such\nappeal would obviously be question begging. Such approaches may be\nappropriately labeled “transcendental.”\n\nThe Darwinian revolution of the nineteenth century suggested an\nalternative approach first explored by Dewey and the pragmatists.\nHuman beings, as the products of evolutionary development, are natural\nbeings. Their capacities for knowledge and belief are also the\nproducts of a natural evolutionary development. As such, there is some\nreason to suspect that knowing, as a natural activity, could and\nshould be treated and analyzed along lines compatible with its status,\ni.e., by the methods of natural science. On this view, there is no\nsharp division of labor between science and epistemology. In\nparticular, the results of particular sciences such as evolutionary\nbiology and psychology are not ruled a priori irrelevant to\nthe solution of epistemological problems. Such approaches, in general,\nare called naturalistic epistemologies, whether they are directly\nmotivated by evolutionary considerations or not. Those which are\ndirectly motivated by evolutionary considerations and which argue that\nthe growth of knowledge follows the pattern of evolution in biology\nare called “evolutionary epistemologies.”\n\nEvolutionary epistemology is the attempt to address questions in the\ntheory of knowledge from an evolutionary point of view. Evolutionary\nepistemology involves, in part, deploying models and metaphors drawn\nfrom evolutionary biology in the attempt to characterize and resolve\nissues arising in epistemology and conceptual change. As disciplines\nco-evolve, models are traded back and forth. Thus, evolutionary\nepistemology also involves attempts to understand how biological\nevolution proceeds by interpreting it through models drawn from our\nunderstanding of conceptual change and the development of theories.\nThe term “evolutionary epistemology” was coined by Donald\nCampbell (1974a).\n1.1 The Evolution of Epistemological Mechanisms (EEM) versus The Evolutionary Epistemology of Theories (EET)\n\nThere are two interrelated but distinct programs which go by the name\n“evolutionary epistemology.” One focuses on the\ndevelopment of cognitive mechanisms in animals and humans. This\ninvolves a straightforward extension of the biological theory of\nevolution to those aspects or traits of animals which are the\nbiological substrates of cognitive activity, e.g., their brains,\nsensory systems, motor systems, etc. The other program attempts to\naccount for the evolution of ideas, scientific theories, epistemic\nnorms and culture in general by using models and metaphors drawn from\nevolutionary biology. Both programs have their roots in 19th century\nbiology and social philosophy, in the work of Darwin, Spencer, James\nand others. There have been a number of attempts in the intervening\nyears to develop the programs in detail (see Campbell 1974a, Bradie\n1986, Cziko 1995). Much of the contemporary work in evolutionary\nepistemology derives from the work of Konrad Lorenz (1977), Donald\nCampbell (1974a, et al.), Karl Popper (1972, 1984) and Stephen Toulmin\n(1967, 1972). \n\nThe two programs have been labeled EEM and EET (Bradie, 1986). EEM is\nthe label for the program which attempts to provide an evolutionary\naccount of the development of cognitive structures. EET is the label\nfor the program which attempts to analyze the development of human\nknowledge and epistemological norms by appealing to relevant\nbiological considerations. Some of these attempts involve analyzing\nthe growth of human knowledge in terms of selectionist models and\nmetaphors (e.g., Popper 1972, Toulmin 1972, Hull 1988; see Renzi and\nNapolitano 2011 for a critique of these efforts). Others argue for a\nbiological grounding of epistemological norms and methodologies but\neschew selectionist models of the growth of human knowledge\nas such (e.g., Ruse 1986, Rescher 1990).\n\nThe EEM and EET programs are interconnected but distinct. A successful\nEEM selectionist explanation of the development of cognitive brain\nstructures provides no warrant, in itself, for extrapolating such\nmodels to understand the development of human knowledge systems.\nSimilarly, endorsing an EET selectionist account of how human\nknowledge systems grow does not, in itself, warrant concluding that\nspecific or general brain structures involved in cognition are the\nresult of natural selection for enhanced cognitive capacities. The two\nprograms, though similar in design and drawing upon the same models\nand metaphors, do not stand or fall together.\n1.2 Ontogeny versus Phylogeny\n\nBiological development involves both ontogenetic and phylogenetic\nconsiderations. Thus, the development of specific traits, such as the\nopposable thumb in humans, can be viewed both from the point of view\nof the development of that trait in individual organisms (ontogeny)\nand the development of that trait in the human lineage (phylogeny).\nThe development of knowledge and knowing mechanisms exhibits a\nparallel distinction. We can consider the growth of an\nindividual’s corpus of knowledge and epistemological norms or of\nan individual’s brain (ontogeny), or the growth of human\nknowledge and establishment of epistemological norms across\ngenerations or the development of brains in the human lineage\n(phylogeny). The EEM/EET distinction cuts across this distinction\nsince we may be concerned either with the ontogenetic or phylogenetic\ndevelopment of, e.g., the brain or the ontogenetic or phylogenetic\ndevelopment of norms and knowledge corpora. One might expect that\nsince current orthodoxy maintains that biological processes of\nontogenesis proceed differently from the selectionist processes of\nphylogenesis, evolutionary epistemologies would reflect this\ndifference. Curiously enough, however, for the most part they do not.\nFor example, the theory of “neural Darwinism” as put forth\nby Edelman (1987) and Changeaux (1985) offers a selectionist account\nof the ontogenetic development of the neural structures of the brain.\nKarl Popper’s conjectures and refutations model of the\ndevelopment of human knowledge is a well known example of a\nselectionist account which has been applied both to the ontogenetic\ngrowth of knowledge in individuals as well as the trans-generational\n(phylogenetic) evolution of scientific knowledge. B. F.\nSkinner’s theory of operant conditioning, which deals with the\nontogenesis of individual behavior, is explicitly based upon the\nDarwinian selectionist model (Skinner 1981).\n1.3 Descriptive versus Prescriptive Approaches\n\nA third distinction concerns descriptive versus prescriptive\napproaches to epistemology and the growth of human knowledge.\nTraditionally, epistemology has been construed as a normative project\nwhose aim is to clarify and defend conceptions of knowledge,\nfoundations, evidential warrant and justification. Many have argued\nthat neither the EEM programs nor the EET programs have anything at\nall to do with epistemology properly (i.e., traditionally) understood.\nThe basis for this contention is that epistemology, properly\nunderstood, is a normative discipline, whereas the EEM and EET\nprograms are concerned with the construction of causal and genetic\n(i.e., descriptive) models of the evolution of cognitive capacities or\nknowledge systems. No such models, it is alleged, can have anything\nimportant to contribute to normative epistemology (e.g., Kim 1988).\nThe force of this complaint depends upon how one construes the\nrelationship between evolutionary epistemology and the tradition. \n\nThere are three possible configurations of the relationship between\ndescriptive and traditional epistemologies. (1) Descriptive\nepistemologies can be construed as competitors to traditional\nnormative epistemologies. On this view, both are trying to address the\nsame concerns and offering competing solutions. Riedl (1984) defends\nthis position. A standard objection to such approaches is that\ndescriptive accounts are not adequate to do justice to the\nprescriptive elements of normative methodologies. The extent to which\nan evolutionary approach contributes to the resolution of traditional\nepistemological and philosophical problems is a function of which\napproach one adopts (cf. Dretske 1971, Bradie 1986, Ruse 1986,\nRadnitsky and Bartley 1987, Kim 1988). (2) Descriptive epistemology\nmight be seen as a successor discipline to traditional epistemology.\nOn this reading, descriptive epistemology does not address the\nquestions of traditional epistemology because it deems them irrelevant\nor unanswerable or uninteresting. Many defenders of naturalized\nepistemologies fall into this camp (e.g., Munz 1993). (3) Descriptive\nepistemology might be seen as complementary to traditional\nepistemology. This appears to be Campbell’s view. On this\nanalysis, the function of the evolutionary approach is to provide a\ndescriptive account of knowing mechanisms while leaving the\nprescriptive aspects of epistemology to more traditional approaches.\nAt best, the evolutionary analyses serve to rule out normative\napproaches which are either implausible or inconsistent with an\nevolutionary origin of human understanding.\n1.4 Future Prospects\n\nEEM programs are saddled with the typical uncertainties of\nphylogenetic reconstructions. Is this or that organ or structure an\nadaptation and if so, for what? In addition, there are the\nuncertainties which result from the necessarily sparse fossil record\nof brain and sensory organ development. The EET programs are even more\nproblematic. While it is plausible enough to think that the\nevolutionary imprint on our organs of thought influences what and how\nwe do think, it is not at all clear that the influence is direct,\nsignificant or detectible. Selectionist epistemologies which endorse a\n“trial and error” methodology as an appropriate model for\nunderstanding scientific change are not analytic consequences of\naccepting that the brain and other ancillary organs are adaptations\nwhich have evolved primarily under the influence of natural selection.\nThe viability of such selectionist models is an empirical question\nwhich rests on the development of adequate models. Hull’s (1988)\nis, as he himself admits, but the first step in that direction. Cziko\n(1995) is a manifesto urging the development of such models (cf. also\nthe evolutionary game theory modeling approach of Harms 1997). Much\nhard empirical work needs to be done to sustain this line of research.\nNon-selectionist evolutionary epistemologies, along the lines of Ruse\n(1986), face a different range of difficulties. It remains to be shown\nthat any biological considerations are sufficiently restrictive to\nnarrow down the range of potential methodologies in any meaningful\nway. A non-selectionist approach to evolutionary epistemology, based\non “Poincaréan dynamics,” has been proposed by\nBarham (1990). An alternative approach, which exploits the fact that\norganisms and their environments co-evole as a result of dialectical\ninteractions between them, has led to the development of\n“non-adaptational” evolutionary epistemologies (Gontier et\nal. 2006). A critical review of the problems facing the development of\nthe naturalistic turn in evolutionary epistemology can be found in\nCallebaut and Stotz (1998).\n\nNevertheless, the emergence in the latter quarter of the twentieth\ncentury of serious efforts to provide an evolutionary account of human\nunderstanding has potentially radical consequences. The application of\nselectionist models to the development of human knowledge, for\nexample, creates an immediate tension. Standard traditional accounts\nof the emergence and growth of scientific knowledge see science as a\nprogressive enterprise which, under the appropriate conditions of\nrational and free inquiry, generates a body of knowledge which\nprogressively converges on the truth. Selectionist models of\nbiological evolution, on the other hand, are generally construed to be\nnon-progressive or, at most, locally so. Rather than generating\nconvergence, biological evolution produces diversity. Popper’s\nevolutionary epistemology attempts to embrace both but does so\nuneasily. Kuhn’s “scientific revolutions” account\ndraws tentatively upon a Darwinian model, but when criticized, Kuhn\nretreated (cf. Kuhn 1962, pp. 172f with Lakatos and Musgrave 1970, p.\n264). Toulmin (1972) is a noteworthy exception. On his account,\nconcepts of rationality are purely “local” and are\nthemselves subject to evolution. This, in turn, seems to entail the\nneed to abandon any sense of “goal directedness” in\nscientific inquiry. This is a radical consequence which few have\nembraced. Pursuing an evolutionary approach to epistemology raises\nfundamental questions about the concepts of knowledge, truth, realism,\njustification and rationality.\n1.5 Expanding the Circle\n\nAlthough Campbell and Popper both pointed to the continuity between\nthe evolution of human knowledge and the evolution of knowledge in\nnon-human organisms, much of the early work in evolutionary\nepistemology focused on the human condition. However, recent empirical\ninvestigations by psychologists, cognitive ethologists, cognitive\nneuroscientists and animal behaviorists have revealed that animals,\nboth primates and non-primates, have much more sophisticated cognitive\ncapacities than were previously suspected (Panksepp 1998, Heyes and\nHuber 2000, Rogers and Kaplan 2004, Lurz 2011, van Schaik 2010). From\nan evolutionary perspective this is not surprising given the shared\nevolutionary heritage that all animals share. Taking Darwin seriously\nmeans reconsidering and reassessing the nature of human knowledge in\nthe light of our increased awareness of the cogntive capabilities of\nthe members of other species. In addition, once a firm empirical basis\nof the scope and limits of animal cognitive capacities has been\nestablished we will be in a position to reassess our philosophical\nevaluations of the mental lives of animals and their epistemic and\nmoral status as well. Further field research promises to revolutionize\nour understanding of the sense in which human beings are one among the\nanimals.\n\nThe KLI Theory Lab of the Konrad Lorenz Institute publishes a journal\ndevoted to issues in evolutionary epistemology in addition to other\napplications of biological theory,\n Biological Theory: Integrating Development, Evolution and Cognition.\n2. Formal Models\n\nEvery scientific enterprise requires formal and semi-formal models\nwhich allow the quantitative characterization of its objects of study.\nThe attempt to transform the philosophical study of knowledge into a\nscientific discipline which approaches knowledge as a biological\nphenomenon is no different. Much of the evolutionary epistemology\nliterature has been concerned with how to conceive of knowledge as a\nnatural phenomenon, what difference this would make to our\nunderstanding of our place in the world, and with answering objections\nto the project. There are, as well, a number of more technical\nprojects which attempt to provide the theoretical tools necessary for\na naturalistic epistemology. \n2.1 Static Optimization Models\n\nIn the simplest sort of model, an organism has to deal with an\nenvironment that has two states, \\(S_1\\) and \\(S_2\\), and has two\npossible responses \\(R_1\\) and \\(R_2\\). We suppose that what the\norganism does in each state makes a difference to its fitness.\nFitnesses are usually written characterized by a matrix \\(W\\). \n\nThe individual elements of the matrix \\(W_{ij}\\) are the fitness\nconsequences of response \\(i\\) in state \\(j\\). So, for instance,\n\\(W_{21}\\) denotes the fitness consequences of \\(R_2\\) in \\(S_1\\). If\nwe let \\(W_{11}\\) and \\(W_{22}\\) equal one and \\(W_{12}\\) and\n\\(W_{21}\\) equal zero, then there is a clear evolutionary advantage to\nperforming \\(R_1\\) in \\(S_1\\) and \\(R_2\\) in \\(S_2\\).\n\nHowever, the organism must first detect the state of the environment,\nand detectors are not in general perfectly reliable. If the organism\nresponds automatically to the detector, we can use the probabilities\nof responses given states to characterize the reliability of the\ndetector. We write the probability of \\(R_1\\) given \\(S_1\\) as\n\\(\\Pr(R_1 \\mid S_1)\\). This allows us to calculate that responding to\nthe detector rather than always choosing \\(R_1\\) or \\(R_2\\) will be\nadvantageous just in case the following inequality holds (cf.\nGodfrey-Smith 1996): \n\\[\n\\frac{\\Pr(R_2 \\mid S_2)}{1-\\Pr(R_1 \\mid S_1)} \\gt \n\\frac{\\Pr(S_1)(W_{11}-W_{21})}{(1-\\Pr(S_1))(W_{22}-W_{12})}\n\\]\n\n\nThis simple model demonstrates that whether or not flexible responses\nare adaptive depends on the particular characteristics of the fitness\ndifferences that the responses make, the probability of the various\nstates of the environment, and the reliability of the detector. The\nparticular result is calculated assuming that detecting the\nenvironmental state and the flexible response system is free in\nevolutionary terms. More complete analyses would include the costs of\nthese factors.\n\nStatic optimization models like the one outlined above can be extended\nin several ways. Most obviously, the number of environmental states\nand organismic responses can be increased, but there are other\nmodifications that are more interesting. Signal detection theory, for\ninstance, models the detectors and cues in more detail. In one\nexample, a species of “sea moss” detects the presence of\npredatory sea slugs via a chemical cue. They respond by growing\nspines, which is costly. The cue in this case, the water-borne\nchemical, comes in a variety of concentrations, which indicate various\nlevels of danger. Signal detection theory allows us to calculate the\nbest threshold value of the detector for the growing of\nspines.\n\nStatic models depict evolutionary processes in terms of fitness costs\nand benefits. They are static in the sense that they model no actual\nprocess, but merely calculate the direction of change for different\nsituations. If fitness is high, a type will increase, if low it will\ndecrease. When fitnesses are equal, population proportions remain at\nstable equilibrium. Dynamic models typically employ the kinds of\ncalculations involved in static models to depict actual change over\ntime in population proportions. Instead of calculating whether change\nwill occur and in what direction, dynamic models follow change.\n2.2 Population Dynamics\n\nPopulation dynamics, sometimes referred to as “replicator\ndynamics”, offers a tractable way to model the evolution of\npopulations over time under the kinds of selective pressures that can\nbe characterized by static optimization models. This is often\nnecessary, since the dynamics of such populations are often difficult\nto predict purely on the basis of static considerations of payoff\ndifferences. The so-called “replicator dynamics” were\nnamed by Taylor and Jonker (1978) and generalized by Schuster and\nSigmund (1983) and Hofbauer and Sigmund (1988). They trace their\nsource back to the seminal work of R.A. Fisher in the 1920s and 30s.\nThe generalization covers evolutionary models used in population\ngenetics, evolutionary game theory, ecology, and the study of\nprebiotic evolution. The models can be implemented either\nmathematically or computationally, and can model either stepwise\n(discrete) or continuous evolutionary change. \n\nPopulation dynamics models the evolution of populations. A population\nis a collection of individuals, which are categorized according to\ntype. The types in genetics are genes, in evolutionary game theory,\nstrategies. The types of interest in epistemological models would be\ntypes of cognitive apparatuses, or cognitive strategies — ways\nof responding to environmental cues, ways of manipulating\nrepresentations, and so forth. Roughly, EEM models focus on the\ninherited and EET models focus on the learned. The evolution of the\npopulation consists in changes of the relative frequency of the\ndifferent types within the population. Selection, typified by\ndifferential reproductive success, is represented as follows. Each\ntype has a growth rate or “fitness”, designated by \\(w\\),\nand a frequency designated by \\(p\\). The frequency of type \\(i\\) at\nthe next generation \\(p'_i\\) is simply the old frequency multiplied by\nthe fitness and divided by the mean fitness of the population\n“\\(\\overline{w}\\)”. \n\\[p'_i = p_i \\cdot w_i \\frasl \\overline{w}\n\\]\n\n\nDivision by \\(\\overline{w}\\) has the effect of\n“normalizing” the frequencies, so that they add up to one\nafter each is multiplied by its fitness. It also makes evident that\nthe frequency of a type will increase just in case its fitness is\nhigher than the current population average. \nFitness\n\nFitnesses, which should be understood simply as the aggregation of\nprobable-growth factors that drive the dynamics of large populations,\nmay depend on a variety of factors. Fitness components differ from\nvariation components in that they affect population frequencies\nproportionally to those frequencies, that is to say, multiplicatively.\nFitness components in biological evolution include mortality and\nreproductive rate. In cultural evolution, they include transmission\nprobability and rejection probability. Within either sort of model,\nwhat matters is how fitnesses change as a result of other changing\nfactors within the model. In the simplest cases, fitnesses are fixed\nand the type with the highest fitness inevitably dominates the\npopulation. In more complex cases, fitnesses may depend on variable\nfactors like who one plays against, or the state of a variable\nenvironment. Most commonly, variable fitnesses are calculated using a\npayoff matrix like the one above. In general, to calculate the\nexpected fitness of a type, one multiplies the fitness a type would\nhave in each situation times the likelihood that individuals in the\npopulation will confront that situation and adds the resulting\nproducts.  \n\\[\nw_i = S_A \\Pr(A)\\cdot W_{iA}\n\\]\n\n\nwhere \\(W_{iA}\\) is type \\(i\\)’s fitness in situation \\(A\\).\nThis sort of calculation assumes that the effects of the various\nsituations are additive. More complex situations can be modeled, of\ncourse, but additive matrices are the standard. It should be noted,\nhowever, that matrix-driven evolution can exhibit quite complex\nbehavior. For instance, chaotic behavior is possible with as few as\nfour strategies (Skyrms 1992).\n\nSome relationships may be represented without a matrix. Boyd and\nRicherson (1985), for instance, were interested in a special kind of\nfrequency dependent transmission bias in culture, where being common\nconferred an advantage due to imitators “doing as the Romans\ndo.” In such a case, the operative fitness of the type is just\nthe fitness as calculated according to the usual factors, and then\nmodified as a function of the frequency of the type.\nContinuity and Computation\n\nThe conceptual bases of replicator dynamics are quite straightforward.\nGetting results typically requires one of two approaches. In order to\nprove more than rudimentary mathematical results, one typically needs\nto derive a continuous version of the dynamics. The basic form is \n\n\\[\ndp_i /dt = p(w_i - \\overline{w})\n\\]\n\n\nwith fitnesses calculated as usual. Mathematical approaches have been\nquite productive, though the bulk of theoretical results apply\nprimarily to population genetics. See Hofbauer and Sigmund (1988) for\na compendium of such results, as well as a reasonable graduate-level\nintroduction to the mathematical study of evolutionary processes. \n\nThe second approach is computational. With the increase in power of\npersonal computers, computational implementation of evolutionary\nmodels become increasingly attractive. They require only rudimentary\nprogramming skills, and are in general much more flexible in the\nassumptions they require. The general strategy is to create an array\nto hold population frequencies and fitnesses, and then a series of\nprocedures (or methods or functions) which\n\ncalculate fitnesses,\nupdate frequencies with the new fitnesses, and\nmanage interface details like outputting the new state of the\npopulation to a file or the screen.\n\n\nA loop then runs the routines in sequence, over and over again. Most\nmodelers are happy to put their source code on the internet, which is\nprobably the best place to find it. \nModeling Cultural Evolution\n\nPart of the difficulty in understanding cognitive behavior as the\nproduct of evolution is that there are at least three very different\nevolutionary processes involved. First, there is the biological\nevolution of cognitive and perceptual mechanisms via genetic\ninheritance. Second, there is the cultural evolution of languages and\nconcepts. Third, there is the trial-and-error learning process that\noccurs during an individual’s lifetime. Moreover, there is some\nreason to agree with Donald T. Campbell that understanding human\nknowledge fully will require understanding the interaction between\nthese processes. This requires that we be able to model both processes\nof biological and cultural evolution. There are by now a number of\nwell-established models of biological evolution. Cultural evolution\npresents more novelty. \n\nPerhaps the most popular attempt to understand cultural evolution is\nRichard Dawkins’ (1976) invention of the “meme.”\nDawkins observed that what lies at the heart of biological evolution\nis differential reproduction. Evolution in general was then the\ncompetitive dynamics of lineages of self-replicating entities. If\nculture was to evolve, on this view, there had to be cultural\n“replicators”, or entities whose differential replication\nin culture constituted the cultural evolutionary process. Dawkins\ndubbed these entities “memes”, and they were characterized\nas informational entities which infect our brains, “leaping from\nhead to head” via what we ordinarily call imitation. Common\nexamples include infectious tunes, and religious ideologies. The main\ndifficulty with this approach has been the problem of how to provide\nspecifications for the basic entities. The identity conditions of\ngenes can be given, in theory, in terms of sequences of base pairs in\nchromosomes. There appears to be no such fundamental\n“alphabet” for the items of cultural transmission.\nConsequently, the project of “memetics” as a contending\nbasis for evolutionary epistemology is on hold pending an adequate\nunderstanding of its basic ontology. The online\n Journal of Memetics\n contains some early papers on memetics. Although the journal has\nceased publication, the existing papers are still accessible online.\nSee Atran (2001) and Sperber (2001) for reservations about the\nviability of memetic models of cultural evolution. For a recent\ndefense of this approach, see Dennett (2017).\n\nPopulation models have been used to good effect in modeling cultural\ntransmission processes. Evolutionary game theory models are frequently\nclaimed to cover both processes in which strategies are inherited and\nthose in which they are imitated. This application is possible in the\nabsence of any specification of the underlying nature of strategies,\nfor instance, whether they are to be thought of as\n“things” which are replicated, or whether they are\nproperties or states of the individuals whose strategies they are.\nThis is sometimes referred to as the “epidemiological\napproach”, though again, the comparison to infection is due to\nthe quantitative tools used in analysis rather than to any\npresupposition regarding the underlying ontology of cultural\ntransmission (Sperber 1996, Sperber and Hirschfield 2004).\n\nSome recent work focuses on the capacities of organisms to modify\ntheir environments in ways that affect the selection pressures that\nthey face. In classical models of organism-environment interactions,\norganisms adapted to their environments by “fiting” into\npre-existing niches. Richard Lewontin’s dialectical model of\norganism-environment interactions emphasized the extent to which\norganisms “construct” niches rather than merely\naccommodating themselves to those already present in the environment\n(Lewontin 1982). There is now a large body of literature on niche\nconstruction (see inter alia Laland et al. 2000 and\nOdling-Smee et al. 2003) The application of this idea to issues in\nevolutionary epistemology takes the form of appeals to cultural niches\nand cognitive niches. Cultural niches are created by the capacity of\norganisms, in general, to the extent that having culture can be\nattributed to them, and human beings, in particular, to learn from one\nanother and from the constructed cultural modifications of their\nenvironments. For human beings, such constructions take the forms of,\namong others, language, educational institutions, communication\nsystems and other forms of information manipulation and transfer.\nCognitive niches are created by the capacities for constructing mental\nmodels of the environment that, in turn, enable organisms, especially\nhuman beings, during the course of their lifetimes to systematically\nand efficiently exploit the resources of their environments (Pinker\n2003, 2010; Whiten and Erdal 2012, Whiten and van Schaik 2007, Laland\nand O’Brien 2011)\n2.3 Multi-Level Evolution\n\nThe kind of levels involved in evolutionary epistemology are quite\ndifferent than the kind of levels of selection which are discussed\nmuch more often in the “levels of selection” debate in\nevolutionary biology. In evolutionary biology, the\n“levels” of selection under discussion are levels of\nscale. The debate concerns whether genes are always the\n“units” or “targets” of selection, or whether\nselection can occur on higher levels, like organisms, groups, and\nspecies. The levels involved in evolutionary epistemology, on the\nother hand, are levels of the regulatory hierarchy involved in the\ncontrol of behavior. These include the genetic bases of cognitive and\nperceptual hardware, concepts, languages, techniques, beliefs,\npreferences, and so forth. Note that in the case of evolutionary\nepistemology, the terms “levels” and\n“hierarchy” may be impressionistic. There is often no\nclear arrangement of levels at all. \n\nThere are at least two different approaches that have been taken to\nmodeling multi-level evolution.\n\nDual Transmission Models: Boyd and Richerson (1985) adapted models\nfrom genetics to model a case in which a trait (cooperation) was\naffected both by genetic and cultural evolution. It was first shown\nthat a genetically determined bias on cultural transmission could be\nselected for in a migratory population. The bias made it easier to\npick up local customs, increasing the likelihood of imitation beyond\nthat determined by the frequency and perceived value of the behavior.\nOnce this bias was in place, its effect was strong enough to overcome\nthe perceived costs involved in cooperative behavior. The model\nyielded two important results. First, it provided a novel mechanism\naccording to which cooperative behavior can stabilize in migratory\npopulations. But more importantly, it demonstrated that cultural\nevolution cannot be predicted purely on the basis of genetic\nfitnesses.\nMultiple Population Models: Harms (1997) constructed a multi-level\ndynamic population model of bumblebee learning. Mutual information\nbetween distributions of sensor types, overt foraging behaviors, and\ninternal foraging preferences, on the one hand, and environmental\nstates, on the other, was assessed and compared to average fitness of\nthe population states. It was shown that information present in overt\nbehaviors may be underutilized, and that exaptation of sensor\nmechanisms for preference formation can bring about the utilization of\nthat information.\n\n2.4 Meaning\n\nFull descriptive accounts of truth and justification both demand a\ntheory of meaning. Until a sign has meaning, it cannot be true or\nfalse. Moreover, determining the meaning of justificatory claims may\nprovide a descriptive theory of justification. Presumably, what makes\na claim of justification true is the basis of that justification. If\nmeaning is conventional, then the evolution of meaning becomes an\ninstance of the evolution of conventions. \n\nModels of the evolution of conventions have in one case been extended\nto apply to meaning conventions. Skyrms (1996, chapter 5) gave an\nevolutionary interpretation of David Lewis’ (1969) model\nof rational selection of meaning conventions. Skyrms was able to show\nthat there is strong selection on the formation of “signaling\nsystems” in mixed populations with a full set of coordinated,\ncountercoordinated, and uncoordinated strategies. It is significant\nthat the structure of the model and the selective process by which\nmeaning conventions emerge and are stabilized largely parallels the\naccount of the evolution of meaning given by Ruth Millikan (1984).\n\nIn the simplest version, the model is constructed as follows: We\nimagine that there are two states of affairs \\(T\\), two acts \\(A\\),\nand two signals \\(M\\). Players have an equal chance of being in either\nthe position of sender, or receiver. Receivers must decide what to do\nbased purely on what the sender tells them. In this purely cooperative\nversion, each player gets one point if the receiver does \\(A_1\\) if\nthe state is \\(T_1\\) or \\(A_2\\) if the state is \\(T_2\\).\n\nSince players will be both sender and receiver, they must have a\nstrategy for each situation. There are sixteen such strategies, and we\nsuppose them to be either inherited (or learned) from biological\nparents, or imitated on the basis of perceived success in terms of\npoints earned. Strategies \\(I_1\\) and \\(I_2\\) are signaling systems,\nin that if both players play the same one of these two strategies they\nwill always get their payoff. \\(I_3\\) and \\(I_4\\) are anti-signaling\nstrategies, which result in consistent miscoordination, though they do\nwell against each other. All of the other strategies involve \\(S_3,\nS_4, R_3\\), or \\(R_4\\), which results in the same act being performed\nno matter what the external state is.\n\n\n\nSender Strategies\n\n\\(S_1\\)\nSend \\(M_1\\) if \\(T_1\\); \\(M_2\\) if \\(T_2\\) \n\n\\(S_2\\)\nSend \\(M_2\\) if \\(T_1\\); \\(M_1\\) if \\(T_2\\) \n\n\\(S_3\\)\nSend \\(M_1\\) if \\(T_1\\) or \\(T_2\\) \n\n\\(S_4\\)\nSend \\(M_2\\) if \\(T_1\\) or \\(T_2\\) \n\n\n\n\n\nReceiver Strategies\n\n\\(R_1\\)\nDo \\(A_1\\) if \\(M_1\\); \\(A_2\\) if \\(M_2\\) \n\n\\(R_2\\)\nDo \\(A_2\\) if \\(M_1\\); \\(A_1\\) if \\(M_2\\) \n\n\\(R_3\\)\nDo \\(A_1\\) for \\(M_1\\) or \\(M_2\\) \n\n\\(R_4\\)\nDo \\(A_2\\) for \\(M_1\\) or \\(M_2\\) \n\n\n\n\nComplete\nStrategies\n\n\\(I_1\\):\n\\(S_1,R_1\\)\n     \n\\(I_9\\):\n\\(S_3,R_1\\) \n\n\\(I_2\\):\n\\(S_2,R_2\\)\n \n\\(I_{10}\\):\n\\(S_3,R_2\\) \n\n\\(I_3\\):\n\\(S_1,R_2\\)\n \n\\(I_{11}\\):\n\\(S_3,R_3\\) \n\n\\(I_4\\):\n\\(S_2,R_1\\)\n \n\\(I_{12}\\):\n\\(S_3,R_4\\) \n\n\\(I_5\\):\n\\(S_1,R_3\\)\n \n\\(I_{13}\\):\n\\(S_4,R_1\\) \n\n\\(I_6\\):\n\\(S_2,R_3\\)\n \n\\(I_{14}\\):\n\\(S_4,R_2\\) \n\n\\(I_7\\):\n\\(S_1,R_4\\)\n \n\\(I_{15}\\):\n\\(S_4,R_3\\) \n\n\\(I_8\\):\n\\(S_2,R_4\\)\n \n\\(I_{16}\\):\n\\(S_4,R_4\\) \n\n\nSimulation results showed that virtually all initial population\ndistributions become dominated by one or the other of the two\nsignaling system strategies. The situation becomes more complex when\nmore realistic payoffs are introduced, for instance, that the sender\nincurs a cost rather than automatically sharing the benefit that the\nreceiver gets from correct behavior for the environment. Even in such\nsituations, however, the most likely course of evolution is domination\nby a signaling system. \n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Atran, S., 2001, “The trouble with memes: inference versus\nimitation in cultural creation,” <em>Human Nature</em>,\n12(4):351–381.",
                "Barham, James, 1990, “A poincaréan approach to\nevolutionary epistemology,” <em>Journal of Social and Biological\nStructures</em>, 13(3): 193–258.",
                "Bradie, Michael, 1986, “Assessing Evolutionary\nEpistemology,” <em>Biology &amp; Philosophy</em>, 1:\n401–459.",
                "–––, 1989, “Evolutionary Epistemology as\nNaturalized Epistemology,” in <em>Issues in Evolutionary\nEpistemology</em>, K. Hahlweg and C. A. Hooker (eds.), Albany, NY:\nSUNY Press, pp. 393–412.",
                "–––, 1994, “Epistemology from an\nEvolutionary Point of View,” in <em>Conceptual Issues in\nEvolutionary Biology</em>, second edition, Elliott Sober (ed.),\nCambridge, MA: The MIT Press, pp. 453–475.",
                "Boyd, Robert, and Peter J. Richerson, 1985, <em>Culture and the\nEvolutionary Process</em>, Chicago: The University of Chicago\nPress.",
                "Callebaut, Werner, and Rik Pinxten (eds.), 1987, <em>Evolutionary\nEpistemology: A Multiparadigm Program With a Complete Evolutionary\nEpistemology Bibliography</em> (Synthese Library: Volume 190),\nDordrecht: D. Reidel.",
                "Callebaut, Werner, and Karola Stotz, 1998, “Lean\nEvolutionary Epistemology,” <em>Evolution and Cognition</em>,\n4(1): 11–36.",
                "Campbell, Donald T., 1956a, “Adaptive behavior from random\nresponse,” <em>Behavioral Science</em>, 1(2):\n105–110.",
                "–––, 1956b, “Perception as substitute\ntrial and error,” <em>Psychological Review</em>, 63(5):\n331–342.",
                "–––, 1959, “Methodological suggestions\nfrom a comparative psychology of knowledge processes,”\n<em>Inquiry</em>, 2: 152–182.",
                "–––, 1960, “Blind variation and selective\nretentions in creative thought as in other knowledge processes,”\n<em>Psychological Review</em>, 67(6): 380–400.",
                "–––, 1974a, “Evolutionary\nEpistemology,” in <em>The Philosophy of Karl R. Popper</em>, P.\nA. Schilpp (ed.), LaSalle, IL: Open Court, pp. 412–463.",
                "–––, 1974b, “Unjustified Variation and\nSelective Retention in Scientific Discovery,” in <em>Studies in\nthe Philosophy of Biology: Reduction and Related Problems</em>, edited\nby F J. Ayala and T. Dobzhansky, London: Macmillan, pp.\n139–161.",
                "–––, 1982, “The\n”blind-variation-and-selective-retention“ Theme,” in\n<em>The Cognitive Developmental Psychology of James Mark Baldwin:\nCurrent Theory and Research in Genetic Epistemology</em>, edited by J.\nM. Broughton and D. J. Freeman-Moir, Norwood, NJ: Ablex, pp.\n87–97.",
                "–––, 1985, “Pattern Matching as an\nEssential in Distal Knowing,” in <em>Naturalizing\nEpistemology</em>, edited by H. Kornblith, Cambridge, MA: MIT Press,\n49–70.",
                "–––, 1988, “Popper and selection\ntheory,” <em>Social Epistemology</em>, 2(4): 371–377.",
                "Campbell, Donald T., and Paller, Bonnie T., 1989, “Extending\nEvolutionary Epistemology to ‘Justifying’ Scientific\nBeliefs (A sociological rapprochement with a fallibilist perceptual\nfoundationalism?),” in <em>Issues in Evolutionary\nEpistemology</em>, K. Hahlweg and C. A. Hooker (eds.), Albany: State\nUniversity of New York Press, pp. 231–257. ",
                "Changeux, Jean-Pierre, 1985, <em>Neuronal Man</em>, New York:\nPantheon.",
                "Coleman, Martin, 2002, “Taking Simmel seriously in\nevolutionary epistemology,” <em>Studies in History and\nPhilosophy of Science</em>, 33A(1): 59–78.",
                "Cziko, G., 1995, <em>Without Miracles: Universal Selection Theory\nand the Second Darwinian Revolution</em>, Cambridge, MA: MIT\nPress.",
                "Dawkins, Richard, 1976, <em>The Selfish Gene</em>, New York:\nOxford University Press.",
                "Dennett, D., 2017, <em>From Bacteria to Bach and Back: the\nEvolution of Minds</em>, New York: W. W. Norton &amp; Company.",
                "Derksen, A. A., 2001, “Evolutionary epistemology in defense\nof the reliability of our everyday perceptual knowledge: A promise of\nEvolutionary epistemology,” <em>Philosophia-Naturalis</em>,\n38(2): 245–270.",
                "Dretske, Fred, 1971, “Perception From an Epistemological\nPoint of View,” <em>Journal of Philosophy</em>, 68(19):\n584–591",
                "Edelman, G. M., 1987, <em>Neural Darwinism: The Theory of Neuronal\nGroup Selection</em>, New York: Basic Books.",
                "Godfrey-Smith, Peter, 1996, <em>Complexity and the Function of\nMind in Nature</em>, Cambridge: Cambridge University Press.",
                "Gontier, Nathalie, J. P. Bendegem, and D. Aerts (eds.), 2006,\n<em>Evolutionary epistemology, language and culture: a\nnon-adaptationist, systems theoretical approach</em>, Dordrecht:\nSpringer.",
                "Harms, William F., 1997, “Reliability and Novelty:\nInformation Gain in Multi-Level Selection Systems,”\n<em>Erkenntnis</em>, 46: 335–363.",
                "–––, 2004, <em>Information and meaning in\nevolutionary processes</em>, Cambridge: Cambridge University\nPress.",
                "Heyes, Cecilia and Ludwig Huber (eds.), 2000, <em>The Evolution of\nCognition</em>, Cambridge, MA: MIT Press.",
                "Hofbauer, Josef, and Karl Sigmund, 1988, <em>The Theory of\nEvolution and Dynamical Systems</em>, Cambridge: Cambridge University\nPress.",
                "Hull, David, 1988, <em>Science as a Process: An Evolutionary\nAccount of the Social and Conceptual Development of Science</em>,\nChicago: The University of Chicago Press.",
                "–––, 2001, “In search of epistemological\nwarrant” in <em>Selection Theory and Social Construction: The\nEvolutionary Naturalistic Epistemology of Donald T. Campbell</em>,\nCecilia Heyes and David Hull (eds.), Albany, NY: SUNY Press, pp.\n155–167.",
                "Kim, Jagwon., 1988 “What is ‘Naturalized\nEpistemology’?,” <em>Philosophical Perspectives 2.\nEpistemology</em>, Atascadero: Ridgeview, pp. 381–405.",
                "Kuhn, Thomas, 1962, <em>The Structure of Scientific\nRevolutions</em>, Chicago: The University of Chicago Press.",
                "Lakatos, I. and Musgrave, A. (eds.), 1970, <em>Criticism and the\nGrowth of Knowledge</em>, Cambridge: Cambridge University Press.",
                "Laland, K. N., Odling-Smee F. J. and Feldman, M. W., 2000,\n“Niche construction and gene–culture co–evolution:\nAn evolutionary basis for the human sciences” in\n<em>Perspectives in Ethology</em> Vol. 13, P. Klopfer &amp; N. S.\nThompson (eds.), New York: Plenum, pp. 89–111.",
                "Laland, K. N. and O’Brien, M. J., 2011, “Cognitive Niche\nConstruction: An Introduction”, <em>Biological Theory</em>,\n6(2): 191–202.",
                "Lewis, David, 1969, <em>Convention</em>, Cambridge: Cambridge\nUniversity Press.",
                "Lewontin, Richard, 1982, “Organism and Environment” in\n<em>Learning, Development and Culture</em>, H. C. Plotkin (ed.), New\nYork: John Wiley &amp; Sons, pp. 151–170.",
                "Lorenz, Konrad, 1977, <em>Behind the Mirror</em>, London:\nMethuen.",
                "Lurz, Robert, 2011, <em>Mindreading Animals: The Debate over What\nAnimals Know about Other Minds</em>, Cambridge, MA: MIT Press.",
                "Millikan, Ruth, 1984, <em>Language, Thought, and other Biological\nCategories</em>, Cambridge, MA: MIT Press.",
                "Munz, Peter, 1993, <em>Philosophical Darwinism: On the Origin of\nKnowledge by Means of Natural Selection</em>, London: Routledge.",
                "Odling-Smee, Laland, K. N. and Feldman, M. W., 2003, <em>Niche Construction: The Neglected Process in Evolution</em>, Princeton: Princeton University Press.",
                "Panksepp, Jaak, 1998, <em>Affective Neuroscience: The Foundation\nof Human and Animal Emotions</em>, New York: Oxford University\nPress.",
                "Pinker, S., 2003, “Language as an Adaptation to the\nCognitive Niche”, in <em>Language Evolution</em>,\nM. H. Christiansen &amp; S. Kirby (eds.), Oxford: Oxford University\nPress, pp. 16–37.",
                "–––, 2010, “The Cognitive Niche:\nCoevolution of Intelligence, Sociality, and Language”,\n<em>Proceedings of the National Academy of Sciences</em>, 107\nSupplement 2: 8993–8999.",
                "Plotkin, H. C. (ed.), 1982, <em>Learning, Development, and\nCulture: Essays in Evolutionary Epistemology</em>, New York: John\nWiley &amp; Sons.",
                "Popper, Karl R., 1968, <em>The Logic of Scientific Discovery</em>,\nNew York: Harper.",
                "Popper, Karl R., 1972, <em>Objective Knowledge: An Evolutionary\nApproach</em>, Oxford: Clarendon Press.",
                "–––, 1984, “Evolutionary Epistemology,” in <em>Evolutionary Theory: Paths into the\nFuture</em>, J. W. Pollard (ed.), London: John Wiley &amp; Sons Ltd.\npp. 239–255.",
                "Radnitzky, G. and Bartley, W. W., 1987, <em>Evolutionary\nEpistemology, Theory of Rationality and the Sociology of\nKnowledge</em>, LaSalle, Ill: Open Court.",
                "Renzi, Barbara G. and Napolitano Giulio, 2011, <em>Evolutionary\nAnalogies: Is the Process of Scientific Change Analogous to the\nOrganic Change?</em>, Newcastle: Cambridge Scholars Publishing.",
                "Rescher, Nicholas, 1978, <em>Scientific Progress: A Philosophical\nEssay on the Economics of Research in Natural Science</em>, Oxford:\nBasil Blackwell.",
                "–––, 1989, <em>Cognitive Economy: The Economic\nDimension of the Theory of Knowledge</em>, Pittsburgh: University of\nPittsburgh Press.",
                "–––, 1990, <em>A Useful Inheritance:\nEvolutionary Aspects of the Theory of Knowledge</em>, Lanham, MD:\nRowman.",
                "Riedl, Rupert, 1984, <em>Biology of Knowledge: The Evolutionary\nBasis of Reason</em>, Chichester: John Wiley &amp; Sons.",
                "Rogers, Lesley and Gisela Kaplan (eds.), 2004, <em>Are Primates\nSuperior to Non-Primates?</em>, New York: Kluwer Academic.",
                "Ruse, Michael, 1986, <em>Taking Darwin Seriously: A Naturalistic\nApproach to Philosophy</em>, Oxford: Blackwell.",
                "Schuster, Peter, and Karl Sigmund, 1983, “Replicator\nDynamics,” <em>Journal of Theoretical Biology</em>, 100:\n533–538.",
                "Shimony, Abner, 1971, “Perception From an Evolutionary\nView,” <em>Journal of Philosophy</em>, 68(19):\n571–583.",
                "Skinner, B. F., 1981, “Selection by Consequences,”\n<em>Science</em>, 213: 501–504.",
                "Skyrms, Brian, 1992, “Chaos and the Explanatory Significance\nof Equilibrium: Strange Attractors in Evolutionary Game\nDynamics,” PSA 1992 (2), Philosophy of Science Association, pp.\n374–394.",
                "–––, 1996, <em>Evolution of the Social\nContract</em>, Cambridge: Cambridge University Press.",
                "Sperber, D., 1996, <em>Explaining Culture: a Naturalistic\nApproach</em>, Oxford: Blackwell.",
                "–––, 2001, “An objection to the memetic\napproach to culture,” in <em>Darwinizing Culture</em> R. Aunger\n(ed.), Oxford: Oxford University Press, pp. 163–172.",
                "Sperber, D. and L. A. Hirschfield, 2004, “The cultural\nfoundations of cultural stability and diversity”, <em>TRENDS in\ncognitive science</em>, 8(1): 40–46.",
                "Sperber, D. and N. Claidière, 2006, “Why Modeling\nCultural evolution is Still Such a Challenge,” <em>Biological\nTheory</em>, 1(1): pp. 20–22. ",
                "Taylor, P., and L. Jonker, 1978, “Evolutionary Stable\nStrategies and Game Dynamics,” <em>Mathematical\nBiosciences</em>, 40: 145–56.",
                "Ter Hark, Michel, 2004, <em>Popper, Otto Selz and the Rise Of\nEvolutionary Epistemology</em>, Cambridge: Cambridge University\nPress.",
                "Toulmin, Stephen, 1967, “The Evolutionary Development of\nNatural Science,” <em>American Scientist</em>, 55: 4.",
                "–––, 1972, <em>Human Understanding: The\nCollective Use and Evolution of Concepts</em>, Princeton: Princeton\nUniversity Press.",
                "van Schaik, C. P., 2010, “ Social learning and culture in\nanimals,” in <em>Animal Behavior: evolution and Mechanisms</em>,\nP. Kappeler (ed.), New York: Springer–Verlag, pp.\n623–653.",
                "Vollmer, Gerhard, 2005, “How is it that we can know this\nworld? New arguments in evolutionary epistemology”, in\n<em>Darwinism &amp; Philosophy</em>, V. Hösle and Christian\nIllies (eds.), Notre Dame, IN: University of Notre Dame Press, pp.\n259–274.",
                "Whiten, A. and Erdal, D., 2012, “The human\nsocio–cognitive niche and its evolutionary origins”,\n<em>Philosophical Transactions of the Royal Society</em> (B), 367:\n2119–2129.",
                "Whiten, A. and van Schaik, C. P., 2007, “The evolution of\nanimal ‘cultures’ and social intelligence”,\n<em>Philosophical Transactions of the Royal Society</em> (B), 362:\n603–620.",
                "Wuketits, Franz, 1990, <em>Evolutionary Epistemology and Its\nImplications for Humankind</em>, Albany: State University of New York\nPress."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Atran, S., 2001, “The trouble with memes: inference versus\nimitation in cultural creation,” <em>Human Nature</em>,\n12(4):351–381.</li>\n<li>Barham, James, 1990, “A poincaréan approach to\nevolutionary epistemology,” <em>Journal of Social and Biological\nStructures</em>, 13(3): 193–258.</li>\n<li>Bradie, Michael, 1986, “Assessing Evolutionary\nEpistemology,” <em>Biology &amp; Philosophy</em>, 1:\n401–459.</li>\n<li>–––, 1989, “Evolutionary Epistemology as\nNaturalized Epistemology,” in <em>Issues in Evolutionary\nEpistemology</em>, K. Hahlweg and C. A. Hooker (eds.), Albany, NY:\nSUNY Press, pp. 393–412.</li>\n<li>–––, 1994, “Epistemology from an\nEvolutionary Point of View,” in <em>Conceptual Issues in\nEvolutionary Biology</em>, second edition, Elliott Sober (ed.),\nCambridge, MA: The MIT Press, pp. 453–475.</li>\n<li>Boyd, Robert, and Peter J. Richerson, 1985, <em>Culture and the\nEvolutionary Process</em>, Chicago: The University of Chicago\nPress.</li>\n<li>Callebaut, Werner, and Rik Pinxten (eds.), 1987, <em>Evolutionary\nEpistemology: A Multiparadigm Program With a Complete Evolutionary\nEpistemology Bibliography</em> (Synthese Library: Volume 190),\nDordrecht: D. Reidel.</li>\n<li>Callebaut, Werner, and Karola Stotz, 1998, “Lean\nEvolutionary Epistemology,” <em>Evolution and Cognition</em>,\n4(1): 11–36.</li>\n<li>Campbell, Donald T., 1956a, “Adaptive behavior from random\nresponse,” <em>Behavioral Science</em>, 1(2):\n105–110.</li>\n<li>–––, 1956b, “Perception as substitute\ntrial and error,” <em>Psychological Review</em>, 63(5):\n331–342.</li>\n<li>–––, 1959, “Methodological suggestions\nfrom a comparative psychology of knowledge processes,”\n<em>Inquiry</em>, 2: 152–182.</li>\n<li>–––, 1960, “Blind variation and selective\nretentions in creative thought as in other knowledge processes,”\n<em>Psychological Review</em>, 67(6): 380–400.</li>\n<li>–––, 1974a, “Evolutionary\nEpistemology,” in <em>The Philosophy of Karl R. Popper</em>, P.\nA. Schilpp (ed.), LaSalle, IL: Open Court, pp. 412–463.</li>\n<li>–––, 1974b, “Unjustified Variation and\nSelective Retention in Scientific Discovery,” in <em>Studies in\nthe Philosophy of Biology: Reduction and Related Problems</em>, edited\nby F J. Ayala and T. Dobzhansky, London: Macmillan, pp.\n139–161.</li>\n<li>–––, 1982, “The\n”blind-variation-and-selective-retention“ Theme,” in\n<em>The Cognitive Developmental Psychology of James Mark Baldwin:\nCurrent Theory and Research in Genetic Epistemology</em>, edited by J.\nM. Broughton and D. J. Freeman-Moir, Norwood, NJ: Ablex, pp.\n87–97.</li>\n<li>–––, 1985, “Pattern Matching as an\nEssential in Distal Knowing,” in <em>Naturalizing\nEpistemology</em>, edited by H. Kornblith, Cambridge, MA: MIT Press,\n49–70.</li>\n<li>–––, 1988, “Popper and selection\ntheory,” <em>Social Epistemology</em>, 2(4): 371–377.</li>\n<li>Campbell, Donald T., and Paller, Bonnie T., 1989, “Extending\nEvolutionary Epistemology to ‘Justifying’ Scientific\nBeliefs (A sociological rapprochement with a fallibilist perceptual\nfoundationalism?),” in <em>Issues in Evolutionary\nEpistemology</em>, K. Hahlweg and C. A. Hooker (eds.), Albany: State\nUniversity of New York Press, pp. 231–257. </li>\n<li>Changeux, Jean-Pierre, 1985, <em>Neuronal Man</em>, New York:\nPantheon.</li>\n<li>Coleman, Martin, 2002, “Taking Simmel seriously in\nevolutionary epistemology,” <em>Studies in History and\nPhilosophy of Science</em>, 33A(1): 59–78.</li>\n<li>Cziko, G., 1995, <em>Without Miracles: Universal Selection Theory\nand the Second Darwinian Revolution</em>, Cambridge, MA: MIT\nPress.</li>\n<li>Dawkins, Richard, 1976, <em>The Selfish Gene</em>, New York:\nOxford University Press.</li>\n<li>Dennett, D., 2017, <em>From Bacteria to Bach and Back: the\nEvolution of Minds</em>, New York: W. W. Norton &amp; Company.</li>\n<li>Derksen, A. A., 2001, “Evolutionary epistemology in defense\nof the reliability of our everyday perceptual knowledge: A promise of\nEvolutionary epistemology,” <em>Philosophia-Naturalis</em>,\n38(2): 245–270.</li>\n<li>Dretske, Fred, 1971, “Perception From an Epistemological\nPoint of View,” <em>Journal of Philosophy</em>, 68(19):\n584–591</li>\n<li>Edelman, G. M., 1987, <em>Neural Darwinism: The Theory of Neuronal\nGroup Selection</em>, New York: Basic Books.</li>\n<li>Godfrey-Smith, Peter, 1996, <em>Complexity and the Function of\nMind in Nature</em>, Cambridge: Cambridge University Press.</li>\n<li>Gontier, Nathalie, J. P. Bendegem, and D. Aerts (eds.), 2006,\n<em>Evolutionary epistemology, language and culture: a\nnon-adaptationist, systems theoretical approach</em>, Dordrecht:\nSpringer.</li>\n<li>Harms, William F., 1997, “Reliability and Novelty:\nInformation Gain in Multi-Level Selection Systems,”\n<em>Erkenntnis</em>, 46: 335–363.</li>\n<li>–––, 2004, <em>Information and meaning in\nevolutionary processes</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Heyes, Cecilia and Ludwig Huber (eds.), 2000, <em>The Evolution of\nCognition</em>, Cambridge, MA: MIT Press.</li>\n<li>Hofbauer, Josef, and Karl Sigmund, 1988, <em>The Theory of\nEvolution and Dynamical Systems</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Hull, David, 1988, <em>Science as a Process: An Evolutionary\nAccount of the Social and Conceptual Development of Science</em>,\nChicago: The University of Chicago Press.</li>\n<li>–––, 2001, “In search of epistemological\nwarrant” in <em>Selection Theory and Social Construction: The\nEvolutionary Naturalistic Epistemology of Donald T. Campbell</em>,\nCecilia Heyes and David Hull (eds.), Albany, NY: SUNY Press, pp.\n155–167.</li>\n<li>Kim, Jagwon., 1988 “What is ‘Naturalized\nEpistemology’?,” <em>Philosophical Perspectives 2.\nEpistemology</em>, Atascadero: Ridgeview, pp. 381–405.</li>\n<li>Kuhn, Thomas, 1962, <em>The Structure of Scientific\nRevolutions</em>, Chicago: The University of Chicago Press.</li>\n<li>Lakatos, I. and Musgrave, A. (eds.), 1970, <em>Criticism and the\nGrowth of Knowledge</em>, Cambridge: Cambridge University Press.</li>\n<li>Laland, K. N., Odling-Smee F. J. and Feldman, M. W., 2000,\n“Niche construction and gene–culture co–evolution:\nAn evolutionary basis for the human sciences” in\n<em>Perspectives in Ethology</em> Vol. 13, P. Klopfer &amp; N. S.\nThompson (eds.), New York: Plenum, pp. 89–111.</li>\n<li>Laland, K. N. and O’Brien, M. J., 2011, “Cognitive Niche\nConstruction: An Introduction”, <em>Biological Theory</em>,\n6(2): 191–202.</li>\n<li>Lewis, David, 1969, <em>Convention</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Lewontin, Richard, 1982, “Organism and Environment” in\n<em>Learning, Development and Culture</em>, H. C. Plotkin (ed.), New\nYork: John Wiley &amp; Sons, pp. 151–170.</li>\n<li>Lorenz, Konrad, 1977, <em>Behind the Mirror</em>, London:\nMethuen.</li>\n<li>Lurz, Robert, 2011, <em>Mindreading Animals: The Debate over What\nAnimals Know about Other Minds</em>, Cambridge, MA: MIT Press.</li>\n<li>Millikan, Ruth, 1984, <em>Language, Thought, and other Biological\nCategories</em>, Cambridge, MA: MIT Press.</li>\n<li>Munz, Peter, 1993, <em>Philosophical Darwinism: On the Origin of\nKnowledge by Means of Natural Selection</em>, London: Routledge.</li>\n<li>Odling-Smee, Laland, K. N. and Feldman, M. W., 2003, <em>Niche Construction: The Neglected Process in Evolution</em>, Princeton: Princeton University Press.</li>\n<li>Panksepp, Jaak, 1998, <em>Affective Neuroscience: The Foundation\nof Human and Animal Emotions</em>, New York: Oxford University\nPress.</li>\n<li>Pinker, S., 2003, “Language as an Adaptation to the\nCognitive Niche”, in <em>Language Evolution</em>,\nM. H. Christiansen &amp; S. Kirby (eds.), Oxford: Oxford University\nPress, pp. 16–37.</li>\n<li>–––, 2010, “The Cognitive Niche:\nCoevolution of Intelligence, Sociality, and Language”,\n<em>Proceedings of the National Academy of Sciences</em>, 107\nSupplement 2: 8993–8999.</li>\n<li>Plotkin, H. C. (ed.), 1982, <em>Learning, Development, and\nCulture: Essays in Evolutionary Epistemology</em>, New York: John\nWiley &amp; Sons.</li>\n<li>Popper, Karl R., 1968, <em>The Logic of Scientific Discovery</em>,\nNew York: Harper.</li>\n<li>Popper, Karl R., 1972, <em>Objective Knowledge: An Evolutionary\nApproach</em>, Oxford: Clarendon Press.</li>\n<li>–––, 1984, “Evolutionary Epistemology,” in <em>Evolutionary Theory: Paths into the\nFuture</em>, J. W. Pollard (ed.), London: John Wiley &amp; Sons Ltd.\npp. 239–255.</li>\n<li>Radnitzky, G. and Bartley, W. W., 1987, <em>Evolutionary\nEpistemology, Theory of Rationality and the Sociology of\nKnowledge</em>, LaSalle, Ill: Open Court.</li>\n<li>Renzi, Barbara G. and Napolitano Giulio, 2011, <em>Evolutionary\nAnalogies: Is the Process of Scientific Change Analogous to the\nOrganic Change?</em>, Newcastle: Cambridge Scholars Publishing.</li>\n<li>Rescher, Nicholas, 1978, <em>Scientific Progress: A Philosophical\nEssay on the Economics of Research in Natural Science</em>, Oxford:\nBasil Blackwell.</li>\n<li>–––, 1989, <em>Cognitive Economy: The Economic\nDimension of the Theory of Knowledge</em>, Pittsburgh: University of\nPittsburgh Press.</li>\n<li>–––, 1990, <em>A Useful Inheritance:\nEvolutionary Aspects of the Theory of Knowledge</em>, Lanham, MD:\nRowman.</li>\n<li>Riedl, Rupert, 1984, <em>Biology of Knowledge: The Evolutionary\nBasis of Reason</em>, Chichester: John Wiley &amp; Sons.</li>\n<li>Rogers, Lesley and Gisela Kaplan (eds.), 2004, <em>Are Primates\nSuperior to Non-Primates?</em>, New York: Kluwer Academic.</li>\n<li>Ruse, Michael, 1986, <em>Taking Darwin Seriously: A Naturalistic\nApproach to Philosophy</em>, Oxford: Blackwell.</li>\n<li>Schuster, Peter, and Karl Sigmund, 1983, “Replicator\nDynamics,” <em>Journal of Theoretical Biology</em>, 100:\n533–538.</li>\n<li>Shimony, Abner, 1971, “Perception From an Evolutionary\nView,” <em>Journal of Philosophy</em>, 68(19):\n571–583.</li>\n<li>Skinner, B. F., 1981, “Selection by Consequences,”\n<em>Science</em>, 213: 501–504.</li>\n<li>Skyrms, Brian, 1992, “Chaos and the Explanatory Significance\nof Equilibrium: Strange Attractors in Evolutionary Game\nDynamics,” PSA 1992 (2), Philosophy of Science Association, pp.\n374–394.</li>\n<li>–––, 1996, <em>Evolution of the Social\nContract</em>, Cambridge: Cambridge University Press.</li>\n<li>Sperber, D., 1996, <em>Explaining Culture: a Naturalistic\nApproach</em>, Oxford: Blackwell.</li>\n<li>–––, 2001, “An objection to the memetic\napproach to culture,” in <em>Darwinizing Culture</em> R. Aunger\n(ed.), Oxford: Oxford University Press, pp. 163–172.</li>\n<li>Sperber, D. and L. A. Hirschfield, 2004, “The cultural\nfoundations of cultural stability and diversity”, <em>TRENDS in\ncognitive science</em>, 8(1): 40–46.</li>\n<li>Sperber, D. and N. Claidière, 2006, “Why Modeling\nCultural evolution is Still Such a Challenge,” <em>Biological\nTheory</em>, 1(1): pp. 20–22. </li>\n<li>Taylor, P., and L. Jonker, 1978, “Evolutionary Stable\nStrategies and Game Dynamics,” <em>Mathematical\nBiosciences</em>, 40: 145–56.</li>\n<li>Ter Hark, Michel, 2004, <em>Popper, Otto Selz and the Rise Of\nEvolutionary Epistemology</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Toulmin, Stephen, 1967, “The Evolutionary Development of\nNatural Science,” <em>American Scientist</em>, 55: 4.</li>\n<li>–––, 1972, <em>Human Understanding: The\nCollective Use and Evolution of Concepts</em>, Princeton: Princeton\nUniversity Press.</li>\n<li>van Schaik, C. P., 2010, “ Social learning and culture in\nanimals,” in <em>Animal Behavior: evolution and Mechanisms</em>,\nP. Kappeler (ed.), New York: Springer–Verlag, pp.\n623–653.</li>\n<li>Vollmer, Gerhard, 2005, “How is it that we can know this\nworld? New arguments in evolutionary epistemology”, in\n<em>Darwinism &amp; Philosophy</em>, V. Hösle and Christian\nIllies (eds.), Notre Dame, IN: University of Notre Dame Press, pp.\n259–274.</li>\n<li>Whiten, A. and Erdal, D., 2012, “The human\nsocio–cognitive niche and its evolutionary origins”,\n<em>Philosophical Transactions of the Royal Society</em> (B), 367:\n2119–2129.</li>\n<li>Whiten, A. and van Schaik, C. P., 2007, “The evolution of\nanimal ‘cultures’ and social intelligence”,\n<em>Philosophical Transactions of the Royal Society</em> (B), 362:\n603–620.</li>\n<li>Wuketits, Franz, 1990, <em>Evolutionary Epistemology and Its\nImplications for Humankind</em>, Albany: State University of New York\nPress.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "epistemology: naturalism in",
            "evolution: cultural",
            "game theory: evolutionary",
            "information: biological",
            "teleology: teleological notions in biology"
        ],
        "entry_link": [
            {
                "../epistemology-naturalized/": "epistemology: naturalism in"
            },
            {
                "../evolution-cultural/": "evolution: cultural"
            },
            {
                "../game-evolutionary/": "game theory: evolutionary"
            },
            {
                "../information-biological/": "information: biological"
            },
            {
                "../teleology-biology/": "teleology: teleological notions in biology"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=epistemology-evolutionary\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/epistemology-evolutionary/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=epistemology-evolutionary&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/epistemology-evolutionary/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=epistemology-evolutionary": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/epistemology-evolutionary/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=epistemology-evolutionary&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/epistemology-evolutionary/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.ethics.ubc.ca/eame/\" target=\"other\">Evolving Artificial Moral Ecologies</a>,\n Centre for Applied Ethics, University of British Columbia",
            "<a href=\"http://www.iep.utm.edu/evo-epis/\" target=\"other\">Evolutionary Epistemology</a>,\n entry in the <em>Internet Encyclopedia of Philosophy</em>."
        ],
        "listed_links": [
            {
                "http://www.ethics.ubc.ca/eame/": "Evolving Artificial Moral Ecologies"
            },
            {
                "http://www.iep.utm.edu/evo-epis/": "Evolutionary Epistemology"
            }
        ]
    }
}