{
    "url": "erasmus",
    "title": "Desiderius Erasmus",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Erika Rummel\n\nEric MacPhail\n<macphai@indiana.edu>",
        "author_links": [
            {
                "mailto:macphai%40indiana%2eedu": "macphai@indiana.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\nErika Rummel\n<br/>\nEric MacPhail\n&lt;<a href=\"mailto:macphai%40indiana%2eedu\"><em>macphai<abbr title=\" at \">@</abbr>indiana<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Sep 27, 2017",
        "substantive revision Thu Oct 14, 2021"
    ],
    "preamble": "\n\nDesiderius Erasmus of Rotterdam (1467?–1536) was not a\nsystematic philosopher although we discern in the large body of his\nwritings a certain Erasmian habit of mind. He often reflected on\nsubjects that invite philosophical inquiry: the influence of nature\nversus nurture, the relationship between word and thing, the ideal\nform of government, the nature of faith, and the theory of knowledge.\nErasmus’ views on these subjects are of interest to historians\ntoday, even if they are unstructured, because his works circulated\nwidely and his influence in Northern Europe was pervasive. In modern\nparlance, he was an opinion maker. If a general label is needed,\nErasmus’ thought is best described as “Christian\nHumanism”, that is, a philosophy of life combining Christian\nthought with classical traditions. He embraced the humanistic belief\nin an individual’s capacity for self-improvement and the\nfundamental role of education in raising human beings above the level\nof brute animals. The thrust of Erasmus’ educational programme\nwas the promotion of docta pietas, learned piety, or what he\ntermed the “philosophy of Christ”. As a biblical scholar\nhe supported the humanistic call Ad fontes, a return to the\ntexts in the original language and therefore promoted the study of the\nbiblical languages Hebrew, Greek, and Latin. He was in the vanguard of\nmodern philology. His pioneering edition of the Greek New Testament\nshows that he had an understanding of the process of textual\ntransmission and had developed text-critical principles. In politics,\nErasmus embraced consensus, compromise, and peaceful cooperation,\nideals he recommended to the participants in the Reformation debate,\nalbeit with little success. Considered a forerunner of the Reformation\nby his contemporaries, he broke with Martin Luther over the\nlatter’s sectarianism. More fundamentally, the two men disagreed\nover heuristics and engaged in a polemic over the question of free\nwill. Erasmus took a skeptical position vis-à-vis\nLuther’s assertions. Unlike the reformer, he did not believe in\nthe clarity of Scripture and used consensus and tradition as criteria\nto settle questions that did not allow a rational conclusion. Erasmus\nrarely ventured into doctrinal questions, however, favoring simple\nfaith and devotion over dialectics and scholastic speculation. The\ncirculation of Erasmus’ works was temporarily curtailed when the\nCatholic Church put them on the Index of Forbidden Books, but his\nideas saw a revival during the Enlightenment when he was regarded as a\nforerunner of rationalism. His most famous work, The Praise of\nFolly, has remained in print to the present day, a distinction\nshared by few books from the 16th century.\n",
    "toc": [
        {
            "#LifeWork": "1. Life and Works"
        },
        {
            "#Meth": "2. Methodology"
        },
        {
            "#EducPhil": "3. Educational Philosophy"
        },
        {
            "#PhilLang": "4. Languag"
        },
        {
            "#PoliThou": "5. Political Thought"
        },
        {
            "#PietPhilChri": "6. Pietas and Philosophia Christi"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#ErasWork": "Erasmus’ Works"
        },
        {
            "#OthePrimWork": "Other Primary Works"
        },
        {
            "#Biog": "Biographies"
        },
        {
            "#SecoWork": "Secondary Works"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Works\n\nErasmus was born in Rotterdam on 27 October 1467 (?) as the\nillegitimate son of a priest. He attended a school at Deventer which\nwas regarded as progressive and had capable teachers who introduced\nErasmus to “something of a higher standard of literature”\n(CWE 4: 405). Orphaned in 1483, he came into the care of guardians who\nsent him to a school run by the Brethren of the Common Life in the\nspirit of the Devotio Moderna. Since Erasmus’ inheritance was\nsmall, his guardians persuaded him to enter the monastery of the\nAugustinian Canons Regular at Steyn. He was ordained priest in\n1492.\n\nIn later years Erasmus alleged that he had been pressured into taking\nthe vows. His misgivings found expression in one of his first works,\nDe Contemptu Mundi (On disdaining the World, written in the\n1490s, published 1521). Ostensibly a praise of monastic life, it began\nby recommending seclusion and withdrawal from the world but ended in a\nlament about the decline of monasticism and a warning to postulants\nnot to take the vows rashly. Erasmus himself discovered that he was\nconstitutionally and psychologically unsuited to the monastic life. He\nwould have preferred to go to university. In 1495 he saw a chance to\nrealize this goal when Bishop Hendrik of Bergen sent him to the\nCollège de Montaigu in Paris and promised him financial\nsupport. It is uncertain how much, if any, theological training\nErasmus received during his brief stay at the college. In any case, he\ndid not find the Parisian brand of theology to his liking, declaring\nthat scholasticism “repelled him” (CWE 4: 408).When the\npromised financial support did not materialize, Erasmus left the\ncollege, then renowned for its strict discipline and harsh living\nconditions, and supported himself by tutoring well-to-do young men.\nThis experience produced a number of educational handbooks and aids,\namong them De Epistolis Conscribendis, a letter-writing\nmanual (1522); De Copia, a handbook of style (1502);\nColloquia, a collection of dialogues meant to teach correct\nLatin (1518), and the Adagia , an anthology of proverbs to be\nused as rhetorical tools to embellish style (1500). All of these books\nsaw multiple editions, some of them expanded and given a larger\npurpose. Thus some of the proverbs provided starting points for\nessays, and many of the colloquies likewise became opinion pieces on\nissues of the day.\n\nIn 1499 Erasmus accompanied one of his pupils, William Blount, Lord\nMountjoy, to England. The visit led to important connections. He made\nlife-long friends, among them the humanists William Grocyn and Thomas\nLinacre, who inspired him to take up the study of Greek, and John\nColet who shared his scorn for scholastic theology and drew him toward\nbiblical studies. He was on close terms also with Thomas More, later\nLord Chancellor of England, with whom he collaborated on translations\nof Lucian, and he found a patron in William Warham, archbishop of\nCanterbury, who granted him an ecclesiastical benefice in Aldington,\nKent. His illegitimate birth disqualified Erasmus from taking up\nbenefices, but he received a papal dispensation through the\nintervention of the nuncio Andrea Ammonio, another of his English\nconnections. Eventually he drew a steady income from pensions and\nbenefices. A stipend, which he received as councilor to Charles V, was\npaid only irregularly, however.\n\nOver the next two decades Erasmus traveled extensively. He returned to\nFrance for a time, made two more journeys to England, and traveled to\nItaly where he obtained a doctorate in theology at the University of\nTurin. In 1517 he finally settled in Leuven. By that time he had made\na name for himself. He had published a number of bestsellers: the\nwitty satire Encomium Moriae  (The Praise of Folly, 1511);\nthe Adagia, which he enriched and expanded to more than 4000\nproverbs; and the devotional Enchiridion Militis Christiani\n(Handbook of the Christian Soldier, 1503). In 1516, he published his\nmagnum opus, an edition of the Greek New Testament, the first\nto reach the market. It anticipated the Complutensian\nPolyglot, which was already in print but still awaiting the papal\nimprimatur. Thus Erasmus found success in four different genres:\nliterature, education, religion, and theology. In a catalogue he\npublished in 1523, Erasmus arranged his writings under nine headings:\nworks furthering language arts, that is, literary and educational\nwritings; his collection of adages; his correspondence; works\nfurthering moral education (he noted that their content overlapped\nwith works in the first category); works promoting piety; the\nannotated edition of the New Testament; paraphrases on the New\nTestament; polemics; and editions and translations of patristic\nworks.\n\nWhile Erasmus was revered among humanists, his biblical scholarship\nsoon came under attack from theologians. They refused to acknowledge\nhim as a colleague and derided his doctorate, which had been granted\nper saltum, that is, without fulfilling the residence\nrequirements or passing the usual examinations. In their eyes, Erasmus\nwas merely a “theologizing humanist”, as the prominent\nParis theologian Noël Beda put it (Preface to\nAnnotations 1526). Erasmus was not the first humanist to\ntreat the New Testament in a text-critical fashion and to compare the\nLatin Vulgate with the Greek original, although none of his\npredecessors had dared to use their findings to publish an amended\nedition of the text. Erasmus had discovered a manuscript of Lorenzo\nValla’s annotations on the New Testament and originally planned\nto publish notes of a similar nature, that is, observations of errors,\ndiscrepancies, and mistranslations. He expanded the scope of his\nproject on the urging of his publisher, Johann Froben, and rather\nhastily assembled a text based on the biblical manuscripts he had been\nable to consult. In the resulting edition, the Greek text was faced by\na lightly amended Vulgate, with Erasmus’ editorial changes\nexplained in annotations following the text. The reception of the\nedition varied. Humanists generally praised it as an exceptional\nachievement; a considerable number of theologians disapproved of it\nand not only impugned Erasmus’ scholarship but also questioned\nhis orthodoxy. Their attacks must be seen in the context of\nLuther’s coincidental rise to prominence and the resulting\nreligious debate which cast a long shadow over state and church and\nover society at large. Erasmus’ move from Leuven to Basel in\n1521 was partly motivated by a desire to escape the hostile climate at\nthe University of Leuven, but his opponents were not limited to the\nLow Countries. He had critics in Italy and was formally investigated\nby ecclesiastical authorities in Spain and in France. In 1531the\nprestigious faculty of theology at the University of Paris publicly\ncensured and condemned numerous passages in his works as unorthodox.\nErasmus responded to his critics with lengthy polemics, which fill two\nfolio volumes in the Leiden Opera Omnia. He also published\nfour revised editions of his New Testament (1519, 1522, 1527, 1531)\nwith corrections and expanded notes.\n\nCritics of Erasmus’ New Testament edition accused him of\nintroducing changes to a sacred text and thus challenging the\nprinciple of inspiration. Erasmus denied these charges. On the\ncontrary, he said, his edition restored the original text and\ncorrected the errors introduced by translators and scribes.\nTheologians questioned Erasmus’ qualifications to tackle Holy\nWrit, but he insisted that editing and textual criticism did not\nrequire a degree in theology. They were tasks proper to philologists.\nThe prefaces he added to successive editions of the New Testament\nattempted to clarify his aims and methods. He somewhat ingenuously\nclaimed that he was only doing philological work and ignored\nthe fact that a change in words frequently also shifted the meaning.\nIndeed, some of his critics acknowledged the usefulness of his work,\nbut took issue with specific editorial choices. Thus they protested\nagainst Erasmus replacing the traditional poenitentiam agite\n(do penance) at Matt. 3:2 with poeniteat vos (repent), in\nwhich they saw a Lutheran slant. There was an uproar also about his\nomission of the so-called Comma Johanneum at I John 5:7, one of the\nproofs for the divine trinity, for which Erasmus had found no evidence\nin the Greek manuscripts or support in the Fathers. The biblical\ncommentaries of the Church Fathers and their quotations from the bible\nwere important sources for Erasmus in establishing the text of the New\nTestament. He read widely and published numerous editions and\ntranslations of patristic writings, among them Jerome, Augustine,\nChrysostom, and Origen, and in many cases established the first\nreliable critical text of their works (see Béné 1969 and\nGodin 1982).\n\nIn the last two decades of his life, Erasmus wrote numerous apologiae,\nrefuting critics of his New Testament edition and battling the\naccusation that he had inspired the Reformation and was a supporter of\nLuther. It was difficult, however, to change an opinion that was so\nentrenched that it had become proverbial and issued in the popular\nsaying “Erasmus laid the egg, and Luther hatched it”.\nErasmus’ critics demanded proof of his orthodoxy in the form of\na direct attack on Luther. For some years Erasmus held out and refused\nexplicitly to endorse any religious party. Maintaining scholarly\ndetachment was, however, impossible in the militant climate of the\nConfessional Age. In 1524 Erasmus reluctantly published De Libero\nArbitrio Diatribe (Discussion of Free Will). A politely worded\ndisquisition addressed to Luther, it showed their fundamental\ndisagreement on a crucial theological question. The ensuing polemic\nfailed to convince Erasmus’ critics of the orthodoxy of his\nviews. It was undeniable that Erasmus had been in sympathy with the\nreformers for a time, although he was not prepared to challenge the\nauthority of the church and never promoted schism. Erasmus’\ncriticism concerned abuses rather than doctrine, and although his\nannotations on the New Testament show that he disagreed with certain\ntraditional interpretations, he always emphasized his willingness to\ndefer to the judgment of the Church.\n\nIn 1529 when the city of Basel, where he resided at the time, turned\nProtestant, he voted with his feet and moved to Catholic Freiburg.\nQuestions about Erasmus’ orthodoxy persisted, however, even\nafter his death in 1536. In the wake of the Council of Trent, which\ndefined articles of faith more rigidly, Erasmus’ works were\nplaced on the Index of Prohibited Books.\n2. Methodology\n\nDuring his lifetime Erasmus’ name became synonymous with\nhumanism, a label also adopted in modern reference works (such as\nNauert 2006). Today the term “humanist” has a broad range\nof meanings. In the 16th century the word denoted a student\nor teacher of the studia humanitatis, a curriculum focusing\non the study of classical languages, rhetoric, and literature. At\nnorthern universities, where scholasticism and the dialectical method\nreigned supreme, the trend-setting humanists were regarded as\nchallengers of the status quo (see Rummel 1995). The defenders of\ntradition belittled their competitors as “grammarians” and\ndismissed the humanities as poetria, the stuff of poetry. To\na certain extent, the tensions between the two schools of thought may\nbe explained in terms of professional jealousy, but at its core was\nthe dispute over methodology and qualifications. Humanists favored\nrhetorical arguments; scholastics insisted on logical proof.\nScholastic theologians in particular regarded the humanists as\ndangerous interlopers. They questioned their orthodoxy because of\ntheir inclination to use the skeptical ars dubitandi and\ndenied their right to apply philological principles to the biblical\ntext. Scripture, they insisted, was the exclusive domain of graduate\ntheologians. Humanists in turn saw the dialectical method used by the\nscholastics as a perversion of Aristotelian logic and derided their\ntechnical terminology as a corruption of the Latin language. In the\nPraise of Folly Erasmus lampooned scholastic theologians in a\npassage that became notorious:\n\n\nThey are fortified with an army of scholastic definition, conclusions,\ncorollaries, and propositions both explicit and implicit…. They\nquibble about concepts, relations, instants, formalities, quiddities\nand ecceities, which a man could not possibly perceive unless like\nLynceus he could see through blackest darkness things which\ndon’t exist…. You’d extricate yourself faster from\na labyrinth than from the tortuous obscurities of realists,\nnominalists, Thomists, Albertists, Ockhamists, and Scotists….\nSuch is the erudition and complexity they all display that I fancy the\napostles themselves would need the help of another Holy Spirit if they\nwere obliged to join issue on these topics with our new breed of\ntheologians. (CWE 27: 126–7)\n\n\nOn a more serious note, he voiced two objections against the\ndialectical disputations of the theologians: “The portentious\nfilth of their barbarous and artificial style” obscured the\nmeaning (CWE 3: 124), and their argumentation lacked a moral\ndimension. Scholastic disputations honed intellectual skills but\nfailed to make better Christians of the protagonists. “Well, we\nare training not a pugilist but a theologian”, Erasmus says in\nhis Methodus, “and a theologian who prefers to express\nwith his life rather than in syllogisms what he professes” (CWE\n41: 452).\n\nHe further insisted on the right of humanists, who were trained in the\nclassical languages, to apply their philological skills to both\nsecular and sacred writings. Translation and textual\ncriticism of the Bible required philological skills, and theologians\nwho engaged in this task “were acting in the capacity of\nphilologists (grammatici)” (Ep. 181: 120–5; CWE\n2).\n\nWhile the need for language studies and the use of philological\nmethods found gradual acceptance among theologians, the skeptical\nars dubitandi, which was also closely associated with\nhumanism, remained anathema. Since skepticism was identified with\natheism in Erasmus’ time, most humanists refrained from\nadvocating this method openly. They expressed their skepticism through\nthe use of open-ended dialogue or rhetorical compositions that argued\nopposing points of view. Erasmus used these means to argue for and\nagainst marriage, for and against monastic vows, and for and against\ndoctrinal positions. Rather surprisingly he admitted to his preference\nfor skepticism in A Discussion of Free Will. This tract was\naimed at Luther’s assertion that free will did not exist and the\nsinner was justified sola fide, by faith alone, and sola\ngratia, by grace alone (more in Boyle 1983).\n\nErasmus’ tract, which he called a diatribe, that is, a\ndisquisition, is a showpiece of his methodology. He begins his\nargumentation in the classic skeptical fashion by collating scriptural\nevidence for and against the concept of free will and demonstrating\nthat there is no consensus and no rational way of resolving the\nresulting dilemma.\n\nThe method of arguing in utramque partem, on both sides of a\nquestion, was first developed by the Greek Sophists as a demonstration\nof their rhetorical prowess. Pyrrhonic skeptics adopted this method as\na preliminary step in arguing a case. If the evidence was ambivalent,\nthey advocated epoche, suspension of judgment. Academic\nskeptics modified this process, admitting probability as a criterion\nto settle an ambiguous question. A variant of the skeptical method\nalso appears in medieval scholastic handbooks where doctrinal\nquestions are argued sic et non, that is, on both sides, then\nsettled by a magisterial decision or resolutio.\n\nErasmus stressed that he was not prepared to pass judgment on the\nquestion of free will himself. Indeed his natural inclination was to\ntake the Pyrrhonic route and suspend judgment since the evidence was\nnot unequivocal. “I take so little pleasure in assertions that I\nwill gladly seek refuge in Scepticism”, he writes (CWE 76: 7),\nbut as a believer he was obliged to take a different route. He\nsubstituted for his own judgment the authoritative decision of the\nCatholic Church, which affirmed the existence of free will. As her\nobedient son, he accepted this resolution. Unlike the scholastics,\nthen, Erasmus does not provide a dialectically reasoned answer, but\nsubmits to “commonly accepted creeds or universal synods”\n(LB IX: 1091C), that is, to long-standing tradition and to decisions\narrived at by the consensus of authorized representatives of the\nCatholic Church. Modern scholars acknowledge this slant when they\nlabel Erasmus a “Christian humanist”. Likewise his\nskepticism might be called a “Christian skepticism”, that\nis, a pagan philosophy modified and adapted to Christian thought.\n\nErasmus’ skepticism shaped his attitude toward the reformers.\nFor several years he gave them his qualified support, but in the 1520s\nwhen he saw Luther openly defy Catholic authorities, he decried his\nradical methods and distanced himself from the Reformation movement.\nThe decision to disengage may have been prompted by considerations for\nhis own safety and a desire to avoid inquisitorial scrutiny, but\nepistemological considerations also played a role in his withdrawal\nfrom the reformers and ultimate reversal of opinion about Luther.\nErasmus regarded consensus as an essential criterion of the doctrinal\ntruth. Schism posed a threat to his decision-making process. If papal\nauthority was questioned in principle and the decrees of the synods\nwere not binding, Erasmus the Christian Skeptic was paralyzed in his\ndecision-making process and unable to settle questions that did not\nallow a resolution based on clear scriptural evidence.\n\nLuther, who believed in the clarity of Scripture, did not accept\nskepticism as a methodological approach. He saw it as waffling. He\nscoffed at Erasmus who wanted “to compare everything and affirm\nnothing” and called him a follower of Lucian or Epicurus, an\natheist who ridiculed the beliefs of others. “Permit us to be\nasserters”, he wrote, “to be devoted to assertions and\ndelight in them, while you stick to your sceptics and\nAcademics… The Holy Spirit is no Sceptic!” Luther\ncriticized Erasmus for using the skeptical method also in his\nCatechismus (1524) and thereby sowing doubt among\ncatechumens. He was unwilling to put up with ambivalence and demanded\na clear-cut judgment. There was no room in doctrinal discussions for\nErasmus’ slippery rhetoric (see CWE 76: 116–24; Luther\n1525, “On the Bondage of the Will” quoted in Rummel 2000,\n59–60).\n\nErasmus responded to Luther’s criticism with a second tract,\nHyperaspistes (A Defensive Shield, 1526), reaffirming his\nskepticism, but clarifying its meaning:\n\n\nA Sceptic is not someone who doesn’t care to know what is true\nor false…but rather someone who does not make a final decision\neasily or fight to the death for his own opinion, but rather accepts\nas probable what someone else accepts as certain.\n\n\nUp to this point he might be describing the position of an Academic\nskeptic, but he goes on to specify:\n\n\nI explicitly exclude from Scepticism whatever is set forth in Sacred\nScripture or whatever has been handed down to us by the authority of\nthe Church. (CWE 76: 118)\n\n\nErasmus’ criteria then are first of all Scripture, but if\nscriptural evidence is ambiguous, he relies on\n\n\nthe decrees of the Catholic Church, especially those issued by general\ncouncils and fully approved by a consensus of the Christian people.\n(CWE 76: 127)\n\n\nIn other words, he substitutes for the Academic criterion of\nprobability, the criteria of Christian tradition and consensus (see\nespecially Payne in Coppens 1969, 2: 77–99).\n\nLuther disapproved of Erasmus’ use of rhetorical terms in what\nwas a doctrinal dispute. His admirers, by contrast, praised his\nskillful use of language. They contrasted his moderate wording with\nLuther’s antagonistic tone and commended Erasmus’\ncourteous and accommodating style, but did not comment on the\nepistemological underpinning of his conclusions. It is possible that\nthey appreciated Erasmus’ arguments but did not think it politic\nor indeed helpful to his cause to acknowledge his skepticism.\n\nIn addition to the arguments rooted in skepticism, Erasmus also brings\nethical criteria to bear on the question of free will. He argued that\ndenying the existence of free will would destroy the moral basis of\nhuman action. Affirming the power of free will was socially expedient.\nHumanists criticized the dialectic method used by the scholastics\nprecisely because it resulted only in a technical victory over their\nopponents and did not produce moral conviction or change their\nopponents’ mind. To convince the other party, consensus was\nnecessary. Thus the characters in Erasmus’ Colloquies\n“Inquiry into Faith” and “The Godly Feast”\nargue on both sides of the questions at issue, but their dialogue ends\nin a friendly consensus. This rhetorical type of argumentation which\nemphasizes collaboration and consensus-building is a typical\nhumanistic approach and an important element also of Erasmus’\npolitical thought and his educational philosophy.\n3. Educational Philosophy\n\nErasmus earned his living as a teacher for only a few years, but\neducation remained a lifelong interest and a central theme in his\nwritings (see especially Margolin 1995). Erasmus expressed confidence\nin the potential of human beings for self-improvement, a corollary of\nhis acceptance of free will. He believed in the preponderance of\nnurture over nature, given the power of the will. It was therefore the\nduty of parents and teachers to ensure that children fulfilled their\npotential and of adults to live up to it. “What is man’s\nreal nature?” Erasmus asks.\n\n\nIs it not to live according to reason? This is why he is called a\nrational being, and this is what sets him apart from animals. And what\nis the most harmful influence upon man? Surely it is ignorance. (CWE\n26: 312)\n\n\nCiting Origen, Erasmus speaks of a tripartite human nature, made up of\nspirit, soul, and flesh. The soul, which is “the middle\npart”, may through free will align itself either with the divine\nspirit and “itself become spiritual, but if it abandons itself\nto the cupidities of the flesh, it will degenerate into the\nbody” (CWE 66: 51). This is a characteristic humanistic position\nand recalls the wording of Pico della Mirandola’s iconic\nOration on the Dignity of Man (1496 [1996], 8), which\ndescribes the choice as one between “descend[ing] to the lower,\nbrutish forms of life…[or] ris[ing] again to the superior\norders whose life is divine”.\n\nErasmus accepted the classical doctrine of the three prerequisites of\nexcellence—natural talent, instruction, and practice (CWE 26:\n311)—but he tended to blame a poor result on neglect and wrong\nteaching methods rather than a lack of ability or intention on the\npart of student. This parallels the Catholic belief in the limited\npower of free will. Without divine guidance human endeavours are in\nvain. Similarly the successful education of children depends on the\nguidance of parents and teachers, father figures recalling God’s\npatriarchal model.\n\nErasmus composed a number of treatises on the subject of education. He\ndiscussed curriculum in two works, De Ratione Studii (On the\nMethod of Study, 1511) and Ratio Verae Theologiae (Method of\nTrue Theology, 1518). In both tracts he emphasized the importance of\nlearning the classical languages and studying the classics. In the\ncase of secular education, he counseled early exposure of students to\nGreek and Latin and extensive reading in probati autores (the\napproved canon of authors), like Homer, Terence, Plautus, Virgil,\nHorace, and Cicero. He recommended an all-round education but\nemphasized the study of history, the proverbial teacher of life.\nSimilarly, he counseled theology students to read the\n“classics”, that is, the sources of Christianity: the\nBible and the Church Fathers. In contrast to the scholastics, whose\ncore subject was dialectic, Erasmus privileged ethics over logic and\nthe formation of character over factual knowledge.\n\nHis ideas on the aims and methods of education are contained in De\nPueris Instituendis (On the Education of Children, 1529) and\nInstitutio Principis Christiani (On the Education of a\nChristian Prince, 1516), but are expressed there in a rhetorical\nrather than a systematic fashion. Erasmus himself calls On the\nEducation of Children a demonstration of rhetorical principles,\nan example of a theme “presented first in brief summary form and\nthen developed into a more elaborate and more detailed argument”\n(CWE 26: 295). The rhetorical nature of the Education of a\nChristian Prince is self-evident. It is hardly more than a\ncollection of aphorisms, a showcase for Erasmus’ rhetorical\nskills rather than an expression of personal opinions. This creates a\nproblem of interpretation for the modern reader. To separate\nclichés from principles it is necessary to consider the\nfrequency and consistency of certain thought patterns in\nErasmus’ works. Four ideas are recurring themes in his writings\non education: the humanizing effect of education; the effectiveness of\ncooperative rather than coercive methods; the ability of both sexes to\nbenefit from education, and the importance of internalizing the\nmaterial taught.\n\nHe proclaimed that human beings without education had no humanity:\n“Man was not born but made man” (CWE 26: 304). It was\neducation that raised human beings above the level of brute beasts and\nmade them useful members of society. “Man, unless he has\nexperienced the influence of learning and philosophy, is at the mercy\nof impulses that are worse than those of a wild beast” (CWE 26:\n305). Education is an important socializing process. A child that has\nbeen well educated will grow up “a son who will be a faithful\nprotector of his family, a good husband to his wife, and a solid and\nuseful citizen of his country” (CWE 26: 302). There are\nimmediate practical advantages to schooling as well.\n\n\nBeing occupied with his studies, a child will avoid the common\npitfalls of youth—for learning is something that engages the\nentire person- and this is a blessing which should not be undervalued.\n(CWE 26: 297)\n\n\nTeachers must understand that education will bear fruit only if it is\na cooperative effort. It is the teacher’s task to present the\nmaterial in an instructive and entertaining fashion to retain the\nstudent’s interest rather than use punitive methods. Coercion\nand corporal punishment are counter-productive, whereas an appeal to\nthe students’ interests and praise for their effort are\neffective means of education.\n\nLike many of his contemporaries, Erasmus grew up in the belief that\nwomen were intellectually inferior to men and therefore could not\nbenefit from education in the same measure. He changed his mind after\nmeeting the erudite daughters of Thomas More and hearing of learned\nwomen like Marguerite of Navarre and Caritas Pickheimer. Several of\nhis Colloquies, notably “The Abbot and the Learned\nLady” and “The New Mother”, acknowledge the\nintellectual aspirations of women (and in a winking manner, their\noccasional superiority to men).\n\nIn Erasmus’ time memorization and imitation were the predominant\nmethods of education. Anticipating modern principles, Erasmus\nemphasized the importance of understanding and internalizing the\nmaterial presented. This approach is examined at length in his\ntreatise Ciceronianus (The Ciceronian, 1528), which deals\nwith the imitation of Cicero’s style, a subject of burning\ninterest to Erasmus’ contemporaries (excellent analysis in\nChomarat 1981, 815–840). He emphasizes the importance of\naptum et decorum in compositions, that is, the\nappropriateness of arguments to time, place, and audience. This cannot\nbe achieved by a slavish imitation of classical models. It requires a\nsolid understanding of the rules underpinning style, which in turn\nwill allow a creative reworking of the original to meet the\nrequirements of the writer’s own circumstances.\n\n\nImitation does not immediately incorporate into its own speech any\nnice little feature it comes across, but transmits it to the mind for\ninward digestion, so that becoming part of our own system, it gives\nthe impression not of something begged from someone else, but of\nsomething that springs from our own mental processes. (CWE 28:\n441)\n\n\nThe gist of Erasmus’ arguments about imitation is drawn from\nclassical handbooks of rhetoric, such as Quintilian’s\nInstitutio Oratoria or Cicero’s Ad Herennium,\nbut Erasmus goes further, giving a Christian context to the classical\nprecepts. To satisfy the requirements of aptum et decorum, a\nChristian’s speech must savor of Christ, “or you will turn\nout not Ciceronian but pagan”. Indeed, this was the purpose of\nall education, “of studying philosophy, of studying eloquence,\nto know Christ, to celebrate the glory of Christ. This is the goal of\nall learning and all eloquence” (CWE 28: 447)\n4. Language and Literature\n\nThe formation and correct use of language was a primary concern for\nErasmus (as in Boyle 1977). He wrote several works that would seem to\nprovide a starting point for a philosophy of language. Indeed, he\ndevoted a treatise to the subject of language (De Lingua, The\nTongue, 1525), but no systematic thought on the nature, origin, or\nfunction of language emerges from this tractate. We find only isolated\ncomments about the relationship between words and things, for example,\nthe statement that things were intelligible only through words,\n“by the sounds we attach to them”. A person who did not\nunderstand the force of words was “short-sighted, deluded, and\nunbalanced in his judgment of things as well” (CWE 24: 666). The\ntreatise De Recta Pronuntiatione (The Right Way of Speaking,\n1528) contains another stand-alone pronouncement. Citing the ancient\nphysician Galen, Erasmus declares that language (oratio),\nrather than reason (ratio), was the distinguishing mark of\nhuman beings (CWE 26: 369). A promising statement in De Ratione\nStudii likewise remains without follow-up. “In principle,\nknowledge as a whole seems to be of two kinds, of things and of\nwords”, Erasmus states. “Knowledge of words comes earlier,\nbut that of things is the more important” (CWE 24: 666). These\nwords appear to introduce a theory resembling the duality of\nword/thing developed in Plato’s Cratylus or\nAristotle’s Metaphysics, but turn out to be only an\norganizational principle indicating to readers that Erasmus will talk\nfirst of language, then of content.\n\nOccasionally Erasmus uses metaphors to indicate the relationship\nbetween words and things, likening them to clothing /body\n(“style is to thought as clothes are to the body”, CWE 24:\n306) or vessel/content (“mystery concealed by the letter”,\nCWE 66: 32), but these expressions are no more than apt figures of\nspeech. Similarly, a statement in his annotations on the New Testament\nappears to be an instance of ideational epistemology. Commenting on\nJohn 1:1 (“In the beginning was the word”) and on the\nimplications of rendering Greek logos into Latin using\nsermo or verbum, Erasmus explains that\nverbum is used “of what sounds rather than of what is\nconceived in the mind”, although “things the voice\nexpresses are signs of the states that are present first in the\nmind” and therefore may also be called verbum. He adds:\n“Thinking is, as it were, talking to oneself” (CWE 73:\n35–6). In this case, too, Erasmus’ remarks remain without\nsolid context.\n\nSimilarly, Erasmus’ comments on the function of language as a\nmeans of communication appear significant at first sight. In the\nLingua, for example, he says: “The tongue was given to\nmen so that by its agency as messenger one man might know the mind and\nintention of another” (CWE 29: 314). He also acknowledges the\ncommunicative function in the Paraclesis, one of the prefaces\nto his New Testament edition: “for our daily conversation\nreflects in large measure what we are. Let each person understand what\nhe can; let each express what he can” (CWE 41: 412). Here as\nelsewhere Erasmus does not elaborate on his thoughts, and his\nstatements fall short of a philosophy of language.\n\nAnd yet, though he may not be a philosopher of language in any formal\nsense, he has been recognized as one of the founders of the modern\nconcept of literature (Cummings 2013). Throughout his work, Erasmus\nconducts a profound inquiry into literary mimesis, even and especially\nin regard to the gospels and their representation of Jesus Christ.\nFrom his engagement with sacred letters, there emerges a vital and\nchallenging theory of literature and a strong commitment to the\ncentral importance of literature for human life. This theory\nencompasses questions of literal and figurative meaning, of the\nlikeness of speech and thought, of the relationaship of res\nand verba, and of the primacy of verbal over visual\nrepresentation. All these issues may indeed be of interest to the\nphilosophy of language even when this philosophy eschews Scripture.\n\n5. Political Thought\n\nScholars investigating Erasmus’ political thought generally\nconsider the Institutio Principis Christiani (The Education\nof a Christian Prince, 1516) and the Panegyricus (Panegyric,\n1504 ) the main sources for his ideals (see Tracy 1978). For his views\non the legitimacy of warfare, they draw on the Querela Pacis\n(The Complaint of Peace, 1517) and the adage Dulce Bellum\nInexpertis (War is sweet to those who have not experienced it).\nThese sources are problematic, however, because of their strong\nrhetorical flavor and the commonplace nature of the arguments\npresented there. In fact it is possible to show a literal\ncorrespondence between passages in these works and the Copia,\nErasmus’ textbook of style, and Erasmus himself acknowledges\nthat The Education of a Christian Prince is a collection of\naphorisms (CWE 27: 204). It will serve as an additional caveat to\nreaders that Erasmus, who is often depicted as a pacifist, also wrote\na piece in praise of war—now lost, but documented in his\nCatalogue of Works (Ep. 1341A: 1455–57; CWE 9. I would not go so\nfar as to say that the (rhetorical) medium invalidates the message,\nbut it is important to support and reinforce any views expressed in\nErasmus’ epideictic writings with passages in more cogently\nargued works, notably his theological and polemical tracts. There are\ntwo treatises, contained within psalm commentaries, which are relevant\nto Erasmus’ pacifism: De Bello Turcico (On War Against\nthe Turks, 1530) and De Sarcienda Ecclesiae Concordia (On\nMending the Peace of the Church, 1533). Both recommend compromise and\narbitration as alternatives to warfare.\n\nErasmus first voices the idea of arbitration as a method of conflict\nresolution in The Education of a Christian Prince: “If\nsome dispute arises between princes, why do they not take it to\narbitration instead [of waging war]?” (CWE 27: 183) He suggests\na committee of churchmen, magistrates, and scholars to settle the\ndispute. Similar ideas are voiced in Dulce Bellum. Why not\ncall on bishops, nobles, and councils as intermediaries to\n“settle the childish disputes of princes by arbitration?”\n(CWE 35: 430). We may take this to be an authentic Erasmian point of\nview because it appears not only in these rhetorical compositions but\nalso in his psalm commentary, De Concordia. There it is\npresented not merely as a general proposition but given a more\nspecific context. Erasmus suggests that the religious strife which\ncharacterized his age be settled by a general council of the\nchurch—a desire also voiced in contemporary religious colloquies\nand Imperial Diets and realized after long delay in the Council of\nTrent. Erasmus furthermore counseled the parties to find a middle\nground and make concessions. He called this process\nsynkatabasis (CWE 65: 201), a military term denoting a move\nin which two armies give up their vantage point and descend into the\nopen plain to negotiate.\n\nErasmus does not entirely reject warfare, although he depicts it as a\nlast resource. In his rhetorical tracts he waxes eloquent about the\nhorrors of war and the destruction inflicted on the population. He\ncalls war fundamentally unchristian and fit for beasts rather than\nhumans. In his annotations on the New Testament (Luke 22: 36) he wrote\nin a more sober tone about war and the circumstances under which it\nwas legitimate. By that time Erasmus’ pacifism and strong\nrejection of warfare had been called heretical, that is, at variance\nwith the accepted definition of just war. Erasmus amended his\nannotation accordingly. The expanded and finely nuanced version of\n1527 serves as clear testimony to his views on the subject. He begins\nby quoting St. Martin and St. Jerome condemning war. He then\nsuccinctly states his own opinion:\n\n\nWe should not propagate the Christian religion only with arms, nor\nshould princes undertake war when it can be avoided by using other\nmeans. They should, moreover, conduct a war they have undertaken with\na minimum of bloodshed and end it as quickly as possible. Finally,\n[war] is not compatible with the purity of the gospel, and we must not\nseek to derive the right to go to war from gospel\nprecepts…There are many necessary evils in human affairs, which\nare tolerated because they prevent greater evils; yet they are not\napproved as gospel teaching. (ASD VI-5: 594)\n\n\nErasmus’ praise of peace and concord is informed by the\nChristian ideal of a universal fellowship. “Why don’t you\nwish [your neighbour] well as another man and a fellow\nChristian?” he asks in The Complaint of Peace (CWE 27:\n315). The theme is also taken up in War Against the Turks.\nThere Erasmus concedes that the war against the Ottoman Empire is\n“just” by the definition of the Church, but disparages a\nmilitary solution and promotes instead the idea of using spiritual\nweapons. He depicts the Turks as a scourge of God (an idea promoted\nalso by Luther) and therefore urges his contemporaries to repent and\nreform to appease God and overcome the enemy.\n\nThe Institutio Principis and the Panegyricus are\naddressed to Charles (later Emperor Charles V) and his father Philip\nrespectively. They belong to the genre of Mirror of Princes, in which\nthe ideal of a ruler is held up as a model to be imitated. The\nErasmian model prince is a father figure who has the wellbeing of his\npeople at heart. He is the guardian of justice and provides moral\nleadership. He is God’s representative and as such owed\nobedience. Conversely, the ruler must give an account of his\nstewardship to God. Although “it is pretty well agreed among the\nphilosophers that the most healthy form [of government] is\nmonarchy”, Erasmus believes that monarchy should be\n“checked and diluted with a mixture of aristocracy and democracy\nto prevent it ever breaking out into tyranny” (CWE 27: 231). It\nis not entirely clear what Erasmus meant by “democracy”.\nIt may be no more than a loose reference to the cooperation of the\nsubjects with their ruler. The best situation is for people to obey\nvoluntarily, Erasmus says (CWE 27: 236). Alternatively he may be\nthinking of the historical roots of kingship when he says that\n“it takes general agreement to make a prince” and\n“government depends to a large extent on the consent of the\npeople, which was what created kings in the first place” (CWE\n27: 284). Some of the qualifications and limitations he imposes on\nabsolute monarchy are based on the Christian ideals of charity and\nfellowship. Echoing Plato, Erasmus believes that the best ruler must\nbe a philosopher, that is, a wise man,\n\n\nnot someone who is clever at dialectics or science but someone who\nrejects illusory appearance and undauntedly seeks out and follows what\nis true and good.\n\n\nBeing a philosopher is in practice the same as being a Christian, he\nnotes (CWE 27: 214). The ruler must not shirk his moral obligations.\n“Power without goodness is unmitigated tyranny” (CWE 27:\n220). In an even more radical tone, Erasmus declares: “If you\ncannot defend your kingdom without violating justice…then\nabdicate” (CWE 27: 217).\n\nThe prince’s rights need to be balanced against the welfare of\nhis people.\n\n\nThe good prince uses the public interest as a yardstick in every\nfield, otherwise he is no prince. He has not the same rights over men\nas over cattle. (CWE 27: 284)\n\n\nThe duties and obligations are mutual. Neither the ruler nor his\nsubjects are above the law: “The happiest situation arises when\nthe prince is obeyed by all and himself obeys the laws” (CWE 27:\n264). Many of the ideas voiced in The Education of the Christian\nPrince also appear in the Panegyric, but are expressed\nthere in more fulsome terms and, to the modern ear, with excessive\nflattery. The message is the same, however. The prince is God’s\nrepresentative and his steward and “ought never to take his eyes\noff his model, …Christ, the prince of princes” (CWE 27:\n56–7).\n\nDescribing the hierarchy preserved in the ideal state, Erasmus draws\non the traditional medieval image of the three estates—clergy,\nnobility, and common people—arranged in three concentric circles\naround the central figure of Christ. This suggests a political and\nmoral hierarchy with specific duties assigned to each tier. While\neveryone “according to the measure that is given him must strive\nupwards toward Christ”, the hierarchical arrangement also\ninvolves a responsibility to those in the tier below. Explaining the\nimage, Erasmus notes that this monarchic order is divinely instituted,\nand those who fight it, “fight against God its author”\n(CWE 42: 74). Thus kings, the representatives of Christ, must be\nobeyed even if they are corrupt,\n\n\nbecause they administer public justice and because God is justice;\nthey are the ministers of God and in a way rule for him as long as\nthey apply their efforts to the mandate given them by public\nauthority. (CWE 42: 75)\n\n\nIndeed, “Order is a good in itself” (CWE 42: 74). There\nare multiple roots for the idea of mutual obligations among the\nmembers of a society. It is the foundation of the Medieval feudal\nsystem and embedded in the paternalistic biblical model. It also\nresembles the virtue of justice as defined in Plato’s\nRepublic, with each member of society maintaining their\nproper place and a higher position entailing higher moral authority\nand corresponding responsibilities.\n\nOutlining his ideals, Erasmus thus makes use of concepts found in\nclassical philosophers and Christianizes or adapts them to specific\nrhetorical needs. The persistence of key elements in his thought over\na lifetime and in diverse literary genres would indicate that these\nideas, even if they fall short of a philosophy, developed into a habit\nof mind that can be labeled “Erasmian”. This applies more\nparticularly to his views on pietas.\n6. Pietas and Philosophia Christi\n\nThe term philosophia Christi , the philosophy of Christ,\nfirst appears in patristic writings. It is an aspect of the larger\nconcept of pietas, the moral conscience governing the proper\nrelationship between individual and God as well as the individual and\nsociety. A central tenet in Erasmus’ spiritual writings,\npietas thus straddles the subjects of theology and\nphilosophy.\n\nThe main sources for Erasmus’ concepts of piety and the\nphilosophy centered on Christ are his Enchiridion Militis\nChristiani (Handbook of the Christian Soldier, 1503) with its\nprefatory letter to the 1518 edition (Ep. 858; CWE 6), the\nParaclesis (Summons, 1516) and, perhaps\nsurprisingly, his lampoon of human foibles, Moriae Encomium\n(The Praise of Folly, 1511). As he said in reply to indignant critics\nof his famous jeu d’esprit:\n\n\nThe Folly is concerned in a playful spirit with the same\nsubject as the Handbook of the Christian Soldier. My purpose\nwas guidance and not satire; to help, not to hurt; to show men how to\nbecome better, and not stand in their way…not only to cure them\nbut to amuse them, too. I had often observed that this cheerful and\nhumorous style of putting people right is with many of them most\nsuccessful. (Ep. 337: 98–101, 126–8; CWE 3)\n\n\nWhile the Paraclesis, the Enchiridion, and the\nMoriae Encomium constitute the main sources for\nErasmus’ thoughts on Christian morality, this theme is so\npervasive in his works, that any attempt to define his concept of\npietas “would be almost tantamount to summarizing and\nsynthesizing everything that has been written on Erasmus”\n(O’Malley in CWE 66: xv). Three characteristics stand out,\nhowever. Piety is an internal quality independent of the outward\nobservance of rites; it is perfected through divine grace; and it is\ninclusive, that is, open to all.\n\nErasmus calls pietas a quality of the mind (animi\naffectus, LB X: 1675 B) which is expressed in a person’s\nway of life. Describing human nature, he notes the dichotomy of spirit\nand flesh which parallels the duality of visible and invisible things.\nPiety requires the development of a person’s inner, spiritual\nqualities:\n\n\n[A person] participates in the visible world through the body, and in\nthe invisible through the soul. Since we are but pilgrims in the\nvisible world, we should never make it our fixed abode, but should\nrelate by a fitting comparison everything that occurs to the senses\neither to the angelic world or, in more practical terms, to morals and\nto that part of man that corresponds to the angelic. (CWE 66: 65)\n\n\nErasmus’ emphasis on piety as an inner quality is a response to\nthe undue importance his contemporaries placed on external ceremonies.\nHe offered his definition as an alternative or rather, a corrective to\nthe ritualistic observances which he calls “a kind of\nJudaism” (CWE 66: 74). He used the term “Judaism”\nbecause in his eyes the rigid observance of rites exemplified the\nspirit of the Old Testament, which had been superseded by the new\ncovenant with Christ. His critique of ritualistic practices puts him\nin the vanguard of the Reformation, whose representatives also\nprotested against the emptiness of ceremonies in the absence of\nsincere faith. Like Luther, Erasmus demanded “Christian\nliberty”, that is, deliverance from the dead letter of the\nlaw.\n\nFor Erasmus, monasticism typified the superstitious observance of\nexternal rites and the reliance on human works instead of divine\ngrace. In a notorious phrase, he declared: Monachatus non est\npietas, being a member of a religious order does not amount to\npiety. “I advise you to identify piety not with diet, or dress,\nor any visible thing, but with what I have taught here [in the\nEnchiridion]”—the priority of soul over body and\nof the inner over the outer person (CWE 66: 127).\n\nThe question of Erasmus’ affiliation with ancient schools of\nphilosophy comes up often in Erasmus scholarship. Some scholars have\nassociated Erasmus’ dualism with Platonic philosophy, although\nit is more readily explained as a Christian principle and more\nspecifically as Pauline teaching, which Erasmus discusses at length in\nthe Enchiridion. He does quote Plato as well, but then it is\nhis habit to cite classical sources in order to give a historical and\npan-cultural dimension to Christian values. Indeed he drew on a number\nof models, both pagan and Christian, to describe human nature. Thus he\nalso introduced the concept of a three-fold division—body, soul,\nand spirit—an idea for which he cited Origen. Scholars have also\npointed to the Stoic underpinnings found in Erasmus’ thoughts on\npietas and even argued that he consciously embraced the Stoic\nconcept of the simultaneous working of two opposite but equally\nessential types of value: spirit and instinct (Dealy 2017). Many years\nago, R. Bultot studied the Epicurean tendencies of the early work,\nOn disdaining the World, in which Erasmus speaks of the\nspiritual pleasures of the solitary life, calling its rationale\n“Epicurean” (Bultot in Coppens 1969, 2: 205–238).\nMore recently, John Monfasani has emphasized the role of Christian\nEpicureanism in Erasmus’ work (Monfasani 2012). Most famously,\nRichard Popkin highlights the role of Erasmus in the revival of\nSkepticism in early modern Europe (Popkin 1964). For her part, Maria\nCytowska classifies Erasmus as an eclectic philosopher, indeed a\n“Christian eclectic”, who chooses among ancient philosophy\nwhatever is closest to Christian religion (Cytowska 1976). In the\nEnchiridion, Erasmus does not privilege one philosophy over\nanother but deliberately presents various concepts of human nature by\nway of offering a survey of philosophical positions. He\n“provided a mass of material” (CWE 66: 54), illustrating\nin a general way the superiority of spiritual over material concerns.\nHis message to the reader was: You should be able to master as a\nChristian and for the love of God “what pagan philosophers did\nnot find hard…for the sake of learning or reputation”\n(CWE 66: 142).\n\nErasmus described his Enchiridion as a “summary\nguide” to Christian living, which included not only personal,\nbut also public piety. In its social dimension, pietas equals\ncaritas, love of one’s neighbor. Caritas in\nturn parallels love of God. Caring for one’s neighbor is\n“how our heavenly creditor taught us to pay our debt” (CWE\n66: 124).\n\nThe ability to fulfill one’s moral duty depends on divine grace,\nhowever, and is an aspect of pietas related to the Catholic\ndoctrine of Free Will. Thus human beings have a capacity for piety and\na moral duty as well as the power to do good, although their power is\nlimited and dependent on the efficacy of divine grace. Erasmus is\nemphatic about this aspect in his definition of the philosophia\nChristi, that is, the pursuit of pietas. In a letter to\nJan Slechta (1519), he writes:\n\n\nThe whole of Christian philosophy lies in this, our understanding that\nall our hope is placed in God, who freely gives us all things through\nJesus his son, that we were redeemed by his death and engrafted\nthrough baptism with his body, that we might be dead to the desires of\nthis world and live by his teaching and example…that we may\never advance from one virtue to another, yet in such a way that we\nclaim nothing for ourselves, but ascribe any good we do to God. (Ep.\n1039: 245–54; CWE 7)\n\n\nThe Erasmian concept of piety was “principled rather than\nprescriptive” (as O’Malley puts it, CWE 66: xix). It is\nironic (and perhaps meant ironically) that Erasmus chose to present\nhis counsel in the form of twenty-two rules since his overall message\nis that there are no fixed rules and no need for definitions and\npronouncements. These are the hallmark of institutional theology,\nwhereas the philosophy of Christ does not require formal training or\nattendance at university. It is open to anyone: “no one is\nprevented from being godly; and, I shall boldly add, no one is\nprevented from being a theologian” (CWE 41: 415). Every\nChristian must study the bible, however, Erasmus says.\n\n\nI would like every woman to read the Gospel, to read the Epistles of\nPaul. And oh, that these books were translated into every tongue of\nevery land so that not only the Scots and the Irish, but Turks and\nSaracens too could read and get to know them…How I wish that\nthe farmer at his plow would chant some passage from these books, that\nthe weaver at his shuttles would sing something from them; that the\ntraveler would relieve the tedium of his journey with stories of this\nkind. (CWE 41: 411)\n\n\nPietas does not depend on learning. Faith is the only\nprerequisite. This is the conclusion Erasmus offers in The Praise\nof Folly. He begins his satire showing off his classical learning\nand ends it paradoxically by praising the devout fool. Those who scorn\nthe world are considered fools or madmen by the majority of people,\nErasmus says, but they will inherit God’s kingdom and in their\necstasy “feel some foretaste and savour of the reward to\ncome” (CWE 27: 152).\n\nPraising Christian folly in such extravagant terms, Erasmus seems to\nalign himself with the radical mystics who considered human\nintelligence worthless and studies futile. As we have seen, however,\neducation is a central concern for Erasmus, and what seems like a\ncontradiction, is merely a matter of priorities. Erasmus urges\neveryone to pursue learning, as long as it plays a supportive role to\nfaith. He repeatedly praises docta pietas, piety which\ncombines learning with a devout and humble spirit and warns against\nits opposite, impia curiositas, unholy inquisitiveness.\nDocta pietas means respecting the limits of human\nunderstanding.\n\n\nWhat is granted to you to see, fall down before it and kiss it; what\nis not granted to see--this, though concealed, worship nevertheless\nfrom afar in sincere faith, and venerate whatever it is. Let ungodly\ncuriosity be absent [absit impia curiositas],\n\n\nhe counsels students of theology in the Ratio (Vessey 2021,\n117). For Erasmus, St. Jerome is the embodiment of docta\npietas. In his Life of Jerome (which prefaces his\nedition of the works of the Church Father, 1516), he depicted him as\nthe Christian scholar par excellence, combining Ciceronian\neloquence with a thorough understanding of theology and a devout\nspirit with a holy life.\n\nIn the Paraclesis Erasmus distinguished the simple philosophy\nof Christ from that of Plato, Aristotle, and other philosophical\nwriters of antiquity, pointing out that the gospel provided the only\ncertain doctrine and Christ was the only true teacher (CWE 41: 408).\nFor Erasmus learning and knowledge were qualities that had no value\nunless they centered on Christ and contributed to an understanding of\nthe philosophia Christi. Even language studies, which formed\nthe core of his curriculum proposal, had to be subordinated to that\ngoal. He wished for an eloquence\n\n\nwhich does not simply charm the ears by a pleasure soon to die, but\nwhich leaves barbs clinging in the hearts of those who hear; an\neloquence that seizes, transforms, and sends the listener away a much\ndifferent person from the one it received. (CWE 41: 406)\n\n\nThis is the goal of a preacher’s eloquence, as Erasmus explains\nin the Ecclesiastes (The Evangelical Preacher, 1535). There\nhe adapts the threefold task Cicero envisages for the speaker—to\ninstruct, to move, to entertain—and develops the idea that the\ninspired words of a preacher will not only move but transform the\nlisteners, that the preacher’s sermon will captivate not only\nthe mind but also the soul of the hearers. This ability is “a\ngift of the Holy Spirit” however (CWE 67: 283).\n\nAlthough Erasmus’ curriculum focused on the authors of classical\nantiquity, the philosophy of Christ required the adaption of pagan\nideas to Christian thought and their application to Christian ideals,\na process Erasmus called (after Augustine) “spoiling the\nEgyptians”. Accordingly he urges the preacher in the\nEcclesiastes to select suitable material from classical\nwriters but inject a Christian perspective. Erasmus himself edited and\ntranslated a number of pagan writers whose teachings he considered\ngermane to the philosophy of Christ. Among them, he singled out\nPlutarch: “I have read nothing outside of Scripture with such a\nhigh moral tone” (Ep. 1341A: 259–60; CWE 9). He had high\npraise also for the Platonists, “because in much of their\nthinking as well as in their mode of expression they are the closest\nto the spirit of the prophets and the gospel” ( CWE 66: 33).\n\nErasmus was a prolific writer. His works were translated into the\nvernacular and circulated widely. His ideas had a strong impact that\ncan be traced into the modern age. Even in his own time, the term\n“Erasmian” denoted a certain set of values. In 1530, the\nLeuven theologian Frans Titelmans noted that enthusiasts of humanistic\nstudies were called “Erasmians” because Erasmus was their\nchief inspiration (1530, Ei verso–Eii recto). His contemporary,\nthe Swiss chronicler Johann Kessler, declared that “whatever is\nskilled, polished, learned, and wise is called Erasmian”\n(1523–1539, 87). It was classical learning and eloquence that\ndefined Erasmus in his own time, and modern scholarship has come to\nrecognize the role that Erasmus played in the cultivation of his own\nimage (see Jardine 1993). In the Age of Enlightenment he was\ncelebrated as a rationalist, an image that held into the\n20th century (as chronicled by Mansfield 1992). Wilhelm\nDilthey, for example, called Erasmus the Voltaire of the\n16th century (GS II, 74). The emphasis shifted in the\n20th century, when Erasmus’ irenicism caught\nreaders’ attention. Thus José Chapiro (1950) dedicated\nhis translation of The Complaint of Peace to the United\nNations, and Erasmus’ biographer Johan Huizinga identified\n“Erasmian” with “gentleness, kindliness, and\nmoderation” (1912 [1957], 194). In 1999, Ralf Dahrendorf defined\nErasmus-Menschen as people guided by reason and avoiding the\npitfalls of political extremism. Their hallmark was compassion and\ntolerance. In contemporary usage, then, “Erasmian” has\ncome to denote a liberal thinker, an attitude or modus\nvivendi rather than a school of philosophy. The newest trend\nemerging from contemporary scholarship is to recognize Erasmus as one\nof the makers of the modern book, due to his collaboration with\nprinters and book sellers and his indefatigable efforts as editor of\nclassical and patristic texts (see Vanautgaerden 2012).\n",
    "bibliography": {
        "categories": [
            "Erasmus’ Works",
            "Other Primary Works",
            "Biographies",
            "Secondary Works"
        ],
        "cat_ref_text": {
            "Erasmus’ Works": [
                "</h3>\n<p>\nFor a repertory of individual works and their early editions, see\nFerdinand Van der Haeghen, <em>Bibliotheca Erasmiana:\nRépertoire des oeuvres d’Erasme</em> (first published\n1897, most recent reprinted Würzburg: Osthoff, 2005).</p>\n<p>\nErasmus’ <em>Opera Omnia</em> were first published in Basel:\nFroben, 1540. The arrangement of works adopted there has become the\nmodel for later editions. An authoritative critical edition (ASD) and\nan English translation (CWE) of his works are ongoing.</p>\n<ul class=\"hanging\">",
                "[Allen] <em>Opus Epistolarum Des. Erasmi Roterodami</em>, 12\nvols., edited by P.S. Allen and others, Oxford: Oxford University\nPress, 1906–1958. doi:10.1093/actrade/9780198203414.book.1",
                "[ASD] <em>Opera Omnia Des. Erasmi Roterodami</em>, (no primary\neditor), Amsterdam: North Holland Press, 1969–. In 9\n<em>ordines</em> or categories, each of which has multiple\nvolumes.",
                "[CWE] <em>The Collected Works of Erasmus</em>, (no primary\neditor), Toronto: University of Toronto Press, 1974–.",
                "[LB] <em>Opera Omnia Des. Erasmi Roterodami</em>, 10 vols. Leiden:\nPeter van der Aa, 1703–1706.\n</ul>\n<p>\nTexts not (or not yet) included in these editions:</p>\n<ul class=\"hanging\">",
                "Ferguson, Wallace K. (ed.), <em>Erasmi Opuscula. A Supplement to\nthe Opera Omnia</em>, The Hague: Martinus Nijhoff, 1933.",
                "[Holborn] Holborn, Hajo and Annemarie Holborn (eds.),\n<em>Desiderius Erasmus Roterodamus: Ausgewählte Werke</em>,\nMunich: Beck, 1933.\n</ul>\n<h3 id=\"OthePrimWork\">"
            ],
            "Other Primary Works": [
                "</h3>\n<ul class=\"hanging\">",
                "Beda, Noël, 1526, “A Scholastic Response to Biblical\nHumanism: Noël Beda Against Lefèvre D’Etaples and\nErasmus (1526)”, Mark Crane (trans.), <em>Humanistica\nLovaniensia</em>, 59: 55–81, 2010.",
                "Dilthey, Wilhelm, [GS II], <em>Gesammelte Schriften II:\nWeltanschauung und Analyse des Menschen seit Renaissance und\nReformation</em>, (<em>World-intuition and the Analysis of Humanity\nSince the Renaissance and Reformation</em>), Stuttgart: B.G. Teubner\nVerlagsgesellschaft, 1957.",
                "Kessler, Johan, 1523–1539, <em>Johannes Kesslers\nSabbata</em>, Emil Egli &amp; Rudolf Schoch (eds.), St. Gallen:\nVormals Huber &amp; Co., 1902.",
                "Pico della Mirandola, 1496, <em>On the Dignity of Man</em>, A.\nRobert Caponigri (trans.), Washington, DC: Regnery Publishing,\n1996.",
                "Titelmans, Frans, 1530, <em>Epistola apologetica … pro\nopere Collationum</em>, Antwerp: Grapheus.\n</ul>\n<h3 id=\"Biog\">"
            ],
            "Biographies": [
                "</h3>\n<ul class=\"hanging\">",
                "Augustijn, Cornelis, 1991, <em>Erasmus: His Life, Works, and\nInfluence</em> (<em>Erasmus von Rotterdam: Leben, Werk, Wirkung</em>),\nJ.C. Grayson (trans.), Toronto: University of Toronto Press;\noriginally published in 1986.",
                "Christ von Wedel, Christine, 2013, <em>Erasmus of Rotterdam:\nAdvocate of a New Christianity</em> (<em>Erasmus von Rotterdam: Anwalt\neines neuzeitlichen Christentums</em>), Toronto: University of Toronto\nPress; originally published in 2003.",
                "Halkin, Léon-Ernest, 1993, <em>Erasmus: A Critical\nBiography</em> (<em>Erasme parmi nous</em>), John Tonkin (trans.),\nOxford: Blackwell; originally published 1987.",
                "Huizinga, Johan, 1912 [1957], <em>Erasmus and the Age of\nReformation</em>, F. Hopman (trans.), New York: Harper.",
                "Margolin, Jean-Claude, 1995, <em>Érasme précepteur\nde l’Europe</em>, Paris: Julliard.",
                "McConica, James K., 1991, <em>Erasmus</em>, Oxford: Oxford\nUniversity Press.",
                "Rummel, Erika, 2004, <em>Erasmus</em>, London: Continuum\nPress.",
                "Schoeck, Richard J., 1990–1993, <em>Erasmus of Europe</em>,\nEdinburgh: Edinburgh University Press.\n\n<ul class=\"hanging\">",
                "1990, Vol. 1: <em>The Making of a Humanist,\n1467–1500</em>",
                "1993, Vol. 2: <em>The Prince of Humanists,\n1501–1536</em>\n</ul>",
                "Tracy, James D., 1972, <em>Erasmus: The Growth of a Mind</em>,\n(Travaux d’humanisme et Renaissance, 126), Geneva: Droz.\n</ul>\n<h3 id=\"SecoWork\">"
            ],
            "Secondary Works": [
                "</h3>\n<ul class=\"hanging\">",
                "Bejczy, Istvan, 2001, <em>Erasmus and the Middle Ages: The\nHistorical Consciousness of a Christian Humanist</em>, Leiden:\nBrill.",
                "Béné, Charles, 1969, É<em>rasme et Saint\nAugustin, ou Influence de Saint Augustin sur l’humanisme\nd’Érasme</em>, Geneva: Droz,",
                "Bentley, Jerry H., 1983, <em>Humanists and Holy Writ: New\nTestament Scholarship in the Renaissance</em>, Princeton: Princeton\nUniversity Press.",
                "Bierlaire, Franz, 1978, <em>Les colloques d’Erasme:\nréforme des études, réforme des moeurs et\nréforme de l’Eglise au XVIe siècle</em>, Paris:\nLes Belles Lettres.",
                "Bietenholz, Peter, 2009, <em>Encounters With a Radical Erasmus:\nErasmus’ Work as a Source of Radical Thought in Early Modern\nEurope</em>, Toronto: University of Toronto Press.",
                "Boyle, Marjorie O’Rourke, 1977, <em>Erasmus on Language and\nMethod in Theology</em>, Toronto: University of Toronto Press.",
                "–––, 1981, <em>Christening Pagan Mysteries:\nErasmus in Pursuit of Wisdom</em>, Toronto: University of Toronto\nPress.",
                "–––, 1983, <em>Rhetoric and Reform:\nErasmus’ Civil Dispute with Luther</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "Chomarat, Jacques, 1981, <em>Grammaire et rhétorique chez\nÉrasme</em>, Paris: Les Belles Lettres.",
                "Christ von Wedel, Christine, 1981, <em>Das Nichtwissen bei Erasmus\nvon Rotterdam: Zum philosophischen und theologischen Erkennen in der\ngeistigen Entwicklung eines christlichen Humanisten</em>, Basel:\nHelbing &amp; Lichtenhan.",
                "Coppens, Joseph (ed.), 1969, <em>Scrinium Erasmianum</em>, 2\nvolumes, Leiden: Brill.",
                "Cummings, Brian, 2013, “Erasmus and the Invention of\nLiterature”, <em>Erasmus of Rotterdam Society Yearbook</em>, 33:\n22–54.",
                "Cytowska, Maria, 1976, “Erasme et la philosophie\nantique”, <em>Ziva Antika / Antiquité vivante</em>, 26:\n453–462.",
                "Dahrendorf, Ralf, “Erasmus-Menschen”, <em>Merkur,\nDeutsche Zeitschrift für europäisches Denken</em> 53:\n1063–1071.",
                "Dealy, Ross, 2017, <em>The Stoic Origins of Erasmus’\nPhilosophy of Christ</em>, Toronto: University of Toronto Press.",
                "De Molen, Richard, 1987, <em>The Spirituality of Erasmus</em>,\nNieuwkoop: De Graaf.",
                "Dodds, Gregory , 2009, <em>Exploiting Erasmus: The Erasmian Legacy\nand Religious Change in Early Modern England</em>, Toronto: University\nof Toronto Press.",
                "Dolfen, Christian, 1936, <em>Die Stellung des Erasmus von\nRotterdam zur scholastischen Methode</em>, Osnabrück: Meinders\n&amp; Elstermann.",
                "Eden, Kathy, 2001, <em>Friends Hold All Things in Common:\nTradition, Intellectual Property, and the Adages of Erasmus</em>, New\nHaven: Yale University Press.",
                "Godin, André, 1982, <em>Érasme lecteur\nd’Origène</em>, Geneva: Droz.",
                "Gordon, Walter M., 1990, <em>Humanist Play and Belief: The\nSeriocomic Art of Desiderius Erasmus</em>, Toronto: University of\nToronto Press.",
                "Herwaarden, Jan van, 2003, <em>Between Saint James and Erasmus.\nStudies in late-medieval religious life: Devotion and Pilgrimage in\nthe Netherlands</em>, (Studies in medieval and Reformation thought,\n97), Wendie Schaffter and Donald Gardner (trans.), Leiden: Brill.",
                "Hoffmann, Manfred, 1994, <em>Rhetoric and Theology: The\nHermeneutic of Erasmus</em>, Toronto: University of Toronto\nPress.",
                "Jardine, Lisa, 1993, <em>Erasmus, Man of Letters: The Construction\nof Charisma in Print</em>, Princeton: Princeton University Press.",
                "Jonge, Henk Jan de, 1984, “Novum Testamentum a nobis versum:\nThe Essence of Erasmus’ Edition of the New Testament”,\n<em>Journal of Theological Studies</em>, 35: 394–413.",
                "Kerlen, Dietrich, 1976, <em>Assertio: Die Entwicklung von Luthers\ntheologischem Anspruch und der Streit mit Erasmus von Rotterdam</em>,\nWiesbaden: Franz Steiner.",
                "Koerber, Eberhard von, 1967, <em>Die Staatstheorie des Erasmus von\nRotterdam</em>, Berlin: Duncker &amp; Humbolt.",
                "Kohls, Ernst–Wilhelm, 1966, <em>Die Theologie des\nErasmus</em>, 2 vols., Basel: F. Reinhardt.",
                "Mansfield, Bruce, 1992, <em>Man on his Own: Interpretations of\nErasmus c. 1750–1920</em>, Toronto: University of Toronto\nPress.",
                "Monfasani, John, 2012, “Erasmus and the Philosophers”,\n<em>Erasmus of Rotterdam Society Yearbook</em> (now <em>Erasmus\nStudies</em>), 32: 47–68. doi:10.1163/18749275-00000005",
                "Nauert, Charles G., 2006, <em>Humanism and the Culture of\nRenaissance Europe</em>, 2<sup>nd</sup> edition, Cambridge: Cambridge\nUniversity Press.",
                "Pabel, M. Hilmar (ed.), 1995, <em>Erasmus’ Vision of the\nChurch</em>, Kirksville: Sixteenth Century Journal Publishers.",
                "Popkin, Richard, 1964, <em>The History of Scepticism from Erasmus\nto Descartes</em>, New York: Harper &amp; Row.",
                "Rabil, Albert, 1972, <em>Erasmus and the New Testament: The Mind\nof a Christian Humanist</em>, San Antonio: Trinity University\nPress.",
                "Remer, Gary, 1996, <em>Humanism and the Rhetoric of\nToleration</em>, University Park: Pennsylvania State University\nPress.",
                "Rummel, Erika, 1995, <em>The Humanist-Scholastic Debate in the\nRenaissance and Reformation</em>, Cambridge, MA: Harvard University\nPress.",
                "–––, 2000, <em>The Confessionalization of\nHumanism in Reformation Germany</em>, New York: Oxford University\nPress.",
                "Ryle, Stephen (ed.), 2014, <em>Erasmus and the Renaissance\nRepublic of Letters</em>, Turnhout: Brepols.",
                "Steel, Carlos, 2008, “Erasmus and Aristotle”,\n<em>Erasmo da Rotterdam e la cultura europea / Erasmus of Rotterdam\nand European Culture. Atti dell’incontro di Studi nel V\nCentenario della Laurea di Erasmo all’Università di\nTorino</em>, Florence: Sismel, 149–174.",
                "Tracy, James D., 1978, <em>The Politics of Erasmus: A Pacifist\nIntellectual and His Political Milieu</em>, Toronto: University of\nToronto Press.",
                "Trapman, Hans, Jan van Herwaarden and Adrie van der Laan (eds.),\n2010, <em>Erasmus Politicus: Erasmus and Political Thought</em>,\nLeiden: Brill.",
                "Vanautgaerden, Alexandre, 2012, <em>Érasme typographe:\nHumanisme et imprimerie au début du XVIe siècle</em>,\nGeneva: Droz.",
                "Vessey, Mark (ed.), 2021, <em>Erasmus on Literature. His Ratio or\n‘System’ of 1518/1519</em>, Toronto: University of Toronto\nPress.",
                "Walter, Peter, 1991, <em>Theologie aus dem Geist der Rhetorik zur\nSchriftauslegung des Erasmus von Rotterdam</em>, Mainz:\nMathias-Grünewald-Verlag.",
                "Woodward, William, 1904 [1971], <em>. Desiderius Erasmus\nConcerning the Aim and Method of Education</em>; reprinted, New York:\nB. Franklin.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"ErasWork\">Erasmus’ Works</h3>\n<p>\nFor a repertory of individual works and their early editions, see\nFerdinand Van der Haeghen, <em>Bibliotheca Erasmiana:\nRépertoire des oeuvres d’Erasme</em> (first published\n1897, most recent reprinted Würzburg: Osthoff, 2005).</p>\n<p>\nErasmus’ <em>Opera Omnia</em> were first published in Basel:\nFroben, 1540. The arrangement of works adopted there has become the\nmodel for later editions. An authoritative critical edition (ASD) and\nan English translation (CWE) of his works are ongoing.</p>\n<ul class=\"hanging\">\n<li>[Allen] <em>Opus Epistolarum Des. Erasmi Roterodami</em>, 12\nvols., edited by P.S. Allen and others, Oxford: Oxford University\nPress, 1906–1958. doi:10.1093/actrade/9780198203414.book.1</li>\n<li>[ASD] <em>Opera Omnia Des. Erasmi Roterodami</em>, (no primary\neditor), Amsterdam: North Holland Press, 1969–. In 9\n<em>ordines</em> or categories, each of which has multiple\nvolumes.</li>\n<li>[CWE] <em>The Collected Works of Erasmus</em>, (no primary\neditor), Toronto: University of Toronto Press, 1974–.</li>\n<li>[LB] <em>Opera Omnia Des. Erasmi Roterodami</em>, 10 vols. Leiden:\nPeter van der Aa, 1703–1706.</li>\n</ul>\n<p>\nTexts not (or not yet) included in these editions:</p>\n<ul class=\"hanging\">\n<li>Ferguson, Wallace K. (ed.), <em>Erasmi Opuscula. A Supplement to\nthe Opera Omnia</em>, The Hague: Martinus Nijhoff, 1933.</li>\n<li>[Holborn] Holborn, Hajo and Annemarie Holborn (eds.),\n<em>Desiderius Erasmus Roterodamus: Ausgewählte Werke</em>,\nMunich: Beck, 1933.</li>\n</ul>\n<h3 id=\"OthePrimWork\">Other Primary Works</h3>\n<ul class=\"hanging\">\n<li>Beda, Noël, 1526, “A Scholastic Response to Biblical\nHumanism: Noël Beda Against Lefèvre D’Etaples and\nErasmus (1526)”, Mark Crane (trans.), <em>Humanistica\nLovaniensia</em>, 59: 55–81, 2010.</li>\n<li>Dilthey, Wilhelm, [GS II], <em>Gesammelte Schriften II:\nWeltanschauung und Analyse des Menschen seit Renaissance und\nReformation</em>, (<em>World-intuition and the Analysis of Humanity\nSince the Renaissance and Reformation</em>), Stuttgart: B.G. Teubner\nVerlagsgesellschaft, 1957.</li>\n<li>Kessler, Johan, 1523–1539, <em>Johannes Kesslers\nSabbata</em>, Emil Egli &amp; Rudolf Schoch (eds.), St. Gallen:\nVormals Huber &amp; Co., 1902.</li>\n<li>Pico della Mirandola, 1496, <em>On the Dignity of Man</em>, A.\nRobert Caponigri (trans.), Washington, DC: Regnery Publishing,\n1996.</li>\n<li>Titelmans, Frans, 1530, <em>Epistola apologetica … pro\nopere Collationum</em>, Antwerp: Grapheus.</li>\n</ul>\n<h3 id=\"Biog\">Biographies</h3>\n<ul class=\"hanging\">\n<li>Augustijn, Cornelis, 1991, <em>Erasmus: His Life, Works, and\nInfluence</em> (<em>Erasmus von Rotterdam: Leben, Werk, Wirkung</em>),\nJ.C. Grayson (trans.), Toronto: University of Toronto Press;\noriginally published in 1986.</li>\n<li>Christ von Wedel, Christine, 2013, <em>Erasmus of Rotterdam:\nAdvocate of a New Christianity</em> (<em>Erasmus von Rotterdam: Anwalt\neines neuzeitlichen Christentums</em>), Toronto: University of Toronto\nPress; originally published in 2003.</li>\n<li>Halkin, Léon-Ernest, 1993, <em>Erasmus: A Critical\nBiography</em> (<em>Erasme parmi nous</em>), John Tonkin (trans.),\nOxford: Blackwell; originally published 1987.</li>\n<li>Huizinga, Johan, 1912 [1957], <em>Erasmus and the Age of\nReformation</em>, F. Hopman (trans.), New York: Harper.</li>\n<li>Margolin, Jean-Claude, 1995, <em>Érasme précepteur\nde l’Europe</em>, Paris: Julliard.</li>\n<li>McConica, James K., 1991, <em>Erasmus</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Rummel, Erika, 2004, <em>Erasmus</em>, London: Continuum\nPress.</li>\n<li>Schoeck, Richard J., 1990–1993, <em>Erasmus of Europe</em>,\nEdinburgh: Edinburgh University Press.\n\n<ul class=\"hanging\">\n<li>1990, Vol. 1: <em>The Making of a Humanist,\n1467–1500</em></li>\n<li>1993, Vol. 2: <em>The Prince of Humanists,\n1501–1536</em></li>\n</ul> </li>\n<li>Tracy, James D., 1972, <em>Erasmus: The Growth of a Mind</em>,\n(Travaux d’humanisme et Renaissance, 126), Geneva: Droz.</li>\n</ul>\n<h3 id=\"SecoWork\">Secondary Works</h3>\n<ul class=\"hanging\">\n<li>Bejczy, Istvan, 2001, <em>Erasmus and the Middle Ages: The\nHistorical Consciousness of a Christian Humanist</em>, Leiden:\nBrill.</li>\n<li>Béné, Charles, 1969, É<em>rasme et Saint\nAugustin, ou Influence de Saint Augustin sur l’humanisme\nd’Érasme</em>, Geneva: Droz,</li>\n<li>Bentley, Jerry H., 1983, <em>Humanists and Holy Writ: New\nTestament Scholarship in the Renaissance</em>, Princeton: Princeton\nUniversity Press.</li>\n<li>Bierlaire, Franz, 1978, <em>Les colloques d’Erasme:\nréforme des études, réforme des moeurs et\nréforme de l’Eglise au XVIe siècle</em>, Paris:\nLes Belles Lettres.</li>\n<li>Bietenholz, Peter, 2009, <em>Encounters With a Radical Erasmus:\nErasmus’ Work as a Source of Radical Thought in Early Modern\nEurope</em>, Toronto: University of Toronto Press.</li>\n<li>Boyle, Marjorie O’Rourke, 1977, <em>Erasmus on Language and\nMethod in Theology</em>, Toronto: University of Toronto Press.</li>\n<li>–––, 1981, <em>Christening Pagan Mysteries:\nErasmus in Pursuit of Wisdom</em>, Toronto: University of Toronto\nPress.</li>\n<li>–––, 1983, <em>Rhetoric and Reform:\nErasmus’ Civil Dispute with Luther</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>Chomarat, Jacques, 1981, <em>Grammaire et rhétorique chez\nÉrasme</em>, Paris: Les Belles Lettres.</li>\n<li>Christ von Wedel, Christine, 1981, <em>Das Nichtwissen bei Erasmus\nvon Rotterdam: Zum philosophischen und theologischen Erkennen in der\ngeistigen Entwicklung eines christlichen Humanisten</em>, Basel:\nHelbing &amp; Lichtenhan.</li>\n<li>Coppens, Joseph (ed.), 1969, <em>Scrinium Erasmianum</em>, 2\nvolumes, Leiden: Brill.</li>\n<li>Cummings, Brian, 2013, “Erasmus and the Invention of\nLiterature”, <em>Erasmus of Rotterdam Society Yearbook</em>, 33:\n22–54.</li>\n<li>Cytowska, Maria, 1976, “Erasme et la philosophie\nantique”, <em>Ziva Antika / Antiquité vivante</em>, 26:\n453–462.</li>\n<li>Dahrendorf, Ralf, “Erasmus-Menschen”, <em>Merkur,\nDeutsche Zeitschrift für europäisches Denken</em> 53:\n1063–1071.</li>\n<li>Dealy, Ross, 2017, <em>The Stoic Origins of Erasmus’\nPhilosophy of Christ</em>, Toronto: University of Toronto Press.</li>\n<li>De Molen, Richard, 1987, <em>The Spirituality of Erasmus</em>,\nNieuwkoop: De Graaf.</li>\n<li>Dodds, Gregory , 2009, <em>Exploiting Erasmus: The Erasmian Legacy\nand Religious Change in Early Modern England</em>, Toronto: University\nof Toronto Press.</li>\n<li>Dolfen, Christian, 1936, <em>Die Stellung des Erasmus von\nRotterdam zur scholastischen Methode</em>, Osnabrück: Meinders\n&amp; Elstermann.</li>\n<li>Eden, Kathy, 2001, <em>Friends Hold All Things in Common:\nTradition, Intellectual Property, and the Adages of Erasmus</em>, New\nHaven: Yale University Press.</li>\n<li>Godin, André, 1982, <em>Érasme lecteur\nd’Origène</em>, Geneva: Droz.</li>\n<li>Gordon, Walter M., 1990, <em>Humanist Play and Belief: The\nSeriocomic Art of Desiderius Erasmus</em>, Toronto: University of\nToronto Press.</li>\n<li>Herwaarden, Jan van, 2003, <em>Between Saint James and Erasmus.\nStudies in late-medieval religious life: Devotion and Pilgrimage in\nthe Netherlands</em>, (Studies in medieval and Reformation thought,\n97), Wendie Schaffter and Donald Gardner (trans.), Leiden: Brill.</li>\n<li>Hoffmann, Manfred, 1994, <em>Rhetoric and Theology: The\nHermeneutic of Erasmus</em>, Toronto: University of Toronto\nPress.</li>\n<li>Jardine, Lisa, 1993, <em>Erasmus, Man of Letters: The Construction\nof Charisma in Print</em>, Princeton: Princeton University Press.</li>\n<li>Jonge, Henk Jan de, 1984, “Novum Testamentum a nobis versum:\nThe Essence of Erasmus’ Edition of the New Testament”,\n<em>Journal of Theological Studies</em>, 35: 394–413.</li>\n<li>Kerlen, Dietrich, 1976, <em>Assertio: Die Entwicklung von Luthers\ntheologischem Anspruch und der Streit mit Erasmus von Rotterdam</em>,\nWiesbaden: Franz Steiner.</li>\n<li>Koerber, Eberhard von, 1967, <em>Die Staatstheorie des Erasmus von\nRotterdam</em>, Berlin: Duncker &amp; Humbolt.</li>\n<li>Kohls, Ernst–Wilhelm, 1966, <em>Die Theologie des\nErasmus</em>, 2 vols., Basel: F. Reinhardt.</li>\n<li>Mansfield, Bruce, 1992, <em>Man on his Own: Interpretations of\nErasmus c. 1750–1920</em>, Toronto: University of Toronto\nPress.</li>\n<li>Monfasani, John, 2012, “Erasmus and the Philosophers”,\n<em>Erasmus of Rotterdam Society Yearbook</em> (now <em>Erasmus\nStudies</em>), 32: 47–68. doi:10.1163/18749275-00000005</li>\n<li>Nauert, Charles G., 2006, <em>Humanism and the Culture of\nRenaissance Europe</em>, 2<sup>nd</sup> edition, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Pabel, M. Hilmar (ed.), 1995, <em>Erasmus’ Vision of the\nChurch</em>, Kirksville: Sixteenth Century Journal Publishers.</li>\n<li>Popkin, Richard, 1964, <em>The History of Scepticism from Erasmus\nto Descartes</em>, New York: Harper &amp; Row. </li>\n<li>Rabil, Albert, 1972, <em>Erasmus and the New Testament: The Mind\nof a Christian Humanist</em>, San Antonio: Trinity University\nPress.</li>\n<li>Remer, Gary, 1996, <em>Humanism and the Rhetoric of\nToleration</em>, University Park: Pennsylvania State University\nPress.</li>\n<li>Rummel, Erika, 1995, <em>The Humanist-Scholastic Debate in the\nRenaissance and Reformation</em>, Cambridge, MA: Harvard University\nPress.</li>\n<li>–––, 2000, <em>The Confessionalization of\nHumanism in Reformation Germany</em>, New York: Oxford University\nPress.</li>\n<li>Ryle, Stephen (ed.), 2014, <em>Erasmus and the Renaissance\nRepublic of Letters</em>, Turnhout: Brepols.</li>\n<li>Steel, Carlos, 2008, “Erasmus and Aristotle”,\n<em>Erasmo da Rotterdam e la cultura europea / Erasmus of Rotterdam\nand European Culture. Atti dell’incontro di Studi nel V\nCentenario della Laurea di Erasmo all’Università di\nTorino</em>, Florence: Sismel, 149–174.</li>\n<li>Tracy, James D., 1978, <em>The Politics of Erasmus: A Pacifist\nIntellectual and His Political Milieu</em>, Toronto: University of\nToronto Press.</li>\n<li>Trapman, Hans, Jan van Herwaarden and Adrie van der Laan (eds.),\n2010, <em>Erasmus Politicus: Erasmus and Political Thought</em>,\nLeiden: Brill.</li>\n<li>Vanautgaerden, Alexandre, 2012, <em>Érasme typographe:\nHumanisme et imprimerie au début du XVIe siècle</em>,\nGeneva: Droz.</li>\n<li>Vessey, Mark (ed.), 2021, <em>Erasmus on Literature. His Ratio or\n‘System’ of 1518/1519</em>, Toronto: University of Toronto\nPress.</li>\n<li>Walter, Peter, 1991, <em>Theologie aus dem Geist der Rhetorik zur\nSchriftauslegung des Erasmus von Rotterdam</em>, Mainz:\nMathias-Grünewald-Verlag.</li>\n<li>Woodward, William, 1904 [1971], <em>. Desiderius Erasmus\nConcerning the Aim and Method of Education</em>; reprinted, New York:\nB. Franklin.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aquinas, Thomas",
            "Aristotle",
            "Aristotle, General Topics: rhetoric",
            "Augustine, Saint",
            "Cicero",
            "ethics: ancient",
            "Ficino, Marsilio",
            "free will",
            "humanism: in the Renaissance",
            "pacifism",
            "Pico della Mirandola, Giovanni",
            "Plato",
            "Plotinus",
            "Plutarch",
            "Seneca",
            "skepticism",
            "skepticism: ancient",
            "Socrates",
            "Valla, Lorenzo"
        ],
        "entry_link": [
            {
                "../aquinas/": "Aquinas, Thomas"
            },
            {
                "../aristotle/": "Aristotle"
            },
            {
                "../aristotle-rhetoric/": "Aristotle, General Topics: rhetoric"
            },
            {
                "../augustine/": "Augustine, Saint"
            },
            {
                "../cicero/": "Cicero"
            },
            {
                "../ethics-ancient/": "ethics: ancient"
            },
            {
                "../ficino/": "Ficino, Marsilio"
            },
            {
                "../freewill/": "free will"
            },
            {
                "../pacifism/": "pacifism"
            },
            {
                "../pico-della-mirandola/": "Pico della Mirandola, Giovanni"
            },
            {
                "../plato/": "Plato"
            },
            {
                "../plotinus/": "Plotinus"
            },
            {
                "../plutarch/": "Plutarch"
            },
            {
                "../seneca/": "Seneca"
            },
            {
                "../skepticism/": "skepticism"
            },
            {
                "../skepticism-ancient/": "skepticism: ancient"
            },
            {
                "../socrates/": "Socrates"
            },
            {
                "../lorenzo-valla/": "Valla, Lorenzo"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=erasmus\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/erasmus/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=erasmus&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/erasmus/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=erasmus": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/erasmus/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=erasmus&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/erasmus/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Nauert, Charles, “Desiderius Erasmus”, <em>The\nStanford Encyclopedia of Philosophy</em> (Fall 2017 Edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2017/entries/erasmus/\">https://plato.stanford.edu/archives/fall2017/entries/erasmus/</a>&gt;.\n [This was the previous entry on Erasmus in the <em>Stanford\nEncyclopedia of Philosophy</em> — see the\n <a class=\"plain\" href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=erasmus\" target=\"other\">version history</a>.]",
            "“<a href=\"https://iep.utm.edu/erasmus/\" target=\"other\">Erasmus, Desiderius</a>”,\n entry by Eric MacPhail in the <em>The Internet Encyclopedia of\nPhilosophy</em>.",
            "<a href=\"https://www.erasmus.org/\" target=\"other\">Erasmus Center for Early Modern Studies</a>,\n a joint initiative of Erasmus University Rotterdam and Rotterdam City\nLibrary.",
            "<a href=\"https://erasmussociety.org\" target=\"other\">Erasmus of Rotterdam Society</a>,\n with links to the Huygens Institute and its digitized edition of the\nAdages."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/archives/fall2017/entries/erasmus/": "https://plato.stanford.edu/archives/fall2017/entries/erasmus/"
            },
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=erasmus": "version history"
            },
            {
                "https://iep.utm.edu/erasmus/": "Erasmus, Desiderius"
            },
            {
                "https://www.erasmus.org/": "Erasmus Center for Early Modern Studies"
            },
            {
                "https://erasmussociety.org": "Erasmus of Rotterdam Society"
            }
        ]
    }
}