{
    "url": "femapproach-pragmatism",
    "title": "Pragmatist Feminism",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Judy Whipps\n<whippsj@gvsu.edu>\nDanielle Lake\n<dlake@elon.edu>",
        "author_links": [
            {
                "http://gvsu.edu/philosophy/index.cfm?id=5B846B1F-C0A2-BAC5-0DFB06278B464793": "Judy Whipps"
            },
            {
                "mailto:whippsj%40gvsu%2eedu": "whippsj@gvsu.edu"
            },
            {
                "mailto:dlake%40elon%2eedu": "dlake@elon.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"http://gvsu.edu/philosophy/index.cfm?id=5B846B1F-C0A2-BAC5-0DFB06278B464793\" target=\"other\">Judy Whipps</a>\n&lt;<a href=\"mailto:whippsj%40gvsu%2eedu\"><em>whippsj<abbr title=\" at \">@</abbr>gvsu<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nDanielle Lake\n&lt;<a href=\"mailto:dlake%40elon%2eedu\"><em>dlake<abbr title=\" at \">@</abbr>elon<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Sun Aug 22, 2004",
        "substantive revision Thu Nov 19, 2020"
    ],
    "preamble": "\n\nPragmatist feminism is a developing field of philosophy that emerged\nin the 1990s as a new approach to feminist philosophy. It utilizes and\nintegrates core concepts of pragmatism, including its emphasis on\npluralism, lived experience and public philosophy, with feminist\ntheory and practice with a focus on social change. Pragmatist feminist\nphilosophers have been addressing several different projects over the\npast decades, including a) the recovery of women who were influential\nin the development of American pragmatism but whose work subsequently\nall but disappeared in the history of philosophy, b) a rereading of\nthe “canon” of pragmatist philosophers, analyzing their\nwriting in light of their philosophies and attitudes about women, and\nc) the utilization of pragmatist philosophies as a resource for\ncontemporary feminist philosophy and activism. The late\n20th century saw a resurgence of interest in American\npragmatist philosophy, and part of the energy of that resurgence was\ndue to feminist interest in pragmatism. Twenty-first century feminist\nphilosophers are incorporating a wider vision of American and global\nactivism into the pragmatist-feminist dialogue.\n\nWhat is now called “classical” American pragmatism is a\ngrouping of philosophies that developed between the late nineteenth\nand the early twentieth century and were largely influential from the\nProgressive Era (1890–1915) up until the Second World War.\nPragmatists, such as John Dewey, William James, and Jane Addams, were\ninterested in the intersection of theory and practice, bringing\nphilosophical thinking into relationship with the social and political\nenvironment. For these thinkers, philosophizing was an active process,\nboth as a way to change social realities and to use experience to\nmodify the philosophies themselves. Early pragmatists were often\nhumanists; they saw the social environment as malleable, capable of\nimprovement through human action and philosophic thought. Because of\nthis, many of the classical pragmatists were engaged in social action,\noften participating in experiments in education and working for\negalitarian social reforms. Both early and contemporary pragmatists\nreject the idea of a certain Truth that can be discovered through\nlogical analysis or revelation and are more interested in knowledge\ngained through experiences of all sorts, while emphasizing the social\ncontext of all epistemological claims. Pluralism is a central value\nfor pragmatists, who understand that knowledge is shaped by multiple\nexperiential viewpoints. As such, women’s experiences are an\nessential part of pragmatist philosophy. \n\nThe weaving together of feminism and pragmatism situates social and\npolitical issues in historical, geographic and relational contexts and\nparticularly addresses systems of oppression that have marginalized\nthe voices of women and people of color.  Biographical and theoretical\napproaches illuminate the connections between feminism and pragmatism\nas activist-orientated philosophies. These efforts are consistent with\nfeminist methodology; they utilize personal experiences as well as\ntheoretical work that focuses on embodied living in a social organism\nto address contemporary feminist social and political concerns.\n\nBoth feminism and pragmatism are fields that extend beyond the\nboundaries of traditional philosophy. Some early pragmatist feminists\nworked in areas that are now considered social science fields. Looking\nbeyond academic philosophy to find the women who were influential\nsocial philosophers has expanded traditional philosophical methodology\nand has opened a a “new space for thinking” in\nphilosophy. Understanding these reformers as philosophers helps us see\nhow those outside of modern, professional, academic settings\ndeveloped, expressed, and enacted groundbreaking theories and can\nilluminate how philosophers today might span the boundaries between\nscholarship and activism, between philosophy and other disciplines,\nand between the academy and the community.\n\nMany of the historical women discussed here did not call themselves\npragmatists but contemporary scholars and activists rely on their\nphilosophies in a renewed emphasis on public and engaged philosophy in\nthe pragmatist tradition (Lake 2014; Hamington & Bardwell-Jones\n2012; Yun Lee 2011). This entry will first consider the influence of\nparticular women in the classical pragmatist era, then highlight\nfeminist rereadings of classical pragmatist work, describing how\ncontemporary pragmatist feminist philosophers are drawing upon the\nwork of early pragmatist feminist writers in order to pursue projects\nwithin epistemology, education, social action, and democratic\npluralism. Finally, this entry will briefly consider emerging\ncontemporary scholarship from global pragmatist feminist. \n",
    "toc": [
        {
            "#EarlFemiContAmerPrag": "1. Early Feminist Contributions to American Pragmatism"
        },
        {
            "#FemiReReadClasPragPhil": "2. Feminist Re-reading of Classical Pragmatist Philosophers"
        },
        {
            "#PragFemiPhilThem": "3. Pragmatist Feminist Philosophical Themes"
        },
        {
            "#ValuExpe": "3.1 Valuing Experience"
        },
        {
            "#Epis": "3.2 Epistemology"
        },
        {
            "#Educ": "3.3 Education"
        },
        {
            "#SociActi": "3.4 Social Action"
        },
        {
            "#DiveDemo": "3.5 Democratic Pluralism"
        },
        {
            "#Global": "4. Global Pragmatist Feminism"
        },
        {
            "#Conc": "5. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Early Feminist Contributions to American Pragmatism\n\nWomen were significant partners in the development and articulation of\nclassical American pragmatism. Historical analyses bring into view\nthe lives of philosophers and activists such as Jane Addams, Mary\nParker Follett, Charlotte Perkins Gilman, Emily Greene Balch, Lucy\nSprague Mitchell, Anna Julia Cooper, Mary Whiton Calkins, and Ella\nFlagg Young. These women bring added dimensions to pragmatism; they\nremind us of the issues that were subsequently left behind as American\nphilosophy became more exclusively technical and academic. For most of\nthese women, pragmatism was a philosophic practice used to accommodate\ntheir new academic and political engagement with the world, as well as\na method of reforming politics and culture. The pragmatist approach to\nphilosophy that brought theory and practice together helped these\nwomen trust in and learn from experience and intellectually engage in\na host of social reform movements.\n\nThe historical recovery of female voices in the history of philosophy\nin the last few decades is an ongoing project; it both helps us become\naware of women’s influence on the history of philosophy and\nshines a light on the processes that lead to the marginalization of women’s\nvoices (see the entry\n feminist history of philosophy).\n Recovering these women thinkers also allows us to hear new or\nexcluded voices in the philosophic conversation, in some cases\nresulting in opening up the definition of philosophy itself.\nRecognizing “philosophical techniques are means, not\nends”, these women rejected “philosophizing as an\nintellectual game that takes purely logical analysis as its special\ntask…” (Seigfried 1996: 37). Because of the gender-based\ndiscrimination against women as rational thinkers and their exclusion\nfrom the academy, history has rarely carried the names and texts of\nthese women into our philosophy textbooks (see for example Eileen\nO’Neill’s 1998 essay “Disappearing Ink”).\nThus, it should not be surprising that many of the women whose work\nhas been brought into the feminist-pragmatist discussion were\ncollege-educated activists rather than professional academic\nphilosophers; nevertheless, scholarship has shown that their\nwork had an enormous impact on the development of pragmatist thought.\nA historical look at how these women affected what became known as\npragmatism demonstrates the interactive and relational nature of\nphilosophizing.\n\nThe history of pragmatism is recent enough that we can more easily\nrecover and recognize the women who participated in forming this\nuniquely American school of thought, formerly considered only through\nthe work of such male thinkers as William James, Charles Sanders\nPeirce, George Herbert Mead, George Santayana, and John Dewey. The\nwork of women who were in philosophic and activist dialogue with these\nphilosophers, and who were original philosophers in their own right,\nhad mostly disappeared until the latter part of the twentieth\ncentury. Charlene Haddock Seigfried’s work, particularly her\n1996 book Pragmatism and Feminism, was central in the effort\nto bring these invisible women back into the philosophical discussion,\nas well as to bring feminist perspectives to the field of\npragmatism.\n\nIn the Progressive Era, many of the college-educated social reformers\nin the Chicago area lived at Hull House or were associated with the\nUniversity of Chicago. Some of the Hull-House reformers, such as\nSophonisba Breckinridge and Edith and Grace Abbott, held academic\npositions but did most of their academic and activist work in the\nrealm of social reform. Some, such as Julia Lathrop and Florence\nKelly, went on to hold influential governmental positions. Other\nfeminist pragmatists working on social and philosophic issues worked\nwith James and Royce at Harvard or were engaged with feminist reforms\nin other fields such as suffrage activism or peace work. Early\nfeminist pragmatists included the following women:\n\nJane Addams (1860–1935) was a central figure in\nthe development of pragmatist thought. In her lifetime Addams was\nrevered as one of America’s most famous social reformers, the\nfounder of Hull House, and the recipient of the 1931 Nobel Peace Prize.\nHer pragmatist philosophies emerged from her experiences working in\nthe poverty-stricken immigrant neighborhoods of Chicago, from her\ncollaborations with the talented women who lived at Hull House, as\nwell from reflection on texts and direct dialogue with philosophers of\nher time (including John Dewey, William James, George Herbert Mead, and W.E.B.\nDuBois). Addams published eleven books and hundreds of essays, writing\non ethics, social philosophy, and pacifism, in addition to analyzing\nsocial issues concerning women, industrialization, immigration, urban\nyouth, and international mediation.\n\nEmily Greene Balch (1867–1961) was a member of\nthe first graduating class at Bryn Mawr, engaging in graduate studies\nat the University of Chicago and the Harvard Annex, and ultimately\nteaching at Wellesley College for over 20 years. Along with Addams,\nshe was a founding member of Women’s International League for\nPeace and Freedom. While trained as a sociologist and an economist,\nevidence of pragmatist philosophy is abundant in her work. This is\nparticularly true in her support of social democracy and in her\nfundamental faith that the social environment was capable of\ntransformation through philosophical reflection and action. Her\ncommitment to pluralism and economic justice led her to work on\nsuffrage activism and global racial justice. She received the Nobel\nPeace Prize in 1946.\n\nElla Lyman Cabot (1866–1934) struggled to be a\nphilosopher in the male-dominated philosophies of early\n20th century. She took classes at Harvard and Radcliffe\nwith James and Royce. She continued to be part of the Harvard\nphilosophical community and as such was also a formative influence on\nothers’ writings. She was also a longtime advocate of\nwomen’s rights. She wrote seven books on ethics and\neducation. Her work was recovered in John Kaag’s 2013\nbook Pragmatism, Feminism, and Idealism in the Philosophy of Ella\nLyman Cabot.\n\nMary Whiton Calkins (1863–1930) studied under\npragmatists William James and Josiah Royce at Harvard, primarily\nworking in psychology, which was then a sub-field of philosophy. In\n1905, Calkins became the first woman president of the American\nPsychological Association and in 1918 became the first woman president\nof the American Philosophical Association. She was an advocate for\nwomen’s suffrage, claiming in 1905 that “a distinction\nbased on difference of sex is artificial and illogical” (Harper\n(ed.) 1922: 171). While not generally categorized as a pragmatist\nphilosopher, her influence as a female philosopher created a pathway\nfor other women philosophers.\n\nElsie Ripley Clapp (1882–1965) was a student of\nclassical pragmatists, taking over fourteen courses from Dewey at\nColumbia, working as his graduate assistant, and collaborating on\nresearch projects with him for years (see Seigfried 2001:\n89–90). Clapp commented on drafts of Dewey’s work, and\ncontributed original ideas (Seigfried 1996: 92). Dewey publicly\nacknowledged Clapp for her contributions to Democracy and\nEducation, but only in the introduction, not attributing to her\nany particular ideas in the body of the text. At his retirement in\n1927, Dewey suggested that Clapp should be appointed to teach his\ncourses at the Teachers College, but she was not offered the position\nby the college. She went on to collaborate with Eleanor Roosevelt on\nsignificant rural education projects of her time.\n\nAnna Julia Cooper (1858–1954) was an\neducational reformer, particularly focused on the education of\nAfrican-American women. She received her BA and MA at Oberlin College\nand earned her Ph.D. at the Sorbonne at the age of 66. Her writings\nabout the dual oppressions of race and gender are considered one of\nthe foundations of contemporary feminist theories of\nintersectionality. She is best known for her 1892 book, A Voice\nfrom the South by a Black Woman of the South.\n\nAlice Chipman Dewey (1858–1927) is generally\ncredited with bringing Dewey’s philosophic Hegelian thinking\ninto contact with real social issues. She was raised in Michigan by\nher pioneering grandfather and attended a Baptist seminary after high\nschool. Her lifelong interest in education led her to be a school\nteacher. This work along with her commitment to the women’s\nrights movement led her to study at the University of Michigan where\nshe met John Dewey. Their daughter Jane described Alice’s\ninfluence on John by saying that “things which previously had\nbeen matters of theory acquired through his contact with her a vital\nand direct human significance” (Rockefeller 1991: 150).  Alice\nDewey continued her interest in education as principal of University\nof Chicago Lab School where she worked with Dewey on experimental and\nexperiential education reform. \n\nMary Parker Follett (1868–1933) studied with\nRoyce, James, and Hart at Radcliffe/Harvard. Her academic training was\nprimarily in political theory and philosophy. Like Addams and many of\nthe feminist pragmatists of her era, her philosophy was developed out\nof her deep engagement with issues in her Boston community, and from\nobserving how people interact in public life.  Follett thought that\nthe simple act of voting would never change society and thus never\ndirectly advocated for women’s suffrage.  Like most pragmatists,\nFollett critiqued the dualism of individualism claiming “(t)he\ngroup and the individual come into existence simultaneously”\n(1918: 127). Follett’s advocacy of “power-with”\nrather than “power-over” in political as well as\norganizational work is considered a precursor to contemporary feminist\nanalyses of power (see Pratt 2011; Kaag 2011; Whipps 2014b). Follett\npublished three books and many essays and speeches. Her work has\ngained new significance in contemporary management theory and in\nmodern leadership studies.\n\nCharlotte Perkins Gilman (1860–1935) was a\nlifelong friend of both John Dewey and Jane Addams. Gilman stayed at Hull House\nfor about a month in 1895 where she lectured and explored the\nsettlement culture. Gilman, not formally trained in philosophy, was\ninterested in the philosophy of “find(ing) out what ailed\nsociety and how most easily to improve it” (Upin 1993: 42).\nGilman was particularly concerned with the industrial and economic\nconditions of women, both in the home and in the workplace. She sought\nto use philosophy in order to address the social and political\nproblems of her time and place, particularly related to women’s\nissues. She is the author of nine novels, including the feminist\nutopian novel Herland, and ten works of nonfiction, including\nWomen and Economics: A Study of the Economic Relation Between Men\nand Women as a Factor in Social Evolution. Gilman’s short\nstory “The Yellow Wallpaper” is a classic in feminist\nliterature.\n\nLucy Sprague Mitchell (1878–1967) was born in\nthe generation after Jane Addams and was a student of the classical\npragmatists. As a feminist educator she both defined and reflected the\nprogressive era philosophies of reform and social change through\neducational progress. In 1903, Mitchell became the first dean of women\nat the University of California at Berkeley where she encountered the\nsexism that was pervasive in the academy in that era. After moving\nback to New York, she began a 60-year career in child-centered\neducation, combining educational scholarship in both research and\npractice, with founding and administrating innovative programs. In her\nlifetime, she was also seen as an example for other women who were\ninterested in professional lives while marrying and raising children,\nsomething that was rarely available to the women of her\ngeneration. Mitchell’s Bank Street School demonstrated\nthe effectiveness of pragmatist child-centered education and continues\nto influence childhood development specialists and educators.\n\nElla Flagg Young (1845–1918) was a lifelong\neducator and then administrator in the school system in Chicago, and\nlater was a professor of education at the University of Chicago. She\nwas elected the first woman president of the National Education\nAssociation and worked for women’s suffrage. According to\nSeigfried, Dewey was specific about how Young’s “original\ninterpretations and applications of his theories went beyond his own\nunderstanding” (Seigfried 1996: 80).  According to Joan K. Smith (1977), Young\nbegan taking classes from John Dewey at the University of Chicago in\nthe fall of 1895; at that point she had over 30 years of experience in\nteaching and administration. She published three books on\neducation.\n2. Feminist Re-reading of Classical Pragmatist Philosophers\n\nFeminist philosophers have taken on the project of re-examining\nphilosophic texts through the lens of gender, analyzing how particular\nthinkers’ philosophies often depend on the subjugation of women;\nfor example, Rousseau’s idealized “Emile” is only\npossible through the supporting role of the idea of\n“Sophie”. Likewise, feminist pragmatists are examining the\nrole of women and gender in the canon of pragmatist philosophy,\nparticularly looking at the work of John Dewey, Charles Sanders\nPeirce, William James and George Herbert Mead. Pragmatism originated\nin a time when our culture was in the midst of enormous change in\nwomen’s roles, yet early century male pragmatists were often\nunaware of how gender biases affected knowledge and culture as well as\ntheir own ideas. Like many figures in the philosophical canon, at\ntimes they universalize the male perspective.  Yet, as we will see,\npragmatism and feminism overlap in significant ways, and even in their\ncritiques, feminists find value in these thinkers’ works.\n\nBooks such as Feminist Interpretations of John Dewey\n(Seigfried 2001) and Feminist Interpretations of William\nJames (Tarver and Sullivan 2015) have made these influences\nclear. In this latter volume Erin McKenna’s essay, “Women\nand William James”, points out James’ expectation that the\nwomen in his life (particularly his wife, mother and sister) play\ntraditional roles of self-sacrifice.  The concept of “free\nwill” is central to James’ work, yet, as McKenna reveals,\nhe didn’t grasp how his gender, class, and race provided him\nthis freedom. \n\n\nThe opportunity to exercise “free will” was not shared\nequally, and he did not see now his freedom intersected with the\noppression of others. (McKenna 2015: 83)\n\n\nOther pragmatist feminists have also examined the gendered reception\nof philosophers’ writings, for example, Marilyn Fischer reread\nJames’s acclaimed “The Moral Equivalent of War” in\nthe context of its time, demonstrating that James drew on\n“common conceptions shared by militarists, misogynists, and\nimperialists of the day” (2018).\n\nDewey’s thinking was also shaped by the gendered expectations of\nhis time and place, even though women played more equal roles in his\nlife. As Seigfried noted (1998), Dewey was a supporter of many\nfeminist causes. Yet, as she also pointed out later, “the\npitfalls of a view of women seen solely from a male perspective, even\nthat of a sympathetic male” still affect Dewey’s writing\n(2001: 10). Why does this\nmatter? As Nancy Tuana has said, \n\n\nPaying attention to the workings of gender within the texts of\nphilosophy will make visible the complexities of the inscription of\ngender ideologies. (Tarver and Sullivan 2015: ix) \n\n\nThese feminist re-readings and analyses have provided a view of the\ncultural context of pragmatist writings; it helps us understand how\nand why women were marginalized in the intellectual history of\npragmatism. As we will see, these important critiques have not\ndeterred feminist pragmatists from seeing the value in and building\nupon the work of these classical pragmatist thinkers.\n3. Pragmatist Feminist Philosophical Themes\n\nContemporary feminists are also implementing and extending pragmatist\nphilosophies as a foundation for feminist theory. These feminist\nphilosophers working in the pragmatist tradition point out that\npragmatism offers a valuable, although often unrecognized, resource\nfor feminist thinkers, especially as it is developed in the work of\nwomen pragmatists and activists. We see this particularly in feminist\npragmatist writings on experience, epistemology, education and social\naction.\n\nFor example, contemporary feminists point out how traditional\nphilosophy’s emphasis on rational, logical absolutes devalues\nthe ambiguities of the experience of an embodied life. For feminist\npragmatists, pluralistic communities have epistemological value and\nprovide the base for an inclusive problem-solving approach to social\nissues. The pragmatist understanding of education as a social and\npolitical force, as a major aspect of how society and individuals are\nshaped, has been echoed by contemporary feminists who analyze our\neducational curriculum and methods of teaching. Both pragmatism and\nfeminism are more likely to bring social context to the forefront of\nphilosophy, opening space for realities in flux, for emergent\nsituations to be shaped and reconstructed by their context.\nPragmatists emphasize that we must include particular and individual\nexperiences in a pluralistic discussion of multiple realities, and\nthat all parties involved in an issue also be involved in the\nproblem-solving\n process.[1]\n3.1 Valuing Experience\n\nA historical examination of pragmatism shows a reverse ordering of the\ntheory-action method sometimes assumed in philosophic thought, and\noften critiqued by feminist thinkers. In its privileging of theory,\nsome philosophical texts leave us with the impression that ideas\nnormally originate from ideal and often solitary theoretical thinking\nthat is then diffused into the general culture. However, in the case\nof many women activists, like Jane Addams, it is evident that public\nand political activism shaped the character of the philosophy. Indeed,\nshe advised leaders to “move with the people”, aiming to\nfirst “discover what people really want” so that they can\ntogether uncover a way forward that neither could alone “see\nvery clearly till they come to it” (“Democracy and\nSocial”, 1902 [2002]: 69). Such a method is consistent with\npragmatism; as 20th century pragmatist Sidney Hook said,\n“social action is the mother of inspiration and not, as is\nusually imagined, its offspring” (1940 [1991]: 3). Feminist\ntheory has also grown out of the activism of the women’s\nmovement; it incorporates the understandings that have resulted from\nsocial activism. Pragmatist philosophers often made these same points\nin their critiques of positivism. Both pragmatists and feminists\nadvocate for the practical use of philosophy in the realm of personal\nand public experience; pragmatism and feminism generally also share a\nsocial and/or political focus and advocate specific cultural\nchanges.\n\nThe pragmatist commitment to situated knowledge, rather than abstract\nor idealized knowing has been influential in some fields of feminist\nethics, particularly in care ethics. Maurice Hamington draws on\nAddams’s ethics to articulate “a proactive embodied\ncare” based on “ habits of interaction” (2004: 104).\nGeorge Herbert Mead’s philosophy of the self has also played a\nprominent role in care ethics for both Hamington and Heather Keith.\nAs Keith said of Mead’s concept: “ the self is wholly\nintegrated into an ecology of both physical and social relationships\nfacilitates a conception of selfhood valuable to the sort of personal\nand moral liberation called for by feminism” (1999: 330). \n\nCurrently feminists and pragmatists share an effort to radically\nchange oppressive political and social structures, an effort that\nfinds resonance with the early feminist-pragmatists. Jane Addams and\nother feminist reformers like Charlotte Perkins Gilman were\ncontinuously involved in fighting oppression, especially of women,\nchildren, and minorities. Pragmatism’s continued insistence that\nphilosophy address the problems of the current social situation\nsupports critiques of gender, race and class oppression, even though\nthe majority of pragmatism’s male founders were often relatively\ninattentive to cultural gender-related oppression.\n3.2 Epistemology\n\nFeminists and pragmatists share an interest in the situatedness of the\nknower within their social environment. They are both committed to an\nepistemology that is based in experience and relationality.\nFeminist-pragmatists point out that the search for universalized\nideals bankrupts ordinary experience and robs from philosophic thought\nthe creativity of thinking with and through complex networks of\nexperience and interaction. In Pragmatism and Feminism,\nSeigfried highlights aspects of pragmatism that make it useful to\nfeminist epistemology, noting both fields share a critique of dualism.\nSeigfried reminds her reader of four dualistic aspects of\nrationalistic philosophy critiqued by Dewey and some feminists for its\noppressive support of invidious social/economic hierarchies. The four\ndimensions of this rationalist approach include:\n\nThe depreciation of doing and making and the over-evaluation of\npure thinking and reflection;\n the contempt for bodies and matter and simultaneous praise of\nspirit and immateriality,\n the sharp division of practice and theory, and\n the inferiority of change and superiority of a fixed reality.\n(Seigfried 1996: 113)\n\n\nJane Duran, in “The Intersection of Pragmatism and\nFeminism” (1993), points out that feminist theorists critique\nthis preoccupation with universals, writing that it seems “to\npervade much of analytic philosophy (indeed philosophy as a\nwhole)”. This desire for universals, she says, leads all the way\nback to Plato. Plato’s idealism carries with it a devaluation of\nthe changing realm of the physical world. Duran points out that\nfeminists, as well as pragmatists, are often less interested in\nuniversal generalities and notes that an emphasis on particulars as\nwell as “relations and connections become almost more important\nthan particulars themselves” (1993: 166). This pluralistic sense\nof refusing to constrict reality to that which is defined by logic or\nlanguage helps feminists as philosophers propose an alternative vision\nof philosophy.\n\nSusan Dielman points to the importance of discourse and\nlanguage analysis in addressing hegemonic epistemic exclusions; she\nbrings neopragmatist theory, specifically that of Richard Rorty, into\nthe feminist pragmatist dialogue in order to understand “the\ninterconnectedness of power and discourse” (2012: 99).\n\nFeminist pragmatists have also built on John Dewey’s concept of\nexperience as philosophical support for a position that holds together\nthe subject and object in a nondualistic epistemology. Yet, as\npostcolonial feminists have pointed out, experience in itself is\nconditioned by one’s cultural background. Ofelia Schutte (2000)\nnotes that “the nature of knowledge is not culture-free but is\ndetermined by the methodologies and data legitimated by dominant\ncultures” (2000: 40). Feminist-pragmatist Celia T.\nBardwell-Jones (2008) draws on Josiah Royce’s theory of\ninterpretation to address the problem of translation “at the\nborders of conflicting experience…where differences are\ntranslated instead of assimilated” (2008: 22). Such\nepistemological translation work is essential for feminists and\npragmatists, given that in both fields theory is inherently about\nchanging the world. Jane Addams embodied this intersection of\npragmatism and feminism in her efforts to interpret across class and\ncultural boundaries; through this interpretative and activist work she\nsought to reconstruct the social order and increase justice for women\nand the underprivileged. Addams’ understanding of the\nrelationship between action and truth contributed to her choice of a\ncareer in the public world. For her, a motivation to understand truth\nwould compel her to seek it out in the world of action. As a public\nphilosopher, reformer, and activist embedded in her community, Addams\nwas called to act under inherently messy, dynamic, and ambiguous\nsituations (see Fischer 2005, 2011, 2013 and Lake 2014, 2015). This\ninterpretive activism opened opportunities for reconstruction,\nredefining relations between the public and the expert, students and\nthe instructor, the governed and the governors.\n\nSimilarly contemporary feminist thinkers have changed the academy and\nthe larger culture by re-analyzing and reconstructing the ways that we\nthink, the hierarchies of knowing, as well as the social conventions\nthat have defined gender. Erin McKenna in The Task of Utopia:\nPragmatist and Feminist Perspective (2001) uses this\nprocess-orientation to create a social/political philosophy that is\nalways open to change, rather than one with finished\n“ends” in view. With both feminism and pragmatism we can\nconsider philosophizing contextually as a creative force, reacting to\nas well as reconstructing our multiple environments.\n\nFeminist social analysis often produces the conditions for philosophic\nreflection, creating what Addams called “perplexities”\nthat are the starting-points for philosophical and political change\n(1902 [2002]: 77). In “Feminist-Pragmatist Revisioning of Reason,\nKnowledge, and Philosophy” (1993), Phyllis Rooney notes that the\nclassical pragmatists would have welcomed the challenges that\ncontemporary feminisms have brought to philosophy. She compares these\nrifts to what Peirce called the “irritations of doubt” (Peirce\n1877, quoted in Rooney 1993: 21) which open the door to inquiry and\nsignal possibilities for recreation and rediscovery. Dewey called this\nirritation “an unsettlement” which “aims at\novercoming a disturbance” or the “uncertainties of\nlife” (1916 [1985]: 336–337), which he says, are the\nmotivations for beginning to do philosophy. In Democracy and\nSocial Ethics, Addams references moments of\n“perplexities” as openings to begin rethinking social\nvalues and epistemological claims. Pragmatism and feminism then share\na movement toward active philosophizing about those\n“irritations”, “uncertainties”, and\n“perplexities”.\n\nFeminist epistemologists such as Susan Bordo and Alison Jaggar point\nout how traditional philosophy’s emphasis on rational, logical\nabsolutes has devalued the ambiguities of changing embodied\nexperience. Feminist and pragmatists have both rejected body/mind\ndualisms. Shannon Sullivan in Living Across and Through Skins\n(2001) brings the pragmatist tradition of transactional knowing\nthrough embodied and relational lived experience to the feminist\nepistemology of standpoint theory, describing what she calls a\n“pragmatist-feminist standpoint theory”. This\npragmatist-feminist perspective suggests knowing unfolds in\nrelationships enacted through our physical embodiment and the social\nenvironment; knowing should thus incorporate “multiple\nmarginalized perspectives”. Using Dewey’s standard of\ntruth as that which results in “transactional flourishing”\nSullivan considers “questions about which standpoints can help\npromote flourishing transactions” (2001: 146–47). In doing\nso, she corrects the privileging of women’s experiences that is\nfound in Sandra Harding’s feminist standpoint theory, and\nlocates knowing as transactions among diverse others, possibly even\nnon-humans. Sullivan’s work is particularly significant in the\nways she investigates feminist issues of embodiment drawing on both\nContinental and American Pragmatist perspectives.\n\nWicked problem scholars and community change-agents Valerie Brown and\nJudith Lambert also employ a feminist pragmatist epistemology in their\n2013 Collective Learning for Transformational Change: A Guide to\nCollaborative Action. Brown and Lambert, for instance, argue that\nsustainable and just transformational change on our collective social\nproblems requires we begin by first sharing our values. Since our core\nvalues tend to shape our perspective and our actions, recognizing the\nrange of values involved explicates the complexities. Their model also\nemphasizes individual narratives and legitimizes a range of knowledge,\nincluding individual, community, specialized, organizational,\nholistic, and collective knowledge cultures (2013: \n 22).[2]\nThis shared epistemological framework has had—and continues to\nhave—a significant influence on educational practices.\n3.3 Education\n\nPragmatist feminists of the Progressive Era had an enormous influence\non childhood and adult educational theory and practice. Addams’\neducational philosophy provides a model for the interaction between\nthinking and action. For her, as well as for other educators like Lucy\nSprague Mitchell, education is not seen as standing apart from life\nbut rather blending seamlessly into the fabric of experiences and\nproviding a meaning-making function. Addams understood that while\neducation informs experience (providing historical context as well as\nskills), it must also interact with and change in response to current\nsocial needs. In understanding the culture that students come from as\nwell as the values of their lives, Addams argued for an educational\napproach that uses students’ own experiences (personal as well\nas cultural) as starting points for learning.\n\nIn general, early pragmatist-feminist writing consistently\ndemonstrates a distrust of educational theories that are disconnected\nfrom experience. In Twenty Years at Hull House (1910), Addams\ntalks about how the professor’s lack of interest in matters of\nthe “welfare of mankind” leaves behind the messy and\nchaotic experiential realm of student relationships for the more pure\nintellectual realm; she argued this separation also opens students to\nthe influence of “charlatans” (1910 [1990]: 247).\nAddams’ vision of education, even in the early days of Hull\nHouse, fostered an interchange between the intellectual culture of a\nliberal arts education and the practical aspects of urban industrial\nlife, bringing life and thought together.\n\nAddams was involved in educational reform in the Chicago Public\nSchools and later was a member of the Chicago School Board. However,\nher philosophy of education has had more enduring impact on adult\neducation theory and practice, primarily as a result of her\ninnovations at Hull House. In working with adults, she integrated\narts, literature and history into industrial life; later she\ncelebrated the arts and culture that was already present in the lives\nof her industrial immigrant communities. In contrast, Lucy Sprague\nMitchell’s Bank Street School demonstrated the effectiveness of\npragmatist child-centered education and continues to influence\nchildhood development specialists and educators.\n\nFurther, a host of feminist pragmatists had a direct and sustained\ninfluenced on Dewey’s educational philosophy: from Jane Addams\nand Alice Chipman Dewey, to Ella Flagg Young, Elsie Ripley Clapp, and\nLucy Sprague Mitchell. Indeed, Dewey had not published in philosophy\nof education, or worked on educational issues, before he came to\nChicago where he experienced Jane Addams’s Hull House and worked\nwith individuals like Ella Flagg Young. Her contributions to Dewey’s\nphilosophy included: (1) “the extent to which freedom meant\n… a respect for the inquiring or reflective process of\nindividuals”; (2) an understanding of “the way that the\ninteractions of persons with one another influences their mental\nhabits”; and, (3) “how all psychology that was not simply\nphysiological was social” (Seigfried 1996: 80).\n Pragmatist philosophy of education continues to have a global influence. Dewey is\noften cited as the catalyst for experiential learning and civic\nengagement practices. For instance, David Kolb utilizes Dewey’s\nphilosophy to advocate for a move away from narrowly framed and\nabstract specialization towards experiential learning (2003). Kolb,\nlike many others, extends this philosophy of education, emphasizing\nlearning as a spiral cycle of reflective action and engagement (Brown\nand Lambert 2013; Norton 2005).\n\nOther contemporary feminist philosophers of education draw on the\npragmatist tradition, especially the work of early pragmatist women,\nin their conceptualization of education as a political and\nemancipatory practice. Possibly because of its interest in the\nrelationship between theory and action, philosophy of education has\nalways occupied a privileged place in pragmatist philosophy, and\nfeminist pragmatist writing reflects this.\n\nFeminist philosophers, such as Elizabeth Minnich and Jane Roland\nMartin, have critiqued the traditional canon,\npointing out the ways that the canon perpetuates the traditional power\nstructures by excluding the works of women and minorities. Minnich\npoints out that the administrative structures of colleges and\nuniversities often place programs like women’s studies or\nAfrican-American studies on the periphery of the college hierarchies.\nMinnich’s 1990 book, Transforming Knowledge, draws on\nboth a feminist critique and pragmatist practices to advocate for a\nrethinking of the patriarchal assumptions at the base of our academic\ntraditions. This work reconstructs what it means to do philosophy,\nopening our definitions of philosophy to voices that may have been\npreviously excluded or marginalized. Minnich and other feminist\nthinkers show us how many traditional theorists have been blinded by\ntheir inability to conceive of ideas outside of the dominant hegemonic\ntraditions. Minnich points out that pragmatism can share with feminism\nthe vitality that arises from an opening of philosophy to newness, to\notherness, to diversity.\n\nMaxine Greene, a philosopher of education who draws on multiple\nphilosophical traditions, has inspired a generation of educators and\nphilosophers to think of education in terms of a practice of freedom,\nto provide an opening of spaces\nfor new ways of thinking and being.\nIn The Dialectic of Freedom (1988), Greene relies on John\nDewey, the example of Jane Addams, as well as feminist novels, to\ndescribe the ways that women have told the truths about their private\nand public lives. Greene wants an educational system that allows\nradical difference, that leaves open a space for diverse others to\nappear in the public world, to “tear aside the conventional\nmasks…that hide women’s being in the world” (1988:\n\n57).\n\nMore recent feminist pragmatist pedagogies integrate scholarship on\nwicked problems, sustainability education, and community engagement\n(Lake 2015; Whipps 2014a); Parker 2010). This educational approach\nextends the work of Dewey and Addams, highlighting the need for\n“context-sensitive, dialogue-driven, action-based”\nlearning (Lake 2015: 252). The integration and application of these\nfields offers students opportunities to impact real problems, develop\nskills, and foster virtues necessary for collaboratively addressing\npublic problems. Current research on this form of education highlights\nhow it prepares students to take on the role of an integrator and\n“boundary spanner” (Ramaley 2014: 12) in addition to\n\nfostering “change agent” skills (Svanström,\nLozano-García, and Rowe 2008).\n3.4 Social Action\n\nEarly feminist pragmatists often influenced the intellectual culture\nof the Progressive Era and early pragmatist thought through activism.\nWhile early feminist pragmatists were influenced by Darwinian thought,\nthey rejected the harsh position of Social Darwinism that pits humans\nin a competitive fight for individual survival. Instead, they used the\nconcepts of evolution to theorize the possibilities of social\nprogress, affirming a social ethic that mandates humans have both the\nability and the responsibility to improve their environment. Charlotte\nPerkins Gilman, for example, concentrated much of her writing on\nsocial issues of women’s environment, working towards radical\nchanges in the home environment to make it more democratic and\negalitarian. Gilman’s writing recommended some Hull House\ninnovations as examples of some of the social changes she recommended,\nsuch as having professional cooks making healthy family meals in a\npublic kitchen, instituting day care centers, and abolishing\nindustrial child labor. Addams was also quite perceptive about the\nperplexities of home life for women; in Democracy and Social\nEthics, she consistently advocated that the private home life of\nwomen should more directly align with a public social good.\n\nAddams’s life work—involving both place-based local\nactivism and global outreach—is a powerful illustration of\nenacting experimental values under specific conditions through an\niterative process of concrete experience and reflective\ntheorizing. Rather than a philosophic retreat from the events and\ntextures of everyday life, feminist pragmatists have chosen to do\nphilosophy in an interactive and public mode. Marilyn Fischer\ndescribes Addams’s activism and writing as “an experiment\nin real time of the process of democratic, pragmatist political\nreconstruction”. She continues by labeling her activism as the\n“the sort of concrete experience from which pragmatist theory\nemerges and to which it must return for validation” (2013: 229).\nIn Jane Addams’s Evolutionary Theorizing: Constructing\nDemocracy and Social Ethics (2019), Fischer shows that Addams, in\nanalyzing the most pressing social issues of her day, drew on a vast\narray of international intellectual resources, most notably from\ntheorists across the disciplines who patterned their work on\nevolutionary biology. By showing that Addams was a more wide-ranging\nintellectual than has been documented to date, Fischer’s work\nalso expands our understanding of the roots of classical American\npragmatism.\n\nPeace activism is a field of social activism that engaged many of the\nwomen of the early progressive pragmatist era. Starting with the\nSpanish American War of 1899 and in the decades prior to World War I,\npragmatists and feminists worked on anti-imperialist campaigns and\nfought militarist influences in society. After the beginnings of the\nwar in Europe, political activism in opposition to war and working for\nalternatives to war became, for some women, their primary occupation.\nYet, for most of these activists, “peace” was much more\nthat the absence of war; instead it signaled a new cooperative\napproach to social life. As noted early, Jane Addams and Emily Greene\nBalch both received the Nobel Peace Prize (Addams in 1931, Balch in\n1946). Addams and Balch were also founding members of Women’s\nInternational League for Peace and Freedom, an organization which\ncontinues to be internationally influential in gender justice\nwork.\n\nIn the early 20th century peace activism and women’s\nsuffrage movements were often linked. For these women, the movement\ntoward social justice, toward egalitarian economic structures, and\naway from competitive hierarchies necessitated a social structure\nbased in cooperation and peace, not war. Such belief in the\npossibility of substantially changing social and political realities\nis at the heart of both pragmatism and feminism. Contemporary scholars\nof peace, such as political scientist Patricia M. Shields, draw on\nAddams’s philosophy of “ positive peace” which\nincludes advocacy for social justice at all levels of society and\ngovernance (2017: 37). \n\nTwenty-first century feminist pragmatists also have expanded the\nphilosophies of early pragmatists feminists by bringing new activist\nvoices into the philosophic dialogue such as Gloria Anzuldua, Grace\nLee Boggs, bell hooks, Audre Lorde and Angela Davis (see Lake 2019,\n2020; McKenna and Pratt 2015; James 2009, 2013; Varner 2020 (Other\nInternet Resources)).  A number of contemporary feminist pragmatists\n(Heldke, Lake, McKenna, Parker) are advocating for ecological justice,\nfood justice, and animal justice.  Others are looking to scholars of\nwicked problems like Valerie Brown and Bryan Norton, and Design and\nSystems Thinking experts like Margaret Wheatley, Josina Vink, and\nArturo Escobar for new ways to address social problems.\n\nAsian American Civil Rights activist Grace Lee Boggs (1915–2015)\nhas received particular attention in recent years from pragmatist\nfeminists who have found Boggs’s emphases on lived experience,\npluralism, complexity, and praxis to align with pragmatist feminist\ntraditions (Lake 2020). Boggs’ place-based philosophic-activism\nin Detroit was preceded by formal philosophical training in\npragmatism. She received her 1940 Ph.D. in philosophy (see Grace Chin\nLee) from Bryn Mawr where she wrote her dissertation on pragmatist\nGeorge Herbert Mead. \n3.5 Democratic Pluralism\n\nDemocracy was a core concept for many early feminist pragmatists,\nespecially Jane Addams and Mary Parker Follett. For example, democracy\nas an ethic provided the theoretical framing for Addams’\nbeginning work at Hull House as well as her later work with labor\nunions and feminist activism. In Democracy and Social Ethics\n(1902) Addams theorized a continually evolving democracy based on\nsocial association, particular to each generation and locality. As an\nethical system, it placed on each person “a moral\nobligation” to chose experiences of “mixing on the\nthronged and common road” where we can “least see the size\nof one another’s burdens” (1902 [2002]: 8–7). She\ncritiqued earlier formations of liberty and democracy that\nweren’t developed out of experience and interaction, and that\ndidn’t embrace all classes of society. Addams took this sense of\nempathic understanding to larger and larger communities, as she moved\nfrom local to national to international work. Democracy, for Addams,\nis built upon dialogue, joint experiences and social equality. She\nunderstood we must give up on the hope that we will “settle our\nperplexities by mere good fighting”, suggesting this stance\nemerged from a “childish conception of life” (1910 [1990]:\n57). Her nephew, James Weber Linn, wrote that Addams’ distrusted\nlegislation when it was not “preceded by full discussion and\nunderstanding” (155).  Addams’ commitment to dialogic and\nrelational democracy emerged from the recognition that “genuine\nsocial reform” across ideological differences tends to happen\nthrough “slow, plodding dullness” (Fischer 2016: 5).\n\nAs a political philosopher, Mary\nParker Follett wanted to move the practice of democracy away from the\nmere action of voting to small community based decision-making. She\nbelieved that problem-solving via dialogue and action in local but\ndiverse networks and organizations was the best basis for democracy.\nRejecting compromise as a way of dealing with difference, she instead\nadvocated for “integration”, believing conceptual\nresolution of differences must be worked out in everyday action\ntogether. According to Follett, the process of resolution requires\nfull honesty, self-knowledge, careful listening and understanding of\nwhat is symbolized in the others’ demands.\n\nA pluralistic community is an important theoretical and practical\ncomponent of pragmatist conceptions of democracy. The “social\nethics” advocated by Dewey and Addams embraces equality and\nmultiplicity, narrative and perplexity, fellowship and cooperative\naction, sympathetic understanding and the expansion of our ethical\nframework. Scott Pratt has noted that these pluralistic values in\nAmerican philosophy may have deeper roots than James, Dewey and\nAddams. For example, in Native Pragmatism Pratt traces the\ngender and cultural pluralistic values of American philosophy to the\nearly 19th century writings of Lydia Marie Child on\nindigenous North Americans.\n\nIn fact, Addams, Dewey, and Follett all critiqued the ideal of liberal\nindividualism which positions individuals as autonomous beings in\ncompetition with each other for their freedoms. Instead pragmatist\nfeminists focus on living in a reciprocal and interdependent social\nenvironment, believing this holds the promise of civilization,\ncooperation, and coexistence; they work to build communities that\nfoster these joint associations. By prioritizing community,\npragmatist-feminists encourage us to rethink what it means to live in\na democracy (Green 1999), to provide a feminist communitarian\nphilosophy (Whipps 2004), or to re-conceive alternative ways of\nstructuring societies (Boggs and Kurashigo 2012). Early pragmatist\nwriters join with contemporary feminists in a critique of the\nhierarchical systems of power that limit diverse perspectives. Several\ncontemporary pragmatist-feminists have built upon these foundations to\ndevelop pragmatist-feminist political philosophies, including Judith\nGreene in Deep Democracy: Community, Diversity,\nTransformation (1990), Beth Singer in Pragmatism, Rights and\nDemocracy (1999), and Erin\nMcKenna in The Task of Utopia (2001). These feminist\npragmatists imagine a participatory democracy in which all members of\nthe society are involved in creating the community. Yet many\ncontemporary feminists criticize recent communitarian philosophies as\npotentially harmful to feminist issues; they argue the call for a\n“return” to community values means a return to values that\nrestrict gender roles or limit diversity. With this critique in mind,\nAddams can be seen as a basis for a feminist progressive\ncommunitarianism that critiques isolated individualism and\nunderstands personal identity as necessarily embedded in social and\npolitical community. While pragmatists and feminists share the concern\nfor relational community and pluralistic thinking, they differ in how\nthey construct the Other. Pragmatists, Seigfried says, \n\n\nare more likely to emphasize that everyone is a significantly and\nvaluably Other … and tend to celebrate otherness by seeking out\nand welcoming difference as an expression of creative subjectivity.\n(Seigfried 1996: 267) \n\n\nAs Francis Hackett, an early resident of Hull House, said about\nAddams, “one feels in her presence that to be an\n‘other’ is itself a title to her recognition” (1969:\n76). Feminists, on the other hand, having experienced the position of\nmarginalized otherness as women, are more inclined to “expose\nthe controlling force exercised by those who have the power to\nconstruct the Other as a subject of domination” (Seigfried 1996:\n267).\n\nShannon Sullivan, in Revealing Whiteness (2006), notes that\nAddams was “ahead of her time” in her theoretical and\npractical focus on reciprocal class and race relations, yet cautions\nthat such reciprocal relations have also “unintentionally\nfurthered white people’s ontological expansiveness” (2006:\n168). Sullivan draws on Dewey’s and James’ writing on\nhabit, as well as psychoanalytic theory, to call for responsibility\nfor one’s unconscious attitudes. In either embracing the\ndiversity of the other, or in critiquing a system that makes persons\ninto object-others, both feminism and pragmatism provide theoretical\ntools to analyze and actively fight against the unjust hierarchies\ncreated by racism, classism, and sexism. Contemporary black feminist\npragmatists such as V. Denise James are building on the work of Anna\nJulia Cooper, Ida B. Wells and others, to develop black feminist\nvisionary pragmatism, a term which describes “academic, cultural, and\nactivist projects that attempt to take a practical view of social\namelioration, while positing a vision of a radically changed, more\njust society” (James 2013).\n4. Global Pragmatist Feminisms\n\nNancy McHugh’s (2015) The Limits of Knowledge\nhighlights one of the most compelling aspects of feminist pragmatist\nwork: the need to engage along and across borders. McHugh argues for a\ntransactionally situated approach that aims to generate and sustain a\nvantage point from which to see complex, interconnected problems\nfacing both local and global communities across social, economic,\ncultural, educational, and political divides. This means we begin in\n“the complexities of the everyday world” and engage with\nthose who are impacted by the results. At its best, such an approach\nseeks out “ marginalized views and marginalized\nknowledge,” recognizing that long-standing histories shape the\npresent situation, and that our location is embodied (10). Phillip\nDorstewitz highlights how feminist pragmatists seek to engage\n“at the system’s edges” (370) in order to engage in\nphilosophic-activist work. Susan Griffin (2009) notes that such work\nis critical for fostering “ the capacity to recognize the actual\ncircumstances of the world, while simultaneously seeing what lies\nbeneath them” (9).\n\nIn the twentieth century, those identifying as pragmatist feminist\nscholars were mostly from North America. In the first two decades of\nthe twenty-first century, global pragmatist feminist voices have made\nimportant contributions to the field. For instance, Clara Fischer, who\nalso writes on Irish Feminism, turns to John Dewey to address\nbody/mind and emotion/reason dualisms, demonstrating that feminists\ncould draw on the pragmatist tradition to address philosophies of\nembodiment (2018). Dorothy Rogers current projects seek to highlight\nthe work of indigenous and early Mexican feminists who rejected the\nassimilationist agenda in education (2020, Other Internet Resources)\nand Alessandri and Stehn uncover the Mexican influences on Gloria\nAnzaldua’s writing (2020). Núria Sara Miras Boronat,\nUniversitat de Barcelona, organized a feminist pragmatist conference\nin Barcelona in January 2020. She has published on Addams and\npragmatist peace philosophies (2019), and also works on philosophies\nof play, drawing on Mead’s work which was influenced by his\ninteraction with Hull House (2013). There has also recently been a\nshift towards uncovering and exploring the philosophic-activist work\nunfolding beyond the borders of the global north. \n5. Conclusion\n\nAs pragmatist feminist philosophy continues to develop, more women who\nworked in the pragmatist tradition are being uncovered, and their\nvoices incorporated back into the pragmatist tradition. Contemporary\npragmatist feminist philosophers are utilizing those perspectives to\naddress contemporary philosophical and activist concerns. Feminist\nphilosophers bring these recovered perspectives to contemporary\nfeminist projects, such as domestic violence (Banerjee 2008), queer\ntheory, sex trafficking and community organizing (see Fischer,\nJackson, Brown and Hamington in Hamington 2010) and human rights\n(Lowe 2019). The combined force of pragmatism and contemporary feminism\nis leading to a deeper understanding of contemporary progressive\nfeminist goals, bringing action and theory together in egalitarian\npractice.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Addams, Jane, 1910 [1990], <em>Twenty Years at Hull House,\nwith Autobiographical Notes</em>, Urbana, IL: University of Illinois\nPress.",
                "–––, 1902 [2002], <em>Democracy and Social\nEthics</em>, edited with Introduction by Charlene Haddock Seigfried,\nUrbana, IL: University of Illinois Press.",
                "–––, 1922 [2003], <em>Peace and Bread in Time of\nWar in Jane Addams’s Writings on Peace</em>, edited with\nintroductions by Marilyn Fischer and Judy Whipps, Bristol: Thoemmes\nPress.",
                "–––, <em>On Education</em>, recently compiled\ncollection of essays, Ellen Condliffe Lagemann (ed.), New Brunswick,\nNJ: Transaction Publishers, 1985; revised edition 1994.",
                "Alessandri, Mariana and Alexander Stehn, 2020. “La Mexicana\nen la Chicana: The Mexican Sources of Anzaldúa’s\nInter-American Philosophy”, <em>Inter-American Journal of\nPhilosophy</em>, 1(11): 44–62.",
                "Anderson, Elizabeth. 2006. “The Epistemology of\nDemocracy”, <em>Episteme: A Journal of Social Epistemology</em>,\n3: 8–22.",
                "–––. 2014. “Journeys of a Feminist\nPragmatist”, <em>Proceedings and Addresses of the American\nPhilosophical Association</em>, 88: 71–87.",
                "Antler, Joyce, 1981, “Feminism as a Life Process: The Life\nand Career of Lucy Sprague Mitchell”, <em>Feminist Studies</em>,\n7: 134–157. doi:10.2307/3177675 ",
                "–––, 1987a, <em>The Educated Woman and\nProfessionalization: The Struggle for a New Feminine Identity,\n1890–1920</em>, New York: Garland.",
                "–––, 1987b, <em>Lucy Sprague Mitchell: The\nMaking of a Modern Woman</em>, New Haven and London: Yale University\nPress.",
                "Banerjee, Amrita, 2008, “Follett’s Pragmatist Ontology\nof Relations: Potentials for a Feminist Perspective on Violence”,\n<em>Journal of Speculative Philosophy</em>, 22(1): 3–11.",
                "Bardwell-Jones, Celia, 2008, “Border Communities and Royce:\nThe Problem of Translation and Reinterpreting Feminist\nEmpiricism”, <em>Journal of Speculative Philosophy</em>, 22(1):\n12–22.",
                "Boggs, Grace Lee and Scott Kurashigo, 2012, <em>The Next American\nRevolution: Sustainable Activism for the 21st Century</em>, Berkeley:\nUniversity of California.",
                "Boggs, James and Grace Lee, 1974, <em>Revolution and Evolution in\nthe Twentieth Century</em>, New York: Monthly Review Press.",
                "Boronat, Núria Sara Mires, 2019, “Peace, Bread, and\nIdeas for a Cosmopolitan World: Addams’ Unknown Pragmatist\nLegacy Today”, in K. P. Skowronski and S. Philström\n(eds.), <em>Pragmatism, Kant and Kantianism in the Twenty-first\nCentury</em> (Nordic Studies in Pragmatism: Volume 4), Helsinki,\n307–326.",
                "–––, 2013, “Games People Play. George\nHerbert Mead’s Concept of Game and Play in a Contemporary\nContext”, in T. Burke and K. Skwronski (eds.), <em>George Herbert\nMead in the Twenty First Century</em>, Lanham: Lexington Books, \n163–17.",
                "Boydston, Jo Ann, 1975, “John Dewey and the New\nFeminism”, <em>Teachers College Record</em>, 76:\n442–448.",
                "Brown, Valerie A. and Judith A. Lambert, 2013, <em>Collective\nLearning for Transformational Change: A Guide to Collaborative\nAction</em>, New York: Routledge.",
                "Cooper, Anna Julia, 1998, <em>The Voice of Anna Julia Cooper:\nIncluding a Voice from the South and Other Important Essays, Papers,\nand Letters</em>, Charles Lemert and Esme Bhan (eds.), Lanham and New\nYork: Rowman and Littlefield Publishing.",
                "Cunningham, Craig, Granger, David, Jane Fowler Morse, Barbara\nStengel and Terri Wilson, 2007, “Dewey, Women, and Weirdoes:\nor, the Potential Rewards for Scholars who Dialogue across\nDifference”, <em>E&amp;C/Education and Culture</em>, 23(2):\n27–62.",
                "Dewey, John, 1909 [1977], “The Influence of Darwinism on\nPhilosophy”, in <em>John Dewey: The Middle Works\n1899–1924</em>, Jo Ann Boydson (ed.), Carbondale: Southern\nIllinois University Press.",
                "–––, 1916 [1985], <em>Democracy and\nEducation</em>, in <em>John Dewey: The Middle Works, Vol. 9:\n1916</em>, Jo Ann Boydson (ed.), Carbondale: Southern Illinois\nUniversity Press.",
                "–––, 1984b [1939], <em>Experience and\nEducation</em>, in <em>John Dewey: The Later Works, Volume 3:\n1938–39</em>, Jo Ann Boydson (ed.), Carbondale: Southern\nIllinois University Press.",
                "–––, 1984c [1945], “Democratic versus\nCoercive International Organization: The Realism of Jane\nAddams”, in <em>John Dewey: The Later Works, Volume 15:\n1942–48</em>, Jo Ann Boydson (ed.), Carbondale: Southern\nIllinois University Press.",
                "Dielman, Susan, 2012, “Solving the Problem of Epistemic\nExclusion: A Pragmatist-Feminist Approach”, in Hamington and\nBardwell-Jones 2012: 90–114.",
                "Dorstewitz, Phillipp, 2016, “Imagining Social\nTransformations: Territory Making and the Project of Radical\nPragmatism”, <em>Contemporary Pragmatism</em>, 13:\n261–381.",
                "Duran, Jane, 1993, “The Intersection of Pragmatism and\nFeminism”, <em>Hypatia</em>, 8(2): 159–171.",
                "Elstain, Jean Bethke, 2002, <em>The Jane Addams Reader</em>, New\nYork: Basic Books.",
                "Epstein-Corbin, Sean, 2014,“ Pragmatism, Feminism, and the\nSentimental Subject”, <em>Transactions of the Charles S. Peirce\nSociety: A Quarterly Journal in American Philosophy</em>, 50(2):\n220–245.",
                "Fischer, Clara, 2014, <em>Gendered Readings of Change: A\nFeminist-Pragmatist Approach</em>, New York: Palgrave MacMillan.",
                "–––, 2016, “Feminist Philosophy,\nPragmatism, and the ‘Turn to Affect’: A Genealogical\nCritique”, <em>Hypatia: A Journal of Feminist Philosophy</em>,\n31(4): 810–826.",
                "Fischer Clara and Luna Dolezal (eds.), 2018, <em>New Feminist\nPerspectives on Embodiment</em>, New York: Palgrave MacMillan.",
                "Fischer, Clara and Morris, 2019, “John Dewey and Critical\nPhilosophies for Critical Political Times”, <em>Contemporary\nPragmatism</em>, 16(2–3): 141–146.",
                "Fischer, Marilyn, 2000, “Jane Addams’s Feminist\nEthics”, in <em>Presenting Women Philosophers</em>, Cecile T.\nTougas and Sara Ebenreck (eds.), Philadelphia: Temple University\nPress, pp. 51–58.",
                "–––, 2004, <em>On Addams</em>, Canada: Wadsworth\nPhilosophers Series.",
                "–––, 2005, “Feminism and the Art of\nInterpretation: Or, Reading the First Wave to Think about the Second\nand Third Waves”, in Sally J. Scholz (ed.), <em>APA Newsletter\non Feminism and Philosophy</em>, 1(5): 3–6.",
                "–––, 2007, “A Pragmatism Cosmopolitan\nMoment: Reconfiguring Nussbaum’s Cosmopolitan Concentric\nCircles”, <em>Journal of Speculative Philosophy</em>, 21(3):\n151–165.",
                "–––, 2011, “Interpretation’s\nContrapuntal Pathways: Addams and the Averbuch Affair”,\n<em>Transactions of the Charles S. Peirce Society</em>, 47(4):\n482–506. doi:10.2979/trancharpeirsoc.47.4.482 ",
                "–––, 2013, “Reading Dewey’s\nPolitical Philosophy through Addams’s Political\nCompromises”, <em>American Catholic Philosophical\nQuarterly</em>, 87(2): 227–243. doi:10.5840/acpq201387219",
                "–––, 2016, “A Pluralistic Universe in\nTwenty Years”, <em>The Pluralist</em>, 11(1): 1–18.\ndoi:10.5406/pluralist.11.1.0001 ",
                "–––, 2018, “The Moral Equivalent of War:\nWilliam James’s Minor Variation on Common Themes”, <em>William\nJames Studies</em>, 14(Spring): 92–119.",
                "–––, 2019, <em>Jane Addams’s Evolutionary\nTheorizing: Constructing ‘Democracy and Social Ethics’</em>, Chicago:\nUniversity of Chicago Press.",
                "Fischer, Marilyn and Judy D. Whipps (eds.), 2003, <em>Jane\nAddams’s Writings on Peace</em>, Volumes 1–4, Bristol:\nThoemmes Press.",
                "Fischer, Marilyn, Carol Nackenoff, and Wendy Chmielewski (eds.),\n2009, <em>Jane Addams and the Practice of Democracy</em>, Chicago:\nUniversity of Illinois Press.",
                "Follett, Mary Parker, 1918, <em>The New State: Group Organization,\nthe Solution of Popular Government</em>, New York: Longmans,\nGreen.",
                "–––, 1924 [1951], <em>Creative Experience</em>,\nNew York: Peter Smith Publishers.",
                "Gatens-Robinson, Eugenie, 1991, “Dewey and the Feminist\nSuccessor Science Project”, <em>Transactions of the Charles S.\nPeirce Society</em>, 27(4): 417–433.",
                "Green, Judith M., 1999, <em>Deep Democracy: Community, Diversity\nand Transformation</em>, Lanham, MA: Rowman and Littlefield\nPublishers.",
                "–––, 2008, <em>Pragmatism and Social Hope:\nDeepening Democracy in Global Contexts</em>, New York: Columbia\nUniversity Press.",
                "Greene, Maxine, 1988, <em>The Dialectic of Freedom</em>. New York:\nTeachers College Press.",
                "Gordon, Lynn, 1990, <em>Gender and Education in the Progressive\nEra</em>, New Haven: Yale University Press.",
                "Griffith, Susan C., 2009, “Profiles and Perspectives: Jane\nAddams, Stories and Imagination”, <em>Language Arts</em>, 86(4):\n302–310.",
                "Hackett, Francis, 1969, “Hull House—A Souvenir”,\nin <em>Eighty Years at Hull House</em>, Allen F. Davis and Mary Lynn\nMcCree (eds.), Chicago: Quadrangle Books, pp. 71–76. ",
                "Hamington, Maurice, 2004a, <em>Embodied Care: Jane Addams, Maurice\nMerleau-Ponty, and Feminist Ethics</em>, Chicago: University of\nIllinois Press.",
                "–––, 2004b, “Addams’s Radical\nDemocracy: Moving Beyond Rights”, <em>Journal of Speculative\nPhilosophy</em>, 18(3): 216–233.",
                "–––, 2009, <em>The Social Philosophy of Jane\nAddams</em>, Urbana and Chicago: University of Illinois Press.",
                "––– (ed.), 2010, <em>Feminist Interpretations of\nJane Addams</em>, University Park, PA: Pennsylvania State University\nPress.",
                "Hamington, Maurice and Celia Bardwell-Jones (eds.), 2012,\n<em>Contemporary Feminist Pragmatism</em>, New York: Routledge.",
                "Harper, Ida Husted (ed.), 1922, <em>History of Women’s Suffrage:\nVolume 5, 1900–1920</em>, New York: Fowler &amp; Wells. ",
                "Hart, Carroll Guen, 1993, “Power in the Service of Love:\nJohn Dewey’s Logic and the Dream of a Common Language”,\n<em>Hypatia</em>, 8(2): 190–214.",
                "Heldke, Lisa, 1987, “John Dewey and Evelyn Fox Keller: A\nShared Epistemological Tradition”, <em>Hypatia</em>, 2(3):\n129–140.",
                "Hook, Sidney, 1940 [1991], <em>Reason, Social Myths and\nDemocracy</em>, Buffalo, NY: Prometheus Books.",
                "James, William, 1909 [1977], <em>A Pluralistic Universe</em>,\nCambridge: Harvard University Press.",
                "James, V. Denise, 2009, “Theorizing Black Feminist\nPragmatism: Forethoughts on the Practice and Purpose of Philosophy as\nEnvisioned by Black Feminists and John Dewey”, <em>Journal of\nSpeculative Philosophy</em>, 23(2): 92–99.",
                "–––, 2013, “Reading Anna J. Cooper with\nWilliam James: black feminist visionary pragmatism, philosophy’s\nculture of justification, and belief”, <em>The Pluralist</em>,\n8(3): 32–45. doi:10.5406/pluralist.8.3.0032",
                "Kaag, John, 2011, <em>Idealism, Pragmatism and Feminism: The\nPhilosophy of Ella Lyman Cabot</em>, Lanham: Lexington Books.",
                "Keith, Heather E., 1999, “Feminism and Pragmatism: George\nHerbert Mead’s Ethics of Care”, <em>Transactions of the Charles\nS. Peirce Society</em>,  35(2): 328–344.",
                "Kloppenberg, James T., 1986, <em>Uncertain Victory: Social\nDemocracy and Progressivism in European and American Thought</em>, New\nYork: Oxford University Press.",
                "Kolb, David, 2003, <em>Experiential Learning: Experience as the\nSource of Learning and Development</em>, Upper Saddle River, NJ:\nPrentice Hall.",
                "Knight, Louise W., 2005, <em>Citizen: Jane Addams and the Struggle\nfor Democracy</em>, Chicago: University of Chicago Press.",
                "–––, 2010, <em>Jane Addams: Spirit in\nAction</em>, New York: W. W. Norton &amp; Company.",
                "Lagemann, Ellen Condliffe, 1989, “The Plural Worlds of\nEducational Research”, <em>History of Education Quarterly</em>,\n29(2): 184–214.",
                "–––, 1994, “Jane Addams: An Educational\nBiography”, Introduction to <em>Jane Addams: On Education</em>,\nEllen Condliffe Lagemann (ed.), New Brunswick, NJ: Transaction\nPublishers, 1985, 1–42; page reference to the revised edition of\n1994.",
                "Lake, Danielle, 2014, “Jane Addams and Wicked Problems:\nPutting the Pragmatic Method to Use”, <em>The Pluralist</em>,\n9(3): 77–94.",
                "–––, 2015, “Dewey, Addams, and Beyond: A\nContext-Sensitive, Dialogue-Driven, Action-Based Pedagogy for\nPreparing Students to Confront Local Wicked Problems”,\n<em>Contemporary Pragmatism</em>, 12: 251–274.",
                "–––, 2019, “Pragmatic Engagement in the\nCity: Philosophy as a Means for Catalyzing Collective, C\nCapacity (Lessons from John Dewey and Jane Addams)”, in S. Meager\n&amp; R. Sundstrom (eds.), <em>Handbook on Philosophy of the City</em>,\nNew York:Routledge, 115– 130.",
                "–––, 2020, “Pragmatist Feminism as\nPhilosophic Activism: The {R}evolution of Grace Lee\nBoggs”, <em>The Pluralist</em>, 15(1): 25–45.",
                "Lee, Grace Chin, 1945, <em>George Herbert Mead: Philosopher of the\nSocial Individual</em>, New York: Kings Crown Press.",
                "Linn, James Weber, 2000, <em>Jane Addams: A Biography</em>,\nChicago: University of Illinois.",
                "Lowe, Barbara J., 2011, “Ethereal Identities and Ethereal\nSubjectivity: An American Pragmatist Appreciation of María\nLugones’ Theory of Oppression and\nResistance”, <em>Inter-American Journal of Philosophy</em>,\n2(1): 11–25.",
                "–––, 2019, “The Right to Belong and\nImmigration: A Feminist Pragmatist Analysis”, <em>Contemporary\nPragmatism</em>, 16 (2–3): 268–285.",
                "Mahowald, Mary B., 1997, “What Classical American\nPhilosophers Missed: Jane Addams, Critical Pragmatism, and Cultural\nFeminism”, <em>Journal of Value Inquiry</em>, 31(1):\n39–65.",
                "McHugh, Nancy A., 2015, <em>The Limits of Knowledge: Generating\nPragmatist Feminist Cases for Situated Knowing</em>, Albany: State\nUniversity of New York.",
                "McKenna, Erin, 2001, <em>The Task of Utopia: A Pragmatist and\nFeminist Perspective</em>, Lanham, MA: Rowman and Littlefield\nPublishers.",
                "–––, 2013, <em>Pets, People, and\nPragmatism</em>,  New York: Fordham.",
                "–––, 2015, “Women and William\nJames”, in Tarver and Sullivan 2015: 79–97.",
                "–––, 2018, <em>Livestock: Food, Fiber, and\nFriends</em>, Athens, GA: University of Georgia Press.",
                "McKenna, Erin and Scott L. Pratt, 2015, <em>American Philosophy:\nFrom Wounded Knee to the Present</em>, London: Bloomsbury\nPublishing.",
                "Miller, Marjorie, 1992, “Feminism and Pragmatism: On the\nArrival of a ‘Ministry of Disturbance, a Regulated Source of\nAnnoyance; A Destroyer of Routine; An Underminer of\nComplacency’”, <em>The Monist</em>, 75(4):\n445–457.",
                "Minnich, Elizabeth Kamarck, 1990, <em>Transforming Knowledge</em>,\nPhiladelphia: Temple University Press.",
                "–––, 1999, “Experiential Education:\nDemocratizing Educational Philosophies”, <em>Liberal\nEducation</em>, 85(3): 6–15.",
                "–––, 2001, “Philosophy, Education, and the\nAmerican Tradition of Aspirational Democracy”, in Seigfried\n2001: 95–102.",
                "Miranda, Wilma R., 1980, “Implications in Dewey for Feminist\nTheory in Education”, <em>Educational Horizons</em>, 58:\n197–202.",
                "Mitchell, Lucy Sprague, 1953, <em>Two Lives: The Story of Wesley\nClair Mitchell and Myself</em>, New York: Simon and Schuster.",
                "Moen, Marcia K., 1991, “Peirce’s Pragmatism as Resource for\nFeminism”, <em>Transactions of the Charles S. Peirce Society: A\nQuarterly Journal in American Philosophy</em>, 27(4): 435–450.",
                "Moskop, Wynne Walker, 2020, <em>Jane Addams on Inequality and Political\nFriendship</em>, New York: Routledge.",
                "Norton, Bryan, 2005, <em>Sustainability: A Philosophy of Adaptive\nEcosystem Management</em>, Chicago: University of Chicago Press.",
                "O’Neill, Eileen, 1998, “Disappearing Ink. Early Modern\nWomen Philosophers and their Fate in History”, in J.A. Kourany\n(ed.), <em>Philosophy in a Feminist Voice: Critiques and\nReconstructions</em>, Princeton: Princeton University Press, pp. 17–62.",
                "Parker, Kelly, 2010, “Ecohumanities Pedagogy: An Experiment\nin Radical Service-Learning”, <em>Contemporary Pragmatism</em>,\n9(1): 223–251.",
                "Peirce, Charles S., 1877, “ The Fixation of\nBelief”, <em>Popular Science Monthly</em>, 12: 1–15.",
                "Pratt, Scott L., 2002, <em>Native Pragmatism: Rethinking the Roots\nof American Philosophy</em>, Bloomington, IN: Indiana University\nPress.",
                "–––, 2011, “American Power: Mary Parker\nFollett and Michel Foucault”, <em>Foucault Studies</em>,\n11(Feb.): 76–91.",
                "Ramaley, Judith A., 2014, “The Changing Role of Higher\nEducation: Learning to Deal with Wicked Problems”, <em>Journal\nof Higher Education, Outreach, and Engagement</em>, 18(3):\n7–22.",
                "Randall, Mercedes M. (ed.), 1972, <em>Beyond Nationalism: The\nSocial Thought of Emily Greene Balch</em>, New York: Twayne\nPublishers.",
                "Renzi, Kristen L., 2019, <em>An Ethic of Innocence: Pragmatism,\nModernity, and Women’s Choice Not to Know</em>, Albany: State\nUniversity of New York Press.",
                "Rockefeller, Steven C., 1991, <em>John Dewey: Religious Faith and\nDemocratic Humanism</em>, New York: Columbia University Press.",
                "Rooney, Phyllis, 1993, “Feminist-Pragmatist Revisionings of\nReason, Knowledge, and Philosophy”, <em>Hypatia</em>,\n8(2): 15–37.",
                "Rosenberg, Rosalind, 1982, <em>Beyond Separate Spheres:\nIntellectual Roots of Modern Feminism</em>, New Haven: Yale University\nPress.",
                "Roshanravan, Shireen, 2018, “The Coalitional Imperative of\nAsian American Feminist Visibility”, <em>The Pluralist</em>,\n13(Spring): 115–130.",
                "Rorty, Richard, 1991, “Feminism and Pragmatism”,\n<em>Michigan Quarterly Review</em>, 30(2): 231–258.",
                "Royce, Josiah, <em>et al</em>., 1895 [1993], “1895 Letter\nfrom the Harvard Philosophy Department”, reprinted in\n<em>Hypatia</em>, 8(2): 232–233.",
                "Schutte, Ofelia, 2000, “Cultural Alterity: Cross-Cultural\nCommunication and Feminist Theory in North-South Contexts”, in\n<em>Decentering the Center: Philosophy for a Multicultural,\nPost-Colonial, and Feminist World</em>, Uma Narayan and Sandra Harding\n(ed.), Bloomington: Indiana University Press, pp. 47–66. ",
                "Seigfried, Charlene Haddock, 1989, “Pragmatism, Feminism and\nSensitivity to Context”, in <em>Who cares? Theory Research and\nEducation Implication of the Ethic of Care</em>, Mary M. Brabeck\n(ed.), New York: Praeger Press, pp.  63–81. ",
                "–––, 1991, “Where are All the Pragmatist\nFeminists?” <em>Hypatia</em>, 6(2): 1–20.",
                "–––, 1992, “Classical American\nPhilosophy’s Invisible Women”, <em>Canadian Review of\nAmerican Studies</em>, 22(1): 83–116.",
                "–––, 1993a, “Shared Communities of\nInterest: Feminism and Pragmatism”, <em>Hypatia</em>, 8(2):\n1–14.",
                "–––, 1993b, “Validating Women’s\nExperience Pragmatically”, <em>Philosophy and the Reconstruction\nof Culture: Pragmatic Essays After Dewey</em>, John Stuhr (ed.),\nAlbany: State University Press, pp. 111–130. ",
                "––– (ed.), 1993c, <em>Hypatia</em> (Special\nIssue on Feminism and Pragmatism), Volume 8(2).",
                "–––, 1996, <em>Pragmatism and Feminism:\nReweaving the Social Fabric</em>, Chicago: The University of Chicago\nPress.",
                "–––, 1998, “John Dewey’s Pragmatist\nFeminism”, in Larry Hickman (ed.), <em>Reading Dewey:\nInterpretations for a Postmodern Generation</em>, Bloomington: Indiana\nUniversity Press, pp. 187–216. ",
                "–––, 1999, “Socializing Democracy: Jane\nAddams and John Dewey”, <em>Philosophy of the Social\nSciences</em>, 29(2): 207–230.  doi:10.1177/004839319902900203",
                "–––, 2001, <em>Feminist Interpretations of John\nDewey</em>, University Park, PA: Pennsylvania State University\nPress.",
                "Shields, Patricia, 2016, “Building the Fabric of Peace: Jane\nAddams &amp; Peaceweaving”, <em>Global Virtue Ethics Review</em>,\n7(3): 21–33.",
                "––– (ed.), 2017, <em>Jane Addams: Progressive\nPioneer of Peace, Philosophy, Sociology, Social Work and Public\nAdministration</em>, Cham: Springer International\nPublishing.",
                "Singer, Beth J., 1999, <em>Pragmatism, Rights, and Democracy</em>,\nAnn Arbor, MI: Fordham University Press.",
                "Sklar, Kathryn Kish, Anya Schüler, and Susan Strasser (eds.),\n1998, <em>Social Justice Feminists in the United States and\nGermany</em>, Ithaca, NY: Cornell University Press.",
                "Smith, Joan K., 1977, “The Influence of Ella Flagg Young on\nJohn Dewey’s Educational Thought”, <em>Review Journal of\nPhilosophy and Social Science</em>, 2: 143–154.",
                "Sullivan, Shannon, 2001, <em>Living Across and Through Skins:\nTransactional Bodies, Pragmatism and Feminism</em>, Bloomington, IN:\nIndiana University Press.",
                "–––, 2006, <em>Revealing Whiteness: The\nUnconscious Habits of Racial Privilege</em>, Indiana University\nPress.",
                "Svanström, Magdalena, Francisco J. Lozano-García, and\nDebra Rowe, 2008, “Learning Outcomes for Sustainable Development\nin Higher Education”, <em>International Journal for\nSustainability in Higher Education</em>, 9(3): 271–282.",
                "Taft, Jessie, 1913 [1993], “The Woman Movement as Part of\nthe Larger Social Situation” (excerpt from her doctoral\ndissertation <em>The Woman Movement from the Point of View of Social\nConsciousness</em>), <em>Hypatia</em>, 8(2): 219–229.",
                "Tarver, Erin C. and Shannon Sullivan (eds.), 2015, <em>Feminist\nInterpretations of William James</em>, University Park, PA: The\nPennsylvania State University Press.",
                "Thayer-Bacon, Barbara, 2005, “Peirce on Education:\nDiscussion of Peirce’s Definition of a University”, <em>Studies\nin Philosophy and Education</em>,  24(3–4):\n317–325.",
                "Upin, Jane, 1993, “Charlotte Perkins Gilman: Instrumentalism\nBeyond Dewey”, <em>Hypatia</em>, 8(2): 38–63.",
                "Whipps, Judy, 2004, “Jane Addams’s Social Thought as a\nModel for a Pragmatist-Feminist Communitarianism”,\n<em>Hypatia</em>, 19(3): 118–133.",
                "–––, 2006, “The Feminist Pacifism of Emily\nGreene Balch, Nobel Peace Laureate”, <em>National Womens’\nStudies Association Journal</em>, 18(3): 122–132.",
                "–––, 2008a, “‘Learn to Earn’:\nA Pragmatist Response to Contemporary Dialogues about Industrial\nEducation”, <em>Journal of Speculative Philosophy</em>, NS\n22(1): 59–67.",
                "–––, 2008b, “Jane Addams:\nPragmatist-Feminist Democracy in a Global Context”, in Sor-Hoon\nTan and John Whalen-Bridge (eds.), <em>Democracy as Culture: Deweyan\nPragmatism in a Globalizing World</em>, Albany NY: State University of\nNew York Press, pp. 81–90. ",
                "–––, 2014a, “Local Community: Place-Based\nPragmatism and Feminist Education”, <em>The Pluralist</em>,\n9(2): 22–41. doi:10.5406/pluralist.9.2.0029",
                "–––, 2014b, “A Pragmatist Reading of Mary\nParker Follett’s Integrative Process”, <em>Transactions of\nthe Charles Peirce Society</em>, 50(3): 405–424.",
                "–––, 2019a, “Ethical Obligations of\nThinking in Dark Times: A Deweyan Reading of Hannah\nArendt”, <em>Contemporary Pragmatism</em>, 16:\n201–216.",
                "–––, 2019b, “Dewey, Addams and Design\nThinking: Pragmatist Feminist Innovation and Design Thinking:\nPragmatist Feminist Innovation for Democratic\nChange”, <em>Oxford Handbook of Dewey</em>, Steven Fesmire\n(ed.), Oxford: Oxford University Press, 313–334.",
                "Yun Lee, Lisa, 2011, “Hungry for Peace: Jane Addams and the\nHull-House Museum’s Contemporary Struggle for Food\nJustice”, <em>Peace &amp; Change</em>, 36(1): 62–79."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Addams, Jane, 1910 [1990], <em>Twenty Years at Hull House,\nwith Autobiographical Notes</em>, Urbana, IL: University of Illinois\nPress.</li>\n<li>–––, 1902 [2002], <em>Democracy and Social\nEthics</em>, edited with Introduction by Charlene Haddock Seigfried,\nUrbana, IL: University of Illinois Press.</li>\n<li>–––, 1922 [2003], <em>Peace and Bread in Time of\nWar in Jane Addams’s Writings on Peace</em>, edited with\nintroductions by Marilyn Fischer and Judy Whipps, Bristol: Thoemmes\nPress.</li>\n<li>–––, <em>On Education</em>, recently compiled\ncollection of essays, Ellen Condliffe Lagemann (ed.), New Brunswick,\nNJ: Transaction Publishers, 1985; revised edition 1994.</li>\n<li>Alessandri, Mariana and Alexander Stehn, 2020. “La Mexicana\nen la Chicana: The Mexican Sources of Anzaldúa’s\nInter-American Philosophy”, <em>Inter-American Journal of\nPhilosophy</em>, 1(11): 44–62.</li>\n<li>Anderson, Elizabeth. 2006. “The Epistemology of\nDemocracy”, <em>Episteme: A Journal of Social Epistemology</em>,\n3: 8–22.</li>\n<li>–––. 2014. “Journeys of a Feminist\nPragmatist”, <em>Proceedings and Addresses of the American\nPhilosophical Association</em>, 88: 71–87.</li>\n<li>Antler, Joyce, 1981, “Feminism as a Life Process: The Life\nand Career of Lucy Sprague Mitchell”, <em>Feminist Studies</em>,\n7: 134–157. doi:10.2307/3177675 </li>\n<li>–––, 1987a, <em>The Educated Woman and\nProfessionalization: The Struggle for a New Feminine Identity,\n1890–1920</em>, New York: Garland.</li>\n<li>–––, 1987b, <em>Lucy Sprague Mitchell: The\nMaking of a Modern Woman</em>, New Haven and London: Yale University\nPress.</li>\n<li>Banerjee, Amrita, 2008, “Follett’s Pragmatist Ontology\nof Relations: Potentials for a Feminist Perspective on Violence”,\n<em>Journal of Speculative Philosophy</em>, 22(1): 3–11.</li>\n<li>Bardwell-Jones, Celia, 2008, “Border Communities and Royce:\nThe Problem of Translation and Reinterpreting Feminist\nEmpiricism”, <em>Journal of Speculative Philosophy</em>, 22(1):\n12–22.</li>\n<li>Boggs, Grace Lee and Scott Kurashigo, 2012, <em>The Next American\nRevolution: Sustainable Activism for the 21st Century</em>, Berkeley:\nUniversity of California.</li>\n<li>Boggs, James and Grace Lee, 1974, <em>Revolution and Evolution in\nthe Twentieth Century</em>, New York: Monthly Review Press.</li>\n<li>Boronat, Núria Sara Mires, 2019, “Peace, Bread, and\nIdeas for a Cosmopolitan World: Addams’ Unknown Pragmatist\nLegacy Today”, in K. P. Skowronski and S. Philström\n(eds.), <em>Pragmatism, Kant and Kantianism in the Twenty-first\nCentury</em> (Nordic Studies in Pragmatism: Volume 4), Helsinki,\n307–326.</li>\n<li>–––, 2013, “Games People Play. George\nHerbert Mead’s Concept of Game and Play in a Contemporary\nContext”, in T. Burke and K. Skwronski (eds.), <em>George Herbert\nMead in the Twenty First Century</em>, Lanham: Lexington Books, \n163–17.</li>\n<li>Boydston, Jo Ann, 1975, “John Dewey and the New\nFeminism”, <em>Teachers College Record</em>, 76:\n442–448.</li>\n<li>Brown, Valerie A. and Judith A. Lambert, 2013, <em>Collective\nLearning for Transformational Change: A Guide to Collaborative\nAction</em>, New York: Routledge.</li>\n<li>Cooper, Anna Julia, 1998, <em>The Voice of Anna Julia Cooper:\nIncluding a Voice from the South and Other Important Essays, Papers,\nand Letters</em>, Charles Lemert and Esme Bhan (eds.), Lanham and New\nYork: Rowman and Littlefield Publishing.</li>\n<li>Cunningham, Craig, Granger, David, Jane Fowler Morse, Barbara\nStengel and Terri Wilson, 2007, “Dewey, Women, and Weirdoes:\nor, the Potential Rewards for Scholars who Dialogue across\nDifference”, <em>E&amp;C/Education and Culture</em>, 23(2):\n27–62.</li>\n<li>Dewey, John, 1909 [1977], “The Influence of Darwinism on\nPhilosophy”, in <em>John Dewey: The Middle Works\n1899–1924</em>, Jo Ann Boydson (ed.), Carbondale: Southern\nIllinois University Press.</li>\n<li>–––, 1916 [1985], <em>Democracy and\nEducation</em>, in <em>John Dewey: The Middle Works, Vol. 9:\n1916</em>, Jo Ann Boydson (ed.), Carbondale: Southern Illinois\nUniversity Press.</li>\n<li>–––, 1984b [1939], <em>Experience and\nEducation</em>, in <em>John Dewey: The Later Works, Volume 3:\n1938–39</em>, Jo Ann Boydson (ed.), Carbondale: Southern\nIllinois University Press.</li>\n<li>–––, 1984c [1945], “Democratic versus\nCoercive International Organization: The Realism of Jane\nAddams”, in <em>John Dewey: The Later Works, Volume 15:\n1942–48</em>, Jo Ann Boydson (ed.), Carbondale: Southern\nIllinois University Press.</li>\n<li>Dielman, Susan, 2012, “Solving the Problem of Epistemic\nExclusion: A Pragmatist-Feminist Approach”, in Hamington and\nBardwell-Jones 2012: 90–114.</li>\n<li>Dorstewitz, Phillipp, 2016, “Imagining Social\nTransformations: Territory Making and the Project of Radical\nPragmatism”, <em>Contemporary Pragmatism</em>, 13:\n261–381.</li>\n<li>Duran, Jane, 1993, “The Intersection of Pragmatism and\nFeminism”, <em>Hypatia</em>, 8(2): 159–171.</li>\n<li>Elstain, Jean Bethke, 2002, <em>The Jane Addams Reader</em>, New\nYork: Basic Books.</li>\n<li>Epstein-Corbin, Sean, 2014,“ Pragmatism, Feminism, and the\nSentimental Subject”, <em>Transactions of the Charles S. Peirce\nSociety: A Quarterly Journal in American Philosophy</em>, 50(2):\n220–245.</li>\n<li>Fischer, Clara, 2014, <em>Gendered Readings of Change: A\nFeminist-Pragmatist Approach</em>, New York: Palgrave MacMillan.</li>\n<li>–––, 2016, “Feminist Philosophy,\nPragmatism, and the ‘Turn to Affect’: A Genealogical\nCritique”, <em>Hypatia: A Journal of Feminist Philosophy</em>,\n31(4): 810–826.</li>\n<li>Fischer Clara and Luna Dolezal (eds.), 2018, <em>New Feminist\nPerspectives on Embodiment</em>, New York: Palgrave MacMillan.</li>\n<li>Fischer, Clara and Morris, 2019, “John Dewey and Critical\nPhilosophies for Critical Political Times”, <em>Contemporary\nPragmatism</em>, 16(2–3): 141–146.</li>\n<li>Fischer, Marilyn, 2000, “Jane Addams’s Feminist\nEthics”, in <em>Presenting Women Philosophers</em>, Cecile T.\nTougas and Sara Ebenreck (eds.), Philadelphia: Temple University\nPress, pp. 51–58.</li>\n<li>–––, 2004, <em>On Addams</em>, Canada: Wadsworth\nPhilosophers Series.</li>\n<li>–––, 2005, “Feminism and the Art of\nInterpretation: Or, Reading the First Wave to Think about the Second\nand Third Waves”, in Sally J. Scholz (ed.), <em>APA Newsletter\non Feminism and Philosophy</em>, 1(5): 3–6.</li>\n<li>–––, 2007, “A Pragmatism Cosmopolitan\nMoment: Reconfiguring Nussbaum’s Cosmopolitan Concentric\nCircles”, <em>Journal of Speculative Philosophy</em>, 21(3):\n151–165.</li>\n<li>–––, 2011, “Interpretation’s\nContrapuntal Pathways: Addams and the Averbuch Affair”,\n<em>Transactions of the Charles S. Peirce Society</em>, 47(4):\n482–506. doi:10.2979/trancharpeirsoc.47.4.482 </li>\n<li>–––, 2013, “Reading Dewey’s\nPolitical Philosophy through Addams’s Political\nCompromises”, <em>American Catholic Philosophical\nQuarterly</em>, 87(2): 227–243. doi:10.5840/acpq201387219</li>\n<li>–––, 2016, “A Pluralistic Universe in\nTwenty Years”, <em>The Pluralist</em>, 11(1): 1–18.\ndoi:10.5406/pluralist.11.1.0001 </li>\n<li>–––, 2018, “The Moral Equivalent of War:\nWilliam James’s Minor Variation on Common Themes”, <em>William\nJames Studies</em>, 14(Spring): 92–119.</li>\n<li>–––, 2019, <em>Jane Addams’s Evolutionary\nTheorizing: Constructing ‘Democracy and Social Ethics’</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>Fischer, Marilyn and Judy D. Whipps (eds.), 2003, <em>Jane\nAddams’s Writings on Peace</em>, Volumes 1–4, Bristol:\nThoemmes Press.</li>\n<li>Fischer, Marilyn, Carol Nackenoff, and Wendy Chmielewski (eds.),\n2009, <em>Jane Addams and the Practice of Democracy</em>, Chicago:\nUniversity of Illinois Press.</li>\n<li>Follett, Mary Parker, 1918, <em>The New State: Group Organization,\nthe Solution of Popular Government</em>, New York: Longmans,\nGreen.</li>\n<li>–––, 1924 [1951], <em>Creative Experience</em>,\nNew York: Peter Smith Publishers.</li>\n<li>Gatens-Robinson, Eugenie, 1991, “Dewey and the Feminist\nSuccessor Science Project”, <em>Transactions of the Charles S.\nPeirce Society</em>, 27(4): 417–433.</li>\n<li>Green, Judith M., 1999, <em>Deep Democracy: Community, Diversity\nand Transformation</em>, Lanham, MA: Rowman and Littlefield\nPublishers.</li>\n<li>–––, 2008, <em>Pragmatism and Social Hope:\nDeepening Democracy in Global Contexts</em>, New York: Columbia\nUniversity Press.</li>\n<li>Greene, Maxine, 1988, <em>The Dialectic of Freedom</em>. New York:\nTeachers College Press.</li>\n<li>Gordon, Lynn, 1990, <em>Gender and Education in the Progressive\nEra</em>, New Haven: Yale University Press.</li>\n<li>Griffith, Susan C., 2009, “Profiles and Perspectives: Jane\nAddams, Stories and Imagination”, <em>Language Arts</em>, 86(4):\n302–310.</li>\n<li>Hackett, Francis, 1969, “Hull House—A Souvenir”,\nin <em>Eighty Years at Hull House</em>, Allen F. Davis and Mary Lynn\nMcCree (eds.), Chicago: Quadrangle Books, pp. 71–76. </li>\n<li>Hamington, Maurice, 2004a, <em>Embodied Care: Jane Addams, Maurice\nMerleau-Ponty, and Feminist Ethics</em>, Chicago: University of\nIllinois Press.</li>\n<li>–––, 2004b, “Addams’s Radical\nDemocracy: Moving Beyond Rights”, <em>Journal of Speculative\nPhilosophy</em>, 18(3): 216–233.</li>\n<li>–––, 2009, <em>The Social Philosophy of Jane\nAddams</em>, Urbana and Chicago: University of Illinois Press.</li>\n<li>––– (ed.), 2010, <em>Feminist Interpretations of\nJane Addams</em>, University Park, PA: Pennsylvania State University\nPress.</li>\n<li>Hamington, Maurice and Celia Bardwell-Jones (eds.), 2012,\n<em>Contemporary Feminist Pragmatism</em>, New York: Routledge.</li>\n<li>Harper, Ida Husted (ed.), 1922, <em>History of Women’s Suffrage:\nVolume 5, 1900–1920</em>, New York: Fowler &amp; Wells. </li>\n<li>Hart, Carroll Guen, 1993, “Power in the Service of Love:\nJohn Dewey’s Logic and the Dream of a Common Language”,\n<em>Hypatia</em>, 8(2): 190–214.</li>\n<li>Heldke, Lisa, 1987, “John Dewey and Evelyn Fox Keller: A\nShared Epistemological Tradition”, <em>Hypatia</em>, 2(3):\n129–140.</li>\n<li>Hook, Sidney, 1940 [1991], <em>Reason, Social Myths and\nDemocracy</em>, Buffalo, NY: Prometheus Books.</li>\n<li>James, William, 1909 [1977], <em>A Pluralistic Universe</em>,\nCambridge: Harvard University Press.</li>\n<li>James, V. Denise, 2009, “Theorizing Black Feminist\nPragmatism: Forethoughts on the Practice and Purpose of Philosophy as\nEnvisioned by Black Feminists and John Dewey”, <em>Journal of\nSpeculative Philosophy</em>, 23(2): 92–99.</li>\n<li>–––, 2013, “Reading Anna J. Cooper with\nWilliam James: black feminist visionary pragmatism, philosophy’s\nculture of justification, and belief”, <em>The Pluralist</em>,\n8(3): 32–45. doi:10.5406/pluralist.8.3.0032</li>\n<li>Kaag, John, 2011, <em>Idealism, Pragmatism and Feminism: The\nPhilosophy of Ella Lyman Cabot</em>, Lanham: Lexington Books.</li>\n<li>Keith, Heather E., 1999, “Feminism and Pragmatism: George\nHerbert Mead’s Ethics of Care”, <em>Transactions of the Charles\nS. Peirce Society</em>,  35(2): 328–344.</li>\n<li>Kloppenberg, James T., 1986, <em>Uncertain Victory: Social\nDemocracy and Progressivism in European and American Thought</em>, New\nYork: Oxford University Press.</li>\n<li>Kolb, David, 2003, <em>Experiential Learning: Experience as the\nSource of Learning and Development</em>, Upper Saddle River, NJ:\nPrentice Hall.</li>\n<li>Knight, Louise W., 2005, <em>Citizen: Jane Addams and the Struggle\nfor Democracy</em>, Chicago: University of Chicago Press.</li>\n<li>–––, 2010, <em>Jane Addams: Spirit in\nAction</em>, New York: W. W. Norton &amp; Company.</li>\n<li>Lagemann, Ellen Condliffe, 1989, “The Plural Worlds of\nEducational Research”, <em>History of Education Quarterly</em>,\n29(2): 184–214.</li>\n<li>–––, 1994, “Jane Addams: An Educational\nBiography”, Introduction to <em>Jane Addams: On Education</em>,\nEllen Condliffe Lagemann (ed.), New Brunswick, NJ: Transaction\nPublishers, 1985, 1–42; page reference to the revised edition of\n1994.</li>\n<li>Lake, Danielle, 2014, “Jane Addams and Wicked Problems:\nPutting the Pragmatic Method to Use”, <em>The Pluralist</em>,\n9(3): 77–94.</li>\n<li>–––, 2015, “Dewey, Addams, and Beyond: A\nContext-Sensitive, Dialogue-Driven, Action-Based Pedagogy for\nPreparing Students to Confront Local Wicked Problems”,\n<em>Contemporary Pragmatism</em>, 12: 251–274.</li>\n<li>–––, 2019, “Pragmatic Engagement in the\nCity: Philosophy as a Means for Catalyzing Collective, C\nCapacity (Lessons from John Dewey and Jane Addams)”, in S. Meager\n&amp; R. Sundstrom (eds.), <em>Handbook on Philosophy of the City</em>,\nNew York:Routledge, 115– 130.</li>\n<li>–––, 2020, “Pragmatist Feminism as\nPhilosophic Activism: The {R}evolution of Grace Lee\nBoggs”, <em>The Pluralist</em>, 15(1): 25–45.</li>\n<li>Lee, Grace Chin, 1945, <em>George Herbert Mead: Philosopher of the\nSocial Individual</em>, New York: Kings Crown Press.</li>\n<li>Linn, James Weber, 2000, <em>Jane Addams: A Biography</em>,\nChicago: University of Illinois.</li>\n<li>Lowe, Barbara J., 2011, “Ethereal Identities and Ethereal\nSubjectivity: An American Pragmatist Appreciation of María\nLugones’ Theory of Oppression and\nResistance”, <em>Inter-American Journal of Philosophy</em>,\n2(1): 11–25.</li>\n<li>–––, 2019, “The Right to Belong and\nImmigration: A Feminist Pragmatist Analysis”, <em>Contemporary\nPragmatism</em>, 16 (2–3): 268–285.</li>\n<li>Mahowald, Mary B., 1997, “What Classical American\nPhilosophers Missed: Jane Addams, Critical Pragmatism, and Cultural\nFeminism”, <em>Journal of Value Inquiry</em>, 31(1):\n39–65.</li>\n<li>McHugh, Nancy A., 2015, <em>The Limits of Knowledge: Generating\nPragmatist Feminist Cases for Situated Knowing</em>, Albany: State\nUniversity of New York.</li>\n<li>McKenna, Erin, 2001, <em>The Task of Utopia: A Pragmatist and\nFeminist Perspective</em>, Lanham, MA: Rowman and Littlefield\nPublishers.</li>\n<li>–––, 2013, <em>Pets, People, and\nPragmatism</em>,  New York: Fordham.</li>\n<li>–––, 2015, “Women and William\nJames”, in Tarver and Sullivan 2015: 79–97.</li>\n<li>–––, 2018, <em>Livestock: Food, Fiber, and\nFriends</em>, Athens, GA: University of Georgia Press.</li>\n<li>McKenna, Erin and Scott L. Pratt, 2015, <em>American Philosophy:\nFrom Wounded Knee to the Present</em>, London: Bloomsbury\nPublishing.</li>\n<li>Miller, Marjorie, 1992, “Feminism and Pragmatism: On the\nArrival of a ‘Ministry of Disturbance, a Regulated Source of\nAnnoyance; A Destroyer of Routine; An Underminer of\nComplacency’”, <em>The Monist</em>, 75(4):\n445–457.</li>\n<li>Minnich, Elizabeth Kamarck, 1990, <em>Transforming Knowledge</em>,\nPhiladelphia: Temple University Press.</li>\n<li>–––, 1999, “Experiential Education:\nDemocratizing Educational Philosophies”, <em>Liberal\nEducation</em>, 85(3): 6–15.</li>\n<li>–––, 2001, “Philosophy, Education, and the\nAmerican Tradition of Aspirational Democracy”, in Seigfried\n2001: 95–102.</li>\n<li>Miranda, Wilma R., 1980, “Implications in Dewey for Feminist\nTheory in Education”, <em>Educational Horizons</em>, 58:\n197–202.</li>\n<li>Mitchell, Lucy Sprague, 1953, <em>Two Lives: The Story of Wesley\nClair Mitchell and Myself</em>, New York: Simon and Schuster.</li>\n<li>Moen, Marcia K., 1991, “Peirce’s Pragmatism as Resource for\nFeminism”, <em>Transactions of the Charles S. Peirce Society: A\nQuarterly Journal in American Philosophy</em>, 27(4): 435–450.</li>\n<li>Moskop, Wynne Walker, 2020, <em>Jane Addams on Inequality and Political\nFriendship</em>, New York: Routledge.</li>\n<li>Norton, Bryan, 2005, <em>Sustainability: A Philosophy of Adaptive\nEcosystem Management</em>, Chicago: University of Chicago Press.</li>\n<li>O’Neill, Eileen, 1998, “Disappearing Ink. Early Modern\nWomen Philosophers and their Fate in History”, in J.A. Kourany\n(ed.), <em>Philosophy in a Feminist Voice: Critiques and\nReconstructions</em>, Princeton: Princeton University Press, pp. 17–62.</li>\n<li>Parker, Kelly, 2010, “Ecohumanities Pedagogy: An Experiment\nin Radical Service-Learning”, <em>Contemporary Pragmatism</em>,\n9(1): 223–251.</li>\n<li>Peirce, Charles S., 1877, “ The Fixation of\nBelief”, <em>Popular Science Monthly</em>, 12: 1–15.</li>\n<li>Pratt, Scott L., 2002, <em>Native Pragmatism: Rethinking the Roots\nof American Philosophy</em>, Bloomington, IN: Indiana University\nPress.</li>\n<li>–––, 2011, “American Power: Mary Parker\nFollett and Michel Foucault”, <em>Foucault Studies</em>,\n11(Feb.): 76–91.</li>\n<li>Ramaley, Judith A., 2014, “The Changing Role of Higher\nEducation: Learning to Deal with Wicked Problems”, <em>Journal\nof Higher Education, Outreach, and Engagement</em>, 18(3):\n7–22.</li>\n<li>Randall, Mercedes M. (ed.), 1972, <em>Beyond Nationalism: The\nSocial Thought of Emily Greene Balch</em>, New York: Twayne\nPublishers.</li>\n<li>Renzi, Kristen L., 2019, <em>An Ethic of Innocence: Pragmatism,\nModernity, and Women’s Choice Not to Know</em>, Albany: State\nUniversity of New York Press.</li>\n<li>Rockefeller, Steven C., 1991, <em>John Dewey: Religious Faith and\nDemocratic Humanism</em>, New York: Columbia University Press.</li>\n<li>Rooney, Phyllis, 1993, “Feminist-Pragmatist Revisionings of\nReason, Knowledge, and Philosophy”, <em>Hypatia</em>,\n8(2): 15–37.</li>\n<li>Rosenberg, Rosalind, 1982, <em>Beyond Separate Spheres:\nIntellectual Roots of Modern Feminism</em>, New Haven: Yale University\nPress.</li>\n<li>Roshanravan, Shireen, 2018, “The Coalitional Imperative of\nAsian American Feminist Visibility”, <em>The Pluralist</em>,\n13(Spring): 115–130.</li>\n<li>Rorty, Richard, 1991, “Feminism and Pragmatism”,\n<em>Michigan Quarterly Review</em>, 30(2): 231–258.</li>\n<li>Royce, Josiah, <em>et al</em>., 1895 [1993], “1895 Letter\nfrom the Harvard Philosophy Department”, reprinted in\n<em>Hypatia</em>, 8(2): 232–233.</li>\n<li>Schutte, Ofelia, 2000, “Cultural Alterity: Cross-Cultural\nCommunication and Feminist Theory in North-South Contexts”, in\n<em>Decentering the Center: Philosophy for a Multicultural,\nPost-Colonial, and Feminist World</em>, Uma Narayan and Sandra Harding\n(ed.), Bloomington: Indiana University Press, pp. 47–66. </li>\n<li>Seigfried, Charlene Haddock, 1989, “Pragmatism, Feminism and\nSensitivity to Context”, in <em>Who cares? Theory Research and\nEducation Implication of the Ethic of Care</em>, Mary M. Brabeck\n(ed.), New York: Praeger Press, pp.  63–81. </li>\n<li>–––, 1991, “Where are All the Pragmatist\nFeminists?” <em>Hypatia</em>, 6(2): 1–20.</li>\n<li>–––, 1992, “Classical American\nPhilosophy’s Invisible Women”, <em>Canadian Review of\nAmerican Studies</em>, 22(1): 83–116.</li>\n<li>–––, 1993a, “Shared Communities of\nInterest: Feminism and Pragmatism”, <em>Hypatia</em>, 8(2):\n1–14.</li>\n<li>–––, 1993b, “Validating Women’s\nExperience Pragmatically”, <em>Philosophy and the Reconstruction\nof Culture: Pragmatic Essays After Dewey</em>, John Stuhr (ed.),\nAlbany: State University Press, pp. 111–130. </li>\n<li>––– (ed.), 1993c, <em>Hypatia</em> (Special\nIssue on Feminism and Pragmatism), Volume 8(2).</li>\n<li>–––, 1996, <em>Pragmatism and Feminism:\nReweaving the Social Fabric</em>, Chicago: The University of Chicago\nPress.</li>\n<li>–––, 1998, “John Dewey’s Pragmatist\nFeminism”, in Larry Hickman (ed.), <em>Reading Dewey:\nInterpretations for a Postmodern Generation</em>, Bloomington: Indiana\nUniversity Press, pp. 187–216. </li>\n<li>–––, 1999, “Socializing Democracy: Jane\nAddams and John Dewey”, <em>Philosophy of the Social\nSciences</em>, 29(2): 207–230.  doi:10.1177/004839319902900203</li>\n<li>–––, 2001, <em>Feminist Interpretations of John\nDewey</em>, University Park, PA: Pennsylvania State University\nPress.</li>\n<li>Shields, Patricia, 2016, “Building the Fabric of Peace: Jane\nAddams &amp; Peaceweaving”, <em>Global Virtue Ethics Review</em>,\n7(3): 21–33.</li>\n<li>––– (ed.), 2017, <em>Jane Addams: Progressive\nPioneer of Peace, Philosophy, Sociology, Social Work and Public\nAdministration</em>, Cham: Springer International\nPublishing.</li>\n<li>Singer, Beth J., 1999, <em>Pragmatism, Rights, and Democracy</em>,\nAnn Arbor, MI: Fordham University Press.</li>\n<li>Sklar, Kathryn Kish, Anya Schüler, and Susan Strasser (eds.),\n1998, <em>Social Justice Feminists in the United States and\nGermany</em>, Ithaca, NY: Cornell University Press.</li>\n<li>Smith, Joan K., 1977, “The Influence of Ella Flagg Young on\nJohn Dewey’s Educational Thought”, <em>Review Journal of\nPhilosophy and Social Science</em>, 2: 143–154.</li>\n<li>Sullivan, Shannon, 2001, <em>Living Across and Through Skins:\nTransactional Bodies, Pragmatism and Feminism</em>, Bloomington, IN:\nIndiana University Press.</li>\n<li>–––, 2006, <em>Revealing Whiteness: The\nUnconscious Habits of Racial Privilege</em>, Indiana University\nPress.</li>\n<li>Svanström, Magdalena, Francisco J. Lozano-García, and\nDebra Rowe, 2008, “Learning Outcomes for Sustainable Development\nin Higher Education”, <em>International Journal for\nSustainability in Higher Education</em>, 9(3): 271–282.</li>\n<li>Taft, Jessie, 1913 [1993], “The Woman Movement as Part of\nthe Larger Social Situation” (excerpt from her doctoral\ndissertation <em>The Woman Movement from the Point of View of Social\nConsciousness</em>), <em>Hypatia</em>, 8(2): 219–229.</li>\n<li>Tarver, Erin C. and Shannon Sullivan (eds.), 2015, <em>Feminist\nInterpretations of William James</em>, University Park, PA: The\nPennsylvania State University Press.</li>\n<li>Thayer-Bacon, Barbara, 2005, “Peirce on Education:\nDiscussion of Peirce’s Definition of a University”, <em>Studies\nin Philosophy and Education</em>,  24(3–4):\n317–325.</li>\n<li>Upin, Jane, 1993, “Charlotte Perkins Gilman: Instrumentalism\nBeyond Dewey”, <em>Hypatia</em>, 8(2): 38–63.</li>\n<li>Whipps, Judy, 2004, “Jane Addams’s Social Thought as a\nModel for a Pragmatist-Feminist Communitarianism”,\n<em>Hypatia</em>, 19(3): 118–133.</li>\n<li>–––, 2006, “The Feminist Pacifism of Emily\nGreene Balch, Nobel Peace Laureate”, <em>National Womens’\nStudies Association Journal</em>, 18(3): 122–132.</li>\n<li>–––, 2008a, “‘Learn to Earn’:\nA Pragmatist Response to Contemporary Dialogues about Industrial\nEducation”, <em>Journal of Speculative Philosophy</em>, NS\n22(1): 59–67.</li>\n<li>–––, 2008b, “Jane Addams:\nPragmatist-Feminist Democracy in a Global Context”, in Sor-Hoon\nTan and John Whalen-Bridge (eds.), <em>Democracy as Culture: Deweyan\nPragmatism in a Globalizing World</em>, Albany NY: State University of\nNew York Press, pp. 81–90. </li>\n<li>–––, 2014a, “Local Community: Place-Based\nPragmatism and Feminist Education”, <em>The Pluralist</em>,\n9(2): 22–41. doi:10.5406/pluralist.9.2.0029</li>\n<li>–––, 2014b, “A Pragmatist Reading of Mary\nParker Follett’s Integrative Process”, <em>Transactions of\nthe Charles Peirce Society</em>, 50(3): 405–424.</li>\n<li>–––, 2019a, “Ethical Obligations of\nThinking in Dark Times: A Deweyan Reading of Hannah\nArendt”, <em>Contemporary Pragmatism</em>, 16:\n201–216.</li>\n<li>–––, 2019b, “Dewey, Addams and Design\nThinking: Pragmatist Feminist Innovation and Design Thinking:\nPragmatist Feminist Innovation for Democratic\nChange”, <em>Oxford Handbook of Dewey</em>, Steven Fesmire\n(ed.), Oxford: Oxford University Press, 313–334.</li>\n<li>Yun Lee, Lisa, 2011, “Hungry for Peace: Jane Addams and the\nHull-House Museum’s Contemporary Struggle for Food\nJustice”, <em>Peace &amp; Change</em>, 36(1): 62–79.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Addams, Jane",
            "Dewey, John",
            "feminist philosophy, approaches: intersections between pragmatist and continental philosophy",
            "feminist philosophy, interventions: history of philosophy",
            "pragmatism"
        ],
        "entry_link": [
            {
                "../addams-jane/": "Addams, Jane"
            },
            {
                "../dewey/": "Dewey, John"
            },
            {
                "../femapproach-prag-cont/": "feminist philosophy, approaches: intersections between pragmatist and continental philosophy"
            },
            {
                "../feminism-femhist/": "feminist philosophy, interventions: history of philosophy"
            },
            {
                "../pragmatism/": "pragmatism"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=femapproach-pragmatism\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/femapproach-pragmatism/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=femapproach-pragmatism&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/femapproach-pragmatism/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=femapproach-pragmatism": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/femapproach-pragmatism/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=femapproach-pragmatism&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/femapproach-pragmatism/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "James, V. Denise, 2019. \n“<a href=\"https://www.youtube.com/watch?v=oO7JACRqdCQ&amp;feature=youtu.be\" target=\"other\">Growth and Survival, but Especially Survival: Black Feminism as Pragmatism</a>”, \nUniversity of Waterloo presentation.",
            "Rogers, Dorothy, 2020, \n“<a href=\"http://conf.american-philosophy.org/saap2020/modules/request.php?module=oc_program&amp;action=summary.php&amp;id=57\" target=\"other\">Pedagogical Theory &amp; Diversity\nin the U.S. and Mexico</a>” (abstract), presentation at\nthe <em>47th Annual Meeting of the Society for the Advancement of American\nPhilosophy Annual Conference</em>, 5–7 March 2020.",
            "Varner, Tess, 2020,\n“<a href=\"http://conf.american-philosophy.org/saap2019/modules/request.php?module=oc_program&amp;action=program.php&amp;p=program\" target=\"other\">Transformative Hospitality: A Pragmatist-Feminist Perspective On Radical Welcome As Resistance</a>” \n (abstract), presentation at the <em>47th Annual Meeting of the Society\nfor the Advancement of American Philosophy Annual Conference</em>,\n5–7 March 2020.",
            "<a href=\"http://www.uic.edu/jaddams/hull/\" target=\"other\">Jane Addams Hull-House Museum</a>,\n College of Architecture and the Arts, University of\nIllinois/Chicago",
            "<a href=\"http://www.nobel.se/peace/laureates/1931/addams-bio.html\" target=\"other\">Jane Addams Biography</a>,\n Nobel e-Museum",
            "<a href=\"http://www.pragmatism.org/companion/\" target=\"other\">Web Companion to Pragmatism</a>,\n The Pragmatism Cybrary, maintained by John Shook.",
            "<a href=\"http://www.american-philosophy.org/\" target=\"other\">The Society for the Advancement of American Philosophy</a>.",
            "<a href=\"https://archive.org/details/historyofwomansu05stanuoft\" target=\"other\">Scan of <em>The History of Woman Suffrage</em></a>, 1922, Ida Husted Harper (ed.)."
        ],
        "listed_links": [
            {
                "https://www.youtube.com/watch?v=oO7JACRqdCQ&feature=youtu.be": "Growth and Survival, but Especially Survival: Black Feminism as Pragmatism"
            },
            {
                "http://conf.american-philosophy.org/saap2020/modules/request.php?module=oc_program&action=summary.php&id=57": "Pedagogical Theory & Diversity\nin the U.S. and Mexico"
            },
            {
                "http://conf.american-philosophy.org/saap2019/modules/request.php?module=oc_program&action=program.php&p=program": "Transformative Hospitality: A Pragmatist-Feminist Perspective On Radical Welcome As Resistance"
            },
            {
                "http://www.uic.edu/jaddams/hull/": "Jane Addams Hull-House Museum"
            },
            {
                "http://www.nobel.se/peace/laureates/1931/addams-bio.html": "Jane Addams Biography"
            },
            {
                "http://www.pragmatism.org/companion/": "Web Companion to Pragmatism"
            },
            {
                "http://www.american-philosophy.org/": "The Society for the Advancement of American Philosophy"
            },
            {
                "https://archive.org/details/historyofwomansu05stanuoft": "Scan of The History of Woman Suffrage"
            }
        ]
    }
}