{
    "url": "feminism-objectification",
    "title": "Feminist Perspectives on Objectification",
    "authorship": {
        "year": "Copyright © 2024",
        "author_text": "Evangelia (Lina) Papadaki\n<lina_papadaki@yahoo.com>",
        "author_links": [
            {
                "mailto:lina_papadaki%40yahoo%2ecom": "lina_papadaki@yahoo.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2024</a> by\n\n<br/>\nEvangelia (Lina) Papadaki\n&lt;<a href=\"mailto:lina_papadaki%40yahoo%2ecom\"><em>lina_papadaki<abbr title=\" at \">@</abbr>yahoo<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Mar 10, 2010",
        "substantive revision Sat Jan 13, 2024"
    ],
    "preamble": "\n\nObjectification is a notion central to feminist theory. It can be\nroughly defined as the seeing and/or treating a person, usually a\nwoman, as an object. In this entry, the focus is primarily on\nsexual objectification, objectification occurring in the sexual realm.\nMartha Nussbaum (1995, 257) has identified seven features that are\ninvolved in the idea of treating a person as an object:\n\ninstrumentality: the treatment of a person as a tool for\nthe objectifier’s purposes;\ndenial of autonomy: the treatment of a person as lacking\nin autonomy and self-determination;\ninertness: the treatment of a person as lacking in\nagency, and perhaps also in activity;\nfungibility: the treatment of a person as interchangeable\nwith other objects;\nviolability: the treatment of a person as lacking in\nboundary-integrity;\nownership: the treatment of a person as something that is\nowned by another (can be bought or sold);\ndenial of subjectivity: the treatment of a person as\nsomething whose experiences and feelings (if any) need not be taken\ninto account.\n\n\nRae Langton (2009, 228–229) has added three more features to\nNussbaum’s list:\n\nreduction to body: the treatment of a person as\nidentified with their body, or body parts;\nreduction to appearance: the treatment of a person\nprimarily in terms of how they look, or how they appear to the\nsenses;\nsilencing: the treatment of a person as if they are\nsilent, lacking the capacity to speak.\n\n\nThe majority of the thinkers discussing objectification have taken it\nto be a morally problematic phenomenon. This is particularly the case\nin feminist discussions of pornography. Anti-pornography feminists\nCatharine MacKinnon and Andrea Dworkin, influenced by Immanuel\nKant’s conception of objectification, have famously argued that,\ndue to men’s consumption of pornography, women as a group are\nreduced to the status of mere tools for men’s purposes.\nMoreover, feminists like Sandra Bartky and Susan Bordo have argued\nthat women are objectified through being excessively preoccupied with\ntheir appearance. Important recent work by feminists has also been\ndevoted to exploring the connection between objectivity and\nobjectification. More recently, some thinkers, such as Martha\nNussbaum, have challenged the idea that objectification is a\nnecessarily negative phenomenon, arguing for the possibility of\npositive objectification. While treating a person as an object (in one\nor more of the ways mentioned above) is often problematic, Nussbaum\nargues that objectification can in some contexts take benign or even\npositive forms, and can constitute a valuable and enjoyable part of\nour lives. In her forthcoming work, Nancy Bauer questions the very\nidea that it makes sense to specify the marks and features of the term\n‘objectification’. Such an attempt, she argues, will only\ndistort the phenomenon in question (2015).\n",
    "toc": [
        {
            "#KanSexObj": "1. Kant on sexuality and objectification"
        },
        {
            "#PorObj": "2. Pornography and objectification"
        },
        {
            "#FemAppObj": "3. Feminine appearance and objectification"
        },
        {
            "#ObjObj": "4. Objectivity and Objectification"
        },
        {
            "#PosPosObj": "5. The possibility of positive objectification"
        },
        {
            "#FutSepMar": "6. The futility of specifying the marks and features of objectification"
        },
        {
            "#Con": "7.Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Kant on sexuality and objectification\n\nImmanuel Kant’s views on sexual objectification have been\nparticularly influential for contemporary feminist discussions on this\ntopic. Kant thought that sexuality is extremely problematic when\nexercised outside the context of monogamous marriage, arguing that in\nsuch instances it leads to objectification. He characteristically\nwrites in the Lectures on Ethics that “sexual love\nmakes of the loved person an Object of appetite; as soon as that\nappetite has been stilled, the person is cast aside as one casts away\na lemon which has been sucked dry. … as soon as a person\nbecomes an Object of appetite for another, all motives of moral\nrelationship cease to function, because as an Object of appetite for\nanother a person becomes a thing and can be treated and used as such\nby every one” (Kant Lectures on Ethics, 163).\n\nObjectification, for Kant, involves the lowering of a person, a being\nwith humanity, to the status of an object. Humanity, for\nKant, is an individual’s rational nature and capacity for\nrational choice. The characteristic feature of humanity is an\nindividual’s capacity for rationally setting and pursuing her\nown ends. A being with humanity is capable of deciding what is\nvaluable, and of finding ways to realise and promote this value.\nHumanity is what is special about human beings. It distinguishes them\nfrom animals and inanimate objects. Because human beings are special\nin this sense they, unlike animals and objects, have a\ndignity (an ‘inner worth’, as opposed to a\n‘relative worth’) (Kant 1785, 42). It is crucial, for\nKant, that each person respects humanity in others, as well as\nhumanity in their own person. Humanity must never be treated merely as\na means, but always at the same time as an end (Kant 1797, 209).\n\nKant is worried that when people exercise their sexuality outside the\ncontext of monogamous marriage, they treat humanity merely as a means\nfor their sexual purposes. In the Lectures on Ethics Kant\noften speaks about ‘degradation’,\n‘subordination’, and ‘dishonouring’ of\nhumanity when exercise of sexuality is involved. He goes so far as to\nsay that sexual activity can lead to the loss or\n‘sacrifice’ of humanity (Kant Lectures on Ethics,\n163–4). The loved person loses what is special to her as a human\nbeing, her humanity, and is reduced to a thing, a mere sexual\ninstrument. Kant’s notion of objectification, therefore, focuses\nlargely on instrumentality: the treatment of a person as a mere tool\nfor the lover’s purposes. Objectification, for Kant, involves\nregarding someone “as an object, something for use”\n(Herman 1993, 57). According to Alan Soble, for Kant, “both the\nbody and the compliant actions of the other person are tools (a means)\nthat one uses for one’s sexual pleasure, and to that extent the\nother person is a fungible, functional thing” (Soble 2002a,\n226). The idea that within sexual relationships people are reduced to\nobjects, that they lose their rational nature, is an extreme one.\nHalwani rightly points out that this reduction to the status of an\nobject rarely happens in sexual objectification. He explains that\n“Outside rape, it is rare to treat our sexual partners as\nobjects: not only are we aware of their humanity; we are also mindful\nof it.” (Halwani 2010, 193) Halwani offers a more sensible\nreading of Kant’s claim here, in admitting that there is truth\nto the idea that “Sexual desire is powerful enough to make\nreason its own tool; it can subvert our rational capacity to set\nends” (Halwani 2010, 209). In this way, people can\n“endanger their dignity by undermining their reason”\n(Halwani 2010, 209). Therefore, even though the view that humanity is\ncompletely destroyed when people exercise their sexuality is an\nunappealing one, it is not unreasonable to think that, in some cases,\nsexual desire and exercise of sexuality can undermine our\nrationality.\n\nKant thought that in theory both men and women can be objectified, but\nhe was well aware that in practice women are the most common victims\nof objectification. This is obvious in Kant’s discussions of\nprostitution and concubinage. Exercise of sexuality within these\nmorally problematic sexual contexts leads to the reduction of women\n(prostitutes and concubines) to men’s objects of appetite.\n\nKant defines prostitution as the offer for profit of\none’s person for another’s sexual gratification. A person,\nKant holds, cannot allow others to use her body sexually in exchange\nfor money without losing her humanity and becoming an object. He\nexplains that “… a man is not at his own disposal. He is\nnot entitled to sell a limb, not even one of his teeth. But to allow\none’s person for profit to be used for the satisfaction of\nsexual desire, to make of oneself an Object of demand, is to dispose\nover oneself as over a thing” (Kant Lectures on Ethics,\n165). The prostitute’s commodification necessarily leads to her\nobjectification; she is reduced to “a thing on which another\nsatisfies his appetite” (Kant Lectures on Ethics, 165).\nKant states that “human beings are … not entitled to\noffer themselves, for profit, as things for the use of others in the\nsatisfaction of their sexual inclinations. In so doing, they would run\nthe risk of having their person used by all and sundry as an\ninstrument for the satisfaction of inclination” (Kant\nLectures on Ethics, 165). Kant blames the prostitute for her\nobjectification. He takes her to be responsible for sacrificing her\nhumanity, in offering herself as an object for the satisfaction of the\nclients’ sexual desires.\n\nThe other relationship in which objectification is, for Kant, clearly\npresent is concubinage. According to Kant, concubinage is the\nnon-commodified sexual relationship between a man and more than one\nwoman (the concubines). Kant takes concubinage to be a purely sexual\nrelationship in which all parties aim at the satisfaction of their\nsexual desires (Kant Lectures on Ethics, 166). The inequality\nthat is involved in this relationship makes it problematic. Kant\nexplains that “the woman surrenders her sex completely to the\nman, but the man does not completely surrender his sex to the\nwoman” (Kant Lectures on Ethics, 169). Since body and\nself are for Kant inseparable and together they constitute the person,\nin surrendering her body (her sex) exclusively to her male partner,\nthe woman surrenders her whole person to the man, allowing him to\npossess it. The man, by contrast, who has more than one sexual\npartner, does not exclusively surrender himself to the woman, and so\nhe does not allow her to possess his person. In allowing her male\npartner to possess her person, without herself being able to similarly\npossess his person, Kant believes that eventually the concubine (and\nthis also applies to the woman in any other polygamous relationship,\nincluding polygamous marriage) loses her person and is made\n‘into a thing’ (Kant Lectures on Ethics,\n166).\n\nThe only relationship in which two people can exercise their sexuality\nwithout the fear of reducing themselves to objects is monogamous\nmarriage. Monogamy is required to ensure that there is\nequality and reciprocity in the surrender and ownership of the two\nspouses’ persons. The spouses exclusively surrender their\npersons to one another, so neither of them is in danger of losing his\nor her person and becoming an object. This perfect equality and\nreciprocity between the spouses is described by Kant as follows:\n“… if I yield myself completely to another and obtain the\nperson of the other in return, I win myself back; I have given myself\nup as the property of another, but in turn I take that other as my\nproperty, and so win myself back again in winning the person whose\nproperty I have become. In this way, the two persons become a unity of\nwill” (Kant Lectures on Ethics, 167). Furthermore, this\nmutual exchange of the two spouses’ persons must, for Kant, be\nlegally enforced. Kant explains that marriage is\n“sexual union in accordance with law” (Kant 1797, 62). He\nwants something external, namely, the law, to guarantee this lifelong\nownership of the two parties’ persons in marriage. He argues\nthat this legal obligation to surrender one’s person to\none’s spouses makes marriage different from a monogamous\nrelationship between two unmarried partners.\n2. Pornography and objectification\n\nLike Kant, anti-pornography feminists Catharine MacKinnon and Andrea\nDworkin take inequality to be tightly linked to objectification. In\nthe eyes of both these feminists and Kant, there is the powerful\nobjectifier on the one hand, and on the other hand there exists his\npowerless victim. Due to their unequal power, the former objectifies\nthe latter.\n\nKant is concerned with inequality taking place within polygamous\nrelationships. MacKinnon and Dworkin, on the other hand, believe that\ninequality is a much more widespread and pervasive phenomenon. It\ncovers all aspects of our society. MacKinnon and Dworkin emphasise\nthat we live in a world of gender inequality. A\nperson’s gender is, for MacKinnon, clearly\ndistinguished from a person’s sex. Gender, being a man\nor a woman, is socially constructed, whereas sex, being male or\nfemale, is biologically defined. Within our patriarchal societies, men\nand women have clearly defined roles: women (all women, women as a\ngroup) are objectified, whereas men (all men, men as a group) are\ntheir objectifiers (MacKinnon 1987, 6, 32–45, 50; MacKinnon\n1989a, 113–4, 128, 137–40; Haslanger 1993, 98–101)\n(For more on sex and gender, see also the entries\n feminist perspectives on sex and gender\n and\n feminist perspectives on power.)\n Even though MacKinnon does acknowledge that a female (sex) individual\ncan be an objectifier and a male (sex) individual can be objectified,\nshe takes it that the former is a man and the latter is a woman, since\nin her view a man (gender) is by definition the objectifier and a\nwoman (gender) is by definition the objectified.\n\nThis situation of gender inequality which troubles our societies and\nis so tightly linked to the objectification of women is, MacKinnon and\nDworkin believe, created and sustained by men’s consumption of\npornography. MacKinnon defines pornography as “the graphic\nsexually explicit subordination of women through pictures or words\nthat also includes women dehumanised as sexual objects, things, or\ncommodities; enjoying pain or humiliation or rape; being tied up, cut\nup, mutilated, bruised, or physically hurt; in postures of sexual\nsubmission or servility or display; reduced to body parts, penetrated\nby objects or animals, or presented in scenarios of degradation,\ninjury, torture; shown as filthy or inferior; bleeding, bruised, or\nhurt in a context that makes these conditions sexual” (MacKinnon\n1987, 176).\n\nIn our society, MacKinnon holds, pornography defines women’s\nrole as sexual objects available for men’s consumption:\n“Pornography defines women by how we look according to how we\ncan be sexually used. … Pornography participates in\nits audience’s eroticism through creating an accessible sexual\nobject, the possession and consumption of which is male\nsexuality, as socially constructed; to be consumed and possessed as\nwhich, is female sexuality, as socially constructed”\n(MacKinnon 1987, 173). According to MacKinnon, pornography is\nresponsible for both men’s and women’s conception of women\nas objects available for men’s consumption.\n\nMacKinnon’s and Dworkin’s understanding of objectification\nis similar to Kant’s. For both of them, as for Kant,\nobjectification involves treating a person, someone with humanity, as\nan object of merely instrumental worth, and consequently reducing this\nperson to the status of an object for use. The objectified individual\nis made into a tool for others’ sexual purposes.\nObjectification, therefore, constitutes a serious harm to a\nperson’s humanity.\n\nDworkin uses Kantian language to describe the phenomenon of sexual\nobjectification: “Objectification occurs when a human being,\nthrough social means, is made less than human, turned into a thing or\ncommodity, bought and sold. When objectification occurs, a person is\ndepersonalised, so that no individuality or integrity is available\nsocially or in what is an extremely circumscribed privacy.\nObjectification is an injury right at the heart of discrimination:\nthose who can be used as if they are not fully human are no longer\nfully human in social terms; their humanity is hurt by being\ndiminished” (Dworkin 2000, 30–1). When a person is treated\nas less than human, as merely an object for another’s use, she\nbecomes, according to Dworkin, less than human. In this way, her\nhumanity is harmed by being diminished.\n\nHampton argues that Dworkin’s view is upsetting, disturbing\nand indeed quite similar to the the view held by those who defend\npatriarchy. This is because, according to Dworkin, sex is necessarily\ndemeaning for the woman. Her humanity is denied altogether and she is\nliterally degraded and transformed into something less than\nhuman. Thus sex destroys a woman’s humanity. Hampton explains\nthat Dworkin mistakes the social degradation and inferiority that\nwomen must endure in sexist societies with their real and equal value\nas people, which can never be degraded and must always be acknowledged\nno matter what wrongs have been inflicted on them. Consequently, for\nHampton, a distinction between degradation and diminishment would make\nDworkin’s analysis more sound (Hampton 1999, 139–143).\n\nMacKinnon describes objectification as follows. She writes:\n“… A sex object is defined on the basis of its looks, in\nterms of its usability for sexual pleasure, such that both the\nlooking—the quality of gaze, including its points of\nview—and the definition according to use become eroticised as\npart of the sex itself. This is what the feminist concept of\n‘sex object’ means” (MacKinnon 1987, 173). She\nfurthermore holds: “A person, in one Kantian view, is a free and\nrational agent whose existence is an end in itself, as opposed to\ninstrumental. In pornography women exist to the end of male\npleasure” (MacKinnon 1987, 173). Insofar as an individual has\nonly instrumental value, she is clearly not regarded as an end in\nherself.\n\nMacKinnon and Dworkin have argued that, even if women consent to their\nbeing used as mere means for men’s sexual purposes, this is not\nsufficient to make such use permissible. For instance, these feminists\nclaim that women in the pornographic industry consent to be used as\nobjects simply out of lack of options available to them within our\npatriarchal society. Women’s consent, therefore, is not true\nconsent. MacKinnon writes: “The sex is not chosen for the sex.\nMoney is the medium of force and provides the cover of consent”\n(MacKinnon 1993, 28). This does not only hold for women in\npornography. For MacKinnon and Dworkin, all women’s consent to\nbe sexually used by men cannot be true consent under the existing\nconditions of gender inequality. They hold that women are not truly\nblameworthy for their reduction to things of merely instrumental\nvalue. Women’s objectification is demanded and inflicted by men\nin our societies. It is men who want, and also, Dworkin claims, need\nto use women as objects, and demand them to be object-like (Dworkin\n1997, 142–3).\n\nKant compares the objectified individual to a lemon, used and\ndiscarded afterwards, and elsewhere to a steak consumed by people for\nthe satisfaction of their hunger (Kant Lectures on Ethics,\n163 and 165). In a similar manner, MacKinnon blames pornography for\nteaching its consumers that women exist to be used by men. A woman,\naccording to MacKinnon, becomes comparable to a cup (a thing), and as\nsuch she is valued only for how she looks and how she can be used\n(MacKinnon 1987, 138). Similarly, Dworkin talks about men being the\nonly “human centre” of the world, surrounded by objects\nfor use, including women. A man experiences his power, according to\nDworkin, in using objects, both inanimate objects and “persons\nwho are not adult men” (Dworkin 1989, 104).\n\nKant took exercise of sexuality to be inherently problematic. For\nDworkin and MacKinnon, on the other hand, what is problematic is not\nsexuality per se, but rather sexuality as constructed through\npornography. These feminists believe that objectification is a\nconsequence of gender inequality and it is created and sustained by\npornography’s existence and consumption. Pornography, according\nto MacKinnon, makes women’s sexuality into “something any\nman who wants to can buy and hold in his hands… She becomes\nsomething to be used by him, specifically, an object of his sexual\nuse” (MacKinnon 1987, 138). MacKinnon fears that use can easily\nbe followed by violence and abuse. Since women are things (as opposed\nto human beings), it seems to men that there is nothing problematic\nwith abusing them. The object status of women, then, is the cause of\nmen seeing nothing problematic with violent behaviour towards\nwomen.\n\nMoreover, MacKinnon notes, women in pornography are presented as\nenjoying how they are being used and violated by men: “In\npornography, women desire disposition and cruelty. Men … create\nscenes in which women desperately want to be bound, battered,\ntortured, humiliated, and killed. Or merely taken and used. Women are\nthere to be violated and possessed, men to violate and possess\nus…” (MacKinnon 1987, 148). Dworkin similarly writes:\n“Men do not believe that rape and battery are violations of\nfemale will in part because men … have consumed pornography in\nthe private world of men for centuries. … The most enduring\nsexual truth in pornography is that sexual violence is desired by the\nnormal female, needed by her, suggested or demanded by her”\n(Dworkin 1989, 166). Pornography, then, teaches its consumers that,\nnot only is it permissible to treat women in these ways, but also that\nwomen themselves enjoy being used, violated and abused by men. Watson\nfurthermore argues that use of pornography restricts the sexual\nautonomy of boys and men, due to pornography’s pervasiveness as\na tool of sex education. Pornography consumption powerfully shapes its\nusers’ beliefs, attitudes, preferences and desires. Pornography,\nshe argues, distorts these and in this way undermines people’s\nsexual autonomy and restricts the development of authentic sexuality\nfor both women and men (Altman and Watson 284, 287–8).\n\nThe idea that pornography causes men to treat women as\nobjects to be used and abused has been defended by a number of\nfeminists. Alison Assiter argues that what is wrong with pornography\nis that it reinforces desires on the part of men to treat women as\nobjects (as mere means to achieve their purposes) (Assiter 1988, 68).\nRae Langton also discusses the possibility of such a causal connection\nbetween men’s consumption of pornography and women’s\nobjectification. She writes: “As a matter of human psychology,\nwhen men sexually use objects, pornographic artifacts, as women, they\ntend to use real woman as objects. One weaker variant of this causal\nclaim might be restricted to a subset of pornography… As a\nmatter of human psychology, when men sexually use objects as women,\nand those objects are pornographic artifacts, whose content is\nviolent or misogynistic, then they will tend to use real women as\nobjects” (Langton 1995, 178).)\n\nMacKinnon, however, holds that the connection between men’s use\nof pornography and women’s objectification is not simply a\ncausal one. She has famously claimed that pornography involves\n“sex between people and things, human beings and pieces of\npaper, real men and unreal women”. And, as a result for\nMacKinnon, “the human [women, in particular] becomes a\nthing” (MacKinnon 1993, 109 and 25). Men’s consumption of\npornography, then, is (constitutes) women’s\nobjectification. (This is admittedly a puzzling claim, but one which I\nwill not delve into further here. Detailed defenses of the claim have\nbeen offered by Melinda Vadas (Vadas 2005) and Rae Langton (Langton\n1995), and a criticism has been put forward by Jennifer Saul (Saul\n2006).)\n\nKant thought that the solution to sexual objectification is marriage.\nThis is because he conceived this relationship as one of perfect\nequality and reciprocity between the spouses. Each of them surrenders\nhis or her person to the other and receives the person of the other in\nreturn. This way, Kant believed, neither of them is objectified by\nlosing his or her person. (For a detailed discussion of Kantian\nmarriage see Herman 1993 and Papadaki 2010b.) For Dworkin and\nMacKinnon, however, Kant’s suggested solution is inappropriate.\nObjectification, according to these feminists, is present within all\nheterosexual relationships in our society and harms women’s\nhumanity. Marriage, or any other heterosexual relationship for that\nmatter, is clearly not regarded as an exception by them. According to\nMacKinnon and Dworkin, the way to fight objectification is to fight\ngender inequality, which is created and sustained by men’s\nconsumption of pornography. They take it that pornography has power\nand authority over its audience (men and boys). This view is also\ndefended by Langton, who argues that it does not matter that the\nspeech of pornographers is not generally held in high esteem. What\nmatters, rather, is that men and boys learn about sex primarily\nthrough pornography. Pornography passes the message to its audience\nthat women are objects readily available for men’s consumption\n(Langton 1993, 312).\n\nThe view that pornography has this amount of influence over men and\nplays such a central role in women’s objectification has\nreceived criticism. Deborah Cameron and Elizabeth Frazer question the\nidea that men are conditioned to behave in certain ways as a\nconsequence of pornography consumption. What is problematic with this\nidea, according to them, is that men are presented as incapable of\ncritically interpreting pornographic materials, and as simply\nimitating what they see in pornography (Cameron & Frazer 2000,\n248–251). In a similar spirit, Altman argues that pornography\nconsumption cannot alter a person’s preferences and desires,\nsexual or otherwise. He claims that men find women’s\nsubordination arousing, not as a result of their having consumed\npornography. Rather, they enjoy pornography, which includes the\nsubordination of women, because they already find this subordination\narousing. Thus, pornography does not make anything sexy but it deals\nwith what its consumers already find sexy (Altman and Watson,\n68–9).\n\nEven assuming that pornography does indeed pass the message that women\nare object-like to its consumers, however, it has been suggested that\npornography is not special with respect to sustaining gender\ninequality and women’s objectification. Leslie Green explains\nthat the idea that women are mere objects/tools is reinforced through\nparental pressure, television, popular novels, music videos, and\nfashion. What we need to do, Green says, is change our society, in a\nway that women’s subjectivity will be acknowledged (Green 2000,\n43–52). Nussbaum too argues that we should not see pornography\nas the primary cause of women’s objectification. Sexual\nobjectification is, according to Nussbaum, often caused by social\ninequality, but there is no reason to believe that pornography is the\ncore of such inequality (Nussbaum 1995, 286, 290).\n\nA similar view has been put forward by Ronald Dworkin, according to\nwhom: “It might be odd that feminists have devoted such energy\nto that campaign [the campaign for outlawing pornography]… No\ndoubt mass culture is in various ways an obstacle to sexual equality,\nbut the most popular forms of that culture—the view of women\npresented in soap operas and commercials, for example—are much\ngreater obstacles to that equality than the dirty films watched by a\nsmall minority” (R. Dworkin 1993, 36). (For further discussions\nabout pornography, see also the entries on\n feminist perspectives on sex markets\n and on\n pornography and censorship.)\n3. Feminine appearance and objectification\n\nIt has been pointed out by some feminist thinkers that women in our\nsociety are more identified and associated with their bodies than are\nmen, and, to a greater extent than men, they are valued for how they\nlook (Bartky 1990; Bordo 1993, 143). In order to gain social\nacceptability, women are under constant pressure to correct their\nbodies and appearance more generally, and to make them conform to the\nideals of feminine appearance of their time, the so-called\n‘norms of feminine appearance’ (the standards of\nappearance women feel they should be living up to) (Saul 2003, 144).\nSome feminists have argued that, in being preoccupied with their\nlooks, women treat themselves as things to be decorated and gazed\nupon.\n\nIn her book Femininity and Domination, Sandra Bartky uses\nMarx’s theory of alienation to explain the objectification that\nresults from women’s preoccupation with their appearance. A\nfeature of Marx’s theory of alienation is the\nfragmentation of the human person, this “splintering of\nhuman nature into a number of misbegotten parts”. For Marx,\nlabour is the most distinctively human activity, and the product of\nlabour is the exteriorisation of the worker’s being. Under\ncapitalism, however, workers are alienated from the products of their\nlabour, and consequently their person is fragmented (Bartky 1990,\n128–9).\n\nBartky believes that women in patriarchal societies also undergo a\nkind of fragmentation “by being too closely identified with\n[their body]… [their] entire being is identified with the body,\na thing which… has been regarded as less inherently human than\nthe mind or personality” (Bartky 1990, 130). All the focus is\nplaced on a woman’s body, in a way that her mind or personality\nare not adequately acknowledged. A woman’s person, then, is\nfragmented. Bartky believes that through this fragmentation a woman is\nobjectified, since her body is separated from her person and is\nthought as representing the woman (Bartky 1990, 130).\n\nBartky explains that, typically, objectification involves two persons,\none who objectifies and one who is objectified. (This is also the idea\nof objectification put forward by Kant as well as by MacKinnon and\nDworkin.) However, as Bartky points out, objectifier and objectified\ncan be one and the same person. Women in patriarchal societies feel\nconstantly watched by men, much like the prisoners of the Panopticon\n(model prison proposed by Bentham), and they feel the need to look\nsensually pleasing to men (Bartky 1990, 65). According to Bartky:\n“In the regime of institutionalised heterosexuality woman must\nmake herself ‘object and prey’ for the man. … Woman\nlives her body as seen by another, by an anonymous patriarchal\nOther” (Bartky 1990, 73). This leads women to objectify their\nown persons. Bartky argues that the woman “[takes] toward her\nown person the attitude of the man. She will then take erotic\nsatisfaction in her physical self, revelling in her body as a\nbeautiful object to be gazed at and decorated”. Such an attitude\nis called ‘narcissism’, which is defined by Bartky as the\ninfatuation with one’s bodily being (Bartky 1990,\n131–2).\n\nIn being infatuated with their bodily beings, Bartky argues that women\nlearn to see and treat themselves as objects to be gazed at and\ndecorated, they learn to see themselves as though from the outside.\nNarcissism, as Simone de Beauvoir also points out, “consists in\nthe setting up of the ego as a double ‘stranger’”\n(Beauvoir 1961, 375). The adolescent girl “becomes an object and\nshe sees herself as an object; she discovers this new aspect of her\nbeing with surprise: it seems to her that she has been doubled;\ninstead of coinciding exactly with herself, she now begins to exist\noutside” (Beauvoir 1961, 316) (See the entry on\n Simone de Beauvoir.)\n However, this ‘stranger’ who inhabits women’s\nconsciousness, Bartky writes, is hardly a stranger; it is, rather, the\nwoman’s own self (Bartky 1993, 134).\n\nAs Nancy Bauer holds, drawing on Beauvoir, women will always have\nreasons to succumb to the temptation of objectifying themselves. Bauer\nmentions the widespread recent phenomenon of female college students\nwho claim that they gain pleasure in performing unilateral oral sex on\nmale students. A woman who turns herself into an “object of the\nhelpless desire of a boy”in this way, Bauer explains,\nexperiences a sense of power and pleasure, which, however, are not\nunadulterated (Bauer 2011, 124). A great theme of The Second\nSex, Bauer concludes, is that, in order to achieve full\npersonhood, it is necessary not only that men stop objectifying women,\nbut also that “women care about abjuring the temptation to\nobjectify themselves” (Bauer 2011, 128).\n\nBartky talks about the disciplinary practices that produce a feminine\nbody and are the practices through which women learn to see themselves\nas objects. First of all, according to her, there are those practices\nthat aim to produce a body of a certain size and shape: women must\nconform to the body ideal of their time (i.e. a slim body with large\nbreasts), which, Bartky holds, requires women to subject their bodies\nto the ‘tyranny of slenderness’ (put themselves through\nconstant dieting and exercise) (Bartky 1990, 65–7). Susan Bordo\nalso emphasises the fact that women are more obsessed with dieting\nthan are men. This is linked to serious diseases such as anorexia and\nbulimia. Ninety percent of all anorexics, Bordo points out, are women\n(Bordo 1993, 143, 154). Furthermore, a large number of women have\nplastic surgery, most commonly liposuction and breast enlargement, in\norder to make their bodies conform to what is considered to be the\nideal body.\n\nAccording to Bartky, the second category of these disciplinary\npractices that produce a feminine body are those that aim to control\nthe body’s gestures, postures, and movements. Women, she holds,\nare more restricted than men in the way they move, and they try to\ntake up very little space as opposed to men, who tend to expand to the\nspace available. Women’s movements are also restrained by their\nuncomfortable clothes and shoes (Bartky 1990, 68–9). The final\ncategory of the disciplinary practices, Bartky holds, are those that\nare directed towards the display of a woman’s body as an\n‘ornamented surface’: women must take care of their skin\nand make it soft, smooth, hairless and wrinkle-free, they must apply\nmake-up to disguise their skin’s imperfections. Our culture\ndemands the ‘infantilisation’ of women’s bodies and\nfaces (Bartky 1990, 71–2).\n\nAccording to Bartky: “… whatever else she [a woman] may\nbecome, she is importantly a body designed to please or to\nexcite” (Bartky 1990, 80). Iris Marion Young adds that\nwomen’s preoccupation with their appearance suppresses the body\npotential of women: “Developing a sense of our bodies as\nbeautiful objects to be gazed at and decorated requires suppressing a\nsense of our bodies as strong, active subjects…” (Young,\n1979).\n\nWho is responsible for women’s situation? According to Bartky:\n“The disciplinary power that inscribes femininity in the female\nbody is everywhere and it is nowhere; the disciplinarian is everyone\nand yet no one in particular” (Bartky 1990, 74). The message\nthat women should look more feminine is everywhere: it is reinforced\nby parents, teachers, male partners, and it is expressed in various\nways throughout the media. Men, then, are not the only ones to blame\nfor women’s situation. Because of the pervasiveness of this\ndisciplinary power that inscribes femininity, women’s constant\npreoccupation with appearance has come to be regarded as something\nnatural and voluntary; it is something that women have internalised.\nTherefore, it is far from easy for women, in Bartky’s view, to\nfree themselves from their objectification.\n\nNot all feminists, however, share the concern about the inevitability\nof objectification involved in women’s appearance-related\npursuits. Janet Richards takes women’s preoccupation with their\nlooks to be a matter of personal preference, and not a feminist\nmatter. She claims that there is nothing inherently degrading or\nobjectifying about women trying to be sensually pleasing (Richards\n1980, 184–204). Natasha Walter too takes it that women’s\npreoccupation with their appearance is not necessarily objectifying.\nShe also points to the fact that men in our society engage in\nself-decoration and seek to be admired by women (Walter 1998,\n86–102).\n\nBordo herself acknowledges the fact that men have increasingly started\nto spend more time, money and effort on their appearance (Bordo 1999).\nShe emphasises the fact that men’s magazines today, like\nwomen’s, are full of articles and advice on how men should look:\nhow to be more muscular, what clothes to wear, what creams and other\ncosmetics to use, etc. Men feel the need to make their looks conform\nto the prevailing ideals of masculinity. Bordo believes that it is\nconsumer capitalism that drives men to be increasingly concerned with\ntheir appearance: “Why should [the cosmetics, diet, exercise,\nand surgery industries] restrict themselves to female markets, if they\ncan convince men that their looks need constant improvement\ntoo?,” she asks (Bordo 1999, 220).\n\nThe fact that men too face pressure to look a certain way, and engage\nin constant efforts to improve their appearance, however, is not on\nits own sufficient to show that women’s (and men’s)\npreoccupation with appearance is not objectifying. According to Saul,\n“The increasing pressure on men to conform to unattainable\nstandards of beauty is far from a sign of progress: it is, instead, a\nsign that the problem has grown” (Saul 2003, 168).\n4. Objectivity and Objectification\n\nMacKinnon introduces the idea that there are important connections\nbetween objectivity and objectification. MacKinnon writes: “The\nstance of the ‘knower’ … is … the neutral\nposture, which I will be calling objectivity—that is the\nnonsituated distanced standpoint… [This] is the male standpoint\nsocially … [The] relationship between objectivity as the stance\nfrom which the world is known and the world that is apprehended in\nthis way is the relationship of objectification. Objectivity is the\nepistemological stance of which objectification is the social process,\nof which male dominance is the politics, the acted out social\npractice. That is, to look at the world objectively is to objectify\nit” (MacKinnon 1987, 50). Her claim has become the focus of\nrecent feminist investigation. Drawing on MacKinnon’s work, Rae\nLangton and Sally Haslanger have explored the idea that\nobjectification is often hidden, and ‘masked’ as\nobjectivity.\n\nAccording to Haslanger, in trying to be objective about our world and\nfunction within it, we go about trying to discover things’\nnatures. An object’s nature is essential to it, and any change\nto it will inevitably destroy it. An object cannot exist without those\nproperties that constitute its nature. Discovering an object’s\nnature enables us to explain the behaviour of that object under normal\ncircumstances. This means that in practical decision-making, we must\nbe attentive to objects’ natures (Haslanger 1993, 103, 105). She\nwrites: “It won’t do to try to fry an egg on a paper\nplate; there is no point in trying to teach a rock how to read.\nBecause the world is not infinitely malleable to our wants or needs,\nreasonable decision making will accommodate ‘how things\nare’, where this is understood as accommodating the natures of\nthings, the background conditions constraining our actions”\n(Haslanger 1993, 105).\n\nA plausible strategy for discovering a thing’s nature is to look\nfor observed regularities. This is because natures are responsible for\nthe regular behaviour of things under normal circumstances. For\nexample, I observe that my ferns die if deprived of water. I therefore\ncome to believe that the nature of ferns is such that they cannot\nsurvive without water. I adjust my decision-making in accordance with\nthis observed regularity, and so water my ferns to prevent them from\ndying. In observing the regularity that ferns die when depraved of\nwater, I have concluded that this is due to ferns’ nature.\nHaslanger points out that this procedure of drawing on observed\nregularities to set constraints on our practical decision making seems\nto be “a paradigm of ‘neutral,’\n‘objective,’ or ‘reasonable’ procedure”\n(Haslanger 1993, 105).\n\nThe above procedure, however, can be problematic. This becomes obvious\nwhen moving to the social world. For example, aiming to discover\nwomen’s nature following the above procedure in patriarchal\nsocieties (like ours, according to MacKinnon) is highly problematic.\nMacKinnon believes that it is an observed regularity in our societies\nthat women are submissive and object-like (and men are women’s\nobjectifiers). This means that one might be led to the belief that\nwomen are by their nature submissive and object-like. (It\nshould be noted here that MacKinnon, and also Haslanger and Langton\nfollowing her, use ‘men’ and ‘women’ to refer\nto gender categories, which are socially (not biologically) defined:\none is a woman or a man by virtue of one’s social position; see\nthe entry on\n feminist perspectives on sex and gender.)\n However, the belief that women are naturally submissive and\nobject-like is false, since women have been made to be like\nthat.\n\nWomen’s object-like status is not a natural fact, but rather a\nconsequence of gender inequality. In structuring our world in such a\nway as to accommodate this allegedly natural fact about women, we\nsustain the existing situation of gender inequality. As MacKinnon\nvividly puts it: “if [we] look neutrally on the reality of\ngender so produced, the harm that has been done will not be\nperceptible as harm. It becomes just the way things are”\n(MacKinnon 1987, 59). Haslanger adds: “Once we have cast women\nas submissive and deferential ‘by nature’, then efforts to\nchange this role appear unmotivated, even pointless. … These\nreflections suggest that what appeared to be a ‘neutral’\nor ‘objective’ ideal, namely, the procedure of drawing on\nobserved regularities to set constraints on practical decision\nmaking—is one which will, under conditions of gender hierarchy\nreinforce the social arrangements on which such hierarchy\ndepends” (Haslanger 1993, 106).\n\nDrawing on MacKinnon, Haslanger suggests that there are four\nconditions that are necessary in order for person A to\nobjectify person B:\n\nPerson A views and treats person B as\nan object for the satisfaction of A’s desire;\nWhere person A desires person B to have\nsome property, A forces B to have that\nproperty;\nPerson A believes that person B has\nthat property;\nPerson A believes that person B has that\nproperty by nature (Haslanger 1993, 102–3).\n\n\nWhen it comes to women’s sexual objectification by men, the\nabove conditions go as following:\n\nMen view and treat women as objects of male\nsexual desire;\nMen desire women to be submissive and object-like and\nforce them to submit;\nMen believe that women are in fact submissive and\nobject-like;\nMen believe that women are in fact submissive and\nobject-like by nature.\n\n\nAccording to Haslanger, in order for an objectifier to\n‘mask’ his power and believe that the observed differences\nbetween men and women are consequences of their natures, he must\nresort to a norm of aperspectivity; he must believe that his\nobservations are not conditioned by his own social position, and that\nhe has no impact on the circumstances under observation. Haslanger\ndiscusses a norm, which is often used by objectifiers, the norm of\nAssumed Objectivity, which consists of the following four\nsub-norms:\n\nEpistemic neutrality: one must take a genuine regularity\nin the behaviour of something to be a consequence of its nature.\nPractical neutrality: one must constrain one’s\ndecision making to accommodate things’ natures.\nAbsolute aperspectivity: one must count observed\nregularities as “genuine” when: (i) observations occur\nunder normal circumstances, (ii) observations are not conditioned by\nthe observer’s social position, (iii) the observer has not\ninfluenced the behaviour of items under observation.\nAssumed aperspectivity: one must believe that any\nregularity one observes is a “genuine” regularity, and so\nreveals the nature of the things under observation (Haslanger 1993,\n106–7).\n\n\nHaslanger argues that, under conditions of social hierarchy, the Norm\nof Assumed Objectivity would perpetuate the existing patterns of\nwomen’s objectification. Therefore, our efforts at social change\nwould become unmotivated. The norm in question should be rejected in\nthis case because it has bad practical consequences for women, while\nserving the interests of men (it is pragmatically bad).\nFurthermore, Haslanger argues that the norm of Assumed Objectivity\nshould be rejected because it yields false beliefs, like the belief\nthat women are submissive and object-like by their nature (it is\nepistemically bad) (Haslanger 1993, 108–115).\n\nLangton agrees with Haslanger that, under conditions of social\nhierarchy, the norm of Assumed Objectivity is problematic and\ntherefore should be rejected. Her reasons are twofold: First of all,\n(as Haslanger also noted) because it yields false beliefs; beliefs\nwhich do not fit the world at all, like the belief that women are\nobject-like by nature. Secondly, because it yields true but\nunjustified beliefs, beliefs that are true “for the wrong\nreasons” (Langton 1993, 383); for example, the belief that women\nare actually submissive and object-like. The belief is unjustified,\naccording to Langton, because of its direction of fit. In this case,\nLangton explains, instead of men arranging their belief to fit the\nworld, the world arranges itself to fit the belief of men. Those\npeople who occupy a position of power and pursue the norm of Assumed\nObjectivity will make the world conform to their belief (Langton 1993,\n383).\n\nLangton explains that objectivity is about the ways in which\nthe mind conforms to the world (the way in which our beliefs arrange\nthemselves to fit the world). When someone is objective, his or her\nbeliefs have the right direction of fit: the beliefs are arranged in\norder to fit the way the world is. Objectification, on the\nother hand, is about the ways in which the world conforms to mind\n(conforms to our beliefs). An objectifier’s beliefs have the\nwrong direction of fit: the objectifier arranges the world in order to\nfit his or her beliefs, which are influenced by his or her desires,\ninstead of arranging his or her beliefs to fit the way the world\nactually is. Objectification, then, is a process in which the social\nworld comes to be shaped by desire and belief. An objectifier thinks\nthat her or his beliefs have come to fit the world, where in fact the\nworld has come to fit her or his beliefs.\n\nWhen it comes to the objectification of women, Langton explains that\nwomen become submissive and object-like because of men’s desires\nand beliefs. Men desire women to be this way, and, if they have power,\nthey force women to become this way. Following the norm of Assumed\nObjectivity, then, men form the belief that women are in fact\nsubmissive and object-like, and also that women are like that due to\ntheir nature. So, when it comes to women’s objectification, the\nworld conforms to men’s minds. Men’s beliefs, however,\nhave the wrong direction of fit because men arrange the world to fit\ntheir beliefs and desires about women being submissive and\nobject-like. The norm of Assumed Objectivity, then, yields the belief\nthat women are submissive and object-like, which is true but has the\nwrong direction of fit (Langton 2000, 138–142), along with the\nfalse belief that women are naturally this way. (For a further\ndiscussion about beliefs with an anomalous direction of fit, as well\nas a discussion of the mechanisms that are responsible for generating\nthem, see also Langton’s work on ‘projection’ and\nits role in women’s objectification in her 2004 article\n“Projection and Objectification”. For a criticism of\nLangton’s argument that the norm of Assumed Objectivity is\nresponsible for yielding beliefs that are true but have a wrong\ndirection of fit, see Papadaki 2008.)\n5. The possibility of positive objectification\n\nSo far, we have looked at various concerns regarding the wrongness\ninvolved in objectification. A number of thinkers, however, have\nchallenged the idea that objectification is always morally\nproblematic.\n\nAlan Soble questions the widely held Kantian view according to which\nhuman dignity is something that people have. He argues that\nobjectification is not inappropriate. Everyone is already only an\nobject and being only an object is not necessarily a bad thing. In one\nsense, then, no one can be objectified because no one has the higher\nontological status that is required to be reduce-able by\nobjectification. In another sense, everyone is vulnerable to\nobjectification, and everyone can and may be objectified, because to\ndo so is to take them to their correct ontological level. He\nwrites:\n\nThe claim that we should treat people as ‘persons’ and not\ndehumanise them is to reify, is to anthropomorphise humans and\nconsider them more than they are. Do not treat people as objects, we\nare told. Why not? Because, goes the answer, people qua persons\ndeserve not to be treated as objects. What a nice bit of illusory\nchauvinism. People are not as grand as we make them out to be, would\nlike them to be, or hope them to be. (Soble 2002b, 53–4)\n\n\nIn the case of pornography, then, there is nothing wrong, according to\nSoble, with treating pornographic actors and models as objects for\nsexual pleasure and deny their humanity. That is because there is no\nnegative objectification that needs to be taken into moral account.\nSoble adds that pornography’s task is in fact a good one;\npornography takes these people (both men and women), who according to\nhim are good at sex, and makes sure that they do something with their\nlives (Soble 2002b).\n\nLeslie Green is another thinker who argues that it is permissible and\nalso required to treat people as objects. As Green explains, people\nare embodied, extended in space, they exist in time, and they are\nsubject to the laws of nature. People, however, are clearly more than\nobjects. What is problematic therefore, according to Green, is to\ntreat a person merely as an object, merely as a means to\none’s own ends. We can treat other people as means only if we at\nthe same time respect their integrity as agents with their own\npurposes (Green 2000, 44).\n\nGreen points to Kant’s Categorical Imperative, according to\nwhich the prohibition is against treating a person merely\nas means, and not at the same time as an end. As Green\nemphasises, there is no prohibition against treating a person as a\nmeans (as an instrument) (Green 2000, 44). In fact, Green holds,\n“we must treat others as instruments, for we need their skills,\ntheir company, and their bodies—in fact, there is little that we\nsocial creatures can do on our own, and so little that is\nfulfilling” (Green 2000, 45–6). According to Green, when\npeople are old, severely disabled, or chronically unemployed what they\nfear the most is that they no longer are of use to others. As Green\nputs it, “they miss not only their diminished agency, but also\ntheir diminished objectivity. … They become …\nsubjectified” (Green 2000, 46).\n\nMartha Nussbaum too aims to challenge the widely-held idea that\nobjectification is inconsistent with respect for a person’s\nhumanity. She offers a systematic analysis of objectification, a\nconcept not at all easy to define and one that writers on the topic\nhave not sufficiently clarified, as she acknowledges (Nussbaum 1995,\n251).\n\nObjectification, for Nussbaum is the seeing and/or treating a person\nas an object; it involves treating one thing as another: one is\ntreating as an object what in fact is not an object, but a human being\n(Nussbaum 1995, 256–7). Nussbaum, then, disagrees with\nGreen’s view that people are partly objects. According to\nNussbaum, there are seven features involved in the idea of\nobjectification: instrumentality, denial of autonomy, inertness,\nfungibility, violability, ownership, denial of subjectivity. A\ndetailed exposition of these seven features is provided in the\nintroduction of this entry.\n\nAccording to Nussbaum, a person is objectified when they are seen\nand/or treated in one or more of the above seven ways.\nInstrumentality, then, Nussbaum points out, the core notion of\nKant’s, MacKinnon’s, Dworkin’s, as well as\nGreen’s conceptions of objectification, is only one of the ways\na person can be treated as an object. (Nussbaum does believe, however,\nthat, among these seven notions, instrumentality is especially\nproblematic, and is often linked to other forms of objectification\n(Nussbaum 1995, 265)). Nussbaum’s conception of objectification,\nthen, is broader than Kant/MacKinnon/Dworkin’s because\nobjectification for Nussbaum is not merely defined in terms of\ninstrumentalisation, and also because it can take place when a person\nis only seen, but not treated, as an object (seen in one or\nmore of the above seven ways that she mentions).\n\nAccording to Nussbaum, objectification need not have devastating\nconsequences to a person’s humanity. In fact, Nussbaum\ncriticises MacKinnon and Dworkin for conceiving of objectification as\na necessarily negative phenomenon (Nussbaum 1995, 273). Nussbaum\nbelieves that it is possible that “some features of\nobjectification… may in fact in some circumstances… be\neven wonderful features of sexual life”, and so “the term\nobjectification can also be used… in a more positive spirit.\nSeeing this will require … seeing how the allegedly impossible\ncombination between (a form of) objectification and equality, respect,\nand consent might after all be possible” (Nussbaum 1995,\n251).\n\nAccording to Nussbaum, then: “In the matter of objectification\ncontext is everything. … in many if not all cases, the\ndifference between an objectionable and a benign use of\nobjectification will be made by the overall context of the human\nrelationship” (Nussbaum 1995, 271); “…\nobjectification has features that may be either good or bad, depending\nupon the overall context” (Nussbaum 1995, 251). Objectification\nis negative, when it takes place in a context where equality,\nrespect and consent are absent. Among the negative objectification\ncases she discusses in her article are Hankinson’s Isabelle\nand Veronique, the magazine Playboy, and James’s\nThe Golden Bowl. And it is benign/positive, when it\nis compatible with equality, respect and consent. Nussbaum gives an\nexample of benign objectification: “If I am lying around with my\nlover on the bed, and use his stomach as a pillow there seems to be\nnothing at all baneful about this, provided that I do so with his\nconsent (or, if he is asleep, with a reasonable belief that he would\nnot mind), and without causing him pain, provided as well, that I do\nso in the context of a relationship in which he is generally treated\nas more than a pillow” (Nussbaum 1995, 265).\n\nNussbaum believes that ‘Lawrentian objectification’\n(objectification occurring between the lovers in D. H.\nLawrence’s novels) is a clear example of positive\nobjectification. The passage from Lady Chatterley’s\nLover that she quotes in her article describes a sex scene\nbetween two lovers. Connie and Mellors, in a context characterised by\nrough social equality and respect, identify each other with their body\nparts, they “… put aside their individuality and become\nidentified with their bodily organs. They see one another in terms of\nthose organs” (Nussbaum 1995, 275). Consequently, the two lovers\ndeny each other’s autonomy and subjectivity, when engaging in\nthe sex act.\n\nHowever, Nussbaum explains, “when there is loss of autonomy in\nsex, the context is… one in which on the whole, autonomy is\nrespected and promoted. … Again, when there is loss of\nsubjectivity in the moment of lovemaking, this can be and frequently\nis accompanied by an intense concern for the subjectivity of the\npartner at other moments…” (Nussbaum 1995, 274–6).\nAs Nussbaum also emphasises in her latest essay on objectification, a\nperson’s “chosen resignation of autonomous self-direction,\nor her willed passivity may be compatible with, and even a valued part\nof, a relationship in which the woman is treated as an end for her own\nsake… as a full fledged human being” (Nussbaum 2007, 51).\nFurthermore, Connie and Mellors do not treat each other merely as\nmeans for their purposes, according to Nussbaum. Even though they\ntreat each other as tools for sexual pleasure, they generally regard\neach other as more than that. The two lovers, then, are equal and they\ntreat one another as objects in a way that is consistent with\nrespecting each other as human beings.\n\nNussbaum’s list of the seven features involved in\nobjectification and the relations that exist between them provides\nperhaps the most systematic analysis of the concept of objectification\nto date. But Papadaki has argued that Nussbaum’s conception is\ntoo broad (Papadaki 2010a). A person is objectified, according to\nNussbaum, if they are seen and/or treated as an object (in one or more\nof the seven ways that she mentions). If every time a person is\ntreated (or merely seen) by another, say, as an instrument (not a\nmere instrument) for some further purpose, we take it that\nthe person in question is objectified, then it seems that in our daily\nlives we objectify nearly everyone, including ourselves. Inevitably,\nwe use each other and ourselves instrumentally all the time (for\ninstance, I use a taxi driver as a means to get to my destination, I\nuse myself as a means to prepare a meal, etc). Papadaki argues that if\nobjectification is to be a meaningful concept, we need to restrict it.\nHalwani is also in favor of a narrower conception of objectification.\nHe argues that we are better off with a definition of objectification\nthat includes “only treatment or behavior towards\nsomeone”. According to this view, if someone merely sees or\nregards another in a sexual way, there is no objectification. Such a\ndefinition, Halwani suggests, “…is less cluttered and\nmore accurately reflects the problem with objectification: its impact\non the objectified (often thought as victims)” (Halwani\n2008, 342 and Halwani 2010, 187–8). He believes that we are\nbetter off arguing that, in Nussbaum’s positive objectification\ncases, there is no objectification to begin with. This is better than\n“engaging in mental gymnastics to try to show that there is\nobjectification but that it is okay or good” (Halwani 2010,\n197). Nussbaum herself seems to be concerned, at times, about her\nobjectification category being too inclusive. For example, she states\nthat sometimes we do not treat the occurrence of only one of the seven\nnotions on her list as sufficient for objectification (Nussbaum 1995,\n258). However, Papadaki suggests, she does not give us enough guidance\nas to how we can decide whether objectification is present when a\nperson is treated in one of the seven ways she mentions. In addition,\nshe suggests that once objectification’s association with the\nmorally problematic is weakened, there is the risk that the fight\nagainst (negative) objectification might be undermined (Papadaki\n2010a, 27–31).\n6. The futility of specifying the marks and features of objectification\n\nRecently, Nancy Bauer has expressed scepticism regarding the\npossibility of laying out a set of criteria for what counts as sexual\nobjectification. She argues that it is difficult to specify the marks\nand features of a term that plays a normative role in our mutually\nshared worldview. And if the term in question is important to my\noutlook, but not yours, she claims that it is impossible for me to\nspecify criteria for the term’s application that pick out the\nphenomenon from your point of view. She writes: “If the term\n‘sexual objectification’ is critical in helping you make\nsense of the world as you see it, then, more or less, you will know\nsexual objectification when you see it. … Insofar as the\nphilosophical literature sets out to delineate the marks and features\nof sexual objectification, it is bound not only to fail but to miss\nthe very phenomenon it seeks to illuminate” (Bauer 2015, part\nI).\n\nRegarding the feminist concept of sexual objectification, Bauer\nexplains that it was coined as part of a feminist shift in how to\nunderstand the world and one’s experience in it. According to\nthe shift in question, in a context in which women experience\nwidespread, systematic, diachronic, and structural disadvantages,\ncertain ways of perceiving and representing women tend to cause them\nmaterial and psychological harm. Bauer argues that once someone\nparticipates in this shift, the term ‘sexual\nobjectification’ will ‘light up’ the relevant\nphenomena, and the person in question will see objectification\neverywhere she looks in contemporary culture. This is the case even if\nshe is not in a position to specify exactly its marks and features.\nBauer explains that ‘lighting up’ in certain cases may\ntake the form of a conversion experience that consists in our seeing\nthings that we did not see before. For Bauer, the metaphor of\n‘lighting up’ is crucial in thinking about sexual\nobjectification and other terms that make sense only in a context of a\nsystematic normative way of understanding the world (what she calls a\n‘worldview’ (Bauer 2015, part II)).\n7. Conclusion\n\nUndoubtedly, objectification is a concept difficult to define, as\nNussbaum also acknowledges, since it turns out to be\n‘slippery’ and ‘multiple’ (Nussbaum 1995,\n251). How to best to define objectification, if we can define it at\nall, and whether this notion should be restricted to describe the\nmorally objectionable, or expanded to cover benign and/or positive\naspects of the way we see and treat each other in our daily lives is\nan ongoing debate. Much recent feminist work has been devoted to\ncomprehensive philosophical analyses of objectification, which will\nhopefully lead to more complete and coherent understandings of this\nnotion.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Altman, Andrew and Watson, Lori, 2019, <em>Debating\nPornography</em>, Oxford: Oxford University Press.",
                "Assiter, Alison, 1988, “Autonomy and Pornography”, in\n<em>Feminist Perspectives in Philosophy</em>, M. Griffiths and M.\nWhitford (eds.), Bloomington: Indiana University Press.",
                "Bartky, Sandra-Lee, 1990, <em>Femininity and Domination: Studies\nin the Phenomenology of Oppression</em>, New York: Routledge.",
                "Bauer, Nancy, 2015, <em>How to Do Things with Pornography</em>,\nCambridge, MA: Harvard University Press.",
                "–––, 2011, “Beauvoir on the Allure of\nSelf-Objectification”, in <em>Feminist Metaphysics</em>,\nFeminist Philosophy Collection, Charlotte Witt (ed.), Springer\nScience+Business Media B.V., 117–129.",
                "de Beauvoir, Simone, 1961, <em>The Second Sex</em>, New York:\nGrune and Stratton.",
                "Bordo, Susan, 1993, <em>Unbearable Weight</em>, Berkeley, CA:\nUniversity of California Press.",
                "Bordo, Susan, 1999, <em>The Male Body</em>, New York: Farrar,\nStraus and Giroux.",
                "Cameron, D., and E. Frazer, 2000, “On the Question of\nPornography and Sexual Violence: Moving Beyond Cause and\nEffect”, in <em>Feminism and Pornography</em>, D. Cornell (ed.),\nOxford: Oxford University Press, pp. 240–253.",
                "Davis, Nancy, 1984, “Using Persons and Common Sense”,\n<em>Ethics</em>, 94(3): 387–406.",
                "Doyle, Tony, 2002, “MacKinnon on Pornography”,\n<em>Journal of Information Ethics</em>, 11(2): 53–78.",
                "Dworkin, Andrea, 1974, <em>Woman Hating</em>, New York:\nDutton.",
                "–––, 1989, <em>Pornography: Men Possessing\nWomen</em>, New York: E.P. Dutton.",
                "–––, 1997, <em>Intercourse</em>, New York: Free\nPress Paperbacks.",
                "–––, 2000, “Against the Male Flood:\nCensorship, Pornography, and Equality”, in <em>Oxford Readings\nin Feminism: Feminism and Pornography</em>, Drucilla Cornell (ed.),\nOxford: Oxford University Press, 19–44.",
                "Dworkin, Ronald, 1991, “Liberty and Pornography”,\n<em>New York Review of Books</em>, XXXVIII, 14.",
                "–––, 1993, “Women and Pornography”,\n<em>New York Review of Books</em>, October 21, 1993, p. 36.",
                "Green, Leslie, 2000, “Pornographies”, <em>Journal of\nPolitical Philosophy</em>, 8(1): 27–52.",
                "Halwani, Raja, 2008, “Virtue Ethics, Casual Sex, and\nObjectification”, in <em>Philosophy of Sex</em>, fifth edition,\nAlan Soble and Nicholas Power (eds.), Rowman &amp; Littlefield\nPublishers, Inc., 337–352.",
                "–––, 2017, “Casual Sex, Promiscuity, and\nObjectification”, in <em>Philosophy of Sex</em>, seventh\nedition, Raja Halwani, Alan Soble, Sarah Hoffman, Jacob M. Held\n(eds.), Rowman &amp; Littlefield Publishers, Inc., 401–420.",
                "–––, 2010, “Sexual Objectification”,\nin <em>Philosophy of Love, Sex, and Marriage: An Introduction</em>,\nNew York: Routledge, 186–226.",
                "–––, 2018, “Sexual Objectification”,\nin <em>Philosophy of Love, Sex, and Marriage: An Introduction</em>,\nsecond edition, New York: Routledge, 241–279.",
                "Hampton, Jean, 1999, “Defining Wrong and Defining\nRape”, in Keith Burgess-Jackson (ed.), <em>A Most Detestable\nCrime</em>, Oxford: Oxford University Press, 118–156.",
                "Haslanger, Sally, 1993, “On Being Objective and Being\nObjectified”, in <em>A Mind of One’s Own. Feminist Essays\non Reason and Objectivity</em>, Louise M. Antony and Charlotte Witt\n(eds.), Boulder, San Francisco, Oxford: Westview Press,\n209–253.",
                "–––, 1999, “What Knowledge Is and What It\nOught To Be: Feminist Values and Normative Epistemology”,\n<em>Philosophical Perspectives</em>, 13: 459–480.\n [<a href=\"http://www.mit.edu/%7Eshaslang/papers/HaslangerWKIWOB.pdf\" target=\"other\">Preprint of Haslanger 1999 available online</a>]",
                "–––, 2000, “Gender and Race: (What) Are\nThey? (What) Do We Want Them To Be?”, <em>Noûs</em>,\n34(1): 31–55.\n [<a href=\"http://www.mit.edu/%7Eshaslang/papers/WIGRnous.pdf\" target=\"other\">Preprint of Haslanger 2000 available online</a>]",
                "Herman, Barbara, 1993, “Could It Be Worth Thinking About\nKant on Sex and Marriage?”, in <em>A Mind of One’s Own.\nFeminist Essays on Reason and Objectivity</em>, Louise M. Antony and\nCharlotte Witt (eds.), Boulder, San Francisco, Oxford: Westview Press,\n53–72.",
                "Huseyinzadegan, Dilek, 2019, <em>Kant’s Nonideal Theory of\nPolitics</em>, Chicago: Northwestern University Press.",
                "–––, 2018, “For What Can the Kantian\nFeminist Hope? Constructive Complicity in Appropriations of the\nCanon”, <em>Feminist Philosophy Quarterly</em>,\n4(1). doi:10.5206/fpq/2018.1.3",
                "–––, 2015, “Kant’s Political\n<em>Zweckmässigkeit</em>”, <em>Kantian Review</em>,\n20(3): 412–444.",
                "Huseyinzadegan, Dilek, and Jordan Pascoe, 2022, in Lettow\nand Pulkkinen (eds.) 2022, 31–49.",
                "Kant, Immanuel, 1785, <em>Groundwork of the Metaphysics of\nMorals</em>, (Series: Cambridge Texts in the History of Philosophy),\nMary Gregor (ed.), Cambridge University Press, 1998.",
                "–––, 1797, <em>The Metaphysics of Morals</em>,\n(Series: Cambridge Texts in the History of Philosophy), Mary Gregor\n(ed.), Cambridge: Cambridge University Press, 1996.",
                "–––, “Kant on the Metaphysics of Morals:\nVigilantius’s Lecture Notes”, in <em>Lectures on\nEthics</em>, P. Heath and J. B. Schneewind (eds.), Cambridge:\nCambridge University Press, 1997.",
                "–––, <em>Lectures on Ethics</em>, Louis Infield\n(trans.), New York: Harper and Row, Publishers, 1963.",
                "Korsgaard, Christine, 1996, <em>Creating the Kingdom of Ends</em>,\nCambridge: Cambridge University Press.",
                "Langton, Rae, 1993, “Beyond a Pragmatic Critique of\nReason”, <em>Australasian Journal of Philosophy</em>, 71(4):\n364–384.",
                "–––, 1995, “Sexual Solipsism”,\n<em>Philosophical Topics</em>, 23(2): 181–219.",
                "–––, 1996, “Pornography: A Liberal’s\nUnfinished Business”, <em>Canadian Journal of Law and\nJurisprudence</em>, 12(1): 109–133.",
                "–––, 1997, “Love and Solipsism”, in\n<em>Love Analysed</em>, R.E. Lamb (ed.), Boulder, CO: Westview Press,\n123–152.",
                "–––, 2000, “Feminism in Epistemology:\nExclusion and Objectification”, in M. Fricker and J. Hornsby\n(eds.), <em>The Cambridge Companion to Feminism in Philosophy</em>,\nCambridge: Cambridge University Press, 127–145.",
                "–––, 2004, “Projection and\nObjectification”, in <em>The Future for Philosophy</em>, Brian\nLeiter (ed.), Oxford: Clarendon Press, 285–303.",
                "–––, 2009, <em>Sexual Solipsism: Philosophical\nEssays on Pornography and Objectification</em>, Oxford: Oxford\nUniversity Press.",
                "LeMoncheck, Linda, 1985, <em>Dehumanizing Women: Treating Persons\nas Sex Objects</em>, Totowa, NJ: Rowman &amp; Littlefield.",
                "Lettow, S., and T. Pulkkinen (eds.), 2022, <em>The Palgrave\nHandbook of German Idealism and Feminist Philosophy</em>, Cham:\nPalgrave Macmillan, doi:10.1007/978-3-031-13123-3_4\n\nMacKinnon, Catharine, 1987, <em>Feminism Unmodified</em>,\nCambridge, Massachusetts, and London, England: Harvard University\nPress.\nMacKinnon, Catharine, 1989a, <em>Towards a Feminist Theory of the\nState</em>, Cambridge, Massachusetts: Harvard University Press.\n–––, 1989b, “Sexuality, Pornography, and\nMethod: Pleasure under Patriarchy”, <em>Ethics</em>, 99(2):\n314–346.\n–––, 1993, <em>Only Words</em>, Cambridge\nMassachusetts: Harvard University Press.\n–––, 1995, “Speech, Equality, and Harm:\nThe Case Against Pornography”, in <em>The Price We Pay: The Case\nAgainst Racist Speech, Hate Propaganda, and Pornography</em>, L.\nLederer and R. Delgado (eds.), New York: Hill and Wang, 301.\n–––, 1997, “Pornography Left and\nRight”, in <em>Sex, Preference, and Family: Essays on Law and\nNature</em>, M. Nussbaum (ed.), Oxford: Oxford University Press,\n102–125.\n–––, 2006, <em>Are Women Human? And Other\nInternational Dialogues</em>, Cambridge, Mass.: Belnap Press.\nMappes, Thomas, 2002, “Sexual Morality and the Concept of\nUsing Another Person”, in <em>The Philosophy of Sex:\nContemporary Readings</em>, A. Soble (ed.), Lanham, Maryland: Rowman\n&amp; Littlefield Publishers, Inc., 207–223.\nMcLeod, Carolyn, 2003, “Mere and Partial Means: The Full\nRange of the Objectification of Women”, <em>Canadian Journal of\nPhilosophy</em>, Supplementary Volume 28: 219–244.\nMorgan, Seiriol, 2003, “Dark Desires”, <em>Ethical\nTheory and Moral Practice</em>, 6 (4): 377–410.\nNagl-Docekal, Herta, 2022, “Feminist Perspectives on\nKant’s Conception of Autonomy: On the Need to Distinguish\nbetween Self-Determination and Self-Legislation”, in Lettow and\nPulkkinen (eds.) 2022, 51–72.\ndoi:10.1007/978-3-031-13123-3_4\nNussbaum, Martha, 1995, “Objectification”,\n<em>Philosophy and Public Affairs</em>, 24(4): 249–291.\nNussbaum, Martha, 1999, <em>Sex and Social Justice</em>, Oxford:\nOxford University Press.\n–––, 2007, “Feminism, Virtue, and\nObjectification”, in <em>Sex and Ethics: Essays on Sexuality,\nVirtue, and the Good Life</em>, R. Halwani (ed.), New York: Palgrave\nMacmillan, 49–62.\nPapadaki, Lina, 2007, “Sexual Objectification: From Kant to\nContemporary Feminism”, <em>Contemporary Political Theory</em>,\n6(3): 330–348.\n–––, 2008, “Women’s Objectification\nand the Norm of Assumed Objectivity”, <em>Episteme</em>, 5(2):\n239–250.\n–––, 2010a, “What is\nObjectification?”, <em>Journal of Moral Philosophy</em>, 7(1):\n16–36.\n–––, 2010b, “Kantian Marriage and Beyond:\nWhy it is Worth Thinking about Kant on Marriage”,\n<em>Hypatia</em>, 25(2): 45–61.\n–––, 2015, “What is Wrong About\nObjectification?”, in <em>Current Controversies in Political\nPhilosophy</em>, Thom Brooks (ed.), London: Routledge,\n87–99.\n–––, 2017, “Sexual Objectification”,\nin <em>Philosophy of Sex</em>, seventh edition, Raja Halwani, Alan\nSoble, Sarah Hoffman, Jacob M. Held (eds.), Rowman &amp; Littlefield\nPublishers, Inc., 381–400.\nParfit, Derek, 2011, <em>On What Matters</em>, Oxford: Oxford\nUniversity Press (especially Chapter 9, “Merely as\nMeans”).\nPascoe, Jordan, 2023, <em>Kant’s Theory of Labour</em>,\nCambridge: Cambridge University Press,\n–––, 2023, “Beyond Consent: On Setting and\nSharing Sexual Ends”, <em>Philosophies</em>, 8(2): 21.\ndoi:10.3390/philosophies8020021\n–––, 2018, “A Universal Estate? Why\nKant’s Account of Marriage Speaks to the 21st Century\nDebate”, in <em>Kant’s Doctrine of Right in the Twenty\nFirst Century</em>, Larry Krasnoff and Nuria Sanchez Madrid (eds.),\nCardiff: University of Wales Press.\n–––, 2015, “Domestic Labor, Citizenship,\nand Exceptionalism: Rethinking Kant’s ‘Woman\nProblem’”, in <em>Journal of Social Philosophy</em>, 46(3): \n340–356.\nPulkkinen, Tuija, 2022, “Reason and the Transcendental\nSubject: Kant’s Trace in Feminist Philosophy”, in Lettow\nand Pulkkinen (eds.) 2022, 73–89.\n–––, 2006, “On Treating Things as People:\nObjectification, Pornography and the History of the Vibrator”,\n<em>Hypatia</em>, 21(2): 45–61.\nSanford, Stella, 2022, “The Taxonomy of ‘Race’\nand the Anthropology of Sex: Conceptual Determination and Social\nPresumption in Kant”, in Lettow\nand Pulkkinen (eds.) 2022, 131–150.\nSaul, Jennifer, 2003, <em>Feminism: Issues and Arguments</em>,\nOxford: Oxford University Press.\nShorter-Bourhanou, Jameliah Inga, 2022, “Black Feminism and\nKantian Universalism”, in Lettow and Pulkkinen\n(eds.) 2022, 13–30.\nShrage, Laurie, 1989, “Should Feminists Oppose\nProstitution?”, in <em>Ethics</em>, 99(2): 347–361.\nSoble, Alan, 2002a, “Sexual Use and What to Do about It:\nInternalist and Externalist Sexual Ethics”, in <em>The\nPhilosophy of Sex: Contemporary Readings</em>, A. Soble (ed.), Lanham,\nMaryland: Rowman &amp; Littlefield Publishers, Inc., pp.\n259–288.\n–––, 2002b, <em>Pornography, Sex, and\nFeminism</em>, Prometheus books.\nVadas, Melinda, 1987, “A First Look at the Pornography/Civil\nRights Ordinance: Could Pornography Be the Subordination of\nWomen?”, <em>The Journal of Philosophy</em>, 84(9):\n487–511.\n–––, 2005, “The Manufacture-for-use of\nPornography and Women’s Inequality”, <em>The Journal of\nPolitical Philosophy</em>, 13(2): 174–193.\nYoung, Iris Marion, 1979, “Is There a Woman’s\nWorld?—Some Reflections on the Struggle for Our Bodies”,\n<em>Proceedings of The Second Sex—Thirty Years Later: A\nCommemorative Conference on Feminist Theory</em>, New York: The New\nYork Institute for the Humanities.\n–––, 2005, <em>On Female Body Experience:\n“Throwing like a girl” and other essays</em>, Oxford:\nOxford University Press.\n",
                "MacKinnon, Catharine, 1987, <em>Feminism Unmodified</em>,\nCambridge, Massachusetts, and London, England: Harvard University\nPress.",
                "MacKinnon, Catharine, 1989a, <em>Towards a Feminist Theory of the\nState</em>, Cambridge, Massachusetts: Harvard University Press.",
                "–––, 1989b, “Sexuality, Pornography, and\nMethod: Pleasure under Patriarchy”, <em>Ethics</em>, 99(2):\n314–346.",
                "–––, 1993, <em>Only Words</em>, Cambridge\nMassachusetts: Harvard University Press.",
                "–––, 1995, “Speech, Equality, and Harm:\nThe Case Against Pornography”, in <em>The Price We Pay: The Case\nAgainst Racist Speech, Hate Propaganda, and Pornography</em>, L.\nLederer and R. Delgado (eds.), New York: Hill and Wang, 301.",
                "–––, 1997, “Pornography Left and\nRight”, in <em>Sex, Preference, and Family: Essays on Law and\nNature</em>, M. Nussbaum (ed.), Oxford: Oxford University Press,\n102–125.",
                "–––, 2006, <em>Are Women Human? And Other\nInternational Dialogues</em>, Cambridge, Mass.: Belnap Press.",
                "Mappes, Thomas, 2002, “Sexual Morality and the Concept of\nUsing Another Person”, in <em>The Philosophy of Sex:\nContemporary Readings</em>, A. Soble (ed.), Lanham, Maryland: Rowman\n&amp; Littlefield Publishers, Inc., 207–223.",
                "McLeod, Carolyn, 2003, “Mere and Partial Means: The Full\nRange of the Objectification of Women”, <em>Canadian Journal of\nPhilosophy</em>, Supplementary Volume 28: 219–244.",
                "Morgan, Seiriol, 2003, “Dark Desires”, <em>Ethical\nTheory and Moral Practice</em>, 6 (4): 377–410.",
                "Nagl-Docekal, Herta, 2022, “Feminist Perspectives on\nKant’s Conception of Autonomy: On the Need to Distinguish\nbetween Self-Determination and Self-Legislation”, in Lettow and\nPulkkinen (eds.) 2022, 51–72.\ndoi:10.1007/978-3-031-13123-3_4",
                "Nussbaum, Martha, 1995, “Objectification”,\n<em>Philosophy and Public Affairs</em>, 24(4): 249–291.",
                "Nussbaum, Martha, 1999, <em>Sex and Social Justice</em>, Oxford:\nOxford University Press.",
                "–––, 2007, “Feminism, Virtue, and\nObjectification”, in <em>Sex and Ethics: Essays on Sexuality,\nVirtue, and the Good Life</em>, R. Halwani (ed.), New York: Palgrave\nMacmillan, 49–62.",
                "Papadaki, Lina, 2007, “Sexual Objectification: From Kant to\nContemporary Feminism”, <em>Contemporary Political Theory</em>,\n6(3): 330–348.",
                "–––, 2008, “Women’s Objectification\nand the Norm of Assumed Objectivity”, <em>Episteme</em>, 5(2):\n239–250.",
                "–––, 2010a, “What is\nObjectification?”, <em>Journal of Moral Philosophy</em>, 7(1):\n16–36.",
                "–––, 2010b, “Kantian Marriage and Beyond:\nWhy it is Worth Thinking about Kant on Marriage”,\n<em>Hypatia</em>, 25(2): 45–61.",
                "–––, 2015, “What is Wrong About\nObjectification?”, in <em>Current Controversies in Political\nPhilosophy</em>, Thom Brooks (ed.), London: Routledge,\n87–99.",
                "–––, 2017, “Sexual Objectification”,\nin <em>Philosophy of Sex</em>, seventh edition, Raja Halwani, Alan\nSoble, Sarah Hoffman, Jacob M. Held (eds.), Rowman &amp; Littlefield\nPublishers, Inc., 381–400.",
                "Parfit, Derek, 2011, <em>On What Matters</em>, Oxford: Oxford\nUniversity Press (especially Chapter 9, “Merely as\nMeans”).",
                "Pascoe, Jordan, 2023, <em>Kant’s Theory of Labour</em>,\nCambridge: Cambridge University Press,",
                "–––, 2023, “Beyond Consent: On Setting and\nSharing Sexual Ends”, <em>Philosophies</em>, 8(2): 21.\ndoi:10.3390/philosophies8020021",
                "–––, 2018, “A Universal Estate? Why\nKant’s Account of Marriage Speaks to the 21st Century\nDebate”, in <em>Kant’s Doctrine of Right in the Twenty\nFirst Century</em>, Larry Krasnoff and Nuria Sanchez Madrid (eds.),\nCardiff: University of Wales Press.",
                "–––, 2015, “Domestic Labor, Citizenship,\nand Exceptionalism: Rethinking Kant’s ‘Woman\nProblem’”, in <em>Journal of Social Philosophy</em>, 46(3): \n340–356.",
                "Pulkkinen, Tuija, 2022, “Reason and the Transcendental\nSubject: Kant’s Trace in Feminist Philosophy”, in Lettow\nand Pulkkinen (eds.) 2022, 73–89.",
                "–––, 2006, “On Treating Things as People:\nObjectification, Pornography and the History of the Vibrator”,\n<em>Hypatia</em>, 21(2): 45–61.",
                "Sanford, Stella, 2022, “The Taxonomy of ‘Race’\nand the Anthropology of Sex: Conceptual Determination and Social\nPresumption in Kant”, in Lettow\nand Pulkkinen (eds.) 2022, 131–150.",
                "Saul, Jennifer, 2003, <em>Feminism: Issues and Arguments</em>,\nOxford: Oxford University Press.",
                "Shorter-Bourhanou, Jameliah Inga, 2022, “Black Feminism and\nKantian Universalism”, in Lettow and Pulkkinen\n(eds.) 2022, 13–30.",
                "Shrage, Laurie, 1989, “Should Feminists Oppose\nProstitution?”, in <em>Ethics</em>, 99(2): 347–361.",
                "Soble, Alan, 2002a, “Sexual Use and What to Do about It:\nInternalist and Externalist Sexual Ethics”, in <em>The\nPhilosophy of Sex: Contemporary Readings</em>, A. Soble (ed.), Lanham,\nMaryland: Rowman &amp; Littlefield Publishers, Inc., pp.\n259–288.",
                "–––, 2002b, <em>Pornography, Sex, and\nFeminism</em>, Prometheus books.",
                "Vadas, Melinda, 1987, “A First Look at the Pornography/Civil\nRights Ordinance: Could Pornography Be the Subordination of\nWomen?”, <em>The Journal of Philosophy</em>, 84(9):\n487–511.",
                "–––, 2005, “The Manufacture-for-use of\nPornography and Women’s Inequality”, <em>The Journal of\nPolitical Philosophy</em>, 13(2): 174–193.",
                "Young, Iris Marion, 1979, “Is There a Woman’s\nWorld?—Some Reflections on the Struggle for Our Bodies”,\n<em>Proceedings of The Second Sex—Thirty Years Later: A\nCommemorative Conference on Feminist Theory</em>, New York: The New\nYork Institute for the Humanities.",
                "–––, 2005, <em>On Female Body Experience:\n“Throwing like a girl” and other essays</em>, Oxford:\nOxford University Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Altman, Andrew and Watson, Lori, 2019, <em>Debating\nPornography</em>, Oxford: Oxford University Press.</li>\n<li>Assiter, Alison, 1988, “Autonomy and Pornography”, in\n<em>Feminist Perspectives in Philosophy</em>, M. Griffiths and M.\nWhitford (eds.), Bloomington: Indiana University Press.</li>\n<li>Bartky, Sandra-Lee, 1990, <em>Femininity and Domination: Studies\nin the Phenomenology of Oppression</em>, New York: Routledge.</li>\n<li>Bauer, Nancy, 2015, <em>How to Do Things with Pornography</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 2011, “Beauvoir on the Allure of\nSelf-Objectification”, in <em>Feminist Metaphysics</em>,\nFeminist Philosophy Collection, Charlotte Witt (ed.), Springer\nScience+Business Media B.V., 117–129.</li>\n<li>de Beauvoir, Simone, 1961, <em>The Second Sex</em>, New York:\nGrune and Stratton.</li>\n<li>Bordo, Susan, 1993, <em>Unbearable Weight</em>, Berkeley, CA:\nUniversity of California Press.</li>\n<li>Bordo, Susan, 1999, <em>The Male Body</em>, New York: Farrar,\nStraus and Giroux.</li>\n<li>Cameron, D., and E. Frazer, 2000, “On the Question of\nPornography and Sexual Violence: Moving Beyond Cause and\nEffect”, in <em>Feminism and Pornography</em>, D. Cornell (ed.),\nOxford: Oxford University Press, pp. 240–253.</li>\n<li>Davis, Nancy, 1984, “Using Persons and Common Sense”,\n<em>Ethics</em>, 94(3): 387–406.</li>\n<li>Doyle, Tony, 2002, “MacKinnon on Pornography”,\n<em>Journal of Information Ethics</em>, 11(2): 53–78.</li>\n<li>Dworkin, Andrea, 1974, <em>Woman Hating</em>, New York:\nDutton.</li>\n<li>–––, 1989, <em>Pornography: Men Possessing\nWomen</em>, New York: E.P. Dutton.</li>\n<li>–––, 1997, <em>Intercourse</em>, New York: Free\nPress Paperbacks.</li>\n<li>–––, 2000, “Against the Male Flood:\nCensorship, Pornography, and Equality”, in <em>Oxford Readings\nin Feminism: Feminism and Pornography</em>, Drucilla Cornell (ed.),\nOxford: Oxford University Press, 19–44.</li>\n<li>Dworkin, Ronald, 1991, “Liberty and Pornography”,\n<em>New York Review of Books</em>, XXXVIII, 14.</li>\n<li>–––, 1993, “Women and Pornography”,\n<em>New York Review of Books</em>, October 21, 1993, p. 36.</li>\n<li>Green, Leslie, 2000, “Pornographies”, <em>Journal of\nPolitical Philosophy</em>, 8(1): 27–52.</li>\n<li>Halwani, Raja, 2008, “Virtue Ethics, Casual Sex, and\nObjectification”, in <em>Philosophy of Sex</em>, fifth edition,\nAlan Soble and Nicholas Power (eds.), Rowman &amp; Littlefield\nPublishers, Inc., 337–352.</li>\n<li>–––, 2017, “Casual Sex, Promiscuity, and\nObjectification”, in <em>Philosophy of Sex</em>, seventh\nedition, Raja Halwani, Alan Soble, Sarah Hoffman, Jacob M. Held\n(eds.), Rowman &amp; Littlefield Publishers, Inc., 401–420.</li>\n<li>–––, 2010, “Sexual Objectification”,\nin <em>Philosophy of Love, Sex, and Marriage: An Introduction</em>,\nNew York: Routledge, 186–226.</li>\n<li>–––, 2018, “Sexual Objectification”,\nin <em>Philosophy of Love, Sex, and Marriage: An Introduction</em>,\nsecond edition, New York: Routledge, 241–279.</li>\n<li>Hampton, Jean, 1999, “Defining Wrong and Defining\nRape”, in Keith Burgess-Jackson (ed.), <em>A Most Detestable\nCrime</em>, Oxford: Oxford University Press, 118–156.</li>\n<li>Haslanger, Sally, 1993, “On Being Objective and Being\nObjectified”, in <em>A Mind of One’s Own. Feminist Essays\non Reason and Objectivity</em>, Louise M. Antony and Charlotte Witt\n(eds.), Boulder, San Francisco, Oxford: Westview Press,\n209–253.</li>\n<li>–––, 1999, “What Knowledge Is and What It\nOught To Be: Feminist Values and Normative Epistemology”,\n<em>Philosophical Perspectives</em>, 13: 459–480.\n [<a href=\"http://www.mit.edu/%7Eshaslang/papers/HaslangerWKIWOB.pdf\" target=\"other\">Preprint of Haslanger 1999 available online</a>]</li>\n<li>–––, 2000, “Gender and Race: (What) Are\nThey? (What) Do We Want Them To Be?”, <em>Noûs</em>,\n34(1): 31–55.\n [<a href=\"http://www.mit.edu/%7Eshaslang/papers/WIGRnous.pdf\" target=\"other\">Preprint of Haslanger 2000 available online</a>]</li>\n<li>Herman, Barbara, 1993, “Could It Be Worth Thinking About\nKant on Sex and Marriage?”, in <em>A Mind of One’s Own.\nFeminist Essays on Reason and Objectivity</em>, Louise M. Antony and\nCharlotte Witt (eds.), Boulder, San Francisco, Oxford: Westview Press,\n53–72.</li>\n<li>Huseyinzadegan, Dilek, 2019, <em>Kant’s Nonideal Theory of\nPolitics</em>, Chicago: Northwestern University Press.</li>\n<li>–––, 2018, “For What Can the Kantian\nFeminist Hope? Constructive Complicity in Appropriations of the\nCanon”, <em>Feminist Philosophy Quarterly</em>,\n4(1). doi:10.5206/fpq/2018.1.3</li>\n<li>–––, 2015, “Kant’s Political\n<em>Zweckmässigkeit</em>”, <em>Kantian Review</em>,\n20(3): 412–444.</li>\n<li>Huseyinzadegan, Dilek, and Jordan Pascoe, 2022, in Lettow\nand Pulkkinen (eds.) 2022, 31–49.</li>\n<li>Kant, Immanuel, 1785, <em>Groundwork of the Metaphysics of\nMorals</em>, (Series: Cambridge Texts in the History of Philosophy),\nMary Gregor (ed.), Cambridge University Press, 1998.</li>\n<li>–––, 1797, <em>The Metaphysics of Morals</em>,\n(Series: Cambridge Texts in the History of Philosophy), Mary Gregor\n(ed.), Cambridge: Cambridge University Press, 1996.</li>\n<li>–––, “Kant on the Metaphysics of Morals:\nVigilantius’s Lecture Notes”, in <em>Lectures on\nEthics</em>, P. Heath and J. B. Schneewind (eds.), Cambridge:\nCambridge University Press, 1997.</li>\n<li>–––, <em>Lectures on Ethics</em>, Louis Infield\n(trans.), New York: Harper and Row, Publishers, 1963.</li>\n<li>Korsgaard, Christine, 1996, <em>Creating the Kingdom of Ends</em>,\nCambridge: Cambridge University Press.</li>\n<li>Langton, Rae, 1993, “Beyond a Pragmatic Critique of\nReason”, <em>Australasian Journal of Philosophy</em>, 71(4):\n364–384.</li>\n<li>–––, 1995, “Sexual Solipsism”,\n<em>Philosophical Topics</em>, 23(2): 181–219.</li>\n<li>–––, 1996, “Pornography: A Liberal’s\nUnfinished Business”, <em>Canadian Journal of Law and\nJurisprudence</em>, 12(1): 109–133.</li>\n<li>–––, 1997, “Love and Solipsism”, in\n<em>Love Analysed</em>, R.E. Lamb (ed.), Boulder, CO: Westview Press,\n123–152.</li>\n<li>–––, 2000, “Feminism in Epistemology:\nExclusion and Objectification”, in M. Fricker and J. Hornsby\n(eds.), <em>The Cambridge Companion to Feminism in Philosophy</em>,\nCambridge: Cambridge University Press, 127–145.</li>\n<li>–––, 2004, “Projection and\nObjectification”, in <em>The Future for Philosophy</em>, Brian\nLeiter (ed.), Oxford: Clarendon Press, 285–303.</li>\n<li>–––, 2009, <em>Sexual Solipsism: Philosophical\nEssays on Pornography and Objectification</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>LeMoncheck, Linda, 1985, <em>Dehumanizing Women: Treating Persons\nas Sex Objects</em>, Totowa, NJ: Rowman &amp; Littlefield.</li>\n<li>Lettow, S., and T. Pulkkinen (eds.), 2022, <em>The Palgrave\nHandbook of German Idealism and Feminist Philosophy</em>, Cham:\nPalgrave Macmillan, doi:10.1007/978-3-031-13123-3_4\n\n<li>MacKinnon, Catharine, 1987, <em>Feminism Unmodified</em>,\nCambridge, Massachusetts, and London, England: Harvard University\nPress.</li>\n<li>MacKinnon, Catharine, 1989a, <em>Towards a Feminist Theory of the\nState</em>, Cambridge, Massachusetts: Harvard University Press.</li>\n<li>–––, 1989b, “Sexuality, Pornography, and\nMethod: Pleasure under Patriarchy”, <em>Ethics</em>, 99(2):\n314–346.</li>\n<li>–––, 1993, <em>Only Words</em>, Cambridge\nMassachusetts: Harvard University Press.</li>\n<li>–––, 1995, “Speech, Equality, and Harm:\nThe Case Against Pornography”, in <em>The Price We Pay: The Case\nAgainst Racist Speech, Hate Propaganda, and Pornography</em>, L.\nLederer and R. Delgado (eds.), New York: Hill and Wang, 301.</li>\n<li>–––, 1997, “Pornography Left and\nRight”, in <em>Sex, Preference, and Family: Essays on Law and\nNature</em>, M. Nussbaum (ed.), Oxford: Oxford University Press,\n102–125.</li>\n<li>–––, 2006, <em>Are Women Human? And Other\nInternational Dialogues</em>, Cambridge, Mass.: Belnap Press.</li>\n<li>Mappes, Thomas, 2002, “Sexual Morality and the Concept of\nUsing Another Person”, in <em>The Philosophy of Sex:\nContemporary Readings</em>, A. Soble (ed.), Lanham, Maryland: Rowman\n&amp; Littlefield Publishers, Inc., 207–223.</li>\n<li>McLeod, Carolyn, 2003, “Mere and Partial Means: The Full\nRange of the Objectification of Women”, <em>Canadian Journal of\nPhilosophy</em>, Supplementary Volume 28: 219–244.</li>\n<li>Morgan, Seiriol, 2003, “Dark Desires”, <em>Ethical\nTheory and Moral Practice</em>, 6 (4): 377–410.</li>\n<li>Nagl-Docekal, Herta, 2022, “Feminist Perspectives on\nKant’s Conception of Autonomy: On the Need to Distinguish\nbetween Self-Determination and Self-Legislation”, in Lettow and\nPulkkinen (eds.) 2022, 51–72.\ndoi:10.1007/978-3-031-13123-3_4</li>\n<li>Nussbaum, Martha, 1995, “Objectification”,\n<em>Philosophy and Public Affairs</em>, 24(4): 249–291.</li>\n<li>Nussbaum, Martha, 1999, <em>Sex and Social Justice</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2007, “Feminism, Virtue, and\nObjectification”, in <em>Sex and Ethics: Essays on Sexuality,\nVirtue, and the Good Life</em>, R. Halwani (ed.), New York: Palgrave\nMacmillan, 49–62.</li>\n<li>Papadaki, Lina, 2007, “Sexual Objectification: From Kant to\nContemporary Feminism”, <em>Contemporary Political Theory</em>,\n6(3): 330–348.</li>\n<li>–––, 2008, “Women’s Objectification\nand the Norm of Assumed Objectivity”, <em>Episteme</em>, 5(2):\n239–250.</li>\n<li>–––, 2010a, “What is\nObjectification?”, <em>Journal of Moral Philosophy</em>, 7(1):\n16–36.</li>\n<li>–––, 2010b, “Kantian Marriage and Beyond:\nWhy it is Worth Thinking about Kant on Marriage”,\n<em>Hypatia</em>, 25(2): 45–61.</li>\n<li>–––, 2015, “What is Wrong About\nObjectification?”, in <em>Current Controversies in Political\nPhilosophy</em>, Thom Brooks (ed.), London: Routledge,\n87–99.</li>\n<li>–––, 2017, “Sexual Objectification”,\nin <em>Philosophy of Sex</em>, seventh edition, Raja Halwani, Alan\nSoble, Sarah Hoffman, Jacob M. Held (eds.), Rowman &amp; Littlefield\nPublishers, Inc., 381–400.</li>\n<li>Parfit, Derek, 2011, <em>On What Matters</em>, Oxford: Oxford\nUniversity Press (especially Chapter 9, “Merely as\nMeans”).</li>\n<li>Pascoe, Jordan, 2023, <em>Kant’s Theory of Labour</em>,\nCambridge: Cambridge University Press,</li>\n<li>–––, 2023, “Beyond Consent: On Setting and\nSharing Sexual Ends”, <em>Philosophies</em>, 8(2): 21.\ndoi:10.3390/philosophies8020021</li>\n<li>–––, 2018, “A Universal Estate? Why\nKant’s Account of Marriage Speaks to the 21st Century\nDebate”, in <em>Kant’s Doctrine of Right in the Twenty\nFirst Century</em>, Larry Krasnoff and Nuria Sanchez Madrid (eds.),\nCardiff: University of Wales Press.</li>\n<li>–––, 2015, “Domestic Labor, Citizenship,\nand Exceptionalism: Rethinking Kant’s ‘Woman\nProblem’”, in <em>Journal of Social Philosophy</em>, 46(3): \n340–356.</li>\n<li>Pulkkinen, Tuija, 2022, “Reason and the Transcendental\nSubject: Kant’s Trace in Feminist Philosophy”, in Lettow\nand Pulkkinen (eds.) 2022, 73–89.</li>\n<li>–––, 2006, “On Treating Things as People:\nObjectification, Pornography and the History of the Vibrator”,\n<em>Hypatia</em>, 21(2): 45–61.</li>\n<li>Sanford, Stella, 2022, “The Taxonomy of ‘Race’\nand the Anthropology of Sex: Conceptual Determination and Social\nPresumption in Kant”, in Lettow\nand Pulkkinen (eds.) 2022, 131–150.</li>\n<li>Saul, Jennifer, 2003, <em>Feminism: Issues and Arguments</em>,\nOxford: Oxford University Press.</li>\n<li>Shorter-Bourhanou, Jameliah Inga, 2022, “Black Feminism and\nKantian Universalism”, in Lettow and Pulkkinen\n(eds.) 2022, 13–30.</li>\n<li>Shrage, Laurie, 1989, “Should Feminists Oppose\nProstitution?”, in <em>Ethics</em>, 99(2): 347–361.</li>\n<li>Soble, Alan, 2002a, “Sexual Use and What to Do about It:\nInternalist and Externalist Sexual Ethics”, in <em>The\nPhilosophy of Sex: Contemporary Readings</em>, A. Soble (ed.), Lanham,\nMaryland: Rowman &amp; Littlefield Publishers, Inc., pp.\n259–288.</li>\n<li>–––, 2002b, <em>Pornography, Sex, and\nFeminism</em>, Prometheus books.</li>\n<li>Vadas, Melinda, 1987, “A First Look at the Pornography/Civil\nRights Ordinance: Could Pornography Be the Subordination of\nWomen?”, <em>The Journal of Philosophy</em>, 84(9):\n487–511.</li>\n<li>–––, 2005, “The Manufacture-for-use of\nPornography and Women’s Inequality”, <em>The Journal of\nPolitical Philosophy</em>, 13(2): 174–193.</li>\n<li>Young, Iris Marion, 1979, “Is There a Woman’s\nWorld?—Some Reflections on the Struggle for Our Bodies”,\n<em>Proceedings of The Second Sex—Thirty Years Later: A\nCommemorative Conference on Feminist Theory</em>, New York: The New\nYork Institute for the Humanities.</li>\n<li>–––, 2005, <em>On Female Body Experience:\n“Throwing like a girl” and other essays</em>, Oxford:\nOxford University Press.</li>\n</li></ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Beauvoir, Simone de",
            "feminist philosophy, interventions: epistemology and philosophy of science",
            "feminist philosophy, interventions: ethics",
            "feminist philosophy, interventions: social epistemology",
            "feminist philosophy, topics: perspectives on power",
            "feminist philosophy, topics: perspectives on sex and gender",
            "feminist philosophy, topics: perspectives on sex markets",
            "pornography: and censorship"
        ],
        "entry_link": [
            {
                "../beauvoir/": "Beauvoir, Simone de"
            },
            {
                "../feminism-epistemology/": "feminist philosophy, interventions: epistemology and philosophy of science"
            },
            {
                "../feminism-ethics/": "feminist philosophy, interventions: ethics"
            },
            {
                "../feminist-social-epistemology/": "feminist philosophy, interventions: social epistemology"
            },
            {
                "../feminist-power/": "feminist philosophy, topics: perspectives on power"
            },
            {
                "../feminism-gender/": "feminist philosophy, topics: perspectives on sex and gender"
            },
            {
                "../feminist-sex-markets/": "feminist philosophy, topics: perspectives on sex markets"
            },
            {
                "../pornography-censorship/": "pornography: and censorship"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminism-objectification\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/feminism-objectification/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=feminism-objectification&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/feminism-objectification/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminism-objectification": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/feminism-objectification/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=feminism-objectification&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/feminism-objectification/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://future-nonstop.org/c/96c6222b48b5888cd1684421a744224d\" target=\"other\">Feminists Against Censorship</a>,\n by Cherie Matrix, at Future Non Stop: A Living Archive for Digital\nCulture in Theory and Practice.",
            "<a href=\"https://www.2kreviews.com/infographics/internet-pornographic-statistics/\" target=\"other\">Internet Pornography Statistics</a>,\n at 2K Reviews.",
            "<a href=\"http://future-nonstop.org/c/96c6222b48b5888cd1684421a744224d/\" target=\"other\">Feminists Against Censorship</a>,\n maintained by Cherie Matrix.",
            "<a href=\"http://comm.psu.edu/medialab/research-article/sexual-suggestiveness-in-online-ads-effects-of-objectification-on-opposite\" target=\"other\">Sexual Suggestiveness in Online Ads: Effects of Objectification on Opposite Genders</a>,\n by Sriram Kalyanaraman, Michael Redding, and Jason Steele, Media\nEffects Research Laboratory, Pennsylvania State University, 2000.",
            "<a href=\"http://feministphilosophers.wordpress.com/category/objectification/\" target=\"other\">Feminist Philosophers</a>,\n blog.",
            "<a href=\"http://msmagazine.com/blog/2012/07/03/sexual-objectification-part-1-what-is-it/\" target=\"other\">Ms. Blog, Sexual Objectification, Part I: What is it?</a>,\n maintained by Caroline Heldman.",
            "<a href=\"http://msmagazine.com/blog/2012/07/06/sexual-objectification-part-2-the-harm/\" target=\"other\">Ms. Blog, Sexual Objectification, Part II: The harm</a>,\n maintained by Caroline Heldman."
        ],
        "listed_links": [
            {
                "http://future-nonstop.org/c/96c6222b48b5888cd1684421a744224d": "Feminists Against Censorship"
            },
            {
                "https://www.2kreviews.com/infographics/internet-pornographic-statistics/": "Internet Pornography Statistics"
            },
            {
                "http://future-nonstop.org/c/96c6222b48b5888cd1684421a744224d/": "Feminists Against Censorship"
            },
            {
                "http://comm.psu.edu/medialab/research-article/sexual-suggestiveness-in-online-ads-effects-of-objectification-on-opposite": "Sexual Suggestiveness in Online Ads: Effects of Objectification on Opposite Genders"
            },
            {
                "http://feministphilosophers.wordpress.com/category/objectification/": "Feminist Philosophers"
            },
            {
                "http://msmagazine.com/blog/2012/07/03/sexual-objectification-part-1-what-is-it/": "Ms. Blog, Sexual Objectification, Part I: What is it?"
            },
            {
                "http://msmagazine.com/blog/2012/07/06/sexual-objectification-part-2-the-harm/": "Ms. Blog, Sexual Objectification, Part II: The harm"
            }
        ]
    }
}