{
    "url": "feminism-epistemology",
    "title": "Feminist Epistemology and Philosophy of Science",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Elizabeth Anderson\n<eandersn@umich.edu>",
        "author_links": [
            {
                "http://www-personal.umich.edu/~eandersn/index.htm": "Elizabeth Anderson"
            },
            {
                "mailto:eandersn%40umich%2eedu": "eandersn@umich.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"http://www-personal.umich.edu/~eandersn/index.htm\" target=\"other\">Elizabeth Anderson</a>\n&lt;<a href=\"mailto:eandersn%40umich%2eedu\"><em>eandersn<abbr title=\" at \">@</abbr>umich<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Aug 9, 2000",
        "substantive revision Thu Feb 13, 2020"
    ],
    "preamble": "\n\nFeminist epistemology and philosophy of science studies the ways in\nwhich gender does and ought to influence our conceptions of knowledge,\nknowers, and practices of inquiry and justification. It identifies how\ndominant conceptions and practices of knowledge attribution,\nacquisition, and justification disadvantage women and other\nsubordinated groups, and strives to reform them to serve the interests\nof these groups. Various feminist epistemologists and philosophers of\nscience argue that dominant knowledge practices disadvantage women by\n(1) excluding them from inquiry, (2) denying them epistemic authority,\n(3) denigrating “feminine” cognitive styles, (4) producing\ntheories of women that represent them as inferior, or significant only\nin the ways they serve male interests, (5) producing theories of\nsocial phenomena that render women’s activities and interests,\nor gendered power relations, invisible, and (6) producing knowledge\nthat is not useful for people in subordinate positions, or that\nreinforces gender and other social hierarchies. Feminist\nepistemologists trace these failures to flawed conceptions of\nknowledge, knowers, objectivity, and scientific methodology. They\noffer diverse accounts of how to overcome these failures. They also\naim to (1) explain why the entry of women and feminist scholars into\ndifferent academic disciplines has generated new questions, theories,\nmethods, and findings, (2) show how gender and feminist values and\nperspectives have played a causal role in these transformations, (3)\npromote theories that aid egalitarian and liberation movements, and\n(4) defend these developments as epistemic advances. \n\nThe central concept of feminist epistemology is of situated knowledge:\nknowledge that reflects the particular perspectives of the knower.\nFeminist philosophers explore how gender situates knowing subjects.\nThey have articulated three main approaches to this\nquestion—feminist standpoint theory, feminist postmodernism, and\nfeminist empiricism—which have converged over time. Conceptions of\nhow gender situates knowers also inform feminist approaches to the\ncentral problems of the field: grounding feminist criticisms of\nscience and feminist science, defining the proper roles of social and\npolitical values in inquiry, evaluating ideals of objectivity, and\nreforming practices of epistemic authority and epistemic virtue.\n",
    "toc": [
        {
            "#SituKnow": "1. Situated Knowers"
        },
        {
            "#FemiStanTheo": "2. Feminist Standpoint Theory"
        },
        {
            "#FemiPost": "3. Feminist Postmodernism"
        },
        {
            "#FemiEmpi": "4. Feminist Empiricism"
        },
        {
            "#InteFemiStanTheoPostEmpi": "5. Interactions of Feminist Standpoint Theory, Postmodernism, and Empiricism"
        },
        {
            "#FemiScieCritFemiScie": "6. Feminist Science Criticism and Feminist Science"
        },
        {
            "#FemiDefeValuLadeInqu": "7. Feminist Defenses of Value-Laden Inquiry"
        },
        {
            "#FemiCritConcObje": "8. Feminist Critiques and Conceptions of Objectivity"
        },
        {
            "#EpisAuthEpisInjuEpisIgnoVirtEpis": "9. Epistemic Authority, Epistemic Injustice, Epistemologies of Ignorance, and Virtue Epistemology"
        },
        {
            "#ExteCritFemiEpis": "10. External Criticisms of Feminist Epistemology"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Situated Knowers\n\nFeminist epistemology conceives of knowers as situated in particular\nrelations to what is known and to other knowers. What is known, and\nhow it is known, reflects the situation and perspective of the knower.\nHere we are concerned with claims to know, temporarily\nbracketing the question of which claims are true or warranted. \n\nSituated knowledge in general. People may understand\nthe same object in different ways that reflect the distinct relations\nin which they stand to it. (1) Embodiment. People experience\nthe world by using their bodies, which have different constitutions\nand are differently located in space and time. (2) First-person\nvs. third-person knowledge. Individuals have first-personal\naccess to some of their own bodily and mental states, and knowledge about themselves, which differs from third-person\nknowledge about them. (3) Emotions, attitudes, interests, and\nvalues. People often represent objects in relation to their\nemotions, attitudes and interests, which differ from how others\nrepresent these objects.  A thief represents a lock as a frustrating obstacle while its owner represents the lock as a comforting source of security. (4) Personal knowledge of others.\nBecause people behave differently toward others, and others interpret\ntheir behavior differently, depending on their personal relationships,\nwhat others know of them depends on these relationships. (5)\nKnow-how. People have different skills, which may also be a\nsource of different propositional knowledge. (6) Cognitive\nStyles. People have different styles of investigation and\nrepresentation (e.g. preferring lumping or splitting). (7)\nBackground beliefs and worldviews. People form different\nbeliefs about an object, in virtue of different background beliefs. Such differences may lead a patient to interpret his symptoms as signs of a heart attack, while his doctor diagnoses heartburn. Differences in global metaphysical or political worldviews  may also generate different beliefs about particulars on a broader scale. (8) Relations to other\ninquirers. People may stand in different epistemic relations to\nother inquirers—for example, as informants, assistants,\nstudents—which affects their access to information and their\nability to convey their beliefs to others. \n\nSituatedness influences knowers’ access to\ninformation and the terms in which they represent what they know. They\nbear on the form of their knowledge (articulate/implicit,\nformal/informal, and so forth). They affect their attitudes toward\ntheir beliefs (certainty/doubt, dogmatic/open to revision), their\nstandards of justification, and the authority with which they lay\nclaim to their beliefs and offer them to others. They affect\nknowers’ assessment of which claims are significant or\nimportant.\n\nSocial situation. Feminist epistemology focuses on\nhow the social location of the knower affects what and how\nshe knows. It is thus a branch of social epistemology.\nIndividuals’ social locations consist of their ascribed social\nidentities (gender, race, sexual orientation, caste, class, kinship\nstatus, trans/cis etc.) and social relations, roles, and role-given interests,\nwhich are affected by these identities. Individuals are subject to\ndifferent norms that prescribe different virtues, habits, emotions,\nand skills thought to be appropriate for their roles. They also have\ndifferent subjective identities—identities incorporated into their self-understandings—, and attitudes toward their ascribed identities, such as affirmation, rejection, pride, and shame. \n\nGender as a mode of social situation. In feminist\ntheory, “gender” refers to systems of meanings, social\nidentities, roles, norms, and associated behaviors, traits and\nvirtues, ascribed or prescribed to individuals on the basis of their\nreal or imagined sexual characteristics (Haslanger 2000). It also\nincludes individuals’ subjective identifications with and\norientations to such meanings. Psychological traits are considered\n“masculine” and “feminine” if they dispose\ntheir bearers to comply with the gender norms assigned to men and\nwomen, respectively. From a performative perspective, masculinity and\nfemininity are not fixed traits but contrasting styles of behavior\nthat may be manifested by individuals of any ascribed or subjective\ngender identity in almost any role (West & Zimmerman 1987; Butler\n1990). Finally, “gender symbolism” comprises metaphorical\nascriptions of gendered ideas to animals and inanimate objects.\n\nGendered knowledge. By joining the account of\nsituated knowledge with the account of gender as a social situation,\nwe can generate a catalog of ways in which what people know, or think\nthey know, can be influenced by their own gender (roles, norms,\ntraits, performance, identities), other people’s genders, or by\nideas about gender (symbolism).\n\nThe phenomenology of gendered bodies. People’s bodies are both differently sexed and differently gendered. Early child\nsocialization trains boys’ and girls’ bodies to different\nnorms of bodily comportment. Once internalized, such norms profoundly\naffect the phenomenology of embodiment. They inform men’s and\nwomen’s distinct first-personal knowledge of what it is like to\ninhabit a body, to express capacities unique to one sex or another\n(e.g., breast feeding), and to have experiences that are manifested\nthrough different body parts in differently sexed bodies (e.g.,\norgasm). They also cause men’s and women’s experiences of\ngendered behaviors that both can perform to differ—in fluidity,\nself-consciousness, confidence, awkwardness, shame, and so forth. Some\nfeminist epistemologists argue that dominant models of the world,\nespecially of the relation between minds and bodies, have seemed\ncompelling to mostly male philosophers because they conform to a male\nor masculine phenomenology (Bordo 1987; Young 1990).\n\nGendered first-personal knowledge. It is one thing to\nknow what sexual harassment is in third-personal terms. It is another\nto recognize “I have been sexually harassed.”\nMany women know that women in general are disadvantaged have\ndifficulty recognizing themselves as sharing women’s predicament\n(Clayton & Crosby 1992). The problems of self-knowledge\nare pressing for feminist theory, because it is committed to\ntheorizing in ways that women can use to improve their lives. This\nentails that women be able to recognize their lives in feminist\naccounts of women’s predicament. Feminist epistemology is\ntherefore concerned with investigating the conditions of feminist\nself-understanding and the social settings in which it may arise\n(MacKinnon 1989).\n\nGendered attitudes, interests, and values. A representation\nis androcentric if it depicts the world in relation to male\nor masculine interests, attitudes or values. A “male”\ninterest is an interest a man has, in virtue of the goals given to him\nby social roles designated as appropriate for men to occupy, or in\nvirtue of his subjective gender identity. A “masculine”\ninterest is an interest a man has in virtue of attitudes thought\nappropriate to men. Such attitudes and interests structure the\ncognition of those who have them. For instance, they may influence how\nheterosexual men classify women as, e.g., differently eligible for\nsexual intercourse with them. A representation is gynocentric\nif it depicts the world in relation to female or feminine interests,\nattitudes, or values. An interest, attitude, or value might also be\nsymbolically gendered. For example, the ethics of care represents moral problems in\nterms of symbolically feminine values—values culturally\nassociated with women’s gender roles (Gilligan 1982). It is a\nsymbolically gynocentric perspective, even if men also adopt it.\nFeminist epistemology raises numerous questions about these phenomena.\nCan situated emotional responses to things be a valid source of\nknowledge about them (Jaggar 1989, Keller 1983, Pitts-Taylor 2013)? Do\ndominant practices and conceptions of science reflect an androcentric\nperspective, or a perspective that reflects other dominant positions,\nas of race and colonial rule (Merchant 1980; Harding 1986, 1991, 1993,\n1998, 2006, 2008; Schiebinger 2007)? Do mainstream philosophical\nconceptions of objectivity, knowledge, and reason reflect an\nandrocentric perspective (Bordo 1987; Code 1991; Flax 1983; Rooney\n1991)? How would the conceptual frameworks of particular sciences\nchange if they reflected the interests of women (Anderson 1995b, Rolin\n2009)?\n\nKnowledge of others in gendered relationships. Gender norms\nstructure the social spaces to which people with different gender\nidentities are admitted, as well as the presentation of self to\nothers. Inquirers with different gender identities therefore have\naccess to different information about others. Male and female\nethnographers may be admitted to different social spaces, and have\ndifferent effects on their informants. Research that elicits\ninformation about others through personal contact therefore raises the\nquestion of how findings might be influenced by gendered relations\nbetween researchers and subjects, and whether gender-inclusive\nresearch teams are in a better position to detect this (Bell et al\n1993; Leacock 1981; Sherif 1987).\n\nGendered skills. Some skills are labeled masculine or\nfeminine because men and women need them to perform their respective\ngender roles. To the extent that the skill is perceived by the agent\nor others as proper to someone with a different gender, performance of\nit, or social recognition of success in performance, may be impaired.\nThese phenomena raise various epistemic questions. Does the\n“masculine” symbolism of certain scientific skills, such\nas of assuming an “objective” stance toward nature,\ninterfere with the integration of women into science? Do actually or\nsymbolically “feminine” skills aid the acquisition of\nscientific knowledge (Keller 1983, 1985a; Rose 1987; Ruetsche\n2004)?\n\nGendered cognitive styles. Some theorists believe that men\nand women have different cognitive styles (Belenky et al 1986;\nGilligan 1982). Whether or not this is true, cognitive styles are\ngender symbolized (Rooney 1991). Deductive, analytic, atomistic,\nacontextual, and quantitative cognitive styles are labeled\n“masculine,” while intuitive, synthetic, holistic,\ncontextual and qualitative cognitive styles are labeled\n“feminine.” It is seen as masculine to make one’s\npoint by argument, feminine to make one’s point by narrative.\nArgument is commonly cast as an adversarial mode of discourse, like\nwar, while narrative is viewed as a seductive mode of discourse, like\nlove. These phenomena raise epistemic questions: does the quest for\n“masculine” prestige by using “masculine”\nmethods distort practices of knowledge acquisition (Addelson 1983;\nMoulton, 1983)? Are some kinds of research unfairly ignored because of\ntheir association with “feminine” cognitive styles (Keller\n1983, 1985b)?\n\nGendered background beliefs and worldviews. Representational\nschemes that are functional for different gendered roles and attitudes\nmake different information salient. The resulting differential\nbackground knowledge may lead differently gendered individuals to\ninterpret commonly accessed information differently. A man might read\na woman’s demure smile as a coy come-on, where another woman may\ninterpret it as her polite and defensive reaction to unwanted\nattention. Such differences can spring from differential access to\nempathetic and phenomenological knowledge. These phenomena raise\nepistemological questions. Are there epistemic obstacles to legal\ninstitutions recognizing rape and sexual harassment, insofar as they\nconfine their thinking within a “masculine” perspective\n(MacKinnon 1989)? Do sexist or androcentric background beliefs cause\nscientists to generate sexist theories about women, despite adhering\nto ostensibly objective scientific methods (Harding 1986; Harding\n& O’Barr, 1987)? How might the social practices of science\nbe organized so that variations in background beliefs of inquirers\nfunction as epistemic resources (Longino 1990; Solomon 2001)?\n\nRelations to other inquirers. Gender differences in knowledge\ncan be reduced if differently gendered people participate in inquiry together. Each\ngender can take on testimony what the other can acquire through direct\nexperience. Each may also learn how to exercise imaginative projection more effectively, and to take up the perspective of another gender. However, gender norms influence the terms on which men and\nwomen communicate (Kalbfleisch 1995). In some contexts, women are not\nallowed to speak, or their questions, comments, and challenges are\nignored, interrupted, and systematically distorted, or they\naren’t accepted as experts. Gendered norms of conversation and\nepistemic authority thus influence the ability of knowledge practices\nto incorporate the knowledge of men and women into their processes of\ninquiry. Feminist epistemologists explore how gender norms distort the\ndissemination of testimony and relations of cognitive authority among\ninquirers (Addelson 1983; Code 1991; Fricker 2007) and how the social\nrelations of inquirers could be reformed, especially with regard to\nthe allocation of epistemic authority, so as to enable more successful\npractices of inquiry (Jones 2002; Longino 1990; Nelson 1990,\n1993).\n\nProblems of and Approaches to Gendered Situated\nKnowledge. Mainstream epistemology takes as paradigms of\nknowledge simple propositional knowledge about matters in principle\nequally accessible to anyone with basic cognitive and sensory\napparatus: “2+2=4”; “grass is green”;\n“water quenches thirst.” Feminist epistemology does not\nclaim that such knowledge is gendered. Paying attention to\ngender-situated knowledge enables questions to be addressed that are\ndifficult to frame in epistemologies that assume that gender and other\nsocial situations of the knower are irrelevant to knowledge. Are\ncertain perspectives epistemically privileged? Can a more objective\nperspective be constructed from differently gendered perspectives?\n\n\nFeminist epistemologists have considered situated knowledge within\nthree traditions: standpoint theory, postmodernism, and empiricism.\nThe next three sections explain how these three traditions were\noriginally articulated, while\n section 5\n discussion their interactions and convergence.\n2. Feminist Standpoint Theory\n\nStandpoint Epistemology in General. Standpoint\ntheories claim to represent the world from an epistemically advantaged\nsocially situated perspective. A complete standpoint theory must\nspecify (i) the social location of the advantaged\nperspective, (ii) its scope: the subject matters over which\nit claims advantage, (iii) the aspect of the social location\nthat generates epistemic advantage: for example, social role, or\nsubjective identity; (iv) the ground of its advantage: what\njustifies its claim to superiority; (v) the type of epistemic\nsuperiority it claims: for example, greater accuracy, or greater\nability to represent fundamental truths; (vi) the other\nperspectives relative to which it claims advantage, and (vii)\nmodes of access to that perspective: is occupying the social location\nnecessary or sufficient for getting access to the perspective? Many\nlimited claims to epistemic advantage on behalf of particular\nperspectives are uncontroversial. Auto mechanics are in a better\nposition than auto consumers to know what is wrong with their cars.\nPractical experience in fulfilling the mechanic’s role grounds\nmechanics’ epistemic advantage, which claims superior\nreliability. \n\nStandpoint theories usually claim that the perspectives of\nsubordinated social groups have an epistemic advantage regarding\npolitically contested topics related to their subordination, relative\nto the perspectives of the groups that dominate them.\nClassically, standpoint theory claims that the standpoint of\nthe subordinated is advantaged (1) in revealing fundamental\nsocial regularities; (2) in exposing social arrangements as\ncontingent and susceptible to change through concerted\naction; and (3) in representing the social world in relation to\nuniversal human interests. By contrast, dominant group standpoints\nrepresent only surface social regularities in relation to dominant\ngroup interests, and misrepresent them as necessary, natural,\nor universally advantageous. \n\nMarxist Standpoint Theory. Marxism offers the classic\nmodel of standpoint theory, claiming an epistemic advantage over\nfundamental questions of social science and history, on behalf of the\nstandpoint of the proletariat (Marx 1964, Lukács 1971). Workers\nattain this standpoint by gaining collective consciousness of their\nrole in the capitalist system. In virtue of their oppression, they\nhave an interest in the truth about whose interests capitalism serves.\nIn virtue of their centrality, they have experiential access to the\nfundamental relations of capitalist production. In virtue of their\npractical productive activity, they represent it in terms of use\nvalues (labor values), which are the terms in which the fundamental\nlaws of economics and history are expressed. In virtue of their\nstanding as the agents for the universal class they will become under\ncommunism, they represent the social world in relation to universal\nhuman interests. (Capitalists, by contrast, represent the world\nideologically in superficial (exchange value) and parochial (class\ninterested) terms.) Finally, the collective self-consciousness of the\nworkers involves, like all successful intentional action, a\nself-fulfilling prophecy. Workers’ collective insight into their\ncommon predicament and the need to overcome it through revolutionary\naction generates a self-understanding which, when acted upon, gets\nrealized. The epistemic advantage of the standpoint of the proletariat\nis thus also grounded in the epistemic privilege that autonomous\nagents have over what they are consciously doing.\n\nGrounds of Feminist Standpoint Theory. Feminist\nstandpoint theory claims that the standpoint of women has an epistemic\nadvantage over phenomena in which gender is implicated, relative to\ntheories that make sexist or androcentric assumptions. Variants of\nfeminist standpoint theory ground this epistemic advantage in\ndifferent features of women’s social situation, by analogy with\ndifferent strands of Marxist epistemology.\n\nCentrality. Marxist feminists, such as Hartsock (1987) and\nRose (1987) focus on women’s centrality to the system of\nreproduction—of childrearing and caring for bodies. Because\nwomen tend to the needs of everyone in the household, they are in a\nbetter position than men to see how patriarchy fails to meet\npeople’s needs. Men, in virtue of their dominant position, can\nignore how patriarchy undermines subordinates’ interests.\n\nCollective self-consciousness. MacKinnon (1989) argues that\nmen constitute women as women by sexually objectifying them, i.e., by\nrepresenting their natures as essentially sexually subordinate to men\nand treating them accordingly. Women unmask these ideological\nmisrepresentations by achieving and acting on a shared understanding\nof themselves as women—as a group unjustly constituted by sexual\nobjectification. Through collective feminist actions in which women\nrefuse to act as sexual objects—as in campaigns against sexual\nharassment and rape— women show that representations of women as\nsexual objects are not natural or necessary. Their privileged\nknowledge is collective agent self-knowledge, made true by being put\ninto action in feminist campaigns.\n\nCognitive style. Some early versions of standpoint theory\n(Flax 1983, Hartsock 1987, Rose 1987) accept feminist object relations\ntheory, which explains the development of gender identity in male and\nfemale children raised by female caregivers. Males acquire a masculine\nidentity by distinguishing themselves from their mothers, through\ncontrolling and denigrating the feminine. Females acquire their gender\nidentity through identification with their mothers, blurring\nboundaries between self and other. Males and females thereby acquire\ndistinct cognitive styles. The masculine cognitive style is abstract,\ntheoretical, emotionally detached, atomistic, and oriented toward\ncontrol or domination. The feminine cognitive style is concrete,\npractical, emotionally engaged, relational, and oriented toward care.\nThese cognitive styles are reinforced by the gendered division of\nlabor—men having a near monopoly on positions of political,\neconomic, and military power calling for detachment and control; and\nwomen being assigned to emotional care for others. The feminine\ncognitive style claims epistemic advantage because ways of knowing\nbased on caring for everyone’s needs produce more valuable\nrepresentations than ways of knowing based on domination (Hartsock\n1987). Institutionalizing feminine ways of knowing requires overcoming\nthe division of mental, manual, and caring labor that characterizes\ncapitalist patriarchy (Rose 1987).\n\nOppression. Women have an interest in representing social\nphenomena in ways that reveal their oppression. They also have\npersonal experience of sexist oppression, unlike men, whose power\nenables them to ignore how their actions affect women. If epistemic\nadvantage is grounded in oppression, the multiply oppressed have\nadditional epistemic authority. Thus, Collins (1990) grounds black\nfeminist epistemology in black women’s personal experiences of\nracism and sexism. She uses this epistemology to supply black women\nwith self-representations that enable them to resist demeaning racist\nand sexist images of black women, and to take pride in their\nidentities. The epistemic advantage of the oppressed is sometimes\nfounded on“bifurcated consciousness”: the ability to see\nboth from the perspective of the dominant and from the perspective of\nthe oppressed (Harding 1991, Collins 1990).\n\nAccess to the Feminist Standpoint. Every standpoint\ntheory must explain how one gains access to it. Most standpoint\ntheories represent the epistemically advantaged standpoint not as\ngiven, but as achieved through critical reflection on the power\nstructures constituting group identities. If the group and its\ninterests are defined objectively, the facts that constitute the group\nand its interests are publicly accessible. So anyone can theorize\nphenomena in relation to the interests of that group. However, if\nepistemic advantage lies in collective agent-knowledge, its site lies\nin the group defining itself as a collective agent. The privileged\nstandpoint is not that of women, but of feminists (MacKinnon 1989).\nMen can participate in the feminist movement. But they cannot assume a\ndominant role in defining (hence knowing) its aims, given the feminist\ninterest in overcoming male dominance.\n\nGoals of Feminist Standpoint Theory. Feminist\nstandpoint theory is a type of\n critical theory.\n Critical theories aim to empower the oppressed. To serve this aim,\nsocial theories must (a) represent the world in relation to the\ninterests of the oppressed; (b) enable the oppressed to understand\ntheir problems; and (c) be usable by the oppressed to improve their\ncondition. Claims of superiority for critical theories are thus\nfundamentally based on pragmatic virtues (Harding 1991, Hartsock\n1996).\n\nCriticisms of Feminist Standpoint Theory. Longino\n(1993b) argues that standpoint theory cannot provide a noncircular\nbasis for deciding which standpoints have epistemic privilege. Crenshaw (1999) argues\nthat it is implausible to hold that any group inequality is\ncentral to all the others; they intersect in complex ways. Hence,\nwomen cannot have privileged access to understanding their oppression,\nsince this takes different forms for different women, depending on\ntheir race, sexual orientation, and other identities. This critique\nhas been developed by feminist postmodernists, who question the\npossibility of a unified standpoint of women, and see, behind the\nassertion of a universal woman’s viewpoint, the perspective of\nrelatively privileged white women (Lugones & Spelman 1983).\n3. Feminist Postmodernism\n\nGeneral Postmodernist Themes.\nPostmodernism\n draws inspiration from poststructuralist and postmodernist theorists,\nincluding Derrida, Foucault, Irigaray, Lacan, Lyotard, and Saussure.\nIt questions attempts to transcend situatedness by appeal to such\nideas as universality, necessity, objectivity, essence, and\nfoundations. It stresses the locality, partiality, contingency,\ninstability, uncertainty, ambiguity and essential contestability of\nany particular view of the world and the good. The postmodernist\nemphasis on revealing the situatedness and contestability of any claim\nor system serves both critical and liberatory functions. It\ndelegitimizes ideas that dominate and exclude by undermining their\nclaims to ultimate justification. And it opens up space for imagining\nalternative possibilities that were obscured by those claims.\n\nPostmodernists claim that what we think of as reality is\n“discursively constructed.” According to Saussure,\n“the linguistic sign acts reflexively, not referentially”\nin a “discursive field.” This amounts to radical holism about meaning: signs get their meaning not from their reference to external\nthings but from their relations to all the other signs in the\ndiscourse. Introducing new signs (or discarding old ones) thus changes\nthe meanings of the signs already in use. Signs therefore lack a fixed\nmeaning over time. These ideas support the rejection of what Lyotard\ncalls “totalizing metanarratives.” There can be no\ncomplete, unified theory of the world that captures the whole truth. A\ndiscourse with different terms would contain meanings not available in\nthe discursive field of the theory that claims completeness. The\nassertion of any particular theory is an exercise of\n“power”—to exclude certain possibilities from\nthought and authorize others. Postmodernist claims that objects are\n“discursively constructed” or “socially\nconstructed” assert a kind of nominalism: that the world does\nnot dictate the categories we use to describe it, that innumerable\nincompatible ways of classifying the world are available to us. The\nselection of any one theory is a choice that cannot be justified by\nappeal to “objective” truth or reality.\n\nSocial practices also function as linguistic signs. For example, the\nelevation of the judge’s bench metaphorically signifies the\njudge’s superior authority over others in the courtroom. As\nwords get their meaning from their relations to other words, so do\nactions get their meaning from their relations to other actions,\nrather than from their relation to some pre-linguistic realm of human\nnature or natural law. Thus, the superior authority of judges consists\nin the conventions of deference others manifest toward them. It is not\nunderwritten by an underlying normatively objective authority. The\nlatter thought expresses an essentialist and objectivist power play,\nattempting to foreclose contests over practices by fixing them in a\nsupposedly extra-discursive reality. The meanings of actions can be\nsubverted by other actions that, in changing the context, changes\ntheir meanings. This is why postmodernists celebrate ironic, parodic,\nand campy renditions of conventional behaviors as politically\nliberating (Butler 1993).\n\nThe self is likewise constituted by signs. There is no unified self\nthat underlies the play of a stream of signifiers. Although\nsubjectivity is constituted through the production of signs, the self\nis entangled in a web of meanings not of its own creation: our\nidentities are socially imposed. However, this does not foreclose\nagency, because we occupy multiple social identities (a woman might be\na worker, a mother, lesbian, Mexican, etc.). Tensions among these\nidentities open up spaces for disrupting the discursive systems that\nconstruct us.\n\nFeminist Postmodernism.\n Feminist postmodernist ideas are deployed against theories that\npurport to justify sexist practices—notably, ideologies that\nclaim that observed differences between men and women are natural and\nnecessary, or that women have an essence that explains and justifies\ntheir subordination. The claim that gender is socially or discursively\nconstructed—that it is an effect of social practices and systems\nof meaning that can be disrupted—finds a home in postmodernism\n(Butler 1990). However, postmodernism has figured more prominently in\ninternal critiques of feminist theories. One of the most important\ntrends in feminist thinking has been exposing and responding to\nexclusionary tendencies within feminism itself. Women of color and\nlesbian women have argued that mainstream feminist theories have\nignored their problems and perspectives (Collins 1990; Hull, Scott,\nand Smith, 1982; Lorde 1984).\n\nThe critique of the concept “woman.”\n Feminist postmodernists have criticized many of the leading feminist\ntheories of gender and patriarchy as essentialist (Butler 1990, Flax\n1990, Spelman 1988). Essentialism here refers to any theory that\npostulates a universal, transhistorical, necessary cause or\nconstitution of gender or patriarchy. Feminist postmodernists object\nthat, in claiming that gender identity is one thing or has one cause,\nsuch theories convert discursively constructed facts into norms,\ndifference into deviance. They either exclude women who don’t\nconform to the theory from the class of “women,” or\nrepresent them as inferior. Critiques of feminist theories by lesbian\nwomen and women of color reinforce skepticism about the unity of the\ncategory “woman” by highlighting intersectioning\nidentities of gender, race, class, trans/cis, and sexual orientation. The\nfaultlines for fragmentating the category “woman” are thus\nother identities along which social inequalities are constructed.\n\nThis critique of “woman” as a unified object of\ntheorizing entails that “woman” also cannot constitute a\nunified subject of knowing (Lugones & Spelman 1983). The\ntheories of universal gender identity under attack are ones in which\nthe authors, white middle class heterosexual women, could see\nthemselves. Critics claim that the authors fail to acknowledge their\nown situatedness and hence the ways they are implicated in and\nreproduce power relations—in this case, the presumption of white\nmiddle class heterosexual women to define “the standpoint of\nwomen”—to speak for all other women. Feminist standpoint\ntheorists, who claim an epistemic privilege on behalf of their\nstandpoint, thereby unjustifiably assert a race and class privilege\nover other women. This lesson applies to subaltern feminist\nstandpoints as well. The assertion of a black feminist standpoint, for\nexample, objectionably essentializes black women. Once the\npostmodernist critique of essentialism is granted, there is no logical\nstopping point in the proliferation of perspectives.\n\nPerspective shifting. Feminist postmodernism envisions our\nepistemic situation as characterized by a shifting plurality of\nperspectives, none of which can claim objectivity—that is,\ntranscendence of situatedness. This position rejects both objectivism\nand relativism for the ways they let knowers escape responsibility for\nthe representations they construct (Haraway 1991). People are not\nepistemically trapped inside their cultures, their gender, or any\nother identity. They can think from other perspectives. Thus, although\nwe will always have plural perspectives, their constitution is always\nshifting, without a stable correspondence between individuals and\nperspectives. Negotiating the array of situated knowledges involves\ntwo types of epistemic practice. One is acceptance of responsibility:\nacknowledging the choices of situation involved in constructing\none’s representations (Haraway 1991), and considering how they\naffect the content of one’s representations (Harding 1993). The\nsecond is “world traveling” (Lugones 1987) or\n“mobile positioning”—trying to see things from many\nother perspectives. Mobile positioning can never be transparent or innocent. Imagining oneself in another’s situation is\nrisky, requiring sensitive engagement with and sympathy for occupants\nof those positions. Both transform situated knowing into a critical\nand responsible practice.\n\nCriticisms of Feminist Postmodernism. Both features\nof feminist postmodernism—the rejection of “woman”\nas a category of analysis, and the fragmentation of\nperspectives—are controversial. Wholesale opposition to broad\ngeneralizations about women may preclude critical analysis of\nlarge-scale social forces that affect women (Benhabib 1995). That\nwomen in different social positions experience sexism differently does\nnot entail that they have nothing in common—they still suffer\nfrom sexism (MacKinnon 2000). Intersectionality may be accommodated\nthrough a structural analysis of gender that allows for racialized and\nother particularized modes of sexist oppression (Haslanger 2000).\nPostmodernist fragmentation threatens both the possibility of\nanalytical focus and of politically effective coalition building among\ndiverse women. Yet, virtually all feminists acknowledge that a\nplurality of situated knowledges appears to be an inescapable\nconsequence of social differentiation and embodiment.\n4. Feminist Empiricism\n\nRelations of Feminist Empiricism to Empiricism in\nGeneral. Empiricism is the view that experience provides the\nsole or primary justification for knowledge. Classical empiricists\nheld that the content of experience could be described in fixed,\nbasic, theory-neutral terms—such as in terms of sense-data. Most\nalso supposed that philosophy could provide an external justification\nfor scientific method. Quine revolutionized empiricism by rejecting\nthese ideas. For Quine, observation is theory-laden. It is cast in\nterms of complex concepts not immediately given in experience, which\nare potentially subject to revision in light of further experience\n(Quine 1963). Moreover, epistemology is just another project within\nscience, in which we empirically investigate our practices of inquiry\n(Quine 1969). Many feminist empiricists accept these views while\nrejecting Quine’s sharp division of facts from values, which\nthey regard as inconsistent with naturalized empiricism. Feminist\nempiricists consider how feminist values can legitimately inform\nempirical inquiry, and how scientific methods can be improved in light\nof demonstrations of sex bias in science (Campbell 1998, Clough 2003,\nNelson 1990). Quine also presupposes an individualist account of\ninquiry, while most feminist empiricists advocate a socialized\nepistemology, in which inquiry is treated as a social practice, and\nthe subjects of knowledge may even be communities. \n\nThe Paradoxes of Bias and Social Construction. Two\napparent paradoxes encapsulate the central problematics of feminist\nempiricism. First, much feminist science criticism consists in\nexposing androcentric and sexist biases in scientific research. This\ncriticism seems to rest on the view that bias is epistemically bad.\nYet, advocates of feminist science argue that science would improve if\nit allowed feminist values to inform scientific inquiry. This amounts\nto a recommendation that science adopt certain biases. This is the\nparadox of bias. Second, much feminist science criticism exposes the\ninfluence of social and political factors on science. Scientists\nadvance androcentric and sexist theories because they are influenced\nby sexist values in the wider society. This might suggest adopting an\nindividualist epistemology to eliminate these social biases. Yet most\nfeminists urge that scientific practices should be open to\ndifferent social influences. Call this the paradox of social\nconstruction.\n\nFeminist empiricists dissolve these paradoxes by rejecting their\nunderlying assumptions: that biases, political values, and social\nfactors influence inquiry only by displacing the influence of\nevidence, logic, and other factors that lead to true or empirically\nadequate theories. Not all bias is epistemically bad (Antony 1993).\nThere are three strategies for showing this: pragmatic, procedural,\nand moral realist. The pragmatic strategy stresses the uses to which\nknowledge will be put. Responsible inquiry respects a division of\nlabor between the functions of evidence and social\nvalues—evidence helping inquirers track truths, social values\nhelping inquirers construct representations from those truths that\nserve the practical aims of inquiry (Anderson 1995b). This view may be\njoined with a view of nature as complex. Different ways of classifying\nphenomena will reveal different patterns useful to different practical\ninterests (Longino 2001). The procedural strategy argues that\nepistemically bad biases can be kept in check through an appropriate\nsocial organization of inquiry. A social organization that holds\npeople with different biases accountable to one another will be able\nto weed out bad biases, even if no individual is free of bias (Longino\n1990). This view may be joined with the idea that the subject of\nknowledge (Nelson 1993), epistemic rationality (Solomon 2001) or\nobjectivity (Longino 1990, 2001) is the epistemic community. The moral\nrealist strategy argues that moral, social and political value\njudgments have truth-values, and that feminist values are true.\nInquiry informed by feminist values therefore does not displace\nattention to the evidence, because the evidence vindicates these\nvalues (Campbell 1998).\n\nFeminist empiricists appeal to the pragmatist tradition to undermine\nthe sharp dichotomy between fact and value (Antony 1993, Nelson 1993).\nThey argue that the underdetermination of theory by evidence leads to\na view of facts and values as mutually constituting. Whether any\nparticular feminist, or sexist, theory is true will depend on\nempirical investigation informed by epistemic norms—norms which\nmay be reformed in light of the merits of the theories they generate.\nThis is the project of naturalized epistemology, whereby the\nvindication of norms of inquiry is sought within empirical\ninvestigation.\n\nCriticisms of Feminist Empiricism. Feminist\nempiricists are criticized for naively holding that science will\ncorrect the errors and biases in its theories about women and other\nsubordinated groups by itself, without the aid of feminist values or\ninsights (Harding 1986, 1991). These criticisms apply to what Harding\ncalled “spontaneous feminist empiricism”—the view\nthat elimination of sexist bias, without further modification of\nscientific methods as traditionally understood, is sufficient for\nfeminist critique. However, the naturalized epistemology of most\nfeminist empiricists views knowers as socially situated, empirical\nevidence as theory-laden and critically revisable in light of\ntheoretical and normative reflection, and objective knowledge of human\nphenomena as requiring inclusion of feminist inquirers as equals in\nthe social project of inquiry (Longino 1993a, 1993b). Hundleby (1997),\na standpoint theorist, criticizes feminist empiricism for overlooking\nthe role of feminist political activity,especially the\ndevelopment of oppositional consciousness, as a superior source of\nhypotheses and evidence for challenging sexist and androcentric\ntheories.\n5. Interactions of Feminist Standpoint Theory, Postmodernism, and Empiricism\n\nHarding’s (1986) tripartite classification of feminist\nepistemologies cast them as three contrasting frameworks. In the last\nthirty years, feminist epistemologists have blurred the distinctions\namong these views, as Harding both predicted and promoted (1990, 1991,\n1998). Early theorizing in feminist epistemology tended to explore\nglobal questions about gender and knowledge: are dominant conceptions\nor practices of science, objectivity, and knowledge masculine or\nandrocentric? The field has evolved toward local investigations of the\nways gender affects inquiry in specific investigations by particular\ncommunities using distinct methods. This turn to the local has\nfacilitated the convergence of the three types of feminist\nepistemology.\n\nFeminist standpoint theory.\n The postmodernist critique of standpoint theory, in conjunction with\nthe proliferation of subaltern women’s standpoints (black,\nLatina, lesbian, postcolonial, etc.) has led most standpoint theorists\nto abandon the search for a single feminist standpoint. They\nacknowledge plural standpoints of intersecting marginalized groups\n(Harding 1991, 1998; Collins 1990). Inquiry that draws on their\ninsights and starts from their predicaments is more fruitful than\ninquiry that draws only on the insights and starts from the\npredicaments of relatively privileged groups (Harding 1993, 1998). It\nalso offers pragmatic advantages in enabling us to envision and\nrealize more just social relations (Hartsock 1996). Standpoint\ntheorists (Collins 1996; Harding 1996; Hartsock 1996) have shifted\nfrom claims of general epistemic privilege to claims of practical\nadvantage in response to postmodernist critics such as Hekman (1996).\nWylie (2003) argues that consensus has emerged among feminist\nepistemologists on two points: (1) rejection of essentialism (the idea\nthat the social groups defining any standpoint have a necessary and\nfixed nature, or that their members do or ought to think alike) and\n(2) rejection of attempts to grant automatic epistemic privilege to\nany particular standpoint. Instead, the social situation of\n“insider-outsiders” (members of subordinated groups who\nneed accurate knowledge of the worlds of the privileged to navigate\nthem) sometimes affords a contingent epistemic advantage in\nsolving particular problems. Standpoint theorists’ pluralism\nreflects a productive interaction with feminist postmodernism; their\nshift toward pragmatism and contingent epistemic advantages of the\noppressed reflects convergence with feminist empiricism.\n\nTheorists have devoted effort to specifying the contingent cognitive\nadvantages claimed by a feminist standpoint with sufficient precision\nthat these claims are empirically testable. Solomon (2009) suggests\nthat the achievement of a feminist standpoint involves characteristics\nempirically associated with creative thinking. Ruetsche (2004)\nsuggests that it could involve Aristotelian second-nature capacities\nto recognize certain kinds of evidence—for example, social\ninteractions among primates—relevant for understanding primate\nsocial organization. Other standpoint theorists stress the cognitive\nadvantages of a feminist standpoint for revealing and uncovering\nphenomena in domains of interest to feminists. Rolin (2009) points to\nthe superior capacity of a feminist standpoint to reveal how power\nrelations obscure their operations and effects, and enable inquirers\nto overcome these obstacles to understanding by empowering those\nsubordinated by power relations. Scientists who have investigated the\ncauses of women’s underrepresentation in the sciences from a\nfeminist standpoint have produced more empirically adequate theories,\nusing more normatively adequate conceptions of bias and\ndiscrimination, than nonfeminist researchers (Rolin 2006, Wylie\n2009).\n\nFeminist postmodernism. Haraway (1989) stands out among\nfeminist postmodernists for the tributes she pays to the achievements\nof feminist scientists working within empiricist standards of\nevaluation. Fraser and Nicholson (1990) urge a reformulation of the\nlessons of postmodernism toward pragmatism, fallibilism, and\ncontextualization of knowledge claims—all features compatible\nwith naturalized feminist empiricism.\n\nFeminist empiricism. While early feminist science criticism\nby working scientists may have presupposed a naive version of\nempiricism, feminist empiricists today stress the pervasiveness of\nsituated knowledge, the interplay of facts and values, the absence of\ntranscendent standpoints, and the plurality of theories. These themes\nconverge with postmodernism. After thirty years of development, it is\nalso getting harder to identify points of disagreement between\nfeminist empiricism and feminist standpoint theory. Intemann (2010,\n2016) proposes feminist standpoint empiricism as a synthesis\nof the two theories, arguing that feminist empiricists should accept\nstandpoint theory’s claim that better (i.e., feminist) values\nproduce better theories. Feminist empiricists have already done so, as\nlong as these claims are kept contingent and local (Anderson 2004,\nWylie and Nelson 2007). Some feminist standpoint theorists, however,\nalso claim that exclusion of sexist standpoints, or bad values, can be\nepistemically justified (Intemann 2010, Hicks 2011).\n6. Feminist Science Criticism and Feminist Science\n\nThe history of feminist interventions into most disciplines follows a\ncommon pattern. Feminist science critics begin by criticizing accepted\ndisciplinary methods, assumptions, and theories, exposing their\nandrocentric and sexist biases. As feminist inquiries mature, they\ndevelop constructive projects, and deploy feminist perspectives as\nepistemic resources. This history helps us see how feminist\nepistemology negotiates the tension between the two poles in the\nparadox of bias in feminist empiricism—viewing bias as error,\nand as resource. \n\nFeminist Science Criticism: Bias as Error. Feminist\nscience criticism originated in the critiques that working biologists,\npsychologists, and other scientists made of the androcentric and\nsexist biases and practices in their own disciplines—especially\nof theories about women and gender differences that legitimate sexist\npractices. Exemplary works in this tradition include Bleier (1984),\nHrdy (1981), Leacock (1981), Sherif (1987), and Tavris (1992).\nFeminist science criticism includes several types of research. (1)\nStudies of how the marginalization of women scientists impairs\nscientific progress (e.g., Keller 1983). (2) Studies of how\napplications of science in technology disadvantage women and other\nvulnerable groups and devalue their interests (e.g., Perez 2019). (3)\nStudies of how science has ignored women and gender, and how tending\nto these issues may require revisions of accepted theories (e.g.,\nHays-Gilpin and Whitley (1998). (4) Studies of how biases toward\nworking with “masculine” cognitive styles—for\nexample, toward centralized, hierarchical control models of causation\nas opposed to “feminine” (contextual, interactive,\ndiffused) models—have impaired scientific understanding(e.g.,\nKeller 1985b, Spanier 1995). (5) Studies of how research into sex\ndifferences that reinforces sex stereotypes and sexist practices fails\nto follow standards of good science (Fine 2010, Lloyd 2006, Tavris\n1992). Theories may also manifest gender bias in their conceptual\nframework—for example, in representing subjective gender\nidentification as a dichotomous variable, thereby eliminating other\nmodes of gender identity from consideration (Bem 1993). In these\ncases, gender bias is represented as a cause of error. As philosophers\nand historians of science joined feminist science criticism,\nadditional models of gender bias were developed (Bluhm 2013; Haraway\n1989; Harding 1986, 1991, 1993, 1998; Lloyd 2006; Meynell 2012;\nSchiebinger 1989; Wylie 1996). Some of this work argues that interests\nin technological control that underlie modern science limit its scope\nand what it takes to be significant knowledge (Lacey 1999, Merchant\n1980, Tiles 1987). Feminist science criticism in the bias-as-error\ntradition generates methodological principles for engaging in\nnonsexist science (Eichler 1988).\n\nBias in a research program is shown to be limiting or\npartial, but not erroneous, if it avoids clear error and has\nsome empirical successes, while rival theories in the same domain also\navoid clear error and have different empirical successes or\nother epistemic virtues. Such biases are legitimate: it is rationally\nacceptable to conduct scientific inquiry under their influence. When\nbiases are partial but not erroneous, they serve a generative\nfunction, producing new concepts, methods, and hypotheses that open up\nnew aspects of the world for understanding. They are epistemic\nresources. Feminist philosophers of science argue that we\nhave an epistemic interest in ensuring that certain limiting biases do\nnot dominate research to the exclusion of other generative biases that\nyield rival theories possessing a different range of important\nempirical successes. Exposing androcentric and sexist biases lying\nbehind certain theories makes salient the room for alternative\nprograms not based on such biases.\n\nFeminist Science: Bias as Resource. Most advocates of\nfeminist science argue, in this vein, that scientific\ninquiries informed by feminist values are based on legitimate,\ngenerative limiting biases. This picture of science is pluralistic:\nscience is disunified because the world is rich with a multitude of\ncross-cutting structures, which no single theoretical vocabulary\ncaptures. Different communities have interests in different aspects of\nreality, so leaving them free to follow their interests will reveal\ndifferent patterns and structures in the world (Harding 1998; Longino\n2001).\n\nAgainst this pluralistic view, some advocates of feminist science\ndefine it in terms of adherence to specific ontologies and\nmethodologies expressing a “feminine” cognitive style\n(Duran 1991, Keller 1983, 1985a). On this view, for example, feminist\nscience should have a relational rather than an atomistic ontology,\nfavor the concrete over the abstract, and encompass intuition,\nemotional engagement, and other “feminine” cognitive\nstyles. For example, Stanley and Wise (1983) argue that only\nqualitative methods that accept women’s reports of their\nexperiences in their own terms, refusing to generalize, uphold\nfeminist values of respecting differences among women and avoiding the\nreplication of power differences between researchers and research\nsubjects.\n\nPluralist feminist scientists and philosophers of science contest\nthese attempts to define feminist science in terms of preferred\ncontent and “feminine” method. Many questions of interest\nto feminists are best answered with quantitative methods (Jayaratne\n& Stewart, 1991). Feminists properly make use of diverse methods\n(Harding 1987, Nielsen 1990, Reinharz 1992). Feminist science is not\ndefined by its content, but rather by pragmatic interests in\nuncovering the causes of women’s oppression, revealing dynamics\nof gender in society, and producing knowledge that women can use to\novercome the disadvantages to which they are subject. Forms of\nknowledge that simply valorize the “feminine” may not be\nhelpful to women who would be better off not having norms of\nfemininity imposed on them, and might not be better at generating\nempirical success (Longino 1989).\n\nOn the pluralist view, feminist science amounts to “doing\nscience as a feminist”—using science to answer questions\ngenerated by feminist interests—. There is no presumption that\ncertain methods, evidence, etc. are uniquely available to serve\nfeminist cognitive interests. Nevertheless, some common threads in\ndoing science as a feminist tend to contingently favor certain types\nof representation (Longino 1994). Gender bias may reinforce sexism\nthrough the perpetuation of categorical, dichotomous thinking which\nrepresents masculinity and femininity as “opposites,”\nfemininity as inferiority, and gender nonconformity as deviant. This\ngives feminists an interest in the value of “ontological\nheterogeneity”—using categories that permit the\nobservation of within-group variation, and that resist the\nrepresentation of difference from the group mean as deviance. Gender\nbias also reinforces sexism through single-factor causal models that\nattribute intrinsic powers to men by neglecting their wider context.\nThe value of “complexity of relationship” favors the\ndevelopment of causal models that facilitate the representation of\nfeatures of the social context that support male power. Other feminist\ncognitive values involve the accessibility of knowledge, that\ndiffuses power in being usable to people in subordinate\npositions. Such feminist cognitive values do not displace or compete\nwith tending to evidence, because doing science as a feminist, like\ndoing science with any other interest in mind (for example, medical or\nmilitary interests) involves commitment to the cognitive value of\nproducing empirically adequate theories.\n7. Feminist Defenses of Value-Laden Inquiry\n\nThe Challenge of Value-Neutrality. Against the\nproject of feminist science, many philosophers hold that good science\nis neutral among social, moral, and political values. Lacey (1999)\ndistinguishes the following claims of value-neutrality: (1)\nAutonomy: science progresses best when uninfluenced by\nsocial/political movements and values. (2) Neutrality:\nscientific theories do not imply or presuppose judgments about\nnoncognitive values, nor do scientific theories serve any particular\nnoncognitive values more fully than others. (3) Impartiality:\nThe only grounds for accepting a theory are its relations to the\nevidence. These grounds are impartial among rival noncognitive values.\n\n\nOf these claims, neutrality is the most dubious, because it depicts\nthe grounds for accepting social, political and moral values as\ndetached from evidence about human potentialities and about what\nhappens when people try to realize these values in practice. If this\nwere true, then the defenders of keeping mathematics a male preserve\nwould not have bothered arguing that women were not intellectually\ncapable of doing mathematics—and feminists would not have\nbothered disputing this claim. Neutrality is less a claim about the\ncharacter of science than about the purportedly\n“fact-free” justification of social and political values.\nAs a claim about the latter, it is false (Anderson 2004, Taylor 1985,\nTiles & Oberdiek 1995).\n\nThe core claim of value-neutrality is impartiality. Only facts can\nsupply the warrant for other facts. Autonomy, in turn, is defended as\na means to ensure impartiality. Social movements are thought to\nthreaten impartiality because their influence on science is thought to\nconsist in pressuring scientists to ignore the facts and validate\ntheir worldviews. Defenders of value-neutral science object to the\nidea of feminist science because they view it as threatening autonomy,\nand thereby impartiality.\n\nThe Basic Underdetermination Argument. Feminist\nempiricists reply to this challenge by extending Quine’s\nargument that theory is underdetermined by evidence (Longino 1990,\nNelson 1993). Any body of observations counts as evidence for\nparticular hypotheses only in conjunction with certain background\nassumptions. Vary the background assumptions, and the same\nobservations will support different hypotheses. For example, the\nfailure to observe stellar parallax in the 16th century was taken as\nevidence that the Earth stands still by geocentrists, and as evidence\nthat the stars are very far away by heliocentrists. No logical\nprinciple stops scientists from choosing different background\nassumptions. In practice, scientists face constraints in selecting\nbackground assumptions, based on cognitive values such as simplicity\nand conservatism (resistance to revising assumptions on which many\nother beliefs depend). But with respect to open questions, such\ncognitive values rarely limit the scope for choice down to one option,\nand their interpretation and weights are contestable in any event\n(geocentrism was overturned by overriding conservatism). Feminist\nempiricists conclude that, given the scope for choice in background\nassumptions, no methodological principle forbids scientists from\nselecting their background assumptions on account of their fit with\nsocial and political values. Hence, feminist scientists may select\ntheir background assumptions on account of their fit with feminist\nvalues.\n\nStanding alone, the underdetermination argument does not help us\ndiscriminate error-generating biases from biases that serve as\ncognitive resources. Additional criteria are needed. Anderson (2004)\nargues that the chief danger of value-laden inquiry is wishful\nthinking or dogmatism (Anderson 2004). To avoid this danger, the\nvalue-laden character of the background assumptions linking evidence\nto theories should not foreclose the possibility of discovering that\none’s values are mistaken, because (for example) they are based\non false beliefs about human potentialities or the consequences of\nputting certain values into practice. If women really can’t do\nmath, the values incorporated into feminist science should not close\noff this possibility in advance. Although, in setting out to test this\nsexist hypotheses, women scientists presuppose their own mathematical\ncompetence, this does not preclude their discovering otherwise. To\navoid dogmatism and wishful thinking, they need only make their\ncalculations accountable to public criticism.\n\nThe Basic Pragmatic Strategy. The above reflections\nprovide a standard for determining when socially value-laden inquiry\nhas gone wrong. But how can social values function as an epistemic\nresource? Some feminist epistemologists stress the pragmatic\nfunctions of inquiry (Anderson 1995b). All inquiry begins with a\nquestion. Questions may be motivated by practical interests in\nunderstanding the nature and causes of situations judged to be\nproblematic, and in finding out how to improve those situations. Defenders of the value-neutrality of science acknowledge that pragmatic factors legitimately influence the choice of objects of study. Feminist epistemologists argue that practical interests properly shape the product of inquiry by introducing new dimensions\nof evaluation to theories. We can ask not only whether theories are\nbacked by evidence, but whether they are cast in forms that are\ncognitively accessible to the situated knowers who want to use these\ntheories, whether they help these knowers solve their problems, and\nwhether they answer the questions they were designed to answer. A set\nof statements can be true, yet fail these pragmatic tests. The basic\npragmatic strategy for defending feminist science, and any inquiry\nshaped by social and political values, is to show how the pragmatic\ninterests of that inquiry license or require a particular mode of\ninfluence of values on the process, product, and uptake of the product\nof inquiry, while leaving appropriate room for evidence to play its\nrole in testing hypotheses. Values do not compete with evidence in\ndetermining conclusions, but play different, cooperative roles in\nproperly conducted inquiry (Anderson 1995b, 2004).\n\nTypes of Legitimate Influence of Social Values in\nScience. Feminist philosophers of science stress the variety\nof roles for social and political values in science, and the\ncontingency of their effects (Wylie and Nelson 2007). We must examine\nhow particular values operate in particular scientific investigations\nand judge whether they are closing off the possibility of discovering\nunwelcome facts, leading scientists to reason dogmatically, or\ninsulating their findings from critical scrutiny—or rather\nwhether the values are enabling new discoveries. Feminist\nepistemologists and philosophers of science have defended the\nfollowing types of influence of social values on theory choice.\n\nSelection and weighting of cognitive values. Kuhn (1977)\nargued that scientists need to appeal to cognitive values to take up\nthe slack between theory and evidence. His list of cognitive values\nincludes accuracy, scope, simplicity, fruitfulness, internal\nconsistency, and consistency with other beliefs (conservatism).\nLongino (1994) argues that feminists have reason to prefer theories\nthat manifest other cognitive values, such as diffusion of power.\nDiffusion of power, like simplicity, is not a truth-oriented cognitive\nvalue. Both count as cognitive values because they make theories\ncognitively accessible. Diffusion of power recognizes that cognitive\naccessibility is relative to the situation of the knower. Both\nsimplification and diffusion of power stand in tension with truth, in\nthat theories that embody them not only ignore many complex truths,\nbut may even make false claims. Whether this is bad depends on whether\nthe truths ignored or the inaccuracies allowed are important.\nThis can be judged only relative to the interests that the\ninvestigation ought to serve. All legitimate research programs must\nseek empirical adequacy, which requires that theories account for\nobservations. How much accuracy this requires depends on how much the\nexpected usefulness of the knowledge will be compromised by larger\nrisks or margins of error. The situation and pragmatic interests of\nthe inquirer or of the users of a theory may therefore legitimately\naffect the selection and weighting of cognitive values in theory\nchoice.\n\nStandards of Proof. The argument from inductive risk holds\nthat theories should be accepted or rejected depending on the relative\ncosts of type I error (believing something false) and type II error\n(failing to believe something true). In medicine, clinical trials are\nroutinely stopped and results accepted as genuine notwithstanding\nhigher P-values than the conventional <5%, if the results are\ndramatic enough and the costs to patients of not acting on them are\nhigh enough. Hare-Mustin and Maracek (1994) argue, by parallel\nreasoning, that whether studies that find gender differences, or that\nfail to find them, should be accepted depends on the relative costs of\nAlpha Bias (exaggerating differences) and Beta Bias (neglecting\ndifferences) in the context at hand.\n\nClassification. The ways phenomena are classified may\nlegitimately depend on social values. In medicine, the distinction\nbetween health and disease reflects both causal judgments and ethical\njudgments about human welfare and appropriate ways of dealing with\nproblems. A condition judged bad for human beings is not classified as\na disease unless medical intervention is considered an appropriate and potentially\neffective way to deal with it. Feminist inquiries, too, raise\nquestions about the causes of women’s oppression that require\nclassifying phenomena as instances of rape, sexual objectification,\nsex discrimination, and so forth—classifications tied to their\nmeeting both empirical and evaluative criteria (Anderson 1995a,\n1995b). In general, when inquiry seeks to answer a question about\nvalue-laden phenomena, such as the impact of certain practices on\nhuman welfare, or whether certain institutions are fair or\ndiscriminatory, the contours of the empirical phenomena to be studied\nwill be defined by evaluative judgments (Intemann 2001, 2005).\n\nMethods. The methods selected for investigating phenomena\ndepend on the questions one asks and the kinds of knowledge one seeks,\nboth of which may reflect social interests. Experimental methods in\nsocial science may be good for discovering factors that can be used to\ncontrol people’s behavior in similar settings. But to grasp\ntheir behavior as action—that is, as attempts by agents\nto govern their behavior through their understandings of what they are\ndoing—requires different empirical methods, including\nparticipant observation and qualitative interviews (which allow\nsubjects to delineate their own systems of meaning). Standpoint\ntheories, as critical theories, seek to empower the subjects of study\nby helping them forge liberatory self-understandings. These may\nrequire different methods of inquiry—for example,\nconsciousness-raising (MacKinnon 1989).\n\nCausal Explanations; Models; Explanations of Meaning;\nNarratives. The number of factors that affect the occurrence of\nmost human phenomena is too large to comprehend or test in a single\nmodel. Investigators must therefore select a subset of causal factors\nto include in their models. This selection may be based on fit with\nthe values and interests of the investigator (Longino 1990, 2001).\nThese interests often reflect background social and moral judgments of\nblame, responsibility, and acceptability of change. Conservatives are\nmore likely to study divorce and out-of-wedlock birth as causes of\nwomen’s poverty, whereas feminists are more likely to focus on\nother causes—for example, the exclusion of women from\nbetter-paid jobs, failures of state support for dependent-care work\nwithin the family, the weak bargaining power of women in marriage, and\nnorms of masculinity that lead fathers to avoid significant\nparticipation in child-rearing. These causal explanations are not\nincompatible. Normative interests may also determine whether one\nmodels only main effects or also interaction effects on outcomes\nrelevant to human welfare. A variable—say, a certain lifestyle—that\nhas a positive main effect on a population may have a negative effect\non some subpopulations. Whether one models and tests for such effects\nmay depend on whether one believes that one lifestyle does or should\nfit all, or whether one values pluralism and ontological heterogeneity\n(Anderson 2004).\n\nOften inquirers seek not merely a set of facts, but what the facts\nmean. The meaning or significance of facts depends on their relations\nto other facts. Even if two inquirers agree on the causal facts, they\nmay still disagree about their meaning because they relate the facts\nin different ways, reflecting their background values. Feminists may\nagree with conservatives that divorce is a cause of the feminization\nof poverty, but deny that this means that women are better off\nmarried. They argue that marriage itself, with its gendered division\nof domestic and market labor, constitutes one of the major structural\ndisadvantages women face, setting them up for worse outcomes in the\nevent of divorce. Conservatives, viewing marriage as an indispensable\ncondition of the good life, are no more willing to view marriage in\nthis light than most people would be willing to blame oxygen for the\noccurrence of house fires. It might be thought that scientists should\nstick to the facts and avoid judgments of meaning. But most of the\nquestions we ask demand answers that fit facts into larger, meaningful\npatterns. Scientists therefore cannot help but tell stories, which\nrequire the selection of narrative frameworks that go beyond the facts\n(Haraway 1989). This selection may depend both on their fit with the\nfacts and on their fit with the background values of the\nstoryteller.\n\nFramework Assumptions. As we ascend to higher levels of\nabstraction, general framework assumptions constitute the object of\nstudy. Some of these are disciplinary. Economics studies humans as\nself-interested, instrumentally rational choosers. Social psychology\nstudies humans as responding to socially meaningful situations.\nBehavioral genetics studies human conduct as influenced by their\ngenes. The selection of framework assumptions may depend on their fit\nwith the interests of the inquirer (Longino 1990, Tiles 1987).\nFeminists, being interested in promoting women’s agency, tend to\nprefer frameworks that permit the representation of women as agents.\nThis does not guarantee that empirical findings will confirm the\nbackground assumption that women’s agency is critical to the\nphenomena under investigation. The value-laden selection of framework\nassumptions thus need not lead to a vicious circle of reasoning,\nbecause it is still left up to the evidence to determine how\nsuccessful the assumptions are in explaining the phenomena of\ninterest.\n\nPluralism and naturalized moral epistemology as upshots of\nvalue-laden inquiry. Because inquirers select background\nassumptions in part for their fit with their varied interests and\nvalues, their background assumptions will also vary. Feminist\nepistemologists urge us to embrace this fact (Haraway 1991, Harding\n1998, Longino 2001). Pluralism of theories and research programs\nshould be accepted as a normal feature of science. As long as the\ndifferent research programs are producing empirical successes not\nproduced by the others, and avoiding clear error and viciously\ncircular or dogmatic reasoning, we should treat the value-biases\nanimating them as epistemic resources, helping us discover and\nunderstand new aspects of the world and see them in new perspectives.\nFeminist science takes its place as one set of legitimate research\nprograms among others. This does not imply relativism. Value-laden\nresearch programs are still open to internal and external critique. A\nnaturalized epistemology that rejects neutrality allows that\nobservations may undermine any background assumptions, including value\njudgments (Anderson 2004).\n\nOne way to support this last claim is to advance Quinean holism, and\ninsist that any evidence may bear on any belief or value (Nelson\n1990). While accepting the bi-directional influence of facts and\nvalues, Anderson (2004) rejects holism, arguing that some observations\nbear closer relevance relations than others to specific values.\nFurther progress in understanding legitimate and fruitful interactions\nof facts and values in scientific inquiry will likely involve\nnaturalizing moral epistemology, to get a clearer view of the bearing\nof observations on values. Tobin and Jaggar (2013) offer one way to\nnaturalize feminist moral epistemology.\n8. Feminist Critiques and Conceptions of Objectivity\n\nFeminist Critiques of Objectivity. Feminists regard\nthe following conceptions of objectivity as problematic: (a)\nSubject/object dichotomy: what is really (“objectively”)\nreal exists independently of knowers. (b) Aperspectivity:\n“objective” knowledge is ascertained through “the\nview from nowhere,” a view that transcends or abstracts from our\nparticular locations. (c) Detachment: knowers have an\n“objective” stance toward what is known when they are\nemotionally detached from it. (d) Value-neutrality: knowers have an\n“objective” stance toward what is known when they adopt an\nevaluatively neutral attitude toward it. (e) Control:\n“objective” knowledge of an object (the way it\n“really” is) is attained by controlling it, especially by\nexperimental manipulation, and observing the regularities it manifests\nunder control. (f) External guidance: “objective”\nknowledge consists of representations whose content is dictated by the\nway things really are, not by the knower. These ideas are often\ncombined into a package of claims about science: that its aim is to\nknow the way things are, independent of knowers, and that scientists\nachieve this aim through detachment and control, which enable them to\nachieve aperspectivity and external guidance. This package arose in\nthe 17th-18th centuries, as a philosophical account of why Newtonian\nscience was superior to its predecessor. According to this account,\nthe predecessor science, which represented objects as intrinsically\npossessing secondary qualities and ends, confused the way things are\nin themselves with the ways they are related to emotionally engaged\nhuman knowers, who erroneously projected their own mental states and\nvalue judgments onto things. Adoption of the objective methods listed\nabove enabled the successor scientists to avoid these errors and\nachieve an “absolute” conception of the universe (Williams\n1978). Feminists object to each element in this package as a normative\nideal and as a general description of how science works.\n\nSubject/object dichotomy. If the object of science is to\ngrasp things as they are, independent of knowers, then one must\nsharply distinguish the knower from the known. However, when the\nobjects of inquiry are knowers themselves, this dichotomy rules out\nthe possibility that knowers’ self-understandings help\nconstitute the ways knowers are. It thus rules out the possibility\nthat some of our characteristics are socially constructed. This may\nlead people to make the projective errors objectivity is supposed to\navoid: attributing to the natures of the objects of study what are\nproducts of people’s contingent beliefs and attitudes about\nthose objects (Haslanger 1995).\n\nAperspectivity. The ideal of aperspectivity supposes that if\none views things from no particular position, without any\npresuppositions or biases, then the only thing that guides\nbelief-formation is the object itself (external guidance). Feminists\nquestion the intelligibility of a “view from nowhere,” and\na presuppositionless, bias-free science, for both postmodernist\n(Haraway 1991) and pragmatist (Antony 1993) reasons. Knowers are\nsituated. The underdetermination of theories by evidence implies that\nbiases are needed to get theorizing off the ground. Rather than\nundertake a futile attempt to inquire without biases, we should\nempirically study which biases are fruitful and which mislead, and\nreform scientific practice accordingly (Antony 1993). Some feminist\ncritics also argue that the practice of objectivity—assuming\nthat observed regularities reflect the intrinsic natures of things,\nand treating those things accordingly—when adopted by those in\npower, produces the very regularities taken to vindicate that\nassumption. When male observers use their power to make women behave\nin accordance with their desires (for instance, to elicit female\nsubmission to their aggressive sexual advances), but assume their own\naperspectivity, they misattribute the behavior to women’s\nintrinsic natures (feminine passivity) rather than to their own socially positioned power.  This process constitutes the\n“objectification” of women. It harms women by legitimating\nthe sexist practices that reinforce the projection. It misrepresents\nobserved regularities as necessary, rather than socially contingent,\nas well as their cause (as generated by the intrinsic nature of the\nthings observed, rather than by the observer’s own stance toward\nwhat is observed.) (MacKinnon 1999, Haslanger 1993).\n\nDetachment. The ideal of detachment, according to which\nscientists should adopt an emotionally distanced, controlling stance\ntoward their objects of study, is defended as necessary to avoid\nprojective error. Keller suggests that it is responsible for the\nsymbolically “masculine” standing of science that\nmarginalizes women scientists, who are stereotyped as emotional. It\nreflects an androcentric perspective, serving men’s neurotic\nanxieties about avoiding the “feminine” (Keller 1985a,\nBordo 1987). Emotional distance may also have epistemic defects. A\n“feeling for the [individual] organism” may sensitize a\nscientist to critical data (Keller 1983, Ruetsche 2004).\n\nValue-neutrality. The ideal of objectivity as\nvalue-neutrality is justified as a psychological stance needed to\nguard against temptations toward wishful thinking and dogmatic,\npolitically motivated or ideological reasoning. Feminists argue that\nthis ideal is self-deceptive and unrealistic (Potter 1993; Longino\n1990, 2001; Harding 1991, 1998; Wylie 1996). When scientists represent\nthemselves as neutral, this blocks their recognition of the ways their\nvalues have shaped their inquiry, and thereby evades critical scrutiny\nof these values. Value-neutrality ignores the many positive roles\nvalue judgments play in guiding the process and products of inquiry\nnoted above. Other procedures are available to block wishful thinking\nand political dogmatism on science, without requiring scientists to\nbracket their value judgments (Anderson 1995, 2004, Longino 2001).\n\nControl. Experimental contexts, in which scientists elicit\nregularities in the behavior of the objects of study by manipulating\nthem under controlled conditions, are often taken to generate\nepistemically privileged evidence about the objects of study. Such\nevidence is thought to ground knowledge of how the objects\n“really are,” in contrast with evidence about the objects\nof study generated through “subjective” methods, such as\nparticipant observation, dialogue, political engagement, and caring\nfor their needs. Feminists argue that control is a stance of social,\noften male, power. The epistemic privilege it enjoys reflects both\nandrocentrism and the prestige attached to the “masculine”\n(Merchant 1980). The control ideal underrates the epistemic value of\nexperiences gained from loving or cooperative engagement with the\nobjects of study. Theories produced by control generate only a partial\nview of the potentialities of the objects of study, reflecting and\nserving interests in control over the objects, but not interests in\nengaging with the objects in other ways, or in enabling the objects of\nstudy, if human, to govern themselves (Tiles 1987).\n\nExternal guidance. External guidance assumes that to achieve\nknowledge of the way things “objectively” are, one’s\nbeliefs must be guided by the nature of the object, not by the biases\nof the knower. Feminists argue that the underdetermination of theories\nby evidence entails that theories cannot be purely externally guided.\nInquirers must make numerous choices concerning how to represent the\nobject of knowledge, how to interpret evidence, and how to represent\nthe conclusions drawn (Anderson 2004, Longino 1990, Nelson 1990). The\npretense that sound scientific theories are the products of purely\nexternal guidance obscures the forces shaping these choices and\nabsolves scientists from responsibility for defending them. For\nexample, feminists have paid particular attention to the ways\nmetaphors and narrative genres constrain scientific explanations\n(Haraway 1989, 1991, Martin 1996). The decision to narrate the\ntransition from ape to hominid as a heroic drama dictates a focus on\npresumptively male activities, such as hunting, as the engine of\nevolution, obscuring alternatives equally supported by the data, that\nfocus on presumptively female activity (balancing child care needs\nwith gathering) or on behaviors, such as language use, shared by both\nmales and females (Haraway 1989, Longino 1990).\n\nThese feminist criticisms of different conceptions of objectivity\nshare common themes. The problematic conceptions of objectivity\ngenerate partial accounts of the world, which they\nmisrepresent as complete and universal. The forms of partiality they\nunderwrite are either androcentric, symbolized as\n“masculine,” or serve male or other dominant group\ninterests. They are justified by appealing to models of cognition that\nrepresent error and bias in terms of qualities gender symbolized as\n“feminine” and attributed to women. Such conceptions of\nobjectivity, in recommending avoidance of the “feminine,”\nexclude women from participation in inquiry or deprive them of\nepistemic authority. The problematic conceptions of objectivity ignore\nthe knowledge-enhancing, epistemically fruitful uses of purportedly\n“feminine” approaches to theorizing. In attempting to\ntranscend their situatedness, inquirers following these ideals of\nobjectivity only mask it, commit the projective errors they seek to\navoid, and resist correction.\n\nFeminist Conceptions of Objectivity. Feminist\nconceptions of objectivity tend to be procedural. Products of inquiry\nare more objective, the better they are supported by objective\nprocedures. Some influential feminist conceptions of objectivity\ninclude the following:\n\nFeminist/nonsexist research methods. Some feminists have\noffered methodological guidelines for avoiding the sexist and\nandrocentric errors and biases that feminists have identified in\nmainstream science (Eichler 1988). More ambitiously, feminists have\nsought research methods that embody feminist values (Nielsen 1990,\nReinharz 1992).\n\nEmotional engagement. Some feminist theorists defend the\nepistemic fruitfulness of emotional engagement with the object of\nstudy. Emotions serve epistemic functions in normative inquiry,\nattuning observers to evaluatively relevant features of the world\n(Jaggar 1989, Little 1995, Anderson 2004). In social scientific\ninquiry, emotional engagement with the subjects of study may be\nnecessary both to elicit and interpret behaviors of scientific\ninterest. Ethnographers may need to win the trust of their subjects to\nget them to open up, and to achieve rapport with them to gain\nunderstanding. Keller (1985a) promotes an ideal of “dynamic\nobjectivity,” by which loving attention toward the object\nenhances perception of it. However, Longino (1993b) questions whether\nthis ideal is generally epistemically superior to other modes of\nengagement.\n\nReflexivity. Harding (1993) argues that the objectivity is\nadvanced by reflexivity, which demands that inquirers place themselves\non the same causal plane as the object of knowledge. They must make\nexplicit their situatedness and how that shaped their inquiry.\nReflexivity affirms the partiality of representations without denying\ntheir claim to truth. Inclusion of marginalized groups into inquiry\nimproves reflexivity, because the marginalized are more likely to\nnotice and contest features of accepted representations that reflect\nthe perspectives of the dominant. Harding’s ideal of\n“strong objectivity” includes both reflexivity and\ndemocratic inclusion as key features of more objective processes of\ninquiry.\n\nDemocratic discussion. Longino (1990, 2001) advances a\nconception of objectivity based on democratic discussion. Knowledge\nproduction is a social enterprise, secured through the critical and\ncooperative interactions of inquirers. The products of this social\nenterprise are more objective, the more responsive they are to\ncriticism from all points of view. Feminists build on a tradition\nincluding Mill, Popper, and Feyerabend (Lloyd 1997a) by offering (i) a\nmore articulate conception of “all points of view,”\nstressing the influence of the social positions of inquirers on their\ntheorizing; and (ii) a greater stress on the importance of equality\namong inquirers. In Longino’s account, a community of inquirers\nis objective if it: (1) offers public venues for the criticism of\nknowledge claims; (2) responds to criticisms by changing its theories\naccording to (3) publicly recognized standards of evaluation; and (4)\nfollows a norm of equality of intellectual authority among its\nmembers. The norm of equality has been refined to distinguish\nlegitimate differences of expertise from illegitimate exercises of\nsocial power (Longino 2001).\n\nPluralist Themes in Feminist Conceptions of\nObjectivity. Most feminist conceptions of objectivity\naccommodate both methodological and theoretical pluralism. Different\ncommunities of inquiry take an interest in different aspects of the\nworld, and develop partial theories to satisfy varied epistemic and\npragmatic values. Most feminists resist the thought that these varied\ntheories must eventually be unified into a single grand theory. As\nlong as different communities of inquiry are producing empirical\nsuccesses in accordance with publicly recognized standards, while\nholding themselves accountable to criticism from all sides, their\nproducts may each count as objective, however irreducibly plural the\ncontent of their theories may be (Longino 2001, Harding 1991, 1998).\nHowever, Intemann (2010) questions the value of unlimited pluralism.\nIf sexist and racist values have been found to be unjustified after\nsustained inquiry, then scientific theories informed by these values\nneed not be taken seriously.\n9. Epistemic Authority, Epistemic Injustice, Epistemologies of Ignorance, and Virtue Epistemology\n\nNaturalized epistemology considers the effects of our pervasive\nepistemic interdependence (Nelson 1990). Because inquiry is\ncollaborative and reliant on testimony, what we believe is influenced\nby who we believe. Who we believe depends on attributions of epistemic\nauthority, which rely on views about people’s expertise,\nepistemic responsibility, and trustworthiness. Feminist\nepistemologists explore how gender and other hierarchical social\nrelations influence attributions of epistemic authority, considering\ntheir impact on (1) general models of knowledge; (2) the epistemic\nstanding of knowers; (3) whose claims various epistemic communities do\nand ought to accept; and (4) how this affects the distribution of\nknowledge and ignorance in society. Some of these effects amount to\nepistemic injustice against members of subordinated groups.\nSome feminist epistemologists have advanced conceptions of virtue\nepistemology to remedy epistemic injustice and ignorance.\n\nEpistemic Authority and General Models of Knowledge. Gendered\nideas about epistemic authority can distort our general models of\nknowledge. Code (1991) argues that contemporary analytic\nepistemology’s core model of propositional knowledge implicitly\npresupposes a male knower. The instances of knowledge analytic\nepistemology takes to be paradigmatic when it analyzes the formula\n“S knows that P” are propositions about readily observable\nmind-independent objects. To take these as the paradigmatic instances\nof knowledge invites a model of the knower as masculine, in adopting\nthe symbolically masculine objectivity package described above. This\nimplicitly denies epistemic authority to women. Code argues that\nknowledge of other persons rather than of propositions should be taken\nas a primary model of knowledge. Such second-person knowledge calls\nthe implicit masculinity of knowers into question, since getting to\nknow others typically requires intimacy, dialogue, empathy and other\ncharacteristics gender symbolized as “feminine.”\n\nRecent epistemology’s focus on the indispensability of testimony\nto inquiry has led feminist epistemologists to take Code’s ideas\nin a different direction, by investigating the dependence of\npropositional knowledge on knowledge of persons. For example,\nanthropologists must cultivate personal relationships of trust with\nnative informants to gain access to the natives’ situated\nknowledge of their cultures. This requires reflection on the ways\ndifferences in power, interest, and social situation between\nanthropologists and their informants influence testimony its\ninterpretation. Feminist epistemologists question models of testimony\nas transparent and unidirectional, highlighting testimony’s\ndialogic, strategic, and empathetic features, as well as the\nimportance and difficulty of cultivating epistemically fruitful\nrelations of mutual trust across differences in power (Bergin 2002;\nLugones 1987).\n\nEpistemic Injustice. Other feminist epistemologists focus on\nthe impact of gender and other hierarchical relations on attributions\nof epistemic authority. Dominant groups tend to accord epistemic\nauthority to themselves and withhold it from subordinates by\nconstructing stigmatizing stereotypes of subordinates as incompetent\nor dishonest. They promote, as markers of epistemic authority,\ncharacteristics stereotypically thought to be distinctively theirs\n(Addelson 1983; Shapin 1994). They hoard opportunities for gaining\naccess to these markers—for instance, by denying subordinate\ngroups access to higher education. Such practices commit epistemic\ninjustice against members of subordinate groups, undermining their\nability to participate in collaborative inquiry. Fricker (2007) calls\nthis “testimonial injustice.” In the core case of\ntestimonial injustice, people discount the credibility of what others\nsay on account of prejudice against their social group. Dotson (2011)\ndistinguishes two kinds of testimonial injustice, silencing and\nsmothering. Silencing follows Fricker’s model, whereas\nsmothering is a kind of self-censorship to protect oneself or\none’s group from prejudicial misunderstanding. For example,\nwomen of color victimized by domestic violence might not to testify to\nwhites about this, to avoid reinforcing white prejudice against black\nmen. Hookway (2010) identifies epistemic injustice in practices that\nexclude people from participating in inquiry in non-testimonial ways,\nsuch as asking questions, suggesting hypotheses, raising objections,\nand drawing analogies. When others fail to take such contributions\nseriously out of prejudicial stereotyping of the contributor, this\ninjustice injures the speaker not as a knower but as an inquirer.\n\nHermeneutical injustice occurs when the interpretive\nresources available to a community render a person’s experiences\nunintelligible or misunderstood, due to the epistemic marginalization\nof that person or members of her social group from participation in\npractices of meaning-making (Fricker 2007). An example of\nhermeneutical injustice is the dismissal of women as humorless or\nhypersensitive for getting upset at what was seen as mere cloddish\ncourtship or joking, before the concept of sexual harassment was\navailable to make sense of their experiences. This was an injustice\nbecause the victims of harassment were prejudicially denied effective\naccess to the practices of meaning-making whereby they could have made\ntheir experiences intelligible to others. Mason (2011) argues that\nmarginalized communities may have hermeneutical resources in which\ntheir oppression is understood as such, but still suffer hermeneutical\ninjustice if the dominant community fails to take up these resources\nby according epistemic authority to the marginalized. Pohlhaus (2011)\nargues that such ignorance can be willful, leading to contributory\ninjustice, an intentional maintenance of inadequate hermeneutical\nresources that harmfully obstructs the uptake of resources the\noppressed have developed to make sense of their experience (Dotson\n2012). \n\nEpistemologies of Ignorance. Ignorance, like knowledge, has\nsystematic patterns and social-structural causes (Pohlhaus 2011,\nProctor & Schiebinger 2008, Sullivan & Tuana 2007, Tuana &\nSullivan 2006). Injustice in according people status as knowers and\ninquirers generates systematic ignorance that damages the interests of\nsubordinated groups. Society could have access to, but forget or\nsuppress, knowledge useful to subordinated groups—for example, about\nplants that are effective abortifactants (Schiebinger 2007). Since\naccurate information on such matters is or was available, explanation\nis needed for why it is forgotten. Ignorance is sometimes due to to\nsegregation of situated knowers, preventing knowledge or\nunderstandings held by subordinate groups from disseminating (Margonis\n2007). Members of subordinated groups may have strategic interests in\nhiding knowledge about themselves from dominant groups (Bailey 2007).\nMost importantly, dominant groups have interests in avoiding the truth\nabout their own injustices (Mills 2007).\n\nVirtue epistemology. Some feminist epistemologists advance\nideals of epistemic virtue to address epistemic injustice. Fricker\n(2007) argues that to correct for testimonial injustice, hearers need\nto cultivate the virtue of epistemic justice—a disposition,\nrooted in one’s testimonial sensibility or second-nature\nperception of others’ credibility, to neutralize the effects of\nprejudicial stereotypes on credibility judgments. Jones (2002)\nproposes rules for checking such biases when confronted with\nsurprising testimony. These include undertaking independent\nassessments of the credibility of the witness and the plausibility of\nwhat they say; and letting the presumption against accepting\nastonishing testimony be rebutted when one has good reason to distrust\none’s distrust of the witness. Alcoff (2010) suggests that\ncorrecting for testimonial injustice requires adopting standpoint\nepistemology: one must not merely neutralize prejudice, but accord\nepistemic privilege to the marginalized. Kwong (2015) stresses the\nvirtue of open-mindedness, and Daukas (2011) of trustworthiness, while\nSholock (2012) explores the importance of the dominant being disposed\nto acknowledge their own ignorance of the situated knowledge of the\noppressed, so that they seek the latter’s testimony, and extend\nepistemic authority to them. A key theme of feminist virtue\nepistemology is its aspiration to cultivate dispositions that enable\ninquirers to produce knowledge that can overcome oppression (Daukas\n2018).\n\nSome theorists have questioned suggestions to remedy epistemic\ninjustice with individual virtues. We must share responsibility for\ndevising epistemic practices of resistance to epistemic injustice\n(Medina 2013). A structural conception of remedies does not preclude\nthe use of virtue epistemology to address structural epistemic\ninjustice, as long as epistemic institutions and systems can be\nbearers of epistemic virtue (Anderson 2012).\n10. External Criticisms of Feminist Epistemology\n\nOutside critics of feminist epistemology have argued that the entire\nresearch program is fundamentally flawed. Leading critiques of\nfeminist epistemology include a collection of essays in the\nMonist, 77(4) (1994), Gross and Levitt (1994), Haack (1993),\nand Pinnick, Koertge and Almeder (2003). The most important criticism,\nfound in all these works, is that feminist epistemology corrupts the\nsearch for truth by conflating facts with values and imposing\npolitical constraints on the conclusions it will accept. Truths\ninconvenient to a feminist perspective will be censored, and false\nviews promoted because they support the feminist cause. Critics also\naccuse feminist epistemologists of a corrosive cynicism about science,\nclaiming that they reject it as a raw imposition of patriarchal and\nimperialist power. Feminists are charged with holding that, since\neveryone else is engaged in a cynical power-play, they may as well\njoin the battle and try to impose their beliefs on everyone else.\n\nDefenders of feminist epistemology reply that these criticisms depend\non gross misreadings of the feminist research program. Feminists do\nnot reject objectivity and science, but rather seek to improve it by\ncorrecting sexist and androcentric biases in scientific inquiry, and\nby promoting criticism of research from all points of view (Lloyd\n1995a, 1995b, 1997a, 1997b, Nelson 1990). Nor do they deny that\nscience discovers truths. The complaint is rather that, as dominantly\npracticed, it offers a partial view of the world primarily\noriented to discovering those truths that serve particular human\ninterests in material control and maintaining current social\nhierarchies (Harding 1986, 1998, 1993; Tiles 1987). Feminist\nepistemologists observe that the democratic and egalitarian norms for\ncognitive authority they accept, along with their requirement that the\nscientific community be open and responsive to criticism from all\nquarters, are incompatible with censorship, and with ignoring or\nsuppressing evidence that undermines any theory, including theories\ninspired by feminist values (Longino 1990, 1993a, 2001; Anderson\n2004—see Other Internet Resources). Although facts and values\nare intertwined, attention to values does not displace or compete with\nregard for the evidence (Anderson 1995b).\n\nA second charge outside critics make against feminist epistemology is\nthat it accepts and uncritically valorizes traditional, empirically\nunfounded stereotypes about women’s thinking (as intuitive,\nholistic, emotional, etc.) (Haack 1993). Valorization of\n“feminine” ways of thinking may trap women in traditional\ngender roles and help justify patriarchy (Nanda 2003). Promotion of\nfeminist epistemology may carve out a limited “separate\nsphere” for female inquirers, but one that will turn into an\nintellectual ghetto (Baber 1994).\n\nDefenders of feminist epistemology reply that the critics are\nattacking an obsolete version of feminist epistemology that was only\nbriefly—and even at the time, controversially—entertained\nwhen the field was launched in the 1980s (Wylie 2003, Anderson\n2004—see Other Internet Resources).\n\nFurther development of external critiques of feminist epistemology\nawaits the critics’ engagement with the feminist\nepistemology’s defenders and with current developments in the\nfield.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Addelson, Kathryn, 1983, “The Man of Professional\nWisdom,” in Harding and Hintikka 1983.",
                "Alcoff, Linda, 2001, “On Judging Epistemic Credibility: Is\nSocial Identity Relevant?,” in <em>Engendering\nRationalities</em>, N. Tuana and S. Morgan (eds.), Albany: SUNY\nPress.",
                "–––, 2010, “Epistemic Identities,”\n<em>Episteme</em>, 7: 128–37.",
                "–––, and Elizabeth Potter (eds.) 1993, <em>Feminist\nEpistemologies</em>, New York: Routledge.",
                "Anderson, Elizabeth, 1995a, “Feminist Epistemology: An\nInterpretation and Defense,” <em>Hypatia</em>, 10:\n50–84.",
                "–––, 1995b, “Knowledge, Human Interests,\nand Objectivity in Feminist Epistemology,” <em>Philosophical\nTopics</em>, 23: 27–58.",
                "–––, 2004, “Uses of Value Judgments in\nScience: A General Argument, with Lessons from a Case Study of\nFeminist Research on Divorce,” <em>Hypatia</em>, 19(1):\n1–24.",
                "–––, 2012, “Epistemic Justice as a Virtue\nof Social Institutions,” <em>Social Epistemology</em>, 26(2):\n163–173.",
                "Antony, Louise, 1993, “Quine as Feminist: The Radical Import\nof Naturalized Epistemology,” in Antony and Witt 1993.",
                "Antony, Louise, and Charlotte Witt (eds.), 1993 [2002], <em>A\nMind of One’s Own</em>, Boulder: Westview Press, 1993; 2nd\nedition, 2002.",
                "Baber, Harriet, 1994, “The Market for Feminist\nEpistemology,” <em>Monist</em>, 77(4): 403–423.",
                "Bailey, Alison, 2007, “Strategic Ignorance,” in\nSullivan and Tuana 2007.",
                "Belenky, Mary Field, et al, 1986, <em>Women’s Ways of\nKnowing</em>, New York: Basic Books.",
                "Bem, Sandra, 1993, <em>The Lenses of Gender</em>, New Haven: Yale\nUniversity Press.",
                "Benhabib, Seyla, 1995, “Feminism and Postmodernism,”\nin <em>Feminist Contentions</em>, Benhabib, Seyla, Judith Butler,\nDrucilla Cornell and Nancy Fraser (eds.), New York: Routledge.",
                "Bergin, Lisa, 2002, “Testimony, epistemic difference, and\nprivilege: how feminist epistemology can improve our understanding of\nthe communication of knowledge,” <em>Social Epistemology</em>,\n16: 197–213.",
                "Bleier, Ruth, 1984, <em>Science and Gender: A Critique of Biology\nand its Theories on Women</em>, New York: Pergamon.",
                "Bluhm, Robyn, 2013, “Self-Fulfilling Prophecies: The\nInfluence of Gender Stereotypes on Functional Neuroimaging Research on\nEmotion,” <em>Hypatia</em>, 28(4): 870–886.",
                "Bordo, Susan, 1987, <em>The Flight to Objectivity: Essays on\nCartesianism and Culture</em>, Albany: State University of New York\nPress.",
                "Butler, Judith, 1990, <em>Gender Trouble</em>, New York:\nRoutledge.",
                "–––, 1993, <em>Bodies that Matter</em>, New\nYork: Routledge.",
                "Campbell, Richmond, 1998, <em>Illusions of Paradox</em>, Lanham, Md.:\nRowman &amp; Littlefield.",
                "Clayton, Susan and Faye Crosby, 1992, <em>Justice, Gender, and\nAffirmative Action</em>, Ann Arbor: University of Michigan Press.",
                "Clough, Sharyn, 2003, <em>Beyond Epistemology: A Pragmatist\nApproach to Feminist Science Studies</em>, Lanham, Md.: Rowman &amp;\nLittlefield.",
                "Code, Lorraine, 1991, <em>What Can She Know?</em>, Ithaca, New\nYork: Cornell University Press.",
                "Collins, Patricia Hill, 1990, <em>Black Feminist Thought</em>,\nBoston: Unwin Hyman.",
                "–––, 1996, “Comment on Hekman’s\n‘Truth and Method’: Where’s the Power?,”\n<em>Signs</em>, 22: 375–381.",
                "Crenshaw, Kimberlé, 1989, “Demarginalizing the\nIntersection of Race and Sex,” <em>University of Chicago Legal\nForum</em>, 139–167.",
                "Daukas, Nancy, 2011, “Altogether Now: A Virtue-Theoretic\nApproach to Pluralism in Feminist Epistemology,” in\nGrasswick.",
                "–––, 2018, “Feminist Virtue\nEpistemology,” in <em>The Routledge Handbook of Epistemic\nInjustice</em>, Abingdon: Routledge. ",
                "Dotson, Kristie, 2011, “Tracking Epistemic Violence,\nTracking Practices of Silencing,” <em>Hypatia</em>, 26(2):\n236–257.",
                "–––, 2012, “A Cautionary Tale: On Limiting\nEpistemic Oppression,” <em>Frontiers</em>, 33(1):\n24–47.",
                "Duran, Jane, 1991, <em>Toward a Feminist Epistemology</em>,\nSavage, Md.: Rowman &amp; Littlefield.",
                "Eichler, Margrit, 1988, <em>Nonsexist Research Methods: A\nPractical Guide</em>, Winchester, Mass.: Allen &amp; Unwin.",
                "Fine, Cordelia, 2010, <em>Delusions of Gender: How Our Minds,\nSociety, and Neurosexism Create Difference</em>, New York:\nNorton.",
                "Flax, Jane, 1983, “Political Philosophy and the Patriarchal\nUnconscious,” in Harding and Hintikka 1983.",
                "–––, 1990, “Postmodernism and Gender\nRelations in Feminist Theory,” in Nicholson. ",
                "Fraser, Nancy and Linda Nicholson, 1990, “Social Criticism\nwithout Philosophy,” in Nicholson 1990.",
                "Fricker, Miranda, 2007, <em>Epistemic Injustice</em>, Oxford:\nOxford University Press.",
                "Garry, Ann, and Marilyn Pearsall (eds.) 1989, <em>Women,\nKnowledge, and Reality</em>, Boston: Unwin Hyman.",
                "Gilligan, Carol, 1982, <em>In a Different Voice</em>, Cambridge,\nMass.: Harvard University Press.",
                "Grasswick, Heidi (ed.) 2011, <em>Feminist Epistemology and\nPhilosophy of Science: Power in Knowledge</em>, Dordrecht: Springer",
                "Greaves, Lorraine, Wylie, Alison and the Staff of the Battered\nWomen’s Advocacy Center, 1995, “Women and Violence:\nFeminist Practice and Quantitative Method,” in <em>Changing\nMethods</em>, Sandra Burt and Lorraine Code (eds.), Peterborough,\nOntario: Broadview Press.",
                "Gross, Paul and Levitt, Norman, 1994, <em>Higher Superstition: The\nAcademic Left and its Quarrels with Science</em>, Baltimore: Johns\nHopkins.",
                "Haack, Susan, 1993, “Epistemological Reflections of an Old\nFeminist,” <em>Reason Papers</em>, 18: 31–42. Reprinted as\n“Knowledge and Propaganda,” in Pinnick, Koertge and\nAlmeder, 2003.",
                "Haraway, Donna, 1989, <em>Primate Visions</em>, New York:\nRoutledge.",
                "–––, 1991, “Situated Knowledges,” In\n<em>Simians, Cyborgs, and Women</em>, New York: Routledge.",
                "Harding, Sandra, 1986, <em>The Science Question in Feminism</em>,\nIthaca: Cornell University Press.",
                "––– (ed.), 1987a, <em>Feminism and Methodology:\nSocial Science Issues</em>, Bloomington: Indiana University\nPress.",
                "–––, 1987b, “Is There a Feminist\nMethod?,” in Harding 1987a.",
                "–––, 1991, <em>Whose science? Whose\nknowledge?</em>, Ithaca, N.Y.: Cornell University Press.",
                "–––, 1993, “Rethinking Standpoint\nEpistemology: ‘What is Strong Objectivity?,’” in\nAlcoff and Potter 1993.",
                "–––, 1996, “Comment on Hekman’s\n‘Truth and Method’: Whose Standpoint Needs the Regimes of\nTruth and Reality?,” <em>Signs</em>, 22: 382–391.",
                "–––, 1998, <em>Is Science Multicultural?:\nPostcolonialisms, Feminisms, and Epistemologies</em>, Bloomington,\nInd.: Indiana University Press.",
                "–––, 2008, <em>Sciences from Below: Feminisms,\nPostcolonialities, and Modernities</em>, Durham: Duke University\nPress.",
                "–––, and Merrill Hintikka (eds.), 1983,\n<em>Discovering Reality</em>, Dordrecht: D. Reidel; Boston:\nKluwer.",
                "–––, and Jean O’Barr (eds.), 1987,\n<em>Sex and Scientific Inquiry</em>, Chicago: University of Chicago\nPress.",
                "Hare-Mustin, Rachel and Jeanne Maracek, 1994, “Gender and\nthe Meaning of Difference: Postmodernism and Psychology,” In\n<em>Theorizing Feminism</em>, Anne Herrmann and Abigail Stewart\n(eds.), Boulder, Col.: Westview.",
                "Hartsock, Nancy, 1987, “The Feminist Standpoint: Developing\nthe Ground for a Specifically Feminist Historical Materialism,”\nIn Harding 1987a.",
                "–––, 1996, “Comment on Hekman’s\n‘Truth and Method’: Truth or Justice,”\n<em>Signs</em>, 22: 367–73.",
                "Haslanger, Sally, 1993, “On Being Objective and Being\nObjectified,” in Antony and Witt 1993.",
                "–––, 1995, “Ontology and Social\nConstruction,” <em>Philosophical Topics</em>, 23:\n95–125.",
                "–––, 2000, “Gender and Race: (What) Are\nThey? (What) Do We Want Them To Be?,” <em>Noûs</em>,\n34(1): 31–55.",
                "Hays-Gilpin, Kelley; Whitley, David (eds.), 1998, <em>Reader in\nGender Archaeology</em>, New York: Routledge.",
                "Hekman, Susan, 1996, “Truth and Method: Feminist Standpoint\nTheory Revisited,” <em>Signs</em>, 22: 341–365.",
                "Hicks, Daniel, 2011, “Is Longino’s Conception of\nObjectivity Feminist?,” <em>Hypatia</em>, 26(2):\n333–351.",
                "Hookway, Christopher, 2010, “Some Varieties of Epistemic\nInjustice: Reflections on Fricker,” <em>Episteme</em>, 7:\n151–63.",
                "Hrdy, Sarah, 1981, <em>The Woman that Never Evolved</em>,\nCambridge, Mass.: Harvard University Press.",
                "Hundleby, Catherine, 1997, “Where Standpoint Stands\nNow,” <em>Women and Politics</em>, 18: 25–43.",
                "Hull, Gloria, Patricia Scott, and Barbara Smith (eds.), 1982,\n<em>All the Women Are White, All the Blacks Are Men, But Some of Us\nAre Brave</em>, Old Westbury, N.Y.: Feminist Press.",
                "Intemann, Kristen, 2001, “Science and Values: Are Value\nJudgments Always Irrelevant to the Justification of Scientific\nClaims?,” <em>Philosophy of Science</em>, 68: S506–S518.",
                "–––, 2005, “Feminism, Underdetermination,\nand Values in Science,” <em>Philosophy of Science</em>, 72:\n1001–12.",
                "–––, 2010, “25 Years of Feminist\nEmpiricism and Standpoint Theory: Where Are We Now?,”\n<em>Hypatia</em>, 25(4): 778–796.",
                "–––, 2016, “Feminist Standpoint,”\nin <em>The Oxford Handbook of Feminist Theory</em>, Lisa Disch and Mary\nHawkesworth (eds.), Oxford: Oxford University Press. ",
                "Jaggar, Alison, 1989, “Love and Knowledge: Emotion in\nFeminist Epistemology,” in Garry and Pearsall 1989.",
                "Jayaratne, Toby and Abigail Stewart, 1991, “Quantitative and\nQualitative Methods in the Social Sciences: Current Feminist Issues\nand Practical Strategies,” in <em>Beyond Methodology</em>, Mary\nFonow and Judith Cook (eds.), Bloomington, Ind.: University of\nIndiana Press.",
                "Jones, Karen, 2002, “The Politics of Credibility,” in\nAntony and Witt 2002, 2nd edition.",
                "Keller, Evelyn Fox, 1983, <em>A Feeling for the Organism</em>, San\n\nFrancisco: W.H. Freeman.",
                "–––, 1985a, <em>Reflections on Gender and\n\nScience</em>, New Haven: Yale University Press.",
                "–––, 1985b, “The Force of the Pacemaker\nConcept in Theories of Aggregation in Cellular Slime Mold,” in\nKeller 1985a.",
                "Kalbfleisch, Pamela (ed.), 1995, <em>Gender, Power, and\nCommunication in Human Relationships</em>, Hillsdale, N.J.:\nErlbaum.",
                "Kuhn, Thomas, 1977, “Objectivity, Value Judgment and Theory\nChoice,” In <em>The Essential Tension</em>, Chicago: University\nof Chicago Press.",
                "Kwong, Jack, 2015, “Epistemic Injustice and\nOpen-Mindedness,” <em>Hypatia</em>, 30(2): 337–351.",
                "Lacey, Hugh, 1999, <em>Is Science Value Free?</em>, New York:\nRoutledge.",
                "Leacock, Eleanor Burke, 1981, <em>Myths of Male Dominance</em>,\nNew York: Monthly Review Press.",
                "Little, Margaret, 1995, “Seeing and Caring: the Role of\nAffect in Feminist Moral Epistemology,” <em>Hypatia</em>, 10:\n117–137.",
                "Lloyd, Elisabeth, 1995a, “Feminism as Method: What\nScientists Get that Philosophers Don’t,” <em>Philosophical\nTopics</em>, 23: 189–220.",
                "–––, 1995b, “Objectivity and the Double\nStandard for Feminist Epistemologies,” <em>Synthese</em>, 104:\n351–381.",
                "–––, 1997a, “Feyerabend, Mill, and\nPluralism,” <em>Philosophy of Science</em>, 64:\n396–407.",
                "–––, 1997b, “Science and Anti-Science:\nObjectivity and its Real Enemies,” in Nelson, Lynn and Jack\nNelson (eds.), <em>Feminism, Science, and the Philosophy of\nScience</em>, Dordrecht: Kluwer, 217–259.",
                "–––, 2006, <em>The Case of the Female Orgasm:\nBias in the Science of Evolution</em>, Cambridge, Mass.: Harvard\nUniversity Press.",
                "Longino, Helen, 1989, “Can there Be a Feminist\nScience?,” in Garry and Pearsall 1989.",
                "–––, 1990, <em>Science as Social Knowledge</em>,\nPrinceton, N.J.: Princeton University Press.",
                "–––, 1993a, “Essential\nTensions—Phase Two: Feminist, Philosophical, and Social Studies\nof Science,” in Antony and Witt 1993.",
                "–––, 1993b, “Subjects, Power, and\nKnowledge: Description and Prescription in Feminist Philosophy of\nScience,” in Alcoff and Potter 1993.",
                "–––, 1994, “In Search of Feminist\nEpistemology,” <em>Monist</em>, 77: 472–485.",
                "–––, 2001, <em>The Fate of Knowledge</em>,\nPrinceton: Princeton University Press.",
                "Lorde, Audre, 1984, <em>Sister Outsider</em>, Trumansburg, NY:\nCrossing Press.",
                "Lugones, Maria, 1987, “Playfulness,\n‘World’-Traveling, and Loving Perception,”\n<em>Hypatia</em>, 2: 3–19.",
                "Lugones, Maria, and Elizabeth Spelman, 1983, “Have We Got a\nTheory for You! Feminist Theory, Cultural Imperialism, and the Demand\nfor ‘The Woman’s Voice’?,” <em>Women’s\nStudies International Forum</em>, 6: 573–581.",
                "Lukács, Georg, 1971, “Reification and the\nConsciousness of the Proletariat,” in <em>History and Class\nConsciousness</em>, Rodney Livingstone (trans.), Cambridge, Mass.: MIT\nPress",
                "MacKinnon, Catherine, 1989, <em>Toward a Feminist Theory of the\nState</em>, Cambridge, Mass.: Harvard University Press.",
                "–––, 2000, “Points against\nPostmodernism,” <em>Chicago-Kent Law Review</em>,\n75:687–712. ",
                "Margonis, Frank, 2007, “John Dewey, W.E.B. DuBois, and Alain\nLocke: A Case Study in White Ignorance and Intellectual\nSegregation,” in Sullivan and Tuana.",
                "Martin, Emily, 1996, “The Egg and the Sperm: How Science has\nConstructed a Romance Based on Stereotypical Male-Female Roles,”\nin <em>Feminism and Science</em>, Evelyn Fox Keller and Helen Longino\n(eds.), Oxford: Oxford University Press.",
                "Marx, Karl, 1964, <em>The Eighteenth Brumaire of Louis\nBonaparte</em>, New York: International Publishers.",
                "Mason, Rebecca, 2011, “Two Kinds of Unknowing,”\n<em>Hypatia</em>, 26(2): 294–307.",
                "Medina, José, 2013, <em>The Epistemology of Resistance:\nGender and Racial Oppression, Epistemic Injustice, and Resistant\nImaginations</em>, New York: Oxford University Press.",
                "Merchant, Carolyn, 1980, <em>The Death of Nature: Women, Ecology,\nand the Scientific Revolution</em>, New York: Harper and Row.",
                "Meynell, Lititia, 2012, “Evolutionary Psychology, Ethology,\nand Essentialism (Because What They Don’t Know Can Hurt\nUs),” <em>Hypatia</em>, 27(1): 4–27.",
                "Mills, Charles, 2007, “White Ignorance,” in Sullivan\nand Tuana.",
                "Moulton, Janice, 1983, “A Paradigm of Philosophy: The\nAdversary Method,” in Harding and Hintikka 1983.",
                "Nanda, Meera, 2003, “Modern Science as the Standpoint of the\nOppressed: Dewey Meets the Buddha of India’s Dalits,” in\nPinnick, Koertge and Almeder.",
                "Nelson, Lynn Hankinson, 1990, <em>Who Knows: From Quine to a\nFeminist Empiricism</em>, Philadelphia, Pa.: Temple University\nPress.",
                "–––, 1993, “Epistemological\nCommunities,” in Alcoff and Potter 1993.",
                "Nicholson, Linda (ed.), 1990, <em>Feminism/Postmodernism</em>,\nNew York and London: Routledge.",
                "Nielsen, Joyce (ed.), 1990, <em>Feminist Research Methods</em>,\nBoulder, Col.: Westview.",
                "Perez, Caroline Criado, 2019, <em>Invisible Women: Data Bias in a\nWorld Designed for Men</em>, New York: Abrams.",
                "Pinnick, Cassandra, Noretta Koertge and Robert Almeder (eds.),\n2003, <em>Scrutinizing Feminist Epistemology: An Examination of Gender\nin Science</em>, New Brunswick: Rutgers.",
                "Pitts-Taylor, Victoria, 2013, “I feel your pain: Embodied\nKnowledges and Situated Neurons,” <em>Hypatia</em>, 28(4):\n852–869.",
                "Potter, Elizabeth, 1993, “Gender and Epistemic\nNegotiation,” in Alcoff and Potter 1993.",
                "Pohlhaus, Gaile, 2011, “Relational Knowing and Epistemic\nInjustice: Toward a Theory of Willful Hermeneutical Ignorance,”\n<em>Hypatia</em>, 27(4): 715–735.",
                "–––, 1996, “Loopholes, Gaps, and What is\nHeld Fast: Democratic Epistemology and Claims to Recovered\nMemories,” <em>Philosophy, Psychiatry, and Psychology</em>, 3:\n238–254.",
                "Proctor, Robert and Londa Schiebinger (eds.), 2008,\n<em>Agnotology: The Making and Unmaking of Ignorance</em>, Stanford\nUniversity Press.",
                "Quine, W. V. O., 1963, “Two Dogmas of Empiricism,” in\n<em>From a Logical Point of View</em>, New York: Harper &amp;\nRow.",
                "–––, 1969, “Epistemology\nNaturalized,” in <em>Ontological Relativity and Other\nEssays</em>, New York: Columbia University Press.",
                "Reinharz, Shulamit, 1992, <em>Feminist Methods in Social\nResearch</em>, Oxford: Oxford University Press.",
                "Rolin, Kristina, 2006, “The Bias Paradox in Feminist\nStandpoint Epistemology,” <em>Episteme</em>, 3(1–2):\n125–37.",
                "–––, 2009, “Standpoint Theory as a\nMethodology for the Study of Power Relations,” <em>Hypatia</em>,\n24(4): 218–26.",
                "Rooney, Phyllis, 1991, “Gendered Reason: Sex Metaphor and\nConceptions of Reason,” <em>Hypatia</em>, 6: 77–103.",
                "Rose, Hilary, 1987, “Hand, Brain, and Heart: A Feminist\nEpistemology for the Natural Sciences,” in Harding and\nO’Barr 1987.",
                "Ruetsche, Laura, 2004, “Virtue and Contingent History:\nPossibilities for Feminist Epistemology,” <em>Hypatia</em>,\n19(1): 73–101.",
                "Schiebinger, Londa, 1989, <em>The Mind Has No Sex?</em>,\nCambridge, Mass.: Harvard University Press.",
                "–––, 2007, <em>Plants and Empire: Colonial\nBioprospecting in the Atlantic World</em>, Cambridge, Mass.: Harvard\nUniversity Press.",
                "Shapin, Steven, 1994, <em>A Social History of Truth: Civility and\nScience in Seventeenth-Century England</em>, Chicago: University of\nChicago Press.",
                "Sherif, Carol, 1987, “Bias in Psychology,” in Harding\n1987a.",
                "Sholock, Adale, 2012, “Methodology of the Privileged: White\nAnti-racist Feminism, Systematic Ignorance, and Epistemic\nUncertainty,” <em>Hypatia</em>, 27(4): 701–714.",
                "Solomon, Miriam, 2001, <em>Social Empiricism</em>, Cambridge,\nMass.: MIT Press.",
                "–––, 2009, “Standpoint and\nCreativity,” <em>Hypatia</em>, 24(4): 226–37.",
                "Spanier, Bonnie, 1995, <em>Im/partial Science: Gender Ideology in\nMolecular Biology</em>, Bloomington, Ind.: Indiana University\nPress.",
                "Spelman, Elizabeth, 1988, <em>Inessential Woman</em>, Boston:\nBeacon Press.",
                "Stanley, Liz and Sue Wise, 1983, <em>Breaking Out: Feminist\nConsciousness and Feminist Research</em>, London: Routledge and Kegan\nPaul.",
                "Sullivan, Shannon and Nancy Tuana (eds.), 2007, <em>Race and\nEpistemologies of Ignorance</em>, Albany: SUNY Press.",
                "Tavris, Carol, 1992, <em>The Mismeasure of Women</em>, New York:\nSimon and Schuster.",
                "Taylor, Charles, 1985, “Neutrality in Political\nScience,” in <em>Philosophy and the Human Sciences</em>,\nCambridge: Cambridge University Press.",
                "Tiles, Mary, 1987, “A Science of Mars or of Venus?,”\n<em>Philosophy</em>, 62: 293–306.",
                "Tiles, Mary and Hans Oberdiek, 1995, <em>Living in a Technological\nCulture</em>, London and New York: Routledge.",
                "Tobin, Theresa and Alison Jaggar, 2013, “Naturalizing Moral\nJustification: Rethinking the Mission of Moral Epistemology,”\n<em>Metaphilosophy</em>, 44(4): 409–439.",
                "Tuana, Nancy (ed.), 1989, <em>Feminism and Science</em>,\nBloomington: Indiana University Press.",
                "––– and Shannon Sullivan, 2006,\n“Introduction: Feminist Epistemologies of Ignorance,”\n<em>Hypatia</em>, 21(3): vii–ix.",
                "West, Candace and Don Zimmerman, 1987, “Doing Gender,”\n<em>Gender and Society</em>, 1: 125–51.",
                "Williams, Bernard, 1978, <em>Descartes: the Project of Pure\nEnquiry</em>, Atlantic Highlands, N.J.: Humanities Press.",
                "Wylie, Alison, 1996, “The Constitution of Archaeological\nEvidence: Gender Politics and Science,” in <em>The Disunity of\nScience</em>, P. Galison and D. Stump (eds.), Stanford: Stanford\nUniversity Press.",
                "–––, 2003, “Why Standpoint Matters,”\nin <em>Science and Other Cultures</em>, R. Figueroa and S. Harding\n(eds.), New York: Routledge.",
                "––– and Lynn Hankinson Nelson, 2007,\n“Coming to Terms with the Values of Science: Insights from\nFeminist Science Studies Scholarship,” in <em>Value-Free\nScience? Ideals and Illusion</em>, Harold Kincaid, John Dupré,\nand Alison Wylie (eds.), New York: Oxford University Press.",
                "–––, 2009, “Social Constructionist\nArguments in Harding’s Science and Social Inequality,”\n<em>Hypatia</em>, 23(4): 201–11.",
                "Young, I. M. 1990, <em>Throwing Like a Girl and Other Essays in\nFeminist Political Theory</em>, Bloomington: Indiana University\nPress."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Addelson, Kathryn, 1983, “The Man of Professional\nWisdom,” in Harding and Hintikka 1983.</li>\n<li>Alcoff, Linda, 2001, “On Judging Epistemic Credibility: Is\nSocial Identity Relevant?,” in <em>Engendering\nRationalities</em>, N. Tuana and S. Morgan (eds.), Albany: SUNY\nPress.</li>\n<li>–––, 2010, “Epistemic Identities,”\n<em>Episteme</em>, 7: 128–37.</li>\n<li>–––, and Elizabeth Potter (eds.) 1993, <em>Feminist\nEpistemologies</em>, New York: Routledge.</li>\n<li>Anderson, Elizabeth, 1995a, “Feminist Epistemology: An\nInterpretation and Defense,” <em>Hypatia</em>, 10:\n50–84.</li>\n<li>–––, 1995b, “Knowledge, Human Interests,\nand Objectivity in Feminist Epistemology,” <em>Philosophical\nTopics</em>, 23: 27–58.</li>\n<li>–––, 2004, “Uses of Value Judgments in\nScience: A General Argument, with Lessons from a Case Study of\nFeminist Research on Divorce,” <em>Hypatia</em>, 19(1):\n1–24.</li>\n<li>–––, 2012, “Epistemic Justice as a Virtue\nof Social Institutions,” <em>Social Epistemology</em>, 26(2):\n163–173.</li>\n<li>Antony, Louise, 1993, “Quine as Feminist: The Radical Import\nof Naturalized Epistemology,” in Antony and Witt 1993.</li>\n<li>Antony, Louise, and Charlotte Witt (eds.), 1993 [2002], <em>A\nMind of One’s Own</em>, Boulder: Westview Press, 1993; 2nd\nedition, 2002.</li>\n<li>Baber, Harriet, 1994, “The Market for Feminist\nEpistemology,” <em>Monist</em>, 77(4): 403–423.</li>\n<li>Bailey, Alison, 2007, “Strategic Ignorance,” in\nSullivan and Tuana 2007.</li>\n<li>Belenky, Mary Field, et al, 1986, <em>Women’s Ways of\nKnowing</em>, New York: Basic Books.</li>\n<li>Bem, Sandra, 1993, <em>The Lenses of Gender</em>, New Haven: Yale\nUniversity Press.</li>\n<li>Benhabib, Seyla, 1995, “Feminism and Postmodernism,”\nin <em>Feminist Contentions</em>, Benhabib, Seyla, Judith Butler,\nDrucilla Cornell and Nancy Fraser (eds.), New York: Routledge.</li>\n<li>Bergin, Lisa, 2002, “Testimony, epistemic difference, and\nprivilege: how feminist epistemology can improve our understanding of\nthe communication of knowledge,” <em>Social Epistemology</em>,\n16: 197–213.</li>\n<li>Bleier, Ruth, 1984, <em>Science and Gender: A Critique of Biology\nand its Theories on Women</em>, New York: Pergamon.</li>\n<li>Bluhm, Robyn, 2013, “Self-Fulfilling Prophecies: The\nInfluence of Gender Stereotypes on Functional Neuroimaging Research on\nEmotion,” <em>Hypatia</em>, 28(4): 870–886.</li>\n<li>Bordo, Susan, 1987, <em>The Flight to Objectivity: Essays on\nCartesianism and Culture</em>, Albany: State University of New York\nPress.</li>\n<li>Butler, Judith, 1990, <em>Gender Trouble</em>, New York:\nRoutledge.</li>\n<li>–––, 1993, <em>Bodies that Matter</em>, New\nYork: Routledge.</li>\n<li>Campbell, Richmond, 1998, <em>Illusions of Paradox</em>, Lanham, Md.:\nRowman &amp; Littlefield.</li>\n<li>Clayton, Susan and Faye Crosby, 1992, <em>Justice, Gender, and\nAffirmative Action</em>, Ann Arbor: University of Michigan Press.</li>\n<li>Clough, Sharyn, 2003, <em>Beyond Epistemology: A Pragmatist\nApproach to Feminist Science Studies</em>, Lanham, Md.: Rowman &amp;\nLittlefield.</li>\n<li>Code, Lorraine, 1991, <em>What Can She Know?</em>, Ithaca, New\nYork: Cornell University Press.</li>\n<li>Collins, Patricia Hill, 1990, <em>Black Feminist Thought</em>,\nBoston: Unwin Hyman.</li>\n<li>–––, 1996, “Comment on Hekman’s\n‘Truth and Method’: Where’s the Power?,”\n<em>Signs</em>, 22: 375–381.</li>\n<li>Crenshaw, Kimberlé, 1989, “Demarginalizing the\nIntersection of Race and Sex,” <em>University of Chicago Legal\nForum</em>, 139–167.</li>\n<li>Daukas, Nancy, 2011, “Altogether Now: A Virtue-Theoretic\nApproach to Pluralism in Feminist Epistemology,” in\nGrasswick.</li>\n<li>–––, 2018, “Feminist Virtue\nEpistemology,” in <em>The Routledge Handbook of Epistemic\nInjustice</em>, Abingdon: Routledge. </li>\n<li>Dotson, Kristie, 2011, “Tracking Epistemic Violence,\nTracking Practices of Silencing,” <em>Hypatia</em>, 26(2):\n236–257.</li>\n<li>–––, 2012, “A Cautionary Tale: On Limiting\nEpistemic Oppression,” <em>Frontiers</em>, 33(1):\n24–47.</li>\n<li>Duran, Jane, 1991, <em>Toward a Feminist Epistemology</em>,\nSavage, Md.: Rowman &amp; Littlefield.</li>\n<li>Eichler, Margrit, 1988, <em>Nonsexist Research Methods: A\nPractical Guide</em>, Winchester, Mass.: Allen &amp; Unwin.</li>\n<li>Fine, Cordelia, 2010, <em>Delusions of Gender: How Our Minds,\nSociety, and Neurosexism Create Difference</em>, New York:\nNorton.</li>\n<li>Flax, Jane, 1983, “Political Philosophy and the Patriarchal\nUnconscious,” in Harding and Hintikka 1983.</li>\n<li>–––, 1990, “Postmodernism and Gender\nRelations in Feminist Theory,” in Nicholson. </li>\n<li>Fraser, Nancy and Linda Nicholson, 1990, “Social Criticism\nwithout Philosophy,” in Nicholson 1990.</li>\n<li>Fricker, Miranda, 2007, <em>Epistemic Injustice</em>, Oxford:\nOxford University Press.</li>\n<li>Garry, Ann, and Marilyn Pearsall (eds.) 1989, <em>Women,\nKnowledge, and Reality</em>, Boston: Unwin Hyman.</li>\n<li>Gilligan, Carol, 1982, <em>In a Different Voice</em>, Cambridge,\nMass.: Harvard University Press.</li>\n<li>Grasswick, Heidi (ed.) 2011, <em>Feminist Epistemology and\nPhilosophy of Science: Power in Knowledge</em>, Dordrecht: Springer</li>\n<li>Greaves, Lorraine, Wylie, Alison and the Staff of the Battered\nWomen’s Advocacy Center, 1995, “Women and Violence:\nFeminist Practice and Quantitative Method,” in <em>Changing\nMethods</em>, Sandra Burt and Lorraine Code (eds.), Peterborough,\nOntario: Broadview Press.</li>\n<li>Gross, Paul and Levitt, Norman, 1994, <em>Higher Superstition: The\nAcademic Left and its Quarrels with Science</em>, Baltimore: Johns\nHopkins.</li>\n<li>Haack, Susan, 1993, “Epistemological Reflections of an Old\nFeminist,” <em>Reason Papers</em>, 18: 31–42. Reprinted as\n“Knowledge and Propaganda,” in Pinnick, Koertge and\nAlmeder, 2003.</li>\n<li>Haraway, Donna, 1989, <em>Primate Visions</em>, New York:\nRoutledge.</li>\n<li>–––, 1991, “Situated Knowledges,” In\n<em>Simians, Cyborgs, and Women</em>, New York: Routledge.</li>\n<li>Harding, Sandra, 1986, <em>The Science Question in Feminism</em>,\nIthaca: Cornell University Press.</li>\n<li>––– (ed.), 1987a, <em>Feminism and Methodology:\nSocial Science Issues</em>, Bloomington: Indiana University\nPress.</li>\n<li>–––, 1987b, “Is There a Feminist\nMethod?,” in Harding 1987a.</li>\n<li>–––, 1991, <em>Whose science? Whose\nknowledge?</em>, Ithaca, N.Y.: Cornell University Press.</li>\n<li>–––, 1993, “Rethinking Standpoint\nEpistemology: ‘What is Strong Objectivity?,’” in\nAlcoff and Potter 1993.</li>\n<li>–––, 1996, “Comment on Hekman’s\n‘Truth and Method’: Whose Standpoint Needs the Regimes of\nTruth and Reality?,” <em>Signs</em>, 22: 382–391.</li>\n<li>–––, 1998, <em>Is Science Multicultural?:\nPostcolonialisms, Feminisms, and Epistemologies</em>, Bloomington,\nInd.: Indiana University Press.</li>\n<li>–––, 2008, <em>Sciences from Below: Feminisms,\nPostcolonialities, and Modernities</em>, Durham: Duke University\nPress.</li>\n<li>–––, and Merrill Hintikka (eds.), 1983,\n<em>Discovering Reality</em>, Dordrecht: D. Reidel; Boston:\nKluwer.</li>\n<li>–––, and Jean O’Barr (eds.), 1987,\n<em>Sex and Scientific Inquiry</em>, Chicago: University of Chicago\nPress.</li>\n<li>Hare-Mustin, Rachel and Jeanne Maracek, 1994, “Gender and\nthe Meaning of Difference: Postmodernism and Psychology,” In\n<em>Theorizing Feminism</em>, Anne Herrmann and Abigail Stewart\n(eds.), Boulder, Col.: Westview.</li>\n<li>Hartsock, Nancy, 1987, “The Feminist Standpoint: Developing\nthe Ground for a Specifically Feminist Historical Materialism,”\nIn Harding 1987a.</li>\n<li>–––, 1996, “Comment on Hekman’s\n‘Truth and Method’: Truth or Justice,”\n<em>Signs</em>, 22: 367–73.</li>\n<li>Haslanger, Sally, 1993, “On Being Objective and Being\nObjectified,” in Antony and Witt 1993.</li>\n<li>–––, 1995, “Ontology and Social\nConstruction,” <em>Philosophical Topics</em>, 23:\n95–125.</li>\n<li>–––, 2000, “Gender and Race: (What) Are\nThey? (What) Do We Want Them To Be?,” <em>Noûs</em>,\n34(1): 31–55.</li>\n<li>Hays-Gilpin, Kelley; Whitley, David (eds.), 1998, <em>Reader in\nGender Archaeology</em>, New York: Routledge.</li>\n<li>Hekman, Susan, 1996, “Truth and Method: Feminist Standpoint\nTheory Revisited,” <em>Signs</em>, 22: 341–365.</li>\n<li>Hicks, Daniel, 2011, “Is Longino’s Conception of\nObjectivity Feminist?,” <em>Hypatia</em>, 26(2):\n333–351.</li>\n<li>Hookway, Christopher, 2010, “Some Varieties of Epistemic\nInjustice: Reflections on Fricker,” <em>Episteme</em>, 7:\n151–63.</li>\n<li>Hrdy, Sarah, 1981, <em>The Woman that Never Evolved</em>,\nCambridge, Mass.: Harvard University Press.</li>\n<li>Hundleby, Catherine, 1997, “Where Standpoint Stands\nNow,” <em>Women and Politics</em>, 18: 25–43.</li>\n<li>Hull, Gloria, Patricia Scott, and Barbara Smith (eds.), 1982,\n<em>All the Women Are White, All the Blacks Are Men, But Some of Us\nAre Brave</em>, Old Westbury, N.Y.: Feminist Press.</li>\n<li>Intemann, Kristen, 2001, “Science and Values: Are Value\nJudgments Always Irrelevant to the Justification of Scientific\nClaims?,” <em>Philosophy of Science</em>, 68: S506–S518.</li>\n<li>–––, 2005, “Feminism, Underdetermination,\nand Values in Science,” <em>Philosophy of Science</em>, 72:\n1001–12.</li>\n<li>–––, 2010, “25 Years of Feminist\nEmpiricism and Standpoint Theory: Where Are We Now?,”\n<em>Hypatia</em>, 25(4): 778–796.</li>\n<li>–––, 2016, “Feminist Standpoint,”\nin <em>The Oxford Handbook of Feminist Theory</em>, Lisa Disch and Mary\nHawkesworth (eds.), Oxford: Oxford University Press. </li>\n<li>Jaggar, Alison, 1989, “Love and Knowledge: Emotion in\nFeminist Epistemology,” in Garry and Pearsall 1989.</li>\n<li>Jayaratne, Toby and Abigail Stewart, 1991, “Quantitative and\nQualitative Methods in the Social Sciences: Current Feminist Issues\nand Practical Strategies,” in <em>Beyond Methodology</em>, Mary\nFonow and Judith Cook (eds.), Bloomington, Ind.: University of\nIndiana Press.</li>\n<li>Jones, Karen, 2002, “The Politics of Credibility,” in\nAntony and Witt 2002, 2nd edition.</li>\n<li>Keller, Evelyn Fox, 1983, <em>A Feeling for the Organism</em>, San\n\nFrancisco: W.H. Freeman.</li>\n<li>–––, 1985a, <em>Reflections on Gender and\n\nScience</em>, New Haven: Yale University Press.</li>\n<li>–––, 1985b, “The Force of the Pacemaker\nConcept in Theories of Aggregation in Cellular Slime Mold,” in\nKeller 1985a.</li>\n<li>Kalbfleisch, Pamela (ed.), 1995, <em>Gender, Power, and\nCommunication in Human Relationships</em>, Hillsdale, N.J.:\nErlbaum.</li>\n<li>Kuhn, Thomas, 1977, “Objectivity, Value Judgment and Theory\nChoice,” In <em>The Essential Tension</em>, Chicago: University\nof Chicago Press.</li>\n<li>Kwong, Jack, 2015, “Epistemic Injustice and\nOpen-Mindedness,” <em>Hypatia</em>, 30(2): 337–351.</li>\n<li>Lacey, Hugh, 1999, <em>Is Science Value Free?</em>, New York:\nRoutledge.</li>\n<li>Leacock, Eleanor Burke, 1981, <em>Myths of Male Dominance</em>,\nNew York: Monthly Review Press.</li>\n<li>Little, Margaret, 1995, “Seeing and Caring: the Role of\nAffect in Feminist Moral Epistemology,” <em>Hypatia</em>, 10:\n117–137.</li>\n<li>Lloyd, Elisabeth, 1995a, “Feminism as Method: What\nScientists Get that Philosophers Don’t,” <em>Philosophical\nTopics</em>, 23: 189–220.</li>\n<li>–––, 1995b, “Objectivity and the Double\nStandard for Feminist Epistemologies,” <em>Synthese</em>, 104:\n351–381.</li>\n<li>–––, 1997a, “Feyerabend, Mill, and\nPluralism,” <em>Philosophy of Science</em>, 64:\n396–407.</li>\n<li>–––, 1997b, “Science and Anti-Science:\nObjectivity and its Real Enemies,” in Nelson, Lynn and Jack\nNelson (eds.), <em>Feminism, Science, and the Philosophy of\nScience</em>, Dordrecht: Kluwer, 217–259.</li>\n<li>–––, 2006, <em>The Case of the Female Orgasm:\nBias in the Science of Evolution</em>, Cambridge, Mass.: Harvard\nUniversity Press.</li>\n<li>Longino, Helen, 1989, “Can there Be a Feminist\nScience?,” in Garry and Pearsall 1989.</li>\n<li>–––, 1990, <em>Science as Social Knowledge</em>,\nPrinceton, N.J.: Princeton University Press.</li>\n<li>–––, 1993a, “Essential\nTensions—Phase Two: Feminist, Philosophical, and Social Studies\nof Science,” in Antony and Witt 1993.</li>\n<li>–––, 1993b, “Subjects, Power, and\nKnowledge: Description and Prescription in Feminist Philosophy of\nScience,” in Alcoff and Potter 1993.</li>\n<li>–––, 1994, “In Search of Feminist\nEpistemology,” <em>Monist</em>, 77: 472–485.</li>\n<li>–––, 2001, <em>The Fate of Knowledge</em>,\nPrinceton: Princeton University Press.</li>\n<li>Lorde, Audre, 1984, <em>Sister Outsider</em>, Trumansburg, NY:\nCrossing Press.</li>\n<li>Lugones, Maria, 1987, “Playfulness,\n‘World’-Traveling, and Loving Perception,”\n<em>Hypatia</em>, 2: 3–19.</li>\n<li>Lugones, Maria, and Elizabeth Spelman, 1983, “Have We Got a\nTheory for You! Feminist Theory, Cultural Imperialism, and the Demand\nfor ‘The Woman’s Voice’?,” <em>Women’s\nStudies International Forum</em>, 6: 573–581.</li>\n<li>Lukács, Georg, 1971, “Reification and the\nConsciousness of the Proletariat,” in <em>History and Class\nConsciousness</em>, Rodney Livingstone (trans.), Cambridge, Mass.: MIT\nPress</li>\n<li>MacKinnon, Catherine, 1989, <em>Toward a Feminist Theory of the\nState</em>, Cambridge, Mass.: Harvard University Press.</li>\n<li>–––, 2000, “Points against\nPostmodernism,” <em>Chicago-Kent Law Review</em>,\n75:687–712. </li>\n<li>Margonis, Frank, 2007, “John Dewey, W.E.B. DuBois, and Alain\nLocke: A Case Study in White Ignorance and Intellectual\nSegregation,” in Sullivan and Tuana.</li>\n<li>Martin, Emily, 1996, “The Egg and the Sperm: How Science has\nConstructed a Romance Based on Stereotypical Male-Female Roles,”\nin <em>Feminism and Science</em>, Evelyn Fox Keller and Helen Longino\n(eds.), Oxford: Oxford University Press.</li>\n<li>Marx, Karl, 1964, <em>The Eighteenth Brumaire of Louis\nBonaparte</em>, New York: International Publishers.</li>\n<li>Mason, Rebecca, 2011, “Two Kinds of Unknowing,”\n<em>Hypatia</em>, 26(2): 294–307.</li>\n<li>Medina, José, 2013, <em>The Epistemology of Resistance:\nGender and Racial Oppression, Epistemic Injustice, and Resistant\nImaginations</em>, New York: Oxford University Press.</li>\n<li>Merchant, Carolyn, 1980, <em>The Death of Nature: Women, Ecology,\nand the Scientific Revolution</em>, New York: Harper and Row.</li>\n<li>Meynell, Lititia, 2012, “Evolutionary Psychology, Ethology,\nand Essentialism (Because What They Don’t Know Can Hurt\nUs),” <em>Hypatia</em>, 27(1): 4–27.</li>\n<li>Mills, Charles, 2007, “White Ignorance,” in Sullivan\nand Tuana.</li>\n<li>Moulton, Janice, 1983, “A Paradigm of Philosophy: The\nAdversary Method,” in Harding and Hintikka 1983.</li>\n<li>Nanda, Meera, 2003, “Modern Science as the Standpoint of the\nOppressed: Dewey Meets the Buddha of India’s Dalits,” in\nPinnick, Koertge and Almeder.</li>\n<li>Nelson, Lynn Hankinson, 1990, <em>Who Knows: From Quine to a\nFeminist Empiricism</em>, Philadelphia, Pa.: Temple University\nPress.</li>\n<li>–––, 1993, “Epistemological\nCommunities,” in Alcoff and Potter 1993.</li>\n<li>Nicholson, Linda (ed.), 1990, <em>Feminism/Postmodernism</em>,\nNew York and London: Routledge.</li>\n<li>Nielsen, Joyce (ed.), 1990, <em>Feminist Research Methods</em>,\nBoulder, Col.: Westview.</li>\n<li>Perez, Caroline Criado, 2019, <em>Invisible Women: Data Bias in a\nWorld Designed for Men</em>, New York: Abrams.</li>\n<li>Pinnick, Cassandra, Noretta Koertge and Robert Almeder (eds.),\n2003, <em>Scrutinizing Feminist Epistemology: An Examination of Gender\nin Science</em>, New Brunswick: Rutgers.</li>\n<li>Pitts-Taylor, Victoria, 2013, “I feel your pain: Embodied\nKnowledges and Situated Neurons,” <em>Hypatia</em>, 28(4):\n852–869.</li>\n<li>Potter, Elizabeth, 1993, “Gender and Epistemic\nNegotiation,” in Alcoff and Potter 1993.</li>\n<li>Pohlhaus, Gaile, 2011, “Relational Knowing and Epistemic\nInjustice: Toward a Theory of Willful Hermeneutical Ignorance,”\n<em>Hypatia</em>, 27(4): 715–735.</li>\n<li>–––, 1996, “Loopholes, Gaps, and What is\nHeld Fast: Democratic Epistemology and Claims to Recovered\nMemories,” <em>Philosophy, Psychiatry, and Psychology</em>, 3:\n238–254.</li>\n<li>Proctor, Robert and Londa Schiebinger (eds.), 2008,\n<em>Agnotology: The Making and Unmaking of Ignorance</em>, Stanford\nUniversity Press.</li>\n<li>Quine, W. V. O., 1963, “Two Dogmas of Empiricism,” in\n<em>From a Logical Point of View</em>, New York: Harper &amp;\nRow.</li>\n<li>–––, 1969, “Epistemology\nNaturalized,” in <em>Ontological Relativity and Other\nEssays</em>, New York: Columbia University Press.</li>\n<li>Reinharz, Shulamit, 1992, <em>Feminist Methods in Social\nResearch</em>, Oxford: Oxford University Press.</li>\n<li>Rolin, Kristina, 2006, “The Bias Paradox in Feminist\nStandpoint Epistemology,” <em>Episteme</em>, 3(1–2):\n125–37.</li>\n<li>–––, 2009, “Standpoint Theory as a\nMethodology for the Study of Power Relations,” <em>Hypatia</em>,\n24(4): 218–26.</li>\n<li>Rooney, Phyllis, 1991, “Gendered Reason: Sex Metaphor and\nConceptions of Reason,” <em>Hypatia</em>, 6: 77–103.</li>\n<li>Rose, Hilary, 1987, “Hand, Brain, and Heart: A Feminist\nEpistemology for the Natural Sciences,” in Harding and\nO’Barr 1987.</li>\n<li>Ruetsche, Laura, 2004, “Virtue and Contingent History:\nPossibilities for Feminist Epistemology,” <em>Hypatia</em>,\n19(1): 73–101.</li>\n<li>Schiebinger, Londa, 1989, <em>The Mind Has No Sex?</em>,\nCambridge, Mass.: Harvard University Press.</li>\n<li>–––, 2007, <em>Plants and Empire: Colonial\nBioprospecting in the Atlantic World</em>, Cambridge, Mass.: Harvard\nUniversity Press.</li>\n<li>Shapin, Steven, 1994, <em>A Social History of Truth: Civility and\nScience in Seventeenth-Century England</em>, Chicago: University of\nChicago Press.</li>\n<li>Sherif, Carol, 1987, “Bias in Psychology,” in Harding\n1987a.</li>\n<li>Sholock, Adale, 2012, “Methodology of the Privileged: White\nAnti-racist Feminism, Systematic Ignorance, and Epistemic\nUncertainty,” <em>Hypatia</em>, 27(4): 701–714.</li>\n<li>Solomon, Miriam, 2001, <em>Social Empiricism</em>, Cambridge,\nMass.: MIT Press.</li>\n<li>–––, 2009, “Standpoint and\nCreativity,” <em>Hypatia</em>, 24(4): 226–37.</li>\n<li>Spanier, Bonnie, 1995, <em>Im/partial Science: Gender Ideology in\nMolecular Biology</em>, Bloomington, Ind.: Indiana University\nPress.</li>\n<li>Spelman, Elizabeth, 1988, <em>Inessential Woman</em>, Boston:\nBeacon Press.</li>\n<li>Stanley, Liz and Sue Wise, 1983, <em>Breaking Out: Feminist\nConsciousness and Feminist Research</em>, London: Routledge and Kegan\nPaul.</li>\n<li>Sullivan, Shannon and Nancy Tuana (eds.), 2007, <em>Race and\nEpistemologies of Ignorance</em>, Albany: SUNY Press.</li>\n<li>Tavris, Carol, 1992, <em>The Mismeasure of Women</em>, New York:\nSimon and Schuster.</li>\n<li>Taylor, Charles, 1985, “Neutrality in Political\nScience,” in <em>Philosophy and the Human Sciences</em>,\nCambridge: Cambridge University Press.</li>\n<li>Tiles, Mary, 1987, “A Science of Mars or of Venus?,”\n<em>Philosophy</em>, 62: 293–306.</li>\n<li>Tiles, Mary and Hans Oberdiek, 1995, <em>Living in a Technological\nCulture</em>, London and New York: Routledge.</li>\n<li>Tobin, Theresa and Alison Jaggar, 2013, “Naturalizing Moral\nJustification: Rethinking the Mission of Moral Epistemology,”\n<em>Metaphilosophy</em>, 44(4): 409–439.</li>\n<li>Tuana, Nancy (ed.), 1989, <em>Feminism and Science</em>,\nBloomington: Indiana University Press.</li>\n<li>––– and Shannon Sullivan, 2006,\n“Introduction: Feminist Epistemologies of Ignorance,”\n<em>Hypatia</em>, 21(3): vii–ix.</li>\n<li>West, Candace and Don Zimmerman, 1987, “Doing Gender,”\n<em>Gender and Society</em>, 1: 125–51.</li>\n<li>Williams, Bernard, 1978, <em>Descartes: the Project of Pure\nEnquiry</em>, Atlantic Highlands, N.J.: Humanities Press.</li>\n<li>Wylie, Alison, 1996, “The Constitution of Archaeological\nEvidence: Gender Politics and Science,” in <em>The Disunity of\nScience</em>, P. Galison and D. Stump (eds.), Stanford: Stanford\nUniversity Press.</li>\n<li>–––, 2003, “Why Standpoint Matters,”\nin <em>Science and Other Cultures</em>, R. Figueroa and S. Harding\n(eds.), New York: Routledge.</li>\n<li>––– and Lynn Hankinson Nelson, 2007,\n“Coming to Terms with the Values of Science: Insights from\nFeminist Science Studies Scholarship,” in <em>Value-Free\nScience? Ideals and Illusion</em>, Harold Kincaid, John Dupré,\nand Alison Wylie (eds.), New York: Oxford University Press.</li>\n<li>–––, 2009, “Social Constructionist\nArguments in Harding’s Science and Social Inequality,”\n<em>Hypatia</em>, 23(4): 201–11.</li>\n<li>Young, I. M. 1990, <em>Throwing Like a Girl and Other Essays in\nFeminist Political Theory</em>, Bloomington: Indiana University\nPress.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "epistemology: social",
            "epistemology: virtue",
            "feminist philosophy, interventions: ethics",
            "feminist philosophy, interventions: philosophy of biology",
            "feminist philosophy, interventions: social epistemology",
            "feminist philosophy, topics: perspectives on science",
            "moral epistemology",
            "postmodernism",
            "scientific knowledge: social dimensions of",
            "testimony: epistemological problems of"
        ],
        "entry_link": [
            {
                "../epistemology-social/": "epistemology: social"
            },
            {
                "../epistemology-virtue/": "epistemology: virtue"
            },
            {
                "../feminism-ethics/": "feminist philosophy, interventions: ethics"
            },
            {
                "../feminist-philosophy-biology/": "feminist philosophy, interventions: philosophy of biology"
            },
            {
                "../feminist-social-epistemology/": "feminist philosophy, interventions: social epistemology"
            },
            {
                "../feminist-science/": "feminist philosophy, topics: perspectives on science"
            },
            {
                "../moral-epistemology/": "moral epistemology"
            },
            {
                "../postmodernism/": "postmodernism"
            },
            {
                "../scientific-knowledge-social/": "scientific knowledge: social dimensions of"
            },
            {
                "../testimony-episprob/": "testimony: epistemological problems of"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminism-epistemology\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/feminism-epistemology/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=feminism-epistemology&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/feminism-epistemology/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminism-epistemology": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/feminism-epistemology/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=feminism-epistemology&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/feminism-epistemology/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Anderson, Elizabeth, 2004,\n “<a href=\"http://www-personal.umich.edu/%7Eeandersn/hownotreview.html\" target=\"other\">How Not to Criticize Feminist Epistemology: a Review of Pinnick, Koertge and Almeder, <em>Scrutinizing Feminist Epistemology</em></a>”.",
            "Janack, Marianne, 2004,\n “<a href=\"http://www.iep.utm.edu/fem-epis/\" target=\"other\">Feminist Epistemology,</a>”\n <em>Internet Encyclopedia of Philosophy</em>.",
            "<a href=\"http://femmss.org/\" target=\"other\">FEMMSS: Feminist Epistemologies, Methodologies, Metaphysics and Science Studies</a>",
            "<a href=\"http://sgrp.typepad.com/\" target=\"other\">Gender, Race, and Philosophy: The Blog</a>\n (includes symposia on recent work in the philosophy of race and\ngender)",
            "<a href=\"http://futures.commons.gc.cuny.edu/2015/01/26/gender-bias-in-academe-an-annotated-bibliography-of-important-recent-studie/\" target=\"other\">Gender Bias in Academe: An Annotated Bibliography of Important Recent Studies</a>"
        ],
        "listed_links": [
            {
                "http://www-personal.umich.edu/%7Eeandersn/hownotreview.html": "How Not to Criticize Feminist Epistemology: a Review of Pinnick, Koertge and Almeder, Scrutinizing Feminist Epistemology"
            },
            {
                "http://www.iep.utm.edu/fem-epis/": "Feminist Epistemology,"
            },
            {
                "http://femmss.org/": "FEMMSS: Feminist Epistemologies, Methodologies, Metaphysics and Science Studies"
            },
            {
                "http://sgrp.typepad.com/": "Gender, Race, and Philosophy: The Blog"
            },
            {
                "http://futures.commons.gc.cuny.edu/2015/01/26/gender-bias-in-academe-an-annotated-bibliography-of-important-recent-studie/": "Gender Bias in Academe: An Annotated Bibliography of Important Recent Studies"
            }
        ]
    }
}