{
    "url": "fiction",
    "title": "Fiction",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Fred Kroon\n<f.kroon@auckland.ac.nz>\nAlberto Voltolini\n<alberto.voltolini@unito.it>",
        "author_links": [
            {
                "http://artsfaculty.auckland.ac.nz/staff/?UPI=fkro002": "Fred Kroon"
            },
            {
                "mailto:f%2ekroon%40auckland%2eac%2enz": "f.kroon@auckland.ac.nz"
            },
            {
                "http://www.lettere.unito.it/do/docenti.pl/Show?_id=avoltoli": "Alberto Voltolini"
            },
            {
                "mailto:alberto%2evoltolini%40unito%2eit": "alberto.voltolini@unito.it"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\n<a href=\"http://artsfaculty.auckland.ac.nz/staff/?UPI=fkro002\" target=\"other\">Fred Kroon</a>\n&lt;<a href=\"mailto:f%2ekroon%40auckland%2eac%2enz\"><em>f<abbr title=\" dot \">.</abbr>kroon<abbr title=\" at \">@</abbr>auckland<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>nz</em></a>&gt;<br/>\n<a href=\"http://www.lettere.unito.it/do/docenti.pl/Show?_id=avoltoli\" target=\"other\">Alberto Voltolini</a>\n&lt;<a href=\"mailto:alberto%2evoltolini%40unito%2eit\"><em>alberto<abbr title=\" dot \">.</abbr>voltolini<abbr title=\" at \">@</abbr>unito<abbr title=\" dot \">.</abbr>it</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Nov 12, 2019"
    ],
    "preamble": "\n\n\nTelling fictional stories and engaging with the fictional stories of\nothers is an important and pervasive part of human culture. But people\nnot only tell and engage with fictional stories. They also reflect on\nthe content of stories, and on the way these are told. Grappling with\nthe many issues such reflection uncovers has long been a concern of\nprofessional academics in language departments and other academic\nprograms with a focus on language. Philosophers should be included on\nthis list. The concept of fiction gives rise to a number of intriguing\nand complex philosophical issues, and the philosophy of fiction has\nnow become an acknowledged part of mainstream philosophy, with a\nhistory that goes back at least to the early debates about the role of\npoets and dramatists found in the works of Aristotle and Plato. The\nissues in question broadly relate to fiction as a mode of\nrepresentation—a way of describing individuals and\nevents—that is strikingly different from representation\nconcerned with truth, the latter long a dominant theme in philosophy.\nNot only is faithfulness to truth in the ordinary sense not a\nrequirement in fiction; fiction may even depart from truth in the\nthings it talks about, which typically include nonexistent\nindividuals and even members of nonexistent kinds (Holmes and hobbits,\nfor example)—see the entry on \n fictional entities.\n\n\n\nThere are also more indirect reasons for taking fiction seriously as a\nphilosophical topic. The last few decades have seen a surge of\ninterest in interpreting prominent yet (arguably) philosophically\nproblematic areas of enquiry—areas as far apart as mathematics\nand morality—as involving something akin to fiction, a position\nknown as fictionalism about those areas. On such views, we should not\nbelieve the central claims of the area because of their commitment to\nentities like numbers and objective moral facts; instead we should\ntreat them the way we treat a distinctively fictional claim like\n“Sherlock Holmes was a brilliant detective”: something we\nknow not to be literally true (after all, there never was a Sherlock\nHolmes) but accept as true in some derivative or at least nonliteral\nsense (unlike “Holmes was a plodding policeman”, say). The\ncontinuing rise of fictionalism presents us with a new reason for\ntreating fiction as a significant philosophical topic, since it is a\nposition that is difficult to motivate independently of an\nunderstanding of what is distinctive about fiction (Armour-Garb and\nWoodbridge 2015). (For more on fictionalism and its ties to fiction,\nsee the entry on\n fictionalism.)\n\n\nOne fundamental question raised by the notion of fiction is a\nconceptual one: What makes something a work of fiction as opposed to a\nwork of non-fiction? A first attempt at saying what fiction is might\nportray it as a kind of writing whose product is a written text (a\nwork of fiction) that misrepresents how the world actually is,\nalthough not in order to deceive intended readers. This opposes it to\nnon-fiction; even if a work of non-fiction misrepresents the world, it\nis not intended by its author to be recognized as something that\nmisrepresents the world. \n\n\nIt doesn’t take much to see that this rough characterization is\nin fact far too rough. A work of fiction needn’t be a written\ntext, but could be a picture (or series of pictures) or a\nrepresentation in some other medium like film. And the\ncharacterization lets in too much: a newspaper article attacking some\npolitical position by engaging in the relentless use of irony, say, is\nnot a work of fiction but a work of non-fiction that uses irony.\n\n\nThe problem of saying how fiction differs from non-fiction is just one\nof the hard problems faced by the philosophical study of fiction.\nAnother problem is that of specifying the sense in which a fictional\nsentence can be true despite misdescribing how matters stand in the\nworld. (A sentence like “Sherlock Holmes was a brilliant\ndetective”, for example, is not true if it is construed as a\nclaim about brilliant detectives our world has known, but counts as\ntrue if it is stated as an answer to a quiz question “Who was\nSherlock Holmes?” By contrast, “Sherlock Holmes was a\nplodding policeman” would count as false in this context.) But\nin what sense can the sentence be true, given that the world does not\ncontain any such person as Sherlock Holmes?  One promising thought is\nthat when we hear the sentence as genuinely true we regard it as\nelliptical for something like “In the Holmes stories,\nSherlock Holmes was a brilliant detective”. On this suggestion it\nis the truth of the latter prefixed sentence that provides the sense\nin which “Sherlock Holmes was a brilliant detective”\ncounts as true.  But even if this is right, what still needs\nexplaining is what it is for such a prefixed sentence to be true.\nWhat makes “In the Holmes stories, Sherlock Holmes was\na brilliant detective” true (but not “In\nthe Holmes stories, Sherlock Holmes was a plodding\npoliceman”), when there never was such a person as Sherlock\nHolmes? In addition to the problem of how to understand the notion of\ntruth in a work of fiction, there is also a deep puzzle about the way\nwe respond emotionally to such truths. When we engage with fiction, we\noften do so at a highly specific emotional level—we may not only\nbe enthralled by elements of the plot but also affected by what\nbefalls particular characters. Thus, we may find ourselves feeling\npity for Anna Karenina as we near the end of Tolstoy’s novel\nbecause we are aware of Anna’s suffering. But the claim that we\npity Anna Karenina is deeply puzzling: we know there is no Anna\nKarenina, and that it is only true in Tolstoy’s novel that Anna\nKarenina is suffering, so how can there be genuine pity for Anna? This\nis the so-called paradox of fiction, one of a batch of puzzles that\nhave been raised in the philosophy of fiction about our engagement\nwith works of fiction.\n\n\nThese are by no means the only philosophical questions thrown up by\nfiction. In fact, the paradox of fiction immediately suggests others.\nTaken at face value, a statment like “Sherlock Holmes was a\nbrilliant detective” seems at best to be true in a work of\nfiction rather than true outright. By contrast, a statement like\n“Many readers pity Anna Karenina” seems to be true\noutright. (The same goes for other statements relating fictional\ncharacters to the real world, for example “Conan Doyle created\nHolmes”, “Frodo doesn’t exist”, and\n“Holmes is more famous than any real detective”.) This\nraises the thorny issue of the ontological commitments of talk\ninvolving fiction. If it is genuinely true that many readers feel pity\nfor Anna Karenina or that Doyle created Holmes, then presumably there\nare things—Anna Karenina and Holmes—about whom this is\ntrue. But how is the claim that there are such objects consistent with\nthe obvious truth that Holmes and Anna Karenina don’t exist? And\nwhat could such nonexistent objects be like? We leave detailed\ncommentary on such ontological and metaphysical questions to the entry\non\n fictional entities.\n The present entry is devoted to the nature of fiction and its\n“truths”, including our emotional engagement with these\ntruths—topics that can be discussed independently of whether one\nis a realist or an antirealist about fictional entities. Before we\nbegin, it is worth noting that the study of these topics is not the\nprovince of philosophers alone. Just what is fiction, for example, is\na question that also engages narratologists and historians of fiction\n(see, e.g., Gallagher 2006, Walsh 2007), although they approach the\nissue from different academic perspectives, often with somewhat\ndifferent aims in mind. The present entry focuses mainly on the work of\nphilosophers. \n",
    "toc": [
        {
            "#NatuFict": "1. The Nature of Fiction"
        },
        {
            "#SemaLingAcco": "1.1 Semantic and Linguistic Accounts"
        },
        {
            "#FictMakiUpStor": "1.2 Fiction as Making Up Stories"
        },
        {
            "#FictAuthPret": "1.3 Fiction as Authorial Pretense"
        },
        {
            "#FictMakeBeli": "1.4 Fiction as Make-Believe"
        },
        {
            "#SpeeActAcco": "1.5 Speech-Act Accounts"
        },
        {
            "#FictPretCognPsyc": "1.6 Fiction, Pretense, and Cognitive Psychology"
        },
        {
            "#NewChal": "1.7 New Challenges"
        },
        {
            "#TrutFict": "2. Truth in Fiction"
        },
        {
            "#TrutFictTrutWorlFict": "2.1 Truth in Fiction as Truth in the Worlds of Fiction"
        },
        {
            "#TrutFictMakeBeliTrut": "2.2 Truth in Fiction as Make-Believe Truth"
        },
        {
            "#TrutFictRoleAuth": "2.3 Truth in Fiction and the Role of “Authors”"
        },
        {
            "#ImpoFict": "2.4 Impossible Fictions"
        },
        {
            "#TrutThroFict": "3. Truth Through Fiction"
        },
        {
            "#ParaFict": "4. The Paradox of Fiction"
        },
        {
            "#Conc": "5. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Nature of Fiction\n\n\nIn whatever way we characterize the fiction/non-fiction distinction,\nthe distinction is widely recognized as important. We care which\ncategory a work belongs to. We read Lord Macaulay’s The\nHistory of England (1848) to learn about the overthrow of James\nII and its aftermath, and criticize Macaulay for departures from fact\nor for bias: these detract from its value as a work of non-fiction.\nHistorical novels such as Tolstoy’s War and Peace\n(1865–1867) or Hilary Mantel’s Wolf Hall (2009)\nalso display bias and they depart in numerous ways from fact, but the\nbias and inaccuracies don’t lessen their value as works of\nfiction. And when a writer passes off a work as a work of non-fiction,\ndeliberately hiding the fact that much of its content was made up, we\nsee that as fraudulent. (There are numerous examples. One famous case\nis “Jimmy’s World”, written for the Washington Post\nin 1980 by journalist Janet Cooke; the article won her a Pulitzer\nPrize that she later returned.)\n\n\nNot everyone agrees that the distinction matters. Some have argued\nthat all discourse is on a par, that there is no writing that is per\nse fictional or non-fictional. According to Stanley Fish, for example,\n\n\n\n\nwhen we communicate, it is because we are parties to a set of\ndiscourse agreements which are in effect decisions as to what can be\nstipulated as a fact. It is these decisions and the agreement to abide\nby them, rather than the availability of substance, that make it\npossible for us to refer, whether we are novelists or reporters for\nthe New York Times. (Fish 1980: 242) \n\n\nOther writers make much of the fact that even non-fiction writers\nselect and structure what they write about and how they write about\nit. But even if we grant all this, we don’t need to succumb to\nthe kind of skeptical position such authors argue for. It remains the\ncase that fiction writers by and large accept a distinction between\nthe real world and the fictional worlds they generate. The generation\nof such worlds, which often contain individuals, objects, and even\nkinds of objects, that are very different from those in the real\nworld, is not simply a consequence of broad principles about how we\nalways stipulate and select and structure how we see the world. In\nshort, even those inclined to a kind of constructivist anti-realist\nmetaphysics on the basis of the sorts of arguments Fish appeals to\nmight nonetheless still admit a robust fiction/non-fiction\ndistinction.\n1.1 Semantic and Linguistic Accounts\n\nBut what might such a distinction look like? What makes a\nrepresentation like a written text a work of fiction?\nDictionaries often contrast fiction with fact or reality, so one\ntempting thought is that something is a fiction just if it is false,\nor contains falsehoods: a purely semantic characterization of\n“fiction”. This seems to have been Nelson Goodman’s\nview: “Literal falsity distinguishes fiction from true\nreport” (Goodman 1978: 124). As a number of authors have pointed\nout, however,\nbeing false may be one meaning of the word\n“fiction”, but it is not the only meaning, and it is not\nthe meaning at play when we nowadays call something a work of fiction\n(Lamarque and Olsen 1994; Cohn 1999). If it were, then any work that\ncontains mistakes, say a physics text book, would count as a work of\nfiction.\n\n(This is not to say that there is no connection between these two\nmeanings of “fiction”. Works of fiction typically contain\nnumerous falsehoods, and some have even speculated that the negative\nmeaning of fiction as falsehood may have “delayed the lexical\nmove of calling novels ‘fiction’ to a time when this genre\nhad become a well-established, highly respected literary form”\n[Cohn 1999: 3].)\n\nEven if fiction in the intended sense can’t be defined in terms\nof the notion of falsity alone, it might be thought that more\ncomplicated semantic accounts will have a greater chance of success.\nThus, Cohn herself thought that fiction in the intended sense was\n“a literary nonreferential narrative” (1999: 17), where\nbeing “nonreferential” means that the work need\nnot, and does not exclusively, refer to the real world\noutside the text, and that any references when it does “are not\nbound to accuracy” (1999: 15). \n\nBut such an account inherits one problem that also affects the simpler\nview of fiction as falsehood. Not only is nonreferentiality, like\nfalsity, not sufficient for a text to be a work of fiction (consider a\nhistory of science text that contains a description of a failed\nscientific theory like phlogiston theory); it is also\nnot necessary. Works of fiction may be wholly true, and in\nthat sense refer exclusively to the real world outside the text. Imagine\na work of historical fiction written about real persons, where,\nunbeknownst to the author, the parts that the author thought she was\nmaking up capture exactly what really happened. That wouldn’t\nmake the work a work of non-fiction (Currie 1990: 9). In addition, the\nidea that references to the real world outside the text are not bound\nto accuracy surely needs to be weakened. Historical novels depend on\ntheir being more or less right about a large part of their historical\nsetting. \n\nProblems such as these have made semantic accounts of fiction\nrelatively unpopular with philosophers. The same is true of approaches\nthat look for textual differences between works of fiction and\nnon-fiction. There seems to be no feature of style or syntax that\nmarks off a work as fictional rather than non-fictional. For any\nproposed feature, say the use of footnotes or indices in works of\nnon-fiction or the use of the imperfect tense in fiction (cf. Recanati\n2000), one can find works from the other category that simply mimic\nthe feature. Certain literary scholars and linguists have suggested an\nexception should be made for free indirect discourse, a literary\ndevice whereby a character’s first-person take on events is\npresented via third-person narration (as in this line from\nEmma by Jane Austen, a master of this literary device:\n“He was afraid they should have a very bad drive. He was afraid\npoor Isabella would not like it. And there would be poor Emma in the\ncarriage behind” [Austen 1815 [1841: 114]). These theorists\nthink free indirect discourse is peculiar to fiction (see especially\nBanfield 1982). But there is substantial evidence to show that other\nwriting may also display this feature (see Fludernik 1993); even\nHemingway used it in his early journalistic writings (Blinova 2012),\nand it is prominent in works of New Journalism, such as Truman\nCapote’s In Cold Blood (1966). At best, the appearance\nof free indirect discourse suggests that the work is a work\nof fiction; it doesn’t imply it (Friend 2012). And the use of\nfree indirect discourse is scarcely necessary for being a\nwork of fiction. Many works show no sign of it.\n1.2 Fiction as Making Up Stories\n\nA more promising approach to understanding the fiction/non-fiction\ndistinction focuses not on semantic notions or stylistic features, but\non the author’s inventiveness in producing a text, whatever its\nsemantic or stylistic character. The best known such account is Harry\nDeutsch’s “fiction as making up stories” (Deutsch\n2000, 2013). Deutsch insists “we cannot be left without a sharp\ndistinction between fact and fiction” (2000: 149) even if we\nthink, as Goodman did, that facts are themselves fabricated. Crucial\nto the notion of fiction, he thinks, is that, unlike fact, it is the\nproduct of creative, imaginative activity on the author’s part,\nactivity in which the author makes something up “out of whole\ncloth”. His own distinctive take on this view explains the kind\nof fabrication involved in fiction-making as the author’s\nstipulatively ascribing properties to individuals, but where these\nproperties match properties possessed by pre-existing objects from the\n“fictional plenitude”, a domain that contains not only\nevery conceivable object and event but also an enormous range of\nimpossibilities (Deutsch 2000: 155–6). \n\nDeutsch is particularly critical of a contrasting view, to be\ndiscussed later, according to which what is necessary and sufficient\nfor a work to be a work of fiction is specified in terms of\nimaginative activity on the part of the work’s readers rather\nthan its author (Deutsch 2013: 366ff). But focusing on the author\nseems to have its own problems. First, it suggests that works like\nCooke’s “Jimmy’s World” and James Frey’s\nA Million Little Pieces (2003), both of which were\nsubstantially made up although passed off as works of non-fiction,\nthereby count as works of fiction, contrary to the usual\nclassification of such works (see Friend 2012; Friend agrees that we\nmight pejoratively call A Million Little Pieces\n“just one long fiction”, but sees this as an example of\nthe ambiguity of the word “fiction”). In response, Deutsch\ninsists that, whatever our judgment about Frey’s A Million\nLittle Pieces, the case of Cooke is clear: \n\n\n[she] exercised her authorial imagination. She did everything an\nauthor of fiction would normally do. … If there ever was a case\nof fiction masquerading as fact, this is it. (Deutsch 2013: 369) \n\n\nA second point, to be discussed below, is that numerous works of\nnon-fiction involve creative interpolations on the part of the author.\nIf so, Deutsch’s approach faces the danger that all such works\nshould be classified as part fiction, part non-fiction. But Deutsch\ndenies that on such a “fiction as making up stories”\napproach the inclusion of salient fictitious elements is sufficient to\nmake something a work of fiction (2013: 368)—it all depends on\nthe level of imaginative activity exhibited by the work.\n1.3 Fiction as Authorial Pretense\n\n\nDeutsch’s view is not the only one to highlight the central role\nof the author in the definition of fictionality. A number of authors\nthink that fiction-making involves a special kind of speech act on the\npart of the author, one that differs sharply from assertion (see\nespecially Currie 1990, to which we return below). Unlike\nDeutsch’s account, such views have the capacity to classify\nworks like “Jimmy’s World” as non-fiction on the\ngrounds that authors assert the content of such works; even if much of\nthis content is made up, authors intend readers to take it as factual.\nJust how to characterize a special speech act of fiction-making or\nstory-telling is no easy matter, however. Take Nicholas\nWolterstorff’s view that story-tellers engage in\n“presenting or offering for consideration” propositions\nfor audiences to reflect on (Wolterstorff 1980). But even scientists\ndo this when putting forward speculative theories, so it is hard to\nsee how this sets fiction apart from non-fiction. John Searle has in\nfact argued that attempts to define a special illocutionary act of\nfiction-making are doomed to failure, since they entail that fictional\ndiscourse must differ in meaning from ordinary assertoric discourse\n(Searle 1975: 323–4; Predelli 2019 offers a sympathetic\nreconstruction of the argument). He proposes that we should instead\nunderstand fiction-making in terms of pretense: authors\npretend to assert what they are saying (1975: 324). More\ngenerally, \n\n\nthe author of a work of fiction pretends to perform a series of\nillocutionary acts, normally of the representative type [such as\nassertion], (1975: 325) \n\n\nbut without any attempt to deceive. For Searle, therefore, \n\n\nthe identifying criterion for whether or not a text is a work of\nfiction must of necessity lie in the illocutionary intentions of the\nauthor \n\n\n(that is, their presence in the case of non-fiction writing, their\nabsence in the case of fiction-making), and not in features of the\ntext (1975: 325). \n\n\nSearle’s appeal to the notion of pretense has been very\ninfluential, but as stated the account seems inadequate in a number of\nways. As he himself admits, many works of fiction contain claims that\nseem to be put forward as serious assertions (he cites the opening\nlines of Tolstoy’s Anna Karenina, 1877), and so his\ntheory at best defines what makes a fragment of a work\nfictional, not what makes a work fictional (Searle 1975:\n331–2).\n(Searle’s account shares this feature with a number of other\naccounts; we look at ways in which theorists have responded below.)\nFurthermore, not only is pretense not necessary for something to be\n(part of) a work of fiction, it is also not sufficient: one can\npretend to engage in an illocutionary act for all kinds of reasons\nother than the fact that one is writing fiction—one might just\nbe engaging in mimicry or verbal irony, for example (Currie 1990: 17).\n\n\nDespite the latter problem, pretense has played, and continues to\nplay, a large role in the way philosophers understand fiction. Kripke,\nfor example, claimed as early as his 1973 John Locke Lectures that\nwriting fiction involved pretense, a view he then used to argue\nagainst attempts to use fiction in the defense of a descriptivist\ntheory of reference for names (Kripke 2013: 23). David Lewis too saw\nstory-telling as pretense: in his seminal work on truth in fiction he\nclaimed that “the story-teller [pretends] to be telling the\ntruth about matters whereof he has knowledge” (Lewis 1978 [1983:\n266]). Neither\nclaimed to be defining fiction in terms of pretense, however.\nLewis, for example, acknowledges that sometimes one pretends in order\nto deceive, unlike the story-teller (Lewis 1987 [1983: 266]).\n1.4 Fiction as Make-Believe\n\nThe problems faced by pretense accounts of fiction that only consider\nwhat authors do have made some philosophers look instead at the role\nthat readers play. Indeed, approaches that look at the role of readers\n(or, more generally, consumers) of fiction have now become standard in\nthe literature. Kendall Walton’s version of such a view appeared\nin his ground-breaking Mimesis as Make-Believe: On the Foundations\nof the Representational Arts (Walton 1990). Walton focuses on the\nway a text can be used as a resource in games of make-believe in which\nparticipants pretend, imagine, or make believe that the world is as\nthe text represents it as being. (Walton’s view, it should be\nstressed, applies to representational entities in general: dolls,\nglobs of mud, paintings, sculptures, and so on, not just literary\ntexts.) Just as children use tree stumps as props in a game of\nmake-believe in which the stumps count as bears, so a community of\nreaders can use a text as a prop in a game of make-believe in which\nthe text is treated as a record of events, situations, conversations,\netc. Any text whose function is to serve as a prop in a game of\nmake-believe, thereby prescribing imaginings about its content, counts\nas a work of fiction for Walton. (Function is determined by a number\nof factors such as author’s intentions and views about how the\nwork can be appropriately used; Walton 1990: 91.) If readers let their\nimaginings be directed in this way, they are then participating in a\ngame of make-believe that is authorized by the work.\n\nFor Walton, then, what is necessary for a text to count as a work of\nfiction is that it is supposed to serve as a prop in a game of\nmake-believe, one that requires readers of the text to make believe\nits content. Note that this does not exclude the author from having a\nsimilar attitude to the work. Authors too may imagine or make believe\nor pretend that what they are saying is true (cf. Searle), but what is\ncrucial to a work of fiction is that this is a requirement on\nconsumers of fiction. (For this reason, day-dreaming out loud\ndoes not count as fiction.) Walton argues that this make-believe view\nprevents most biographies, textbooks, newspaper articles, and the\nlike, from being works of fiction, since it is \n\n\nnot [their] function, as such, to serve as props in games of\nmake-believe. They are used to claim truth for certain propositions\nrather than to make propositions fictional. (1990: 70) \n\n\nBut there is a complication. Walton intends the account to provide a\nsufficient condition for being a work of fiction, not just a necessary\ncondition. In proposing this, he self-consciously departs from our\nordinary, intuitive concept of fiction, which he sees as only “a\nrough everyday classification” (Walton 1990: 72) in urgent need\nof refinement (among other problems, the ordinary concept of fiction\nis liable to treat certain works, for example, didactic dialogues like\nBerkeley’s Three Dialogues between Hylas and Philonous\n(1713), as both non-fiction and fiction; Walton 1990: 72). But that\nmeans that his new way of construing the fiction/non-fiction\ndistinction does not align with the usual way of understanding it,\nsince many works of apparent non-fiction—many newspaper\narticles, biographies, real-life adventure tales, and so on—are\nwritten in a way that is designed to engage readers’ imagination\nand so satisfy the conditions for being works of fiction. Thus, he\nwrites\n\n\nSome histories are written in such a vivid, novelistic style that they\nalmost inevitably induce the reader to imagine what is said,\nregardless of whether or not he believes it. (Indeed, this may be true\nof Prescott’s History of the Conquest of Peru.) If we\nthink of the work as prescribing such a reaction, it serves as a prop\nin a game of make-believe. (Walton 1990: 71) \n\n\nSimilarly, there is \n\n\nno doubt that [Norman Mailer’s The Executioner’s\nSong—a novelistic retelling of the execution of Gary\nGilmore] … has the function of prescribing imaginings (Walton\n1990: 80) \n\n\nand so counts as fiction for Walton. Walton even thinks that any\nmetaphor is a fiction since a metaphor prescribes imagining (Walton\n1993), and that objects that were not produced to function in this\nway, such as naturally produced cracks in a rock, could be treated as\nprops that prompt imaginings, and so could turn out to be a work of\nfiction (Walton 1990: 87).\n1.5 Speech-Act Accounts\n\nFor many critics (e.g., Currie 1990: 36; Lamarque & Olsen 1994,\n48; Davies 2001: 264; Stock 2017) these are unwanted consequences for\nan account of fiction. Excitingly told histories are still histories\nand so should be classified as non-fiction; and the fact that cracks\nin a rock might prompt imaginings just shows that the rock could be\ntreated as a work of fiction, not that it could turn out\nto be a work of fiction. These critics worry that\nWalton’s conception of fiction is far broader than the\ntraditional one (to mark this point, Friend 2008, 152, distinguishes\nwhat she calls “walt-fiction” from fiction in the usual\nsense), and insist that it is the latter notion that needs analysis or\nexplication. In the case of this traditional notion, they think we\nshould let the author’s intentions determine\nfictionality, just as Searle proposed, but, unlike Searle, they\npropose that this be done by focusing on how the author intends an\naudience to respond to a text rather than on the author’s own\nattitude to the text. One influential proposal of this type, defended\nby Greg Currie in The Nature of Fiction (1990), holds that\nauthors engage in a special illocutionary act of fictive utterance,\nwhich Currie then proceeds to describe in terms of Gricean reflexive\nintentions (cf. Grice 1957). In a fictive utterance, the author\nproduces a text with fictive intent, in the sense that he \n\n\nintends that we make-believe the text (or rather its constituent\npropositions) and he intends to get us to do this by means of our\nrecognition of that very intention. (Currie 1990: 30) \n\n\nWe can then say that \n\n\na work is fiction iff (a) it is the product of a fictive intent and\n(b) if the work is true, then it is at most accidentally true. (1990:\n46) \n\n\nThe second clause is added because Currie thinks that truth alone does\nnot disqualify a text from being fiction; an author may write a story\nthat, quite by chance, ends up correctly describing actual events. But\nif it is no accident that the work is true—if the work is\nsomehow the result of the represented facts being the way they are\n(for example, by the author recording these facts from memory, even\nrepressed memory)—then the work is non-fiction rather than\nfiction (Currie 1990: 47).\n\n\nCurrie is aware that as it stands this account needs finessing, since\nmany fictional works have a basis in actual fact. But for the most\npart Currie has remained true to this fictive utterance account of\nfiction. Later work changes some of the scaffolding of the theory, but\nnot its essential structure. For example, Currie (1995a) introduces a\nbroader philosophical conception of\nimagination—simulation—that covers both mental imagery and\npropositional imagining; he further suggests that “readers of\nfiction simulate the state of a hypothetical reader of fact”\n(Currie 1997: 144), and in doing so may also simulate the mental\nstates of the characters with whom they (as simulators of the\nhypothetical reader of fact) are emotionally engaged. (Matravers 2014:\nch. 3 criticizes the view that such simulation is distinctive of\nfiction.) \n\n\nOther authors offer variations on Currie’s fictive utterance\naccount. Lamarque and Olsen, for example, think that in the case of\nfiction an author presents sentences, aiming \n\n\nfor the audience to make-believe (imagine or pretend) that the\nstandard speech act commitments associated with the sentences are\noperative even while knowing they are not. (Lamarque & Olsen 1994:\n43) \n\n\nTo attend to the sentences in this way is to adopt the fictive\nstance towards them, and it is an author’s invitation that\nreaders adopt the fictive stance that makes something a work of\nfiction rather than non-fiction. Readers who adopt the fictive stance\ntowards the sentences can infer neither that the author believes them\nnor that they are true.\n\nLamarque and Olsen thus retain Currie’s view that there is a\nnegative association between awareness that certain sentences are true\nand their status as fiction. But as we already saw when discussing\nsemantic accounts of fictionality and, later, Searle’s pretense\naccount, any such negative association highlights a further problem.\nSome works of fiction, perhaps most, make authorial pronouncements\nthat are taken by both author and readers to be true (historical\nnovels are an obvious example). Works of fiction often contain true\ndescriptions of their geographical, historical, political, and social\nsetting, while works that belong to particular genres require true\ndescriptions of this kind if they are to be successful instances of\nthe genres (consider the setting of historical fiction like\nVidal’s Lincoln (1984) or social-political fiction like\nSinclair’s The Jungle (1906), or the descriptions of\nthe practice of policing and forensic science in\nCornwell’s Scarpetta series, for example; see also Gibson\n2007: ch. 5; Matravers 2014). So there are parts of many, if not most,\nworks of fiction that are non-accidentally true, and so the works\nshould not straightforwardly count as fiction according to the\ncriteria set out by Currie and by Lamarque and Olsen. \n\nThose in the fictive utterance tradition have responded to this\nproblem in different ways. One response is to invoke a further\ndistinction between the fictionality of statements contained in the\nwork and the fictionality of the work itself, taking the former as\nfundamental. Currie, for example, claims that his account is primarily\nan account of the fictionality of statements contained in a work, with\nthe fictionality of the work depending on the status of such\nstatements “in some perhaps irremediably vague way”\n(Currie 1990: 49). Most fictional works, Currie thinks, are “a\npatchwork of fiction-making and assertion” (1990: 48–9).\n(For criticisms of such a “patchwork” theory of fiction,\nsee, for example Friend 2008, 2011; Stock 2011, 2017.)\n\nThe second kind of response to this issue is more holistic. David\nDavies, for example, thinks that the primary focus of the\nfiction/non-fiction divide should be on narratives rather than whole\nworks (works might contain a series of narratives). What makes a\nnarrative fictional or non-fictional are the author’s purposes\nand the constraints she works under (Davies 2007). If, for example,\nshe feels herself bound by the “fidelity constraint”\n(roughly, that one should only mention events that one believes to\nhave occurred, in the order in which they occurred), she is writing\nnon-fiction, whereas if she is motivated by some more general purpose\nin story-telling such as the desire to entertain her audience she is\nwriting fiction. As a result, even a narrative that tracks actual\nevents can be fiction if the author’s story-telling purposes\noverride the fidelity constraint (Davies 2007: 47). (For criticism of\nDavies’s narrative view of fiction, see Friend 2008, Stock\n2017.)\n\nBy contrast, Kathleen Stock’s account of fiction allows that\nfictions may include propositions that are put forward simply because\nthey are important truths, and so material that should be believed and\nnot just imagined (e.g., the comments on slavery and Christianity in\nBeecher Stowe’s Uncle Tom’s Cabin (1851)). For\nStock, such beliefs are not outliers, for she thinks that even if a\nperson imagines something that she also believes, she will\n(be disposed to) conjoin this in thought with other propositions that\nshe does not believe (Stock 2011; 2017, 147). Stock then\ndefines a fiction as, roughly, as a collection of fictive utterances\nin Currie’s sense that are subject to the condition that where\nthere is more than one fictive utterance present, the author must also\nintend the reader or hearer to imagine them conjunctively. A\nfictional work, she thinks, is different. It is something\nusually carefully constructed and usually either written down for\nposterity, or performed publicly. By contrast, a fiction may be\nuttered only once, in a brief conversation with a single interlocutor\n(Stock 2017: 169–74).\n\nThese accounts all take authorial intention to be essential to being a\nfiction. For Walton, by contrast, the emphasis on authorial intention\nmistakes what are at best consequences of the author’s\nhaving constructed a fiction for an essential feature of fiction\n(Walton 1990: 87). He thinks that this is borne out by the fact that\n\n\n\n[o]ne may well read a story or contemplate a picture (which is a\nfiction) without wondering which fictional truths the author or artist\nmeant to generate. (1990: 88) \n\n\nAll this confirms, he thinks, that the basic concept of a fiction is\nbest thought of as attaching to objects whose function is to serve as\na prop of a certain sort in games of make-believe rather than to\nillocutionary actions (1990: 87). (For further discussion of\nWalton’s arguments on this point, see Stock 2017: ch. 7.)\n1.6 Fiction, Pretense, and Cognitive Psychology\n\nIn the previous subsection we considered views, beginning with\nCurrie’s, that take awareness that certain sentences are true to\ncount against their status as fiction, or that look to more holistic\nfeatures of the text to show why this awareness does not compromise\ntheir status as fiction. These views\nall hold that merely appealing to the imagination does not capture\nwhat is essential to fiction; they attempt in different ways to\nidentify what else is necessary. In the next section we look at some\ninfluential new challenges to these views, but in the present section\nwe adopt a different orientation. In order to narrow down the sense in\nwhich fiction on the ordinary, intuitive understanding prompts\nimaginings we describe some work on make-believe or pretense in the\ncognitive sciences. As we will see, there are some clear points of\ncontact between this work and some of the views considered above. \n\nConsider in particular the popular “multiple models”\ntheory according to which an agent engaging in make-believe entertains\na representational model—the pretend (or, more\nbroadly, imaginary) model—that is different\nfrom the representational model she normally\nuses—the reality model. The reality model in this\nset-up represents how the agent believes things actually unfold, while\nthe pretend model represents how things unfold in an imaginary world,\na world of make-believe (Perner 1991). Nothing, however, prevents the\npretend model from also storing actual beliefs, as may happen with\nfictions that import representations of the real world.  The point is\nsimply that once they are stored in the pretend model, those beliefs\nhave to be evaluated with respect to the imaginary rather than the\nreal world. The pretend model thus becomes part of an offline\nreasoning mechanism in which beliefs are disconnected from actions\noccurring in the real world. In particular, such beliefs don’t\nlead to the sort of actions that would result if they were part of an\nonline reasoning mechanism, which is what the reality model is\n(Nichols & Stich 2003).\n\nBut there is a problem with seeing the availability of a two-model\naccount as a sufficient condition for the relevant kind of\nmake-believe. There are people suffering from various clinical\nsyndromes who also activate distinct models of this kind, prompting\nthem to exhibit incoherent patterns of behavior. Thus, consider people\naffected by the Capgras syndrome. While saying that a close relative\nhas been replaced by an impostor, they also behave in a friendly\nmanner towards this “impostor”. Such people are perhaps\nbest interpreted as people whose odd beliefs are not integrated into a\nsingle belief system (Young 2000).\n\nA friend of the two-model account may say that people affected in this\nway are to be classified differently from those engaging with fiction:\ntheir “imaginary” beliefs are not quarantined from their\n“real” ones. But note that the simultaneous yet distinct\nactivation of the imaginary and reality models also accounts for the\ncognitive situation of agents who are somehow\ndissociated—subjects who experience a world of their own and\nstill do not lose their grip on the real world. Sleepwalkers are a\nclear case. A sleepwalker may mobilize both the reality model,\nallowing her to avoid obstacles while walking, and an imaginary model,\nin which she represents the world she is dreaming about. Despite this,\nshe is not engaged in make-believe (Meini & Voltolini 2010).\n\nOne way of answering this challenge is to invoke Leslie’s\nidentification of fiction with metarepresentation (Leslie 1987). On\nthis view, the required quarantining of imaginary beliefs involves a\nmetarepresentational level. The difference between a subject who\nengages in make-believe and a dissociated subject lies in the fact\nthat the former acknowledges that the representations\nentertained in the pretend model are not to be lumped together with\nthe representations that she entertains in the reality model.\nFollowing a line of thought that can already be found in Vaihinger,\nwho originally drew a connection between fiction and awareness (1911\n[1924]: 80, 98–9), Lillard writes: \n\n\na pretender must be aware of the actual situation and the nonactual,\nrepresented one, or else (s)he is mistaken, not pretending. (2001:\n497) \n\n\nProponents of such a view construe this kind of awareness as a\nsecond-order representation that operates on first-order\nrepresentations; it involves a recognition that, insofar as the\nimaginary representations are stored in the pretend model, it\ncan’t be inferred that they represent the real world. Note that\nCurrie himself moves in this direction when arguing that\nmetarepresenting is required for pretending, as a way of combining his\nintentionalist account of fiction with simulationist accounts (Currie\n1998).\n\nSome critics, however, think this idea is too demanding, that it\npresupposes too intellectualist a view of pretending and hence of\nfiction (see Perner 1991: 19–20, 35). For in order to have a\nmetarepresentation of a representation, one surely needs to represent\nit to oneself as a representation, and young children in\nparticular do not possess a notion of representation (1991:\n19–20, 35). Others think this criticism presupposes a disputable\nconceptualist account of representing, and hence also of\nmetarepresenting (Meini & Voltolini 2010). Perner himself\nrecognizes that merely simultaneously entertaining distinct\nrepresentations in different models is not sufficient for\nmake-believe, and suggests that the two models have to be integrated\ninto a single all-encompassing model which nests both the pretend and\nthe reality models. It is far from clear, however, that this account\nis any less intellectualist than the metarepresentational one that\nPerner criticizes, given the way it appeals to the idea of\nnesting. Leslie had already pointed out that we invoke a nesting of\nthis kind when, from outside of a fiction F and typically from\nthe perspective of reality, we speak of F itself when we say\n“In fiction F,\np” (Leslie 1987). Doing so, however, requires possession\nof a notion that is even more conceptually demanding than the notion\nof representation, namely the notion of fiction itself, so this appeal\nto nesting should not be seen as unproblematic (Meini & Voltolini\n2010: 50). \n1.7 New Challenges\n\nThe various accounts of fiction discussed so far in this section\ndisagree on numerous points, and, although pretense or\nimagination-based accounts are probably the most widely supported,\neach one faces challenges and there is no consensus as to which\nversion is correct. But perhaps the most radical challenge to all of\nthese attempts to specify the nature of fiction has come from\ntheorists who think that the enterprise of finding necessary and\nsufficient conditions for what it takes to be a work of fiction should\nbe abandoned. Such theorists think that there are genuine borderline\ncases and cases that are, in some sense, admixtures of fiction and\nnon-fiction, and that such cases show that it is wrong to try to\ncapture the notion of fiction in terms of necessary and sufficient\nconditions. (Note that the main target for this challenge are\ntheorists who think that there are intuitive concepts of fiction and\nnon-fiction that are worth articulating in the first place. As we saw\nearlier, Walton’s approach is different: he urges replacement of\nthe traditional distinction.)\n\nWhile Walton proposes replacing the intuitive fiction/non-fiction\ndistinction, Derek Matravers urges another path (Matravers 2014): the\nphilosophy of fiction should simply stop caring about this distinction\nand shift its focus to the distinction between\n“confrontations” (situations that involve our immediate\nenvironment, and thereby afford the possibility of action) and\n“representations” (situations represented to us as\nhappening at other times or in other places, thereby denying us the\npossibility of action). On the surface, it is hard to see this way of\ncashing out representations as particularly illuminating, since it\nputs fictional representations in the same basket as some scientific\nrepresentations (2014: 53) and even historical representations. But\nMatravers discerns one significant difference among representations:\nwhere they lie on the “thin” to “thick”\ncontinuum. Thin representations (say, a physics text) merely aim to\npass on information and do not stimulate the imagination, while thick\nrepresentations, such as exciting histories and vivid novels, do. But\nMatravers insists that nothing in the way we engage with thick\nrepresentations separates fiction from non-fiction, and that this is\namply borne out by empirical studies of text-processing by\npsychologists (see, for example, Green & Brock 2000):\n\n\nThe experience of reading de Quincey’s “The Revolt of the\nTartars” is the same whether we believe it is non-fictional,\nbelieve it is fictional, or (as is most likely) we are ignorant of\nwhether it is non-fictional or fictional. (2014: 78)\n\n\nBecause of this, Matravers finds \n\n\n[t]he traditional distinction, between representations that are\nfiction and representations that are non-fiction, … entirely\nunhelpful. (2014: 47)\n\n\nA number of commentators, however, have denied that such empirical\nstudies really do have the implications that Matravers sees in them.\nFor Lamarque, for example, the modes of reading of literary critics\nand historians involve different normative practices that determine\nwhat questions are asked and where attention is directed (Lamarque\n2016). And Stacie Friend argues that even ordinary readers approach\nworks of fiction and non-fiction with different expectations (Friend\nforthcoming). \n\nFriend agrees, however, that our engagement with works of fiction and\nnon-fiction alike involves a combination of imagining and belief. Some\nworks of non-fiction contain striking invented and hypothetical\nelements (e.g., Tacitus’s Histories, which contains\nmade-up battle scenes; Dutch (1999), Edmund Morris’s\nauthorized biography of Ronald Reagan, in which Morris inserts himself\ninto the story as the fictional narrator; and works of history that\nactively countenance the implications of certain counterfactuals). At\nthe same time, facts about what actually happened are the dominant\nfocus of some works of fiction such as Vidal’s Narratives of\nEmpire series. Friend thinks that such cases undermine accounts\nof the fiction/non-fiction distinction by theorists like Currie,\nLamarque & Olsen, Davies, and Stock (see Friend 2008, 2011, 2012,\nforthcoming). \n\nTo deal with these and other hard cases, Friend recommends against\ntrying to find necessary and sufficient conditions for being a work of\nfiction, although not by relinquishing the emphasis on works\nin favor of more basic units like fictional statements and narratives.\nInstead, fiction and non-fiction should be regarded as very broad\ngenres in which particular works are embedded, where a genre is a way\nof classifying representations that guides appreciation. Borrowing\nfrom ideas in Walton’s “Categories of Art” (Walton\n1970), Friend argues that classifying a work as a work of fiction or\nnon-fiction depends on a range of features. A feature is standard for\na genre if possession of the feature tends to place the work in that\ngenre; contra-standard if possession tends to exclude the work from\nthe genre. (Features are variable if works can have or lack\nthem without this affecting membership in the genre, such as the\nnumber of chapters a work contains). Thus, containing made-up material\ncounts as standard for the genre of fiction but contra-standard for\nnon-fiction, while being faithful to the facts counts as standard for\nnon-fiction but contra-standard for fiction. (As Friend notes, such a\nclassification may itself change over time; the kind of inventive\nembellishment found in Tacitus’s Histories, for\nexample, was once regarded as standard for historical non-fiction, but\nis now regarded as contra-standard [Friend 2012: 192–3].)\n\n\nA crucial claim of the ensuing genre theory of fiction/non-fiction is\nthat having contra-standard features for a genre does not simply\nexclude a work from that genre. Capote’s In Cold Blood,\nfor example, is a striking piece of non-fiction precisely because it\npossesses certain features that were, at the time of its writing,\ncontra-standard for non-fiction. What explains the fact that we\nnonetheless class it as non-fiction has much to do with other features\nof the work, including the reliance we place on authorial intention:\nCapote took himself to be writing a kind of literary journalism\n(Friend 2012: 194), just as Tacitus took himself to be writing history\nafter the fashion of his time. (Friend is somewhat unclear about the\ncontent of such intentions, however. Presumably they can’t be\nunderstood as intentions to write a certain kind of fiction or\nnon-fiction, on pain of circularity, although it is hard to see how\nelse to construe them.)\n\nFor Friend, then, the classification of a work as fiction or\nnon-fiction may depend heavily on context: a weighing up of various\nstandard and contra-standard features that is strongly, but\ndefeasibly, influenced by authorial intentions. This opens the view to\nthe objection that the classification is too subjective for the\ndistinction to count as theoretically important (Voltolini 2016).\nFriend’s answer is that placement of a work in either the genre\nof fiction or non-fiction directs our attention to different aspects\nof the work, and even influences us to adopt a specific reading\nstrategy appropriate to works in the genre (Friend 2012: 202ff.;\nFriend forthcoming)—a very different view from that of\nMatravers, who discerned no interesting way in which our engagement\nwith fictional representation differs from our engagement with\nnon-fictional representations. \n\nThose who favor other accounts have not been quiet in their opposition\nto Friend’s proposal. Both Currie and Davies, for example, have\ndefended their versions of the fictive utterance theory by offering\nmore nuanced accounts of the way the fictional status of a work\ndepends on the fictional status of its parts (Currie 2014; Davies\n2015). Thus, Currie argues that a work’s fictional status\nsupervenes on its intentional profile, which specifies the\ncommunicative intentions behind the utterances that produce the work\n(Currie 2014). One consequence of this view is that if a work uses as\nmuch imaginative reconstruction and invention of events as a\nfictional work does (on our current understanding of this\nnotion), then all else being equal we should also count the first work\nas fiction. Currie takes this to imply that Tacitus’s\nAnnals and Histories, with their many made-up\nelements, count as fiction rather than non-fiction—despite the\nfact that Tacitus took himself to be writing non-fiction history (for\nobjections, see Friend 2012). By contrast, Davies again emphasizes\nthat the fictional status of a work depends on the fictional\nnarrative(s) found in a work, which he now construes as the fictive\ncontent readers are asked to make-believe of a real setting: if the\nnarrative serves to comment on something asserted in the work\nthen it is a work of non-fiction; if what is asserted serves to\ncomment on the narrative the work is fiction (Davies 2015, esp. 54).\nOn this criterion, he thinks, Tacitus wrote non-fiction. \n\nStock agrees. On her account, if a work contains utterances that are\nnot fictive in her sense (that is, if they express propositions that\nreaders are meant to believe but that they are not supposed to conjoin\nin thought with other propositions they are merely meant to\nmake-believe), the work counts as non-fiction. It follows, she thinks,\nthat we should count works like Tacitus’s Histories and\nAnnals and Morris’s Dutch as non-fictional\npatchworks of the fictive and non-fictive (Stock 2017: 160). Manuel\nGarcía-Carpintero (2013) offers another way of keeping a tight\nfiction/non-fiction distinction. He defends a version of\nCurrie’s view that fiction-making prescribes imagining, but\ninstead of appealing to the psychological attitudes of those engaged\nin fictive acts, as Currie does, he understands such prescriptions in\nterms of constitutive rules that specify the commitments someone\nincurs when engaging in fiction-making, as opposed to the constitutive\nrules that are involved in assertive acts. On this normative view,\nclaims that are asserted as true can be part of a work of fiction,\nsince, given the author’s purposes, one and the same fictive\nutterance may be subject to both the norm of fiction-making and the\nnorm of assertion, as a performance of a direct as well as of an\nindirect speech act as it were (2013: 356f.). But\nGarcía-Carpintero accepts that works of non-fiction can include\ninvitations to imagine as well, and he thinks that works like\nTacitus’s Histories and Annals\nstraightforwardly count as a patchwork of fact and fiction. (For\ndiscussion, see Stock 2017: 161–3.)\n2. Truth in Fiction\n\nWhatever the right theory of the nature of fiction, (nearly) everyone\nagrees that there are paradigm cases of works of fiction. Many of the\nsentences in such works are, of course, not true since in paradigm\ncases of fiction much of the content is made up. For example, the\nsentence \n\n\nIt was the end of November, and Holmes and I sat, upon a raw and foggy\nnight, on either side of a blazing fire in our sitting-room in Baker\nStreet. (The Hound of the Baskervilles: ch. 15) \n\n\nis not true at any real context of utterance since there is no\nSherlock Holmes, and no Dr. Watson to utter the sentence. More\ngenerally, sentences that purport to describe the world depicted in a\nwork of fiction are often false (or at least not true) since they\nmisdescribe the world as it actually is; “Holmes was a detective\nliving at 221B Baker Street, London”, for example. Still, this\nsentence sounds true, whereas a sentence like “Holmes\nwas a short-order cook living in Paris” sounds false. One way of\ncapturing this point is to say that fictional sentences are elliptic\nfor sentences with an “in the story” prefix (Lewis 1978\n[1983]): what is true is that in The Hound of the\nBaskervilles Dr. Watson and Sherlock Holmes sat reminiscing in\ntheir sitting-room in Baker Street on a raw and foggy night in\nNovember, just as it is true that in The Hound of the\nBaskervilles (and virtually all the Holmes stories) Holmes was a\ndetective living at 221B Baker Street, London. \n\nThis shifts the problem of how to understand the kind of truth that\nsentences have in a work of fiction to the actual truth of sentences\nof the form “In work of\nfiction F, φ”. How should we understand such\nprefixed sentences? It can’t simply be that a such a sentence is\ntrue if and only if φ is explicitly stated in the text\nof F. For one thing, some things are not true in a work despite\nbeing explicitly stated—the internal narrator of a story may be\nhighly unreliable (for example Charles Kinbote in\nNabokov’s Pale Fire [1962]). In addition, to identify\nsomething as an (obvious) truth of fiction we often have to rely on\nvarious (uncontentious) interpretive moves that belong to the\npragmatics rather than semantics of language – what is stated\nmay go beyond what the words explicitly say (this is so even in the\ncase of a paradigm fictional truth like “Holmes lived at 221B\nBaker Street”; see Hanley 2004).\n\nPut the problem of the unreliable narrator aside for now, and assume\nthat normal practices of interpretation apply when identifying the\nfictional truths stated in a work of fiction. Philosophers of fiction\nhave been mainly interested in the second problem: that of\ncharacterizing what it is for a sentence to be true in a work despite\nnot being stated in the work. A first attempt might focus on the\nbackground of actual fact that is available to readers of the work:\ngiven that London is the capital of Great Britain, the fact that the\nHolmes stories say that Holmes lived in London suggests that it is\nalso true in the Holmes stories that Holmes lived in the capital of\nGreat Britain. The simplest way to capture this thought would be to\nsay that it is true in a fiction that p iff p is a\nlogical consequence of the set of propositions that are represented as\ntrue in a story, combined with the set of all actual truths. But this\nsuggestion won’t do. Many actual truths are inconsistent with\nwhat is stated in a story, and so can’t be drawn upon in this\nway to yield claims about what is true in the story. (It\nis actually true, for example, that London did not have as\ninhabitant a famous detective called “Holmes” who lived at\n221B Baker St. But it is not true in the Holmes stories that Holmes\nlived in a city that did not have as inhabitant a famous detective\ncalled “Holmes” who lived at 221B Baker St.) We need to\nfilter out the background that we can legitimately draw upon when we\ndetermine what is true in a work.\n2.1 Truth in Fiction as Truth in the Worlds of Fiction\n\nDavid Lewis provided the classic discussion of this issue in his\n“Truth in Fiction” (first published in 1978, reprinted\nwith postscripts in 1983). His approach has two core ideas. The first\nis that we should adopt a pretense view of fiction. A fiction is a\nstory told by a particular person on a particular occasion, and to\ntell a story is typically to pretend that one is relating an account\nof things that really did happen. The second core idea is the one\nmentioned above: stories are related against a background of (known)\nfacts and beliefs, thereby ensuring that there is more to truth in\nfiction than is stated in stories. The novelty of Lewis’s\napproach is the way he understands this background and its impact in\nterms of the machinery of possible worlds and the semantics of\ncounterfactuals. To put the point in technical jargon, Lewis treats\nin-the-fiction operators as special intensional\noperators.\n\nLewis offers two main analyses. On Analysis 1, the background against\nwhich a story is told is just actuality, appropriately filtered to\nremove whatever is at odds with the story. Truth in a fiction is just\nwhat would have been true had the fiction been told as known\nfact. In terms of Lewis’s possible world analysis of\ncounterfactuals (Lewis 1973), this can be rendered as:\n\n Analysis 1 A sentence of the form\n“In fiction F, φ” is non-vacuously true\nif and only if some world where F is told as known fact and\nφ is true differs less from our actual world, on balance,\nthan does any world where F is told as known fact and\nφ is not true. (1978 [1983: 270])\n\n\nAnalysis 1 easily captures the fact that it is true in the Holmes\nstories that Holmes had a liver, for example (despite no mention being\nmade of this in the stories). It also captures the fact that the\nfictional truth of many claims is simply left indeterminate (while it\nis true in the stories that Holmes had a liver, for example, it is not\ntrue in the stories that he had an average-sized liver). But the\nanalysis also seems to catch too much (Lewis 1978 [1983]; Currie 1990;\nPhillips 1999; Walton 1990; Wolterstorff 1980). Given a story\nS, take any truth p that has no bearing on the events\ndescribed in S. On Lewis’s Analysis 1 it will then be\ntrue in S that p, whether or not anyone believes that\np. If, for example, Napoleon had exactly 100,001 hairs on his\nhead at the battle of Austerlitz, it will then be true in the Holmes\nstories that he did.\n\nIf the unknown proposition p has implications for the events in\nthe story, another problem arises. Take the example mentioned by\nLewis. Suppose, as many think, that the swamp adder in “The\nAdventure of the Speckled Band” (1892) was intended by Doyle to\nbe a Russell’s viper (Lewis 1978 [1983: 271]; but cf. Byrne\n1993: 25, note 5). In the story, Holmes concludes that the murder\nvictim in the story was killed by the snake’s climbing down a\nfake bell-rope. The Russell’s viper is a constrictor, however,\nso it cannot physically climb ropes, and hence\n Analysis 1\n suggests that it is true in “The Speckled Band” that\nHolmes bungled (Lewis 1978 [1983: 271]). But this would clearly be the\nwrong conclusion to draw: what is true in the story is that Holmes was\nright. The fact that Conan Doyle was ignorant of a little known\nbiological fact should not affect what is true in the Holmes\nstories.\n\nThis example suggests that it is (often) better to conceive the\nbackground in epistemic terms. (But maybe not always; as Lewis points\nout, there is a contested critical tradition that uses psychoanalytic\nviews to interpret literary texts, as in the claim that Hamlet had an\nOedipus Complex. Such a claim is probably best understood in terms of\n Analysis 1.)\n Lewis’s Analysis 2 provides such an epistemic orientation. It\ntreats “background” as beliefs that are overt in the\nauthor’s community, where \n\n\na belief [is] overt for a community at a time iff more or less\neveryone shares it, more or less everyone thinks that more or less\neveryone shares it, and so on. (1978 [1983: 272]) \n\n\nTake the collective belief worlds to be the worlds where all the overt\nbeliefs are true. Truth in fiction is what would have been true in the\ncollective belief worlds, had the fiction been told as known fact:\n\n Analysis 2 A sentence of the form\n“In fiction F, φ” is non-vacuously true\niff whenever w is one of the collective belief worlds of the\ncommunity of origin of F, then some world where F is\ntold as known fact and φ is true differs less from\nw, on balance, than does any world where F is told as\nknown fact and φ is not true. (1978 [1983: 273])\n\n\nAnalysis 2 rules out the case of the hairs on Napoleon’s head\nsince there is no number h such that people collectively\nbelieved that Napoleon had h hairs at the battle of Austerlitz\n(at best they accepted very rough upper and lower bounds that allowed\nfor 100,001 hairs but also considerably more or fewer). And the\nanalysis rules out the case of the Speckled Band since the reception\nof the story by its readers showed that the relevant collective belief worlds are all worlds in which there is nothing to prevent swamp adders from climbing\nropes. (In this case, the belief probably did not exist before people\nbegan reading the story, but was acquired as a result of trusting the\nauthor.) But the analysis also has some strikingly counterintuitive\nconsequences. Take a typical Victorian novel that nowhere takes a\nstance on whether God exists. On\n Analysis 2\n it will nonetheless be true in this novel that God exists, simply\nbecause Victorian England was overtly theistic so that the collective\nbelief worlds are all worlds in which God exists (Walton 1990).\nSimilarly, it will be true in many works that there are ghosts, and\nthat women are markedly inferior to men.\n\n\nIn the later postscripts to his paper, Lewis considers some needed\nrevisions to his two accounts. He conjectures, for example, that a\nstory’s explicit content and background may need supplementing\nby “carry-over” of truths from other fictions if we are to\ncapture what is true in a story (Lewis 1978 [1983]; Hanley 2004). But\nthe most widely discussed revision that Lewis mentions, and the one\nthat has generated most debate, concerns the case of impossible\nfictions—fictions that cannot be told as known fact in any\npossible world. We turn to this debate below (Sec 2.4) after reviewing\ntwo other influential accounts of truth in fiction.\n\n\nSome final remarks about the notion of worlds that features in\nLewis’s account and the many accounts inspired by his approach.\nLewis’s worlds are possible worlds.  He himself construes these\nas maximal connected spatio-temporal objects (Lewis 1986), although\nmany others take them to be abstract entities of some kind (see the\nentry on\n possible worlds.)  \n One can accept Lewis’s account of\ntruth in fiction while preferring one of these alternative\nmetaphysical conceptions of possible worlds.  The important point is\nthat the notion of a possible world, no matter how conceived, is a\npiece of modal machinery that has many other roles to play in\nmetaphysics.  It should not be confused with the notion of a fictional\nworld, appealed to by philosophers and non-philosophers alike.\nFictional worlds present themselves as realms, created by authors and\ngenerally incomplete and sometimes inconsistent, that are more or less\ndistant from the real world but despite the distance are at least\npartially accessible from the real world (thus, we can know about\nHolmes and admire him from a distance, even if we can’t help him\nsolve crimes).  But although we often talk about fiction in terms of\nfictional worlds, making literal sense of such talk is fraught with\ndifficulty (Pavel 1986 makes the attempt; Walton 1978 is a salutary\nreminder of what can go wrong), and philosophers have tended to take\nsuch talk with a grain of salt, construing fictional worlds instead as\nsets of fictional truths (Walton 1978; Walton 1990: 64–7) or as sets\nof worlds rather than single worlds (Lewis 1983: 270; Ross 1979:\n49–54). Some have used the notion of a fictional world construed in\nsome such way to provide a kind of linguistic counterpart to the\nmental reality and imaginary models discussed in 1.6, by appealing to\nthe idea of a context of utterance or interpretation.  (For more on\nthe relevant notion of context, see the entry on \n theories of meaning.)\n On such a view, saying that a sentence is aimed at correctly\nrepresenting a fictional world means that the sentence is to be\ninterpreted relative to a context that contains the fictional world\nrather than the actual world as its world parameter.  Consider a\nsentence like “Othello was jealous”.  As uttered in a\ncontext that contains the actual world as its world parameter, this\nsentence is not true since “Othello” refers to nothing\nthere.  But the very same sentence is true in a fictional context that\ncontains the fictional world of Othello as its world parameter, for at\nthat world “Othello” refers to the jealous Venetian\nsoldier of Shakespeare’s play.  This account arguably also\naccommodates the problem of how fiction can contain real truths, as in\nhistorical fiction. In such cases, one and the same sentence, say\n“Napoleon invaded Russia”, can be both actually and\nfictionally true, keeping the very same content in both the real and\nthe fictional context. \n\nThis kind of account yields an alternative construal of in-the-fiction\noperators.  Rather than being a special kind of intensional operator,\nas it is on Lewis’s account, an in-the-fiction operator turns\nout to be a context-shifting operator.  Take someone’s utterance\nof the sentence ‘In Shakespeare’s Othello, Othello was\njealous’.  The operator is context-shifting to the extent that\nthe context relative to which we are to interpret the embedded\nsentence ‘Othello is jealous’ is different from the\ncontext of utterance of the sentence as a whole, since the latter is\ncentered on the actual world, rather than the fictional world of\nOthello.  (See Recanati 2000, Predelli 2005, Bonomi 2008.  Predelli\n2008 offers a variation on such accounts.) \n2.2 Truth in Fiction as Make-Believe Truth\n\nWalton’s account of truth in fiction rests on his distinctive\naccount of a work of fiction as a prop in a game of make-believe,\nwhere the function of the prop is to prescribe imaginings. Unlike\nLewis, he doesn’t place stress on the idea that fictional\nstatements are implicitly prefixed with an in-the-fiction operator. For Walton, a proposition is\nfictional—true in the fiction—just in case participants in\nsuch a game of make-believe are supposed to imagine it as true (Walton\n1990; for some recent reservations about this account, see Walton\n2013, 2015). There are two types of fictional truth: the\nprimary fictional truths are evident in the work itself,\nwhile the implied fictional truths are generated from the\nprimary ones. The problem of how to generate implied fictional truths\nfrom primary fictional truths is essentially the problem that Lewis\nfaced, and the principles that Walton describes—the Reality\nPrinciple and the Mutual Belief Principle—are close to Analysis\n 1\n and\n 2,\n but without the commitment to the machinery of possible worlds.\nLetting \\(p_1\\)… \\(p_n\\) be the primary fictional truths of\nfiction F, the Reality Principle holds that it is true in\nF that q iff had \\(p_1\\)… \\(p_n\\) been the case,\nq would have been the case, while the Mutual Belief Principle\nholds that it is true in F that q iff the following was\nmutually and openly believed in the society from which F\noriginated: had \\(p_1\\)… \\(p_n\\) been the case, q would\nhave been the case. \n\nWalton acknowledges that each principle has counterintuitive\nconsequences (see Walton 1990: ch. 4 on the contrast and interplay\nbetween the two principles). Lewis himself noted this in the case of\nthe Reality Principle, but as we remarked above the same seems true of\nthe Mutual Belief Principle. In addition, neither principle seems able\nto handle cases in which genre conventions generate fictional truths.\nConsider an otherwise typical zombie story that never explicitly says\nthat zombies move by stumbling forward rather than by running\n(Woodward 2011: 163). Because this way of moving is a conventional\nfeature of zombies in the zombie story genre, it will be true in the\nstory that zombies don’t run, even though the question “Do\nzombies run?” is probably not answerable by appeal to either\nprinciple (Woodward 2011: 163; Lewis 1978 [1983: 274]; Walton 1990:\n161–9). Walton himself thinks that the moral to be drawn from\nsuch difficulties is that these principles are no more than rules of\nthumb, and that there is no single, general principle that governs the\npractice of critics and appreciators of fiction (1990: 139). A rather\ndifferent approach to these problems is taken by Stacie Friend, who\nargues that problems ensue if we insist on principles, taken\nas ways of inferring implied fictional truths from primary fictional\ntruths. Instead of defending the Reality Principle, she\ndefends what she calls the Reality Assumption, the thesis\nthat everything that is really true is also fictionally the case,\nunless it is excluded by the work (Friend 2017).\n\nThere is a further concern about the apparatus Walton employs, one\nthat also affects Lewis’s account. To apply the above rules of\ngeneration, we need to be able to determine a work’s\nprimary fictional truths, those that are evident in the work\nor, in Lewis’s terms, those that are part of what is told as\n“known fact”. These present no trouble if we have a\nreliable narrator, but what if the narrator is unreliable? With Lewis\nas his focus, Currie imagines a situation in which the Holmes stories\nare written in a “tone of understatement and irony”, so\nthat Holmes appears only somewhat successful even though in the story\nhe is “spectacularly successful” (Currie 1990: 70). Given\nthat the worlds to be considered are worlds in which the story is told\nas known fact, the worry is that, for Lewis, Holmes is only somewhat\nsuccessful in the stories. Walton’s answer to this kind of\nproblem is to allow free rein to the kind of pragmatic interpretive\nmoves that are used in ordinary communicative exchanges (see Walton\n1990: ch. 4). If there is evidence of understatement and irony, we\nshould make allowances for that when determining what is true. Lewis\nhas a broadly similar answer. In a footnote Lewis points out that\nthere are all kinds of ways of telling stories. Storytellers may\npresent themselves as quite unreliable (mad, naïve, etc.), or as\ntranslators of some work rather than the person who wrote it, and so\non. He adds that \n\n\nin these exceptional cases also, the thing to do is to consider those\nworlds where the act of story-telling really is whatever it purports\nto be—ravings, reliable translation of a reliable source, or\nwhatever—at our world. (Lewis 1978 [1983: 266 fn. 7]) \n\n\nHence if the author pretends to be recounting a true story in a tone\nof understatement and irony, then the worlds of the story are those\nworlds in which the teller really does tell a true story in a tone of\nunderstatement and irony, not worlds where his actual words are to be\ntaken literally (cf. Hanley 2004).\n2.3 Truth in Fiction and the Role of “Authors”\n\nCurrie’s answer to the problem of the unreliable narrator is\nquite different. His account of what is true in fiction eschews any\nappeal to worlds in favor and appeal to the beliefs of someone he\ncalls the fictional author:\n\nC “In\nthe fiction F, φ” is\ntrue iff it is reasonable for the informed reader to infer that the\nfictional author of F believes that φ (Currie 1990:\n80).\n\n\nHere the fictional author is “that fictional character\nconstructed within our make-believe whom we take to be telling us the\nstory as known fact” (Currie 1990: 76), and the “informed\nreader” is a reader who knows the relevant facts about the\ncommunity in which the work was written (1990: 97). The view also\noffers a distinctive way of dealing with the problem of unreliable\nnarrators. When the evidence suggests that a narrator is unreliable,\nwe are supposed to construct a hidden, completely reliable and\nknowledgeable fictional author who is “speaking with the voice\nof one of the (unreliable) characters in the story” (1990: 125);\nthe reader figures out what is true in the story by forming an\nimpression of the beliefs of the author, based on the text of the\nstory and facts about its community of origin. While many commentators\nhave lauded the move away from possible worlds, a number have doubted\nthat positing such an author is adequate to the task of explaining\ntruth in fiction (e.g., Byrne 1993; Howard-Snyder 2002; Swirski 2014),\neven complaining that it seems gratuitous to postulate “some\nshadowy meta-narrator who has all true beliefs but is choosing not to\nreveal himself” just to deal with a narrator who is unreliable\n(Matravers 1995; see Currie 1995a, 1995b for further discussion, and\nCurrie 2010 for a more sceptical perspective on internal narrators).\nOther philosophers have offered alternative accounts of the (real,\nhypothetical, …) authors whose beliefs or intentions determine what is\ntrue in fiction.  Stock, for example, argues for an extreme\nintentionalism on which, with some important qualifications aside,\nwhat is true in a fiction is what the real author intends her audience\nto imagine as being true (Stock 2017).  Others prefer more moderate\nappeals to the real author (e.g., Livingston 2005, for whom fictional\ntruth rests on what it is appropriate to make believe, given a goal of\nunderstanding fictive utterances in the author’s artistic context).\n\n\nAlex Byrne has a final criticism that he thinks affects Currie’s\nand Lewis’s accounts of truth in fiction in equal measure. It is\neasy to see that if F is a fiction then the sentence “In\nfiction F, F is told as known fact” is true for\nboth Lewis and Currie. Byrne (1993) labels this consequence of the two\nviews idealism, and he offers two objections. First, certain\nfictions are what Currie calls mindless: fictions in which\nthere is no intelligent life, and so no one to tell the tale. In such\nstories, it is false that there is someone who is telling the story.\nSecond, postulating knowing tellers would suggest quite extraordinary\nepistemic capacities on the part of these tellers in the case of\nfictions that carry detailed information about the psychology of\ncharacters, say. Currie’s response to the first kind of\ncomplaint is that the postulation of a teller for every tale is simply\na staple of literary and aesthetic theory (Currie 1990: 75–6).\nIf so, not worrying about how the teller got her information (it is\nenough that she must have got it somehow or other; cf. Hanley 2004)\nmight be another such staple.\n\nOne worry about such a response is that it seems little different from\nsaying we should treat the story as if it were told from a God’s\neye point of view. But the response is probably best treated as an\ninstance of something far more general: an appropriately dismissive\nattitude to certain sorts of questions. Walton calls questions of this\ntype “silly questions”. One of his many examples concerns\nthe way Othello is able to come up with superb verse—in English\ntoo!—despite his great distress; another one concerns the way\nnarrators in literary works tell of events they could not possibly\nknow about (Walton 1990: 174ff). In Walton’s view, we should\nsimply stop worrying about the apparent threat posed by questions of\nthis kind, perhaps by disallowing or de-emphasizing offending\nfictional truths (such as that Othello was a great literary talent, or\nthat the narrator was somehow able to determine that the characters in\na novel “lived happily ever after” (1990: 177–8)).\nSuch questions are “largely if not entirely irrelevant to\nappreciation and criticism” (Walton 1990: 238). If this is\nright, there is little reason to think that idealism of the kind Byrne\nobjects to constitutes a fatal defect in the approaches of either\nCurrie or Lewis.\n\nByrne himself defines truth in fiction in terms of what a Reader can\ninfer about what the Author invites him to make-believe, where the\nReader and Author are idealised entities identified in terms of\npragmatic principles of interpretation.  This allows Byrne to explain\nhow it can be true in a story that there is no one left to tell the\ntale and why it is rarely true in stories that there exists someone\nwith unexplained and extraordinary epistemological powers who knows\nthe deepest thoughts of others (Byrne 1993). The same conclusion is\navailable on some other author-based views, such as those of\nLivingston 2005 and Stock 2017. In fact, all such approaches promise\nto deliver a fairly direct way of defusing “silly questions”\nconcerning truth in fiction.\n\n\nWhatever the best way of dealing with the issue of “idealism”, it is\nan issue that affects Lewis and Currie in equal measure. But there is\nanother issue that some take to be an important reason for preferring\nan author-based account like Currie’s to a possible worlds-based\naccount like Lewis’s, namely what sense to make of truth in impossible\nfictions, a topic we turn to next.\n\n2.4 Impossible Fictions\n\nSome works of fiction describe scenarios that are impossible: not just\nphysically impossible (like fantasy stories), but metaphysically or\nlogically impossible (like certain time-travel stories and stories\nthat deny mathematical facts such as Ted Chiang’s\n“Division by Zero”, 1991). Early in his paper, Lewis\ncompletes Analyses 1 and 2 with the clause: “‘In fiction\nF, φ’ is vacuously true iff there is no\npossible world where F is told as known fact”. That\nclause implies that anything whatsoever is true in impossible stories.\nBut he then notes that some such stories involve venial\ncontradictions, contradictions due merely to a slip-up on the\nauthor’s part (the Holmes stories, for example, since these\nsometimes locate Dr. Watson’s old war wound in his leg and\nsometimes in his shoulder). To avoid the unpalatable conclusion that\nanything whatsoever is true in these stories as well, Lewis suggests\ntowards the end of “Truth in Fiction” that any such story\nshould be represented as a series of minimally revised consistent\nversions of the original, with truth in the story being truth in\nall the minimally revised consistent versions (Lewis 1978\n[1983: 274–5])—what he later called the method of\nintersection. On this view, it is true in the stories that Dr. Watson\nhad a war-wound, but it is not true in the stories that he had one on\nhis shoulder and it is not true in the stories that he had one on his\nleg. \n\nPostscript B to the original article shows a change of mind. To\npreserve what he calls the “distinctive peculiarity of\ninconsistent fiction” (Lewis 1983: 277), Lewis now suggests we\nadopt the method of union: what is true in a fiction is what\nis true in at least one consistent fragment, so that we can have\n“In fiction F, \\(\\phi\\)” is true and “In fiction\nF, \\(\\neg \\phi\\)” is true, but never “In fiction\nF, \\(\\phi \\land \\neg\\phi\\)” is true. \n\nYet, as Lewis himself acknowledged, this account does not work with\nblatantly inconsistent stories whose contradictions are not venial,\nand with respect to these stories he takes a hard line: “we\nshould not expect to have a non-trivial concept of truth in blatantly\nimpossible fiction” (Lewis 1978 [1983: 275). Many disagree,\noffering examples of such stories where the issue of truth and falsity\nappears to arise much as it does for consistent\nstories. Currie’s (1990) example is of a story that turns on the\nhero’s disproof of Gödel’s incompleteness\nresults. Such a story simply can’t be divided into consistent\nfragments.  Similarly, consider Graham Priest’s story of\nSylvan’s Box, which involves the discovery of a box belonging to\nthe late Richard Sylvan that is at once empty and non-empty (Priest\n1997, 2005). (Other examples may include stories about donkeys that\ntalk and pigs who lead revolutions, as well as fictions in which\nactual people and fictional characters interact, for example,\nPirandello’s Six Characters in Search of an Author\n[1921]; cf. Byrne 1993; Woodward 2011; for an even more radical take\non the inconsistency in fiction, see Woods 2018.) Some bite the\nLewisian bullet at this point. Hanley (2004), for example, argues that\nsome such fictions may be susceptible to the method of union; in other\ncases, the best way to interpret them is simply to doubt the\nreliability of their narrators. Nolan (2007) similarly argues that our\nintuitive judgment of what is true in the fiction in such cases tracks\nthe narrator’s beliefs rather than the represented facts.\n\nMost writers agree, however, that there can be a coherent notion of\ntruth in fiction even for “blatantly” inconsistent\nfictions (see, for example, Byrne 1993; Le Poidevin 1995; Phillips\n1999; Gendler 2000; Weatherson 2004, Priest 2005, Proudfoot 2006). But\neven when there is agreement about this, there is no agreement about\nthe resources needed to capture such a notion of truth. Some think\nthat the best and perhaps most obvious solution to the problem of\ninconsistent fiction is a generalization of Lewis’s own\napproach: we should admit appropriately selected impossible worlds to\nthe set of worlds that realize what is told in such a story (see\nPriest 1997, 2005; Woods 2003: ch. 6; Berto 2012: chs. 7, 8; Jago\n2014; cf. also the entry on\n impossible worlds).\n\n\nImpossible worlds, however, are for many a difficult pill to swallow.\nLewis himself makes a throwaway remark that might suggest a moderate\nalternative – he adds:\n\n\nor perhaps we should expect to have [a non-trivial concept of truth in\nblatantly impossible fiction] only under the pretense—not to be\ntaken too seriously—that there are impossible possible worlds as\nwell as possible possible worlds. (1978 [1983: 275]) \n\n\n(such a view would be a kind of extended modal fictionalism—see\n§1.5 of the entry on \n modal fictionalism).  \nLewis makes a further appeal to this idea in a letter to\nGraham Priest (9 January, 2001), although only to assert that the idea\nis of limited usefulness.  In his words,\n\n\nI agree with you about the many uses to which we could put\nmake-believedly possible impossibilities, if we are willing to use\nthem.  The trouble is that all these uses seem to require a\ndistinction between the subtle ones and the blatant ones (very likely\ncontext-dependent, very likely a matter of degree) and that is just\nwhat I don’t understand.  (Lewis 2004: 177)\n\n\nCurrie’s diagnosis of the problem of truth in impossible\nfictions is very different. He thinks that worlds simply constitute\nthe wrong currency for characterizing the notion of truth in fiction,\neven when authorial and community belief is added to the mix (as on\n Analysis 2).\n Currie thinks that once we understand the notion of truth in fiction\nin doxastic terms as what we can reasonably take the fictional author\nto believe\n (account C\n above), the case of radically inconsistent fiction presents no\nfurther problems. There is no bar, he thinks, to supposing that\nsomeone believes impossible propositions, even simple impossible\npropositions like \\(7+5 ≠12\\), and so there can be no objection to\nthe claim that even blatantly impossible propositions can be true in a\nwork of fiction. \n\nBut while this may work for the simplest cases, it is not clear that\nwe can be so sanguine about others. Thus, consider stories like\nGendler’s story of the Tower of Goldbach in which \\(7+5 ≠\n12\\) and \\(7+5=12\\) (Gendler 2000), or Priest’s story of\nSylvan’s box, empty and non-empty at the same time. It is one\nthing to allow that such contradictory propositions are both true in\nthe relevant story; understanding how it can be reasonable to\nattribute belief in both propositions to a fictional author may be\nmore difficult. Or consider a story in which everything whatsoever is\ntrue (imagine a story in which God or Sylvan discloses this to\nPriest). Even those who think that there is no bar to believing\nimpossible propositions are likely to reject as incoherent the thought\nthat someone can believe all propositions (cf. Priest 2000).\n\n\nNote that the problem of impossible fictions affects Walton’s\nmake-believe account rather differently.  Truth in fiction for Walton\nis a function of prescriptions to imagine, and he is relatively\nsanguine about such prescriptions in the case of impossible fictions.\nEven contradictions, he suspects, can be imagined in the relevant\nsense, but he adds that even if they can’t, his account of\nfictionality or fictional truth is safe.  He offers two options:\nfirst, there might be prescriptions to imagine a contradiction even if\nactually imagining it is not possible; secondly, there might be\nseparate prescriptions to imagine p and not-p, but not\ntheir conjunction (Walton 1990, 64–6).\n\nThe second way is an analogue of Lewis’s method of intersection.\nPerhaps the first way is needed to deal with the case of blatant\ncontradictions, but as Walton notes even this is far from clear.\nWhile imagining a contradiction may well not be possible if\nimagination relies purely on mental imagery, the kind of imagining\ninvoked in fiction is very different: what is at stake here is\npropositional imagining and it is difficult to motivate the\nclaim that imagining even blatant contradictions is impossible.\nAttempts to do so tend to rest on quite contentious views of what\npropositional imagining must involve (cf. Everett 2013; cf. also Kung\n2016 on the telescopic versus stipulative views of imagining).\n3. Truth Through Fiction\n\nAfter his discussion of truth in fiction, Lewis acknowledged in\nPostscript B that some people value fiction “mostly as a means\nfor the discovery of truth, or for the communication of truth”\n(Lewis 1983: 278), that is, genuine truth, not merely fictional truth.\nIt is possible that Lewis simply meant that sentences like “In\nthe Holmes stories, Holmes is a detective” are really, and not\njust fictionally, true, for this fact captures the sense in which it\nis really true, say, that Holmes is a detective and really false that\nhe is a rockstar. But the problem of whether fiction-involving\nsentences communicate truths does not end here. There are various\nother ways of understanding how fiction might make such a\ncontribution. To begin with, some statements true in a work of fiction\nare also genuine truths, included because the author wanted an\nappropriately realistic setting for the work (e.g., historical\nstatements in works of historical fiction) or in order to acquaint\nreaders with facts that the author regards as morally or politically\nsignificant (consider, for example, the fiction of Charles Dickens,\nUpton Sinclair, or Aleksandr Solzhenitsyn). Whatever the reason, such\ncases suggest that fiction can serve as a means for readers to\ndiscover genuine truths. \n\nPhilosophers and literary theorists by and large agree with this claim\n(Friend 2006; Lamarque & Olsen 1994). Even on imagination-based\ntheories of fiction, there is nothing to prevent statements that\nreaders are invited to imagine as true from also being known as\nfact. This is consistent, however, with acknowledging that learning\nfrom fiction is not always easy, since it requires an ability to tell\nwhether an apparently factual claim in a work of fiction has been\nincluded in the fiction because of its truth or for other\nreasons. More generally, a number of psychological studies suggest\nthat readers often lack the ability to tell truth from falsehood in\nfiction, failing to adequately scrutinize information when engaging\nwith fiction while being more careful in the case of non-fiction (see,\nfor example, Prentice & Gerrig 1999; Wheeler et al. 1999; Butler\net al. 2012). While this propensity on the part of readers\ndoesn’t show that they are never able to gain factual knowledge\nrather than mere (true) belief from engaging with works of fiction, it\nmay make it harder than it first appears. One plausible suggestion is\nthat where there is knowledge rather than mere belief, this happens\nbecause readers have acquired a competence at reliably discriminating\ntruth from falsity in works of that genre (Friend 2014).\n\nBut learning factual truths is not what philosophers and literary\ntheorists usually have in mind when they think of fiction as a means\nfor the discovery, or communication, of truth. They have in mind truth\nthat has deeper human significance, like the universals that Aristotle\nclaims in The Poetics to find in the works of poets, or the\nkind of truth about human nature, for example, that Samuel Johnson\nfinds in Shakespeare (“he has not only shewn human nature as it\nacts in real exigencies, but as it would be found in trials, to which\nit cannot be exposed”; Johnson 1765). Many philosophers thus\nembrace what is commonly called (literary) cognitivism, which claims\nthat literary fiction can contribute to readers’ knowledge in a\nway that adds to the literary or aesthetic value of a work (Davies\n2007; Gaut 2005). \n\nBut knowledge in what sense? Like Aristotle, a number of cognitivists\nthink that literature can form the basis of propositional knowledge,\neven if there is dispute about what kind of propositions can be known\nand how they are known (Novitz 1987; McCormick 1988; Carroll 2011;\nKieran 2004; Kivy 1997; Elgin 2007; Mikkonen 2013). A common claim is\nthat literature provides knowledge about moral values, especially\nabout the particular moral requirements of concrete situations\n(cf. the appeal in Nussbaum 1990 to the later novels of Henry\nJames). Some think literature can also provide a kind of conceptual\nknowledge, such as insight into a moral concept like sympathy (John\n1998). Others have thought it can even teach deep psychological truths\nor truths about our place in the world. In many cases, however, the\n“truths” readers claim to find in literature will be quite\ncontestable, with different works presenting different points of view.\nEven then, however, it might be argued that readers at least acquire\nknowledge of possibilities. Consider, for example, a work like\nCéline’s Journey to the End of Night (1932),\nwhose underlying hypothesis is that all humans and their institutions\nare abhorrent. Even Putnam, who is broadly sympathetic to cognitivism,\nagrees that all we really learn from Céline’s work is how\nthe world looks to someone who accepts that hypothesis, which is\nmerely “knowledge of a possibility” (Putnam 1978). \n\nMany cognitivists, however, think that the knowledge we acquire from\nliterary fiction is not centrally a kind of propositional or even\nconceptual knowledge, but a kind of practical knowledge. For example,\nliterature can cause us to attend to the world in a more focused way,\nenriching our perceptual experience and emotional and moral\nunderstanding (Diamond 1995; Nussbaum 1985, 1990, 2001; Gibson 2007;\nRobinson 1995 [1997]). One way it might do this is by being a source\nof what Davies calls categorial understanding (2007: 146),\nyielding new categories through which to understand the world, for\nexample quixotic and Kafkaesque (Goodman 1978:\nch. 4). It can also provide phenomenal knowledge: knowledge of what it\nis like to be a certain kind of person or be in a certain kind of\nsituation, and so knowledge that can be put to use in planning or to\nhelp us understand other people or the moral complexity of situations\n(Kieran 1996; Currie 1998; Putnam 1978; Carroll 2002; Swirski\n2007). \n\nMany are sceptical. Anti-cognitivists think that, whether or not a\nwork’s aesthetic or literary value would be enhanced by\ncontributing knowledge. Echoing Plato’s famous charge in The\nRepublic, Jerome Stolniz (1992) has argued that there is no\nproper domain of artistic knowledge: significant truths found in\nliterary works are the proper subject of other areas of enquiry, not\nliterature. Even if one does acquire beliefs from literary works, the\nworks themselves don’t supply the warrant for the beliefs, and\nso can scarcely be said to yield knowledge.  Furthermore, to the\nextent that we do learn from literature it is either hard to\narticulate what we learn, or the truths turn out to be cognitively\ntrivial; Pride and Prejudice (1813), for example, may teach\nus little more than the banal “Stubborn pride and ignorant\nprejudice keep attractive people apart” (Stolniz 1992:\n193). Others have raised doubts about the ability of literary fiction\nto yield the kind of substantial practical knowledge that is often\nclaimed for it. Reading Styron’s historical novel, The\nConfessions of Nat Turner (1967) may make us think we know what\nit was like to be a black slave in early nineteenth century Virginia,\nbut it is surely more likely that exposure of this kind simply\ngenerates the illusion of knowledge (Harold 2016).\n\nCognitivists have fought back in a number of ways. Propositional\ncognitivists have argued that literature does offer support for its\nknowledge claims, say by taking them as live hypotheses to be tested\n(Kivy 1996, Novitz 1987) or by allowing readers to draw on latent\nmemories and other available resources (Carroll 2011) as well as\nargumentative resources explicitly found in the text (Mikkonen 2013).\nAnd both propositional and non-propositional cognitivists have\nacknowledged that there is no certain route to knowledge through\nliterature; as in the case of our acquiring factual beliefs on the\nbasis of reading fiction, literary works can make us less\nknowledgeable (believe falsely or behave unwisely) as well as more\nknowledgeable.\n\nA final point. As we have seen above, literary cognitivists think that\na work of literary fiction can contribute to readers’ knowledge\nin a way that adds to the value of the work; anti-cognitivists deny\nthat it can contribute the kind of knowledge cognitivists focus\non. More radically, however, one of the best-known concerns about\nliterary cognitivism is that, even if literary works do provide\nreaders with knowledge, the knowledge they yield doesn’t\ncontribute to their literary value. Such a non-cognitivist\nview is associated in particular with the work of Lamarque and Olsen,\nwho have offered an influential argument for a “no-truth”\ntheory of literary fiction (Lamarque & Olsen 1994). On this view,\nwhile we may well be able to learn from literature, the truth of a\nclaim made by a literary work is never relevant to the work’s\nliterary value; all that is relevant is a work’s theme and how\nit is presented.  Not surprisingly, this view has also proved highly\ncontentious, with many commentators critical of the separation of\ntheme and truth (see, for example, Rowe 1997; Gaut 2005; Kivy\n2011).\n4. The Paradox of Fiction\n\nWhether works of fiction provides readers with knowledge (and, if so,\nwhat kind), there is little doubt that authors of such works often aim\nto communicate what they take to be salient truths in the hope of\naffecting their readers in some way. Upton Sinclair, for example,\nwanted readers of The Jungle (1906) to recognize the poor\ntreatment of workers in Chicago slaughter-houses, and to respond to\nthis treatment with anger. Even more familiar, however, is the way\nauthors try to get readers of a work of fiction to respond emotionally\nto the fictional truths they encounter in the work, rather\nthan any actual truths. To take a classic example, on reading\nTolstoy’s Anna Karenina, a reader may feel deep pity\nfor Anna Karenina because of her increasing despair as Vronsky\ndistances himself from her, an emotion Tolstoy no doubt expected and\nintended. But this generates a famous puzzle: how can a reader feel\npity for Anna, knowing that Anna doesn’t exist? This puzzle,\ncommonly known as the paradox of fiction or the paradox\nof fictional emotions, involves a triad of seemingly compelling\nbut incompatible claims about emotional responses generated by\nengaging with fiction. For a representative formulation: \n\n(A) People\nexperience emotions for fictional objects and situations, knowing them\nto be fictional\n(B) People do\nnot believe that fictional objects and situations exist\n(C) In order\nto experience an emotion for an object or situation, one must believe\nthat it exists\n\n\n(A broadly equivalent formulation is found in Gendler’s entry on\n imagination.)\n The question is how best to resolve the inconsistency among these\nclaims; that is, which of (A)–(C) to give up so that consistency\nis restored, and why these and not others.\n\nDifferent solutions to the paradox provide different answers to such\nquestions, although it is worth noting that the paper that introduced\nthe paradox to the philosophical world, Colin Radford’s\n“How can we be moved by the fate of Anna Karenina?”\n(Radford 1975) took a rather different line from other solutions. His\nIrrationalist solution (our classification follows Levinson\n1997) holds that people’s apparent ability to respond\nemotionally to fictional characters and events is “irrational,\nincoherent, and inconsistent” (Radford 1975: 75). They regard\n(C) as a normative constraint on rational agents, but their actual\nbehavior and beliefs, as described in (A) and (B), show that they fail\nto conform to this constraint.\n\nDissatisfaction with Radford’s account resulted in numerous\npublications that have kept discussion of the problem alive. Most, in\nfact, favor a rejection of (A) or (C). Among those who reject (A),\nsome deny (A) on the grounds that it misdescribes the nature of our\naffective responses. According to the Non-Intentionalist\nsolution the affective states in question are not emotions but more\nakin to object-less states like moods or reflex reactions (Charlton\n1970: 97), while for the more popular Surrogate-Object\nsolution (A) misidentifies the target of emotional responses to\nfiction: they really have as their objects (parts of) the fictional\nwork itself; or perhaps the descriptions or thought contents afforded\nby the fiction (Lamarque 1981); or on another formulation real\nindividuals or phenomena that resemble the persons or events of the\nfiction (see, for example, Charlton 1984).\n\nA third way of denying\n (A)\n is Kendall Walton’s well-known Make-Believe solution\nto the paradox (Walton 1990, 1997; see also Currie 1990). According to\nWalton, it is fictional in the imaginative games of make-believe that\npeople play on the basis of their reading works of fiction that they\nexperience emotions for fictional objects and situations. In reality\nthey don’t. A reader of Anna Karenina (1877)\ndoesn’t really pity Anna Karenina, but what she does experience\nare various characteristic psychological and bodily effects of her\nimagining that Anna Karenina has suffered greatly.\nOriginally, Walton called states of this kind quasi-emotions (in this\ncase, quasi-pity); the fact that a reader experiences quasi-pity in\nthe course of her imagining is what makes it fictional in her game of\nmake-believe that she feels genuine pity for Anna Karenina. A case of\nreal pity, by contrast, requires the quasi-pity that an agent\nexperiences to be the result of her genuine belief that someone is\nsuffering or has suffered (Walton 1990: 251), and only when this is\nits cause will the quasi-pity also be accompanied by appropriate\nbehavior: an attempt to console if consoling is within one’s\npower, say. (Walton’s classic example of the absence of\nappropriate behavior is that of not running out of the theatre, even\nthough in the grip of quasi-fear, while watching a horror movie in\nwhich the Green Slime turns towards you.) Walton clarifies his view in\nWalton 1997, where he emphasizes that he regards fictional emotions\nnot so much as special kind of states, but as emotions that are merely\nfelt in the context of engaging with fiction rather than actuality.\nWhat Walton cannot allow, however, is that it is genuinely true that\npeople have emotions in this sense towards fictional characters like\nAnna Karenina. No relational claims of this kind can be genuinely true\nfor Walton, since he denies that there are any fictional characters.\n(Whether his rejection of fictional characters is required by his\nreasons for rejecting (A) is another question. For more on this\nquestion, see the entry on\n fictional entities.)\n\n\nWalton’s view has been subject to much criticism (for a survey,\nsee Neill 2005). Before we turn to its main rivals, it is worth\nobserving that Walton’s main reason for not counting fictional\nemotions as real emotions (the lack of characteristic associated\nbehavior) is also the main reason why few commentators nowadays accept\nthe Suspension of Disbelief solution, which involves\nrejecting\n (B)\n and maintaining that when readers of fiction emotionally respond to\nthe characters they read about they are acting on an implicit belief\nthat these exist. (Samuel Taylor Coleridge, who coined the term, may\nhave held a version of this view; cf. Coleridge 1817: ch. 14 [in vol.\n2, p. 2].) For discussion, see Radford 1975, Schaper 1978, and Carroll\n1990.) \n\nFar more popular are views that reject\n (C)\n and hold that we have real emotions towards fictional objects despite\nbelieving that they don’t exist. A possible reason for this is\nthat, unlike the two other statements of the triad, (C) strikes many\nas a piece of articulated theory (the so-called cognitive theory of\nemotion) rather than a commonsense claim (cf. Gendler 2008). One way\nof rejecting (C) is the Surrogate-Belief solution, which\nmaintains that an emotional response to a fictional character requires\nno more than the belief that the character exists in the world(s) of the\nfiction (cf. Neill 1993). Another solution—and possibly\nthe most widely accepted of all—is the\nAnti-Judgmentalist solution, which denies that emotional\nresponses to objects logically require beliefs concerning the\nexistence and emotion-prompting features of objects; instead, it is\nenough if we imagine, “mentally represent” (Lamarque\n1981), or entertain, such objects “in thought” (Carroll\n1990). (See also Stecker 2011, which regards this solution as in some\nsense the default solution; he thinks other solutions are nonetheless\nworth investigating because of the way they shed light on the way our\nreactions to fiction often differ from standard emotional reactions.)\nVersions of such “thought theories” are also defended in\nMoran 1994, Smith 1995, Feagin 1996, and Gendler 2008. But note that\nsuch views face the problem that the objects of the emotions mobilized\nby fiction are either understood in some nonstandard way, for example\nas thought contents (cf. the objection in Walton 1990 to Lamarque\n1981) or, more generally, as abstract rather than concrete entities;\nor they are understood as nonexistent objects, a category many\nphilosophers find ontologically problematic. (For a useful overview of\nthe various solutions, see Gendler & Kovakovich 2006. See also the\nentry on\n fictional entities.)\n5. Conclusion\n\nThis entry has focused on a number of central issues in the philosophy\nof fiction: the nature of fiction; what it means to say that something\nis a truth of fiction; what (and in what sense)\nwe can learn from fiction; and how we can have emotional responses to\ncharacters of fiction. There are other issues in the philosophy of\nfiction that could have been discussed in this entry, a number\nof them the subject of related entries. Consider the question of\nwhat makes something a correct interpretation of a work of literary\nfiction. This topic, which is connected to the issue of truth in fiction,\nbecame of intense interest to both philosophers and literary theorists\nfollowing the publication of Wimsatt and Beardsley’s “The\nIntentional Fallacy” (1946), although the topic of\ninterpretation itself has a long history going back as far as Greek\nantiquity (see the entry on\n hermeneutics).\n There are also problems involving our reasons for seeking out works of\nfiction of various kinds. The previous section discussed the so-called\nparadox of fiction, but as it turns out this is a relative newcomer to\nthe set of problems that involve our engagement with works of\nfiction. There is also the much-debated puzzle of why we enjoy works\nof tragedy (and even horror); sadness and fear are scarcely emotions\nthat we would normally welcome, let alone enjoy, yet people readily\nengage with works of tragedy. (The so-called paradox of tragedy\nreceived a famous treatment, still debated in contemporary philosophy,\nat the hands of Aristotle in the\nPoetics, who also used tragedy as an example of how we can\nlearn from fiction.)  A newer problem,\nalthough discussion goes back to at least Hume, is the so-called\nproblem of imaginative resistance: given the ease with which readers\nof fiction can entertain all kinds of implausible fictional scenarios,\neven impossible ones, what explains the impediments we face when asked\nto imagine certain sorts of situations, for example ones in which\nmorally horrendous acts like torturing an innocent person are\nconsidered morally right? (For an overview of these puzzles, see\n the supplement to the entry on\n imagination).\n Juxtaposing these\nvarious problems and issues not only gives a good indication of the\nthematic richness of contemporary philosophy of fiction, but also\nreminds us of its long history.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Aristotle, <em>Aristotle’s Poetics</em>, trans. Stephen\nHalliwell, 1998, Chicago: University of Chicago Press.",
                "Armour-Garb, Bradley and Woodbridge, James A., 2015, <em>Pretense\nand Pathology: Philosophical Fictionalism and its Applications</em>,\nCambridge: Cambridge University Press.",
                "Austen, Jane, 1813, <em>Pride and Prejudice</em>, London: T.\nEgerton.",
                "–––, 1815 [1841], <em>Emma: a Novel</em>,\nLondon: Richard Bentley, New Burlington Street.",
                "Bach, Kent and Robert M. Harnish, 1979, <em>Linguistic\nCommunication and Speech Acts</em>, Cambridge MA: MIT Press.",
                "Banfield, Ann, 1982, <em>Unspeakable Sentences: Narration and\nRepresentation in the Language of Fiction</em>, London: Routledge\n&amp; Kegan Paul.",
                "Beardsley, Monroe C., 1981, “Fiction as\nRepresentation”, <em>Synthese</em>, 46(3): 291–313.\ndoi:10.1007/BF01130042",
                "–––, 1958 [1980], <em>Aesthetics: Problems in\nthe Philosophy of Criticism</em>, New York: Harcourt, Brace, &amp;\nWorld. Second edition 1980, Indianapolis, IN: Hackett .",
                "Berkeley, George, <em>Three Dialogues Between Hylas and\nPhilonous</em>, ed. Robert Adams, Indianapolis: Hackett, 1979.",
                "Berto, Francesco, 2009, “Impossible Worlds”, <em>The\nStanford Encyclopedia of Philosophy</em> (Fall 2009 Edition), Edward\nN. Zalta (ed.). URL =\n &lt;<a href=\"http://plato.stanford.edu/archives/fall2009/entries/impossible-worlds/\" target=\"other\">http://plato.stanford.edu/archives/fall2009/entries/impossible-worlds/</a>&gt;",
                "–––, 2012, <em>Existence as a Real Property: The\nOntology of Meinongianism</em>, Dordrecht: Springer.\ndoi:10.1007/978-94-007-4207-9",
                "Blinova, Olga, 2012, “The Notion of Free Indirect Discourse\nand its Use in Contemporary Journalism”, <em>Humanities and\nSocial Sciences Review</em>, 01(02): 365–371.",
                "Bonomi, Andrea, 2008, “Fictional Contexts”, in\nP. Bouquet, L. Serafini, &amp; R. Thomason (eds.), <em>Perspectives on\nContext</em>, Stanford: CSLI Publications, pp. 213–48.",
                "Butler, Andrew C., Nancy A. Dennis, and Elizabeth J. Marsh, 2012,\n“Inferring Facts from Fiction: Reading Correct and Incorrect\nInformation Affects Memory for Related Information”,\n<em>Memory</em>, 20(5): 487–498.\ndoi:10.1080/09658211.2012.682067",
                "Byrne, Alex, 1993, “Truth in Fiction: The Story\nContinued”, <em>Australasian Journal of Philosophy</em>, 71(1):\n24–35. doi:10.1080/00048409312345022",
                "Capote, Truman, 1966, <em>In Cold Blood: A True Account of a\nMultiple Murder and Its Consequences</em>, New York: Penguin.",
                "Carroll, Noël, 1990, <em>The Philosophy of Horror or Paradoxes of\nthe Heart</em>, London: Routledge.",
                "–––, 1995, “Critical Study: On Kendall\nWalton’s <em>Mimesis as Make-Believe</em>”\n<em>Philosophical Quarterly</em>, 45(178): 93–99.\ndoi:10.2307/2219853",
                "–––, 2002, “The Wheel of Virtue: Art,\nLiterature, and Moral Knowledge”, <em>Journal of Aesthetics and\nArt Criticism</em>, 60(1): 3–23.",
                "–––, 2011, “Philosophical Insight,\nEmotion, and Popular Fiction: The Case of Sunset Boulevard”, in\n<em>Narrative, Emotion, and Insight</em>, edited by Noël Carroll and\nJohn Gibson, University Park, PA: The Pennsylvania State University\nPress, 45–68.",
                "–––, 2016, “A Critical Review of Derek\nMatravers’s <em>Fiction and Narrative</em>”,\n<em>Philosophy and Literature</em>, 40(2): 569–578.\ndoi:10.1353/phl.2016.0038",
                "Charlton, William, 1970, <em>Aesthetics</em>, London:\nHutchinson.",
                "–––, 1984, “Feeling for the\nFictitious”, <em>British Journal of Aesthetics</em>, 24(3):\n206–216. doi:10.1093/bjaesthetics/24.3.206",
                "Cohn, Dorrit, 1989, “Fictional versus Historical Lives:\nBorderlines and Borderline Cases”, <em>The Journal of Narrative\nTechnique</em>, 19(1): 3–24.",
                "–––, 1999, <em>The Distinction of Fiction</em>,\nBaltimore and London: The Johns Hopkins Press.",
                "Coleridge, Samuel Taylor, 1817 [1984], <em>Biographia Literaria;\nor Biographical Sketch of My Literary Life and Opinions</em>, London:\nRest Fenner. Reprinted 1985 as part of the <em>The Collected Works of\nSamuel Taylor Coleridge</em>, Volume 7, James Engell and W. Jackson\nBate (eds), Princeton: Princeton University Press.\n [<a href=\"http://archive.org/details/biographialitera00colerich\" target=\"other\">Coleridge 1817 available online</a>]",
                "Cooke, Janet, 1980, “Jimmy’s World”, <em>The\nWashington Post</em>, September 28, 1980.",
                "Cornwell, Patricia, 1990, <em>Post Mortem</em>, New York:\nScribner. [This is the first in Cornwell’s Scarpetta series of crime\nnovels.]",
                "Currie, Gregory, 1990, <em>The Nature of Fiction</em>, Cambridge:\nCambridge University Press. doi:10.1017/CBO9780511897498",
                "–––, 1995a, <em>Image and Mind: Film, Philosophy\nand Cognitive Science</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511551277",
                "–––, 1995b, “Unreliability Refigured:\nNarrative in Literature and Film”, <em>Journal of Aesthetics and\nArt Criticism</em>, 53(1): 19–29. doi:10.2307/431733",
                "–––, 1995c, “On Being Fictional”,\n<em>Journal of Aesthetics and Art Criticism</em>, 55(4):\n425–427. doi:10.2307/430932",
                "–––, 1997, “The Paradox of Caring: Fiction\nand the Philosophy of Mind”, in Hjort &amp; Laver 1997:\n63–77.",
                "–––, 1998, “Pretence, Pretending and\nMetarepresenting”, <em>Mind and Language</em>, 13(1):\n35–55. doi:10.1111/1468-0017.00064",
                "–––, 2010, <em>Narratives and Narrators: A\nPhilosophy of Stories</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199282609.001.0001",
                "–––, 2014, “Standing in the Last Ditch: On\nthe Communicative Intentions of Fiction Makers”, <em>Journal of\nAesthetics and Art Criticism</em>, 72(4): 351–363.\ndoi:10.1111/jaac.12109",
                "Davies, David, 1996, “Fictional Truth and Fictional\nAuthors”, <em>The British Journal of Aesthetics</em>, 36(1):\n43–55. doi:10.1093/bjaesthetics/36.1.43",
                "–––, 2001, “Fiction”, in <em>The\nRoutledge Companion to Aesthetics</em>, edited by Berys Nigel Gaut and\nDominic Lopes, London: Routledge, 263–724.",
                "–––, 2007, <em>Aesthetics and Literature</em>,\nLondon, New York: Continuum.",
                "–––, 2012, “Fictionality, Fictive\nUtterance, and the Assertive Author”, in <em>Mimesis:\nMetaphysics, Cognition, Pragmatics</em>, edited by Greg Currie, Petr\nKot’átko, and Martin Pokorný, London: College Publications,\n61–85.",
                "–––, 2015, “Fictive Utterance and the\nFictionality of Narratives and Works”, <em>British Journal of\nAesthetics</em>, 55(1): 39–55. doi:10.1093/aesthj/ayu061",
                "Deutsch, Harry, 2000, “Making Up Stories”, in\n<em>Empty Names, Fiction, and the Puzzles of Non-Existence</em>,\nedited by Thomas Hofweber and Anthony Everett, Stanford, CA: CSLI\nPublications, 17–36.",
                "–––, 2013, “Friend on Making Up\nStories”, <em>Proceedings of the Aristotelian Society</em>,\n113(3pt3): 365–370. doi:10.1111/j.1467-9264.2013.00358.x",
                "Diamond, Cora, 1993, “Martha Nussbaum and the Need for\nNovels”, <em>Philosophical Investigations</em> 16(2):\n128–153.",
                "Doyle, Arthur Conan, 1892, “The Adventure of the Speckled\nBand”, first published in <em>The Strand Magazine</em> in\nFebruary 1892. Collected in <em>The Adventures of Sherlock\nHolmes</em>, London: Newnes, 1892.",
                "–––, 1902, <em>The Hound of the\nBaskervilles</em>, London: Newnes. Originally serialized in <em>The\nStrand Magazine</em> from August 1901 to April 1902.",
                "–––, <em>The Complete Sherlock Holmes</em> (2\nVolumes), New York: Random House, 1986.",
                "Elgin, Catherine Z., 2007, “The Laboratory of the\nMind”, in John Gibson, Wolfgang Huemer, &amp; Luca Pocci\n(eds.), <em>A Sense of the World: Essays on Fiction, Narrative, and\nKnowledge</em>, New York: Routledge, pp. 43–54.",
                "Feagin, Susan, 1996, <em>Reading with Feeling: The Aesthetics of\nAppreciation</em>, Ithaca: Cornell University Press.",
                "Fish, Stanley E., 1980, <em>Is There a Text in This Class? The\nAuthority of Interpretive Communities</em>, Cambridge MA: Harvard\nUniversity Press.",
                "Fludernik, Monica, 1993, <em>The Fictions of Language and the\nLanguages of Fiction: The Linguistic Representation of Speech and\nConsciousness</em>, London: Routledge.",
                "Frey, James, 2003, <em>A Million Little Pieces</em>, New York:\nN.A. Talese/Doubleday.",
                "Friend, Stacie, 2006, “Narrating the Truth (More or\nLess)”, in <em>Knowing Art: Essays in Aesthetics and\nEpistemology</em>, edited by Matthew Kieran and Dominic McIver Lopes,\nDordrecht: Springer, 35–49. doi:10.1007/978-1-4020-5265-1_3",
                "–––, 2007, “Fictional Characters”,\n<em>Philosophy Compass</em>, 2(2): 141–156.\ndoi:10.1111/j.1747-9991.2007.00059.x",
                "–––, 2008, “Imagining Fact and\nFiction”, In <em>New Waves in Aesthetics</em>, edited by\nKathleen Stock and Katherine Thomson-Jones, New York: Palgrave\nMacmillan, 150–169.",
                "–––, 2011, “Fictive Utterance and\nImagining II”, <em>Proceedings of the Aristotelian Society\nSupplementary Volume</em>, 85(1): 163–180.\ndoi:10.1111/j.1467-8349.2011.00201.x",
                "–––, 2012, “VIII—Fiction as a\nGenre”, <em>Proceedings of the Aristotelian Society</em>,\n112(2pt2): 179–209. doi:10.1111/j.1467-9264.2012.00331.x",
                "–––, 2014, “Believing in Stories”,\nin <em>Aesthetics and the Sciences of Mind</em>, edited by Greg\nCurrie, Matthew Kieran, Aaron Meskin, and Jon Robson, Oxford: Oxford\nUniversity Press, 228–248.\ndoi:10.1093/acprof:oso/9780199669639.003.0012",
                "–––, 2017, “The Real Foundation of\nFictional Worlds”, <em>Australasian Journal of Philosophy</em>,\n95(1): 29–42. doi:10.1080/00048402.2016.1149736",
                "–––, forthcoming, <em>Matters of Fact and\nFiction</em>, Oxford: Oxford University Press.",
                "Gallagher, Catherine, 2006, “The Rise of\nFictionality”, in <em>The Novel</em>, 2 volumes, Franco Moretti\n(ed.), Princeton: Princeton University Press, Vol. 1,\n336–363.",
                "García-Carpintero, Manuel, 2013, “Norms of\nFiction-Making”, <em>British Journal of Aesthetics</em>, 53(3):\n339–357. doi:10.1093/aesthj/ayt021",
                "Gaskell, Elizabeth Cleghorn, 1848 [1996], <em>Mary Barton: A Tale\nof Manchester Life</em>, new edition. London and New York: Penguin\nClassics.",
                "Gaut, Berys, 2005, “Art and Knowledge”, in Levinson\n2005: 436–450. ",
                "Gendler, Tamar Szabó, 2000, “The Puzzle of Imaginative\nResistance”, <em>Journal of Philosophy</em>, 97(2): 55–81.\ndoi:10.2307/2678446",
                "–––, 2008, “Alief in Action (and\nReaction)”, <em>Mind and Language</em>, 23(5): 552–585.\ndoi:10.1111/j.1468-0017.2008.00352.x",
                "Gendler, Tamar Szabó, and Karen Kovakovich, 2006, “Genuine\nRational Fictional Emotions”, in Kieran 2006:\n241–253.",
                "Genette, Gérard, 1990, “Fictional Narrative, Factual\nNarrative”, <em>Poetics Today</em>, 11(4): 755–774.\ndoi:10.2307/1773076",
                "Gerrig, Richard J., 1993, <em>Experiencing Narrative Worlds: On\nthe Psychological Activities of Reading</em>, New Haven, CT: Yale\nUniversity Press.",
                "Gibson, John, 2007, <em>Fiction and the Weave of Life</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199299522.001.0001",
                "Goodman, Nelson, 1978, <em>Ways of Worldmaking</em>, Indianapolis:\nHackett.",
                "Green, Melanie, and Timotyh C. Brock, 2000, “The Role of\nTransportation in the Persuasiveness of Public\nNarrative”, <em>Journal of Personality and Social\nPsychology</em> 79(5): 701–21.",
                "Grice, H. Paul, 1957, “Meaning”, <em>Philosophical\nReview</em>, 66(3): 377–388. doi:10.2307/2182440",
                "Hamburger, Käte, 1957 [1973], <em>Die Logik der Dichtung</em>,\nStuttgart: E. Klett, second edition in 1968. Translated by Marilynn J.\nRose as <em>The Logic of Literature</em>, Bloomington: Indiana\nUniversity Press, 1973.",
                "Hanley, Richard, 2004, “As Good As It Gets: Lewis on Truth\nin Fiction”, <em>Australasian Journal of Philosophy</em>, 82(1):\n112–128. doi:10.1080/713659790",
                "Harold, James, 2016, “Literary Cognitivism”, in\n<em>Routledge Companion to the Philosophy of Literature</em>, edited\nby Noël Carroll and John Gibson, London: Routledge,\n382–393.",
                "Harris, Paul L., 2000, <em>The Work of the Imagination</em>,\nMalden, MA: Wiley-Blackwell.",
                "Hjort, Mette and Sue Laver (eds), 1997, <em>Emotion and the\nArts</em>, New York and Oxford: Oxford University Press.",
                "Howard-Snyder, Frances, 2002, “Truth in Fiction: the Whole\nStory”, in <em>Realism and Anti-Realism</em>, edited by William\nAlston, Ithaca, NY: Cornell University Press, 253–279.",
                "Jago, Mark, 2014, <em>The Impossible. An Essay on\nHyperintensionality</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198709008.001.0001",
                "James, Henry, 1881 [2009], <em>The Portrait of a Lady</em>, edited\nby Roger Luckhurst, reprint edition, Oxford: Oxford University\nPress.",
                "John, Eileen, 1998, “Reading Fiction and Conceptual\nKnowledge: Philosophical Thought in Literary\nContext”, <em>Journal of Aesthetics and Art Criticism</em>,\n56(4): 331–348.",
                "Johnson, S., 1765, <em>Preface to the Plays of William\nShakespeare</em>, London.",
                "Johnson-Laird, Philip N., 1983, <em>Mental Models: Towards a\nCognitive Science of Language, Inference, and Consciousness</em>,\nCambridge, MA: Harvard University Press.",
                "Kieran, Matthew, 1996, “Art, Imagination, and the\nCultivation of Morals”, <em>Journal of Aesthetics and Art\nCriticism</em>, 54(4): 337–351. doi:10.2307/431916",
                "–––, 2004, <em>Revealing Art</em>, London:\nRoutledge.",
                "––– (ed.), 2006, <em>Contemporary Debates in\nAesthetics and the Philosophy of Art</em>, Oxford: Blackwell.",
                "Kivy, Peter, 1997, “The Laboratory of Fictional\nTruth”, in <em>Philosophies of Arts: An Essay in\nDifferences</em>, New York: Cambridge University Press,\n120–139.",
                "–––, 2011, <em>Once-Told Tales: An Essay in\nLiterary Aesthetics</em>, Malden, MA: Wiley-Blackwell.",
                "Kripke, Saul A., 2013, <em>Reference and Existence: The John Locke\nLectures</em>, Oxford: Oxford University Press. Lectures given in\n1973. doi:10.1093/acprof:oso/9780199928385.001.0001 ",
                "Kung, Peter, 2016, “You Really Do Imagine It: Against Error\nTheories of Imagination”, <em>Noûs;</em>, 50:\n90–120.",
                "Lamarque, Peter, 1981, “How Can We Fear and Pity\nFictions?” <em>British Journal of Aesthetics</em>, 21(4):\n291–304. doi:10.1093/bjaesthetics/21.4.291",
                "–––, 2014, <em>The Opacity of Narrative</em>,\nLondon: Rowman and Littlefield International.",
                "–––, 2016, “Review of <em>Fiction and\nNarrative</em> by Derek Matravers”, <em>Mind</em>, 125(498):\n\n616–619. doi:10.1093/mind/fzw011",
                "Lamarque, Peter and Stein Haugom Olsen, 1994, <em>Truth, Fiction,\nand Literature: A Philosophical Perspective</em>, Oxford: Clarendon\nPress. doi:10.1093/acprof:oso/9780198236818.001.0001",
                "Landy, Joshua. 2012, <em>How to Do Things with Fictions</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195188561.001.0001",
                "Lejeune, Philippe, 1977, “Autobiography in the Third\nPerson”, translated by Annette Tomarken and Edward Tomarken,\n\n<em>New Literary History</em>, 9(1): 27–50.\ndoi:10.2307/468435",
                "Le Poidevin, Robin, 1995, “Worlds within Worlds? The\nParadoxes of Embedded Fiction”, <em>The British Journal of\nAesthetics</em>, 35(3): 227–238.\ndoi:10.1093/bjaesthetics/35.3.227",
                "Leslie, Alan M., 1987, “Pretense and Representation: The\nOrigins of ‘Theory of Mind”,’ <em>Psychological\nReview</em>, 94 (4): 412–426.",
                "Levinson, Jerrold, 1997, “Emotion in Response to Art: A\nSurvey of the Terrain”, in Hjort &amp; Laver (1997),\npp. 20–34.",
                "–––, 2005, <em>The Oxford Handbook of\nAesthetics</em>, New York: Oxford University Press.",
                "Levinstein, Ben, 2007, “Facts, Interpretation and Truth in\nFiction”, <em>The British Journal of Aesthetics</em>, 47(1):\n64–75. doi:10.1093/aesthj/ayl039",
                "Lewis, David, 1973, <em>Counterfactuals</em>, Oxford: Basil\nBlackwell.",
                "–––, 1978 [1983], “Truth in\nFiction”, <em>American Philosophical Quarterly</em>, 15(1):\n37–46. Reprinted with postscripts in Lewis 1983: 261–280.\ndoi:10.1093/0195032047.003.0015",
                "–––, 1983, <em>Philosophical Papers</em>, volume\n1, Oxford: Oxford University Press. ",
                "–––, 1986, <em>On The Plurality of Worlds</em>,\nOxford: Blackwell.",
                "–––, 2004, “Letters to Beall and\nPriest”, in G. Priest, J.C. Beall, &amp; B. Armour-Garb\n(eds.), <em>The Law of Non-Contradiction: New Philosophical\nEssays</em>, Oxford: Oxford University Press.",
                "–––, 2005, “Quasi-realism is\nFictionalism”, in M.E. Kalderon (ed.), <em>Fictionalism in\nMetaphysics</em>, Oxford: Oxford University Press,\npp. 314–321.",
                "Lillard, Angeline, 2001, “Pretend Play as Twin Earth: A\nSocial-Cognitive Analysis”, <em>Developmental Review</em>, 21:\n495–531.",
                "Livingston, Paisley, 2005, <em>Art and Intention: A Philosophical\nStudy</em>, Oxford: Oxford University Press.",
                "Ludwig, Emil, 1925 [1927], <em>Napoleon</em>, Berlin: E. Rowohlt.\nTranslated by Eden and Cedar Paul, London: Allen &amp; Unwin.\n [<a href=\"http://archive.org/details/Napoleon_539\" target=\"other\">Ludwig 1927 available online</a>]",
                "Macaulay, Thomas Babington, 1906, <em>History of England from the\nAccession of James II</em>, London: Dent.",
                "Mailer, Norman, 1979, <em>The Executioner’s Song</em>,\nBoston: Little, Brown, &amp; Co.",
                "Mantel, Hilary, 2009, <em>Wolf Hall</em>, London: Fourth\nEstate.",
                "Matravers, Derek, 1995, “Beliefs and Fictional\nNarrators”, <em>Analysis</em>, 55(2): 121–122.\ndoi:10.1093/analys/55.2.121",
                "–––, 2014, <em>Fiction and Narrative</em>, New\nYork/Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199647019.001.0001",
                "McCormick, Peter, 1988, <em>Fictions, Philosophies, and the\nProblems of Poetics</em>, Ithaca: Cornell University Press.",
                "Meini, Cristina and Voltolini, Alberto, 2010, “How Pretence\nCan Really Be Metarepresentational”, <em>Mind and Society</em>,\n9(1): 31–58. doi:10.1007/s11299-009-0068-z",
                "Mikkonen, Jukka, 2013, <em>The Cognitive Value of Philosophical\nFiction</em>, London: Bloomsbury.",
                "Moran, Richard, 1994, “The Expression of Feeling in\nImagination”, <em>Philosophical Review</em>, 103(1):\n75–106. doi:10.2307/2185873",
                "Morris, E., 1999, <em>Dutch: A Memoir of Ronald Reagan</em>, New\nYork: Random House.",
                "Nabokov, Vladimir Vladimirovich, 1962, <em>Pale Fire: A\nNovel</em>, New York: G.P. Putnam’s Sons.",
                "Nadel, George H., 1964, “Philosophy of History before\nHistoricism”, <em>History and Theory</em>, 3(3): 291–315.\ndoi:10.2307/2504234 ",
                "Neill, Alex, 1993, “Fiction and the Emotions”,\n<em>American Philosophical Quarterly</em>, 30(1): 1–13.",
                "–––, 2005, “Art and Emotion”, in\nLevinson 2005: 421–435.",
                "Nelson, William, 1973, <em>Fact or Fiction: The Dilemma of the\nRenaissance Storyteller</em>, Cambridge, MA: Harvard University\nPress.",
                "Nichols, Shaun, 2006, “Just the Imagination: Why Imagining\nDoesn’t Behave Like Believing”, <em>Mind &amp;\nLanguage</em>, 21(4): 459–474.\ndoi:10.1111/j.1468-0017.2006.00286.x",
                "Nichols, Shaun and Stephen Stich, 2003, <em>Mindreading: an\nIntegrated Account of Pretence, Self-Awareness, and Understanding of\nOther Minds</em>, Oxford: Oxford University Press.\ndoi:10.1093/0198236107.001.0001",
                "Nolan, Daniel, 1997, “Impossible Worlds: A Modest\nApproach”, <em>Notre Dame Journal of Formal Logic</em>, 38(4):\n535–572. doi:10.1305/ndjfl/1039540769",
                "–––, 2007, “A Consistent Reading of\nSylvan’s Box”, <em>Philosophical Quarterly</em>, 67(229):\n667–673. doi:10.1111/j.1467-9213.2007.501.x",
                "–––, 2015, “Personification and Impossible\nFictions”, <em>British Journal of Aesthetics</em>, 55(1):\n57–69. doi:10.1093/aesthj/ayt053",
                "Novitz, David, 1987, <em>Knowledge, Fiction, and Imagination</em>, Philadelphia: Temple University Press.",
                "Nussbaum, Martha C., 1985, “‘Finely Aware and Richly Responsible’: Moral Attention and the Moral Task of Literature”, <em>Journal of Philosophy</em>, 82(10): 516–529.\ndoi:10.2307/2026358",
                "–––, 1990, <em>Love’s Knowledge: Essays on\nPhilosophy and Literature</em>, New York: Oxford University\nPress.",
                "–––, 2001, <em>The Fragility of Goodness: Luck and Ethics in Greek Tragedy and Philosophy</em> (revised edition), New York: Cambridge University Press.",
                "Pavel, Thomas, 1986, <em>Fictional Worlds</em>, Cambridge MA:\nHarvard University Press.",
                "Perner, Josef, 1991, <em>Understanding the Representational\nMind</em>, Cambridge MA: MIT Press.",
                "Phillips, John F., 1999, “Truth and Inference in\nFiction”, <em>Philosophical Studies</em>, 94(3): 273–293.\ndoi:10.1023/A:1004239709212",
                "Plato, <em>Plato’s Republic</em>, trans. G.M.A. Grube, 1974,\nIndianapolis: Hackett Pub. Co.",
                "Predelli, Stefano, 2001, “Names and Character”,\n<em>Philosophical Studies</em>, 103(2): 145–163.\ndoi:10.1023/A:1010312322444",
                "–––, 2005, <em>Contexts. Meaning, Truth, and the\nUse of Language</em>, Oxford: Oxford University Press.",
                "–––, 2008, “Modal Monsters and Talk about\nFiction”, <em>Journal of Philosophical Logic</em>, 37:\n277–297.",
                "–––, 2019, “Determination and Uniformity:\nThe Problem with Speech-Act Theories of\nFiction”, <em>Erkenntnis</em>, 84(2):\n309–324x. doi:10.1007/s10670-017-9959-2",
                "Prentice, Deborah A. and Richard. J. Gerrig, 1999,\n“Exploring the Boundary between Fiction and Reality”, in\n<em>Dual-Process Theories in Social Psychology</em>, edited by S.\nChaiken and Y. Trope, New York: Guilford Press, 529–546.",
                "Prescott, William, 2005, <em>History of the Conquest of Peru</em>,\nMineola, NY: Dover Publications.",
                "Priest, Graham, 1997, “Sylvan’s Box: A Short Story and\nTen Morals”, <em>Notre Dame Journal of Formal Logic</em>, 38(4):\n573–583. doi:10.1305/ndjfl/1039540770",
                "–––, 2000, “Could Everything be\nTrue?” <em>Australasian Journal of Philosophy</em>, 78(2):\n189–195. doi:10.1080/00048400012349471",
                "–––, 2005, <em>Towards Non-Being: the Logic and\nMetaphysics of Intentionality</em>, Oxford: Oxford University Press.\nSecond expanded edition, 2016.\ndoi:10.1093/acprof:oso/9780198783596.001.0001 ",
                "Proudfoot, Diane, 2006, “Possible Worlds Semantics and\nFiction”, <em>Journal of Philosophical Logic</em>, 35(1):\n9–40. doi:10.1007/s10992-005-9005-8",
                "Putnam, Hilary, 1978, “Literature, Science and\nReflection”, in Putnam <em>Meaning and the Moral Sciences</em>,\nLondon: Routledge &amp; Kegan Paul, pp. 83–94.",
                "Radford, Colin, 1975, “How Can We Be Moved by the Fate of\nAnna Karenina?”, <em>Proceedings of the Aristotelian\nSociety</em>, 49: 67–80.\ndoi:10.1093/aristoteliansupp/49.1.67",
                "Recanati, François, 2000, <em>Oratio Obliqua, Oratio Recta: An\nEssay on Metarepresentation</em>, Cambridge MA: The MIT Press.",
                "Robinson, Jenefer M., 1985, “Style and Personality in the\nLiterary Work”, <em>Philosophical Review</em>, 94(2):\n147–158. doi:10.2307/2185429 ",
                "–––, 1995 [1997], “<em>L’Education\nSentimentale</em>”, <em>Australasian Journal of Philosophy</em>,\n73(2): 212–226. Reprinted in <em>Art and its Messages: Meaning,\nMorality, and Society</em>, edited by Stephen Davies, University Park,\nPA: Pennsylvania State University Press, 1997: 34–48.\ndoi:10.1080/00048409512346551",
                "Ross, Jeff, 1997, <em>The Semantics of Media</em>, Dordrecht:\nKluwer.",
                "Rowe, M.W., 1997, “Lamarque and Olsen on Literature and\nTruth”, <em>Philosophical Quarterly</em>, 47(188):\n322–341. doi:10.1111/1467-9213.00062",
                "Sainsbury, Mark, 2010, <em>Fiction and Fictionalism</em>, London:\nRoutledge.",
                "Schaper, Eva, 1978, “Fiction and the Suspension of\nDisbelief”, <em>British Journal of Aesthetics</em>, 18(1):\n31–44. doi:10.1093/bjaesthetics/18.1.31",
                "Searle, John R., 1975, “The Logical Status of Fictional\nDiscourse”, <em>New Literary History</em>, 6(2): 319–332.\ndoi:10.2307/468422.",
                "Sinclair, Upton, 1985, <em>The Jungle</em>, New York: Penguin\nBooks.",
                "Smith, Murray, 1995, “Film Spectatorship and the Institution\nof Fiction”, <em>Journal of Aesthetics and Art Criticism</em>,\n53(2): 113–127. doi:10.2307/431540",
                "Stalnaker, Robert, 1968, “A Theory of Conditionals”,\nin <em>Studies in Logical Theory</em>, edited by Nicholas Rescher,\nOxford: Blackwell, 98–112.",
                "Stecker, Robert, 2011, “Should We Still Care about the\nParadox of Fiction”, <em>British Journal of Aesthetics</em>, 51:\n295–308.",
                "Stock, Kathleen, 2011, “Fictive Utterance and\nImagining”, <em>Aristotelian Society Supplementary Volume</em>,\n85(1): 145–161. doi:10.1111/j.1467-8349.2011.00200.x",
                "–––, 2016, “Imagination and\nFiction”, in <em>Routledge Handbook of Philosophy of\nImagination</em>, edited by Amy Kind, (Routledge Handbooks in\nPhilosophy), Abingdon: Routledge, 204–216.",
                "–––, 2017, <em>Only Imagine: Fiction,\nInterpretation and Imagination</em>, Oxford: Oxford University\nPress.",
                "Stolnitz, Jerome, 1992, “On the Cognitive Triviality of\nArt”, <em>British Journal of Aesthetics</em>, 32(3):\n191–200.",
                "Stowe, Harriet Beecher, 1969, <em>Uncle Tom’s Cabin</em>,\nColumbus, OH: C.E. Merrill Pub. Co.",
                "Styron, William, 1967, <em>The Confessions of Nat Turner</em>, New\nYork: Random House.",
                "Swirski, Peter, 2007, <em>Of Literature and Knowledge:\nExplorations in Narrative Thought Experiments, Evolution and Game\nTheory</em>, London: Routledge.",
                "–––, 2014, “Did Sherlock Holmes Inhale Pipe Smoke\nThrough a Hole in his Forehead?” in <em>Realism, Science, and\nPragmatism</em>, edited by Kenneth R. Westphal, New York: Routledge,\n115–136. ",
                "Tacitus, Cornelius, <em>The Complete Works of Tacitus: The Annals;\nThe History; The Life of Cnaeus Julius Agricola; Germany and its\nTribes; A Dialogues on Oratory</em>, trans. Alfred John Church and\nWilliam Jackson Brodribb, 1942, edited and with an introduction by\nMoses Hadas, New York: The Modern Library.",
                "Tolstoy, Leo, 1867 [2017], <em>War and Peace</em>, trans. Anthony Briggs,\nLondon: Penguin Random House.",
                "–––, 1877 [2001], <em>Anna Krenina: A Novel in\nEight Parts</em>, trans. Richard Pevear and Larissa Volokhonsky, New\nYork: Viking.",
                "Vaihinger, Hans, 1911 [1924], <em>The Philosophy of ‘As\nIf’</em>, trans. C.K. Ogden, London: Kegan Paul. First published\nin German as <em>Die Philosophie des Als Ob</em>, Berlin: Verlag von\nReuther &amp; Reichard.",
                "Vidal, Gore, 1984, <em>Lincoln</em>, New York: Penguin Random\nHouse.",
                "Voltolini, Alberto, 2016, “The Nature of Fiction/al\nUtterances”, <em>Kairos</em>, 17(1): 28–55.\ndoi:10.1515/kjps-2016-0016",
                "Walton, Kendall L., 1970, “Categories of Art”,\n<em>Philosophical Review</em>, 79(3): 334–67.\ndoi:10.2307/2183933 ",
                "–––, 1978, “How Remote are Fictional\nWorlds from the Real World?” <em>The Journal of Aesthetics and\nArt Criticism</em>, 37(1): 11–23.",
                "–––, 1978, “Fearing Fictions”,\n<em>The Journal of Philosophy</em>, 75(1): 5–25.\ndoi:10.2307/2025831",
                "–––, 1990, <em>Mimesis as Make-Believe: On the\nFoundations of the Representational Arts</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "–––, 1993, “Metaphor and Prop Oriented\nMake-Believe”, <em>European Journal of Philosophy</em>, 1(1):\n39–57. doi:10.1111/j.1468-0378.1993.tb00023.x",
                "–––, 1997, “Spelunking, Simulation, and\nSlime”, in Hjort &amp; Laver 1997: 37–49.",
                "–––, 2013, “Fictionality and Imagination\nReconsidered”, in <em>From Fictionalism to Realism</em>, edited\nby Carola Barbero, Maurizio Ferraris and Alberto Voltolini, Cambridge:\nCambridge Scholars Publishing, 9–24.",
                "–––, 2015, “Fictionality and\nImagination—Mind the Gap”, in <em>In Other Shoes: Music,\nMetaphor, Empathy, Existence</em>, Oxford, New York: Oxford University\nPress, 17–35.",
                "Walsh, Richard, 2007, <em>The Rhetoric of Fictionality: Narrative\nTheory and the Idea of Fiction</em>, Columbus: The Ohio State\nUniversity Press.",
                "Wheeler, Christian, Melanie C. Green, and Timothy C. Brock, 1999,\n“Fictional Narratives Change Beliefs: Replications of Prentice,\nGerrig, and Bailis (1997) with Mixed Corroboration”,\n<em>Psychonomic Bulletin &amp; Review</em>, 6(1): 136–141.\ndoi:10.3758/BF03210821",
                "Wimsatt Jr, William K. and Monroe C. Beardsley, 1946, “The\nIntentional Fallacy”, <em>The Sewanee Review</em>, 54(3):\n468–488.",
                "Wolterstorff, Nicholas, 1980, <em>Worlds and Works of Art</em>,\nOxford: Clarendon Press.",
                "Woods, John, 1974, <em>The Logic of Fiction: A Philosophical\nSounding of Deviant Logic</em>, The Hague: Mouton.",
                "–––, 2003, <em>Paradox and Paraconsistency.\nConflict Resolution in the Abstract Sciences</em>, Cambridge:\nCambridge University Press. doi:10.1017/CBO9780511614002",
                "–––, 2006, “Fictions and their\nLogic”, in <em>Philosophy of Logic</em>, edited by Dale\nJacquette, Amsterdam: Elsevier, 1061–1126.\ndoi:10.1016/B978-044451541-4/50028-2",
                "–––, 2018, <em>Truth in Fiction: Rethinking its\nLogic</em>, Dordrecht: Springer.",
                "Woodward, Richard, 2011, “Truth in Fiction”,\n<em>Philosophy Compass</em>, 6(3): 158–167.\ndoi:10.1111/j.1747-9991.2010.00367.x",
                "Yablo, Stephen, 1999, “Review: The Strange Thing About the\nFigure in the Bathhouse. Amie L. Thomasson, <em>Fiction and\nMetaphysics</em>”, <em>Times Literary Supplement</em>, November\n5, 1999, issue 5040, page 26.",
                "Yanal, Robert J., 1994, “The Paradox of Emotion and\nFiction”, <em>Pacific Philosophical Quarterly</em>, 75(1):\n54–75. doi:10.1111/j.1468-0114.1994.tb00120.x",
                "Young, James O., 2008, “Literature, Representation, and\nKnowledge”, in <em>Contemporary Readings in the Philosophy of\nLiterature: An Analytic Approach</em>, edited by David Davies and Carl\nMatheson, Peterborough, Ont.: Broadview, 359–376.",
                "Zalta, Edward N., 1988, <em>Intensional Logic and the Metaphysics\nof Intentionality</em>, Cambridge, MA: The MIT Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Aristotle, <em>Aristotle’s Poetics</em>, trans. Stephen\nHalliwell, 1998, Chicago: University of Chicago Press.</li>\n<li>Armour-Garb, Bradley and Woodbridge, James A., 2015, <em>Pretense\nand Pathology: Philosophical Fictionalism and its Applications</em>,\nCambridge: Cambridge University Press.</li>\n<li>Austen, Jane, 1813, <em>Pride and Prejudice</em>, London: T.\nEgerton.</li>\n<li>–––, 1815 [1841], <em>Emma: a Novel</em>,\nLondon: Richard Bentley, New Burlington Street.</li>\n<li>Bach, Kent and Robert M. Harnish, 1979, <em>Linguistic\nCommunication and Speech Acts</em>, Cambridge MA: MIT Press.</li>\n<li>Banfield, Ann, 1982, <em>Unspeakable Sentences: Narration and\nRepresentation in the Language of Fiction</em>, London: Routledge\n&amp; Kegan Paul.</li>\n<li>Beardsley, Monroe C., 1981, “Fiction as\nRepresentation”, <em>Synthese</em>, 46(3): 291–313.\ndoi:10.1007/BF01130042</li>\n<li>–––, 1958 [1980], <em>Aesthetics: Problems in\nthe Philosophy of Criticism</em>, New York: Harcourt, Brace, &amp;\nWorld. Second edition 1980, Indianapolis, IN: Hackett .</li>\n<li>Berkeley, George, <em>Three Dialogues Between Hylas and\nPhilonous</em>, ed. Robert Adams, Indianapolis: Hackett, 1979.</li>\n<li>Berto, Francesco, 2009, “Impossible Worlds”, <em>The\nStanford Encyclopedia of Philosophy</em> (Fall 2009 Edition), Edward\nN. Zalta (ed.). URL =\n &lt;<a href=\"http://plato.stanford.edu/archives/fall2009/entries/impossible-worlds/\" target=\"other\">http://plato.stanford.edu/archives/fall2009/entries/impossible-worlds/</a>&gt;</li>\n<li>–––, 2012, <em>Existence as a Real Property: The\nOntology of Meinongianism</em>, Dordrecht: Springer.\ndoi:10.1007/978-94-007-4207-9</li>\n<li>Blinova, Olga, 2012, “The Notion of Free Indirect Discourse\nand its Use in Contemporary Journalism”, <em>Humanities and\nSocial Sciences Review</em>, 01(02): 365–371.</li>\n<li>Bonomi, Andrea, 2008, “Fictional Contexts”, in\nP. Bouquet, L. Serafini, &amp; R. Thomason (eds.), <em>Perspectives on\nContext</em>, Stanford: CSLI Publications, pp. 213–48.</li>\n<li>Butler, Andrew C., Nancy A. Dennis, and Elizabeth J. Marsh, 2012,\n“Inferring Facts from Fiction: Reading Correct and Incorrect\nInformation Affects Memory for Related Information”,\n<em>Memory</em>, 20(5): 487–498.\ndoi:10.1080/09658211.2012.682067</li>\n<li>Byrne, Alex, 1993, “Truth in Fiction: The Story\nContinued”, <em>Australasian Journal of Philosophy</em>, 71(1):\n24–35. doi:10.1080/00048409312345022</li>\n<li>Capote, Truman, 1966, <em>In Cold Blood: A True Account of a\nMultiple Murder and Its Consequences</em>, New York: Penguin.</li>\n<li>Carroll, Noël, 1990, <em>The Philosophy of Horror or Paradoxes of\nthe Heart</em>, London: Routledge.</li>\n<li>–––, 1995, “Critical Study: On Kendall\nWalton’s <em>Mimesis as Make-Believe</em>”\n<em>Philosophical Quarterly</em>, 45(178): 93–99.\ndoi:10.2307/2219853</li>\n<li>–––, 2002, “The Wheel of Virtue: Art,\nLiterature, and Moral Knowledge”, <em>Journal of Aesthetics and\nArt Criticism</em>, 60(1): 3–23.</li>\n<li>–––, 2011, “Philosophical Insight,\nEmotion, and Popular Fiction: The Case of Sunset Boulevard”, in\n<em>Narrative, Emotion, and Insight</em>, edited by Noël Carroll and\nJohn Gibson, University Park, PA: The Pennsylvania State University\nPress, 45–68.</li>\n<li>–––, 2016, “A Critical Review of Derek\nMatravers’s <em>Fiction and Narrative</em>”,\n<em>Philosophy and Literature</em>, 40(2): 569–578.\ndoi:10.1353/phl.2016.0038</li>\n<li>Charlton, William, 1970, <em>Aesthetics</em>, London:\nHutchinson.</li>\n<li>–––, 1984, “Feeling for the\nFictitious”, <em>British Journal of Aesthetics</em>, 24(3):\n206–216. doi:10.1093/bjaesthetics/24.3.206</li>\n<li>Cohn, Dorrit, 1989, “Fictional versus Historical Lives:\nBorderlines and Borderline Cases”, <em>The Journal of Narrative\nTechnique</em>, 19(1): 3–24.</li>\n<li>–––, 1999, <em>The Distinction of Fiction</em>,\nBaltimore and London: The Johns Hopkins Press.</li>\n<li>Coleridge, Samuel Taylor, 1817 [1984], <em>Biographia Literaria;\nor Biographical Sketch of My Literary Life and Opinions</em>, London:\nRest Fenner. Reprinted 1985 as part of the <em>The Collected Works of\nSamuel Taylor Coleridge</em>, Volume 7, James Engell and W. Jackson\nBate (eds), Princeton: Princeton University Press.\n [<a href=\"http://archive.org/details/biographialitera00colerich\" target=\"other\">Coleridge 1817 available online</a>]</li>\n<li>Cooke, Janet, 1980, “Jimmy’s World”, <em>The\nWashington Post</em>, September 28, 1980.</li>\n<li>Cornwell, Patricia, 1990, <em>Post Mortem</em>, New York:\nScribner. [This is the first in Cornwell’s Scarpetta series of crime\nnovels.]</li>\n<li>Currie, Gregory, 1990, <em>The Nature of Fiction</em>, Cambridge:\nCambridge University Press. doi:10.1017/CBO9780511897498</li>\n<li>–––, 1995a, <em>Image and Mind: Film, Philosophy\nand Cognitive Science</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511551277</li>\n<li>–––, 1995b, “Unreliability Refigured:\nNarrative in Literature and Film”, <em>Journal of Aesthetics and\nArt Criticism</em>, 53(1): 19–29. doi:10.2307/431733</li>\n<li>–––, 1995c, “On Being Fictional”,\n<em>Journal of Aesthetics and Art Criticism</em>, 55(4):\n425–427. doi:10.2307/430932</li>\n<li>–––, 1997, “The Paradox of Caring: Fiction\nand the Philosophy of Mind”, in Hjort &amp; Laver 1997:\n63–77.</li>\n<li>–––, 1998, “Pretence, Pretending and\nMetarepresenting”, <em>Mind and Language</em>, 13(1):\n35–55. doi:10.1111/1468-0017.00064</li>\n<li>–––, 2010, <em>Narratives and Narrators: A\nPhilosophy of Stories</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199282609.001.0001</li>\n<li>–––, 2014, “Standing in the Last Ditch: On\nthe Communicative Intentions of Fiction Makers”, <em>Journal of\nAesthetics and Art Criticism</em>, 72(4): 351–363.\ndoi:10.1111/jaac.12109</li>\n<li>Davies, David, 1996, “Fictional Truth and Fictional\nAuthors”, <em>The British Journal of Aesthetics</em>, 36(1):\n43–55. doi:10.1093/bjaesthetics/36.1.43</li>\n<li>–––, 2001, “Fiction”, in <em>The\nRoutledge Companion to Aesthetics</em>, edited by Berys Nigel Gaut and\nDominic Lopes, London: Routledge, 263–724.</li>\n<li>–––, 2007, <em>Aesthetics and Literature</em>,\nLondon, New York: Continuum.</li>\n<li>–––, 2012, “Fictionality, Fictive\nUtterance, and the Assertive Author”, in <em>Mimesis:\nMetaphysics, Cognition, Pragmatics</em>, edited by Greg Currie, Petr\nKot’átko, and Martin Pokorný, London: College Publications,\n61–85.</li>\n<li>–––, 2015, “Fictive Utterance and the\nFictionality of Narratives and Works”, <em>British Journal of\nAesthetics</em>, 55(1): 39–55. doi:10.1093/aesthj/ayu061</li>\n<li>Deutsch, Harry, 2000, “Making Up Stories”, in\n<em>Empty Names, Fiction, and the Puzzles of Non-Existence</em>,\nedited by Thomas Hofweber and Anthony Everett, Stanford, CA: CSLI\nPublications, 17–36.</li>\n<li>–––, 2013, “Friend on Making Up\nStories”, <em>Proceedings of the Aristotelian Society</em>,\n113(3pt3): 365–370. doi:10.1111/j.1467-9264.2013.00358.x</li>\n<li>Diamond, Cora, 1993, “Martha Nussbaum and the Need for\nNovels”, <em>Philosophical Investigations</em> 16(2):\n128–153.</li>\n<li>Doyle, Arthur Conan, 1892, “The Adventure of the Speckled\nBand”, first published in <em>The Strand Magazine</em> in\nFebruary 1892. Collected in <em>The Adventures of Sherlock\nHolmes</em>, London: Newnes, 1892.</li>\n<li>–––, 1902, <em>The Hound of the\nBaskervilles</em>, London: Newnes. Originally serialized in <em>The\nStrand Magazine</em> from August 1901 to April 1902.</li>\n<li>–––, <em>The Complete Sherlock Holmes</em> (2\nVolumes), New York: Random House, 1986.</li>\n<li>Elgin, Catherine Z., 2007, “The Laboratory of the\nMind”, in John Gibson, Wolfgang Huemer, &amp; Luca Pocci\n(eds.), <em>A Sense of the World: Essays on Fiction, Narrative, and\nKnowledge</em>, New York: Routledge, pp. 43–54.</li>\n<li>Feagin, Susan, 1996, <em>Reading with Feeling: The Aesthetics of\nAppreciation</em>, Ithaca: Cornell University Press.</li>\n<li>Fish, Stanley E., 1980, <em>Is There a Text in This Class? The\nAuthority of Interpretive Communities</em>, Cambridge MA: Harvard\nUniversity Press.</li>\n<li>Fludernik, Monica, 1993, <em>The Fictions of Language and the\nLanguages of Fiction: The Linguistic Representation of Speech and\nConsciousness</em>, London: Routledge.</li>\n<li>Frey, James, 2003, <em>A Million Little Pieces</em>, New York:\nN.A. Talese/Doubleday.</li>\n<li>Friend, Stacie, 2006, “Narrating the Truth (More or\nLess)”, in <em>Knowing Art: Essays in Aesthetics and\nEpistemology</em>, edited by Matthew Kieran and Dominic McIver Lopes,\nDordrecht: Springer, 35–49. doi:10.1007/978-1-4020-5265-1_3</li>\n<li>–––, 2007, “Fictional Characters”,\n<em>Philosophy Compass</em>, 2(2): 141–156.\ndoi:10.1111/j.1747-9991.2007.00059.x</li>\n<li>–––, 2008, “Imagining Fact and\nFiction”, In <em>New Waves in Aesthetics</em>, edited by\nKathleen Stock and Katherine Thomson-Jones, New York: Palgrave\nMacmillan, 150–169.</li>\n<li>–––, 2011, “Fictive Utterance and\nImagining II”, <em>Proceedings of the Aristotelian Society\nSupplementary Volume</em>, 85(1): 163–180.\ndoi:10.1111/j.1467-8349.2011.00201.x</li>\n<li>–––, 2012, “VIII—Fiction as a\nGenre”, <em>Proceedings of the Aristotelian Society</em>,\n112(2pt2): 179–209. doi:10.1111/j.1467-9264.2012.00331.x</li>\n<li>–––, 2014, “Believing in Stories”,\nin <em>Aesthetics and the Sciences of Mind</em>, edited by Greg\nCurrie, Matthew Kieran, Aaron Meskin, and Jon Robson, Oxford: Oxford\nUniversity Press, 228–248.\ndoi:10.1093/acprof:oso/9780199669639.003.0012</li>\n<li>–––, 2017, “The Real Foundation of\nFictional Worlds”, <em>Australasian Journal of Philosophy</em>,\n95(1): 29–42. doi:10.1080/00048402.2016.1149736</li>\n<li>–––, forthcoming, <em>Matters of Fact and\nFiction</em>, Oxford: Oxford University Press.</li>\n<li>Gallagher, Catherine, 2006, “The Rise of\nFictionality”, in <em>The Novel</em>, 2 volumes, Franco Moretti\n(ed.), Princeton: Princeton University Press, Vol. 1,\n336–363.</li>\n<li>García-Carpintero, Manuel, 2013, “Norms of\nFiction-Making”, <em>British Journal of Aesthetics</em>, 53(3):\n339–357. doi:10.1093/aesthj/ayt021</li>\n<li>Gaskell, Elizabeth Cleghorn, 1848 [1996], <em>Mary Barton: A Tale\nof Manchester Life</em>, new edition. London and New York: Penguin\nClassics.</li>\n<li>Gaut, Berys, 2005, “Art and Knowledge”, in Levinson\n2005: 436–450. </li>\n<li>Gendler, Tamar Szabó, 2000, “The Puzzle of Imaginative\nResistance”, <em>Journal of Philosophy</em>, 97(2): 55–81.\ndoi:10.2307/2678446</li>\n<li>–––, 2008, “Alief in Action (and\nReaction)”, <em>Mind and Language</em>, 23(5): 552–585.\ndoi:10.1111/j.1468-0017.2008.00352.x</li>\n<li>Gendler, Tamar Szabó, and Karen Kovakovich, 2006, “Genuine\nRational Fictional Emotions”, in Kieran 2006:\n241–253.</li>\n<li>Genette, Gérard, 1990, “Fictional Narrative, Factual\nNarrative”, <em>Poetics Today</em>, 11(4): 755–774.\ndoi:10.2307/1773076</li>\n<li>Gerrig, Richard J., 1993, <em>Experiencing Narrative Worlds: On\nthe Psychological Activities of Reading</em>, New Haven, CT: Yale\nUniversity Press.</li>\n<li>Gibson, John, 2007, <em>Fiction and the Weave of Life</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199299522.001.0001</li>\n<li>Goodman, Nelson, 1978, <em>Ways of Worldmaking</em>, Indianapolis:\nHackett.</li>\n<li>Green, Melanie, and Timotyh C. Brock, 2000, “The Role of\nTransportation in the Persuasiveness of Public\nNarrative”, <em>Journal of Personality and Social\nPsychology</em> 79(5): 701–21.</li>\n<li>Grice, H. Paul, 1957, “Meaning”, <em>Philosophical\nReview</em>, 66(3): 377–388. doi:10.2307/2182440</li>\n<li>Hamburger, Käte, 1957 [1973], <em>Die Logik der Dichtung</em>,\nStuttgart: E. Klett, second edition in 1968. Translated by Marilynn J.\nRose as <em>The Logic of Literature</em>, Bloomington: Indiana\nUniversity Press, 1973.</li>\n<li>Hanley, Richard, 2004, “As Good As It Gets: Lewis on Truth\nin Fiction”, <em>Australasian Journal of Philosophy</em>, 82(1):\n112–128. doi:10.1080/713659790</li>\n<li>Harold, James, 2016, “Literary Cognitivism”, in\n<em>Routledge Companion to the Philosophy of Literature</em>, edited\nby Noël Carroll and John Gibson, London: Routledge,\n382–393.</li>\n<li>Harris, Paul L., 2000, <em>The Work of the Imagination</em>,\nMalden, MA: Wiley-Blackwell.</li>\n<li>Hjort, Mette and Sue Laver (eds), 1997, <em>Emotion and the\nArts</em>, New York and Oxford: Oxford University Press.</li>\n<li>Howard-Snyder, Frances, 2002, “Truth in Fiction: the Whole\nStory”, in <em>Realism and Anti-Realism</em>, edited by William\nAlston, Ithaca, NY: Cornell University Press, 253–279.</li>\n<li>Jago, Mark, 2014, <em>The Impossible. An Essay on\nHyperintensionality</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198709008.001.0001</li>\n<li>James, Henry, 1881 [2009], <em>The Portrait of a Lady</em>, edited\nby Roger Luckhurst, reprint edition, Oxford: Oxford University\nPress.</li>\n<li>John, Eileen, 1998, “Reading Fiction and Conceptual\nKnowledge: Philosophical Thought in Literary\nContext”, <em>Journal of Aesthetics and Art Criticism</em>,\n56(4): 331–348.</li>\n<li>Johnson, S., 1765, <em>Preface to the Plays of William\nShakespeare</em>, London.</li>\n<li>Johnson-Laird, Philip N., 1983, <em>Mental Models: Towards a\nCognitive Science of Language, Inference, and Consciousness</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Kieran, Matthew, 1996, “Art, Imagination, and the\nCultivation of Morals”, <em>Journal of Aesthetics and Art\nCriticism</em>, 54(4): 337–351. doi:10.2307/431916</li>\n<li>–––, 2004, <em>Revealing Art</em>, London:\nRoutledge.</li>\n<li>––– (ed.), 2006, <em>Contemporary Debates in\nAesthetics and the Philosophy of Art</em>, Oxford: Blackwell.</li>\n<li>Kivy, Peter, 1997, “The Laboratory of Fictional\nTruth”, in <em>Philosophies of Arts: An Essay in\nDifferences</em>, New York: Cambridge University Press,\n120–139.</li>\n<li>–––, 2011, <em>Once-Told Tales: An Essay in\nLiterary Aesthetics</em>, Malden, MA: Wiley-Blackwell.</li>\n<li>Kripke, Saul A., 2013, <em>Reference and Existence: The John Locke\nLectures</em>, Oxford: Oxford University Press. Lectures given in\n1973. doi:10.1093/acprof:oso/9780199928385.001.0001 </li>\n<li>Kung, Peter, 2016, “You Really Do Imagine It: Against Error\nTheories of Imagination”, <em>Noûs;</em>, 50:\n90–120.</li>\n<li>Lamarque, Peter, 1981, “How Can We Fear and Pity\nFictions?” <em>British Journal of Aesthetics</em>, 21(4):\n291–304. doi:10.1093/bjaesthetics/21.4.291</li>\n<li>–––, 2014, <em>The Opacity of Narrative</em>,\nLondon: Rowman and Littlefield International.</li>\n<li>–––, 2016, “Review of <em>Fiction and\nNarrative</em> by Derek Matravers”, <em>Mind</em>, 125(498):\n\n616–619. doi:10.1093/mind/fzw011</li>\n<li>Lamarque, Peter and Stein Haugom Olsen, 1994, <em>Truth, Fiction,\nand Literature: A Philosophical Perspective</em>, Oxford: Clarendon\nPress. doi:10.1093/acprof:oso/9780198236818.001.0001</li>\n<li>Landy, Joshua. 2012, <em>How to Do Things with Fictions</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195188561.001.0001</li>\n<li>Lejeune, Philippe, 1977, “Autobiography in the Third\nPerson”, translated by Annette Tomarken and Edward Tomarken,\n\n<em>New Literary History</em>, 9(1): 27–50.\ndoi:10.2307/468435</li>\n<li>Le Poidevin, Robin, 1995, “Worlds within Worlds? The\nParadoxes of Embedded Fiction”, <em>The British Journal of\nAesthetics</em>, 35(3): 227–238.\ndoi:10.1093/bjaesthetics/35.3.227</li>\n<li>Leslie, Alan M., 1987, “Pretense and Representation: The\nOrigins of ‘Theory of Mind”,’ <em>Psychological\nReview</em>, 94 (4): 412–426.</li>\n<li>Levinson, Jerrold, 1997, “Emotion in Response to Art: A\nSurvey of the Terrain”, in Hjort &amp; Laver (1997),\npp. 20–34.</li>\n<li>–––, 2005, <em>The Oxford Handbook of\nAesthetics</em>, New York: Oxford University Press.</li>\n<li>Levinstein, Ben, 2007, “Facts, Interpretation and Truth in\nFiction”, <em>The British Journal of Aesthetics</em>, 47(1):\n64–75. doi:10.1093/aesthj/ayl039</li>\n<li>Lewis, David, 1973, <em>Counterfactuals</em>, Oxford: Basil\nBlackwell.</li>\n<li>–––, 1978 [1983], “Truth in\nFiction”, <em>American Philosophical Quarterly</em>, 15(1):\n37–46. Reprinted with postscripts in Lewis 1983: 261–280.\ndoi:10.1093/0195032047.003.0015</li>\n<li>–––, 1983, <em>Philosophical Papers</em>, volume\n1, Oxford: Oxford University Press. </li>\n<li>–––, 1986, <em>On The Plurality of Worlds</em>,\nOxford: Blackwell.</li>\n<li>–––, 2004, “Letters to Beall and\nPriest”, in G. Priest, J.C. Beall, &amp; B. Armour-Garb\n(eds.), <em>The Law of Non-Contradiction: New Philosophical\nEssays</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2005, “Quasi-realism is\nFictionalism”, in M.E. Kalderon (ed.), <em>Fictionalism in\nMetaphysics</em>, Oxford: Oxford University Press,\npp. 314–321.</li>\n<li>Lillard, Angeline, 2001, “Pretend Play as Twin Earth: A\nSocial-Cognitive Analysis”, <em>Developmental Review</em>, 21:\n495–531.</li>\n<li>Livingston, Paisley, 2005, <em>Art and Intention: A Philosophical\nStudy</em>, Oxford: Oxford University Press.</li>\n<li>Ludwig, Emil, 1925 [1927], <em>Napoleon</em>, Berlin: E. Rowohlt.\nTranslated by Eden and Cedar Paul, London: Allen &amp; Unwin.\n [<a href=\"http://archive.org/details/Napoleon_539\" target=\"other\">Ludwig 1927 available online</a>]</li>\n<li>Macaulay, Thomas Babington, 1906, <em>History of England from the\nAccession of James II</em>, London: Dent.</li>\n<li>Mailer, Norman, 1979, <em>The Executioner’s Song</em>,\nBoston: Little, Brown, &amp; Co.</li>\n<li>Mantel, Hilary, 2009, <em>Wolf Hall</em>, London: Fourth\nEstate.</li>\n<li>Matravers, Derek, 1995, “Beliefs and Fictional\nNarrators”, <em>Analysis</em>, 55(2): 121–122.\ndoi:10.1093/analys/55.2.121</li>\n<li>–––, 2014, <em>Fiction and Narrative</em>, New\nYork/Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199647019.001.0001</li>\n<li>McCormick, Peter, 1988, <em>Fictions, Philosophies, and the\nProblems of Poetics</em>, Ithaca: Cornell University Press.</li>\n<li>Meini, Cristina and Voltolini, Alberto, 2010, “How Pretence\nCan Really Be Metarepresentational”, <em>Mind and Society</em>,\n9(1): 31–58. doi:10.1007/s11299-009-0068-z</li>\n<li>Mikkonen, Jukka, 2013, <em>The Cognitive Value of Philosophical\nFiction</em>, London: Bloomsbury.</li>\n<li>Moran, Richard, 1994, “The Expression of Feeling in\nImagination”, <em>Philosophical Review</em>, 103(1):\n75–106. doi:10.2307/2185873</li>\n<li>Morris, E., 1999, <em>Dutch: A Memoir of Ronald Reagan</em>, New\nYork: Random House.</li>\n<li>Nabokov, Vladimir Vladimirovich, 1962, <em>Pale Fire: A\nNovel</em>, New York: G.P. Putnam’s Sons.</li>\n<li>Nadel, George H., 1964, “Philosophy of History before\nHistoricism”, <em>History and Theory</em>, 3(3): 291–315.\ndoi:10.2307/2504234 </li>\n<li>Neill, Alex, 1993, “Fiction and the Emotions”,\n<em>American Philosophical Quarterly</em>, 30(1): 1–13.</li>\n<li>–––, 2005, “Art and Emotion”, in\nLevinson 2005: 421–435.</li>\n<li>Nelson, William, 1973, <em>Fact or Fiction: The Dilemma of the\nRenaissance Storyteller</em>, Cambridge, MA: Harvard University\nPress.</li>\n<li>Nichols, Shaun, 2006, “Just the Imagination: Why Imagining\nDoesn’t Behave Like Believing”, <em>Mind &amp;\nLanguage</em>, 21(4): 459–474.\ndoi:10.1111/j.1468-0017.2006.00286.x</li>\n<li>Nichols, Shaun and Stephen Stich, 2003, <em>Mindreading: an\nIntegrated Account of Pretence, Self-Awareness, and Understanding of\nOther Minds</em>, Oxford: Oxford University Press.\ndoi:10.1093/0198236107.001.0001</li>\n<li>Nolan, Daniel, 1997, “Impossible Worlds: A Modest\nApproach”, <em>Notre Dame Journal of Formal Logic</em>, 38(4):\n535–572. doi:10.1305/ndjfl/1039540769</li>\n<li>–––, 2007, “A Consistent Reading of\nSylvan’s Box”, <em>Philosophical Quarterly</em>, 67(229):\n667–673. doi:10.1111/j.1467-9213.2007.501.x</li>\n<li>–––, 2015, “Personification and Impossible\nFictions”, <em>British Journal of Aesthetics</em>, 55(1):\n57–69. doi:10.1093/aesthj/ayt053</li>\n<li>Novitz, David, 1987, <em>Knowledge, Fiction, and Imagination</em>, Philadelphia: Temple University Press.</li>\n<li>Nussbaum, Martha C., 1985, “‘Finely Aware and Richly Responsible’: Moral Attention and the Moral Task of Literature”, <em>Journal of Philosophy</em>, 82(10): 516–529.\ndoi:10.2307/2026358</li>\n<li>–––, 1990, <em>Love’s Knowledge: Essays on\nPhilosophy and Literature</em>, New York: Oxford University\nPress.</li>\n<li>–––, 2001, <em>The Fragility of Goodness: Luck and Ethics in Greek Tragedy and Philosophy</em> (revised edition), New York: Cambridge University Press.</li>\n<li>Pavel, Thomas, 1986, <em>Fictional Worlds</em>, Cambridge MA:\nHarvard University Press.</li>\n<li>Perner, Josef, 1991, <em>Understanding the Representational\nMind</em>, Cambridge MA: MIT Press.</li>\n<li>Phillips, John F., 1999, “Truth and Inference in\nFiction”, <em>Philosophical Studies</em>, 94(3): 273–293.\ndoi:10.1023/A:1004239709212</li>\n<li>Plato, <em>Plato’s Republic</em>, trans. G.M.A. Grube, 1974,\nIndianapolis: Hackett Pub. Co.</li>\n<li>Predelli, Stefano, 2001, “Names and Character”,\n<em>Philosophical Studies</em>, 103(2): 145–163.\ndoi:10.1023/A:1010312322444</li>\n<li>–––, 2005, <em>Contexts. Meaning, Truth, and the\nUse of Language</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2008, “Modal Monsters and Talk about\nFiction”, <em>Journal of Philosophical Logic</em>, 37:\n277–297.</li>\n<li>–––, 2019, “Determination and Uniformity:\nThe Problem with Speech-Act Theories of\nFiction”, <em>Erkenntnis</em>, 84(2):\n309–324x. doi:10.1007/s10670-017-9959-2</li>\n<li>Prentice, Deborah A. and Richard. J. Gerrig, 1999,\n“Exploring the Boundary between Fiction and Reality”, in\n<em>Dual-Process Theories in Social Psychology</em>, edited by S.\nChaiken and Y. Trope, New York: Guilford Press, 529–546.</li>\n<li>Prescott, William, 2005, <em>History of the Conquest of Peru</em>,\nMineola, NY: Dover Publications.</li>\n<li>Priest, Graham, 1997, “Sylvan’s Box: A Short Story and\nTen Morals”, <em>Notre Dame Journal of Formal Logic</em>, 38(4):\n573–583. doi:10.1305/ndjfl/1039540770</li>\n<li>–––, 2000, “Could Everything be\nTrue?” <em>Australasian Journal of Philosophy</em>, 78(2):\n189–195. doi:10.1080/00048400012349471</li>\n<li>–––, 2005, <em>Towards Non-Being: the Logic and\nMetaphysics of Intentionality</em>, Oxford: Oxford University Press.\nSecond expanded edition, 2016.\ndoi:10.1093/acprof:oso/9780198783596.001.0001 </li>\n<li>Proudfoot, Diane, 2006, “Possible Worlds Semantics and\nFiction”, <em>Journal of Philosophical Logic</em>, 35(1):\n9–40. doi:10.1007/s10992-005-9005-8</li>\n<li>Putnam, Hilary, 1978, “Literature, Science and\nReflection”, in Putnam <em>Meaning and the Moral Sciences</em>,\nLondon: Routledge &amp; Kegan Paul, pp. 83–94.</li>\n<li>Radford, Colin, 1975, “How Can We Be Moved by the Fate of\nAnna Karenina?”, <em>Proceedings of the Aristotelian\nSociety</em>, 49: 67–80.\ndoi:10.1093/aristoteliansupp/49.1.67</li>\n<li>Recanati, François, 2000, <em>Oratio Obliqua, Oratio Recta: An\nEssay on Metarepresentation</em>, Cambridge MA: The MIT Press.</li>\n<li>Robinson, Jenefer M., 1985, “Style and Personality in the\nLiterary Work”, <em>Philosophical Review</em>, 94(2):\n147–158. doi:10.2307/2185429 </li>\n<li>–––, 1995 [1997], “<em>L’Education\nSentimentale</em>”, <em>Australasian Journal of Philosophy</em>,\n73(2): 212–226. Reprinted in <em>Art and its Messages: Meaning,\nMorality, and Society</em>, edited by Stephen Davies, University Park,\nPA: Pennsylvania State University Press, 1997: 34–48.\ndoi:10.1080/00048409512346551</li>\n<li>Ross, Jeff, 1997, <em>The Semantics of Media</em>, Dordrecht:\nKluwer.</li>\n<li>Rowe, M.W., 1997, “Lamarque and Olsen on Literature and\nTruth”, <em>Philosophical Quarterly</em>, 47(188):\n322–341. doi:10.1111/1467-9213.00062</li>\n<li>Sainsbury, Mark, 2010, <em>Fiction and Fictionalism</em>, London:\nRoutledge.</li>\n<li>Schaper, Eva, 1978, “Fiction and the Suspension of\nDisbelief”, <em>British Journal of Aesthetics</em>, 18(1):\n31–44. doi:10.1093/bjaesthetics/18.1.31</li>\n<li>Searle, John R., 1975, “The Logical Status of Fictional\nDiscourse”, <em>New Literary History</em>, 6(2): 319–332.\ndoi:10.2307/468422.</li>\n<li>Sinclair, Upton, 1985, <em>The Jungle</em>, New York: Penguin\nBooks.</li>\n<li>Smith, Murray, 1995, “Film Spectatorship and the Institution\nof Fiction”, <em>Journal of Aesthetics and Art Criticism</em>,\n53(2): 113–127. doi:10.2307/431540</li>\n<li>Stalnaker, Robert, 1968, “A Theory of Conditionals”,\nin <em>Studies in Logical Theory</em>, edited by Nicholas Rescher,\nOxford: Blackwell, 98–112.</li>\n<li>Stecker, Robert, 2011, “Should We Still Care about the\nParadox of Fiction”, <em>British Journal of Aesthetics</em>, 51:\n295–308.</li>\n<li>Stock, Kathleen, 2011, “Fictive Utterance and\nImagining”, <em>Aristotelian Society Supplementary Volume</em>,\n85(1): 145–161. doi:10.1111/j.1467-8349.2011.00200.x</li>\n<li>–––, 2016, “Imagination and\nFiction”, in <em>Routledge Handbook of Philosophy of\nImagination</em>, edited by Amy Kind, (Routledge Handbooks in\nPhilosophy), Abingdon: Routledge, 204–216.</li>\n<li>–––, 2017, <em>Only Imagine: Fiction,\nInterpretation and Imagination</em>, Oxford: Oxford University\nPress.</li>\n<li>Stolnitz, Jerome, 1992, “On the Cognitive Triviality of\nArt”, <em>British Journal of Aesthetics</em>, 32(3):\n191–200.</li>\n<li>Stowe, Harriet Beecher, 1969, <em>Uncle Tom’s Cabin</em>,\nColumbus, OH: C.E. Merrill Pub. Co.</li>\n<li>Styron, William, 1967, <em>The Confessions of Nat Turner</em>, New\nYork: Random House.</li>\n<li>Swirski, Peter, 2007, <em>Of Literature and Knowledge:\nExplorations in Narrative Thought Experiments, Evolution and Game\nTheory</em>, London: Routledge.</li>\n<li>–––, 2014, “Did Sherlock Holmes Inhale Pipe Smoke\nThrough a Hole in his Forehead?” in <em>Realism, Science, and\nPragmatism</em>, edited by Kenneth R. Westphal, New York: Routledge,\n115–136. </li>\n<li>Tacitus, Cornelius, <em>The Complete Works of Tacitus: The Annals;\nThe History; The Life of Cnaeus Julius Agricola; Germany and its\nTribes; A Dialogues on Oratory</em>, trans. Alfred John Church and\nWilliam Jackson Brodribb, 1942, edited and with an introduction by\nMoses Hadas, New York: The Modern Library.</li>\n<li>Tolstoy, Leo, 1867 [2017], <em>War and Peace</em>, trans. Anthony Briggs,\nLondon: Penguin Random House.</li>\n<li>–––, 1877 [2001], <em>Anna Krenina: A Novel in\nEight Parts</em>, trans. Richard Pevear and Larissa Volokhonsky, New\nYork: Viking.</li>\n<li>Vaihinger, Hans, 1911 [1924], <em>The Philosophy of ‘As\nIf’</em>, trans. C.K. Ogden, London: Kegan Paul. First published\nin German as <em>Die Philosophie des Als Ob</em>, Berlin: Verlag von\nReuther &amp; Reichard.</li>\n<li>Vidal, Gore, 1984, <em>Lincoln</em>, New York: Penguin Random\nHouse.</li>\n<li>Voltolini, Alberto, 2016, “The Nature of Fiction/al\nUtterances”, <em>Kairos</em>, 17(1): 28–55.\ndoi:10.1515/kjps-2016-0016</li>\n<li>Walton, Kendall L., 1970, “Categories of Art”,\n<em>Philosophical Review</em>, 79(3): 334–67.\ndoi:10.2307/2183933 </li>\n<li>–––, 1978, “How Remote are Fictional\nWorlds from the Real World?” <em>The Journal of Aesthetics and\nArt Criticism</em>, 37(1): 11–23.</li>\n<li>–––, 1978, “Fearing Fictions”,\n<em>The Journal of Philosophy</em>, 75(1): 5–25.\ndoi:10.2307/2025831</li>\n<li>–––, 1990, <em>Mimesis as Make-Believe: On the\nFoundations of the Representational Arts</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>–––, 1993, “Metaphor and Prop Oriented\nMake-Believe”, <em>European Journal of Philosophy</em>, 1(1):\n39–57. doi:10.1111/j.1468-0378.1993.tb00023.x</li>\n<li>–––, 1997, “Spelunking, Simulation, and\nSlime”, in Hjort &amp; Laver 1997: 37–49.</li>\n<li>–––, 2013, “Fictionality and Imagination\nReconsidered”, in <em>From Fictionalism to Realism</em>, edited\nby Carola Barbero, Maurizio Ferraris and Alberto Voltolini, Cambridge:\nCambridge Scholars Publishing, 9–24.</li>\n<li>–––, 2015, “Fictionality and\nImagination—Mind the Gap”, in <em>In Other Shoes: Music,\nMetaphor, Empathy, Existence</em>, Oxford, New York: Oxford University\nPress, 17–35.</li>\n<li>Walsh, Richard, 2007, <em>The Rhetoric of Fictionality: Narrative\nTheory and the Idea of Fiction</em>, Columbus: The Ohio State\nUniversity Press.</li>\n<li>Wheeler, Christian, Melanie C. Green, and Timothy C. Brock, 1999,\n“Fictional Narratives Change Beliefs: Replications of Prentice,\nGerrig, and Bailis (1997) with Mixed Corroboration”,\n<em>Psychonomic Bulletin &amp; Review</em>, 6(1): 136–141.\ndoi:10.3758/BF03210821</li>\n<li>Wimsatt Jr, William K. and Monroe C. Beardsley, 1946, “The\nIntentional Fallacy”, <em>The Sewanee Review</em>, 54(3):\n468–488.</li>\n<li>Wolterstorff, Nicholas, 1980, <em>Worlds and Works of Art</em>,\nOxford: Clarendon Press.</li>\n<li>Woods, John, 1974, <em>The Logic of Fiction: A Philosophical\nSounding of Deviant Logic</em>, The Hague: Mouton.</li>\n<li>–––, 2003, <em>Paradox and Paraconsistency.\nConflict Resolution in the Abstract Sciences</em>, Cambridge:\nCambridge University Press. doi:10.1017/CBO9780511614002</li>\n<li>–––, 2006, “Fictions and their\nLogic”, in <em>Philosophy of Logic</em>, edited by Dale\nJacquette, Amsterdam: Elsevier, 1061–1126.\ndoi:10.1016/B978-044451541-4/50028-2</li>\n<li>–––, 2018, <em>Truth in Fiction: Rethinking its\nLogic</em>, Dordrecht: Springer.</li>\n<li>Woodward, Richard, 2011, “Truth in Fiction”,\n<em>Philosophy Compass</em>, 6(3): 158–167.\ndoi:10.1111/j.1747-9991.2010.00367.x</li>\n<li>Yablo, Stephen, 1999, “Review: The Strange Thing About the\nFigure in the Bathhouse. Amie L. Thomasson, <em>Fiction and\nMetaphysics</em>”, <em>Times Literary Supplement</em>, November\n5, 1999, issue 5040, page 26.</li>\n<li>Yanal, Robert J., 1994, “The Paradox of Emotion and\nFiction”, <em>Pacific Philosophical Quarterly</em>, 75(1):\n54–75. doi:10.1111/j.1468-0114.1994.tb00120.x</li>\n<li>Young, James O., 2008, “Literature, Representation, and\nKnowledge”, in <em>Contemporary Readings in the Philosophy of\nLiterature: An Analytic Approach</em>, edited by David Davies and Carl\nMatheson, Peterborough, Ont.: Broadview, 359–376.</li>\n<li>Zalta, Edward N., 1988, <em>Intensional Logic and the Metaphysics\nof Intentionality</em>, Cambridge, MA: The MIT Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "fiction: fictional entities",
            "fictionalism",
            "hermeneutics",
            "imagination",
            "impossible worlds",
            "literature, philosophy and",
            "Plato: rhetoric and poetry",
            "possible worlds",
            "pragmatics"
        ],
        "entry_link": [
            {
                "../fictional-entities/": "fiction: fictional entities"
            },
            {
                "../fictionalism/": "fictionalism"
            },
            {
                "../hermeneutics/": "hermeneutics"
            },
            {
                "../imagination/": "imagination"
            },
            {
                "../impossible-worlds/": "impossible worlds"
            },
            {
                "../plato-rhetoric/": "Plato: rhetoric and poetry"
            },
            {
                "../possible-worlds/": "possible worlds"
            },
            {
                "../pragmatics/": "pragmatics"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "\n<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>\n",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=fiction\" target=\"other\">How to cite this entry</a>.",
            "\n<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>\n",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/fiction/\" target=\"other\">Preview the PDF version of this entry</a>\n at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "\n<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>\n",
            "<a href=\"https://www.inphoproject.org/entity?sep=fiction&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "\n<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>\n",
            "<a href=\"http://philpapers.org/sep/fiction/\" target=\"other\">Enhanced bibliography for this entry</a>\n at\n <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>,\n with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=fiction": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/fiction/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=fiction&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/fiction/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}