{
    "url": "fitzralph",
    "title": "Richard FitzRalph",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Michael W. Dunne\n<dunne.mw@gmail.com>",
        "author_links": [
            {
                "mailto:dunne%2emw%40gmail%2ecom": "dunne.mw@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\nMichael W. Dunne\n&lt;<a href=\"mailto:dunne%2emw%40gmail%2ecom\"><em>dunne<abbr title=\" dot \">.</abbr>mw<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Jul 8, 2013",
        "substantive revision Wed Mar 27, 2019"
    ],
    "preamble": "\nRichard FitzRalph (1299–1360) was regarded even during his\nlifetime as one of the leading thinkers to emerge from that generation\nof exceptionally talented thinkers who emerged at Oxford in the early\n1330s. Although his later fame was mainly due to his polemical\nwritings, especially regarding the poverty question and his attacks on\nthe Franciscans, he was acknowledged as a significant interlocutor by\nthinkers such as Holcot, Wodeham, Wyclif and Gregory of Rimini among\nothers.  Although regarded as somewhat traditional in his doctrinal\ntendencies, he was particularly well-regarded for the careful and\ndetailed re-formulation of the arguments of thinkers such as Aquinas,\nHenry of Ghent and Duns Scotus, especially on matters such as\ninfinity, future contingents and the relation of the will to the\nintellect.  His was the first book by an Irishman to be printed (as an\nincunabulum) and consequently, for example, his theory of dominion was\nstill being discussed in the sixteenth century.\n",
    "toc": [
        {
            "#Lif": "1. Life"
        },
        {
            "#Wri": "2. Writings"
        },
        {
            "#PosHis": "3. Position in the History of Philosophy"
        },
        {
            "#Nat": "4. Natural Philosophy"
        },
        {
            "#PsyCog": "5. Psychology and Cognition"
        },
        {
            "#MinTriIntMemWil": "5.1 Mind as a trinity of intellect, memory and will"
        },
        {
            "#SpeThe": "5.2 Species theory"
        },
        {
            "#WilRelInt": "5.3 The will and its relation to the intellect"
        },
        {
            "#PhiThe": "6. Philosophical Theology"
        },
        {
            "#ProGodExi": "6.1 Proving God’s existence"
        },
        {
            "#DivOmn": "6.2 Divine omnipotence"
        },
        {
            "#DivForFutCon": "6.3 Divine Foreknowledge and future contingents"
        },
        {
            "#PreFreWil": "6.4 Predestination and Free Will"
        },
        {
            "#EthPolTheDom": "7. Ethics and Political Theory: Dominium"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PriSou": "Primary Sources"
        },
        {
            "#SecSou": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life\nRichard FitzRalph was born in Dundalk probably slightly before 1300. Although\nnot a member of the Gaelic race, he was referred to by his Oxford\ncontemporaries as “Hibernicus,” as was the Anglo-Norman\nPeter of Ireland (Petrus de Hibernia, ca. 1200–1265) a generation\nbefore. Around the age of 15, he went to Oxford (there was no\nuniversity in Ireland before the reign of Elizabeth I) where he was a\nfellow of Balliol College, and he gained his MA there. He later\nwent to University College (then University Hall), where he graduated\nwith a doctorate in theology in 1331. He became chancellor of the\nUniversity of Oxford in 1332, embarking thereafter on a successful\necclesiastical career both in England and in Ireland. On his first\nvisit to Avignon, only five years after concluding his lectures on the\nSentences, FitzRalph it seems was consulted as one of the eighteen\nleading theologians of Europe by Pope Benedict XII to correct the views\nof his predecessor, John XXII, on the beatific vision. He became\narchbishop of Armagh in 1347. He is perhaps best known for his\nopposition to the mendicant orders on the question of evangelical\npoverty and his defense of the rights of the secular clergy against the\nfriars. It was while pursuing his suit against the mendicants that he\ndied at Avignon in 1360. In the company of Ockham, Bradwardine, and\nWodeham, FitzRalph became one of the four most frequently cited insular\ntheologians in the fourteenth century.\n2. Writings\n\n\nFitzRalph was a prolific author and most of the works from his\nmature period are of a theological or pastoral nature, or, indeed,\npolemical writings concerned with the anti-mendicant controversy. \nAnd whereas some topics are dealt with such as future contingents (in\nthe Summa de Quaestionibus Armenorum) or the question of\ndominium, it is to his earlier work, the Lectura on the\nSentences, dating from 1328–29, that we must look to for more\nphilosophical themes. FitzRalph was also the author of a (now\nlost) Commentary on the Physics which brought him into\nconflict with Richard Kilvington. Furthermore, some logical works\nonce attributed to FitzRalph are now to be attributed to another\nArmachanus, John Foxhalls (Johannes Anglicus) (Dunne 2013b). The most\nextensive treatment to date of FitzRalph’s thought as presented\nin the Lectura is that by Gordon Leff (1963). Leff’s\nbook gives a good overview of FitzRalph’s thought and is generous\nwith quotations from the text itself. What emerges from Leff’s\nexamination is that a good deal of FitzRalph’s Lectura\nwas not concerned with theology at all, or at least only tangentially\nso. For example, when dealing with the theological problem of the\ncreation of the world, the discussion focuses on topics (such as the\neternity of the world) that FitzRalph had already dealt with in his\ncommentary on the Physics (Dunne 2008).\n3. Position in the History of Philosophy\n\n\nAlthough many hold that FitzRalph later turned away from\nscholasticism (Leff 1963: 175), this point has been refuted by W. Duba\n(Duba 2013: 104). FitzRalph’s lectures on the\nSentences have turned out to be of greater importance than\nmight have at first been realized by some authors such as Leff. Leff\nsaw FitzRalph’s approach as being heavily influenced by the\nneo-Augustinian movement deriving ultimately from Henry of Ghent.\nLeff’s summation of FitzRalph is rather negative, holding that\nFitzRalph shows an unwillingness to be deeply involved in the\ncontroversies of his time, and that he was content to “restate\nwhat his contemporaries re-formulated” (Leff 1963: 175).  This\nassessment, however, leaves one wondering what there was about\nFitzRalph’s ideas that his contemporaries such as Holcot and\nWodeham, and later, Gregory of Rimini and Pierre d’Ailly, found\nso challenging. In fact, contrary to Leff’s assessment recent\nscholarship affirms that FitzRalph was one of the leading protagonists\nof the Oxford of his day and at a time when Oxford briefly eclipsed\nthe University of Paris in importance.\n\n\nIn philosophical matters FitzRalph generally follows Aristotle, but an\nAristotle who is constantly read through the lens of his\nCommentator. Averroës is taken by FitzRalph to be the authentic\ninterpreter of Aristotle despite the condemnations of the 1270s, but\nin so doing FitzRalph is not an Averroist (as some surmised) but is\nmerely following the accepted practice of the times. For example, he\nis not, as one would expect, Averroistic in accepting the doctrine of\na single soul and indeed doubts whether it is truly\nAverroës’s teaching. Aquinas, when mentioned, is treated\nwith respect and FitzRalph follows him on a number of important\npoints. Perhaps owing to a certain national loyalty, Anselm receives\nsignificant (though not uncritical) attention. Grosseteste too\nreceives occasional mention. Again, as one might expect, Augustine is\nthe guide in theological matters, but FitzRalph does not content\nhimself to give references to Augustine’s works. In fact, he\ntends to provide long quotations from Augustine, indicating a close\npersonal reading, something he shared with his patron, Bishop John de\nGrandisson. Contemporaries are not named (contrary to the practice of\nWodeham or Holcot a few years later), and their contributions have to\nbe identified (as does indeed FitzRalph’s own positions) in the\ncourse of his presentation of each topic in the text which usually\ninvolves an examination of the answers given by Aquinas, Henry of\nGhent and Duns Scotus. FitzRalph would have perhaps felt closest in\nspirit to (though not always agreeing with) the neo-Augustinianism of\nHenry of Ghent; in method and approach, however, he seems closest to\nDuns Scotus. However, the techniques he employs are something he holds\nin common with his contemporaries, and it was these, it seems,\ntogether with the high quality of his arguments which appealed to\nother writers down to Jacques Almain and Francisco de Vitoria.\n\n\nThere is little or no evidence of radicalism in FitzRalph’s\nearly writings such as Lectura which would anticipate the\npolemical Armachanus attacking the privileges of the mendicant orders\nat the papal court at Avignon in the 1350s. The later FitzRalph was a\nsocially conscious prelate who reprimanded his Anglo-Irish audience in\nhis sermons regarding their unjust treatment of the Gaelic Irish\npopulation. It was in this context that he developed his\nteaching on dominium, a doctrine which would have long-term\nimplications through his influence on Wyclif (Lahey 2003) or indeed in\nits rejection by later authors such as De Vitoria (Dunne 2004:\n243–58).\n4. Natural Philosophy\n\n\nFitzRalph’s views on motion, time, and infinity were the\ntopics upon which his near contemporaries, especially Wodeham and\nHolcot, most frequently quoted him (Dunne 2008). Wodeham, it seems, changed many\nof his opinions in the light of FitzRalph’s, especially regarding\ninfinity. In Book III of his Oxford Lectura, Wodeham followed\nFitzRalph word for word on the issue, thereby rejecting the very\nposition he had himself defended in Book I. Again, Gregory of\nRimini recognized FitzRalph as the source for the common view of\ninfinity held at Oxford by Holcot and Wodeham, and he repeated\nFitzRalph’s arguments, albeit in order to reject this position\n(Courtenay 1987: 76–8.)\n\n\nFitzRalph deals with these topics in the Lectura Book II,\nqu. 1: Whether God at the beginning of time created the world from\nnothing. One of the more striking features of the text is its\npredominantly philosophical flavor and its comparative lack of\ntheological material. The principal question is devoted to the general\nproblem of the eternity of the world. FitzRalph begins by putting\nforward arguments against the beginning of the world in time. One goes\nas follows: if God’s power is always the same, then it was the\nsame before the world was created; therefore, God could always from\neternity have produced the world. Thus, there is no contradiction in\nstating that the world has always existed. FitzRalph attributes this\nposition to the Commentary on the Sentences of Thomas Aquinas.\nIndeed, he continues that, even if the world is not from eternity, we\ncan argue that in the future God might make it so, since what he once\ncan do, he can always do. In other words, it remains part of\nGod’s power to make a universe that has always existed, just as\nit remains possible for God to destroy this universe, or again, to\ncreate other universes that have always existed.\n\n\nAnother argument among the many put forward is that if some\ncontradiction can be found in the notion of a world existing from\neternity, then this should be shown through the use of reason. If it\nwere possible to show that the world and time began at a certain\ninstant, then the philosophers of the past would have proven it.\nFitzRalph quotes Aristotle as saying, in the first book of the\nTopics, that either position is possible and can be argued\nfor, but neither position can be shown to be conclusive. Thus,\nFitzRalph concludes that the creation of the world ex nihilo et de\ntempore can be taken only as an article of faith; indeed, if this\nwere not the case, then there would be no merit in believing in the\ncreation of the world.\n When dealing with the associated question of the infinity\nof the number of souls FitzRalph discusses the nature of the infinite.\nHe comments that the eternity of the world does not necessarily imply\nan infinity of souls, since the first man could have been made at a\ncertain time and so have a finite number of descendants. Again, through\nreincarnation a finite number of souls could be continually reborn\nthroughout a perpetual time. FitzRalph continues by pointing out that\nsome people say that an infinity of souls is in no way impossible, or,\nat least, does not involve a contradiction, since God can make an\nactual infinite number of souls, angels, or beings at once, or he can\ndo so successively, so that an actual infinite will exist at some\nfuture time, even given that the world began at a certain\npoint.\n\n\nAgain, in every body there is an infinite number of proportional\nparts (partes proportionales: the terminology is\nChatton’s, and the source for the treatment that follows is\nprobably the De indivisibilibus of Wodeham) that are\ncompletely distinct one from another (totaliter diverse).\nThus, God can make something exist at once which is actually infinite,\nand the same is as true of souls or angels as it is of bodies. That\nthere is an infinite number of proportional parts in a body is\nconsidered by FitzRalph to have been shown by Aristotle in Book III of\nthe Physics and in Averroës’s commentary, since\nevery continuum is composed of an infinite number of proportional\nparts, each of which is distinct from the other. FitzRalph holds\nthat it can be argued that in any line there is an infinite number of\npoints, that there is an infinite number of lines in any surface, and\nan infinite number of surfaces in every body, and yet each is distinct\nfrom the other.\n\n\nFitzRalph continues his argument by stating that if there is an\nactual infinity within bodies, that is to say, if they can actually be\ndivided to infinity, then it is clear that it is possible for God to\nmake an infinite number of other things. Thus, there is no\ncontradiction in there being an infinite number of human souls. Nor is\nthere any problem with God’s not knowing which is first and\nwhich is last in an infinite series; this is not because of any\nignorance on God’s part but because, quite simply, there is no\nfirst and last. In the end he refers his audience back to his\ndiscussion of the topic in his commentary on the Physics, now\nlost.\n\n\nFinally, FitzRalph makes an interesting distinction between\nphilosophy and theology. In the ninth argument, where Anselm’s\nassertion (in the Monologion, chap. 22) that time is composed\nof parts is addressed, FitzRalph begins by stating that he is concerned\nhere with Anselm’s standing (auctoritas) as a natural\nphilosopher and not as a theologian. In fact, FitzRalph goes further:\n“here we must follow reason more than the standing\n(auctoritas) of any theologian.”\n5. Psychology and Cognition\n5.1 Mind as a trinity of intellect, memory and will\n\n\nIn his Lectura, FitzRalph holds that memory, understanding\nand willing are expressions of the essence of the soul, and whereas\neach expresses something of the soul they cannot be said of each other\nand as such are distinct (Dunne 2012: 443–50). Memory\nunderstanding and willing are to be found in the soul’s complete\nnature but the soul is not to be found completely in any one of\nthem. As regards the relationship between willing and\nunderstanding, Wodeham will later specifically oppose FitzRalph for\ntreating them as distinct. FitzRalph, on the other hand, opposed\nAquinas for regarding memory and understanding as the same. For\nFitzRalph, memory, understanding and willing are not the same (which\nwas the position of Scotus and that adopted by Chatton against Ockham),\nneither are they really distinct but are distinguished inasmuch as the\nsoul expresses itself differently through these powers. Finally,\nfor FitzRalph actual knowledge is really distinct from the species in\nmemory, i.e., there is a real distinction between the powers.\n\n\nThe topic was a traditional one but FitzRalph’s treatment\nshows how such a tradition was capable of renewal in the light of\ncontemporary developments such as the debate regarding the distinction\nbetween the mind and its powers and that between the powers itself, as\nwell as the species in memoria.\n5.2 Species theory\n\n\nIn the Lectura Book II, q. 1, a. 2, Whether\nmotion and time are really distinct, FitzRalph makes a\ndigression while defending the species in medio theory and\nrefers to a respected person (valens) who had argued against\nthe theory. He also tells us that he himself once shared a similar\nopinion and gives the reason why.\n\n\nIt seems to me that if those people are not aware that the species\nin their eyes are just like the sounds in their ears, then they will\nnot believe that such things [as species] exist but will say that sight\nis seeing and that hearing is hearing and that illuminated air is light\n– and I once heard a very respected person (valens) say\nexactly this. Others say that every colour is light, and that every\ntaste is a mixture of the prime qualities, and that every smell is\ntaste – as indeed I believed once, holding that nothing existed except\nthe five prime qualities, namely the four elemental qualities and light\n… .\n\n\nThe valens in question could well be Ockham, since\nFitzRalph was old enough to have heard him speak before the former left\nOxford in 1324 (Maier 1959: 16). (Maier also discusses\nFitzralph’s text in the context of the later debate regarding\nprimary and secondary qualities). Nor was FitzRalph alone in defending\nthe theory of the species in medio: “Ockham’s\nattack on the species elicited an almost immediate and prolonged\nnegative response.” (Tachau 1982: 395). Ockham’s position\nwas criticized by John of Reading and also by Walter Chatton, Robert\nHolcot, William Crathorn, and Wodeham. Thus, FitzRalph found himself in\nthe company of many who would normally be seen as close to the position\nof Ockham. As Tachau concludes (1982: 443), “in epistemology at\nany rate, there seems at Oxford to have been no school of\nOckhamistae.”\n\n\nHowever, with FitzRalph’s treatment of the topic there seems\nto be a shift from a concern with the species in medio to the\nspecies in memoria and this seems to have influenced the\nmanner of the treatment of the topic by Holcot and especially that of\nCrathorn who devotes much of his treatment to an analysis of\nFitzRalph’s arguments (Dunne 2012; both Holcot and Crathorn\nlectured on the Sentences in the years 1330–32 around the time when\nFitzRalph was magister regens).\n5.3 The will and its relation to the intellect\n\n\nTachau (2013: 82) writes that on Leff’s interpretation,\nFitzRalph reached for a moderate if not mediocre position, rejecting\nboth Aquinas’s “doctrine” of the intellect’s\nsuperiority and Scotus’s decision in favor of the will’s\n“primacy,” instead “contrapos[ing] his own opinio\nmedia”(Leff 1963: 97). On the issue of which of the two\nmental faculties, will or intellect, is superior, Scotus’s\n“view of the will as a power superior to the intellect …\nappealed to FitzRalph personally,” in Walsh’s judgment, but\nhe deemed Aquinas’s support for the opposite ranking “more\nauthoritative.” Walsh gained the impression that\nFitzRalph’s position was somehow untenable, so much so that\n“Wodeham took him to task for trying to have things both\nways” (Walsh 1981: 60).\n\n\nTachau (2013: 85) points out that what Wodeham actually says is that\n“the will truly is not nobler than the intellect nor\nvice versa, and note that Fitzralph holds the\nsame”. FitzRalph recognized that the various distinctions\n(real, formal, intentional, or of reason) that previous scholastic\ngenerations had drawn among the intellective and sensitive substances\nof the soul, or its “faculties,” or the faculties’\ndiverse acts and habits, were problematic; yet, he also pointed to\nsignificant philosophical and theological impediments that would arise\nfrom denying all distinctions, obstacles that neither he nor\nhis contemporaries had entirely satisfactory means of eluding (Tachau\n2013: 92). So if there were no distinction whatsoever between the\nintellectual soul’s faculties of will and intellect, then\npresumably a cognition of any given object, as an act of the intellect,\nwould be identical to the will’s volition regarding the same\nobject. To accept this conclusion, however, would introduce\nnumerous complications into any theory of whether and how God reveals\nfuture contingents, and lead to untenable consequences (Tachau 2013:\n93). \n5.4. God as the Agent Intellect\n\n\nIn the Lectura there are a series of articles which deal with\nmatters closely related to the question on the human mind as an image\nof the Trinity but which clearly were not integrated when FitzRalph\npresumably abandoned the editing process when he became Chancellor of\nOxford University.  These articles are of interest in their own right\nsince in them we see FitzRalph engaged in a long debate with both\ncertain quodlibets of Henry of Ghent and the Commentary on the De\nAnima of Averroes.  One of these articles is entitled “Whether\nthe Agent Intellect is a certain part of the Image”.  Somewhat\nunexpectedly, at the end of the article FitzRalph, in a way\nreminiscent of Bonaventure, asserts that the Agent Intellect is God,\nor that the Agent Intellect is not a certain part of the image but is\nthe First Form or God.  This seems to place FitzRalph in an earlier\ntradition, going back even to William of Auvergne and Robert\nGrosseteste and a return to an earlier Augustinianism.\n6. Philosophical Theology\n6.1 Proving God’s existence\n\n\nThe first question of Book I of the Lectura, is\n“Whether the wayfarer can know that God exists by means of\nphilosophical proof,” and a number of arguments are presented,\nsix against and six for. He tells us how he will deal with the\nproblem: firstly, he will deal with the question as to whether the\nexistence of God as such can be known and then, secondly, whether one\ncan have both faith and knowledge of the same thing at the same\ntime. Then, thirdly, he will examine the various authorities. This is\nthe basic structure followed in the rest of the Lectura, even\nif FitzRalph did not always reorganize his material fully in this\nmanner, since sometimes individual articles remain on their own or\nquestions are left unresolved. FitzRalph quotes the views of Henry of\nGhent on demonstrating the existence of God, but he accepts the\nposition of Aquinas. Again, regarding whether God’s existence is\nevident or not, he follows Aquinas. There then follows a long and\nelaborate treatment of the ontological argument but, curiously, no\nform of a cosmological argument is to be found in his writings.  It\nmust be surmised that the latter was not the focus of debate in Oxford\nat this time. \n6.2 Divine omnipotence\n\n\nLeff judged that it was Ockham and his followers who pushed the\nconsequences of the discontinuity between faith and reason to often\nirreverent conclusions in the debate on the potentia Dei.\nThus, thinkers such as Robert Holcot and Adam of Wodeham seem to show a\nsheer fascination with the paradoxes open to God in his absolute power,\na fascination that led them to positions which were hardly in keeping\nwith traditional Christian teaching. FitzRalph opposes such views\nby appealing to the Augustinian tradition. God’s potentia\nabsoluta merely refers to God’s ability to act outside the\npresent dispensation. Furthermore, God’s omnipotence entails His\ninability to sin and to deceive, just as it also excludes his dying. In\nother words, what God cannot do is to act against his own nature: God\ncannot be other than the summum bonum. God’s power does\nnot consist simply and solely of doing anything whatsoever; his limit\nis not just his freedom from contradicting himself, as others\nheld—rather it is his own nature. Since God is most good, most\nmerciful, and most just, his omnipotence must be in accordance with\nthese aspects of his nature. For God to act otherwise would not be a\nsign of omnipotence but of impotence, since it would involve a denial\nor negation of his own nature. Thus, what is possible from the point of\nview of omnipotence taken in itself, is impossible from the point of\nview of God’s goodness, mercy, and justice, and thus impossible\nnot by reason of his power (ratione potentie) but by reason of\nhis justice or goodness (ratione iustitie vel\nbonitatis).\n6.3 Divine Foreknowledge and future contingents\n\n\nOne of the topics which exercised the minds of FitzRalph and his\ncontemporaries was the topic of the revelation of future contingents.\nIndeed, FitzRalph discussed it on three separate occasions. His first\ntreatment occurs in the Sentences commentary, where he\nconsiders the matter so important that he promises his audience he will\nreturn to it He kept this promise a few months later when he gave his\nQuaestio biblica and before he left for Paris in October, 1329\n(Genest 1991) . Again, he returned to the problem in his Summa de\nquaestionibus Armenorum, where the matter is treated in a dialogue\nform.\n\n\nThe specific way in which FitzRalph addresses the problem is in terms\nof the revelation of future contingents. Given that future contingents\nhave a determinate truth—namely, that they will happen and cannot\nnot happen—how can their truth, as known by God, be revealed by\nhim to a created intellect without their losing their contingency? As\nLeff points out, the problem as set out by his contemporaries was\nwhether God’s knowledge of the future was different from that of\nthe present and the past (Leff 1963: 40). According to Wodeham,\nBuckingham, and Holcot, God’s knowledge about the future must be\nrelated to the contingency of the future, and, therefore, this\nknowledge is of a different kind from God’s knowledge of the past\nand present. FitzRalph accepts the distinction, seeking to defend his\nposition as being consonant with Augustine in the 83 Questions\nand De Trinitate. It was, in fact, a position rejected by\nBradwardine and Gregory of Rimini.\n\n\nFrom the sources which we have FitzRalph is the first to devote an\nentire question to the problem of the revelation of future contingents\nand that it is no less remarkable that it is six times the length of\nhis question on divine foreknowledge (Genest 1991: 240). Again,\nFitzRalph’s treatment of the topic marks a turning point in the\nhistory of the problem, as is clear from comparing it what Ockham had\nwritten on the topic just before 1324 (in his Quodlibet IV,\nqu. 4). Whereas Ockham dealt with the problem in 800 words,\nFitzRalph—in a sign of the growing complexity of the\nproblem—writes 20,000 words on the matter. While Ockham sought to\nremove all necessity from the proposition, “This was\nrevealed”, by seeking to disassociate it from any temporal\nimplication on God’s part, FitzRalph, without contesting this\nthesis (then nearly universally accepted), has to resolve a series of\ndifficulties that this thesis leaves open. Against the possibility of a\nrevelation of the future, FitzRalph lists fourteen arguments, which\nGenest examines in some detail. One of the central themes that emerge\nis a disjunction between the certitude of revelation and the conditions\nof acting for a creature, conditions which presuppose that in order to\nbe free, there must be a certain ignorance of the future on the part of\nthe creature. To take but one example: if God reveals to a just man\nthat he will be damned, should he pray for his salvation? FitzRalph\nmakes a distinction between a prophesy through which people are\ndeceived, on the one hand, and lying on the other; thus a person may be\ndeceived by the prophesy and yet God did not lie to them.\n\n\nFor FitzRalph God is good and does not act arbitrarily or\nirrationally. The revelation of free actions is contingent so that, if\nGod should reveal to someone that he will be ultimately damned, this\ncannot relate to the person’s present state of grace but to\nactions freely undertaken in the future. This is because, for\nFitzRalph, if someone were to act necessarily his or her actions would\nbe neither just nor unjust. Someone might freely sin even if the future\nconsequences were revealed to him, but that does not mean that he is\ncompelled to sin.\n\n\nWith the exception of the final argument, all of the quod\nnons are based upon “cases” or particular\ncircumstances (in isto casu, in casu posito) (Genest\n1991: 242–3). Some are examples taken from Scripture, others we might\ncall scholastic “thought experiments,” but most of them are\naccompanied by cases of conscience. According to Genest, many of\nthem had already been put forward by his predecessors and many are to\nbe found in the Lectura of the Franciscan John of Rodington,\nwho read the Sentences at roughly the same time as FitzRalph;\nRodington’s treatment is briefer, however (Genest 1991: 243). The\nstock of hypotheses must have been more or less complete when FitzRalph\ncomposed his question, but it is the breadth of the treatment which\nmarks FitzRalph’s text as an important witness to the debate at\nOxford at the end of the 1320s. A sign of this importance is the\nattention given to FitzRalph’s text by Wodeham in his Lectura\noxoniensis (1333–1334), where he devotes five long questions\nto the topic (Sent. III, qu. 5–9). Again, when Holcot\ncame to deal with the matter, he practically repeated what FitzRalph\nhad said.\n6.4 Predestination and Free Will\n\n\nJohn Wycliff paid tribute to both Thomas Bradwardine and\nFitzRalph as the two Oxford teachers upon whom he relied most. \nHowever, on the question of predestination and free will, Wycliff\nfollowed Bradwardine and not FitzRalph. Wycliff’s position on\npredestination contrasted sharply with FitzRalph’s efforts to\nreconcile free will with a moderate acceptance of divine\npredestination. This might serve to explain why Wycliff quoted\nfrom the De Pauperie Salvatoris on dominion and from the\nSumma de Quaestionibus Armenorum on a wider range of\ntheological issues, but he never refers to the Lectures on the\nSentences. FitzRalph’s strong emphasis on the primacy\nof the will in the Lectures was of little use to Wycliff when\nhe was working out his position, nor was FitzRalph it seems free from\nall traces of the doctrine that Bradwardine was to describe as\n‘Pelagian’.\n\n\nIn the Summa de Quaestionibus Armenorum XV–XVII, FitzRalph\nturned to topics of free will and predestination being concerned with\nwhat he regarded as a new heresy being spread in the schools. In\nlanguage more violent than anything found before the mendicant\ncontroversy, he expressed his horror at the new teaching, which he\ncalls a ‘diabolical knowledge’. Although Bradwardine\nwas not the object of FitzRalph’s attack, it seems to be written\nin response to disciples of Bradwardine who had espoused an extreme\nform of predestinarianism from a reading of the De Causa\nDei. Predestinarianism reduces eternal salvation or\ndamnation to the sovereign will of God alone, and excludes free will as\na secondary factor in determining man’s future state. Against an\nabsolute determinism FitzRalph held that the punishment of the damned\nwas just inasmuch as ‘their sin or its futurity was the reason\nfrom eternity why God willed to damn the wicked, and not the contrary,\n(Summa, XVI, 12) and defended the free human choice. \nAlthough the background to the debate is clearly Augustinian (see City\nof God, V:10), it is interesting to note that FitzRalph in the\nSumma seeks also to justify his position on the basis of\nScripture.\n7. Ethics and Political Theory: Dominium\n\n\nAfter FitzRalph’s death his fame and influence grew among those who\nwished to reform the Church. His anti-mendicant polemic meant that he\nwas often referred to in Middle-English Lollard literature. He was\nquoted extensively by Wycliff. His\nDefensio Curatorum was printed several times in the late\nfifteenth century and is the only work by an Irishman to be published\nas an incunabulum. John of Trevisa translated it into Middle\nEnglish. Printings of this work continued in the following two\ncenturies. Through the work of Ussher, Wadding and others, the\nmemory of FitzRalph was kept alive in the first half of the seventeenth\ncentury.\n\n\nOne topic in which FitzRalph was to have an influence was that of\nhis teaching on dominium, or lordship. In his dialogue De\npauperie Salvatoris (1356), FitzRalph argued that grace alone\nentitled a person to lordship over temporal things. Some centuries\nlater Lutherans thinkers, held that rights, and hence the authority of\nsecular rulers, were dependent on God’s grace. Thus, if a\nruler was a heretic or a sinner his laws could not be binding in\nconscience – only a righteous ruler could be a just\nlegislator. An unrighteous ruler could be deposed; and such\n‘unrighteous’ included unbelievers.\n\n\nThe Council of Constance met between 1414 and 1418 at which Wyclif and\nHus are condemned.  Wyclif’s views on dominium are condemned but\nFitzRalph escapes censure.  The acts of the Council are made public\nand printed in 1500.  FitzRalph’s Defensio Curatorum is\nprinted at Louvain in 1475 and his Summa de Questionibus Armenorum in\n1515.\n\n\nThe circulation of these newly printed works seems to have occasioned\na revival of interest in FitzRalph’s ideas.  Firstly Jacques\nAlmain in his Question at Vespers of March 1512 (published in\n1518) engages with FitzRalph’s views on natural dominion with\nregard to taking from another in times of necessity.\n\n \nIn his On the Civil Power, Francisco de Vitoria (ca.\n1485–1546) asked whether non-Christians have legitimate sovereigns in\nview of the Spanish discovery of the ‘New World’. He\nstates: ‘Richard FitzRalph, archbishop of Armagh, a man of\notherwise blameless character and intelligence, certainly argues in his\nDe pauperitate Saluatoris that not merely unbelief but any\nmortal sin impedes any kind of power or dominion (dominium)\nor jurisdiction, either public or private; in the mistaken belief that\nthe true title and foundation of all power is grace.’ Vitoria\nfought against the notion of dominium through grace since, as\na consequence, Christians would be entitled to take the lands, wealth\nand property from the native Americans, because Christians could and\nshould exercise dominium over all unbelievers and over the\nwhole world. This, of course, would render natural rights, or those\nwhich belong to human beings precisely because they are human, null\nand void. It was natural law theory which enabled de Vitoria to mount\nan impressive argument against this position. I think that if we\nconsider FitzRalph’s intentions in developing his theory of\ndominion, he would have reacted strongly against the injustice\nperpetrated by later upholders of grace-based dominium. Whatever his\npolemical and sometimes extreme positions such as he writings against\nthe Franciscans, he had put forward a principle which was intended to\nbring some measure of justice into law and to deal with the\n‘sinfulness’ of the Franciscan poverty-fiction and he\nwould never have ended up with defending laws without a principle of\njustice regarding first nation peoples in the Americas in the\nsixteenth century and later.\n",
    "bibliography": {
        "categories": [
            "<a name=\"PriSou\">Primary Sources</a>",
            "<a name=\"SecSou\">Secondary Literature</a>"
        ],
        "cat_ref_text": {
            "<a name=\"PriSou\">Primary Sources</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "R. FitzRalph, <em>Summa de Quaestionibus Armenorum</em>, Johannis\nSudoris (ed.), Paris 1511.",
                "–––, <em>De Pauperie Salvatoris</em>, Books\nI–IV, R. L. Poole (ed.), in J. Wycliff, <em>De dominio divino</em>,\nLondon 1890, 257–476.\n</ul>\n<h3>"
            ],
            "<a name=\"SecSou\">Secondary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Courtenay, William J., 1987, <em>Schools &amp; Scholars in\nFourteenth-Century England</em>, Princeton: Princeton University\nPress.",
                "Duba, William O., 2013, “Conversion, Vision and Faith in the\nLife and Works of Richard FitzRalph”, in M. Dunne and S. Nolan,\n<em>Richard FitzRalph: His Life, Thought and Times</em>, Dublin: Four\nCourts Press, 103–127.",
                "Dunne, M. and S. Nolan (eds.), 2013a, <em>Richard FitzRalph: His\nLife, Thought and Times</em>, Dublin: Four Courts Press.",
                "–––, 2013b, “John Foxholes OFM Armachanus\n(†1474): A Note on his Logical Treatises Formerly Attributed to\nFitzRalph”, in M. Dunne and S. Nolan (eds.), <em>Richard\nFitzRalph: His Life, Thought and Times</em>, Dublin: Four Courts\nPress, 199–203.",
                "–––, 2012, “Richard FitzRalph on the human\nmind as a trinity of memory, understanding and will”, in\n<em>Universalità della Ragione. Pluralità delle\nFilosofie nel Medioevo Universalité de la Raison.\nPluralité des Philosophies au Moyen Âge Universality of\nReason. Plurality of Philosophies in the Middle Ages</em>. XII\nCongresso Internazionale di Filosofia Medievale. Palermo, 17–22\nsettembre 2007 a cura di Alessandro Musco e di Carla Compagno –\nSalvatore D’Agostino – Giuliana Musotto, Volume II.1,\n443–450.",
                "–––, 2010, “Richard\nFitzRalph’s <em>Lectura</em> on the\n<em>Sentences</em>”, in P. Rosemann (ed.), <em>Mediaeval\nCommentaries on the</em> Sentences <em>of Peter Lombard</em>, Leiden:\nBrill, Volume 2, 405–438.",
                "–––, 2008, “Richard FitzRalph on Time,\nMotion and Infinity”, <em>Mediaevalia Philosophica\nPolonorum</em>, 37: 1–12.",
                "–––, 2004, “Richard FitzRalph of Dundalk\n(c. 1300–1360) and the New\nWorld”, <em>Archivium Hibernicum</em>, 58:\n243–58.",
                "–––, 2001, “A fourteenth-century example\nof an <em>Introitus Sententiarum</em> at Oxford: Richard\nFitzRalph’s Inaugural Speech in praise of the <em>Sentences</em>\nof Peter Lombard”, <em>Medieval Studies</em>, 63: 1–29.",
                "Genest, J.-F., 1991, “Contingence et\nrévélation des futurs: La <em>Quaestio biblica</em> de\nRichard FitzRalph”, in J. Jolivet (ed.), <em>Lectionum\nvarietates: hommage à Paul Vignaux</em>, Paris: Vrin,\n199–246.",
                "Gwynn, A., 1933, “Richard FitzRalph, Archbishop of\nArmagh”, <em>Studies: An Irish Quarterly Review</em>, 25(97):\n81–96.",
                "Hammerich, L. L., 1938, “The Beginning of the Strife between\nRichard FitzRalph and the Mendicants, with an edition of his\nautobiographical prayer and his proposition\n<em>Unusquisque</em>”, <em>Det Kgl. Danske Viderskabernes\nSelskab. Hist.-filologiske Meddelelser</em>, 26: 3–85.",
                "Haren, M. J., 1998, “Richard FitzRalph and the Friars: The\nIntellectual Itinerary of a Curial Controversialist”, in J.\nHamesse (ed.), <em>Roma, Magistra Mundi. Itineraria Culturae\nMedievalis</em>. <em>Mélanges offerts au P. L.E.\nBoyle</em>, Turnhout: Brepols, Volume 1, 349–367.",
                "Lahey, Stephen E., 2003, <em>Philosophy and Politics in the Thought\nof John Wyclif</em>, Cambridge: Cambridge University Press.",
                "Leff, G., 1963, <em>Richard FitzRalph: Commentator of the</em>\nSentences. <em>A Study in Theological Orthodoxy</em>, Manchester: Manchester\nUniversity Press.",
                "Maier, A., 1959, <em>Aus der Grenze von Scholastik und\n Naturwissenschaft</em>, Rome: Edizione di Storia e Letteratura.",
                "Tachau, Katherine H., 2013, “Adam Wodeham and Robert Holcot as\nWitnesses to FitzRalph’s Thought”, in M. Dunne and S. Nolan\n(eds.), <em>Richard FitzRalph: His Life, Thought and\nTimes</em>, Dublin: Four Courts Press, 79–95.",
                "–––, 1982, “The Problem of the <em>Species\nin Medio</em> at Oxford in the Generation after\nOckham”, <em>Mediaeval Studies</em>, 44: 394–443.",
                "Walsh, K., 1981, <em>A Fourteenth-Century Scholar and Primate:\nRichard FitzRalph in Oxford, Avignon and Armagh</em>, Oxford: Clarendon\nPress.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"PriSou\">Primary Sources</a></h3>\n<ul class=\"hanging\">\n<li>R. FitzRalph, <em>Summa de Quaestionibus Armenorum</em>, Johannis\nSudoris (ed.), Paris 1511.</li>\n<li>–––, <em>De Pauperie Salvatoris</em>, Books\nI–IV, R. L. Poole (ed.), in J. Wycliff, <em>De dominio divino</em>,\nLondon 1890, 257–476.</li>\n</ul>\n<h3><a name=\"SecSou\">Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Courtenay, William J., 1987, <em>Schools &amp; Scholars in\nFourteenth-Century England</em>, Princeton: Princeton University\nPress.</li>\n<li>Duba, William O., 2013, “Conversion, Vision and Faith in the\nLife and Works of Richard FitzRalph”, in M. Dunne and S. Nolan,\n<em>Richard FitzRalph: His Life, Thought and Times</em>, Dublin: Four\nCourts Press, 103–127. </li>\n<li>Dunne, M. and S. Nolan (eds.), 2013a, <em>Richard FitzRalph: His\nLife, Thought and Times</em>, Dublin: Four Courts Press.</li>\n<li>–––, 2013b, “John Foxholes OFM Armachanus\n(†1474): A Note on his Logical Treatises Formerly Attributed to\nFitzRalph”, in M. Dunne and S. Nolan (eds.), <em>Richard\nFitzRalph: His Life, Thought and Times</em>, Dublin: Four Courts\nPress, 199–203.</li>\n<li>–––, 2012, “Richard FitzRalph on the human\nmind as a trinity of memory, understanding and will”, in\n<em>Universalità della Ragione. Pluralità delle\nFilosofie nel Medioevo Universalité de la Raison.\nPluralité des Philosophies au Moyen Âge Universality of\nReason. Plurality of Philosophies in the Middle Ages</em>. XII\nCongresso Internazionale di Filosofia Medievale. Palermo, 17–22\nsettembre 2007 a cura di Alessandro Musco e di Carla Compagno –\nSalvatore D’Agostino – Giuliana Musotto, Volume II.1,\n443–450.</li>\n<li>–––, 2010, “Richard\nFitzRalph’s <em>Lectura</em> on the\n<em>Sentences</em>”, in P. Rosemann (ed.), <em>Mediaeval\nCommentaries on the</em> Sentences <em>of Peter Lombard</em>, Leiden:\nBrill, Volume 2, 405–438.</li>\n<li>–––, 2008, “Richard FitzRalph on Time,\nMotion and Infinity”, <em>Mediaevalia Philosophica\nPolonorum</em>, 37: 1–12.</li>\n<li>–––, 2004, “Richard FitzRalph of Dundalk\n(c. 1300–1360) and the New\nWorld”, <em>Archivium Hibernicum</em>, 58:\n243–58.</li>\n<li>–––, 2001, “A fourteenth-century example\nof an <em>Introitus Sententiarum</em> at Oxford: Richard\nFitzRalph’s Inaugural Speech in praise of the <em>Sentences</em>\nof Peter Lombard”, <em>Medieval Studies</em>, 63: 1–29.</li>\n<li>Genest, J.-F., 1991, “Contingence et\nrévélation des futurs: La <em>Quaestio biblica</em> de\nRichard FitzRalph”, in J. Jolivet (ed.), <em>Lectionum\nvarietates: hommage à Paul Vignaux</em>, Paris: Vrin,\n199–246.</li>\n<li>Gwynn, A., 1933, “Richard FitzRalph, Archbishop of\nArmagh”, <em>Studies: An Irish Quarterly Review</em>, 25(97):\n81–96.</li>\n<li>Hammerich, L. L., 1938, “The Beginning of the Strife between\nRichard FitzRalph and the Mendicants, with an edition of his\nautobiographical prayer and his proposition\n<em>Unusquisque</em>”, <em>Det Kgl. Danske Viderskabernes\nSelskab. Hist.-filologiske Meddelelser</em>, 26: 3–85.</li>\n<li>Haren, M. J., 1998, “Richard FitzRalph and the Friars: The\nIntellectual Itinerary of a Curial Controversialist”, in J.\nHamesse (ed.), <em>Roma, Magistra Mundi. Itineraria Culturae\nMedievalis</em>. <em>Mélanges offerts au P. L.E.\nBoyle</em>, Turnhout: Brepols, Volume 1, 349–367.</li>\n<li>Lahey, Stephen E., 2003, <em>Philosophy and Politics in the Thought\nof John Wyclif</em>, Cambridge: Cambridge University Press.</li>\n<li>Leff, G., 1963, <em>Richard FitzRalph: Commentator of the</em>\nSentences. <em>A Study in Theological Orthodoxy</em>, Manchester: Manchester\nUniversity Press.</li>\n<li>Maier, A., 1959, <em>Aus der Grenze von Scholastik und\n Naturwissenschaft</em>, Rome: Edizione di Storia e Letteratura.</li>\n<li>Tachau, Katherine H., 2013, “Adam Wodeham and Robert Holcot as\nWitnesses to FitzRalph’s Thought”, in M. Dunne and S. Nolan\n(eds.), <em>Richard FitzRalph: His Life, Thought and\nTimes</em>, Dublin: Four Courts Press, 79–95.</li>\n<li>–––, 1982, “The Problem of the <em>Species\nin Medio</em> at Oxford in the Generation after\nOckham”, <em>Mediaeval Studies</em>, 44: 394–443.</li>\n<li>Walsh, K., 1981, <em>A Fourteenth-Century Scholar and Primate:\nRichard FitzRalph in Oxford, Avignon and Armagh</em>, Oxford: Clarendon\nPress.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Crathorn, William",
            "Gregory of Rimini",
            "Kilvington, Richard",
            "Wodeham, Adam de",
            "Wyclif, John"
        ],
        "entry_link": [
            {
                "../crathorn/": "Crathorn, William"
            },
            {
                "../gregory-rimini/": "Gregory of Rimini"
            },
            {
                "../kilvington/": "Kilvington, Richard"
            },
            {
                "../wodeham/": "Wodeham, Adam de"
            },
            {
                "../wyclif/": "Wyclif, John"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=fitzralph\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/fitzralph/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=fitzralph&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/fitzralph/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=fitzralph": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/fitzralph/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=fitzralph&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/fitzralph/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.fitzralph.com/\" target=\"other\">Richard FitzRalph Society</a>"
        ],
        "listed_links": [
            {
                "http://www.fitzralph.com/": "Richard FitzRalph Society"
            }
        ]
    }
}