{
    "url": "generics",
    "title": "Generic Generalizations",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Sarah-Jane Leslie\n<sjleslie@princeton.edu>\nAdam Lerner\n<adamjl@princeton.edu>",
        "author_links": [
            {
                "mailto:sjleslie%40princeton%2eedu": "sjleslie@princeton.edu"
            },
            {
                "mailto:adamjl%40princeton%2eedu": "adamjl@princeton.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nSarah-Jane Leslie\n&lt;<a href=\"mailto:sjleslie%40princeton%2eedu\"><em>sjleslie<abbr title=\" at \">@</abbr>princeton<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nAdam Lerner\n&lt;<a href=\"mailto:adamjl%40princeton%2eedu\"><em>adamjl<abbr title=\" at \">@</abbr>princeton<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Sun Apr 24, 2016",
        "substantive revision Thu Aug 4, 2022"
    ],
    "preamble": "\n\nGenerics are statements such as “tigers are striped”,\n“a duck lays eggs”, “the dodo is extinct”, and\n“ticks carry Lyme disease”. Generics express\ngeneralizations, but unlike quantified statements, generics do not\ncarry information about how many members of the kind or category have\nthe property. For example, if asked “how many ravens are\nblack?” one could reply “all [or some, or most, etc.]\nravens are black”, but one cannot felicitously reply with the\ngeneric “ravens are black” (Carlson 1977).\n\nGenerics have proved quite difficult to analyze semantically. For\nexample, “dogs are mammals” seems to require for its truth\nthat all dogs be mammals. “A tiger is striped” or\n“ravens are black”, however, are somewhat more forgiving,\nsince they are compatible with the existence of a few stripeless\ntigers and white albino ravens. “Ducks lay eggs” and\n“a lion has a mane” are more forgiving still; these\ngenerics are true even though it is only the mature members of one sex\nthat possess the relevant properties. Notice, however, that we do not\naccept “ducks are female”, even though every egg-laying\nduck is a female duck. Finally, we accept “ticks carry Lyme\ndisease”, even though very few ticks (approximately one percent)\nactually have the property, while also rejecting “humans are\nright-handed”, when over ninety percent of humans are\nright-handed.\n\nAs these examples illustrate, generics are not equivalent in meaning\nto any of the quantifying determiners such as “all”,\n“some”, or “most”. They also differ in meaning\nfrom sentences containing adverbs of quantification (Lewis 1975) such\nas “generally”, “usually”, or\n“often”. For example, the generic “books are\npaperbacks” is false, yet the insertion of any of these adverbs\nof quantification would render the statement true: “books are\ngenerally/usually/often paperbacks”.\n",
    "toc": [
        {
            "#GeneLogiForm": "1. Generics and Logical Form"
        },
        {
            "#IsolGeneInte": "1.1 Isolating the Generic Interpretation"
        },
        {
            "#StagLeveIndiLevePred": "1.2 Stage Level and Individual Level Predicates"
        },
        {
            "#DeriGeneVsExisInte": "1.3 Deriving Generic vs. Existential Interpretations"
        },
        {
            "#CharGeneDireKindPred": "1.4 Characterizing Generics and Direct Kind Predications"
        },
        {
            "#LogiFormCharGene": "1.5 The Logical Form of Characterizing Generics"
        },
        {
            "#SemaAnalGen": "2. Semantic Analyses of Gen"
        },
        {
            "#PossWorlNormBaseAppr": "2.1 Possible Worlds and Normalcy-Based Approaches"
        },
        {
            "#ReleQuanSituSema": "2.2 Relevant Quantification and Situation Semantics"
        },
        {
            "#IndeAppr": "2.3 The Indexical Approach"
        },
        {
            "#SterProt": "2.4 Stereotypes and Prototypes"
        },
        {
            "#ProbAppr": "2.5 Probabilitistic Approaches"
        },
        {
            "#IndeDefiBareSingGene": "3. Indefinite, Definite, and Bare Singular Generics"
        },
        {
            "#IndeSingGeneNorm": "3.1 Indefinite Singular Generics and Normativity"
        },
        {
            "#DefiBareSingGene": "3.2 Definite and Bare Singular Generics"
        },
        {
            "#GenePsyc": "4. Generics and Psychology"
        },
        {
            "#GeneDefaHypo": "4.1 The Generics-as-Defaults Hypothesis"
        },
        {
            "#GeneSensContBaseFact": "4.2 Are Generics Sensitive to Content-Based Factors?"
        },
        {
            "#BayeModeGene": "4.3 A Bayesian Model of Generics"
        },
        {
            "#InfeGene": "4.4 Inferences from Generics"
        },
        {
            "#BeyoLangPhilApplGene": "5. Beyond Language: Philosophical Applications of Generics"
        },
        {
            "#GeneSterPrej": "5.1 Generics, Stereotyping and Prejudice"
        },
        {
            "#GenePhilGene": "5.2 Generics and Philosophy More Generally"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Generics and Logical Form\n\nIn English, generics can be expressed using a variety of syntactic\nforms: bare plurals (e.g., “tigers are striped”),\nindefinite singulars (e.g., “a tiger is\nstriped”), and definite singulars (“the tiger is\nstriped”). However, none of these syntactic forms is dedicated\nto expressing generic claims; each can also be used to express\nexistential and/or specific claims. Further, some generics express\nwhat appear to be generalizations over individuals (e.g.,\n“tigers are striped”), while others appear to predicate\nproperties directly of the kind (e.g., “dodos are\nextinct”). These facts and others give rise to a number of\nquestions concerning the logical forms of generic statements.\n1.1 Isolating the Generic Interpretation\n\nConsider the following pairs of sentences:\n\n(1)\n\n\na.\nTigers are striped.\nb.\nTigers are on the front lawn.\n \n(2)\n\n\na.\nA tiger is striped.\nb.\nA tiger is on the front lawn.\n \n(3)\n\n\na.\nThe tiger is striped.\nb.\nThe tiger is on the front lawn.\n \n\n\nThe sentence pairs above are prima facie syntactically\nparallel—both are subject-predicate sentences whose subjects\nconsist of the same common noun coupled with the same, or no, article.\nHowever, the interpretation of first sentence of each pair is\nintuitively quite different from the interpretation of the second\nsentence in the pair. In the second sentences, we are talking about\nsome particular tigers: a group of tigers in\n (1b),\n some individual tiger in\n (2b),\n and some unique salient or familiar tiger in\n (3b)—a\n beloved pet, perhaps. In the first sentences, however, we are saying\nsomething general. There is/are no particular tiger or tigers\nthat we are talking about.\n\nThe second sentences of the pairs receive what is called an\nexistential interpretation. The hallmark of the existential\ninterpretation of a sentence containing a bare plural or an indefinite\nsingular is that it may be paraphrased with “some” with\nlittle or no change in meaning; hence the terminology\n“existential reading”. The application of the term\n“existential interpretation” is perhaps less appropriate\nwhen applied to the definite singular, but it is intended there to\ncover interpretation of the definite singular as referring to a unique\ncontextually salient/familiar particular individual, not to a\nkind.\n\nThere are some tests that are helpful in distinguishing these two\nreadings. For example, the existential interpretation is upward\nentailing, meaning that the statement will always remain true if\nwe replace the subject term with a more inclusive term. Consider our\nexamples above. In\n (1b),\n we can replace “tiger” with “animal”\nsalva veritate, but in\n (1a)\n we cannot. If “tigers are on the lawn” is true, then\n“animals are on the lawn” must be true. However,\n“tigers are striped” is true, yet “animals are\nstriped” is false.\n (1a)\n does not entail that animals are striped, but\n (1b)\n entails that animals are on the front lawn (Lawler 1973; Laca 1990;\nKrifka et al. 1995).\n\nAnother test concerns whether we can insert an adverb of\nquantification with minimal change of meaning (Krifka et al. 1995).\nFor example, inserting “usually” in the sentences in\n (1a)\n (e.g., “tigers are usually striped”) produces only a\nsmall change in meaning, while inserting “usually” in\n (1b)\n dramatically alters the meaning of the sentence (e.g., “tigers\nare usually on the front lawn”). (For generics such as\n“mosquitoes carry malaria”, the adverb\n“sometimes” is perhaps better used than\n“usually” to mark off the generic reading.)\n1.2 Stage Level and Individual Level Predicates\n\nHaving distinguished two quite different meanings of these seemingly\nsimilar sentence pairs, the question arises: what is the basis of\nthese two interpretations? This is of course a matter of debate, but\none important thesis is that it is the predicate that determines which\nof the two readings the subject will receive, particularly in the case\nof bare plural generics. In his 1977 dissertation, Greg Carlson argued\nthat the distinction between “stage level” and\n“individual level” predicates is key here, and proposed\nthat stage level predications give rise to existential readings of\nbare plurals and indefinite singulars, while individual level ones\ngive rise to generic readings. The distinction between the two types\nof predicates can be drawn intuitively, and also on the basis of\nlinguistic patterns (Milsark 1974; Carlson 1977; Stump 1985).\nSemantically, individual level predicates express properties that\nnormally are had by items for quite extended periods, often comprising\nthe items’ whole existence. Stage-level predicates, on the other\nhand, express properties normally had by items for relatively short\ntime intervals. Some examples of both types are as follows:\n\nIndividual level predicates\n\n“is tall”; “is intelligent”; “knows\nFrench”; “is a mammal”; “is female”;\n“is a singer”; “loves Bob”; “hates\nBob”\n\nStage level predicates\n\n“is drunk”; “is barking”; “is speaking\nFrench”; “is taking an exam”; “is\nsober”; “is sick”, “is sitting”;\n“is on the lawn”, “is in the room”.\n\nClearly the semantic distinction is not hard and fast: a teetotaler\nmay be sober for the entire course of his existence, and the\nchronically ill may be sick for the entire course of theirs, and Alice\nin Wonderland is tall at some times but short at others. In the normal\ncourse of affairs, individual level predicates express more stable and\nless temporally intermittent properties than stage level ones do.\n\nThe distinction also manifests itself linguistically. Stage level\npredicates are permissible in the following constructions, while\nindividual level ones are not:\n\n(4)\nJohn saw Bill drunk/sober/sick/naked.\n(5)\nJohn saw Bill speaking French/taking an exam/smoking\ncigarettes.\n(6)\nJohn saw Bill on the lawn/in the room.\n(7)\n*John saw Bill intelligent/tall/a mammal/male.\n(8)\n*John saw Bill knowing French/hating Bob.\n\n\nThere-insertion constructions behave similarly:\n\n(9)\nThere are men drunk/sober/sick/naked.\n(10)\nThere are men speaking French/taking an exam/smoking\ncigarettes.\n(11)\nThere are men on the lawn/in the room.\n(12)\n*There are men intelligent/tall/mammals/male.\n(13)\n*There are men knowing French/hating Bob.\n\n\nStage level predicates can be modified by locatives, while individual\nlevel ones cannot:\n\n(14)\nJohn is drunk/speaking French/smoking in 1879 Hall.\n(15)\n*John is a mammal/intelligent/male in 1879 Hall.\n(16)\n*John knows French/hates Bob in 1879 Hall.\n\n\nCarlson noted the difference in syntactic behavior between individual\nand stage level predicates, and proposed that the distinction between\nthe classes of predicates underlies the distinction between\nexistential and generic readings of bare plurals:\n\n(17)\nStudents are drunk/speaking French/on the lawn. (existential)\n(18)\nStudents are intelligent/mammals/tall/male. (generic)\n(19)\nStudents know French/hate Bob. (generic)\n\n\nStage level predicates appear to give rise to the existential reading\nof bare plurals, while individual level ones give rise to generic\nreadings. Carlson also took the distinction to underwrite the\ndifference between existential and generic readings of the indefinite\nsingular:\n\n(20)\nA student is drunk/speaking French/on the lawn. (existential)\n(21)\nA student is intelligent/a mammal/tall/male. (generic)\n(22)\nA student knows French/hates Bob. (generic)\n\n\nThis seems to be correct, though there is more to say about the\nindefinite singular in this regard. In particular, the indefinite\nsingular receives an existential interpretation even with individual\nlevel predicates when the property attributed is “out of the\nblue”, or to a very unnatural kind. Yael Greenberg (2003) asks\nus to note the contrast between the following pairs. Both statements\ninvolve individual level predicates, and accordingly the bare plural\nreceives a generic interpretation. It is, however, very difficult to\ninterpret the following indefinite singular statements as anything\nother than existential statements, conveying a remarkable fact about a\nparticular individual:\n\n(23)\nFamous semanticists sing German arias in the shower.\n(24)\nA famous semanticist sings German arias in the shower.\n(25)\nTall, left-handed, brown-haired neurologists from France earn more\nthan $150,000 a year.\n(26)\nA tall, left-handed, brown-haired neurologist from France earns\nmore than $150,000 a year.\n\n\nThe contrast between stage level and individual level predicates would\nthus seem to be insufficient to explain the availability of the\ngeneric interpretation of indefinite singular statements.\n\nIt should further be noted that the distinction between stage level\nand individual level predicates cannot explain the two readings of\ndefinite singulars. If there is a salient tiger before us, an\nutterance of “the tiger is intelligent” or “the\ntiger is male” will easily be interpreted non-generically as\npertaining to the particular tiger in question, despite the fact that\nthese are individual level predications. The distinction is not\nirrelevant here since it is true that stage level predications may\nreliably give rise to non-generic interpretations, but clearly there\nis more to story in the case of the definite singular.\n1.3 Deriving Generic vs. Existential Interpretations\n\nHow exactly might the distinction between stage level and individual\nlevel predicates give rise to existential vs. generic readings of bare\nplurals? The original proposal is due to Greg Carlson (1977), however\nCarlson himself later came to reject the basics of his account\n(Carlson 1989). More recent discussion can be found in Diesing (1992),\nChierchia (1995), Kratzer (1995), Cohen and Erteschik-Shir (1997,\n2002), Kiss (1998), and others.\n\nIn Carlson’s original account, he proposed that stage level\npredicates are lexically represented with existential quantifiers.\nThese quantifiers range over realizations of individuals.\nCarlson’s metaphysical outlook was as follows: the set of\nindividuals is composed of both objects (by which he meant regular,\neveryday concrete items) and kinds. Both objects and kinds have\nrealizations. A realization of an object is a temporal slice thereof.\nA realization of a kind is either an object that belongs to\nthe kind, or a temporal slice of such an object. Kinds are directly\ndenoted by bare plurals, on Carlson’s view—that is, bare\nplurals are singular referring terms, like names.\n\nConsider now the predicate “is smoking”. This is a stage\nlevel predicate; on Carlson’s view only stages (temporal slices)\nof objects are ever smoking. Natural language, however, does not\nsupply temporal slices as objects of predication, but rather\nindividuals—at least on the surface. To resolve this mismatch,\nthe predicate “is smoking” would have to be lexicalized\nas \n\\[ \\lambda x \\exists y(R(y,x) \\mathbin{\\&} \\textrm{smokes}(y)) \\]\n\n\n“R” here means “is a realization of”,\nin Carlson’s sense. The predicate can be applied to an object,\nsuch as John, to yield: \n\\[ \\exists y(R(y, j) \\mathbin{\\&} \\textrm{smokes}(y)) \\]\n\n\nThus (setting aside tense), “John is smoking” is true iff\nsome realization (i.e., temporal stage) of John is engaged in smoking.\nThe predicate can also be applied to kinds, as in “students are\nsmoking”: \n\\[ \\exists y(R(y, s) \\mathbin{\\&} \\textrm{smokes}(y)) \\]\n\n\nHere “s” picks out the kind student, and\nthe sentence is true iff there are some realizations of the kind that\nare engaged in smoking. (Recall that the realizations of the kind\nstudent include both the particular individual\nstudents and the temporal stages of those individual\nstudents.) Thus we obtain the existential reading of the bare plural\nin virtue of the lexical representation of stage level predicates.\n\nIndividual level predicates hold of individuals, not stages, and so\nare directly predicated of their subjects. There is no inherent type\nmismatch here, and so individual level predicates are lexicalized\nwithout any such built-in quantifiers. As a first pass attempt at a\nsemantic formalization, Carlson took all individual level predicates\nto be directly applicable to kinds, so “Cats like Bob”\nwould have as a logical form simply “\\(\\textrm{Like}(c,\nb)\\)”. Carlson went on to note that this approach meets with\ndifficulties when faced with sentences such as “Cats like\nthemselves”. “\\(\\textrm{Like}(c, c)\\)” is does not\ncapture the appropriate truth conditions, since it corresponds only to\n“cats like cats”, and not to “cats like\nthemselves”.\n\nTo deal with this, he introduces a monadic predicate operator \\(G'\\)\nto take object-level predicates to kind-level predicates. “Cats\nlike themselves” would be formalized as “\\(G'(\\lambda x\n(\\textrm{Like}(x, x))(c)\\)”, which is to be understood as true\niff the object level predicate “\\(\\lambda x (\\textrm{Like}(x,\nx))\\)” holds with sufficient regularity of the realizations of\nthe kind. Carlson took no stand on what this sufficient regularity\namounts to, other than to say that it is not the job of semantics to\ntell us when an item satisfies a predicate containing\n“\\(G'\\)”, anymore than it is the job of semantics to tell\nus when an item satisfies any predicate. Semantics tells us\nthat “John is red” is true iff John satisfies “is\nred”, which in turn holds iff John is red. Semantics does\nnot tell us whether John is red, nor how to go about\ndetermining whether John is red. Whether an item has a property is not\na question for semantics.\n\nCarlson later came to reject this account of the logical form of\ngenerics—in particular, he came to reject the idea that there is\na one-place predicate operator such as \\(G'\\), and instead embraced\nthe idea that any generic operator should instead be two-place (1989).\nThis point is taken up below in the section on the logical form of\ncharacterizing generics. First, though, it is helpful to draw a\ndistinction between two different kinds of generics.\n1.4 Characterizing Generics and Direct Kind Predications\n\nIt is helpful to separate out two categories of generic statements.\nOur first category includes statements such as “tigers are\nstriped”, “ravens are black”, “a lion has a\nmane”, and “the leopard has spots”. These statements\nare naturally thought of as expressing generalizations about\nindividual members of the kind. For example, we might suppose that\n“tigers are striped” is made true by enough individual\ntigers possessing stripes. The exact nature of these generalizations\nis highly controversial.\n\nIn our second category, we have statements like “dinosaurs are\nextinct”, “the dodo is extinct”, “tigers are\nwidespread”, and “the domestic cat is common”, which\nare often thought to predicate a property directly of the kind in\nquestion, rather than expressing generalizations concerning its\nmembers. For example, in saying “dinosaurs are extinct”,\none says something about the kind dinosaur, namely that that\nkind of thing is extinct. We may notice that it is not possible to say\nof an individual dinosaur, Dino, that Dino is extinct, since only a\nkind can be extinct. Thus, for these generics, Carlson’s\noriginal idea—that bare plurals can refer directly to kinds, and\nthus that (at least some) generics involve predicating properties\ndirectly of kinds—remains widely accepted.\n\nExamples of this second category are often referred to as\n“direct kind predications” while examples of the first are\nknown as “characterizing generics”. (Direct kind\npredications are also known as D-generics (“D” for\n“definite”); characterizing generics are also known as\nI-generics (“I” for “indefinite”) (Krifka\n1987).) It should be noted that the indefinite singular form on its\nstandard interpretation cannot be used to express a direct kind\npredication: statements such as “a dinosaur is extinct”\nand “a tiger is widespread” are not felicitous. (They can\nof course be heard as felicitous if they are given a very different\ninterpretation, so that their domain ranges over particular\nkinds—e.g., “a dinosaur, namely the T. rex, is\nextinct”—but this is not the relevant interpretation. To\nsee the difference, consider statements involving kinds that do not\nthemselves have salient subkinds, e.g., perhaps “a T.\nrex is extinct”.)\n\nMuch of the work on the semantics of generics has been focused on\ncharacterizing generics, since they have proved the most elusive. It\nis widely accepted that sentences like “dinosaurs are\nextinct”, “the dodo is extinct”, and “tigers\nare widespread” are singular statements that predicate\nproperties directly of kinds. For example, “tigers are\nextinct” predicates the property of being extinct\ndirectly of the kind Panthera tigris, and would be true just\nin case Panthera tigris had the property of being extinct\n(Krifka et al. 1995). The semantics of characterizing generics have\nproved much less tractable.\n1.5 The Logical Form of Characterizing Generics\n\nFor the remainder of this entry, we will be concerned only with\ncharacterizing generics, since they have received the most attention,\nand been the subject of most controversy. Henceforth, we will use the\nterm “generics” to mean specifically characterizing\ngenerics. This section discusses the dominant theory of the logical\nform of characterizing generics, and of necessity involves some\ntechnical material.\n\nIt is generally agreed nowadays that, contra Carlson’s earliest\nwork, there is a two-place operator, usually termed Gen,\nwhich functions as an adverb of quantification (Lewis 1975). Adverbs\nof quantification include “usually”,\n“generally”, “typically”,\n“always”, “sometimes”, and so on. They\nfunction to relate one set of conditions containing at least one free\nvariable to another set. Adverbs of quantification are, in\nLewis’s sense, unselective, meaning that they bind any number of\nfree variables in the sentence, be they objects, events, or locations.\nConsider, for example, the following sentence:\n\n(27)\nWhen m and n are positive integers, the power\n\\(m^n\\) can always be computed by successive multiplication.\n\n\nFollowing Lewis (1975), we should understand “always” as\nrelating the material in the when-clause to the material in the main\nclause in following way:\n\n(28)\nAlways m, n [m and n are\npositive integers] [the power \\(m^n\\) can be computed by successive\nmultiplication]\n\n\nThis representation is based on Lewis’s (1975) paper, and is\nsaid to be a tripartite structure, consisting of a quantifier\nQ, a Restrictor R (picking out the domain of\nQ), and the Scope S, also called the matrix (picking\nout the properties attributed to Q elements of R).\nTripartite structures take the form “Q [R]\n[S]”. The sentence represented by the tripartite\nstructure is true iff Q Rs satisfy S.\n\nIn the above examples\n (27)\n and\n (28),\n the material from the when-clause is placed in the Restrictor, and\nthe material from the main clause is placed in the Scope. There are\ntwo free variables in the Restrictor, namely m and\nn, and so both are bound by the adverb of quantification\n“always”, which is naturally understood as a universal\nquantifier.\n\nGenerics are most commonly assimilated to this model\n(but see Nguyen, 2020). Carlson himself (1989)\nrejected his original one-place generic operator, on the grounds that\nit could not capture ambiguities as well as a two-place operator. He\nconsiders the following sentence:\n\n(29)\nTyphoons arise in this part of the Pacific.\n\n\nThis has two distinct generic readings, which can be paraphrased as\nfollows:\n\n(30)\nTyphoons in general have a common origin in this part of the\npacific.\n(31)\nThere arise typhoons in this part of the Pacific.\n\n\nIt would be a mistake to take the latter reading to be an existential\nreading: it does not simply mean that there are some particular\ntyphoons that originated in the relevant location, but rather seems to\nbe saying something general about the relevant location: situations\ninvolving that location are—with sufficient\nregularity—situations involving the arising of typhoons. A\ndyadic non-selective operator can easily accommodate both\nreadings:\n\n(32)\n\\(\\textit{Gen } x [\\textrm{Typhoon}(x)]\n[\\textrm{Arises-in-this-part-of-the-pacific}(x)]\\)\n(33)\n\\(\\textit{Gen } s [\\textrm{In-this-part-of-the-pacific}(s)]\n\\exists y [\\textrm{Typhoon}(y)\\ \\mathbin{\\&}\\)\n\\(\\textrm{Arises-in}(y, s)]\\)\n\n\nThe monadic operator can only yield the first (less natural)\ninterpretation: \n\\[G'(\\textrm{arises-in-this-part-of-the-pacific}(x))(\\textrm{typhoons}).\\]\n\n\nSchubert and Pelletier (1987) also offer compelling arguments in favor\nof a dyadic generic operator.\n\nIn keeping with this proposal, a common assumption (Heim 1982; Kamp\n1981; Kamp and Reyle 1993; Diesing 1992; Kratzer 1995; and many\nothers) is that indefinites such as bare plurals and indefinite\nsingulars contribute predicates with unbound variables to the logical\nforms containing them. In the course of syntactic operations, the\nmaterial in the sentence is divided up into the restrictor and scope\n(e.g., Diesing 1992). If the sentence contains a quantificational\nadverb (e.g., “usually”, “always”), then any\nunbound variables in the restrictor are bound by that quantificational\nadverb, as in example\n (28)\n above. However, if there is no quantificational adverb, the generic\noperator Gen is introduced to bind those variables. Thus, to\ntake a simple example, the logical form of a sentence like\n“ravens are black” may be given as follows:\n\n(34)\nGen x [Ravens(x)]\n[Black(x)]\n\n\nEven theorists who do not agree with the assumption that indefinites\ncontribute just predicates and unbound variables to their logical\nforms (see, e.g., Chierchia 1998) tend to agree that a tripartite\nstructure nonetheless is the correct analysis for generics. One\nnotable exception is David Liebesman (2011), who argues that\ncharacterizing generics are themselves direct kind\npredications—that, e.g., “tigers have stripes” is\nbest understood as simply the attribution of the predicate “have\nstripes” to the kind tigers. (See also Cohen 2012;\nTeichman 2016. Cohen argues that although pragmatic factors lead many\ngenerics to ultimately receive reinterpretations involving Gen,\ngenerics are always in the first instance kind predications.) It is\nnot clear, however, whether a view such as Liebesman’s is able\nto account for the full range of semantic data. Recall that sentences\nsuch as “cats lick themselves” led Carlson (1977) to\nintroduce a G‘ operator to capture the dominant interpretation,\nnamely that individual cats lick themselves (i.e., their own\nbodies)—an interpretation which is not captured by the logical\nform Lick(cats, cats). Similar complications arise for generics\ninvolving so-called donkey anaphora, e.g., “lions that see a\ngazelle chase it”. Without the additional structure provided by\nan operator, it is not clear how these sentences can be adequately\ncaptured (Leslie 2015a).\n\nThe term “generic” is sometimes extended to sentences such\nas “Mary smokes after work”, since these habitual\nstatements share various features with generics, although they do not\nexpress generalizations concerning kinds. It is often\nbelieved that these statements should be analyzed with Gen\n(e.g., Lawler 1972; Schubert and Pelletier 1989; Krifka et al. 1995,\nand many others):\n\n(35)\nGen e [Relevant-event-involving-Mary(e)\n& Occurs-after-work(e)]\n[Event-of-Mary-smoking(e)]\n\n\nFor the remainder of this entry, the term “habitual”\nrather than “generic” will be used for these\nstatements.\n2. Semantic Analyses of Gen\n\nA great deal of work has been done on the semantics of\n(characterizing) generics, particularly on bare plural\n(characterizing) generics. It is easy to see why this is so:\n“Ducks lay eggs” is a true generic, while “ducks are\nfemale” is false, yet it is only the female ducks who ever lay\neggs. “Mosquitoes carry the West Nile virus” is true, and\n“books are paperbacks” is false, yet less than one percent\nof mosquitoes carry the virus, while over eighty percent of books are\npaperbacks. How are we to account for these puzzling facts?\n\nIt is clear that generics are not equivalent to universal statements,\nbut rather permit exceptions—that is, generics can be true even\nif some (or sometimes many) members of the kind lack the property in\nquestion. Generics also do not mean “most”; it is false\nthat most mosquitoes carry the West Nile virus and true that most\nbooks are paperbacks, but our intuitions about the truth/falsity of\nthe corresponding generics are reversed.\n\nAs these examples suggest, Gen cannot be analyzed as sharing\na meaning with any of the standard quantifiers. One question that\ncomes up immediately is whether Gen can be considered a\nquantifier in any sense. Carlson (1977) argued informally that it\ncould not, since generics do not tell us how much or how\nmany. He notes that, if asked “how many tigers are\nstriped”, one could reply “most/all/many/some tigers are\nstriped”, but not simply “tigers are striped” (see\nLeslie (2007) for a more formal argument, which goes by way of the\npremise that quantifiers exhibit isomorphism invariance, while\nGen does not.).\n\nA significant number of theories concerning the meaning of generics\nhave been offered over the years. Most theories have focused primarily\non bare plural generics, though some theories are intended to cover\nindefinite and definite singulars too. We will conclude with some\nremarks concerning issues specific to indefinite and definite\nsingulars.\n2.1 Possible Worlds and Normalcy-Based Approaches\n\nMany accounts of generics are framed in terms of some or other type of\nquantification over possible worlds (Dahl 1975, Delgrande 1987,\nSchubert and Pelletier 1989, Asher and Morreau 1995, Krifka et al.\n1995, Pelletier and Asher 1997, Greenberg 2003, and others). Often,\nthese possible worlds are employed to capture the intuition that\ngenerics tell us something about what is normal for members\nof a kind (see Nickel 2008, 2016). For example, it is natural to think\nthat a generic such as “tigers are striped” tells us\nsomething about normal tigers; the only exceptions to it are those\ntigers who are albino, and so, one could argue, in some respect\nout-of-step with the norm for the kind. Similarly, “dogs have\nfour legs” may strike us as true because the only dogs that do\nnot have four legs either have birth defects or have met with\nmisfortune.\n\nPossible worlds are helpful here, because they allow us to consider,\nsay, worlds in which things go as normally as possible for a\ngiven tiger, even if life is actually quite abnormal for that\ntiger. For example, Asher, Morreau, and Pelletier argue that\n“Ks Φ” is true iff for each individual\nK, the most normal worlds for that K (according to a\ncontextually determined ordering base), are such that that K\nΦs (Asher and Morreau 1995; Pelletier and Asher 1997). Glossed in\nmore intuitive terms, the account states that a generic\n“Ks Φ” is true iff each individual K\nwould have the property Φ if all were to go as normally as\npossible for that K with respect to the relevant property.\nThus, while in actuality some dogs are three legged, one might suppose\nthat, had things gone more normally for each of those dogs with\nrespect to how many legs they have, they would have had four\nlegs.\n\nPelletier, Asher, and Morreau connect their semantic account of\ngenerics to the literature on defeasible validity (McCarthy 1986;\nReiter 1987, and others). A set of premises defeasibly or\nnon-monotonically entails a conclusion if the conclusion is\nlikely or reasonable given the premises, yet it is nonetheless\npossible for the premises to be true and the conclusion false. They\nargue that there are many defeasibly valid patterns of entailment that\ninvolve generics, and that their semantics explains why this is so.\nFor example, if Fido is a dog and dogs have four legs, then the\ninference that Fido has four legs is held to be defeasibly valid. It\nis possible that Fido is a three legged dog, but it is still\nreasonable to suppose that Fido is four legged on the basis\nof the premises. The reasonableness of this inference is explained on\nPelletier, Asher, and Morreau’s semantics—the generic\n“dogs have four legs” guarantees that, if things go\nnormally for a given dog with respect to its number of legs, then that\ndog will have four legs. Since we have been given no reason to suppose\nthat Fido is abnormal, one may defeasibly conclude that Fido is four\nlegged.\n\nIndisputably, a large number of true generics of the form\n“Ks Φ” are such that, if things go normally\nfor a given K, then it has the property Φ. However, there\nwould seem to also be a number of true generics which do not fit this\nprofile: “ducks lay eggs”, “lions have manes”,\n“mosquitoes carry the West Nile virus”, and “sharks\nattack swimmers”. The last two generics present a significant\ndifficulty for normalcy-based accounts, since it is surely not\nnormal for a mosquito to carry the virus, nor is it\nnormal for a shark to attack a bather. For generics such as\n“ducks lay eggs” and “lions have manes”,\nseveral theorists have argued that the domain of discourse is\nrestricted so that we are talking about only the female ducks and the\nmale lions respectively, and thus have aimed to rescue normalcy-based\napproaches from this criticism (e.g., Pelletier and Asher 1997), since\nperhaps it is abnormal for a given female duck to fail to lay eggs.\nPelletier and Asher suggest that a generic can be restricted to a\nsubkind of the kind in question in this way; that is, “ducks lay\neggs” means female ducks lay eggs because female\nducks constitute a subkind of the kind ducks.\n\nHowever, on such a proposal, it is difficult to avoid the prediction\nthat “ducks are female” should also be a true\ngeneric—why can this generic not be made true by similarly\nrestricting the domain to include only this subkind of ducks? Or\nconversely, consider “ducks don’t lay eggs”.\nCertainly one subkind of ducks—namely the male\nducks—don’t lay eggs, but this does not seem to suffice to\nmake the generic “ducks don’t lay eggs”\ntrue. Asher and Pelletier (2012) offer a development of the\nnormalcy-based account intended to remedy these problems.\n\nFurther, a recent experiment examined whether people think that a kind\nin which a property is had only by one sex (i.e., where domain\nrestriction to a subkind is possible) is a better satisfier of the\ngeneric than a kind in which half the members, regardless of sex, have\nthe property (i.e., where no such restriction to a subkind is\npossible). If generics like “ducks lay eggs” are only\naccepted because people are implicitly restricting the domain to a\nsubkind whose members generally possess the property, then they should\nshow a preference for one of the possible distributions over the\nother. However, no such preference was found (Cimpian, Gelman and\nBrandone 2010). Khemlani, Leslie, and Glucksberg (2012) also report\nempirical evidence that further suggests that people do not understand\nthese generics to involve domain restriction—in particular, that\npeople are more likely to judge that an arbitrary duck lays eggs than\nthey are to judge that an arbitrary duck is female (but see\nLazaridou-Chatzigoga and Stockall (2013) for some evidence in favor of\ndomain restriction). This pattern is difficult to explain if people\nonly accept “ducks lay eggs” because of domain\nrestriction. If one cannot appeal to domain restriction to handle\n“ducks lay eggs”, then such generics would appear to\nconstitute counterexamples to this sort of approach.\n2.2 Relevant Quantification and Situation Semantics\n\nAppeals to domain restriction are not limited to normalcy-based\napproaches. In light of generics such as “ducks lay eggs”,\nsome theorists have argued that generics involve quantification over\nrelevant individuals (actual or possible), where context\ndetermines which individuals are relevant (e.g., Schubert and\nPelletier 1987; Declerk 1991; Chierchia 1995). On such views, when we\nconsider a generic such as “ducks lay eggs”, only the\nmature, fertile female ducks enter into our evaluation of the\nsentence, because, e.g., they are the only potential egg-layers. The\nquestion that arises is how exactly to determine which individuals are\nrelevant. Schubert and Pelletier (1987) offer a detailed discussion of\nhow some of these restrictions arise—e.g., via presupposition,\nfocus, linguistic context, or explicit restriction as appropriate.\n\nTer Meulen (1986), Gerstner-Link (1988), and Cavedon and Glasbey\n(1994) offer treatments of generics in the framework of situation\nsemantics (Barwise and Perry 1983). On such views, generics express\nconstraints on situations—e.g., “tigers are\nstriped” expresses the constraint that every situation involving\na tiger involves a striped tiger. Constraints are not reducible to the\nproperties of individuals (Cavedon and Glasbey 1994). The\ninterpretation of a generic on these views is relative to a given\ncontext (or “channel” as they style it), so as on the\nabove views, generics such as “ducks lay eggs” are\nevaluated only with respect to the female ducks (Cavedon and Glasbey\n1994).\n\nAs noted above, there are philosophical and empirical difficulties\n(Cimpian, Gelman et al. 2010; Leslie 2008; Khemlani et al. 2012)\nfacing any accounts that rely on domain restriction to handle generics\nsuch as “ducks lay eggs”. For these accounts to succeed,\nthese difficulties would need to be addressed in more detail.\n2.3 The Indexical Approach\n\nSterken (2015a) has recently argued that relevant quantification alone\ncannot capture the extent to which generics are context-sensitive.\nAccording to Sterken, not only does lexical restriction vary as a\nfunction of context, but so does quantificational force. As an\nillustration, consider the generic “cats are black”. This\ncould be uttered by parents trying to teach their children about cats,\nor it could be uttered in response to a teacher asking the class what\ncolors cats are. In the first context, the truth of “cats are\nblack” seems to require that all cats be black. In the second\ncontext, the truth of “cats are black” seems to require\nonly that some cats are black.\n\nSterken argues that the best explanation of why the truth conditions\nof generics vary across context in this way and others is that\nGen is an indexical. In terms of logical form, this means\nthat Gen is composed of two free variables: one representing\nquantificational force and one representing lexical restriction. Like\nall indexicals, Gen has what Kaplan (1989) calls a\ncharacter, a function from contexts of utterance to the\nsemantic values. Given a context of utterance, the character of\nGen assigns semantic values to the free variables, resulting\nin the generic expression having as its content a particular\ngeneralization. The resulting view is intended to capture the various\nways the truth conditions of a generic depend not only on the kind in\nquestion and the property being predicated, but also on the wider\ncontext of utterance.\n\nThe main challenge for the indexical approach is that of specifying\nthe character of Gen. Sterken suggests that the character of\nGen is such that the content of a generic utterance depends\non what generalization the speaker intends the utterance to express\nand whether her intention could be recognized by a sufficiently\nidealized person that is privy to the conversation. If the character\nof Gen is as described, this seems to explain why generics\ncan be so flexible. However, it also seems to make generics\ntoo flexible: some generics (e.g., “tigers don’t\nhave stripes”, “ravens are white”) seem\nstraightforwardly false and some generics seem straightforwardly true\n(e.g., “triangles have three sides”, “primates\naren’t avians”), regardless of the speaker’s\nintentions (and of anyone’s ability to detect those intentions).\nWhether such an account can handle such cases remains to be seen.\nMoreover, the indexical account is supplemented by Sterken with an\nerror theory for generics such as “mosquitoes carry West Nile\nvirus” (2015b), further increasing its flexibility. For critical\ndiscussion of the motivation for the error theory, see Almotahari\n(forthcoming). More generally, the indexical account—unless it\nis supplemented with a rich metasemantic account of the character of\nGen—is not clearly constrained enough to issue in\nsubstantive predictions concerning the truth/falsity of generics.\n2.4 Stereotypes and Prototypes\n\nA somewhat different approach to the semantics of generics is taken by\ntheorists who suppose that generics express stereotypes or prototypes.\nOn such views, “tigers are striped” would express that the\nstereotypical or prototypical tiger is striped, and likewise,\n“sharks attack bathers” would express a belief about the\nstereotypical or prototypical shark. Geurts (1985) and Declerk (1986)\nsuggest that generics may be interpreted as expressing culturally\naccepted stereotypes, and Platteau (1980), Nunberg and Pan (1975), and\nHeyer (1985, 1990) claim that generics express prototypes, in the\nsense of Rosch (1978). Thus on such views, “tigers are\nstriped” would express the fact that the stereotypical or\nprototypical tiger is striped.\n\nA general concern with views of this type is that they would seem to\nmake the holding of the relevant sort of false belief sufficient to\nrender the generic true. For example, suppose that people falsely\nassociate sliminess with snakes in the relevant way (e.g., as a\nculturally held stereotype, or part of the Roschean prototype, etc).\nThis does not make the generic “snakes are slimy” true\n(Krifka et al. 1995). While it is plausible that people often\nassert generics on the basis of their\nprototypical/stereotypical beliefs, it is implausible to think that\nthese beliefs enter into the truth conditions of generics.\nStereotypical beliefs can be, and often are, false.\n2.5 Probabilitistic Approaches\n\nCohen (1996, 1999, 2004) argues that generics can be understood in\nterms of comparative probabilities. There are two different ways for a\ngeneric to be true on Cohen’s view. The first way (Absolute) can\nbe illustrated by “tigers are striped”. This is a true\ngeneric because (roughly speaking) a randomly chosen tiger is more\nlikely than not to be striped. The second way (Relative) a generic can\nbe true involves comparison with other kinds. For example, on\nCohen’s account, “mosquitoes carry the West Nile\nvirus” is true because (again roughly speaking) if we pick a\nmosquito and another insect at random, the mosquito is more likely\nthan the insect to carry the West Nile virus. Thus on Cohen’s\nview, generics are made true (or false) by such probabilistic\nconsiderations. More precisely, Cohen’s categories are as\nfollows:\n\nAbsolute generics\n\n“Ks are F” is true iff the probability\nthat an arbitrary K that satisfies some predicate in\nAlt(F) satisfies “is F” is greater than\n.5.\n\nRelative Generics\n\n“Ks are F” is true iff the probability\nthat an arbitrary K that satisfies some predicate in\nAlt(F) satisfies “is F” is greater than\nthe probability that an arbitrary member of Alt(K) that\nsatisfies some predicate in Alt(F) satisfies “is\nF”.\n\n(In the above, Alt(F) is the set of contextually relevant\nalternatives to the property in question, and Alt(K) is the\nset of contextually relevant alternative kinds to the kind in\nquestion.) As it stands, however, Cohen’s account incorrectly\npredicts that generics such as “bees are sterile” will be\ntrue, since the probability that a given bee is sterile is greater\nthan .5. To deal with such cases, Cohen introduces the homogeneity\nconstraint:\n\nHomogeneity Constraint\n\nThe above probability conditions (exceeding .5, or exceeding that of\nthe arbitrary alternative to the kind) should hold in all salient\npartitions of the kind.\n\nGenerics such as “bees are sterile” are now predicted to\nbe false, because there is a salient partition of bees into workers,\nqueens, and drones, and queen bees have a very low probability of\nbeing sterile.\n\nHowever, Cohen’s account may face some counterexamples. For\nexample, humans are more likely to suffer from autism than other\nmammals, and so “humans are autistic” would seem to be\nfalsely predicted to be a true (relative) generic, and it is hard to\nsee how homogeneity could undermine this prediction (Leslie 2008).\nThis example illustrates that unique possession of a property by a\nkind is not generally sufficient for the truth of a generic, yet the\ncategory of relative generic predicts that, modulo homogeneity, this\nshould suffice.\n\nConversely, consider “mosquitoes carry West Nile virus”.\nThis is a true relative generic on Cohen’s view. However,\nsuppose that fleas also carried the virus, and did so at a somewhat\nhigher rate than mosquitoes. Suppose further that the flea population\nswelled to immense proportions, so that fleas outnumbered all other\ninsects. As the flea population increases, there will come a point at\nwhich mosquitoes cease to be more likely than the arbitrary insect to\ncarry West Nile virus, and so the generic “mosquitoes carry West\nNile virus” would be predicted to become false. It is perhaps\nnatural to think, though, that these are circumstances under which\n“mosquitoes carry West Nile virus” would remain\ntrue—after all, one could still catch the virus from a mosquito!\nIf this is correct, then it suggests that the analysis in terms of\nrelative probability may not be correct (Leslie 2008).\n\nEmpirical work also suggests that the homogeneity constraint does not\nguide people’s understanding of generics. For example, Cimpian,\nGelman, and Brandone (2010) found that adults are not at all reluctant\nto accept a generic that involves a property found only in one salient\npartition of a kind, contra the predictions of the\nhomogeneity constraint (though this was not the intent behind the\nexperiment).\n\nNickel (2012) offers a different kind of counterexample to\nCohen’s account: cases involving polarization. To\nillustrate, Nickel asks us to consider a case in which some Dutch\nsailors are among the best in the world. Moreover, the proportion of\nDutch sailors who meet this high standard exceeds the proportion of\nGerman sailors and the proportion of French sailors who meet it.\nNevertheless, suppose that most Dutch sailors are very poor sailors.\nIntuitively, the generic “Dutchmen are good sailors” seems\nfalse in this case. But Cohen’s account implies that it is true,\nfor the probability that a Dutchmen is a good sailor is higher than\nthe probability that someone from a relevant alternative country is a\ngood sailor, and the homogeneity constraint is satisfied.\n3. Indefinite, Definite, and Bare Singular Generics\n\nThe above discussion was primarily centered on accounts of bare plural\ngenerics, which have received the most discussion in the literature.\nSingular generics introduce their own sets of complications.\n3.1 Indefinite Singular Generics and Normativity\n\nUnlike bare plurals, singular generics can easily be infelicitous. For\nexample, it is perfectly fine to say\n (36)\n or\n (37):\n\n(36)\nA madrigal is polyphonic\n(37)\nA football hero is popular\n\n\nBut not\n (38):\n\n(38)\n*A madrigal is popular\n\n\n(Notice, however, that the plural version of\n (38)\n “madrigals are popular” is perfectly felicitous (though\nperhaps false, unfortunately).)\n\nLawler (1973) notes that indefinite singulars are only felicitous when\nthey express properties that are somehow “necessary”,\n“essential” or “inherent” to the kind.\nBurton-Roberts (1977) argues that indefinite singulars carry a special\nnormative force, while Krifka et al. (1995) take a different tact,\narguing that the facts can be accounted for in terms of logical\nform.\n\nMore generally, linguists such as Carlson (1995), Cohen (2001), and\nGreenberg (2003) have noted that generics can sometimes have a\nnormative flavor, e.g. “a gentleman opens the door for\nladies” or “boys don’t cry.” A connection\nbetween linguistic form (e.g., bare plural vs. indefinitely singular)\nand normativity is often drawn, with some theorists such as Greenberg\n(2003) and Cohen (2001) arguing that indefinite singulars can express\nonly “rules and regulations”, in the sense of Carlson\n(1995).\n\nGreenberg and Cohen offer distinct semantic analyses of the phenomenon\nof normative generics: Greenberg (2003) implements her analysis by way\nof possible worlds semantics, while Cohen proposes that the logical\nform of such normative generics are entirely different from that of\ndescriptive generics. In particular, for Cohen (2001), normative\ngenerics assert that certain rules are in effect, as opposed to\nexpressing generalizations over kinds.\n\nLeslie (2015b) offers an alternative account of how some generics can\nhave normative force, building on the work of Knobe, Prasada, and\nNewman (2013) on dual character concepts. Knobe et al. note that\ncertain concepts seem to have dual normative/descriptive senses. For\nexample, we might say of a professional scientist who cares only about\ngetting grants and publications and not at all about discovering the\ntruth that though there is a sense in which they are clearly a\nscientist, there is also a sense in which they are not a (true)\nscientist. Conversely, we might say of a postal worker who\napplies the scientific method whenever they can and who cares about\ntruth above all else that even though there is a sense in which\nthey are clearly not a scientist, there is nonetheless a sense in\nwhich they are a (true) scientist. Leslie proposes that a given\ngeneric has normative reading just in case the kind in question is\nassociated with a dual character concept.\n\nUnlike Greenberg, Cohen, and Leslie, Hesni (2021) argues that the\nnormative force of generic statements cannot be located in the\nsemantics of generic statements. Instead, Hesni proposes that when we\nconsider a wider variety of generic sentences that do not contain dual\ncharacter concepts but appear to have normative force in certain\ncontexts (e.g., “Rocks aren’t breakfast”), we must\nappeal to Gricean pragmatics to explain their normative force.\n3.2 Definite and Bare Singular Generics\n\nDefinite singular generics appear to invoke constraints similar to\nthose of indefinite singulars, but also some more besides. For\nexample, definite singular subjects are often infelicitous if they do\nnot refer to well-established kinds (Krifka et al. 1995; example from\nCarlson 1977, attributed to Barbara Partee):\n\n(39)\nThe coke bottle has a narrow neck\n(40)\n*The green bottle has a narrow neck\n\n\nWhat does it take to be a well-established kind? Krifka et al. suggest\nthat almost anything can become a well-established kind given an\nappropriate body of background knowledge. For example, suppose it is\nwell known that green bottles preserve the effectiveness of certain\nlife-saving antibiotics. In this context, a definite singular generic\nlike “The green bottle saves lives” might be true.\n\nOther constraints on the acceptability of definite singulars have been\nnoted by Nunberg and Pan (1975), Carlson (1977), Dahl (1985), and\nothers. However, definite singular generics have received less\nattention overall than indefinite singulars, while bare plurals have\nreceived by far the most discussion in the literature.\n\nIn addition to definite and indefinite singular generics, there are\nalso bare singular generics, which feature mass nouns in the subject\nposition (Ojeda 1991; Heyer 1987; Bäck 1996, Carlson 2011;\nWilkinson 1995). For example, “Gold is a metal” and\n“Nicotine is highly addictive” are two true bare singular\ngenerics. Like definite singular generics, bare singular generics have\nreceived less attention than definite singular generics and bare\nplural generics.\n4. Generics and Psychology\n\nIn recent years, there has been increasing interest in generic\ngeneralizations among psychologists. Cognitive psychology has long\nbeen interested in understanding how our conceptual knowledge\nconcerning kinds is organized and represented; however, until somewhat\nrecently the connection with generic sentences, and the\ngeneralizations they articulate, had not been explored.\nPsychologists’ interest in generics lies primarily with what\nthese sentences can reveal about our basic ways of conceiving of\nkinds, rather than specifically with formulating a semantic analysis\nof Gen. However, several results from psychology arguably\nplace important constraints on what the semantics of generic sentences\nmight look like.\n4.1 The Generics-as-Defaults Hypothesis\n\nInfants are able to make generalizations concerning kinds and\ncategories in their first year of life (e.g., Baldwin, Markman, and\nMelartin 1993), and by the mid-preschool years, children hold richly\nstructured and detailed beliefs about the general properties of\nmembers of kinds (e.g., Gelman 2003). An important question in\ncognitive development concerns the nature of these generalizations.\nHow might we characterize these cognitively fundamental\ngeneralizations? To what sorts of information is our most basic way of\ngeneralizing sensitive? And how might these generalizations be\narticulated in natural language, once it is acquired?\n\nSeveral researchers have proposed that generic sentences articulate\ncognitively fundamental, default generalizations, and that quantified\nstatements, in contrast, articulate cognitively more sophisticated\nones (e.g., Cimpian and Erickson 2012; Gelman 2010; Leslie 2007, 2008,\n2012). Generics are acquired early in development, by approximately 30\nmonths of age (Gelman, Goetz, Sarnecka and Flukes 2008; Gelman and\nRaman 2003; Graham, Nayer and Gelman 2010). By 30 months, children\nunderstand that generics tolerate exceptions (Gelman and Raman 2003),\nand several studies have found that children’s judgments of\ngenerics are similar to adults’ judgments throughout the\npreschool years (e.g., Brandone, Cimpian, Leslie and Gelman 2012;\nBrandone, Gelman, Hedglen 2015; Hollander, Gelman and Star 2002).\nInterestingly, preschool children, like adults, understand that, e.g.,\n“birds lay eggs” can be true yet “birds are\ngirls” false, even though only “girl” birds lay\neggs. Thus even preschoolers understand at least some of the\n“troublesome” generics—the generics that cause\ndifficulties for the standard semantic analyses of generics—in\nthe same way that adults do.\n\nInterestingly, several studies have found that, throughout the\npreschool years, children have a tendency to interpret kind-wide\nquantified statements as generics—e.g., evaluating a statement\nquantified with “all”, “most” or\n“some” as though it were a generic. This phenomenon has\nbeen documented among English-, Mandarin-, and Quechua-speaking\nchildren (Brandone et al. 2015; Hollander et al. 2002; Leslie and\nGelman 2012; Mannheim et al. 2011; Tardif et al. 2010; see also Gelman\nand Tardif 1998 for more discussion of the acquisition of generics by\nMandarin-speaking children). The tendency is not limited to children\neither; under some circumstances, adults will also\n“default” to the generic interpretation when confronted\nwith a quantified statement. For example, adults show a consistent\ntendency to accept, e.g., “all ducks lay eggs”, despite\nknowing that male ducks don’t lay eggs (a tendency which does\nnot seem to be due to adults interpreting the quantified statement as\nranging over subkinds of ducks; Leslie, Khemlani and Glucksberg 2011;\nMeyer, Gelman and Stilwell 2011; but see Lazaridou-Chatzigoga, Katsos,\nand Stockall 2015). Further, a range of adult reasoning errors with\nuniversal quantifiers are readily explicable on the hypothesis that\nadults sometimes interpret universally quantified statements as\ngenerics (Jönsson and Hampton 2006; Sloman 1993, 1998).\nAdditionally, both adults and preschoolers frequently recall\nquantified statements as generics, but not vice versa, a\ntendency that has been documented in both Spanish and English (Gelman,\nSánchez Tapia, and Leslie 2015; Leslie and Gelman 2012).\n\nIf generics do indeed give voice to cognitively fundamental, default\ngeneralizations, this would explain an otherwise puzzling fact: the\nabsence of an articulated word “gen” in most or perhaps\neven all natural languages. That is, languages rarely if ever contain\na dedicated, articulated operator that uniquely signals a generic\nstatement, in the way that “all” signals a universal\nstatement. Rather, languages overwhelmingly exploit less marked\nsyntactic forms to express generic statements (Dahl 1985; Krifka et\nal. 1995; see also Carlson 2012). If generics express default\ngeneralizations, this pattern can be explained: in general, if a\nsystem has a default way of operating, then it is inefficient to\nexplicitly instruct the system to operate in this way, since it will\ndo so anyway, even in the absence of instruction. If processing a\nuniversal statement requires the cognitive system to deviate\nfrom its default way of generalizing, then explicit instruction is\nrequired—hence the word “all”. If generics require\nno such deviation, then languages need not contain a word\n“gen” (Leslie 2008).\n\nThe empirical findings suggest that these cognitively fundamental\ngeneralizations are articulated as generics rather than quantified\nstatements. Compared to generic generalizations, quantified\ngeneralizations represent cognitively more taxing and sophisticated\ngeneralizations. This is potentially of philosophical interest since\nmany of the semantic analyses of Gen reviewed above aim in\nsome way or other to reduce Gen to the more theoretically\ntractable quantifiers—for example, the possible worlds and\nnormalcy-based approaches often analyze Gen in terms of\nuniversal quantification over worlds, individuals, or both. Thus, on\nsuch an account, generic generalizations constitute a specific kind of\nuniversal quantification—the restriction of universal\nquantification to a range of (often complex, abstract) entities. On\nsuch an account, generics depend on universal quantification, and the\nlatter is in some sense more fundamental than the former. Depending on\none’s view of the subject matter of semantics, it may be a\nchallenge to reconcile such a view with the available psychological\ndata.\n4.2 Are Generics Sensitive to Content-Based Factors?\n\nResearchers who take a psychological approach to generics have also\nrecently proposed that our judgments of generics may be sensitive to a\nrange of content-based factors. That is, while standard semantic\nanalyses of generics aim to treat them in an abstract, formal\nframework, psychologically-oriented theorists have argued instead that\ngeneric generalizations are sensitive to the nature of the property\nbeing generalized. For example, consider the generics\n“mosquitoes carry West Nile virus”, “sharks attack\nswimmers”, and “ticks carry Lyme disease”. People\nrobustly accept such generics, despite knowing that very few members\nof the kind have the property in question. One possibility is that\nsuch familiar generics are accepted at low prevalence levels because\nthe property in question is dangerous—the sort of property one\nwould do well to avoid (Leslie 2008). This hypothesis is\nsupported by experimental data that finds that people are more likely\nto accept novel generics at low prevalence levels if the\nproperty in question is a dangerous one (Cimpian, Brandone and Gelman\n2010). As noted above, generics like “ticks carry Lyme\ndisease” have proved difficult for the formal semantic\napproaches to accommodate. If generics are indeed sensitive to factors\nsuch as whether the property is question is dangerous or not, this\ndifficulty would be expected—since formal semantic frameworks do\nnot normally take into account such features of the property, but\nrather aim to abstract away from such content-based\nconsiderations.\n\nIf generic generalizations are indeed sensitive to the nature of the\nproperty being generalized, might that account for other\n“troublesome” generics? In addition to being sensitive to\nwhether the property is dangerous or not, it has been proposed that\ngenerics may also be sensitive to whether the property in question is\ncharacteristic of the kind (Cimpian, Brandone et al. 2010; Cimpian,\nGelman et al. 2010; Gelman and Bloom 2007; Leslie 2007, 2008; Prasada\nand Dillingham 2006, 2009). Examples of characteristic properties of\nkinds would include salient, distinctive physical features (e.g.,\n“lions have manes”), methods of reproduction for animal\nkinds (e.g., “ducks lay eggs”), and functions for artifact\nkinds (e.g., “Orange-Crusher-2000s crush oranges”). If a\ngeneric attributes a characteristic property to the kind, then the\ngeneric may be accepted even if few members of the kind have the\nproperty in question.\n\nIf generics are indeed sensitive to such factors, it may be possible\nto explain why some generics are accepted even though the property is\nnot prevalent among members of the kind. What, though, of generics\nsuch as “books are paperbacks” or “school teachers\nare female”? People tend to reject such generics, despite\njudging that the property in question is highly prevalent (Prasada et\nal. 2013). One proposal is that generics may be sensitive to the\nnature of the exceptions to the generic claim (Leslie 2007,\n2008). That is, amongst the members of the kind that fail to have the\npredicated property, it may matter how they fail to have the\nproperty—in particular whether they simply lack the property, or\nwhether they have an equally salient, concrete, positive property\ninstead. The non-infected ticks simply do not carry Lyme\ndisease—they do not have an alternative property instead.\nHowever, the books that are not paperbacks are instead hardcover.\nSimilarly, people who are not right-handed are instead\nleft-handed; elementary school teachers who are not female\nare male. Intuitively, one might feel as though one would be\n“overlooking” these hardcover books, these left-handed\nindividuals, and these male school teachers if one accepted the\ngenerics in question. Thus, it is possible that generics may be\nsensitive to the nature of the exceptions to the generalization.\nHowever, more empirical investigation is needed on this point.\n4.3 A Bayesian Model of Generics\n\nTessler and Goodman (2019) offer an account of generics that is rooted\nin a Bayesian computational approach to cognition. They model\nacceptance/rejection of a generic as a speaker’s decision to\nproduce an utterance of the generic to a naive listener. The goal of\nthe speaker, on their model, is to produce an utterance that aligns\nthe listener’s beliefs about the prevalence of the property\namong members of the kind (the “referent prevalence” in\ntheir terminology) with the speaker’s beliefs. The\nspeaker’s decision is driven by whether the referent prevalence\nis more likely under the listener’s prior beliefs vs. their\nposterior beliefs after hearing the generic. On their model, generics\nhave a threshold semantics, according to which a generic is true if\nthe referent prevalence exceeds a threshold, however this threshold is\nunspecified and unknown by both speaker and hearer. Bayesian\ncomputational modeling provides a mathematical framework in which such\nuncertainty can be readily handled; specifically, interpretation on\nthe model involves integrating over the possible values of this\nthreshold. A listener’s posterior beliefs are arrived at by\nBayesian updating, such that they are proportional to the product of\nthe listener’s prior beliefs about the distribution of the\nprevalence \\(p\\) of the property in question (i.e., over comparable\nkinds), \\(Pr(p),\\) the probability of possible thresholds \\(\\theta\\),\n\\(Pr(\\theta),\\) and a delta function that is 1 if \\(p \\gt \\theta\\) and\n0 otherwise.\n\nTo put the model in less precise but more intuitive terms, the\ndecision to utter a generic “\\(K\\)s are \\(F\\)” depends on\nbeliefs a naive listener would likely have concerning the distribution\nof the property \\(F\\) over comparable kinds. Consider, for example,\nthe distribution of the property laying eggs over animal\nkinds. For most animal kinds, the proportion that lay eggs is\napproximately zero, but there are some animal kinds for which ~50% of\nmembers lay eggs. Any other proportions of egg-laying are quite\nunusual. This describes the shape of the prevalence prior for\nlaying eggs. Consider, then, an utterance of the generic\n“robins lay eggs”: approximately 50% of robins lay eggs,\nand hearing such a generic will, according to the mathematics of the\nmodel, lead the naive listener to update their prevalence prior in\nsuch a way that most of the probability distribution will be clustered\naround 50% and very little will remain around 0%. Thus, uttering this\ngeneric will lead the listener’s prevalence posterior to be\nbetter aligned with the speaker’s beliefs than their prevalence\nprior, and so the generic is endorsed.\n\nTessler and Goodman’s model does a remarkable job of predicting\nthe degree to which people endorse a given generic with great\nquantitative accuracy, and it extends a growing body of evidence in\ncognitive science that much of human cognition, including early\ncognitive development, involves or approximates to Bayesian inference\n(e.g., for a recent review, see Ullman and Tenenbaum 2020). While\ntheir model predicts that prior beliefs about the distribution of the\nprevalence of the property over comparable kinds mediates all\nendorsement/rejection of generics, they allow that these priors may be\ninfluenced by content-based factors. For example, “mosquitoes\ncarry West Nile virus” is predicted to be accepted with a high\ndegree of confidence by the model because the prevalence prior for\ncarrying West Nile virus is almost entirely bunched up very\nclose to zero, and correspondingly the prevalence posterior upon\nhearing the generic shifts modestly over to low but decidedly non-zero\nvalues. If people have a higher order prior expectation that\nstrikingly dangerous properties are rare, such that the prevalence\npriors for such properties resemble that of carrying West Nile\nvirus, then this would mean that people would be disposed to\naccept generics that predicate such properties, even though the\nreferent prevalence is low.\n4.4 Inferences from Generics\n\nDespite the fact that people are often willing to accept generics\ndespite knowing that only a minority of the kind has the property\n(e.g., Brandone et al. 2012; Cimpian, Brandone et al. 2010), the\navailable data suggest that people are nonetheless disposed to treat\ngenerics as quite inferentially powerful. For example, if people are\ntold that a given percentage of a novel animal kind has a property,\nthey are often willing to accept the corresponding generic at\nprevalence levels of 50%, 30%, or even 10%, particularly if the\nproperty being described is dangerous and/or characteristic of the\nkind. However, if people are instead presented with the generic and\nasked to estimate the prevalence of the property, the estimates are\nvery high indeed—often reaching 100% (Cimpian, Brandone et al.\n2010). Preschool-aged children show a similar pattern (Brandone et al.\n2015).\n\nThese studies show that people give very high estimates of prevalence\nwhen presented with a generic statement concerning a novel animal\nkind. When the generics concern familiar kinds, prevalence estimates\ncan be more realistic. Nevertheless, accepting a generic increases\npeople’s tendency to believe a given member of the kind will\nhave the property in question, over and above their beliefs about the\nprevalence of the property (Khemlani, Leslie, and Glucksberg 2012).\nFor example, people correctly give comparable prevalence estimates\nconcerning the number of ducks that are female vs. lay eggs. However,\nwhen asked to judge whether a given duck would have a property (e.g.,\n“suppose you are told that Quacky is a duck. Evaluate the\nfollowing statement: Quacky lays eggs”), people were\nsignificantly more likely to agree that the duck would lay eggs than\nthey were that the duck would be female (Khemlani et al. 2012). These\nresults suggest that people may treat generics as being inferentially\nquite powerful, in a way that cannot be reduced to their background\nbeliefs about the prevalence of the property. When people are asked to\njudge whether a given member of a kind will have a property or not,\nthey rely in part on their background judgment of the generic, rather\nthan solely on their beliefs about how prevalent the property is.\n\nThese findings support the idea that accepting a generic disposes\npeople—all else being equal—to believe that an arbitrary\ninstance of the kind will have the property, as has long been\nsuggested in the defeasible reasoning literature (e.g., Pelletier and\nAsher 1997). However, the defeasible reasoning literature has tended\nto focus on “non-troublesome”, high prevalence generics\nlike “tigers are striped”; it is notable that people show\na tendency to draw such inferences even for lower prevalence\ngenerics.\n5. Beyond Language: Philosophical Applications of Generics\n\nThe study of generics is not only of interest from the perspective of\nunderstanding language, or the psychology associated with that portion\nof language. In recent years, there has been an upsurge of interest in\nthe applications of generics. The range of potential applications of\ngenerics has proved extremely broad, and comprises issues from social\nprejudice to the sorites paradox and the principle of sufficient\nreason.\n5.1 Generics, Stereotyping and Prejudice\n\nFrom a young age, we conceive of certain kinds, both natural and\nsocial, as having a fundamental, underlying nature that is shared by\nits members (e.g., Gelman 2003). That is, we believe that, while some\nkinds may group individuals together on the basis of superficial\nproperties (as an extreme example, consider the kind\ntrinkets), other kinds group their members together on the\nbasis of deep, intrinsic similarities (animal kinds are paradigmatic\nexamples here). Kinds that fall in the latter category are said to be\nessentialized in the psychological sense. Members of an\nessentialized kind are believed to be deeply similar to each\nother—even if they seem to differ superficially—and are\nbelieved to share a range of important properties, which are the\ncausal upshot of their shared natures (Gelman 2003). In the social\nrealm, essentialist beliefs can be very damaging, and the groups that\nare most highly essentialized often face the worst forms of social\nprejudice (Haslam, Rothschild and Ernst 2000, 2002).\n\nSally Haslanger (2011) offers a fascinating analysis of generics that\nconcern social kinds, for example “women are submissive”\n(see also McConnell-Ginet 2012 and Leslie 2014 for related\ndiscussion). It may be a fact that, given social circumstances, the\nmajority of women defer to men on important decisions and life\nchoices. With some complications (as noted above), this sort of high\nprevalence often suffices for a generic to count as true (e.g.,\nPrasada and Dillingham 2006, 2009). Haslanger poses the question: even\nif we are in the circumstances that would plausibly render the generic\ntrue, might there still be something objectionable about uttering the\ngeneric? She argues that indeed there is, if the generic makes\nreference to an essentialized social kind and thereby perpetuates\nvarious forms of oppression. Generics, Haslanger argues, suggest that\nthe property is grounded in the nature of the kind, and so an\nutterance of “women are submissive” invites the\ninterpretation that it lies in the very nature of women to be\nsubmissive—rather than their submissiveness coming about as the\nresult of extrinsic, accidental, and changeable social\ncircumstances.\n\nEmpirical evidence supports Haslanger’s hypothesis. For example,\nfrom a young age, we tend to interpret information conveyed via\ngeneric language as indicating a stable and intrinsic property of the\nkind, whether the kind is natural or social (e.g., Cimpian and\nErickson 2012; Cimpian and Markman 2009, 2011). Further, hearing\ngeneric language about a novel social or animal kind leads both\nchildren and adults to essentialize that kind in the first place . For\nexample, even a wholly novel social group, composed of individuals who\nare diverse for race, ethnicity, gender, and age will rapidly be\nessentialized by preschoolers and adults alike if they hear various\nproperties being attributed to the group via generic language (Gelman,\nWare and Kleinberg 2010; Rhodes, Leslie and Tworek 2012; Leshin,\nLeslie and Rhodes 2021). (An interesting quandary emerges when we note\nthat quantified statements are often interpreted and recalled as\ngenerics: is there any way to speak of social groups at a general\nlevel without inducing essentialist beliefs?)\n\nAs another illustration of the impact generic language, and language\nabout identity categories more generally, can have on young children,\nRhodes and Leslie noted that science is often described to young\nchildren using identity-focused language, e.g., “Let’s be\nscientists! Scientist explore the world using their senses.”\nHowever, action-focused language offers an alternative way to\ncommunciate much the same content, e.g., “Let’s do\nscience! Doing science means exploring the world with our\nsenses.” In a series of experiments, Rhodes and Leslie and\ncollaborators have found that children who belong to social groups\nthat are underrepresented in science (girls, children from\nunderrepresented minorities or lower income backgrounds) show more\nengagement and persistence when they hear science described using\naction-focused language as opposed to identity-focused language (e.g.,\nRhodes, Cardarelli and Leslie 2020).\n\nIn addition to fostering essentialist beliefs, generics are also often\nused to communicate normative statements about social groups, e.g.,\n“boys don’t cry”, “a woman puts family before\ncareer”, “friends don’t let friends drive\ndrunk” (see also section 3.2 above). Generics such as these are\nnot intended as descriptions of the facts on the ground, but rather\ncarry a particular normative force; “friends don’t let\nfriends drive drunk” was not introduced as a banal observation\nabout what is in fact the case, but rather was introduced precisely to\naddress the fact that, all too often, people were allowing their\nfriends to drive under the influence. In the context of gender, these\nnormative generics can serve as a concise (and child-friendly) means\nof communicating and sustaining problematic social norms. Moreover,\nrecent empirical work reflects that very young children may interpret\ngenerics as having prescriptive force, even if those generics seems to\nadults to be only descriptive generalizations (Roberts, Ho and Gelman\n2017).\n\nGeneric generalizations may be relevant to understanding social\nprejudice in other respects too. For example, “ticks carry Lyme\ndisease” is accepted at low prevalence levels, perhaps because\ncarrying Lyme disease is a dangerous property, of the sort one would\nwish to avoid. What then are we to make of similar generics in the\nsocial realm, e.g., “Muslims are terrorists”? Clearly,\nthere is something deeply wrong with the latter that is not wrong with\nthe former. One possibility is that these “dangerous\ngenerics” involve the assumption that the members of the kind in\nquestion share a nature that ground the property in question (or at\nleast the corresponding disposition or propensity), and so\ngeneralizations such as “Muslims are terrorists” again\ninvolve false essentialist beliefs about social groups (Leslie\n2017).\n\nAs a final illustration of the significance of generics for the social\nworld, consider the phenomenon of stereotype threat (Steele and\nAronson 1995; Steele 2010). Stereotype threat occurs when members of a\nstigmatized social group perform worse than they otherwise would have,\nbecause their membership in that group was made salient to them. For\nexample, the performance of women and African-Americans on\nstandardized tests is lowered if they are reminded first of their\ngroup membership by, e.g., being asked to report their gender or race\nbefore the exam. Interestingly, stereotype threat on a totally novel\ntask can be induced by simply uttering a generic—e.g., telling a\ngirl “boys are really good at this game” (Cimpian 2013;\nCimpian, Mu and Erickson 2012). Simply hearing an evaluative generic\nstatement about a gender group was enough to impair children’s\nperformance.\n\nThese findings suggest that generic language has an undesirable\ninfluence on how we come to understand the social world around us.\nNevertheless, Ritchie (2019) defends the use of some social generics\n(e.g., “Blacks face economic, legal, and social\ndiscrimination”, “Women are expected to want\nchildren”) on the grounds that they are uniquely apt for\ndescribing and ameliorating conditions of structural injustice.\n5.2 Generics and Philosophy More Generally\n\nSome philosophers have recently applied the study of generics to a\nrange of long-standing philosophical issues and puzzles. As a\nfascinating illustration, Roy Sorensen (2012) argues that a proper\nunderstanding of generics can solve the sorites paradox. An example of\nthe sorites paradox is the following: 1 is a small number; small\nnumbers have small successors; therefore 1,000,000,000 is a small\nnumber. The second premise is the inductive step, and is here\nformulated as a generic. Sorensen proposes that, like most generics,\nthe inductive step admits of exceptions: there are some (or at least\none) small numbers whose successor is not itself a small number. If\nthis is so, then the paradox is resolved: the argument is simply\ninvalid. In order for the argument to be valid, the inductive step\ncannot be an exception-tolerating generic, but rather an exceptionless\nuniversal, e.g., for all n, if n is a small\nnumber, so is \\(n+1\\). Indeed, the paradox is often formulated in\nthis way—i.e., with a universal as the inductive step. Here,\nhowever, Sorensen argues that we are simply interpreting the universal\nas a generic, just as when adults accept “all ducks lay\neggs” despite knowing that male ducks do not lay eggs (Leslie et\nal. 2011).\n\nA similar strategy is applied by Mahrad Almotahari (2022) to the\nkalām cosmological argument: Everything that begins\nto exist has a cause for its existence; the universe began to exist;\ntherefore the universe has a cause for its existence. Almotahari\nargues that acceptance of the first premise of the argument rests on\nthe generic overgeneralization effect. Certainly, anything that we\nencounter in ordinary life that begins to exist has a cause, and it is\nentirely reasonable to accept the corresponding generic things\nthat begin to exist have causes for their existence. But the\nkalām cosmological argument requires a universal\ngeneralization, not a generic one, and Almotahari argues that this is\na step to which we are not entitled.\n\nAdditionally, generics have been said to solve, or at least\nilluminate, other long-standing philosophical puzzles. For example,\nKai Yuan Cheng (2011) argues that a proper understanding of generics\nand habituals can help resolve the Kripke/Wittgenstein rule-following\nparadox. Bernhard Nickel (2010, 2014) has argued that generics can be\nused to analyze ceteris paribus laws; similarly, Asher and\nDaniel Bonevac (1996, 1997) have relied on a normalcy-based approach\nto generics to provide an account of prima facie obligation.\nMichael Graff Fara (2005) and Ryan Wasserman (2011) both recruit\ngenerics and habituals to give accounts of dispositions.\n\nReflection on generics has also influenced debates about philosophical\nmethodology. Mark Johnston (2016) suggests that certain well-known\ninadequacies of the “method of cases” in the philosophy of\npersonal identity can be explained by the fact that we as philosophers\nhave treated what is in fact merely generic-based—and thus\nexception-tolerating—knowledge of the application conditions of\nour concepts as if it were knowledge of universal necessary and\nsufficient conditions for the application of the relevant concepts.\nJohnston and Leslie (2012, 2019) rely on similar considerations to\nquestion the philosophical methodology known as the Canberra Plan.\nLastly, Lerner and Leslie (2013) argue that a greater understanding of\nthe role of generics in moral cognition undermines certain\napplications of the method of reflective equilibrium within normative\nethics.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Almotahari, M., 2022, “Kalām and Cognition”. In\nMuhammad Saleh Zarepour, ed., Islamic Philosophy of Religion: Analytic\nPerspectives Routledge: Taylor and Francis Group.",
                "–––, forthcoming, “Weak Generics”,\n<em>Analysis</em>.",
                "Asher, N. and D. Bonevac, 1996, “Prima Facie\nObligation”, <em>Studia Logica</em>, 57(1): 19–45.",
                "–––, 1997, “Common Sense\nObligation”, in <em>Defeasible Deontic Logic</em>, D. Nute\n(ed.), Dordrecht: Kluwer, pp. 159–203.",
                "Asher, N. and M. Morreau, 1995, “What Some Generic Sentences\nMean”, in Carlson and Pelletier 1995: 300–339.",
                "Asher, N. and F.J. Pelletier, 2012, “More Truths About\nGeneric Truth”, in Mari et al. 2012: 313–333.",
                "Bäck, A., 1996, “Review of <em>Generische\nKennzeichnungen</em>, by Gerhard Heyer (1987)”,\n<em>Noûs</em> 30(2): 276–281.",
                "Baldwin, D.A., E. Markman, and R. Melartin, 1993,\n“Infants’ Ability to Draw Inferences About Nonobvious\nObject Properties: Evidence from Exploratory Play”, <em>Child\nDevelopment</em>, 64(3): 711–28.",
                "Barwise, J. and J. Perry, 1983, <em>Situations and Attitudes</em>,\nCambridge, MA: MIT Press.",
                "Brandone, A., A. Cimpian, S.J. Leslie, and S.A. Gelman, 2012,\n“Do Lions Have Manes? For Children, Generics Are About Kinds Not\nQuantities”, <em>Child Development</em>, 83(2):\n423–433.",
                "Brandone, A., S.A. Gelman, and J. Hedglen, 2015,\n“Children’s Developing Intuitions About the Truth\nConditions and Implications of Novel Generics Versus Quantified\nStatements”, <em>Cognitive Science</em>, 39(4):\n711–738.",
                "Burton-Roberts, N., 1977, “Generic Sentences and\nAnalyticity”, <em>Studies in Language</em>, 1:\n155–196.",
                "Carlson, G., 1977, <em>Reference to Kinds in English</em>, Ph.D.\ndissertation, University of Massachusetts, Amherst.",
                "–––, 1989, “On the Semantic Composition of\nEnglish Generic Sentences”, in Chierchia et al. 1989:\n167–192.",
                "–––, 1995, “Truth Conditions of Generic\nSentences: Two Contrasting Views”, in G. Carlson and F.J.\nPelletier (eds.), <em>The Generic Book</em>, Chicago: Chicago\nUniversity Press, pp. 224–237.",
                "–––, 2011, “Genericity”, in C.\nMaienborn, K. von Heusinger, and P. Portner (eds.), <em>Semantics: An\nInternational Handbook vol. II</em>, Chapter 47, Berlin: de Gruyter:\nBerlin, pp. 1153–1185.",
                "–––, 2012, “Generic and Habitual\nAspect”, in R. Binnick (ed.), <em>The Oxford Handbook of Tense\nand Aspect</em>, Oxford: Oxford University Press, pp.\n828–851.",
                "Cavedon, L. and S. Glasbey, 1994, “Outline of an\nInformation-Flow Model of Generics”, <em>Acta Linguistica\nHungarica</em>, 42.",
                "Carlson, G. and F.J. Pelletier (eds.), 1995, <em>The Generic\nBook</em>, Chicago: Chicago University Press.",
                "Cheng, K.Y., 2011, “A New Look at the Problem of Rule\nFollowing: A Generic Perspective”, <em>Philosophical\nStudies</em>, 155:1–21.",
                "Chierchia, G., 1995, “Individual Level Predicates as\nInherent Generics”, in Carlson and Pelletier 1995:\n176–224.",
                "–––, 1998, “Reference to Kinds Across\nLanguages”, <em>Natural Language Semantics</em>, 6.",
                "Chierchia, G., B.H. Partee, and R. Turner (eds.), 1989,\n<em>Properties, Types and Meaning, Vol. II: Semantic Issues</em>,\nDordrecht: Kluwer.",
                "Cimpian, A., 2013, “Generic Statements, Causal Attributions,\nand Children’s Naive Theories”, in <em>Navigating the\nSocial World: The Early Years</em>, M.R. Banaji and S.A. Gelman\n(eds.), New York: Oxford University Press, pp. 269–274.",
                "Cimpian, A., A.C. Brandone, and S.A. Gelman, 2010, “Generic\nStatements Require Little Evidence for Acceptance but Have Powerful\nImplications”, <em>Cognitive Science</em>, 34(8):\n1452–1482.",
                "Cimpian, A. and L.C. Erickson, 2012, “Remembering kinds: New\nevidence that categories are privileged in children’s\nthinking”, <em>Cognitive Psychology</em>, 64(3):\n161–185.",
                "Cimpian, A., S.A. Gelman, and A.C. Brandone, 2010,\n“Theory-based considerations influence the interpretation of\ngeneric sentences”, <em>Language and Cognitive Processes</em>,\n25(2): 261–276.",
                "Cimpian, A. and E.M. Markman, 2009, “Information learned\nfrom generic language becomes central to children’s biological\nconcepts: Evidence from their open-ended explanations”,\n<em>Cognition</em>, 113(1): 14–25.",
                "–––, 2011, “The Generic/Nongeneric\nDistinction Influences How Children Interpret New Information About\nSocial Others”, <em>Child Development</em>, 82(2):\n471–492.",
                "Cimpian, A., Y. Mu, and L.C. Erickson, 2012, “Who Is Good at\nThis Game? Linking an Activity to a Social Category Undermines\nChildren’s Achievement”, <em>Psychological Science</em>,\n23(5): 533–541.",
                "Cohen, A., 1996, <em>Think Generic: The Meaning and Use of Generic\nSentences</em>, Ph.D. dissertation, Carnegie Mellon University.",
                "–––, 1999, “Generics, Frequency Adverbs\nand Probability”, <em>Linguistics and Philosophy</em>, 22(3):\n221–253.",
                "–––, 2001, “On the Generic Use of\nIndefinite Singulars”, <em>Journal of Semantics</em>, 18(3):\n183–209.",
                "–––, 2004, “Generics and Mental\nRepresentation”, <em>Linguistics and Philosophy</em>, 27(5):\n529–556.",
                "–––, 2012, “No Quantification Without\nReinterpretation”, in Mari et al. 2012: pp. 334–351.",
                "Cohen, A. and N. Erteschik-Shir, 1997, “Topic, Focus and the\nInterpretation of Bare Plurals”, in <em>Proceedings of the\n11<sup>th</sup> Amsterdam Colloquium</em>, P. Dekker, M. Stokhof, and\nY. Venema (eds.), pp. 31–36.",
                "–––, 2002, “Topic, Focus, and the\nInterpretation of Bare Plurals”, <em>Natural Language\nSemantics</em>, 10(2): 125–165.",
                "Dahl, O., 1975, “On Generics”, in Keenan 1975:\n99–111.",
                "–––, 1985, <em>Tense and Aspect Systems</em>,\nOxford: Blackwell.",
                "Declerk, R., 1986, “The Manifold Interpretations of Generic\nSentences”, <em>Lingua</em>, 68: 149–188.",
                "–––, 1991, “The Origins of\nGenericity”, <em>Linguistics</em>, 29(1): 79–102.",
                "Delgrande, J.P., 1987, “A First-Order Conditional Logic for\nPrototypical Properties”, <em>Artificial Intelligence</em>,\n33(1): 105–130.",
                "Diesing, M., 1992, <em>Indefinites</em>, Cambridge, MA: MIT\nPress.",
                "Fara, M.G., 2005, “Dispositions and Habituals”,\n<em>Noûs</em>,39(1): 43–82.",
                "Gelman, S.A., 2003, <em>The Essential Child: Origins of\nEssentialism in Everyday Thought</em>, New York: Oxford University\nPress.",
                "–––, 2010, “Generics as a Window onto\nYoung Children’s Concepts”, in <em>Kinds, Things, and\nStuff: The Cognitive Side of Generics and Mass Terms</em> (New\nDirections in Cognitive Science v. 12.), F.J. Pelletier (ed.), New\nYork: Oxford University Press, pp. 100–122.",
                "Gelman, S.A. and P. Bloom, 2007, “Developmental Changes in\nthe Understanding of Generics”, <em>Cognition</em>, 105(1):\n166–183.",
                "Gelman, S.A., P.J. Goetz, B.S. Sarnecka, and J. Flukes, 2008,\n“Generic Language in Parent-Child Conversations”,\n<em>Language Learning and Development</em>, 4(1): 1–31.",
                "Gelman, S.A. and L. Raman, 2003, “Preschool Children Use\nLinguistic Form Class and Pragmatic Cues to Interpret Generics”,\n<em>Child Development</em> 74(1): 308–325.",
                "Gelman, S.A., I. Sánchez Tapia, and S.J. Leslie, 2015,\n“Memory for Generic and Quantified Sentences in Spanish-speaking\nChildren and Adults”, <em>Journal of Child Language</em>, epub\nahead of print. doi:10.1017/S0305000915000483",
                "Gelman, S.A., and T.Z. Tardif, 1998, “A Cross-Linguistic\nComparison of Generic Noun Phrases in English and Mandarin”,\n<em>Cognition</em>, 66(3): 215–248.",
                "Gelman, S.A., E.A. Ware, and F. Kleinberg, 2010, “Effects of\nGeneric Language on Category Content and Structure”,\n<em>Cognitive Psychology</em>, 61(3): 273–301",
                "Gerstner-Link, C., 1988, <em>Uber Generizitat. Generische\nNominalphrasen in Singularen Aussagen und Generischen Aussagen</em>,\nPh.D. dissertation, University of Munich.",
                "Geurts, B., 1985, “Generics”, <em>Journal of\nSemantics</em>, 4(3): 247–255.",
                "Graham, S.A., S.L. Nayer, and S.A. Gelman, 2011,\n“Two-Year-Olds Use the Generic/Non-generic Distinction to Guide\nTheir Inferences About Novel Kinds”, <em>Child Development</em>,\n82(2): 493–507.",
                "Greenberg, Y., 2003, <em>Manifestations of Genericity</em>, New\nYork: Routledge.",
                "Haslam, N., L. Rothschild, and D. Ernst, 2000, “Essentialist\nBeliefs About Social Categories”, <em>British Journal of Social\nPsychology</em>, 39: 113–127.",
                "–––, 2002, “Are Essentialist Beliefs\nAssociated with Prejudice?”, <em>British Journal of Social\nPsychology</em>, 41: 87–100.",
                "Haslanger, S., 2011, “Ideology, Generics, and Common\nGround”, in <em>Feminist Metaphysics: Explorations in the\nOntology of Sex, Gender, and the Self</em>, Charlotte Witt (ed.),\nDordrecht: Springer, pp. 179–209.",
                "Heim, I., 1982, <em>The Semantics of Definite and Indefinite Noun\nPhrases</em>, Ph.D. dissertation, University of Massachusetts,\nAmherst.",
                "Heyer, G., 1985, “Generic Descriptions, Default Reasoning,\nand Typicality”, <em>Theoretical Linguistics</em>, 12(1):\n33–72.",
                "–––, 1987, “Generische Kennzeichnungen:\nZur Logik und Ontologie Generischer Bedeutung”, München:\nPhilosophia Verlag.",
                "–––, 1990, “Semantics and Knowledge\nRepresentation in the Analysis of Generic Descriptions”,\n<em>Journal of Semantics</em>, 7: 93–110.",
                "Hesni, S., 2021, “Normative generics: Agains Semantic\nPolysemy”, <em>Thought: A Journal of Philosophy</em>, 10(3):\n218–225.",
                "Hollander, M.A., S.A. Gelman, and J. Star, 2002,\n“Children’s Interpretation of Generic Noun Phrases”,\n<em>Developmental Psychology</em>, 38(6): 883–894.",
                "Johnston, M., 2016, “Remnant Persons: Animalism’s\nUndoing”, in <em>Animalism: New Essays on Persons, Animals, and\nIdentity</em>, S. Blatti and P. Snowdon (eds.), Oxford: Oxford\nUniversity Press, pp. 89–128.",
                "Johnston, M. and S.J. Leslie, 2012, “Concepts, analysis,\ngenerics and the Canberra plan”, <em>Philosophical\nPerspectives</em>, 26(1): 113–171.",
                "–––, 2019, “Cognitive Psychology\nand the Metaphysics of Meaning”, <em>Metaphysics and Cognitive\nScience</em>. Oxford: Oxford University Press, pp. 183–205.",
                "Jönsson, M.L. and J.A. Hampton, 2006, “The Inverse\nConjunction Fallacy”, <em>Journal of Memory and Language</em>,\n55(3): 317–334.",
                "Kamp, H., 1981, “A Theory of Truth and Semantic\nInterpretation”, in <em>Formal Methods in the Study of\nLanguage</em>, J. Groenendijk, J. Janssen and M. Stokhof (eds.),\nDordrecht: Forts Publications, pp. 277–322.",
                "Kamp, H. and U. Reyle, 1993, <em>From Discourse to Logic</em>,\nDordrecht: Kluwer Academic Publishers.",
                "Kaplan, D., 1989, “Demonstratives: An Essay on the\nSemantics, Logic, Metaphysics, and Epistemology of Demonstratives and\nOther Indexicals”, in <em>Themes from Kaplan</em>, J. Almog, J.\nPerry, and H. Wettstein (eds.), Oxford: Oxford University Press, pp.\n481–563.",
                "Keenan, E.L. (ed.), 1975, <em>Formal Semantics of Natural\nLanguage</em>, Cambridge: Cambridge University Press.",
                "Khemlani, S., S.J. Leslie, and S. Glucksberg, 2012,\n“Inferences About Members of Kinds: The Generics\nHypothesis”, <em>Language and Cognitive Processes</em>, 27(6):\n887–900.",
                "Kiss, K.E., 1998, “On Generic and Existential Bare Plurals\nand the Classification of Predicates”, in <em>Events and\nGrammar</em>, S. Rothstein (ed.), Dordrecht: Kluwer, pp.\n145–162.",
                "Knobe, J., S. Prasada, and G. Newman, 2013, “Dual Character\nConcepts and the Normative Dimension of Conceptual\nRepresentation”, <em>Cognition</em>, 127: 242–257.",
                "Kratzer, A., 1995, “Stage-Level and Individual-Level\nPredicates”, in Carlson and Pelletier 1995: 125–176.",
                "Krifka, M., partly in collaboration with Claudia Gerstner, 1987,\n<em>An Outline of Genericity</em>, <em>SNS-Bericht 87–23</em>,\nUniversity of Tubingen.",
                "Krifka, M., F. Pelletier, G. Carlson, A. ter Meulen, G. Chierchia,\nand G. Link, 1995, “Genericity: An Introduction”, in\nCarlson and Pelletier 1995: 1–125.",
                "Laca, B., 1990, “Generics Objects: Some More Pieces of the\nPuzzle”, <em>Lingua</em>, 81: 25–46.",
                "Lawler, J., 1972, “Generic to a Fault”, in <em>Papers\nfrom the 8th Regional Meeting, Chicago Linguistic Society</em> (CLS\n8), Chicago: Chicago Linguistic Society, pp. 247–258.",
                "–––, 1973, “Studies in English\ngenerics”, <em>University of Michigan Papers in\nLinguistics</em>, 1(1).",
                "Lazaridou-Chatzigoga, D. and L. Stockall, 2013, “Genericity,\nExceptions and Domain Restriction: Experimental Evidence from\nComparison with Universals”, in <em>Proceedings of Sinn und\nBedeutung</em>, 17, E. Chemla, V. Homer, and G. Winterstein (eds.),\npp. 325–343.",
                "Lazaridou-Chatzigoga, D., N. Katsos, and L. Stockall, 2015,\n“Genericity Is Easy? Formal and Experimental\nPerspectives”, <em>Ratio</em>, 28(4): 470–494.",
                "Lerner, A. and S.J. Leslie, 2013, “Generics, Generalism, and\nReflective Equilibrium: Implications for Moral Theorizing from the\nStudy of Language”, <em>Philosophical Perspectives</em> 27(1):\n366–403.",
                "Leshin, R.A., S.J. Leslie, and M. Rhodes, 2021, “Does It\nMatter How We Speak About Social Kinds? A Large, Preregistered, Online\nExperimental Study of How Language Shapes the Development of\nEssentialist Beliefs”, <em>Child Development</em>, 92(4):\ne531–e547.",
                "Leslie, S.J., 2007, “Generics and the Structure of the\nMind”, <em>Philosophical Perspectives</em>, 21(1):\n375–403.",
                "–––, 2008, “Generics: Cognition and\nAcquisition”, <em>Philosophical Review</em>, 117(1):\n1–47.",
                "–––, 2012, “Generics Articulate Default\nGeneralizations”, <em>Recherches Linguistiques de\nVincennes</em>, 41: 25–44.",
                "–––, 2014, “Carving Up the Social World\nwith Generics”, <em>Oxford Studies in Experimental\nPhilosophy</em>, 1: 208–232.",
                "–––, 2015a, “Generics\nOversimplified”, <em>Noûs</em>, 49(1): 28–54.",
                "–––, 2015b, “‘Hillary Clinton is the\nOnly Man in the Obama Administration’: Dual Character Concepts,\nGenerics, and Gender”, <em>Analytic Philosophy</em>, 56(2):\n111–141.",
                "–––, 2017, “The Original Sin of Cognition:\nFear, Prejudice, and Generalization”, <em>The Journal of\nPhilosophy,</em> 114(8): 1–29.",
                "Leslie, S.J. and S.A. Gelman, 2012, “Quantified Statements\nare Recalled as Generics: Evidence from Preschool Children and\nAdults”, <em>Cognitive Psychology</em>, 64(3):\n186–214.",
                "Leslie, S.J., S. Khemlani, and S. Glucksberg, 2011, “Do All\nDucks Lay Eggs? The Generic Overgeneralization Effect”,\n<em>Journal of Memory and Language</em>, 65(1): 15–31.",
                "Lewis, D., 1975, “Adverbs of Quantification”, in\nKeenan 1975: 3–15.",
                "Liebesman, D., 2011, “Simple Generics”,\n<em>Noûs</em>, 45(3): 409–442.",
                "Mannheim, B., S.A. Gelman, C. Escalante, M. Huayhua, and R. Puma,\n2011, “A Developmental Analysis of Generic Nouns in Southern\nPeruvian Quechua”, <em>Language Learning and Development</em>,\n7(1): 1–23.",
                "Mari, A., C. Beyssade, and F.D. Prete (eds.), 2012,\n<em>Genericity</em>, Oxford: Oxford University Press.",
                "McCarthy, J., 1986, “Applications of Circumscription to\nFormalizing Commonsense Knowledge”, <em>Artificial\nIntelligence</em>, 28(1): 89–116.",
                "McConnell-Ginet, S., 2012, “Generic Predicates and Interest\nRelativity”, <em>Canadian Journal of Linguistics</em>, 57(2):\n289–302.",
                "ter Meulen, A., 1986, “Generic Information, Conditional\nContexts and Constraints”, in <em>On Conditionals</em>, E.C.\nTraugott, A. ter Meulen, J.S. Reilly, and C.A. Ferguson (ed.).\nCambridge: Cambridge University Press, pp. 123–146.",
                "Meyer, M., S.A. Gelman, and S.M. Stilwell, 2011, “Generics\nAre a Cognitive Default: Evidence from Sentence Processing”, in\n<em>Proceedings of the 33<sup>rd</sup> Annual Conference of the\nCognitive Science Society</em>, Boston, MA: Cognitive Science Society,\npp. 913–918.",
                "Milsark, G., 1974, <em>Existential Sentences in English</em>,\nPh.D. dissertation, MIT.",
                "Nickel, B., 2008, “Generics and the Way of Normality”,\n<em>Linguistics and Philosophy</em>, 31(6): 629–648.",
                "–––, 2010, “Ceteris Paribus Laws: Generics\nand Natural Kinds”, <em>Philosopher’s Imprint</em>, 10(6):\n1–25.\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0010.006\" target=\"other\">Nickel 2010 available online</a>]",
                "–––, 2012, “Dutchmen are Good Sailors:\nGenerics and Gradability”, in Mari et al. 2012:\n390–405.",
                "–––, 2014, “The Role of Kinds in the\nSemantics of <em>Ceterius Paribus</em> Laws”,\n<em>Erkenntnis</em>, 79(10): 1729–1744.\ndoi:10.1007/s10670-014-9638-5",
                "–––, 2016, <em>Between Logic and the World: An\nIntegrated Theory of Generics</em>, Oxford: Oxford University\nPress.",
                "Nunberg, G. and C. Pan, 1975, “Inferring Quantification in\nGeneric Sentences”, in <em>Papers from the Eleventh Regional\nMeeting of the Chicago Linguistic Society</em> (CLS 11), Chicago:\nChicago Linguistic Society, pp. 412–422.",
                "Nyugen, A. 2020, “The Radical Account of Bare Plural\nGenerics”, <em>Philosophical Studies</em>, 177:\n1303–1331.",
                "Ojeda, Almerindo, 1991, “Definite Descriptions and Definite\nGenerics”, <em>Linguistics and Philosophy</em>, 14:\n367–397.",
                "Pelletier, F.J. and N. Asher, 1997, “Generics and\nDefaults”, in <em>Handbook of Logic and Language</em>, J. van\nBenthem and A. ter Meulen (eds.), Cambridge, MA: MIT Press, pp.\n1125–1179.",
                "Platteau, F., 1980, “Definite and Indefinite\nGenerics”, in J. van der Auwera (ed.), <em>The Semantics of\nDeterminers</em>, London: Croom Helm, pp. 112–123,",
                "Prasada, S. and E.M. Dillingham, 2006, “Principled and\nStatistical Connections in Common Sense Conception”,\n<em>Cognition</em>, 99(1): 73–112.",
                "–––, 2009, “Representation of Principled\nConnections: A Window onto the Formal Aspect of Common Sense\nConception”, <em>Cognitive Science</em>, 33(3):\n401–448.",
                "Prasada, S., S. Khemlani, S.J. Leslie, and S. Glucksberg. 2013,\n“Conceptual Distinctions Amongst Generics”,\n<em>Cognition</em>, 126(3): 405–422.",
                "Reiter, R., 1987, “Nonmonotonic Reasoning”, in\n<em>Annual Review of Computer Science</em>, J.F. Traub, N.J. Nilsson,\nand B.J. Grosz (eds.), Palo Alto: Annual Reviews Inc., pp.\n147–186.",
                "Ritchie, K., 2019, “Should We Use Racial and Gender\nGenerics?”, <em>Thought: A Journal of Philosophy</em>, 8(1):\n33–41.",
                "Rhodes, M., S.J. Leslie, and C. Tworek, 2012, “Cultural\nTransmission of Social Essentialism”, <em>Proceedings of the\nNational Academy of Sciences (PNAS)</em>, 109(34):\n13526–13531.",
                "Rhodes, M., A. Cardarelli, and S.J. Leslie, 2020, “Asking\nyoung children to ‘do science’ instead of ‘be\nscientists’ increases science engagement in a randomized field\nexperiment”, <em>Proceedings of the National Academy of\nSciences</em>, 117(18): 9808–9814.",
                "Roberts, S. O., A.K. Ho, and S.A. Gelman, 2017, “Group\npresence, category labels, and generic statements foster\nchildren’s tendency to enforce group norms”, <em>Journal\nof Experimental Child Psychology</em>, 158: 19–31.",
                "Rosch, E.H., 1978, “Principles of Categorization”, in\n<em>Cognition and Categorization</em>, E. Rosch and B. Lloyd (eds.),\nHillsdale, N.J.: Erlbaum Associates, pp. 27–48.",
                "Schubert, L.K. and F.J. Pelletier. 1987, “Problems in\nRepresenting the Logical Form of Generics, Bare Plurals, and Mass\nTerms”, in <em>New Directions in Semantics</em>, E. Lepore (ed.),\nLondon: Academic Press, pp. 385–451.",
                "–––, 1989, “Generically Speaking, or Using\nDiscourse Representation Theory to Interpret Generics”, in\nChierchia et al. 1989: 193–268.",
                "Sloman, S.A., 1993, “Feature-Based Induction”,\n<em>Cognitive Psychology</em>, 25(2): 231–280.",
                "–––, 1998, “Categorical Inference Is Not a\nTree: The Myth of Inheritance Hierarchies”, <em>Cognitive\nPsychology</em> 35(1): 1–33.",
                "Sorensen, R., 2012, “The Sorites and the Generic\nOvergeneralization Effect”, <em>Analysis</em>, 62(3):\n444–449.",
                "Steele, C.M., 2010, <em>Whistling Vivaldi: How Stereotypes Affect\nUs and What We Can Do</em>, New York: W.W. Norton &amp; Company,\nInc.",
                "Steele, C.M. and J. Aronson, 1995, “Stereotype Threat and\nthe Intellectual Test Performance of African Americans”,\n<em>Journal of Personality and Social Psychology</em>, 69(5):\n797–811.",
                "Sterken, R.K., 2015a, “Generics in Context”,\n<em>Philosopher’s Imprint</em>, 15(21): 1–30.\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0015.021\" target=\"other\">Sterken 2015 available online</a>]",
                "Sterken, R. 2015b, “Leslie on generics”,\n<em>Philosophical Studies,</em> 172: 2493–512.",
                "Stump, G., 1985, <em>The Semantic Variability of Absolute\nConstructions</em>, Dordrecht: Reidel.",
                "Tardif, T., S.A. Gelman, X. Fu, and L. Zhu., 2011,\n“Acquisition of Generic Noun Phrases in Chinese: Learning About\nLions Without an ‘-s’”, <em>Journal of Child\nLanguage</em>, 30(1): 130–161.",
                "Teichman, M., 2016, “The Sophisticated Kind Theory”,\n<em>Inquiry</em>.\n <a href=\"https://doi.org/10.1080/0020174X.2016.1267407\" target=\"other\">Teichman 2016 available online</a>",
                "Tessler, M. H., and N.D. Goodman, 2019, “The language of\ngeneralization”, <em>Psychological Review</em>, 126(3):\n395.",
                "Ullman, T. and J. Tenenbaum, 2020, “Bayesian models of\nconceptual development: Learning as building models of the\nworld”, <em>Annual Review of Developmental Psychology</em>, 2:\n533–558.",
                "Wasserman, R., 2011, “Dispositions and Generics”,\n<em>Philosophical Perspectives</em>, 25(1): 425–453.",
                "Wilkinson, K., 1995, “The Common Noun <em>Kind</em>”,\nin Carlson and Pelletier 1995: 383–397."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Almotahari, M., 2022, “Kalām and Cognition”. In\nMuhammad Saleh Zarepour, ed., Islamic Philosophy of Religion: Analytic\nPerspectives Routledge: Taylor and Francis Group.</li>\n<li>–––, forthcoming, “Weak Generics”,\n<em>Analysis</em>.</li>\n<li>Asher, N. and D. Bonevac, 1996, “Prima Facie\nObligation”, <em>Studia Logica</em>, 57(1): 19–45.</li>\n<li>–––, 1997, “Common Sense\nObligation”, in <em>Defeasible Deontic Logic</em>, D. Nute\n(ed.), Dordrecht: Kluwer, pp. 159–203.</li>\n<li>Asher, N. and M. Morreau, 1995, “What Some Generic Sentences\nMean”, in Carlson and Pelletier 1995: 300–339.</li>\n<li>Asher, N. and F.J. Pelletier, 2012, “More Truths About\nGeneric Truth”, in Mari et al. 2012: 313–333.</li>\n<li>Bäck, A., 1996, “Review of <em>Generische\nKennzeichnungen</em>, by Gerhard Heyer (1987)”,\n<em>Noûs</em> 30(2): 276–281.</li>\n<li>Baldwin, D.A., E. Markman, and R. Melartin, 1993,\n“Infants’ Ability to Draw Inferences About Nonobvious\nObject Properties: Evidence from Exploratory Play”, <em>Child\nDevelopment</em>, 64(3): 711–28.</li>\n<li>Barwise, J. and J. Perry, 1983, <em>Situations and Attitudes</em>,\nCambridge, MA: MIT Press.</li>\n<li>Brandone, A., A. Cimpian, S.J. Leslie, and S.A. Gelman, 2012,\n“Do Lions Have Manes? For Children, Generics Are About Kinds Not\nQuantities”, <em>Child Development</em>, 83(2):\n423–433.</li>\n<li>Brandone, A., S.A. Gelman, and J. Hedglen, 2015,\n“Children’s Developing Intuitions About the Truth\nConditions and Implications of Novel Generics Versus Quantified\nStatements”, <em>Cognitive Science</em>, 39(4):\n711–738.</li>\n<li>Burton-Roberts, N., 1977, “Generic Sentences and\nAnalyticity”, <em>Studies in Language</em>, 1:\n155–196.</li>\n<li>Carlson, G., 1977, <em>Reference to Kinds in English</em>, Ph.D.\ndissertation, University of Massachusetts, Amherst.</li>\n<li>–––, 1989, “On the Semantic Composition of\nEnglish Generic Sentences”, in Chierchia et al. 1989:\n167–192.</li>\n<li>–––, 1995, “Truth Conditions of Generic\nSentences: Two Contrasting Views”, in G. Carlson and F.J.\nPelletier (eds.), <em>The Generic Book</em>, Chicago: Chicago\nUniversity Press, pp. 224–237.</li>\n<li>–––, 2011, “Genericity”, in C.\nMaienborn, K. von Heusinger, and P. Portner (eds.), <em>Semantics: An\nInternational Handbook vol. II</em>, Chapter 47, Berlin: de Gruyter:\nBerlin, pp. 1153–1185.</li>\n<li>–––, 2012, “Generic and Habitual\nAspect”, in R. Binnick (ed.), <em>The Oxford Handbook of Tense\nand Aspect</em>, Oxford: Oxford University Press, pp.\n828–851.</li>\n<li>Cavedon, L. and S. Glasbey, 1994, “Outline of an\nInformation-Flow Model of Generics”, <em>Acta Linguistica\nHungarica</em>, 42.</li>\n<li>Carlson, G. and F.J. Pelletier (eds.), 1995, <em>The Generic\nBook</em>, Chicago: Chicago University Press.</li>\n<li>Cheng, K.Y., 2011, “A New Look at the Problem of Rule\nFollowing: A Generic Perspective”, <em>Philosophical\nStudies</em>, 155:1–21.</li>\n<li>Chierchia, G., 1995, “Individual Level Predicates as\nInherent Generics”, in Carlson and Pelletier 1995:\n176–224.</li>\n<li>–––, 1998, “Reference to Kinds Across\nLanguages”, <em>Natural Language Semantics</em>, 6.</li>\n<li>Chierchia, G., B.H. Partee, and R. Turner (eds.), 1989,\n<em>Properties, Types and Meaning, Vol. II: Semantic Issues</em>,\nDordrecht: Kluwer.</li>\n<li>Cimpian, A., 2013, “Generic Statements, Causal Attributions,\nand Children’s Naive Theories”, in <em>Navigating the\nSocial World: The Early Years</em>, M.R. Banaji and S.A. Gelman\n(eds.), New York: Oxford University Press, pp. 269–274.</li>\n<li>Cimpian, A., A.C. Brandone, and S.A. Gelman, 2010, “Generic\nStatements Require Little Evidence for Acceptance but Have Powerful\nImplications”, <em>Cognitive Science</em>, 34(8):\n1452–1482.</li>\n<li>Cimpian, A. and L.C. Erickson, 2012, “Remembering kinds: New\nevidence that categories are privileged in children’s\nthinking”, <em>Cognitive Psychology</em>, 64(3):\n161–185.</li>\n<li>Cimpian, A., S.A. Gelman, and A.C. Brandone, 2010,\n“Theory-based considerations influence the interpretation of\ngeneric sentences”, <em>Language and Cognitive Processes</em>,\n25(2): 261–276.</li>\n<li>Cimpian, A. and E.M. Markman, 2009, “Information learned\nfrom generic language becomes central to children’s biological\nconcepts: Evidence from their open-ended explanations”,\n<em>Cognition</em>, 113(1): 14–25.</li>\n<li>–––, 2011, “The Generic/Nongeneric\nDistinction Influences How Children Interpret New Information About\nSocial Others”, <em>Child Development</em>, 82(2):\n471–492.</li>\n<li>Cimpian, A., Y. Mu, and L.C. Erickson, 2012, “Who Is Good at\nThis Game? Linking an Activity to a Social Category Undermines\nChildren’s Achievement”, <em>Psychological Science</em>,\n23(5): 533–541.</li>\n<li>Cohen, A., 1996, <em>Think Generic: The Meaning and Use of Generic\nSentences</em>, Ph.D. dissertation, Carnegie Mellon University.</li>\n<li>–––, 1999, “Generics, Frequency Adverbs\nand Probability”, <em>Linguistics and Philosophy</em>, 22(3):\n221–253.</li>\n<li>–––, 2001, “On the Generic Use of\nIndefinite Singulars”, <em>Journal of Semantics</em>, 18(3):\n183–209.</li>\n<li>–––, 2004, “Generics and Mental\nRepresentation”, <em>Linguistics and Philosophy</em>, 27(5):\n529–556.</li>\n<li>–––, 2012, “No Quantification Without\nReinterpretation”, in Mari et al. 2012: pp. 334–351.</li>\n<li>Cohen, A. and N. Erteschik-Shir, 1997, “Topic, Focus and the\nInterpretation of Bare Plurals”, in <em>Proceedings of the\n11<sup>th</sup> Amsterdam Colloquium</em>, P. Dekker, M. Stokhof, and\nY. Venema (eds.), pp. 31–36.</li>\n<li>–––, 2002, “Topic, Focus, and the\nInterpretation of Bare Plurals”, <em>Natural Language\nSemantics</em>, 10(2): 125–165.</li>\n<li>Dahl, O., 1975, “On Generics”, in Keenan 1975:\n99–111.</li>\n<li>–––, 1985, <em>Tense and Aspect Systems</em>,\nOxford: Blackwell.</li>\n<li>Declerk, R., 1986, “The Manifold Interpretations of Generic\nSentences”, <em>Lingua</em>, 68: 149–188.</li>\n<li>–––, 1991, “The Origins of\nGenericity”, <em>Linguistics</em>, 29(1): 79–102.</li>\n<li>Delgrande, J.P., 1987, “A First-Order Conditional Logic for\nPrototypical Properties”, <em>Artificial Intelligence</em>,\n33(1): 105–130.</li>\n<li>Diesing, M., 1992, <em>Indefinites</em>, Cambridge, MA: MIT\nPress.</li>\n<li>Fara, M.G., 2005, “Dispositions and Habituals”,\n<em>Noûs</em>,39(1): 43–82.</li>\n<li>Gelman, S.A., 2003, <em>The Essential Child: Origins of\nEssentialism in Everyday Thought</em>, New York: Oxford University\nPress.</li>\n<li>–––, 2010, “Generics as a Window onto\nYoung Children’s Concepts”, in <em>Kinds, Things, and\nStuff: The Cognitive Side of Generics and Mass Terms</em> (New\nDirections in Cognitive Science v. 12.), F.J. Pelletier (ed.), New\nYork: Oxford University Press, pp. 100–122.</li>\n<li>Gelman, S.A. and P. Bloom, 2007, “Developmental Changes in\nthe Understanding of Generics”, <em>Cognition</em>, 105(1):\n166–183.</li>\n<li>Gelman, S.A., P.J. Goetz, B.S. Sarnecka, and J. Flukes, 2008,\n“Generic Language in Parent-Child Conversations”,\n<em>Language Learning and Development</em>, 4(1): 1–31.</li>\n<li>Gelman, S.A. and L. Raman, 2003, “Preschool Children Use\nLinguistic Form Class and Pragmatic Cues to Interpret Generics”,\n<em>Child Development</em> 74(1): 308–325.</li>\n<li>Gelman, S.A., I. Sánchez Tapia, and S.J. Leslie, 2015,\n“Memory for Generic and Quantified Sentences in Spanish-speaking\nChildren and Adults”, <em>Journal of Child Language</em>, epub\nahead of print. doi:10.1017/S0305000915000483</li>\n<li>Gelman, S.A., and T.Z. Tardif, 1998, “A Cross-Linguistic\nComparison of Generic Noun Phrases in English and Mandarin”,\n<em>Cognition</em>, 66(3): 215–248.</li>\n<li>Gelman, S.A., E.A. Ware, and F. Kleinberg, 2010, “Effects of\nGeneric Language on Category Content and Structure”,\n<em>Cognitive Psychology</em>, 61(3): 273–301</li>\n<li>Gerstner-Link, C., 1988, <em>Uber Generizitat. Generische\nNominalphrasen in Singularen Aussagen und Generischen Aussagen</em>,\nPh.D. dissertation, University of Munich.</li>\n<li>Geurts, B., 1985, “Generics”, <em>Journal of\nSemantics</em>, 4(3): 247–255.</li>\n<li>Graham, S.A., S.L. Nayer, and S.A. Gelman, 2011,\n“Two-Year-Olds Use the Generic/Non-generic Distinction to Guide\nTheir Inferences About Novel Kinds”, <em>Child Development</em>,\n82(2): 493–507.</li>\n<li>Greenberg, Y., 2003, <em>Manifestations of Genericity</em>, New\nYork: Routledge.</li>\n<li>Haslam, N., L. Rothschild, and D. Ernst, 2000, “Essentialist\nBeliefs About Social Categories”, <em>British Journal of Social\nPsychology</em>, 39: 113–127.</li>\n<li>–––, 2002, “Are Essentialist Beliefs\nAssociated with Prejudice?”, <em>British Journal of Social\nPsychology</em>, 41: 87–100.</li>\n<li>Haslanger, S., 2011, “Ideology, Generics, and Common\nGround”, in <em>Feminist Metaphysics: Explorations in the\nOntology of Sex, Gender, and the Self</em>, Charlotte Witt (ed.),\nDordrecht: Springer, pp. 179–209.</li>\n<li>Heim, I., 1982, <em>The Semantics of Definite and Indefinite Noun\nPhrases</em>, Ph.D. dissertation, University of Massachusetts,\nAmherst.</li>\n<li>Heyer, G., 1985, “Generic Descriptions, Default Reasoning,\nand Typicality”, <em>Theoretical Linguistics</em>, 12(1):\n33–72.</li>\n<li>–––, 1987, “Generische Kennzeichnungen:\nZur Logik und Ontologie Generischer Bedeutung”, München:\nPhilosophia Verlag.</li>\n<li>–––, 1990, “Semantics and Knowledge\nRepresentation in the Analysis of Generic Descriptions”,\n<em>Journal of Semantics</em>, 7: 93–110.</li>\n<li>Hesni, S., 2021, “Normative generics: Agains Semantic\nPolysemy”, <em>Thought: A Journal of Philosophy</em>, 10(3):\n218–225.</li>\n<li>Hollander, M.A., S.A. Gelman, and J. Star, 2002,\n“Children’s Interpretation of Generic Noun Phrases”,\n<em>Developmental Psychology</em>, 38(6): 883–894.</li>\n<li>Johnston, M., 2016, “Remnant Persons: Animalism’s\nUndoing”, in <em>Animalism: New Essays on Persons, Animals, and\nIdentity</em>, S. Blatti and P. Snowdon (eds.), Oxford: Oxford\nUniversity Press, pp. 89–128.</li>\n<li>Johnston, M. and S.J. Leslie, 2012, “Concepts, analysis,\ngenerics and the Canberra plan”, <em>Philosophical\nPerspectives</em>, 26(1): 113–171.</li>\n<li>–––, 2019, “Cognitive Psychology\nand the Metaphysics of Meaning”, <em>Metaphysics and Cognitive\nScience</em>. Oxford: Oxford University Press, pp. 183–205.</li>\n<li>Jönsson, M.L. and J.A. Hampton, 2006, “The Inverse\nConjunction Fallacy”, <em>Journal of Memory and Language</em>,\n55(3): 317–334.</li>\n<li>Kamp, H., 1981, “A Theory of Truth and Semantic\nInterpretation”, in <em>Formal Methods in the Study of\nLanguage</em>, J. Groenendijk, J. Janssen and M. Stokhof (eds.),\nDordrecht: Forts Publications, pp. 277–322.</li>\n<li>Kamp, H. and U. Reyle, 1993, <em>From Discourse to Logic</em>,\nDordrecht: Kluwer Academic Publishers.</li>\n<li>Kaplan, D., 1989, “Demonstratives: An Essay on the\nSemantics, Logic, Metaphysics, and Epistemology of Demonstratives and\nOther Indexicals”, in <em>Themes from Kaplan</em>, J. Almog, J.\nPerry, and H. Wettstein (eds.), Oxford: Oxford University Press, pp.\n481–563.</li>\n<li>Keenan, E.L. (ed.), 1975, <em>Formal Semantics of Natural\nLanguage</em>, Cambridge: Cambridge University Press.</li>\n<li>Khemlani, S., S.J. Leslie, and S. Glucksberg, 2012,\n“Inferences About Members of Kinds: The Generics\nHypothesis”, <em>Language and Cognitive Processes</em>, 27(6):\n887–900.</li>\n<li>Kiss, K.E., 1998, “On Generic and Existential Bare Plurals\nand the Classification of Predicates”, in <em>Events and\nGrammar</em>, S. Rothstein (ed.), Dordrecht: Kluwer, pp.\n145–162.</li>\n<li>Knobe, J., S. Prasada, and G. Newman, 2013, “Dual Character\nConcepts and the Normative Dimension of Conceptual\nRepresentation”, <em>Cognition</em>, 127: 242–257.</li>\n<li>Kratzer, A., 1995, “Stage-Level and Individual-Level\nPredicates”, in Carlson and Pelletier 1995: 125–176.</li>\n<li>Krifka, M., partly in collaboration with Claudia Gerstner, 1987,\n<em>An Outline of Genericity</em>, <em>SNS-Bericht 87–23</em>,\nUniversity of Tubingen.</li>\n<li>Krifka, M., F. Pelletier, G. Carlson, A. ter Meulen, G. Chierchia,\nand G. Link, 1995, “Genericity: An Introduction”, in\nCarlson and Pelletier 1995: 1–125.</li>\n<li>Laca, B., 1990, “Generics Objects: Some More Pieces of the\nPuzzle”, <em>Lingua</em>, 81: 25–46.</li>\n<li>Lawler, J., 1972, “Generic to a Fault”, in <em>Papers\nfrom the 8th Regional Meeting, Chicago Linguistic Society</em> (CLS\n8), Chicago: Chicago Linguistic Society, pp. 247–258.</li>\n<li>–––, 1973, “Studies in English\ngenerics”, <em>University of Michigan Papers in\nLinguistics</em>, 1(1).</li>\n<li>Lazaridou-Chatzigoga, D. and L. Stockall, 2013, “Genericity,\nExceptions and Domain Restriction: Experimental Evidence from\nComparison with Universals”, in <em>Proceedings of Sinn und\nBedeutung</em>, 17, E. Chemla, V. Homer, and G. Winterstein (eds.),\npp. 325–343.</li>\n<li>Lazaridou-Chatzigoga, D., N. Katsos, and L. Stockall, 2015,\n“Genericity Is Easy? Formal and Experimental\nPerspectives”, <em>Ratio</em>, 28(4): 470–494.</li>\n<li>Lerner, A. and S.J. Leslie, 2013, “Generics, Generalism, and\nReflective Equilibrium: Implications for Moral Theorizing from the\nStudy of Language”, <em>Philosophical Perspectives</em> 27(1):\n366–403.</li>\n<li>Leshin, R.A., S.J. Leslie, and M. Rhodes, 2021, “Does It\nMatter How We Speak About Social Kinds? A Large, Preregistered, Online\nExperimental Study of How Language Shapes the Development of\nEssentialist Beliefs”, <em>Child Development</em>, 92(4):\ne531–e547.</li>\n<li>Leslie, S.J., 2007, “Generics and the Structure of the\nMind”, <em>Philosophical Perspectives</em>, 21(1):\n375–403.</li>\n<li>–––, 2008, “Generics: Cognition and\nAcquisition”, <em>Philosophical Review</em>, 117(1):\n1–47.</li>\n<li>–––, 2012, “Generics Articulate Default\nGeneralizations”, <em>Recherches Linguistiques de\nVincennes</em>, 41: 25–44.</li>\n<li>–––, 2014, “Carving Up the Social World\nwith Generics”, <em>Oxford Studies in Experimental\nPhilosophy</em>, 1: 208–232.</li>\n<li>–––, 2015a, “Generics\nOversimplified”, <em>Noûs</em>, 49(1): 28–54.</li>\n<li>–––, 2015b, “‘Hillary Clinton is the\nOnly Man in the Obama Administration’: Dual Character Concepts,\nGenerics, and Gender”, <em>Analytic Philosophy</em>, 56(2):\n111–141.</li>\n<li>–––, 2017, “The Original Sin of Cognition:\nFear, Prejudice, and Generalization”, <em>The Journal of\nPhilosophy,</em> 114(8): 1–29.</li>\n<li>Leslie, S.J. and S.A. Gelman, 2012, “Quantified Statements\nare Recalled as Generics: Evidence from Preschool Children and\nAdults”, <em>Cognitive Psychology</em>, 64(3):\n186–214.</li>\n<li>Leslie, S.J., S. Khemlani, and S. Glucksberg, 2011, “Do All\nDucks Lay Eggs? The Generic Overgeneralization Effect”,\n<em>Journal of Memory and Language</em>, 65(1): 15–31.</li>\n<li>Lewis, D., 1975, “Adverbs of Quantification”, in\nKeenan 1975: 3–15.</li>\n<li>Liebesman, D., 2011, “Simple Generics”,\n<em>Noûs</em>, 45(3): 409–442.</li>\n<li>Mannheim, B., S.A. Gelman, C. Escalante, M. Huayhua, and R. Puma,\n2011, “A Developmental Analysis of Generic Nouns in Southern\nPeruvian Quechua”, <em>Language Learning and Development</em>,\n7(1): 1–23.</li>\n<li>Mari, A., C. Beyssade, and F.D. Prete (eds.), 2012,\n<em>Genericity</em>, Oxford: Oxford University Press.</li>\n<li>McCarthy, J., 1986, “Applications of Circumscription to\nFormalizing Commonsense Knowledge”, <em>Artificial\nIntelligence</em>, 28(1): 89–116.</li>\n<li>McConnell-Ginet, S., 2012, “Generic Predicates and Interest\nRelativity”, <em>Canadian Journal of Linguistics</em>, 57(2):\n289–302.</li>\n<li>ter Meulen, A., 1986, “Generic Information, Conditional\nContexts and Constraints”, in <em>On Conditionals</em>, E.C.\nTraugott, A. ter Meulen, J.S. Reilly, and C.A. Ferguson (ed.).\nCambridge: Cambridge University Press, pp. 123–146.</li>\n<li>Meyer, M., S.A. Gelman, and S.M. Stilwell, 2011, “Generics\nAre a Cognitive Default: Evidence from Sentence Processing”, in\n<em>Proceedings of the 33<sup>rd</sup> Annual Conference of the\nCognitive Science Society</em>, Boston, MA: Cognitive Science Society,\npp. 913–918.</li>\n<li>Milsark, G., 1974, <em>Existential Sentences in English</em>,\nPh.D. dissertation, MIT.</li>\n<li>Nickel, B., 2008, “Generics and the Way of Normality”,\n<em>Linguistics and Philosophy</em>, 31(6): 629–648.</li>\n<li>–––, 2010, “Ceteris Paribus Laws: Generics\nand Natural Kinds”, <em>Philosopher’s Imprint</em>, 10(6):\n1–25.\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0010.006\" target=\"other\">Nickel 2010 available online</a>]</li>\n<li>–––, 2012, “Dutchmen are Good Sailors:\nGenerics and Gradability”, in Mari et al. 2012:\n390–405.</li>\n<li>–––, 2014, “The Role of Kinds in the\nSemantics of <em>Ceterius Paribus</em> Laws”,\n<em>Erkenntnis</em>, 79(10): 1729–1744.\ndoi:10.1007/s10670-014-9638-5</li>\n<li>–––, 2016, <em>Between Logic and the World: An\nIntegrated Theory of Generics</em>, Oxford: Oxford University\nPress.</li>\n<li>Nunberg, G. and C. Pan, 1975, “Inferring Quantification in\nGeneric Sentences”, in <em>Papers from the Eleventh Regional\nMeeting of the Chicago Linguistic Society</em> (CLS 11), Chicago:\nChicago Linguistic Society, pp. 412–422.</li>\n<li>Nyugen, A. 2020, “The Radical Account of Bare Plural\nGenerics”, <em>Philosophical Studies</em>, 177:\n1303–1331.</li>\n<li>Ojeda, Almerindo, 1991, “Definite Descriptions and Definite\nGenerics”, <em>Linguistics and Philosophy</em>, 14:\n367–397.</li>\n<li>Pelletier, F.J. and N. Asher, 1997, “Generics and\nDefaults”, in <em>Handbook of Logic and Language</em>, J. van\nBenthem and A. ter Meulen (eds.), Cambridge, MA: MIT Press, pp.\n1125–1179.</li>\n<li>Platteau, F., 1980, “Definite and Indefinite\nGenerics”, in J. van der Auwera (ed.), <em>The Semantics of\nDeterminers</em>, London: Croom Helm, pp. 112–123,</li>\n<li>Prasada, S. and E.M. Dillingham, 2006, “Principled and\nStatistical Connections in Common Sense Conception”,\n<em>Cognition</em>, 99(1): 73–112.</li>\n<li>–––, 2009, “Representation of Principled\nConnections: A Window onto the Formal Aspect of Common Sense\nConception”, <em>Cognitive Science</em>, 33(3):\n401–448.</li>\n<li>Prasada, S., S. Khemlani, S.J. Leslie, and S. Glucksberg. 2013,\n“Conceptual Distinctions Amongst Generics”,\n<em>Cognition</em>, 126(3): 405–422.</li>\n<li>Reiter, R., 1987, “Nonmonotonic Reasoning”, in\n<em>Annual Review of Computer Science</em>, J.F. Traub, N.J. Nilsson,\nand B.J. Grosz (eds.), Palo Alto: Annual Reviews Inc., pp.\n147–186.</li>\n<li>Ritchie, K., 2019, “Should We Use Racial and Gender\nGenerics?”, <em>Thought: A Journal of Philosophy</em>, 8(1):\n33–41.</li>\n<li>Rhodes, M., S.J. Leslie, and C. Tworek, 2012, “Cultural\nTransmission of Social Essentialism”, <em>Proceedings of the\nNational Academy of Sciences (PNAS)</em>, 109(34):\n13526–13531.</li>\n<li>Rhodes, M., A. Cardarelli, and S.J. Leslie, 2020, “Asking\nyoung children to ‘do science’ instead of ‘be\nscientists’ increases science engagement in a randomized field\nexperiment”, <em>Proceedings of the National Academy of\nSciences</em>, 117(18): 9808–9814.</li>\n<li>Roberts, S. O., A.K. Ho, and S.A. Gelman, 2017, “Group\npresence, category labels, and generic statements foster\nchildren’s tendency to enforce group norms”, <em>Journal\nof Experimental Child Psychology</em>, 158: 19–31.</li>\n<li>Rosch, E.H., 1978, “Principles of Categorization”, in\n<em>Cognition and Categorization</em>, E. Rosch and B. Lloyd (eds.),\nHillsdale, N.J.: Erlbaum Associates, pp. 27–48.</li>\n<li>Schubert, L.K. and F.J. Pelletier. 1987, “Problems in\nRepresenting the Logical Form of Generics, Bare Plurals, and Mass\nTerms”, in <em>New Directions in Semantics</em>, E. Lepore (ed.),\nLondon: Academic Press, pp. 385–451.</li>\n<li>–––, 1989, “Generically Speaking, or Using\nDiscourse Representation Theory to Interpret Generics”, in\nChierchia et al. 1989: 193–268.</li>\n<li>Sloman, S.A., 1993, “Feature-Based Induction”,\n<em>Cognitive Psychology</em>, 25(2): 231–280.</li>\n<li>–––, 1998, “Categorical Inference Is Not a\nTree: The Myth of Inheritance Hierarchies”, <em>Cognitive\nPsychology</em> 35(1): 1–33.</li>\n<li>Sorensen, R., 2012, “The Sorites and the Generic\nOvergeneralization Effect”, <em>Analysis</em>, 62(3):\n444–449.</li>\n<li>Steele, C.M., 2010, <em>Whistling Vivaldi: How Stereotypes Affect\nUs and What We Can Do</em>, New York: W.W. Norton &amp; Company,\nInc.</li>\n<li>Steele, C.M. and J. Aronson, 1995, “Stereotype Threat and\nthe Intellectual Test Performance of African Americans”,\n<em>Journal of Personality and Social Psychology</em>, 69(5):\n797–811.</li>\n<li>Sterken, R.K., 2015a, “Generics in Context”,\n<em>Philosopher’s Imprint</em>, 15(21): 1–30.\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0015.021\" target=\"other\">Sterken 2015 available online</a>]</li>\n<li>Sterken, R. 2015b, “Leslie on generics”,\n<em>Philosophical Studies,</em> 172: 2493–512.</li>\n<li>Stump, G., 1985, <em>The Semantic Variability of Absolute\nConstructions</em>, Dordrecht: Reidel.</li>\n<li>Tardif, T., S.A. Gelman, X. Fu, and L. Zhu., 2011,\n“Acquisition of Generic Noun Phrases in Chinese: Learning About\nLions Without an ‘-s’”, <em>Journal of Child\nLanguage</em>, 30(1): 130–161.</li>\n<li>Teichman, M., 2016, “The Sophisticated Kind Theory”,\n<em>Inquiry</em>.\n <a href=\"https://doi.org/10.1080/0020174X.2016.1267407\" target=\"other\">Teichman 2016 available online</a></li>\n<li>Tessler, M. H., and N.D. Goodman, 2019, “The language of\ngeneralization”, <em>Psychological Review</em>, 126(3):\n395.</li>\n<li>Ullman, T. and J. Tenenbaum, 2020, “Bayesian models of\nconceptual development: Learning as building models of the\nworld”, <em>Annual Review of Developmental Psychology</em>, 2:\n533–558.</li>\n<li>Wasserman, R., 2011, “Dispositions and Generics”,\n<em>Philosophical Perspectives</em>, 25(1): 425–453.</li>\n<li>Wilkinson, K., 1995, “The Common Noun <em>Kind</em>”,\nin Carlson and Pelletier 1995: 383–397.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "concepts",
            "dispositions",
            "generalized quantifiers",
            "laws of nature: ceteris paribus",
            "logical form",
            "mass expressions: metaphysics of",
            "situations: in natural language semantics"
        ],
        "entry_link": [
            {
                "../concepts/": "concepts"
            },
            {
                "../dispositions/": "dispositions"
            },
            {
                "../generalized-quantifiers/": "generalized quantifiers"
            },
            {
                "../ceteris-paribus/": "laws of nature: ceteris paribus"
            },
            {
                "../logical-form/": "logical form"
            },
            {
                "../metaphysics-massexpress/": "mass expressions: metaphysics of"
            },
            {
                "../situations-semantics/": "situations: in natural language semantics"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=generics\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/generics/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=generics&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/generics/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=generics": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/generics/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=generics&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/generics/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://philpapers.org/browse/generics/\" target=\"other\">Generics Bibliography</a>,\n at PhilPapers"
        ],
        "listed_links": [
            {
                "http://philpapers.org/browse/generics/": "Generics Bibliography"
            }
        ]
    }
}