{
    "url": "geometry-finitism",
    "title": "Finitism in Geometry",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Jean Paul Van Bendegem\n<Jean.Paul.Van.Bendegem@vub.be>",
        "author_links": [
            {
                "https://clps.research.vub.be/jean-paul-van-bendegem-0": "Jean Paul Van Bendegem"
            },
            {
                "mailto:Jean%2ePaul%2eVan%2eBendegem%40vub%2ebe": "Jean.Paul.Van.Bendegem@vub.be"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\n<a href=\"https://clps.research.vub.be/jean-paul-van-bendegem-0\" target=\"other\">Jean Paul Van Bendegem</a>\n&lt;<a href=\"mailto:Jean%2ePaul%2eVan%2eBendegem%40vub%2ebe\"><em>Jean<abbr title=\" dot \">.</abbr>Paul<abbr title=\" dot \">.</abbr>Van<abbr title=\" dot \">.</abbr>Bendegem<abbr title=\" at \">@</abbr>vub<abbr title=\" dot \">.</abbr>be</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Apr 3, 2002",
        "substantive revision Wed Dec 27, 2023"
    ],
    "preamble": "\n\nIn our representations of the world, especially in physics,\n(mathematical) infinities play a crucial role. The continuum of the\nreal numbers, \\(\\Re\\), as a representation of time or of\none-dimensional space is surely the best known example and, by\nextension, the \\(n\\)-fold cartesian product, \\(\\Re^{n}\\), for\n\\(n\\)-dimensional space. However, these same infinities also cause\nproblems. One just has to think about Zeno’s paradoxes or the\npresent-day continuation of that discussion, namely the discussion\nabout supertasks, to see the difficulties (see the entry on\n supertasks\n in this encyclopedia for a full treatment). Hence, it is a very\ntempting idea to investigate whether it is possible to eliminate these\ninfinities and still be able to do physics. The first step towards an\nanswer to that question is to examine whether or not a discrete\ngeometry is possible that can approximate classical continuous\ngeometry as closely as possible. For, if such is the case, the latter\ngeometry can easily be replaced by a discrete version in any physical\ntheory that makes use of this particular mathematical background.\n\nStraightforward as the task may seem, there are however at least two\nways in which the concept of approximation can be understood. Suppose\nthat \\(T\\) is a physical theory that is based on classical geometry.\nThen an approximation to \\(T\\) can mean two different things:\n\nFor all concepts in \\(T\\), including the geometrical concepts, a\ndiscrete analog is proposed (if such a thing exists), or\nAn underlying theory \\(T^\\prime\\) is formulated using possibly\ndifferent concepts in such a way that the classical concepts can be\nderived from \\(T^\\prime\\).\n\n\nIn the sections that follow an overview will be presented of (some of)\nthe various attempts that fall under (a) or (b). However, before\nembarking on this journey, several caveats have to be\nmentioned.\n",
    "toc": [
        {
            "#SomGenCon": "1. Some general considerations"
        },
        {
            "#Log": "1.1 Logicians"
        },
        {
            "#Mat": "1.2 Mathematicians"
        },
        {
            "#ComSci": "1.3 Computer scientists"
        },
        {
            "#Phy": "1.4 Physicists"
        },
        {
            "#Phi": "1.5 Philosophers"
        },
        {
            "#DisGeoDirAna": "2. Discrete geometries as direct analogs"
        },
        {
            "#StaAxiForEucPlaGeo": "2.1 A standard axiomatisation for Euclidean plane geometry"
        },
        {
            "#FinSchNatGeo": "2.2 The Finnish school and natural geometry"
        },
        {
            "#ConApp": "2.3 Constructive approaches"
        },
        {
            "#DirPhyExa": "2.4 A direct physical example: a discrete version of special relativity theory"
        },
        {
            "#SomParSolProDea": "2.5 Some partial solutions and problems to deal with"
        },
        {
            "#DisGeoGenClaGeo": "3. Discrete geometries as generators of classical geometry"
        },
        {
            "#GenFra": "3.1 The general framework"
        },
        {
            "#ProExaUsiGra": "3.2 A prototypical example, using graphs"
        },
        {
            "#SpeCasComHie": "3.3 A special case: the combinatorial hierarchy"
        },
        {
            "#ItEmpPro": "3.4 Can it be an empirical problem?"
        },
        {
            "#WhaNeeDonNex": "4. What needs to be done next?"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Some general considerations\n\nThe most important thing to take into account is, given a particular\nproposal for a discrete geometry, what the scientific and/or\nphilosophical background is of the author(s) and, related to that,\nwhat their intentions are. Are they logicians, mathematicians,\ncomputer scientists, physicists or philosophers (to list the five most\nfrequently occurring cases)? Do they want to solve a mere technical, a\nphysical or a philosophical problem? Are they worried about\nfoundational aspects or is the object of their research to further\ndevelop existing theories? It is worthwhile to go into some more\ndetail for each of the five types of author(s) mentioned to illustrate\nthese questions.\n1.1 Logicians\n\nLogicians are often interested in displaying the underlying logical\nstructure of a theory, physical or mathematical, and in exploring\nwhether or not there are alternatives, usually by changing the\nunderlying logical principles. One could imagine a geometry based not\non classical logic, but, e.g., on intuitionistic logic, where\nprinciples such as the excluded third, i.e., \\(p\\) or not-\\(p\\), for\nany statement \\(p\\), or double negation, i.e., if not-not-\\(p\\) then\n\\(p\\), no longer hold. Often the goal is to find a complete\nclassification of all possibilities. This approach implies that the\nlogician working on and developing discrete models, does not\nnecessarily believe that these models are correct or true in some\nsense. They merely help to understand better what classical geometry\nis.\n\nA perfect illustration of such an approach is the work on spatial\nlogic, see Aiello et al. (2007) for an excellent overview. The authors\ncompare their approach to the work done in temporal logic (see the\nentry on\n temporal logic\n in this encyclopedia). There are plenty of ways to model time: with a\nstarting and/or final point, discrete or continuous, linear, cyclic or\nbranching, …. The logical task is to construct a language that\nallows one to “talk” about all these structures and to be\nable to differentiate between them. In temporal logic such a language\nuses the operators \\(Fp\\) (“I will be the case that\n\\(p\\)”) and \\(Pp\\) (“It has been the case that\n\\(p\\)”). One example: if time is linear in the future, then this\nproperty can be expressed as follows. Suppose that \\(Fp\\) and \\(Fq\\)\nare given, then only three things are possible: either \\(F(p \\amp\nq)\\), i.e., \\(p\\) and \\(q\\) will be the case, or \\(F(p \\amp Fq)\\),\ni.e., \\(p\\) will happen first and then \\(q\\), or \\(F(Fp \\amp q)\\),\ni.e., the other way round. In one formula: \\((Fp \\amp Fq) \\rightarrow\n(F(p \\amp q)\\) or \\(F(p \\amp Fq)\\) or \\(F(Fp \\amp q))\\). In an\nentirely similar way, to construct such a language is what spatial\nlogic wants to achieve for geometry and is thus related to the\nproposals that we will discuss in\n section 3.\n\nA different logical approach is to make the connection between\nconstructivity in geometry and constructivity in logic. Naibo (2015)\nis a fine example, leading to a rather particular view on geometry as\nthe author claims that “Euclidean geometry can be seen as a\ntheory the ontology of which is not composed of a set of extensional\nobjects playing the role of references of language expressions but is\ncomposed instead of intensional objects represented by constructive\nactions corresponding to the algorithmic procedures” (Naibo\n2015, 158). Such approaches are related to the constructive, more\nconcrete and non-intensional approach of Suppes, discussed in\n section 2.3.\n1.2 Mathematicians\n\nA mathematician might be looking at or studying a discrete or finite\ncounterpart of an existing theory just to see, e.g., what theorems\nremain provable in both cases. This in itself is interesting from the\nperspective of so-called reverse mathematics. The core question is to\nfind out what is necessarily required to prove certain theorems? See,\ne.g., Simpson (2005) and Stillwell (2016). Proofs that also hold in a\ndiscrete geometry are thus independent from any assumption about\ndiscreteness or continuity. One might however go deeper into the\nfoundations of mathematics and study finite geometries from a\nfoundational perspective. One such approach is strict finitism\n(although sometimes the terms ultra-finitism or ultra-intuitionism are\nused as well) that is not meant as a subtheory of other foundational\ntheories but as an alternative on its own. It shares with the many\nforms of constructivism the fundamental view that mathematical objects\nand concepts have to be accessible to the mathematician in terms of\nconstructions that can be executed or performed. The various forms are\ndistinguished from one another as to how the concepts of\n“execution” or “performance” are to be\nunderstood. Most constructivists allow for the potentially infinite,\ni.e., if a procedure or algorithm will (provably) terminate at some\nmoment in the future, then the outcome is accepted as constructable.\nSee Bridges & Richman (1987) for an overview and the entry on\n constructive mathematics.\n Strict finitism wants to go one step further and argues that an\nindefinite outcome is not be accepted as an outcome, since, as all\ncomputational resources are finite, it could very well be that these\nresources have been used up before the outcome has been reached. The\nadditional qualification serves to make the distinction with\nHilbert’s finitism which, roughly speaking, can be seen as a\nform of finitism on the meta-level (e.g., although mathematical\ntheories can talk about infinite structures, still the proofs in such\ntheories must have a finite length). As might be expected, strict\nfinitism is not a popular view in the philosophy of mathematics.\nNevertheless a number of proposals have been put forward. A history\nand an account of the actual (though now somewhat dated) state of\naffairs can be found in Welti (1987). In\n section 2\n more will be said about such proposals.\n1.3 Computer scientists\n\nIn the computer sciences the theories and proposals that have been put\nforward are of a quite different nature than the logical and\nmathematical ones, although they do inspire one another. The problem\none faces here is precisely to set up a translation from a classical\ngeometrical, analogous model to a model whereof the domain (usually)\nconsists of the finite set of pixels or cells that make up the\n(computer) screen. The obvious drawback (from the perspective of this\nentry) is that nearly all these models assume the classical (infinite)\nmodel in the background and, hence, do not have a proper foundation of\ntheir own—a situation quite analogous to numerical analysis that\nrelies on classical analysis for proving the correctness of the\nprocedures. Most attention is paid to the problem of proving\ncorrespondences between the original and the discrete model to make\nsure that the image obtained is, in certain respects, faithful to the\noriginal. A simple mathematical example concerns the number of holes\nin a 3-dimensional Euclidean surface. One wants to be sure that every\nhole that shows up in the digital picture does indeed correspond to a\nhole in the original mathematical object. See Borwein & Devlin\n(2009) for more examples. However, that being said, there is some work\nbeing done that does not want to rely on the classical continuous\nbackground but instead looks for “proper” axiomatisations\nand/or formalisations of a pixel geometry. See Kulpa (1979) and, more\nrecently, Danielsson (2002) for some nice examples.\n\nA different line of investigation concerns the use of mereology (see\nthe entry\n mereology\n in this encyclopedia for an overview) as an alternative approach to\nclassical geometry, often referred to as mereogeometry or\nmereotopology. The main feature is not to take a point as a primitive\nnotion but a region, usually with a finite extension (or unspecified).\nThe main motivation is to be found in the interaction between\ncognitive psychology and the computer sciences. The modelling of\nvisual perception and cognition is a prime example. Although there is\nan obvious connection with finite geometry, it is not really\ninvestigated at present. Rare examples are Galton (1999) and Schmidtke\n(2016). There are also parallels and connections to be found and to be\nexplored between mereogeometry and topology and ‘natural\ngeometry’, mentioned in\n section 2.2.\n\nNote also that these theories should not be confused with computer\nprograms that have the ability to reason about geometrical\nobjects. This is part of the research area of automated\nreasoning—see Chou et al. (1994) for a nice introduction, and\nthe entry\n automated reasoning\n in this encyclopedia— and its basic objects are proofs, not\nnecessarily the mathematical objects the proofs are about.\n1.4 Physicists\n\nAs is commonly known, one of the hot topics in physics is the search\nfor the unification of quantum (field) theory and general relativity\ntheory. If successful, the famous “Theory of Everything”\nwould result. As is equally well-known, the hardest problem to solve\nis how to deal with space-time. Quantum (field) theory requires space\nand time as a background, whereas in general relativity the structure\nof space-time is largely determined by the masses and the energy\npresent. One way out—and most of\n section 3\n deals with such examples—is to find a “deeper”\nstructure that underlies both theories and that, in a sense, generates\nspace and time from more fundamental concepts. Clearly, if such a\ntheory were to be found, it would not merely produce\n“just” a model, but it would actually be considered as a\ngenuine representation of reality. Most of these models, speculative\nas some of them may be at the present moment, turn out to be discrete\nand hence these proposals, in contradistinction, e.g., with the\nlogicians, do claim to be a correct description. For a recent informal\noverview, see Rovelli (2016), especially chapter 11, “The End of\nInfinity”.\n\nTwo remarks need to be made. First, from the mathematical perspective,\nthe focus of this entry is on geometry and not on other possibilities\nto reformulate physical theories in a discrete way. An excellent\nexample of such an alternative is to be found in Carroll (2023), where\nquantum mechanics is made discrete not through space and/or time but\nthrough the Hilbert state space. This space has an infinite number of\ndimensions in the standard presentation but what if there are only a\nfinite (though large) number of dimensions? Secondly, from the\nhistorical perspective, it must be added that on and off some\nphysicist tried to find out what discrete counterparts of existing\nclassical physical theories could look like. Usually the philosophical\nunderpinnings of such an attempt tend to be rather idiosyncratic. In\n section 2\n one such example will be presented. Typically such attempts did not\ncreate a major stir, they quickly disappeared into the background, but\nnevertheless they do contain some interesting and relevant ideas.\n1.5 Philosophers\n\nIn a rather straightforward sense, all of the above involves\nphilosophers as well. Discussions about logical systems, about\nfoundational mathematical theories, about Zeno paradoxes, about\nsupertasks, about what a model and a representation are, …, are\ntypically topics that belong to the domain of the philosophers. In\naddition they bring in arguments from other philosophical and/or\nscientific domains. Suppose that there are excellent arguments from an\nepistemological or ontological perspective, claiming that the world\nshould be considered discrete, then these arguments can support the\nsearch for such a discrete worldview, including the elaboration of a\ndiscrete geometry. Even if from the mathematical point of view, the\ntheory looks rather clumsy or difficult to work with, nevertheless,\nbecause of the philosophical considerations, it has to be so. Without\nsuch supporting arguments, one’s position in such a case would\nbe much weaker. Finally, they also pay attention to the historical\nside of the matter. It is rather striking, but this will not be\npresented here, to see that many proposals have been put forward in\nthe course of our history to demonstrate that space, time and man\nshould be considered finite and/or discrete. See, e.g., Sorabji (1983)\nand Moore (1993) for excellent historical overviews, White (1992) for\ntwentieth-century developments, and Franklin (2017), Lyons (2017) and\nSewell (2022) for some recent contributions.\n\nAs said, these five groups are the most important ones so completeness\nhas not been demonstrated and neither has mutual exclusiveness been\nshown. This short overview is only meant to list the different\nintentions, motivations, purposes and methodologies of the parties\ninvolved.\n2. Discrete geometries as direct analogs\n\nThe first question to settle is what the classical theory will be. As\nmost of the work that has been done has been limited to the plane,\nthis presentation will also be restricted to that particular case (in\nmost proposals the extension to higher dimensional geometries is\nconsidered to be completely straightforward). But that is not\nsufficient, for there are different routes to follow as to the\npresentation of plane geometry. One possibility is to take any\naxiomatisation of the (Euclidean) plane—say, Hilbert’s\nformulation of 1899 in his Grundlagen der Geometrie—and\nshow what changes are required to have (a) finite models of the\naxiomatic theory, and (b) finite models that approximate the classical\n(infinite, Euclidean) models as closely as possible. One of the very\nfirst attempts dates back to the late 40s, early 50s and will\ntherefore be presented here as an exemplar (in the sense that it has\nboth all the positive qualities required as well as the oddities that\nseem to go together with such attempts). More specifically, it\nconcerns the work of Paul Kustaanheimo in partial collaboration with\nG. Järnefelt in the period between 1949 and 1957. Next a proposal\nwill be discussed, along totally different lines, of Patrick Suppes,\ntogether with a more recent similar approach by John Burke. Then\nfollows a somewhat older proposal of Ludwik Silberstein, where the\ngeometry is directly imbedded in a physical theory, special relativity\ntheory to be precise. The concluding section of this part deals with\nsome specific problems and tentative solutions.\n2.1 A standard axiomatisation for Euclidean plane geometry\n\nWhat does a Hilbert-type axiomatisation look like? The first thing one\nhas to do is to fix a (formal) language. Usually one chooses\nfirst-order predicate logic with identity, i.e., a language containing\nnames for variables (and, possibly, for constants), names for\nfunctions (if necessary), names for predicates including the identity\npredicate, logical connectives and quantifiers, and a set of\ngrammatical rules to form sentences. The restriction to first-order\nlogic means that only variables can be quantified over. Without going\ninto details, it should be remarked that a more expressive language\ncan be chosen, e.g., whereby quantification over predicates is allowed\nas well.\n\nOnce a language has been chosen, the next problem is to determine the\nprimitive terms of the language. For plane Euclidean geometry, these\nare points and lines, although sometimes lines are defined as\nparticular sets of points. Next the basic predicates have to be\nselected. There exist a number of different axiomatisations at the\npresent moment. The most frequently used predicates are: the incidence\nrelation (“a point \\(a\\) lies on a line \\(A\\)”), the\nbetweenness relation (“point \\(a\\) lies between points \\(b\\) and\n\\(c\\)”), the equidistance relation (“the distance from\npoint \\(a\\) to \\(b\\) is the same as the distance from point \\(c\\) to\n\\(d\\)”), the congruence relation (“a part of a line,\ndetermined by two point \\(a\\) and \\(b\\) is congruent to a part of a\nline, determined by two points \\(c\\) and \\(d\\)”). Note that it\nis not necessary that all of them occur in an axiomatisation. As an\nexample, if lines are not introduced as primitive terms, then usually\nthere is no incidence relation.\n\nThe next step is the introduction of a set of axioms to determine\ncertain properties of the above mentioned relations. As an example, if\nthe axiomatisation uses the incidence relation, then the typical\naxioms for that relation are:\n\nThrough two points exactly one straight line can be drawn.\nThere are at least two points on every straight line.\nThere are at least three points that are not on the same straight\nline.\n\n\nFinally, one looks for an interpretation or a model of the\naxiomatisation. This means that we search for a meaning of the\nprimitive terms, such as points and lines, of the functions (if any)\nand of the predicates in such a way that the axioms become true\nstatements relative to the interpretation. Although we often have a\nparticular interpretation in mind when we develop an axiomatisation,\nit does not exclude the possibility of the existence of rather\nunexpected models. In a sense finitist models rely on this very\npossibility as the next paragraph shows.\n2.2 The Finnish school and natural geometry\n\nPaul Kustaanheimo was a member of a group of mathematicians based at\nHelsinki, who were all interested in some form of finite geometry. The\nmost prominent members were G. Järnefelt, P. Kustaanheimo, and R.\nLehti. The origin of their inspiration is to be found in the work of\nJ.T. Hjelmslev who developed so-called “natural” geometry\n(“Die natürliche Geometrie”, see his 1923\nbook), also referred to sometimes as “physical” geometry\n(and, as mentioned above, itself related to mereology). Their approach\nhas not known any continuation, one exception being Reisler and Smith\n(1969). However, in a strange way there is a connection with\nSuppes’ and Burke’s approach to be discussed later in the\nsense that geometry is primarily seen as (almost) an experimental\nscience, i.e., the geometer deals with rulers and compasses, creates\nflat surfaces to measure, and so on. Of course, since we humans can\nonly manipulate finite objects in finite ways, a discrete geometry\nmust result.\n\nKustaanheimo’s proposal—I reproduce here in rough outline\nthe excellent presentation of his proposal in Welti (1987:\n487–521), which is far more accessible than the original\nwork—is based on the following line of reasoning. A standard\nmodel for the classical axiomatic theory of Euclidean geometry\nconsists of the cartesian product of the real numbers with itself. Or,\nas it is usually formulated, a point in the plane is mapped onto a\ncouple of real numbers, its coordinates. The real numbers have the\nmathematical structure of an infinite field. But finite fields exist\nas well. So why not replace the infinite real number field with a\nfinite field, a so-called Galois field?\n\nThe best result one could obtain would be that every finite Galois\nfield satisfies most of the axioms of Euclidean geometry. That however\nis not the case. The outcome of Kustaanheimo’s research is\nslightly more complicated:\n\nNot all finite fields will do. If we call \\(p\\) the number of\nelements in the domain of the finite field, then \\(p\\) has to satisfy\nsome conditions. This means that only finite fields of a particular\nsize, i.e., a specific value for \\(p\\), are potential candidates.\nFor the “good” values of \\(p\\), the full model will\nnot do. As an example, take straight lines. According to their\ndefinition in a finite field, it turns out that there are two sorts of\nstraight lines: open and closed ones. The latter ones violate some of\nthe axioms, hence you restrict the model to the open ones. This\nrestriction of the model is called the Euclidean “kernel”\nof the model.\n\n\nIn short, one cannot claim that any finite field will do, but only\nsome and for that matter only part of it.\n\nThis approach raises some important philosophical questions:\n\nIt is clear that the size of the model is an important feature.\nDoes this have any meaning? Or, negatively, what does it mean that\nfields of a different size are not suitable as models? Suppose as a\nthought experiment that Euclidean geometry is a good model for the\ngeometrical structure of the universe. Does it make sense to claim\nthat the universe must contain exactly \\(p\\) points (not \\(p-1\\), not\n\\(p+1\\))? A new sort of Pythagoreanism seems to be lurking around the\ncorner here.\nThe example of the straight lines shows that there are\n“nice” geometrical objects (those that satisfy most of the\naxioms) and “bad” geometrical objects. Ignoring\nthe bad ones is perhaps a mathematically interesting strategy, but it\ndoes not eliminate them from the full model. In other words,\nalthough they do not play any relevant part in the\n“kernel” of the model, they are there. What is the meaning\nof that? To continue the above thought experiment, the question is\nwhat corresponds to the “bad” objects in the universe? If\nthey do not correspond to anything, why do we need them in the first\nplace to find the “good” objects?\n\n\nIn defense of Kustaanheimo’s approach it must be said that the\nconnections between infinite and finite models are usually far more\ncomplex than one expects. A finite model is not merely a scaled-down\nversion of an infinite model. Very often a different structure\nappears. As an analogy take the (infinite set of) natural numbers.\nTake a finite part, say the numbers 1 up to \\(L\\). In the finite case\nit makes sense to talk about small and large numbers compared to\n\\(L\\). This is classically not possible. So one finds additional\nstructure. Metaphorically speaking, by making things finite, a more\ndetailed or “fine-grained” structure appears, that is\nwiped out in the presence of infinities. Perhaps the distinction\nbetween “good” and “bad” geometrical objects\nis such an additional feature that disappears in the classical\nEuclidean model. Thus perhaps the prime numbers do have a\nsignificance. But still the question remains: is this a new sort of\nPythagoreanism? More details about Kustaanheimo’s approach are\nto be found in the supplementary document:\n Finite Fields as Models for Euclidean Plane Geometry.\n2.3 Constructive approaches\n\nThe originality of Suppes’ approach resides in the fact that he\nproposes to formulate geometry as a practice of constructions,\ncomparable to Hjelmslev’s work yet quite distinct. A\nconstruction is here to be understood in the elementary sense of\nproducing drawings or diagrams, using certain instruments, such as a\nruler and/or a compass, and not in the modern sense in foundational\nterms, i.e., a constructive, axiomatic foundation for geometry.\n\nTwo elements are important from the (strict) finitist perspective.\nFirstly, constructions can be formulated in a quantifier-free way; the\nexpression “draw a line” does not imply that we need to\nspeak about the complete set of lines in a plane. “Draw a\nline” will result in a specific finite object, namely a line\nfragment on, e.g., a piece of paper. Secondly, all models considered\nwill be finite, because no matter what constructions are performed,\nthe starting point will always be a finite set of points.\n\nSuppes considers two basic operations: the operation \\(B\\), that\ncorresponds with bisecting a line \\(ab\\) and the operation \\(D\\), that\ncorresponds with doubling a line \\(ab\\). A step \\(C_{i}\\) in a\nconstruction consists of three elements: the first element is the\n(new) point to be constructed, the second element is a pair of points\nthat are already present, and the third element is either \\(B\\) or\n\\(D\\), according to what operation is selected. The starting position\nconsists of three given points, \\(a, b\\), and \\(c\\).\n\nExample: consider the construction \\(((d, ac, B), (e, bd, D))\\)\nconsisting of two steps. The first step says to start with \\(ac\\) and\nconstruct the mid-point \\(d\\), and in the second step we take the\nsegment \\(bd\\) and double it. A diagrammatic representation makes\nclear what is happening:\n\n\n\nFigure 1\n\n\nStarting from the triple \\(a, b\\), and \\(c\\), we have constructed the\nparallelogram abce.\n\nOf course, merely listing a set of constructions is not sufficient to\ntalk about a geometrical theory, so it has to be shown, as it is\nindeed done by Suppes, that a formal-axiomatic treatment is possible.\nIt suffices to list a set of necessary axioms about the \\(B\\) and\n\\(D\\) operations, so that one can prove that the figure drawn in the\nexample above is indeed a parallelogram. In addition a representation\ntheorem is proven such that points are attributed rational\ncoordinates.\n\nTwo important comments must be made. First, it remains to be shown\nthat this elementary geometrical theory can be expanded all the way\ninto a full-fledged geometrical theory that can be considered a\nplausible alternative to classical geometry. Suppes himself seems\nquite confident as he writes:\n\n\nmy own conviction is that one can go the entire distance, or certainly\nalmost the entire distance, in a purely finitistic way, …\n(2001: 136)\n\n\nSecondly, the focus on constructions opens up a novel way to deal with\nthe problem of the distance function. We do not need a general\ndistance function, but, for each separate case, we have to be able to\nattribute coordinates to the points present in the diagram and nothing\nmore. It remains to be seen however whether the basic operations,\n\\(B\\) and \\(D\\), can be extended without losing this important\nproperty.\n\nA more recent constructive proposal has been formulated by Burke\n(2022). Although quite similar to what Suppes proposed, there is at\nleast one major difference. Burke only talks about points and not\nabout lines (that is, lines are reduced to a finite number of points\nto identify them). The formal language contains both elementary\noperations or constructions and elementary relations. The former deal\nwith: (C1) (directed) segment extension, (C2) crossbar (the\n‘line’ formed by two points \\(a\\) and \\(b\\) on opposite\nsides of a line \\(cd\\) intersects \\(cd\\) in a point), (C3) angle\ntransport, (C4) circle-circle intersection, and (C5) orthogonality.\nThe latter consist of: (R1) the well-known betweenness relation, (R2)\nsegment congruence, (R3) same angle orientation, (R4) angle\ncongruence, and (R5) coplanarity. Burke, like Suppes, also uses a\nquantifier free first-order predicate logic for the same reason. There\nare two additional features to be mentioned. The first one is that\neach construction starts with a finite number of points within a\nfinite area. He then proves that no matter what elementary\nconstruction is performed, at the end the area will at most have\ndoubled in size. The second one is that his approach is easily\nextendible from the plane to 3D-space.\n\nA similar remark can be made here about the possibility of a distance\nfunction in Burke’s approach. In\n section 2.5\n I will address this issue separately and discuss how one can deal\nwith this problem in a finitist setting. First, however, a quite\ndifferent approach from the physical side.\n2.4 A direct physical example: a discrete version of special relativity theory\n\nIn 1936 Silberstein proposes a fairly straightforward discrete theory.\nThe only thing we use in physics are labels, \\(x, y, z, t\\) and, when\ndiscrete, these can always be labelled with integers. In the short\nbooklet that brings together the five lectures on this theme,\nSilberstein restricts himself to one spatial and one time parameter.\nAlthough he acknowledges the problem (1936: 15) of higher dimensions,\nhe does not deal with it. So the distance problem becomes rather\ntrivial since on a line, the discrete distance function and the\nEuclidean distance function coincide. His proposal is elementary in\nthe sense that the smallest distance, viz. the distance between two\nadjacent points \\(x_{i}\\) and \\(x_{i+1}\\) is equal to 1 and likewise\nfor the time coordinate, so that 1 becomes the maximum velocity, put\nequal to \\(c\\), so \\(c = 1\\). Analogs for derivatives are defined,\ndifferential equations are replaced by difference equations, an analog\nin terms of finite differences is derived of the Taylor series and\nmost of classical physics can be imitated. It is worth mentioning that\nthe lectures include a rough calculation of the size of the chronons,\ni.e., the smallest unit of time, and hodons, i.e., the smallest unit\nof (one-dimensional) space. Suppose that \\(a\\) is the number of hodons\nin one centimetre and \\(b\\) the number of chronons in one second, then\n\n\\[ \\frac{(1/a)}{(1/b)} = \\frac{b}{a} = c = 3.10^{10}\\text{cm/s,}\\quad\n\\text{ or }\\quad b = 3.10^{10}\\cdot a.\\]\n If we fix a lower limit for \\(a\\), say \\(10^{-8}\\) cm\n(this is actually Silberstein’s suggestion!), then \\(b =\n3.10^{10}\\cdot a \\geq 3.10^{18}\\), being the number of chronons in one\nsecond. He further applies the discrete spacetime framework to special\nrelativity and here too, an analog is found. Quite interesting in this\napproach is the fact that additional conditions appear that are not\nneeded in the classical case. Here is one illustration.\n\nSpecial relativity theory relies on the expression, here restricted to\none spatial dimension, viz., \\(x^{2} - c^{2}t^{2}\\). Thus any change\nto new coordinates \\(x'\\), \\(t'\\), has to satisfy \\(x^{2} - c^{2}t^{2}\n= x'^{2} - c^{2}t'^{2}\\). Suppose that we write \\(x = ax' + bt'\\) and\n\\(t = cx' + dt'\\), then the inverse relations will be \n\\[x' =\n\\frac{(dx' - bt')}{(ad - bc)} \\quad\\text{ and }\\quad t' = \\frac{(ax' -\nct')}{(ad - bc)}.\\]\n If\nhowever, \\(x\\), \\(x'\\), \\(t\\) and \\(t'\\) all have to be integers, then\nnecessarily \\(ad - bc = 1\\). This last condition is a pure consequence\nof the fact that we are thinking in a discrete way, using\nintegers.\n2.5 Some partial solutions and problems to deal with\n\nIn this section three specific problems will be discussed that need to\nbe solved if any proposal for a discrete geometry is to be taken\nseriously: the distance function problem, the dimension problem, the\nanisotropy problem, and the identification problem.\n\nThe distance function problem. There is a rather devastating\nargument that shows the impossibility of a genuine distance function\nfor a discrete geometry. It dates back to 1949 and was first\nformulated by Hermann Weyl:\n\n\nIf a square is built up of miniature tiles, then there are as many\ntiles along the diagonal as there are along the sides; thus the\ndiagonal should be equal in length to the side. (Weyl 1949: 43)\n\n\nAt least three solutions to this problem have been formulated.\n\nVan Bendegem (1987) argued that in a finite geometry it should be a\nbasic fact that lines and points have extensions. In particular, lines\nare supposed to have a constant width (independent of the orientation\nof the line) \\(N_{D}\\) Thus \\(N_{D}\\) represents a large (finite)\nnumber, corresponding to the number of squares that form \\(N_{D}\\).\nGiven a line, the width is always defined as perpendicular to that\nline. Now suppose that the line has an orientation corresponding to an\nangle \\(\\alpha\\) between the line and the \\(x\\)-axis. Then the width\n\\(N_{D}\\) of that line, when projected on the \\(x\\)-axis will be\n\\(\\left[\\frac{N_{D}}{\\sin \\alpha}\\right]\\) where the expression\n\\([x]\\) indicates the greatest integer less than or equal to \\(x\\).\n\n\n\n\nFigure 2\n\n\nThe distance \\(d\\) between two points \\(p\\) and \\(q\\) is then defined\nas the number of squares in the rectangle formed by the line from\n\\(p\\) to \\(q\\) and the width \\(N_{D}\\), divided by \\(N_{D}\\). The idea\nis that, although in a discrete geometry lines must necessarily have a\nwidth, this is not an essential feature, so it can be divided out.\nHence: \n\\[d(p,q) = N_{L} \\cdot \\left[ \\frac{N_{D}}{\\sin \\alpha}\\right] (\\mathrm{div}\\, N_{D}).\\]\n\n\n\\(N_{L}\\) here corresponds to the number of layers parallel to the\n\\(x\\)-axis between \\(p\\) and \\(q\\) and \\(n (\\mathrm{div}\\, m)\\) is the\nquotient of the division of \\(n\\) by \\(m.\\)\n\nAs an illustration, consider the Weyl problem.\n\n\n\nFigure 3.\n\n\nWe have a right-angled triangle pqr such that for simplicity\nthe right sides \\(pq\\) and \\(qr\\) are equal to one another and are\naligned with the axes of the grid. Suppose that the number of squares\nin the right sides is \\(N_{L}\\). Then \n\\[\n\\begin{align*}\nd(p,q) &= d(q,r) \\\\\n&= N_{L} \\cdot [ N_{D}] (\\mbox{div}\\, N_{D}) \\\\\n&= N_{L},\\\\\n\\end{align*}\n\\]\n\n\nsince, of course, \\([N_{D}]\\) = \\(N_{D}\\). However, the hypotenuse has\nan angle of \\(\\alpha = \\frac{\\sqrt{2}}{2}\\). Thus, \n\\[\n\\begin{align*}\nd(p,r) & = N_{L} \\cdot \\left[ \\frac{N_{D}}{\\sin \\alpha}\\right] (\\mbox{div}\\, N_{D})\\\\\n       & = N_{L}\\cdot [\\sqrt{2} \\cdot N_{D}] (\\mbox{div}\\, N_{D})\\\\\n       & = N_{L}\\cdot   [\\sqrt{2}]_{n},\n\\end{align*}\n  \\]\n\n\nwhere \\([r]_{n}\\) means the number \\(r\\) up to \\(n\\) decimals. No\ncalculations are needed to show that (a close approximation of) the\nPythagorean theorem holds, i.e., \\(d^{2}(p,q) + d^{2}(q,r) =\nd^{2}(p,r)\\). Finally, there is an easy explanation why the Weyl\nproblem occurs: it corresponds to the limiting case \\(N_{D} = 1\\).\nWhen \\(N_{D} = 1\\), then \\([\\sqrt{2} \\cdot N_{D}] = [\\sqrt{2}] = 1\\),\nhence \\(d(p,r) = N_{L} \\cdot 1 = N_{L}\\) and Pythagoras’ theorem\nfails.\n\nAlthough the introduction of a width \\(N_{D}\\) apparently solves the\nproblem, it is equally clear what the drawbacks are. Without classical\nEuclidean geometry in the background, there is really no way to get\nthe construction going. There is no definition of a line in terms of\nthe discrete geometry itself, and, above all, the projected width on\nthe \\(x\\)-axis of a line \\(L\\) is calculated according to a Euclidean\ndistance function that is not explicitly mentioned. In short, there is\na mixture of two distance functions.\n\nPeter Forrest (1995) presents another solution. He starts by\nintroducing a family of discrete spaces \\(E_{n,m}\\), where \\(n\\)\ncorresponds to the “classical” dimension of space and\n\\(m\\) is a scale factor, to be understood as follows: \\(m\\) is a\nparameter to decide when two points are or are not adjacent, which is\nthe basic (and sole) concept of his geometry. Thus in the case \\(n =\n2\\), points are labeled by couples of integers \\((i,j)\\) and two\npoints \\((i, j)\\) and \\((i', j')\\) are adjacent if they are distinct,\nand \\((i-i')^{2} + (j-j') ^{2} \\le m^{2}\\).\n\nOnce adjacency has been stipulated, a distance function can be easily\nderived: the distance between \\(p\\) and \\(q\\), \\(d(p,q)\\), is the\nsmallest number of “links” in a chain of points connecting\n\\(p\\) and \\(q\\) such that each one is adjacent to the previous one.\nNext there is no problem to show that a straight line passing through\ntwo points is that chain of points that has the shortest distance.\n\nIf the parameter \\(m\\) has a small value, then the resulting distance\nfunction is not Euclidean. More specifically, if \\(m = 1\\), then we\nhave, once again, the situation presented by Weyl. But if, say, \\(m =\n10^{30}\\) (the figure proposed by Forrest himself), then the situation\nchanges. Then it is possible to show that the distance function on the\ndiscrete space will approximate the Euclidean distance function as\nclose as one wants. Without presenting all the details, one can show\nthat a Euclidean distance function \\(d_{E}\\) and the discrete distance\nfunction \\(d\\) are related by a scale factor, i.e., \\(d_{E}\n\\frac{(p,q)}{d(p, q)} = \\mbox{constant} (m)\\), where the constant is\ndetermined by the value of \\(m\\). No calculations are needed once\nagain, to show that the original distance function \\(d\\) satisfies the\nPythagorean theorem.\n\nIf one is looking for a weak point in this approach, then inevitably\none must end up with the basic notion of adjacency. What is the reason\nfor defining adjacency in Euclidean terms? For, after all, a condition\nsuch as \\((i-i')^{2} + (j-j')^{2} \\le m^{2}\\) looks as Euclidean as\ncan be. A possible way out is suggested in Van Bendegem (1997). One of\nthe advantages of a discrete approach—and, as a matter of fact,\nthis seems to hold in general for strict finitist proposals—is\nthat definitions that are classically equivalent turn out to be\ndistinct in a strict finitist framework. Thus, more specifically, a\ncircle can be defined in (at least) two ways:\n\nas the set of points \\(p\\) that have a fixed distance to a fixed\npoint,\nas the set of points \\(p\\) such that, given a fixed line segment\n\\(ab\\), the angle formed by \\(apb\\) is a right angle.\n\n\nClassically speaking, these two definitions are equivalent. However,\nthey are not in a discrete geometry. If, e.g., the distance function\nis defined as the lowest number of hodons that connect two given\npoints, then the two definitions are not equivalent. Using definition\n(a), the circle will have the shape of a square (a well-known fact in\nso-called taxicab geometry) and thus useless to define adjacency as\ndone above. Definition (b) on the other hand produces a figure that\ncan approximate a Euclidean circle as close as one likes. In that way\nForrest’s definition for adjacency is acceptable within a\ndiscrete framework, as no reference is made to a Euclidean distance\nfunction.\n\nThe third solution is to be found in Crouse and Skufca (2019), which\npresents an interesting synthesis of the two previous proposals to\nsolve the distance function problem. What they suggest is a kind of\nphysical interpretation that makes three things possible. Firstly, it\nallows to determine the lowest sizes for hodons and chronons in terms\nof Planck length and time. Secondly, it suggests a definition of the\ndistance from A to B in terms of the distance travelled by a\n“test” hodon (in discrete minimal steps, of course). This\nsolves immediately the anisotropy problem as no directions are\nprivileged. Thirdly, it does not suppose the a priori existence\nof a grid (or a similar structure) as an absolute frame of reference.\nThis opens up the possibility to reformulate special relativity\ntheory, which they do. Although Silberstein’s approach (see\n section 2.4\n above) is not mentioned, it is clearly related and can be considered\nto be an improvement, as the physical basis is philosophically better\nmotivated.\n\nIf these proposals and suggestions can be considered to be adequate\nresponses to Weyl’s tile problem, recently another fine example\nof a no-go approach (and accompanying theorem) is to be found in Fritz\n(2013). Start out with an abstract formulation of a periodic graph,\ni.e., a set of vertices and a set of edges. For practical purposes,\nthe periodicity can be thought of as a crystalline structure. This\nmeans that we have a basic finite unit that can cover the whole of the\ngraph through iterated copies of that basic unit. Take as an example a\ntwo-dimensional structure. The vertices can be labeled or\n“weighted” by two numbers \\((i, j)\\). A trajectory\n\\((f_{n})_{n\\in N}\\) is a sequence of weights of vertices, such that\nthe vertices carrying \\(f_{n}\\) and \\(f_{n+1}\\) are connected by an\nedge. Next we define the (macroscopic) velocity of such a trajectory\nas \n\\[\nu= \\lim_{n\\rightarrow\\infty}\\frac{(f_n - f_0)}{n},\n\\]\n\n\nwhich sounds perfectly acceptable. Example: the trajectory such that\n\\(f_{n} = (n, 0)\\), starting from \\(f_{0} = (0, 0)\\) will have\nmacroscopic velocity 1, as \\(f_{n} - f_{0} = (n, 0)\\) and, divided by\n\\(n\\), this leaves (1, 0). Without going into the details, he then\nshows that the geometrical structure of all (macroscopic) velocities\nin such a graph cannot correspond to that of Euclidean space. The\nreason is quite simple (though the proofs are not): in the graph there\nwill always be singled-out, “special” directions and\nanisotropy will remain detectable even at the macroscopic level.\nTherefore a transition from the discrete level to the macroscopic,\ncontinuous, Euclidean and isotropic level is excluded. This is a truly\ninteresting result as it casts a shadow on all attempts to use a\ndirect, often rather naive transition from the discrete to the\ncontinuous level. At the same time, it pleads in favor of more complex\ntransitions from the microscopic to the macroscopic level, e.g., by\ntaking into account the width of a line.\n\nThe dimension problem. Not much attention has been paid to\nthis problem although it is fundamental. If the plane consists of a\ndiscrete set of elements, hodons or atoms, then this set must have\ndimension zero. For, in order to determine the dimension, this set\nmust be equipped with a topology and the only possible candidate is\nthe discrete topology. This entails that the dimension is zero. Either\none takes the option to simply drop the notion of dimension on the\nbasis of the argument that the concept of dimension presupposes a\nconcept of continuity and topology and hence has no finitist meaning.\nOr one searches for an analog, but it is not clear at all what that\ncould be. Something one should not try to do is to derive a notion of\ndimension from an ordering relation. Suppose that the hodons are\nlabeled by integers \\((i, j)\\) in some appropriate coordinate system,\nsuch that \\(-L\\le i\\), \\(j\\le L\\), where \\(L\\) is some upper bound.\nThen quite different ordering relations are possible. One possibility\nis to define \\((i, j) \\lt(k, l)\\) if and only if \\(i + j \\lt k + l\\).\nBut another possibility is to define \\((i, j) \\lt(k, l)\\) if and only\nif either \\(i \\lt k\\) or, if \\(i = k\\), then \\(j \\lt l\\). It therefore\nrequires additional arguments to claim that among all possible order\nrelations on a given set, one and only one has a special status.\nHowever in\n section 3\n we will see that, using the tools of graph theory, a definition of\ndimension can indeed be given.\n\nThe isotropy problem. If the plane is built up from square\nhodons, as in the paragraph above, then the hodons are arranged in\nsuch a way that every hodon touches four other hodons, i.e., the plane\ncan be modeled as a square grid, then it is obvious that there are\npreferred directions, in this case, there will be two preferred\ndirections. However if instead of squares, hexagons are taken as\nhodons, then there are three preferred directions. Thus no matter what\nthe shape is of the hodon, there will be preferred directions and this\nimplies that the space is anisotropic. Note that these cases are\nnothing but special instances of the general approach of Tobias Fritz,\ndiscussed above. However, for physical applications one would like to\nhave isotropy (or at least as close as possible).\n\nTwo approaches are possible, that do not fall under the Fritz no-go\ntheorem. Either the hodons have a definite shape or they do not. In\nthe first case it has been suggested that instead of a regular\nperiodic tiling of the plane, one should look for an irregular\naperiodic tiling, such as the Penrose tiling.\n\n\n\nFigure 4\n\n\nAlthough no worked-out examples are available, it seems a promising\nline of attack. In the case of the Penrose tiling it is interesting to\nsee that there are no classically straight lines anymore, precisely\nbecause of the aperiodicity. In the second case vagueness is a\npossible way out. As Peter Forrest in his (1995), and Crouse and\nSkufca in their (2019) defend, the whole idea of a specific\nrepresentation of a discrete space, e.g., as built up from tiny\nsquares is fundamentally mistaken. If a hodon has a specific form,\nthen one cannot avoid asking questions about parts of a hodon, such as\nits border, but that does not make sense if hodons are the smallest\nspatial entities possible. An intermediate position defended in Van\nBendegem (1997) is to consider a series of discrete geometries\n\\(G_{i}\\), each with a hodon of a particular size, \\(h_{i}\\), such\nthat \\(h_{i}\\ne h_{j}\\), for \\(i\\ne j\\) and, in addition, there are\n\\(M\\) and \\(N\\) such that \\(M \\lt h_{i} \\lt N\\), for all \\(i\\). One\ncan then apply a supervaluation technique to the series. This means\nthat a statement will be True (False) if it is true (false) in every\ngeometry \\(G_{i}\\). In all other cases it is Undecided, i.e., true in\nsome and false in some others. Now if \\(A\\) is the statement\n“hodons have size \\(\\alpha\\)” (where \\(\\alpha\\) is a\nspecific number), this will be Undecided, if a corresponds to at least\none of the \\(h_{i}\\). Such an approach however introduces all problems\nconnected with vagueness into the discussion, which is not necessarily\nan encouraging situation. For this problem too, an original answer can\nbe given from within the framework of graph theory.\n\nThe identification problem. Suppose that we do have a\nfull-fledged discrete geometry and suppose that we replace the\nclassical geometry of a physical theory with the discrete version. We\nwill now be talking about hodons and chronons. The\n“natural” question that arises is what is to be identified\nwith what? Imagine that, in line with Silberstein, we are a bit\nnaïve and would be tempted to identify the hodon with the Planck\nlength, \\(l_{p} = 10^{-35}\\text{m}\\) and the chronon with Planck time,\n\\(t_{p} = 10^{-43}\\text{s}\\). If one now accepts that the maximum\nspeed is one hodon per chronon, then what comes out of this\nidentification is that the maximum speed is indeed \\(c =\n3.10^{8}\\text{m/s}\\). (Note: nothing amazing is happening here, since\nin classical physics, \\(l_{p}\\) is defined as \\(\\sqrt{\\hbar G/c^3},\\)\nand \\(t_{p}\\) as \\(\\sqrt{\\hbar G/c^5},\\) so that it is immediately\nobvious that \\(l_{p}/t_{p} = c\\). Now ask the simple question what the\nnext speed will be, just below \\(c\\)? The answer must be: one hodon\nper two chronons, but that means a velocity of \\(c/2\\). We seem to\nhave missed out the whole range between \\(c/2\\) and \\(c\\). There is a\nway out, but it supposes that “jerky” motion is considered\npossible, an aesthetically quite ugly idea. An object moves two hodons\nin two chronons and then waits for one chronon and then repeats the\nsame motion. The average velocity is then \\(2c/3\\). One possible way\nout, that will be briefly mentioned in\n section 3.2,\n is to introduce an element of randomness into the structure. For an\nappreciation of the full complexity of this topic, going beyond merely\nnumerical relationships, see the excellent overview and discussion of\nHagar (2014).\n3. Discrete geometries as generators of classical geometry\n3.1 The general framework\n\nAs stated in\n section 1,\n here we will discuss proposals that search for a theory or model,\nunderlying a geometrical theory, such that therefrom the classical\ngeometrical concepts can be derived. Obviously one needs to be\nextremely careful as the “danger” is constantly present\nthat infinities enter into the picture somewhere unseen or unnoticed.\nSuppose, to give a simple example, that only a set of finite points is\nallowed for, but also an operation that generates between any pair of\npoints a third point different from all points present and there are\nno restrictions on the number of times the operation can be applied,\nthen clearly we have here an in infinite number of points “in\ndisguise”. To call such a model a discrete geometrical model\nseems quite inappropriate.\n\nOne also needs to be very careful about, e.g., claims that quantum\nmechanics deals with discrete values, usually in relation to\nHeisenberg uncertainty principles, hence physics at the basic level is\na discrete theory. That, however, is extremely misleading. It is\nsufficient to consult any handbook on quantum mechanics to observe\nthat the mathematics used requires the full use of infinities. No\nmatter whether one uses Heisenberg’s matrix approach,\nHilbert’s operator formalism, Schrödinger’s wave\nequation or some other formalism, the mathematics involves integrals,\nderivatives, infinite (convergent) sums, spaces with infinite\ndimension, and so on (see the entry on\n quantum mechanics).\n Not much discreteness to be found here. This implies that for quantum\nmechanics as well it is a genuine problem to find a discrete\ncounterpart. That is clearly demonstrated by the attempts of Gerard\n’t Hooft to reformulate quantum mechanics in a truly discrete\nfashion, see ’t Hooft (2014). Interesting to note is that it\naffects issues such as determinism versus indeterminism.\n\nFrom the historical point of view, no doubt the work of Tullio Regge\ncan be seen as a first attempt to develop a model out of which\ngeometrical concepts could be developed. The original paper dates from\n1961, see Regge (1961). More specifically, we are concerned here with\ngeneral relativity theory (GRT). Although the original intention of\nRegge was to construct techniques for solving the equations of GRT in\nthe “difficult” cases, i.e., where there is no symmetry\npresent and perturbation theory is not applicable. Rather than\ntranscribing the differential equations of GRT into difference\nequations, Regge looked for a technique that leads to different\nequations altogether. Without presenting the full details, the core\nconcept of his approach is the “deficit angle”. In GRT we\nare dealing with curved spaces. Take a two-dimensional curved surface.\nIf it is flat, then it can be covered with triangles. If it is curved,\nit can be approximated with triangles, but with an important\ndifference. Suppose that triangles meet at vertices, then we can look\nat one particular point and all the triangles that meet in that point.\nIf that part of the surface is flattened out, there will be a gap\nsomewhere. To this gap corresponds an angle and that is precisely the\ndeficit angle. The larger the curvature, the larger the deficit angle.\nThe same technique works for the four-dimensional case, where instead\nof triangles, simplexes are used. The beauty of this approach is that\nthe equations of GRT can be rewritten in terms of deficit angles and\nlengths of the edges of the simplexes and solved in terms of these\nconcepts. Misner et al. (1973) contains a chapter (42: “The\nRegge Calculus”) that explains Regge’s approach in a\ncompact and perfectly accessible way.\n\nToday there is a rather impressive amount of attempts being made. Most\nof them are to be considered as highly speculative as they truly\nreflect the present state of affairs in full development. However\nthere is a remaining set of approaches that slowly start to emerge and\nthat seems to be viable candidates and of interest for a finitist view\nof geometry (in terms of spacetime). It should be noted that for the\nauthors concerned their principal aim is not so much to formulate a\ndiscrete form of geometry but rather to establish whether this or that\nmodel will serve as a common foundation to quantum (field) theory and\nGRT, hence to the whole of physics, so to speak or, if one likes, the\n“Theory of Everything”. Our concern here is actually more\nmodest: do these models tell us anything about how discrete geometries\ncan be formulated such that they generate classical geometry? So, even\nif the physicists were to reject such a model on the basis of good\nsolid physical reasons, it might still be of interest to the question\nof the possibility of discrete geometry.\n\nHuggett & Wuthrich (2013a) presents a nice overview of the\nsituation at that time as far as the remaining set is concerned. It is\nworth mentioning that this paper is part of a special issue, Huggett\n& Wuthrich (2013b), on the emergence of spacetime in quantum\ntheories of gravity. Altogether they discuss and evaluate six types of\nproposals but we will consider here only three. The remaining three\nare either too speculative at the present moment or do not involve\ndiscrete spacetimes (such as string theory and non-commutative\ngeometry). The three approaches relevant for our topic are:\n\nLattice spacetime: this is close to Regge’s approach in the\nsense that continuous space (and time) are replaced by a discrete\nstructure, in this case a lattice. If these lattices are equipped with\nsome form of—obviously discrete—metric, the connections\nbetween continuous and discrete space (and time) become very close.\nThe next section presents such a proposal (leaving out the\nphysics),\nNon-metrical lattices: the best known example under this heading\nare causal lattices. The connections between the “points”\nin the lattice are causal relations and this requires a lot more work\nto derive a space-time structure from it. In fact, in many cases we\nhave no-go theorems in the sense that the discrete lattices\n“fail to have well-behaved continuum limits resembling\nrelativistic spacetimes” (p. 278), thus “echoing”\nthe already mentioned negative result of Fritz (2013),\nLoop quantum gravity: this theory is one of the attempts, taken\nseriously, to unify quantum (field) theory and general relativity. The\nbasic structures are so-called three-dimensional spin networks. If\nthese networks are allowed to evolve over time, then a\nfour-dimensional structure emerges, so-called spin foam, that in the\nlimit should generate the relativistic space-time structure. A\ncaveat should be inserted here: although the structure of a\nspin network is that of a graph with a set of nodes and a set of\nedges, nevertheless these nodes and edges are labeled by physically\nmeaningful quantities that involve continuous structures such as Lie\ngroups. Without going into details this short extract of Reisenberger\n(1999) is highly illustrative:\n\n\nIn general the edges of a spin network carry non-trivial irreducible\nrepresentations (irreps) of the gauge group, and the vertices carry\nintertwiners. The intertwiner for a vertex can be any invariant tensor\nof the product representation \\(R\\) formed by the product of the\nirreps carried by the incoming edges and the duals of the irreps on\nthe outgoing edges. (p. 2047)\n\n\n\nIn order to appreciate how quickly things are evolving in this\nresearch area, one should make a comparison between the already\nmentioned Huggett & Wüthrich (2013a) and two other papers,\none earlier and one more recent. The former one is Meschini et al.\n(2005), also meant to be a survey paper. Interestingly enough, Huggett\nand Wüthrich describe their survey as complementary to this one.\nThe latter one is Surya (2019), again a survey paper. The focus here\nis on the causal set approach. Combine this with Smolin (2018), where,\namong other things, quantum loop gravity is discussed, and one must be\nimpressed by the degree of sophistication that has been reached. It is\nimportant to realize that certainly the more fully developed\napproaches involve physics right from the start. Oddly enough, such\napproaches are not studied in the already mentioned literature on\nspatial logics, see\n 1.1 Logicians.\n Nevertheless the connections between the two research topics are very\ndeep and close and definitely need to be explored further.\n\nTo make the above high-level presentation more concrete, the work of\nNowotny & Requardt (1999) is briefly presented. Although a bit\ndated, it is a prototypical example because of how a classical\ngeometry can be built up, starting with a (causal) lattice, before the\nphysics steps in.\n3.2 A prototypical example, using graphs\n\nThe starting point is a discrete graph \\(G = \\langle N, C\\rangle\\)\nconsisting of a set \\(N\\) of nodes, \\(n_{i}\\), and a set \\(C\\) of\nconnections, \\(c_{ij}\\), such that no node is connected to itself and\nnodes \\(n_{i}\\) and \\(n_{j}\\) have one connection at most. What seems\nmost obvious is how to define a distance function and in nearly all\nproposals, this is indeed the strategy followed (similar to the\ndefinitions proposed in\n section 2.5):\n\n\n\\(D(n_{i}, n_{j}\\)) = the smallest number of connections that lead\nfrom \\(n_{i}\\) to \\(n_{j}\\). \n\n\nIt is easy to see that the classical properties of a distance function\nare satisfied:\n\n\\(D(n_i, n_i) = 0,\\)\n\\(D(n_i, n_j) = D(n_j, n_i),\\)\n\\(D(n_i, n_j) + D(n_j, n_k) \\ge D(n_i, n_k).\\)\n\n\nAt first sight it is not obvious at all how one should proceed\nfurther, but, if one reads the \\(n_{i}\\) and the \\(c_{ij}\\) as a kind\nof vector, then linear combinations can be formed, where \\(f_{i}\\) and\n\\(g_{ij}\\) are, e.g., natural or rational numbers: \n\\[\nf=\\sum_i f_i n_i \\quad\\mbox{ and }\\quad g=\\sum_{ik} g_{ik}c_{ik}.\n\\]\n\n\nThese two expressions can be read as functions over \\(n_{i}\\) and\n\\(c_{ij}\\). What one needs now is a relation between nodes and\nconnections, so introduce a special function \\(d\\): \n\\[\nd: n_i \\rightarrow \\sum_k c_{ik}.\n\\]\n\n\nIt is quite interesting to see what happens if we extend the function\n\\(d\\) in a linear way so that it can be applied to arbitrary functions\n\\(f\\): \n\\[\ndf = \\sum_i f_i \\sum_k c_{ik}.\n\\]\n\n\nIf we now stipulate that \\(c_{ik} = -c_{ki}\\) (as a kind of vector\nequation, stating that the connections have a direction) then the\nabove expression can be rewritten as follows (take into account that,\nsince no loops are allowed, \\(c_{ii} = 0)\\): \n\\[\ndf = \\frac{1}{2} \\sum_{ik} (f_k-f_i)c_{ik}\n\\]\n\n\nAlthough it is still a long way off, this expression \\(df\\) already\nhas some nice properties that reminds one of a derivative of a\nfunction \\(f\\):\n\nIt is linear: \\(d(f + g) = df + dg\\),\nIf \\(f\\) is a constant function in the sense that at every node\n\\(f_{i}\\) has the same value, then it is immediate that \\(df\\), for\n\\(f\\) constant, is 0,\nIf \\(f\\) is such that at two directly related nodes \\(n_{i}\\) and\n\\(n_{i+1}\\), \\(f_{i+1}\\) = \\(f_{i} + 1\\), in other words, this\nexpresses that \\(f(i) = i\\), then \\(df\\) is 1, where 1 is the function\nrepresented by \\(\\sum_i n_i\\). So the derivative of the identity\nfunction is the constant function 1.\n\n\nHowever, as is easy to check with the above definitions, the product\nrule fails, i.e., \\(d(f\\cdot g)\\) is not equal to \\(df\\cdot g + f\\cdot\ndg\\).\n\nSo, to a certain extent, it is possible to construct a basic form of\ncalculus on discrete graphs. It does require some ingenuity and\ncreative thought to find the “right” counterparts, but\nthis simple example shows that quite a lot of structure can be derived\nfrom a discrete graph. There is actually more. Discrete graphs allow\nfor a nice solution to the dimension problem, that was mentioned in\n section 2.5.\n This is the rough outline of the idea:\n\nConsider a node \\(n_{i}\\), then \\(U_{1}\\) is the set of nodes\n\\(n_{j}\\) such that \\(D(n_{i}, n_{j}) = 1\\), i.e., \\(U_{1}\\) brings\ntogether the closest neighbours of \\(n_{i}\\). Likewise, we can define\n\\(U_{2}\\) as the set of nodes \\(n_{k}\\) such that \\(D(n_{i}, n_{k})\\)\nis at most 2. It follows that \\(U_{n} \\subseteq U_{n+1}\\) and so we\nobtain a nested series of neighbourhoods of \\(n_{i}\\). If one\nunderstands dimension as a measure of the “growth” of the\nneighbourhoods, then dimension can be defined as: \n\\[\n\\mbox{Dim} = \\lim_{m\\rightarrow \\infty} \\frac{\\ln \\lvert U_m \\rvert}{\\ln m}\n\\]\n\n\nOne of the interesting features of this definition is that it need not\nbe uniform over the whole graph, for all depends on the choice of the\ninitial node \\(n_{i}\\). But in the case where the graph is\nsufficiently uniform, the dimension will be a constant. Furthermore if\nwe take a classical case, such as 3-dimensional Euclidean space, then\nthe dimensions match. Suppose we have a regular lattice as the\nunderlying graph, then a particular node has a cube as the set of\nnearest neighbours \\(U_{1}\\) consisting of \\(3^{3} = 27\\) points, and\na neighbourhood \\(U_{m}\\) will count \\((m+2)^{3}\\) nodes.\nTherefore \n\\[\n\\mbox{Dim} = \\lim_{m\\rightarrow \\infty} \\frac{\\ln (m+2)^3}{\\ln m} \\quad\\mbox{ or }\\quad\n\\mbox{Dim} = \\lim_{m\\rightarrow \\infty}  3\\cdot\\frac{\\ln (m+2)}{\\ln m}\n\\]\n\n\nSince for \\(m\\) sufficiently large, \\(\\frac{\\ln (m+2)}{\\ln m}\\)\napproximates 1, it follows that \\(\\mbox{Dim} = 3\\). What this shows is\nthat, starting from discrete graphs, we have obtained an extension of\nthe concept of dimension. One may have noticed that this type of\ndefinition is quite similar to some of the definitions used to define\nthe dimension of fractal images.\n\nIn addition, discrete graphs make it possible to handle the anisotropy\nproblem as well. It is sufficient to introduce an element of\nrandomness in the network by, e.g., taking averages over a connected\nset of nodes, to avoid any privileged directions. There are clearly\nsimilarities here with the irregular tiling scheme or the introduction\nof vagueness, but the important distinction is that statistical and\nprobabilistic concepts are (fairly) well understood, whereas the\ntiling problem is, as mentioned, an open problem, and vagueness\nremains a notoriously difficult concept to grasp (see the entry on\n vagueness\n in this encyclopedia).\n3.3 A special case: the combinatorial hierarchy\n\nIt would be a mistake to believe that the different attempts listed\nabove, somehow form a complete catalogue that allows to classify all\npossible approaches. In this paragraph such an exotic example, viz.\nthe combinatorial hierarchy, is briefly presented. In this approach\nthe focus is not on the equations of physics themselves, but on the\nphysical constants occurring in them, such as the velocity of light\n\\(c\\), the Planck constant \\(h\\), the mass of the electron \\(m_{e}\\),\nand so on. As these values are necessarily finite, it seems worthwhile\nto investigate whether a finitist approach can explain why these\nconstants have the values they happen to have. Such approaches are\nsometimes referred to as “number games”.\n\nLet me give one very simple example. Starting from a universe\nconsisting of a finite number of bits, i.e., either 0 or 1, a basic\noperation is introduced, viz., to make a “discrimination”.\nTo express this operation, another operation is needed: addition\nmodulo 2: \\(0 + 0 = 1 + 1 = 0\\) and \\(0 + 1 = 1 + 0 = 1\\). If the\noutcome is 0, then the elements of the sum are not distinguished, else\nthey are. Look now at sets that contain 0 and/or 1, and such that, if\ntwo elements are distinguishable, that element belongs to the set as\nwell. There are exactly 3 \\((= 2^{2}-1)\\) such sets: \\(\\{0\\}, \\{1\\}\\)\nand \\(\\{0,1\\}\\). If these 3 elements are now taken as a new basis\ninstead of 0 and 1, a clever construction shows that 7 \\((= 2^{3}-1)\\)\nsuch sets exists and, in a next step, 127 \\((= 2^{7}-1)\\) pops up. Now\n\\(3 + 7 + 127 = 137\\) and that number is close to the electromagnetic\ncoupling constant.\n\nThe success of this program has been rather modest as these models do\nnot connect easily to existing physical theories. A self-contained\npresentation of this program is to be found in Bastin & Kilmister\n(1995). There is a very strong similarity with the work of A.S.\nEddington. Not very surprisingly, a presentation of the work of\nEddington on his fundamental theory has been written by Kilmister\n(1994).\n3.4 Can it be an empirical problem?\n\nSo far we have explored several theoretical possibilities of a\ndiscrete geometry as a counterpart of classical geometry. Given the\nexamples we discussed in the preceding sections, the relevance for\nphysics seems obvious. Although one might be tempted to believe that\nthe discreteness of space and/or time is a purely theoretical matter,\nnevertheless it is an intriguing question whether the matter could\nalso be of an empirical nature. More concretely, is it imaginable that\nsomehow we could design an experiment such that the outcome is either\nthat space is discrete or that space is continuous? This might sound\nreally far-fetched, but nevertheless the matter has drawn the\nattention of philosophers and a specific experiment has indeed been\nproposed, though at present the circumstances to execute the\nexperiment are unfortunately not feasible.\n\nIt is quite interesting to see that already in 1961 Paul Feyerabend\nsuggested such a possibility. However not much more is said, as\n\n\nthe difficulty of the present situation seems to lie in the fact that\ndiscrete alternatives for the mathematics, which at the present moment\nis being used in physics, are missing. (1961: 160)\n\n\nEqually interesting is the fact that Feyerabend too mentions the\nstandard argument that the lack of a Pythagorean theorem is a genuine\nproblem. His proposal is that\n\n\nwe need only assume that measurements in different directions do not\ncommute; and then perhaps we can retain the theorem as an operator\nequation. (1961: 161)\n\n\nHere too, unfortunately, nothing more is said. Peter Forrest (1995)\nmaintains that such an experiment is possible. The fundamental reason\nis that classical mathematics uses continuous variables whereas strict\nfinitist mathematics uses discrete variables. Thus for differentation\nand integration finite analogs must be found and they will approximate\nthe classical case, but never coincide with it. Hence, there will\nalways be small differences and it cannot be excluded that these could\nbe detectable.\n\nOne such possibility for detection concerns the following curious\nphenomenon. Take the differential equation, \\(df/dx = ax(1 - x)\\). It\nis a straightforward exercise to solve it and one will find a very\nneat continuous solution, whereas if one takes for the discrete case\nthe corresponding difference equation, \\(\\Delta f/\\Delta x = ax(1 -\nx)\\), depending on the value of the parameter \\(a\\), the behaviour of\nthe function \\(f\\) produces chaotic effects, which are absent in the\ncontinuous case. See Van Bendegem (2000) and Welti (1987:\n516–518). The outcome of such an experiment would not be as\nclear-cut as wished for, but to observe chaotic effects means that\nspace is discrete, whereas to observe no chaotic effects means that\neither space is continuous or the hodons are far smaller than we\nimagined. After a long period of silence, there is a new development\nto report. Oppenheim et al. (2023) claim that we should investigate\nanew the possibility that space-time in general relativity theory need\nnot be quantized in order to obtain a unification with quantum (field)\ntheory. Postquantum theory of classical gravity, as they call it,\ntakes continuous space-time as a starting point. A question that\narises is how to devise crucial experiments. Such experiments need not\ninvolve space-time itself in a direct way, but, if a choice can be\nmade, it will at the same time be a choice for a discrete or a\ncontinuous space-time..\n\nIt has been indicated several times in this lemma that different\nscientists with different intentions and aims and with different\nbackgrounds have proposed or propose equally different ideas about\ndiscrete geometry as an alternative for classical geometry. Many\nauthors do not necessarily present more or less complete theories, but\nrather limit themselves to making suggestions and exploring some\nparticular idea. These papers are to be seen as sources of inspiration\nin the search for a full-fledged theory. A few examples are: Hahn\n(1934), Biser (1941), Coish (1959), Ahmavaara (1965a,b), Finkelstein\n(1969) (this is the first of a five paper series with the same title\nin the same journal), Dadić & Pisk (1979), Finkelstein &\nRodriguez (1986), Meessen (1989), Buot (1989), to name but a very few.\nFor the period 1925–1936, Kragh and Carazza (1994) is an\nexcellent overview showing that many physicists were playing around\nwith finitist ideas.\n4. What needs to be done next?\n\nThe first task to do seems rather straightforward: take any of the\nproposals presented here and elaborate them into a full-fledged\ngeometry. Then it will be possible to make a comparison with, e.g.,\nHilbert’s axiomatisation that was mentioned. The second task\nseems rather forbidding: using this discrete geometry, show how to do\nphysics. In general terms, this is indeed a huge undertaking, but\nthere are two possible routes to follow. The first route is to show\nthat this approach works, say, for classical mechanics. If successful,\nthis would surely count as a major argument in favor of discrete\nproposals. As it happens, some very important work has already been\ndone, for what we will need, is a fully formalized version of\nclassical mechanics, not the textbook versions that leave many things\nunmentioned, but that might prove to be crucial for the underlying\ngeometry. Such versions exist at the present moment, see, e.g., Ax\n(1978), Andréka et al. (2008), Benda (2008), Ardourel (2012)\nfor just a few examples. As it happens, one of the earliest versions\ninvolves Patrick Suppes, see McKinsey, Sugar & Suppes (1953). Thus\nthe enterprise seems to be a genuine possibility. The second route is\nto keep exploring the fundamental research going on in the search for\na unification of QFT and GRT. Up to some years ago this was all highly\nspeculative, today a few serious contestants are emerging and worth\nfollowing up. That being said, both on the mathematical as on the\nphysical level an enormous amount of work remains to be done. Probably\nthe best way to characterize the present-day situation is that some\n“famous” objections to a discrete or finitist approach in\ngeometry have been (partially) answered and that a host of\nmathematical, physical and philosophical suggestions and ideas have\nbeen presented, and partial models have been developed or are being\nelaborated. In other words, the conditions are satisfied that make it\ninteresting to continue this research program.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Ahmavaara, Yrjo, 1965a, “The Structure of Space and the\nFormalism of Relativistic Quantum Field Theory I.”, <em>Journal\nof Mathematical Physics</em>, 6(1): 87–93.",
                "–––, 1965b, “The Structure of Space and\nthe Formalism of Relativistic Quantum Field Theory II.”,\n<em>Journal of Mathematical Physics</em>, 6(2): 220–227.",
                "Aiello, M., I. Pratt-Hartmann &amp; J. van Benthem (eds.), 2007,\n<em>Handbook of Spatial Logics</em>, New York: Springer.",
                "Amelino-Camelia G., 2013, “Quantum Spacetime\nPhenomenology”, <em>Living Reviews in Relativity</em>, 16(5),\nfirst online 12 June 2013. doi:10.12942/lrr-2013-5",
                "Andréka, H., J.X Madarász, I. Németi, &amp;\nG. Seékely, 2008, “Axiomatizing Relativistic Dynamics\nWithout Conservation Postulates”, <em>Studia Logica</em>, 89(2):\n163–186.",
                "Ardourel V., 2012, “La physique dans la recherche en\nmathématiques constructives.”, <em>Philosophia\nScientiae</em>, 16(1): 183–208.",
                "Ax, J., 1978, “The elementary foundations of\nspacetime”, <em>Foundations of Physics</em>, 8:\n507–546.",
                "Bastin, T. &amp; C.W. Kilmister, 1995, <em>Combinatorial\nPhysics</em>, Singapore: World Scientific.",
                "Benda, T., 2008, “A formal construction of the spacetime\nmanifold”, <em>Journal of Philosophical Logic</em>, 37(5):\n441–478.",
                "Biser, E., 1941, “Discrete Real Space”, <em>Journal of\nPhilosophy</em>, 38(Summer): 518–524",
                "Borwein, J. &amp; K. Devlin, 2009, <em>The Computer as Crucible.\nAn Introduction to Experimental Mathematics</em>, Wellesley: A K\nPeters.",
                "Bridges, D. &amp; F. Richman, 1987, <em>Varieties of Constructive\nMathematics</em>, Cambridge: Cambridge University Press (LMS Lecture\nNotes Series 97).",
                "Buot, F.A., 1989, “Discrete Phase-Space Model for Quantum\nMechanics”, in M. Kafatos (ed.), <em>Bell”s Theorem,\nQuantum Theory and Conceptions of the Universe</em>, Dordrecht:\nKluwer, pp. 159–162.",
                "Burke, J.R., 2022, “A Strict Finite Foundation for Geometric\nConstructions”, <em>Axiomathes</em>, 32(Supplement 2):\n499–527.",
                "Carroll, S.M., 2023, “Completely Discretized, Finite Quantum\nMechanics.”, <em>Foundations of Physics</em>, 53(90), first\nonline 06 November 2023. doi:10.1007/s10701-023-00726-6",
                "Chou S.C., X.S. Gao, &amp; J.Z. Zhang, 1994, <em>Machine Proofs in\nGeometry</em>, Singapore: World Scientific.",
                "Coish, H.R., 1959, “Elementary particles in a finite world\ngeometry”, <em>Physical Review</em>, 114: 383–388.",
                "Crouse, D. &amp; J. Skufca, 2019, “Relativistic Time\nDilation and Length Contraction in Discrete Space-Time using a\nModified Distance Formula”, <em>Logique et Analyse</em>,\n62(246): 177–223.",
                "Dadić, I. &amp; K. Pisk, 1979, “Dynamics of\nDiscrete-Space Structure”, <em>International Journal of\nTheoretical Physics</em>, 18(5): 345–358.",
                "Danielsson, N., 2002, <em>Axiomatic Discrete Geometry</em>,\nLondon: Imperial College. (Thesis submitted for MSc Degree in Advanced\nComputing).",
                "Feyerabend, P., 1961, “Comments on Grünbaum’s\n‘Law and Convention in Physical Theory’”, in H.\nFeigl &amp; G. Maxwell (eds.), <em>Current Issues in the Philosophy of\nScience</em>, New York: Holt, Rinehart and Winston, pp.\n155–161.",
                "Finkelstein, D., 1969, “Space-time code”, <em>Physical\nReview</em>, 184: 1261–1279.",
                "Finkelstein, D. &amp; Rodriguez, E., 1986, “Quantum\ntime-space and gravity”, in R. Penrose &amp; C.J. Isham (eds.),\n<em>Quantum Concepts in Space and Time</em>, Oxford: Oxford University\nPress, pp. 247–254.",
                "Forrest, P., 1995, “Is Space-Time Discrete or\nContinuous?—An Empirical Question”, <em>Synthese</em>,\n103: 327–354.",
                "Franklin, J., 2017, “Discrete and Continuous: A Fundamental\nDichotomy in Mathematics”. <em>Journal of Humanistic\nMathematics</em>, 7(2): 355–378.",
                "Fritz, T., 2013, “Velocity polytopes of periodic graphs and\na no-go theorem for digital physics”, <em>Discrete\nMathematics</em> 313: 1289–1301.",
                "Galton, A., 1999, “The Mereotopology of Discrete\nSpace.”, in C. Freksa, &amp; D.M. Mark (eds.), <em>Spatial\nInformation Theory. Cognitive and Computational Foundations of\nGeographic Information Science. COSIT 1999</em> (Lecture Notes in\nComputer Science: Volume 1661), Berlin: Springer,\npp. 251–266.",
                "Hagar, A., 2014, <em>Discrete or Continuous? The Quest for\nFundamental Length in Modern Physics</em>, Cambridge: Cambridge\nUniversity Press.",
                "Hahn, H., 1980 [1934], “Does the infinite exist?”, in\nB. Mcguinness (ed.), <em>Hans Hahn: Empiricism, Logic, and\nMathematics</em>, Dordrecht: Reidel, pp. 103–131 (originally\npublished in 1934).",
                "Hjelmslev, J.T., 1923, <em>Die Natürliche Geometrie</em>,\nHamburg: Gremmer &amp; Kröger (facsimile edition: hardpress.net,\n2008).",
                "Huggett, N. &amp; C. Wuthrich, 2013a, “Emergent spacetime\nand empirical (in)coherence”, <em>Studies in History and\nPhilosophy of Science Part B: Studies in History and Philosophy of\nModern Physics</em>, 44(3): 276–285.",
                "––– (eds.), 2013b, “Special issue: The\nemergence of spacetime in quantum theories of gravity”,\n<em>Studies in History and Philosophy of Science Part B: Studies in\nHistory and Philosophy of Modern Physics</em>, 44(3):\n273–364.",
                "Järnefelt, G., 1951, “Reflections on a Finite\nApproximation to Euclidean Geometry: Physical and Astronomical\nProspects”, <em>Annales Academiae Scientiarum Fennicae, Series\nA, I. Mathematica-Physica</em>, 96: 1–43.",
                "Kilmister, C.W., 1994, <em>Eddington’s Search for a\nFundamental Theory: A Key to the Universe</em>, Cambridge: Cambridge\nUniversity Press.",
                "Kragh, H. &amp; B. Carazza, 1994, “From Time Atoms to\nSpace-Time Quantization: the Idea of Discrete Time, ca\n1925–1936”, <em>Studies in the History and the Philosophy\nof Science</em>, 25(3): 437–462.",
                "Kulpa, Z., 1979, “On the Properties of Discrete Circles,\nRings, and Disks”, <em>Computer Graphics and Image\nProcessing</em>, 10: 348–365.",
                "Kustaanheimo, P., 1951, “A Note on a Finite Approximation of\nthe Euclidean Plane Geometry”, <em>Societas Scientiarum Fennica.\nCommentationes Physico-Mathematicae</em>, 15/19: 1–11.",
                "Lyons, B. C., 2017, “The Applicability of the Planck Length\nto Zeno, Kalam, and Creation Ex Nihilo”, <em>Philosophia\nChristi</em>, 19(1): 171–180.",
                "McKinsey, J.C.C., A.C. Sugar, &amp; P. Suppes, 1953,\n“Axiomatic Foundations of Classical Particle Mechanics”,\n<em>Journal of Rational Mechanics and Analysis</em>, 2(2):\n253–272.",
                "Meessen, A., 1989, “Is it logically possible to generalize\nphysics through space-time quantization?” in P. Weingartner\n&amp; G. Schurz (eds.), <em>Philosophie der Naturwissenschaften. Akten\ndes 13. Internationalen Wittgensteins Symposium</em>, Vienna:\nHölder-Pichler-Tempsky, pp. 19–47.",
                "Meschini, D., M. Lehto, &amp; J. Philonen, 2005, “Geometry,\npregeometry, and beyond”, <em>Studies in History and Philosophy\nof Modern Physics</em>, 36(3) 435–464.",
                "Misner, C.W., K.S. Thorne, &amp; J.A. Wheeler, 1973,\n<em>Gravitation</em>, San Francisco: W.H. Freeman.",
                "Moore, A.W., 1993, <em>Infinity</em>, Aldershot: Dartmouth.",
                "Naibo A., 2015, “Constructibility and geometry”, in\nG. Lolli, M. Panza &amp; G. Venturi (eds.), <em>From Logic to\nPractice: Italian Studies in the Philosophy of Mathematics</em>, Cham:\nSpringer, pp.  123–161.",
                "Nowotny, T. &amp; M. Requardt, 1999, “Pregeometric concepts\non graphs and cellular networks as possible models of space-time at\nthe Planck-scale”, <em>Chaos, Solitons &amp; Fractals</em>,\n10(2–3): 469–481.",
                "Oppenheim, J., C. Sparaciari, B. Soda &amp; W.-D. Zachary, 2023,\n“Gravitationally induced decoherence vs space-time diffusion:\ntesting the quantum nature of gravity.”, <em>Nature\nCommunications</em>, 14: 9710.",
                "Regge, T., 1961, “General relativity without\ncoordinates”, <em>Nuovo Cimento</em>, 19: 558–571.",
                "Reisenberger M.P., 1999, “On relativistic spin network\nvertices”, <em>Journal of Mathematical Physics</em>, 40(4):\n2046–2054.",
                "Reisler, D. L. &amp; N. M. Smith, 1969, <em>Geometry Over a Finite\nField</em>, Fort Belvoir, VA: Defense Technical Information Center.\n<a href=\"https://apps.dtic.mil/dtic/tr/fulltext/u2/714115.pdf\" target=\"other\">Reiser &amp; Smith 1969 available online</a>]",
                "Rovelli, C., 2016, <em>Reality is not What It Seems. The Journey\nto Quantum Gravity</em>, New York: Penguin. (Translated by Simon\nCarnell and Erica Segre, original published in 2014).",
                "Schmidtke, H.D., 2016, “Granular Mereogeometry”, in R.\nFerrario &amp; W. Kuhn (eds.), <em>Formal Ontology in Information\nSystems</em>, Amsterdam: IOS Press, pp. 81–94.",
                "Sewell, K., 2022, <em>Forever Finite. The Case Against\nInfinity</em>, Alexandria, VA: Rond Books.",
                "Silberstein, L., 1936, <em>Discrete Spacetime. A Course of Five\nLectures delivered in the McLennan Laboratory</em>, Toronto:\nUniversity of Toronto Press.",
                "Simpson, Stephen G. (ed.), 2005, <em>Reverse Mathematics 2001:\nLecture Notes in Logic 21</em>, Association for Symbolic Logic.",
                "Smolin, L., 2018, “What Are We Missing in Our Search for\nQuantum Gravity?”, in J. Kouneiher (ed.), <em>Foundations of\nMathematics and Physics One Century After Hilbert</em>, New York:\nSpringer, pp. 287–304.",
                "Smyth, M.B. &amp; J. Webster, 2007, “Discrete spatial\nmodels”, in Aiello, Pratt-Hartmann &amp; van Benthem 2007:\n713–798.",
                "Sorabji, R., 1983, <em>Time, Creation &amp; the Continuum</em>,\nLondon: Duckworth.",
                "Stillwell, J., 2016, <em>Elements of Mathematics. From Euclid to\nGödel</em>, Princeton: Princeton University Press.",
                "Suppes, P., 2001, “Finitism in geometry”,\n<em>Erkenntnis</em>, 54: 133–144.",
                "Surya, S., 2019, “The causal set approach to quantum\ngravity.”, <em>Living Reviews in Relativity</em>, 22(5),\nfirst online 27 September 2019. doi:10.1007/s41114-019-0023-1",
                "’t Hooft, G., 2014, “Relating the Quantum Mechanics of\nDiscrete Systems to Standard Canonical Quantum Mechanics”,\n<em>Foundations of Physics</em>, 44: 406–425.",
                "Van Bendegem, J.P., 1987, “Zeno’s Paradoxes and the\nWeyl Tile Argument”, <em>Philosophy of Science</em>, 54(2):\n295–302.",
                "–––, 1997, “In defence of discrete space\nand time”, <em>Logique et Analyse</em>, 38(150–152):\n127–150.",
                "–––, 2000, “How to tell the continuous\nfrom the discrete”, in François Beets &amp; Eric Gillet\n(eds.), <em>Logique en Perspective. Mélanges offerts à\nPaul Gochet.</em> Brussels: Ousia, pp. 501–511.",
                "Welti, E., 1987, <em>Die Philosophie des strikten Finitismus.\nEntwicklungstheoretische und mathematische Untersuchungen über\nUnendlichkeitsbegriffe in Ideengeschichte und heutiger\nMathematik</em>, Bern: Peter Lang.",
                "Weyl, H., 1949, <em>Philosophy of Mathematics and Natural\nSciences</em>, Princeton: Princeton University Press.",
                "White, M.J., 1992, <em>The Continuous and the Discrete. Ancient\nPhysical Theories from a Contemporary Perspective</em>, Oxford:\nClarendon Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Ahmavaara, Yrjo, 1965a, “The Structure of Space and the\nFormalism of Relativistic Quantum Field Theory I.”, <em>Journal\nof Mathematical Physics</em>, 6(1): 87–93.</li>\n<li>–––, 1965b, “The Structure of Space and\nthe Formalism of Relativistic Quantum Field Theory II.”,\n<em>Journal of Mathematical Physics</em>, 6(2): 220–227.</li>\n<li>Aiello, M., I. Pratt-Hartmann &amp; J. van Benthem (eds.), 2007,\n<em>Handbook of Spatial Logics</em>, New York: Springer.</li>\n<li>Amelino-Camelia G., 2013, “Quantum Spacetime\nPhenomenology”, <em>Living Reviews in Relativity</em>, 16(5),\nfirst online 12 June 2013. doi:10.12942/lrr-2013-5</li>\n<li>Andréka, H., J.X Madarász, I. Németi, &amp;\nG. Seékely, 2008, “Axiomatizing Relativistic Dynamics\nWithout Conservation Postulates”, <em>Studia Logica</em>, 89(2):\n163–186.</li>\n<li>Ardourel V., 2012, “La physique dans la recherche en\nmathématiques constructives.”, <em>Philosophia\nScientiae</em>, 16(1): 183–208.</li>\n<li>Ax, J., 1978, “The elementary foundations of\nspacetime”, <em>Foundations of Physics</em>, 8:\n507–546.</li>\n<li>Bastin, T. &amp; C.W. Kilmister, 1995, <em>Combinatorial\nPhysics</em>, Singapore: World Scientific.</li>\n<li>Benda, T., 2008, “A formal construction of the spacetime\nmanifold”, <em>Journal of Philosophical Logic</em>, 37(5):\n441–478.</li>\n<li>Biser, E., 1941, “Discrete Real Space”, <em>Journal of\nPhilosophy</em>, 38(Summer): 518–524</li>\n<li>Borwein, J. &amp; K. Devlin, 2009, <em>The Computer as Crucible.\nAn Introduction to Experimental Mathematics</em>, Wellesley: A K\nPeters.</li>\n<li>Bridges, D. &amp; F. Richman, 1987, <em>Varieties of Constructive\nMathematics</em>, Cambridge: Cambridge University Press (LMS Lecture\nNotes Series 97).</li>\n<li>Buot, F.A., 1989, “Discrete Phase-Space Model for Quantum\nMechanics”, in M. Kafatos (ed.), <em>Bell”s Theorem,\nQuantum Theory and Conceptions of the Universe</em>, Dordrecht:\nKluwer, pp. 159–162.</li>\n<li>Burke, J.R., 2022, “A Strict Finite Foundation for Geometric\nConstructions”, <em>Axiomathes</em>, 32(Supplement 2):\n499–527.</li>\n<li>Carroll, S.M., 2023, “Completely Discretized, Finite Quantum\nMechanics.”, <em>Foundations of Physics</em>, 53(90), first\nonline 06 November 2023. doi:10.1007/s10701-023-00726-6</li>\n<li>Chou S.C., X.S. Gao, &amp; J.Z. Zhang, 1994, <em>Machine Proofs in\nGeometry</em>, Singapore: World Scientific.</li>\n<li>Coish, H.R., 1959, “Elementary particles in a finite world\ngeometry”, <em>Physical Review</em>, 114: 383–388.</li>\n<li>Crouse, D. &amp; J. Skufca, 2019, “Relativistic Time\nDilation and Length Contraction in Discrete Space-Time using a\nModified Distance Formula”, <em>Logique et Analyse</em>,\n62(246): 177–223.</li>\n<li>Dadić, I. &amp; K. Pisk, 1979, “Dynamics of\nDiscrete-Space Structure”, <em>International Journal of\nTheoretical Physics</em>, 18(5): 345–358.</li>\n<li>Danielsson, N., 2002, <em>Axiomatic Discrete Geometry</em>,\nLondon: Imperial College. (Thesis submitted for MSc Degree in Advanced\nComputing).</li>\n<li>Feyerabend, P., 1961, “Comments on Grünbaum’s\n‘Law and Convention in Physical Theory’”, in H.\nFeigl &amp; G. Maxwell (eds.), <em>Current Issues in the Philosophy of\nScience</em>, New York: Holt, Rinehart and Winston, pp.\n155–161.</li>\n<li>Finkelstein, D., 1969, “Space-time code”, <em>Physical\nReview</em>, 184: 1261–1279.</li>\n<li>Finkelstein, D. &amp; Rodriguez, E., 1986, “Quantum\ntime-space and gravity”, in R. Penrose &amp; C.J. Isham (eds.),\n<em>Quantum Concepts in Space and Time</em>, Oxford: Oxford University\nPress, pp. 247–254.</li>\n<li>Forrest, P., 1995, “Is Space-Time Discrete or\nContinuous?—An Empirical Question”, <em>Synthese</em>,\n103: 327–354.</li>\n<li>Franklin, J., 2017, “Discrete and Continuous: A Fundamental\nDichotomy in Mathematics”. <em>Journal of Humanistic\nMathematics</em>, 7(2): 355–378.</li>\n<li>Fritz, T., 2013, “Velocity polytopes of periodic graphs and\na no-go theorem for digital physics”, <em>Discrete\nMathematics</em> 313: 1289–1301.</li>\n<li>Galton, A., 1999, “The Mereotopology of Discrete\nSpace.”, in C. Freksa, &amp; D.M. Mark (eds.), <em>Spatial\nInformation Theory. Cognitive and Computational Foundations of\nGeographic Information Science. COSIT 1999</em> (Lecture Notes in\nComputer Science: Volume 1661), Berlin: Springer,\npp. 251–266.</li>\n<li>Hagar, A., 2014, <em>Discrete or Continuous? The Quest for\nFundamental Length in Modern Physics</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Hahn, H., 1980 [1934], “Does the infinite exist?”, in\nB. Mcguinness (ed.), <em>Hans Hahn: Empiricism, Logic, and\nMathematics</em>, Dordrecht: Reidel, pp. 103–131 (originally\npublished in 1934).</li>\n<li>Hjelmslev, J.T., 1923, <em>Die Natürliche Geometrie</em>,\nHamburg: Gremmer &amp; Kröger (facsimile edition: hardpress.net,\n2008).</li>\n<li>Huggett, N. &amp; C. Wuthrich, 2013a, “Emergent spacetime\nand empirical (in)coherence”, <em>Studies in History and\nPhilosophy of Science Part B: Studies in History and Philosophy of\nModern Physics</em>, 44(3): 276–285.</li>\n<li>––– (eds.), 2013b, “Special issue: The\nemergence of spacetime in quantum theories of gravity”,\n<em>Studies in History and Philosophy of Science Part B: Studies in\nHistory and Philosophy of Modern Physics</em>, 44(3):\n273–364.</li>\n<li>Järnefelt, G., 1951, “Reflections on a Finite\nApproximation to Euclidean Geometry: Physical and Astronomical\nProspects”, <em>Annales Academiae Scientiarum Fennicae, Series\nA, I. Mathematica-Physica</em>, 96: 1–43.</li>\n<li>Kilmister, C.W., 1994, <em>Eddington’s Search for a\nFundamental Theory: A Key to the Universe</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Kragh, H. &amp; B. Carazza, 1994, “From Time Atoms to\nSpace-Time Quantization: the Idea of Discrete Time, ca\n1925–1936”, <em>Studies in the History and the Philosophy\nof Science</em>, 25(3): 437–462.</li>\n<li>Kulpa, Z., 1979, “On the Properties of Discrete Circles,\nRings, and Disks”, <em>Computer Graphics and Image\nProcessing</em>, 10: 348–365.</li>\n<li>Kustaanheimo, P., 1951, “A Note on a Finite Approximation of\nthe Euclidean Plane Geometry”, <em>Societas Scientiarum Fennica.\nCommentationes Physico-Mathematicae</em>, 15/19: 1–11.</li>\n<li>Lyons, B. C., 2017, “The Applicability of the Planck Length\nto Zeno, Kalam, and Creation Ex Nihilo”, <em>Philosophia\nChristi</em>, 19(1): 171–180.</li>\n<li>McKinsey, J.C.C., A.C. Sugar, &amp; P. Suppes, 1953,\n“Axiomatic Foundations of Classical Particle Mechanics”,\n<em>Journal of Rational Mechanics and Analysis</em>, 2(2):\n253–272.</li>\n<li>Meessen, A., 1989, “Is it logically possible to generalize\nphysics through space-time quantization?” in P. Weingartner\n&amp; G. Schurz (eds.), <em>Philosophie der Naturwissenschaften. Akten\ndes 13. Internationalen Wittgensteins Symposium</em>, Vienna:\nHölder-Pichler-Tempsky, pp. 19–47.</li>\n<li>Meschini, D., M. Lehto, &amp; J. Philonen, 2005, “Geometry,\npregeometry, and beyond”, <em>Studies in History and Philosophy\nof Modern Physics</em>, 36(3) 435–464.</li>\n<li>Misner, C.W., K.S. Thorne, &amp; J.A. Wheeler, 1973,\n<em>Gravitation</em>, San Francisco: W.H. Freeman.</li>\n<li>Moore, A.W., 1993, <em>Infinity</em>, Aldershot: Dartmouth.</li>\n<li>Naibo A., 2015, “Constructibility and geometry”, in\nG. Lolli, M. Panza &amp; G. Venturi (eds.), <em>From Logic to\nPractice: Italian Studies in the Philosophy of Mathematics</em>, Cham:\nSpringer, pp.  123–161.</li>\n<li>Nowotny, T. &amp; M. Requardt, 1999, “Pregeometric concepts\non graphs and cellular networks as possible models of space-time at\nthe Planck-scale”, <em>Chaos, Solitons &amp; Fractals</em>,\n10(2–3): 469–481.</li>\n<li>Oppenheim, J., C. Sparaciari, B. Soda &amp; W.-D. Zachary, 2023,\n“Gravitationally induced decoherence vs space-time diffusion:\ntesting the quantum nature of gravity.”, <em>Nature\nCommunications</em>, 14: 9710.</li>\n<li>Regge, T., 1961, “General relativity without\ncoordinates”, <em>Nuovo Cimento</em>, 19: 558–571.</li>\n<li>Reisenberger M.P., 1999, “On relativistic spin network\nvertices”, <em>Journal of Mathematical Physics</em>, 40(4):\n2046–2054.</li>\n<li>Reisler, D. L. &amp; N. M. Smith, 1969, <em>Geometry Over a Finite\nField</em>, Fort Belvoir, VA: Defense Technical Information Center.\n<a href=\"https://apps.dtic.mil/dtic/tr/fulltext/u2/714115.pdf\" target=\"other\">Reiser &amp; Smith 1969 available online</a>]</li>\n<li>Rovelli, C., 2016, <em>Reality is not What It Seems. The Journey\nto Quantum Gravity</em>, New York: Penguin. (Translated by Simon\nCarnell and Erica Segre, original published in 2014).</li>\n<li>Schmidtke, H.D., 2016, “Granular Mereogeometry”, in R.\nFerrario &amp; W. Kuhn (eds.), <em>Formal Ontology in Information\nSystems</em>, Amsterdam: IOS Press, pp. 81–94.</li>\n<li>Sewell, K., 2022, <em>Forever Finite. The Case Against\nInfinity</em>, Alexandria, VA: Rond Books.</li>\n<li>Silberstein, L., 1936, <em>Discrete Spacetime. A Course of Five\nLectures delivered in the McLennan Laboratory</em>, Toronto:\nUniversity of Toronto Press.</li>\n<li>Simpson, Stephen G. (ed.), 2005, <em>Reverse Mathematics 2001:\nLecture Notes in Logic 21</em>, Association for Symbolic Logic.</li>\n<li>Smolin, L., 2018, “What Are We Missing in Our Search for\nQuantum Gravity?”, in J. Kouneiher (ed.), <em>Foundations of\nMathematics and Physics One Century After Hilbert</em>, New York:\nSpringer, pp. 287–304.</li>\n<li>Smyth, M.B. &amp; J. Webster, 2007, “Discrete spatial\nmodels”, in Aiello, Pratt-Hartmann &amp; van Benthem 2007:\n713–798.</li>\n<li>Sorabji, R., 1983, <em>Time, Creation &amp; the Continuum</em>,\nLondon: Duckworth.</li>\n<li>Stillwell, J., 2016, <em>Elements of Mathematics. From Euclid to\nGödel</em>, Princeton: Princeton University Press.</li>\n<li>Suppes, P., 2001, “Finitism in geometry”,\n<em>Erkenntnis</em>, 54: 133–144.</li>\n<li>Surya, S., 2019, “The causal set approach to quantum\ngravity.”, <em>Living Reviews in Relativity</em>, 22(5),\nfirst online 27 September 2019. doi:10.1007/s41114-019-0023-1</li>\n<li>’t Hooft, G., 2014, “Relating the Quantum Mechanics of\nDiscrete Systems to Standard Canonical Quantum Mechanics”,\n<em>Foundations of Physics</em>, 44: 406–425.</li>\n<li>Van Bendegem, J.P., 1987, “Zeno’s Paradoxes and the\nWeyl Tile Argument”, <em>Philosophy of Science</em>, 54(2):\n295–302.</li>\n<li>–––, 1997, “In defence of discrete space\nand time”, <em>Logique et Analyse</em>, 38(150–152):\n127–150.</li>\n<li>–––, 2000, “How to tell the continuous\nfrom the discrete”, in François Beets &amp; Eric Gillet\n(eds.), <em>Logique en Perspective. Mélanges offerts à\nPaul Gochet.</em> Brussels: Ousia, pp. 501–511.</li>\n<li>Welti, E., 1987, <em>Die Philosophie des strikten Finitismus.\nEntwicklungstheoretische und mathematische Untersuchungen über\nUnendlichkeitsbegriffe in Ideengeschichte und heutiger\nMathematik</em>, Bern: Peter Lang.</li>\n<li>Weyl, H., 1949, <em>Philosophy of Mathematics and Natural\nSciences</em>, Princeton: Princeton University Press.</li>\n<li>White, M.J., 1992, <em>The Continuous and the Discrete. Ancient\nPhysical Theories from a Contemporary Perspective</em>, Oxford:\nClarendon Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "geometry: in the 19th century",
            "logic: temporal",
            "mathematics: constructive",
            "quantum mechanics",
            "quantum theory: quantum field theory",
            "quantum theory: quantum gravity",
            "reasoning: automated",
            "space and time: supertasks",
            "vagueness",
            "Zeno of Elea: Zeno’s paradoxes"
        ],
        "entry_link": [
            {
                "../geometry-19th/": "geometry: in the 19th century"
            },
            {
                "../logic-temporal/": "logic: temporal"
            },
            {
                "../mathematics-constructive/": "mathematics: constructive"
            },
            {
                "../qm/": "quantum mechanics"
            },
            {
                "../quantum-field-theory/": "quantum theory: quantum field theory"
            },
            {
                "../quantum-gravity/": "quantum theory: quantum gravity"
            },
            {
                "../reasoning-automated/": "reasoning: automated"
            },
            {
                "../spacetime-supertasks/": "space and time: supertasks"
            },
            {
                "../vagueness/": "vagueness"
            },
            {
                "../paradox-zeno/": "Zeno of Elea: Zeno’s paradoxes"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=geometry-finitism\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/geometry-finitism/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=geometry-finitism&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/geometry-finitism/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=geometry-finitism": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/geometry-finitism/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=geometry-finitism&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/geometry-finitism/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Van Bendegem, J. P., 2020,\n “<a href=\"http://jeanpaulvanbendegem.be/home/wp-content/uploads/2023/12/annotated-bibliography-of-strict-finitism-december-2023.pdf\" target=\"other\">Annotated Bibliography of Strict Finitism</a>”,\n a regularly updated bibliography in progress."
        ],
        "listed_links": [
            {
                "http://jeanpaulvanbendegem.be/home/wp-content/uploads/2023/12/annotated-bibliography-of-strict-finitism-december-2023.pdf": "Annotated Bibliography of Strict Finitism"
            }
        ]
    }
}