{
    "url": "grotius",
    "title": "Hugo Grotius",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Jon Miller\n<jon.miller@queensu.ca>",
        "author_links": [
            {
                "http://post.queensu.ca/~miller": "Jon Miller"
            },
            {
                "mailto:jon%2emiller%40queensu%2eca": "jon.miller@queensu.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://post.queensu.ca/~miller\" target=\"other\">Jon Miller</a>\n&lt;<a href=\"mailto:jon%2emiller%40queensu%2eca\"><em>jon<abbr title=\" dot \">.</abbr>miller<abbr title=\" at \">@</abbr>queensu<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Dec 16, 2005",
        "substantive revision Fri Jan 8, 2021"
    ],
    "preamble": "\n\nHugo Grotius (1583–1645) [Hugo, Huigh or Hugeianus de Groot] was\na towering figure in philosophy, political theory, law and associated\nfields during the seventeenth century and for hundreds of years\nafterwards. His work ranged over a wide array of topics, though he is\nbest known to philosophers today for his contributions to the natural\nlaw theories of normativity which emerged in the later medieval and\nearly modern periods. This article will attempt to explain his views\non the law of nature and related issues while simultaneously providing\nsome broader assessment of his place in the history of ideas.\n",
    "toc": [
        {
            "#LifeWork": "1. Life and Works"
        },
        {
            "#Life": "1.1 Life"
        },
        {
            "#Work": "1.2 Works"
        },
        {
            "#Meth": "2. Method"
        },
        {
            "#NatuLaw": "3. Natural Law"
        },
        {
            "#PoliPhil": "4. Political Philosophy"
        },
        {
            "#JustWarDoct": "5. Just War Doctrine"
        },
        {
            "#OrigInfl": "6. Originality and Influence"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimTextTran": "Primary Texts and Translations"
        },
        {
            "#SeleSecoLite": "Select Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Works\n1.1 Life\n\nPrison escapee, high-stakes politician, shipwreck survivor, Grotius\nwas a remarkable man who led a remarkable life. Born on 10 April 1583\nin Delft, Holland—Easter Sunday, as his biographers invariably\nnote—his family was moderately prosperous, well-educated and\nambitious. From these nourishing if not particularly distinguished\norigins, Grotius soon proved himself exceptional. When he was eight,\nhe began writing skillful elegies in Latin; by eleven, he was a\nstudent in the Faculty of Letters at the University of Leiden. In\n1598, at the tender age of fifteen, he accompanied the leading Dutch\npolitician of the day, Johan van Oldenbarnevelt, on an embassy to the\nroyal court of France. There King Henry IV, impressed by his\nextraordinary learnedness, hailed him as “the miracle of\nHolland”. And three years later, when the United Provinces\ndecided to reinforce their autonomy from Spain by retaining an\nofficial Latin historiographer to chronicle their history, they chose\nGrotius over Dominicus Baudius, a full professor of rhetoric at\nLeiden, for the position.\n\nIn the small world of Dutch high society, Grotius had clearly been\nidentified as a young man going places. While in France, he had earned\n(or possibly just bought) a law degree from the University of\nOrléans. After returning to The Hague, he established a law\npractice and within a short time, his clientele included\nOldenbarnevelt, the Dutch East India Company (V.O.C.) and Prince\nMaurice of Nassau. Apparently he impressed Maurice, for when the\nposition of Attorney General of Holland, Zeeland and West Friesland\nbecame available in 1607, the Prince chose him over two other older\nand more experienced candidates. Grotius didn’t particularly\nenjoy the practice of law—in letters he voiced complaints\nfamiliar to today’s lawyers, bemoaning the tedium of the work\nand obstreperous clients—so he closed his firm upon being made\nAttorney General. Perhaps capitalizing on his new position and the\nhealthy salary it paid, he soon married the redoubtable Maria van\nReigersbergen, with whom he would eventually have three daughters and\nfour sons.\n\nAfter several years as Attorney General, Grotius was appointed\nPensionary (roughly equivalent to Governor of an American state) of\nRotterdam in 1613. That same year, he was called to put theory into\npractice when a dispute arose between the English and the Dutch over\nthe freedom of the seas. The details are interesting but complicated:\nin essence, on the basis of the claim that two Dutch vessels were\ntrespassing on seas owned by England near Greenland, a small British\nfleet seized the contents of the Dutch ships. Grotius led a delegation\nto England in protest of the English actions. While history may have\nfavored Grotius—his view that the seas are open to all would\neventually come to be international law—real politick made\nvictory impossible for him at the time. The English were more powerful\nthan the Dutch, and they neither returned the cargo nor conceded the\nlegal point.\n\n1613 may have carried some excitement but the end of the decade was\none of the true zeniths (or nadirs, depending on one’s\nperspective) of Grotius’ life. A dispute between orthodox\nCalvinists and reformers over arcane theological matters which no\nlonger seem important to us quickly assumed enormous political\nsignificance. Grotius, Oldenbarnevelt and other supporters of\nreligious tolerance were aligned on the side with the reformers or\n“Remonstrants”; Maurice, the Calvinist establishment and\nother so-called “Contra-Remonstrants” were on the other.\nOn 29 August 1618, Maurice and his allies staged a coup, overthrowing\nthe States General (of which Grotius was a member by virtue of his\nposition as Pensionary of Rotterdam) and imprisoning him along with\nOldenbarnevelt and Rombout Hoogerbeets, the Pensionary of Leiden.\nConsolidating his grip on power, Maurice soon moved to eliminate the\nRemonstrants and their supporters in government; as part of this\nputsch, Oldenbarnevelt was executed and Grotius and Hoogerbeets were\nsentenced to life imprisonment. It would be overly dramatic to say\nGrotius languished there: he was allowed to correspond with outsiders;\nmoreover, he had books and writing materials, and indeed he composed\nmuch important work during this time. But the cold and damp cell was\nfar from pleasant and there was the looming danger that the\nauthorities would revisit his case and impose an even harsher\npunishment. So in March 1621, Grotius and his wife Maria decided\nenough was enough. Placing himself in a large trunk that Maria had\nshipped to him, Grotius escaped prison by having the trunk carried out\non the pretense that it contained a number of books. He fled to\nAntwerp and thence to Paris, where his family eventually joined\nhim.\n\nNow began a more stable and productive period. The French authorities\nwelcomed Grotius by awarding him an annual pension which, while not\nalways paid, at least gave the promise of security. He began\ncomposition of De iure belli ac pacis (On the law of war\nand peace), which was published by a Parisian press in 1625. It\nquickly made Grotius famous: for example, in a letter to Grotius,\nVossius says that Descartes told him that he had recently met the\nDutchman (in reply, Grotius wrote that he didn’t remember\nmeeting Descartes, an indication of their relative stature at the\ntime). Perhaps encouraged by the reception of his work, Grotius tried\nreturning to the Netherlands in 1631. Initially, he may have had\nreason to be optimistic: after practicing law for a little while in\nAmsterdam, he was offered the Governor Generalship of the V.O.C. in\nAsia. Soon enough, however, the authorities moved against him, placing\na large price on his head and forcing him in April 1632 to flee his\nhome country. Grotius would never set foot there again.\n\nThis time, he went to Hamburg, Germany. Nearby Sweden (one of the\nsuperpowers of the day) had numerous connections to the city, which\nmade it quite natural for Swedish authorities to notice the presence\nand availability for hire of such a luminary. Moving to take advantage\nof the situation, they made him their Ambassador to France in 1634.\nGrotius began his diplomatic duties in Paris the following year. It is\nhard to gauge his success as ambassador: while he did help to\nnegotiate a treaty which led to the end of the Thirty Years’\nWar, he could also be outmaneuvered in the diplomatic game—at\none point, his bumbling forced the Swedish Chancellor Axel Oxenstierna\nto come to Paris and sort things out. Still, such stories\nnotwithstanding, it is true that he lasted ten years in one of the\nhighest and most demanding diplomatic postings of his day.\n\nDuring this time, Grotius returned to the theological issues which had\nearlier caused him such grief. The project of Christian\nunity—harmonizing both the various Protestant factions and the\nProtestants with the Catholics—became increasingly important to\nhim. Both intellectually and practically, it was a task which suited\nhim and his place in life: intellectually, because Christian unity\nraised many conceptual puzzles which challenged his mind; practically,\nbecause as ambassador for one of the great European powers, he could\nuse his position to press the cause. Of course, the cause was doomed\nto failure—certainly, it was well beyond Grotius’\nabilities. Yet, it did lead him to write some extremely interesting\nand influential works, many of which were collected in his Opera\nOmnia Theologica.\n\nAfter Queen Christina ascended to the throne in 1644, she\nsystematically began to undermine her rival Oxenstierna and—as\npart of this infighting—recalled Grotius from his\nambassadorship. She didn’t fire him; instead, she instructed him\nto come to Stockholm and assume a different position. At first,\nGrotius didn’t want to go, but bowing to the force of royal\nprerogative (not to mention economic necessity), he set sail for\nStockholm in March 1645. It was a fateful decision: traveling\nconditions on the Baltic in late winters can be harsh; his ship\nwrecked and Grotius barely escaped with his life. After spending a few\nmonths in Sweden, he decided to return to Germany and so undertook\nanother voyage. Again, conditions were poor; it took eight long days\nto cross the relatively narrow stretch of water. This time, it was too\nmuch: weakened by recent events, Grotius died on 28 August 1645, in\nRostock, Germany. While they are probably apocryphal, his supposed\nlast words—“By attempting many things, I have accomplished\nnothing”—do evoke the span of his life’s work and\nhis personal assessment of the results.\n1.2 Works\n\nGiven that he led such an active public life while also raising a\nlarge family, the sheer quantity of Grotius’ works is nothing\nshort of astonishing. Typical, for him, was the time of his embassy to\nFrance early in his life. The same year as the embassy, he published\nPontifex Romanus, a collection of six essays on recent\npolitical events. While working on this, he produced what are in\nessence critical editions of two works: the Phaenomena, an\nastronomical work of the third century BCE by Aratus of Soli, and\nMartianus Capella’s handbook of the seven liberal arts. He also\nbegan research on a history of the Netherlands, research would which\nmuch later would result in the Annales et Historiae de Rebus\nBelgicis. And he did all this while still in his late teens. Over\nthe full course of his life, Grotius would write or edit some\nfive-dozen book-length works and innumerable smaller pieces.\n\nTo philosophers and the philosophically-minded, two of these stand\nout: De iure praedae commentarius (Commentary on the law\nof prize and booty, henceforth referred to as\n“DIP”) and De iure belli ac pacis\n(“DIB”). The former was almost lost. Placed in a\ntrunk sometime during or after his life, the sole manuscript copy was\nuncovered when some of his descendants sold a collection of his papers\nin 1864 (for an account of these events, see Knight 1925: Chap. 5 and\nvan Ittersum 2006). It was apparently commissioned by the V.O.C.\naround 1603. In it, Grotius was to defend the capture of a large\nPortuguese merchant ship by a V.O.C. fleet in the area around\nmodern-day Singapore. The key legal and conceptual question was\nwhether any private agent (such as the V.O.C.) could legitimately\nemploy force against another private agent which was impeding its\nactions (see Tuck 1993: 170). But it also had an important\npropagandistic objective, which was to defame the Portuguese (and\nSpanish) while extolling the V.O.C. and Dutch (for more on the general\nhistorical context of the DIP, see van Ittersum 2002). Modern\nphilosophical readers will find the “Prolegomena” of\nChapter Two especially interesting, since that is where Grotius lays\nout his views on the nature and bases of rights. While Grotius chose\nnot to publish this or most of the manuscript, he did see Chapter\nTwelve into press. Given the title Mare Liberum (On the\nfreedom of the seas), it was both influential and controversial:\namong others, the Englishman John Selden published a critical\nreply.\n\nWhatever the merits of the DIP, it is on the DIB\nthat the bulk of Grotius’ reputation rests. It consists of an\nintroduction and three books, totaling more than 900 pages in\ntranslation. As with DIP, the introduction or\n“Prolegomena” holds the greatest interest for\nphilosophers, for it is here that Grotius articulates and defends the\nphilosophical foundations of the DIB. While philosophers are\nnaturally attracted to the “Prolegomena”, the body of the\nDIB is also redolent with themes of philosophical interest.\nBook One defines the concept of war, argues for the legitimacy of war,\nand identifies who may legitimately wage war. Book Two deals with the\ncauses of war, the origins of property, the transfer of rights and\nmore, while Book Three is dedicated primarily to the rightful conduct\nof belligerents in war. After the initial publication in 1625, Grotius\nushered several more editions to press during his life, each time\nadding more references without substantially changing the arguments.\n(A word of explanation about citations to the DIB they\ncommonly take the form of book, chapter, section and—where\napplicable—paragraph; so, “I.1.10.1” means\n“Book One, Chapter One, Section Ten, Paragraph One”.)\n2. Method\n\nThe first reaction of many readers is to the very style of\nGrotius’ prose. So before getting to his ideas and arguments, a\nfew words should be said his method, both in the DIP and the\nDIB. There are of course differences between the two works.\nHowever, the connection between them is ably described by\nStraumann:\n\n\nAlthough De iure belli ac pacis was written under\nfundamentally different circumstances from De iure praedae,\nits main teachings... can be understood as an elaborated version of\nthe earlier work. (2015: 212)\n\n\nSo we can take the crucial aspects of the two works, which includes\ntheir methods, to be at minimum consistent and at maximum merely\ndifferent expressions of the same basic underlying set of\nconvictions.\n\nNow, as we think about the method employed in the two works, we find\nseveral distinct issues. First and most obviously, there is the\nquestion of what we should make of the voluminous references to\nancient, medieval and early modern works which can be found in the\nmargins of both books. Some have taken a rather dim view of them; in a\nscornful passage of Émile, Rousseau wrote:\n\n\nTrue political theory [le droit politique] is yet to appear,\nand it is to be presumed that it never will. Grotius, the master of\nall the savants in this subject, is but a child; and, what is worse, a\ndishonest child [enfant de mauvaise foi]. When I hear Grotius\npraised to the skies and Hobbes covered with execration I see how far\nsensible men read or understand these two authors. The truth is that\ntheir principles are exactly the same: they only differ in their\nexpression. They also differ in their method. Hobbes relies on\nsophisms, and Grotius on the poets; all the rest is the same.\n(Rousseau 1762: Bk 4 [1915: vol. II, 147])\n\n\nIt would be absurd to deny that Grotius does rely “on the\npoets”—after all, he said in the “Prolegomena”\nto the DIB that “the testimony of philosophers,\nhistorians, poets, finally also of orators” will be used to\n“prove the existence of this law of nature” (§40).\nArguments from authority carried great weight for him: the more\nilluminati one could cite, the better for one’s\nargument. Philosophers today may not be impressed by such arguments,\nthough they can be instructive to historians of philosophy. By\nstudying Grotius’ use of texts, one can learn how they were\ninterpreted in the early modern period—and this can unlock one\nof the many barriers to understanding that time.\n\nBut is there more to his citations of these texts than just a perhaps\noverly respectful attitude toward authority? Most scholars think there\nis, though they are divided on what it might be. One possibility is\nthat they reflect Grotius’ commitment to the idea of\nphilosophia perennis. Like Leibniz a few decades later,\nGrotius thought there were elements of truth in virtually all great\nthinkers. He writes,\n\n\nI quote them as witnesses whose conspiring testimony, proceeding from\ninnumerable different times and places, must be referred to some\nuniversal cause. (DIB Prol. §40)\n\n\nHis job as heir to ideas of the great dead is to combine or synthesize\nthem into a single unified theory. And doing that requires him to draw\non them as frequently as possible.\n\nAnother suggestion sees Grotius as deeply concerned to refute\nscepticism about international law. Grotius was upset when the\npowerful French Cardinal Richelieu told him, “the weakest are\nalways wrong in matters of state”. How is it that he can\nconvince doubters such as Richelieu of the existence and force of a\nset of norms governing the conduct of governments both domestically\nand internationally? The argument will never be easily won but the\nburden may be lightened by sharing the load. If Grotius can show that\nso many people throughout history have accepted what the sceptic\ndenies, then perhaps the force of numbers may change the\nsceptic’s mind.\n\nQuite apart from the questions posed by the marginalia, an entirely\ndifferent aspect of Grotius’ method concerns his refusal to\ndivide ethics, politics and law into separate subjects. These days,\ncompartmentalization is the norm; ordinarily, we study one of these\nsubjects while paying scant attention to the others. Now, it is true\nthat Grotius does often identify ways in which legal norms differ from\nmoral or political ones (see, e.g., the discussion of laws at the\nbeginning of DIB I.1). At the same time, he does not think\nthat law, politics and ethics are entirely distinct domains. If one\nreads Grotius with the expectation that he will keep them apart, one\nwill likely be befuddled by the way he ignores distinctions which are\nimportant to us. It may help to know that he does this because he is\ninterested in picking out the fundamental principles which lie at the\nbasis of all normativity, not just a portion thereof. He\ncannot talk just about ethics, say, because his views on ethics are\ninformed by his views on politics and the law. A fundamental tenet of\nhis thought is that moral, political and legal norms are all based on\nlaws derived from or supplied by nature.\n\nThe issues here are complex and much discussed. For more, see Dufour\n(1980), Tanaka (1993), Vermeulen (1983) and Whewell (1853).\n3. Natural Law\n\nNatural law is multiply ambiguous. It can be descriptive, in that it\nis sometimes supposed to describe a certain set of facts which obtain\nbecause of some natural features. At the same time, it can also be\nprescriptive, in that it is sometimes supposed to prescribe certain\nforms of behavior as acceptable and proscribe others as unacceptable.\nOn another level, its scope or range of application is unfixed. Some\nnatural law theories pertain to political entities (typically states\nand relations among states); others, to civil laws; yet others, to\nmoral agents. On still another level, the ambiguities can be seen as\nstemming from the very notions of “natural” and\n“law”. “Natural” can refer to human nature, or\nto the nature of the universe in general, or both. One’s sense\nof the validity and force of a natural law theory will vary enormously\ndepending on which reference is employed. “Law” was\nsimilarly contested. One extreme interpreted it literally, so that a\nnatural law is a rule implemented by some agent (typically God) which\ncompels obedience on pain of some penalty. The other extreme took\n“law” completely metaphorically, picking out some standard\nor norm perceivable in natural phenomena which governs behavior\nthrough entirely impersonal means.\n\nSuch variation should not be surprising, for the natural law tradition\nwas long and robust. Though there were ties to the ancient world, it\nbegan in earnest with Aquinas, since he was the first to formulate a\ngroup of ideas systematic enough to be called a theory. The tradition\ncontinued through the middle ages and into the early modern era before\n(allegedly) meeting its demise in Kant. Given that natural law was\nthe dominant paradigm in ethics, politics and law for\nhundreds of years—much longer than the period from Kant to\nus—it is entirely predictable that theorists would have pushed\nthat paradigm in so many directions. It may be that there is some\nessence shared by all natural law theories; for example, one recent\ncommentator has suggested that the\n\n\nstable core in [the natural law tradition] is the idea that morals is\nprimarily a matter of norms or prescriptions and only derivatively\nabout virtues and values. (Haakonssen 1992: 884)\n\n\nBut those who study natural law in the period of its flourishing will\nbe impressed by the almost unlimited possibilities of\ninterpretation.\n\nThough this is not an article on the natural law, these points are\nnecessary preliminaries for considering Grotius’ natural law\nviews. If Grotius is at all known to philosophers today, it is for\nbeing “the father of natural law” (as put by, e.g.,\nVreeland 1917). At this juncture, we need not assess the validity of\nthis claim (for more on Grotius’ originality, see\n Section 6\n below). Instead, we ought to understand Grotius’ actual views\non the laws of nature. To understand his views, four issues need to be\nexamined: first, the source of the laws; second, their nature or\ncontent; third, their force or obligatory status; finally, their\nscope.\n\nWhy are there natural laws? Do they exist in virtue of the nature of\nthings or for some other reason? These are the questions lurking\nbehind the issue of source. Grotius changed his mind on how they\nshould be answered. In the DIP he declares that\n\n\nWhat God has shown to be His Will, that is law. This axiom points\ndirectly to the cause of law, and is rightly laid down as the primary\nprinciple. (Chap. II)\n\n\nHere Grotius announces a thesis about the relation between normativity\nand the divine being which is commonly known as\n“voluntarist”: by an act of volition, God determines the\nfull and exact content of all normative categories—justice,\ngoodness and so forth. Voluntarism was a well-established tradition of\nnatural law theories; the DIP belongs firmly in that\ntradition. In later works, however, Grotius departs from it. For\nexample, in the De summa potestatum, he declares that\nnormativity of any kind\n\n\narises from the nature of the action itself, so that it is right\nper se to worship God and it is right per se not to\nlie. (Opera Omnia Theologica vol. III, p. 187)\n\n\nA much more famous expression of non-voluntarism appears in the\n“Prolegomena” to the DIB. In the first few\nsections of the “Prolegomena”, Grotius lays the groundwork\nfor his natural law theory. Then, in section eleven, he writes\nthat\n\n\nWhat we have been saying would have a degree of validity even if we\nshould concede [etiamsi daremus] that which cannot be\nconceded without the utmost wickedness, that there is no God, or that\nthe affairs of men are of no concern to him.\n\n\nInstead of emerging from or being otherwise dependent on God, the\nfundamental principles of ethics, politics and law obtain in virtue of\nnature. As he says, “the mother of right—that is, of\nnatural law—is human nature” (Prol. §16). Somewhat\nlater, he clarifies why it is that human nature produces the natural\nlaw:\n\n\nThe law of nature is a dictate of right reason, which points out that\nan act, according as it is or is not in conformity with rational\nnature, has in it a quality of moral baseness or moral necessity; and\nthat, in consequence, such an act is either forbidden or enjoined.\n(I.1.10.1)\n\n\nIf an action agrees with the rational and social aspects of human\nnature, it is permissible; if it doesn’t, it is impermissible\n(cf. I.1.12.1). That is to say, the source of the natural law is the\n(in)compatibility of actions with our essences as rational and social\nbeings. For discussion of the etiamsi daremus passage, see\nSt. Leger (1962) and Todescan (2003).\n\nSuppose we have established where the laws come from. This will reveal\nnothing about the second of our four issues: viz., the content of the\nlaws or what they actually say. Grotius’ views on how we should\nlearn about this were quite consistent: throughout his corpus, he\ncontinued to maintain that (as he put it in the DIP),\n\n\nThe Will of God is revealed, not only through oracles and portents,\nbut above all in the very design of the Creator; for it is from this\nlast source that the law of nature is derived. (Chap. II)\n\n\nAs he put it in the DIB, the law of nature “proceeds\nfrom the essential traits implanted in man” (Prol. §12).\nWhere some other natural law theories solved the problem of knowledge\nthrough recourse to the supernatural, Grotius did not. For him, a\nstudy of nature itself—and more specifically, a study of human\nnature—can suffice to teach us the essentials of ethics,\npolitics and law.\n\nAnd what, exactly, does such a study reveal about those fundamental\nnormative principles? The reasoning in both the DIP and\nDIB may be reconstructed as follows. Human nature is\nconstituted by two essential properties: the desire for\nself-preservation and the need for society (see DIP, Chap. 2,\nand DIB, Prol. §§6–7). These two properties\ntemper and inform each other: the desire for self-preservation is\nlimited by the social impulse, so that humans do not naturally seek to\nmaintain and enhance their being at all costs; conversely, the need\nfor the company of other humans is limited by the self-preservation\ndrive, for individuals must naturally strive to secure the means for\ntheir well-being. Moreover, the self-preservation drive and the\nsociability impulse are both emotive and cognitive; they are both\nnon-rational and rational, having the force of unreflective instinct\nas well as well-thought-out plans. Because we are essentially both\nsocial and self-preserving beings, it follows that two things are\nimperative for our successful existence. We ought to abstain from what\nbelongs to other persons, and we ought to engage in the reasonable\npursuit of what genuinely serves our interest. Accordingly, Grotius\nmakes these the first two elements of natural law in the DIB\n(see Prol. §§8, 10); they form the core of the first four\n“laws” in the DIP (see Chap. II). While these\nprinciples enjoy lexical priority in the hierarchy of natural norms,\nthey do not exhaust the list. A study of nature also teaches us that\n“Evil deeds must be corrected” and “Good deeds must\nbe recompensed” (Laws V–VI of the DIP). In fact,\nGrotius derives a list of some 22 fundamental natural tenets in the\nDIP and a similarly large group (though not numbered in the\nsame way) in the DIB. Any explanation of Grotius’\nnatural law theory should begin by citing these first-order tenets or\nprinciples, for they are what constitute its substance. Recent\nscholarship has sought to shed light on the foregoing issues by\nexamining how Grotius may have been inspired by Stoicism, both ancient\nand early modern. See in particular Brooke (2012: Chapter 2) and\nStraumann (2015).\n\nReturning to conceptual matters, we should ask why the laws of nature\nare operative on us. Why do they enjoin or prohibit us from performing\ncertain specific actions? Here we come to our third issue, concerning\nthe laws’ force or obligatory status. Traditionally, natural law\ntheorists tended to invoke God for their solution to this very deep\nmystery. Aquinas, for example, argued that obligation is the result of\nan action of will by a superior on an inferior (see, e.g., Summa\nTheologica II.ii.q104). We are obliged to follow civil laws\nbecause our political superiors have forced us to do so through\nactions of their more powerful wills. And we are obliged to follow\nnatural laws because God has forced us to do so through his infinitely\nmore powerful will. Grotius was tempted by this view; he writes in\nDIB that morally necessary acts must be “understood as\nnecessarily commanded or forbidden by God” (I.1.10.2).\n\nAs any parent knows, however, “because I said so” is not\nthe most compelling reason for action. That is true even when the\nperson speaking is God. Hence thinkers have long sought to articulate\nother grounds for obligation. In Grotius’ time, for example,\nSuarez wrote,\n\n\nto break the natural law without sinning involves an\ninconsistency… and therefore the existence of an obligation\nwhich is imposed by the natural law but which is not a matter of\nconscience also involves an inconsistency. (De legibus,\nII.IX.6)\n\n\nHere we find a very different account of the basis of obligation: we\nare obliged to perform or avoid certain actions which are incompatible\nwith our consciences, because we will be guilty of inconsistency if we\ndon’t. To put it in slightly different terms, we are obliged to\nperform or avoid certain actions which are compatible or incompatible\nwith our natures as rational beings, because we will be less than\nhuman if we don’t. Grotius adopts this idea for himself,\nmodifying it in keeping with his rich conception of human nature: for\nhim, natural law obliges us to perform actions which conduce to our\nrationality, sociability and need for self-preservation. This thought\nunderlies several of his specific laws of nature—such as, for\ninstance, the law that evil deeds must be corrected. Grotius places\nthis obligation under the heading of compensatory justice\n(DIP, Chap. Two). The “task of compensatory\njustice” is “restitution”: using the example of\ntheft, Grotius explains that “such justice requires that the\nthing taken shall be returned” (ibid.). Evil deeds have\ndisturbed the moral and legal equilibrium of society; they have\nunjustly benefited some while unjustly harming others. Since it is\nimperative to maintain healthy social relations, it is imperative that\nevil deeds be punished.\n\nThe problem of explaining why we should obey the laws of\nnature—or indeed, why we should obey any set of norms—is\none of the most enduring in philosophy; it would be rash to suppose\nthat a solution can be found in Grotius. One inadequacy of his account\nis inspired by Richelieu: while Grotius tries to separate and equalize\nour rational, social and self-interested motives for action, one may\nquestion whether they are in fact distinct and equal. If it can be\nshown that one is more fundamental than the others—that, say,\nself-interest is our first and most basic reason for action—then\nour reason for obeying the laws of nature and being moral will be very\ndifferent from what Grotius argued. (For additional discussion, see\nKorsgaard 1996: 7, 21–22 and 28–30.)\n\nMoving on, we come to the last of our four issues—i.e., scope.\nIn Grotius’ day, this issue was made urgent by European\nencounters with indigenous peoples in the Americas and elsewhere (for\ndiscussion, see Tierney 1997: Chapter XI). Some theorists tried to\nplace epistemic or doxastic restrictions on the scope of the laws,\narguing that they enjoined and protected only those who held certain\nbeliefs. Since the beliefs which determined the applicability of the\nlaws were usually religious in nature, it was commonly argued that\nnatural laws were pertinent only to Christians and did not cover\nnon-Christians. Given that natural laws form the basis for morality,\nthen since they do not cover non-Christians, it follows that\nChristians were under no obligations to treat non-Christians morally.\nLike many others, Grotius strongly disagreed with such arguments. For\nhim, natural laws apply to all rational and social beings as such. It\ndoesn’t matter what they think or believe; if they are rational\nand social, they are bound by the law of nature (see, e.g.,\nDIB II.20.44).\n4. Political Philosophy\n\nAs the previous section stressed, Grotius’ natural law theory\nwas about much more than politics; it offered an account of\nnormativity of all kinds. At the same time as he was concerned to\nexplicate normativity generally speaking, the evidence unambiguously\nsuggests that he was especially interested in political issues. After\nall, he did lead a very political life and his two greatest works are\neminently political. In this section, a few of his political ideas are\ndiscussed.\n\nLet’s start with one closely connected to the problem of\nobligation. Just now, it was said that the ground of obligation lay in\nour natures as rational, social, self-preserving beings. This is\ncorrect but it needs amplification. Grotius did not conceive of our\nessences as static; instead, they are dynamic, expressive of our\nabilities and activities. This is emphatically reflected in his\nconception of rights (ius, or iura in the plural).\nHe distinguishes between several meanings of iura, the most\nimportant of which conceives of a ius as “a moral\nquality of a person, making it possible to have or to do something\ncorrectly” (DIB I.1.4). For Grotius, a ius or\nright is a capacity or power possessed by the agent; it is a\n“faculty” or an “aptitude” of the person\n(ibid.). To have a ius is to have the ability to engage in\ncertain specified actions without moral or legal sanction. So, for\nexample, when he endows humans with the right to self-preservation, he\ngrants us the power to pursue our own interests without needing the\npermission or assistance of the state or any other authority. Because\nrights are centered on the individual subject, one will often read\nthat Grotius propounded a theory of “subjective right”\n(see, e.g., Kingsbury & Roberts 1990: 31 and references\nthere).\n\nThe import of Grotius’ theory of rights can be clarified\ncontrasting it with the dominant medieval conception of iura.\nThis conception stems primarily from Aquinas, who held that “the\nword ius was first of all used to denote the just thing\nitself” (Summa Theologica II.ii.q57.art1). In its\noriginal usage, ius was applied to things—actions,\nentities, situations—and not persons. As Aquinas and his\nfollowers conceived of it, things earn the appellation\n“right” when they align fully with the natural law. For\ntwo reasons, then, the medieval conception of rights can be thought of\nas “objective”: first, because the things which are right\nare objects (and not subjects); second, because things become\nworthy of the label “right” when they satisfy an\nobjective, agent-independent set of necessity and sufficient\nconditions, viz., those conditions required for conformity to the\nnatural law. Now, it is true that this medieval view had begun to be\ndisplaced by Grotius’ time; for example, Suarez says that a\n“strict acceptation of ius” bestows it\n\n\nupon a certain moral power which every man has, either over his own\nproperty or with respect to that which is due to him. (De\nlegibus I.2.5)\n\n\nHowever, Grotius is usually given the credit for shifting the paradigm\nfundamentally (see, e.g., Haakonssen 1985: 240 and Schneewind 1998:\n78; for an opposing view, see Irwin 2008: 98). While it took time for\nhis paradigm to become hegemonic, it did eventually prevail. When we\nsay that so-and-so has the right to such-and-such, we usually\nmean that he has the means or power to do\nsuch-and-such: for example, the assertion that someone has the right\nto freedom of thought means that he has the ability to think as he\npleases and no one or no thing can force him to do otherwise. This was\nGrotius’ view; though subsequently mediated by many others, his\ncontribution was essential.\n\nIn addition to its intrinsic interest, Grotius’ innovative\nconception of rights had numerous important consequences. Two examples\nmay serve as illustrations. First, whereas medieval theorists tended\nto speak of “the right”, Grotius and his successors\nstressed the powers and entitlements of the person who has rights. By\nassociating rights with the powers of a person, moderns were able to\ndistinguish sharply between rights on the one hand versus duties on\nthe other (cf. Finnis 1980: 209). Second, because Grotius made rights\ninto powers or faculties which humans possessed, he played a\ncrucial part in the commoditization of rights. Once rights became\npossessions, they can be traded away just like all other possessions.\nThe means of transfer might not be identical to other exchanges of\ngoods but the essential idea of giving away something in one’s\npossession for something which isn’t is there. As commentators\nhave argued, the commoditization of rights was one of the most\nimportant political developments of the seventeenth century (for more,\nsee especially Macpherson 1962: 3f).\n\nGrotius exploited the latter idea in some of the more notorious parts\nof his corpus. Take the following:\n\n\nAt this point first of all the opinion of those must be rejected who\nhold that everywhere and without exception sovereignty resides in the\npeople, so that it is permissible for the people to restrain and\npunish kings whenever they make a bad use of their power… We\nrefute it by means of the following arguments.\n\nTo every man it is permitted to enslave himself to any one he pleases\nfor private ownership, as is evident both from the Hebraic and from\nthe Roman Law. Why, then, would it there not be as lawful for a People\nwho are at their own disposal to deliver up themselves to some one\nperson, or to several persons, and transfer the right of governing\nthem upon him or them, retaining no vestige of that right for\nthemselves? (DIB I.3.8.1).\n\n\nGrotius extends the case elsewhere, insisting that a people may give\ntheir rights to a ruler, receiving a peaceful and stable society in\nreturn (DIB I.4.2.1). But what are the limits placed on the\nruler who has taken possession of these rights? To some readers,\nGrotius’ willingness to allow agents to transfer their rights\nleaves him open to charges of befriending despots. Provided that the\ninitial transfer of rights was legitimate, then once the ruler is in\npossession of rights, those living under him or her have no right to\ncomplain that certain forms of behavior are unjust, for they have no\nrelevant rights at all. As Rousseau put it, Grotius “spares no\npains to rob the people of all their rights and invest kings with\nthem” (Social Contract, Book II, Chapter Two). To be\nsure, other readers denied that Grotius’ theory allowed agents a\ntotal transfer of their rights; in particular, they contended that\nagents will always retain their fundamental rights, such as the right\nof self-defense (see Locke as interpreted by Tuck 1979: 172–3).\nNevertheless, whatever the theory itself actually implies, it remains\nthat Grotius himself seems to have believed that agents may surrender\nall liberties in certain circumstances (for more, see DIB\nI.3.9–16).\n\nOn a more positive note, Grotius’ recognition of the\ntransferability of rights led him to a novel solution for one of the\ngreat problems of political philosophy. What is the source of the\nstate’s right or power? Two traditional answers were (1)\nGod—he set up the state and it derives its authority from his\nsanction—and (2) might—because the state is powerful, it\nhas the authority to govern, for might makes right. While Grotius\nflirts with both of these, he finally settled for something else. He\nwrites in the DIP,\n\n\njust as every right [ius] of the magistrate comes to him from\nthe state, so has the same right come to the state from private\nindividuals; and similarly, the power of the state is the result of\ncollective agreement. (Chap. Eight)\n\n\nThrough innumerable, separate, sequential decisions occurring over a\nprotracted period of time, individuals gradually agreed to form\ninstitutions for governing society by imbuing them with some of power\nwhich they naturally possess. Eventually, these institutions gelled\ninto a single coherent entity which is the state. The state’s\npower, then, is the product neither of God nor of sheer force but\ninstead of the willful transference of individuals’ powers or\nrights to it. It may be a mistake to interpret this idea as a nascent\ncontractualism (see Tuck 1993: 178–9) but likewise, it would be\na mistake to deny the appeal it would have to later contractualists\nsuch as Hobbes.\n\nAll of this underscores Grotius’ real but uneven contributions\nto the doctrines of political liberalism which were being formulated\nin his time. To the emerging theory of liberalism, he gave the idea\nthat individuals—both individual persons and individual groups\nof persons—are bearers of rights. Also, he advanced the\ncompelling second-order account of the nature of those rights\ndescribed above. And he argued strongly in support of the attribution\nof several specific first-order rights: for example, besides those\nwhich have already been mentioned (such as self-defense), he\nvigorously defended rights to property. However, as important as these\nand other contributions to liberalism are, they must be balanced\nagainst some of Grotius’ other views. For instance, while it is\ntrue that he thought individuals had rights, it is also true that he\nthought there were a number of circumstances in which those rights\nmight be surrendered or even just overridden. So the rights that we\nare supposed to have in Grotius’ theory are not completely\nassured. More sinister are his views on slavery, which is or at least\ncan be an entirely just institution. In the DIP he writes\nthat Aristotle is not “mistaken when he says that certain\npersons are by nature slaves” (Chap. Six, Quest. V, Art. One).\nWhile Grotius may have repudiated this thought in the DIB\n(see III.7.1—but see also I.3.8.4), a simple argument continued\nto convince him that slavery is compatible with a just society. If\nindividuals may sell their labor, Grotius reasons, then they should\nalso be able to sell their liberty. If they sell all of their liberty,\nthen they are of course slaves (I.3.8.1). A final weight to be placed\non the balance of Grotius’ liberalism is his view on the status\nof rulers or sovereigns. Because sovereignty is “that\npower… whose actions are not subject to the legal control of\nanother” (DIB I.3.7.1), it follows as a necessary truth\nthat those who hold sovereignty are necessarily superior to all\nothers. Because they are necessarily superior to the rest, Grotius\nconsiders rebarbative the suggestion that sovereigns are answerable to\ntheir subjects. They may wish to take the needs of her or his subjects\ninto account (III.15) but this is only “praiseworthy” and\nnot imperative. In sum, then, Grotius’ contributions to\npolitical liberalism are comparable to Hobbes, Spinoza, Locke and\nother seventeenth century luminaries. They are genuine and significant\nwhile mixed with decidedly non-liberal themes.\n5. Just War Doctrine\n\nAs the title of his magnum opus implies, the normative status\nof war was of paramount concern to Grotius. The common distinction\nbetween ius ad bellum and ius in bello—the\ndistinction between the rightful causes of war versus the rightful\nconduct of war—is useful for understanding his views. Regarding\nius ad bellum, Grotius devotes DIP Chap. Three and\nDIB I.2 to the question of whether it is ever lawful to wage\nwar. He argues that war is not only compatible with but sometimes\ncompelled by all three major kinds of law—the law of nature, the\nlaw of nations or international law, and divine law. In support of his\nanswer, he adduces a number of conceptual, historical and theological\narguments. It would be tendentious to recount all of them, so take\njust one influential example of the first sort:\n\n\nHe who wills the attainment of a given end, wills also the things that\nare necessary to that end. God wills that we should protect ourselves,\nretain our hold on the necessities of life, obtain that which is our\ndue, punish transgressors, and at the same time defend the\nstate… But these divine objectives sometimes constitute causes\nfor undertaking and carrying on war… Thus it is God’s\nWill that certain wars should be waged… Yet no one will deny\nthat whatsoever God will, is just. Therefore, some wars are just.\n(DIP Chap. Three)\n\n\nFar from believing that war is a condition outside the realm of\nmorality and law, Grotius took it to be an instrument of right (cf.\nDumbauld 1969: 73). As he wrote, “where judicial settlement\nfails, war begins” (DIB II.1.2.1). Wars may be justly\nundertaken in response either to “wrongs not yet committed, or\nto wrongs already done” (ibid.). The list of wrongs which\njustify war is long, including the inflicting of punishment (ibid.),\nself-defense (II.1.3), the defense of chastity (II.1.7), etc. At the\nsame time as he countenances war, Grotius does set limits, some of\nthem controversial. For example, he argues that one doesn’t have\nthe right to defend oneself against an assailant who is “useful\nto many” (II.1.9.1). This principle applies to both individuals\nand states. So it follows that both individuals and states may be\nobliged to acquiesce when attacked by someone important to\nsociety—whether the society of a single nation or the society of\nnations. Overall, it has been argued, what sets Grotius’\nanalysis of ius ad bellum apart from his predecessors is\n“in his detailed and systematic elaboration of the ‘just\ncauses’ of war’” (Draper 1990: 194).\n\nEven supposing that a war has been undertaken rightly, it must also be\nfought rightly for it to be just. And here we come to ius in\nbello, a topic treated in DIB III. Grotius begins by\nsetting three rules governing the conduct of war (DIB\nIII.1.2–4), the first and most basic of which is that “In\nwar things which are necessary to attain the end in view are\npermissible” (III.1.2). This obviously places wide limits on\npermissible conduct, though it isn’t as chilling as a first\nreading might suggest, for the necessity requirement can be hard to\nmeet. After advancing these rules, Grotius considers the\npermissibility of a large number of actions. The variety and amount of\ndetail in this discussion is fascinating. Typical is his analysis of\nruses, deceit and falsehood. Not only does he distinguish between\nthose three ways of conveying false impressions but also he\ndistinguishes variations within each of them (see III.1.6–20).\nFor example, if deceit is a genus, then deceit in a negative action is\none species (III.1.7) and deceit in a positive action is another\n(III.1.8). And deceit in a positive action can in turn be divided into\ntwo sub-species (ibid.). The practical aims of DIB come\nthrough plainly here and throughout Book III, where the priority seems\nto be clarifying what exactly is and is not permissible in war by\nconsidering a large number of actions which could belligerents could\nundertake and determining their moral and legal standing. In general,\nGrotius held that war is justifiable when, and only when, it serves\nright. Since the conditions for service to right are numerous and\nnon-obvious, he must expend considerable effort identifying and\nexplicating them (for more, see Draper 1990: 191–207).\n6. Originality and Influence\n\nComing at last to a broader assessment of Grotius’ contributions\nto the history of ideas, we should start by distinguishing the\nquestion of his originality from that of his influence. For our\npurposes, it will suffice to define originality as involving the\nformation of novel and important new concepts and/or methods while\ntaking influence to consist in having major effects on others. Let us\nhandle originality first before coming to the easier question of\nGrotius’ influence.\n\nGiven that his work ranged across so many different\nfields—ethics, political theory, politics, religion—it is\nimpossible to make a blanket statement that Grotius was or was not an\noriginal thinker. Instead, the only responsible approach is to deal\nwith his alleged contributions on a case-by-case basis. Because it\nwould be tedious to go through all the cases here, let us just take\nthe two which are likely to be of greatest interest to philosophers:\nethics and political theory.\n\nThere is scholarly dispute about the originality of Grotius’\nethics. Irwin (2008) has recently argued that because he merely\nextracts the major elements of his theory of morality from other\nauthors, especially Aquinas and Suarez, “Grotius is no\npioneer” in the history of ethics (98). By contrast, Schneewind\n(1993) thinks that Grotius deserves credit for introducing agonism\ninto ethics—the notion that\n\n\nconflict is ineradicable, and could not be removed, even in principle,\nby the completest possible metaphysical knowledge of how the world is\nconstituted. (1993: 58).\n\n\nWriting decades before Irwin and Schneewind, the Italian scholar A.P.\nd’Entrèves argues that\n\n\nIt is not in its content that Grotius’ theory of natural law\nbreaks away from Scholasticism. It is in its method.\n(d’Entrèves 1951 [1970: 54])\n\n\nAccording to d’Entrèves, Grotius attempted to\n\n\nconstruct a system of laws which would carry conviction in an age in\nwhich theological controversy was gradually losing the power to do so\n… His successors completed the task. The natural law which they\nelaborated was entirely “secular”. (1951 [1970: 55])\n\n\nOthers who have weighed in on the subject of the originality of\nGrotius’ ethics include Kilcullen (1995), Darwall (2012), and\nMiller (2020). A clear and balanced assessment is given by Tierney\n(1997: Chapter XIII).\n\nTurning to political theory,\n Sections 4–5\n above identified various concrete contributions of Grotius’ to\npolitics. For many scholars, however, Grotius is important not so much\nfor his new ideas as for his new way of thinking about political\nproblems. So, Kingsbury and Roberts say, “the greatest direct\ncontribution of” the DIB is\n\n\nthe systematic reassembling of practice and authorities on the\ntraditional but fundamental subject of the jus belli,\norganized for the first time around a body of principles rooted in the\nlaw of nature. (1990: 3–4)\n\n\nThere is a different gauge of Grotius’ originality in the domain\nof politics. Through his writings, he gave rise to a theory of\nstatehood and the relations among states which has come to be known\nas, simply, “Grotian” (the labels are used by Wight\n(1991), among others). This theory is an account of the origins and\nidentity conditions of states. It conceives of states as existing not\nin a pre- or anti-social condition but rather in an international\nsociety governed by a system of norms. Those norms hold apart from a\npositive action by a legislature or legislator. At the same time as it\ninsists on the existence and relevance of these norms (which are, of\ncourse, the laws of nature), it is also cognizant of the force of real\npolitick. Individual states will engage in the pursuit of their own\nperceived interests, regardless of whether such pursuits place them in\nconflict with the natural law. By doing all of this, the Grotian\nschool is supposed to negotiate a middle way between bare-knuckled\n“Machiavellianism” and excessively idealistic\n“Kantianism” (for more, see Wight together with the\ncriticisms in Bull 1976). Depending on the fortunes of these schools\nat any particular moment in history, Grotius’ influence on\ninternational relations will be waxing or waning.\n\nThat mention of the influence brings us to the second broad topic of\nthis concluding section. Scholars may argue about whether and how\nGrotius was original but no one can doubt his influence. For example,\nthe Swedish King Gustav Adolph is supposed to have kept a copy of the\nDIB under his pillow, next to the Bible. And King James I\nreacted strongly (and negatively) to Grotius’ presentations\nduring a diplomatic mission to England.\n\nSo Grotius’ influence was felt on some of the major actors of\nhis day. Naturally, though, his main impact was on other scholars.\nBayle called him “one of the greatest men in Europe” (1720\n[1740: 2.614]). Leibniz hailed “the incomparable Hugo\nGrotius” (see Leibniz 1710 [1985], 77). Thomas Reid spoke of\n“the immortal Hugo Grotius” (see Reid 1788 [1815],\n331), Hutcheson drew on him extensively, and Hume approvingly\ncited an argument of his about the origins of property in the third\nappendix of his second Enquiry (see Hume 1748 [1975], 307).\nTo be sure, not all were so impressed. Rousseau’s opinion has\nalready been cited; the natural law theorist Samuel Pufendorf was also\nsceptical. And Voltaire found Grotius to be simply boring. Still,\nwhether for good or for ill, Grotius was at the center of letters for\nan enviably long time. For a brief synopsis of Grotius’\ninfluence, focusing on the DIB , see Tuck (2005:\nix–xii).\n",
    "bibliography": {
        "categories": [
            "Primary Texts and Translations",
            "Select Secondary Literature"
        ],
        "cat_ref_text": {
            "Primary Texts and Translations": [
                "</h3>\n<p>\nN.B.: This is but a small selection of Grotius’ more important\nworks. For a more complete catalogue, see ter Meulen and Diermanse\n(1950).</p>\n<ul class=\"hanging\">",
                "<em>Mare liberum</em>, Leiden: Elzevier, 1609; reprinted and\ntranslated many times since. The translation and edition by Ralph van\nDeman Magoffin (Oxford: Oxford University Press, 1916) contains a\nfacsimile of the 1633 edition. See also the recently published <em>The\nFree Sea</em>, translated by Richard Hakluyt (done circa 1616) with\nWilliam Welwod’s critique and Grotius’s reply, edited and\nwith an introduction by David Armitage (Indianapolis: Liberty Fund,\n2004).",
                "[<em>DIB</em>] <em>De iure belli ac pacis libri tres</em>, Paris:\nBuon, 1625; reprinted and translated many times since. Jean\nBarbeyrac’s 1735 edition, with extensive notes and commentary,\nwas the most important; it was translated into English and published\nin London by Innys et al. in 1738. It has been recently reprinted as\n<em>The Rights of War and Peace</em>, Books I–III, edited and\nwith an introduction by Richard Tuck, Indianapolis, IN: Liberty Fund,\n2005. Another commonly used edition and translation is by Frank W.\nKelsey et al. for the Classics of International Law series, Oxford:\nOxford University Press, 1925. Kelsey’s version is printed with\na facsimile of the 1646 edition.",
                "<em>Annales et Historiae de Rebus Belgicis</em>, Amsterdam: Blaeu,\n1657; translated by Thomas Manley, as <em>De rebus belgicis, or, The\nannals and history of the Low-Countrey-warrs</em>, London: Twyford and\nPaulet, 1665.",
                "<em>Opera omnia theologica</em>, London: Moses Pitt, 1679.",
                "[<em>DIP</em>] <em>De iure praedae commentarius</em>, G. Hamaker\n(ed.), The Hague: Nijhoff, 1868. Until fairly recently, the most\ncommonly used edition and translation was <em>Commentary on the Law of\nPrize and Booty</em>, by Gwladys L. Williams et al. for the Classics\nof International Law series, Oxford: Clarendon Press, 1950.\nWilliams’ version is printed along with a collotype of\nGrotius’ manuscript. The edition of Williams’ translation\nwith Martine Julia van Ittersum as editor (Indianapolis, IN: Liberty\nFund, 2006) has superseded Williams’ original.",
                "<em>Briefwisseling van Hugo Grotius</em>, P.C. Molhuysen et al.\n(eds.), The Hague: Nijhoff, 1928–2001.",
                "<em>Grotius Reader: A Reader for Students of International Law and\nLegal History</em>, L.E. van Holk and C.G. Roelofsen (eds.), The\nHague: T.M.C. Asser Instituut, 1983.",
                "<em>De antiquitate Reipublicae Batavicae</em>, Translated as\n<em>The Antiquity of the Batavian Republic</em>, Jan Waszink et al.\n(eds. and trans.), Assen: Royal van Gorcum, 2000.\n</ul>\n<h3 id=\"SeleSecoLite\">"
            ],
            "Select Secondary Literature": [
                "</h3>\n<p>\nN.B.: In addition to the following (which emphasizes English-language\nliterature), interested readers should also consult the scholarly\njournal <em>Grotiana</em> (new series), which regularly publishes\narticles in several languages on all aspects of Grotius’ thought\nand legacy.</p>\n<h4>Anthologies</h4>\n<ul class=\"hanging\">",
                "[Anonymous] (ed.), 1984, <em>The World of Hugo Grotius:\nProceedings of the international colloquium organized by the Grotius\nCommittee of the Royal Netherlands Academy of Arts and Sciences,\nRotterdam 6–9 April 1983</em>, Amsterdam and Maarssen:\nAPA—Holland University Press.",
                "Asser Instituut (eds.), 1985, <em>International Law and the\nGrotian Heritage</em>, The Hague: T.M.C. Asser Instituut.",
                "Blom, Hans W. (ed.), 2009, <em>Property, Piracy and Punishment:\nHugo Grotius on War and Booty in De Iure Praedae—Concepts and\nContexts</em>, Leiden: Brill.",
                "Blom, Hans W. and Laurens Winkel (eds.), 2004, <em>Grotius and the\nStoa</em>, Assen: Royal Van Gorcum.",
                "Bull, Hedley, Benedict Kingsbury, and Adam Roberts (eds.), 1990,\n<em>Hugo Grotius and International Relations</em>, Oxford: Clarendon\nPress.",
                "Dunn, John and Ian Harris (eds.), 1997, <em>Grotius</em>, vols.\n1–2, Cheltenham: Edward Elgar Publishing. (N.B.: This large\ncollection reprints a number of the articles cited individually\nbelow.)",
                "Onuma, Yasuaki (ed.), 1993, <em>A Normative Approach to War:\nPeace, War, and Justice in Hugo Grotius</em>, Oxford: Clarendon\nPress.\n</ul>\n<h4>Bibliographies</h4>\n<ul class=\"hanging\">",
                "Eyffinger, A.C. et al., 1983, <em>The Grotius Collection at the\nPeace Palace: A Concise Catalogue</em>, The Hague: Peace Palace\nLibrary.\n [<a href=\"https://www.peacepalacelibrary.nl/files/Grotius_Collection.pdf\" target=\"other\">Eyffinger et al. 1983 available online</a>]",
                "Molhuysen, Philippus Christianus, 1943, “De Bibliotheek van\nHugo de Groot in 1618”, <em>Mededeelingen der Nederlandsche\nAkademie van Wetenschappen</em>, Afdeeling Letterkunde, Nieuwe reeks,\ndl. 6, no. 3. (N.B.: This is a list of books in Grotius’\npossession in 1618.)",
                "ter Meulen, Jacob and P.J.J. Diermanse, 1950, <em>Bibliographie\ndes écrits imprimés de Hugo Grotius</em>, The Hague:\nMartinus Nijhoff.",
                "–––, 1961, <em>Bibliographie des écrits\nsur Hugo Grotius imprimés au XVIIe sicle</em>, The Hague:\nMartinus Nijhoff.",
                "Willems, J.C.M., 1980, 1981, ongoing, <em>Grotiana</em> (new\nseries), vols. 1, 2, etc.\n</ul>\n<h4>Biographies</h4>\n<ul class=\"hanging\">",
                "Bayle, Pierre, 1720 [1740], “Grotius”, in\n<em>Dictionaire historique et critique</em>, 3<sup>rd</sup> edition,\nRotterdam: Michel Bohm. 5<sup>th</sup> Edition, 1740, Amsterdam,\nLeyde, La Haye, Utrecht, vol. 2: 614–620.\n [<a href=\"https://gallica.bnf.fr/ark:/12148/bpt6k9764671j\" target=\"other\">Bayle 1720 [1740] available online</a>]",
                "Brandt, Caspar, and Cattenburgh, Adriaan van, 1732, <em>Historie\nvan het leven des heeren Huig de Groot</em>, 2<sup>nd</sup> edition,\nDordrecht and Amsterdam: Van Braam en onder der Linden.",
                "Dumbauld, Edward, 1969, <em>The Life and Legal Writings of Hugo\nGrotius</em>, Norman, OK: University of Oklahoma Press.",
                "Edwards, Charles, 1981, <em>Hugo Grotius</em>, Chicago:\nNelson-Hall.",
                "Holk, L.E. van., 1983, “Hugo Grotius, 1583–1645, A\nBiographical Sketch”, in <em>Grotius Reader: A Reader for\nStudents of International Law and Legal History</em>, L.E. van Holk\nand C.G. Roelofsen (eds.), The Hague: T.M.C. Asser Instituut,\n23–44.",
                "Knight, W.S.M., 1925, <em>The Life and Works of Hugo Grotius</em>,\nLondon: Sweet and Maxwell Publishers.",
                "Vreeland, Hamilton, Jr., 1917, <em>Hugo Grotius: the Father of the\nModern Science of International Law</em>, New York: Oxford University\nPress.\n</ul>\n<h4>Monographs and articles</h4>\n<ul class=\"hanging\">",
                "Aquinas, Thomas, <em>Summa Theologica</em>, written from\n1265–1274. Translated by Fathers of the English Dominican\nProvince, Cincinnati, OH: Benziger Brothers, 1947.\n [<a href=\"https://ccel.org/ccel/aquinas/summa/summa.\" target=\"other\"><em>Summa Theologica</em> available online</a>]",
                "Blom, Hans, 1995, <em>Causality and Morality: the Rise of\nNaturalism in Dutch Seventeenth-Century Political Thought</em>, Ph.D.\nthesis, Utrecht University.",
                "Brandt, Reinhard, 1974, <em>Eigentumstheorien von Grotius bis\nKant</em>, Stuttgart-Bad Cannstatt: Frommann-Holzboog.",
                "Brett, Annabel, 2002, “Natural Right and Civil Community:\nThe Civil Philosophy of Hugo Grotius”, <em>The Historical\nJournal</em>, 45(1): 31–51. doi:10.1017/S0018246X01002102",
                "Brooke, Christopher, 2012, <em>Philosophic Pride: Stoicism and\nPolitical Thought from Lipsius to Rousseau</em>, Princeton, NJ:\nPrinceton University Press.",
                "Bull, Hedley, 1976, “Martin Wight and the Theory of\nInternational Relations”, <em>British Journal of International\nStudies</em>, 2(2): 101–116. doi:10.1017/S0260210500116602",
                "Chroust, Anton-Hermann, 1943, “Hugo Grotius and the\nScholastic Natural Law Tradition”, <em>New Scholasticism</em>,\n17(2): 101–133; reprinted in Dunn and Harris 1997.\ndoi:10.5840/newscholas194317217",
                "Darwall, Stephen, 2012, “Grotius at the Creation of Modern\nMoral Philosophy”, <em>Archiv Für Geschichte Der\nPhilosophie</em>, 94(3): 296–325.\ndoi:10.1515/agph-2012-0013",
                "d’Entrèves, Alessandro Passerin, 1951 [1970],\n<em>Natural Law: An Introduction to Legal Philosophy</em>, London:\nHutchinson &amp; Co. Second edition, 1970.",
                "Draper, G.I.A.D., 1990, “Grotius’ Place in the\nDevelopment of Legal Ideas about War”, in Bull, Kingsbury, and\nRoberts 1990: 177–207.",
                "Dufour, Alfred, 1980, “L’influence de la\nméthodologie des sciences physiques et mathématiques sur\nles fondateurs de l’école du droit naturel moderne\n(Grotius, Hobbes, Pufendorf)”, <em>Grotiana</em> (new series),\n1: 33–52; reprinted in Dunn and Harris 1997.\ndoi:10.1163/187607580X00053",
                "–––, 1984, “Grotius et le droit naturel du\ndix-septime sicle”, in [Anonymous] (ed.) 1984: 15–41.",
                "Finnis, John, 1980, <em>Natural Law and Natural Rights</em>,\nOxford: Clarendon Press.",
                "Gurvitch, Georges, 1927, “La philosophie du droit de Hugo\nGrotius et la théorie moderne du droit international”,\n<em>Revue de Metaphysique et de Morale</em>, 34(3):\n365–391.",
                "Haakonssen, Knud, 1985, “Hugo Grotius and the History of\nPolitical Thought”, <em>Political Theory</em>, 13(2):\n239–265; reprinted in Dunn and Harris 1997.\ndoi:10.1177/0090591785013002005",
                "–––, 1992, “Natural Law”, in\nLawrence C. Becker and Charlotte B. Becker (eds.), <em>The Encylopedia\nof Ethics</em>, New York: Garland Publishers, 884–890.",
                "–––, 1996, <em>Natural Law and Moral Philosophy:\nfrom Grotius to the Scottish Enlightenment</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9781139172905",
                "–––, 1998, “Divine/natural law theories in\nethics”, in Daniel Garber and Michael Ayers (eds.), <em>The\nCambridge History of Seventeenth-Century Philosophy</em> (Volumes\n1–2), Cambridge: Cambridge University Press, vol. 2,\n1317–1357. doi:10.1017/CHOL9780521572330.009",
                "Haggenmacher, Peter, 1983, <em>Grotius et la doctrine de la guerre\njuste</em>, Paris: Presses Universitaires de France. (N.B.: This\nmonograph also has an extensive bibliography; see pp.\n645–672.)",
                "Hart, A. C. ’t., 1983, “Hugo de Groot and Giambattista\nVico”, <em>Netherlands International Law Review</em>, 30:\n5–41; reprinted in Dunn and Harris 1997.\ndoi:10.1017/S0165070X00011876",
                "Hodges, Donald Clark, 1956/7, “Grotius on the Law of\nWar”:, <em>The Modern Schoolman</em>, 34: 36–44.\ndoi:10.5840/schoolman19563414",
                "Hofmann, Hasso, 1977, “Hugo Grotius”, in Michael\nStolleis (ed.), <em>Staatsdenker im 17 und 18 Jahrhundert:\nReichspublizistik, Politik, Naturrecht</em>, Frankfurt am Main:\nMetzner, 51–77.",
                "Hume, David, 1748 [1975], <em>An Enquiry Concerning the Principles\nof Morals</em>, 3rd ed., ed. by L.A. Selby-Bigge, revised ed. by P.H.\nNidditch, Oxford: Oxford University Press.",
                "Irwin, Terence, 2008, <em>The Development of Ethics</em> (Volume\nII), Oxford: Oxford University Press.",
                "Kilcullen, John, 2001, “The Origin of Property: Ockham,\nGrotius, Pufendorf and Some Others”, in <em>A Translation of\nWilliam of Ockham’s “Work of Ninety Days”</em>, John\nKilcullen, and John Scott (eds/trans.), Lewiston, NY: Edwin Mellon\nPress, 883–932.",
                "Kingsbury, Benedict, and Roberts, Adam, 1990, “Introduction:\nGrotian Thought in International Relations”, in Bull, Kingsbury,\nand Roberts 1990: 1–64.",
                "Korsgaard, Christine M., 1996, <em>The Sources of\nNormativity</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511554476",
                "Lauterpacht, Hersch, 1946, “The Grotian Tradition in\nInternational Law”, <em>The British Yearbook of International\nLaw</em>, 28: 1–53; reprinted in Dunn and Harris 1997.",
                "Leibniz, G.W.F., 1710 [1985], <em>Theodicy</em>, ed. by Austin\nFarrer, trans. by E.M. Huggard, Chicago: Open Court.",
                "Macpherson, C.B., 1962, <em>The Political Theory of Possessive\nIndividualism: Hobbes to Locke</em>, Oxford: Oxford University\nPress.",
                "Miller, Jon, 2003, “Stoics, Grotius and Spinoza on Moral\nDeliberation”, in Jon Miller and Brad Inwood (eds.),\n<em>Hellenistic and Early Modern Philosophy</em>, Cambridge: Cambridge\nUniversity Press, 116–140. doi:10.1017/CBO9780511498275.009",
                "–––, 2020, “Hugo Grotius and the Makings\nof Modern Natural Law”, in <em>Christianity and Global Law</em>,\nRafael Domingo and John Witte Jr. (eds.), London, New York: Routledge,\n127–142.",
                "Reid, Thomas, 1788 [1815], <em>Essays on the Active Powers of\nMan</em>, in <i>The Works of Thomas Reid</i>, vol. 4, ed. by Dugald\nStewart, Charlestown: Samuel Etheridge.",
                "Remec, Peter Paul, 1960, <em>The Position of the Individual in\nInternational Law according to Grotius and Vattel</em>, The Hague:\nNijhoff.",
                "Rousseau, Jean-Jacques, 1762, <em>Du contrat social; ou Principes\ndu droit politique</em> (<em>The Social Contract</em>),\nAmsterdam.",
                "–––, 1762, <em>Émile, ou De\nl’éducation</em>, Geneva. Excerpts in Rousseau 1915,\nvolume II.",
                "–––, 1915, <em>Political Writings</em> (Volumes\nI–II), Charles Edwyn Vaughan (ed. and trans.), Cambridge:\nCambridge University Press.",
                "St. Leger, James, 1962, <em>The “Etiamsi Daremus” of\nHugo Grotius: A Study in the Origins of International Law</em>, Rome:\nPontificium Athenaeum Internationale.",
                "Schneewind, Jerome B., 1993, “Kant and Natural Law\nEthics”, <em>Ethics</em>, 104(1): 53–74.\ndoi:10.1086/293575",
                "–––, 1998, <em>The Invention of Autonomy: A\nHistory of Modern Moral Philosophy</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9780511818288",
                "Shaver, Robert, 1996, “Grotius on Scepticism and\nSelf-Interest”, <em>Archiv Für Geschichte Der\nPhilosophie</em>, 78(1): 27–47.\ndoi:10.1515/agph.1996.78.1.27",
                "Simmonds, Kenneth R., 1957, “Some English Precursors of Hugo\nGrotius”, <em>Transactions of the Grotius Society</em>, 43:\n143–157.",
                "–––, 1957/8, “Hugo Grotius and Alberico\nGentili”, <em>Jahrbuch für Internationales Recht</em>, 8:\n85–100.",
                "Straumann, Benjamin, 2006, “‘Ancient Caesarian\nLawyers’ in a State of Nature: Roman Tradition and Natural\nRights in Hugo Grotius’s <em>De Iure Praedae</em>”,\n<em>Political Theory</em>, 34(3): 328–350.\ndoi:10.1177/0090591706286459",
                "–––, 2007, <em>Hugo Grotius und die Antike</em>,\nBaden-Baden: NOMOS.",
                "–––, 2015, <em>Roman Law in the State of Nature:\nThe Classical Foundations of Hugo Grotius’ Natural Law</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9781316143629",
                "Suarez, Francisco, 1612 [1944], <em>De Legibus, ac De\nLegislatore</em>, trans. by Gwladys L. Williams, Oxford:\nClarendon Press.",
                "Tanaka, Tadashi, 1993, “Grotius’ Method: with Special\nReference to Prolegomena”, in Onuma 1993: 11–31.",
                "Tierney, Brian, 1983, “Tuck on Rights: Some Medieval\nProblems”, <em>History of Political Thought</em>, 4(3):\n429–441.",
                "–––, 1997, <em>The Idea of Natural Rights</em>,\nAtlanta, GA: Scholars Press.",
                "Todescan, Franco, 2003, <em>Etiamsi Daremus: Studi Sinfonici sul\nDiritto Naturale</em>, Padua: CEDAM.",
                "Tuck, Richard, 1979, <em>Natural Rights Theories: Their Origin and\nDevelopment</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9781139163569",
                "–––, 1983, “Grotius, Carneades and\nHobbes”, <em>Grotiana</em> (new series), 4: 43–62;\nreprinted in Dunn and Harris 1997. doi:10.1163/187607583X00050",
                "–––, 1987, “The ‘Modern’\nTheory of Natural Law”, in <em>The Languages of Political Theory\nin Early-Modern Europe</em>, Anthony Pagden (ed.), Cambridge:\nCambridge University Press, 99–120.\ndoi:10.1017/CBO9780511521447.006",
                "–––, 1991, “Grotius and Selden”, in\n<em>The Cambridge History of Political Thought 1450–1700</em>,\nJ. H. Burns and Mark Goldie (eds.), Cambridge: Cambridge University\nPress, 499–529. doi:10.1017/CHOL9780521247160.019",
                "–––, 1993, <em>Philosophy and Government\n1572–1651</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511558634",
                "–––, 1999, <em>The Rights of War and Peace.\nPolitical Thought and the International Order from Grotius to\nKant</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199248148.001.0001",
                "–––, 2005, “Introduction” to <em>The\nRights of War and Peace</em> (Books I–III), by Hugo Grotius,\nreprinted Indianapolis: Liberty Fund.\n [<a href=\"https://oll.libertyfund.org/titles/grotius-the-rights-of-war-and-peace-2005-ed-vol-1-book-i\" target=\"other\">Tuck 2005 available online</a>]",
                "van Ittersum, Martine, 2002, <em>Profit and Principle: Hugo\nGrotius, Natural Rights Theories and the Rise of Dutch Power in the\nEast Indies, 1595–1615</em>, Ph.D. thesis, Harvard\nUniversity.",
                "–––, 2006, “Note on the Text”, in\nGrotius, <em>Commentary on the Law of Prize and Booty</em>, Martine\nvan Ittersum (ed.), Indianapolis, IN: Liberty Fund.",
                "Vermeulen, B. P., 1983, “Grotius’ Methodology and\nSystem of International Law”, <em>Netherlands International Law\nReview</em>, 30(3): 374–382. doi:10.1017/S0165070X00012006",
                "Vollenhoven, C. Van, 1932, <em>The Framework of Grotius’\nBook De Iure Belli ac Pacis (1625)</em>, Amsterdam: Noord-Hollandsche\nuitgeversmaatschappij.",
                "Whewell, William, 1853, “Editor’s Preface”, in\nWilliam Whewell (ed. and trans.), <em>Hugonis Grotii de iure belli ac\npacis</em>, Cambridge: Cambridge University Press, iii–xvi.",
                "Wight, Martin, 1991, <em>International Theory: the Three\nTraditions</em>, Gabriele Wight and Brian Porter (eds.), Leicester:\nLeicester University Press.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimTextTran\">Primary Texts and Translations</h3>\n<p>\nN.B.: This is but a small selection of Grotius’ more important\nworks. For a more complete catalogue, see ter Meulen and Diermanse\n(1950).</p>\n<ul class=\"hanging\">\n<li><em>Mare liberum</em>, Leiden: Elzevier, 1609; reprinted and\ntranslated many times since. The translation and edition by Ralph van\nDeman Magoffin (Oxford: Oxford University Press, 1916) contains a\nfacsimile of the 1633 edition. See also the recently published <em>The\nFree Sea</em>, translated by Richard Hakluyt (done circa 1616) with\nWilliam Welwod’s critique and Grotius’s reply, edited and\nwith an introduction by David Armitage (Indianapolis: Liberty Fund,\n2004).</li>\n<li>[<em>DIB</em>] <em>De iure belli ac pacis libri tres</em>, Paris:\nBuon, 1625; reprinted and translated many times since. Jean\nBarbeyrac’s 1735 edition, with extensive notes and commentary,\nwas the most important; it was translated into English and published\nin London by Innys et al. in 1738. It has been recently reprinted as\n<em>The Rights of War and Peace</em>, Books I–III, edited and\nwith an introduction by Richard Tuck, Indianapolis, IN: Liberty Fund,\n2005. Another commonly used edition and translation is by Frank W.\nKelsey et al. for the Classics of International Law series, Oxford:\nOxford University Press, 1925. Kelsey’s version is printed with\na facsimile of the 1646 edition.</li>\n<li><em>Annales et Historiae de Rebus Belgicis</em>, Amsterdam: Blaeu,\n1657; translated by Thomas Manley, as <em>De rebus belgicis, or, The\nannals and history of the Low-Countrey-warrs</em>, London: Twyford and\nPaulet, 1665.</li>\n<li><em>Opera omnia theologica</em>, London: Moses Pitt, 1679.</li>\n<li>[<em>DIP</em>] <em>De iure praedae commentarius</em>, G. Hamaker\n(ed.), The Hague: Nijhoff, 1868. Until fairly recently, the most\ncommonly used edition and translation was <em>Commentary on the Law of\nPrize and Booty</em>, by Gwladys L. Williams et al. for the Classics\nof International Law series, Oxford: Clarendon Press, 1950.\nWilliams’ version is printed along with a collotype of\nGrotius’ manuscript. The edition of Williams’ translation\nwith Martine Julia van Ittersum as editor (Indianapolis, IN: Liberty\nFund, 2006) has superseded Williams’ original.</li>\n<li><em>Briefwisseling van Hugo Grotius</em>, P.C. Molhuysen et al.\n(eds.), The Hague: Nijhoff, 1928–2001.</li>\n<li><em>Grotius Reader: A Reader for Students of International Law and\nLegal History</em>, L.E. van Holk and C.G. Roelofsen (eds.), The\nHague: T.M.C. Asser Instituut, 1983.</li>\n<li><em>De antiquitate Reipublicae Batavicae</em>, Translated as\n<em>The Antiquity of the Batavian Republic</em>, Jan Waszink et al.\n(eds. and trans.), Assen: Royal van Gorcum, 2000.</li>\n</ul>\n<h3 id=\"SeleSecoLite\">Select Secondary Literature</h3>\n<p>\nN.B.: In addition to the following (which emphasizes English-language\nliterature), interested readers should also consult the scholarly\njournal <em>Grotiana</em> (new series), which regularly publishes\narticles in several languages on all aspects of Grotius’ thought\nand legacy.</p>\n<h4>Anthologies</h4>\n<ul class=\"hanging\">\n<li>[Anonymous] (ed.), 1984, <em>The World of Hugo Grotius:\nProceedings of the international colloquium organized by the Grotius\nCommittee of the Royal Netherlands Academy of Arts and Sciences,\nRotterdam 6–9 April 1983</em>, Amsterdam and Maarssen:\nAPA—Holland University Press.</li>\n<li>Asser Instituut (eds.), 1985, <em>International Law and the\nGrotian Heritage</em>, The Hague: T.M.C. Asser Instituut.</li>\n<li>Blom, Hans W. (ed.), 2009, <em>Property, Piracy and Punishment:\nHugo Grotius on War and Booty in De Iure Praedae—Concepts and\nContexts</em>, Leiden: Brill.</li>\n<li>Blom, Hans W. and Laurens Winkel (eds.), 2004, <em>Grotius and the\nStoa</em>, Assen: Royal Van Gorcum.</li>\n<li>Bull, Hedley, Benedict Kingsbury, and Adam Roberts (eds.), 1990,\n<em>Hugo Grotius and International Relations</em>, Oxford: Clarendon\nPress.</li>\n<li>Dunn, John and Ian Harris (eds.), 1997, <em>Grotius</em>, vols.\n1–2, Cheltenham: Edward Elgar Publishing. (N.B.: This large\ncollection reprints a number of the articles cited individually\nbelow.)</li>\n<li>Onuma, Yasuaki (ed.), 1993, <em>A Normative Approach to War:\nPeace, War, and Justice in Hugo Grotius</em>, Oxford: Clarendon\nPress.</li>\n</ul>\n<h4>Bibliographies</h4>\n<ul class=\"hanging\">\n<li>Eyffinger, A.C. et al., 1983, <em>The Grotius Collection at the\nPeace Palace: A Concise Catalogue</em>, The Hague: Peace Palace\nLibrary.\n [<a href=\"https://www.peacepalacelibrary.nl/files/Grotius_Collection.pdf\" target=\"other\">Eyffinger et al. 1983 available online</a>]</li>\n<li>Molhuysen, Philippus Christianus, 1943, “De Bibliotheek van\nHugo de Groot in 1618”, <em>Mededeelingen der Nederlandsche\nAkademie van Wetenschappen</em>, Afdeeling Letterkunde, Nieuwe reeks,\ndl. 6, no. 3. (N.B.: This is a list of books in Grotius’\npossession in 1618.)</li>\n<li>ter Meulen, Jacob and P.J.J. Diermanse, 1950, <em>Bibliographie\ndes écrits imprimés de Hugo Grotius</em>, The Hague:\nMartinus Nijhoff.</li>\n<li>–––, 1961, <em>Bibliographie des écrits\nsur Hugo Grotius imprimés au XVIIe sicle</em>, The Hague:\nMartinus Nijhoff.</li>\n<li>Willems, J.C.M., 1980, 1981, ongoing, <em>Grotiana</em> (new\nseries), vols. 1, 2, etc.</li>\n</ul>\n<h4>Biographies</h4>\n<ul class=\"hanging\">\n<li>Bayle, Pierre, 1720 [1740], “Grotius”, in\n<em>Dictionaire historique et critique</em>, 3<sup>rd</sup> edition,\nRotterdam: Michel Bohm. 5<sup>th</sup> Edition, 1740, Amsterdam,\nLeyde, La Haye, Utrecht, vol. 2: 614–620.\n [<a href=\"https://gallica.bnf.fr/ark:/12148/bpt6k9764671j\" target=\"other\">Bayle 1720 [1740] available online</a>]</li>\n<li>Brandt, Caspar, and Cattenburgh, Adriaan van, 1732, <em>Historie\nvan het leven des heeren Huig de Groot</em>, 2<sup>nd</sup> edition,\nDordrecht and Amsterdam: Van Braam en onder der Linden.</li>\n<li>Dumbauld, Edward, 1969, <em>The Life and Legal Writings of Hugo\nGrotius</em>, Norman, OK: University of Oklahoma Press.</li>\n<li>Edwards, Charles, 1981, <em>Hugo Grotius</em>, Chicago:\nNelson-Hall.</li>\n<li>Holk, L.E. van., 1983, “Hugo Grotius, 1583–1645, A\nBiographical Sketch”, in <em>Grotius Reader: A Reader for\nStudents of International Law and Legal History</em>, L.E. van Holk\nand C.G. Roelofsen (eds.), The Hague: T.M.C. Asser Instituut,\n23–44.</li>\n<li>Knight, W.S.M., 1925, <em>The Life and Works of Hugo Grotius</em>,\nLondon: Sweet and Maxwell Publishers.</li>\n<li>Vreeland, Hamilton, Jr., 1917, <em>Hugo Grotius: the Father of the\nModern Science of International Law</em>, New York: Oxford University\nPress.</li>\n</ul>\n<h4>Monographs and articles</h4>\n<ul class=\"hanging\">\n<li>Aquinas, Thomas, <em>Summa Theologica</em>, written from\n1265–1274. Translated by Fathers of the English Dominican\nProvince, Cincinnati, OH: Benziger Brothers, 1947.\n [<a href=\"https://ccel.org/ccel/aquinas/summa/summa.\" target=\"other\"><em>Summa Theologica</em> available online</a>]</li>\n<li>Blom, Hans, 1995, <em>Causality and Morality: the Rise of\nNaturalism in Dutch Seventeenth-Century Political Thought</em>, Ph.D.\nthesis, Utrecht University.</li>\n<li>Brandt, Reinhard, 1974, <em>Eigentumstheorien von Grotius bis\nKant</em>, Stuttgart-Bad Cannstatt: Frommann-Holzboog.</li>\n<li>Brett, Annabel, 2002, “Natural Right and Civil Community:\nThe Civil Philosophy of Hugo Grotius”, <em>The Historical\nJournal</em>, 45(1): 31–51. doi:10.1017/S0018246X01002102</li>\n<li>Brooke, Christopher, 2012, <em>Philosophic Pride: Stoicism and\nPolitical Thought from Lipsius to Rousseau</em>, Princeton, NJ:\nPrinceton University Press.</li>\n<li>Bull, Hedley, 1976, “Martin Wight and the Theory of\nInternational Relations”, <em>British Journal of International\nStudies</em>, 2(2): 101–116. doi:10.1017/S0260210500116602</li>\n<li>Chroust, Anton-Hermann, 1943, “Hugo Grotius and the\nScholastic Natural Law Tradition”, <em>New Scholasticism</em>,\n17(2): 101–133; reprinted in Dunn and Harris 1997.\ndoi:10.5840/newscholas194317217</li>\n<li>Darwall, Stephen, 2012, “Grotius at the Creation of Modern\nMoral Philosophy”, <em>Archiv Für Geschichte Der\nPhilosophie</em>, 94(3): 296–325.\ndoi:10.1515/agph-2012-0013</li>\n<li>d’Entrèves, Alessandro Passerin, 1951 [1970],\n<em>Natural Law: An Introduction to Legal Philosophy</em>, London:\nHutchinson &amp; Co. Second edition, 1970.</li>\n<li>Draper, G.I.A.D., 1990, “Grotius’ Place in the\nDevelopment of Legal Ideas about War”, in Bull, Kingsbury, and\nRoberts 1990: 177–207.</li>\n<li>Dufour, Alfred, 1980, “L’influence de la\nméthodologie des sciences physiques et mathématiques sur\nles fondateurs de l’école du droit naturel moderne\n(Grotius, Hobbes, Pufendorf)”, <em>Grotiana</em> (new series),\n1: 33–52; reprinted in Dunn and Harris 1997.\ndoi:10.1163/187607580X00053</li>\n<li>–––, 1984, “Grotius et le droit naturel du\ndix-septime sicle”, in [Anonymous] (ed.) 1984: 15–41.</li>\n<li>Finnis, John, 1980, <em>Natural Law and Natural Rights</em>,\nOxford: Clarendon Press.</li>\n<li>Gurvitch, Georges, 1927, “La philosophie du droit de Hugo\nGrotius et la théorie moderne du droit international”,\n<em>Revue de Metaphysique et de Morale</em>, 34(3):\n365–391.</li>\n<li>Haakonssen, Knud, 1985, “Hugo Grotius and the History of\nPolitical Thought”, <em>Political Theory</em>, 13(2):\n239–265; reprinted in Dunn and Harris 1997.\ndoi:10.1177/0090591785013002005</li>\n<li>–––, 1992, “Natural Law”, in\nLawrence C. Becker and Charlotte B. Becker (eds.), <em>The Encylopedia\nof Ethics</em>, New York: Garland Publishers, 884–890.</li>\n<li>–––, 1996, <em>Natural Law and Moral Philosophy:\nfrom Grotius to the Scottish Enlightenment</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9781139172905</li>\n<li>–––, 1998, “Divine/natural law theories in\nethics”, in Daniel Garber and Michael Ayers (eds.), <em>The\nCambridge History of Seventeenth-Century Philosophy</em> (Volumes\n1–2), Cambridge: Cambridge University Press, vol. 2,\n1317–1357. doi:10.1017/CHOL9780521572330.009</li>\n<li>Haggenmacher, Peter, 1983, <em>Grotius et la doctrine de la guerre\njuste</em>, Paris: Presses Universitaires de France. (N.B.: This\nmonograph also has an extensive bibliography; see pp.\n645–672.)</li>\n<li>Hart, A. C. ’t., 1983, “Hugo de Groot and Giambattista\nVico”, <em>Netherlands International Law Review</em>, 30:\n5–41; reprinted in Dunn and Harris 1997.\ndoi:10.1017/S0165070X00011876</li>\n<li>Hodges, Donald Clark, 1956/7, “Grotius on the Law of\nWar”:, <em>The Modern Schoolman</em>, 34: 36–44.\ndoi:10.5840/schoolman19563414</li>\n<li>Hofmann, Hasso, 1977, “Hugo Grotius”, in Michael\nStolleis (ed.), <em>Staatsdenker im 17 und 18 Jahrhundert:\nReichspublizistik, Politik, Naturrecht</em>, Frankfurt am Main:\nMetzner, 51–77.</li>\n<li>Hume, David, 1748 [1975], <em>An Enquiry Concerning the Principles\nof Morals</em>, 3rd ed., ed. by L.A. Selby-Bigge, revised ed. by P.H.\nNidditch, Oxford:  Oxford University Press.</li>\n<li>Irwin, Terence, 2008, <em>The Development of Ethics</em> (Volume\nII), Oxford: Oxford University Press.</li>\n<li>Kilcullen, John, 2001, “The Origin of Property: Ockham,\nGrotius, Pufendorf and Some Others”, in <em>A Translation of\nWilliam of Ockham’s “Work of Ninety Days”</em>, John\nKilcullen, and John Scott (eds/trans.), Lewiston, NY: Edwin Mellon\nPress, 883–932.</li>\n<li>Kingsbury, Benedict, and Roberts, Adam, 1990, “Introduction:\nGrotian Thought in International Relations”, in Bull, Kingsbury,\nand Roberts 1990: 1–64.</li>\n<li>Korsgaard, Christine M., 1996, <em>The Sources of\nNormativity</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511554476</li>\n<li>Lauterpacht, Hersch, 1946, “The Grotian Tradition in\nInternational Law”, <em>The British Yearbook of International\nLaw</em>, 28: 1–53; reprinted in Dunn and Harris 1997.</li>\n<li>Leibniz, G.W.F., 1710 [1985], <em>Theodicy</em>, ed. by Austin\nFarrer, trans. by E.M. Huggard, Chicago:  Open Court.</li>\n<li>Macpherson, C.B., 1962, <em>The Political Theory of Possessive\nIndividualism: Hobbes to Locke</em>, Oxford: Oxford University\nPress.</li>\n<li>Miller, Jon, 2003, “Stoics, Grotius and Spinoza on Moral\nDeliberation”, in Jon Miller and Brad Inwood (eds.),\n<em>Hellenistic and Early Modern Philosophy</em>, Cambridge: Cambridge\nUniversity Press, 116–140. doi:10.1017/CBO9780511498275.009</li>\n<li>–––, 2020, “Hugo Grotius and the Makings\nof Modern Natural Law”, in <em>Christianity and Global Law</em>,\nRafael Domingo and John Witte Jr. (eds.), London, New York: Routledge,\n127–142.</li>\n<li>Reid, Thomas, 1788 [1815], <em>Essays on the Active Powers of\nMan</em>, in <i>The Works of Thomas Reid</i>, vol. 4, ed.  by Dugald\nStewart, Charlestown: Samuel Etheridge.</li>\n<li>Remec, Peter Paul, 1960, <em>The Position of the Individual in\nInternational Law according to Grotius and Vattel</em>, The Hague:\nNijhoff.</li>\n<li>Rousseau, Jean-Jacques, 1762, <em>Du contrat social; ou Principes\ndu droit politique</em> (<em>The Social Contract</em>),\nAmsterdam.</li>\n<li>–––, 1762, <em>Émile, ou De\nl’éducation</em>, Geneva. Excerpts in Rousseau 1915,\nvolume II.</li>\n<li>–––, 1915, <em>Political Writings</em> (Volumes\nI–II), Charles Edwyn Vaughan (ed. and trans.), Cambridge:\nCambridge University Press.</li>\n<li>St. Leger, James, 1962, <em>The “Etiamsi Daremus” of\nHugo Grotius: A Study in the Origins of International Law</em>, Rome:\nPontificium Athenaeum Internationale.</li>\n<li>Schneewind, Jerome B., 1993, “Kant and Natural Law\nEthics”, <em>Ethics</em>, 104(1): 53–74.\ndoi:10.1086/293575</li>\n<li>–––, 1998, <em>The Invention of Autonomy: A\nHistory of Modern Moral Philosophy</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9780511818288</li>\n<li>Shaver, Robert, 1996, “Grotius on Scepticism and\nSelf-Interest”, <em>Archiv Für Geschichte Der\nPhilosophie</em>, 78(1): 27–47.\ndoi:10.1515/agph.1996.78.1.27</li>\n<li>Simmonds, Kenneth R., 1957, “Some English Precursors of Hugo\nGrotius”, <em>Transactions of the Grotius Society</em>, 43:\n143–157.</li>\n<li>–––, 1957/8, “Hugo Grotius and Alberico\nGentili”, <em>Jahrbuch für Internationales Recht</em>, 8:\n85–100.</li>\n<li>Straumann, Benjamin, 2006, “‘Ancient Caesarian\nLawyers’ in a State of Nature: Roman Tradition and Natural\nRights in Hugo Grotius’s <em>De Iure Praedae</em>”,\n<em>Political Theory</em>, 34(3): 328–350.\ndoi:10.1177/0090591706286459</li>\n<li>–––, 2007, <em>Hugo Grotius und die Antike</em>,\nBaden-Baden: NOMOS.</li>\n<li>–––, 2015, <em>Roman Law in the State of Nature:\nThe Classical Foundations of Hugo Grotius’ Natural Law</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9781316143629</li>\n<li>Suarez, Francisco, 1612 [1944], <em>De Legibus, ac De\nLegislatore</em>, trans. by Gwladys L. Williams, Oxford:\nClarendon Press.</li>\n<li>Tanaka, Tadashi, 1993, “Grotius’ Method: with Special\nReference to Prolegomena”, in Onuma 1993: 11–31.</li>\n<li>Tierney, Brian, 1983, “Tuck on Rights: Some Medieval\nProblems”, <em>History of Political Thought</em>, 4(3):\n429–441.</li>\n<li>–––, 1997, <em>The Idea of Natural Rights</em>,\nAtlanta, GA: Scholars Press.</li>\n<li>Todescan, Franco, 2003, <em>Etiamsi Daremus: Studi Sinfonici sul\nDiritto Naturale</em>, Padua: CEDAM.</li>\n<li>Tuck, Richard, 1979, <em>Natural Rights Theories: Their Origin and\nDevelopment</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9781139163569</li>\n<li>–––, 1983, “Grotius, Carneades and\nHobbes”, <em>Grotiana</em> (new series), 4: 43–62;\nreprinted in Dunn and Harris 1997. doi:10.1163/187607583X00050</li>\n<li>–––, 1987, “The ‘Modern’\nTheory of Natural Law”, in <em>The Languages of Political Theory\nin Early-Modern Europe</em>, Anthony Pagden (ed.), Cambridge:\nCambridge University Press, 99–120.\ndoi:10.1017/CBO9780511521447.006</li>\n<li>–––, 1991, “Grotius and Selden”, in\n<em>The Cambridge History of Political Thought 1450–1700</em>,\nJ. H. Burns and Mark Goldie (eds.), Cambridge: Cambridge University\nPress, 499–529. doi:10.1017/CHOL9780521247160.019</li>\n<li>–––, 1993, <em>Philosophy and Government\n1572–1651</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511558634</li>\n<li>–––, 1999, <em>The Rights of War and Peace.\nPolitical Thought and the International Order from Grotius to\nKant</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199248148.001.0001</li>\n<li>–––, 2005, “Introduction” to <em>The\nRights of War and Peace</em> (Books I–III), by Hugo Grotius,\nreprinted Indianapolis: Liberty Fund.\n [<a href=\"https://oll.libertyfund.org/titles/grotius-the-rights-of-war-and-peace-2005-ed-vol-1-book-i\" target=\"other\">Tuck 2005 available online</a>]</li>\n<li>van Ittersum, Martine, 2002, <em>Profit and Principle: Hugo\nGrotius, Natural Rights Theories and the Rise of Dutch Power in the\nEast Indies, 1595–1615</em>, Ph.D. thesis, Harvard\nUniversity.</li>\n<li>–––, 2006, “Note on the Text”, in\nGrotius, <em>Commentary on the Law of Prize and Booty</em>, Martine\nvan Ittersum (ed.), Indianapolis, IN: Liberty Fund.</li>\n<li>Vermeulen, B. P., 1983, “Grotius’ Methodology and\nSystem of International Law”, <em>Netherlands International Law\nReview</em>, 30(3): 374–382. doi:10.1017/S0165070X00012006</li>\n<li>Vollenhoven, C. Van, 1932, <em>The Framework of Grotius’\nBook De Iure Belli ac Pacis (1625)</em>, Amsterdam: Noord-Hollandsche\nuitgeversmaatschappij.</li>\n<li>Whewell, William, 1853, “Editor’s Preface”, in\nWilliam Whewell (ed. and trans.), <em>Hugonis Grotii de iure belli ac\npacis</em>, Cambridge: Cambridge University Press, iii–xvi.</li>\n<li>Wight, Martin, 1991, <em>International Theory: the Three\nTraditions</em>, Gabriele Wight and Brian Porter (eds.), Leicester:\nLeicester University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aquinas, Thomas",
            "ethics: natural law tradition",
            "Leibniz, Gottfried Wilhelm: ethics",
            "lying and deception: definition of",
            "political philosophy: medieval",
            "Pufendorf, Samuel Freiherr von: moral and political philosophy",
            "territorial rights and justice",
            "war"
        ],
        "entry_link": [
            {
                "../aquinas/": "Aquinas, Thomas"
            },
            {
                "../natural-law-ethics/": "ethics: natural law tradition"
            },
            {
                "../leibniz-ethics/": "Leibniz, Gottfried Wilhelm: ethics"
            },
            {
                "../lying-definition/": "lying and deception: definition of"
            },
            {
                "../medieval-political/": "political philosophy: medieval"
            },
            {
                "../pufendorf-moral/": "Pufendorf, Samuel Freiherr von: moral and political philosophy"
            },
            {
                "../territorial-rights/": "territorial rights and justice"
            },
            {
                "../war/": "war"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=grotius\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/grotius/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=grotius&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/grotius/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=grotius": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/grotius/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=grotius&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/grotius/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://www.historici.nl/Onderzoek/Projecten/BrievenVanHugoDeGroot1594-1645\" target=\"other\">Briefwisseling van Hugo Grotius</a>\n (in Dutch). A very useful website on Grotius’\ncorrespondence—including a searchable index of all the names in\nit, maintained at the Instituut voor Nederlandse Geschiedenis."
        ],
        "listed_links": [
            {
                "https://www.historici.nl/Onderzoek/Projecten/BrievenVanHugoDeGroot1594-1645": "Briefwisseling van Hugo Grotius"
            }
        ]
    }
}