{
    "url": "hate-speech",
    "title": "Hate Speech",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Luvell Anderson\n<lander04@syr.edu>\nMichael Barnes\n<Michael.barnes@anu.edu.au>",
        "author_links": [
            {
                "http://andersonluvell.weebly.com": "Luvell Anderson"
            },
            {
                "mailto:lander04%40syr%2eedu": "lander04@syr.edu"
            },
            {
                "https://michaelrandallbarnes.com": "Michael Barnes"
            },
            {
                "mailto:Michael%2ebarnes%40anu%2eedu%2eau": "Michael.barnes@anu.edu.au"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"http://andersonluvell.weebly.com\" target=\"other\">Luvell Anderson</a>\n&lt;<a href=\"mailto:lander04%40syr%2eedu\"><em>lander04<abbr title=\" at \">@</abbr>syr<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\n<a href=\"https://michaelrandallbarnes.com\" target=\"other\">Michael Barnes</a>\n&lt;<a href=\"mailto:Michael%2ebarnes%40anu%2eedu%2eau\"><em>Michael<abbr title=\" dot \">.</abbr>barnes<abbr title=\" at \">@</abbr>anu<abbr title=\" dot \">.</abbr>edu<abbr title=\" dot \">.</abbr>au</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Jan 25, 2022"
    ],
    "preamble": "\n\nHate speech is a concept that many people find intuitively easy to\ngrasp, while at the same time many others deny it is even a coherent\nconcept. A majority of developed, democratic nations have enacted hate\nspeech legislation—with the contemporary United States being a\nnotable outlier—and so implicitly maintain that it is coherent,\nand that its conceptual lines can be drawn distinctly enough.\nNonetheless, the concept of hate speech does indeed raise many\ndifficult questions: What does the ‘hate’ in hate speech\nrefer to? Can hate speech be directed at dominant groups, or is it by\ndefinition targeted at oppressed or marginalized communities? Is hate\nspeech always ‘speech’? What is the harm or harms of hate\nspeech? And, perhaps most challenging of all, what can or should be\ndone to counteract hate speech?\n\nIn part because of these complexities, hate speech has spawned a vast\nand interdisciplinary literature. Legal scholars, philosophers,\nsociologists, anthropologists, political theorists, historians, and\nother academics have each approached the topic with exceeding\ninterest. In this current article, however, we cannot hope to cover\nhow these many disciplines have engaged with the concept of hate\nspeech. Here, we will focus most explicitly on how hate speech has\nbeen taken up within philosophy, with particular emphasis on issues\nsuch as: how to define hate speech; what are the plausible harms of\nhate speech; how an account of hate speech might include both overt\nexpressions of hate (e.g., the vitriolic use of slurs) as well as more\ncovert, implicit utterances (e.g., dogwhistles); the relationship\nbetween hate speech and silencing; and what might we do to counteract\nhate speech.\n",
    "toc": [
        {
            "#WhatHateSpee": "1. What is Hate Speech?"
        },
        {
            "#HarmHateSpee": "1.1 The Harms of Hate Speech"
        },
        {
            "#ReliHatrAntiSemi": "2. Religious Hatred and Anti-Semitism"
        },
        {
            "#SlurCodeWordDogw": "3. Slurs, Code Words, and Dogwhistles"
        },
        {
            "#Slur": "3.1 Slurs"
        },
        {
            "#DogwCodeLang": "3.2 Dogwhistles and Coded Language"
        },
        {
            "#PornHateSpeeSile": "4. Pornography, Hate Speech, and Silencing"
        },
        {
            "#CounHateSpee": "5. Counteracting Hate Speech"
        },
        {
            "#CaseForBans": "5.1 The Case for Bans"
        },
        {
            "#ObjeBansSomeResp": "5.2 Objections to Bans, and Some Responses"
        },
        {
            "#SuppCounAlte": "5.3 The Supported Counterspeech Alternative"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. What is Hate Speech?\n\nThe term ‘hate speech’ is more than a descriptive concept\nused to identify a specific class of expressions. It also functions as\nan evaluative term judging its referent negatively and as a candidate\nfor censure. Thus, defining this category carries serious\nimplications. What is it that designates hate speech as a distinctive\nclass of speech? Some claim the term ‘hate speech’ itself\nis misleading because it wrongly suggests “virulent dislike of a\nperson for any reason” as a defining feature (Gelber 2017, 619).\nThat is not, however, the way in which the term is understood among\nmost legal theorists and philosophers. Perhaps it would be useful to\nstart with some examples.\n\nBhikhu Parekh (2012) lists the following instances as examples\ndifferent countries have either punished or sought to punish as hate\nspeech:\n\nShouting “[N-words] go home,” making monkey noises,\nand chanting racist slogans at soccer matches.\n“Islam out of Britain. Protect the British\npeople.”\n“Arabs out of France.”\n“Serve your country, burn down a mosque.”\n“Blacks are inherently inferior, lecherous, predisposed to\ncriminal activities, and should not be allowed to move into\nrespectable areas.”\n“Jews are conspiratorial, devious, treacherous, sadistic,\nchild killers, and subversive; want to take over the country; and\nshould be carefully watched.”\nDistribution by a political party of leaflets addressed to\n“white fellow citizens” saying that, if it came to power,\nit would remove all Surinamese, Turks, and other “undesired\naliens” from the Netherlands.\nA poster of a woman in a burka with text that reads:\n“Who knows what they have under their sinister and ugly looking\nclothes: stolen goods, guns, bombs even?”\nSpeech that either denies or trivializes the holocaust or other\ncrimes against humanity.\n\n\nRobert Post’s four bases for defining hate speech might help us\norganize the features of Parekh’s list:\n\nIn law, we have to define hate speech carefully to designate the forms\nof the speech that will receive distinctive legal treatment. This is\nno easy task. Roughly speaking, we can define hate speech in terms of\nthe harms it will cause—physical contingent harms like violence\nor discrimination; or we can define hate speech in terms of its\nintrinsic properties—the kinds of words it uses; or we can\ndefine hate speech in terms of its connection to principles of\ndignity; or we can define hate speech in terms of the ideas it\nconveys. Each of these definitions has advantages and disadvantages.\nEach intersects with the first amendment theory in a different way. In\nthe end, any definition that we adopt must be justified on the ground\nthat it will achieve the results we wish to achieve. (Herz and Molnar\n2012, 31)\n\n\nThe four definitional bases are in terms of: (1) harm, (2) content,\n(3) intrinsic properties, i.e., the type of words used, and (4)\ndignity. One could also attempt a hybrid definition by combining the\nways mentioned. But, as is made clear in Post’s remarks,\ndefinitions of this sort are relative to the interests of the definer;\n“We must evaluate the status of ‘hate speech’ so\ndefined in order to determine whether it achieves what we wish to\naccomplish and whether the harms of the definition will outweigh its\nadvantages” (Herz and Molnar 2012, 31). The upshot is a\nrejection of a univocal definition that captures “the\nessence” of hate speech as a phenomenon.\n\nIt is important to note that many definitions of hate speech will not\nfall squarely within the categories Post outlines. For instance, the\nUN’s International Convention on the Elimination of All\nForms of Racial Discrimination identifies hate speech both in\nterms of its content and its harmful consequences. Most definitions\ntend to characterize hate speech in multiple ways.\n\nHarm-based definitions conceive of hate speech in terms of the harms\nto which targets are subjected. Things like discrimination or\nlinguistic violence are candidates, though some (Gelber, 2017) argue\nthat hate speech can harm one’s ability to participate in\ndemocratic deliberation. Susan Brison (1998a) offers a disjunctive\ndefinition that centers on a kind of abuse to targets. She defines\nhate speech as “speech that vilifies individuals or groups on\nthe basis of such characteristics as race, sex, ethnicity, religion,\nand sexual orientation, which (1) constitutes face-to-face\nvilification, (2) creates a hostile or intimidating environment, or\n(3) is a kind of group libel” (313). ‘Harm’ as used\nby Brison refers to what Joel Feinberg describes “as a wrongful\nsetback to (or invasion of) someone’s interests” (Brison,\n1998b, 42).\n\nPerhaps an immediate reaction to disjunctive definitions of the sort\nBrison offers is skepticism about the definitiveness of the purported\nlist. When we go to test the definition’s application, we\ninvariably find contestable inclusions and exclusions. Recall the\nexamples from Parekh at the start of this section. Something like\n“Arabs out of France” might be included as an instance of\nhate speech on Brison’s account on the grounds that it creates a\nhostile or intimidating environment. Should statements that\ncommunicate a similar message in a less abrasive manner also be\nincluded? Suppose “Only French Nationals should occupy\nFrance” is roughly equivalent content-wise to “Arabs out\nof France.” If the former is indeed a less abrasive presentation\nthough communicating the same content as the latter, what are we to\nmake of its status? Many will find the statement odious; many will\nnot. And since it is certainly not a face-to-face vilification or form\nof group libel, classifying it as hate speech will depend on how\nlikely it is to create an intimidating or hostile environment.\n\nThe previous objection might entice one to opt for a content-based\nview. Content-based views define hate speech as that which\n“expresses, encourages, stirs up, or incites hatred\nagainst a group of individuals distinguished by a particular feature\nor set of features such as race, ethnicity, gender, religion,\nnationality, and sexual orientation” (Parekh, 2012, 40). This\nversion makes it easier to conceive of semantically equivalent\nstatements that differ in manner of presentation as instances of hate\nspeech.\n\nContent-based accounts face the challenge of determining which\ncontents meet this standard. If the content that distinguishes hate\nspeech from other types of speech must express, encourage, or incite\nhatred towards groups or individuals based on certain features, then\nthe proponent of this view will need an account of expression. Is the\nspeech in view that which signals the presence of a particular mental\nstate in the speaker (i.e., hate) or that which is likely to prime\nfeelings of animosity in a specific audience?\n\nAnother issue facing content-based approaches concerns distinguishing\nbetween speech that “respects ‘the decencies of\ncontroversy’” and that “which is outrageous and\ntherefore hate inducing” (Post, 2009, 128). The ability to\nexpress a wide range of views, even contentious ones, is a cherished\naspect of democratic societies. Failure to observe this distinction\nwould broaden the scope of what counts as hate speech perhaps too\nmuch. In order to make this distinction, one could follow Post in\ntying it to “ambient social norms” that distinguish\noutrageous and respectful behavior. One challenge though is in\ndetermining the content of those social norms. For instance, a\nminority group whose opinions have little impact on the makeup of\nnorms are unjustifiably excluded from influencing the shape of their\nsociety’s civility norms.\n\nDefinitions of hate speech based on intrinsic properties generally\nrefer to those that emphasize the type of the speech uttered. What is\nat issue is the use of speech widely known to instigate offense or\ninsult among a majority of society. Explicitly derogatory expressions\nlike slurs are paradigmatic examples of this type of view. In general,\nthe type of speech identified on this account is inherently\nderogatory, discriminatory, or vilifying.\n\nThough attractive at first glance, classifying hate speech along these\nlines might prove to fall short in two ways. First, defining hate\nspeech in this way might be too constricting. Some of the examples in\nour initial list would seem not to count as hate speech since they\narguably lack the intrinsic features. “Arabs out of\nFrance,” for example, does not contain explicitly slurring\nterms. And second, this definition might prove too expansive. In cases\nwhere slurs are reappropriated by members of the target group or where\nartists incorporate them into a creative work, it would appear odd to\ncount these as instances of hate speech. The concern is tied\nspecifically to locating the issue in the terms themselves, as opposed\nto the use to which the terms are put.\n\nPerhaps a final challenge to intrinsic property views can be derived\nfrom the work of Judith Butler (1997). On Butler’s account, hate\nspeech is a kind of performative that is “always delivered\ntwice-removed, that is, through a theory of the speech act\nthat has its own performative power” (96). More specifically,\n“[w]hat hate speech does … is to constitute the subject\nin a subordinate position” (19). Butler locates the trouble with\nhate speech in its perlocutionary effects, a concept\nintroduced by J.L. Austin that refers to the effects a speech act can\nhave on its audience. An example of a perlocutionary effect is feeling\namused at a joke or frightened from the telling of a ghost story.\nUnlike with intrinsic property definitions, Butler shifts focus to the\nnature of the acts performed rather than the terms in use. (For a\ncritical look at Butler’s account, see Schwartzman (2002).)\n\nLastly, dignity-based conceptions focus primarily on the role of harms\nto the dignity of targets of hate speech. For instance, both Steven\nHeyman (2008) and Jeremy Waldron (2014) appeal to dignity in their\naccounts. Broadly speaking, hate speech on this kind of conception\namounts to speech that undermines its target’s “basic\nsocial standing, the basis of [their] recognition as social equals and\nas bearers of human rights and constitutional entitlements”\n(Waldron, 2014, 59). This conception of hate speech will also include\ncharacterizations in terms of group defamation or group libel. Section\n130 of Germany’s penal code is an example of legislation that\nincorporates a dignity-based conception of hate speech, prohibiting\n“attacks on human dignity by insulting, maliciously maligning,\nor defaming part of the population” (see Waldron, 2014,\n8).\n\nWorries about application follow dignity-based conceptions as well.\nFirstly, there may be questions about how we, in particular instances,\nare to distinguish between false statements about a group as a whole\nand those about a particular member of a group (Brown, 2017a).\nPresumably, only the former is consistent with an understanding of\nhate speech as a group-based phenomenon. Secondly, an implication of\nthe view appears to be that it expands the range of things that would\ncount as hate speech. Any speech that calls into question the basic\nstanding of certain groups falls under this notion, which may make it\nmore difficult to distinguish between contentious political speech and\nhate speech.\n\nPerhaps a lesson to draw from the profusion of disjunctive definitions\nis a general skepticism about a definitive description of hate speech.\nWe might concur with Alexander Brown that ‘hate speech’ is\nan equivocal term denoting a family of meanings (Brown 2017b, 562).\nAccording to Brown, ‘hate speech’ isn’t just a term\nwith contested meanings, but rather, it is “systematically\nambiguous; which is to say, it carries a multiplicity of different\nmeanings” (2017b, 564). Because the expression is what is\ntypically referred to as an essentially contested term, the hunt for a\nunivocal or universal definition is futile.\n1.1 The Harms of Hate Speech\n\nThe harms that have been attributed to hate speech comprise a long and\nvaried list, ranging from the immediate psychological harms\nexperienced in the moment by the person(s) targeted by an instance of\nhate speech, to much more long-term impacts that affect not only those\ntargeted but whole communities, and even the strength of an entire\nnation.\n\nA distinction between “assaultive hate speech” and\n“propagandistic hate speech” is helpful when discussing\nthese harms (Langton 2012; 2018a; see also Gelber and McNamara (2016)\nwho discuss “face-to-face encounters” and\n“incidences of general circulation”). Hate speech yelled\nat an individual on the street, or from a passing car, is a\nface-to-face encounter, and an assaultive speech act. This is,\nmoreover, most often inter-group hate speech, where the speaker(s)\nare, for example, white, and the targets are non-white. On the other\nhand, propagandistic hate speech is often intra-group speech,\nspoken by members of one group to fellow ingroup members (e.g., a\nwhite person to other white people). The newsletter of the KKK,\ntherefore, would fit into this category.\n\nWhile this distinction is helpful to keep in mind, it should also not\nbe overstated. Summarizing the results of their study which surveyed\nthe experiences of the victims of hate speech, Katharine Gelber and\nLuke McNamara conclude that “the distinction between\nface-to-face encounters and general circulation hate speech is not\nalways clear in the everyday experiences of racism endured by\ntargets” (2016, 326). Any one instance of hate speech might fall\ninto both categories. For example, it may occur in its first instance\nas an assaultive speech act, and then reports of the event may then\ntake on a propagandistic aspect, as it is spread among the community.\nSimilarly, even if an instance of hate speech is intended as a piece\nof propaganda, it may, when encountered by a member of the community\nit disparages, be akin to assaultive speech.\n\nStill, this distinction helps reveal the wide range of the types\nof speech acts that are plausibly harmful, and also offers\ninsight into how they harm. For example, Waldron (2014)\nfocuses mainly on hate speech in its propagandistic mode, which he\nargues undermines the public assurance of equal social standing that\nmembers of non-dominant communities are entitled to—in his\nterms, their assurance of dignity. On this view, public hate\nspeech—e.g., flyers that read ‘Muslims\nOut!’—is “an environmental threat to social peace, a\nsort of slow-acting poison, accumulating here and there, word by\nword” (2014, 4). Its harm is therefore one that attacks the\nbroader society, and not just individuals targeted by hate speech.\n\nOn the other hand, the essays in the classic Words that Wound\ntend to focus more on what its authors term “assaultive\nspeech,” that is, “words that are used as weapons to\nambush, terrorize, wound, humiliate, and degrade” (Matsuda et\nal. 1993, 1). This leads them to focus more on hate speech’s\nability to produce “direct, immediate, and substantial\ninjury” (Lawrence, 1993, 57), such as “immediate mental or\nemotional distress” (Delgado, 1993, 93–94). On this\napproach, the most evident harms of hate speech are psychological.\nThese psychological injuries scale up, however, when hate speech is\nendemic, and so result in the types of community or social harms\nhighlighted by authors like Waldron. For this reason, the distinction\nbetween these approaches may be thought of as more a matter of\nemphasis.\n\nThis relationship between individual harms and broader social harms is\nalso evident once we acknowledge the long-term effects of hate speech\non victims, in addition to its more immediate impacts (Delgado and\nStefancic, 2004, 14). Victims of hate speech may first experience\n“psychological symptoms and emotional distress” like\nheightened stress and fear in the immediate aftermath of assaultive\nhate speech, but they may also experience far-ranging consequences if\nthey “modify their behavior and demeanor” to avoid\nreceiving further hate messages, limiting their ability to participate\nfully in society (Matsuda, 1993, 24). Gelber and McNamara’s\ninterview subjects confirm this complex web of effects that hate\nspeech may cause, highlighting how “harms are often enduring and\nnot ephemeral” (2016, 336). In this way, hate speech is both an\nimmediate attack on one’s health and dignity, along with a\nthreat to their community’s position in society. The cumulative\neffect of hate speech events, therefore, is a collection of harms\nlocated both in individuals and communities, which blurs the\ndistinction between assaultive and propagandistic hate speech\nevents.\nConstitutive and Consequential Harms\n\nAnother distinction which is similarly helpful, but also fraught, is\nthe distinction between constitutive and\nconsequential harms—that is, harms that occur\nin the saying of some utterance of hate speech, and those\nthat are its downstream results (see Maitra and McGowan, 2012, 6).\nThis distinction draws on the speech act theory of J.L. Austin (1962)\nand has served an important role in the examination of hate speech\nfrom feminist philosophers of language (see, e.g., Langton, 1993;\n2012; Maitra and McGowan, 2012; Maitra, 2012; McGowan, 2004; 2009;\n2012; 2019; and others). Constitutive harms are those that correspond\nto what Austin called the illocutionary act, the act\nperformed in saying X, while consequential harms correspond\nto perlocutionary effects, the results brought about by\nsaying X. Most (though not all) of the harms surveyed above\ncomprise consequential harms, as items such as psychological injury,\nfeelings of fear, and societal withdrawal all most naturally fall into\nthe perlocutionary effects category.\n\nHowever, philosophers have also drawn attention to how hate speech can\ninjure in a different way by indirectly affecting the positions of the\nsocial groups targeted by hate in a social hierarchy. That is,\n“by fixing facts about the distribution of social power,\nincluding facts about who has this power, and who lacks it” hate\nspeech harms in a way not captured in the above account of individual\ninjuries and their cumulative effects (Maitra and McGowan, 2012, 7).\nThis is an immediate harm that occurs in the saying of the\nspeech act, which (given appropriate circumstances and uptake)\nproduces a shift in the normative landscape. It is in this way that an\ninstance of hate speech may not only cause the injuries surveyed above\nbut may also, for example, rank Indigenous Peoples as\ninferior, legitimate discriminatory behavior towards them\n(perhaps via incitement), or potentially silence them. (We\nreturn to the notion of silencing as an illocutionary harm of hate\nspeech in Section 4 below.)\n\nOne reason to direct our attention towards the constitutive harms of\nhate speech is its potential to productively advance the debate over\nthe legitimacy of potential restrictions. Mary Kate McGowan (2009) has\nmade this case most explicitly. “Rather than focus on what a\ncertain category of speech causes,” she writes, we ought to be\n“interested in what such speech actually does, in and of\nitself” (2009, 389–90). The idea here is that by focusing\nonly on the harms caused by hate speech, we are inevitably\ndrawn into a debate about balancing the costs and benefits of\npermitting or regulating speech, which often leads to an impasse.\nAlternatively, turning our attention to the acts hate speech\nconstitutes can reveal features that help us avoid question of\nbalancing harms, and opens the door to regulation. On this approach,\nsome instances of hate speech can be seen to constitute acts of\n(verbal) discrimination, and should be considered analogous to other\nacts of discrimination—like posting a ‘Whites Only’\nsign up at a hotel—that US law recognizes as illegal. As a\nspeech act, hate speech can enact discriminatory rules in much the\nsame way the physical sign does, and so ought to similarly be\nrestricted (McGowan, 2012). This argument proceeds by a development of\nAustin’s notion of “exercitives,” which are speech\nacts that enact rules in a given domain, and is one example of the\nfruitful use of speech act theory to the philosophy of hate\nspeech.\n\nAt the same time, however, it’s worth acknowledging that the\ndistinction that this analysis relies on—between illocutionary\nacts and perlocutionary effects—is one that some argue is\nuntenable (for one example, see Kukla, 2014). As illocutionary acts\nare indeterminate or incomplete without some form of audience uptake,\nit is difficult to articulate precisely how we ought to distinguish a\nspeech act’s effects from its inherent qualities. Furthermore,\nthe testimonials of victims of hate speech “suggests that there\nis a close and complex relationship between constitutive and\nconsequential harms, and the harms are experienced cumulatively”\n(Gelber and McNamara 2016, 336–37). As such, any attempt to draw\ntoo neat of a distinction between these two types of harm risks\nmisrepresenting victims’ experiences, and might tie the attempt\nto restrict hate speech unhelpfully to a philosophically contested\ndistinction.\n\nAs a result, some caution must be applied when marking too stark of a\ncontrast between these harms. Much like the distinction between\nassaultive and propagandistic hate speech, then, we can consider the\ndistinction between consequential and constitutive harms to be\nanalytically helpful in exploring the variety of harms attributable to\nhate speech, while recognizing that it is at the same time an\nabstraction from the on-the-ground realities of hate speech.\n2. Religious Hatred and Anti-Semitism\n\nReligious belief is sometimes the source of putative cases of hate\nspeech, and sometimes its target. In both cases, assessing the\nconceptual addition of religion to hate speech is a difficult task.\nSpeech rooted in religious conviction is sometimes subjected to\nscrutiny to determine whether instances should count as hate speech or\nnot. For instance, the Westboro Baptist Church’s demonstrations\noften make use of slurs and other explicitly defamatory language. This\nis an extreme case, which can be accommodated by extant hate speech\nlegislation. Other cases, however, involve religious leaders making\ncontentious statements—for instance, questioning the legitimacy\nor recognition of LGBT+ individuals, while claiming these are\nstatements of love, not hate. Questions about religious speech of this\nsort concern whether it is simply contentious speech liberal\ndemocratic societies must tolerate or speech that runs afoul of deeply\nheld norms that ought to be proscribed.\n\nSome wonder whether religious sensibilities should be afforded special\nprotection from offense. Amnon Reichman (2009), for instance, notes\nthat some Israeli scholars have argued that providing special\nprotection for religious beliefs is a good idea “so as not to\npush [religious] believers into having to choose between the authority\nof the state and the authority of their religion (namely, the\nauthority of God)” (338). This relies on an assumption that\nreligion is an institutionalized normative regime in competition with\na legal regime where clashes over religious beliefs threaten the\nsocial fabric of society. It is in turn prudent to mitigate such\nclashes in order to avoid situations of unrest like the incidents\ninvolving comedic cartoons of Mohammed in the Dutch newspaper\nJyllands-Posten and the French publication Charlie\nHebdo.\n\nIt is not clear, however, that religious beliefs warrant special\nprotection over other forms of belief that may be just as strongly\nheld. Clashes over deeply held political beliefs can pose a similar\nthreat to the social fabric as religious beliefs. Thus, there is no\nreason to think the same concern should not apply quite broadly.\nProviding certain types of speech special protection on these grounds\nwould threaten to introduce quite repressive legislation on speech in\ngeneral.\n\nHolocaust denial, denial of the Armenian Genocide, and the denial of\nother crimes against humanity have also been the subject of special\nlegislation, especially in Europe. As Michael Whine (2009) notes, 16\nEuropean states, as well as Israel, have criminalized Holocaust denial\n(543). In these contexts, at least one rationale for banning speech\nthat denies or trivializes the Holocaust concerns its role in inciting\nhatred (Altman, 2012). One possible justification for such legislation\nrests on claims about what denial speech is. According to Martin\nImbleau (2011), denial speech poses as an historical endeavor but is\nreally propaganda. The denier’s aim is to “eradicate the\nawareness of the truth that prevents the resurgence of past criminal\nideologies” (2011, 238). But if this is the rationale, it\npotentially opens up justifications for much broader application since\nsimilar claims might be made of other forms of propaganda. (For a\ngeneral overview on Holocaust denial, see Robert Wistrich (2012) and\nBehrens et. al (2017).)\n3. Slurs, Code Words, and Dogwhistles\n\nAs Parekh, Brison, and others have noted, hate speech can be expressed\nboth explicitly and subtly. We can identify a few different\nexpression-types that map onto the explicit and subtle instances,\ni.e., slurs, code words, and dogwhistles.\nThe subtler forms may fall outside the scope of narrower conceptions\nof hate speech.\n3.1 Slurs\n\nPerhaps the type of expression most often cited as the paradigm case\nof hate speech is slurs. Slurs are typically characterized as a type\nof insult that targets race, gender, sexual orientation, nationality,\nability, politics, immigrant status, geographic region, and other\ncategories. Much of the literature on slurs focuses primarily on the\nsemantic and pragmatic properties of this linguistic class, with the\nexpectation that such analyses also provide an account of how they in\nfact derogate their targets. There are, of course, competing accounts,\nsome of which may be better suited than others for the purposes of\nlegal and ordinary concepts of hate speech.\n\nBefore delving into competing accounts, it is good to put a working\ndefinition of ‘slur’ on the table. Typically, slurs are\nunderstood as conventionalized ways of demeaning and derogating\nindividuals or groups of individuals and are contrasted with a\nco-referring neutral counterpart (Jeshion, 2013a; 2013b; Camp, 2013;\nCepollaro, 2015). For instance, the following differ in regard to\noffense but are otherwise taken to make similar claims,\n\n(3.1)\nCrackers make up about 80% of Congress.\n(3.2)\nWhite people make up about 80% of Congress.\n\n\nFor many, (3.1) is regarded as offensive whereas (3.2) is simply a\ndescriptive statement. The expression ‘cracker’ in (3.1)\nis a slur, while ‘white people’ in (3.2) is its purported\nneutral counterpart.\n\nThough there seems to be widespread consensus that slurs have or could\nhave neutral counterparts, not everyone shares this sentiment. Lauren\nAshwell (2016), for example, denies that neutral counterparts (which\nshe refers to as ‘neutral correlates’) play an essential\nrole in identifying slurs. Ashwell claims that gendered slurs like\n‘bitch,’ ‘slut,’ and ‘sissy’\nderogate in ways similar to racial and ethnic slurs like\n‘n***er,’ ‘k*ke,’ ‘cracker,’ and\n‘sp*c,’ yet lack neutral counterparts. As a result, a\ndefinition need not include reference to neutral counterparts. In\nfact, making neutral counterparts central to defining slurs renders\none incapable of accounting for terms that function similarly to slurs\nyet lack this purportedly central feature.\n\nAshwell makes a compelling case for the claim that gendered slurs lack\nneutral counterparts. Her larger claim that counterparts’\ninessentiality for defining slurs has implications for pragmatic and\nsemantic accounts that are also worth taking seriously. According to\nAshwell, both sorts of accounts depend on the existence of neutral\ncounterparts in their explanations of slurs.\n\nExisting pragmatic accounts of slurs’ derogating capabilities\nare in particular trouble, for they tend to hold that a slur’s\nsemantic contribution to a sentence is identical to the contribution\nthat its neutral correlate would have had if it were used instead.\nThis kind of account also leaves open the possibility that the slur\ncould be sanitized—cleansed of its derogatory\naspect—without semantic meaning change. … Existing\nsemantic accounts, however, are not much better off—they are\nalso structured to require the existence of a neutral correlate.\n(2016, 229)\n\n\nFor Ashwell, pragmatic and semantic accounts of slurs structurally\nrequire neutral counterparts, and so simply cannot jettison them.\nOne response proponents of these kinds of accounts could give is that\nthe gendered insults Ashwell highlights might exhibit properties that\ncall their status as slurs into question. It could be open to these\ntheorists to suggest that the terms they have identified as a matter\nof fact do carry neutral counterparts, that this is part of what\ndistinguishes them as a class. And while the expressions Ashwell\nidentifies seem to pattern in some ways like slurs, they also exhibit\nfeatures that make them dissimilar. Thus, there is no need to wedge\nall insulting expressions into one class; there is room to expand our\nclassifications in a way that preserves clarity.\n\nAnother important issue about slurs is their power to offend. Part of\nwhat makes them prime candidates for paradigmatic instances of hate\nspeech is a widespread belief in their offensive potency. Indeed, much\nof the literature on slurs simply assumes they are offensive without\noffering much (if any) defense of that claim. It is not always clear\nwhether the reader is supposed to understand offense as the\nprovocation of a disliked mental state or as the violation of\nwidely-accepted public norms.\n\nRenée Bolinger (2017) discusses three ways to understand the\nclaim that slurs are offensive:\n\nAn audience actually took offense at a slurring utterance;\nThe utterance warranted offense;\nWhether or not offense was warranted, it was rational for the\naudience to take offense.\n\n\nThe sense of ‘offense’ in (1) tracks how audiences\nactually respond at the moment of utterance. This could not be the\nsense in which offense is understood for at least two reasons. First,\ndoing so would make the claim ‘slurs are offensive’ too\nstrong. Since we would be tracking cases of actual offense, we would\nbe focusing on particular uses of slurs, explaining what\nmakes those utterances offensive rather than explicating the\noffensiveness of a linguistic class. As a result, the most natural\ninterpretation of the claim would be that slurring utterances are\ninvariably offensive, i.e., the use of slurs always provokes disliked\nmental states.\n\nThis, of course, raises a couple of questions. To begin with, does the\nstrong claim deny the existence of non-offensive slur uses? Given\nthings like linguistic reappropriation, some instances of indirect\nreports, and even instances of direct reports—especially by\nmembers of the slur’s targeted group—in which it is\npossible to utter slurs without provoking a disliked mental state in\nthe speaker’s audience, the claim is obviously false. Further,\nthere are also questions about who constitutes the audience.\nIs the relevant audience the one intended by the speaker? Everyone who\nwitnesses the utterance? Only those who are present in the utterance\nsituation? Because the claim must now be understood to be about\nparticular slur utterances rather than the linguistic type, the claim\nmust reflect the diversity of reactions provoked by different\ntokenings of slurs. A second reason is related to the questions about\nthe audience: does everyone in the audience have to be offended, or is\nit sufficient if one, some, or a few are? What is the scope of the\nclaim with respect to offended reactions? The answers to these\nquestions will likely render the strong version of the claim untenable\nand weaker versions suspect. Thus, it is probably not the sense of\n‘offense’ one should start with.\n\nThe sense expressed in (2) concerns moral justification for taking\noffense. Bolinger identifies three grounds for warranted offense at an\nutterance: intention, inappropriateness, and associations. A speaker\nmay intend to offend, often doing so with expressions that are taboo,\nand thus considered inappropriate. Vulgar expletives like\n‘fuck,’ ‘dick,’ or ‘shithead’ are\ntypically viewed as inappropriate terms, at least in certain\n“polite” settings. Some expressions, like slurs, are not\nonly inappropriate, but also carry associated attitudes and/or\npractices that amplify their offense. The swastika and confederate\nflag, for example, are both deeply associated with oppressive and\ngenocidal practices towards Jewish people and African Americans,\nrespectively.\n\nThis sense of offense still concerns one’s response to\nsomething, though it is not simply about how one reacts but\none’s warrant to do so: “An utterance may warrant, but\nfail to actually generate offense merely because either there is no\nhearer, or the hearer fails to find the utterance offensive (perhaps\nbecause she shares the offensive attitude, fails to take it seriously,\nor misinterprets the utterance)” (Bolinger, 2017, 441). Bolinger\nnotes that the associational offense category in particular is the one\nthat is often the subject of hate crime legislation (ibid., 442). Such\nterms are often backed by formal social institutions,\n“adequately visible practices,” or a combination of\nboth.\n\nIn (3), Bolinger uses ‘rational’ or ‘license’\nto refer to the epistemic justification an audience has in\ntaking offense at a slurring utterance. Here a gap opens up between\nwhat an audience member may be warranted in taking offense at as\nopposed to when it may be rational to do so. For instance, if a\nnon-native speaker used a slur to refer to someone and we come to find\nout they were ignorant of the expression’s status as a slur, the\ntarget would still have been rational to take offense even if\nunwarranted. Undoubtedly, any of the three senses discussed may factor\ninto an explanation of a given slur’s offense. However, theories\nof slurs are more appropriately aimed at capturing warranted and\nrational offense.\n\nConsider again the following pair of statements:\n\n(3.1)\nCrackers make up about 80% of Congress.\n(3.2)\nWhite people make up about 80% of Congress.\n\n\nThe most straightforward explanation of the difference between (3.1)\nand (3.2) is that ‘cracker’ differs in some\nsemantic respect from ‘white people’. Two of the\nmost well-known versions of this approach are from Chris Hom (2008)\nand Elisabeth Camp (2013). On Hom’s account,\n‘cracker’ as opposed to ‘white people,’\ncontains derogatory content. Slurs’ derogatory content is\ndetermined by the social institutions that undergird them, which\nconsists of two components: an ideology and a set of\npractices. Hom defines an ideology as “a set of (usually)\nnegative beliefs about a particular group of people” (431). As\nfor the set of practices, these are racist practices that “can\nrange from impolite social treatment to genocide” (ibid.). The\ntwo components combine to produce slurs’ semantic content, which\ncontains a normative claim about the way individuals ought to be\ntreated, because of possessing certain characteristics in virtue of\nbeing a member of an identifiable social group. (For alternative\naccounts of the relationship between slurs and ideology, see Kukla\n(2018) and Swanson (2015, Other Internet Resources).)\n\nThe pair of sentences in the example used here is illustrative of an\nobservation many will have noticed when considering different\nexamples. The slur in (3.1) is typically experienced as less offensive\nthan ones that target members of marginalized groups. Language users\nrecognize variation in offensive potency among slurs, some being more\noffensive than others. Hom refers to this as derogatory\nvariation. Difference in the virulence of those backing racist\ninstitutions explains variation in offense on Hom’s account.\nThus, ‘cracker’ is less offensive than slurs like\n‘n***er,’ ‘sp*c,’ and ‘f*g’\nbecause the racist and homophobic institutions backing them are much\nmore virulent. (One might also wonder if there is any racist\ninstitution backing slurs for members of dominant groups at all.)\n\nOne objection raised against Hom’s view is that the semantic\ncontent he proposes of slurs is overwrought (Jeshion, 2013b). Robin\nJeshion argues that Hom’s view “attributes highly specific\nsets of ideologies and modes of treating the group, yet it is doubtful\nthat anything so semantically rich and well defined is semantically\nencoded in the slur” (318). That is, it is doubtful the racist\nmeans anything this racialized. Jeshion denies that slurs\nexpress anything as robust as Hom claims.\n\nCamp offers an alternative semantic account in which slurs bear a\nclose relationship to a perspective, which are\n“open-ended ways of thinking, feeling, and more generally\nengaging with the world and certain parts thereof” (2013,\n335–336). According to Camp, a speaker’s slur use\n“signals a commitment to an overarching perspective on the\ntargeted group as a whole” (ibid., 337). The perspective is a\nnegative one that highlights certain characteristics or properties\nspecifically associated with particular groups, ones that are presumed\nto warrant certain affective and evaluative responses.\n\nWhat makes slurring perspectives a semantic feature for Camp is that\nthey do not “merely signal … allegiance to a certain\nperspective,” but do so “in an overt and nondefeasible\nway, precisely in virtue of employing that expression” (ibid.,\n340). The use of a slur inserts a willful and noncancelable way of\nthinking about the target into a conversation. This is codified in the\nexpression itself, and not something audiences “figure\nout” through the use of pragmatic mechanisms. This appears to be\nbolstered by the fact that one typically cannot erase a slur’s\nderogation by following up with a statement intending to do so,\ne.g.,\n\n(3.3)\nThey gave the job I applied for to a s**c, but I don’t\nmean to suggest there is anything bad about being Hispanic.\n\n\nThe tension of the contrast is one an audience might generally think\nfinds its source in the meaning of the slur itself, rather than from\nfeatures that emerge from the way language is used in a particular\ncontext. Further, as we saw in Jeshion’s objection to\nHom’s view, the information slurs manage to convey isn’t\nvery specific. This point is consistent with the open-ended nature of\nthe perspectives Camp associates with slurs.\n\nThough Camp’s account represents a marked improvement, critics\nstill see shortcomings they believe should give us pause. Geoff\nNunberg (2018), for instance, argues that Camp’s\ncharacterization of perspectives is too vague to capture the more\nspecific colorings of slurs for specific groups: “Whatever\ndistinguishes redskin from injun or nigger\nfrom coon, it’s more precise and richer than simply a\ndisposition to think about the referents in certain ways”\n(Nunberg, 2018, 260–261). According to Nunberg, what is central\nfor how slurs work is not the perspective the user employs to think\nabout their target, but the allegiance it signals to a group or\ncommunity disposed to think negatively of the target.\n\nTo take an obvious case, when you call a woman a shiksa you’re\nnot just allying yourself with a disposition to think about gentile\nwomen in certain ways, but with the people who have that disposition.\nThat group affiliation is primary and prior to the perspective it\nevokes: you can use shiksa appropriately without having any\nspecific views of gentile women at all, but not without identifying\nwith Jews. (ibid., 261)\n\n\nFor some theorists, the accounts offered by Hom and Camp leave out\nwhat they regard as an important aspect of slurring, namely, the role\nattitudinal expression plays in their derogatory power. These views\nagree that the difference between slurs and their purported\ncounterparts is located in the realm of semantics; the previous\naccounts just leave out an important aspect. Jeshion (2013a)\nidentifies three components of slurs’ semantics: (i) a\ntruth-conditional component, (ii) an expressivist\ncomponent, and (iii) an identifying component. The\ntruth-conditional component of slurs corresponds to the same group\nreferenced by its purported neutral counterpart. The expressivist\ncomponent captures slurs’ ability to express contempt towards\nmembers of socially relevant groups in virtue of their group\nmembership. Finally, the identifying component ascribes a property to\nthe group that is seen as central to its identity. Mark Richard (2010)\nalso proposes a view in which negative attitudes are included in the\nexplanation of what slurs express. Jeshion and Richard’s\naccounts are typically referred to as expressivist views.\n\nOne issue expressivist views have been thought to have trouble with is\nderogatory variation. Derogatory variation refers to the\nsociolinguistic datum that slurs vary in their offensive potency. If\nwe represent degrees of offense on a scale, slurs like\n‘n***er’ and ‘k*ke’ are higher up on the scale\nthan slurs like ‘cracker’ and ‘wop.’\nExpressivist views have typically attributed one sort of attitude to\nslurs—contempt—which seems inadequate to capture\nthe complexity of their offense profiles. For instance, consider\nco-referring slurs that vary in offense. Expressivist accounts appear\nto lack the resources to account for this variation. Thus,\nexpressivism fails as an account of slurs for this reason.\n\nJeshion (2013a) attempts to answer this objection by arguing that her\nexpressivist view “is only incompatible with versions of\nderogatory variation that stipulate that the variation derives from\nthe semantics” (243). Jeshion maintains that focusing on\nslurring terms rather than particular utterances of those terms causes\nus to reflect on various factors at play that contribute to their\npower to offend. In effect, such focusing obscures the various factors\nbrought to bear on judgments of offensiveness. Thus, Jeshion claims we\nought to think our intuitive judgments about varying offense support\nthe following thesis:\n\nDerogatory Variation-Utterance:\n\nUtterances of different slurring terms engender different degrees of\nintensity of offensiveness. (2013a, 244)\n\n\nJeshion argues that this thesis is compatible with her account because\nweaponized uses of slurs are offensive for several reasons: semantic,\npragmatic, sociocultural, and historical. As a result, there should be\nno expectation that a semantic view like hers need explain derogatory\nvariation semantically.\n\nInferentialism describes slurs in terms of the kinds of\ninferences they license. Proponents of this kind of view include\nRobert Brandom (1994), Michael Dummett (1993), Lynne Tirrell (1999)\nand Daniel Whiting (2008). Tirrell, for instance, remarks that the\n“meaning of a word or expression is a matter of its various\nactual and possible sentential roles” (1999, 46). In\ncharacterizing the meaning of the now-outdated slur\n‘boche,’ Dummett remarks,\n\nThe condition for applying the term to someone is that he is of German\nnationality; the consequences of its application are that he is\nbarbarous and more prone to cruelty than other Europeans. We should\nenvisage the connections in both directions as sufficiently tight as\nto be involved in the very meaning of the word: neither could be\nsevered without altering its meaning. (1993, 454)\n\n\nOn Dummett’s account, to know the meaning of ‘boche’\nis to make the inference from the referent being German to his being\nbarbarous and more prone to cruelty than other Europeans.\n\nInferentialism also has its challenges. Timothy Williamson (2009), for\nexample, opposes inferentialism by charging that it has difficulty\nexplaining how non-bigots, who are not disposed to draw negative\ninferences, still understand their use. “We find racist and\nxenophobic abuse offensive because we understand it, not because we\nfail to do so” (257). We should note the inferentialist is not\nwithout resources to respond to Williamson’s charge. For\nexample, Brandom’s (1994) inferentialism determines\nunderstanding in terms of grasping the broad network of inferential\nconnections in which an expression is situated. An important\nimplication is thought to be that different speakers will understand\nthe expression similarly while associating it with different\ninferential roles, escaping Williamson’s charge that one must be\ndisposed to draw slurring inferences to understand the term (see\nSteinberger and Murzi, 2017). However, Brandom’s view is itself\ncontroversial (For further objections to inferentialism, see Anderson\nand Lepore (2013b); Hornsby (2001).)\n\nThe last view we mention here is a stark alternative to the previous\naccounts, opting for a socioculturally-driven explanation. According\nto Luvell Anderson and Ernie Lepore, slurs are prohibited expressions\nwhose tokenings provoke offense from those who value and respect their\nprohibitions: “What’s clear is that no matter what its\nhistory, no matter what it means or communicates, no matter who\nintroduces it, regardless of its past associations, once relevant\nindividuals declare a word a slur, it becomes one” (2013a,\n39). The prohibition is meant to apply not only to uses but\nmentions of expressions as well, including direct and\nindirect reports.\n\nOne objection raised against prohibitionism comes from Camp (2018).\nCamp asserts that though the view is simple and powerful, “it\nthreatens to work too well” by failing to account for some\ncomplexities. In particular, Camp claims “slur’s\ntruth-assessibility and projective behavior are more variable than\n[prohibitionism] predicts” (2018, 33). She believes, for\ninstance, that it is sometimes easy to “quarantine” a\nslur’s offensiveness within a report like,\n\nJohn thinks that the s**cs will have taken over the whole neighborhood\nin another couple years. But of course, I think it’s great that\nwe’re developing such a vibrant Latino community.\n\n\nThe offense of the slur in this statement is judged to be relativized\nto John rather than the person reporting it.\n\nWhich view of slurs one adopts has implications for how one conceives\nof their harm. For instance, adopting a content-based view of slurs\nmay encourage one to adopt a content-based definition of hate speech,\nwhich suggests that the harm produced is in the message being\ncommunicated. Adopting an expressivist view, on the other hand, could\nlead one to lean more towards an intrinsic property account. (For\nfurther alternative accounts to the ones mentioned in this section,\nsee Popa-Wyatt & Wyatt (2017), Bach (2018), Croom (2011),\nKirk-Giannini (2019), and Neufeld (2019).)\n3.2 Dogwhistles and Coded Language\n\nIn addition to slurs, which are explicitly derogatory, researchers\nhave also focused on more implicit forms of derogatory communication.\nTali Mendelberg (2001), Ian Haney Lopez (2015), Jennifer Saul (2018)\nand Justin Khoo (2017) detail the use of racially coded\nlanguage—dogwhistles—to access existing racial\nresentment while making surreptitious racial appeals. Saul provides a\nuseful set of distinctions for thinking about dogwhistles: they can be\nexplicit or implicit, and further,\nintentional or unintentional. Saul uses the work of\nlinguist Kimberly Witten to define an overt intentional\ndogwhistle as,\n\na speech act designed, with intent, to allow two plausible\ninterpretations, with one interpretation being a private, coded\nmessage targeted for a subset of the general audience, and concealed\nin such a way that this general audience is unaware of the existence\nof the second, coded interpretation. (2018, 362)\n\n\nSaul illustrates this kind of dogwhistle with an example from George\nW. Bush’s 2003 State of the Union speech:\n\n(3.4)\nYes there’s power, wonder-working power, in the goodness and\nidealism and faith of the American people.\n\n\nThe phrase ‘wonder-working power’ is meant as an overt\nintentional dogwhistle for Evangelical Christians. According to Saul,\nthere are two possible messages Evangelicals can take away from\nBush’s utterance. The first message is simply a translation:\n\nYes there’s power, the power of Christ, in the goodness and\nidealism and faith of the American people. (362)\n\n\nThe second message is that Bush identifies with them, that he speaks\ntheir language. Saul thinks both are instances of overt intentional\ndogwhistles.\n\nA covert dogwhistle, according to Saul, is “a\ndogwhistle that people fail to consciously recognize” (2018,\n365). She is particularly interested in how covert intentional\ndogwhistles work in tandem with what psychologists have referred to as\nracial resentment, a belief system that is measured by the\ndegree to which participants agree to the following four claims:\n\nBlacks no longer face much discrimination;\nTheir disadvantage mainly reflects their poor work ethic;\nThey are demanding too much too fast;\nThey have gotten more than they deserve. (2018, 364 quoting Tesler\n& Sears 2010, 18)\n\n\nAccording to Mendelberg, racial resentment remains widespread among\nwhite Americans even though explicitly racist appeals have come to be\nviewed as outside the bounds of acceptable political speech. (At\nleast, that seemed to be the case up until the 2016 presidential\nelection cycle.) White voters, on this model, tend to shy away from\naccepting explicitly racist proposals because they do not want to\nthink of themselves as racist. The existence of racial resentment\nallows for the skilled intentional use of utterances that are\nunrelated to race on the surface yet access negative racial attitudes\nin a targeted audience, nudging them towards a particular course of\naction--e.g., voting for a preferred candidate.\n\nAn example of a covert intentional dogwhistle is the infamous Willie\nHorton ad used by the George H. W. Bush campaign in 1988. The ad\ntargeted a prison furlough program in place during Michael\nDukakis’s term as governor of Massachusetts. It presented a\npicture of Horton, an African American man, who while out on furlough\nraped a white woman and stabbed her husband. Though there was no\nexplicit mention of race, it was clear to many that the ad drew on\nracial tropes about Blackness and criminality to stoke fear in white\nvoters. In support of the interpretation that this was a\ncovert dogwhistle, Saul notes that once the specter of race\nwas raised about the ad, its effectiveness started to wane (2018,\n366). The implication is that while the explicit appeal to racial\nresentment was a losing strategy, implicit appeal in the form of\ncovert dogwhistles could be put to powerful use.\n\nThe unintentional dogwhistle is defined as an “unwitting use of\nwords and/or images that, used intentionally, constitute an\nintentional dogwhistle, where this use has the same effect as an\nintentional dogwhistle” (2018, 368). Dogwhistles of this sort\nare passed on by unwitting others while achieving similar effects of\nthe original intentional one. A special case of unintentional\ndogwhistles, what Saul calls amplifier dogwhistles, occurred\nwhen reporters and TV producers played the Willie Horton ad\nrepeatedly. Presumably, the repeated presentations continued to make\nthe associations between Blackness and criminality and, thus,\ncontinued to stoke fear and racial anxiety in significant portions of\nthe white viewing public. For Saul, dogwhistles are therefore best\nunderstood functionally, and the difference in speaker-intentions\nbetween intentional and unintentional dogwhistles matters only insofar\nas we define them—their effects, in other words, are often\nidentical.\n\nThe use of implicit means like dogwhistling—in both its covert\nand overt forms—can make the conceptualization and detection of\nhate speech more difficult. Undoubtedly, this poses a challenge for\ndefining hate speech since dogwhistles are often designed to be\ninnocuous. But what is it that explains the effects often attributed\nto dogwhistles? That is, how is it possible for language to work in\nthis way?\n\nPerhaps there is good reason to think something about\ndogwhistles’ meaning explains their effects. Consider, first, an\nambiguity thesis that states code words have at least two meanings, a\nracial and a non-racial meaning. The expression ‘inner\ncity’ in\n\n(3.5)\nFood stamp programs help many inner-city families,\n\n\npurportedly expresses two meanings: (i) densely populated, high crime,\nurban areas, or (ii) poor African American (Khoo, 2017, 40). An\nambiguous expression can be used in an utterance to produce a\nstatement that leaves undetermined which interpretation is intended by\nthe speaker.\n\nOne worry, however, is that terms like ‘inner city’ are\nnot actually ambiguous. Khoo argues these terms do not behave like\ngenuinely ambiguous expressions. Compare the following two\nsentences,\n\n(3.6)\nSmith is a funny man who is not humorous.\n(3.7)\nSmith is an inner-city pastor who is from, works, and lives in the\nsuburbs.\n\n\nA reading of (3.6) is supposed to sound coherent given that\n‘funny’ can mean ‘humorous’ or\n‘strange’ whereas (3.7) is supposed to sound odd, even\ncontradictory. If ‘inner-city’ were genuinely ambiguous in\nthe way described above, we should be able to use it to mean\n‘African American’ and get a coherent reading of\n(3.7).\n\nA second view posits two dimensions of meaning for code words,\nat-issue and not-at-issue content. At-issue content\nis the main point of a speaker’s utterance, the directly\nasserted content that is foregrounded whereas not-at-issue content is\nprojective, meaning it is able to survive embedding under\noperators like negation and modals (Tonhauser, 2012). Consider,\n\n(3.8)\nJohn stopped smoking.\n\n\nThe at-issue content of (3.8) is represented by (a) and the\nnot-at-issue by (b):\n\nJohn does not smoke.\nJohn used to smoke.\n\n\nNote the difficulty in directly denying the not-at-issue content. If\none were to follow an utterance of (3.8) with,\n\n(3.8′)\nHe did not used to smoke.\n\n\nyou would presumably find this odd and incoherent. A much more\nelaborate statement is needed to deny the not-at-issue content.\n\nApplying this to view to ‘inner-city’ in (3.5), we end up\nwith:\n\nAt-issue: A poor, densely populated, high-crime,\nurban area.\nNot-at-issue: Those living in such areas are\nmostly African American.\n\n\nBecause the racial component of (3.5) is not-at-issue, we have a\nreasonable explanation for why the following pair of sentences\nclash,\n\n(3.9)\nFood stamp programs help many inner-city families.\n(3.10)\nNo, poor, high-crime, urban areas are mostly white.\n\n\nAn objection to this view is that code words do not display\nnon-cancelability the way not-at-issue content typically\ndoes; “someone cannot disavow commitment to the\nnot-at-issue content of a sentence S that she utters merely\nby following up her utterance by asserting the negation of that\ncontent” (Khoo, 45). Consider,\n\n(3.11)\nJohn stopped smoking. He never smoked at all.\n(3.12)\nFood stamp programs help many inner-city families, most of whom\nare white.\n\n\nThe juxtaposition of sentences in (3.11) is supposed to strike the\nreader as contradictory while those in (3.12) should not.\n\nAccording to a third view, code words are neither ambiguous nor\nmultidimensional, but possess only nonracial meaning. What explains\nthe phenomenon associated with terms like ‘inner city’ is\nthe presence of an antecedent belief in the audience member that then\nallows them to infer the racial component. For example, an audience\nmember may already believe\n\nPre-existing Belief (PB):\n\nThe inner city is mostly populated by poor African Americans,\n\n\nso that when hearing a politician proclaim (3.5), the audience member\ncomes to infer\n\nRacial Inference (RI):\n\nThe food stamp program will primarily benefit poor African Americans.\n\n\nA contrasting view that draws on the same simple semantics is what\nKhoo calls the association-driven theory of code words. On\nthis view, there is “an association between ‘inner\ncity’ (or the concept INNER CITY) and the concept AFRICAN\nAMERICAN (or maybe just RACE) which then primes racist beliefs and\nprejudices” (2017, 50).\n\nKhoo’s account is simple and compelling, but we may still wonder\nwhether it is too liberal. For instance, expressions like\n‘thug,’ ‘illegal alien,’ ‘welfare\nqueen,’ and ‘terrorist’ seem to behave like the\nterms Khoo identifies as code words, yet they are generally understood\nto be explicitly racial in nature. Patrick O’Donnell (2017)\nargues that the aforementioned expressions are not code words but\nracialized terms. O’Donnell characterizes the\ndifference between racialized terms and code words in the following\nway:\n\nRacialized terms involve direct or predicative\nrelations between a term and a racialized group whereas code words\ninvolve indirect inferential or associational relations, and\nRacialized terms elicit racial resentment by making salient\nrace-specific interpretive options, whereas code words function by\nmaking salient race-neutral interpretive options (2017, 28).\n\n\nO’Donnell agrees with Khoo that code words are picked out\naccording to their contextual cognitive-pragmatic role, while claiming\nthat this role differs between code words and racialized terms.\n\nDetermining whether dogwhistles or coded language count as merely\ncontentious claims that must be tolerated or as hate speech subject to\nregulation has implications for broader discussions. The subtlety of\ncoded language, for instance, calls its status as hate speech into\nquestion. The impact coded language has on an audience lacks the kind\nof immediacy often attributed to hate speech. Lawrence (1993), for\nexample, notes that hate speech is often experienced by targets as a\nslap in the face. On the other hand, Mendelberg’s account\nsuggests coded speech can incite racial resentment, and so it may be\nmore aptly considered similar to propagandistic hate speech, discussed\nabove. (For more on this point, see Jason Stanley (2015).) This would\nappear to get us closer to how hate speech is purported to function,\nnamely, by inciting racial hatred. Whether it is close enough is of\ncourse open for debate.\n4. Pornography, Hate Speech, and Silencing\n\nThat hate speech and pornography are discussed so frequently together\nin philosophy might, at first glance, seem surprising. But given the\noverlap made in the arguments made by anti-porn feminist about\npornography and anti-racist theorists about racist hate speech, the\ntwo are now intimately linked—for better or for worse. (One\nimportant fact that led to this development is, of course, the ruling\nthat pornography is protected by the US first amendment as speech [see\nMiller v. California (1973)].) According to anti-porn\nfeminists, much of what is said of racist hate speech and the harms\nthat befall its targets also applies, with the appropriate changes, to\npornography and women—including, it’s worth emphasizing,\nwomen of color.\n\nMany of the important initial moves in this literature were crafted by\nfeminist legal scholar Catherine MacKinnon, along with Andrea Dworkin.\nOne of MacKinnon’s most significant claims that has received\nsustained philosophical attention is the idea that (degrading and\nmisogynist) pornography silences women. With some\nmodifications, a similar claim may be applied to hate speech, namely,\nthat hate speech silences its targets. However, as the\nliterature has focused on the case of pornography and women,\nit’s worth examining these arguments in detail first.\n\nThis silencing argument begins with MacKinnon’s observation that\nthere are “words that set conditions” for other speech\nacts’ successes or failures (1993, 63–68; see also Hornsby\nand Langton, 1998, 27). That is, there are some speech acts that fix\nthe possibility of other speech acts. In other words, they make it\npossible for some persons to perform some speech acts, and make it\nimpossible for others. This is most evident in formal settings, like a\nlegislature, where the formal rules determine who may speak when, and\nin what manner. Pornography, the argument continues, does just this.\nIt sets rules of behavior that, in effect, inhibit the speech of\nwomen. The result of which is that the speech acts of\npornography—performed by those who produce and distribute\nit—create a climate that undermines women’s capacity to\nperform certain speech acts of their own. The speech of some\n(pornographers), therefore, curtails the speech of others (women).\n\nIn an influential account of the phenomena of silencing, Langton\n(1993) deploys speech act theory to examine the case of sexual\nrefusal. According to the silencing argument, pornography depicts\nwomen as not (genuinely) refusing sexual advances with utterances of\n‘no.’ Indeed, according to the myths perpetuated by\npornography (among other social influences), a woman’s\n‘no’ is not a refusal, but rather part of an elaborate\nsexual script. As a result, when a woman says ‘no’ in a\nnon-pornographic context, intending to refuse a man’s sexual\nadvances, she may find herself unable to be heard—that is, her\nwords won’t have the force and effect she intends, and her\nhearer will not take her to be refusing. She may find herself silenced\nin this particularly horrendous way, unable to use the standard\nmethods of refusing another’s sexual advances. The claim is that\nthis occurs as a result of pornography silencing women’s\nrefusals in the context of sex. It renders their words powerless.\n\nIn making this argument, Langton relies on the distinction between\nlocutionary, illocutionary, and perlocutionary acts, and,\ncorrespondingly, locutionary, illocutionary, and perlocutionary\nsilencing. A couple examples will explain these distinctions\nquickly:\n\nWhen X says, ‘Shoot him!’ they are, we can see\nquite quickly, both saying something: ‘shoot him!’ and at\nthe same time doing something: ordering the hearer to fire.\nIn Austinian terms, we can say that X performs the\nlocutionary act of making an utterance with a certain\nmeaning, and at the same time is performing an illocutionary\nact of ordering the hearer to fire. In addition to these two things,\nthe speaker is also, with their words, bringing about a number of\neffects, which Austin termed the ‘perlocutionary\nact.’ In this case, leading to some unfortunate soul to be shot.\n(Adapted from Langton, 1993, 295, and Austin, 1962, 101)\n\n\nTo be clear, these three acts—locutionary, illocutionary, and\nperlocutionary—all occur as part of a single utterance and serve\nto bring out different aspects of any speech act. Austin (and many\nafter him) paid particular attention to the illocutionary act of an\nutterance, as this, he said, corresponds to the force of an\nutterance. That is, what someone is doing with their words.\n\nWith this in mind, we can see that there are, in fact, many ways one\ncould silence someone. You could literally gag or threaten someone to\nprevent them from speaking at all, which would achieve a type of\nlocutionary silencing. Alternatively, you could let them say what they\nwish, recognize what act they are performing, but prevent them\nachieving their goals, and in doing so achieve a type of\nperlocutionary silencing. Finally, a third alternative occurs when one\nspeaks and is prevented not only from achieving their intended\neffects, but also is prevented from performing the very action they\nintend to perform (Langton, 1993, 315). It is this third\nalternative—illocutionary silencing—that is said to occur\nwhen a man fails to even recognize a woman’s ‘no’ as\na refusal, owing at least partially to the influence of\npornography.\n\nThe specific mechanics of silencing—along with the underlying\ntheory that best explains the phenomena—is subject to much\ndispute in the literature, and numerous accounts with different\nessential features have been offered (see Langton (1993); Langton and\nWest (1999); Hornsby (1994); Hornsby and Langton (1998); Maitra\n(2009); McGowan (2004, 2009, 2014); Mikolla (2011; 2019), among\nothers).\n\nLaura Caponetto (2021) distinguishes four different types of\nsilencing, demonstrating the breadth of the concept. First, there is\nessential silencing, which consists in the hearer’s\nfailure to recognize the illocutionary point of a speech act. Second,\nthere is authority silencing, where a hearer fails to\nacknowledge a speaker’s authority in a relevant domain. Third,\nthere is sincerity silencing, when the speaker’s\nutterance is inaccurately taken as insincere. Fourth and finally,\nthere is seriousness silencing, which consists in the\nhearer’s failure to acknowledge the speaker’s words as\nappropriately serious. Given these fine-grained ways of understanding\nsilencing, a broad, comprehensive definition of silencing may be put\nas follows:\n\nIllocutionary Silencing\n\nA speaker S putting forth a speech act A addressed\nto a hearer H is illocutionarily silenced iff (i) H\nfails to recognize the obtaining of some conditions for\nA’s success; (ii) S’s attempt at\nA-ing meets the conditions that H fails to\nrecognize; (iii) normal input and output conditions are met; (iv) the\nrecognition failure on H’s part is systematic.\n(Caponetto, 2021)\n\n\nIn nearly all discussions of silencing, one common piece of contention\nconcerns the notion of ‘uptake.’ On different\nunderstanding of what uptake consists in—ranging from the\nhearer’s recognition of a speaker’s intent, or the type of\nspeech act being performed, up to the material consequences of a\nspeech act—we are led to different conclusions about whether a\nspeaker was silenced or not. Disagreement about the conditions of\nuptake poses difficulty, therefore, for many accounts of silencing.\nDrawing on these difficulties, Samia Hesni (2018) has argued that the\nstandard account of silencing needs significant retooling, in part\nbecause the necessary distinction between illocutionary silencing and\nperlocutionary silencing cannot hold, as it relies on a\nproblematic—and arguably conceptually untenable—notion of\nuptake (Hesni, 2018, 957). In an attempt to avoid these difficulties,\nwe might prefer an account of silencing that uses a Gricean, rather\nthan Austinian or Searlian framework, bypassing the need to fully\ndifferentiate the illocutionary from the perlocutionary (see Maitra,\n2009).\n\nWhile much of this literature is explicitly focused on\npornography’s potential to silence women in the realm of sexual\nrefusal, the notion that racist hate speech may similarly play a\nsilencing function has also been put forward. For example, in a\nclassic paper on the topic, Lawrence wrote that:\n\nRacist speech … distorts the marketplace of ideas by muting or\ndevaluing the speech of Blacks and other despised minorities.\nRegardless of intrinsic value, their words and ideas become less\nsaleable in the marketplace of ideas. An idea that would be embraced\nby large numbers of individuals if it were offered by a white\nindividual will be rejected or given less credence if its author\nbelongs to a group demeaned and stigmatized by racist beliefs.\n(Lawrence, 1993, 78–79)\n\n\nUsing the above framework, we might therefore say that racist hate\nspeech can itself constitute words that set conditions for the success\nof other speech acts, and in doing so undermines the speech of its\ntargets—and in some cases, effectively silencing them. That is,\nracist hate speech may, in cultivating an environment hostile to the\nvoices (and lives) of many, can lead to both locutionary and\nillocutionary silencing in a way that threatens their freedom of\nexpression. And as is noted above in the section on the harms of hate\nspeech, one long-term consequence of racist hate speech may be the\ntarget’s partial withdrawal from certain aspects of public life,\nincluding public discourse (West, 2012, 237). One further harmful\neffect of hate speech, then, is its targets’ silence.\n\nAnother way in which racist hate speech might silence is more\nimmediate. Returning to the distinction between propagandistic hate\nspeech on the one hand, and assaultive hate speech on the other, where\nthe latter consists in hate speech uttered directly to its target, we\nmay note that hate speech often serves as a type of attack. So,\ndespite the common refrain of ‘more speech’ offered as\nadvice, conceiving hate speech as a personal attack demonstrates how\nit, in fact, threatens the speech rights of its targets. As Lawrence\nputs it: “The visceral emotional response to personal attack\nprecludes speech” (1993, 68). He goes on:\n\nAttack produces an instinctive, defensive psychological reaction.\nFear, rage, shock, and flight all interfere with any reasoned\nresponse. Words like ‘nigger,’ ‘kike,’ and\n‘faggot’ produce physical symptoms that temporarily\ndisable the victim, and perpetrators often use these words with the\nintention of producing this effect. (ibid.)\n\n\nSo, in both cultivating an environment in which the speech of\nmarginalized groups is systematically devalued, or in serving as an\nimmediate threat, hate speech can be said to silence its targets.\n\nAs is the case with pornography and silencing, the details of the\nmechanisms that sustain this type of silencing, along with what\nparticular type of silencing racist hate speech results in, are\nsubject to dispute. But, just like in the pornography debate, the\nplausibility of the silencing argument lies partly in how it reframes\nthe overall question surrounding regulation. Rather than simply being\na source of harm that merely infringes on the equality rights of its\ntargets, if hate speech silences then it also infringes on the speech\nrights of its targets (West, 2012). As a result, it is not simply a\nquestion of balancing the speech rights of hate speakers against the\nwellbeing of their targets, but of competing claims to (substantive,\nand not just formal) freedom of expression. And given the importance\nthat most liberal democracies place on freedom of expression, the\nchallenge presented from hate speech is of central importance. For\nthis reason, the silencing question is one of the most disputed\naspects of hate speech and has generated great attention.\n5. Counteracting Hate Speech\n\nOn the presumption that hate speech is harmful—both particularly\nharmful for the members of targeted groups, and also generally harmful\nto democracy—the natural question that follows is: what should\nwe do about it? This question, however, rests on several\nsub-questions—some empirical, some conceptual—that\nthemselves admit of rich dispute. For example, depending on how one\nconceives of the value and point of free expression—to better\nseek the truth, to respect autonomy, to ensure democracy,\netc.—different answers to the hate speech question will seem\nmore worthwhile than others. The same consideration applies to\nempirical matters as well, which are often difficult to properly\nassess in the absence of uncontroversial data. This means that\nrelatively straightforward empirical questions—does genocidal\nspeech pave the way to actual genocidal violence; do governments abuse\nhate speech regulation to punish political rivals and disfavored\nminorities; and others—rarely receive unanimous agreement.\nDespite these challenges, many theorists have addressed the question\nof how to counteract hate speech, and what form that response ought to\ntake.\n\nWe can divide the most common answers into three broad categories: (1)\nlegally restrict it in some form, as a justified exception to free\nexpression; (2) permit it on the basis of free expression, holding\nthat the harms of censorship outweigh the harms of hate speech; or (3)\npermit it, but take explicit measures to undo the harm of hate\nspeech.\n5.1 The Case for Bans\n\nFirst, the case for banning hate speech. While this position may be\nanathema to many (especially in the United States), it is the\nconsensus position of most democratic nations around the globe, as\nwell as the explicit position of the United Nations. In the\nInternational Covenant on Civil and Political Rights, Article\n20 requires a ban on hate speech—or, in their words, “any\nadvocacy of national, racial or religious hatred that constitutes\nincitement to discrimination, hostility or violence shall be\nprohibited by law” (Covenant on Civil and Political\nRights; see also, Article 4 of Convention on Racial\nDiscrimination). It is worth noting the position of the United\nNations and other democracies on hate speech in part because of the\ncontrast they serve for the dominant position in the United States,\nwhich recognizes some exceptions to the right to free expression\n(e.g., obscenity, libel, child sexual abuse material), but not\ngenerally on the basis of (racial) hate. Moreover, these exhortations\nto criminalize hate speech from the United Nations sit alongside\ncommitments that maintain the importance of freedom of expression. For\ninstance, Article 20, quoted above, is immediately preceded by Article\n19, which affirms right to freedom of expression (Covenant on\nCivil and Political Rights).\n\nThe standard justification offered for restrictions on freedom of\nexpression are based on the necessity of (a) respect of the rights or\nreputations of others; and (b) reasons of national security or of\npublic order. In other words, a ban on hate speech may be thought to\nfollow from the recognition of the harms it presents, both to the\ndignity of minority-members of a nation, as well as their physical\nsafety. This position maintains, then, that restrictions on hate\nspeech are a legitimate—and necessary—exception to an\notherwise wider understanding of free expression. (For some theorists,\nit’s worth noting, hate speech is best not understood as the\ntype of speech that free speech protections are meant to\ninclude—e.g., it serves no purpose in the pursuit of\ntruth—and so is not in fact an exception to a free\nspeech principle, but simply not included in a proper understanding of\nthe scope of free speech.) This view naturally follows from the\nunderstanding that multiple values and rights must be balanced against\neach other. This is true both of countries that explicitly prohibit\nhate speech in order to protect minority rights, as well as in more\n‘speech-friendly’ nations like the United States, where\nspeech that is aimed at and likely to result in “imminent\nlawless action” may be legitimately restricted (see\nBrandenburg v. Ohio).\n\nHowever, most advocates for legally restricting hate speech believe\nthat its proper scope is wider than what US law currently allows.\nParekh, for example, rejects the position that hate speech may only be\nrestricted when there is “imminent danger” of violence on\nthe grounds that this understanding is too short-sighted. Moreover, he\nsays,\n\nno action occurs in a historical vacuum, and every action produces\nconsequences not inherently but against a particular background.\n… Imminent danger occurs against, and is imminent because of,\nthe prevailing social climate, and consistency demands that we\nconcentrate our efforts not only on fighting the immediate source of\ndanger, but also on changing the climate. (2012, 45–46)\n\n\nOn the understanding that the threat of hate speech is not exhausted\nby cases that concern “imminent danger,” we might then\nground the prohibition of hate speech on the basis that this may\nreduce speech that causes harm to its targets, beyond those most\nimmediately affected. Of course, there is also an important role to be\nplayed by non-legal means (e.g., moral and social pressure) in erasing\nor reducing these harms, so legal bans are best understood as part of\na broader approach to the ills of hate speech. Furthermore, advocates\nof bans describe the expressive dimension of these laws as themselves\nproviding a reason in favor of legislation (Waldron, 2014). The law,\nin this sense, serves as a public statement on a community’s\nvalues, and has educational and symbolic importance in itself (Parekh,\n2012, 46). (For an overview of expressive theories of law, see\nAnderson and Pildes, 2000.) A ban on hate speech, therefore, is\nintended both to reduce harms directly, by decreasing instances of\nhate by the threat of law, as well as indirectly, by shaping the\ncommunity’s moral norms through an expression of value.\n5.2 Objections to Bans, and Some Responses\n\nThough many would agree that hate speech can have destructive effects,\nand that there is a moral imperative on the state to cultivate\nsomething like respectful relations between its members, objections to\nhate speech bans abound. In a wide-ranging response to these concerns,\nParekh (2012) considers (and rejects) six common objections to the\nprohibition of hate speech. These six objections are: (1) that the\nharm of hate speech, while real, is relatively minor and a small price\nto pay given the interest of democratic nations; (2) that bans are not\nthe answer, but rather “better ideas” and “more\nspeech” are; (3) that a prohibition would have a dangerous\n“chilling effect” and that hate speech bans are a slippery\nslope to all sorts of unwanted restrictions; (4) that bans give the\nstate too much power to judge the content of speech and decide what\ncan or cannot be said, threatening state-neutrality, skewing political\ndebate, and infringing on individual liberty; (5) that bans are an\nobjectionable form of paternalism or moral authoritarianism, and is\nincompatible with the assumption that humans are responsible and\nautonomous individuals and that society is made up of free and equal\ncitizens; and finally, (6) that bans are ineffective at changing\nattitudes and removing the hate from the hate speaker’s heart,\nwith the result that bans have the effect of moving extremists\nunderground, alienating them from wider society, and in doing so\nrendering us ignorant of their violent potential and impotent to\nengage in effective de-radicalization.\n\nEach of these concerns merits more space than can be given to them\nhere. Still, considering these objections to bans and the responses\navailable, even briefly, is illustrative of the theoretical concerns\nbans on hate speech bring forth (see the list of references for fuller\ndevelopment of the relevant theoretical and empirical issues). Again\nfollowing Parekh (2012, 47–54), we can approach these objections\nas follows.\n\nIn response to (1), the objection that the interests of a vibrant\ndemocracy outweigh the harms imposed by hate speech, it may be argued\nthat hate speech does not embody the values of free speech but, in\nfact, undermines them by promoting irrational fears and hatred over\nreasoned arguments and public scrutiny. How powerful one takes this\nresponse to be depends directly on what one takes the value and\njustification of a right to free expression to be, which is of course\na matter of dispute.\n\nOne response to (2), the common ‘more speech’ objection,\nis to note that the “marketplace of ideas” is not neutral,\nand likely requires some regulation (just like a marketplace of other\ngoods). This is what a ban does, and so may be considered to be\nhelping ensure ‘fair competition’ by countering prevailing\nprejudices, and encouraging greater participation from the members of\ncommunities targeted by hate speech. In other words, bans on hate\nspeech may promote greater freedom of expression, by preventing the\ntype of silencing considered above.\n\nWhile acknowledging the worries of (3), namely that of a\n‘chilling effect’ or a ‘slippery slope,’\nrepresent an important objection, we may respond by noting that the\nproblems these signal rest on the vague wording and inconsistent or\nbiased application of hate speech bans. They are not, therefore,\ndirect objections to hate speech bans as such. The remedy, therefore,\nlies in correcting these aspects of a ban, rather than abandoning it\naltogether. Moreover, the appeal to a ‘slippery slope’ may\nbe inapt, as it implies that once one type of speech is prohibited,\nsociety cannot help but prohibit even more types. But we have no clear\nreason to suppose that this is the case, as existing bans on\ndefamation have not led to bans on fair critical comment, for\nexample.\n\nThe worries at the core of objection (4) represents a well-founded\nfear of the state, and so must be taken seriously. But, to defenders\nof hate speech bans, its understanding of the threat that hate speech\nbans pose to state-neutrality is nonetheless flawed. It fails to\nrecognize that the state often already judges the content of\nspeech (e.g., in banning commercial fraud, criminal solicitation,\npublic displays of obscenity) and often elides neutrality when it\nspeaks in favor of certain positions (e.g., the value of human\ndignity, equality, liberty). While any defense of hate speech bans\nmust reckon with the possibility of further empowering the state,\nopponents ought not misrepresent the status quo, exaggerating the\nreality of state-neutrality.\n\nObjections grounded on the threat of paternalism or moral\nauthoritarianism, like (5), are similarly serious. However, one\nresponse on behalf of bans would be to point out how autonomy is\nalways exercised under certain conditions and requires various\nexternal circumstances for its development and use. When appealing to\npersonal autonomy, therefore, we should not idealize too greatly so\nthat its real-world exercise is ignored. Rather, the threats that\nracism and bigotry pose for autonomy must also be acknowledged,\nalongside praise for our rational faculties.\n\nOne response to (6), that bans are ineffective at changing attitudes,\nis to admit the law cannot change attitudes (like hatred) directly and\nmaintain that this is no knock against the law, and indeed is no\nproblem for hate speech bans. The aim of these bans, in most cases, is\nnot to prevent hatred but to prevent the harm that the public\nexpression of hate can cause. The indirect effects of such a law,\nhowever, are an empirical matter, and it is unlikely they admit of a\nsingle, general answer, but are highly context-dependent. The subject\nof the practicability of hate speech bans deserves special attention,\nhowever. Opponents to bans may worry that the suppression of hate\nspeech is likely to backfire, not only by failing to reduce hatred,\nbut by increasing the sense of oppression and victimization\nthat many bigots thrive on, leading to an escalation of racist\nviolence (Baker, 2012, 77). Again, as an empirical hypothesis, it\ncannot be settled simply from the armchair. Still, a further response\navailable on behalf of hate speech bans would be to question the\nlegitimacy of this objection. If, by hypothesis, bans generated an\nincrease in violence, it would still be the responsibility of the\nstate to manage this violence effectively. The role of the state is\nnot exhausted by implementing a ban, but must be seen alongside its\nenforcement.\n\nThis, however, leads to a slightly different objection. The opponent\nof bans may worry that the enforcement of laws against hate speech\nwould divert the state’s energies away from more effective\nmeasures against hated, such as “those directed at changing\nmaterial conditions in which racism festers, material conditions of\nboth the purveyors and targets of hate” (Baker, 2012, 77). That\nis, the energies and resources that would be directed towards\nestablishing and enforcing hate speech bans may be better spent on\nalternative policies. The guiding thought rests on two important\npoints. First, that the intended ends of hate speech bans (e.g.,\nreduction in the harms of hate speech that fall on those targeted by\nit, mitigation of the expansion of racist attitudes, lessening\noccurrences of violent hate crimes) may be more effectively achieved\nvia different means, such as reducing inequality, improving social\nsafety nets, political empowerment, and more. Second, though the state\ncan do more than one thing at once, it is nonetheless working with\nlimited resources, and efficiency is a value. That these alternative\npolicy options may indeed be more effective is an unresolved empirical\nmatter. And it remains an open question whether indirect approaches\nlike this would fail to achieve the expressive ends of hate speech\nbans, which more directly communicate to those targeted by hate speech\nthat they are valued members society.\n\nMany of the claims made above, both on behalf of bans and in\nopposition, raise theoretical and empirical issues whose proper\nexamination spans many articles and books. Suffice to say that the\ndebate over bans is a highly contested one, and each position rests on\nan understanding of such issues as the value of free expression, the\nharm of hate speech, the likely effects a ban might have in a\nparticular context, and so on. For instance, one who believes that\nfree expression is valuable in part because of its role in democratic\ndecision-making may maintain that specifically political\nspeech deserves increased protections, and that some of what others\nregard as hate speech might fall into this category, escaping\nregulation. Alternatively, one may view the immunity for political\nspeech as perhaps a red herring. On the speech act theoretic framework\noutlined above, some forms of racist hate speech are functionally\nidentical to a ‘Whites Only’ sign hanging in a public\nrestaurant (McGowan 2012; McGowan and Maitra 2009). The latter\nexpresses a political opinion in the same way as the former expression\ndoes, but it is also regarded as unlawful racially discriminatory. The\nsame considerations—legal sanction—might therefore apply\nto the verbal utterance as the written sign, and the appeal to the\npolitical content of the message is irrelevant.\n5.3 The Supported Counterspeech Alternative\n\nThe preceding summarizes the two main positions in the debate over\nhate speech: on the one hand, there are those who defend prohibitions,\nand on the other, those who maintain hate speech as protected under a\nwide conception of freedom of expression, and so oppose laws that aim\nat its prohibition. A third position aims to avoid some of the\nimpasses that haunt this debate. On this view, this impasse is the\nresult of a failure by those who oppose hate speech bans (and, as a\nresult, tend to favor ‘more speech’) to acknowledge the\nstrength of one of the main arguments from those who advocate for\nbans, namely, that hate speech is a type of assault that often renders\none unable to respond. This, along with a failure of those who defend\nbans from considering non-punitive options for mitigating the harms of\nhate speech, leads to stalemate. On this understanding, both sides of\nthe debate over bans see the only alternatives as either increased\ngovernmental powers to punish, or absent that,\n‘unsupported’ counterspeech on the part of those targeted\nby hate speech (see Gelber, 2012a; 2012b).\n\nBy contrast, the “supported counterspeech” alternative\naims to recognize the specific harms inflicted by hate speech and\nprovide state support to empower those who are harmed. Gelber, an\nadvocate for this alternative, places it within the capabilities\napproach originally developed by Amartya Sen (1992) and Martha\nNussbaum (2000; 2003). “If hate-speech acts harm their\ntargets’ capacity to develop human capabilities,” Gelber\nsays, then “this is what needs to be remedied” (2012a,\n54). The impetus for this approach therefore begins from the idea that\nwe must think about remedies to hate speech beyond restrictions and\npunishment, as neither of these approaches achieve the goal of\nempowering the target of hate speech. (This is especially true of the\nlatter, punishment, which also carries with it all the negative\nconsequences that anti-carceral advocates have noted.) The supported\ncounterspeech policy is therefore not focused on hate speakers, but\nrather the targets of hate speech more directly.\n\nThe core of this approach lies in an enlarged conception of\ncounterspeech as well as a commitment by the state to provide the\nmaterial conditions necessary for this speech. In practice, this would\nmean that the state is committed to responding to an incident of hate\nspeech by empowering its targets to engage in more speech, after the\nfact. The specific forms this support may take will depend on the\nconditions of different contexts, along with calibration for the\nspecifics of the incident it is meant as a response to, as well as the\nneeds of the particular communities. Still, to give a sense of what\nthis may entail, examples of the sort of supported counterspeech that\nthis position recommends include things such as: assistance in the\nproduction of a community newsletters, op-eds, radio broadcasts, or\ntelevision advertisements; the development of antiracism awareness\nprograms, or anti-hate-speech workshops; subsidizing community-led art\nprojects; etc.\n\nIn each case, the aim of supported counterspeech is to empower the\ntargets of hate speech, and to increase their capacity for engaging in\ncounterspeech. The goal is thus to undo (as much as one can) the\nspecific harms of hate speech, while avoiding the pitfalls of\n“private remedies” (as critiqued by Matsuda, 1993). While\nsupported counterspeech could be taken as either an alternative to\nbans or a supplement to them, it remains an under-explored avenue for\nconsidering responses tailored to the particular harms of hate\nspeech.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Anderson, Elizabeth, and Richard Pildes, 2000, “Expressive\nTheories of Law: A General Restatement,” <em>University of\nPennsylvania Law Review</em>, 148: 1503–1575.",
                "Anderson Luvell and Lepore, Ernest, 2013a, “Slurring\nWords,” <em>Noûs</em>, 47(1): 25–48.",
                "–––, 2013b, “What Did You Call Me? Slurs\nas Prohibited Words,” <em>Analytic Philosophy</em>, 54(3):\n350–363.",
                "Appiah, Kwame Anthony, 2012, “What’s Wrong with\nDefamation of Religion?” in Michael Herz, and Peter Molnar\n(eds.), <em>The Content and Context of Hate Speech: Rethinking\nRegulation and Response</em>, Cambridge; New York: Cambridge\nUniversity Press, pp. 164–182.",
                "Ashwell, Lauren, 2016, “Gendered Slurs,” <em>Social\nTheory and Practice</em>, 42(2): 228–39.",
                "Austin. J. L., 1962, <em>How to do Things with Words</em>,\nCambridge, MA: Harvard University Press.",
                "Bach, Kent, 2018, “Loaded Words: On the Semantics and\nPragmatics of Slurs,” in David Sosa (ed.), <em>Bad Words:\nPhilosophical Perspectives on Slurs</em>, Oxford: Oxford University\nPress, pp. 60–76.",
                "Baker, C. Edwin, 2012, “Hate Speech,” in Michael Herz,\nand Peter Molnar (eds.), <em>The Content and Context of Hate Speech:\nRethinking Regulation and Response</em>, Cambridge, New York:\nCambridge University Press, pp. 57–80.",
                "Bauer, Nancy, 2015, <em>How to Do Things with Pornography</em>,\nCambridge, MA: Harvard University Press.",
                "<em>Beauharnais v. People of the State of Illinois</em>, 343 U.S.\n250 (1952).",
                "Behrens,Paul, Terry, N. and Jensen, O (eds.), 2017, <em>Holocaust\nand Genocide Denial: A Contextual Perspective</em>, Abingdon; New\nYork: Routledge, Taylor and Francis Group.",
                "Bolinger, Renée Jorgensen, 2017, “The Pragmatics of\nSlurs,” <em>Noûs</em>, 51(3): 439–462.",
                "<em>Brandenburg v. Ohio</em>, 395 U.S. 444 (1969).",
                "Brandom, Robert, 1994, <em>Making it Explicit</em>, Cambridge, MA:\nHarvard University Press.",
                "Brown, Alexander, 2017a, “What Is Hate Speech? Part 1: The\nMyth of Hate,” <em>Law and Philosophy</em>, 36(4):\n419–468.",
                "–––, 2017b, “What Is Hate Speech? Part 2:\nFamily Resemblances,” <em>Law and Philosophy</em>, 36(5):\n561–613.",
                "Brison, Susan, 1998a, “The Autonomy Defense of Free\nSpeech,” <em>Ethics</em>, 108(2): 312–339.",
                "–––, 1998b, “Speech, Harm, and the\nMind-Body Problem in First Amendment Jurisprudence,” <em>Legal\nTheory</em>, 4: 39–61.",
                "Butler, Judith, 1997, <em>Excitable Speech: A Politics of the\nPerformative</em>, New York: Routledge.",
                "Camp, Elisabeth, 2013, “Slurring Perspectives,”\n<em>Analytic Philosophy</em>, 54(3): 330–349.",
                "–––, 2018, “Slurs as Dual-Act\nExpressions,” in David Sosa (ed.), <em>Bad Words</em>, Oxford:\nOxford University Press, pp. 29–59.",
                "Caponetto, Laura, 2021, “A Comprehensive Definition of\nIllocutionary Silencing,” <em>Topoi</em>, 40:\n191–202.",
                "Cepollaro, Bianca, 2015, “In Defense of a Presuppositional\nAccount of Slurs,” <em>Language Sciences</em>, 52:\n36–45.",
                "Croom, Adam, 2011, “Slurs,” <em>Language\nSciences</em>, 33: 343–358.",
                "Delgado, Richard, 1993, “Words that Wound: A Tort Action for\nRacial Insults, Epithets, and Name Calling,” in Mari Matsuda,\nCharles Lawrence III, Richard Delgado, and Kimberlé Crenshaw\n(eds.), <em>Words that Wound: Critical Race Theory, Assaultive Speech\nand the First Amendment</em>, Boulder, CO: Westview Press, pp.\n89–110.",
                "Delgado, Richard, and Jean Stefancic, 2004, <em>Understanding\nWords that Wound</em>, Boulder, CO: Westview Press.",
                "Dummett, Michael, 1993, <em>Frege: Philosophy of Language</em>,\nCambridge, MA: Harvard University Press.",
                "Gallie, W. B., 1955, “Essentially Contested Concepts,”\n<em>Proceedings of the Aristotelian Society</em>, 56:\n167–198.",
                "Gelber, Katharine, 2012a, “Reconceptualizing Counterspeech\nin Hate-Speech Policy (with a Focus on Australia),” in Michael\nHerz, and Peter Molnar (eds.), <em>The Content and Context of Hate\nSpeech: Rethinking Regulation and Response</em>, Cambridge, New York:\nCambridge University Press, pp. 198–216.",
                "–––, 2012b, “‘Speaking Back’:\nThe Likely Fate of Hate Speech Policy in the United States and\nAustralia,” in Ishani Maitra and Mary Kate McGowan (eds.),\n<em>Speech &amp; Harm: Controversies Over Free Speech</em>, New York:\nOxford University Press, pp. 50–71.",
                "–––, 2017, “Hate Speech—Definitions\n&amp; Empirical Evidence,” <em>Constitutional Commentary</em>,\n32(3): 619–629.",
                "Gelber, Katharine, and Luke McNamara, 2016, “Evidencing the\nHarms of Hate Speech,” <em>Social Identities</em>, 22 (3):\n324–341.",
                "Herz, Michael, and Peter Molnar (eds.), 2012, <em>The Content and\nContext of Hate Speech: Rethinking Regulation and Responses</em>,\nCambridge, New York: Cambridge University Press.",
                "Hesni, Samia, 2018, “Illocutionary Frustration,”\n<em>Mind</em>, 127(508): 947–976.",
                "Heyman, Steven, 2008, <em>Free Speech and Human Dignity</em>, New\nHaven: Yale University Press.",
                "Hom, Christopher, 2008, “The Semantics of Racial\nEpithets,” <em>Journal of Philosophy</em>, 105:\n416–440.",
                "Hornsby, Jennifer, 1994, “Illocution and its\nSignificance,” in Savas L. Tsohatzidis (ed.), <em>Foundations of\nSpeech Act Theory: Philosophical and Linguistic Perspectives</em>,\nLondon: Routledge, pp. 187–207.",
                "–––, 2001, “Meaning and Uselessness: How\nto Think About Derogatory Words,” <em>Midwest Studies in\nPhilosophy</em>, 25(1): 128 – 141.",
                "Hornsby, Jennifer, and Rae Langton, 1998, “Free Speech and\nIllocution,” <em>Legal Theory</em>, 4: 21–37.",
                "Imbleau, Martin, 2011, “Denial of the Holocaust, Genocide,\nand Crimes Against Humanity,” in Ludovic Hennebel and Thomas\nHochmann (eds.) <em>Genocide Denials and the Law</em>, New York:\nOxford University Press, pp. 235–277.",
                "Jeshion, Robin, 2013a, “Expressivism and the Offensiveness\nof Slurs,” <em>Philosophical Perspectives</em>, 27:\n231–259.",
                "–––, 2013b, “Slurs and Stereotypes,”\n<em>Analytic Philosophy</em>, 54 (3): 314–329.",
                "Khoo, Justin, 2017, “Code Words in Political\nDiscourse,” <em>Philosophical Topics</em>, 45 (2):\n33–64.",
                "Kirk-Giannini, Cameron Domenico, 2019, “Slurs are\nDirectives,” <em>Philosopher’s Imprint</em>, 19(48):\n1–28.",
                "Kukla, Quill [writing as Rebecca], 2014, “Performative\nForce, Convention, and Discursive Injustice,” <em>Hypatia</em>,\n29 (2): 440–457.",
                "–––, 2018, “Slurs, Interpellation, and\nIdeology,” <em>The Southern Journal of Philosophy</em>, 56(S1):\n7–32.",
                "Langton, Rae, 1993, “Speech Acts and Unspeakable\nActs,” <em>Philosophy &amp; Public Affairs</em>, 22(4):\n293–330.",
                "–––, 2012, “Beyond Belief: Pragmatics in\nHate Speech and Pornography,” in Ishani Maitra and Mary Kate\nMcGowan (eds.), <em>Speech &amp; Harm: Controversies Over Free\nSpeech</em>, New York: Oxford University Press, pp. 72–93.",
                "–––, 2018a, “The Authority of Hate\nSpeech,” in John Gardner, Leslie Green, and Brian Leiter (eds.),\n<em>Oxford Studies in Philosophy of Law</em> (Volume 3), New York:\nOxford University Press, pp. 123–152.",
                "–––, 2018b, “Blocking as Counter\nSpeech,” in Daniel W. Harris Daniel Fogal, and Matt Moss (eds.),\n<em>New Works on Speech Acts</em>, Oxford: Oxford University Press,\npp. 144–164.",
                "Langton Rae, and Caroline West, 1999, “Scorekeeping in a\nPornographic Language Game,” <em>Australasian Journal of\nPhilosophy</em>, 77(3): 303–319.",
                "Lawrence, Charles III, 1993, “If He Hollers Let Him Go:\nRegulating Racist Speech on Campus,” in Mari Matsuda, Charles\nLawrence III, Richard Delgado, and Kimberlé Crenshaw (eds.),\n<em>Words that Wound: Critical Race Theory, Assaultive Speech and the\nFirst Amendment</em>, Boulder, CO: Westview Press, pp.\n53–88.",
                "Haney Lopez, Ian, 2014, <em>Dog Whistle Politics: How Coded Racial\nAppeals Have Reinvented Racism and Wrecked the Middle Class</em>,\nOxford: Oxford University Press.",
                "MacKinnon, Catharine, 1993, <em>Only Words</em>, Cambridge, MA:\nHarvard University Press.",
                "Maitra, Ishani, 2009, “Silencing Speech,” <em>Canadian\nJournal of Philosophy</em>, 39(2): 309–338.",
                "–––, 2012, “Subordinating Speech,”\nin Ishani Maitra and Mary Kate McGowan (eds.), <em>Speech &amp; Harm:\nControversies Over Free Speech</em>, New York: Oxford University\nPress, pp. 94–120.",
                "Maitra, Ishani, and Mary Kate McGowan (eds.), 2012, <em>Speech\n&amp; Harm: Controversies Over Free Speech</em>, New York: Oxford\nUniversity Press.",
                "Matsuda, Mari, 1993, “Public Response to Racist Speech:\nConsidering the Victim’s Story,” in Mari Matsuda, Charles\nLawrence III, Richard Delgado, and Kimberlé Crenshaw (eds.),\n<em>Words that Wound: Critical Race Theory, Assaultive Speech and the\nFirst Amendment</em>, Boulder, CO: Westview Press, pp.\n17–51.",
                "Matsuda, Mari, Charles Lawrence III, Richard Delgado, and\nKimberlé Crenshaw (eds.), 1993, <em>Words that Wound: Critical\nRace Theory, Assaultive Speech and the First Amendment</em>, Boulder,\nCO: Westview Press.",
                "McGowan, Mary Kate, 2004, “Conversational Exercitives:\nSomething Else We Do With Our Words,” <em>Linguistics and\nPhilosophy</em>, 27: 93–111.",
                "–––, 2009, “Oppressive Speech,”\n<em>Australasian Journal of Philosophy</em>, 87(3):\n389–407.",
                "–––, 2012, “On ‘Whites Only’\nSigns and Racist Hate Speech: Verbal Acts of Racial\nDiscrimination,” in Ishani Maitra and Mary Kate McGowan (eds.),\n<em>Speech &amp; Harm: Controversies Over Free Speech</em>, New York:\nOxford University Press, pp. 121–47.",
                "–––, 2014, “Sincerity Silencing,”\n<em>Hypatia</em>, 29(2): 458–473.",
                "–––, 2018, “On Covert Exercitives: Speech\nand the Social World,” in Daniel W. Harris Daniel Fogal, and\nMatt Moss (eds.), <em>New Works on Speech Acts</em>, Oxford: Oxford\nUniversity Press, pp. 185–201.",
                "–––, 2019, <em>Just Words: On Speech and Hidden\nHarm</em>, Oxford: Oxford University Press.",
                "McGowan, Mary Kate, and Ishani Maitra, 2009, “On Racist Hate\nSpeech and the Scope of a Free Speech Principle,” <em>Canadian\nJournal of Law and Jurisprudence</em>, 23(2): 343–372.",
                "Mendelberg, Tali, 2001, <em>The Race Card: Campaign Strategy,\nImplicit Messages, and the Norm of Equality</em>, Princeton: Princeton\nUniversity Press.",
                "Mikkola, Mari, 2011, “Illocution, Silencing and the Act of\nRefusal,” <em>Pacific Philosophy Quarterly</em>, 92:\n415–437.",
                "–––, 2019, <em>Pornography: a Philosophical\nIntroduction</em>, New York: Oxford University Press.",
                "<em>Miller v. California</em>, 413 U.S. 15 (1973).",
                "Neufeld, Eleonore, 2019, “An Essentialist Theory of the\nMeaning of Slurs,” <em>Philosopher’s Imprint</em>, 19(35):\n1–29.",
                "Nunberg, Geoff, 2018, “The Social Life of Slurs,” in\nDaniel W. Harris, Daniel Fogal, and Matt Moss (eds.), <em>New Works on\nSpeech Acts</em>, Oxford: Oxford University Press, pp.\n237–295.",
                "Nussbaum, Martha, 2000, <em>Women and Human Development: The\nCapabilities Approach</em>, Cambridge: Cambridge University\nPress.",
                "–––, 2003, “Capabilities as Fundamental\nEntitlements: Sen and Social Justice,” <em>Feminist\nEconomics</em>, 9(2/3): 33–59.",
                "O’Donnell, Patrick, 2017, “Generics, Race, and Social\nPerspectives,” <em>Inquiry: An Interdisciplinary Journal of\nPhilosophy</em>, published online 26 January 2017.\ndoi:10.1080/00207543.2016.1266801",
                "Parekh, Bhikhu, 2012, “Is There a Case for Banning Hate\nSpeech?” in Michael Herz, and Peter Molnar (eds.), <em>The\nContent and Context of Hate Speech: Rethinking Regulation and\nResponse</em>, Cambridge, New York: Cambridge University Press, pp.\n37–56.",
                "Popa-Wyatt, Mihaela, and Jeremy L. Wyatt, 2017, “Slurs,\nRoles and Power,” <em>Philosophical Studies</em>, 175(11):\n2879–2906.",
                "Post, Robert, 2009, “Hate Speech,” in Ivan Hare and\nJames Weinstein (eds.), <em>Extreme Speech and Democracy</em>, Oxford:\nOxford University Press.",
                "Reichman, Ammon, 2009, “Criminalizing Religiously Offensive\nSatire: Free Speech, Human Dignity, and Comparative Law,” in\nIvan Hare and James Weinstein (eds.), <em>Extreme Speech and\nDemocracy</em>, Oxford: Oxford University Press, pp.\n331–355.",
                "Richard, Mark, 2010, <em>When Truth Gives Out</em>, Oxford: Oxford\nUniversity Press.",
                "Saul, Jennifer M., 2018, “Dogwhistles, Political\nManipulation, and Philosophy of Language,” in Daniel W. Harris\nDaniel Fogal, and Matt Moss (eds.), <em>New Works on Speech Acts</em>,\nOxford: Oxford University Press, pp. 360–383.",
                "Sbisà, Marina, 2009, “Illocution and\nSilencing,” in Bruce Fraser, and Ken Turner (eds.), <em>Language\nin Life, and a Life in Language: Jacob Mey—a Festschrift</em>,\nBradford: Emerald, pp. 351–357.",
                "Schwartzman, Lisa H., 2002, “Hate Speech, Illocution, and\nSocial Context: A Critique of Judith Butler,” <em>Journal of\nSocial Philosophy</em>, 33(3): 421–441.",
                "Sen, Amartya, 1992, <em>Inequality Reexamined</em>, Cambridge, MA:\nHarvard University Press.",
                "Stanley, Jason, 2015, <em>How Propaganda Works</em>, Princeton:\nPrinceton University Press.",
                "Steinberger, Florian, and Julien Murzi, 2017,\n“Inferentialism,” in Bob Hale, Crispin Wright, Alexander\nMiller (eds.), <em>A Companion to the Philosophy of Language</em>,\nsecond edition, Oxford: Wiley Blackwell, pp. 197–224.",
                "Tesler, M., and D. O. Sears, 2010, <em>Obama’s Race: The\n2008 Election and the Dream of a Post-Racial America</em>, Chicago:\nUniversity of Chicago Press.",
                "Tirrell, Lynne, 1999, “Derogatory Terms: Racism, Sexism, and\nthe Inferential Role Theory of Meaning,” in Christina Hendricks,\nand Kelly Oliver (eds.), <em>Language and Liberation: Feminism,\nPhilosophy, and Language</em>, Albany: State University of New York\nPress, pp. 41–79.",
                "Tonhauser, Judith, 2012, “Diagnosing (not-)at-issue\ncontent,” <em>Proceedings of Semantics of Underrepresented\nLanguages in the Americas</em>, 6: 239–254.",
                "UN General Assembly, <em>International Covenant on Civil and\nPolitical Rights</em>, 16 December 1966.",
                "UN General Assembly, <em>International Convention on the\nElimination of All Forms of Racial Discrimination</em>, 21 December\n1965,\n [<a href=\"https://legal.un.org/avl/pdf/ha/cerd/cerd_e.pdf\" target=\"other\">available online</a>].",
                "Waldron, Jeremy,2014, <em>The Harm in Hate Speech</em>, Cambridge,\nMA: Harvard University Press.",
                "West, Caroline, 2012, “Words that Silence? Freedom of\nExpression and Racist Hate Speech,” in Ishani Maitra, and Mary\nKate McGowan (eds.), <em>Speech and Harm: Controversies over Free\nSpeech</em>, Oxford: Oxford University Press, pp. 222–248.",
                "Whine, Michael, 2009, “Expanding Holocaust Denial and\nLegislation Against It,” in Ivan Hare and James Weinstein\n(eds.), <em>Extreme Speech and Democracy</em>, Oxford: Oxford\nUniversity Press, pp. 538–556.",
                "White, Ismail, 2007, “When Race Matters and When It\nDoesn’t: Racial Group Differences in Response to Racial\nCues,” <em>American Political Science Review</em>, 101(2):\n339–54.",
                "Whiting, Daniel, 2008, “Conservatives and Racists:\nInferential Role Semantics and Pejoratives,”\n<em>Philosophia</em>, 36(3): 375–388.",
                "Williamson, Timothy, 2009, “Reference, Inference, and the\nSemantics of Pejoratives,” in J. Almog, and P. Leonardi (eds.),\n<em>The Philosophy of David Kaplan</em>, Oxford: Oxford University\nPress, pp. 137–158.",
                "Wistrich, Robert, 2012, <em>Holocaust Denial: The Politics of\nPerfidy</em>, Berlin: De Gruyter."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Anderson, Elizabeth, and Richard Pildes, 2000, “Expressive\nTheories of Law: A General Restatement,” <em>University of\nPennsylvania Law Review</em>, 148: 1503–1575.</li>\n<li>Anderson Luvell and Lepore, Ernest, 2013a, “Slurring\nWords,” <em>Noûs</em>, 47(1): 25–48.</li>\n<li>–––, 2013b, “What Did You Call Me? Slurs\nas Prohibited Words,” <em>Analytic Philosophy</em>, 54(3):\n350–363.</li>\n<li>Appiah, Kwame Anthony, 2012, “What’s Wrong with\nDefamation of Religion?” in Michael Herz, and Peter Molnar\n(eds.), <em>The Content and Context of Hate Speech: Rethinking\nRegulation and Response</em>, Cambridge; New York: Cambridge\nUniversity Press, pp. 164–182.</li>\n<li>Ashwell, Lauren, 2016, “Gendered Slurs,” <em>Social\nTheory and Practice</em>, 42(2): 228–39.</li>\n<li>Austin. J. L., 1962, <em>How to do Things with Words</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Bach, Kent, 2018, “Loaded Words: On the Semantics and\nPragmatics of Slurs,” in David Sosa (ed.), <em>Bad Words:\nPhilosophical Perspectives on Slurs</em>, Oxford: Oxford University\nPress, pp. 60–76.</li>\n<li>Baker, C. Edwin, 2012, “Hate Speech,” in Michael Herz,\nand Peter Molnar (eds.), <em>The Content and Context of Hate Speech:\nRethinking Regulation and Response</em>, Cambridge, New York:\nCambridge University Press, pp. 57–80.</li>\n<li>Bauer, Nancy, 2015, <em>How to Do Things with Pornography</em>,\nCambridge, MA: Harvard University Press.</li>\n<li><em>Beauharnais v. People of the State of Illinois</em>, 343 U.S.\n250 (1952).</li>\n<li>Behrens,Paul, Terry, N. and Jensen, O (eds.), 2017, <em>Holocaust\nand Genocide Denial: A Contextual Perspective</em>, Abingdon; New\nYork: Routledge, Taylor and Francis Group.</li>\n<li>Bolinger, Renée Jorgensen, 2017, “The Pragmatics of\nSlurs,” <em>Noûs</em>, 51(3): 439–462.</li>\n<li><em>Brandenburg v. Ohio</em>, 395 U.S. 444 (1969).</li>\n<li>Brandom, Robert, 1994, <em>Making it Explicit</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Brown, Alexander, 2017a, “What Is Hate Speech? Part 1: The\nMyth of Hate,” <em>Law and Philosophy</em>, 36(4):\n419–468.</li>\n<li>–––, 2017b, “What Is Hate Speech? Part 2:\nFamily Resemblances,” <em>Law and Philosophy</em>, 36(5):\n561–613.</li>\n<li>Brison, Susan, 1998a, “The Autonomy Defense of Free\nSpeech,” <em>Ethics</em>, 108(2): 312–339.</li>\n<li>–––, 1998b, “Speech, Harm, and the\nMind-Body Problem in First Amendment Jurisprudence,” <em>Legal\nTheory</em>, 4: 39–61.</li>\n<li>Butler, Judith, 1997, <em>Excitable Speech: A Politics of the\nPerformative</em>, New York: Routledge.</li>\n<li>Camp, Elisabeth, 2013, “Slurring Perspectives,”\n<em>Analytic Philosophy</em>, 54(3): 330–349.</li>\n<li>–––, 2018, “Slurs as Dual-Act\nExpressions,” in David Sosa (ed.), <em>Bad Words</em>, Oxford:\nOxford University Press, pp. 29–59.</li>\n<li>Caponetto, Laura, 2021, “A Comprehensive Definition of\nIllocutionary Silencing,” <em>Topoi</em>, 40:\n191–202.</li>\n<li>Cepollaro, Bianca, 2015, “In Defense of a Presuppositional\nAccount of Slurs,” <em>Language Sciences</em>, 52:\n36–45.</li>\n<li>Croom, Adam, 2011, “Slurs,” <em>Language\nSciences</em>, 33: 343–358.</li>\n<li>Delgado, Richard, 1993, “Words that Wound: A Tort Action for\nRacial Insults, Epithets, and Name Calling,” in Mari Matsuda,\nCharles Lawrence III, Richard Delgado, and Kimberlé Crenshaw\n(eds.), <em>Words that Wound: Critical Race Theory, Assaultive Speech\nand the First Amendment</em>, Boulder, CO: Westview Press, pp.\n89–110.</li>\n<li>Delgado, Richard, and Jean Stefancic, 2004, <em>Understanding\nWords that Wound</em>, Boulder, CO: Westview Press.</li>\n<li>Dummett, Michael, 1993, <em>Frege: Philosophy of Language</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Gallie, W. B., 1955, “Essentially Contested Concepts,”\n<em>Proceedings of the Aristotelian Society</em>, 56:\n167–198.</li>\n<li>Gelber, Katharine, 2012a, “Reconceptualizing Counterspeech\nin Hate-Speech Policy (with a Focus on Australia),” in Michael\nHerz, and Peter Molnar (eds.), <em>The Content and Context of Hate\nSpeech: Rethinking Regulation and Response</em>, Cambridge, New York:\nCambridge University Press, pp. 198–216.</li>\n<li>–––, 2012b, “‘Speaking Back’:\nThe Likely Fate of Hate Speech Policy in the United States and\nAustralia,” in Ishani Maitra and Mary Kate McGowan (eds.),\n<em>Speech &amp; Harm: Controversies Over Free Speech</em>, New York:\nOxford University Press, pp. 50–71.</li>\n<li>–––, 2017, “Hate Speech—Definitions\n&amp; Empirical Evidence,” <em>Constitutional Commentary</em>,\n32(3): 619–629.</li>\n<li>Gelber, Katharine, and Luke McNamara, 2016, “Evidencing the\nHarms of Hate Speech,” <em>Social Identities</em>, 22 (3):\n324–341.</li>\n<li>Herz, Michael, and Peter Molnar (eds.), 2012, <em>The Content and\nContext of Hate Speech: Rethinking Regulation and Responses</em>,\nCambridge, New York: Cambridge University Press.</li>\n<li>Hesni, Samia, 2018, “Illocutionary Frustration,”\n<em>Mind</em>, 127(508): 947–976.</li>\n<li>Heyman, Steven, 2008, <em>Free Speech and Human Dignity</em>, New\nHaven: Yale University Press.</li>\n<li>Hom, Christopher, 2008, “The Semantics of Racial\nEpithets,” <em>Journal of Philosophy</em>, 105:\n416–440.</li>\n<li>Hornsby, Jennifer, 1994, “Illocution and its\nSignificance,” in Savas L. Tsohatzidis (ed.), <em>Foundations of\nSpeech Act Theory: Philosophical and Linguistic Perspectives</em>,\nLondon: Routledge, pp. 187–207.</li>\n<li>–––, 2001, “Meaning and Uselessness: How\nto Think About Derogatory Words,” <em>Midwest Studies in\nPhilosophy</em>, 25(1): 128 – 141.</li>\n<li>Hornsby, Jennifer, and Rae Langton, 1998, “Free Speech and\nIllocution,” <em>Legal Theory</em>, 4: 21–37.</li>\n<li>Imbleau, Martin, 2011, “Denial of the Holocaust, Genocide,\nand Crimes Against Humanity,” in Ludovic Hennebel and Thomas\nHochmann (eds.) <em>Genocide Denials and the Law</em>, New York:\nOxford University Press, pp. 235–277.</li>\n<li>Jeshion, Robin, 2013a, “Expressivism and the Offensiveness\nof Slurs,” <em>Philosophical Perspectives</em>, 27:\n231–259.</li>\n<li>–––, 2013b, “Slurs and Stereotypes,”\n<em>Analytic Philosophy</em>, 54 (3): 314–329.</li>\n<li>Khoo, Justin, 2017, “Code Words in Political\nDiscourse,” <em>Philosophical Topics</em>, 45 (2):\n33–64.</li>\n<li>Kirk-Giannini, Cameron Domenico, 2019, “Slurs are\nDirectives,” <em>Philosopher’s Imprint</em>, 19(48):\n1–28.</li>\n<li>Kukla, Quill [writing as Rebecca], 2014, “Performative\nForce, Convention, and Discursive Injustice,” <em>Hypatia</em>,\n29 (2): 440–457.</li>\n<li>–––, 2018, “Slurs, Interpellation, and\nIdeology,” <em>The Southern Journal of Philosophy</em>, 56(S1):\n7–32.</li>\n<li>Langton, Rae, 1993, “Speech Acts and Unspeakable\nActs,” <em>Philosophy &amp; Public Affairs</em>, 22(4):\n293–330.</li>\n<li>–––, 2012, “Beyond Belief: Pragmatics in\nHate Speech and Pornography,” in Ishani Maitra and Mary Kate\nMcGowan (eds.), <em>Speech &amp; Harm: Controversies Over Free\nSpeech</em>, New York: Oxford University Press, pp. 72–93.</li>\n<li>–––, 2018a, “The Authority of Hate\nSpeech,” in John Gardner, Leslie Green, and Brian Leiter (eds.),\n<em>Oxford Studies in Philosophy of Law</em> (Volume 3), New York:\nOxford University Press, pp. 123–152.</li>\n<li>–––, 2018b, “Blocking as Counter\nSpeech,” in Daniel W. Harris Daniel Fogal, and Matt Moss (eds.),\n<em>New Works on Speech Acts</em>, Oxford: Oxford University Press,\npp. 144–164.</li>\n<li>Langton Rae, and Caroline West, 1999, “Scorekeeping in a\nPornographic Language Game,” <em>Australasian Journal of\nPhilosophy</em>, 77(3): 303–319.</li>\n<li>Lawrence, Charles III, 1993, “If He Hollers Let Him Go:\nRegulating Racist Speech on Campus,” in Mari Matsuda, Charles\nLawrence III, Richard Delgado, and Kimberlé Crenshaw (eds.),\n<em>Words that Wound: Critical Race Theory, Assaultive Speech and the\nFirst Amendment</em>, Boulder, CO: Westview Press, pp.\n53–88.</li>\n<li>Haney Lopez, Ian, 2014, <em>Dog Whistle Politics: How Coded Racial\nAppeals Have Reinvented Racism and Wrecked the Middle Class</em>,\nOxford: Oxford University Press.</li>\n<li>MacKinnon, Catharine, 1993, <em>Only Words</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Maitra, Ishani, 2009, “Silencing Speech,” <em>Canadian\nJournal of Philosophy</em>, 39(2): 309–338.</li>\n<li>–––, 2012, “Subordinating Speech,”\nin Ishani Maitra and Mary Kate McGowan (eds.), <em>Speech &amp; Harm:\nControversies Over Free Speech</em>, New York: Oxford University\nPress, pp. 94–120.</li>\n<li>Maitra, Ishani, and Mary Kate McGowan (eds.), 2012, <em>Speech\n&amp; Harm: Controversies Over Free Speech</em>, New York: Oxford\nUniversity Press.</li>\n<li>Matsuda, Mari, 1993, “Public Response to Racist Speech:\nConsidering the Victim’s Story,” in Mari Matsuda, Charles\nLawrence III, Richard Delgado, and Kimberlé Crenshaw (eds.),\n<em>Words that Wound: Critical Race Theory, Assaultive Speech and the\nFirst Amendment</em>, Boulder, CO: Westview Press, pp.\n17–51.</li>\n<li>Matsuda, Mari, Charles Lawrence III, Richard Delgado, and\nKimberlé Crenshaw (eds.), 1993, <em>Words that Wound: Critical\nRace Theory, Assaultive Speech and the First Amendment</em>, Boulder,\nCO: Westview Press.</li>\n<li>McGowan, Mary Kate, 2004, “Conversational Exercitives:\nSomething Else We Do With Our Words,” <em>Linguistics and\nPhilosophy</em>, 27: 93–111.</li>\n<li>–––, 2009, “Oppressive Speech,”\n<em>Australasian Journal of Philosophy</em>, 87(3):\n389–407.</li>\n<li>–––, 2012, “On ‘Whites Only’\nSigns and Racist Hate Speech: Verbal Acts of Racial\nDiscrimination,” in Ishani Maitra and Mary Kate McGowan (eds.),\n<em>Speech &amp; Harm: Controversies Over Free Speech</em>, New York:\nOxford University Press, pp. 121–47.</li>\n<li>–––, 2014, “Sincerity Silencing,”\n<em>Hypatia</em>, 29(2): 458–473.</li>\n<li>–––, 2018, “On Covert Exercitives: Speech\nand the Social World,” in Daniel W. Harris Daniel Fogal, and\nMatt Moss (eds.), <em>New Works on Speech Acts</em>, Oxford: Oxford\nUniversity Press, pp. 185–201.</li>\n<li>–––, 2019, <em>Just Words: On Speech and Hidden\nHarm</em>, Oxford: Oxford University Press.</li>\n<li>McGowan, Mary Kate, and Ishani Maitra, 2009, “On Racist Hate\nSpeech and the Scope of a Free Speech Principle,” <em>Canadian\nJournal of Law and Jurisprudence</em>, 23(2): 343–372.</li>\n<li>Mendelberg, Tali, 2001, <em>The Race Card: Campaign Strategy,\nImplicit Messages, and the Norm of Equality</em>, Princeton: Princeton\nUniversity Press.</li>\n<li>Mikkola, Mari, 2011, “Illocution, Silencing and the Act of\nRefusal,” <em>Pacific Philosophy Quarterly</em>, 92:\n415–437.</li>\n<li>–––, 2019, <em>Pornography: a Philosophical\nIntroduction</em>, New York: Oxford University Press.</li>\n<li><em>Miller v. California</em>, 413 U.S. 15 (1973).</li>\n<li>Neufeld, Eleonore, 2019, “An Essentialist Theory of the\nMeaning of Slurs,” <em>Philosopher’s Imprint</em>, 19(35):\n1–29.</li>\n<li>Nunberg, Geoff, 2018, “The Social Life of Slurs,” in\nDaniel W. Harris, Daniel Fogal, and Matt Moss (eds.), <em>New Works on\nSpeech Acts</em>, Oxford: Oxford University Press, pp.\n237–295.</li>\n<li>Nussbaum, Martha, 2000, <em>Women and Human Development: The\nCapabilities Approach</em>, Cambridge: Cambridge University\nPress.</li>\n<li>–––, 2003, “Capabilities as Fundamental\nEntitlements: Sen and Social Justice,” <em>Feminist\nEconomics</em>, 9(2/3): 33–59.</li>\n<li>O’Donnell, Patrick, 2017, “Generics, Race, and Social\nPerspectives,” <em>Inquiry: An Interdisciplinary Journal of\nPhilosophy</em>, published online 26 January 2017.\ndoi:10.1080/00207543.2016.1266801</li>\n<li>Parekh, Bhikhu, 2012, “Is There a Case for Banning Hate\nSpeech?” in Michael Herz, and Peter Molnar (eds.), <em>The\nContent and Context of Hate Speech: Rethinking Regulation and\nResponse</em>, Cambridge, New York: Cambridge University Press, pp.\n37–56.</li>\n<li>Popa-Wyatt, Mihaela, and Jeremy L. Wyatt, 2017, “Slurs,\nRoles and Power,” <em>Philosophical Studies</em>, 175(11):\n2879–2906.</li>\n<li>Post, Robert, 2009, “Hate Speech,” in Ivan Hare and\nJames Weinstein (eds.), <em>Extreme Speech and Democracy</em>, Oxford:\nOxford University Press.</li>\n<li>Reichman, Ammon, 2009, “Criminalizing Religiously Offensive\nSatire: Free Speech, Human Dignity, and Comparative Law,” in\nIvan Hare and James Weinstein (eds.), <em>Extreme Speech and\nDemocracy</em>, Oxford: Oxford University Press, pp.\n331–355.</li>\n<li>Richard, Mark, 2010, <em>When Truth Gives Out</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Saul, Jennifer M., 2018, “Dogwhistles, Political\nManipulation, and Philosophy of Language,” in Daniel W. Harris\nDaniel Fogal, and Matt Moss (eds.), <em>New Works on Speech Acts</em>,\nOxford: Oxford University Press, pp. 360–383.</li>\n<li>Sbisà, Marina, 2009, “Illocution and\nSilencing,” in Bruce Fraser, and Ken Turner (eds.), <em>Language\nin Life, and a Life in Language: Jacob Mey—a Festschrift</em>,\nBradford: Emerald, pp. 351–357.</li>\n<li>Schwartzman, Lisa H., 2002, “Hate Speech, Illocution, and\nSocial Context: A Critique of Judith Butler,” <em>Journal of\nSocial Philosophy</em>, 33(3): 421–441.</li>\n<li>Sen, Amartya, 1992, <em>Inequality Reexamined</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Stanley, Jason, 2015, <em>How Propaganda Works</em>, Princeton:\nPrinceton University Press.</li>\n<li>Steinberger, Florian, and Julien Murzi, 2017,\n“Inferentialism,” in Bob Hale, Crispin Wright, Alexander\nMiller (eds.), <em>A Companion to the Philosophy of Language</em>,\nsecond edition, Oxford: Wiley Blackwell, pp. 197–224.</li>\n<li>Tesler, M., and D. O. Sears, 2010, <em>Obama’s Race: The\n2008 Election and the Dream of a Post-Racial America</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>Tirrell, Lynne, 1999, “Derogatory Terms: Racism, Sexism, and\nthe Inferential Role Theory of Meaning,” in Christina Hendricks,\nand Kelly Oliver (eds.), <em>Language and Liberation: Feminism,\nPhilosophy, and Language</em>, Albany: State University of New York\nPress, pp. 41–79.</li>\n<li>Tonhauser, Judith, 2012, “Diagnosing (not-)at-issue\ncontent,” <em>Proceedings of Semantics of Underrepresented\nLanguages in the Americas</em>, 6: 239–254.</li>\n<li>UN General Assembly, <em>International Covenant on Civil and\nPolitical Rights</em>, 16 December 1966.</li>\n<li>UN General Assembly, <em>International Convention on the\nElimination of All Forms of Racial Discrimination</em>, 21 December\n1965,\n [<a href=\"https://legal.un.org/avl/pdf/ha/cerd/cerd_e.pdf\" target=\"other\">available online</a>].</li>\n<li>Waldron, Jeremy,2014, <em>The Harm in Hate Speech</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>West, Caroline, 2012, “Words that Silence? Freedom of\nExpression and Racist Hate Speech,” in Ishani Maitra, and Mary\nKate McGowan (eds.), <em>Speech and Harm: Controversies over Free\nSpeech</em>, Oxford: Oxford University Press, pp. 222–248.</li>\n<li>Whine, Michael, 2009, “Expanding Holocaust Denial and\nLegislation Against It,” in Ivan Hare and James Weinstein\n(eds.), <em>Extreme Speech and Democracy</em>, Oxford: Oxford\nUniversity Press, pp. 538–556.</li>\n<li>White, Ismail, 2007, “When Race Matters and When It\nDoesn’t: Racial Group Differences in Response to Racial\nCues,” <em>American Political Science Review</em>, 101(2):\n339–54.</li>\n<li>Whiting, Daniel, 2008, “Conservatives and Racists:\nInferential Role Semantics and Pejoratives,”\n<em>Philosophia</em>, 36(3): 375–388.</li>\n<li>Williamson, Timothy, 2009, “Reference, Inference, and the\nSemantics of Pejoratives,” in J. Almog, and P. Leonardi (eds.),\n<em>The Philosophy of David Kaplan</em>, Oxford: Oxford University\nPress, pp. 137–158.</li>\n<li>Wistrich, Robert, 2012, <em>Holocaust Denial: The Politics of\nPerfidy</em>, Berlin: De Gruyter.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "cognitivism vs. non-cognitivism, moral",
            "freedom: of speech",
            "pornography: and censorship",
            "respect",
            "semantics: proof-theoretic",
            "speech acts"
        ],
        "entry_link": [
            {
                "../moral-cognitivism/": "cognitivism vs. non-cognitivism, moral"
            },
            {
                "../freedom-speech/": "freedom: of speech"
            },
            {
                "../pornography-censorship/": "pornography: and censorship"
            },
            {
                "../respect/": "respect"
            },
            {
                "../proof-theoretic-semantics/": "semantics: proof-theoretic"
            },
            {
                "../speech-acts/": "speech acts"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=hate-speech\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/hate-speech/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=hate-speech&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/hate-speech/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=hate-speech": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/hate-speech/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=hate-speech&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/hate-speech/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Swanson, Eric, 2015,\n “<a href=\"http://www-personal.umich.edu/~ericsw/research/Swanson,%20Slurs%20and%20Ideologies%20November%202015.pdf\" target=\"other\">Slurs and Ideology</a>,”\n unpublished manuscript",
            "American Library Association,\n “<a href=\"https://www.ala.org/advocacy/intfreedom/hate\" target=\"other\">Hate Speech and Hate Crime</a>”",
            "<a href=\"https://www.coe.int/en/web/european-commission-against-racism-and-intolerance/hate-speech-and-violence\" target=\"other\">European Commission against Hate Speech and Violence</a>",
            "<a href=\"https://www.un.org/en/genocideprevention/documents/UN%20Strategy%20and%20Plan%20of%20Action%20on%20Hate%20Speech%2018%20June%20SYNOPSIS.pdf\" target=\"other\">UN Strategy and Plan of Action on Hate Speech</a>",
            "UNESCO,\n “<a href=\"https://unesdoc.unesco.org/ark:/48223/pf0000233231\" target=\"other\">Countering Online Hate Speech</a>”",
            "Rights for Peace,\n “<a href=\"https://www.rightsforpeace.org/hate-speech\" target=\"other\">Hate Speech</a>”",
            "Anti-Defamation Leage,\n “<a href=\"https://dc.adl.org/resources-for-responding-to-hate-in-the-community/\" target=\"other\">Resources for Responding to Hate Speech in the Community</a>”",
            "Library of Parliament Research Publication,\n “<a href=\"https://lop.parl.ca/sites/PublicWebsite/default/en_CA/ResearchPublications/201825E\" target=\"other\">Hate Speech and Freedom of Expression: Legal Boundaries in Canada</a>”"
        ],
        "listed_links": [
            {
                "http://www-personal.umich.edu/~ericsw/research/Swanson,%20Slurs%20and%20Ideologies%20November%202015.pdf": "Slurs and Ideology"
            },
            {
                "https://www.ala.org/advocacy/intfreedom/hate": "Hate Speech and Hate Crime"
            },
            {
                "https://www.coe.int/en/web/european-commission-against-racism-and-intolerance/hate-speech-and-violence": "European Commission against Hate Speech and Violence"
            },
            {
                "https://www.un.org/en/genocideprevention/documents/UN%20Strategy%20and%20Plan%20of%20Action%20on%20Hate%20Speech%2018%20June%20SYNOPSIS.pdf": "UN Strategy and Plan of Action on Hate Speech"
            },
            {
                "https://unesdoc.unesco.org/ark:/48223/pf0000233231": "Countering Online Hate Speech"
            },
            {
                "https://www.rightsforpeace.org/hate-speech": "Hate Speech"
            },
            {
                "https://dc.adl.org/resources-for-responding-to-hate-in-the-community/": "Resources for Responding to Hate Speech in the Community"
            },
            {
                "https://lop.parl.ca/sites/PublicWebsite/default/en_CA/ResearchPublications/201825E": "Hate Speech and Freedom of Expression: Legal Boundaries in Canada"
            }
        ]
    }
}