{
    "url": "ibn-ezra",
    "title": "Abraham Ibn Ezra",
    "authorship": {
        "year": "Copyright © 2018",
        "author_text": "Tzvi Langermann",
        "author_links": [],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2018</a> by\n\n<br/>\nTzvi Langermann\n\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Dec 19, 2006",
        "substantive revision Mon Oct 22, 2018"
    ],
    "preamble": "\n\n \nAll histories of Jewish philosophy include an entry on Abraham Ibn\nEzra, and, judging from his impact on the field, he certainly deserves\nthe recognition that he has received. Just how he earned it, however,\nposes a difficult historical problem. Ibn Ezra contributed virtually\nnothing to any of the branches of philosophy; he authored little in\nthe way of strictly philosophical tracts and, indeed, there is no\nreason for us to suppose that he enjoyed any rigorous training in\nphilosophy.  Yet he certainly left his mark on Jewish thought, and his\npronouncements are recorded and treated with respect by those who came\nafter him.\n\n\nIbn Ezra’s philosophical legacy consists in the main of the following,\nrather short list of doctrines. The deity governs the terrestrial\nworld by means of the heavenly bodies. Humans toil under astral\ndestiny; though the stars are subservient, formally at least, to God,\ntheir domination over the material universe is for all practical\npurposes complete. Neither the precise structure of the human soul,\nnor the mode of its bonding with the body, may be known with\ncertainty.  However, one component or aspect of the human soul is of\nthe same fiber as the supernal realm that is above the stars; nothing\nin existence is more similar to God. Nurturing this spiritual\ncomponent offers the one hope of refuge from this world. Ibn Ezra’s\npoetry in particular gives very powerful expression to the themes of\nthe soul’s alienation and longing to return to its heavenly abode. To\nbe sure, weighty questions are involved in all of these teachings, but\nIbn Ezra does not take any of them up in depth.\n\n\nIn sum, it appears that Ibn Ezra, much like Sa‘adiah—the\nJewish thinker who probably influenced him most strongly—adopted a mix of\nkalam and philosophical doctrines. There simply is no evidence that he\ntrained in philosophy or studied anything more than a small sampling\nof the literature available in his day, which was considerable. His\nacknowledged sources are nearly all brief, gaonic, writings, which\ndisplay the first grapplings of medieval Jewry with theological\nissues.\n\n\nNonetheless, Ibn Ezra achieved the status of the sage whose remarks,\ncurt and enigmatic though they may be, carry weight and authority. In\na way, his role in philosophy, or, perhaps better put, in spreading\ncertain philosophical teachings, is not that different from the one he\nplayed in mathematics, astronomy, and astrology. His copious writings\non those subjects are not distinguished by any depth or originality;\nyet there can be no doubt that their role was pivotal in the spread of\nknowledge throughout Europe, most especially within the Jewish\ncommunities, though by no means limited to them. While not pretending\nto offer a complete and completely satisfying answer, we suggest a\ncombination of factors that facilitated his success: industriousness,\nwide travels, the very popular vehicle of bible commentary, rational\nthought that gives a prominent place to astrology, and a soteriology\nthat focuses upon the individual rather than the collective.\n",
    "toc": [
        {
            "#LifWor": "1. Life and Works"
        },
        {
            "#Ast": "2. Astrology"
        },
        {
            "#Imp": "3. Impact"
        },
        {
            "#EmpUpoInd": "4. Emphasis upon the Individual"
        },
        {
            "#ChaHisTho": "5. Characterizations of his Thought"
        },
        {
            "#WhaForIbnEzrWhoHisPhi": "6. What is Philosophy for Ibn Ezra? Who are his philosophers?"
        },
        {
            "#IbnEzrJudHal": "7. Ibn Ezra and Judah Halevi"
        },
        {
            "#PoeSciSou": "8. Poetry and the Science of the Soul"
        },
        {
            "#ExcSouComEcc": "9. Excursus on the Soul in a Comment to Ecclesiastes "
        },
        {
            "#RatCom": "10. Rationale for the Commandments: Yesod Mora"
        },
        {
            "#PhiAllHayBenMeq": "11. Philosophical Allegory: Hayy ben Meqitz"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PriSou": "Primary Sources"
        },
        {
            "#SecSou": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Works\n\n\nIbn Ezra was likely born in or around 1093 in Tudela, at that time\nwithin the northern reaches of Muslim Spain. There he passed the first\nfive decades of his life, apparently eking out his living as a poet.\nLike so many other Jews, he fled Spain in the face of the Almohade\nonslaughts of 1140. For the next three decades he wandered through\nEurope, spending time in Rome, Lucca, Rouen, London, and\nBéziers. Nearly all of the substantial body of writing that he\nleft behind dates to this period. The names of a few of his students,\ncorrespondents, rivals, and patrons are known. We are rather\nwell-informed about Ibn Ezra’s relationship with Judah Halevi; their\nexchanges are very instructive for the history of Jewish philosophy,\nand we will return to them below. On the other hand, none of his\ndisciples (who in any event do not seem to have been numerous) has\nclarified for us any of the “secrets” that Ibn Ezra is\nfond to refer to.\n\n\nIbn Ezra’s literary legacy consists of short and extremely popular\nhandbooks in a wide variety of fields: grammar and poetics, astrology\nand arithmetic, astronomy and religious speculations, as well as both\nshort and lengthier biblical commentaries. Most of his astrological\ntracts circulate in at least two versions; their Latin versions played\na pivotal role in the spread of that art throughout Christian\nEurope. Manuscripts number in many dozens. The biblical commentaries\nare also found in very manuscripts, and they are included in the\nmargins of numerous printings. On the other hand, there are relatively\nfew critical editions of his writings.  This situation has been\nlargely rectified for his astrological writings, surely the most\nimportant part of his corpus, due to the untiring work of Shlomo\nSela. Moreover, Sela’s highly praised editions, studies and translations have\nbrought to light even more texts, in both Hebrew and Latin. (For the\nmost recent inventory of primary sources and secondary studies, see\nSela and Freudenthal 2006; newer editions by Sela are listed in the\nbibliography.) Several long excursuses, for example to Exodus 3:15 or\nExodus 33:21, recap his statements on the main issues. Yesod Mora, a\nmonograph on the rationale underlying the biblical commandments\nwritten very late in his life, also contains a full statement of Ibn\nEzra’s teachings.\n\n\nTwo other short treatises have each a peculiar focus. Sefer\nha-Shem is an enigmatic treatise on God’s proper names\nwritten out with the Hebrew letters AHYH and YHWH. The basic idea is\nthat the special properties of the numbers associated with these\nletters, their phonetic qualities, grammatical functions and graphic\nrepresentations, all convey information about the godhead. Thus, for\ninstance, one (A, aleph) is the foundation of number, but not\na number itself; both five (H, heh) and six (W, waw)\nrepeat themselves as the final digit in all higher powers; and ten (Y,\nyod) is the beginning of the next order in the decimal\nsystem. All this seems to indicate the unchanging aspect of the divine\nin its successive manifestations. The same collection of ideas is\nfound in non-philosophical writings, for example, the grammatical\ntreatise Sefer Zahut.\n\n\nIndeed, if Ibn Ezra can be located within any of the major\nphilosophical traditions, his place is among the\nPythagoreans. Sefer ha-Ehad is Ibn Ezra’s venture in\narithmology. Like the writings of Nicomachus of Gerasa and Philo, as\nwell as a relatively short list of medieval Muslim and Jewish\nauthors, Sefer ha-Ehad follows the Pythagorean tradition of\nlisting which natural, mathematical, and other items, come in two’s,\nthree’s, etc. As we have seen in the preceding paragraph, Ibn Ezra\npressed especially the theological implications of these arithmetic\nproperties.\n\n\nThe two most “philosophical” of his writings are\nHayy ben Meqitz, a poetic visionary recital to be discussed\nin a separate section below, and Arugat ha-Bosem.  The latter\nis also poetic in style. The doctrine it presents, for example\natomism, is very much part and parcel of the kalam tradition, rather\nthan philosophy, strictly speaking. For that reason, Ibn Ezra’s\nauthorship has been called into question (Greive 1973, 181–189,\nincluding German translation of the entire text). However, even such a\ncommitted neoplatonist as Isaac Israeli had no compunction about\ncontributing to the kalam, and there is no reason a priori to think\nthat the situation would have been different for Ibn Ezra. Allegiances\nto streams of thought in that period were not necessarily\nexclusivist. \n\n\nThe two strongest identifiable influences on Ibn Ezra’s thought are the anonymous\ntract known as Sefer Yesira and Sa‘adiah Gaon. The\nformer is his acknowledged source for surveying reality according to\nthree parallel schemes: Hebrew letters, numbers, and the cosmos.\nSa‘adiah is cited very frequently, over thirty times in the\ncommentary to the Torah alone. Some medieval writers cite from a\ncommentary to Sefer Yesira that they ascribe to Ibn\nEzra. Paul Fenton (2001) has argued that the text in question\nis a Hebrew condensation of the commentary by Dunash Ibn Tamîm,\noriginally written in Arabic, and that Ibn Ezra may indeed have\nprepared the Hebrew version. However, Dunash was a student of Isaac\nIsraeli, who strongly criticized Sa‘adiah’s commentary to\nSefer Yesira. Thus Ibn Ezra may, unwittingly, have drawn most\nheavily upon two divergent streams of thought. As we have seen, this\nis not as shocking as it may seem. Ibn Ezra was interested in ideas,\nbut not in putting them all together into one tight and fully coherent\nsystem.\n\n\nA few other sources are named in Yesod Mora: Shi‘ur\nQoma, a cryptic writing that, like Sefer Yesira,\nnourished a good deal of speculation, much of it mystical, and a\ncertain Sefer ha-Yihud, which is not extant. These works date\nto the gaonic period which, in Jewish historiography, corresponds to\nvery late antiquity and the early Middle Ages. All in all, then, the\nsources that Ibn Ezra cites by name are a mix of gaonic kalam and\nproto-kabbalistic mysticism. Ibn Ezra adopted the literary format of\nearly gaonic texts for those of his writings that can be called\nphilosophical.  Yesod Mora and Sefer ha-Shem,\n“The Book of the [Divine] Name”, are dense and cryptic,\nmuch like Sefer Yesira and Shi‘ur Qoma.\n\n\nIbn Ezra can be contextualized among the Andalusian philosophizing\nHebrew poets, especially Ibn Gabirol and Halevi. These poets were\nfamiliar in varying degrees with what has come to called Islamic\nneoplatonism; all sought support for their views in the Hebrew Bible,\nsuitably interpreted according to each one’s preferences; and\nall were driven by a strong spiritual thirst. Hebrew poetry was the\nvehicle for expressing their deep religious thirst.\n\n\nThough far less schooled in the philosophical tradition, Ibn\nEzra’s thoughts on emanation are similar to those of Ibn\nGabirol. Indeed, Ibn Gabirol is the only undeniably neoplatonic author\ncited by Ibn Ezra and may represent his only confirmed link to that\ntradition. Ibn Ezra is our only source for some Ibn Gabirol’s\nallegorical readings of verses from Genesis.\n\n\nThroughout his life Ibn Ezra continued to write poetry in a wide\nvariety of styles. Some of his liturgies make use of concepts drawn\nfrom medieval psychology. However, it is not so much the display of\nterminology, as it is the deep, powerful and sincere longings for\nliberation and the divine that are instructive for an appreciation of\nhis thought. Ibn Ezra was no schoolman, but he certainly experienced,\nand expressed in rich and evocative Hebrew, a deep alienation from\nmundane reality and passionate longing to return to the spiritual\nrealm.\n2. Astrology\n\n\nThe central place of astrology in Ibn Ezra’s thought must be singled\nout here. The query of the rabbis of Provence to Maimonides about the\nlegitimacy of astrology was most likely prompted by the spread of Ibn\nEzra’s astrological teachings (Sela 2004). Though the query and\nMaimonides’ response both turned upon the interpretation of\ntraditional texts and their legal implications, de rigueur in\ncorrespondence of this sort, one finds here new probings into issues\nsuch as free will and divine governance. Ibn Ezra spurred a\nreassessment of Jewish positions on these points.\n\n\nAstrology was one of Ibn Ezra’s major interests, and it plays an\nimportant role in his thought (Sela 2001, mainly for bibliography;\nGoldstein 1996, for precise contents analysis). Briefly—in fact,\nas we have repeatedly noted, Ibn Ezra’s expositions are always brief,\nwith little argumentation—Ibn Ezra considers the material\nuniverse to be divided into celestial and terrestrial realms, the\nlatter totally under the sway of the former. Humans can link up to a\nthird, divine and super-celestial realm, thus outmaneuvering the\nstars, so to speak. However, more often than not, this will bring no\nrelief to one’s earthly plight; in any case, pessimism of this sort\ninforms Ibn Ezra’s commentary to Ecclesiastes. Ibn Ezra advocates a\nStoic-like faith: the connection to the world “above the\nstars” affords one the spiritual stamina to endure whatever\nearthly misery the stars may dish out (Langermann 1993).\n\n\nThere is no difference between Jews and non-Jews with regard to astral\ngovernance. Here again, Ibn Ezra, in his biblical commentaries, was\nvague enough to give the impression that Jews alone are exempt from\nthe decrees of the stars, thus ingratiating himself to those many of\nhis readers who were disposed to thinking that way. However, in his\nastrological writings, the Jews are no different from other peoples,\nin that they too are associated with certain planets and signs; this\npoint was not lost upon his super-commentators. Ibn Ezra’s astrology,\nlike his philosophy overall, is humanist and universal, not Jewish and\nparticularist. (See on this point, from a different perspective,\nHughes 1999.)\n\n\nAstrology offered a rational explanation for some biblical\ncommandments, particularly animal sacrifices. True, over a millennium\nhad passed since the Temple temple rituals had ceased. However, new\nconceptions of worship led Jews to wonder why such acts had ever been\nneeded. In addition, new conceptions of Scripture caused Jews to ask\nwhy the details of the sacrifices had been recorded in the Torah, all\nof whose teachings were thought to be of permanent value, even if the\nrites themselves were no longer performed. Astrology provided a\nrationale: a practical reason for doing these performances as long as\nthe Temple stood, and a lesson in the way the cosmos functions whose\nvalue endures even after the Temple’s destruction. It should be added,\nhowever, that there is no evidence at all that these explanations\ninspired calls for the restoration of sacrifice. Ibn Ezra’s followers\nwere content merely to ponder these truths. Ironically, perhaps, the\nmessianic drive exhibited itself more in the thought of Judah Halevi\nwhose basic outlook, as we shall see, was diametrically opposed to\nthat of Ibn Ezra.\n3. Impact\n\n\nIbn Ezra’s impact was swift and powerful. In the various communities\nthrough which he sojourned, the Arabic learning which he was able to\npresent in consumable form was widely read. As a cultural mediator,\nparticularly of astronomy and astrology, his contributions to\nChristian civilization were no less remarkable than those to his\ncoreligionists. (See, in particular, Burnett 1997.) Indeed, Ibn Ezra may\nwell be the most important cultural broker of the medieval period. His\nwritings in astrology, arithmetic, Hebrew grammar and poetics, and\nJewish thought all fall far short of the highest achievements set by\nJudaeo-Arabic culture in al-Andalus. Yet no one succeeded more than\nIbn Ezra in spreading the fruits of this culture so widely and\ndeeply.\n\n\nThis seems to be the main reason why he has secured his place in the\nhistory of Jewish philosophy. Even in those domains where he has\nrelatively much to say, for example, the theory of the soul, he draws\nupon stock notions that were widespread (especially among poets), and\nwhich by no means demonstrate a thorough education in philosophy, let\nalone the skill and propensity to philosophize. Historians of Jewish\nliturgy such as Jefim Schirmann have pointed out that Ibn Ezra was\nharping on themes that had been favorites of Jewish poets for\ngenerations. He exhibits a familiarity with many technical terms, and\non occasion broaches some issues; however, he has left us no\npenetrating discussions, or anything of the sort that would\ndemonstrate his mastery of the subject. Thus, for example, in his\ngloss to Exodus 23:30, he observes that we do not know whether the soul is\nsubstance or accident, whether it survives the death of the body, nor\nwhy it has been bonded to the body in the first place. However, one\ncan hardly find, if at all, any substantive discussions on any of\nthese three questions; he tells us nothing about the options, their\nimplications, or why the inquiry must end at an impasse.\n\n\nFor many Jews, Ibn Ezra was the spokesman of Hispano-Jewish culture,\nthe personification of the “Sefardi” sage. His readers\nwere led to believe that the prestige of Andalusian culture stood\nbehind Ibn Ezra’s pronouncements on issues such as the nature of the\nsoul or free will, and that the Torah could and should be read in a\nmanner that accommodates Ibn Ezra’s views.\n\n\nIbn Ezra’s use of the biblical commentary as a vehicle for the\ndissemination of his teachings was undoubtedly a major factor in his\nsuccess. His commentary (actually two are preserved for several books)\nwas a concise gloss, offering to his audiences a witty and critical\nselection of lexical and grammatical insights concerning the\n“plain” meaning of the text; this is the mode of\ninterpretation that he expressly endorses. Ibn Ezra spiced his\ncommentary with occasional references to a sod, meaning\neither (or both?) a secret, i.e. esoteric message ensconced in the\nbible—Ibn Ezra will teasingly pull at the veil, but never remove\nit—or a fundamental belief (sod thus being equivalent\nto yesod).  Ibn Ezra prefaced his commentary with a lengthy\nessay on the four improper, and the one proper, way to go about\ninterpreting the Torah. Finally, he dispersed a number of fairly long\ndigressions, self-standing essays in their own right, in which, in\nwhich he generally rehearsed the gamut of his trademark views on\ngrammar, arithmology, and astrology.\n\n \nIbn Ezra’s commentary, mostly by virtue of the terse, enticing,\nyet thoroughly abstruse sodot, spawned a huge satellite\nliterature (Simon 1993; Lawee 2017). These\n“supercommentaries” constitute one of the major branches\nof Jewish philosophical literature of the fourteenth century. As a\nrule, they tend to interpret Ibn Ezra along similar lines,\nemphasizing, for example, astral governance and the magical aspects of\nritual. Despite the obvious disagreements, these supercommentaries\nrepeatedly argued that Ibn Ezra and Maimonides are conveying the same\nmessage (Visi 2009).\n\n\nIbn Ezra succeeded in some sense in making himself all things to all\npeople. The supercommentators as a rule find Ibn Ezra to be expounding\na univeralist, or humanitarian, philosophy that shares much with, and\ndraws much from, non-Jewish thought. On the other hand, Moses\nNahmanides, an important exegete in his own right, a very astute\nreader of texts, and a staunch opponent of Aristotle, professed his\n“open hostility and concealed love” for Ibn Ezra. He loved\nmany, though certainly not all, of Ibn Ezra’s\n“hints,” which Nahmanides felt were in line with his own\nkabbalistic tendencies.\n\n\nEstimations of Ibn Ezra as a philosopher peaked in the fourteenth and\nfifteenth centuries. Glosses to his Torah\ncommentary, some of them quite extensive, were written throughout the\nMediterranean basin (Simon 1993). Ibn Ezra’s writings became known\nwithin Arabic speaking communities as well. At least one of these\nsupercommentaries was written in Judaeo-Arabic, and Ibn Ezra is cited,\nfor example, by Abraham Maimonides in his own commentary to the Torah.\nByzantine Jewish scholars in particular applied themselves to the\nentire corpus of Ibn Ezra’s philosophical writings. Mordecai\nKhoumtianou (Comteano) wrote commentaries to Yesod Mora and\nSefer ha-Shem, doing his best to read Ibn Ezra along the\nlines of the (basically Aristotelian) philosophy that he felt most\ncomfortable with.\n\n\nLevi ben Gerson, certainly one of the most systematic and original\nthinkers in the medieval Jewish tradition, will cite Abraham Ibn Ezra\njust as respectfully as he does Moses Maimonides. Consider, for\nexample, his discussion of God’s knowledge, especially the thorny\nquestion whether God knows a particular event befalling an individual\nper se, or whether He knows that event only “generally”,\nthat is, by way of His knowledge of the “ordering of events,\ninsofar as these events are ordered.” Levi argues in favor of\nthe second option, and at the end of the chapter, suggests that both\nMaimonides and Ibn Ezra would agree with him. For Maimonides’ view\nLevi can refer to the sustained discussion in Guide of the\nPerplexed 3.20; but for Ibn Ezra, he cites only the laconic\ncomment to Genesis 18:21, which states: “The truth is that He\nknows every particular generally, not as a\n particular.”[1]\n It seems particularly noteworthy that Levi musters both Maimonides\nand Ibn Ezra for support for the claim that his own view does not\ncontradict the Torah; both authorities are exploited, not for their\nargumentation on the issue, but rather for their reputation as\nexegetes. \n\n\nIbn Ezra never fell into oblivion, and his writings generated interest\nin a wide variety of cultural and historical settings.  However, there\nwere significant shifts in the perception of his place in Jewish\nthought. Thus Judah Moscato, the sixteenth century Venetian savant and\nauthor of a very learned commentary to Halevi’s Kuzari,\narrays Ibn Ezra together with Gersonides against Maimonides and\nHalevi—the former denying creation ex nihilo, the latter\ndefending it (Langermann 1997, 517).\n\n\nSpinoza singled out Ibn Ezra for being the first, as far as he knew,\nto question the Mosaic authorship of the Pentateuch (Harris 1993,\n130–132). This observation greatly enhanced Ibn Ezra’s stature as an\nexegete, especially among Christians. Ibn Ezra’s emphasis on\npeshat, the “natural” interpretation of the Bible\nfounded on philology and free of rabbinic interpretations, gained\nthereby considerable prestige. To be sure, Spinoza’s view of Ibn Ezra\nwas not uniformly positive, and, for his part, Ibn Ezra makes it quite\nclear that his philological tools are not to be applied against\ntradition, but only where there is no tradition, and, especially,\nwhere no normative practices are at stake. However, as we have already\nseen, there have been wide fluctuations in the image of Ibn Ezra and\nthe interpretation of his legacy.\n\n\nThe modern Jewish philosopher most indebted to Ibn Ezra is Nachman\nKrochmal. Jay Harris has argued persuasively that “Krochmal’s\nunderstanding of Ibn Ezra, and his motivation for that understanding,\ncan only be understood as the fashioning of a response to the most\ninteresting and serious philosophical critique of Judaism the\nnineteenth century produced” (Harris 1993, 144)—that is,\nthe critiques of Hegel and Schelling. Krochmal also influenced the\nphilological side of Ibn Ezra scholarship, for example, by casting\ndoubt upon the authenticity of Arugat ha-Bosem; there is as\nyet no consensus on this issue (Greive 1973, 175–177).\n4. Emphasis upon the Individual\n\n\nA very important feature of Ibn Ezra’s philosophy is its focus upon\nthe salvation of the individual. His expressions mark a major shift in\nreligious attitude. Traditional rabbinic Judaism, especially as\nreflected in the liturgy, had been concerned above all with the\ncollective redemption of the Jewish people. Sophisticated circles in\nJudaeo-Arabic culture of al-Andalus had, for at least a century before\nIbn Ezra, focused their soteriology instead on the ultimate felicity\nof the individual. It is very probable that in this issue, as in so\nmany others, Ibn Ezra’s role was that of the transmitter. The crisp\nformulations scattered throughout his biblical commentaries and\ntopical booklets were far more accessible to the Jews of Christian\nEurope than the writings of other Jewish Andalusians, and they were\npivotal in the spread of this key idea.\n\n\nThe focus upon the salvation of the individual comes out clearly in\nthe opening sections of Yesod Mora.  Ibn Ezra critically\nreviews the different motivations people have for gaining expertise in\nthe Law. Some do it for prestige, but this leads to social\nfriction.  Others study the Law in order to improve society. This is\ncommendable; however, this implies that in a just society, the Law\nwould be superfluous. We can carry Ibn Ezra’s reasoning further: the\nLaw must have some ultimate justification that is invariant over any\nand every social or historical situation. With this in mind, we can\nsee the connection to the next point raised in the passage, which is\nthis: many laws of the Torah are rarely if ever applied. How, then,\nthe reader is led to wonder, can the Law be an end in itself for\nJewish life?  Moreover, Ibn Ezra asks, how many legal experts do we\nneed anyway?\n\n\nTwo conclusions follow from this series of arguments. First, Torah\nstudy, in the sense of mastery of all the fine points of the Law, can\nnot be the ultimate purpose of our existence. Second, the ultimate\npurpose does not lie in one’s contribution to the community. Ibn Ezra\nis now ready to state what the goal of life is:\n\n\n“The person (ha-adam) must set himself aright. He must\nknow the commandments of God, Who created everything. He must try with\nall of his strength to understand [God’s] works—then he will\nknow his Creator…and when he knows Him he will find favor in\nHis eyes.” After citing some biblical prooftexts—standard\nfare by then in the Arabic speaking communities for the view that\nknowledge is the true form of worship—Ibn Ezra sums up: “It is\nfor this reason that man was created. Once one has rectified oneself,\nhe may set others aright, if this be possible” (Cohen 2002,\n83–84).\n\n\nOn the face of it, then, Ibn Ezra conforms to the tradition that the\nTorah gives meaning to life. However, the Law is now just one of God’s\nhandiworks, and not necessarily the most important of them. Ibn Ezra\nclearly subscribes to the view then current among philosophers that\nthe purpose and goal of human existence is to know God. This\nresponsibility devolves upon each individual; it is not a communal\nproject and, indeed, Ibn Ezra evinces no interest in the “ideal\ncity”.  However, he merely states this goal; he has no theory of\nthe intellect, no refined or even coarse epistemology. He has in\neffect grossly devalued Torah study, but he has done this in a way\nthat is not abrasive. (In fact, there is a long-standing controversy\nas to how much “Torah” Ibn Ezra himself knew.) This is a\nclassic example of the way Ibn Ezra quietly if not elegantly\ninsinuates radical views into the tradition.    \n5. Characterizations of his Thought\n\n\nIbn Ezra’s thought has been located (or fitted) into three\ntraditions. Many medieval philosophers, and opponents of philosophy as\nwell, sensed a commonality of purpose as well as the sharing of basic\ndoctrines between Ibn Ezra and Maimonides. Joint allegiance to\nMaimonides and Ibn Ezra was particularly strong in the fourteenth\ncentury. The principal vehicle for this trend of thought was the\nsupercommentaries to Ibn Ezra, which number a few dozen. These authors\nwere particularly impressed by the willingness of both sages to appeal\nto sources beyond the traditional rabbinic corpus in order to\nunderstand the biblical narratives and commandments. Rationality (in\nthe sense of seeking rationales for Judaism, its beliefs and precepts)\nbonded Ibn Ezra and Maimonides, blurring the differences between the\ntwo, most notably on the important question of the legitimacy of\nastrology.\n\n\nThe pseudepigraphic testament of Maimonides, in which he expresses his\nadmiration in the strongest terms for Ibn Ezra’s Torah commentary and\nthe “great and deep secrets” that he revealed there, is\nmost likely a product of this same trend. However, as Isadore Twersky\nhas pointed out, the fact that the “testament” is said to\nhave been written by Maimonides at the end of his life, after he had\nalready written his own works, indicates that its author wants us only\nto take note of the literary and notional parallels between the two\nthinkers; the forger is not prepared to make any stronger claims of\ninfluence (Twersky 1993, 39–40).\n\n\nJust how much, if anything, Maimonides owes to Ibn Ezra has been\ndebated for over a century, without any clear resolution. The survey\nof Twersky (1993) covers the ground well. The strongest claims extend\nIbn Ezra’s influence even to the realm of legal theory, asserting that\nthe fourteen principles enunciated by Maimonides at the beginning of\nhis Book of Commandments were inspired and to a degree\nmodeled upon the principles set down by Ibn Ezra in Yesod\nMora.  Since, by most modern accounts, Maimonides is to be\nclassified as an Aristotelian (or perhaps neo-Aristotelian), it should\nstand to reason that, were he really a follower of Ibn Ezra, the\nlatter would also be an Aristotelian. Histories of Jewish philosophy,\nas we shall see, unanimously locate Ibn Ezra in the Neoplatonist\ncamp. However, Yosef Cohen has recently argued that Ibn Ezra indeed\nfits more comfortably into the Aristotelian tradition (Cohen\n1996).\n\n\nGenerations of scholars have found the “neo-platonist”\nlabel to be most appropriate. Julius Guttmann, who may well be\nresponsible for defining medieval Jewish neoplatonism as a historical\ncategory, declared Ibn Ezra to be “the last in the line of\nJewish Neoplatonists”. Guttmann was fully aware, like all\nhistorians of Jewish thought, that Ibn Ezra was not a systematic\nthinker, and he was more precise than any later historian in\npinpointing the agreements and disagreements between Ibn Ezra and what\nmay be called standard neoplatonic teachings. Nonetheless, he averred\nthat “Ibn Ezra was moved more profoundly than most of his Jewish\npredecessors by the mysterious depths of Neoplatonism, approaching its\nmetaphysical content more closely than any of the others except\nGabirol” (Guttman 1973, 134).\n\n\nIsaac Husik marks Ibn Ezra’s role in the transmission of Andalusian\nwisdom, which consists of “grammar… mathematics and\nastronomy…the philosophy of Neo-Platonism, and the scientific\nand rationalistic spirit generally” (Husik 1969, 187). Like\nGuttmann, Husik calls attention to the affinity between Ibn Ezra and\nIbn Gabirol. In 1973, Hermann Greive published a book-length study of\nIbn Ezra under the title, Studien zum Jüdischen\nNeuplatonismus. Greive paid particular attention to Ibn Ezra’s\npsychology; this is indeed the branch of philosophy to which Ibn Ezra\nwas most strongly attracted, and the topic exploited most intensively\nby specialists in Ibn Ezra (Tanenbaum 1990;\nLevin 1992). However, Greive is well-aware that the presence of\nneoplatonic teachings in Ibn Ezra’s writings does not mean that Ibn\nEzra’s allegiance was limited to that school exclusively.\n\n\nThe trend is continued in the latest history of Jewish philosophy,\nthat by Colette Sirat, who discusses Abraham Ibn Ezra at the end of\nthe chapter on “The Neoplatonists”. However, cognizant of\nthe rich Hebrew literature of the later medieval period (much of which\nwas as yet unstudied and thus inaccessible to Guttmann), Sirat does\nnot make Ibn Ezra into the last neoplatonist. Instead she observes,\n“The neoplatonic influence clearly marked in the Jewish\nphilosophers of the thirteenth and fourteenth centuries was\nessentially expressed in terms and ideas drawn from Ibn Ezra”\n(Sirat 1985, 104).\n\n\nAaron Hughes acknowledges the problematic nature of the label\n“neoplatonic”; in a note he registers his preference to the view that\n“the Neoplatonic ‘system’ to which he subscribed\npermitted one to have many divided, and often competing,\nloyalties” (Hughes, 2002, n. 13). Nonetheless, Hughes too cannot\nresist the label. \n\n\nOne term in particular found in some key passages, kol or\n“all”, has attracted a good deal of attention of late.\nBuilding on the observations of several scholars, Elliot Wolfson\n(1990; see esp. p. 80, nn. 14–16, for references to earlier work on\nthe topic) examines closely the two different senses in which Ibn Ezra\nuses the term. At times it refers to the totality of created entities,\nbut in other passages it refers to an entity that comprises all things\nwithin itself in ideal form—not God, but the demiurge (yoser\nbereishit).  This dual meaning can be traced back to Proclus, and\nits usage highlights the neoplatonic trend in Ibn Ezra’s\nthought. Howard Kreisel (1994) has rejected this\ninterpretation. Kreisel criticizes the emphasis upon\n“neoplatonism” here; he encloses the term in quotation\nmarks, as the present writer tends to do, and for much the same\nreasons. Medieval Jewish neoplatonism is an ill-defined term, and all\nattempts to explicate Ibn Ezra’s “neoplatonism” are\nproblematic, forcing scholars to note numerous points of agreement\nbetween Ibn Ezra and the Aristotelians—which, in turn, cannot be\ndivorced from the neoplatonic interpretations informing Islamic\nAristotelianism in general. Kreisel argues that, when read closely in\ncontext, the texts in question display one meaning only for\nkol—God, the Creator God, and not the demiurge.\n\n\nHence there seems to be little profit in belaboring Ibn Ezra’s\nsupposed neoplatonism. On the other hand, Ibn Ezra’s affinities to Ibn\nGabirol (Avicebron to the Latins, and a neoplatonist for sure) are\nrelevant. Some of Ibn Gabirol’s allegorical readings of the Bible are\ncited by Ibn Ezra—indeed, he is our only source for them. Ibn\nGabirol’s Fons Vitae certainly belongs to the neoplatonic\ntradition. Significantly, however, that work (which Ibn Ezra would\npresumably have seen in the original Arabic) is not mentioned by Ibn\nEzra at all. By all indications, he would not have had the patience or\ndisposition for that text’s scholasticism.\n\n\nThe role of Ibn Gabirol is indeed pivotal. Ibn Gabirol was accused by\nhis contemporaries, and credited by modern scholars, with introducing\n“Greek” notions into his poetry. All the great Andalusian\npoets were to some degree—Ibn Ezra, quite\nsubstantially—students and imitators of Ibn Gabirol. The link\nbetween Ibn Ezra and Ibn Gabirol is significant, but the common thread\nrunning between the two, and other Andalusian Jewish poets as well who\nplunged into “the mysterious depths of Neoplatonism”, is\nto be found in their poetry, rather than in prose expositions of\nphilosophy. The soul’s longing for release from this world and\nliberation, or obliteration, in the divine, are themes which found\npowerful expression in their liturgies, and which bond them to at\nleast one important facet of neoplatonism and to each other more truly\nthan any specific doctrines that they may hold concerning the origin\nof matter or the nature of prophetic inspiration.\n\n\nHistorians of Jewish philosophy label Ibn Ezra’s thought\n“neoplatonic” also on the strength of his deep involvement\nin astrology and arithmology, as well as his deep longing for release\nfrom this world. However, the very term “neoplatonic” is\napplied imprecisely in the history of medieval Jewish philosophy, and\nit usually indicates little more than a gross bifurcation between\n“Aristotelians” and all of the rest who, as a rule, are\nlabeled neoplatonic. It is therefore appropriate to take note of Ibn\nEzra’s divergence from some widely accepted neoplatonic\nteachings. Ibn Ezra denies the existence of demons. He says nothing of\nthe soul’s descent through the celestial orbs, though this\nteaching was known to his contemporary pseudo-Bahya, and would perhaps\nnaturally have appealed to an astrologer. Finally, he says nothing of\nmusical harmonies—despite the clear Pythagoreanism of\nhis Sefer ha-Ehad (Langermann 1993, 66).   In sum, then,\nit seems most prudent to observe that Ibn Ezra makes use of mostly\nstock notions, such as the three “worlds”, that inform\nwhat has come to be known as Islamic and Jewish neoplatonism. Wolfson\nhas made the strongest case for “precise terminological\nlinks” between Ibn Ezra and Plotinus, but even he cannot trace a\npath of transmission (Wolfson, 1990, pp. 89–90).\n\n\nThe least well-known characterization, but one which has a lot to\nargue in its favor, is given by Abraham, son of the illustrious Moses\nMaimonides. In his refreshing perspective Ibn Ezra finds his place\nwithin a list of rabbis who taught the fundamental doctrines that God\nis not a body; that God does not manifest any of the properties of\nbodies; and that all problematic biblical verses must be\n(re)interpreted in order to conform to these doctrines. It is\ninteresting to note the other names on Abraham Maimonides’ list:\nSa‘adiah Gaon, Samuel ben Hofni, Isaac Alfasi, Joseph Ibn\n Migash.[2]\n Only the first of these is regarded today as a philosopher, and then\nonly in the wider sense of the word. It seems that Abraham, like his\nfather, looked upon the whole lot—Ibn Ezra included—as\nmutakallimūn, that is, kalamist religious thinkers who taught an\nacceptable (though not necessarily correct) theology, which, however,\nlacked philosophical rigor, and which contained some grave errors.\n\n\nIndeed, Sa‘adiah’s Beliefs and Opinions is the only\nextant, substantive work on Jewish philosophy that Ibn Ezra mentions\nby name. The citation occurs at the very end of the first chapter of\nYesod Mora; Ibn Ezra observes that some portions of\nSa‘adiah’s book are correct, but others are baseless. However,\nhe never tells us exactly which portions are acceptable and which not,\nnor does he engage Sa‘adiah in a pointed debate on any issue.\nThroughout his opus, but most notably in his biblical commentaries,\nIbn Ezra mentions Sa‘adiah dozens of times; though he rarely\nmentions the specific source, he seems to be referring most often to\nSa‘adiah’s own biblical commentaries. On the basis of this\nstatistic, at least, Sa‘adiah is, as noted above, the most\nimportant “influence” upon Ibn Ezra.\n6. What is Philosophy for Ibn Ezra? Who are his philosophers?\n\n\nThe abundance of Hebrew terms in Ibn Ezra’s writings that may refer to\n“philosophers” or “philosophy”—none of\nthem very precise, some of them perhaps coined by Ibn Ezra\nitself—afford an additional perspective upon the peculiar nature\nof Ibn Ezra’s “philosophy”. The Hebrew homonyms for\n“philosophy” or “philosophers” (which entered\nthe language by way of the Arabic) never appear in the biblical\ncommentaries. In the single instance cited in Klatzkin’s Lexicon, Ibn\nEzra is reported to have used the word in the restricted sense of\nastronomers, in a manner similar to that of his predecessor Abraham\nbar Hiyya (whose astronomical writings he studied closely). This is\nnot necessarily the case; in the single instance cited by Klatzkin,\nfilosofim is appears in apposition to hakhamim, an\nall-purpose word meaning scholar or master of any of the seven or ten\n sciences.[3]\n Nonetheless, it does seem clear that Ibn Ezra has no concept of\nfalsafa in the sense that it was used in Arabic philosophy,\nthat is, in the restricted sense of Platonic and Aristotelian\ntraditions.\n\n\nThe term shiqqul ha-da‘at (rational analysis,\nliterally, “weighing [in the balance of] reason”) is used\nin the broad sense of reason or rationality. In the introduction to\nhis commentary to the Torah, Ibn Ezra writes: “rational analysis\n(shiqqul ha-da‘at) is the foundation, because the Torah\nwas not given to those devoid of reason; and the go-between\n(mal’akh, ‘angel’ or\n‘messenger’) between man and his God is his\nintellect.” Soon after (gloss to Genesis 1:2) the same term is\nused in what could again be taken as a strictly astronomical or\nscientific context: “People who employ rational analysis have\nsure proofs that there is only one earth.” Ibn Ezra was far\nbetter grounded in the exact sciences than he was in philosophy, and\nthis fact is reflected in his usage of filosofim\nand shiqqul ha-da‘at.\n\n\nIn some cases, it is possible to narrow the sense of terms used by Ibn\nEzra. An example is “the scholars who [base their claims upon]\nproofs” (hakhmei ha-ra’ayot), which is found in\nan excursus upon psychology, which we shall scrutinize below. Joseph\nIbn Aqnin employs a very similar expression: “logicians, who\nadduce proofs (ra’ayot) to strengthen the Islamic\nreligion, and the Ishmaelites call them\n mutakallimūn \n [kalamists].”[4]\n Given Ibn Ezra’s attachments to kalam, some of which have already\nbeen noted, it seems clear that the term in question here, and perhaps\nothers as well, refers to the doctors of the kalam.  References here\nand elsewhere to logic and proofs thus stand, in fact, for\ndisputations that are carried out on a rational basis, but not\nnecessary by the rules of Aristotelian logic.\n\n\nAnother term employed by Ibn Ezra is hakhemei (or:\nanshei) ha-mehqar, literally “scholars” (or:\npeople of inquiry).  Bar Hiyya uses the term hakhemei\nha-mehqar in the sense of philosophers: “the form\nconcerning which the hakhemei ha-mehqar said that it is\nneither body nor attached to a\n body.”[5]\n\nTushiyya is yet another term. In one place Ibn Ezra contrasts\nthe views of the people of mehqar with those of the people of\ntushiyya, in a way that suggests that the former are\nmutakallimūn and the latter fâlasifa.\nIn his gloss to Psalms 104:30 he notes: “The people of\nmehqar say that every living being will rise after his death;\nthe people of tushiyya say that the universals are preserved,\nbut individuals perish.” The choice of this term clearly derives\nfrom Sa’adiah’s translation of tushiyya (Job 26:3) as\nfalsafa. However, this usage is neither statistically significant nor\ntotally consistent.\n\n\nIbn Ezra notes (gloss to Eccelsiastes 7:9; see below) that one must\nread “many books” in order to master psychology, but he\ndoes not name a single one of them; this observation as well holds\nthroughout his opus, where, to the best of my knowledge, not a single\ntextbook on psychology, metaphysics, or logic is ever mentioned by\nname. However, formal study of scientific texts was only one means of\naccess to the philosophy of the day. By the late eleventh century\nAndalusian Jewry had drunk deeply from the fountain of Greco-Arabic\nscience, and Ibn Ezra could certainly have achieved some familiarity\nwith psychology and other fields without having undergone any formal\ncourse of study. As we shall see, Ibn Ezra certainly read Ibn\nSînâ’s philosophical allegory, Hayy bin\nYaqzân.  In general, it would seem that he was attracted to\nshort, tantalizing and cryptic expositions, rather than lengthy,\ndiscursive prose.\n7. Ibn Ezra and Judah Halevi\n\n\nThe most interesting and truly philosophical chapters in his writings\nhave nothing to do with recycling and restyling doctrines of the soul,\nbut rather with frank discussions concerning fundamental questions of\nJewish identity. In a lengthy gloss to the first of the ten\ncommandments (Exodus 20:1), Ibn Ezra records a conversation he held\nwith his close friend and fellow poet Judah Halevi. Why, Halevi wants\nto know, did God choose to reveal himself on Mount Sinai as the God\nWho took the Jews out of Egypt? Why didn’t He instead reveal\nHimself as the God Who created heaven and earth, and created man as\nwell? Why did He identify Himself with an event important to Israel\nalone, rather than with an event of universal significance? The\nimplied criticism of the standard philosophical viewpoint, to which\nIbn Ezra adheres consistently throughout his oeuvre, is\ntransparent. If Creation is the most manifest and convincing\nindication for the existence of the deity, as the philosophers aver;\nif God reveals Himself to us through His works—why, then, does\nHe choose to reveal Himself at Sinai as the God of history, the God of\nthe Exodus?\n\n\nIbn Ezra begins his reply with the observation that people differ in\nthe nature of their belief. Some believe in God because they have\nheard about Him or read about Him in the Bible; but should that belief\nbe challenged in any way, they are immediately stymied. By contrast,\nthose who have chosen the path of knowledge will work their way up\nfrom the study of mineral and animal kingdoms to the structure and\nfunctions of the human body, and thence to a study of the\nheavens. Thus will the scholar ascend from God’s “ways” to\nan understanding of the divine name. According to Ibn Ezra, the first\ntwo words of the commandment (“I [am] YHWH”) hint at the\nknowledge of God that one obtains from creation; it would thus be\nsuperfluous to add “Who made heaven and earth”. \n\n\nThus far Ibn Ezra has reiterated, and endorsed, the view of the\nphilosophers. Now, however, he parts ways with them; astrology plays a\nkey role in this turn of thought. The intellectuals who follow this\npath, observes Ibn Ezra, deny divine intervention in worldly matters.\nIsrael’s astral destiny was such that she should not have been freed\nfrom bondage at that particular time. God however can overrule the\nstars, and His doing so precisely at that astrally inauspicious moment\nis compelling proof, not only for His existence, but for the operation\nof the cosmos that He created.\n\n\nGod’s self-introduction as the One Who took you out of Egypt connects\nto the truth of God’s existence, as evidenced by the cosmos.  It adds,\nhowever, the important detail that the Creator is also the\nRedeemer. In sum, God’s self-revelation as “the one Who took you\nout of Egypt” does not contradict the tenet that God reveals\nHimself through His works; it rather adds to it an important point,\neither overlooked or denied by the philosophers. Immediately\nafterwards, however, and quite characteristically, Ibn Ezra continues\nhis exposition in a somewhat different vein. He observes that the next\nword, “your God”, conveys our obligation to worship;\nfinally, the remainder of the sentence, “Who took you out of\nEgypt”, simply hints at the miracles that are all the simple\nfolk have to lean upon in their belief.\n\n\nWe have extracted here the main points from one of the longest\nexcursuses in Ibn Ezra’s biblical commentary. It does not require any\ngreat stretch of the imagination to suppose that the dry and concise\nresumé that Ibn Ezra chose to include in his gloss summarizes\nwhat must have been a lengthy debate, perhaps even a series of\nencounters, between the two poets. In fact, in his commentary to\nDaniel 9:2, Ibn Ezra describes more fully an exchange with Halevi over\nan issue of biblical chronology, recording several barbs and retorts\nuntil, in the end, Halevi fell silent. Perhaps, then, Ibn Ezra chose\nto abridge the conversation over the first commandment because that\nencounter did not exactly leave Halevi speechless. Quite the contrary:\nHalevi expanded upon his theme of Jewish particularism in his\nKuzari, one of the most resonant works of Jewish\nthought  ever.\n\n\nArmchair philosophy this may be, but it concerns one of the most\nfundamental questions of the Jewish experience. Is Judaism just one\nset of directives among many for achieving one and the same spiritual\nobjective, which is the goal of all humans? Are Jews one people among\nmany, or do they occupy a special place in the scale of existents?\nBetter analytic minds may have been tested in replying to these\nquestions, but perhaps not two more vibrant, passionate souls than\nthese two Hebrew poets. The “philosopher” of Halevi’s\nKuzari presents a point of view that coincides on major\npoints with that of Ibn Ezra, most notably in the universalism of his\nprogram for humanity, and the relativism of his approach to ritual and\npraxis (Langermann 1993, 70–74). For his part, Halevi demands a much\nmore real and meaningful cleavage between Jews and the rest of the\nnations.\n8. Poetry and the Science of the Soul\n\n\nFor Ibn Ezra, the human soul is the only unchanging, eternal entity in\nthe universe; it is the only thing that can be said to be similar, in\nsome sense, to God. For example, the opening sentence in Sefer\nTzahut (a grammatical treatise!) states: “Because the human\nsoul was created in the image of God, her actions are similar to\nhis” (Levin 1985, 379). At the end of Yesod Mora (Cohen\n2002, 200–201) he cites the five points of resemblance between the\nsoul and God noted in the Talmud; and he implies that Shi‘ur\nQoma professes a similar doctrine. Ibn Ezra takes these\nsimilarities rather literally, as it seems.\n\n\nGiven this state of affairs, it is no surprise that “the science\nof the soul” is the branch of philosophy concerning which Ibn\nEzra has the most to say. Ibn Ezra evinces little interest in the\nmetaphysics of the theologians—that is, questions of divine\nattributes, substance and accident, and so forth. Psychology was his\nmetaphysics; it and it alone delved into questions beyond the material\nworld and approaching the godhead. In a revealing remark he calls Ibn\nGabirol “a great sage in the secret (sod) of the\nsoul.” It comes as no surprise, then, that penetrating studies\nof Ibn Ezra’s thought, such as Wolfson 1990, Tanenbaum 1990, Hughes\n2009, and Labaton 2013, dwell at length on the Ibn Ezra’s conceptions\nof soul.\n\n\nIbn Ezra’s attitude towards psychology emerges mainly from his\npoetry; it is not simply copied from some sterile classification\nscheme. His poetry, more than anything, has nourished his image as a\nneoplatonist in the scholarly literature. In fact, psychology was one\narena of sharp conflict between philosophers\nand mutakallimūn. If, as we have suggested, Ibn Ezra\nwas mainly influenced by Sa‘adiah and\nother gaonim—and thus also by the kalamists—many\nof his ideas about the soul derive from the traditions of Hebrew\npoetry in Spain. Unlike the kalam, which has little interest in\npsychology, and is not obsessed with release from this world, the\nHebrew poets as a rule identify with the classical neoplatonists in\nseeking salvation and release of the soul from its mundane\ncaptivity.\n\n\nEven Ibn Ezra’s prose pronouncements concerning the soul’s\nlonging to return to her source tend towards the lyrical (and in fact\nhas some small but clear borrowings from a long liturgy by\nHalevi). Consider this passage from the introduction to the commentary\nto Ecclesiastes: \n\n Just as the passerby, who has been taken prisoner, longs to return to\nhis homeland and to be with his family, so does the intellectizing\nspirit yearn to grab hold of the higher rungs, until she ascends to\nthe formations of the living God, which do not dwell in material\nhouses…This will transpire if the spirit whitens, sanctifying\nherself above the impurities of disgusting bodily lusts which sully\nwhat is holy…then what is distant will be like what is near,\nand night like day; then she will be configured to know the real\ntruth, which will be inscribed upon her in such a way so as not be\nerased when she departs the body, for the script is the writing of\nGod. She was brought here in order to be shown, and for that reason\nshe was imprisoned until the end of her term….(Levin 1985, 288)\n \n\n\nThis prose exposition is replete with imagery but devoid, like similar\naccounts in Ibn Ezra’s writings, of any thorough discussion of the\nsoul’s structure, origins, and path to liberation, of the kind that\none does find in the Islamic neoplatonic tradition, including Jewish\nworks such as pseudo-Bahya. It is really a reworking in rhymed\nprose—the medium of Ibn Gabirol’s liturgical masterpiece,\nKeter Malkhut—of the same themes that inspire Ibn\nEzra’s poems. Nonetheless, Ibn Ezra undoubtedly impresses his readers\nwith the great pathos and obvious sincerity of his liturgies. His\nhymn, “Tzom’ah nafshi” (“My soul\nthirsts”) is one of the most powerful expressions of longing for\nthe divine in Hebrew letters. Ibn Ezra experienced deeply and fully\nthe soul’s alienation in this world and her longing for divine\nredemption, and his poetic expressions of these awesome feelings\nserved better as credentials for his expertise in matters of his soul\nthan could any academic diploma.\n9. Excursus on the Soul in a Comment to Ecclesiastes\n\n\nThe best way to grasp all that has been said so far about Ibn Ezra’s\ninterests, influences, and style, is to have look at a sample passage\nwhere the peculiarities of his writing and the difficulties of piecing\ntogether his “philosophy” can be examined in\nsitu, so to speak. The lengthy excursus on the structure of the\nhuman soul in his commentary to Ecclesiastes 7:9 offers such an\nopportunity. Ibn Ezra briefly notes the tripartite division of the\nsoul into vegetable, animal, and rational. This, he tells us, is the\nscheme adopted by “the scholars who [base their claims upon]\nproofs” (hakhmei ha-ra’ayot).  One can achieve a\nfull understanding only after reading “many books”. There\nis no specific lexical or grammatical problem that requires the\nexegete to go to any length here. However, an inquiry into the soul is\nmandated because this verse is one of the places in Ecclesiastes where\nKing Solomon has, on the face of it, contradicted himself, and\ntherefore the verse requires explication. After citing at length some\nof the apparent contradictions, Ibn Ezra proposes an alternative\npsychology to that of the “scholars”, employing a\ndifferent tripartite scheme and different terminology: nefesh\n(appetite and lust), ru’ah (sensation and domineering),\nand neshamah (wisdom). He intimates that this switch is only\nfor the sake of convenience, though the truth appears to be otherwise. Ibn\nEzra notes in passing that Sa‘adiah too employed this second\nclassification.\n10. Rationale for the Commandments: Yesod Mora\n\n\nThe most systematic formulation of Ibn Ezra’s philosophical ideas is\nfound in Yesod Mora (The Foundation of Reverence)\n(Cohen 2002). Significantly, this is a monograph on the rationale of\nthe commandments, perhaps the key field (along with biblical\ninterpretation, with which it overlaps somewhat) for the development\nof a specifically Judaic philosophy. Like his other writings, it is\nvery short, contains not a few cryptic passages whose meaning has\nnever been satisfactorily fleshed out, and does not always sit well\nwith his pronouncements in other writings. There is good reason to\nbelieve that Yesod Mora was written shortly before Ibn Ezra’s\ndeath, and it thus may comprise his final statement on the issues.\n\n\nThe beginning of Yesod Mora contains a valuable survey of the\nsciences. This is not a formal classification of the type written by\nal-Fârâbî and many others, whose aim is to put in\ntheir proper place all of the sciences. Instead, Ibn Ezra critically\nreviews the various branches of learning which are favored by groups\nof Jewish scholars. There are those whose “entire wisdom”\nconsists in masora, the traditional inventory of letters and phonetic\nmarkings in Scripture. Some are interested only in Hebrew grammar;\nothers study only the Bible, yet others are interested only in the\nTalmud. None of these groups can achieve the wisdom they seek,\nhowever, without studying astronomy (hokhmat ha-mazalot).\nAstronomy in turn requires a foundation in geometry (hokhmat\nha-middot).  Also mandatory are psychology (hokhmat\nha-nefesh), which in turn has a perquisite physics, or perhaps\nmore accurately, physiology (toledet ha-shamayim, literally\n“that which is produced [or induced] by the heavens”;\ntoledet refers generally to transformations of matter, but,\nin Ibn Ezra’s usage, it is almost always applied to biological\nprocesses). Finally, logic (hokhmatha-mivta), “the\nbalance of all wisdom” is also indispensable.\n\n\nTowards the end of this disquisition, theosophy of some sort (sod\nha-merkaba, shi‘ur qoma) is mentioned; Ibn Ezra\nseems to approve of it, if approached properly. At the very end of the\npassage, Ibn Ezra tries to tie everything together into a coherent\nstudy plan: “How can someone attempt to know something more\nsublime than he, if he knows neither his soul nor his body? Only he\nwho knows physics (or physiology?) and all of its proofs and logic can\nknow the universals that are preserved like a seal. Astronomy can be\nknown by means of clear proofs drawn from arithmetic (hokhmat\nha-heshbon), geometry (hokhmat ha-middot), and\nproportions (hokhmat ha-‘arakhim).  Only then will he\nbe able to ascend high above, and to know the secret of the soul, the\nsupernal angels, and the world to come.” The plan calls for\nstudy of the body and soul, and astronomy as well, with the aim of\nsecuring universals. One can then move beyond the stars to “the\nsecret of the soul” and the world or worlds beyond our own. The\norder in which the sciences are to be studied is clear enough, the\nconnection between them far less so.\n\n\nIbn Ezra never makes a clean break between traditional or religious\nsciences; quite the contrary, he urges all along that the sciences\nthat we would call secular are mandatory for understanding scriptural,\nlegal, and other issues of concern to Jews, not the least of which, of\ncourse, is self-fulfillment. In the course of a long list of examples\nthat illustrating this need, astrology (mishpatei ha-mazalot)\nis mentioned only once. Clearly, in this key text at least, Ibn Ezra\ndoes not accord to astrology the major standing it holds in his\nlegacy.  Moreover, none of the disciplines named seems to stand for\n“philosophy”, though psychology, some sort of natural\nphilosophy, and theosophy are all mentioned separately. (See: What is\n“Philosophy” for Ibn Ezra?) In any case, the separate\nlisting of psychology lends credence to our claim that Ibn Ezra’s\nclear interest in the science of the soul is independent of, and by no\nmeans indicative of, any strong interest in philosophy in general.\n\n\nThe second chapter begins with an encomium to logic: “How noble\nis the science of logic, and it commences with knowledge of the five\nwords (millot).” Ibn Ezra seems to be referring to the\nquinque voces; he names here “high universal”,\n“lower universal” or “high species”, and\n“low species”. Understanding species and other such groups\nare of great use in classifying commandments, as well as in resolving\nsome apparent contradictions between biblical texts. However, the\nlogic applied is extremely basic, and once again, we have no evidence\nthat Ibn Ezra knew more than the basic terminology.\n\n\nThe discussion then moves on to commandments that are contingent,\ninsofar as they depend upon, or are limited to, a certain group (e.g.\npriests), an institution (e.g. temple sacrifices), gender specific\n(e.g. circumcision). This sifting allows Ibn Ezra, in chapter five, to\nget at those commandments that are absolute, “principles that do\nnot depend upon a given time, a given place, or anything else.”\nThese commandments, “planted in the heart”, were known by\nmeans of reason even before the giving of the Torah. Ibn Ezra himself\nthus inserts, at the heart of this very Jewish, and legalistic,\ntreatise, the rational, humanistic outlook that marks his philosophy:\nthe core demands of Judaism depend not upon revelation but upon innate\nhuman reason, and they are no different from the rules that must\ngovern every human. \n11. Philosophical Allegory: Hayy ben Meqitz\n\n\nIbn Ezra has left us one writing that undoubtedly fits into a very\nspecial medieval philosophical tradition: a visionary recital, or\ninitiatory tale, in rhymed Hebrew prose, Hayy ben Meqitz\n(Levin 1985, 119–132). The great tenth century philosopher Ibn Sina\nwrote a philosophical allegory Hayy bin Yaqzân, and the\nAndalusian Ibn Tufayl, as well as the Persian expatriate Suhrawardi\npenned distinct versions, each tale suited to the message that its\nauthor wished to convey. Ibn Ezra’s Hebrew composition fits into this\nspecial theme of philosophical allegory.\n\n\n In Ibn Ezra’s version, Hayy is the guide—an old man on whom\ntime has not taken its toll. The narrator, who has fled his home,\nmeets Hayy, who enchants him with words of wisdom, then invites him to\nimmerse himself in the fountain of life and imbibe its waters. Hayy\nthen guides the narrator through eight “kingdoms,” that\nis, the stellar spheres, describing their astrological associations in\nvivid imagery, then to the angelic realm. The narrator asks if is\nthere anything beyond, something that he cannot see? Hayy replies\npositively; there is “the One, who has no second”, sublime\nand invisible. However, he continues, if the narrator will follow in\nHayy’s path, he will yet be able to know and see Him.\n\n\nThis philosophical tale further complicates the question of Ibn\nEzra’s doctrinal allegiances. Issues such as the structure of\nthe soul or the contours of union with the divine, which are not\ntreated systematically or uniformly elsewhere, cannot be fully\nharmonized with Ibn Ezra’s pronouncements\nelsewhere. Hayy is the only one of Ibn Ezra’s\nphilosophical ventures that has no intrinsic connection to Judaism.\nSnippets of biblical verses are skillfully woven into Hayy,\nmaking the poem amenable to the Jewish reader and making it easier for\nthe reader to answer the invitation—if one is indeed\nextended—to join the excursion under Hayy’s guidance. On\nthe other hand, the ritual immersion in the nude that the narrator\nperforms, while not totally foreign to Judaism, must have seemed to\ncarry Christian overtones to some readers. It should be borne in mind\nthat Ibn Ezra wrote Hayy at the request of Samuel Ibn Jami, a learned\nand philosophically inclined North African Jew, himself a poet. Is\nHayy the response to a literary challenge?\n\n \nGreive (1973, 103–114) characterizes Hayy as “a\nreligious-philosophical work, expressed in a mystical fashion.”\nIt is part of a tradition of Himmelsreisen that stretches\nback to antiquity and is open to a number of interpretations. Three\ncentral moments can be discerned: (1) The soul’s imprisonment in\nthe terrestrial world, which is foreign to her; (2) the role of\nself-knowledge (i.e. coming to know one’s true, other-worldly\nself) in the process of liberation; (3) wisdom as the means to this\nliberation.  Greive explores in particular, the literary connections\nwith Avicenna’s recital, also called ‘Hayy’, as well\nas Ibn Gabirol’s liturgical masterpiece, Keter\nMalkhut.\n\n \nMore recently, Aaron Hughes (2004, 186) has strongly emphasized the\nneoplatonic aesthetics at play in Hayy, asserting that\naesthetics and poetry are “currency whereby the imagination and\nphilosophy are able to tease out and subsequently map the various\nrelationships between the physical and the metaphysical”.\n",
    "bibliography": {
        "categories": [
            "<a name=\"PriSou\">Primary Sources</a>",
            "<a name=\"SecSou\">Secondary Sources</a>"
        ],
        "cat_ref_text": {
            "<a name=\"PriSou\">Primary Sources</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Cohen, J., with Simon, U. (eds.), 2002, <em>R. Abraham Ibn Ezra.\nYesod Mora ve-Sod Torah</em>, Ramat-Gan: Bar- Ilan University\nPress.",
                "Levin, I., 1985, <em>Abraham Ibn Ezra Reader: Annotated texts with\nIntroductions and Commentaries</em>, New York and Tel Aviv: Israel\nMatz.",
                "Sela, S., 2007, <em>Abraham Ibn Ezra: The Book of Reasons. A\nParallel Hebrew-English Crirical Edition of the Two Versions of the\nText</em>, Leiden: Brill",
                "–––, 2010, <em>The Book of the world. A parallel\nhebrew-english critical edition of the two versions of the text.</em>,\nLeiden: Brill",
                "–––, 2011, <em>Abraham Ibn Ezra on Elections,\nInterrogations, and Medical Astrology: A Parallel Hebrew-English\nCritical Edition of the Book of Elections (3 Versions), the Book of\nInterrogations (3 Versions), and the Book of the Luminaries.</em>,\nLeiden: Brill",
                "–––, 2013, <em>Abraham Ibn Ezra on Nativities\nand Continuous Horoscopy: A Parallel Hebrew-English Critical Edition\nof the Book of Nativities and the Book of Revolution.</em>, Leiden:\nBrill",
                "Weinberger, L., 2010, <em>Twilight of a Golden Age: Selected Poems\nof Abraham Ibn Ezra</em>, Tuscaloosa: University of Alabama\nPress.\n</ul>\n<h3>"
            ],
            "<a name=\"SecSou\">Secondary Sources</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Burnett, C., 1997, <em>The Introduction of Arabic Learning into\nEngland</em>, London: The British Library.",
                "Cohen, J., 1996, <em>The Philosophy of R. Abraham Ibn Ezra</em>,\nRishon le-Zion: Shai [Hebrew].",
                "Fenton, P., 2001, “Abraham Ibn Ezra, a-t-il composé un\ncommentaire sur le Livre de la Création?” <em>Revue des\nétudes juives</em>, 111: 33–59.",
                "Freudenthal, G., 2013, “Abraham Ibn Ezra and Judah Ibn\nTibbon as Cultural Intermediaries,” in <i>Exchange and\nTransmission across Cultural Boundaries: Philosophy, Mysticism, and\nScience in the Mediterranean World</i>, H. Ben-Shammai, S. Shaked, and\nS. Stroumsa (eds.), Jerusalem: Israel Academy.",
                "Goldstein, B.R., 1996, “Astronomy and Astrology in the Works\nof Abraham ibn Ezra,” <em>Arabic Sciences and philosophy</em>,\n6: 9–21.",
                "Greive, H., 1973, <em>Studien zum jüdischen\nNeuplatnismus.</em> <em>Die Religionsphilosophie des Abraham Ibn\nEzra</em>. Berlin-New York: De Gruyter.",
                "Guttmann, J., 1973, <em>Philosophies of Judaism</em>, New York:\nSchoken.",
                "Harris, J.M., 1993, “Ibn Ezra in Modern Jewish\nPerspective,” in <em>Rabbi Abraham ibn Ezra: Studies in the\nWritings of a Twelfth-Century Jewish Polymath</em>, I. Twersky and J.M.\nHarris (eds.), Cambridge, MA: Harvard University Press.",
                "Hughes, A., 1999, “Two approaches to the love of God in\nmedieval Jewish thought: The concept of <em>devequt</em> in the works\nof Ibn Ezra and Judah Halevi,” <em>Studies in Religion/Sciences\nReligieuses</em>, 28: 139–151.",
                "–––, 2002, “The Three Worlds of ibn\nEzra’s <em>Hay ben Meqitz</em>,” <em>The Journal of Jewish\nThought and Philosophy</em>, 11: 1–24.",
                "–––, 2004, <em>The Texture of the Divine</em>, Indianapolis:\nIndiana University Press.",
                "–––, 2009, “The Soul In Jewish\nNeoplatonism: A Case Study Of Abraham Ibn Ezra And Judah\nHalevi,” in <i>The Afterlife of the Platonic Soul</i>,\nM. Elkaisy-Friemuth &amp; John M. Dillon (eds.), Leiden: Brill.",
                "Husik, I., 1969, <em>A History of Mediaeval Jewish Philosophy</em>, New\nYork: Atheneum.",
                "Kreisel, H.T., 1994, “On the term ‘<em>kol</em>’\nin Abraham Ibn Ezra: a reappraisal,” <em>Revue des études\njuives</em>, 153: 29–66.",
                "Labaton, S., 2015, <i>Abraham ibn Ezra’s Interpretation of the\nTabernacle: A Case Study in the Relationship between Peshaṭ and\nSod</i>, Ph.D. Dissertation, New York University.",
                "Lancaster, I., 2002, <em>Deconstructing the Bible: Abraham Ibn\nEzra’s Introduction to the Torah</em>, London: Routledge.",
                "Langermann, Y.T., 1993, “Some Astrological Themes in the\nThought of Abraham ibn Ezra,” in <em>Rabbi Abraham ibn Ezra:\nStudies in the Writings of a Twelfth-Century Jewish Polymath</em>, I.\nTwersky and J.M. Harris (eds.), Cambridge, U.S.A: Harvard University\nPress.",
                "–––, 1997, “Science and the Kuzari,”\n<em>Science in Context</em>, 10: 495–522",
                "Lawee E, 2017, “A Genre Is Born: The Genesis, Dynamics, and\nRole of Hebrew Exegetical Supercommentaries,” <i>Revue des\nétudes juives</i>, 176: 295–332.",
                "Levin, I., 1992, “‘Cling to the Ladder of\nWisdom’ (The Influence of Neoplatonic Psychology on the Poetry\nof Abraham Ibn Ezra),” in <em>Te‘udah</em> (<em>Studies in\nthe Work of Abraham Ibn Ezra</em>: Volume 8), I. Levin (ed.), Tel\nAviv: Tel Aviv University Press, 1992 [Hebrew].",
                "Sela, S., 2001, “Abraham ibn Ezra’s Scientific\nCorpus—Basic Constituents and General Characterization,”\n<em>Arabic Sciences and philosophy</em> 11:91–149.",
                "–––, 2004, “Queries on Astrology sent from\nSouthern France  to Maimonides: Critical edition of the Hebrew\nText, Translation, and Commentary,” <em>Aleph</em>\n4:89–190.",
                "Sela, S., and Freudenthal, G., 2006, “Abraham Ibn Ezra’s\nScholarly Writings: A Chronological Listing,” <em>Aleph</em>, 6:\n13–55.",
                "Simon, U., 1993, “Interpreting the Interpreter:\nSupercommentaries on Ibn Ezra’s Commentaries,” in <em>Rabbi\nAbraham ibn Ezra: Studies in the Writings of a Twelfth-Century Jewish\nPolymath</em>, I. Twersky and J.M. Harris (eds.), Cambridge, U.S.A:\nHarvard University Press.",
                "Sirat, C., 1985, <em>A History of Jewish Philosophy in the Middle\nAges</em>, Cambridge: Cambridge University Press.",
                "Tanenbaum, A., 1990, “Beholding the Splendor of the Creator:\nConceptions of the Soul in the Poetry of Abraham Ibn Ezra,” in\n<em>Abraham Ibn Ezra y su tiempo</em>, F.D. Esteban (ed.), Madrid:\nAsociación Espanola de Orientalistas.",
                "Twersky, I., 1993, “Did R. Abraham Ibn Ezra Influence\nMaimonides?” in <em>Rabbi Abraham ibn Ezra: Studies in the\nWritings of a Twelfth-Century Jewish Polymath</em>, I. Twersky and J.M.\nHarris (eds.), Cambridge, MA: Harvard University Press\n[Hebrew].",
                "Wolfson, E.R., 1990, “God, the Demiurge and the Intellect:\non the usage of the word ‘<em>kol</em>’ in Abraham Ibn\nEzra,” <em>Revue des études juives</em>, 149:\n77–111.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"PriSou\">Primary Sources</a></h3>\n<ul class=\"hanging\">\n<li>Cohen, J., with Simon, U. (eds.), 2002, <em>R. Abraham Ibn Ezra.\nYesod Mora ve-Sod Torah</em>, Ramat-Gan: Bar- Ilan University\nPress.</li>\n<li>Levin, I., 1985, <em>Abraham Ibn Ezra Reader: Annotated texts with\nIntroductions and Commentaries</em>, New York and Tel Aviv: Israel\nMatz.</li>\n<li>Sela, S., 2007, <em>Abraham Ibn Ezra: The Book of Reasons. A\nParallel Hebrew-English Crirical Edition of the Two Versions of the\nText</em>, Leiden: Brill</li>\n<li>–––, 2010, <em>The Book of the world. A parallel\nhebrew-english critical edition of the two versions of the text.</em>,\nLeiden: Brill</li>\n<li>–––, 2011, <em>Abraham Ibn Ezra on Elections,\nInterrogations, and Medical Astrology: A Parallel Hebrew-English\nCritical Edition of the Book of Elections (3 Versions), the Book of\nInterrogations (3 Versions), and the Book of the Luminaries.</em>,\nLeiden: Brill</li>\n<li>–––, 2013, <em>Abraham Ibn Ezra on Nativities\nand Continuous Horoscopy: A Parallel Hebrew-English Critical Edition\nof the Book of Nativities and the Book of Revolution.</em>, Leiden:\nBrill</li>\n<li>Weinberger, L., 2010, <em>Twilight of a Golden Age: Selected Poems\nof Abraham Ibn Ezra</em>, Tuscaloosa: University of Alabama\nPress.</li>\n</ul>\n<h3><a name=\"SecSou\">Secondary Sources</a></h3>\n<ul class=\"hanging\">\n<li>Burnett, C., 1997, <em>The Introduction of Arabic Learning into\nEngland</em>, London: The British Library.</li>\n<li>Cohen, J., 1996, <em>The Philosophy of R. Abraham Ibn Ezra</em>,\nRishon le-Zion: Shai [Hebrew].</li>\n<li>Fenton, P., 2001, “Abraham Ibn Ezra, a-t-il composé un\ncommentaire sur le Livre de la Création?” <em>Revue des\nétudes juives</em>, 111: 33–59.</li>\n<li>Freudenthal, G., 2013, “Abraham Ibn Ezra and Judah Ibn\nTibbon as Cultural Intermediaries,” in <i>Exchange and\nTransmission across Cultural Boundaries: Philosophy, Mysticism, and\nScience in the Mediterranean World</i>, H. Ben-Shammai, S. Shaked, and\nS. Stroumsa (eds.), Jerusalem: Israel Academy.</li>\n<li>Goldstein, B.R., 1996, “Astronomy and Astrology in the Works\nof Abraham ibn Ezra,” <em>Arabic Sciences and philosophy</em>,\n6: 9–21.</li>\n<li>Greive, H., 1973, <em>Studien zum jüdischen\nNeuplatnismus.</em> <em>Die Religionsphilosophie des Abraham Ibn\nEzra</em>. Berlin-New York: De Gruyter.</li>\n<li>Guttmann, J., 1973, <em>Philosophies of Judaism</em>, New York:\nSchoken.</li>\n<li>Harris, J.M., 1993, “Ibn Ezra in Modern Jewish\nPerspective,” in <em>Rabbi Abraham ibn Ezra: Studies in the\nWritings of a Twelfth-Century Jewish Polymath</em>, I. Twersky and J.M.\nHarris (eds.), Cambridge, MA: Harvard University Press.</li>\n<li>Hughes, A., 1999, “Two approaches to the love of God in\nmedieval Jewish thought: The concept of <em>devequt</em> in the works\nof Ibn Ezra and Judah Halevi,” <em>Studies in Religion/Sciences\nReligieuses</em>, 28: 139–151.</li>\n<li>–––, 2002, “The Three Worlds of ibn\nEzra’s <em>Hay ben Meqitz</em>,” <em>The Journal of Jewish\nThought and Philosophy</em>, 11: 1–24.</li>\n<li>–––, 2004, <em>The Texture of the Divine</em>, Indianapolis:\nIndiana University Press.</li>\n<li>–––, 2009, “The Soul In Jewish\nNeoplatonism: A Case Study Of Abraham Ibn Ezra And Judah\nHalevi,” in <i>The Afterlife of the Platonic Soul</i>,\nM. Elkaisy-Friemuth &amp; John M. Dillon (eds.), Leiden: Brill.</li>\n<li>Husik, I., 1969, <em>A History of Mediaeval Jewish Philosophy</em>, New\nYork: Atheneum.</li>\n<li>Kreisel, H.T., 1994, “On the term ‘<em>kol</em>’\nin Abraham Ibn Ezra: a reappraisal,” <em>Revue des études\njuives</em>, 153: 29–66.</li>\n<li>Labaton, S., 2015, <i>Abraham ibn Ezra’s Interpretation of the\nTabernacle: A Case Study in the Relationship between Peshaṭ and\nSod</i>, Ph.D. Dissertation, New York University.</li>\n<li>Lancaster, I., 2002, <em>Deconstructing the Bible: Abraham Ibn\nEzra’s Introduction to the Torah</em>, London: Routledge.</li>\n<li>Langermann, Y.T., 1993, “Some Astrological Themes in the\nThought of Abraham ibn Ezra,” in <em>Rabbi Abraham ibn Ezra:\nStudies in the Writings of a Twelfth-Century Jewish Polymath</em>, I.\nTwersky and J.M. Harris (eds.), Cambridge, U.S.A: Harvard University\nPress.</li>\n<li>–––, 1997, “Science and the Kuzari,”\n<em>Science in Context</em>, 10: 495–522</li>\n<li>Lawee E, 2017, “A Genre Is Born: The Genesis, Dynamics, and\nRole of Hebrew Exegetical Supercommentaries,” <i>Revue des\nétudes juives</i>, 176: 295–332.</li>\n<li>Levin, I., 1992, “‘Cling to the Ladder of\nWisdom’ (The Influence of Neoplatonic Psychology on the Poetry\nof Abraham Ibn Ezra),” in <em>Te‘udah</em> (<em>Studies in\nthe Work of Abraham Ibn Ezra</em>: Volume 8), I. Levin (ed.), Tel\nAviv: Tel Aviv University Press, 1992 [Hebrew].</li>\n<li>Sela, S., 2001, “Abraham ibn Ezra’s Scientific\nCorpus—Basic Constituents and General Characterization,”\n<em>Arabic Sciences and philosophy</em> 11:91–149.</li>\n<li>–––, 2004, “Queries on Astrology sent from\nSouthern France  to Maimonides: Critical edition of the Hebrew\nText, Translation, and Commentary,” <em>Aleph</em>\n4:89–190.</li>\n<li>Sela, S., and Freudenthal, G., 2006, “Abraham Ibn Ezra’s\nScholarly Writings: A Chronological Listing,” <em>Aleph</em>, 6:\n13–55.</li>\n<li>Simon, U., 1993, “Interpreting the Interpreter:\nSupercommentaries on Ibn Ezra’s Commentaries,” in <em>Rabbi\nAbraham ibn Ezra: Studies in the Writings of a Twelfth-Century Jewish\nPolymath</em>, I. Twersky and J.M. Harris (eds.), Cambridge, U.S.A:\nHarvard University Press.</li>\n<li>Sirat, C., 1985, <em>A History of Jewish Philosophy in the Middle\nAges</em>, Cambridge: Cambridge University Press.</li>\n<li>Tanenbaum, A., 1990, “Beholding the Splendor of the Creator:\nConceptions of the Soul in the Poetry of Abraham Ibn Ezra,” in\n<em>Abraham Ibn Ezra y su tiempo</em>, F.D. Esteban (ed.), Madrid:\nAsociación Espanola de Orientalistas.</li>\n<li>Twersky, I., 1993, “Did R. Abraham Ibn Ezra Influence\nMaimonides?” in <em>Rabbi Abraham ibn Ezra: Studies in the\nWritings of a Twelfth-Century Jewish Polymath</em>, I. Twersky and J.M.\nHarris (eds.), Cambridge, MA: Harvard University Press\n[Hebrew].</li>\n<li>Wolfson, E.R., 1990, “God, the Demiurge and the Intellect:\non the usage of the word ‘<em>kol</em>’ in Abraham Ibn\nEzra,” <em>Revue des études juives</em>, 149:\n77–111.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "arabic-islamic-kalam",
            "Arabic and Islamic Philosophy, historical and methodological topics in: influence of Arabic and Islamic Philosophy on Judaic thought",
            "Halevi, Judah",
            "Ibn Gabirol, Solomon [Avicebron]",
            "Maimonides",
            "Neoplatonism",
            "Saadya [Saadiah]"
        ],
        "entry_link": [
            {
                "../arabic-islamic-judaic/": "Arabic and Islamic Philosophy, historical and methodological topics in: influence of Arabic and Islamic Philosophy on Judaic thought"
            },
            {
                "../halevi/": "Halevi, Judah"
            },
            {
                "../ibn-gabirol/": "Ibn Gabirol, Solomon [Avicebron]"
            },
            {
                "../maimonides/": "Maimonides"
            },
            {
                "../neoplatonism/": "Neoplatonism"
            },
            {
                "../saadya/": "Saadya [Saadiah]"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ibn-ezra\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/ibn-ezra/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=ibn-ezra&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/ibn-ezra/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ibn-ezra": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/ibn-ezra/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=ibn-ezra&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/ibn-ezra/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}