{
    "url": "impartiality",
    "title": "Impartiality",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Troy Jollimore\n<TJollimore@csuchico.edu>",
        "author_links": [
            {
                "http://www.troyjollimore.com/": "Troy Jollimore"
            },
            {
                "mailto:TJollimore%40csuchico%2eedu": "TJollimore@csuchico.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://www.troyjollimore.com/\" target=\"other\">Troy Jollimore</a>\n&lt;<a href=\"mailto:TJollimore%40csuchico%2eedu\"><em>TJollimore<abbr title=\" at \">@</abbr>csuchico<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Mar 25, 2002",
        "substantive revision Tue Aug 24, 2021"
    ],
    "preamble": "\n\nImpartiality is sometimes treated by philosophers as if it were\nequivalent to moral impartiality. Or, at the very least, the\nformer word is often used, without the qualifying adjective\n‘moral’, even when it is the particularly moral concept\nthat is intended. This is misleading, since impartiality in its\nbroadest sense is best understood as a formal notion, while moral\nimpartiality in particular is a substantive concept – and one\nconcerning which there is considerable dispute.\n\nThe idea that impartiality is a defining feature of the moral outlook\nraises obvious questions and difficulties in relation to our ordinary\nbeliefs and behaviors. Most of us live in ways that exhibit\nconsiderable partiality toward relatives, friends, and other loved\nones, and to others with whom we are affiliated or associated. The\nexistence of vast global disparities in the distribution of wealth and\naccess to resources may not seem to accord well with the\ncharacteristically modern view that all people are in some fundamental\nsense equal from a moral point of view. Although general and abstract\nmoral principles requiring impartiality tend to strike many of us as\nfairly plausible, our more particular views and practices often seem\nto place considerably less significance on it.\n\nThough we will begin by addressing the broader, formal concept, and\nend with a brief discussion of issues raised by particularly\nepistemic impartiality, this entry will be predominantly\nconcerned with moral impartiality; the sort of impartiality, that is,\nthat commonly features in normative moral and political theories.\n",
    "toc": [
        {
            "#ConcImpa": "1. The concept of impartiality"
        },
        {
            "#MoraImpa": "2. Morality and impartiality"
        },
        {
            "#ImpaPoinView": "2.1 The impartial point of view"
        },
        {
            "#IdeaObseTheo": "2.2 The ideal observer theory"
        },
        {
            "#MoraImpaEqua": "2.3 Moral impartiality and equality"
        },
        {
            "#MoraImpaIConsMoraTheo": "3. Moral impartiality I: Consequentialist moral theories"
        },
        {
            "#NatuConsImpa": "3.1 The nature of consequentialist impartiality"
        },
        {
            "#ConsImpaTooDema": "3.2 Is consequentialist impartiality too demanding?"
        },
        {
            "#ConsImpaJust": "3.3 Consequentialist impartiality and justice"
        },
        {
            "#MoraImpaIIDeonMoraTheo": "4. Moral impartiality II: Deontological moral theories"
        },
        {
            "#DeonImpaPersPoinView": "4.1 Deontological impartiality and the personal point of view"
        },
        {
            "#ImpaUniv": "4.2 Impartiality and universalizability"
        },
        {
            "#OtheDeonAppr": "4.3 Other Deontological Approaches"
        },
        {
            "#ContModeDeonImpa": "4.4 Contractualist models of deontological impartiality "
        },
        {
            "#ImpaDemaScop": "5. Impartiality: Its demands and scope"
        },
        {
            "#CognChalImpa": "5.1 The cognitive challenge of impartiality"
        },
        {
            "#ImpaImpeIndi": "5.2 Impartiality, Impersonality, and Indifference"
        },
        {
            "#ImpaObjeNeut": "5.3 Impartiality, Objectivity, and Neutrality"
        },
        {
            "#PartImpa": "6. Partiality and Impartiality"
        },
        {
            "#RelaJustPart": "6.1 Relationships and the Justification of Partiality"
        },
        {
            "#PartImpaDeba": "6.2 The Partialist-Impartialist Debate"
        },
        {
            "#EpisPartImpa": "7. Epistemic partiality and impartiality"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The concept of impartiality\n\nIt is all too easy to assume that the word impartiality must denote a\npositive, unitary concept – presumably a concept closely linked\nwith, if not identical to, morality. This, however, is simply not the\ncase. Rather, there are various sorts of behavior that may be\ndescribed as ‘impartial,’ and some of these obviously have\nlittle or nothing to do with morality. A person who chooses an\naccountant on the basis of her friends’ recommendations may be\nentirely impartial between the various candidates (members of the pool\nof local accountants) with respect to their gender, their age, or\nwhere they went to school. Yet if her choice is motivated solely by\nrational self-interested considerations then it is clear that the\nimpartiality she manifests is in no way a form of moral impartiality.\nTo take a more extreme case, consider an insane serial killer who\nchooses his victims on the basis of their resemblance to that some\ncelebrity. The killer may be impartial with respect to his\nvictims’ occupations, religious beliefs, and so forth, but it\nwould be absurd to regard this as a form of moral impartiality.\n\nIt is also worth noting that some types of impartiality may in\nthemselves be immoral or morally questionable. Suppose that I decide\nto pass along a treasured family heirloom to one of my two sons, Bill\nand Phil. Flipping a coin would constitute one type of impartial\nprocedure for choosing between the two. But suppose that I have\nalready promised the heirloom to Phil on several occasions. In this\ncase it would be quite wrong to allow a coin toss to determine whether\nhe gets it. Deciding by means of a coin toss would be an impartial\nprocedure, but many would claim that it would be the wrong sort of\nimpartiality here, for it ignores the moral obligation created by my\nprevious promises.\n\nThe word ‘impartiality’, then, picks out a broad concept\nthat need not have anything to do with morality. In this broad sense,\nimpartiality is probably best characterized in a negative rather than\npositive manner: an impartial choice is simply one in which a certain\nsort of consideration (i.e. some property of the individuals being\nchosen between) has no influence. An analysis along these lines has\nbeen proposed by Bernard Gert, who holds that “A is\nimpartial in respect R with regard to group G if and\nonly if A’s actions in respect R are not\ninfluenced at all by which member(s) of G benefit or are\nharmed by these actions” (Gert 1995, 104). Thus, for Gert,\nimpartiality is a property of a set of decisions made by a particular\nagent, directed toward a particular group.\n\nGert’s analysis captures the important fact that one cannot\nsimply ask of a given agent whether or not she is impartial. Rather,\nwe must also specify with regard to whom she is impartial, and in what\nrespect. Gert’s analysis, then, permits and indeed requires that\nwe make fairly fine-grained distinctions between various sorts of\nimpartiality. This is necessary, since one and the same agent might\nmanifest various sorts of partiality and impartiality towards various\ngroups of persons. Consider, for instance, a university professor who\nis also a mother of five children, and who is currently acting as a\nmember of a hiring committee. Such an agent might be impartial between\nher children with respect to the care they receive (while preferring\nher own children over others in this respect), and also impartial\nbetween the various job candidates; but it is clear that these two\nuses of the word ‘impartial’ denote very different\npractices. In particular, the idea of merit applies in one case but\nnot the other: to be impartial between job candidates is presumably to\nselect between them on the basis of merit, whereas to be impartial\nbetween one’s children is not to think of merit at all,\nbut rather to provide equal protection and care to all.\n\nMany attempts to characterize impartiality fail to respect the\ndistinction between the broadest, most formalistic sense of the\nnotion, and a more specifically moral impartiality. To say, for\ninstance, that an impartial choice is one that is free of bias or\nprejudice is to presuppose that we are dealing with a certain sort of\nimpartiality, that which is required or recommended by morality, or at\nleast worthy of moral approbation. ‘Bias’ and\n‘prejudice’ are loaded terms, suggesting not only that\nsome consideration is being excluded, but also that the exclusion is\nappropriate and warranted. Similarly, the idea that impartiality\nrequires that we give equal and/or adequate consideration to the\ninterests of all concerned parties goes well beyond the requirements\nof the merely formal notion. (In the coin toss case, it is quite clear\nthat Phil’s claims to the heirloom are not being given equal or\nadequate consideration.) As a characterization of moral impartiality,\nhowever, this suggestion is perhaps more promising, at least in some\ncontexts.\n2. Morality and impartiality\n2.1 The impartial point of view\n\nIt is characteristic of modern moral thought to see impartiality as a\nrequirement of, if not a fundamental component of, morality. However,\nwhile nearly every moral theory requires some forms of impartiality in\nat least some contexts, and forbids some forms of partiality in at\nleast some contexts, there is little general agreement beyond that.\nOne straightforward thought is that to act morally is simply to act\nfrom the standpoint of impartial benevolence. Many writers have simply\nassumed that to assert the importance of impartiality in the context\nof morality just is to accept the idea of acting from such a\nperspective. It is generally agreed that some sort of close connection\nobtains between morality and impartiality. Indeed, the phrases\n‘moral point of view’ and ‘impartial (or\n‘impersonal’) point of view’ are sometimes used\ninterchangeably to refer to the imagined impersonal perspective from\nwhich, it is supposed, moral judgments are to be made (Baier 1958,\nchapter 8; Harsanyi 1982; Scheffler 1982, 1985; Smith 1976 [1759];\nWolf 1992; see also Blum 1980, Chapter 3). As noted above, however,\nthe word ‘impartial’ is a general term with many\nparticular species; it follows that the phrase ‘impartial point\nof view’ is itself ambiguous. At most, it might be that the\nmoral point of view constitutes one sort of impartial point of\nview.\n\nIt is not clear, however, that the demands of impartial benevolence\nare sufficient to exhaust those of morality. Treating a person\nappropriately and respectfully may well require certain sorts of\nemotional and/or cognitive responses: sensitivity to her needs and\nvalues, empathy for her suffering, and the like. But if these\nresponses are pictured as the results of positive traits or\nattributes (and not simply as, say, the result of a lack of bias or\nprejudice), then it is not clear that merely being impartial between\npersons is sufficient to guarantee that one will possess and display\nthe necessary sensitivities. Indeed, characterizations of impartial\nagents which proceed in negative terms (that is, by defining various\npreferences, emotions or bits of information that she does not possess\nor that do not move her) often risk picturing the impartial agent as\nimpersonal and even indifferent (Henberg 1978; Brandt 1954).\n\nA second problem for the claim that the moral point of view is\nidentical with (some version of) the impartial point of view –\nor indeed, for any view which identifies morality and impartiality in\nthe direct sense – is that it seems plausible to regard some\nforms of moral partiality as morally admirable, and perhaps even\nmorally required (Blum 1980; Cottingham 1983, 1986, 1996; Jeske &\nFumerton 1997; Jollimore 2001; Kapur 1991; Kekes 1981; Keller 2013;\nMacIntyre 1984; Oldenquist 1982). Loyalty to one’s family,\ncommunity or country, for instance, is commonly regarded as a virtue.\nYet such an attitude is a clear and indeed paradigmatic example of\npartiality, requiring that an agent feel and act differently toward\none set of persons than she does toward humanity in general.\nSimilarly, certain specific moral duties arising from certain\nparticular relationships seem to involve partiality in an irreducible\nmanner. Parents, for example, are thought to be morally obliged to\ntake special care of their own children; to regard one’s child\nas merely one among millions would be regarded as highly eccentric if\nnot monstrous. Of course, some moral duties do require that an agent\nbe impartial in performing them. But on common sense moral views at\nleast, impartiality seems mostly to be required in the context of\nspecific roles – such as when a person is acting as a judge, an\numpire, a journalist, or a representative of some public institution;\nor, perhaps, when we are evaluating and selecting first-order moral\nrules. (Baron 1991; Blum 1980; Cottingham 1983). The idea that\nimpartiality is a pervasive and universal moral requirement that\nshould be directly manifested in our thoughts and practices during\ndaily life seems to contradict our ordinary moral intuitions.\n\nOne can, though, grant impartiality a significant, even central and\nfoundational, role while allowing that our actions and motives may\noften be partial in nature. As Brad Hooker has pointed out, there are\nat least three levels at which assessments of moral impartiality may\nbe made. First, one may ask whether moral rules are being impartially\napplied. Second, impartial benevolence may be used as a direct guide\nto practical decisions. And third, the content of first-order moral\nrules may be assessed from an impartial standpoint (Hooker 2010) More\nrecently he has suggested that for the purposes of moral and political\nphilosophy, it may be less useful to focus, as Gert’s analysis\ndoes, on the notion of impartial treatment, than on\n“impartiality in the application of rules” and\n“impartiality in justification of behavior.” After all, he\nwrites, “impartial treatment, according to [Gert’s]\naccount of it, not only is not always a moral requirement but also is\nsometimes morally forbidden” (Hooker 2013, 722). According to\nHooker’s account of impartial application of rules, “When\na rule is applied across a set of cases, the rule is not applied\nimpartially if and only if both (a) the agent is at least sometimes\nguided by partiality and (b) this conflicts with being guided by the\ndistinctions identified by the rule as pivotal” (2013, 721). The\nanalysis is intended to allow that some rules might (legitimately)\nrequire partiality—for instance, a rule requiring parents to\ntake care of their own children. Such a rule could nonetheless be\npartially or impartially applied, and agents might be blameworthy for\nfailing to apply them impartially even when they are not blameworthy\nfor engaging in the various forms of partiality that are required by\nthe rule.\n\nHooker himself, then, adheres to the view that an adequate moral\ntheory “puts forward an impartial foundational principle for\nassessing possible moral rules, and this impartial foundational\nprinciple selects rules that allow considerable scope for\npartiality,” seeing both contractualism and rule\nconsequentialism as examples of theories of this sort. (See (Hooker,\n2000) for his development of a particular rule consequentialist view.)\nSuch a theory would admit various forms of morally admirable and even\nmorally required partiality, while holding that the rules permitting\nsuch partiality are countenanced by, and perhaps even reducible to,\nimpartial moral principles.\n\nWhether irreducible morally admirable partiality exists is frequently\nseen as the main issue separating the so-called partialists\nfrom the impartialists. Partialists, in general, tend to\nclaim that morally admirable partiality does exist, that it cannot be\nreduced to any form of impartiality at a more fundamental level, and\nthat these facts pose a serious problem for those who claim that\nmorality and (some form of) impartiality are identical, or even\nclosely related. Impartialists, by contrast, either deny the existence\nof morally admirable partiality altogether, or hold that any apparent\ncases are in fact ultimately reducible to impartial standards (see\nsection 6). Thus impartialists hold that – contrary, perhaps, to\nappearances – impartiality is, indeed, a pervasive and universal\nrequirement of morality.\n2.2 The ideal observer theory\n\nRather than being put in terms of an impartial point of view, the\nrelation between morality and impartiality is sometimes made out in\nterms of an impartial agent or observer – a person who makes\nmoral judgments without being influenced by the sort of contaminating\nbiases or prejudices that tend to arise from the occupation of some\nparticular point of view. (Smith 1976 [1759]; Hume 1978 [1740]; Firth\n1952; Brandt 1954; Hare 1989.) The observer may also be defined as\n‘ideal’ in various other ways. It is generally stipulated\nthat she is in possession of all the nonmoral facts that are relevant\nto the judgments she has to make (Firth 1952). It is also fairly\ncommon to assume that she is an ideal reasoner, and thus immune to\nlogical fallacy or mistaken inference, etc. (Indeed, Hare goes so far\nas to state that his ‘archangel’ possesses\n“superhuman powers of thought, superhuman knowledge and no human\nweaknesses” (Hare 1989, 44).) The ‘ideal observer\ntheory’ of morality, in its most straightforward form, states\nthat moral judgments simply are the judgments an ideal observer of\nthis sort will make.\n\nAny advantage it has over the conception of morality as an impartial\npoint of view presumably arises from the fact that the ideal observer\nis not completely defined in terms of impartiality. (If she were, the\ntwo conceptions would simply coincide.) Yet many ideal observer\ntheorists seem to accept a characterization of the ideal observer\nwhich concentrates on her impartiality and impersonality. Firth, for\nexample, suggests that the ideal observer is both\n‘disinterested,’ in the strong sense of being\n‘entirely lacking in particular interests,’ and\n‘dispassionate,’ in that she is ‘incapable of\nexperiencing any emotions at all.’ (Firth, 1952) Defined in this\nway, however, the ideal observer sounds not only impersonal but deeply\nindifferent; and the idea that the moral judgments of a person who had\nneither emotional responses nor particular interests could be trusted,\nlet alone that they might be considered definitive of morality,\nstrikes some critics as highly implausible (Brandt 1979).\n\nSuppose, then, that the ideal observer theorist decides that the\ndefinition of the ideal observer must include more than the\nbare idea of impartiality – that in addition the observer must\nbe, say, compassionate (and thus not indifferent); and that she must\npossess a considerable facility for proper moral judgments –\npractical wisdom, in the Aristotelian sense. Such a theorist will now\nface a different problem: the more we build into the definition of our\nideal observer, the less useful it becomes as a heuristic device.\nStipulating that the ideal observer is very wise, for example, is not\nvery helpful if we ourselves are not wise, and so have no idea what an\nideally wise observer would choose. Indeed, ideal observer analyses\nthat go too far in this direction seem to become circular – the\n‘ideal’ observer is ideal because she always makes proper\njudgments, those being defined as just those judgments the ideal\nobserver would make (Broad 1959, 263). A circularity of this sort\nseems to be present in John Stuart Mill’s claim:\n\nImpartiality, in short, as an obligation of justice, may be said to\nmean, being exclusively influenced by the considerations which it is\nsupposed ought to influence the particular case in hand; and resisting\nthe solicitation of any motives which prompt to conduct different from\nwhat those considerations would dictate. (Mill 1861/1992, 154; see\nalso Firth 1952, 336)\n\n\nThe ideal observer, then, to be useful, must be given some independent\ndefinition, and not simply defined as ‘an agent who always gets\nit right.’ The challenge is to find such a definition. Here, as\nwith the conception of morality as defined by an impartial point of\nview, the phenomenon of morally admirable partiality proves a\nparticularly difficult issue. Should we define the ideal observer as\nbeing loyal to her country, or as being above loyalty? If the former,\ncan she serve as an adequate moral example to people who do not share\nher allegiances? If the latter, how can she serve as an adequate\nexample to anyone? Any process of idealization of the sort required to\nmake such a conception work seems likely to result in an individual so\nremoved from the concrete lives and concerns of actual human moral\nagents, that her moral judgments will turn out to be in large part\nirrelevant to the question of how such agents ought to live (see\nWalker 1991).\n2.3 Moral impartiality and equality\n\nThe plausibility of identifying the moral point of view with the\nimpartial point of view, or of defining morality in terms of an\nimpartial observer, presumably lies in the thought that such views\ncapture the idea that morally speaking, every person is equally\nimportant. Whatever such conceptions may get wrong, then, one thing\nthey seem to get right is the idea that there is a close and important\nconnection between moral impartiality and equality (see especially\nNagel 1991, Chapter 7).\n\nSome clarification, however, is required. To say that from the\nimpartial point of view, no one is seen as intrinsically more\nsignificant than anyone else, is not to say that there is no reason\nwhatsoever for which a person might demand more moral attention or\nbetter treatment than others. Many moral theorists, after all, will\nsuppose that from the impartial point of view, properly conceived,\nsome individuals will count as more significant, at least in certain\nways. William Godwin (Godwin 1793) provides an influential and\ninfamous example. Fenelon, the archbishop of Cambrai, Godwin writes,\nmay be supposed to be more significant than a mere chambermaid; so in\nan emergency (Godwin imagines a building on fire) the archbishop ought\nto be rescued first. The reason, however, is not that the archbishop\nis intrinsically more significant; rather, the claim is grounded on\nthe fact that the archbishop makes greater contributions to\nsociety:\n\n[T]hat life ought to be preferred which will be most conducive to the\ngeneral good. In saving the life of Fenelon, suppose at the moment\nwhen he was conceiving the project of his immortal\nTelemachus, I should be promoting the benefit of thousands\nwho have been cured by the perusal of it of some error, vice and\nconsequent unhappiness. Nay, my benefit would extend further than\nthis, for every individual thus cured has become a better member of\nsociety and has contributed in his turn to the happiness, the\ninformation and improvement of mankind. (Godwin 1793, 41–42)\n\n\nIn Godwin’s consequentialist view, impartiality requires that we\nconsider all people who will be affected by our decision, not just\nthose who are directly affected. Thus, taking into account the\ninterests of those whom Fenelon’s writings stand to benefit, it\nis clear that the right thing to do is to save him from death. One\nclear implication of the example is that viewing persons from an\nimpartial point of view need not imply that we view them equally, in\nevery sense of the word; and it certainly does not imply that everyone\nmust receive equal treatment. In Godwin’s Archbishop\nFenelon case, if we assume that only one person can be saved, the only\nway to give the archbishop and the chambermaid equal treatment would\nbe to let them both perish in the flames.\n\nWhat impartiality requires, many would argue, is not that everyone\nreceive equal treatment, but rather that every person be treated\nas an equal (Dworkin 1977, 227). While the distinction between\nequal treatment and treatment as equals is difficult to make out with\nprecision, the main idea is fairly clear: treatment as equals requires\nthat persons are not treated equally, but rather treated in\naccordance with what rights they possess, what legitimate claims they\nput forward, and, in general, with what they deserve. (Recall\nHooker’s related distinction between impartial treatment and\nimpartial application of partiality-permitting rules). Thus, to\ninflict a one year jail sentence on all accused persons, regardless of\nwhether they are guilty or innocent, is to provide equal treatment to\nmembers of that group; but it is not to treat them as equals. As\nmentioned, however, the concept of being treated as an equal is a\nsomewhat elusive one, and there is certainly room to wonder whether\nthe chambermaid, in being sacrificed for in the interests of those who\nstand to benefit from Fenelon’s survival, truly is being treated\nas an equal. (Someone with Kantian intuitions, at any rate, is\nunlikely to think so.)\n\nThe most famous and controversial element of Godwin’s example,\nof course, is yet to come. Let’s suppose that the chambermaid is\nnot just any chambermaid, but has some relationship to the\nagent who must choose whom to save:\n\nSupposing the chambermaid had been my wife, my mother or my\nbenefactor. That would not alter the truth of the proposition. The\nlife of Fenelon would still be more valuable than that of the\nchambermaid; and justice – pure, unadulterated justice –\nwould still have preferred that which was most valuable. Justice would\nhave taught me to save the life of Fenelon at the expense of the\nother. What magic is there, in the pronoun ‘my’ to\noverturn the decisions of everlasting truth? My wife or my mother may\nbe a fool or a prostitute, malicious, lying or dishonest. If they be,\nwhat consequence is it that they are mine? (Godwin 1793, 41–42)\n\n\nOf course, since his thought experiment concerns an unusual emergency\ncase, it might be suggested that, since we are not frequently faced\nwith the choice of who to pull from a burning building, Godwin’s\nposition, as radical as it is, has few implications for everyday moral\ndecision-making. But as Singer (1972) has argued, those of us who live\nin economically privileged countries can, by choosing to donate some\nof our incomes to charity, prevent people elsewhere on the planet from\ndying of hunger, easily preventable diseases, etc.; and this seems to\nimply that we are always in the situation of choosing who lives and\nwho dies – whether or not we explicitly acknowledge the fact.\n(See also Unger 1996 and Singer 2009. Singer’s work has given\nrise to the movement popularly known as ‘effective\naltruism,’ composed of people who attempt to dedicate their\nlives to doing as much practical good as possible. One popular\nstrategy is to donate as much as possible to those charitable\norganizations judged to be most effective. Such views, like\nGodwin’s, adhere to the view that we owe as much moral attention\nand effort to those who are distant and unrelated to us as to our\nneighbors, close friends, and even family.\n\nMany have resisted the extreme position defended by Godwin, Singer,\netc. If nothing else, such positions are quite clearly incompatible\nwith the apparent existence of morally admirable partiality. (Williams\n(1981) holds that even to consider sacrificing one’s wife for\nthe sake of impersonal justice constitutes a kind of moral error in\nits own right.) Moreover, despite the fact that the ultimate\nevaluation is made on the grounds of perfectly general properties, it\nis not entirely clear that the objects of the evaluation really are\nbeing treated as equals, in the relevant sense – the fact that\nthe chambermaid’s life is to be sacrificed for the overall good\nat least suggests that her standing as a moral being is not really\nbeing taken into account, and that the suggested understanding of\nmoral impartiality is therefore deficient. Deontological prohibitions\non using people as mere means to an end may be seen as expressing a\ncommitment to a kind of impartiality in which everyone is seen to be\nequally in possession of a kind of worth that grounds inviolable\nrights against certain forms of treatment. Such prohibitions are\ncompatible with what Kant referred to as imperfect duties to\nprovide benefits to others, though they place limits on what may be\ndone while fulfilling those duties.\n\nOne need not deny the very possibility of an agent-neutral ranking of\nstates of affairs in terms of value, in order to recognize the\nexistence of deontological prohibitions of this sort. One need only\nhold that such an impersonal ranking does not in itself determine our\nmoral obligations. Philosophers such as John Taurek have taken the\nfurther step and argued that the various goods of individual persons\ncannot be added up to a total ‘overall’ good in any\nmeaningful sense, and that the traditional consequentialist conception\nof right action as maximizing the overall good is therefore incoherent\n(Taurek 1977). Indeed, Taurek claims, such decision-making actually\nfail to show equal respect for all persons concerned. (Taurek’s\ndenial that one can aggregate various individual goods can be regarded\nas a strong version of the Rawlsian claim that morality must respect a\n‘distinction between persons.’) Suppose a lifeguard must\nchoose between saving one drowning person or saving five; whomever she\nchooses not to save will drown, and she cannot save both groups. Most\nconsequentialists (and many others) would take it as obvious that, at\nleast in the absence of very special circumstances (the solitary\ndrowner’s being the potential author of Telemachus, for\ninstance) the five should be saved rather than the one. But to assume\nthis, Taurek argues, would be to fail to show the one the same respect\none shows the five: after all, this response leaves the single victim\nno chance at all of being rescued. Taurek’s controversial\nsuggestion is that the lifeguard would show equal respect by flipping\na coin, as this would offer every person involved an equal chance\n(fifty percent) of being rescued. Not surprisingly, Taurek’s\nargument has engendered a substantial amount of discussion and\ncriticism (see for instance Kamm 1993 Chapters 5 & 6, Kavka 1979,\nOtsuka 2000, Parfit 1978.)\n\n3. Moral impartiality I: Consequentialist moral theories\n3.1 The nature of consequentialist impartiality\n\nConsequentialist moral theories hold that moral evaluations and\njustifications must ultimately be grounded in the value of the\nconsequences of the actions, rules, policies, strategies, character\ntraits, etc. that are being evaluated (Hooker 1994). That is, the\nultimate question to be asked of any action, rule, or character trait\nunder evaluation is, “Does it [the action, rule, or trait in\nquestion] promote the good?” For the purposes of this entry,\nthree important assumptions will be made regarding consequentialist\ntheories. First, consequentialist theories will be assumed to hold\nthat the overall values of sets of consequences can be determined, and\nthus ranked, independently of the identity of any particular agent.\nSecond, such theories will be assumed to hold that the impersonal good\nis largely if not entirely composed of the interests of individual\npersons, and that the interests of each person count for just as much\nas those of every other person. Finally, it will be assumed that we\nare dealing with act consequentialist theories – theories, that\nis, which hold that the consequentialist standard is to be applied\ndirectly to the actions of agents, and that what is required is that\nevery action (or overall pattern of action) maximize the impersonal\ngood. Such a theory, then, requires that every agent always choose an\naction that will bring about consequences at least as good as those\nthat would be brought about by any other available action.\n\nIn so characterizing consequentialism I am defining it as applying\ndirectly to the evaluation of an agent’s actions. (It should be\npointed out that this still leaves it open whether or not an agent\nshould be motivated by explicit thoughts about\nconsequentialist requirements. It might be that an agent will perform\nbetter in terms of consequentialist standards if she is most often\nmoved by other sorts of considerations—a point that is important\nto the sort of ‘sophisticated’ consequentialism advanced\nby Peter Railton, Frank Jackson, and others, and briefly discussed\nbelow.) One might instead adhere to a theory according to which\nfirst-order moral rules should be chosen in accordance with their\ntendency to promote the overall good, impartially (and impersonally)\nconceived. Such theories typically go by the name ‘rule\nconsequentialism’, though there has been some debate as to\nwhether they constitute genuinely consequentialist theories at all\n(Howard-Snyder 1993). For the purposes of understanding impartiality,\nat any rate, it is most useful to group rule consequentialist theories\nnot with act consequentialist theories but with deontological\ntheories, which are more similar in terms of their underlying\nnormative structure.\n\nAs we are understanding it, then, consequentialism seems to place each\nagent under a pervasive obligation to be strictly impartial between\nall persons, by requiring her always to exclude from her practical\ndeliberations (almost) all considerations that do not bear directly on\nthe ways in which people’s interests might be advanced or\ninjured by her actions.\n\nThe consequentialist standard, then, is strictly impartial in a very\ndirect manner and in a very rigorous sense. A consequentialist agent\nis not permitted to prefer herself, nor any of her loved ones, in\nchoosing a distribution of benefits and burdens. She may not accept a\npleasure for herself if doing so involves passing up the opportunity\nto bring about a slightly larger pleasure for a stranger. Nor is she\npermitted to feed her own children if she could do more good by\nfeeding hungrier strangers instead. She must sacrifice the life of a\nspouse, parent or child if, by doing so, she would save more lives, or\neven (as in Godwin’s Archbishop Fenelon case) save the life of\none other person whose contribution to the overall good would be\ngreater than that of the person sacrificed. It is for reasons such as\nthis that consequentialist impartiality is accused of being too\ndemanding. By refusing to allow the agent’s personal concerns to\nplay a special role in her practical deliberations, it is claimed,\nconsequentialism threatens her integrity and alienates her from\nherself and others (Kapur 1991, Scheffler 1982, Stocker 1976, Williams\n1973, 1981). As Brian Barry has written, the effect of\nconsequentialist impartiality “is, in effect, to extend to the\nwhole of conduct the requirements of impartiality that on the\ncommon-sense view are restricted to judges and bureaucrats acting in\ntheir official capacities” (Barry 1995, 23).\n3.2 Is consequentialist impartiality too demanding?\n\nThe fact that consequentialist impartiality turns out to have such\nstrict and demanding implications is, for the consequentialist, a\ndouble-edged sword. On the plausible and popular assumption that a\nmoral theory must be deeply impartial, consequentialism meets this\ncriterion with flying colors. And consequentialists have typically\nbeen adept at exploiting this fact with powerful rhetoric\n(Godwin’s famous query, ‘what magic is there in the\npronoun ‘my’?’ being a noteworthy example.) On the\nother hand, the impartial demands of consequentialism are so strict\nand so extreme that many critics have found them unacceptable:\nconsequentialism, they claim, simply demands too much and must\ntherefore be rejected (Scheffler 1982, Slote 1985, Williams 1981).\n\nOne form of this worry is a version of what we referred to above as\nthe problem of morally admirable partiality. The common-sense view is\nthat it is permissible for an agent to be partial toward herself; that\nis, to treat her own projects and concerns as if they had special\nsignificance (Scheffler 1982). (From her point of view, of course,\nthey do have special significance.) This sort of self-concern, then,\nconstitutes a form of partiality which seems, from the vantage point\nof common sense, to be morally endorsed. Similarly, certain sorts of\npartiality directed toward other people – friends, family\nmembers, and the like – are also forbidden by consequentialist\nimpartiality, but regarded as justifiable, and in many cases\nadmirable, from the standpoint of common sense (Blum 1980, Cottingham\n1983, Kekes 1981, Keller 2013, Slote 1985). A related concern focuses\nnot on morality per se but on the needs and conditions of\nagenthood and personal flourishing. James Griffin, for example, writes\nthat “Many prudential values involve commitments—to\nparticular persons, institutions, causes, and careers. One cannot live\na prudentially good life, one cannot fully flourish, without becoming\nin large measure partial. That partiality then becomes part of one; it\nis not something one can psychologically enter into and exit from at\nwill” (Griffin 1996, 85). Bernard Williams argues that, in\nprohibiting an agent from seeing their own persona projects and\ncommitments as no more significant than those of any other agent,\nconsequentialist theories violate the integrity of agents and\nundermine any reason they might have for being moral (Williams 1973,\n1981; cf. Hurley 2009). (It should be noted that Williams sees Kantian\ndeontological theories as to some degree vulnerable to these\nobjections as well.)\n\nThere are a number of possible responses to this objection. First, a\nconsequentialist might argue that any genuinely impartial\nmoral theory will make extreme demands of agents—at least, if we\nunderstand the concept of impartiality correctly. This strategy faces\na serious difficulty: namely, it at least seems to be the case that\ncertain non-consequentialist moral theories – in particular,\ndeontological theories – also incorporate impartial elements in\na fundamental manner, and yet make demands on the moral agent which\nare considerably less extreme than those of consequentialism. Thus,\nwhile some consequentialists (e.g. Brink 1989) have argued that the\ntruth of consequentialism can be logically derived more or less\ndirectly from the requirement that morality be impartial, this seems\nto be a mistake (Scheffler 1992, 105–109). Of course, it is open\nto the consequentialist either to deny that deontological moral\ntheories are genuinely impartial (Kagan 1989; Scheffler 1982, 1985),\nor to argue that, properly understood, any plausible ethical theory\nwill be seen to make demands comparable to those made by\nconsequentialism (Brink 1989, Ashford 2000). Both of these strategies,\nhowever, face difficulties; as we will see in section 4, there is in\nfact a very strong case in favor of viewing at least some\ndeontological theories as genuinely and fundamentally impartial\n– a case which nevertheless does not prohibit us from viewing\nsuch theories as less demanding than their consequentialist\nrivals.\n\nA consequentialist adopting this strategy also presumably needs to\nshow that human agents are capable of living up to the kinds\nof demands placed on us by consequentialism (or else to argue that it\ndoes not matter whether or not we are capable). As James Griffin\nwrites, our “natural perhaps genetic partiality limits our will.\nSome acts fall just outside the motivational range of a normal human\nbeing. Since ought implies can, what lies outside\nnatural human motivation does not even enter contention for being a\nmoral requirement. Norms are not fashioned in a vacuum; they are cut\nto fit agents like us” (Griffin 1990, 129). While Kagan (1989)\nargues on behalf of consequentialists that available empirical\nevidence supports the view that humans, given sufficient information\nand vivid representations, can be brought to overcome their inherent\ntendencies to be partial, Griffin regards the evidence as\ninsufficient, concluding that “complete impartiality is beyond\nhuman capacity” (Griffin 1996, 92).\n\nA second possible consequentialist response is to argue that those who\nobject to consequentialism on the grounds that it is too demanding are\nplacing too much importance on the role of morality in practical\nreasoning (Brink 1989; Wolf 1982, 1992). If moral considerations\ndominated practical reasoning – if, that is, they were the only\nor at any rate by far the most significant considerations in\ndetermining our actions – then consequentialism would be\nuntenable, on account of its demanding too much. But when put in their\nproper place then in the larger scheme of practical reasons and\nrequirements, the extreme demands of consequentialist morality will no\nlonger seem threatening. To borrow a pair of phrases from David Brink,\nwhat appear to be ‘moral worries’ about the tendency of\nconsequentialism to make excessive moral demands, might really be\n‘worries about morality’ – worries, that is, about\nwhether or not we have reason to act as morality requires. Whether the\nview of morality presupposed by this strategy is true, however, is\nquestionable; at the very least, it does not seem to be the case that\nthe majority of those who have defended consequentialism as a\nnormative theory of ethics have intended it to be viewed as a theory\nthat could be frequently or easily overridden or ignored (see Railton\n1984, Miller 1992 Chapter 10, Jollimore 2001 Chapter 3). One possible\nexception is Alastair Norcross (2006a, 2006b), who has proposed a\nmodification of utilitarianism he calls “scalar\nutilitarianism,” which ranks possible actions in terms of moral\nrightness but makes no claim as to which acts are morally required.\nSince scalar utilitarianism sees rightness as a matter of degree\nrather than as a binary property, and refrains from identifying any\naction as required, he claims that it avoids the demandingness\nobjection and related objections.\n\nA third strategy is perhaps the best known and most frequently\nemployed. It is argued that, given a reasonable and accurate view of\nhuman nature and the abilities of agents, it will be seen that what\nconsequentialism requires is not a radically different sort\nof life from the one most of us currently live; rather,\nconsequentialism will require (in most cases, at least) only\nreasonable, and relatively minor, adjustments in our current\nlifestyles. In particular, it is argued that consequentialism permits\nthe agent both to give preference to her own projects and concerns,\nand to favor particular other individuals (friends, family members,\netc.), and that all this is consistent with the agent’s having\nas her overriding project the maximizing of the good. The locus\nclassicus of this argument is found in Mill’s\nUtilitarianism:\n\nThe objectors to utilitarianism cannot always be charged with\nrepresenting it in a discreditable light. On the contrary, those among\nthem who entertain anything like a just idea of its disinterested\ncharacter, sometimes find fault with its standard as being too high\nfor humanity. They say it is exacting too much to require that people\nshall always act from the inducement of promoting the general\ninterests of society. But this is to mistake the very meaning of a\nstandard of morals, and to confound the rule of action with the motive\nof it […] The great majority of good actions are intended, not\nfor the benefit of the world, but for that of individuals, of which\nthe good of the world is made up; and the thoughts of the most\nvirtuous man need not on these occasions travel beyond the particular\npersons concerned, except so far as is necessary to assure himself\nthat in benefiting them he is not violating the rights – that\nis, the legitimate and authorized expectations – of any one\nelse. The multiplication of happiness is, according to the utilitarian\nethics, the object of virtue: the occasions on which any person\n(except one in a thousand) has it in his power to do this on an\nextended scale, in other words, to be a public benefactor, are but\nexceptional; and on these occasions alone is he called on to consider\npublic utility; in every other case, private utility, the interest or\nhappiness of some few persons, is all he has to attend to. (Mill 1992\n[1861], 64–66)\n\n\nEven Godwin (1801 [1968]) endorses a version of this argument, writing\nthat\n\nTrue wisdom will recommend to us individual attachments […]\nsince it is the object of virtue to produce happiness; and since the\nman who lives in the midst of domestic relations will have many\nopportunities of conferring pleasure, minute in the detail, yet not\ntrivial in the amount. (Quoted in Cannold, et al., 1995)\n\n\n(This position, it will be noted, appears to be in some amount of\ntension with the more extreme consequentialist position attributed to\nGodwin in section 2.3).\n\nMore recent versions of this argument follow Mill’s basic\nstrategy. Peter Railton (1984) argues that a\n‘sophisticated’ consequentialist will develop patterns of\ndecision-making that do not, except on rare occasions, refer\nexplicitly to consequentialist aims and goals, and that both the\npsychology and the outward behavior of such an individual will be\nsimilar to that of the typical non-consequentialist. Similarly, Frank\nJackson (1991) argues that the most efficient strategy for a dedicated\nconsequentialist is to concentrate on small groups of particular\npersons, rather than trying to promote the well-being of humanity at\nlarge, and that this will involve the formation of close personal\nrelationships with other individuals. Others who have deployed\nversions of this argument include Bales (1971), Brink (1989), and\nPettit & Brennan (1986).\n\nThe evaluation of this consequentialist strategy is a difficult issue.\nConsequentialists are surely correct to point out that obsessive\nconsequentialist strategizing is likely, at a certain point, to turn\ncounter-productive, and that a consequentialist agent is therefore\nwell-advised to develop more moderate approaches. On the other hand,\nMill and many other consequentialists seem to underestimate the amount\nof good that a dedicated consequentialist agent might be able to\ncontribute, and thus, to underestimate the amount of good that she\nwill be required to contribute. Moreover, our powers to influence the\nlives of strangers have increased considerably since Mill’s day.\nAs Susan Wolf writes, “[T]his argument is simply unconvincing in\nlight of the empirical circumstances of our world. The gain in\nhappiness that would accrue to oneself and one’s neighbors by a\nmore well-rounded, richer life than that of the moral saint would be\npathetically small in comparison to the amount by which one could\nincrease the general happiness if one devoted oneself explicitly to\nthe care of the sick, the downtrodden, the starving, and the\nhomeless” (Wolf 1982, 428; see also Singer 1972). This thought\nis borne out by the empirical facts. If we look at the lives of actual\n‘effective altruists,’ who are motivated by a commitment\nto make as great a contribution to general well-being as possible, we\nfind that such people have indeed found it necessary to transform\ntheir lives in fairly radical ways and to make large sacrifices in\nterms of time, money, and comfort, and often in terms of relationships\nand personal happiness (see examples in MacFarquhar 2015).\n\nMoreover, even if a theory such as Railton’s sophisticated\nconsequentialism can allow a sophisticated consequentialist agent to\nsometimes knowingly bring about less than maximally good consequences,\nsuch a theory must nonetheless insist that each particular act of\ndoing so is indeed morally wrong – an insistence which seems\ncontrary to our moral intuitions (Jollimore 2001). It is not clear,\nthen, that an appeal to the limits of human powers can succeed in\nconverting what is a fundamentally radical moral theory into a\ncomfortably conservative one.\n3.3 Consequentialist impartiality and justice\n\nIn addition to claiming that consequentialist impartiality is too\ndemanding, many critics have also argued that it is too permissive.\nSince consequentialism makes the permissibility of an action entirely\ndependent on the value of that action’s consequences, it follows\nthat there is no type of action that can be prohibited on\nconsequentialist grounds (except, of course, for that\n‘type’ which is defined explicitly in terms of sub-optimal\nconsequences.) Thus instances of torture, premeditated murder, rape,\nand other violations of fundamental human rights are at least\npotentially justifiable on a consequentialist basis; no such action\ncan be ruled out, morally speaking, until the comparative value of the\nstate of affairs it will bring about has been determined.\n\nThe effect of this complaint, like the previous one, is not to deny\nthe claim that consequentialism is a deeply impartial moral theory,\nbut rather to suggest that it incorporates the wrong sort of\nimpartiality. Suppose, to take an example common in the literature,\nthat consequentialism recommends that a person be convicted of, and\npunished for, a crime they did not commit, in order to prevent the\npublic from rioting (Nielsen 1972). Such an action would, according to\ncommon intuitions, constitute a gross violation of justice; and it\nseems a weak reply to point out that the recommendation was arrived at\nthrough an impartial calculation – a calculation that took the\ninterests of every individual (including the framed man) into equal\naccount. For while the claim is, strictly speaking, true, there is\nnevertheless a clear and compelling case in favor of concluding that\nthe framed person was not treated impartially, in the sense\nthat ought to matter here. We expect a judicial system to allocate\npunishments in accordance with degree of guilt, not in accordance with\nthe expected value to society of the consequences in each case; and\nthe fact that both methods constitute forms of impartial\ndecision-making does not imply that they are equally morally\nacceptable.\n\nAgain, there are many ways the consequentialist might respond. As with\nthe demandingness objection, perhaps the most common response is to\nargue that something resembling ordinary rules and practices can be\njustified on the basis of consequentialist considerations. The classic\nversion of this response dates back to Mill’s Utilitarianism\n(1992 [1861]). If institutions of justice are to be given a general\njustification, Mill argues, this justification must find its ultimate\ngrounding in utility to society; for what else could explain why\njustice is valued at all, other than the fact that it serves and\nprotects our interests? But since a justice system will only succeed\nin this role if it is governed by common principles of justice –\nprinciples including, for instance, that only the guilty should be\npunished, and that the punishment ought to be proportional to the\ncrime – it follows that such principles are not opposed to\nconsequentialism at all. Rather, at the deepest justificatory level,\nconsequentialism and the demands of justice coincide. (See also\nNeilsen 1972)\n\nThe claim that such a coincidence generally obtains is probably easy\nto establish. The challenge for Mill, and for other consequentialists,\narises in those particular cases in which the coincidence fails.\nAssuming that the possibility of such cases does not move one to\nsimply abandon consequentialism in favor of some more justice-friendly\nconception (such as the rule consequentialism Mill himself sometimes\nseems to find attractive), there are two general defense strategies\nfor consequentialists to employ. The first strategy argues that there\nare good consequentialist reasons for being the sort of agent who\nrespects the dictates of justice even in cases in which the\ncoincidence between the demands of justice and those of\nconsequentialism fails (Pettit 1997; cf. Railton 1986). The second\nstrategy admits that there are cases in which unjust actions can be\ngiven a consequentialist justification, but holds that when so much as\nit stake, justice must give way to consequentialism’s demands\n(Smart 1973; Kagan 1989; Pettit 1997). Whether either approach is\nsufficient, given the apparent depth and force of our common\nintuitions about the requirements of justice, is a matter of ongoing\ndebate.\n4. Moral impartiality II: Deontological moral theories\n4.1 Deontological impartiality and the personal point of view\n\nIn section 3.2 we noted that while consequentialist impartiality is\none possible interpretation of the demand that morality be impartial,\nit is not by any means the only available interpretation; nor is it\nclearly the most plausible. The considerations related to justice\ndiscussed in section 3.3 may help us to appreciate this. For consider\nonce more the position of the framed innocent, whose fundamental\ninterests have been sacrificed for the sake of the greater good. Such\na person may well complain that he has not been treated\nimpartially, in the appropriate sense; for, while it is true that his\ninterests were counted in determining the nature of the overall good,\nit is nevertheless also true that ultimately, he became the victim of\na form of abuse that was both harsh and undeserved. The framed\ninnocent might also back up his complaint by making the plausible\nclaim that, had he been in a position to choose, he would never have\nconsented to a moral system that allowed anyone to be\naccorded such treatment. Thus, while there is a sense in which his\ninterests were counted equally, there is another and very important\nsense in which his interests – and perhaps more importantly, his\nclaims and rights – do not seem to have received full or\nadequate consideration at all.\n\nMany deontologists insist that consequentialism errs by failing to\naccord proper significance to the moral agent as an individual; in\nJohn Rawls’ words, consequentialism “does not take\nseriously the distinction between persons” (Rawls 1971, section\n5). (Rawls has utilitarianism in particular as his target, but the\npoint applies more widely.) Paul Hurley writes, “Morality\nenslaves us to the impersonal standpoint unless we recognize the\nindependent moral significance of persons. Recognition of the moral\nsignificance that persons have independent of their impersonal moral\nsignificance is necessary both to secure the rational authority of\nmoral requirements and to fend off enslavement of the agent to the\nimpersonal standpoint by morality” (Hurley 2009, 178). And\nSamuel Scheffler suggests that “for human beings as creatures\nwith values, the normative force of certain forms of partiality is\nnearly unavoidable. If that is right, then for morality to reject\npartiality in a general or systematic way would be for it to set\nitself against our nature as valuing creatures. And that, I believe,\nwould make morality an incoherent enterprise” (Scheffler\n2010).\n\nThus, the fact that consequentialist impartiality makes extraordinary\nand, to many, unreasonable demands on the individual (section 3.2)\nmight be taken to indicate that consequentialism fails to take\nindividuals seriously as agents. At the same time, the fact\nthat consequentialist impartiality permits the individual to be used\nas a mere means when doing so promotes the greater good (section\n3.3)might indicate that consequentialism fails to take individuals\nseriously as patients. The conception of impartiality that\ntends to be favored by deontologists avoids such implications by\nrefusing to view impartial action simply as a matter of maximizing\ninterests (or some other version of the impersonally determined good.)\nDeontologists take the right rather than the good to\nbe fundamental to ethics, and tend to see moral action in terms of\nacting in accordance with principles that are rationally acceptable to\nall.\n\nExactly what these principles are, and exactly what method should be\nused to determine them, are matters of some disagreement among\ndeontological theorists. But there does seem to be a general consensus\namong deontologists that moral impartiality does not require\nthat an agent be strictly neutral between her own good and the good of\nother people in ordinary decision-making contexts. Rather, an agent is\npermitted on deontological views to give special attention to her own\nprojects and interests. Impartiality might be required in certain\nspecial contexts—for instance, when one is serving on a hiring\ncommittee or a jury, grading student papers, or designing\nlegislation—but it is not seen as a general and pervasive\nrequirement applying to everyday decisions and behavior. In one sense,\nthis places a limit on impartiality’s scope and demands; but it\nis compatible with viewing impartiality as having a central and\nirreducible role in morality. After all, on many deontological views\nthe rules and principles permitting partiality at the everyday level\n(to oneself, to friends and relatives, to one’s own projects,\netc.) are justified in terms that appeal directly to impartial\nconsiderations. It might be claimed, for instance, that\neveryone’s autonomy and dignity—which are\nunderstood as moral features possessed equally by all—are best\nrespected by adopting a set of moral rules and practices according to\nwhich each person is permitted to carve out a space for their own\nprojects and relationships, within which the requirement to be\nimpartial does not generally apply. This is just to say that\nfirst-order partiality is compatible with second-order\nimpartiality (Barry 1995; see also Hooker 2010).\n\nThe fact that deontological theories generally permit (some degree of)\nfirst-order partiality – that is, that agents are permitted to\npay special attention to their own interests, projects, and loved ones\n– should not, then, be taken to imply either that the\nagent’s interests are objectively more valuable than\nthose of other persons, or that the agent is justified in viewing them\nas such. Rather, the deontologist will claim, it reflects the fact\nthat it is morally legitimate (perhaps, again, because justifiable in\nsecond-order impartialist terms) for an agent to regard her own goals\nand interests as especially important to her. Thus,\ndeontological moral systems tend to incorporate an irreducible element\nof agent-relativity of a sort that consequentialist theories reject\n(Nagel 1986; McNaughton & Rawling 1992, 1993, 1998; Jollimore\n2001; Kamm 2007 ).\n\nThe incorporation of agent-relativity of this sort into deontological\ntheories allows such theories to escape the most straightforward\nversions of the claim that they demand too much of moral agents.\nNevertheless, various versions of that objection have been leveled\nagainst deontological theories. It has been claimed, for instance,\nthat Kantianism, by insisting that only actions performed out of the\nmotive of duty have moral worth, delegitimizes or even forbids the\ntype of motives which typically (and perhaps necessarily) operate in\nthe context of close personal relationships (Stocker 1976; Williams;\n1981). Typically, Kantians have responded by distancing themselves\nfrom the view that only actions motivated by duty have value,\nand acknowledging instead that a commitment to duty need only function\nas a limiting condition, rather than as the primary source of\nmotivation in all cases (Baron 1995). The Kantian account of moral\nvalue, of course, is not essential to deontological theories; and\nthose theories which eschew it may well be able to avoid the\ndemandingness objection altogether.\n4.2 Impartiality and universalizability\n\nOn many deontological views, particularly Kantian ones, the\nsignificance of moral impartiality is seen as arising from the fact\nthat a core role is given to the concept of universalizability (Gert\n1998; Hare 1981; Kant 1964 [1785]; Kohlberg 1979). The requirement\nthat moral judgments be universalizable is, roughly, the requirement\nthat such judgments be independent of any particular point of view.\nThus, an agent who judges that A ought morally to do\nX in situation S ought to be willing to endorse the\nsame judgment whether she herself happens to be A, or some\nother individual involved in the situation (someone who, perhaps, will\nbe directly affected by A’s actions), or an entirely\nneutral observer. Her particular identity is completely irrelevant in\nthe determination of the correctness or appropriateness of the\njudgment.\n\nUniversalizability, thus formulated, does imply at least one sort of\nimpartiality: an agent whose judgments are universalizable will be\nmorally consistent, in the sense that she will judge her own actions\nby the same standards she applies to others. Such an agent will not\nmake an exception of herself by allowing herself to break a rule she\nregards as binding for others, or to perform any other action which\nshe would not accept if performed by another agent. Impartiality of\nthis sort, however, does not necessarily imply any sort of\nimpartiality with respect to other individuals’ interests,\nrights, or claims. On a minimally demanding interpretation of the\nuniversalizability requirement, the judgments made by a person whose\nconception of the good was intrinsically racist – that is, a\nperson who held that the well-being of members of some one particular\nrace mattered more (or less), objectively speaking, than the\nwell-being of members of other races – could very well turn out\nto be universalizable, so long as the racist held that his judgments\nwere objectively correct, and so ought to be assented to by all\nindividuals – including those individuals who would be\ndisadvantaged by the general adoption of those views (cf. Gewirth\n1978, 164; Gert 1998, Chapter 6; Wiggins 1978; Williams 1985,\n115).\n\nHowever, the conclusion that the racist’s judgments are\nuniversalizable presupposes a very minimal account of what\nuniversalizability requires. On this account, it requires only that an\nagent be sincerely committed to the objectivity of his judgments, in\nthe sense that he views them (from his current perspective) as correct\nfrom all perspectives, and thus as calling for everyone’s assent\n(whether or not that assent is actually given.) (Cf. Parfit 2011, I,\n323–24) There are two ways of making the universalizability\nrequirement more demanding. The first is to appeal to certain\ncounterfactual claims about what the agent would endorse if\nhe actually did occupy various perspectives. On this view, a\nparticular judgment by A is universalizable if and only if\nA endorses that judgment from his current perspective,\nand would endorse the same judgment from any other\nperspective. Given this understanding of universalizability, it\nis much less likely – indeed, extraordinarily unlikely –\nthat racist views will turn out to be universalizable; for it is not\ngenerally true of individuals that they would endorse the view\n“The well-being of members of race R matters less than\nthe well-being of members of other races” if they themselves\nwere members of race R. However, such a view may well require\ntoo much, for there are few if any moral judgments or principles that\nwould be endorsed from every perspective any given agent\nmight occupy.\n\nA different approach to universalizability eschews the appeal to\npsychological facts altogether, and holds that whether or not a\nparticular judgment is universalizable is a logical fact rather than a\npsychological one. Kant’s categorical imperative test, for\nexample, holds that universalizability is the distinguishing feature\nof correct moral judgments, and that a judgment is universalizable if\nand only if it can, without contradiction, be willed as a universal\npractical law (Kant 1964 [1785]). Since the test hinges on whether the\nwilling of a judgment as a universal law results in a\ncontradiction, it follows that whether or not a judgment\nis universalizable in this way is a matter of practical\nreason, and does not depend on which particular individual’s\nwill happens to be involved.\n\nThe types of impartiality implied by both of these more demanding\nversions of the universalizability requirement are likely to be\nconsiderably more substantial than the formal consistency required by\nthe minimal version. Kant, for instance, seems to hold that\nuniversalizability implies a certain level of altruism or charity, in\nthe form of the imperfect duties we owe towards other individuals.\nThere are problems, however, with Kant’s argument for this. In\nparticular, it is not clear just how the universal willing of a maxim\nsuch as “When others are in need of help, I always ignore their\nneeds” give rise to any sort of contradiction. It is\ntrue, of course, that, were we actually in a position to choose the\nuniversal maxims on which all rational persons would act, this would\nbe a poor choice, for we might someday be in need of assistance from\nanother. But to say that the willing of this maxim as a universal law\nwould be imprudent is not to say that doing so is\ncontradictory. Moreover, as David Wiggins (1978) points out,\ncertain other actions that seem as if they ought to be morally\npermissible – the act, for instance, of releasing a debtor from\nhis debt out of generosity – have maxims that seem to fail the\nuniversalizability test so conceived. These examples may point to a\ngeneral problem with the attempt to derive impartiality from\nuniversalizability: whereas the latter, at least on a Kantian\ninterpretation, is a formal property of moral judgments, moral\nimpartiality, as we have seen, is a substantive rather than a formal\nconcept. (See Herman 1993 and Korsgaard 1996 for attempts to respond\nto these problems.)\n\nIt should be mentioned that some moral theorists have attempted to\nderive various versions of consequentialist impartiality more or less\ndirectly from the universalizability requirement (Hare 1981, Cummiskey\n1996, Pettit 2000; see also Harsanyi 1982). However, the claim that a\nconception of impartiality that is not only substantive but also\nextraordinarily demanding can be derived from a requirement which, as\njust pointed out, is essentially a formal one, continues to strike a\nmajority of moral philosophers as dubious.\n4.3 Other Deontological Approaches\n\nThe Universalizability Formulation is one of four formulations of the\ncategorical imperative Kant provided, and some recent Kantian\ntheorists have de-emphasized it, placing more weight on other\nformulations. Houston Smit and Mark Timmons suggest that the\nhumanity formulation, “which commands individuals to treat\nhumanity as an end in itself, never merely as a means” (2017,\n175) be read as attributing to autonomous beings an “elevated\nstatus of dignity” which “is something all rational agents\npossess (and possess equally) as far as dignity qua autonomous agents\ngoes […]. This equal status is the basis of a principle of moral\nequality” (187). This in turn implies two principles\nof impartiality. The positive principle of impartiality states that\n“one is to adopt maxims and perform corresponding actions that\nmanifest a positive concern for the ends [especially the needs] of\nothers.” The negative principle of impartiality states that\n“one is to avoid adopting maxims or performing actions that\nmanifest a negative concern for the ends (especially the needs) of\nothers.” Both of these principles, they point out,\n“concern the welfare of persons.” (187–8) Smit and\nTimmons go on to argue that these principles of impartiality imply a\nduty of beneficence which “involves adopting an unselfish maxim\nthat disposes one to promote the well-being of others in need without,\nas Kant says, ‘hoping for something in return.’”\n(206) There is some common ground here with utilitarian approaches,\nthough of course on a Kantian account the duty of beneficence is an\nimperfect duty: one need not do everything one can by way of helping\nothers in need in order to demonstrate the proper sort of respect for\nthe humanity of others. (This leaves open, of course, the question of\njust how much one is required to do.)\n\nMany moral theorists, including Kant himself, have noted similarities\nbetween his universalizability formulation of the categorical\nimperative and the Golden Rule (“We ought to treat others as we\nwould want others to treat us,” in Derek Parfit’s\nformulation (2011, I, 321). Kant himself argued that the\nuniversalizability formulation was superior, though some have\ndisagreed. Parfit argues that Kant’s reasons for rejecting the\nGolden Rule are generally unconvincing, and largely relied on\nKant’s smuggling his own assumptions into the presuppositions of\nthe rule. Ultimately, Parfit argues for a principle that combines the\nfundamental insight of the Golden Rule with elements of\nuniversalizability and contractualism, which he calls “the\nKantian Contractualist Formula”: “Everyone ought to follow\nthe principles whose universal acceptance everyone could rationally\nwill.” “This formula,” he writes, “might be\nwhat Kant was trying to find: the supreme principle of morality”\n(2011, I, 321).\n\nOther deontologists have emphasized the importance of seeing morality\nas fundamentally interpersonal in nature. Paul Hurley (2009) argues\nthat consequentialists misconstrue moral impartiality by interpreting\nit as fundamentally impersonal: “whereas the impersonal\nconception captures a form of equal concern for persons that is\nappropriate, in the first instance, for the evaluation of overall\nstates of affairs as better or worse, this interpersonal conception of\nimpartiality is relevant, in the first instance, to the evaluation of\npotential courses of action as right or wrong. […] Moreover, such a\nfundamental role for interpersonal impartiality in the moral\nevaluation of actions provides a rationale for the agent-centered\nrestrictions and permissions that are central to ordinary\nmorality.” (Hurley 2009, 179) Although this interpersonal\nstandpoint does not offer an agent-neutral ranking of outcomes, and\nthus “generates agent-centered reasons and claims, reasons and\nclaims to do and not to do, not to prevent or promote overall\noutcomes,” Hurley argues that it nevertheless captures a robust\nand substantial understanding of moral impartiality—an\nunderstanding, moreover, that fits our ordinary moral beliefs and\npractices and better accommodates the rational authority of morality\nthan the agent-neutral impersonal framework endorsed by\nconsequentialism. “If practical reason has a fundamentally\ninterpersonal structure, then it is structured by an equal concern by\neach person for each other person. Each person has an independent\nrational significance that is reflected explicitly in reasons that\nothers have not to interfere with them, and in claims that each person\nhas not to be interfered with by any other person” (Hurley 2009,\n220).\n4.4 Contractualist models of deontological impartiality \n\nParfit’s “Kantian Contractualist Formula,” mentioned\nin the previous section, adheres to the contractualist approach to\nmoral theorizing, which gives expression to two insights fundamental\nto Kantian thinking: that morality is objective, and not simply a\nmatter of personal opinion or expression of interest and desire; and\nthat from the standpoint of morality, each person matters just as much\nas, and no more than, any other person. Contractualism borrows from\nthe social contract tradition the idea that morality may be viewed as\nthe result of an agreement between those who are to be bound by its\ndictates. Two variants of this approach can be distinguished. The\nformer, sometimes referred to as contractarianism, identifies\nthe participants in the bargaining process with actual individuals,\nand thus is broadly historical. The latter approach, by contrast,\nappeals to what agents would choose under various, quite\npossibly unrealizable conditions, and is thus hypothetical\nrather than historical. It is the latter approach that will concern us\nhere.\n\nThe hypothetical contractualist model, then, regards moral principles\nas the result of a bargaining process among a group of agents, subject\nto certain restrictions that are specified so as to guarantee that the\nchosen principles will meet the demands of second-order impartiality.\nThe most famous example of this approach is John Rawls’\n‘veil of ignorance’, as described in (Rawls 1971).\nAccording to Rawls, the principles of a just society are those that\nwould be chosen by self-interested rational agents in the\n‘original position’ – a position in which agents\npossess broad knowledge about human history and the nature of the\nworld they live in, but are denied specific information regarding\ntheir own particular identities or prospects in the society in\nquestion, the nature of that society, and, crucially, the nature of\ntheir own particular conception of the good. Since nobody knows who\nthey will be or what social position they will occupy, there is no\nopportunity for anyone in an advantaged position to take advantage of\nthat position in order to force a less privileged party to concede to\nan otherwise unacceptable outcome. It is this fact that allows Rawls\nto claim that principles chosen under the veil of ignorance are\nguaranteed to be impartially acceptable to all – and thus,\nguaranteed not to be unjust.\n\nIt should be noted that Rawls does not intend that morality in its\nentirely be derived from the original position. Rather, the function\nof the original position is limited to the choice of the most general\nprinciples of social justice in a well-ordered society (Rawls 1971,\nsection 2; 2001, section 12). Nevertheless, Rawls’ mechanism is\nintended to draw the broad outlines of what many see as the most\nimportant part of morality: its public or political aspect. By viewing\npolitical morality as the result of an agreement between contractors\nlimited by the strictures of the veil of ignorance, Rawls intends to\ndevelop a political philosophy that reflects his commitment to the\nidea of liberal neutrality: the idea, that is, that each person has a\nprivate right to her own conception of the good, and that particular\nconceptions of the good therefore ought not to be legislatively\ninstituted, nor legislated against.\n\nAn especially difficult task attending a project of this sort is that\nof determining what shape this political morality will take –\nthat is, determining which principles would be chosen by agents in the\noriginal position. On Rawls’ account, the contractors settle on\nprinciples that guaranteed as much liberty as possible for all and,\nwithin the limits set by this guarantee, a roughly egalitarian\ndistribution of goods in which inequalities are allowed only if they\nare to the benefit of the worst off (Rawls 1971, section 11; 2001,\nPart II). The claim that such principles would recognize all persons\nas equals – and thus, their claim to reflect the demands of\nmoral impartiality – is supported by several considerations, of\nwhich three are perhaps most significant: first, that all persons are\nguaranteed equal (and substantial) civil liberties; second, that the\nresulting allocation of resources is broadly egalitarian, and in\nparticular, ensures, so far as is possible, that the fundamental needs\nof all persons are met; and third, that since the only inequalities\nthat are permitted are those that would benefit the least advantaged,\nit can presumably be assumed that the least advantaged would give\ntheir assent to the existence of such inequalities (they would not,\neven if they could, veto the system.)\n\nIn Rawls’ scheme, the function of the veil of ignorance is\nnecessary to prevent rational self-interested persons from using their\nknowledge of their own positions to win unfair advantages over others.\n(Whether such an approach can provide genuine impartiality between\ncompeting conceptions of the good is a difficult question that will be\nfurther considered in section 5.) An alternative approach abandons\nboth the veil of ignorance and the assumption that the bargaining\nparties are primarily self-interested. This is the strategy favored by\nT.M. Scanlon, whose contractors are motivated not by self-interest but\nby ‘the desire for reasonable agreement’ (Scanlon 1982,\n115 n. 10; see also Scanlon 1978, 1998; Barry 1995). On the resulting\naccount of moral permissibility, “an act is wrong if its\nperformance under the circumstances would be disallowed by any system\nof rules for the general regulation of behavior which no one could\nreasonably reject as a basis for informed, unforced general\nagreement” (Scanlon, 1982, 110). The requirement of impartiality\nis captured here by the basic fact that the question is whether\neveryone who is to live under the selected rules can\nreasonably accept them. As in Rawls’ theory, however, the\nprinciples of second-order impartiality accepted at the contract level\nallow for considerable first-order partiality at the level of\nagent-choice. Somewhat similarly, Gert (1998) argues for a list of\nmoral rules which “all impartial rational persons would favor\nincluding […] as part of the moral system” (158).\n\nSince interpretations of impartiality, what it requires, and how it\nconnects with other moral concepts can vary considerably,\ncontractualist theories that recognize impartiality as a core element\ncan nevertheless vary widely in terms of what they requires of agents.\nHarsanyi (1977) argues that a version of utilitarianism can be\ndefended on the basis of an “equiprobability model,”\naccording to which an agent ought to choose between social systems\n“under the assumption that, in either system, he would have the\nsame probability of occupying any one of the available social\npositions” (Harsanyi 1982, 45; cf. Hare 1981). Gauthier (1986)\nalso views his theory as meeting the demands of impartiality, even\nwhile explicitly denying that a substantial notion of equality plays a\nmajor role: “Equality is not a fundamental concern in our\ntheory. In arguing that social institutions and practices are\njustified by appeal to a hypothetical ex ante agreement among\nfully informed rational persons, we have appealed to the equal\nrationality of the bargainers to show that their agreement satisfies\nthe moral standard of impartiality. But impartial practices respect\npersons as they are, the inequalities among them as well as the\nequalities” (270). Obviously, such a combination of claims is\nnot uncontroversial; while it is clear that a notion of impartiality\ncan be defined that respects existing inequalities as well as\nequalities, it will not be immediately obvious to everyone why such a\nnotion ought to have deep moral significance or to be reflected in our\nmoral practices.\n5. Impartiality: Its demands and scope\n5.1 The cognitive challenge of impartiality\n\nIn addition to objections directed specifically toward\nconsequentialist or deontological conceptions of impartiality, there\nare also objections aimed at the very idea that impartiality ought to\nbe viewed as fundamental to morality. Some would argue that\nimpartiality, as conceived by traditional ethical theories, makes\nextraordinary and unreasonable cognitive demands on moral agents. This\nworry must be distinguished from the objection to consequentialist\nimpartiality considered earlier, which claimed that the\nsacrifices demanded by consequentialist impartiality were\nunreasonable and excessive. The objection now being considered is not\nthat impartiality asks the agent to give up too much, but rather that\nthe cognitive feats demanded by these moral theories will exceed the\ncapacity of the typical moral agent. Indeed, one popular version of\nthis objection alleges that an agent will require an unreasonable\namount of knowledge or cognitive ability simply to be able to identify\nwhat the demands of impartiality are (Friedman 1989; Walker\n1991). Given the conception of the impartial point of view as a\n‘God’s eye’ point of view, for example (Baier 1958),\nit seems questionable whether it is ever reasonable to expect a human\nmoral agent to be able to occupy such a perspective. God, quite\nobviously, possesses far more knowledge than does any human being;\nmoreover, God’s point of view is both objective and impersonal\nin ways that an individual human’s perspective cannot be. (As\nMargaret Urban Walker points out, it is often said that human beings\nhave to live with their decisions, but it sounds very odd to say that\nof God (Walker 1991, 765).)\n\nSimilar remarks apply to the conception of the impartial point of view\nas ‘the point of view of the universe’ (Sidgwick 1907), to\nHare’s conception of the ideal moral agent as a so-called\n‘archangel’ (Hare, 1981), and, Walker claims, to\nFirth’s conception of the ideal impartial observer (Firth,\n1952.) Similarly, Marilyn Friedman points out that even if a person\ndid manage to occupy such a point of view for a period of time –\nsupposing such a thing to be possible – there would be no way to\nbe certain that she had successfully done so: standard conceptions of\nimpartiality, she claims, prescribe “methods of normative\nthinking [which] represent psychological and epistemic feats, the\nachievement of which we have no independent way to confirm”\n(Friedman 1991, 645).\n5.2 Impartiality, Impersonality, and Indifference\n\nA second objection to traditional conceptions of moral impartiality\nfinds fault with the traditional tendency to define impartiality in\nnegative or abstract terms – in terms, that is, of which\nelements must be absent from the psychology of the agent, or\nwhich we must pretend are absent in the process of\nidealization. M.C. Henberg, for instance, claims that most if not all\nprocedural accounts of impartiality confuse it with disinterest or\nimpersonality, and thus, ultimately, with indifference. (It should be\nnoted that many impartialists are quite explicit about the link\nbetween morality, impartiality, and the lack of emotion; Baier (1958),\nfor instance, writes that “the moral point of view [is] that of\nan independent, unbiased, impartial, objective, dispassionate,\ndisinterested observer” (201; see also Firth 1952).) Similarly,\nRichard Brandt argues that it is a mistake to define moral\nimpartiality with reference to an ideal observer who is defined as\n(among other things) disinterested; for after all, “it is not\nclear that a purely disinterested being would support a moral system\nat all” (Brandt 1979, 227). While Brandt’s complaint is\nparticularly directed at the ideal observer theory of (Firth 1952),\nthis objection seems to apply much more broadly; it is obvious, for\ninstance, that Rawls’s veil of ignorance is designed precisely\nto prevent the contractors from acting in an interested manner.\n\nThe problem is not only that impersonal persons of this sort are\nlikely to suffer from massive indifference, but also that there is\nalleged to be a conceptual difficulty with the very idea of conceiving\nimpartiality in such terms. An abstract or impersonal evaluator, it is\nargued, could not possibly make reliable judgments about substantive\nmoral matters (whether or not he was motivated to), since he would be\nunable to appreciate the particular concerns of the contesting\nparties. Both of these difficulties – the motivational and the\ncognitive – are well expressed by Iris Marion Young, who rejects\naltogether the idea that morality is primarily a matter of\nimpartiality:\n\nThe ideal of impartiality is an idealist fiction. It is impossible to\nadopt an unsituated point of view, and if a point of view is situated,\nit cannot stand apart from and understand all points of view. It is\nimpossible to reason about substantive moral issues without\nunderstanding their substance, which always presupposes some\nparticular social and historical context; and one has no motive for\nmaking moral judgments and resolving moral dilemmas unless the outcome\nmatters, unless one has a particular and passionate interest in the\noutcome […] when class, race, ethnicity, gender, sexuality, and\nage define different social locations, one subject cannot fully\nempathize with another in a different social location, adopt her point\nof view; if that were possible then the social locations would not be\ndifferent. (Young 1990, 104–5; cf. Benhabib 1987, 90)\n\n5.3 Impartiality, Objectivity, and Neutrality\n\nOne can agree with critics like Young in being skeptical regarding\nnaive interpretations of impartiality without wholeheartedly rejecting\nimpartiality as either unrealistic or undesirable. Even if our ability\nto empathize with others, or to genuinely put ourselves in their\nplace, is limited by psychological constraints, the attempt to do so\nmay represent an ideal that is worth aspiring to. Moreover, we need\nnot follow Young in identifying impartiality with “an unsituated\npoint of view.” An aspiration toward impartiality might instead\ninvolve an attempt to avoid parochialism by being open to as many\ndifferent voices and viewpoints as possible. Amartya Sen finds such an\naspiration in the work of Adam Smith, writing that “one of\nSmith’s major methodological concerns is the need to invoke a\nwide variety of viewpoints and outlooks based on diverse experiences\nfrom far and near, rather than remaining contented with\nencounters—actual or counterfactual—with others living in\nthe same cultural and social milieu, and with the same kind of\nexperiences, prejudices and convictions about what is reasonable and\nwhat is not, and even beliefs about what is feasible and what is\nnot” (Sen 2009, 45).\n\nIt is on this basis that Sen distinguishes between what he calls\n‘open’ and ‘closed’ impartiality. The\ndistinction “turns on whether or not the exercise of impartial\nassessment is confined … to a fixed group.” Since the\ncontractors behind the veil of ignorance are aware that they are part\nof a certain society (and do not see themselves in any sense as\nrepresenting the world as a whole), the veil of ignorance represents\nan impartial system only in the closed sense. Therefore, Sen complains\nthat “As a device of structured political analysis, the\nprocedure is not geared to addressing the need to overcome group\nprejudices” (Sen 2002, 446). By contrast, open\nimpartiality, which Sen finds recommended in the works of Adam Smith\n(see Smith 1759), demands “that the viewpoints of others,\nwhether or not belonging to some group of which one is specifically a\nmember, receive adequate attention.” Sen applies this\ndistinction to John Rawls’s view of justice as grounded in a\ncontract devised by hypothetical contractors under a veil of\nignorance, writing that:\nThe Rawlsian ‘veil of ignorance’ in the\n’original position’ is a very effective device for making\npeople see beyond their personal vested interests and goals. And yet\nit does little to ensure an open scrutiny of local and possibly\nparochial values …. The Smithian procedure includes …\nthe insistence that the exercise of impartiality must be open (rather\nthan locally closed) since “we can do this in no other way than\nby endeavoring to view them with the eyes of other people, or as other\npeople are likely to view them.” (Sen 2009, 128; Smith\n1976[1759], III, 1, 2, 110)\n\nFor Sen, the attempt to be impartial by opening conversation (and\ndirecting one’s own attention) to as many different perspectives\nas possible is closely related to aspirations to ethical objectivity:\n“to the extent that we look for ethical objectivity, the\nreasoning that is necessary has to satisfy what can be seen as the\nrequirements of impartiality” (Sen 2009, 46). Objective moral\nreasoning, that is, requires a willingness to consider arguments and\nconsiderations presented by all members of the moral community, and\nthis receptivity must ideally be extended to all on an equal basis.\nSuch impartiality, as conceived by Sen, seems closely related to the\nvirtue identified by Miranda Fricker as “testimonial\njustice,” the “specifically anti-prejudicial\ncurrent that the virtuous hearer’s sensibility needs to contain\nin order that the hearer may not be led into perpetrating testimonial\ninjustices” (Fricker 2007, 86). Testimonial injustices, as\nunderstood by Fricker, occur when people silence, ignore, or refuse to\ntake seriously other people’s views and ideas for certain sorts\nof reasons—for instance, because they have been led by their\nacceptance of a stereotype to believe that people like the speaker are\ngenerally not worth listening to. (Thus Fricker describes the central\ncase of testimonial injustice as an “identity-prejudicial\ncredibility deficit” (28).) Moreover, Sen’s comments\nabout impartiality suggest he would agree with Fricker that the\nrelevant character trait “serves not one but two ultimate\nvalues: it simultaneously protects both truth and justice”\n(Fricker, 120).)\n\nSen, as mentioned, identifies Rawlsian liberalism as one target of his\nconcern. The idea of picturing society, as Rawls and other\ncontractualists picture it, as guided by a hypothetical agreement\nbetween persons, each of whom is equally empowered to revoke the\nagreement, is to capture the idea that the rules governing society\nmust in some sense be acceptable to all, and must embody, in some deep\nway, the ideal of equal respect. Sen’s complaint about the\n’closed impartiality’ of such systems, however, draws our\nattention to the fact that this approach risks leaving those not party\nto the contract out in the cold. But surely it is plausible to think\nthat a society, in order to be just, must not only treat (and avoid\ntreating) its own citizens in certain ways, but must also\nrespect certain rules regarding its behavior towards members of other\nsocieties. As Charles Jones (1999) writes, “Unlike Rawls\n… I see no reason to restrict our moral focus to the basic\nstructure of any particular nation-state; on the contrary, if\none’s concern is with the justifiability of the institutions\nwhich determine people’s life chances, there are compelling\ngrounds for taking a wider view.” There are various responses\nopen to Rawlsian theorists. Rawls himself suggests that we imagine a\nsecond veil of ignorance behind which representatives of various\nsocieties can meet in order to set fair and impartial ground rules for\ninternational relations. Much like justice within states, Rawls\nwrites, “Justice between states is determined by the principles\nthat would be chosen in the original position so interpreted. These\nprinciples are political principles, for they govern public policies\ntoward other nations” (Rawls 1971; for relevant later\ndevelopments see Rawls 1999b).\n\nOthers, particularly feminist critics, have worried that the Rawlsian\napproach might exclude certain people within any given\nsociety. Susan Moller Okin, Martha Nussbaum, and others have pointed\nout that A Theory of Justice pays little specific attention\nto the family as an institution for structuring society; rather, it is\nsimply assumed that society will be composed of families, and while\nthe rules of justice govern relations between various “heads of\nhouseholds,” Rawls’s attitude often seems to be that as a\nprivate institution, what goes on within the family is immune to\ncriticism from the perspective of justice (Okin 1989; see also Okin\n1994). Such a view, of course, would ignore the fact that a great many\ninjustices can take place within families: neglect, child and spouse\nabuse, and inegalitarian distributions of resources and of labor, and\nvarious forms of testimonial injustice, among others. Thus, in a\nsociety in which males tend to command more power and resources than\nfemales—which, of course, describes most\nsocieties—adherence to the principles arising out of the\nOriginal Position would be insufficient to avoid certain forms of\ndiscrimination and oppression. (Here, too, Rawls modified his views\nsomewhat in later writings, in light of such criticisms (Rawls 1993,\nRawls 1999a).) More generally, feminist philosophers have frequently\nraised concerns about the ways in which liberal conceptions of\nneutrality and impartiality presuppose and reinforce traditional\nmale-dominated, individualistic approaches to moral theory, and in\ndoing so reinforce the social status quo (Gilligan 1982; Noddings\n1984; Benhabib 1987; Young 1990). As Benhabib has pointed out,\n“Universalistic moral theories in the Western tradition from\nHobbes to Rawls are substitutionalist, in the sense that the\nuniversalism they defend is defined surreptitiously by identifying the\nexperiences of a specific group of subjects as the paradigmatic case\nof the human as such. These subjects are invariably white, male adults\nwho are propertied or at least professional.” (Benhabib 1987,\n81) As a result, the dominant social positions of such parties tend to\nbe protected and even enhanced in the social and political theories\nresulting from such allegedly neutral liberal theories.\n\nThe general concern is that contractualists and others claiming to\nground moral theory in impartial considerations might smuggle in their\nown substantive moral positions and biases under the guise of\nneutrality. Rawls’s use of the veil of ignorance, for example,\nhas been criticized by Thomas Nagel and others on the basis that, by\nrequiring that agents lack knowledge of their conceptions of the good\n(a necessary stipulation of the bargainers are to achieve a\nconsensus), the veil of ignorance excludes from the original position\ninformation that is morally relevant, and indeed may put some of the\nbargainers at a disadvantage. “The original position,”\nNagel writes, “seems to presuppose not just a neutral theory of\nthe good, but a liberal, individualistic conception according to which\nthe best that can be wished for someone is the unimpeded pursuit of\nhis own path, provided it does not interfere with the rights of\nothers” (Nagel 1973; see also Teitelman 1972; Schwartz 1973;\nSandel 1982; Benhabib 1987). Such a conception, it is held, clearly\ndoes favor some conceptions of the good over others: in particular,\natomic, individualistic conceptions focusing on personal fulfillment\n(constituted, perhaps, through the acquisition of consumer goods) are\nprivileged over more communal or social ideals that focus on\nsolidarity and mutual interaction between persons (Sandel 1982; cf.\nO’Neill 1997, Chapter 1).\n\nThe problem of neutrality is a pressing one for liberals: given the\nimportance to their view of the thought that an impartial government\nmust be neutral between various moral conceptions (it must, that is,\nrespect what Rawls calls ‘the fact of pluralism’), it is\nessential to show that liberal impartialism does not simply represent\nanother such moral conception (or ‘sectarian view’) in its\nown right. Liberal impartialism, then, must turn out to be a framework\nthat can be agreed to by all relevant parties, even as they continue\nto disagree regarding particular substantive moral issues.\n\nHow is the liberal to establish this? Nagel (1987) endorses what he\ncalls ‘epistemological restraint,’ which holds that it can\nbe reasonable for an individual to hold certain beliefs yet\nsimultaneously unreasonable to attempt to decide matters of public\npolicy on the basis of such beliefs. Such beliefs, which tend to be\nmoral or religious in nature, are said to be viewed differently from\nthe inside (from which standpoint they have perfect authority) than\nfrom the outside (from which standpoint they are regarded as\nquestionable). The difficulty, as Barry (1995) and Raz (1990) have\npointed out, is to explain why doubts visible from the outside would\nnot infect the internal point of view, thus weakening these\nbeliefs’ internal authority as well. (It should be noted that\nNagel himself has expressed doubts about this argument; see Nagel\n1991.)\n\nRawls’s view appears to be similar to Nagel’s (and thus,\nsubject to the same difficulty). According to Rawls, to endorse a view\nof justice is not to claim that it is true; moreover, the\nacceptability of liberal impartialism is not to be derived from its\ntruth; rather, such a view will be accepted (it is to be hoped)\nbecause, in societies of the relevant sort, it will form a common\nelement (an ‘overlapping consensus’) in the various\ncompeting conceptions of the good that occupy the public sphere (Rawls\n1993). (Again, the criticisms contained in Raz 1990 are especially\ntrenchant.)\n\nWhile both Nagel and Rawls explicitly reject the idea that liberal\nimpartialism is to be justified on the basis of skepticism toward\nvarious conceptions of the good, Barry (1995) explicitly endorses this\nform of justification. (Barry emphasizes that the relevant form of\nskepticism does not involve eschewing one’s moral and religious\nbeliefs, but rather rejecting the claim to be certain of the\ntruth of those beliefs.) This approach has been criticized on the\nbasis that such skepticism itself constitutes a sectarian view, and\ntherefore is not neutral (Larmore 1987, Mendus 2002) However, as Barry\npoints out, the decisive issue is not whether some people would reject\nskepticism, but whether it can reasonably be rejected –\nand given Barry’s definition of skepticism, its claim to resist\nbeing so rejected seems considerably stronger than the claims of the\nvarious conceptions of the good themselves, which must indeed be\nexcluded from the public sphere.\n6. Partiality and Impartiality\n6.1 Relationships and the Justification of Partiality\n\nWhile some philosophers reject the moral significance of partiality\naltogether, holding that morality is both fundamentally and thoroughly\nimpartial, many agree with Nagel (1991) that morality includes both\npartial and impartial elements, and that neither is reducible to the\nother. In particular, the context of “special” or\n“personal” relationships constitutes an area in which it\nseems plausible to many to think that partiality to certain people is\nnot frequently permissible and sometimes morally admirable and/or\nobligatory. There is, however, no generally accepted account of what\njustifies partiality in this area.\n\nOne influential account of partiality’s justification appeals to\nthe value of personal projects. Since personal projects and/or the\nability to pursue personal projects are important, and since agents\nwho were required to be completely impartial in every aspect of life\nwould be unable to pursue such projects, we should allow that people\nare not required to be absolutely impartial in every aspect of life.\nBernard Williams (1981) famously argues that at least some of an\nagent’s projects – he calls them “ground\nprojects” – are fundamental components of the\nagent’s identity, and an agent who gives them up, because she is\nrequired to do so by morality, or for any other reason, will find\nherself with no reason to be moral, to go on living, or to do anything\nat all. Other philosophers, including Wolf (1992; see also 1982),\nMacIntyre (1984), Sandel (1982), and Stroud (2010) also base the\njustification of partiality on the value and significance of personal\nprojects and commitments. (For Sandel and MacIntyre this means,\nlargely, commitments to the political community that has formed\none’s identity and to which one owes one’s\nallegiance.)\n\nA second possible account sees our personal relationships as the\nsource of partiality’s justification. Kolodny (2003) argues that\npersonal relationships bear “final value” and that this\ngrounds special obligations toward those people to whom we are\nrelated. Similarly, Scheffler (2004), argues that valuing a\nrelationship non-instrumentally necessarily involves seeing it as\ngiving rise to certain reasons that will be partial in nature. A\nvariation on this sort of view agrees that relationships are\nsignificant but suggests that we should view reasons, rather than\nvalue, as fundamental. On such views our reasons for giving\npreferential treatment to those to whom we are related are not\ngrounded in the value of those relationships and indeed need not be\nreduced to or grounded in anything else at all; they carry inherent\nand irreducible normative significance. Views of this sort are put\nforward by Scanlon (1998) and Jeske (2008).\n\nKeller (2013) criticizes both the projects-based view and the\nrelationship-based view, and argues instead for a third alternative,\nwhich he calls “the individuals view.” According to the\nindividuals view, reasons that justify the special treatment of those\nto whom we are related “arise from facts about the individuals\nwith whom our special relationships are shared” (79). Rather\nthan acting as reasons for treating those persons better than others,\nour relationships act as enablers –that is, background\nconditions that explain why some facts count as reasons for a given\nagent. (Keller borrows the idea of an enabler, and the term, from\nJonathan Dancy; see especially Dancy (2004). For similar views, which\nalso draw on Dancy’s work, see Jollimore (2011) and Lord\n(2016).)\n\nThe question of how to justify partiality to friends, relatives,\nintimates, and others to whom we bear “special”\nrelationships has implications for many questions concerning\nimpartiality and our broader obligations, and to the issue of who gets\nincluded in the community of moral recognition. Consider, for\ninstance, the moral questions that arise with respect to our treatment\nof non-human animals. While it may once have been plausible (or\ngenerally regarded as such) to see the fact that a given organism\nbelonged to the human species as indicating that it possessed\nintrinsic properties grounding a special moral status, and hence was\nentitled to better forms of treatment than “mere” animals\nwere entitled to, such a view is no longer clearly defensible.\nAccordingly, in recent decades many consequentialists have used some\nform of “marginal cases” argument to argue that we have\nmore moral obligations to non-human animals than has generally been\nrecognized. If we would object to killing and eating a human\nindividual for food—even a severely cognitively disabled human\nindividual who is, say, no more intelligent than the average\npig—how can we justify killing and eating pigs for food? How we\nthink about marginal cases arguments, and obligations to non-humans,\nwill likely reflect what we think regarding the nature of partiality\nto particular humans. Holding some version of the individuals view,\nfor instance, would seem to lend support to the common\nconsequentialist contention that obligations to individuals (whether\nhuman or non-human) must depend on the intrinsic qualities of those\nindividuals, rather than on our relations to them. Thus, to eject some\nindividual from the community of moral recognition merely because it\nbelongs to a different species, and not our own, would constitute a\nviolation of moral impartiality at least somewhat comparable to\nregarding some human as not worthy of moral consideration\nbecause they belonged to a different ethnic group (Singer 1974; see\nalso McMahan 2002, 218–28).\n\nOther philosophers, by contrast, have endorsed a version of the\nrelationship-based view with respect to our moral duties to humans and\nnon-human animals, holding that we have special obligations to the\nformer, and not to the latter, in something like the way we have\nspecial obligations to distant relatives. When Bernard Williams\nwrites, “There are certain respects in which creatures are\ntreated one way rather than another simply because they belong to a\ncertain category, the human species,” he is not merely\ndescribing but endorsing the view that species membership is relevant,\nat least for human beings (Williams 2008, 142). Similarly, T.M.\nScanlon sees his contractualism as justifying the significance of\nsuch ties, writing that “The mere fact that a being is ’of\nhuman born’ provides a strong reason for according it the same\nstatus as other humans. This has sometimes been characterized as a\nprejudice, called ‘speciesism.’ But it is not prejudice to\nhold that our relation to these beings gives us reason to accept the\nrequirement that our actions should be justifiable to them. Nor is it\nprejudice to recognize that this particular reason does not apply to\nother beings with comparable capacities, whether or not there are\nother reasons to accept this requirement with regard to them”\n(Scanlon 1998, 185). (See also Diamond 1991, 2018.)\n\nOf course, it is perfectly possible to hold a relationship-based view\nof partiality to special relations while rejecting the claim that\nmembership in the same species constitutes the relevant sort of\nrelationship—just as many who think being A’s\nfriend grounds special obligations toward A might reject the view\nthat belonging to the same ethnic group as A does so as well.\n(The challenge, as always, is to explain what kinds of relationships\ndo ground obligations, and which do not. (Kolodny, 2010a) provides\nsome helpful discussion and defends a proposal for where and how to\ndraw the line.) By the same token, a commitment to the idea that\nlegitimate special obligations (those to friends, for instance) are\ngrounded by some version of the individuals view leaves it quite open\nprecisely which qualities of one’s friends do the\ngrounding, and just how the grounding relation is conditioned by the\nexistence of the friendship. Merely knowing, then, that someone holds\nthe relationship view, the individuals view, etc, does not in\nitself tell us much about whether they endorse obligations to\nnon-humans. Still, their ultimate view on that matter, whatever it\nmight be, will inevitably be influenced by their position regarding\nthe nature and grounding of special obligations and other forms of\npartiality. The of justifying partiality toward intimates and\nrelatives, then, is by no means an abstract or inconsequential one, as\nour views on such matters bear on such larger questions as who gets\nincluded in, and who ends up excluded from, the community of moral\nconsiderability.\n6.2 The Partialist-Impartialist Debate\n\nAlthough many people continue to speak of a ‘partialist vs.\nimpartialist debate,’ it should by now be clear that neither\n‘partialism’ nor ‘impartialism’ unambiguously\ndenote any single moral position; at best, they designate two poles of\na continuum, one of which attributes no moral significance to the\ndemands of (any sort of) impartiality, the other of which sees\nmorality as exhausted by (some version of) impartiality. While a\nsomewhat general distinction can be usefully maintained, it is\nmisleading to think of the partialist-impartialist debate as a dispute\nbetween two clearly defined, and clearly opposed, camps (Deigh 1991;\nBarry 1995, 191–5). Maximilian de Gaynesford goes so far as to\nargue that “debates about partialism and impartialism thrive on\ntacit assumptions about the way each relates to the first person.\nThese assumptions rest on mistakes and confusions …” (de\nGaynesford 2010).\n\nThus, any general claim beginning with the words ‘partialists\n(or impartialists) think that…’ is bound to be both\nmisleading and contentious. In particular, there is good reason to be\nwary of objections to impartialism which claim that all impartialists\nendorse extreme moral demands, or that they require that practical\nreasoning be completely expunged of every vestige of the partial. It\nis true, of course, that at least some impartialists, such as Godwin,\nhave endorsed such claims. But many do not. Deontologists, as we have\nseen, hold impartiality to be a deep and significant element of\nmorality, but they also tend to allow for a considerable degree of\nfirst-order partiality. And even many consequentialists are prepared\nto admit the legitimacy of partial reasoning in some contexts, if only\non an instrumental basis. It is useful, then, to draw a distinction\nbetween two sorts of impartialist moral theory. Impartialist theories\nwhich require all agents to display first-order impartiality at all\ntimes (Godwin’s, for example) might be referred to as strict\nimpartialist theories. Impartialist theories which allow for some\nfirst-order partiality, but which nevertheless insist that all such\nbehavior be justified in second-order impartialist terms, might be\nreferred to as fundamentally impartialist moral theories. The\nclass of fundamentally impartial theories will include not only\ncontractualist, Kantian, and rule consequentialist theories, but also\ncertain act consequentialist theories (e.g. Railton 1986) which allow\nthe practice of first-order partiality as a means of promoting the\nimpersonal good. Such theories allow for partiality that is\npermissible, justifiable, and perhaps even admirable in moral terms.\nAt the same time, however, they insist that all such partiality is\nultimately reducible – that is, justifiable in impartialist\nterms at some deeper level.\n\nWithin the partialist camp, a strict partialist might be\ndefined as holding that no sort of impartiality plays any moral role\nwhatsoever – a logically possible, but uncommon, position. A\nmoderate partialist, by contrast, would admit that\nimpartiality of some sort plays a moral role, but deny that this role\nencompasses, or grounds, all of morality; in particular, such a figure\nwould be committed to the existence, in some contexts at least, of\nirreducible morally admirable partiality. A virtue theorist, for\ninstance, might make a significant place for impartiality by selecting\nit as one of the virtues; but a virtue of this sort would presumably\nhave to compete with other deeply partialist virtues such as loyalty,\nwhich would override impartiality in at least some contexts.\n\nTo the extent that a deep issue between partialists and impartialists\ncan be identified, it is presumably the question of whether\n(irreducible) morally admirable partiality does indeed exist; and it\nis along this line of dispute that the debate seems likeliest to\ncontinue. (Whether this debate is identical to the so-called\n‘justice-care’ debate, as contended in Cannold, et\nal (1995), is questionable, though it is undeniable that there\nare important parallels.) However, this way of classifying the\ndisputants, and of characterizing the issue itself, is meant to be\nsuggestive rather than definitive. The fact remains that there are\nmany types of partialist theories, and many types of impartialist\nones, and that continuing to speak of the\n‘partialist-impartialist debate’ in loose and imprecise\nterms is more likely to obscure than to illuminate.\n7. Epistemic partiality and impartiality\n\nCommonsense morality agrees with most deontological theories that\npersonal relationships involve various forms of morally admirable\npartiality. Until now most philosophers who have examined this\nphenomenon have focused on practical obligations: the ways in which we\nare obligated to treat our friends and relatives better than we treat\npeople whom we do not know and to whom we are not significantly\nrelated. Disagreements regarding the extent and nature of such\npractical obligations have dominated the partialist-impartialist\ndebate.\n\nRecently, however, a number of philosophers have focused their\nattention on a second sort of obligation we seem to have to friends\nand relatives. In addition to treating them differently, commonsense\nthought seems to hold that we ought to adopt different patterns of\nbelief formation and evaluation with respect to them – patterns\nof belief formation and evaluation that make it more likely that we\nwill think highly of them and regard them in a positive light. Thus,\nit has been suggested that friendship and similar relationships\ninvolve epistemic partiality: there are forms of epistemic bias which\nare recommended and possibly required by such relationships. As Simon\nKeller has written, “when good friends form beliefs about each\nother, they sometimes respond to considerations that have to do with\nthe needs and interests of their friends, not with aiming at the\ntruth, and that this is part of what makes them good friends”\n(Keller 2004, 333).\n\nSimilarly, Sarah Stroud has argued that when it is a friend’s\nbehavior that is in question, rather than that of a stranger,\n“we tend to devote more energy to defeating or minimizing the\nimpact of unfavorable data than we otherwise would. … [A]t the\nend of the day we are simply less likely to conclude that our friend\nacted disreputably, or that he is a bad person, than we would in the\ncase of a nonfriend” (Stroud 2006, 505–6).\n\nAs both Keller and Stroud point out, these are not simply descriptions\nof typical friendship behavior; rather, they seem to be generally\naccepted as requirements of friendship. If so – and if it really\nis true that epistemic partiality makes us less likely to form true\nbeliefs (but see Jollimore 2011 for a challenge to this claim) –\nthen we seem to face a difficult choice: we must either accept that\nforming true beliefs is not the only goal with respect to which\nepistemic standards should be evaluated, or else accept that the\nrequirements of friendship and other forms of love can conflict with\nthe requirements of epistemic rationality: being an ideal epistemic\nagent, that is, is not always compatible with being an ideal\nfriend.\n\nAs always, the issue is complicated by the effects of context. Whether\nthey are motivational or epistemic (or some combination of the two),\npartial biases that are entirely appropriate in some contexts, such as\nfriendship, will be deeply inappropriate in others, such as the making\nof hiring or sentencing decisions. (This assumes, of course, that we\nare rejecting the consequentialist view that the requirements of\nstrict impartiality are pervasive in all aspects of our lives.) As\nmentioned above, empirical research on implicit bias strongly suggests\nthat even when we recognize that we are acting in the latter sort of\ncontext, and believe ourselves to be acting in a thoroughly impartial\nand unbiased manner, we may well be fooling ourselves. Thus,\nformulating a correct theoretical understanding of the scope and\ndemands of partiality and impartiality, as difficult as that task is\nin itself, may not be sufficient for acting as a truly good or\nvirtuous agent. The more practical task of training our perceptions,\ninclinations, and motivations in order to see and respond to the\nworld, at least where appropriate, in an impartial way – or, if\nthis is not possible, then to see and act in ways that take into\naccount and correct for our inherent biases – would also seem to\nbe necessary.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Archard, David, 1995. “Moral Partiality,” <em>Midwest\nStudies in Philosophy</em>, XX: 129–141.",
                "Ashford, Elizabeth, 2000. “Utilitarianism, Integrity, and\nPartiality,” <em>The Journal of Philosophy</em>, XCVII(8):\n421–39.",
                "Baier, Kurt, 1958. <em>The Moral Point of View: A Rational Basis\nof Ethics</em>, Ithaca, NY: Cornell University Press.",
                "Bales, R. Eugene, 1971. “Act-Utilitarianism: Account of\nRight-Making Characteristics or Decision-Making Procedure?”\n<em>American Philosophical Quarterly</em>, 8(3): 257–65.",
                "Baron, Marcia, 1991. “Impartiality and Friendship,”\n<em>Ethics</em> 101: 836–57.",
                "–––, 1995. <em>Kantian Ethics Almost Without\nApology</em>, Ithaca, NY: Cornell University Press.",
                "Baron, Marcia, Philip Pettit, and Michael Slote, 1997. <em>Three\nMethods of Ethics</em>, Oxford: Blackwell.",
                "Barry, Brian, 1989. <em>Theories of Justice</em>, Berkeley:\nUniversity of California Press.",
                "–––, 1995. <em>Justice as Impartiality</em>,\nOxford: Oxford University Press.",
                "Benhabib, Seyla, 1987. “The Generalized and the Concrete\nOther: The Kohlberg-Gilligan Controversy and Feminist Theory,”\nin Benhabib and Cornell 1987: 77–95.",
                "Benhabib, Seyla, and Drucilla Cornell (eds.), 1987. <em>Feminism\nas Critique</em>, Cambridge: The Polity Press.",
                "Beyleveld, Deryck, 2013. “Williams’ False Dilemma: How\nto Give Categorically Impartial Reasons to Real Agents,”\n<em>Journal of Moral Philosophy</em>, 10(2): 204–226.",
                "Blum, Lawrence, 1980. <em>Friendship, Altruism, and Morality</em>,\nLondon: Routledge and Kegan Paul.",
                "Brandt, Richard, 1954. “The Definition of an ‘Ideal\nObserver’ in Ethics,” <em>Philosophy and Phenomenological\nResearch</em>, 15: 407–13.",
                "–––, 1979. <em>A Theory of the Good and the\nRight</em>, Oxford: Oxford University Press.",
                "Brink, David O., 1989. <em>Moral Realism and the Foundations of\nEthics</em>, Cambridge: Cambridge University Press.",
                "–––, 2001. “Impartiality and Associative\nDuties,” <em>Utilitas</em>, 13: 2.",
                "Broad, C.D., 1959. <em>Five Types of Ethical Theory</em>,\nPaterson, NJ: Littlefield, Adams &amp; Co.",
                "Buss, Sarah, 2006. “Needs (Someone Else’s), Projects\n(My Own), and Reasons,” <em>The Journal of Philosophy</em>, 103:\n373–402.",
                "Cannold, Leslie, Peter Singer, Helga Kuhse, and Lori Gruen, 1995.\n“What is the Justice-Care Debate <em>Really</em>, About?”\n<em>Midwest Studies in Philosophy</em>, XX: 357–75.",
                "Chappell, Timothy, 2009a. “Impartial Benevolence and\nPartial Love,” in Chappell (ed.) 2009b: 70–85.",
                "Chappell, Timothy (ed.), 2009b. <em>The Problem of Moral\nDemandingness: New Philosophical Essays</em>, New York: Palgrave\nMacmillan.",
                "Cottingham, John, 1983. “Ethics and Impartiality,”\n<em>Philosophical Studies</em>, 43: 83–99.",
                "–––, 1986. “Partiality, Favoritism, and\nMorality,” <em>Philosophical Quarterly</em>, 36:\n357–73.",
                "–––, 1996. “Partiality and the\nVirtues,” in Roger Crisp, ed., <em>How Should One Live? Essays\non the Virtues</em>, Oxford: Clarendon Press, 1996, pp.\n57–76.",
                "–––, 1996. “Medicine, Virtues, and\nConsequences,” in D. Oderberg and L. Laing, ed., <em>Human\nLives</em>, London: Macmillan, pp. 128–143.",
                "–––, 2010a. “Impartiality and Ethical\nFormation,” in Feltham and Cottingham 2010, pp.\n65–83.",
                "–––, 2010b. “Partiality and\nImpartiality,” in John Skorupski, ed., <em>The Routledge\nCompanion to Ethics</em>. New York: Routledge, pp. 617–27.",
                "Crisp, Roger. 2006. <em>Reasons and the Good.</em> Oxford: Oxford\nUniversity Press.",
                "–––, 2018. “Against Partiality,”\nUniversity of Kansas: The Lindley Lecture.\n[<a href=\"https://kuscholarworks.ku.edu/bitstream/handle/1808/26747/Crisp_2018_AgainstPartiality.pdf\" target=\"other\">Crisp 2018 available online</a>]",
                "Cullity, Garrett. 2004. <em>The Moral Demands of Affluence</em>,\nOxford: Oxford University Press.",
                "Cummiskey, David, 1996. <em>Kantian Consequentialism</em>, Oxford:\nOxford University Press.",
                "Dancy, Jonathan, 2004. <em>Ethics Without Principles</em>, Oxford:\nOxford University Press.",
                "Darwall, Stephen L, 1983. <em>Impartial Reason</em>, Ithaca, NY:\nCornell University Press.",
                "–––, 2010. “Responsibility within\nRelations,” in Feltham and Cottingham 2010: 150–168.",
                "Deigh, John, 1991. “Impartiality: A Closing Note,”\n<em>Ethics</em> 101: 858–864.",
                "Diamond, Cora, 1991. “The Importance of Being Human,”\n<em>Royal Institute of Philosophy Supplement</em>, 29:\n35–62.",
                "–––, 2018. “Bernard Williams on the Human\nPrejudice,” <em>Philosophical Investigations</em>, 41(4):\n379–98.",
                "Double, Richard, 1999. “Morality, Impartiality, and What We\nCan Ask of Persons,” <em>American Philosophical Quarterly</em>,\n36(2): 149–158.",
                "Dworkin, Gerald, 1974. “Non-neutral Principles,”\n<em>Journal of Philosophy</em>, 71(14): 491–506.",
                "Dworkin, Ronald, 1977. <em>Taking Rights Seriously</em>,\nCambridge, MA: Harvard University Press.",
                "Estlund, David, 2010. “I Will If You Will: Leveraged\nEnhancements and Distributive Justice,” in Feltham and\nCottingham 2010: pp. 223–241.",
                "Feltham, Brian, and John Cottingham, 2010. <em>Partiality and\nImpartiality: Morality, Special Relationships, and the Wider\nWorld</em>, New York: Oxford University Press.",
                "Firth, Roderick, 1952. “Ethical Absolutism and the Ideal\nObserver,” <em>Philosophy and Phenomenological Research</em>,\n12(3): 317–345.",
                "Flanagan, Owen, and Jonathan Alder, 1983. “Impartiality and\nParticularity,” <em>Social Research</em>, 3: 576–596.",
                "Frankfurt, Harry, 1997. “Equality and Respect,”\n<em>Social Research</em>, 64: 3–15; reprinted in <em>Necessity,\nVolition, and Love</em>, Cambridge: Cambridge University Press, 1999,\npp. 146–55.",
                "Fricker, Miranda, 2007. <em>Epistemic Injustice</em>, Oxford:\nClarendon Pres.",
                "Friedman, Marilyn, 1989. “The Impracticality of\nImpartiality,” <em>Journal of Philosophy</em>, 86:\n645–56.",
                "Gaus, Gerald F., 2010, “The Demands of Impartiality and the\nEvolution of Morality,” in Feltham and Cottingham 2010:\n42–64.",
                "Gauthier, David, 1986. <em>Morals by Agreement</em>, Oxford:\nOxford University Press.",
                "de Gaynesford, Maximilian, 2010. “The Bishop, the Valet, the\nWife, and the Ass: What Difference Does it Make if Something is\nMine?” in Feltham and Cottingham 2010: 84–97.",
                "Gert, Bernard, 1998. <em>Morality: Its Nature and\nJustification</em>, Oxford: Oxford University Press.",
                "–––, 1995. “Moral Impartiality,”\n<em>Midwest Studies in Philosophy</em>, XX: 102–127.",
                "Gewirth, Alan, 1978. <em>Reason and Morality</em>, Chicago:\nUniversity of Chicago Press.",
                "Gilligan, Carol, 1982. <em>In a Different Voice: Psychological\nTheory and Women’s Development</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "Godwin, William, 1793 [1926]. <em>Enquiry Concerning Political\nJustice and its Influence on General Virtue and Happiness</em>, ed.\nRaymond Preston. New York: Alfred A Knopf.",
                "–––, 1801 [1968]. <em>Thoughts Occasioned by the\nPerusal of Dr. Parr’s Spital Sermon</em>, in <em>Uncollected\nWritings (1785–1822) by William Godwin</em>, ed. J. Marken and\nB. Pollin, Gainesville, FL: Scholars’ Facsimiles &amp; Reprints,\npp. 314–5.",
                "Griffin, James, 1986, <em>Well-being</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 1990. Review of Shelly Kagan’s<em> The\nLimits of Morality</em>, <em>Mind</em>, 99: 129–31.",
                "–––, 1996. <em>Value Judgment</em>, Oxford:\nOxford University Press.",
                "Hare, R.M., 1981. <em>Moral Thinking</em>, Oxford: Oxford\nUniversity Press.",
                "Harsanyi, John C., 1977. <em>Rational Behavior and Bargaining\nEquilibrium in Games and Social Situations</em>, Cambridge: Cambridge\nUniversity Press.",
                "–––, 1982. “Morality and the Theory of\nRational Behavior,” in Sen and Williams, 1982: 39–62.",
                "Henberg, M.C., 1978. “Impartiality,” <em>Canadian\nJournal of Philosophy</em>, 8(4): 715–724.",
                "Herman, Barbara, 1993. <em>The Practice of Moral Judgment</em>,\nCambridge, MA: Harvard University Press.",
                "Hooker, Brad, 1994. “Is Rule-Consequentialism a Rubber\nDuck?” <em>Analysis</em>, 54(2): 92–97.",
                "–––, 2001. <em>Ideal Code, Real World: A\nRule-Consequentialist Theory of Morality</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 2007. “Impartiality, Predictability,\nand Indirect Consequentialism,” in Roger Crisp and Brad Hooker,\neds., <em>Well-Being and Morality: Essays in Honour of James\nGriffin</em>, Oxford: Oxford University Press, pp. 129–42.",
                "–––, 2010. “When is Impartiality Morally\nAppropriate?” in Feltham and Cottingham 2010: 26–41.",
                "–––, 2013. “Egoism, Partiality, and\nImpartiality,” in Roger Crisp, ed., <em>The Oxford Handbook of\nthe History of Ethics</em>, Oxford: Oxford University Press, pp.\n719–28.",
                "Howard-Snyder, Frances, 1993. “Rule Consequentialism Is a\nRubber Duck,” <em>American Philosophical Quarterly</em>, 30:\n271–78.",
                "Hume, David, 1978 [1740]. <em>A Treatise of Human Nature</em>,\nSecond edition, ed. L.A. Selby-Bigge &amp; P.H. Nidditch, Oxford\nUniversity Press.",
                "Hurley, Paul, 2009. <em>Beyond Consequentialism</em>, Oxford:\nOxford University Press.",
                "Jackson Frank, 1991. “Decision-Theoretic Consequentialism\nand the Nearest and Dearest Objection,” <em>Ethics</em>, 101(3):\n461–482. doi:10.1086/293312",
                "Jeske, Diane, and Richard Fumerton, 1997. “Relatives and\nRelativism,” <em>Philosophical Studies</em>, 87:\n143–57.",
                "Jollimore, Troy A., 2000. “Friendship Without\nPartiality?” <em>Ratio</em>, 13(1): 69–82.",
                "–––, 2001. <em>Friendship and Agent-Relative\nMorality</em>, New York: Garland Publishing.",
                "–––, 2011. <em>Love’s Vision</em>,\nPrinceton: Princeton University Press.",
                "Jones, Charles, 1999. <em>Global Justice: Defending\nCosmopolitanism</em>, Oxford: Oxford University Press.",
                "Kagan, Shelley, 1989. <em>The Limits of Morality</em>, Oxford:\nClarendon Press.",
                "Kahane, Guy, 2014. “Evolution and Impartiality,”\n<em>Ethics</em>, 124(2): 327–41.",
                "Kamm, F.M., 1993. <em>Morality, Mortality, Volume I: Death and\nWhom to Save From It</em>, Oxford: Oxford University Press.",
                "–––, 1996. <em>Morality, Mortality, Volume II:\nRights, Duties, and Status</em>, Oxford: Oxford University Press.",
                "–––, 2007. <em>Intricate Ethics</em>, Oxford:\nOxford University Press.",
                "Kant, Immanuel, 1964 [1785]. <em>Groundwork of the Metaphysics of\nMorals</em>, Translated by H.J. Paton, New York: Harper and Row.",
                "Kapur, Neera Badhwar, 1991. “Why It Is Wrong to be Always\nGuided by the Best: Consequentialism and Friendship,”\n<em>Ethics</em>, 101: 483–504.",
                "Kavka, Gregory, 1979. “The Numbers Should Count,”\n<em>Philosophical Studies</em>, 36: 285–294.",
                "Kekes, John, 1981. “Morality and Impartiality,”\n<em>American Philosophical Quarterly</em>, 18: 295–303.",
                "Keller, Simon, 2004. “Friendship and Belief,”\n<em>Philosophical Papers</em>, 33(3): 329–351.",
                "–––, 2013. <em>Partiality</em>, Princeton:\n\nPrinceton University Press.",
                "Kohlberg, Lawrence, 1979. “Justice as Reversibility,”\nin P. Laslett and J. Fishkin, ed., <em>Philosophy, Politics and\nSociety</em>, Series 5, Oxford: Blackwell, pp. 257–72.",
                "Kolodny, Niko, 2010a. “Which Relationships Justify\nPartiality? General Considerations and Problem Cases,” in\nFeltham and Cottingham 2010, pp. 169–193.",
                "–––, 2010b. “Which Relationships Justify\nPartiality? The Case of Parents and Children,” <em>Philosophy\n&amp; Public Affairs</em>, 38: 37–75.",
                "Korsgaard, Christine, 1996. <em>Creating the Kingdom of Ends</em>,\nCambridge: Cambridge University Press.",
                "Larmore, Charles E., 1987. <em>Patterns of Moral Complexity</em>,\nCambridge: Cambridge University Press.",
                "Locke, Don, 1981. “The Principle of Equal Interests,”\n<em>Philosophical Review</em>, 90: 531–59.",
                "Lord, Erroll, 2016. “Justifying Partiality,”\n<em>Ethical Theory and Moral Practice</em>, 19(3): 569–90.",
                "Lovibond, Sabina, 2010. “Impartial Respect and Natural\nInterest,” <em>Philosophical Topics</em>, 38(1):\n143–58.",
                "MacFarquhar, Larissa, 2015. <em>Strangers Drowning: Grappling with\nImpossible Idealism, Drastic Choices, and the Overpowering Urge to\nHelp</em>, New York: Penguin Press.",
                "MacIntyre, Alasdair, 1984. “Is Patriotism a Virtue?”\nUniversity of Kansas: The Lindley Lecture Series.",
                "–––, 1988. <em>Whose Justice? Which\nRationality?</em>, Notre Dame, IN: University of Notre Dame\nPress.",
                "McElwee, Brian, 2011. “Impartial Reasons, Moral\nDemands,” <em>Ethical Theory and Moral Practice</em>, 14:\n457–66.",
                "McMahan, Jeff. 2002. <em>The Ethics of Killing: Problems at the\nMargins of Life</em>, Oxford: Oxford University Press.",
                "McNaughton, David, and Piers Rawling, 1992. “Honoring and\nPromoting Values,” <em>Ethics</em>, 102: 835–43.",
                "–––, 1993. “Deontology and Agency,”\n<em>The Monist</em>, 76: 81–100.",
                "–––, 1998. “On Defending\nDeontology,” <em>Ratio</em>, 11(1): 37–54.",
                "Mendus, Susan, 2002. <em>Impartiality in Moral and Political\nPhilosophy</em>, Oxford: Oxford University Press.",
                "Meyers, Diana Tietjens, 1993. “Moral Reflection: Beyond\nImpartial Reason,” <em>Hypatia</em>, 8(3): 21–47.",
                "Mill, J.S., 1992 [1861]. <em>Utilitarianism</em>, in <em>On\nLiberty and Utilitarianism</em>, Knopf: Everyman’s Library,\nVolume 81.",
                "Miller, Richard W., 1992. <em>Moral Differences</em>, Princeton:\nPrinceton University Press.",
                "Monro, D.H., 1950. “Archbishop Fenelon versus My\nMother,” <em>Australasian Journal of Philosophy</em>, 28(3):\n154–173.",
                "Mulgan, Tim, 2001. <em>The Demands of Consequentialism</em>,\nOxford: Oxford University Press.",
                "–––, 2006. <em>Future People: A Moderate\nConsequentialist Account of Our Obligations to Future\nGenerations.</em> Oxford University Press.",
                "Nagel, Thomas, 1973. “Rawls on Justice,”\n<em>Philosophical Review</em>, 82(2): 220–234; reprinted in\nNorman Daniels, ed., <em>Reading Rawls</em>, Oxford: Blackwell,\n1975.",
                "–––, 1991. <em>Equality and Partiality</em>,\nOxford: Oxford University Press, 1991.",
                "–––, 1986. <em>The View from Nowhere</em>,\nOxford: Oxford University Press.",
                "–––, 1987. “Moral Conflict and Political\nLegitimacy,” <em>Philosophy and Public Affairs</em>, 16(3):\n215–240.",
                "–––, 1991. <em>Equality and Partiality</em>,\nOxford: Oxford University Press.",
                "Newey, Charlotte, 2016. “Fairness as ‘Appropriate\nImpartiality’ and the Problem of Self-Serving Bias,”\n<em>Ethical Theory and Moral Practice</em> 19: 695–709.",
                "Nielsen, Kai. 1972, “A Defense of Utilitarianism,”\n<em>Ethics</em>, 82: 113–24.",
                "–––, 1994. “Justice as a Kind of\nImpartiality,” <em>Laval Theologique et Philosophique</em>,\n50(3): 511–529.",
                "Noddings, Nel, 1984. <em>Caring: A Feminine Approach to Ethics and\nMoral Education</em>, Berkeley: University of California Press.",
                "Norcross, Alastair, 2006a. “The Scalar Approach to\nUtilitarianism,” in H. West, ed., <em>The Blackwell Guide to\nMill’s Utilitarianism</em>, Oxford: Oxford University Press, pp.\n217–32.",
                "–––, 2006b. “Reasons without Demands:\nRethinking Rightness,” in J. Dreier, ed., <em>Contemporary\nDebates in Moral Theory</em>, Oxford University Press, pp.\n38–53.",
                "Oldenquist, Andrew, 1982. “Loyalties,” <em>Journal of\nPhilosophy</em>, 79(4): 173–193.",
                "Okin, Susan Moller, 1989a. <em>Justice, Gender and the\nFamily</em>, New York: Basic Books.",
                "–––, 1989b. “Reason and Feeling in\nThinking About Justice,” <em>Ethics</em>, 99: 229–49.",
                "–––, 1994. “Political Liberalism, Justice,\nand Gender.” <em>Ethics</em>, 105: 23–43.",
                "O’Neill, Shane, 1997. <em>Impartiality in Context</em>,\nAlbany: State University of New York Press.",
                "Otsuka, Michael, 2000. “Scanlon and the Claims of the Many\nVersus the One,” <em>Analysis</em>, 60(3): 288–93.",
                "Parfit, Derek, 1978. “Innumerate Ethics,”\n<em>Philosophy and Public Affairs</em>, 7(4): 285–301.",
                "–––, 2011. <em>On What Matters</em>, Oxford:\nOxford University Press.",
                "Pettit, Philip, 1997. “The Consequentialist\nPerspective,” in Baron, Pettit, and Slote (1997):\n92–174.",
                "–––, 2000. “Non-consequentialism and\nUniversalizability,” <em>The Philosophical Quarterly</em>,\n50(199): 175–90.",
                "–––, 2015. <em>The Robust Demands of the\nGood</em>, Oxford: Oxford University Press.",
                "Pettit, Philip, and Geoffrey Brennan, 1986. “Restrictive\nConsequentialism,” <em>Australasian Journal of Philosophy</em>,\n64(4): 438–55.",
                "Piper, Adrian, 1990. “Higher-Order Discrimination,” in\nFlanagan and Rorty, ed., <em>Identity, Character and Morality: Essays\nin Moral Psychology</em>, Cambridge, MA: The MIT Press, 1990, pp.\n285–309.",
                "–––, 1991. “Impartiality, Compassion, and\nModal Imagination,” <em>Ethics</em>, 101: 726–57.",
                "Powers, Madison, 1993. “Contractualist Impartiality and\nPersonal Commitments,” <em>American Philosophical\nQuarterly</em>, 30(1): 63–71.",
                "Railton, Peter, 1984. “Alienation, Consequentialism, and the\nDemands of Morality,” <em>Philosophy and Public Affairs</em>,\n13: 134–71.",
                "Rawls, John, 1971. <em>A Theory of Justice</em>, Cambridge, MA:\nHarvard University Press.",
                "–––, 1993. <em>Political Liberalism</em>, New\nYork: Columbia University Press.",
                "–––, 1999a. “Fairness to Goodness,”\nin Samuel Freeman, ed., <em>Collected Papers</em>, Cambridge, MA:\nHarvard University Press, pp. 267–85.",
                "–––, 1999b. <em>The Law of Peoples</em>,\nCambridge, MA: Harvard University Press.",
                "–––, 2001. <em>Justice as Fairness: A\nRestatement</em>, Cambridge, MA: Belknap/ Harvard University\nPress.",
                "Raz, Joseph, 1990. “Facing Diversity: The Case of Epistemic\nAbstinence,” <em>Philosophy and Public Affairs</em>, 19(1):\n3–46.",
                "Ridge, Michael, 2010. “Fairness and Non-Compliance,”\nin Feltham and Cottingham 2010: 194–222.",
                "Sandel, Michael, 1982. <em>Liberalism and the Limits of\nJustice</em>, Cambridge: Cambridge University Press.",
                "Scanlon, T.M., 1978. “Rights, Goals, and Fairness,” in\nStuart Hampshire, ed., <em>Public and Private Morality</em>,\nCambridge: Cambridge University Press, pp. 93–111.",
                "–––, 1982. “Contractualism and\nUtilitarianism,” in Sen and Williams, 1982: 103–128.",
                "–––, 1998. <em>What We Owe to Each Other</em>,\nCambridge, MA: Belknap/Harvard University Press.",
                "Scheffler, Samuel, 1982. <em>The Rejection of\nConsequentialism</em>, Oxford: Oxford University Press.",
                "–––, 1985. “Agent-Centred Restrictions,\nRationality, and the Virtues,” <em>Mind</em>, 94:\n409–19.",
                "–––, 1986. “Morality’s Demands and\nTheir Limits,” <em>The Journal of Philosophy</em>, 83:\n531–37.",
                "–––, 1992. <em>Human Morality</em>, Oxford:\nOxford University Press.",
                "–––, 2010. “Morality and Reasonable\nPartiality,” in Feltham and Cottingham 2010: 98–130.",
                "Schwartz, Adina, 1973. “Moral Neutrality and Primary\nGoods,” <em>Ethics</em>, 83: 294–307.",
                "Sen, Amartya. 2002. “Open and Closed Impartiality,”\n<em>The Journal of Philosophy</em>, XCIX(9): 445–469.",
                "Sen, Amartya, and Bernard Williams (eds.), 1982.\n<em>Utilitarianism and Beyond</em>, Cambridge: Cambridge University\nPress.",
                "Sidgwick, Henry, 1907. <em>The Methods of Ethics</em>, Seventh\nEdition. London: Macmillan.",
                "Singer, Peter, 1972. “Famine, Affluence, and\nMorality,” <em>Philosophy and Public Affairs</em>, 1:\n229–43.",
                "–––, 1974, “All Animals are Equal,”\n<em>Philosophic Exchange</em>, 5(1), Article 6.\n [<a href=\"http://hdl.handle.net/20.500.12648/3306\" target=\"other\">Singer 1974 available online</a>]",
                "–––, 2009. <em>The Life You Can Save: Acting Now\nto End World Poverty</em>, New York: Random House.",
                "Singer, Peter, Leslie Cannold, and Helga Kuhse, 1995.\n“William Godwin and the Defense of Impartialist Ethics,”\n<em>Utilitas</em>, 7 (1): 67–86.",
                "Slote, Michael, 1985. <em>Common Sense Morality and\nConsequentialism</em>, Boston: Routledge and Kegan Paul.",
                "–––, 2013. “Empathy and\nObjectivity,” in <em>From Enlightenment to Objectivity:\nRethinking Our Values</em>, Oxford: Oxford University Press, pp.\n33–64.",
                "Smart, J.J.C., 1973. “An Outline of a System of Utilitarian\nEthics,” in Smart and Williams 1973: 1–74.",
                "Smart, J.J.C., and Bernard Williams. 1973. <em>Utilitarianism: For\nand Against</em>, Cambridge: Cambridge University Press.",
                "Smit, Houston, and Mark Timmons. 2017. “Kant’s\nGrounding Project in <em>The Doctrine of Virtue</em>,” in Mark\nTimmons (2017): 175–218.",
                "Smith, Adam, 1976 [1759]. <em>The Theory of Moral Sentiments</em>,\nOxford: Oxford University Press.",
                "Stocker, Michael, 1976. “The Schizophrenia of Modern Ethical\nTheories,” <em>The Journal of Philosophy</em>, 73:\n453–66.",
                "Stroud, Sarah, 2006. “Epistemic Partiality in\nFriendship,” <em>Ethics</em>, 116(3): 498–524.",
                "–––, 2010. “Permissible Projects,\nPartiality, and Plural Agency,” in Feltham and Cottingham 2010:\n131–149.",
                "Taurek, John, 1977. “Should the Numbers Count?”\n<em>Philosophy and Public Affairs</em>, 6: 293–316.",
                "Teitelman, Michael, 1972. “The Limits of\nIndividualism,” <em>Journal of Philosophy</em>, 69:\n545–56.",
                "Thomas, Alan. 2009. “Consequentialism, Integrity, and\nDemandingness,” in Chappell 2009b: 123–47.",
                "Timmons, Mark. 2017. <em>Significance and System: Essays on\nKant’s Ethics</em>, Oxford: Oxford University Press.",
                "Unger, Peter, 1996. <em> Living High and Letting Die: Our Illusion\nof Innocence</em>, Oxford: Oxford University Press.",
                "Walker, Margaret Urban, 1991. “Partial Consideration,”\n<em>Ethics</em>, 101: 758–74.",
                "Wiggins, David, 1978. “Universalizability, Impartiality,\nTruth,” in his <em>Needs, Values, Truth</em>, Oxford: Oxford\nUniversity Press, pp. 59–86.",
                "Williams, Bernard, 1973. “A Critique of\nUtilitarianism,” in Smart and Williams 1973: 75–150.",
                "–––, 1981. “Persons, Character, and\nMorality,” in <em>Moral Luck</em>, New York: Cambridge\nUniversity Press, pp. 1–19.",
                "–––, 1985. <em>Ethics and the Limits of\nPhilosophy</em>, Cambridge, MA: Harvard University Press.",
                "–––, 2008. “The Human Prejudice,” in\n<em>Philosophy as a Humanistic Discipline</em>, Princeton: Princeton\nUniversity Press, pp. 135–52.",
                "Wissenburg, Marcel, 1999. <em>Imperfection and Impartiality: A\nLiberal Theory of Social Justice</em>, London: Taylor and\nFrancis.",
                "Wolf, Susan, 1982. “Moral Saints,” <em>Journal of\nPhilosophy</em>, 89: 419–39. Also in Wolf 2015.",
                "–––, 1992. “Morality and\nPartiality,” <em>Philosophical Perspectives</em>, 6:\n243–259.",
                "–––, 2015. <em>The Variety of Values.</em>\nOxford: Oxford University Press.",
                "Young, Iris Marion, 1987. “Impartiality and the Civic\nPublic: Some Implications of Feminist Critiques of Moral and Political\nTheory,” in Benhabib and Cornell (eds.) 1987: 56–76.",
                "–––, 1990. <em>Justice and the Politics of\nDifference</em>, Princeton: Princeton University Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Archard, David, 1995. “Moral Partiality,” <em>Midwest\nStudies in Philosophy</em>, XX: 129–141.</li>\n<li>Ashford, Elizabeth, 2000. “Utilitarianism, Integrity, and\nPartiality,” <em>The Journal of Philosophy</em>, XCVII(8):\n421–39.</li>\n<li>Baier, Kurt, 1958. <em>The Moral Point of View: A Rational Basis\nof Ethics</em>, Ithaca, NY: Cornell University Press.</li>\n<li>Bales, R. Eugene, 1971. “Act-Utilitarianism: Account of\nRight-Making Characteristics or Decision-Making Procedure?”\n<em>American Philosophical Quarterly</em>, 8(3): 257–65.</li>\n<li>Baron, Marcia, 1991. “Impartiality and Friendship,”\n<em>Ethics</em> 101: 836–57.</li>\n<li>–––, 1995. <em>Kantian Ethics Almost Without\nApology</em>, Ithaca, NY: Cornell University Press.</li>\n<li>Baron, Marcia, Philip Pettit, and Michael Slote, 1997. <em>Three\nMethods of Ethics</em>, Oxford: Blackwell.</li>\n<li>Barry, Brian, 1989. <em>Theories of Justice</em>, Berkeley:\nUniversity of California Press.</li>\n<li>–––, 1995. <em>Justice as Impartiality</em>,\nOxford: Oxford University Press.</li>\n<li>Benhabib, Seyla, 1987. “The Generalized and the Concrete\nOther: The Kohlberg-Gilligan Controversy and Feminist Theory,”\nin Benhabib and Cornell 1987: 77–95.</li>\n<li>Benhabib, Seyla, and Drucilla Cornell (eds.), 1987. <em>Feminism\nas Critique</em>, Cambridge: The Polity Press.</li>\n<li>Beyleveld, Deryck, 2013. “Williams’ False Dilemma: How\nto Give Categorically Impartial Reasons to Real Agents,”\n<em>Journal of Moral Philosophy</em>, 10(2): 204–226.</li>\n<li>Blum, Lawrence, 1980. <em>Friendship, Altruism, and Morality</em>,\nLondon: Routledge and Kegan Paul.</li>\n<li>Brandt, Richard, 1954. “The Definition of an ‘Ideal\nObserver’ in Ethics,” <em>Philosophy and Phenomenological\nResearch</em>, 15: 407–13.</li>\n<li>–––, 1979. <em>A Theory of the Good and the\nRight</em>, Oxford: Oxford University Press.</li>\n<li>Brink, David O., 1989. <em>Moral Realism and the Foundations of\nEthics</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2001. “Impartiality and Associative\nDuties,” <em>Utilitas</em>, 13: 2.</li>\n<li>Broad, C.D., 1959. <em>Five Types of Ethical Theory</em>,\nPaterson, NJ: Littlefield, Adams &amp; Co.</li>\n<li>Buss, Sarah, 2006. “Needs (Someone Else’s), Projects\n(My Own), and Reasons,” <em>The Journal of Philosophy</em>, 103:\n373–402.</li>\n<li>Cannold, Leslie, Peter Singer, Helga Kuhse, and Lori Gruen, 1995.\n“What is the Justice-Care Debate <em>Really</em>, About?”\n<em>Midwest Studies in Philosophy</em>, XX: 357–75.</li>\n<li>Chappell, Timothy, 2009a. “Impartial Benevolence and\nPartial Love,” in Chappell (ed.) 2009b: 70–85.</li>\n<li>Chappell, Timothy (ed.), 2009b. <em>The Problem of Moral\nDemandingness: New Philosophical Essays</em>, New York: Palgrave\nMacmillan.</li>\n<li>Cottingham, John, 1983. “Ethics and Impartiality,”\n<em>Philosophical Studies</em>, 43: 83–99.</li>\n<li>–––, 1986. “Partiality, Favoritism, and\nMorality,” <em>Philosophical Quarterly</em>, 36:\n357–73.</li>\n<li>–––, 1996. “Partiality and the\nVirtues,” in Roger Crisp, ed., <em>How Should One Live? Essays\non the Virtues</em>, Oxford: Clarendon Press, 1996, pp.\n57–76.</li>\n<li>–––, 1996. “Medicine, Virtues, and\nConsequences,” in D. Oderberg and L. Laing, ed., <em>Human\nLives</em>, London: Macmillan, pp. 128–143.</li>\n<li>–––, 2010a. “Impartiality and Ethical\nFormation,” in Feltham and Cottingham 2010, pp.\n65–83.</li>\n<li>–––, 2010b. “Partiality and\nImpartiality,” in John Skorupski, ed., <em>The Routledge\nCompanion to Ethics</em>. New York: Routledge, pp. 617–27.</li>\n<li>Crisp, Roger. 2006. <em>Reasons and the Good.</em> Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 2018. “Against Partiality,”\nUniversity of Kansas: The Lindley Lecture.\n[<a href=\"https://kuscholarworks.ku.edu/bitstream/handle/1808/26747/Crisp_2018_AgainstPartiality.pdf\" target=\"other\">Crisp 2018 available online</a>]</li>\n<li>Cullity, Garrett. 2004. <em>The Moral Demands of Affluence</em>,\nOxford: Oxford University Press.</li>\n<li>Cummiskey, David, 1996. <em>Kantian Consequentialism</em>, Oxford:\nOxford University Press.</li>\n<li>Dancy, Jonathan, 2004. <em>Ethics Without Principles</em>, Oxford:\nOxford University Press.</li>\n<li>Darwall, Stephen L, 1983. <em>Impartial Reason</em>, Ithaca, NY:\nCornell University Press.</li>\n<li>–––, 2010. “Responsibility within\nRelations,” in Feltham and Cottingham 2010: 150–168.</li>\n<li>Deigh, John, 1991. “Impartiality: A Closing Note,”\n<em>Ethics</em> 101: 858–864.</li>\n<li>Diamond, Cora, 1991. “The Importance of Being Human,”\n<em>Royal Institute of Philosophy Supplement</em>, 29:\n35–62.</li>\n<li>–––, 2018. “Bernard Williams on the Human\nPrejudice,” <em>Philosophical Investigations</em>, 41(4):\n379–98.</li>\n<li>Double, Richard, 1999. “Morality, Impartiality, and What We\nCan Ask of Persons,” <em>American Philosophical Quarterly</em>,\n36(2): 149–158.</li>\n<li>Dworkin, Gerald, 1974. “Non-neutral Principles,”\n<em>Journal of Philosophy</em>, 71(14): 491–506.</li>\n<li>Dworkin, Ronald, 1977. <em>Taking Rights Seriously</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Estlund, David, 2010. “I Will If You Will: Leveraged\nEnhancements and Distributive Justice,” in Feltham and\nCottingham 2010: pp. 223–241.</li>\n<li>Feltham, Brian, and John Cottingham, 2010. <em>Partiality and\nImpartiality: Morality, Special Relationships, and the Wider\nWorld</em>, New York: Oxford University Press.</li>\n<li>Firth, Roderick, 1952. “Ethical Absolutism and the Ideal\nObserver,” <em>Philosophy and Phenomenological Research</em>,\n12(3): 317–345.</li>\n<li>Flanagan, Owen, and Jonathan Alder, 1983. “Impartiality and\nParticularity,” <em>Social Research</em>, 3: 576–596.</li>\n<li>Frankfurt, Harry, 1997. “Equality and Respect,”\n<em>Social Research</em>, 64: 3–15; reprinted in <em>Necessity,\nVolition, and Love</em>, Cambridge: Cambridge University Press, 1999,\npp. 146–55.</li>\n<li>Fricker, Miranda, 2007. <em>Epistemic Injustice</em>, Oxford:\nClarendon Pres.</li>\n<li>Friedman, Marilyn, 1989. “The Impracticality of\nImpartiality,” <em>Journal of Philosophy</em>, 86:\n645–56.</li>\n<li>Gaus, Gerald F., 2010, “The Demands of Impartiality and the\nEvolution of Morality,” in Feltham and Cottingham 2010:\n42–64.</li>\n<li>Gauthier, David, 1986. <em>Morals by Agreement</em>, Oxford:\nOxford University Press.</li>\n<li>de Gaynesford, Maximilian, 2010. “The Bishop, the Valet, the\nWife, and the Ass: What Difference Does it Make if Something is\nMine?” in Feltham and Cottingham 2010: 84–97.</li>\n<li>Gert, Bernard, 1998. <em>Morality: Its Nature and\nJustification</em>, Oxford: Oxford University Press.</li>\n<li>–––, 1995. “Moral Impartiality,”\n<em>Midwest Studies in Philosophy</em>, XX: 102–127.</li>\n<li>Gewirth, Alan, 1978. <em>Reason and Morality</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>Gilligan, Carol, 1982. <em>In a Different Voice: Psychological\nTheory and Women’s Development</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>Godwin, William, 1793 [1926]. <em>Enquiry Concerning Political\nJustice and its Influence on General Virtue and Happiness</em>, ed.\nRaymond Preston. New York: Alfred A Knopf.</li>\n<li>–––, 1801 [1968]. <em>Thoughts Occasioned by the\nPerusal of Dr. Parr’s Spital Sermon</em>, in <em>Uncollected\nWritings (1785–1822) by William Godwin</em>, ed. J. Marken and\nB. Pollin, Gainesville, FL: Scholars’ Facsimiles &amp; Reprints,\npp. 314–5.</li>\n<li>Griffin, James, 1986, <em>Well-being</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 1990. Review of Shelly Kagan’s<em> The\nLimits of Morality</em>, <em>Mind</em>, 99: 129–31.</li>\n<li>–––, 1996. <em>Value Judgment</em>, Oxford:\nOxford University Press.</li>\n<li>Hare, R.M., 1981. <em>Moral Thinking</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Harsanyi, John C., 1977. <em>Rational Behavior and Bargaining\nEquilibrium in Games and Social Situations</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>–––, 1982. “Morality and the Theory of\nRational Behavior,” in Sen and Williams, 1982: 39–62.</li>\n<li>Henberg, M.C., 1978. “Impartiality,” <em>Canadian\nJournal of Philosophy</em>, 8(4): 715–724.</li>\n<li>Herman, Barbara, 1993. <em>The Practice of Moral Judgment</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Hooker, Brad, 1994. “Is Rule-Consequentialism a Rubber\nDuck?” <em>Analysis</em>, 54(2): 92–97.</li>\n<li>–––, 2001. <em>Ideal Code, Real World: A\nRule-Consequentialist Theory of Morality</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 2007. “Impartiality, Predictability,\nand Indirect Consequentialism,” in Roger Crisp and Brad Hooker,\neds., <em>Well-Being and Morality: Essays in Honour of James\nGriffin</em>, Oxford: Oxford University Press, pp. 129–42.</li>\n<li>–––, 2010. “When is Impartiality Morally\nAppropriate?” in Feltham and Cottingham 2010: 26–41.</li>\n<li>–––, 2013. “Egoism, Partiality, and\nImpartiality,” in Roger Crisp, ed., <em>The Oxford Handbook of\nthe History of Ethics</em>, Oxford: Oxford University Press, pp.\n719–28.</li>\n<li>Howard-Snyder, Frances, 1993. “Rule Consequentialism Is a\nRubber Duck,” <em>American Philosophical Quarterly</em>, 30:\n271–78.</li>\n<li>Hume, David, 1978 [1740]. <em>A Treatise of Human Nature</em>,\nSecond edition, ed. L.A. Selby-Bigge &amp; P.H. Nidditch, Oxford\nUniversity Press.</li>\n<li>Hurley, Paul, 2009. <em>Beyond Consequentialism</em>, Oxford:\nOxford University Press.</li>\n<li>Jackson Frank, 1991. “Decision-Theoretic Consequentialism\nand the Nearest and Dearest Objection,” <em>Ethics</em>, 101(3):\n461–482. doi:10.1086/293312</li>\n<li>Jeske, Diane, and Richard Fumerton, 1997. “Relatives and\nRelativism,” <em>Philosophical Studies</em>, 87:\n143–57.</li>\n<li>Jollimore, Troy A., 2000. “Friendship Without\nPartiality?” <em>Ratio</em>, 13(1): 69–82.</li>\n<li>–––, 2001. <em>Friendship and Agent-Relative\nMorality</em>, New York: Garland Publishing.</li>\n<li>–––, 2011. <em>Love’s Vision</em>,\nPrinceton: Princeton University Press.</li>\n<li>Jones, Charles, 1999. <em>Global Justice: Defending\nCosmopolitanism</em>, Oxford: Oxford University Press.</li>\n<li>Kagan, Shelley, 1989. <em>The Limits of Morality</em>, Oxford:\nClarendon Press.</li>\n<li>Kahane, Guy, 2014. “Evolution and Impartiality,”\n<em>Ethics</em>, 124(2): 327–41.</li>\n<li>Kamm, F.M., 1993. <em>Morality, Mortality, Volume I: Death and\nWhom to Save From It</em>, Oxford: Oxford University Press.</li>\n<li>–––, 1996. <em>Morality, Mortality, Volume II:\nRights, Duties, and Status</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2007. <em>Intricate Ethics</em>, Oxford:\nOxford University Press.</li>\n<li>Kant, Immanuel, 1964 [1785]. <em>Groundwork of the Metaphysics of\nMorals</em>, Translated by H.J. Paton, New York: Harper and Row.</li>\n<li>Kapur, Neera Badhwar, 1991. “Why It Is Wrong to be Always\nGuided by the Best: Consequentialism and Friendship,”\n<em>Ethics</em>, 101: 483–504.</li>\n<li>Kavka, Gregory, 1979. “The Numbers Should Count,”\n<em>Philosophical Studies</em>, 36: 285–294.</li>\n<li>Kekes, John, 1981. “Morality and Impartiality,”\n<em>American Philosophical Quarterly</em>, 18: 295–303.</li>\n<li>Keller, Simon, 2004. “Friendship and Belief,”\n<em>Philosophical Papers</em>, 33(3): 329–351.</li>\n<li>–––, 2013. <em>Partiality</em>, Princeton:\n\nPrinceton University Press.</li>\n<li>Kohlberg, Lawrence, 1979. “Justice as Reversibility,”\nin P. Laslett and J. Fishkin, ed., <em>Philosophy, Politics and\nSociety</em>, Series 5, Oxford: Blackwell, pp. 257–72.</li>\n<li>Kolodny, Niko, 2010a. “Which Relationships Justify\nPartiality? General Considerations and Problem Cases,” in\nFeltham and Cottingham 2010, pp. 169–193.</li>\n<li>–––, 2010b. “Which Relationships Justify\nPartiality? The Case of Parents and Children,” <em>Philosophy\n&amp; Public Affairs</em>, 38: 37–75.</li>\n<li>Korsgaard, Christine, 1996. <em>Creating the Kingdom of Ends</em>,\nCambridge: Cambridge University Press.</li>\n<li>Larmore, Charles E., 1987. <em>Patterns of Moral Complexity</em>,\nCambridge: Cambridge University Press.</li>\n<li>Locke, Don, 1981. “The Principle of Equal Interests,”\n<em>Philosophical Review</em>, 90: 531–59.</li>\n<li>Lord, Erroll, 2016. “Justifying Partiality,”\n<em>Ethical Theory and Moral Practice</em>, 19(3): 569–90.</li>\n<li>Lovibond, Sabina, 2010. “Impartial Respect and Natural\nInterest,” <em>Philosophical Topics</em>, 38(1):\n143–58.</li>\n<li>MacFarquhar, Larissa, 2015. <em>Strangers Drowning: Grappling with\nImpossible Idealism, Drastic Choices, and the Overpowering Urge to\nHelp</em>, New York: Penguin Press.</li>\n<li>MacIntyre, Alasdair, 1984. “Is Patriotism a Virtue?”\nUniversity of Kansas: The Lindley Lecture Series.</li>\n<li>–––, 1988. <em>Whose Justice? Which\nRationality?</em>, Notre Dame, IN: University of Notre Dame\nPress.</li>\n<li>McElwee, Brian, 2011. “Impartial Reasons, Moral\nDemands,” <em>Ethical Theory and Moral Practice</em>, 14:\n457–66.</li>\n<li>McMahan, Jeff. 2002. <em>The Ethics of Killing: Problems at the\nMargins of Life</em>, Oxford: Oxford University Press.</li>\n<li>McNaughton, David, and Piers Rawling, 1992. “Honoring and\nPromoting Values,” <em>Ethics</em>, 102: 835–43.</li>\n<li>–––, 1993. “Deontology and Agency,”\n<em>The Monist</em>, 76: 81–100.</li>\n<li>–––, 1998. “On Defending\nDeontology,” <em>Ratio</em>, 11(1): 37–54.</li>\n<li>Mendus, Susan, 2002. <em>Impartiality in Moral and Political\nPhilosophy</em>, Oxford: Oxford University Press.</li>\n<li>Meyers, Diana Tietjens, 1993. “Moral Reflection: Beyond\nImpartial Reason,” <em>Hypatia</em>, 8(3): 21–47.</li>\n<li>Mill, J.S., 1992 [1861]. <em>Utilitarianism</em>, in <em>On\nLiberty and Utilitarianism</em>, Knopf: Everyman’s Library,\nVolume 81.</li>\n<li>Miller, Richard W., 1992. <em>Moral Differences</em>, Princeton:\nPrinceton University Press.</li>\n<li>Monro, D.H., 1950. “Archbishop Fenelon versus My\nMother,” <em>Australasian Journal of Philosophy</em>, 28(3):\n154–173.</li>\n<li>Mulgan, Tim, 2001. <em>The Demands of Consequentialism</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 2006. <em>Future People: A Moderate\nConsequentialist Account of Our Obligations to Future\nGenerations.</em> Oxford University Press.</li>\n<li>Nagel, Thomas, 1973. “Rawls on Justice,”\n<em>Philosophical Review</em>, 82(2): 220–234; reprinted in\nNorman Daniels, ed., <em>Reading Rawls</em>, Oxford: Blackwell,\n1975.</li>\n<li>–––, 1991. <em>Equality and Partiality</em>,\nOxford: Oxford University Press, 1991.</li>\n<li>–––, 1986. <em>The View from Nowhere</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 1987. “Moral Conflict and Political\nLegitimacy,” <em>Philosophy and Public Affairs</em>, 16(3):\n215–240.</li>\n<li>–––, 1991. <em>Equality and Partiality</em>,\nOxford: Oxford University Press.</li>\n<li>Newey, Charlotte, 2016. “Fairness as ‘Appropriate\nImpartiality’ and the Problem of Self-Serving Bias,”\n<em>Ethical Theory and Moral Practice</em> 19: 695–709.</li>\n<li>Nielsen, Kai. 1972, “A Defense of Utilitarianism,”\n<em>Ethics</em>, 82: 113–24.</li>\n<li>–––, 1994. “Justice as a Kind of\nImpartiality,” <em>Laval Theologique et Philosophique</em>,\n50(3): 511–529.</li>\n<li>Noddings, Nel, 1984. <em>Caring: A Feminine Approach to Ethics and\nMoral Education</em>, Berkeley: University of California Press.</li>\n<li>Norcross, Alastair, 2006a. “The Scalar Approach to\nUtilitarianism,” in H. West, ed., <em>The Blackwell Guide to\nMill’s Utilitarianism</em>, Oxford: Oxford University Press, pp.\n217–32.</li>\n<li>–––, 2006b. “Reasons without Demands:\nRethinking Rightness,” in J. Dreier, ed., <em>Contemporary\nDebates in Moral Theory</em>, Oxford University Press, pp.\n38–53.</li>\n<li>Oldenquist, Andrew, 1982. “Loyalties,” <em>Journal of\nPhilosophy</em>, 79(4): 173–193.</li>\n<li>Okin, Susan Moller, 1989a. <em>Justice, Gender and the\nFamily</em>, New York: Basic Books.</li>\n<li>–––, 1989b. “Reason and Feeling in\nThinking About Justice,” <em>Ethics</em>, 99: 229–49.</li>\n<li>–––, 1994. “Political Liberalism, Justice,\nand Gender.” <em>Ethics</em>, 105: 23–43.</li>\n<li>O’Neill, Shane, 1997. <em>Impartiality in Context</em>,\nAlbany: State University of New York Press.</li>\n<li>Otsuka, Michael, 2000. “Scanlon and the Claims of the Many\nVersus the One,” <em>Analysis</em>, 60(3): 288–93.</li>\n<li>Parfit, Derek, 1978. “Innumerate Ethics,”\n<em>Philosophy and Public Affairs</em>, 7(4): 285–301.</li>\n<li>–––, 2011. <em>On What Matters</em>, Oxford:\nOxford University Press.</li>\n<li>Pettit, Philip, 1997. “The Consequentialist\nPerspective,” in Baron, Pettit, and Slote (1997):\n92–174.</li>\n<li>–––, 2000. “Non-consequentialism and\nUniversalizability,” <em>The Philosophical Quarterly</em>,\n50(199): 175–90.</li>\n<li>–––, 2015. <em>The Robust Demands of the\nGood</em>, Oxford: Oxford University Press.</li>\n<li>Pettit, Philip, and Geoffrey Brennan, 1986. “Restrictive\nConsequentialism,” <em>Australasian Journal of Philosophy</em>,\n64(4): 438–55.</li>\n<li>Piper, Adrian, 1990. “Higher-Order Discrimination,” in\nFlanagan and Rorty, ed., <em>Identity, Character and Morality: Essays\nin Moral Psychology</em>, Cambridge, MA: The MIT Press, 1990, pp.\n285–309.</li>\n<li>–––, 1991. “Impartiality, Compassion, and\nModal Imagination,” <em>Ethics</em>, 101: 726–57.</li>\n<li>Powers, Madison, 1993. “Contractualist Impartiality and\nPersonal Commitments,” <em>American Philosophical\nQuarterly</em>, 30(1): 63–71.</li>\n<li>Railton, Peter, 1984. “Alienation, Consequentialism, and the\nDemands of Morality,” <em>Philosophy and Public Affairs</em>,\n13: 134–71.</li>\n<li>Rawls, John, 1971. <em>A Theory of Justice</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>–––, 1993. <em>Political Liberalism</em>, New\nYork: Columbia University Press.</li>\n<li>–––, 1999a. “Fairness to Goodness,”\nin Samuel Freeman, ed., <em>Collected Papers</em>, Cambridge, MA:\nHarvard University Press, pp. 267–85.</li>\n<li>–––, 1999b. <em>The Law of Peoples</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 2001. <em>Justice as Fairness: A\nRestatement</em>, Cambridge, MA: Belknap/ Harvard University\nPress.</li>\n<li>Raz, Joseph, 1990. “Facing Diversity: The Case of Epistemic\nAbstinence,” <em>Philosophy and Public Affairs</em>, 19(1):\n3–46.</li>\n<li>Ridge, Michael, 2010. “Fairness and Non-Compliance,”\nin Feltham and Cottingham 2010: 194–222.</li>\n<li>Sandel, Michael, 1982. <em>Liberalism and the Limits of\nJustice</em>, Cambridge: Cambridge University Press.</li>\n<li>Scanlon, T.M., 1978. “Rights, Goals, and Fairness,” in\nStuart Hampshire, ed., <em>Public and Private Morality</em>,\nCambridge: Cambridge University Press, pp. 93–111.</li>\n<li>–––, 1982. “Contractualism and\nUtilitarianism,” in Sen and Williams, 1982: 103–128.</li>\n<li>–––, 1998. <em>What We Owe to Each Other</em>,\nCambridge, MA: Belknap/Harvard University Press.</li>\n<li>Scheffler, Samuel, 1982. <em>The Rejection of\nConsequentialism</em>, Oxford: Oxford University Press.</li>\n<li>–––, 1985. “Agent-Centred Restrictions,\nRationality, and the Virtues,” <em>Mind</em>, 94:\n409–19.</li>\n<li>–––, 1986. “Morality’s Demands and\nTheir Limits,” <em>The Journal of Philosophy</em>, 83:\n531–37.</li>\n<li>–––, 1992. <em>Human Morality</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2010. “Morality and Reasonable\nPartiality,” in Feltham and Cottingham 2010: 98–130.</li>\n<li>Schwartz, Adina, 1973. “Moral Neutrality and Primary\nGoods,” <em>Ethics</em>, 83: 294–307.</li>\n<li>Sen, Amartya. 2002. “Open and Closed Impartiality,”\n<em>The Journal of Philosophy</em>, XCIX(9): 445–469.</li>\n<li>Sen, Amartya, and Bernard Williams (eds.), 1982.\n<em>Utilitarianism and Beyond</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Sidgwick, Henry, 1907. <em>The Methods of Ethics</em>, Seventh\nEdition. London: Macmillan.</li>\n<li>Singer, Peter, 1972. “Famine, Affluence, and\nMorality,” <em>Philosophy and Public Affairs</em>, 1:\n229–43.</li>\n<li>–––, 1974, “All Animals are Equal,”\n<em>Philosophic Exchange</em>, 5(1), Article 6.\n [<a href=\"http://hdl.handle.net/20.500.12648/3306\" target=\"other\">Singer 1974 available online</a>]</li>\n<li>–––, 2009. <em>The Life You Can Save: Acting Now\nto End World Poverty</em>, New York: Random House.</li>\n<li>Singer, Peter, Leslie Cannold, and Helga Kuhse, 1995.\n“William Godwin and the Defense of Impartialist Ethics,”\n<em>Utilitas</em>, 7 (1): 67–86.</li>\n<li>Slote, Michael, 1985. <em>Common Sense Morality and\nConsequentialism</em>, Boston: Routledge and Kegan Paul.</li>\n<li>–––, 2013. “Empathy and\nObjectivity,” in <em>From Enlightenment to Objectivity:\nRethinking Our Values</em>, Oxford: Oxford University Press, pp.\n33–64.</li>\n<li>Smart, J.J.C., 1973. “An Outline of a System of Utilitarian\nEthics,” in Smart and Williams 1973: 1–74.</li>\n<li>Smart, J.J.C., and Bernard Williams. 1973. <em>Utilitarianism: For\nand Against</em>, Cambridge: Cambridge University Press.</li>\n<li>Smit, Houston, and Mark Timmons. 2017. “Kant’s\nGrounding Project in <em>The Doctrine of Virtue</em>,” in Mark\nTimmons (2017): 175–218.</li>\n<li>Smith, Adam, 1976 [1759]. <em>The Theory of Moral Sentiments</em>,\nOxford: Oxford University Press.</li>\n<li>Stocker, Michael, 1976. “The Schizophrenia of Modern Ethical\nTheories,” <em>The Journal of Philosophy</em>, 73:\n453–66.</li>\n<li>Stroud, Sarah, 2006. “Epistemic Partiality in\nFriendship,” <em>Ethics</em>, 116(3): 498–524.</li>\n<li>–––, 2010. “Permissible Projects,\nPartiality, and Plural Agency,” in Feltham and Cottingham 2010:\n131–149.</li>\n<li>Taurek, John, 1977. “Should the Numbers Count?”\n<em>Philosophy and Public Affairs</em>, 6: 293–316.</li>\n<li>Teitelman, Michael, 1972. “The Limits of\nIndividualism,” <em>Journal of Philosophy</em>, 69:\n545–56.</li>\n<li>Thomas, Alan. 2009. “Consequentialism, Integrity, and\nDemandingness,” in Chappell 2009b: 123–47.</li>\n<li>Timmons, Mark. 2017. <em>Significance and System: Essays on\nKant’s Ethics</em>, Oxford: Oxford University Press.</li>\n<li>Unger, Peter, 1996. <em> Living High and Letting Die: Our Illusion\nof Innocence</em>, Oxford: Oxford University Press.</li>\n<li>Walker, Margaret Urban, 1991. “Partial Consideration,”\n<em>Ethics</em>, 101: 758–74.</li>\n<li>Wiggins, David, 1978. “Universalizability, Impartiality,\nTruth,” in his <em>Needs, Values, Truth</em>, Oxford: Oxford\nUniversity Press, pp. 59–86.</li>\n<li>Williams, Bernard, 1973. “A Critique of\nUtilitarianism,” in Smart and Williams 1973: 75–150.</li>\n<li>–––, 1981. “Persons, Character, and\nMorality,” in <em>Moral Luck</em>, New York: Cambridge\nUniversity Press, pp. 1–19.</li>\n<li>–––, 1985. <em>Ethics and the Limits of\nPhilosophy</em>, Cambridge, MA: Harvard University Press.</li>\n<li>–––, 2008. “The Human Prejudice,” in\n<em>Philosophy as a Humanistic Discipline</em>, Princeton: Princeton\nUniversity Press, pp. 135–52.</li>\n<li>Wissenburg, Marcel, 1999. <em>Imperfection and Impartiality: A\nLiberal Theory of Social Justice</em>, London: Taylor and\nFrancis.</li>\n<li>Wolf, Susan, 1982. “Moral Saints,” <em>Journal of\nPhilosophy</em>, 89: 419–39. Also in Wolf 2015.</li>\n<li>–––, 1992. “Morality and\nPartiality,” <em>Philosophical Perspectives</em>, 6:\n243–259.</li>\n<li>–––, 2015. <em>The Variety of Values.</em>\nOxford: Oxford University Press.</li>\n<li>Young, Iris Marion, 1987. “Impartiality and the Civic\nPublic: Some Implications of Feminist Critiques of Moral and Political\nTheory,” in Benhabib and Cornell (eds.) 1987: 56–76.</li>\n<li>–––, 1990. <em>Justice and the Politics of\nDifference</em>, Princeton: Princeton University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "animals, moral status of",
            "bias, implicit",
            "Chinese Philosophy: ethics",
            "Chinese Philosophy: Mohism",
            "consequentialism",
            "egalitarianism",
            "equality",
            "ethics: deontological",
            "friendship",
            "Godwin, William",
            "justice: global",
            "justice: international distributive",
            "justification, political: public",
            "Kant, Immanuel: moral philosophy",
            "Mill, John Stuart",
            "obligations: special",
            "original position"
        ],
        "entry_link": [
            {
                "../moral-animal/": "animals, moral status of"
            },
            {
                "../implicit-bias/": "bias, implicit"
            },
            {
                "../ethics-chinese/": "Chinese Philosophy: ethics"
            },
            {
                "../mohism/": "Chinese Philosophy: Mohism"
            },
            {
                "../consequentialism/": "consequentialism"
            },
            {
                "../egalitarianism/": "egalitarianism"
            },
            {
                "../equality/": "equality"
            },
            {
                "../ethics-deontological/": "ethics: deontological"
            },
            {
                "../friendship/": "friendship"
            },
            {
                "../godwin/": "Godwin, William"
            },
            {
                "../justice-global/": "justice: global"
            },
            {
                "../international-justice/": "justice: international distributive"
            },
            {
                "../justification-public/": "justification, political: public"
            },
            {
                "../kant-moral/": "Kant, Immanuel: moral philosophy"
            },
            {
                "../mill/": "Mill, John Stuart"
            },
            {
                "../special-obligations/": "obligations: special"
            },
            {
                "../original-position/": "original position"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=impartiality\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/impartiality/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=impartiality&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/impartiality/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=impartiality": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/impartiality/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=impartiality&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/impartiality/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://files.libertyfund.org/files/90/0164-01_Bk.pdf\" target=\"other\">William Godwin: Enquiry Concerning Political Justice (Liberty Fund)</a>",
            "<a href=\"http://www.hkbu.edu.hk/~ppp/Kant.html\" target=\"other\">Kant on the Web</a>",
            "<a href=\"http://www.utilitarianism.com/jsmill.htm\" target=\"other\">Utilitarianism.com: John Stuart Mill</a>"
        ],
        "listed_links": [
            {
                "http://files.libertyfund.org/files/90/0164-01_Bk.pdf": "William Godwin: Enquiry Concerning Political Justice (Liberty Fund)"
            },
            {
                "http://www.hkbu.edu.hk/~ppp/Kant.html": "Kant on the Web"
            },
            {
                "http://www.utilitarianism.com/jsmill.htm": "Utilitarianism.com: John Stuart Mill"
            }
        ]
    }
}