{
    "url": "intentionality",
    "title": "Intentionality",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Pierre Jacob\n<jacobpiotr11@gmail.com>",
        "author_links": [
            {
                "http://www.institutnicod.org/membres/membres-permanents/jacob-pierre/?lang=en": "Pierre Jacob"
            },
            {
                "mailto:jacobpiotr11%40gmail%2ecom": "jacobpiotr11@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\n<a href=\"http://www.institutnicod.org/membres/membres-permanents/jacob-pierre/?lang=en\" target=\"other\">Pierre Jacob</a>\n&lt;<a href=\"mailto:jacobpiotr11%40gmail%2ecom\"><em>jacobpiotr11<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Aug 7, 2003",
        "substantive revision Tue Feb 7, 2023"
    ],
    "preamble": "\n\nIn philosophy, intentionality is the power of minds and mental states\nto be about, to represent, or to stand for, things, properties and\nstates of affairs. To say of an individual’s mental states that\nthey have intentionality is to say that they are mental\nrepresentations or that they have contents. Furthermore, to the extent\nthat a speaker utters words from some natural language or draws\npictures or symbols from a formal language for the purpose of\nconveying to others the contents of her mental states, these artifacts\nused by a speaker too have contents or intentionality.\n‘Intentionality’ is a philosopher’s word: ever since\nthe idea, if not the word itself, was introduced into philosophy by\nFranz Brentano in the last quarter of the nineteenth century, it has\nbeen used to refer to the puzzles of representation, all of which lie\nat the interface between the philosophy of mind and the philosophy of\nlanguage. A picture of a dog, a proper name (e.g.,\n‘Fido’), the common noun ‘dog’ or the concept\nexpressed by the word can mean, represent, or stand for, one or\nseveral hairy barking creatures. A complete thought, a full sentence\nor a picture can stand for or describe a state of affairs. How could\nsome of the represented things (e.g., dinosaurs) be arbitrarily remote\nin space and time from the representation (e.g., a human thought or\nutterance about dinosaurs tokened in 2018), while others (e.g.,\nnumbers) may not even be in space and time at all? How could some\nrepresentations (e.g., direct quotations such as\n‘dinosaur’) even stand for themselves? How does a complex\nrepresentation (e.g., a complete thought or a full sentence) inherit\nits meaning or content from the meanings or contents of its\nconstituents? How should one construe the relationship between the\niconic content of pictorial representations and the conceptual content\nof proposition-like representations (thoughts and utterances)? How\nshould one understand the relation between the content of an\nindividual’s mental state and the meanings of external symbols\nused by the individual to express her internal mental states? Are\nrepresentations of the world part of the world they represent? Do all\nof an individual’s mental states have intentionality or only\nsome of them? The entry falls into ten sections: \n",
    "toc": [
        {
            "#WhyInteSoCall": "1. Why is intentionality so-called?"
        },
        {
            "#InteInex": "2. Intentional inexistence"
        },
        {
            "#RelaNatuSingThou": "3. The relational nature of singular thoughts"
        },
        {
            "#HowDistBeliAbouOneSameObje": "4. How can distinct beliefs be about one and the same object?"
        },
        {
            "#TrueNegaExisBeli": "5. True negative existential beliefs"
        },
        {
            "#DireRefe": "6. Direct reference"
        },
        {
            "#TherInteObje": "7. Are there intentional objects?"
        },
        {
            "#InteCritInte": "8. Is intensionality a criterion of intentionality?"
        },
        {
            "#InteNatu": "9. Can intentionality be naturalized?"
        },
        {
            "#InteExhiAllMentPhen": "10. Is intentionality exhibited by all mental phenomena?"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Why is intentionality so-called?\n\nContemporary discussions of the nature of intentionality are an\nintegral part of discussions of the nature of minds: what are minds\nand what is it to have a mind? They arise in the context of\nontological and metaphysical questions about the fundamental nature of\nmental states: states such as perceiving, remembering, believing,\ndesiring, hoping, knowing, intending, feeling, experiencing, and so\non. What is it to have such mental states? How does the mental relate\nto the physical, i.e., how are mental states related to an\nindividual’s body, to states of his or her brain, to his or her\nbehavior and to states of affairs in the world?\n\nWhy is intentionality so-called? For reasons soon to be explained, in\nits philosophical usage, the meaning of the word\n‘intentionality’ should not be confused with the ordinary\nmeaning of the word ‘intention.’ As indicated by the\nmeaning of the Latin word tendere, which is the etymology of\n‘intentionality,’ the relevant idea behind intentionality\nis that of mental directedness towards (or attending to) objects, as\nif the mind were construed as a mental bow whose arrows could be\nproperly aimed at different targets. In medieval logic and philosophy,\nthe Latin word intentio was used for what contemporary\nphilosophers and logicians nowadays call a ‘concept’ or an\n‘intension’: something that can be both true of non-mental\nthings and properties—things and properties lying outside the\nmind—and present to the mind. On the assumption that a concept\nis itself something mental, an intentio may also be true of\nmental things. For example, the concept of a dog, which is a\nfirst-level intentio, applies to individual dogs or to the\nproperty of being a dog. It also falls under various higher-level\nconcepts that apply to it, such as being a concept, being mental, etc.\nIf so, then while the first-level concept is true of non-mental\nthings, the higher-level concepts may be true of something mental.\nNotice that on this way of thinking, concepts that are true of mental\nthings are presumably logically more complex than concepts that are\ntrue of non-mental things.\n\nAlthough the meaning of the word ‘intentionality’ in\ncontemporary philosophy is related to the meanings of such words as\n‘intension’ (or ‘intensionality’ with an\ns) and ‘intention,’ nonetheless it ought not to\nbe confused with either of them. On the one hand, in contemporary\nEnglish, ‘intensional’ and ‘intensionality’\nmean ‘non-extensional’ and\n‘non-extensionality,’ where both extensionality and\nintensionality are logical features of words and sentences. For\nexample, ‘creature with a heart’ and ‘creature with\na kidney’ have the same extension because they are true of the\nsame individuals: all the creatures with a kidney are creatures with a\nheart. But the two expressions have different intensions because the\nword ‘heart’ does not have the same extension, let alone\nthe same meaning, as the word ‘kidney.’ On the other hand,\nintention and intending are specific states of mind that, unlike\nbeliefs, judgments, hopes, desires or fears, play a distinctive role\nin the etiology of actions. By contrast, intentionality is a pervasive\nfeature of many different mental states: beliefs, hopes, judgments,\nintentions, love and hatred all exhibit intentionality. In fact,\nBrentano held that intentionality is the hallmark of the mental: much\nof twentieth century philosophy of mind has been shaped by what, in\nthis entry, will be referred to as “Brentano’s third\nthesis.”\n\nFurthermore, it is worthwhile to distinguish between levels of\nintentionality. Many of an individual’s psychological states\nwith intentionality (e.g., beliefs) are about (or represent)\nnon-mental things, properties and states of affairs. Many are also\nabout another’s psychological states (e.g., another’s\nbeliefs). Beliefs about others’ beliefs display what is known as\n‘higher-order intentionality.’ Since the seminal (1978)\npaper by primatologists David Premack and Guy Woodruff entitled\n“Does the chimpanzee have a theory of mind?”, under the\nheading ‘theory of mind,’ much empirical research of the\npast thirty years has been devoted to the psychological questions\nwhether non-human primates can ascribe psychological states with\nintentionality to others and how human children develop their capacity\nto ascribe to others psychological states with intentionality (cf. the\ncomments by philosophers Jonathan Bennett, Daniel Dennett and Gilbert\nHarman to Premack and Woodruff’s paper and the SEP entry\n folk psychology: as a theory).\n\nThe concept of intentionality has played a central role both in the\ntradition of analytic philosophy and in the phenomenological\ntradition. As we shall see, some philosophers go so far as claiming\nthat intentionality is characteristic of all mental states.\nBrentano’s characterization of intentionality is quite complex.\nAt the heart of it is Brentano’s notion of the\n‘intentional inexistence of an object,’ which is analyzed\nin the next section.\n2. Intentional inexistence\n\nContemporary discussions of the nature of intentionality were launched\nand many of them were anticipated by Franz Brentano (1874,\n88–89) in his book, Psychology From an Empirical\nStandpoint, from which I quote two famous paragraphs:\n\nEvery mental phenomenon is characterized by what the Scholastics of\nthe Middle Ages called the intentional (or mental) inexistence of an\nobject, and what we might call, though not wholly unambiguously,\nreference to a content, direction toward an object (which is not to be\nunderstood here as meaning a thing), or immanent objectivity. Every\nmental phenomenon includes something as object within itself, although\nthey do not do so in the same way. In presentation, something is\npresented, in judgment something is affirmed or denied, in love loved,\nin hate hated, in desire desired and so on.\n\n\nThis intentional inexistence is characteristic exclusively of mental\nphenomena. No physical phenomenon exhibits anything like it. We can,\ntherefore, define mental phenomena by saying that they are those\nphenomena which contain an object intentionally within themselves.\n\n\nAs one reads these lines, numerous questions arise: what does Brentano\nmean when he says that the object towards which the mind directs\nitself ‘is not to be understood as meaning a thing’? What\ncan it be for a phenomenon (mental or otherwise) to exhibit ‘the\nintentional inexistence of an object’? What is it for a\nphenomenon to ‘include something as object within itself’?\nDo ‘reference to a content’ and ‘direction toward an\nobject’ express two distinct ideas? Or are they two distinct\nways of expressing one and the same idea? If intentionality can relate\na mind to something that either does not exist or exists wholly within\nthe mind, what sort of relation can it be?\n\nReplete as they are with complex, abstract and controversial ideas,\nthese two short paragraphs have set the agenda for all subsequent\nphilosophical discussions of intentionality in the late nineteenth and\nthe twentieth century. There has been some discussion over the meaning\nof Brentano’s expression ‘intentional inexistence.’\nDid Brentano mean that the objects onto which the mind is directed are\ninternal to the mind itself (in-exist in the mind)?\nOr did he mean that the mind can be directed onto\nnon-existent objects? Or did he mean both? (See Crane, 1998\nfor further discussion.)\n\nSome of the leading ideas of the phenomenological tradition can be\ntraced back to this issue. Following the lead of Edmund Husserl (1900,\n1913), who was both the founder of phenomenology and a student of\nBrentano’s, the point of the phenomenological analysis has been\nto show that the essential property of intentionality of being\ndirected onto something is not contingent upon whether some\nreal physical target exists independently of the intentional act\nitself. To achieve this goal, two concepts have been central to\nHusserl’s internalist interpretation of intentionality: the\nconcept of a noema (plural noemata) and the concept\nof epoche (i.e., bracketing) or phenomenological reduction.\nBy the word ‘noema,’ Husserl refers to the internal\nstructure of mental acts. The phenomenological reduction is meant to\nhelp get at the essence of mental acts by suspending all naive\npresuppositions about the difference between real and fictitious\nentities (on these complex phenomenological concepts, see the papers\nby Føllesdal and others conveniently gathered in Dreyfus\n(1982). For further discussion, see Bell (1990) and Dummett\n(1993).\n\nIn the two paragraphs quoted above, Brentano sketches an entire\nresearch programme based on three distinct theses. According to the\nfirst thesis, it is constitutive of the phenomenon of intentionality,\nas it is exhibited by mental states such as loving, hating, desiring,\nbelieving, judging, perceiving, hoping and many others, that these\nmental states are directed towards things different from themselves.\nAccording to the second thesis, it is characteristic of the objects\ntowards which the mind is directed by virtue of intentionality that\nthey have the property which Brentano calls intentional inexistence.\nAccording to the third thesis, intentionality is the mark of the\nmental: all and only mental states exhibit intentionality.\n\nUnlike Brentano’s third thesis, Brentano’s first two\ntheses can hardly be divorced from each other. The first thesis can\neasily be recast so as to be unacceptable unless the second thesis is\naccepted. Suppose that it is constitutive of the nature of\nintentionality that one could not exemplify such mental states as\nloving, hating, desiring, believing, judging, perceiving, hoping, and\nso on, unless there was something to be loved, hated,\ndesired, believed, judged, perceived, hoped, and so on. If so, then it\nfollows from the very nature of intentionality (as described by the\nfirst thesis) that nothing could exhibit intentionality unless there\nwere objects—intentional objects—that satisfied\nthe property Brentano called intentional inexistence.\n\nNow, the full acceptance of Brentano’s first two theses raises a\nfundamental ontological question in philosophical logic. The question\nis: are there such intentional objects? Does due recognition of\nintentionality force us to postulate the ontological category of\nintentional objects? This question has given rise to a major division\nwithin analytic philosophy. The prevailing (or orthodox) response has\nbeen a resounding ‘No.’ But an important minority of\nphilosophers, whom I shall call ‘the intentional-object’\ntheorists, have argued for a positive response to the question. Since\nintentional objects need not exist, according to intentional-object\ntheorists, there are things that do not exist. According to their\ncritics, there are no such things.\n\nWe shall directly examine the intentional-object theorists approach in\nsection 7. Before doing so, in section 3, we shall examine the way\nsingular thoughts about concrete particulars in space and time can be\nand have been construed as paradigms of genuine intentional relations.\nOn this relational construal, an individual’s ordinary singular\nthought about a concrete physical particular involves a genuine\nrelation between the individual’s mind and the concrete physical\nparticular. In sections 4–5, we shall examine two puzzles that\nfurther arise on the orthodox paradigm. First, we shall deal with the\npuzzle of how a rational person can believe of an object referred to\nby one singular term that it instantiates a property and\nsimultaneously disbelieve of the same object referred to by a distinct\nsingular term that it instantiates the same property. Section 4 is\ndevoted to Frege’s solution to this puzzle. In section 5, we\nshall scrutinize Russell’s solution to the puzzle of true\nnegative existential statements. In section 6, we shall see how the\ntheory of direct reference emerged within the orthodox paradigm out of\na critique of both Frege’s notion of sense and Russell’s\nassumption that most proper names in natural languages are disguised\ndefinite descriptions.\n3. The relational nature of singular thoughts\n\nMany non-intentional relations hold of concrete particulars in space\nand time. If and when they do, their relata cannot fail to exist. If\nCleopatra kisses Caesar, then both Cleopatra and Caesar must exist.\nNot so with intentional relations. If Cleopatra loves Caesar, then\npresumably there is some concrete particular in space and time whom\nCleopatra loves. But one may also love Anna Karenina (not a concrete\nparticular in space and time, but a fictitious character). Similarly,\nthe relata of the admiration relation (another intentional relation)\nare not limited to concrete particulars in space and time. One may\nadmire not only Albert Einstein but also Sherlock Holmes (a fictitious\ncharacter). As the following passage from the Appendix to the 1911\nedition of his 1874 book testifies, this asymmetry between\nnon-intentional and intentional relations puzzled Brentano:\n\nWhat is characteristic of every mental activity is, as I believe I\nhave shown, the reference to something as an object. In this respect,\nevery mental activity seems to be something relational. […] In\nother relations both terms—both the fundament and the\nterminus—are real, but here only the first term—the\nfundament is real. […] If I take something relative […]\nsomething larger or smaller for example, then, if the larger thing\nexists, the smaller one exists too. […] Something like what is\ntrue of relations of similarity and difference holds true for\nrelations of cause and effect. For there to be such a relation, both\nthe thing that causes and the thing that is caused must exist.\n[…] It is entirely different with mental reference. If someone\nthinks of something, the one who is thinking must certainly exist, but\nthe object of his thinking need not exist at all. In fact, if he is\ndenying something, the existence of the object is precisely what is\nexcluded whenever his denial is correct. So the only thing which is\nrequired by mental reference is the person thinking. The terminus of\nthe so-called relation does not need to exist in reality at all. For\nthis reason, one could doubt whether we really are dealing with\nsomething relational here, and not, rather, with something somewhat\nsimilar to something relational in a certain respect, which might,\ntherefore, better be called “quasi-relational.”\n\n\nWhile the orthodox paradigm is clearly consistent with the possibility\nthat general thoughts may involve abstract objects (e.g., numbers) and\nabstract properties and relations, none of which are in space and\ntime, special problems arise with respect to singular thoughts\nconstrued as intentional relations to non-existent or fictitious\nobjects. Two related assumptions lie at the core of the orthodox\nparadigm. One is the assumption that the mystery of the intentional\nrelation should be elucidated against the background of\nnon-intentional relations. The other is the assumption that\nintentional relations which seem to involve non-existent (e.g.,\nfictitious) entities should be clarified by reference to intentional\nrelations involving particulars existing in space and time.\n\nThe paradigm of the intentional relation that satisfies the orthodox\npicture is the intentionality of what can be called singular\nthoughts, namely those true thoughts that are directed towards\nconcrete individuals or particulars that exist in space and time. A\nsingular thought is such that it would not be available—it could\nnot be entertained—unless the concrete individual that is the\ntarget of the thought existed. Unlike the propositional contents of\ngeneral thoughts that involve only abstract universals such\nas properties and/or relations, the propositional content of a\nsingular thought may involve in addition a relation to a concrete\nindividual or particular. The contrast between ‘singular’\nand ‘general’ propositions has been much emphasized by\nKaplan (1978, 1989). In a slightly different perspective, Tyler Burge\n(1977) has characterized singular thoughts as incompletely\nconceptualized or de re thoughts whose relation to the\nobjects they are about is supplied by the context. On some views, the\nobject of the singular thought is even part of it. On the\northodox view, part of the importance of true singular thoughts for a\nclarification of intentionality lies in the fact that some true\nsingular thoughts are about concrete perceptible objects. Singular\nthoughts about concrete perceptible objects may seem simpler and more\nprimitive than either general ones or thoughts about abstract\nentities.\n\nConsider, for example, what must be the case for belief-ascription (1)\nto be true:\n\nAva believes that Lionel Jospin is a Socialist.\n\n\nIntuitively, the belief ascribed to Ava by (1) has intentionality in\nthe sense that it is of or about Lionel Jospin and\nthe property of being a Socialist. Besides being a belief (i.e., a\nspecial attitude different from a wish, a desire, a fear or\nan intention), the identity of Ava’s belief depends on its\npropositional content. What Ava believes is identified by the embedded\n‘that’-clause that can stand all by itself as in (2):\n\nLionel Jospin is a Socialist.\n\n\nOn the face of it, an utterance of (2) is true if and only if a given\nconcrete individual does exemplify the property of being a Socialist.\nArguably, it is essential to the proposition that Ava\nbelieves—the proposition expressed by an utterance of\n(2)—that it is about Jospin and the property of being a\nSocialist. Just by virtue of having such a true belief, Ava must\ntherefore stand in relation—the belief relation—to Jospin\nand the property of being a Socialist. Notice that Ava can have a\nbelief about Jospin and the property of being a Socialist even though\nshe has never seen Jospin in person.\n\nFrom within the orthodox paradigm, one central piece of the mystery of\nintentionality can be brought out by reflection on the conditions in\nwhich simple singular thoughts about concrete individuals are true.\nThis is the problem of the relational nature of the contents\nof true singular beliefs. In order to generate this problem, it is not\nnecessary to ascend to false or abstract beliefs about fictional\nentities. It is enough to consider how a true thought about a concrete\nindividual that exists in space and time can arise. On the one hand,\nAva’s belief seems to be a singular belief about a concrete\nindividual. It seems essential to Ava’s belief that it has the\npropositional content that it has. And it seems essential to the\npropositional content of Ava’s belief that Ava must stand in\nrelation to somebody else who can be very remote from her in either\nspace or time. On the other hand, Ava’s belief is a state\ninternal to Ava. As John Perry (1994, 187) puts it, beliefs and other\nso-called ‘propositional attitudes’ seem to be\n“local mental phenomena.” How can it be essential to an\ninternal state of Ava’s that Ava stands in relation to someone\nelse? How can one reconcile the local and the relational characters of\npropositional attitudes?\n4. How can distinct beliefs be about one and the same object?\n\nThe problem of the relational nature of the contents of true singular\nthoughts can be made more acute by the following puzzle that exercised\nGottlob Frege (1892): how can one rationally hold two\ndistinct singular beliefs that are both about one and the same object?\nAs we shall see momentarily, this puzzle is related to a second\npuzzle: the puzzle of how a statement expressing a belief about\nidentity can both be true and informative. If the belief relation is a\ngenuine relation, then it would seem that it is like kicking:\nif Jacques Chirac kicked Lionel Jospin and if Lionel Jospin was the\nFrench Prime minister in 2001, then Jacques Chirac kicked the French\nPrime minister in 2001. Not so with belief, as we shall see\nmomentarily. Notice that in ordinary contexts, the word\n‘belief’ can be used to denote either a person’s\nstate or the content of that state.\n\nEver since Frege, it has been standard practice in analytic philosophy\nto investigate the intentional structure of much human thought by\ninquiring into the logical structure of the language used by speakers\nto express it or to ascribe it to others. (See, e.g., Dummett (1973)\nfor a forceful justification.) Suppose that Ava correctly believes\nthat Hesperus is shining as a result of seeing that Hesperus shines.\nSuppose also that she fails to believe that Phosphorus is shining\nbecause, although she correctly believes that Hesperus is called\n‘Hesperus,’ she incorrectly believes that\n‘Phosphorus’ is the name of a different planet (that she\nis not currently seeing) and she fails to know that\n‘Phosphorus’ is in fact another name for Hesperus. So\nwhereas the first belief report is true, the second belief report is\nfalse:\n\nAva believes that Hesperus is shining.\nAva believes that Phosphorus is shining.\n\n\nGiven that ‘Hesperus’ and ‘Phosphorus’ are\njust names of the same object, how can Ava believe one thing and\ndisbelieve the other? Given that ‘Hesperus’ and\n‘Phosphorus’ apply to the same object, it would seem that\n‘Hesperus is shining’ is true if and only if\n‘Phosphorus is shining’ is true and that these two\nsentences express one and the same proposition. If what is essential\nto the proposition that Ava believes is that it is about Hesperus and\nthe property of shining, how can she believe one thing and fail to\nbelieve the other since both are about Hesperus?\n\nAnother related puzzle is the puzzle of how identity statements can\nboth be true and informative. It seems clear that Ava could not doubt\nthat ‘Hesperus is Hesperus’ expresses a truth. But it\nseems clear that she can—in fact she does—doubt that\n‘Hesperus is Phosphorus’ expresses a truth. In fact, when\nshe learns that ‘Hesperus is Phosphorus’ does express a\ntruth, she is surprised. How can it be? (See Richard 1990 and Salmon\n1986.)\n\nFrege (1892) offered a very influential solution to both puzzles. This\ncommon solution is based on his famous distinction between the\nreference (or Bedeutung) and the sense (or\nSinn) of an English proper name. The sense, which is the mode\nof presentation of the reference, is presumably something abstract\nthat can both be instantiated by a concrete individual and present to,\nor grasped by, a mind. This distinction is in some ways reminiscent of\nthe distinction between extension and intension and is inconsistent\nwith John Stuart Mill’s (1884) view that proper names have a\ndenotation and no connotation.\n\nThe reason (3) and (4) can, on Frege’s view, have different\ntruth-values is that the embedded sentences or\n‘that’-clauses in (3) and (4)—namely (5) and\n(6)—do not express one and the same proposition. They\nexpress different propositions (or thoughts). Frege uses the German\nGedanke for ‘thought.’\n\nHesperus is shining.\nPhosphorus is shining.\n\n\nHow can (5) and (6) express different propositions? Unlike\nnon-ordinary contexts such as (3) and (4), in which they are part of\nan embedded ‘that’-clause, in ordinary contexts such as\n(5) and (6), ‘Hesperus’ and ‘Phosphorus’ have\nthe same Bedeutung (or reference). But they have different\nsenses (Sinn) or different modes of presentation of their\ncommon reference. On the Fregean view, what is essential to the\nthought or proposition expressed by an utterance of a sentence\ncontaining a singular term is its sense, not its reference.\nPropositions have senses, not individuals, as constituents. Ava lacks\na piece of knowledge. But given that ignorance is not irrationality,\nAva can rationally believe that Hesperus is shining and fail to\nbelieve that Phosphorus is shining. Similarly, a statement expressing\na belief about identity can both be true and informative because the\ntwo singular terms that flank the identity sign in an identity\nstatement have both a sense and a reference. The identity statement is\ntrue because they have the same reference. It is informative because\nthey have different senses or they present their common reference via\ndifferent modes of presentation.\n\nOn the Fregean view, in (3) and (4), ‘Hesperus’ and\n‘Phosphorus’ do not have their ordinary reference (or\nBedeutung), namely the planet to which they both apply: they\nhave an ‘oblique’ reference. In (3), the oblique reference\nof ‘Hesperus’ is its ordinary sense. In (4), the oblique\nreference of ‘Phosphorus’ is its ordinary sense. And we\nalready agreed that ‘Hesperus’ and\n‘Phosphorus’ in (5) and (6) have different ordinary\nsenses. So in (3), ‘Hesperus’ has an ‘oblique’\nor ‘indirect’ sense, which is the mode of presentation of\nthe ordinary sense ‘Hesperus’ has in (5). Similarly, in\n(4) ‘Phosphorus’ has an ‘oblique’ sense, which\nis the mode of presentation of the ordinary sense\n‘Phosphorus’ has in (5). On the Fregean view, a thought or\nbelief can be about a concrete individual (its reference),\nbut what matters to the individuation (or the identity) of the\nthought’s content is not the reference of the singular term, but\nthe sense or mode of presentation of the reference, i.e., something\nabstract. For further discussion, see the entry on\n Gottlob Frege.\n5. True negative existential beliefs\n\nWhen Brentano reflected on the “quasi-relational” nature\nof the intentionality of thoughts about things that need not\nexist, he wrote that if one “is denying something, the existence\nof the object is precisely what is excluded whenever [one’s]\ndenial is correct”. He thus assumed that one can correctly and\ncoherently deny the existence of things that do not exist. To show\nthat one can do so, however, is no easy task. The version of the\npuzzle that exercised both Alexius Meinong (a disciple of\nBrentano’s) and Bertrand Russell at the turn of the twentieth\ncentury is the puzzle of true negative existential beliefs. How can a\nperson correctly believe that Pegasus does not exist? For a person to\ncorrectly believe that Pegasus does not exist, she must have a belief\nwhose content is the same as the content expressed by a true utterance\nof sentence (7).\n\n Pegasus does not exist.\n\n\nHow can the proposition expressed by an utterance of (7) be both true\nand about Pegasus? The puzzle arises from the observation that if the\nproposition is true, then presumably it is not about Pegasus since it\nsays that Pegasus does not exist. Conversely, if it is about Pegasus,\nthen Pegasus must exist. But if so, then it cannot be true since it\ndenies the existence of Pegasus. Thus, the puzzle has the form of a\ndilemma: either the proposition expressed by (7) is false or it is not\nabout Pegasus. At least, the puzzle is generated by the pair of\nassumptions that ‘Pegasus’ is a proper name and that\nproper names must have a reference. Is the first assumption\nright?\n\nIn his 1905 paper, “On denoting,” Russell embraced the\nview that neither ‘Pegasus’ nor in fact most proper names\nof natural languages are genuine ‘logical’ proper names.\nHe held the epistemological view that unless one is directly\nacquainted with something, one cannot use in thought or\nlanguage a genuine ‘logical’ proper name referring to it.\nNor can one entertain a genuine singular thought about it. If one is\nnot directly acquainted with an object, then one must instead form a\ngeneral thought that is not about any particular individual. In fact,\nRussell (1911, 1919) held a dual view of acquaintance: on the one\nhand, he thought that acquaintance is a relation that can only hold\nbetween someone’s mind and his or her own sense data. On the\nother hand, he held the view that one can be acquainted with\nuniversals (such as e.g., colors). If most—if not\nall—names of natural languages are not genuine\n‘logical’ names, then what are they and what is their\nfunction in human thought and communication? On Russell’s view,\nthey are “disguised” or abbreviated definite descriptions,\ni.e., they are short for some definite description. Their logical\nfunction is that of a definite description.\n\nOn the face of it, the grammatical form of the quasi-English sentence\n‘the F is G’ indicates that it serves to express a\nsubject-predicate (or singular) proposition true if and only if the\nobject that exemplifies the property expressed by predicate\n‘F’ also exemplifies the property expressed by predicate\n‘G’. But Russell (1905) designed a method—his famous\ntheory of definite descriptions—for eliminating the English\ndefinite article ‘the’ (as in ‘the F’) by\nmeans of a logical formula of first-order logic involving only\nquantifiers and variables. On his analysis, ‘the F is G’\ncan be paraphrased into the general existentially quantified\nproposition (8):\n\n ∃x[Fx &\n∀y(Fy → y=x) &\nGx]\n\n\n(8) is true if and only if there is one and only one individual that\nis F and G. This proposition will be false just in\ncase nothing or more than one thing is both F and\nG.\n\nCombined with the assumption that ‘Pegasus’ is not a name\nbut a disguised definite description—that it is short for e.g.,\n‘the winged horse’—Russell’s theory of\ndefinite descriptions thus leads to a solution to the puzzle of true\nnegative existential beliefs. The solution is to accept the second\nhorn of the dilemma: the proposition is not about Pegasus. On this\naccount, one can correctly believe that Pegasus does not exist, since\nwhat one believes is what is expressed by an utterance of (7), namely\nthe true proposition that there does not exist a unique individual\nthat is a winged horse. Clearly, Russell’s solution to the\npuzzle of true negative existential beliefs shows how, in\nBrentano’s own terms, “if someone thinks of something, the\none who is thinking must certainly exist, but the object of his\nthinking need not exist at all” and furthermore the thought may\nbe true. For further discussion, see the entry on\n Bertrand Russell.\n6. Direct reference\n\nWithin the orthodox paradigm in the philosophy of mind and language of\nthe 1960’s and 1970’s, there was an important swing of the\npendulum away from the implications of Frege’s and especially\nRussell’s doctrines for intentionality. The so-called\n“theory of direct reference” has contributed to\nrehabilitate the view that concrete individuals matter more to the\nidentity of the singular thoughts that humans entertain than the\nFrege/Russell doctrines allow. According to Frege’s distinction\nbetween sense and reference, what matters to the identity of a thought\nabout a concrete individual is not the individual thought about but\nthe abstract sense by means of which he is thought about. According to\nRussell, most thoughts that seem prima facie to be about concrete\nindividuals are in fact not singular thoughts but generally quantified\npropositions. Much of the impetus for the theory of direct reference\ncame from the implications of the semantics of modal logic for the\nintentionality of singular thoughts and beliefs.\n\nSaul Kripke (1972) noticed an important difference between the\nbehavior of a proper name and the behavior of a coreferential definite\ndescription expressing a contingent or non-essential property of its\nreferent, in modal contexts. Consider two sentences (9) and (10), each\ncontaining some modal operator like ‘might’ (that\nexpresses a possibility) and such that the former contains a proper\nname while the latter contains a coreferential definite\ndescription:\n\nJacques Chirac might have been a Socialist.\nThe president of France elected in 2002 might have a been a\nSocialist.\n\n\nThe definite description ‘the president of France elected in\n2002’ happens to be true of Jacques Chirac of whom it expresses\na contingent property. There certainly exists a metaphysically\npossible world in which either Chirac was not a candidate in the 2002\nFrench presidential elections or he was a candidate but he lost the\nelection.\n\nAn utterance of (9) asserts that there exists a possible world in\nwhich Jacques Chirac is a member of the Socialist party, which he in\nfact is not. Given the deep connection between the speech act of\nassertion and speaker’s belief, an utterance of (9) expresses\nthe counterfactual belief about Chirac that he could have been a\nSocialist. Unlike an utterance of (9), an utterance of (10) is\nambiguous. On one reading, it has the same truth-conditions as does an\nutterance of (9) and it serves to express the same belief.\nAlternatively, an utterance of (10) says of someone who is in fact a\nSocialist, and who therefore is not Chirac, that he could have been\nelected president in 2002.\n\nThus, the following contrast emerges. An utterance of (9) can only\nserve to express a counterfactual belief or thought about Chirac,\ni.e., the belief ascribing to Chirac the counterfactual property of\nbeing a Socialist. An utterance of (10) can serve to express the same\nbelief about Chirac. But it can also serve to express an entirely\ndifferent counterfactual belief about a different individual, who as a\nmatter of fact happens to be a Socialist. This different\ncounterfactual belief would be true e.g., in a possible world in which\nJospin (who is a Socialist) won the 2002 presidential elections.\n\nOn the basis of the fact that, unlike (9), (10) can serve to express\ntwo distinct counterfactual beliefs, Kripke (1972) hypothesizes that a\nproper name is what he calls a rigid designator.\n‘Jacques Chirac’ in (9) is rigid for in all possible\nworlds it refers to one and the same concrete individual, i.e., the\nindividual to whom it in fact refers in the actual world. By contrast,\nthe definite description ‘the president of France elected in\n2002’, which happens to express a contingent property of Chirac,\nis not a rigid designator because it does not pick one and the same\nindividual in all possible worlds. When evaluated with respect to\ndifferent worlds, it is true of different individuals. Of course, some\ndefinite descriptions (e.g., ‘the square root of 21’) do\nexpress essential properties of what they are true of (in this case, a\nnumber). According to Kripke (1980), unlike proper names, whose\nrigidity is de jure, definite descriptions expressing\nessential properties of an object are rigid de facto. For\nfurther discussion, see the entry on\n reference.\n\nArguably, the goal of the theory of direct reference is to emphasize\nthe depth of the gap between the intentionality of singular thoughts\nand the intentionality of general thoughts. Concrete individuals are\nnot constituents of the contents of the latter. But they are\nconstituents of the contents of the former. Three arguments have been\nbuttressed to dismantle the Russellian disdain for the peculiar\nintentionality of singular thoughts expressible by proper names: a\nmodal argument, an epistemological argument and what can be called a\n“transcendental” argument.\n\nAccording to the modal argument, if the proper name\n‘Cicero’ were just short for some definite description,\ne.g., ‘the Roman orator who denounced Catiline,’ then it\nwould follow that the sentence ‘Cicero is the Roman orator who\ndenounced Catiline’ would express a necessary truth,\ni.e., a proposition true in all possible worlds. But this seems\nabsurd: there certainly is a possible world in which Cicero did not\ndenounce Catiline.\n\nAccording to the epistemological argument, from the same assumption,\nit follows that the sentence ‘Cicero is the Roman orator who\ndenounced Catiline’ expresses a proposition knowable a\npriori, so that it makes no sense to imagine that historians may\ndiscover by empirical research that in fact somebody else denounced\nCatiline or that nobody did. But this too seems absurd.\n\nFinally, according to the transcendental argument, people use proper\nnames in thought and in verbal communication to track, pick out and\nexchange valuable information about concrete particulars. Although\nthey may lack information expressible by some definite\ndescription—let alone by a single definite description—for\nuniquely identifying many concrete particulars, still people manage to\nsecure reference to them. Furthermore, as a person comes to learn more\nand more information about an object or a person, she comes to\nassociate different definite descriptions to the referent of a proper\nname. If follows that no one definite description seems suitable to\ncapture the content of a proper name.\n\nAccording to the theory of direct reference, the function of such\nlinguistic devices as proper names, indexicals and demonstratives is\nto introduce a concrete individual or particular into the proposition\nand/or belief expressed. To use David Kaplan’s (1979, 387)\nrevealing word, a concrete individual is “trapped” within\na singular proposition. The theory of direct reference seems like a\nuseful antidote against the Frege/Russell tendency to minimize the\ncontribution of concrete particulars to the individuation of human\nsingular thoughts. Three trends of thoughts in recent philosophy of\nmind and language have built on the theory of direct reference. First,\nmany of the insights of the theory of direct reference have been\nextended from thoughts about concrete individuals to thoughts about\nnatural kinds by Kripke (1972) and Putnam (1974). This extension plays\na crucial role in the externalist view of intentional mental states\n(about which see\n section 10).\n Secondly, neo-Fregeans have responded to the challenge of the theory\nof direct reference by providing a suitable notion of\n“object-dependent” or “de re” sense\n(see Evans, 1982 and McDowell, 1984). (For a response to Frege’s\npuzzle about how two distinct beliefs can be about the same object on\nbehalf of the theory of direct reference, see Salmon, 1986). Thirdly,\nthe metaphysical and epistemological underpinnings of singular\nthoughts (and singular propositions) have given rise to a rich\ndiscussion of the contrast between two broad perspectives:\ndescriptivism and singularism. According to descriptivism, we can only\nthink about objects by thinking about the properties which they\ninstantiate. But according to singularism, not all thoughts about\nobjects are mediated by thoughts about their properties. For further\ndiscussion, see the papers collected in Jeshion (ed.) (2010), in\nparticular Recanati (2010).\n7. Are there intentional objects?\n\nSections 4, 5 and 6 described three moves made within the orthodox\nparadigm in analytic philosophy in response to puzzles raised by the\nintentionality of singular thoughts about concrete particulars. In\nparticular, the dispute between the theory of direct reference and\neither the Fregean distinction between sense and reference or the\nRussellian assumption that ordinary proper names are disguised\ndefinite descriptions can be seen as internal to the orthodox paradigm\naccording to which there are only existing objects, i.e., concrete\nparticulars in space and time. Brentano, however, sketched the\npossibility of an alternative paradigm based on the acceptance of the\nview that intentional objects may be non-existent objects or abstract\nobjects. (For a general survey of the role of Brentano in the\nemergence of the non-orthodox theory of intentional objects in\nAustrian philosophy, see Smith, 1994.)\n\nTo see how the theory of intentional objects flows from\nBrentano’s characterization of intentionality, recall (from\nsection 2) that it follows from the nature of intentionality (as\ndescribed by Brentano’s first thesis) that nothing could exhibit\nintentionality unless there were objects – intentional objects\n– that satisfied the property Brentano called “intentional\ninexistence.” Consider the following inference schema licensed\nby the rule of existential generalization and instantiated by the\nnon-intentional relation expressed by the English verb\n“kiss” in (11):\n\n11a. Cleopatra kissed Caesar.\n\n11b. Cleopatra kissed something.\n\n\nIf (11a) is true, so is (11b). The question is: is this valid\ninference schema also instantiated by the following pairs (12)-(15)\ninvolving intentional relations?\n\n12a. Cleopatra loved Caesar.\n\n12b. Cleopatra loved something.\n\n\n13a. The Ancient Greeks worshiped Zeus.\n\n13b. The Ancient Greeks worshiped something.\n\n14a. Ponce de Leon searched for the fountain of youth.\n\n14b. Ponce de Leon searched for something.\n\n15a. Modern criminologists admire Sherlock Holmes.\n\n15b. Modern criminologists admire something.\n\n\nOn the one hand, unlike (11), (12)-(15) involve intentional relations.\nOn the other hand, unlike the intentional relation in (12), the\nintentional relations in (13)-(15) seem to involve particulars which\ndon’t exist (or haven’t existed) in space and time.\nIntentional-object theorists hold that the above inferences involving\nboth non-intentional and intentional relations constitute data that\ncall for a consistent explanation. In other words, the\nintentional-object theorist accepts, whereas his critic rejects, the\nvalidity of the rule of existential generalization for both\nintentional and non-intentional relations, whether the relata of the\nintentional relations are concrete particulars in space and time or\nnot. On the non-orthodox assumption that the inference schema\ninstantiated by (11) can be instantiated by (12)-(15) as well, then in\nlogical notation, the second coordinate of every pair (11)-(15) should\nbe symbolized thus:\n\n11c. ∃x(Cleopatra kissed x)\n\n12c. ∃x(Cleopatra loved x)\n\n13c. ∃x(Ancient Greeks worshiped x)\n\n14c. ∃x(Ponce de Leon searched for x)\n\n15c. ∃x(Modern criminologists admire x)\n\n\nThus, the issue between the intentional-object theorist and his critic\nis whether the variable bound by the standard existential quantifier\nof first-order logic should range not merely over concrete particulars\nexisting in space and time but also over all sorts of other entities\nas well. Note that the issue is orthogonal to the contrast between the\nobjectual and the substitutional interpretation of the existential\nquantifier since the dispute over the admission of intentional objects\nis wholly internal to the objectual interpretation of the quantifier.\nThe question that arises for the intentional-object theorist is: what\nis the best theory of the objects over which (13c)-(15c) seem to\nquantify?\n\nMeinong (1904) supposed that objects like Zeus, the fountain of youth,\nSherlock Holmes, etc., are non-existent objects which exemplify the\nproperties attributed to them. On his view, the fountain of youth is\nan object that instantiates both the property of being a fountain and\nthat of having waters which confer everlasting life. But it fails to\ninstantiate the property of existence. Meinong seemed to suppose that\nfor any group of properties, there is an object which instantiates\nthose properties. Some of the resulting objects exist and others do\nnot. Russell (1905) found this view of intentional objects\nontologically unacceptable since it involves the acceptance of\nentities such as golden mountains (which are inconsistent with\nphysical and chemical laws) and round squares (which are inconsistent\nwith the laws of geometry). His theory of definite descriptions was\nprecisely designed to avoid these ontological consequences (see\nsection 5). However, by clarifying distinctions proposed by both\nMeinong and his student Ernst Mally, Parsons (1980) has recently\noffered a theory of non-existent objects, which is based on the\nassumption that existence is a special kind of property. This theory\nuses a quantifier “∃”, which does not imply\nexistence. To assert existence, he uses the predicate\n“E!”. Thus, the assertion that there are\nnon-existent objects can be represented in Parsons’ theory\nwithout contradiction by the logical formula\n“∃x(~E!x).” Furthermore, Parsons\ndistinguishes between “nuclear” and\n“extranuclear” properties. Only the former, which are\nordinary, non-intentional kinds of properties, contribute to\nindividuating objects. The set of extranuclear properties involve\nintentional properties, modal properties and existence. Armed with\nthis distinction among properties, Parsons (1980) has been able to\navoid Russell’s objections to Meinong’s naive theory of\nintentional objects. (For further details, see Parsons, 1980.) An\noriginal account of the possibility of entertaining true thoughts\nabout non-existent objects, based on the contrast between pleonastic\n(or representation-dependent) and non-pleonastic (natural or\nsubstantial) properties, has been developed by Crane (2013).\n\nThe theory of intentional objects has also been developed in a\nslightly different way. Meinong’s student Ernst Mally (1912)\nproposed that fictional and mythical objects, as well as objects like\nround squares, do not instantiate the properties attributed to them\nbut “have” those properties in a different way. For Mally,\nthe fountain of youth is “determined” by the properties of\nbeing a fountain and having waters which confer everlasting life, but\nthis object doesn’t instantiate those properties in the\ntraditional sense. Given Mally’s distinction, the fact that\nthere is an object which is determined by the properties of being\ngolden and of being a mountain does not contradict the contingent fact\nthat nothing instantiates these two properties, nor does Mally have to\nthink of intentional objects as non-existent. Rather, he treats them\nas existing abstract objects. Thus, whereas Parsons uses two kinds of\nproperties to develop a theory of non-existent objects, a neo-Mallyan\nsuch as Zalta (1988) uses two kinds of predication –\nexemplification (which corresponds to instantiation) and encoding\n(which corresponds to Mally’s notion of determination) –\nto develop a theory of abstract objects. These abstract objects are\npart of the explanations of both the truths expressed by (13a)-(15a)\nand the validity of the inferences in (13a,b)-(15a,b). As such,\nabstract objects may well exist. Nonetheless, some abstract objects\n(e.g., Sherlock Holmes and Zeus) may be said “not to\nexist” in the sense that nothing exemplifies the properties\nwhich they encode.\n\nThough Quine’s (1948) well-known paper “On what there\nis,” raises serious ontological questions for intentional-object\ntheories, both Parsons and Zalta have provided answers to\nQuine’s queries, in their respective work. Nonetheless, to this\nday, many contemporary philosophers have been reluctant to embrace\nintentional-object theories for two related reasons. First of all,\nthey have been eager to avoid what they see as the heavy ontological\ncommitments incurred by intentional-object theories. Secondly, the\nontology of non-existent and abstract objects has seemed difficult to\nsquare with the ontology of the contemporary natural sciences\naccording to which the world contains only concrete objects that exist\nin space and time. (See Section 9 for further discussion.)\n\nThe theory of intentional objects, however, may derive support from\nthe following, arguably counterintuitive, consequences of\nFrege’s and Russell’s views, respectively. Frege’s\ntheory faces two problems. First (13a)-(15a) would appear to express\ntruths. But on Frege’s view, they lack a truth-value, since they\ninvolve singular terms devoid of reference and, according to Frege, if\npart of a sentence lacks a reference, then the sentence itself fails\nto have a truth-value (see section 4). Secondly, the inferences in\n(13)-(15) appear to be valid. But on Frege’s view, one cannot\nvalidly infer (13b) from (13a) if (13a) has no truth-value. Similarly\nfor the other pair of sentences (14) and (15). Russell’s view\nfaces two analogous problems. First, as noted above, (13a)-(15a)\nappear to be true. But on Russell’s analysis, proper names such\nas “Zeus” in (13a) and “Sherlock Holmes” in\n(15a) are abbreviated definite descriptions and, given his analysis of\ndefinite descriptions, both (13a) and (15a) turn out to express false\nexistentially quantified propositions (see section 5). Secondly, if\n(13a)-(15a) are indeed false, as Russell’s view would have it,\nthen one cannot validly infer (13b)-(15b), respectively, from their\ncorresponding premisses. For a recent novel account of the distinction\nbetween true and false thoughts about non-existent objects, cf. Crane\n(2013) and for further discussion of the general topic of existence,\nsee the SEP entry on existence.\n8. Is intensionality a criterion of intentionality?\n\nWithin the orthodox paradigm, an entirely different reaction to the\npuzzles of intentional inexistence has been to try to clarify the\nontological difficulties by ascending to a higher semantic level that\ncan, as Willard Van Orman Quine (1960, 272) says, “carry the\ndiscussion into a domain where both parties are better agreed on the\nobjects (viz., words).” Semantic ascent allows one to rise from\ntalk about things to talk about talk about things, i.e., words. In\ncontemporary analytic philosophy, Roderick Chisholm (1957, 298) was\nthe first to contemplate the formulation of “a working criterion\nby means of which we can distinguish sentences that are intentional,\nor are used intentionally, in a certain language from sentences that\nare not.” The idea is to examine sentences that report\nintentionality rather than intentionality itself.\n\nIntensionality (with an s) is non-extensionality. Two\nfeatures are characteristic of extensionality. First, if a linguistic\ncontext is extensional, two coreferential terms can be substituted one\nfor the other salva veritate as illustrated by (16) and\n(17):\n\nHesperus shines.\nPhosphorus shines.\n\n\nIf (16) is true, so is (17). Secondly, the law of existential\ngeneralization applies to either (16) or (17) to yield\n‘∃x(x shines).’ Not so with\nintensionality. As illustrated by examples (3) and (4) repeated here,\nthe truth of (3) does not always entail the truth of (4):\n\nAva believes that Hesperus is shining.\nAva believes that Phosphorus is shining.\n\n\nNor can existential generalization always be validly applied to\nsentences reporting beliefs, since from the fact that John believes\nthat angels have wings, it does not follow that there are things such\nthat John believes of them that they have wings.\n\nChisholm’s criterion of intensionality is threefold. First, a\nsentence reports an intentional phenomenon if it contains a singular\nterm that purports to refer to some object and it is such that neither\nit nor its negation implies that the purported reference of the\nsingular term does or does not exist. The first criterion amounts to\nthe recognition that if a sentence containing a singular term reports\nan intentional phenomenon, then it fails to satisfy the law of\nexistential generalization (from ‘Fa’ infer\n‘∃xFx’). Secondly, a true sentence reports\nan intentional phenomenon if it contains a singular term\n‘a’ and if replacement of\n‘a’ by coreferential term\n‘b’ results in transforming the true sentence\ninto a false sentence that differs only from the former in that\n‘b’ replaces ‘a’. The second\ncriterion amounts to recognition that if a sentence containing a\nsingular term reports an intentional phenomenon, then it fails the\ntest of the substitutivity of coreferential terms salva\nveritate. Finally, if a complex sentence containing an embedded\n‘that’-clause reports an intentional phenomenon, then\nneither it nor its negation entail the truth of the proposition\nexpressed by the embedded ‘that’-clause.\n\nChisholm (1957) argued that reports or descriptions of intentional or\npsychological phenomena cannot be reduced to (or eliminated in favor\nof) descriptions of behavior. The intensionality or non-extensionality\nof reports of intentionality was taken to show that descriptions and\nexplanations of psychological phenomena cannot be described nor\nexplained in terms of a vocabulary describing non-intentional\nphenomena. As Quine (1960, 220) put it, “there is no breaking\nout of the intentional vocabulary by explaining its members in other\nterms”. Chisholm (1957) took this conclusion to show the\ncorrectness of Brentano’s third thesis that intentionality\nis the mark of the mental.\n\nThe question can be decomposed into two questions. On the one hand,\nacceptance of intensionality as the criterion of intentionality seems\nto reflect the endorsement of a general linguistic view of\nintentionality in the following sense: what matters to the mental\n(i.e. non-linguistic) state reported are the properties of the\nlinguistic report. There are at least two reasons for scepticism about\nthe linguistic view of intentionality. On the other hand, there are\nsome specific reasons for questioning two of Chisholm’s\ncriteria. I start with the latter. It seems hard to deny that states\nof knowledge are states with intentionality. At least,\nreports of knowledge states satisfy Chisholm’s second\nnon-substitutivity criterion. From the fact that knowledge ascription\n(18) is true, it does not follow that (19) is, even though\n‘Cicero’ and ‘Tully’ are coreferential:\n\nTom knows that Cicero denounced Catiline.\nTom knows that Tully denounced Catiline.\nCicero denounced Catiline.\n\n\nHowever, unlike belief reports, reports of knowledge are\nfactive: (18) could not be true unless (20) was true and\nCicero did in fact denounce Catiline. Thus, unlike belief reports,\nreports of knowledge fail Chisholm’s third criterion. Given that\n(20) is extensional, it obeys the law of existential generalization.\nIf the truth of (20) follows from the truth of (18) and if (20)\nsatisfies the law of existential generalization, then so does (18). If\nso, then knowledge reports also fail to satisfy Chisholm’s first\ncriterion.\n\nOne way to deal with this objection might be to argue that knowledge\nreports fail the test of existential generalization precisely because,\nunlike belief states, states of knowledge fail to exhibit\nBrentano’s intentional inexistence: only beliefs, not states of\nknowledge, can be directed towards states of affairs that fail to\nobtain and towards non-existent entities. Alternatively, one might\nmake a distinction between states with a stronger and states with a\nweaker intentionality. Reports of the former (like beliefs) satisfy\nChisholm’s three criteria. Reports of the latter (like states of\nknowledge) only fail the substitutivity test.\n\nThe problem with this strategy is that there are sentences that seem\nto describe intentional relations and that, unlike knowledge reports,\nare not intensional at all, for they pass the substitutivity\ntest. This is the case of sentences about what Fred Dretske (1969)\ncalls nonepistemic perception. If, when he was alive, someone\nsaw the French writer Romain Gary, then she ipso facto saw\nAjar, for Ajar was no other than Romain Gary. However, if she failed\nto know that ‘Ajar’ was another name for Romain Gary,\nwhile seeing Romain Gary, she may have failed to see that the\nman in front of her was Ajar. A fortiori, in this nonepistemic sense,\none cannot see an individual unless there is an individual to be seen.\nOne possible response might be to bite the bullet and deny that\nnonepistemic perception is an intentional state at all. If so, then,\nas Zalta (1988, 13) notes, linguistic reports of intentional phenomena\ndo satisfy at least one of Chisholm’s criteria of\nintensionality.\n\nIf seeing is intentional, then not all reports of intentionality are\nintensional. That not all reports of intentionality are intensional is\na problem for the linguistic view according to which intensionality is\nthe criterion of intentionality. A second problem is that\nintensionality is also a feature of sentences that are about phenomena\nother than intentionality. Sentences that involve or are about\nmodalities such as necessity, about natural laws, about causation all\nexhibit intensionality. So, for example, the truth of (21) does not\nentail the truth of (22) even though everything that happens to\nexemplify property Q happens to exemplify property\nR:\n\nIt is a natural law that all Ps are Q.\nIt is a natural law that all Ps are R.\n\n\nBut necessity, natural laws or causation do not, on the face of it,\nexhibit what Brentano took to be the defining characteristics of\nintentionality. So it seems as if the intensionality of the report of\na phenomenon is neither necessary nor sufficient for the\nintentionality of the reported phenomenon. Arguably, ‘P’,\n‘Q’ and ‘R’ in (21)-(22) are not singular\nterms at all. If they are treated as such, then, even though they may\nbe true of the same set of individuals, they do not refer or express\none and the same property. Still, the point illustrated by nomicity is\nthat the intensionality of a linguistic report is not sufficient for\nthe intentionality of the reported phenomenon.\n9. Can intentionality be naturalized?\n\nAs we saw in section 8, Quine (1960, 220), a leading critic of\nintentional objects (in the sense of section 7), agrees with Chisholm\n(1957) that the intentional vocabulary cannot be reduced to some\nnon-intentional vocabulary. Chisholm (1957) took this conclusion to\nshow the correctness of Brentano’s third thesis that\nintentionality is the mark of the mental. From the same\nconclusion, Quine (1960, 221) presented an influential dilemma with\nboth epistemological and ontological implications. The first horn of\nthe dilemma is to accept the “indispensability of intentional\nidioms and the importance of an autonomous science of intention”\nand to reject a physicalist ontology. The second horn of the same\ndilemma is to accept physicalism and renounce the\n“baselessness” of the intentional idioms and the\n“emptiness” of a science of intention. This dilemma has\nbeen influential in contemporary philosophy of mind.\n\nThe common legacy of Chisholm (1957) and Quine (1960) is the\nlinguistic view of intentionality (accepted by e.g., Dennett 1969).\nWhether intensionality is indeed the defining criterion of\nintentionality, one can certainly question Brentano’s thesis\nthat only mental phenomena exhibit intentionality by noticing\nthat some non-mental things exhibit something very much like\nBrentano’s intentional inexistence, namely sentences of natural\nlanguages. Sentences of natural languages have meaning and by virtue\nof having meaning, they can be, just like states of mind, directed\ntowards things other than themselves, some of which need not exist in\nspace and time. Sentences of natural languages, however, are\nnon-mental things.\n\nOne influential response to this objection to this part of\nBrentano’s third thesis has been to grant a second-rate, i.e., a\ndegraded and dependent, intentional status to sentences (see Haugeland\n1981, Searle 1980, 1983, 1992, Fodor 1987). On this view, sentences of\nnatural languages have no intrinsic meaning of and by themselves. Nor\ndo utterances of sentences have an intrinsic content. Sentences of\nnatural languages would fail to have any meaning unless it was\nconferred to them by people who use them to express their thoughts and\ncommunicate them to others. Utterances borrow whatever\n‘derived’ intentionality they have from the\n‘original’ (or ‘primitive’) intentionality of\nhuman beings with minds that use them for their purposes (see Dennett\n1987 for dissent). If, as Jerry Fodor (1975, 1987, 1994, 1998, 2008)\nhas argued, there exists a “language of thought”\nconsisting of mental symbols with syntactic and semantic properties,\nthen possibly the semantic properties of mental symbols are the\nprimary bearers of ‘original’ intentionality. (See the\nentry on the\n language of thought hypothesis.)\n\nSo the question is: does any non-mental thing exhibit\n‘original’ intentionality? The question is made more\npressing by Quine’s dilemma, according to which one must choose\nbetween Brentano’s third thesis and a physicalist ontology.\nSo-called ‘eliminative materialists’ (see Churchland 1989)\nresolutely opt for the second horn of Quine’s dilemma and deny\npurely and simply the reality of human beliefs and desires. As a\nconsequence of their denial of the reality of beliefs and desires, the\neliminative materialists must face the challenge raised by the\nexistence of physical objects whose existence depends on the\nintentions, beliefs and desires of their designers, i.e., human\nartifacts. Others, like Daniel Dennett (1971, 1978, 1987, 2017), who\nrejects any sharp distinction between original and derived\nintentionality on the grounds that original intentionality itself is\nthe output of natural selection, take a so-called\n‘instrumentalist’ position. On Dennett’s view, the\nintentional idiom fails to describe or explain any real phenomenon.\nHowever, in the absence of detailed knowledge of the physical laws\nthat govern the behavior of a physical system, the intentional idiom\n(the ‘intentional stance’ as Dennett calls it) is a useful\nstance for predicting a system’s behavior. Among philosophers\nattracted to a physicalist ontology, few have accepted the outright\neliminativist materialist denial of the reality of beliefs and\ndesires. Nor have many of them found it easy to answer the puzzling\nquestion raised by the instrumentalist position: how can the\nintentional idiom make useful predictions if it fails to describe and\nexplain anything real?\n\nA significant number of physicalist philosophers subscribe to the task\nof reconciling the existence of intentionality with a physicalist\nontology (for a forceful exposition see Field 1978, 78–79). On\nthe assumption that intentionality is central to the mental, the task\nis to show, in Dennett’s (1969, 21) terms, that there is\nnot an “unbridgeable gulf between the mental and the\nphysical” or that one can subscribe to both physicalism and\nintentional realism. Because intentional states are of or\nabout things other than themselves, for a state to have\nintentionality is for it to have semantic properties. As Jerry Fodor\n(1984) put it, the naturalistic worry of intentional realists who are\nphysicalists is that “the semantic proves permanently\nrecalcitrant to integration to the natural order”. Given that on\na physicalist ontology, intentionality or semantic properties cannot\nbe “fundamental features of the world,” the task is to\nshow “how an entirely physical system could nevertheless exhibit\nintentional states” (Fodor, 1987). As Dretske (1981) puts it,\nthe task is to show how to “bake a mental cake using only\nphysical yeast and flour”. Notice that Brentano’s own view\nthat ‘no physical phenomenon manifests’ intentionality is\nsimply unacceptable to a physicalist. If physicalism is true, then\nsome physical things are also mental things. The question for a\nphysicalist is: does any non-mental thing manifest intentionality?\n\nClearly, one way to relieve the tension between physicalism and\nintentional realism is to argue that intentionality can be, and in\nfact is, exhibited by non-mental things. There have been several\nproposals in analytic philosophy in the past twenty years to suggest\nways of accomplishing this program, which has been called ‘the\nnaturalization of intentionality.’ The common strategy is to\nshow that Brentano was wrong in claiming that only mental things can\nexhibit intentionality. This strategy is related to the assumption\nthat intentional relations whose relata are concrete particulars\nshould have primacy over intentional relations whose relata are not\n(see\n section 7).\n I shall illustrate two distinct proposals for implementing this\ncommon goal.\n\nOne influential strategy for showing that non-mental things can\nexhibit intentionality has been Fred Dretske’s (1980, 1981,\n1994) information-theoretic proposal that a device that\ncarries information does exhibit some degree of intentionality. The\nview is an extension of Paul Grice’s (1957) notion of\nnatural meaning: unlike the English word ‘fire,’\nwhich non-naturally means fire, smoke naturally means fire. The word\n‘fire’ can be tokened in the absence of any fire either\nfor the purpose of expressing a thought about what to do if there was\none or perhaps to mislead somebody else into falsely thinking that\nthere is one. But there cannot be any smoke unless there is a fire. As\nwe shall see momentarily, it is a feature of both the original\nintentionality of beliefs and the derived intentionality of utterances\nthat they can be misrepresentations.\n\nIn essence, the information-theoretic proposal is that device\nS carries information about instantiations of property\nG if and only if S’s being F is\nnomically correlated with instantiations of G. If S\nwould not be F unless property G were instantiated,\nthen S’s being F carries information about, or\nas Dretske likes to say, indicates G-ness. A fingerprint\ncarries information about the identity of the human being whose finger\nwas imprinted. Spots on a human face carry information about a\ndisease. The height of the column of mercury in a thermometer carries\ninformation about the temperature. A gas-gauge on the dashboard of a\ncar carries information about the amount of fuel in the car tank. The\nposition of a needle in a galvanometer carries information about the\nflow of electric current. A compass carries information about the\nlocation of the North pole. In all such cases, a property of a\nphysical device nomically covaries with some physical property\ninstantiated in its environment (for critical discussion of the\ninformational program, see Kistler 2000, Loewer 1987, 1998 and Putnam\n1986).\n\nNow, insofar as it is not a law that polar bears live at the\nNorth pole, even though they happen to live there, a compass will fail\nto carry information about where polar bears happen to live in spite\nof the fact that it does carry information about the North pole. If\nso, then reports of what a compass indicates exhibit one of\nChisholm’s features of intensionality, namely coextensive terms\nare not freely substitutable salva veritate in such reports.\nBy contrast, if it is law that variations of temperature covary with\nvariations in atmospheric pressure, then by virtue of indicating the\ntemperature, the height of the column of mercury in a thermometer will\nalso indicate atmospheric pressure. If there is a law relating current\nflow to voltage differences, then by indicating the former, a\ngalvanometer will indicate the latter. One can, however, believe and\neven know that there is a current flow between two points without\nbelieving, let alone knowing, that there is a voltage difference\nbetween the two points, if one fails to know that it is a law that if\nthere is flow of electric current between two points, then there is a\nvoltage difference between these two points (see Jacob 1997 for\ndiscussion).\n\nSo although reports of the information carried by such physical\ndevices exhibit some of the intensionality exhibited by reports of\nintentional mental states, the intensionality exhibited by the latter\nis clearly stronger than the intensionality exhibited by the former.\nOn the one hand, it is difficult to generate the strong intentionality\nof mental states from the information-theoretic account of the weak\nintentionality of non-mental things. On the other hand, given that the\ninformation relation is the converse of a nomic correlation, it is\ndifficult for informational semantics to account for misrepresentation\nas well as for the normativity of the contents of mental states. See\nthe entry on\n causal theories of mental content..\n\nA second influential proposal for dealing with the difficulties left\npending by the information-theoretic approach and for showing that\nsome non-mental things can exhibit intentionality has been Ruth\nMillikan’s (1984, 1993, 2000, 2004) teleosemantic\napproach. Millikan’s teleosemantic approach rests on two basic\nassumptions, the first of which is that (unlike a natural sign) an\nintentional representation is a relatum in a three-place relation\ninvolving two mechanisms: a producer of the representation and a\nconsumer, both of which are cooperative devices whose activities are\nbeneficial to both. Millikan’s second assumption is that\nBrentano’s relation of intentional inexistence is exhibited by\nbiological functions. Given any sort of biological purpose or design,\nit might fail to be fulfilled. For example, if it is the function or\npurpose of a mammal’s heart to pump blood, then a mammal’s\nheart ought to pump blood even though it might fail to do so. Notice,\nhowever, that whereas biological organs have functions that may fail\nto be fulfilled, they do not ipso facto exhibit\nintentionality in Brentano’s full sense: neither a heart nor a\nstomach are of or about anything. Millikan’s\nclaim, however, is not that having a function is sufficient for\naboutness, but that it is necessary. Arguably, a device cannot be\nabout or represent anything unless it can misrepresent what it is\nabout. Presumably, for a device to misrepresent what it is about is\nfor it to misfunction. But unless the device had some function, it\ncould simply not misfunction. If this is correct, then nothing could\nbe a representational system—nothing could have content or\nintentionality—unless it had what Millikan (1984) calls a\n‘proper’ function.\n\nThe relevant notion of a function here is the biological teleological,\nnot the dispositional one: the function of an organ is not what the\norgan is disposed to do, but what it was selected to do (see Millikan\n1984 and Neander 1995). Arguably, nothing can have a function unless\nit results from some historical process of selection or other.\nSelection processes are design processes. Most advocates of\nteleosemantics accept the etiological account of functions according\nto which the function of a device is a selected effect, i.e. an effect\nproduced by the device that explains the continued proliferation of\ntokens of this type of device. Thus, according to\n“teleosemantic” theories, design is the main source of\nfunction, which in turn is the source of content or intentionality.\nSuch theories are called “teleosemantic” theories in\nvirtue of the connection between design or teleology and content. One\ncontentious issue is whether the teleological approach championed by\nMillikan can be combined with informational semantics so that\nS can be said to represent instances of property F\nif and only if it is S’s function to carry information\nabout F. On the one hand, against this proposal, Millikan\n(2004) has argued that the information carried by a sign depends on\nits causes, not its effects: according to teleosemantics and the\netiological approach to functions, the function of a device is one of\nits effects: it does not depend on its causes. On the other hand,\nMillikan (2017) proposes to redefine the border between concepts and\npercepts by deepening her semiotic approach to perception based on the\nrelated twin notions of unicepts and unitrackers.\nNeander (2017) and Shea (2018) have further explored the possibility\nof combining informational semantics and a teleological approach. For\nfurther discussion of teleosemantics, see the SEP entry on\nteleological theories of mental content and the papers collected in\nRyder, Kinsbury and Williford (eds.)(2011).\n\nNow, selection processes can be intentional or non-intentional.\nArtifacts (including words and other symbols of natural languages)\nderive their functions from some intentional process. While\npsychological mechanisms (e.g., belief-forming mechanisms) derive\ntheir proper functions from a non-intentional selection\nprocess, particular belief states have derived proper functions. The\nparadigmatic non-intentional process is the process of natural\nselection by which Charles Darwin explained the phylogenetic evolution\nof biological species: natural selection sorts organisms that survive.\nBut no intentional agent is responsible for the sorting. Millikan\n(1984, 2004, 2005) has also extended her teleosemantic approach to the\ncontents of intentional conventional signs (i.e. linguistic symbols).\nIf this sort of teleosemantic proposal could be fully worked out, then\nit would kill two birds with one stone. On the one hand, it would\npoint a way in which the intentionality of minds derives from the\nintentionality of biological things (see Rowlands 1999 for\ndiscussion). On the other hand, it would show that some of the\nnormativity of mental states is already exhibited by biological\nfunctions (see Neander, 1995). Both questions are currently topics of\nmuch discussion in the philosophy of mind. Many philosophers such as\nDavidson (1980), Kripke (1982), McDowell (1994) and Putnam (1988,\n1994), for example, have either expressed serious reservations about\nthe program or provided reasons for scepticism. For further\ndiscussion, see the essays in MacDonald and Papineau (eds.) 2006, and\nalso the entries on\n teleological theories of mental content\n and\n teleological notions in biology.\n Subsequently Burge (2010) criticized attempts to naturalize\nintentionality by appeal to the notion of biological function on the\ngrounds that it is, according to him, a deep mistake to identify\nrepresentational success (truth or accuracy) with fulfillment of\nbiological function and representational failure (falsity or\ninaccuracy) with failure of biological function. Unlike\nrepresentational (or semantic) success or failure, fulfillment or\nfailure of a biological function is, according to Burge, practical\nsuccess or failure.\n10. Is intentionality exhibited by all mental phenomena?\n\nPerceptions, beliefs, desires and intentions and many other\n“propositional attitudes” are mental states with\nintentionality. They are about or represent objects and states of\naffairs under a particular psychological mode or format. Perceptions,\nbeliefs, desires and intentions illustrate a basic duality of the\nintentionality of the mental: the duality between mind-to-world and\nworld-to-mind directions of fit. In order to clarify this duality,\nElizabeth Anscombe (1957, 56) considers a mere “shopping\nlist”. The list may either be used as a set of instructions (or\na blueprint) for action by a customer in a store or it can be used as\nan inventory by a detective whose purpose is to draw a record of what\nthe customer is buying. In the former case, the list is not to be\nrevised in the light of what lies in the customer’s grocery bag.\nBut in the latter case, it is. If a mismatch should occur between the\ncontent of the grocery bag and the list used by the customer, then the\nblame should be put on the customer, not on the list. In the case of a\nmismatch between the content of the bag and the list drawn by the\ndetective, the detective should correct his list.\n\nBuilding on Anscombe’s insight, Searle (1983) argues that there\nare two opposite “directions of fit” that either speech\nacts or mental states can exemplify: just as the speech act of\nassertion has a word-to-world direction of fit, beliefs and\nperceptions have a mind-to-world direction of fit. It is the function\nof an assertion to state a fact or an actual state of affairs.\nSimilarly, it is the function of a belief and a perception to match a\nfact. Unlike assertions, orders have a world-to-word direction of fit.\nUnlike beliefs and perceptions, desires and intentions have a\nworld-to-mind direction of fit. It is the function of an order to\nrepresent a non-actual possible or impossible state of affairs.\nSimilarly, it is the function of a desire and an intention to\nrepresent a non-actual possible or impossible state of affairs.\n\nNow the following questions arise: are Brentano and the\nphenomenological tradition right? Do all mental states exhibit\nintentionality? Is intentionality a feature of every aspect of human\nexperience? Are all forms of consciousness consciousness of\nsomething? Does every mental state possess one or the other direction\nof fit? Do sensations (e.g., pains), feelings, emotions (e.g.,\ndepression) all exhibit intentionality? These questions are very\ncontroversial in contemporary philosophy of mind. Before examining\nvarious contradictory answers to these questions, a preliminary\nquestion is relevant. Whether Brentano was right or not, why should we\nwant a mark or a criterion of the mental at all?\n\nThe question of why we should seek a criterion of the mental at all\nhas been made pressing by some recent remarks of the linguist Noam\nChomsky (2000, 75, 106), according to whom methodological naturalism\nmandates that we use terms like ‘mind’ and\n‘mental’ on a par with terms like ‘chemical’,\n‘optical’ or ‘electrical.’ Since we do not\nseek to determine the true criterion of the electrical or the mark of\nthe chemical, by naturalistic parity of reasoning, Chomsky argues, we\nshould no more seek a criterion of the mental. Whether we need\ncriteria respectively for the chemical and for the optical, it is a\ngenuine issue whether the English word ‘mental’ can\njustifiably apply to things as diverse as e.g., a pain and the belief\nthat 5 is a prime number. As Richard Rorty (1979, 22) has put it,\n“the attempt to hitch pains and beliefs together seems ad\nhoc—they don’t seem to have anything in common except our\nrefusal to call them ‘physical’”. His conclusion is\nthat the word ‘mental’ expresses no single property, let\nalone a ‘natural kind.’ On Rorty’s irrealist view,\nthe word ‘mental’ is just part of an academic\nlanguage-game with no scientific explanatory import.\n\nThus, Rorty’s radical irrealist picture of the mind relies on\nthe observation that pains and arithmetical beliefs seem to have\nnothing in common. Not many contemporary philosophers of mind would\naccept Rorty’s irrealist picture of the mind. But most do\nrecognize that if minds are real, then two problems arise:\nthe problem of intentionality and the problem of consciousness or\nconscious phenomenal experience. Most would claim that a solution to\nthe problem of intentionality is not ipso facto a solution to\nthe problem of consciousness. Why is that so?\n\nHuman beings can experience the world in various ways by means of\nseveral distinct sensory modalities (vision, audition, touch,\nolfaction). They are also aware of parts of their bodies as when they\nsuffer pains. The problem of consciousness is often called “the\nproblem of qualia” because states with a strong\nphenomenal character—like pains, visual or olfactory\nsensations—are states that introspectively seem endowed with a\nstrong intrinsic subjective quality. The general problem of\nconsciousness is to explain, in Thomas Nagel’s (1974) famous\nphrase, “what it is like” to be a certain creature with a\nphenomenal experience. What is the phenomenal character—the\nphenomenology—of the various forms of human experience? Few if\nany philosophers—physicalist or otherwise—are inclined to\nassume that, unlike intentionality, phenomenal consciousness can be\nexemplified by non-mental things. Not many would deny that, although\npains, visual sensations, olfactory sensations, auditive sensations\nare very different experiences, nonetheless they all exhibit a common\nproperty called “phenomenal consciousness”. From both a\nscientific and a physicalist perspective, the questions arise whether\nphenomenal consciousness is physical and whether it can be explained\nin physical terms, i.e., as a result of processes happening in the\nbrain.\n\nAs many philosophers are willing to recognize, the concept expressed\nby the word ‘consciousness’ is much in need of\nclarification. Three such clarifications are worth mentioning. Two of\nthem consist in a pair of distinctions drawn by David Rosenthal\n(1986). One distinction is between creature consciousness and state\nconsciousness. The other distinction is between transitive and\nintransitive consciousness. A creature can be said to be\n‘intransitively’ conscious if she is alive and normally\nresponsive to ongoing stimuli. She stops being intransitively\nconscious while in a dreamless sleep, if she is knocked out, drugged\nor comatose. A creature can be said to be ‘transitively’\nconscious if she is conscious of things, properties and\nrelations in her environment. Whereas a creature can be both\nintransitively conscious and transitively conscious of something, a\nmental state can only be intransitively conscious. One important\naspect of the problem of consciousness is the problem of how to draw\nthe line between conscious and unconscious mental states. A third\nclarification has been Ned Block’s (1995) distinction between\naccess consciousness (or A-consciousness) and phenomenal consciousness\n(or P-consciousness). Whereas a state is said to be A-conscious if it\nis poised for free use in reasoning and for direct rational control of\naction and speech (i.e. available or accessible to several cognitive\nmechanisms), the P-consciousness of a state is what it is like to be\nin that state (whether or not it has A-consciousness). In recent work,\nBlock (2007) has argued that much evidence from the cognitive\nscientific investigation of the visual system corroborates his\ndistinction between P- and A-consciousness. For example, on his\ninterpretation, experiments on change blindness and also the\nneuropsychological investigation of brain-lesioned human patients with\nneglect show that attention and working memory are necessary parts of\nA-consciousness, but not of P-consciousness. What makes a state\nA-conscious is that its content is made available to various cognitive\nsystems (e.g., attention and memory). Furthermore, not unless a visual\nstimulus is attended and stored in working memory can an individual\nreport having seen it. But Block (2007) takes the evidence to show\nthat an individual can be P-conscious of the content of an\nunreportable stimulus, i.e. a stimulus whose content has not been\neither attended or stored in working memory. For supporting arguments,\nsee Dretske (2004, 2007). Block’s interpretation of the\ncognitive scientific data has been criticized by scientific advocates\nof the so-called “global neuronal workspace model” of\nconsciousness: see e.g., Dehaene et al. (2006) and Naccache and\nDehaene (2007), which is a commentary to Block (2007). The global\nneuronal workspace model of consciousness nicely fits with\nDennett’s (1991, 2005) position on intentionality and\nconsciousness (which he has himself dubbed the “fame (in the\nbrain) theory of consciousness.” (For further discussion of\nthese issues, see the SEP entry on\n attention.)\n\nOn the one hand, the notion of transitive creature consciousness seems\nlike a close cousin to the notion of intentionality. On the other\nhand, what makes a person’s mental state A-conscious is that the\nperson may have access to it. Presumably, a person may have conscious\naccess to one of her A-conscious mental states in virtue of having\nsome other mental state (e.g., a thought or belief) directed to it. So\nhaving states with intentionality seems like a condition for any\nmental state to be A-conscious. It follows that if the problem of\nconsciousness is to be clearly distinguished from the problem of\nintentionality, the key question is that of explaining how a mental\nstate can be P-conscious.\n\nMany philosophers do not accept Brentano’s third thesis that\nintentionality is the mark of all mental states. They do not reject\nBrentano’s second thesis on the grounds that intentionality can\nbe exhibited by some non-mental things. They reject it because, like\nBlock (1996) and Peacocke (1983), they subscribe to a view that can be\ncalled ‘anti-intentionalism,’ according to which a\nperson’s conscious mental state has a phenomenal character that\ncannot be accounted either by its own intentionality (if it has any)\nor by the intentionality of some other of his or her mental states.\nNor do they embrace Rorty’s irrealist attitude towards the\nmental. Some of the philosophers, who fall under the label\n‘anti-intentionalism,’ may accept the thesis that\nintentionality and the mental happen to coincide. But since they claim\nthat intentionality in turn derives from phenomenal consciousness,\nthey are not quite faithful to the spirit of Brentano’s thesis\nthat intentionality is the constitutive feature of the mental.\n\nThe anti-intentionalists, who reject both Rorty’s irrealism and\nBrentano’s thesis that intentionality is the true mark of the\nmental, can be divided into two groups. Some, like Ned Block (1995,\n1996), would accept a dual view according to which mental\nstates fall into a division between intentional states and phenomenal\nstates. As we shall see momentarily, this division is denied by the\nintentionalists. In between the intentionalists and the phenomenal\nrealists, who accept the dual view, lies the intermediate view of\nphilosophers such as Colin McGinn (1989), Sydney Shoemaker (1996) and\nCharles Siewert (1998), who see an intimate connection between\nintentional and phenomenal states.\n\nOther anti-intentionalists, like John Searle (1990, 1992) and Galen\nStrawson (1994), go one step further and reject both Brentano’s\nthesis and the dual view of the mind. They hold consciousness to be\nthe true criterion of the mental. Arguably, as noted above, they might\naccept the thesis that intentionality coincides with the mental, but\nthey hold the view that intentionality derives from consciousness. On\nthe one hand, Strawson (1994) clearly holds phenomenal consciousness\nto be the true criterion of the mental. On the other hand, Searle\n(1992) embraces what he calls “the Connection principle,”\naccording to which unless a mental state is available to\nconsciousness, it does not qualify as genuinely mental. As a result,\nSearle (1992) seems to endorse the view that availability to\nconsciousness is the criterion of the mental. Now, the view that\navailability to consciousness is the true criterion of the mental\nentails that states and processes that are investigated by cognitive\nscience and that are unavailable to consciousness will fail to qualify\nas genuine mental states. This view has been vigorously disputed by\nChomsky (2000). On the natural assumption that beliefs are\nparadigmatic mental states, the view that phenomenal consciousness is\nthe true criterion of the mental further entails that there is\nsomething it is like to have such a propositional attitude as\nbelieving that 5 is a prime number—a consequence some find\ndoubtful. If there was nothing it is like to believe that 5 is a prime\nnumber, then, according to the view that phenomenal consciousness is\nthe criterion of the mental, many propositional attitudes would fail\nto qualify as genuine mental states. However, much recent work in the\nphilosophy of mind has been recently devoted to the defense of\nso-called \"cognitive phenomenology,\" according to which there is\nsomething it is like to believe that e.g., 5 is a prime number. See\nthe SEP entry on consciousness and the papers collected in Bayne and\nMontague (eds.) (2011).\n\nMany of the philosophers who accept a version of Brentano’s\nthesis that all mental states exhibit intentionality try to show that\nthe mysteries of phenomenal consciousness can either be explained away\n(i.e., dissolved) or that phenomenal consciousness derives from\nintentionality. Daniel Dennett (1988, 1991, 2001) has been the most\nconsistent advocate of the view that the distinction between\nphenomenal consciousness and access consciousness has been overrated\nand that qualia ought to be ‘quined,’ i.e.,\nresolutely denied and dispensed with.\n\nSo-called “intentionalists” are philosophers who think\nthat phenomenal consciousness can really be explained by\nintentionality because they think that phenomenal states are\nintentional states. On the intentionalist account, the phenomenal\nqualities of an experience are the properties that objects are\nrepresented as having in the experience. Some intentionalists, like\nFred Dretske (1995) and Michael Tye (1995), think that whereas\nthoughts and propositional attitudes are mental representations with\nconceptual content, qualia or conscious experiences are\nmental representations with nonconceptual content (about\nwhich see Dretske 1981, Peacocke 1992, 2001 and the essays in Crane\n1992). On their view, to have phenomenal features is to have a certain\nsort of nonconceptual content. On Tye’s (1995) view, for\nexample, pains are mental representations of bodily parts and the\nphenomenal experience of a pain is the nonconceptual content of the\nbodily representation. Other intentionalists such as Elizabeth\nAnscombe (1965) and especially John McDowell (1994), who are skeptical\nof the distinction between conceptual and nonconceptual content, will\nappeal to other criteria, e.g., functional role, to account for\nphenomenal states (see the SEP entry on Nonconceptual mental content).\nFor example, McDowell (1994) argues that the phenomenal content of\nexperience can be explained in terms of a suitable notion of\ndemonstrative conceptual content.\n\nThere are currently two outstanding issues facing an intentionalist\napproach to phenomenal experiences. The first is whether the\nintentionalist account can be extended to the phenomenal character of\nall sensory and bodily experiences. This is at present an open\nquestion (cf. Crane, 2007). The second issue is whether the\nnonconceptual content of perceptual experiences can be objective in\nrepresenting and referring to particular objects, or whether only\nconceptual thoughts can be objective and represent or refer to\nparticular objects. On the one hand, Evans (1982), Dretske (1981,\n1995) and Peacocke (1992) assume that propositional thought or\nconceptual content is required to achieve reference to particulars. On\nthe other hand, Burge (2010) has offered powerful considerations\n(mostly derived from perceptual psychology) in favor of the\nobjectivity of purely perceptual representations. On Burge’s\nview, perceptual representations are both sensory and objective\nrepresentations of the environment. Their nonconceptual content need\nnot be supplemented by intellectualized (higher-order) representations\nof what makes a representation objective in order to provide objective\nrepresentations of particulars.\n\nFinally, according to David Rosenthal’s “higher-order\nthought” theory of consciousness, what makes a person’s\nmental state conscious is that the person is conscious of it by virtue\nof having formed a higher-order thought (or HOT) about it.\nFurthermore, the phenomenal character of a person’s sensory\nexperience—what it is like for the person to be in that\nstate—arises from the fact that the person has formed a HOT\nabout it. The problem with the HOT theory of phenomenal consciousness\nis that the theory entails that creatures who, like non-human animals\nand human babies, lack the ability to form HOTs will be deprived of\nphenomenal consciousness—a consequence many will find\nimplausible (cf. Rosenthal, 1986, 2005). For further discussion, see\nthe SEP entries on\n consciousness and intentionality\n and\n higher-order theories of consciousness.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Adams, F., and Aizawa, K., 2001, “The bounds of\ncognition”, <em>Philosophical Psychology</em>, 14 (1):\n43–64.",
                "Anscombe, G.E.M., 1957, <em>Intention</em>, Oxford:\nBlackwell.",
                "–––, 1965, “The intentionality of\nsensation: a grammatical feature,” reprinted in A. No‘,\nand E. Thompson (eds.), <em>Vision and Mind, Selected Readings in the\nPhilosophy of Perception</em>, Cambridge, Mass.: MIT Press, 2002.",
                "Baker, L.R., 1993, “Metaphysics and mental causation,”\nin J. Heil and A. Mele (eds.), <em>Mental Causation</em>, Oxford:\nClarendon Press.",
                "Bayne, T., and Montague, M. (eds.), 2011, <em>Cognitive\nPhenomenology</em>, Oxford and New York: Oxford University Press.",
                "Bell, D., 1990, <em>Husserl</em>, London: Routledge and Kegan\nPaul.",
                "Block, N., 1995, “On a confusion about a function of\nconsciousness,” in N. Block, O. Flanagan, and G. Güzeldere\n(eds.), <em>The Nature of Consciousness</em>, Cambridge, Mass.: MIT\nPress.",
                "–––, 1996, “Mental Paint and Mental\nLatex,” in E. Villenueva, (ed.) <em>Philosophical Issues 7</em>,\nNorthridge: Ridgeview Publishing Company.",
                "–––, 2007, “Consciousness, accessibility,\nand the mesh between psychology and neuroscience”,\n<em>Behavioral and Brain Sciences</em>, 30: 481–538.",
                "Brentano, F., 1874 [1911, 1973, 1995], <em>Psychology from an\nEmpirical Standpoint</em>, London: Routledge and Kegan Paul.",
                "Burge, T., 1977, “Belief <em>de re</em>,” <em>Journal\nof Philosophy</em>, 74: 338–62.",
                "–––, 1979, “Individualism and the\nmental,” reprinted in D. Chalmers (ed.), <em>Philosophy of Mind,\nClassical and Contemporary Readings</em>, Oxford: Oxford University\nPress, 2002.",
                "–––, 1982, “Other bodies,” in A.\nWoodfield, (ed.), <em>Thought and Object</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 1986, “Individualism and\npsychology,” <em>Philosophical Review</em>, 95: 3–46.",
                "–––, 1993, “Mind-Body causation and\nexplanatory practice,” in J. Heil and A. Mele (eds.), <em>Mental\nCausation</em>, Oxford: Clarendon Press.",
                "–––, 2010, <em>Origins of Objectivity</em>,\nOxford: Oxford University Press.",
                "Carnap, R., 1947, <em>Meaning and Necessity</em>, Chicago: Chicago\nUniversity Press.",
                "Chalmers, D., 1996, <em>The Conscious Mind</em>, Oxford: Oxford\nUniversity Press.",
                "––– (ed.), 2002, <em>Philosophy of Mind,\nClassical and Contemporary Readings</em>, Oxford: Oxford University\nPress.",
                "Chisholm, R. M., 1956, <em>Perceiving: a Philosophical Study</em>,\nreprinted in D. Rosenthal (ed.), <em>The Nature of Mind</em>, Oxford:\nOxford University Press, 1990.",
                "Chomsky, N., 2000, <em>New Horizons in the Study of Language and\nMind</em>, Cambridge: Cambridge University Press.",
                "Church, A., 1956, <em>Introduction to Mathematical Logic</em>\n(Volume 1), Princeton, N.J.: Princeton University Press.",
                "Churchland, P.M., 1989, <em>A Neurocomputational Perspective, The\nNature of Mind and the Structure of Science</em>, Cambridge, Mass.:\nMIT Press.",
                "Clark, A. and Chalmers, D., 1998, “The extended mind,”\n<em>Analysis</em>, 58 (1): 7–19.",
                "Clark, A., 2008, <em>Supersizing the Mind, Embodiment, Action, and\nCognitive Extension</em>, Oxford: Oxford University Press.",
                "Crane, T. (ed.), 1992, <em>The Contents of Experience, Essays on\nPerception</em>, Cambridge: Cambridge University Press.",
                "–––, 1998, “Intentionality as the mark of\nthe mental,” in A. O’Hear (ed.), <em>Contemporary Issues\nin the Philosophy of Mind</em>, Cambridge: Cambridge University\nPress.",
                "–––, 2003, <em>Elements of Mind, an Introduction\nto the Philosophy of Mind</em>, Oxford: Oxford University Press.",
                "–––, 2007, “Intentionalism,” in A.\nBeckermann and P. McLaughlin (eds.), <em>Oxford Handbook to the\nPhilosophy of Mind</em>, Oxford: Oxford University Press.",
                "–––, 2013, <em>The Objects of Thought</em>,\nOxford: Oxford University Press.",
                "Davidson, D., 1980, <em>Essays on Events and Actions</em>, Oxford:\nClarendon Press.",
                "Dehaene, S., 2014, <em>Consciousness and the Brain</em>, New York:\nPenguin.",
                "Dehaene, S., Changeux, J.-P., Naccache, L., Sackur, J. and\nSergent, C., 2006, “Conscious, preconscious, and subliminal\nprocessing: a testable taxonomy,” <em>Trends in Cognitive\nSciences</em>, 10: 204–211.",
                "Dennett, D.C., 1969, <em>Content and Consciousness</em>, London:\nRoutledge and Kean Paul.",
                "–––, 1978, <em>Brainstorms, Philosophical Essays\non Mind and Psychology</em>, Montgomery, VT: Bradford Books.",
                "–––, 1987, <em>The Intentional Stance</em>,\nCambridge, Mass.: MIT Press.",
                "–––, 1988, “Quining qualia,” in D.\nChalmers (ed.), <em>Philosophy of Mind, Classical and Contemporary\nReadings</em>, Oxford: Oxford University Press, 2002.",
                "–––, 1991, <em>Consciousness Explained</em>,\nBoston: Little Brown.",
                "–––, 1996, <em>Kinds of Mind</em>, New York:\nNorton.",
                "–––, 2005, <em>Sweet Dreams: Philosophical\nObstacles to a Science of Consciousness</em>, Cambridge, Mass.: MIT\nPress.",
                "–––, 2017, <em>From Bacteria to Bach and Back\nAgain</em>, New York: Basic Books.",
                "Dretske, F., 1969, <em>Seeing and Knowing</em>, London: Routledge\nand Kegan Paul.",
                "–––, 1980, “The intentionality of\ncognitive states,” in D. Rosenthal (ed.), <em>The Nature of\nMind</em>, Oxford: Oxford University Press, 1990.",
                "–––, 1981, <em>Knowledge and the Flow of\nInformation</em>, Cambridge, Mass.: MIT Press.",
                "–––, 1988, <em>Explaining Behavior</em>,\nCambridge, Mass.: MIT Press.",
                "–––, 1995, <em>Naturalizing the Mind</em>,\nCambridge, Mass.: MIT Press.",
                "–––, 2004, “Change blindness,”\n<em>Philosophical Studies</em>, 120: 1–18.",
                "–––, 2007, “What change blindness teaches\nabout consciousness,” <em>Philosophical Perspectives</em>, 21\n(1): 215–220.",
                "Dreyfus, H.L. (ed.), 1982, <em>Husserl, Intentionality and\nCognitive Science</em>, Cambridge, Mass.: MIT Press.",
                "Dummett, M., 1973, <em>Frege: Philosophy of Language</em>, New\nYork: Harper and Row.",
                "–––, 1991, “Frege and Husserl on\nreference,” in M. Dummett <em>The Seas of Language</em>, Oxford:\nOxford University Press, 1993.",
                "Evans, G., 1982, <em>The Varieties of Reference</em>, Oxford: The\nClarendon Press.",
                "Field, H., 1978, “Mental representation,” in N. Block,\n(ed.), <em>Readings in the Philosophy of Psychology</em>, Cambridge,\nMass.: Harvard University Press, 1990.",
                "Fodor, J.A., 1981, “Methodological solipsism considered as a\nresearch strategy in cognitive psychology,” in D. Rosenthal\n(ed.), <em>The Nature of Mind</em>, Oxford: Oxford University Press,\n1990.",
                "–––, 1975, <em>The Language of Thought</em>, New\nYork: Crowell.",
                "–––, 1987, <em>Psychosemantics</em>, Cambridge,\nMass.: MIT Press.",
                "–––, 1994, <em>The Elm and the Expert</em>,\nCambridge, Mass.: MIT Press.",
                "–––, 1998, <em>Concepts: Where Cognitive Science\nWent Wrong</em>, New York: Oxford University Press.",
                "–––, 2008, <em>LOT2: The Language of Thought\nRevisited</em>, Oxford: Oxford University Press.",
                "Føllesdal, D., 1982a, “Brentano and Husserl on\nintentional objects,” in H.L. Dreyfus (ed.), <em>The Nature of\nMind</em>, Oxford: Oxford University Press.",
                "–––, 1982b, “Husserl’s notion of\n<em>Noema</em>,” in H.L. Dreyfus (ed.), <em>The Nature of\nMind</em>, Oxford: Oxford University Press.",
                "Frege, G., 1892 [1952], “On sense and reference,” in\nP. Geach and M. Black (eds.), <em>Philosophical Writings of Gottlob\nFrege</em>, Oxford: Blackwell, 1952.",
                "Grice, P., 1957, “Meaning,” reprinted in P. Grice,\n<em>Studies in the Way of Words</em>, Cambridge, Mass.: Harvard\nUniversity, 1989.",
                "Guttenplan, S. (ed.), 1994, <em>A Companion Volume to the\nPhilosophy of Mind</em>, Oxford: Blackwell.",
                "Haugeland, J., 1981, “Semantic Engines: an Introduction to\nMind Design,” in J. Haugeland (ed.), <em>Mind Design,\nphilosophy, Psychology, Artificial Intelligence</em>, Cambridge,\nMass.: MIT Press, 1981.",
                "–––, 1995, “Mind embodied and\nembedded,” reprinted in J. Haugeland, J. <em>Having Thought:\nEssays in the Metaphysics of Mind</em>, Cambridge, MA: Harvard\nUniversity Press, 1998.",
                "Husserl, E. 1900 [1970], <em>Logical Investigations</em> (English\ntranslation by J.N. Findlay), London: Routledge and Kegan Paul.",
                "–––, 1913, <em>Ideen zu einer\nPhänomenologie und phänomenologischen Philosophie</em>,\nHalle: Niemeyer.",
                "Jacob, P., 1997, <em>What Minds Can Do</em>, Cambridge: Cambridge\nUniversity Press.",
                "Jeshion, R. (ed.), 2010, <em>New Essays on Singular Thought</em>,\nOxford: Oxford University Press.",
                "Kaplan, D., 1978, “Dthat,” in P. French, T. Uehling,\nand H. Wettstein (eds.), <em>Contemporary Perspectives in the\nPhilosophy of Language</em>, Minneapolis: University of Minnesota\nPress, 1979.",
                "–––, 1989, “Demonstratives,” in J.\nAlmog, H. Wettstein, and J. Perry (eds.), <em>Themes from Kaplan</em>,\nOxford: Oxford University Press.",
                "Kim, J., 1993, <em>Mind and Supervenience</em>, Cambridge:\nCambridge University Press.",
                "–––, 1998, <em>Mind in a Physical World</em>,\nCambridge, Mass.: MIT Press.",
                "Kingsbury, J., Ryder, D. and Williford, K. (eds.), 2011,\n<em>Millikan and Her Critics</em>, Oxford: Blackwell.",
                "Kistler, M., 2000, “Source and channel in the informational\ntheory of mental content,” <em>Facta philosophica</em>, 2 (2):\n213–235.",
                "Kripke, S. 1972 [1980], <em>Naming and Necessity</em>, Oxford:\nBlackwell.",
                "–––, 1979, “A puzzle about belief,”\nin A. Margalit (ed.), <em>Meaning and Use</em>, Dordrecht: Reidel,\n1979.",
                "–––, 1982, <em>Wittgenstein on Rules and Private\nLanguage</em>, Oxford: Blackwell.",
                "Loewer, B., 1987, “From information to\nintentionality,” <em>Synthese</em>, 70: 287–317.",
                "–––, 1997, “A guide to naturalizing\nsemantics”, in B. Hale and C. Wright (eds.), <em>A Companion\nVolume to the Philosophy of Language</em>, Oxford: Blackwell,\n1997.",
                "MacDonald, G. and Papineau, D. (eds.), 2006, <em>Teleosemantics:\nNew Philosophical Essays</em>, Oxford: Oxford University Press.",
                "Mally, E., 1912, <em>Gegenstandtheoretische Grundlagen der Logik\nund Logistik</em>, Leipzig: Barth.",
                "McDowell, J., 1984, “<em>De re</em> sense,” in C.\nWright (ed.), <em>Frege, Tradition &amp; Influence</em>, Oxford:\nBlackwell.",
                "–––, 1994, <em>Mind and World</em>, Cambridge,\nMass.: Harvard University Press.",
                "McGinn, C., 1989, <em>Mental Content</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 1990, <em>Problems of Consciousness</em>,\nOxford: Blackwell.",
                "Meinong, A., 1904, “Über Gegenstandtheorie”\n(English translation: “The theory of objects”), in R.\nChisholm (ed.), <em>Realism and the Background of Phenomenology</em>,\nGlencoe: The Free Press, 1960.",
                "Mill, J.S., 1884, <em>A System of Logic, Ratiocinative and\nInductive: Being a Connected View of the Principles of Evidence and\nthe Methods of Scientific Investigation</em>, New York: Harper.",
                "Millikan, R.G., 1984, <em>Language, Thought and Other Biological\nObjects</em>, Cambridge, Mass.: MIT Press.",
                "–––, 1993, <em>White Queen Psychology and Other\nEssays</em>, Cambridge, Mass.: MIT Press.",
                "–––, 2000, <em>On Clear and Confused Ideas</em>,\nCambridge: Cambridge University Press.",
                "–––, 2004, <em>Varieties of Meaning: the 2002\nJean-Nicod Lectures</em>, Cambridge, Mass.: MIT Press.",
                "–––, 2005, <em>Language</em><em>: a Biological\nModel</em>, Oxford: Oxford University Press.",
                "–––, 2017, <em> Beyond Concepts: Unicepts,\nLanguage, and Natural Information</em>, Oxford: Oxford University\nPress.",
                "Naccache, L. and Dehaene, S., 2007, “Reportability and\nillusions of phenomenality in the light of the global neuronal\nworkspace model”, <em>Behavioral and Brain Sciences</em>, 30:\n518–520.",
                "Neander, K., 1995, “Misrepresenting and\nmalfunctioning,” <em>Philosophical Studies</em>, 79:\n109–41.",
                "–––, 2017, <em>A Mark of the Mental</em>,\nCambridge, Mass.: MIT Press.",
                "Parsons, T., 1980, <em>Nonexistent Objects</em>, New Haven: Yale\nUniversity Press.",
                "Peacocke, C., 1983, <em>Sense and Content: Experience, Thought and\ntheir Relations</em>, Oxford: Oxford University Press.",
                "–––, 1992, <em>A Study of Concepts</em>,\nCambridge, Mass.: MIT Press.",
                "–––, 2001, “Does perception have\nnonconceptual content?” <em>The Journal of Philosophy</em>, 98:\n239–64.",
                "Perry, J., 1993, <em>The Essential Indexical and Other\nEssays</em>, Oxford: Oxford University Press.",
                "–––, 1994, “Intentionality (2),” in\nS. Guttenplan, (ed.), <em>A Companion Volume to the Philosophy of\nMind</em>, Oxford: Blackwell, 1994.",
                "Premack, D.G. and Woodruff, G., 1978, “Does the chimpanzee\nhave a theory of mind?” <em>Behavioral and Brain Sciences</em>,\n1: 515–526.",
                "Putnam, H., 1974, “The meaning of\n‘meaning’,” in H. Putnam, <em>Philosophical\nPapers</em>, vol. II, <em>Language, Mind and Reality</em>, Cambridge:\nCambridge University Press, 1975.",
                "–––, 1986, “Information and the\nmental,” in E. LePore (ed.), <em>Truth and Interpretation,\nPerspectives on the Philosophy of Donald Davidson</em>, Oxford:\nBlackwell, 1986.",
                "–––, 1988, <em>Representation and Reality</em>,\nCambridge, Mass.: MIT Press.",
                "–––, 1994, <em>Renewing Philosophy</em>,\nCambridge, Mass.: Harvard University Press.",
                "Quine, W.V.O., 1948, “On what there is,” reprinted in\nW.V.O. Quine, <em>From a Logical Point of View</em>, Cambridge, Mass.:\nHarvard University Press, 1953.",
                "–––, 1960, <em>Word and Object</em>, Cambridge,\nMass.: MIT Press.",
                "Recanati, F., 2010, “Singular thought: In defence of\nacquaintance,” in R. Jeshion (ed.), <em>New Essays on Singular\nThought</em>, Oxford: Oxford University Press.",
                "Richard, M., 1990, <em>Propositional Attitudes</em>, Cambridge:\nCambridge University Press.",
                "Rorty, R., 1979, <em>Philosophy and the Mirror of Nature</em>,\nOxford: Blackwell.",
                "Rosenthal, D., 1986, “Two concepts of consciousness,”\nin D. Rosenthal (ed.), <em>The Nature of Mind</em>, Oxford: Oxford\nUniversity Press, 1990.",
                "––– (ed.), 1990, <em>The Nature of Mind</em>,\nOxford: Oxford University Press.",
                "–––, 2005, <em>Consciousness and Mind</em>,\nOxford: Oxford University Press.",
                "Rowlands, M., 1999, <em>The Body in Mind</em>, Cambridge:\nCambridge University Press.",
                "Russell, B., 1903 [1964], <em>The Principles of Mathematics</em>,\nLondon: George Allen and Unwin.",
                "–––, 1905 [1956], “On denoting,” in\nR. Marsh (ed.), <em>Bertrand Russell, Logic and Knowledge, Essays\n1901–1950</em>, New York: Capricorn Books, 1956.",
                "–––, 1911, <em>The Problems of\nPhilosophy</em>,",
                "–––, 1919, <em>Introduction to Mathematical\nPhilosophy</em>, London: Allen and Unwin.",
                "Salmon, N., 1986, <em>Frege’s Puzzle</em>, Cambridge, Mass.:\nMIT Press.",
                "Searle, J., 1980, “Minds, brains and programs,”\n<em>The Behavioral and Brain Sciences</em>, 3 (3): 417–24.",
                "–––, 1983, <em>Intentionality</em>, Cambridge:\nCambridge University Press.",
                "–––, 1992, <em>The Rediscovery of the Mind</em>,\nCambridge, Mass.: MIT Press.",
                "–––, 1994, “Intentionality (1),” in\nS. Guttenplan (ed.), <em>A Companion Volume to the Philosophy of\nMind</em>, Oxford: Blackwell.",
                "Shea, N., 2018, <em>Representation in Cognitive Science</em>,\nOxford: Oxford University Press.",
                "Shoemaker, S., 1996, <em>The First-Person Perspective and Other\nEssays</em>, Cambridge: Cambridge University Press.",
                "Siewert, C., 1998, <em>The Significance of Consciousness</em>,\nPrinceton: Princeton University Press.",
                "Smith, B., 1994, <em>Austrian Philosophy, the Legacy of Franz\nBrentano</em>, Chicago and La Salle, Ill.: Open Court.\n [<a href=\"http://ontology.buffalo.edu/smith/book/austrian_philosophy/\" target=\"other\">Preprint available online</a>]",
                "Stich, S., 1983, <em>From Folk Psychology to Cognitive Science,\nthe Case Against Belief</em>, Cambridge, Mass.: MIT Press.",
                "Strawson, G., 1994, <em>Mental Reality</em>, Cambridge, Mass.: MIT\nPress.",
                "Tye, M., 1995, <em>Ten Problems of Consciousness</em>, Cambridge,\nMass.: MIT Press.",
                "Zalta, E.N., 1988, <em>Intensional Logic and the Metaphysics of\nIntentionality</em>, Cambridge, Mass.: MIT Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Adams, F., and Aizawa, K., 2001, “The bounds of\ncognition”, <em>Philosophical Psychology</em>, 14 (1):\n43–64.</li>\n<li>Anscombe, G.E.M., 1957, <em>Intention</em>, Oxford:\nBlackwell.</li>\n<li>–––, 1965, “The intentionality of\nsensation: a grammatical feature,” reprinted in A. No‘,\nand E. Thompson (eds.), <em>Vision and Mind, Selected Readings in the\nPhilosophy of Perception</em>, Cambridge, Mass.: MIT Press, 2002.</li>\n<li>Baker, L.R., 1993, “Metaphysics and mental causation,”\nin J. Heil and A. Mele (eds.), <em>Mental Causation</em>, Oxford:\nClarendon Press.</li>\n<li>Bayne, T., and Montague, M. (eds.), 2011, <em>Cognitive\nPhenomenology</em>, Oxford and New York: Oxford University Press.</li>\n<li>Bell, D., 1990, <em>Husserl</em>, London: Routledge and Kegan\nPaul.</li>\n<li>Block, N., 1995, “On a confusion about a function of\nconsciousness,” in N. Block, O. Flanagan, and G. Güzeldere\n(eds.), <em>The Nature of Consciousness</em>, Cambridge, Mass.: MIT\nPress.</li>\n<li>–––, 1996, “Mental Paint and Mental\nLatex,” in E. Villenueva, (ed.) <em>Philosophical Issues 7</em>,\nNorthridge: Ridgeview Publishing Company.</li>\n<li>–––, 2007, “Consciousness, accessibility,\nand the mesh between psychology and neuroscience”,\n<em>Behavioral and Brain Sciences</em>, 30: 481–538.</li>\n<li>Brentano, F., 1874 [1911, 1973, 1995], <em>Psychology from an\nEmpirical Standpoint</em>, London: Routledge and Kegan Paul.</li>\n<li>Burge, T., 1977, “Belief <em>de re</em>,” <em>Journal\nof Philosophy</em>, 74: 338–62.</li>\n<li>–––, 1979, “Individualism and the\nmental,” reprinted in D. Chalmers (ed.), <em>Philosophy of Mind,\nClassical and Contemporary Readings</em>, Oxford: Oxford University\nPress, 2002.</li>\n<li>–––, 1982, “Other bodies,” in A.\nWoodfield, (ed.), <em>Thought and Object</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 1986, “Individualism and\npsychology,” <em>Philosophical Review</em>, 95: 3–46.</li>\n<li>–––, 1993, “Mind-Body causation and\nexplanatory practice,” in J. Heil and A. Mele (eds.), <em>Mental\nCausation</em>, Oxford: Clarendon Press.</li>\n<li>–––, 2010, <em>Origins of Objectivity</em>,\nOxford: Oxford University Press.</li>\n<li>Carnap, R., 1947, <em>Meaning and Necessity</em>, Chicago: Chicago\nUniversity Press.</li>\n<li>Chalmers, D., 1996, <em>The Conscious Mind</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>––– (ed.), 2002, <em>Philosophy of Mind,\nClassical and Contemporary Readings</em>, Oxford: Oxford University\nPress.</li>\n<li>Chisholm, R. M., 1956, <em>Perceiving: a Philosophical Study</em>,\nreprinted in D. Rosenthal (ed.), <em>The Nature of Mind</em>, Oxford:\nOxford University Press, 1990.</li>\n<li>Chomsky, N., 2000, <em>New Horizons in the Study of Language and\nMind</em>, Cambridge: Cambridge University Press.</li>\n<li>Church, A., 1956, <em>Introduction to Mathematical Logic</em>\n(Volume 1), Princeton, N.J.: Princeton University Press.</li>\n<li>Churchland, P.M., 1989, <em>A Neurocomputational Perspective, The\nNature of Mind and the Structure of Science</em>, Cambridge, Mass.:\nMIT Press.</li>\n<li>Clark, A. and Chalmers, D., 1998, “The extended mind,”\n<em>Analysis</em>, 58 (1): 7–19.</li>\n<li>Clark, A., 2008, <em>Supersizing the Mind, Embodiment, Action, and\nCognitive Extension</em>, Oxford: Oxford University Press.</li>\n<li>Crane, T. (ed.), 1992, <em>The Contents of Experience, Essays on\nPerception</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 1998, “Intentionality as the mark of\nthe mental,” in A. O’Hear (ed.), <em>Contemporary Issues\nin the Philosophy of Mind</em>, Cambridge: Cambridge University\nPress.</li>\n<li>–––, 2003, <em>Elements of Mind, an Introduction\nto the Philosophy of Mind</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2007, “Intentionalism,” in A.\nBeckermann and P. McLaughlin (eds.), <em>Oxford Handbook to the\nPhilosophy of Mind</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2013, <em>The Objects of Thought</em>,\nOxford: Oxford University Press.</li>\n<li>Davidson, D., 1980, <em>Essays on Events and Actions</em>, Oxford:\nClarendon Press.</li>\n<li>Dehaene, S., 2014, <em>Consciousness and the Brain</em>, New York:\nPenguin.</li>\n<li>Dehaene, S., Changeux, J.-P., Naccache, L., Sackur, J. and\nSergent, C., 2006, “Conscious, preconscious, and subliminal\nprocessing: a testable taxonomy,” <em>Trends in Cognitive\nSciences</em>, 10: 204–211.</li>\n<li>Dennett, D.C., 1969, <em>Content and Consciousness</em>, London:\nRoutledge and Kean Paul.</li>\n<li>–––, 1978, <em>Brainstorms, Philosophical Essays\non Mind and Psychology</em>, Montgomery, VT: Bradford Books.</li>\n<li>–––, 1987, <em>The Intentional Stance</em>,\nCambridge, Mass.: MIT Press.</li>\n<li>–––, 1988, “Quining qualia,” in D.\nChalmers (ed.), <em>Philosophy of Mind, Classical and Contemporary\nReadings</em>, Oxford: Oxford University Press, 2002.</li>\n<li>–––, 1991, <em>Consciousness Explained</em>,\nBoston: Little Brown.</li>\n<li>–––, 1996, <em>Kinds of Mind</em>, New York:\nNorton.</li>\n<li>–––, 2005, <em>Sweet Dreams: Philosophical\nObstacles to a Science of Consciousness</em>, Cambridge, Mass.: MIT\nPress.</li>\n<li>–––, 2017, <em>From Bacteria to Bach and Back\nAgain</em>, New York: Basic Books.</li>\n<li>Dretske, F., 1969, <em>Seeing and Knowing</em>, London: Routledge\nand Kegan Paul.</li>\n<li>–––, 1980, “The intentionality of\ncognitive states,” in D. Rosenthal (ed.), <em>The Nature of\nMind</em>, Oxford: Oxford University Press, 1990.</li>\n<li>–––, 1981, <em>Knowledge and the Flow of\nInformation</em>, Cambridge, Mass.: MIT Press.</li>\n<li>–––, 1988, <em>Explaining Behavior</em>,\nCambridge, Mass.: MIT Press.</li>\n<li>–––, 1995, <em>Naturalizing the Mind</em>,\nCambridge, Mass.: MIT Press.</li>\n<li>–––, 2004, “Change blindness,”\n<em>Philosophical Studies</em>, 120: 1–18.</li>\n<li>–––, 2007, “What change blindness teaches\nabout consciousness,” <em>Philosophical Perspectives</em>, 21\n(1): 215–220.</li>\n<li>Dreyfus, H.L. (ed.), 1982, <em>Husserl, Intentionality and\nCognitive Science</em>, Cambridge, Mass.: MIT Press.</li>\n<li>Dummett, M., 1973, <em>Frege: Philosophy of Language</em>, New\nYork: Harper and Row.</li>\n<li>–––, 1991, “Frege and Husserl on\nreference,” in M. Dummett <em>The Seas of Language</em>, Oxford:\nOxford University Press, 1993.</li>\n<li>Evans, G., 1982, <em>The Varieties of Reference</em>, Oxford: The\nClarendon Press.</li>\n<li>Field, H., 1978, “Mental representation,” in N. Block,\n(ed.), <em>Readings in the Philosophy of Psychology</em>, Cambridge,\nMass.: Harvard University Press, 1990.</li>\n<li>Fodor, J.A., 1981, “Methodological solipsism considered as a\nresearch strategy in cognitive psychology,” in D. Rosenthal\n(ed.), <em>The Nature of Mind</em>, Oxford: Oxford University Press,\n1990.</li>\n<li>–––, 1975, <em>The Language of Thought</em>, New\nYork: Crowell.</li>\n<li>–––, 1987, <em>Psychosemantics</em>, Cambridge,\nMass.: MIT Press.</li>\n<li>–––, 1994, <em>The Elm and the Expert</em>,\nCambridge, Mass.: MIT Press.</li>\n<li>–––, 1998, <em>Concepts: Where Cognitive Science\nWent Wrong</em>, New York: Oxford University Press.</li>\n<li>–––, 2008, <em>LOT2: The Language of Thought\nRevisited</em>, Oxford: Oxford University Press.</li>\n<li>Føllesdal, D., 1982a, “Brentano and Husserl on\nintentional objects,” in H.L. Dreyfus (ed.), <em>The Nature of\nMind</em>, Oxford: Oxford University Press.</li>\n<li>–––, 1982b, “Husserl’s notion of\n<em>Noema</em>,” in H.L. Dreyfus (ed.), <em>The Nature of\nMind</em>, Oxford: Oxford University Press.</li>\n<li>Frege, G., 1892 [1952], “On sense and reference,” in\nP. Geach and M. Black (eds.), <em>Philosophical Writings of Gottlob\nFrege</em>, Oxford: Blackwell, 1952.</li>\n<li>Grice, P., 1957, “Meaning,” reprinted in P. Grice,\n<em>Studies in the Way of Words</em>, Cambridge, Mass.: Harvard\nUniversity, 1989.</li>\n<li>Guttenplan, S. (ed.), 1994, <em>A Companion Volume to the\nPhilosophy of Mind</em>, Oxford: Blackwell.</li>\n<li>Haugeland, J., 1981, “Semantic Engines: an Introduction to\nMind Design,” in J. Haugeland (ed.), <em>Mind Design,\nphilosophy, Psychology, Artificial Intelligence</em>, Cambridge,\nMass.: MIT Press, 1981.</li>\n<li>–––, 1995, “Mind embodied and\nembedded,” reprinted in J. Haugeland, J. <em>Having Thought:\nEssays in the Metaphysics of Mind</em>, Cambridge, MA: Harvard\nUniversity Press, 1998.</li>\n<li>Husserl, E. 1900 [1970], <em>Logical Investigations</em> (English\ntranslation by J.N. Findlay), London: Routledge and Kegan Paul.</li>\n<li>–––, 1913, <em>Ideen zu einer\nPhänomenologie und phänomenologischen Philosophie</em>,\nHalle: Niemeyer.</li>\n<li>Jacob, P., 1997, <em>What Minds Can Do</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Jeshion, R. (ed.), 2010, <em>New Essays on Singular Thought</em>,\nOxford: Oxford University Press.</li>\n<li>Kaplan, D., 1978, “Dthat,” in P. French, T. Uehling,\nand H. Wettstein (eds.), <em>Contemporary Perspectives in the\nPhilosophy of Language</em>, Minneapolis: University of Minnesota\nPress, 1979.</li>\n<li>–––, 1989, “Demonstratives,” in J.\nAlmog, H. Wettstein, and J. Perry (eds.), <em>Themes from Kaplan</em>,\nOxford: Oxford University Press.</li>\n<li>Kim, J., 1993, <em>Mind and Supervenience</em>, Cambridge:\nCambridge University Press.</li>\n<li>–––, 1998, <em>Mind in a Physical World</em>,\nCambridge, Mass.: MIT Press.</li>\n<li>Kingsbury, J., Ryder, D. and Williford, K. (eds.), 2011,\n<em>Millikan and Her Critics</em>, Oxford: Blackwell.</li>\n<li>Kistler, M., 2000, “Source and channel in the informational\ntheory of mental content,” <em>Facta philosophica</em>, 2 (2):\n213–235.</li>\n<li>Kripke, S. 1972 [1980], <em>Naming and Necessity</em>, Oxford:\nBlackwell.</li>\n<li>–––, 1979, “A puzzle about belief,”\nin A. Margalit (ed.), <em>Meaning and Use</em>, Dordrecht: Reidel,\n1979.</li>\n<li>–––, 1982, <em>Wittgenstein on Rules and Private\nLanguage</em>, Oxford: Blackwell.</li>\n<li>Loewer, B., 1987, “From information to\nintentionality,” <em>Synthese</em>, 70: 287–317.</li>\n<li>–––, 1997, “A guide to naturalizing\nsemantics”, in B. Hale and C. Wright (eds.), <em>A Companion\nVolume to the Philosophy of Language</em>, Oxford: Blackwell,\n1997.</li>\n<li>MacDonald, G. and Papineau, D. (eds.), 2006, <em>Teleosemantics:\nNew Philosophical Essays</em>, Oxford: Oxford University Press.</li>\n<li>Mally, E., 1912, <em>Gegenstandtheoretische Grundlagen der Logik\nund Logistik</em>, Leipzig: Barth.</li>\n<li>McDowell, J., 1984, “<em>De re</em> sense,” in C.\nWright (ed.), <em>Frege, Tradition &amp; Influence</em>, Oxford:\nBlackwell.</li>\n<li>–––, 1994, <em>Mind and World</em>, Cambridge,\nMass.: Harvard University Press.</li>\n<li>McGinn, C., 1989, <em>Mental Content</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 1990, <em>Problems of Consciousness</em>,\nOxford: Blackwell.</li>\n<li>Meinong, A., 1904, “Über Gegenstandtheorie”\n(English translation: “The theory of objects”), in R.\nChisholm (ed.), <em>Realism and the Background of Phenomenology</em>,\nGlencoe: The Free Press, 1960.</li>\n<li>Mill, J.S., 1884, <em>A System of Logic, Ratiocinative and\nInductive: Being a Connected View of the Principles of Evidence and\nthe Methods of Scientific Investigation</em>, New York: Harper.</li>\n<li>Millikan, R.G., 1984, <em>Language, Thought and Other Biological\nObjects</em>, Cambridge, Mass.: MIT Press.</li>\n<li>–––, 1993, <em>White Queen Psychology and Other\nEssays</em>, Cambridge, Mass.: MIT Press.</li>\n<li>–––, 2000, <em>On Clear and Confused Ideas</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 2004, <em>Varieties of Meaning: the 2002\nJean-Nicod Lectures</em>, Cambridge, Mass.: MIT Press.</li>\n<li>–––, 2005, <em>Language</em><em>: a Biological\nModel</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2017, <em> Beyond Concepts: Unicepts,\nLanguage, and Natural Information</em>, Oxford: Oxford University\nPress.</li>\n<li>Naccache, L. and Dehaene, S., 2007, “Reportability and\nillusions of phenomenality in the light of the global neuronal\nworkspace model”, <em>Behavioral and Brain Sciences</em>, 30:\n518–520.</li>\n<li>Neander, K., 1995, “Misrepresenting and\nmalfunctioning,” <em>Philosophical Studies</em>, 79:\n109–41.</li>\n<li>–––, 2017, <em>A Mark of the Mental</em>,\nCambridge, Mass.: MIT Press.</li>\n<li>Parsons, T., 1980, <em>Nonexistent Objects</em>, New Haven: Yale\nUniversity Press.</li>\n<li>Peacocke, C., 1983, <em>Sense and Content: Experience, Thought and\ntheir Relations</em>, Oxford: Oxford University Press.</li>\n<li>–––, 1992, <em>A Study of Concepts</em>,\nCambridge, Mass.: MIT Press.</li>\n<li>–––, 2001, “Does perception have\nnonconceptual content?” <em>The Journal of Philosophy</em>, 98:\n239–64.</li>\n<li>Perry, J., 1993, <em>The Essential Indexical and Other\nEssays</em>, Oxford: Oxford University Press.</li>\n<li>–––, 1994, “Intentionality (2),” in\nS. Guttenplan, (ed.), <em>A Companion Volume to the Philosophy of\nMind</em>, Oxford: Blackwell, 1994.</li>\n<li>Premack, D.G. and Woodruff, G., 1978, “Does the chimpanzee\nhave a theory of mind?” <em>Behavioral and Brain Sciences</em>,\n1: 515–526.</li>\n<li>Putnam, H., 1974, “The meaning of\n‘meaning’,” in H. Putnam, <em>Philosophical\nPapers</em>, vol. II, <em>Language, Mind and Reality</em>, Cambridge:\nCambridge University Press, 1975.</li>\n<li>–––, 1986, “Information and the\nmental,” in E. LePore (ed.), <em>Truth and Interpretation,\nPerspectives on the Philosophy of Donald Davidson</em>, Oxford:\nBlackwell, 1986.</li>\n<li>–––, 1988, <em>Representation and Reality</em>,\nCambridge, Mass.: MIT Press.</li>\n<li>–––, 1994, <em>Renewing Philosophy</em>,\nCambridge, Mass.: Harvard University Press.</li>\n<li>Quine, W.V.O., 1948, “On what there is,” reprinted in\nW.V.O. Quine, <em>From a Logical Point of View</em>, Cambridge, Mass.:\nHarvard University Press, 1953.</li>\n<li>–––, 1960, <em>Word and Object</em>, Cambridge,\nMass.: MIT Press.</li>\n<li>Recanati, F., 2010, “Singular thought: In defence of\nacquaintance,” in R. Jeshion (ed.), <em>New Essays on Singular\nThought</em>, Oxford: Oxford University Press.</li>\n<li>Richard, M., 1990, <em>Propositional Attitudes</em>, Cambridge:\nCambridge University Press.</li>\n<li>Rorty, R., 1979, <em>Philosophy and the Mirror of Nature</em>,\nOxford: Blackwell.</li>\n<li>Rosenthal, D., 1986, “Two concepts of consciousness,”\nin D. Rosenthal (ed.), <em>The Nature of Mind</em>, Oxford: Oxford\nUniversity Press, 1990.</li>\n<li>––– (ed.), 1990, <em>The Nature of Mind</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 2005, <em>Consciousness and Mind</em>,\nOxford: Oxford University Press.</li>\n<li>Rowlands, M., 1999, <em>The Body in Mind</em>, Cambridge:\nCambridge University Press.</li>\n<li>Russell, B., 1903 [1964], <em>The Principles of Mathematics</em>,\nLondon: George Allen and Unwin.</li>\n<li>–––, 1905 [1956], “On denoting,” in\nR. Marsh (ed.), <em>Bertrand Russell, Logic and Knowledge, Essays\n1901–1950</em>, New York: Capricorn Books, 1956.</li>\n<li>–––, 1911, <em>The Problems of\nPhilosophy</em>,</li>\n<li>–––, 1919, <em>Introduction to Mathematical\nPhilosophy</em>, London: Allen and Unwin.</li>\n<li>Salmon, N., 1986, <em>Frege’s Puzzle</em>, Cambridge, Mass.:\nMIT Press.</li>\n<li>Searle, J., 1980, “Minds, brains and programs,”\n<em>The Behavioral and Brain Sciences</em>, 3 (3): 417–24.</li>\n<li>–––, 1983, <em>Intentionality</em>, Cambridge:\nCambridge University Press.</li>\n<li>–––, 1992, <em>The Rediscovery of the Mind</em>,\nCambridge, Mass.: MIT Press.</li>\n<li>–––, 1994, “Intentionality (1),” in\nS. Guttenplan (ed.), <em>A Companion Volume to the Philosophy of\nMind</em>, Oxford: Blackwell.</li>\n<li>Shea, N., 2018, <em>Representation in Cognitive Science</em>,\nOxford: Oxford University Press.</li>\n<li>Shoemaker, S., 1996, <em>The First-Person Perspective and Other\nEssays</em>, Cambridge: Cambridge University Press.</li>\n<li>Siewert, C., 1998, <em>The Significance of Consciousness</em>,\nPrinceton: Princeton University Press.</li>\n<li>Smith, B., 1994, <em>Austrian Philosophy, the Legacy of Franz\nBrentano</em>, Chicago and La Salle, Ill.: Open Court.\n [<a href=\"http://ontology.buffalo.edu/smith/book/austrian_philosophy/\" target=\"other\">Preprint available online</a>]</li>\n<li>Stich, S., 1983, <em>From Folk Psychology to Cognitive Science,\nthe Case Against Belief</em>, Cambridge, Mass.: MIT Press.</li>\n<li>Strawson, G., 1994, <em>Mental Reality</em>, Cambridge, Mass.: MIT\nPress.</li>\n<li>Tye, M., 1995, <em>Ten Problems of Consciousness</em>, Cambridge,\nMass.: MIT Press.</li>\n<li>Zalta, E.N., 1988, <em>Intensional Logic and the Metaphysics of\nIntentionality</em>, Cambridge, Mass.: MIT Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "existence",
            "Frege, Gottlob",
            "mental content: causal theories of",
            "mental content: teleological theories of",
            "reference",
            "Russell, Bertrand",
            "teleology: teleological notions in biology"
        ],
        "entry_link": [
            {
                "../existence/": "existence"
            },
            {
                "../frege/": "Frege, Gottlob"
            },
            {
                "../content-causal/": "mental content: causal theories of"
            },
            {
                "../content-teleological/": "mental content: teleological theories of"
            },
            {
                "../reference/": "reference"
            },
            {
                "../russell/": "Russell, Bertrand"
            },
            {
                "../teleology-biology/": "teleology: teleological notions in biology"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=intentionality\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/intentionality/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=intentionality&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/intentionality/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=intentionality": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/intentionality/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=intentionality&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/intentionality/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}