{
    "url": "justice-inequality-health",
    "title": "Justice, Inequality, and Health",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Douglas MacKay\n<dmackay@email.unc.edu>\nGopal Sreenivasan",
        "author_links": [
            {
                "mailto:dmackay%40email%2eunc%2eedu": "dmackay@email.unc.edu"
            },
            {
                "http://gopalsreenivasan.com/": "Gopal Sreenivasan"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\nDouglas MacKay\n&lt;<a href=\"mailto:dmackay%40email%2eunc%2eedu\"><em>dmackay<abbr title=\" at \">@</abbr>email<abbr title=\" dot \">.</abbr>unc<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\n<a href=\"http://gopalsreenivasan.com/\" target=\"other\">Gopal Sreenivasan</a>\n</p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Dec 23, 2008",
        "substantive revision Mon Nov 1, 2021"
    ],
    "preamble": "\n\nAmong American men, there is a 14.6 year difference in life expectancy\nbetween the top 1% and the bottom 1% of the income distribution\n(Chetty et al. 2016). Among American women, the corresponding\ndifference is 10.1 years. In a recent survey, 38.2% of U.S.\nrespondents in the bottom third of the income distribution reported\nfair or poor health, compared to 21.4% of respondents in the middle\nthird, and 12.3% of respondents in the top third (Hero, Zaslavsky,\n& Blendon 2017). These disparities were reduced but not eliminated\nby adjustment for health insurance status.\n\nAmericans also experience health disparities along racial and ethnic\nlines. In 2019, the life expectancy at birth for Hispanic Americans\nwas 81.8 years, while it was 78.8 years for non-Hispanic white\nAmericans, and 74.7 years for non-Hispanic Black Americans (Arias,\nTejada-Vera, & Ahmad 2021). A recent study estimates that the\nCOVID-19 pandemic disproportionately reduced the life expectancy (at\nbirth) for Hispanic and non-Hispanic Black Americans from 2018 to\n2020: 3.88 years for Hispanic Americans, 3.25 years for non-Hispanic\nBlack Americans, compared to 1.36 years for non-Hispanic white\nAmericans (Woolf, Masters, and Aron 2021).\n\nIf one turns to the international context, significant inequalities in\nlife expectancy can be observed between people in low-income and\nhigh-income countries. In 2016, life expectancy in low-income\ncountries was 62.7 years, compared to 80.8 years in high-income\ncountries, a gap of 18.1 years (WHO 2020).\n\nOn the face of it, these inequalities in life expectancy and\nself-reported health are seriously unjust. But whether the appearances\nof injustice here will withstand close scrutiny is a separate\nquestion. Not all inequalities in life expectancy seem unjust. For\nexample, in 2018, life expectancy for all American women was 81.2\nyears, whereas for all American men it was only 76.2 years (Xu et al.\n2020). Presumably, little (if any) of this 5 year inequality in life\nexpectancy represents an injustice. However, if some inequalities in\nhealth are not unjust, then inequalities in health are not unjust\nper se.\n\nSo what makes a health inequality an injustice, when it is one? Do\nhealth inequalities have some significance in justice that\ndiffers from other important inequalities? Or is the injustice of an\nunjust inequality in health simply due to the application of general\nprinciples of equality and justice to the case of health?\n\nTo answer these questions, one has to examine two rather different\nliteratures. On the one hand, there is an empirical literature\nconcerning the underlying determinants of health; on the other hand,\nthere is a philosophical literature concerned with the ethics of\npopulation health. The former literature is considerably more\nextensive and developed than the latter. Even there, however, the\nanswers on offer are hardly complete or fully established.\n",
    "toc": [
        {
            "#Intr": "1. Introduction"
        },
        {
            "#SociGradHeal": "2. A social gradient in health"
        },
        {
            "#OtheSociDeteHeal": "3. Other social determinants of health"
        },
        {
            "#GrouIndi": "4. Groups or individuals?"
        },
        {
            "#CausPath": "5. Causal pathways"
        },
        {
            "#JustDomeHealIneq": "6. Justice and Domestic Health Inequalities"
        },
        {
            "#HealEqui": "6.1 Health Equity"
        },
        {
            "#FreeStanAppr": "6.2 Free-Standing Approaches"
        },
        {
            "#DeriAppr": "6.3 Derivative Approaches"
        },
        {
            "#IndiRespHealBeha": "7. Individual Responsibility and Health Behaviors"
        },
        {
            "#JustGlobHealIneq": "8. Justice and Global Health Inequalities"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Introduction\n\nOne possible explanation for health disparities among the rich and\npoor is that the rich can afford better health care. Were this\nexplanation correct, questions regarding the justice of health\ninequalities could be answered by resolving familiar debates about\naccess to health care.\n\nWhile unequal access to health care certainly contributes to health\ninequalities, epidemiologists argue that the principal causes of these\ninequalities lie outside of the health care system. These inequalities\nare largely due to the “social determinants of health”,\nwhich we will understand as the socially controllable factors outside\nthe traditional health care system that are independent partial causes\nof an individual’s health status. Candidate examples of the\nsocial determinants of health include income, education, occupational\nrank, racism, and social class (for a brief corrective against the\nnatural tendency to reserve a privileged position for health care\nhere, see Marmot 2005).\n\nIn this entry, we provide an overview of the empirical literature\nregarding the social determinants of health, and the philosophical\nliterature concerning the justice of health inequalities. Although the\nhealth care system is itself a determinant of health, we largely set\naside questions regarding access to health care for it is covered\nelsewhere (see entry on\n justice and access to health care).\n We begin with a discussion of the social gradient in health, proposed\nsocial determinants of health, and possible causal pathways by which\nthese socially controllable factors could affect people’s\nhealth. We also discuss the normative question of whether health\ninequalities should be understood and measured as differences among\nsocial groups or differences among individuals.\n\nWe then address the central question of this entry: what makes a\nhealth inequality unjust, when it is unjust? We first focus on the\njustice of domestic health inequalities, providing an overview of\nprominent theoretical approaches to this question. Since many propose\nthat health inequalities are not unjust when due to the voluntary\nchoices of individuals, we next explore the issue of individual\nresponsibility for health and its implications for health policy. We\nconclude with a discussion of the justice of global health\ninequalities.\n2. A Social Gradient in Health\n\nThe empirical literature’s most significant and powerful\nreported finding can actually be replicated with a number of\nthe listed candidate social determinants of health, including\nincome, education, occupational rank, and social class. This is the\nexistence, within a given society, of a social gradient in\nhealth. The most significant evidence on the relation between a\nsocially controllable factor and health comes from the Whitehall\nstudies, conducted in England by Michael Marmot and his colleagues\n(1978). In these studies, the candidate social determinant of health\nis occupational rank.\n\nBetween 1967 and 1969, Marmot examined some 18,000 male civil servants\naged between 40 and 69 years old. By placing a flag on their records\nat the National Health Service (NHS) Central Registry, Marmot was able\nto track the cause and date of death for each subject who later died.\nHis data are unusually good data. To begin with, they are generated\nfrom data-points on specific individuals. Each datum reports the\nrelation between the occupational rank of a particular person and the\nlife-span (and cause of death) of the very same person. By contrast,\nalmost every other study begins from aggregate data. In addition, a\nnumber of important background factors are held constant for this\nstudy population. Notably, all the subjects in this study are stably\nemployed, they live in the same region (greater London), and all have\nfree access to health care provided by the NHS.\n\n\n\nFigure 1. Social gradient in total\nmortality, Whitehall 25 year follow-up. (van Rossum et al. 2000: 181)\n[An\n extended description of figure 1\n is in the supplement.]\n\n\nFigure 1\n presents the Whitehall data after 25 years of follow-up. It reports\nage adjusted all-cause mortality rate ratios by employment grade, for\nthree periods of follow-up. A mortality rate ratio reports the\nproportion of deaths in a given group divided by the proportion of\ndeaths in the reference group. There are four grades in the British\nCivil Service employment hierarchy: administrative (highest),\nprofessional/executive, clerical, and “other” (lowest).\nThe professional/executive grade has been used as the reference group,\nso its mortality rate ratio is 1.0 by definition.\n\n\n\nFigure 2. Risk factor adjusted social\ngradient in CHD mortality, Whitehall 25 year follow-up. (Marmot 2000:\n363, fig. 10) [An\n extended description of figure 2\n is in the supplement.]\n\n\nThe striking and important feature of these data is that the\nrelationship between employment grade and mortality exhibits a marked\ngradient. It is natural to think that, below some threshold\nof deprivation, there will be disproportionate ill-health. Yet, in\nthis study population, there is no deprivation, not even in the lowest\ngrade (where everyone is still a government employee with free access\nto health care). Furthermore, and notably, there is no threshold.\nRather, there is a step-wise improvement in health outcomes\nas one climbs the employment grade ladder. In addition, these\ngradients persist even after the mortality rates have been adjusted\nfor standard risk factors. For example, coronary heart disease (CHD)\naccounted for 43 percent of the deaths in the Whitehall study at 10\nyears of follow-up (Marmot, Shipley, & Rose 1984: 1003). Standard\nrisk factors for CHD include smoking, blood pressure, cholesterol and\nblood sugar levels, and height.\n Figure 2\n presents the Whitehall data on mortality from CHD after 25 years of\nfollow-up. It reports relative rates of death from CHD by employment\ngrade, with administrators having a rate of 1.0 by definition. The\nleft bar in each pair displays the relative rate adjusted for age\nalone, while the right bar adjusts it for all the standard risk\nfactors. Correcting for standard risk factors does explain some of the\ngradient in CHD mortality, but no more than a third. The remaining\ngradient is still marked.\n3. Other Social Determinants of Health\n\nThe existence of a social gradient in health certainly suggests that\nsomething in addition to health care exercises a powerful\ninfluence on an individual’s health—something, moreover,\nthat at least correlates with a social variable. However, it is not\nclear exactly what this something is. To begin with, similar domestic\ngradients in individual life expectancy can be found when the social\nvariable is income (Chetty et al. 2016; Case, Lubotsky, &\nPaxson 2002; McDonough et al. 1997); when it is education\n(Mackenbach et al. 2008; Huisman et al. 2005; Crimmins & Saito\n2001; Elo & Preston 1996; Kunst & Mackenbach 1994); when it is\nsocial class (Wilkinson & Marmot 2003); and, in the U.S.\ncontext, when it is race (Arias 2016; Braveman, Cubbin, et\nal. 2010).\n\nBy itself, therefore, the surface fact of a social gradient in health\nis compatible with quite different accounts of the underlying causal\ninfluences on individual health. Each distinct social variable might\nfunction as a “marker” for a different underlying causal\nfactor, different social variables might function instead as\nalternative markers for the same underlying causal factor, or there\nmay be some mixture of both. It is also possible that some social\nvariables—e.g., education (see Cutler, Lleras-Muney, & Vogl\n2011)—function as a relatively direct causal factor.\n\nFurthermore, it is not clear how much of the correlation between\nhealth and a given social variable is properly causal in the first\nplace. In some cases, there is clearly some “reverse\ncausation” between health and a social variable, notably from\npoor health to lower income (Bleakley 2010; J. Smith 2009; Deaton\n2002) and from poor health to less education and lower occupational\nrank (Case, Fertig, & Paxson 2005). Similarly, there is evidence\nof a bidirectional relationship between income and mental illness\n(Ridley et al. 2020). In addition, there is plainly some causation\namong social variables, notably from education both to higher income\nand to higher occupational status. Similarly, while there is evidence\nthat racism contributes directly to poorer health outcomes among\nracial and ethnic minorities, for example, by means of racism-related\nstress, it also contributes to racial and ethnic minorities having\nlower incomes, worse educational outcomes, and lower occupational\nstatus (Williams, Lawrence, & Davis 2019).\n\nThe choice of the social variable in terms of which to describe some\nsocial gradient in health can be made on a number of different\ngrounds. One obvious ground would be to choose the variable(s) that\ncame closest to conveying the operative causal mechanism(s). Another\nground would be to choose the variable(s) that have independent moral\nand/or political significance, such as race and gender. These grounds\nneed not exclude each other and there may be a case for choosing the\nsame variable on both grounds. The second ground acquires a special\nrelevance if health inequalities suffered by individuals who also\nsuffer, for example, from racial discrimination are more unjust than\nhealth inequalities (of the same magnitude) suffered in the absence of\nracial discrimination. If one injustice can compound another, then the\nchoice of social variable may affect the kind of inequality\nin health at issue, and not simply its magnitude.\n\nWhen the social variable is income, there is an important\nfurther definitional dispute to consider. Income appears to have a\nsignificant effect on life expectancy, even controlling for education\n(Backlund, Sorlie, & Johnson 1999). However, there is an on-going\ndebate about which definition of “income” is adequate to\ncapture the contribution individual income makes to individual life\nexpectancy (see the sample of articles collected in Kawachi, Kennedy,\n& Wilkinson 1999). According to the absolute income\nhypothesis, the contribution income makes to individual life\nexpectancy is entirely a function of the individual’s\nnon-comparative income. By contrast, the relative income\nhypothesis holds, roughly, that an individual’s life\nexpectancy is also a function of the relative level of her\nincome—that is, its level compared to others’ income in\nher society—and not simply of its non-comparative level\n(Wilkinson 1996). To make this second hypothesis precise requires one,\namong other things, to specify the reference group to which the\nindividual’s income is compared and also the nature of the\ncomparison (for examples, see Deaton 2003). For an overview of this\ndebate and the state of evidence, see Sreenivasan (2009a) and Pickett\nand Wilkinson (2015).\n4. Groups or Individuals?\n\nOur discussion thus far has implicitly proceeded on the assumption\nthat inequalities in health are defined in terms of membership in some\nsocial group or other. An “inequality” in health,\nso defined, is a difference between the health status of two groups,\nwith the identity of the group following from the choice of the social\nvariable with which health is correlated. For example, we note above\nthat in 2019, the life expectancy was 78.8 years for non-Hispanic\nwhite Americans, and 74.7 years for non-Hispanic Black Americans.\nWhile this is how most of the discussion in the literature on health\ninequalities is actually structured, the definition is controversial.\nNotably, Murray, Gakidou, and Frenk (1999: 537) argue in favor of an\nalternative methodology, in which “health inequality”\nrefers to “the variation in health status across individuals in\na population”, rather than to a difference in health status\nbetween social groups.\n\nStimulated in large part by their article and the reaction to it,\nanother lively debate considers the basic conceptual question of how\nhealth inequalities should be defined in the first place (for a nice\noverview, see Asada 2013). Should they be defined across social\ngroups? Or across individuals instead? It helps to consider this\nquestion on two separate levels. Let us call the first one the\n“fundamental moral level” and let us assume that, on this\nlevel, the individual is the basic unit of concern. The question at\nthis first level asks whether it is health inequalities across\nindividuals or health inequalities across groups which matter from the\nstandpoint of justice.\n\nNow it may seem as if the assumption that individuals are the basic\nunits of moral concern compels us to define “health\ninequality” across individuals as well, i.e., to reject the\nconventional definition at the fundamental moral level, but that is a\nmistake. Daniel Hausman’s (2007, 2013) position in the debate\nillustrates this point well. Despite affirming that the individual is\nthe fundamental unit of moral concern and taking as his starting point\nthe claim that what matters most for egalitarians like him is\ninequalities in welfare or standing among individuals, he still\nopposes defining inequalities in health across individuals.\nHausman’s (2013: 95) central claim is that “[individual]\nhealth inequalities are not themselves pro tanto\ninjustices”.\n\nFor ease of exposition, let us follow Hausman in assuming, more\nspecifically, that what is of fundamental concern to justice is\nindividual well-being. Hausman’s main point can then be\nformulated as follows: Even though health is both an important\ncomponent and cause of well-being, if two individuals are unequal in\nhealth, it does not follow that they are unequal in well-being. For\nobviously, the same two individuals may also be unequal in some other\ncomponent of well-being, and the individual who is less healthy may\nnot have less well-being overall. For example, A may be\nhealthier than B, but B may have more friends or be\nmore accomplished than A (or both), and the latter inequality\nmay have a greater magnitude than the former (or a greater importance\nto well-being), so that the less healthy B may still be\nbetter off overall than A (cf. Hausman 2007: 52). The health\ninequality between A and B is therefore fully\nconsistent with there being no fundamental complaint of justice about\ntheir comparative situation (at least, not on behalf of the less\nhealthy B). Hence, if permission to infer that an injustice\nobtains is built into the classification “inequality”, as\nHausman at least implicitly supposes, we should not classify any\nhealth difference between A and B (or, more\ngenerally, between individuals) as an inequality. While Hausman\nfocuses on well-being moreover, this point generalizes to many\nnon-welfarist egalitarian views of justice too, for example, a\nresourcist view which understands health to be one among a number of\nresources.\n\nOf course, even on its own terms, the logic of this argument admits of\nan important exception: anytime an inequality in health between\nindividuals is such that it cannot be counter-balanced by any\ncomplementary inequality in (one or more) other components of\nwell-being—for example, because it is too large (Hausman 2007:\n54)—then that inequality in health does permit us to infer that\nthe less healthy individual also has less well-being overall. Hausman\ncalls these special health inequalities “incompensable”\nand he accepts that they are immune to his objection:\n\n\nData concerning incompensable health inequalities do permit inferences\nconcerning inequalities in welfare or standing, and they thus provide\nrelevant information for egalitarians. (Hausman 2013: 98)\n\n\nAccordingly, he restricts the scope of his official argument, so that\nit only concerns compensable health inequalities between\nindividuals.\n\nBy contrast to (compensable) health inequalities between individuals,\nhealth inequalities between social groups typically do, in\nHausman’s view, permit inferences about inequalities in overall\nwell-being. Since that is his argument for defining “health\ninequality” across social groups, it actually relies on the\nassumption that individual well-being is the fundamental unit of moral\nconcern.\n\n\nInformation about social group health differences will thus often be\nrelevant to conclusions about justice, not because group differences\nmatter and individual differences don’t, but because information\nabout differences in QALYs between well-studied social groups will\noften license conclusions about the fundamental inequalities that\negalitarians care about. (Hausman 2007: 50)\n\n\nAn important implication of Hausman’s argument, which we shall\nsee independent reason to affirm later, is that it is artificial and\nover-simple to put very much weight on mono-factor normative\nprinciples, such as “equality of health-by-itself”.\n\nIris Marion Young (2001) provides a more direct reason for focusing on\ninequalities across groups at the fundamental moral level. She agrees\nwith Hausman that individuals are the basic unit of moral concern, but\nargues that when claims of justice concern equality, the appropriate\nfocus is inequalities across groups. The cause of morally troublesome\ninequalities, she argues, lies with social structures, where\nstructures\n\n\nrefer to the relation of basic social positions that fundamentally\ncondition the opportunities and life prospects of the persons located\nin those positions. (Young 2001: 14)\n\n\nSince structures constitute and relate to individuals as members of\nsocial groups, group-conscious practices of assessing inequalities are\nnecessary to identify structural inequalities: inequalities\nin people’s freedom or wellbeing that are the cumulative effect\nof social institutions, policies, and the decisions of officials\n(Young 2001: 15). The social groups to focus on, Young (2001: 15)\nargues, are those\n\n\nwhich we already know have broad implications for how people relate to\none another—class, race, ethnicity, age, gender, occupation,\nability, religion, case, citizenship status, and so on.\n\n\nSuch structural inequalities are unjust since societies should not\nstructure their social institutions and policies in ways that\ndisadvantage people in the exercise of their freedom or flourishing on\nthe basis of factors beyond their control (Young 2001: 16).\n\nYoung does not focus exclusively on health but Paula A. Braveman,\nKumanyika, et al. (2011) provide an account of unjust health\ninequalities that is structural in nature. While we use the concept of\nhealth disparities above as a stand-in for health\ndifferences, Braveman et al. (2011: S150) understand health\ndisparities as those health differences among groups that are\nsystematically tied to their social disadvantage (Braveman et al.\n2011: S150):\n\n\nHealth disparities are systematic, plausibly avoidable health\ndifferences according to race/ethnicity, skin color, religion, or\nnationality; socioeconomic resources or position (reflected by, e.g.,\nincome, wealth, education, or occupation); gender, sexual orientation,\ngender identity; age, geography, disability, illness, political or\nother affiliation; or other characteristics associated with\ndiscrimination or marginalization…Health disparities do not\nrefer generically to all health differences, or even to all health\ndifferences warranting focused attention. They are a specific subset\nof health differences of particular relevance to social justice\nbecause they may arise from intentional or unintentional\ndiscrimination or marginalization and, in any case, are likely to\nreinforce social disadvantage and vulnerability.\n\n\nTo put this in Young’s terms, health disparities are\nstructural health inequalities: health differences due to\nsocial institutions and policies (see also Goldberg 2012; Powers &\nFaden 2006, 61).\n\nOn the other side of the debate, Kasper Lippert-Rasmussen (2013)\nargues that we should define “health inequality” across\nindividuals at the fundamental moral level. He first raises two\nrelated objections to social group definitions which together advance\nthe point that any group definition will be inherently arbitrary.\nLippert-Rasmussen’s first objection is the “intra-group\ninequality” challenge, according to which there is no reason to\ntreat health inequalities between groups as being any more unjust than\nhealth inequalities within groups. Yet,\n\n\nfor any selection of groups such that [health] inequalities between\ntwo groups matter, intragroup [health] inequalities may exist. (2013:\n57)\n\n\nLippert-Rasmussen’s second objection is the\n“group-identification” challenge. There are any number of\nways to sub-divide a given population into groups. Holding the\nunderlying health facts fixed, different choices of group definition\nwill correspond to different inequalities in health (of different\nmagnitudes) inhering in the same population. Some explanation is\ncalled for, then, of the significance in justice of the particular\ncharacter of one’s favored group definition. What is the\nrelevance to justice, for example, of the apparently artificial\nboundary demarcating the top 1% of the income distribution in the U.S.\nfrom the bottom 1% (our opening illustration of an inequality in\nhealth)?\n\nNow, as Young (2001) and Braveman, Kumanyika, et al. (2011)\nillustrate, one obvious option for discharging this explanatory\nburden, which Lippert-Rasmussen (2013: 58) also recognizes, is to\ndefine the groups so that they “echo the major social causes of\nhealth equality”. He rejects this response however on the\ngrounds that there is likely to be a mismatch between “groups\nidentified by the social causes of health” and “groups\namong whom there are morally relevant health inequalities”\n(Lippert-Rasmussen 2013: 58). A focus on the former will therefore\nfail to recognize some number of unjust group health inequalities.\n\nLippert-Rasmussen (2013: 58) also attacks a central premise that he\ntakes to underlie arguments for group measures of health inequalities,\nnamely, that\n\n\nonly health inequalities that are the causal result of social factors\nare unjust, and only group-based measures of health inequality fit\nunjust health inequalities.\n\n\nIn contrast to this view, Lippert-Rasmussen argues that there is such\na thing as natural injustice, for example, health inequalities due to\nbiological processes for which no one is responsible, and individual\nmeasures of health inequalities are necessary to capture them. We\ndiscuss this point in more detail below.\n\nNir Eyal (2018) rejects many of the arguments in support of focusing\non health inequalities among groups. However, he offers a number of\nmoral reasons to identify and address “status group\ninequalities”, that is, health inequalities “between\ngroups that are defined along lines of social advantage and\ndisadvantage” (Eyal 2018: 150). He takes these reasons to be\ncompatible with, if not supported by, Lippert-Rasmussen’s\ninter-individual egalitarianism. We discuss two here. First, although\nstatus group inequalities are not inherently unfair, they are often\n“rough indicators” of underlying moral problems, including\ninjustices such as racial discrimination or failures of social\nsolidarity (Eyal 2018: 159). Eyal argues, second, that status group\ninequalities may sometimes function as a proxy for luck egalitarian\ninjustices. Where status group inequalities exist, for example,\ninequality in life expectancy between low-income and high-income\ngroups, it is likely that members of the disadvantaged group are\nsubject to circumstances that lessen their responsibility for the\noutcomes in question (Eyal 2018: 161–162). Since luck\negalitarians hold that inequalities due to unchosen circumstance are\nunjust, status-group inequalities may often function as proxies for\nluck egalitarian injustice.\n\nEarlier we said that it was helpful to consider the question of\ndefining health inequalities on two levels, where the first level is\nthe fundamental moral level. The main point behind distinguishing\nlevels here is simply to clarify that the fundamental moral level is\nseparate from other levels at which the question can be considered and\nalso more basic than them. In the first instance, then, it does not\nmatter much how exactly we describe the second level. We need only\ndescribe it as “not the fundamental moral level”. How the\nother level(s) should be described more specifically will depend on\none’s purposes. For example, Yukiko Asada (2013) describes a\n“policy” level and Lippert-Rasmussen (2013) describes a\nlevel of “principles of regulation”.\n\nAt the level of policy-making, Asada (2013: 40–41) reviews two\nconsiderations that favor defining health inequalities across\nindividuals and one that favors defining them across social groups.\nShe also proposes a novel approach that attempts to combine the merits\nof both. A definition across individuals is favored by the fact that\ndata collected on that basis lends itself easily to international\ncomparisons (see also Murray, Gakidou, & Frenk 1999), whereas data\non health inequalities defined across groups can only be compared\nbetween two countries if both countries have conceived and\noperationalized the relevant groups in the same way (which they often\nhave not). Furthermore, defining health inequalities across\nindividuals does not require any balancing or summary operation in\norder to yield conclusions about overall inequalities in health,\nwhereas a definition across groups only yields conclusions about\noverall inequalities when combined with data from other relevant\ngroups (e.g., when health inequalities across income groups are\ncombined with health inequalities across educational groups). On the\nother hand, a definition across groups is favored by the fact that the\nsocial variable defining the group (e.g., income or education) often\nnaturally suggests a target for policy intervention, whereas a\ndefinition across individuals suggests no such target and is thus\n“one step removed from policy” (Asada 2013: 41).\n5. Causal Pathways\n\nThe strategy of aligning the social groups used to define inequalities\nin health with the major social causes of health evidently presupposes\nthat one knows what those causes are. To determine whether any of the\npreviously discussed correlations between individual life expectancy\nand a social variable is causal, one needs some account of the\ncausal pathways between candidate social determinants and\nspecific mortality risk factors. Unfortunately, these pathways are not\nwell understood (Mackenbach 2019: 49–55; Adler & Newman\n2002; Adler & Ostrove 1999; R. Evans, Hodge, & Pless 1994).\nWhile research in this area remains preliminary, it may be useful to\ndescribe some of the possibilities.\n\nJohan Mackenbach (2019: 62–73) helpfully identifies three groups\nof causal pathways between social determinants and health outcomes.\nThe first is childhood environment. Socioeconomically disadvantaged\nmothers are more likely to have impaired health, have greater\npsychosocial stress, and to engage in unhealthy behaviors during\npregnancy (Mackenbach 2019: 66). Their children are therefore more\nlikely to experience impaired fetal growth, low birth weight, and\npremature birth. Children with disadvantaged parents are also more\nlikely to be exposed to unfavorable conditions after birth, including\ninadequate nutrition and harmful levels of air pollution, which may\nexplain why they have worse health outcomes compared to children of\nhigh-income parents (Currie 2009; Case, Lubotsky, & Paxson\n2002).\n\nA second group of causal pathways is lifelong material living\nconditions (Mackenbach 2019: 68). Certain conditions of absolute\nmaterial deprivation constitute well-recognized risks for ill health\nand mortality, including inadequate nutrition, lack of clean water and\nsanitation, and poor housing. A very plausible causal pathway runs\nfrom low levels of non-comparative individual income through these\nmaterial risk factors to poor health outcomes (Aldabe et al. 2011).\nLow-income people are also more likely to work physically demanding\njobs which expose them to dangerous chemicals (Clougherty, Souza,\n& Cullen 2010), and reside in neighborhoods featuring poor access\nto amenities and increased exposure to environmental risks such as air\npollution and toxic waste sites (Brulle & Pellow 2006; Pickett\n& Pearl 2001).\n\nA third group of causal pathways between social determinants and\nhealth outcomes is social and psychological factors (Mackenbach 2019:\n72; Marmot 2004). This group is important for it can explain the above\ncited social gradients in life expectancy which were mainly observed\nin highly developed societies, where the prevalence of absolute\nmaterial deprivation is fairly low. In particular, a significant\nsocial gradient was observed in the Whitehall studies, where the\noccupants of even the lowest occupational rank were nevertheless all\nstably employed civil servants with free access to health care.\n\nOne of the most prominent specific risk factors envisaged as the\nterminus for a psychosocial pathway is (the effects of)\nstress. As Eric Brunner and Michael Marmot (2006) explain,\nthe long-term effects of stress differ importantly from its short-term\neffects. In the short-term, an individual’s fight-or-flight\nresponse to external stressors is beneficial insofar as it enables\nthem to cope with threats and challenges. Among other things, this\nacute stress response involves the activation of neuroendocrine\npathways, along which adrenaline and cortisol (e.g.) are released into\nthe bloodstream. These hormones stimulate psychological arousal (e.g.,\nvigilance) and mobilize energy, while simultaneously inhibiting\nfunctions irrelevant to immediate survival (e.g., digestion, growth,\nand repair). An optimal reactivity pattern is characterized by a sharp\nincrease in levels of circulating adrenaline (and later, cortisol),\nfollowed by a rapid return to baseline once the challenge has passed.\nSub-optimal patterns are characterized by elevated baseline levels and\nslower returns to baseline.\n\nBy contrast, the long-term effects of stress—either from over\nfrequent provocation of acute stress or from chronic stress—can\nbe physiologically harmful (Brunner & Marmot 2006). Stress-induced\ndamage is mediated, among other things, by prolonged elevation of\nadrenaline and cortisol levels in the blood. Elevated cortisol can\nlead to the accumulation of cholesterol (e.g., by raising glucose\nlevels even during inactivity); and elevated adrenaline increases the\nblood’s tendency to clot, which can add to the formation of\narterial plaques and thereby lead to increased risk of heart disease\nand stroke. Other risks that may be increased by stress-induced damage\ninclude risks for cancer, diabetes, infection, and cognitive\ndecline.\n\nA psychosocial pathway running from stress-induced damage—or\n“allostatic load” (B. McEwen 1998)—has next to be\ntraced to some social factor, preferably one amenable to policy\nmanipulation. Four factors that have attracted considerable attention\nare “social rank”, “job control”,\n“racial discrimination”, and “poverty”.\n\nThe most specific evidence on the role of social rank in\nproducing stress-induced damage comes from studies of non-human\nprimates (Brunner & Marmot 2006; R. Evans, Hodge, & Pless\n1994). In various primate species, social life is organized in terms\nof clear and stable dominance hierarchies. Robert Sapolsky and Glen\nMott (1987) found that hierarchies of free-ranging male baboons\nexhibit an inverse social gradient both in cortisol elevations and in\nadverse cholesterol ratios. Manipulating the dominance hierarchy of\ncaptive female macaque monkeys, Carol Shively and Thomas Clarkson\n(1994) similarly found that dominant monkeys who became subordinate\nhad a five-fold excess of coronary plaques as compared to those who\nremained dominant. (Part of this excess was due to the stress\nassociated simply with a change in social rank [as distinct\nfrom a demotion], since subordinate monkeys who became dominant also\nhad more atherosclerosis [albeit, only twice as much] compared to\nthose who remained subordinate).\n\nEvidence on the role of low job control in producing\nstress-induced damage comes from the Whitehall II study (Marmot,\nBosma, et al. 1997). “Job control” refers to an\nindividual’s level of task control in the workplace,\noperationalized here in terms of a questionnaire concerning decision\nauthority and skill discretion. One of the principal diseases for\nwhich stress-induced damage increases the risk is coronary heart\ndisease (CHD). In Whitehall II, there was an inverse social gradient\nin age-adjusted CHD incidence: Compared to their high grade\ncounterparts, intermediate grade male civil servants were 1.25 times\nmore likely to develop a new case of CHD in a five year interval,\nwhile low grade men were 1.5 times more likely. For women, the odds\nratios were 1.12 and 1.47. Marmot and his colleagues also found an\ninverse social gradient in low job control. Among men, 8.7 percent of\nhigh, 26.6 percent of intermediate, and 77.8 percent of low grade\ncivil servants reported low job control; for women, the percentages\nwere 10.1, 34.8, and 75.3. But their key finding was that a\nsubstantial part of the gradient in CHD incidence could be attributed\nto the differences in job control. Controlling for low job control\nreduced the low grade (e.g.) men’s odds ratio for new CHD from\n1.5 to 1.18 and the women’s from 1.47 to 1.23. By comparison,\nknown CHD risk factors only reduced the same ratios from 1.5 to 1.3\nand from 1.47 to 1.35, respectively.\n\nThere is also evidence that experiences of racial\ndiscrimination may contribute to racial disparities in health.\nWhile some racial health disparities are explainable by appeal to the\nlower average socioeconomic status of racial minorities, racial health\ndisparities persist at every level of socioeconomic status (Braveman,\nCubbin, et al. 2010). There is increasing evidence that such residual\ndisparities may in part be the result of experiences of\nindividual-level racial discrimination which produce stress-induced\ndamage (Williams et al. 2019; Colen et al. 2018). Indeed, a recent\nstudy suggests a causal pathway between these factors, finding an\nindependent association between discrimination exposure and higher\nlevels of spontaneous amygdala activity and\nconnectivity—processes linked to higher levels of stress,\nphysiological arousal, vigilance, and negative health outcomes (Clark,\nMiller, & Hegde 2018).\n\nFinally, there is increasing evidence that children raised in\npoverty are often exposed to adversities that produce\n“toxic stress”. Such stress “involves the frequent\nor sustained activation of the biological stress system” and is\noften the result of adverse events that are more likely to exist in\nlow-income households, including maternal depression, child abuse and\nneglect, and spousal violence (C. McEwen & B. McEwen 2017: 448).\nToxic stress in turn negatively affects children’s early\nphysical and cognitive development, with likely negative consequences\nfor their later health, educational, and occupational outcomes (C.\nMcEwen & B. McEwen 2017; Boyce, Sokolowski, & Robinson\n2012).\n\nIn sum, there is a reasonable case to be made that many health\ninequalities are caused by a number of socially controllable factors\noutside of the traditional health care system. Such social\ndeterminants of health may include income, occupational rank,\neducation, social status, and racial discrimination. We would caution,\nhowever, that more evidence is needed to establish the proposed causal\npathways, and that some of the evidence we discuss is contentious. For\nexample, Anne Case and Christina Paxson (2011: F185) argue that much\nof the gradient Marmot, Bosma, et al. (1997) attribute to job control\nin Whitehall II can be explained by participants’ early life\nhealth and socioeconomic status, suggesting that “occupational\ngrade may be more of a marker of poorer health than a cause of poorer\nhealth”.\n\nIn addition, while the above evidence regarding causal pathways is\narguably sufficient for normative theorizing, things may be different\nfor the purposes of designing policy remedies. As Angus\nDeaton (2002: 15) puts it, “policy cannot be intelligently\nconducted without an understanding of mechanisms; correlations are not\nenough”. It is not clear that our existing understanding of the\ncausal pathways between socially controllable factors and specific\nmortality and morbidity risks is sufficiently well-developed to\nunderwrite concrete policy proposals. Moreover, even if it were, it\nwould still be a further step to license implementation of\nsome such proposal. Among other things, a license of this kind\nrequires an account of the comparative effectiveness of a proposed\nreform in relation to salient alternatives.\n6. Justice and Domestic Health Inequalities\n\nWe turn now to a discussion of the normative dimension of health\ninequalities. We begin in this section with a look at health\ninequalities among residents of the same state. We first examine the\nconcept of health equity which is often employed as a\nnormative standard in the public health literature for evaluating such\ninequalities. We then turn to the philosophical literature, providing\nan overview of the most prominent accounts of the justice of health\ninequalities. In the two remaining sections of this entry, we first\ndiscuss the relevance of individual responsibility for health justice\nbefore concluding with a discussion of the justice of global health\ninequalities.\n6.1 Health Equity\n\nThe concept of health equity is often used to refer to just\ndistributions of health, where health inequities are understood to be\ndifferences or disparities in health that are avoidable, unnecessary,\nand unfair (Whitehead 1992). Health inequalities are\ntherefore in principle observable differences in the health among\nindividuals and groups. Health inequities are health\ninequalities that are unjust. (For discussion of the ways in which\nhealth inequality metrics may themselves be value-laden see King 2016;\nsee Asada 2019 for a good discussion of challenges in measuring health\ninequities).\n\nWhile the concept of health equity is frequently invoked as a\nnormative standard by scholars, policymakers, and public health\npractitioners, there is a good deal of disagreement regarding its\nmeaning. There is disagreement, first, on which health differences are\navoidable. Some suggest that health differences are avoidable\nonly if they are caused by social processes rather than natural or\nbiological processes (Chang 2002; Whitehead 1992). Others argue that\nthis understanding is too constrained (Preda & Voigt 2015; Wilson\n2011). Even if health differences caused by natural processes are not\navoidable in the sense of being preventable, these critics suggest,\nthey may be avoidable in the sense of being treatable. Moreover, if\ninequalities in health are inequitable in part because they are\nunchosen, as luck egalitarians claim, then it makes sense to identify\navoidable health inequalities as those that are amenable to\nintervention (Preda & Voigt 2015: 30).\n\nThere is also disagreement regarding whether avoidability is a\ndistinct and necessary condition of unjust health inequalities. Sudhir\nAnand and Fabienne Peter (2000) suggest that unfairness entails\navoidability and so is not really separate from it. But avoidability\nis cleanly separable (in the other direction) from unfairness, and\nthat can be an analytic advantage. For example, it allows the justice\nof inevitable inequalities in health to be decided without having to\nengage the issue of fairness at all. Others question whether health\ndifferences must be avoidable if they are to count as unjust\n(Lippert-Rasmussen 2013: 59–60; Wilson 2011: 216). For luck\negalitarians, health differences due to natural processes can be\nunjust regardless of whether they can be prevented or treated. Even if\nperson A has lesser mobility compared to person B\ndue to a genetic condition that is neither preventable nor treatable,\nthe difference between A and B is unjust and\nA has a claim on society to rectify it, for example, through\nthe provision of a mobility aid or the restructuring of the social\nenvironment. Such inequalities are examples of natural\ninjustices—injustices caused by natural processes—rather\nthan social injustices—injustices caused by social\nprocesses (Lippert-Rasmussen 2013: 59–60). (For a contrary view,\nsee Wester 2018).\n\nOne way to save the avoidability condition—understood as\namenability to intervention—is to stipulate that the concept of\nhealth equity is only concerned with social injustices\n(Sreenivasan 2015: 54). But, while luck egalitarianism is\ncontroversial, James Wilson (2011: 216) cautions that it would be a\nmistake to define the concept of health equity in a way that\npresupposes its falsity. Wilson (2011: 217) therefore concludes that\nhealth inequities are simply those health differences that are unjust\n(for an excellent overview of these and other debates regarding the\nconcept of health equity, see M. Smith 2015).\n\nWhile these debates regarding the avoidability condition implicitly\nraise questions of justice, the fairness condition does so explicitly.\nIf the concept of health equity is to function as a defensible\nnormative standard, we need an account of justice in the distribution\nof health.\n6.2 Free-Standing Approaches\n\nWe can distinguish two fundamentally different approaches to bringing\nverdicts of fairness or justice to bear on a given health inequality.\nOn the free-standing approach, the injustice of an unjust\nhealth inequality is the primary injustice, although a verdict of\ninjustice can also be spread backwards from this primary\ninjustice to its causes. By contrast, on the derivative\napproach, the injustice of an unjust health inequality is not the\nprimary injustice. Rather, the primary injustice is some unjust cause\nof a health inequality, although a verdict of injustice can also be\nspread forwards from this primary injustice to the health\ninequality itself. In this way, the injustice of an unjust health\ninequality derives from the primary injustice of its cause(s). (This\ndistinction between free-standing and derivative approaches closely\nmatches Peter’s [2004: 94–95] distinction between direct\nand indirect approaches). Suppose, for example, that part of the\ndifference in life expectancy between white and Black men in the\nUnited States is caused by racial discrimination. On the derivative\napproach, this part of that inequality in health is unjust because its\ncause is unjust, and this verdict holds even if inequalities\nin health are not otherwise unjust (e.g., even if no valid principle\nof equality applies directly to health). On a free-standing approach,\nby contrast, this difference in life expectancy may itself be unjust,\nregardless of its cause. We discuss each approach in turn.\n\nThe simplest example of the free-standing approach applies a general\nprinciple of equality directly to the case of health. (For general\ndiscussion of the grounds of egalitarianism, as well as of the\ncharacter of different versions, see the entry on\n egalitarianism.)\n With some qualifications, the resultant requirement of\n“equality of health” is affirmed, for example, by Anthony\nCulyer and Adam Wagstaff (1993). This implies that any\navoidable inequality in health is unfair or unjust.\n\nLuck egalitarians object to the strict equality view on the grounds\nthat inequalities are not unjust if they are the result of voluntary\nand informed choices (Segall 2010; Le Grand 1987). While it is unjust\nfor one person to be worse off than another because of brute\nluck—i.e., factors beyond a person’s control such as their\nnatural or social circumstances—inequalities due to\noption luck—i.e., factors within a person’s\ncontrol—are just. For luck egalitarians therefore, not all\nhealth inequalities are unjust, only those due to unchosen\ncircumstances (Voorhoeve 2019; Albertsen & Knight 2015; Temkin\n2013; Segall 2010: 99).\n\nA problem for both strict and luck egalitarian views, however, is that\nthey are subject to the leveling down objection, for unjust\ninequalities in health may be addressed either by improving the health\nof those who are unfairly worse off or leveling down the health of\nthose who are unfairly better off (Segall 2010). If A’s\nlife expectancy is 10 years shorter than B’s due to\ncancer, this inequality may be addressed either by treating\nA’s cancer or damaging B’s health.\nSimilarly, if one holds that health inequalities between social groups\nare unjust, one may be committed to the conclusion that deteriorations\nin the health of members of advantaged social groups are good—at\nleast in one respect—when they reduce such inequalities. For\nexample, one may be committed to the questionable claim that the rise\nof “deaths of despair” among white Americans in the\ntwenty-first century (see Case & Deaton 2015, 2020) is in one\nrespect good since it reduced inequalities in life expectancy among\nwhite Americans and Black Americans (for a thoughtful discussion of\nthis issue, see Blacksher 2018).\n\nEyal (2013) offers the most promising response to the leveling down\nobjection in this context, pointing to a number of cases where it is\nplausible to prefer outcomes that are more equal, even if less equal\nalternatives are available where some are better off and no one is\nworse off. Luck egalitarians also soften the force of this objection\nby adopting pluralist views, arguing that comparative fairness is not\nthe only relevant value (see Voorhoeve 2019; Temkin 2013).\n\nSegall (2010) opts instead for a luck prioritarian account,\nprioritizing the opportunity for health of the worse off.\nAccording to this principle,\n\n\nFairness requires giving priority to improving the health of an\nindividual if she has invested more rather than less effort in looking\nafter her health, and of any two individuals who have invested equal\namounts of effort, giving priority to those who are worse off\n(health-wise). (Segall 2010: 112)\n\n\nOn Segall’s (2010: 119), view therefore, justice demands, first,\nthat we improve the health of those who have been most prudent in\ntaking care of their health, that is, whose health deficits are most\ndue to brute luck. For individuals who have exercised equal prudence\nregarding their health, justice demands, second, that priority be\ngiven to those whose health deficit is greatest—i.e., are worse\noff (Segall 2010: 119). In contrast to a luck egalitarian view,\nSegall’s (2010: 120) luck prioritarian view is not concerned\nwith realizing equality in health, but rather with “prioritizing\nthe opportunity for health of the worse off”.\n\nSome scholars avoid the leveling down objection by opting for social\nor relational egalitarian alternatives to luck egalitarianism. On this\nview, health inequalities are unjust if they undermine citizens’\nability to interact with each other as equals (see Voorhoeve 2019;\nKelleher 2016; Voigt & Wester 2015; Hausman 2012; Pogge 2004). For\nexample, Alex Voorhoeve (2019) suggests that social egalitarians have\nspecial reason to be concerned with health deficits that make people\nvulnerable to domination or exploitation in private life as well as\ndomination or marginalization in public life. Proponents of this view\nargue that it addresses a significant problem with luck egalitarian\napproaches since it holds that health inequalities due to\npeople’s voluntary and informed choices are nonetheless unjust\nif they undermine their standing as equals. A challenge to social or\nrelational egalitarian views, however, is that they are vague on which\nhealth inequalities undermine equal relations among citizens (Hausman\n2019; Voigt & Wester 2015).\n\nIn contrast to those who see luck egalitarian and relational\napproaches as competing views, Voorhoeve (2019) argues that each has a\ncompelling basis and may be combined in a complementary way. Social or\nrelational egalitarianism recognizes that there is “reason to be\naverse to choice-based inequalities that threaten people’s\nstatus as equal citizens” while the luck egalitarian approach\noffers a reasonable interpretation of the vague relational requirement\nof the principle of equal consideration (Voorhoeve 2019:\n154–155).\n\nOthers avoid the leveling down objection by defending sufficientarian\napproaches to health justice (for comprehensive discussions of\nsufficientarian approaches, see Fourie 2016; Rid 2016). Madison Powers\nand Ruth Faden (2006: 15–29) argue that social justice requires\nthat people be secured a sufficient level of wellbeing where wellbeing\nis understood to have six essential dimensions: health, personal\nsecurity, reasoning, respect, attachment, and self-determination.\nJustice does not therefore demand equality in health outcomes, but\nrather that people have “enough health over a long enough life\nspan to live a decent life” (Powers & Faden 2006: 95).\nJennifer Prah Ruger (2010) similarly develops a capabilities approach\nto health justice, according to which people are entitled to a\nthreshold level of certain core health capabilities, that is,\nabilities to be healthy. The focus of public policy, Prah Ruger (2010:\n88–90) argues, should be to reduce “shortfall”\ninequalities—i.e., to bring people as close to the requisite\nthreshold as is possible.\n\nWhile these sufficientarian approaches avoid the leveling down\nobjection, they nonetheless face two significant challenges. First,\nshould governments be indifferent regarding health disparities above\nthe threshold identified by sufficientarian views (Arneson 2002)? If\nthe threshold is set too low, such a view may regard significant\ndisparities in morbidity and mortality as not unjust. Second, among\nthose who fall below the threshold, who should be prioritized (Fourie\n2016)? Should policymakers focus on maximizing the number of people\nwho meet the threshold, even if this means helping those who are\nbetter off? Or should they prioritize the worse off, even if this\nmeans using significant resources to only marginally improve their\nhealth? (For a discussion of possible solutions to these problems, see\nShields 2016).\n\nSome commentators criticize free-standing views’ tendency to\nfocus on or prioritize health inequalities to the exclusion\nof other normative considerations. Hausman (2007, 2013, 2019) argues\nthat health inequalities among individuals are not pro tanto unjust\nsince such inequalities (among individuals) do not permit inferences\nregarding inequalities in wellbeing or moral standing which are of\nreal moral concern. Daniel Weinstock (2015: 438) cautions against\n“health consequentialism”, the view that all social\ndeterminants of health should be arranged to achieve some preferred\ndistribution of health—e.g., health equality. He argues instead\nin favor of pluralistic approaches to distributive justice which\nrecognize that the distribution of many of the social determinants of\nhealth—e.g., income and education—should also be governed\nby additional, non-health related principles of justice (see also\nWester 2018). Powers and Faden’s (2006) view avoids these\nproblems by positing six dimensions of wellbeing, though this approach\nfaces the challenge of how conflicts among these dimensions ought to\nbe adjudicated.\n6.3 Derivative Approaches\n\nIn contrast to free-standing approaches to the justice of health\ninequalities, derivative approaches locate the injustice of unjust\nhealth inequalities with their unjust causes. Norman Daniels (2008)\noffers the most prominent example of this approach (see also Daniels,\nKennedy, & Kawachi 2000; and Peter 2004). His central claim is\nthat, by a happy coincidence, John Rawls’ principles of justice\nregulate all of the principal social determinants of health (Daniels\n2008: 82 and 97). Compliance with these principles, Daniels (2008: 82)\nclaims, “will consequently flatten the socioeconomic gradient of\nhealth as much as we can reasonably demand” with the result that\n“social justice in general is good for population health and\nits fair distribution”.\n\nTo begin with, income and workplace organization are\nregulated by the difference principle: inequalities in income and\nhierarchies in the workplace are permitted only to the extent that\nthey work to the greatest benefit of the least well off.\nEducation is regulated by the principle of fair equality of\nopportunity, which requires “equitable public education”\nas well as “developmentally appropriate day care and early\nchildhood interventions” (Daniels 2008: 96). Political\nparticipation, which Daniels (2008: 95–6) regards as a\nsocial determinant of health, is regulated by the principle of equal\nbasic liberty: among other things, this principle safeguards the fair\nvalue of the right to participate politically. Finally, reaffirming\nhis earlier work (1985), Daniels maintains that fair equality of\nopportunity also requires universal access to comprehensive health\ncare (broadly construed to include public health).\n\nTo the extent that these social variables are causal determinants of\nhealth, and to the extent that their distribution in society\nfails to conform to the corresponding principle of Rawlsian\njustice, the resultant health inequalities will be unjust and unjust\nbecause their causes are unjust. The flip-side of this point is that\nthe implementation of Rawls’ principles will tend—again,\ninsofar as the relevant determinants are causal—to reduce\nexisting inequalities in health (Daniels 2008: 82).\n\nAs Daniels notices, observing Rawlsian justice may flatten the social\ngradient in health without eliminating it altogether. For example, the\ndifference principle may permit certain inequalities of income, which\nare nevertheless possible to eliminate. If income is a causal\ndeterminant of health, these permissible income inequalities will\n(continue to) generate health inequalities if they are left in place.\n(This scenario is actually only coherent if the relative\nincome hypothesis is the correct account of the causal mechanism. For\nthe explanation, see Sreenivasan 2009b). Daniels holds that the\npersistence of avoidable health inequalities does not give us reason\nin justice, independently of the difference principle, to eliminate\ntheir underlying cause. In his view, justice permits some avoidable\ninequalities in health:\n\n\nThe residual inequalities that emerge with conformance to\n[Rawls’] principles are not a compromise with what justice\nideally requires; they are acceptable as just. (2008: 99)\n\n\nAnand and Peter (2000) criticize Daniels’ account on the grounds\nthat there is a tension between two different uses Daniels makes of\nRawls’ second principle of justice. On the one hand, they argue,\nDaniels treats its two parts as simply regulating certain specific\nsocial determinants of health—the fair equality of opportunity\nprinciple regulates education (e.g.), while the difference principle\nregulates income. On the other hand, his account of health care treats\nthe fair equality of opportunity principle as regulating\nhealth itself directly. But the latter employment of fair\nequality of opportunity, which Anand and Peter actually prefer (2000:\n52), threatens to contradict Daniels’ treatment of residual\nhealth inequalities. If fair equality of opportunity requires (some\nkind of) egalitarianism about health, then residual health\ninequalities that remain after the difference principle is fully\nimplemented may still fall within its scope. In that case,\nRawlsian justice may well command their reduction.\n\nTo avoid this problem of inconsistency, Jayna Fishman and Douglas\nMacKay (2019) and Johannes Kniess (2019) rework Rawls’s theory\nof justice, developing a Rawlsian conception of the social\ndeterminants of health—the social bases of\nhealth—and arguing that it should be considered a social\nprimary good. Fishman and MacKay (2019) and Kniess (2019) disagree\nhowever on which Rawlsian principle should govern the distribution of\nthis good. Fishman and MacKay (2019) argue that the parties to the\noriginal position would choose an additional principle of justice to\ngovern the distribution of the social bases of health and assign it\nlexical priority over fair equality of opportunity and the difference\nprinciple. According to this principle, the\n\n\nsocial bases of health are to be arranged so as to have the greatest\npositive impact on the health status of those least advantaged on the\nsocial health gradient. (Fishman & MacKay 2019: 616)\n\n\nThe social bases of health deserve this priority, Fishman and MacKay\n(2019: 615) suggest, since health is necessary if people are to\nrealize their highest order interests in developing and exercising\ntheir two moral powers. Inequalities in the distribution of the social\nbases of health, and so inequalities in health status resulting from\nsuch a distribution, are just if the least advantaged on the social\nhealth gradient have a higher expected health status than they would\nunder an equal distribution (Fishman & MacKay 2019: 616). Kniess\n(2019: 418), by contrast, argues that the social bases of health\nshould be governed by the difference principle, though he concedes\nthat this complicates the indexing problem, namely, that there is no\nobvious way to rank different distributions of income and wealth, the\npowers and prerogatives of offices and positions of responsibility,\nand the social bases of health. Kniess (2019: 420) concludes that such\ntradeoffs must be decided through the democratic process. While\nFishman and MacKay (2019) avoid this problem by prioritizing the\nsocial bases of health, as Kniess argues (2019: 418–420), his\napproach may be preferable since it permits tradeoffs between health\nand income and also leaves more room for political communities to set\npriorities.\n\nOne remaining problem with Fishman and MacKay (2019) and\nKniess’s (2019) reworking of Daniels’ (2008) approach is\nthat they too are silent on the justice of residual health\ninequalities. This question is important, for while we have presented\nthe free-standing and derivative approaches as alternatives, it is\npossible for the two approaches to be combined. Holding that\ninequalities in health are unjust because of their unjust causes does\nnot preclude holding that they are unjust simply qua inequalities.\n7. Individual Responsibility and Health Behaviors\n\nIn\n section 5,\n we identified three groups of possible causal pathways between social\ndeterminants and health outcomes: childhood environment, material\nliving conditions, and social and psychological factors. A central\ncontributing factor to poor health outcomes, however, has an ambiguous\nrelation to social determinants. There is strong evidence that\nhealth behaviors, including smoking, excessive alcohol\nconsumption, poor nutrition, and lack of physical exercise are key\ncontributors to morbidity and mortality (Petrovic et al. 2018). Some\nfind, moreover, that health behaviors explain much of the social\nhealth gradient in high-income countries, since harmful health\nbehaviors are more prevalent in groups with lower socioeconomic status\n(Petrovic et al. 2018). For example, Silvia Stringhini, Sabia, et al.\n(2010) argue that when superior measures of health behaviors are\nemployed, much of the health gradient identified in the Whitehall II\nstudy can be explained by a social gradient in harmful health\nbehaviors (though Stringhini, Dugravot, et al. [2011] did not\nreplicate this finding in a study of employees of the French national\ngas and electric company, suggesting that whether health behaviors\ncontribute to the social gradient may depend on social context).\n\nWhen harmful health behaviors are more prevalent among people with\nlower socioeconomic status, one might argue that the consequent health\ninequalities are simply the result of social factors over which one\nhas no control—i.e., as akin to one’s childhood\nenvironment. This is too quick, however, for people\ndecide—at least in some sense—to smoke, to drink\nalcohol excessively, or to eat a poor diet, and such decisions may not\nalways be determined by social factors—e.g., material\nconstraints on access to healthy food. This matters for evaluations of\njustice, since, as we saw above, some argue that health inequalities\nare not unjust if they are the result of voluntary choices. If\ndecisions to engage in harmful health behaviors meet the appropriate\nthreshold of voluntariness, therefore, one may plausibly argue that\nthere is nothing unjust about that portion of the social gradient in\nhealth that is due to them.\n\nThe question of individual responsibility is also relevant for a\nnumber of areas of health policy. If individuals are responsible for\nthe downstream consequences of their harmful health behaviors,\npolicymakers may be justified in withholding care or assigning such\npatients lesser priority in the allocation of scarce resources (see\nVoigt 2013). Policymakers may also be justified in designing public\nhealth strategies that encourage people to make better choices\nregarding diet and physical exercise as opposed to addressing the\nstructural circumstances within which people make choices.\n\nTo begin, luck egalitarians would seem to be committed to the view\nthat health inequalities due to voluntarily chosen health behaviors\nare not unjust. While luck egalitarians hold it is unjust for one\nperson to be worse off than another because of brute luck,\ninequalities due to option luck—i.e., factors within a\nperson’s control—are just. Applied to health and health\ncare, luck egalitarianism would seem to imply that people should be\ncompensated for inequalities in health due to brute luck—e.g.,\ngenetic factors and the social determinants of health—but held\nresponsible for health outcomes due to option luck—e.g.,\nvoluntary decisions to drink excessively or eat a poor diet (see,\ne.g., Le Grand 1987, Segall 2010, and Cavallero 2011).\n\nFor example, if someone has a treatable case of lung cancer, we might\nordinarily reasonably presume that it would be unjust to deny him\nmedical care. However, if his cancer is due to a heavy, life-long\nsmoking habit, the question arises of whether the ordinary presumption\nis defeated or diminished in strength. For instance, if there is a\nchoice to be made (say, because of resource scarcity) between treating\nhim and treating another lung cancer patient who is in no way\nresponsible for her lung cancer, does justice require preferring the\nsecond patient? A simple application of luck egalitarianism would hold\nthat it is just to deny treatment to the smoker, as long as his\n“decision to smoke” qualifies as a “voluntary\nchoice” according to some suitable criteria.\n\nMany find this implication of luck egalitarianism to be objectionable,\nwith Elizabeth Anderson (1999: 296) calling it “the problem of\nabandonment of negligent victims”. Some luck\negalitarians respond that their view, properly understood, is not\ncommitted to this implication. For example, Alexander Cappelen and Ole\nNorheim (2005) and Julian Le Grand (2013) suggest that differences in\noption luck—i.e., differences in how the voluntary choices of\npeople play out—are themselves unjust, and so policies should be\nimplemented to ensure that the lucky help the unlucky, such as taxes\non cigarettes with the revenues used to provide care to smokers who\ndevelop lung cancer. Eric Cavallero (2011: 393–396) takes a\nstronger line, arguing that luck egalitarianism provides no support\nfor holding individuals accountable for the outcomes of health\nbehaviors. Cavallero (2011: 393) distinguishes between socially\ndetectable and socially undetectable risky behaviors, with smoking an\nexample of the former and poor stress management an example of the\nlatter. He argues that it is not necessarily more fair, by luck\negalitarian lights, to only hold people responsible for the former\nbehaviors than to simply refrain from holding people responsible for\ntheir choices (Cavallero 2011: 395).\n\nSegall (2010), by contrast, accepts that luck egalitarians cannot\navoid the abandonment objection by appeal to egalitarian\nconsiderations, but can do so if they appeal to moral considerations\nunrelated to distributive justice—e.g., meeting people’s\nbasic needs. Voorhoeve (2019: 155) similarly adopts a pluralistic\nview, arguing that a luck egalitarian approach should be combined with\na social egalitarian approach since the latter\n\n\nspecifies that one has reason to be averse to choice-based\ninequalities that threaten people’s status as equal citizens and\nsocial cohesion.\n\n\nOthers address the question of harmful health behaviors by developing\nRawls’s (1982) concept of the social division of\nresponsibility. According to Rawls (1982 [1999: 371]), society is\nresponsible for securing people’s basic liberties and providing\neach with a fair share of opportunities and income and wealth, while\nindividuals are responsible for setting goals and projects in light of\nthe legitimate claims they may make on social institutions. Applying\nthis concept to health inequalities, Kniess (2019: 115) argues that\npeople are responsible for the health outcomes of choices made under\nconditions of social justice, but not those outcomes due to choices\nmade under conditions of social disadvantage. As Kniess puts it,\n\n\nwhere there is no justice, there is no (substantive)\nresponsibility…the disadvantaged in an unjust society are\ntherefore let off the hook, so to speak, no matter what they do or\ndon’t do to look after their health. (2019: 116)\n\n\nEven if people’s choices to drink excessively, eat an unhealthy\ndiet, or fail to exercise are voluntary, on this view, if such choices\nare made under conditions of unjust social disadvantage, people are\nnot responsible for the downstream consequences. Daniels (2011)\ndevelops a similar Rawlsian view, but emphasizes that even under\nconditions of social justice, policymakers should be wary of holding\nindividuals accountable for the costs of their health behaviors. We\nall have an interest, Daniels argues, in having the freedom to make\nchoices regarding sport, sex, and diet without the fear of social\nsanction when our choices turn out to be “bad” ones (see\nalso Fleck 2012).\n\nBen Davies and Julian Savulescu (2019) provide an alternative argument\nfor holding individuals responsible for the health behaviors. They\nargue that where healthcare systems are grounded in solidarity, people\nhave obligations to fellow members of the system to protect their\nhealth and may be held responsible for some or all of the costs of\ntreatment that result from a failure to do so. Solidarity, Davies and\nSavulescu (2019: 135) argue, is a two-way street, meaning that members\nof a system founded in solidarity not only have claims on other\nmembers of the system, but also obligations to them. These obligations\ninclude a duty not to impose unreasonable costs on members of\nthe system, with such costs being the result of refusals of\n“Golden Opportunities”, that is, refusals to make\nrealistically adoptable, health promoting behavioral changes, which\nare performed under conditions conducive to responsible choice (Davies\n& Savulescu 2019: 139–140). Davies and Savulescu (2019, 141)\ncaution however, that it is only permissible to hold people\nresponsible for refusals of Golden Opportunities if solidarity is\npracticed in the broader social system, meaning that all people are\nheld responsible for failures of solidarity—e.g., including the\nrich for tax avoidance.\n\nIn sum, although the claim that inequalities due to voluntary chosen\nhealth behaviors are not unjust is prima facie plausible, few are\nwilling to endorse it and/or its policy implications without\nsignificant qualification. Luck egalitarians either reject it by\nappealing to further egalitarian considerations or opt for a\npluralistic view that enables them to avoid its counter-intuitive\npolicy implications. Similarly, those who adopt either Rawlsian or\nsolidaristic approaches hold that people are only responsible for the\noutcomes of their voluntarily chosen health behaviors in the context\nof a just society.\n\nOthers reject the idea that people are responsible for health outcomes\ndue to harmful health behaviors. Daniel Wikler (2004) offers a\nsustained critique of the unmodified luck egalitarian view, pressing\nthe abandonment objection but also raising a number of practical\nproblems regarding the view’s applications, including the\ndifficulty of identifying voluntary actions and the arbitrariness of\nfinding fault with some choices but not others (see also Fleck 2012).\nHe concludes that personal responsibility should only be employed in\nhealth policy as an ideal in health promotion campaigns to motivate\nand encourage people to take an active role in living healthy\nlives.\n\nNeil Levy (2019) similarly rejects the idea of personal responsibility\nfor health by focusing on the greater prevalence of harmful health\nbehaviors among people with low socioeconomic status. The explanation\nfor this disparity, Levy (2019: 106–107) argues, is that such\npeople, due to their circumstances, have reduced agential capacities,\nlower education, and make choices under the stressful conditions of\npoverty. For many, these challenges are significant enough to render\nthem non-responsible for the behaviors that contribute to ill health.\nSince most people who are causally responsible for their ill health\nare morally non-responsible in this way, Levy argues (2019: 109),\nhealth policy should not be designed on the premise that people are\nresponsible for their ill health. Instead, since the distribution of\nagential capacities and the circumstances of choice is the result of\npublic policy and the actions of large corporations, it is these\nlatter actors who bear responsibility for the health outcomes in\nquestion (Levy 2019: 110).\n\nOthers are skeptical of this line of argument. Ben Schwan (2021)\ncautions that the mere fact that people’s choices are influenced\nby the social determinants of health does not mean that they are not\nresponsible for them—some social determinants of health are\n“responsibility-preserving”. Cavallero (2019) argues\nsimilarly that the health-related choices of people with low\nsocio-economic status satisfy widely accepted criteria of responsible\nchoice, namely, that they are made in the context of reasonable\nalternatives and are not coerced. He argues further that questioning\nthe autonomy and responsibility of people of low socioeconomic status\nis incompatible with the liberal ideal that all competent adults are\ndeserving of equal respect and opens the door to paternalistic\nrestrictions of people’s liberty (Cavallero 2019). This does not\nimply, however, that society is not also responsible for the\ndisparate health outcomes of low SES individuals. Cavallero (2019:\n378) agrees that the pattern Levy (2019) identifies is morally\ntroubling and argues that governments have an obligation to ensure\nthat people do\n\n\nnot face unequal health opportunities simply in virtue of their\nsocioeconomic status of origin if those inequalities are remediable\nthrough reasonable public interventions.\n\n\nFinally, others argue that the focus on personal responsibility in\ndebates regarding priority setting and health promotion is misplaced\nor even fundamentally mistaken. Phoebe Friesen (2018: 56) makes a\nstrong case that the behaviors policymakers wish to hold people\nresponsible for—e.g., excessive drinking, smoking, and poor\neating habits—are stigmatized. She challenges proponents of\nconsidering personal responsibility in health policy to either explain\ntheir focus on socially undesirable behaviors, or to extend their\narguments to include behaviors that contribute to ill health, are\nknown to be risky, and that are under people’s\ncontrol—e.g., living in a city with high levels of air\npollution, engaging in a dangerous sport, or spending too much time in\nthe sun (Friesen 2018: 56). Others worry that a focus on individual\nresponsibility may distract policymakers from the more urgent need to\naddress the social determinants of health and may also stigmatize\npeople who act “irresponsibly” (Voigt 2013; Goldberg\n2012). Since socio-economic conditions are the principal determinants\nof health outcomes, these critics argue, such structural factors ought\nto be the focus of public policy.\n8. Justice and Global Health Inequalities\n\nDiscussions of justice and health inequality often focus on\ninequalities among members of the same polity. However, scholars have\nalso addressed the justice of international health disparities, which,\ndepending on the countries of comparison, can be drastic. As we note\nabove, life expectancy in low-income countries in 2016 was 62.7 years,\ncompared to 80.8 years in high-income countries, a gap of 18.1 years\n(WHO 2020). These disparities are no doubt driven by the wide income\ndifferences among these countries, and so questions regarding their\njustice are tightly connected to questions of global distributive\njustice (see entries on\n international distributive justice\n and\n global justice).\n However, global health inequalities are also driven by war, climate\nchange, healthcare worker migration, and the funding decisions of\nsponsors of medical research, among other factors. Positions regarding\nthe justice of global health disparities may therefore have\nfar-reaching implications for a diverse set of policy spheres.\n\nGiven the tight connection between global health justice and global\ndistributive justice, it is no surprise that approaches to the former\npiggy-back on approaches to the latter. Briefly,\ncosmopolitans start from the premise that all humans are\nmoral equals and argue on this basis that high-income states have\nrobust distributive obligations to people regardless of their\nnationality or relation to them. Some cosmopolitans defend a\nsufficientarian position (Brock 2009), while others argue that global\njustice demands equality since national membership is a morally\narbitrary factor on the basis of which people should not be\ndisadvantaged (Caney 2005). Institutionalists do not reject\nthe claim that all humans are moral equals but argue that robust\ndistributive obligations—as opposed to a duty of\nassistance—are contingent on the existence of certain types of\ninstitutions, whether a coercive legal system (Nagel 2005; Blake 2001)\nor institutions establishing substantial economic interdependence\n(Sangiovanni 2007; J. Cohen & Sabel 2006).\n\nTurning to theories of global health justice, a number of scholars\ndefend sufficientarian accounts, according to which all people are\nentitled to some minimum level of health or opportunity to be healthy.\nSridhar Venkatapuram (2011: 224) defends a cosmopolitan account of\nglobal health justice according to which all people have an\nentitlement to the capability to be healthy, secured at a threshold\nsufficient to ensure their equal human dignity. Jennifer Prah Ruger\n(2018: 82) defends an institutionalist sufficientarian approach,\n“provincial globalism”, according to which states and the\nbroader global community have an obligation to ensure that all people\nenjoy a threshold level of central health capabilities. Others defend\nthe human right to health, understood as a right to “protection\nagainst ‘standard threats’ to health” (Wolff 2012:\n27), or as a right to those things necessary for a basic minimum of\nhealth and so for a minimally good life (Hassoun 2020; see also Powers\n& Faden 2006: 85).\n\nSegall (2010) defends a cosmopolitan luck prioritarian account of\nglobal health justice. National membership is a morally arbitrary\nfeature of one’s identity, Segall argues, and so disadvantages\nin people’s opportunities for health that are due to national\nmembership should be addressed, with priority given to those who are\nworse off. While luck egalitarian or prioritarian positions often\npermit deficits in health due to voluntary choices in the domestic\ncontext, Segall (2010) rejects appeals to national responsibility to\njustify global health disparities on the grounds that not all\nresidents of a polity can be held responsible for national policies.\nEven in an ideal world of democratic countries operating in the\ncontext of a just global economic order, policy decisions will be made\non behalf of children and against the wishes of dissenters.\n\nHausman (2012) criticizes luck egalitarian and prioritarian accounts\non the grounds that they may imply policies that exacerbate\ninternational inequalities in income or opportunity. Since citizens of\nsome low-income countries experience better health than citizens of\nsome middle- and high-income countries, policies aimed at addressing\nthe poor health outcomes of the latter may exacerbate income\ninequalities among these countries. Luck egalitarian and prioritarian\nviews therefore face difficult questions regarding the prioritization\nof health equality over equality of income or equality of opportunity.\nAs an alternative to these accounts, Hausman (2012: 45) proposes a\nrelational egalitarian account of global health justice, positing that\nsome health inequalities across borders may be drastic enough to\n\n\nrender individuals in one nation vulnerable to domination by other\nnations and diminish their voice in international co-operation.\n\n\nAlthough Hausman’s proposal is more of a sketch than an account\nof global health justice, it faces the above-mentioned problem with\ndomestic relational egalitarian approaches, namely, identifying the\nhealth inequalities which in fact undermine equal relations. For\nexample, when are the difference in life expectancy among citizens of\ntwo countries large enough to imply that they do not have equal status\nwhen representatives negotiate a trade deal?\n\nDaniels (2008) develops an institutionalist approach to global health\njustice. He rejects the cosmopolitan idea that national membership is\nmorally arbitrary on the grounds that co-nationals stand in a morally\nrelevant set of institutionally mediated relationships which establish\nsustainable claims of egalitarian justice. Co-nationals are subject to\nthe same coercively enforced rules of social cooperation of which they\nare the putative co-authors (see Nagel 2005). While Daniels (2008)\nrejects Segall’s claim that global inequalities due to national\nmembership are unjust, he follows Joshua Cohen and Charles Sabel\n(2006) in arguing that international organizations and agreements\nestablish morally relevant relationships and so must be designed in\naccordance with principles of justice. Thus, Daniels (2008) argues,\nthe World Health Organization must show equal concern to all in its\ndistribution of public health expertise and technology, and\ninternational property rights regimes must be designed to better\naddress the global burden of disease.\n\nGopal Sreenivasan (2007b: 221) side steps the above-mentioned debates\nin global distributive justice, and instead offers a non-ideal account\nof global health justice, one which anticipates the “minimum\nrequirements that any plausible and complete ideal theory of\njustice will include”. He argues that the richest nations have\nan obligation to transfer 1% of GDP to the poorest nations with\npriority given to spending it on the determinants of health, including\nhealth care and public health, income and nutrition support, and\neducation. This transfer is neither too demanding, nor, if spent on\nthe determinants of health, too minimal for it promises to\nsubstantially improve the life expectancy of the world’s poorest\npeople (Sreenivasan 2007b).\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Adler, Nancy E. and Katherine Newman, 2002, “Socioeconomic\nDisparities In Health: Pathways And Policies”, <em>Health\nAffairs</em>, 21(2): 60–76. doi:10.1377/hlthaff.21.2.60",
                "Adler, Nancy E. and Joan M. Ostrove, 1999, “Socioeconomic\nStatus and Health: What We Know and What We Don’t”,\n<em>Socioeconomic Status and Health in Industrial Nations: Social,\nPsychological, and Biological Pathways</em>, volume title of\n<em>Annals of the New York Academy of Sciences</em>, 896: 3–15.\ndoi:10.1111/j.1749-6632.1999.tb08101.x",
                "Albertsen, Andreas and Carl Knight, 2015, “A Framework for\nLuck Egalitarianism in Health and Healthcare”, <em>Journal of\nMedical Ethics</em>, 41(2): 165–169.\ndoi:10.1136/medethics-2013-101666",
                "Aldabe, B., R. Anderson, M. Lyly-Yrjanainen, A. Parent-Thirion, G.\nVermeylen, C. C. Kelleher, and I. Niedhammer, 2011,\n“Contribution of Material, Occupational, and Psychosocial\nFactors in the Explanation of Social Inequalities in Health in 28\nCountries in Europe”, <em>Journal of Epidemiology &amp;\nCommunity Health</em>, 65(12): 1123–1131.\ndoi:10.1136/jech.2009.102517",
                "Anand, Sudhir, 2004, “The Concern for Equity in\nHealth”, in Anand, Peter, and Sen 2004: 15–20.",
                "Anand, Sudhir and Fabienne Peter, 2000, “Equal\nOpportunity”, in J. Cohen and Rogers 2000: 48–52.",
                "Anand, Sudhir, Fabienne Peter, and Amartya Sen (eds.), 2004,\n<em>Public Health, Ethics, and Equity</em>, New York: Oxford\nUniversity Press.",
                "Anand, Sudhir, Finn Diderichsen, Timothy Evans, Vladimir M.\nShkolnikov, and Meg Wirth, 2001, “Measuring Disparities in\nHealth: Methods and Indicators”, in T. Evans et al. 2001:\n49–67.",
                "Anderson, Elizabeth S., 1999, “What Is the Point of\nEquality?”, <em>Ethics</em>, 109(2): 287–337.\ndoi:10.1086/233897",
                "Arias, Elizabeth, 2016, “Changes in Life Expectancy by Race\nand Hispanic Origin in the United States, 2013–2014”, NCHS\nData Brief 244, Hyattsville, MD: National Center for Health\nStatistics.\n [<a href=\"https://www.cdc.gov/nchs/products/databriefs/db244.htm\" target=\"other\">Arias 2016 available online</a>]",
                "Arias, Elizabeth, Betzaida Tejada-Vera, and Farida Ahmad, 2021,\n“Provisional Life Expectancy Estimates for January through June,\n2020”, <em>Vital Statistics Rapid Release</em> 10, Hyattsville,\nMD: National Center for Health Statistics.\n [<a href=\"https://depts.washington.edu/pandemicalliance/2021/02/19/provisional-life-expectancy-estimates-for-january-through-june-2020/\" target=\"other\">Arias et al. 2021 available online</a>]",
                "Arneson, Richard J., 2002, “Why Justice Requires Transfers\nto Offset Income and Wealth Inequalities”, <em>Social Philosophy\nand Policy</em>, 19(1): 172–200.\ndoi:10.1017/S0265052502191084",
                "Asada, Yukiko, 2013, “A Summary Measure of Health\nInequalities”, in Eyal et al. 2013: 37–51.\ndoi:10.1093/acprof:oso/9780199931392.003.0004",
                "–––, 2019, “Measuring Health Inequity: A\nPublic Health Ethics Inquiry”, in Mastroianni et al. 2019:\n301–311. doi:10.1093/oxfordhb/9780190245191.013.23",
                "Backlund, Eric, Paul D. Sorlie, and Norman J. Johnson, 1999,\n“A Comparison of the Relationships of Education and Income with\nMortality: The National Longitudinal Mortality Study”,\n<em>Social Science &amp; Medicine</em>, 49(10): 1373–1384.\ndoi:10.1016/S0277-9536(99)00209-9",
                "Blacksher, Erika, 2018, “Shrinking Poor White Life Spans:\nClass, Race, and Health Justice”, <em>The American Journal of\nBioethics</em>, 18(10): 3–14.\ndoi:10.1080/15265161.2018.1513585",
                "Blake, Michael, 2001, “Distributive Justice, State Coercion,\nand Autonomy”, <em>Philosophy &amp; Public Affairs</em>, 30(3):\n257–296. doi:10.1111/j.1088-4963.2001.00257.x",
                "Bleakley, Hoyt, 2010, “Malaria Eradication in the Americas:\nA Retrospective Analysis of Childhood Exposure”, <em>American\nEconomic Journal: Applied Economics</em>, 2(2): 1–45.\ndoi:10.1257/app.2.2.1",
                "Boyce, W. Thomas, Marla B. Sokolowski, and Gene E. Robinson, 2012,\n“Toward a New Biology of Social Adversity”,\n<em>Proceedings of the National Academy of Sciences</em>,\n109(Supplement 2): 17143–17148. doi:10.1073/pnas.1121264109",
                "Braveman, Paula A., Catherine Cubbin, Susan Egerter, David R.\nWilliams, and Elsie Pamuk, 2010, “Socioeconomic Disparities in\nHealth in the United States: What the Patterns Tell Us”,\n<em>American Journal of Public Health</em>, 100(S1): S186–S196.\ndoi:10.2105/AJPH.2009.166082",
                "Braveman, Paula A., Shiriki Kumanyika, Jonathan Fielding, Thomas\nLaVeist, Luisa N. Borrell, Ron Manderscheid, and Adewale Troutman,\n2011, “Health Disparities and Health Equity: The Issue Is\nJustice”, <em>American Journal of Public Health</em>, 101(S1):\nS149–S155. doi:10.2105/AJPH.2010.300062",
                "Brock, Gillian, 2009, <em>Global Justice: A Cosmopolitan\nAccount</em>, New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199230938.001.0001",
                "Brulle, Robert J. and David N. Pellow, 2006, “Environmental\nJustice: Human Health and Environmental Inequalities”,\n<em>Annual Review of Public Health</em>, 27: 103–124.\ndoi:10.1146/annurev.publhealth.27.021405.102124",
                "Brunner, Eric and Marmot, Michael, 2005, “Social\nOrganization, Stress, and Health”, in Marmot and Wilkinson 2005:\n6–28. doi:10.1093/acprof:oso/9780198565895.001.0001 ",
                "Buchbinder, Mara, Michele R. Rivkin-Fish, and Rebecca L. Walker\n(eds.), 2016, <em>Understanding Health Inequalities and Justice: New\nConversations across the Disciplines</em>, (Studies in Social\nMedicine), Chapel Hill, NC: The University of North Carolina\nPress.",
                "Caney, Simon, 2005, <em>Justice Beyond Borders: A Global Political\nTheory</em>, Oxford: Oxford University Press.\ndoi:10.1093/019829350X.001.0001",
                "Cappelen, A. W. and O. F. Norheim, 2005, “Responsibility in\nHealth Care: A Liberal Egalitarian Approach”, <em>Journal of\nMedical Ethics</em>, 31(8): 476–480.\ndoi:10.1136/jme.2004.010421",
                "Case, Anne and Angus Deaton, 2015, “Rising Morbidity and\nMortality in Midlife among White Non-Hispanic Americans in the 21st\nCentury”, <em>Proceedings of the National Academy of\nSciences</em>, 112(49): 15078–15083.\ndoi:10.1073/pnas.1518393112",
                "–––, 2020, <em>Deaths of Despair and the Future\nof Capitalism</em>, Princeton, NJ: Princeton University Press.",
                "Case, Anne, Angela Fertig, and Christina Paxson, 2005, “The\nLasting Impact of Childhood Health and Circumstance”,\n<em>Journal of Health Economics</em>, 24(2): 365–389.\ndoi:10.1016/j.jhealeco.2004.09.008",
                "Case, Anne, Darren Lubotsky, and Christina Paxson, 2002,\n“Economic Status and Health in Childhood: The Origins of the\nGradient”, <em>American Economic Review</em>, 92(5):\n1308–1334. doi:10.1257/000282802762024520",
                "Case, Anne and Christina Paxson, 2011, “The Long Reach of\nChildhood Health and Circumstance: Evidence from the Whitehall II\nStudy”, <em>The Economic Journal</em>, 121(554):\nF183–F204. doi:10.1111/j.1468-0297.2011.02447.x",
                "Cavallero, Eric, 2011, “Health, Luck and Moral Fallacies of\nthe Second Best”, <em>The Journal of Ethics</em>, 15(4):\n387–403. doi:10.1007/s10892-011-9109-z",
                "–––, 2019, “Opportunity and Responsibility\nfor Health”, <em>The Journal of Ethics</em>, 23(4):\n369–386. doi:10.1007/s10892-019-09300-7",
                "Chang, W, 2002, “The Meaning and Goals of Equity in\nHealth”, <em>Journal of Epidemiology &amp; Community\nHealth</em>, 56(7): 488–491. doi:10.1136/jech.56.7.488",
                "Chetty, Raj, Michael Stepner, Sarah Abraham, Shelby Lin, Benjamin\nScuderi, Nicholas Turner, Augustin Bergeron, and David Cutler, 2016,\n“The Association Between Income and Life Expectancy in the\nUnited States, 2001-2014”, <em>Journal of the American Medical\nAssociation</em>, 315(16):\n1750–1766. doi:10.1001/jama.2016.4226",
                "Clark, Uraina S., Evan R. Miller, and Rachal R. Hegde, 2018,\n“Experiences of Discrimination Are Associated With Greater\nResting Amygdala Activity and Functional Connectivity”,\n<em>Biological Psychiatry: Cognitive Neuroscience and\nNeuroimaging</em>, 3(4): 367–378.\ndoi:10.1016/j.bpsc.2017.11.011",
                "Clougherty, Jane E., Kerry Souza, and Mark R. Cullen, 2010,\n“Work and Its Role in Shaping the Social Gradient in\nHealth”, <em>The Biology of Disadvantage: Socioeconomic Status\nand Health</em>, volume title of <em>Annals of the New York Academy of\nSciences</em>, 1186: 102–124.\ndoi:10.1111/j.1749-6632.2009.05338.x",
                "Cohen, Joshua and Joel Rogers (eds.), 2000, <em>Is Inequality Bad\nfor Our Health?</em>, (New Democratic Forum Series), Boston, MA:\nBeacon Press.",
                "Cohen, Joshua and Charles Sabel, 2006, “Extra Rempublicam\nNulla Justitia?”, <em>Philosophy &amp; Public Affairs</em>,\n34(2): 147–175. doi:10.1111/j.1088-4963.2006.00060.x",
                "Cohen, Sheldon, Scott Line, Stephen B. Manuck, Bruce S. Rabin,\nEugene R. Heise, and Jay R. Kaplan, 1997, “Chronic Social\nStress, Social Status, and Susceptibility to Upper Respiratory\nInfections in Nonhuman Primates”, <em>Psychosomatic\nMedicine</em>, 59(3): 213–221.\ndoi:10.1097/00006842-199705000-00001",
                "Colen, Cynthia G., David M. Ramey, Elizabeth C. Cooksey, and David\nR. Williams, 2018, “Racial Disparities in Health among Nonpoor\nAfrican Americans and Hispanics: The Role of Acute and Chronic\nDiscrimination”, <em>Social Science &amp; Medicine</em>, 199:\n167–180. doi:10.1016/j.socscimed.2017.04.051",
                "Crimmins, Eileen M. and Yasuhiko Saito, 2001, “Trends in\nHealthy Life Expectancy in the United States, 1970–1990: Gender,\nRacial, and Educational Differences”, <em>Social Science &amp;\nMedicine</em>, 52(11): 1629–1641.\ndoi:10.1016/S0277-9536(00)00273-2",
                "Culyer, A. J. and Adam Wagstaff, 1993, “Equity and Equality\nin Health and Health Care”, <em>Journal of Health\nEconomics</em>, 12(4): 431–457.\ndoi:10.1016/0167-6296(93)90004-X",
                "Currie, Janet, 2009, “Healthy, Wealthy, and Wise:\nSocioeconomic Status, Poor Health in Childhood, and Human Capital\nDevelopment”, <em>Journal of Economic Literature</em>, 47(1):\n87–122. doi:10.1257/jel.47.1.87",
                "Cutler, David M., Adriana Lleras-Muney, and Tom Vogl, 2011,\n“Socioeconomic Status and Health: Dimensions and\nMechanisms”, in <em>The Oxford Handbook of Health\nEconomics</em>, Sherry Glied and Peter C. Smith (eds.), Oxford: Oxford\nUniversity Press, 123–163.\ndoi:10.1093/oxfordhb/9780199238828.013.0007",
                "Daniels, Norman, 1985, <em>Just Health Care</em>, New York:\nCambridge University Press. doi:10.1017/CBO9780511624971",
                "–––, 2008, <em>Just Health: Meeting Health Needs\nFairly</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511809514",
                "–––, 2011, “Individual and Social\nResponsibility for Health”, in Knight and Stemplowska 2011:\n266–286. doi:10.1093/acprof:oso/9780199565801.003.0014",
                "Daniels, Norman, Bruce Kennedy, and Ichiro Kawachi, 2000,\n“Why Justice is Good for our Health”, in J. Cohen and\nRogers 2000: 3–33.",
                "Davies, Ben and Julian Savulescu, 2019, “Solidarity and\nResponsibility in Health Care”, <em>Public Health Ethics</em>,\n12(2): 133–144. doi:10.1093/phe/phz008",
                "Dawson, Angus (ed.), 2011, <em>Public Health Ethics: Key Concepts\nand Issues in Policy and Practice</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9780511862670",
                "Deaton, Angus, 2002, “Policy Implications Of The Gradient Of\nHealth And Wealth”, <em>Health Affairs</em>, 21(2): 13–30.\ndoi:10.1377/hlthaff.21.2.13",
                "–––, 2003, “Health, Inequality, and\nEconomic Development”, <em>Journal of Economic Literature</em>,\n41(1): 113–158. doi:10.1257/jel.41.1.113",
                "–––, 2013, “What Does the Empirical\nEvidence Tell Us About the Injustice of Health Inequalities?”,\nin Eyal et al. 2013: 263–281.\ndoi:10.1093/acprof:oso/9780199931392.003.0018",
                "Elo, Irma T. and Samuel H. Preston, 1996, “Educational\nDifferentials in Mortality: United States, 1979–1985”,\n<em>Social Science &amp; Medicine</em>, 42(1): 47–57.\ndoi:10.1016/0277-9536(95)00062-3",
                "Evans, Robert G., M. Hodge, and I. B. Pless, 1994, “If Not\nGenetics, Then What? Biological Pathways and Population Health”,\nin <em>Why Are Some People Healthy and Others Not? The Determinants of\nHealth Populations</em>, Robert G. Evans, Morris L. Barer, and\nTheodore R. Marmor (eds.), New York: De Gruyter, 161–188.\ndoi:10.1515/9783112421628-008",
                "Evans, Timothy, Margaret Whitehead, Finn Diderichsen, Abbas\nBhuiya, and Meg Wirth, 2001, <em>Challenging Inequities in Health:\nFrom Ethics to Action</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195137408.001.0001",
                "Eyal, Nir, 2013, “Leveling Down Health”, in Eyal et\nal. 2013: 197–213.\ndoi:10.1093/acprof:oso/9780199931392.003.0014",
                "–––, 2018, “Inequality in Political\nPhilosophy and in Epidemiology: A Remarriage: Inequality in Political\nPhilosophy and in Epidemiology”, <em>Journal of Applied\nPhilosophy</em>, 35(1): 149–167. doi:10.1111/japp.12150",
                "Eyal, Nir, Samia A. Hurst, Ole F. Norheim, and Dan Wikler (eds.),\n2013, <em>Inequalities in Health: Concepts, Measures, and Ethics</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199931392.001.0001",
                "Fishman, Jayna and Douglas MacKay, 2019, “Rawlsian Justice\nand the Social Determinants of Health”, <em>Journal of Applied\nPhilosophy</em>, 36(4): 608–625. doi:10.1111/japp.12339",
                "Fleck, Leonard M., 2012, “Whoopie Pies, Supersized Fries:\n‘Just’ Snacking? ‘Just’ Des(s)Erts?”,\n<em>Cambridge Quarterly of Healthcare Ethics</em>, 21(1): 5–19.\ndoi:10.1017/S0963180111000454",
                "Fourie, Carina, 2016, “The Sufficiency View: A\nPrimer”, in Fourie and Rid 2016: 11–29.\ndoi:10.1093/acprof:oso/9780199385263.003.0002",
                "Fourie, Carina and Annette Rid (eds.), 2016, <em>What Is Enough?\nSufficiency, Justice, and Health</em>, New York: Oxford University\nPress. doi:10.1093/acprof:oso/9780199385263.001.0001",
                "Friesen, Phoebe, 2018, “Personal Responsibility within\nHealth Policy: Unethical and Ineffective”, <em>Journal of\nMedical Ethics</em>, 44(1): 53–58.\ndoi:10.1136/medethics-2016-103478",
                "Goldberg, D. S., 2012, “Social Justice, Health Inequalities\nand Methodological Individualism in US Health Promotion”,\n<em>Public Health Ethics</em>, 5(2): 104–115.\ndoi:10.1093/phe/phs013",
                "Hassoun, Nicole, 2020, <em>Global Health Impact: Extending Access\nto Essential Medicines</em>, New York: Oxford University Press.\ndoi:10.1093/oso/9780197514993.001.0001",
                "Hausman, Daniel M., 2007, “What’s Wrong with Health\nInequalities?”, <em>Journal of Political Philosophy</em>, 15(1):\n46–66. doi:10.1111/j.1467-9760.2007.00270.x",
                "–––, 2012, “What’s Wrong with Global\nHealth Inequalities?” in Lenard and Straehle 2012:\n34–51.",
                "–––, 2013, “Egalitarian Critiques of\nHealth Inequalities”, in Eyal et al. 2013: 95–112.\ndoi:10.1093/acprof:oso/9780199931392.003.0008",
                "–––, 2019, “Some Remarks on Equality in\nHealth and Health Care”, <em>Social Justice Research</em>,\n32(2): 137–154. doi:10.1007/s11211-018-0320-y",
                "Hero, Joachim O., Alan M. Zaslavsky, and Robert J. Blendon, 2017,\n“The United States Leads Other Nations In Differences By Income\nIn Perceptions Of Health And Health Care”, <em>Health\nAffairs</em>, 36(6): 1032–1040.\ndoi:10.1377/hlthaff.2017.0006",
                "Huisman, Martijn, Anton E. Kunst, Matthias Bopp, Jens-Kristian\nBorgan, Carme Borrell, Giuseppe Costa, Patrick Deboosere, Sylvie\nGadeyne, Myer Glickman, Chiara Marinacci, Christoph Minder, Enrique\nRegidor, Tapani Valkonen, and Johan P. Mackenbach, 2005,\n“Educational Inequalities in Cause-Specific Mortality in\nMiddle-Aged and Older Men and Women in Eight Western European\nPopulations”, <em>The Lancet</em>, 365(9458): 493–500.\ndoi:10.1016/S0140-6736(05)17867-2",
                "Kawachi, Ichiro, Bruce P. Kennedy, and Richard G. Wilkinson\n(eds.), 1999, <em>Income Inequality and Health: A Reader</em>, New\nYork: New Press.",
                "Kelleher, J. Paul, 2016, “Health Inequalities and Relational\nEgalitarianism”, in Buchbinder et al. 2016: 88–111.",
                "King, Nicholas B., 2016, “Justice, Evidence, and\nInterdisciplinary Health Inequalities Research”, in Buchbinder\net al. 2016: 213–234.",
                "Kniess, Johannes, 2018, “A Social Division of Responsibility\nfor Health”, <em>Les ateliers de l’éthique</em>\n(<em>The Ethics Forum</em>), 13(3): 105–122.\ndoi:10.7202/1061221ar",
                "–––, 2019, “Justice in the Social\nDistribution of Health”, <em>Social Theory and Practice</em>,\n45(3): 397–425. doi:10.5840/soctheorpract201992665",
                "Knight, Carl and Zofia Stemplowska (eds.), 2011,\n<em>Responsibility and Distributive Justice</em>, New York: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199565801.001.0001",
                "Kunst, A. E. and J. P. Mackenbach, 1994, “The Size of\nMortality Differences Associated with Educational Level in Nine\nIndustrialized Countries”, <em>American Journal of Public\nHealth</em>, 84(6): 932–937. doi:10.2105/AJPH.84.6.932",
                "Le Grand, Julian, 1987, “Equity, Health, and Health\nCare”, <em>Social Justice Research</em>, 1(3): 257–274.\ndoi:10.1007/BF01047663",
                "–––, 2013, “Individual Responsibility,\nHealth, and Health Care”, in Eyal et al. 2013: 299–306.\ndoi:10.1093/acprof:oso/9780199931392.003.0020",
                "Lenard, Patti Tamara and Christine Straehle (eds.), 2012,\n<em>Health Inequalities and Global Justice</em>, Edinburgh: Edinburgh\nUniversity Press.",
                "Leon, David and Gill Walt, 2001, <em>Poverty, Inequality, and\nHealth: An International Perspective</em>, Oxford: Oxford University\nPress. doi:10.1093/acprof:oso/9780192631961.001.0001",
                "Levy, Neil, 2019, “Taking Responsibility for\nResponsibility”, <em>Public Health Ethics</em>, 12(2):\n103–113. doi:10.1093/phe/phz001",
                "Lippert-Rasmussen, Kasper, 2013, “When Group Measures of\nHealth Should Matter”, in Eyal et al. 2013: 52–65.\ndoi:10.1093/acprof:oso/9780199931392.003.0005",
                "Mackenbach, Johan P., 2019, <em>Health Inequalities: Persistence\nand Change in Modern Welfare States</em>, New York: Oxford University\nPress. doi:10.1093/oso/9780198831419.001.0001",
                "Mackenbach, Johan P., Irina Stirbu, Albert-Jan R. Roskam, Maartje\nM. Schaap, Gwenn Menvielle, Mall Leinsalu, and Anton E. Kunst, 2008,\n“Socioeconomic Inequalities in Health in 22 European\nCountries”, <em>New England Journal of Medicine</em>, 358(23):\n2468–2481. doi:10.1056/NEJMsa0707519",
                "Marmot, Michael, 2000, “Multilevel Approaches to\nUnderstanding Social Determinants”, in <em>Social\nEpidemiology</em>, Lisa F. Berkman and Ichiro Kawachi (eds.), Oxford:\nOxford University Press, 349–367.",
                "–––, 2001, “Inequalities in Health”,\n<em>New England Journal of Medicine</em>, 345(2): 134–136.\ndoi:10.1056/NEJM200107123450210",
                "–––, 2004, <em>The Status Syndrome: How Social\nStanding Affects Our Health and Longevity</em>, New York: Times\nBooks/Henry Holt.",
                "–––, 2005, “Introduction”, in Marmot\nand Wilkinson (eds) 2005: 1–5. ",
                "Marmot, M. G., H. Bosma, H. Hemingway, E. Brunner, and S.\nStansfeld, 1997, “Contribution of Job Control and Other Risk\nFactors to Social Variations in Coronary Heart Disease\nIncidence”, <em>The Lancet</em>, 350(9073): 235–239.\ndoi:10.1016/S0140-6736(97)04244-X",
                "Marmot, M. G., G. Rose, M. Shipley, and P. J. Hamilton, 1978,\n“Employment Grade and Coronary Heart Disease in British Civil\nServants”, <em>Journal of Epidemiology &amp; Community\nHealth</em>, 32(4): 244–249. doi:10.1136/jech.32.4.244",
                "Marmot, M. G., M. J. Shipley, and Geoffrey Rose, 1984,\n“Inequalities in Death—Specific Explanations of a General\nPattern?”, <em>The Lancet</em>, 323(8384): 1003–1006.\ndoi:10.1016/S0140-6736(84)92337-7",
                "Marmot, Michael and Richard G. Wilkinson (eds.), 2005, <em>Social\nDeterminants of Health</em>, second edition, Oxford: Oxford University\nPress. doi:10.1093/acprof:oso/9780198565895.001.0001",
                "Mastroianni, Anna C., Jeffrey P. Kahn, and Nancy E. Kass (eds.),\n2019, <em>The Oxford Handbook of Public Health Ethics</em>, Oxford:\nOxford University Press.\ndoi:10.1093/oxfordhb/9780190245191.001.0001",
                "McDonough, P., G. J. Duncan, D. Williams, and J. House, 1997,\n“Income Dynamics and Adult Mortality in the United States, 1972\nthrough 1989”, <em>American Journal of Public Health</em>,\n87(9): 1476–1483. doi:10.2105/AJPH.87.9.1476",
                "McEwen, Bruce S., 1998, “Protective and Damaging Effects of\nStress Mediators”, <em>New England Journal of Medicine</em>,\n338(3): 171–179. doi:10.1056/NEJM199801153380307",
                "McEwen, Craig A. and Bruce S. McEwen, 2017, “Social\nStructure, Adversity, Toxic Stress, and Intergenerational Poverty: An\nEarly Childhood Model”, <em>Annual Review of Sociology</em>, 43:\n445–472. doi:10.1146/annurev-soc-060116-053252",
                "Murray, C. J., E. E. Gakidou, and J. Frenk, 1999, “Health\nInequalities and Social Group Differences: What Should We\nMeasure?”, <em>Bulletin of the World Health Organization</em>,\n77(7): 537–543.",
                "Nagel, Thomas, 2005, “The Problem of Global Justice”,\n<em>Philosophy &amp; Public Affairs</em>, 33(2): 113–147.\ndoi:10.1111/j.1088-4963.2005.00027.x",
                "Norheim, Ole F., Ezekiel J. Emanuel, and Joseph Millum (eds.),\n2019, <em>Global Health Priority-Setting: Beyond\nCost-Effectiveness</em>, New York: Oxford University Press.\ndoi:10.1093/oso/9780190912765.001.0001",
                "Peter, Fabienne, 2004, “Health Equity and Social\nJustice”, in Anand, Peter, and Sen 2004: 93–105.",
                "Petrovic, Dusan, Carlos de Mestral, Murielle Bochud, Mel Bartley,\nMika Kivimäki, Paolo Vineis, Johan Mackenbach, and Silvia\nStringhini, 2018, “The Contribution of Health Behaviors to\nSocioeconomic Inequalities in Health: A Systematic Review”,\n<em>Preventive Medicine</em>, 113: 15–31.\ndoi:10.1016/j.ypmed.2018.05.003",
                "Pickett, Kate E. and M. Pearl, 2001, “Multilevel Analyses of\nNeighbourhood Socioeconomic Context and Health Outcomes: A Critical\nReview”, <em>Journal of Epidemiology &amp; Community\nHealth</em>, 55(2): 111–122. doi:10.1136/jech.55.2.111",
                "Pickett, Kate E. and Richard G. Wilkinson, 2015, “Income\nInequality and Health: A Causal Review”, <em>Social Science\n&amp; Medicine</em>, 128: 316–326.\ndoi:10.1016/j.socscimed.2014.12.031",
                "Pogge, Thomas W., 2004, “Relational Conceptions of Justice:\nResponsibilities for Health Outcomes”, in Anand, Peter, and Sen\n2004: 135–161.",
                "Powers, Madison and Ruth R. Faden, 2006, <em>Social Justice: The\nMoral Foundations of Public Health and Health Policy</em>, (Issues in\nBiomedical Ethics), New York: Oxford University Press.",
                "Prah Ruger, Jennifer, 2010, <em>Health and Social Justice</em>,\nNew York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199559978.001.0001",
                "–––, 2018, <em>Global Health Justice and\nGovernance</em>, New York: Oxford University Press.\ndoi:10.1093/oso/9780199694631.001.0001",
                "Preda, Adina and Kristin Voigt, 2015, “The Social\nDeterminants of Health: Why Should We Care?”, <em>The American\nJournal of Bioethics</em>, 15(3): 25–36.\ndoi:10.1080/15265161.2014.998374",
                "Rawls, John, 1971, <em>A Theory of Justice</em>, Cambridge, MA:\nHarvard University Press.",
                "–––, 1982 [1999], “Social Unity and\nPrimary Goods”, in <em>Utilitarianism and Beyond</em>, Amartya\nSen and Bernard Williams (eds.), Cambridge: Cambridge University\nPress, 159–186. Reprinted in Rawls 1999: 359–387.\ndoi:10.1017/CBO9780511611964.010",
                "–––, 1999, <em>John Rawls: Collected\nPapers</em>, Samuel Freeman (ed.), Cambridge, MA: Harvard University\nPress.",
                "Rid, Annette, 2016, “Sufficiency, Health, and Health Care\nJustice: The State of the Debate”, in Fourie and Rid 2016:\n30–48. doi:10.1093/acprof:oso/9780199385263.003.0003",
                "Ridley, Matthew, Gautam Rao, Frank Schilbach, and Vikram Patel,\n2020, “Poverty, Depression, and Anxiety: Causal Evidence and\nMechanisms”, <em>Science</em>, 370(6522): eaay0214.\ndoi:10.1126/science.aay0214",
                "Sangiovanni, Andrea, 2007, “Global Justice, Reciprocity, and\nthe State”, <em>Philosophy &amp; Public Affairs</em>, 35(1):\n3–39. doi:10.1111/j.1088-4963.2007.00097.x",
                "Sapolsky, Robert M. and Glen E. Mott, 1987, “Social\nSubordinance in Wild Baboons Is Associated with Suppressed High\nDensity Lipoprotein-Cholesterol Concentrations: The Possible Role of\nChronic Social Stress*”, <em>Endocrinology</em>, 121(5):\n1605–1610. doi:10.1210/endo-121-5-1605",
                "Schwan, Ben, 2021, “Responsibility amid the Social\nDeterminants of Health”, <em>Bioethics</em>, 35(1): 6–14.\ndoi:10.1111/bioe.12782",
                "Segall, Shlomi, 2010, <em>Health, Luck, and Justice</em>,\nPrinceton, NJ: Princeton University Press.",
                "Shields, Liam, 2016, “Some Questions (and Answers) for\nSufficientarians”, in Fourie and Rid 2016: 85–100.\ndoi:10.1093/acprof:oso/9780199385263.003.0006",
                "Shively, C. A. and T. B. Clarkson, 1994, “Social Status and\nCoronary Artery Atherosclerosis in Female Monkeys”,\n<em>Arteriosclerosis and Thrombosis: A Journal of Vascular\nBiology</em>, 14(5): 721–726. doi:10.1161/01.ATV.14.5.721",
                "Smith, James P., 2009, “The Impact of Childhood Health on\nAdult Labor Market Outcomes”, <em>Review of Economics and\nStatistics</em>, 91(3): 478–489. doi:10.1162/rest.91.3.478",
                "Smith, Maxwell J., 2015, “Health Equity in Public Health:\nClarifying Our Commitment”, <em>Public Health Ethics</em>, 8(2):\n173–184. doi:10.1093/phe/phu042",
                "Sreenivasan, Gopal, 2001, “Opportunity Is Not the\nKey”, <em>American Journal of Bioethics</em>, 1(2): 1b–2b.\ndoi:10.1162/152651601300168997",
                "–––, 2007a, “Health Care and Equality of\nOpportunity”, <em>The Hastings Center Report</em>, 37(2):\n21–31.",
                "–––, 2007b, “Health and Justice in Our\nNon-Ideal World”, <em>Politics, Philosophy &amp; Economics</em>,\n6(2): 218–236. doi:10.1177/1470594X07077273",
                "–––, 2009a, “Ethics and Epidemiology: The\nIncome Debate”, <em>Public Health Ethics</em>, 2(1):\n45–52. doi:10.1093/phe/php004",
                "–––, 2009b, “Ethics and Epidemiology:\nResidual Health Inequalities”, <em>Public Health Ethics</em>,\n2(3): 244–249. doi:10.1093/phe/php030",
                "–––, 2015, “HESC and Equitable\nResidues”, <em>The American Journal of Bioethics</em>, 15(3):\n54–55. doi:10.1080/15265161.2014.998388",
                "Stringhini, Silvia, Aline Dugravot, Martin Shipley, Marcel\nGoldberg, Marie Zins, Mika Kivimäki, Michael Marmot,\nSéverine Sabia, and Archana Singh-Manoux, 2011, “Health\nBehaviours, Socioeconomic Status, and Mortality: Further Analyses of\nthe British Whitehall II and the French GAZEL Prospective\nCohorts”, <em>PLoS Medicine</em>, 8(2): e1000419.\ndoi:10.1371/journal.pmed.1000419",
                "Stringhini, Silvia, Séverine Sabia, Martin Shipley, Eric\nBrunner, Hermann Nabi, Mika Kivimäki, and Archana Singh-Manoux,\n2010, “Association of Socioeconomic Position With Health\nBehaviors and Mortality”, <em>JAMA</em>, 303(12):\n1159–1166. doi:10.1001/jama.2010.297",
                "Temkin, Larry S., 2013, “Inequality and Health”, in\nEyal et al. 2013: 13–26.\ndoi:10.1093/acprof:oso/9780199931392.003.0002",
                "van Rossum, Caroline T. M., Martin J. Shipley, Hendrike van de\nMheen, Diederick E. Grobbee, and Michael G. Marmot, 2000,\n“Employment Grade Differences in Cause Specific Mortality. A 25\nYear Follow up of Civil Servants from the First Whitehall\nStudy”, <em>Journal of Epidemiology &amp; Community Health</em>,\n54(3): 178–184. doi:10.1136/jech.54.3.178",
                "Venkatapuram, Sridhar, 2011, <em>Health Justice: An Argument from\nthe Capabilities Approach</em>, Cambridge: Polity Press.",
                "Voigt, Kristin, 2013, “Appeals to Individual Responsibility\nfor Health: Reconsidering the Luck Egalitarian Perspective”,\n<em>Cambridge Quarterly of Healthcare Ethics</em>, 22(2):\n146–158. doi:10.1017/S0963180112000527",
                "Voigt, Kristin and Gry Wester, 2015, “Relational Equality\nand Health”, <em>Social Philosophy and Policy</em>, 31(2):\n204–229. doi:10.1017/S0265052514000326",
                "Voorhoeve, Alex, 2020, “Why Health-Related Inequalities\nMatter and Which Ones Do”, in Norheim et al. 2019:\n145–162. doi:10.1093/oso/9780190912765.003.0009",
                "Weinstock, Daniel M., 2015, “Health Justice after the Social\nDeterminants of Health Revolution”, <em>Social Theory &amp;\nHealth</em>, 13(3–4): 437–453.\ndoi:10.1057/sth.2015.11",
                "Wester, Gry, 2018, “When Are Health Inequalities\nUnfair?”, <em>Public Health Ethics</em>, 11(3): 346–355.\ndoi:10.1093/phe/phy004",
                "Whitehead, Margaret, 1992, “The Concepts and Principles of\nEquity and Health”, <em>International Journal of Health\nServices</em>, 22(3): 429–445.\ndoi:10.2190/986L-LHQ6-2VTE-YRRN",
                "Wikler, Daniel, 2004, “Personal and Social Responsibility\nfor Health”, in Anand, Peter, and Sen 2004: 109–134.",
                "Wilkinson, Richard G., 1996, <em>Unhealthy Societies: The\nAfflictions of Inequality</em>, London: Routledge.\ndoi:10.4324/9780203421680",
                "Wilkinson, Richard G. and Michael Marmot (eds.), 2003, <em>Social\nDeterminants of Health: The Solid Facts</em>, second edition,\nCopenhagen: World Health Organization.\n [<a href=\"https://apps.who.int/iris/handle/10665/326568\" target=\"other\">Wilkinson and Marmot 2003 available online</a>]",
                "Williams, David R., Jourdyn A. Lawrence, and Brigette A. Davis,\n2019, “Racism and Health: Evidence and Needed Research”,\n<em>Annual Review of Public Health</em>, 40: 105–125.\ndoi:10.1146/annurev-publhealth-040218-043750",
                "Wilson, James, 2011, “Health Inequities”, in Dawson\n2011: 211–230. doi:10.1017/CBO9780511862670.013",
                "WHO (World Health Organization), 2020, <em>World Health Statistics\n2020: Monitoring Health for the SDGs, Sustainable Development\nGoals</em>, Geneva: World Health Organization.\n [<a href=\"https://apps.who.int/iris/handle/10665/332070\" target=\"other\">WHO 2020 available online</a>]",
                "Wolff, Jonathan, 2012, <em>The Human Right to Health</em>, New\nYork: W.W. Norton &amp; Company.",
                "Woolf, Steven H., Ryan K. Masters, and Laudan Y. Aron, 2021,\n“Effect of the Covid-19 Pandemic in 2020 on Life Expectancy\nAcross Populations in the USA and Other High Income Countries:\nSimulations of Provisional Mortality Data”, <em>BMJ,</em> 373:\nn1343. doi:10.1136/bmj.n1343",
                "Xu, Jiaquan, Sherry L. Murphy, Kenneth D. Kochanek, and Elizabeth\nArias, 2020, “Mortality in the United States, 2018”,\n<em>NCHS Data Brief</em> 355, Hyattsville, MD: National Center for\nHealth Statistics.\n [<a href=\"https://www.cdc.gov/nchs/products/databriefs/db355.htm\" target=\"other\">Xu et al. 2020 available online</a>]",
                "Young, Iris Marion, 2001, “Equality of Whom? Social Groups\nand Judgments of Injustice”, <em>Journal of Political\nPhilosophy</em>, 9(1): 1–18. doi:10.1111/1467-9760.00115"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Adler, Nancy E. and Katherine Newman, 2002, “Socioeconomic\nDisparities In Health: Pathways And Policies”, <em>Health\nAffairs</em>, 21(2): 60–76. doi:10.1377/hlthaff.21.2.60</li>\n<li>Adler, Nancy E. and Joan M. Ostrove, 1999, “Socioeconomic\nStatus and Health: What We Know and What We Don’t”,\n<em>Socioeconomic Status and Health in Industrial Nations: Social,\nPsychological, and Biological Pathways</em>, volume title of\n<em>Annals of the New York Academy of Sciences</em>, 896: 3–15.\ndoi:10.1111/j.1749-6632.1999.tb08101.x</li>\n<li>Albertsen, Andreas and Carl Knight, 2015, “A Framework for\nLuck Egalitarianism in Health and Healthcare”, <em>Journal of\nMedical Ethics</em>, 41(2): 165–169.\ndoi:10.1136/medethics-2013-101666</li>\n<li>Aldabe, B., R. Anderson, M. Lyly-Yrjanainen, A. Parent-Thirion, G.\nVermeylen, C. C. Kelleher, and I. Niedhammer, 2011,\n“Contribution of Material, Occupational, and Psychosocial\nFactors in the Explanation of Social Inequalities in Health in 28\nCountries in Europe”, <em>Journal of Epidemiology &amp;\nCommunity Health</em>, 65(12): 1123–1131.\ndoi:10.1136/jech.2009.102517</li>\n<li>Anand, Sudhir, 2004, “The Concern for Equity in\nHealth”, in Anand, Peter, and Sen 2004: 15–20.</li>\n<li>Anand, Sudhir and Fabienne Peter, 2000, “Equal\nOpportunity”, in J. Cohen and Rogers 2000: 48–52.</li>\n<li>Anand, Sudhir, Fabienne Peter, and Amartya Sen (eds.), 2004,\n<em>Public Health, Ethics, and Equity</em>, New York: Oxford\nUniversity Press.</li>\n<li>Anand, Sudhir, Finn Diderichsen, Timothy Evans, Vladimir M.\nShkolnikov, and Meg Wirth, 2001, “Measuring Disparities in\nHealth: Methods and Indicators”, in T. Evans et al. 2001:\n49–67.</li>\n<li>Anderson, Elizabeth S., 1999, “What Is the Point of\nEquality?”, <em>Ethics</em>, 109(2): 287–337.\ndoi:10.1086/233897</li>\n<li>Arias, Elizabeth, 2016, “Changes in Life Expectancy by Race\nand Hispanic Origin in the United States, 2013–2014”, NCHS\nData Brief 244, Hyattsville, MD: National Center for Health\nStatistics.\n [<a href=\"https://www.cdc.gov/nchs/products/databriefs/db244.htm\" target=\"other\">Arias 2016 available online</a>]</li>\n<li>Arias, Elizabeth, Betzaida Tejada-Vera, and Farida Ahmad, 2021,\n“Provisional Life Expectancy Estimates for January through June,\n2020”, <em>Vital Statistics Rapid Release</em> 10, Hyattsville,\nMD: National Center for Health Statistics.\n [<a href=\"https://depts.washington.edu/pandemicalliance/2021/02/19/provisional-life-expectancy-estimates-for-january-through-june-2020/\" target=\"other\">Arias et al. 2021 available online</a>]</li>\n<li>Arneson, Richard J., 2002, “Why Justice Requires Transfers\nto Offset Income and Wealth Inequalities”, <em>Social Philosophy\nand Policy</em>, 19(1): 172–200.\ndoi:10.1017/S0265052502191084</li>\n<li>Asada, Yukiko, 2013, “A Summary Measure of Health\nInequalities”, in Eyal et al. 2013: 37–51.\ndoi:10.1093/acprof:oso/9780199931392.003.0004</li>\n<li>–––, 2019, “Measuring Health Inequity: A\nPublic Health Ethics Inquiry”, in Mastroianni et al. 2019:\n301–311. doi:10.1093/oxfordhb/9780190245191.013.23</li>\n<li>Backlund, Eric, Paul D. Sorlie, and Norman J. Johnson, 1999,\n“A Comparison of the Relationships of Education and Income with\nMortality: The National Longitudinal Mortality Study”,\n<em>Social Science &amp; Medicine</em>, 49(10): 1373–1384.\ndoi:10.1016/S0277-9536(99)00209-9</li>\n<li>Blacksher, Erika, 2018, “Shrinking Poor White Life Spans:\nClass, Race, and Health Justice”, <em>The American Journal of\nBioethics</em>, 18(10): 3–14.\ndoi:10.1080/15265161.2018.1513585</li>\n<li>Blake, Michael, 2001, “Distributive Justice, State Coercion,\nand Autonomy”, <em>Philosophy &amp; Public Affairs</em>, 30(3):\n257–296. doi:10.1111/j.1088-4963.2001.00257.x</li>\n<li>Bleakley, Hoyt, 2010, “Malaria Eradication in the Americas:\nA Retrospective Analysis of Childhood Exposure”, <em>American\nEconomic Journal: Applied Economics</em>, 2(2): 1–45.\ndoi:10.1257/app.2.2.1</li>\n<li>Boyce, W. Thomas, Marla B. Sokolowski, and Gene E. Robinson, 2012,\n“Toward a New Biology of Social Adversity”,\n<em>Proceedings of the National Academy of Sciences</em>,\n109(Supplement 2): 17143–17148. doi:10.1073/pnas.1121264109</li>\n<li>Braveman, Paula A., Catherine Cubbin, Susan Egerter, David R.\nWilliams, and Elsie Pamuk, 2010, “Socioeconomic Disparities in\nHealth in the United States: What the Patterns Tell Us”,\n<em>American Journal of Public Health</em>, 100(S1): S186–S196.\ndoi:10.2105/AJPH.2009.166082</li>\n<li>Braveman, Paula A., Shiriki Kumanyika, Jonathan Fielding, Thomas\nLaVeist, Luisa N. Borrell, Ron Manderscheid, and Adewale Troutman,\n2011, “Health Disparities and Health Equity: The Issue Is\nJustice”, <em>American Journal of Public Health</em>, 101(S1):\nS149–S155. doi:10.2105/AJPH.2010.300062</li>\n<li>Brock, Gillian, 2009, <em>Global Justice: A Cosmopolitan\nAccount</em>, New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199230938.001.0001</li>\n<li>Brulle, Robert J. and David N. Pellow, 2006, “Environmental\nJustice: Human Health and Environmental Inequalities”,\n<em>Annual Review of Public Health</em>, 27: 103–124.\ndoi:10.1146/annurev.publhealth.27.021405.102124</li>\n<li>Brunner, Eric and Marmot, Michael, 2005, “Social\nOrganization, Stress, and Health”, in Marmot and Wilkinson 2005:\n6–28. doi:10.1093/acprof:oso/9780198565895.001.0001 </li>\n<li>Buchbinder, Mara, Michele R. Rivkin-Fish, and Rebecca L. Walker\n(eds.), 2016, <em>Understanding Health Inequalities and Justice: New\nConversations across the Disciplines</em>, (Studies in Social\nMedicine), Chapel Hill, NC: The University of North Carolina\nPress.</li>\n<li>Caney, Simon, 2005, <em>Justice Beyond Borders: A Global Political\nTheory</em>, Oxford: Oxford University Press.\ndoi:10.1093/019829350X.001.0001</li>\n<li>Cappelen, A. W. and O. F. Norheim, 2005, “Responsibility in\nHealth Care: A Liberal Egalitarian Approach”, <em>Journal of\nMedical Ethics</em>, 31(8): 476–480.\ndoi:10.1136/jme.2004.010421</li>\n<li>Case, Anne and Angus Deaton, 2015, “Rising Morbidity and\nMortality in Midlife among White Non-Hispanic Americans in the 21st\nCentury”, <em>Proceedings of the National Academy of\nSciences</em>, 112(49): 15078–15083.\ndoi:10.1073/pnas.1518393112</li>\n<li>–––, 2020, <em>Deaths of Despair and the Future\nof Capitalism</em>, Princeton, NJ: Princeton University Press.</li>\n<li>Case, Anne, Angela Fertig, and Christina Paxson, 2005, “The\nLasting Impact of Childhood Health and Circumstance”,\n<em>Journal of Health Economics</em>, 24(2): 365–389.\ndoi:10.1016/j.jhealeco.2004.09.008</li>\n<li>Case, Anne, Darren Lubotsky, and Christina Paxson, 2002,\n“Economic Status and Health in Childhood: The Origins of the\nGradient”, <em>American Economic Review</em>, 92(5):\n1308–1334. doi:10.1257/000282802762024520</li>\n<li>Case, Anne and Christina Paxson, 2011, “The Long Reach of\nChildhood Health and Circumstance: Evidence from the Whitehall II\nStudy”, <em>The Economic Journal</em>, 121(554):\nF183–F204. doi:10.1111/j.1468-0297.2011.02447.x</li>\n<li>Cavallero, Eric, 2011, “Health, Luck and Moral Fallacies of\nthe Second Best”, <em>The Journal of Ethics</em>, 15(4):\n387–403. doi:10.1007/s10892-011-9109-z</li>\n<li>–––, 2019, “Opportunity and Responsibility\nfor Health”, <em>The Journal of Ethics</em>, 23(4):\n369–386. doi:10.1007/s10892-019-09300-7</li>\n<li>Chang, W, 2002, “The Meaning and Goals of Equity in\nHealth”, <em>Journal of Epidemiology &amp; Community\nHealth</em>, 56(7): 488–491. doi:10.1136/jech.56.7.488</li>\n<li>Chetty, Raj, Michael Stepner, Sarah Abraham, Shelby Lin, Benjamin\nScuderi, Nicholas Turner, Augustin Bergeron, and David Cutler, 2016,\n“The Association Between Income and Life Expectancy in the\nUnited States, 2001-2014”, <em>Journal of the American Medical\nAssociation</em>, 315(16):\n1750–1766. doi:10.1001/jama.2016.4226</li>\n<li>Clark, Uraina S., Evan R. Miller, and Rachal R. Hegde, 2018,\n“Experiences of Discrimination Are Associated With Greater\nResting Amygdala Activity and Functional Connectivity”,\n<em>Biological Psychiatry: Cognitive Neuroscience and\nNeuroimaging</em>, 3(4): 367–378.\ndoi:10.1016/j.bpsc.2017.11.011</li>\n<li>Clougherty, Jane E., Kerry Souza, and Mark R. Cullen, 2010,\n“Work and Its Role in Shaping the Social Gradient in\nHealth”, <em>The Biology of Disadvantage: Socioeconomic Status\nand Health</em>, volume title of <em>Annals of the New York Academy of\nSciences</em>, 1186: 102–124.\ndoi:10.1111/j.1749-6632.2009.05338.x</li>\n<li>Cohen, Joshua and Joel Rogers (eds.), 2000, <em>Is Inequality Bad\nfor Our Health?</em>, (New Democratic Forum Series), Boston, MA:\nBeacon Press.</li>\n<li>Cohen, Joshua and Charles Sabel, 2006, “Extra Rempublicam\nNulla Justitia?”, <em>Philosophy &amp; Public Affairs</em>,\n34(2): 147–175. doi:10.1111/j.1088-4963.2006.00060.x</li>\n<li>Cohen, Sheldon, Scott Line, Stephen B. Manuck, Bruce S. Rabin,\nEugene R. Heise, and Jay R. Kaplan, 1997, “Chronic Social\nStress, Social Status, and Susceptibility to Upper Respiratory\nInfections in Nonhuman Primates”, <em>Psychosomatic\nMedicine</em>, 59(3): 213–221.\ndoi:10.1097/00006842-199705000-00001</li>\n<li>Colen, Cynthia G., David M. Ramey, Elizabeth C. Cooksey, and David\nR. Williams, 2018, “Racial Disparities in Health among Nonpoor\nAfrican Americans and Hispanics: The Role of Acute and Chronic\nDiscrimination”, <em>Social Science &amp; Medicine</em>, 199:\n167–180. doi:10.1016/j.socscimed.2017.04.051</li>\n<li>Crimmins, Eileen M. and Yasuhiko Saito, 2001, “Trends in\nHealthy Life Expectancy in the United States, 1970–1990: Gender,\nRacial, and Educational Differences”, <em>Social Science &amp;\nMedicine</em>, 52(11): 1629–1641.\ndoi:10.1016/S0277-9536(00)00273-2</li>\n<li>Culyer, A. J. and Adam Wagstaff, 1993, “Equity and Equality\nin Health and Health Care”, <em>Journal of Health\nEconomics</em>, 12(4): 431–457.\ndoi:10.1016/0167-6296(93)90004-X</li>\n<li>Currie, Janet, 2009, “Healthy, Wealthy, and Wise:\nSocioeconomic Status, Poor Health in Childhood, and Human Capital\nDevelopment”, <em>Journal of Economic Literature</em>, 47(1):\n87–122. doi:10.1257/jel.47.1.87</li>\n<li>Cutler, David M., Adriana Lleras-Muney, and Tom Vogl, 2011,\n“Socioeconomic Status and Health: Dimensions and\nMechanisms”, in <em>The Oxford Handbook of Health\nEconomics</em>, Sherry Glied and Peter C. Smith (eds.), Oxford: Oxford\nUniversity Press, 123–163.\ndoi:10.1093/oxfordhb/9780199238828.013.0007</li>\n<li>Daniels, Norman, 1985, <em>Just Health Care</em>, New York:\nCambridge University Press. doi:10.1017/CBO9780511624971</li>\n<li>–––, 2008, <em>Just Health: Meeting Health Needs\nFairly</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511809514</li>\n<li>–––, 2011, “Individual and Social\nResponsibility for Health”, in Knight and Stemplowska 2011:\n266–286. doi:10.1093/acprof:oso/9780199565801.003.0014</li>\n<li>Daniels, Norman, Bruce Kennedy, and Ichiro Kawachi, 2000,\n“Why Justice is Good for our Health”, in J. Cohen and\nRogers 2000: 3–33.</li>\n<li>Davies, Ben and Julian Savulescu, 2019, “Solidarity and\nResponsibility in Health Care”, <em>Public Health Ethics</em>,\n12(2): 133–144. doi:10.1093/phe/phz008</li>\n<li>Dawson, Angus (ed.), 2011, <em>Public Health Ethics: Key Concepts\nand Issues in Policy and Practice</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9780511862670</li>\n<li>Deaton, Angus, 2002, “Policy Implications Of The Gradient Of\nHealth And Wealth”, <em>Health Affairs</em>, 21(2): 13–30.\ndoi:10.1377/hlthaff.21.2.13</li>\n<li>–––, 2003, “Health, Inequality, and\nEconomic Development”, <em>Journal of Economic Literature</em>,\n41(1): 113–158. doi:10.1257/jel.41.1.113</li>\n<li>–––, 2013, “What Does the Empirical\nEvidence Tell Us About the Injustice of Health Inequalities?”,\nin Eyal et al. 2013: 263–281.\ndoi:10.1093/acprof:oso/9780199931392.003.0018</li>\n<li>Elo, Irma T. and Samuel H. Preston, 1996, “Educational\nDifferentials in Mortality: United States, 1979–1985”,\n<em>Social Science &amp; Medicine</em>, 42(1): 47–57.\ndoi:10.1016/0277-9536(95)00062-3</li>\n<li>Evans, Robert G., M. Hodge, and I. B. Pless, 1994, “If Not\nGenetics, Then What? Biological Pathways and Population Health”,\nin <em>Why Are Some People Healthy and Others Not? The Determinants of\nHealth Populations</em>, Robert G. Evans, Morris L. Barer, and\nTheodore R. Marmor (eds.), New York: De Gruyter, 161–188.\ndoi:10.1515/9783112421628-008</li>\n<li>Evans, Timothy, Margaret Whitehead, Finn Diderichsen, Abbas\nBhuiya, and Meg Wirth, 2001, <em>Challenging Inequities in Health:\nFrom Ethics to Action</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195137408.001.0001</li>\n<li>Eyal, Nir, 2013, “Leveling Down Health”, in Eyal et\nal. 2013: 197–213.\ndoi:10.1093/acprof:oso/9780199931392.003.0014</li>\n<li>–––, 2018, “Inequality in Political\nPhilosophy and in Epidemiology: A Remarriage: Inequality in Political\nPhilosophy and in Epidemiology”, <em>Journal of Applied\nPhilosophy</em>, 35(1): 149–167. doi:10.1111/japp.12150</li>\n<li>Eyal, Nir, Samia A. Hurst, Ole F. Norheim, and Dan Wikler (eds.),\n2013, <em>Inequalities in Health: Concepts, Measures, and Ethics</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199931392.001.0001</li>\n<li>Fishman, Jayna and Douglas MacKay, 2019, “Rawlsian Justice\nand the Social Determinants of Health”, <em>Journal of Applied\nPhilosophy</em>, 36(4): 608–625. doi:10.1111/japp.12339</li>\n<li>Fleck, Leonard M., 2012, “Whoopie Pies, Supersized Fries:\n‘Just’ Snacking? ‘Just’ Des(s)Erts?”,\n<em>Cambridge Quarterly of Healthcare Ethics</em>, 21(1): 5–19.\ndoi:10.1017/S0963180111000454</li>\n<li>Fourie, Carina, 2016, “The Sufficiency View: A\nPrimer”, in Fourie and Rid 2016: 11–29.\ndoi:10.1093/acprof:oso/9780199385263.003.0002</li>\n<li>Fourie, Carina and Annette Rid (eds.), 2016, <em>What Is Enough?\nSufficiency, Justice, and Health</em>, New York: Oxford University\nPress. doi:10.1093/acprof:oso/9780199385263.001.0001</li>\n<li>Friesen, Phoebe, 2018, “Personal Responsibility within\nHealth Policy: Unethical and Ineffective”, <em>Journal of\nMedical Ethics</em>, 44(1): 53–58.\ndoi:10.1136/medethics-2016-103478</li>\n<li>Goldberg, D. S., 2012, “Social Justice, Health Inequalities\nand Methodological Individualism in US Health Promotion”,\n<em>Public Health Ethics</em>, 5(2): 104–115.\ndoi:10.1093/phe/phs013</li>\n<li>Hassoun, Nicole, 2020, <em>Global Health Impact: Extending Access\nto Essential Medicines</em>, New York: Oxford University Press.\ndoi:10.1093/oso/9780197514993.001.0001</li>\n<li>Hausman, Daniel M., 2007, “What’s Wrong with Health\nInequalities?”, <em>Journal of Political Philosophy</em>, 15(1):\n46–66. doi:10.1111/j.1467-9760.2007.00270.x</li>\n<li>–––, 2012, “What’s Wrong with Global\nHealth Inequalities?” in Lenard and Straehle 2012:\n34–51.</li>\n<li>–––, 2013, “Egalitarian Critiques of\nHealth Inequalities”, in Eyal et al. 2013: 95–112.\ndoi:10.1093/acprof:oso/9780199931392.003.0008</li>\n<li>–––, 2019, “Some Remarks on Equality in\nHealth and Health Care”, <em>Social Justice Research</em>,\n32(2): 137–154. doi:10.1007/s11211-018-0320-y</li>\n<li>Hero, Joachim O., Alan M. Zaslavsky, and Robert J. Blendon, 2017,\n“The United States Leads Other Nations In Differences By Income\nIn Perceptions Of Health And Health Care”, <em>Health\nAffairs</em>, 36(6): 1032–1040.\ndoi:10.1377/hlthaff.2017.0006</li>\n<li>Huisman, Martijn, Anton E. Kunst, Matthias Bopp, Jens-Kristian\nBorgan, Carme Borrell, Giuseppe Costa, Patrick Deboosere, Sylvie\nGadeyne, Myer Glickman, Chiara Marinacci, Christoph Minder, Enrique\nRegidor, Tapani Valkonen, and Johan P. Mackenbach, 2005,\n“Educational Inequalities in Cause-Specific Mortality in\nMiddle-Aged and Older Men and Women in Eight Western European\nPopulations”, <em>The Lancet</em>, 365(9458): 493–500.\ndoi:10.1016/S0140-6736(05)17867-2</li>\n<li>Kawachi, Ichiro, Bruce P. Kennedy, and Richard G. Wilkinson\n(eds.), 1999, <em>Income Inequality and Health: A Reader</em>, New\nYork: New Press.</li>\n<li>Kelleher, J. Paul, 2016, “Health Inequalities and Relational\nEgalitarianism”, in Buchbinder et al. 2016: 88–111.</li>\n<li>King, Nicholas B., 2016, “Justice, Evidence, and\nInterdisciplinary Health Inequalities Research”, in Buchbinder\net al. 2016: 213–234.</li>\n<li>Kniess, Johannes, 2018, “A Social Division of Responsibility\nfor Health”, <em>Les ateliers de l’éthique</em>\n(<em>The Ethics Forum</em>), 13(3): 105–122.\ndoi:10.7202/1061221ar</li>\n<li>–––, 2019, “Justice in the Social\nDistribution of Health”, <em>Social Theory and Practice</em>,\n45(3): 397–425. doi:10.5840/soctheorpract201992665</li>\n<li>Knight, Carl and Zofia Stemplowska (eds.), 2011,\n<em>Responsibility and Distributive Justice</em>, New York: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199565801.001.0001</li>\n<li>Kunst, A. E. and J. P. Mackenbach, 1994, “The Size of\nMortality Differences Associated with Educational Level in Nine\nIndustrialized Countries”, <em>American Journal of Public\nHealth</em>, 84(6): 932–937. doi:10.2105/AJPH.84.6.932</li>\n<li>Le Grand, Julian, 1987, “Equity, Health, and Health\nCare”, <em>Social Justice Research</em>, 1(3): 257–274.\ndoi:10.1007/BF01047663</li>\n<li>–––, 2013, “Individual Responsibility,\nHealth, and Health Care”, in Eyal et al. 2013: 299–306.\ndoi:10.1093/acprof:oso/9780199931392.003.0020</li>\n<li>Lenard, Patti Tamara and Christine Straehle (eds.), 2012,\n<em>Health Inequalities and Global Justice</em>, Edinburgh: Edinburgh\nUniversity Press.</li>\n<li>Leon, David and Gill Walt, 2001, <em>Poverty, Inequality, and\nHealth: An International Perspective</em>, Oxford: Oxford University\nPress. doi:10.1093/acprof:oso/9780192631961.001.0001</li>\n<li>Levy, Neil, 2019, “Taking Responsibility for\nResponsibility”, <em>Public Health Ethics</em>, 12(2):\n103–113. doi:10.1093/phe/phz001</li>\n<li>Lippert-Rasmussen, Kasper, 2013, “When Group Measures of\nHealth Should Matter”, in Eyal et al. 2013: 52–65.\ndoi:10.1093/acprof:oso/9780199931392.003.0005</li>\n<li>Mackenbach, Johan P., 2019, <em>Health Inequalities: Persistence\nand Change in Modern Welfare States</em>, New York: Oxford University\nPress. doi:10.1093/oso/9780198831419.001.0001</li>\n<li>Mackenbach, Johan P., Irina Stirbu, Albert-Jan R. Roskam, Maartje\nM. Schaap, Gwenn Menvielle, Mall Leinsalu, and Anton E. Kunst, 2008,\n“Socioeconomic Inequalities in Health in 22 European\nCountries”, <em>New England Journal of Medicine</em>, 358(23):\n2468–2481. doi:10.1056/NEJMsa0707519</li>\n<li>Marmot, Michael, 2000, “Multilevel Approaches to\nUnderstanding Social Determinants”, in <em>Social\nEpidemiology</em>, Lisa F. Berkman and Ichiro Kawachi (eds.), Oxford:\nOxford University Press, 349–367.</li>\n<li>–––, 2001, “Inequalities in Health”,\n<em>New England Journal of Medicine</em>, 345(2): 134–136.\ndoi:10.1056/NEJM200107123450210</li>\n<li>–––, 2004, <em>The Status Syndrome: How Social\nStanding Affects Our Health and Longevity</em>, New York: Times\nBooks/Henry Holt.</li>\n<li>–––, 2005, “Introduction”, in Marmot\nand Wilkinson (eds) 2005: 1–5. </li>\n<li>Marmot, M. G., H. Bosma, H. Hemingway, E. Brunner, and S.\nStansfeld, 1997, “Contribution of Job Control and Other Risk\nFactors to Social Variations in Coronary Heart Disease\nIncidence”, <em>The Lancet</em>, 350(9073): 235–239.\ndoi:10.1016/S0140-6736(97)04244-X</li>\n<li>Marmot, M. G., G. Rose, M. Shipley, and P. J. Hamilton, 1978,\n“Employment Grade and Coronary Heart Disease in British Civil\nServants”, <em>Journal of Epidemiology &amp; Community\nHealth</em>, 32(4): 244–249. doi:10.1136/jech.32.4.244</li>\n<li>Marmot, M. G., M. J. Shipley, and Geoffrey Rose, 1984,\n“Inequalities in Death—Specific Explanations of a General\nPattern?”, <em>The Lancet</em>, 323(8384): 1003–1006.\ndoi:10.1016/S0140-6736(84)92337-7</li>\n<li>Marmot, Michael and Richard G. Wilkinson (eds.), 2005, <em>Social\nDeterminants of Health</em>, second edition, Oxford: Oxford University\nPress. doi:10.1093/acprof:oso/9780198565895.001.0001</li>\n<li>Mastroianni, Anna C., Jeffrey P. Kahn, and Nancy E. Kass (eds.),\n2019, <em>The Oxford Handbook of Public Health Ethics</em>, Oxford:\nOxford University Press.\ndoi:10.1093/oxfordhb/9780190245191.001.0001</li>\n<li>McDonough, P., G. J. Duncan, D. Williams, and J. House, 1997,\n“Income Dynamics and Adult Mortality in the United States, 1972\nthrough 1989”, <em>American Journal of Public Health</em>,\n87(9): 1476–1483. doi:10.2105/AJPH.87.9.1476</li>\n<li>McEwen, Bruce S., 1998, “Protective and Damaging Effects of\nStress Mediators”, <em>New England Journal of Medicine</em>,\n338(3): 171–179. doi:10.1056/NEJM199801153380307</li>\n<li>McEwen, Craig A. and Bruce S. McEwen, 2017, “Social\nStructure, Adversity, Toxic Stress, and Intergenerational Poverty: An\nEarly Childhood Model”, <em>Annual Review of Sociology</em>, 43:\n445–472. doi:10.1146/annurev-soc-060116-053252</li>\n<li>Murray, C. J., E. E. Gakidou, and J. Frenk, 1999, “Health\nInequalities and Social Group Differences: What Should We\nMeasure?”, <em>Bulletin of the World Health Organization</em>,\n77(7): 537–543.</li>\n<li>Nagel, Thomas, 2005, “The Problem of Global Justice”,\n<em>Philosophy &amp; Public Affairs</em>, 33(2): 113–147.\ndoi:10.1111/j.1088-4963.2005.00027.x</li>\n<li>Norheim, Ole F., Ezekiel J. Emanuel, and Joseph Millum (eds.),\n2019, <em>Global Health Priority-Setting: Beyond\nCost-Effectiveness</em>, New York: Oxford University Press.\ndoi:10.1093/oso/9780190912765.001.0001</li>\n<li>Peter, Fabienne, 2004, “Health Equity and Social\nJustice”, in Anand, Peter, and Sen 2004: 93–105.</li>\n<li>Petrovic, Dusan, Carlos de Mestral, Murielle Bochud, Mel Bartley,\nMika Kivimäki, Paolo Vineis, Johan Mackenbach, and Silvia\nStringhini, 2018, “The Contribution of Health Behaviors to\nSocioeconomic Inequalities in Health: A Systematic Review”,\n<em>Preventive Medicine</em>, 113: 15–31.\ndoi:10.1016/j.ypmed.2018.05.003</li>\n<li>Pickett, Kate E. and M. Pearl, 2001, “Multilevel Analyses of\nNeighbourhood Socioeconomic Context and Health Outcomes: A Critical\nReview”, <em>Journal of Epidemiology &amp; Community\nHealth</em>, 55(2): 111–122. doi:10.1136/jech.55.2.111</li>\n<li>Pickett, Kate E. and Richard G. Wilkinson, 2015, “Income\nInequality and Health: A Causal Review”, <em>Social Science\n&amp; Medicine</em>, 128: 316–326.\ndoi:10.1016/j.socscimed.2014.12.031</li>\n<li>Pogge, Thomas W., 2004, “Relational Conceptions of Justice:\nResponsibilities for Health Outcomes”, in Anand, Peter, and Sen\n2004: 135–161.</li>\n<li>Powers, Madison and Ruth R. Faden, 2006, <em>Social Justice: The\nMoral Foundations of Public Health and Health Policy</em>, (Issues in\nBiomedical Ethics), New York: Oxford University Press.</li>\n<li>Prah Ruger, Jennifer, 2010, <em>Health and Social Justice</em>,\nNew York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199559978.001.0001</li>\n<li>–––, 2018, <em>Global Health Justice and\nGovernance</em>, New York: Oxford University Press.\ndoi:10.1093/oso/9780199694631.001.0001</li>\n<li>Preda, Adina and Kristin Voigt, 2015, “The Social\nDeterminants of Health: Why Should We Care?”, <em>The American\nJournal of Bioethics</em>, 15(3): 25–36.\ndoi:10.1080/15265161.2014.998374</li>\n<li>Rawls, John, 1971, <em>A Theory of Justice</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>–––, 1982 [1999], “Social Unity and\nPrimary Goods”, in <em>Utilitarianism and Beyond</em>, Amartya\nSen and Bernard Williams (eds.), Cambridge: Cambridge University\nPress, 159–186. Reprinted in Rawls 1999: 359–387.\ndoi:10.1017/CBO9780511611964.010</li>\n<li>–––, 1999, <em>John Rawls: Collected\nPapers</em>, Samuel Freeman (ed.), Cambridge, MA: Harvard University\nPress.</li>\n<li>Rid, Annette, 2016, “Sufficiency, Health, and Health Care\nJustice: The State of the Debate”, in Fourie and Rid 2016:\n30–48. doi:10.1093/acprof:oso/9780199385263.003.0003</li>\n<li>Ridley, Matthew, Gautam Rao, Frank Schilbach, and Vikram Patel,\n2020, “Poverty, Depression, and Anxiety: Causal Evidence and\nMechanisms”, <em>Science</em>, 370(6522): eaay0214.\ndoi:10.1126/science.aay0214</li>\n<li>Sangiovanni, Andrea, 2007, “Global Justice, Reciprocity, and\nthe State”, <em>Philosophy &amp; Public Affairs</em>, 35(1):\n3–39. doi:10.1111/j.1088-4963.2007.00097.x</li>\n<li>Sapolsky, Robert M. and Glen E. Mott, 1987, “Social\nSubordinance in Wild Baboons Is Associated with Suppressed High\nDensity Lipoprotein-Cholesterol Concentrations: The Possible Role of\nChronic Social Stress*”, <em>Endocrinology</em>, 121(5):\n1605–1610. doi:10.1210/endo-121-5-1605</li>\n<li>Schwan, Ben, 2021, “Responsibility amid the Social\nDeterminants of Health”, <em>Bioethics</em>, 35(1): 6–14.\ndoi:10.1111/bioe.12782</li>\n<li>Segall, Shlomi, 2010, <em>Health, Luck, and Justice</em>,\nPrinceton, NJ: Princeton University Press.</li>\n<li>Shields, Liam, 2016, “Some Questions (and Answers) for\nSufficientarians”, in Fourie and Rid 2016: 85–100.\ndoi:10.1093/acprof:oso/9780199385263.003.0006</li>\n<li>Shively, C. A. and T. B. Clarkson, 1994, “Social Status and\nCoronary Artery Atherosclerosis in Female Monkeys”,\n<em>Arteriosclerosis and Thrombosis: A Journal of Vascular\nBiology</em>, 14(5): 721–726. doi:10.1161/01.ATV.14.5.721</li>\n<li>Smith, James P., 2009, “The Impact of Childhood Health on\nAdult Labor Market Outcomes”, <em>Review of Economics and\nStatistics</em>, 91(3): 478–489. doi:10.1162/rest.91.3.478</li>\n<li>Smith, Maxwell J., 2015, “Health Equity in Public Health:\nClarifying Our Commitment”, <em>Public Health Ethics</em>, 8(2):\n173–184. doi:10.1093/phe/phu042</li>\n<li>Sreenivasan, Gopal, 2001, “Opportunity Is Not the\nKey”, <em>American Journal of Bioethics</em>, 1(2): 1b–2b.\ndoi:10.1162/152651601300168997</li>\n<li>–––, 2007a, “Health Care and Equality of\nOpportunity”, <em>The Hastings Center Report</em>, 37(2):\n21–31.</li>\n<li>–––, 2007b, “Health and Justice in Our\nNon-Ideal World”, <em>Politics, Philosophy &amp; Economics</em>,\n6(2): 218–236. doi:10.1177/1470594X07077273</li>\n<li>–––, 2009a, “Ethics and Epidemiology: The\nIncome Debate”, <em>Public Health Ethics</em>, 2(1):\n45–52. doi:10.1093/phe/php004</li>\n<li>–––, 2009b, “Ethics and Epidemiology:\nResidual Health Inequalities”, <em>Public Health Ethics</em>,\n2(3): 244–249. doi:10.1093/phe/php030</li>\n<li>–––, 2015, “HESC and Equitable\nResidues”, <em>The American Journal of Bioethics</em>, 15(3):\n54–55. doi:10.1080/15265161.2014.998388</li>\n<li>Stringhini, Silvia, Aline Dugravot, Martin Shipley, Marcel\nGoldberg, Marie Zins, Mika Kivimäki, Michael Marmot,\nSéverine Sabia, and Archana Singh-Manoux, 2011, “Health\nBehaviours, Socioeconomic Status, and Mortality: Further Analyses of\nthe British Whitehall II and the French GAZEL Prospective\nCohorts”, <em>PLoS Medicine</em>, 8(2): e1000419.\ndoi:10.1371/journal.pmed.1000419</li>\n<li>Stringhini, Silvia, Séverine Sabia, Martin Shipley, Eric\nBrunner, Hermann Nabi, Mika Kivimäki, and Archana Singh-Manoux,\n2010, “Association of Socioeconomic Position With Health\nBehaviors and Mortality”, <em>JAMA</em>, 303(12):\n1159–1166. doi:10.1001/jama.2010.297</li>\n<li>Temkin, Larry S., 2013, “Inequality and Health”, in\nEyal et al. 2013: 13–26.\ndoi:10.1093/acprof:oso/9780199931392.003.0002</li>\n<li>van Rossum, Caroline T. M., Martin J. Shipley, Hendrike van de\nMheen, Diederick E. Grobbee, and Michael G. Marmot, 2000,\n“Employment Grade Differences in Cause Specific Mortality. A 25\nYear Follow up of Civil Servants from the First Whitehall\nStudy”, <em>Journal of Epidemiology &amp; Community Health</em>,\n54(3): 178–184. doi:10.1136/jech.54.3.178</li>\n<li>Venkatapuram, Sridhar, 2011, <em>Health Justice: An Argument from\nthe Capabilities Approach</em>, Cambridge: Polity Press.</li>\n<li>Voigt, Kristin, 2013, “Appeals to Individual Responsibility\nfor Health: Reconsidering the Luck Egalitarian Perspective”,\n<em>Cambridge Quarterly of Healthcare Ethics</em>, 22(2):\n146–158. doi:10.1017/S0963180112000527</li>\n<li>Voigt, Kristin and Gry Wester, 2015, “Relational Equality\nand Health”, <em>Social Philosophy and Policy</em>, 31(2):\n204–229. doi:10.1017/S0265052514000326</li>\n<li>Voorhoeve, Alex, 2020, “Why Health-Related Inequalities\nMatter and Which Ones Do”, in Norheim et al. 2019:\n145–162. doi:10.1093/oso/9780190912765.003.0009</li>\n<li>Weinstock, Daniel M., 2015, “Health Justice after the Social\nDeterminants of Health Revolution”, <em>Social Theory &amp;\nHealth</em>, 13(3–4): 437–453.\ndoi:10.1057/sth.2015.11</li>\n<li>Wester, Gry, 2018, “When Are Health Inequalities\nUnfair?”, <em>Public Health Ethics</em>, 11(3): 346–355.\ndoi:10.1093/phe/phy004</li>\n<li>Whitehead, Margaret, 1992, “The Concepts and Principles of\nEquity and Health”, <em>International Journal of Health\nServices</em>, 22(3): 429–445.\ndoi:10.2190/986L-LHQ6-2VTE-YRRN</li>\n<li>Wikler, Daniel, 2004, “Personal and Social Responsibility\nfor Health”, in Anand, Peter, and Sen 2004: 109–134.</li>\n<li>Wilkinson, Richard G., 1996, <em>Unhealthy Societies: The\nAfflictions of Inequality</em>, London: Routledge.\ndoi:10.4324/9780203421680</li>\n<li>Wilkinson, Richard G. and Michael Marmot (eds.), 2003, <em>Social\nDeterminants of Health: The Solid Facts</em>, second edition,\nCopenhagen: World Health Organization.\n [<a href=\"https://apps.who.int/iris/handle/10665/326568\" target=\"other\">Wilkinson and Marmot 2003 available online</a>]</li>\n<li>Williams, David R., Jourdyn A. Lawrence, and Brigette A. Davis,\n2019, “Racism and Health: Evidence and Needed Research”,\n<em>Annual Review of Public Health</em>, 40: 105–125.\ndoi:10.1146/annurev-publhealth-040218-043750</li>\n<li>Wilson, James, 2011, “Health Inequities”, in Dawson\n2011: 211–230. doi:10.1017/CBO9780511862670.013</li>\n<li>WHO (World Health Organization), 2020, <em>World Health Statistics\n2020: Monitoring Health for the SDGs, Sustainable Development\nGoals</em>, Geneva: World Health Organization.\n [<a href=\"https://apps.who.int/iris/handle/10665/332070\" target=\"other\">WHO 2020 available online</a>]</li>\n<li>Wolff, Jonathan, 2012, <em>The Human Right to Health</em>, New\nYork: W.W. Norton &amp; Company.</li>\n<li>Woolf, Steven H., Ryan K. Masters, and Laudan Y. Aron, 2021,\n“Effect of the Covid-19 Pandemic in 2020 on Life Expectancy\nAcross Populations in the USA and Other High Income Countries:\nSimulations of Provisional Mortality Data”, <em>BMJ,</em> 373:\nn1343. doi:10.1136/bmj.n1343</li>\n<li>Xu, Jiaquan, Sherry L. Murphy, Kenneth D. Kochanek, and Elizabeth\nArias, 2020, “Mortality in the United States, 2018”,\n<em>NCHS Data Brief</em> 355, Hyattsville, MD: National Center for\nHealth Statistics.\n [<a href=\"https://www.cdc.gov/nchs/products/databriefs/db355.htm\" target=\"other\">Xu et al. 2020 available online</a>]</li>\n<li>Young, Iris Marion, 2001, “Equality of Whom? Social Groups\nand Judgments of Injustice”, <em>Journal of Political\nPhilosophy</em>, 9(1): 1–18. doi:10.1111/1467-9760.00115</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "beneficence, principle of",
            "civil rights",
            "economics [normative] and economic justice",
            "egalitarianism",
            "equality",
            "equality: of opportunity",
            "ethics, biomedical: justice and access to health care",
            "exploitation",
            "feminist philosophy",
            "feminist philosophy, interventions: bioethics",
            "health",
            "human genome project",
            "justice: as a virtue",
            "justice: distributive",
            "justice: intergenerational",
            "justice: international distributive",
            "luck: justice and bad luck",
            "race",
            "Rawls, John",
            "social minimum [basic income]"
        ],
        "entry_link": [
            {
                "../principle-beneficence/": "beneficence, principle of"
            },
            {
                "../civil-rights/": "civil rights"
            },
            {
                "../economic-justice/": "economics [normative] and economic justice"
            },
            {
                "../egalitarianism/": "egalitarianism"
            },
            {
                "../equality/": "equality"
            },
            {
                "../equal-opportunity/": "equality: of opportunity"
            },
            {
                "../justice-healthcareaccess/": "ethics, biomedical: justice and access to health care"
            },
            {
                "../exploitation/": "exploitation"
            },
            {
                "../feminist-philosophy/": "feminist philosophy"
            },
            {
                "../feminist-bioethics/": "feminist philosophy, interventions: bioethics"
            },
            {
                "../health-disease/": "health"
            },
            {
                "../human-genome/": "human genome project"
            },
            {
                "../justice-virtue/": "justice: as a virtue"
            },
            {
                "../justice-distributive/": "justice: distributive"
            },
            {
                "../justice-intergenerational/": "justice: intergenerational"
            },
            {
                "../international-justice/": "justice: international distributive"
            },
            {
                "../justice-bad-luck/": "luck: justice and bad luck"
            },
            {
                "../race/": "race"
            },
            {
                "../rawls/": "Rawls, John"
            },
            {
                "../social-minimum/": "social minimum [basic income]"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=justice-inequality-health\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/justice-inequality-health/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=justice-inequality-health&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/justice-inequality-health/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=justice-inequality-health": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/justice-inequality-health/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=justice-inequality-health&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/justice-inequality-health/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://www.who.int/teams/social-determinants-of-health\" target=\"other\">World Health Organization Commission on Social Determinants of Health</a>"
        ],
        "listed_links": [
            {
                "https://www.who.int/teams/social-determinants-of-health": "World Health Organization Commission on Social Determinants of Health"
            }
        ]
    }
}