{
    "url": "kant-development",
    "title": "Kant’s Philosophical Development",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Martin Schönfeld\n\nMichael Thompson\n<Michael.Thompson@unt.edu>",
        "author_links": [
            {
                "mailto:Michael%2eThompson%40unt%2eedu": "Michael.Thompson@unt.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\nMartin Schönfeld\n<br/>\nMichael Thompson\n&lt;<a href=\"mailto:Michael%2eThompson%40unt%2eedu\"><em>Michael<abbr title=\" dot \">.</abbr>Thompson<abbr title=\" at \">@</abbr>unt<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Nov 3, 2003",
        "substantive revision Fri Nov 22, 2019"
    ],
    "preamble": "\nModern philosophy begins with Kant, and yet he marks the end of the\n“Modern” epoch (1600–1800 AD/CE) in the history of\nphilosophy.[1]\nThe appearance of the Critique of Pure Reason in 1781 marks\nthe end of the modern period and the beginning of something entirely\nnew. Today his texts are read on all continents, and his thought has\nhad a profound impact on nearly all subsequent philosophical\ndiscussions. The 2004 bicentennial of his death, for instance, was\nreflected in conferences in Austria, Canada, China, France, Germany,\nHungary, Japan, Iran, Italy, Mexico, New Zealand, Paraguay, Poland,\nPortugal, Russia, Senegal, Spain, Sweden, Taiwan, and Turkey.\nLike other watershed figures, Kant has contributed to the shape of\nworld civilization, and the conceptualization we have of the world\ntoday. His practical ideas, such as the Categorical Imperative and its\nimplications (1785), informed the Universal Declaration of Human\nRights (1948), the Political and Economic Covenants (1966), and the\nInternational Criminal Court (2002). His exploration of natural\nsciences and his metaphysical ideas, particularly those of his\npre-critical period (1747–1770), are stunning. Kant gave the\nfirst account of the evolutionary reciprocity of spacetime and\nmomentum-energy, and formulated the first general law of free field\nradiation (1747). He suggested the conceptual solution of the three\nbody problem, which emerges in the interplay of Earth, Moon, and Sun\n(1754). He was the first to construct a detailed evolutionary\ncosmology (1755). His ideas on biospherical dynamics allowed him to\npredict the rhythms of the monsoon and the oscillation of coastal\nwinds (1755–1757). He suggested that the building blocks of\nmatter are energy bubbles (1756)—an idea that is useful today in\nsuperstring theory in the guise of Calabi-Yau manifolds.\nA number of recent findings have helped to shed more light on\nKant’s philosophical development.\nFirst, in terms of science, it now appears that his metaphysics has\nwithstood the test of time. While traditional scholars largely dismiss\nhis holistic ontology prior to the Critique, innovations in\nthe environmental and physical sciences have validated Kant’s claims\nas realistic insights in the workings of nature. His evolutionary\ntheory of the universe is now seen as “the essence of modern\nmodels” in cosmology (Coles 2001: 240), and his natural\nphilosophy is seen as the last milestone of western philosophy prior\nto its “comedown” to skepticism (Hawking 2003, 166). In\nlight of climate change, it stands to reason that Kant’s grasp on\nbiospherical dynamics and sustainable policies may well spur a\nphilosophical return to Kant in the near future.\nSecond, in terms of religion, important recent scholarship\nindicates an ambivalence, if not dislike of\nChristianity—something that his early biographers, all of them\nLutheran theologians, took pains to avoid\nrevealing.[2]\nKant can be seen as defending pantheism, naturalism, evolution,\ncosmic expansion theory and holism, even when doing so was\nincompatible with an academic career.\nIn the 18th Century university system defending such\nviews often led to dismissal and/or lack of promotion. Kant, himself,\nwas always cautious when writing on such topics. In the context of\ncensorship, writers tend to become circumspect. To avoid trouble, they\nmay publish something anonymously; or they may make oblique remarks\ninstead of direct statements; or they may have second thoughts and\nretract earlier statements. Kant did all three things. But, for later\nreaders in increasingly secular ages, it is easy to miss Kant’s\nsubtleties and implications.\nThird, in terms of culture, Kant’s early views may be placed in a\nglobal rather than a purely Western context. Recent research suggests\nthat key ideas of Kant’s natural philosophy also have sources in\nTaoist, Buddhist, Hindu and Confucian thought, which were\ndisseminated in continental Europe by Jesuits based in China,\npopularized by Leibniz and Wolff, and further developed by Wolff’s\nSinophile student \nBilfinger.[3]\n One example is the idea of dialectics that\nBilfinger found in the Chinese classics, and which Kant encountered\nin the proceedings of the Russian academy.  Importation and serious\nconsideration of eastern thought was in its infancy during the end of\nthe modern period, and Kant was unaware of the Far Eastern roots of\nthe notions that influenced him. The historical irony is that he\ndismissed nonwestern cultures while being deeply influenced by their\ninsights.\nScholars split Kant’s development into stages: \n\nthe pre-critical period (1745–1770), during which Kant works\nwithin the tradition of Leibniz/Wolff and writes his impressive early\nworks on natural phenomena; \n“silent decade” (1770–1781), during which Kant\nrefrained from publishing texts other than advertisements and\nendorsements for classes;\n the critical period (1781–1791), which marks the time of\ninsights or “the astonishing decade” (Beck 1969: 433) of\nhis critical philosophy; and \nthe post-critical period (1798–1802), often cited as works\nof old age.[4] \n\n Recent studies indicate that Kant’s philosophical development was\nfar more unified (Schönfeld 2000), and, in terms of its stages,\ninvolved deeper continuities (Edwards 2000) than previously\nrecognized. From the start, Kant was pushing quite a unique\nagenda. Recent scholarship contends Kant’s earliest works are not\nonly commensurate and continuous with his late claims, but also offer\ninsight into some oddities of the critical period, such as the Third\nAnalogy of the \nCritique.[5]\n The new picture of Kant’s development\nindicates that his intellectual trajectory was not as fractured and\nerratic as scholarship used to assume, and it also indicates that\nKant was not a late bloomer, but, rather, that he was innovative from\nthe start.\nThe following account covers Kant’s development from his upbringing\nto the critical period. Its theme is his intellectual formation: the\ninfluences in his youth and education; his views on natural\nphilosophy, ontology and cosmology shaped during his early adulthood;\nthe questions subsequently pursued; and the historical fate of his\nanswers.[6]\n",
    "toc": [
        {
            "#ChiStaSkyAboMeMorLawWitMe": "1. Childhood: “The Starry Sky Above Me and the Moral Law Within Me”"
        },
        {
            "#YouSerFan": "2. Youth: “In the Servitude of Fanatics”"
        },
        {
            "#StuYeaMarOutPatTak": "3. Student Years: “Marking Out the Path to Be Taken”"
        },
        {
            "#DynDebRadInvSqu": "4. Dynamic Debut: “Radiation in the Inverse Square”"
        },
        {
            "#NewStaSplSinUniRul": "5. Newtonian Stargazing: “The Splendor of a Single Universal Rule”"
        },
        {
            "#SysCosAllThiUniIntCon": "6. Systematic Cosmology: “All Things in the Universe Interactively Connect”"
        },
        {
            "#CriCriGroAmoMerCon": "7. Crisis and Critique: “Groping Among Mere Concepts”"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Childhood: “The Starry Sky Above Me and the Moral Law Within Me”\nImmanuel Kant was born April 22, 1724 in Königsberg, East Prussia\n(now Kaliningrad, Russia), as the eldest son of Anna Regina Kant, née\nReuter, (1697–1737) and Johann Georg Kant (1683–1746). The\nReuters were shoe- and harness-makers; the Kants were harness-makers\n(Riemer, a guild similar to saddlers).  Originally, the\nReuters were from Nuremberg in Bavaria; the Kants were from\nnot-too-distant Tilsit (now Sovietsk, Oblast Kaliningrad; Russia).\nThe union of Kants and Reuters provided an initial economic, emotional\nand religious stability for Kant during his early years. His\ngrandfather and father were competent businessmen, initially\nflourishing and respected in their strata of society. Anna was\nLutheran fit well into the like-minded Königsberg culture.\nImmanuel’s early childhood seems to have been idyllic. The family\nwas rather well off. The parents got along and loved their son. Johann\nKant appears to have been a gentle and hardworking man. Anna Kant, who\ntook care of the family’s paperwork, was well educated. Little\nImmanuel was her constant company, and her influence on him was\nconsiderable.\nAfter “Manelchen” could walk, Anna Kant took him out\nfor walks in the meadows and fields. She taught him what she could, of\nthe seasons, the plants and animals, and the sky. Her little son\nresponded eagerly with questions; and the mother encouraged his\noutdoor curiosity with praise, patience, and more information\n(Wasianski 1804: 247).\nThese details of nature provided a formative background for Kant’s\ninterest in natural philosophy, and the child grew up in an\nencouraging environment for early explorations. Königsberg enjoys a\ncool and gentle climate; typical of high latitudes, the flat Baltic\nterrain has not much biological diversity, and its\nbiomes—meadows, moors, deciduous and conifer forests—are\nnot hostile. At Kant’s time, bears and wolves were common along with\nother local fauna, but these posed no serious threat to Kant’s\nearliest encounters with nature. Walks, as the ones he enjoyed at the\nedge of town, were fun and perfectly safe. For Prussians at the time,\nexcursions into nature also had a spiritual subtext. Like Japanese\nShinto, German tradition invests natural places with meaning. The late\nand superficial conversion of the Baltic lands to Christianity, after\nthe fourteenth century, coupled with the fact that persecution drove\npagan faiths temporarily underground instead of eliminating them\naltogether, allowed the ancient nature-worship to prevail in forms\ninoffensive to the clergy, as in the guise of outdoor walks. Thus\npeople used to attend Sunday service—before heading out for\ntheir Sonntagsspaziergang.\nDuring Kant’s earliest years, the local influence of Pietism grew.\nThis Christian movement, founded by Jakob Spener (1635–1705) and\npromoted by August Hermann Francke (1663–1727), had spread north\nfrom Dresden, Leipzig, and Halle. It reached Königsberg at the turn of\nthe century, making inroads with the creation of schools and\norphanages. As Luther’s Reformation had been the effort to return\nRoman Catholicism to a purer faith, Pietism tried to purify\nLutheranism, stripping it of dogma and detail. The Protestant Church\navoided a schism in Prussia, but at the price of friction between the\nLutheran mainstream, orthodoxy, and the Pietist firebrands. Pietism\nstressed literal exegesis, quiet humility, and charitable deeds. It\nallowed believers to practice a spirituality of mystical\nintensity—but as the purge of Halle University (1723)\nillustrates, it had a totalitarian streak.\nThe local authorities frowned on the movement, but the Pietists\nenjoyed protection of King Friedrich Wilhelm I (reign 1713–40)\nand thus persisted. In 1731, the field chaplain Franz Albert Schulz\ncame to town, rising to become the local leader of the movement. He\nwas appointed to director of the Pietist high school\n(the Collegium Fridericianum) and later to professor of\ntheology. One of his early converts was Immanuel’s mother, who brought\nher children to his bible sessions.\nSchulz’s brand of Pietism differed from either Spener’s or\nFrancke’s and “was fraught with deep ambiguities, having a\ncomponent that was seen elsewhere as contrary to the basic tenets of\ntrue faith”(Kuehn 2001a: 39). Schulz’s Pietism straddled the\nline between Wolffian, rationalistic philosophy and enthusiastic,\nHalle religious sentiment. It stood for the equality of all to\ninterpret the Bible and a practical faith through charitable acts,\nwhile at the same time endorsing the political ambitions of Frederick\nI. It was a grassroots movement that the emphasized the personal\nnature of religion in contrast to establishment orthodoxy;\npolitically, it allied itself with the common citizen over the\nnobility. In Königsberg it was a divisive influence that was in\nconstant struggle with local authorities. In Kant’s formative years,\nKönigsberg was a place of religious upheaval, Pietists vs Orthodox\nLutheranism, and this marked conflict was to inform his position of\nreligious toleration and a separation of religion and philosophy.\nAccording to Kant’s later judgment (Wasianski 1804: 246; tr. Kuehn\n2001a: 31), his mother lived out a positive form of Pietism, blending\nlove, tolerance, and spirituality into a faith that was\n“genuine” and “not in the least enthusiastic”\n(‘enthusiasm’ or Schwärmerei means\nfundamentalism). The child’s formation was apparently not hurt by\nAnna’s piety; instead of turning into an intolerant zealot, as many\nPietist’s “enthusiasm” did, she instilled a reverence for\nnature and spiritualism, a plausible sense of right and wrong, and\nalways respected him as a person.\nKant is said to have claimed,\nI will never forget my mother, for she implanted\nand nurtured in me the first germ of goodness; she opened my heart to\nthe impressions of nature; she awakened and furthered my concepts, and\nher doctrines have had a continual and beneficial influence in my\nlife. (Jachmann 1804: 169; tr. Kuehn 2001a: 31)\nLater, he would develop a metaphysics whose claims would anticipate\nscientific discoveries, and an ethics that culminated in the\nCategorical Imperative. His friends chose the dictum from\nthe Critique of Practical Reason (1788) for his\ntombstone:\nTwo things fill the mind with ever new and\nincreasing admiration and awe, the more often and steadily we reflect\nupon them: the starry heavens above me and the moral law within\nme. (5:161.33–6; tr. Guyer 1992: 1)\nHad it not been for his sensitive and intelligent mother, his life\nmight well have taken an entirely different course.\n2. Youth: “In the Servitude of Fanatics”\nAs Immanuel grew older, hardships befell the family. After the\ndeath of his maternal grandfather (1729), the Kants suffered from a\nseries of events that would eventually ruin the family. The death\nleft the harness-shop downtown without leadership and Anna’s mother\nwithout a provider. To compensate, the Kant’s moved into the home of\nAnna’s mother on the outskirts of the city, in\nthe Sattlerstrasse, the saddler-street, a less prosperous\npart of the city. The saddlers, a guild distinct from harness-makers\nwhile producing similar goods, did not welcome the\ncompetition. Johann Kant became the target of the saddle-makers’\nhostility, and the business failed to prosper in the new\nlocation. Income steadily declined, and further hardship occurred\nwith the death of Anna Regina (1737). Just thirteen years old,\nImmanuel must have keenly felt the loss of his first tutor regarding\nnature and religious \nsentiment.[7]\nWhen Immanuel was six or seven, he went to\nthe Hospitalschule, a grammar school at the local clinic,\nwhose teacher was a Pietist candidate in theology. In 1732, Pastor\nSchulz, who knew the child through Anna, arranged for Immanuel, now\neight, to continue his education at the Collegium\nFridericianum. For a child of working-class parents, such as Kant,this was a\nfortunate opportunity. Instead of the traditional path,\napprenticeship at his father’s shop and the eventual inheritance of\nthe workshop, Immanuel was given the opportunity for higher education,\nunder the assumption he would pursue a religious or civil\nvocation. Practically speaking, this would raise Kant in the eyes of\nsociety and offer him the opportunity to raise himself above the rank\nand economics into which he was born.  One might conjecture that the\nsensitive and bright Kant would look forward to the possibility of\nadvancement. Unfortunately, the tutelage he received there was a\nrather more stringent form of Pietism than the one he found at home\nunder the instruction of his mother.\nKant would later judge the time of youth as the hardest years of\nlife, ruled by discipline, loneliness, and lack of freedom\n(Lectures on Pedagogy, w. 1776–87, p. 1803;\n9:485.13–17). School, at the Collegium, was held six\ndays a week. Sundays were spent with homework and prayer. Primary\nsubjects of instruction were Latin and religion. Only male pupils were\nadmitted; there was no way to meet girls or socialize, and, as the son\nof a harness-maker, Kant was already at a significant social\ndisadvantage. The later stages of his primary education (what we \nwould call high school) definitely changed his life for the\nworse. Immanuel was to attend high school until 1740, when he was\nsixteen.\nMoreover, the education was not even of great quality. Only rather\nelementary math was offered, and natural philosophy (biology,\nchemistry, geology, physics, and astronomy) was not taught at all.\nPupils were groomed for administrative and clerical careers, so\nscience was considered a luxury not to be indulged. The sciences were\nalso suspect from the theological perspectives of his instructors.\nPietist indifference to inquiry and fundamentalist denial of facts\nresulted in contemptuous hostility\ntoward science. As late as the 1750s, the clergy rejected the\nheliocentric system and frowned on Newton’s celestial mechanics as\nfiction. Pietist theologians such as Franz Budde (1667–1729),\nJoachim Lange (1670–1744), and Andreas Rüdiger\n(1673–1731) argued that the Bible teaches everything worth\nknowing of nature. The later Pietist thinker Christian August Crusius\n(1715–75) essentially concurred. For Pietism, particularly in\nits Saxon center, Halle, education was for practical management of\nlife’s affairs, not an endeavor with intrinsic worth. Mathematics was\nuseful for bookkeeping but worthless for describing reality. Physics\nwas acceptable as long as its findings did not undermine the\nBible. As independent research programs, however, the sciences were\ndeemed wellsprings of \nheresy.[8]\n Standard curriculum included a heavy dose\nof theology, catechism memorization and biblical stories. Although\nthe school did offer a variety of topics: Latin, Greek, Hebrew,\nlogic, history (both church and philosophy) and geography, the\nprimary use of this instruction was in preparation for further\ntheological study at the university. Education at\nthe Collegium was always in the service of the Pietist\nprogrammatic, conversion and salvation of souls.\nIn Halle, Pietism found its epicenter and religious temperament. In\nKönigsberg, however, Pietism—at the extent of its influence in\nthe 1730s—was moderated by the task to proselytize to the\nmainstream. Under Schulz’s guidance, ideological fervor was reined in\nby the need for flexibility when making converts.  Thus in Königsberg,\nit was not as monolithic as further south.  With his earliest\neducation at the Collegium, Kant was to suffer from the more\nsevere form of pedagogical ideals. During his university years, he\nwould enjoy more moderate educational ideals, as Kant’s later\nuniversity teacher, Martin Knutzen (1713–51), illustrates. A\npassionate Pietist, Knutzen studied Newton and discussed the ideas of\nLeibniz and Wolff—possible for Pietists in East Prussia, but\nimpossible for Pietists in Central Prussia and Saxony.\nDuring high school this moderation was not felt. The instructors at\nthe Collegium were stern. Pietist schooling involved a\nrigorous schedule, strict adherence to religious dogma, and\ninstruction by repetitive drills. The school’s goals were two-fold, to\nsave it’s pupils from “religious corruption” and to\nimprove their “worldly well-being” (Kuehn 2001a:\n46). Strict adherence to regimen, dogma and practical applications\nwere essential to these two goals. A former classmate, David Ruhnken,\ncriticized the “discipline of the fanatics” (letter to\nKant 10 Mar. 1771; 10:117.15); another classmate and life-long friend,\nTheodor Hippel (1741–96), spoke of Kant’s “terror and\nfear” whenever Kant would later recall the “slavery of his\nyouth” (Malter 1992: 95; tr. Kuehn 2001a: 45).\nTypical penalties for infractions, next to physical punishment,\nwere what would be called “guilt trips” today. In contrast\nto Catholicism (where sins are forgiven in confession), Protestant\nsalvation depends on grace. The faithful cannot rely on a ritual for\nexoneration; non-Catholic Christians steadily collect sins. They can\nonly do their best and better their odds for deliverance by remorseful\nintrospection. Pietism honed remorse into a fine art. Essential to\nsalvation is a sense of guilt—more an emotion, actually, than a\nsense (Schuldgefühl). God’s grace will wipe the slate clean,\nbut grace is neither predictable nor verifiable. The only measure, if\nthere is any, is the intensity of shame—the stronger the\ncultivated feelings of guilt, the better the chances for\nsalvation. The education at the Collegium institutionalized\nthis guilt and sought to properly instruct its charges with a contrite\nspirit and sense of conservative propriety. One should feel an\nenthusiastic guilt and sense of turpitude in an effort to become a\nbetter citizen, both spiritually and practically.\nWith the exception of a certain Heydenreich, a friendly Latinist\nwho introduced Kant to Lucretius’s De rerum natura (Borowski\n1804: 38–9), high school stunted Kant’s growth. He excelled at\nLatin, an emphasis at the school, and Greek, but struggled with\ntheology and arithmetic. He appears to have enjoyed classic authors\nunder the guidance of Heydenreich and many thought he would take up\nclassics at university.\nThe lack of scientific training would hamper his later explorations\nof nature. He tried to make up for it at the university in 1740, but\nhis mathematics instructor, Privatdozent Christian Ammon\n(1696–1742) was ignorant of the calculus (Kuehn 2001b:\n13–16)—an essential tool for understanding the\ncutting-edge physical research of the day. Kant’s quantitative skills\nwere to remain substandard; when he calculated, the results usually\ncame out all wrong (Adickes 1924a: 73–83; 1924b:\n1:38–9). This lack in mathematical training played into his\nbelated comprehension of Newton’s work, yet did not harm Kant’s\nappreciation for him. Such a substandard education in arithmetic,\nphilosophy and the sciences were the norm at the Collegium\nFridericianum, and Kant would have to continually work to make up\nfor this early deficit.\nHence Kant’s later contributions to natural science would have to\nremain of a conceptual sort. They amounted to brilliant\naperçus—but it was later physicists, not Kant, who articulated\nthem rigorously and substantiated them empirically.\nHigh school may have also affected the development of Kant’s\nethics.  In the absence of data, this effect is conjectural. Still,\ncommon sense suggests that his later interest in dignity and the value\nof autonomy might have been influenced by the treatment he suffered\nand witnessed in school. It makes sense that a thinker who recalls the\n“slavery of his youth” with “terror and fear”\nwould insist that treating humanity as an end, instead of a means\nonly, is a Categorical Imperative.\nMoreover, these experiences may also explain Kant’s exclusion of\nemotion from ethics; a curious exclusion, given his emphasis of the\nimportance of the good will (Foundations of the Metaphysics of\nMorals 1785; 4:393–5). Anna Kant died in 1737, when\nImmanuel was thirteen. From then on, the sensitive teenager associated\n“morality under the guidance of feeling” only negatively.\nThis may be due, in part, to the daily exposure to the guilt\nassociated with the doctrines of morality to which Immanuel was\nexposed at the Collegium. And without a mother as an\naffectionate and sane counterweight, the oppressiveness and negative\nassociations of guilt and morality must have taken its toll. He\nsuffered the pious whim of teachers, eager to instill feelings of\nguilt for the sake of salvation.  His later contempt for emotion is\narguably unjustified, but his upbringing suggests an explanation.\n3. Student Years: “Marking Out the Path to Be Taken”\nWhen Kant entered the University of Königsberg in 1740, he was\nsixteen. Financial considerations at home left much to be\ndesired. His widowed father filed his taxes as a pauper. But, a\nmaternal uncle, shoemaker Richter, supported Immanuel’s studies. In\naddition, Immanuel supplemented his uncle’s beneficence by working as\na tutor to fellow students. Often he did so for free, but, on\noccasion, Kant would accept luxuries to supplement his modest\nmeans. He was a sober and quiet student, not engaging in the\nfrivolous activities common to university\nstudents.[9] Yet\nKant was no drudge either. He enjoyed playing billiards, and did so\nwith such skill that he and his companions often won small sums of\nmoney to help defray the cost of living. As a member of the\nuniversity, Kant had risen to a new rank within society. In so doing,\nhe enjoyed privileges of this class and exemptions from duties e.g.,\nmilitary service/conscription, to which the lower classes were\nsusceptible. For a person of slight build and fragile constitution,\nKant’s upward social status concomitant exemptions very likely saved\nhis life.\nPastor Schulz had hoped the university student Kant would pursue a\nchurch career, but instead he took courses in logic, ethics,\nmetaphysics, natural law, and mathematics. Martin Knutzen\n(1713–1751), Kant’s advisor, introduced him to\nthe Principia (1687) and the Optics (1704), and\nprobably led him to think about natural philosophy. Additionally, Kant\nattended classes with Johann Gottfried Teske (1704–1772), whose\ncourses on electricity and experimental physics would inspire Kant’s\ndoctoral dissertation De Igne or Meditations on Fire\n(1755).\nFour years into his university education, the Kant family suffered\nanother set-back. In 1744, Kant’s father, Johann, suffered a\nstroke. Immanuel, twenty years old and now the head of the family,\nattended to his father’s health and stopped attending classes the\nfollowing year. He started writing on natural philosophy around this\ntime, trying to determine the properties of force, a theme much in\ncurrency at the time. In 1746, he buried his father, wrote the bulk of\nhis first work, submitted it to the censor, and secured a publisher. A\nyear later, in 1747, he completed the Thoughts on the True\nEstimation of Living Forces, settled the family’s affairs, found\nhomes for his younger brother and three sisters, and moved in with\nanother student. The Living Forces is his first known text,\nfirst publication, and first book.\nBut when Kant completed it, he withdrew from the university. In\n1748, he left town, without a degree, to work as a tutor for a noble\nfamily in the countryside.\nIt is tempting to explain Kant’s academic failure with financial\nreasons—his parents were deceased and the children had no\nsavings. Ostensibly Kant was responsible for not merely himself, but\nfor his siblings as well. Finances were tight, at the very best.\nHowever, the Kant family did have a benefactor, their uncle Richter,\nwho paid his course fees when Kant was enrolled and financed his\npublication after Kant had left (Borowski 1804: 46; Lasswitz 1902:\n521). Richter would keep supporting him and paid the printer for his\nsecond book (1755), too. Poverty was thus not likely the reason for\nhis withdrawing. Nor was it the lack of a thesis. The Living\nForces is a technical tract, 256 pages in the 1749-edition, more\nthan enough for a Magister-degree.\nYet Kant wrote the book in German, not in the Latin required for\nacademic theses, although high school had provided him with excellent\nphilological skills. Apparently he had not intended to submit\nthe Living Forces as his Master’s thesis. Why?\nThe contents supply the key. He declares that he shall criticize\nLeibniz and Wolff (ii, 1:7). He rejects the doctrine of\npre-established harmony according to which substances do not interact,\nrejecting Leibniz’s claim (Monadology 1714: sec. 7) that\nsubstances have no “windows”. For Kant, they do. Following\nKnutzen (who had earned his doctorate with a similar critique in 1735)\nhe says that substances change each other’s states by their mutual\nactions (#4, 1:19). He also rejects Wolff’s notion of a “moving\nforce”.  Kant argues (#3, 1:18) that force and motion have\nlittle to do with one another. Force is not so much about motion and\nmore about being. So a “moving force” is a misnomer. For\nKant, living forces are better described as the dynamic source for\nnature, an “active force” or a vis activa.\nThat Kant criticized Leibniz and Wolff should have improved his\nchances at graduation. Knutzen questioned their views, too. And\ncritically evaluating Leibniz and Wolff was the righteous thing to do,\neven in the moderate Pietist atmosphere of Kant’s university. The\ntheologian Lange in Halle had orchestrated Wolff’s expulsion from\nPrussia (1723) and triggered a furious row over Wolff’s Leibnizian\nleanings (1723–40). Other Pietists followed suit and rejected\nWolff because his support of Leibnizian harmony. This, combined with\nhis view of the world as a network of uniform substances, smelled of\nheresy. Wolff was considered a dangerous radical. But Kant’s reasons\nfor criticizing Wolff were different—Wolff was not radical\nenough.\nKant lays out his view in the first ten sections. Everything begins\nwith force. It is even prior to extension, as Leibniz had already said\n(#1; 1:17). Here Leibniz is right, Kant thinks, and praises him for\nhaving shed light on the Aristotelian concept of the entelechy, and\nLeibniz’s recovery of the basis for substantial forms. Yet Leibniz\ndoes not go far enough. Nature’s units are active forces (#1–3;\n1:17–18). Their action is constructive; they make and sustain\nthe fabric of nature. The world is a tapestry of energy\nconcentrations. Forces rule everything, not only bodily motions (#2;\n1:18.6–8), but all activities (#3; 1:18.27–36). This\nincludes mind-body interaction—materially produced ideas and\nmentally intended actions (#6; 1:20.35–21.1;\n21.14–16).\nDynamic action is absolutely fundamental. Force has effects by\nacting externally (ausser sich wirken; #4; 1:19.5), and, in\nthe full sense of the word, external action locates force\n(#6; 1:20.36–1:21.1). A force acts by radiating its action; it\nspreads its effects out (ihre Wirkungen von sich ausbreiten;\n#10; 1:24.23), and this spread determines its source as being inside\nit, locating force in virtue of its action. With action comes location\n(Ort), with location space (Raum), and with space\nthe universe (Welt)—and none of this would be without\nforce. Localized forces weave the world (#8) such that their\ninteraction forms networks (#7), braiding relation, order, and space\n(#9, 1:23.5–9). Force is the primum, knitting space and\neverything within.\nAs one source acts on what is outside of it, multiple sources act\non one another. They do so when their fields meet. For example, throw\ntwo pebbles into a pond and watch the interfering ripples: first,\npoint sources encounter each other’s activities at the boundary of\ntheir expanding radiations; next, these pulses, when striking each\nother, are modified when struck. External modifications of a radiation\naffect its internal makeup. Since force is an active pulse, and since\nactivity, for Kant, describes force better than anything else, a\ncollision with another field has constitutive effects on the original\nactivity.  (Consider weather—when air masses collide, they\naffect each other’s dew point, temperature, or pressure.) Hence Kant\nconcludes that the action of force-points amounts to mutual changes of\ntheir internal states (#4; 1:19.4–6).\nDynamic expansion and interaction through location makes space, and\nreciprocal action creates structure. Force-points stretch, grip, and\ntake hold, and the mutually modifying engagements constitute their\nconnections (#7; 1:21.30–33). This has consequences. That force,\nin virtue of its action, is put “somewhere” suggests a\nbond of force and space. This interactive bond is constitutive of\nreality.\nThese bold ideas doomed the text. A Christian advisor, even an\nopen-minded one, could never approve it. The dynamic ontology in\nchapter 1 contradicts the genesis account found in the\nBible. According to the Bible, God is the creator of everything. But\nKant suggests that force creates everything—force, not God, is\nthe creator of nature. Worse, force can be modeled mathematically, as\nhe argues in chapter 2, and it can be jointly determined by two\nquantities, as he argues in chapter 3. “God” is merely a\nplaceholder for the cause of force itself.\nNow Kant speaks of God as possible maker of multiple universes (#8;\n1:22), as engineer of dimensions (#11; 1:25), and as sealing off this\nworld from improbable others (ibid.). But in the same breath\n(#7–10), he makes force responsible for these tasks. And he\nalready showed his hand in his praise for the entelechy. Entelechies\nare programs of the self-organization and sustenance of\nthings—in Aristotle’s words, a dynamis put en\nergon or put in action; i.e., energeia.\nKant’s waffling over God and force permits only two readings.\nNeither of them would be palatable to any Christian worth his salt:\neither God is creative force, or God created creative force. By Kant’s\naccount, the former would mean that God is describable as a physical\nquantity. The latter would imply that force, not God, created the\nuniverse. Whoever suggests either is not a believer and does not\ndeserve to graduate under a Pietist advisor, not even a liberal\none.\nSo Kant was passed over. Knutzen never recommended him, and in\nKnutzen’s letters to Leonard Euler (1707–83), he is not on the\nlist of excellent students (Waschkies 1987: 20). The professor had\nmore regular favorites, such as Johann Weitenkampf (b. 1726) and\nFriedrich Buck (1722–86), who succeeded to Knutzen’s chair\n(Pozzo 1993: 283–322; Kuehn 2001b: 23).\nKant took resort to irony (#4; 1:21.3–8) and avenged himself\nby not mentioning his teacher—ever. Many years later (1770),\nafter Knutzen’s death, when Kant finally enjoyed some public\nrecognition, he would secure his long-desired professorship by\nstriking a deal with the administration to snatch Knutzen’s chair from\nBuck, pushing the pet student to another post without even asking.\nA word by Seneca sets the tune for Kant’s\ndebut—“Nothing is more important than to go where one\nought to go, instead of following the herd, like cattle, and go where\nthey went”.[10]\n Kant expresses the hope that “the\nfreedom I take of contradicting great men won’t be construed as a\ncrime” (1:7.6–9). He needed hope because he had made up\nhis mind. He knew what he was doing, and he was defiant. “My\nbasis is as follows,” he writes (1:10.25–7), “I\nhave already marked out the path that I shall take. I shall set out\non my course, and nothing shall stop me from proceeding along\nit”.\n4. Dynamic Debut: “Radiation in the Inverse Square”\nKant’s own intent was to understand the powers of nature and he set\nout to solve the puzzle of force. The Thoughts on the True\nEstimation of Living Forces was a contribution to the\nso-called vis-viva-controversy; its goal was to settle the\nissue once and for all. The issue was as simple as it is profound:\nwhat is force, and how can it be measured?\nThe controversy had begun in the previous century and was rife\nthrough the entirety of the modern period. Following the implications\nof his mechanical description of physical substances, Descartes\nargued that force is reducible to the mathematical quantity of motion\nobservable in matter. Descartes contended that this quantity is\nconserved in the universe. Nature is matter in motion, and motion is\nthe explanatory principle. “Force” is the product of mass\nand velocity (mv), a quantity called “quantity of\nmotion” or “dead pressure” then and momentum\nnow.[11] Beyond\nthis, for Descartes, “force” has no further\nmeaning. Cartesian essence can be isolated to physical and mental\nsubstances and force is neither of these. Force is not a dynamic\nessence, nor an essence at all. It is merely a quantity of motion\ncalculable in another substance.  By his rendering, Descartes reduced\nphysics to kinematics.\nLeibniz rejected the Cartesian formulation. When examining rising\nand falling bodies, he recognized that their behavior reveals a\ndifferent quantity, derived from Galileo’s law of fall, which is the\nproduct of mass and velocity squared (mv²). Leibniz\nthought this implied Descartes’s quantity to be false and that\nonly mv², not mv, is conserved. Leibniz called\nthis new quantity “living force” (vis viva); we\ncall it kinetic energy now. Force is real, he argued, and it is more\nthan a quantity (mv of Decartes)— it is the basic\nquality of nature and its activity can be observed in nature. Leibniz\nexpanded physics to a dynamics.\nLeibniz was correct about rising and falling bodies, but the\nCartesians (Descartes had died in 1650) pointed to other experiments\nin support of the mv-formula. Unfortunately for the early\ndebate, the issue could not be decided—because both sides had\nbeen right; there is both momentum and kinetic energy. So the\narguments continued for decades. After Leibniz’s death (1716), the\ncontroversy continued through his followers, who quarreled with the\ncurrent crop of French Cartesians. Newtonians were split over vis\nviva; Newton and his British fans rejected it, while continental\nNewtonians accepted it.  After Newton’s death (1727), in the 1740s,\nthe issue was settled—in Newton’s favor. D’Alembert proved that\nthere is a place for both quantities in physics (1743). Before that,\nEuler (1737) had already found out that Descartes’s momentum is\nNewton’s force acting over time, and Leibniz’s kinetic energy is\nNewton’s force acting through space. It did take, however, a while\nbefore this information spread and became generally accepted. The\ndebate died down around the time Kant published the Living\nForces (1749).\nKant’s debut was one of the many attempts at settling the dispute,\nbut for all practical purposes, it was a failure. The Living\nForces appeared too late to make any difference, and Kant was\nunaware of d’Alembert’s and Euler’s research. But what doomed the book\nin the public eye was that Kant seemed to have bet on the wrong team\nof horses. He argued for a synthesis of Cartesian kinematics and\nLeibnizian dynamics, and did so at the expense of Newtonian mechanics.\nAt the time he grasped Newton’s ideas only partially. He did not yet\nunderstand that motion, like rest, is a state (something Galileo had\ndiscovered) and that force is needed only for changing, not for\nkeeping a state (which is Newton’s first law of motion). He not only\nimplicitly rejected Newton through such mistakes, but also explicitly\nquestions his authority (preface, 1:7). Later in the book, he\ncriticizes the first law of motion (#50–51, #97–8),\nsuggests an alternative to Newtonian inertia (#124–5,\n#132–3), and dismisses as a “desperate excuse”\nNewton’s view that loss of motion reveals nature’s entropic tendency\n(#50; 1:59). He tried to determine force without even mentioning the\nsecond law of motion that defines it as the product of mass and\nacceleration. For Kant, Newtonian mechanics was irrelevant. While\nthere are hundreds of references to Descartes and Leibniz in the book,\nthe references to Newton can be counted on the fingers of one\nhand.\nIn fact, however, Kant was not as mistaken as it seemed at the\ntime.  For one thing, he arrived essentially at the same conclusion as\nd’Alembert and Euler: both mv and mv² are\nlegitimate, determinable quantities. More importantly, he proposed a\ndeep connection. While showing in chapter 2 that Descartes’s quantity\nis empirically well supported, he argued in chapter 3 that Leibniz’s\nquantity must be factored in to arrive at a full qualitative\nunderstanding of force. “Active force” is jointly\nmeasurable as “dead pressure” and “living\nforce”—the full account of force requires a synthesis of\nCartesian kinematics and Leibnizian dynamics, notwithstanding their\nconflicts.\nThat is, Kant not only regarded momentum and energy as relevant\nquantities, as d’Alembert had done, but he grasped that their union\npoints to the universal nature of force. This was sharper than even\nEuler’s insight. Euler had discovered that these quantities are\nderivable from Newtonian force and that there is accordingly a\nquantitative connection among them. But Kant invested this connection\nwith qualitative meaning, arguing that the structure of nature must\nbe understood in dynamic terms, and that Newton really misses the\npoint.  The title of the book, “Thoughts on the True Estimation\nof Living Forces” is no idle boast, for Kant’s “true\nestimation” is the insight that “living force” and\n“dead pressure” are two sides of the same\ncoin. Throughout the book, he wrestles with the harmony of opposites,\nCartesian kinematics and Leibnizian dynamics, trying to marry\nmomentum and energy—while having the audacity to criticize\nNewton. This is the thrust of the work. Taken as a prediction, it is\nsuperb. With his first publication, Kant intuited not only that\nmatter is ultimately energetic, but also that its dynamic measure is\nmomentum-energy.[12]\nThis aperçu was no lucky guess. Kant understood what force\ninvolves.  He argues that force is the essence of action (#4). This\naction is a pulse that “broadens out”\n(#9–10). Out-broadening of force (ausbreiten; 1:24.23)\nis an out-stretching of space (Ausdehnung; 1:24.6). Force\nmakes the continuum, being governed, in turn, by the created\nstructure (#10). This shift in understanding the nature of force\ncorrespondingly alters the nature one must think of material objects\nand dynamic interaction. The origin and source is force, and not\nsubstance, as the Cartesians had insisted. Force is responsible for\nsubstance, quantification and laws of nature—not the other way\naround. In this bold thesis Kant anticipates his more famous\n“Copernican turn”—an inversion of the way we view\nnature—but in this context he is still working in the field of\nnatural philosophy of his day. Dynamic interaction turns force into a\nfield and the void into a plenum. Kant anticipated that\nmomentum-energy is the substantial correlate of spacetime. Bypassing\nNewton, he caught up with \nEinstein.[13]\nConnected with this apercu is the proposed bond of force and\nspace—“force” understood as momentum-energy, Kant’s\nactive essence of substance, and “space” defined as Kant’s\ndimensional continuum. For Kant, force grips the void, holding it as a\ndimensional presence that localizes the original pulse. Force extends\nspace, ordering it, and space places force, governing it. Space\ndynamically expands; force structurally acts. Each needs the other.\nWithout force, space would lack structure (Abmessungen\nor Dimensionen, #9–10) and could not place a world\n(#7–9, 11). Without space, force could not be a field\n(#10). Force is spaced and space is forced. This is their bond\n(1:23–4).  Indeed: mass stretches spacetime, and spacetime grips\nmass.\nIn fact, Kant caught up with modern physics in several regards.\nAnother of his insights is so basic that it is easy to miss. He\ndefended force as the interactive matrix of nature and insisted on the\nimportance of dynamics. The dynamic ontology of the Living\nForces was ridiculed in its day, for Newton’s mechanics had\ndigested Kepler’s celestial dynamics and marginalized Leibniz’s\nphysical dynamics. Yet Kant’s stance would mark out the future course\nof science. We do not regard nature as a collection of particles and\nforces in empty space anymore, but instead as a system of\nenergy-pulses interacting in fields. Dynamics has turned out to be\nfundamental.\nWhen examining the force-space bond in detail (#10), Kant\ndiscovered the law of free point source radiation (1:24.19–23),\nhistorically the first generalization of the individual inverse-square\nlaws in natural philosophy:\nThe pressure of any point-source radiation in a free field drops at\na rate that is inversely proportional to the square of the propagated\ndistance.[14]\nKant’s generalization unites Kepler’s law of photo measurement\n(1604), Newton’s law of universal gravitation (1697), and Coulomb’s\nlater law of electrostatic force (1785) as instantiations of the\nspread of energy.[15]\n Kant’s law governs multiple forms of\nfree radiation, not just light, gravity, and electrostatic force, but\nalso radioactivity, radio waves, and sound.  Its most famous\napplication, in its first, Keplerian, instantiation, was Hubble’s\nmeasure of the luminosity of distant variable stars\n(1924)—which led to the discoveries of cosmic expansion and the\nBig Bang.\nIn the concluding reflection of the pivotal tenth section of\nthe Living Forces, Kant recognized the contingency of the\npressure-propagation ratio (1:24.26–8), inferred that other\nratios would generate continua with other dimensions\n(1:24.28–30), and surmised that a science in command of the\ndimensional range would be the highest geometry achievable\n(1:24.31–3). In light of quantum geometry and its modern\nguises—superstring and M-theories—this last remark might\nwell have been Kant’s most far-sighted prediction. Despite suffering\nfrom insufficient scientific training, the rejection by his advisor,\nthe academic failure, and the catastrophe in his family, Kant’s\nphilosophical debut in 1749 reveals the mark of genius.\n5. Newtonian Stargazing: “The Splendor of a Single Universal Rule”\nFor the next seven years, Kant’s life would be quiet. He was now\nteaching children in the Baltic countryside. As a Hofmeister\n(private teacher), he educated the sons of Pastor Andersch, from 1748\nto 1751, in the French settlement Judtschen, half a day’s walk from\nKönigsberg. Next he taught the sons of Knight von Hülsen at his\nArnsberg estate until about 1753, a two-day day ride from\nKönigsberg. Finally he worked as a tutor for Count Keyserlingk until\n1754. This in Kant’s life is marked by social engagements, dinners and\nconvivial living. During this time Kant’s finances improved, which\nleft him more time to attend to his tutoring and his own research.\nWhen Kant left town, the main influence on his thought had been\nGeorg Bernhard Bilfinger[16]\n (1693–1750), Wolff’s former\nassistant at Halle. Bilfinger’s heuristic method had inspired the\nproject of Living Forces.  This rule for finding truth is to\nidentify an intermediate position when experts advance contrary\nviews, provided ulterior motives are absent\n(1:32.7–13). Bilfinger’s rule had guided Kant to reconcile\nLeibniz and Descartes over force. This method was to characterize\nnearly all of his critical writings as well.\nIn the countryside, Kant realized that his debut had met with no\nsuccess, despite its inspiration. His middle way of synthesizing\nLeibniz and Descartes was ignored. Having criticized Newton, Kant now\nreconsidered his stance on Newtonian physics. When Kant published his\nsecond work, the Spin-Cycle essay (1754), his misgivings had\nturned into admiration. As its title states, it is an\n\ninvestigation of the question whether the earth in its axial\nrotation, whereby it causes the change of day and night, has\nexperienced any change since the earliest times of its origin, and how\none could answer this question, announced for the current year’s\nprize, by the Royal Academy of Sciences in\nBerlin. (1:183.1–12)\nKant describes gravitational attraction there as “nature’s\nuniversal engine” (das allgemeine Triebwerk der Natur),\nwhich allowed Newton to reveal the secrets of nature in a manner that\nis “as clear as it is indubitable” (1:186.35–7). In\nthe essay, he also announces his next book (1755) with the working\ntitle,\n Cosmogony, or attempt to deduce the origin of the\ncosmos, the constitution of celestial bodies, and the causes of their\nmotions, from the general laws of motion of matter according to\nNewton’s theory. (1:191.4–8)\nKant’s Newtonian conversion would be completed while working on\nthe Spin-Cycle essay. The early drafts still involve\ndiscussions of Huygens’s dynamics (23:5–7). But published\nargument is sharpened to a Newtonian point—no other natural\nphilosopher is even mentioned. Newton had become Kant’s authority and\nhis sole scientific point of reference.\nLittle is known of Kant’s actual conversion. Only start and\nfinish—Living Forces and Spin-Cycle—are\npresent. But it does not take much imagination to fill in the blanks.\nIn 1749, Kant promoted his book and waited for a reaction. When\nkeeping track of the relevant journals, it could not have escaped him\nthat Newton was the winner, nor that Leibnizian dynamics was on the\nwane and that support for Cartesian kinematics had all but\ncollapsed. Force was Newtonian force. Newtonian physics had become the\nnew paradigm of natural philosophy.\nBy his own account, Kant was not enthusiastic about his employment,\nbut he did not hate it either. Some of his charges affectionately\nstayed in touch and later sought him out in the city. He was on good\nterms with Andersch and Hülsen, and the work for the Keyserlingks was\nthe start of lifelong friendships. So his tutoring responsibilities\nwere not too great a burden. Afterwards, he would churn out\npublications at breath-taking speed—two tracts, one book, a\nMaster’s thesis, and a dissertation; each of them on a different\ntopic, and all of them in little more than one year (from June 1754 to\nSeptember 1755). The timing suggests that he had written some of it\nalready in the countryside.\nThis means he had leisure. He taught, but also pursued his own\ninterests. Remarkable about his Newtonian conversion is not the change\nof heart, but the change in competence. His first publication, despite\nits brilliance, reveals his confusions over basic mechanics and a\nremedial grasp of the mathematics needed to understand Newton. His\nnext group of works displays a firm grasp of celestial mechanics and a\ngrowing appreciation of the Principia. Digesting its\ncontents, particularly in the given form (in fluxion instead of normal\ncalculus) could have taken months, if not years.\nThe context in which Kant found himself may have lent itself to a\nmore holistic engagement with Newton. Rural life is life in daylight.\nKant had to adapt to his employers and attended to his charges during\nthe day. Because his leisure would have been after dinner (sundown) or\nbefore breakfast (sunrise), he probably read the Principia at\nnight. Nights before the industrial revolution were different than\nthey are now. Nights were dark, and when there was neither clouds nor\na full moon, stars would blaze with intensity unfamiliar to us\ntoday. The starry skies must have been awe-inspiring. We can\nconjecture that Kant, studying the Principia, would\noccasionally step outside and look up. He was reading about celestial\nmechanics—and then he would see it. Kant’s subsequent\npublications reveal his exuberance about the stars and the laws they\ndisplay; just as they reveal his grasp of the planetary dance and his\nrecognition of Newton’s achievement. Kant’s employment in the\ncountryside can certainly be understood as a boon to his study of\nNewton.\nKant’s earlier work had sensitized him to the dynamics of nature,\nand this would have made it all the easier to marvel over celestial\nmechanics while stargazing. Thinkers with a dynamic bent, from\nPythagoras to Kepler, listened to the music of the spheres. As\nKepler’s Harmonice Mundi (1619) shows, the music of the\nspheres is not a poetic delusion but a heuristic\ndevice.[17] It\nturns one’s attention on cosmic patterns, the harmonies and beats\nthat point to laws. As the Spin-Cycle essay illustrates,\nKant followed in the footsteps of such thinkers.  Listening to the\nmusic of the spheres would generate the astonishing discoveries of\nthe 1750s.\nOn the face of it, it seems inexplicable how Kant could apply\nNewton’s theory of the tides to the fate of Earth’s axial\nrotation. But in the Spin-Cycle essay (1754), Kant arrived at\nthe right result for the right reasons. Newton showed that the\nprimarily lunar gravity acts on ocean tides. This action, Kant argues,\nconstitutes a retarding moment on the Earth’s surface (1:187); this\nretardation, he infers, slows down the Earth’s rotation (1:188); and\nthe lunar brake only lets go, he concludes, when days are as long as\nlunar months (1:190). He found the solution despite multiple\nhandicaps: minimal data, unimpressive formal skills, and no\ninstruments.\nBut if the planet’s rotational fate is modeled as music, the\nsolution will be loud and clear. The gravitational pulls beat out\ndifferent rhythms. Daily terrestrial rotation and monthly lunar\nrevolution are not in sync. The resonance of their two spheres rattles\nwith a noise—drumming a syncopated beat, the lows and highs of\noceanic tides. This tidal noise distracts from the rotating\nrhythm. The tidal taps, every six hours, weaken the Earth’s\nbeat. Syncopates are dissonant; they are mechanical wobbles, and they\nwill eventually cease.  Undermining the cosmic beat, the dynamic\nopposites slow the Earth’s spin down until they dissolve in\nharmony. When, in the far future the Moon always shines over the same\nspot, the Earth will have found its rhythm, sans tidal\ncacophony, and be in sonic step with its celestial neighborhood, and\nthe rotation of the Earth will be slowed.  Thus Kant’s astrophysical\nessay was possible.\nIn retrospect, Newton had clarified to Kant the force-space bond of\nthe Living Forces. In its new guise, the bond is so useful\nthat its implications go beyond the Earth-Moon system. Its pulse, the\npulls and pushes, is the rhythm of the cosmos. The lesson of\nthe Living Forces is that matter is energy, and that forces\nact and interact with space. Aristotle’s entelechy reveals that an\ninitial dynamic push produces material order when put into\naction. This action involves Bilfinger’s dialectical harmony of\nopposites, but it is Newton who reveals its actual and precise\nmechanics.\nCosmic action turns on gravitation, the reciprocal attraction of\nmasses. When drawn together, masses collide, crash, and are laterally\ndeflected. The angular momentum of deflections generates a\ncounterforce to centripetal gravitation—centrifugal\nrepulsion. Applying Newton to the bond, in his second\nbook Universal Natural History and Theory of the Sky (1755),\nKant sees that the dynamics of force, its push and pull, are\nattraction and repulsion. Matter is then all you need, he says, and\nyou can start building a world (1:229.10–11).\nThis is far more radical—and more consistent—than\nNewton’s approach. Gravity will not do the trick of world building.\nHowever, the cosmic harmony of dynamic opposites, attraction and\nrepulsion, can do the conceptual work, provided one assumes a random\ndistribution of particles. This proviso marks a step beyond\nthe Living Forces. There, in the first book, Kant had\nexplained space by the outward action of force, but had glossed over\nthe individuation of multiple dynamic presences, necessary for cosmic\nevolution. Here, in the second book, he assumes an initial material\nchaos and explains its growth into ordered complexity by the\ninteraction of forces.\nKant’s two cosmological starting points—dynamic stretch into\nthe void in the 1740s, and homogeneous material chaos in the\n1750s—are not contradictory. The reflections in his first book\nbegin with the very beginning, with existence prior to extension. The\nreflections in his second book proceed from the next stage, existence\nin extension. Kant’s initial cosmogony starts with force stretching\nout into a void, creating a field. His next theory begins with the\nextended field sedimenting into a scattering of particles. He does not\nreplace a dynamic by an atomistic theory, or switch from active forces\nto inert matter. Matter always remains the guise and result of\nenergetic interactions. As he would stress in his professorial thesis,\nthe Physical Monadology (1756), particles are force\nconcentrations, whose solidity is due to dynamic interplay.\nIn light of present knowledge, his reflections were largely\ncorrect, and the gap in his cosmic history—the interval from\ndynamic extension to material particles—remains subject to\ndebate today. Cosmologists are not unanimous on what happened in this\nperiod.  Nonetheless, they have substantiated that force came first\nand that material chaos followed next. The universe did start\ndynamically as a singularity, whose first outward-bound and energetic\naction—the Big Bang—wove a dimensional structure in its\nwake. The continuum (the disentangling of space and time) emerged\n10−51 years and the chaos (the formation of atomic\nnuclei) 10−5 years after the Big Bang—followed\nby the creation of atoms, of stars, the Sun, and the Earth. Within the\nexpanding bubble of the Bang is the universe today.\nAs soon as material chaos is assumed, everything happens on its\nown.  Kant contends in the Universal Natural History that\nnature’s flourishing toward well-ordered complexity is explicable\nthrough an “essential striving” (1:226.8–12). No\nNewtonian “hand of God” needs to stave off perceived loss\nof motion (1:222–225); he had already stated earlier that\nappealing to lost motion is a “desperate excuse”\n(Living Forces #50; 1:59). As he explains now—taking\nnothing back from the stance that cost him his graduation—God\ndoes not function in nature’s development because creation is\nself-organization. Fully convinced of this, he warns fundamentalists\nagainst opposing science; if they did, they would be defeated\n(1:222.32–35; 225.2–5).\nThe push and pull of the bond explains cosmic self-organization,\nand in the Universal Natural History Kant shows how the chaos\nevolved to the starry skies visible now. It should be possible to do\nthe same for organisms, but science at the time did not explain the\nformation of life. How life unfolds we do not know\n(1:230.14–20); we only know that it does. Kant believes (science\nagrees) that star birth is easier to determine than the creation of\nlife (1:230.20–26).\nWith his famous nebular hypothesis, Kant discerned how planets,\nstars, and galaxies form. Their birth is a process of titanic power.\nAttractive forces contract particles into clouds, but repulsive\nforces deflect them up close. Continued accretion increases\ndeflection, imparting angular momentum on the ever quicker rotating\ncloud. Rotation generates centrifugal forces, pulling the cloud’s\nequators outwards, crushing the poles, until the out-bulging yet\nin-falling sphere, revolving ever faster around its center, flattens\ninto a disc. The bond, in Newton’s model of universal gravitation,\ncontinues coalescing in momentum and spin, until the center of the\ncosmic disc is so energized that it combusts. Increased energy\ntranslates into increased structure, organizing the ecliptic plane\ninto lumpy coalescence. When the disc plane sediments into spinning\nbands, the lumps grow massive, while caroming along their orbits. The\nmoving masses vacuum their paths and grow into planets strung along\nan ecliptic plane, orbiting a sun in now empty space—or, on a\nhigher order of magnitude, into suns majestically revolving around a\nbrightly lit galactic center. Whether suns in spiral galaxies, or\nplanets in solar systems, the orbiting satellites sweep out equal\nareas in equal times, with their periods in sync with their distances\nfrom the gravitational \ncenters.[18]\nWith this essay, Kant synthesize Newton with his own theory of\nforces, leading Kant to the cutting edge of current knowledge. Nature,\nin the Universal Natural History, streams outward in a\nwavefront of organization (1:314.1–2), generating worlds\n(1:314.8), biospheres and sentience (1:317.5–13, 352–3),\nand finally reason, human and otherwise (1:351–66). Organization\nis fragile, and spontaneity, pushed far enough, invites chaos. Mature\ncosmic regions decay, chaos sets in, and entropy follows in the wake\nof complexity. But entropy provides the very conditions that allow the\ncosmic pulse to bounce material points back to order. Thus the\nexpanding chaos coalesces at its center into order, followed by chaos,\nby order, by chaos. Like a rising and burning phoenix, nature cycles\nbetween life and death (1:312.13).\nFor creatures, the cosmic phoenix is a problem. Humans are just\nfeathers on its wings. Humans grow only to burn to ashes; they are not\nexempt from the cosmic law (1:318.17–18). As the pulsing cosmic\nvector governs everything, order emerges on all orders of magnitude,\nfrom the repetitive birth of the phoenix to the elements to life and\nto inevitable collapse—only to begin anew again. The force-space\nbond unfolds in the interactive harmony of dynamic opposites, an\ninteraction governed by Newton’s universal gravitation, churning out\ngalaxies, suns, planets, life, and minds. Thus, as Kant writes, a\n“single universal rule” guides natural evolution in an\nabsolutely glorious way (1:306.18–23).\n6. Systematic Cosmology: “All Things in the Universe Interactively Connect”\nWhen Kant returned to Königsberg in early autumn 1754, his\nprospects had improved. King Friedrich II (Frederick the Great, reign\n1740–86), like Kant a victim of a fundamentalist education, had\ninstituted liberal policies in Prussia that were making themselves\nfelt in the province. Kant’s former advisor Knutzen had died (1751),\nand a freer atmosphere now pervaded the university. Kant had saved\nsome money, supplemented his formal education with his own studies,\nand was prepared to return to school. He would now complete his\nstudies and start his academic career.\nHe dedicated the Universal Natural History to Frederick\nthe Great and published it in spring 1755. With this publication, Kant\ncautiously published anonymously. The problem was not risking\nreligious opposition by endorsing Newton. Rather, it was that Kant had\nsharpened celestial mechanics to a secular and dynamic cosmology,\nwhile replacing Newton’s Christian view of natural design with a\nnon-anthropocentric and naturalistic teleology. He supported Newtonian\nmechanics and cosmology, but to the detriment of biblical creation\nstories.\nNewton had thought that cosmic organization required the hand of\nGod, but Kant eliminated any need for divine interference. Newton had\nsupposed that God regularly infuses nature with new motion to keep\nthe world machine from running down due to entropy; he had accepted\nthe notion of final causes as ways in which God makes himself known;\nand he had appealed to God’s miraculous adjustments whenever physical\nexplanations failed him, as in the case of the ecliptic\nplane.[19]\nNewton could not explain the coplanar orbits of planets and surmised,\n“such a wonderful uniformity in the planetary system must be\nallowed the effect of choice” (1979 [1730]: 402).\nKant discovered in the Universal Natural History that the\nplanetary arrangement on the ecliptic plane results from forces acting\non particles that accrete in a spinning cloud. Hence there was no need\nto follow Newton and appeal to God. Nor was there any compelling\nmetaphysical reason to do so. Force is goal-directed and its energy\nunfolds the cosmos. The term Kant employs for this\nunfolding, Auswicklung der Natur (1:226.8), is the\n“out-wrapping” of nature, from primal force to complex\nstructure. “Out-wrapping” is both process and purpose.\nPurpose is not imposed by a supernatural God, but, instead, woven into\nthe natural fabric. Teleological ends and means are natural in the\ndevelopment of forces, location, space and particles; the interplay of\nforces is the vehicle of final causes, and the telos of\nnature is its own fulfillment. (1:223, 263, 332). Even in its simplest\nstate, matter has the urge to develop itself. (1:228, 262–3,\n314). The rise of order and abundance—or biological diversity,\nin our terms—marks nature’s quest toward fulfillment, and this\nprocess, fueled by the incessant pulse of attraction and repulsion,\ngenerates harmony and beauty.\nFollowing this cosmic model, in which Kant rejects extrinsic\nteleology for an immanent version, everything is connected. Taking\nhis cue from Pope’s “chain of being”, Kant likens the\nuniverse to a Kette der Natur, the “chain of\nnature” (1: 308, \n365).[20]\n Humans are merely links in the greater\nchain of being. Dismissing the anthropocentric teleology of Wolff,\nDerham, and the physico-theologians, Kant finds the claim that the\nuniverse was created for human purposes exaggerated—and\nprovincial.[21]\nAn intelligent louse, he says, might as well imagine that the scalp\nit lives on and the forest of hair that surrounds it were created\njust for the sake of its happiness; from a louse’s point of view,\nthings surely look that way (1:353–4). In the chain of nature,\nall beings are equal. Nature does not play favorites, none of the\norganic links, whether it be an insect or a rational being, is more\nimportant than another (1:354). As the goal of force is complexity,\nthe goal of nature (commonly understood) is biodiversity, the goal of\nplanets is to sustain biospheres, the goal of terrestrial existence\nis to increase biota—the telos of nature is life\n(1:353), at least until it reaches maximum density and begins to\nfracture in cosmic collapse.\nWhat kind of life? Ultimately, Kant argues, planets aim to sustain\nintelligent life. Inspired by Fontenelle’s vision of inhabited\nworlds, he conjectures that there may well be extraterrestrial\nlife.[22]\nNothing, however, guarantees that humans are the crowns of creation\nnor even atop the chain of being. Humans, Kant conjectures, occupy a\n“middle rung” on the ladder of creatures\n(1:359.29)—and are possibly infinitely distant from the top\ntier of intelligent beings (1:353.35–6). A sober look at\nourselves shows that we are on a risky course (gefährliche\nMittelstrasse, 1:366.7) halfway between wisdom and\nirrationality. We are cosmically mediocre.\nA theme of Kant’s thought, dominant in the pre-critical period,\nintegral to the critical period, and to which he returns in old age,\nis that humans are part of nature. He was too familiar with the\nphilosophy of Descartes and its problems to subscribe to a mind-body\ndualism of distinct substances, the one thinking, the other\nextended. Instead he followed Bilfinger’s heuristic, and already in\nthe Living Forces he had solved Descartes’s puzzle of\nmind-body interaction by arguing that minds are spatially located\nwithin their bodies, and that both are energetic structures that\ninfluence each other (1:20–21). In the later Prize\nEssay (1764), he would judge the Christian notion of immaterial\nsouls as indemonstrable (2:293), an argument he re-echoes in his\ncritical writings as well (A339/B397–A405/B432). Although minds\nare not necessarily matter in a literal sense, he would argue there\nthat they are probably some kind of energy-bundles commensurate with\nthe material framework of nature. Here in the Universal Natural\nHistory, he describes humans as material beings; the makeup of\nrationality is linked to the constitution of matter as a product of\ndynamic force (1:335).\nAll things interactively connect, and as minds shape matter, matter\nshapes minds. Coarse matter makes mental fibers inflexible\n(1:356). The IQ-constraining coarseness is proportional to density. In\ncosmic terms, this means that rational force depends on spatial\nlocation. In the stellar nebula (the embryonic solar system), matter,\nconsisting of elements with varying density, was randomly\ndistributed. But as soon as an interactive forces pulls the material\ncloud in and sets it spinning, denser particles will not be as easily\npushed around as lighter ones; when unequal bits collide, lighter ones\nbounce off while denser ones remain on track. Denser elements,\ndeflected later, cruise on lower orbits; lighter elements, deflected\nsooner, orbit higher up. Orbital height is inversely proportional to\nmaterial density (1:270); hence orbital bands form denser planets the\ncloser they are to the Sun (1:277; Kant’s “static\nlaw”). Kant speculates that really superior intelligence will\nonly emerge in the rarefied matter of outer planets (1:359). The\ndenser a planet is (as Earth, close to the Sun) the denser,\nunfortunately, are its inhabitants.\nThe anonymous publication of the Universal Natural History\nwas prudent but not without risk. The dedication indicates Königsberg\nas place of composition; the publisher Petersen was a local company,\nand eventually the identity of the author would have come\nout.[23]\nPetersen went bankrupt just when copies of the Universal Natural\nHistory were off the press and in a warehouse. The warehouse was\nsealed—and then mysteriously burned down, which allowed\nPetersen to collect insurance and pay off creditors. Bankruptcy and\nfire prevented the book’s distribution (Rahts 1902: 545–6;\nKrafft 1971: 193). But this was not necessarily a bad turn for\nKant. As the fates of Spinoza, Tschirnhaus, or Toland illustrate, you\ncannot be a dynamic freethinker and a professor in the conservative\nuniversity system at the same time.  Considering Kant’s goals, the\nmisfortune over the book was a blessing in disguise.\nUndaunted, he set out to write his Master’s thesis. According to\nthe ideas articulated so far, Kant envisioned a radiating essence\nthat organizes itself in cosmic expansion. The core stretches out as\ninteractive complexity, emerging in biospheres populated by\norganisms, while eventually pulling back into itself, like a phoenix\nof nature, burning up only to rise from the ashes. The cyclic\n“out-wrapping of nature” generates structures, some of\nthem animated, a few of them intelligent. By their harmonic\ndevelopment, the natural structures will eventually allocate force\nwithout lateral boundaries, setting the cosmic vector free. When this\nis a universal condition, the energy flow is uniform in reiterative\npatterns across magnitudes. It is then entropic. Overcoming the last\nboundary, the vertical order of magnitudes, force rushes into itself,\nconcentrating its pulse once more to a singularity before the next\ncosmic upsurge.[24]\nIn order to understand the dynamics of force at the inception of\ncosmoi, the pulse of the bond, flaring out structure, may be\nvisualized as fire. Fire is an exemplar of the interplay of forces. It\nis no surprise that the author of Living Forces\nand Universal Natural History would want to investigate it,\nfor doing so might lead to more insights about the cosmic matrix. He\nchose Johann Gottfried Teske (1704–72), a professor of physics\ninterested in electricity and lightning, as his advisor and graduated\nwith A Succinct Outline of Some Meditations on Fire.\nHence Kant, who would later soar to the heights of\nthe Critiques and the Categorical Imperative, earned his\nphilosophy degree with a Master’s thesis on the structure of fire\n(1755).\nOn Fire is an elaboration of the energetic model of\nmatter.  Kant argues there that all bodies, solid, liquid, and gaseous\ntypes, consist of dynamic particles or molecules (moleculae,\n1:372.24 and passim). He contends that the particles cohere in an\nelastic medium. This medium, the ether, permeates the molecular\ninterstices of bodies (prop. 3, 1: 372). He calls this ether\n“fire-matter” and identifies it as the carrier of warmth\nand light. Heat results from wave-like vibrations of this materia\nignis among the molecules (prop. 8, 1:377). As it is known today,\nheat is a symptom of molecular vibration, which in turn depends on the\nenergy-state of a body.\nAfter being awarded with Master’s degree, Kant wrote his\ndissertation, the New Elucidation of the First Principles of\nMetaphysical Cognition (1755). At first glance, this work has\nlittle to do with his previous research on force, cosmos, and fire. It\nis about the principles of ontology, specifically the conceptual tools\nfor metaphysical investigations. In fact, however, it was only a\nmatter of time until he would write such a work. Now he would explore\nthe cognitive access to dynamic interactivity and the causal structure\nof human integration into nature. Quite naturally, Kant moved from\ncosmic origins to nebulae to solar systems to planets and biota, and\nthen to rational life. With his doctoral dissertation, Kant hoped to\nget to the bottom of the things that interested him most.\nCommonsensically understood, humans are parts of nature. Their\nactions are free, yet natural processes are mechanical and\npredictable.  One pressing question then becomes: How do human actions\nand natural processes relate? If nature is the out-wrapping of force,\nand intelligent beings are products of the cosmos, how is their free\naction possible in a lawful natural matrix? In the New\nElucidation, Kant argues for a compatibilist view—both\nhuman freedom and natural necessity are real, and neither is reducible\nto the other. As Kant’s thematic continued to develop, their seeming\nconflict finds a dynamic resolution. Everything in nature happens for\na prior reason (1:396.8–9), and this rule applies to both\nnecessary events and free actions. Both process-types share the fact\nof causal connectivity, but they connect to causes in different ways\n(1:400.30–7). Causation types concern the degree of power by\nwhich they are influenced, and this is what distinguishes between the\ntwo. The opposites, free acts and mechanical events harmonize over\nforce. A free will is not something being pushed around, but is\ninstead a “determining power” (determinandi\npotestas; 1:404.8). By its power, a will can withstand impulses\n(motivi) without being always forced by them\n(1:404.10–14, 34–9).  Those events that do not have\nsufficient power to withstand force are seen as natural and necessary\nconsequents, those events that possess sufficient ability to withstand\nforces are seen as free acts. Thus freedom/ spontaneity is naturally\npossible.\nLater, in the Foundations of the Metaphysics of Morals\n(1785), Kant would distinguish between “things” and\n“persons” (4:428), describing the former as natural means\nand the latter as rational ends. Persons are free; what distinguishes\nthem is their will, a faculty of determining oneself to action\n(4:427).  Self-determination is the basis of freedom; necessitation is\nthe mark of nature. The New Elucidation supplies the unified\nground for this dichotomy. Autonomy and heteronomy are a matter of\ndynamic degree.  Persons and things alike are energetic bundles of\ncollocated forces, but the superior rational force of persons can\nresist others and is capable of autonomy.\nAs the title of the New Elucidation of the Principles of\nMetaphysical Cognition indicates, it is a new attempt to clarify\nthe cognitive principles needed for understanding the structure of\nreality. The force-space bond in Kant’s first book, as well as the\nattractive-repulsive interplay in his second, reveal that dynamic\ninteractivity is the generative matrix of nature. Interaction is not\n“one” thing but involves at least two poles that engage\nwith one another. Because the dynamic\n“between”—their link—is fundamental, the\ncognitive tool for capturing the ultimate reality cannot be\n“one” principle. It cannot even be a basic principle of\nidentity (a = a). Interaction is a relation of distinct\nitems that grip one another—if they were not distinct, the event\nwould be an action, not interaction. But it is dynamic interactivity\nthat is the thing in itself.\nHence the New Elucidation does not begin with the\nprinciple of identity, like other ontological templates. Kant states\nthat “there is no unique, absolutely first, universal principle\nof all truths” (prop. 1, 1:388.11–12). Instead, the\nidentity-pair of opposites is absolutely primary (absolute\nprima): “whatever is, is, and whatever is not, is\nnot” (prop. 2, 1:389.3–6). Affirmative and negative\nidentity, when juxtaposed, suggest contradiction. This means that\ncontradiction is a derivative of the primary\nidentity-pair.[25]\n It also means that contradiction is\ngoverned by a prior (prae) identity (prop. 3,\n1:390.30–2). Just consider any real knowledge: truth rests on\nan intuition of its ground (intuiti niti, 1:394.3–4),\nand if one wants to go beyond tautological transformations, ground of\ntruth will differ from truth grounded.  Analogously, actual states of\naffairs are grounded in other events (prop. 6,\n1:394.10–11). Hence distinct antecedent reasons determine\ntruths; distinct prior grounds determine things. At the same time,\nthe truths determined give meaning to the antecedent as their reason,\nand the things determined give context to the prior as their\nground. Reality emerges as soon as the dynamic center patterns\nalterity, while being placed and defined by the patterned alterity\nwhen doing so. The resulting interaction is essential. And it is\naccessible.  Metaphysical cognition begins with communal identity\n(communiter principium identitatis) governing contradiction\n(prop. 2, 1:389.3–6).\nAs the communal identity of opposites is the universal grounded,\nthe ultimate ground must be identity as such. Now the simple unit\nappears.  It is outside our grasp but absolutely necessary (prop. 7,\n1:395.4–6). The necessary existing unit is called\n“God” (ibid.). From it everything follows (prop. 8,\n1:396.8–9). Specifically, what follows, and now once more within\ncognitive reach, is change (mutatio, 1:410.18). Kant’s\nPrinciple of Succession makes change intelligible: change occurs\nbecause of substantial connections ([substantiae] cum\naliis connexae sunt); the mutual dependency of substances\ndetermines mutual alterations (prop. 12, 1:411.18–200). A bond\ngoverns change and thus reality. This dynamic-structural bond is a\nreciprocal, harmonious dependency. Metaphysical cognition ends with\nreciprocal commercium or interactivity, Kant’s Principle of\nCoexistence (prop. 13, 1:412–13).\nThat such a dynamic harmony can exist is so amazing that it has to\nbe divinely sustained (1:413.10–15). Thus the New\nElucidation ends with the marvel over interaction. He writes:\n\n… Since we find all things in the universe to be\ninteractively connected … we must admit that this relation\ndepends on a joint cause, on God, the universal principle of beings.\n…The same pattern of the divine understanding, which generates\nexistence, also establishes the relations of things to each other, by\nconceiving their existences as correlated with each other. From this\nit is evident that the universal interaction of all things must be due\nto this … divine idea. (1:413.13–20)\n\nKant confidently concludes that his system of universal interaction\nis certainly (certe) better than the pedestrian theory of\nphysical influence. The reason, he explains, is that universal\ninteractivity (systema universalis substantiarum commercium,\n1:415.40) reveals the origin of the connection governing things, an\norigin that completely escapes ordinary physical influence because\nthis theory looks at substances in isolation (1:416)—ignoring\nwhat happens among them, the dynamic “between”.\nKant was on a roll. He turned to writing his professorial thesis\nor habilitationsschrift, the Physical Monadology\n(1756).  Have established the fundamentality of “the\nbetween” for both free events and mechanical causality (and\ntheir compatibility), Kant then turns to discuss what the\n“between” means with regard to the structure of\nmatter—the physical manifestation of forces. Material things are\nextended—they take up space. The terminal units of nature must\nbe point-entities, for if they weren’t, they would be further\ndivisible and not be the final constituents.  Ontology suggests that\nspatial objects consist of final elements. Logic requires that final\nelements are indivisible, hence points. Geometry warns that points\nnever fill a volume, regardless how many are used. So how can points\nmake up the spatial things in nature? On the matrix-level, what\nhappens “between” the points?\nBuilding on his earlier works, Kant continues to expound that force\nis prior to extension; everything comes about through the dynamics of\nforce, pushes and pulls; and even on the smallest scale the\nattractive-repulsive interplay must structure space (determinata\nvolumina, 1:484.10–12). Bodies are coherent webs of\nforce-points. The dynamic point-entities are intelligible as\nmathematical centers, but dynamically, they are centers of active\nradiation fields that mutually confine each other. Physical monads are\nthus elementary energy spheres (sphaera activatis\nor ambitum activitatis; 1:481.9–10, 37). They are\npoints and, as such, indivisible—but they radiate and in doing\nso create extension. Hence non-extended points constitute extended\ncomposites. We must think in dynamic terms, because corpuscular\ninterpretations of nature do not work, not even for the ether\n(1:486.5–35). As he writes at the end of the Physical\nMonadology, the ether is energetically structured space or\n“fire matter” (aether seu materia ignis;\n1:487.18), woven by elastic bonds (iunctae elasticitates;\n1:487.12).\nThe professorial thesis has the full title, “the use in\nnatural philosophy of the synthesis of metaphysics and geometry, whose\nfirst sample contains the physical monadology”. Kant argues that\nthe combination of metaphysics and geometry can produce good\nphilosophy (1:473). According to him, it seems easier to mate griffins\nwith horses than to join exact science and conjecture\n(1:473.22–4), but truth is found in pursing just his course, the\n“physical monadology” is a case in point.\nThe ultimate units, Kant’s sphaera activatis, are terminal\nconcentrations of energy that stretch out as active dimensional\nspheres. This insight matches current theoretical physics. In current\nparticle physics, string theory conceives of force-points as closed\nvibrating loops that whip their exteriors into dimensional\nshape. Force generates extension—even on the level of\nelements. From what science can tell today, the resulting dynamic\nspacelets, so-called Calabi-Yau spaces, are the smallest extension\nunits of reality.\nGeometry and conjecture lead to the origin of physical extension.\nCalabi-Yau spaces, the modern-day correlates to Kant’s spheres, are\napproximated through quantum geometry. The units, superstrings (the\nbranes of M-theory seen on edge), are smaller than the empirical\nthreshold, the Planck length. Kant contended that the units are beyond\nthe measure of the sensible. Modern cosmologists would agree, both in\nthat investigating the absolutely large, the cosmos, necessarily leads\nto the investigation of the absolutely small, and in that this path\nleads from the empirical to the rational. The quest has become formal,\nand its physical pioneers are mathematicians. Beyond the scope of\nexperiments, the explorers of strings and branes today do conceptual\nwork. And like Kant, they stress the intelligible beauty of\nnature.\nThis conceptual work is guided by logical and aesthetic criteria,\nby elegance and simplicity. By Kant’s own testimony, the contemplation\nof nature was for him an intensely aesthetic encounter. In\nthe Observations on the Feeling of the Beautiful and the\nSublime (1764), his greatest public success before\nthe Critiques, he would develop a phenomenology of\nbeauty. Depending on the intensity of the experience, an aesthetic\nencounter can be either with beauty, exciting pleasure—or with\nthe sublime, striking awe, sensual overload, even terror\n(2:208–9). Later, in the Critique of Judgment (1790),\nhe would argue for the heuristic value of aesthetic notions such as\ndesign and unity.\nWhen Kant was still working on the Physical Monadology, a\ntsunami shattered the coastal city Lisbon (1 November 1755). Fires\nbroke out in the chaos that merged into a firestorm incinerating the\nrubble. It was the worst earthquake recorded up to this point in\nWestern history; 70,000 people died. It struck on Sunday, which\nhappened to be a holiday (All Saints Day, Allerheiligen for\nKant). The twelve-meter (40 ft) high waves slammed at the city\nchurches just when the flocks had gathered. The impact destabilized\nthe towers, which collapsed backwards for static reasons, crashing\nthrough roofs and crushing whoever prayed below. The brothels, located\nfurther up in the hills, were spared. The faithful died, and the\nsinners survived.  This posed a theological challenge.\nKant wrote three papers on the catastrophe. The first, On the\nCauses of the Terrestrial Convulsions (1756), was an essay on the\nphysical dynamics of earthquakes; Kant speculated that there are giant\ncaves underneath mountain ridges (1:419–20). Sometimes gases in\nthe caves form combustible mixtures. When the gases release, the caves\ncollapse, shaking the earth (1:422). Although Kant’s conjecture is\nfalse (quakes are usually due to plate tectonics), it is\nmethodologically beyond reproach, employing known data (mining\nexplosions) to formulate a testable hypothesis. The second\ntract, History and Natural Description of the Most Curious\nOccurrences associated with the Quake (1756), is a report on what\nhappened in Lisbon. The third, Further Observation on the\nTerrestrial Convulsions (1756), is a refutation of superstitious\ncauses such as invidious astrological conjunctions.\nIn all three essays, Kant insists on secular explanations.\nEarthquakes are terrible, but they are merely events in nature\n(1:420).  We do not know what they mean in the larger frame of things,\nand to interpret the Lisbon earthquake as a divine punishment is naïve\nanthropocentrism.\nKant was interested in earthquakes not only because of the singular\nevent in Portugal, but also for the reason he wrote on winds,\nthe Theory of Winds (1756), and the West-Wind essay\n(1757). The most dramatic human encounters with natural forces are\nfire, storms, and earthquakes. Anyone intrigued by force would want to\nstudy these phenomena. Fire is pure energy. Earthquakes are the brutal\naction of force. And winds are the best examples of force moving\nthrough space. Meteorological phenomena in particular were an\nopportunity to apply the hypothesis of the force-space bond, the idea\nthat active, dynamic forces modify each other and that external\nmodifications of a radiation will affect the internal constitution of\nthem. Air masses can be modeled as these fluctuations, and weather\ninvolves a clear instantiation of dynamic interactivity.\nKant discovered that the direction-patterns of coastal winds are\nthe result of rhythmic thermal expansions and contractions of air\ncolumns over coastal and marine surfaces (1:223–4;\n1:492–4). But weather is not only due to the push and pull of\nenergies, the interaction of force (thermal radiation) and space (air\ncolumns over surface). As winds are motions in space, other motions\nmay drive them on. Rotational forces—investigated in the\nearlier Spin-Cycle essay—are especially important. They\nwere Kant’s key for his discoveries, later confirmed, of the dynamic\nweather cycles responsible for trade winds, equatorial winds, and the\nmonsoon.\nAfter a hiatus of several years, in which high teaching loads\npermitted him to write only little, Kant turned to what would be the\nculmination of his systematic cosmology. As the New\nElucidation had already shown, the analysis of the interactive\nnatural community points to an absolute and transcendent ground. The\ncontemplation of nature inexorably leads to a reflection over the\nabsolute. Kant examined the perfection of dynamic interactivity and\nits sustaining divine unit in the Essay on Optimism (1759),\narguing that relative natural perfection amounts to the harmony of a\nmanifold with a rule, and that absolute divine perfection is such that\nits manifold contains within itself the ground of reality\n(2:30–31note). Their difference, in terms of reality or\nperfection, is just a matter of degree (2:31.16)—the thrust and\nlimit of the cosmic vector. In 1762, now pushing forty, Kant resumed\nthis line of inquiry and wrote what would be his third book, Only\nPossible Ground of a Demonstration of God’s Existence\n(1763). Kant explores there the divine limit of the natural vector.\n“God” is defined as the necessary, unified, and constant\nbeing.\nThe first part of the Only Possible Ground contains an\nontological argument of the divine bond. Instead of regarding\nexistence as a predicate (2:70–4), Kant derives necessary\nexistence from possibility\n(2:77–84)[26]\n The bond governing nature is derivable from\nits intelligible possibility, and not from any anthropological story\nnor from the notion of a necessary being. The bond Kant describes is\nconsidered divine, but should not be confused with standard\nanthropological descriptions. One may employ and ontological argument,\nbut one should be clear on just what one is describing as a necessary\nbond.\nThe second part contains a teleological argument. Here Kant\nrestates parts of the Universal Natural History\n(2:93–100, 123–51). Since few copies of that book had\nsurvived the publisher’s bankruptcy, he wanted to repeat once more its\nsalient points—while toning down, or omitting altogether, its\nmore provocative insights. Relevant for the topic was the immanent\nteleology of nature found in the Universal Natural\nHistory. In virtue of its own forces acting on matter, nature\nemerges as a uniform system that evolves to ever increasing order,\ndiversity, and complexity. The divine and active bond is the cosmic\nvector, and we can observe its design in nature’s evolution. And since\nthe design derives from the “inner possibility” of objects\n(2:91–2), both conceptual and teleological arguments share the\nsame ground.\nThe divine bond is the unified and indispensable dynamis.\nThe corresponding traits of cosmic structure—unity and\nharmony—make Kant’s argument from design possible. The third and\nfinal part of the Only Possible Ground contains his\nassessment of the ontological and teleological arguments. Only the\nformer qualifies, strictly speaking, as a proof (2:161–1). A\ncomparison reveals their differences. The one is a rigorous and\nconceptual demonstration, while the other is its probabilistic and\nempirical application. But truth is to be found in their harmony; both\nare rooted in the same key notion, possibility. Since empirical design\nis built into the intelligible dynamis of objects, both\narguments harmonize over the essence of the bond. This is why the book\nhas its peculiar structure: two arguments (Beweise) but one\nground (Beweisgrund), which is possibility,\nKant’s Möglichkeit or Aristotle’s dynamis.\n7. Crisis and Critique: “Groping Among Mere Concepts”\nBut when Kant was reflecting on the divine ground of nature, he was\nassailed by doubts. Studying force in nature is one thing, but\ndeducing God’s existence is quite another. Can one identify God in the\nrigorous and comprehensive way suggested in his third book? Here the\nultimate task clashes with ultimate method. Determining the absolute\nby means of formal demonstration and empirical evidence is too\nbold. How could Kant be certain that he was not kidding himself?\nThe preface of the Only Possible Ground reveals his inner\ntorment. Providence, he writes there, already imparted to common sense\nthe notion that God exists, hence the project of a demonstration is\nredundant (2:65). The insight that God exists does not need “the\nsophistry of subtle inferences” (ibid.). In theory, such a\ndemonstration might illuminate much else in this object, but “to\nachieve this purpose, however, one must venture into the bottomless\nabyss of metaphysics” (2:65.25–66.1). And what is\nmetaphysics? A dark ocean without shore and lighthouse, Kant says, on\nwhich it is all too easy to lose one’s way (2:66.1–6).\nThis is followed by a startling retraction: he writes that his\nontological proof, of all things, should not be mistaken for a\ndemonstration (2:66.12–13). But if it were not a demonstration,\nwhat else could it be? What he wanted to do, he says, was to supply\n“just an argument in support of a demonstration”;\na construction kit (Baugerät) for a future proof\n(2:66.9–10). This kit has been assembled with “great\ndifficulty” (ibidz.), and even so, he owes the reader an\napology, for the kit is incomplete—frankly, it is bad\n(schlecht; 2:66.28).\nTwo years before Kant’s loss of heart, in 1761, the Prussian\nAcademy had announced a question for the public competition of\n1763. The question was whether metaphysical principles, specifically\nthe principles of natural theology and morals, could be proven with\nthe same clarity and precision as the truths of geometry. King\nFrederick II had invited foreign intellectuals and scientists, such as\nMaupertuis, d’Alembert, La Mettrie, Voltaire, Lagrange, and Euler to\nthe academy, and they had little patience with their speculative\nGerman colleagues.  Newton’s star kept rising, and the tough-minded\nforeigners put the metaphysicians in Berlin on the spot. The prize\nquestion was the result.\nWhile Kant was writing the Only Possible Ground, he\nprepared a submission to the contest, the Inquiry Concerning the\nDistinctness of the Principles of Natural Theology and Morals\n(1764). The treatise is known as the Prize Essay, although\nKant only received second prize, behind Mendelssohn. Work on\nthe Prize Essay put Kant in a stressful situation, not only\nbecause he had to meet the contest deadline, but also because he\nforced himself to engage with metaphysics on two levels—in the\nbook, he pursued a first-order question on God’s existence, and in the\nessay, he examined the second-order question of whether such a pursuit\nis actually feasible. This forced Kant to question himself and the\nproject of his book.\nThe Prize Essay was a step toward the issue that would\nlater acquire obsessive importance for Kant, the problem of the\npossibility of metaphysics as a system of conceptual (a\npriori) judgments that are synthetic—that really generate\ntrue knowledge claims, instead of just paraphrasing what is\n“known” through common sense. But, in contrast to\nthe Critique of Pure Reason (1781), the Prize Essay\ncontains still a modicum of hope. Its concern was not whether,\nbut how metaphysics can be possible. Asking “how”\nsuggests that metaphysics is feasible, and that the task is only a\nmatter of determining its right method.\nAs a model of method, the Principia suggested itself. No\nother work in recent history had had such an impact on knowledge; no\nother book had revolutionized the understanding of nature as much as\nNewton’s masterpiece; and no other book contained so many discoveries\nin such rigorous form. Such rigor, it appeared, was the key to the\nextraordinary quality of its contents. Kant, who had studied Newton’s\ninsights a decade earlier, now studied his guidelines, spelled out not\nonly in the “Rules of Philosophy” of\nthe Principia but also in the queries of\nthe Opticks. In the final query (1979 [1730]: 404–5),\nNewton suggests the research strategy of an analysis of wholes into\nparts, followed by a synthesis of the identified causes into\nexplanatory principles.\nAccordingly, Kant’s methodological proposal in the Prize\nEssay is a case for a conceptual analysis as the starting point\nof metaphysics. Synthetic reasoning is premature as long as the\nconcepts involved are ambiguous. Eventually metaphysics should turn\ninto a synthetic discipline, but its current limitations require a\nmandatory analytic phase first (2:290).\nThis proposal allowed Kant to present himself as a thinker with\nexacting standards, and his Prize Essay was a reality-check\non the overly optimistic winner, Mendelssohn’s Treatise on the\nEvidence in the Metaphysical Sciences (1764). The Prize\nEssay was a critique: metaphysics can be salvaged, but only by\nrebuilding it from scratch.\nBy drawing this conclusion Kant sawed off the branch he had been\nsitting on since 1745. Is conceptual philosophical inquiry into\nreality capable of certainty? Kant’s answer was “not\nyet”. But conceptual inquiry had been his work to date, from\nthe Living Forces to the Only Possible Ground. Hence\neverything he had done suddenly appeared to him as terribly\npremature. Suddenly, Kant was in a crisis.\nThings came to a head a year later, in 1765, when he, now\nforty-one, read the Swedish mystic Emmanuel Swedenborg\n(1688–1772). In Heavenly Secrets (8 vol.,\n1749–56), Swedenborg relates his visions of angels, describing\ntheir spiritual world in detail. Kant had been intrigued by the\nhearsay of the clairvoyant’s exploits, but when he read the work, he\nrecognized it as a fraud.\nKant wrote a scathing satire, the Dreams of a Spirit-Seer\n(1766). In it he denounces Swedenborg as the “arch-spirit-seer\nof all spirit-seers” (2:354.20), whose works are\n“fantasies” (2:363.36), “wild figments of the\nimagination” (2:366.11), “eight tomes of nonsense”\n(2:360.15), and the results of “hypochondrial winds” that\nresult in effluence when raging in the guts, and in heavenly visions\nwhen raging in the mind (2:348.25–9).\nWhat disturbed Kant was that he saw in the farting mystic a parody\nof himself (Laywine 1993: 71). The visionary’s world of angels is\nthe reductio of dynamic cosmology—the absurd final\nconsequence of Kant’s own contentions. He had always assumed that\nreality is radically coherent. Science and metaphysics join hands in\nits investigation because the cosmos involves an intelligible as well\nas an empirical side: humans are unqualified parts of nature; mind and\nbody are energetic interacting presences; rationality depends on\nmatter; freedom in nature is just a question of resisting force; and\nso forth. There is only force, and its product, nature. Kant’s ideas\nhad amounted to a dynamic parallelism of the corporeal and the\nmental—just like Swedenborg’s philosophy of heaven.\nThe Dreams of the Spirit-Seer was thus also a\nself-critique. He wrote Mendelssohn that to preempt mockery by others,\nhe found it wisest to mock himself, which was honest and something he\nhad to do because his mind “is really in conflict on this\nissue” (10:70.2–5). The problem, he explains, is the\npresence of the mind in the material world, and that analogies between\nspiritual and material substances are flights of fancy unhindered by\ndata (10:71–2). With this admission, in the letter on April 8,\n1766, before his forty-second birthday, the entire pre-critical\nproject Kant had worked on since he was twenty had come to a crashing\nhalt.\nKant’s first response to this devastating outcome was to overreact.\nWhen a position as a professor at Königsberg University was available,\nhe had to write yet another thesis for the application\nportfolio, On the Form and Principles of the Sensible and the\nIntelligible World (1770), the so-called Inaugural\nDissertation. Since the problem handed to him by the mystic had\nbeen the dynamic unity of a jointly sensible and intelligible reality,\nthe solution must be, according to Kant, their divorce. In\nthe Inaugural Dissertation, he slashed through the Gordian\nknot by cutting nature into two halves, the mundus\nintelligibilis of metaphysics and the mundus sensibilis\nof science.\nHis second response was more considered and very courageous. He\nconfronted his long-held convictions and examined them on possible\nflaws, by which meant to determine which of the claims previously\nadvanced hold up and those that do not. This soul-searching amounted\nto a second-order investigation—not an examination of the\nconceptual contentions as such, but an examination of their\nknowability. This turned out to be an intense task that consumed more\nthan a decade of his life, and which resulted in his greatest work,\nthe Critique of Pure Reason (1781).\nAmong its findings, which historically changed the face of\nphilosophy, are that traditional metaphysics is over (Aviii–x,\nAxix–xx, Bxiv–xv), and that proofs for God’s existence are\ndone with (A631–42/B659–70). Discoveries later made in\nneuroscience confirm Kant’s insights and affirm that perception\nresults from interaction, whereby pathways organize affecting data\n(B1, A15/B29, A50–51/B74–5, B113, B148–9), and that\nthe subject of organized experience—the synthetic unity of\napperception—poses the hard problem of consciousness\n(B154–9).\nAt the same time, Kant qualified there his previous split of the\nsensible from the intelligible; and it was good that he did, because\nas his early insights illustrate, his dynamic ontology, albeit\npremature, had always been on the right track. Thus interactivity\nentered the Critique as a cognitive device for ordering data\n(the disjunctive relation or community; A70/B95 and A80/B106) and for\nperceiving spatial objects (the principle of coexistence;\nA211/B256–A215/B262). The energy field (force stretched out as\nspace) returns there as well, as the only exception to Kant’s critical\nrule not to talk about the intelligible features of mind-independent\nnature.  But the rule had to be broken, he realized, because the\nenergy-field sustains the interactive experience of spatial things\n(A211/B257–A213/B260).\nLater, there would be even more qualifications of the split, and\nKant’s return to his original themes with the Opus Postumum\nwould turn the former divorce of intelligible and sensible into a\nmerely episodic division to be overcome. But by 1781, he had found his\nway: the continued quest for the big questions, but now tempered by\ncritical caution.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Adickes, Erich, 1924a, “Kant als\nNaturwissenschaftler”, <em>Kant-Studien</em>, 29:\n70–97.",
                "–––, 1924b, <em>Kant als Naturforscher</em>, 2\nvols., Berlin: DeGruyter.",
                "Beck, Lewis White, 1969, <em>Early German Philosophy. Kant and His\nPredecessors</em>, Cambridge, MA: Harvard University Press.",
                "Bird, Graham (ed.), 2006, <em>A Companion to Kant</em>, Oxford:\nBlackwell.",
                "Böhme, Hartmut and Gernot Böhme, 1983, <em>Das Andere der\nVernunft. Zur Entwicklung von Rationalitätsstrukturen am Beipsiel\nKant</em>, Frankfurt: Vittorio Klosterman.",
                "Borowski, Ludwig, 1804, <em>Darstellung des Lebens und Charakters\nImmanuel Kants</em>, Königsberg: Nicolovius.",
                "Brady, Emily, 2013, <em>The Sublime in Modern Philosophy:\nAesthetics, Ethics, and Nature</em>, Cambridge University Press.",
                "Coles, Peter (ed.), 2001, <em>The Routledge Companion to the New\nCosmology</em>, London: Routledge.",
                "Edwards, Jeffrey, 2000, <em>Substance, Force, and the Possibility\nof Knowledge</em>, Berkeley, CA: University of California Press.",
                "Edward, Jeffrey and Martin Schönfeld, 2006, “Kant’s Material\nDynamics and the Field View of Physical Reality”, in Schönfeld\n2006c: 109–123.",
                "Geier, Manfred, 2003, <em>Kant’s Welt: eine Biographie</em>,\nReinbeck bei Hamburg: Rowohlt.",
                "Guyer, Paul, 1992, “Introduction: the starry heavens and the\nmoral law” in P. Guyer (ed.), <em>The Cambridge Companion to\nKant</em>, Cambridge, UK: Cambridge University Press.",
                "Goldman, Avery, 2012, <em> Kant and the Subject of Critique: On\nthe Regulative Role of the Psychological Idea</em>, Indiana University\nPress.",
                "Hawking, Stephen, 2003, <em>The Theory of Everything: the Origin\nand Fate of the Universe</em>, Beverly Hills: New Millennium.",
                "Hawking, Stephen and Roger Penrose, 1996, <em>The Nature of Space\nand Time</em>, Princeton, NJ: Princeton University Press.",
                "Jachmann, Reinhold Bernhard, 1804, <em>Immanuel Kant geschildert\nin Briefen an einen Freund</em>, Königsberg, Nicolovius.",
                "Kepler, Johannes, 1937, <em>Gesammelte Werke</em>, 19 vols., M.\nCaspar (ed.), Munich: C.H. Beck.",
                "Krafft, Fritz, 1971,\n“Analogie—Theodizee—Aktualismus. Wissenschaftshistorische\nEinführung in Kants Kosmogonie”, in F. Krafft\n(ed.), <em>I. Kant: Allgemeine Naturgeschichte und Theorie des\nHimmels</em>, Munich: Kindler.",
                "Kuehn, Manfred, 2001a, <em>Kant: A Biography</em>, Cambridge, UK:\nCambridge University Press.",
                "–––, 2001b, “Kant’s Teachers in the Exact\nSciences” in E. Watkins (ed.), <em>Kant and the Sciences</em>,\nOxford, UK: Oxford University Press.",
                "Lasswitz, Kurd, 1902, “Anmerkungen zu <em>Gedanken von der\nwahren Schätzung der lebendigen Kräfte</em>”, in\nKant, <em>Akademie Edition</em>, 1:521–33.",
                "Laywine, Alison, 1993, <em>Kant’s Early Metaphysics and the\nOrigins of the Critical Philosophy</em> (NAKS Studies in Philosophy\n3), Atascadero, CA. Ridgeview.",
                "Malter, Rudolf, 1992, <em>Kant in Rede und Gespräch</em>, Hamburg:\nMeiner.",
                "Newton, Isaac, 1953, <em>Newton’s Philosophy of Nature. Selections\nfrom His Writings</em>, H.S. Thayer (ed.), New York: Hafner.",
                "–––, 1972 [1726], <em>Philosophiae Naturalis\nPrincipia Mathematica. The third edition with variant readings</em> A.\nKoyré and I.B. Cohen (eds.), 2 vols., Cambridge, MA: Harvard\nUniversity Press.",
                "–––, 1979 [1730], <em>Opticks, or A Treatise of\nthe Reflections, Refractions, Inflections and Colours of Light</em>,\n4<sup>th</sup> edition. A. Einstein, E. Whittaker, <em>et al.</em>\n(eds.), New York: Dover.",
                "Paulson, Friedrich, 1902, <em>Immanuel Kant: His Life and\nDoctrine</em>, New York: Scribner’s Sons.",
                "Pozzo, Ricardo, 1993, “Kant e\nWeitenkampff”, <em>Rivista di storia della filosofia</em>, 48:\n283–322.",
                "Rahts, Johannes, 1902, “Anmerkungen zur <em>Allgemeinen\nNaturgeschichte und Theorie des Himmels</em>”, in\nKant, <em>Akademie Edition</em>, 1:545–558.",
                "Rockmore, Tom, 2001, “Introduction” in Tom Rockmore\n(ed.), <em>New Essays on the Precritical Kant</em>, Amherst, NY:\nHumanity Books.",
                "Robinson, Daniel N., 2012, <em>How is Nature Possible?: Kant’s\nProject in the First Critique</em>, New York: Bloomsbury\nPublishing.",
                "Schönfeld, Martin, 2000, <em>The Philosophy of the Young Kant: the\nPrecritical Project</em>, Oxford, UK: Oxford University Press.",
                "–––, 2006a, “Kant’s Early Dynamics”,\nin Bird 2006: 33–46.",
                "–––, 2006b, “Kant’s Early\nCosmology”, in Bird 2006: 47–62.",
                "––– (ed.), 2006c, <em>Kant and Confucianism,\nSpecial Issue</em>, <em>Journal of Chinese Philosophy</em>, 33(1):\n1–157.",
                "–––, 2012, “Introduction to <em>Thoughts\non the True Estimation of Living Forces</em>” in E. Watkins\n(ed.), <em>Immanuel Kant: Natural Science</em> (The Cambridge Edition\nof the Works of Immanuel Kant), Cambridge, UK: Cambridge University\nPress.",
                "–––, forthcoming, “Georg Bernhard\nBilfinger”, in H. Klemme and M. Kuehn (eds.), <em>Dictionary of\nEighteenth Century German Philosophers</em>, London: Thoemmes.",
                "Shell, Susan Meld and Richard Velkley (eds.), 2012, <em>Kant’s\nObservations and Remarks: A Critical Guide</em>, Cambridge: Cambridge\nUniversity Press.",
                "Thompson, Michael L. (ed), 2013, <em>Imagination in Kant’s\nCritical Philosophy</em>, Berlin: DeGruyter.",
                "Waschkies, Hans-Joachim, 1987, <em>Physik und Physikotheologie des\njungen Kant</em>, Amsterdam: Gruner.",
                "Wasianski, E.A. Christoph, 1804, <em>Immanuel Kant in seinen\nletzten Lebensjahren</em>, Königsberg: Nicolovius.",
                "Watkins, Eric (ed.), 2012, <em>Immanuel Kant: Natural Science</em>\n(The Cambridge Edition of the Works of Immanuel Kant), Cambridge, UK:\nCambridge University Press.",
                "Weinberg, Steven, 1993, <em>Dreams of a Final Theory</em>, London:\nVintage.",
                "–––, 1999, “A Unified Physics by\n2050?” <em>Scientific American Special</em>, 13:\n36–43.",
                "Wheeler, John A., 1990, <em>A Journey into Gravity and\nSpacetime</em>, New York: Scientific American Library.",
                "Wood, Allen W., 2005, <em>Kant</em>, Malden, MA: Blackwell."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<p>References to Kant’s texts follow the Academy edition\n(<em>Gesammelte Schriften</em>, ed. Akademie der Wissenschaften,\nBerlin: Reimer, later DeGruyter, 1910ff.) by volume, page, and, if\nuseful, by line. References to the <em>Critique of Pure Reason</em>\nare to the first (A) and second (B) editions.</p>\n<ul class=\"hanging\">\n<li>Adickes, Erich, 1924a, “Kant als\nNaturwissenschaftler”, <em>Kant-Studien</em>, 29:\n70–97.</li>\n<li>–––, 1924b, <em>Kant als Naturforscher</em>, 2\nvols., Berlin: DeGruyter.</li>\n<li>Beck, Lewis White, 1969, <em>Early German Philosophy. Kant and His\nPredecessors</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Bird, Graham (ed.), 2006, <em>A Companion to Kant</em>, Oxford:\nBlackwell.</li>\n<li>Böhme, Hartmut and Gernot Böhme, 1983, <em>Das Andere der\nVernunft. Zur Entwicklung von Rationalitätsstrukturen am Beipsiel\nKant</em>, Frankfurt: Vittorio Klosterman.</li>\n<li>Borowski, Ludwig, 1804, <em>Darstellung des Lebens und Charakters\nImmanuel Kants</em>, Königsberg: Nicolovius.</li>\n<li>Brady, Emily, 2013, <em>The Sublime in Modern Philosophy:\nAesthetics, Ethics, and Nature</em>, Cambridge University Press.</li>\n<li>Coles, Peter (ed.), 2001, <em>The Routledge Companion to the New\nCosmology</em>, London: Routledge.</li>\n<li>Edwards, Jeffrey, 2000, <em>Substance, Force, and the Possibility\nof Knowledge</em>, Berkeley, CA: University of California Press.</li>\n<li>Edward, Jeffrey and Martin Schönfeld, 2006, “Kant’s Material\nDynamics and the Field View of Physical Reality”, in Schönfeld\n2006c: 109–123.</li>\n<li>Geier, Manfred, 2003, <em>Kant’s Welt: eine Biographie</em>,\nReinbeck bei Hamburg: Rowohlt.</li>\n<li>Guyer, Paul, 1992, “Introduction: the starry heavens and the\nmoral law” in P. Guyer (ed.), <em>The Cambridge Companion to\nKant</em>, Cambridge, UK: Cambridge University Press.</li>\n<li>Goldman, Avery, 2012, <em> Kant and the Subject of Critique: On\nthe Regulative Role of the Psychological Idea</em>, Indiana University\nPress.</li>\n<li>Hawking, Stephen, 2003, <em>The Theory of Everything: the Origin\nand Fate of the Universe</em>, Beverly Hills: New Millennium.</li>\n<li>Hawking, Stephen and Roger Penrose, 1996, <em>The Nature of Space\nand Time</em>, Princeton, NJ: Princeton University Press.</li>\n<li>Jachmann, Reinhold Bernhard, 1804, <em>Immanuel Kant geschildert\nin Briefen an einen Freund</em>, Königsberg, Nicolovius.</li>\n<li>Kepler, Johannes, 1937, <em>Gesammelte Werke</em>, 19 vols., M.\nCaspar (ed.), Munich: C.H. Beck.</li>\n<li>Krafft, Fritz, 1971,\n“Analogie—Theodizee—Aktualismus. Wissenschaftshistorische\nEinführung in Kants Kosmogonie”, in F. Krafft\n(ed.), <em>I. Kant: Allgemeine Naturgeschichte und Theorie des\nHimmels</em>, Munich: Kindler.</li>\n<li>Kuehn, Manfred, 2001a, <em>Kant: A Biography</em>, Cambridge, UK:\nCambridge University Press.</li>\n<li>–––, 2001b, “Kant’s Teachers in the Exact\nSciences” in E. Watkins (ed.), <em>Kant and the Sciences</em>,\nOxford, UK: Oxford University Press.</li>\n<li>Lasswitz, Kurd, 1902, “Anmerkungen zu <em>Gedanken von der\nwahren Schätzung der lebendigen Kräfte</em>”, in\nKant, <em>Akademie Edition</em>, 1:521–33.</li>\n<li>Laywine, Alison, 1993, <em>Kant’s Early Metaphysics and the\nOrigins of the Critical Philosophy</em> (NAKS Studies in Philosophy\n3), Atascadero, CA. Ridgeview.</li>\n<li>Malter, Rudolf, 1992, <em>Kant in Rede und Gespräch</em>, Hamburg:\nMeiner.</li>\n<li>Newton, Isaac, 1953, <em>Newton’s Philosophy of Nature. Selections\nfrom His Writings</em>, H.S. Thayer (ed.), New York: Hafner.</li>\n<li>–––, 1972 [1726], <em>Philosophiae Naturalis\nPrincipia Mathematica. The third edition with variant readings</em> A.\nKoyré and I.B. Cohen (eds.), 2 vols., Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>–––, 1979 [1730], <em>Opticks, or A Treatise of\nthe Reflections, Refractions, Inflections and Colours of Light</em>,\n4<sup>th</sup> edition. A. Einstein, E. Whittaker, <em>et al.</em>\n(eds.), New York: Dover.</li>\n<li>Paulson, Friedrich, 1902, <em>Immanuel Kant: His Life and\nDoctrine</em>, New York: Scribner’s Sons.</li>\n<li>Pozzo, Ricardo, 1993, “Kant e\nWeitenkampff”, <em>Rivista di storia della filosofia</em>, 48:\n283–322.</li>\n<li>Rahts, Johannes, 1902, “Anmerkungen zur <em>Allgemeinen\nNaturgeschichte und Theorie des Himmels</em>”, in\nKant, <em>Akademie Edition</em>, 1:545–558.</li>\n<li>Rockmore, Tom, 2001, “Introduction” in Tom Rockmore\n(ed.), <em>New Essays on the Precritical Kant</em>, Amherst, NY:\nHumanity Books.</li>\n<li>Robinson, Daniel N., 2012, <em>How is Nature Possible?: Kant’s\nProject in the First Critique</em>, New York: Bloomsbury\nPublishing.</li>\n<li>Schönfeld, Martin, 2000, <em>The Philosophy of the Young Kant: the\nPrecritical Project</em>, Oxford, UK: Oxford University Press.</li>\n<li>–––, 2006a, “Kant’s Early Dynamics”,\nin Bird 2006: 33–46.</li>\n<li>–––, 2006b, “Kant’s Early\nCosmology”, in Bird 2006: 47–62.</li>\n<li>––– (ed.), 2006c, <em>Kant and Confucianism,\nSpecial Issue</em>, <em>Journal of Chinese Philosophy</em>, 33(1):\n1–157.</li>\n<li>–––, 2012, “Introduction to <em>Thoughts\non the True Estimation of Living Forces</em>” in E. Watkins\n(ed.), <em>Immanuel Kant: Natural Science</em> (The Cambridge Edition\nof the Works of Immanuel Kant), Cambridge, UK: Cambridge University\nPress.</li>\n<li>–––, forthcoming, “Georg Bernhard\nBilfinger”, in H. Klemme and M. Kuehn (eds.), <em>Dictionary of\nEighteenth Century German Philosophers</em>, London: Thoemmes.</li>\n<li>Shell, Susan Meld and Richard Velkley (eds.), 2012, <em>Kant’s\nObservations and Remarks: A Critical Guide</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Thompson, Michael L. (ed), 2013, <em>Imagination in Kant’s\nCritical Philosophy</em>, Berlin: DeGruyter.</li>\n<li>Waschkies, Hans-Joachim, 1987, <em>Physik und Physikotheologie des\njungen Kant</em>, Amsterdam: Gruner.</li>\n<li>Wasianski, E.A. Christoph, 1804, <em>Immanuel Kant in seinen\nletzten Lebensjahren</em>, Königsberg: Nicolovius.</li>\n<li>Watkins, Eric (ed.), 2012, <em>Immanuel Kant: Natural Science</em>\n(The Cambridge Edition of the Works of Immanuel Kant), Cambridge, UK:\nCambridge University Press.</li>\n<li>Weinberg, Steven, 1993, <em>Dreams of a Final Theory</em>, London:\nVintage.</li>\n<li>–––, 1999, “A Unified Physics by\n2050?” <em>Scientific American Special</em>, 13:\n36–43.</li>\n<li>Wheeler, John A., 1990, <em>A Journey into Gravity and\nSpacetime</em>, New York: Scientific American Library.</li>\n<li>Wood, Allen W., 2005, <em>Kant</em>, Malden, MA: Blackwell.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aristotle",
            "Aristotle, General Topics: metaphysics",
            "Aristotle, Special Topics: natural philosophy",
            "Daoism",
            "Descartes, René",
            "Hegel, Georg Wilhelm Friedrich: dialectics",
            "Kant, Immanuel",
            "Kant, Immanuel: and Hume on causality",
            "Kant, Immanuel: and Hume on morality",
            "Kant, Immanuel: and Leibniz",
            "Kant, Immanuel: critique of metaphysics",
            "Kant, Immanuel: philosophy of science",
            "Kant, Immanuel: transcendental arguments",
            "Kant, Immanuel: views on space and time",
            "Kepler, Johannes",
            "Leibniz, Gottfried Wilhelm",
            "Mendelssohn, Moses",
            "Newton, Isaac: views on space, time, and motion",
            "space and time: absolute and relational space and motion, post-Newtonian theories",
            "Spinoza, Baruch"
        ],
        "entry_link": [
            {
                "../aristotle/": "Aristotle"
            },
            {
                "../aristotle-metaphysics/": "Aristotle, General Topics: metaphysics"
            },
            {
                "../aristotle-natphil/": "Aristotle, Special Topics: natural philosophy"
            },
            {
                "../daoism/": "Daoism"
            },
            {
                "../descartes/": "Descartes, René"
            },
            {
                "../hegel-dialectics/": "Hegel, Georg Wilhelm Friedrich: dialectics"
            },
            {
                "../kant/": "Kant, Immanuel"
            },
            {
                "../kant-hume-causality/": "Kant, Immanuel: and Hume on causality"
            },
            {
                "../kant-hume-morality/": "Kant, Immanuel: and Hume on morality"
            },
            {
                "../kant-leibniz/": "Kant, Immanuel: and Leibniz"
            },
            {
                "../kant-metaphysics/": "Kant, Immanuel: critique of metaphysics"
            },
            {
                "../kant-science/": "Kant, Immanuel: philosophy of science"
            },
            {
                "../kant-transcendental/": "Kant, Immanuel: transcendental arguments"
            },
            {
                "../kant-spacetime/": "Kant, Immanuel: views on space and time"
            },
            {
                "../kepler/": "Kepler, Johannes"
            },
            {
                "../leibniz/": "Leibniz, Gottfried Wilhelm"
            },
            {
                "../mendelssohn/": "Mendelssohn, Moses"
            },
            {
                "../newton-stm/": "Newton, Isaac: views on space, time, and motion"
            },
            {
                "../spacetime-theories/": "space and time: absolute and relational space and motion, post-Newtonian theories"
            },
            {
                "../spinoza/": "Spinoza, Baruch"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=kant-development\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/kant-development/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=kant-development&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/kant-development/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=kant-development": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/kant-development/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=kant-development&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/kant-development/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://www.philosophie.fb05.uni-mainz.de/forschungsstellen-und-weitere-einrichtungen/fs_kant/\" target=\"other\">Kant-Forschungsstelle Mainz</a>.",
            "<a href=\"http://www.online.uni-marburg.de/kant/webseitn/archiv.htm\" target=\"other\">Marburg Kant-Archiv</a>.",
            "<a href=\"http://www.hkbu.edu.hk/~ppp/Kant.html\" target=\"other\">Kant on the Web</a>, \n maintained by Steve Palmquist."
        ],
        "listed_links": [
            {
                "https://www.philosophie.fb05.uni-mainz.de/forschungsstellen-und-weitere-einrichtungen/fs_kant/": "Kant-Forschungsstelle Mainz"
            },
            {
                "http://www.online.uni-marburg.de/kant/webseitn/archiv.htm": "Marburg Kant-Archiv"
            },
            {
                "http://www.hkbu.edu.hk/~ppp/Kant.html": "Kant on the Web"
            }
        ]
    }
}