{
    "url": "kant-reason",
    "title": "Kant’s Account of Reason",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Garrath Williams\n<g.d.williams@lancaster.ac.uk>",
        "author_links": [
            {
                "https://garrathwilliams.weebly.com/": "Garrath Williams"
            },
            {
                "mailto:g%2ed%2ewilliams%40lancaster%2eac%2euk": "g.d.williams@lancaster.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\n<a href=\"https://garrathwilliams.weebly.com/\" target=\"other\">Garrath Williams</a>\n&lt;<a href=\"mailto:g%2ed%2ewilliams%40lancaster%2eac%2euk\"><em>g<abbr title=\" dot \">.</abbr>d<abbr title=\" dot \">.</abbr>williams<abbr title=\" at \">@</abbr>lancaster<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Sep 12, 2008",
        "substantive revision Wed Jan 4, 2023"
    ],
    "preamble": "\n\nKant’s philosophy focuses on the power and limits of reason. Two\nquestions are central. In his theoretical philosophy, Kant asks\nwhether reasoning can give us metaphysical knowledge. In particular,\ncan reason ground insights that go “beyond”\n(meta) the physical world, as “rationalist”\nphilosophers such as Leibniz and Descartes claimed? In his practical\nphilosophy, Kant asks whether reason can guide action and justify\nmoral principles. “Empiricist” philosophers claimed that\nonly feelings can motivate us to act; reason cannot. In Hume’s\nfamous words: “Reason is wholly inactive, and can never be the\nsource of so active a principle as conscience, or a sense of\nmorals” (Treatise, 3.1.1.11).\n\nAgainst rationalist metaphysics, Kant claims that reasoning faces\nstrict limits. Reason cannot give us knowledge of God or a world\nbeyond the senses; reasoning falls into contradiction and confusion if\nit does not respect these boundaries.\n\nAgainst the empiricist account of motivation and morality, Kant argues\nthat reason has a vital power. Reason enables us to act on principles\nthat we can share with other rational beings. In a world of limits,\nreason reveals human\n freedom.[1]\n\nThis entry has the following structure. The first section sets out the\nrole that reason plays in Kant’s account of knowledge and\nmetaphysics. This focuses on the Critique of Pure Reason or\n“first Critique” (1781, second edition 1787). The\nsecond section examines his moral philosophy. This focuses on his\nCritique of Practical Reason or “second\nCritique” (1788). Reflecting Kant’s own works and\nmost of the secondary literature, these two sections are relatively\nindependent. The third section therefore considers the relations\nbetween theoretical and practical reason. Since Kant rarely discusses\nreason as a whole, his general view is a matter of interpretation:\nOnora O’Neill has given the most prominent account. The\nconcluding remarks stress the philosophical interest of her unified\ninterpretation.\n",
    "toc": [
        {
            "#TheoReasReasCognRoleLimi": "1. Theoretical reason: reason’s cognitive role and limitations"
        },
        {
            "#ReasEmpiTrut": "1.1 Reason and empirical truth"
        },
        {
            "#ReasScie": "1.2 Reason in science"
        },
        {
            "#LimiReas": "1.3 The limits of reason"
        },
        {
            "#ReasSelfKnow": "1.4 Reason’s self-knowledge"
        },
        {
            "#PracReasMoraPrimPurePracReas": "2. Practical reason: morality and the primacy of pure practical reason"
        },
        {
            "#FreeImplMoraConsCateImpe": "2.1 Freedom implies moral constraint: the Categorical Imperative"
        },
        {
            "#MoraConsImplFreeKantFactReas": "2.2 Moral constraint implies freedom: Kant’s “fact of reason”"
        },
        {
            "#PrimPurePracReas": "2.3 The primacy of (pure) practical reason"
        },
        {
            "#UnitTheoPracReas": "3. The unity of theoretical and practical reason"
        },
        {
            "#ReasCommPrin": "3.1 Reason’s “common principle”"
        },
        {
            "#MaxiReas": "3.2 The maxims of reason"
        },
        {
            "#PublUseReas": "3.3 The public use of reason"
        },
        {
            "#ConcRema": "4. Concluding remarks"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimSour": "Primary sources"
        },
        {
            "#SecoLite": "Secondary literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Theoretical reason: reason’s cognitive role and limitations\n\nIn the first half of the Critique of Pure Reason, Kant argues\nthat we obtain substantive knowledge of the world through two\ncapacities: sensibility and understanding. Empirical judgments depend\non both sensory experience and concept formation.\nKant emphasizes the solidity of empirical knowledge gained this\nway.\n\nIn the next large section, Kant discusses “theoretical\nreason”—especially philosophical reasoning. The\n“Transcendental Dialectic” attacks philosophical efforts\nto gain knowledge of a “transcendent” world, that is, a\nworld beyond that revealed by the senses. “Dialectic,”\nsays Kant, is “a logic of illusion” (A293/B349).\nHere, reason appears mainly as a source of empty or false ideas.\n\nMany readers fall away before the final section of the book, where\nKant reviews his overall method—his own use of “pure\nreason.” The closing “Transcendental Doctrine of\nMethod” considers reason in terms of its\n“discipline,” “canon,”\n“architectonic,” and “history.”\n\nThis makes it easy to interpret the Critique of Pure Reason\nas simply critical of reason—as dismissing its claims to give us\nknowledge. But if this were all that Kant intended, how should we\nunderstand his own philosophical reasoning? Kant certainly wants to\nshow the limits of reason. But he also needs to show how reason can\nplay a constructive role. He does this in at least three ways: he\nrelates reason to empirical truth (§1.1\n below); he explores reason’s role in scientific enquiry\n (§1.2\n below); and he explains the benefits of appreciating reason’s\nlimits (§1.3\n below).[2]\n\nIn addition, when we engage in philosophical reasoning, we ought to\nunderstand the capacity that we are using. As Kant puts it, reason\nmust take on “the most difficult of all its tasks, namely, that\nof self-knowledge” (Axi). The first Critique begins\nthis task, but does not complete it (§1.4\n below).\n1.1 Reason and empirical truth\n\nReason has an important role in our pursuit of knowledge. Kant writes:\n“the law of reason to seek unity is necessary, since without it\nwe would have no reason, and without that, no coherent use of the\nunderstanding, and, lacking that, no sufficient mark of empirical\ntruth…”\n (A651/B679).[3]\n Kant says relatively little to develop this claim, and the issue has\nnot attracted much commentary. (But cf. Walker 1989: Ch. 4; Guyer and\nWalker 1990;\n Kant’s theory of judgment,\n §1.3.)[4]\n\nHowever, the basic idea is clear from his text. We form judgments\nabout the world around us all the time. We see a hand in front of us\nand judge it to exist; after a dream, we judge ourselves to have been\ndreaming and the dream’s contents to be illusory; we see the sun\nrise and assume that it orbits the earth. (Obviously this last\njudgment is false: see\n §1.2\n below.) Kant devotes much effort to show how all these judgments rely\non categories. Fundamental concepts such as cause and effect\nstructure all our judgments. A belief that conforms to these\ncategories meets the “formal” conditions of truth.\nHowever, unless we are fundamentally confused about something, all our\nbeliefs meet these\n conditions.[5]\n So how do we decide which of our beliefs are true, and which\nmistaken?\n\nKant begins by noting that only judgments can be mistaken:\n“It is correctly said that the senses do not err; yet not\nbecause they always judge correctly, but because they do not judge at\nall” (A293). For example, there is no error involved in\ndreaming, however incoherent or fantastical the dream may be. But if\nsomeone got confused and supposed that a dreamed-of event had really\nhappened, then she would be making a judgment—a false one. So\nKant claims, “error is only effected through the unnoticed\ninfluence of sensibility on understanding, through which it happens\nthat the subjective grounds of the judgment join with the objective\nones” (A294). In the example, someone confuses a subjective\nground of judgment (“I had this dream”) with an\nobjective one (“these events took place”). As\nKant puts it in the Prolegomena:\n\nThe difference between truth and dream… is not decided through\nthe quality of the representations that are referred to objects, for\nthey are the same in both, but through their connection according to\nrules that determine the combination of representations in the concept\nof an object, and how far they can or cannot stand together in one\nexperience. (4:290)\n\n\nHow does reasoning help here? In the famous “Refutation of\nIdealism” (added to the second edition of the Critique of\nPure Reason), Kant writes: “Whether this or that putative\nexperience is not mere imagination [or dream or delusion, etc.] must\nbe ascertained according to its particular determinations and through\nits coherence with the criteria of all actual experience”\n(B279).\n\nTo see what Kant means, consider a simple example. Suppose that our\ndreamer believes they have won a lottery, but then starts to doubt\nthis belief. To decide whether it is true, they must ask how far such\na belief connects up with their other judgments, and those of other\n people.[6]\n If it fails to connect up (they check the winning numbers, perhaps,\nand find no match with the actual ticket), the dreamer must conclude\nthat the belief was false.\n\nWe can also see the logic here in terms of Kant’s claim that\nreason is “the faculty of the unity of the rules of\nunderstanding under principles” (A302/B359). One fundamental\nprinciple of experience is that we inhabit a single world in space and\ntime. Therefore, all true judgments must find a place within a single,\nunified experience of the world. Reason seeks consistency. It helps\nseparate factual mistakes from genuine knowledge by referring to this\nunifying condition.\n1.2 Reason in science\n\nThe principle of reasoned unity also applies to scientific judgments\nand theories. However, it takes a more complex form, since science\nseeks universal laws.\n\nKant claims that reason is “the origin of certain concepts and\nprinciples” (A299/B355) independent from those of sensibility\nand understanding. Kant refers to these as “transcendental\nideas” (A311/B368) or “ideas of [pure] reason”\n(A669/B697). He also defines reason as a “faculty of\nprinciples” (A299/B356). But what are these concepts and\nprinciples, and can they be justified? Since Kant also argues that\n“ideas of reason” often lead to error and contradiction,\nthese are serious questions.\n\nOne sort of error arises when we claim knowledge of objects beyond\nsensory experience, such as God or the soul. Another sort arises when\nwe form “transcendental ideas.” We may try to\nconceptualize the ultimate basis of everything that exists, such as\nthe universe as a whole. Kant refers to these as “world\nwholes” or cosmological ideas. As discussed in a moment\n (§1.3),\n when we claim objective knowledge about these, we fall into\ncontradictions or “antinomies.” For example, Kant holds\nthat we can argue equally well for the opposing claims: that the\nuniverse has a beginning in time and that it does not.\n\nScientific enquiry assumes that the world forms a well-ordered,\nsystematic unity where all events can be subsumed under causal laws.\nThis is not just the idea that events have causes—an inescapable\nassumption that Kant refers to as a category of the understanding.\nRather, the claim is that universal laws underlie all particular\nrelations of cause and effect. This is what Kant has in mind when he\nspeaks of the “unity of reason” in the first\nCritique. (See e.g. A302/B359, A665/B693, A680/B780.)\n\nAs an illustration, consider Copernicus’s hypothesis that the\nearth orbits the sun. This hypothesis contradicts our everyday\nperceptions—perceptions that we normally rely on without\nquestion. Historically, Galileo’s observations were a turning\npoint. The telescope gave a much more extensive picture of planets and\nstars, casting doubt on our everyday perspective. Although a new\nscientific tool is involved (the telescope), the reasoning is quite\nordinary. In the face of inconsistent appearances, we must decide\nwhich perspective to endorse—just as we may judge that an\nimpression is merely an optical illusion, or a dream is only a\n dream.[7]\n\nFor Kant’s account of scientific reasoning, Newton is more\nimportant (Bxxii n; cf.\n §1.4\n below). Newton’s laws of gravity unify Copernicus’s\nhypothesis and Galileo’s observations—and much more\nbesides (A663/B691). The laws are universal: they extend to all\nheavenly objects, not only the sun’s motion relative to the\nearth.\n\nBut we can never experience all events. However extensive our\nexperiences may be, and however many people’s experiences we\ndraw on, experience is finite. As such, it can never justify the\nprinciple that laws are genuinely universal, or that these laws will\ncontinue to hold in the\n future.[8]\n Kant argues that reason is justified in adopting these principles\n(and others). However, he makes a subtle distinction. These principles\nshould guide scientific inquiry—in Kant’s term, they are\n“regulative.” But they do not provide knowledge\nof the world—as Kant puts it, they are not\n“constitutive.” (See e.g., Buchdahl 1992; Friedman 1992c;\n Kant’s theory of judgment,\n §4.2.)\n\nFor Kant, the categories of the understanding are the paradigm example\nof constitutive ideas. For example, the category of causation\nstructures all our knowledge. We do not perceive cause and effect\ndirectly. Instead, experience is only possible because we\nassume events have causes. (See\n Kant and Hume on causality\n for more detail.) Although we can make mistakes about specific\ncauses, we also have the following knowledge about cause and effect:\nwe know that every event has a cause. The category of cause\nand effect constitutes experience—it enables us to\nexperience the world.\n\nBy contrast, regulative principles govern our investigations, without\noffering any guarantee as to what we will find. Science seeks the\ngreatest possible completeness and systematicity (cf. Guyer 1989 &\n2006, Abela 2006, Mudd 2017). Although scientists often pursue highly\nspecialized inquiries, science also has a regulative goal. It\nmust integrate all findings under the most all-encompassing laws.\nNewton’s laws have been modified by general relativity, for\nexample, pointing to the open-ended, “regulative” nature\nof this quest. Likewise, scientists are still looking for a\nsatisfactory way to integrate general relativity with quantum\n mechanics.[9]\n\nWe cannot know in advance how far science will succeed, or that nature\nis constituted as wholly law-like. This would represent a\n“constitutive principle,” a “cosmological”\nknowledge claim which goes beyond any possible experiences. Instead,\nthe principle of seeking law-like unity represents a\n“maxim” or regulative principle of reason\n(A666/B694). Rather than determining what science must find, such\nprinciples guide scientific practice.\n\nKant’s account of science, and especially the role of\n“teleological” or purposive judgment, is further developed\nin the Critique of the Power of Judgment. See Guyer 1990,\nFreudiger 1996, and Nuzzo 2005, as well as\n Kant’s aesthetics and teleology\n (§3). On Kant’s account of science more generally, see\nWartenberg 1992, Buchdahl 1992, Friedman 1992b & 2013, Mudd 2016\nand Breitenbach 2018. On reason and science, see Neiman 1994: Ch. 2\nand Grier 2001: Ch. 8. The entry on\n Kant’s philosophy of science\n considers Kant’s view of the natural sciences, especially\nphysics.\n1.3 The limits of reason\n\nThis is the best-known point, and is considered in detail in the entry\non\n Kant’s critique of metaphysics.\n Kant demolishes a series of supposed proofs of the existence of God\n(“The Ideal of Pure Reason”) and the soul (“The\nParalogisms”).\n\nHe also demonstrates that it is equally possible to prove some\njudgments about “world wholes” as it is to prove their\nopposites. “The Antinomies” contain arguments that space\nmust be unbounded and that it must be bounded, that there\nmust be an absolutely first cause and that there cannot be\n(the problem of freedom in the famous “Third\nAntinomy”).\n\nThese sections have always been regarded as the most convincing parts\nof the book. Mendelssohn spoke for many of Kant’s contemporaries\nin calling him the “all-destroyer.” These contradictions\nshow the limits of metaphysical knowledge.\n\nKant’s intentions are not destructive, however. Philosophers\nmust understand the capacity that they rely on—that is,\nreason\n (§1.4).\n Theologians and metaphysicians have often claimed knowledge that\nreason cannot deliver. This has led to empty battles that invite\nskepticism about reason. After all, if reasoning leads to inconsistent\nclaims, how can we rely on it? By contrast, Kant aims to clear the\nground: reason has limits but it is not powerless; philosophical\nreasoning can justify some claims. These include the claims\ndiscussed above\n (§1.1\n and\n §1.2)\n as well as reason’s practical role\n (§2\n below). Gava & Willaschek (forthcoming) usefully stress this\naspect of the first Critique.\n\nIn the Doctrine of Method (the last, least-read part of the first\nCritique) Kant refers to the biblical story of Babel\n(Genesis, Ch. 11). The literal meaning of “Babel”\nis “confusion”—God punished human beings’\nattempt to build “a tower that would reach the heavens”\n(A707/B735) by giving them many different languages. Since they were\nunable to understand one another, they could no longer cooperate in\nsuch hubristic\n ventures.[10]\n Again and again, reason returns to some simple ideas with towering\nimplications—the immortal soul, God, freedom. Worse, it cooks\n up[11]\n more or less convincing proofs of these.\n\nSince these ideas reach beyond experience of a shared world, people\nlack a shared way to test them. Perhaps they emptily repeat other\npeople’s words without real understanding; quite possibly, they\ncome up with conflicting versions of these ideas. They talk past one\nanother; they might as well speak different languages. Most likely,\nthey will fall into conflict, or find peace only by submitting to an\nunreasoned authority. In metaphysics, Kant refers to “the\nridiculous despotism of the schools”\n (Bxxxv).[12]\n In practical life, however, despotism is far from ridiculous: it is\nthe brutal last resort for securing order when people adopt\nconflicting ideas and pursue conflicting goals. Kant often alludes to\nHobbes, who holds that peace is only possible if an unaccountable\nsovereign “overawes” every member of\n society.[13]\n On many interpretations, Kantian reason aims to build intersubjective\norder and avoid the dangers of Babel-like hubris, conflict and\ndespotism (Saner 1967, O’Neill 1989, Neiman 1994).\n\nIn the Preface to the second edition of the Critique, Kant\nmakes a famous claim: “I had to deny knowledge in order\nto make room for faith” (Bxxx). Human beings cannot\nhave knowledge of the world as a whole. They cannot know entities that\ntranscend this world, such as the immortal soul or God. We cannot\nexperience these things through our senses; reason cannot supply such\nknowledge. However, Kant argues that knowledge is not the\nprimary end of reason. Only our role within the world\n“necessarily interests everyone” (A839n/B867n). Kant\nrejects a “scholastic” or knowledge-oriented notion of\nphilosophy. Instead, he offers a “cosmic” or\nworld-oriented one (A838/B866; cf. Ypi 2021: Ch. 1 and Ferrarin\n2015).\n\nKant proposes three questions that answer “all the interest of\nmy reason”: “What can I know?” “What must I\ndo?” and “What may I hope?” (A805/B833). We have\nseen his answer to the first question: we can only know the world as\nrevealed through the senses. Kant does not answer the second question\nuntil the Groundwork of the Metaphysics of Morals, four years\nlater. (Arguably, he sees no need to answer the question in this form,\nsince he is confident that people have long known how they ought to\n act.[14])\n But the first Critique does include some observations on\nhope—that is, faith in God and a future world. Kant argues that\nknowledge of these things is not only impossible—it would also\ncorrupt practical reasoning. Rather than doing good for its own sake,\nwe would be motivated by external incentives—eternal punishment\nand heavenly reward. Kant later calls this “heteronomy,”\nas opposed to “autonomy”—our own personal commitment\nto morality. Despite this, Kant argues that we have legitimate reasons\nto hope for God and immortality. We must also have confidence in our\nfreedom to act morally. He connects and develops these claims in the\nsecond Critique, as discussed below\n (§2.3).\n\nSince “reason” is a mental capacity, it may seem strange\nto speak of it having “needs” or “interests.”\nThe basic idea is that there are preconditions for successfully\nexercising this capacity. For finite human beings, reason is not\ntransparent or infallible, as some rationalist philosophers seemed to\nthink. We may think we are reasoning, when actually we are\ncooking up false rationalizations and self-deceptions. We may think we\nare reasoning well, when we argue toward transcendent truths,\nsuch as the existence of God or a future world. So reason has an\n“interest” in appreciating its own limits, if it is to be\nvalid. As Kleingeld puts it, reason “needs to present itself to\nitself in the process of gaining clarity about its own workings”\n(1998a: 97)—above all, the principles that it must give to\nitself. As the next section discusses, this means that Kant views\nreason as essentially self-reflexive.\n1.4 Reason’s self-knowledge\n\nThe first Critique argues that there has, so far, been no\nreal progress in metaphysics. In the second edition Preface, Kant\nproudly proclaims that his book has finally put metaphysics on\n“the sure path of a science” (Bvii; cf. Axiii). So we\nmight ask: what is the relation of metaphysics—or philosophical\nreasoning more generally—to areas of human enquiry that generate\ncertainty (geometry and mathematics) and expand knowledge (science in\ngeneral)?\n\nKant insists that mathematics cannot provide a model for philosophy.\n“Mathematics gives the most resplendent example of pure reason\nhappily expanding itself without assistance from experience”\n(A712/B740). But metaphysics cannot follow this\n course.[15]\n This is not simply a rhetorical point, since many of Kant’s\npredecessors had tried to do exactly this—Spinoza’s\nEthics is one example, Christian Wolff’s philosophy\nanother (see Gava 2018). Kant’s basic argument is that\nmathematicians are justified in constructing objects or\naxioms a priori, because they can work with pure intuitions—like\na line or the form of a triangle, for example—rather than being\nrestricted only to the analysis of concepts. (See the entry on\n Kant’s philosophy of mathematics.)\n Philosophers cannot follow this sort of procedure because they have\nno right to assume any a priori intuitions or axioms about\nmetaphysical entities. Attempts that rely on such claims have only\nproduced “so many houses of cards” (A727/B755).\n\nThe empirical sciences also offer an unpromising model for\nmetaphysics. In the first place, Kant has argued that experience\ncannot reveal metaphysical entities. We could never know, for\ninstance, that we are free: like everything else we can know, human\nconduct is open to causal explanation. Second, experience cannot\ngenerate the sort of necessity Kant associates with metaphysical\nconclusions. Experience reveals contingent facts: it cannot\nshow that such-and-such must be the case. (Kant’s\nposition here is complicated, since he also holds that scientific laws\nhave the metaphysical quality of necessity. Genuine laws are\nuniversal, and not mere generalizations or rules of thumb.\nBut this metaphysical claim requires philosophical\njustification—thus Kant’s short book, Metaphysical\nFoundations of Natural Science (1786). It is not discovered by\ninvestigating the world.)\n\nNone of these points, however, deters Kant from using the imagery\nof science and experiment to describe his own philosophical efforts.\nThese metaphors are especially prominent in the Preface to the second\nedition of the Critique, where he writes:\n\nReason, in order to be taught by nature, must approach nature with its\nprinciples in one hand, according to which the agreement among\nappearances can count as laws, and, in the other hand, the experiment\nthought out in accord with these principles—in order to be\ninstructed by nature not like a pupil, who has recited to him whatever\nthe teacher wants to say, but like an appointed judge who compels\nwitnesses to answer the questions he puts to them. (Bxiii)\n\n\nIn other words, reason, as “[self-]appointed judge,” does\nnot sit by and merely observe whatever comes along. It actively\nproposes principled accounts of the phenomenon it\ninvestigates—that is, law-like hypotheses. Then it\ndevises experiments to confirm or disprove these.\n\nKant sees grounds for optimism in this picture. The natural sciences\ninvestigate the infinite scope of the empirical world. In contrast,\nphilosophy only considers “what reason brings forth entirely out\nof itself… as soon as [its] common principle has been\ndiscovered” (Axx). The Transcendental Dialectic of the first\nCritique offers one application of this idea. Kant insists\nthat there are only three transcendental ideas—the thinking\nsubject (or soul), the world as a whole (the universe, or the entirety\nof time and space), and a being of all beings (that is, God)\n(A334/B391). As such, metaphysics is prone to three fundamental\nmistakes, which spring “from the nature of reason” itself\n(A339/B397; for more detail, see\n Kant’s critique of metaphysics).\n Philosophers have made many efforts to reach these ultimate or\n“unconditioned” objects. But these efforts always fail and\nthey always involve the same basic mistakes.\n\nWhether or not Kant is correct in this, his own picture of\nphilosophical reasoning may seem puzzling. He suggests that reason\nmust conduct an experiment upon itself—an idea that is\nhard to make sense of. In addition, although he talks about\nreason’s “common principle,” he does not explain\nwhat this may be.\n\nKant’s “experiment” may be less puzzling if we\nconsider his hypothesis about everyday knowledge. He makes an analogy\nwith Copernicus’s suggestion that the earth orbits the sun (Bxvi\nf). Only if we take account of the earth’s motion can we\nunderstand what we see in the heavens: we need to appreciate how our\nown (relative, moving) standpoint affects our observations.\nKant’s parallel hypothesis is that our experience depends on the\nstandpoint and capacities of the observer. Our knowledge is not like\nGod’s (albeit more confused and limited), as rationalist\nphilosophers sometimes suggested. Human knowledge has a structure of\nits own, and its own limits too.\n\nThe first main sections of the Critique explain and defend\nKant’s philosophical hypothesis. We must take account of our\nhuman standpoint in order to explain the “a priori\nstructure” of our experience—for example, how it is\nunified in a single order of space and time. The hypothesis is\nsupported partly because the main alternative fails. The\nnon-Copernican or non-Kantian view assumes a “single\nstandpoint.” It does not distinguish between everyday knowledge\nand metaphysical speculation “beyond the bounds of\nexperience” (Bxix). This leads to all sorts of problems. For\nexample, we might suppose that immortal souls could interact with\nmaterial objects and mortal human beings. Kant satirized this view in\nhis earlier book, Dreams of a Spirit-Seer Elucidated by Dreams of\nMetaphysics (1766). His stated target was a religious visionary\ncalled Emanuel Swedenborg. But the subtitle reveals Kant’s\nphilosophical point: metaphysicians have been dreaming, too. They have\nnot appreciated the structure and limitations of the human standpoint.\nSo their arguments have created “an unavoidable conflict of\nreason with itself” (Bxviii n). The “Antinomies”\nmentioned above\n (§1.3)\n explain the basic contradictions that result.\n\nEven if Kant’s arguments succeed, this still leaves awkward\nquestions about philosophical reasoning. Kant is not just concerned\nwith our capacities for everyday knowledge. As the book’s title\nsays, he means to “critique” or examine reason. But\nreasoning is the only means we have to do this. Does it make sense to\nthink of reason as criticizing or justifying itself? Might it even\npoint to something distinctive about our capacity to reason, that it\ncan examine itself in this way?\n\n§3\n below discusses the most thorough reply to these question in the\nliterature, by Onora O’Neill. To anticipate briefly:\nKant’s metaphors—of reason’s experiment upon itself,\nas well as legal metaphors about testimony and\n examination[16]—point\n to a general problem: reason’s self-knowledge (cf. Axi\nf).\n\nKant assumes that we have a capacity to reason and that “to\nphilosophize [is] to exercise the talent of reason…”\n(A838/B866). But since metaphysical reasoning has often gone wrong, he\ncannot merely assert the supremacy of reason. As he exclaims in the\nsecond edition Preface:\n\nhow little cause have we to place trust in our reason if in one of the\nmost important parts of our desire for knowledge it does not merely\nforsake us but even entices us with delusions and in the end betrays\nus! (Bxv)\n\n\nKant’s question, then, is how we might defend reason\nfrom various\n doubts[17]\n and how we might discipline reason without begging\nquestions—for instance, by invoking claims that are themselves\nopen to doubt (cf. O’Neill 1989: Ch. 1, 1992, 2004 & 2015).\nThis is the central task of critique (cf. Bxxxv):\nreason’s examination of itself. This should establish\nreason’s powers and limits. It should give an account of\nreason’s “common principle” and its authority.\n2. Practical reason: morality and the primacy of pure practical reason\n\nThe first Critique only hints at the form of Kant’s\nmoral theory would\n take.[18]\n The account of practical reason in the Groundwork of the\nMetaphysics of Morals (1785) and Critique of Practical\nReason (1788) is radically new. Kant now presents the supreme\nprinciple of practical reason—the Categorical Imperative. It is\nan imperative: it represents a command for human beings, who\nhave needs and inclinations and are not perfectly rational. It is\ncategorical or unconditional: it must always guide our\naction.\n\nKant’s first formulation of this principle runs as follows:\n“act only according to that maxim through which you can at the\nsame time will that it become a universal law” (4:421). (Kant\nalso gives other versions of this Imperative, which he sees as\nequivalent: see\n Kant’s Moral Philosophy,\n §5–§9.) Kant argues that this principle\nis implicit in common human reasoning. Although it requires much\nphilosophical effort to articulate this principle, we rely on it\nwhenever we make moral judgments.\n\nAlongside the Categorical Imperative, Kant also mentions the principle\nof “hypothetical imperatives.” As he puts it,\n“Whoever wills the end also wills (in so far as reason has\ndecisive influence on his actions) the indispensably necessary means\nto it that is in his control” (4:417; cf.\n 5:19f[19]).\n Following Hume, many philosophers hold that practical reasoning is\nessentially instrumental. In this case, practical reason only gives\nconditional or “hypothetical” instructions. These have an\n“if—then” structure. If someone has\nparticular ends or inclinations, then they should adopt\nsuitable means. (This is the idea of\n instrumental rationality;\n see also\n Kant’s moral philosophy,\n §4;\n Kant and Hume on morality,\n §3.)\n\nIn Kant’s view, this is just a matter of consistency. In his\nterms, the principle of hypothetical imperatives is\nanalytic—to pursue an end is to employ\n“the indispensably necessary means” (4:417; cf. Korsgaard\n1997, Newton 2017, Pollok 2017: Ch. 8). Someone who fails to take up\nnecessary means is not, in fact, pursuing that end. At best, they are\nhoping or wishing. At worst, they are involved in a practical\ncontradiction—a sure sign of irrationality. However, they can\novercome this contradiction by abandoning the end. Seen as mere\nconsistency, rationality cannot require more.\n\nBy contrast, the categorical imperative is synthetic (4:420,\n447). It provides an end that every rational agent must\n adopt.[20]\n For Kant, the requirement to adopt universalizable maxims means that\nwe must respect all rational beings as\n“ends-in-themselves” (4:428). For Kant, reason—and\nonly reason—is the source of this unconditional demand.\n2.1 Freedom implies moral constraint: the Categorical Imperative\n\nAlongside the derivation of his supreme moral principle, the most\ndifficult questions about Kant’s view of practical reason center\non its relation to freedom. Although the broad outlines are\nconsistent, Kant’s views on this topic seem to shift more than\nother aspects of his critical thought. (See\n Kant’s moral philosophy,\n §10, for a brief sketch, and Allison 1990 for a full account.)\nThis section and the following\n §2.2\n focus on Kant’s radical claim that “freedom and\nunconditional practical law [that is, the Categorical Imperative]\nreciprocally imply each other” (5:29f). Freedom implies that\npractical reason can be pure (non-instrumental, unconditional), and\nhence that we are subject to the Categorical Imperative. Our\nsubjection to morality implies that we must be free.\n\nKant’s argument that freedom implies the Categorical Imperative\nis brief (see Critique of Practical Reason, 5:19–30).\nIf I am free to step back from my inclinations, those inclinations\ncannot provide a definitive reason to act. Inclinations motivate, but\nthey do not compel. If someone asks me why I did something,\ninclinations may explain my action—the action\nhelped me achieve something I wanted. But there is still an open\nquestion: should I have acted on those inclinations?\n\nAn example may help here. Pushing you out of the way might satisfy my\ndesire to get to the front of the queue. The desire motivates me; we\nmight say that it provides a “reason for me.” For other\npeople, my desire only explains my rudeness. It does not\nsupply others with a reason to endorse my behavior; it does not\njustify my doing this. Compare the entry on\n reasons for action: justification, motivation, explanation:\n “Because I wanted to” may be a “motivating\nreason” for me; it may be an “explanatory reason”\nfor other people. But it is not a “justificatory reason.”\nKant accepts that desires are relevant to practical reasoning. His\nclaim is that they need not, and should not, determine our reasoning.\nSimply put, my inclinations do not matter more than other\npeople’s.\n\nHow can we find reasons that others should also accept? Kant claims\nthe only possibility is to look to “the mere form of\ngiving universal law” (5:27). There is, he says, “only a\nsingle categorical imperative… act only according to that\nmaxim through which you can at the same time will that it become a\nuniversal law” (4:421). This principle is categorical (no\nif-s or but-s!); it is an imperative (we must follow it!).\nWhen our action passes this test, we have done our duty. (In fact, the\nfirst section of the Groundwork argues that this principle\nfollows just by analyzing the idea of duty. For more detailed\ndiscussion see\n Kant’s moral philosophy,\n §2–§5.)\n\nKant’s emphasis on duty may sound old-fashioned; the idea of\njustifying your conduct is more familiar, especially when we think\nabout practical reasoning. However, duty and justification\nare inseparable. To claim that you have done your duty is to hold that\nyour actions are justified. Other people should endorse your\nactions as the right thing to do. If they resent or frustrate your\nactions, they are acting unreasonably—not you.\n\nBut why does Kant think that the “the mere form of\ngiving universal law” can capture the idea of duty, or reveal\nwhat sort of action is justified?\n\nTwo points are central. First, the “form of… law”\nrefers to an overall policy or principle. Without this, my actions\nwould be random and make no sense, even to me. Second, Kant refers to\n“giving universal law.” Not just any policy or principle\nwill do. A justification is meant to provide other people with reasons\nto endorse my conduct—common sense already tells us that many\npolicies won’t do this. In fact, Kant argues that there is only\none. My policy must be to act on principles that everyone else can\nalso adopt. This is what he means by “universal law.”\n\nTo give a better sense of what he means, Kant notes some other\nprinciples that seem law-like, but go beyond the “mere\nform of universal law”—and thereby fail to be justifiable.\nIn the second Critique (5:39ff), he discusses six such\ncandidates. Here is one example to illustrate.\n\nKant sees Epicurus as advocating the following policy: always follow\nyour inclinations, wherever they might lead. This might sound\nlaw-like—it directs action, just as ordinary laws tell you to\npay your taxes or drive on the left. It may even sound like a law that\na free agent could adopt. While it deprives you of the freedom to act\nin ways you don’t want, it preserves something that\nsounds much more worthwhile: the freedom to do whatever you\ndo want. However, it goes beyond the “form of\nlaw” because it tells you to submit to merely subjective\nfactors—your inclinations, whatever they may be. This raises two\nproblems.\n\nFirst, the policy is not actually law-like in practice—my\ninclinations change and conflict with one another. For example,\nshort-term inclinations often undermine longer-term ones; often\nit’s impossible to get everything we wish for. This isn’t\nso much freedom, more a recipe for confusion. To act coherently, I\nneed to discipline and rank my inclinations. In other words, my will\nwould contradict itself if I tried only to follow inclinations. I\nwould not really have a will—in Kant’s terms, there is a\ncontradiction in even conceiving this policy.\n\nSecond, it is not a policy that everyone can follow. If they did, the\nresults would be utterly chaotic; they would defeat anyone’s\nattempts to satisfy their inclinations. In Kant’s terms, there\nis a contradiction in willing such a policy. So far as we can\neven imagine this, we see straightaway that each person’s\nwilling would predictably fail.\n (Kant’s moral philosophy,\n §5, explores these two contradictions, in conception and in\nwilling.)\n\nIn more abstract terms: such a policy is unreasonable because it gives\nauthority to particular features of one particular agent—worse,\nto features that aren’t even stable or mutually consistent. In\nKant’s words:\n\nit is requisite to reason’s lawgiving that it should need to\npresuppose only itself, because a rule is objectively and\nuniversally valid only when it holds without the contingent,\nsubjective conditions that distinguish one rational being from\nanother. (5:21)\n\n\nNo principle is truly law-like unless it abstracts from an\nagent’s particular motivations and situation. Every other\npossibility looks for substantive guidance from outside of reason\nitself—just as a hypothetical imperative only guides you\nif you already want to pursue that end. Kant refers to this\nbasic difficulty as heteronomy—that is, reasoning\ndirected from the outside. This external authority might be my\ninclinations, or religious dogma, or even a political authority. But\nit is merely assumed or imposed; it cannot justify itself.\nHeteronomous reasoning does not address the fundamental problem: to\nfind principles that are entitled to guide everyone’s acting and\nthinking. In the word Kant has made so famous, reasoning must be\nautonomous—that is, self-governed.\n\nThere have been many doubts whether the mere “form of law”\ncan really provide concrete guidance. In reply, Kantians argue that it\nrepresents a substantial constraint: we must avoid all ways of\nthinking and acting that cannot be followed by all. (For discussion\nsee inter alia O’Neill 1989: Ch. 5; Herman 1993;\nAllison 1990: Ch. 10 §II.) If this is true, then the autonomy of\nreason reveals the positive sense of freedom at the heart of\nKant’s practical philosophy (cf. Brandom 1979). That is, reason\nenables us to act in ways that do not rely on\n“contingent, subjective conditions that distinguish one rational\nbeing from another” (5:21). It enables us to justify our conduct\nto one another. It empowers us to build communities around principles\nthat everyone can share.\n2.2 Moral constraint implies freedom: Kant’s “fact of reason”\n\nAs well as claiming that freedom implies the Categorical Imperative,\nKant claims that moral obligation implies freedom.\n\nKant insists that “nothing in appearances can be explained by\nthe concept of freedom” (5:30). Morality, he claims,\n“exists in the sensible world [the world as known through the\nsenses and by science] but without infringing on its laws”\n(5:43). Every action counts as an event in the world of everyday\nobjects (or “appearances,” in Kant’s terminology).\nWe must take every event to be caused—in terms of everyday\nexplanations as well as in sciences such as physics and neuroscience.\nConsidered as events in the objective world, human actions do\nnot provide us with a warrant for freedom.\n\nInstead, it is to our consciousness or subjectivity that Kant\nturns:\n\nAsk [someone] whether, if his prince demanded, on pain of…\nimmediate execution, that he give false testimony against an honorable\nman who the prince would like to destroy under a plausible pretext, he\nwould consider it possible to overcome his love of life… He\nwould perhaps not venture to assert whether he would do it or not, but\nhe must admit without hesitation that it would be possible for him. He\njudges, therefore, that he can do something because he is aware that\nhe ought to do it and cognizes freedom within him, which, without the\nmoral law, would have remained unknown to him. (5:30; cf. 5:155f)\n\n\nAs Kant also says, “the moral law, and with it practical reason,\n[have] come in and forced this concept [freedom] upon us”\n(5:30). In the next section, Kant refers to this as a “fact of\nreason”: “Consciousness of this fundamental law may be\ncalled a fact of reason because one cannot reason it out from\nantecedent data of reason” (5:31; cf. 5: 6, 42f, 47, 55, 91,\n104).\n\nThis “fact” has caused considerable controversy, for\nseveral reasons. Kant is not altogether clear about what he takes this\nfact to demonstrate. He has argued that facts about human beings\ncannot provide the basis for morality—morality must be given a\npriori, that is, independently of experience. Further, Kant speaks of\n“cognizing the moral law.” But he is well aware that his\nown account of this “law” is quite new. Not least, this\n“fact, as it were” does not feature in his earlier\ntreatise, the Groundwork, and does not appear again.\n\nOne school of thought—which includes many influential Kant\nscholars, and is sympathetically represented in Allison 1990 (Chs. 12\nand 13)—sees a fundamental change in Kant’s thought here.\nPart III of the Groundwork seems to give a\n“deduction” (justification) of freedom. But in the second\nCritique Kant realizes that his own premises do not allow\nsuch an argument. So he stops argument short by appealing to a\nsupposedly indubitable fact.\n\nOther commentators emphasize the clear continuities between the two\nbooks. In particular, Kant relies on common moral consciousness in\nboth. Łuków 1993 emphasizes the parallel between\nAchtung (“respect” or “reverence” for\nmorality) and the fact of reason. Kant refers to respect in all his\nethical writings: it is the only feeling “self-wrought\nby a rational concept [= the moral law]” (4:401n). As such, it\nclearly resembles what he now calls “the sole fact of pure\nreason” (5:31). (See also O’Neill 2002 and Timmermann\n2010.) Moreover, Kant uses the Latin word factum. Arguably,\nthis is better translated as deed rather than fact. In other\nwords, Kant points to an act of reason as well as the\nfact that it creates (Kleingeld 2010).\n\nIn any case, Kant’s line of thought in the long passage quoted\nabove is fairly clear: We all (most of us) recognize that there are\nsituations where we ought to do something, even though it will cost us\ndearly. In other words, we feel that we are subject to an\nunconditional moral imperative. When we acknowledge this\n“ought,” we show our belief in the possibility of acting\non it. This shows us to be free—not merely in the negative sense\nthat we could go against our inclinations, but also in the positive\nsense that we can do our duty (4:446). Only our moral awareness\nreveals this freedom.\n\nClearly, this line of thought is not immune to criticism. For example,\nour feeling of moral constraint might be explained in terms of a\nFreudian super-ego. But it shows why Kant thought that moral\nawareness—unlike any other sort of experience—gives us a\npractical certainty of our freedom. While this is not knowledge in the\nempirical or scientific sense, it provides a basis for practical\nreasoning: “a fact [Faktum] in which pure reason in us\nproves itself actually practical” (5:42). And if Kant is right\nthat only the Categorical Imperative reveals our capacity to act in\nways that we can justify to others, then we can see why he claims,\n“freedom and unconditional practical law reciprocally imply each\nother” (5:29f).\n2.3 The primacy of (pure) practical reason\n\nKant does not give a complete account of the relation between\npractical reason and theoretical reason. However, the second\nCritique does include an important section, “On the\nprimacy of pure practical reason in its connection with speculative\nreason” (5:119–121). (See Gardner 2006 and Willaschek\n2010.)\n\nWe have already seen two reasons why Kant must give some priority to\n“pure practical reason.” First, assume that Kant is\ncorrect—against rationalist philosophers—that theoretical\nreason cannot have insight into the supersensible. This means that\nreason cannot have access to any transcendent authority (such as God\non many traditional conceptions) that might command thought or\naction.\n\nSecond, Kant says that practical reason can either be\n“pure”—i.e., “proceed from a priori\nprinciples”—or it can proceed “from empirical\ndetermining grounds” (5:90). Desires and inclinations are\nempirical, for Kant. Reasoning that helps us fulfill them is\n“hypothetical”—it applies only if you have those\ndesires. For Kant, merely following your desires represents\n“heteronomy,” especially when they conflict with morality.\nOn this view, reason is just an instrument to help you\nfulfill your desires. As Hume put it, in an especially horrible\nmetaphor, reason would be “the slave of the passions”\n(Treatise, 2.3.3.4). It cannot issue its own\n commands.[21]\n\nThese two points suggest that neither theoretical nor instrumental\nreasoning can supply authoritative reasons for action. If there are\nsuch reasons—as Kant’s “fact of reason”\nsupposes—then only pure practical reason can supply\nthem.\n\nNow, however, Kant makes a stronger claim. He argues that pure\npractical reason has “primacy” even on the home territory\nof theoretical reason. That is, pure practical reason should guide\nsome of our beliefs, as well as our actions.\n\nKant defines primacy as “the prerogative of the interest of one\ninsofar as the interests of others is subordinated to it”\n(5:119). He gives at least three considerations to support this\n“prerogative” of practical\n reason.[22]\n\nOne point just reflects Kant’s talk of reason’s\n“interests.” “[A]ll interest,” says Kant,\n“is ultimately practical and even that of speculative reason is\nonly conditional and is complete in practical use alone”\n(5:121). In this sense, to accept the metaphor of\n“interests” is to see reasoning as ultimately practical.\n(Cf. Kant’s notion of philosophy as “world-oriented”\nrather than\n “scholastic”—§1.3\n above. See also Neiman 1994: Ch. 3; Kleingeld 1998a; Rauscher\n1998.)\n\nSecond, practical reason can be “pure” or independent from\n“pathological conditions,” that is, our inclinations. As\njust noted, Kant holds that practical reason can be “pure”\nor “a priori.” That is, it need not be governed by\nour inclinations. By contrast, theoretical reason goes wrong when\nit seeks knowledge by itself—for example, in merely\n“speculative” proofs that God exists. Theoretical\nreasoning can only gain knowledge through sensibility and\nunderstanding. Practical reason is independent in a way that\ntheoretical reasoning can never be.\n\nA third line of thought is less abstract, and rests on the specific\ninterests that Kant attributes to these two forms of reasoning. When\ntheir interests conflict, we must decide which are to come first.\n\nThe “interest” of theoretical reason consists in expanding\nour knowledge and avoiding error. As Kant has argued, reason can help\nbroaden scientific knowledge, but it cannot justify speculative\nmetaphysical claims. However, practical reason has a conflicting\ninterest—in beliefs that lie beyond the bounds of knowledge.\nKant writes:\n\nBut if pure reason of itself can be and really is practical, as the\nconsciousness of the moral law proves it to be [cf.\n §2.2\n on the “fact of reason”], it is still only one and the\nsame reason which, whether from a theoretical or a practical\nperspective, judges according to a priori principles; it is then clear\nthat, even if from the first [theoretical] perspective its capacity\ndoes not extend to establishing certain propositions affirmatively,\nalthough they do not contradict it, as soon as these same\npropositions belong inseparably to the practical interest of pure\nreason[, then theoretical reason] must accept them. (5:121)\n\n\nIn other words, even if it is finally “one and the same\nreason,” reason seems divided. Used practically, reason has an\ninterest in “certain propositions”—specifically, the\nreality of freedom, immortality and God. But theoretical reasoning\nsays these cannot be proven. The practical interest has greater\nweight, because it is rooted in morality.\n\nHere, Kant introduces the idea of a “postulate.” This is\n“a theoretical proposition, though one not demonstrable\nas such, insofar as it is attached inseparably to an a priori\nunconditionally valid practical law” (5:122). For Kant,\nthere is only one unconditional law: the Categorical Imperative or\n“moral law.” He claims that three postulates are\n“attached” to it: “immortality, freedom considered\npositively (as the causality of a being insofar as it belongs to the\nintelligible world), and the existence of God” (5:132).\n\nFreedom has a special status—as discussed in\n §2.2,\n the second Critique’s “fact of reason” is\nmeant to establish this. But why does he think we must\n“postulate” God and\n immortality?[23]\n (See also the entry on\n Kant’s philosophy of religion.)\n\nAs we have seen, Kant holds that we should act out of\n“respect” for morality—for the sake of duty.\nMorality must have priority over my inclinations. (Remember:\ninclinations can motivate and explain actions, but\nthey are not enough to justify action.) This means\nthat there is no guarantee that acting well will lead to my own\nhappiness, or even other people’s. This creates a\nconflict—in Kant’s terms, a\n“dialectic”—between happiness and morality. While\nmorality is the only unconditional good for human beings,\nKant does not deny that happiness is important. It is the natural and\nnecessary end of every human being (cf. 4:415); duty requires us to\nmake others’ happiness our\n end.[24]\n\nKant expresses the combined importance of morality and happiness as\n“the highest\n good”:[25]\n\nvirtue (as worthiness to be happy) is the supreme\ncondition of whatever can even seem to us desirable and hence of\nall our pursuit of happiness… and is therefore the\nsupreme good. But it is not the whole and complete good for\nfinite rational beings; for this, happiness is also required,\nand that not merely in the partial eyes of a person who makes himself\nan end, but even in the judgment of an impartial reason [in other\nwords, this is not about my subjective wish to be happy, but rather an\nobjective judgment that happiness is the natural end for human beings,\njust as goodness is our moral end—GW]… happiness\ndistributed in exact proportion to morality (as the worth of a person\nand his worthiness to be happy) constitutes the highest good\nof a possible world. (5:110)\n\n\nThe argument here is bold but dubious. We must think of moral activity\nas resulting in happiness. Yet human agency cannot achieve this:\n“I [or even all of us acting together—GW] cannot hope to\nproduce this [highest good] except by the harmony of my will with that\nof a holy and beneficent author of the world” (5:129). So, Kant\nargues, we must “postulate” that God exists. We must also\npostulate immortality. Only this enables us to hope that we will\nfinally come close to virtue, hence become worthy of happiness.\n3. The unity of theoretical and practical reason\n\nWe have seen one link between theoretical and practical reason. In\nanswer to the question, “What may I hope?” Kant claims\nthat practical reason has “primacy.” Theoretical reason\nmay accept the postulates of God, freedom and immortality “as a\nforeign possession handed over to it” (5:120). Theoretical\nreason can only show that these things are not impossible. Our\npractical interests—at root, our moral obligations—demand\nthat we believe in them. To cite Kant’s famous words again:\n“I had to deny knowledge in order to make room for\nfaith” (Bxxx).\n\nKant’s arguments for freedom are more extensive and compelling.\nHis arguments for God and immortality find little favor among\ncontemporary authors. Perhaps the strongest support comes from Jens\nTimmermann, who claims: “the principle that unifies the spheres\nof theoretical and practical reason… is the assumption of a\nwise and benevolent God who has created a teleological world that\ncoheres with morality” (2009: 197). (On teleology in the\nCritique of the Power of Judgment, see Guyer 1989, Freudiger\n1996;\n Kant’s aesthetics and teleology,\n §3. Outside that work, see also Wood 1970, Kleingeld 1998b.)\n\nEven if Kant did believe this—in his weaker moments,\n perhaps[26]—such\n a position lacks wider philosophical resonance. Most contemporary\nphilosophers assume that the world does not “harmonize\nwith” morality in this way—or at any rate, that it is a\nhuman task to foster such harmony, for example, by building decent\nsocieties and just institutions. Reath 1988 argues that Kant sometimes\ndeploys a more defensible, “secular” or this-worldly,\nnotion of the highest good. Kleingeld 1995 and Guyer 2000a & 2000b\nalso offer interesting discussions.\n\nOnora O’Neill has made the leading attempt to uncover the unity\nof Kantian reason and to relate it to contemporary philosophical\nconcerns (1989 and subsequent essays). This section will focus on her\ncentral claim concerning the unifying role of the Categorical\nImperative, and the main bases for this claim in Kant’s texts.\nO’Neill’s interpretation of Kantian reason enjoys\nconsiderable respect among Kant scholars, although there are\nrelatively few critical responses to her work. Engstrom 1992 and Wood\n1992 offer early reviews; Westphal 2011 and Cohen 2014, 2018 take up\nher account, as does Bagnoli 2022: Ch. 4; see further\n constructivism in metaethics,\n §2 (especially\n §2.3).[27]\n3.1 Reason’s “common principle”\n\nIn the original Preface to the first Critique, Kant suggested\nthat reason has a “common principle”: “Nothing here\ncan escape us, because what reason brings forth entirely out of itself\ncannot be hidden, but is brought to light by reason itself as soon as\nreason’s common principle (gemeinschaftliches Prinzip)\nhas been discovered” (Axx). Unfortunately, neither edition of\nthe Critique considers what this principle might be.\n\nKant also raises this principle in his works on practical reason,\nwithout giving a clear account. In the Preface to the\nGroundwork, Kant explains why the book is not entitled a\nCritique of Pure Practical Reason:\n\n[A critique of pure practical reason] is not of such utmost necessity\nas [a critique of pure theoretical reason], since human reason, even\nin the commonest understanding, can easily be brought to a high\nmeasure of correctness and accuracy in moral matters, whereas in its\ntheoretical but pure use it is totally and entirely dialectical [i.e.,\na source of illusion]… I require that the critique of a pure\npractical reason, if it is to be complete, also be able to present its\nunity with speculative reason in a common principle; because in the\nend there can be only one and the same reason, which must differ\nmerely in its application. (4:391)\n\n\nIn the second Critique, Kant compares the book’s\nstructure with the first Critique and comments: “such\ncomparisons [are] gratifying; for they rightly occasion the\nexpectation of being able some day to attain insight into the unity of\nthe whole rational faculty (theoretical as well as practical) and to\nderive everything from one principle—the undeniable need of\nhuman reason, which finds complete satisfaction only in a complete\nsystematic unity of its cognitions” (5:91). Kant’s tone is\nconfident. But once again, he has postponed an account of “the\nunity of the whole rational faculty.” (Prauss 1981 argues that\nKant failed to achieve this insight, in part because he did not\nappreciate how cognitive success is a fundamentally practical goal.\nFörster 1992 discusses Kant’s reflections on this topic in\nhis final manuscript, the Opus Postumum.)\n\nHowever, as Onora O’Neill points out in a celebrated essay\n(1989: Ch. 1), Kant’s claims about practical reason imply a\nfurther claim about reason’s “common principle.”\nKant has argued that the Categorical Imperative is the supreme\nprinciple of practical reason. He has also argued that practical\nreason has primacy over theoretical reason. It follows, therefore,\nthat the Categorical Imperative is the supreme principle of\nreason.\n\nTo be sure, Kant never states this conclusion explicitly. But there\nare reasons for thinking that this ought to have been his view, and in\nsome places he comes very close to this\n claim.[28]\n\nThe clearest passage is a footnote (!) in Kant’s essay,\n“What is it to Orient Oneself in Thinking?” (1786):\n\nTo make use of one’s own reason means no more than to ask\noneself, whenever one is supposed to assume something, whether one\ncould find it feasible to make the ground or the rule on which one\nassumes it into a universal principle for the use of reason. (8:146n)\n\n\nThis bears an obvious parallel with the first formulation of the\nCategorical Imperative—“act only according to that maxim\nthrough which you can at the same time will that it become a universal\nlaw” (4:421). Kant now says: think only in accordance\nwith that maxim that could be a universal\n law.[29]\n\nTo rephrase the point: Thinking and judging are activities. If the\nCategorical Imperative is truly “categorical” then it\napplies to all our activities—“theoretical”\nas well as “practical.”\n\nOther strands of Kant’s thought support this interpretation. The\nmost important are his “maxims of reason” and his account\nof the “public use of reason.”\n3.2 The maxims of reason\n\nKant sets out three “maxims of reason” or “maxims of\ncommon human understanding.” They appear twice in his published\nwritings, in relation to both acting and\n thinking.[30]\n These maxims are closely related to the Categorical Imperative. (For\ndiscussion, see O’Neill 1989: Ch. 2 & 1992, and Neiman 1994:\nCh. 5.)\n\nIn his last published work, the Anthropology (1798), Kant\npresents the maxims in a practical context, as guidelines for\nachieving some degree of wisdom:\n\nWisdom, as the idea of a practical use of reason that\nconforms perfectly with the law, is no doubt too much to demand of\nhuman beings. But also, not even the slightest degree of wisdom can be\npoured into a man by others; rather he must bring it forth from\nhimself. The precept for reaching it contains three leading maxims:\n(1) Think for oneself, (2) Think into the place of the other [person]\n(in communication with human beings), (3) Always think consistently\nwith oneself. (7:200; cf. 228f)\n\n\nThe maxims also appear in the Critique of the Power of\nJudgment (1790). Here, Kant relates them to the\ntheoretical use of reason. A famous section describes human\nbeings’ capacity for a sensus communis or\n“community sense”:\n\na faculty for judging that… takes account (a priori) of\neveryone else’s way of representing in thought, in order as\nit were to hold its judgment up to human reason as a whole and\nthereby avoid the illusion which, from subjective private conditions\nthat could easily be held to be objective, would have a detrimental\ninfluence on the judgment. (5:293)\n\n\nThat is, the maxims are precepts for judging in accordance with\n“reason as a whole” and avoiding the distortions that\narise from “subjective private conditions.”\n\nKant describes (1) thinking for oneself as the maxim of\nunprejudiced thought; its opposite is passivity in thought,\nleading to prejudice and superstition. Kant also labels this\n“heteronomy,” clearly recalling his interpretation of\nreason and morality in terms of autonomy\n (4:433).[31]\n (2) To think in the place of everyone else is the maxim of\nenlarged or broad-minded thought. And (3) always to\nthink in accord with oneself is the maxim of consistent\nthought (5:294).\n\nThe last maxim may sound more straightforward, but Kant emphasizes its\ndifficulty. Consistency “can only be achieved through the\ncombination of the first two and after frequent observance of them has\nmade them automatic” (5:295). Consistency does not just involve\ngetting rid of obvious contradictions in explicit beliefs. It also\nrequires consistency with regard to the implications of our\nbeliefs—and these are often not apparent to us. To achieve this\nsort of law-likeness in thought requires genuine attempts (1)\nto judge for oneself and the determination (2) to expose one’s\njudgments to the scrutiny of others. In other words, a person must try\nto make themselves: (1) really the author of their judgments;\n(2) accountable to others; and (3) consistent in\ntheir claims. We must take responsibility for our\njudgments.\n\nThe maxims support the thesis that theoretical and practical reasoning\nhave a unified structure. In particular, they flesh out the\nimplications of the Categorical Imperative. The imperative demands\nrespect for “the mere form of law”—consistency,\nlaw-likeness, and autonomy in thought and action. Equally, it demands\nrespect for other people as fellow reasoners and\n“ends-in-themselves” (Russell 2020, Lenczewska 2021). As a\nmatter of thought, reasoning requires us to discipline our judgments\nso that others can follow them. As a matter of practical wisdom,\nreasoning requires us to discipline our actions so that others can\nadopt the same guiding principles.\n3.3 The public use of reason\n\nAnyone concerned with Kantian reason and politics must consider his\nfamous essay, “What is Enlightenment?” (1784). Among many\ndiscussions, see O’Neill 1989: Ch. 2, 1990 & 2015: Ch. 3;\nVelkley 1989; Deligiorgi 2005; Patrone 2008.\n\nAs we have seen, Kant’s first maxim of reason is to think for\noneself. He says this is the way to achieve “liberation from\nsuperstition,” and equates this with “enlightenment”\n(5:294). His second maxim asks us to “think into the place of\nothers.” Communication is essential for this. As he writes:\n“…how much and how correctly would we think if we did not\ncommunicate with others to whom we communicate our thoughts, and who\ncommunicate theirs with\n us!”[32]\n\nIn “What is Enlightenment?” Kant places both maxims in a\npolitical context. He demands that we “have the courage to use\nour own reason”:\n\nEnlightenment is the human being’s emergence from his\nself-incurred immaturity. Immaturity is the inability to use\none’s own understanding [=\n reason[33]]\n without the guidance of another. This immaturity is\nself-incurred if its cause is not lack of understanding, but\nlack of resolution and courage to use it without the guidance of\nanother. Sapere aude! [Dare to be wise!] Have courage to make\nuse of your own understanding [= reason]! is thus the motto\nof enlightenment. (8:35)\n\n\nKant’s main concern is not with individuals, however.\nEnlightenment is a collective endeavor. It therefore has cultural and\npolitical aspects. For enlightenment, Kant says, “nothing is\nrequired but… the least harmful… freedom: namely,\nfreedom to make public use of one’s reason in all\nmatters” (8:36).\n\nThis “least harmful freedom” is not the freedom to act\npolitically. It is not even freedom of speech in the now-familiar\nsense that covers many forms of personal expression. Instead, it is\nthe freedom to reason “as a scholar before the entire\npublic of the world of readers” (8:37).\n\nAs we might expect, Kant contrasts public reasoning with private\nreasoning. However, the distinction has an unfamiliar meaning. For\nKant, employees reason privately. He mentions civil servants, military\nofficers, or clerics in an established church. In contemporary terms,\nthese are all more or less “public” roles. However, these\nemployees are bound by the policies, procedures and dictates of their\norganization. They reason about how to act—but only to judge the\nbest way of fulfilling tasks laid down by their employers.\n\nWe can draw a parallel with an individual who reasons\ninstrumentally—about the best way to satisfy their inclinations,\nfor example. Instrumental reason decides the best means to achieve\npre-given ends. In Kant’s terms, it is\nheteronomous—directed by a source outside reason itself.\n\nSimilarly, these employees are directed by state or church. Their\noffices may be “public,” but their reasoning is\nprivate—deprived of full publicity. The employee\n“carries out another’s commission” (8:38). His\nreasoning is not free: it is “impermissible to argue; instead,\none must obey” (8:37). The employee does not abandon his own\nmoral judgment—Kant is careful to add that he must resign if he\ncould not “in conscience [continue to] hold his office”\n(8:38). But within that office, he acts as a “passive\nmember” (8:37) of the commonwealth.\n\nBy contrast, the public use of reason is active and autonomous. It\ndoes not follow directions; it is accountable to all. When a person\nreasons publicly, he thinks for himself and speaks as a member of\n“the society of citizens of the world” (8:37). Outside of\nhis post, an employee may reason freely, and may even criticize\ngovernment policies or religious teachings.\n\nThe same applies to the ordinary citizen. He must obey—for\nexample, by paying taxes—and may not speak in a way that\nencourages others to disobey. But he “does not act against the\nduty of a citizen when, as a scholar, he publicly expresses his\nthoughts about the inappropriateness or even injustice of\n[governmental] decrees” (8:38).\n\nThis creates a stark contrast between roles: the obedient citizen or\nemployee, as opposed to the “scholar” who makes\n“public use of reason.” But Kant sees no inconsistency.\nPeaceful co-existence requires that citizens do not undermine, let\nalone rebel against, existing governments—that risks chaos and\neven civil war. In Kant’s words, “morally practical reason\npronounces [an] irresistible veto: there is to be no\nwar” (6:354). As citizens of a given state, we must act as\npolitical institutions demand. As citizens of the world, however, we\nmay criticize those demands and advocate\n reform.[34]\n\nKant’s views invite criticism. In his day, only a few citizens\ncould read and publish their views; hardly any women could. So his\nposition may seem elitist and sexist. It implies a gulf between theory\nand practice—between what employees and citizens may believe\nought to be done, and what they must do (“obey”!).\n“The least harmful freedom” may seem not just harmless but\npowerless. Freedom to publish is only a small part of the freedoms\nessential to modern democracy. Hence Kant’s views may seem\nantiquated. Certainly, they fall far short of democratic citizenship\nas we understand it.\n Kant’s social and political philosophy\n (§4 and §6) discusses these issues.\n\nFor this entry, the key point is this. Kant equates reason with full\npublicity. “To use one’s own reason” is to make a\nsincere attempt to address all “citizens of the\nworld.” Judgments and principles are only reasonable to\nthe extent that they can be accepted by all. Our actions must respect\nexisting boundaries and governments, because the duty to pursue and\nmaintain peace is categorical. But reason itself aspires to\nuniversality. So as citizens of the world, we have another categorical\nduty: to see ourselves as accountable to every human being, and hence\nto improve existing institutions so that they recognize the claims of\nall. For reasoning to be fully public, citizens and\nnon-citizens, rulers and ruled must discuss as equals—despite\ntheir inequalities in practice.\n\nA famous passage from the Critique of Pure Reason expresses\nthis idea, linking reason, critique, and autonomy:\n\nReason must subject itself to critique in all its undertakings, and\ncannot restrict the freedom of critique through any prohibition\nwithout damaging itself and drawing upon itself a disadvantageous\nsuspicion. For there is nothing so important because of its utility,\nnothing so holy, that it may be exempted from this searching review\nand inspection, which knows no respect for persons [i.e. no person\nbears more authority than any other—GW]. On this freedom rests\nthe very existence of reason, which has no dictatorial authority, but\nwhose claim is never anything more than the agreement of free\ncitizens, each of whom must be able to express his reservations,\nindeed even his veto, without holding back. (A738f/B766f, translation\nmodified)\n\n\nIn the term used by several contemporary Kantians, this procedure\nconstitutes reason. (See Herman 2007: Ch. 10, Korsgaard 2008,\nReath 2013, Bagnoli 2017; Møller 2020 focuses on Kant’s\nlegal metaphors.) Reason is the only unconditional (that is,\nnon-heteronomous) authority for thinking and acting.\n4. Concluding remarks\n\nNo one doubts that belief and action are subject to demands of\nrationality. Theoretical reasoning aims at knowledge of the world\naround us (perhaps also knowledge of ourselves). Practical reasoning\naims to make a difference in the world (perhaps also a difference in\nourselves).\n\nThis distinction hides a larger question: what is reason,\n exactly?[35]\n Rationality clearly involves the capacity to make logical and causal\ninferences: to draw out the consequences of our beliefs; to judge what\nconsequences are likely to follow from different possibilities for\naction. Rationality clearly requires consistency. Our beliefs should\nnot contradict one another, or have contradictory implications. We\nshould use means that support our goals, rather than defeat them. We\nshould avoid contradictory\n goals.[36]\n Beyond this, however, it is not obvious that “reason” is\na unitary capacity or that “rationality” is a unitary\nrequirement. If truth seems self-evident as a criterion of thinking,\nthe criteria for rational action are much harder to make out.\n\nIf we accept the basic lesson of the first Critique, it is\neven harder to discern the criteria of rational action. Against\nrationalist philosophers, Kant argues that theoretical reason cannot\ndiscover realities beyond empirical experience. (Recall the literal\nmeaning of metaphysics: beyond the physical world.) So we\ncannot know any sort of moral authority, be it God or revelation, that\ntells us how to think and act. Traditionally, truth and goodness stood\ntogether. Mendelssohn called Kant the “all-destroyer”\npartly because his critique undercut this traditional pairing.\nExperience can disclose (empirical) truth, but not goodness.\n\nPerhaps, then, we can only reason practically in order to satisfy\npre-existing feelings or goals. These factors can motivate us to\nreasoning, but they are not themselves open to rational justification.\nHume’s empiricist account of morality illustrates the point.\nReason is “the slave of the passions.” We can only hope\nthat our fellow human beings feel sympathy, and will put reason to\nwork in its cause. Although we may disapprove, we cannot say it is\nirrational to feel or pursue more anti-social\n“passions” such as spite or envy or pride. In Hume’s\nown words, “’Tis not contrary to reason to prefer the\ndestruction of the whole world to the scratching of my finger…\n’Tis as little contrary to reason to prefer even my own\nacknowledg’d lesser good to my greater…”\n(Treatise 2.3.3.6).\n\nSince Kant has cut off (theoretical) knowledge of goodness,\ndoesn’t consistency drive him to similar skepticism? Since his\naccount is structured by a distinction between theoretical and\npractical reason, how can he show their unity?\n\nThis entry has suggested that Kant’s account of reason is\nconstructive (not skeptical) and unified (not divided). In thought and\nin action, reasoners must look for principles that others can also\nadopt:\n\nTo make use of one’s own reason means no more than to ask\noneself, whenever one is supposed to assume something, whether one\ncould find it feasible to make the ground or the rule on which one\nassumes it into a universal principle for the use of reason.\n(“What is it to Orient Oneself in Thinking?” 8:146n)\n\n\nIn theoretical enquiry, we seek knowledge of the world and explore the\nlimits of knowledge; we think and philosophize. We hope to reach\njudgments that are valid for all and draw on principles that all can\nrely on.\n\nIn practical reasoning, we decide how to act, individually and with\nothers. Kant often emphasizes duty, but this entry has stressed the\nrelated idea of reasoning as justification. If an action is\njustified, other people should endorse it, rather than resent or\ncriticize it. If their circumstances are similar, they should act\nsimilarly. Even if their circumstances differ, the same underlying\nprinciples should guide their actions. If we can share principles, we\ncan justify our conduct and find a basis for cooperation.\n\nO’Neill (2000) situates the Kantian account against three\nalternatives. (i) The instrumental account of reason remains\npopular. Following Hume, rational choice theory and\n consequentialism\n see practical reasoning as a tool. Reason works out how to achieve\ngiven ends (cf.\n practical reason,\n §4;\n reasons for action: internal vs. external;\n instrumental rationality;\n philosophy of economics,\n §5). (ii) The communitarian account sees reason as\nembedded within shared traditions. Rationality is what a historical\ncommunity takes it to be—for example, its usual modes of\nargument and accepted authorities (cf. MacIntyre 1988;\n communitarianism).\n (iii) The perfectionist account sees reason as an individual\ncapacity to discern moral truth or goodness. This view resembles the\nrationalism which Kant opposed, except that it stresses divine\nrevelation or moral intuition, rather than abstract thought (cf.\n moral non-naturalism,\n §3).\n\nArguably, all three accounts fail in providing reasoned justification\nto some audiences. (i) The instrumental reasoner cannot justify their\naction to people who do not endorse their goal. Instrumental reasons\nexplain action in terms of the actor’s desires or ends.\nThey can make sense of the action, but they do not give the audience\nreasons to endorse it. Explanation is not justification. (ii) For the\ncommunitarian, their tradition defines what beliefs and practices\ncount as reasonable. If someone disagrees, such a reasoner can say\nlittle except: this is how I have been taught; this is how we do\nthings round here. This sort of reasoning cannot justify itself to\noutsiders, nor to insiders who dissent. (Recall Kant’s free\ncitizens who “must be able to express [their] reservations,\nindeed even [their] veto.”) (iii) The perfectionist believes\nthat they can intuit how it is good to act or to be. But what can they\nsay to someone who has different “intuitions,” or\nnone—except perhaps to condemn them as blind or confused?\n\nOn the interpretations advanced by Saner, O’Neill, Neiman and\nothers, Kant was aware of these options and rejected them all. We saw\nabove\n (§1.4)\n that Kant characterizes reason in terms of a self-reflexive\nprocedure. Reason is autonomous—that is, it rejects all external\nauthorities. Reason has authority only because it rests on on-going\ncritique. Openness to critique means giving up any mode of thinking or\nacting that cannot be adopted by all.\n\nTo put the same point in more concrete terms: Kant ties reasoning to\njustification. His account stresses the limits of many everyday\njustifications. Consider the modes of reasoning just mentioned. (i)\n“Because I wanted to” is sometimes a perfectly good\nreason—so long as I don’t infringe on\nothers’ legitimate claims. (ii) “Because that’s how\nwe usually do things” is sometimes a perfectly good\nreason—so long as our practices don’t endanger or\nhumiliate or exploit. (iii) “Because it felt like the right\nthing to do” may be a perfectly good reason—so long\nas my “intuitions” reflect a moral sensibility that\nfits my circumstances.\n\nThe Kantian point is this: Don’t forget the proviso,\n“so long as…” In the wrong circumstances,\ndesires, customs and intuitions can lead us astray. Reasoning is\nincomplete unless we can also justify giving weight to the\ndesires, customs or intuitions that make something seem reasonable to\nus. By contrast, reasoning is complete when it meets the following\ntest: Everyone could think and act on the same principles that now\nguide my thought and action. To judge whether our thinking and acting\nmeet this demanding test, we must consider objections from different\npoints of view. As Kant says, each person “must be able to\nexpress [their] reservations.” This is an on-going process, with\nno fixed or final endpoint. Only this active process can make\nreasoning fully “public,” “autonomous” and\n“universal(izable).”\n\nThe Kantian view does not assume that we are hemmed in by our\ninterests and inclinations—as many instrumental accounts do. It\ndoes not ask us to rely on what others already accept—as the\ncommunitarian account does. It does not suppose that we can intuit\nwhat everyone should accept—as the perfectionist account does.\nNot least, it does not suppose that reason can teach us about God or\nany other moral authority beyond everyday experience—as many\nrationalist philosophers supposed. Kant’s account sees human\nbeings as able to step back from their inclinations, habits and\nintuitions. Reasoning is not the voice of God, but rather a capacity\nto heed the voices of those we share a world with. Kant asks us to use\nthis ability to seek principles that all can think and live by, and to\norganize our lives together on this basis.\n\nThis account depends on a particular interpretation of Kant’s\ntexts. It is abstract, ambitious, and complex in its ramifications.\nBut if it succeeds, it captures two powerful aspects of Kant’s\nphilosophy: a universalism that transcends self and community\nboundaries; a modesty that respects the limits of human insight.\n",
    "bibliography": {
        "categories": [
            "Primary sources",
            "Secondary literature"
        ],
        "cat_ref_text": {
            "Primary sources": [
                "</h3>\n<p>\nKant’s works are cited by volume and page numbers of the\n<em>Akademie</em> edition of <em>Kants gesammelte Schriften</em>\n(Berlin, 1902–). The only exception is the <em>Critique of Pure\nReason</em>, cited by the standard A and B pagination of the first\n(1781) and second (1787) editions respectively. The\n<em>Groundwork</em> is printed in <em>Akademie</em> volume 4 and the\n<em>Critique of Practical Reason</em> in volume 5; unless otherwise\nnoted, references beginning with “4:” are to the\n<em>Groundwork</em> and those beginning with “5:” to the\nsecond <em>Critique</em>. The <em>Akademie</em> pagination is found in\nthe margins of all modern translations. Apart from the 2011 edition of\nthe <em>Groundwork</em>, translations are from the standard Cambridge\nEdition of the Works of Immanuel Kant:</p>\n<ul>",
                "<em>Critique of Pure Reason</em>, translated/edited by P. Guyer\n&amp; A. Wood, Cambridge: Cambridge University Press, 1997.",
                "<em>Practical Philosophy</em>, translated/edited by M. Gregor,\nCambridge: Cambridge University Press, 1996. [Includes “What is\nEnlightenment?”, the <em>Critique of Practical\nReason</em>, and the <em>Metaphysics of Morals</em>.]",
                "<em>Groundwork of the Metaphysics of Morals</em> (German-English\nEdition), translated/edited by M. Gregor &amp; J. Timmermann,\nCambridge: Cambridge University Press, 2011.",
                "<em>Religion and Rational Theology</em>, translated/edited by A.\nWood &amp; G. di Giovanni, Cambridge: Cambridge University Press,\n1996. [Includes “What Does it Mean to Orient Oneself in\nThinking?” and <em>Conflict of the Faculties</em>.]",
                "<em>Lectures on Ethics</em>, translated/edited by J. B. Schneewind\n&amp; P. Heath, Cambridge: Cambridge University Press, 1998.",
                "<em>Theoretical Philosophy 1755–1770</em>, translated/edited\nby D. Walford, with R. Meerbote, Cambridge: Cambridge University\nPress, 1992. [Includes <em>Dreams of a Spirit-Seer</em>.]",
                "<em>Theoretical Philosophy after 1781</em>, translated/edited by\nH. Allison, M. Friedman, G. Hatfield &amp; P. Heath, Cambridge:\nCambridge University Press, 2002. [Includes the\n<em>Prolegomena</em>.]",
                "<em>Anthropology, History, and Education</em>, translated/edited\nby G. Zoller, R. Louden, M. Gregor &amp; P. Guyer, Cambridge:\nCambridge University Press, 2007. [Includes the\n<em>Anthropology</em>.]",
                "<em>Critique of the Power of Judgment</em>, translated/edited by\nP. Guyer &amp; E. Matthews, Cambridge: Cambridge University Press,\n2000.\n</ul>\n<h3 id=\"SecoLite\">"
            ],
            "Secondary literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Abela, P., 2006, “The Demands of Systematicity: Rational\nJudgment and the Structure of Nature,” in <em>A Companion to\nKant</em>, G. Bird (ed.), Oxford: Blackwell, pp. 408–422.",
                "Allison, H., 1990, <em>Kant’s Theory of Freedom</em>,\nCambridge: Cambridge University Press.",
                "–––, 2004, <em>Kant’s Transcendental\nIdealism</em>, revised and expanded edition, New Haven: Yale\nUniversity Press.",
                "Ameriks, K., 2003, <em>Interpreting Kant’s Critiques</em>,\nOxford: Clarendon Press.",
                "Bagnoli, C., 2017, “Kant in Metaethics: The Paradox of\nAutonomy, Solved by Publicity,” in <em>The Palgrave Kant\nHandbook</em>, M. Altman (ed.), London: Palgrave Macmillan, pp.\n355–77.",
                "–––, 2022, <em>Ethical Constructivism</em>\n(Cambridge Element), Cambridge: Cambridge University Press.",
                "Brandom, R., 1979, “Freedom and Constraint by Norms,”\n<em>American Philosophical Quarterly</em>, 16(3): 187–196.",
                "Breitenbach, A., 2018, “Laws and Ideal Unity,” in\n<em>Laws of Nature</em>, W. Ott &amp; L. Patton (eds.), Oxford: Oxford\nUniversity Press, pp. 108–121.",
                "Buchdahl, G., 1992, <em>Kant and the Dynamics of Reason: Essays on\nthe Structure of Kant’s Philosophy</em>, Oxford: Basil Blackwell\n(Chs. 7 &amp; 8).",
                "Cohen, A., 2014, “Kant on the Ethics of Belief,”\n<em>Proceedings of the Aristotelian Society</em>, 114(3):\n317–334.",
                "–––, 2018, “Kant on Science and\nNormativity,” <em>Studies in History and Philosophy of\nScience</em>, 71(October): 6–12.",
                "Deligiorgi, K., 2005, <em>Kant and the Culture of\nEnlightenment</em>, Albany NY: State University of New York\nPress.",
                "Engstrom, S., 1992, Review of Onora O’Neill,\n<em>Constructions of Reason</em>, <em>Ethics</em>, 102(3):\n653–655.",
                "Ferrarin, A., 2015, <em>The Powers of Pure Reason: Kant and the\nIdea of Cosmic Philosophy</em>, Chicago: University of Chicago\nPress.",
                "Förster, E., 1992, “Was darf ich hoffen? Zum Problem\nder Vereinbarkeit von theoretischer und praktischer Vernunft bei\nImmanuel Kant,” <em>Zeitschrift für philosophische\nForschung</em>, 46(2): 168–185.",
                "Freudiger, J., 1996, “Kants Schlußstein: Wie die\nTeleologie die Einheit der Vernunft stiftet,”\n<em>Kant-Studien</em>, 87(4): 423–435.",
                "Friedman, M., 1992a, “Causal Laws and Foundations of Natural\nScience,” in <em>The Cambridge Companion to Kant</em>, P. Guyer\n(ed.), Cambridge: Cambridge University Press, pp. 161–199.",
                "–––, 1992b, <em>Kant and the Exact\nSciences</em>, Cambridge, MA: Harvard University Press.",
                "–––, 1992c, “Regulative and\nConstitutive,” <em>Southern Journal of Philosophy</em>,\n30(Supplement): 73–102.",
                "–––, 2013, <em>Kant’s Construction of\nNature: A Reading of the Metaphysical Foundations of Natural\nScience</em>, Cambridge: Cambridge University Press.",
                "Gardner, S., 1999, <em>Kant and the Critique of Pure Reason</em>,\nLondon: Routledge.",
                "–––, 2006, “The Primacy of Practical\nReason,” in <em>A Companion to Kant</em>, G. Bird (ed.), Oxford:\nBlackwell, pp. 259–274.",
                "Gava, G., 2018, “Kant, Wolff and the Method of\nPhilosophy,” in <em>Oxford Studies in Early Modern\nPhilosophy</em> (Volume VIII), D. Garber &amp; D. Rutherford (eds.),\nOxford: Clarendon Press, pp. 271–303.",
                "Gava, G. &amp; M. Willaschek, forthcoming, “The\nTranscendental Doctrine of Method of the Critique of Pure\nReason,” in <em>The Kantian Mind</em>, S. Baiasu &amp; M.\nTimmons (eds.), London &amp; New York: Routledge.",
                "Gelfert, A., 2006, “Kant on Testimony,” <em>British\nJournal for the History of Philosophy</em>, 14(4): 627–652.",
                "Grier, M., 2001, <em>Kant’s Doctrine of Transcendental\nIllusion</em>, Cambridge: Cambridge University Press.",
                "Guyer, P., 1989, “The Unity of Reason: Pure Reason as\nPractical Reason in Kant’s Early Conception of the\nTranscendental Dialectic,” <em>Monist</em>, 72(2):\n139–167; reprinted as Ch. 2 of his <em>Kant on Freedom, Law and\nHappiness</em>, Cambridge: Cambridge University Press, 2000.",
                "–––, 1990, “Reason and Reflective\nJudgment: Kant on the Significance of Systematicity,”\n<em>Noûs</em>, 24(1): 17–43.",
                "–––, 1997, Review of Susan Neiman, <em>The Unity\nof Reason</em>, <em>The Philosophical Review</em>, 106(2):\n291–295.",
                "–––, 2000a, “Freedom as the Inner Value of\nthe World,” Ch. 3 of his <em>Kant on Freedom, Law and\nHappiness</em>, Cambridge: Cambridge University Press, pp.\n96–125.",
                "–––, 2000b, “The Unity of Nature and\nFreedom: Kant’s Conception of the System of Philosophy,”\nin <em>The Reception of Kant’s Critical Philosophy</em>, S.\nSedgwick (ed.), Cambridge: Cambridge University Press, pp.\n19–53.",
                "–––, 2006, “Bridging the Gulf:\nKant’s Project in the Third Critique,” in <em>A Companion\nto Kant</em>, G. Bird (ed.), Oxford: Blackwell, pp.\n423–440.",
                "Guyer, P. &amp; R. Walker, 1990, “Kant’s Conception of\nEmpirical Law,” <em>Proceedings of the Aristotelian Society</em>\n(Supplementary Volumes), 64: 221–258.",
                "Herman, B., 1993, <em>The Practice of Moral Judgment</em>,\nCambridge MA: Harvard University Press.",
                "–––, 2007, <em>Moral Literacy</em>, Cambridge\nMA: Harvard University Press.",
                "Hieronymi, P., 2021, “Reasoning First,” in\n<em>Routledge Handbook of Practical Reasoning</em>, R. Chang &amp; K.\nSylvan (eds.), Abingdon: Routledge, pp. 349–65.",
                "Kleingeld, P., 1995, “What Do the Virtuous Hope for?\nRe-reading Kant’s Doctrine of the Highest Good,” in\n<em>Proceedings of the Eighth International Kant Congress</em> (Volume\n1), H. Robinson (ed.), Milwaukee: Marquette University Press, pp.\n91–112.",
                "–––, 1998a, “The Conative Character of\nReason in Kant’s Philosophy,” <em>Journal of the History\nof Philosophy</em>, 36(1): 77–97.",
                "–––, 1998b, “Kant on the Unity of\nTheoretical and Practical Reason,” <em>Review of\nMetaphysics</em>, 52(2): 311–339.",
                "–––, 2010, “Moral consciousness and the\n‘fact of reason’,” in <em>Kant’s Critique of\nPractical Reason: A Critical Guide</em>, A. Reath &amp; J. Timmermann\n(eds.), Cambridge: Cambridge University Press, pp. 55–72.",
                "–––, 2016, “Kant on ‘Good’,\nthe Good, and the Duty to Promote the Highest Good,” in <em>The\nHighest Good in Kant’s Philosophy</em>, T. Höwing (ed),\nBerlin: De Gruyter, pp. 33–49.",
                "Klemme, H., 2014. “Is the Categorical Imperative the Highest\nPrinciple of Both Pure Practical and Theoretical Reason?”\n<em>Kantian Review</em>, 19(1): 119–126.",
                "Korsgaard, C., 1996, <em>Creating the Kingdom of Ends</em>,\nCambridge: Cambridge University Press.",
                "–––, 1997, “The Normativity of\nInstrumental Reason,” in <em>Ethics and Practical Reason</em>,\nG. Cullity &amp; B. Gaut (eds.), Oxford: Oxford University Press, pp.\n215–254; reprinted as Ch. 1 of her 2008, pp. 27–68.",
                "–––, 2008, <em>The Constitution of Agency:\nEssays on Practical Reason and Moral Psychology</em>, New York: Oxford\nUniversity Press.",
                "Lenczewska, O., 2021, “Becoming Pluralists: Kant on the\nNormative Features of Pluralistic Thinking,” <em>Kant\nYearbook</em>, 13(1): 107–28.",
                "Łuków, P., 1993, “The Fact of Reason:\nKant’s Passage to Ordinary Moral Knowledge,”\n<em>Kant-Studien</em>, 84(2): 204–221.",
                "MacIntyre, A., 1988, <em>Whose Justice? Which Rationality?</em>,\nLondon: Duckworth.",
                "Mikalsen, K. K., 2010, “Testimony and Kant’s Idea of\nPublic Reason,” <em>Res Publica</em>, 16(1): 23–40.",
                "Møller, S., 2020, <em>Kant’s Tribunal of Reason:\nLegal Metaphor and Normativity in the</em> Critique of Pure Reason.\nCambridge: Cambridge University Press.",
                "Mudd, S., 2016, “Rethinking the Priority of Practical Reason\nin Kant,” <em>European Journal of Philosophy</em>, 24(1):\n78–102.",
                "–––, 2017, “The Demand for Systematicity\nand the Authority of Theoretical Reason in Kant,” <em>Kantian\nReview</em>, 22(1): 81–106.",
                "Neiman, S., 1994, <em>The Unity of Reason: Rereading Kant</em>,\nNew York: Oxford University Press.",
                "Newton, A., 2017, “The Analytic Proposition Underlying\nKantian Hypothetical Imperatives,” <em>Kant-Studien</em>,\n108(4): 543–67.",
                "Nuzzo, A., 2005, <em>Kant and the Unity of Reason</em>, West\nLafayette, IN: Purdue University Press.",
                "O’Neill, O., 1984, “Transcendental Synthesis and\nDevelopmental Psychology,” <em>Kant-Studien</em>, 75(2):\n149–167.",
                "–––, 1989, <em>Constructions of Reason</em>,\nCambridge: Cambridge University Press.",
                "–––, 1990, “Enlightenment as Autonomy:\nKant’s Vindication of Reason,” in <em>The Enlightenment\nand its Shadows</em>, P. Hulme &amp; L. Jordanova (eds.), London:\nRoutledge, pp. 184–199.",
                "–––, 1992, “Vindicating Reason,” in\n<em>The Cambridge Companion to Kant</em>, P. Guyer (ed.), Cambridge:\nCambridge University Press, pp. 280–308; reprinted as Ch. 1 of\nO’Neill 2015.",
                "–––, 1996, <em>Towards Justice and Virtue</em>,\nCambridge: Cambridge University Press.",
                "–––, 2000, “Four Models of Practical\nReason,” in her <em>Bounds of Justice</em>, Cambridge: Cambridge\nUniversity Press, pp. 11–28; German version, 1994, “Vier\nModelle praktischer Vernunft,” in <em>Vernunftbegriffe in der\nModerne</em>, H. F. Fulda &amp; R. Horstmann (eds.), Stuttgart:\nKlett-Cotta, pp. 586–606.",
                "–––, 2002, “Autonomy and the Fact of\nReason in the <em>Kritik der praktischen Vernunft</em>,\n30–41,” in <em>Immanuel Kant, Kritik der praktischen\nVernunft</em>, O. Höffe (ed.), Berlin: Akademie Verlag, pp.\n81–97.",
                "–––, 2004, “Kant: Rationality as Practical\nReason,” in <em>The Oxford Handbook of Rationality</em>, A. Mele\n&amp; P. Rawling (eds.), Oxford: Oxford University Press, pp.\n93–109; reprinted as Ch. 2 of O’Neill 2015.",
                "–––, 2015, <em>Constructing Authorities: Reason,\nPolitics and Interpretation in Kant’s Philosophy</em>,\nCambridge: Cambridge University Press.",
                "Patrone, T., 2008, <em>How Kant’s Conception of Reason\nImplies a Liberal Politics: An Interpretation of the “Doctrine\nof Right”</em>, Lewiston NY: Edwin Mellen Press.",
                "Pollok, K., 2017, <em>Kant’s Theory of Normativity:\nExploring the Space of Reason</em>, Cambridge: Cambridge University\nPress.",
                "Prauss, G., 1981, “Kants Problem der Einheit theoretischer\nund praktischer Vernunft,” <em>Kant-Studien</em>, 72(3):\n286–303.",
                "Rauscher, F., 1998, “Kant’s Two Priorities of\nPractical Reason,” <em>British Journal for the History of\nPhilosophy</em>, 6(3): 397–419.",
                "Reath, A., 1988, “Two Conceptions of the Highest Good in\nKant,” <em>Journal of the History of Philosophy</em>, 26(4):\n593–619.",
                "–––, 2013, “Formal Approaches to\nKant’s Formula of Humanity,” in <em>Kant on Practical\nJustification: Interpretive Essays</em>, S. Baiasu &amp; M. Timmons\n(eds.), Oxford: Oxford University Press, pp. 201–228.",
                "Rescher, N., 2000, <em>Kant and the Reach of Reason:</em>\n<em>Studies in Kant’s Theory of Rational Systemization</em>,\nCambridge: Cambridge University Press.",
                "Ripstein, A., 2021, <em>Kant and the Law of War</em>, New York:\nOxford University Press.",
                "Ruffing, M., 2015, “Kants ‘Stimme der\nVernunft’—Analyse einer unauffälligen\nMetapher,” in <em>Kant and the Metaphors of Reason</em>, P.\nKauark-Leite, G. Cecchinato, V. de Araujo Figuereido, M. Ruffing &amp;\nA. Serra (eds.), Hildesheim: Olms, pp. 195–204.",
                "Russell, F., 2020, “Kantian Self-Conceit and the Two Guises\nof Authority,” <em>Canadian Journal of Philosophy</em>, 50(2):\n268–83.",
                "Saner, H., 1967/73, <em>Kant’s Political Thought: Its\nOrigins and Development</em>, E. Ashton (trans.), Chicago: Chicago\nUniversity Press.",
                "Schadow, S., 2022, “Acting for a Reason. What Kant’s\nConcept of Maxims Can Tell Us about Value, Human Action, and Practical\nIdentity,” in <em>Kant’s Theory of Value</em>, C. Horn\n&amp; R. Dos Santos (eds.), Berlin: De Gruyter, pp. 65–88.",
                "Sticker, M., 2021, Rationalizing (<em>Vernünfteln</em>).\n<em>Elements in the Philosophy of Immanuel Kant</em>, Cambridge:\nCambridge University Press. doi:10.1017/9781108625661",
                "Stoddard, E., 1988, “Reason on Trial: Legal Metaphors in the\n<em>Critique of Pure Reason</em>,” <em>Philosophy and\nLiterature</em>, 12(2): 245–260.",
                "Timmermann, J., 2009, “The Unity of Reason: Kantian\nPerspectives,” in <em>Spheres of Reason</em>, S. Robertson\n(ed.), Oxford: Oxford University Press, pp. 183–198.",
                "–––, 2010, “Reversal or retreat?\nKant’s Deductions of Freedom and Morality,” in\n<em>Kant’s Critique of Practical Reason: A Critical Guide</em>,\nA. Reath &amp; J. Timmermann (eds.), Cambridge: Cambridge University\nPress, pp. 73–89.",
                "Velkley, R., 1989, <em>Freedom and the Ends of Reason: On the\nMoral Foundations of Kant’s Critical Philosophy</em>, Chicago:\nUniversity of Chicago Press.",
                "Walker, R., 1989, <em>The Coherence Theory of Truth: Realism,\nAnti-Realism, Idealism</em>, London: Routledge.",
                "Wartenberg, T., 1992, “Reason and the Practice of\nScience,” in <em>The Cambridge Companion to Kant</em>, P. Guyer\n(ed.), Cambridge: Cambridge University Press, pp. 228–248.",
                "Westphal, K., 2011, “Kant’s Moral Constructivism and\nRational Justification,” in <em>Politics and Metaphysics in\nKant</em>, S. Baiasu, S. Pihlström &amp; H. Williams (eds.),\nCardiff: University of Wales Press, pp. 28–46.",
                "Willaschek, M., 2010, “The Primacy of Practical Reason and\nthe Idea of a Practical Postulate,” in <em>Kant’s Critique\nof Practical Reason: A Critical Guide</em>, A. Reath &amp; J.\nTimmermann (eds.), Cambridge: Cambridge University Press, pp.\n168–196.",
                "Wood, A., 1970, <em>Kant’s Moral Religion</em>, Ithaca NY:\nCornell University Press.",
                "–––, 1992, Review of Onora O’Neill,\n<em>Constructions of Reason</em>, <em>Philosophical Review</em>,\n101(3): 647–650.",
                "Ypi, L., 2021, <em>The Architectonic of Reason: Purposiveness and\nSystematic Unity in Kant’s Critique of Pure Reason</em>, Oxford:\nOxford University Press.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimSour\">Primary sources</h3>\n<p>\nKant’s works are cited by volume and page numbers of the\n<em>Akademie</em> edition of <em>Kants gesammelte Schriften</em>\n(Berlin, 1902–). The only exception is the <em>Critique of Pure\nReason</em>, cited by the standard A and B pagination of the first\n(1781) and second (1787) editions respectively. The\n<em>Groundwork</em> is printed in <em>Akademie</em> volume 4 and the\n<em>Critique of Practical Reason</em> in volume 5; unless otherwise\nnoted, references beginning with “4:” are to the\n<em>Groundwork</em> and those beginning with “5:” to the\nsecond <em>Critique</em>. The <em>Akademie</em> pagination is found in\nthe margins of all modern translations. Apart from the 2011 edition of\nthe <em>Groundwork</em>, translations are from the standard Cambridge\nEdition of the Works of Immanuel Kant:</p>\n<ul>\n<li><em>Critique of Pure Reason</em>, translated/edited by P. Guyer\n&amp; A. Wood, Cambridge: Cambridge University Press, 1997.</li>\n<li><em>Practical Philosophy</em>, translated/edited by M. Gregor,\nCambridge: Cambridge University Press, 1996. [Includes “What is\nEnlightenment?”, the <em>Critique of Practical\nReason</em>, and the <em>Metaphysics of Morals</em>.]</li>\n<li><em>Groundwork of the Metaphysics of Morals</em> (German-English\nEdition), translated/edited by M. Gregor &amp; J. Timmermann,\nCambridge: Cambridge University Press, 2011.</li>\n<li><em>Religion and Rational Theology</em>, translated/edited by A.\nWood &amp; G. di Giovanni, Cambridge: Cambridge University Press,\n1996. [Includes “What Does it Mean to Orient Oneself in\nThinking?” and <em>Conflict of the Faculties</em>.]</li>\n<li><em>Lectures on Ethics</em>, translated/edited by J. B. Schneewind\n&amp; P. Heath, Cambridge: Cambridge University Press, 1998.</li>\n<li><em>Theoretical Philosophy 1755–1770</em>, translated/edited\nby D. Walford, with R. Meerbote, Cambridge: Cambridge University\nPress, 1992. [Includes <em>Dreams of a Spirit-Seer</em>.]</li>\n<li><em>Theoretical Philosophy after 1781</em>, translated/edited by\nH. Allison, M. Friedman, G. Hatfield &amp; P. Heath, Cambridge:\nCambridge University Press, 2002. [Includes the\n<em>Prolegomena</em>.]</li>\n<li><em>Anthropology, History, and Education</em>, translated/edited\nby G. Zoller, R. Louden, M. Gregor &amp; P. Guyer, Cambridge:\nCambridge University Press, 2007. [Includes the\n<em>Anthropology</em>.]</li>\n<li><em>Critique of the Power of Judgment</em>, translated/edited by\nP. Guyer &amp; E. Matthews, Cambridge: Cambridge University Press,\n2000.</li>\n</ul>\n<h3 id=\"SecoLite\">Secondary literature</h3>\n<ul class=\"hanging\">\n<li>Abela, P., 2006, “The Demands of Systematicity: Rational\nJudgment and the Structure of Nature,” in <em>A Companion to\nKant</em>, G. Bird (ed.), Oxford: Blackwell, pp. 408–422.</li>\n<li>Allison, H., 1990, <em>Kant’s Theory of Freedom</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 2004, <em>Kant’s Transcendental\nIdealism</em>, revised and expanded edition, New Haven: Yale\nUniversity Press.</li>\n<li>Ameriks, K., 2003, <em>Interpreting Kant’s Critiques</em>,\nOxford: Clarendon Press.</li>\n<li>Bagnoli, C., 2017, “Kant in Metaethics: The Paradox of\nAutonomy, Solved by Publicity,” in <em>The Palgrave Kant\nHandbook</em>, M. Altman (ed.), London: Palgrave Macmillan, pp.\n355–77.</li>\n<li>–––, 2022, <em>Ethical Constructivism</em>\n(Cambridge Element), Cambridge: Cambridge University Press.</li>\n<li>Brandom, R., 1979, “Freedom and Constraint by Norms,”\n<em>American Philosophical Quarterly</em>, 16(3): 187–196.</li>\n<li>Breitenbach, A., 2018, “Laws and Ideal Unity,” in\n<em>Laws of Nature</em>, W. Ott &amp; L. Patton (eds.), Oxford: Oxford\nUniversity Press, pp. 108–121.</li>\n<li>Buchdahl, G., 1992, <em>Kant and the Dynamics of Reason: Essays on\nthe Structure of Kant’s Philosophy</em>, Oxford: Basil Blackwell\n(Chs. 7 &amp; 8).</li>\n<li>Cohen, A., 2014, “Kant on the Ethics of Belief,”\n<em>Proceedings of the Aristotelian Society</em>, 114(3):\n317–334.</li>\n<li>–––, 2018, “Kant on Science and\nNormativity,” <em>Studies in History and Philosophy of\nScience</em>, 71(October): 6–12.</li>\n<li>Deligiorgi, K., 2005, <em>Kant and the Culture of\nEnlightenment</em>, Albany NY: State University of New York\nPress.</li>\n<li>Engstrom, S., 1992, Review of Onora O’Neill,\n<em>Constructions of Reason</em>, <em>Ethics</em>, 102(3):\n653–655.</li>\n<li>Ferrarin, A., 2015, <em>The Powers of Pure Reason: Kant and the\nIdea of Cosmic Philosophy</em>, Chicago: University of Chicago\nPress.</li>\n<li>Förster, E., 1992, “Was darf ich hoffen? Zum Problem\nder Vereinbarkeit von theoretischer und praktischer Vernunft bei\nImmanuel Kant,” <em>Zeitschrift für philosophische\nForschung</em>, 46(2): 168–185.</li>\n<li>Freudiger, J., 1996, “Kants Schlußstein: Wie die\nTeleologie die Einheit der Vernunft stiftet,”\n<em>Kant-Studien</em>, 87(4): 423–435.</li>\n<li>Friedman, M., 1992a, “Causal Laws and Foundations of Natural\nScience,” in <em>The Cambridge Companion to Kant</em>, P. Guyer\n(ed.), Cambridge: Cambridge University Press, pp. 161–199.</li>\n<li>–––, 1992b, <em>Kant and the Exact\nSciences</em>, Cambridge, MA: Harvard University Press.</li>\n<li>–––, 1992c, “Regulative and\nConstitutive,” <em>Southern Journal of Philosophy</em>,\n30(Supplement): 73–102.</li>\n<li>–––, 2013, <em>Kant’s Construction of\nNature: A Reading of the Metaphysical Foundations of Natural\nScience</em>, Cambridge: Cambridge University Press.</li>\n<li>Gardner, S., 1999, <em>Kant and the Critique of Pure Reason</em>,\nLondon: Routledge.</li>\n<li>–––, 2006, “The Primacy of Practical\nReason,” in <em>A Companion to Kant</em>, G. Bird (ed.), Oxford:\nBlackwell, pp. 259–274.</li>\n<li>Gava, G., 2018, “Kant, Wolff and the Method of\nPhilosophy,” in <em>Oxford Studies in Early Modern\nPhilosophy</em> (Volume VIII), D. Garber &amp; D. Rutherford (eds.),\nOxford: Clarendon Press, pp. 271–303.</li>\n<li>Gava, G. &amp; M. Willaschek, forthcoming, “The\nTranscendental Doctrine of Method of the Critique of Pure\nReason,” in <em>The Kantian Mind</em>, S. Baiasu &amp; M.\nTimmons (eds.), London &amp; New York: Routledge.</li>\n<li>Gelfert, A., 2006, “Kant on Testimony,” <em>British\nJournal for the History of Philosophy</em>, 14(4): 627–652.</li>\n<li>Grier, M., 2001, <em>Kant’s Doctrine of Transcendental\nIllusion</em>, Cambridge: Cambridge University Press.</li>\n<li>Guyer, P., 1989, “The Unity of Reason: Pure Reason as\nPractical Reason in Kant’s Early Conception of the\nTranscendental Dialectic,” <em>Monist</em>, 72(2):\n139–167; reprinted as Ch. 2 of his <em>Kant on Freedom, Law and\nHappiness</em>, Cambridge: Cambridge University Press, 2000.</li>\n<li>–––, 1990, “Reason and Reflective\nJudgment: Kant on the Significance of Systematicity,”\n<em>Noûs</em>, 24(1): 17–43.</li>\n<li>–––, 1997, Review of Susan Neiman, <em>The Unity\nof Reason</em>, <em>The Philosophical Review</em>, 106(2):\n291–295.</li>\n<li>–––, 2000a, “Freedom as the Inner Value of\nthe World,” Ch. 3 of his <em>Kant on Freedom, Law and\nHappiness</em>, Cambridge: Cambridge University Press, pp.\n96–125.</li>\n<li>–––, 2000b, “The Unity of Nature and\nFreedom: Kant’s Conception of the System of Philosophy,”\nin <em>The Reception of Kant’s Critical Philosophy</em>, S.\nSedgwick (ed.), Cambridge: Cambridge University Press, pp.\n19–53.</li>\n<li>–––, 2006, “Bridging the Gulf:\nKant’s Project in the Third Critique,” in <em>A Companion\nto Kant</em>, G. Bird (ed.), Oxford: Blackwell, pp.\n423–440.</li>\n<li>Guyer, P. &amp; R. Walker, 1990, “Kant’s Conception of\nEmpirical Law,” <em>Proceedings of the Aristotelian Society</em>\n(Supplementary Volumes), 64: 221–258.</li>\n<li>Herman, B., 1993, <em>The Practice of Moral Judgment</em>,\nCambridge MA: Harvard University Press.</li>\n<li>–––, 2007, <em>Moral Literacy</em>, Cambridge\nMA: Harvard University Press.</li>\n<li>Hieronymi, P., 2021, “Reasoning First,” in\n<em>Routledge Handbook of Practical Reasoning</em>, R. Chang &amp; K.\nSylvan (eds.), Abingdon: Routledge, pp. 349–65.</li>\n<li>Kleingeld, P., 1995, “What Do the Virtuous Hope for?\nRe-reading Kant’s Doctrine of the Highest Good,” in\n<em>Proceedings of the Eighth International Kant Congress</em> (Volume\n1), H. Robinson (ed.), Milwaukee: Marquette University Press, pp.\n91–112.</li>\n<li>–––, 1998a, “The Conative Character of\nReason in Kant’s Philosophy,” <em>Journal of the History\nof Philosophy</em>, 36(1): 77–97.</li>\n<li>–––, 1998b, “Kant on the Unity of\nTheoretical and Practical Reason,” <em>Review of\nMetaphysics</em>, 52(2): 311–339.</li>\n<li>–––, 2010, “Moral consciousness and the\n‘fact of reason’,” in <em>Kant’s Critique of\nPractical Reason: A Critical Guide</em>, A. Reath &amp; J. Timmermann\n(eds.), Cambridge: Cambridge University Press, pp. 55–72.</li>\n<li>–––, 2016, “Kant on ‘Good’,\nthe Good, and the Duty to Promote the Highest Good,” in <em>The\nHighest Good in Kant’s Philosophy</em>, T. Höwing (ed),\nBerlin: De Gruyter, pp. 33–49.</li>\n<li>Klemme, H., 2014. “Is the Categorical Imperative the Highest\nPrinciple of Both Pure Practical and Theoretical Reason?”\n<em>Kantian Review</em>, 19(1): 119–126.</li>\n<li>Korsgaard, C., 1996, <em>Creating the Kingdom of Ends</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 1997, “The Normativity of\nInstrumental Reason,” in <em>Ethics and Practical Reason</em>,\nG. Cullity &amp; B. Gaut (eds.), Oxford: Oxford University Press, pp.\n215–254; reprinted as Ch. 1 of her 2008, pp. 27–68.</li>\n<li>–––, 2008, <em>The Constitution of Agency:\nEssays on Practical Reason and Moral Psychology</em>, New York: Oxford\nUniversity Press.</li>\n<li>Lenczewska, O., 2021, “Becoming Pluralists: Kant on the\nNormative Features of Pluralistic Thinking,” <em>Kant\nYearbook</em>, 13(1): 107–28.</li>\n<li>Łuków, P., 1993, “The Fact of Reason:\nKant’s Passage to Ordinary Moral Knowledge,”\n<em>Kant-Studien</em>, 84(2): 204–221.</li>\n<li>MacIntyre, A., 1988, <em>Whose Justice? Which Rationality?</em>,\nLondon: Duckworth.</li>\n<li>Mikalsen, K. K., 2010, “Testimony and Kant’s Idea of\nPublic Reason,” <em>Res Publica</em>, 16(1): 23–40.</li>\n<li>Møller, S., 2020, <em>Kant’s Tribunal of Reason:\nLegal Metaphor and Normativity in the</em> Critique of Pure Reason.\nCambridge: Cambridge University Press.</li>\n<li>Mudd, S., 2016, “Rethinking the Priority of Practical Reason\nin Kant,” <em>European Journal of Philosophy</em>, 24(1):\n78–102.</li>\n<li>–––, 2017, “The Demand for Systematicity\nand the Authority of Theoretical Reason in Kant,” <em>Kantian\nReview</em>, 22(1): 81–106.</li>\n<li>Neiman, S., 1994, <em>The Unity of Reason: Rereading Kant</em>,\nNew York: Oxford University Press.</li>\n<li>Newton, A., 2017, “The Analytic Proposition Underlying\nKantian Hypothetical Imperatives,” <em>Kant-Studien</em>,\n108(4): 543–67.</li>\n<li>Nuzzo, A., 2005, <em>Kant and the Unity of Reason</em>, West\nLafayette, IN: Purdue University Press.</li>\n<li>O’Neill, O., 1984, “Transcendental Synthesis and\nDevelopmental Psychology,” <em>Kant-Studien</em>, 75(2):\n149–167.</li>\n<li>–––, 1989, <em>Constructions of Reason</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 1990, “Enlightenment as Autonomy:\nKant’s Vindication of Reason,” in <em>The Enlightenment\nand its Shadows</em>, P. Hulme &amp; L. Jordanova (eds.), London:\nRoutledge, pp. 184–199.</li>\n<li>–––, 1992, “Vindicating Reason,” in\n<em>The Cambridge Companion to Kant</em>, P. Guyer (ed.), Cambridge:\nCambridge University Press, pp. 280–308; reprinted as Ch. 1 of\nO’Neill 2015.</li>\n<li>–––, 1996, <em>Towards Justice and Virtue</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 2000, “Four Models of Practical\nReason,” in her <em>Bounds of Justice</em>, Cambridge: Cambridge\nUniversity Press, pp. 11–28; German version, 1994, “Vier\nModelle praktischer Vernunft,” in <em>Vernunftbegriffe in der\nModerne</em>, H. F. Fulda &amp; R. Horstmann (eds.), Stuttgart:\nKlett-Cotta, pp. 586–606.</li>\n<li>–––, 2002, “Autonomy and the Fact of\nReason in the <em>Kritik der praktischen Vernunft</em>,\n30–41,” in <em>Immanuel Kant, Kritik der praktischen\nVernunft</em>, O. Höffe (ed.), Berlin: Akademie Verlag, pp.\n81–97.</li>\n<li>–––, 2004, “Kant: Rationality as Practical\nReason,” in <em>The Oxford Handbook of Rationality</em>, A. Mele\n&amp; P. Rawling (eds.), Oxford: Oxford University Press, pp.\n93–109; reprinted as Ch. 2 of O’Neill 2015.</li>\n<li>–––, 2015, <em>Constructing Authorities: Reason,\nPolitics and Interpretation in Kant’s Philosophy</em>,\nCambridge: Cambridge University Press.</li>\n<li>Patrone, T., 2008, <em>How Kant’s Conception of Reason\nImplies a Liberal Politics: An Interpretation of the “Doctrine\nof Right”</em>, Lewiston NY: Edwin Mellen Press.</li>\n<li>Pollok, K., 2017, <em>Kant’s Theory of Normativity:\nExploring the Space of Reason</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Prauss, G., 1981, “Kants Problem der Einheit theoretischer\nund praktischer Vernunft,” <em>Kant-Studien</em>, 72(3):\n286–303.</li>\n<li>Rauscher, F., 1998, “Kant’s Two Priorities of\nPractical Reason,” <em>British Journal for the History of\nPhilosophy</em>, 6(3): 397–419.</li>\n<li>Reath, A., 1988, “Two Conceptions of the Highest Good in\nKant,” <em>Journal of the History of Philosophy</em>, 26(4):\n593–619.</li>\n<li>–––, 2013, “Formal Approaches to\nKant’s Formula of Humanity,” in <em>Kant on Practical\nJustification: Interpretive Essays</em>, S. Baiasu &amp; M. Timmons\n(eds.), Oxford: Oxford University Press, pp. 201–228.</li>\n<li>Rescher, N., 2000, <em>Kant and the Reach of Reason:</em>\n<em>Studies in Kant’s Theory of Rational Systemization</em>,\nCambridge: Cambridge University Press.</li>\n<li>Ripstein, A., 2021, <em>Kant and the Law of War</em>, New York:\nOxford University Press.</li>\n<li>Ruffing, M., 2015, “Kants ‘Stimme der\nVernunft’—Analyse einer unauffälligen\nMetapher,” in <em>Kant and the Metaphors of Reason</em>, P.\nKauark-Leite, G. Cecchinato, V. de Araujo Figuereido, M. Ruffing &amp;\nA. Serra (eds.), Hildesheim: Olms, pp. 195–204.</li>\n<li>Russell, F., 2020, “Kantian Self-Conceit and the Two Guises\nof Authority,” <em>Canadian Journal of Philosophy</em>, 50(2):\n268–83.</li>\n<li>Saner, H., 1967/73, <em>Kant’s Political Thought: Its\nOrigins and Development</em>, E. Ashton (trans.), Chicago: Chicago\nUniversity Press.</li>\n<li>Schadow, S., 2022, “Acting for a Reason. What Kant’s\nConcept of Maxims Can Tell Us about Value, Human Action, and Practical\nIdentity,” in <em>Kant’s Theory of Value</em>, C. Horn\n&amp; R. Dos Santos (eds.), Berlin: De Gruyter, pp. 65–88.</li>\n<li>Sticker, M., 2021, Rationalizing (<em>Vernünfteln</em>).\n<em>Elements in the Philosophy of Immanuel Kant</em>, Cambridge:\nCambridge University Press. doi:10.1017/9781108625661</li>\n<li>Stoddard, E., 1988, “Reason on Trial: Legal Metaphors in the\n<em>Critique of Pure Reason</em>,” <em>Philosophy and\nLiterature</em>, 12(2): 245–260.</li>\n<li>Timmermann, J., 2009, “The Unity of Reason: Kantian\nPerspectives,” in <em>Spheres of Reason</em>, S. Robertson\n(ed.), Oxford: Oxford University Press, pp. 183–198.</li>\n<li>–––, 2010, “Reversal or retreat?\nKant’s Deductions of Freedom and Morality,” in\n<em>Kant’s Critique of Practical Reason: A Critical Guide</em>,\nA. Reath &amp; J. Timmermann (eds.), Cambridge: Cambridge University\nPress, pp. 73–89.</li>\n<li>Velkley, R., 1989, <em>Freedom and the Ends of Reason: On the\nMoral Foundations of Kant’s Critical Philosophy</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>Walker, R., 1989, <em>The Coherence Theory of Truth: Realism,\nAnti-Realism, Idealism</em>, London: Routledge.</li>\n<li>Wartenberg, T., 1992, “Reason and the Practice of\nScience,” in <em>The Cambridge Companion to Kant</em>, P. Guyer\n(ed.), Cambridge: Cambridge University Press, pp. 228–248.</li>\n<li>Westphal, K., 2011, “Kant’s Moral Constructivism and\nRational Justification,” in <em>Politics and Metaphysics in\nKant</em>, S. Baiasu, S. Pihlström &amp; H. Williams (eds.),\nCardiff: University of Wales Press, pp. 28–46.</li>\n<li>Willaschek, M., 2010, “The Primacy of Practical Reason and\nthe Idea of a Practical Postulate,” in <em>Kant’s Critique\nof Practical Reason: A Critical Guide</em>, A. Reath &amp; J.\nTimmermann (eds.), Cambridge: Cambridge University Press, pp.\n168–196.</li>\n<li>Wood, A., 1970, <em>Kant’s Moral Religion</em>, Ithaca NY:\nCornell University Press.</li>\n<li>–––, 1992, Review of Onora O’Neill,\n<em>Constructions of Reason</em>, <em>Philosophical Review</em>,\n101(3): 647–650.</li>\n<li>Ypi, L., 2021, <em>The Architectonic of Reason: Purposiveness and\nSystematic Unity in Kant’s Critique of Pure Reason</em>, Oxford:\nOxford University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "autonomy: in moral and political philosophy",
            "constructivism: in metaethics",
            "Kant, Immanuel: aesthetics and teleology",
            "Kant, Immanuel: and Hume on causality",
            "Kant, Immanuel: and Hume on morality",
            "Kant, Immanuel: and Leibniz",
            "Kant, Immanuel: critique of metaphysics",
            "Kant, Immanuel: moral philosophy",
            "Kant, Immanuel: philosophy of mathematics",
            "Kant, Immanuel: philosophy of religion",
            "Kant, Immanuel: philosophy of science",
            "Kant, Immanuel: social and political philosophy",
            "moral motivation",
            "practical reason",
            "practical reason: and the structure of actions",
            "rationalism vs. empiricism",
            "rationality: instrumental",
            "reasoning: moral",
            "reasons for action: agent-neutral vs. agent-relative",
            "reasons for action: internal vs. external",
            "reasons for action: justification, motivation, explanation"
        ],
        "entry_link": [
            {
                "../autonomy-moral/": "autonomy: in moral and political philosophy"
            },
            {
                "../constructivism-metaethics/": "constructivism: in metaethics"
            },
            {
                "../kant-aesthetics/": "Kant, Immanuel: aesthetics and teleology"
            },
            {
                "../kant-hume-causality/": "Kant, Immanuel: and Hume on causality"
            },
            {
                "../kant-hume-morality/": "Kant, Immanuel: and Hume on morality"
            },
            {
                "../kant-leibniz/": "Kant, Immanuel: and Leibniz"
            },
            {
                "../kant-metaphysics/": "Kant, Immanuel: critique of metaphysics"
            },
            {
                "../kant-moral/": "Kant, Immanuel: moral philosophy"
            },
            {
                "../kant-mathematics/": "Kant, Immanuel: philosophy of mathematics"
            },
            {
                "../kant-religion/": "Kant, Immanuel: philosophy of religion"
            },
            {
                "../kant-science/": "Kant, Immanuel: philosophy of science"
            },
            {
                "../kant-social-political/": "Kant, Immanuel: social and political philosophy"
            },
            {
                "../moral-motivation/": "moral motivation"
            },
            {
                "../practical-reason/": "practical reason"
            },
            {
                "../practical-reason-action/": "practical reason: and the structure of actions"
            },
            {
                "../rationalism-empiricism/": "rationalism vs. empiricism"
            },
            {
                "../rationality-instrumental/": "rationality: instrumental"
            },
            {
                "../reasoning-moral/": "reasoning: moral"
            },
            {
                "../reasons-agent/": "reasons for action: agent-neutral vs. agent-relative"
            },
            {
                "../reasons-internal-external/": "reasons for action: internal vs. external"
            },
            {
                "../reasons-just-vs-expl/": "reasons for action: justification, motivation, explanation"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=kant-reason\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/kant-reason/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=kant-reason&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/kant-reason/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=kant-reason": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/kant-reason/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=kant-reason&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/kant-reason/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.korpora.org/\" target=\"other\">Das Bonner Kant-Korpus</a>,\n full text of the Akademie edition of Kant’s works, volumes\n1–23 (in German).",
            "<a href=\"http://www.kant-gesellschaft.de/en/\" target=\"other\">Kant-Gesellschaft</a>,\n the German Kant Society, publishers of <em>Kant-Studien</em>.",
            "<a href=\"https://northamericankantsociety.org/\" target=\"other\">North American Kant Society</a>,\n comprehensive website with current Kant-related activities.",
            "<a href=\"https://www.ukks.co.uk/\" target=\"other\">U.K. Kant Society</a>."
        ],
        "listed_links": [
            {
                "http://www.korpora.org/": "Das Bonner Kant-Korpus"
            },
            {
                "http://www.kant-gesellschaft.de/en/": "Kant-Gesellschaft"
            },
            {
                "https://northamericankantsociety.org/": "North American Kant Society"
            },
            {
                "https://www.ukks.co.uk/": "U.K. Kant Society"
            }
        ]
    }
}