{
    "url": "kant-leibniz",
    "title": "Leibniz’s Influence on Kant",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Catherine Wilson\n<cww899@gmail.com>",
        "author_links": [
            {
                "mailto:cww899%40gmail%2ecom": "cww899@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nCatherine Wilson\n&lt;<a href=\"mailto:cww899%40gmail%2ecom\"><em>cww899<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri May 21, 2004",
        "substantive revision Wed May 18, 2022"
    ],
    "preamble": "\n\nKant’s interest in the physics, metaphysics, epistemology, and\ntheology of his predecessor G.W. Leibniz is evident in his writings in\nthe philosophy of natural science as well as in the passages of the\nCritique of Pure Reason dealing with transcendental ideas and\nhis essays on history and progress. The conventional view that Kant\nsought to steer a middle course between the rationalism of\n18th century German school philosophy initiated by\nLeibniz’s follower Christian Wolff and the empiricism of David\nHume furnishes a useful point of departure for understanding\nKant’s intellectual context and his aims and intentions.\nHowever, Kant’s aim in propounding his critical philosophy was\nnot merely to transcend the stalemate of dogmatism vs. skepticism in\ngeneral epistemology, but to address what he regarded as a crisis: the\ninability of metaphysics, as taught in the Universities, to secure the\nmeta-ethical objectivity of morality and the threat to human\nconfidence and moral discipline posed by the atheism, materialism, and\nfatalism of contemporary forms of naturalism. Kant took\nLeibniz’s as a failed dogmatic enterprise in metaphysics and\nphilosophical theology, but as one that was partially redeemed by its\nparallel treatment of nature and value. He addressed the Leibnizian\ntopics of the nature of substance, the human soul and its powers,\nspace, time, and forces, mechanism and teleology, and divine creation\nin passages scattered throughout his major and minor writings.\n\nThe main features of Kant’s reception of Leibniz are surveyed\nbelow under separate headings.\n",
    "toc": [
        {
            "#Intr": "1. Introduction"
        },
        {
            "#PrinCont": "2. The Principle of Contradiction"
        },
        {
            "#IdenIndi": "3. The Identity of Indiscernibles"
        },
        {
            "#SubsMatt": "4. Substance and “Matter”"
        },
        {
            "#SpacTime": "5. Space and Time"
        },
        {
            "#PercThou": "6. Perception and Thought"
        },
        {
            "#SoulBody": "7. Soul and Body"
        },
        {
            "#FreeAgen": "8. Freedom and Agency"
        },
        {
            "#MechOrdeNatu": "9. Mechanism and the Order of Nature"
        },
        {
            "#TheoTheo": "10. Theology and Theodicy"
        },
        {
            "#EthiPoli": "11. Ethics and Politics"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimSour": "Primary Sources"
        },
        {
            "#SecoSour": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Introduction\n\nLeibniz and his follower Christian Wolff were two of Kant’s most\ncited references. At one time or another, Kant addressed all of\nLeibniz’s main doctrines, including his defense of living forces\nagainst the Cartesians, his attack on absolute space and time against\nthe Newtonians, his immaterial atomism or monadology, his theodicy,\nand his various principles and laws — the identity of\nindiscernibles, continuity, non-contradiction and sufficient reason.\nThe challenging tone towards the followers of Leibniz that the young\nKant, as an aspiring physicist and cosmologist, and later as a strong\nadvocate of free will, adopted gave way in time to a more respectful\nengagement with the philosopher himself, as Kant became an\nincreasingly determined critic of materialism.\n\nYet Kant’s attitude towards his famous predecessor, whose ideas\nwere extensively discussed in French, and later in Prussian\nintellectual circles after Leibniz’s death in 1716, never\nreaches equilibrium. This is unsurprising, for Kant’s own texts\nshow an attraction to teleological theories of the whole, as well as\nto epistemological caution. Kant describes Leibniz as one of the\ngreatest and most successful reformers of the modern era (9:32), along\nwith John Locke, and as a genius, along with Isaac Newton (7.226). Yet\nhe also refers repeatedly to the errors of the Leibnizians, whom he\nconsiders “dogmatic” philosophers. Their conviction that\nhuman reason could acquire knowledge of supersensible entities,\nincluding the soul and God, necessitated, in Kant’s view, a\n“critique.” Locke had attempted to construct a critical\nphilosophy against the Cartesians but had failed to carry his\nprogramme through. At the same time, the attacks of Locke and Hume on\nmetaphysics had “opened the door to Schwaermerei”. So\ndetermined were Kant’s contemporaries to find affirmations of\nimmortality and divine justice, that, he believed, many had turned to\nthe occult. “So much there was deceptive, that it is necessary\nto suspend the whole enterprise and to bring instead the method of the\ncritical philosophy into play. This consists of examining the process\nof reason itself, of dividing and testing the human knowledge capacity\nin order to determine how far out its boundaries may be placed”\n(9.32).\n\nThe suspension of the whole enterprise announced by Kant should not\nobscure the fact that Leibniz and Kant shared an ethico-religious\nconception of philosophy. Leibniz wrote in an era in which the\nuniversities were still dominated by Christian philosophy. Whatever\nhis private leanings towards mystical and philosophical religion, he\nbelieved that a strong and unified religious authority was essential\nto the maintenance of moral and political order, and the content of\nmorality did not strike him as problematic. Kant, though steeped in\nProtestant theology and moral philosophy, favoured the newer trend\ntowards the academic autonomy of philosophy and secular morality and\ngovernance. Yet he had to contend with the rising influence of\nmaterialism and deterministic psychology in Germany (10:145); the\nsentiment- and convention-based accounts of morality and moral\nmotivation of the British school, the attacks on metaphysics and\nconventional morals of Helvétius, La Mettrie (19:109), and\nVoltaire (15:336) and the attacks of Hume on religion and the concept\nof the soul. How could morality be reconciled with Newtonian science\nand how could the existence of ineluctable duties be established in\nthe face of the variety of human practices and customs established by\nMontesquieu and the numerous travel writers on whose accounts Kant\nrelied in compiling his lectures on Anthropology? Metaphysics could\nnot provide knowledge of the supersensible, including the existence of\nGod, the possibility of the realization of a highest good in the\nnatural world, or the ability of human beings to realize that good\nthrough their endowments. Human aspirations in this regard were\ntranscendent, futile, and “entirely vacuous” (20:\n301).\n\nFor Leibniz, the Kingdom of Nature and the Kingdom of Grace were\nparallel orders. Everything in nature happened, as Hobbes and Spinoza\nmaintained, on account of ‘mechanical’ principles. At the\nsame time, Leibniz insisted in his Principles of Nature and Grace\nbased on Reason (1714):\n\n[A]ll minds, whether of men or [spirits], entering into a kind of\nsociety with God, by virtue of reason and eternal truths, are members\nof a City of God, that is members of the perfect state, formed and\ngoverned by the greatest and best of monarchs. Here there is no crime\nwithout punishment, no good action without proportionate reward, and\nfinally as much virtue and happiness as is possible. (Ariew and\nGarber, 212)\n\n\nReferencing Leibniz, Kant adapted this dualistic scheme into his own\nscheme of transcendental ideas. In nature, everything happened accord\nto laws, though the course of the world might depend on a somewhat\nricher ontology, including lawfully-acting generative forces for the\nformation of plants and animals, than Leibniz had allowed for, forces\nthat human beings might never really understand. At the same time,\nrational beings, though not other souls or minds, formed a moral\ncommunity (see Guyer).\n\nTo view ourselves, therefore, as in the world of grace, where all\nhappiness awaits us, except insofar as we ourselves limit our share in\nit through being unworthy of happiness, is, from the practical\nstandpoint, a necessary idea of reason. (KRV A812/B840)\n\n\nIn this community, reward for having lived a morally worthy life in\nthe form of everlasting happiness was intrinsically deserved, but this\ncould only be hoped for and kept in view, not proved (KRV\nA810–18/B841–46).\n\nKant denied that the present world contained as much goodness and\nhappiness as possible. Rather, it was definitely progressing towards\ngreater cultural development, and perhaps moral development. Hope and\neffort, especially in the latter struggle where they were most needed,\nwas itself morally mandated (8:8–32). So the ‘idea of a moral\nworld’ had ‘objective reality’ as a ‘corpus\nmysticum of the rational beings in it’ even if it was only the\nsensible world viewed in a different but obligatory way.\n\nThe dogmatic metaphysicians preceding him, Kant argued, imagined that\nthey could demonstrate the truth of their doctrines in rigorous\nmathematical fashion, but metaphysical concepts lacked the precision\nand intelligibility of mathematical concepts. At the same time, they\nput their trust in intellectual intuition, which was no more certain\nthan the visionary and mystical writings of Emmanuel Swedenborg, who\nhad set down his hallucinations and angelic dictations in twelve\nvolumes of the Arcana Coelestia (1749–56), which Kant\nread in 1765 and satirized in his Dreams of a Spirit Seer in\n1766. Leibniz’s monadology exemplified both errors, for Leibniz\nthought that, merely by rationally considering the problem of the\ndivisibility of matter, he could demonstrate that the basic\nconstituents of the universe were not material particles obeying the\nlaws of mechanics, but living or at least minded beings with\nperception and appetite, acting for the good of the universe. At the\nsame time, the details of his picture of the world behind the\nappearances, incorporating slumbering monads, confused omniscience,\nand the pre-established harmony, seemed to Kant gratuitous\nfancies.\n\nWhere Leibniz rescued ethics and religion by claiming to discover a\nhidden reality of immortal, spontaneous souls forming a Kingdom of\nGrace beneath the material and causally-determined appearances, Kant\nbelieved he could accomplish the task of reconciling the scientific\nview of the world with moral aspiration and accountability by\ninvestigating the necessary preconditions of our experience. Necessary\nforms of thought such as space, time, causality and objecthood would\nthereby be distinguished from constraints embedded in reality. Though\nmaterialism is commonly associated with French Enlightenment figures,\nKant considered it an English vice as well. He associated it not\nhowever with Hobbes and Locke but with Joseph Priestley (KRV B 773;\n4:258), and he was most certainly aware of its German development\nthrough Ernst Platner and others (see Rumore). Determinism and\nmaterialism seemed to him to support a lax moral philosophy, in which\npleasure was conceived as the summum bonum, morality was conventional,\nand humans were anyway machines devoid of responsibility for their\nactions. In those not given to dissipation, skepticism and empiricism\nled, Kant thought, to a sense of moral futility, misanthropy and\ndespair. Kant was determined to attack fashionable, pessimistic, and\nlibertine philosophies, but he had to show that he rejected\nrationalist demonstration as thoroughly as any empiricist.\n\nHis manner of doing so was exceedingly elegant. Kant did not merely\nchallenge the logic of, or poke fun at the extravagances of\nLeibniz’s metaphysics, though he is not above a joke regarding\nthe monads — potential human lives — he might be\nswallowing with his morning coffee (2:327). In the antinomies section\nof the Critique of Pure Reason, he shows that, for every\n“proof” of an important metaphysical proposition, such as\ndeterminism, atomism, or the eternity of the universe, a proof of the\ncontrary proposition, such as the existence of exceptions to\nmechanical causality, infinite divisibility, or the temporal finitude\nof the world can be supplied. By attempting to prove too much, human\nrationality accomplished too little. Traditional metaphysics left\nreason perturbed, confused, and unfulfilled.\n\nAs many of Leibniz’s writings were not published until the\n19th or 20th century, an accurate assessment of\nthe relation between the Leibniz and Kant can take into account only\nthose works in circulation in the second half of the 18th\ncentury and available to Kant, his teachers and his interlocutors.\nThese comprised the Meditations on Knowledge, Truth and\nIdeas, the New System of the Nature and Communication of\nSubstances, the Specimen Dynamicum, the\nTheodicy, the Monadology and the Principles of\nNature and Grace, the Leibniz-Clarke Correspondence, and\nthe posthumous New Essays, which Kant read four years after\ntheir publication, in 1769. A collection of diverse pieces, edited by\nPierre Desmaizeaux was published in 1720; followed by the more\ncomprehensive Oeuvres philosophiques edited by Raspé\nin 1765 , and the Opera Omnia issued by Dutens in 1768.\nChristian Wolff, who may have had privileged access to some of\nLeibniz’s unpublished writings, wrote a series of textbooks\nunder the title Vernunftige Gedancken beginning in 1719,\nreformulating Leibniz’s scattered thoughts on atomism,\ndeterminism, pre-established harmony, and theodicy into scholastic\nformat, that served to bring these doctrines into prominence, as did\nsome writings of Alexander Baumgarten and G.F. Meier, Euler’s\nLetters to a German Princess (1768–1772), and Emilie du\nChatelet’s Naturlehre an Ihren Sohn which deal with\nmajor Leibnizian themes, including substance, soul-body relations, and\nthe problem of evil. If Kant brooded on Leibnizian topics, however, it\nwas not, except perhaps in the period of the controversy with J.A.\nEberhard, in which Kant was concerned to distinguish Leibniz from his\nfollowers and to champion what he saw as Leibniz’s special\nPlatonic contributions, with an eye to understanding Leibniz’s\nsystem as a whole or extracting the best possible interpretation from\nit, but rather with an eye to avoiding his errors.\n\nInsofar as Kant professed embarrassment about his pre-1770 essays, it\nmight be tempting to divide his discussion of Leibniz into a\npre-critical (before 1770) and a critical phase. Yet this division is\nnot specially illuminating, and recent scholars have questioned the\nformerly standard periodization (see the entry on\n Kant’s philosophical development).\n The True Measurement of Living Forces, (1747), the\nPhysical Monadology (1756), New Elucidation (1755),\nthe Essay on some Treatments of Optimism (1759), Negative\nQuantities (1763) and the Dreams of a Spirit-Seer (1766)\nare all technically “pre-critical,” but they are critical\nwith respect to logical, physical, and theological Leibnizian\nprinciples and doctrines. It is plausible to see the “silent\ndecade” between 1771 and 1780 as the interval in which Kant\ndecided how to manage the skeptical problem he now saw as threatening\nmorality, arriving finally at the positive philosophy in the\nCritique of Pure Reason (1781) which steers (perhaps only\ntemporarily, judging by the Opus Postumum) a middle course\nbetween visionary and mystical enthusiasm and skepticism. Kant’s\nfurther thoughts on Leibniz were developed in the Metaphysical\nFoundations of Natural Science (1786), the polemical essays,\nOn a Discovery According to which any Critique of Pure Reason has\nbeen made Superfluous by an Earlier One (1790) and What\nProgress has Metaphysics Made in Germany since the Time of Leibniz and\nWolff?(1791), and in the Critique of Judgement\n(1790).\n2. The Principle of Contradiction\n\nLeibniz gives various formulations to his Principle of Contradiction\nor Law of Identity, but the central idea is that a proposition and its\nnegation cannot both be true (G 7: 299). Leibniz hoped to be able to\nconstruct a logical calculus that would enable all significant truths\nto be demonstrated, since every concept must include, be included in,\nor exclude every other. A concept such as ‘human,’ he\nmaintained, included the concepts ‘animal,’\n‘rational,’ ‘bipedal,’ etc., so that a true\nstatement such as ‘Humans are animals’ was true in virtue\nof the inclusion of the predicate in the subject. Though the magnitude\nof Leibniz’s contribution to combinatorial mathematics and logic\nremained unknown until the twentieth century, Kant offers some\nskeptical remarks to what he takes to be the Leibnizian programme in\nSection II of the New Elucidation. Later, he offers two\nspecific criticisms of the Principle of Contradiction taken not in a\nlogical, but in an ontological sense:\n\nFirst, Kant claims, the Principle is too weak to ban nonentities from\ntheories. In Sect 28 of the Inaugural Dissertation (1770), he\ncomplains of “fictitious forces fabricated at will, which, not\nfinding any obstacle in the principle of contradiction are poured\nforth in multitudes by those of speculative mind.” These\nfictitious forces presumably included extrasensory powers of\nperception and the direct action of souls on souls. Second, the\nPrinciple of Contradiction is too strong. Leibniz’s Neoplatonic\nleanings induce him to see creatures as fragments of the divine, whose\nimperfections are mere lacks. There are, in his ontology, no beings or\nforces opposing God (Theodicy, §20). Kant’s\norientation is more Manichaean; he thinks that acceptance of the\nPrinciple leads the theorist to underrepresent the extent of conflict\nin the world and its constructive aspects. Kant insists that opposing\nforces, “hindering and counteracting processes” operate\nceaselessly in nature and in history. The opposition of attractive and\nrepulsive forces in physics produces the phenomena of matter (4: 508\nff); the opposition of good and evil principles in the human soul\nproduces morality, (6:1–190); and antagonism and conflict in\ngeopolitics produce peace and progress (6:24). Kant denies the\nLeibnizian claim that all evil follows from the limitations of\ncreatures (KRV A 273/B. 329).\n3. The Identity of Indiscernibles\n\nThe Leibnizian principle that “there are never two things in\nnature which are exactly alike and in which it is impossible to find a\ndifference that is internal or founded on an intrinsic\ndenomination” is enunciated in the Monadology (G 6:\n608), as well as in the Correspondence with Samuel Clarke (G\n7: 372). Leibniz had abandoned his earlier view that two entities\ncould be distinguished by place alone when he came to his view of real\nsubstances as infinitely complex and unique and space as ideal. Kant\nfound the Principle arbitrary. To insist that any two objects\npresented to us in experience must be qualitatively different in some\nrespect was, Kant said, to take appearances for intelligibilia (KRV A\n264/B320). We cannot have two concepts — concepts of two things\n— that are alike in all their specifications, but we can\ncertainly have two empirical objects that are exactly alike. Why\nshould we not be able to imagine two identical water droplets?\n(20:280). It is sufficient for there to be two that they present\nthemselves to us (veridically) in our visual space as two.\nLeibniz’s blunder on this score was, for Kant, an indication\nthat Leibniz had failed to grasp an important feature of sensory\nexperience, namely that it, unlike thought in general, is always\nspatial.\n4. Substance and “Matter”\n\nLeibniz’s metaphysics was developed within, and in part as a\nreaction to the mechanical philosophy of the mid-to-late 17th century,\nrevived by Galileo, Descartes, Gassendi, Boyle, Newton, and Locke.\nWhile the term “substance,” meaning the indestructible\nstuff of the universe, was retained by Descartes in his discussions of\nres extensa, the mechanical philosophers adopted a\ncorpuscularian theory in which objects were temporary aggregates of\nsolid, indestructible particles with various figures and motions, and\nmost though by no means all change occurred through their contact,\npressure, collision, entangling, and so on. Leibniz contested the\ncorpuscularian image, insisting that it was insufficiently profound\nand inherently self-contradictory (G 4: 480), and holding that matter\nwas a ‘phenomenon’ founded upon the reality of\n“metaphysical points” or, as he later termed them, monads:\nqualitatively unique,indestructible and indivisible units that also\nperceived and strove (G 6: 608).\n\nKant accused Leibniz, along with Spinoza, of ‘taking appearances\nfor things in themselves’ (KRV A264/B320). One can see his\npoint with respect to water droplets as noted, but it is nevertheless\na somewhat mixed-up claim. As Kant understood him, in failing to\ndistinguish between intellectual representation and sensory\nperception, Leibniz believed we saw aggregates of monads as empirical\nobjects. But Leibniz distinguished sharply between the everyday\nperceptual world of living beings and inanimate objects and the\ninvisible monadic order. Unextended monads were non causally\ninteracting but enjoyed (in a confusedly omniscient manner) the\nuniversal pre-established harmony of perceptions, while empirical\nhumans perceived individually subvisible empirical objects such as\nanimalcula and fine powders through causal mechanisms in a confused\nmanner (GM III:546–7; AG IV:426). But Leibniz was not clear about how\nthe unextended monads projected into a visible world and neither were\nhis later commentators. After his critical turn, Kant had decided that\n“things in themselves” that compose external reality are\nnot perceived at all. They are not in causal contact with us, though\nthey affect us in such a way that we experience a sensory world\nstructured according to the categories of time, space, causality and\nobjecthood. The impact driven, push and pull of the appearances\ntherefore did not, in Kant’s view, preclude the possibility of\nthe origination of free actions by a noumenal subject. \n\nMatter, Kant could readily agree with Leibniz, cannot be a thing in\nitself, stuff possessed of characteristics and qualities independent\nof human perception; what we call matter is an appearance (4:507). The\ntrue nature of mind-independent external reality cannot be described\nby reference to shape, contact or movement, which characterize only\nthe objects presented to us (A265–6/B 321–2). He understood\nLeibniz’s reasoning in favour of monads as follows: It is\nimpossible to conceive two material atoms as both different\nfrom one another and as simple, i.e partless; yet possible to conceive\ntwo souls that are both different and partless (20:285). Therefore, if\nsubstances are manifold and partless, they must have representational\ncapacities. The crucial error in this reasoning lay in supposing that\nour abstract conceptions are a guide to reality behind the\nspatio-temporal appearances. Yet properly understood, he maintained,\nLeibniz’s monadology was not an attempt to explain appearances\nbut the expression of a “Platonic” view of the world,\nconsidered apart from our sensory experience of it (4:507; 8:248). In\nthis regard, he did grasp that Leibniz did not after all take\nappearances for things in themselves.\n\nDespite his warnings about the limited powers of human reason, Kant\ntoo believed it possible to deduce some features of matter, as\nphysical science must theorize it, a priori. There are no\nmaterial atoms; matter is divisible to infinity and its parts are all\nmaterial (4:503f). Yet Kant recognized, first in the Physical\nMonadology, then in the Metaphysical Foundations,\nparticles in the form of centres of attractive and repulsive forces\nthat account for the space-filling property and impenetrability of\nmatter (4: 533ff). This relatively dogmatic treatment co-exists with\nhis critical claim that matter is the appearance of a perfectly\nunknown substratum. As he explains it in the Critique of Pure\nReason, the rainbow is a mere appearance relative to rain drops\nwhich, in a physical sense, are things-in-themselves and not mirages.\nYet thinking further, we realize that the raindrops too are mere\nappearances, and that “even their round form, indeed, even the\nspace through which they fall are nothing in themselves, but only mere\nmodifications or foundations of our sensible intuition; the\ntranscendental object, however, remains unknown to us.” (KRV A\n45f/B 63f). “About these appearances, further, much may be said\na priori that concerns their form but nothing whatsoever about the\nthings in themselves that may ground them.” (KRV A49/B66). This\nsuggests that the stuff which is divisible to infinity and bears\nattractive and repulsive forces is an appearance of something unknown\nand unknowable. “We can understand nothing except what brings\nwith it something in intuition corresponding to our words. When we\ncomplain that we do not see into the inner nature of things, this can\nmean no more than that we cannot grasp, through pure reason, what the\nthings that appear to us might be in themselves…. Observation\nand division with respect to the appearances take us into the interior\nof nature, and we cannot say how far this will proceed. But every\ntranscendental question that takes us beyond [perceptible] nature can\nnever be answered…” (KRV (A277f/B333f).\n5. Space and Time\n\nLeibniz held a relational theory of space and time. Without things\nthere would be no space, and without events there would be no time.\nSpace and time are not containers into which things and events may be\ninserted but which could have remained empty. In the Third Letter\nto Clarke (G 7:364), Leibniz maintains that “without the\nthings placed in it, one point of space does not absolutely differ in\nany respect whatsoever from another point of space.” An even\nmore ambitious positive proposal makes space the “order of\nco-existents” and time the “order of successions” (G\n7: 363), or a “well-founded phenomenon.”\n\nDespite his admiration for Newton, his presentation of a purported\nproof of absolute space in the essay On the Basis of the\nDifference of Regions in Space of 1768 (2: 378), and his claim in\nthe First Critique that two distinct but absolutely identical portions\nof space were possible (KRV A 264/ B320), Kant rejected absolute space\nand absolute motion in the Metaphysical Foundations of Natural\nScience. Consistently, however, he rejected Leibniz’s claim\nthat space was founded on the order of relations of substances. To the\nclaim that space emerged somehow from the underlying monadic reality\nseemed to Kant to imply that the truths of mathematics—in this\ncase three-dimensional geometry—depended on the existence of a\nworld of things and events, which was absurd. Leibniz, Kant, suggests,\nhad noticed that things appear to interact causally and to determine\none another’s behaviour. This led him to insist that space was\n“ a certain order in the community of substances, and…\ntime… the dynamic sequences of their states,” confusedly\napprehended (KRV A 275f/B 331f). However, the composition of bodies\nfrom monads as basic elements presupposes their juxtaposition in space\n(20:278). If we confusedly perceive monads as physical objects in\nspace, what would it be like to apprehend the monads distinctly as not\nin space but as the foundation of space? (4:481f)\n\nKant’s conviction that the existence of incongruent counterparts\nproved that “space in general does not belong to the properties\nor relations of things in themselves” (4: 484) is not easy to\nunderstand, but his basic argument in the 1768 essay is that\nLeibniz’s view does not enable one to distinguish between a left\nhanded glove and a right handed glove, insofar as the relations of all\nthe parts to one another are the same in both cases. Yet if God had\ncreated just one glove, it would have been one or the other. Hence\nspace does not depend on relations between things in space.\nNewton’s conception of space as a huge container does not\ncontribute to the solution of the problem: Consider a container in\nwhich a single glove is floating. Is it a right-handed glove or a\nleft-handed glove? We can insert various new items into this\nspace-container, e.g., an anorak, a scarf, a shoe, but only the\ninsertion of a human observer into the space will permit an answer.\nSpace, Kant, decides, is related to directionality or orientation. The\nhuman observer experiences himself as intersected by three planes and\nas having three sets of “sides”, which he describes as up\nand down, back and forward, and right and left. Right-handedness and\nleft-handedness are not merely anthropic concepts since nature itself\ninsists on handedness in twining plants and the shells of snails (2:\n380). But which direction is right and which is left can only be\nestablished by a conscious, embodied being. As he expresses it in the\nProlegomena, “The difference between similar and equal\nthings which are not congruent…cannot be made intelligible by\nany concept, but only by the relation to the right and left hands,\nwhich immediately refers to intuition” (4: 286). How spheroid\nbeings with hands would distinguish between “front” and\n“back” is not however clear. It is not clear whether this\norientational analysis implies that wherever there is space there must\nalso be sentient beings with pairs of incongruent parts, as well as\ntop-bottom and back-front asymmetry.\n\nIn the Inaugural Dissertation §15, Kant tries to move\nbeyond the dichotomy of taking space and time to be either substances\nor phenomena, taking space instead to belong to the\n“form”of sensible intuition. As he expresses it in the\nCritique of Pure Reason, “Space and time are [our\nsensibility’s] pure forms…” (KRV A42/B60). They are\n“merely subjective conditions of all our intuition.”\n(ibid., A 49/B 66). [See the entry on\n Kant’s views on space and time.]\n\nFor Leibniz, each monad experiences an individual succession of\nappetites and experiences that God has endowed it with from the\ncreation of the world. Being fated in this way, though acting always\nunder their own “spontaneous” power, the monads would seem\nto be deprived of meaningful agency and beneficiaries or victims of\nseemingly unjust rewards and punishments. Kant believed that locating\nspace and time in us rather than in the world was an absolute barrier\nagainst the determinism that threatened the notion of moral\nresponsibility (A 5:97–8; 102).\n6. Perception and Thought\n\nKant’s rejection of Leibniz’s Principle of the Identity of\nIndiscernibles is related to his complaint that the Leibnizians\ntreated perception and thought as a single representational faculty\nthat was “logically” (by which Kant meant\n“qualitatively”) distinguished in terms of the clarity of\nthe representation, rather than “transcendentally.” With\ntheir theory of a single cognitive faculty, Kant maintained, Leibniz\nand Wolff “abolished the distinction between phenomena and\nnoumena to the great detriment of philosophy.” Leibniz treated\nthe senses according to Kant as an inferior mode of cognition, the\nsenses having only the “despicable task” of confusing and\ndistorting the representations of reason (KRV B. 332).\n\nThe basis of this accusation was Leibniz’s attribution to the\nsoul of only two basic faculties: perception, the representation of\nmultiplicity in a simple soul, and appetition, which he defines as\n“the action of an internal principle which brings about change\nor the passage from one perception to another” (G 6:\n608–9). Perceptions, in Leibniz, as in Descartes, are thoughts\n— presentations in the mind. The perceptual thought that there\nis a green tree in front of me is not absolutely unlike the\nmathematical thought that triangles have three angles. Perception of\nmaterial objects is “confused” because — according\nto the Cartesian tradition — corporeal substance has no colours\nor other sensory properties — which come into being through the\ninteraction of the mind and tiny, single imperceptible, uncoloured\ncorpuscles of matter. Though Leibniz denied the existence of purely\nmaterial corpuscles and the possibility of causal influx or even\ninteraction between real substances, he agreed that, from the\nperspective of what he sometimes terms mere physical science,\nperception required interaction, and that corpuscular motions were\ninvolved in the perception of sensory qualities such as light and\ncolour. Perception can therefore be said to confuse what reason\ndelivers to us clearly (A 132, 219, 403). Though we are unable to\ngrasp the sufficient reason of particular colours, there is nothing\narbitrary in their connection with their underlying causes (A\n382f).\n\nLeibniz’s interpreters, Wolff and Baumgarten, enunciate more\ndogmatically the theory that there is a single faculty of\nrepresentation in the soul, with perception and cognition\ncorresponding to its lower and higher parts. It was this view that\nKant presented as entirely opposed to his own teaching with regard to\nthe faculties of the soul. Sensibility, for Kant, is the\n“receptivity of the subject by which it is possible for the\nsubject’s own representative state to be affected in a\nparticular way by the presence of some object.” Thought is\n“the faculty of the subject by which it has the power to\nrepresent things which cannot by their own quality come before the\nsense of that subject” (2:392). Thought implies an ability to\nexperience representations of another type not involving the forms of\nsensibility — space, time, and causality. Spatio-temporal\nfeatures are attached to all our perceptions and to our perceptual\nthoughts, but not to the concepts we entertain descriptively. We can\nthink of things in themselves, and even of God, the soul, and\nother such entities, acknowledging their existence and even their\npowers, but we do not perceive them and we cannot represent them in\nsensuous form.\n\nIn his late philosophy, Leibniz distinguished between “simple\nmonads,” which despite their representational and appetitive\nfaculties, merely experienced something like our swoons and dreamless\nsleeps; “souls,” belonging to animals with sensory organs\nthat had awareness of an environment and desires; and\n“spirits,” who were able to grasp necessary truths and\nexperience more complex appetitions such as desiring the good (G 6:\n610–12). All monads, according to Leibniz, are confusedly\nomniscient (G 6: 604). Kant was scornful of what he regarded as\ntranscendental reverie. The “slumbering monad” with its\ndim presentations, is, he complains, “not explained, but\nmade-up” (2.277). The notion that the slumbering monads might\nawake to climb the ladder of awareness recalls, he said, “a kind\nof enchanted world” (20:285). However, Kant was favourably\ndisposed, at least in his early years, towards Leibniz’s\ndoctrine of confused omniscience, and he essentially accepts\nLeibniz’s conception of the mind as innately stocked with, as\nLeibniz expresses it, “inclinations, dispositions, tendencies or\nnatural potentials” (A 52). In his early essay on Negative\nQuantities, Kant remarks “There is something great and I\nthink, very correct in Leibniz’s notion that the soul embraces\nthe entire universe with its representational powers, although only an\ninfinitely small part of this representation is\nclear……Outer things can carry the condition of their\npresentation, but not the force to bring themselves into existence for\nus. The powers of thought of the soul must have real\ngrounds…” (2.199). Though Kant later professed\nagnosticism as to whether perception and mentality in general were\nexplicable mechanically, the emphasis on the active powers of the mind\nby contrast with the passivity of matter remains important in his\ntheory of mind.\n\nThe distinction between perception and thought signaled Kant’s\nbreak with rationalist metaphysics but enabled him to deploy a\ndivide-and-conquer strategy against dogmatic claims. By showing how\neach mode of apprehension involved certain necessary and distinct\nlimitations on its employment, Kant was able to show that certain\nkinds of assertion in theology and metaphysics could not be genuine\nknowledge-claims. Perception was limited by the kinds of bodies we had\nand the manner in which we could be affected by external objects. We\ncould not acquire scientific knowledge of the origins of the universe,\nor of our condition after death. Pure reason could not fill in details\nthat were beyond all possible experience. The claims of metaphysics\nhad to be synthetic, informative and not true by definition, yet a\npriori true. Arithmetic and geometry supplied synthetic a\npriori truths in abundance, and natural science supplied\nsynthetic a posteriori truths, as well as exhibiting\nsynthetic a priori propositions, such as the conservation of\nforce.\n\nAlready in his prize essay of 1764, the Investigation of the\nIntelligibility of the Fundamental Principles of Natural Theology and\nMorals, Kant claimed that moral and theological principles were\nnot capable of demonstration, since their terms, unlike mathematical\nterms, lacked precise definition. Geometrical concepts lend themselves\nto use in demonstrations because they are constructed and presented to\nintuition, which is impossible with respect to metaphysical concepts\nsuch as the soul. In the Critique of Pure Reason, he says:\n“If anyone were to pose the question to me: What is the\nconstitution of a thing that thinks? then I do not know the least\nthing to answer a priori, because the answer ought to be\nsynthetic…But for every synthetic solution, intuition is\nnecessary; but this is entirely left out of so universal a\nproblem” (KRV A 398). The Prolegomena returns to the\nquestion how metaphysics can, like natural science and mathematics,\nemploy synthetic judgments when its concepts are not given in\nexperience and are not constructed. Kant’s answer is that\nmetaphysical judgments do not point to objects existing beyond all\npossible experience, but posit objects needed to\n“complete” our understanding, that is, to make our\nthinking systematic and untroubled by gaps and aporias. The soul is\nnot a supersensible object of whose faculties and powers we can\nacquire knowledge but an idea that makes our practice of ascribing\nexperiences to ourselves intelligible.\n7. Soul and Body\n\nFor Leibniz, “I” am a substance, and my mind, as a\n“dominant monad,” rules over, or expresses more distinctly\nthan they do,the subordinate monads composing my body. Thus all\nhappenings in all parts of the body are felt distinctly or\nindistinctly, the sensory organs collect and concentrate the\nimpressions of the external world, and the soul experiences them.\nThough commentators disagree over whether the referent of\n“I” is a corporeal substance — a soul-body composite\n— since Leibniz did not believe separated souls without organic\nbodies were possible — or, alternatively, a single dominant\nmonad, an immaterial substance outside space and time, “I”\nassuredly named a thing that was indivisible and imperishable (G 6:\n598–600). Kant eschews dogmatism both with respect to whether\nthe soul is an immaterial substance and whether it is immortal. The\nuse of the term “I” presupposes that my thoughts and\nperceptions are experienced as bound up together and as belonging to a\nsingle entity. Matter, with its properties of extension,\nimpenetrability, etc., cannot be conceived as producing thought. But\nmatter is only an appearance; whatever supersensible thing it is that\ngives rise to the appearance of matter, that thing may well be the\nsame as whatever supersensible thing it is that gives rise to the\nexperience of an experiencing self (KRV A 358f/B 428f).\n\nLeibniz’s theory of soul-body pre-established harmony set out in\nhis New System of the Nature and the Communication of\nSubstances of 1695 is not easy to reconcile with the\ninterpretation of his monadology according to which what we call\nbodies are appearances in visual space founded upon spiritual\nsubstances lying underneath the spatio-temporal order. Yet the\npre-established harmony was at least consistent with Leibniz’s\nclaim that substances do not interact with one another and that what\nwe call “causal interaction” does not involve a flow of\npower or force, but merely a regular sequence of changes in two\nobservable things, in the case of mind and body, the experiences of\nperception and appetition and states of the sensory organs (G\n4:76–7). Kant points to the tension between the theory of\npre-established harmony and the monadology; “Why should one\nadmit bodies, if it is possible that everything happens in the soul as\na result of its own powers, which would run the same course even if\nentirely isolated?” (8:249).\n\nKant initially preferred “influx” theories of soul-body\nrelations to the “parallelist” theories of occasionalism\nand pre-established harmony, but he eventually decided that dualism\nwas incoherent. Already in the Measurement of Living Forces,\nhe was grappling with the problem of the location of the soul and the\nnature of its action. Anatomists had long speculated that some region\nof the brain, e.g., the pineal gland (Descartes 1650) or the corpus\ncallosum (Euler 1763), was the site of interaction between soul and\nbody. For a time, Kant seems to have believed that souls were\npositioned in space and could act outside themselves and be acted upon\nby bodies. Later he became convinced that souls were not localized in\nspace, though they could effect changes, deciding that that neither\nmedicine nor metaphysics could illuminate the question. He denies that\nwe can understand the entry of the soul into body at conception or its\nrelation to the body throughout life, or its exit and separate\nexistence after death. Because all our experience is experience of\nourselves as living beings — when soul and body are bound\ntogether — we cannot know what a separated soul would\nexperience. Leibniz compared existence after death to a deep sleep or\na swoon, but to investigate these matters is, Kant says, like standing\nbefore a mirror with your eyes closed to see what you look like when\nyou are asleep (20:309).\n8. Freedom and Agency\n\nLeibniz believed that every phenomenon could be explained. His\nPrinciple of Sufficient Reason states that “nothing takes place\nwithout a sufficient reason; in other words,…nothing occurs for\nwhich it would be impossible for someone who has enough knowledge of\nthings to give a reason adequate to determine why the thing is as it\nis and not otherwise.” Though not everything possible happens\n(and, therefore not everything that happens is necessary), everything\nthat happens has a sufficient reason in an antecedent state of the\nworld. God’s necessary existence is the only state of affairs\nthat is caused and does not have a sufficient reason in an antecedent\nstate. Not only does everything have a sufficient reason, but all\nphenomena and events, including celestial motions, the formation of\nplant and animal bodies, and the processes of life, are regulated by\nthe laws of mechanics, as the movements of the hands are regulated in\na watch (G 7:417–8).\n\nLeibniz’s Principle was incompatible with the existence of an\nopen future and with free will. His followers recognized this aspect\nof his system, though his Discourse on Metaphysics, in which\ndeterminism is tied to his inclusion theory of predicate-subject\nrelations remained unpublished until the twentieth century. Though\nLeibniz tried to avoid contradicting the theological dogma of free\nwill outright, he denied that any creature could choose between\nalternatives to which it was indifferent, and he agreed with Locke\nthat we are powerfully and necessarily motivated by disquiet and\nrestlessness, which are, in Leibniz’s view, sometimes\nunconscious or subliminal (A 188f). My body is a machine in a wider\nmechanical system, and my thoughts and desires, including my\n“petites perceptions,” cannot but harmonize with or\nparallel states of that machine. “The organized mass in which\nthe point of view of the soul is located, being expressed more\nimmediately by it, [is] reciprocally ready to act on her account\nfollowing the laws of the corporeal machine, at the moment when the\nsoul wills it, without one disturbing the laws of other, the animal\nspirits and blood taking on, exactly the motions required to\ncorrespond to the passions and the perceptions of the soul” (G\n4: 484). Yet, for Leibniz, the infinite complexity and uniqueness of\nany living machine make human actions unpredictable, and the truth of\ndeterminism is consistent with our experiences of self-control,\nself-management, and behavioural reform (A 195f). For a variety of\nreasons, Leibniz did not see determinism or mechanism as a threat to\nmorality.\n\nKant did. His perception was facilitated by a series of attacks on\nLeibniz’s disciple Christian Wolff by theologians alarmed by\nwhat they saw as the horrific consequences of Sufficient Reason,\nattacks that led to Wolff’s banishment from the University at\nHalle. Leibniz’s “spiritual automaton,” moved by its\npresentations, has a freedom, Kant claims in his second critique, the\nCritique of Practical Reason, that is only\n“psychological and comparative.” If Leibniz is right, we\nhave no more than a “freedom of the turnspit” (5: 97),\nwound up to run by itself. In that case, Kant thought, man is a\n“marionette” (5:101), and morality is but a figment of the\nimagination. To know that the moral law is not a figment and is\ngenuinely binding, it might seem that we would have to know that we\nhave the power to redirect the forces of nature. Of course we cannot\nknow this, but, on the other hand, we cannot prove that no such power\nexists. [See the entry on\n Kant\n (Sect 5.2) and the entry on\n Kant’s moral philosophy\n (Sect. 10).]\n\nReason presents compelling arguments for the inevitable nature of\nevery event. Reason also presents compelling arguments that the human\nwill can influence the course of nature (KRV A 445/B 473). The\nantinomy is dissolved, Kant now maintains, by recognizing that causal\nrelations must structure outward phenomena. Our investigations of\nnature presuppose that they do, insofar as they are scientific. Human\nagency is not, however, an outward phenomenon, and the assumption of\ndeterminism is not required. We can view ourselves as machines,\nresponding to the environment in predetermined ways. However, we are\nnot compelled to do so, and we are able to regard ourselves as agents\nwho initiate trains of events, and who can resist (not just experience\nresistance to) the desires, sensations, and impulses driving the\nbodily machine to certain actions. Since we can do so, Kant decides,\nwe should: we need not in that case be driven to or fall into\nlibertinage on the basis of speculative doctrine. What reason cannot\nsettle theoretically, she can nevertheless decide on\n“practical” grounds, i.e., deciding to believe one thing\nrather than another to preserve satisfaction (by contrast with anxiety\nand despair), and to give support to our sense that morality is not a\nfigment. We ought therefore to conceptualize our possession of free\nwill as an exemption from the laws of nature; the power of\n“doing and forbearing.” (5: 95).\n9. Mechanism and the Order of Nature\n\nKant was perturbed by Hume’s criticisms of causal relations in\nnature, implying that there were no laws of nature for science to rely\non, and by the antitheological application Hume made of his causal\nskepticism in the Dialogues Concerning Natural Religion. [See\nthe entry on\n Kant and Hume on causality.]\n He sought a third way between the Leibnizian “dogmatic”\nassumption that the universe is a single mechanical system of\ndeterministically interacting physical parts, designed and set going\nby God, and the empiricist assumption that causality corresponds to a\nhuman feeling of anticipation with respect to some sequence of ideas.\nFor scientific purposes, Kant thought, we must represent inorganic\nnature to ourselves as just such a unified mechanical system. The\nresolve to represent it as such is facilitated (or perhaps dictated?)\nby our inability to experience a world unstructured by spatial,\ntemporal, and causal relations. If Leibniz erred by ascribing to\nunknown noumena the properties of causal closure belonging to\nphenomena, Hume erred by being unaware of the inbuilt constraints on\nour representational capacity. But must we represent only inorganic\nnature — stones, stars, nebulae, planets, billiard balls —\nas a set of mechanically interacting mechanical systems, or\nearth’s plants and animals as well? Leibniz was fully committed\nto the Cartesian claim that plants and animals are machines, no\ndifferent in principle from automata built from wood and metal parts;\nthough, impressed by the detail revealed by the early microscope, he\ndescribed them as infinitely complex machines, “machines in\ntheir smallest parts, into infinity” (G 6: 618), another\nindication of the divine origins of nature. Generation and growth were\non his view, mechanical processes, for, according to the doctrine of\npreformation, which he shared with Malebranche, generation is just\ngrowth.\n\nKant was not so sure. By the late 18th century, the theory\nof inorganic nature, thanks to Laplace, Black, Priestley, Franklin,\nand other chemists and electricians was flourishing, but so too was\nthe study of physiology, embryology, and natural history, thanks\nespecially to Bourguet, Boerhaave, Haller, and Buffon. Newtonian\nforces acting over a distance were no longer seen as incompatible with\na commitment to mechanism, opening the door to the supposition of\nvital forces that might act in a lawlike fashion. Preformation was no\nlonger a credible doctrine; the possibility of self-assembling\n“organic molecules,” working according to “organic\nmechanism,” was much discussed. Epigenesis reduced the need for\na divine creator. Kant addresses the ensuing intellectual-theological\ncrisis in the Critique of Judgment, a two-part essay dealing\nwith beauty, beautiful forms in nature, and forms in nature generally.\nHe tries to show that we are caught up in an antinomy. We are strongly\ndisposed to view visible nature as a unity in which a single set of\nmechanical forces operates, not to divide it into an inorganic realm\nthat came to be by the forces inherent in nature and an organic realm\nof plants and animals evidencing design and supernatural creation. Yet\nwe cannot envision explaining generation or organic growth\nmechanistically. The solution to the dilemma is to adopt teleology as\na regulative principle. We should not positively declare that organic\nbeings could not have arisen and cannot reproduce themselves from the\nforces of nature, or that God must have a hand in their genesis;\nnevertheless, in investigating them, we look for the function and\ninterrelation of parts, as though they were designed and built\nintelligently (5: 416ff). The claim that the parts of a living\ncreature are organized in infinitum as Leibniz supposed is\nhowever, “something that cannot be thought at all.” (KRV A\n526/B 554).\n\nLeibniz was often mistakenly credited in the 18th century\nwith the view that organic nature contained no gaps, i.e., between any\ntwo different-looking organisms, another can be found. Though such a\nview might seem consistent with Leibniz’s Principle of Plenitude\n— that the universe is as full as possible — and his Law\nof Continuity — his denial that nature makes leaps (GM 6: 240)\n— it is inconsistent with his view that not everything possible\nexists, but only what is compossible with other existents, and Leibniz\nheld no such view in any case. Kant describes the idea of perfect\ncontinuity in any case as mere intellectual prejudice, since\nobservation of nature does not objectively support it. However, he\nallows the “law of the ladder of continuity among\ncreatures” has regulative importance in natural history (KRV A\n668/ B 696).\n10. Theology and Theodicy\n\nLeibniz’s philosophy is theocratic. God is a king, and the world\nis his kingdom. Ours is the best of all possible worlds, with respect\nto variety, order, location, place, time, efficiency, and “the\nmost power, knowledge, the greatest happiness and goodness in created\nthings” (G 6: 603). For God can choose to realize any world he\nwishes, and it would be inconsistent with his goodness and power to\nrealize a world that is not as good as possible. Our world metes out\njustice for all in the hereafter and is constantly improving. The\n“kingdom of nature,” in which everything happens for\nmechanical reasons, is at the same time, a “kingdom of\ngrace” in which everything that happens exemplifies God’s\nwisdom and justice (G 6:622). Yet, though Leibniz maintained\nfrequently that the order and regularity of nature hinted at or\npointed to a divine creative hand, and suggested that the existence of\nanything at all implied the existence of a necessary being (G 4: 106),\nhe produced only one actual argument for the existence of God. This\nwas a version of Anselm’s ontological argument. Leibniz\nmaintained that God’s existence could be deduced from the\nmaximal concept of God as the sum of all perfections, only if it was\nfirst demonstrated that God was a possible, not an impossible object.\nCertain maximal concepts, such as “the greatest speed”\nare, he pointed out, fundamentally incoherent, and the term denotes\nnothing (G 4: 359–60). Leibniz saw nothing incoherent in the\nmaximal notion of “the most perfect being” and concluded\nthat God existed. It was unclear however, why, so long as God is\npossible, the Ontological Argument survives the familiar criticisms of\nAquinas. The inference from possibility to necessity seems to depend\nless on the logic of concepts than on Leibniz’s esoteric idea\nthat concepts, or possible objects, strive to come into existence with\na tendency to exist proportional to their perfection (G 7:303).\n\nKant criticized arguments for God’s existence (presumably\nbrought to his attention through Wolff’s Theologia\nNaturalis) that departed from the premise that the concept of God\nis noncontradictory as fallacious hyperrationalism. The Leibnizian\nargument rested, he thought, on the uncritical notion that every\nnoncontradictory concept was a possible thing (20:302), though it is\nunclear why he attacks this claim in particular. Kant did not think\nany rationalistic proofs for the existence of God actually worked,\nthough, at least before the mauling it received at the hands of Hume,\nhe considered the physico-theological argument the best available. He\nnoted perceptively the arbitrariness of merging into one theological\nidea a creator and a judge. Without revelation, we might be drawn to\nthe ideas of a creator God, but why would we suppose this same being\nto have the power of reward and punishment after death? Taking a page\nfrom Locke, Kant decided that, since the existence of God was\nunknowable, philosophical effort should be directed to the idea of\nGod, especially the separate functions that the idea of God plays in\nregulating our moral conduct ( judge concept) and our mode of address\nto the problems of form and function in the organic realm (creator\nconcept). The distinction between the realm of grace and the realm of\nnature, one standing under moral laws of reward and punishment, the\nother under natural laws, Kant describes as a “practically\nnecessary idea of reason” (KRV A 812 f/B 840). We conceive the\nworld both as a community of active spirits, willing and representing,\nand as an aggregate of objects in mechanical interplay and shift\nperspectives as needed.\n\nPhysical and increasingly moral evil were topics much discussed in the\n18th century, and pessimism over the condition of the world,\nespecially its violence and suffering, was understood to be a tempting\nyet in some ways deplorable option.. As befit a celebrated optimist,\nLeibniz had a sanguine view of human beings. Most of us, he appeared\nto think, are morally decent people, and evil men are best dealt with\nby good laws and effective legal institutions. A good education and\nsome degree of censorship are also helpful. Posthumous divine\nretribution will take care of what human institutions cannot. Leibniz\nexplained the appearance of evil in the world as consistent with\nGod’s goodness in various ways. He claimed that evil derives\nfrom the portion of inertia or nullity present in all non-divine\ncreation; that it is a necessary accompaniment of good, or a stimulus\nto action, that it is an illusion based on narrow or temporally\nlimited experience (G 4: 120f, 196, 231). Moreover, the world has not\ndeclined since the Fall, but, on the contrary, the entire universe\n“takes part in a perpetual and most free progress, so that it is\nalways advancing toward greater culture (cultivation)” (G 7:\n308).\n\nTaken to ridiculous lengths by Wolff, Leibnizian optimism was targeted\nand satirized by Voltaire, who, however, took the problem of evil\nseriously. Kant as well was little inclined to make fun of evil and\nsuffering, and he viewed liberation from theology as a precondition of\nbetter morals and politics. There are both optimistic and pessimistic\nstrains in his philosophy. In his pre-critical writings, the Nova\nDilucidatio and the Essay on Some Considerations on\nOptimism, he seemed inclined towards the best of all possible\nworlds position, but in his critical period he denied that cosmic\njustice is an item of knowledge. The conviction that moral goodness\nnot only deserves reward but is rewarded is nevertheless an article of\nfaith and hope that sustains morality.\n11. Ethics and Politics\n\nKant’s ethics and political theory overlap with but also depart\nfrom Leibniz’s. Leibniz argued that justice requires not only\nthat one forebear from harming others or giving them cause for\ncomplaint; justice also requires helping them by seeking their good\nand preventing evil when doing so is not too difficult. (Riley ed.\n53–5). He suggested a variety of social improvements and measures for\nthe remediation of poverty and anticipated the universalist\nformulations of Kant’s maxim-test from the Groundwork.\n“Put yourself in the place of another, and you will have the\ntrue point of view for judging what is just or not.” Although it\nis ‘impossible to act so that the whole world is content,’\nthe affected ones can be made as content as possible (Riley ed. 56–7).\nKant’s ethics by contrast does not make the enhancement of\nwelfare or the avoidance of harm criteria of moral goodness or\nrectitude, though some commentators would insist that his\nuniversalization test implicitly depends on such criteria. He\nacknowledges a traditional duty to benevolence but gives no\nsocio-political examples of welfare policies and shows himself\ndistinctly sceptical about what he considered exaggerated,\ntender-hearted utilitarianism (25:504–5). \n\nLeibniz considered some forms of slavery just, insofar as some humans\nwere similar to dumb, ineducable animals, and because slavery is\ncontingent and temporary because life is eternal (Riley, 78). Kant\ninsisted on a sharper animal-human divide, was not sure about\nimmortality, but he considered only the enslavement of criminals just\n(6: 332–3). American aboriginals and Africans are also described as\n‘fit only to be slaves’ (XV:181). The inferior races would\ndie out or be exterminated ( (XV: 878). White, male, Christian\nEuropeans could, he hoped, in time bring civilization to the entire\nworld. Leibniz’s early views were no more savoury;\n‘barbarians,’ whom he considered ‘beasts’ (see\nPerkins, 111), could be destroyed in order to civilize them.\nLeibniz’s racism reflects the snobbery of the courtier, which is\nat any rate courteous to women, while the Kantian tendency to\npathologize the other flowed rather from an excess of moral fervour\nand his vigorous antifeminism. True to his rejection of the Principle\nof Contradiction, Kant saw the human soul as the battleground of\nanimalistic instincts vs. moral duties. Self-indulgence, credulity,\nand indolence, which were unfortunately built into the character of\nwomen and nonEuropeans were to be combated by moral rectitude,\neducation and critique, and industry. \n\nYet the deprivations that had to be endured by a person of strong\nmoral fibre exercising a good will were, Kant recognized, real\ndeprivations. If the struggle for self-mastery and self-improvement\nthat he urged on his readers was not to seem, and indeed to be a\npointless exercise, then knowledge, as he expressed it in the Preface\nto the second edition of the Critique of Pure Reason, had to\nbe denied in order to make room for faith (B xxx). Alarmed by colonial\ndepredations, Kant nevertheless saw social and geopolitical conflict\nas necessary, at least until his second thoughts in his 1795 essay on\n‘Perpetual Peace’. Like Leibniz, he tried to find\nredeeming aspects to group aggression and interracial conflict as\npreconditions of pacification, civilization, and progress. His own\nconcept of development, of the unfolding of latent potentials, is\ncentral to his anthropology and his philosophy of history. Development\nwas, however, as much of a duty as an inevitability. He accepted\nLeibniz’s teleology of history: “We should be content with\nprovidence and with the course of human affairs as a whole, which does\nnot begin with good and then proceed to evil, but develops gradually\nfrom worse to better…” (8:123). In his 1795 work, he\narrived at the view that warfare was a scourge that would eliminate\nitself when exhausted and enlightened people would finally refuse to\nfinance the rivalries and glory of princes. Leibniz, too, even more\ndependent than Kant on the favour of rulers, seems to have abandoned\nhis earlier militarism in old age (see Wilson). \n\nFor Kant, philosophy is a stern discipline frequently calling for\ngraceless prose. After publishing several floridly written popular\nworks, and after acquiring his knowledge of physics through such\naccessible expositions as Bernard Fontenelle’s Dialogues on\nthe Plurality of Worlds (1696), Emilie du Chatelet’s\nInstitutions of Physics (1740), and Euler’s Letters\nto a German Princess (1768–72) (7:229–30), Kant\ntraded literary charm for technicality, rigor, and repetition,\nespecially in the first two Critiques. The enchanting views\nof the Monadology which Leibniz himself may have regarded as\na jeu d’esprit were antithetical to philosophy’s true\npurpose. Yet Kant finally aestheticizes Leibniz, claiming that he\nmeant only to express a view of the world that is true in its own way.\nThe history of philosophy, Kant suggests, is not to be assessed in\nterms of right and wrong doctrines. To accuse Leibniz or Plato of\nerrors is to take them as authorities, as one takes Cicero as the\nstandard for Latin, and this is a confusion; for “there are no\nclassical authors in Philosophy” (8: 218).\n",
    "bibliography": {
        "categories": [
            "Primary Sources",
            "Secondary Sources"
        ],
        "cat_ref_text": {
            "Primary Sources": [
                "</h3>\n<ul>",
                "References to Leibniz’s texts are to C.I. Gerhardt, ed.,\n<em>Die Philosophische Schriften von Leibniz</em>, 7 vols.,\nHildesheim: Olms, 1965.",
                "Page references to the <em>New Essays</em> cited as\n“A” are to volume IV Reihe 6 of the still incomplete\nAcademy edition of Gottfried Wilhelm Leibniz: <em>Sametliche Schriften\nund Briefe</em>, ed. Akademie der Wissenschaften, Berlin:\nAkademie-Verlag, 1923–.",
                "References to Ariew and Garber are to <em>G.W. Leibniz:\nPhilosophical Essays</em>, Roger Ariew and Daniel Garber (tr. and\ned.), Indianapolis, Hackett, 1989.",
                "References to Riley are to Patrick Riley (tr. and\ned.), <em>Leibniz: Political Writings</em>, Cambridge: Cambridge\nUniversity Press, 1988.",
                "References to Kant’s texts follow the Academy edition\n(Gesammelte Schriften, ed., Akademie der Wissenschaften, Berlin:\nReimer, de Gruyter, 1900–) by volume and page.",
                "References to the <em>Critique of Pure Reason</em> (KRV) are to\nthe first (A) and second (B) edition. Where the current English\ntranslation, tr. and ed. by Paul Guyer and Allen W. Wood, Cambridge:\nCambridge University Press, 1998, was directly cited, it is noted as\nCPR. \n</ul>\n<h3 id=\"SecoSour\">"
            ],
            "Secondary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Allison, Henry (ed.), 1973, <em>The Kant-Eberhard\nControversy</em>, Baltimore: Johns Hopkins University Press.",
                "Beck, Lewis White, 1969, <em>Early German Philosophy: Kant and his\nPredecessors</em>, Cambridge MA: Harvard University Press.",
                "Brandt, Reinhard, 1999, <em>Kommentar zu Kants “Anthropologie in\npragmatischer Hinsicht</em>”, Hamburg: Felix Meiner.",
                "Butts, Robert, 1984, <em>Kant and the Double Government\nMethodology</em>, Dordrecht: D. Reidel.",
                "Fonnesu, Luca, 2008, “The Problem of Theodicy,” in\n<em>The Cambridge History of Eighteenth Century Philosophy</em>\n(Volume 2), Knud Haakonssen (ed.), Cambridge: Cambridge University\nPress, 749–778.",
                "Friedman, Michael, 2013, <em>Kant’s Construction of\nNature</em>, Cambridge: Cambridge University Press.",
                "Goldenbaum, Ursula, 2021, “How Kant was Never a Wolffian,\nor, Estimating Forces to Enforce Influxus Physicus,” in Brandon\nC. Look (ed.), <em>Leibniz and Kant</em>, Oxford: Oxford University\nPress, 27–56.",
                "Guyer, Paul, 2011, “Kantian Communities,” in Charlton\nPayne and Lucas Thorpe (eds.), <em>Kant and the Concept of\nCommunity</em>, Rochester: University of Rochester Press, 88–120.",
                "Hagengruber, Ruth, 2019, “Émilie Du Châtelet\nzwischen Leibniz und Kant,” in Ruthe Hagengruber and Hartmut\nHecht (eds.), <em>Emilie Du Châtelet und die deutsche\nAufklärung</em>. Springer VS, Wiesbaden, 173–195.",
                "Jauernig, Anja, 2008, “Kant’s Critique of the\nLeibnizian Philosophy: contra the Leibnizians, but pro Leibniz,”\nin Daniel Garber and Beatrice Longuenesse (eds.), <em>Kant and the\nEarly Moderns</em>, Princeton: Princeton University Press, pp.\n41–63.",
                "Kleingeld, Pauline, 2007, “Kant’s Second Thoughts on\nRace,” <em>Philosophical Quarterly</em>, 57: 573–92.",
                "Laywine, Alison, 2021, “Leibniz and the Transcendental\nDeduction,” in Brandon C. Look (ed.), <em>Leibniz and Kant</em>,\nOxford: Oxford University Press, 112–141.",
                "Look, Brandon C., 2021, “Kant’s Leibniz: A Historical and\nPhilosophical Study,” in Brandon C. Look (ed.), <em>Leibniz and\nKant</em>, Oxford: Oxford University Press, 1–26.",
                "Massimi, Michaela and Angela Breitenbach (eds.), 2017, <em>Kant\nand the Laws of Nature</em>, Cambridge: Cambridge University Press.",
                "Menzer, Paul, 1911, <em>Kants Lehre von der Entwicklung in Natur\nund Geschichte</em>, Berlin: De Gruyter.",
                "Mittelstrass, Juergen, 1985, “Leibniz and Kant on\nMathematical and Philosophical Knowledge,” in Kathleen Okruhlik\nand James Robert Brown (eds.), <em>The Natural Philosophy of\nLeibniz</em>, Dordrecht: Reidel, 227–262.",
                "Paull, R. Cranston, 1992, “Leibniz and the Miracle of\nFreedom,” <em>Noûs</em>, 26(2): 218–35.",
                "Rateau, Paul, 2009, <em>L’Idee de Theodicee de Leibniz a\nKant. Heritage, Transformations, Critiques</em>, Wiesbaden:\nSteiner.",
                "Rescher, Nicholas, 2013, “Leibniz and the World’s\nImprovability,” in <em>On Leibniz</em>, Pittsburgh: Pittsburgh\nUniversity Press.",
                "Rumore, Paula, 2016, “Mechanism and Materialism in early\nModern German Philosophy,” in <em>Varieties of Early Modern\nMaterialism</em>, Falk Wunderlich and Patricia Springborg (eds.),\n<em>British Journal for the History of Philosophy</em>, 24(5): 917–39.",
                "Rusnock, Paul and George, Rolf, 1995, “A Last Shot at Kant\nand Incongruent Counterparts,” <em>Kant-Studien</em>, 86:\n257–277.",
                "Sassen, Brigitte, 2015, “18th Century German Philosophy\nPrior to Kant,” <em>The Stanford Encyclopedia of Philosophy</em>\n(Summer 2015 Edition), Edward N. Zalta (ed.),\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2015/entries/18thGerman-preKant/\">https://plato.stanford.edu/archives/sum2015/entries/18thGerman-preKant/</a>&gt;.",
                "Schonrich, Gerhard, 1992, “Zahmung des Bosen? Uberlegungen\nzu Kant vor dem Hintergrund der Leibnizschen Theodizee,”\n<em>Zeitschrift fuerphilosophische Forschung</em>, 46: 205–223.",
                "Tonelli, Giorgio, 1974, “Leibniz on Innate Ideas and the\nEarly Reactions to the Publication of the Nouveaux Essais\n[1765],” <em>Journal of the History of Philosophy</em>, 12:\n437–54.",
                "Vanzo, Alberto, 2018, “Leibniz on Innate Ideas and Kant on\nthe Origin of the Categories,” <em>Archiv für Geschichte\nder Philosophie</em>, 100(1): 19–45.",
                "Watkins, Eric, 2006, “On the Necessity and Nature of\nSimples: Leibniz, Wolff, Baumgarten, and the Pre-critical Kant,”\n<em>Oxford Studies in Early Modern Philosophy</em>, 3: 261–314.",
                "Wilson, Catherine, 2016, “Leibniz on War and Peace and the\nCommon Good,” in <em>Fuer unser Glueck und das Glueck\nanderer</em> (6 volumes), Wenchao Li, Helena Iwasinski und Simona\nNoreik (eds.), Hildesheim: Olms, I, 33–62.",
                "Wunderlich, Falk, 2016, “Materialism in late Enlightenment\nGermany: A Neglected Tradition Reconsidered,” in Falk Wunderlich\nand Patricia Springborg (eds.), <em>British Journal for the History of\nPhilosophy</em>, 24(5): 940–62.",
                "Zoeller, Guenter, 1989, “From Innate to ‘A\npriori,’: Kant’s Radical Transformation of a\nCartesian-Leibnizian Legacy,” <em>Monist</em>, 72: 222–235.\n\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimSour\">Primary Sources</h3>\n<ul>\n<li>References to Leibniz’s texts are to C.I. Gerhardt, ed.,\n<em>Die Philosophische Schriften von Leibniz</em>, 7 vols.,\nHildesheim: Olms, 1965. </li>\n<li>Page references to the <em>New Essays</em> cited as\n“A” are to volume IV Reihe 6 of the still incomplete\nAcademy edition of Gottfried Wilhelm Leibniz: <em>Sametliche Schriften\nund Briefe</em>, ed. Akademie der Wissenschaften, Berlin:\nAkademie-Verlag, 1923–. </li>\n<li>References to Ariew and Garber are to <em>G.W. Leibniz:\nPhilosophical Essays</em>, Roger Ariew and Daniel Garber (tr. and\ned.), Indianapolis, Hackett, 1989. </li>\n<li>References to Riley are to Patrick Riley (tr. and\ned.), <em>Leibniz: Political Writings</em>, Cambridge: Cambridge\nUniversity Press, 1988. </li>\n<li>References to Kant’s texts follow the Academy edition\n(Gesammelte Schriften, ed., Akademie der Wissenschaften, Berlin:\nReimer, de Gruyter, 1900–) by volume and page. </li>\n<li>References to the <em>Critique of Pure Reason</em> (KRV) are to\nthe first (A) and second (B) edition. Where the current English\ntranslation, tr. and ed. by Paul Guyer and Allen W. Wood, Cambridge:\nCambridge University Press, 1998, was directly cited, it is noted as\nCPR. </li>\n</ul>\n<h3 id=\"SecoSour\">Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Allison, Henry (ed.), 1973, <em>The Kant-Eberhard\nControversy</em>, Baltimore: Johns Hopkins University Press.</li>\n<li>Beck, Lewis White, 1969, <em>Early German Philosophy: Kant and his\nPredecessors</em>, Cambridge MA: Harvard University Press. </li>\n<li>Brandt, Reinhard, 1999, <em>Kommentar zu Kants “Anthropologie in\npragmatischer Hinsicht</em>”, Hamburg: Felix Meiner. </li>\n<li>Butts, Robert, 1984, <em>Kant and the Double Government\nMethodology</em>, Dordrecht: D. Reidel. </li>\n<li>Fonnesu, Luca, 2008, “The Problem of Theodicy,” in\n<em>The Cambridge History of Eighteenth Century Philosophy</em>\n(Volume 2), Knud Haakonssen (ed.), Cambridge: Cambridge University\nPress, 749–778. </li>\n<li>Friedman, Michael, 2013, <em>Kant’s Construction of\nNature</em>, Cambridge: Cambridge University Press. </li>\n<li>Goldenbaum, Ursula, 2021, “How Kant was Never a Wolffian,\nor, Estimating Forces to Enforce Influxus Physicus,” in Brandon\nC. Look (ed.), <em>Leibniz and Kant</em>, Oxford: Oxford University\nPress, 27–56. </li>\n<li>Guyer, Paul, 2011, “Kantian Communities,” in Charlton\nPayne and Lucas Thorpe (eds.), <em>Kant and the Concept of\nCommunity</em>, Rochester: University of Rochester Press, 88–120.</li>\n<li>Hagengruber, Ruth, 2019, “Émilie Du Châtelet\nzwischen Leibniz und Kant,” in Ruthe Hagengruber and Hartmut\nHecht (eds.), <em>Emilie Du Châtelet und die deutsche\nAufklärung</em>. Springer VS, Wiesbaden, 173–195.</li>\n<li>Jauernig, Anja, 2008, “Kant’s Critique of the\nLeibnizian Philosophy: contra the Leibnizians, but pro Leibniz,”\nin Daniel Garber and Beatrice Longuenesse (eds.), <em>Kant and the\nEarly Moderns</em>, Princeton: Princeton University Press, pp.\n41–63.</li>\n<li>Kleingeld, Pauline, 2007, “Kant’s Second Thoughts on\nRace,” <em>Philosophical Quarterly</em>, 57: 573–92.</li>\n<li>Laywine, Alison, 2021, “Leibniz and the Transcendental\nDeduction,” in Brandon C. Look (ed.), <em>Leibniz and Kant</em>,\nOxford: Oxford University Press, 112–141. </li>\n<li>Look, Brandon C., 2021, “Kant’s Leibniz: A Historical and\nPhilosophical Study,” in Brandon C. Look (ed.), <em>Leibniz and\nKant</em>, Oxford: Oxford University Press, 1–26. </li>\n<li>Massimi, Michaela and Angela Breitenbach (eds.), 2017, <em>Kant\nand the Laws of Nature</em>, Cambridge: Cambridge University Press.\n</li>\n<li>Menzer, Paul, 1911, <em>Kants Lehre von der Entwicklung in Natur\nund Geschichte</em>, Berlin: De Gruyter.</li>\n<li>Mittelstrass, Juergen, 1985, “Leibniz and Kant on\nMathematical and Philosophical Knowledge,” in Kathleen Okruhlik\nand James Robert Brown (eds.), <em>The Natural Philosophy of\nLeibniz</em>, Dordrecht: Reidel, 227–262. </li>\n<li>Paull, R. Cranston, 1992, “Leibniz and the Miracle of\nFreedom,” <em>Noûs</em>, 26(2): 218–35.</li>\n<li>Rateau, Paul, 2009, <em>L’Idee de Theodicee de Leibniz a\nKant. Heritage, Transformations, Critiques</em>, Wiesbaden:\nSteiner.</li>\n<li>Rescher, Nicholas, 2013, “Leibniz and the World’s\nImprovability,” in <em>On Leibniz</em>, Pittsburgh: Pittsburgh\nUniversity Press. </li>\n<li>Rumore, Paula, 2016, “Mechanism and Materialism in early\nModern German Philosophy,” in <em>Varieties of Early Modern\nMaterialism</em>, Falk Wunderlich and Patricia Springborg (eds.),\n<em>British Journal for the History of Philosophy</em>, 24(5): 917–39.\n</li>\n<li>Rusnock, Paul and George, Rolf, 1995, “A Last Shot at Kant\nand Incongruent Counterparts,” <em>Kant-Studien</em>, 86:\n257–277. </li>\n<li>Sassen, Brigitte, 2015, “18th Century German Philosophy\nPrior to Kant,” <em>The Stanford Encyclopedia of Philosophy</em>\n(Summer 2015 Edition), Edward N. Zalta (ed.),\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2015/entries/18thGerman-preKant/\">https://plato.stanford.edu/archives/sum2015/entries/18thGerman-preKant/</a>&gt;.\n </li>\n<li>Schonrich, Gerhard, 1992, “Zahmung des Bosen? Uberlegungen\nzu Kant vor dem Hintergrund der Leibnizschen Theodizee,”\n<em>Zeitschrift fuerphilosophische Forschung</em>, 46: 205–223.\n</li>\n<li>Tonelli, Giorgio, 1974, “Leibniz on Innate Ideas and the\nEarly Reactions to the Publication of the Nouveaux Essais\n[1765],” <em>Journal of the History of Philosophy</em>, 12:\n437–54. </li>\n<li>Vanzo, Alberto, 2018, “Leibniz on Innate Ideas and Kant on\nthe Origin of the Categories,” <em>Archiv für Geschichte\nder Philosophie</em>, 100(1): 19–45. </li>\n<li>Watkins, Eric, 2006, “On the Necessity and Nature of\nSimples: Leibniz, Wolff, Baumgarten, and the Pre-critical Kant,”\n<em>Oxford Studies in Early Modern Philosophy</em>, 3: 261–314. </li>\n<li>Wilson, Catherine, 2016, “Leibniz on War and Peace and the\nCommon Good,” in <em>Fuer unser Glueck und das Glueck\nanderer</em> (6 volumes), Wenchao Li, Helena Iwasinski und Simona\nNoreik (eds.), Hildesheim: Olms, I, 33–62. </li>\n<li>Wunderlich, Falk, 2016, “Materialism in late Enlightenment\nGermany: A Neglected Tradition Reconsidered,” in Falk Wunderlich\nand Patricia Springborg (eds.), <em>British Journal for the History of\nPhilosophy</em>, 24(5): 940–62.</li>\n<li>Zoeller, Guenter, 1989, “From Innate to ‘A\npriori,’: Kant’s Radical Transformation of a\nCartesian-Leibnizian Legacy,” <em>Monist</em>, 72: 222–235.\n</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "identity: of indiscernibles",
            "Kant, Immanuel",
            "Kant, Immanuel: philosophy of science",
            "Kant, Immanuel: views on space and time",
            "Leibniz, Gottfried Wilhelm",
            "Leibniz, Gottfried Wilhelm: philosophy of physics"
        ],
        "entry_link": [
            {
                "../identity-indiscernible/": "identity: of indiscernibles"
            },
            {
                "../kant/": "Kant, Immanuel"
            },
            {
                "../kant-science/": "Kant, Immanuel: philosophy of science"
            },
            {
                "../kant-spacetime/": "Kant, Immanuel: views on space and time"
            },
            {
                "../leibniz/": "Leibniz, Gottfried Wilhelm"
            },
            {
                "../leibniz-physics/": "Leibniz, Gottfried Wilhelm: philosophy of physics"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=kant-leibniz\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/kant-leibniz/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=kant-leibniz&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/kant-leibniz/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=kant-leibniz": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/kant-leibniz/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=kant-leibniz&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/kant-leibniz/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.gutenberg.org/browse/authors/k#a1426\" target=\"other\">Immanuel Kant</a>,\n from Project Gutenberg.",
            "<a href=\"http://www.hkbu.edu.hk/~ppp/Kant.html\" target=\"other\">Kant on the Web</a>,\n maintained by Dr. Stephen Palmquist, Hong Kong Baptist\nUniversity.",
            "<a href=\"http://en.wikipedia.org/wiki/Immanuel_Kant\" target=\"other\">Immanuel Kant</a>,\n from Wikipedia, the free encyclopedia.",
            "<a href=\"https://northamericankantsociety.org/\" target=\"other\">North American Kant Society</a>."
        ],
        "listed_links": [
            {
                "http://www.gutenberg.org/browse/authors/k#a1426": "Immanuel Kant"
            },
            {
                "http://www.hkbu.edu.hk/~ppp/Kant.html": "Kant on the Web"
            },
            {
                "http://en.wikipedia.org/wiki/Immanuel_Kant": "Immanuel Kant"
            },
            {
                "https://northamericankantsociety.org/": "North American Kant Society"
            }
        ]
    }
}