{
    "url": "lawphil-theory",
    "title": "The Pure Theory of Law",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Andrei Marmor\n<am2773@cornell.edu>",
        "author_links": [
            {
                "mailto:am2773%40cornell%2eedu": "am2773@cornell.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\nAndrei Marmor\n&lt;<a href=\"mailto:am2773%40cornell%2eedu\"><em>am2773<abbr title=\" at \">@</abbr>cornell<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Nov 18, 2002",
        "substantive revision Mon Jul 26, 2021"
    ],
    "preamble": "\n\n\nThe idea of a Pure Theory of Law was propounded by the formidable\nAustrian jurist and philosopher Hans Kelsen (1881–1973) (see the\nbibliographical note). Kelsen began his long career as a legal\ntheorist at the beginning of the 20th century. The traditional legal\nphilosophies at the time, were, Kelsen claimed, hopelessly\ncontaminated with political ideology and moralizing on the one hand,\nor with attempts to reduce the law to natural or social sciences, on\nthe other hand. He found both of these reductionist endeavors\nseriously flawed.  Instead, Kelsen suggested a ‘pure’\ntheory of law which would avoid reductionism of any kind. The\njurisprudence Kelsen propounded “characterizes itself as a\n‘pure’ theory of law because it aims at cognition focused\non the law alone” and this purity serves as its “basic\nmethodological principle” (PT1, 7).\n",
    "toc": [
        {
            "#BasNor": "1. The Basic Norm"
        },
        {
            "#RelRed": "2. Relativism and Reduction"
        },
        {
            "#NorLaw": "3. The Normativity of Law"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PriSou": "Primary Sources"
        },
        {
            "#SecSou": "Secondary Sources"
        },
        {
            "#ConDisFurRea": "Contemporary Discussions and Further Reading"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Basic Norm\n\n\nThe main challenge for a theory of law, as Kelsen saw it, is to\nprovide an explanation of legality and the normativity of law, without\nan attempt to reduce jurisprudence, or “legal science”, to\nother domains. The law, Kelsen maintained, is basically a scheme of\ninterpretation. Its reality, or objectivity, resides in the sphere of\nmeaning; we attach a legal-normative meaning to certain actions and\nevents in the world (PT1, 10). Suppose, for example, that a new law is\nenacted by the California legislature. How is it done? Presumably, some\npeople gather in a hall, debate the issue, eventually raise their hands\nin response to the question of whether they approve a certain document\nor not, count the number of people who say “yes”, and then\npromulgate a string of words, etc. Now, of course, the actions and\nevents described here are not the law. To say that the description is\nof the enactment of a new law is to interpret these actions and events\nin a certain way. But then, of course, the question is why\ncertain acts or events have such a legal meaning and others\ndon’t?\n\n\nKelsen’s answer to this question is surprisingly simple: an\nact or an event gains its legal-normative meaning by another legal norm\nthat confers this normative meaning on it. An act can create or modify\nthe law if it is created in accordance with another,\n“higher” legal norm that authorizes its creation in that\nway. And the “higher” legal norm, in turn, is legally valid\nif and only if it has been created in accord with yet another,\n“higher” norm that authorizes its enactment in that\nway. In other words: it is the law in the United States that the\nCalifornia legislature can enact certain types of laws. But what makes\nthis the law? The California Constitution confers this power on the\nstate legislature to enact laws within certain prescribed boundaries of\ncontent and jurisdiction. But then what makes the California\nConstitution legally valid? The answer is that the legal validity of\nthe Constitution of California derives from an authorization granted by\nthe US Constitution. What makes the US Constitution legally valid?\nSurely, not the fact that the US Constitution proclaims itself to be\n“the supreme law of the land”. Any document can say that,\nbut only the particular document of the US Constitution is actually the\nsupreme law in the United States.\n\n\nThe problem is that here the chain of authorization comes to an end:\nThere isn’t a higher legal norm that authorizes the enactment of\nthe (original) US Constitution. At this point, Kelsen famously argued,\none must presuppose the legal validity of the Constitution. At some\nstage, in every legal system, we get to an authorizing norm that has\nnot been authorized by any other legal norm, and thus it has to be\npresupposed to be legally valid. The normative content of this\npresupposition is what Kelsen has called the basic norm. The basic norm\nis the content of the presupposition of the legal validity of the\n(first, historical) constitution of the relevant legal system (GT,\n110–111).\n\n\n As Kelsen saw it,\nthere is simply no alternative. More precisely, any alternative would\nviolate David Hume’s injunction against deriving an\n“ought” from an “is”. Hume famously argued that\nany practical argument that concludes with some prescriptive statement,\na statement of the kind that one ought to do this or that, would have\nto contain at least one prescriptive statement in its premises. If all\nthe premises of an argument are descriptive, telling us what this or\nthat is the case, then there is no prescriptive conclusion that can\nlogically follow. Kelsen took this argument very seriously. He observed\nthat the actions and events that constitute, say, the enactment of a\nlaw, are all within the sphere of what “is” the case, they\nare all within the sphere of actions and events that take place in the\nworld. The law, or legal norms, are within the sphere of\n“ought”, they are norms that purport to guide conduct.\nThus, to get an “ought” type of conclusion from a set of\n“is” premises, one must point to some “ought”\npremise in the background, an “ought” that confers the\nnormative meaning on the relevant type of “is”. Since the\nactual, legal, chain of validity comes to an end, we inevitably reach a\npoint where the “ought” has to be presupposed, and this is\nthe presupposition of the basic norm.\n\n\n The idea of the\nbasic norm serves three theoretical functions in Kelsen’s theory\nof law: The first is to ground a non-reductive explanation of legal\nvalidity. The second function is to ground a non-reductive explanation\nof the normativity of law. The third function is to explain the\nsystematic nature of legal norms. These three issues are not\nun-related.\n\n\nKelsen rightly noticed that legal norms necessarily come in systems.\nThere are no free-floating legal norms. If, for example, somebody\nsuggests that “the law requires a will to be attested by two\nwitnesses”, one should always wonder which legal system is talked\nabout; is it US law, Canadian law, German law, or the law in some other\nlegal system? Furthermore, legal systems are themselves organized in a\nhierarchical structure, manifesting a great deal of complexity but also\na certain systematic unity. We talk about Canadian law, or German law,\netc., not only because these are separate countries in which there is\nlaw. They are also separate legal systems, manifesting a certain\ncohesion and unity. This systematic unity Kelsen meant to capture by\nthe following two postulates:\n\nEvery two norms that ultimately derive their validity from one\nbasic norm belong to the same legal system.\nAll legal norms of a given legal system ultimately derive their\nvalidity from one basic norm.\n\n\n\nWhether these two postulates are actually true is a contentious\nissue. Joseph Raz argued that they are both inaccurate, at best.  Two\nnorms can derive their validity from the same basic norm, but fail to\nbelong to the same system as, for example, in case of an orderly\nsecession whereby a new legal system is created by the legal\nauthorization of another. Nor is it necessarily true that all the\nlegally valid norms of a given system derive their validity from the\nsame basic norm (Raz 1979, 127–129).\n\n\nBe this as it may, even if Kelsen erred about the details of the unity\nof legal systems, his main insight remains true, and quite\nimportant. It is true that law is essentially systematic, and it is\nalso true that the idea of legal validity and law’s systematic nature\nare very closely linked. Norms are legally valid within a given\nsystem, they have to form part of a system of norms that is in force\nin a given place and time.\n\n\nThis last point brings us to another observation that is central to\nKelsen’s theory, about the relations between legal validity and, what\nhe called, “efficacy”. The latter is a term of art in\nKelsen’s writings: A norm is efficacious if it is actually (generally)\nfollowed by the relevant population. Thus, “a norm is considered\nto be legally valid”, Kelsen wrote, “on the condition that\nit belongs to a system of norms, to an order which, on the whole, is\nefficacious” (GT, 42). So the relationship here is this:\nefficacy is not a condition of legal validity of individual norms. Any\ngiven norm can be legally valid even if nobody follows it. (e.g. think\nabout a new law, just enacted; it is legally valid even if nobody has\nyet had an opportunity to comply with it.) However, a norm can only be\nlegally valid if it belongs to a system, a legal order, that is by and\nlarge actually practiced by a certain population. And thus the idea of\nlegal validity, as Kelsen admits, is closely tied to this reality of a\nsocial practice; a legal system exists, as it were, only as a social\nreality, a reality that consists in the fact that people actually\nfollow certain norms.\n\n\nWhat about the basic norm, is efficacy a condition of its validity?\nOne might have thought that Kelsen would have opted for a negative\nanswer here. After all, the basic norm is a presupposition that is\nlogically required to render the validity of law intelligible. This\nwould seem to be the whole point of an anti-reductionist explanation\nof legal validity: since we cannot derive an “ought” from\nan “is”, some “ought” must be presupposed in\nthe background that would enable us to interpret certain acts or\nevents as having legal significance. Kelsen, however, quite explicitly\nadmits that efficacy is a condition of the validity of the basic norm:\nA basic norm is legally valid if and only if it is actually followed\nin a given population. In fact, as we shall see below, Kelsen had no\nchoice here. And this is precisely why at least one crucial aspect of\nhis anti-reductionism becomes questionable.\n2. Relativism and Reduction\n\n\nCommon wisdom has it that Kelsen’s argument for the\npresupposition of the basic norm takes the form of a Kantian\ntranscendental argument. The structure is as follows:\n\nP is possible only if Q\nP is possible (or, possibly P)\nTherefore, Q.\n\n\n\nIn Kelsen’s argument, P stands for the fact that legal\nnorms are “ought” statements , and Q is the\npresupposition of the basic norm. In other words, the necessary\npresupposition of the basic norm is derived from the possibility\nconditions for ascribing legal significance to actions and events. In\norder to interpret an action as one of creating or modifying the law,\nit is necessary to show that the relevant legal significance of the\nact/event is conferred on it by some other legal norm. At some point,\nas we have noted, we necessarily run out of legal norms that confer\nthe relevant validity on law creating acts, and at that point the\nlegal validity has to be presupposed. The content of this\npresupposition is the basic norm.\n\n\n It would be a\nmistake, however, to look for an explanation of Kelsen’s argument\nin the logic of Kant’s transcendental argument. (Kelsen himself\nseems to have changed his views about this over the years; he may have\nstarted with a kind of neo-Kantian perspective one can discern in PT1,\nand gradually shifted to a Humean version of his main argument, which\nis quite evident in GT. However, this is a very controversial issue; for a different view, see Paulson 2013 and Green 2016.) Kant employed a transcendental argument\nto establish the necessary presuppositions of some categories and modes\nof perception that are essential for rational cognition, or so he\nthought. They form deep, universal, and necessary features of human\ncognition. Suffice it to recall that it was Hume’s skepticism\nabout knowledge that Kant strove to answer by his transcendental\nargument. Kelsen, however, remains much closer to Hume’s\nskeptical views than to Kant’s rationalism. In particular, Kelsen\nwas very skeptical of any objective grounding of morality, Kant’s\nmoral theory included. Kelsen’s view of morality was relativist\nall the way down. (More on this, below). Second, and not unrelated, as\nwe shall see, Kelsen has explicitly rejected the idea that the basic\nnorm (in law, or of any other normative domain) is something like a\nnecessary feature or category of human cognition. The presupposition of\na basic norm is optional. One does not have to accept the normativity\nof law; anarchism, as a rejection of law’s normative validity is\ncertainly an option, Kelsen maintained. The basic norm is presupposed\nonly by those who accept the “ought”, that is, the\nnormative validity, of the law. But one is not rationally compelled to\nhave this attitude:\n\n\nThe Pure Theory describes the positive law as an objectively\nvalid order and states that this interpretation is possible only under\nthe condition that a basic norm is presupposed…. The Pure\nTheory, thereby characterizes this interpretation as possible, not\nnecessary, and presents the objective validity of positive law only as\nconditional—namely conditioned by the presupposed basic\nnorm. (PT2, 217–218)\n\n\nA comparison to religion, that Kelsen himself offered, might be\nhelpful here. The normative structure of religion is very similar to\nthat of law. It has the same logic: religious beliefs about what one\nought to do ultimately derive from one’s beliefs about\nGod’s commands. God’s commands, however, would only have\nnormative validity for those who presuppose the basic norm of their\nrespective religion, namely, that one ought to obey God’s\ncommands. Thus the normativity of religion, like that of the law, rests\non the presupposition of its basic norm. But in both cases, as, in\nfact, with any other normative system, the presupposition of the basic\nnorm is logically required only of those who regard the relevant norms\nas reasons for their actions. Thus, whether you actually presuppose the\nrelevant basic norm is a matter of choice, it is an ideological option,\nas it were, not something that is dictated by Reason. Similarly, the\nnormativity of law, presupposed by its basic norm, is optional:\n“An anarchist, for instance, who denied the validity of the\nhypothetical basic norm of positive law…. will view its positive\nregulation of human relationships… as mere power\nrelations” (GT, 413).\n\n\n Relativism,\nhowever, comes with a price. Consider this question: What is the\ncontent of the basic norm that one needs to presuppose in order to\nrender positive law intelligible as a normative legal order? The simple\nanswer is that what one presupposes here is precisely the normative\nvalidity of positive law, namely, the law that is actually practiced by\na certain population. The validity of the basic norm, as we noted\nbriefly earlier, is conditional on its “efficacy”. The\ncontent of the basic norm of any given legal system is determined by\nthe actual practices that prevail in the relevant community. As Kelsen\nhimself repeatedly argued, a successful revolution brings about a\nradical change in the content of the basic norm. Suppose, for example,\nthat in a given legal system the basic norm is that the constitution\nenacted by Rex One is binding. At a certain point, a coup\nd’etat takes place and a republican government is\nsuccessfully installed. At this point, Kelsen admits, ‘one\npresupposes a new basic norm, no longer the basic norm delegating law\nmaking authority to the monarch, but a basic norm delegating authority\nto the revolutionary government’ (PT1, 59).\n\n\n Has Kelsen just\nviolated his own adherence to Hume’s injunction against deriving\n“ought” from an “is” here? One gets the clear\nimpression that Kelsen was aware of a serious difficulty in his\nposition. In both editions of the Pure Theory of Law, Kelsen toys with\nthe idea that perhaps changes in the basic norms of municipal legal\nsystems legally derive from the basic norm of public international law.\nIt is a basic principle of international law that state sovereignty is\ndetermined by actual control over a territory/population (PT1\n61–62, though in PT2, 214–215, the idea is presented with greater\nhesitation; notably, some commentators argue that Kelsen took the idea of a universal legal order much more seriously than suggested here—see Green 2016).  But this led Kelsen to the rather uncomfortable\nconclusion that there is only one basic norm in the entire world,\nnamely, the basic norm of public international law. Be this as it\nmay, the main worry lies elsewhere. The worry stems from the fact that\nit is very difficult, if not impossible, to maintain both a profound\nrelativist and an anti-reductionist position with respect to a given\nnormative domain. If you hold the view that the validity of a type of\nnorms is entirely relative to a certain vantage point—in other\nwords, if what is involved here is only the actual conduct,\nbeliefs/presuppositions and attitudes of people—it becomes\nvery difficult to detach the explanation of that normative validity\nfrom the facts that constitute the relevant point of view (namely, the\nfacts about people’s actions, beliefs, attitudes, etc). This is\nbasically what was meant earlier by the comment that Kelsen had no\noption but to admit that the validity of the basic norm is conditional\non its efficacy. The normative relativism which is inherent in\nKelsen’s conception forces him to ground the content of the basic\nnorm in the social facts that constitute its content, namely, the facts\nabout actions, beliefs, and attitudes actually entertained by the\npopulation in question. And this makes it very questionable that\nreductionism can be avoided. In fact, what Kelsen really offered us\nhere is an invitation to provide a reductive explanation of the concept\nof legal validity in terms of some set of social facts, the facts that\nconstitute the content of any given basic norm. (Which is precisely the\nkind of reduction H.L.A. Hart later offered in his account of the Rules\nof Recognition as social rules [see Hart 1961, at p. 105, where\nHart alludes to the difference between his conception of the rules of\nrecognition and Kelsen’s idea of the basic norm.])\n\n\n Kelsen’s\nproblem here is not due to the fact that he was a relativist with\nrespect to every normative system, like morality, religion etc.; it is\nnot the scope of his relativism that is relevant to the question of\nreduction. The problem stems from the fact that Kelsen was quite right\nabout the law. Legal validity is essentially relative to the social\nfacts that constitute the content of the basic norm in each and every\nlegal order. Notice that legal validity is always relative to a time\nand place. A law enacted by the California legislature only applies\nwithin the boundaries of the state of California, and it applies during\na certain period of time, after its enactment and until a time when it\nis modified or repealed. And we can see why: because legal validity is\ndetermined by the content of the basic norm that is actually followed\nin a given society. The laws in UK, for example, are different from\nthose in the US, because people (mostly judges and other officials)\nactually follow different rules, or basic norms, in Kelsen’s\nterminology, about what counts as law in their respective\njurisdictions. Once Kelsen admits, as he does, that the content of a\nbasic norm is fully determined by practice, it becomes very difficult\nto understand how the explication of legal validity he offers is\nnon-reductive.\n3. The Normativity of Law\n\n\n Let us now see how\nKelsen thought that the basic norm helps to explain the sense in which\nlaw is a normative domain and what this normativity consists in. The\nfirst and crucial point to realize is that for Kelsen the idea of\nnormativity is tantamount to a genuine “ought”, as it were;\nit is a justified demand on practical deliberation. A certain content\nis regarded as normative by an agent if and only if the agent regards\nthat content as a valid reason for action. As Joseph Raz noticed,\nKelsen agrees with the Natural Law tradition in this particular\nrespect; both assume that the normativity of law can only be explained\nas one would explain the normativity of morality, or religion for that\nmatter, namely, in terms of valid reasons for action (Raz 1979,\n134–137; but cf. Paulson 2012). But then, the problem for Kelsen is how\nto explain the difference between the normativity of law and that of\nmorality; if legal “ought” is a genuine\n“ought”, what makes a legal obligation distinct from a\nmoral one? Kelsen’s answer is that the relevant\n“ought” is always relative to a given point of view. Each\nand every type of “ought”, be it religious, moral or legal,\nmust presuppose a certain point of view, a point of view which is\nconstituted by the basic norm of the relevant normative system.\n\n\nIn other words, Kelsen’s conception of legal normativity turns\nout to be a form of Natural Law completely relativized to a certain\npoint of view. However, in Kelsen’s theory the relevant point of\nview is distinctly a legal one, not some general conception of morality\nor Reason. That these two basic norms, or points of view, can come\napart, is nicely demonstrated by Kelsen’s comment that\n“even an anarchist, if he were a professor of law, could describe\npositive law as a system of valid norms, without having to approve of\nthis law” (PT2 218n). The anarchist does not endorse the\nlegal point of view as one that reflects her own views about what is\nright and wrong. Anarchism is understood here precisely as a rejection\nof the normative validity of law; however, even the anarchist can make\nan argument about what the law in this or that context requires; and\nwhen she makes such an argument, she must presuppose the legal point of\nview, she must argue as if she endorses the basic norm of the relevant\nlegal system. Joseph Raz has called these kinds of statements\n“detached normative statements”; the anarchist argues as if\nshe endorses the basic norm, without actually endorsing it. Another\nexample that Raz gave is this: suppose that at Catholic priest is an\nexpert in Jewish Law; the priest can make various interpretative\narguments about what Jewish law really requires in this or that\ncontext. In such a case, the priest must argue as if he endorses the\nbasic norm of Jewish Law, but of course, being a Catholic, he does not\nreally endorse it, it does not reflect his own views about what is\nright and wrong (Raz 1979, 153–157).\n\n\nSo here is what emerges so far: the concept of normativity, the\nsense in which normative content is related to reasons for action, is\nthe same across all normative domains. To regard something as normative\nis to regard it as justified, as a warranted requirement on practical\ndeliberation. However, the difference resides in the difference in\npoints of view. Each basic norm determines, as it were, a certain point\nof view. So it turns out that normativity (contra Kant) always consists\nof conditional imperatives: if, and only if, one endorses a\ncertain normative point of view, determined by its basic norm, then the\nnorms that follow from it are reason giving, so to speak. This enables\nKelsen to maintain the same understanding of the nature of normativity\nas Natural Law’s conception, namely, normativity qua reasons for\naction, without having to conflate the normativity of morality with\nthat of law. In other words, the difference between legal normativity\nand, say, moral normativity, is not a difference in normativity (viz,\nabout the nature of normativity, per se), but only in the relevant\nvantage point that is determined by their different basic norms. What\nmakes legal normativity unique is the uniqueness of its point of view,\nthe legal point of view, as it were.\n\n\n We can set aside\nthe difficulties that such a view raises with respect to morality.\nObviously, many philosophers would reject Kelsen’s view that\nmoral reasons for action only apply to those who choose to endorse\nmorality’s basic norm (whatever it may be). Even if Kelsen is\nquite wrong about this conditional nature of moral imperatives, he may\nbe right about the law. What remains questionable, however, is whether\nKelsen succeeds in providing a non-reductive explanation of legal\nnormativity, given the fact that his account of legal validity turned\nout to be reductive after all. The trouble here is not simply the\nrelativity to a point of view; the trouble resides in Kelsen’s\nfailure to ground the choice of the relevant point of view in anything\nlike Reason or reasons of any kind. By deliberately avoiding any\nexplanation of what it is that might ground an agent’s choice of\nendorsing the legal point of view, or any given basic norm, Kelsen left\nthe most pressing questions about the normativity of law unanswered.\nInstead of providing an explanation of what makes the\npresupposition of the legal point of view rational, or what makes it\nrational to regard the requirements of law as binding requirements,\nKelsen invites us to stop asking.\n",
    "bibliography": {
        "categories": [
            "<a name=\"PriSou\">Primary Sources</a>",
            "<a name=\"SecSou\">Secondary Sources</a>",
            "<a name=\"ConDisFurRea\">Contemporary Discussions and Further Reading</a>"
        ],
        "cat_ref_text": {
            "<a name=\"PriSou\">Primary Sources</a>": [
                "</h3>\n<p>\n\nKelsen’s academic publications span over almost seven decades in which\nhe published dozens of books and hundreds of articles. Only about a\nthird of this vast literature has been translated to English.\nKelsen’s two most important books on the pure theory of law are the\nfirst edition of his <em>Reine Rechtslehre</em>, published in 1934 and\nrecently (2002) translated. The second edition, which Kelson published\nin 1960 (translated in 1967) is a considerably extended version of the\nfirst edition. In addition, most of the themes in these two books also\nappear in Kelsen’s <em>General Theory of Law and State</em>. These\nthree works are cited in text as follows:\n\n</p>\n<table class=\"cellpad-small vert-top\">\n<tr>",
                "[PT1]",
                "1934/2002. <em>Introduction to\nthe Problems of Legal Theory</em>, B.L. Paulson and S.L. Paulson\n(trans.), Oxford: Clarendon Press.\n</tr>\n<tr>",
                "[PT2]",
                "1960/1967. <em>Pure Theory of Law</em>,\nM. Knight (trans.), Berkeley: University of California Press.\n</tr>\n<tr>",
                "[GT]",
                "1945/1961. <em>General Theory of Law and State</em>, A. Wedberg\n(trans.), New York: Russell &amp; Russell.\n</tr>\n</table>\n<p>\n\nOther relevant publications in English include:</p>\n<ul>\n<li>1957, <em>What is Justice?</em>, Berkeley: University of \nCalifornia Press.</li>\n<li>1941, ‘The Pure Theory of Law and Analytical Jurisprudence’,\n<em>Harvard Law Review</em>, 55: 44–70.</li>\n<li>1965, ‘Professor Stone and the Pure Theory of Law: A\nReply’, <em>Stanford Law Rev</em>, 17(6): 1128–1157.</li>\n<li>1966, ‘On the Pure Theory of Law’, <em>Israel Law\n Review</em>, 1(1): 1–7.</li>\n</ul>\n<p>\n\nFor a complete list of Kelsen’s publications that have appeared\nin English see the Appendix to H. Kelsen, <em>General Theory of\nNorms</em>, M. Hartney (trans.), Oxford: Oxford University Press,\n1991, pp. 440–454.</p>\n<h3>"
            ],
            "<a name=\"SecSou\">Secondary Sources</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Green, S.M., 2016, “Marmor’s Kelsen”, in\nD.A. Jeremy Telman (ed.), <em>Hans Kelsen in America</em>, Dordrecht:\nSpringer Verlag.",
                "Harris, J.W., 1980, <em>Legal Philosophies</em> (Chapter 6),\nLondon: Butterworths.",
                "Hart, H.L.A., 1961, <em>The Concept of Law</em> (Chapter 3),\nOxford: Clarendon Press.",
                "–––, 1970, “Kelsen’s Doctrine of the Unity\nof Law”, in H.E. Kiefer and M.K. Munitz (eds.), <em>Ethics and\nSocial Justice</em>, New York: State University of\nNew York Press, pp. 171–199.",
                "Marmor, A., 2001, <em>Objective Law and Positive Values</em>,\nOxford: Oxford University Press.",
                "–––, 2011, <em>Philosophy of Law</em>,\nThe Princeton Series in the Foundations of Contemporary Philosophy\n(S. Soames ed.), Chapter 1, Princeton: Princeton University\nPress.",
                "Paulson, S., 2002, Introduction to Kelsen’s <em>Introduction to\nthe Problems of Legal Theory</em>, Oxford: Clarendon\nPress, p. xvii.",
                "–––, 2012. “A ‘Justified\nNormativity’ Thesis in Hans Kelsen’s Pure Theory of Law?\nRejoinders to Robert Alexy and Joseph Raz”, in Matthias Klatt\n(ed.), <em>Institutionalized Reason: The Jurisprudence of Robert\nAlexy</em>, Oxford: Oxford University Press, pp. 61–111.",
                "–––, 2013. “The Great Puzzle:\nKelsen’s Basic Norm”, in Luis Duarte d’Almeida, John\nGardner, and Leslie Green (eds.), <em>Kelsen Revisited: New Essays on\nthe Pure Theory of Law</em>, Oxford: Hart Publishing,\npp. 43–62.",
                "Raz, J., 1980, <em>The Concept of a Legal System</em>,\n2<sup>nd</sup> edition, Oxford: Oxford University Press.",
                "–––, 1979, ‘Kelsen’s Theory of the\nBasic Norm’, in J. Raz, <em>The Authority of Law</em>,\nOxford: Oxford University Press, pp. 122–145.",
                "Tur, R.H. &amp; W. Twining (eds.), 1986, <em>Essays on\nKelsen</em>, Oxford: Clarendon Press.\n</ul>\n<h3>"
            ],
            "<a name=\"ConDisFurRea\">Contemporary Discussions and Further Reading</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Bix, B., 2018, “Kelsen, Hart, and Legal Normativity”,\n<em>Revus</em>, 34: 1–17, doi:10.4000/revus.3984",
                "Gragl, P., 2017, “In Defence of Kelsenian Monism: Countering\nHart and Raz”, <em>Jurisprudence</em>, 8(2): 287–318.",
                "Green, S. M., 2021, “Hans Kelsen’s Non-Reductive\nPositivism”, in T. Spaak &amp; P. Mindus (eds.), <em>The\nCambridge Companion to Legal Positivism</em>, Cambridge: Cambridge\nUniversity Press, pp. 272–300.",
                "Guastini, R., 2016, “Kelsen on Validity (Once More)”,\n<em>Ratio Juris</em>, 29: 402–409.",
                "Langford, P., Bryan, I., &amp; McGarry, J. (eds.), 2017,\n<em>Kelsenian Legal Science and the Nature of Law</em>, Cham:\nSpringer.",
                "Orakhelashvili, A., 2019, <em>Domesticating Kelsen: Towards the Pure\nTheory of English Law</em>, Cheltenham: Edward Elgar Publishing",
                "Pavlakos, G., 2018, “Non-naturalism, Normativity and the\nMeaning of Ought: Some Lessons from Kelsen”, in K. E. Himma,\nM. Jovanovic &amp; B. Spaic (eds.), <em>Unpacking Normativity\nConceptual, Normative, and Descriptive Issues</em>, \nOxford: Hart Publishing, pp. 77–94.",
                "Paulson, S. L., 2019, “Hans Kelsen on Legal Interpretation,\nLegal Cognition, and Legal Science”, <em>Jurisprudence</em>,\n10(2): 188–221.",
                "–––2017, “Metamorphosis in Hans\nKelsen’s Legal Philosophy”, <em>Moderna Law Review</em>,\n80(5): 860–894.",
                "–––2018, “The Purity Thesis”,\n<em>Ratio Juris</em>, 31(3): 276–306.",
                "Spaak, T., 2018, “A Challenge to Bix’s Interpretation of\nKelsen and Hart’s Views on the Normativity of Law”,\n<em>Revus</em>, 37: 75–82, doi:10.4000/revus.4561\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"PriSou\">Primary Sources</a></h3>\n<p>\n\nKelsen’s academic publications span over almost seven decades in which\nhe published dozens of books and hundreds of articles. Only about a\nthird of this vast literature has been translated to English.\nKelsen’s two most important books on the pure theory of law are the\nfirst edition of his <em>Reine Rechtslehre</em>, published in 1934 and\nrecently (2002) translated. The second edition, which Kelson published\nin 1960 (translated in 1967) is a considerably extended version of the\nfirst edition. In addition, most of the themes in these two books also\nappear in Kelsen’s <em>General Theory of Law and State</em>.  These\nthree works are cited in text as follows:\n\n</p>\n<table class=\"cellpad-small vert-top\">\n<tr><td>[PT1]</td>\n<td>1934/2002. <em>Introduction to\nthe Problems of Legal Theory</em>, B.L. Paulson and S.L. Paulson\n(trans.), Oxford: Clarendon Press.</td>\n</tr>\n<tr><td>[PT2]</td>\n<td>1960/1967. <em>Pure Theory of Law</em>,\nM. Knight (trans.), Berkeley: University of California Press.</td>\n</tr>\n<tr><td>[GT]</td>\n<td>1945/1961. <em>General Theory of Law and State</em>, A. Wedberg\n(trans.), New York: Russell &amp; Russell.</td>\n</tr>\n</table>\n<p>\n\nOther relevant publications in English include:</p>\n<ul>\n<li>1957, <em>What is Justice?</em>, Berkeley: University of \nCalifornia Press.</li>\n<li>1941, ‘The Pure Theory of Law and Analytical Jurisprudence’,\n<em>Harvard Law Review</em>, 55: 44–70.</li>\n<li>1965, ‘Professor Stone and the Pure Theory of Law: A\nReply’, <em>Stanford Law Rev</em>, 17(6): 1128–1157.</li>\n<li>1966, ‘On the Pure Theory of Law’, <em>Israel Law\n  Review</em>, 1(1): 1–7.</li>\n</ul>\n<p>\n\nFor a complete list of Kelsen’s publications that have appeared\nin English see the Appendix to H. Kelsen, <em>General Theory of\nNorms</em>, M. Hartney (trans.), Oxford: Oxford University Press,\n1991, pp. 440–454.</p>\n<h3><a name=\"SecSou\">Secondary Sources</a></h3>\n<ul class=\"hanging\">\n<li>Green, S.M., 2016, “Marmor’s Kelsen”, in\nD.A. Jeremy Telman (ed.), <em>Hans Kelsen in America</em>, Dordrecht:\nSpringer Verlag.</li>\n<li>Harris, J.W., 1980, <em>Legal Philosophies</em> (Chapter 6),\nLondon: Butterworths.</li>\n<li>Hart, H.L.A., 1961, <em>The Concept of Law</em> (Chapter 3),\nOxford: Clarendon Press.</li>\n<li>–––, 1970, “Kelsen’s Doctrine of the Unity\nof Law”, in H.E. Kiefer and M.K. Munitz (eds.), <em>Ethics and\nSocial Justice</em>, New York: State University of\nNew York Press,  pp. 171–199.</li>\n<li>Marmor, A., 2001, <em>Objective Law and Positive Values</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 2011, <em>Philosophy of Law</em>,\nThe Princeton Series in the Foundations of Contemporary Philosophy\n(S. Soames ed.), Chapter 1, Princeton: Princeton University\nPress.</li>\n<li>Paulson, S., 2002, Introduction to Kelsen’s <em>Introduction to\nthe Problems of Legal Theory</em>, Oxford: Clarendon\nPress, p. xvii.</li>\n<li>–––, 2012. “A ‘Justified\nNormativity’ Thesis in Hans Kelsen’s Pure Theory of Law?\nRejoinders to Robert Alexy and Joseph Raz”, in Matthias Klatt\n(ed.), <em>Institutionalized Reason: The Jurisprudence of Robert\nAlexy</em>, Oxford: Oxford University Press, pp. 61–111.</li>\n<li>–––, 2013. “The Great Puzzle:\nKelsen’s Basic Norm”, in Luis Duarte d’Almeida, John\nGardner, and Leslie Green (eds.), <em>Kelsen Revisited: New Essays on\nthe Pure Theory of Law</em>, Oxford: Hart Publishing,\npp. 43–62.</li>\n<li>Raz, J., 1980, <em>The Concept of a Legal System</em>,\n2<sup>nd</sup> edition, Oxford: Oxford University Press.</li>\n<li>–––, 1979, ‘Kelsen’s Theory of the\nBasic Norm’, in J. Raz, <em>The Authority of Law</em>,\nOxford: Oxford University Press, pp. 122–145.</li>\n<li>Tur, R.H. &amp; W. Twining (eds.), 1986, <em>Essays on\nKelsen</em>, Oxford: Clarendon Press.</li>\n</ul>\n<h3><a name=\"ConDisFurRea\">Contemporary Discussions and Further Reading</a></h3>\n<ul class=\"hanging\">\n<li>Bix, B., 2018, “Kelsen, Hart, and Legal Normativity”,\n<em>Revus</em>, 34: 1–17, doi:10.4000/revus.3984</li>\n<li>Gragl, P., 2017, “In Defence of Kelsenian Monism: Countering\nHart and Raz”, <em>Jurisprudence</em>, 8(2): 287–318.</li>\n<li>Green, S. M., 2021, “Hans Kelsen’s Non-Reductive\nPositivism”, in T. Spaak &amp; P. Mindus (eds.), <em>The\nCambridge Companion to Legal Positivism</em>, Cambridge: Cambridge\nUniversity Press, pp. 272–300.</li>\n<li>Guastini, R., 2016, “Kelsen on Validity (Once More)”,\n<em>Ratio Juris</em>, 29: 402–409.</li>\n<li>Langford, P., Bryan, I., &amp; McGarry, J. (eds.), 2017,\n<em>Kelsenian Legal Science and the Nature of Law</em>, Cham:\nSpringer. </li>\n<li>Orakhelashvili, A., 2019, <em>Domesticating Kelsen: Towards the Pure\nTheory of English Law</em>, Cheltenham: Edward Elgar Publishing</li>\n<li>Pavlakos, G., 2018, “Non-naturalism, Normativity and the\nMeaning of Ought: Some Lessons from Kelsen”, in  K. E. Himma,\nM. Jovanovic  &amp; B. Spaic (eds.), <em>Unpacking Normativity\nConceptual, Normative, and Descriptive Issues</em>, \nOxford: Hart Publishing, pp. 77–94.</li>\n<li>Paulson, S. L., 2019, “Hans Kelsen on Legal Interpretation,\nLegal Cognition, and Legal Science”, <em>Jurisprudence</em>,\n10(2): 188–221.</li>\n<li>–––2017, “Metamorphosis in Hans\nKelsen’s Legal Philosophy”, <em>Moderna Law Review</em>,\n80(5): 860–894.</li>\n<li>–––2018, “The Purity Thesis”,\n<em>Ratio Juris</em>, 31(3): 276–306.</li>\n<li>Spaak, T., 2018, “A Challenge to Bix’s Interpretation of\nKelsen and Hart’s Views on the Normativity of Law”,\n<em>Revus</em>, 37: 75–82, doi:10.4000/revus.4561</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "ethics: natural law tradition",
            "Hume, David: moral philosophy",
            "nature of law",
            "nature of law: legal positivism"
        ],
        "entry_link": [
            {
                "../natural-law-ethics/": "ethics: natural law tradition"
            },
            {
                "../hume-moral/": "Hume, David: moral philosophy"
            },
            {
                "../lawphil-nature/": "nature of law"
            },
            {
                "../legal-positivism/": "nature of law: legal positivism"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=lawphil-theory\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/lawphil-theory/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=lawphil-theory&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/lawphil-theory/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=lawphil-theory": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/lawphil-theory/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=lawphil-theory&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/lawphil-theory/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}