{
    "url": "logic-ontology",
    "title": "Logic and Ontology",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Thomas Hofweber\n<hofweber@unc.edu>",
        "author_links": [
            {
                "https://philosophy.unc.edu/people/thomas-hofweber/": "Thomas Hofweber"
            },
            {
                "mailto:hofweber%40unc%2eedu": "hofweber@unc.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\n<a href=\"https://philosophy.unc.edu/people/thomas-hofweber/\" target=\"other\">Thomas Hofweber</a>\n&lt;<a href=\"mailto:hofweber%40unc%2eedu\"><em>hofweber<abbr title=\" at \">@</abbr>unc<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Oct 4, 2004",
        "substantive revision Mon Mar 13, 2023"
    ],
    "preamble": "\n\nA number of important philosophical problems are at the intersection\nof logic and ontology. Both logic and ontology are diverse fields\nwithin philosophy and, partly because of this, there is not one single\nphilosophical problem about the relation between them. In this survey\narticle we will first discuss what different philosophical projects\nare carried out under the headings of “logic” and\n“ontology” and then we will look at several areas where\nlogic and ontology overlap.\n",
    "toc": [
        {
            "#Intr": "1. Introduction"
        },
        {
            "#Logi": "2. Logic"
        },
        {
            "#DiffConcLogi": "2.1 Different conceptions of logic"
        },
        {
            "#HowDiffConcLogiRelaEachOthe": "2.2 How the different conceptions of logic are related to each other"
        },
        {
            "#Onto": "3. Ontology"
        },
        {
            "#DiffConcOnto": "3.1 Different conceptions of ontology"
        },
        {
            "#HowDiffConcOntoRelaEachOthe": "3.2 How the different conceptions of ontology are related to each other"
        },
        {
            "#AreaOver": "4. Areas of overlap"
        },
        {
            "#FormLangOntoCommL1MeetO1O4": "4.1 Formal languages and ontological commitment. (L1) meets (O1) and (O4)"
        },
        {
            "#LogiNeutAbouWhatTherL2MeetO2": "4.2 Is logic neutral about what there is? (L2) meets (O2)"
        },
        {
            "#FormOntoL1MeetO2O3": "4.3 Formal ontology. (L1) meets (O2) and (O3)"
        },
        {
            "#CarnRejeOntoL1MeetO4EndO2": "4.4 Carnap’s rejection of ontology. (L1) meets (O4) and (the end of?) (O2)"
        },
        {
            "#FundLangL1MeetO4NewBegiO2": "4.5 The fundamental language. (L1) meets (O4) and (the new beginning of?) (O2)"
        },
        {
            "#FormThouStruRealL4MeetO3": "4.6 The form of thought and the structure of reality. (L4) meets (O3)"
        },
        {
            "#Conc": "5. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Introduction\n\nBoth logic and ontology are important areas of philosophy covering\nlarge, diverse, and active research projects. These two areas overlap\nfrom time to time and problems or questions arise that concern both.\nThis survey article is intended to discuss some of these areas of\noverlap. In particular, there is no single philosophical problem of\nthe intersection of logic and ontology. This is partly so because the\nphilosophical disciplines of logic and of ontology are themselves\nquite diverse and there is thus the possibility of many points of\nintersection. In the following we will first distinguish different\nphilosophical projects that are covered under the terms\n‘logic’ and ‘ontology’. We will then discuss a\nselection of problems that arise in the different areas of\ncontact.\n\n‘Logic’ and ‘ontology’ are big words in\nphilosophy, and different philosophers have used them in different\nways. Depending on what these philosophers mean by these words, and,\nof course, depending on the philosopher’s views, sometimes there\nare striking claims to be found in the philosophical literature about\ntheir relationship. But when Hegel, for example, uses\n‘logic’, or better ‘Logik’, he means something\nquite different than what is meant by the word in much of the\ncontemporary philosophical scene. We will not attempt to survey the\nhistory of the different conceptions of logic and of ontology, nor the\nhistory of the debate about their relationship. Instead this article\nwill look at this issue fairly top down, with an emphasis on areas of\noverlap that are presently actively debated. For more historical\ninformation, see Kneale and Kneale 1985. Nonetheless, two\nhistorically important figures, namely Gottlob Frege and Immanuel\nKant, will make repeat appearances below.\n2. Logic\n\nThere are several quite different topics put under the heading of\n‘logic’ in contemporary philosophy, and it is\ncontroversial how they relate to each other.\n2.1 Different conceptions of logic\n\nOn the one hand, logic is the study of certain mathematical properties\nof artificial, formal languages. It is concerned with such languages\nas the first or second order predicate calculus, modal logics, the\nlambda calculus, categorial grammars, and so forth. The mathematical\nproperties of these languages are studied in such subdisciplines of\nlogic as proof theory or model theory. Much of the work done in this\narea these days is mathematically difficult, and it might not be\nimmediately obvious why this is considered a part of philosophy.\nHowever, logic in this sense arose from within philosophy and the\nfoundations of mathematics, and it is often seen as being of\nphilosophical relevance, in particular in the philosophy of\nmathematics, and in its application to natural languages.\n\nA second discipline, also called ‘logic’, deals with\ncertain valid inferences and good reasoning connected to them. The\nidea here is that there are certain patterns of valid inferences which\nare both an object of study in itself as well as connected to certain\npatterns of good reasoning. How this connection between inference and\nreasoning is to be understood more precisely and to what extent it\nobtains is controversial, and beyond the scope of this survey.\nHowever, see Christensen 2005 for more. In any case, logic does not\ncapture good reasoning as a whole. That is the job of the theory of\nrationality. Rather it deals with inferences whose validity can be\ntraced back to the formal features of the representations that are\ninvolved in that inference, be they linguistic, mental, or other\nrepresentations. Some patterns of inference can be seen as valid by\nmerely looking at the form of the representations that are involved in\nthis inference. Such a conception of logic thus distinguishes validity\nfrom formal validity. An inference is valid just in case the\ntruth of the premises guarantees the truth of the conclusion, or\nalternatively if the premises are true then the conclusion has to be\ntrue as well, or again alternatively, if it can’t be that the\npremises are true but the conclusion is false.\n\nValidity so understood is simply a modal notion, a notion about what\nhas to be the case. Others might think of validity as involving a more\nfine grained hyperintensional notion, but in any case, validity so\nunderstood is not what logic is concerned with. Logic is concerned\nwith formal validity, which can be understood as follows. In\na system of representations, for example a language, it can be that\nsome inferences are always valid as long as the representational or\nsemantic features of certain parts of the representations are kept\nfixed, even if we abstract from or ignore the representational\nfeatures of the other parts of the representations. So, for example,\nas long as we stick to English, and we keep the meanings of certain\nwords like “some” and “all” fixed, certain\npatterns of inference, like some of Aristotle’s syllogisms, are\nvalid no matter what the meaning of the other words in the\n syllogism.[1]\n To call an inference formally valid is to assume that certain words\nhave their meaning fixed, that we are within a fixed set of\nrepresentations, and that we can ignore the meaning of the other\nwords. The words that are kept fixed are the logical vocabulary, or\nlogical constants, the others are the non-logical vocabulary. And when\nan inference is formally valid then the conclusion logically follows\nfrom the premises. This could be generalized for representations that\nare not linguistic, like graphic representations, though it would\nrequire a bit more work to do so. Logic is the study of such\ninferences, and certain related concepts and topics, like formal\ninvalidity, proof, consistency, and so on. The central notion of logic\nin this sense is the notion of logical consequence. How this notion\nshould be understood more precisely is presently widely debated, and a\nsurvey of these debates can be found in the entry on\n logical consequence.\n\nA third conception of logic takes logic to be the study of special\ntruths, or facts: the logical truths, or facts. In this sense logic\ncould be understood as a science that aims to describe certain truths\nor facts, just as other sciences aim to describe other truths. The\nlogical truths could be understood as the most general truths, ones\nthat are contained in any other body of truths that any other science\naims to describe. In this sense logic is different from biology, since\nit is more general, but it is also similar to biology in that it is a\nscience that aims to capture a certain body of truths. This way of\nlooking at logic is often associated with Frege.\n\nThis conception of logic can, however, be closely associated with the\none that takes logic to be fundamentally about certain kinds of\ninferences and about logical consequence. A logical truth, on such an\nunderstanding, is simply one that is expressed by a representation\nwhich logically follows from no assumptions, i.e. which logically\nfollows from an empty set of premises. Alternatively, a logical truth\nis one whose truth is guaranteed as long as the meaning of the logical\nconstants is fixed, no matter what the meanings of the other parts in\na representation are.\n\nAnd there are other notions of ‘logic’ as well. One of\nthem is historically prominent, but not very widely represented in the\ncontemporary debate. We will briefly discuss it here nonetheless.\nAccording to this conception of logic, it is the study of the most\ngeneral features of thoughts or judgments, or the form of thoughts or\njudgments. Logic thus understood will for example be concerned with\nthe occurrence of subject and predicate structure that many judgments\nexhibit, and with other such general features of judgments. It will\nmostly be concerned with thoughts, and not directly with linguistic\nrepresentations, though, of course, a proponent of this conception can\nclaim that there is a very close connection between them. To talk\nabout the form of a judgment will involve a subtly different notion of\n‘form’ than to talk about the form of a linguistic\nrepresentation. The form of a linguistic representation, basically,\nwas what was left once we abstract from or ignore the representational\nfeatures of everything except what we keep fixed, the logical\nconstants. The form of a thought, on the other hand, is often\nunderstood as what is left over once we abstract from its content,\nthat is, what it is about. We will briefly pursue the question below\nhow these notions of form are related to each other. This conception\nof logic is associated with Kant. Kant distinguished different notions\nof logic (for example transcendental logic, general logic, etc.), but\nwe won’t be able to discuss these here. See the entry on\n Immanuel Kant\n for more.\n\nOne important philosophical aspect of logic, at least in the senses\nthat deal with logical consequence and the forms of judgements, is its\nnormativity. Logic seems to give us a guide how we ought to reason,\nand how we ought to draw inferences from one representation to\nanother. But it is not at all clear what guide it gives us, and how we\nshould understand more precisely what norms logic puts on our\nreasoning. For example, logic does not put us under the norm “If\nyou believe \\(A\\) and you believe if \\(A\\) then \\(B\\), then you ought\nto believe \\(B\\).” After all, it might be that I should not\nbelieve \\(A\\) and if \\(A\\) then \\(B\\) in the first place. So, in\nparticular I shouldn’t believe \\(B\\). A reductio ad absurdum is\na form of argument that illustrates this. If I believe A and if A then\n\\(0=1\\), then this should lead me to abandon my belief in A, not lead\nto a belief that \\(0=1\\). The consequences of my beliefs can lead me\nto abandon them. Still, if I have some reasons for my beliefs then I\nhave at least some prima facie, but not necessarily conclusive, reason\nto hold the consequences of those beliefs. Logic might thus tell us at\nleast this much, though: whenever I have some reason to believe \\(A\\)\nand if \\(A\\) then \\(B\\), then I have a prima facie reason to believe\n\\(B\\). See Harman 1986 for the view that logic has no distinctive\nnormative role, and Field 2009 for a nice critical discussion of\nHarman’s view and an argument why logic should be tied to norms\nof rationality. A survey of this an related issues can be found in the\nentry on\n the normativity of logic.\n\nAnd, of course, logic does not tell us how we ought to reason or infer\nin all particular cases. Logic does not deal with the particular\ncases, but only with the most generally valid forms of reasoning or\ninference, ones that are valid no matter what one reasons about. In\nthis sense logic is often seen to be topic neutral. It applies no\nmatter what one is thinking or reasoning about. And this neutrality,\nor complete generality of logic, together with its normativity, is\noften put as “logic is about how we ought to think if we are to\nthink at all” or “logic is the science of the laws that we\nought to follow in our thinking no matter what we think about”.\nThere are well known philosophical puzzles about normativity, and\nthese apply to logic as well if it is normative. One is why it is that\nthinkers are under such norms. After all, why shouldn’t I think\nthe way I prefer to think, without there being some norm that governs\nmy thinking, whether I like it or not? Why is there an\n“ought” that comes with thinking as such, even if I\ndon’t want to think that way? One idea to answer this is to\nemploy the notion of a ‘constitutive aim of belief’, the\nidea that belief as such aims at something: the truth. If so then\nmaybe one could argue that by having beliefs I am under the norm that\nI ought to have true ones. And if one holds that one of the crucial\nfeatures of logically valid inferences is that they preserve truth\nthen one could argue that the logical laws are norms that apply to\nthose who have beliefs. See Velleman 2000 for more on the aim of\nbelief. The normativity of logic will not be central for our\ndiscussion to follow, but the topic neutrality and generality will\n be.[2]\n\nOverall, we can thus distinguish four notions of logic:\n\n(L1)\n the study of artificial formal languages\n(L2)\n the study of\nformally valid inferences and logical consequence\n(L3)\n the study of logical truths\n(L4)\n the study of the general features, or form, of judgements\n\n\nThere is, of course, a question how these different conceptions of\nlogic relate to each other. The details of their relationship invite\nmany hard questions, but we should briefly look at this\nnonetheless.\n2.2 How the different conceptions of logic are related to each other\n\nHow (L1) and (L2) relate to each other is subject of controversy. One\nstraightforward, though controversial view, is the following. For any\ngiven system of representations, like sentences in a natural language,\nthere is one and only one set of logical constants. Thus there will be\none formal language that best models what logically valid inferences\nthere are among these natural representations. This formal language\nwill have a logical vocabulary that captures the inferential\nproperties of the logical constants, and that models all other\nrelevant features of the natural system of representation with\nnon-logical vocabulary. One especially important system of\nrepresentations are our natural languages. Thus (L1) is the study of\nformal languages of which one is distinguished, and this one\ndistinguished language nicely represents the fixed and non-fixed\nfeatures of our natural languages, through its logical and non-logical\nvocabulary, at least assuming that our natural languages are similar\nto each other in this regard. And validity in that formal language, a\ntechnical notion defined in the appropriate way for that formal\nlanguage, nicely models logical validity or logical consequence in our\nnatural language system of representations. Or so this view of the\nrelationship between (L1) and (L2) holds.\n\nThis view of the relationship between (L1) and (L2), however, assumes\nthat there is one and only one set of logical constants for each\nsystem of representations. A contrary view holds that which\nexpressions are treated as logical constants is a matter of choice,\nwith different choices serving different purposes. If we fix, say,\n‘believes’ and ‘knows’ then we can see that\n‘\\(x\\) believes that \\(p\\)’ is implied by ‘\\(x\\)\nknows that \\(p\\)’ (given widely held views about knowledge and\nbelief). This does not mean that ‘believes’ is a logical\nconstant in an absolute sense. Given other interests, other\nexpressions can be treated as logical. According to this conception,\ndifferent formal languages will be useful in modeling the inferences\nthat are formally valid given different set of ‘logical\nconstants’ or expressions whose meaning is kept fixed.\n\nThis debate thus concerns whether there is one and only one set of\nlogical constants for a system of representations, and if so, which\nones are the logical ones. We will not get into this debate here, but\nthere is quite a large literature on what logical constants are, and\nhow logic can be demarcated. For a general discussion and further\nreferences, see for example Engel 1991. Some of the classic papers\nin this debate include Hacking 1979, who defends a proof-theoretic\nway of distinguishing logical constants from other expressions. The\nleading idea here is that logical constants are those whose meaning\ncan be given by proof-theoretic introduction and elimination rules. On\nthe other hand, Mauthner 1946, van Benthem 1986, van Benthem\n1989, and Tarski 1986 defend semantic ways to mark that difference.\nThe leading idea here is that logical notions are ‘permutation\ninvariant’. Since logic is supposed to be completely general and\nneutral with respect to what the representations are about, it should\nnot matter to logic if we switch around the objects that these\nrepresentations are about. So, logical notions are those that are\ninvariant under permutations of the domain. Van Benthem 1989 gives a\ngeneral formulation to this idea. See the entry on\n logical constants\n for more.\n\nThe relationship between (L2) and (L3) was briefly addressed above.\nThey seem to be closely related because a logical truth can be\nunderstood as one that follows from an empty set of premises, and A\nbeing a logical consequence of B can be understood as it being a\nlogical truth that if A then B. There are some questions to be ironed\nout about how this is supposed to go more precisely. How should we\nunderstand cases of logical consequence from infinitely many premises?\nAre logical truths all finitely statable? But for our purposes we can\nsay that they are rather closely related.\n\nThe relationship between (L2) and (L4) on the other hand raises some\nquestions. For one, of course, there is an issue about what it means\nto say that judgments have a form, and whether they do in the relevant\nsense. But one way in which this question could be understood directly\nties it to (L2). If thoughts, and thus judgments, are realized by\nminds having a certain relation to mental representations, and if\nthese representations are themselves structured like a language, with\na “syntax” and a “semantics” (properly\nunderstood), then the form of a judgment could be understood just like\nthe form of a sentence. Such a view of thoughts is commonly called the\nLanguage of Thought hypothesis, see Fodor 1975, and if it is\ncorrect then in the language of thought there might be logical and\nnon-logical vocabulary. The form of a judgment could be understood\nalong the lines we understood the form of a linguistic representation\nwhen we talked about formally valid inferences. Thus the relationship\nbetween (L2) and (L4) is rather direct. On both conceptions of logic\nwe deal with logical constants, the difference is that one deals with\na system of mental representations, the other with a system of\nlinguistic representations. Both, presumably, would deal with\ncorresponding sets of logical constants. Even though mental and\nlinguistic representations form different sets of representations,\nsince they are closely connected with each other, for every logical\nconstant in one of these sets of representations there will be another\none of the corresponding syntactic type and with the same content, or\nat least a corresponding inferential role.\n\n\n\nBut this conception of their relationship assumes that the\n“general features of judgments” or “forms of\njudgment” which (L4) is concerned with deal with something like\nthe logical constants in the language of thought. Here the judgment as\na mental act is assumed to operate on a mental representation that\nitself has syntactic structure. And the form of the judgment was\nunderstood as the form of the representation that represents the\ncontent of the judgment, whereby the form of the representation was\nunderstood along the lines of (L2), involving logical constants. But\nwhat if we can’t understand “form of judgment” or\n“form of thought” that way? One way this could fail is if\nthe language of thought hypothesis itself fails, and if mental states\ndo not involve representations that have something like a syntactic\nform. The question then becomes, first how should we understand\n‘form of judgement’ more precisely, and secondly, how does\nlogic, as the discipline concerned with forms of judgments in the\nsense of (L4), relate to (L2)?\n\nOne way to answer the first question is to understand “form of\njudgment” as not being concerned with the representation that\nmight be involved in a judgment, but rather with the content of the\njudgment, i.e. with what the judgment is representing to be the case.\nContents of judgments can be seen as propositions, and these can be\nunderstood as entities that are structured, for example Russellian\npropositions. Such propositions are ordered sets whose members are\nobjects and properties. How such a conception of (L4) relates to (L2)\nwill in part depend on how one thinks of the logical constants in\nRussellian propositions. If they are higher-order properties or\nfunctions that are members of these propositions alongside other\nobjects and properties then presumably the logical constants have\ncontent. But this seems to be in conflict with an understanding of\n(L4) as being concerned with the form that is left once we abstract\nfrom all content. If would seem that on such an understanding of (L4)\none can’t closely associate ‘form of judgment’,\nunderstood as what’s left once we abstract from all content of\nthe judgment, with logical constants if the latter have content.\n\nAnother way to understand “form” as being concerned with\nwhat the judgment is about, rather than the judgment itself, is to\nthink of what it is about, the world, itself as having a form. In this\nsense we associate “form” neither with the representation\nthat is involved in the judgment, nor with the proposition which is\nits content, but rather with the world that is judged about. On such a\nconception the world itself has a form or basic structure. (L4) would\nbe concerned with this structure. How (L4) relates to (L2) is then a\nsomewhat tricky question. One way, again, could be that the logical\nconstants that (L2) is concerned with correspond to the structure of\nwhat a representation in which they occur is about, but don’t\ncontribute to the content of that representation. This again seems\nincompatible with the logical constants themselves having content. So,\nwhether one associates form of judgment with the\n‘syntactic’ structure of a representation that is involved\nin the judgment, or with the content of that representation, or with\nthe structure of what the representation is about, the relationship\nbetween (L4) and (L2) will in part depend on whether one thinks the\nlogical constants themselves contribute to content. If they do, and if\nform is contrasted with content, then a close association seems\nimpossible. If the logical constants don’t have content, then it\nmight be possible.\n\nFinally, the relationship between (L1) and (L4) either comes down to\nthe same as that between (L1) and (L2), if we understand ‘form\nof thought’ analogous to ‘form of representation’.\nIf not, then it will again depend on how (L4) is understood more\nprecisely.\n\nThus there are many ways in which (L1), (L2), (L3), and (L4) are\nconnected, and many in which they are quite different.\n3. Ontology\n3.1 Different conceptions of ontology\n\nAs a first approximation, ontology is the study of what there is. Some\ncontest this formulation of what ontology is, so it’s only a\nfirst approximation. Many classical philosophical problems are\nproblems in ontology: the question whether or not there is a god, or\nthe problem of the existence of universals, etc.. These are all\nproblems in ontology in the sense that they deal with whether or not a\ncertain thing, or more broadly entity, exists. But ontology is usually\nalso taken to encompass problems about the most general features and\nrelations of the entities which do exist. There are also a number of\nclassic philosophical problems that are problems in ontology\nunderstood in this way. For example, the problem of how a universal\nrelates to a particular that has it (assuming there are universals and\nparticulars), or the problem of how an event like John eating a cookie\nrelates to the particulars John and the cookie, and the relation of\neating, assuming there are events, particulars and relations. These\nkinds of problems quickly turn into metaphysics more generally, which\nis the philosophical discipline that encompasses ontology as one of\nits parts. The borders here are a little fuzzy. But we have at least\ntwo parts to the overall philosophical project of ontology, on our\npreliminary understanding of it: first, say what there is, what\nexists, what the stuff of reality is made out of, secondly, say what\nthe most general features and relations of these things are.\n\nThis way of looking at ontology comes with two sets of problems which\nleads to the philosophical discipline of ontology being more complex\nthan just answering the above questions. The first set of problems is\nthat it isn’t clear how to approach answering these questions.\nThis leads to the debate about ontological commitment. The second set\nof problems is that it isn’t so clear what these questions\nreally are. This leads to the philosophical debate about\nmeta-ontology. Let's look at them in turn.\n\nOne of the troubles with ontology is that it not only isn’t\nclear what there is, it also isn’t so clear how to settle\nquestions about what there is, at least not for the kinds of things\nthat have traditionally been of special interest to philosophers:\nnumbers, properties, God, etc. Ontology is thus a philosophical\ndiscipline that encompasses besides the study of what there is and the\nstudy of the general features of what there is also the study of what\nis involved in settling questions about what there is in general,\nespecially for the philosophically tricky cases. How we can find out\nwhat there is isn’t an easy question to answer. It might seem\nsimple enough for regular objects that we can perceive with our eyes,\nlike my house keys, but how should we decide it for such things as,\nsay, numbers or properties? One first step to making progress on this\nquestion is to see if what we believe already rationally settles this\nquestion. That is to say, given that we have certain beliefs, do these\nbeliefs already bring with them a rational commitment to an answer to\nsuch questions as ‘Are there numbers?’ If our beliefs\nbring with them a rational commitment to an answer to an ontological\nquestion about the existence of certain entities then we can say that\nwe are committed to the existence of these entities. What precisely is\nrequired for such a commitment to occur is subject to debate, a debate\nwe will look at momentarily. To find out what one is committed to with\na particular set of beliefs, or acceptance of a particular theory of\nthe world, is part of the larger discipline of ontology.\n\nBesides it not being so clear what it is to commit yourself to an\nanswer to an ontological question, it also isn’t so clear what\nan ontological question really is, and thus what it is that ontology\nis supposed to accomplish. To figure this out is the task of\nmeta-ontology, which strictly speaking is not part of ontology\nconstrued narrowly, but the study of what ontology is. However, like\nmost philosophical disciplines, ontology more broadly construed\ncontains its own meta-study, and thus meta-ontology is part of\nontology, more broadly construed. Nonetheless it is helpful to\nseparate it out as a special part of ontology. Many of the\nphilosophically most fundamental questions about ontology really are\nmeta-ontological questions. Meta-ontology has not been too popular in\nthe latter parts of the 20th century, partly because one\nmeta-ontological view, the one often associated with Quine, had been\nwidely accepted as the correct one, but this acceptance has been\nchallenged in recent years in a variety of ways. One motivation for\nthe study of meta-ontology is simply the question of what question\nontology aims to answer. Take the case of numbers, for example. What\nis the question that we should aim to answer in ontology if we want to\nfind out if there are numbers, that is, if reality contains numbers\nbesides whatever else it is made up from? This way of putting it\nsuggest an easy answer: ‘Are there numbers?’ But this\nquestion seems like an easy one to answer. An answer to it is implied,\nit seems, by trivial mathematics, say that the number 7 is less than\nthe number 8. If the latter, then there is a number which is less than\n8, namely 7, and thus there is at least one number. Can ontology be\nthat easy? The study of meta-ontology will have to determine, amongst\nothers, if ‘Are there numbers?’ really is the question\nthat the discipline of ontology is supposed to answer, and more\ngenerally, what ontology is supposed to do. We will pursue these\nquestions further below. As we will see, several philosophers think\nthat ontology is supposed to answer a different question than what\nthere is, but they often disagree on what that question is.\n\nThe larger discipline of ontology can thus be seen as having four\nparts:\n\n(O1)\n the study of ontological commitment, i.e. what we or others are\ncommitted to,\n(O2)\n the study of what there is,\n(O3)\n the study of the most general features of what there is, and how\nthe things there are relate to each other in the metaphysically most\ngeneral ways,\n(O4)\n the study of meta-ontology, i.e. saying what task it is that the\ndiscipline of ontology should aim to accomplish, if any, how the\nquestions it aims to answer should be understood, and with what\nmethodology they can be answered.\n\n3.2 How the different conceptions of ontology are related to each other\n\nThe relationship between these four seems rather straightforward. (O4)\nwill have to say how the other three are supposed to be understood. In\nparticular, it will have to tell us if the question to be answered in\n(O2) indeed is the question what there is, which was taken above to be\nonly a first approximation for how to state what ontology is supposed\nto do. Maybe it is supposed to answer the question what is real\ninstead, or what is fundamental, some other question. Whatever one\nsays here will also affect how one should understand (O1). We will at\nfirst work with what is the most common way to understand (O2) and\n(O1), and discuss alternatives in turn. If (O1) has the result that\nthe beliefs we share commit us to a certain kind of entity then this\nrequires us either to accept an answer to a question about what there\nis in the sense of (O2) or to revise our beliefs. If we accept that\nthere is such an entity in (O2) then this invites questions in (O3)\nabout its nature and the general relations it has to other things we\nalso accept. On the other hand, investigations in (O3) into the nature\nof entities that we are not committed to and that we have no reason to\nbelieve exist would seem like a rather speculative project, though, of\ncourse, it could still be fun and interesting.\n4. Areas of overlap\n\nThe debates about logic and about ontology overlap at various places.\nGiven the division of ontology into (O1)–(O4), and the division\nof logic into (L1)–(L4) we can consider several issues where\nlogic, understood a certain way, overlaps with ontology, understood a\ncertain way. In the following we will discuss some paradigmatic\ndebates related to the relationship between logic and ontology,\norganized by areas of overlap.\n4.1 Formal languages and ontological commitment. (L1) meets (O1) and (O4)\n\nSuppose we have a set of beliefs, and we wonder what the answer to the\nontological question ‘Are there numbers?’ is, assuming\n(O4) tells us this is the ontological question about numbers. One\nstrategy to see whether our beliefs already commit us to an answer of\nthis question is as follows: first, write out all those beliefs in a\npublic language, like English. This by itself might not seem to help\nmuch, since if it wasn’t clear what my beliefs commit me to, why\nwould it help to look at what acceptance of what these sentences say\ncommits me to? But now, secondly, write these sentences in what is\noften called ‘canonical notation’. Canonical notation can\nbe understood as a formal or semi-formal language that brings out the\ntrue underlying structure, or ‘logical form’ of a natural\nlanguage sentence. In particular, such a canonical notation will make\nexplicit which quantifiers do occur in these sentences, what their\nscope is, and the like. This is where formal languages come into the\npicture. After that, and thirdly, look at the variables that are bound\nby these\n quantifiers.[3]\n What values do they have to have in order for these sentences all to\nbe true? If the answer is that the variables have to have numbers as\ntheir values, then you are committed to numbers. If not then you\naren’t committed to numbers. The latter doesn’t mean that\nthere are no numbers, of course, just as you being committed to them\ndoesn’t mean that there are numbers. But if your beliefs are all\ntrue then there have to be numbers, if you are committed to numbers.\nOr so this strategy goes.\n\nAll this might seem a lot of extra work for little. What do we really\ngain from these ‘canonical notations’ in determining\nontological commitment? One attempt to answer this, which partly\nmotivates the above way of doing things, is based on the following\nconsideration: We might wonder why we should think that quantifiers\nare of great importance for making ontological commitments explicit.\nAfter all, if I accept the apparently trivial mathematical fact that\nthere is a number between 6 and 8, does this already commit me to an\nanswer to the ontological question whether there are numbers out\nthere, as part of reality? The above strategy tries to make explicit\nthat and why it in fact does commit me to such an answer. This is so\nsince natural language quantifiers are fully captured by their formal\nanalogues in canonical notation, and the latter make ontological\ncommitments obvious because of their semantics. Such formal\nquantifiers are given what is called an ‘objectual\nsemantics’. This is to say that a particular quantified\nstatement \\(\\lsquo \\exists x\\,Fx\\rsquo\\) is true just in case there\nis an object in the domain of quantification that, when assigned as\nthe value of the variable \\(\\lsquo x\\rsquo\\), satisfies the open formula\n\\(\\lsquo Fx\\rsquo\\). This makes obvious that the truth of a\nquantified statement is ontologically relevant, and in fact ideally\nsuited to make ontological commitment explicit, since we need entities\nto assign as the values of the variables. Thus (L1) is tied to (O1).\nThe philosopher most closely associated with this way of determining\nontological commitment, and with the meta-ontological view on which it\nis based, is Quine (in particular Quine 1948). See also van Inwagen\n1998 for a presentation sympathetic to Quine.\n\nThe above account of ontological commitment has been criticized from a\nvariety of different angles. One criticism focuses on the semantics\nthat is given for quantifiers in the formal language that is used as\nthe canonical notation of the natural language representations of the\ncontents of beliefs. The above, objectual semantics is not the only\none that can be given to quantifiers. One widely discussed alternative\nis the so-called ‘substitutional semantics’. According to\nit we do not assign entities as values of variables. Rather, a\nparticular quantified statement \\(\\lsquo \\exists x\\,Fx\\rsquo\\) is\ntrue just in case there is a term in the language that when\nsubstituted for \\(\\lsquo x\\rsquo\\) in \\(\\lsquo Fx\\rsquo\\) has a true\nsentence as its result. Thus, \\(\\lsquo \\exists x\\,Fx\\rsquo\\) is true\njust in case there is an instance \\(\\lsquo Ft\\rsquo\\) which is true,\nfor \\(\\lsquo t\\rsquo\\) a term in the language in question,\nsubstituted for all (free) occurrences of \\(\\lsquo x\\rsquo\\) in\n\\(\\lsquo Fx\\rsquo\\). The substitutional semantics for the quantifiers\nhas often been used to argue that there are ontologically innocent\nuses of quantifiers, and that what quantified statements we accept\ndoes not directly reveal ontological commitment. Gottlieb (1980)\nprovides more details on substitutional quantification, and an attempt\nto use it in the philosophy of mathematics. Earlier work was done by\nRuth Marcus, and is reprinted in Marcus 1993.\n\nAnother objection to the above account of determining ontological\ncommitment goes further and questions the use of a canonical notation,\nand of formal tools in general. It states that if the ontological\nquestion about numbers simply is the question ‘Are there\nnumbers?’ then all that matters for ontological commitment is\nwhether or not what we accept implies ‘There are numbers’.\nIn particular, it is irrelevant what the semantics for quantifiers in\na formal language is, in particular, whether it is objectual or\nsubstitutional. What ontological commitment comes down to can be\ndetermined at the level of ordinary English. Formal tools are of no,\nor at best limited, importance. Ontological commitment can thus\naccording to this line of thought be formulated simply as follows: you\nare committed to numbers if what you believe implies that there are\nnumbers. Notwithstanding the debate between the substitutional and\nobjectual semantics, we do not need any formal tools to spell out the\nsemantics of quantifiers. All that matters is that a certain\nquantified statement ‘There are \\(F\\)s’ is implied by what\nwe believe for us to be committed to \\(F\\)s. What does not matter is\nwhether the semantics of the quantifier in “There are\n\\(F\\)s” (assuming it contains a\n quantifier[4])\n is objectual or substitutional.\n\nHowever, even if one agrees that what matters for ontological\ncommitment is whether or not what one believes implies that there are\n\\(F\\)s, for a certain kind of thing \\(F\\), there might still be room\nfor formal tools. First of all, it isn’t clear what implies\nwhat. Whether or not a set of statements that express my beliefs imply\nthat there are entities of a certain kind might not be obvious, and\nmight even be controversial. Formal methods can be useful in\ndetermining what implies what. On the other hand, even though formal\nmethods can be useful in determining what implies what, it is not\nclear which formal tools are the right ones for modeling a natural\nsystem of representations. It might seem that to determine which are\nthe right formal tools we already need to know what the implicational\nrelations are between the natural representations that we attempt to\nmodel, at least in basic cases. This could mean that formal tools are\nonly of limited use for deciding controversial cases of\nimplication.\n\nBut then, again, it has been argued that often it is not at all clear\nwhich statements really involve quantifiers at a more fundamental\nlevel of analysis, or\n logical form.\n Russell (1905) famously argued that “the King of France”\nis a quantified expression, even though it appears to be a referring\nexpression on the face of it, a claim now accepted by many. And\nDavidson (1967) argued, that ‘action sentences’ like\n“Fred buttered the toast” involve quantification over\nevents in the logical form, though not on the surface, a claim that is\nmore controversial. One might argue in light of these debates that\nwhich sentences involve quantification over what can’t be\nfinally settled until we have a formal semantics of all of our natural\nlanguage, and that this formal semantics will give us the ultimate\nanswer to what we are quantifying over. But then again, how are we to\ntell that the formal semantics proposed is correct, if we don’t\nknow the inferential relations in our own language?\n\nOne further use that formal tools could have besides all the above is\nto make ambiguities and different ‘readings’ explicit, and\nto model their respective inferential behavior. For example, formal\ntools are especially useful to make scope ambiguities explicit, since\ndifferent scope readings of one and the same natural language sentence\ncan be represented with different formal sentences which themselves\nhave no scope ambiguities. This use of formal tools is not restricted\nto ontology, but applies to any debates where ambiguities can be a\nhindrance. It does help in ontology, though, if some of the relevant\nexpressions in ontological debates, like the quantifiers themselves,\nexhibit such different readings. Then formal tools will be most useful\nto make this explicit. Whether or not quantifiers indeed do have\ndifferent readings is a question that will not be solved with formal\ntools, but if they do then these tools will be most useful in\nspecifying what these readings are. For a proposal of this latter\nkind, see Hofweber 2016. One consequence of this is a meta-ontology\ndifferent from Quine’s, as we will discuss below.\n\nAll this discussion in this section assumed that ontological\ncommitment is connected to a conception of ontology that concerns what\nthere is. But this is not universally accepted, in particular\nrecently. Maybe ontology does not concern what there is, but what is\nfundamental, in some sense of the word. If so, then issues tied to\nquantifiers are not of the most central importance when it comes to\nontological commitment, although they would still play a role. The\nmain question would then be connected to fundamentality. And here,\ntoo, formal languages might play a role in determining what one is\ncommitted to being fundamental. We will more closely discuss the role\nof formal languages in conceptions of ontology as concerning the\nfundamental below, in section 4.5. \n4.2 Is logic neutral about what there is? (L2) meets (O2)\n\nLogically valid inferences are those that are guaranteed to be valid\nby their form. And above we spelled this out as follows: an inference\nis valid by its form if as long as we fix the meaning of certain\nspecial expressions, the logical constants, we can ignore the meaning\nof the other expressions in the statements involved in the inference,\nand we are always guaranteed that the inference is valid, no matter\nwhat the meaning of the other expressions is, as long as the whole is\nmeaningful. A logical truth can be understood as a statement whose\ntruth is guaranteed as long as the meanings of the logical constants\nare fixed, no matter what the meaning of the other expressions is.\nAlternatively, a logical truth is one that is a logical consequence\nfrom no assumptions, i.e. an empty set of premises.\n\nDo logical truths entail the existence of any entities, or is their\ntruth independent of what exists? There are some well known\nconsiderations that seem to support the view that logic should be\nneutral with respect to what there is. On the other hand, there are\nalso some well known arguments to the contrary. In this section we\nwill survey some of this debate.\n\nIf logical truth are ones whose truth is guaranteed as long as the\nmeaning of the logical constants is kept fixed then logical truths are\ngood candidates for being analytic truths. Can analytic truths imply\nthe existence of any entities? This is an old debate, often conducted\nusing “conceptual truths” instead of “analytic\ntruths”. The most prominent debate of this kind is the debate\nabout the ontological argument for the existence of God. Many\nphilosophers have maintained that there can be no conceptual\ncontradiction in denying the existence of particular entities, and\nthus there can be no proof of their existence with conceptual truths\nalone. In particular, an ontological argument for the existence of God\nis impossible. A famous discussion to this effect is Kant’s\ndiscussion of the ontological argument (Kant 1781/7, KrV\nA592/B620 ff). On the other hand, many other philosophers have\nmaintained that such an ontological argument is possible, and they\nhave made a variety of different proposals how it can go. We will not\ndiscuss the ontological argument here, however, it is discussed in\ndetail in different formulations in the entry on\n ontological arguments\n in this encyclopedia.\n\nWhatever one says about the possibility of proving the existence of an\nobject purely with conceptual truths, many philosophers have\nmaintained that at least logic has to be neutral about what\nthere is. One of the reasons for this insistence is the idea that\nlogic is topic neutral, or purely general. The logical truths are the\nones that hold no matter what the representations are about, and thus\nthey hold in any domain. In particular, they hold in an empty domain,\none where there is nothing at all. And if that is true then logical\ntruths can’t imply that anything exists. But that argument might\nbe turned around by a believer in logical objects, objects whose\nexistence is implied by logic alone. If it is granted that logical\ntruths have to hold in any domain, then any domain has to contain the\nlogical objects. Thus for a believer in logical objects there can be\nno empty domain.\n\nThere is a close relationship between this debate and a common\ncriticism that standard formal logics (in the sense of (L1))\nwon’t be able to capture the logical truths (in the sense of\n(L3)). It is the debate about the status of the empty domain in the\nsemantics of first and second order logical systems.\n\nIt is a logical truth in (standard) first order logic that something\nexists, i.e., ‘\\(\\exists x\\,x=x\\)’. Similarly, it is a\nlogical truth in (standard versions of) second order logic that\n‘\\(\\exists F\\forall x\\,(Fx \\vee \\neg Fx)\\)’. These are\nexistentially quantified statements. Thus, one might argue, logic is\nnot neutral with respect to what there is. There are logical truths\nthat state that something exists. However, it would be premature to\nconclude that logic is not neutral about what there is, simply because\nthere are logical truths in (standard) first or second order logic\nwhich are existential statements. If we look more closely how it comes\nabout that these existential statements are logical truths in these\nlogical systems we see that it is only so because, by definition, a\nmodel for (standard) first order logic has to have a non-empty domain.\nIt is possible to allow for models with an empty domain as well (where\nnothing exists), but models with an empty domain are excluded, again,\nby definition from the (standard) semantics in first order logic. Thus\n(standard) first order logic is sometimes called the logic of first\norder models with a non-empty domain. If we allow an empty domain as\nwell we will need different axioms or rules of inference to have a\nsound proof system, but this can be done. Thus even though there are\nformal logical systems, in the sense of (L1) in which there are\nlogical truths that are existential statements, this does not answer\nthe question whether or not there are logical truths, in the sense of\n(L2), that are existential statements. The question rather is which\nformal system, in the sense of (L1), best captures the logical truths,\nin the sense of (L2). So, even if we agree that a first order logical\nsystem is a good formal system to represent logical inferences, should\nwe adopt the axioms and rules for models with or without an empty\ndomain?\n\nA related debate is the debate about free logic. Free logics are\nformal systems that drop the assumption made in standard first and\nhigher order logic that every closed term denotes an object in the\ndomain of the model. Free logic allows for terms that denote nothing,\nand in free logic certain rules about the inferential interaction\nbetween quantifiers and terms have to be modified. Whether free or\nun-free (standard) logic is the better formal model for natural\nlanguage logical inference is a further question. For more discussion\nof logic with an empty domain see Quine 1954 and Williamson 1999.\nFor a sound and complete proof system for logic with an empty domain,\nsee Tennant 1990. For a survey article on free logic, see Lambert\n2001.\n\nHow innocent logic is with respect to ontology is also at the heart of\nthe debate about the status of second order logic as logic. Quine\n(1970) argued that second order logic was “set theory in\nsheep’s clothing”, and thus not properly logic at all.\nQuine was concerned with the questions of whether second order\nquantifiers should be understood as ranging over properties or over\nsets of individuals. The former were considered dubious in various\nways, the latter turn second order logic into set theory. This\napproach to second order logic has been extensively criticized by\nvarious authors, most notably George Boolos, who in a series of\npapers, collected in part I of Boolos 1998, attempted to vindicate\nsecond order logic, and to propose a plural interpretation, which is\ndiscussed in the article on\n plural quantification.\n\nA particularly important and pressing case of the ontological\nimplications of logic are logicist programs in the philosophy of\nmathematics, in particular Frege’s conception of logical objects\nand his philosophy of arithmetic. Frege and neo-Fregeans following him\nbelieve that arithmetic is logic (plus definitions) and that numbers\nare objects whose existence is implied by arithmetic. Thus in\nparticular, logic implies the existence of certain objects, and\nnumbers are among them. Frege’s position has been criticized as\nbeing untenable since logic has to be neutral about what there is.\nThus mathematics, or even a part thereof, can’t be both logic\nand about objects. The inconsistency of Frege’s original\nformulation of his position sometimes has been taken to show this, but\nsince consistent formulations of Frege’s philosophy of\narithmetic have surfaced this last point is moot. Frege’s\nargument for numbers as objects and arithmetic as logic is probably\nthe best known argument for logic implying the existence of entities.\nIt has been very carefully investigated in recent years, but whether\nor not it succeeds is controversial. Followers of Frege defend it as\nthe solution to major problems in the philosophy of mathematics; their\ncritics find the argument flawed or even just a cheap trick that is\nobviously going nowhere. We will not discuss the details here, but a\ndetailed presentation of the argument can be found in the entry on\n Frege’s theorem and foundations of arithmetic\n as well as Rosen 1993, which gives a clear and readable\npresentation of the main argument of Wright (1983), which in turn is\npartially responsible for a revival of Fregean ideas along these\nlines. Frege’s own version is in his classic Grundlagen\n(1884). A discussion of recent attempts to revive Frege can be found\nin Hale and Wright 2001, Boolos 1998 and Fine 2002. A discussion\nof Frege’s and Kant’s conceptions of logic is in\nMacFarlane 2002 which also contains many historical references.\n4.3 Formal ontology. (L1) meets (O2) and (O3)\n\nFormal ontologies are theories that attempt to give precise\nmathematical formulations of the properties and relations of certain\nentities. Such theories usually propose axioms about these entities in\nquestion, spelled out in some formal language based on some system of\nformal logic. Formal ontology can been seen as coming in three kinds,\ndepending on their philosophical ambition. Let’s call them\nrepresentational, descriptive, and systematic. We will in this section\nbriefly discuss what philosophers, and others, have hoped to do with\nsuch formal ontologies.\n\nA formal ontology is a mathematical theory of certain entities,\nformulated in a formal, artificial language, which in turn is based on\nsome logical system like first order logic, or some form of the lambda\ncalculus, or the like. Such a formal ontology will specify axioms\nabout what entities of this kind there are, what their relations among\neach other are, and so on. Formal ontologies could also only have\naxioms that state how the things the theory is about, whatever they\nmay be, relate to each other, but no axioms that state that certain\nthings exist. For example, a formal ontology of events won’t say\nwhich events there are. That is an empirical question. But it might\nsay under what operations events are closed under, and what structure\nall the events there are exhibit. Similarly for formal ontologies of\nthe part-whole relation, and others. See Simons 1987 for a well\nknown book on various formal versions of mereology, the study of parts\nand wholes.\n\nFormal ontologies can be useful in a variety of different ways. One\ncontemporary use is as a framework to represent information in an\nespecially useful way. Information represented in a particular formal\nontology can be more easily accessible to automated information\nprocessing, and how best to do this is an active area of research in\ncomputer science. The use of the formal ontology here is\nrepresentational. It is a framework to represent information, and as\nsuch it can be representationally successful whether or not the formal\ntheory used in fact truly describes a domain of entities. So, a formal\nontology of states of affairs, lets say, can be most useful to\nrepresent information that might otherwise be represented in plain\nEnglish, and this can be so whether or not there indeed are any states\nof affairs in the world. Such uses of formal ontologies are thus\nrepresentational.\n\nA different philosophical use of a formal ontology is one that aims to\nbe descriptive. A descriptive formal ontology aims to correctly\ndescribe a certain domain of entities, say sets, or numbers, as\nopposed to all things there are. Take common conceptions of set theory\nas one example. Many people take set theory to aim at correctly\ndescribing a domain of entities, the pure sets. This is, of course, a\ncontroversial claim in the philosophy of set theory, but if it is\ncorrect then set theory could be seen as a descriptive formal ontology\nof pure sets. It would imply that among incompatible formal theories\nof sets only one could be correct. If set theory were merely\nrepresentational then both of the incompatible theories could be\nequally useful as representational tools, though probably for\ndifferent representational tasks.\n\nFinally, formal ontologies have been proposed as systematic theories\nof what there is, with some restrictions. Such systematic theories\nhope to give one formal theory for all there is, or at least a good\npart of it. Hardly anyone would claim that there can be a simple\nformal theory that correctly states what concrete physical objects\nthere are. There does not seem to be a simple principle that\ndetermines whether there are an even or odd number of mice at a\nparticular time. But maybe this apparent randomness only holds for\nconcrete physical objects. It might not hold for abstract objects,\nwhich according to many exist not contingently, but necessarily if at\nall. Maybe a systematic, simple formal theory is possible of all\nabstract objects. Such a systematic formal ontology will most commonly\nhave one kind of entities which are the primary subject of the theory,\nand a variety of different notions of reduction that specify how other\n(abstract) objects really are entities of this special kind. A simple\nview of this kind would be one according to which all abstract objects\nare sets, and numbers, properties, etc. are really special kinds of\nsets. However, more sophisticated versions of systematic formal\nontologies have been developed. An ambitious systematic formal\nontology can be found in Zalta 1983 and Zalta 1999 [2022] (see the\nOther Internet Resources).\n\nRepresentational formal ontologies, somewhat paradoxically, are\nindependent of any strictly ontological issues. Their success or\nfailure is independent of what there is. Descriptive formal ontologies\nare just like representational ones, except with the ambition of\ndescribing a domain of entities. Systematic formal ontologies go\nfurther in not only describing one domain, but in relating all\nentities (of a certain kind) to each other, often with particular\nnotions of reduction. These theories seem to be the most ambitious.\nTheir motivation comes from an attempt to find a simple and systematic\ntheory of all, say, abstract entities, and they can rely on the\nparadigm of aiming for simplicity in the physical sciences as a guide.\nThey, just like descriptive theories, will have to have as their\nstarting point a reasonable degree of certainty that we indeed are\nontologically committed to the entities they aim to capture. Without\nthat these enterprises seem to have little attraction. But even if the\nlatter philosophical ambitions fail, a formal ontology can still be a\nmost useful representational tool.\n4.4 Carnap’s rejection of ontology. (L1) meets (O4) and (the end of?) (O2)\n\nOne interesting view about the relationship between formal languages,\nontology, and meta-ontology is the one developed by Carnap in the\nfirst half of the 20th century, and which is one of the starting\npoints of the contemporary debate in ontology, leading to the\nwell-known exchange between Carnap and Quine, to be discussed below.\nAccording to Carnap one crucial project in philosophy is to develop\nframeworks that can be used by scientists to formulate\ntheories of the world. Such frameworks are formal languages that have\na clearly defined relationship to experience or empirical evidence as\npart of their semantics. For Carnap it was a matter of usefulness and\npracticality which one of these frameworks will be selected by the\nscientists to formulate their theories in, and there is no one correct\nframework that truly mirrors the world as it is in itself. The\nadoption of one framework rather than another is thus a practical\nquestion.\n\nCarnap distinguished two kinds of questions that can be asked about\nwhat there is. One are the so-called ‘internal questions’,\nquestions like ‘Are there infinitely many prime numbers?’\nThese questions make sense once a framework that contains talk about\nnumbers has been adopted. Such questions vary in degree of difficulty.\nSome are very hard, like ‘Are there infinitely many twin prime\nnumbers?’, some are of medium difficulty, like ‘Are there\ninfinitely many prime numbers?’, some are easy like ‘Are\nthere prime numbers?’, and some are completely trivial, like\n‘Are there numbers?’. Internal questions are thus\nquestions that can be asked once a framework that allows talk about\ncertain things has been adopted, and general internal questions, like\n‘Are there numbers?’ are completely trivial since once the\nframework of talk about numbers has been adopted the question if there\nare any is settled within that framework.\n\nBut since the internal general questions are completely trivial they\ncan’t be what the philosophers and metaphysicians are after when\nthey ask the ontological question ‘Are there numbers?’ The\nphilosophers aim to ask a difficult and deep question, not a trivial\none. What the philosophers aim to ask, according to Carnap, is not a\nquestion internal to the framework, but external to it. They aim to\nask whether the framework correctly corresponds to reality, whether or\nnot there really are numbers. However, the words used in the\nquestion ‘Are there numbers?’ only have meaning within the\nframework of talk about numbers, and thus if they are meaningful at\nall they form an internal question, with a trivial answer. The\nexternal questions that the metaphysician tries to ask are\nmeaningless. Ontology, the philosophical discipline that tries to\nanswer hard questions about what there really is is based on\na mistake. The question it tries to answer are meaningless questions,\nand this enterprise should be abandoned. The words ‘Are there\nnumbers?’ thus can be used in two ways: as an internal question,\nin which case the answer is trivially ‘yes’, but this has\nnothing to do with metaphysics or ontology, or as an external\nquestion, which is the one the philosophers are trying to ask, but\nwhich is meaningless. Philosophers should thus not be concerned with\n(O2), which is a discipline that tries to answer meaningless\nquestions, but with (L1), which is a discipline that, in part,\ndevelops frameworks for science to use to formulate and answer real\nquestions. Carnap’s ideas about ontology and meta-ontology are\ndeveloped in a classic essay (Carnap 1956b). A nice summary of\nCarnap’s views can be found in his intellectual autobiography\n(Carnap 1963).\n\nCarnap’s rejection of ontology, and metaphysics more generally,\nhas been widely criticized from a number of different angles. One\ncommon criticism is that it relies on a too simplistic conception of\nnatural language that ties it too closely to science or to evidence\nand verification. In particular, Carnap’s more general rejection\nof metaphysics used a verificationist conception of meaning, which is\nwidely seen as too simplistic. Carnap’s rejection of ontology\nhas been criticized most prominently by Quine, and the debate between\nCarnap and Quine on ontology is a classic in this field. Quine\nrejected Carnap’s conception that when scientists are faced with\ndata that don’t fit their theory they have two choices. First\nthey could change the theory, but stay in the same framework.\nSecondly, they could move to a different framework, and formulate a\nnew theory within that framework. These two moves for Carnap are\nsubstantially different. Quine would want to see them as fundamentally\nsimilar. In particular, Quine rejects the idea that there could be\ntruths which are the trivial internal statements, like “There\nare numbers”, whose truth is a given once the framework of\nnumbers has been adopted. Thus some such internal statements would be\nanalytic truths, and Quine is well known for thinking that the\ndistinction between analytic and synthetic truths is untenable. Thus\nCarnap’s distinction between internal and external questions is\nto be rejected alongside with the rejection of the distinction between\nanalytic and synthetic truths. On the other hand, Quine and Carnap\nagree that ontology in the traditional philosophical sense is to be\nrejected. Traditionally ontology has often, but not always, been an\narmchair, a priori, investigation into the fundamental building blocks\nof reality. As such it is completely separated from science. Quine\n(1951) rejects this approach to ontology since he holds that there\ncan’t be such an investigation into reality that is completely\nseparate and prior to the rest of inquiry. See Yablo 1998 for more\non the debate between Quine and Carnap, which contains many references\nto the relevant passages. The view on ontological commitment discussed\nin section 4.1., which is usually attributed to Quine, was developed\nas a reaction to Carnap’s position discussed in this\nsection. Simply put, Quine’s view is that to see what we are\ncommitted to we have to see what our best overall theory of the world\nquantifies over. In particular, we look at our best overall scientific\ntheory of the world, which contains physics and the rest.\n\nCarnap’s arguments for the rejection of ontology are presently\nwidely rejected. However, several philosophers have recently attempted\nto revive some parts or others of Carnap’s ideas. For example,\nStephen Yablo has argued that an internal-external distinction could\nbe understood along the lines of the fictional-literal distinction.\nAnd he argues (Yablo 1998) that since there is no fact about this\ndistinction, ontology, in the sense of (O2), rests on a mistake and is\nto be rejected, as Carnap did. On the other hand, Thomas Hofweber has\nargued that an internal-external distinction with many of the features\nthat Carnap wanted can be defended on the basis of facts about natural\nlanguage, but that such a distinction will not lead to a rejection of\nontology, in the sense of (O2). See Hofweber 2016. Hilary Putnam\n(1987) has developed a view that revives some of the pragmatic aspects\nof Carnap’s position. See Sosa 1993 for a critical discussion of\nPutnam’s view, and Sosa 1999 for a related, positive\nproposal. Robert Kraut (2016) has defended an expressivist reading of\nthe internal-external distinction, and with it some Carnapian\nconsequences for ontology. And most of all, Eli Hirsch and Amie\nThomasson have defended different versions of approaches to ontology\nthat capture a good part of the spirit of Carnap’s view. See in\nparticular Hirsch 2011 and Thomasson 2015. For various views about the\neffects of Carnap on the contemporary debate in ontology, see Blatti\nand Lapointe 2016.\n4.5 The fundamental language. (L1) meets (O4) and (the new beginning of?) (O2)\n\nAlthough ontology is often understood as the discipline that tries to\nfind out what there is, or what exists, this is rejected by many in\nthe contemporary debate. These philosophers think that the job of\nontology is something different, and there is disagreement among them\nwhat it is more precisely. Among the proposed options are the projects\nof finding out what is real, or what is fundamental, or what the\nprimary substances are, or what reality is like in itself, or\nsomething like this. Proponents of these approaches often find the\nquestions about what there is too inconsequential and trivial to take\nthem to be the questions for ontology. Whether there are numbers, say,\nis trivially answered in the affirmative, but whether numbers are\nreal, or whether they are fundamental, or primary substances, etc., is\nthe hard and ontological question. See Fine (2009) and Schaffer (2009)\nfor two approaches along these lines. But such approaches have their\nown problems. For example, it is not clear whether the question\nwhether numbers are real is any different than the question whether\nnumbers exist. If one were to ask whether the Loch Ness monster is\nreal, it would naturally be understood as just the same question as\nwhether the Loch Ness monster exists. If it is supposed to be a\ndifferent question, is this due to simple stipulation, or can we make\nthe difference intelligible? Similarly, it is not clear whether the\nnotion of what is fundamental can carry the intended metaphysical\nweight. After all, there is a perfectly clear sense in which prime\nnumbers are more fundamental in arithmetic than even numbers, but this\nisn’t to hold the metaphysical priority of prime numbers over\nother numbers, but simply to hold that they are mathematically special\namong the numbers. Thus to ask whether numbers are fundamental is not\neasily seen as a metaphysical alternative to the approach to ontology\nthat asks whether numbers exist. See Hofweber (2009; 2006, chapter 13)\nfor a critical discussion of some approaches to ontology that rely on\nnotions of reality or fundamentality. Whether such approaches to\nontology are correct is a controversial topic in the debate about\nontology which we will not focus on here. However, this approach gives\nrise to a special connection between logic and ontology which we will\ndiscuss in the following.\n\nThe relation between the different approaches to ontology mentioned\njust above is unclear. Is something that is part of reality as it is\nin itself something which is fundamental, or which is real in the\nrelevant sense? Although it is unclear how these different approaches\nrelate to each other, all of them have the potential for allowing for\nthat our ordinary description of the world in terms of mid-size\nobjects, mathematics, morality, and so on, is literally true, while at\nthe same time these truths leave it open what the world, so to speak,\ndeep down, really, and ultimately is like. To use one way of\narticulating this, even though there are tables, numbers, and values,\nreality in itself might contain none of them. Reality in itself might\ncontain no objects at all, and nothing normative. Or it might. The\nordinary description of the world, on this conception, leaves it\nlargely open what reality in itself is like. To find that out is the\njob of metaphysics, in particular ontology. We might, given our\ncognitive setup, be forced to think of the world as one of objects,\nsay. But that might merely reflect how reality is for us. How it is in\nitself is left open.\n\nWhether the distinction between reality as it is for us and as it is\nin itself can be made sense of is an open question, in particular if\nit is not simply the distinction between reality as it appears to us,\nand as it really is. This distinction would not allow for the option\nthat our ordinary description of reality is true, while the question\nhow reality is in itself is left open by this. If our ordinary\ndescription were true then this would mean that how reality appears to\nus is how it in fact is. But if this distinction can be made sense of\nas intended then it gives rise to a problem about how to characterize\nreality as it is in itself, and this gives rise to a role for logic in\nthe sense of (L1).\n\nIf we are forced to think of the world in terms of objects because of\nour cognitive makeup then it would be no surprise that our natural\nlanguage forces us to describe the world in terms of objects. And\narguably some of the central features of natural languages do exactly\nthat. It represents information in terms of subject and predicate,\nwhere the subject paradigmatically picks out an object and the\npredicate paradigmatically attributes a property to it. If this is\ncorrect about natural language then it seems that natural language is\nutterly unsuitable to describe reality as it is in itself if the\nlatter does not contain any objects at all. But then, how are we to\ndescribe reality as it is in itself?\n\nSome philosophers have proposed that natural language might be\nunsuitable for the purposes of ontology. It might be unsuitable since\nit carries with it too much baggage from our particular conceptual\nscheme. See Burgess 2005 for a discussion. Or it might be unsuitable\nsince various expressions in it are not precise enough, too context\nsensitive, or in other ways not ideally suited for the philosophical\nproject. These philosophers propose instead to find a new, better\nsuited language. Such a language likely will be a major departure from\nnatural language and instead will be a formal, artificial language.\nThis to be found language is often called ‘ontologese’\n(Dorr 2005, Sider 2009, Sider 2011), or ‘the fundamental\nlanguage’. The task thus is to find the fundamental language, a\nlanguage in the sense of (L1), to properly carry out ontology, in the\nnew and revised sense of (O2): the project of finding out what reality\nfundamentally, or in itself, etc., is like. For a critical discussion\nof the proposal that we should be asking the questions of ontology in\nontologese, see Thomasson 2015 (chapter 10).\n\nBut this idea of a connection between (L1) and (O2) is not\nunproblematic. First there is a problem about making this approach to\n(O2) more precise. How to understand the notion of ‘reality in\nitself’ is not at all clear, as is well known. It can’t\njust mean: reality as it would be if we weren’t in it. On this\nunderstanding it would simply be the world as it is except with no\nhumans in it, which would in many of its grander features be just as\nit in fact is. But then what does it mean? Similar, but different,\nworries apply to those who rely on notions like\n‘fundamental’, ‘substance’, and the like. We\nwon’t pursue this issue here, though. Second, there is a serious\nworry about how the formal language which is supposed to be the\nfundamental language is to be understood. In particular, is it\nsupposed to be merely an auxiliary tool, or an essential one? This\nquestion is tied to the motivation for a formal fundamental language\nin the first place. If it is merely to overcome ambiguities,\nimperfections, and context sensitivities, then it most likely will\nmerely be an auxiliary, but not essential tool. After all, within\nnatural language we have many means available to get rid of\nambiguities, imperfections and context sensitivities. Scope\nambiguities can be often quite easily be overcome with scope markers.\nFor example, the ambiguities in ‘\\(A\\) and \\(B\\) or \\(C\\)’\ncan be overcome as: ‘either \\(A\\) and \\(B\\) or \\(C\\)’ on\nthe one hand, and ‘\\(A\\) and either \\(B\\) or \\(C\\)’, on\nthe other. Other imprecisions can often, and maybe always, be overcome\nin some form or other. Formal languages are useful and often\nconvenient for precisification, but they don’t seem to be\nessential for it.\n\nOn other hand, the formal fundamental language might be taken to be\nessential for overcoming shortcomings or inherent features of our\nnatural language as the one alluded to above. If the subject-predicate\nstructure of our natural languages brings with it a object-property\nway of representing the world, and if that way of representing the\nworld is unsuitable for representing how reality is in itself, then a\ncompletely different language might be required, and not simply be\nuseful, to describe fundamental reality. Alternatively, if the formal\nlanguage is needed to articulate real existence, as we might\nbe tempted to put it, something which we can’t express in\nEnglish or other natural languages, then, too, it would be essential\nfor the project of ontology. But if the formal language is needed to\ndo something that our natural language can’t do, then what do\nthe sentences in the formal language mean? Since they do something our\nnatural language can’t do, we won’t be able to translate\ntheir meanings into our natural language. If we could then our natural\nlanguage would be able to say what these sentences say, which by\nassumption it can’t do. But then what do sentences in the\nfundamental language mean? If we can’t say or think what these\nsentences say, what is the point for us to use it to try to describe\nreality as it is in itself with them? Can we even make sense of the\nproject of finding out which sentences in such a language are correct?\nAnd why should we care, given that we can’t understand what\nthese sentences mean?\n\nA sample debate related to the issues discussed in this section is the\ndebate about whether it might be that reality in itself does not\ncontain any objects. See, for example, Hawthorne and Cortens 1995,\nBurgess 2005, and Turner 2011. Here the use of a variable and\nquantifier free language like predicate functor logic as the\nfundamental language is a recurring theme.\n\nFormal languages might be called upon to help overcome an inherent\nflaw built into our natural languages, as discussed above, or they\nmight be called upon to overcome a limitation of our natural\nlanguages. One such limitation might be an expressive one. For\nexample, it is unclear whether our natural languages contain truly\nhigher-order quantifiers, ones that interact with, say, predicates or\nsentences directly, as opposed to just terms. If our natural languages\nare limited in this way, then it might be tempting to carry out\nmetaphysics and ontology in a higher-order formal languages, which\ndoes not suffer such a limitation. And since such formal languages can\nbe characterized precisely, that gives rise to the possibility of\ngiving precise proofs of various statements of metaphysical\nsignificance. This project is pursued under the label higher-order\nmetaphysics by several contemporary philosophers in some from or\nother, see, for example, Williamson 2003 and Dorr 2016. For\ncriticism, see Hofweber 2022. This approach can be seen as\ngeneralizing formal ontology in the sense of section 4.3 to formal\nmetaphysics, and is related to some of the approaches to formal\nontology discussed above. \n4.6 The form of thought and the structure of reality. (L4) meets (O3)\n\nOne way to understand logic is as the study of the most general forms\nof thought or judgment, what we called (L4). And one way to understand\nontology is as the study of the most general features of what there\nis, our (O3). Now, there is a striking similarity between the most\ngeneral forms of thought and the most general features of what there\nis. Take one example. Many thoughts have a subject of which they\npredicate something. What there is contains individuals that have\nproperties. It seems that there is a kind of a correspondence between\nthought and reality: the form of the thought corresponds to the\nstructure of a fact in the world. And similarly for other forms and\nstructures. Does this matching between thought and the world ask for a\nsubstantial philosophical explanation? Is it a deep philosophical\npuzzle?\n\nTo take the simplest example, the form of our subject-predicate\nthoughts corresponds perfectly to the structure of object-property\nfacts. If there is an explanation of this correspondence to be given\nit seems it could go in one of three ways: either the form of thought\nexplains the structure of reality (a form of idealism), or the other\nway round (a form of realism), or maybe there is a common explanation\nof why there is a correspondence between them, for example on a form\nof theism where God guarantees a match.\n\nAt first it might seem clear that we should try to give an explanation\nof the second kind: the structure of the facts explains the forms of\nour thoughts that represent these facts. And an idea for such an\nexplanation suggests itself. Our minds developed in a world full of\nobjects having properties. If we had a separate simple representation\nfor these different facts then this would be highly inefficient. After\nall, it is often the same object that has different properties and\nfigures in different facts, and it is often the same property that is\nhad by different objects. So, it makes sense to split up our\nrepresentations of the objects and of the properties into different\nparts, and to put them back together in different combinations in the\nrepresentation of a fact. And thus it makes sense that our minds\ndeveloped to represent object-property facts with subject-predicate\nrepresentations. Therefore we have a mind whose thoughts have a form\nwhich mirrors the structure of the facts that make up the world.\n\nThis kind of an explanation is a nice try, and plausible, but it is\nrather speculative. That our minds really developed this way in light\nof those pressures is a question that is not easy to answer from the\narmchair. Maybe the facts do have a different structure, but our forms\nare close enough for practical purposes, i.e. for survival and\nflourishing. And maybe the correspondence does obtain, but not for\nthis largely evolutionary reason, but for a different, more direct and\nmore philosophical or metaphysical reason.\n\nTo explain the connection differently one could endorse the opposite\norder of explanatory priority, and argue that the form of thought\nexplains the structure of the world. This would most likely lead to an\nidealist position of sorts. It would hold that the general features of\nour minds explain some of the most general features of reality. The\nmost famous way to do something like this is Kant’s in the\nCritique of Pure Reason (Kant 1781/7). We won’t be able\nto discuss it here in any detail. This strategy for explaining the\nsimilarity has the problem of explaining how there can be a world that\nexists independently of us, and will continue to exist after we have\ndied, but nonetheless the structure of this world is explained by the\nforms of our thoughts. Maybe this route could only be taken if one\ndenies that the world exists independently of us, or maybe one could\nmake this tension go away. In addition one would have to say how the\nform of thought explains the structure of reality. For one attempt to\ndo this, see Hofweber 2019, for another one, see Gaskin 2020.\n\nBut maybe there is not much to explain here. Maybe reality does not\nhave anything like a structure that mirrors the form of our thoughts,\nat least not understood a certain way. One might hold that the truth\nof the thought “John smokes” does not require a world\nsplit up into objects and properties, it only requires a smoking John.\nAnd all that is required for that is a world that contains John, but\nnot also another thing, the property of smoking. Thus a structural\nmatch would be less demanding, only requiring a match between objects\nand object directed thought, but no further match. Such a view would\nbe broadly nominalistic about properties, and it is rather\ncontroversial. \n\nAnother way in which there might be nothing to explain is connected to\nphilosophical debates about truth. If a correspondence theory of truth\nis correct, and if thus for a sentence to be true it has to correspond\nto the world in a way that mirrors the structure and matches parts of\nthe sentence properly with parts of the world, then the form of a true\nsentence would have to be mirrored in the world. But if, on the other\nextreme, a coherence theory of truth is correct then the truth of a\nsentence does not require a structural correspondence to the world,\nbut merely a coherence with other sentences. For more on all aspects\nof truth see Künne 2003.\n\nWhether or not there is a substantial metaphysical puzzle about the\ncorrespondence of the form of thoughts and the structure of reality\nwill itself depend on certain controversial philosophical topics. And\nif there is a puzzle here, it might be a trivial one, or it might be\nquite deep. And as usual in these parts of philosophy, how substantial\na question is is itself a hard question.\n5. Conclusion\n\nWith the many conceptions of logic and the many different\nphilosophical projects under the heading of ontology, there are many\nproblems that are in the intersection of these areas. We have touched\non several above, but there are also others. Although there is no\nsingle problem about the relationship between logic and ontology,\nthere are many interesting connections between them, some closely\nconnected to central philosophical questions. The references and links\nbelow are intended to provide a more in depth discussions of these\ntopics.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Barwise, J. and R. Cooper, 1981. ‘Generalized Quantifiers in\nNatural Language,’ in <em>Linguistics and Philosophy</em>, 4:\n159–219.",
                "Blatti, S. and S. Lapointe (eds.), 2016, <em>Ontology after\nCarnap</em>, Oxford: Oxford University Press",
                "Boolos, G., 1998. <em>Logic, Logic, and Logic</em>, Cambridge, MA:\nHarvard University Press.",
                "Burgess, J., 2005. ‘Being explained away,’ reprinted\nin his <em>Mathematics, Models, and Modality</em>, Cambridge:\nCambridge University Press, 2009.",
                "Carnap, R., 1956a. <em>Meaning and Necessity: a study in semantics\nand modal logic</em>, Chicago: University of Chicago Press, 2nd\nedition.",
                "–––, 1956b. ‘Empiricism, semantics, and\nontology,’ in Carnap 1956a, pp. 203–221.",
                "–––, 1963. ‘Intellectual\nautobiography,’ in Schilpp 1963, pp. 3–84.",
                "Christensen, D., 2005. <em>Putting Logic in Its Place: Formal\nConstraints on Rational Belief</em>, Oxford University Press.",
                "Davidson, D., 1967. ‘The Logical Form of Action\nSentences,’ in Davidson 1980. ",
                "–––, 1980. <em>Essays on Actions and\nEvents</em>, Oxford: Oxford University Press.",
                "Dorr, C., 2005. ‘What We Disagree About When We Disagree\nAbout Ontology’,’ in <em>Fictionalist Approaches to\nMetaphysics </em>, Mark Kalderon (ed.), Oxford: Oxford University\nPress, 234–286. ",
                "–––, 2016. ‘To be F is to be G,’\n<em>Philosophical Perspectives</em>, 30: 39–134.",
                "Engel, P., 1991. <em>The Norm of Truth: an introduction to the\nphilosophy of logic</em>, Toronto: University of Toronto Press.",
                "Everett, A. and T. Hofweber (eds.), 2000. <em>Empty Names,\nFiction, and the Puzzles of Non-Existence</em>, Stanford: CSLI\nPublications.",
                "Field, H., 2009. ‘What is the normative role of\nlogic?,’ <em>The Proceedings of the Aristotelean Society</em>,\nLXXXIII: 251–268.",
                "Fine, K., 2002. <em>The Limits of Abstraction</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 2009. ‘The question of\nontology,’ in <em> Metametaphysics</em>, D. Chalmers, D. Manley,\nand R. Wasserman (eds.), Oxford: Oxford University Press ",
                "Fodor, J., 1975. <em>The Language of Thought</em>, Cambridge, MA:\nHarvard University Press. ",
                "Frege, G., 1884. <em>Die Grundlagen der Arithmetic: eine\nlogisch-philosophische Untersuchung zum Begriff der Zahl</em>,\nBreslau: w. Koebner; translated by J. L. Austin as <em>The Foundations\nof Arithmetic: A Logic-Mathematical Enquiry into the Concept of\nNumber</em>, Oxford: Blackwell, second revised edition, 1974.",
                "Garskin, R., 2020. <em>Language and World: a defense of linguistic\nidealism</em>, London: Routledge.",
                "Goble, L., 2001. <em>Philosophical Logic</em>, Oxford: Blackwell\nPublishers.",
                "Gottlieb, D., 1980. <em>Ontological Economy: substitutional\nquantification and mathematics</em>, Oxford: Oxford University\nPress.",
                "Haack, S., 1978. <em>Philosophy of Logics</em>, Cambridge:\nCambridge University Press.",
                "Hacking, I., 1979. ‘What is Logic?,’ <em>Journal of\nPhilosophy</em>, LXXVI (6): 285–319.",
                "Hale, B. and C. Wright, 2001. <em>The Reason’s Proper\nStudy</em>, Oxford: Oxford University Press.",
                "Harman, G., 1986. <em>Change in View</em>, Cambridge, MA: MIT\nPress.",
                "Hawthorne, J. and A. Cortens, 1995. ‘Towards ontological\nnihilism,’ <em>Philosophical Studies</em>, 79 (2):\n143–165.",
                "Hirsch, E., 2011. <em>Quantifier Variance and Realism: essays in\nMetaontology</em>, Oxford: Oxford University Press.",
                "Hofweber, T., 2009. ‘Ambitious, yet modest,\nmetaphysics,’ in <em>Metametaphysics</em>, D. Chalmers, D.\nManley, and R. Wasserman (eds.), Oxford: Oxford University Press ",
                "–––, 2016. <em>Ontology and the Ambitions of\nMetaphysics</em>, Oxford: Oxford University Press ",
                "–––, 2019. ‘Idealism and the Harmony of\nThought and Reality,’ <em>Mind</em>, 128(511):\n699–734.",
                "–––, 2022. ‘The Case Against Higher-Order\nMetaphysics,’ <em>Metaphysics</em>, 5(1): 29–50.",
                "Kant, I., 1781/7. <em>Kritik der reinen Vernunft</em>, various\ntranslations as <em>Critique of Pure Reason</em>.",
                "Kneale, W. and Kneale, M., 1985. <em>The Development of\nLogic</em>, Oxford: Oxford University Press.",
                "Künne, W., 2003. <em>Conceptions of Truth</em>, Oxford:\nOxford University Press.",
                "Kraut, R., 2018. ‘Three Carnaps on Ontology’ in Blatti\n&amp; Lapointe 2016, pp. 31–58.",
                "Lambert, K., 2001. ‘Free logics,’ in Goble 2001, pp.\n258–279.",
                "MacFarlane, J., 2002. ‘Frege, Kant, and the Logic in\nLogicism,’ <em>The Philosophical Review</em>, 111:\n25–65.",
                "Mauthner, I.F., 1946. ‘An Extension of Klein’s\nErlanger Program: Logic as Invariant Theory,’ <em>American\nJournal of Mathematics</em>, 68: 345–384.",
                "Marcus, R., 1993. <em>Modalities</em>, Oxford: Oxford University\nPress.",
                "Parsons, T., 1980. <em>Nonexistent Objects</em>, New Haven: Yale\nUniversity Press.",
                "Putnam, H., 1987. <em>The Many Faces of Realism</em>, La Salle:\nOpen Court.",
                "Quine, W.V., 1948. ‘On what there is,’ <em>Review of\nMetaphysics</em>, 2: 21–38; reprinted in Quine 1980.",
                "–––, 1951. ‘Two Dogmas of\nEmpiricism,’ <em>The Philosophical Review</em>, 60: 20–43;\nreprinted in Quine 1980.",
                "–––, 1954. ‘Quantification and the Empty\nDomain,’ <em>Journal of Symbolic Logic</em>, 19:\n177–179.",
                "–––, 1970. <em>Philosophy of Logic</em>,\nCambridge, MA: Harvard University Press.",
                "–––, 1980. <em>From a Logical Point of\nView</em>, 2nd edition, Cambridge, MA: Harvard University Press.",
                "Reid, S., 1995. <em>Thinking about Logic</em>, Oxford: Oxford\nUniversity Press.",
                "Rosen, G., 1993. ‘The Refutation of Nominalism (?),’\n<em>Philosophical Topics</em>, 21: 149–86.",
                "Russell, B., 1905. ‘On Denoting,’ <em>Mind</em>, 14:\n479–493.",
                "Schaffer, J., 2009 ‘On what grounds what,’ in\n<em>Metametaphysics</em>, D. Chalmers, D. Manley, and R. Wasserman\n(eds.), Oxford: Oxford University Press ",
                "Schilpp, P.A., 1963. <em>The Philosophy of Rudolf Carnap</em>, La\nSalle: Open Court",
                "Sider, T., 2009. ‘Ontological Realism,’ in\n<em>Metametaphysics</em>, D. Chalmers, D. Manley, and R. Wasserman\n(eds.), Oxford: Oxford University Press. ",
                " –––, 2011. <em>Writing the Book of the\nWorld</em>, Oxford: Oxford University Press. ",
                "Simons, P., 1987. <em>Parts: A Study in Ontology</em>, Oxford:\nOxford University Press.",
                "Sosa, E., 1993. ‘Putnam’s pragmatic realism,’\n<em>Journal of Philosophy</em>, 90: 605–26.",
                "–––, 1999. ‘Existential Relativity,’\n<em>Midwest Studies in Philosophy</em>, 22: 132–143.",
                "Tarski, A., 1986. ‘What are Logical Notions?,’\n<em>History and Philosophy of Logic</em>, 7: 143–154.",
                "Tennant, N., 1990. <em>Natural Logic</em>, 2nd edition, Edinburgh:\nEdinburgh University Press.",
                "Thomasson, A., 2016. <em>Ontology made Easy</em>, New York: Oxford\nUniversity Press. ",
                "Turner, J., 2011. ‘Ontological Nihilism,’ <em>Oxford\nStudies in Metaphysics</em> (Volume 6), K. Bennett and D. Zimmerman\n(eds.), Oxford: Oxford University Press, pp. 3–55.",
                "van Benthem, J., 1986. <em>Essays in Logical Semantics</em>,\nDordrecht: D. Reidel.",
                "–––, 1989. ‘Logical Constants across\nVarying Types,’ <em>Notre Dame Journal of Formal Logic</em>, 30\n(3): 315–342.",
                "van Inwagen, P., 1998. ‘Meta-ontology,’\n<em>Erkenntnis</em>, 48: 233–250; reprinted in van Inwagen\n2001.",
                "–––, 2001. <em>Ontology, Identity and\nModality</em>, Cambridge: Cambridge University Press",
                "Velleman, J. D., 2000. ‘On the Aim of Belief,’ Chapter\n11 of <em>The Possibility of Practical Reason</em>, Oxford: Oxford\nUniversity Press.",
                "Williamson, T., 1999. ‘A note on truth, satisfaction and the\nempty domain,’ <em>Analysis</em>, 59: 3–8.",
                "–––, 2003. ‘Everything,’\n<em>Philosophical Perspectives</em>, 17(1): 415–465.",
                "Wright, C., 1983. <em>Frege’s Conception of Numbers as\nObjects</em>, Aberdeen: Aberdeen University Press.",
                "Yablo, S., 1998. ‘Does ontology rest on a mistake?,’\n<em>Proceedings of the Aristotelean Society</em>, 72:\n229–61.",
                "Zalta, E. N., 1983. <em>Abstract Objects: an Introduction to\nAxiomatic Metaphysics</em>, Dordrecht: D. Reidel."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Barwise, J. and R. Cooper, 1981. ‘Generalized Quantifiers in\nNatural Language,’ in <em>Linguistics and Philosophy</em>, 4:\n159–219.</li>\n<li>Blatti, S. and S. Lapointe (eds.), 2016, <em>Ontology after\nCarnap</em>, Oxford: Oxford University Press</li>\n<li>Boolos, G., 1998. <em>Logic, Logic, and Logic</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Burgess, J., 2005. ‘Being explained away,’ reprinted\nin his <em>Mathematics, Models, and Modality</em>, Cambridge:\nCambridge University Press, 2009.</li>\n<li>Carnap, R., 1956a. <em>Meaning and Necessity: a study in semantics\nand modal logic</em>, Chicago: University of Chicago Press, 2nd\nedition.</li>\n<li>–––, 1956b. ‘Empiricism, semantics, and\nontology,’ in Carnap 1956a, pp. 203–221.</li>\n<li>–––, 1963. ‘Intellectual\nautobiography,’ in Schilpp 1963, pp. 3–84.</li>\n<li>Christensen, D., 2005. <em>Putting Logic in Its Place: Formal\nConstraints on Rational Belief</em>, Oxford University Press.</li>\n<li>Davidson, D., 1967. ‘The Logical Form of Action\nSentences,’ in Davidson 1980. </li>\n<li>–––, 1980. <em>Essays on Actions and\nEvents</em>, Oxford: Oxford University Press.</li>\n<li>Dorr, C., 2005. ‘What We Disagree About When We Disagree\nAbout Ontology’,’ in <em>Fictionalist Approaches to\nMetaphysics </em>, Mark Kalderon (ed.), Oxford: Oxford University\nPress, 234–286. </li>\n<li>–––, 2016. ‘To be F is to be G,’\n<em>Philosophical Perspectives</em>, 30: 39–134.</li>\n<li>Engel, P., 1991. <em>The Norm of Truth: an introduction to the\nphilosophy of logic</em>, Toronto: University of Toronto Press.</li>\n<li>Everett, A. and T. Hofweber (eds.), 2000. <em>Empty Names,\nFiction, and the Puzzles of Non-Existence</em>, Stanford: CSLI\nPublications.</li>\n<li>Field, H., 2009. ‘What is the normative role of\nlogic?,’ <em>The Proceedings of the Aristotelean Society</em>,\nLXXXIII: 251–268.</li>\n<li>Fine, K., 2002. <em>The Limits of Abstraction</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 2009. ‘The question of\nontology,’ in <em> Metametaphysics</em>, D. Chalmers, D. Manley,\nand R. Wasserman (eds.), Oxford: Oxford University Press </li>\n<li>Fodor, J., 1975. <em>The Language of Thought</em>, Cambridge, MA:\nHarvard University Press. </li>\n<li>Frege, G., 1884. <em>Die Grundlagen der Arithmetic: eine\nlogisch-philosophische Untersuchung zum Begriff der Zahl</em>,\nBreslau: w. Koebner; translated by J. L. Austin as <em>The Foundations\nof Arithmetic: A Logic-Mathematical Enquiry into the Concept of\nNumber</em>, Oxford: Blackwell, second revised edition, 1974.</li>\n<li>Garskin, R., 2020. <em>Language and World: a defense of linguistic\nidealism</em>, London: Routledge.</li>\n<li>Goble, L., 2001. <em>Philosophical Logic</em>, Oxford: Blackwell\nPublishers.</li>\n<li>Gottlieb, D., 1980. <em>Ontological Economy: substitutional\nquantification and mathematics</em>, Oxford: Oxford University\nPress.</li>\n<li>Haack, S., 1978. <em>Philosophy of Logics</em>, Cambridge:\nCambridge University Press.</li>\n<li>Hacking, I., 1979. ‘What is Logic?,’ <em>Journal of\nPhilosophy</em>, LXXVI (6): 285–319.</li>\n<li>Hale, B. and C. Wright, 2001. <em>The Reason’s Proper\nStudy</em>, Oxford: Oxford University Press.</li>\n<li>Harman, G., 1986. <em>Change in View</em>, Cambridge, MA: MIT\nPress.</li>\n<li>Hawthorne, J. and A. Cortens, 1995. ‘Towards ontological\nnihilism,’ <em>Philosophical Studies</em>, 79 (2):\n143–165.</li>\n<li>Hirsch, E., 2011. <em>Quantifier Variance and Realism: essays in\nMetaontology</em>, Oxford: Oxford University Press.</li>\n<li>Hofweber, T., 2009. ‘Ambitious, yet modest,\nmetaphysics,’ in <em>Metametaphysics</em>, D. Chalmers, D.\nManley, and R. Wasserman (eds.), Oxford: Oxford University Press </li>\n<li>–––, 2016. <em>Ontology and the Ambitions of\nMetaphysics</em>, Oxford: Oxford University Press </li>\n<li>–––, 2019. ‘Idealism and the Harmony of\nThought and Reality,’ <em>Mind</em>, 128(511):\n699–734.</li>\n<li>–––, 2022. ‘The Case Against Higher-Order\nMetaphysics,’ <em>Metaphysics</em>, 5(1): 29–50.</li>\n<li>Kant, I., 1781/7. <em>Kritik der reinen Vernunft</em>, various\ntranslations as <em>Critique of Pure Reason</em>.</li>\n<li>Kneale, W. and Kneale, M., 1985. <em>The Development of\nLogic</em>, Oxford: Oxford University Press.</li>\n<li>Künne, W., 2003. <em>Conceptions of Truth</em>, Oxford:\nOxford University Press.</li>\n<li>Kraut, R., 2018. ‘Three Carnaps on Ontology’ in Blatti\n&amp; Lapointe 2016, pp. 31–58.</li>\n<li>Lambert, K., 2001. ‘Free logics,’ in Goble 2001, pp.\n258–279.</li>\n<li>MacFarlane, J., 2002. ‘Frege, Kant, and the Logic in\nLogicism,’ <em>The Philosophical Review</em>, 111:\n25–65.</li>\n<li>Mauthner, I.F., 1946. ‘An Extension of Klein’s\nErlanger Program: Logic as Invariant Theory,’ <em>American\nJournal of Mathematics</em>, 68: 345–384.</li>\n<li>Marcus, R., 1993. <em>Modalities</em>, Oxford: Oxford University\nPress.</li>\n<li>Parsons, T., 1980. <em>Nonexistent Objects</em>, New Haven: Yale\nUniversity Press.</li>\n<li>Putnam, H., 1987. <em>The Many Faces of Realism</em>, La Salle:\nOpen Court.</li>\n<li>Quine, W.V., 1948. ‘On what there is,’ <em>Review of\nMetaphysics</em>, 2: 21–38; reprinted in Quine 1980.</li>\n<li>–––, 1951. ‘Two Dogmas of\nEmpiricism,’ <em>The Philosophical Review</em>, 60: 20–43;\nreprinted in Quine 1980.</li>\n<li>–––, 1954. ‘Quantification and the Empty\nDomain,’ <em>Journal of Symbolic Logic</em>, 19:\n177–179.</li>\n<li>–––, 1970. <em>Philosophy of Logic</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 1980. <em>From a Logical Point of\nView</em>, 2nd edition, Cambridge, MA: Harvard University Press.</li>\n<li>Reid, S., 1995. <em>Thinking about Logic</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Rosen, G., 1993. ‘The Refutation of Nominalism (?),’\n<em>Philosophical Topics</em>, 21: 149–86.</li>\n<li>Russell, B., 1905. ‘On Denoting,’ <em>Mind</em>, 14:\n479–493.</li>\n<li>Schaffer, J., 2009 ‘On what grounds what,’ in\n<em>Metametaphysics</em>, D. Chalmers, D. Manley, and R. Wasserman\n(eds.), Oxford: Oxford University Press </li>\n<li>Schilpp, P.A., 1963. <em>The Philosophy of Rudolf Carnap</em>, La\nSalle: Open Court</li>\n<li>Sider, T., 2009. ‘Ontological Realism,’ in\n<em>Metametaphysics</em>, D. Chalmers, D. Manley, and R. Wasserman\n(eds.), Oxford: Oxford University Press. </li>\n<li> –––, 2011. <em>Writing the Book of the\nWorld</em>, Oxford: Oxford University Press. </li>\n<li>Simons, P., 1987. <em>Parts: A Study in Ontology</em>, Oxford:\nOxford University Press.</li>\n<li>Sosa, E., 1993. ‘Putnam’s pragmatic realism,’\n<em>Journal of Philosophy</em>, 90: 605–26.</li>\n<li>–––, 1999. ‘Existential Relativity,’\n<em>Midwest Studies in Philosophy</em>, 22: 132–143.</li>\n<li>Tarski, A., 1986. ‘What are Logical Notions?,’\n<em>History and Philosophy of Logic</em>, 7: 143–154.</li>\n<li>Tennant, N., 1990. <em>Natural Logic</em>, 2nd edition, Edinburgh:\nEdinburgh University Press.</li>\n<li>Thomasson, A., 2016. <em>Ontology made Easy</em>, New York: Oxford\nUniversity Press. </li>\n<li>Turner, J., 2011. ‘Ontological Nihilism,’ <em>Oxford\nStudies in Metaphysics</em> (Volume 6), K. Bennett and D. Zimmerman\n(eds.), Oxford: Oxford University Press, pp. 3–55.</li>\n<li>van Benthem, J., 1986. <em>Essays in Logical Semantics</em>,\nDordrecht: D. Reidel.</li>\n<li>–––, 1989. ‘Logical Constants across\nVarying Types,’ <em>Notre Dame Journal of Formal Logic</em>, 30\n(3): 315–342.</li>\n<li>van Inwagen, P., 1998. ‘Meta-ontology,’\n<em>Erkenntnis</em>, 48: 233–250; reprinted in van Inwagen\n2001.</li>\n<li>–––, 2001. <em>Ontology, Identity and\nModality</em>, Cambridge: Cambridge University Press</li>\n<li>Velleman, J. D., 2000. ‘On the Aim of Belief,’ Chapter\n11 of <em>The Possibility of Practical Reason</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Williamson, T., 1999. ‘A note on truth, satisfaction and the\nempty domain,’ <em>Analysis</em>, 59: 3–8.</li>\n<li>–––, 2003. ‘Everything,’\n<em>Philosophical Perspectives</em>, 17(1): 415–465.</li>\n<li>Wright, C., 1983. <em>Frege’s Conception of Numbers as\nObjects</em>, Aberdeen: Aberdeen University Press.</li>\n<li>Yablo, S., 1998. ‘Does ontology rest on a mistake?,’\n<em>Proceedings of the Aristotelean Society</em>, 72:\n229–61.</li>\n<li>Zalta, E. N., 1983. <em>Abstract Objects: an Introduction to\nAxiomatic Metaphysics</em>, Dordrecht: D. Reidel.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Carnap, Rudolf",
            "Frege, Gottlob",
            "Frege, Gottlob: theorem and foundations for arithmetic",
            "logic: free",
            "logical consequence",
            "logical constants",
            "object",
            "ontological arguments",
            "ontological commitment"
        ],
        "entry_link": [
            {
                "../carnap/": "Carnap, Rudolf"
            },
            {
                "../frege/": "Frege, Gottlob"
            },
            {
                "../frege-theorem/": "Frege, Gottlob: theorem and foundations for arithmetic"
            },
            {
                "../logic-free/": "logic: free"
            },
            {
                "../logical-consequence/": "logical consequence"
            },
            {
                "../logical-constants/": "logical constants"
            },
            {
                "../object/": "object"
            },
            {
                "../ontological-arguments/": "ontological arguments"
            },
            {
                "../ontological-commitment/": "ontological commitment"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=logic-ontology\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/logic-ontology/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=logic-ontology&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/logic-ontology/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=logic-ontology": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/logic-ontology/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=logic-ontology&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/logic-ontology/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://ontology.buffalo.edu/\" target=\"other\">Buffalo Ontology Site</a>.",
            "<a href=\"http://www.ditext.com/carnap/carnap.html\" target=\"other\">Empiricism, semantics and ontology</a>.\n Online version of Carnap’s famous essay, formatted in HTML by\nAndrew Chrucky",
            "<a href=\"http://www.utm.edu/research/iep/c/carnap.htm\" target=\"other\">Rudolf Carnap</a>,\n <em>Internet Encyclopedia of Philosophy</em> article on Carnap.",
            "Frege, Gottlob,\n <a href=\"https://web.archive.org/web/20110410095113/http://www.ac-nancy-metz.fr/enseign/philo/textesph/Frege.pdf\" target=\"other\">Grundlagen der Arithmetik</a>\n (in German) (PDF), the original of what is translated as the\n<em>Foundations of Arithmetic</em>.",
            "Zalta, E., 1999 [2022], <a href=\"https://mally.stanford.edu/principia.pdf\" target=\"other\">Principia Logico-Metaphysica</a>,\n manuscript of Edward N. Zalta’s systematic formal ontology."
        ],
        "listed_links": [
            {
                "http://ontology.buffalo.edu/": "Buffalo Ontology Site"
            },
            {
                "http://www.ditext.com/carnap/carnap.html": "Empiricism, semantics and ontology"
            },
            {
                "http://www.utm.edu/research/iep/c/carnap.htm": "Rudolf Carnap"
            },
            {
                "https://web.archive.org/web/20110410095113/http://www.ac-nancy-metz.fr/enseign/philo/textesph/Frege.pdf": "Grundlagen der Arithmetik"
            },
            {
                "https://mally.stanford.edu/principia.pdf": "Principia Logico-Metaphysica"
            }
        ]
    }
}