{
    "url": "lorenzo-valla",
    "title": "Lorenzo Valla",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Lodi Nauta\n<l.w.nauta@rug.nl>",
        "author_links": [
            {
                "http://www.rug.nl/staff/l.w.nauta/index": "Lodi Nauta"
            },
            {
                "mailto:l%2ew%2enauta%40rug%2enl": "l.w.nauta@rug.nl"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://www.rug.nl/staff/l.w.nauta/index\" target=\"other\">Lodi Nauta</a>\n&lt;<a href=\"mailto:l%2ew%2enauta%40rug%2enl\"><em>l<abbr title=\" dot \">.</abbr>w<abbr title=\" dot \">.</abbr>nauta<abbr title=\" at \">@</abbr>rug<abbr title=\" dot \">.</abbr>nl</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu May 14, 2009",
        "substantive revision Wed Jul 21, 2021"
    ],
    "preamble": "\n\nLorenzo Valla (c. 1406–1457) was one of the most important\nhumanists of his time. In his Elegantiae linguae Latinae, an\nadvanced handbook of Latin language and style, he gave the humanist\nprogram some of its most trenchant and combative formulations,\nbringing the study of Latin to an unprecedented level. He made\nnumerous contributions to classical scholarship. But he also used his\nvast knowledge of the classical languages and their literatures as a\ntool to criticize a wide range of ideas, theories, and established\npractices. He famously exposed the Donation of Constantine—an\nimportant document justifying the papacy’s claims to temporal\nrule—as a forgery. He compared, for the first time, St.\nJerome’s translation of the Bible with the Greek text of the New\nTestament, thereby laying the foundations of critical biblical\nscholarship. In his Repastinatio dialectice et philosophie\n(Re-ploughing of Dialectic and Philosophy), also known as his\nDialectics or Dialectical Disputations, he attacked\nscholastic-Aristotelian thought from an essentially linguistic point\nof view, arguing that philosophy should conform to common sense and\ncommon linguistic usage. Already highly controversial in his own\ntimes, Valla’s works continue to provoke debate in modern times,\nwhich reflects broader discussions about the philosophical relevance\nand significance of Renaissance humanism for the development of early\nmodern philosophy.\n",
    "toc": [
        {
            "#LifWor": "1. Life and Works"
        },
        {
            "#ValCriSch": "2. Valla’s Critique of Scholastic Philosophy"
        },
        {
            "#ValRefAriLog": "3. Valla’s “Reform” of Aristotelian Logic"
        },
        {
            "#Mor": "4. Moral Philosophy"
        },
        {
            "#Eva": "5. Evaluation"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PriSouSelWorVal": "Primary Sources: Selected Works by Valla"
        },
        {
            "#SelSecLit": "Selected Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Works\n\nValla did not have an easy life. Equipped with a sharp and polemical\nmind, an even sharper pen and a sense of self-importance verging on\nthe pathological, he made many enemies throughout his life. Born in\nRome in (most likely) 1406 to a family with ties to the papal curia,\nValla as a young man was already in close contact with some major\nhumanists working as papal secretaries such as Leonardo Bruni\n(1370–1444) and Poggio Bracciolini (1380–1459). Another\nwas his uncle Melchior Scrivani, whom Valla had hoped to succeed after\nhis death; but opposition from Poggio and Antonio Loschi\n(1365/8–1441) must have led the pope to refuse to employ him.\nValla had criticized an elegy by Loschi, and had also boldly favored\nQuintilian over Cicero in a treatise which has long considered to be\nlost; but a lengthy anonymous prefatory letter has recently been found\nand ascribed, convincingly, to the young Valla (Pagliaroli 2008; it\nturns out not to be a comparison between Cicero’s theory of\nrhetoric and Quintilian’s handbook, as scholars have always\nassumed, but a comparison between a declamation of Ps-Quintilian,\nGladiator—the declamations were considered to be the\nwork of Quintilian in Valla’s time—and one of\nCicero’s orations, Pro Ligario.) Valla’s Roman\nexperience of humanist conversations found an outlet in his dialogue\nDe voluptate (On Pleasure), in which the Christian\nconcepts of charity and beatitude are identified with hedonist\npleasure, while the “Stoic” concept of virtue is rejected\n(see below). Valla would later revise the dialogue and change the\nnames of the interlocutors, but his Epicurean-Christian position\nremained the same.\n\nMeanwhile he had moved to Pavia in 1431, stimulated by his friend\nPanormita (Antonio Beccadelli, 1394–1471)—with whom he was\nsoon to quarrel—and had begun to teach rhetoric. He had to flee\nPavia, however, in 1433 after having aroused the anger of the jurists.\nIn a letter to a humanist jurist friend of his, Catone Sacco\n(1394–1463), Valla had attacked the language of one of the\nlawyers’ main authorities, Bartolus of Sassoferrato\n(1313–1357). After some travelling, in 1435 Valla found\nemployment at the court of Alfonso of Aragon (1396–1458), who\nwas trying to capture Naples. Though complaining about the lack of\ntime, books and fellow humanists, Valla was immensely productive in\nthis phase of his career. In 1439 he finished the first version of his\ncritique of scholastic philosophy. Two years later he finished his\nElegantiae linguae Latinae, a manual for the correct use of\nLatin syntax and vocabulary, which became a bestseller throughout\nEurope. As a humanist in the court of a king who was fighting against\nthe pope, Valla demonstrated that the Donation of Constantine, which\nhad served the papacy to claim worldly power, was a forgery. In the\nsame years he composed a dialogue on free will and began working on\nhis annotations to the standard Latin translation of the Bible,\ncomparing it with the Greek text of the New Testament. He also wrote a\ndialogue On the Profession of the Religious (De\nprofessione religiosorum), in which he attacked the vow of\nobedience and asceticism taken by members of religious orders.\nFurther, he worked on the text of Livy, wrote a history of the deeds\nof Alfonso’s father, and began re-reading and annotating\nQuintilian’s Institutio oratoria (Education of the\nOrator) in a manuscript which is still extant (Paris,\nBibliothèque Nationale de France, lat. 7723). But Valla’s\nphilological approach and his penchant for quarreling made him enemies\nat the Aragonese court. After his patron Alfonso had made peace with\nthe pope in 1443, Valla’s role as an anti-papal polemicist may\nhave shrunk. His enemies took advantage of the situation. The\nimmediate occasion was Valla’s denial of the apostolic origin of\nthe Symbolum Apostolicum (Apostle’s Creed). In a\nletter, now lost, to the Neapolitan lawyers he argued that a passage\nfrom Gratian’s Decretum that formed the basis of the\nbelief in the apostolic origin of the Creed was corrupt and needed\nemendation. Powerful men at the court staged an inquisitorial trial to\ndetermine whether Valla’s works contained heretical and\nheterodox opinions. In preparation for the trial Valla wrote a\nself-defense (and later an “Apology”), but was rescued\nfrom this perilous situation by the intervention of the king. The\nwhole affair must have fuelled Valla’s wish to return to Rome.\nIn 1447 he made peace with the pope and became an apostolic\nscriptor (scribe), and later, in 1455, a papal secretary. In\nthese years he revised some of his earlier works such as the\nRepastinatio and his notes on the New Testament, and\ntranslated Thucydides and Herodotus into Latin; his work on\nThucydides, in particular, was to have an important impact on the\nstudy of this difficult Greek author. Always an irascible man, he\ncontinued to engage in quarrels and exchanged a series of invectives\nwith his arch-enemy Poggio. He died in 1457, still working on a second\nrevision of his Dialectics (that is, the third version). He\nwas buried in the Lateran, where his grave was removed in the\nsixteenth century, probably between the 1560s and 1580s at a time when\nhis works were put on the Index; the present memorial is not Valla’s\ntombstone.\n\nValla’s impact on the humanist movement was long-lasting and\nvaried. His philological approach was developed by subsequent\ngenerations of humanists, and found, arguably, its first systematic\nexpression in the work of Angelo Poliziano (1454–1494). His\nElegantiae was printed many times, either in the original or\nin one of its many adaptations and abridgments made by later scholars.\nA copy of his annotations on the New Testament was found near Louvain\nby Erasmus (1467?–1534), who published it. Though many\ntheologians complained about his ignorance of theology, Luther and\nLeibniz, each for his own reasons, found occasion to refer to\nValla’s dialogue on free will. Humanists found Valla’s\ncriticisms of Aristotelian-scholastic thought congenial, though not a\nfew regarded his style as too aggressive and polemical. And though\nsome humanists such as Juan Luis Vives (1492–1540) and Johann\nEck (1486–1543) complained about Valla’s lack of\nphilosophical acumen, his critique of scholasticism has a place in the\nlong transformation from medieval to modern thought—in which\nhumanism played an important though by no means exclusive role.\n2. Valla’s Critique of Scholastic Philosophy\n\nIn his Repastinatio dialectice et philosophie, which is\nextant in three versions with slightly different titles, Valla attacks\nwhat he sees as the foundations of scholastic-Aristotelian philosophy\nand sets out to transform Aristotelian dialectic. As the title of the\nfirst version clearly indicates, he wants to “re-plough”\nthe ground traditionally covered by the Aristotelian scholastics. The\nterm repastinatio means not only “re-ploughing”\nor “re-tilling” but also “cutting back” and\n“weeding out.” Valla desires to weed out everything he\nregards as barren and infertile in scholastic thought and to\nre-cultivate the ground by sprinkling it with the fertile waters of\nrhetoric and grammar. His use of repastinatio indicates that\nhe is setting out a program of reform rather than of destruction, in\nspite of his often aggressive and polemical tone. Book I is devoted\nmainly to metaphysics, but also contains chapters on natural\nphilosophy and moral philosophy, as well a controversial chapter on\nthe Trinity. In Books II and III Valla discusses propositions and\nforms of argumentation such as the syllogism.\n\nHis main concern in the first book is to simplify the\nAristotelian-scholastic apparatus. For Valla, the world consists of\nthings, simply called res. Things have qualities and do or\nundergo things (which he refers to as “things”). Hence,\nthere are three basic categories: substance, quality, and action. At\nthe back of Valla’s mind are the grammatical categories of noun,\nadjective, and verb; but in many places he points out that we cannot\nassume that, for instance, an adjective always refer to a quality or a\nverb to an action (Repastinatio, 1:134–156;\n425–442; DD 1:240–80). These three categories are the\nonly ones Valla admits; the other Aristotelian categories of accidents\nsuch as place, time, relation and quantity can all be reduced to\nquality or action. Here, too, grammar plays a leading role in\nValla’s thought. From a grammatical point of view, qualities\nsuch as being a father, being in the classroom, or being six-feet tall\nall tell us something about how a particular man is qualified; and\nthere is, consequently, no need to preserve the other Aristotelian\ncategories.\n\nIn reducing the categories to his triad of substance, quality, and\naction, Valla does not seem to have in mind “realist”\nphilosophers who accepted the independent existence of entities such\nas relations and quantities over and above individual things. Instead,\nhis aim is to show that many terms traditionally placed in other\ncategories, in fact, point to qualities or actions: linguistic usage\n(loquendi consuetudo) teaches us, for example, that\nquality is the overarching category. Thus, to the question “of\nwhat kind”, we often give answers containing quantitative\nexpressions. Take, for instance, the question: what sort of horse\nshould I buy? It may be answered: erect, tall, with a broad chest, and\nso on. Valla’s reduction of the categories often assumes the\nform of grammatical surveys of certain groups of words associated with\na particular category: thus, in his discussion of time, he studies\nwords like “day,” “year,” and a host of\nothers; and his discussion of quantitative words treats mathematical\nterms such as line, point and circle. Of course, Valla does not deny\nthat we can speak of quantity or time or place. But the rich array of\nLatin terms signify, in the final analysis, the qualities or actions\nof things, and nothing exists apart from concrete things. (Substance\nis a shady category for Valla, who says that he cannot give an example\nof it, much as Locke was later to maintain that “a substance is\nsomething I know not what”).\n\nIt is tempting to connect this lean ontology to that of William of\nOckham (c. 1287–1347). The interests, approach and arguments of\nthe two thinkers, however, differ considerably. Unlike Valla, Ockham\ndoes not want to get rid of the system of categories. As long as one\nrealizes, Ockham says, that categories do not describe things in the\nworld but categorize terms by which we signify real\nsubstances or real inhering qualities in different ways, the\ncategories can be maintained and the specific features of, for\nexample, relational or quantitative terms can be explored. Thus,\nOckham’s rejection of a realist interpretation of the categories\nis accompanied by a wish to defend the categories as distinct\ngroups of terms. Valla, on the other hand, sees the categories as\nsumming up the real aspects of things: hence, there are only\nsubstances, qualities, and actions, and his reductive program consists\nin showing that we have a vast and rich vocabulary in Latin that we\ncan use for referring to these things. His questions about words and\nclasses of words are not unlike those of Priscian (fl. 500–530)\nand other grammarians. (Priscian, for instance, had stated that a noun\nsignifies substance plus quality, and pronouns substance without\nquality.)\n\nAnother good example of Valla’s reduction of scholastic\nterminology, distinctions, and concepts is his critique of the\ntranscendental terms (Repastinatio 1:11–21; DD\n1:18–36). According to Valla, the traditional six\nterms—“being,” “thing,”\n“something,” “one,” “true,” and\n“good”—should be reduced to “thing”\n(Latin res) since everything that exists, including a quality\nor an action of a thing (also called a “thing”) is a\nthing. A good thing, for example, is a thing, and so, too, is a true\nthing. From a grammatical point of view, such terms as\n“good” and “true” are adjectives, and when\nused as substantives (the good, the one), they refer to qualities;\nhence, there is nothing “transcendental” about them.\nValla’s grammatical approach is evident in his rejection of the\nscholastic term ens. Just as “running”\n(currens) can be resolved into “he who runs”\n(is qui currit), so “being” (ens) can be\nresolved into “that which is” (id quod est).\n“That,” however, is nothing other than “that\nthing” (ea res); so we get as a result the\nlaborious formula: “that thing which is”.\n(Repastinatio 1:14; DD 1:23–25.) We do not, however,\nneed the phrase “that which is” (ea que est):\n“a stone is a being” (lapis est ens), or the\nequivalent phrase into which it can be resolved, “a stone is a\nthing which is” (lapis est res que est), are unclear,\nawkward, and absurd ways of saying simply that “a stone is a\nthing” (lapis est res). Valla also rejects other\nscholastic terms such as entitas (“entity”),\nhecceitas (“this-ness”) and quidditas\n(“quidity”) for grammatical reasons: these terms do not\nconform to the rules of word formation in Latin. While he is not\nagainst the introduction of new words for things unknown in antiquity\n(e.g., bombarda for “cannonball”), the\nterminology coined by the scholastics is a different matter\nentirely.\n\nRelated to this analysis is Valla’s repudiation of what he\npresents as the scholastic view of the distinction between abstract\nand concrete terms, that is, the view that abstract terms\n(“whiteness,” “fatherhood”) always refer\nsolely to quality, while concrete terms (“white,”\n“father”) refer to both substance and quality\n(Repastinatio, 1:21–30; DD 1:36–54). In a\ncareful discussion of this distinction, taking into account the\ngrammatical categories of case, number, and gender, Valla rejects the\nontological commitments which such a view seems to imply, and shows,\non the basis of a host of examples drawn from classical Latin usage,\nthat abstract terms often have the same meaning as their concrete\ncounterparts (useful/utility, true/truth, honest/honesty). These terms\nrefer to the concrete thing itself, that is, to the substance, its\nquality or action (or a combination of these three components into\nwhich a thing can be resolved). Again, Valla’s main concern is\nto study the workings of language and how these relate to the world of\neveryday things, the world that we see and experience.\n\nIn describing and analyzing this world of things Valla is not only\nguided by grammatical considerations. He also uses “common\nsense” and the limits of our imagination as yardsticks against\nwhich to measure scholastic notions and definitions. He thus thinks\nthat it is ridiculous to imagine prime matter without any form or form\nwithout any matter, or to define a line as that which has no width and\na point as an indivisible quantity that occupies no space.\nValla’s idea is that notions such as divisibility and quantity\nare properly at home only in the world of ordinary things. For him,\nthere is only the world of bodies with actual shapes and dimensions;\nlines and points are parts of these things, but only, as he seems to\nsuggest, in a derivative sense, in other words, as places or spaces\nthat are filled by the body or parts of that body. If we want to\nmeasure or sketch a (part of a) body, we can select two spots on it\nand measure the length between them by drawing points and lines on\npaper or in our mind, a process through which these points and lines\nbecome visible and divisible parts of our world\n(Repastinatio, 1:142–147; 2:427–431; DD\n254–64). But it would be wrong to abstract from this diagramming\nfunction and infer a world of points and lines with their own\nparticular quantity. They are merely aids for measuring or outlining\nbodies. In modern parlance, Valla seems to be saying that ontological\nquestions about these entities—do they exist? how do they\nexist?—amount to category mistakes, equivalent to asking the\ncolor of virtue.\n\nThe appeal to common sense (or what Valla considers as such) informs\nhis critique of Aristotelian natural philosophy. He insists on\ncommonplace observations and experiences as criteria for testing ideas\nand hypotheses. On this basis, many of Aristotle’s contentions,\nso Valla argues, are not true to the facts (Repastinatio,\n1:98–112; DD 1:174–99). He rejects or qualifies a\nnumber of fundamental tenets of Aristotelian physics, for instance\nthat movement is the cause of heat, that a movement is always caused\nby another movement, that elements can be transformed into one\nanother, that each has its own proper qualities (heat and dryness for\nfire, heat and humidity for air, etc.), that there are pure elements,\nthat the combination of heat and humidity is a sufficient condition\nfor the generation of life, and so forth. Valla often uses\nreductio ad absurdum as an argumentative strategy: if\nAristotle’s theory is true, one would expect to observe\nphenomena quite different from the ones we do, in fact, observe. In\narguing, for instance, for the existence of a fiery sphere below the\nmoon, Aristotle had claimed that “leaden missiles shot out by\nforce melt in the air” (De caelo II.7,\n289a26–28). Valla rejects this claim by appealing to ordinary\nexperience: we never see balls—whether leaden, iron, or stone,\nshot out of a sling or a cannon—heat up in the air; nor do the\nfeathers of arrows catch fire. If movement is sufficient to produce\nheat, the spheres would set the air beneath in motion; but no one has\never observed this. Arguably, the importance of Valla’s polemic\nhere is not so much the quality of his arguments as the critical\ntendency they reveal, the awareness that Aristotle’s conclusions\noften do not conform to daily experience. While he does not develop\nhis critique in the direction of an alternative natural philosophy as\nlater Renaissance philosophers such as Bernardino Telesio\n(1509–1588) and Francesco Patrizi of Cherso (1529–1597)\nwould do, Valla contributed to undermining faith in the exclusive\nvalidity of the Aristotelian paradigm.\n\nValla also criticizes Aristotle’s natural philosophy because,\naccording to him, it detracts from God’s power. In strongly\npolemical terms, he attacks Aristotle for his\n“polytheistic” ideas and for what Valla sees as his\nequation of God with nature (Repastinatio, 1:54–59;\nDD 1:94–103). Valla wants to reinstate God as the sole\ncreator of heaven and earth. To think of the cosmos in terms of a\nliving animal or the heavens in terms of celestial orbs moved by\nintelligences is anathema to Valla (as it was to many medieval\nscholastics as well). The notion of God as First Mover is also\nrejected, since movement and rest are terms which should not be\napplied (except perhaps metaphorically) to spiritual beings such as\nGod, angels, and souls.\n\nReligious considerations also led Valla to find fault with another\nfundamental tenet of Aristotelian scholastic thought: the Tree of\nPorphyry (Repastinatio, 1:46–50; 2:389–391;\nDD 1:82–88). Valla has several problems with the Tree. First\nof all, it puts substance, rather than thing, on top. For Valla,\nhowever, pure substance does not exist, since a thing is always\nalready a qualified substance. He also thinks that there is no place\nfor a human being in the Tree of Porphyry. Since the Tree divides\nsubstance into the corporeal and the spiritual, it is difficult to\nfind a place for a human being, consisting of both soul and body.\nMoreover, the Tree covers both the divine and the created order, which\nleads to inappropriate descriptions of God and angels, to which the\nterm “animal” should not be applied, since they do not\nhave a body. Valla, therefore, divides Porphyry’s Tree into\nthree different trees: one for spiritual substance, one for corporeal\nsubstance, and one for what he calls “animal,” that is,\nthose creatures which consist of both body and soul\n(Repastinatio, 1:49–50; 2:422–424; DD\n1:88). One might argue that what Valla gains over Porphyry by\ndisentangling the supernatural from the natural order, he loses by\nhaving to admit that he cannot place Christ in any of his three trees,\nsince he is not only human but also God.\n\nThe soul as an incorporeal substance is treated by Valla in a separate\nchapter (Repastinatio, 1:59–73; 2:408–410;\n418–419; DD 1:104–29). Rejecting the Aristotelian\nhylomorphic account, he returns to an Augustinian picture of the soul\nas a wholly spiritual and immaterial substance made in the image of\nGod, and consisting of memory, intellect, and will. He rejects without\nmuch discussion the various functions of the soul (vegetative,\nsensitive, imaginative, intellectual), which would entail, he thinks,\na plurality of souls. He briefly treats the five exterior senses but\nis not inclined to deal with the physiological aspects of sensation.\nThe term “species” (whether sensible or intelligible) does\nnot occur at all. The Aristotelian sensus\ncommunis—which the medieval commentary tradition on\nDe anima had viewed as one of the internal senses,\nalongside imagination (sometimes distinguished from\nphantasia), memory, and the vis aestimativa\n(foresight and prudence)—is mentioned only to be rejected\nwithout further argument (Repastinatio, 1:73; DD\n1:128). Imagination and the vis aestimativa are absent from\nValla’s account, while memory, as the soul’s principal\ncapacity, appears to have absorbed all the functions which scholastics\nhad divided among separate faculties of the sensitive soul. What may\nhave provoked Valla’s anger about the traditional picture is the\nseemingly passive role allotted to the soul in perception and\nknowledge: it seems to come only at the very end of a long chain of\ntransmission, which starts with outer objects and concludes with a\nmerely receptive tabula rasa. In his view, the soul is far\nmore noble than the hylomorphic account of Aristotle implies, at least\nas Valla understands that account. He therefore stresses on various\noccasions the soul’s dignified nature, its immortality, unity,\nautonomy, and superiority to both the body and the animal soul,\ncomparing it to the sun’s central place in the cosmos.\n3. Valla’s “Reform” of Aristotelian Logic\n\nAfter Valla’s attack on what he calls the fundamenta\n(foundations) of Aristotelian-scholastic metaphysics and natural\nphilosophy, he turns to dialectic in Books II and III of his\nRepastinatio. For Valla, argumentation should be approached\nfrom an oratorical rather than a logical point of view. What counts is\nwhether an argument works, which means whether it convinces\none’s adversary or public. The form of the argument is less\nimportant. Dialectic is a species of confirmation and refutation; and,\nas such, it is merely a component of invention, one of the five parts\nof rhetoric (Repastinatio, 1:175; 2:447; DD 2:3).\nCompared to rhetoric, dialectic is an easy subject and does not\nrequire much time to master, since it considers and uses only the\nsyllogism “bare”, as Valla puts it, that is, in isolation\nfrom its wider argumentative context; its sole aim is to teach. The\nrhetorician, on the other hand, uses not only the syllogism, but also\nthe enthymeme (incomplete syllogism), epicheireme (a kind of extended\nreasoning) and example. The orator has to clothe everything in\npersuasive arguments, since his task is not only to teach but also to\nplease and to move. This leads Valla to downplay the importance of the\nAristotelian syllogism and to consider forms of argumentation that are\nnot easily forced into its straightjacket. Among these are captious\nforms of reasoning such as the dilemma, paradox, and heap argument\n(sorites), and Valla offers an interesting analysis of these\nforms in the last book of the Repastinatio.\n\nWithout rejecting the syllogism tout court, Valla is scathing\nabout its usefulness. He regards it as an artificial type of\nreasoning, unfit to be employed by orators since it is does not\nreflect the natural way of speaking and arguing. What is the use, for\nexample, of concluding that Socrates is an animal if one has already\nstated that every man is an animal and that Socrates is a man? It is a\nsimple, puerile, and pedantic affair, hardly amounting to a real\nars (art). Valla’s treatment of the syllogism clearly\nshows his oratorical perspective. Following Quintilian, he stresses\nthat the nature of syllogistic reasoning is to establish proof. One of\nthe two premises contains what is to be proven (que\nprobatur), and the other offers the proof (que probat),\nwhile the conclusion gives the result of the proof—into which\nthe proof “goes down” (in quam probatio\ndescendit). It is not always necessary, therefore, to have a\nfixed order (major, minor, conclusion). If it suits the occasion\nbetter, we can just as well begin with the minor, or even with the\nconclusion. The order is merely a matter of convention and custom\n(Repastinatio, 1:282–286; 2:531–534; DD\n2:216–39).\n\nThese complaints about the artificiality of the syllogism inform\nValla’s discussion of the three figures of the syllogism.\nAristotle had proven the validity of the moods of Figure 2 and 3 by\nconverting them to four moods of Figure 1; and this was taught, for\nexample, by Peter of Spain (thirteenth century) in his widely read\nhandbook on logic, the Summulae logicales, certainly\nconsulted by Valla here. Valla regards this whole business of\nconverting terms and transposing propositions in order to reduce a\nparticular syllogism to one of these four moods of Figure 1 as useless\nand absurd. While he does not question the validity of these four\nmoods, he believes that there are many deviant syllogisms that are\nalso valid, for instance: God is in every place; Tartarus is a place;\ntherefore, God is in Tartarus. Here the “every” or\n“all” sign is added to the predicate in the major\nproposition. He says, moreover, that an entirely singular syllogism\ncan be valid: Homer is the greatest of poets; this man is the greatest\nof poets; therefore, this man is Homer. And he gives many other\nexamples of such deviant schemes. Valla thus deliberately ignores the\ncriteria employed by Aristotle and his commentators—that at\nleast one premise must be universal, and at least one premise must be\naffirmative, and that if the conclusion is to be negative, one premise\nmust be negative—or, at any rate, he thinks that they\nunnecessarily restrict the number of possible valid figures.\n\nIn his discussion of the syllogism Valla does not refer to an\nimportant principle employed by Aristotle and his commentators:\ndici de omni et nullo (to be said/predicated about all and\nabout none). To quote Peter of Spain’s Summulae\nlogicales: “To be said of every [dici de\nomni] is when there is nothing to to be taken under the subject\n[nichil est sumere sub subiecto] of which the predicate may\nnot be said, like ‘every man runs’: here, running is said\nof every man, and under man there is nothing to to be taken of which\nrunning is not said. To be said of none [de nullo]\nis when there is nothing to be taken under the subject from which the\npredicate may not be eliminated, like ‘no man runs’: here,\nrunning is eliminated from any man at all [quolibet\nhomine]” (ed. L. M. de Rijk 1972, 43; ed. Copenhaver et\nal., 2014, 170). This principle led Aristotle to conclude that only\nfour moods of the first figure were immediately valid. That Valla does\nnot make use of this fundamental condition is understandable from his\noratorical point of view, since it would be an uninteresting or even\nirrelevant criterion of validity. It is therefore not surprising that\nhe thinks that we might as well “reduce” the first figure\nto the second rather than vice versa. Likewise, from his oratorical\npoint of view, he can only treat the third figure of the syllogism\nwith contempt: it is a “completely foolish” form of\nreasoning; no one reasons as follows: every man is a substance; every\nman is an animal; therefore, some animal is a substance. In a similar\nvein, he rejects the use of letters in the study of syllogisms\n(Repastinatio, 1:297–300; 2:546–548; DD\n2:264–71).\n\nValla’s insistence on examining and assessing arguments in terms\nof persuasion and usefulness leads him to criticize not only the\nsyllogism but also other less formal modes of argumentation. These\nmodes usually involve interrogation, resulting in an unexpected or\nunwanted conclusion or an aporetic situation. Some scholars have\nregarded Valla’s interest in these less formal or non-formal\narguments as an expression of a skeptical attitude towards the\npossibility of certainty in knowledge in general. Others have raised\nserious doubts about this interpretation. What we can say for sure,\nhowever, is that Valla was one of the first to study and analyze the\nheap argument, dilemma, and suchlike. The heap argument is supposed to\ninduce doubts about the possibility of determining precise limits,\nespecially to quantities. If I subtract one grain from a heap, is it\nstill a heap? Of course. What if I subtract two grains? And so forth,\nuntil the heap consists of just one grain, which, to be sure, is an\nunacceptable conclusion. It seems impossible to determine the exact\nmoment when the heap ceases to be a heap, and any attempt to determine\nthis moment seems to involve an ad hoc decision, for a heap does not\ncease to be a heap due to the subtraction of just one single grain.\nValla discusses a number of similar cases, and comments on their\nfallacious nature.\n\nDilemma, too, receives extensive treatment from him. This type of\nargument had been widely studied in antiquity. The basic structure is\na disjunction of propositions, usually in the form of a double\nquestion in an interrogation, which sets a trap for the respondent,\nsince whichever horn of the dilemma he chooses, he seems to be caught\nup in a contradiction and will lose the debate (“If he is\nmodest, why should you accuse someone who is a good man? If he is bad,\nwhy should you accuse someone who is unconcerned by such a\ncharge?”, Cicero, De inventione 1.45.83, cited by Valla\nRepastinatio, 1:321; DD 2:332). It was also\nrecognized that the respondent could often counter the dilemma by\nduplicating the original argument and “turning it back”\n(convertere) on the interrogator, using it as a kind of\nboomerang (“if he is modest, you should accuse him because he\nwill be concerned by such a charge; if he is bad, you should also\naccuse him because he is not a good man”). Alternatively, he\ncould escape the dilemma by questioning the disjunction and showing\nthat there is a third possibility. There were many variations of this\nsimple scheme, and it was studied from a logical as well as a\nrhetorical point of view with considerable overlap between these two\nperspectives.\n\nIn medieval times, dilemma does not seem to have attracted much\ntheoretical reflection, though there was an extensive literature on\nrelated genres such as insolubilia and paradoxes, which were\ngenerally treated in a logical manner. It is, therefore, interesting\nto see Valla discussing a whole range of examples of dilemma. The\nrhetoric textbook by the Byzantine émigré George of\nTrebizond (1396–1486), composed about 1433, was probably an\nimportant source for him. This work might also have led Valla to\nexplore the relevant places in Quintilian, Cicero, the Greek text of\nAristotle’s Rhetoric and perhaps other Greek sources.\nThe example Valla discusses most extensively comes from Aulus Gellius\nand concerns a lawsuit between Protagoras and his pupil Euathlus\n(Repastinatio, 1:312–319; 2:562–568; DD\n2:312–28. Aulus Gellius, Noctes Atticae, 5.10.5–16).\nThe pupil has promised to pay the second installment of the fees as\nsoon as he has won his first case. He refuses to undertake any cases,\nhowever, and Protagoras takes him to court, putting the case in the\nform of a dilemma. If Euathlus loses the case, he will have to pay the\nrest of the fee, on account of the verdict of the judges; but if\nEuathlus wins, he will also have to pay, this time on account of his\nagreement with Protagoras. Euathlus, however, cleverly converts the\nargument: in neither case will he have to pay, on account of the\ncourt’s decision (if he wins), or on account of the agreement\nwith Protagoras (if he loses). Aulus Gellius thinks that the judges\nshould have refrained from passing judgment because any decision would\nbe inconsistent with itself. But Valla rejects such a rebuttal\n(antistrephon or conversio) of the dilemma and\nthinks that a response may be formulated as long as one concentrates\non the relevant aspects of the case. He carefully considers the\nperspectives of all parties, the words employed, the feelings of the\njudges, and all the circumstances of the case. In a highly rhetorical\nanalysis of the case in which Valla makes speeches on behalf of\nProtagoras, Valla says in the end that Euathlus cannot have it both\nways and must choose one or the other alternative, not both: he must\ncomply either with his agreement with Protagoras (and pay the rest of\nthe fees) or with the verdict passed by the judges. If he loses the\ncase, a refusal to obey the sentence of the judges shows contempt; if\nhe wins the case, he has to pay the rest of the fee to Protagoras. At\nany rate, there is no reason for the judges to despair; Aulus Gellius\nis, therefore, wrong in thinking that they should have refrained\nfrom passing a judgment. In all such cases, Valla argues, the\nconversion is not a rebuttal, but at best a correction of the initial\nargument (a correction, however, is not a refutation), and at worst a\nsimple repetition or illegitimate shift of the initial position.\n\nAn important way of seeing through deceptive arguments is to consider\nthe weight of words carefully, and Valla gives some further examples\nof fallacies which can easily be refuted by examining the meaning and\nusage of words and the contexts in which they occur\n(Repastinatio, 1:320–334; 2:568–578; DD\n2:328–69). He considers the fallacies “collected by Aristotle in\nhis Sophistical Refutations as for the most part a puerile\nart,” quoting the Rhetorica ad Herennium (2.11.16) to\nthe effect that “knowledge of ambiguities as taught by\ndialecticians is of no help at all but rather a most serious\nhindrance.” Valla is not interested in providing a comprehensive\nlist of deceptive arguments and errors or in studying rules for\nresolving them. He does not mention, for example, the basic division\nbetween linguistic (in dictione) and extra-linguistic\n(extra dictionem) fallacies. In a letter to a friend, Valla\nlists some “dialecticians”—Albert of Saxony (c.\n1316–1390), Albert the Great (c. 1220–1280), Ralph Strode\n(fl. 1350–1400), William of Ockham, and Paul of Venice (c.\n1369–1429) —but there is no sign that he had done more\nthan leaf through their works on sophismata and\ninsolubilia (Valla 1984, 201). The few examples he gives seem\nto come from Peter of Spain’s Summulae logicales. Nor\nwas it necessary to have more than a superficial acquaintance with the\nworks of these dialecticians in order to realize that their approach\ndiffered vastly from his. As he repeatedly states, what is required in\norder to disambiguate fallacies is not a deeper knowledge of the rules\nof logic but a recognition that arguments need to be evaluated within\ntheir wider linguistic and argumentative context. Such an examination\nof how words and arguments function will easily lay bare the\nartificial and sophistical nature of these forms of argumentation.\n\nThis approach is also evident in Valla’s analysis of the\nproposition of which a syllogism or argument consists. Propositions\nare traditionally divided according to quantity (universal of\nparticular) and to quality (affirmative and negative). Quantity and\nquality are indicated by words that are called signa\n(markers, signs): “all,” “any,”\n“not,” “no one,” and so forth. In Book II of\nthe Repastinatio, Valla considers a much wider range of words\nthan the medieval logicians, who had mainly worked with\n“all,” “some,” “none,” and\n“no one”. To some extent, his aim is not unlike that of\nthe dialecticians whom he so frequently attacks, that is, to study\nsigns of quality and negation and how they determine the scope of a\nproposition. But for him there is only one proper method of carrying\nout such a study: examining carefully the multifarious ways in which\nthese words are used in refined and grammatically correct Latin. Not\nsurprisingly, Valla criticizes the square of contraries—the\nfourfold classification of statements in which the distinction between\nuniversal and particular and that between affirmative and negative are\ncombined. A similar critique of the rather arbitrary restriction to a\nlimited set of words is applied to the scholastic notion of modality\n(Valla Repastinatio, 1:237–244; 2:491–497;\nDD 2:126–43). Scholastics usually treat only the following\nsix terms as modals: “possible,” “impossible,”\n“true,” “false,” “necessary,” and\n“contingent.” Latin, however, is much more resourceful in\nexpressing modality. Using criteria such as refinement and utility,\nValla considers terms such as “likely/unlikely,”\n“difficult/easy,” “certain/uncertain,”\n“useful/useless,” “becoming/unbecoming,” and\n“honorable/dishonorable.” This amounts to introducing a\nwholly new concept of modality, which comes close to an adverbial\nqualification of a given action.\n\nValla’s principal bêtes noires are Aristotle,\nBoethius, Porphyry, and Peter of Spain, but he also speaks in general\nterms of the entire natio peripatetica (nation of\nPeripatetics). He frequently refers to isti (those), a\nsuitably vague label for the scholastic followers of\nAristotle—including both dialecticians and theologians. It has\noften been claimed that Valla is attacking late medieval\nscholasticism; but it must be said that he does not quote any late\nmedieval scholastic philosophers or theologians. He generally steers\nclear of their questions, arguments, and terminology. If we compare\nValla’s Repastinatio with, for example, Paul of\nVenice’s Logica parva (The Small\nLogic), we quickly perceive the immense difference in attitude,\nargument, and approach. Moreover, as noted above, Valla’s\ngrammatical and oratorical approach is fundamentally different from\nOckham’s terminism. He probably thought that he did not need to\nengage with the technical details of scholastic works. It was\nsufficient for him to establish that there was a huge distance between\nhis own approach and that of the scholastics. Once he had shown that\nthe scholastic-Aristotelian edifice was built on shaky foundations, he\ndid not care to attack the superstructure, so to speak. And Valla\nproved to his own satisfaction that these foundations were shaky by\nshowing that the terminology and vocabulary of the scholastics rested\non a misunderstanding of Latin and of the workings of language in\ngeneral. But even though his criticisms are mainly addressed to\nAristotle, Boethius, and Porphyry, his more general opinion of\nAristotelianism was, of course, formed by what he saw in his own time.\nHe loathed the philosophical establishment at the universities, their\nmethods, genres, and, above all, their style and terminology. He\nthought that they were slavishly following Aristotle. In his view,\nhowever, a true philosopher does not hesitate to re-assess any opinion\nfrom whatever source; refusing to align himself with a sect or school,\nhe presents himself as a critical, independent thinker\n(Repastinatio, 1:1–8; 2:359–363; DD\n1:2–12). Whether scholasticism had, indeed, ossified by the time Valla\ncame on the scene is a matter of debate; but there is no question that\nthis is how he and the other humanists saw it.\n4. Moral Philosophy\n\nThe same critical spirit also infuses Valla’s work on moral\nphilosophy. In his dialogue, published as De voluptate in\n1431, when he was still in his mid-twenties, and revised two years\nlater under the title De vero bono (On the True\nGood), Valla presents a discussion between an\n“Epicurean,” a “Stoic,” and a\n“Christian” on an age-old question: what is the highest\nethical good? The result of this confrontation between pagan and\nChristian moral thought is a combination of Pauline fideism and\nEpicurean hedonism, in which the Christian concepts of charity and\nbeatitude are identified with hedonist pleasure, and the\n“Stoic” concept of virtue is rejected (Valla, De vero\nfalsoque bono). Valla thus treats Epicureanism as a\nstepping-stone to the development of a Christian morality based on the\nconcept of pleasure, and repudiates the traditional synthesis of\nStoicism and Christianity, popular among scholastics and humanists\nalike. The substance of the dialogue is repeated in a long chapter in\nhis Repastinatio (Repastinatio, 1:73–98;\n2:411–418; DD 1:130–75).\n\nValla’s strategy is to reduce the traditional four\nvirtues— prudence, justice, fortitude, and propriety (or\ntemperance)—to fortitude, and then to equate fortitude with\ncharity and love. For Valla, fortitude is the essential virtue, since\nit shows that we do not allow ourselves to be conquered by the wrong\nemotions, but instead to act for the good. As a true virtue of action,\nit is closely connected to justice and is defined as “a certain\nresistance against both the harsh and the pleasant things which\nprudence has declared to be evils.” It is the power to tolerate\nand suffer adversity and bad luck, but also to resist the\nblandishments of a fortune which can be all too good, thus weakening\nthe spirit. Fortitude is the only true virtue, because virtue resides\nin the will, since our actions, to which we assign moral\nqualifications, proceed from the will.\n\nValla’s reductive strategy has a clear aim: to equate this\nessential virtue of action, fortitude, with the biblical concept of\nlove and charity. This step requires some hermeneutic manipulation,\nbut the Stoic overtones of Cicero’s account in De\nofficiis have prepared the way for it—ironically, perhaps,\nin view of Valla’s professed hostility towards\nStoicism—since enduring hardship with Stoic patience is easily\nlinked to the Pauline message that we become strong by being tested\n(II Cor. 12:10, quoted by Valla). The labor, sweat, and trouble we\nmust bear, though bad in themselves, “are called good because\nthey lead to that victory,” Valla writes, echoing St Paul\n(Repastinatio, 1:88–89; 2:415; DD 1:156). We\ndo not, then, strive to attain virtue for its own sake, since it is\nfull of toil and hardship, but rather because it leads us to our goal.\nThis is one of Valla’s major claims against the Stoics and the\nPeripatetics, who—at least in Valla’s\ninterpretation— regarded virtue as the end of life, that is, the\ngoal which is sought for its own sake. Because virtuous behavior is\ndifficult, requiring us to put up with harsh and bitter afflictions,\nno one naturally and voluntarily seeks virtue as an end in itself.\nWhat we seek is pleasure or delectation, both in this life\nand—far more importantly —in the life to come.\n\nBy equating pleasure with love, Valla can argue that it is love or\npleasure that is our ultimate end. This entails the striking notion\nthat God is not loved for his own sake, but for the sake of love:\n“For nothing is loved for its own sake or for the sake of\nsomething else as another end, but the love itself is the end”\n(Repastinatio, 2:417). This is a daring move. Traditionally,\nGod was said to be loved for his own sake, not for his usefulness in\ngaining something else. Many thinkers agreed with Augustine that\nconcupiscent love was to be distinguished from friendship, and, with\nrespect to heavenly beatitude, use from fruition. We can love\nsomething as a means to an end (use), and we can love something for\nits own sake (fruition). But because Valla has maintained that\npleasure is our highest good, God can only be loved as a means to that\nend.\n\nIt is therefore a moot point whether Valla successfully integrated\nEpicurean hedonism with Christian morality. He seems to argue that the\nEpicurean position is valid only for the period before the coming of\nChrist. In our unredeemed state, we are rightly regarded as\npleasure-seeking animals, governed by self-interest and utilitarian\nmotives. After Christ’s coming, however, we have a different\npicture: repudiating Epicurean pleasure, we should choose the harsh\nand difficult life of Christian honestas (virtue) as a step\ntowards heavenly beatitude. Yet, the two views of human beings are not\nso readily combined. On the one hand, there is the positive evaluation\nof pleasure as the fundamental principle in human\npsychology—which is confirmed and underscored by the\nterminological equation of voluptas (pleasure),\nbeatitudo (beatitude), fruitio (fruition),\ndelectatio (delectation), and amor (love). On the\nother hand, Valla states apodictically that there are two pleasures:\nan earthly one, which is the mother of vice, and a heavenly one, which\nis the mother of virtue; that we should abstain from the former if we\nwant to enjoy the latter; and that the natural, pre-Christian life is\n“empty and worthy of punishment” if not put in the wider\nperspective of human destiny. In other words, we are commanded to live\nthe arduous and difficult life of Christian honestas, ruled\nby restraint, self-denial, and propriety (temperance), and, at the\nsame time, to live a hedonist life, which consists of the joyful,\nfree, and natural gratification of the senses.\n\nAnother of his targets is the Aristotelian account of virtue as a mean\nbetween two extremes. According to Valla, each individual vice is\ninstead the opposite of an individual virtue. He makes this point by\ndistinguishing between two different senses of the same virtue,\nshowing that they have different opposites. So, while Aristotle\nregards fortitude as the mean between the vices of rashness and\ncowardice, Valla argues that there are two aspects to fortitude:\nfighting bravely and being cautious (for instance, in yielding to the\nvictorious enemy), with cowardice and rashness as their respective\nopposites. Likewise, generosity is not the mean between avarice and\nprodigality, but has two aspects: giving and not giving. Prodigality\nis the opposite of the first aspect, avarice of the second, for which\nwe should use the term frugality or thrift rather than generosity.\nMore generally, the terminology of vices as defects and excesses and\nvirtue as a mean is misleading; virtues and vices should not be ranked\n“according to whether they are at the bottom, or halfway up, or\nat the top.” Interestingly, a similar critique of\nAristotle’s notion of virtue as a mean between two extremes has\nbeen raised in modern scholarship (for example, by W. D. Ross).\n\nValla regards the Aristotelian notion of virtue as too static and\ninflexible, so that it does not do justice to the impulsive nature of\nour moral behavior. For him, virtue is not a habit, as Aristotle\nbelieved, but rather an affect, an emotion or feeling that can be\nacquired and lost in a moment’s time. Virtue is the domain\nsolely of the will. The greatest virtue or the worse vice may arise\nout of one single act. And because virtue is painful and vice\ntempting, one may easily slide from the one into the other, unlike\nknowledge, which does not turn into ignorance all of a sudden. Valla\ntherefore frequently removes the notions of knowledge, truth, and\nprudence from the sphere of moral action. Virtues as affects are\nlocated in the rear part of the soul, the will, while the domains of\nknowledge, truth, and opinion reside in the other two faculties,\nmemory and reason (Repastinatio, 1:73–74; DD\n1:130). This is not to say that the will is independent from the\nintellectual capacities. The affects need reason as their guide, and\nthe lack of such guidance can result in vice. But Valla is not\nentirely clear as to what element we should assign the moral\nqualification “good” or “bad.” He identifies\nvirtues with affects, and says that only these merit praise and blame\n(Repastinatio, 1:74; DD 1:130–32); however, he also\nwrites that the virtues, as affects, cannot be called good or bad in\nthemselves, but that these judgments apply only to the will, that is,\nto the will’s choice. This is underlined by his remark that\nvirtue resides in the will rather than in an action\n(Repastinatio, 1:77; DD 1:136). In his discussion of\nthe soul, however, he frequently calls reason the will’s guide\n(e.g., Valla Repastinatio, 1:75; DD 1:132), and also\nsays that the affects should follow reason, so that it, too, may be\nheld responsible, in the final analysis, for moral behavior (even\nthough he also explicitly denies that the will is determined by\nreason). Finally, pleasure, delectation, or beatitude are also called\nvirtue by the equation of virtue with love and with charity\n(Repastinatio, 1:85; DD 1:150–52).\n\nMoreover, Valla’s insistence on the will as the locus of moral\nbehavior seems compromised by the predestinarianism advocated by the\ninterlocutor “Lorenzo” in his dialogue De libero\narbitrio (On Free Will). In this highly rhetorical work,\nValla—if we can assume that Lorenzo represents Valla’s own\nposition—stresses that in his inscrutable wisdom God hardens the\nhearts of some, while saving those of others. We do not know why, and\nit is presumptuous and vain to inquire into the matter. Yet, somehow\nwe do have free will, “Now, indeed, He brings no necessity, and\nHis hardening one and showing another mercy does not deprive us of\nfree will, since He does this most wisely and in full holiness”\n(Valla 1948, 177). So, we are free, after all, and God’s\nforeknowledge does not necessitate the future; but how exactly Valla\nthinks his views settle these issues is not clear. His fideistic point\nis that we humans cannot settle the issue; ‘the cause of the\ndivine will which hardens one and shows mercy to another is known\nneither to man nor to angels’. Yet, in spite of his fideism and\nanti-intellectualism, his own discussion of God and free will, as well\nas his account of the Trinity in the Repastinatio, makes\nsubstantive claims about what God is.\n\nIn conclusion, Valla’s moral thought can be described—with\nsome justice—as hedonistic, voluntarist, and perhaps also\nempirical (in the sense of taking account of how people actually\nbehave). On closer inspection, however, his account seems to contain\nthe seeds of several ideas that are not so easily reconciled with one\nanother. This is doubtless due, in no small measure, to his\neclecticism, his attempt to bring into one picture Aristotelian\nethics, the Stoic virtues of Cicero, the biblical concepts of charity\nand beatitude, and the Epicurean notion of hedonist pleasure—\neach with its own distinctive terminology, definitions, and\nphilosophical context.\n5. Evaluation\n\nValla’s contributions to historical, classical, and biblical\nscholarship are beyond doubt, and helped to pave the way for the\ncritical textual philology of Poliziano, Erasmus, and later\ngenerations of humanists. Valla grasped the important\ninsight—which was not unknown to medieval philosophers and\ntheologians—that the meaning of a text can be understood only\nwhen it is seen as the product of its original historical and cultural\ncontext. Yet his attempt to reform or transform the scholastic study\nof language and argumentation—and, indeed, their entire mode of\ndoing philosophy—is likely to be met with skepticism or even\nhostility by the historian of medieval philosophy who is dedicated to\nthe argumentative rigor and conceptual analysis which are the\nhallmarks of scholastic thought. Nevertheless, while it may be true\nthat Valla’s individual arguments are sometimes weak,\nsuperficial, and unfair, his critique as a whole does have an\nimportant philosophical and historical significance. The following two\npoints, in particular, should be mentioned.\n\nFirst, the humanist study of Stoicism, Epicureanism, skepticism, and\nNeoplatonism widened the philosophical horizon and eroded faith in the\nuniversal truth of Aristotelian philosophy—an essential\npreparatory stage for the rise of early modern thought. In\nValla’s day, Aristotle was still “the Philosopher,”\nand scholastics put considerable effort into explaining his words.\nValla attacks what he sees as the ipse dixit attitude of the\nscholastics. For him, a true philosopher does not follow a single\nmaster but instead says whatever he thinks. Referring to\nPythagoras’ modest claim that he was a not a wise man but a\nlover of wisdom (Repastinatio, 1:1; DD 1:2), Valla\nmaintains that he does not belong to any sect (including that of the\nskeptics) and wants to retain his independence as critical thinker.\nWhat the scholastics forget, he thinks, is that there were many\nalternatives in antiquity to the supposedly great master, many sects,\nand many other types of philosopher. In criticizing Aristotle’s\nnatural philosophy, for instance, he gave vent to a sentiment which\nultimately eroded faith in the Aristotelian system. This does not,\nhowever, mean that he was developing a non-Aristotelian natural\nphilosophy; his rejection of Aristotle’s account of nature was\nprimarily motivated by religious and linguistic considerations.\nIndeed, Valla’s insistence on common linguistic usage, combined\nwith his appeal to common sense and his religious fervor, seems at\ntimes to foster a fideism that is at odds with an exploratory attitude\ntowards the natural world. But with hindsight we can say that\nany undermining of the faith in the exclusiveness of the\nscholastic-Aristotelian worldview contributed to its demise and,\nultimately, to its replacement by a different, mechanistic one. And\nalthough the humanist polemic was only one factor among many others,\nits role in this process was by no means negligible. Likewise, in\nattacking Peripatetic moral philosophy, Valla showed that there were\nalternatives to the Aristotelian paradigm, even though his use of\nEpicureanism and Stoicism was rhetorical rather than historical.\n\nThe second point relates to the previous one. In placing himself in\nopposition to what he regarded as the Aristotelian paradigm, Valla\noften interprets certain doctrines—the syllogism, hypothetical\nsyllogism, modal propositions, and the square of contraries—in\nways they were not designed for. In such cases, we can see Valla\nstarting, as it were, from the inside of the Aristotelian paradigm,\nfrom some basic assumptions and ideas of his opponents, in order to\nrefute them by using a kind of reductio ad absurdum or\nsubmitting them to his own criteria, which are external to the\nparadigm. This moving inside and outside of the Aristotelian paradigm\ncan explain (and perhaps excuse) Valla’s inconsistency, for it\nis an inconsistency which is closely tied to his tactics and his\nagenda. He does not want to be consistent if this means merely obeying\nthe rules of the scholastics, which in his view amounted to rigorously\ndefining one’s terms and pressing these into the straightjacket\nof a syllogistic argument, no matter what common sense and linguistic\ncustom teach us. Behind this inconsistency, therefore, lies a\nconsistent program of replacing philosophical speculation and\ntheorizing with an approach based on common linguistic practice and\ncommon sense. But arguably it has also philosophical relevance; for\nthroughout the history of philosophy a warning can be heard against\nabstraction, speculation, and formalization. One need not endorse this\ncautionary note in order to see that philosophy thrives on the\ncreative tension between, on the one hand, a tendency to abstract,\nspeculate, and formalize, and, on the other, a concern that the object\nof philosophical analysis should not be lost from sight, that\nphilosophy should not become a game of its own—an abstract and\ntheoretical affair that leaves the world it purports to analyze and\nexplain far behind, using a language that can be understood only by\nits own practitioners.\n",
    "bibliography": {
        "categories": [
            "<a name=\"PriSouSelWorVal\">Primary Sources: Selected Works by Valla</a>",
            "<a name=\"SelSecLit\">Selected Secondary Literature</a>"
        ],
        "cat_ref_text": {
            "<a name=\"PriSouSelWorVal\">Primary Sources: Selected Works by Valla</a>": [
                "</h3>\n<p>\nThe 1962 reprint of Valla’s <em>Opera omnia</em>, contains his\nmost important writings. A new critical edition of his complete works\nwas launched in 2007: “Edizione Nazionale delle opere di Lorenzo\nValla” (Florence: Polistampa). Several volumes have now\nappeared.</p>\n<ul class=\"hanging\">",
                "<em>Opera omnia</em>, Basel 1540; repr. with a second volume,\nTurin: Bottega d’Erasmo, 1962.",
                "<em>Repastinatio dialectice et philosophie</em>, G. Zippel (ed.),\n2 vols., Padua: Antenore, 1982. [vol. 1 contains the third version;\nvol. 2 the first.]",
                "<em>Dialectical Disputations</em>, B. Copenhaver and L. Nauta (ed.\nand trans.), 2 vols. Cambridge, MA: Harvard University Press,\n2012.",
                "<em>Elegantiae linguae Latinae</em>, S. López Moreda (ed.),\nCáceres: Universidad de Extremadura, 1999.",
                "“Dialogue on Free Will”, C. Trinkaus (trans.), in\n<em>The Renaissance Philosophy of Man</em>, E. Cassirer et al. (eds.),\nChicago: University of Chicago Press, 1948.",
                "<em>De vero falsoque bono</em>, M. de Panizza Lorch (ed.), Bari,\n1970; A. K. Hieatt and M. Lorch (trans.), New York: Abaris Books\n1977.",
                "<em>Collatio Novi Testamenti</em>, A. Perosa (ed.), Florence:\nSansoni, 1970.",
                "“In Praise of Saint Thomas Aquinas”, M. E. Hanley\n(trans.), in <em>Renaissance Philosophy</em>, L. A. Kennedy (ed.),\nMouton: The Hague, 1973.",
                "<em>De falso credita et ementita Constantini donatione</em>, W.\nSetz (ed.), Weimar: Hermann Böhlaus Nachfolger, 1976; repr.\nLeipzig: Teubner, 1994; C. B. Coleman (trans.), Toronto: Toronto\nUniversity Press, 1993; G. W. Bowersock, Cambridge, Mass.: Harvard\nUniversity Press 2007.",
                "<em>Epistole</em>, O. Besomi and M. Regoliosi (ed.), Padua:\nAntenore, 1984.",
                "<em>Le Postille all’</em>Instituto oratoria <em>di\nQuintiliano</em>, L. Cesarini Martinelli and A. Perosa (ed.), Padua:\nAntenore, 1996.",
                "<em>Correspondence</em>, Brendan Cook (ed. and trans. ),\nCambridge, MA: Harvard University Press, 2014.\n</ul>\n<h3>"
            ],
            "<a name=\"SelSecLit\">Selected Secondary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Camporeale, S., 1972. <em>Lorenzo Valla: Umanesimo e\nteologia</em>, Florence: Nella sede dell’Istituto Palazzo\nStrozzi.",
                "–––, 2002. <em>Lorenzo Valla: Umanesimo,\nriforma, e Controriforma</em>, Rome: Edizioni di storia e\nletteratura.",
                "Celenza, C., 2005. “Lorenzo Valla and the Traditions and\nTransmissions of Philosophy,” <em>Journal of the History of\nIdeas</em>, 66: 483–506.",
                "Celenza, C., 2018. <em>The Intellectual World of the Italian\nRenaissance: Language, Philosophy, and the Search for Meaning</em>,\nCambridge: Cambridge University Press.",
                "Copenhaver, B. P., 2005. “Valla Our Contemporary: Philosophy\nand Philology,” <em>Journal of the History of Ideas</em>, 66:\n507–525.",
                "Copenhaver, B. P. and C. B. Schmitt, 1992. <em>Renaissance\nPhilosophy</em>, Oxford: Oxford University Press.",
                "Fois, M., 1969. <em>Il pensiero cristiano di Lorenzo Valla nel\nquadro storico-culturale del suo ambiente</em>, Rome: Libreria\neditrice dell’Univ. Gregoriana.",
                "Fubini, R., 1999. “Contributo per l’interpretazione\ndella <em>Dialectica</em> di Lorenzo Valla,” in G. F. Vescovini,\ned., <em>Filosofia e scienza classica, arabo-latina medievale e\nl’età moderna</em>, Louvain-la-Neuve:\nFédération Internationale des Instituts\nd’Études Médiévales, 289–316.",
                "Gavinelli, S., 1991. “Teorie grammaticali nelle\n<em>Elegantie</em> e la tradizione scolastica del tardo\numanesimo,” <em>Rinascimento</em>, 31: 155–181",
                "Gerl, H.-B., 1974. <em>Rhetorik als Philosophie. Lorenzo\nValla</em>, Munich: Fink.",
                "Gray, H., 1965. “Valla’s <em>Encomium of St. Thomas\nAquinas</em> and the Humanist Conception of Christian\nAntiquity,” in H. Bluhm (ed.), <em>Essays in History and\nLiterature presented by Fellows of the Newberry Library to Stanley\nPargellis</em>, Chicago: Newberry Library, 37–51.",
                "Izbicki, T. M., 1993. “Lorenzo Valla: The Scholarship in\nEnglish Through 1992,” in J. W. O’Malley et al. (eds.),\n<em>Humanity and Divinity in Renaissance and Reformation: Essays in\nHonor of Charles Trinkaus</em>, Leiden: Brill, 287–301.\n[Bibliography on Valla scholarship in English.]",
                "Jong, Jan de, 2015. “<em>De Sepulcro Laurentii Valae quid\nveri habeat</em>: Tracing the Tomb Monument of Lorenzo Valla in\nSt. John Lateran, Rome,” <em>Quellen und Forschungen aus\nitalienischen Archiven und Bibliotheken</em>, 94: 94–128.",
                "Kessler, E., 1988. “Die Transformation des aristotelischen\nOrganon durch Lorenzo Valla,” in E. Kessler et al. (eds.),\n<em>Aristotelismus und Renaissance. In memoriam Charles B.\nSchmitt</em>, Wiesbaden: Harrassowitz, 53–74.",
                "Kraye, J., 2001. “Lorenzo Valla and Changing Perceptions of\nRenaissance Humanism,” <em>Comparative Criticism</em>, 23:\n37–55.",
                "–––, 2004. “Pagan Virtue in Pursuit of\nChristian Happiness: Renaissance Humanists and the Revival of\nClassical Ethics,” in G. Althoff (ed.) <em>Zeichen –\nRituale – Werte: Internationales Kolloquium des\nSonderforschungsbereichs 496 an der Westfälischen\nWilhelms-Universität Münster</em>, Münster: Rhema,\n55–68.",
                "Laffranchi, M., 1999. <em>Dialettica e filosofia in Lorenzo\nValla</em>, Milan: Vita e Pensiero.",
                "Mack, P., 1993. <em>Renaissance Argument. Valla and Agricola in\nthe Traditions of Rhetoric and Dialectic</em>, Leiden: Brill.",
                "Mancini, G., 1891. <em>Vita di Lorenzo Valla</em>, Florence:\nSansoni.",
                "Marsico, C. 2013. <em>Per l’edizione delle Elegantie di\nLorenzo Valla: studio sul V libro</em>, Florence: Firenze University\nPress.",
                "Marsh, D., 1979. “Grammar, Method, and Polemic in Lorenzo\nValla’s <em>Elegantiae</em>,” <em>Rinascimento</em>, 19:\n91–116.",
                "Monfasani, J., 1989. “Was Lorenzo Valla an Ordinary Language\nPhilosopher?” <em>Journal of the History of Philosophy</em>, 50:\n309–323; repr. in J. Monfasani, <em>Language and Learning in\nRenaissance Italy. Selected Articles</em>, Aldershot: Variorum,\n1994.",
                "–––, 1990. “Lorenzo Valla and Rudolph\nAgricola,” <em>Journal of the History of Philosophy</em>, 28:\n181–200; repr. in J. Monfasani, <em>Language and Learning in\nRenaissance Italy. Selected Articles</em>, Aldershot: Variorum,\n1994.",
                "–––, 2000. “The Theology of Lorenzo\nValla,” in J. Kraye and M. W. F. Stone (eds.), <em>Humanism and\nEarly Modern Philosophy</em>, London: Routledge, 1–23; repr. in\nJ. Monfasani, <em>Greeks and Latins in Renaissance Italy. Studies on\nHumanism and Philosophy in the 15<sup>th</sup> Century</em>,\nAldershot: Variorum, 2004.",
                "–––, 2001. “Disputationes\nVallianae,” in F. Mariani Zini (ed.), <em>Penser entre les\nlignes: Philologie et Philosophie au Quattrocento</em>, Lille: Presses\nUniversitaires du Septentrion, 229–250; repr. in J. Monfasani,\n<em>Greeks and Latins in Renaissance Italy: Studies on Humanism and\nPhilosophy in the 15<sup>th</sup> Century</em>, Aldershot: Variorum,\n2004.",
                "Moss, A., 2003. <em>Renaissance Truth and the Latin Language\nTurn</em>, Oxford: Oxford University Press.",
                "Nauta, L., 2003. “William of Ockham and Lorenzo Valla: False\nFriends. Semantics and Ontological Reduction,” <em>Renaissance\nQuarterly</em>, 56: 613–651.",
                "–––, 2003. “Lorenzo Valla’s Critique\nof Aristotelian Psychology,” <em>Vivarium</em>, 41:\n120–143.",
                "–––, 2006. “Lorenzo Valla and Quattrocento\nScepticism,” <em>Vivarium</em>, 44: 375–395",
                "–––, 2007. “Lorenzo Valla and the Rise of\nHumanist Dialectic,” in J. Hankins (ed.), <em>The Cambridge\nCompanion to Renaissance Philosophy</em>, Cambridge: Cambridge\nUniversity Press, 193–210.",
                "–––, 2009. <em>In Defense of Common Sense.\nLorenzo Valla’s Humanist Critique of Scholastic Philosophy</em>,\nCambridge, Mass., Harvard University Press",
                "–––, 2018. “Latin as a Common Language:\nThe Coherence of Lorenzo Valla’s Humanist Program,”\n<em>Renaissance Quarterly</em>, 71: 1–32.",
                "–––, 2021. <em>Philosophy and the Language of\nthe People. The Claims of Common Speech from Petrarch to Locke</em>,\nCambridge: Cambridge University Press.",
                "Paganini, G., 2003. “Hobbes, Valla and the Trinity,”\n<em>British Journal for the History of Philosophy</em>, 11:\n183–218.",
                "Pagliaroli, S., 2006. “Una proposta per il giovane Valla:\n<em>Quintiliani Tulliique examen</em>,” <em>Studi medievali e\numanistici</em>, Volume 4, Messina : Centro interdipartimentale di\nstudi umanistici, Università degli studi di Messina.",
                "Panizza, L. A., 1978. “Lorenzo Valla’s <em>De vero\nfalsoque bono</em>, Lactantius and Oratorical Scepticism,”\n<em>Journal of the Warburg and Courtauld Institutes</em>, 41:\n76–107.",
                "Perreiah, A. R., 1982. “Humanist Critiques of Scholastic\nDialectic,” <em>Sixteenth-Century Journal</em>, 13:\n3–22.",
                "Regoliosi, M. and Marsico, C. (eds), 2013. <em>La diffusione\neuropea del pensiero del Valla: atti del convegno del Comitato\nnazionale VI centenario della nascita di Lorenzo Valla, Prato,\n3–6 dicembre 2008</em>, 2 vols., Florence: Polistampa.",
                "Regoliosi, M. (ed.), 2010. <em>Lorenzo Valla: la riforma della\nlingua e della logica. Atti del convegno del Comitato Nazionale VI\ncentenario della nascita di Lorenzo Valla, Prato, 4–7 giugno\n2008</em>, 2 vols., Florence: Polistampa.",
                "–––, 2000. “Le <em>Elegantie</em> del\nValla come ‘grammatica’ antinormativa,” <em>Studi di\ngrammatica italiana</em>,w 19: 315–336.",
                "Rizzo, S., 2002. <em>Ricerche sul latino umanistico</em>, Rome:\nStudi di Storia e letteratura.",
                "––– (ed.), 1994. <em>Lorenzo Valla, Orazione per\nl’inaugurazione dell’anno accademico 1455–1456: Atti\ndi un seminario di filologia umanistica</em>, Rome: Roma nel\nRinascimento.",
                "Tavoni, M., 1984. <em>Latino, grammatica, volgare: Storia di una\nquestione umanistica</em>, Padua: Antenore.",
                "Trinkaus, C., 1970. <em>In Our Image and Likeness: Humanity and\nDivinity in Italian Humanist Thought</em>, 2 vols., Chicago:\nUniversity of Chicago Press.",
                "–––, 1988. “Italian Humanism and\nScholastic Theology,” in A. Rabil, Jr. (ed.), <em>Renaissance\nHumanism: Foundations, Forms and Legacy</em> (Volume 3), Philadelphia:\nUniversity of Pennsylvania Press, 327–348; repr. in Trinkaus\n1999.",
                "–––, 1993. “Lorenzo Valla’s\nAnti-Aristotelian Natural Philosophy,” <em>I Tatti Studies.\nEssays in the Renaissance</em>, 5: 279–325; repr. in C.\nTrinkaus, <em>Renaissance Transformation of Late Medieval\nThought</em>, Aldershot: Variorum, 1999.",
                "–––, 1996. “Lorenzo Valla on the Problem\nof Speaking about the Trinity,” <em>Journal of the History of\nIdeas</em>, 57: 27–53; repr. in C. Trinkaus, <em>Renaissance\nTransformation of Late Medieval Thought</em>, Aldershot: Variorum,\n1999.",
                "Vasoli, C., 1968. <em>La dialettica e la retorica\ndell’Umanesimo. Invenzione e metodo nella cultura del XV e XVI\nsecolo</em>, Milan: Feltrinelli.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"PriSouSelWorVal\">Primary Sources: Selected Works by Valla</a></h3>\n<p>\nThe 1962 reprint of Valla’s <em>Opera omnia</em>, contains his\nmost important writings. A new critical edition of his complete works\nwas launched in 2007: “Edizione Nazionale delle opere di Lorenzo\nValla” (Florence: Polistampa). Several volumes have now\nappeared.</p>\n<ul class=\"hanging\">\n<li><em>Opera omnia</em>, Basel 1540; repr. with a second volume,\nTurin: Bottega d’Erasmo, 1962.</li>\n<li><em>Repastinatio dialectice et philosophie</em>, G. Zippel (ed.),\n2 vols., Padua: Antenore, 1982. [vol. 1 contains the third version;\nvol. 2 the first.]</li>\n<li><em>Dialectical Disputations</em>, B. Copenhaver and L. Nauta (ed.\nand trans.), 2 vols. Cambridge, MA: Harvard University Press,\n2012.</li>\n<li><em>Elegantiae linguae Latinae</em>, S. López Moreda (ed.),\nCáceres: Universidad de Extremadura, 1999.</li>\n<li>“Dialogue on Free Will”, C. Trinkaus (trans.), in\n<em>The Renaissance Philosophy of Man</em>, E. Cassirer et al. (eds.),\nChicago: University of Chicago Press, 1948.</li>\n<li><em>De vero falsoque bono</em>, M. de Panizza Lorch (ed.), Bari,\n1970; A. K. Hieatt and M. Lorch (trans.), New York: Abaris Books\n1977.</li>\n<li><em>Collatio Novi Testamenti</em>, A. Perosa (ed.), Florence:\nSansoni, 1970.</li>\n<li>“In Praise of Saint Thomas Aquinas”, M. E. Hanley\n(trans.), in <em>Renaissance Philosophy</em>, L. A. Kennedy (ed.),\nMouton: The Hague, 1973.</li>\n<li><em>De falso credita et ementita Constantini donatione</em>, W.\nSetz (ed.), Weimar: Hermann Böhlaus Nachfolger, 1976; repr.\nLeipzig: Teubner, 1994; C. B. Coleman (trans.), Toronto: Toronto\nUniversity Press, 1993; G. W. Bowersock, Cambridge, Mass.: Harvard\nUniversity Press 2007.</li>\n<li><em>Epistole</em>, O. Besomi and M. Regoliosi (ed.), Padua:\nAntenore, 1984.</li>\n<li><em>Le Postille all’</em>Instituto oratoria <em>di\nQuintiliano</em>, L. Cesarini Martinelli and A. Perosa (ed.), Padua:\nAntenore, 1996.</li>\n<li><em>Correspondence</em>, Brendan Cook (ed. and trans. ),\nCambridge, MA: Harvard University Press, 2014.</li>\n</ul>\n<h3><a name=\"SelSecLit\">Selected Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Camporeale, S., 1972. <em>Lorenzo Valla: Umanesimo e\nteologia</em>, Florence: Nella sede dell’Istituto Palazzo\nStrozzi.</li>\n<li>–––, 2002. <em>Lorenzo Valla: Umanesimo,\nriforma, e Controriforma</em>, Rome: Edizioni di storia e\nletteratura.</li>\n<li>Celenza, C., 2005. “Lorenzo Valla and the Traditions and\nTransmissions of Philosophy,” <em>Journal of the History of\nIdeas</em>, 66: 483–506.</li>\n<li>Celenza, C., 2018. <em>The Intellectual World of the Italian\nRenaissance: Language, Philosophy, and the Search for Meaning</em>,\nCambridge: Cambridge University Press.</li>\n<li>Copenhaver, B. P., 2005. “Valla Our Contemporary: Philosophy\nand Philology,” <em>Journal of the History of Ideas</em>, 66:\n507–525.</li>\n<li>Copenhaver, B. P. and C. B. Schmitt, 1992. <em>Renaissance\nPhilosophy</em>, Oxford: Oxford University Press.</li>\n<li>Fois, M., 1969. <em>Il pensiero cristiano di Lorenzo Valla nel\nquadro storico-culturale del suo ambiente</em>, Rome: Libreria\neditrice dell’Univ. Gregoriana.</li>\n<li>Fubini, R., 1999. “Contributo per l’interpretazione\ndella <em>Dialectica</em> di Lorenzo Valla,” in G. F. Vescovini,\ned., <em>Filosofia e scienza classica, arabo-latina medievale e\nl’età moderna</em>, Louvain-la-Neuve:\nFédération Internationale des Instituts\nd’Études Médiévales, 289–316.</li>\n<li>Gavinelli, S., 1991. “Teorie grammaticali nelle\n<em>Elegantie</em> e la tradizione scolastica del tardo\numanesimo,” <em>Rinascimento</em>, 31: 155–181</li>\n<li>Gerl, H.-B., 1974. <em>Rhetorik als Philosophie. Lorenzo\nValla</em>, Munich: Fink.</li>\n<li>Gray, H., 1965. “Valla’s <em>Encomium of St. Thomas\nAquinas</em> and the Humanist Conception of Christian\nAntiquity,” in H. Bluhm (ed.), <em>Essays in History and\nLiterature presented by Fellows of the Newberry Library to Stanley\nPargellis</em>, Chicago: Newberry Library, 37–51.</li>\n<li>Izbicki, T. M., 1993. “Lorenzo Valla: The Scholarship in\nEnglish Through 1992,” in J. W. O’Malley et al. (eds.),\n<em>Humanity and Divinity in Renaissance and Reformation: Essays in\nHonor of Charles Trinkaus</em>, Leiden: Brill, 287–301.\n[Bibliography on Valla scholarship in English.]</li>\n<li>Jong, Jan de, 2015. “<em>De Sepulcro Laurentii Valae quid\nveri habeat</em>: Tracing the Tomb Monument of Lorenzo Valla in\nSt. John Lateran, Rome,” <em>Quellen und Forschungen aus\nitalienischen Archiven und Bibliotheken</em>, 94: 94–128.</li>\n<li>Kessler, E., 1988. “Die Transformation des aristotelischen\nOrganon durch Lorenzo Valla,” in E. Kessler et al. (eds.),\n<em>Aristotelismus und Renaissance. In memoriam Charles B.\nSchmitt</em>, Wiesbaden: Harrassowitz, 53–74.</li>\n<li>Kraye, J., 2001. “Lorenzo Valla and Changing Perceptions of\nRenaissance Humanism,” <em>Comparative Criticism</em>, 23:\n37–55.</li>\n<li>–––, 2004. “Pagan Virtue in Pursuit of\nChristian Happiness: Renaissance Humanists and the Revival of\nClassical Ethics,” in G. Althoff (ed.) <em>Zeichen –\nRituale – Werte: Internationales Kolloquium des\nSonderforschungsbereichs 496 an der Westfälischen\nWilhelms-Universität Münster</em>, Münster: Rhema,\n55–68.</li>\n<li>Laffranchi, M., 1999. <em>Dialettica e filosofia in Lorenzo\nValla</em>, Milan: Vita e Pensiero.</li>\n<li>Mack, P., 1993. <em>Renaissance Argument. Valla and Agricola in\nthe Traditions of Rhetoric and Dialectic</em>, Leiden: Brill.</li>\n<li>Mancini, G., 1891. <em>Vita di Lorenzo Valla</em>, Florence:\nSansoni.</li>\n<li>Marsico, C. 2013. <em>Per l’edizione delle Elegantie di\nLorenzo Valla: studio sul V libro</em>, Florence: Firenze University\nPress.</li>\n<li>Marsh, D., 1979. “Grammar, Method, and Polemic in Lorenzo\nValla’s <em>Elegantiae</em>,” <em>Rinascimento</em>, 19:\n91–116.</li>\n<li>Monfasani, J., 1989. “Was Lorenzo Valla an Ordinary Language\nPhilosopher?” <em>Journal of the History of Philosophy</em>, 50:\n309–323; repr. in J. Monfasani, <em>Language and Learning in\nRenaissance Italy. Selected Articles</em>, Aldershot: Variorum,\n1994.</li>\n<li>–––, 1990. “Lorenzo Valla and Rudolph\nAgricola,” <em>Journal of the History of Philosophy</em>, 28:\n181–200; repr. in J. Monfasani, <em>Language and Learning in\nRenaissance Italy. Selected Articles</em>, Aldershot: Variorum,\n1994.</li>\n<li>–––, 2000. “The Theology of Lorenzo\nValla,” in J. Kraye and M. W. F. Stone (eds.), <em>Humanism and\nEarly Modern Philosophy</em>, London: Routledge, 1–23; repr. in\nJ. Monfasani, <em>Greeks and Latins in Renaissance Italy. Studies on\nHumanism and Philosophy in the 15<sup>th</sup> Century</em>,\nAldershot: Variorum, 2004.</li>\n<li>–––, 2001. “Disputationes\nVallianae,” in F. Mariani Zini (ed.), <em>Penser entre les\nlignes: Philologie et Philosophie au Quattrocento</em>, Lille: Presses\nUniversitaires du Septentrion, 229–250; repr. in J. Monfasani,\n<em>Greeks and Latins in Renaissance Italy: Studies on Humanism and\nPhilosophy in the 15<sup>th</sup> Century</em>, Aldershot: Variorum,\n2004.</li>\n<li>Moss, A., 2003. <em>Renaissance Truth and the Latin Language\nTurn</em>, Oxford: Oxford University Press.</li>\n<li>Nauta, L., 2003. “William of Ockham and Lorenzo Valla: False\nFriends. Semantics and Ontological Reduction,” <em>Renaissance\nQuarterly</em>, 56: 613–651.</li>\n<li>–––, 2003. “Lorenzo Valla’s Critique\nof Aristotelian Psychology,” <em>Vivarium</em>, 41:\n120–143.</li>\n<li>–––, 2006. “Lorenzo Valla and Quattrocento\nScepticism,” <em>Vivarium</em>, 44: 375–395</li>\n<li>–––, 2007. “Lorenzo Valla and the Rise of\nHumanist Dialectic,” in J. Hankins (ed.), <em>The Cambridge\nCompanion to Renaissance Philosophy</em>, Cambridge: Cambridge\nUniversity Press, 193–210.</li>\n<li>–––, 2009. <em>In Defense of Common Sense.\nLorenzo Valla’s Humanist Critique of Scholastic Philosophy</em>,\nCambridge, Mass., Harvard University Press</li>\n<li>–––, 2018. “Latin as a Common Language:\nThe Coherence of Lorenzo Valla’s Humanist Program,”\n<em>Renaissance Quarterly</em>, 71: 1–32.</li>\n<li>–––, 2021. <em>Philosophy and the Language of\nthe People. The Claims of Common Speech from Petrarch to Locke</em>,\nCambridge: Cambridge University Press.</li>\n<li>Paganini, G., 2003. “Hobbes, Valla and the Trinity,”\n<em>British Journal for the History of Philosophy</em>, 11:\n183–218.</li>\n<li>Pagliaroli, S., 2006. “Una proposta per il giovane Valla:\n<em>Quintiliani Tulliique examen</em>,” <em>Studi medievali e\numanistici</em>, Volume 4, Messina : Centro interdipartimentale di\nstudi umanistici, Università degli studi di Messina.</li>\n<li>Panizza, L. A., 1978. “Lorenzo Valla’s <em>De vero\nfalsoque bono</em>, Lactantius and Oratorical Scepticism,”\n<em>Journal of the Warburg and Courtauld Institutes</em>, 41:\n76–107.</li>\n<li>Perreiah, A. R., 1982. “Humanist Critiques of Scholastic\nDialectic,” <em>Sixteenth-Century Journal</em>, 13:\n3–22.</li>\n<li>Regoliosi, M. and Marsico, C. (eds), 2013. <em>La diffusione\neuropea del pensiero del Valla: atti del convegno del Comitato\nnazionale VI centenario della nascita di Lorenzo Valla, Prato,\n3–6 dicembre 2008</em>, 2 vols., Florence: Polistampa.</li>\n<li>Regoliosi, M. (ed.), 2010. <em>Lorenzo Valla: la riforma della\nlingua e della logica. Atti del convegno del Comitato Nazionale VI\ncentenario della nascita di Lorenzo Valla, Prato, 4–7 giugno\n2008</em>, 2 vols., Florence: Polistampa.</li>\n<li>–––, 2000. “Le <em>Elegantie</em> del\nValla come ‘grammatica’ antinormativa,” <em>Studi di\ngrammatica italiana</em>,w 19: 315–336.</li>\n<li>Rizzo, S., 2002. <em>Ricerche sul latino umanistico</em>, Rome:\nStudi di Storia e letteratura.</li>\n<li>––– (ed.), 1994. <em>Lorenzo Valla, Orazione per\nl’inaugurazione dell’anno accademico 1455–1456: Atti\ndi un seminario di filologia umanistica</em>, Rome: Roma nel\nRinascimento.</li>\n<li>Tavoni, M., 1984. <em>Latino, grammatica, volgare: Storia di una\nquestione umanistica</em>, Padua: Antenore.</li>\n<li>Trinkaus, C., 1970. <em>In Our Image and Likeness: Humanity and\nDivinity in Italian Humanist Thought</em>, 2 vols., Chicago:\nUniversity of Chicago Press.</li>\n<li>–––, 1988. “Italian Humanism and\nScholastic Theology,” in A. Rabil, Jr. (ed.), <em>Renaissance\nHumanism: Foundations, Forms and Legacy</em> (Volume 3), Philadelphia:\nUniversity of Pennsylvania Press, 327–348; repr. in Trinkaus\n1999.</li>\n<li>–––, 1993. “Lorenzo Valla’s\nAnti-Aristotelian Natural Philosophy,” <em>I Tatti Studies.\nEssays in the Renaissance</em>, 5: 279–325; repr. in C.\nTrinkaus, <em>Renaissance Transformation of Late Medieval\nThought</em>, Aldershot: Variorum, 1999.</li>\n<li>–––, 1996. “Lorenzo Valla on the Problem\nof Speaking about the Trinity,” <em>Journal of the History of\nIdeas</em>, 57: 27–53; repr. in C. Trinkaus, <em>Renaissance\nTransformation of Late Medieval Thought</em>, Aldershot: Variorum,\n1999.</li>\n<li>Vasoli, C., 1968. <em>La dialettica e la retorica\ndell’Umanesimo. Invenzione e metodo nella cultura del XV e XVI\nsecolo</em>, Milan: Feltrinelli.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aristotle, General Topics: ethics",
            "Erasmus, Desiderius",
            "free will",
            "hedonism",
            "providence, divine",
            "sophismata [= sophisms]",
            "Sorites paradox",
            "square of opposition",
            "Stoicism",
            "syllogism: medieval theories of"
        ],
        "entry_link": [
            {
                "../aristotle-ethics/": "Aristotle, General Topics: ethics"
            },
            {
                "../erasmus/": "Erasmus, Desiderius"
            },
            {
                "../freewill/": "free will"
            },
            {
                "../hedonism/": "hedonism"
            },
            {
                "../providence-divine/": "providence, divine"
            },
            {
                "../sophismata/": "sophismata [= sophisms]"
            },
            {
                "../sorites-paradox/": "Sorites paradox"
            },
            {
                "../square/": "square of opposition"
            },
            {
                "../stoicism/": "Stoicism"
            },
            {
                "../medieval-syllogism/": "syllogism: medieval theories of"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=lorenzo-valla\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/lorenzo-valla/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=lorenzo-valla&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/lorenzo-valla/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=lorenzo-valla": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/lorenzo-valla/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=lorenzo-valla&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/lorenzo-valla/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://history.hanover.edu/texts/vallatc.html\" target=\"other\"><em>Discourse on the Forgery of the Alleged Donation of Constantine</em></a>,\n in Latin and English (English translation by Christopher B.\nColeman).",
            "<a href=\"http://penelope.uchicago.edu/Thayer/E/Gazetteer/Places/Europe/Italy/Lazio/Roma/Rome/churches/Lateran/interior/Lorenzo_Valla.html\" target=\"other\">The Tomb of Lorenzo Valla</a>,\n photograph of Valla’s tomb at St. John Lateran, Rome."
        ],
        "listed_links": [
            {
                "http://history.hanover.edu/texts/vallatc.html": "Discourse on the Forgery of the Alleged Donation of Constantine"
            },
            {
                "http://penelope.uchicago.edu/Thayer/E/Gazetteer/Places/Europe/Italy/Lazio/Roma/Rome/churches/Lateran/interior/Lorenzo_Valla.html": "The Tomb of Lorenzo Valla"
            }
        ]
    }
}