{
    "url": "madhyamaka",
    "title": "Madhyamaka",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Richard Hayes\n<rhayes@unm.edu>",
        "author_links": [
            {
                "http://www.unm.edu/~rhayes": "Richard Hayes"
            },
            {
                "mailto:rhayes%40unm%2eedu": "rhayes@unm.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\n<a href=\"http://www.unm.edu/~rhayes\" target=\"other\">Richard Hayes</a>\n&lt;<a href=\"mailto:rhayes%40unm%2eedu\"><em>rhayes<abbr title=\" at \">@</abbr>unm<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Sat Nov 6, 2010",
        "substantive revision Fri Aug 18, 2023"
    ],
    "preamble": "\n\nThe Madhyamaka school of Buddhism, the followers of which are called\nMādhyamikas, was one of the two principal schools of\nMahāyāna Buddhism in India, the other school being the\nYogācāra. The name of the school is a reference to the claim\nmade of Buddhism in general that it is a middle path\n(madhyamā pratipad) that avoids the two extremes of\neternalism—the doctrine that all things exist because of an\neternal essence—and annihilationism—the doctrine that\nthings have essences while they exist but that these essences are\nannihilated just when the things themselves go out of existence. The\nconviction of the Madhyamaka school, which can be called the Centrist\nschool in English, is that this middle path is best achieved by a\ndenial that things have any inherent natures at all. All things are,\nin other words, empty of inherent natures. This doctrine of universal\nemptiness of inherent natures\n(svabhāva-śūnyatā) is the hallmark of the\nschool, which places the school solidly in the tradition associated\nwith the Perfection of Wisdom\n(prajñāpāramitā) literature of\nMahāyāna Buddhism.\n\nThe key texts of the school comprised commentaries to the writings of\nNāgārjuna—the works of Nāgārjuna most often\ncommented upon are the Mūla-madhyamaka-kārikā\n(MMK) and Vigraha-vyāvartanī (VV)—and a\nnumber of independent works that expanded on ideas found in\nNāgārjuna’s writings. A few of the Sanskrit treatises\nof the early Madhyamaka school were translated into Chinese and became\nthe basis of a short-lived school of Chinese Buddhism. A significant\nnumber of Sanskrit Madhyamaka texts were eventually translated into\nTibetan and exerted considerable influence on the intellectual\nheritage of Tibetan Buddhism. This article will deal only with the\nMadhyamaka school in India from the fifth through the eighth\ncenturies, during which time the school underwent most of its\nevolution.\n",
    "toc": [
        {
            "#IssuMadhScho": "1. Issues in the Madhyamaka school"
        },
        {
            "#AaryFlCa225250CE": "2. Āryadeva (fl. ca. 225–250 C.E.)"
        },
        {
            "#Budd": "3. Buddhapālita"
        },
        {
            "#Bhaa": "4. Bhāvaviveka"
        },
        {
            "#LifeWork": "4.1 Life and works"
        },
        {
            "#Cont": "4.2 Contributions"
        },
        {
            "#Cand": "5. Candrakīrti"
        },
        {
            "#Saan": "6. Śāntideva"
        },
        {
            "#CandContLifeWork": "6.1 Life and works"
        },
        {
            "#CandCont": "6.2 Contributions"
        },
        {
            "#Jnaa": "7. Jñānagarbha"
        },
        {
            "#JnnaLifeWork": "7.1 Life and works"
        },
        {
            "#JnnaCont": "7.2 Contributions"
        },
        {
            "#Sant": "8. Śāntarakṣita"
        },
        {
            "#SantLifeWork": "8.1 Life and works"
        },
        {
            "#SantCont": "8.2 contributions"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Issues in the Madhyamaka school\n\nThere a number of points that all Mādhyamika thinkers have in\ncommon. In all of them one finds some version of the doctrine of two\ntruths, according to which there is a level of understanding that\nconsists of an accurate account of the world as it is experienced in\neveryday life and another level of understanding that is conducive to\nreaching the ultimate goal (paramārtha) of Buddhist\npractice, namely, nirvana, understood as the absence of attachment,\naversion and delusion with no possibility of their return. There is\nalso broad agreement that language is limited to the everyday level of\nunderstanding and that the truth of nirvana is beyond the reach of\nlanguage and of the conceptualization that makes language\npossible.\n\nWhere differences arise among Mādhyamika thinkers is on the issue\nof how these two truths relate to one another. Does careful\nverbalization and thinking do any good in bringing one closer to\nnirvana, or is it invariably an obstacle? Is there any room within\nMadhyamaka for clear thinking and carefully wrought argumentation, or\nare all attempts to arrive at clear thought and rigorous argumentation\nultimately delusional and therefore to be abandoned along with more\nobvious forms of delusion?\n\nAnother area in which Mādhyamakas differ from one another is in\ntheir attitude toward the other main school of Mahāyāna\nBuddhism, the Yogācāra school, which Mādhyamikas\npresent as advocating a kind of subjective idealism. Early\nMādhyamikas tended to refute the Yogācāra doctrine that\nall the contents within awareness arise out of awareness itself and\nare thus ontologically at one with consciousness. Later\nMādhyamikas found room for that view, usually by portraying\nYogācāra as a philosophy that prepares one intellectually\nand emotionally for the difficult truth that all things are lacking in\ninherent natures and all that we think of as knowledge is ultimately\nwithout grounding.\n2. Āryadeva (fl. ca. 225–250 C.E.)\n\nAccording to traditional accounts preserved in Tibetan and Chinese,\nĀryadeva was born into the royal family in what is now Sri Lanka,\nrenounced his claim to the throne, took monastic vows, studied the\nBuddhist scriptures for several years, and travelled to south India.\nHe reportedly became a direct disciple of Nāgārjuna. His\nprincipal writing, the Catuḥśatakaśāstra\n(Four Hundred Verse Treatise), was regarded as a Madhayamaka text and\nwas commented on by Candrakīrti and by prominent Tibetan\nproponents of the Madhyamaka school.\n\nThe first hundred verses of the Four Hundred Verse Treatise deal with\nfour illusions that must be dispelled by someone striving to achieve\nliberation from the root causes of dissatisfaction. The four illusions\nare the beliefs that there are permanent things in the world that\nescape destruction, that impermanent things can provide true\nsatisfaction, that satisfaction can be derived from intrinsically\nimpure things, and that satisfaction can be attained by being\npreoccupied with oneself. These are standard themes in Buddhist\nwritings. The second set of one hundred verses also deal with standard\nBuddhist themes, namely, cultivating altruistic motivations, ridding\nthe mind of the afflictions of desire, anger, and delusion, and\ndeveloping habits of ethical conduct. While the first half of the\ntreatise is essentially inspirational in nature, the second half\nprovides arguments meant to prove that all things are conditioned and\ntherefore impermanent, that nothing qualifies as an independent and\nenduring self, and that there are no uncaused causes. Most of the\nverses dealing with these topics are polemical in nature and are aimed\nat refuting the doctrines of Brahmanical schools, Jainism and some of\nthe Buddhist scholastics. As is the case with other Mādhyamikas,\nĀryadeva focuses most of his attention on showing the\nincomprehensibility or absurdity of the doctrines under review. His\nmotivation for doing this is suggested in 8.10 (the tenth verse in the\neighth set of twenty-five), where he says attachment to one’s\nown views and disparaging the views of others is an obstacle to\nnirvana, and tranquillity is impossible for those who engage in\ndoctrinal disputes. His exercise in showing the untenability of\nvarious positions, then, is presumably done not for the sake of\nrefuting others in order to establish his own position, but to help\nhis readers break the habit of firmly holding tenets.\n\nAn example of Āryadeva’s demonstrating an inconsistency in\na particular position is his critique of the view that there is a\npermanent self. He observes that since a permanent self could not\nundergo change, it could not be harmed or destroyed, and therefore it\nis inconsistent for those who believe in such a self to promote\nethical guidelines against killing or harming others. While\nĀryadeva endeavors in some chapters to show the inconsistencies\nin a number of particular doctrines of the Sāṃkhya and\nVaiśeṣika schools, in the fourteenth chapter he provides a\nparadigm of an argument that can be applied to any number of doctrinal\npositions. That paradigm, which is familiar to readers of\nNāgārjuna and other Mādhyamikas, consists in showing\nthat there is a problem in attributing a given predicate to a subject,\nand in attributing the negation of that predicate, and in attributing\nboth the predicate and its negation, and in attributing neither the\npredicate nor its negation. For example, he argues that one cannot say\nthat a pot is single, for it has many characteristics, such as color,\nshape, hardness, odor and so forth. It also cannot be said that the\npot is many pots, because none of the individual characteristics is a\npot. It cannot be said that the pot is a single whole with many\ncharacteristics, because some of its components are material and\ntherefore capable of contact and location, while others, such as color\nand odor, are immaterial and have no location; it makes no sense to\nsay that characteristics that have contrary natures form a coherent\nwhole. And yet to deny that a pot is either one or many is to deny\nthat it exists at all, for an existent thing must have either a\nproperty or the absence of that property. Āryadeva’s\nstatements of these arguments in verse is laconic and often difficult\nto follow; therefore, most readers who study his text do so with the\nhelp of one of the many commentaries written by later Sanskrit or\nTibetan authors. \n3. Buddhapālita\n\nAside from a commentary entitled Akutobhaya (Afraid of\nnothing), which is traditionally ascribed to Nāgārjuna but\nthe authorship of which is questioned by modern scholars, the earliest\nextant commentary to Nāgārjuna’s MMK is the\nMadhyamakavṛtti by Buddhapālita (ca 470–ca\n540). The original Sanskit of this text is not known to exist, but it\nis still extant in Tibetan translation. Buddhapālita’s\ncommentary, like Akutobhaya stays close to the text upon\nwhich it is a commentary. The MMK is written in verse, and\nBuddhapālita’s commentary places the words of the verse\ntext into standard prose word order and offers glosses to disambiguate\npotentially confusing words. Like the MMK itself,\nBuddhapālita’s commentary does not offer a positive\nposition but rather shows the untenability of all the apparently\npossible solutions to the philosophical questions taken up for\nexamination. The principal method of examining a position in MMK and\nin Buddhapālita’s commentary is to show that unwelcome\nconsequences are entailed by the position under consideration.\n\nAn example of the approach used by Nāgārjuna and\nBuddhapālita is their discussion of the relation between a cause\nand its effect, the topic taken up in MMK 1.1. There are only four\npossible relationships: the cause is the same as the effect, the cause\nis different from the effect, the cause is both the same as and\ndifferent from the effect, or the cause is neither the same as nor\ndifferent from the effect. This fourth position would be tantamount to\nsaying that there is no cause, and that an effect therefore arises out\nof nothing at all. Each of these four possibilities is rejected in\nturn, each for a different reason. Buddhapālita argues that if an\neffect were identical to its cause, then it would already exist as the\ncause and would have no need of coming into being a second time.\nIdentity of cause and effect defeats the very idea of causality. If\nthe effect were different from the cause, on the other hand, then\nthere would be no constraints on what could arise out of what, so long\nas the cause and the effect were different. The third possibility is\nuntenable, says Buddhapālita, since it is merely the conjunction\nof the two hypotheses that have just been shown to be untenable. A\nproposition consisting of the conjunction of two false propositions\ncannot be true. The fourth possibility, like the first, undermines the\nvery idea of causality. Moreover, says Buddhapālita, it would\nrender all practice ineffectual; what he probably had in mind here was\nspecifically Buddhist religious practice, which is predicated on\nidentifying the root causes of dissatisfaction and then eliminating\nthose root causes so that dissatisfaction disappears.\n\nBeyond showing the untenability of each of the relations that were\ndiscussed as possible relations between the relata in a particular\nsituation, Nāgārjuna and Buddhapālita have little to\nsay. Opponents to the Madhyamaka school were critical of this\napproach, saying in effect that there is little value in finding fault\nwith a philosophical view unless one is prepared to offer a better\nview to replace the faulty one. As will become more clear in what\nfollows, it was precisely this issue—that is, whether there is a\nvalue in simply finding faults in philosophical views—that\nbecame controversial among Mādhyamikas.\n4. Bhāvaviveka\n\nThe strongest challenge to the commentarial tradition of\nBuddhapālita came from Bhāvaviveka, whose approach to\nMadhyamaka became the basis of what Tibetan Buddhists would many\ncenturies after the fact consider a subschool of Madhyamaka that\nrivallled the subschool comprising those who followed\nBuddhapālita.\n4.1 Life and works\n\nBhāvaviveka, who was also known as Bhavya and Bhāviveka, was\nprobably active in the middle part of the sixth century. His\ncommentary on MMK, entitled Prajñāpradīpa\n(Lamp of Wisdom), now extant only in Chinese and Tibetan translations,\ncontains not only his interpretation of Nāgārjuna’s\nthoughts but also critiques of Buddhapālita’s approach to\nMadhyamaka, about which more will be said below, and critiques of the\nBuddhist abhidharma tradition. Prajñāpradīpa\nalso incorporates critiques of such non-Buddhist schools as\nSāṃkhya, Vaiśeṣika and the Jains.\n\nIn addition to his commentary to MMK, Bhāvaviveka wrote an\nimportant independent verse treatise on Madhyamaka entitled\nMadhyamakahṛdayakārikā (Verses on the Heart\nof Centrism) to which he provided a prose commentary called\nTarkajvālā (Flame of Reasoning). This combination\nof works comprises eleven chapters.\n\nOn cultivating and maintaining bodhicitta, that is, the\naspiration to become enlightened in order to work for the benefit and\nultimate liberation of all sentient beings\nFollowing the Buddhist vows\nStriving for a knowledge of reality\nReality as understood by the conservative canonical Buddhists\n(Śrāvakas)\nReality as understood by the Yogācāra school of\nBuddhism\nReality as understood by the Sāṃkhya school\nReality as understood by the Vaiśeṣika school\nReality as understood by the Vedānta schools\nReality as understood by the Mīmāṃsā\nschool\nThe realization of omniscience\nOn the characteristics of praise\n\n\nAs the titles of the chapters of this work show, Bhāvaviveka was\na student of most of the important movements in Indian philosophy of\nhis era and sought to stake out the place of the Madhyamaka school\nwithin Buddhism as a whole. His understanding of Madhyamaka was\nimportantly different from Buddhapālita’s. Their different\napproaches turned out to define two of the three important sub-schools\nof Madhyamaka.\n4.2 Contributions\n\nA distinguishing characteristic of Bhāvaviveka’s approach\nto Madhyamaka is his conviction that a Mādhyamika should put\nforward a positive argument for a position rather than merely showing\nthe inadequacies of other positions. His criticism of\nBuddhapālita was focused primarily on that very point;\nBuddhapālita offered no statement of what the Mādhyamikas\nbelieve but confined himself to pointing out that what other people\nbelieve is untenable in one way or another. To criticize the positions\nof others but not to venture to state a position of one’s own\nwas regarded by the Indian debate tradition as a substandard use of\nargumentation called vitaṇḍā, which\nliterally means making an attack. Bhāvaviveka was at pains to\nshow that Mādhyamikas could not legitimately be accused of this\nsort of philosophical sniping. He affirmed that Mādhyamikas do\nhave a conviction that they are prepared to state and defend, namely,\nthat all phenomena are devoid of an inherent nature, that is, a nature\nthat they have independently. All phenomena are conditioned, and such\nnatures as they have are natures that they acquire through their\nconditions rather than on their own. The concise Madhyamaka way of\nsaying all this is to say that all phenomena (dharmas) are\nempty (śūnya). Since the Mādhyamikas believe\nthat all phenomena are empty, they owe it to their readers to provide\nreasons for thinking that that is a reasonable thing to believe.\n\nIn providing arguments in favor of the conclusions accepted by\nMādhyamikas, Bhāvaviveka followed the example set by\nDignāga (fl. ca. 510), a Buddhist whose principal contributions\nwere in the area of epistemology and logic. Dignāga, following\nwith some modifications philosophers of the Brahmanical Nyāya\nschool, had devised a canonical form of presenting arguments, which\nconsisted in identifying a topic (pakṣa) and reasoning\non the basis of an observed feature of the topic that it also had\nanother feature not currently available for direct observation. The\nstock example given in Indian logic is that if a particular mountain\nis the topic, one can reason on the basis of observing smoke\nassociated with that mountain that there is also a fire associated\nwith that mountain. Attributing an unobserved feature to a topic on\nthe basis of an observed feature is legitimate only if one has\npreviously observed the feature used as evidence together with the\nfeature being inferred, and if one has never seen the feature used as\nevidence in the absence of the feature being inferred.\nDignāga’s method of presenting an argument consists, then,\nin stating a topic (pakṣa) and a property used as\nevidence (sādhaka-dharma) for a property to be\nestablished (sādhya-dharma). Bhāvaviveka followed\nthis method in arguing for the conclusions of which he claimed\nMādhyamikas are convinced; he also criticized Buddhapālita\nfor failing to follow Dignāga’s method.\n\nIn his discussion of MMK 1.1, Bhāvaviveka makes the general\nobservation that when Nāgārjuna negates a proposition, he is\nnegating the entire proposition rather than negating just the\npredicate. If one negates just a predicate, that leaves open the\npossibility that some other predicate can suitably be applied to the\nsubject in question. Negation of a predicate in a proposition\npresupposes the existence of the subject of the proposition, whereas\nnegation of the entire proposition need not rest on such a\npresupposition. So when Nāgārjuna says that a phenomenon\ndoes not arise from itself, one should understand that to be a way of\nsaying “It is not the case that a phenomenon arises from\nitself.” If one were to construe Nāgārjuna’s\nstatement as equivalent to something like “The arising of a\nphenomenon is not from the phenomenon itself,” then one would\nnaturally take that to be saying that the arising of a phenomenon is\nfrom something other than itself. Alternatively, one might take it to\nbe saying that the arising of a phenomenon is not only from\nitself but rather from something that is partly itself and partly\nsomething other than itself. If one takes Nāgārjuna’s\nproposition to be a series of conjoined propositions of the form\n“It is not the case that a phenomenon arises from itself\nand it is not the case that a phenomenon arises from\nsomething other than itself, and it is not the case that a\nphenomenon arises from itself in cooperation with something other than\nitself, and it is not the case that a phenomenon arises from\nnothing at all,” then there is no paradox involved in negating\nboth a simple proposition and its contradiction. It is therefore\nimportant to make it clear when Nāgārjuna’s negations\nare sentential negations and when they are term-negations, and this\nBuddhapālita failed to do.\n\nBhāvaviveka goes on to explain that Nāgārjuna employed\nsentential negations in MMK 1.1, because he was trying to establish a\nkind of “non-conceptual cognition,” that is, an insight\nthat cannot be expressed in words. The scope of this non-conceptual\ninsight is everything that is capable of being cognized. In other\nwords, Nāgārjuna’s insight was that everything that\none thinks one knows, every explanation one thinks one has to account\nfor one’s experiences, is flawed and must ultimately be\nabandoned. In saying this, Bhāvaviveka is consistent with a\nnumber of important statements in MMK and VV. Nāgārjuna had\nlaid emphasis on the claim that the Buddha had dealt out two kinds of\ntruth, a quotidian transactional or conventional truth\n(vyavahāra-satya, saṃvṛti-satya) and a truth\nconcerning the highest goal (paramārtha-satya), namely,\nnirvana. Of these, only the transactional truth is capable of being\narticulated in language. The highest goal, consisting of a silence of\nthe mind in which there is no conceptual thinking, is naturally\ninexpressible in language, since language is necessarily bound up with\nconcepts. Some form of this view was shared by all Mādhyamikas.\nWhere they differed with one another was on the issue of how the\nteachings of Buddhism, which are communicated in language, relate to\nthe highest goal of Buddhism, which lies outside the scope of\nlanguage.\n\nNāgārjuna wrote in MMK 18.9 that the defining\ncharacteristics of reality (tattva, literally,\n“thatness” or quiddity) are that it is not conditioned by\nsomething other than itself, it is peaceful, it cannot be elaborated\nthrough verbal elaborations, it is non-conceptual, and it is uniform.\nIn his commentary to that verse, Bhāvaviveka expands the meaning\nof the verse by saying that anything that is not conceptual in nature\ncannot be expressed through verbal elaborations or through any other\nkind of sign. In other words, what is non-conceptual in nature cannot\nbe known indirectly, and knowledge gained through language is always\nmediated and indirect. For this reason, reality is entirely outside\nthe range of language. That notwithstanding, says Bhāvaviveka,\nwhat language can do is convey something about the general\nnature of what is talked about. The statement that phenomena are\nlacking in inherent natures, for example, does convey useful general\ninformation about reality. Even though reality itself can be known\nonly directly through a non-conceptual awareness, language can be\nhelpful in conveying that very information, namely, that reality can\nbe apprehended only directly and not through language. That the\nMādhyamika has, and defends, the view that reality lacks inherent\nnature means that the Mādhyamika is not merely engaging in\nphilosophical sniping of the vitaṇḍā\nvariety.\n\nIn his Tarkajvālā, in which Bhāvaviveka is\nfreed from the constraints of following Nāgārjuna’s\ntexts and puts forward his own approach to Madhyamaka, he states that\nthe term “highest goal” (paramārtha-satya)\nhas two aspects. One aspect is that it is free from volitional\nthought, pure and beyond the reach of verbal elaborations. Another\naspect is that it is volitional in nature, connected with the\naccumulation of knowledge and meritorious karma, and connected with\nverbal elaborations and with the transactional knowledge of everyday\nlife. By seeing the ultimate goal in this way, Bhāvaviveka claims\nto give an account that leaves reality intact as a uniform whole about\nwhich knowledge can be diverse and incremental. This incremental\nnature of knowledge makes ample room for the traditional\nMahāyāna teachings of the gradated bodhisattva path whereby\none moves from the aspiration for enlightenment to the gradual\nrealization of enlightenment. A metaphor that Bhāvaviveka uses\nfor the Buddhist path is that it follows verbal teachings which are\nlike a ladder that one slowly ascends until one can climb over the\nwall into non-conceptual direct awareness of the peaceful reality of\nnirvana in which there is nothing to be wished for, nothing to be\nunderstood and no hypothesis to be defended.\n5. Candrakīrti\n5.1 Life and works\n\nAs is usual for the majority of Indian philosophers, very little is\nknown about the life of Candrakīrti. Modern scholars place him at\nthe beginning of the seventh century. His two best-known works are his\ncommentary to MMK entitled Prasannapadā\nMadhyamakavṛtti (Clear-worded Commentary on Centrism),\nwhich survives in Sanskrit as well as in Tibetan translation, and an\nindependent treatise called Madhyamakāvatāra\n(Introduction to Centrism) available only in Tibetan translation.\nMadhyamakāvatāra is a verse text to which\nCandrakīrti provided a prose commentary. It is clearly an earlier\nwork than his commentary to MMK, since in that commentary he refers\nthe reader repeatedly to Madhyamakāvatāra for the\nfull arguments for the positions he endorses. Both\nPrasannapadā and Madhyamakāvatāra\nhave been studied by modern scholars and a significant number of\npassages have been translated into modern European languages. In\naddition to those works, Candrakīrti wrote a number of\ncommentaries to relatively short texts by Nāgārjuna and\nĀryadeva.\n5.2 Contributions\n\nAt the beginning of his commentary to MMK, Candrakīrti offers an\nextended criticism of Bhāvaviveka and a defense of\nBuddhapālita against the criticisms of Bhāvaviveka. Many\ncenturies after he wrote, Buddhist scholastics in Tibet portrayed\nCandrakīrti as the founder of one of the subschools of the\nMadhyamaka that they perceived. Because Bhāvaviveka had advocated\nfor producing independent (svatantra) arguments for the view\nthat all phenomena are empty of inherent natures, the Tibetan\nscholastics dubbed his subschool the Svātantrika school; because\nCandrakīrti criticized that approach and advocated for being\ncontent to show the unwelcome consequences (prasaṅga)\nof all possible positions on any given philosophical issue, his\nsubschool was named by Tibetans the Prāsaṅgika school of\nMadhyamaka. Although those terms were not used by Indian\nMādhyamikas themselves, it has become standard practice in modern\nscholarship to portray the Madhyamaka school as comprising at least\ntwo subschools with those names and to see Bhāvaviveka and\nCandrakīrti as the founders of those two subschools.\n\nThe earlier of Candrakīrti’s two principal works,\nMadhyamakāvatāra, has ten chapters, one for each of\nthe ten stages of the path of the bodhisattva. At each of these stages\nthe bodhisattva focuses attention on one of the virtues that are to be\nbrought to a stage of perfection (pāramitā). The\nvirtues to be perfected are generosity; good habits of thought, word\nand deed; patience; courage; meditation; wisdom; proselytizing skill;\napplication of vows; strength of character; and transcendental\nknowledge. The chapter dedicated to the sixth stage, at which wisdom\nis cultivated to perfection, is the chapter in which Candrakīrti\nlays out his most detailed exposition of the Madhyamaka school of\nphilosophy. Candrakīrti begins this chapter with the claim that\nwisdom is like a sighted person who is capable of leading a group of\nblind people safely to a destination; similarly, wisdom guides all the\nother virtues to their destination of perfection. As for the content\nof wisdom, it is the realization that no phenomena come into being.\nPhenomena cannot arise from themselves, since that possibility would\nmake arising unnecessary or redundant; if a thing already exists, it\nhas no need to come into being. If, on the other hand, it were allowed\nthat one being might rise out of a being other than itself, then there\nwould be nothing to prevent one from saying that pitch darkness arises\nout of light. Another way of looking at the issue of production from\ncauses is that the effect either already exists in the cause or it\ndoes not exist. If it already exists, it has no need or coming into\nbeing. If it does not exist, then it cannot be an agent that does the\naction of coming into being; but if there is no agent, then there is\nno action.\n\nAfter showing that there cannot be any intelligible account of the\narising of phenomena, Candrakīrti acknowledges that in everyday\nexperience we encounter phenomena coming into being all the time. This\nleads to a discussion of the two truths. The ultimate truth—that\nis, truth concerning the highest goal—is that phenomena do not\ncome into being; the conventional transactional truth, on the other\nhand, is that things do come into being and that their arising is\nconditioned. This conventional truth can therefore be understood as a\nkind of screen, an obstacle that stands in the way of seeing the\nultimate truth. In other words, the putative truths of quotidian life\nare actually delusions that, if believed, prevent one from attaining\nthe wisdom that is capable of leading to the imperturbable peace of\nnirvana. The truth of the highest goal cannot be conveyed in language;\nit can only be manifested in silence. That notwithstanding, the Buddha\ngave many teachings in words, so how is one to understand that? The\nBuddha, said Candrakīrti, spoke according to the linguistic\nconventions of the people to whom he talked. It is conventional to use\npronouns such as “I” and “you” and words like\n“self”; without such pronouns, grammatically correct\nsentences cannot be formed. It does not follow from grammatical\ncorrectness, however, that those words used in sentences have\nreferents. The Buddha’s insight was that there is no self, and\nyet he used the sort of conventional language that is commonly used by\nthose who do believe that there is a self. Similarly, even though the\nBuddha realized that there are no phenomena coming into being and\nperishing, he spoke the same kinds of sentences used by those who\nbelieve that phenomena come into being through conditions and then\nperish when the conditions that sustain them are no longer operative.\nIf one is going to use language at all, then one cannot avoid using\nwords and constructions that apparently commit one to accepting the\npresuppositions upon which language rests. It is the task of the\nMādhyamika philosopher to expose those presuppositions as\nuntenable, to see that language is not grounded in realities but is\npurely conventional in nature. The Buddha, knowing what kinds of\nbeliefs his listeners had, gave doctrines that helped people get past\ntheir false beliefs. For example, to those who believed in an enduring\nand unified and essentially independent self, says Candrakīrti,\nthe Buddha taught that the self is not to be found in any of the\naspects of being human that might be a candidate for being regarded as\na self; he taught that the self is not the body, the personality,\nawareness, thoughts or feelings or anything else that arises through\ncauses and conditions, nor is there anything outside those things that\ncounts as a candidate for what people intuitively take to be their\nselves. To people who were inclined to a materialistic monism, the\nBuddha emphasized the importance of the mind as something that is\nindependent of the body. (About this, more will be said below.)\n\nAs was discussed above\n (section 4.2),\n Bhāvaviveka criticized Buddhapālita for failing to state\nand defend the thesis of the Mādhyamikas. In the first chapter of\nhis commentary to MMK, Candrakīrti comes to\nBuddhapālita’s defense and offers a sustained criticism of\nBhāvaviveka, and of the tradition of Dignāga on whom\nBhāvaviveka had based much of his approach.\nBhāvaviveka’s call for an independent argument in favor of\na conclusion accepted by Mādhyamikas, says Candrakīrti, is\ndiametrically opposed to what Nāgārjuna and Āryadeva\nhad written. Nāgārjuna had written in VV that he has no\nthesis to advance. He had also written that he apprehends no objects\nat all and therefore has no need to affirm or deny anything, and since\nhe neither affirms nor denies any proposition, he need not supply any\nreasons to justify his stance. And Āryadeva had written that a\nperson who makes no claims, either that anything exists or that\nsomething does not exist, cannot be refuted. Candrakīrti cites\nthose passages with the additional comment that Buddhapālita had\nunderstood the spirit of Madhyamaka as set forth by those early\nMādhyamikas. The Mādhyamika, Candrakīrti goes on to\nexplain, does not put forward counter positions in opposition to the\nclaims of other philosophers; rather, he shows the problems involved\nin the positions of others and argues only until the other\nphilosophers realize the inadequacy of their positions and become\nsilent. In the process of bringing others to silence, the\nMādhyamika need not construct formal arguments, nor need he be\nconsistent in what he says. Following Āryadeva’s\nobservation, Candrakīrti says that the Mādhyamika cannot be\nrefuted, precisely because he has no position to defend. If\nBuddhapālita had put forth arguments, then he would have opened\nhimself up to endless disputation; since, however, he knew that the\npurpose of Madhyamaka is to bring all disputation, and indeed all\nkinds of idle chatter, to an end, he wisely avoided putting forth\nformal arguments that a persistent opponent might take as an\ninvitation to debate. If Bhāvaviveka had understood the point of\nMadhyamaka, concludes Candrakīrti, he would not have made the\ncriticisms he made of Buddhapālita.\n\nAfter offering his criticisms of Bhāvaviveka, Candrakīrti\naddresses the school of Buddhist logic and epistemology founded by\nDignāga. The followers of this school did not present themselves\nas Mādhyamikas, so Candrakīrti does not accuse them of\nhaving failed to understand Nāgārjuna properly. He does,\nhowever, confront them with having failed to supply a convincing\nresponse to the radical critique Nāgārjuna had made of the\nvery enterprise of grounding convictions on indisputable foundations.\nHe recapitulates a passage of Nāgārjuna’s VV in which\nit is said that any proposition that is supposed to be warranted must\nrest upon a foundation of either direct experience or one of three\nkinds of reasoning. But the very claim that a proposition is warranted\nby a foundation is itself a proposition, and as such it must either\nrequire a warrant of its own or be deemed self-validating. If it\nrequires a warrant of its own, the result will be an infinite regress\nof propositions needing warrants; if it is declared self-validating,\nthen why not say of all propositions they are self-validating?\nDignāga and his followers went ahead and talked about the\ngrounding of propositions as if Nāgārjuna had never\nquestioned the enterprise. Unless they provide a clear and convincing\nresponse to what Nāgārjuna said, there is no reason for\nanyone to take them seriously.\n\nOne further Buddhist movement that Candrakīrti criticizes is the\nYogācāra school, which he presents as advocating a form of\nsubjective idealism. Their claim that the world of experience is\nconsciousness only and that the contents of consciousness cannot be\nobjects external to consciousness itself is supported by several texts\nwithin the Mahāyāna scriptural tradition. Candrakīrti\nexplains these scriptures as examples of teachings that the Buddha\ngave to counter a particular kind of commonly held wrong view. There\nare, says Candrakīrti, those who mistakenly believe that all\ntheir suffering is due to causes outside themselves; they see\nthemselves as unfortunate victims of a hostile world. The Buddha,\nwishing to make it clear that the predominant factor in\ndissatisfaction is the way one thinks about one’s experiences,\nsaid, in effect “It’s all in the mind.” It would be\na mistake to take that statement literally and to conclude that\nnothing but consciousness exists and that the world of experience that\nfeels as though it is external to consciousness is in fact produced by\nconsciousness or is inseparable from consciousness. The\nYogācāra offers good reasons to show that the contents of\nconsciousness are conditioned and therefore are empty of inherent\nexistence, but they fail to appreciate that exactly the same can be\nsaid of awareness itself. In other words, says Candrakīrti, the\nYogācāra philosophers fail to acknowledge that\neverything, including consciousness itself, is empty.\n\nIn making the kinds of criticisms of other philosophers that\nCandrakīrti makes, he repeatedly advocates for taking ordinary\nexperience seriously and at face value. In everyday experience, we\nfeel that things arise and perish because of causes and conditions,\nand we feel that we are conscious subjects on whom an external world\nis impinging. We communicate with one another in readily\ncomprehensible language. There is no reason to change any of that, no\nreason to replace everyday language with a more precise technical\nlanguage that helps avoid misrepresenting the nature of things. At the\nsame time, it is important to be aware that it cannot be shown that\nthings have fixed natures and that there is no reason to believe about\nany of our beliefs that they are grounded. The task of philosophy for\nCandrakīrti is not to replace unwarranted beliefs with justified\ntrue beliefs, but to break the habit of forming beliefs, declaring\nthem to be true, and then becoming attached to them.\n6. Śāntideva\n6.1 Life and works\n\nAccording to traditional biographies, Śāntideva was born the\nson of a king but abandoned the royal household for life as a Buddhist\nmonk. Best estimates of the time of his activity place him at the end\nof the seventh century. His best-known (and most frequently\ntranslated) work is Bodhicaryāvatāra (Introduction\nto the practice of enlightenment), also called\nBodhisattvacaryāvatāra (Introduction to the\npractice of the bodhisattva). He also compiled\nŚikṣāsamuccaya, an annotated collection of\npassages from Mahāyāna scriptures for students, and he\nauthored a commentary to Vasubandhu’s\nTriṃśikā, a key text in the\nYogācāra tradition. Partly because he was a masterful\nstylist and wrote delightfully beautiful Sanskrit verse, and partly\nbecause his work exerted a strong influence on Tibetan Buddhism,\nŚantideva has been the focus of a considerable amount of modern\nscholarship in Japan, Europe and North America. All this makes him a\ngood access point into Madhyamaka philosophy for those who are not\nspecialists in Indian philosophy.\n\nBodhicaryāvatāra is a verse composition divided\ninto ten chapters, each dealing with a different aspect of the\ntraditional depiction of the bodhisattva’s career. The topics of\nthe ten chapters are as follows:\n\nIn praise of bodhicitta, the aspiration to become\nenlightened for the liberation of all sentient beings\nA reflection on cultivating good character through the confession\nof one’s personal shortcomings\nOn acquiring bodhicitta\nOn cultivating watchfulness with respect to\nbodhicitta\nOn the guarding of awareness\nOn the perfection of patience\nOn the perfection of courage\nOn the perfection of meditation\nOn the perfection of wisdom\nOn giving the merits accrued by cultivating virtues to all those\nsuffering beings in need of merit\n\n\nAs is the case with most philosophical works written in verse,\nBodhicaryāvatāra is usually studied with a prose\ncommentary. Śāntideva himself provided no prose commentary\nto his work, but a Sanskrit commentary by Prajñākaramati\nis still extant and is usually consulted by those who translate the\nwork into English from the original Sanskrit.\nŚāntideva’s work is also preserved in Tibetan\ntranslation and is furnished with several Tibetan commentaries, which\nare routinely consulted by those who translate\nBodhicaryāvatāra into English from its Tibetan\ntranslation.\n6.2 Contributions\n\nAlthough beautifully written, Bodhicaryāvatāra does\nnot display much philosophical originality. Its principal contribution\nis in offering a concise recapitulation of the currents of Madhyamaka\nthought and of Madhyamaka arguments against Yogācāra monism,\nwhich portrays consciousness as the ultimate source of all realities.\nWhile that is generally the case, one candidate for novelty occurs in\nearlier chapters of Bodhicaryāvatāra, where\nŚāntideva provides a line of argument that became standard\nin discussion of Mahāyāna ethics. His claim is that pain and\nunhappiness are by definition that which those who experience them\nwish to avoid. But given that there are no inherent natures that\ndistinguish one person from another, or one kind of person from\nanother kind, there is no rational basis to prefer one’s own\nexperiences and judgments to those of anyone else or to prefer what\none perceives as one’s own kind from other kinds of people. It\nis fundamentally irrational to take an interest only in one’s\nown pain and suffering; the only reasonable approach is to be\nconcerned with all the pain and unhappiness of which one\nbecomes aware and to try to eradicate all of it without making\nartificial distinctions. Since, however, most of what anyone finds\npainful and unpleasant arises from the conviction that some objects of\nexperience are inherently undesirable or impure, the best strategy to\nfollow in helping oneself and others overcome pain and suffering is to\nshow that there is no basis for the belief that some objects are\ninherently undesirable or impure. That strategy also works, of course,\nwhen unhappiness arises from the frustration of not getting things\nthat one falsely believes are inherently desirable and pure.\n\nAs was the case with Candrakīrti’s\nMadhyamakāvatāra, Śāntideva’s\nBodhicaryāvatāra has the most to say about\nMadhyamaka philosophy in the chapter on the perfection of wisdom. A\nkey verse in this chapter is 9.35, which says “When neither\npresence nor absence stands before the mind, the mind, having no\ncontent, calms down because of the absence of cognition.” This\nrecapitulates a point made by both Nāgārjuna and\nCandrakīrti that the ultimate goal of Buddhist practice is\nnirvana, a stillness of the mind in which there is no object being\ngrasped as the focus of awareness, no narratives\n(prapañca) being told to account for one’s\nexperience, no theorizing and no argumentation. At the outset of the\nchapter on wisdom Śāntideva says that the ultimate truth is\nof a reality that is not within range of the intellect; the intellect\noperates only at the level of conventional truth. In this world there\nare two kinds of human being, which Śāntideva calls ordinary\npeople (prākṛta loka) and meditators\n(yogin). The ordinary people are those who see the world in\nterms of presences and absences, being and non-being, but the\nconventional truths in which they trade are set aside by the truths of\nthe meditators. The principal delusion of those who rely on\nconventional truths is that they mistakenly believe that propositions\nconventionally accepted as truth are grounded in the natures of\nthings. Meditators, on the other hand, come to realize that things do\nnot have inherent natures. That things do not have inherent natures\ncannot be established directly, but attempts to show that things do\nhave inherent natures can be shown to be faulty. One who has\ncultivated the intention to become enlightened in order to lead others\nout of their delusion-driven suffering uses language to help people\nrealize the limitations of language and conceptual thinking. In taking\nthis approach, Śāntideva is clearly following the lead of\nBuddhapālita and Candrakīrti.\n7. Jñānagarbha\n7.1 Life and works\n\nJñānagarbha, who was most probably the teacher of\nŚāntarakṣita, probably lived in the early eighth\ncentury. Because his presentation of Madhyamaka incorporates much of\nthe terminology used by Dharmakīrti, a member of the\nepistemological tradition founded by Dignāga, he is usually\nportrayed as a follower of Bhāvaviveka’s approach to\nMadhyamaka. Like his disciple Śāntarakṣita,\nJñānagarbha also incorporates aspects of the\nYogācāra philosophy into his presentation of Madhyamaka and\ncan therefore be seen as a source of inspiration to those who strove\nto find a synthesis of the two principal schools of Mahāyāna\nBuddhism. He wrote a commentary to a key Mahāyāna scripture,\nSandhinirmocanasūtra, which was one of the principal\nsources of the Yogācāra philosophy. He is best known for an\nindependent treatise called\nSatya-dvaya-vibhaṅga-kārikā (Verses on the\ndistinction between the two truths), on which he also provided a prose\ncommentary. The verse text along with its commentary can be referred\nto together as Satyadvayavibhaṅga.\n7.2 Contributions\n\nLike all the Mādhyamika thinkers who came before him,\nJñānagarbha regards it vitally important to have a clear\nunderstanding of two kinds of truth, the conventional and\ntransactional truth of everyday life, and the truth that liberates one\nfrom attachment, aversion and delusion, this liberation being the\nultimate goal (paramārtha) of Buddhism. In talking about\nthese two truths, Jñānagarbha draws liberally from the\nwork of Dharmakīrti, who had in turn built upon the\nepistemological foundations laid by Dignāga. Dharmakīrti had\nsaid that successful action is preceded by correct cognitions; what\none deems to be truthful is any cognition that motivates action that\nleads to expected results. A true belief, then, is one that does not\ndeceive one by promising to lead to a desired goal and then failing\nsomehow to lead to that goal. A more positive way of expressing this,\nrather than saying a true belief is non-deceptive, is to say that a\ntrue belief is one that enables the realization of a goal\n(artha-kriyā-samartha). It turns out, said\nDharmakīrti, that correct reasoning is instrumental in helping\none form beliefs that motivate successful action. Therefore, one can\nsay that conceptual thinking, when done carefully, can be of great\nvalue. Even when one’s goal is to achieve nirvana by having a\ndirect experience of a still and peaceful awareness that is not\nconceptual and therefore beyond the range of language, one can arrive\nat that goal by learning to think carefully and clearly. Clear and\ncareful thinking has the capacity to identify which of the ideas that\narise in consciousness are ungrounded and delusional and therefore\nunlikely to motivate successful action. Clear and careful thinking\nabout what one hears others say enables one to discard teachings that,\nif acted upon, are unlikely to produce expected results and to follow\nteachings that, if acted upon, will lead one to a desired goal, even\nthe goal of the stillness of a mind that is not dealing in narratives\nand concepts. Without much modification, Jñānagarbha takes\nup Dharmakīrti’s terminology and the convictions that go\nwith it. So Jñānagarbha, like Bhāvaviveka, sees value\nin conceptual thinking and in careful thinking and speaking and sees\nless of a need than Candrakīrti and Śāntideva saw in\nfinding a way to eliminate all conceptual thinking and theorizing.\n\nJñānagarbha’s indebtedness to the epistemological\ntradition notwithstanding, he is still very much a Mādhyamika in\nthat much of his approach consists in showing the absurdities that\nlurk menacingly inside all constructed theories. His notion of the\nultimate goal, like Candrakīrti’s, is a wordless and\nconcept-free lucid awareness, but he sees it as possible to reach that\ngoal by using words and thoughts intelligently. Moreover, he agrees\nwith other Mādhyamikas in his conviction that all thinking, even\nthat which can be called verdical because it leads to expected\nresults, is based on a presupposition that things have inherent\nnatures—it is, after all, almost impossible to talk without at\nleast an implicit nod in the direction of inherent natures and\nessences—and that that presupposition is demonstrably false. So\naccording to Jñānagarbha rational thinking is\nsimultaneously veridical, in that it leads to expected results, and\nfalse, in that it is based upon the demonstrably false presupposition\nthat things that can be named are namable because they have inherent\nnatures. While language operates within an ontology of causes and\neffects and various other kinds of relationship, such as temporal and\nspatial relationships, it can be shown that those relationships are\nall untenable if one thinks about them carefully and investigates them\ndeeply enough.\n\nAt the heart of Jñānagarbha’s argument against the\ntenability of causality is his argument that none of the possible ways\nof looking at the relation of conditions and their effects are\nworkable. There are four possibilities. Either many conditions produce\na single effect, or many conditions produce many effects, or a single\ncondition produces many effects, or a single condition produces a\nsingle effect. His presentation of an explanation for why each of\nthese possibilities is untenable is in places terse and difficult to\ndecipher. A single thing, such as vision, cannot be the effect of many\nconditions, such as the eye, visible color, an attentive mind and so\nforth, he says, because the effect has the feature of being one, while\nthe causes are many, but there is nothing to account for what causes\nthe reduction of many things to one. Without some coherent account of\nhow a manifold can be reduced to a singularity, this hypothesis ends\nup being merely an assertion. If one imagines that a manifold set of\ncauses produces a complex multiplicity of effects, then one is saying\nin effect that each component of the complex cause is producing one\ncomponent of the complex effect, and this amounts to saying that there\nare many instances of one cause producing one effect. On the other\nhand, if one thinks that each aspect of the complex effect is a single\neffect of the totality of features within the complex cause, then one\nis saying that a single effect has many conditions, which has already\nbeen ruled out. Moreover, one faces the problem of explaining how the\nsame totality of causes can have many distinct effects, each of which\nis a feature of the complex effect putatively arising from the causal\ncomplex. If one imagines that a multiplicity, such as the manifold\nuniverse, arises out of a single cause, such as God or Brahman or\nconsciousness, then one must provide a coherent account of what causes\nthe differentiation among the many effects. What one would expect is\nthat some auxiliary condition combines with the single cause to\nproduce different effects; but if that is the case, then a single\ncause plus an auxiliary condition is not really just a single cause.\nFinally, one might imagine that a single cause produces a single\neffect, such as when one momentary phenomenon perishes and in the act\nof perishing gives rise to a subsequent momentary phenomenon of the\nsame kind. That, however, is impossible, since the putative cause must\ngo entirely out of existence before its successor can takes its place,\nand once the preceding phenomenon has ceased to exist, there is\nnothing to cause its successor to arise. Since none of the possible\nways of explaining causality turns out to survive close analysis, one\ncan only conclude that the very ideas of causality, and of arising and\nperishing, and of unity and multiplicity cannot correspond to reality.\nCausality and arising and perishing and all the various relations that\nfurnish the framework of conventional truth may be indispensable to\nconventional truth, but they cannot be features of reality.\nJñānagarbha, like the Mādhyamikas who came before\nhim, sees conventional truth as a kind of screen or obstacle to the\nreality that becomes apparent only to an awareness that is\nunencumbered by concepts and narratives.\n8. Śāntarakṣita\n8.1 Life and works\n\nWhile it is difficult to find much reliable information about the\nlives of most Indian philosophers, quite a bit is known about the\nlife, especially the later life, of Śāntarakṣita,\ndetails of whose life were recorded by Tibetans when he went to Tibet\nin about 763 and became the first abbot of Bsam-yas monastery. He was\nreportedly born into the royal family of what is now Bengal and spent\nhis adult life in various Buddhist monastic universities. It is clear\nfrom his writings that he had studied all branches of Indian\nphilosophy extensively. He seems to have been a direct disciple of\nJñānagarbha, and his own disciple, Kamalaśīla,\nwas also an influential thinker. Together Śāntarakṣita\nand Kamalaśīla, both of whom spent many years in Tibet, set\nthe tone for Buddhist scholasticism in the eighth century, and their\ninfluence is felt in Tibetan Buddhism to this day. When\nŚāntarakṣita died in 788, he was succeeded by\nKamalaśīla, who lived until 795.\n\nŚāntarakṣita’s magnum opus is a composition\nentitled Tattva-saṃgraha (Summary of reality), which\ncontains 3645 verses. The work was provided with a prose commentary by\nKamalaśīla called\nTattva-saṃgraha-pañjikā. A modern edition\nof the verse work and its commentary together runs to more than 1100\npages. Aside from its contribution to the development of Madhyamaka\nthought, the work is also a valuable source of information about the\nstate of Indian philosophy in the eighth century. The work is divided\ninto twenty-six chapters, the topics of which are as follows:\n\nThe Sāṃkhya doctrine of primodial matter\n(prakṛti) as the source of the physical world\nVarious doctrines of God as the source of the world\nThe doctrine of inherent natures (svabhāva) as the\nsource of the world\nBhartṛhari’s doctrine of Brahman-as-language as the\nsource of the world\nThe Sāṃkhya-Yoga doctrine of human spirit\n(puruṣa)\nExamination of the doctrines of the self (ātman) in\nthe Nyāya, Mīmāṃsā, Sāṃkhya,\nDigambara Jaina, Advaita and Buddhist personalist\n(pudgalavādin) schools\nThe doctrine of the permanence of things\nVarious doctrines of karma and its ripening\nA critical examination of substance\nA critical examination of quality\nA critical examination of action\nA critical examination of universals\nA critical examination of particularity\nA critical examination of inherence (the relation between\nuniversals and particulars and between substances and qualities)\nAn examination of words and their meanings\nAn examination of sense perception\nAn examination of inference\nAn examination of other means of acquiring knowledge\nA critical examination of Jaina epistemology\nAn examination of time\nA critical examination of materialism\nOn the external world (that is, the world external to\nconsciousness)\nA critical examination of revelation as a source of knowledge\nExamination of the idea that some propositions are\nself-validating\nExamination of the notion of supernormal powers\n\n\nIn addition to Tattvasaṃgraha,\nŚāntarakṣita wrote commentaries on\nDharmakīrti’s Vādanyāya (Methods of\ndebate) and Jñānagarbha’s\nSatyadvayavibhaṅga. His most original contribution to\nthe development of Madhyamaka philosophy is a verse treatise called\nMadhyamakālaṃkāra (Ornament of Centrism),\nwhich contains ninety-seven stanzas, to which he also provided a prose\ncommentary.\n8.2 Contributions\n\nBy the time Śāntarakṣita was active, the philosophy of\nthe Yogacāra school had become so influential that it could not\neasily be dismissed. Whereas earlier Mādhyamikas wrote\nrefutations of the Yogācara doctrine, which they presented as a\nkind of subjective idealism, Śāntarakṣita embraced it.\nLike Bhāvaviveka and Jñānagarbha,\nŚāntarakṣita adopted much of the terminology and the\nlogic and epistemology of Dignāga and Dharmakīrti and their\nlater followers. But whereas Bhāvaviveka had refrained from\nfollowing Dignāga and Dharmakīrti’s lead into\nYogacāra, Śāntarakṣita endorsed a kind of\nsubjective idealism, albeit as a stage that prepared one for the\nMadhyamaka doctrine of the emptiness of all phenomena. Toward the end\nof Madhyamakālaṃkāra, in verses 92–93,\nhe writes that by embracing the doctrine of mind only, one stops\ntaking external objects as real; then by embracing Madhyamaka, one\nrealizes that no objects at all have substance; then, taking the reins\nof reasoning, one rides the chariot of both systems as a single great\nvehicle (mahāyāna). The largest part of this\ntreatise—where the reins of reasoning are taken up—is\ndevoted to an extended version of the “neither one nor\nmany” argument that had been presented by\nJñānagarbha.\n\nMadhyamakālaṃkāra begins with the observation\nthat if a phenomenon has an essential nature, then either that nature\nis simple or complex, that is, it is either a single thing or many\nthings; there is no third possibility. This leads to discussions of\ndoctrines by several schools of Indian philosophy, both Buddhist and\nnon-Buddhist. Each of the schools examined posits at least one entity\nthat is completely uniform in nature and therefore has no internal\ndifferentiations. Several schools posit a uniform entity that is said\nto be the single source of all multiplicity. Drawing on arguments by\nearlier Buddhist thinkers such as Dharmakīrti,\nŚāntarakṣita argues that if there were a uniform,\npermanent and unobstructed singularity, then everything it supposedly\ncauses would have to exist all the time. A cause is something in the\npresence of which an effect arises and in the absence of which the\neffect does not arise. But if a cause is permanent, then it is never\nabsent, so none of its putative effects can ever be absent. In a\ntheory that posits a single permanent cause of all things, there is no\nsatisfactory account of all the changes that are experienced in daily\nlife, nor is there any satisfactory account of temporal sequences or\nthe fact that things exist in some places but not in others. This\nargument is applied to discredit the Sāṃkhya doctrine of\nprimordial matter, the Nyāya doctrine of God, and the\nVedāntin doctrine of Brahman. It is also applied to the\nYogācāra doctrine that all things arise from consciousness.\nAfter arguing against the main candidates for singularity nominated by\nthe various schools, Śāntarakṣita turns his attention\nto multiplicity. The very idea of multiplicity, he notes, only makes\nsense if one is talking about a collection of singularities. Given,\nhowever, that there are no singularities, there cannot be any\ncollection of them. This being the case, no inherent nature of any\nentity can be either singular or multiple; if an entity has neither a\nsingular nor a multiple inherent nature, it has no inherent nature at\nall. In other words, all phenomena are empty of inherent natures.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Ames, William L., 1993. Bhāvaviveka’s\n<em>Prajñāpradīpa</em> (A translation of chapter one:\n‘Examination of causal conditions (<em>pratyaya</em>)’).\n<em>Journal of Indian Philosophy</em>, 21 (3): 209–259.",
                "–––, 1994. Bhāvaviveka’s\n<em>Prajñāpradīpa</em> (A translation of chapter one:\n‘Examination of causal conditions (<em>pratyaya</em>)’),\nPart Two, <em>Journal of Indian Philosophy</em>, 22 (2):\n93–135.",
                "–––, 1995. Bhāvaviveka’s\n<em>Prajñāpradīpa</em> (A translation of chapter two:\n‘Examination of the traversed, the untraversed and that which is\nbeing traversed’). <em>Journal of Indian Philosophy</em>, 23\n(3): 295–365.",
                "Arnold, Dan, 2005. <em>Buddhists, Brahmins, and Belief:\nEpistemology in South Asian Philosophy of Religion</em>, New York:\nColumbia University Press.",
                "Blumenthal, James, 2013. <em>The Ornament of the Middle Way: A\nStudy of the Madhyamaka Thought of Śāntarakṣita</em>,\nBoston and London: Snow Lion.",
                "Candrakīrti, 1931. <em>Ausgewählte Kapitel aus der\nPrasannapadā (v, xii, xiii, xiv, xv, xvi): Einleitung,\nÜbersetzung, und Änmerkungen,</em> Translated into German by\nStanislaw Schayer Warsaw: W Krakowie.",
                "–––, 1949. <em>Cinq chapitres de la\nPrasannapadā, translated into French by J. W. De Jong</em>,\nLeiden: E.J. Brill.",
                "–––, 1959. <em>Prasannapadā\nmadhyamakavṛtti: Douze chapitres traduits du sanscrit et du\ntibétain, accompagnés d’une introduction, de notes\net d’une édition critique de la version tibétaine\npar Jacques May</em>, Paris: Adrien-Maisonneuve.",
                "–––, 1979. <em>Lucid Exposition of the Middle\nWay: The Essential Chapters from the Prasannapadā of\nCandrakīrti</em>, translated by Mervyn Sprung, T.R.V. Murti, and\nU.S. Vyas. Boulder, CO: Prajñā Press.",
                "–––, 1980. <em>Candrakīrti’s Seven\nFold Reasoning: Meditation on the Selflessness of Persons</em>,\nDharamshala, India: Translation Bureau of the Library of Tibetan Works\n&amp; Archives.",
                "–––, 2004. <em>Introduction to the Middle Way:\nChandrakirti’s Madhyamakavatara with commentary by Jamgön\nMipham</em>, translated by the Padmakara Translation Group, Boston\n&amp; London: Shambhala.",
                "Cowherds, The, 2011. <em>Moonshadows: Conventional Truth in\nBuddhist Philosophy</em>, Oxford: Oxford University Press.",
                "Della Santina, Peter, 1986. <em>Madhyamaka Schools in India: a\nStudy of the Mādhyamaka Philosophy and of the Division of the\nSystem Into the Prāsangika and Svātantrika Schools</em>,\nDelhi: Motilal Banarsidass.",
                "Dreyfus, Georges B. J., and Sara L. McClintock (eds.), 2002.\n<em>The Svātantrika-Prāsaṅgika Distinction: What\nDifference Does a Difference Make?</em> Boston: Wisdom\nPublications.",
                "Eckel, Malcom David, 1978. Bhāvaviveka and the early\nMādhyamika theories of language. <em>Philosophy East and\nWest</em>, 28 (3): 323–337.",
                "–––, 1987. <em>Jñānagarbha’s\nCommentary on the Distinction Between the Two Truths: an Eighth\nCentury Handbook of Mādhyamaka</em>, Albany: State University of\nNew York Press.",
                "–––, 1992. <em>To See the Buddha: A\nPhilosopher’s Quest for the Meaning of Emptiness</em>,\nPrinceton, NJ: Princeton University Press.",
                "Edelglass, William and Jay L.Garfield, 2009. <em>Buddhist\nPhilosophy: Essential Readings</em>, New York; Oxford University\nPress.",
                "Garfield, Jay L., 1996. Emptiness and Positionlessness: Do the\nMādhyamika Relinquish All Views? <em>Journal of Indian\nPhilosophy</em>, 24: 1–34.",
                "Goodman, Charles, 2016. <em>The Training Anthology of\nŚāntideva: A Translation of the\nŚikṣā-samuccaya</em>, New York: Oxford University\nPress.",
                "Huntington, C. W., Jr. and Geshe Namgyal Wangchen, 1989. <em>The\nEmptiness of Emptiness: An Introduction to Early Indian\nMādhyamika</em>, Honolulu: University of Hawai‘i\nPress.",
                "Iida, Shotaro, 1980. <em>Reason and Emptiness: A Study in Logic\nand Mysticism</em>, Tokyo: Hokuseido Press.",
                "Lang, Karen C., 1986. <em>Āryadeva’s\nCatuḥśataka</em>, Copenhagen: Akademisk Forlag.",
                "–––, 2003. <em>Four Illusions:\nCandrakīrti’s Advice to Travelers on the Bodhisattva\nPath</em>, New York: Oxford University Press.",
                "Lopez, Donald S., Jr., 1987. <em>A Study of Svātantrika</em>,\nIthaca, N.Y.: Snow Lion Publications.",
                "Rizzi, Cesare, 1988. <em>Candrakīrti</em>, Dehli: Motilal\nBanarsidass.",
                "Ruegg, David Seyfort, 1981. <em>The Literature of the\nMādhyamaka School of Philosophy in India</em> (History of Indian\nliterature, Volume 7, fasc. 1), Wiesbaden: Harrassowitz.",
                "–––, 2000. <em>Studies in Indian and Tibetan\nMadhyamaka Thought</em> (Wiener Studien zur Tibetologie und\nBuddhismuskunde), Vienna: Arbeitskreis für Tibetische und\nBuddhistische Studien, Universität Wien.",
                "–––, 2006. The\n<em>Svātantrika-Prāsaṅgika</em> Distinction in the\nHistory of Madhyamaka Thought. <em>Indo-Iranian Journal,</em> 49:\n319–346.",
                "–––, 2010. <em>The Buddhist Philosophy of the\nMiddle: Essays on Indian and Tibetan Madhyamaka</em>, Boston: Wisdom\nPublications.",
                "Siderits, Mark, 1980. The Madhyamaka critique of epistemology I.\n<em>Journal of Indian Philosophy</em>, 8: 307–335.",
                "–––, 1981. The Madhyamaka critique of\nepistemology II. <em>Journal of Indian Philosophy</em>, 9:\n121–160.",
                "–––, 2004. Causation and emptiness in early\nMadhyamaka. <em>Journal of Indian Philosophy</em>, 32:\n393–419.",
                "–––, 2007. <em>Buddhism as Philosophy: An\nIntroduction</em>, Indianapolis: Hackett Publishing Company, Inc.",
                "Tillemans, Tom J. F., 1990. <em>Materials for the Study of\nĀryadeva, Dharmapāla and Candrakīrti</em>, Vienna:\nArbeitskreis für Tibetische und Buddhistische Studien,\nUniversität Wien.",
                "–––, 2016. <em>How Do Mādhyamikas Think?:\nand Other Essays on the Buddhist Philosophy of the Middle</em>,\nSomerville: Wisdom Publications.",
                "Williams, Paul, 1980. Some aspects of language and construction in\nthe Madhyamaka. <em>Journal of Indian Philosophy</em>, 8:\n1–45.",
                "Yoshimizu, Chizuko, 2012. Reasoning-for-others in\nCandrakīrti’s Madhyamaka Thought. <em>Journal of the\nInternational Association of Buddhist Studies</em>, 35: 413–444.\n"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Ames, William L., 1993. Bhāvaviveka’s\n<em>Prajñāpradīpa</em> (A translation of chapter one:\n‘Examination of causal conditions (<em>pratyaya</em>)’).\n<em>Journal of Indian Philosophy</em>, 21 (3): 209–259.</li>\n<li>–––, 1994. Bhāvaviveka’s\n<em>Prajñāpradīpa</em> (A translation of chapter one:\n‘Examination of causal conditions (<em>pratyaya</em>)’),\nPart Two, <em>Journal of Indian Philosophy</em>, 22 (2):\n93–135.</li>\n<li>–––, 1995. Bhāvaviveka’s\n<em>Prajñāpradīpa</em> (A translation of chapter two:\n‘Examination of the traversed, the untraversed and that which is\nbeing traversed’). <em>Journal of Indian Philosophy</em>, 23\n(3): 295–365.</li>\n<li>Arnold, Dan, 2005. <em>Buddhists, Brahmins, and Belief:\nEpistemology in South Asian Philosophy of Religion</em>, New York:\nColumbia University Press.</li>\n<li>Blumenthal, James, 2013. <em>The Ornament of the Middle Way: A\nStudy of the Madhyamaka Thought of Śāntarakṣita</em>,\nBoston and London: Snow Lion.</li>\n<li>Candrakīrti, 1931. <em>Ausgewählte Kapitel aus der\nPrasannapadā (v, xii, xiii, xiv, xv, xvi): Einleitung,\nÜbersetzung, und Änmerkungen,</em> Translated into German by\nStanislaw Schayer Warsaw: W Krakowie.</li>\n<li>–––, 1949. <em>Cinq chapitres de la\nPrasannapadā, translated into French by J. W. De Jong</em>,\nLeiden: E.J. Brill.</li>\n<li>–––, 1959. <em>Prasannapadā\nmadhyamakavṛtti: Douze chapitres traduits du sanscrit et du\ntibétain, accompagnés d’une introduction, de notes\net d’une édition critique de la version tibétaine\npar Jacques May</em>, Paris: Adrien-Maisonneuve.</li>\n<li>–––, 1979. <em>Lucid Exposition of the Middle\nWay: The Essential Chapters from the Prasannapadā of\nCandrakīrti</em>, translated by Mervyn Sprung, T.R.V. Murti, and\nU.S. Vyas. Boulder, CO: Prajñā Press.</li>\n<li>–––, 1980. <em>Candrakīrti’s Seven\nFold Reasoning: Meditation on the Selflessness of Persons</em>,\nDharamshala, India: Translation Bureau of the Library of Tibetan Works\n&amp; Archives.</li>\n<li>–––, 2004. <em>Introduction to the Middle Way:\nChandrakirti’s Madhyamakavatara with commentary by Jamgön\nMipham</em>, translated by the Padmakara Translation Group, Boston\n&amp; London: Shambhala.</li>\n<li>Cowherds, The, 2011. <em>Moonshadows: Conventional Truth in\nBuddhist Philosophy</em>, Oxford: Oxford University Press.</li>\n<li>Della Santina, Peter, 1986. <em>Madhyamaka Schools in India: a\nStudy of the Mādhyamaka Philosophy and of the Division of the\nSystem Into the Prāsangika and Svātantrika Schools</em>,\nDelhi: Motilal Banarsidass.</li>\n<li>Dreyfus, Georges B. J., and Sara L. McClintock (eds.), 2002.\n<em>The Svātantrika-Prāsaṅgika Distinction: What\nDifference Does a Difference Make?</em> Boston: Wisdom\nPublications.</li>\n<li>Eckel, Malcom David, 1978. Bhāvaviveka and the early\nMādhyamika theories of language. <em>Philosophy East and\nWest</em>, 28 (3): 323–337.</li>\n<li>–––, 1987. <em>Jñānagarbha’s\nCommentary on the Distinction Between the Two Truths: an Eighth\nCentury Handbook of Mādhyamaka</em>, Albany: State University of\nNew York Press.</li>\n<li>–––, 1992. <em>To See the Buddha: A\nPhilosopher’s Quest for the Meaning of Emptiness</em>,\nPrinceton, NJ: Princeton University Press.</li>\n<li>Edelglass, William and Jay L.Garfield, 2009. <em>Buddhist\nPhilosophy: Essential Readings</em>, New York; Oxford University\nPress.</li>\n<li>Garfield, Jay L., 1996. Emptiness and Positionlessness: Do the\nMādhyamika Relinquish All Views? <em>Journal of Indian\nPhilosophy</em>, 24: 1–34.</li>\n<li>Goodman, Charles, 2016. <em>The Training Anthology of\nŚāntideva: A Translation of the\nŚikṣā-samuccaya</em>, New York: Oxford University\nPress.</li>\n<li>Huntington, C. W., Jr. and Geshe Namgyal Wangchen, 1989. <em>The\nEmptiness of Emptiness: An Introduction to Early Indian\nMādhyamika</em>, Honolulu: University of Hawai‘i\nPress.</li>\n<li>Iida, Shotaro, 1980. <em>Reason and Emptiness: A Study in Logic\nand Mysticism</em>, Tokyo: Hokuseido Press.</li>\n<li>Lang, Karen C., 1986. <em>Āryadeva’s\nCatuḥśataka</em>, Copenhagen: Akademisk Forlag.</li>\n<li>–––, 2003. <em>Four Illusions:\nCandrakīrti’s Advice to Travelers on the Bodhisattva\nPath</em>, New York: Oxford University Press.</li>\n<li>Lopez, Donald S., Jr., 1987. <em>A Study of Svātantrika</em>,\nIthaca, N.Y.: Snow Lion Publications.</li>\n<li>Rizzi, Cesare, 1988. <em>Candrakīrti</em>, Dehli: Motilal\nBanarsidass.</li>\n<li>Ruegg, David Seyfort, 1981. <em>The Literature of the\nMādhyamaka School of Philosophy in India</em> (History of Indian\nliterature, Volume 7, fasc. 1), Wiesbaden: Harrassowitz.</li>\n<li>–––, 2000. <em>Studies in Indian and Tibetan\nMadhyamaka Thought</em> (Wiener Studien zur Tibetologie und\nBuddhismuskunde), Vienna: Arbeitskreis für Tibetische und\nBuddhistische Studien, Universität Wien.</li>\n<li>–––, 2006. The\n<em>Svātantrika-Prāsaṅgika</em> Distinction in the\nHistory of Madhyamaka Thought. <em>Indo-Iranian Journal,</em> 49:\n319–346.</li>\n<li>–––, 2010. <em>The Buddhist Philosophy of the\nMiddle: Essays on Indian and Tibetan Madhyamaka</em>, Boston: Wisdom\nPublications.</li>\n<li>Siderits, Mark, 1980. The Madhyamaka critique of epistemology I.\n<em>Journal of Indian Philosophy</em>, 8: 307–335.</li>\n<li>–––, 1981. The Madhyamaka critique of\nepistemology II. <em>Journal of Indian Philosophy</em>, 9:\n121–160.</li>\n<li>–––, 2004. Causation and emptiness in early\nMadhyamaka. <em>Journal of Indian Philosophy</em>, 32:\n393–419.</li>\n<li>–––, 2007. <em>Buddhism as Philosophy: An\nIntroduction</em>, Indianapolis: Hackett Publishing Company, Inc.</li>\n<li>Tillemans, Tom J. F., 1990. <em>Materials for the Study of\nĀryadeva, Dharmapāla and Candrakīrti</em>, Vienna:\nArbeitskreis für Tibetische und Buddhistische Studien,\nUniversität Wien.</li>\n<li>–––, 2016. <em>How Do Mādhyamikas Think?:\nand Other Essays on the Buddhist Philosophy of the Middle</em>,\nSomerville: Wisdom Publications.</li>\n<li>Williams, Paul, 1980. Some aspects of language and construction in\nthe Madhyamaka. <em>Journal of Indian Philosophy</em>, 8:\n1–45.</li>\n<li>Yoshimizu, Chizuko, 2012. Reasoning-for-others in\nCandrakīrti’s Madhyamaka Thought. <em>Journal of the\nInternational Association of Buddhist Studies</em>, 35: 413–444.\n</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "mind: in Indian Buddhist Philosophy",
            "Nāgārjuna",
            "Śāntarakṣita",
            "two truths in India, theory of",
            "two truths in Tibet, theory of\nYogācāra"
        ],
        "entry_link": [
            {
                "../mind-indian-buddhism/": "mind: in Indian Buddhist Philosophy"
            },
            {
                "../nagarjuna/": "Nāgārjuna"
            },
            {
                "../saantarak-sita/": "Śāntarakṣita"
            },
            {
                "../twotruths-india/": "two truths in India, theory of"
            },
            {
                "../twotruths-tibet/": "two truths in Tibet, theory of"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=madhyamaka\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/madhyamaka/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=madhyamaka&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/madhyamaka/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=madhyamaka": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/madhyamaka/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=madhyamaka&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/madhyamaka/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.sub.uni-goettingen.de/ebene_1/fiindolo/gretil.htm\" target=\"other\">GRETIL (Göttingen Register of Electronic Texts in Indian Languages)</a>\n is a constantly growing repository of digital texts, mostly in\nSanskrit, on all topics, including a section on\n <a href=\"http://www.sub.uni-goettingen.de/ebene_1/fiindolo/gretil.htm#BauddhDa\" target=\"other\">Buddhist philosophy</a>."
        ],
        "listed_links": [
            {
                "http://www.sub.uni-goettingen.de/ebene_1/fiindolo/gretil.htm": "GRETIL (Göttingen Register of Electronic Texts in Indian Languages)"
            },
            {
                "http://www.sub.uni-goettingen.de/ebene_1/fiindolo/gretil.htm#BauddhDa": "Buddhist philosophy"
            }
        ]
    }
}