{
    "url": "markets",
    "title": "Markets",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Lisa Herzog\n<l.m.herzog@rug.nl>",
        "author_links": [
            {
                "https://www.rug.nl/staff/l.m.herzog/cv?lang=en": "Lisa Herzog"
            },
            {
                "mailto:l%2em%2eherzog%40rug%2enl": "l.m.herzog@rug.nl"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"https://www.rug.nl/staff/l.m.herzog/cv?lang=en\" target=\"other\">Lisa Herzog</a>\n&lt;<a href=\"mailto:l%2em%2eherzog%40rug%2enl\"><em>l<abbr title=\" dot \">.</abbr>m<abbr title=\" dot \">.</abbr>herzog<abbr title=\" at \">@</abbr>rug<abbr title=\" dot \">.</abbr>nl</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Mar 26, 2013",
        "substantive revision Mon Aug 30, 2021"
    ],
    "preamble": "\n\nMarkets are institutions in which individuals or collective agents\nexchange goods and services. They usually use money as a medium of\nexchange, which leads to the formation of prices. Markets can be\ndistinguished according to the goods or services traded in them (e.g.,\nfinancial markets, housing markets, labor markets), according to their\nscope (e.g., regional, national, international markets), or according\nto their structure (e.g., competitive markets, oligopolistic markets,\nmonopolistic markets). From a normative perspective, markets are of\ninterest for a number of reasons: various arguments for and against\nmarkets relate to central questions of social and political\nphilosophy. In addition, markets depend on, and in turn influence,\nmany other institutions and aspects of social life. They thus\nco-determine the ways in which values such as liberty, justice or\nsolidarity can be realized. Questions as to which markets, for what\ngoods, can be defended by normative arguments, and how they relate to\nother institutions, are therefore at the core of thinking about a just\nsociety.\n\nMarkets are analyzed in a variety of disciplines, including sociology,\nhistory, and, most notably, economics. In philosophy, the interest in\nquestions relating to markets has seen ebbs and flows. Starting\nroughly in the 18th century, one finds debates about a\nsociety in which markets are a social sphere of their own, and have an\nimpact on society as a whole. This article presents the most important\nstrands of the philosophical debate about markets. It offers some\ndistinctions between the concept of markets and related concepts, as\nwell as a brief outline of historical positions vis-à-vis\nmarkets. The main focus is on presenting the most common arguments for\nand against markets, and on analyzing the ways in which markets are\nrelated to other social institutions. In the concluding section\nquestions about markets are connected to two related themes,\nmethodological questions in economics and the topics of business\nethics and corporate social responsibility.\n",
    "toc": [
        {
            "#ConDel": "1. Conceptual delineations"
        },
        {
            "#ThrLinTraFriFoeCriFri": "2. Three lines of tradition: friends, foes, and critical friends"
        },
        {
            "#ArgAboMar": "3. Arguments about markets"
        },
        {
            "#JusMar": "3.1 Justifications of markets"
        },
        {
            "#CriMar": "3.2 Criticisms of markets"
        },
        {
            "#MarVerDifMar": "3.3 “The market” versus different markets"
        },
        {
            "#RelBetMarOthIns": "4. Relations between markets and other institutions"
        },
        {
            "#PreForMar": "4.1 Preconditions for markets"
        },
        {
            "#InsSupCorMarOut": "4.2 Institutions that supplement or correct market outcomes"
        },
        {
            "#ProDicMarVerSta": "4.3 Problems with the dichotomy of “the market” versus “the state”"
        },
        {
            "#IntIns": "4.4 The interrelatedness of institutions"
        },
        {
            "#RelThe": "5. Related themes"
        },
        {
            "#MetQueEco": "5.1 Methodological questions in economics"
        },
        {
            "#BusEthCorSocRes": "5.2 Business ethics and Corporate Social Responsibility"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Conceptual delineations\n\nThe term “market” with its cognates in other European\nlanguages (marché, Markt, mercado, etc.) stems from the Latin\nroot “merx”. It means “wares” or\n“merchandise”. To understand better what markets are, it\nis important to distinguish the concept of markets from other, related\nconcepts.\n\nThe concept of “exchange” is at the core of the concept of\nmarkets. In markets, exchanges of goods and services take place for\nreasons of self-interest, in contrast to, for example, the exchange of\ngifts with the aim of building relationships (on gift exchange see\ne.g., Maus 1923–24). Most markets use money as a medium of\nexchange. Often, individuals act as “price takers”, i.e.,\nthey take prices as given and choose how much to buy or sell. But\nthere are also markets where exchanges take place in the form of\nbarter or in different forms of auctions. The concept of\n“markets”, however, is wider than the concept of exchange\nbecause it includes the structural macro-effects that result from a\nlarge number of exchanges, for example changes in the overall price\nlevel.\n\n“Competition” is a feature of markets, but is also used in\ndifferent senses, e.g., with regard to institutional competition or\nevolutionary competition. In markets, competition results from the\nfact that agents seek to find the best deal, thus creating competition\namong the participants on the other side of the market, supply or\ndemand respectively. Markets are called “competitive” when\nthey have certain structural features that include a large number of\nbuyers and sellers, comparable goods, and the absence of informational\nasymmetries. In what follows, the focus is on competitive markets,\nleaving aside the specific problems (in particular unequal market\npower) of non-competitive markets such as monopolies or cartels. It\nshould be noted, however, that even in seemingly competitive markets\nthere are often “pockets” of unequal market power, e.g.,\nwhen a company is the only employer in a certain region or when a bank\npossesses more information than its customers. To the degree to which\nsuch deviations from the model of a competitive market are unavoidable\n– for example because network effects in the digital realm lead\nto highly concentrated markets – they need to be taken into\naccount in normative evaluations of these markets.\n\nThe term “economy” describes the productive and\ndistributive activities of a region or country, which includes\nmarkets, but also the legal framework within which they take place, as\nwell as the organizations within markets, such as households and\ncorporations (on the latter see recently Ciepley 2013 and Anderson\n2017). The latter’s internal structure is typically hierarchical\nand bureaucratic and thus quite different from the structure of\n markets.[1]\n In many countries, the “economy” also includes a state\nsector as well as mixed forms, such as private-public partnerships. It\ncan also include other forms of redistribution such as charities or\n“black markets”. Polanyi has provided a classic\ncategorization of allocation mechanisms: he distinguishes between\nreciprocity (based on symmetrical relations), redistribution (based on\ncentricity: a central authority collects the goods and hands them out\nto individuals), autarky (production for one’s own use) and\nmarkets (1944, ch. 4). This shows that markets are only one form in\nwhich goods and services can be allocated in a society. Insofar as\nother structures – e.g., hierarchical structures within\ncorporations – continue to play a role in economic systems, it\nis misleading to conceptualize them as pure “market\neconomies.”\n\nThe concept of “capitalism” includes a reference to\nmarkets, but as a socio-economic system, it is broader; its defining\nfeature is the private ownership of capital (see e.g., Scott 2011).\nThis typically leads to pressures to find profitable investment\nopportunities and to asymmetries between owners and non-owners of\ncapital. Markets are a core element of capitalism, but in principle\nthey can also exist in societies in which the ownership of capital is\norganized differently (see e.g., Carens 1981 for a proposal that\nbuilds on “moral incentives”; for the debate about\n“market socialism” in general see e.g., Bardhan/Roemer\n1993). Many proposals for reforming current forms of capitalism, for\nexample the Rawlsian idea of a “property owning democracy”\n(see e.g., O’Neill/Williamson 2012), do not reject markets, but\nrather argue for a more equal distribution of productive assets.\n\nA vague, but nonetheless helpful distinction is drawn by Polanyi\nbetween “market economies” and “market\nsocieties”. The latter are societies where “instead of the\neconomy being embedded in social relations, social relations are\nembedded in the economy” (Polanyi 1944, 57, see also Cunningham\n2005). Many arguments about the value of markets have to do with their\nimpact on the character of a society as a whole and with the questions\nof where, when, and how one should limit the influence of markets. In\nPolanyi’s terms, this is the question of whether a “market\neconomy” can and should remain a “market economy”,\nor whether it does or should lead to a “market\nsociety”.\n2. Three lines of tradition: friends, foes, and critical friends\n\nIn Western thought systematic inquiry into the character and the value\nof markets started in the early modern period. Earlier analyses were\ntypically restricted to questions about the economic relations of the\nhousehold, the “oikos” (which is the root of the term\n“economics”). Important exceptions are Aristotle’s\ndiscussion of the character of money (Politics I, 8–10)\nand the discussions in which this topic was taken up. They raise\nfundamental questions about legitimate and illegitimate forms of\nexchange. From at least the 18th century onwards, one finds intense\ndebates about the nature of markets and their value for individuals\nand societies (on the history of economic thought see for example the\nclassic, but somewhat outdated, Schumpeter (1954) or for a more\ntechnical account Blaug (1996)).\n\nThe line of thinkers who by and large endorse markets reaches from\nMandeville’s Fable of the Bees (1924 [1714/1721]) to\nthe Scottish Enlightenment, with Adam Smith’s 1776 Inquiry\ninto the Nature and Causes of the Wealth of Nations often seen as\nthe birth certificate of economics as a separate science. In the 19th\ncentury, insights from Smith and other earlier thinkers were taken up\nby “classic” economists such as Thomas Malthus [1798] or\nDavid Ricardo [1817]. In the 20th century the pro-market tradition\nincludes the “Austrian” school with thinkers such as\nLudwig von Mises (e.g., 1949), Joseph Schumpeter (e.g., 1942), and\nF.A. von Hayek (e.g., 1944; 1973–9); James Buchanan and the\n“Virginia School” with its focus on public choice theory\n(e.g., Buchanan 1975); and the (largely libertarian) “Chicago\nSchool” with Milton Friedman as its most prominent\nrepresentative (e.g., 1962; on the Chicago School as a whole see e.g.,\nEmmett (2010); for a critical delineation of libertarian from liberal\nthought see Freeman 2001). The arguments by friends of markets have\nchanged over time, but there are some threads that unite this\ntradition: the emphasis on individualism and on markets as helping to\nemancipate individuals from traditional ties, a “negative”\nunderstanding of freedom, a focus on the innovating and modernizing\neffects of markets, and on their positive impact on the welfare of\nsociety.\n\nThere is also a long tradition of thinkers critical of markets. This\nwas, in a sense, the “default” position in the Christian\nculture of the European middle ages, where trade and markets were seen\nas driven by, and favorable to, the sins of gluttony and greed, and as\ninimical to the established\n order.[2]\n In the last three centuries, the most important critics of markets\ninclude Jean-Jacques Rousseau (notably in the Second Discourse on\nthe Origins of Inequality [1764] (1997)), and Karl Marx and\nFriedrich Engels (e.g., Communist Manifesto,\nCapital) and the Marxist tradition, which has unfolded into a\nwide spectrum of positions, from left-wing social democrats to radical\ncommunists (see Kołakowski 1978). Common themes in this tradition\nare the inegalitarian, disruptive results of unregulated markets,\ntheir instability, their alienating effects (e.g., separating\nindividuals from the fruits of their labor, see also\n section 3.2\n below), and their degrading effects on the poor. What also unites\nthese thinkers is the hope that there are alternatives to markets for\norganizing the economic life of large-scale societies. In the 19th\ncentury and the first three quarters of the 20th century what was\nstandardly quoted as an alternative to a market economy was a\ncentrally planned economy. After the fall of communism in Eastern\nEurope and Russia other, usually more modest, models have been\ndiscussed and sometimes experimented with (for examples see e.g.,\nWright 2011, ch. 7). Much of the force of criticisms of markets\ndepends on the availability of alternative models that score better on\na number of normative dimensions. Research on and experiments with\nalternative models are therefore of great interest for philosophers\nwho wish to evaluate markets from a normative perspective.\n\nThere is a third line of thinkers who stand between the friends and\nthe foes of markets and argue for a qualified endorsement: they see\nadvantages in markets, but also problems. Therefore, they either argue\nthat the overall balance is positive, or that the problems can be\nmitigated by other institutions. Often, this position is motivated by\nthe argument that we do not know of a better way of organizing the\neconomic life of large societies, and that it is therefore better,\noverall, to “tame” markets than to abolish them. This\nposition has been held by thinkers as diverse as G.W.F. Hegel (1942\n[1821]), J.S. Mill (1848), J.M. Keynes (1936) or John Rawls (1971) and\nby many social-democratic parties in Europe (see Berman 2006). What\nunites them is a belief in the “primacy of politics.”\nMarkets are welcomed as an instrument for achieving certain aims\nwithin the framework of the state, but their purpose, extent,\nand limits should be determined by politics. Whether and how this\nprimacy of politics is possible is another important question in the\nphilosophical debate about markets (cf. also 4.3 below).\n\nToday, remnants of these historical traditions can be found in the\nways in which different academic disciplines look at markets. Although\nthere are exceptions, economists typically see markets in a positive\nlight. They have long analyzed them using abstract methods that model\nindividuals as sovereign, rational choosers. This approach, which\nleaves a number of problems of real-life markets unexplained, has also\nbeen used for incentive-based analyses of other social spheres (see\nnotably Gary Becker, e.g., 1976). These have raised questions about\nthe possibilities and limits of the rational choice approach,\nespecially since behavioral economists have started to explore how\nreal human behavior departs from the behavior assumed in the models\n(see e.g., Kahneman/Tversky 1979; Laibson 1997; Fehr/Schmidt 1999; for\nan overview of behavioral economics see e.g.,\nCamerer/Loewenstein/Rabin 2003; for a critique of rational choice\ntheory from a philosophical perspective see e.g., Sen 1977).\nSociologists, anthropologists, and historians use different, usually\nless abstract methods for exploring different markets. Their emphasis\nhas often been on the relation of markets to other spheres of life,\nbecause they see individuals as socially embedded, and their decisions\nas shaped by their social environment. Many researchers from these\ndisciplines are rather critical of capitalist markets. Their methods\nallow them to see problems to which economists may be methodologically\nblind. But economists might reply that the methods used by historians,\nsociologists and anthropologists are in turn less suitable for\ngrasping the positive indirect effects of markets, for\nexample the benefits for customers when a company is restructured.\nAlthough they can be intertwined, it is therefore important to\ndistinguish between disciplinary approaches, research methods, and\nsubstantive arguments about the value of markets.\n3. Arguments about markets\n\nJudgments about markets are often “all things\nconsidered”-judgments in which both defenders and critics can\nconcede certain points to one another, but hold that other arguments\noutweigh them. For the sake of clarity, the most common arguments\nabout markets are here presented along the lines of justifications and\ncriticisms. Some of these arguments apply to markets in general, some\napply to market societies, and others apply to specific markets (cf.\nalso 3.3 below). Many arguments, however, can be used on several of\nthese levels, and it depends on an author’s goals how he or she\nuses them (for a book-length account of arguments for and against\nmarkets see also Buchanan 1985).\n3.1 Justifications of markets\n\nSen (1985) distinguishes two basic strategies for justifying markets:\nfrom antecedent rights or liberties on the one hand, or from\nconsequences on the other hand. Arguments about antecedent rights and\nliberties often go hand in hand, as the rights in question are said to\nprotect the liberties in question. In its paradigmatic form, this\nargument is based on a right to private property. It gives individuals\nthe right to do whatever they like with their property. This includes\nthe right to enter into exchange relationships with others.\nProhibiting such exchanges, or interfering with them in any other way,\ninfringes on these rights and thus, it is said, on a basic form of\nfreedom. The attractiveness of such justifications of markets lies in\ntheir a priori character and their intuitive plausibility. But they\nonly work if one can defend the a priori rights or liberties on which\nthey are based. Arguments of this kind are therefore often joined with\narguments about the naturalness of property rights as existing prior\nto the state. It is more plausible to hold that property rights must\nnot be compromised if one holds that they are a priori, than when they\nare understood as dependent on consent by society and enforcement\nthrough the state. The naturalness of property rights has often been\ndefended by connecting them to self-ownership and by basing them on\nthe mixing of one’s labor with material things and thereby\nappropriating them, along Lockean lines (Locke 1960 [1689]; see also\nNozick 1974; for the left-libertarian defense of private property\n(which combines it with very different positions with regard to\nequality and the role of the state) see e.g., Vallentyne/Steiner\n2000). But this view of property rights has been disputed. Many\nthinkers point out the crucial role of the state in providing and\nprotecting property rights and the right to free contract (see e.g.,\nMurphy/Nagel 2002). Also, many historians of ideas have pointed out\nthat the idea that liberty consists in the unhindered use of\none’s property (what MacGilvray (2011) calls “market\nfreedom”) is not the only way in which freedom can be\nunderstood, and has historically been understood (see for example\nPettit 2006 for a discussion of markets from the perspective of\nfreedom as non-domination, for a more emphatic endorsement of markets\nfrom a neo-republican perspective see Taylor 2013). In fact, the\nstrength of such a priori defenses of markets crucially depends on\nwhat “counts” as infringement of freedom: does one only\n“count” coercive rules by the state, or does one also\ncount the obstacles to pursuing one’s interests that one\nexperiences in a market society, which are often the result of\nnumerous decisions by anonymous individuals (cf. e.g., Cohen 1979;\nOlsaretti 2004, ch. 4–6; MacGilvray 2011, ch. 5). A strict\nsystem of private property rights can lead to situations of extreme\ninequality in which some members of a society are left to starve, so\nthat it becomes questionable in what sense they can be called free.\nThis presents defenders of markets on a priori grounds with a choice:\nthey either have to bite this bullet and accept extreme inequality and\npoverty as justified. Or they have to step back from their pure a\npriori position and admit that consequences can play a role in the\nconsideration of markets. Then, one can admit that markets may have to\nbe supplemented by other institutions, and their justification cannot\nbe unconditional any more (Sen 1985). Nevertheless, rights and\nliberties can continue to play an important role in pro-market\narguments, even while being embedded in a wider framework in which,\nfor example, a certain amount of taxation is also defended (for a\nrecent account, called “free market fairness”, which\nemphasizes the importance of economic liberties as basic rights but\nalso allows for some restriction for the sake of social justice, see\nTomasi 2012).\n\nMany justifications of markets, however, are based not on a priori\nrights or liberties, but rather on the consequences of\nmarkets. Several dimensions of these consequences can be\ndistinguished. A first, historically important, argument holds that\nmarkets make individuals more virtuous and sociable: they build on\ncalm, rational interests rather than violent passions. Markets\ntherefore make manners more peaceful and civilized (see Hirschman\n1977, who refers to Montesquieu and other 18th century\n thinkers).[3]\n Arguments about the character-building effect of markets are\nsometimes also raised today (cf. e.g., McCloskey 2006, for a critical\ndiscussion see Fumagalli 2020). Hirschman has conjectured that the\ncivilizing and moralizing forces of markets might just be sufficient\nto outbalance their self-undermining forces (1982); Bowles, in\ncontrast, has suggested that non-market elements of liberal\nsocieties might counteract potentially dangerous effects of\nmarkets.\n\nA second argument concerns the consequences of markets in the sense of\nthe distribution they bring about. It is sometimes held that markets,\nor more specifically labor markets, give people what they deserve\nbecause they reward individuals’ contributions to the social\nwhole. This makes desert rather than traditional hierarchies the\ndeterminant of social positions (e.g., Miller 2001, ch. VIII-IX;\nHonneth in Fraser/Honneth 2003, 137ff., Mankiw 2010; for\njustifications of profits along similar lines see e.g., Arnold 1987;\nNarveson 1995). Such arguments draw on the (luck egalitarian)\nintuition that differences in individuals’ incomes are justified\nas long as they are not undeserved, but reflect free choices (see\ne.g., Arneson 2008), for example the decision to work 50 rather than\n40 hours per week, or to take on a less pleasant job, which gives one\na ‘premium for being a steeplejack or an embalmer or working on\nthe night shift’ (Okun 1975, 72). It has been a matter of\ndebate, however, whether markets in fact reward choices in this way,\nor whether one’s socio-economic background, one’s\nparticipation in teams of workers (where individual contributions may\nbe impossible to separate), or simply luck play too great a role in\ndetermining one’s income. If so, then the “cult of\npersonal responsibility” would be misguided (Barry 2005, part\nIV; cf. also Olsaretti 2004, ch.1–3 for a discussion of the\narguments for markets from desert, which she ultimately rejects).\nInterestingly, even some defenders of free markets, such as von Hayek\nand Knight, have argued that the sense in which they can be called\njust only concerns the framework of rules within which they take\nplace, not the resulting distributing of income. They argue that what\nmarkets reward, namely the satisfaction of wants, has nothing to do\nwith moral values (1978, ch. IX; cf. also Knight 1923). One might\nargue that these rules can be more or less conducive to justice in the\nsense of desert, and that, ceteris paribus, they should be\nmade more conducive to it rather than less (e.g., Lamont 1997; Herzog\n2013, ch. V; see also Herzog 2017, chap. V). In that form, however,\nthe argument concerns not the justification of markets, but\nrather the question of how their framework should be designed, such\nthat they bring about results that reward\n desert.[4]\n\nThe most important argument for markets that builds on consequences,\nhowever, concerns their ability to deliver efficient outcomes and to\ncreate high levels of welfare. They spur economic growth, while not\nrelying on a central planning mechanism, but on the self-interest of\nindividuals. This is what the famous Smithian metaphor of the\n“invisible hand” (WN IV.II.9) is usually taken to stand\nfor. Under certain assumptions, such as stable preferences, the\nabsence of external effects on third parties, equal and open access to\ninformation, and the absence of one-sided bargaining power, market\noutcomes are Pareto efficient. This has been shown in the first\ntheorem of welfare economics (for the formal proof see e.g.,\nMas-Colell/Whinston/Green 1995, ch. 16). Pareto efficiency means that\nno individual’s position in terms of satisfaction of her\npreferences can be improved without reducing another\nindividual’s position, i.e. there is no waste caused by unused\npossibilities of bargaining. The strict mathematical conditions of the\nfirst theorem of welfare economics never hold in practice. But the\ngeneral equilibrium model embodies two arguments about markets that\nexplain why they can spur economic growth, and these can also be\napplied to real markets. The first can be called the\n“coordination argument” (cf. Roemer 2012): the price\nsystem can transmit complex information about people’s\npreferences in decentralized ways, which allows for the allocation of\ngoods and services to where they are most wanted. The emerging\nspontaneous order satisfies social needs in better ways than could be\nachieved by central planning (see notably von Hayek 1945). Market\nprices serve as an instrument for determining the opportunity costs of\ncertain uses of resources, which also allows for comparisons of the\ndifferent sets of resources individuals hold (see Dworkin 2000, ch. 1\nand 2). \n\nThe second argument is that markets fuel individuals’ energies\nbecause they give them incentives to find socially useful ways in\nwhich to use their talents. As Adam Smith’s famous (if often\nabused) quote goes: “It is not from the benevolence of the\nbutcher, the brewer, or the baker, that we expect our dinner, but from\ntheir regard to their own interest” (WN I.II.2). Smith’s\naim is not to give an account of human nature as fundamentally\negoistic. Rather, he points out that markets tap a source of\nmotivation that goes beyond the benevolence that people show within a\nsmall circle of family members and friends. Their self-interest\nconnects individuals to a much wider range of exchange partners, which\nallows for a greater division of labor and hence more efficient\nproduction. Defenders of markets also hold that they support\ninnovation because they give individuals the possibility of using new\ntechniques and new combinations of factors of production, and they\nprovide capital for entrepreneurs and inventors. This leads to a\ndynamic process of “creative destruction” that helps raise\nthe standard of living (Schumpeter 1942, who popularized this Marxist\nterm).\n\nThe arguments from efficiency and growth do not, as such, say anything\nabout the distribution of income and wealth that is achieved\nin a market economy. A situation can be Pareto efficient while at the\nsame time being extremely unequal (cf. e.g., Sen 1973). Sometimes one\nfinds additional pro-market arguments to the effect that the wealth\ncreated by markets automatically “trickles down” to the\npoorer layers of society. This can happen, for example, when the rich\nbuy goods or services the production of which creates employment for\nthe poor (as argued by Smith in 1976b [1759] IV.I.10], or when\ninnovations first made for luxury goods are later adopted in the mass\nmarket. It is not clear, however, under what conditions this happens.\nAs a matter of fact, market economies exist in egalitarian and less\negalitarian societies. Surrounding institutions play a major role in\ndetermining the degree of inequality that results from them. One can\nargue, however, that well-designed markets can contribute to making\nthe pie of a national economy larger than it would otherwise be, and\nthat the additional wealth can be redistributed through taxation or\nother measures. Then markets, in combination with other institutions,\ncan potentially be justified vis-à-vis non-market-institutions\nby their distributive effects, for example along the lines of\nRawls’ “difference principle”. According to this\nprinciple inequalities can be justified if they are “to the\ngreatest benefit of the least advantaged members of society”\n(1999, 5–6). If one chooses this justification for markets, the\ndesign of institutions and the degree to which income and wealth\nshould be redistributed depend not only on one’s normative\nposition, but also on one one’s assumption about which regime in\nfact makes the poorest members of society best-off. Such an\ninstrumental defense of markets can be found in many theories of what\nFreeman (e.g., 2011) calls the “high liberal” (in contrast\nto the “classical liberal”) tradition.\n3.2 Criticisms of markets\n\nNumerous arguments have been brought forward against markets, either\nin order to reject them altogether or in order call for their\nlimitation. One of the main criticisms of relying on markets to\norganize economic life points to their unequal outcomes, and the\npoverty – understood in absolute or relative terms – they\ncan create. In the 19th century, this concerned in\nparticular those members of society who did not own the means of\nproduction and therefore had to sell their labor to earn an income.\nDuring the industrial revolution a large percentage of the laboring\nclasses turned into a proletariat that, in Marx’ and\nEngels’ famous words, had “nothing to lose but its\nchains” [Communist Manifesto, 1848]. The ability of\nmarkets to be a “tide that lifts all boats” (a phrase\nattributed to J.F. Kennedy) has thus been questioned at least since\nthe 19th century. Critics have called for a more equal\ndistribution of resources in society. Often, this criticism was\ncombined with the call for a complete overthrow of the capitalist\nsystem, which was seen as self-undermining because of the ever-greater\ndivisions it created; this debate has been revived by the publication\nof Piketty (2014) and the ensuing controversies about diverging\ntendencies in capitalist societies.\n\nTo this criticism defenders of markets can reply by questioning the\nvalue of equality of outcomes. What is more difficult for them to\nreject – because their own arguments often emphasize rights and\nliberties – is the charge that the inequalities created by\nunregulated markets can go so far as to seriously limit the\npossibility of making use of one’s rights and liberties (see\nalso Rawls 1971, sect. 32). In a society in which most goods and\nservices are distributed through markets, those who do not have the\nmeans for purchasing them can be said to be free only in a very\nrestricted sense. Even relative (in contrast to absolute) poverty can\nlead to various forms of social exclusion. A lot here depends on how\none understands the notions of freedom and coercion, but in some\nsituations it is plausible that a lack of resources subjects\nindividuals to coercion, not least because it is the enforcement of\nother persons’ property rights that hinders their\naccess to resources (Cohen 1995, Otsuka 2003, Waldron 1993, Widerquist\n2013). As Satz (2010, esp. ch. 4) argues, the vulnerability of agents\nwhose choice is limited by their dire situation, as well as the\n“weak agency” of individuals who are poorly informed and\ndepend on other people’s decision, can therefore be reasons for\nlimiting free markets. In the 19th century, the asymmetry\nin bargaining power between workers and capitalist was at the heart of\nthe debate, and it still plays an important role in many countries. In\naddition, individuals with low human capital, with psychological\nafflictions, or with a problematic legal status (e.g., illegal\nmigrants) are especially vulnerable in markets. The idea of markets as\nmechanisms of social coordination is based on a picture of all\nindividuals as sovereign, fully informed, and fully rational choosers.\nWherever this is not the case, markets can lead to the exploitation of\nvulnerable individuals by others. These arguments do not necessarily\nimply a complete rejection of markets, but they raise questions about\nthe wider institutional framework in which they are embedded. Possible\nremedies to these problems can either aim at regulating markets or at\ncomplementing them by institutions that put individuals on a more\nequal footing when they enter into exchange relationships (cf. 4.2\n below).[5]\n\nThe idea that markets have anything to do with “desert”\nhas also been criticized, especially from the perspective of Marxian\ntheories of exploitation. They hold that, to the contrary, laborers\nare systematically deprived of their rightful contribution, as their\nwages are lower than the value they create through their labour (e.g.,\nMarx, Capital, vol. I, ch. 7–8; for a discussion see\ne.g., Buchanan 1985, 87–95). As has also been pointed out, the\nidea of desert can easily serve as an ideological smokescreen for\nthose who are successful in markets (cf. e.g., Hayek 1978, 74f.).\nMarkets have been criticized for cementing inequality and social\ndivision, thus undermining equality of opportunity (cf., e.g., Barry\n2005, parts II-IV). This leads to the question whether other\ninstitutions, for example a system of public education, can help to\nmitigate these problems, so that a combined system could be\njustified.\n\nThe ability of markets to deliver efficient outcomes when the goods in\nquestion are private goods has seldom been questioned by their\ncritics. But even friends of markets admit that they do not lead to\nefficient outcomes in cases of \"market failure\", specifically when\nthere are external effects or public goods. External effects are\neffects on third parties that are not captured in property rights, for\nexample air pollution or CO2 emissions. Public goods are goods that\nare non-excludable (it is not possible to effectively exclude\nindividuals from their use) and non-rivalrous (the possibility of use\nby one individual does not reduce the possibility of others using it)\n(see Mas-Colell/Whinston/Green 1995, ch. 11). An example for a public\ngood is public security: if it is provided, individuals cannot be\nexcluded from it, and the fact that more individuals enjoy it does not\nreduce its value for others. Therefore, no individual has sufficient\neconomic incentives to provide it; it has to be provided by the state.\nCritics of markets often hold that situations that include external\neffects or public goods are much more widespread than defenders of\nmarkets admit, including not only environmental but also social\nproblems. With regard to externalities, economists often point to\nCoase’s famous theorem that holds that when there are no\ntransaction costs, problems of externalities can be overcome through\nbargaining, independent of the initial distribution of property rights\n(1960). In reality, however, transactions are often extremely\ndifficult and costly, especially when multiple agents with differing\ninterests are involved. This makes the applicability of this theorem\n– and hence the defense of market solutions in such cases\n– problematic. Another problematic case is that of\n“positional goods” (Hirsch 1976), i.e. goods the value of\nwhich depends on their relative position in comparison to what other\nhave. A case in point are expensive houses that people desire for the\nsake of their status rather than their intrinsic qualities: they want\nto have a house that has a certain size relative to the houses of\nothers. Positional goods are scarce by definition: only 10% of houses\ncan be in the top 10% of the market. Competition for them is thus a\nzero-sum game: it is a “rat race” in which everyone keeps\nthe same relative position if everyone moves up by the same amount.\nThis is why some theorists argue that the externalities caused by this\nkind of competition justifies regulatory measures (see e.g., Frank\n2005; for a discussion of positional goods from an egalitarian\nperspective see also Brighhouse & Swift 2006, for an account in\nterms of recognition theory see Claassen 2008).\n\nA broader question that can be raised in this context is the question\nof “efficiency of what?” (cf. also Satz 2010, 33f.). As\ncritics of markets point out, markets may be efficient in satisfying\npeople’s wants, but sometimes this may happen because they\nactually shift people’s preferences towards things that can\neasily (which often means: profitably) be provided in markets. These\nare not necessarily the preferences people would choose it they\nreflected about which preferences they would like to have (cf. e.g.,\nGeorge 2001, who uses the metaphor of “preference\npollution”). Economic models of markets usually take\nindividuals’ preferences as given, which hides a whole range of\nquestions that have been raised about markets in this respect: how do\nmarkets change individuals, their relation to one another, and their\nrelation to certain goods and values? Among Marxist theorists, the\nterm “alienation” is used to describe the phenomenon of\nindividuals being, or feeling, separated from things that should\nbelong together. For example, if workers have to sell their labor to\nthe owners of the means of production, they are said to be alienated\nfrom their work and its products, as well as from other human beings\nand the being of the human species, (Marx [1844], I; for a recent\naccount of the notion of alienation see Jaeggi 2014).\n\nWith regard to human relations, market societies have been accused of\nundermining community and solidarity, as markets are based on purely\ninstrumental, fast-changing relations, so that “all that is\nsolid melts into air” (Marx/Engels, Communist\nManifesto; for a contemporary account see e.g., Lane\n 1991).[6]\n The “creative destruction” and competition that take\nplace in markets may spur innovation, as their defenders hold, but\nthey also destroy established social ties and traditions (cf. Polanyi\n1944) and might undermine solidarity (Hussain 2021). This thought\nseems to play a role in the communitarian critique of the liberal view\nof human nature (e.g., MacIntyre 1984, cf. Bell 2012 for an overview).\nIn addition, the fact that markets build on self-interest has been\nsaid to make individuals more egoistic and materialistic. Such\narguments are the counterpart to the claim that markets make\nindividuals more social and moral, as held by their\ndefenders. An important aspect of this debate, which has also been\nexplored empirically, is the tendency of monetary incentives to\n“crowd out” the intrinsic motivation to act out of\naltruism or for the sake of the public good (cf. e.g., Titmus’\nfamous study on paid and unpaid blood donations (1971); Frey (e.g.,\n2007); see also Gneezy/Rustichini’s study on how a fine for\nlate-coming parents at a day-care center increased their numbers\nbecause it was seen as a price (2000)).\n\nThe strength of such arguments depends on whether individuals can and\ndo restrict their “market attitude” to the economic\nsphere, or whether this attitude comes to dominate society as a whole.\nFor example, can it be kept at a distance from private relationships,\nor do individuals develop a market attitude with regard to intimate\nrelationships as well, as sociologist Eva Illouz argues (e.g., 2012)?\nPressure on the private sphere not only comes from people’s\nconscious or unconscious transmission of certain ways of thinking, but\nalso from the increasing number (or at least the perceived increase)\nof monetary transactions that concern this sphere, for example in the\nform of paid child care or surrogate motherhood. This has led critics\nof markets to call for limitations of their sphere of influence in\norder not to “commodify” goods whose meaning is closely\ntied to values such as intimate relations, individual flourishing, or\nchild-parent relationships (cf. e.g., Radin 1996; Anderson 1993;\nSandel 2012; for a critical discussion see Satz 2010, 80ff.). As\nAnderson emphasizes, the larger question behind this issue is how a\nsociety can accommodate a plurality of goods that are valued in\ndifferent ways (1993, esp. ch. 1 and 3). A similar strand of arguments\nconcerns the question of whether markets push people towards the\nconsumption of material rather than immaterial goods (see e.g., the\npopular account by Fromm 1976). If this is the case, they not only\n“pollute” their preferences, but also contribute to the\noverconsumption of natural resources and a variety of ecological\nproblems (e.g., Wright 2011, 70; Hardin 1968).\n\nRelated arguments concern the question of whether citizens can stand\nin an equal respectful relationship to one another if certain goods,\ne.g., votes or body parts, are traded in markets (Sandel 2012, 10ff.\ncf. also Satz 2010, ch. 3; on the ethics of vote buying, see the\nrelevant section of the entry on\n voting,\n on body parts see Phillips\n 2013,[7]\n on legal representation see Wilmot-Smith 2019, Agmon 2021). For\nexample, it has been argued that some institutions, e.g., schools, are\nsuch that disagreements should be settled by “voice”\nrather than “exit” (in Hirschman’s 1970 distinction;\nfor the example of schools see e.g., Anderson 1993, 162f.). Also, many\npolitical theorists argue that the political sphere of a democracy\nshould be seen as different from markets in that what is at stake are\nnot individual interests, but the public good (cf. e.g., Radin 1996,\nch. 14, who draws on John Dewey’s understanding of democracy).\nWhat such theories have in common is that they see society as composed\nof different social spheres – and, as Walzer puts it,\n“[t]he morality of the bazaar belongs in the bazaar”,\nwhereas exchanges in other social spheres should be blocked (1983,\n109). In many such cases, a combination of arguments applies,\nconcerning not only the character of goods, but also the vulnerability\nof some market participants. As Brennan and Jaworski (2015, 2016) have\nrecently argued, arguments about commodification that are based\nexclusively on the symbolic dimension of trading certain\ngoods are not convincing because these symbolic dimensions are\nculturally contingent. But many cases of commodification are not\npurely symbolically harmful, they combine symbolic and other harms. On\nthe other hand, as Satz (2010, e.g., 9) reminds us, the best answer to\nproblematic markets is not always to ban them as this might lead to\nblack markets or other evasion mechanisms. The question of\nalternatives, e.g., regulated markets or markets complemented by other\ninstitutions, often depends on the institutional framework within\nwhich markets take places. This will be considered in section 4\nbelow.\n3.3 “The market” versus different markets\n\nAs will have become clear, some arguments for and against markets\ndirectly respond to one another, whereas others have to be weighed\nagainst one another without being directly compatible. Many thinkers\nacknowledge the force of at least some arguments from both sides. They\ntake the line described in section 2 as “qualified\nendorsement” and argue for the market as one element\nwithin an institutional framework that can mitigate some of its more\nproblematic effects. It should be kept in mind, however, that\ndifferent markets can look very different with regard to the arguments\nlisted above. This raises the question of whether it is possible at\nall to say something general about the value of “markets”,\nrather than about specific markets in specific situations. A common\nproblem in the discussion about markets is the level of abstraction,\nas many abstract models make idealizing assumptions that do not hold\nin real life (see also Phillips\n 2008).[8]\n While there is nothing wrong as such with using abstract models, it\nis important to consider their limited validity in real life\ninstantiations. When comparing markets to other institutional\nsolutions, the comparison has to take place at the same level of\nabstraction. Otherwise one compares apples to oranges, e.g., when a\nvery imperfect market with great asymmetries of power is contrasted\nwith an idealized public bureaucracy, or when a market in which all\nindividuals are fully rational is contrasted with corrupt public\ninstitutions. It makes more sense to compare a reasonably\nwell-functioning market with a reasonably well-functioning\nbureaucracy. \n\nAnother problem in debates about markets is the following: If critical\narguments against markets are raised, defenders of markets sometimes\nhold that the ills should not be blamed on markets, but rather on the\nsurrounding institutions, because the conditions that would need to\nhold for markets to do their beneficial work are not fulfilled. For\nexample, when markets are criticized for leading to an overconsumption\nof natural resources, defenders of markets often point out that there\nare no full property rights for many environmental goods. If\nenvironmental goods had a price, it would be expensive to use them,\nand their owners would have incentives to treat them in responsible\nways (see e.g., Tomasi’s reply to the “tragedy of the\ncommons” (2012, 259ff.)). One might retort, however, that in\nmany cases having such property rights would not solve the problem,\nbecause the transaction costs of finding bargaining solutions would be\ntoo high. Such examples show that the value of concrete markets can\noften not be discussed in purely abstract terms – what they are\nand what effects they have crucially depends on the institutions that\nsurround them. These will be discussed next.\n4. Relations between markets and other institutions\n4.1 Preconditions for markets\n\nMost theorists agree that for markets to come into existence, certain\ninstitutions need to be in place. Central among these are property\nrights and the legal institutions needed for enforcing\n contracts.[9]\n The question of enforceable property rights plays as an important\nrole for evaluating markets in countries with weak governance\nstructures. There, the ability to enforce one’s rights can be\ndistributed very unequally, so that free markets can exacerbate these\nprevious injustices. The question of which property rights can be\nenforced is one of the main determinants (apart from outright bans) of\nwhich markets can exist in a society. For example, in most countries\none cannot sell oneself into slavery, as courts of law would not\nenforce such a contract. An area where this question about property\nrights and hence marketability is fiercely contested are intellectual\nproperty rights, where some people argue that our traditional notions\nof property rights are not suitable for goods that can be reproduced\nat extremely low costs, such as digital contents (e.g., Shiffrin 2007;\nBoutang 2011, ch. 4).\n\nWhile the existence of property rights – and hence of a minimal\nstate that enforces them – has been recognized as a precondition\nfor markets even by most libertarian thinkers, other preconditions are\noften not made explicit in economic approaches to markets, and are\nmore controversial. As has been emphasized in particular by the\nmembers of the German “Freiburg School” of\n“ordoliberalism”, for markets to remain competitive there\nneed to be anti-trust laws that prevent cartels and monopolies (see\ne.g., Eucken 1939; on how this view was replaced by more\nthorough-going laissez-faire views in the US see Crouch 2011, ch. 3).\nSociologists have long pointed out the crucial importance of trust for\nthe existence of market exchanges, as contracts in markets often\ninclude implicit elements that cannot be spelled out in terms of\nproperty rights and hence not be legally enforced (see e.g., the\nclassic account by Durkheim 1997 [1893] or more recently Beckert\n2002). Certain forms of social ethos, e.g., a commitment to keep\npromises, can facilitate market transactions (Rose 2011). Research in\neconomic sociology also puts emphasis on the dependence of markets on\nother social relations. For example, Granovetter shows how market\nrelations are often embedded in personal relationships, such as the\nrelationships between the experts for certain technologies in\ndifferent companies (1985). Fligstein emphasizes how the rules set by\nstates, including, for example, rules about governance structures and\nother regulatory institutions, influence the behavior of companies in\nmarkets and make markets “a social construction that reflect the\nunique political-cultural construction of their firms and\nnations” (1996, 670; on the “legal construction” of\nfinancial markets see Pistor 2013). Some sociologists, notably Callon,\nalso argue that markets depend on the performative power of economic\ntheories about what markets are: these help individuals to frame\nsituations as market exchanges (e.g., 1998). For example,\nMacKenzie argues that market participants in certain financial markets\nuse theoretical models to determine their own behavior (e.g., 2009).\nSuch examples make particularly clear that the markets we know are not\nsomething independently “given”, but depend on other norms\nand institutions in society, and sometimes even on certain forms of\ninformation technology. Even the ability of markets to deal with\ndecentralized knowledge (Hayek 1945) often works in conjunction with\n“epistemic infrastructures” for markets provided by other private\nor public institutions (Herzog 2020). \n4.2 Institutions that supplement or correct market outcomes\n\nMany political philosophers take (some of) the criticisms raised\nagainst markets (cf. 3.2 above) seriously. They therefore argue that\nmarkets can only be justified if they coexist with other institutions\nthat supplement or correct their outcomes. These institutions can be\nsubdivided into different categories. Economists typically use the\nconcept of “market failure” to describe cases where one or\nmore conditions for efficient market outcomes are not met, e.g., when\nthere are externalities or public goods (see e.g., Bator 1958; Cowen\n1988). To improve outcomes in such cases can require the regulation of\nmarkets (e.g., by prohibiting negative externalities such as the\nemission of harmful pollutants) or the provision of public goods by\nstate institutions. Rules and regulations might also be needed –\nand can be justified from the point of view of Pareto efficiency\n– in cases of what Basu (2007) has called the “large\nnumber problem”: some form of behavior, although harmless in\nitself, may have a negative impact if committed by a large number of\npeople. The same can be true when there is more than one equilibrium\nin a market and it is desirable to move to one of them rather than\nanother, e.g., from an equilibrium with child labor to one without\n(Basu / Van 1998). One might also argue that the macro-economic\nstabilization of markets, for example through the central bank or\nthrough measures that raise demand in recessions (cf. Keynes 1936),\nbelongs into the category of provision of public goods. The\neffectiveness of such measures, however, is deeply contested among\neconomists.\n\nA second broad category of institutions that supplement or correct\nmarket outcomes can be summarized under the term “welfare\nstate”. It attempts to provide responses to criticisms of\nmarkets concerning poverty, unequal outcomes, and a lack of equality\nof opportunity. The most basic tasks of the welfare state are to\nsecure the socioeconomic rights (cf. e.g., Marshall 1992) of citizens\nwho cannot earn an income in the labor market, and to provide some\ndegree of equality of opportunity. Many political philosophers have\nemphasized the importance of redistribution for these purposes (see\nalso Fleurbaey 2012); the emphasis on redistribution has almost\novershadowed questions about the direct distributive\nconsequences of different markets and how these might be influenced by\nregulation (but see Dietsch 2010). Welfare state institutions can take\non different forms, and can be organized in different ways, from a\nminimum of care for the destitute to a large array of social services,\nsuch as public education and a public health service. Recently, some\nthinkers have even argued for the introduction of an unconditional\nbasic income for individuals, to make sure individuals are not at the\nmercy of those who control the access to resources (e.g., Van Parijs\n1995, Widerquist 2013). Decisions about such institutions are often\ntaken to be trade-offs between the efficiency of markets and the\ndesideratum of some degree of equality of income and wealth. As Okun\nwrites: “Any insistence on carving the pie into equal slices\nwould shrink the size of the pie” (1975, 48). It is not clear,\nhowever, whether this picture adequately describes economic reality.\nIt is often based on the assumptions that higher taxes stifle\npeople’s motivation to work hard. But whether this is true\ndepends, among other things, on the question of whether individuals\nare mainly motivated by the desire to earn money or whether they might\nalso have an intrinsic motivation to provide certain goods and\nservices (cf. Roemer 2012). Some measures, such as a public education\nsystem that gives every child a chance to develop his or her talents,\nmight lead simultaneously to more equality and to a larger economic\npie, because the increase in human capital more than outbalances all\npossible losses in efficiency through the taxation that pays for the\neducation system (cf. also Okun 1975, 81ff.; on the efficiency of\nvarious non-market institutions see also Heath 2006). As a matter of\nfact, in some countries such as the Scandinavian countries a strong\nwelfare state coexists with a flourishing market economy, undermining\nclaims of mutual incompatibility. In addition to its role in\nredistribution, the welfare state can also have a wider, cultural\nmeaning: as Cunningham (2005) argues, it can help to overcome the fear\ncreated by the existential risks to which individuals are exposed in\npure market societies, and which might be an important factor behind\nthe allegedly more egoistic and more materialistic culture in such\nsocieties. For example, in a well-functioning welfare state\nindividuals do not have to maximize their income for the sake of\nsaving for periods of unemployment, but can participate in a social\nsystem that insures them against unemployment. A welfare state could\nalso encourage risk-taking by lessening the costs of failure, which\nmight spur innovation.\n [10]\n4.3 Problems with the dichotomy of “the market” versus “the state”\n\nThe relationship between the market and the state has traditionally\nbeen understood as a three-layered scheme, roughly as outlined in\nsections 4.1 and 4.2: 1) the state secures property rights and other\npreconditions of markets; 2) markets take place within this framework\nand deliver efficient outcomes; 3) the state corrects market failures\nand deal with other problems through complementary institutions such\nas the welfare state. This model is presupposed in many debates about\nmarkets. But there are reasons to think that it is insufficient, both\ndescriptively and normatively, for capturing today’s\nrealities.\n\nThere is, first of all, the problem of markets having become global,\nwhereas the political framework is still largely based on nation\nstates. This can lead to enforcement deficits, but also puts pressure\non states to forego stricter regulations or higher taxation because\ncapital, especially financial capital, will leave the country and\nescape to so-called “tax havens” (Dietsch 2015). In recent\nyears, there has been increased interest in international\nmarkets: What distinguishes them from domestic markets; for example,\ndo the immense inequalities of power and the different institutional\nframeworks in different countries mean that they need to be\nconceptualized differently? How could they be regulated and\nsupplemented by other institutions in order to achieve more global\njustice? How could the community of states, or at least groups of\nstates, cooperate to achieve this? These questions are embedded in the\nwider debate about global justice (cf. e.g., Pogge 2002; Caney 2005;\nBrock 2009, see also Blake 2008). This debate turns, for example, on\ninstitutions such as the World Trade Organization that could enforce\ncertain standards on labor conditions (see. e.g., Barry/Reddy 2008),\nor on how the trade in natural resources could be embedded in\ninstitutions that prevent the “resource curse” that haunts\ncountries with rich natural resources but weak governance structures\n(see e.g., Wenar 2015). Such proposals ask how the institutions that\nstructure international markets could be changed in ways that make the\ngains from trade mutual and give everyone a fair share (see also James\n2005; Risse 2007; Kurjanska/Risse 2008; Christensen 2017).\n\nSecondly, problems of market failures and market instabilities seem to\nbe much more pervasive than has often been assumed, especially in\ncomplex, interrelated markets such as financial markets (cf. e.g.,\nMinsky 1986, esp. ch. 9; on financial markets in general see also\nHerzog 2017). This means that it is far more difficult for states to\nregulate them. It has to do with the role of psychological effects\nsuch as herding (cf. e.g., Akerlof and Shilling 2003) and maybe also\nwith massive imbalances of power within such markets, which are often\ncaused by asymmetries of information or barriers to market entry. The\nconsequences of regulatory changes are hard to predict when there are\nnonlinear causal chains and the reaction of “the markets”\nis difficult to anticipate, so that it is unclear how to evaluate\ntheir impact on society. This raises the question of whether states\nhave to use a more flexible approach to regulating markets, or whether\nthere might be ways of reducing the fragility of the global economic\nsystem.\n\nA third ground on which the dichotomy between “the market”\nand “the state” has been criticized is that it obfuscates\nthe influence of powerful economic agents, e.g., large-scale\ncorporations, on political decision-making. As some authors have\nargued, some capitalist countries, notably the United States, are\ncoming close to a situation in which it is not the state that\nregulates markets. Rather powerful agents among both the corporate and\nthe political elites set the rules of the game to their own advantage,\nat the costs of society at large (e.g., Crouch 2011).\n\nAll these points are particularly urgent because the problems of\nlimited natural resources and climate change raise issues about the\nability of the market-cum-political-framework as we know it to steer\ntowards a more sustainable path. Because many of the activities that\nharm the natural environment take place as market activities,\nregulating them will often require a regulation of markets. Given how\ndifficult it is to establish such a regulatory framework on a global\nscale, however, voluntary action by individual market participants\nalso seems to be called for, e.g., by buying sustainably grown\nproducts and cars with a low carbon emission. Such voluntary actions\nshould, ideally, create incentives for companies to find innovative\nsolutions to reduce resource consumption and energy consumption (cf.\nalso 5.2 below). Although they are certainly part of the problem,\nmarkets might then also be part of the solution to the challenges\nraised by poverty, resource depletion, and climate change.\n4.4 The interrelatedness of institutions\n\nThe interrelatedness of markets and other institutions is also\nconfirmed by sociological research on the “varieties of\ncapitalism” and similar approaches. They argue that rather than\nthere being one “best” set of institutions, there are\ncertain sets of institutions in the economic and the political realm\nthat fit together better than others: they form “institutional\ncomplementarities”. As Hall and Soskice show, one can\ndistinguish “liberal” from “coordinated”\nmarket economies in which mutually related mechanisms reign with\nregard to areas such as industrial relations between employers and\nemployees (or unions), institutions for vocational training and\neducation, corporate governance, or inter-firm relations. In liberal\nmarket economies, as they predominate in Anglo-Saxon countries, market\nmechanisms are much more pervasive; for example, employment contracts\nare typically shorter. In coordinated market economies, as one finds\nthem for example in continental Europe, other forms of coordination,\ne.g., collective bargaining, play a greater role (Hall and Soskice\n2001). Such interrelations, which can be neglected in highly abstract\ntheorizing, should be taken into account when political philosophers\naddress concrete questions about markets in “non-ideal”\ntheory (as is done, for example, in Keat 2008). Philosophers have\noften focused on rules and regulations while taking individuals’\npreferences as given, implicitly adopting an “economic”\nperspective on markets. But a “sociological” perspective,\nin which the generation of preferences and the wider social context\nare also taken into account, allows one to see other ways in which the\noutcomes of markets can be changed. Changes in different institutions,\nin individuals’ preferences, and in the “ethos” that\nrules in certain markets should, ideally, go hand in hand and be\nconsistent with one another. It is unlikely that the current problems\nin which markets are involved, such as global justice and climate\nchange, can be solved by relying only on one of these instruments. The\ndesirability and feasibility of different market and non-market\narrangements for addressing these issues, together with questions\nabout the international dimension of markets and how they can be\ngeared towards normative goals such as human flourishing and greater\nequality, are among the most important contemporary research areas\nabout markets.\n5. Related themes\n\nWhen philosophers think about markets and their place and role in\nsociety, they need to be aware of the fact that theories\nabout markets can sometimes carry their own implicit value\njudgments. This is why they need to be sensitive to methodological\nquestions of the scientific discipline that focuses on markets, i.e.\neconomics. When it comes to normative conclusions, political\nphilosophers should also take into account the arguments brought\nforward by business ethicists, who discuss the moral duties of market\nparticipants. As Heath et al. (2010) have recently argued, debates in\nbusiness ethics and in political philosophy would benefit from being\nmore closely integrated, and this holds in particular for debates\nabout markets. In this final section, these two related themes are\nbriefly discussed. \n5.1 Methodological questions in economics\n\nIt is important to distinguish methodological issues in economics (see\nHausman 2008) from normative questions. However, they are often\nintertwined in intricate\n ways.[11]\n One example concerns assumptions about human rationality: standard\neconomic models assume perfect rationality, which excludes problems\nsuch as weakness of the will, so that normative criticisms of markets\nthat build on the ability of more rational market participants to\nexploit the weaknesses of less rational market participants cannot be\nraised within this framework. More generally, plausible arguments\nchallenge the possibility of value-free economic theorizing (see e.g.,\nMongin 2006). This means that philosophers who want to discuss\nnormative issues about markets need to take care to make explicit the\nnormative assumptions that might enter their view of these markets\nbecause they are built into the economists’ models. While the\nmainstream of economic theorizing in the last decades has used a\nrational choice methodology, new approaches, for example, behavioral\neconomics or institutional economics, have worked with different\nassumptions, raising new methodological challenges. For example,\nexplorations of the importance of norms of fairness in economic\ncontexts (e.g., Kahneman/Knetsch/Thaler 1986; Fehr/Schmidt 1999) raise\nquestions about the relation between the fairness norms favored by\npolitical philosophers and the norms observable in people’s\nbehavior. Another interesting area are “nudges” that are\nsupposed to lead people to more rational or more socially desirable\nbehavior by changing institutional defaults (e.g., Thaler/Sunstein\n2008), which leads to philosophical questions about paternalism.\n5.2 Business ethics and Corporate Social Responsibility\n\nBusiness ethics and discussions of corporate social responsibility are\nconcerned with the behavior of individuals and especially corporations\nin markets (see Marcoux 2008). The scope of such approaches depends to\nsome degree on the legal and cultural framework in which corporations\noperate. Arguably, the increased interest in these topics in the last\ndecades also has to do with the unwillingness or inability of states\nto regulate the behavior of firms more strongly (cf. also Smucker\n2006). One might therefore think that such measures are only\ninsufficient solutions for problems that states fail to solve. As\nsuch, however, they play a particularly important role for\ninternational markets, because the regulatory problems at a global\nlevel are unlikely to be overcome soon. Initiatives such as the UN\nGlobal Compact aim at introducing basic moral standards into\nglobal markets.\n\nHistorically, conceptions of “doing business” have long\nbeen accompanied by ideas about certain moral norms, often captured in\nterms of the “honor” of the merchant (cf. e.g., Smith 1978\n[1762/66], 538f.). Even Friedman, in his famous article in which he\nclaims that “The Social Responsibility of Business is to\nIncrease its Profits”, holds that business people should do this\n“while conforming to the basic rules of society, both those\nembodied in law and those embodied in ethical custom”\n(1970, emphasis added). As Heath argues, in pursuing profits firms\nhave a responsibility not to exploit market failures such as\ninformation asymmetries, which serves both ethics and efficiency\n(2014; for a critical discussion see e.g., Moriarty 2020). An\nimportant question that connects the topics of business ethics and\ncorporate social responsibility to the normative evaluation of markets\nis whether markets reward or punish ethical behavior, i.e. whether\nbusiness ethics is a cost or a strategic advantage for companies (cf.\ne.g., Porter/Kramer 2006 for how the latter might be achieved). This\ndepends on their institutional embedding, but also on the\nconsumers’ “ethics of consumption”, which is an\nimportant new field of research on markets (see e.g., Crocker/Linden\n1998; Schwarz 2010). The basic idea is that if consumers express not\nonly their self-interested, but also their moral choices in\nmarkets, markets can become instruments for making societies more just\nand economies more sustainable. At the same time, consumer-driven\nstrategies such as ethically motivated boycotts may need to fulfil\ncertain criteria in order not to undermine democratic legitimacy\n(Hussain 2012, Berkey 2021 and the literature quoted there). In many\nsocieties, these are ongoing processes, and it remains to be seen how\neffective they can be in steering the global economy onto a more just\nand more sustainable path.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Acemoglou, D., and J. Robinson, 2012, <em>Why Nations Fail: The\nOrigins of Power, Prosperity, and Poverty</em>, New York: Crown\nBusiness.",
                "Agmon, S., 2021, “Undercutting justice. Why legal\nrepresentation should not be allocated by the market”,\n<em>Politics, Philosophy &amp; Economics</em>, 20(1), 99–123.",
                "Akerlof, G. A., and R. J. Shiller, 2009, <em>Animal Spirits: How\nHuman Psychology Drives the Economy, and Why it Matters for Global\nCapitalism</em>, Princeton: Princeton University Press.",
                "Anderson, E., 1992, <em>Values in Ethics and Economics</em>,\nCambridge, MA: Harvard University Press.",
                "–––, 2017, <em>Private Government. How Employers\nRule Our Lives</em> (<em>and Why We Don’t Talk about It</em>),\nPrinceton: Princeton University Press.",
                "Aristotle, <em>Politics</em>, in <em>The Complete Works of\nAristotle</em>, J. Barnes (ed.), Princeton: Princeton University\nPress, 1984.",
                "Arneson, R.J., 2008, “Rawls, Responsibility, and\nDistributive Justice”, in <em>Justice, Political Liberalism, and\nUtilitarianism: Themes from Harsanyi and Rawls</em>, M. Fleurbaey and\nJ.A. Weymark (eds.), Cambridge: Cambridge University Press,\n80–107.",
                "Arnold, S., 1987, “Why Profits are Deserved”,\n<em>Ethics</em>, 97: 387–402.",
                "Bardhan, P., and J. E. Roemer (eds.), 1993, <em>Market Socialism:\nThe Current Debate</em>, New York: Oxford University Press.",
                "Barry, B., 2005, <em>Why Social Justice Matters</em>, Cambridge:\nPolity.",
                "Barry, C., and S. Reddy, 2008, <em>International Trade and Labor\nStandards: A Proposal for Linkage</em>, New York: Columbia University\nPress.",
                "Basu, K., 2007, “Coercion, contract and the limits of the\nmarket”, <em>Social Choice and Welfare</em>, 29:\n559–579.",
                "Basu, K., and P.H. Van, 1998, “The Economics of Child\nLabour”, <em>The American Economic Review</em>, 88(3):\n412–427.",
                "Bator, F.M., 1958, “The Anatomy of Market Failure”,\n<em>Quarterly Journal of Economics</em>, 72(3): 351–379.",
                "Becker, G., 1976, <em>The Economic Approach to Human\nBehavior</em>, Chicago: University of Chicago Press.",
                "Becker, S. O. and L. Woessmann, 2009, “Was Weber Wrong? A\nHuman Capital Theory of Protestant Economic History”,\n<em>Quarterly Journal of Economics</em>, 124 (2): 531–596.",
                "Beckert, J., 2002, <em>Beyond the Market. The Social Foundations\nof Economic Efficiency</em>, Princeton: Princeton University\nPress.",
                "Bell, D., 2012, “Communitarianism”, <em>The Stanford\nEncyclopedia of Philosophy</em> (Spring 2012 Edition), Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/spr2012/entries/communitarianism/\">https://plato.stanford.edu/archives/spr2012/entries/communitarianism/</a>&gt;.",
                "Berkey, B., 2021, “Ethical Consumerism, Democratic Values,\nand Justice”, <em>Philosophy and Public Affairs</em>, 49(3):\n237–274.",
                "Berman, S., 2006, <em>The Primacy of Politics: Social Democracy\nand the Making of Europe’s Twentieth Century</em>, Cambridge:\nCambridge University Press.",
                "Blake, M., 2008, “International Justice”, <em>The\nStanford Encyclopedia of Philosophy</em> (Winter 2008 Edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2008/entries/international-justice/\">https://plato.stanford.edu/archives/win2008/entries/international-justice/</a>&gt;.",
                "Blaug, M., 1996, <em>Economic Theory in Retrospect (Fifth\nEdition)</em>, Cambridge: Cambridge University Press.",
                "Boutang, Y. M., 2011, <em>Cognitive Capitalism</em>, transl. by E.\nEmery, Cambridge: Polity Press.",
                "Bowles, S., 2011, “Is Liberal Society a Parasite on\nTradition”, <em>Philosophy &amp; Public Affairs</em>, 39(1):\n46–81.",
                "Brennan, J., and P. M. Jaworski, 2015, “Markets without\nSymbolic Limits”, <em>Ethics</em>, 39(1): 46–81.",
                "–––, 2016, <em>Markets without Limits: Moral\nVirtues and Commercial Interests</em>, London: Routledge. ",
                "Brighhouse, H., and A. Swift, 2006, “Equality, Priority, and\nPositional Goods”, <em>Ethics</em>, 125(4):\n1053–1077.",
                "Brock, G., 2009, <em>Global Justice: A Cosmopolitan Account</em>,\nOxford: Oxford University Press.",
                "Buchanan, A. E., 1985, <em>Ethics, Efficiency, and the\nMarket</em>, Towota, NJ: Rowman &amp; Allanheld.",
                "Buchanan, J., 1975, <em>The Limits of Liberty: Between Anarchy and\nLeviathan</em>, Chicago: University of Chicago Press.",
                "Callon, M., 1998, “Introduction. The embeddedness of\nEconomic Markets in Economics”, in <em>The Laws of the\nMarket</em>, Oxford: Blackwell Publishers/The Sociological Review, pp.\n1–57.",
                "Caney, S., 2005, <em>Justice Beyond Borders: A Global Political\nTheory</em>, Oxford: Oxford University Press.",
                "Camerer, C., with G. Loewenstein, and M. Rabin (eds.), 2003,\n<em>Advances in Behavioral Economics</em>, Princeton: Princeton\nUniversity Press.",
                "Carens, J. H., 1981, <em>Equality, Moral Incentives, and the\nMarket. An Essay in Utopian Politico-Economic Theory</em>,\nChicago/London: Chicago University Press.",
                "Christensen, J., 2017, <em>Trade Justice</em>, Oxford: Oxford\nUniversity Press.",
                "Ciepley, D., 2013, “Beyond Public and Private:Toward a\nPolitical Theory of the Corporation”, <em>American Political\nScience Review</em>, 107(1): 139–158.",
                "Claassen, R., 2008, “The status struggle: A\nrecognition-based interpretation of the positional economy”,\n<em>Philosophy and Social Criticism</em>, 34: 1021–1049.",
                "–––, 2015, “Markets as Mere Means”,\n<em>British Journal of Political Science</em>, 47: 263–281.",
                "Coase, R. H., 1960, “The Problem of Social Cost”,\n<em>Journal of Law and Economics</em>, 3(1): 1–44.",
                "Cohen, G. A., 1979, “Capitalism, Freedom and the\nProletariat”, in <em>The Idea of Freedom. Essays in Honour of\nIsaiah Berlin</em>, A. Ryan (ed.), Oxford: Oxford University Press,\npp. 9–25.",
                "–––, 1995, <em>Self-Ownership, Freedom, and\nEquality</em>, Cambridge: Cambridge University Press.",
                "Cowen, T. (ed.), 1988, <em>Public Goods and Market Failures: A\nCritical Examination</em>, New Brunswick, NJ: Transaction\nPublishers.",
                "Crocker, D.A., and T. Linden (eds.), 1998, <em>Ethics of\nConsumption: The Good Life, Justice, and Global Stewartship</em>,\nOxford: Rowman &amp; Littlefield.",
                "Crouch, C., 2011, <em>The Strange Non-Death of\nNeo-liberalism</em>, Cambridge: Polity.",
                "Cunningham, F., 2005, “Market economies and market\nsocieties”, <em>Journal of Social Philosophy</em>, 36(2):\n129–142.",
                "Dietsch, P., 2010, “The market, competition, and\nequality”, <em>Politics, Philosophy &amp; Economics</em>, 9(2):\n213–244.",
                "–––, 2015, <em>Catching Capital–The Ethics\nof Tax Competition</em>, New York: Oxford University Press.",
                "Dorfman, A. and A. Harel, 2013, “The Case Against\nPrivatization”, <em>Philosophy &amp; Public Affairs</em>, 41(1):\n67–102",
                "Durkheim, E., 1997 [1893], <em>The Division of Labour in\nSociety</em>, L.A. Coser (ed.), New York: The Free Press.",
                "Dworkin, R., 2000, <em>Sovereign Virtue: The Theory and Practice\nof Equality</em>, Cambridge, MA: Harvard University Press.",
                "Ellerman, D., 2021, <em>Neo-Abolitionism. Abolishing Human Rentals\nin Favor of Workplace Democracy</em>, Cham: Springer.",
                "Emmett, R. B., (ed.), 2010, <em>The Elgar Companion to the Chicago\nSchool of Economics</em>, Cheltenham: Edward Elgar.",
                "Eucken, W., 1939, <em>Die Grundlagen der\nNationalökonomie</em>, Jena: G. Fischer.",
                "Fabre, C., 2006, <em>Whose Body is it Anyway?: Justice and the\nIntegrity of the Person</em>, Oxford: Oxford University Press.",
                "Fehr, E., and K. M. Schmidt, 1999, “A theory of fairness,\ncompetition, and cooperation”, <em>The Quarterly Journal of\nEconomics</em>, 114 (3): 817–86",
                "Ferreras, I., 2017, <em>Firms as Political Entities. Saving\nDemocracy through Economic Bicameralism</em>, Cambridge: Cambridge\nUniversity Press.",
                "Fleurbaey, M., 2012, “Economics and Economic Justice”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Summer 2012\nEdition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2012/entries/economic-justice/\">https://plato.stanford.edu/archives/sum2012/entries/economic-justice/</a>&gt;.",
                "Fligstein, N., 1996, “Markets as Politics: A\nPolitical-Cultural Approach to Market Institutions”,\n<em>American Sociological Review</em>, 61 (4): 656–673.",
                "Frank, R. H., 2005, “Positional Externalities Cause Large\nand Preventable Welfare Losses”, <em>American Economic\nReview</em>, 95(2): 137–141.",
                "Fraser, N., and A. Honneth, 2003, <em>Redistribution or\nRecognition?: A Political-Philosophical Exchange</em>, London:\nVerso.",
                "Freeman, S., 2001, “Illiberal Libertarians: Why\nLibertarianism Is Not a Liberal View”, <em>Philosophy &amp;\nPublic Affairs</em>, 30(2): 105–151.",
                "–––, 2011, “Capitalism in the classical\nand high liberal traditions”, <em>Social Philosophy and\nPolicy</em>, 28: 19–55.",
                "Friedman, D., 1973, <em>The Machinery of Freedom. Guide to a\nradical capitalism</em>, New York: Harper &amp; Row.",
                "Friedman, M., 1962, <em>Capitalism and Freedom</em>, Chicago:\nUniversity of Chicago Press.",
                "–––, 1970, “The Social Responsibility of\nBusiness is to Increase its Profits”, <em>The New York Times\nMagazine</em>, September 13, 1970.",
                "Frey, B., 1997, <em>Not just for the money. An economic theory of\npersonal motivation</em>, Cheltenham: Edward Elgar.",
                "Fromm, E., 1976, <em>To Have or to Be?</em>, London/New York:\nContinuum.",
                "Fumagalli, R., 2020, “Buyer Beware: A Critique of Leading\nVirtue Ethics Defenses of Markets”, <em>Journal of Social\nPhilosophy</em>, 51(3): 457–483.",
                "George, D., 2001, <em>Preference Pollution. How Markets Create the\nDesires We Dislike</em>, Ann Arbor: University of Michigan Press.",
                "Gneezy, U., and A. Rustichini, 2000, “A Fine is a\nPrice”, <em>Journal of Legal Studies</em>, XXIX:\n1–17.",
                "Granovetter, M., 1985, “Economic Action and Social\nStructure: The Problem of Embeddedness”, <em>The American\nJournal of Sociology</em>, 91(3): 481–510.",
                "Hall, P. A., and Soskice, D., 2001, “An Introduction to\nVarieties of Capitalism”, in <em>Varieties of Capitalism: The\nInstitutional Foundations of Comparative Advantage</em>, P. A. Hall\nand D. Soskice (eds.), New York: Oxford University, pp.\n1–68.",
                "Hardin, G., 1968, “The Tragedy of the Commons”,\n<em>Science</em>, 162(3859): 1243–1248.",
                "Harris, J., 1992, <em>Wonderwoman and Superman: the ethics of\nhuman biotechnology</em>, Oxford: Oxford University Press.",
                "Hayek, F.A. v., 1944, <em>The Road to Serfdom</em>, London:\nRoutledge.",
                "–––, 1945, “The Use of Knowledge in\nSociety”, <em>American Economic Review</em>, 35:\n519–30.",
                "–––, 1973–79, <em>Law, Legislation and\nLiberty</em>, Chicago: University of Chicago Press.",
                "–––, 1978, <em>Law, Legislation and Liberty</em>\n(Volume 2: The Mirage of Social Justice), Chicago: University of\nChicago Press.",
                "Hausman, D. M., 2008, “Philosophy of Economics”,\n<em>The Stanford Encyclopedia of Philosophy (Fall 2008 Edition)</em>,\nEdward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2008/entries/economics/\">https://plato.stanford.edu/archives/fall2008/entries/economics/</a>&gt;.",
                "Heath, J., 2006, “The benefits of cooperation”,\n<em>Philosophy and Public Affairs</em>, 34(4): 313–351.",
                "–––, 2014, <em>Morality, Competition and the\nFirm</em>, New York: Oxford University Press.",
                "–––, 2018, “On the Very Idea of a Just\nWage”, <em>Erasmus Journal for Philosophy and Economics</em>, 11(2):\n1–33.",
                "Heath, J., J. Moriarty and W. Norman, 2010, “Business Ethics\nand (or as) Political Philosophy”, <em>Business Ethics\nQuarterly</em>, 20(3): 427–452.",
                "Hegel, G. W. F., 1942 [1821], <em>Philosophy of Right</em>,\ntranslated with notes by T. M. Knox, Oxford: Clarendon Press.",
                "Herzog, L., 2013, <em>Inventing the Market. Smith, Hegel, and\nPolitical Theory</em>, Oxford: Oxford University Press.",
                "––– (ed.), 2017, <em>Just Financial Markets?\nFinance in a Just Society</em>, Oxford: Oxford University Press.",
                "––– 2018, <em>Reclaiming the System. Moral\nResponsibility, Divided Labour, and the Role of Organizations in\nSociety</em>, Oxford: Oxford University Press.",
                "–––, 2020, “The epistemic division of\nlabour in markets: knowledge, global trade and the preconditions of\nmorally responsible agency”, <em>Economics and Philosophy</em>,\n36(2): 266–286.",
                "Hirsch, F., 1976, <em>The Social Limits to Growth</em>, Cambridge,\nMA: Harvard University Press.",
                "Hirschman, A. O., 1970, <em>Exit, voice, and loyalty: responses to\ndecline in firms, organizations, and states</em>, Cambridge, MA:\nHarvard University Press.",
                "–––, 1977, <em>The Passions and the Interests:\nPolitical Arguments for Capitalism before its Triumph</em>, Princeton,\nNJ: Princeton University Press.",
                "–––, 1983, “Rival Interpretations of\nMarket Society: Civilizing, Destructive, or Feeble?” <em>Journal\nof Economic Literature</em>, XX: 1463–1484.",
                "Hont, I., 2005, <em>Jealousy of Trade: International Competition\nand the Nation-State in Historical Perspective</em>, Cambridge, MA:\nHarvard University Press.",
                "Hussain, W., 2012, “Is Ethical Consumerism an Impermissible\nForm of Vigilantism?” <em>Philosophy and Public Affairs</em>,\n40(2): 111–143.",
                " –––, 2020, “Pitting People Against Each\nOther”, <em>Philosophy and Public Affairs</em>, 48(1):\n79–113.",
                "Illouz, E., 2012, <em>Why Love Hurts</em>, Cambridge: Polity.",
                "Jaeggi, R., 2014, <em>Alienation</em>, New York: Columbia\nUniversity Press.",
                "James, A., 2005, “Distributive Justice without Sovereign\nRule: The Case of Trade”, <em>Social Theory and Practice</em>,\n31(4): 533–559.",
                "Kahneman, D., and A. Tversky, 1979, “Prospect Theory: An\nAnalysis of Decision Making under Risk”, <em>Econometrica</em>,\n47: 263–91.",
                "Kahneman, D., J. L. Knetsch and R. Thaler, 1986, “Fairness\nas a Constraint on Profit Seeking: Entitlements in the Market”,\n<em>American Economic Review</em>, 76(4): 728–741.",
                "Keat, R., 2008, “Practices, Firms and Varieties of\nCapitalism”, <em>Philosophy of Management</em>, 7(1):\n77–91.",
                "Keynes, J. M., 1936, <em>The General Theory of Employment,\nInterest and Money</em>, Cambridge: Cambridge University Press.",
                "Knight, F. H., 1923, “The Ethics of Competition”,\n<em>Quarterly Journal of Economics</em>, 37: 579–624.",
                "Kołakowski, L., 1978, <em>Main Currents of Marxism</em>,\nLondon: Oxford University Press.",
                "Kramer, M. and M. Porter, 2006, “Strategy &amp; Society: The\nLink Between Competitive Advantage and Corporate Social\nResponsibility”, <em>Harvard Business Review</em>, December 01,\n2006.",
                "Kurjanska, M., and M. Risse, 2008, “Fairness in Trade II:\nexport subsidies and the Fair Trade movement”, <em>Philosophy,\nPolitics, and Economics</em>, 7(1): 43–49.",
                "Laibson, D., 1997, “Golden Eggs and Hyperbolic\nDiscounting”, <em>The Quarterly Journal of Economic</em>,\n112(2): 443–478.",
                "Lane, R., 1991, <em>The Market Experience</em>, Cambridge:\nCambridge University Press.",
                "Locke, J., 1960 [1689], <em>Second Treatise of Government</em>, P.\nLaslett (ed.), Cambridge: Cambridge University Press.",
                "Luxemburg, R., 2003 [1913], <em>The Accumulation of Capital: A\nContribution to an Economic Explanation of Imperialism</em>, London:\nRoutledge.",
                "MacGilvray, E., 2011, <em>The Invention of Market Freedom</em>,\nCambridge: Cambridge University Press.",
                "MacIntyre, A., 1984, <em>After Virtue. 2nd edition</em>, Notre\nDame: University of Notre Dame Press.",
                "MacKenzie, D., 2009, <em>Material Markets. How Economic Agents Are\nConstructed</em>, Oxford: Oxford University Press.",
                "Mandeville, B., 1924 [1714/29], <em>The Fable of the Bees, Part I\n(1714), Part II (1729)</em>, F. B. Kaye (ed.), Oxford: Clarendon\nPress.",
                "Malthus, T., 1992 [1798], <em>An Essay on the Principle of\nPopulation</em>, D. Winch (ed.), Cambridge: Cambridge University\nPress.",
                "Mankiw, N. G., 2010, “Presidential Address: Spreading the\nWealth Around: Reflections Inspired by Joe the Plumber”,\n<em>Eastern Economic Journal</em>, 36: 285–298.",
                "Marcoux, A., 2008, “Business Ethics”, <em>The Stanford\nEncyclopedia of Philosophy (Fall 2008 Edition)</em>, Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2008/entries/ethics-business/\">https://plato.stanford.edu/archives/fall2008/entries/ethics-business/</a>&gt;.",
                "Marshall, T. H., 1992, <em>Citizenship and Social Class</em>,\nLondon: Pluto.",
                "Marx, K., 1995 [1867], <em>Capital</em> (Volume I), in\n<em>Marx/Engels Internet Archive</em>,\n <a href=\"http://www.marxists.org\" target=\"other\">available online</a>.",
                "–––, 1995 [1844], <em>Economic and Philosophic\nManuscripts of 1844</em>, in <em>Marx/Engels Internet Archive</em>,\n <a href=\"http://www.marxists.org\" target=\"other\">available online</a>.",
                "–––, and F. Engels, 1995 [1848], <em>Communist\nManifesto</em>, in <em>Marx/Engels Internet Archive</em>,\n <a href=\"http://www.marxists.org\" target=\"other\">available online</a>.",
                "Mas-Colell, A., M. Whinston, and J. Green, 1995, <em>Microeconomic\nTheory</em>, Oxford: Oxford University Press.",
                "Mauss, M., 1990 [1923–24], <em>The Gift: forms and functions\nof exchange in archaic societies</em>, London: Routledge.",
                "McCloskey, D., 2006, <em>The Bourgeois Virtues: Ethics for an Age\nof Commerce</em>, Chicago: University of Chicago Press.",
                "Mildenberg, C., 2020, “Agent-Democratic Markets”,\n<em>Kriterion: Journal of Philosophy</em>, 34(2): 1–32.",
                "Mill, J.S., 2004 [1848], <em>Principles of Political Economy with\nSome of Their Applications to Social Philosophy</em>, London:\nPrometheus Books.",
                "Miller, D., 2001, <em>Principles of Social Justice</em>,\nCambridge, MA: Harvard University Press.",
                "Minsky, H., 1986, <em>Stabilizing an Unstable Economy</em>, New\nHaven/London: Yale University Press.",
                "Mises, L. v., 1949, <em>Human Action: A Treatise on\nEconomics</em>, New Haven: Yale University Press.",
                "Mongin, P., 2006, “Value Judgments and Value Neutrality in\nEconomics”, <em>Economica</em>, 73: 257–286.",
                "Moriarty, J., 2020, “On the Origin, Content, and Relevance\nof the Market Failures Approach”, <em>Journal of Business\nEthics</em>, 165: 113–124.",
                "Murphy, L., and T. Nagel, 2002, <em>The Myth of Ownership: Taxes\nand Justice</em>, Oxford: Oxford University Press.",
                "Narveson, J., 1995, “Deserving Profits”, in\n<em>Profits and Morality</em>, R. Cowan and M. .J. Rizzo (eds.),\nChicago: University of Chicago Press, pp. 48–87.",
                "Nozick, R., 1974, <em>Anarchy, State, And Utopia</em>, New York:\nBasic Books.",
                "O’Neill, M., and T. Williamson (eds.), 2012,\n<em>Property-Owning Democracy: Rawls and Beyond</em>, Chichester:\nBlackwell.",
                "Okun, A. M., 1975, <em>Equality and Efficiency: The Big\nTradeoff</em>, Washington: Brookings Institution Press.",
                "Olsaretti, S., 2004, <em>Liberty, Desert and the Market: A\nPhilosophical Study</em>, Cambridge: Cambridge University Press.",
                "Otsuka, M., 2003, <em>Libertarianism without Inequality</em>,\nOxford: Oxford University Press.",
                "Pateman, C., 1970, <em>Participation and Democratic Theory</em>,\nCambridge: Cambridge University Press.",
                "Pettit, P., 2006, “Freedom in the market”,\n<em>Politics, Philosophy &amp; Economics</em>, 5(2):\n131–149.",
                "Phillips, A., 2008, “Egalitarians and the Market: Dangerous\nIdeals”, <em>Social Theory and Practice</em>, 34(3):\n439–462.",
                "–––, 2013, <em>Our Bodies, Whose Property?</em>,\nPrinceton: Princeton University Press.",
                "Piketty, T., 2014, <em>Capital in the Twenty-First Century</em>,\nCambridge, MA.: Harvard University Press.",
                "Pistor, K., 2013, “A Legal Theory of Finance”,\n<em>Journal of Comparative Economics</em>, 41(2): 315–330.",
                "Pogge, T. 2002, <em>World Poverty and Human Rights: Cosmopolitan\nResponsibilities and Reforms</em>, Cambridge: Polity Press.",
                "Polanyi, K., 1944, <em>The Great Transformation</em>, Boston:\nBeacon Press.",
                "Radcliffe-Richards, J., 2012, <em>The Ethics of Transplants: Why\nCareless Thought Costs Lives</em>, Oxford: Oxford University\nPress.",
                "Radin, M. J., 1996, <em>Contested Commodities</em>, Cambridge, MA:\nHarvard University Press.",
                "Rawls, J., 1971, <em>A Theory of Justice</em>, Cambridge, MA:\nBelknap Press of Harvard University Press.",
                "–––, 1993, <em>Political Liberalism</em>, New\nYork: Columbia University Press.",
                "Ricardo, D., 2005 [1817], <em>Principles of Political Economy and\nTaxation</em>, in <em>The Works and Correspondence of David\nRicardo</em> (Volume 1), Piero Sraffa (ed.), with the collaboration of\nM.H. Dobb, Indianapolis: Liberty Fund.",
                "Risse, M., 2007, “Fairness in Trade I: Obligations from\nTrading and the Pauper-Labor Argument”, <em>Philosophy,\nPolitics, and Economics</em>, 6(3): 355–377.",
                "Robeyns, I., 2011, “The Capability Approach”, <em>The\nStanford Encyclopedia of Philosophy (Summer 2011 Edition)</em>, Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2011/entries/capability-approach/\">https://plato.stanford.edu/archives/sum2011/entries/capability-approach/</a>&gt;.",
                "Roemer, J., 2012, “Ideology, Social Ethos, and the Financial\nCrisis”, <em>The Journal of Ethics</em>, 16: 273–303.",
                "Rose, D. C., 2011, <em>The Moral Foundations of Economic\nBehavior</em>, New York: Oxford University Press.",
                "Rothbard, M., 1970, <em>Power and Market: Government and the\nEconomy</em>, Kansas City: Sheed Andrews and McMeel.",
                "Rousseau, J.J., 1997 [1750ff.], <em>The Discourses and Other Early\nPolitical Writings</em>, Victor Gourevitch (ed.), Cambridge: Cambridge\nUniversity Press.",
                "Sandel, M. J., 2012, <em>What Money Can’t Buy: The Moral\nLimits of Markets</em>, New York: Farrar Straus Giroux.",
                "Satz, D., 2010, <em>Why Some Things Should not be for Sale: The\nMoral Limits of Markets</em>, Oxford: Oxford University Press.",
                "Schumpeter, J., 1942, <em>Capitalism, Socialism and\nDemocracy</em>, New York: Harper &amp; Brothers, ",
                "–––, 1954, <em>History of Economic\nAnalysis</em>, London: Allen &amp; Unwin.",
                "Schwarz, David T., 2010, <em>Consuming Choices</em>, Plymoth, UK:\nRowman &amp; Littlefield.",
                "Scott, B. R., 2011, <em>Capitalism. Its Origins and Evolution as a\nSystem of Governance</em>, New York: Springer.",
                "Sen, A., 1977, “Rational Fools: A Critique of the\nBehavioural Foundations of Economic Theory”, <em>Philosophy and\nPublic Affairs</em>, 6: 317–344.",
                "–––, 1985, “The Moral Standing of the\nMarket”, <em>Social Philosophy and Policy</em> 3:\n1–19.",
                "–––, 1993, “Capability and\nWell-Being”, <em>The Quality of Life</em>, M. Nussbaum and A.\nSen (eds.), New York: Oxford Clarendon Press, pp.30–53.",
                "–––, 1997 [1973], <em>On Economic\nInequality</em>, New York: Oxford University Press.",
                "Shiffrin, S., 2007, “Intellectual Property”, <em>A\nCompanion to Contemporary Political Philosophy</em>, R. Goodin, P.\nPettit, T. Pogge (eds.), Oxford: Blackwell, 653–668.",
                "Smith, A., 1976a [1776], <em>An Inquiry into the Nature and Causes\nof the Wealth of Nations</em>, D.D. Raphael and A. L. Macfied (eds.),\nOxford: Clarendon Press (abbreviation: WN).",
                "–––, 1976b [1759], <em>The theory of moral\nsentiments</em>, D. D. Raphael and A. L. Macfie (eds.), Oxford:\nClarendon Press.",
                "–––, 1978 [1762/66], <em>Lectures on\njurisprudence</em>, R. L. Meek, D.D. Raphael, and P.G. Stein (eds.),\nOxford: Clarendon Press.",
                "Smucker, J., 2006, “Pursuing corporate social responsibility\nin changing institutional fields”, in <em>Just Business\nPractices in a Diverse and Developing World</em>, F. Bird and M.\nVelasquez (eds.), Houndsmills, Basingstoke: Palgrave McMillan, pp.\n81–108.",
                "Storr, Virgil Henry, and Ginny Seung Choi, 2019, <em>Do Markets\nCorrupt Our Morals?</em>, New York: Palgrave Macmillan.",
                "Taylor, R.S., 2013, “Market Freedom as Anti-Power”,\n<em>American Political Science Review</em>, 107(3):\n593–602.",
                "Thaler, R. H. and C. R. Sunstein, 2008, <em>Nudge: Improving\nDecisions about Health, Wealth, and Happiness</em>, New Haven: Yale\nUniversity Press.",
                "Titmuss, R., 1971, <em>The Gift Relationship: From Human Blood to\nSocial Policy</em>, New York: Random House.",
                "Tomasi, J., 2012, <em>Free Market Fairness</em>, Princeton/Oxford:\nPrinceton University Press.",
                "Vallentyne, P., and H. Steiner (eds.), 2000,\n<em>Left-Libertarianism and Its Critics: The Contemporary Debate</em>,\nNew York: Palgrave",
                "Van Parijs, Ph., 1995, <em>Real Freedom for All. What (if\nanything) can justify capitalism</em>, Oxford: Clarendon Press.",
                "Vrousalis, N., 2019, “Workplace Democracy Implies Economic\nDemocracy”, <em>Journal of Social Philosophy</em>, 50(3):\n259–279.",
                "Waldron, J., 1993, “Homelessness and the Issue of\nFreedom”, in <em>Liberal Rights</em>, Cambridge: Cambridge\nUniversity Press, pp. 309–338.",
                "Walzer, M., 1983, <em>Spheres of Justice. A Defense of Pluralism\nand Equality</em>, New York: Basic Books.",
                "Weber, M., 2002 [1905], <em>The Protestant Ethic and the\n“Spirit” of Capitalism and Other Writings</em>, P. R.\nBaehr and G. C. Wells (eds.), London: Penguin Books.",
                "Wenar, L., 2015, <em>Blood Oil. Tyrants, Violence, and the Rules\nthat Run the World</em>, Oxford: Oxford University Press.",
                "Widerquist, K., 2013, <em>Independence, Propertylessness, and\nBasic Income: A Theory of Freedom as the Power to Say No</em>, New\nYork: Palgrave Macmillan.",
                "Wilmot-Smith, F. 2019, <em>Equal Justice. Fair Legal Systems In An\nUnfair World</em>, Cambridge, MA: Harvard University Press.",
                "Wright, E. O., 2011, <em>Envisioning Real Utopias</em>, London:\nVerso."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Acemoglou, D., and J. Robinson, 2012, <em>Why Nations Fail: The\nOrigins of Power, Prosperity, and Poverty</em>, New York: Crown\nBusiness.</li>\n<li>Agmon, S., 2021, “Undercutting justice. Why legal\nrepresentation should not be allocated by the market”,\n<em>Politics, Philosophy &amp; Economics</em>, 20(1), 99–123.</li>\n<li>Akerlof, G. A., and R. J. Shiller, 2009, <em>Animal Spirits: How\nHuman Psychology Drives the Economy, and Why it Matters for Global\nCapitalism</em>, Princeton: Princeton University Press.</li>\n<li>Anderson, E., 1992, <em>Values in Ethics and Economics</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 2017, <em>Private Government. How Employers\nRule Our Lives</em> (<em>and Why We Don’t Talk about It</em>),\nPrinceton: Princeton University Press.</li>\n<li>Aristotle, <em>Politics</em>, in <em>The Complete Works of\nAristotle</em>, J. Barnes (ed.), Princeton: Princeton University\nPress, 1984.</li>\n<li>Arneson, R.J., 2008, “Rawls, Responsibility, and\nDistributive Justice”, in <em>Justice, Political Liberalism, and\nUtilitarianism: Themes from Harsanyi and Rawls</em>, M. Fleurbaey and\nJ.A. Weymark (eds.), Cambridge: Cambridge University Press,\n80–107.</li>\n<li>Arnold, S., 1987, “Why Profits are Deserved”,\n<em>Ethics</em>, 97: 387–402.</li>\n<li>Bardhan, P., and J. E. Roemer (eds.), 1993, <em>Market Socialism:\nThe Current Debate</em>, New York: Oxford University Press.</li>\n<li>Barry, B., 2005, <em>Why Social Justice Matters</em>, Cambridge:\nPolity.</li>\n<li>Barry, C., and S. Reddy, 2008, <em>International Trade and Labor\nStandards: A Proposal for Linkage</em>, New York: Columbia University\nPress.</li>\n<li>Basu, K., 2007, “Coercion, contract and the limits of the\nmarket”, <em>Social Choice and Welfare</em>, 29:\n559–579.</li>\n<li>Basu, K., and P.H. Van, 1998, “The Economics of Child\nLabour”, <em>The American Economic Review</em>, 88(3):\n412–427.</li>\n<li>Bator, F.M., 1958, “The Anatomy of Market Failure”,\n<em>Quarterly Journal of Economics</em>, 72(3): 351–379.</li>\n<li>Becker, G., 1976, <em>The Economic Approach to Human\nBehavior</em>, Chicago: University of Chicago Press.</li>\n<li>Becker, S. O. and L. Woessmann, 2009, “Was Weber Wrong? A\nHuman Capital Theory of Protestant Economic History”,\n<em>Quarterly Journal of Economics</em>, 124 (2): 531–596.</li>\n<li>Beckert, J., 2002, <em>Beyond the Market. The Social Foundations\nof Economic Efficiency</em>, Princeton: Princeton University\nPress.</li>\n<li>Bell, D., 2012, “Communitarianism”, <em>The Stanford\nEncyclopedia of Philosophy</em> (Spring 2012 Edition), Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/spr2012/entries/communitarianism/\">https://plato.stanford.edu/archives/spr2012/entries/communitarianism/</a>&gt;.</li>\n<li>Berkey, B., 2021, “Ethical Consumerism, Democratic Values,\nand Justice”, <em>Philosophy and Public Affairs</em>, 49(3):\n237–274.</li>\n<li>Berman, S., 2006, <em>The Primacy of Politics: Social Democracy\nand the Making of Europe’s Twentieth Century</em>, Cambridge:\nCambridge University Press.</li>\n<li>Blake, M., 2008, “International Justice”, <em>The\nStanford Encyclopedia of Philosophy</em> (Winter 2008 Edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2008/entries/international-justice/\">https://plato.stanford.edu/archives/win2008/entries/international-justice/</a>&gt;.</li>\n<li>Blaug, M., 1996, <em>Economic Theory in Retrospect (Fifth\nEdition)</em>, Cambridge: Cambridge University Press.</li>\n<li>Boutang, Y. M., 2011, <em>Cognitive Capitalism</em>, transl. by E.\nEmery, Cambridge: Polity Press.</li>\n<li>Bowles, S., 2011, “Is Liberal Society a Parasite on\nTradition”, <em>Philosophy &amp; Public Affairs</em>, 39(1):\n46–81.</li>\n<li>Brennan, J., and P. M. Jaworski, 2015, “Markets without\nSymbolic Limits”, <em>Ethics</em>, 39(1): 46–81.</li>\n<li>–––, 2016, <em>Markets without Limits: Moral\nVirtues and Commercial Interests</em>, London: Routledge. </li>\n<li>Brighhouse, H., and A. Swift, 2006, “Equality, Priority, and\nPositional Goods”, <em>Ethics</em>, 125(4):\n1053–1077.</li>\n<li>Brock, G., 2009, <em>Global Justice: A Cosmopolitan Account</em>,\nOxford: Oxford University Press.</li>\n<li>Buchanan, A. E., 1985, <em>Ethics, Efficiency, and the\nMarket</em>, Towota, NJ: Rowman &amp; Allanheld.</li>\n<li>Buchanan, J., 1975, <em>The Limits of Liberty: Between Anarchy and\nLeviathan</em>, Chicago: University of Chicago Press.</li>\n<li>Callon, M., 1998, “Introduction. The embeddedness of\nEconomic Markets in Economics”, in <em>The Laws of the\nMarket</em>, Oxford: Blackwell Publishers/The Sociological Review, pp.\n1–57.</li>\n<li>Caney, S., 2005, <em>Justice Beyond Borders: A Global Political\nTheory</em>, Oxford: Oxford University Press.</li>\n<li>Camerer, C., with G. Loewenstein, and M. Rabin (eds.), 2003,\n<em>Advances in Behavioral Economics</em>, Princeton: Princeton\nUniversity Press.</li>\n<li>Carens, J. H., 1981, <em>Equality, Moral Incentives, and the\nMarket. An Essay in Utopian Politico-Economic Theory</em>,\nChicago/London: Chicago University Press.</li>\n<li>Christensen, J., 2017, <em>Trade Justice</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Ciepley, D., 2013, “Beyond Public and Private:Toward a\nPolitical Theory of the Corporation”, <em>American Political\nScience Review</em>, 107(1): 139–158.</li>\n<li>Claassen, R., 2008, “The status struggle: A\nrecognition-based interpretation of the positional economy”,\n<em>Philosophy and Social Criticism</em>, 34: 1021–1049.</li>\n<li>–––, 2015, “Markets as Mere Means”,\n<em>British Journal of Political Science</em>, 47: 263–281.</li>\n<li>Coase, R. H., 1960, “The Problem of Social Cost”,\n<em>Journal of Law and Economics</em>, 3(1): 1–44.</li>\n<li>Cohen, G. A., 1979, “Capitalism, Freedom and the\nProletariat”, in <em>The Idea of Freedom. Essays in Honour of\nIsaiah Berlin</em>, A. Ryan (ed.), Oxford: Oxford University Press,\npp. 9–25.</li>\n<li>–––, 1995, <em>Self-Ownership, Freedom, and\nEquality</em>, Cambridge: Cambridge University Press.</li>\n<li>Cowen, T. (ed.), 1988, <em>Public Goods and Market Failures: A\nCritical Examination</em>, New Brunswick, NJ: Transaction\nPublishers.</li>\n<li>Crocker, D.A., and T. Linden (eds.), 1998, <em>Ethics of\nConsumption: The Good Life, Justice, and Global Stewartship</em>,\nOxford: Rowman &amp; Littlefield.</li>\n<li>Crouch, C., 2011, <em>The Strange Non-Death of\nNeo-liberalism</em>, Cambridge: Polity.</li>\n<li>Cunningham, F., 2005, “Market economies and market\nsocieties”, <em>Journal of Social Philosophy</em>, 36(2):\n129–142.</li>\n<li>Dietsch, P., 2010, “The market, competition, and\nequality”, <em>Politics, Philosophy &amp; Economics</em>, 9(2):\n213–244.</li>\n<li>–––, 2015, <em>Catching Capital–The Ethics\nof Tax Competition</em>, New York: Oxford University Press.</li>\n<li>Dorfman, A. and A. Harel, 2013, “The Case Against\nPrivatization”, <em>Philosophy &amp; Public Affairs</em>, 41(1):\n67–102</li>\n<li>Durkheim, E., 1997 [1893], <em>The Division of Labour in\nSociety</em>, L.A. Coser (ed.), New York: The Free Press.</li>\n<li>Dworkin, R., 2000, <em>Sovereign Virtue: The Theory and Practice\nof Equality</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Ellerman, D., 2021, <em>Neo-Abolitionism. Abolishing Human Rentals\nin Favor of Workplace Democracy</em>, Cham: Springer.</li>\n<li>Emmett, R. B., (ed.), 2010, <em>The Elgar Companion to the Chicago\nSchool of Economics</em>, Cheltenham: Edward Elgar.</li>\n<li>Eucken, W., 1939, <em>Die Grundlagen der\nNationalökonomie</em>, Jena: G. Fischer.</li>\n<li>Fabre, C., 2006, <em>Whose Body is it Anyway?: Justice and the\nIntegrity of the Person</em>, Oxford: Oxford University Press.</li>\n<li>Fehr, E., and K. M. Schmidt, 1999, “A theory of fairness,\ncompetition, and cooperation”, <em>The Quarterly Journal of\nEconomics</em>, 114 (3): 817–86</li>\n<li>Ferreras, I., 2017, <em>Firms as Political Entities. Saving\nDemocracy through Economic Bicameralism</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Fleurbaey, M., 2012, “Economics and Economic Justice”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Summer 2012\nEdition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2012/entries/economic-justice/\">https://plato.stanford.edu/archives/sum2012/entries/economic-justice/</a>&gt;.</li>\n<li>Fligstein, N., 1996, “Markets as Politics: A\nPolitical-Cultural Approach to Market Institutions”,\n<em>American Sociological Review</em>, 61 (4): 656–673.</li>\n<li>Frank, R. H., 2005, “Positional Externalities Cause Large\nand Preventable Welfare Losses”, <em>American Economic\nReview</em>, 95(2): 137–141.</li>\n<li>Fraser, N., and A. Honneth, 2003, <em>Redistribution or\nRecognition?: A Political-Philosophical Exchange</em>, London:\nVerso.</li>\n<li>Freeman, S., 2001, “Illiberal Libertarians: Why\nLibertarianism Is Not a Liberal View”, <em>Philosophy &amp;\nPublic Affairs</em>, 30(2): 105–151.</li>\n<li>–––, 2011, “Capitalism in the classical\nand high liberal traditions”, <em>Social Philosophy and\nPolicy</em>, 28: 19–55.</li>\n<li>Friedman, D., 1973, <em>The Machinery of Freedom. Guide to a\nradical capitalism</em>, New York: Harper &amp; Row.</li>\n<li>Friedman, M., 1962, <em>Capitalism and Freedom</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>–––, 1970, “The Social Responsibility of\nBusiness is to Increase its Profits”, <em>The New York Times\nMagazine</em>, September 13, 1970.</li>\n<li>Frey, B., 1997, <em>Not just for the money. An economic theory of\npersonal motivation</em>, Cheltenham: Edward Elgar.</li>\n<li>Fromm, E., 1976, <em>To Have or to Be?</em>, London/New York:\nContinuum.</li>\n<li>Fumagalli, R., 2020, “Buyer Beware: A Critique of Leading\nVirtue Ethics Defenses of Markets”, <em>Journal of Social\nPhilosophy</em>, 51(3): 457–483.</li>\n<li>George, D., 2001, <em>Preference Pollution. How Markets Create the\nDesires We Dislike</em>, Ann Arbor: University of Michigan Press.</li>\n<li>Gneezy, U., and A. Rustichini, 2000, “A Fine is a\nPrice”, <em>Journal of Legal Studies</em>, XXIX:\n1–17.</li>\n<li>Granovetter, M., 1985, “Economic Action and Social\nStructure: The Problem of Embeddedness”, <em>The American\nJournal of Sociology</em>, 91(3): 481–510.</li>\n<li>Hall, P. A., and Soskice, D., 2001, “An Introduction to\nVarieties of Capitalism”, in <em>Varieties of Capitalism: The\nInstitutional Foundations of Comparative Advantage</em>, P. A. Hall\nand D. Soskice (eds.), New York: Oxford University, pp.\n1–68.</li>\n<li>Hardin, G., 1968, “The Tragedy of the Commons”,\n<em>Science</em>, 162(3859): 1243–1248.</li>\n<li>Harris, J., 1992, <em>Wonderwoman and Superman: the ethics of\nhuman biotechnology</em>, Oxford: Oxford University Press.</li>\n<li>Hayek, F.A. v., 1944, <em>The Road to Serfdom</em>, London:\nRoutledge.</li>\n<li>–––, 1945, “The Use of Knowledge in\nSociety”, <em>American Economic Review</em>, 35:\n519–30.</li>\n<li>–––, 1973–79, <em>Law, Legislation and\nLiberty</em>, Chicago: University of Chicago Press.</li>\n<li>–––, 1978, <em>Law, Legislation and Liberty</em>\n(Volume 2: The Mirage of Social Justice), Chicago: University of\nChicago Press.</li>\n<li>Hausman, D. M., 2008, “Philosophy of Economics”,\n<em>The Stanford Encyclopedia of Philosophy (Fall 2008 Edition)</em>,\nEdward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2008/entries/economics/\">https://plato.stanford.edu/archives/fall2008/entries/economics/</a>&gt;.</li>\n<li>Heath, J., 2006, “The benefits of cooperation”,\n<em>Philosophy and Public Affairs</em>, 34(4): 313–351.</li>\n<li>–––, 2014, <em>Morality, Competition and the\nFirm</em>, New York: Oxford University Press.</li>\n<li>–––, 2018, “On the Very Idea of a Just\nWage”, <em>Erasmus Journal for Philosophy and Economics</em>, 11(2):\n1–33.</li>\n<li>Heath, J., J. Moriarty and W. Norman, 2010, “Business Ethics\nand (or as) Political Philosophy”, <em>Business Ethics\nQuarterly</em>, 20(3): 427–452.</li>\n<li>Hegel, G. W. F., 1942 [1821], <em>Philosophy of Right</em>,\ntranslated with notes by T. M. Knox, Oxford: Clarendon Press.</li>\n<li>Herzog, L., 2013, <em>Inventing the Market. Smith, Hegel, and\nPolitical Theory</em>, Oxford: Oxford University Press.</li>\n<li>––– (ed.), 2017, <em>Just Financial Markets?\nFinance in a Just Society</em>, Oxford: Oxford University Press.</li>\n<li>––– 2018, <em>Reclaiming the System. Moral\nResponsibility, Divided Labour, and the Role of Organizations in\nSociety</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2020, “The epistemic division of\nlabour in markets: knowledge, global trade and the preconditions of\nmorally responsible agency”, <em>Economics and Philosophy</em>,\n36(2): 266–286.</li>\n<li>Hirsch, F., 1976, <em>The Social Limits to Growth</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>Hirschman, A. O., 1970, <em>Exit, voice, and loyalty: responses to\ndecline in firms, organizations, and states</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>–––, 1977, <em>The Passions and the Interests:\nPolitical Arguments for Capitalism before its Triumph</em>, Princeton,\nNJ: Princeton University Press.</li>\n<li>–––, 1983, “Rival Interpretations of\nMarket Society: Civilizing, Destructive, or Feeble?” <em>Journal\nof Economic Literature</em>, XX: 1463–1484.</li>\n<li>Hont, I., 2005, <em>Jealousy of Trade: International Competition\nand the Nation-State in Historical Perspective</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Hussain, W., 2012, “Is Ethical Consumerism an Impermissible\nForm of Vigilantism?” <em>Philosophy and Public Affairs</em>,\n40(2): 111–143.</li>\n<li> –––, 2020, “Pitting People Against Each\nOther”, <em>Philosophy and Public Affairs</em>, 48(1):\n79–113.</li>\n<li>Illouz, E., 2012, <em>Why Love Hurts</em>, Cambridge: Polity.</li>\n<li>Jaeggi, R., 2014, <em>Alienation</em>, New York: Columbia\nUniversity Press.</li>\n<li>James, A., 2005, “Distributive Justice without Sovereign\nRule: The Case of Trade”, <em>Social Theory and Practice</em>,\n31(4): 533–559.</li>\n<li>Kahneman, D., and A. Tversky, 1979, “Prospect Theory: An\nAnalysis of Decision Making under Risk”, <em>Econometrica</em>,\n47: 263–91.</li>\n<li>Kahneman, D., J. L. Knetsch and R. Thaler, 1986, “Fairness\nas a Constraint on Profit Seeking: Entitlements in the Market”,\n<em>American Economic Review</em>, 76(4): 728–741.</li>\n<li>Keat, R., 2008, “Practices, Firms and Varieties of\nCapitalism”, <em>Philosophy of Management</em>, 7(1):\n77–91.</li>\n<li>Keynes, J. M., 1936, <em>The General Theory of Employment,\nInterest and Money</em>, Cambridge: Cambridge University Press.</li>\n<li>Knight, F. H., 1923, “The Ethics of Competition”,\n<em>Quarterly Journal of Economics</em>, 37: 579–624.</li>\n<li>Kołakowski, L., 1978, <em>Main Currents of Marxism</em>,\nLondon: Oxford University Press.</li>\n<li>Kramer, M. and M. Porter, 2006, “Strategy &amp; Society: The\nLink Between Competitive Advantage and Corporate Social\nResponsibility”, <em>Harvard Business Review</em>, December 01,\n2006.</li>\n<li>Kurjanska, M., and M. Risse, 2008, “Fairness in Trade II:\nexport subsidies and the Fair Trade movement”, <em>Philosophy,\nPolitics, and Economics</em>, 7(1): 43–49.</li>\n<li>Laibson, D., 1997, “Golden Eggs and Hyperbolic\nDiscounting”, <em>The Quarterly Journal of Economic</em>,\n112(2): 443–478.</li>\n<li>Lane, R., 1991, <em>The Market Experience</em>, Cambridge:\nCambridge University Press.</li>\n<li>Locke, J., 1960 [1689], <em>Second Treatise of Government</em>, P.\nLaslett (ed.), Cambridge: Cambridge University Press.</li>\n<li>Luxemburg, R., 2003 [1913], <em>The Accumulation of Capital: A\nContribution to an Economic Explanation of Imperialism</em>, London:\nRoutledge.</li>\n<li>MacGilvray, E., 2011, <em>The Invention of Market Freedom</em>,\nCambridge: Cambridge University Press.</li>\n<li>MacIntyre, A., 1984, <em>After Virtue. 2nd edition</em>, Notre\nDame: University of Notre Dame Press.</li>\n<li>MacKenzie, D., 2009, <em>Material Markets. How Economic Agents Are\nConstructed</em>, Oxford: Oxford University Press.</li>\n<li>Mandeville, B., 1924 [1714/29], <em>The Fable of the Bees, Part I\n(1714), Part II (1729)</em>, F. B. Kaye (ed.), Oxford: Clarendon\nPress.</li>\n<li>Malthus, T., 1992 [1798], <em>An Essay on the Principle of\nPopulation</em>, D. Winch (ed.), Cambridge: Cambridge University\nPress.</li>\n<li>Mankiw, N. G., 2010, “Presidential Address: Spreading the\nWealth Around: Reflections Inspired by Joe the Plumber”,\n<em>Eastern Economic Journal</em>, 36: 285–298.</li>\n<li>Marcoux, A., 2008, “Business Ethics”, <em>The Stanford\nEncyclopedia of Philosophy (Fall 2008 Edition)</em>, Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2008/entries/ethics-business/\">https://plato.stanford.edu/archives/fall2008/entries/ethics-business/</a>&gt;.</li>\n<li>Marshall, T. H., 1992, <em>Citizenship and Social Class</em>,\nLondon: Pluto.</li>\n<li>Marx, K., 1995 [1867], <em>Capital</em> (Volume I), in\n<em>Marx/Engels Internet Archive</em>,\n <a href=\"http://www.marxists.org\" target=\"other\">available online</a>.</li>\n<li>–––, 1995 [1844], <em>Economic and Philosophic\nManuscripts of 1844</em>, in <em>Marx/Engels Internet Archive</em>,\n <a href=\"http://www.marxists.org\" target=\"other\">available online</a>.</li>\n<li>–––, and F. Engels, 1995 [1848], <em>Communist\nManifesto</em>, in <em>Marx/Engels Internet Archive</em>,\n <a href=\"http://www.marxists.org\" target=\"other\">available online</a>.</li>\n<li>Mas-Colell, A., M. Whinston, and J. Green, 1995, <em>Microeconomic\nTheory</em>, Oxford: Oxford University Press.</li>\n<li>Mauss, M., 1990 [1923–24], <em>The Gift: forms and functions\nof exchange in archaic societies</em>, London: Routledge.</li>\n<li>McCloskey, D., 2006, <em>The Bourgeois Virtues: Ethics for an Age\nof Commerce</em>, Chicago: University of Chicago Press.</li>\n<li>Mildenberg, C., 2020, “Agent-Democratic Markets”,\n<em>Kriterion: Journal of Philosophy</em>, 34(2): 1–32.</li>\n<li>Mill, J.S., 2004 [1848], <em>Principles of Political Economy with\nSome of Their Applications to Social Philosophy</em>, London:\nPrometheus Books.</li>\n<li>Miller, D., 2001, <em>Principles of Social Justice</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Minsky, H., 1986, <em>Stabilizing an Unstable Economy</em>, New\nHaven/London: Yale University Press.</li>\n<li>Mises, L. v., 1949, <em>Human Action: A Treatise on\nEconomics</em>, New Haven: Yale University Press.</li>\n<li>Mongin, P., 2006, “Value Judgments and Value Neutrality in\nEconomics”, <em>Economica</em>, 73: 257–286.</li>\n<li>Moriarty, J., 2020, “On the Origin, Content, and Relevance\nof the Market Failures Approach”, <em>Journal of Business\nEthics</em>, 165: 113–124.</li>\n<li>Murphy, L., and T. Nagel, 2002, <em>The Myth of Ownership: Taxes\nand Justice</em>, Oxford: Oxford University Press.</li>\n<li>Narveson, J., 1995, “Deserving Profits”, in\n<em>Profits and Morality</em>, R. Cowan and M. .J. Rizzo (eds.),\nChicago: University of Chicago Press, pp. 48–87.</li>\n<li>Nozick, R., 1974, <em>Anarchy, State, And Utopia</em>, New York:\nBasic Books.</li>\n<li>O’Neill, M., and T. Williamson (eds.), 2012,\n<em>Property-Owning Democracy: Rawls and Beyond</em>, Chichester:\nBlackwell.</li>\n<li>Okun, A. M., 1975, <em>Equality and Efficiency: The Big\nTradeoff</em>, Washington: Brookings Institution Press.</li>\n<li>Olsaretti, S., 2004, <em>Liberty, Desert and the Market: A\nPhilosophical Study</em>, Cambridge: Cambridge University Press.</li>\n<li>Otsuka, M., 2003, <em>Libertarianism without Inequality</em>,\nOxford: Oxford University Press.</li>\n<li>Pateman, C., 1970, <em>Participation and Democratic Theory</em>,\nCambridge: Cambridge University Press.</li>\n<li>Pettit, P., 2006, “Freedom in the market”,\n<em>Politics, Philosophy &amp; Economics</em>, 5(2):\n131–149.</li>\n<li>Phillips, A., 2008, “Egalitarians and the Market: Dangerous\nIdeals”, <em>Social Theory and Practice</em>, 34(3):\n439–462.</li>\n<li>–––, 2013, <em>Our Bodies, Whose Property?</em>,\nPrinceton: Princeton University Press.</li>\n<li>Piketty, T., 2014, <em>Capital in the Twenty-First Century</em>,\nCambridge, MA.: Harvard University Press.</li>\n<li>Pistor, K., 2013, “A Legal Theory of Finance”,\n<em>Journal of Comparative Economics</em>, 41(2): 315–330.</li>\n<li>Pogge, T. 2002, <em>World Poverty and Human Rights: Cosmopolitan\nResponsibilities and Reforms</em>, Cambridge: Polity Press.</li>\n<li>Polanyi, K., 1944, <em>The Great Transformation</em>, Boston:\nBeacon Press.</li>\n<li>Radcliffe-Richards, J., 2012, <em>The Ethics of Transplants: Why\nCareless Thought Costs Lives</em>, Oxford: Oxford University\nPress.</li>\n<li>Radin, M. J., 1996, <em>Contested Commodities</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Rawls, J., 1971, <em>A Theory of Justice</em>, Cambridge, MA:\nBelknap Press of Harvard University Press.</li>\n<li>–––, 1993, <em>Political Liberalism</em>, New\nYork: Columbia University Press.</li>\n<li>Ricardo, D., 2005 [1817], <em>Principles of Political Economy and\nTaxation</em>, in <em>The Works and Correspondence of David\nRicardo</em> (Volume 1), Piero Sraffa (ed.), with the collaboration of\nM.H. Dobb, Indianapolis: Liberty Fund.</li>\n<li>Risse, M., 2007, “Fairness in Trade I: Obligations from\nTrading and the Pauper-Labor Argument”, <em>Philosophy,\nPolitics, and Economics</em>, 6(3): 355–377.</li>\n<li>Robeyns, I., 2011, “The Capability Approach”, <em>The\nStanford Encyclopedia of Philosophy (Summer 2011 Edition)</em>, Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2011/entries/capability-approach/\">https://plato.stanford.edu/archives/sum2011/entries/capability-approach/</a>&gt;.</li>\n<li>Roemer, J., 2012, “Ideology, Social Ethos, and the Financial\nCrisis”, <em>The Journal of Ethics</em>, 16: 273–303.</li>\n<li>Rose, D. C., 2011, <em>The Moral Foundations of Economic\nBehavior</em>, New York: Oxford University Press.</li>\n<li>Rothbard, M., 1970, <em>Power and Market: Government and the\nEconomy</em>, Kansas City: Sheed Andrews and McMeel.</li>\n<li>Rousseau, J.J., 1997 [1750ff.], <em>The Discourses and Other Early\nPolitical Writings</em>, Victor Gourevitch (ed.), Cambridge: Cambridge\nUniversity Press.</li>\n<li>Sandel, M. J., 2012, <em>What Money Can’t Buy: The Moral\nLimits of Markets</em>, New York: Farrar Straus Giroux.</li>\n<li>Satz, D., 2010, <em>Why Some Things Should not be for Sale: The\nMoral Limits of Markets</em>, Oxford: Oxford University Press.</li>\n<li>Schumpeter, J., 1942, <em>Capitalism, Socialism and\nDemocracy</em>, New York: Harper &amp; Brothers, </li>\n<li>–––, 1954, <em>History of Economic\nAnalysis</em>, London: Allen &amp; Unwin.</li>\n<li>Schwarz, David T., 2010, <em>Consuming Choices</em>, Plymoth, UK:\nRowman &amp; Littlefield.</li>\n<li>Scott, B. R., 2011, <em>Capitalism. Its Origins and Evolution as a\nSystem of Governance</em>, New York: Springer.</li>\n<li>Sen, A., 1977, “Rational Fools: A Critique of the\nBehavioural Foundations of Economic Theory”, <em>Philosophy and\nPublic Affairs</em>, 6: 317–344.</li>\n<li>–––, 1985, “The Moral Standing of the\nMarket”, <em>Social Philosophy and Policy</em> 3:\n1–19.</li>\n<li>–––, 1993, “Capability and\nWell-Being”, <em>The Quality of Life</em>, M. Nussbaum and A.\nSen (eds.), New York: Oxford Clarendon Press, pp.30–53.</li>\n<li>–––, 1997 [1973], <em>On Economic\nInequality</em>, New York: Oxford University Press.</li>\n<li>Shiffrin, S., 2007, “Intellectual Property”, <em>A\nCompanion to Contemporary Political Philosophy</em>, R. Goodin, P.\nPettit, T. Pogge (eds.), Oxford: Blackwell, 653–668.</li>\n<li>Smith, A., 1976a [1776], <em>An Inquiry into the Nature and Causes\nof the Wealth of Nations</em>, D.D. Raphael and A. L. Macfied (eds.),\nOxford: Clarendon Press (abbreviation: WN).</li>\n<li>–––, 1976b [1759], <em>The theory of moral\nsentiments</em>, D. D. Raphael and A. L. Macfie (eds.), Oxford:\nClarendon Press.</li>\n<li>–––, 1978 [1762/66], <em>Lectures on\njurisprudence</em>, R. L. Meek, D.D. Raphael, and P.G. Stein (eds.),\nOxford: Clarendon Press.</li>\n<li>Smucker, J., 2006, “Pursuing corporate social responsibility\nin changing institutional fields”, in <em>Just Business\nPractices in a Diverse and Developing World</em>, F. Bird and M.\nVelasquez (eds.), Houndsmills, Basingstoke: Palgrave McMillan, pp.\n81–108.</li>\n<li>Storr, Virgil Henry, and Ginny Seung Choi, 2019, <em>Do Markets\nCorrupt Our Morals?</em>, New York: Palgrave Macmillan.</li>\n<li>Taylor, R.S., 2013, “Market Freedom as Anti-Power”,\n<em>American Political Science Review</em>, 107(3):\n593–602.</li>\n<li>Thaler, R. H. and C. R. Sunstein, 2008, <em>Nudge: Improving\nDecisions about Health, Wealth, and Happiness</em>, New Haven: Yale\nUniversity Press.</li>\n<li>Titmuss, R., 1971, <em>The Gift Relationship: From Human Blood to\nSocial Policy</em>, New York: Random House.</li>\n<li>Tomasi, J., 2012, <em>Free Market Fairness</em>, Princeton/Oxford:\nPrinceton University Press.</li>\n<li>Vallentyne, P., and H. Steiner (eds.), 2000,\n<em>Left-Libertarianism and Its Critics: The Contemporary Debate</em>,\nNew York: Palgrave</li>\n<li>Van Parijs, Ph., 1995, <em>Real Freedom for All. What (if\nanything) can justify capitalism</em>, Oxford: Clarendon Press.</li>\n<li>Vrousalis, N., 2019, “Workplace Democracy Implies Economic\nDemocracy”, <em>Journal of Social Philosophy</em>, 50(3):\n259–279.</li>\n<li>Waldron, J., 1993, “Homelessness and the Issue of\nFreedom”, in <em>Liberal Rights</em>, Cambridge: Cambridge\nUniversity Press, pp. 309–338.</li>\n<li>Walzer, M., 1983, <em>Spheres of Justice. A Defense of Pluralism\nand Equality</em>, New York: Basic Books.</li>\n<li>Weber, M., 2002 [1905], <em>The Protestant Ethic and the\n“Spirit” of Capitalism and Other Writings</em>, P. R.\nBaehr and G. C. Wells (eds.), London: Penguin Books.</li>\n<li>Wenar, L., 2015, <em>Blood Oil. Tyrants, Violence, and the Rules\nthat Run the World</em>, Oxford: Oxford University Press.</li>\n<li>Widerquist, K., 2013, <em>Independence, Propertylessness, and\nBasic Income: A Theory of Freedom as the Power to Say No</em>, New\nYork: Palgrave Macmillan.</li>\n<li>Wilmot-Smith, F. 2019, <em>Equal Justice. Fair Legal Systems In An\nUnfair World</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Wright, E. O., 2011, <em>Envisioning Real Utopias</em>, London:\nVerso.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "desert",
            "economics: philosophy of",
            "economics [normative] and economic justice",
            "ethics: business",
            "Marx, Karl",
            "Smith, Adam: moral and political philosophy",
            "socialism",
            "voting"
        ],
        "entry_link": [
            {
                "../desert/": "desert"
            },
            {
                "../economics/": "economics: philosophy of"
            },
            {
                "../economic-justice/": "economics [normative] and economic justice"
            },
            {
                "../ethics-business/": "ethics: business"
            },
            {
                "../marx/": "Marx, Karl"
            },
            {
                "../smith-moral-political/": "Smith, Adam: moral and political philosophy"
            },
            {
                "../socialism/": "socialism"
            },
            {
                "../voting/": "voting"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=markets\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/markets/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=markets&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/markets/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=markets": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/markets/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=markets&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/markets/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "\n<a href=\"http://www.econlib.org\" target=\"other\">Library of Economics and Liberty</a>,\n a collection of texts from the liberal/libertarian tradition.",
            "<a href=\"http://www.marxists.org\" target=\"other\">Marxists Internet Archive</a>,\n collection of texts from the Marxist tradition."
        ],
        "listed_links": [
            {
                "http://www.econlib.org": "Library of Economics and Liberty"
            },
            {
                "http://www.marxists.org": "Marxists Internet Archive"
            }
        ]
    }
}