{
    "url": "modality-epistemology",
    "title": "The Epistemology of Modality",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Antonella Mallozzi\n<amalloz1@providence.edu>\nAnand Vaidya\n<anand.vaidya@sjsu.edu>\nMichael Wallner\n<michaelwallner1@gmail.com>",
        "author_links": [
            {
                "mailto:amalloz1%40providence%2eedu": "amalloz1@providence.edu"
            },
            {
                "mailto:anand%2evaidya%40sjsu%2eedu": "anand.vaidya@sjsu.edu"
            },
            {
                "mailto:michaelwallner1%40gmail%2ecom": "michaelwallner1@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nAntonella Mallozzi\n&lt;<a href=\"mailto:amalloz1%40providence%2eedu\"><em>amalloz1<abbr title=\" at \">@</abbr>providence<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nAnand Vaidya\n&lt;<a href=\"mailto:anand%2evaidya%40sjsu%2eedu\"><em>anand<abbr title=\" dot \">.</abbr>vaidya<abbr title=\" at \">@</abbr>sjsu<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nMichael Wallner\n&lt;<a href=\"mailto:michaelwallner1%40gmail%2ecom\"><em>michaelwallner1<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Dec 5, 2007",
        "substantive revision Fri Jul 7, 2023"
    ],
    "preamble": "\n\nActual facts are facts about how things are. For example,\nMary actually wore her white dress to the party.\nModal facts, by contrast, are facts about how things could,\nmust, or could not have been. For example, Mary could have\nworn her red dress; but she couldn’t have worn a dress\nthat is red and green all over at the same time. Modal reasoning is\ncentral to human cognition, since it is pervasive both in philosophy\nand in every-day contexts. It involves investigating and evaluating\nclaims about what is possible, impossible, essential, necessary, and\ncontingent. Some things could have been different than they actually\nare, other things could not have been. And some things could have more\neasily been true than other things. Here are some examples of\ndifferent kinds of modal claims:\n\nAlthough Antonella, Michael, and Anand are philosophers, they\ncould have been musicians in a band called\nSupervenience.\nWhile Hillary Clinton lost the 2016 election, she could have\nwon.\nIt is impossible for Franco to have parents other than Mario and\nEmilia, since Franco’s parents are essential to him.\nNecessarily, if it is raining, then it is raining.\nIt is impossible for something to fall under both the concept of a\nbachelor and the concept of a married male at the same time.\nMark must be in the room, since I hear him in there.\nIt is not possible for material objects to move faster than the\nspeed of light.\nOne cannot travel from Rome to New York in less than 3 hours.\nLisa can fit both a beach umbrella and a beach chair into the\ntrunk of her car.\nItaly could more easily have been in the 2018 World Cup Final than\nthe U.S.\n\n\nSentences (1)–(10) instantiate different kinds of modality.\n(1–3) are most naturally interpreted to be about\nmetaphysical modality; (4) about logical modality,\n(5) about conceptual modality, (6) about epistemic\nmodality, (7) about physical modality, (8) about\ntechnological modality, and (9–10) about\npractical modality.\n\nFurther examples of modal claims are found at crucial places in\nphilosophical arguments, either in the set of premises or as the\nconclusion.\n\n(St. Anselm) It is necessary that God exists.\n(Descartes) It is possible for the mind to exist without the\nbody.\n(Berkeley) It is impossible for anything to exist\nunperceived.\n\n\nThe epistemology of modality investigates how we can know statements\nlike (1)–(10), as well as modal premises or conclusions in\nphilosophical arguments, such as we find in St. Anselm, Descartes, and\nBerkeley. Traditionally, the central focus of the discipline has been\non knowledge of metaphysical modality. More precisely, the\nepistemology of modality seeks to provide answers to the following\nquestion.\n\n\nGeneral question: How can we come to know, or be\njustified in believing, what is necessary, possible, contingent,\nessential, and accidental?\n\n\n\nRecently, Vaidya and Wallner (2021) have further refined the\nGeneral question by splitting it into two different\nquestions:\n\n\nAccess question: How can we epistemically access the\nmodal realm?\nNavigation question: How should we navigate from one kind\nof modality to another?\n\n\n\nThe Access question investigates how we initially gain\nepistemic access to modal propositions, such as those in\n(1)–(10) or in philosophical arguments.\n\nThe Navigation question presupposes that we have some modal\nknowledge, and then investigates how we can move from one kind of\nmodality to another, such as, e.g., from conceptual to metaphysical\nmodality. In other words, it asks how we come to know that some\nproposition \\(p\\) is, say, metaphysically necessary, given that we\nalready know that \\(p\\) is, say, conceptually necessary. While the\nNavigation question focuses on how we can have a certain kind of modal\nknowledge given that we already have another kind of modal knowledge,\nthe Access question targets the issue of how we can have modal\nknowledge in the first place.\n\nThis entry surveys the current state of the field by paying particular\nattention to how theories of modal knowledge have addressed the Access\nquestion and the Navigation question. (For other surveys: Gendler\n& Hawthorne 2002; McLeod 2005; Evnine 2008; Strohminger and\nYli-Vakkuri 2017; Mallozzi 2021c.) For each theory we discuss, we\npropose a number of critical questions. These questions serve\na dual purpose. They recapitulate the central points for the theories\nand raise concerns about them.\n",
    "toc": [
        {
            "#VariModaTargEpisModa": "1. Varieties of Modality and the Target of the Epistemology of Modality"
        },
        {
            "#ClasScheEpisModa": "2. Classification Schemes in the Epistemology of Modality"
        },
        {
            "#MentCapaInfeMeth": "2.1 Mental Capacities and Inferential Methods"
        },
        {
            "#NeceFirsVsPossFirs": "2.2 Necessity-First vs. Possibility-First"
        },
        {
            "#ModaRatiVsModaEmpi": "2.3 Modal Rationalism vs. Modal Empiricism"
        },
        {
            "#SkepKnow": "3. Skepticism and Knowability"
        },
        {
            "#ConcImagIntuUnde": "4. Conceivability, Imagination, Intuition, and Understanding "
        },
        {
            "#Conc": "4.1. Conceivability"
        },
        {
            "#CounImag": "4.2. Counterfactual Imagination"
        },
        {
            "#IntuUnde": "4.3 Intuition and Understanding"
        },
        {
            "#VariEsse": "5. Varieties of Essentialism"
        },
        {
            "#Perc": "6. Perception"
        },
        {
            "#InduAbdu": "7. Induction and Abduction"
        },
        {
            "#ModaNorm": "8. Modalism and Normativism"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Varieties of Modality and the Target of the Epistemology of Modality\n\nThe broad focus of the epistemology of modality is the so-called\n“alethic” or “objective” modalities. These are\nusually identified with those modalities that respect the T axiom of\nmodal logic, \\(\\Box p \\rightarrow p\\) (if a proposition is necessary,\nthen it is true, where the box stands for necessity). Non-alethic\nmodalities, such as deontic modality (which has to do with obligations\nand permissions, namely what is obligatory for one to do and\nwhat one is permitted to do, according to, e.g., the moral\nnorms, or the law), do not obey the T axiom, since, e.g., even if one\nis obligated to do \\(p\\), they might not do \\(p\\). Although epistemic\nmodalities do respect the T axiom (if one knows that \\(p\\), then \\(p\\)\nis true) they are usually ruled out “by hand”, so to\nspeak, qua non-alethic and non-objective, since they are\nthought to be dependent on the epistemic subject.\n\nAmong the alethic (or objective) modalities we find logical, physical,\nand metaphysical modality. Where \\(p\\) is a proposition,\nlogical and physical modality are standardly defined\nas follows:\n\n\\(p\\) is logically possible iff \\(p\\) is consistent with\nthe laws of logic.\n\\(p\\) is logically necessary iff \\(p\\) follows from the\nlaws of logic.\n\\(p\\) is physically possible iff \\(p\\) is consistent with\nthe laws of nature.\n\\(p\\) is physically necessary iff \\(p\\) follows from the\nlaws of nature.\n\n\nIt is more controversial how one should define metaphysical\nmodality. The traditional approach appeals to alternative ways the\nworld might have been, called\n “possible worlds”.\n\n\\(p\\) is metaphysically possible iff \\(p\\) is true in at\nleast one possible world.\n\\(p\\) is metaphysically necessary iff \\(p\\) is true in\nall possible worlds.\n\n\nAlternatively, philosophers have defined metaphysical modality in\nterms of laws of metaphysics (see, e.g., Kment 2014, 2021;\nfor discussion: Wilsch 2015, 2020).\n\n\\(p\\) is metaphysically possible iff \\(p\\) is consistent\nwith the laws of metaphysics.\n\\(p\\) is metaphysically necessary iff \\(p\\) follows from\nthe laws of metaphysics.\n\n\nIn addition, metaphysical modality has often been characterized as the\nwidest, strongest, most unrestricted, or\nabsolute modality (e.g., Kripke 1980; Lewis 1986; Stalnaker\n2003; van Inwagen 1998; Hale 2013; Williamson 2016). While these are\nmetaphorical labels (and recently the target of several criticisms,\ne.g., Clarke-Doane 2019a, 2019b; Mallozzi forthcoming a), the core\nidea is that metaphysical modality is not restricted by the laws of\nnature and is more substantive than logical-conceptual modality. As\nsuch, it is plausibly the modality of philosophical thinking par\nexcellence.\n\nA helpful diagram to understand the relationship between the three\nmain alethic modalities, namely logical, physical, and metaphysical\nmodality, is the nesting model. The model depicts a nesting relation\namong those modalities, such that what is physically possible is also\nmetaphysically possible, and what is metaphysically possible is also\nlogically possible (see fig. 1).\n\n\n\nFig. 1: Nesting model for\npossibility.\n\n\nConversely, what is logically necessary is metaphysically necessary,\nand what is metaphysically necessary is also physically necessary.\nOther kinds of modality can be suitably added to the model, as well,\nsuch as practical possibility. Practical possibilities would be within\nthe physical possibilities. Importantly, some philosophers question\nwhether metaphysical modality is a distinct and irreducible modality.\nAlternative accounts include inflationism, deflationism, and\nskepticism. Inflationists, such as David Chalmers (2002),\nhold “Modal Monism”, the view that there is only one modal\nnotion or primitive, such that metaphysical and logical modality\ncoincide (more below,\n §4.1).\n Deflationists, such as Sydney Shoemaker (1998), argue that\nmetaphysical modality coincides with physical modality. Skeptics, such\nas Graham Priest (2021), question whether there is a notion of\nmetaphysical necessity that is distinct from both, analytic\nnecessity (which corresponds to conceptual necessity) and\nphysical necessity.\n\nMetaphysical modality is the modality that is typically at\nstake in philosophical argumentation (e.g.,\n St. Anselm’s Ontological Argument,\n Rene Descartes’ Argument for Mind-Body Dualism,\n George Berkeley’s Argument for Idealism).\n Accordingly, the Access Question in the epistemology of modality\nfocuses on how we can access metaphysical modality. Besides\ninvestigating the modal status of philosophical propositions, modal\nepistemologists are also interested in answering common every-day\nmodal questions, such as, could the couch be on the other side of\nthe room? Can Mary climb the tree? Can the cup fit in the\ndrawer?\n\nSome philosophers have recently approached the epistemology of\nmetaphysical modality by first investigating whether some every-day\npropositions are practically possible (as opposed to\nmetaphysically possible) (e.g., Strohminger 2015 and Vetter\nforthcoming). Whether some proposition \\(p\\) is practically\npossible hinges on some specific circumstances that are held\nfixed in a situation—for example, given a particular\nsubject’s physical abilities, or certain environmental\nconditions. While it seems uncontroversial that it is metaphysically\npossible to get the couch to the other side of the room, a specific\nsubject might wonder whether it is practically possible for her to do\nso, given certain circumstances.\n\nThis raises a Navigation Question: How are we to epistemically\nnavigate from practical modality to metaphysical modality? Given that\nwe know that \\(p\\) is practically possible, how do we come to know\nthat it is metaphysically possible? Is this done via some (implicit or\nexplicit) inferential transition? If so, does that imply that we need\nknowledge of some bridge principle between practical and metaphysical\npossibility?\n\nHere it is useful to see the contrast between the Access Question and\nthe Navigation Question again. While the former asks how we initially\nget epistemic access to the modal realm without relying on modal\npremises, the latter asks about how we epistemically navigate from one\n“sphere” or kind of modality to another. We will see that\nwhile the Access Question has traditionally been the main focus in the\nliterature, some recent accounts (like, e.g., Strohminger’s\n(2015), Vetter’s (forthcoming), and, in a sense, Chalmers’\n(2002)) a Navigation Question takes center stage.\n2. Classification Schemes in the Epistemology of Modality\n\nThere are many theories of modal knowledge, and many ways to classify\nthem. In this article we proceed based on the following main\ncategories:\n2.1 Mental Capacities and Inferential Methods\n\nThe distinction between mental capacities and inferential\nmethods is a natural starting point for addressing the Access\nQuestion. The mental capacities that are most discussed in\nthe epistemology of modality are: conceivability, understanding,\nimagination, intuition, and perception. The\ninferential methods are: deduction, induction, and\nabduction. We will see how those notions are spelled out more\nprecisely in the different theories. Mental capacities and/or\ninferential methods that are central to a theory of modal knowledge\noffer a main criterion for classifying theories. Furthermore, theories\nof modal knowledge need not restrict themselves to adopting only one\nmental capacity or inferential method. In fact, they sometimes combine\nthem in various ways.\n\nTheories should not only investigate which specific capacities and\nmethods are involved with modal knowledge, but also in virtue of what\nsuch capacities and methods yield the correct results. Mallozzi\n(2021e) accordingly distinguishes between descriptive and\nnormative tasks with regard to modal reasoning and modal\nknowledge. The descriptive task involves identifying and describing\nthe belief-formation processes and methods that subjects actually\ncarry out in modal reasoning (for example counterfactual reasoning, or\ndeductive inference). The descriptive task does not in itself involve\nanswering the question of how the processes are\ntruth-conducive. This question takes center stage in the normative\ntask, which targets the correctness conditions for such processes and\nmethods. More precisely, a chief normative task for the epistemology\nof modality is to elucidate what constrains such processes or methods,\ni.e., in virtue of what their outputs are correct or incorrect. As a\nnormative inquiry, the epistemology of modality is centrally concerned\nwith what Vaidya and Wallner (2021) call the Problem of Modal\nEpistemic Friction (PMEF). This problem concerns the normative\nrestrictions on candidate capacities or methods. Take, e.g.,\nimagination as a candidate mental capacity in our pursuit for\nmodal knowledge. In order for us to be properly guided to modal\nknowledge, we cannot apply imagination in a completely\nunrestricted manner. If no restrictions would apply, we could\nimagine all sorts of impossible things like water without hydrogen,\ntransparent iron etc. Hence, some restrictions, or\n“epistemic friction creators”, as Vaidya and\nWallner call them, have to be in place. The PMEF asks what the\nepistemic friction creators are and how we come to know them or at\nleast how we come to adequately deploy them in our application of\nvarious capacities and methods in order to be properly guided to modal\nknowledge.\n\nWhile descriptive tasks and normative tasks are distinct, they need\nnot be pursued independently. Normative modal epistemology may, for\nexample, be informed by empirical psychology (the study of\ncounterfactuals is a prominent example), and vice-versa.\n2.2 Necessity-First vs. Possibility-First\n\nHale (2002) draws an important distinction between two different\narchitectures one can use in building an epistemology of modality.\nNecessity-first accounts hold that we first acquire knowledge\nof necessity and then arrive at knowledge of possibility by inferring\nwhat is consistent with what we know to be necessary.\nPossibility-first accounts, by contrast, hold that we first\nacquire knowledge of possibility from which we then generalize to\nknowledge of necessity. Most conceivability-based accounts\n (§4.1)\n implement a possibility-first approach. So do dispositionalist\napproaches as well as Roca-Royes’ similarity-based account, as\nthey all prioritize possibilities\n (§7).\n Counterfactual-based accounts such as Williamson’s\n (§4.2)\n seem instead more neutral concerning the distinction. Finally,\nessence-based accounts\n (§5)\n are usually necessity-first. (For discussion see: Hale (2013),\nRoca-Royes (2017), and Fischer (2017)).\n2.3 Modal Rationalism vs. Modal Empiricism\n\nKant famously argued that what is a priori coincides with\nwhat is necessary, thereby ruling out the category of a posteriori\nnecessities. However, Kripke (1971) pointed out that there are\nnecessary truths that can only be known a posteriori. The\ncontemporary distinction between modal rationalism and modal\nempiricism moves off of Kripke’s (1971) deduction model for\nknowledge of a posteriori necessities. According to Kripke,\nwe proceed based on the conditional “If \\(p\\), then necessarily\n\\(p\\)”, where “\\(p\\)” stands for some fact we can\ndiscover via empirical investigation. For example,\n\n(K1)\nIf Hesperus = Phosphorus, then necessarily (Hesperus =\nPhosphorus)\n(K2)\nHesperus = Phosphorus\n(K3)\nNecessarily, (Hesperus = Phosphorus)\n\n\n(K1)—one\n of the so-called “Kripke conditionals”—is a modal\npremise that instantiates “If \\(p\\), then necessarily\n\\(p\\)”, which he suggests is something we know “by a\npriori philosophical analysis” (1971: 180; 1980: 108). On\nthe other hand,\n (K2)\n is a non-modal, factual premise that we may come to know empirically.\nIt was an empirical discovery that the celestial body that we call\n“Hesperus” for its evening sightings was the same one as\nthe one we call “Phosphorus” for its morning sightings,\nnamely the planet Venus. As a consequence of the empirical\ncontribution of (K2), the conclusion of the argument,\n (K3),\n is also a posteriori. (For further discussion, see Casullo\n1977, 2010; Peacocke 1999). Note that not all instances of “If\n\\(p\\), then necessarily \\(p\\)” will be true. In this paradigm\ncase, \\(p\\) is an identity statement involving rigid designators on\nboth sides. These statements are such that if true, they are\nnecessarily true, which is something most philosophers hold we can\nknow a priori. (See also the entry on\n rigid designation).\n\nModal rationalists accept and accommodate Kripkean a\nposteriori necessities by emphasizing that in a Kripkean\ninference\n (K1)–(K3),\n the modal part,\n (K1),\n is known a priori. Not all epistemologists endorse a\ndeductive picture.\n\nIn general, modal rationalists prioritize a priori\nmethods for acquiring knowledge of metaphysical modality.\n\nBy contrast, modal empiricists pursue a posteriori\naccounts of knowledge of metaphysical modality. Often they still\nacknowledge that a priori methods might contribute to modal\nknowledge. (See Fischer & Leon 2017)\n\nSome philosophers have challenged the philosophical significance of\nthe a priori/a posteriori distinction (e.g.,\nHawthorne 2007; Sosa 2013; Williamson 2007, 2013; for discussion:\nCasullo 2015). We discuss Williamson’s version of the challenge\nin\n §4.2.\n3. Skepticism and Knowability\n\nSkepticism about modal knowledge has received attention in the\nliterature since van Inwagen’s (1998) seminal paper. In this\nentry we largely assume that one can have some knowledge (or\njustified belief) about modality. We will only briefly\npresent the issues and refer to the relevant literature for further\ndiscussion.\n\nThere are two broadly skeptical challenges in the contemporary\nliterature.\n\nThe Integration Challenge (Peacocke 1999): This challenge is\nmodelled after the Benacerraf Problem for\n Platonism in the philosophy of mathematics.\n According to Benacerraf (1973) any robustly realist (platonist)\nstance about mathematical objects like numbers regards them as\nabstract entities outside of space and time, i.e., as\n“platonic” entities. As such, they seem inaccessible to\nus. Unlike ordinary perceptible objects, to which we have a causal\nconnection, it is unclear how we might detect platonic entities in\norder to know about them, since we have no causal connection to them.\nThe possibilities and necessities that modal statements are about also\nseem to be outside of space and time and thus our epistemic access to\nthem seems mysterious. So, on a par with the Benacerraf Problem in the\nphilosophy of mathematics, the Integration Challenge in the philosophy\nof modality consists in providing a plausible account of how we know\nmodal statements, which at the same time fits our modal metaphysics\n(see, e.g., Bueno & Shalkowski 2000; Fischer 2018; Roca-Royes 2020\nfor discussion).\n\nThe Reliability Challenge (Nozick 2001): If we are to be\njustified in believing modal statements, we must have a reliable\nfaculty or a set of reliable faculties working together for forming\nbeliefs of that sort, the existence of which is best explained by\nevolutionary theory. No ad hoc modality-detecting faculty is allowed\nfor explaining modal knowledge. The Reliability Challenge instantiates\nthe desiderata of what is sometimes called\n“anti-exceptionalism” in modal epistemology, according to\nwhich\n\n\nour knowledge of metaphysical modality is continuous with our\neveryday knowledge about the world. (Vetter 2016: 766)\n\n\nSkepticism about extraordinary or philosophical\ncases varies across theories. Van Inwagen (1998) voices skepticism\nabout extraordinary cases by an analogy with vision. We do and should\nwithhold judgment concerning what we see, when it is outside the range\nof reliability in our field of vision. For the farther out objects are\nin our field of vision, the less reliable we are at judging them.\nSimilarly, we ought to withhold judgment concerning what we conceive\nor imagine or infer about modal reality, when they are outside the\nrange of reliability of the specified capacity or method (for\ndiscussion: Barnes 2002, Geirsson 2005, and Strohminger &\nYli-Vakkuri 2018).\n\nVan Inwagen’s moderate skepticism draws attention to the issue\nof the scope of our modal knowledge. Which modal propositions\nare knowable, if any? We can ask whether a certain account targets\nknowledge of just one kind of modality, or more. Focusing on one kind\nof modality, we can also ask whether a given theory aims to account\nfor our access to the whole range of (knowable) modal\npropositions (from the every-day ones to the philosophical ones, from\nthose about abstracta to those about concreta, etc.), or merely to\nsome of them. In the former case the theory might be labeled\nambitious, in the latter, modest (see Wirling 2020).\nSome modest theories, for instance, aim to offer an account of\nordinary modal knowledge, which involves what is possible and\nnecessary for couches and cups, say; but they are either skeptical or\nsilent about extraordinary or philosophical cases, such as whether the\nnumber 2 could have been the number 3 or whether there could have been\nphilosophical\n zombies—i.e.,\n a creature that is physically identical in every respect to a human\nbeing but lacks all phenomenal consciousness.\n4. Conceivability, Imagination, Intuition, and Understanding\n\nHistorically, the notions of imagination, conceivability,\nintuition, and understanding have been prominent in\nexplaining modal knowledge. For Descartes, the source of our modal\nknowledge is a distinctive sort of intellectual grasp based on\nunderstanding, which might be interpreted as a kind of conceiving, or\nintuiting. For Hume, it is imagination as an experientially-informed\ncognitive faculty that is a guide to knowledge of possibility (see\nGendler & Hawthorne 2002). This Humean tradition has been pursued\nin the early stages of post-Kripkean discussions of the epistemology\nof modality by a number of authors, and it has maintained a central\nrole in more recent discussions.\n4.1 Conceivability\n\nIn ordinary pre-theoretical talk, “conceiving” and\n“imagining” may well be used interchangeably; and often\nphilosophers, too, treat those terms roughly as synonymous. In the\nliterature on the epistemology of modality, however,\nconceivability is a technical notion, which may be defined in\ndifferent ways. These are mainly stipulative choices, but it is\nimportant to flag terminological variations across different\ntheories.\n\nBoth Stephen Yablo (1993) and David Chalmers (1996, 2002, 2004, 2010:\nCh. 6) have developed independent accounts of conceivability as a\nsource of modal knowledge (for yet another account based on\nresponse-dependence, see Menzies 1998). Yablo holds that,\nwhen adequately understood, conceivability provides defeasible\nevidence for possibility. In Yablo’s account, the relevant\nnotion of conceivability involves the imaginability of a\nsituation in which a conceived proposition is taken to be true by\nthe subject in question. Yablo offers the following two\nconditionals for describing the appropriate philosophical\nnotion of conceivability which provides evidence of possibility (1993:\n29)\n\n(CON)\n\\(p\\) is conceivable for \\(X\\), if \\(X\\) can imagine a world that\n\\(X\\) takes to verify \\(p\\).\n(INC)\n\\(p\\) is inconceivable for \\(X\\), if \\(X\\) cannot imagine any\nworld that \\(X\\) takes to verify \\(p\\).\n\n\nYablo’s philosophical conceivability\n(CON),\n involves imagining a world that one takes to verify some proposition\n\\(p\\). Note that when imagining a world, we don’t need to\nspecify all the details in the world in imagination. The imagining\nprovides prima facie evidence for the possibility of \\(p\\)\nbecause it involves what Yablo calls an “appearance of\npossibility” (i.e., it seems as if \\(p\\) is possible, given\nthe imagined world). “[T]o imagine an \\(X\\) is thereby to enjoy\nthe appearance that an \\(X\\) could exist” (1993: 30).\n\nImportantly, for Yablo, conceivability, thus understood, helps address\na pressing challenge from the post-Kripkean literature, namely the\nissue of modal error. This is the issue of explaining what\nthe sources of our erroneous modal judgments are (see, e.g., Bealer\n2004 and Yablo 2006). While modal error can in principle affect both\na priori and empirical modal reasoning, Yablo focuses on the\nchallenge to conceivability as a guide to possibility that arises from\nKripke’s cases of the necessary a posteriori. Not being\naware of the fact that Hesperus is Phosphorus, I might find it\nconceivable that one exists without the other; thereby I conclude that\nit is possible for Hesperus to exist without Phosphorus. But that is a\nmodal error. So how does Yablo’s conceivability do us any good?\nFor him, conceivability-based evidence is positive defeasible evidence\nof possibility. When properly understood as specified by\n (CON),\n conceivability confers prima facie justification for the\nmodal belief in question. Yablo draws an analogy with\nperception, which is also a fallible source of knowledge. He\nargues that in the case of perception, the possibility of error and\nillusions does not keep us from assigning prima facie\njustification for beliefs based on perception. Similarly, the\npossibility of modal error in conceivability does not undermine the\nthesis that conceivability provides prima facie evidence for\npossibility. Although for Yablo there is a difference between\nconceivability and perception that makes the former provide more\ndoubtful evidence, the difference is not a matter of fallibility or\nlikelihood of error. Rather, the difference for Yablo lies in the fact\nthat we have a much better story of how perceptual error comes about\ncompared to modal error (see also van Inwagen’s 1998 discussion\nof modal skepticism based on the analogy with vision, as well as\nBealer 2004 for discussion of the sources of modal error). This is\nalso true of debates about intuition as a source of justification (see\nWeinberg 2007). However, while Yablo’s notion of philosophical\nconceivability can answer criticism based on the possibility of modal\nerror, he concedes that more work needs to be done to produce an\nexhaustive account of modal error that will best guard us against\nit.\n\nChalmers (1996, 2002, 2010: Ch. 6) affirms an even stronger link\nbetween conceivability and possibility than Yablo. When adequately\nunderstood, conceivability entails possibility, as opposed to\nmerely providing evidence for possibility. More precisely, the main\nthesis of Chalmers’ Weak Modal Rationalism is\n\n(WMR)\nIdeal, positive, primary conceivability entails primary\npossibility:\n\n\n(WMR)\n is constructed out of three distinctions:\n\nprima facie vs. ideal conceivability\npositive vs. negative conceivability\nprimary vs. secondary conceivability and\npossibility\n\n\nPrima facie conceivability is one’s initial assessment\nof whether a described hypothesis is possible, without engaging in\ncareful reasoning about the hypothesis. Better reasoning often gives\none reason to doubt prima facie conceivability.\nIdeal conceivability, by contrast, involves a kind of\nreasoning that cannot be weakened by further reasoning. If some\nproposition is ideally conceivable, then that proposition is the case\nfrom the perspective of a hypothetical reasoner who is “free of\nall cognitive limitations” (Chalmers 2002: 148) and free from\nerror due to lack of attention. For Chalmers this is sufficient for\nideal reasoning to be safe from modal error. This is why, for\nChalmers, an entailment link between conceivability and\npossibility can be forged only when ideal conceivability is\nin play.\n\nPositive conceivability amounts to coherently imagining a\nscenario in which something is the case. The aim is to “form\nsome sort of clear and distinct conception of a situation in which the\nhypothesis is true” (Chalmers 2010: 144). It need not be a\ncomplete description of a scenario, but it must be\nsufficiently detailed so as to verify the statement being considered.\nBy contrast, negative conceivability is the inability to\na priori rule out a certain scenario. That is, negative\nconceivability amounts to one’s inability to rule out a\npossibility as incoherent based on what one knows. This is often\nweaker than positive conceivability, since it often derives from\nignorance of the relevant facts. For example, if one does not know\nthat water is H2O, they may find the statement “water\nmight not contain hydrogen” conceivable because they cannot rule\nout the statement as a priori incoherent. Conceiving of water\nwithout hydrogen in the positive sense, on the other hand,\nrequires constructing a scenario in which water is present without\nhydrogen at the relevant depth of detail required to verify the claim.\nArguably, that sort of scenario cannot be constructed once one knows\nthe relevant empirical facts, since if they are attentively engaged in\nthe construction they will notice a contradiction between water being\nH2O and hydrogen being absent.\n\nFinally, the distinction between primary and\nsecondary conceivability and possibility pertains to\nChalmers’ version of\n Two-Dimensional Semantics.\n His Epistemic Two-Dimensional Semantics (E2-D) proposes a\nway to address the challenge posed by Kripkean a posteriori\nnecessities, namely the apparent problem that a\nposteriori impossibilities like “water is not\nH2O” seem conceivable. In response, Chalmers holds\nthat “water is not H2O” is not\nsecondarily conceivable, though it is still\nprimarily conceivable. What exactly does this mean?\n\nThe main idea of (E2-D) is that there are two different ways in which\nwe can evaluate statements across possible worlds, i.e., two different\nways of conceiving hypothetical situations, based on two different\nconstraints.\n\nThe first constraint binds what is true in some possible world to what\none knows a priori. A statement is primarily conceivable if\nnothing that is knowable a priori is incompatible with the\nstatement being true. As Chalmers explains, that captures a kind of\nepistemic possibility. Consider again the statement\n“water is not H2O”. The actual chemical\ncomposition of water, H2O, is not knowable a\npriori. So this fact does not constrain what is true in the\npossible worlds in which the existence of water is a priori\nconceivable. Accordingly, “water is not H2O” is\nprimarily conceivable. As Chalmers also puts it, primary\nconceivability amounts to coherently conceiving the situation\ndescribed as actual, namely as a way the world might turn out\nto be.\n\nBy contrast, it has been discovered empirically that water is\nH2O. The second constraint binds what is true at other\npossible worlds to facts about how things actually are. As Chalmers\nexplains, that captures a kind of subjunctive possibility.\nSince chemical composition is arguably essential to substances, such\nas water, it is not secondarily conceivable that water is not\nH2O. As Chalmers also puts it, secondary conceivability\namounts to coherently conceiving the situation described as\ncounterfactual, namely as a way the world might have been,\ngiven how our world is. Thus:\n\n(PrimC)\nA statement \\(S\\) is primarily conceivable when it is\nconceivable that the situation described in \\(S\\) is actually\nthe case.\n(SecC)\nA statement \\(S\\) is secondarily conceivable when it is\nconceivable that the situation described in \\(S\\) might\ncounterfactually have been the case. (cf. Chalmers 2002:\n157)\n\n\nTo further clarify, for Chalmers expressions have two dimensions of\nmeaning or content: a primary intension and a secondary\nintension. In the case of sentences describing Kripkean a\nposteriori necessities like “water is H2O”,\nthese are two different propositions. The primary intension of an\nexpression like, e.g., “water”, picks out a referent at a\nworld considered as actual; namely, roughly based on the descriptive\ncontent that a speaker a priori associates with the\nexpression. Thus, at any world we consider, the primary intension of\n“water” picks out whatever substance satisfies some\ndescription such as “the liquid drinkable stuff in lakes and\nrivers etc.” (or, otherwise put, whatever plays the water role).\nAt any world we consider as actual, “water” will pick out\nsuch a substance. Secondary intensions, by contrast, pick out the\nreferent of an expression at a world considered as counterfactual,\nnamely based on the way a speaker evaluates a given expression\ncounterfactually, given how the actual world is. That\nrequires acknowledging that water is H2O. Assuming, as\nusual, that having a certain chemical composition is essential to\nbeing a certain kind of substance, the secondary intension of\n“water” picks out H2O compounds at all worlds\n(otherwise put, it picks out what actually plays the water role). At\nany world we consider as counterfactual, “water” will pick\nout H2O. Accordingly, sentences like “water is\nH2O” are secondarily necessary but\nprimarily contingent. For, while it is possible that the\nliquid drinkable stuff in rivers and lakes etc. is not H2O,\nit is not possible that water isn’t H2O. Thus,\naccording to Chalmers, ideal positive primary conceivability allows us\nto access a specific kind of possibility, namely primary possibility,\nwhich are sometimes secondarily impossible. While there is a primary\npossibility in which water isn’t H2O, there is no\nsecondary possibility in which water isn’t H2O.\n\nHowever, primary possibility is no less “real” than\nsecondary possibility. Chalmers argues that there is only one space of\nworlds or that “conceptual=logical=metaphysical possibility (at\nthe level of worlds)” (1999: 478). This is what he calls\n“Modal Monism”. What varies, within modal space, is not\nthe kind of worlds we are considering (namely\n“merely” logically-conceptually possible versus\n“genuinely” metaphysically possible); but rather the\ntruth-values of the expressions under examination at a given world,\ndepending on whether we consider their primary or secondary\nintensions. Because of Modal Monism, within Chalmers’ framework\nevery primary possibility is thus a metaphysical possibility,\nthough it might not be a secondary possibility. “Water is not\nH2O” is ideally positively primarily conceivable, and\ntherefore primary possible. Given Modal Monism, Chalmers can thus\nargue that “water is not H2O” is a\nmetaphysical possibility, while also resisting the challenge\nposed by the Kripkean a posteriori necessities. For\n“water is not H2O” is a primary possibility but\nnot a secondary possibility, given that “water” actually\npicks out H2O.\n\nSo, by adopting Modal Monism, Chalmers places primary possibility\nwithin the same modal realm as secondary possibility. This guarantees\nthat primary possibility is no less “real” or\n“genuine” than secondary possibility (indeed, as Chalmers\nputs it, “these worlds are all first-class metaphysical\npossibilities” [2002: 165]) Thus, the kind of possibility that\nis entailed by primary, positive, ideal conceivability, is a\nmetaphysical one.\nCritical Questions for Conceivability\n\nThe Connection Question: This is the central question\nthat conceivability theorists like Yablo and Chalmers try to answer.\nHow is conceivability connected to possibility? Given that\nmetaphysical modality is an objective modality that is\nmind-independent, while conceivability is subject-sensitive and\nmind-dependent, how are the two connected such that conceivability may\nentail, or at least provide evidence for possibility? Answering the\nConnection Question should thus clarify how mind-dependent\nconceivability may provide one with justification for believing that\nsomething is mind-independently possible.\n\nThe Scope Question: This question further specifies\nthe Connection Question, by asking how conceivability can effectively\ncast light on matters of metaphysical possibility, as opposed\nto logical-conceptual possibility. Remember that primary\nconceivability is a purely a priori exercise based on\nconsiderations of (ideal) logical and conceptual coherence of a\ndescribed scenario. What ensures that conceivability exercises so\nconstrained successfully capture metaphysical modality? Within\nChalmers’ framework: what ensures that primary possibilities are\nthemselves metaphysical possibilities? Several philosophers have\nargued that assuming Modal Monism is not a satisfying answer (for\ndiscussion: Soames 2004; Vaidya 2008; Mallozzi 2021b).\n\nThe Navigation Question: Granted\n (WMR),\n we might still wonder about knowledge of secondary\npossibility. Is there any a priori way of inferring secondary\npossibility from primary possibility? Simply put: can we navigate\na priori from primary to secondary possibility? Chalmers thinks\nthat in some special cases we can. Such cases require that an\nexpression’s primary and secondary intensions coincide.\nCandidate examples include, most notably, the class of phenomenal\ntruths as well as mathematical and analytic truths (Chalmers 2010: ch.\n6). However, that raises a worry that on Chalmers’\nconceivability theory we won’t be able to have a priori\naccess to most of the modal metaphysical realm. Conceivability seems a\nlimited resource for knowledge of metaphysical modality.\n\nThe Dependence Question: Suppose conceivability does\nprovide justification for believing that something is possible. Does\nit succeed in doing so because conceivability operates on some prior\nbeliefs about the considered scenario? For example, does\nconceivability guide one to the belief that a round square is\nimpossible because one knows what squares and circles are, and by\nexamining their definition one can arrive safely at the conclusion\nthat such objects are impossible? Similarly, does one simply find\nwater in the absence of hydrogen possible because one either\nsuppresses the knowledge that water contains hydrogen or one does not\nknow that water does contain hydrogen? In the first case,\nconceivability would seem to depend, to an important extent on,\nunderlying linguistic or conceptual knowledge (along the lines of\nanalytic accounts of the a priori more generally). In the\nsecond case, conceivability would depend on both linguistic or\nconceptual knowledge and empirical knowledge. In both cases,\nadditional essentialist knowledge might be needed (e.g., Kment 2021;\nGoff 2021; and Roca-Royes 2011a). In Vaidya and Wallner’s\n(2021),\n (§2),\n the critical point of the Dependence Question is the following: In\norder for our conceivability exercises to appropriately justify our\nmodal judgments, those conceivability exercises need to be constrained\nby some crucial information about the (essence of) the entities\ninvolved in them, creating the needed epistemic friction for\nconceivability. In effect, the Dependence Question is concerned with\nthe issue of the source of modal knowledge. Is conceivability an\nultimate source of modal knowledge, or is it derivative,\nnamely dependent on another source, such as linguistic or conceptual\nknowledge and essentialist knowledge? (see also Berto & Schoonen\n2018).\n\nThe Human Capacity Question: Conceivability theorists\nhold that, under appropriate conditions, conceivability provides\njustification for believing that something is possible. We saw how\nYablo and Chalmers spell out such conditions in presenting their\nrespective notions of conceivability. But clarifying what the relevant\nconditions are for conceivability to yield modal knowledge still\nleaves open an important question. Do humans ever satisfy those\nconditions? For example, one might agree with Chalmers that some ideal\nsort of conceivability entails possibility, but also question whether\nwe can satisfy the requirements of ideal rational reflection\n(see, e.g., Worley 2003 and Martínez 2013).\n\nThe Relevant Depth Question: This targets the content\nof the imagined situation or world that the subject takes to verify\nsome proposition \\(p\\). In what detail do we have to imagine\na world \\(w\\) in order for the fact that \\(p\\) seems true in \\(w\\) to\nconfer evidence for the possibility of \\(p\\)? (see van Inwagen 1998)\nThe issue of relevant depth has to do with what imagined\ndetails are needed to justify a possibility judgment, e.g., is it\nenough to imagine a human brain functioning normally while not having\nany experiences to justify the possibility of a philosophical\nzombie?\n\nThe Self-Defeat Question: Suppose that some thesis\naccording to which a certain sort of conceivability entails a certain\nsort of possibility—call it (CP)—is true. Is it then\nconceivable that (CP) is false? If that is conceivable, or so\nHowell (2008) and Mizrahi and Morrow (2015) have argued, then, by\n(CP), it is possible that (CP) is false. However, if (CP) is possibly\nfalse, (CP) is actually false. For a counterexample to the entailment\nrelation falsifies the entailment relation. Thus, if we can conceive\nof (CP) failing, it follows that (CP) is self-defeating.\n4.2 Counterfactual Imagination\n\nTimothy Williamson (2007) has developed a theory of modal knowledge\nbased on our capacity for counterfactual reasoning, which\ndistinctively deploys imagination in the development of a\ncounterfactual. The topic of\n imagination\n has gained widespread attention in contemporary debates within\nphilosophy, logic, and the cognitive sciences. The focus has been on\nthe epistemic uses of imagination for both quotidian non-modal\nknowledge (e.g., knowledge of others’ mental states, learning,\nplanning and decision making) as well as various kinds of modal\nknowledge (see, e.g., Currie & Ravenscroft 2002; Kind & Kung\n2016; Kind 2020; Badura & Kind 2021; Kosslyn, Ganis, &\nThompson 2003; Nichols 2006). Theories of modal epistemology that rely\nto various extents on imagination need not be rationalist; in fact,\nthey are often empiricist. Here we only discuss Williamson’s\ncounterfactual imagination account. For further work on\nimagination-based accounts, whether rationalist or empiricist, see,\ne.g., Gregory (2004, 2010, 2020), Byrne (2007), Kung (2010), Ichikawa\nand Jarvis (2012), Casullo (2012a), and Lam (2018) (On the other hand,\nnote that Hill 2006, Kroedel 2012, and Kment 2014 have offered\ntheories of modal knowledge that variously appeal to counterfactuals\nand counterfactual reasoning, which do not centrally involve\nimagination).\n\nWilliamson’s central thesis is that knowledge of metaphysical\nmodality is a “special case” of knowledge of\ncounterfactual conditionals. As he puts it,\n\n\nthe ordinary cognitive capacity to handle counterfactual conditionals\ncarries with it the cognitive capacity to handle metaphysical\nmodality. (2007: 136)\n\n\nThe capacity for modal knowledge can thus be thought of as a byproduct\nof our capacity for counterfactual thinking. For Williamson\ncounterfactual thinking is largely imaginative thinking. When we\nassess a given counterfactual, we evaluate the consequent on the\nsupposition of the antecedent by developing the supposition through an\nimaginative exercise. This typically involves the\n“offline” application of our cognitive capacities. More\nprecisely, Williamson holds that in imagination we often transpose\n“online” cognitive skills that are originally developed in\nperception into corresponding offline cognitive skills (2013).\n\nWilliamson supports the thesis that knowledge of metaphysical modality\nis a special case of imaginative counterfactual knowledge with logical\nequivalences between sentences using counterfactual operators and\nmodal operators, aimed at showing that statements of possibility and\nnecessity can be reformulated in counterfactual terms in a\nstraightforward way:\n\n(NEC)\n\\(\\Box A \\text{ iff } (\\neg A \\boxarrow \\bot)\\)\n\n(it is necessary that \\(A\\) iff if it were not the case that\n\\(A\\) a contradiction would follow)\n(POS)\n\\(\\Diamond A \\text{ iff } \\neg (A \\boxarrow \\bot)\\)\n\n(it is possible that \\(A\\) iff it is not the case that if\n\\(A\\) were true a contradiction would follow)\n\n\nThus, we can identify the following two key theses in\nWilliamson’s counterfactual theory:\n\n\nLogical Equivalence: metaphysical possibility and\nnecessity can be proven to be logically equivalent to counterfactual\nconditionals.\nEpistemic Pathway: the method of counterfactual\ndevelopment carried out in imagination can provide one with knowledge\nof metaphysical modality.\n\n\n\nThe two are importantly interconnected in that Epistemic\nPathway is partly based on Logical Equivalence. As\nWilliamson puts it,\n\n\nmodulo the implicit recognition of this equivalence, the epistemology\nof metaphysically modal thinking is tantamount to a special case of\nthe epistemology of counterfactual thinking. (2007: 158)\n\n\nRelying on equivalences\n (POS)\n and\n (NEC),\n we come to know about possibility and necessity by developing\ncounterfactual suppositions in imagination in a search for a\ncontradiction.\n\nIn order to see how this works, let us first look at an evaluation of\nan “ordinary” every-day counterfactual. Consider the\nfollowing example from Williamson:\n\n\nSuppose that you are in the mountains. As the sun melts the ice, rocks\nembedded in it are loosened and crash down the slope. You notice one\nrock slide into a bush. You wonder where it would have ended if the\nbush had not been there. A natural way to answer the question is by\nvisualizing the rock sliding without the bush there, then bouncing\ndown the slope into the lake at the bottom. Under suitable background\nconditions, you thereby come to know the counterfactual:\n\n(Rock)\nIf the bush had not been there, the rock would have ended in\nthe lake (2007: 142)\n\n\n\nAs Williamson explains, the general procedure we use to arrive at\n (Rock)\n is the following:\n\n\n[O]ne supposes the antecedent and develops the supposition, adding\nfurther judgments within the supposition by reasoning, offline\npredictive mechanisms, and other offline judgments. The imagining may\nbut need not be perceptual imagining. All of one’s background\nbeliefs are available from within the scope of the supposition as a\ndescription of one’s actual circumstances for the purposes of\ncomparison with the counterfactual circumstances… Some but not\nall of one’s background knowledge and beliefs are also available\nwithin the scope of the supposition as a description of the\ncounterfactual circumstances, according to complex criteria… To\na first approximation: one asserts the counterfactual conditional if\nand only if the development [of the antecedent] eventually leads one\nto add the consequent. (2007: 152–153)\n\n\nThe same procedure can be applied to evaluate the counterfactuals that\nfigure in\n (NEC)\n and\n (POS),\n in order to gain modal knowledge. Based on the logical equivalence in\n(POS), we can come to know “\\(\\diamond A\\)” by knowing\n“\\(\\neg(A \\boxarrow \\bot)\\)”. And we know the latter\nthrough a counterfactual development, much like in the\n (Rock)\n example. For example, we might assess whether it is\nmetaphysically possible for the rock to have ended in the\nlake, by using the logical equivalence (POS). The simple procedure\nwill be to counterfactually suppose that the rock did end in the lake\nand check whether a contradiction would follow, as we develop that\nsupposition in imagination as “realistically” as we can\n(2007: 142).\n\n(Rock-POS)\nIf the rock had ended in the lake no contradiction would have\nfollowed.\n\n\nIf\n (Rock-POS)\n is true, we are warranted in asserting that it is metaphysically\npossible for the rock to have ended in the lake.\n\nIn addition, based on the logical equivalence\n (NEC),\n we can come to know “\\(\\Box A\\)” by knowing “\\(\\neg\nA \\boxarrow \\bot\\)”. And we know the latter through a\ncounterfactual development of the antecedent of the counterfactual\n(“\\(\\neg A\\)”), much like in the\n (Rock)\n example. If the counterfactual development of “\\(\\neg\nA\\)” yields a contradiction (i.e., the consequent of the\ncounterfactual in question), we assent to the counterfactual and\nthereby come to know that A is necessary. To take another example from\nWilliamson:\n\n\nIf we know enough chemistry, our counterfactual development of the\nsupposition that gold is [not] the element with atomic number 79 will\ngenerate a contradiction. (2007: 164)\n\n\nWe thereby come to know that it is necessary that gold is the element\nwith atomic number 79.\n\nOn Williamson’s account we can generally trust our capacity for\nassessing counterfactual conditionals in imagination, as this is\ninformed and disciplined by a great amount of background knowledge\nconcerning the workings of nature. This background information\nincludes general knowledge of chemical, physical, and other basic\nscientific facts, as well as some grasp of the causal and natural\nlaws. On any given occasion, we keep some of this background knowledge\nfixed within the scope of the supposition as we carry out our\ncounterfactual evaluations. Goodman’s (1955) classical\nproblem of cotenability concerns the question of\nwhich facts or beliefs are cotenable with the antecedent of\nthe counterfactual conditional. That is, which facts or beliefs are to\nbe held fixed in a counterfactual development? As we will see, many\nhave raised concerns about what to count as cotenable when evaluating\na counterfactual supposition. Crucially, background knowledge also\ninvolves some grasp of “constitutive” facts, as Williamson\nsometimes calls them. These apparently include essentialist facts and\nprinciples—for example, Williamson mentions Kripke’s\nprinciple of the necessity of origins, which holds that the material\norigins of an entity are essential to it.\n\nThere is also a more general reason why Williamson’s method for\nmodal knowledge should be reliable. Williamson stresses that knowledge\nof counterfactuals is pervasive for human decision-making, planning,\nand theory construction in science (2007). In his (2016) he further\nconjectures that imagination as a source of knowledge might even have\ngiven us an evolutionary advantage as a species, as opposed to being a\nmere accidental byproduct of our evolutionary history. Thus, insofar\nas modal knowledge proceeds via the reliable method of counterfactual\ndevelopment in imagination, we should also rest assured that we will\nget at the right answers concerning matters of metaphysical modality.\n(Note that this may offer an answer against Nozick’s 2001\nevolution-based skepticism about our knowledge of metaphysical\nmodality).\n\nFurthermore, for Williamson modal knowledge typically has a special\nepistemic status which is in between the a priori\nand a posteriori categories. In Williamson’s\nterminology, the kind of knowledge in question is\n“armchair”. That is, on the one hand, the knowledge in\nquestion isn’t strictly a posteriori, since apparently\nwe can’t fully derive it from empirical experience. And, on the\nother hand, such knowledge doesn’t fit the model of a\npriori knowledge, either, since arguably background information\nfrom science, and experiential contribution more generally, plays a\nrole that goes beyond merely enabling concept possession and use.\nWilliamson also contends that the a priori / a posteriori\ndistinction is in general too superficial or it “doesn’t\ncut at the epistemic joints” (2013: 8. For discussion, see e.g.\nBoghossian 2011, Boghossian and Williamson 2020; Casullo 2013; Jenkins\n2008; Mallozzi 2021d; Malmgren 2011).\n\nWilliamson’s view straddles the division between\nrationalist and empiricist accounts. Thus, for\nWilliamson we can gain knowledge of metaphysical modality thanks to a\ncombination of\n\nour capacity for carrying out counterfactual reasoning in\nimagination, as constrained by our background knowledge of the world\n(Epistemic Pathway),\n\n\ntogether with\n\nsuitable logical equivalences that guarantee that modal statements\nare equivalent to counterfactual statements (Logical\nEquivalence).\n\nCritical Questions for Counterfactual Theory\n\nWe can divide the central critical questions for Williamson’s\ncounterfactual theory based on whether they target (Epistemic\nPathway) or (Logical Equivalence) more specifically. We\nstart with the latter.\nAgainst (Logical Equivalence)\n\nThe Counterpossibles Question: Some philosophers\nquestion Williamson’s purported logical equivalence between\ncounterfactual statements and modal statements (Berto, French, Priest,\n& Ripley 2018; Jago 2021). Particularly, in order for\n (NEC)\n to hold, one has to accept that all counterpossibles (namely\ncounterfactual conditionals with impossible antecedents) are vacuously\ntrue. But this is controversial. Many have given arguments defending\nfalse counterpossibles based on modal semantics that include\nimpossible worlds (e.g., Berto et al. 2018; Brogaard & Salerno\n2013; Jago 2013; Nolan 1997; Restall 1997). Questioning the truth of\nWilliamson’s logical equivalences might constitute a challenge\nfor the overall theory of modal knowledge, since, as we saw,\n(Epistemic Pathway) is partly based on (Logical\nEquivalence).\nAgainst (Epistemic Pathway)\n\nThe Epistemic Fallacy Question: Some contend that\neven if Williamson’s purported equivalences are true, it\ndoesn’t follow that we know metaphysical modality through the\nsame cognitive processes by which we know counterfactual conditionals\n(Jenkins 2008; Casullo 2012b; for discussion see Yli-Vakkuri 2013).\nModal reasoning might well require using different cognitive-epistemic\nmethods than those we supposedly employ in counterfactual reasoning.\nFor example, imagination might not play an epistemic role in the\nacquisition of modal knowledge. Appealing to a logical equivalence,\nwhile perhaps necessary, is not sufficient for establishing the\ncorrect epistemology. Otherwise put, (Logical Equivalence)\ndoesn’t suffice for (Epistemic Pathway).\n\nThe Circularity Question: Several authors have\ncritically pointed out that Williamson’s method of\ncounterfactual evaluation appears to rely on pre-existing knowledge of\nwhat Williamson sometimes calls “constitutive facts”.\nThese are most commonly taken as facts about the essence of\nobjects. Now, if we take essentialist facts to be modal in that the\nessence of something is the way it must be, this reliance is\nproblematic for it might make Williamson’s epistemology of\nmodality circular (see, e.g., Boghossian 2011; Tahko 2012; Roca-Royes\n2011b). In response, Williamson might contend that his account is not\nmeant to reduce modal knowledge to counterfactual knowledge, but\nrather only to clarify how the one may be a special case or byproduct\nof the other (Morato 2019). Furthermore, Williamson might hold that\nsubjects need not have explicit modal knowledge in order to carry out\ntheir counterfactual evaluations, namely they need not know that some\nfacts are necessary. Instead, subjects only need to be somehow\nreliably sensitive to those facts (Yli-Vakkuri 2013; for discussion\nsee Vaidya & Wallner 2021).\n\nThe Normative Constraints Question: Let us assume\nthat there is no real threat of circularity for Williamson’s\naccount. Several authors point out that the background knowledge that\none needs to keep fixed in our counterfactual evaluations is still\nproblematic in a number of ways. One classical question concerning the\nevaluation of counterfactuals is the problem of cotenability.\nWhich facts or beliefs are cotenable with the antecedent of\nthe counterfactual conditional? Which background knowledge or\ninformation do we hold fixed? For example, to investigate the\ncounterfactual “If the bush had not been there, the rock would\nhave bounced into the lake” we imaginatively consider what would\nhappen to the rock if the bush had not been there. To do this, we\nimagine a scenario without the bush. That is, we dispense with the\nfact that the bush blocks the rock. However, do we also\ndispense with the fact that something (else) blocks the rock?\nWe might hypothesize that some other obstacle gets in the way. If we\nretain this fact as we develop the scenario, then the rock would have\nstopped anyway. Yet the truth in the story that Williamson is assuming\nis that the rock would have bounced into the lake. So we must not hold\nfixed the fact about an obstacle. Why not, though? What principle\ndetermines that in Williamson’s example it is a mistake to hold\nfixed the obstacle fact but correct to hold fixed facts like the\nmomentum of the rock and the presence of the lake?\n\nWilliamson broadly appeals to our “sense of how nature\nworks”, which includes for example some general knowledge of\nchemistry and physics (“folk” physics as Williamson says),\nsome grasp of the causal laws, as well as, more tentatively, certain\nconstitutive or essentialist facts or principles. But it is not clear\nwhat exactly goes into this list, and most importantly in virtue of\nwhat. Williamson’s account arguably leaves the Problem of Modal\nEpistemic Friction (see\n §2)\n unanswered. In addition, Tahko (2012) wonders how we should select\nthe relevant background knowledge and constitutive facts when that\ninvolves deciding between rival scientific hypotheses. Similarly,\nRoca-Royes (2011b, 2012) questions not only whether we possess\nconstitutive knowledge (say, of atomic numbers); she also remarks\nthat, even if we do possess such knowledge, it is unclear what\ncognitive mechanisms are responsible for us reliably telling apart the\nconstitutive facts from the non-constitutive facts. More generally,\nMallozzi (2021e) argues that while Williamson’s account offers\nan important empirical hypothesis concerning the cognitive\n(imaginative) processes involved with modal reasoning, it overlooks\ncrucial normative questions for the epistemology of modality, which\ninvolve clarifying what the relevant constraints on modal reasoning\nare, and why they count as correct.\n\nThe Scope Question: Several authors doubt that\nWilliamson’s theory successfully accounts for knowledge of\nmetaphysical modality, particularly as opposed to causal-nomological\nmodality. For example, Lowe (2012) argues that since counterfactual\nknowledge is strictly causal-nomological knowledge, Williamson’s\ntheory may only explain the latter, and not knowledge of metaphysical\nmodality. The idea is that Williamson can’t really explain how\nwe know that water is necessarily H2O unless he explicitly\nbrings in extra principles—e.g., essentialist principles (for\nfurther arguments to the same effect see, e.g., Deng 2016; Gregory\n2017; Tahko 2012; and Thomasson 2021).\n4.3 Intuition and Understanding\n\nThe epistemology of modality is importantly connected to the\nepistemology of the\n a priori,\n as many believe that at least some modal knowledge is purely a\npriori (modal rationalism). Some philosophers have\nproposed that either\n intuition\n or understanding, or both of them combined, can provide an account of\na priori knowledge and justification, which may be fruitfully\napplied to the epistemology of modality. Others have explicitly\noffered an intuition-based or understanding-based account of modal\nknowledge. (For an empirically informed discussion of intuition see\nentry on\n experimental philosophy.)\n\nPhilosophers such as Bealer (1998, 1999a,b ), BonJour (1997), Pust\n(2000), Huemer (2001, 2005), Koksvik (2011), and Chudnoff (2013), have\ndeveloped accounts of the a priori that appeal to intuition\nas the source of a priori knowledge and justification. Most\nof them take intuition to form a natural kind of seeming\nstate that is non-reducible to either belief or inclinations to\nbelieve; rather it is sui generis. On the other hand,\nphilosophers like Boghossian (1996, 2000), Jackson (2000); Hale and\nWright (2000); and Peacocke (1999, 2000) have highlighted various ways\nin which appealing to understanding of meaning may contribute to\nexplaining a priori knowledge and justification. Here we\ndiscuss a few accounts that directly connect the epistemology of the\na priori with the epistemology of modality.\n\nAccording to BonJour, intuition is a direct grasp or “rational\ninsight” into “the necessary character of reality”\n(1997: 107). This occurs when we “see or grasp or apprehend in a\nseemingly direct and unmediated way” (1997: 101) the necessity\nof a proposition. This grasping “depends upon nothing beyond an\nunderstanding of the propositional content itself” (1997: 102).\nBy explicitly providing knowledge of necessity, intuition, as cashed\nout by BonJour, is thus a main source of modal knowledge.\n\nImportantly, many that defend intuition hold that they are fallible\nand revisable, and arguably only reliable in certain domains. Still,\nintuitions minimally provide prima facie justification, which\nmight be defeated by further reasoning or empirical evidence. As\napplied to modal knowledge, intuitions provide at least prima\nfacie a priori justification for our modal beliefs and/or for\nsome basic essentialist principles. For example, consider (RG):\n\n(RG)\nNothing can be red all over and green all over at the same\ntime.\n\n\nBonJour maintains that we directly grasp the necessity of\n (RG).\n For him, (RG) is self-evident or just seems necessarily\ntrue. So, on the view that intuitions justify, our intuitions provide\nat least prima facie justification for (RG). (See Levin 2007\nfor skepticism about the justificatory status of intuitions in\nrelation to essentialism, such as the essentiality of origins or\nfundamental kind; for further discussion see\n arguments for origin essentialism\n in the entry on\n essential vs. accidental properties.)\n\nGeorge Bealer (1996, 1998, 1999a,b, 2002; Bealer in Bealer &\nStrawson 1992) integrates understanding and intuition in order to\nexplain knowledge of modality. As an intuitionist, Bealer takes\nintuitions to count as (prima facie) evidence. According to\nBealer’s Modal Reliabilism “something is a basic\nsource of evidence iff it has an appropriate kind of reliable tie to\nthe truth” (Bealer 1999a: 34). He articulates a notion of\ndeterminate understanding (or determinate concept possession)\nthat casts light on how our modal intuitions can be appropriately\ntruth-tracking and, thus reliable. Roughly, determinate\nunderstanding (or concept possession) excludes any partial\nmisunderstanding or incomplete understanding of the concept(s) in\nquestion. It ultimately amounts to a form of understanding that is\nincorrigible by improvement of the subject’s cognitive\ncondition or conceptual repertoire (see Bealer 2002: 104). So, if we\ndeterminately understand a specific concept, we will have\ntruth-tracking intuitions (and therefore also truth-tracking modal\nintuitions) about propositions in which this concept is involved.\nFor example, it is because one determinately understands the concepts\nof a square and a triangle, that their intuition\nthat nothing can be both a square and a triangle is truth-tracking\nand, thus, provides them with evidence that it is impossible\nfor something to be both a square and a triangle.\n\nChristopher Peacocke (1999, 2002) explicitly puts forward an account\nof modal knowledge that appeals to understanding and tacit knowledge\nof certain modal principles, while it eschews the role of intuition.\nPeacocke tackles the Integration Challenge and, in particular, the\nfact that we lack a causal connection to modal facts and properties as\ncommonly understood in the metaphysical framework of possible worlds.\nHe believes that the best way to solve the problem is to adopt\nModerate Rationalism, which\n\n\nseeks to explain cases of a priori knowledge by appeal to the\nnature of the concepts that feature in contents that are known a\npriori (2004: 199).\n\n\nMore precisely, Peacocke holds that understanding of metaphysical\nmodality, namely the concepts of possibility and necessity, consists\nin having implicit knowledge of what he calls Principles\nof Possibility, which include principles concerning the rules of\nconcept use, as well as constitutive (or essentialist) principles.\nThese principles govern understanding and evaluation of modal\ndiscourse and accordingly are implicitly known and deployed by\nsubjects that correctly understand the modal concepts. Crucially, for\nPeacocke, these principles are necessary truths, and\nunderstanding and being able to deploy them is essential to modal\nthinking and evaluation. As he puts it,\n\n\nwe must be able to identify some of [these principles] if reasoning\nwithin the scope of counterfactual suppositions is to proceed. (1999:\n173)\n\n\nTalk of a subject’s tacit knowledge of the\nPrinciples of Possibility might suggest that Peacocke’s theory is\nmodelled on the way in which principles of grammaticality govern how\nnormal adult speakers understand and evaluate grammaticality in their\nnative language. Classic Chomskian theory holds that adult speakers\nhave some grasp or tacit knowledge of certain principles of grammar\ngoverning correct expression and communication in our natural\nlanguage. However, Peacocke makes an important qualification to\nthe analogy with the Chomskian view. Although an ordinary thinker\nmight not be able to state the Principles of Possibility explicitly,\nshe will have reasons supporting her modal\njudgements, i.e., some way of articulating the beliefs or conceptions\nsupporting her judgments of possibility and necessity. In this sense,\nPrinciples of Possibility “bear a much closer relation to [one’s]\npersonal-level modal thought than do the principles of grammar to his\nthought about his own language” (1999: 164).\n\nFor a recent view that combines understanding of meaning and intuition\nfor knowledge of modality, see Boghossian Ch. 13 in Boghossian and\nWilliamson 2020.\nCritical Questions for Intuition- and Understanding-Based Accounts\n\nThe Causal Connection Question: One might wonder\nhow intuition might justify beliefs about modal facts and\nproperties that we are not causally or spatio-temporally connected to.\nHow can intuition yield knowledge of modality if there is no causal\nconnection between possible worlds and minds? If there is no causal\nconnection between the mind and the modal fact, what kind of epistemic\nconnection could an intuition provide us with? (For discussion see\nBealer 2002).\n\nThe Justification for Implicit Knowledge Question:\nSonia Roca-Royes (2010) draws attention to the following problem in\nPeacocke’s epistemology of modality. On Peacocke’s\naccount, it appears that our knowledge or understanding of modality is\nparasitic on our knowledge of the Principles of Possibility, which are\nthe principles anyone who possesses the concept of possibility tacitly\nknows. But how do we know such principles in the first place, or,\nequivalently, how does one manage to possess the right\npossibility-concept? We determine that something is possible or\nnecessary for an entity in part through our tacit knowledge of them,\nwhich includes knowledge of what is constitutive of the entity, namely\nwhat it is to be the kind of thing in question. As a consequence of\nthe relation between the role of constitutive principles and our\nevaluation of specific modal claims for the purposes of generating\nmodal knowledge, a comprehensive account of modal knowledge is\nincomplete without a picture of how we come to know the relevant\nconstitutive principles involved in our evaluations of modal\nknowledge. Peacocke has taken up this challenge in recent work (2020).\nMore recently, Roca-Royes (2019) has generalized similar concerns to\nany account of modal knowledge that rests on concept possession and\nunderstanding.\n\nThe Implicit to Explicit Knowledge Question: We said\nthat for Peacocke our knowledge or understanding of modality is\nparasitic on our knowledge of the Principles of Possibility. However,\nit seems somewhat unclear how our tacit knowledge of\nPrinciples of Possibility exactly gives us explicit knowledge of modal\nfacts. In other words, it seems that Peacocke owes us an answer to the\nfollowing question: How exactly are we to epistemically move from\n(implicit) knowledge of Principles of Possibility to (explicit)\nknowledge of modal facts or propositions so that knowledge is\ntransmitted? In answer to this question Peacocke offers the\nfollowing:\n\n\nIf it is granted that implicit knowledge of the Principles of\nPossibility is appropriately employed in reaching modal judgement, we\ncan see how the judgement so reached is knowledge. Provided that any\nnon-modal principles upon which she relies are known, a\nthinker’s modal judgements reached by the proper use of the\nimplicit knowledge of the Principles of Possibility will, in the\nnature of the case, be knowledge. This is not only a matter of\nreliability. The judgement of the modal truth is explained by the\nthinker’s implicit grasp of principles which make the modal\ntruth hold. (1999: 162)\n\n\nHowever, this leaves open what it means exactly to appropriately\nemploy the Principles of Possibility. Finally, thinking of the debate\nbetween internalism and externalism in epistemology, it is relevant to\nask whether our implicit knowledge of the Principles of Possibility\nguides our judgment in a way such that this is accessible to\nthe subject.\n5. Varieties of Essentialism\n\nEssentialism has recently become a major area of investigation in the\nepistemology of modality. Essentialist accounts of modal knowledge\ndraw on results from recent metaphysical debates about essence.\nGenerally, metaphysical\n essentialism\n is the thesis that, in addition to mere accidental\nproperties, entities also have essential properties.\nTraditionally, essential properties have been analyzed as those that\nnecessarily belong to the objects that they pertain to. In\nhis influential (1994) article, however, Kit Fine has argued against\nthis analysis or reduction of essence to necessity. Fine provides\ncounterexamples to the traditional view by pointing out that there are\nproperties that an entity \\(x\\) has necessarily, though it is\nplausible that they do not belong to the essence of \\(x.\\) The notion\nof essence that Fine is working with is a broadly Aristotelian notion,\naccording to which the essence of an entity \\(x\\) is the real\ndefinition of \\(x\\). Real definitions are contrasted against\nnominal definitions. Nominal definitions define words that\nstand for entities in the world, while real definitions\ndefine entities themselves by telling us what is essential to them.\n(Note that the explanation of essence in terms of real definition is\nnot intended to be a reductive one.) For example, the nominal\ndefinition of “water” is, say, the drinkable liquid that\nis found in rivers and lakes on Earth, while the real definition of\nwater is H2O. (Note that, besides Aristotle, this\ndefinitional notion of essence is already present in\n Locke\n and\n Husserl.)\n\nMost essentialist accounts in the epistemology of modality rely on\nthis Finean (or Neo-Aristotelian) notion of definitional essence. The\nrejection of the traditional account of essence, according to which\nessence reduces to necessity, paved the way for what can be called\nFinean Essentialism (FE), a very influential view in the\nmetaphysics of modality.\n\n(FE)\nMetaphysically necessities are true in virtue of (or: are\n grounded\n in) essentialist truths.\n\n\nSince our focus here is on essentialism as it is employed in the\nepistemology of modality, we refer readers interested in\nmetaphysical issues concerning (FE) elsewhere. (For discussion in\nfavor of (FE), see Lowe 2008, 2012; Hale 2002, 2013, 2018; Kment 2014,\n2021; Rosen 2015; Jago 2021; Tahko 2017, 2018; Wallner 2020; Wallner\n& Vaidya 2020; and Wilsch 2017. For criticism, see Della Rocca\n1996a,b; Gorman 2005; Zalta 2006; Correia 2007; Cowling 2013; Wildman\n2013; and Livingstone-Banks 2017; as well as Leech 2018; Mackie\nforthcoming; Noonan 2018; Romero 2019; Van Cleve 2018; and Wildman\n2021.)\n\nThe core idea of essentialist accounts in the epistemology of modality\nis that we acquire modal knowledge on the basis of knowledge of\nessence. But note that\n (FE),\n i.e., the fact that essences metaphysically ground modality,\nby no means entails that knowledge of modality must proceed\nvia knowledge of essence. Otherwise put, metaphysical priority\ndoesn’t require epistemic priority. Nonetheless, on the basis of\n(FE) essentialists identify knowledge of essence as one chief pathway\nto modal knowledge.\n\nOne of the reasons for the growth of interest in essentialism in the\nepistemology of modality stems from the criticism or incompleteness of\nother accounts based on understanding, conceivability, or\ncounterfactual reasoning. An understanding-based theory such as\nPeacocke’s, for example, naturally integrates an essentialist\ncomponent by identifying the constitutive principles for modal\nknowledge with essentialist principles. Likewise, theories of\nconceivability such as Chalmers’ and Yablo’s, as well as\nWilliamson’s counterfactual theory, have been criticized for\nfailing to take adequate account of the role of essences in the\nacquisition of modal knowledge (e.g., Roca-Royes 2011a,b; Tahko 2012;\nVaidya & Wallner 2021).\n\nThe essentialist claim that our modal knowledge depends on our\nessentialist knowledge raises two main questions:\n\nHow do we gain knowledge of essences in the\nfirst place?\nHow do we transition from essentialist\nknowledge to modal knowledge?\n\n\nFollowing Fine, E.J. Lowe (2008, 2012) characterizes the essence of\n\\(x\\) as the real definition of \\(x\\). Lowe’s answer to\n (a)\n is thus straightforward: we know the essence of \\(x\\) simply by\nunderstanding what x is. Unfortunately, Lowe does not\nelaborate on his notion of understanding (see Tahko 2017,\n2018 for discussion). Instead, he puts forward a transcendental\nargument for the claim that we have knowledge of essence. According to\nthis,\n\n\nKnowing an entity’s essence is simply knowing what that entity\nis. And at least in the case of some entities, we must be\nable to know what they are, because otherwise it would be\nhard to see how we could know anything at all about them. (Lowe 2012:\n944; see Sgaravatti 2016 for criticism)\n\n\nCrucially, “knowing what things are” is meant to\ncapture knowledge of properties without which the object in question\nwould not be the thing it is. That is to say, Lowe does not talk about\nmere contingent classifications (such as, say, being a gift\nor being located at the doorstep) but essential properties\nthat figure in the real definition of a thing.\n\nBob Hale’s (2013, 2021) answer to\n (a)\n is twofold. He distinguishes between a priori and a\nposteriori knowledge of essence. In the case of a priori\nknowledge of essence, essentialist knowledge is based on knowledge of\nmeaning. Hale acknowledges the difference between\nreal and nominal definitions. He then argues that\nsometimes both a nominal and a real definition of an entity \\(x\\) can\nbe given by using the same words. For example, Hale argues that\nknowing the nominal definition of the word “rectangle”,\nnamely knowing the necessary and sufficient conditions for the\napplication of the word, suffices for knowing a priori the\nreal definition or essence of being a rectangle (i.e., a\nfour-sided closed figure consisting of four right angles).\n\nAdditionally, Hale maintains that even where there is no\nexplicit nominal definition for a word, like for example in\nthe case of basic logical constants, such as “and”,\n\n\nknowing what [the word] “and” means is sufficient for\nknowledge of the essence of truth-functional conjunction. (Hale 2013:\n258)\n\n\nSo, for Hale we can gain knoweldge of essence a priori via\nboth implicit and explit knowledge of meaning.\n\nOn the other hand, with regard to a posteriori knowledge of\nessence, Hale relies on a Kripke-style deduction model.\n\n(H1)\nIf some \\(x\\) is \\(F\\), then it is essential to \\(x\\) that it is\n\\(F\\).\n(H2)\n\\(x\\) is \\(F\\).\n(H3)\nThus, it is essential to \\(x\\) that it is \\(F\\).\n\n\nOf course, (H1) is not going to be true for all instances of \\(x\\) and\nF. However, Hale thinks that one can come to know in an a\npriori manner claims such as if x is human, then it is\nessential to x that it is human. Similarly, we know that it is\nnot true that if \\(x\\) is a musician, then it is\nessential to \\(x\\) that she is a musician. According to Hale,\nthis is done by distinguishing between pure and impure\nsortals (2013: 270–275). So, for Hale, the major premise in\n(H1) is known a priori. The minor premise in (H2) might be a\npiece of a posteriori knowledge, such as, e.g., that Joanie\nis a human. When (H2) is a posteriori, the conclusion (H3) is\nalso a posteriori, since the combination of an a\npriori premise and an a posteriori premise always yields\nan a posteriori conclusion.\n\nIn sum, Hale holds that knowledge of essences can be gained from\nknowledge of meaning as well as from knowledge that is established via\nempirical investigation. By contrast, for Lowe the source of knowledge\nof essence is understanding, which is different from both knowledge of\nmeaning and empirical investigation. (Still, Lowe doesn’t mean\nto rule out that a posteriori knowledge may contribute to our\nknowledge of essence, especially concerning kinds. See Tahko (2017,\n2018) for discussion of Lowe’s view concerning empirical\nknowledge of essence.) Although Hale and Lowe’s views on how we may\ngain knowledge of essences differ, they agree on how knowledge of\nessences can give us in turn modal knowledge, namely by deductive\ninference. The argument is as follows:\n\n(E1)\nIf it is essential to \\(x\\) that it is \\(F\\), then it is necessary\nthat \\(x\\) is F.\n(E2)\nIt is essential to \\(x\\) that it is \\(F\\).\n(E3)\nThus, it is necessary that \\(x\\) is \\(F\\).\n\n\nAs we saw, inferring\n (H3)\n from\n (H1)\n and\n (H2)\n yields knowledge of essence. Then, inferring (E3) from (E1) and (E2)\nis to use knowledge of essence to gain knowledge of necessity.\n\nBoris Kment (2021) puts forward an account of modal knowledge based on\nhis own modal metaphysics (2014). On Kment’s metaphysical\nframework, modal facts are partially grounded in what he calls\nmetaphysical laws, which also comprise essentialist\ntruths. Thereby, much of our modal knowledge for Kment depends on\nknowledge of the metaphysical laws, including essentialist truths.\nKment discusses two ways in which we may acquire knowledge of such\nlaws (i.e., two ways to answer\n question (b)\n above). First, abductively, via inference to the best\nexplanation (IBE). Second, we may come to know the metaphysical laws\nby relying on our conceptual or linguistic competence.\n\nAs to the first method, Kment holds that metaphysical laws (including\nessentialist principles) play a crucial role in both metaphysical and\ncausal explanation. Accounting for what grounds or causes some\nnon-fundamental fact crucially involves making assumptions about\nmetaphysical laws. As for IBE, Kment holds that\n\n\nan abductive inference that establishes the account [of grounding or\ncausation] will support these assumptions about metaphysical laws as\nwell. (Kment 2021: S1969)\n\n\nFor example, according to our best explanation, the fact that my cup\nof coffee is hotter than your glass of iced tea is grounded in the\nfact that the mean molecular kinetic energy of the former is higher\nthan that of the latter. Within Kment’s framework, this account\nentails that there is a certain metaphysical covering law that is\ninstantiated in this particular instance of grounding. In this case,\nthe law in question is the real definition or essence of\nbeing-hotter-than: one object is hotter than another iff the\nmean molecular kinetic energy of the former exceeds that of the\nlatter. In effect, for Kment, the epistemology of metaphysical\n(essentialist) laws is a byproduct of the abductive\nepistemology of grounding and causation.\n\nAs for the method of conceptual competence, Kment remarks\nthat competence with a term often requires (at least implicit)\nknowledge of part or all of the real definition of the thing\npicked out by the term. For Kment, real definitions are a type of\nessentialist truths. To have competence in using the notions of\nmetaphysical necessity and possibility, one must know, at least\ntacitly, that metaphysical modality is connected to metaphysical laws,\nincluding laws that govern what is essential. (For a similar view, see\nPeacocke 1999,\n §4.3\n above. The role of linguistic competence in the acquisition of\nessentialist knowledge has also been stressed by Hale 2013, 2021).\n\nThus, Kment’s theory answers\n question (a)\n by appealing to IBE and conceptual competence. But what is his answer\nto\n question (b),\n namely, how are essentialist knowledge and modal knowledge connected?\nBy contrast with Lowe and Hale, who appeal to deductive inference from\nknowledge of essence to knowledge of necessity, Kment holds that\nessentialist knowledge contributes to our modal knowledge by\nrestricting methods such as conceiving and counterfactual reasoning,\nin other words, by providing epistemic friction, in the\nterminology introduced above. His account, thus, indicates a possible\nanswer to (PMEF) (see\n §2).\n\nMark Jago (2021) also offers an essentialist account of modal\nknowledge. According to Jago, we can explain our knowledge of\nmetaphysical modality by way of our (implicit or explicit) knowledge\nof essence. Like others, Jago aims to refute long-standing skepticism\nagainst essences; to do so, he lays out a metaphysical account\naccording to which essences are simply bundles of located\nproperties:\n\n\nEssences are constitutive of material objects. Located\nproperties “bundle” together to form a material object;\nand each property in the bundle is essential to the material object\nthereby constituted. Each material object is numerically identical to\na located bundle of its essential properties. (Jago 2021: S1987; see\nalso Barker & Jago 2017)\n\n\nMoreover, for Jago we can refer and single out these bundles\nstraightforwardly, in thought or language, by conceptualizing them\nunder kinds. According to Jago,\n\n\nthere is a tendency linking (i) reference to a material object, (ii)\nour conceptualising that object under some kind \\(F\\), and (iii) our\nbelief that that object is essentially \\(F\\). (2021: S1992)\n\n\nNotwithstanding some exceptions to this tendency, Jago takes it to be\nappropriately reliable and safe from nearby error. On Jago’s\nexternalist epistemology of essence, a belief constitutes\nknowledge if it has an appropriate connection to reality. He takes\nreliability and safety to constitute such an appropriate connection to\nreality. Hence, Jago concludes that\n\n\n[w]hen one has a referent \\(a\\) in mind and conceptualises it under\nsome kind \\(F\\), and thereby believes it to be essentially \\(F\\), that\nbelief will often constitute knowledge that \\(a\\) is essentially\n\\(F\\). (Jago 2021: S1992)\n\n\nKnowledge of essence is thus secured by a reliable connection with\nreality, which is due in part to the way we think about objects and\nform beliefs about them. Knowledge of essence, in turn, leads us to\nknowledge of necessity and possibility via a conceptual connection\nbetween essence and necessity. For Jago, “it is a conceptual\ntruth that whatever is essentially \\(F\\) is necessarily \\(F\\)”;\n(2021: S1994) thereby, possessing the concepts of\n“essence” and “necessity”, together with the\nrelevant essentialist knowledge jointly results in knowledge of\nnecessity.\n\nAn account pairing essentialism with modal empiricism comes out of\nAntonella Mallozzi’s (2021a, 2021e) work. According to Mallozzi,\nwe can clarify what the normative constraints on good modal reasoning\nare by appealing to essences. Specifically, she maintains that\nessences are special core properties that have distinctive explanatory\npowers in accounting for how things are—as she puts it, essences\nare superexplanatory. Mallozzi focuses on examples involving\nkinds and illustrates how essences typically cause and explain many\nproperties and behaviors that consistently co-occur in the instances\nof kinds. For example, the atomic constitution of a chemical element,\nsay silver, explains why all samples of silver share a whole host of\nproperties, such as density, electrical and thermal conductivity,\ndisposition to combine chemically, and so on. Atomic number is, thus,\nthe essence or “nature” of silver, for Mallozzi, because\nof its powerful role in explaining the properties shared by all\nsamples of silver. Accordingly, given\n (FE),\n silver necessarily has that atomic constitution. Against\nlong-standing skepticism against essences, Mallozzi emphasizes that\nsuch superexplanatory one-to-many causal structures helps clarify in\nwhat sense essences are held to constitute the “nature” of\nthings, as well as how we can know about them. (Godman, Mallozzi,\n& Papineau 2020 further investigate the metaphysics of kinds in\nterms of superexplanatory properties, particularly for biological\nkinds.) Mallozzi gives a moderate empiricist answer to\n question (a)\n above. In most cases we acquire knowledge of essence empirically,\nlargely via scientific investigation aimed at discovering the relevant\ncausal and explanatory information. As to\n question (b),\n Mallozzi holds that once we have knowledge of essence, we may then\nproceed to gain knowledge of metaphysical necessity inferentially, via\na fundamental Kripkean bridge-principle (“If \\(X\\) is\nessentially \\(F\\), then necessarily \\(X\\) is \\(F\\)”).\n\nVaidya (2010) has proposed an account of our knowledge of essence that\nis influenced by Husserl’s (1973) method of eidetic\nvariation, according to which we get access to the essence of an\nobject by varying its features in imagination. If a feature is seen to\nbe invariant, then it is an essence. In contrast to other\nessentialists discussed here, Vaidya explicitly targets\nunderstanding and not knowledge of essence.\n(Following Kvanvig 2009, Vaidya takes understanding [but not\nknowledge] to be compatible with epistemic luck.) Taking\nHusserl’s ideas only as a point of departure, Vaidya holds that\nwe can gain understanding of the essence of some object \\(x\\) by\nvarying properties of \\(x\\) in our imagination. Of those properties\nthat are invariant over the multiplicity of variations, we judge that\nthey are essential to \\(x\\). (See Wallner forthcoming for a discussion\nof Husserl’s epistemology of essence in contrast to that of Lowe\nand Hale, and Michels (2020) for a critical discussion of Vaidya.)\nCritical Questions for Essentialism\n\nThe Existence Question: Some are skeptical that there\nis a real distinction between accidental and essential properties.\nQuine (1953 [1961], 1960) argued that whether or not a property is\nessential to an object depends on how we refer to it. More recently,\nSidelle (1989) has provided an anti-realist view of essences. Mackie\n(2006) and Ásta (2008, 2010, 2013) have offered a critique of\nrealist approaches to essences. Further criticism of essences comes\nfrom recent philosophy of science. Particularly, several philosophers\nof biology have criticized biological essentialism (e.g., Ereshefsky\n2010; Leslie 2013; Okasha 2002; for discussion: Devitt 2021; Dumsday\n2012).\n\nThe Metaphysics of Essence Question: If knowledge of\nmodality depends on (or crucially involves) knowledge of essence, then\nwhat essences are metaphysically influences any story about how we\nknow about essence and, hence, modality. Hence, the following\nmetaphysical questions concerning essences are crucial for the\nepistemology of essence: What are essences? Are they the sum of the\nessential properties of a given entity, or kind? Are essences distinct\nentities from those things that they are essences of? Is (knowledge\nof) essence linked to (knowledge of) de dicto or de\nre necessity (or both)? Are there individual essences\nwhich uniquely identify a certain entity or only general essences that\npertain to kinds of entities? Do all entities have exactly the same\nkind of essence? For example, do social kinds have the same kind of\nessence that natural kinds, or mathematical kinds have?\n\nNonetheless, on the basis of\n (FE)\n essentialists identify knowledge of essence as one chief pathway to\nmodal knowledge.\n\nThe Transition Question: A central question for\nessentialism concerns the transition between knowledge of essence and\nknowledge of modality (see\n question (b)\n above). For deduction theories that deploy the inference from\n (E1)\n and\n (E2)\n to\n (E3),\n one should ask: how is the bridge-principle connecting essence to\nmodality, (E1), known? Horvath (2014) argues that it isn’t clear\nhow we come to know the bridge principle (E1). As Horvath remarks, a\n(purportedly non-modal) real definition or essence-statement (like\n“gold is essentially the element with the atomic number\n79”) doesn’t make any explicit claim about metaphysical\npossibility or necessity. Because of that, definitional essences do\nnot seem generally capable of explaining or grounding metaphysical\nmodality. As Mackie (forthcoming) puts it:\n\n\nIt looks as if the account of essence in terms of real definition is\nintended to deliver a modal rabbit out of a non-modal hat. And I\ndon’t see how this can be done.\n\n\nRecently, however, Wallner and Vaidya (2020) have proposed a\nnon-reductive interpretation of Finean Essentialism,\naccording to which\n (E1)\n follows from the essence of essences in virtue of the fact that\nessences have modal bearing. Essences via their modal bearing\nconstrain what is objectively necessary and possible for a given\nentity. Hence, their view might provide an answer to this\nquestion.\n\nThe Language to Essence Question: Some essentialist\naccounts hold that knowledge of meaning or conceptual competence\nimportantly contributes to knowledge of essence (e.g., Hale’s\nand Kment’s). This raises a more specific transition question\nconcerning how we get to knowledge of essence via linguistic or\nconceptual competence. It might be argued that we acquire knowledge of\nessence by reflecting on our conceptual-linguistic practices.\nHowever, how could our conceptual or linguistic practices tell us what\nare the essential natures of mind-independent things? Most theorists\nappeal to implicit knowledge of essence. But what does this\nmean, exactly? Particularly, how do we find out what we know\nimplicitly?\n\nThe Completeness Question: According to Hale’s\nepistemology of essence, we can come to know essentialist facts by\ndeducing them from essentialist principles (like in the inference from\n (H1)\n and\n (H2)\n to\n (H3)).\n However, one might ask whether knowledge of the essentialist\nprinciple in (H1) is not itself already essentialist knowledge. In\nother words, it might be questioned whether such an account of\nessentialist knowledge can be complete (for discussion: Wallner\nforthcoming). Wallner (forthcoming) also points out that in order for\nus to successfully employ Hale’s distinction between pure and\nimpure sortals that is supposed to differentiate essential from\ninessential properties, we might have to presuppose essentialist\nknowledge.\n6. Perception\n\nTraditionally, modal epistemologists have assumed that we cannot gain\nknowledge of modality by investigating what is actually the case (see,\ne.g., Craig 1985; Peacocke 1999). In particular, it seems that our\nperceptual capacities on their own cannot yield knowledge of\nwhat is possible and necessary. Perception, so the story goes, shows\nus at best how things are, not how they could have been or must be. If\nnecessity is truth in all possible worlds, and perception\nonly provides us with evidence for how the actual world is, how can we\nperceive necessity? Similarly, if non-actualized possibilities have no\ntruth-maker in the actual world, since they are non-actualized, how\ncan we perceive possibility? One might infer from how things\nare that they might be a certain way, but how can one perceive how\nthings merely could be? In light of these considerations,\nperception has been thought to be categorically inappropriate for\ngaining modal knowledge. Recently, modal epistemologists have\nchallenged the traditional stance. In particular, some have switched\nthe focus of the epistemology of modality from far out claims about\nthe possibility of zombie worlds to every-day modal claims, such as\nwhether the couch could make it up the stairs, or that Joel can climb\nthe boulder.\n\nMargot Strohminger (2015) uses practical examples of modal knowledge\nto challenge the idea that we cannot perceive possibility. For\nexample, at least in some instances we seem to be able to see\nthat we can climb a tree (even if we have not yet climbed\nit), or that we can reach a certain mug (even though we have not yet\ntried). In Strohminger’s view, one literally perceives the\npossibility, rather than seeing something first and then making a\n(possibly tacit) inference on the basis of what one sees. Importantly,\na defense of the pure perception of possibility requires a view of\nperception where something more than low level properties, such as\ncolor and shape, are present in perception. One class of views on\nwhich perception provides more than just low-level properties are\naffordance theories, due to Gibson (1979). On an affordance view, one\nmay hold that possibility is part of what we perceive. For example,\nIris sees that the door knob can be turned.\n\nBarbara Vetter has recently expanded her work on the metaphysics of\npotentiality (2015) and developed a perceptual account of modal\nknowledge based on every-day cases and affordance views of perception\n(see Gibson 1966; see also Nanay 2011, 2013). According to Vetter\n(2021), we literally see potentialities or possibilities as part of\nthe content of our perception. In her (forthcoming) she emphasizes\nthat her account is ambitious. In her view, all of our modal\nknowledge is based on knowledge of our own abilities and dispositions,\nas well as the dispositions and affordances of objects around us.\nModal knowledge is, thus, for Vetter, distinctively empirical, in that\nit requires experiencing such dispositions and affordances.\n\nWhile Strohminger and Vetter focus on knowledge of non-actual\npossibilities, Catherine Legg and James Franklin (2017) hold that one\ncan perceive necessities visually through certain kinds of\ndiagrams, such as picture proofs in mathematics. The diagrams\nthemselves provide us with a perceptual path to seeing that certain\nkinds of truths are necessary (see also Legg 2012).\nCritical Questions for Perceptual Theories\n\nThe Is-It-Really-Perception Question: Does sensory\nperceptual experience on its own really give knowledge of what is\npossible or necessary, or does the knowledge use rational intuition\nabout the perceived content as well? If we literally see that\nsomething is possible, what does its possibility look like? What is a\nvisual appearance of being possible?\n\nThe Modal Kind Question: What kind of modality does\none perceive? For example, when I see that I can reach a mug, what\nkind of modality is it that I see? One view is that what I see is\npractical possibility. And if that is so, this raises the\nNavigation question of how one is to epistemically\nnavigate from practical possibility to metaphysical possibility.\nDo we navigate from practical to metaphysical possibility by (tacit)\ninference via the background assumption that whatever is practically\npossible is also metaphysically possible? Or does this background\nassumption inform our perceptual practices to the effect that we\nindeed directly perceive metaphysical possibility?\n7. Induction and Abduction\n\nSonia Roca-Royes and Bob Fischer both take a modest approach to the\nepistemology of modality. Roca-Royes (2017, 2018) divides the space of\nepistemological investigation via the ontological distinction between\nconcrete and abstract entities. In a 2017 work she offers a\nsimilarity-based account of our knowledge of de re modality\nfor concrete entities. And in her (2018) she offers an account of\nmodal knowledge for abstract entities. Fischer (2017) divides the\nspace of epistemological investigation via a topical distinction\nbetween ordinary and extraordinary claims.\n\nRoca-Royes aims to answer the question: how can we come to know what\nis possible for a particular entity? A starting point for her account\nis the following example:\n\n\nI know that the wooden table in my office, Messy, is not broken. How\ndo I know that? I see it. Although not broken, Messy can break. How do\nI know that? Because the table I had before Messy, which we may call\n“Twin-Messy”, was a twin-sister of Messy, and it broke;\nand I know that Twin-Messy broke because I saw it. (Roca-Royes 2017:\n226)\n\n\nHer account can be unfolded as follows:\n\n(RR1)\n\\(S\\) knows (via perception, say) that Twin-Messy actually\nbroke.\n(RR2)\n\\(S\\) knows that what is actual is possible.\n(RR3)\nSo, \\(S\\) can warrantedly transition to: It is possible\nthat Twin-Messy breaks.\n(RR4)\n\\(S\\) knows that “objects similarly made out of the same\nsort of materials are susceptible to similar effect” (2017:\n227).\n(RR5)\n\\(S\\) knows that Messy is similarly made out of the same sort of\nmaterials as Twin-Messy was made.\n(RR6)\nSo, \\(S\\) can warrantedly transition to: It is possible\nthat Messy breaks.\n\n\nCrucial to Roca-Royes’s account is the notion of an\nepistemic counterpart, whereby \\(a\\) is an epistemic\ncounterpart of \\(b\\) just in case there’s a point in each of\n\\(a\\)’s and \\(b\\)’s timelines where they are relevantly\nsimilar (e.g., made from the same kind of materials) and, in virtue of\nthis, what has happened to a informs us of what could happen\nto \\(b\\). In the example: Twin-Messy’s breaking informs us that\nMessy can break. Premise\n (RR4)\n plays a major role in Roca-Royes’ account. She calls the\nknowledge at stake here nomic-like (2017: 229) and clarifies\nthat it is supported inductively, since it heavily relies on\nthe uniformity of nature.\n\nFischer (2017) proposes a Theory-Based Epistemology of\nModality, TEM, for extraordinary or philosophical modal claims.\nThe basic idea is that we are justified in believing an extraordinary\nmodal claim, \\(m\\), only if we are justified in believing a theory\n\\(T\\) from which \\(m\\) follows. For example, we are justified in\nbelieving that mind-body dualism is metaphysically possible only if we\nare justified in believing a theory \\(T\\) from which mind-body dualism\nfollows. Importantly, Fischer holds that abductive methods\nfor theory choice, such as using theoretical virtues like simplicity,\nare central to being justified in believing a theory. If the theory\n\\(T\\) from which one would be justified in believing that mind-body\ndualism is metaphysically possible is not the simplest\ntheory, all else being equal, then one would not be justified\nin believing it, and thus not be justified in believing that mind-body\ndualism is metaphysically possible.\n\nFor other discussions involving abduction see Hanrahan (2017), who\ndiscusses it in the case of imagination, Biggs (2011), who discusses\nit in the context of conceivability, and Biggs and Wilson (2021), who\ndiscuss it in relation to Carnap and anti-realism. Importantly, for\nWilson and Biggs abduction is an a priori enterprise.\nCritical Questions for Induction and Abduction\n\nThe Relevant Similarity Question: Generalizing\n (RR4)\n above, Roca-Royes speaks of relevant similarity of an object with its\ncounterpart. But what are the relevant respects of similarity, and how\ndo we know that? This seems to be the most crucial question in\nRoca-Royes’ account. Roca-Royes addresses the issue of relevant\nand irrelevant similarity for the concrete cases she discusses in her\n2017 work (like Messy and Twin-Messy). However, Roca-Royes concedes\nthat the details for the generalizability of these considerations\nabout relevant similarity are still to be worked out in full detail.\n(For further critical discussion of Roca-Royes’ account see\nPrelević 2015)\n\nThe Priority Question: Fischer’s TEM makes it\nseem that our justification for extraordinary modal claims always\ncomes by way of having a theory first. However, one might wonder if\nsometimes we have justification for extraordinary modal claims prior\nto building theories that would justify them. Consider the\nfollowing:\n\nFor Berkeley, it is inconceivable for a tree to exist unperceived\nby anyone.\nIf \\(p\\) is inconceivable for \\(S\\), then \\(S\\) has justification\nfor believing that p is impossible.\nSo, Berkeley has justification for believing that it is impossible\nfor a tree to exist, or anything for that matter, unperceived by\nanyone.\nIdealism is the view that existence depends on perception.\nEsse est percipe.\nSo, Berkeley has justification for idealism.\n\n\nHowever, Fischer’s TEM appears to hold that Berkeley must first\nbelieve with justification Idealism, for him to believe that a tree\ncannot exist unperceived by anyone. This result appears to contradict\nhow we sometimes use conceivability to gain justification in order to\nbelieve a theory. (For further critical discussion of Fischer’s\naccount, see Biggs 2017 and Wirling 2020).\n8. Modalism and Normativism\n\nSome authors have recently tried to solve the Integration and the\nReliability Challenge by rejecting well-established views in modal\nmetaphysics.\n\nOtávio Bueno and Scott Shalkowski (2015) adopt\nmodalism about modality. They maintain that there is no\nreductive analysis of modality in terms of non-modal facts or\nproperties. For arguably one cannot reduce the truth of “It is\npossible that \\(P\\)” to “It is true in some world, \\(w\\),\nthat \\(P\\)” without wondering whether or not \\(w\\) itself is\npossible or impossible. The epistemological task for Bueno and\nShalkowski is thus to provide an account of how we come to know modal\ntruths while accepting a primitivist view of modality. In this way,\nBueno and Shalkowski aim to meet the Integration Challenge.\n\nBueno and Shalkowski describe their account of our knowledge of\nnon-actual possibilities as follows:\n\n\nOn our account, what grounds modal knowledge is ultimately our\nknowledge of the relevant modal properties of the objects under\nconsideration. … Suppose we are trying to determine whether we\nknow that the table Hemingway used to write on in his Key West house\nwould have broken had a 26,000-pound giant African bull elephant sat\non it. …On our account, we know that it would have broken\nsimply by knowing the properties that such an elephant has and the\nproperties the table has, modal in character as they already are.\n(2015: 680).\n\n\nThe core idea is that in many cases we arrive at modal knowledge by\ninvestigating the relevant properties and objects in question rather\nthan turning to some special epistemic capacity, such as being\nconceivable. For example, one can know that it is possible for an\nunbroken table to break because it is breakable. How do we come to\nknow this piece of ordinary modal knowledge? We do so on the basis of\nour knowledge of wood, chemical bonds, and the physical relations the\ntable can find itself in, such as having a giant bull elephant sit on\nit.\n\nAmie Thomasson (2021) contends that we should reject a widespread\ndescriptivist picture of modality. According to\ndescriptivism, the primary function of modal discourse is to track and\ndescribe modal facts and properties, which supposedly exist\nindependently of our expressive capacities and make true our modal\nstatements. Instead, according to Thomasson’s Modal\nNormativism (MN), modal discourse is distinctively\nnormative, in that it\n\n\nserves the function of expressing, teaching, conveying, or (re-)\nnegotiating semantic rules (or their consequences) in particularly\nadvantageous ways. (2021: S2087)\n\n\nPossibility and necessity are thus to be explained by reference to\nsemantic rules, not to some mind-independent modal reality. For\nexample, according to Thomasson, the fact that necessarily, all\nbachelors are unmarried shouldn’t be explained in terms of\nsome modal fact involving male humans that are bachelors; but rather\nin terms of the rules for correct application of the terms\n‘bachelor’ and ‘unmarried’; particularly, the\nrule that “One may only apply ‘bachelor’ where\n‘unmarried’ may be applied”. Once (MN) is in place,\nfor Thomasson we can then explain modal knowledge in a straightforward\nway. Speakers who can use the semantic rules correctly show\nimplicit modal knowledge. Whereas, speakers have\nexplicit modal knowledge when they develop the ability to\nexplicitly convey in the object language and indicative mood the\nsemantic rules: in our example, when they are able to express:\n“Necessarily, all bachelors are unmarried”. Importantly,\nfor Thomasson, we can still talk about modal truth. From the sentence\n“Necessarily, all bachelors are unmarried” we can infer\n“‘Necessarily, all bachelors are unmarried’ is\ntrue” by applying the (deflationist) equivalence schema\n“\\(\\langle p \\rangle\\) is true iff \\(p\\)” (see Thomasson\n2021).\nCritical Questions for Modalism and Normativism\n\nThe Completeness Question: On Bueno and\nShalkowski’s view we arrive at knowledge of modal propositions\nthrough knowledge of modal properties. But how do we gain knowledge of\nmodal properties in the first place? For Bueno and Shalkowski\nproperties are understood in a deflationary way, that is, they are not\ncharacterized in terms of universals or abstract entities. They are\nsimply traits of objects. We know that the vase is fragile because it\nis made out of glass and glass can be broken if struck. But\nknowledge of the fact that glass can be broken is itself modal\nknowledge. Hence, some knowledge of modal properties is yet\nto be accounted for.\n\nThe Scope Question and its Consequences: One might\nquestion whether Thomasson’s Modal Normativism succeeds in\nexplaining knowledge of metaphysical modality, particularly\nas opposed to conceptual modality or epistemic\nanalyticity. Arguably, mastering the semantic rules determining\nthe actual application conditions of, say, “water”, and\npossessing the relevant empirical information, won’t suffice to\nsettle whether it is metaphysically possible for water to be XYZ or\ncontain carbon. As a consequence, because of its sole focus on\nsemantic rules, Modal Normativism might imply that classical\nmetaphysical debates in philosophy are merely a matter of verbal\ndisagreement and negotiation. While it is not clear whether this\nconstitutes a problem, in the eyes of the modal normativist, it does\nraise an important point of disagreement. For example, are\nparticipants in the debate on the mind-body problem really discussing\nthe nature of consciousness in relation to the physical body or are\nthey just renegotiating our rules for “mind”,\n“body”, and “conscious” etc.? For some the\nmind-body problem is not about the words “mind” and\n“body” but about minds and bodies (for discussion, see\nMallozzi forthcoming b).\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Ásta Kristjana Sveinsdóttir, 2008,\n“Essentiality Conferred”, <em>Philosophical Studies</em>,\n140(1): 135–148. doi:10.1007/s11098-008-9230-4",
                "–––, 2010, “Siding with Euthyphro:\nResponse-Dependence and Conferred Properties”, <em>European\nJournal of Philosophy</em>, 18(1): 108–125.\ndoi:10.1111/j.1468-0378.2008.00303.x",
                "–––, 2013, “Knowledge of Essence: The\nConferralist Story”, <em>Philosophical Studies</em>, 166(1):\n21–32. doi:10.1007/s11098-012-0019-0",
                "Badura, Christopher and Amy Kind (eds.), 2021, <em>Epistemic Uses\nof Imagination</em>, (Routledge Studies in Contemporary Philosophy),\nNew York, NY: Routledge. doi:10.4324/9781003041979",
                "Barker, Stephen and Mark Jago, 2018, “Material Objects and\nEssential Bundle Theory”, <em>Philosophical Studies</em>,\n175(12): 2969–2986. doi:10.1007/s11098-017-0990-6",
                "Barnes, Gordon, 2002, “Conceivability, Explanation, and\nDefeat”, <em>Philosophical Studies</em>, 108(3): 327–338.\ndoi:10.1023/A:1015713218949",
                "Bealer, George, 1996, “<em>A Priori</em> Knowledge and the\nScope of Philosophy”, <em>Philosophical Studies</em>,\n81(2–3): 121–142. doi:10.1007/BF00372777",
                "–––, 1998, “Intuition and the Autonomy of\nPhilosophy”, in <em>Rethinking Intuition: The Psychology of\nIntuition and Its Role in Philosophical Inquiry</em>, Michael DePaul\nand William Ramsey (eds.), Indiana: Rowman and Littlefield,\n201–240.",
                "–––, 1999a, “The <em>A Priori</em>”,\nin <em>The Blackwell Guide to Epistemology</em>, John Greco and Ernest\nSosa (eds.), New York: Blackwell Publishing, 243–270.",
                "–––, 1999b, “A Theory Of The <em>A\nPriori</em>”, <em>Philosophical Perspectives</em>, 13:\n29–55. doi:10.1111/0029-4624.33.s13.2",
                "–––, 2002, “Modal Epistemology and the\nRationalist Renaissance”, in Gendler and Hawthorne 2002:\n71–125.",
                "–––, 2004, “The Origins of Modal\nError”, <em>Dialectica</em>, 58(1): 11–42.\ndoi:10.1111/j.1746-8361.2004.tb00290.x",
                "Bealer, George and P F. Strawson, 1992, “The Incoherence of\nEmpiricism”, <em>Aristotelian Society Supplementary Volume</em>,\n66(1): 99–144. doi:10.1093/aristoteliansupp/66.1.99",
                "Benacerraf, Paul, 1973, “Mathematical Truth”, <em>The\nJournal of Philosophy</em>, 70(19): 661–679.\ndoi:10.2307/2025075",
                "Berto, Francesco and Tom Schoonen, 2018, “Conceivability and\nPossibility: Some Dilemmas for Humeans”, <em>Synthese</em>,\n195(6): 2697–2715. doi:10.1007/s11229-017-1346-7",
                "Berto, Francesco, Rohan French, Graham Priest, and David Ripley,\n2018, “Williamson on Counterpossibles”, <em>Journal of\nPhilosophical Logic</em>, 47(4): 693–713.\ndoi:10.1007/s10992-017-9446-x",
                "Biggs, Stephen, 2011, “Abduction and Modality”,\n<em>Philosophy and Phenomenological Research</em>, 83(2):\n283–326. doi:10.1111/j.1933-1592.2010.00412.x",
                "–––, 2017, “Review of Modal Justification\nvia Theories, by Bob Fischer”, <em>Notre Dame Philosophical\nReviews</em>, 23 June 2017, URL =\n &lt;<a href=\"https://ndpr.nd.edu/reviews/modal-justification-via-theories-3/\" target=\"other\">https://ndpr.nd.edu/reviews/modal-justification-via-theories-3/</a>&gt;",
                "Biggs, Stephen and Jessica Wilson, 2021, “Abduction versus\nConceiving in Modal Epistemology”, <em>Synthese</em>, 198(S8):\nS2045–S2076. doi:10.1007/s11229-019-02117-9",
                "Boghossian, Paul Artin, 1996, “Analyticity\nReconsidered”, <em>Noûs</em>, 30(3): 360–391.\ndoi:10.2307/2216275",
                "–––, 2000, “Knowledge of Logic”, in\nBoghossian and Peacocke 2000: 229–254.\ndoi:10.1093/0199241279.003.0010",
                "–––, 2011, “Williamson on the <em>A\nPriori</em> and the Analytic”, <em>Philosophy and\nPhenomenological Research</em>, 82(2): 488–497.\ndoi:10.1111/j.1933-1592.2010.00395.x",
                "Boghossian, Paul and Christopher Peacocke (eds.), 2000, <em>New\nEssays on the A Priori</em>, Oxford: Oxford University Press.\ndoi:10.1093/0199241279.001.0001",
                "Boghossian, Paul and Timothy Williamson, 2020, <em>Debating the A\nPriori</em>, Oxford: Oxford University Press.\ndoi:10.1093/oso/9780198851707.001.0001",
                "BonJour, Laurence, 1997, <em>In Defense of Pure Reason: A\nRationalist Account of A Priori Justification</em>, Cambridge:\nCambridge University Press. doi:10.1017/CBO9780511625176",
                "Brogaard, Berit and Joe Salerno, 2013, “Remarks on\nCounterpossibles”, <em>Synthese</em>, 190(4): 639–660.\ndoi:10.1007/s11229-012-0196-6",
                "Bueno, Otávio and Scott A. Shalkowski, 2000, “A Plea\nfor a Modal Realist Epistemology”, <em>Acta Analytica</em>,\n15(24): 175–193.",
                "–––, 2015, “Modalism and Theoretical\nVirtues: Toward an Epistemology of Modality”, <em>Philosophical\nStudies</em>, 172(3): 671–689.\ndoi:10.1007/s11098-014-0327-7",
                "–––, 2020, <em>The Routledge Handbook of\nModality</em>, New York: Routledge. doi:10.4324/9781315742144",
                "Byrne, Alex, 2007, “Possibility and Imagination”,\n<em>Philosophical Perspectives</em>, 21(1): 125–144.\ndoi:10.1111/j.1520-8583.2007.00123.x",
                "Casullo, Albert, 1977, “The Definition of A Priori\nKnowledge”, <em>Philosophy and Phenomenological Research</em>,\n38(2): 220–224. doi:10.2307/2107163",
                "–––, 2010, “Knowledge and Modality”,\n<em>Synthese</em>, 172(3): 341–359.\ndoi:10.1007/s11229-008-9396-5",
                "–––, 2012a, “Conceivability and Modal\nKnowledge”, in his 2012c: 271–288.",
                "–––, 2012b, “Counterfactuals and Modal\nKnowledge”, in 2012c: 251–270.",
                "–––, 2012c, <em>Essays on A Priori Knowledge and\nJustification</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199777860.001.0001",
                "–––, 2013, “Articulating the A\nPriori–A Posteriori Distinction1”, in Casullo and Thurow\n2013: 248–271.\ndoi:10.1093/acprof:oso/9780199695331.003.0012",
                "–––, 2015, “Four Challenges to the a\nPriori—a Posteriori Distinction”, <em>Synthese</em>,\n192(9): 2701–2724. doi:10.1007/s11229-013-0341-x",
                "Casullo, Albert and Joshua C. Thurow (eds.), 2013, <em>The A\nPriori in Philosophy</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199695331.001.0001",
                "Chalmers, David J., 1996, <em>The Conscious Mind</em>, Oxford:\nOxford University Press.",
                "–––, 1999, “Materialism and the\nMetaphysics of Modality”, <em>Philosophy and Phenomenological\nResearch</em>, 59: 473–496.",
                "–––, 2002, “Does Conceivability Entail\nPossibility”, in Gendler and Hawthorne 2002: 145–200.",
                "–––, 2004, “Epistemic Two-Dimensional\nSemantics”, <em>Philosophical Studies</em>, 118(1/2):\n153–226. doi:10.1023/B:PHIL.0000019546.17135.e0",
                "–––, 2010, <em>The Character of\nConsciousness</em>, New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195311105.001.0001",
                "Chudnoff, Elijah, 2013, <em>Intuition</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199683000.001.0001",
                "Clarke-Doane, Justin, 2019a, “Modal Objectivity”,\n<em>Noûs</em>, 53 (2): 266–295",
                "–––, 2019b, “Metaphysical and absolute\npossibility”, <em>Synthese</em>, 198 (Supplement 8):\n1861–1872.",
                "Contim, Filipe Drapeau Vieira Contim and Sébastien Motta,\n2012, <em>Modal Matters</em>, special issue of <em>Philosophia\nScientiæ</em>, 16(2).",
                "Correia, Fabrice, 2007, “(Finean) Essence and (Priorean)\nModality”, <em>Dialectica</em>, 61(1): 63–84.\ndoi:10.1111/j.1746-8361.2006.01079.x",
                "Cowling, Sam, 2013, “The Modal View of Essence”,\n<em>Canadian Journal of Philosophy</em>, 43(2): 248–266.\ndoi:10.1080/00455091.2013.827395",
                "Craig, Edward, 1985, “Review of <em>Scepticism, Rules and\nLanguage</em>, by G. P. Baker and P. M. S. Hacker ”, <em>The\nPhilosophical Quarterly</em>, 35(139): 212–214.\ndoi:10.2307/2219352",
                "Currie, Gregory and Ian Ravenscroft, 2002, <em>Recreative\nMinds</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198238089.001.0001",
                "Della Rocca, Michael, 1996a, “Essentialism: Part 1”,\n<em>Philosophical Books</em>, 37(1): 1–13.\ndoi:10.1111/j.1468-0149.1996.tb02508.x",
                "–––, 1996b, “Essentialism: Part 2”,\n<em>Philosophical Books</em>, 37(2): 81–89.\ndoi:10.1111/j.1468-0149.1996.tb02954.x",
                "Deng, Duen-Min, 2016, “On the Alleged Knowledge of\nMetaphysical Modality”, <em>Philosophia</em>, 44:\n479–495.",
                "Devitt, Michael, 2021, “Defending Intrinsic Biological\nEssentialism”, <em>Philosophy of Science</em>, 88(1):\n67–82. doi:10.1086/710029",
                "Dumsday, Travis, 2012, “A New Argument For Intrinsic\nBiological Essentialism”, <em>The Philosophical Quarterly</em>,\n62(248): 486–504. doi:10.1111/j.1467-9213.2012.00048.x",
                "Ereshefsky, Marc, 2010, “What’s Wrong with the New\nBiological Essentialism”, <em>Philosophy of Science</em>, 77(5):\n674–685. doi:10.1086/656545",
                "Evnine, Simon, 2008, “Modal Epistemology: Our Knowledge of\nNecessity and Possibility”, <em>Philosophy Compass</em>, 3(4):\n664–684. doi:10.1111/j.1747-9991.2008.00147.x",
                "Fine, Kit, 1994, “Essence and Modality: The Second\nPhilosophical Perspectives Lecture”, <em>Philosophical\nPerspectives</em>, 8: 1–16. doi:10.2307/2214160",
                "Fischer, Bob [Robert], 2017, “Theory Selection in Modal\nEpistemology”, <em>American Philosophical Quarterly</em>, 52(4):\n381–395.",
                "–––, 2018, “C. I. Lewis and the Benacerraf\nProblem”, <em>Episteme</em>, 15(2): 154–165.\ndoi:10.1017/epi.2016.52",
                "Fischer, Bob and Felipe Leon (eds.), 2017, <em>Modal Epistemology\nAfter Rationalism</em>, (Synthese Library 378), Cham: Springer\nInternational Publishing. doi:10.1007/978-3-319-44309-6",
                "Geirsson, Hemir, 2005, “Conceivability and Defeasible Modal\nJustification”, <em>Philosophical Studies</em>, 122(3):\n279–304. doi:10.1007/s11098-005-6522-9",
                "Gendler, Tamar Szabó and John Hawthorne (eds.), 2002,\n<em>Conceivability and Possibility</em>, Oxford: Clarendon Press.",
                "Gibson, James J., 1966, <em>The Senses Considered as Perceptual\nSystems</em>, Boston: Houghton-Mifflin.",
                "–––, 1979, <em>The Ecological Approach to Visual\nPerception</em>. Boston: Houghton-Mifflin.",
                "Godman, Marion, Antonella Mallozzi, and David Papineau, 2020,\n“Essential Properties Are Super-Explanatory: Taming Metaphysical\nModality”, <em>Journal of the American Philosophical\nAssociation</em>, 6(3): 316–334. doi:10.1017/apa.2019.48",
                "Goff, Philip, 2021, “Essentialist Modal Rationalism”,\n<em>Synthese</em>, 198(S8): S2019–S2027.\ndoi:10.1007/s11229-019-02109-9",
                "Goodman, Nelson, 1955, <em>Fact, Fiction, and Forecast</em>,\nCambridge, MA: Harvard University Press.",
                "Gorman, Michael, 2005, “The Essential and the\nAccidental”, <em>Ratio</em>, 18(3): 276–289.\ndoi:10.1111/j.1467-9329.2005.00290.x",
                "Gregory, Dominic, 2004, “Imagining Possibilities”,\n<em>Philosophy and Phenomenological Research</em>, 69(2):\n327–348. doi:10.1111/j.1933-1592.2004.tb00397.x",
                "–––, 2010, “Conceivability and Apparent\nPossibility”, in <em>Modality. Metaphysics, Logic, and\nEpistemology</em>, Bob Hale and Aviv Hoffman (eds), Oxford: Oxford\nUniversity Press, 319–341.",
                "–––, 2017, “Counterfactual Reasoning and\nKnowledge of Possibilities”, <em>Philosophical Studies</em>,\n174(4): 821–835. doi:10.1007/s11098-016-0707-2",
                "–––, 2020, “Imagery and\nPossibility”, <em>Noûs</em>, 54(4): 755–773.\ndoi:10.1111/nous.12275",
                "Hale, Bob, 1996, “Absolute Necessities”,\n<em>Philosophical Perspectives</em>, 10: 93–117.\ndoi:10.2307/2216238",
                "–––, 2002, “The Source Of\nNecessity”, <em>Philosophical Perspectives</em>, 16::\n299–319. doi:10.1111/1468-0068.36.s16.11",
                "–––, 2003, “Knowledge of Possibility and\nof Necessity”, <em>Proceedings of the Aristotelian Society</em>,\n103: 1–20. doi:10.1111/j.0066-7372.2003.00061.x",
                "–––, 2012, “What is Absolute\nNecessity?”, <em>Philosophia Scientiæ</em>, 16(2):\n117–148. doi:10.4000/philosophiascientiae.743",
                "–––, 2013, <em>Necessary Beings: An Essay on\nOntology, Modality, and the Relations Between Them</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780199669578.001.0001",
                "–––, 2021, “Essence and Definition by\nAbstraction”, <em>Synthese</em>, 198(S8): S2001–S2017.\ndoi:10.1007/s11229-018-1726-7",
                "Hale, Bob and Crispin Wright, 2000, “Implicit Definition and\nthe A Priori”, in Boghossian and Peacocke 2000: 286–319.\ndoi:10.1093/0199241279.003.0012",
                "Hanrahan, Rebecca, 2017, “Imagination, Possibility, and\nPlovers”, in Fischer and Leon 2017, 197–220.\ndoi:10.1007/978-3-319-44309-6_11",
                "Hawthorne, John, 2007, “A Priority and Externalism”,\nin Sanford C. Goldberg (ed.), <em>Internalism and Externalism in\nSemantics and Epistemology</em>, Oxford: Oxford University Press,\n201–218.",
                "Hill, Christopher, 2006, “Modality, Modal Epistemology, and\nthe Metaphysics of Consciousness”, in Nichols 2006:\n205–236.",
                "Horvath, Joachim, 2014, “Lowe on Modal Knowledge”,\n<em>Thought: A Journal of Philosophy</em>, 3(3): 208–217.\ndoi:10.1002/tht3.135",
                "Howell, Robert, 2008, “The Two-Dimensionalist\nReductio”, <em>Pacific Philosophical Quarterly</em>, 89(3):\n348–358. doi: 10.1111/j.1468-0114.2008.00325.x",
                "Huemer, Michael, 2001, <em>Skepticism and the Veil of\nPerception</em>, Lanham, MD: Rowman and Littlefield.",
                "–––, 2005, <em>Ethical Intuitionism</em>,\nLondon: Palgrave Macmillan. doi:10.1057/9780230597051",
                "Husserl, Edmund, 1973, <em>Experience and Judgment. Investigations\nin a Genealogy of Logic</em>, revised and edited by Ludwig Landgrebe,\ntranslated by James S. Churchill and Karl Ameriks, London: Routledge\n&amp; Kegan Paul.",
                "Ichikawa, Jonathan and Benjamin Jarvis, 2012, “Rational\nImagination and Modal Knowledge: Rational Imagination and Modal\nKnowledge”, <em>Noûs</em>, 46(1): 127–158.\ndoi:10.1111/j.1468-0068.2010.00811.x",
                "Jackson, Frank, 2000, “Representation, Scepticism, and the A\nPriori”, in Boghossian and Peacocke 2000: 320–332.\ndoi:10.1093/0199241279.003.0013",
                "Jago, Mark, 2013, “Impossible Worlds”,\n<em>Noûs</em>, 47 (3): 713–728.",
                "–––, 2021, “Knowing How Things Might Have\nBeen”, <em>Synthese</em>, 198(S8): S1981–S1999.\ndoi:10.1007/s11229-018-1869-6",
                "Jenkins, Carrie S., 2008, “Modal Knowledge, Counterfactual\nKnowledge and the Role of Experience”, <em>The Philosophical\nQuarterly</em>, 58(233): 693–701.\ndoi:10.1111/j.1467-9213.2008.579.x",
                "Kment, Boris, 2014, <em>Modality and Explanatory Reasoning</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199604685.001.0001",
                "–––, 2021, “Essence and Modal\nKnowledge”, <em>Synthese</em>, 198(S8): S1957–S1979.\ndoi:10.1007/s11229-018-01903-1",
                "Kind, Amy, 2020, “Imaginative experience”, in Uriah\nKriegel (ed.), <em>The Oxford Handbook of Philosophy of\nConsciousness</em>, Oxford: Oxford University Press,.\n124–141.",
                "Kind, Amy and Peter Kung (eds.), 2016, <em>Knowledge Through\nImagination</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198716808.001.0001",
                "Koksvik, Ole, 2011, <em>Intuition</em>, Ph.D. Thesis, Canberra:\nAustralian National University.\n [<a href=\"https://www.koksvik.net/\" target=\"other\">Koksvik 2011 available online</a>].",
                "Kosslyn, Stephen M., Giorgio Ganis, and William L. Thompson, 2003,\n“Mental Imagery: Against the Nihilistic Hypothesis”,\n<em>Trends in Cognitive Sciences</em>, 7(3): 109–111.\ndoi:10.1016/S1364-6613(03)00025-1",
                "Kripke, Saul, 1971, “Identity and Necessity”, in\n<em>Identity and Individuation</em>, M.K. Munitz (ed.), New York: New\nYork University Press, 135–164.",
                "–––, 1980, <em>Naming and Necessity</em>,\nCambridge, MA: Harvard University Press.",
                "Kroedel, Thomas, 2012, “Counterfactuals and the Epistemology\nof Modality”, <em>Philosophers’ Imprint</em>, 12: art. 12.\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0012.012\" target=\"other\">Kroedel 2012 available online</a>]",
                "Kvanvig, Jonathan, 2009, “The Value of Understanding”,\nin D. Pritchard, A. Haddock, &amp; A. Millar (eds.), <em>Epistemic\nValue</em>, Oxford: Oxford University Press, 95–112.",
                "Kung, Peter, 2010, “Imagining as a Guide to\nPossibility”, <em>Philosophy and Phenomenological Research</em>,\n81(3): 620–663. doi:10.1111/j.1933-1592.2010.00377.x",
                "Lam, Derek, 2018, “Is Imagination Too Liberal for Modal\nEpistemology?”, <em>Synthese</em>, 195(5): 2155–2174.\ndoi:10.1007/s11229-017-1329-8",
                "Leech, Jessica, 2018, “Essence and Mere Necessity”,\n<em>Royal Institute of Philosophy Supplement</em>, 82: 309–332.\ndoi:10.1017/S1358246118000139",
                "Legg, Catherine, 2012, “The Hardness of the Iconic Must: Can\nPeirce’s Existential Graphs Assist Modal Epistemology?”,\n<em>Philosophia Mathematica</em>, 20(1): 1–24.\ndoi:10.1093/philmat/nkr005",
                "Legg, Catherine and James Franklin, 2017, “Perceiving\nNecessity”, <em>Pacific Philosophical Quarterly</em>, 98(3):\n320–343. doi:10.1111/papq.12133",
                "Leslie, Sarah-Jane, 2013, “Essence and Natural Kinds: When\nScience Meets Preschooler Intuition”, in <em>Oxford Studies in\nEpistemology, Volume 4</em>, Tamar Szabó Gendler and John\nHawthorne (eds.), Oxford: Oxford University Press, 108–165.\ndoi:10.1093/acprof:oso/9780199672707.003.0005",
                "Levin, Janet, 2007, “Can Modal Intuitions Be Evidence for\nEssentialist Claims?”, <em>Inquiry</em>, 50(3): 253–269.\ndoi:10.1080/00201740701356154",
                "Lewis, David, 1986, <em>On the Plurality of Worlds</em>, Oxford:\nBlackwell Press.",
                "Livingstone-Banks, Jonathan, 2017, “In Defence of Modal\nEssentialism”, <em>Inquiry</em>, 60(8): 816–838.\ndoi:10.1080/0020174X.2016.1276855",
                "Lowe, E. J., 2008, “Two Notions of Being: Entity and\nEssence”, <em>Royal Institute of Philosophy Supplement</em>, 62:\n23–48. doi:10.1017/S1358246108000568",
                "–––, 2012, “What Is the Source of Our\nKnowledge of Modal Truths?”, <em>Mind</em>, 121(484):\n919–950. doi:10.1093/mind/fzs122",
                "Mackie, Penelope, 2006, <em>How Things Might Have Been:\nIndividuals, Kinds, and Essential Properties</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/0199272204.001.0001",
                "–––, forthcoming, “Can Metaphysical\nModality be Based on Essence?”, in <em>Metaphysics, Meaning, and\nModality. Themes from Kit Fine</em>, Mircea Dumitru (ed.), New York\nand Oxford: Oxford University Press.",
                "Mallozzi, Antonella, 2021a, “Putting Modal Metaphysics\nFirst”, <em>Synthese</em>, 198(S8): S1937–S1956.\ndoi:10.1007/s11229-018-1828-2",
                "–––, 2021b, “Two Notions of Metaphysical\nModality”, <em>Synthese</em>, 198(S6): 1387–1408.\ndoi:10.1007/s11229-018-1702-2",
                "–––, 2021c, “Special Issue of Synthese on\nNew Directions in the Epistemology of Modality: Introduction”,\n<em>Synthese</em>, 198(S8): S1841–S1859.\ndoi:10.1007/s11229-019-02358-8",
                "–––, 2021d, “Imagination, Inference, and\nApriority”, in Badura and Kind 2021.",
                "–––, 2021e, “Superexplanations for\nCounterfactual Knowledge”, <em>Philosophical Studies</em>, 178\n(4): 1315–1337.",
                "–––, forthcoming a, “Is There an\n<em>Absolute</em> Modality?”, in Special Issue of\n<em>Inquiry</em> (<em>Pluralism, Relativism and Skepticism</em>), V.\nMitova and S. Salem (eds.)",
                "–––, forthcoming b, “Semantic Rules, Modal\nKnowledge, and Analyticity”, in Prelević and Vaidya\nforthcoming.",
                "Malmgren, Anna-Sara, 2011, “Rationalism and the Content of\nIntuitive Judgements”, <em>Mind</em>, 120(478): 263–327.\ndoi:10.1093/mind/fzr039",
                "Martínez, Manolo, 2013, “Ideal Negative\nConceivability and the Halting Problem”, <em>Erkenntnis</em>,\n78(5): 979–990. doi:10.1007/s10670-012-9363-x",
                "McLeod, Stephen K., 2005, “Modal Epistemology”,\n<em>Philosophical Books</em>, 46(3): 235–245.",
                "Menzies, Peter, 1998, “Possibility and Conceivability: A\nResponse-Dependent Account of Their Connections”, in\n<em>European Review of Philosophy</em>, Roberto Casati and Christine\nTappolet (eds), 3: 255–277.",
                "Michels, Robert, 2020, “Husserlian Eidetic Variation and\nObjectual Understanding as a Basis for an Epistemology of\nEssence”, <em>Logos &amp; Episteme</em>, 11(3): 333–353.\ndoi:10.5840/logos-episteme202011325",
                "Mizrahi, Moti and David R. Morrow, 2015, “Does\nConceivability Entail Metaphysical Possibility?”,\n<em>Ratio</em>, 28(1): 1–13. doi:10.1111/rati.12047",
                "Morato, Vittorio, 2019, “Conceivability, Counterfactual\nThinking and Philosophical Exceptionality of Modal Knowledge”,\n<em>Topoi</em>, 38(4): 821–833.\ndoi:10.1007/s11245-017-9464-x",
                "Nanay, Bence, 2011, “Do We See Apples as Edible?”,\n<em>Pacific Philosophical Quarterly</em>, 92(3): 305–322.\ndoi:10.1111/j.1468-0114.2011.01398.x",
                "–––, 2013, <em>Between Perception and\nAction</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199695379.001.0001",
                "Nichols, Shaun (ed.), 2006, <em>The Architecture of the\nImagination: New Essays on Pretence, Possibility, and Fiction</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199275731.001.0001",
                "Nolan, Daniel, 1997, “Impossible Worlds: A Modest\nApproach”, <em>Notre Dame Journal of Formal Logic</em>, 38(4):\n535–572. doi:10.1305/ndjfl/1039540769",
                "Noonan, Harold W., 2018, “The New Aristotelian\nEssentialists”, <em>Metaphysica</em>, 19(1): 87–93.\ndoi:10.1515/mp-2018-0004",
                "Nozick, Robert, 2001, <em>Invariances</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "Okasha, Samir, 2002, “Darwinian Metaphysics: Species and the\nQuestion of Essentialism”, <em>Synthese</em>, 131(2):\n191–213. doi:10.1023/A:1015731831011",
                "Peacocke, Christopher, 1999, <em>Being Known</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/0198238606.001.0001",
                "–––, 2002, “Principles for\nPossibilia”, <em>Noûs</em>, 36(3): 486–508.\ndoi:10.1111/1468-0068.00381",
                "–––, 2004, <em>The Realm of Reason</em>, Oxford:\nOxford University Press.",
                "–––, 2020, “Epistemology, the\nConstitutive, and the Principle-Based Account of Modality”, in\nBueno and Shalkowski 2020: 180–187.",
                "Prelević, Duško, 2015, “Modal Empiricism and\nKnowledge of De Re Possibilities: A Critique of Roca-Royes’\nAccount”, <em>Organon F: Medzinárodný Časopis\nPre Analytickú Filozofiu</em>, 22(4): 488–498.\n [<a href=\"http://www.klemens.sav.sk/fiusav/doc/organon/2015/4/488-498.pdf\" target=\"other\">Prelević 2015 available online</a>]",
                "Prelević, Duško and Anand Vaidya, forthcoming, <em>The\nEpistemology of Modality and Philosophical Methodology</em>, New York:\nRoutledge.",
                "Priest, Graham, 2021, “Metaphysical Necessity: A Skeptical\nPerspective”, <em>Synthese</em>, 198(S8): S1873–S1885.\ndoi:10.1007/s11229-018-1885-6",
                "Pust, Joel, 2000, <em>Intuitions as Evidence</em>, New York:\nRoutledge. doi:10.4324/9780203824122",
                "Quine, W.V.O., 1953 [1961], “Reference and Modality”,\nin his <em>From a Logical Point of View</em>, Cambridge, MA: MIT\nPress, 139–159. Second revised edition, 1961.",
                "–––, 1960, <em>Word and Object</em>, Cambridge,\nMA: MIT Press.",
                "Restall, Greg, 1997, “Ways Things Can’t Be”,\n<em>Notre Dame Journal of Formal Logic</em>, 38(4): 583–596.\ndoi:10.1305/ndjfl/1039540771",
                "Roca-Royes, Sònia, 2010, “Modal Epistemology, Modal\nConcepts and the Integration Challenge”, <em>Dialectica</em>,\n64(3): 335–361. doi:10.1111/j.1746-8361.2010.01236.x",
                "–––, 2011a, “Conceivability and De Re\nModal Knowledge”, <em>Noûs</em>, 45(1): 22–49.\ndoi:10.1111/j.1468-0068.2010.00757.x",
                "–––, 2011b, “Modal Knowledge and\nCounterfactual Knowledge”, <em>Logique et Analyse</em>, 54(216):\n537–552.",
                "–––, 2012, “Essentialist Blindness Would\nNot Preclude Counterfactual Knowledge”, <em>Philosophia\nScientiæ</em>, 16(2): 149–172.\ndoi:10.4000/philosophiascientiae.745",
                "–––, 2017, “Similarity and Possibility: An\nEpistemology of <em>de re</em> Possibility for Concrete\nEntities”, in Fischer and Leon 2017: 221–245.\ndoi:10.1007/978-3-319-44309-6_12",
                "–––, 2018, “Rethinking the Epistemology of\nModality for Abstracta”, in Ivette Fred-Rivera and Jessica Leech\n(eds.), <em>Being Necessary. Themes of Ontology and Modality from the\nWork of Bob Hale</em>, Oxford: Oxford University Press,\n245–265.",
                "–––, 2019, “Concepts and the Epistemology\nof Essence”, <em>Dialectica</em>, 73(1–2): 3–29.\ndoi:10.1111/1746-8361.12266",
                "–––, 2020, “The Integration\nChallenge”, in Bueno and Shalkowski 2020: 157–166.",
                "Romero, Carlos, 2019, “Modality is Not Explainable by\nEssence”, <em>The Philosophical Quarterly</em>, 69(274):\n121–141.",
                "Rosen, Gideon, 2015, “Real Definition”, <em>Analytic\nPhilosophy</em>, 56(3): 189–209. doi:10.1111/phib.12067",
                "Shoemaker, Sydney, 1998, “Causal and Metaphysical\nNecessity”, <em>Pacific Philosophical Quarterly</em>, 79(1):\n59–77. doi:10.1111/1468-0114.00050",
                "Sgaravatti, Daniele, 2016, “Is Knowledge of Essence Required\nfor Thinking about Something?”, <em>Dialectica</em>, 70(2):\n217–228. doi:10.1111/1746-8361.12141",
                "Sidelle, Alan, 1989, <em>Necessity, Essence, and\nIndividuation</em>, Ithaca, NY: Cornell University Press.",
                "Soames, Scott, 2004, <em>Reference and Description</em>,\nPrinceton, NJ: Princeton University Press.",
                "Sosa, Ernest, 2013, “Intuitions and Foundations”, in\nCasullo and Thurow 2013: 186–200.\ndoi:10.1093/acprof:oso/9780199695331.003.0009",
                "Stalnaker, Robert C., 2003, <em>Ways a World Might Be:\nMetaphysical and Anti-Metaphysical Essays</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/0199251487.001.0001",
                "Strohminger, Margot, 2015, “Perceptual Knowledge of\nNonactual Possibilities”, <em>Philosophical Perspectives</em>,\n29(1): 363–375. doi:10.1111/phpe.12069",
                "Strohminger, Margot and Juhani Yli-Vakkuri, 2017, “The\nEpistemology of Modality”, <em>Analysis</em>, 77(4):\n825–838. doi:10.1093/analys/anx058",
                "–––, 2018, “Moderate Modal\nSkepticism”, In <em>Knowledge, Belief, and God</em>, Matthew A.\nBenton, John Hawthorne, and Dani Rabinowitz (eds.), Oxford: Oxford\nUniversity Press, 302–321.",
                "Tahko, Tuomas E., 2012, “Counterfactuals and Modal\nEpistemology”, <em>Grazer Philosophische Studien</em>, 86:\n93–115. doi:10.1163/9789401209182_007",
                "–––, 2017, “Empirically-Informed Modal\nRationalism”, in Fischer and Leon 2017: 29–45.\ndoi:10.1007/978-3-319-44309-6_3",
                "–––, 2018 “The epistemology of\nessence”, in <em>Ontology, Modality, Mind: Themes from the\nMetaphysics of E. J. Lowe</em>, Alexander Carruth, Sophie Gibb, and\nJohn Heil (eds), Oxford: Oxford University Press, 93–110.",
                "Thomasson, Amie L., 2021, “How Can We Come to Know\nMetaphysical Modal Truths?”, <em>Synthese</em>, 198(S8):\nS2077–S2106. doi:10.1007/s11229-018-1841-5",
                "Vaidya, Anand Jayprakash, 2008, “Modal Rationalism and Modal\nMonism”, <em>Erkenntnis</em>, 68(2): 191–212.\ndoi:10.1007/s10670-007-9093-7",
                "–––, 2010, “Understanding and\nEssence”, <em>Philosophia</em>, 38(4): 811–833.\ndoi:10.1007/s11406-010-9243-z",
                "Vaidya, Anand Jayprakash and Michael Wallner, 2021, “The\nEpistemology of Modality and the Problem of Modal Epistemic\nFriction”, <em>Synthese</em>, 198(S8): S1909–S1935.\ndoi:10.1007/s11229-018-1860-2",
                "Van Cleve, James, 2018, “Brute Necessity”,\n<em>Philosophy Compass</em>, 13(9): e12516.\ndoi:10.1111/phc3.12516",
                "van Inwagen, Peter, 1998, “Modal Epistemology”,\n<em>Philosophical Studies</em>, 92(1/2): 67–84.\ndoi:10.1023/A:1017159501073",
                "Vetter, Barbara, 2015, <em>Potentiality: From Dispositions to\nModality</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198714316.001.0001",
                "–––, 2016, “Williamsonian Modal\nEpistemology, Possibility-Based”, <em>Canadian Journal of\nPhilosophy</em>, 46(4–5): 766–795.\ndoi:10.1080/00455091.2016.1170652",
                "–––, 2020, “Perceiving Potentiality: A\nMetaphysics for Affordances”, <em>Topoi</em>, 39(5):\n1177–1191. doi:10.1007/s11245-018-9618-5",
                "–––, forthcoming, “An Agency-Based\nApproach to Modal Epistemology”, in Prelević and Vaidya\nforthcoming.",
                "Wallner, Michael, 2020, “The Structure of Essentialist\nExplanations of Necessity”, <em>Thought: A Journal of\nPhilosophy</em>, 9(1): 4–13. doi:10.1002/tht3.436",
                "–––, forthcoming, “In Search of a\nStructurally Complete Epistemology of Essence”, in Prelević\nand Vaidya forthcoming.",
                "Wallner, Michael and Anand Vaidya, 2020, “Essence,\nExplanation, and Modality”, <em>Philosophy</em>, 95(4):\n419–445. doi:10.1017/S0031819120000200",
                "Weinberg, Jonathan, 2007, “How To Challenge Intuitions\nEmpirically Without Risking Skepticism”, <em>Midwest Studies in\nPhilosophy</em>, 31(1): 318–343.",
                "Williamson, Timothy, 2007, <em>The Philosophy of Philosophy</em>,\nOxford: Blackwell Publishing. doi:10.1002/9780470696675",
                "–––, 2013, “How Deep Is the Distinction\nbetween A Priori and A Posteriori Knowledge?1”, in Casullo and\nThurow 2013: 291–309.\ndoi:10.1093/acprof:oso/9780199695331.003.0014",
                "–––, 2016, “Modal Science”,\n<em>Canadian Journal of Philosophy</em>, 46(4–5): 453–492.\ndoi:10.1080/00455091.2016.1205851",
                "Wildman, Nathan, 2013, “Modality, Sparsity, and\nEssence”, <em>The Philosophical Quarterly</em>, 63(253):\n760–782. doi:10.1111/1467-9213.12059",
                "–––, 2021, “Against the Reduction of\nModality to Essence”, <em>Synthese</em>, 198(S6):\n1455–1471. doi:10.1007/s11229-017-1667-6",
                "Wilsch, Tobias, 2015, “The Nomological Account of\nGround”, <em>Philosophical Studies</em>, 172(12):\n3293–3312. doi:10.1007/s11098-015-0470-9",
                "–––, 2017, “Sophisticated Modal\nPrimitivism”, <em>Philosophical Issues</em>, 27(1):\n428–448. doi:10.1111/phis.12100",
                "–––, 2020, “Laws of Metaphysics”, in\n<em>The Routledge Handbook of Metaphysical Ground</em>, Michael J.\nRaven (ed.), New York: Routledge, 425–436.",
                "Wirling, Ylwa Sjölin, 2020, “Non‐uniformism about\nthe Epistemology of Modality: Strong and Weak”, <em>Analytic\nPhilosophy</em>, 61(2): 152–173. doi:10.1111/phib.12172",
                "Worley, Sara, 2003, “Conceivability, Possibility and\nPhysicalism”, <em>Analysis</em>, 63(1): 15–23.\ndoi:10.1093/analys/63.1.15",
                "Yablo, Stephen, 1993, “Is Conceivability a Guide to\nPossibility?”, <em>Philosophy and Phenomenological\nResearch</em>, 53(1): 1–42. doi:10.2307/2108052",
                "–––, 2006, “No Fools Cold: Notes on\nIllusions of Possibility”, in <em>Two-Dimensional\nSemantics</em>, Manuel García-Carpintero and Josep\nMacià, Oxford: Clarendon Press, 327–346.",
                "Yli-Vakkuri, Juhani, 2013, “Modal Skepticism and\nCounterfactual Knowledge”, <em>Philosophical Studies</em>,\n162(3): 605–623. doi:10.1007/s11098-011-9784-4",
                "Zalta, Edward N., 2006, “Essence and Modality”,\n<em>Mind</em>, 115(459): 659–694. doi:10.1093/mind/fzl659"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\"><!-- Icelandic name so by first name -->\n<li>Ásta Kristjana Sveinsdóttir, 2008,\n“Essentiality Conferred”, <em>Philosophical Studies</em>,\n140(1): 135–148. doi:10.1007/s11098-008-9230-4</li>\n<li>–––, 2010, “Siding with Euthyphro:\nResponse-Dependence and Conferred Properties”, <em>European\nJournal of Philosophy</em>, 18(1): 108–125.\ndoi:10.1111/j.1468-0378.2008.00303.x</li>\n<li>–––, 2013, “Knowledge of Essence: The\nConferralist Story”, <em>Philosophical Studies</em>, 166(1):\n21–32. doi:10.1007/s11098-012-0019-0</li>\n<li>Badura, Christopher and Amy Kind (eds.), 2021, <em>Epistemic Uses\nof Imagination</em>, (Routledge Studies in Contemporary Philosophy),\nNew York, NY: Routledge. doi:10.4324/9781003041979</li>\n<li>Barker, Stephen and Mark Jago, 2018, “Material Objects and\nEssential Bundle Theory”, <em>Philosophical Studies</em>,\n175(12): 2969–2986. doi:10.1007/s11098-017-0990-6</li>\n<li>Barnes, Gordon, 2002, “Conceivability, Explanation, and\nDefeat”, <em>Philosophical Studies</em>, 108(3): 327–338.\ndoi:10.1023/A:1015713218949</li>\n<li>Bealer, George, 1996, “<em>A Priori</em> Knowledge and the\nScope of Philosophy”, <em>Philosophical Studies</em>,\n81(2–3): 121–142. doi:10.1007/BF00372777</li>\n<li>–––, 1998, “Intuition and the Autonomy of\nPhilosophy”, in <em>Rethinking Intuition: The Psychology of\nIntuition and Its Role in Philosophical Inquiry</em>, Michael DePaul\nand William Ramsey (eds.), Indiana: Rowman and Littlefield,\n201–240.</li>\n<li>–––, 1999a, “The <em>A Priori</em>”,\nin <em>The Blackwell Guide to Epistemology</em>, John Greco and Ernest\nSosa (eds.), New York: Blackwell Publishing, 243–270.</li>\n<li>–––, 1999b, “A Theory Of The <em>A\nPriori</em>”, <em>Philosophical Perspectives</em>, 13:\n29–55. doi:10.1111/0029-4624.33.s13.2</li>\n<li>–––, 2002, “Modal Epistemology and the\nRationalist Renaissance”, in Gendler and Hawthorne 2002:\n71–125.</li>\n<li>–––, 2004, “The Origins of Modal\nError”, <em>Dialectica</em>, 58(1): 11–42.\ndoi:10.1111/j.1746-8361.2004.tb00290.x</li>\n<li>Bealer, George and P F. Strawson, 1992, “The Incoherence of\nEmpiricism”, <em>Aristotelian Society Supplementary Volume</em>,\n66(1): 99–144. doi:10.1093/aristoteliansupp/66.1.99</li>\n<li>Benacerraf, Paul, 1973, “Mathematical Truth”, <em>The\nJournal of Philosophy</em>, 70(19): 661–679.\ndoi:10.2307/2025075</li>\n<li>Berto, Francesco and Tom Schoonen, 2018, “Conceivability and\nPossibility: Some Dilemmas for Humeans”, <em>Synthese</em>,\n195(6): 2697–2715. doi:10.1007/s11229-017-1346-7</li>\n<li>Berto, Francesco, Rohan French, Graham Priest, and David Ripley,\n2018, “Williamson on Counterpossibles”, <em>Journal of\nPhilosophical Logic</em>, 47(4): 693–713.\ndoi:10.1007/s10992-017-9446-x</li>\n<li>Biggs, Stephen, 2011, “Abduction and Modality”,\n<em>Philosophy and Phenomenological Research</em>, 83(2):\n283–326. doi:10.1111/j.1933-1592.2010.00412.x</li>\n<li>–––, 2017, “Review of Modal Justification\nvia Theories, by Bob Fischer”, <em>Notre Dame Philosophical\nReviews</em>, 23 June 2017, URL =\n &lt;<a href=\"https://ndpr.nd.edu/reviews/modal-justification-via-theories-3/\" target=\"other\">https://ndpr.nd.edu/reviews/modal-justification-via-theories-3/</a>&gt;</li>\n<li>Biggs, Stephen and Jessica Wilson, 2021, “Abduction versus\nConceiving in Modal Epistemology”, <em>Synthese</em>, 198(S8):\nS2045–S2076. doi:10.1007/s11229-019-02117-9</li>\n<li>Boghossian, Paul Artin, 1996, “Analyticity\nReconsidered”, <em>Noûs</em>, 30(3): 360–391.\ndoi:10.2307/2216275</li>\n<li>–––, 2000, “Knowledge of Logic”, in\nBoghossian and Peacocke 2000: 229–254.\ndoi:10.1093/0199241279.003.0010</li>\n<li>–––, 2011, “Williamson on the <em>A\nPriori</em> and the Analytic”, <em>Philosophy and\nPhenomenological Research</em>, 82(2): 488–497.\ndoi:10.1111/j.1933-1592.2010.00395.x</li>\n<li>Boghossian, Paul and Christopher Peacocke (eds.), 2000, <em>New\nEssays on the A Priori</em>, Oxford: Oxford University Press.\ndoi:10.1093/0199241279.001.0001</li>\n<li>Boghossian, Paul and Timothy Williamson, 2020, <em>Debating the A\nPriori</em>, Oxford: Oxford University Press.\ndoi:10.1093/oso/9780198851707.001.0001</li>\n<li>BonJour, Laurence, 1997, <em>In Defense of Pure Reason: A\nRationalist Account of A Priori Justification</em>, Cambridge:\nCambridge University Press. doi:10.1017/CBO9780511625176</li>\n<li>Brogaard, Berit and Joe Salerno, 2013, “Remarks on\nCounterpossibles”, <em>Synthese</em>, 190(4): 639–660.\ndoi:10.1007/s11229-012-0196-6</li>\n<li>Bueno, Otávio and Scott A. Shalkowski, 2000, “A Plea\nfor a Modal Realist Epistemology”, <em>Acta Analytica</em>,\n15(24): 175–193.</li>\n<li>–––, 2015, “Modalism and Theoretical\nVirtues: Toward an Epistemology of Modality”, <em>Philosophical\nStudies</em>, 172(3): 671–689.\ndoi:10.1007/s11098-014-0327-7</li>\n<li>–––, 2020, <em>The Routledge Handbook of\nModality</em>, New York: Routledge. doi:10.4324/9781315742144</li>\n<li>Byrne, Alex, 2007, “Possibility and Imagination”,\n<em>Philosophical Perspectives</em>, 21(1): 125–144.\ndoi:10.1111/j.1520-8583.2007.00123.x</li>\n<li>Casullo, Albert, 1977, “The Definition of A Priori\nKnowledge”, <em>Philosophy and Phenomenological Research</em>,\n38(2): 220–224. doi:10.2307/2107163</li>\n<li>–––, 2010, “Knowledge and Modality”,\n<em>Synthese</em>, 172(3): 341–359.\ndoi:10.1007/s11229-008-9396-5</li>\n<li>–––, 2012a, “Conceivability and Modal\nKnowledge”, in his 2012c: 271–288.</li>\n<li>–––, 2012b, “Counterfactuals and Modal\nKnowledge”, in 2012c: 251–270.</li>\n<li>–––, 2012c, <em>Essays on A Priori Knowledge and\nJustification</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199777860.001.0001</li>\n<li>–––, 2013, “Articulating the A\nPriori–A Posteriori Distinction1”, in Casullo and Thurow\n2013: 248–271.\ndoi:10.1093/acprof:oso/9780199695331.003.0012</li>\n<li>–––, 2015, “Four Challenges to the a\nPriori—a Posteriori Distinction”, <em>Synthese</em>,\n192(9): 2701–2724. doi:10.1007/s11229-013-0341-x</li>\n<li>Casullo, Albert and Joshua C. Thurow (eds.), 2013, <em>The A\nPriori in Philosophy</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199695331.001.0001</li>\n<li>Chalmers, David J., 1996, <em>The Conscious Mind</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 1999, “Materialism and the\nMetaphysics of Modality”, <em>Philosophy and Phenomenological\nResearch</em>, 59: 473–496.</li>\n<li>–––, 2002, “Does Conceivability Entail\nPossibility”, in Gendler and Hawthorne 2002: 145–200.</li>\n<li>–––, 2004, “Epistemic Two-Dimensional\nSemantics”, <em>Philosophical Studies</em>, 118(1/2):\n153–226. doi:10.1023/B:PHIL.0000019546.17135.e0</li>\n<li>–––, 2010, <em>The Character of\nConsciousness</em>, New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195311105.001.0001</li>\n<li>Chudnoff, Elijah, 2013, <em>Intuition</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199683000.001.0001</li>\n<li>Clarke-Doane, Justin, 2019a, “Modal Objectivity”,\n<em>Noûs</em>, 53 (2): 266–295</li>\n<li>–––, 2019b, “Metaphysical and absolute\npossibility”, <em>Synthese</em>, 198 (Supplement 8):\n1861–1872.</li>\n<li>Contim, Filipe Drapeau Vieira Contim and Sébastien Motta,\n2012, <em>Modal Matters</em>, special issue of <em>Philosophia\nScientiæ</em>, 16(2).</li>\n<li>Correia, Fabrice, 2007, “(Finean) Essence and (Priorean)\nModality”, <em>Dialectica</em>, 61(1): 63–84.\ndoi:10.1111/j.1746-8361.2006.01079.x</li>\n<li>Cowling, Sam, 2013, “The Modal View of Essence”,\n<em>Canadian Journal of Philosophy</em>, 43(2): 248–266.\ndoi:10.1080/00455091.2013.827395</li>\n<li>Craig, Edward, 1985, “Review of <em>Scepticism, Rules and\nLanguage</em>, by G. P. Baker and P. M. S. Hacker ”, <em>The\nPhilosophical Quarterly</em>, 35(139): 212–214.\ndoi:10.2307/2219352</li>\n<li>Currie, Gregory and Ian Ravenscroft, 2002, <em>Recreative\nMinds</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198238089.001.0001</li>\n<li>Della Rocca, Michael, 1996a, “Essentialism: Part 1”,\n<em>Philosophical Books</em>, 37(1): 1–13.\ndoi:10.1111/j.1468-0149.1996.tb02508.x</li>\n<li>–––, 1996b, “Essentialism: Part 2”,\n<em>Philosophical Books</em>, 37(2): 81–89.\ndoi:10.1111/j.1468-0149.1996.tb02954.x</li>\n<li>Deng, Duen-Min, 2016, “On the Alleged Knowledge of\nMetaphysical Modality”, <em>Philosophia</em>, 44:\n479–495.</li>\n<li>Devitt, Michael, 2021, “Defending Intrinsic Biological\nEssentialism”, <em>Philosophy of Science</em>, 88(1):\n67–82. doi:10.1086/710029</li>\n<li>Dumsday, Travis, 2012, “A New Argument For Intrinsic\nBiological Essentialism”, <em>The Philosophical Quarterly</em>,\n62(248): 486–504. doi:10.1111/j.1467-9213.2012.00048.x</li>\n<li>Ereshefsky, Marc, 2010, “What’s Wrong with the New\nBiological Essentialism”, <em>Philosophy of Science</em>, 77(5):\n674–685. doi:10.1086/656545</li>\n<li>Evnine, Simon, 2008, “Modal Epistemology: Our Knowledge of\nNecessity and Possibility”, <em>Philosophy Compass</em>, 3(4):\n664–684. doi:10.1111/j.1747-9991.2008.00147.x</li>\n<li>Fine, Kit, 1994, “Essence and Modality: The Second\nPhilosophical Perspectives Lecture”, <em>Philosophical\nPerspectives</em>, 8: 1–16. doi:10.2307/2214160</li>\n<li>Fischer, Bob [Robert], 2017, “Theory Selection in Modal\nEpistemology”, <em>American Philosophical Quarterly</em>, 52(4):\n381–395.</li>\n<li>–––, 2018, “C. I. Lewis and the Benacerraf\nProblem”, <em>Episteme</em>, 15(2): 154–165.\ndoi:10.1017/epi.2016.52</li>\n<li>Fischer, Bob and Felipe Leon (eds.), 2017, <em>Modal Epistemology\nAfter Rationalism</em>, (Synthese Library 378), Cham: Springer\nInternational Publishing. doi:10.1007/978-3-319-44309-6</li>\n<li>Geirsson, Hemir, 2005, “Conceivability and Defeasible Modal\nJustification”, <em>Philosophical Studies</em>, 122(3):\n279–304. doi:10.1007/s11098-005-6522-9</li>\n<li>Gendler, Tamar Szabó and John Hawthorne (eds.), 2002,\n<em>Conceivability and Possibility</em>, Oxford: Clarendon Press.</li>\n<li>Gibson, James J., 1966, <em>The Senses Considered as Perceptual\nSystems</em>, Boston: Houghton-Mifflin.</li>\n<li>–––, 1979, <em>The Ecological Approach to Visual\nPerception</em>. Boston: Houghton-Mifflin.</li>\n<li>Godman, Marion, Antonella Mallozzi, and David Papineau, 2020,\n“Essential Properties Are Super-Explanatory: Taming Metaphysical\nModality”, <em>Journal of the American Philosophical\nAssociation</em>, 6(3): 316–334. doi:10.1017/apa.2019.48</li>\n<li>Goff, Philip, 2021, “Essentialist Modal Rationalism”,\n<em>Synthese</em>, 198(S8): S2019–S2027.\ndoi:10.1007/s11229-019-02109-9</li>\n<li>Goodman, Nelson, 1955, <em>Fact, Fiction, and Forecast</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Gorman, Michael, 2005, “The Essential and the\nAccidental”, <em>Ratio</em>, 18(3): 276–289.\ndoi:10.1111/j.1467-9329.2005.00290.x</li>\n<li>Gregory, Dominic, 2004, “Imagining Possibilities”,\n<em>Philosophy and Phenomenological Research</em>, 69(2):\n327–348. doi:10.1111/j.1933-1592.2004.tb00397.x</li>\n<li>–––, 2010, “Conceivability and Apparent\nPossibility”, in <em>Modality. Metaphysics, Logic, and\nEpistemology</em>, Bob Hale and Aviv Hoffman (eds), Oxford: Oxford\nUniversity Press, 319–341.</li>\n<li>–––, 2017, “Counterfactual Reasoning and\nKnowledge of Possibilities”, <em>Philosophical Studies</em>,\n174(4): 821–835. doi:10.1007/s11098-016-0707-2</li>\n<li>–––, 2020, “Imagery and\nPossibility”, <em>Noûs</em>, 54(4): 755–773.\ndoi:10.1111/nous.12275</li>\n<li>Hale, Bob, 1996, “Absolute Necessities”,\n<em>Philosophical Perspectives</em>, 10: 93–117.\ndoi:10.2307/2216238</li>\n<li>–––, 2002, “The Source Of\nNecessity”, <em>Philosophical Perspectives</em>, 16::\n299–319. doi:10.1111/1468-0068.36.s16.11</li>\n<li>–––, 2003, “Knowledge of Possibility and\nof Necessity”, <em>Proceedings of the Aristotelian Society</em>,\n103: 1–20. doi:10.1111/j.0066-7372.2003.00061.x</li>\n<li>–––, 2012, “What is Absolute\nNecessity?”, <em>Philosophia Scientiæ</em>, 16(2):\n117–148. doi:10.4000/philosophiascientiae.743</li>\n<li>–––, 2013, <em>Necessary Beings: An Essay on\nOntology, Modality, and the Relations Between Them</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780199669578.001.0001</li>\n<li>–––, 2021, “Essence and Definition by\nAbstraction”, <em>Synthese</em>, 198(S8): S2001–S2017.\ndoi:10.1007/s11229-018-1726-7</li>\n<li>Hale, Bob and Crispin Wright, 2000, “Implicit Definition and\nthe A Priori”, in Boghossian and Peacocke 2000: 286–319.\ndoi:10.1093/0199241279.003.0012</li>\n<li>Hanrahan, Rebecca, 2017, “Imagination, Possibility, and\nPlovers”, in Fischer and Leon 2017, 197–220.\ndoi:10.1007/978-3-319-44309-6_11</li>\n<li>Hawthorne, John, 2007, “A Priority and Externalism”,\nin Sanford C. Goldberg (ed.), <em>Internalism and Externalism in\nSemantics and Epistemology</em>, Oxford: Oxford University Press,\n201–218.</li>\n<li>Hill, Christopher, 2006, “Modality, Modal Epistemology, and\nthe Metaphysics of Consciousness”, in Nichols 2006:\n205–236.</li>\n<li>Horvath, Joachim, 2014, “Lowe on Modal Knowledge”,\n<em>Thought: A Journal of Philosophy</em>, 3(3): 208–217.\ndoi:10.1002/tht3.135</li>\n<li>Howell, Robert, 2008, “The Two-Dimensionalist\nReductio”, <em>Pacific Philosophical Quarterly</em>, 89(3):\n348–358. doi: 10.1111/j.1468-0114.2008.00325.x</li>\n<li>Huemer, Michael, 2001, <em>Skepticism and the Veil of\nPerception</em>, Lanham, MD: Rowman and Littlefield.</li>\n<li>–––, 2005, <em>Ethical Intuitionism</em>,\nLondon: Palgrave Macmillan. doi:10.1057/9780230597051</li>\n<li>Husserl, Edmund, 1973, <em>Experience and Judgment. Investigations\nin a Genealogy of Logic</em>, revised and edited by Ludwig Landgrebe,\ntranslated by James S. Churchill and Karl Ameriks, London: Routledge\n&amp; Kegan Paul.</li>\n<li>Ichikawa, Jonathan and Benjamin Jarvis, 2012, “Rational\nImagination and Modal Knowledge: Rational Imagination and Modal\nKnowledge”, <em>Noûs</em>, 46(1): 127–158.\ndoi:10.1111/j.1468-0068.2010.00811.x</li>\n<li>Jackson, Frank, 2000, “Representation, Scepticism, and the A\nPriori”, in Boghossian and Peacocke 2000: 320–332.\ndoi:10.1093/0199241279.003.0013</li>\n<li>Jago, Mark, 2013, “Impossible Worlds”,\n<em>Noûs</em>, 47 (3): 713–728.</li>\n<li>–––, 2021, “Knowing How Things Might Have\nBeen”, <em>Synthese</em>, 198(S8): S1981–S1999.\ndoi:10.1007/s11229-018-1869-6</li>\n<li>Jenkins, Carrie S., 2008, “Modal Knowledge, Counterfactual\nKnowledge and the Role of Experience”, <em>The Philosophical\nQuarterly</em>, 58(233): 693–701.\ndoi:10.1111/j.1467-9213.2008.579.x</li>\n<li>Kment, Boris, 2014, <em>Modality and Explanatory Reasoning</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199604685.001.0001</li>\n<li>–––, 2021, “Essence and Modal\nKnowledge”, <em>Synthese</em>, 198(S8): S1957–S1979.\ndoi:10.1007/s11229-018-01903-1</li>\n<li>Kind, Amy, 2020, “Imaginative experience”, in Uriah\nKriegel (ed.), <em>The Oxford Handbook of Philosophy of\nConsciousness</em>, Oxford: Oxford University Press,.\n124–141.</li>\n<li>Kind, Amy and Peter Kung (eds.), 2016, <em>Knowledge Through\nImagination</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198716808.001.0001</li>\n<li>Koksvik, Ole, 2011, <em>Intuition</em>, Ph.D. Thesis, Canberra:\nAustralian National University.\n [<a href=\"https://www.koksvik.net/\" target=\"other\">Koksvik 2011 available online</a>].</li>\n<li>Kosslyn, Stephen M., Giorgio Ganis, and William L. Thompson, 2003,\n“Mental Imagery: Against the Nihilistic Hypothesis”,\n<em>Trends in Cognitive Sciences</em>, 7(3): 109–111.\ndoi:10.1016/S1364-6613(03)00025-1</li>\n<li>Kripke, Saul, 1971, “Identity and Necessity”, in\n<em>Identity and Individuation</em>, M.K. Munitz (ed.), New York: New\nYork University Press, 135–164.</li>\n<li>–––, 1980, <em>Naming and Necessity</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Kroedel, Thomas, 2012, “Counterfactuals and the Epistemology\nof Modality”, <em>Philosophers’ Imprint</em>, 12: art. 12.\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0012.012\" target=\"other\">Kroedel 2012 available online</a>]</li>\n<li>Kvanvig, Jonathan, 2009, “The Value of Understanding”,\nin D. Pritchard, A. Haddock, &amp; A. Millar (eds.), <em>Epistemic\nValue</em>, Oxford: Oxford University Press, 95–112.</li>\n<li>Kung, Peter, 2010, “Imagining as a Guide to\nPossibility”, <em>Philosophy and Phenomenological Research</em>,\n81(3): 620–663. doi:10.1111/j.1933-1592.2010.00377.x</li>\n<li>Lam, Derek, 2018, “Is Imagination Too Liberal for Modal\nEpistemology?”, <em>Synthese</em>, 195(5): 2155–2174.\ndoi:10.1007/s11229-017-1329-8</li>\n<li>Leech, Jessica, 2018, “Essence and Mere Necessity”,\n<em>Royal Institute of Philosophy Supplement</em>, 82: 309–332.\ndoi:10.1017/S1358246118000139</li>\n<li>Legg, Catherine, 2012, “The Hardness of the Iconic Must: Can\nPeirce’s Existential Graphs Assist Modal Epistemology?”,\n<em>Philosophia Mathematica</em>, 20(1): 1–24.\ndoi:10.1093/philmat/nkr005</li>\n<li>Legg, Catherine and James Franklin, 2017, “Perceiving\nNecessity”, <em>Pacific Philosophical Quarterly</em>, 98(3):\n320–343. doi:10.1111/papq.12133</li>\n<li>Leslie, Sarah-Jane, 2013, “Essence and Natural Kinds: When\nScience Meets Preschooler Intuition”, in <em>Oxford Studies in\nEpistemology, Volume 4</em>, Tamar Szabó Gendler and John\nHawthorne (eds.), Oxford: Oxford University Press, 108–165.\ndoi:10.1093/acprof:oso/9780199672707.003.0005</li>\n<li>Levin, Janet, 2007, “Can Modal Intuitions Be Evidence for\nEssentialist Claims?”, <em>Inquiry</em>, 50(3): 253–269.\ndoi:10.1080/00201740701356154</li>\n<li>Lewis, David, 1986, <em>On the Plurality of Worlds</em>, Oxford:\nBlackwell Press.</li>\n<li>Livingstone-Banks, Jonathan, 2017, “In Defence of Modal\nEssentialism”, <em>Inquiry</em>, 60(8): 816–838.\ndoi:10.1080/0020174X.2016.1276855</li>\n<li>Lowe, E. J., 2008, “Two Notions of Being: Entity and\nEssence”, <em>Royal Institute of Philosophy Supplement</em>, 62:\n23–48. doi:10.1017/S1358246108000568</li>\n<li>–––, 2012, “What Is the Source of Our\nKnowledge of Modal Truths?”, <em>Mind</em>, 121(484):\n919–950. doi:10.1093/mind/fzs122</li>\n<li>Mackie, Penelope, 2006, <em>How Things Might Have Been:\nIndividuals, Kinds, and Essential Properties</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/0199272204.001.0001</li>\n<li>–––, forthcoming, “Can Metaphysical\nModality be Based on Essence?”, in <em>Metaphysics, Meaning, and\nModality. Themes from Kit Fine</em>, Mircea Dumitru (ed.), New York\nand Oxford: Oxford University Press.</li>\n<li>Mallozzi, Antonella, 2021a, “Putting Modal Metaphysics\nFirst”, <em>Synthese</em>, 198(S8): S1937–S1956.\ndoi:10.1007/s11229-018-1828-2</li>\n<li>–––, 2021b, “Two Notions of Metaphysical\nModality”, <em>Synthese</em>, 198(S6): 1387–1408.\ndoi:10.1007/s11229-018-1702-2</li>\n<li>–––, 2021c, “Special Issue of Synthese on\nNew Directions in the Epistemology of Modality: Introduction”,\n<em>Synthese</em>, 198(S8): S1841–S1859.\ndoi:10.1007/s11229-019-02358-8</li>\n<li>–––, 2021d, “Imagination, Inference, and\nApriority”, in Badura and Kind 2021.</li>\n<li>–––, 2021e, “Superexplanations for\nCounterfactual Knowledge”, <em>Philosophical Studies</em>, 178\n(4): 1315–1337.</li>\n<li>–––, forthcoming a, “Is There an\n<em>Absolute</em> Modality?”, in Special Issue of\n<em>Inquiry</em> (<em>Pluralism, Relativism and Skepticism</em>), V.\nMitova and S. Salem (eds.)</li>\n<li>–––, forthcoming b, “Semantic Rules, Modal\nKnowledge, and Analyticity”, in Prelević and Vaidya\nforthcoming.</li>\n<li>Malmgren, Anna-Sara, 2011, “Rationalism and the Content of\nIntuitive Judgements”, <em>Mind</em>, 120(478): 263–327.\ndoi:10.1093/mind/fzr039</li>\n<li>Martínez, Manolo, 2013, “Ideal Negative\nConceivability and the Halting Problem”, <em>Erkenntnis</em>,\n78(5): 979–990. doi:10.1007/s10670-012-9363-x</li>\n<li>McLeod, Stephen K., 2005, “Modal Epistemology”,\n<em>Philosophical Books</em>, 46(3): 235–245.</li>\n<li>Menzies, Peter, 1998, “Possibility and Conceivability: A\nResponse-Dependent Account of Their Connections”, in\n<em>European Review of Philosophy</em>, Roberto Casati and Christine\nTappolet (eds), 3: 255–277.</li>\n<li>Michels, Robert, 2020, “Husserlian Eidetic Variation and\nObjectual Understanding as a Basis for an Epistemology of\nEssence”, <em>Logos &amp; Episteme</em>, 11(3): 333–353.\ndoi:10.5840/logos-episteme202011325</li>\n<li>Mizrahi, Moti and David R. Morrow, 2015, “Does\nConceivability Entail Metaphysical Possibility?”,\n<em>Ratio</em>, 28(1): 1–13. doi:10.1111/rati.12047</li>\n<li>Morato, Vittorio, 2019, “Conceivability, Counterfactual\nThinking and Philosophical Exceptionality of Modal Knowledge”,\n<em>Topoi</em>, 38(4): 821–833.\ndoi:10.1007/s11245-017-9464-x</li>\n<li>Nanay, Bence, 2011, “Do We See Apples as Edible?”,\n<em>Pacific Philosophical Quarterly</em>, 92(3): 305–322.\ndoi:10.1111/j.1468-0114.2011.01398.x</li>\n<li>–––, 2013, <em>Between Perception and\nAction</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199695379.001.0001</li>\n<li>Nichols, Shaun (ed.), 2006, <em>The Architecture of the\nImagination: New Essays on Pretence, Possibility, and Fiction</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199275731.001.0001</li>\n<li>Nolan, Daniel, 1997, “Impossible Worlds: A Modest\nApproach”, <em>Notre Dame Journal of Formal Logic</em>, 38(4):\n535–572. doi:10.1305/ndjfl/1039540769</li>\n<li>Noonan, Harold W., 2018, “The New Aristotelian\nEssentialists”, <em>Metaphysica</em>, 19(1): 87–93.\ndoi:10.1515/mp-2018-0004</li>\n<li>Nozick, Robert, 2001, <em>Invariances</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>Okasha, Samir, 2002, “Darwinian Metaphysics: Species and the\nQuestion of Essentialism”, <em>Synthese</em>, 131(2):\n191–213. doi:10.1023/A:1015731831011</li>\n<li>Peacocke, Christopher, 1999, <em>Being Known</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/0198238606.001.0001</li>\n<li>–––, 2002, “Principles for\nPossibilia”, <em>Noûs</em>, 36(3): 486–508.\ndoi:10.1111/1468-0068.00381</li>\n<li>–––, 2004, <em>The Realm of Reason</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2020, “Epistemology, the\nConstitutive, and the Principle-Based Account of Modality”, in\nBueno and Shalkowski 2020: 180–187.</li>\n<li>Prelević, Duško, 2015, “Modal Empiricism and\nKnowledge of De Re Possibilities: A Critique of Roca-Royes’\nAccount”, <em>Organon F: Medzinárodný Časopis\nPre Analytickú Filozofiu</em>, 22(4): 488–498.\n [<a href=\"http://www.klemens.sav.sk/fiusav/doc/organon/2015/4/488-498.pdf\" target=\"other\">Prelević 2015 available online</a>]</li>\n<li>Prelević, Duško and Anand Vaidya, forthcoming, <em>The\nEpistemology of Modality and Philosophical Methodology</em>, New York:\nRoutledge.</li>\n<li>Priest, Graham, 2021, “Metaphysical Necessity: A Skeptical\nPerspective”, <em>Synthese</em>, 198(S8): S1873–S1885.\ndoi:10.1007/s11229-018-1885-6</li>\n<li>Pust, Joel, 2000, <em>Intuitions as Evidence</em>, New York:\nRoutledge. doi:10.4324/9780203824122</li>\n<li>Quine, W.V.O., 1953 [1961], “Reference and Modality”,\nin his <em>From a Logical Point of View</em>, Cambridge, MA: MIT\nPress, 139–159. Second revised edition, 1961.</li>\n<li>–––, 1960, <em>Word and Object</em>, Cambridge,\nMA: MIT Press.</li>\n<li>Restall, Greg, 1997, “Ways Things Can’t Be”,\n<em>Notre Dame Journal of Formal Logic</em>, 38(4): 583–596.\ndoi:10.1305/ndjfl/1039540771</li>\n<li>Roca-Royes, Sònia, 2010, “Modal Epistemology, Modal\nConcepts and the Integration Challenge”, <em>Dialectica</em>,\n64(3): 335–361. doi:10.1111/j.1746-8361.2010.01236.x</li>\n<li>–––, 2011a, “Conceivability and De Re\nModal Knowledge”, <em>Noûs</em>, 45(1): 22–49.\ndoi:10.1111/j.1468-0068.2010.00757.x</li>\n<li>–––, 2011b, “Modal Knowledge and\nCounterfactual Knowledge”, <em>Logique et Analyse</em>, 54(216):\n537–552.</li>\n<li>–––, 2012, “Essentialist Blindness Would\nNot Preclude Counterfactual Knowledge”, <em>Philosophia\nScientiæ</em>, 16(2): 149–172.\ndoi:10.4000/philosophiascientiae.745</li>\n<li>–––, 2017, “Similarity and Possibility: An\nEpistemology of <em>de re</em> Possibility for Concrete\nEntities”, in Fischer and Leon 2017: 221–245.\ndoi:10.1007/978-3-319-44309-6_12</li>\n<li>–––, 2018, “Rethinking the Epistemology of\nModality for Abstracta”, in Ivette Fred-Rivera and Jessica Leech\n(eds.), <em>Being Necessary. Themes of Ontology and Modality from the\nWork of Bob Hale</em>, Oxford: Oxford University Press,\n245–265.</li>\n<li>–––, 2019, “Concepts and the Epistemology\nof Essence”, <em>Dialectica</em>, 73(1–2): 3–29.\ndoi:10.1111/1746-8361.12266</li>\n<li>–––, 2020, “The Integration\nChallenge”, in Bueno and Shalkowski 2020: 157–166.</li>\n<li>Romero, Carlos, 2019, “Modality is Not Explainable by\nEssence”, <em>The Philosophical Quarterly</em>, 69(274):\n121–141.</li>\n<li>Rosen, Gideon, 2015, “Real Definition”, <em>Analytic\nPhilosophy</em>, 56(3): 189–209. doi:10.1111/phib.12067</li>\n<li>Shoemaker, Sydney, 1998, “Causal and Metaphysical\nNecessity”, <em>Pacific Philosophical Quarterly</em>, 79(1):\n59–77. doi:10.1111/1468-0114.00050</li>\n<li>Sgaravatti, Daniele, 2016, “Is Knowledge of Essence Required\nfor Thinking about Something?”, <em>Dialectica</em>, 70(2):\n217–228. doi:10.1111/1746-8361.12141</li>\n<li>Sidelle, Alan, 1989, <em>Necessity, Essence, and\nIndividuation</em>, Ithaca, NY: Cornell University Press.</li>\n<li>Soames, Scott, 2004, <em>Reference and Description</em>,\nPrinceton, NJ: Princeton University Press.</li>\n<li>Sosa, Ernest, 2013, “Intuitions and Foundations”, in\nCasullo and Thurow 2013: 186–200.\ndoi:10.1093/acprof:oso/9780199695331.003.0009</li>\n<li>Stalnaker, Robert C., 2003, <em>Ways a World Might Be:\nMetaphysical and Anti-Metaphysical Essays</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/0199251487.001.0001</li>\n<li>Strohminger, Margot, 2015, “Perceptual Knowledge of\nNonactual Possibilities”, <em>Philosophical Perspectives</em>,\n29(1): 363–375. doi:10.1111/phpe.12069</li>\n<li>Strohminger, Margot and Juhani Yli-Vakkuri, 2017, “The\nEpistemology of Modality”, <em>Analysis</em>, 77(4):\n825–838. doi:10.1093/analys/anx058</li>\n<li>–––, 2018, “Moderate Modal\nSkepticism”, In <em>Knowledge, Belief, and God</em>, Matthew A.\nBenton, John Hawthorne, and Dani Rabinowitz (eds.), Oxford: Oxford\nUniversity Press, 302–321.</li>\n<li>Tahko, Tuomas E., 2012, “Counterfactuals and Modal\nEpistemology”, <em>Grazer Philosophische Studien</em>, 86:\n93–115. doi:10.1163/9789401209182_007</li>\n<li>–––, 2017, “Empirically-Informed Modal\nRationalism”, in Fischer and Leon 2017: 29–45.\ndoi:10.1007/978-3-319-44309-6_3</li>\n<li>–––, 2018 “The epistemology of\nessence”, in <em>Ontology, Modality, Mind: Themes from the\nMetaphysics of E. J. Lowe</em>, Alexander Carruth, Sophie Gibb, and\nJohn Heil (eds), Oxford: Oxford University Press, 93–110.</li>\n<li>Thomasson, Amie L., 2021, “How Can We Come to Know\nMetaphysical Modal Truths?”, <em>Synthese</em>, 198(S8):\nS2077–S2106. doi:10.1007/s11229-018-1841-5</li>\n<li>Vaidya, Anand Jayprakash, 2008, “Modal Rationalism and Modal\nMonism”, <em>Erkenntnis</em>, 68(2): 191–212.\ndoi:10.1007/s10670-007-9093-7</li>\n<li>–––, 2010, “Understanding and\nEssence”, <em>Philosophia</em>, 38(4): 811–833.\ndoi:10.1007/s11406-010-9243-z</li>\n<li>Vaidya, Anand Jayprakash and Michael Wallner, 2021, “The\nEpistemology of Modality and the Problem of Modal Epistemic\nFriction”, <em>Synthese</em>, 198(S8): S1909–S1935.\ndoi:10.1007/s11229-018-1860-2</li>\n<li>Van Cleve, James, 2018, “Brute Necessity”,\n<em>Philosophy Compass</em>, 13(9): e12516.\ndoi:10.1111/phc3.12516</li>\n<li>van Inwagen, Peter, 1998, “Modal Epistemology”,\n<em>Philosophical Studies</em>, 92(1/2): 67–84.\ndoi:10.1023/A:1017159501073</li>\n<li>Vetter, Barbara, 2015, <em>Potentiality: From Dispositions to\nModality</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198714316.001.0001</li>\n<li>–––, 2016, “Williamsonian Modal\nEpistemology, Possibility-Based”, <em>Canadian Journal of\nPhilosophy</em>, 46(4–5): 766–795.\ndoi:10.1080/00455091.2016.1170652</li>\n<li>–––, 2020, “Perceiving Potentiality: A\nMetaphysics for Affordances”, <em>Topoi</em>, 39(5):\n1177–1191. doi:10.1007/s11245-018-9618-5</li>\n<li>–––, forthcoming, “An Agency-Based\nApproach to Modal Epistemology”, in Prelević and Vaidya\nforthcoming.</li>\n<li>Wallner, Michael, 2020, “The Structure of Essentialist\nExplanations of Necessity”, <em>Thought: A Journal of\nPhilosophy</em>, 9(1): 4–13. doi:10.1002/tht3.436</li>\n<li>–––, forthcoming, “In Search of a\nStructurally Complete Epistemology of Essence”, in Prelević\nand Vaidya forthcoming.</li>\n<li>Wallner, Michael and Anand Vaidya, 2020, “Essence,\nExplanation, and Modality”, <em>Philosophy</em>, 95(4):\n419–445. doi:10.1017/S0031819120000200</li>\n<li>Weinberg, Jonathan, 2007, “How To Challenge Intuitions\nEmpirically Without Risking Skepticism”, <em>Midwest Studies in\nPhilosophy</em>, 31(1): 318–343.</li>\n<li>Williamson, Timothy, 2007, <em>The Philosophy of Philosophy</em>,\nOxford: Blackwell Publishing. doi:10.1002/9780470696675</li>\n<li>–––, 2013, “How Deep Is the Distinction\nbetween A Priori and A Posteriori Knowledge?1”, in Casullo and\nThurow 2013: 291–309.\ndoi:10.1093/acprof:oso/9780199695331.003.0014</li>\n<li>–––, 2016, “Modal Science”,\n<em>Canadian Journal of Philosophy</em>, 46(4–5): 453–492.\ndoi:10.1080/00455091.2016.1205851</li>\n<li>Wildman, Nathan, 2013, “Modality, Sparsity, and\nEssence”, <em>The Philosophical Quarterly</em>, 63(253):\n760–782. doi:10.1111/1467-9213.12059</li>\n<li>–––, 2021, “Against the Reduction of\nModality to Essence”, <em>Synthese</em>, 198(S6):\n1455–1471. doi:10.1007/s11229-017-1667-6</li>\n<li>Wilsch, Tobias, 2015, “The Nomological Account of\nGround”, <em>Philosophical Studies</em>, 172(12):\n3293–3312. doi:10.1007/s11098-015-0470-9</li>\n<li>–––, 2017, “Sophisticated Modal\nPrimitivism”, <em>Philosophical Issues</em>, 27(1):\n428–448. doi:10.1111/phis.12100</li>\n<li>–––, 2020, “Laws of Metaphysics”, in\n<em>The Routledge Handbook of Metaphysical Ground</em>, Michael J.\nRaven (ed.), New York: Routledge, 425–436.</li>\n<li>Wirling, Ylwa Sjölin, 2020, “Non‐uniformism about\nthe Epistemology of Modality: Strong and Weak”, <em>Analytic\nPhilosophy</em>, 61(2): 152–173. doi:10.1111/phib.12172</li>\n<li>Worley, Sara, 2003, “Conceivability, Possibility and\nPhysicalism”, <em>Analysis</em>, 63(1): 15–23.\ndoi:10.1093/analys/63.1.15</li>\n<li>Yablo, Stephen, 1993, “Is Conceivability a Guide to\nPossibility?”, <em>Philosophy and Phenomenological\nResearch</em>, 53(1): 1–42. doi:10.2307/2108052</li>\n<li>–––, 2006, “No Fools Cold: Notes on\nIllusions of Possibility”, in <em>Two-Dimensional\nSemantics</em>, Manuel García-Carpintero and Josep\nMacià, Oxford: Clarendon Press, 327–346.</li>\n<li>Yli-Vakkuri, Juhani, 2013, “Modal Skepticism and\nCounterfactual Knowledge”, <em>Philosophical Studies</em>,\n162(3): 605–623. doi:10.1007/s11098-011-9784-4</li>\n<li>Zalta, Edward N., 2006, “Essence and Modality”,\n<em>Mind</em>, 115(459): 659–694. doi:10.1093/mind/fzl659</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Anselm of Canterbury [Anselm of Bec]",
            "a priori justification and knowledge",
            "Berkeley, George",
            "Descartes, René: modal metaphysics",
            "essential vs. accidental properties",
            "experimental philosophy",
            "grounding, metaphysical",
            "Husserl, Edmund",
            "imagination",
            "intuition",
            "Locke, John: on real essence",
            "logic: modal",
            "mathematics, philosophy of: Platonism",
            "modality: medieval theories of",
            "possible worlds",
            "rigid designators",
            "semantics: two-dimensional",
            "zombies"
        ],
        "entry_link": [
            {
                "../anselm/": "Anselm of Canterbury [Anselm of Bec]"
            },
            {
                "../apriori/": "a priori justification and knowledge"
            },
            {
                "../berkeley/": "Berkeley, George"
            },
            {
                "../descartes-modal/": "Descartes, René: modal metaphysics"
            },
            {
                "../essential-accidental/": "essential vs. accidental properties"
            },
            {
                "../experimental-philosophy/": "experimental philosophy"
            },
            {
                "../grounding/": "grounding, metaphysical"
            },
            {
                "../husserl/": "Husserl, Edmund"
            },
            {
                "../imagination/": "imagination"
            },
            {
                "../intuition/": "intuition"
            },
            {
                "../real-essence/": "Locke, John: on real essence"
            },
            {
                "../logic-modal/": "logic: modal"
            },
            {
                "../platonism-mathematics/": "mathematics, philosophy of: Platonism"
            },
            {
                "../modality-medieval/": "modality: medieval theories of"
            },
            {
                "../possible-worlds/": "possible worlds"
            },
            {
                "../rigid-designators/": "rigid designators"
            },
            {
                "../two-dimensional-semantics/": "semantics: two-dimensional"
            },
            {
                "../zombies/": "zombies"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=modality-epistemology\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/modality-epistemology/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=modality-epistemology&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/modality-epistemology/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=modality-epistemology": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/modality-epistemology/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=modality-epistemology&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/modality-epistemology/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://philpapers.org/browse/modal-epistemology\" target=\"other\">PhilPapers Link for The Epistemology of Modality Bibliography</a>"
        ],
        "listed_links": [
            {
                "http://philpapers.org/browse/modal-epistemology": "PhilPapers Link for The Epistemology of Modality Bibliography"
            }
        ]
    }
}